{"title": "Pearl Harbor", "film_link": "/Movie Scripts/Pearl Harbor Script.html", "script_link": "/scripts/Pearl-Harbor.html", "info_raw": "\n\nPearl Harbor Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (6.46 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Randall Wallace\nGenres  Action  Drama  Romance  War\n\nRead \"Pearl Harbor\" Script\n\n\n", "script": "\n\n\n      PEARL HARBOR - by Randall Wallace\n\n\n   \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                         PEARL HARBOR\n\n\n                              by\n\n                        Randall Wallace\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                          EARLY DRAFT\n\n\n\n\n\n\n\n\n\tOut of BLACK we hear the sound of an airplane roaring by.\n\n\tEXT.  POV OF AN AIRPLANE\n\n\tFlying over American heartland.  We see the earth through the\n\tpilot's perspective as sky and ground swap positions, the\n\tplane swooping down and storming over the ground.\n\n\tTHE PLANE\n\n\tis a biplane, racing over a field lush with young plants.  It\n\treleases a trail of crop spray, and climbs again...\n\n\tUp into a crystalline blue sky where sunshine pours like\n\thoney over family farms stretching to the horizon.  Maybe\n\tit's not heaven, maybe it's just Tennessee.  But as long as\n\tthere's been an America, men have fought and died for this\n\tplace -- as volunteers.\n\n\tFar off, but visible from the plane is\n\n\tA BARN - DAY\n\n\tThe barn is unpainted except for hand lettering that says\n\t\"McCawley Crop Dusting.\" Another plane noise, this one made\n\tby kids, brings us to TWO BOYS, sitting in the shell of an\n\told plane propped on crates, scavenged of it's engine, seats,\n\tand wheels.\n\n\tThe boys sit in it's cockpit, butts crowded onto the nail keg\n\tthey've replaced the seat with.  They've even attached a 2x4\n\tas propeller, as if their imaginations needed any help.  They\n\twear overalls and have bowl haircuts:  RAFE and DANNY, 10\n\tyears old.\n\n\t\t\t\t\tRAFE\n\t\t\tBandits at 2 o'clock.\n\n\t\t\t\t\tDANNY\n\t\t\tPower dive!\n\n\tThey buzz their lips in a flying noise and work the controls,\n\tRafe's bare feet on one pedal, Danny's on the other.\n\n\t\t\t\t\tRAFE\n\t\t\tIt's Germans!\n\n\t\t\t\t\tDANNY\n\t\t\tKill the bastards!\n\n\tRafe looks at Danny in shock -- then they both laugh and go\n\tright back into their game, manufacturing their own machine\n\tgun and engine sounds.\n\n\t\t\t\t\tRAFE\n\t\t\tGood shooting, Danny!\n\n\t\t\t\t\tDANNY\n\t\t\tGood shooting, Rafe!\n\n\t\t\t\t\tRAFE\n\t\t\tLand of the free...\n\n\t\t\t\t\tDANNY\n\t\t\tHome of the brave!\n\n\t\t\t\t\tRAFE\n\t\t\tThere's another one!\n\n\tTheir vocal motors roar again... But a man's hand grabs Danny\n\tby the straps of his overalls and jerks him from the cockpit.\n\n\tIt's Danny's FATHER and he's a fearsome sight; drunk, his\n\thair uncombed, his face unshaven, his teeth -- those still\n\tleft -- are rotting.  He's also missing an arm; but the one\n\tthat's left is potent, and he's shaking Danny with it.\n\n\t\t\t\t\tDANNY'S FATHER\n\t\t\tYou no count boy!  Johnson come lookin',\n\t\t\tsaid he'd pay a dime for you to shovel\n\t\t\this pig shed, and I can't find you no\n\t\t\tplace.\n\n\t\t\t\t\tDANNY\n\t\t\tDaddy, I told you I was comin' here.\n\n\tHis father slaps him off his feet.  Rafe is so horrified he\n\tcan't get a sound out.  Danny isn't even surprised.  But when\n\this father snatches him up again, twisting the overall straps\n\tso tight they choke him, he struggles.  It does no good; his\n\tfather starts marching across the field, dragging and\n\tstrangling Danny.\n\n\t\t\t\t\tDANNY\n\t\t\tDa!... Dad...\n\n\tThe father's drunken anger makes him oblivious -- until\n\tCRACK!  The 2x4 propeller slams him across the back, knocking\n\thim to the ground and making him drop Danny.\n\n\tThe father rolls over to see 10-year-old Rafe, holding the\n\t2x4 like a bat.\n\n\t\t\t\t\tRAFE\n\t\t\tLet him alone!\n\n\tThe father's eyes bulge in rage; he struggles to his feet.\n\n\t\t\t\t\tDANNY\n\t\t\tRafe... Daddy... No!\n\n\tThe man looks murderous, but Rafe draws back the board.\n\n\t\t\t\t\tRAFE\n\t\t\tI'll bust you open, you...German!\n\n\tThe words ring something deep in the man's booze-broken\n\tbrain.  He begins to cough, convulsively; it brings a blossom\n\tof blood to his mouth.  He wipes it with his hand, but blood\n\tclings to his teeth.  He chokes out --\n\n\t\t\t\t\tDANNY'S FATHER\n\t\t\tI fought the Germans.\n\n\tHe looks at Danny in shame, with the realization of what he's\n\tjust done.  He turns and staggers away.\n\n\tDanny looks at Rafe -- a communication between boys joined by\n\tsomething deeper than blood.  Then Danny runs off after his\n\tfather.\n\n\t\t\t\t\tDANNY\n\t\t\tDaddy!  Daddy!  Wait.\n\n\tDanny catches him, takes his father's hand, and walks away\n\twith him.\n\n\tThe crop duster we saw in the air has just landed, behind\n\tRafe.  The pilot, RAFE'S FATHER, shuts off the engine.\n\n\t\t\t\t\tRAFE'S FATHER\n\t\t\tWhat's goin' on, son?\n\n\t\t\t\t\tRAFE\n\t\t\tNothing.  Danny's Dad just come to get\n\t\t\thim.\n\n\tRafe turns back to the ramshackle plane and replaces the 2x4\n\tpropeller.  His father looks toward Danny and his father,\n\twalking away, then looks at his own son.\n\n\t\t\t\t\tRAFE'S FATHER\n\t\t\tHey, boy -- you wanna go up?\n\n\tRafe can't believe it; he runs to the plane and hops into his\n\tfather's lap.  As his father cranks the engine and tucks him\n\tinto the harness, Rafe says --\n\n\t\t\t\t\tRAFE\n\t\t\tDaddy, sometime will you take Danny up\n\t\t\ttoo?\n\n\t\t\t\t\tRAFE'S FATHER\n\t\t\tSure will, son.\n\n\tThe engine races to life...and we --\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\n\tEXT.  NEW JERSEY AIR BASE - DAY\n\n\tAmerican P-40 fighters blast through the air, props screaming\n\tand wind singing by their wings.\n\n\tThere are eight pilots in their individual seats, and we\n\tfocus on two:  RAFE MCCAWLEY has grown lean and handsome.\n\tAnd DANNY WALKER is very much the same.\n\n\tTheir planes start swapping positions in the formation; while\n\tthe other guys are flying along in a tight line, Rafe and\n\tDanny are playing, one of them gunning his engine to go high,\n\tthe other diving and coming back up in his place,\n\tleapfrogging.\n\n\tIt scares the other guys, having their planes flashing in and\n\tout, so close.  The TRAINING CAPTAIN, watching through\n\tbinoculars on the ground, talks into his RADIO --\n\n\t\t\t\t\tTRAINING CAPTAIN\n\t\t\tMcCawley!  Walker!  Cut that out!\n\n\t\t\t\t\tRAFE\n\t\t\tI thought this was a training flight.\n\t\t\tI'm just trying to give Danny some\n\t\t\ttraining.\n\n\t\t\t\t\tDANNY\n\t\t\tNot on your best day, boy!\n\n\tRafe grins and guns his plane low, in the opposite direction\n\the was moving before.  Danny reacts almost instantly...\n\tleapfrogging in the opposite direction, scaring the piss out\n\tof everybody else.\n\n\t\t\t\t\tTRAINING CAPTAIN\n\t\t\tThat's it, get into a wedge!\n\n\tThe squadron responds, forming up into a tight V, Rafe and\n\tDanny just behind and on either side of the center.\n\n\t\t\t\t\tRAFE\n\t\t\tDidn't you say test the limits?\n\n\t\t\t\t\tDANNY\n\t\t\tHey, you wanna test my limits, you better\n\t\t\tline up a couple dozen women on the\n\t\t\tGROUND...cause I got NO limits in the\n\t\t\tair!\n\n\tRafe grins, loving the challenge.  Then he and Danny do the\n\tleapfrogging maneuver laterally, swapping sides in the V.\n\n\t\t\t\t\tTRAINING CAPTAIN\n\t\t\tEverybody down!\n\n\tEXT.  NEW JERSEY AIRFIELD - DAY\n\n\tThe planes land in tight order and taxi off the runway; shut\n\tdown their props, slide back the canopies and hop down.  We\n\tsee young pilots we'll get to know:  ANTHONY, BILLY, RED.\n\n\t\t\t\t\tTRAINING CAPTAIN\n\t\t\tWhere are McCawley and Walker?\n\n\tEXT.  RAFE AND DANNY - STILL IN THE AIR - DAY\n\n\tThey've circled to opposite ends of the airfield and are now\n\theading right at each other, like two bullets playing\n\tchicken.\n\n\t\t\t\t\tTRAINING CAPTAIN\n\t\t\tAw shit...\n\n\tINT.  THE COCKPITS\n\n\tFrom Rafe and Danny's POV, the rush is awesome.\n\n\tTHE PILOTS ON THE GROUND watch in awe as the P-40's get so\n\tclose they can't possibly get out of each other's way.\n\tBilly, the most boyish-faced of the pilots, yells to drown\n\tout the sound of the collision...\n\n\tAt the last instant, both planes snap a quarter turn so that\n\ttheir wings are vertical, and they shoot past each other\n\tbelly to belly.\n\n\tIN THE COCKPITS\n\n\tRafe and Danny burst out laughing.\n\n\tTHE PILOTS ON THE GROUND\n\n\tlaugh and congratulate each other.\n\n\t\t\t\t\tTRAINING CAPTAIN\n\t\t\tYou know what they say... You can take the\n\t\t\tcrop duster out of the country -- but\n\t\t\tdon't put him in a P-40.\n\n\tRafe banks to land, and Danny tucks in behind him.  Danny has\n\tRafe's plane in his sights.\n\n\t\t\t\t\tDANNY\n\t\t\tIf I had guns I'd be chewing up your --\n\n\tRafe feints left, banks right, and appears behind Danny.\n\n\t\t\t\t\tRAFE\n\t\t\tIf you had guns, you'd be pissin' on 'em.\n\n\tThey're almost to the landing strip, Rafe behind Danny.  But\n\tas Danny's wheels are about to touch, he guns his engine and\n\tsnaps the nose of his plane straight up.\n\n\tTHE OTHER PILOTS stop laughing.\n\n\t\t\t\t\tANTHONY\n\t\t\tHe's doing an inside loop!\n\n\t\t\t\t\tTRAINING CAPTAIN\n\t\t\tAw, shit...\n\n\tDanny pulls it off, just barely making a full circle to come\n\tin behind Rafe and bounce to a stop on the runway.\n\n\t\t\t\t\tDANNY\n\t\t\tYee-hawww!!!\n\n\tDanny taxis his plane over to join the others.  He's grinning\n\tas he slides back his cockpit cover; then --\n\n\t\t\t\t\tDANNY\n\t\t\tWhere's Rafe?\n\n\tRed, tall with flaming orange hair, tips his chin toward the\n\tair.  Seeing Rafe's plane still in the air, Danny starts to\n\trefasten his harness.\n\n\t\t\t\t\tTRAINING CAPTAIN\n\t\t\tYou're down, Walker!  That's an order!\n\n\t\t\t\t\tDANNY\n\t\t\tWhat about him?\n\n\t\t\t\t\tTRAINING CAPTAIN\n\t\t\tHe's not taking my orders anymore.\n\n\tDanny's just about to ask what the hell that means, when he\n\tnotices Rafe climbing in a deliberate spiral.\n\n\t\t\t\t\tDANNY\n\t\t\tHe's gonna do it.\n\n\t\t\t\t\tBILLY\n\t\t\tDo what?\n\n\t\t\t\t\tDANNY\n\t\t\tIt.\n\t\t\t\t(beat)\n\t\t\tAw, shit.  Aw shit shit shit...\n\n\tRAFE'S PLANE reaches two thousand feet, just a speck above\n\tthem, and seems to pause in the air.\n\n\t\t\t\t\tDANNY\n\t\t\tI shouldn't'a done an inside loop.\n\t\t\tI shouldn't'a done an inside loop.\n\n\t\t\t\t\tBILLY\n\t\t\tWhy?\n\n\t\t\t\t\tDANNY\n\t\t\tCause now he's gonna do an outside loop.\n\n\t\t\t\t\tTRAINING CAPTAIN\n\t\t\tAw shit.  Aw shit shit shit...\n\n\tAnthony and Billy join in, like an involuntary chant --\n\n\t\t\t\t\tANTHONY & BILLY\n\t\t\tAw shit shit shit...\n\n\tRAFE, IN HIS COCKPIT, is tightly controlled, yet serene.  He\n\tnoses the plane into a power dive.\n\n\tThe P-40 screams toward the ground, picking up speed, going\n\tso fast it begins to shudder.\n\n\tTHE OTHER PILOTS are transfixed.  Red is so nervous he can't\n\tget the words out.\n\n\t\t\t\t\tRED\n\t\t\tAw sh- sh- sh- sh-\n\n\t\t\t\t\tBILLY\n\t\t\tShit.\n\n\t\t\t\t\tRED\n\t\t\tYeah.\n\n\t\t\t\t\tDANNY\n\t\t\tYou can do it, Rafe.  You can do it.\n\n\tThe P-40, hurtling toward the ground at nauseating speed,\n\tsnaps into a half roll, streaking upside down over the\n\trunway.  Rafe hangs inverted in his flight harness, the\n\tasphalt of the runway shooting past, ten feet beyond his\n\thead.\n\n\tHe pushes the plane into a climb, his cockpit on the outside\n\tof the circle.  The plane reaches the top of its arc, and\n\talmost stalls; but Rafe noses it over again, toward the\n\tearth, only this time he has very little altitude.  The plane\n\thurtles down, still with it belly on the inside of the\n\tcurve...\n\n\tAnd makes it full circle.  Rafe's head now is barely a foot\n\toff the asphalt as the plane shoots past, still inverted.\n\n\tTHE OTHER PILOTS burst into cheers.\n\n\tRAFE, IN HIS COCKPIT permits himself a smile.\n\n\tHe lands, and the guys run out to meet him...all except for\n\tthe Training Captain, who stands there shaking his head.\n\n\tDanny jumps on the wing, as Rafe stops and slides back his\n\tcanopy.  Danny grabs him by the harness and shakes him.\n\n\t\t\t\t\tDANNY\n\t\t\tYou could've killed yourself, you stupid\n\t\t\tbastard!\n\n\tHe dives into the cockpit, hugging Rafe.\n\n\t\t\t\t\tDANNY\n\t\t\tThat was the most beautiful thing I ever\n\t\t\tsaw.\n\n\tINT.  COLONEL DOOLITTLE'S OFFICE - DAY\n\n\tCOLONEL JIMMY DOOLITTLE, mid-forties, is commander of the\n\tbase.  He's as tough as he is good in the air.  And right now\n\the's frowning at Rafe McCawley, standing at attention before\n\thim.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tThere are some people who think the\n\t\t\toutside loop is reckless and\n\t\t\tirresponsible.\n\n\t\t\t\t\tRAFE\n\t\t\tHow could it be irresponsible, Sir, if\n\t\t\tyou were the first man in the world to do\n\t\t\tit?\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tDon't get smart with me, son.\n\n\t\t\t\t\tRAFE\n\t\t\tNever, Sir.  I just meant it's dangerous\n\t\t\tonly for the kind of pilot who wants to\n\t\t\tshow off, rather than inspire the other\n\t\t\tpilots in his unit.  And all you've done\n\t\t\tfor me, Sir, working out the transfer, I\n\t\t\tdid it to say thanks.  To honor you, Sir.\n\t\t\tWhat the French call a \"homage.\"\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tThat's bullshit, son.  But it's really\n\t\t\tgood bullshit.\n\n\t\t\t\t\tRAFE\n\t\t\tThank you, Sir.\n\n\tDoolittle stands, moves around his desk, and shakes Rafe's\n\thand.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tGood luck over there McCawley.  I admire\n\t\t\tyour decision.\n\n\t\t\t\t\tRAFE\n\t\t\tThank you, Sir.\n\n\tINT.  NEW JERSEY AIRFIELD - BARRACKS - NIGHT\n\n\tThe pilots are getting slicked up for a night on the town.\n\tDanny's at the mirrors with the others; he's putting on\n\tcologne, and looks terrific in his uniform.\n\n\tAnthony and Billy are combing their hair at the sinks.  Billy\n\tdeclares to his image in the mirror --\n\n\t\t\t\t\tBILLY\n\t\t\tYou good-lookin' sumbitch...don't you\n\t\t\tEVER die!\n\n\t\t\t\t\tANTHONY\n\t\t\tThat's your line for tonight, ya know.\n\n\t\t\t\t\tBILLY\n\t\t\tWhat, good-lookin' sumbitch?\n\n\t\t\t\t\tANTHONY\n\t\t\tNo, numbnuts, die.  You get your nurse\n\t\t\talone, you look her in the eye, and say,\n\t\t\t\"Baby, they're training me for war, and I\n\t\t\tdon't know what'll happen.  But if I die\n\t\t\ttomorrow, I wanna know that we lived all\n\t\t\twe could tonight.\"  I've never known it\n\t\t\tto fail.\n\n\tRed finishes brushing his teeth at the sink beside them.\n\n\t\t\t\t\tRED\n\t\t\tHe's n-never known it to work, either.\n\n\tThe guys head out laughing, running into Rafe coming in.\n\n\t\t\t\t\tDANNY\n\t\t\tDoolittle didn't kill you?  Attaboy!\n\n\tRafe catches Danny's arm.\n\n\t\t\t\t\tRAFE\n\t\t\tDanny, there's something I gotta tell\n\t\t\tyou...\n\n\tEXT.  NEW JERSEY BARRACKS - NIGHT\n\n\tRafe and Danny are walking on the parade ground; the other\n\tguys are already on the bus that will take them into town.\n\tDanny's upset by what Rafe just told him.\n\n\t\t\t\t\tDANNY\n\t\t\tHow could you do this?\n\n\t\t\t\t\tRAFE\n\t\t\tThe Colonel helped me work it out.\n\n\t\t\t\t\tDANNY\n\t\t\tI don't mean how'd you do the paperwork,\n\t\t\tI mean how the hell did you do it without\n\t\t\tletting me in on it?\n\n\t\t\t\t\tRAFE\n\t\t\tI'm sorry, Danny, but they're only\n\t\t\taccepting the best pilots.\n\n\t\t\t\t\tDANNY\n\t\t\tDon't make this a joke, Rafe.  You're\n\t\t\ttalking about war, and I know what war\n\t\t\tdoes to people.\n\n\t\t\t\t\tRAFE\n\t\t\tDanny, you know how many times I saw you\n\t\t\tcome to school with a black eye or a\n\t\t\tbusted nose, and couldn't do a thing\n\t\t\tabout it -- for you, or for your mother...\n\t\t\tor your father, with his lungs scorched\n\t\t\tout with mustard gas, and more left of\n\t\t\this lungs than there was of his spirit?\n\t\t\tYou've made your sacrifice, Danny.  It's\n\t\t\ttime I made mine.\n\n\t\t\t\t\tBILLY\n\t\t\t\t(from the bus)\n\t\t\tThe nurses are waiting!\n\n\t\t\t\t\tRAFE\n\t\t\tLet's go.\n\n\t\t\t\t\tDANNY\n\t\t\tNah, you go on.\n\n\t\t\t\t\tRAFE\n\t\t\tI have to talk to Evelyn.  And I want you\n\t\t\tto meet her.\n\n\t\t\t\t\tDANNY\n\t\t\tSome other time.  I don't feel like a\n\t\t\tparty.\n\n\tDanny walks away.  The bus driver's ready to leave, and Red\n\tis honking the horn for Rafe to come.  Rafe reluctantly lets\n\tDanny go, and heads for the bus, where the pilots are\n\tchanting --\n\n\t\t\t\t\tPILOTS VOICE\n\t\t\tNurses!  Nurses!  Nurses!\n\n\tINT.  A MOVING TRAIN - DAY\n\n\tThe trains of 1942 have their own beauty, with felt seats,\n\tshaded lamps, and paneled compartments even in the economy\n\tsection.  But the glow of the train is outshone by EVELYN\n\tSTEWART.  She's one of ten young women, Army nurses, gathered\n\tat one end of the car as it rattles along the track.\n\n\tThe other nurses are pretty and ripe -- maybe a bit too\n\tripe.  Their lips painted bright red, their faces powdered,\n\ttheir spirits high.\n\n\tEvelyn listens in amusement to BETTY, a cute blonde with\n\tunmissable boobs, and BARBARA, a burnette equally endowed.\n\n\t\t\t\t\tBETTY\n\t\t\tDo you have trouble with your boobs in\n\t\t\tthe uniform?\n\n\t\t\t\t\tBARBARA\n\t\t\tYou mean hiding them?\n\n\t\t\t\t\tBETTY\n\t\t\tHide them?  On a date with pilots?  I'm\n\t\t\ttalking about how you make them show!\n\n\tSANDRA, another nurse, speaks up.\n\n\t\t\t\t\tSANDRA\n\t\t\tLoan 'em to me, I'll make 'em show.\n\n\t\t\t\t\tBETTY\n\t\t\tThe boobs or the pilots?\n\n\tThe girls laugh and shove each others' knees; it's a party\n\twherever they go.  But Evelyn can't keep her mind on the\n\tfrivolity.  She looks out the window and her thoughts drift\n\taway.\n\n\t\t\t\t\tBARBARA\n\t\t\tWe'll ask Evelyn.  Evelyn?  Evelyn!\n\n\t\t\t\t\tBETTY\n\t\t\tOoo, she's thinking of her date!  Come\n\t\t\ton, you've been dating a pilot.  We want\n\t\t\tto know what we can expect.\n\n\tSuddenly all the girlish faces are looking at Evelyn.\n\n\t\t\t\t\tEVELYN\n\t\t\tI've been dating one pilot.  And only for\n\t\t\ta few weeks.  But I know he's different\n\t\t\tfrom all the others.\n\n\tSandra throws up her arms and swoons onto her friends.\n\n\t\t\t\t\tSANDRA\n\t\t\tTrue love!...\n\n\t\t\t\t\tBETTY\n\t\t\tMorphine, give her morphine!\n\n\t\t\t\t\tBARBARA\n\t\t\tGive her an enema.\n\n\t\t\t\t\tEVELYN\n\t\t\tBut I do have a warning for you.  There's\n\t\t\tone line you all need to know, and you're\n\t\t\tlikely to hear it from any man in a\n\t\t\tuniform.  It goes like this:  \"Honey,\n\t\t\tBaby... We never know what's gonna happen,\n\t\t\tand I may die tomorrow...so, let's live\n\t\t\tall we can tonight.\"\n\n\tA silence among the nurses.\n\n\t\t\t\t\tBARBARA\n\t\t\tI tell you.  Any one of those arrogant,\n\t\t\tleather-jacketed, slick-lookin' flyboys\n\t\t\ttries that line on me...he's gonna get\n\t\t\tanything he wants.\n\n\tAs the nurses laugh --\n\n\tEXT.  NEW YORK TRAIN STATION - NIGHT\n\n\tOur pilots -- indeed leather-jacketed and handsome -- are\n\twaiting on the platform.  Among then is Rafe, holding\n\tsomething behind his back, as the train pulls in and shudders\n\tto a stop, clouds of steam jetting onto the platform and\n\tgiving the moment a dream-like haze.\n\n\tINT./ EXT.  TRAIN - NEW YORK TRAIN STATION - NIGHT\n\n\tThe nurses start stepping out; both pilots and nurses pretend\n\tsurprise to see each.  At the door of the train, Evelyn\n\twhispers to Betty --\n\n\t\t\t\t\tEVELYN\n\t\t\tStick with me, I'll find you somebody\n\t\t\tgood.\n\n\tBetty spot's Rafe.\n\n\t\t\t\t\tBETTY\n\t\t\tI'll take that one.\n\n\t\t\t\t\tEVELYN\n\t\t\tHe's taken.  But come on, I'll introduce\n\t\t\tyou.\n\n\tThey move to Rafe; he crosses the platform to meet them, his\n\teyes holding Evelyn.\n\n\t\t\t\t\tRAFE\n\t\t\tHello, Lieutenant.  Good to see you.\n\n\t\t\t\t\tEVELYN\n\t\t\tYou too, Lieutenant.\n\n\tBetty clears her throat.\n\n\t\t\t\t\tEVELYN\n\t\t\tOh, this is Betty.\n\n\t\t\t\t\tRAFE\n\t\t\tNice to meet you, Betty.\n\n\tHe draws his hand from behind his back; he's holding two\n\troses.  He hands one to Evelyn and the second to Betty.\n\n\t\t\t\t\tRAFE\n\t\t\tDanny would'a brought this.\n\n\tHe escorts them along the platform.\n\n\t\t\t\t\tEVELYN\n\t\t\tDanny's not coming?\n\n\t\t\t\t\tRAFE\n\t\t\tNo, he...got some news today.  He'll be\n\t\t\tokay, he just didn't feel like coming\n\t\t\ttonight.\n\n\t\t\t\t\tEVELYN\n\t\t\tI was hoping to meet him.\n\n\t\t\t\t\tBETTY\n\t\t\tI was hoping to meet him.\n\n\t\t\t\t\tRAFE\n\t\t\tWe'll just have to find a substitute,\n\t\t\twon't we?\n\n\tBetty stops, and faces Rafe.\n\n\t\t\t\t\tBETTY\n\t\t\tI just want to tell you one thing.  If\n\t\t\tyou're thinking this might be your last\n\t\t\tnight on earth?... I'm prepared to make\n\t\t\tit meaningful.\n\t\t\t\t(leaning close)\n\t\t\tVery meaningful.\n\n\t\t\t\t\tEVELYN\n\t\t\tAt ease, Betty!\n\n\tINT.  CITY NIGHT CLUB - NIGHT\n\n\tIt's a party in full swing; swing music, jitterbugging,\n\tbeautiful young men and women in high spirits.\n\n\tRafe and Evelyn are sitting at a big table with the other\n\tpilots and nurses.  Anthony's paired up with Sandra, Billy\n\twith Barbara, and Red, shyest of the group, finds himself\n\tnext to Betty.  Betty's already found a companion in Red\n\tStrange.\n\n\t\t\t\t\tRED\n\t\t\tHe, I'm R-Red.  Red S-Strange.\n\n\t\t\t\t\tBETTY\n\t\t\tRed...Strange?\n\n\t\t\t\t\tRED\n\t\t\tYou know the football player, Red G-\n\t\t\tGrange?  Well the guys called me R-Red,\n\t\t\tcause you know, I'm red...and they\n\t\t\tthought I was strange, so, you know, Red\n\t\t\tG-Grange, Red Str-Strange.\n\n\t\t\t\t\tBETTY\n\t\t\tBut...they called you Strange?  Because\n\t\t\tof Red Grange?  I don't get it.  Was Red\n\t\t\tGrange strange?\n\n\t\t\t\t\tRED\n\t\t\tHow would I know.\n\n\tBeside her beer is an open ketchup bottle; he picks it up and\n\tswigs from that.  Rafe and Evelyn see this, and try to keep\n\tfrom laughing.\n\n\t\t\t\t\tBETTY\n\t\t\tDo you always stutter?\n\n\t\t\t\t\tRED\n\t\t\tOnly when I'm n-n-n-\n\n\t\t\t\t\tBETTY\n\t\t\tNervous?\n\n\t\t\t\t\tRED\n\t\t\tYeah.  But if I have to get something\n\t\t\tout, I c-can always s-s-s-\n\t\t\t\t(he sings)\n\t\t\tSIIING!\n\n\tShe covers his hand with hers.\n\n\t\t\t\t\tBETTY\n\t\t\tDon't be nervous.\n\n\tRed looks at Betty with love in his eyes.  Under the table,\n\tRafe and Evelyn join hands too.\n\n\t\t\t\t\tEVELYN\n\t\t\tThere shipping us out.  Hawaii.  The\n\t\t\tGermans are overrunning Europe, and we're\n\t\t\tsent to paradise.  How about you?  Have\n\t\t\tyou heard anything?\n\n\tHe hesitates; then Evelyn is distracted by the conversation\n\tbeside them, between Barbara and Billy.\n\n\t\t\t\t\tBILLY\n\t\t\tYou're a very special woman, and...well\n\t\t\tbaby, they're training me for war, and we\n\t\t\tdon't know what happens tomorrow.  So we\n\t\t\tgotta make tonight special.\n\n\tBarbara shoots a look at Evelyn, before she answers.\n\n\t\t\t\t\tBARBARA\n\t\t\tI hope you can back that up, flyboy.\n\t\t\tCause you're not ever gonna forget\n\t\t\ttonight.\n\n\tShe takes him by the hand and pulls him to his feet... They\n\tstart dancing, sexy movements that won't stop till they've\n\tbeen in bed.\n\n\tRafe pulls Evelyn to her feet, and leads her through the\n\tdancers, outside.\n\n\tEXT.  THE NIGHT CLUB - NIGHT\n\n\tThey find a quiet place on a balcony that overlooks the\n\triver, and Manhattan beyond.  Evelyn takes in the view,\n\tbreathes in the air; she still holds the rose.\n\n\t\t\t\t\tEVELYN\n\t\t\tWhatever you're trying to tell me isn't\n\t\t\tgood, is it.  Or it wouldn't be so hard\n\t\t\tto say.\n\n\t\t\t\t\tRAFE\n\t\t\tThe only reason it's hard to say is that\n\t\t\tI keep thinking I don't have the right to\n\t\t\tsay it.  But I've got to because it's\n\t\t\ttrue.  I love you.\n\t\t\t\t(beat)\n\t\t\tThat must surprise you.\n\n\t\t\t\t\tEVELYN\n\t\t\tIt surprises me that I'm not the only one\n\t\t\ton this balcony who feels that way.\n\n\tThe power of hearing this from each other grips them both.\n\n\t\t\t\t\tRAFE\n\t\t\tThere's one thing I have to say.  I'm\n\t\t\tgoing away.\n\n\t\t\t\t\tEVELYN\n\t\t\tWe're all going away.\n\n\t\t\t\t\tRAFE\n\t\t\tI'm going to the war.  The real war.\n\t\t\tHitler's taken Europe.  The Brits are\n\t\t\thanging on by their fingernails, and If\n\t\t\tthey lose, there'll be more people killed\n\t\t\tthan anybody can imagine.  And not just\n\t\t\tthere, but here.\n\n\t\t\t\t\tEVELYN\n\t\t\tBut you're in the U.S. Army, how could\n\t\t\tyou --\n\n\t\t\t\t\tRAFE\n\t\t\tColonel Doolittle pulled the strings, and\n\t\t\tput me on loan to the R.A.F.  They need\n\t\t\tpilots, and we need experience.  I leave\n\t\t\ttomorrow.\n\n\t\t\t\t\tEVELYN\n\t\t\tYou waited til tonight to tell me?\n\n\t\t\t\t\tRAFE\n\t\t\tI had to tell you in person.  Because\n\t\t\tthere's something else I need to say.\n\n\tHe studies her face, burning it into his memory.\n\n\t\t\t\t\tRAFE\n\t\t\tEvelyn...you know the line -- let's make\n\t\t\ttonight memorable.  What I feel about you\n\t\t\tmakes it impossible for me to say\n\t\t\tsomething like that.  If I don't come\n\t\t\tback, I don't want to saddle you with\n\t\t\tregret and sadness you'll carry the rest\n\t\t\tof your life.\n\n\t\t\t\t\tEVELYN\n\t\t\tI don't know if you can choose that,\n\t\t\tRafe.\n\n\t\t\t\t\tRAFE\n\t\t\tMaybe not.  But I need you to know.  I\n\t\t\tlove you.  And I will come back.  I'll\n\t\t\tfind a way.  And then we'll get a chance\n\t\t\tto know if what I felt the first moment I\n\t\t\tsaw you, and every minute since then, is\n\t\t\treal.\n\n\t\t\t\t\tEVELYN\n\t\t\tDo one thing for me, before you go.\n\n\tShe takes his hand and leads him inside.\n\n\tINT.  NIGHT CLUB - NIGHT\n\n\tShe leads him onto the dance floor, and they dance, among the\n\tothers, yet in a world apart from everyone else.  And then\n\tthey stop while all the others move around them, and kiss the\n\tkind of kiss that lasts a lifetime.\n\n\tEXT.  HOTEL - NIGHT\n\n\tThe nurses are entering the hotel.  Pilots are going in with\n\tthem.  But Rafe and Evelyn stop on the street.\n\n\tA last kiss.  Their hands touch a final time, and then part.\n\tShe moves inside the lobby, and looks out the glass doors as\n\the walks away.\n\n\tEXT.  TRAIN STATION - DAWN\n\n\tRafe and Danny stand on the platform.  Rafe's got his gear\n\tpacked in a bag slung over his shoulder.\n\n\t\t\t\t\tCONDUCTOR'S VOICE\n\t\t\tAll aboard!\n\n\tRafe glances once more toward the revolving doors from the\n\tstation that lead onto the platform.\n\n\t\t\t\t\tDANNY\n\t\t\tDidn't you say you told her not to come?\n\n\t\t\t\t\tRAFE\n\t\t\tYeah.\n\n\t\t\t\t\tDANNY\n\t\t\tThen why are you looking for her?\n\n\t\t\t\t\tRAFE\n\t\t\tIt's a test.  If I asked her to come and\n\t\t\tshe came, it wouldn't tell me anything.\n\t\t\tIf I tell her not to come, and she\n\t\t\tcomes...then I know she loves me.\n\n\t\t\t\t\tVOICE\n\t\t\tALL ABOARD!\n\n\t\t\t\t\tDANNY\n\t\t\tYou're still a kid, ya know that?  Take\n\t\t\tcare of yourself.\n\n\t\t\t\t\tRAFE\n\t\t\tYou too.\n\n\tRafe sticks his hand out to Danny.  Danny knocks it away, and\n\thugs him.\n\n\tRafe steps onto the train, and it pulls away.  Rafe waves.\n\tDanny waves back and smiles, but he whispers like a prayer...\n\n\t\t\t\t\tDANNY\n\t\t\tGive 'em hell, Rafe.\n\n\tINT.  TRAIN - DAWN\n\n\tRafe finds a seat and sits down.  He's the only one in the\n\tcar, and he's deeply alone.\n\n\tEXT.  TRAIN STATION - DAWN\n\n\tDanny walks to one of the three revolving doors back into the\n\tstation.  He takes the one on the far right.  As he passes\n\tthrough it, he doesn't see Evelyn rushing through the door on\n\tthe left side.  She's told herself she wouldn't come, but\n\tcouldn't help it, and now as she sees the last car of the\n\ttrain disappearing around the corner the pain of it all hits\n\ther.\n\n\tShe stands on the empty platform, as lonely as Rafe.\n\n\tMONTAGE - THE JOURNEYS\n\n\tRafe and Evelyn travel in opposite directions, toward\n\topposite ends of the earth...\n\n\tEXT.  A GRAY, COLD, CANADIAN SEAPORT - DAY\n\n\tas Rafe boards a Canadian naval vessel headed into the North\n\tAtlantic.\n\n\tEXT.  TRAIN - TRAVELING THROUGH THE AMERICAN WEST - DAY\n\n\tEvelyn and her fellow nurses ride the train through the\n\tAmerican southwest.  The scenery outside the window is\n\tbeautiful, but her thoughts are far away...\n\n\tEXT.  NORTH ATLANTIC - DAY\n\n\tRafe's ship is in a convoy through the rough gray waters.\n\tThe deck is loaded with military supplies bound for Britain.\n\tRafe stands among the drab crates and seems oblivious to the\n\train, his thoughts on Evelyn.\n\n\tHe looks toward the eastern horizon, where his ship is\n\theading.  A deep, dark storm is brewing before them...\n\n\tEXT.  PACIFIC - DAY\n\n\tEvelyn stands on the deck of a ship headed in the opposite\n\tdirection, on another ocean, the sky is clear, the breeze is\n\twarm, the light of a glowing sunset bathes her face.  The\n\tMONTAGE ENDS, with them heading to different ends of the\n\tearth.\n\n\tEXT.  BASSINGBORNE AIRFIELD - BRITAIN - DUSK\n\n\tIn the eternal dusk of England, everything is cold and gray.\n\tBritish fighter planes -- Spitfires and Hurricanes -- are\n\tsurrounded by mechanics hurriedly ripping off bullet riddled\n\tfuselage panels and digging into overworked aircraft engines.\n\tRafe walks across the tarmac, still carrying his duffel bag.\n\tHe moves up behind a slim, pale BRITISH AIR COMMANDER who is\n\tsurveying engine damage on one of the Spitfires.\n\n\t\t\t\t\tRAFE\n\t\t\tRafe McCawley, Sir.\n\n\tRafe salutes as the Air Commander turns and then returns the\n\tsalute, with his left arm -- his right arm is gone.  Rafe\n\tfreezes at the sight, reminded of Danny's father.\n\n\t\t\t\t\tBRITISH AIR COMMANDER\n\t\t\tOn loan from Colonel Doolittle, is it?\n\n\t\t\t\t\tRAFE\n\t\t\tThat's me, Sir.\n\n\t\t\t\t\tBRITISH AIR COMMANDER\n\t\t\tGood on you, then, Rafe McCawley.  We'll\n\t\t\tget you situated in some quarters, and\n\t\t\tthen introduce you to the equipment\n\t\t\tyou'll be flying.\n\n\t\t\t\t\tRAFE\n\t\t\tIf you're patching up bullet holes right\n\t\t\there on the runway, maybe we should skip\n\t\t\tthe housekeeping and get right to the\n\t\t\tplanes.\n\n\t\t\t\t\tBRITISH AIR COMMANDER\n\t\t\tAre all the Yanks as anxious as you are\n\t\t\tto get yourself killed, Lieutenant?\n\n\t\t\t\t\tRAFE\n\t\t\tNot anxious to die, Sir, anxious to\n\t\t\tmatter.\n\n\tEXT.  BASSINGBORNE AIRFIELD - BRITAIN - DAY\n\n\tA Spitfire sits on the runway, and it's badly mangled -- a\n\tstring of bullet holes punched through at mid-fuselage; a\n\tshot-off chunk of wingtip; but most striking is the blood\n\tstill splattered over the inside of the cockpit.\n\n\t\t\t\t\tBRITISH AIR COMMANDER\n\t\t\tGood lad.  Didn't die till he'd landed\n\t\t\tand shut down his engine.  Welcome to the\n\t\t\twar.\n\n\tHe walks away, leaving Rafe to stare at the bloody cockpit.\n\n\tEXT.  PEARL HARBOR - MILITARY BASE - DAY\n\n\tEvelyn and the nurses enter the base, riding in two jeeps.\n\tAs they stop at the gate, the guards look at them, especially\n\tEvelyn in the lead jeep; one guard mumbles to the other --\n\n\t\t\t\t\tGUARD\n\t\t\tI've died and gone to heaven.\n\n\tThe guards lift the bar and smile at the nurses.  The jeeps\n\tdrive through.  The nurses are loving this island paradise\n\talready.\n\n\t\t\t\t\tBARBARA\n\t\t\tYou know the ratio of men to women on\n\t\t\tthis island?  Four-thousand...to one.\n\n\tBarbara slides on a new pair of sunglasses with plastic palm\n\ttrees glued on the sides, and calls back to the guards as the\n\tjeeps pull away --\n\n\t\t\t\t\tBARBARA\n\t\t\tSee ya on the beach, boys!\n\n\tEXT.  MILITARY BASE - NURSES' QUARTERS - OAHU - DAY\n\n\tAs the other nurses happily unpack, Evelyn leaves and crosses\n\tthe grass in the drenching sunshine.  We follow her into --\n\n\tINT.  BASE HOSPITAL - DAY\n\n\tShe finds a small, immaculately clean hospital, twenty beds\n\twith luminous white sheets, all empty.\n\n\tThen she notices the view.  It's of Pearl Harbor, with the\n\tentire American Pacific fleet riding at anchor.  Battleships\n\tall in a row.  Aircraft carriers too, in perfect stillness on\n\tthe aqua blue water with a white sand bottom.  The view is\n\texpansive and beautiful.\n\n\tThe sound of an approaching fighter plane with wing guns\n\tfiring as we --\n\n\t\t\t\t\t\t\t\tCUT TO:\n\n\tEXT.  THE DARK SKIES OVER THE ENGLISH CHANNEL - DAY\n\n\tRafe, in the middle of an aerial dogfight, throws his\n\tSpitfire into a tight turn, swinging around to fire again\n\tinto a squadron of Messerschmidts; they outnumber the British\n\tplanes, and they're tougher and faster.  Rafe darts through\n\ttheir line, machine guns blazing.\n\n\tOne of the Spitfires in Rafe's squadron has taken hits in the\n\tengine compartment and is sputtering, losing power, its\n\tpilot, NIGEL, frantic as the German planes swarm into finish\n\thim.\n\n\t\t\t\t\tBRITISH PILOT (NIGEL)\n\t\t\tI need help!  Someone get them off me!\n\n\tRafe slams his control stick hard right and goes into a power\n\tdive at one of the Messerschmidts.  Rafe's bullets chew up\n\tits cockpit and the plane goes into a fast corkscrew spiral,\n\tdown into the water.\n\n\tRafe instantly climbs again.  Nigel, in the moment of safety\n\tRafe has bought him, bails out, his chute blossoming and\n\tcarrying him toward the water.  The OTHER BRITISH PILOTS are\n\timpressed.\n\n\t\t\t\t\tOTHER BRITISH PILOT\n\t\t\t\t(into radio)\n\t\t\tNigel's out!  I'll call in the position!\n\t\t\t\t(to himself)\n\t\t\tThat Yank is bloody good.\n\n\tRafe swings his plane right back at the Germans; he attacks\n\tthem head on, just like he went at Danny, only this time he's\n\tfiring his machine guns.\n\n\tAnd OVER THIS ferocious dogfight, we hear his letter to\n\tEvelyn...\n\n\t\t\t\t\tRAFE'S VOICE (LETTER)\n\t\t\tDear Evelyn... It is cold here.  So cold,\n\t\t\tin a way that goes deep into your bones.\n\n\tThe Messerschmidt in Rafe's sights breaks apart with the\n\tstream of precise fire he pours into it, its prop flying into\n\tpieces, its disintegration accelerated by its airspeed.\n\tBefore it completely comes apart, it explodes.\n\n\tRafe goes into another tight turn, to get at them again.\n\n\t\t\t\t\tRAFE'S VOICE (LETTER)\n\t\t\tIt's not easy making friends.  Two nights\n\t\t\tago I drank a beer with a couple of the\n\t\t\tR.A.F. pilots -- beer's the only thing\n\t\t\there that isn't cold -- and yesterday both\n\t\t\tof them got killed...\n\n\tAs Rafe starts another attack we see him in the cockpit, in\n\tthe trance of battle, as other Spitfires around him are\n\tgetting shot out of the sky...as we --\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\n\tEXT.  HOSPITAL - PEARL HARBOR - DAY\n\n\tEvelyn, receiving the letter at mail call.\n\n\tShe sits on the grass under a palm tree, in paradise, reading\n\this letter.\n\n\t\t\t\t\tRAFE'S VOICE (LETTER)\n\t\t\tThere is one place I can go to find\n\t\t\twarmth, and that is to think of you.\n\n\tEXT.  OUTDOOR RESTAURANT - OAHU - DAY\n\n\tEvelyn is off duty, and wears a light cotton dress.  She's\n\tlet her hair down, and her skin has the sheen of light sweat\n\tin the tropical heat.\n\n\tThe restaurant is barely more than a shelter of palm wood\n\tposts with a frond roof, and it looks out over the harbor.\n\tEvelyn sits alone.  She's brought writing paper.  As the\n\tHawaiian waiter serves her an icy tropical ambrosia with\n\tchunks of pineapple and a fresh plumeria flower floating at\n\tthe rim of the glass, she lifts her pen.\n\n\tBut before she can start to write, three naval officers move\n\tover to her table from the bar.  They're out of uniform too,\n\twearing garish tropical shirts.\n\n\t\t\t\t\tNAVY GUY 1\n\t\t\tA woman beautiful as you shouldn't be\n\t\t\tsitting alone.  Buy you a drink?\n\n\t\t\t\t\tEVELYN\n\t\t\tThank you...Ensign.\n\n\tThe guys look at each other, impressed that she could tell.\n\n\t\t\t\t\tNAVY GUY 1\n\t\t\tEnsign!  Smart too!\n\n\t\t\t\t\tNAVY GUY 2\n\t\t\tSo how about that drink?  Or dinner?\n\n\t\t\t\t\tEVELYN\n\t\t\tThank you, but...I really want to be\n\t\t\talone right now.\n\n\t\t\t\t\tNAVY GUY 3\n\t\t\tWant to see something long and hard?\n\n\tHe shows her the tattoo of an anchor on his forearm.  Evelyn\n\tlooks away from them, toward the harbor.\n\n\t\t\t\t\tEVELYN\n\t\t\tI'm sorry.  I've got a letter to write.\n\n\t\t\t\t\tNAVY GUY 3\n\t\t\tCold bitch.\n\n\tHis friends start to pull him away, but Evelyn's eyes flare.\n\n\t\t\t\t\tEVELYN\n\t\t\tWhat did you say?\n\n\t\t\t\t\tNAVY GUY 3\n\t\t\tI said you're cold.\n\n\t\t\t\t\tEVELYN\n\t\t\tCold?  No, I'm just thinking about a war.\n\t\t\tAnd maybe you should be too.\n\n\tThey leave, shaking their heads.  Evelyn picks up her pen,\n\tand writes.\n\n\t\t\t\t\tEVELYN'S VOICE (LETTER)\n\t\t\tDear Rafe... It's strange to be so far\n\t\t\tfrom you in body, and so close to you in\n\t\t\tspirit.  But if our spirits really give\n\t\t\tour bodies life, then you should know\n\t\t\tthis:  Every night I look at the sunset,\n\t\t\tand try to draw the last ounce of heat\n\t\t\tfrom its long day...\n\n\tShe looks toward the sunset now; then she writes again...\n\n\tEXT.  BASSINGBORNE AIRFIELD - BRITAIN - NIGHT\n\n\tRafe brings his battered plane in for a landing...\n\n\tINT.  BRITISH AIRFIELD BARRACKS - NIGHT\n\n\tRafe sits on his cot, reading her letter.\n\n\t\t\t\t\tEVELYN'S VOICE (LETTER)\n\t\t\t...and send it from my heart to yours.\n\n\tRafe is startled as the Air Commander appears beside his\n\tbunk.\n\n\t\t\t\t\tBRITISH AIR COMMANDER\n\t\t\tAir-Sea Rescue picked up Nigel.  He'll be\n\t\t\tback with us tomorrow.\n\n\tRafe nods, glad to hear the news.  The Commander starts to\n\twalk away, then turns back.\n\n\t\t\t\t\tBRITISH AIR COMMANDER\n\t\t\tSome of us look down on the Yanks for not\n\t\t\tyet joining this war.  I'd just like to\n\t\t\tsay that if there are many more back home\n\t\t\tlike you, God help anyone who goes to war\n\t\t\twith America.\n\n\tThe Commander salutes, with his left hand.  And Rafe salutes\n\ttoo -- with his left hand.\n\n\tEXT.  ESTABLISHING THE WHITE HOUSE - WASHINGTON D.C. - DAY\n\n\tThe White House looks somehow whiter and purer in the glow of\n\t1941.\n\n\tINT.  PRESIDENTIAL CONFERENCE ROOM - DAY\n\n\tGENERALS, ADMIRALS, and other advisors sit around the\n\tpolished table -- all males, in suits and in uniforms.  The\n\tdoor opens, and the men all stand.\n\n\tPRESIDENT FRANKLIN ROOSEVELT appears, in a wheelchair, pushed\n\tby a huge black valet, GEORGE.  The President's legs are\n\tshriveled, braced with the iron supports that attach to his\n\tshoes and are apparent beneath the cloth of his pin-striped\n\tpants.  From the waist up Roosevelt is heavily muscled,\n\tpowerful, and handsome even in his little spectacles.  The\n\tvalet rolls him to the head of the table; he's speaking even\n\tbefore he settles in.\n\n\t\t\t\t\tPRESIDENT ROOSEVELT\n\t\t\tPlease be seated, gentlemen.\n\n\tThey sit, as one.\n\n\t\t\t\t\tPRESIDENT ROOSEVELT\n\t\t\tChurchill and Stalin are asking me what\n\t\t\tI'm asking you:  How long is America\n\t\t\tgoing to pretend the world is not at war?\n\n\t\t\t\t\tGENERAL MARSHALL\n\t\t\tWe've increased supply shipments to them,\n\t\t\tMr. President, and we're losing merchant\n\t\t\tvessels every day.\n\n\t\t\t\t\tPRESIDENT ROOSEVELT\n\t\t\tShift in every destroyer and anti-\n\t\t\taircraft weapon you can find.\n\n\t\t\t\t\tADMIRAL\n\t\t\tSir, our Pacific Fleet is already down\n\t\t\tto almost nothing.\n\n\t\t\t\t\tPRESIDENT ROOSEVELT\n\t\t\tGentlemen, at this moment the nation of\n\t\t\tHungry has a larger military then the\n\t\t\tUnited States.  We have no choice but to\n\t\t\tdraw from whatever we can.\n\n\tEXT.  ESTABLISHING TOKYO - JAPAN - NIGHT\n\n\tINT.  JAPANESE HIGH COMMAND - NIGHT\n\n\tThe Conference Room is similar to that of the White House.\n\tBut this table is low and all the men sit on the floor.  And\n\tthere are no civilians here; Japan is now a nation ruled by\n\tits warriors.\n\n\tThe last man to enter the room and take his place is ADMIRAL\n\tYAMAMOTO.  Harvard educated, Yamamoto is an object of\n\tveneration and suspicion among the men of the war council.\n\tYamamoto bows, sits, and looks across the table at his friend\n\tGenda, who can't hide his fear.  Yamamoto glances to the far\n\tend of the table where NISHIKURA, chief of the War Council,\n\tsits glowering.  (Their discussion is in Japanese, with\n\tsubtitles.)\n\n\t\t\t\t\tNISHIKURA\n\t\t\tSo you join us, Admiral.  Some of us\n\t\t\tthought your education at an American\n\t\t\tuniversity would make you too weak to\n\t\t\tfight the Americans.\n\n\t\t\t\t\tYAMAMOTO\n\t\t\tIf knowledge of opponents and careful\n\t\t\tcalculation of danger is taken as\n\t\t\tweakness then I have misunderstood what\n\t\t\tit means to be Japanese.\n\n\t\t\t\t\tNISHIKURA\n\t\t\tThe time has come to strike!  Or to sit\n\t\t\tand let the Americans cut off our oil and\n\t\t\tour future.  I know what you whisper to\n\t\t\tthe others, Yamamoto -- that the Americans\n\t\t\tare strong.  Yet look at their leader.\n\n\tHe motions to OYAMA, an intelligence analyst, who opens a\n\tfile and lays out pictures of Roosevelt.\n\n\t\t\t\t\tOYAMA\n\t\t\tFranklin Roosevelt.  Born into great\n\t\t\twealth.  Fifteen years ago, he was\n\t\t\tstricken with polio.  Now he cannot walk,\n\t\t\tor even stand without help.\n\t\t\tPhotographers will not take pictures of\n\t\t\thim in his chair; Americans do not wish\n\t\t\tto know how weak their President is.\n\n\tYamamoto makes a low grunt.\n\n\t\t\t\t\tNISHIKURA\n\t\t\tYou have something to say, Yamamoto?\n\n\t\t\t\t\tYAMAMOTO\n\t\t\tThe Council knows I have opposed fighting\n\t\t\tthe Americans.  No matter how great our\n\t\t\tresolve, they have resources beyond ours.\n\t\t\tIf we must go to war, there is only one\n\t\t\tway -- deal them a blow from which it will\n\t\t\ttake them years to recover.  In that time\n\t\t\twe can conquer all of the Pacific, and\n\t\t\tthey will have no choice but to ask for\n\t\t\tpeace.\n\n\t\t\t\t\tNISHIKURA\n\t\t\tYou see us as capable of such a blow?\n\n\t\t\t\t\tYAMAMOTO\n\t\t\tThe Americans themselves have made it\n\t\t\tpossible.  We will annihilate them in a\n\t\t\tsingle attack -- at Pearl Harbor.\n\n\tThe members of the war council are so pleased with Yamamoto\n\tthat they bow to him.  Only Genda keeps his eyes raised long\n\tenough to see the sadness in Yamamoto's face.\n\n\tEXT.  PEARL HARBOR - AIR BASE - BARRACKS - DAY\n\n\tDanny Walker and his pilot buddies have just arrived; they\n\tenter the barracks, talking happily.\n\n\t\t\t\t\tRED\n\t\t\tIf I ain't n-never on a b-boat again,\n\t\t\tit'll be too s-soon.\n\n\t\t\t\t\tBILLY\n\t\t\tWhere are the women on this --\n\n\tDanny has stopped before the others; now all of them see that\n\tthe other pilots who inhabit this air base are still in their\n\tbeds, sleeping off hangovers.  They wear Hawaiian shirts;\n\tthey haven't shaved.\n\n\t\t\t\t\tRED\n\t\t\tThey're s-still asleep!\n\n\tDanny pauses for a moment, then shouts --\n\n\t\t\t\t\tDANNY\n\t\t\tDrop your cocks and grab your socks,\n\t\t\tboys!  The terror of the skies are here!\n\n\tThe sleeping pilots groan, and cover their heads with their\n\tpillows.\n\n\t\t\t\t\tANTHONY\n\t\t\tThey're all drunk.\n\n\tOne guy sits up in bed, his hair pointing every direction of\n\tthe compass, his tongue working as if to wipe a terrible\n\ttaste from his mouth.  As his feet dangle over the side of\n\tthe bunk and one of them touches the floor, a sensation\n\treaches his sotted brain; he raises that foot to look at its\n\tbottom, and finds a new tattoo, on the sole of his foot; he\n\tblinks as if trying to remember how it got there.\n\n\tDanny moves over to him, and dubs him with a name, COMA.\n\n\t\t\t\t\tDANNY\n\t\t\tHey.  You.  Mr. Coma.\n\n\t\t\t\t\tCOMA\n\t\t\tWhere's that lizard?\n\n\t\t\t\t\tDANNY\n\t\t\tWhat lizard?\n\n\t\t\t\t\tCOMA\n\t\t\tThe one that slept in my mouth last\n\t\t\tnight.\n\n\t\t\t\t\tDANNY\n\t\t\tWhat the hell happened to you guys?\n\n\tComa is one of those drunks who speak as if he's always about\n\tto burp.\n\n\t\t\t\t\tCOMA\n\t\t\tEver hear of mai-tai's?  Comes in a\n\t\t\tbig...pot.  Like...like...\n\n\t\t\t\t\tRED\n\t\t\tA m-missionary?\n\n\t\t\t\t\tCOMA\n\t\t\tNo, like...\n\n\tComa emits a pukey, toxic burp that has Danny and his buddies\n\twincing back from the fumes.\n\n\t\t\t\t\tDANNY\n\t\t\tThis is an Air Base?  Where's your squad\n\t\t\tcommander?\n\n\tThe question soaks through to Coma's brain.  His right hand\n\tpoints...and his left hand points...in different directions.\n\tHis hands float around in the air until finally both of them\n\tare indicating the same direction, behind his back.  In the\n\tbunk beyond Coma's is another drunk pilot in a Hawaiian\n\tshirt...and to judge by the shapely bronzed leg that\n\tprotrudes from under his damp sheet, there's a woman with him\n\ttoo.\n\n\tDanny and his buddies are speechless -- except for Red\n\tStrange.\n\n\t\t\t\t\tRED\n\t\t\tI th-think I'm gonna like it here.\n\n\t\t\t\t\tCOMA\n\t\t\tYou guys are new?\n\n\t\t\t\t\tDANNY\n\t\t\tYeah.\n\n\t\t\t\t\tCOMA\n\t\t\tMai-tai's.  I got this to tell ya, about\n\t\t\tmai-tai's.\n\n\tComa's head drifts forward slowly; they think for a moment\n\the's looking for something under the bed.  Then he pukes.\n\tDanny leaps back from the splatter, and marches out of the\n\tbarracks; his friends follow.\n\n\tEXT.  PEARL HARBOR - AIRFIELD - DAY\n\n\tDanny and his buddies stride up to the airfield.  It's full\n\tof fighter planes -- and they're all bunched together in\n\tclusters on the field.  Danny grabs a MECHANIC.\n\n\t\t\t\t\tDANNY\n\t\t\tHey!  What is this, the planes all\n\t\t\tbunched up like that?\n\n\t\t\t\t\tMECHANIC\n\t\t\tThe brass is afraid of sabotage.  This\n\t\t\tmakes 'em easier to protect -- and easier\n\t\t\tto service.\n\n\t\t\t\t\tDANNY\n\t\t\tWhat about easier to hit in an air raid?\n\n\t\t\t\t\tMECHANIC\n\t\t\tWho's gonna to that?  Japan is four\n\t\t\tthousand miles away.  So you guys just\n\t\t\tarrived, huh?\n\n\t\t\t\t\tDANNY\n\t\t\tYeah.\n\n\t\t\t\t\tMECHANIC\n\t\t\tWe got a saying here.  A-low-HA!\n\n\tThe mechanic walks off.  Danny and the guys are left standing\n\ton the tarmac.\n\n\t\t\t\t\tDANNY\n\t\t\tWell guys...I reckon there's just one\n\t\t\tthing to do...\n\n\tINT.  OAHU BAR - DAY\n\n\tDanny and the pilots are in Hawaiian shirts, their party in\n\tfull swing.  A bucket-sized hollowed-out volcano sits in the\n\tmiddle of the table, with twelve straws emerging from the\n\tcrater.  It's full of booze -- or was; Danny and the other\n\tguys are pulling heartily at the straws, and they gurgle as\n\tthe last liquid is sucked dry.\n\n\t\t\t\t\tRED\n\t\t\tMore m-mai-tai's!\n\n\tComa is sitting there with them, beside Red.\n\n\t\t\t\t\tCOMA\n\t\t\tAbsolutely right.\n\n\tEverybody's having a ball, the new arrivals fitting right in\n\twith the others.  Danny's a bit off to himself, lost in his\n\town thoughts.  Billy and Anthony are doing the hula to the\n\tHawaiian music playing.\n\n\t\t\t\t\tCOMA\n\t\t\tNo, you guys aren't doing it right.  It's\n\t\t\tin the hands.  They talk story.\n\n\tComa stands and starts demonstrating, explaining the gestures\n\tof his hula.\n\n\t\t\t\t\tCOMA\n\t\t\tFish swim in ocean... Happy in the Mother\n\t\t\tSea... Girl, beautiful girl, with big\n\t\t\tjugs, walks into water...waves lapping at\n\t\t\ther thighs...\n\n\t\t\t\t\tANTHONY\n\t\t\tI never knew those dances were so\n\t\t\tsophisticated.\n\n\t\t\t\t\tCOMA\n\t\t\t...Fish nibble at her breasts...\n\n\tComa's really into his dance, his hands over enormous\n\timaginary breasts; but as he turns toward the windows --\n\n\t\t\t\t\tCOMA\n\t\t\tA more beautiful girl walks by...\n\n\tThe guys see Evelyn passing on the other side of the street,\n\tgorgeous in the sunshine.  Coma's hands start squeezing the\n\timaginary breasts of his hula.\n\n\t\t\t\t\tBILLY\n\t\t\tHey, isn't that Evelyn?\n\n\tDanny moves up to look.\n\n\t\t\t\t\tDANNY\n\t\t\tRafe's girl, Evelyn?\n\n\t\t\t\t\tCOMA\n\t\t\tYou guys know her?!  I gotta have an\n\t\t\tintro!  Man, I'd like to --\n\n\tDanny's hand is suddenly around Coma's larynx.\n\n\t\t\t\t\tDANNY\n\t\t\tA friend of mine's in love with her.  So\n\t\t\tyou don't even look -- not ever.\n\n\tDanny releases him and Coma staggers back to the table to\n\tnuzzle up to one of the straws of the mai-tai volcano.\n\n\tDanny looks out the window again and sees Evelyn's beautiful\n\tform disappear around the corner, on her way back to the base\n\thospital.  Danny moves back to the table, and as two burly\n\tHawaiian waiters set another full loaded mai-tai volcano onto\n\tthe center of the table, he picks up a glass and dips it full\n\tof the potent liquid.  He shouts to the whole room --\n\n\t\t\t\t\tDANNY\n\t\t\tI'm a better pilot than any son-of-a-\n\t\t\tbitch on this island!  So I'm the one to\n\t\t\tsay this!  Here's to Rafe McCawley!  A\n\t\t\tbetter pilot...and a better man...than\n\t\t\tme.\n\n\tThe other pilots drink up -- from glasses or from straws.\n\n\t\t\t\t\tOTHER PILOTS\n\t\t\tTo Rafe.\n\n\tDanny drains the whole glass at one chug, and slams it down\n\tonto the table.  Then he blinks, puts a hand on his stomach,\n\tand frowns.  Coma recognizes the look.\n\n\t\t\t\t\tCOMA\n\t\t\tUh oh.  Volcanic eruption!\n\n\tDanny bends at the waist; his head obscured by the table.\n\n\t\t\t\t\tCOMA\n\t\t\tShit, he's puking on my feet!\n\n\t\t\t\t\tRED\n\t\t\tWell, you p-puked on his feet.\n\n\t\t\t\t\tCOMA\n\t\t\tYeah, but he was wearing shoes!\n\n\tINT.  ADMIRAL KIMMEL'S OFFICE - OAHU - DAY\n\n\tADMIRAL KIMMEL is Commander of the American Pacific Fleet.\n\n\tTwo members of his staff are standing uncomfortably in front\n\tof him, having delivered a message from the Joint Chiefs of\n\tStaff.\n\n\t\t\t\t\tADMIRAL KIMMEL\n\t\t\t...transfer twelve more destroyers to\n\t\t\tAtlantic Fleet, and all the available\n\t\t\tanti-aircraft weaponry?!  Washington has\n\t\t\tgone insane!\n\n\tKimmel's STRATEGIC ANALYST speaks up.\n\n\t\t\t\t\tSTRATEGIC ANALYST\n\t\t\tWe've done what you ordered, Admiral, and\n\t\t\twar gamed the likely outcome of a\n\t\t\tJapanese attack against each of our major\n\t\t\tbases in the Pacific.  Wake, Guam,\n\t\t\tMidway, the Philippines.  In each case,\n\t\t\twe lose.\n\n\t\t\t\t\tADMIRAL KIMMEL\n\t\t\tYou left out Hawaii.\n\n\t\t\t\t\tSTRATEGIC ANALYST\n\t\t\tPearl Harbor can't be attacked\n\t\t\teffectively from the air.  It's too\n\t\t\tshallow for an aerial torpedo attack.\n\t\t\tPearl Harbor's safe.  It's everywhere\n\t\t\telse that we're vulnerable.\n\n\t\t\t\t\tADMIRAL KIMMEL\n\t\t\tStep up surveillance of Japanese\n\t\t\tcommunications.  They're gonna do\n\t\t\tsomething somewhere.  I can feel it.\n\n\tEXT.  THE SKIES ABOVE OAHU - DAY\n\n\tA seaplane takes tourists on an excursion above Pearl Harbor\n\tand around the island of Oahu.  One Japanese tourist shoots\n\tpictures rapidly...first of the ships as seen from overhead;\n\tthen he leans to the other side of the plane and shoots\n\tpictures of the airfield below them.\n\n\tEXT.  PEARL HARBOR - DAY\n\n\tAnother Japanese tourist hikes through the hills above Pearl\n\tHarbor.  He takes an excellent camera from his picnic basket,\n\tand shoots pictures.\n\n\tCLOSE - THE PICTURES, being carried down a hallway, into --\n\n\tINT.  JAPANESE PLANNERS OFFICE - DAY\n\n\tThe courier places the pictures onto the table in front of\n\tYamamoto, Genda, and the other JAPANESE OFFICERS.\n\n\t\t\t\t\tGENDA\n\t\t\tLook at the ships -- all grouped.  Perfect\n\t\t\ttargets!\n\n\t\t\t\t\tJAPANESE OFFICER\n\t\t\tAnd the planes!  They are -- what is that\n\t\t\tAmerican expression?  Sitting geese?\n\n\t\t\t\t\tYAMAMOTO\n\t\t\tSitting ducks.\n\n\t\t\t\t\tJAPANESE OFFICER\n\t\t\tHow can they be so foolish?\n\n\t\t\t\t\tYAMAMOTO\n\t\t\tThey think no one would be stupid enough\n\t\t\tto attack them at Pearl Harbor.\n\n\t\t\t\t\tGENDA\n\t\t\tOr perhaps they think no one is capable.\n\t\t\tLook at this...\n\n\tHe moves to a diagram displayed on the wall -- a simple\n\tdisplay showing water depth and ship displacement.\n\n\t\t\t\t\tGENDA\n\t\t\tPearl Harbor's depth of only forty feet\n\t\t\tmakes them feel safe.  A torpedo dropped\n\t\t\tfrom an airplane plunges to one hundred\n\t\t\tfeet before it can level off.  That is a\n\t\t\tconventional torpedo.  But we have been\n\t\t\texperimenting.\n\n\tFrom a stand beside his diagram he takes a set of wooden\n\tfins, attached to a circular metallic band.\n\n\t\t\t\t\tGENDA\n\t\t\tWooden fins.  We are testing them\n\t\t\ttomorrow.\n\n\tEXT.  JAPANESE ISLAND - DAY\n\n\tYamamoto and his planners have flown to a quiet Japanese\n\tisland, sunlit and pleasant.  They are gathered on the shore\n\tof the island's natural harbor.  Wooden targets -- basically\n\thuge plank barriers -- are sunk into the water like ships at\n\tanchor.  A squadron of Japanese planes zooms overhead, taking\n\tup attack positions.\n\n\t\t\t\t\tGENDA\n\t\t\tWe have chosen this place because its\n\t\t\tdepth is exactly the same as Pearl\n\t\t\tHarbor's.\n\n\tGenda speaks into a field radio.  A lone plane drops out of\n\tformation and goes into a low-level approach, speeding up and\n\tdropping its torpedo.\n\n\tBELOW THE SURFACE we see the torpedo as it plunges at two\n\thundred miles an hour into the sunlit sea.  With the wooden\n\tfins the torpedo makes a sharp dip and levels off above the\n\tsea floor.\n\n\tABOVE THE SURFACE the planners see the path of the torpedo;\n\tit hits the wooden barrier with a satisfying THUNK.  The\n\tplanners are impressed -- but Yamamoto is not satisfied.\n\n\t\t\t\t\tYAMAMOTO\n\t\t\tUncharged torpedoes have different\n\t\t\tbalance.\n\n\t\t\t\t\tGENDA\n\t\t\tI have arranged a live fire drill -- with\n\t\t\tyour permission.\n\n\tYamamoto nods; Genda speaks again into his radio, and another\n\tplane swoops down and drops a torpedo.  Genda holds his hands\n\tto his ears, causing the others to do the same; even though\n\tthey wonder at the need.\n\n\tThe torpedo hits the barrier, and the explosion is deafening,\n\tand of shocking force; the entire barrier is blown to\n\ttoothpicks.\n\n\t\t\t\t\tGENDA\n\t\t\tOf course against a ship the explosion\n\t\t\twill not be dissipated, and will have\n\t\t\tmore force.\n\n\tThe planners, nearly blown off their feet, nod as if they\n\tknew that all the time.\n\n\tINT.  MILITARY BASE - PILOTS' BARRACKS - NIGHT\n\n\tThe pilots are getting slicked up.\n\n\t\t\t\t\tBILLY\n\t\t\tAre you sure they're here?\n\n\t\t\t\t\tANTHONY\n\t\t\tIf Evelyn's here, the rest are here!\n\n\tRed moves up beside him to frown at the mirror.  His hair is\n\tplastered down and parted, his uniform's immaculate.\n\n\t\t\t\t\tANTHONY\n\t\t\tLooking good, Red.\n\n\t\t\t\t\tRED\n\t\t\tShut up.\n\n\tRed moves away, to polish his shoes.\n\n\t\t\t\t\tANTHONY\n\t\t\tWhat is it with Red?  I've never seen him\n\t\t\tthis way.\n\n\t\t\t\t\tBILLY\n\t\t\tHe's been like that all day.  Hey Danny,\n\t\t\tyou coming?\n\n\t\t\t\t\tDANNY\n\t\t\tNah, I'm gonna stay here.  Read.\n\n\tAnthony and Billy look at each other; Danny's in his bunk,\n\tand he's not reading, just staring at the ceiling.\n\n\tINT.  NURSES' BARRACKS - PEARL HARBOR - NIGHT\n\n\tThe nurses are primping to go out; Evelyn is in her uniform\n\tgetting ready to go back to work.\n\n\t\t\t\t\tBARBARA\n\t\t\tNow listen, it's hands off Billy.  I\n\t\t\tmean, you can put your hands on him if\n\t\t\tyou want to, but then my hands will break\n\t\t\tyours.\n\n\t\t\t\t\tBETTY\n\t\t\tHe was that good?\n\n\t\t\t\t\tBARBARA\n\t\t\tNo, I was.\n\n\tEXT.  NURSES' QUARTERS - OAHU - NIGHT\n\n\tCreeping through the vegetation, Red leads Anthony and Billy\n\tto a spot outside the nurses' barracks; they can see the\n\tgirls through the barracks window.\n\n\t\t\t\t\tBILLY\n\t\t\tRed, Peeping Tom stuff can get us court-\n\t\t\tmarshaled.\n\n\t\t\t\t\tRED\n\t\t\tShhh!\n\n\tAnthony and Billy are baffled, even more so when Red strides\n\tinto the open, right outside the nurses' window.\n\n\tAnd then, Red begins to sing.\n\n\t\t\t\t\tRED\n\t\t\t\t(singing)\n\t\t\tOh...Betty, Betty, Betty, you're the one\n\t\t\tfor me, Betty, Betty, Betty, Betty, can't\n\t\t\tyou see...\n\n\tAnthony and Billy look at each other, dumbfounded.  The\n\tnurses move to the open windows.  Red's singing is pretty\n\tgood -- though not that good.  But he doesn't stutter when he\n\tsings.\n\n\t\t\t\t\tRED\n\t\t\t\t(singing)\n\t\t\tI'll be yours for eternity, Betty, Betty,\n\t\t\tBetty, Betty, Betty!\n\n\tAnthony and Billy are hysterical, trying to keep their\n\tlaughter hidden.  But then they see the effect this is having\n\ton the women -- especially on Betty.  She's smitten.\n\n\tRed repeats the verse, really getting into it; when he\n\tfinishes, Betty runs out and hugs him, as all the nurses\n\tapplaud.  They move off into the darkness, arm and arm.\n\n\tThe nurses go back to their primping.\n\n\tAnthony and Billy are changed men.  Anthony stands up;\n\tBilly's baffled.  Anthony moves out and starts singing.\n\n\t\t\t\t\tANTHONY\n\t\t\t\t(singing)\n\t\t\tOh Sandra...I like you...love you...\n\n\tHe's terrible.  The nurses pelt him with hairbrushes,\n\tcurlers, shoes...\n\n\tEXT.  BASSINGBORNE AIRFIELD - BRITAIN - DAY\n\n\tComing out of the blustery skies at the end of another deadly\n\tday, a squadron of Spitfires chirps in for landings.  The\n\tplanes are shot up and battered.\n\n\tRafe is one of the pilots; the fuselage below his cockpit is\n\tmarked with four swastikas, symbols of his victories.  He\n\ttaxis to a stop, and is met by IAN, a Scottish mechanic, who\n\tis dismayed at the state of the plane.\n\n\t\t\t\t\tIAN\n\t\t\tLeapin' Jesus!\n\n\t\t\t\t\tRAFE\n\t\t\t\t(climbing down)\n\t\t\tThe struts are loose, the hydraulics are\n\t\t\tleaking, and the electrical system's\n\t\t\tshorting out in the cockpit.\n\n\t\t\t\t\tIAN\n\t\t\tWell which of those three ya want fixed?\n\n\t\t\t\t\tRAFE\n\t\t\tAll of 'em.\n\n\tRafe starts away, and Ian calls to his back --\n\n\t\t\t\t\tIAN\n\t\t\tIf ye'd wanted a bloody Cadillac ya\n\t\t\tshould'a stayed in the bloody States!\n\n\t\t\t\t\tRAFE\n\t\t\tAnd if you don't give me a plane that can\n\t\t\thandle combat, you better start learning\n\t\t\tto speak German.\n\n\t\t\t\t\tIAN\n\t\t\tFook ya!\n\n\t\t\t\t\tRAFE\n\t\t\tLearn English, then!\n\n\t\t\t\t\tIAN\n\t\t\tFook ya dooble!\n\n\tRafe moves to the barracks; Ian keeps the fueling hose going,\n\tand moves to help the armorers reload the guns.\n\n\tINT.  BRITISH AIRFIELD BARRACKS - NIGHT\n\n\tRafe falls down onto his cot, exhausted.  The other pilots do\n\tthe same, everybody spent from the day's combat.  Then they\n\thear the SIREN.  Rafe's out of his bunk, with the others,\n\teverybody running.\n\n\t\t\t\t\tBRITISH PILOT\n\t\t\tBloody Krauts!  Night raid!\n\n\tEXT.  BASSINGBORNE AIRFIELD - BRITAIN - NIGHT\n\n\tThey race across the runway.  Rafe reaches his Spitfire, just\n\tas Ian is removing the fueling hose.\n\n\t\t\t\t\tIAN\n\t\t\tI have'na been able ta --\n\n\t\t\t\t\tRAFE\n\t\t\tCrank her!\n\n\tIan gives the prop a spin, and the engine roars to life.\n\n\t\t\t\t\tIAN\n\t\t\tGod speed ya, laddie.\n\n\tEXT.  SKIES OVER THE ENGLISH CHANNEL - NIGHT\n\n\tIt's dark, but there are breaks in the clouds, giving way to\n\tpatches of light from a full moon.  The squadron of Spitfires\n\ttightens up for battle.\n\n\tRafe is positioned just right of the squad leader; he sees\n\tplanes breaking out of the dark clouds ahead.\n\n\t\t\t\t\tRAFE\n\t\t\tHere they come.\n\n\tThe clouds break, revealing a huge attack formation.\n\n\t\t\t\t\tBRITISH SQUAD LEADER\n\t\t\tAlpha group, on the bombers!  Beta group,\n\t\t\ttake the fighters!\n\n\tThey peel off, into action.\n\n\tEXT.  THE AIR BATTLE OVER THE CHANNEL - NIGHT\n\n\tWe stay with Rafe as he and the Squad Leader rush side by\n\tside at the lead bomber, blasting away with their guns.\n\n\tINT.  GERMAN BOMBER - IN THE AIR - NIGHT\n\n\tThe Spitfires' bullets rip into the pilot and also kill the\n\tnose gunner; the bomber dips as the copilot struggles to take\n\tcontrol.\n\n\tINT.  RAFE, IN HIS SPITFIRE - NIGHT\n\n\tAs he streaks past, Rafe sees the bomber wobble in the air.\n\n\t\t\t\t\tRAFE\n\t\t\tWe've got him hurt, stay on him!\n\n\tRafe throws his plane into an ultra-tight, high speed turn,\n\tright between the tails of the leader German group and the\n\tnoses of the second.  His turn is so tight that the plane\n\tflexes with the g-force.\n\n\tRafe comes out of his turn ahead of the Squad Leader, and\n\traces back up through the formation of German bombers, moving\n\tabove them where their weapons and armaments are the weakest.\n\tHe stitches a trail of bullets from tail to nose of the\n\twounded lead bomber; it begins to smoke.\n\n\tThe second Spitfire, the Squad Leader's, takes fire from the\n\tother German bombers, and shears off, heading through the\n\tsmoke of the plane Rafe has on the ropes.\n\n\t\t\t\t\tRAFE\n\t\t\tWe've got him going!\n\n\tRafe does a half-loop and half-spin, to bring him around to\n\tface the bombers again.  This time the g-force of the turn\n\tpops an oil line inside Rafe's cockpit; hot, pressurized oil\n\tbegins to spray everywhere -- all over Rafe, his controls,\n\tand worst of all, over the inside of his cockpit glass.\n\n\tHe wipes at the oil with his hands and that just smears it\n\tand makes it worse.\n\n\tHis wingman sees him veering away from the bombers...and sees\n\tthe German fighters moving up to meet him.\n\n\t\t\t\t\tSQUAD LEADER\n\t\t\tMcCawley!  Get to the clouds!  Get into\n\t\t\tthe clouds!\n\n\tRAFE, IN HIS PLANE, is flying blind.\n\n\t\t\t\t\tRAFE\n\t\t\tI can't see the clouds!\n\n\tHis problems are just beginning; the fluid is dripping down\n\tonto his cockpit's corroded electrical wiring; the fluid\n\tcauses an arc...a spark...and suddenly a fire is spreading\n\tthrough Rafe's plane.\n\n\tHe grabs his fire extinguisher and triggers a cloud that\n\tsnuffs the fire but fills the entire cockpit with choking\n\tsmoke; between that and the smeared fluid on his glass, he\n\tcan't see a thing.\n\n\tAnd the Messerschmidts are swarming over him.\n\n\tRafe's wingman dives in, raking the German planes as he\n\tpasses.\n\n\tRafe tries to open his cockpit cover to clear the smoke, but\n\tit's jammed; he pulls out his .45 pistol and BLAM!  BLAM!\n\tBLAM!  He blows out the glass; the smoke clears enough for\n\thim to take a breath and try to see.  He fights the stick,\n\tbut the plane won't respond.\n\n\tThe Messerschmidts rake him again, bullets riddling his\n\tengine.\n\n\t\t\t\t\tSQUAD LEADER\n\t\t\tGet out of there, McCawley!  Get out of\n\t\t\tthere!\n\n\tRafe's plane descends, ever faster, passing through clouds,\n\tthen clear air again.  The Squad Leader tries to chase and\n\tcover him, but Rafe's dropping fast, and still isn't out of\n\tthe plane as the Germans dive on him again, firing.\n\n\tRafe's Spitfire hits the broken fog over the water -- the\n\tSquad Leader loses sight of it for a moment -- and then the\n\tplane hits, splashing and exploding all at once.\n\n\tThe Squad Leader winces, and ducks into the clouds as he\n\treports on his radio...\n\n\t\t\t\t\tSQUAD LEADER\n\t\t\tMcCawley down.  No 'chute.\n\n\tEXT.  BATTLESHIP WEST VIRGINIA - PEARL HARBOR - DAY\n\n\tThe sailors have assembled on deck for the ship's heavyweight\n\tchampionship fight, a contest made more interesting to the\n\tsailors because one of the combatants is white and the other\n\tis black.\n\n\tThe battle is more toughness than technique.  The guys\n\tthrowing haymakers and shoving each other around the roped\n\tarea, as their shipmates cheer and make wild bets.  The white\n\tguy digs a punch deep into the black guy's ribs, and the\n\tblack guy slams a double left hook into the white guy's\n\tbelly, making him back up and say --\n\n\t\t\t\t\tWHITE BOXER\n\t\t\tYou hit hard -- for a cook.\n\n\tThe black guy rushes the white guy, only to catch a right\n\tcross that wobbles his knees and makes him stagger, with a\n\tfresh cut over his right eye.  The white guy now rushes in,\n\tand the black guy (his name is DORIE MILLER) throws an upper\n\tcut that drops his opponent like a sack of rocks.\n\n\tThe sailors cheer wildly.  Dorie steps back, and rubs his\n\tglove across his brow.  It's really bleeding now.\n\n\tEXT.  MILITARY BASE - DAY\n\n\tEvelyn is returning from church with six of her nurse\n\tfriends.  It's very quiet on a Sunday morning, almost nobody\n\tat the base; they walk along the path.\n\n\t\t\t\t\tBARBARA\n\t\t\tLet's get into civvies and find a bar.\n\n\t\t\t\t\tMARTHA\n\t\t\tRight after church?\n\n\t\t\t\t\tBARBARA\n\t\t\tYou've gotta sin some, to get\n\t\t\tforgiveness.  Come with us, Evelyn.  You\n\t\t\tneed some sin.\n\n\t\t\t\t\tEVELYN\n\t\t\tI've got to write some requisitions.\n\t\t\tWe're undersupplied with morphine.\n\n\t\t\t\t\tBETTY\n\t\t\tMorphine?  We've been here a month and\n\t\t\tnobody's had worse than a sunburn.\n\n\tEvelyn smiles softly and walks toward the base hospital.\n\n\t\t\t\t\tBETTY\n\t\t\tI wish she could forget him.\n\n\t\t\t\t\tBARBARA\n\t\t\tYou don't forget love, Honey.  Not ever.\n\n\tEXT.  HOSPITAL - PEARL HARBOR - DAY\n\n\tEvelyn approaches the hospital and finds the black boxer\n\tpeering in the window.  He's in a T-shirt and navy pants.\n\n\t\t\t\t\tEVELYN\n\t\t\tCan I help you, sailor?\n\n\tAs Dorie turns, she sees the cut on his head, closed only\n\twith a band-aid; it's dripping blood down his T-shirt.\n\n\t\t\t\t\tDORIE\n\t\t\t'Scuse me, 'Mam.  All the ship's doctors\n\t\t\tis golfing, and I couldn't find nobody to\n\t\t\tlook at this.\n\n\t\t\t\t\tEVELYN\n\t\t\tOur doctor's gone too.\n\n\t\t\t\t\tDORIE\n\t\t\tSorry to trouble you.\n\n\t\t\t\t\tEVELYN\n\t\t\tWait, let me look at that... You better\n\t\t\tcome in here.\n\n\tINT.  MILITARY BASE HOSPITAL - DAY\n\n\tMiller is sitting on a stool; Evelyn bathes the wound.\n\n\t\t\t\t\tEVELYN\n\t\t\tHow'd you get this?\n\n\t\t\t\t\tDORIE\n\t\t\tBoxin'.\n\n\t\t\t\t\tEVELYN\n\t\t\tWin?\n\n\t\t\t\t\tDORIE\n\t\t\tYes'm.\n\n\tHe says it without pride.  She puts down the basin.\n\n\t\t\t\t\tEVELYN\n\t\t\tWhat's your name?\n\n\t\t\t\t\tDORIE\n\t\t\tDorie Miller, 'Mam.\n\n\t\t\t\t\tEVELYN\n\t\t\tI'm Evelyn.  And I'm just a nurse.  But\n\t\t\tI'm not playing golf, and that cut needs\n\t\t\tsewing, or else it's gonna make a big\n\t\t\tlumpy scar.  Whatta ya say?\n\n\tINT.  HOSPITAL - PEARL HARBOR - LATER\n\n\tEvelyn clips the ends of her carefully applied stitches;\n\tDorie's eyes are rolled up as if he could watch from inside\n\this skull.\n\n\t\t\t\t\tEVELYN\n\t\t\tHow often you fight like this?\n\n\t\t\t\t\tDORIE\n\t\t\tEvery other Sunday.  I'm heavyweight\n\t\t\tchampion of the West Virginia.\n\n\t\t\t\t\tEVELYN\n\t\t\tWhat do you get for winning?\n\n\t\t\t\t\tDORIE\n\t\t\tRespect.\n\n\tShe hands him a mirror.  He studies her work.\n\n\t\t\t\t\tDORIE\n\t\t\tNo doctor would'a give me that good.\n\n\tShe walks him to the door.\n\n\t\t\t\t\tDORIE\n\t\t\tThank you, 'Mam.\n\n\t\t\t\t\tEVELYN\n\t\t\tTell me something, Dorie.  A man as big\n\t\t\tas you -- and smart too, you knew where\n\t\t\tto come when your ship couldn't help --\n\t\t\tdo you still have to fight with your\n\t\t\tfists to get respect?\n\n\t\t\t\t\tDORIE\n\t\t\tI left my Mama and joined the Navy to be\n\t\t\ta man.  They made me a cook -- and not\n\t\t\teven that, really -- I clean up after the\n\t\t\tother sailors eat.  I shine the officer's\n\t\t\tshoes.  In two years, they've never even\n\t\t\tlet me fire a gun.\n\n\tNow Evelyn understands.\n\n\t\t\t\t\tEVELYN\n\t\t\tYou take care, Dorie.\n\n\t\t\t\t\tDORIE\n\t\t\tYou too, 'Mam.\n\n\tEXT.  MILITARY BASE HOSPITAL - SUNSET\n\n\tDorie walks away, down the path between the palm trees.  She\n\twatches him go, and then is transfixed by someone else\n\tcoming, silhouetted by the light of the setting sun.  She\n\tcan't make out his face, but he's wearing a pilot's dress\n\tuniform, and coming to her right out of the warm orange\n\tsunset that she has stared at so many times.  Her heart slams\n\tagainst her ribs; she takes a few steps forward.\n\n\t\t\t\t\tEVELYN\n\t\t\t...Rafe...\n\n\tShe moves toward him, and he draws near her, walking slowly.\n\tAnd then she sees his face...\n\n\tIt's Danny.  His face as sad as death itself.\n\n\tAnd even before he tells her, she knows.\n\n\t\t\t\t\tDANNY\n\t\t\tLieutenant... I'm Danny Walker.  I'm Rafe\n\t\t\tMcCawley's best friend.\n\n\t\t\t\t\tEVELYN\n\t\t\tWere.  Isn't that what you mean?  Were.\n\t\t\tBecause he's dead, isn't he?  And that's\n\t\t\twhy you've come.\n\n\tEXT.  A BENCH - OVERLOOKING PEARL HARBOR - SUNSET\n\n\tEvelyn and Danny sit on the bench, with a sweeping view of\n\tthe harbor and the lights winking on all around it as the sun\n\tsettles beyond the horizon.  Evelyn is stoic, numb; Danny is\n\tthe one who is struggling.\n\n\t\t\t\t\tDANNY\n\t\t\tBefore Rafe left, he asked me to be the\n\t\t\tone to tell you, if it happened.\n\n\t\t\t\t\tEVELYN\n\t\t\tHe told me about you.  That he had no\n\t\t\tother friend like you.\n\n\t\t\t\t\tDANNY\n\t\t\tRafe's folks had a crop dusting business,\n\t\t\towned their own planes.  Real straight,\n\t\t\tfrugal.  My father was the town drunk.\n\t\t\tWent to sleep one night on the railroad\n\t\t\ttracks and was still there when the Dawn\n\t\t\tExpress came along.  Rafe and I were the\n\t\t\tonly ones at the funeral.  He took me\n\t\t\tback to his house, and I never left.\n\n\t\t\t\t\tEVELYN\n\t\t\tYou were more like brothers.\n\n\t\t\t\t\tDANNY\n\t\t\tI taught him to drink beer.  He taught me\n\t\t\thow to fly.\n\n\t\t\t\t\tEVELYN\n\t\t\tHe said you're the only one he ever saw\n\t\t\twho was better in the air than him.\n\n\t\t\t\t\tDANNY\n\t\t\t...He said that?\n\n\tEvelyn nods, still staring away from Danny.  This pierces\n\tDanny; he looks away, struggling not to let the emotions pull\n\thim completely under.\n\n\t\t\t\t\tDANNY\n\t\t\tLook, uh...Rafe's dad...he wrote me with\n\t\t\tthe news, and it took me a couple of days\n\t\t\tto work up the guts to come here and tell\n\t\t\tyou.  I'm not as brave as Rafe, or as\n\t\t\tnoble.  But if there's anything I can\n\t\t\tever do to help -- you let me know, okay?\n\n\tShe stares into the distance.  He stands and puts his hand on\n\ttop of hers, as much for his comfort as for hers.\n\n\t\t\t\t\tDANNY\n\t\t\tI understand why Rafe loved you.  You're\n\t\t\tas strong as he was.\n\n\tSince she's still not looking at him, he starts to move away.\n\tWhen he reaches the turn in the path, he looks back, and sees\n\ther figure in the gathering darkness.  She's begun to break\n\tdown; and as he watches, her whole body starts convulsing,\n\tand she doubles up in shattering grief.\n\n\tDanny can't just stand there; he moves back to her, and puts\n\ta hand on her shoulder.  He sits beside her again, and\n\tsuddenly she turns to him and sobs upon him.  Danny wraps her\n\tgently in his arms, and then he breaks down, having found the\n\tfirst place he can truly grieve.\n\n\tEXT.  JAPANESE BOMBING PRACTICE - JAPANESE ISLAND - DAY\n\n\tThe Japanese have constructed a replica of Pearl Harbor on\n\ttheir practice island; erecting new target barriers and\n\tsilhouettes of the various ships anchored at Pearl.  Streams\n\tof Japanese planes skim overhead in practice bombing runs,\n\tdropping dummy torpedoes and bombs.  From a control platform\n\terected on the beach, Yamamoto and Genda oversee it all.\n\n\t\t\t\t\tYAMAMOTO\n\t\t\tEverything real except the fact that no\n\t\t\tone is shooting back at us.\n\n\t\t\t\t\tGENDA\n\t\t\tIf we achieve surprise, they will offer\n\t\t\tlittle resistance.\n\n\t\t\t\t\tYAMAMOTO\n\t\t\tSet up teams of radio operators to send\n\t\t\tout messages the Americans will\n\t\t\tintercept, concerning every potential\n\t\t\tAmerican target in the Pacific.  Include\n\t\t\tHawaii -- the clutter will be more\n\t\t\tconfusing that way.\n\n\t\t\t\t\tGENDA\n\t\t\tBrilliant, Admiral.\n\n\t\t\t\t\tYAMAMOTO\n\t\t\tA brilliant man would find a way not to\n\t\t\tfight a war.\n\n\tHe looks out at the planes roaring into his practice harbor\n\tat top speed...\n\n\tINT.  PRESIDENTIAL BEDROOM - NIGHT\n\n\tRoosevelt's valet leans over him.\n\n\tRoosevelt wakes; beside the valet is a Presidential AIDE.\n\n\t\t\t\t\tAIDE\n\t\t\tMr. President, we've received a message\n\t\t\tfrom the Argentinian ambassador to Japan.\n\t\t\tHis sources tell him the Japanese are\n\t\t\tassembling their fleet to attack us.\n\n\t\t\t\t\tPRESIDENT ROOSEVELT\n\t\t\tWe're picking up warnings for every\n\t\t\tAmerican base in the Pacific.  Does this\n\t\t\tambassador know the target?\n\n\t\t\t\t\tAIDE\n\t\t\tNot for sure.  But he thinks it's Pearl\n\t\t\tHarbor.\n\n\t\t\t\t\tPRESIDENT ROOSEVELT\n\t\t\tTell the Pentagon.\n\n\tThe Aide leaves quickly and Roosevelt starts to get out of\n\tbed; his valet comes to help him.\n\n\t\t\t\t\tPRESIDENT ROOSEVELT\n\t\t\tNo, George, I need the practice, in case\n\t\t\tthere's a fire.\n\n\tRoosevelt drags himself out of bed, crawling toward the\n\tbathroom, his powerful arms dragging his lifeless legs.\n\n\tINT.  PENTAGON - DAY\n\n\tADMIRALS and other OFFICERS are gathered around a giant map\n\tof the Pacific.\n\n\t\t\t\t\tADMIRAL\n\t\t\tThe attack seems inevitable.  The\n\t\t\tquestion is where?  The way to answer\n\t\t\tthat question is to ask:  if we were the\n\t\t\tJapanese, how would we do it?\n\n\tHe nods to a VICE ADMIRAL, who stands over the map.\n\n\t\t\t\t\tVICE ADMIRAL\n\t\t\tBetween America and the Far East are the\n\t\t\tsea lanes where the winds and the\n\t\t\tcurrents make the best route for\n\t\t\tshipping.  Far above is the northern\n\t\t\troute, between Canada and Russia.\n\t\t\tBetween these two is something they call\n\t\t\tthe Vacant Sea.  If I were the Japs, I'd\n\t\t\tsend a task force there.  You could hide\n\t\t\tthe entire land mass of Asia in the\n\t\t\tVacant Sea, and nobody would know.\n\n\t\t\t\t\tADMIRAL\n\t\t\tSo they pop out and attack where?\n\n\t\t\t\t\tVICE ADMIRAL\n\t\t\tThat's the problem, Admiral.  They could\n\t\t\thit anywhere they want.\n\n\tNobody has any solution.\n\n\tEXT.  PACIFIC OCEAN - DAY\n\n\tA huge Japanese fleet steams toward Hawaii.  It is an awesome\n\tsight.  Carriers, battleships, destroyers, and entire battle\n\tgroup, traveling under complete radio silence, their hulls\n\tpower through the waves.  On the lower decks of the carriers\n\tare hundreds of planes -- fighters and bombers.\n\n\tEXT.  PEARL HARBOR - DAY\n\n\tThe American ships are lined up at anchor, calm, placid.\n\n\tEXT.  BEACH - DAY\n\n\tThe sailors and soldiers bask in the sun, play volleyball.\n\n\tThe aircraft carrier Lexington steams past toward the harbor\n\tentrance.\n\n\t\t\t\t\tVOLLEYBALL PLAYER 1\n\t\t\tWhere's the Lexington going?\n\n\t\t\t\t\tVOLLEYBALL PLAYER 2\n\t\t\tOut on maneuvers, like the Enterprise.\n\n\tEXT.  GOLF COURSES - OAHU - DAY\n\n\tMen in military haircuts -- officers -- stroll the golf\n\tcourses, enjoying themselves.\n\n\tINT.  DENTIST'S OFFICE - DAY\n\n\tThe DENTIST, an ethnic Japanese, is working on a patient with\n\this mouth agape.  The DENTIST ASSISTANT intrudes.\n\n\t\t\t\t\tDENTAL ASSISTANT\n\t\t\tDr. Takanawa, you have a call from Tokyo.\n\n\t\t\t\t\tDENTIST\n\t\t\tPlease excuse me.  Just relax.\n\n\tLeaving his patient with a mouth full of instruments, the\n\tDentist moves to his outer office, which looks directly out\n\tover Pearl Harbor.  He speaks in Japanese.\n\n\t\t\t\t\tDENTIST\n\t\t\tTakanawa... Yes?...\n\n\tHe seems confused by the call, but he responds by looking out\n\tover the harbor, then saying into the receiver --\n\n\t\t\t\t\tDENTIST\n\t\t\tYes, they are all...no wait, I see the\n\t\t\tbig one moving.  The one that's flat on\n\t\t\ttop, what do they call it?...\n\n\tINT.  SURVEILLANCE BASE - DAY\n\n\tSome tired Army Intelligence types -- A LISTENER, a TRACKER,\n\tand an INTELLIGENCE SUPERVISOR, are sitting at a bank of\n\tphones.  The LISTENER is a Japanese-American.\n\n\t\t\t\t\tLISTENER\n\t\t\tHere's something, over the line from\n\t\t\tTokyo.\n\n\tHe switches on the recording equipment and looks to the\n\tTRACER, sitting at a battery of equipment.\n\n\t\t\t\t\tTRACER\n\t\t\tIt's connected to a local dentist.  His\n\t\t\toffice is beside Pearl Harbor.\n\n\t\t\t\t\tINTELLIGENCE SUPERVISOR\n\t\t\tThis dentist, is he a spy?\n\n\t\t\t\t\tLISTENER\n\t\t\tSounds too innocent.  His accent is from\n\t\t\tthe old country.  Somebody official-\n\t\t\tsounding calls, he thinks it's\n\t\t\tdiscourteous not to respond.\n\n\tINT.  BARBER SHOP - DAY\n\n\tAdmiral Kimmel is settling into the barber chair when his\n\tAIDE enters and nods for the barber to move a few paces away,\n\tso that he can speak privately.\n\n\t\t\t\t\tAIDE\n\t\t\tSir, we just had an intelligence\n\t\t\tintercept.  Someone from Tokyo called a\n\t\t\tlocal dentist whose office looks over\n\t\t\tPearl.  They wanted to know the exact\n\t\t\tlocation of the ships.\n\n\t\t\t\t\tADMIRAL KIMMEL\n\t\t\tSomeone from Tokyo asks a dentist how the\n\t\t\tships are sitting... What are we supposed\n\t\t\tto do about that?\n\n\t\t\t\t\tAIDE\n\t\t\tI...don't know, Sir.  But it just seemed\n\t\t\tsignificant.\n\n\t\t\t\t\tADMIRAL KIMMEL\n\t\t\tHave intelligence keep monitoring him.\n\n\tThe Admiral sinks back into the chair.\n\n\tEXT.  MILITARY BASE HOSPITAL - DAY\n\n\tA young amateur PHOTOGRAPHER, about 16, wearing a hat with\n\t\"PICTURES OF PARADISE\" printed on it's crown is ready to snap\n\ta shot of Evelyn and her nurse friends having a picnic lunch\n\ton the lawn outside the hospital.\n\n\t\t\t\t\tPHOTOGRAPHER\n\t\t\tCloser, ladies!  Closer!  Now smile!...\n\t\t\tGreat!  Next week I'll show you a print\n\t\t\tand you can order your Pictures of\n\t\t\tParadise!\n\n\tHe hustles off.  Betty hands out picnic baskets.\n\n\t\t\t\t\tBETTY\n\t\t\tBarbara, here's yours...and Evelyn, here\n\t\t\tyou are.\n\n\tEvelyn opens her basket, and finds a lei of Hawaiian flowers\n\tstuffed in the top.  Betty scoots over and puts the flowers\n\taround Evelyn's neck.\n\n\t\t\t\t\tBETTY\n\t\t\tIt's been a month and you haven't smiled.\n\t\t\tWe just want you to know we love you.\n\n\tEvelyn's touched -- but before she can react two P-40's zoom\n\tout of the skies, wings clipping the tops of the palm trees\n\tas they blast over head.\n\n\tINT.  COCKPIT'S OF THE P-40'S - DAY\n\n\tDanny and Anthony are the pilots; as they pull up and away,\n\tthey pass over some officers on the golf course, scaring the\n\tshit out of them as they putt.\n\n\tEXT.  MILITARY BASE HOSPITAL - DAY\n\n\tThe nurses have sprawled to the ground; now even Evelyn is\n\tsmiling.\n\n\t\t\t\t\tBARBARA\n\t\t\tWhat is it with nurses and pilots?\n\n\tEXT.  MILITARY BASE HOSPITAL - PEARL HARBOR - EVENING\n\n\tEvelyn walks out of the hospital.  She's still wearing her\n\tlei.  The sun is going down in a spectacular sunset.\n\n\tShe stares at the orange glow at the edge of the world.  She\n\tbreathes in the sea air, and tries to breathe out the\n\tsadness.  The water of the harbor laps close to where she\n\tstands, the sunset polishing its surface.\n\n\tShe takes the lei from her neck, plucks a single flower, and\n\tholds it like the rose Rafe once gave her.  Then she tosses\n\tthe rest of the lei into the ocean and watches it float away,\n\tas the sun sinks behind the horizon.\n\n\tINT.  MILITARY BASE HOSPITAL - NIGHT\n\n\tEvelyn finds her purse, and tucks the flower into it.  She's\n\talone in the hospital, everyone else has gone; she turns her\n\tmind toward work, something to lose herself in.\n\n\tEXT.  MILITARY BASE - NEAR THE PILOTS' BARRACKS - DAY\n\n\tDanny is walking toward the barracks when a COLONEL hopping\n\tmad, confronts him.\n\n\t\t\t\t\tCOLONEL\n\t\t\tYou're Walker, right?\n\n\t\t\t\t\tDANNY\n\t\t\tYes Sir.\n\n\t\t\t\t\tCOLONEL\n\t\t\tThat was a nice little stunt you pulled,\n\t\t\tbuzzing the base.\n\n\t\t\t\t\tDANNY\n\t\t\tYou liked that?\n\n\t\t\t\t\tCOLONEL\n\t\t\tOh yeah.  I liked it so much I'm cutting\n\t\t\tyou out of the squadron.\n\n\t\t\t\t\tDANNY\n\t\t\tSir?\n\n\t\t\t\t\tCOLONEL\n\t\t\tI don't buy that hot dog shit.  So you\n\t\t\tand your buddies are gonna transfer your\n\t\t\tplanes up to Haleiwa.\n\n\t\t\t\t\tDANNY\n\t\t\tHale-what?\n\n\t\t\t\t\tCOLONEL\n\t\t\tYou'll love it.  No base, no bars, just\n\t\t\tlots of sun and aircraft maintenance.\n\n\t\t\t\t\tDANNY\n\t\t\tSir, I --\n\n\t\t\t\t\tCOLONEL\n\t\t\tToo late for apologies, Walker.\n\n\t\t\t\t\tDANNY\n\t\t\tI wasn't gonna apologize, Sir.  I was\n\t\t\tjust gonna say it was worth it to feel\n\t\t\tlike a real pilot again, even if it was\n\t\t\tonly for five seconds.\n\n\tThe Colonel glares at him and stalks away.\n\n\tINT.  BASE CANTEEN - NIGHT\n\n\tDanny and Evelyn are having coffee at the base canteen.\n\n\t\t\t\t\tDANNY\n\t\t\tHow's everything?\n\n\t\t\t\t\tEVELYN\n\t\t\tWe got some soldiers in traction from a\n\t\t\tjeep accident, but it's quiet.  Except\n\t\t\tfor the occasional fighter plane buzzing\n\t\t\tus.\n\n\t\t\t\t\tDANNY\n\t\t\tThat might not have been such a good\n\t\t\tidea.  They're making us fly out of a\n\t\t\thalf-paved airfield.  The real punishment\n\t\t\tis that I won't be back to the barracks\n\t\t\ttill it's too late for dinner or coffee.\n\t\t\tSo I guess it's goodbye for awhile.\n\n\t\t\t\t\tEVELYN\n\t\t\tI was just thinking that war is a series\n\t\t\tof goodbyes.  Do you think that's why\n\t\t\twe're meeting.  To help us say goodbye to\n\t\t\tRafe?\n\n\t\t\t\t\tDANNY\n\t\t\tI swore not to talk about him tonight,\n\t\t\tbut there's all this stuff I think I\n\t\t\tought to tell you, that he didn't get a\n\t\t\tchance to.  Rafe was...he was lonely.  He\n\t\t\thad such high expectations of himself\n\t\t\tthat he always felt empty.  The week he\n\t\t\tmet you he told me he felt his heart had\n\t\t\talways lived in winter, and for the first\n\t\t\ttime in his life he has seen the spring.\n\n\tHe's been lost in his own thoughts of Rafe; now he notices\n\tthe tears welling up in her eyes.\n\n\t\t\t\t\tDANNY\n\t\t\tSorry.\n\n\t\t\t\t\tEVELYN\n\t\t\tHe told me he didn't want to leave me\n\t\t\twith regret.  Now that's all I have.\n\n\t\t\t\t\tDANNY\n\t\t\tHey, have you seen Pearl Harbor at night?\n\n\t\t\t\t\tEVELYN\n\t\t\tWell...sure.\n\n\t\t\t\t\tDANNY\n\t\t\tFrom the air?\n\n\tEXT.  HALEIWA AIR FIELD - NIGHT\n\n\tA P-40 takes off from the remote airfield, lit only by the\n\tfull moon.\n\n\tINT.  P-40 - NIGHT\n\n\tEvelyn sits on Danny's lap, like Rafe sat in his Daddy's lap\n\tyears before.  Danny flies easily, the cockpit open, his arms\n\tslipped under hers.\n\n\tThe sky above them is startlingly clear; a billion stars\n\tdancing around a full moon.\n\n\t\t\t\t\tEVELYN\n\t\t\tSo beautiful!\n\n\t\t\t\t\tDANNY\n\t\t\tHang on.\n\n\tHe spins the plane in an easy half turn, inverting their\n\theads above Pearl Harbor, gorgeous in the moonlight, the\n\tbattleships aglow, the moon reflected in the peaceful water,\n\tembraced by the island of Oahu.\n\n\tEXT.  HALEIWA AIR FIELD - NIGHT\n\n\tThe P-40 soars easily in and settles to earth.  Danny shuts\n\tdown the engine.  Danny carefully removes the harness around\n\ther.  She looks overhead.  The stars are still bright above\n\tthem.\n\n\t\t\t\t\tEVELYN\n\t\t\tI didn't realize until tonight that I've\n\t\t\tstopped wanting to live.\n\n\tShe turns in his lap, and looks at him.  Their eyes connect.\n\tTentatively, almost reluctantly, they kiss.\n\n\tEXT.  MILITARY BASE HOSPITAL - NIGHT\n\n\tThe POV of someone moving through the gathering darkness\n\tapproaches the hospital.\n\n\tThe lights from within the hospital, and the pristine white\n\tbeds beneath those lights, give the place a kind of glow,\n\twhere Evelyn moves alone and beautiful, like a ballerina in a\n\tgiant's jewel box.\n\n\tNow we see the shoulders of the figure, from behind, and can\n\ttell that it is a man in uniform, but at first we can't tell\n\twho.  He's standing dead still, transfixed in watching Evelyn\n\tthrough the windows.\n\n\tINT.  BASE HOSPITAL - NIGHT\n\n\tEvelyn moves to her desk, and sits down.  She looks at the\n\tcalender turning back to October, where she wrote on the\n\tsquare of October 22, \"Order supplies\" -- she counts the\n\tweeks from then to today, December 6.\n\n\tEXT.  MILITARY BASE HOSPITAL - NIGHT\n\n\tWe see the full figure of the man watching her.  And now we\n\tsee his face.  It is Rafe.\n\n\tHis left hand is bandaged, but he is very much alive --\n\tthough seeing Evelyn has taken his breath, and even seems to\n\thave robbed him of the power to move.  His eyes pick up every\n\tdetail of her -- her face...her hands.\n\n\tAnd as Rafe watches Evelyn, he has the SUDDEN JOLTS OF\n\tSUBLIMINAL FLASHBACKS...punctuated by fragments of the letter\n\tshe wrote to him, and INTERCUT with Rafe in the present,\n\twatching Evelyn.\n\n\t\t\t\t\tEVELYN'S VOICE\n\t\t\tDearest Rafe --\n\n\tIN SUBLIMINAL FLASHBACK, RAFE'S SPITFIRE, crippled and\n\ttrailing smoke, passing through a patch of cloud as Rafe\n\thurls himself from the cockpit and jerks the ripcord of his\n\tchute.\n\n\tIN THE PRESENT...Rafe's face winces with the memory, and he\n\trivets his eyes on Evelyn, as if to force himself to know\n\tthat this moment is real.\n\n\tSUBLIMINAL FLASHBACK...RAFE LANDS IN THE WATER, and the shock\n\tof its coldness travels up his body faster than his body\n\tsinks into the water.  He's cloaked in the fog; his\n\tparachute, pushed by the wind, is pulling him along face\n\tdown.  He fights with the straps, flips himself over, and\n\tpulls the release...\n\n\tBut he's still in desperate trouble; in his flying clothes,\n\this heavy leather jacket soaking with sea-water, he's going\n\tdown; his body sinks beneath the surface...\n\n\t\t\t\t\tEVELYN'S VOICE\n\t\t\t...Every sunset...\n\n\tIN THE PRESENT, Rafe's chest trembles... Is it from the\n\tmemory of the frozen water, from the emotion of seeing Evelyn\n\tagain -- or both?\n\n\tSUBLIMINAL FLASHBACKS -- Below the surface of the North Sea,\n\tRafe's body drifts, but he fights his way back up...he kicks\n\toff his shoes, sheds the jacket, strips off his pants and\n\tstarts tying the cuffs into knots.\n\n\tThen, in a CUT, he is floating in the water, his pants turned\n\tinto a makeshift life preserver, his body shaking\n\tconvulsively from the cold.\n\n\tThen in another CUT we see him after he's been in the water\n\tfor so long that his body no longer trembles; he's lost\n\tconsciousness.  He has no strength, no will to live... His\n\tface settles into the water...his body slips from his\n\tpreserver, and drifts beneath the surface...\n\n\t\t\t\t\tEVELYN'S VOICE\n\t\t\t...gather it's heat into my heart, and\n\t\t\tsend it to you...\n\n\tIN FLASHBACK, Rafe beneath the surface... His eyes come open.\n\tFrom his POV beneath the water, he sees something above the\n\tsurface.  It's only in his mind, but that makes it no less\n\treal...an orange glow, the warmth of the sunset, and her face\n\tabove the surface... His limbs come to life, and he fights\n\this way up, breaking the surface.  The whole sea around him\n\tis dark and empty, but he grabs his makeshift preserver and\n\tholds on for dear life...and for Evelyn.\n\n\tIN THE PRESENT Rafe stares through the window, at Evelyn, but\n\the can't go in.  He backs away from the window.\n\n\tINT.  PILOT'S BARRACKS - NIGHT\n\n\tA Japanese-American MESSAGE BOY parks his motorbike outside\n\tand enters the barracks.\n\n\t\t\t\t\tMESSAGE BOY\n\t\t\tDaniel Walker?...\n\n\tDanny rises from his bunk and accepts the telegram.  As the\n\tmessage boy leaves, Danny reads... The news he learns stuns\n\thim...\n\n\tEXT.  BENCH - OUTSIDE THE HOSPITAL - NIGHT\n\n\tRafe is still lost in thought.  He hears steps running up --\n\tand sees Danny -- who spots him at the same moment.\n\n\t\t\t\t\tDANNY\n\t\t\tRafe!\n\n\tINT.  MILITARY BASE HOSPITAL - NIGHT\n\n\tEvelyn puts away the calender.\n\n\tEXT.  MILITARY BASE HOSPITAL - NIGHT\n\n\tRafe is sitting at the bench, his head down.\n\n\tANGLE - Evelyn on the path; she sees someone on the bench,\n\this form hauntingly familiar.  He hears her, and looks up.\n\tIt's Rafe.\n\n\tFrom Evelyn's POV, the whole world spins.  She faints.\n\n\tRafe jumps to catch her before she slams to the ground.  He\n\tgathers her into his arms, and she looks up into his face.\n\tHe's real, very real.\n\n\t\t\t\t\tRAFE\n\t\t\tEvelyn.\n\n\tShe's trembling, shaking.  He lifts her to her feet, and\n\tmoves her to the bench.\n\n\t\t\t\t\tRAFE\n\t\t\tI sent telegrams, I guess the military\n\t\t\ttraffic held them up.\n\n\t\t\t\t\tEVELYN\n\t\t\tWhy were you sitting here, instead of...\n\n\t\t\t\t\tRAFE\n\t\t\tI saw you, I couldn't go in, I...just\n\t\t\tstood there wondering if you knew.  You\n\t\t\tlooked...sad, and I had to sit down a\n\t\t\tminute.\n\n\t\t\t\t\tEVELYN\n\t\t\tHow did you?...\n\n\t\t\t\t\tRAFE\n\t\t\t...Survive?  I jumped in a patch of fog,\n\t\t\tand nobody could see me.  I hit the water\n\t\t\thard.  And it was so...cold.\n\n\tHe looks toward the horizon, when the last light of day fades\n\tto black.  There's something he thinks about saying, and\n\tdoesn't.  Then...\n\n\t\t\t\t\tRAFE\n\t\t\tI don't know how long I was in the water.\n\t\t\tA Norwegian freighter picked me up.  They\n\t\t\twere headed to Spain.  They docked in La\n\t\t\tRota, right beside a German ship, and\n\t\t\ttold me to stay hidden below.  I was\n\t\t\tafraid they'd turn me in, so I stole some\n\t\t\tclothes, jumped ship, and found a church,\n\t\t\twhere the priest contacted the\n\t\t\tresistance, and got me on a freighter to\n\t\t\tNew York.\n\n\tHe looks at her, then looks down again.\n\n\t\t\t\t\tRAFE\n\t\t\tI called my folks, then Colonel\n\t\t\tDoolittle.  The Colonel sent a man to\n\t\t\tpick me up.  They wanted to debrief me.\n\t\t\tI told the Colonel I needed to see\n\t\t\tsomebody first, and he had a supply\n\t\t\tflight heading out in an hour.\n\t\t\t\t(beat)\n\t\t\tI've done a lot of talking.  You haven't\n\t\t\tsaid anything.\n\n\t\t\t\t\tEVELYN\n\t\t\tI'm just...so amazed, so glad to know\n\t\t\tthat you're okay.  You are okay, aren't\n\t\t\tyou?\n\n\t\t\t\t\tRAFE\n\t\t\tNothing that won't heal.  I guess.\n\n\tAt these words, she looks at him for a long, long moment.\n\n\t\t\t\t\tEVELYN\n\t\t\tIt's been...so different, being so sure\n\t\t\tyou were dead.\n\n\t\t\t\t\tRAFE\n\t\t\tI'm so sorry for what you must've gone\n\t\t\tthrough, but I'm back.\n\n\tHe sees the troubled look on her face.\n\n\t\t\t\t\tRAFE\n\t\t\tMaybe I've assumed too much.  Has\n\t\t\tsomething changed?\n\t\t\t\t(beat)\n\t\t\tI'm afraid to ask what.  And I'm afraid\n\t\t\tnot to.\n\t\t\t\t(beat)\n\t\t\tHave you fallen in love?\n\n\tShe nods; she can't even say it.  Rafe's dying inside.\n\n\t\t\t\t\tRAFE\n\t\t\tIt's all right.  Danny always said I see\n\t\t\tthings with my emotions instead of my\n\t\t\teyes.\n\n\t\t\t\t\tEVELYN\n\t\t\tIt's not your fault, Rafe.  The letter I\n\t\t\twrote you, they --\n\n\t\t\t\t\tRAFE\n\t\t\tDon't worry about that.  Guys away from\n\t\t\thome, lonely, good-hearted women try to\n\t\t\tcheer them up.\n\n\t\t\t\t\tEVELYN\n\t\t\tIt's not that I didn't mean everything I\n\t\t\twrote.  It's just that -- I thought you\n\t\t\twere dead.  And now --\n\n\tDanny runs up, through the darkness.\n\n\t\t\t\t\tDANNY\n\t\t\tYou're alive!\n\n\tRafe and Danny stare at each other; Danny hesitates, looking\n\tfrom Rafe to Evelyn, wondering what they've said.  Then Rafe\n\tlooks at Evelyn, and picks up the look on her face.  In that\n\tmoment he puts it all together.\n\n\t\t\t\t\tRAFE\n\t\t\tAw, God.  Oh my God.\n\n\tDanny's speechless, and for a moment Evelyn is too.\n\n\t\t\t\t\tEVELYN\n\t\t\tRafe --\n\n\tHe puts up a hand, to silence her, and walks away suddenly.\n\tEvelyn and Danny are left frozen.\n\n\tEXT.  SHORE OF PEARL HARBOR - NIGHT\n\n\tRafe stares out at the harbor, seeing nothing.  As he stands\n\tthere alone and shattered, he has one more\n\n\tSUBLIMINAL FLASHBACK\n\n\tRafe is in the water of the North Sea; he seems dead, but his\n\tmakeshift preserver is keeping his face above the surface.\n\tSomething slides through the water and stops beside him; it's\n\ta dinghy, and behind it is a trawler.\n\n\tHands grab Rafe and drag him onto the dinghy...\n\n\tIn a QUICK CUT, Rafe's body is laid out on the deck of the\n\ttrawler.  The crewmen think he's dead.  His body is stiff,\n\this lips white; and they say so, in Norwegian...\n\n\tBut one of the other crewmen notices a quiver in his eyelid,\n\tthen quickly covers Rafe with his on wool peacoat and presses\n\tback an eyelid to see his pupils.  Rafe's white lips move.\n\tThe crewmen realize he's trying to say something.\n\n\tAnd Rafe does utter something, barely audible; something the\n\tNorwegian crewmen don't understand.\n\n\t\t\t\t\tRAFE\n\t\t\tEvelyn...\n\n\tIN THE PRESENT Rafe struggles to bury that memory so far that\n\the'll never feel it again.\n\n\tEXT.  NURSES' QUARTERS - NIGHT\n\n\tDanny escorts Evelyn back to her quarters.\n\n\t\t\t\t\tDANNY\n\t\t\tDon't worry.  I'll find him.\n\n\tHe hugs her; their embrace earnest yet tingled with guilt,\n\tand Danny leave quickly.  Betty steps out of the nurses'\n\tquarters and hands Evelyn a telegram.\n\n\t\t\t\t\tBETTY\n\t\t\tThis came while you were gone.\n\n\tEvelyn knows it's the telegram from Rafe, to tell her he's\n\talive.  Without opening it, she begins to cry, and hurries\n\taway from the barracks so the other nurses won't see.\n\n\tEXT.  HICKAM FIELD - NIGHT\n\n\tDanny crosses the tarmac toward the clustered P-40's.  He\n\tspots what he's looking for.  Sitting in the cockpit of one\n\tof the P-40's is Rafe.  Rafe won't look at him.  Danny climbs\n\tup on the wing, and sits down there.\n\n\t\t\t\t\tDANNY\n\t\t\tYou'd always go sit in a plane whenever\n\t\t\tyou were upset.\n\n\t\t\t\t\tRAFE\n\t\t\tUpset?  Why should I be upset?\n\n\t\t\t\t\tDANNY\n\t\t\tLet's go get a drink.  Unless you're\n\t\t\tscared to talk about it.\n\n\tCLOSE - A Mai-Tai volcano clunks onto a table.\n\n\tINT.  FUNKY OAHU BAR - DAY\n\n\t\t\t\t\tDANNY\n\t\t\tDrink up.  Then we'll talk.\n\n\tRafe takes the challenge, and takes a long pull on one of the\n\tstraws.  Red, Anthony, Billy, and several others enter the\n\tbar.\n\n\t\t\t\t\tANTHONY\n\t\t\tRafe?!\n\n\tThey rush the table...\n\n\tINT.  FUNKY OAHU BAR - LATER\n\n\tThey're all drinking, and the whole bar is rocking.  Rafe\n\tuses glasses to show his buddies tactics.\n\n\t\t\t\t\tRAFE\n\t\t\tThey'll go under you because their planes\n\t\t\tare faster, then they run so you can't\n\t\t\tcatch 'em.  But then they'll come around\n\t\t\tand take you from behind -- like some\n\t\t\tAmericans will.\n\n\tThe last words bring the group to silence.  The other guys\n\tdrift away, to give them room.\n\n\t\t\t\t\tRAFE\n\t\t\tSorry.\n\n\t\t\t\t\tDANNY\n\t\t\tWhy be sorry?  That's what you feel, it's\n\t\t\tbetter to come out with it.\n\n\t\t\t\t\tRAFE\n\t\t\tI didn't mean it.\n\n\t\t\t\t\tDANNY\n\t\t\tSure you did.  So come on.  Say what you\n\t\t\tthink.\n\n\t\t\t\t\tRAFE\n\t\t\tWaitress!  Four beers!\n\n\t\t\t\t\tDANNY\n\t\t\tYou don't wanna put beer over mai-tai.\n\n\t\t\t\t\tRAFE\n\t\t\tIf you can't keep up, don't drink yours.\n\n\tThe waitress delivers four bottles to the table.  Rafe takes\n\ta slow sip, then stares at Danny.\n\n\t\t\t\t\tRAFE\n\t\t\tWe gotta face some facts here.\n\n\t\t\t\t\tDANNY\n\t\t\tWhat facts are those?\n\n\t\t\t\t\tRAFE\n\t\t\tI understand how it could happen.  I know\n\t\t\twhy any guy would love her.  And I can't\n\t\t\tblame you that it happened.  You thought\n\t\t\tI was dead, she was grieving, you were\n\t\t\ttrying to help her.\n\n\t\t\t\t\tDANNY\n\t\t\tI was grieving too.\n\n\t\t\t\t\tRAFE\n\t\t\tYeah, right.  Anyway, you didn't know.\n\n\t\t\t\t\tDANNY\n\t\t\tSo what are you saying?\n\n\t\t\t\t\tRAFE\n\t\t\tI'm saying now you do know.  So it's time\n\t\t\tfor you to fuck off.\n\n\t\t\t\t\tDANNY\n\t\t\tYou left her.  How's that for a fact?\n\n\t\t\t\t\tRAFE\n\t\t\tHow's this for a fact?  I loved her\n\t\t\tfirst.\n\n\tDanny takes a long pull of beer, and Rafe does the same.\n\n\t\t\t\t\tDANNY\n\t\t\tYou know, you're a lousy drinker.\n\t\t\tDrinking's supposed to make men feel\n\t\t\tbigger.  It only makes you stupid.  And\n\t\t\tweak.\n\n\tRafe nods thoughtfully, and sets down his beer.\n\n\t\t\t\t\tRAFE\n\t\t\tHow's this?\n\n\tBAM!  He knocks Danny out of the chair, flat on his ass.\n\tDanny backhands the blood from the corner of his mouth.\n\n\t\t\t\t\tDANNY\n\t\t\tYou want it, you got it.\n\n\tHe kicks Rafe in the back of the knee, then mule kicks him in\n\tthe chest as he goes down, and the fight is on.\n\n\tThe bar's bouncer, a big Samoan, moves over to break them up\n\t-- but Anthony steps in his way.\n\n\t\t\t\t\tANTHONY\n\t\t\tLet 'em fight, they need it.\n\n\tThe bouncer tosses Anthony aside, but before he can move in\n\tto interrupt the fight, Red breaks a lava volcano of Mai-Tai\n\tover the bouncer's skull.  The bartender picks up the phone\n\tto call the M.P.'s.\n\n\tRafe and Danny are exchanging punches in the middle of the\n\troom.  Sailors sitting at the bar have swung around on their\n\tstools to watch the action.  The other pilots are wincing\n\twith the punches their friends exchange, and bobbing and\n\tweaving as if in the fight themselves.  A SAILOR tapes Billy.\n\n\t\t\t\t\tSAILOR\n\t\t\tIs this a private fight or can anybody\n\t\t\tjump in?\n\n\tBilly hits him.  The whole bar erupts.\n\n\tRafe and Danny are really having at it, fueled by so much\n\temotion that nothing hurts.  They're on the floor now, trying\n\tto rip each other apart.  They struggle to their feet and\n\tRafe manages to knee Danny in the balls.  Danny doubles over\n\tin pain.\n\n\t\t\t\t\tRAFE\n\t\t\tThat hurt?  I didn't think you had any\n\t\t\tballs.\n\n\tWithout looking up, Danny lunges at Rafe, tackling him around\n\tthe waist, driving him at the wall.\n\n\tBut they don't hit the wall; they tumble through the back\n\twindow of the bar -- not covered in glass, but fronds and\n\twood -- and out into the back alley.\n\n\tThey're lying there in the debris when they see the M.P.\n\tjeeps coming.  They drag each other to their feet, and run\n\taway.\n\n\tEXT.  PACIFIC OCEAN - NIGHT\n\n\tThe Japanese task force rumbles through the night, the bows\n\tof the great ships blasting through the crashing waves.\n\n\tINT.  AIRCRAFT CARRIER AKAGI - NIGHT\n\n\tYamamoto's flagship.  The clock reaches midnight, and a\n\tsailor tears off it's calender.  It's December 7, 1941.\n\n\t\t\t\t\tYAMAMOTO\n\t\t\tThe submarines will be reaching the\n\t\t\tharbor soon.  I hope they don't set off\n\t\t\tthe alarm too soon.\n\n\tEXT.  PACIFIC OCEAN - NEAR PEARL HARBOR - NIGHT\n\n\tAn American destroyer, the SELFRIDGE, leads a squadron of\n\tdestroyers on patrol, near the entrance of Pearl Harbor.\n\tLOOKOUTS on the bridge think they spot something.\n\n\tINT.  CONTROL ROOM - DESTROYER SELFRIDGE - NIGHT\n\n\tThe WATCH OFFICER listens to a report on his headset and\n\tturns to the CAPTAIN.\n\n\t\t\t\t\tWATCH OFFICER\n\t\t\tCaptain, lookouts report a sighting, two\n\t\t\tpoints off the starboard beam.\n\n\tThe sonar operator looks up and nods.\n\n\t\t\t\t\tSELFRIDGE CAPTAIN\n\t\t\tHow big?\n\n\t\t\t\t\tSONAR OPERATOR\n\t\t\t...I've lost it.\n\n\t\t\t\t\tSELFRIDGE CAPTAIN\n\t\t\tProbably a blackfish.  I've seen them\n\t\t\tlook like subs.\n\n\tEXT.  PACIFIC OCEAN - NEAR PEARL HARBOR - NIGHT\n\n\tAnother destroyer, the RALPH TALBOT, cruises behind the\n\tSelfridge.  On it's bridge, the DUTY OFFICER speaks to the\n\tCAPTAIN.\n\n\t\t\t\t\tDUTY OFFICER\n\t\t\tSir, Selfridge reports a contact, then\n\t\t\tlost it.  Now our sonar reports the\n\t\t\tcontact.\n\n\tThe Captain looks toward the Selfridge, then trains his\n\tbinoculars on the water were the Duty Officer points.  He\n\tsees something dark and black slipping along beneath the\n\tsurface.  He gets onto his intercom.\n\n\t\t\t\t\tCAPTAIN OF THE RALPH TALBOT\n\t\t\tRadio room!  Raise the Selfridge.  Tell\n\t\t\tthe Squadron Commander we have spotted a\n\t\t\tsub and request permission to depth\n\t\t\tcharge.\n\n\tHe looks again at the black shape, passing a few hundred\n\tyards from them.\n\n\t\t\t\t\tCAPTAIN OF THE RALPH TALBOT\n\t\t\tWe're five miles from Pearl Harbor and\n\t\t\tit's moving in from the open sea.\n\t\t\tPrepare to move to attack speed.\n\n\tThe INTERCOM comes alive.\n\n\t\t\t\t\tINTERCOM\n\t\t\tSir, the Squadron Commander on Selfridge\n\t\t\tdenies permission.\n\n\t\t\t\t\tCAPTAIN OF THE RALPH TALBOT\n\t\t\tWhat?\n\n\t\t\t\t\tINTERCOM\n\t\t\tDenies, Sir.  He says it's a blackfish.\n\n\tThe Captain chokes back his frustration and shuts down the\n\tintercom -- but then he says to the Duty Officer, as they\n\twatch the shape disappear toward Pearl Harbor...\n\n\t\t\t\t\tCAPTAIN OF THE RALPH TALBOT\n\t\t\tIf it's a blackfish, it has a motorboat\n\t\t\tup it's ass!\n\n\tEXT.  OAHU - ROAD - NIGHT\n\n\tDanny has pulled his Buick convertible off the road; Rafe is\n\tbent over, his head out of frame; he's throwing up.  Danny's\n\tbanged up from the fight and still drunk himself; he waits\n\tbeside Rafe, who chokes out between heaves --\n\n\t\t\t\t\tRAFE\n\t\t\tHow come you're not pukin'?\n\n\t\t\t\t\tDANNY\n\t\t\tI guess I'm used to it.  I've felt like\n\t\t\tthrowing up every minute since you got\n\t\t\tback.\n\n\tRafe straightens up, but the waves of sickness come back over\n\thim and he bends over again.  Danny looks at his friend, and\n\tthe pain is written on Danny's face.\n\n\t\t\t\t\tDANNY\n\t\t\tDon't blame her, Rafe.  It's not like\n\t\t\tyou're thinking.\n\n\t\t\t\t\tRAFE\n\t\t\t\t(between heaves)\n\t\t\tFuck you.\n\n\t\t\t\t\tDANNY\n\t\t\tShe loves you.  I know that.  And part of\n\t\t\twhat she loves in me is how much of you\n\t\t\tshe sees in me.\n\n\tRafe doesn't seem to be listening; but Danny knows he is.\n\n\t\t\t\t\tDANNY\n\t\t\tWe were both torn up.  I started dropping\n\t\t\tby to see her, because we understood what\n\t\t\teach other felt.  We'd have coffee and\n\t\t\ttry not to talk about you, but we always\n\t\t\twould.\n\n\tRafe stands to face Danny; this is hard for Danny to say.\n\n\t\t\t\t\tDANNY\n\t\t\tShe said I was so much like you.  I said,\n\t\t\tNo, I'm not.  I'm like I am because of\n\t\t\tyou, but I'm not you, not as good as you.\n\t\t\tEverybody else saw me as a loser with a\n\t\t\tbig chip on his shoulder.  But you saw\n\t\t\tthe better part of me, the part of me\n\t\t\tthat could be like you, and changed me.\n\t\t\tYou made me who I am.\n\n\t\t\t\t\tRAFE\n\t\t\tHow sweet.  Is that when you put the move\n\t\t\ton her?\n\n\tDanny slams his fist into Rafe's sick gut.  Rafe doubles over\n\tagain, coughing, nothing left in his belly to come up.\n\n\tRafe stand slowly, nodding as if he knows the punch was what\n\the deserved.  Danny's about to apologize when once more Rafe\n\tknees him in the balls.\n\n\tDanny folds up, drops to his knees, and starts to retch.\n\n\t\t\t\t\tRAFE\n\t\t\tThat's better.\n\n\tRafe crawls into the back seat of the car and passes out,\n\tDanny still collapsed at the side of the road.\n\n\tEXT.  PACIFIC - NIGHT\n\n\tThe Japanese task force storms on.\n\n\tINT.  JAPANESE AIRCRAFT CARRIERS - NIGHT\n\n\tIN THE PREP DECKS, the planes are being armed with bombs and\n\ttorpedoes.\n\n\tIN THE PILOTS' QUARTERS, the pilots individually sit before\n\tpersonal shrines, saying private prayers, writing letters.\n\n\tEXT.  JAPANESE CARRIERS - FLIGHT DECKS - NIGHT\n\n\tThe planes are brought up on the elevators; deck crewmen\n\tstart rolling them into position.\n\n\tEXT.  UNDER THE SURFACE OF THE PACIFIC - NIGHT\n\n\tA Japanese submarine with a midget sub attached to its hull\n\truns silently toward Pearl Harbor.\n\n\tEXT.  OCEAN SURFACE - NIGHT\n\n\tThe periscope of the submarine breaks the surface.\n\n\tINT.  JAPANESE SUB - NIGHT\n\n\tThe sub commander looks through the periscope and sees the\n\tlights of Oahu far in the distance.\n\n\t\t\t\t\tSUB COMMANDER\n\t\t\tPrepare to launch midget sub.\n\n\tINT.  BUNK AREA OF SUB, BETWEEN TORPEDOES - NIGHT\n\n\tThe sailor who will drive the midget sub completes his\n\tceremonial sponge bath, and places a handwritten letter on\n\this personal shrine.\n\n\t\t\t\t\tSAILOR'S VOICE (LETTER)\n\t\t\tMy revered father, I go now to fulfill my\n\t\t\tmission and my destiny.\n\n\tINT.  THE LAUNCH OF THE MIDGET SUB - NIGHT\n\n\tWe see the sub surface, and the sailor exit the main hatch of\n\tthe big sub, then force himself through the tiny hatch of the\n\tmidget sub.\n\n\t\t\t\t\tSAILOR'S VOICE (LETTER)\n\t\t\tI hope it is a destiny that will bring\n\t\t\thonor to our family, and if it requires\n\t\t\tmy life I will sacrifice it gladly, if\n\t\t\tyou can think of me and my hope to be a\n\t\t\tgood servant of our nation, and a worthy\n\t\t\tson.  With love and devotion, Kazuyoshi.\n\n\tEXT.  FLIGHT DECK, JAPANESE CARRIER - NIGHT\n\n\tA single scout plane launches into the air.\n\n\tINT.  SCOUT PLANE - NIGHT\n\n\tThe plane climbs to a high altitude, toward the dawn and\n\tPearl Harbor.\n\n\tEXT.  PACIFIC OCEAN - NIGHT\n\n\tThe Japanese carriers turn into the wind and raise combat\n\tpennants.  A color guard raises the Japanese flag as the deck\n\tcrew stand at attention, seeing the rising-sun flag snap\n\tpotently in the wind.\n\n\tEXT.  JAPANESE AIRCRAFT CARRIERS - NIGHT\n\n\tThe first wave of Japanese planes begins to launch.  It is a\n\tstirring sight for the Japanese; the pilots waiting in their\n\tcockpits, the officers watching from the bridge, the seamen\n\ton the flight deck.\n\n\tThe first plane taxis along the flight deck and lifts into\n\tthe sky.  The seamen cheer and wave their caps.\n\n\tEXT.  PACIFIC OCEAN - NEAR PEARL HARBOR - NIGHT\n\n\tThe American destroyer WARD cuts through the water, moving\n\tback into port after a night patrol.  It's CAPTAIN is on the\n\tbridge, and its lookouts are still scanning the waters.\n\n\t\t\t\t\tLOOKOUT\n\t\t\tCaptain, do you see that, in our wake?\n\n\tThe Captain raises his binoculars and looks out behind the\n\tship.  He sees something small and black there.\n\n\t\t\t\t\tCAPTAIN OF THE WARD\n\t\t\tThat's a conning tower.\n\n\t\t\t\t\tOFFICER\n\t\t\tCould it be one of ours?\n\n\t\t\t\t\tCAPTAIN OF THE WARD\n\t\t\tHe's trying to follow us through the sub\n\t\t\tnets, into the harbor.  Sink the son of a\n\t\t\tbitch.\n\n\tEXT.  DECK OF THE DESTROYER WARD - NIGHT\n\n\tThe deck gun barks, aimed toward the conning tower of the\n\tJapanese sub in the distance.  The first shot sails directly\n\tover the tower, missing.\n\n\tINT.  THE SUB'S CONTROL ROOM - NIGHT\n\n\tThe Japanese sub commander sees, through his periscope, the\n\tflame erupt on the Ward's deck; he's being fired upon.  He\n\tsnaps orders --\n\n\t\t\t\t\tJAPANESE SUB CAPTAIN\n\t\t\tDive!  Dive!\n\n\tEXT.  THE DECK OF THE WARD - NIGHT\n\n\tThe gunners snap in another shell and fire again.  It's a\n\tdirect hit, the sub is ripped apart, it rolls over.\n\n\tINT.  WARD'S BRIDGE - NIGHT\n\n\tThe Captain watches the sub sinking and snaps an order.\n\n\t\t\t\t\tCAPTAIN OF THE WARD\n\t\t\tFleet command, from destroyer Ward.  Have\n\t\t\tfired upon and sunk enemy submarine\n\t\t\tseeking to enter Pearl Harbor.\n\n\tEXT.  ESTABLISHING - RADAR STATION - PEARL HARBOR - DAWN\n\n\tINT.  RADAR STATION - PEARL HARBOR - DAWN\n\n\tThere are two guys left in the room, yawning over their new\n\tradar equipment.  The Officer, ELLIS, checks his watch; it's\n\ta few minutes after seven a.m.\n\n\t\t\t\t\tELLIS\n\t\t\tTime to shut her down.  That was a good\n\t\t\tfirst session.  You'll get the hang of\n\t\t\tthis new radar soon.\n\n\t\t\t\t\tPRIVATE\n\t\t\tThank you, Sir.  Hey...what's this?\n\n\tHis screen shows a huge cloud of blips, heading toward them.\n\n\t\t\t\t\tELLIS\n\t\t\tI've never seen anything like that\n\t\t\tbefore.\n\n\tHe gets on the telephone.\n\n\tINT.  ARMY HEADQUARTERS - DAWN\n\n\tThe phone rings and an officer answers.\n\n\t\t\t\t\tOFFICER\n\t\t\tWatch command... Coming from which\n\t\t\tdirection?... Hold on.\n\n\tHe covers the phone and tells his commander --\n\n\t\t\t\t\tOFFICER\n\t\t\tRadar station has picked up a cloud of\n\t\t\tblips, coming in from the northeast.\n\n\tHe switches on the radio, and tunes it to KGMB; hearing the\n\tHawaiian music reassures him something...\n\n\t\t\t\t\tCOMMANDER\n\t\t\tKGMB is on early.  That means we've got a\n\t\t\tflight of B-17's coming in from the\n\t\t\tmainland, they use the radio music for a\n\t\t\thoming beacon.\n\n\tINT.  RADAR STATION - PEARL HARBOR - DAWN\n\n\tDismayed, Ellis listens to the response from the\n\theadquarters.\n\n\t\t\t\t\tELLIS\n\t\t\tAll right, Sir.\n\t\t\t\t(he hangs up)\n\t\t\tThey say don't worry about it.\n\n\tHe and the private look again at the cloud of blips --\n\tgrowing ever larger, and moving in fast.\n\n\tEXT.  THE SKIES ABOVE THE PACIFIC - DAY\n\n\tThe Japanese formations are streaking through the sky.\n\n\tINT.  THE COCKPITS - DAY\n\n\tThe Japanese bombers, with three-man crews, are listening to\n\tthe Hawaiian music of the radio station, using it for their\n\thoming beacon.  They look out and see the sunrise -- it's\n\tbeautiful, and resembles the Japanese flag.\n\n\tEXT.  SKIES ABOVE PEARL HARBOR - DAWN\n\n\tThe Japanese scout plane is high in the air.  It radios --\n\n\t\t\t\t\tSCOUT PLANE PILOT\n\t\t\tHarbor quiet.  Ships in place.  Carriers\n\t\t\tgone.\n\n\tINT.  BRIDGE OF YAMAMOTO'S CARRIER - DAY\n\n\tYamamoto is handed this message.\n\n\t\t\t\t\tYAMAMOTO\n\t\t\tWe have achieved surprise, but their\n\t\t\tcarriers are not in port.  I don't like\n\t\t\tthis.\n\n\t\t\t\t\tGENDA\n\t\t\tWe have a fighter screen up, in case we\n\t\t\tare attacked, Admiral.\n\n\t\t\t\t\tYAMAMOTO\n\t\t\tWe must go ahead.  This is our moment.\n\n\tINT.  ADMIRAL KIMMEL'S HOME - DAY\n\n\tThe Admiral, dressed in his golf clothes, is leaving his home\n\twhen a naval LIEUTENANT appears at his door.\n\n\t\t\t\t\tLIEUTENANT\n\t\t\tAdmiral, one of our destroyers reports\n\t\t\tsinking a sub on its way into Pearl.\n\n\t\t\t\t\tADMIRAL KIMMEL\n\t\t\tRelay that to Washington...and cancel my\n\t\t\tgolf game.\n\n\tINT.  ADMIRAL KIMMEL'S OFFICE - OAHU - DAY\n\n\tKimmel enters his office, and is handed the latest\n\tdispatches.\n\n\t\t\t\t\tADMIRAL KIMMEL\n\t\t\tAny response from Washington?\n\n\t\t\t\t\tKIMMEL'S AIDE\n\t\t\tNothing, Sir.\n\n\tEXT.  WESTERN UNION OFFICE - PEARL HARBOR - DAY\n\n\tA telegram, addressed to Admiral Kimmel, lands in the\n\tregular, not urgent, dispatch box.  The messenger handles it\n\tpromptly, hopping on his motorbike to deliver it.\n\n\tEXT.  SKIES ABOVE THE PACIFIC - DAY\n\n\tThe Japanese planes increase throttle and nose down, diving\n\ttoward the surface, hurtling into attack mode.\n\n\tEXT.  PEARL HARBOR - DAY\n\n\tThe harbor lies quiet.  It's a sleepy Sunday morning.\n\tChildren are playing, officers are stepping from their houses\n\tin their shorts to get the morning paper...\n\n\tEXT.  MOUNTAINSIDE - OAHU - DAY\n\n\tHawaiian Boy Scouts are hiking on a side of one of the\n\tmountains overlooking Pearl.\n\n\tSuddenly booming over the mountain, barely ten feet above the\n\tsummit, comes a stream of planes.\n\n\tThe boys are awed.  What is this?\n\n\tEXT.  PEARL HARBOR - DAY\n\n\tQUICK INTERCUTS - Between the approach of the Japanese\n\tplanes, and sleepy Pearl Harbor...\n\n\t-- The planes, in formation, their propellers spinning, their\n\t   engines throbbing...\n\n\t-- Pearl Harbor, with the ships silent, their engines cold,\n\t   their anchors steady on the harbor bottom.\n\n\t-- The Japanese submarines heading in.\n\n\t-- The American destroyers docking, instead of going out to\n\t   search for them.\n\n\t-- Another formation of Japanese bombers climbing high, into\n\t   attack position.\n\n\t-- The Japanese torpedo planes dropping down to the level of\n\t   the ocean, their engines beginning to scream.\n\n\t-- The American planes bunched on the airfields.\n\n\t-- ON THE JAPANESE CARRIERS, Yamamoto and his staff huddle\n\t   tensely, over their battle maps.\n\n\tON THE JAPANESE CARRIER DECKS, the second wave of planes is\n\tbeing brought up and loaded with munitions...the Japanese\n\tflag snaps tautly in the wind...\n\n\tON THE GOLD COURSE NEAR PEARL HARBOR, American officers are\n\tlaughing on the putting green near the club house, where the\n\tAmerican flag droops from the flag pole, limply at peace.\n\n\t-- The Japanese planes roaring down just over the wave tops\n\t   of Pearl Harbor itself.\n\n\t-- Children playing in the early morning sun, looking up as\n\t   they see the planes flash by.  The children look --\n\t   they've never seen this many, flying this low...but they\n\t   are not alarmed, only curious.\n\n\tThe images come faster and faster, the collision of Japan's\n\tdetermination and American's innocence...\n\n\tEXT.  DECK OF OKLAHOMA - DAY\n\n\tTwo sailors are standing on the deck, sharing a smoke,\n\tlooking out over the quiet harbor.  One of them sees the\n\tfirst few planes streaking in.\n\n\t\t\t\t\tSAILOR 1\n\t\t\tLook at that.\n\n\t\t\t\t\tSAILOR 2\n\t\t\tIt's the Army again, practicing on us.\n\n\tSomething drops from the lead plane and splashes easily into\n\tthe water; the plane banks away.\n\n\t\t\t\t\tSAILOR 2\n\t\t\tPractice torpedoes.\n\n\tA white streak runs through the water at them.\n\n\t\t\t\t\tSAILOR 2\n\t\t\tNow listen, you'll hear a little thud\n\t\t\twhen it hits the side of the ship.\n\n\tThey watch it rush at them...then, a MASSIVE EXPLOSION!  It\n\tthrows up a fifty foot wall of water, hurling the sailors and\n\teverything else on the deck into the sea.\n\n\tEXT.  THE ATTACK ON PEARL HARBOR - DAY\n\n\t-- The first wave of planes drop more torpedoes; they plunge\n\t   BENEATH THE SURFACE, their wooden fins working perfectly,\n\t   the torpedoes speeding to their targets...\n\n\tWe see their AWESOME BLASTS against the anchored ships as the\n\ttorpedoes hit home.\n\n\t-- The Japanese LOW ALTITUDE BOMBERS come in; some drop their\n\t   bombs directly into the ships; some skip their bombs\n\t   across the water, the bombs glancing off the surface and\n\t   then slamming the sides of battleships with tremendous\n\t   explosions.\n\n\t-- INSIDE THE SHIPS, sleeping sailors are thrown from their\n\t   bunks; those already awakened run for their battle\n\t   stations, and try to make it up to the deck; but there's\n\t   no escape there, as...\n\n\t-- Zero fighter planes strafe the ships, raking the decks and\n\t   killing sailors with MACHINE GUN FIRE.\n\n\tEXT.  ON THE AMERICAN SHIPS - DAY\n\n\tFire and smoke are turning everything into chaos.  some\n\tsailors rush to man the guns, they find the ammo boxes\n\tlocked.\n\n\tUnder the bombing and strafing, they find a wrench and start\n\tpounding on the lock, trying to break open the ammo box.\n\tThen they break open the lock -- and find the ammo box empty.\n\n\t\t\t\t\tSAILOR\n\t\t\tShit!  I'll get some ammo!\n\n\tHe runs for the ladders, and is shot down before he gets\n\tthere.\n\n\tEXT.  SKIES OVER PEARL HARBOR - DAY\n\n\tThe dive bombers scream in.\n\n\tEXT.  DECK OF THE WEST VIRGINIA - DAY\n\n\tBombs are hitting the deck.  Sailors are blown into the air\n\tand out into the oily water.  Nearby ships are catching fire;\n\tthe flames spread out onto the oily water itself.\n\n\tINT.  BELOW DECKS OF THE WEST VIRGINIA - DAY\n\n\tDorie Miller, the boxing champion/kitchen helper, is working\n\tpicking up the breakfast trays when he feels the ship\n\tshudder.  The intercom comes alive --\n\n\t\t\t\t\tINTERCOM\n\t\t\tBattle stations!  Battle stations!  This\n\t\t\tis not a drill!\n\n\tMen run to the ladders, and the shaking of the ship from a\n\tbomb blast tosses them off; Dorie's at the foot of the ladder\n\twhen men fall back on top of him.\n\n\tEXT.  BRIDGE OF WEST VIRGINIA - DAY\n\n\tThe Captain of the ship has reached the command bridge, where\n\tmost of his staff is lying wounded from a bomb blast.\n\n\t\t\t\t\tCAPTAIN OF THE WEST VIRGINIA\n\t\t\tStay calm!  Find your positions.  Medics,\n\t\t\tget the wounded to sick bay!  Load and --\n\n\tMORE TORPEDOES and BOMBS blast into the ship.  A big chunk of\n\tshrapnel tears into the Captain and rips his stomach open.\n\tThe medics he was just directing to other men now run to him,\n\tas the men they were going to help have been blown apart.\n\n\tEXT.  DECK OF THE WEST VIRGINIA - DAY\n\n\tSailors run up from below and are gunned down and blasted\n\tdown before they can reach their weapons.\n\n\tDorie Miller emerges from below decks and sees the carnage,\n\tthe confusion.  A bloody OFFICER grabs him.\n\n\t\t\t\t\tBLOODY OFFICER\n\t\t\tBoy!  We need stretcher bearers on the\n\t\t\tbridge!\n\n\tDorie runs into the fire and smoke, toward the bridge.\n\n\tEXT.  BRIDGE OF THE WEST VIRGINIA - DAY\n\n\tDorie arrives to see the medics crouched over the\n\tdisemboweled Captain, who is still giving orders.\n\n\t\t\t\t\tCAPTAIN OF THE WEST VIRGINIA\n\t\t\tRadio for air cover.  Organize the other\n\t\t\tmedics.  Initiate fire control.\n\n\tDorie helps the medic lift the Captain to take him below.\n\n\tINT.  BELOW DECKS OF THE WEST VIRGINIA - DAY\n\n\tDorie carries the Captain down the ladder by himself, using\n\tone arm to climb and one to hold the Captain like a child's\n\tteddy bear.  When they reach the bottom the pain has grown\n\ttoo much for the Captain; he know's he's dying.\n\n\t\t\t\t\tCAPTAIN OF THE WEST VIRGINIA\n\t\t\tPut me down here.\n\n\tDorie puts him down; the medic jumps down the ladder and\n\treaches the Captain, who tells him --\n\n\t\t\t\t\tCAPTAIN OF THE WEST VIRGINIA\n\t\t\tFind my executive officer and tell him\n\t\t\the's in command.  Tell him to fire the\n\t\t\tboilers and...\n\n\tHe trembles in death throes...\n\n\t\t\t\t\tCAPTAIN OF THE WEST VIRGINIA\n\t\t\tMake sure the gunners have enough\n\t\t\tammuni --\n\n\tHe's dead.  The Medic runs toward the ladder, reaches the\n\thatch, and is blasted back to the bottom by an explosion\n\toverhead.\n\n\tDorie runs for the ladder, and climbs out into hell.\n\n\tEXT.  DECK OF THE WEST VIRGINIA - DAY\n\n\tDorie emerges into even greater carnage and confusion.  A\n\tsailor, his body on fire, runs past and leaps into the oily\n\twater -- but it is in flames too.\n\n\tThen Dorie sees it:  an unmanned anti-aircraft gun.  He runs\n\tto it, through the strafing.\n\n\tThe gun already has a belt of ammo in it -- apparently loaded\n\tby the gunner who lies beside it with his chest shot open.\n\tDorie swings the business end of the gun toward the Zeros\n\tcoming in out of the smoke, and he begins to fire.\n\n\tThe Zeros keep coming and he keeps firing; nothing on earth\n\twill knock him from that gun.\n\n\tINT.  NURSES' BARRACKS - DAY\n\n\tEvelyn is up, dressed; her roommates are just stirring.\n\n\tEXT.  NURSES' QUARTERS - OAHU - DAY\n\n\tEvelyn has stepped to the door when she hears a distant\n\trumble and looks across the harbor to see smoke rising, ships\n\ttaking hits.\n\n\t\t\t\t\tEVELYN\n\t\t\tOh my God... EVERYBODY TO THE HOSPITAL!\n\n\tAs she runs, Japanese planes are coming toward the base.\n\n\tEXT.  THE MESS HALL AT HICKAM FIELD - DAY\n\n\tThe men were sitting down to breakfast, but the machine gun\n\tbullets tearing up the outer walls have them clogging the\n\tdoors, and it's so clogged they can't all get out.\n\n\tA steel bomb crashes through the roof and slams through the\n\troom, taking out tables and chairs before bouncing off the\n\twall and coming to a stop.\n\n\tTWO SOLDIERS, trapped within the mess hall, see it stop\n\twithout detonating.  They are bug-eyed, hearts stopped.\n\n\t\t\t\t\tMESS HALL SOLDIER\n\t\t\tDud.\n\n\tThe bomb detonated, blowing everything to bloody dust.\n\n\tINT.  HOSPITAL - DAY\n\n\tEvelyn reaches the hospital first and runs to the cabinet,\n\twithdrawing supplies.\n\n\tBarbara and Sandra appear at the far door, both terrified.\n\n\t\t\t\t\tEVELYN\n\t\t\tGet everything out!  Bandages, sutures --\n\t\t\toh God, the men in traction... Come with\n\t\t\tme!\n\n\tShe races into the hallway, the other two following.\n\n\tINT.  HOSPITAL - TRACTION WARD - DAY\n\n\tFour men from a jeep accident are lying in traction, their\n\tcasted limbs roped in the air.  Evelyn runs in, grabbing a\n\trazor blade from the medical cabinet -- and telling Barbara\n\tand Sandra.\n\n\t\t\t\t\tEVELYN\n\t\t\tCut them down, and take cover!!  Hurry!\n\n\tBombs are falling outside, on the airfield this wing of the\n\thospital faces.  Evelyn slices the traction ropes of a man\n\twith both legs broken; ignoring his groans, she rolls him out\n\tof the bed and covers him with the mattress.  The other\n\tnurses follow her lead.  The bombs are coming toward the\n\thospital ward; Evelyn finishes with the fourth man and covers\n\thim and herself with the mattress, just as a bomb craters\n\toutside the window.\n\n\tThe nurses and patients look up after the explosions have\n\tpassed; there's a chunk of smoking shrapnel lying on the\n\tsprings of the bunk where the last man had been lying.\n\n\tEXT.  HICKAM FIELD - DAY\n\n\tThe Japanese low-altitude bombers, with Zero escorts, zoom in\n\tover the field, blasting the clusters of American warplanes,\n\twhole squadrons taken out with one bomb.\n\n\tThe mechanics and pilots, caught in the open, run from the\n\tstrafing.  The Zeros rake them down with machine gun fire.\n\tIt's carnage.\n\n\tEXT.  PHOTOGRAPHER'S HOUSE - DAY\n\n\tSammy, the amateur photographer, is leaving his house for a\n\tmorning of working his \"Pictures of Paradise\" business, when\n\the sees the Japanese formations rumbling toward Pearl.  He\n\traces back inside.\n\n\tINT.  PHOTOGRAPHER'S HOUSE - DAY\n\n\tHe fishes into his drawer for a film camera, and digs out\n\tcans of film, struggling to load it as he runs back out.\n\n\tINT.  HICKAM FIELD - BARRACKS - DAY\n\n\tThe pilots of Danny's squadron have returned from their night\n\tof drinking and brawling and are crashed on their bunks.  Red\n\tstirs and staggers toward the head; he bumps into the wall,\n\tbacks up like a wind-up toy and lurches blindly forward\n\tagain, into --\n\n\tINT.  BARRACKS - THE HEAD - DAY\n\n\tRed sleepwalks to the urinals and unleashes a marathon piss\n\tstream, still in his sleep.  A rumble penetrates his brain,\n\tand his eyes come open a fraction.  Through the window slits\n\tabove the urinals, he can see a cloud of Japanese planes\n\trushing past.\n\n\tHe squeezes his eyes shut, and looks again; the planes start\n\tbombing the distant hangers.\n\n\tRed pisses along the wall as he races to the barracks, trying\n\tto get his pecker back into his drawers.  He shouts to the\n\tsleeping guys --\n\n\t\t\t\t\tRED\n\t\t\tTh-th-th-th-th-\n\n\tHe slaps his face with both hands, and stomps his feet...\n\n\t\t\t\t\tRED\n\t\t\tTh-th-th-th-Dammit!  Th-th-th-\n\n\tHe still can't get it out, can't wake them; bursting with\n\tfrustration, he suddenly blasts out singing --\n\n\t\t\t\t\tRED\n\t\t\t\t(singing)\n\t\t\tThe Jaaaps!!  The Jaaaps!!\n\n\tHe's belting it like a baritone in a bizarre opera.  His\n\tfriends stir; what the hell?  Red points outside and tries to\n\ttalk, but now he can't mutter a syllable.  The guys hear the\n\texplosions, and realize...\n\n\tEXT.  HICKAM FIELD - BARRACKS - DAY\n\n\tThe pilots stagger out, half drunk, half dressed.  Seeing\n\twhat's happening, they race toward the flight line, where the\n\tclustered American planes are blowing up in groups, and the\n\tpilots are knocked to the ground.\n\n\t\t\t\t\tBILLY\n\t\t\tGoddamn Japs!\n\n\tBilly jumps to his feet and starts to run toward a cluster of\n\tfighters that hasn't gone up yet.\n\n\t\t\t\t\tANTHONY\n\t\t\tBilly!\n\n\tAnthony tries to grab him and drag him back to earth but he\n\tmisses; Billy gets a few steps before the fire from a\n\tstrafing Zero catches up to him; his friends watch in horror\n\tas Billy gets shorter as he runs; the Zero's machine gun fire\n\tis sawing his legs off from the feet up.\n\n\tBilly falls, legless but still alive; then a bomb falls\n\talmost on top of him, sending body parts over the pilots.\n\n\tTheir innocence, like America's, is gone in that moment.\n\n\tEXT.  ROAD TO MAIN AIRFIELD - DAY\n\n\tDanny and Rafe are in Danny's Buick, hung over and asleep,\n\tDanny in front, Rafe in back, and they're a miserable sight\n\t-- their shirts ripped, blood dried in a leak trail from one\n\tside of Rafe's nose and the corner of Danny's mouth.\n\n\tThe rumble of planes moving overhead makes them stir; the\n\trumble grows huge, as the shadows of a massive formation\n\tmakes the sunlight flicker.  Danny and Rafe squint up, their\n\theads pounding, and realize what they're seeing.  Suddenly\n\ttheir headaches are gone, and Danny's gunning the Buick down\n\tthe road, toward the base.\n\n\tEXT.  AIR BASE - DAY\n\n\tDanny blasts through the main gate; the guards are too busy\n\ttaking cover and haven't even closed the barrier.\n\n\tHe races to the tarmac, where some of the planes are still\n\tundamaged.  Rafe is out the door before the car stops\n\trolling, and Danny's right behind him.\n\n\tThey're running toward a cluster of fighters, when it goes up\n\twith a bomb blast.  Rafe and Danny dive at each other; their\n\tfirst instinct is to cover their best friend with their own\n\tbodies.\n\n\tThey look at each other on the ground.  They see machine gun\n\tbullets thudding into the planes on the flight line, and\n\tripping along the walls of the buildings.  It's as if the\n\twhole Japanese airforce is attacking this one base, and not\n\tleaving a single plane airworthy.\n\n\t\t\t\t\tRAFE\n\t\t\tGet me into a plane!\n\n\t\t\t\t\tDANNY\n\t\t\tCome on!\n\n\tDanny sprints; Rafe follows.  Danny reaches a phone booth,\n\tand digs a dime from his pants.\n\n\t\t\t\t\tRAFE\n\t\t\tYou're making a phone call?!\n\n\tDanny dials, as waves of bullets sweep the area, and more\n\tplanes blow up on the flight line.  Rafe thinks he's lost his\n\tmind.\n\n\t\t\t\t\tDANNY\n\t\t\t\t(into phone)\n\t\t\tThis is Walker!  We're under attack!  Get\n\t\t\tthose planes fueled and armed RIGHT NOW!\n\n\tHe runs back toward the car; Rafe, in the nonsense of battle,\n\treaches in to hang up the receiver, before Danny grabs him\n\tand leads him on a sprint to the car, as the phone booth\n\tshatters behind them from the strafing.\n\n\tOn the way to the car they dive back to the ground to avoid\n\tstrafing -- and see their friends lying nearby, in shock.\n\n\t\t\t\t\tANTHONY\n\t\t\tThey got Billy.\n\n\t\t\t\t\tDANNY\n\t\t\tCome with us!\n\n\tHe and Rafe jump up and run again.  Anthony, Red, and several\n\tother pilots reach the Buick and dive in.  Danny drives away,\n\tthrough the strafing.\n\n\t\t\t\t\tRAFE\n\t\t\tWhere are we going?\n\n\t\t\t\t\tDANNY\n\t\t\tAuxiliary field at Haleiwa, ten miles\n\t\t\tnorth of here.\n\n\t\t\t\t\tRAFE\n\t\t\tWhat's there?\n\n\t\t\t\t\tDANNY\n\t\t\tSix P-40's.\n\n\tAs the Zero pilots see the Buick moving, they go after it.\n\tDanny drives like a madman through the strafing, zigzagging\n\tand gunning the Buick's V-8.\n\n\tEXT.  THE OKLAHOMA - STILL AT ANCHOR - DAY\n\n\tThe number of attacking planes seems endless -- and their\n\tstrategy flawless.  Torpedoes hitting one ship lifts its hull\n\twith a blast, enabling the next wave of torpedoes to rush\n\tunder and hit the next ship anchored behind.  The American\n\tbattleships are bobbing like see-saws.\n\n\tThe OKLAHOMA takes an entire barrage of torpedoes, blowing\n\tthirty foot holes along it's hull; the ship immediately\n\tbegins to list.\n\n\tINT.  THE OKLAHOMA - DAY\n\n\tDoors are wedged shut by the deformation of the structure;\n\tvertical ladders are becoming horizontal, and water is\n\tpouring in.  Men fight their way up against the water.\n\n\tINT.  INNER COMPARTMENT OF THE OKLAHOMA - DAY\n\n\tWater is up to the trapped sailor's waists when they grab a\n\twrench and start taking turns pounding S.O.S. in Morse code\n\ton the bulkhead.\n\n\tEXT.  DECK OF OKLAHOMA - DAY\n\n\tAs the listing grows more severe, sailors start jumping from\n\tthe deck into the water.  Still the Marines on deck are\n\tfiring back at the planes; some Marines are even using\n\thandguns.  But courage does not save them...\n\n\tTHE OKLAHOMA ROLLS OVER\n\n\tThe men still on its deck try to run, but it's not just the\n\tfires and the water they can't escape; the gun turrets' 1400\n\tpound shells break loose with the capsizing of the ship and\n\ttumble through everything like massive wrecking balls.\n\n\tThe sailors and marines, thrown into the water, struggle to\n\tget away from the suction as the giant battleship turns\n\tturtle.\n\n\tBELOW THE WATER men are sucked down with amazing force, every\n\thair on their heads streaming behind them as they're snatched\n\tto the depths.\n\n\tINSIDE THE OKLAHOMA, everyone and everything is spilling\n\tupside down.  The ship's generators sputter out and the\n\tlights go out.  The flashlights of the few sailors who can\n\tfind them cut raggedly through the darkness, and water spills\n\tin.  There is no escape.\n\n\tBELOW THE WATER, the Oklahoma's superstructure hits bottom;\n\tsome men are crushed there.  For others it's salvation, as\n\tthe BACKWASH blows them toward the surface.\n\n\tON THE SURFACE the men are launched almost completely out of\n\tthe water, before splashing back into the water and burning\n\toil.  A few feet of the steel hull and a portion of the\n\tpropeller protrude above the surface, but most of the\n\tOklahoma is under water.\n\n\tMen in the water swim toward a medical launch carrying\n\twounded away from the wreckage.  A bomb hits the launch and\n\tblows body parts everywhere.\n\n\tINT.  OKLAHOMA - REAR COMPARTMENT\n\n\tIn one compartment there are a dozen trapped men.  They've\n\tsurvived the roll-over, and are in a chaotic world where the\n\tfloor is now the ceiling.  The water is up their waists.\n\tSome of the SAILORS are panicking.\n\n\tOne sailor has a flashlight and switches it on, flashing the\n\tlight from face to face.\n\n\t\t\t\t\tSAILOR WITH THE FLASHLIGHT\n\t\t\tDon't panic!  Don't panic!\n\n\t\t\t\t\tPANICKED SAILOR\n\t\t\tThe water's rising!  It's coming up,\n\t\t\twe're all gonna drown!\n\n\t\t\t\t\tSAILOR WITH THE FLASHLIGHT\n\t\t\tThe air pressure will equalize it!\n\n\tBut the water keeps rising, along with their fears.  Several\n\tof the sailors are still screaming...\n\n\tThe water's already to their bellies.  One of them grabs a\n\twrench and starts slamming Morse code against the bulkhead.\n\n\tOne sailor in the middle of the room is particularly\n\tpanicked, not just yelling but crying and whimpering --\n\n\t\t\t\t\tTERRIFIED SAILOR\n\t\t\tGet me out!  Get me out!\n\n\t\t\t\t\tSAILOR WITH THE FLASHLIGHT\n\t\t\tStop it!  Come on!  Save your air!\n\n\t\t\t\t\tTERRIFIED SAILOR\n\t\t\tMY FOOT'S CAUGHT!\n\n\tHe's at the lower end of the compartment, where the water is\n\tdeeper -- the ship's nose is lower than her stern.  The\n\twater's up to the guy's neck.\n\n\tThe man with the flashlight dives down, and finds the guys\n\tfoot wedged together in the pipes of the ships ceiling -- now\n\ttheir floor.\n\n\tHe pops up again.  The water's up to the trapped guy's mouth;\n\the's already gagging.\n\n\t\t\t\t\tSAILOR WITH THE FLASHLIGHT\n\t\t\tIs there a hacksaw in that locker?!\n\n\tThey open it; tools spill out -- among them is a hacksaw.\n\tThey hand it to him; the sailor dives down and cuts off the\n\tguy's foot.\n\n\tThe trapped man is underwater, muffling his scream.  He comes\n\tfree, and surfaces gasping.  His severed foot floats to the\n\tsurface and then the horror really hits them.  The sailor\n\twith the flashlight pops up, in the blossoming of blood.  He\n\tand another sailor tie a tourniquet around the stump, to stop\n\tthe bleeding.\n\n\tThe drama of this has caused the other trapped men to stop\n\ttheir signaling.  Now they start banging, twice as loudly as\n\tbefore.\n\n\tEXT.  HALEIWA - AUXILIARY AIRFIELD - DAY\n\n\tHaleiwa is a tiny airfield, tucked among the green volcanic\n\thills; its barely paved, and it's only permanent building is\n\ta quonset hut.  A mechanic named EARL, is out with the\n\tP-40's; and these are spread out, not bunched.\n\n\tEARL AND THE P-40'S\n\n\tThe planes here have received loving care from Earl -- which\n\tmeans lots of cursing; as he's wrestling to load an ammo\n\tbelt, he yells.\n\n\t\t\t\t\tEARL\n\t\t\tSum-bitch!\n\n\tThe Buick, bullet holes punched through the truck, slides to\n\ta stop near the planes, and the pilots jump out.\n\n\t\t\t\t\tDANNY\n\t\t\tThey ready, Earl?\n\n\t\t\t\t\tEARL\n\t\t\tThey'll all fly, but -- oh, shit...\n\n\tWhat stops him is the cloud of Zeros and dive bombers,\n\tshrieking in.\n\n\t\t\t\t\tDANNY\n\t\t\tCover!\n\n\tThe guys scatter.  There are sandbags around the hut, and\n\tthey run there, diving into it's shelter just before the\n\tfirst strafing pass, when a Zero strafes one of the P-40's\n\tand a dive bomber blasts another.  Earl stands up in shock\n\tand fury.\n\n\t\t\t\t\tEARL\n\t\t\tYou absolute mother-fuckin' son of a\n\t\t\tbitch!  You shot one of my planes!\n\n\tDanny pulls him down, as the Zeros roar overhead.\n\n\t\t\t\t\tDANNY\n\t\t\tThis ain't a little feud, Earl, it's\n\t\t\tWorld War Two!\n\n\t\t\t\t\tRAFE\n\t\t\tThey're coming around for another pass.\n\t\t\tYou got extra weapons and ammo?\n\n\t\t\t\t\tEARL\n\t\t\tCock-suckin' right I do!!  In the gun\n\t\t\tlockers!\n\n\t\t\t\t\tDANNY\n\t\t\tYou guys get those!  Earl, Rafe, come\n\t\t\twith me!\n\n\tDanny, Rafe and Earl run to the planes that got hit and strip\n\tout the 20mm cannons and ammo.\n\n\tINT.  QUONSET HUT - DAY\n\n\tThe other pilots run in, throw open the gun locker, and start\n\tgrabbing weapons -- aircraft machine guns, ammo belts, one\n\teven grabs a rifle.\n\n\tSANDBAGS BY THE SHED\n\n\tThe two groups run back and start to set up.\n\n\t\t\t\t\tRAFE\n\t\t\tDanny, over there!  We're in a canyon,\n\t\t\tthey'll come straight down it, we'll get\n\t\t\t'em in a crossfire.\n\n\tDanny, Rafe and Earl run to a gully opposite the shed and set\n\tup there, as the other pilots brace the machine guns against\n\tthe sandbags.\n\n\tThe Japanese planes attacks again.  This time the lead plane\n\thits a wall of steel fired from the combined guns; the\n\tbullets chew into the bomb it carries and the plane EXPLODES.\n\tThe airborne debris makes the following planes shear off.\n\n\tRed's standing, firing; he yells at the Zeros --\n\n\t\t\t\t\tRED\n\t\t\tD-don't like it when we fight back, do\n\t\t\tya!\n\n\tRed runs out with his machine gun and keeps firing even when\n\tthe planes have passed, trying to shoot them right up the\n\tass.\n\n\t\t\t\t\tDANNY\n\t\t\tEarl!  You said the planes were ready\n\t\t\tbut -- but what?\n\n\t\t\t\t\tEARL\n\t\t\tOf the four left, only one is full of\n\t\t\tfuel.\n\n\t\t\t\t\tRAFE\n\t\t\tWill the others get into the air?\n\n\tEarl shoots a look to Rafe, then turns to Danny.\n\n\t\t\t\t\tEARL\n\t\t\tDanny, I don't like this fuckin' guy.\n\n\t\t\t\t\tDANNY\n\t\t\tAnthony, Red, stay with the guns!  Coma,\n\t\t\tyou cover the cannons!  Joe, Theo, come\n\t\t\twith us!  Earl, you get on the radio!\n\t\t\tWe're gonna fight these fuckers.\n\n\tTwo of the pilots, Joe and Theo, run to Danny.\n\n\t\t\t\t\tJOE\n\t\t\tHow do we do it?\n\n\t\t\t\t\tDANNY\n\t\t\tYour call, Rafe.\n\n\t\t\t\t\tRAFE\n\t\t\tGet rolling as fast as you can.  Stay\n\t\t\tlow!  We'll use the topography to\n\t\t\tseparate them and then we can take 'em\n\t\t\tone on one.\n\n\tThey race toward the planes, and the Japanese attack again.\n\tSeeing the pilots running for the P-40's, the Zeros aim for\n\tthem; Rafe and Danny race for the most distant of the planes;\n\tJoe and Theo run for the closer planes, through the dusty\n\tbullet hits.\n\n\tTheo makes his plane and is just strapping himself in when\n\tbullets stitch his fuselage, wounding him.  He still forces\n\tthe plane forward.  He taxis twenty feet and his cockpit gets\n\tchopped up and the plane arches into a right turn and putters\n\tto a stop, Theo dead at the controls.\n\n\tJoe doesn't bother to strap in; he hits the throttle hard and\n\theads down the runway...\n\n\tThe Zeros are on him as he gets ten feet of air at 120 M.P.H.\n\tThe Zero's bullets eat his canopy and plane skin; the plane\n\tbreaks apart in mid air, spilling in gouts of flame as it\n\tsmashes down on the tarmac.\n\n\tRafe and Danny have reaches the more distant P-40's and are\n\trevving their engines as they see Joe and Theo's fate.  They\n\tthrow on their radio headsets.\n\n\tTheir way seems blocked:  they've got no runway behind them,\n\tthe wreckage of four P-40's scattered ahead of them, and the\n\tZeros screaming over the low hills to attack them.  Now Rafe\n\tand Danny talk through the radio.\n\n\t\t\t\t\tDANNY\n\t\t\tIt's tight.\n\n\t\t\t\t\tRAFE\n\t\t\tTighter 'n a bulls ass in fly season.\n\t\t\tDon't hit the barn.\n\n\tThey gun their engines and roll through the grass on either\n\tside of the runway, dodging the burning planes; they lift\n\toff, clearing the quonset hut by a couple of inches.  They\n\tblow right through the strafing fire, and into the sky.\n\n\tEight Zeros are all over them.\n\n\tEarl is in the hut, on the radio and watching through\n\tbinoculars.\n\n\t\t\t\t\tEARL\n\t\t\tI see six...seven...eight of the\n\t\t\tcocksuckers!  Don't let 'em hurt my\n\t\t\tplanes.\n\n\tDanny's swiveling in his seat, looking left, right, back.\n\n\t\t\t\t\tDANNY\n\t\t\tThey're all over us!\n\n\t\t\t\t\tRAFE\n\t\t\tBet they don't dust crops in Japan.\n\n\tDanny understands immediately, following Rafe's tactic as he\n\tbreaks into a sharp turn and uses the hut, palm trees, and\n\tlow hills to shake the Japs.  They fly like crop dusters,\n\tskimming down a foot from the ground, then bobbing up,\n\tbanking left and right.  The Zeros have divided into two\n\tgroups to chase them, their wings clipping tree tops as they\n\ttry to follow the Americans.\n\n\tIt feels like a 200 M.P.H. car chase, 20 feet off the ground,\n\tRafe and Danny skimming and bobbing over the terrain, but\n\tthere are too many Japanese.\n\n\t\t\t\t\tRAFE\n\t\t\tDanny!  Let's play some chicken!\n\n\tDanny banks in one direction, Rafe in another...\n\n\tEXT.  OVER THE LANDING STRIP - DAY\n\n\tThe two P-40's are screaming, rushing at each other like they\n\tdid at the training base back in the states, flying right\n\tinto each other's propellers; the Japanese heading after them\n\trealize they're rushing headlong at the other group...\n\n\t\t\t\t\tEARL\n\t\t\tOh shit, oh shit...\n\n\tHe can't even watch.\n\n\tAt the last instant Rafe and Danny snap a quarter spin so the\n\tplanes flash by belly to belly.\n\n\tTwo of the Zeros collide in mid-air, exploding, as the other\n\tZeros scatter.\n\n\tEXT.  SKIES ABOVE PEARL HARBOR - DAY\n\n\tDanny and Rafe rejoin each other in the open sky; they've\n\tlost the Zeros.  The P-40's are flying smoothly, side by\n\tside.  The two pilots look across at each other, going into\n\tbattle together.  They speak through their radios.\n\n\t\t\t\t\tRAFE\n\t\t\tYou hear my okay?\n\n\t\t\t\t\tDANNY\n\t\t\tYeah.  So you can call me if you need\n\t\t\thelp.\n\n\t\t\t\t\tRAFE\n\t\t\tI got a half a tank.  You?\n\n\t\t\t\t\tDANNY\n\t\t\tLittle less.\n\n\tHe fires a short burst to see if his guns work; they do.\n\tRafe does the same.  Up ahead they see a formation of\n\tJapanese planes, headed toward Pearl.\n\n\t\t\t\t\tRAFE\n\t\t\tThey're in strafing formation, we'll blow\n\t\t\tright through their line.\n\n\tThey look across at each other.\n\n\t\t\t\t\tRAFE\n\t\t\tLand of the free.\n\n\t\t\t\t\tDANNY\n\t\t\tHome of the brave.\n\n\tSide by side the P-40's scream in.\n\n\tEXT.  ABOVE OAHU - THE DOGFIGHT - DAY\n\n\tThe Japanese planes are in tight, disciplined formation,\n\ttheir minds on the targets below them in the harbor.  But\n\ttheir day of shooting sitting ducks changes as the two P-40's\n\tblast in, wing guns blazing, chopping into Two Zeros.  Both\n\tZeros falter and begin to lose altitude.  The P-40's make\n\talmost impossible tight turns, still side-by-side, and go\n\tafter the two plane they crippled on the first pass.\n\n\tRafe finishes one Zero, making it explode in a ball of flame\n\tin the air.  Danny finishes the other, shooting off its wing\n\tso that it spirals into the sea and crashes there.\n\n\tThe P-40's swoop up again.\n\n\t\t\t\t\tRAFE\n\t\t\tThey're trying to hold formation.  We can\n\t\t\tchew 'em up!\n\n\tThe P-40's dig in again, swooping down on the line of Zeros.\n\tRafe hits first, machine gunning one plane, and Danny comes\n\tin behind it, finishing it off.\n\n\tThe Japanese pilots are screaming at each other over their\n\tradios, but their SQUADRON COMMANDER sees Pearl Harbor ahead,\n\tand tells them --\n\n\t\t\t\t\tJAPANESE SQUADRON COMMANDER\n\t\t\tHold the line!\n\n\tThe P-40's come through again, their guns spitting fire.\n\n\tEXT.  ANOTHER JAPANESE FORMATION OF BOMBERS - DAY\n\n\tThese planes are different -- high altitude bombers with\n\tthree-man crews, high above the harbor.  The bombardier looks\n\tthrough his sight and the bomb bays open.\n\n\tTHROUGH THE BOMBARDIER'S SIGHT, the ships look like tops, far\n\tbelow.  The bombardier is ticking off the targets as they\n\tpass, the first two he mentions already burning.\n\n\t\t\t\t\tJAPANESE BOMBARDIER\n\t\t\tWest Virginia... Oklahoma... Ah, Arizona.\n\n\tHe flips his bomb switch, and a HUGE STEEL BOMB falls away.\n\n\tEXT.  THE FLIGHT OF THE BOMB - DAY\n\n\tWe stay with the bomb as it falls through the sky.  The small\n\tpropeller on the bomb's nose spins in the air, running the\n\tarming mechanism into the bomb's explosive core.  The bomb\n\twobbles a bit at first, but then as it gathers speed its fins\n\tstabilize it, and it falls faster and faster, at a dizzying\n\trate, toward the Arizona.\n\n\tIt slams through the teak wood deck, and breaks it like\n\tmatchsticks.\n\n\tIt's tremendous weight and speed carry it through the next\n\tdeck, and the next, deep into the heart of the ship...toward\n\tthe powder room, where two million pounds of black powder are\n\twaiting.\n\n\tThe bomb hits there, and the explosion is almost beyond\n\tcomprehension.  Over 1400 men die instantly.\n\n\tEXT.  PEARL HARBOR - DAY\n\n\tThe battleship Arizona leaps into the air, the ship's spine\n\tis broken, it's guts ripped open in one explosive instant.\n\tMen on the deck are thrown into the burning oil already\n\tfloating on the water from the other ruptured ships, but\n\tthere are almost no survivors.\n\n\tThe concussion of the explosion blows men off the repair ship\n\tVestal, next to the Arizona, saving Vestal, as the explosion\n\tsnuffs out the fires on Vestal; it also sends tons of debris\n\tdown on her decks -- parts of the ship, legs, arms and heads\n\tof men, all sorts of bodies.\n\n\tDebris from the Arizona also cover the Tennessee and does\n\tmore damage than the two Japanese bombs that hit her.\n\n\tINT.  HOSPITAL - HALLWAY - DAY\n\n\tMedics have already started bringing in the wounded.  Evelyn\n\tis like a frantic traffic cop.\n\n\t\t\t\t\tEVELYN\n\t\t\tPut criticals in ward one, stables in\n\t\t\ttwo!  Barbara!  Fill every syringe you\n\t\t\tcan find with stimulant and antibiotic --\n\n\t\t\t\t\tMEDIC\n\t\t\tWhere are the doctors?\n\n\t\t\t\t\tEVELYN\n\t\t\tOn the third tee.\n\n\t\t\t\t\tSANDRA\n\t\t\tEvelyn!  Where's the morphine?\n\n\tTHE FRONT WARD\n\n\tEvelyn runs in, snaps open the cabinet, grabs a bag of\n\tmorphine sticks, and is about to run out again when she sees\n\tthe Arizona go up.\n\n\tFor a moment she's frozen, then she actually sees the shock\n\twave traveling across the bay and through the trees like an\n\tinvisible wall.  She's trying to cross her arms over her\n\tface, and dive to the floor, just as the windows blow out\n\tfrom the concussion, and glass flies over everything.\n\n\tINT.  JAPANESE BOMBER - DAY\n\n\tThey see the results of their bomb, and are ecstatic.\n\n\tEXT.  AIR ABOVE OAHU - DAY\n\n\tThe nose of Danny's plane is pointed right at the harbor and\n\the sees the sudden devastation of the Arizona.  It is a sight\n\tso awesome it freezes him for a moment.\n\n\tA Zero comes up behind him, firing.  Danny jerks his stick to\n\tmaneuver but he's caught...\n\n\tRafe comes in behind the Zero, chopping it up, even as he\n\tyells at Danny over the radio --\n\n\t\t\t\t\tRAFE\n\t\t\tAin't no time for spectatin'!\n\n\tThey turn back after the line of Zeros.  There are some\n\tJapanese planes coming after them now, but the P-40's head at\n\ttheir noses, firing, then duck past in a double maneuver, and\n\tturn right back into the Japanese formation.\n\n\tRafe has a plane in his sights, but his guns fire only a\n\tshort burst before stopping.\n\n\t\t\t\t\tRAFE\n\t\t\tI'm out of ammo!\n\n\t\t\t\t\tDANNY\n\t\t\tI'm out of fuel!\n\n\tThey head back.  A single Zero is on their way.  Rafe charges\n\tit and draws its fire; Danny comes in behind the Zero and\n\trakes its cockpit; the Japanese pilot backs off.\n\n\tThe P-40's dive back toward Haleiwa.\n\n\tA handful of Zeros returning from Pearl see them and follow.\n\n\tEXT.  PACIFIC - JAPANESE CARRIERS - DAY\n\n\tThe second wave of planes takes off from the carriers.\n\n\tINT.  FLIGHT CONTROL CENTER - CARRIER AKAGI - DAY\n\n\tGenda reports to Yamamoto.\n\n\t\t\t\t\tGENDA\n\t\t\tSecond attack wave is in the air.\n\n\tINT.  RADIO STATION KGBM - DAY\n\n\tThe DISC JOCKEY, handed a message by the army officer, stops\n\tplaying the soothing Hawaiian music and announces...\n\n\t\t\t\t\tDISC JOCKEY\n\t\t\tAll Army, Navy, and Marine personnel to\n\t\t\treport to duty.\n\n\tINT.  GENERAL SHORT'S OFFICE - DAY\n\n\tGeneral SHORT is in his office; he and his aides are working\n\tfrantically.\n\n\t\t\t\t\tGENERAL SHORT\n\t\t\tMobilize everything!  We're at war!  Send\n\t\t\ta message to Washington:  Hostilities\n\t\t\twith Japan commenced with an air raid on\n\t\t\tPearl Harbor.\n\n\tINT.  WHITE HOUSE - OVAL ROOM - DAY\n\n\tPresident Roosevelt is having lunch in the Oval Room study\n\twith Harry Hopkins.  The phone RINGS and Hopkins answers.\n\n\t\t\t\t\tHOPKINS\n\t\t\tOval Room... Yes, he is.\n\t\t\t\t(to Roosevelt)\n\t\t\tIt's Knox, Mr. President.\n\n\t\t\t\t\tROOSEVELT\n\t\t\t\t(taking phone)\n\t\t\tYes?\n\n\tHe listens, then puts the receiver down, shaken.\n\n\t\t\t\t\tROOSEVELT\n\t\t\tThe Japanese have attacked Pearl Harbor.\n\n\t\t\t\t\tHOPKINS\n\t\t\tMy God.  Do we have damage estimates?\n\n\t\t\t\t\tROOSEVELT\n\t\t\tOur Pacific Fleet, at anchor, unprepared?\n\t\t\tIt's terrible.  It has to be.  And it's\n\t\t\tnot over.\n\n\tEXT.  HALEIWA - AUXILIARY AIRFIELD - DAY\n\n\tThe two P-40's drop out of the sky and bounce to a landing;\n\tAnthony and Red have been pushing the wreckage off the field\n\twith the Buick.  Danny and Rafe pull the P-40's behind the\n\tburning quonset hut, and it's like a pit stop at a race\n\ttrack; Earl rushes up and starts fueling the planes, their\n\tengines still running.\n\n\t\t\t\t\tDANNY\n\t\t\tWe need ammo too!\n\n\tEarl shouts instructions to the pilots.\n\n\t\t\t\t\tEARL\n\t\t\tStrip it from the wrecks!\n\n\tThe other pilots race to the wrecked P-40's and start pulling\n\tout ammo belts.  Earl glares at the smoking engine of Danny's\n\tplane, and the bullet holes.\n\n\t\t\t\t\tEARL\n\t\t\tWho the fuck taught you to fly?\n\n\t\t\t\t\tDANNY\n\t\t\tHe did.\n\n\tEarl looks at Rafe's plane, more shot-up and abused than\n\tDanny's.  Rafe grins and waves to him.  Earl mumbles a stream\n\tof guttural and unintelligible obscenities.\n\n\tThe Zeros that followed them sweep down, strafing.  One\n\tmechanic, running across the field with a belt of ammo, goes\n\tdown.  Coma, running behind him, picks up the fallen man's\n\tammo and his own, bringing both to the planes behind the hut.\n\tHe, Red, and Anthony reload the machine guns in Rafe and\n\tDanny's planes.\n\n\tRafe and Danny gun their engines and head back into the air,\n\tthe grounded pilots firing a covering barrage and Earl even\n\tcoming up with a 12-gauge shotgun to fire at the Zeros as\n\tthey rush past.\n\n\tEXT.  SKIES OVER PACIFIC - DAY\n\n\tThe Second Wave of Japanese planes is in tight formation.\n\n\tINT.  LEAD PLANE OF SECOND WAVE - DAY\n\n\tLt. Commander SHIMAZAKI, leader of the second attack wave,\n\tsays calmly into his radio...\n\n\t\t\t\t\tSHIMAZAKI\n\t\t\tSecond wave, deploy over the military\n\t\t\tbases.  High level bombers to the air\n\t\t\tstations, dive bombers attack ships in\n\t\t\tharbor.  Fighters strafe and cover.\n\n\tHe leads the second wave in on their attack run...\n\n\tEXT.  NAVAL AIR STATION - DAY\n\n\tThe navy's planes, bunched up on the naval airfield, are\n\tdestroyed without ever getting into the air.\n\n\tEXT.  PEARL HARBOR - DAY\n\n\tThe harbor is already a mass of destruction and panic;\n\tscreaming everywhere, men trying to fight fires, move the\n\twounded; the second wave of planes hits, and tremendous\n\texplosions now rock the secondary ships like the destroyer\n\tSHAW, blasting it apart.\n\n\tBut the Japanese pilots are now having trouble with the thick\n\tblack smoke coming out of the damaged ships, and off the oil\n\tfires along the water.  One torpedo plane, its pilot flying\n\tblind, clips the superstructure of a battleship and spins to\n\ta crash.\n\n\tStill, even IN THE CHAOS ON THE SHIPS, the sailors struggle\n\tto survive, inventively.  Men trapped on one burning ship use\n\tthe severed barrel of a five-inch naval gun as a bridge to\n\tcross to the less damaged ship anchored beside them.\n\n\tOthers jump into the water and swim through the burning oil,\n\ttowing buddies too wounded to swim themselves.\n\n\tEXT.  PEARL HARBOR - DAY\n\n\tBelow decks, sailors have organized a line and are passing\n\tammunition from the ammo lockers, hand to hand up to the guns\n\ton deck.  Blasts from bombs hit them and ignite the ammo\n\tthey're holding, setting off a chain reaction of explosions.\n\n\tOn the deck, the sailors are out of ammo.  An OFFICER grabs a\n\tSEVENTEEN YEAR OLD SAILOR.\n\n\t\t\t\t\tOFFICER\n\t\t\tGrab a dinghy and get ammo from the base\n\t\t\tammo storeroom.\n\n\tThe young sailor jumps to a dinghy and launches it through\n\tthe oily waters and thick black smoke.\n\n\tEXT.  PEARL HARBOR - DAY\n\n\tThe sailors in the boat get strafed, the rounds cutting\n\tbetween them and blasting their boat in two.  They jump into\n\tthe oily water and swim toward shore.\n\n\tOther sailors are in the water with them, struggling,\n\tswallowing the vile black liquid as they battle to swim.\n\tErrant bombs and shrapnel hit beside them, killing some;\n\tother lose strength and slide beneath the surface.\n\n\tThe sailors from the ammo boat make it ashore; it's hot there\n\ttoo, with bullets and bombs all around.  One sailor has to\n\tstop and puke from the oil; his buddy grabs him and they run\n\tfor cover; they find it in the dugout of the baseball\n\tdiamond.\n\n\tEXT.  NAVAL STATION - DAY\n\n\tA MARINE GUNNERY SERGEANT leads men in a race through\n\tstrafing fire to the bases ammo storeroom.\n\n\tINT.  AMMO STOREROOM - DAY\n\n\tThe SUPPLY SERGEANT is at his post.\n\n\t\t\t\t\tGUNNERY SERGEANT\n\t\t\tWe need weapons and ammo!\n\n\t\t\t\t\tSUPPLY SERGEANT\n\t\t\tYou need authorization.\n\n\t\t\t\t\tGUNNERY SERGEANT\n\t\t\tThe fuck I do!\n\n\tHe pushes the man out of the way and starts grabbing weapons.\n\n\tEXT.  NAVAL STATION - DAY\n\n\tThe gunnery sergeant and his marines run with a water-cooled\n\tmachine gun, across the open ground, under fire.\n\n\tBARRACKS\n\n\tThe Marines set up in the windows of their already-strafed\n\tbarracks, and start firing there, as the Zeros scream past.\n\n\tEXT.  NAVAL STATION - DAY\n\n\tTrucks are moving dependents -- women and children -- from\n\tthe dependents' housing area.  The Japanese strafe the\n\ttrucks, dependents diving for cover.\n\n\tNAVAL STATION\n\n\tA fire engine from the Honolulu Fire Department races up to\n\tthe sight of buildings burning from the air attack.  As the\n\tfiremen jump out, a Zero strafes them, gunning down the\n\tfiremen.\n\n\tAs the strafing Zero starts to bank away, two P-40's come in\n\tbehind it, both of them gunning away.  The Zero comes apart\n\tunder the barrage, and crashes in a ball of flame.\n\n\tIt's Rafe and Danny, back in the air.\n\n\tINT.  MILITARY BASE HOSPITAL - DAY\n\n\tThe once-pristine hospital with its glowing white beds is now\n\ta bloody chaos.  Every bed is already full; there are burned\n\tand broken people on the floor -- soldiers, sailors,\n\tcivilians, firemen, all mixed in together.  People are dying\n\teverywhere, and screaming in pain, or moaning and begging for\n\thelp.  At first we don't see Evelyn, and wonder if she\n\tsurvived the glass; then we see her, flecks of her own blood\n\tdotting her face and arms.  The blood of soldiers on her\n\tsurgical apron.  A steel calm has replaced her earlier\n\tfrenzy, even as the other nurses are breaking down.\n\n\t\t\t\t\tSANDRA\n\t\t\tI can't tell who's gotten morphine and\n\t\t\twho hasn't!\n\n\t\t\t\t\tEVELYN\n\t\t\tTake a grease pencil and mark an M on the\n\t\t\tforehead of everyone you stick.\n\n\tA young doctor is trying to give an intravenous injection to\n\ta man who's badly charred; the doctors hands are shaking.\n\n\t\t\t\t\tEVELYN\n\t\t\tDon't look for a vein, just poke.\n\n\t\t\t\t\tSANDRA\n\t\t\tMy pen's dry!\n\n\t\t\t\t\tEVELYN\n\t\t\tUse lipstick.  Use ammo belts for\n\t\t\ttourniquets, use your own nylons if you\n\t\t\thave to!  Barbara!  Grab anything that\n\t\t\twill hold a pint of blood and sterilize\n\t\t\tit.\n\n\tThe doctors are amputating limbs right there in the hallway.\n\tA SENIOR DOCTOR calls --\n\n\t\t\t\t\tSENIOR DOCTOR\n\t\t\tEvelyn!  You have to do the triage!\n\t\t\tThey're bringing them in with trucks!\n\n\tEvelyn moves to the door.  Trucks are pulling up, loaded with\n\tthe wounded, young terrified soldiers bringing them inside;\n\tEvelyn does quick triage as they pass.\n\n\t\t\t\t\tEVELYN\n\t\t\tCritical -- front ward!... Give him\n\t\t\tmorphine, he can't wait...\n\n\tThe next body through is a pilot, wings on his uniform, his\n\tchest riddled with bullets -- and his face shot off.  For a\n\tmoment Evelyn falters, then she forces herself to check the\n\tdog tags...\n\n\tIt isn't Rafe or Danny.  Evelyn sags in guilty relief.\n\n\t\t\t\t\tEVELYN\n\t\t\tTake him outside and cover him; he's\n\t\t\tdead.\n\n\tShe steadies herself as the next body comes through, a woman\n\ton a stretcher, her stomach shot open, pale hands clutching\n\tat the open wound.  Evelyn feels for a pulse.\n\n\t\t\t\t\tEVELYN\n\t\t\tShe's gone too, take her --\n\n\tIt's Betty.\n\n\tAnd though the bombs are blasting and guns booming\n\teverywhere, the world goes silent for Evelyn.\n\n\tOne of the sailors outside the door is pointing to the\n\tharbor, the Nevada has begun to move.\n\n\tEXT.  PEARL HARBOR - DAY\n\n\tThe battleship NEVADA is underway, plowing through the\n\tharbor, as the water erupts with bombs.\n\n\tINT.  THE NEVADA'S BRIDGE - DAY\n\n\tThe Captain is struggling to save his ship.\n\n\t\t\t\t\tCAPTAIN OF THE NEVADA\n\t\t\tWe can save her if we make the open sea!\n\n\tEXT.  PEARL HARBOR - POV THE ATTACKING PLANES - DAY\n\n\tThe lead pilot in the next squad of Japanese planes spots the\n\tmoving battleship, and leads his squadron on it.\n\n\tThey come whipping in over the waves, dropping torpedoes and\n\tbombs.\n\n\tINT.  THE NEVADA'S BRIDGE - DAY\n\n\tThe Nevada's Captain feels the ship shudder as it takes hits\n\tamidships.\n\n\t\t\t\t\tCAPTAIN OF THE NEVADA\n\t\t\tWe're not gonna make it -- and if we go\n\t\t\tdown here we block the channel... Beach\n\t\t\ther, there!\n\n\tHis officers relay the order to the helm, and the ship's\n\trudder turns as more blasts rip her hull.\n\n\tEXT.  PEARL HARBOR - DAY\n\n\tThe Nevada swings off its course and runs aground.\n\n\tINT.  THE NEVADA'S DYNAMO ROOM - DAY\n\n\tThe impact jolts the boilers, already bursting with the steam\n\tpressure; gouts of steam from rupturing pipes scalds and\n\tblinds the engine room crew.\n\n\tEXT.  THE NEVADA - DAY\n\n\tThe Nevada, run aground at the shoreline, is now like a beast\n\tcut from the herd; the predators swarm after it with\n\ttorpedoes and bombs.\n\n\tOne torpedo, missing the Nevada, skims right up the beach\n\titself and blasts a house on the shore to fragments.\n\n\tBombs detonate along the Nevada, engulfing the entire upper\n\tdeck in flames, ravaging the sailors.\n\n\tEXT.  HOSPITAL - DAY\n\n\tThe Nevada is grounded near the hospital; from the doorway\n\tEvelyn can see the whole ship on fire, burning sailors\n\tleaping off the decks.  Her hearing, her presence of mind,\n\treturns; she lets Betty go, and grabs an ORDERLY.\n\n\t\t\t\t\tEVELYN\n\t\t\tGo to the base hardware store and get\n\t\t\tsome of those canister spray things they\n\t\t\tuse for killing bugs.\n\n\t\t\t\t\tORDERLY\n\t\t\tInsecticide?...\n\n\t\t\t\t\tEVELYN\n\t\t\tNo, just the sprayers.  We'll fill them\n\t\t\twith tannic acid, it'll sterilize them\n\t\t\tand cool the burns!  GO!\n\n\tThe orderly races away.  They can still hear the bombs\n\tfalling outside.\n\n\tA sailor staggers toward the hospital from the Nevada.  He is\n\tcompletely gray.  Everyone stares at him, and then realizes\n\the is nude, burned gray, his skin ash.\n\n\tEvelyn rushes to help him, shouting back over her shoulder to\n\tthe other nurses --\n\n\t\t\t\t\tEVELYN\n\t\t\tWe're gonna need every bed.  If they can\n\t\t\tbreathe, make 'em get up and move\n\t\t\tsomeplace else!\n\n\tEXT.  JAPANESE CARRIER - FLIGHT DECK - DAY\n\n\tThe first wave of planes lands on the carrier.  The flight\n\tleader rushes to the bridge.\n\n\tINT.  JAPANESE CARRIER - BRIDGE - DAY\n\n\tYamamoto's advisors are exultant.\n\n\t\t\t\t\tGENDA\n\t\t\tWe have achieved complete surprise!  The\n\t\t\tfirst wave is returning, the second is\n\t\t\tattacking now, and we have lost only a\n\t\t\tfew planes.  We can launch a third wave,\n\t\t\tAdmiral.\n\n\t\t\t\t\tYAMAMOTO\n\t\t\tThe second wave has not returned.  And we\n\t\t\thave no idea where their carriers are.\n\t\t\tWhat is the damage report?\n\n\t\t\t\t\tCOMMUNICATIONS OFFICER\n\t\t\tWe have Commander Fuchida on the radio\n\t\t\tnow, Admiral.\n\n\tYamamoto nods and Fuchida's voice comes over the intercom.\n\n\t\t\t\t\tFUCHIDA'S VOICE\n\t\t\tI am over the harbor now...\n\n\tEXT.  SKIES ABOVE PEARL HARBOR - DAY\n\n\tFuchida is in a scout plane, high over Pearl.  His vision is\n\thampered by the thick black smoke, but he can tell there has\n\tbeen awesome devastation.  He uses a diagram of the ships at\n\tanchor to note the damage to each ship.\n\n\t\t\t\t\tFUCHIDA\n\t\t\t\t(into radio)\n\t\t\tWe have a tremendous victory.  Many ships\n\t\t\tdamaged, some totally destroyed.  But the\n\t\t\tSecond Wave's attack is being hindered by\n\t\t\tthe smoke.\n\n\tINT.  WAR ROOM OF THE AKAGI - DAY\n\n\t\t\t\t\tYAMAMOTO\n\t\t\tThe more we attack, the harder it is to\n\t\t\tfind targets.  And we no longer have\n\t\t\tsurprise.\n\n\t\t\t\t\tGENDA\n\t\t\tIf we launch the third wave and\n\t\t\tannihilate their fuel depots, we destroy\n\t\t\ttheir ability to operate in the Pacific\n\t\t\tfor at least a year!\n\n\t\t\t\t\tYAMAMOTO\n\t\t\tAnd if we fail, and lose our carriers, we\n\t\t\tdestroy our ability to fight them at all.\n\t\t\t\t(beat)\n\t\t\tAs soon as the second wave returns, we\n\t\t\twill withdraw.\n\n\tEXT.  JAPANESE CARRIER AKAGI - DAY\n\n\tThe last planes touch down, and the lead carrier and the\n\tother ships in the Japanese assault fleet turn back toward\n\thome.\n\n\tEXT.  PEARL HARBOR - AFTERMATH - DAY\n\n\tThe harbor is a place of shattered bodies and shattered\n\tships.  Blood, body parts, debris everywhere, and all of it\n\tmade more hellish by the oil fires on the water and the\n\tchoking black smoke those fires produce.\n\n\tEvery survivor has become an emergency fireman, stretcher\n\tbearer, medic, iron worker.  They fish men from the water,\n\textract them from the tangled wreckage of the ships.\n\tEveryone is screaming and yelling -- the wounded for help,\n\tthe helpers for more help.\n\n\tLocal firemen and civilians battle heroically too; the water\n\tmains are ruptured, so they put pump water from the base\n\tswimming pool toward the burning ships.\n\n\tThe PHOTOGRAPHER records this with his black-and-white film\n\tcamera.  He is shaken, and yet he understands the magnitude\n\tof what he is recording -- the loss of America's innocence.\n\n\tEXT.  ARMY BASE - AFTERMATH - DAY\n\n\tIn one place, outside a barracks, soldiers hit by the bombs\n\tare just becoming conscious.  One of them comes to.\n\n\t\t\t\t\tCONSCIOUS SOLDIER\n\t\t\tSarge?!  Where are you, Sarge?\n\n\tHe's crawling around toward the bushes; his legs are\n\tshattered, but he's spotted a body.  He reaches it, turns it\n\tover -- and it's headless.\n\n\tHe turns away in horror...and finds himself staring at the\n\tsevered head.\n\n\tThe medics appear.\n\n\t\t\t\t\tMEDIC\n\t\t\tWe've got two more over here!\n\n\tEXT.  GENERAL SHORT'S OFFICE - DAY\n\n\tThe Western Union messenger, Tadao Fuchikami, delivers the\n\ttelegram from Washington.\n\n\tINT.  GENERAL SHORT'S OFFICE - DAY\n\n\tShort and his staff are assessing damage.\n\n\t\t\t\t\tSHORT\n\t\t\tI want lookouts and sentries everywhere,\n\t\t\twith orders to shoot first and ask\n\t\t\tquestions later.\n\n\t\t\t\t\tCOLONEL\n\t\t\tYou think an invasion possible, General?\n\n\t\t\t\t\tSHORT\n\t\t\tAfter this morning, we better not\n\t\t\tconsider anything impossible.\n\n\tAn aide hands Short the telegram.  He reads it --\n\n\t\t\t\t\tSHORT\n\t\t\tFrom Washington.  \"Intelligence reports\n\t\t\tan ultimatum from Japan to be given\n\t\t\tprecisely at one p.m.  Washington time.\n\t\t\tJust what significance the hour set may\n\t\t\thave we do not know, but be on alert\n\t\t\taccordingly.\"\n\n\tThe irony is bitter in his throat.\n\n\tEXT.  JAPANESE EMBASSY - OAHU - DAY\n\n\tThe Honolulu police roar up to the embassy in squad cars, and\n\tburst through the doors.\n\n\tINT.  JAPANESE EMBASSY - OAHU - DAY\n\n\tThe police storm through the embassy and find the Japanese\n\tthere burning documents.\n\n\tEXT.  PEARL HARBOR - AFTERMATH - DAY\n\n\tDivers are going down, trying to save the trapped men.  But\n\tthe tangle of the Arizona is horrific.  One diver gets\n\ttrapped, and another tries to extricate him, and the steel\n\tshifts and falls on them both.\n\n\tON THE DECK OF BOMB-SHATTERED BATTLESHIP, a naval CAPTAIN\n\toversees rescue efforts.  The 17-year-old sailor he sent off\n\tfor ammo now approaches him, with great concern.\n\n\t\t\t\t\tSEVENTEEN-YEAR-OLD SAILOR\n\t\t\tSir, I...I lost the dinghy.\n\n\tThe captain looks out over the wreckage, great battleships\n\tdevastated in every direction.\n\n\t\t\t\t\tCAPTAIN\n\t\t\tWell, son, we won't worry about the\n\t\t\tdinghy today.\n\n\tEXT.  HOSPITAL - PEARL HARBOR - NIGHT\n\n\tDanny and Rafe arrive at the hospital.  Their fears of what\n\tthey might find aren't helped when they see the stairs into\n\tthe hospital covered in blood.\n\n\tINT.  HOSPITAL - PEARL HARBOR - NIGHT\n\n\tRafe and Danny enter.  It's a scene from hell.  Doctors are\n\tdoing amputations in the hallway.  The once-pristine hospital\n\tis now all red, with blood dripping through the mattresses,\n\tonto the floor...\n\n\tIn the main ward, Evelyn and the other nurses are using the\n\tfly sprayers to spritz cooling antiseptic on the charred\n\tbodies.  Evelyn looks up and sees both Rafe and Danny.  Her\n\teyes register relief, but they are the only part of her that\n\tcan show emotion now; the rest of her is covered in blood.\n\tRafe and Danny move to her.\n\n\t\t\t\t\tRAFE\n\t\t\tHow can we help?\n\n\tINT.  HOSPITAL - PEARL HARBOR - NIGHT\n\n\tRafe and Danny sit quietly as Evelyn adjusts the tubes\n\tconducting blood from their arms into sterilized Coke bottles\n\tfor transfusion.\n\n\t\t\t\t\tRAFE\n\t\t\tWhat else can we do?\n\n\t\t\t\t\tEVELYN\n\t\t\tThere's nothing you can do here, they'll\n\t\t\tdie or they won't, we just --\n\n\tShe stops, afraid if she says more, she'll lose grip on her\n\temotions.  She can see the wreckage out in the harbor.\n\n\t\t\t\t\tEVELYN\n\t\t\tThere was a sailor, a black man on the\n\t\t\tWest Virginia, named Dorie Miller.  I'd\n\t\t\tlike to know if he's alive.\n\n\tShe goes back to her work.\n\n\tEXT.  PEARL HARBOR - DAY\n\n\tRafe and Danny hop from the ambulance in which they've\n\thitched a ride to the harbor.  They see the awful\n\tdevastation.\n\n\tEXT.  PEARL HARBOR - NIGHT\n\n\tRafe and Danny reach the West Virginia's pier, but in the\n\tdarkness, they can't find anything.  They stop a NAVAL\n\tOFFICER.\n\n\t\t\t\t\tDANNY\n\t\t\tWhere is the West Virginia?\n\n\t\t\t\t\tOFFICER\n\t\t\tThere.\n\n\tHe points; the battleship has sunk, its superstructure barely\n\tshowing above the water.\n\n\tIt looks hopeless to find a single sailor here; but then they\n\tsee a powerful black sailor, pulling to the dock with a\n\tdinghy full of dead men retrieved from the water.  As workers\n\tunload the bodies, the black sailor sits down, exhausted\n\tphysically and emotionally, his head in his hands.  Rafe and\n\tDanny approach him.\n\n\t\t\t\t\tDANNY\n\t\t\tWe're looking for Dorie Miller.\n\n\t\t\t\t\tDORIE\n\t\t\tThat's me, Sir.\n\n\t\t\t\t\tRAFE\n\t\t\tA friend of ours wanted to be sure you're\n\t\t\talive.  Evelyn.  A nurse.\n\n\t\t\t\t\tDORIE\n\t\t\tHow is she?\n\n\t\t\t\t\tDANNY\n\t\t\tLike we all are.\n\n\tMiller nods, and looks out over the harbor, a hellish place\n\twhere black smoke still hangs over everything, the shattered\n\tremains of men and ships still in the harbor.  It's total\n\tdevastation.  And yet something about that scene stirs\n\tsomething else in Dorie Miller.\n\n\t\t\t\t\tDORIE\n\t\t\tThere's something out there I need to\n\t\t\tget.  Will you help me?\n\n\tEXT.  PEARL HARBOR - AFTERMATH - NIGHT\n\n\tDorie pilots the dinghy through the floating debris.  Rafe\n\tand Danny sit with him.  He stops over a dangerous pile of\n\tsuperstructure wreckage.\n\n\t\t\t\t\tDORIE\n\t\t\tThe Arizona.  Hold the dinghy steady, so\n\t\t\tit doesn't bust open.\n\n\tRafe and Danny brace the dinghy so it doesn't move; but they\n\tstill don't see what Dorie is after as he fishes down in the\n\twater, for something barely at the surface; he works for a\n\tmoment, then pulls it up.\n\n\tIt's the oil-soaked flag of the Arizona.\n\n\tEXT.  HULL OF OKLAHOMA - NIGHT\n\n\tMen are working through the night to save the sailors trapped\n\tin the hull.\n\n\tINT.  OKLAHOMA - THE TRAPPED SAILORS\n\n\tare in total darkness.  From it we hear GASPING, then --\n\n\t\t\t\t\tSAILOR\n\t\t\tWhat's that?\n\n\tThe light comes on and sweeps around the faces.  The water is\n\tup to their chests, but it's stopped rising.\n\n\t\t\t\t\tSAILOR FLASHLIGHT\n\t\t\tJust hand on.  They'll find us.\n\n\t\t\t\t\tSAILOR\n\t\t\tHow do you know?\n\n\t\t\t\t\tSAILOR FLASHLIGHT\n\t\t\tBecause we would find them.\n\n\tHe switches the light off again.\n\n\tEXT.  HULL OF OKLAHOMA - NIGHT\n\n\tThe welders are cutting away, the torches sending showers of\n\tsparks everywhere.\n\n\tINT.  OKLAHOMA - THE TRAPPED SAILORS\n\n\tThey are gasping, running out of air.\n\n\t\t\t\t\tSAILOR FLASHLIGHT\n\t\t\tBreathe easy.  Stay calm.\n\n\t\t\t\t\tSAILOR\n\t\t\tYou hear something?\n\n\tSomething stirs in the ship; a noise...from where?  Then a\n\tpoint of light; sparks fly into the room; somebody's cutting\n\tthrough the wall.  And the sparks illuminate faces suddenly\n\tfilled with hope.\n\n\tBut as the cut enlarges, the trapped air, compressed by the\n\twater, starts rushing out -- and the water starts rising\n\tagain.  The trapped sailors hope turns to terror.\n\n\t\t\t\t\tSAILOR\n\t\t\tIt's letting out air, and letting in\n\t\t\twater!\n\n\tThe steel circle pops out, and they knock the welders down in\n\ttheir hurry to escape.\n\n\tSome of the sailors who were trapped are naked.  They fight\n\ttheir way toward the escape hole cut into the hull, assisted\n\tby rescue workers.\n\n\tEXT.  HULL OF OKLAHOMA - NIGHT\n\n\tThe trapped sailors emerge, and they can barely take in the\n\tdevastation.  Destroyed ships everywhere, the smoking\n\twreckage... The rescued sailors gaze around them in shock.\n\tThey are shivering, and other sailors put blankets around\n\tthem.\n\n\tEXT.  WHITE HOUSE - DAY\n\n\tThe entire Washington press corps is waiting, with fresh\n\tbulbs in the flash attachments of cameras that are already as\n\tbig as a shoe box.  The President is wheeled out of the White\n\tHouse, and not a single photographer takes a picture...not\n\tyet.\n\n\tAides help Roosevelt from the chair, and the press people all\n\tsee the President struggle on legs that have no strength, to\n\tthe podium.  His aides lock the steel clasps at the knees of\n\this braces into place, and the President stands at the\n\tmicrophone.  And suddenly, from the front, Roosevelt looks\n\tpowerful, even majestic.\n\n\tNow all the bulbs pop and flash.  He looks into the cameras.\n\n\t\t\t\t\tROOSEVELT\n\t\t\tYesterday, December 7, 1941 -- a date\n\t\t\twhich will live in infamy -- the United\n\t\t\tStates of American was suddenly and\n\t\t\tdeliberately attacked by naval and air\n\t\t\tforces of the Empire of Japan.\n\n\tOVER THIS, we see the bombing, the aftermath, the bodies\n\tbeing fished from the oil-soaked harbor.\n\n\t\t\t\t\tROOSEVELT\n\t\t\tThe distance of Hawaii from Japan makes\n\t\t\tit obvious that the attacks was planned\n\t\t\tmany days or even weeks ago.  During the\n\t\t\tintervening time the Japanese Government\n\t\t\thas deliberately sought to deceive the\n\t\t\tUnited States by false statements and\n\t\t\texpressions of hope for continued peace.\n\n\tEXT.  PACIFIC OCEAN - DAY\n\n\tThe Japanese fleet steams back toward Japan.  The young\n\tofficers are exultant...but Yamamoto is pensive.\n\n\t\t\t\t\tROOSEVELT\n\t\t\t...I regret to tell you that many\n\t\t\tAmerican lives have been lost.\n\n\tEXT.  PEARL HARBOR - DAY\n\n\tWe see rows of bodies outside the hospital where Evelyn\n\tworks.\n\n\tThe mess hall has been converted to a silent morgue, with\n\tbodies on every table.\n\n\t\t\t\t\tROOSEVELT\n\t\t\tYesterday the Japanese Government also\n\t\t\tlaunched an attack against Malaya.  Last\n\t\t\tnight Japanese forces attacked Hong\n\t\t\tKong... Guam...\n\n\tOVER THIS, EXT.  ISLANDS - NIGHT\n\n\tWe see Japanese planes bombing islands, and soldiers\n\tattacking amphibious landings.\n\n\t\t\t\t\tROOSEVELT\n\t\t\t...the Philippine Islands... Wake\n\t\t\tIsland... And this morning the Japanese\n\t\t\tattacked Midway Island.\n\n\tEXT.  WHITE HOUSE - DAY\n\n\t\t\t\t\tROOSEVELT\n\t\t\tThe facts speak for themselves.  With\n\t\t\tconfidence in our armed forces -- with\n\t\t\tthe unbounding determination of our\n\t\t\tpeople -- we will gain the inevitable\n\t\t\ttriumph -- so help us God.  I ask that\n\t\t\tthe Congress declare that since the\n\t\t\tunprovoked and dastardly attack by Japan\n\t\t\ton Sunday, December 7, 1941, a state of\n\t\t\twar --\n\n\tThe words echoes out across America --\n\n\t\t\t\t\tROOSEVELT'S VOICE\n\t\t\tWar...war...war...\n\n\tIt rings through the radios of farm houses, to country boys\n\tgathered round; in the pool halls of big cities; in the fire\n\thouses and high schools...\n\n\tTHE LINES AT RECRUITING STATIONS all across America -- men\n\tline up faster than the recruiters can handle them.\n\n\tINT.  WHITE HOUSE - DAY\n\n\tRoosevelt meets with his advisors.\n\n\t\t\t\t\tROOSEVELT\n\t\t\tGentlemen, the crisis we face is not the\n\t\t\tfact that our enemies believe they can\n\t\t\tdefeat us -- it's the fact that our people\n\t\t\tbelieve it too.  I want a plan -- a\n\t\t\tworkable plan -- to hit the heart of\n\t\t\tJapan, to bomb them the way they have\n\t\t\tbombed us.\n\n\t\t\t\t\tADMIRAL\n\t\t\tMr. President, Pearl Harbor caught us\n\t\t\tbecause we didn't face facts.  This isn't\n\t\t\ta time for ignoring them again.  There\n\t\t\tare no planes in the entire American\n\t\t\tarsenal capable of covering the distance\n\t\t\tto Japan from any land base we control\n\t\t\twhile carrying enough bombs to do any\n\t\t\tdamage whatsoever.\n\n\t\t\t\t\tGENERAL MARSHALL\n\t\t\tHe's right, Mr. President.  The Army has\n\t\t\tlong range bombers, but no place to\n\t\t\tlaunch them from.  Midway's too far,\n\t\t\tChina is overrun by Japanese forces, and\n\t\t\tRussia refuses to go to war with Japan\n\t\t\tand won't allow us to launch a raid from\n\t\t\tthere.\n\n\t\t\t\t\tADMIRAL\n\t\t\tThe navy's planes are small, carry light\n\t\t\tloads, and have short range.  We would\n\t\t\thave to get them within a few hundred\n\t\t\tmiles of Japan, and therefore risk our\n\t\t\tcarriers.  And if we lose our carriers,\n\t\t\twe have no shield against invasion.\n\n\t\t\t\t\tROOSEVELT\n\t\t\tWhat if the Japanese did invade?\n\n\t\t\t\t\tGENERAL MARSHALL\n\t\t\tWe've done studies.  We're confident we\n\t\t\twould turn them back eventually...after\n\t\t\tthey'd gotten as far as Chicago.\n\n\t\t\t\t\tADMIRAL\n\t\t\tMr. President...with all respect...what\n\t\t\tyou are asking can't be done.\n\n\tRoosevelt places his hands on the arms of his wheelchair, and\n\tstruggles to lift himself.  Aides jump to help him, but he\n\twaves them off.  With inhuman physical effort, that has his\n\tneck veins bulging and sweat popping on his face, Roosevelt\n\tstands on his withered legs.\n\n\t\t\t\t\tROOSEVELT\n\t\t\tDo not tell me...it can't be done.\n\n\tEXT.  PEARL HARBOR - HICKAM BASE - DAY\n\n\tThere is a mass memorial service going on, with caskets\n\tdraped in flags.\n\n\tThere are also coffins covered in Japanese flags, their\n\tdrowned fliers being treated now with respect.\n\n\tEveryone is in their best uniforms.  The pilots -- Rafe,\n\tDanny, and the other guys -- are looking at Billy's coffin;\n\tEvelyn, next to Danny, on his appropriate side is looking at\n\tone that belongs to Betty.  So is Red; he's grieving.\n\n\t\t\t\t\tMINISTER\n\t\t\t...Where is God in this?  Our enemies\n\t\t\tbelieve a divine wind protects them.  We\n\t\t\tsee our friends laid out before us, and\n\t\t\tfind it hard to believe in anything at\n\t\t\tall.\n\n\tRafe and Evelyn exchange a glance, past Danny.\n\n\t\t\t\t\tMINISTER\n\t\t\tThough we cannot understand why our\n\t\t\tfriends should die while we live, we can\n\t\t\taffirm our truest selves in our belief\n\t\t\tthat any God worth divinity would choose\n\t\t\tboth justice and mercy, and would take\n\t\t\tthese fallen brothers and sisters into\n\t\t\teternal peace.  Amen.\n\n\tAs the mourners disperse, Evelyn puts a lei on Betty's\n\tcasket; Red does the same, then breaks down beside Danny.  As\n\tDanny comforts him, Evelyn moves to Rafe.\n\n\t\t\t\t\tEVELYN\n\t\t\tRafe --\n\n\t\t\t\t\tRAFE\n\t\t\tI need to tell you something.  I didn't\n\t\t\tknow what it was to lose somebody, to see\n\t\t\tdeath and find how much it scares you.\n\t\t\tThat you haven't lived and loved enough.\n\t\t\tI didn't understand.  Forgive me.\n\n\t\t\t\t\tEVELYN\n\t\t\tRafe... No.  You forgive me.\n\n\t\t\t\t\tRAFE\n\t\t\tOf course I forgive you.  I know what you\n\t\t\tfeel for Danny is real.  And your choice\n\t\t\tis your choice.\n\n\t\t\t\t\tEVELYN\n\t\t\tThat's what I have to tell you, Rafe.  It\n\t\t\twasn't a choice.  It --\n\n\tAn Army Corps MAJOR steps up and interrupts.\n\n\t\t\t\t\tMAJOR\n\t\t\tLieutenant Rafe McCawley?\n\n\t\t\t\t\tRAFE\n\t\t\tYes, Major.\n\n\t\t\t\t\tMAJOR\n\t\t\tLieutenant Daniel Walker here too?\n\n\tDanny sees him and moves up.\n\n\t\t\t\t\tDANNY\n\t\t\tI'm Walker.\n\n\t\t\t\t\tMAJOR\n\t\t\tYou're going Stateside.  We fly out in\n\t\t\thalf an hour.\n\n\tHe hands them both orders.\n\n\t\t\t\t\tRAFE\n\t\t\tWhat for, Sir?\n\n\t\t\t\t\tMAJOR\n\t\t\tAsk Colonel Doolittle.  Those orders are\n\t\t\tfrom him.\n\n\tEXT.  HICKAM FIELD - DAY\n\n\tThe wrecked planes have been pushed off the runway and lie in\n\tpiles.  A transport plane is fueling, and Rafe and Danny wait\n\tin the shade of a shelter.\n\n\t\t\t\t\tDANNY\n\t\t\tI told her not to come.\n\n\tThe Major, watching the fueling, gets a wave from the ground\n\tcrew and turns and motions to Rafe and Danny that they're\n\tready.  They pick up their duffel bags -- and then Evelyn\n\tcomes around the corner of the shelter.\n\n\tRafe sees her first, but stops and looks away as Danny moves\n\tto her.  For a moment he studies her eyes, and she does not\n\tlook away.\n\n\t\t\t\t\tDANNY\n\t\t\tThis hasn't been easy for any of us.  I\n\t\t\tfeel awful for how it's happened.  But\n\t\t\tI've seen my first spring too.  Thanks\n\t\t\tfor knowing that's true.\n\n\tHe takes her into his arms, kisses her tenderly but briefly,\n\ta final time.  Evelyn's eyes find Rafe, but he can't look at\n\ther until the embrace is over.\n\n\tRafe and Danny move to the plane and hurry up the steps.\n\tThey turn before the door closes and wave to her.\n\n\tEvelyn's still standing there as the plane lifts away.\n\n\tINT.  U.S. MILITARY INSTALLATION - NIGHT\n\n\tThe transport has landed and taxied right to the door of a\n\tlow, dark bunker, mostly underground.  The Major leads Rafe\n\tand Danny inside.\n\n\tINT.  BUNKER\n\n\tRafe and Danny follow the Major down a spartan corridor; the\n\twhole place reeks of secrecy.\n\n\tINT.  BUNKER - SECRECY ROOM - NIGHT\n\n\tThe Major opens the door for Rafe and Danny, then leaves,\n\tclosing it behind him.  Doolittle is alone at a desk.  Rafe\n\tand Danny walk in and salute.  Doolittle motions to the two\n\tchairs in front of the desk without looking up from the\n\tpapers he's studying.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tI heard what you did.\n\n\t\t\t\t\tRAFE\n\t\t\tWe can explain, Colonel.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tExplain what?\n\n\t\t\t\t\tDANNY\n\t\t\tWhatever is was you heard about us.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tYou mean the hula shirts you were flying\n\t\t\tin?... Or the six planes you shot down?\n\t\t\tYou're both being awarded the Silver\n\t\t\tStar, and promoted to captain.\n\n\t\t\t\t\tRAFE\n\t\t\tIs that the good new, Sir, or --\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tYou're just about the only pilots in the\n\t\t\tArmy with actual combat experience, so\n\t\t\tyou're volunteering for a mission I've\n\t\t\tbeen ordered to put together.  Do you\n\t\t\tknow what top secret is?\n\n\t\t\t\t\tRAFE\n\t\t\tWell sure, Colonel --\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tTop secret means you help me pick the\n\t\t\tother pilots, train, and go -- without\n\t\t\tknowing where you're going until it's too\n\t\t\tlate.\n\n\t\t\t\t\tDANNY\n\t\t\tYou can count on us.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tThere's only one other thing I can tell\n\t\t\tyou.\n\n\tDoolittle looks up from his paperwork for the first time.\n\tHis eyes are fierce.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tYou won't need any goddamn hula shirts.\n\n\tEXT.  ESTABLISHING EGLIN FIELD, FLORIDA - DAY\n\n\tEglin Field is on the gulf coast of Florida.\n\n\tINT.  BRIEFING ROOM - EGLIN FIELD - DAY\n\n\tA room full of PILOTS are assembled, with and other CREWMEN.\n\tDanny and Rafe are there; Red and Anthony too.\n\n\t\t\t\t\tVOICE\n\t\t\tAttention!\n\n\tColonel Doolittle strides into the room as all the men snap\n\tto attention.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tBe seated.  The mission you've\n\t\t\tvolunteered for is dangerous.  How\n\t\t\tdangerous?  Look at the man beside you.\n\t\t\tIt's a good bet that six weeks from now,\n\t\t\teither you or he will be dead.\n\n\tDanny and Rafe whisper to each other --\n\n\t\t\t\t\tDANNY\n\t\t\tSorry you're gonna die -- cause I'm gonna\n\t\t\tmake it.\n\n\t\t\t\t\tRAFE\n\t\t\tWhat color flowers you want me to bring\n\t\t\tto your funeral?\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tIn flight school you qualified in single\n\t\t\tand in multi-engine planes.  You'll be\n\t\t\tflying multi-engines here.\n\n\t\t\t\t\tRAFE\n\t\t\t\t(whispering)\n\t\t\tBombers.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tI want to introduce a couple of people.\n\t\t\tDoc White is a flight surgeon; he has\n\t\t\tvolunteered for gunnery training so that\n\t\t\the can go on the mission, because we\n\t\t\tcan't spare the weight of an extra man.\n\n\t\t\t\t\tDANNY\n\t\t\t\t(whispering)\n\t\t\tA long range bomber mission.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\t...And Ross Greening, who will oversee\n\t\t\tyour equipment.  Any questions?\n\n\t\t\t\t\tDANNY\n\t\t\tWho'll be the first one in, Colonel?  I'd\n\t\t\tlike to volunt --\n\n\tRafe elbows his ribs so hard it takes his breath away.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tI thought I'd made it clear, I'm not\n\t\t\tjust putting this mission together -- I'm\n\t\t\tleading it myself.\n\n\t\t\t\t\tRAFE\n\t\t\tI take it back, about the flowers.  We're\n\t\t\tall gonna die.\n\n\tEXT.  EGLIN FIELD - RUNWAY - DAY\n\n\tCLOSE - A B-25 bomber, from different angles.\n\n\tThe pilots look them over, liking what they see.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tThis is what we'll fly -- the B-25.\n\t\t\tThere's one thing you have to be aware of\n\t\t\tfrom the very beginning.  You see that\n\t\t\tprivate?\n\n\tThey look down the runway a few hundred feet.  A private\n\twaves, and starts painting a red line across the runway.\n\tAnother private, close by, paints a green line.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tGreen means go.  Red means dead.\n\n\tMONTAGE - THE TRAINING - EGLIN FIELD - DAY\n\n\tThe pilots practice takeoff's.  Red is Rafe's copilot;\n\tAnthony is Danny's.  Nobody can get airborne before the red\n\tline.\n\n\tINT.  EGLIN FIELD - LECTURE ROOM - DAY\n\n\tDoolittle is instructing the men.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tYou're having trouble getting airborne in\n\t\t\tthe shorter space because you're not\n\t\t\trevving the engines enough.  You've got\n\t\t\tto push them to the limit before you ever\n\t\t\tstart to move.\n\n\tRafe is distracted; he's lost in though, looking at Danny --\n\tand looks away just before Danny realizes it.\n\n\tMONTAGE CONTINUES - EXT.  EGLIN FIELD RUNWAY - DAY\n\n\tPilots practice hard, revving the engines, taking off\n\thard...all of them crossing the red line, takeoff after\n\ttakeoff.  Rafe pushes his engine hard and still crosses by\n\ttwenty feet; Danny pushes even harder, and misses by ten\n\tfeet.\n\n\tDoolittle watches with Greening from the edge of the runway.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tWe've got to get the weight down.\n\n\tINT.  HANGER - EGLIN FIELD - DAY\n\n\tGreening has removed the intensely complex Norden sight from\n\ta bomber and put in on a table for Doolittle.\n\n\t\t\t\t\tGREENING\n\t\t\tOkay, forty pounds gone.  And in it's\n\t\t\tplace, this.\n\n\tHe shows Doolittle an aluminum strip on a swivel.\n\n\t\t\t\t\tGREENING\n\t\t\tWeight, 3 ounces.  Cost, 20 cents.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tDoes it work?\n\n\tEXT.  EGLIN FIELD - DAY\n\n\tDoolittle pilots a B-25 at treetop level onto a practice\n\tbombing range.  Greening uses the makeshift sight, and drops\n\ta 500-lb sack of flour, right in the middle of the bull's-eye\n\ttarget chalked on the ground.\n\n\tEXT.  FLORIDA COAST - DAY\n\n\tThe B-25's are practicing, flying at treetop level.  Red is\n\tRafe's copilot, Anthony is Danny's.  Doolittle is flying the\n\tlead bomber.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tRight down to the treetops.  Low as you\n\t\t\tcan.\n\n\tRafe brings his plane down, smoothly.  Then Danny's plane\n\tappears -- under him.  Rafe jerks his nose up quickly.\n\tRafe's angry; Danny's laughing -- but he scares the shit out\n\tof his crew.\n\n\tEXT.  EGLIN FIELD - NIGHT\n\n\tDanny's outside, looking up at the moon.  Rafe appears and\n\tmoves up beside him.\n\n\t\t\t\t\tDANNY\n\t\t\tFun today.  Like old times.\n\n\t\t\t\t\tRAFE\n\t\t\tDanny, what the hell are you trying to do\n\t\t\tout there?\n\n\t\t\t\t\tDANNY\n\t\t\tWhat do you mean?  I'm just doing what\n\t\t\twe've always done.\n\n\t\t\t\t\tRAFE\n\t\t\tNo.  You're trying to beat me.\n\n\t\t\t\t\tDANNY\n\t\t\tWe've always tried to beat each other.\n\n\t\t\t\t\tRAFE\n\t\t\tBullshit.  We've played with each other,\n\t\t\tpushed each other.  This is different.\n\t\t\tLike you want to prove that you're\n\t\t\tbetter than me.  Who's that for --\n\t\t\tEvelyn?\n\n\tDanny's anger flares for a moment -- but Rafe's hit home.\n\n\t\t\t\t\tDANNY\n\t\t\tMaybe just trying to measure up.\n\n\t\t\t\t\tRAFE\n\t\t\tWhat's between you and her is between you\n\t\t\tand her.  But here's what's between you\n\t\t\tand me.  Everybody has a hero, Danny.\n\t\t\tAnd you're mine.\n\n\tDanny's caught off-guard.\n\n\t\t\t\t\tRAFE\n\t\t\tWhen we were growing up, I had\n\t\t\teverything.  You had nothing.  You\n\t\t\tclimbed out of a hole I couldn't even see\n\t\t\tthe bottom of.  I think maybe when I went\n\t\t\toff to England, I was trying to measure\n\t\t\tup to you.  Measuring up's over.  Let's\n\t\t\tjust look out for each other.  Okay?\n\n\tThey embrace, closer now than ever.\n\n\tMONTAGE - INTERCUT\n\n\twith the planes practicing their short takeoffs, we see\n\tRoosevelt in one of his fireside chats, his voice broadcast\n\tacross America...\n\n\t\t\t\t\tROOSEVELT'S VOICE\n\t\t\tGood evening, America...\n\n\tFamilies all across America are gathered around radios,\n\tlistening.\n\n\t\t\t\t\tROOSEVELT'S VOICE\n\t\t\tI'm told that 80% of American families\n\t\t\tare listening to these fireside chats of\n\t\t\tours, and I'm happy we can come together,\n\t\t\tas one great American family.  I'd like\n\t\t\teach of you within the sound of my voice\n\t\t\tto find a map...\n\n\tThe FAMILIES do, gathering around encyclopedias, school\n\tbooks, any reference they have, spread on kitchen tables,\n\tsuburban living room rugs, or farmhouse hearths...\n\n\tAnd the B-25's, all sixteen of them, begin a journey in\n\tformation, flying at treetop level across America:\n\tMississippi delta land, Texas plains, Arizona mesas...\n\n\t\t\t\t\tROOSEVELT'S VOICE\n\t\t\tLook at the Pacific Ocean.  It covers\n\t\t\thalf the surface of the earth.  And look\n\t\t\tat the great Atlantic.  The oceans both\n\t\t\tdivide and connect us to our enemies, and\n\t\t\teither they will come to us, or we will\n\t\t\tgo to them...\n\n\tThe formation of B-25's reaches San Francisco.\n\n\tEXT.  SAN FRANCISCO NAVAL AIR STATION - DAY\n\n\tDoolittle leads the bombers to a landing.  IN RAFE'S PLANE,\n\teverybody's wondering why they're here.\n\n\t\t\t\t\tRED\n\t\t\tN-naval station?  What's g-going on?\n\n\t\t\t\t\tRAFE\n\t\t\tWish I knew, Red.\n\n\tEXT.  SAN FRANCISCO AIR FIELD - DAY\n\n\tThe crews climb from their planes, and almost before they're\n\tout, teams of men use straps and cranes to hoist the bombers\n\tonto flatbed trucks.  Doolittle walks up to Rafe and Danny,\n\twatching the baffling operation.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tWant to see where they're going?\n\n\tEXT.  SAN FRANCISCO HARBOR - EVENING\n\n\tCranes lift the planes from the trucks and hoist them onto\n\tthe flight decks of the carrier USS HORNET.  The pilots stand\n\ton the pier, watching.\n\n\t\t\t\t\tANTHONY\n\t\t\tI guess that settles it.  Somewhere in\n\t\t\tthe Pacific.\n\n\t\t\t\t\tRED\n\t\t\tWith a s-short r-runway.\n\n\tThey all gather around Doolittle as he moves up to them.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tYou have rooms at the Biltmore.  I\n\t\t\tsuggest a nice meal and a good night's\n\t\t\tsleep.  We leave tomorrow.\n\n\tDoolittle walks to join a captain.\n\n\tINT./ EXT.  SAN FRANCISCO HOTEL - NIGHT\n\n\tThe pilots get off the bus and carry their duffels into the\n\tlobby.\n\n\t\t\t\t\tANTHONY\n\t\t\tSan Francisco, here we are!\n\n\t\t\t\t\tDANNY\n\t\t\t\t(grinning)\n\t\t\tI don't reckon we can get hogbrains and\n\t\t\tgrits, but I hear a man can eat good in\n\t\t\tthis town.\n\n\t\t\t\t\tRAFE\n\t\t\tI'm gonna turn in.  I hate being on the\n\t\t\twater.  I think this is the last sleep\n\t\t\tI'll get for awhile.\n\n\tINT.  LOBBY - NIGHT\n\n\tThe other guys drop their duffels with the bell hops; Rafe\n\tmoves to the reception desk.\n\n\t\t\t\t\tRAFE\n\t\t\tMcCawley.\n\n\tThe manager hands him a key, and smiles curiously.\n\n\t\t\t\t\tMANAGER\n\t\t\tHave fun.\n\n\tINT.  HOTEL ROOM - NIGHT\n\n\tRafe enters his room and finds the light on...and Evelyn's\n\tthere waiting.\n\n\t\t\t\t\tRAFE\n\t\t\tWhat?...\n\n\t\t\t\t\tEVELYN\n\t\t\tThey were bringing back a ship full of\n\t\t\twounded and needed extra nurses along.  I\n\t\t\twrote Colonel Doolittle, and told him I\n\t\t\tneeded to see you before you go.\n\n\t\t\t\t\tRAFE\n\t\t\tIt must of been a convincing letter.\n\n\t\t\t\t\tEVELYN\n\t\t\tIt was.  I couldn't have you go away,\n\t\t\twherever it is...to war...without knowing\n\t\t\tsomething.  You think I made a choice, of\n\t\t\tDanny over you.  I didn't.  I didn't have\n\t\t\ta choice.  I'm pregnant.\n\n\tThe blood drains from Rafe's heart.  Yet he finds the\n\tstrength to move to her.  She turns away, so she won't throw\n\ther arms around him.\n\n\t\t\t\t\tRAFE\n\t\t\tDoes Danny know?\n\n\tShe shakes her head, refuses to cry.\n\n\t\t\t\t\tEVELYN\n\t\t\tI wasn't sure, until the day you turned\n\t\t\tup alive.  I never had a chance to tell\n\t\t\thim.  Now I can't have him thinking about\n\t\t\tthis when he needs to be thinking about\n\t\t\this mission, and how to come back from\n\t\t\tit.\n\n\tShe turns and faces him again.\n\n\t\t\t\t\tEVELYN\n\t\t\tI want you thinking about that too.  Just\n\t\t\tcome back.\n\t\t\t\t(beat)\n\t\t\tRafe, I see it in your face.  You're\n\t\t\tthinking you don't have anything to live\n\t\t\tfor.  Don't you dare think that way.\n\t\t\tI'll never write a letter, or look at a\n\t\t\tsunset, without thinking of you.  I'll\n\t\t\tlove you my whole life.  And I want you\n\t\t\tto live.\n\n\tShe looks at him, her eyes bright with tears, but still she\n\trefuses to cry.  They both know they can't touch, or they'll\n\tnever let go.  She walks past him, out of the room, closing\n\tthe door softly behind her.\n\n\tEXT.  SAN FRANCISCO HARBOR - DAY\n\n\tThe USS HORNET clears the Golden Gate Bridge, with cruisers\n\tand destroyers rounding out its battle group.\n\n\tRafe and Danny stand on the flight deck, watching the city\n\trecede behind them.\n\n\tEvelyn is on a hilltop watching them go.  Danny can't see\n\ther, doesn't know she's there.  Rafe can't see her either --\n\tbut he knows.\n\n\t\t\t\t\tSHIP'S INTERCOM\n\t\t\tArmy pilots to the briefing room.\n\n\tINT.  THE CARRIER HORNET - BRIEFING ROOM - DAY\n\n\tThe pilots are gathered expectantly in the carrier's\n\tconference room.  Doolittle strides in.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tGentlemen, I can now tell you that the\n\t\t\ttarget of this mission is Tokyo.\n\n\tThe pilots love it.  The ones who have not seen battle are\n\tgrinning and vocal.  Rafe, Danny, Anthony, and Red are\n\tquieter, savoring the prospect of revenge.\n\n\t\t\t\t\tRED\n\t\t\tAnd where's the secret base, Sir?  The\n\t\t\tone we t-takeoff from.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tThe navy will get us to within 400 miles\n\t\t\tof the Japanese coast.  We'll launch off\n\t\t\tthe carriers from there.\n\n\tSuddenly the pilots don't like the sound of this.\n\n\t\t\t\t\tANTHONY\n\t\t\tSir, has this ever been done, launching\n\t\t\tan army bomber off a navy carrier?\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tNo.  Any other questions?\n\n\t\t\t\t\tRED\n\t\t\tC-Colonel, we been p-practicing\n\t\t\ttakeoff's, but I ain't sure we can land\n\t\t\ton these carriers d-decks.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tWe won't have the fuel to get back to the\n\t\t\tcarriers; they'll turn and run back to\n\t\t\tHawaii the minute we're airborne.\n\n\t\t\t\t\tRED\n\t\t\tThen wh-where do we land?\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tI have a phrase I want you all to\n\t\t\tmemorize:  \"Lushu hoo megwa fugi.\"  It\n\t\t\tmeans \"I am an American.\"  In Chinese.\n\n\tAbsolute silence among the pilots.\n\n\tEXT.  FLIGHT DECK OF THE HORNET - DAY\n\n\tThe sailors who man the flight deck look at each other with\n\tbafflement as the worried pilots pace from one end of the\n\tdeck to the other.  They're in a line like ducks, Rafe in the\n\tlead and the others following, counting steps, each man\n\tmeasuring the distance.  Shaking their heads, worrying.\n\n\tThey stop at the end and look down at the sea far below them;\n\tit's dizzying.  Anthony shoves Red for fun before grabbing\n\this shoulder to stop him from falling.\n\n\t\t\t\t\tRED\n\t\t\tA-a-asshole!... Maybe it's l-longer\n\t\t\tgoing this way.\n\n\tHe starts pacing back the other way, as if the ship's longer\n\tin that direction.  The other pilots watch him for a moment,\n\tthen follow him, counting again.\n\n\tRafe and Danny are left standing alone at the end of the\n\tflight deck.  Far over the surging sea.\n\n\t\t\t\t\tDANNY\n\t\t\tIt's shorter than our practice runway.\n\n\t\t\t\t\tRAFE\n\t\t\tThey'll turn the ship into the wind\n\t\t\tbefore we launch.  That'll help.\n\n\t\t\t\t\tDANNY\n\t\t\tWe'll be loaded with 2,000 pounds of\n\t\t\tbombs and 1,500 pounds of fuel.  I got\n\t\t\tanother Chinese phrase for Doolittle.\n\t\t\t\"Mug wump rickshaw mushu pork.\"  It\n\t\t\tmeans \"Who the fuck thought up this\n\t\t\tshit?\"\n\n\tDoolittle appears right beside them.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tHe was a navy man.\n\n\tDoolittle walks away.\n\n\t\t\t\t\tRAFE\n\t\t\tMaybe we'll be lucky with the weather.\n\n\t\t\t\t\t\t\t\tSMASH TO:\n\n\tEXT.  PACIFIC - A FEROCIOUS STORM - NIGHT\n\n\tThe Hornet tosses, bashed by a vicious storm.\n\n\tINT.  CARRIER HORNET - BRIEFING ROOM - DAY\n\n\tThe ships is rolling; most of the fliers are green.\n\tDoolittle stands at the podium.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tSince we'll be on our own once we're in\n\t\t\tthe air, I thought I had a good idea\n\t\t\tletting each crew select it's own target.\n\n\tHe looks at a pile of paper slips in front of him.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tNow we have fifteen requests for the\n\t\t\tEmperor's Palace...and one for Tokyo\n\t\t\tbaseball stadium.\n\n\t\t\t\t\tRED\n\t\t\tI d-don't think Japs ought'a be allowed\n\t\t\tto p-play baseball.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tI'd like to bomb their Emperor too.  But\n\t\t\tI think that'd just piss 'em off.  The\n\t\t\tidea here, Gentlemen, is not revenge.\n\t\t\tWe're here to prove to them that they're\n\t\t\tneither invincible nor superior.  So\n\t\t\tlet's try this again.  Military targets\n\t\t\tonly.\n\n\t\t\t\t\tRED\n\t\t\tColonel, to f-fight you need strategy.\n\t\t\tTo have strategy, ya gotta practice.  And\n\t\t\tto practice it, ya gotta play --\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tNo baseball diamonds, Red.\n\n\t\t\t\t\tRED\n\t\t\tY-Yes Sir.\n\n\tEXT.  PACIFIC - DAY\n\n\tThe storm is subsiding, but it's still raining.  From the\n\tbridge of the Hornet, they spot the ENTERPRISE.\n\n\t\t\t\t\tADMIRAL\n\t\t\tThe Enterprise will ride shotgun when we\n\t\t\tlaunch the bombers.  They wanted our\n\t\t\tcarriers at Pearl, and now we've come to\n\t\t\tthem.  If the Japanese get us, they'll be\n\t\t\thaving dinner in San Francisco next\n\t\t\tmonth.\n\n\tEXT.  FLIGHT DECK - THE HORNET - DAY\n\n\tThe preparations begin.  Deck crews move the B-25's to the\n\trear of the flight deck.  Fueling teams top off the bomber's\n\tgas tanks.  Ordnance men hoist four bombs into each aircraft,\n\tand the army gunners load ammunition for the machine guns.\n\tGreening checks the planes' mechanical and hydraulic systems.\n\n\tAnd once again the pilots are out pacing the deck distance.\n\tIt's turned into a game for them, walking off nerves.  As\n\tRafe and Danny pass.\n\n\t\t\t\t\tRAFE\n\t\t\tIt's not getting any longer.\n\n\t\t\t\t\tDANNY\n\t\t\tLonger?  It's getting shorter.\n\n\tINT.  HORNET - BRIEFING ROOM - DAY\n\n\tDoolittle is laying out the plan for all the pilots.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tWe'll take off late this afternoon.  I'll\n\t\t\thit Tokyo at dusk, and drop incendiary\n\t\t\tbombs.  You'll come after me at night,\n\t\t\tguided by the fires.  Then it's on to\n\t\t\tChina, where you'll arrive at dawn,\n\t\t\tguided to their airfields by the homing\n\t\t\tbeacons the Chinese are going to switch\n\t\t\ton for us.  That's if everything is\n\t\t\tperfect -- like every other military\n\t\t\tmission I've ever been involved with.\n\n\tDoolittle looks around the room.  No one's smiling.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tListen you guys.  I'm the first plane --\n\t\t\tthen McCawley, Walker, the rest of you.\n\t\t\tI'll have the shortest run.  If I don't\n\t\t\tmake it, you don't go.\n\n\t\t\t\t\tRAFE\n\t\t\tColonel...we're all going.  Whether you\n\t\t\tmake it or not.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tI know.\n\n\tEXT.  BRIDGE OF THE CRUISER NASHVILLE - DAY\n\n\tThe cruiser Nashville is at the perimeter of the task force.\n\tIt's lookouts spot Japanese patrol boats ahead.\n\n\tINT.  BRIDGE OF THE ENTERPRISE - DAY\n\n\tThe message is handed to Admiral Halsey.\n\n\t\t\t\t\tOFFICER\n\t\t\tSir, lookouts on the cruisers report\n\t\t\tpatrol boats, ten miles away!\n\n\t\t\t\t\tHALSEY\n\t\t\tThe Japs have set up a picket line!\n\t\t\tOrder the cruisers to open fire!  We've\n\t\t\tgot to sink them before they get a\n\t\t\tmessage away.\n\n\tEXT.  PACIFIC - DAY\n\n\tThe cruiser NASHVILLE begins firing rounds at the Japanese\n\tpatrol boat; round after round misses.\n\n\tINT.  HORNET'S RADIO ROOM - DAY\n\n\tThe operators hear the excited voices of Japanese radio\n\ttraffic.\n\n\t\t\t\t\tRADIO OPERATOR\n\t\t\tThey've reported our position!  Tell the\n\t\t\tAdmiral.\n\n\tEXT.  HORNET - DAY\n\n\tDoolittle hurries up to the command bridge, with the naval\n\tofficers sent by the Admiral to fetch him.  Doolittle sees\n\tthe cruisers next to the carrier firing its guns -- at\n\tJapanese boats in the distance.\n\n\tINT.  BRIDGE OF THE HORNET - DAY\n\n\tDoolittle finds the Admiral gathered with his staff, their\n\tmood is grim.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tHow far are we from Tokyo?\n\n\t\t\t\t\tADMIRAL\n\t\t\tSeven hundred miles.\n\n\tINT.  PILOT'S WARD ROOMS - SERIES OF DISSOLVES\n\n\tRafe, Danny, and the other pilots are alone at their bunks,\n\ttaking advantage of the lull before the mission.\n\n\tRafe has paper and pen to write a letter, but he can't think\n\tof anything to write.\n\n\tDanny holds the \"Picture of Paradise\" that Sammy took, of\n\tEvelyn and the nurses in the sun.  He tucks it inside his\n\tshirt, when he hears --\n\n\t\t\t\t\tLOUDSPEAKER\n\t\t\tArmy pilots, man your planes!\n\n\tEXT.  FLIGHT DECK - THE HORNET - DAY\n\n\tThe pilots run onto deck.  The cruiser next to the Hornet is\n\tstill firing away at the Japanese patrol boat.\n\n\tDoolittle runs onto deck, shouting orders.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tLoad in every bit of extra gas you can\n\t\t\tcarry!  And strip everything you don't\n\t\t\tneed out of the planes.  I mean\n\t\t\tEVERYTHING!\n\n\tEXT.  HORNET - FLIGHT DECK - STRIPPING THE PLANES - DAY\n\n\tIt's starting to rain but the guys don't notice at all.\n\tThey're stripping seats out of the planes, tossing out their\n\town gear.\n\n\tGreening pulls the machine guns out of the rear of the planes\n\tand puts in broomsticks painted black.\n\n\tOff in the distance the Japanese patrol boat takes a hit and\n\texplodes.  Rafe and Danny meet between their bombers.\n\n\t\t\t\t\tDANNY\n\t\t\tBroomsticks instead of tail guns.\n\n\t\t\t\t\tRAFE\n\t\t\tWe'll get separated over the target, but\n\t\t\tyou and I will rendezvous for the run to\n\t\t\tChina.  I'm on your wing.\n\n\t\t\t\t\tDANNY\n\t\t\tAnd I'm on yours.  Land of the free.\n\n\t\t\t\t\tRAFE\n\t\t\tHome of the Brave.\n\n\tThey climb into their bombers.\n\n\tEXT.  HORNET - FLIGHT DECK - DAY\n\n\tThe engines are revving.  The tachs are showing redline.  The\n\tcrews are in their planes.  Doolittle is first, just ahead of\n\tRafe and Danny's B-25's.\n\n\tThe battle pennants whip, the props blur, the wheels strain\n\tagainst the brakes; from the cockpits the flight deck looks\n\timpossibly short...and the American flag cracks in the wind.\n\n\tAnd now every pilot looks at Doolittle's plane...\n\n\tDoolittle starts the run down the flight deck...faster...the\n\tend looming.  He turns the plane almost vertical, standing it\n\ton its props...and lifts away smoothly.\n\n\tThe sailors on deck cheer, like the Japanese did before Pearl\n\tHarbor.\n\n\tRafe, Danny, and the others take off too.\n\n\tEXT.  SKIMMING OVER THE WAVES - DAY\n\n\tThe B-25's head toward Japan.\n\n\tEXT.  PACIFIC - THE AMERICAN TASK FORCE - DAY\n\n\tAdmiral Halsey, on the deck of the ENTERPRISE, watches as the\n\tlast plane takes off.  The planes recede in the distance,\n\tracing just a few feet over the water, toward Japan.\n\n\t\t\t\t\tHALSEY\n\t\t\tOf all the other things this mission is\n\t\t\tdoing that have never been done before...\n\t\t\tI've never sent out planes that I wasn't\n\t\t\tgoing to see safely home.  Let's get out\n\t\t\tof here.\n\n\tThe task force runs for home.\n\n\tEXT.  SKIMMING OVER THE WAVES - DAY\n\n\tAt first the planes are together; Rafe and Danny can see each\n\tother off each other's wing, and Doolittle's plane is ahead.\n\tThe others are grouped after them.  They maintain strict\n\tradio silence, and can communicate only with gestures, hand\n\tsignals, or a flasher for Morse code.  When Rafe speaks to\n\tthe crew of his own plane, it's by pressing an intercom\n\tsender to his throat.\n\n\t\t\t\t\tRAFE\n\t\t\tWhat's our ETA for Tokyo?\n\n\tThe bombardier/navigator is already working out the numbers\n\tat his plotting table in the center of the plane.\n\n\t\t\t\t\tNAVIGATOR\n\t\t\tAlmost exactly at 12 noon.\n\n\t\t\t\t\tRED\n\t\t\tHigh n-noon.  I k-kinda like that.\n\n\tRafe looks over to Danny and gives him a thumbs up.\n\n\tINT.  DANNY'S PLANE - DAY\n\n\tDanny calls back to his GUNNER, who is watching the fuel\n\tsupply.\n\n\t\t\t\t\tDANNY\n\t\t\tWe got a 25-mile-an-hour head wind.  How\n\t\t\twe doing with fuel?\n\n\t\t\t\t\tGUNNER\n\t\t\tHow do you think?\n\n\tThe gunner is already pouring gas into the tanks from the\n\textra cans.\n\n\tAnthony stands and moves back to the rear of the plane, pulls\n\ta piece of chalk from his pocket and writes on the nose of\n\tthe bombs -- \"For America,\"  \"For Pearl Harbor,\"  \"For the\n\tArizona,\"  \"For Billy.\"\n\n\t-- Rafe flies, lost in thought...\n\n\t-- Evelyn is back at Pearl, struggling to keep her mind on\n\t   her work.\n\n\t-- Danny is looking at his gauges, then at the picture in\n\t   his shirt.\n\n\tEXT.  TOKYO - VARIOUS SHOTS - DAY\n\n\tIt's a pleasant day, and the people of Tokyo are in a\n\tconfident, happy mood.  They're shopping, smiling, enjoying\n\tbeautiful spring weather.  The Emperor is on the garden of\n\this palace having lunch.\n\n\tEXT.  SKIMMING OVER THE WAVES - DAY\n\n\tThe American planes are coming.\n\n\tINT.  DOOLITTLE'S PLANE - DAY\n\n\tHe and his navigator confer.\n\n\t\t\t\t\tDOOLITTLE'S NAVIGATOR\n\t\t\tTime for the others to break off.\n\n\tHis copilot uses the flashes to signal the other planes.\n\tThey break off for their individual targets, every plane now\n\ton it's own.\n\n\tINT.  JAPANESE AIR DEFENSE STATION - DAY\n\n\tThis is the nerve center of Tokyo's defense.  An OFFICER\n\treceives a message and reports to his supervisor.\n\n\t\t\t\t\tJAPANESE DEFENSE OFFICER\n\t\t\tCoastal stations report a low flying\n\t\t\tplane coming in off the sea.\n\n\t\t\t\t\tSUPERVISOR\n\t\t\tFrom the sea?... That couldn't be right,\n\t\t\tit must be part of the air raid practice\n\t\t\tthis morning.\n\n\tEXT.  SKIMMING OVER THE WAVES - DAY\n\n\tThe planes reach the Japanese coastline, and start skimming\n\tover treetop level.\n\n\tEXT.  TOKYO - DAY\n\n\tThe office of an anti-aircraft battery blows its whistle; his\n\tcrew mount their guns and swerves them around.  The officer\n\twhistle's again and checks his watch.\n\n\t\t\t\t\tANTI-AIRCRAFT OFFICER\n\t\t\tNot bad.\n\n\tThe crew dismount their guns; just a drill.\n\n\tEXT.  TOKYO - VARIOUS SHOTS - DAY\n\n\tThe Japanese people are unaware of the drill.  People are\n\tbrowsing through open-air shops, where new radios are turned\n\ton, playing music.  And Tokyo Rose is talking -- in English\n\tand Japanese.\n\n\t\t\t\t\tTOKYO ROSE (ON THE RADIO)\n\t\t\tIt is another beautiful day in Tokyo, as\n\t\t\tall of Japan basks in a new day of\n\t\t\tvictory.\n\n\tINT.  THE PLANES - DAY\n\n\tComa, Danny's navigator, picks this up.\n\n\t\t\t\t\tCOMA\n\t\t\tListen to this -- it's Tokyo Rose.\n\n\t\t\t\t\tTOKYO ROSE (ON THE RADIO)\n\t\t\tOur brave sailors and soldiers, inspired\n\t\t\tby our divine Emperor, have pushed the\n\t\t\tAmericans from the Pacific.\n\n\tThese words go through the plane; and in the other planes\n\tthey hear it too.\n\n\t\t\t\t\tTOKYO ROSE (ON THE RADIO)\n\t\t\tBut hiding at home will not save them.\n\t\t\tEach time the Americans have tasted the\n\t\t\tsamurai spirit, they have learned the\n\t\t\tbitter taste of defeat, while Japan is\n\t\t\tembraced by the divine wind that has\n\t\t\tprotected our island for seven centuries.\n\n\tEXT.  TOKYO - DAY\n\n\tThe planes reach Tokyo, and flash across the rooftops.\n\n\tINT.  DANNY'S PLANE - DAY\n\n\t\t\t\t\tANTHONY\n\t\t\tWe'll give that bitch something to\n\t\t\tannounce.\n\n\tDanny and Rafe give each other a wave, and divert toward\n\ttheir separate targets.  Each plane is on its own now.\n\n\tEXT.  TOKYO - DAY\n\n\tDoolittle's plane flashes right over the Emperor's palace.\n\tThe Emperor sits in the garden, meditating.\n\n\tEXT.  TOKYO - VARIOUS SHOTS - DAY\n\n\tMothers walking their children see the planes flash by\n\toverhead, and like the people at Pearl, they think they are\n\tfriendlies.  A toddler points up and smiles.  His mother\n\tpicks him up and hugs him happily.\n\n\t\t\t\t\tJAPANESE MOTHER\n\t\t\tYes!  So beautiful!\n\n\tINT.  THE PLANES - DAY\n\n\tRafe's bombardier works his 20-cent bombsight, as Rafe holds\n\tthe plane steady, bringing it up to 200 feet.\n\n\tThey scan for fighter or anti-aircraft fire.  There isn't\n\tany.\n\n\t\t\t\t\tRAFE\n\t\t\tOpen bomb bay doors.\n\n\tDANNY'S PLANE runs toward its target...\n\n\tDOOLITTLE'S PLANE races over Tokyo...\n\n\t\t\t\t\tGUNNER\n\t\t\tBomb bay doors open, sir.\n\n\t\t\t\t\tRAFE\n\t\t\tIt's all yours.\n\n\tThe bombardier hits the first switch.  The bomb falls toward\n\ta factory.\n\n\tIt strikes home, right on target.  The blast is shocking --\n\tit blows debris higher than the plane.\n\n\tEXT.  TOKYO - THE BOMBING - VARIOUS SHOTS\n\n\tThe individual planes drop their bombs, four per plane, on\n\tshipyards, factories, oil supplies, weapons facilities.\n\tTheir bombing is highly accurate.\n\n\tOn the ground, at the open-air market, for a brief moment\n\tRadio Tokyo goes silent; then --\n\n\t\t\t\t\tTOKYO ROSE (ON THE RADIO)\n\t\t\tWe interrupt this broadcast... Tokyo is\n\t\t\tbeing bombed!\n\n\tEXT.  THE EMPEROR'S PALACE - DAY\n\n\tThe Emperor looks up at the sound of air raid sirens and\n\tdistant explosions.\n\n\t\t\t\t\tEMPEROR'S ATTENDANT\n\t\t\tSurely just a drill, Divine One.\n\n\tINT.  RAFE'S PLANE - DAY\n\n\t\t\t\t\tNAVIGATOR\n\t\t\tLast bomb away.\n\n\tIt slams into a factory, blowing debris everywhere and\n\tturning the factory into an inferno.\n\n\tRafe's tail gunner sees Zeros swarming in with vengeance.\n\n\t\t\t\t\tGUNNER\n\t\t\tWe got Zeros!  And they're pissed off!\n\n\tRafe changes course quickly.\n\n\tINT.  DANNY'S PLANE - DAY\n\n\tAnti-aircraft FLAK bursts in the sky in front of them; Danny\n\ttakes evasive action.\n\n\tINT.  RAFE'S PLANE - ABOVE TOKYO - DAY\n\n\tRafe pushes the engines to top speed and changes course\n\tagain; but the B-25's can't outrun the Zeros.  Their fire\n\tchews into the bomber's tail, hitting the gunner.  Red\n\tscrambles back to find the gunner dead.\n\n\t\t\t\t\tRAFE\n\t\t\tCan you get 'em off us?\n\n\tRed reacting to bullets coming through the rear of the\n\tfuselage, looks at the brooms protruding from the rear of the\n\tplane.\n\n\t\t\t\t\tRED\n\t\t\tWhatta ya want me to do, sweep 'em!\n\n\tAs the bombardier, navigator, and Red jump onto the other\n\tmachine guns, Rafe looks for a way out.  He dives down toward\n\tthe city.  The Zeros follow.\n\n\tEXT.  SKIES OVER TOKYO - DAY\n\n\tRafe takes the B-25 right down among the buildings, sometimes\n\teven having to spin the wings to get through.  The Zeros\n\tcan't keep up with this...\n\n\tBut Rafe can't keep it up long, either; they break out into\n\topen ground rail yards, where there's no place for him to\n\thide...\n\n\tThe Zeros come in to chew him up...\n\n\tBut they take fire from another B-25 -- Danny's -- coming in\n\tto save Rafe's plane.  Rafe now uses the radio.\n\n\t\t\t\t\tRAFE\n\t\t\tDanny, get the hell out of here!\n\n\tBut Danny stays, mixing it up with the Zeros; with both\n\tB-25's together, their machine guns down one Zero and damage\n\tanother.  But there are too many.\n\n\tRafe sees clouds coming in, and fog.\n\n\t\t\t\t\tRAFE\n\t\t\tDanny, run for the clouds!\n\n\tThe bombers race toward the clouds, and make it; the Zeros\n\tlose them.\n\n\tEXT.  SKIES - BROKEN CLOUDS - DAY\n\n\tRafe and Danny keep broken contact through the clouds, and\n\tsettle in for the long run to China.\n\n\tINT.  RAFE'S COCKPIT - DAY\n\n\t\t\t\t\tRAFE\n\t\t\tWe burned a lot of fuel back there.\n\t\t\tFlash them and ask about their supply.\n\n\tINT.  DANNY'S PLANE - DAY\n\n\tAnthony reads the Morse code.\n\n\t\t\t\t\tANTHONY\n\t\t\t\"How's your fuel?\"\n\n\tDanny looks across to Rafe and shakes his head.\n\n\tINT.  ROOSEVELT'S RESIDENCE - HYDE PARK, NY - DAY\n\n\tRoosevelt is at his desk when General Marshall enters.\n\n\t\t\t\t\tGENERAL MARSHALL\n\t\t\tWe have bombed Tokyo, Mr. President.\n\t\t\tRadio Tokyo interrupted it's own\n\t\t\tbroadcast to make the announcement.\n\n\t\t\t\t\tROOSEVELT\n\t\t\tHave the planes made it to China?\n\n\t\t\t\t\tGENERAL MARSHALL\n\t\t\tThere've been some complications, Sir.\n\t\t\tThe Chinese didn't receive our request\n\t\t\tfor homing beacons until is was too late\n\t\t\tto get them set.  And the planes had to\n\t\t\ttake off so early they may lack fuel to\n\t\t\tmake the mainland anyway.\n\n\t\t\t\t\tROOSEVELT\n\t\t\tSo those brave men are flying blind and\n\t\t\trunning out of fuel.\n\n\t\t\t\t\tGENERAL MARSHALL\n\t\t\tThe Chinese are sending out search\n\t\t\tparties to try to find the crews before\n\t\t\tthe Jap patrols do, if any of the planes\n\t\t\tmake it.\n\n\t\t\t\t\tROOSEVELT\n\t\t\tGod help them.\n\n\tEXT.  SEA OF JAPAN - DUSK\n\n\tThey've climbed above the clouds; the fliers are exhausted.\n\n\tThe sun is beginning to set.  Rafe stares at it...\n\n\tINT.  HOSPITAL - PEARL HARBOR - DUSK\n\n\tThe place is white again -- the white of bandages and casts.\n\tEveryone is busy, and even the wounded are looking out for\n\teach other; a man with his arms in an airplane splint holds a\n\tspoon and feeds a badly burned buddy.  Evelyn and her\n\toverworked nurses are looking after the critical cases.  But\n\tas she covers the windows with blackout curtains, she stops\n\tfor just a moment to stare at the sun's last rays.\n\n\tEXT.  SKIES OVER PACIFIC - NIGHT\n\n\tColonel Doolittle can make out mountains below them.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tWe'll fly till we run out of fuel, then\n\t\t\tbail out.\n\n\tJust then his engines start to sputter.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tChute!\n\n\tHe puts the plane on auto-pilot and the men move to the\n\thatches.  Three guys go out; it's just Doolittle and his\n\tcopilot left.\n\n\t\t\t\t\tDOOLITTLE\n\t\t\tNobody else is gonna make it either.  If\n\t\t\tI live through this, they're gonna put me\n\t\t\tin Leavenworth Prison.\n\n\tThey jump.\n\n\tINT.  DANNY'S PLANE - NIGHT\n\n\tComa moves up to Danny.\n\n\t\t\t\t\tCOMA\n\t\t\tWe're running out of fuel.  And I can't\n\t\t\tfind the beacon.\n\n\tDanny gestures across to Rafe that he hears nothing in his\n\tradio phones.  Rafe gestures the same thing back.\n\n\tThey look down and the entire ground is covered with clouds.\n\n\t\t\t\t\tRAFE\n\t\t\tI don't know if we're over sea or land.\n\t\t\tDrop flares and try to spot something.\n\n\tEXT.  SKIES OVER PACIFIC - NIGHT\n\n\tThey drop flares; they disappear into the cloud cover and\n\ttell them nothing.\n\n\tEXT.  SKIES - RAFE AND DANNY'S PLANE - NIGHT\n\n\tDanny's engines are sputtering; his gunner pours the last\n\tdrops of gas into the tanks.\n\n\t\t\t\t\tDANNY\n\t\t\tFlash Rafe.  We're gonna bail.\n\n\tRed sees Anthony signal.\n\n\t\t\t\t\tRED\n\t\t\tThey've gotta jump.\n\n\t\t\t\t\tRAFE\n\t\t\tNot unless we know he's over land!\n\n\tRafe yells at Danny, as if he could hear --\n\n\t\t\t\t\tRAFE\n\t\t\tYou are not bailing out into water!\n\n\t\t\t\t\tRAFE'S NAVIGATOR\n\t\t\tCoastline below!\n\n\tThrough a break in the clouds they spot a rocky shoreline.\n\n\t\t\t\t\tRAFE\n\t\t\tWe've got coast!  Signal him to climb and\n\t\t\tjump.\n\n\tRed signals; Danny's plane signals back.\n\n\t\t\t\t\tRED\n\t\t\tThey don't have fuel to make altitude.\n\t\t\tHe's gonna set it down in the water.\n\n\tRafe looks over at Danny, who is gesturing; he gives up on\n\tthe hand signals and grabs the flasher; Red reads the Morse\n\tcode...\n\n\t\t\t\t\tRED\n\t\t\tY-O-U... G-O.  You go on.\n\n\tRafe grabs the flasher and angrily flashes back two letters.\n\n\t\t\t\t\tRAFE\n\t\t\tN-O!  We stay together!  I'll go in\n\t\t\tfirst.\n\n\tRafe turns his bomber and Danny follows, their planes arcing\n\tdown toward the rocky coast; it's hairy, the clouds masking\n\ttheir view, as the altimeter winds down... At the last moment\n\tthey see rocks looming out of the surf.\n\n\tINT.  RAFE'S PLANE - NIGHT\n\n\tHe's shouting to his crew --\n\n\t\t\t\t\tRAFE\n\t\t\tHang on tight!  I'll put her in the\n\t\t\tsmooth water and we'll swim in!\n\n\tINT.  DANNY'S PLANE - NIGHT\n\n\tHis engines are sputtering, catching, sputtering; he fights\n\tto stay in control.\n\n\tEXT.  CHINA COAST - NIGHT\n\n\tRafe's plane settles down toward the water; he guns the\n\tengine to level out, and the plane skims across the surface;\n\tthen the propellers catch and the plane stops like it hit a\n\twall, flipping over it's nose.\n\n\tDANNY'S PLANE is struggling; when he tries to add throttle,\n\tthe engines sputter out.  The plane drops, skips once on the\n\tsurface, then hits a shoreline rock belly first.\n\n\tDanny and Anthony are ejected through the top of the\n\tfuselage; Coma is hurled forward right through the glass nose\n\tof the plane.\n\n\tINT.  RAFE'S PLANE - NIGHT\n\n\tRafe and Red come to in the plane inverted and sinking.  They\n\treact, unbuckling, grabbing for their crewmates as the plane\n\tis quickly filling.  The navigator and gunner are\n\tunconscious; the bombardier is dead.  Red struggles with the\n\thatch and can't make it budge.\n\n\t\t\t\t\tRAFE\n\t\t\tIt won't open til the plane fills!\n\n\tThey struggle to breath as the water envelops them.  But as\n\tthe water reaches the top, Rafe takes a last breath and dives\n\tto the hatch; it comes open, and they swim up, dragging the\n\trest of the crew.\n\n\tEXT.  CHINA COAST - NIGHT\n\n\tThey break the surface, and struggle to shore with the\n\tunconscious navigator and gunner.\n\n\tRafe's looking everywhere; he sees Danny's plane crashed\n\tagainst the rock.  He fights his way through the surf to\n\tDanny's plane, Red following.\n\n\tRafe finds Danny face up in the water.\n\n\tRed finds Anthony on the rock.  He's face up, but as Red\n\tlifts him he finds the back of Anthony's head is gone.\n\n\tThe rest of Danny's crew are floating in the surf, dead.\n\tRafe and Red pull Danny to shore.\n\n\t\t\t\t\tRAFE\n\t\t\tDanny!  DANNY!\n\n\tDanny's eyes flutter open; he sees Rafe and mumbles --\n\n\t\t\t\t\tDANNY\n\t\t\tI've made better landings.\n\n\tDanny's hand gropes to his throat; Rafe finds a V shaped\n\tshard of the fuselage hooked into his neck.\n\n\tRafe grabs it, trying to bend it open; the sharp metal cuts\n\this hands, but he keeps straining.  It won't work, He pulls\n\this .45 from his jacket and tries to pry the metal.  It works\n\ta bit; he tosses the pistol aside and grabs the shard again,\n\tand opens it.\n\n\t\t\t\t\tRAFE\n\t\t\tYou hang on, Danny!  You hang on!  You're\n\t\t\tgonna make it!\n\n\tRafe's head snaps forward, crunched with the butt of a rifle;\n\ta Japanese patrol, four men, have arrived.  They're angry,\n\tscared, hyped.  They knock Red down too, yelling and\n\tbrandishing their rifles at the fliers on the beach, living\n\tand dead.\n\n\tThe Japanese officer is barking orders.  They find the\n\tCaptain's insignia on Danny's jacket, and begin binding him\n\tto a yoke, his wrists tied to the wood like a crucifixion, a\n\twire around his neck.  They find the navigator unconscious,\n\tbut alive.  The officer snaps a single word and a soldier\n\tshoots the navigator.\n\n\tThe others wire Rafe's ankles together... Rafe is\n\temotionless.\n\n\tRAFE'S CONSCIOUSNESS fades in and out.  He hears Danny\n\tchoking, and his mind sees Danny as a boy those long years\n\tago, being carried by the neck across the field by his\n\tfather...\n\n\tThen Rafe sees THE PRESENT:  Danny being half-carried, half-\n\tdragged by the neck by two Japanese.  The officer is pulling\n\tRed along, hands bound behind him.  And Rafe starts moving,\n\tbeing dragged on his back, pulled by his feet along the rocky\n\tsand.\n\n\tHis hand slides by the pistol he tossed behind the rock.\n\n\tThe whole world slows down.\n\n\tHe clutches it, shoots one of the men towing Danny.  And as\n\tthe man dragging Rafe turns around, Rafe shoots him in the\n\tface.\n\n\tThe officer spins, raising his rifle; the soldier pulling\n\tRed, shoves him onto his face in the sand and aims his rifle\n\ttoo.  The officer is pulling the trigger to kill Rafe when\n\tDanny slams him down from behind.\n\n\tThe fourth soldier shoots Danny in the gut, then takes aim\n\tfor Rafe's heart -- and is shot through the chest from\n\tbehind.\n\n\tThe Japanese officers rises in surprise and is cut down by\n\tscythes carried by the Chinese peasant soldiers who are just\n\tarriving.\n\n\tRafe struggles to Danny, moving the Chinese aside.  Danny\n\tlies on his back, clutching his wound as if to hold onto his\n\tlife.\n\n\t\t\t\t\tRAFE\n\t\t\tDanny...\n\n\t\t\t\t\tDANNY\n\t\t\tI can't make it.\n\n\t\t\t\t\tRAFE\n\t\t\tYes you can.\n\n\tBut Danny is silent, his eyes drifting shut, and in that\n\tmoment Rafe thinks he is gone already.  Then Danny's eyes\n\tdrift open, finding him.\n\n\t\t\t\t\tDANNY\n\t\t\tTake care of Evelyn.\n\n\tThe words almost kill Rafe, filling him with grief.  From\n\tsomewhere he finds the strength to say --\n\n\t\t\t\t\tRAFE\n\t\t\tI will.  And your baby.\n\t\t\t\t(beat)\n\t\t\tYou're gonna be a father.\n\n\tDid Danny hear?  His eyes are closed again.  But his head\n\tcomes up; Rafe takes it, and Danny pulls him closer to\n\twhisper --\n\n\t\t\t\t\tDANNY\n\t\t\tNo.  You are.\n\n\tRafe cradles Danny in his arms.  Danny's eyes are open, but\n\tRafe sees no light there.\n\n\t\t\t\t\tRAFE\n\t\t\tDanny... Land of the free... Land of the\n\t\t\tfree...\n\n\tBut Danny will never answer him again.  Rafe hugs Danny\n\ttight, and weeps.\n\n\tEXT.  VARIOUS SHOTS - DAY\n\n\tThe news of the raid hits Washington...and the rest of\n\tAmerica.  If it isn't wild celebration; when people see the\n\theadline:  AIR RAID ON TOKYO, and DOOLITTLE DOES MUCH; their\n\tfaces change, as if finally told what they already knew --\n\tthat America would prevail.\n\n\t\t\t\t\tVOICE OVER\n\t\t\tThe Doolittle Raid was the pivotal moment\n\t\t\tof America's war with Japan.  Before it,\n\t\t\tAmerica knew nothing but defeat; after\n\t\t\tit, nothing but victory.\n\t\t\t\t(beat)\n\t\t\tOne crew of Doolittle's raiders made it to\n\t\t\tVladivostok, Russia, where they were\n\t\t\tinterred for much of the war.  Thirteen\n\t\t\tplanes crash landed in China, where the\n\t\t\tChinese people helped the Americans\n\t\t\tescape, and had their villages destroyed\n\t\t\tand citizens executed by the Japanese\n\t\t\tforces of occupation.  Two crews were\n\t\t\tcaptured by the Japanese and three fliers\n\t\t\twere executed without trial, called \"war\n\t\t\tcriminals\" by the Japanese.  Jimmy\n\t\t\tDoolittle was promoted to General, and\n\t\t\tgiven the medal of honor.\n\n\tWe see the ceremony at the White House, as Roosevelt presents\n\tDoolittle with the metal.\n\n\tEXT.  TENNESSEE - DAY\n\n\tOut by the crop dusting landing field is a memorial to Danny\n\tWalker, with an American flag flying high above it.  Standing\n\tat the memorial are Rafe and Evelyn.  Rafe holds a child in\n\this arms, a boy, named Danny.\n\n\t\t\t\t\t\t\t\tFADE OUT.\n\n\t\t\t\t\tTHE END\n\n\n\n\n\n\n\nPearl Harbor\nWriters :   Randall Wallace\nGenres :   Action  Drama  Romance  War\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:32:47.549207"}