{"title": "Pet Sematary II", "film_link": "/Movie Scripts/Pet Sematary II Script.html", "script_link": "/scripts/Pet-Sematary-II.html", "info_raw": "\n\nPet Sematary II Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Richard Outten  David S. Goyer\nGenres  Horror\nScript Date : January 1991\n\nRead \"Pet Sematary II\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nPET SEMATARY II\n\n\n\n\n\n\n\t\t\tPET SEMATARY II\n\n\tAn Original screenplay by Richard Outten\n\n\t\tRevised by David S. Goyer\n\n\n\nBased upon characters created by Stephen King \n\n\n\n\nTHIRD DRAFT\n\nRevised 1/6/91\n\n\n\n\n\"PET SEMATARY II\"\n\n\nFADE IN:\n\nINT.  LEMARCHE CASTLE, TOMB - NIGHT (1865)\n\nA storm is raging outside. We hear the clap and roll of THUNDER.\n\nTOMB STAIRWAY -\n\nRATS scurry away down the scum-covered steps as the GLOW OF A \nLANTERN and FOOTSTEPS herald someone's arrival...\n\nGENVIEVE LEMARCHE\n\nemerges around the bend. Mid-30s. Cultured beauty. Her dress and \nface are smeared with grime and... is that blood we see too? God \nonly knows what's happened to her.\n\nGenvieve ducks under a monstrous cobweb as she passes an open \nwindow.\n\nWINDOW\n\nLIGHTNING streaks across the night sky outside. We catch a glimpse \nof the MOON disappearing behind the clouds.\n\nGenvieve reaches the bottom of the stairs. The tomb itself.\n\nWater trickles in through cracks in the lichen-covered walls, \npooling on the tomb floor.\n\nGenvieve moves forward, her lantern throwing distorted shadows \nover everything...\n\nIn front of her is Anton LeMarche's stone sarcophagus.\nGenvieve kneels in the water, one hand resting on the spiked iron \nrailing which surrounds the tomb. She reaches the other hand \ntowards a scum-covered plaque, brushing the grime away...\n\nTHUNDER and LIGHTNING reach a crescendo as...\n\nA SKELETAL HAND rises out of the water, reaching for her.\n\nGenvieve SCREAMS. The lantern falls from her grasp, sputtering \nout. The hand reaches for her arm and inadvertently clutches her \nbreast instead...\n\nGenvieve starts to laugh hysterically.\n\n\t\t\t\tDIRECTOR (O.S.)\n\t\t\t(exasperated)\n\t\tCut! Thank you, Renee. Can we\n\t\tthrow some light on the set?\n\n\t\t\t\tGENVIEVE\n\t\tI'm sorry...\n\nSuddenly it is lighter. Genvieve can't stop laughing. The groping \nmonster hand disappears back beneath the water.\n\nWE PULL BACK, REVEALING -\n\nIt's not 1865. The LeMarche Castle tomb is in fact, a 90s movie \nset. We are inside a soundstage, on a raised set, so the slugline \nshould really read...\n\nINT.  SOUNDSTAGE, LEMARCHE CASTLE TOMB SET -\n\nA FILM CREW scurries about. Everyone is LAUGHING now. The DIRECTOR \nsits to the right. He and the DP are already huddled over the \nvideo-assist monitor. We see the previous scene rewinding at high-\nspeed.\n\nThe FIRST A.D. moves in.\n\n\t\t\t\tFIRST A.D.\n\t\tWater in the pool's running low,\n\t\tfill her up!\n\nCrewmembers move towards the set.\n\nAn SFX PUPPETEER (i.e., the skeletal arm) crawls out from under, \nfollowed by an ELECTRICIAN.\n\n\t\t\t\tPUPPETEER\n\t\tI can't see shit down there! I'm\n\t\tworking blind!\n\nGENVIEVE/THE ACTRESS\n\nrises out of the water. Her name is actually RENEE HALLOW and her \nbeauty is undeniable, even in such a disheveled state.\n\n\t\t\t\tRENEE\n\t\tThis is great, I could've spent\n\t\tfour months on a romantic comedy\n\t\twith Warren Beatty, and instead,\n\t\tI've got a horny zombie trying to\n\t\tcop a feel!\n\nThe crew members LAUGH. She's well-liked on the set. Renee grins. \nWardrobe and make-up personnel move in to adjust Renee's \nappearance.\n\n\t\t\t\tRENEE\n\t\tUhgh, there's water everywhere...\n\t\t\t(beat)\n\t\tCan I get a cigarette?\n\nThe MAKE-UP GIRL pulls a pack of cigarettes from her fanny-pack \nand offers Renee one. In a flash, a P.A. appears with a lighter. \nRenee mumbles \"thanks\" as she fires up. She squints her eyes, \ntrying to see past the set lights.\n\n\t\t\t\tRENEE\n\t\t\t(calling out)\n\t\tGeoff?\n\t\t\t(beat)\n\t\tAnybody see my boy?\n\n\t\t\t\tGEOFF (O.S.)\n\t\tRight here, Mom...\n\nGEOFF MATTHEWS, Renee's 12 year-old son steps into view. Renee's \nface lights up when she sees him.\n\n\t\t\t\tRENEE\n\t\tHow long have you been here?\n\n\t\t\t\tGEOFF\n\t\tCouple minutes. I saw the last\n\t\tshot. That was pretty cool.\n\nRenee grimaces as the make-up girl spritzes her face with a spray-\nbottle.\n\n\t\t\t\tRENEE\n\t\t\t(casually)\n\t\tHow did it go with your father\n\t\tlast night?\n\n\t\t\t\tGEOFF\n\t\tGood. He said he'd be over for\n\t\tdinner at eight...\n\t\t\t(awkward)\n\t\tI mean... he misses you, Mom...\n\n\t\t\t\tRENEE\n\t\tI miss him too...\n\n\t\t\t\tRENEE\n\t\t\t(continuing)\n\t\tI just don't want you to get your\n\t\thopes up, okay? We're trying to\n\t\twork things out, but...\n\nHer voice trails off.\n\n\t\t\t\tGEOFF\n\t\tI know, Mom.\n\n\t\t\t\tRENEE\n\t\t\t(affectionate)\n\t\tYou know everything, don't you?\n\nRenee and Geoff are interrupted by a CREWMEMBER who's spraying \n\"atmosphere\" about the set with a hand-held smoke machine. Renee \ncoughs.\n\nOff-set, the FIRST A.D. is trying to get the show on the road.\n\n\t\t\t\tFIRST A.D.\n\t\tOkay, people! Quiet! We're going\n\t\tto try this another time!\n\n\t\t\t\tGEOFF\n\t\tGuess it's showtime.\n\n\t\t\t\tRENEE\n\t\tYep.\n\nRenee kisses Geoff on the forehead. He takes the cigarette from \nher and moves off the set, standing near the camera.\n\nThe director turns back toward Renee.\n\n\t\t\t\tDIRECTOR\n\t\tAlright, Renee. Last time. I\n\t\tpromise. We nail this and you\n\t\twon't have to do this ever again.\n\n\t\t\t\tRENEE\n\t\tThat's what you said the first\n\t\ttime...\n\nRenee turns and heads back toward the stairs. A P.A. hands her a \nnew lantern. As she reaches the stairs, the house lights dim, \ncreating the proper atmosphere once again.\n\nUNDER THE SET -\n\nThe puppeteer gets ready. It's cramped. The electrician checks a \npower box connection.\n\nThe director nods to the camera operator.\n\n\t\t\t\tOPERATOR\n\t\tRolling. Speed...\n\n\t\t\t\tSLATE BOY\n\t\t\"Castle of Terror.\" Scene 69A.\n\t\tTake thirteen.\n\nThe slate comes down.\n\n\t\t\t\tDIRECTOR\n\t\tAction!\n\nThe scene replays itself as before, only now we're watching the \naction from multiple viewpoints.\n\nWe start on the video assist monitor, then move up to...\n\nGEOFF\n\nHe grins as he watches the scene unfold.\n\nON THE SET\n\nRenee has reached the sarcophagus. LIGHTNING flashes. The skeleton \nhand bursts up, grabbing Renee's arm. The scene continues past the \noriginal point of interruption.\n\nUNDER THE SET -\n\nWe see an undetected LEAK. Water drips down. The puppeteer shifts \nposition, struggling, and...\n\n...knocks over the power box which SPARKS just as...\n\nABOVE -\n\nRenee/Genvieve grabs the iron railing with both hands.\n\nElectricity surges through Renee. Her body jerks and writhes like \nsome nightmarish marionette.\n\nUNDER THE SET -\n\nThe electrician drags the puppeteer back. Sparks fly.\n\n\t\t\t\tELECTRICIAN\n\t\tJesus! We've crossed over into\n\t\t220! Shut down the generator!\n\nABOVE -\n\nCrewmembers SCREAM and scramble back...\n\nAll the circuits are blowing, lights EXPLODING and showering \nsparks over the whole set. This is not part of the movie.\n\nRENEE\n\nIt's awful. She shakes, her SMOKING HANDS frozen to the iron \nrailing by the electricity running through her...\n\nSuddenly, Renee falls forward against the iron. Her face begins to \nSMOKE AND SINGE...\n\nThe lights CONTINUE TO BLOW, casting a strobic effect over the \nsoundstage, adding to the chaos.\n\nON GEOFF\n\nAs he witnesses the whole event. He tries to rush forward, but \nsomeone restrains him...\n\n\t\t\t\tGEOFF\n\t\tMom!!!!\n\nSuddenly all the circuits in the stage are blown and the LIGHTS GO \nOUT. Renee slumps back into the water, smoke trailing up from her \nstill form. And we...\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nOMITTED (SCENES 2 THRU 2J)\n\nINT.  OPERATING ROOM - DAY\n\nAn aged GOLDEN RETRIEVER is on the surgical table. CHASE MATTHEWS, \nD.V.M., gently strokes the dog's fur. He's good with the dog. He's \nkind. The retriever's owners: a MOTHER and her SON, look on.\n\n\t\t\t\tCHASE\n\t\tI think this is probably for the\n\t\tbest. He's a very old dog. He\n\t\thas arthritis. He has cataracts\n\t\tin his eyes...\n\nChase looks at the mother. He's always hated this part.\n\n\t\t\t\tCHASE\n\t\tHe's had a good life...\n\t\t\t(to dog)\n\t\t...haven't you, boy?\n\n\t\t\t\tINTERCOM\n\t\tDoctor Matthews, your son is on\n\t\tline one. He says it's an\n\t\temergency...\n\nChase breaks concentration, pulling his eyes away from the mother \nand son.\n\nINT.  SOUNDSTAGE, LEMARCHE CASTLE TOMB SET -\n\nA blur of activity converges on the movie set. A TRIO OF \nPARAMEDICS. A FIRE OFFICIAL. A POLICE OFFICER. Medical equipment. \nHorrified crewmembers watch on, helpless.\n\nWE STAY ON Geoff, momentarily blocked out and then revealed again \nand again, amidst the commotion of paramedics scrambling to save \nRenee. The director has his hand on Geoff's shoulder.\n\nGeoff's eyes dart about, taking it all in. Things are happening \nvery fast:\n\n--Renee's hand is lifted. Someone checking her pulse. --Her \neyelids parted. A pen light flashing at her fixed pupils.\n\n\t\t\t\tPARAMEDIC #1 (O.S.)\n\t\tRun me down a line of normal\n\t\tsaline.\n\n--An I.V. needle plunges into the inside of Renee's elbow. --A \nsyringe injects into the I.V. post.\n\n--Hands hook up a life-pack monitor. Renee's dress is torn away. \nElectrodes press to bare skin. --The monitor screen blinks to \nlife.\n\n\t\t\t\tPARAMEDIC (O.S.)\n\t\tWe have a bradycardic rhythm at\n\t\t30.\n\n--Another PARAMEDIC dials out on a cellular phone, to the \nconsulting physician.\n\n\t\t\t\tPARAMEDIC #3 (O.S.)\n\t\tWhite female. Approximately\n\t\tthirty five years old.\n\t\tElectrocution...\n\n--A clear tube is inserted down her throat. --The monitor shows \nerratic heartbeat.\n\n\t\t\t\tPARAMEDIC #2 (O.S.)\n\t\tShe's in V-fib.\n\n--There's a renewed urgency even amidst their rush.\n\n--Defibrillator paddles are pressed to her chest.\n\nGeoff looks to the monitor as...\n\n--It goes to flatline.\n\n\t\t\t\tPARAMEDIC (O.S.)\n\t\tClear.\n\n\t\t\t\tGEOFF\n\t\tNo...\n\nGeoff moves forward, pulling away from the director. The police \nofficer moves in and intercepts Geoff, turning the boy away.\n\nGeoff's eyes fix on the monitor. An unbending flatline...\n\n\t\t\t\tGEOFF\n\t\tYou have to bring her back...\n\nChase rushes onto the set, pushing past crewmembers. He freezes at \nthe sight of the horrific commotion around Renee's still form.\n\n\t\t\t\tCHASE\n\t\tOh Jesus...\n\nChase's gaze connects with his son.\n\n\t\t\t\tGEOFF\n\t\t\t(helpless)\n\t\tDad...\n\nWe pull back from Geoff, Chase, and the commotion around Renee. \nFarther and farther as the darkness around the set begins to close \nin...\n\n\t\t\t\tPARAMEDIC #1 (O.S.)\n\t\t\t(urgent)\n\t\tWe're losing her...\n\nDarkness everywhere and we\n\n5    OMITTED\nTHRU\n9G   OMITTED\n\nEXT.  A DREAMLIKE FOG\n\nA form drifts forward, materializing out of the fog.\n\nIt's a CASKET. Appearing as if it's floating among the clouds. \nPULLING BACK, WE SEE that it's moving along A CONVEYOR. AND NOW, \nWE CAN make out the faint form of A PLANE as the conveyor descends \nfrom the cargo compartment.\n\nThe casket reaches the end of the conveyor. A tag marks its final \ndestination: Bangor, Maine. HANDS reach in and lift the casket. \nFOUR BAGGAGE HANDLERS hoist the casket up onto their shoulders and \ncarry it off.\n\n\t\t\t\tHANDLER #1\n\t\tIs it true she grew up around\n\t\there?\n\n\t\t\t\tHANDLER #2\n\t\tYeah. Over in Ludlow.\n\n\t\t\t\tHANDLER #1\n\t\tHuh. Never met a movie star\n\t\tbefore.\n\n\t\t\t\tHANDLER #3\n\t\tWell you're a little late for an\n\t\tautograph.\n\nThe baggage handlers laugh as they walk off into the distance. The \nfog closes around them and we...\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT.  PLEASANTVILLE CEMETERY - DAY\n\nWe drift down from the gray sky to the somber scene below. Off in \nthe distance, a crowd of MOURNERS are gathered around a grave.\n\n\t\t\t\tPRIEST (V.O.)\n\t\t...I am the resurrection and the\n\t\tlife, saith the Lord...\n\nCLOSER -\n\nTHE HEADSTONE is adorned with an iron plaque. It reads, simply:\n\n\t\t\tRENEE HALLOW MATTHEWS\n\t\t\t\t1955-1991\n\n\t\t\t\tPRIEST (V.O.)\n\t\t...She that believeth in me,\n\t\tthough she were dead, yet shall\n\t\tshe live; and whosoever liveth and\n\t\tbelieveth in me, shall never\n\t\tdie...\n\nTHE CASKET is slowly lowered into the open grave. As it descends, \nWE SEE Geoff and his father, Chase, standing at the forefront of \nthe crowd. Renee's grave is next to those of her parents.\n\nAmong the mourners is MARJORIE HARGROVE, an attractive local girl \nin her early twenties.\n\nFurther down the hillside, a wall of NEWS REPORTERS are gathered \nbehind a roped-off media boundary. There is a blinding flurry of \nPHOTO FLASHES as the press records the scene before them.\n\nA SHERIFF'S DEPARTMENT PATROL CAR cruises up the cemetery drive, \npulling to a stop near the mob of reporters.\n\nOut of the car steps GUS GILBERT. Gus is nearly forty, with a \nSheriff's uniform fitted to his solid, ageless frame. Gruff, maybe \na little self-important: Gus likes being a big fish in a small \npond.\n\n\t\t\t\tGUS\n\t\t\t(drawing near)\n\t\tLet's keep it back, folks.\n\t\tTry to show her a little\n\t\trespect...\n\nA REPORTER ducks under the media boundary, moving in for a closer \nshot.\n\nHe doesn't make it two steps before he's intercepted by Gus. Gus \ngrabs the reporter and shoves him back.\n\n\t\t\t\tGUS\n\t\tHey! What did I just say?\n\nGus means business. One look into his eyes reveals his intense, no \nnonsense approach.\n\n\t\t\t\tREPORTER\n\t\tAss-hole...\n\nThe reporter backs off.\n\nBACK AT THE GRAVESIDE -\n\nBeneath the gloomy, ominous skies, the lines on Chase's face shade \nhim as a decade older than his thirty-five years. Chase gently \nplaces a comforting hand on Geoff's shoulder.\n\nGeoff inches forward, pulling free of Chase's touch. Drawn to his \nmother, drawn from his father. The only blemishes on his youthful, \nrosy cheeks are the tears, the endless tears.\n\n\t\t\t\tPRIEST (V.O.)\n\t\tI know that my redeemer liveth,\n\t\tand that he shall stand at the\n\t\tlatter day upon the earth.\n\nGeoff looks upon the casket, gazing into the abyss of despair.\n\nFOLLOWING THE CEREMONY\n\nThe crowd has dispersed.\n\nGeoff is standing at the base of Renee's grave. His eyes fixed. \nUnmoving. Unaccepting.\n\nChase is nearby, watching, not wanting to intrude on Geoff's \nprivate moment.\n\nGus quietly moves in at Chase's side.\n\n\t\t\t\tGUS\n\t\tDid she always have reporters\n\t\tfollowing her around like this?\n\n\t\t\t\tCHASE\n\t\tPretty much so.\n\nGus glances at Geoff.\n\n\t\t\t\tGUS\n\t\tI hear you moved into town.\n\n\t\t\t\tCHASE\n\t\tI wanted to get Geoff out of\n\t\tL.A. Just start things over, you\n\t\tknow?\n\nGus nods. Now his eyes fall on Renee's headstone.\n\n\t\t\t\tGUS\n\t\tI remember when Renee left. She\n\t\tcouldn't wait to get out of\n\t\tLudlow. She used to say that\n\t\tlife moved too slow here...\n\nChase forces a smile.\n\n\t\t\t\tCHASE\n\t\tThat's Renee alright.\n\n\t\t\t\tGUS\n\t\tI suppose so.\n\nThe sky above seems heavy with imminent rain and we...\n\n\t\t\t\t\t\t\t\tCUT TO:\n\n12    OMITTED\nTHRU\n15    OMITTED\n\nEXT.  HOUSE - DAY\n\nLazy oaks embrace a vintage, two-story Victorian home in the rural \nneighborhood of Ludlow, Maine. A commercial MOVING VAN is parked \nout front.\n\nMarjorie, the girl we saw at Renee's funeral, is coming down the \nsidewalk. She checks the address on the front of the house, then \nheads up the driveway.\n\nINT.  DOWNSTAIRS HALLWAY\n\nMoving boxes clutter the downstairs.\n\nChase is weaving through the maze, doing an inventory on the \nboxes.\n\nA sweaty PAIR OF MOVERS are climbing up the stairs. Each is \nhunched  over, with a garment box balanced on his back. The side \nof each carton is boldly labeled: RENEE - ATTIC.\n\n\t\t\t\tMOVER (O.S.)\n\t\tWe've got six more of these. You\n\t\tsure you want them all in the\n\t\tattic?\n\nChase is contemplating a compromise when Geoff appears from the \nkitchen doorway.\n\n\t\t\t\tCHASE\n\t\t...Geoff, what if we just give\n\t\tthe clothes to Goodwill? We'll\n\t\tkeep the rest. Just the clothes.\n\nGeoff shakes his head, firm and deliberate denial.\n\n\t\t\t\tGEOFF\n\t\tYou're the one who wanted to move.\n\t\tNobody would've touched them if\n\t\tyou didn't want to move here...\n\nChase weakens, giving in.\n\n\t\t\t\tCHASE\n\t\tAll the 'Renee' boxes go in the\n\t\tattic. Sorry.\n\nMarjorie KNOCKS on the open frame of the front door.\n\nGeoff recognizes her from his mother's funeral. She flashes him a \nwarm smile.\n\n\t\t\t\tMARJORIE\n\t\tHi. I'm Marjorie Hargrove. Your\n\t\tnew housekeeper.\n\nMarjorie has a naive, friendly quality about her. She's also \nblessed with eye-popping genetics. Standing there outside the \ndoor, looking more than a little nervous... we can't help but like \nher. Needless to say, she doesn't look like your typical \nhousekeeper.\n\n\t\t\t\tMARJORIE\n\t\t\t(re: Chase's reaction)\n\t\tIs something wrong?\n\n\t\t\t\tCHASE\n\t\tUh... no. You just... look\n\t\tdifferent than you sounded on the\n\t\tphone. Please, come in.\n\nMarjorie enters. She grins at Geoff again. Yep. She's nervous \nalright.\n\n\t\t\t\tMARJORIE\n\t\tI'm real excited about working\n\t\tfor you Mr. Matthews...\n\n\t\t\t\tCHASE\n\t\tWell we're glad to have you,\n\t\tMarjorie. You can call me Chase,\n\t\tby the way.\n\nMarjorie passes her curious eyes over one of Renee's garment \ncontainers.\n\n\t\t\t\tMARJORIE\n\t\tI've always admired Ms. Hallow.\n\t\tThat scene she did in Blue\n\t\tMidnight, where her lover meets\n\t\ther at the train station...\n\t\t\t(she sighs)\n\t\tI must've watched that movie four\n\t\ttimes.\n\nChase smiles. Marjorie's enthusiasm is endearing.\n\nJust then, one of the movers loses his grip. A garment box bounces \ndown the slope of the stairs. When it reaches the bottom, dresses \nspill over the floor.\n\n\t\t\t\tMARJORIE\n\t\tOh. I'll get that...\n\nMarjorie moves for the spill. The first dress she touches is a \nbeaded peach evening gown. Her fingers linger on the fabric.\n\n\t\t\t\tMARJORIE\n\t\tThis is gorgeous. She wore this\n\t\tat the Emmys, didn't she?\n\nGeoff moves forward, acting overly defensive.\n\n\t\t\t\tGEOFF\n\t\tHey, don't touch her stuff. It\n\t\tmade her crazy when people touched\n\t\ther stuff.\n\nMarjorie is taken aback by the oddity of Geoff's statement.\n\nChase catches her eye, shrugging apologetically.\n\n17    OMITTED\nTHRU\n19    OMITTED\n\nEXT.  DRIVEWAY - DAY\n\nA VAN is parked outside. The rear side panel is masked off with \ntape and a stencil. Chase grabs the corner of the tape and \ncarefully peels it back, revealing a crisp, new business logo:\n\n\t\tROUND THE CLOCK ANIMAL DOC\n\t\tMOBILE VETERINARY SERVICE\n\t\tCHASE MATTHEWS, D.V.M.\n\t\tServing Aroostook County\n\nEXT.  TOWN - DAY\n\nESTABLISHING. Shops and businesses situated around a lazy town \nsquare. QUiet. Relaxed. As rural as they come.\n\nWE pick up Chase's van as it cruises by.\n\nEXT.  VETERINARY OFFICE - DAY\n\nChase pulls the van in front of an unassuming veterinary office.\n\nOn the door is Chase's nameplate. And on the weathered wall is an \noutline of letters where the name and title \"Quentin Yolander, \nDoctor of Veterinary Medicine\" once was.\n\nGeoff is first out of the van.\n\nINT.  EXAMINATION ROOM - DAY\n\nGeoff and Chase move inside. The offices look like they were built \nin the 40s. A dark corridor stretches down the center of the \nsuite. Faded green walls are solid, with few exteriors. It's \ncreepy in here.\n\nHeavy, grey plastic curtains absorb much of the light which does \nfind its way in. Nothing looks like it's been updated in the past \nfifty years.\n\n\t\t\t\tCHASE\n\t\tThis doesn't look so bad...\n\nChase sweeps a curtain aside, revealing the interior to Geoff. \nDust swirls in the air.\n\n\t\t\t\tGEOFF\n\t\tHow long ago did this guy retire?\n\n\t\t\t\tCHASE\n\t\tIt's been a few years.\n\nGeoff takes a look around, growing uncomfortable.\n\n\t\t\t\tGEOFF\n\t\t\t(skeptical)\n\t\tA few?\n\nGeoff moves on down the central corridor which seems to grow \ndarker and more dismal with every step. He moves on into the \nboarding room...\n\nINT.  BOARDING AREA - DAY\n\nRows of kennels are stacked along the walls, smothered with \ncobwebs. Ancient, rusted surgical equipment is scattered \neverywhere. The place is a mess. Windows are boarded up and \nshadows cloak the room.\n\nOver to the right, Geoff hears a RUSTLING.\n\nA CARDBOARD BOX on one of the shelves jiggles. Something is moving \naround inside it.\n\nGeoff's eyes widen. Still, morbid curiosity propels him forward.\n\nThe box rustles again. He reaches for it and...\n\nA CREATURE LEAPS out at him, HOWLING. Geoff SCREAMS and jumps \nback. The box tumbles over and...\n\nA CAT crawls out. Behind the protective mother, are four of the \ncutest kittens we've ever seen, MEWING away.\n\nGeoff sighs just as Chase rushes into the room.\n\n\t\t\t\tCHASE\n\t\tWhat's wrong?!\n\n\t\t\t\tGEOFF\n\t\t\t(embarrassed)\n\t\tNothing. I just got spooked by a\n\t\tbunch of furballs.\n\nInside the box is a note. Chase reaches for it. It reads: \"And a \nwarm welcome to you.\"\n\n\t\t\t\tCHASE\n\t\tGreat, now I've opened an\n\t\torphanage too.\n\nOne of the kittens pads out of the box and looks up at Geoff with \nsleepy eyes. Her fur is striped.\n\n\t\t\t\tGEOFF\n\t\tWell, I'll take one. If it's\n\t\tokay...\n\nGeoff lifts the fragile creature, cradling it in his arms.\n\n\t\t\t\tGEOFF\n\t\tShe looks like a tiger.\n\nChase spies an old broom resting in the corner.\n\n\t\t\t\tCHASE\n\t\tTell you what, you do some\n\t\tsweeping up here, and she's yours.\n\nGeoff nods and Chase moves back out into the hallway.\n\nGeoff sets the box back upright and lowers Tiger in with the other \nkittens. He reaches for the broom and goes to work sweeping away \nthe cobwebs.\n\nJust as soon as he turns his back, Tiger climbs the side of the \nbox, spilling over onto the floor.\n\nINT.  EXAMINATION ROOM\n\nChase is unpacking a shipment of medical supplies. When he places \nthem in the cabinet, he stirs up a layer of dust.\n\nTiger scampers by as Chase coughs his way out of the cloud of \ndust.\n\nINT.  WAITING AREA\n\nTiger sees the front door ajar. And as she approaches to explore \nwhat lies beyond--\n\nThe door swings open...\n\nZOWIE, A SIBERIAN HUSKY is staring back at her. He's black and \nwhite with blue eyes, with a mask that is at once menacing and \nmajestic.\n\nA pudgy thirteen year old boy, DREW, has a hold of the dog's \ncollar.\n\nZowie's BARK sends Tiger scrambling.\n\nDrew loses his grip as Zowie yanks free. A strong, paternal \ncommand calls after Drew from outside.\n\n\t\t\t\tVOICE (O.S.)\n\t\tDrew, you get a handle on that\n\t\tdog, now!\n\nINT.  EXAMINATION ROOM\n\nChase spins around at the commotion as Tiger darts across the \nfloor with the barking dog in pursuit.\n\nMayhem ensues as Zowie's big paws slip on the slick tile.\n\nGeoff rushes in from the boarding area.\n\nTiger ducks beneath the back of a surgical gurney.\n\nZowie's snoot wedges beneath the base, inches from Tiger's tiny, \nstriking paw.\n\nDrew slides in on his knees, renewing his hold on Zowie's collar. \nHe pulls the dog back.\n\nGeoff rescues Tiger from beneath the gurney.\n\nDrew shrugs sheepishly.\n\n\t\t\t\tDREW\n\t\tSorry. He gets kinda hyper...\n\nDrew's stepfather, Gus Gilbert, enters. The dreaded, domineering \nvoice of authority in Drew's life. WE know him as the sheriff at \nRenee's funeral.\n\n\t\t\t\tGUS\n\t\tHell, he thought it was lunch.\n\t\tHow ya doin', Chase?\n\t\t\t(a handshake)\n\t\tYou haven't met my boy.\n\t\t\t(aside)\n\t\tDrew, where the hell are your\n\t\tmanners.\n\nDrew steps forward and awkwardly offers his hand to Chase. Then \nGeoff. The boys shake.\n\n\t\t\t\tGEOFF\n\t\tHe's a cool lookin' dog.\n\nZowie lurches forward, eager to shower affection on Geoff. Geoff \nstrokes the dog's soft mane.\n\n\t\t\t\tGEOFF\n\t\tWhat's his name?\n\n\t\t\t\tDREW\n\t\tZowie.\n\nDrew puts his palm under Zowie's chin and turns him for Chase to \nsee. There are several scabbed-over gashes on his left cheek.\n\n\t\t\t\tGUS\n\t\tDamn dog stuck his nose in on my\n\t\trabbits and they ganged up on him.\n\t\tI swear that dog's an idiot.\n\n\t\t\t\tDREW\n\t\tIs he gonna be okay?\n\nWith one eye on Zowie, Chase sprays some antiseptic on the \nexamination table and wipes it clean.\n\n\t\t\t\tCHASE\n\t\tLet's have him hop up here.\n\nDrew prods Zowie. Zowie jumps up onto the table. Chase looks over \nthe facial lacerations, then turns on a penlight and examines the \ndog's eyes.\n\nGus passes a lingering look over Tiger. He reaches in to pet her, \nmaking sure it meets with Geoff's approval.\n\n\t\t\t\tGUS\n\t\tWhen I was young I thought cats\n\t\twere the girls and dogs were the\n\t\tboys.\n\n\t\t\t\tCHASE\n\t\tThere are three more girls where\n\t\tthat one came from looking for\n\t\thomes.\n\nDrew perks up at the thought, but Gus shoots it down.\n\n\t\t\t\tGUS\n\t\tNot our home.\n\nChase takes the light out of Zowie's eyes. He looks to Gus.\n\n\t\t\t\tCHASE\n\t\tThee facial lacerations should heal\n\t\tup pretty quickly. I'll give you\n\t\tsom antibiotic cream--\n\n\t\t\t\tGUS\n\t\t--Drew, he's your dog. Are you\n\t\tlistening to this?\n\nChase turns to Drew and continues...\n\n\t\t\t\tCHASE\n\t\tHis left eye is scratched, corneal\n\t\tabrasion. Eyedrops will help, but\n\t\tit's going to take som time. Try\n\t\tto keep him away from those\n\t\trabbits, huh?\n\nDrew nods, casting a glance aside at Gus.\n\n\t\t\t\tGUS\n\t\t\t(to Chase)\n\t\tI hear you've got Marjorie\n\t\tHargrove working for you now.\n\n\t\t\t\tCHASE\n\t\tHow'd you know that?\n\nGus gives Chase a knowing grin.\n\n\t\t\t\tGUS\n\t\tIt's a small town, Chase.\n\nGus laughs and claps Chase on the shoulder.\n\n\t\t\t\tGUS\n\t\tHey Geoff, did you know your\n\t\tmother and I used to be high-\n\t\tschool sweethearts?\n\nGeoff is surprised at this. Surprised and annoyed. Tact isn't a \nquality that Gus possesses in abundance.\n\n\t\t\t\tGEOFF\n\t\tReally?\n\n\t\t\t\tGUS\n\t\t\t(nodding)\n\t\tHomecoming. Prom. Whole nine\n\t\tyards.\n\t\t\t(to Chase)\n\t\tCourse that was a lifetime ago.\n\nEXT.  SCHOOL - DAY\n\nJUNIOR HIGH SCHOOL KIDS are converging en masse for classes. \nChase's van pulls up front.\n\nINT.  VAN - DAY\n\nChase digs some cash out of his wallet. Geoff stares out at the \nschool. He's dreading this.\n\n\t\t\t\tCHASE\n\t\tWhat's a lunch cost these days?\n\t\tYou want ten?\n\n\t\t\t\tGEOFF\n\t\t\t(unenthused)\n\t\tSure.\n\nChase looks at his son.\n\n\t\t\t\tCHASE\n\t\tYou nervous? New town, new\n\t\tschool. I know it must be pretty\n\t\thard for you...\n\n\t\t\t\tGEOFF\n\t\t\t(cutting him off)\n\t\tI'll be fine, Dad.\n\nGeoff reaches for the door, but Chase stops him. He's trying to \nreach his son. He really is.\n\n\t\t\t\tCHASE\n\t\t\t(awkward)\n\t\tGeoff... you have to help me out\n\t\there a little...\n\n\"MEOW!\" Chase drops his eyes to the bulge squirming around in \nGeoff's jacket. He can't help but smile.\n\n\t\t\t\tCHASE\n\t\tAre you sure you don't want me to\n\t\tpick you up. It's a long ride.\n\nGeoff opens the side panel of the van and slips out his MOUNTAIN \nBIKE.\n\n\t\t\t\tGEOFF\n\t\tThat's what my bike's for...\n\nBefore Chase can say another word, Geoff is gone.\n\nEXT.  VAN - DAY\n\nAs Chase pulls away, WE SEE the handmade sign taped in the back \nwindow:\n\n\t\t\t\tPRICELESS KITTENS\n\t\t\t\tFREE TO A GOOD HOME\n\nEXT.  SCHOOL - DAY\n\nDrew is among a small circle of BOYS. He recognizes Geoff walking \nhis bike from the van. The largest of the boys, CLYDE, takes \nnotice of the unfamiliar face.\n\nClyde is fifteen, going on twenty. You know the type: local bully, \nheld back a year or two.\n\n\t\t\t\tCLYDE\n\t\tCheck it out. That's the new kid.\n\t\tThe son of that movie star.\n\nMischief gleams in Clyde's eyes as he watches Geoff's every move. \nThe other boys follow suit. Clyde always takes the lead.\n\nGeoff fields their penetrating stares. For a second his eyes \nconnect with Clyde's, then he moves on into the building.\n\nAmong the boys, Drew is the reluctant participant.\n\nINT.  CLASSROOM - DAY\n\nMRS. GORDON is addressing a room of SEVENTH GRADERS.\n\nGeoff is doodling in his notebook, feeling acutely out of place as \nhe tries to avoid the curious glances the rest of his new \nclassmates are giving him.\n\n\t\t\t\tMRS. GORDON\n\t\tPeople, this is Geoff Matthews.\n\t\tHe'll be joining our class for the\n\t\trest of the school year...\n\nAs Mrs. Gordon points to him, Geoff drops his face even lower. \nThis is the worst embarrassment a boy could ever suffer. He'd like \nto throttle Mrs. Gordon.\n\nA freckle-faced boy, DOUG, fires off a question.\n\n\t\t\t\tDOUG\n\t\tHey, what's Hollywood like? Do\n\t\tyou know Eddie Murphy?\n\n\t\t\t\tGEOFF\n\t\t\t(annoyed)\n\t\tNo.\n\n\t\t\t\tMRS. GORDON\n\t\tWhy don't we save that for later,\n\t\tDoug?\n\nA girl with braces, SUSAN, continues the interrogation.\n\n\t\t\t\tSUSAN\n\t\tWhat about Julia Roberts?\n\n\t\t\t\tMRS. GORDON\n\t\tSusan! That'll be enough.\n\nSusan shuts up. Geoff sinks even lower in his seat.\n\nThe kids turn their eyes back to the front of the room.\n\nBut one classmate's eyes are still on Geoff. It's Clyde.\n\nClyde shifts his stare to the squirming lump in Geoff's jacket. He\ncatches a glimpse of Tiger's bobbing nose popping out.\n\nINT.  HALLWAY - DAY\n\nGeoff joins the stampede of kids as the BELL releases them for the \nday. Almost immediately, Clyde and his cronies, STEVIE AND BRAD, \nfall in step behind him. Drew hangs slightly off to the side, not \nreally wanting to be a part of the intimidation.\n\n\t\t\t\tCLYDE\n\t\tWhat's the hurry, Junior? Where\n\t\tyou off to?\n\nClyde quickens his pace, pulling ahead of Geoff and stopping in \nfront of him. Stevie and Brad move in on either side. Surrounded \nby peers, it's apparent how small Geoff is for his age.\n\nOn the wall next to them is a bulletin board display. Clyde \nglances at it. Geoff follows his gaze.\n\nDISPLAY\n\nIt's one of those corny school affairs with construction paper \nletters spelling out: \"WE REMEMBER RENEE HALLOW.\" Beneath that are \npictures of Renee clipped from various magazines. Cloyingly \ntasteless.\n\n\t\t\t\tCLYDE\n\t\t\t(feigning remorse)\n\t\tToo bad about your Mom. Papers\n\t\tsaid it was pretty gross, getting\n\t\tfried like that. Guess you saw\n\t\tit, huh?\n\nGeoff nods. Clyde raises his eyebrows, pulling Geoff's jacket \nopen.\n\n\t\t\t\tCLYDE\n\t\tSo, what are you hiding there?\n\n\t\t\t\tSTEVIE\n\t\tWhen you bring a friend to school\n\t\tyou're supposed to introduce him.\n\nGeoff's arm tightens protectively around Tiger.\n\n\t\t\t\tGEOFF\n\t\tHer name's Tiger.\n\n\t\t\t\tCLYDE\n\t\tTiger? Don't you think that's\n\t\tkind of a pussy name?\n\t\t\t(reaching out)\n\t\tCan I hold her? I promise I'll be\n\t\treal careful.\n\nClyde has a convincing way about him. Geoff reluctantly hands the \nkitten over. Clyde is so gentle with the creature that one would \nnever question his sincerity.\n\nGeoff is just beginning to feel at ease when something changes in \nClyde's tone, something sinister.\n\n\t\t\t\tCLYDE\n\t\tHey, Geoff. You ever seen a\n\t\tkitten run?\n\n\t\t\t\tGEOFF\n\t\tI've seen her run around the\n\t\thouse.\n\nClyde's eyes narrow. He takes a couple of steps back. Geoff's \nheart starts to sink.\n\n\t\t\t\tCLYDE\n\t\tNo, I mean really run...\n\t\t\t(beat)\n\t\tLike this!\n\nClyde backsteps and bolts off down the hallway with Tiger. Brad \nand Stevie fall in behind him, laughing.\n\nDrew shrugs apologetically. He's torn, but he tears off after them \nnonetheless.\n\n\t\t\t\tGEOFF\n\t\tShit...\n\nGeoff runs off in pursuit of them.\n\nEXT.  SCHOOL - DAY\n\nGeoff rushes from the building, searching the dispersing crowd. \nThere they are, tearing from the bike racks, pedaling for the \nstreet.\n\nClyde sees Geoff and mockingly holds the kitten out for display as \nthey ride by.\n\nGeoff runs for the bike racks.\n\nEXT.  ROAD - DAY\n\nClyde and his cohorts break from the outskirts of town, riding out \nonto the open road.\n\nClyde glances back toward the center of town.\n\nGeoff is so far behind he's barely visible.\n\nClyde returns his eyes to the road ahead, raising Tiger nose to \nnose with him.\n\n\t\t\t\tCLYDE\n\t\tHaving fun yet?\n\nClyde and his smirking buddies ride on, OUT OF FRAME.\n\nWITH GEOFF\n\ngiving the pedals all he can, struggling to keep pace with the \nboys.\n\n35    OMITTED\n\nFURTHER ALONG\n\nScattered houses sprinkle the landscape ahead. Cochran Lake \nstretches into the distance beyond the housing.\n\nClyde's clan cuts from the road and blazes a trail across a \nresidential property. The two-story house is weathered and boarded \nup. It looks vaguely familiar. Creepy.\n\nAnd when WE FIND the mailbox post, we know why. The name is faded, \nbut there's no question who once lived there. Five bold letters: \n\"CREED.\"\n\nGeoff whips by in a blur, still in pursuit.\n\nEXT.  COUNTRYSIDE - DAY\n\nClyde and his friends have abandoned their bikes. They've taken \nposition on top of the slope of the hill, standing at the foot of \nTHE PATH TO THE PET SEMATARY.\n\n38    OMITTED\n\nEXT.  PET SEMATARY PATH - DAY\n\nGeoff pulls his bike to a stop short of the boys. He dismounts and \nleans it up against a tree.\n\n\t\t\t\tGEOFF\n\t\tJust give me the cat, all right?\n\nA devilish grin creeps over Clyde. He strolls down the path toward \nGeoff. Clyde grabs Geoff's handlebars and, backing up, pulls Geoff \nand the bike with him.\n\n\t\t\t\tCLYDE\n\t\tI would but... there was a little\n\t\taccident...\n\t\t\t(feeding off Geoff's\n\t\t\talarm)\n\t\tShe was trying to get away. You\n\t\tknow, running down my leg... and\n\t\ther head got too close to the \n\t\tspokes. Pretty gross. What's\n\t\tleft of her is up in the Pet\n\t\tSematary. A zip-lock bag might\n\t\thelp...\n\t\t\t(shrugs)\n\t\t...but I happen to be out of them\n\t\tat the moment.\n\nDrew shakes his head, disgusted he has to put up with Clyde's \nantics.\n\n\t\t\t\tDREW\n\t\tCome on, Clyde, just tell him\n\t\twhere the cat is...\n\n\t\t\t\tCLYDE\n\t\t\t(turning on Drew)\n\t\t...I TOLD HIM where the cat is!\n\t\tNow shut up, fuck-face!\n\nClyde punches Drew in the arm. Drew shrinks back.\n\nGeoff flashes a hateful stare at Clyde.\n\nAll of the boys but Clyde are uncomfortably silent. There's \nsomething frightening about Clyde... something that extends beyond \nthe standard bully antics. We begin to get the feeling that this \nkid is genuinely deranged.\n\n\t\t\t\tCLYDE\n\t\t\t(relishing the\n\t\t\tmoment)\n\t\tYou heard about the Creed murders\n\t\tyet? And the place where the dead\n\t\tcome back to life?\n\nHe motions to the path behind him.\n\n\t\t\t\tCLYDE\n\t\t\t(continuing)\n\t\tIt's just back there. Just down\n\t\tthat path...\n\n\t\t\t\tDREW\n\t\t\t(meekly)\n\t\tClyde... it's not funny anymore.\n\n\t\t\t\tCLYDE\n\t\tOh? So you got a problem?\n\t\tWhat're you gonna do, fat-ass? You\n\t\tgonna sic big, bad, old Gus after\n\t\tme?\n\nDrew shuts up. Clyde turns back to Geoff, drawing closer.\n\n\t\t\t\tCLYDE\n\t\tWhat do you think, Geoff? Maybe\n\t\tyou could dig up your Mom and take\n\t\ther back there. Maybe if you pray\n\t\treal hard, she'll come back.\n\nWith this last remark Clyde has pushed too far. Geoff's face is \nred with anger.\n\n\t\t\t\tGEOFF\n\t\t\t(quietly)\n\t\tJust give me the cat, ass-hole.\n\nClyde's grin falters a moment.\n\n\t\t\t\tCLYDE\n\t\tExcuse me, maybe I'm a little hard\n\t\tof hearing... but did you just call\n\t\tme an ass-hole?\n\nClyde pokes Geoff in the shoulder.\n\n\t\t\t\tCLYDE\n\t\tYou mad, Geoff? Cause if you are,\n\t\tyou should take a shot at me...\n\nThis time Clyde shoves Geoff back even harder.\n\n\t\t\t\tCLYDE\n\t\tCome on, you pussy! What's the\n\t\tmatter with you?\n\nClyde moves forward again and Geoff suddenly LASHES OUT, catching \neveryone off guard.\n\nFor an instant, Drew marvels at Geoff's tenacity.\n\nClyde LUNGES. He hammers Geoff with blows.\n\nOutsizing him by forty pounds, Clyde tosses Geoff to the ground. \nGeoff struggles, but Clyde's grip proves arresting.\n\nClyde throws Geoff onto his stomach, forcing his face into the \ndirt. It looks as if he's ready to smother his opponent.\n\nDrew is the first to rush in. Brad and Stevie quickly follow. It \ntakes all three of them to peel Clyde off Geoff.\n\nClyde gets to his feet and backs away. There's great pleasure in \nhis crazed eyes as he watches Geoff coughing and gasping.\n\n\t\t\t\tCLYDE\n\t\tFuckin' ass-hole.\n\nSatisfied he's handed out enough ill will for the day, Clyde turns \naway.\n\nDrew's attentions remain on Geoff. As Clyde strolls by, he grabs \nDrew's arm and swings him around.\n\n\t\t\t\tCLYDE\n\t\tThis way, fat-boy.\n\nStevie and Brad follow. As the group passes Geoff's bike, Clyde \ngives it a kick, knocking it over. Then they're gone.\n\nGeoff pulls himself to his feet. Brushing off the mess, he heads \nup the path in search of Tiger.\n\nEXT.  PET SEMATARY - DAY\n\nThe woods here have grown long with shadows. The air is still and \nthe sound of birds is conspicuously absent.\n\nA WOODEN ARCHWAY frames the entrance to the primitive graveyard. \nScrawled across the weatherstained boards is a child's barely \nlegible attempt at \"PET SEMATARY.\"\n\nGeoff trepidatiously enters the clearing of crude, crowded graves. \nCollars, leashes, bird cages and other accessories adorn the \nmakeshift crosses and headstones.\n\nGeoff moves along the outer circle of markers, each crafted by a \nchild's caring hands.\n\nAs he searches, he can't help but notice the heartfelt epitaphs. \nOn the outer circle, he sees a crate-board marker memorializing: \nSMUCKY THE CAT... HE WAS OBEDIANT.\n\nMOVING INWARD, the markers are older. The ones he can still read \nconvey a sense of the perpetual cycle of life and death.\n\nHere is a wide, flat, upright board planted deep in the earth: \"In \nMemory of MARTA our Pet Rabit Dyed March 1 1965.\"\n\nThe next three rows are illegible, the inscriptions are weathered \nbeyond recognition... And then, chiseled into sandstone: HANNAH \nTHE BEST DOG THAT EVER LIVED 1929-1939.\n\nAnd now... \"MEOW.\" Faint. But very much alive.\n\nGeoff picks up his pace, weaving quickly toward the center.\n\nThere, he finds Tiger. Trapped in a rusted old birdcage, its base \nswallowed by the grave.\n\nGeoff opens the door and frees Tiger, stroking the trembling \nkitten.\n\nGeoff's eyes are drawn to the far perimeter... to the deadfall...\n\nTHE DEADFALL looms on the outskirts of the clearing like a pile of \nskeletal remains. An abstract stairway to things beyond. A wind \npicks up just then, sending leaves skittering in waves across the \nground.\n\n40    OMITTED\n\nEXT.  PET SEMATARY PATH - DAY\n\nWhen Geoff turns around, he finds Drew waiting for him under the \narchway. Drew smiles, full of respect for Geoff.\n\n\t\t\t\tDREW\n\t\tI've never seen anybody punch\n\t\tClyde before.\n\n\t\t\t\tGEOFF\n\t\t\t(shrugs)\n\t\tHe pissed me off.\n\n\t\t\t\tDREW\n\t\t\t(his smile fading)\n\t\tSorry about your mom.\n\t\t\t(beat)\n\t\tI couldn't handle not having my\n\t\tmom around. Just having Gus...\n\nHe grimaces at the thought.\n\n\t\t\t\tGEOFF\n\t\tMy dad's not so bad.\n\nDrew glances around at all the makeshift grave markers.\n\n\t\t\t\tDREW\n\t\tI swear, sometimes I wish Gus was\n\t\tdead...\n\n\t\t\t\tGEOFF\n\t\t\t(serious)\n\t\tYou shouldn't ever say that about\n\t\tyour parents, not even your Dad.\n\n\t\t\t\tDREW\n\t\tStepdad. Gus is my stepdad.\n\nGeoff nods knowingly.\n\n\t\t\t\tGEOFF\n\t\tWhat was all that stuff about dead\n\t\tpeople coming back to life?\n\n\t\t\t\tDREW\n\t\tNothing. It's just an old ghost\n\t\tstory. Let's get out of here...\n\nThey head off, full of childhood.\n\nINT.  KITCHEN - DUSK\n\nMarjorie is at the stove, fixing up dinner, while Chase scans the \nnewspaper at the table.\n\nGeoff enters through the kitchen door. He moves past them without \na word.\n\n\t\t\t\tCHASE\n\t\t\t(calling after him)\n\t\tHey! How was your first day at\n\t\tschool?\n\n\t\t\t\tGEOFF\n\t\t\t(over his shoulder)\n\t\tIt sucked.\n\n\t\t\t\tMARJORIE\n\t\tNow is that any way to talk to\n\t\tyour father?\n\nGeoff stops for a moment, turns...\n\n\t\t\t\tGEOFF\n\t\tYou're not my mother.\n\n...and exits through the opposite door.\n\nChase looks to Marjorie and offers a sympathetic shrug.\n\n\t\t\t\tCHASE\n\t\tSorry.\n\nEXT.  DREW'S HOUSE - DUSK\n\nCRUDE CAGES HOUSE DOZENS OF RABBITS. Situated alongside the \ngarage. A sign above the cages reads: PET RABBITS - $10.00. Bells \npositioned along the roof threaten to reveal foul play.\n\nGus is rigging a wire along the base of the cage.\n\nFinishing it off, he hangs the plug next to an outside socket. \nMoving onto the next chore, he pours pressed alfalfa pellets into \nfeeding slots for the hungry rabbits.\n\nSetting the feed aside, he takes a seat. Opening one of the cages, \nhe grabs a rabbit and sets it on his lap, gently petting its soft \nfur.\n\nOne of the cages starts to vibrate.\n\nGus gives it a look: A PAIR OF RABBITS aren't interested in \neating, they're joined in fast and furious passion.\n\nGus gets a chuckle out of the sight.\n\n\t\t\t\tGUS\n\t\tWay to go, Romeo...\n\nGus replaces the rabbit in the hutch. And before he goes, HE SINKS \nTHE PLUG INTO THE SOCKET. An ELECTRICAL CHARGE dances along the \nbase of the cage, a deterrent for intruders.\n\nINT.  KITCHEN - NIGHT\n\nDrew's mother, AMANDA, withdraws a roast from the oven.\n\nGus is at the sink, washing his hands. He turns to see Zowie \nlaying at Drew's feet in the living room. Drew is watching a MUSIC \nVIDEO on TV.\n\n\t\t\t\tGUS\n\t\tDrew, I don't remember inviting\n\t\tZowie in for dinner.\n\n\t\t\t\tDREW\n\t\tJust until he heals up?\n\nGus is waggling his thumb toward the back door.\n\nDrew slumps in defeat.\n\nGus reaches into the cabinet and pours himself a Bourbon.\n\nEXT.  DREW'S HOUSE - NIGHT\n\nDrew walks Zowie from the house with a dish of dog food. As they \npass the rabbit dens, Zowie alters his path. Drew gets a handful \nof his collar and pulls him back.\n\nAcross the yard is an enclosed dog run. Twenty feet long by ten \nfeet wide. Drew puts Zowie inside with the dog food.\n\nDrew strokes Zowie's mane affectionately, then backs away, closing \nthe wood-framed door to the dog run.\n\nINT.  DREW'S KITCHEN - NIGHT\n\nAmanda's about to put the roast on the table when Gus nuzzles up \nbehind her, breathing down her backside. With his drink in hand, \nhe sweeps her hair aside and zeros in for a kiss on the back of \nthe neck.\n\nGus eases his free hand around between Amanda and the counter and \npresses his palm firmly into her crotch, drawing her body tight to \nhim.\n\nShe stiffens at his intimate hold, uncomfortable with his timing.\n\n\t\t\t\tAMANDA\n\t\tGus, please...\n\nAt the back door, Drew is watching from beyond the screen, \ndisgusted by the sight of Gus pawing his mother. Drew swings the \ndoor open as loud as he can to signal his return.\n\nGus plants a last kiss on the back of Amanda's neck and backs off. \nBut before he goes, he snatches a chunk of meat from the serving \nplatter. Leveling his leering eyes at Amanda, he stuffs it into \nhis mouth suggestively.\n\n\t\t\t\tGUS\n\t\tGod damn, you're good.\n\nDrew rolls his eyes and takes his seat at the table, returning his \nattention to the TV, where another MUSIC VIDEO is on.\n\nGus glances at the TV, annoyed by the MUSIC. He drops into his \nspot at the head of the table, blocking Drew's view. Drew leans to \nthe side for a better look. Gus takes notice and leans to the same \nside to obstruct his view.\n\n\t\t\t\tGUS\n\t\tYou're breaking the law here,\n\t\tDrew.\n\n\t\t\t\tAMANDA\n\t\tReally, Gus. It won't bother me.\n\nGus ignores her, inching forward with a confidential, harsh \nwhisper.\n\n\t\t\t\tGUS\n\t\tYour mom's spent the last hour\n\t\tcooking. Stop being a little jerk\n\t\tand show her some appreciation.\n\nDrew aims the remote control at Gus, as if to shut him up, and \nsilences the TV.\n\nAmanda approaches with the roast. The moment it's on the table, \nDrew starts dishing up a hefty serving. Gus spears Drew's fork \nwith the serving fork.\n\n\t\t\t\tGUS\n\t\tNot that much appreciation. I\n\t\tthought we were gonna tone down\n\t\tthat flabby ass.\n\n\t\t\t\tDREW\n\t\tHey, I'm so sorry I'm not the stud\n\t\tthat you are.\n\n\t\t\t\tAMANDA\n\t\tKnock it off, guys...\n\nGus throws back a sip of Bourbon.\n\n\t\t\t\tGUS\n\t\t\t(to Drew, quietly)\n\t\tYou watch that mouth of yours,\n\t\tDrew buddy.\n\n46    OMITTED\n\nEXT.  ZOWIE'S DOG RUN - NIGHT\n\nMOVING THROUGH Zowie's enclosed pen, WE SEE no sign of the dog. \nREACHING the door, WE FIND that the wood around the bottom hinge \nhas been chewed through. The base of the door is ajar, just enough \nfor a dog to have slipped through.\n\nEXT.  RABBIT CAGES - NIGHT\n\nIn the still of the night, Gus' rabbit pens sit unattended. And \nthen WE HEAR the tinkling of dog tags. Snoozing rabbits awaken as \nZowie lumbers INTO FRAME.\n\nZowie rises on his hind legs, pressing his paws to a cage. Blue \nsparks fly as Zowie is jolted with the electrical charge.\n\nINT.  GUS' ROOM - NIGHT\n\nThe ELECTRICAL ZING. The dog's whimpering CRY. And the RINGING OF \nBELLS reach Gus in rapid succession, rousting him from his sleep. \nHe rolls out of bed and grabs his robe.\n\n\t\t\t\tGUS\n\t\tDamn it, Drew. That dog is\n\t\thistory!\n\nAmanda stirs, groggily focusing on Gus' departing figure.\n\nINT.  DREW'S ROOM - NIGHT\n\nDrew swings open the door to the hallway as Gus marches by, \nstuffing shells into a shotgun. Panicked, Drew takes off after \nhim.\n\nEXT.  RABBIT CAGES - NIGHT\n\nZowie swings his head in the direction of the house as Gus bursts \nthrough the back door. Drew is one step behind.\n\nGus swings the gun up and fires off a SHOT.\n\nZowie bolts for the shadows of the hillside.\n\nDrew rushes in and deflects the aim of the rifle.\n\n\t\t\t\tDREW\n\t\tDon't shoot him!\n\nGus' eyes are wild with anger.\n\n\t\t\t\tGUS\n\t\tWhat, Drew? What did you say?!\n\nGus throws Drew aside, brings the rifle back up and FIRES another \nrandom shot after the fleeing dog. All the while, his eyes remain \non Drew, as if this were the boy's lesson to be learned.\n\nHe squeezes off one more SHOT...\n\nA PAINED YELP echoes from the hillside. Zowie's yelp.\n\nDrew whips his head aside in sickened shock. Even Gus is sobered \nby the unexpected hit.\n\nAll they can hear now are Zowie's WHIMPERING CRIES diminishing in \nthe night.\n\nDrew shoots Gus a look of such unbridled hatred that Gus is \nspeechless. He backs away from Gus and darts off toward the dark \nhillside.\n\nWhen Gus turns back for the house, Amanda is standing there.\n\n\t\t\t\tAMANDA\n\t\tJesus, Gus, what have you done?\n\n\t\t\t\tGUS\n\t\tAh, come on, Amanda, stop looking\n\t\tat me like that. He's had ample\n\t\twarning about that dog.\n\nAmanda glares at him, an outpouring of pent-up strain.\n\nGus defiantly marches past Amanda, entering the house without ever \nmeeting eyes with her.\n\nEXT.  WOODS - NIGHT\n\nDrew pauses long enough to listen for Zowie...\n\nNothing until a FAINT CRY drifts back at him.\n\nDEEPER IN THE WOODS\n\nZowie limps INTO FRAME. Blood is flowing from the bullet wound in \nhis left hindquarter, trailing from his suspended leg. Every step \nis a strain.\n\nDREW\n\ncomes upon a break in the trees. The hanging moon outlines the \nknoll stretching beyond. And then, the strained breathing, the \nhushed WHIMPER.\n\nDrew hesitantly approaches the crest of the knoll.\n\nZowie is just beyond, lying on his side at the end of the bloody \ntrail. His chest rises and falls almost imperceptibly with every \neffort to survive.\n\nDrew drops to his knees at Zowie's side and cradles the dog in his \nlap, shaking his head in denial.\n\nZowie's weak eyes shift, gazing longingly at Drew.\n\nDrew strokes the fur under Zowie's chin, hardly able to see the \ndog through his glaze of tears.\n\nZowie's eyes drift off. His chest falls and doesn't rise again. He \nfalls limp in Drew's arms. Drew hugs Zowie even tighter and he \nbegins to weep.\n\nFROM A DISTANCE\n\nWE SEE the image of Drew with the dog cradled in his arms, \nsilhouetted against the moonlit horizon.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n53    OMITTED\n\nEXT.  GEOFF'S HOUSE - MORNING\n\nGeoff appears from the garage with his bike and takes off for the \nroad. A WHISTLE catches his ear.\n\nDrew is at the edge of the woods, beckoning for Geoff.\n\nGeoff circles around and doubles back.\n\n\t\t\t\tGEOFF\n\t\tI was just going by your house.\n\t\tWhere's your bike?\n\nThe closer Geoff gets, the more he sees of Drew's despair. Then he \nsees the dried blood staining Drew's clothes.\n\n\t\t\t\tDREW\n\t\tZowie's dead.\n\nGeoff's heart sinks. An unspoken moment of sympathy passes between \nthe boys. Fighting the emotions, Drew finally speaks.\n\n\t\t\t\tDREW\n\t\tI have to bury him. I don't want\n\t\tto go out there alone.\n\nThere's such grief in Drew's words that Geoff can't resist. He \nglances toward his house to make sure he hasn't been seen, then \nblends into the woods.\n\nEXT.  PET SEMATARY - DAY\n\nDrew carries Zowie's relaxed form in his arms. Geoff is following, \nbalancing a pickaxe and shovel.\n\nArriving at the graveyard, Geoff searches the outer perimeter for \na vacant stretch of soil. Finding one, he lets the heavy tools \nfall to the ground.\n\n\t\t\t\tGEOFF\n\t\tIs this a good spot?\n\n\t\t\t\tDREW\n\t\tI'm not burying him here...\n\n\t\t\t\tGEOFF\n\t\tWhy not?\n\n\t\t\t\tDREW\n\t\tThere's a better place...\n\nDrew heads for the base of the deadfall, with Zowie in his arms.\n\n\t\t\t\tDREW\n\t\tIt's back here somewhere, through\n\t\tthe Indian woods. I know we can\n\t\tfind it...\n\nDrew continues up the deadfall, disappearing over the crest.\n\nGeoff gathers up the shovel and pickaxe and follows after him.\n\n\t\t\t\tGEOFF\n\t\tHey, wait up!\n\nEXT.  THE BOG - DAY\n\nGeoff climbs over the peak of the deadfall...\n\nBeyond is a dark swamp, A BOG, looking unlike anything one would \nexpect in Maine. Tendrils of ground fog swirl about vegetation \nthat looks almost prehistoric. Gnarled trees rise up from the \nmurky earth, blocking the sun from view.\n\nGeoff hurries down the other side of the deadfall to catch up with \nDrew. Somewhere off in the distance we hear an UNEARTHLY SOUND. \nNot a bird. Not any animal known to man.\n\nSpectral shapes flicker at the edge of Geoff's vision, sinking \nback into the shadows as Geoff tries to focus on them.\n\n\t\t\t\tGEOFF\n\t\t\t(uneasy)\n\t\tDrew, where are we going?\n\nDrew doesn't respond. He continues on without another word, hell-\nbent on finding this \"better place.\"\n\nFURTHER ALONG - DAY\n\nAt the boundary of the bog, A STAIRWAY OF HUGE, WIDE STONES rises \nfrom the blanket of ground fog. Bordered by fir trees. Leading up \nthe hillside. The final leg of Drew and Geoff's journey.\n\n\t\t\t\tDREW\n\t\tThis is it... I wasn't sure if it\n\t\teven really existed.\n\n\t\t\t\tGEOFF\n\t\tWhat did?\n\n\t\t\t\tDREW\n\t\tThe old Indian burial ground.\n\nGeoff's eyes move to the stairway of stones.\n\n\t\t\t\tGEOFF\n\t\tCome on, that's just a bullshit\n\t\tstory. You said so yourself...\n\n\t\t\t\tDREW\n\t\tWhat if it's not bullshit? If I\n\t\tbury Zowie there, and it works...\n\t\t\t(beat)\n\t\t...he'll come back alive.\n\n\t\t\t\tGEOFF\n\t\tDrew, I know your dog died, but...\n\t\tget a grip, man, you're freaking\n\t\tme out.\n\n\t\t\t\tDREW\n\t\tLook, if there was even one chance\n\t\tin a million it'd work, wouldn't\n\t\tyou want to try?\n\nGeoff feels for Drew. It's pointless to reason.\n\nDrew starts up the stone steps. Geoff has no choice but to follow.\n\nEXT.  MICMAC BURIAL GROUND - DAY\n\nEven in broad daylight, the flat-topped mesa has a sense of \nforeboding isolation. There's an almost palpable sense of \n\"wrongness\" about this place. As if the darkness of a dying black \nhole was seeping out of the ground and spreading across the earth.\n\nDrew and Geoff approach the circle of rocky soil. They stand at \nthe border, looking it over in eerie silence.\n\nSomewhere off in the distance we hear the unearthly SOUND again, \nonly this time, it's closer.\n\n\t\t\t\tGEOFF\n\t\tLook, let's just get this over\n\t\twith.\n\nEven Drew seems to have awakened from the haze he had fallen into. \nHe gently sets Zowie's body on the ground.\n\n\t\t\t\tDREW\n\t\tIf this doesn't work... don't ever\n\t\ttell anyone I did this, okay? You\n\t\tgotta promise...\n\nGeoff nods and hands over the digging tools. Drew swings the \npickaxe, sinking it into the ground.\n\n\t\t\t\tGEOFF\n\t\tYou want me to help?\n\n\t\t\t\tDREW\n\t\tYou have to bury your own. That's\n\t\tthe way the Indians did it. It's\n\t\tlike a rule...\n\nBacking away from the burial ground, Geoff takes a seat on a rock \nat the border of the forest. From there, he watches.\n\nDrew alternates the pickaxe and shovel as he clears a hole in the \nrocky ground.\n\nWE MOVE IN ON GEOFF, who's looking on with skeptical intrigue as \nthe rhythmic SOUND of the tools continues.\n\n59    OMITTED\n\nLATER -\n\nA cairn is complete: a conical pile of rocks over Zowie's grave.\n\nDrew is now sitting on the rock next to Geoff. Together, they \nstare at the cairn as if Zowie might climb from beneath at any \nmoment.\n\n\t\t\t\tDREW\n\t\tWhat if he really does come back?\n\nGeoff shrugs, pondering such a thought.\n\nGeoff digs into his pocket and produces a pack of gum, offering \none to Drew. With only a quick glance away from the grave, Drew \nsnatches a piece and he stuffs it into his mouth. Geoff does the \nsame.\n\nThey sit together in silence. Nervously chewing their gum. \nWatching the grave.\n\n\t\t\t\tDREW\n\t\tI've never had anyone die\n\t\tbefore...\n\t\t\t(beat)\n\t\t...but I guess you get over it. I\n\t\tmean, eventually...\n\n\t\t\t\tGEOFF\n\t\t\t(quietly)\n\t\tYou never get over it.\n\nEXT.  COUNTRYSIDE - AFTERNOON\n\nThe sun dips over the horizon, giving way to dusk.\n\nEXT.  MICMAC BURIAL GROUND - DUSK\n\nGeoff's eyes shift from the grave to the darkening sky.\n\n\t\t\t\tGEOFF\n\t\tIt's getting pretty late. We\n\t\tbetter go.\n\n\t\t\t\tDREW\n\t\t\t(disappointed)\n\t\tYeah...\n\nThey rise, leaving the burial ground. En route, Drew pauses for a \nlast look at the grave.\n\n\t\t\t\tDREW\n\t\tSo long, Zowie...\n\nGeoff follows, glancing back at the burial ground. It looks \nmagical in the twilight, not quite so sinister now.\n\nEXT.  ROAD - NIGHT\n\nDrew is walking home along the road, alone.\n\nHeadlights blind him as a car approaches. It slows and pulls a U-\nturn, stopping at Drew's side. It's Gus' squad car. He pushes open \nthe passenger door.\n\n\t\t\t\tGUS\n\t\tGet in.\n\nDrew takes a step back, shaking his head.\n\n\t\t\t\tGUS\n\t\tYour momma's worried sick over\n\t\tyou. You take off in the middle\n\t\tof the night, you don't show up\n\t\tfor school. What're you trying to\n\t\tprove?\n\n\t\t\t\tDREW\n\t\tI'm not trying to prove anything.\n\t\t\t(beat)\n\t\tI was burying my dog.\n\nGus turns his eyes away, focusing on the dark road ahead.\n\n\t\t\t\tGUS\n\t\tLife is full of lessons. No one's\n\t\tabove it. Not you. Not me...\n\t\tNow get in the car.\n\nAfter a moment, Drew approaches the car. Without another word, Gus \ndrives off.\n\n64    OMITTED\n\nEXT.  RABBIT CAGE - NIGHT\n\nIt's quiet now. And out of the silence comes the JINGLING of \nZowie's dog tags. Zowie's LONG SHADOW creeps over the cage, \ndistorted to monstrous proportion by the flickering light.\n\nWe move past the cages to the back porch...\n\nWe see ZOWIE'S PAW scratching at the door.\n\nINT.  AMANDA AND GUS' BEDROOM - NIGHT\n\nAmanda wakens with a start. She rises, eyes focusing on the dark \nbedroom. Gus is sound asleep next to her. Then, from outside, we \nfaintly hear ZOWIE'S SCRATCHING.\n\nSlowly, Amanda rises from bed, pulling on a bathrobe as she heads \nfor the door.\n\nEXT.  BACK PORCH - NIGHT\n\nAmanda appears at the door. She unlatches it, stepping outside.\n\n\t\t\t\tAMANDA\n\t\tZowie?\n\nAmanda looks down and SCREAMS.\n\nINT.  DREW'S ROOM - NIGHT\n\nPhotos of Drew with Zowie are tacked on the wall above the bed. \nThe one photo of Drew, Amanda and Gus has been altered with a cut-\nout head of Zowie's pasted on Gus' shoulders.\n\nWE FIND Drew below. He's fallen asleep with his Walkman on. Even \nwith his ears covered, the POUNDING at the door jolts him awake. \nHalf asleep, Drew peels off the headphones.\n\n\t\t\t\tGUS (O.S.)\n\t\tDrew, you unlock this door! Right\n\t\tnow!\n\n\t\t\t\tAMANDA (O.S.)\n\t\tUnlock it, Drew!\n\nThe anger in his mother's voice brings him off the bed. Gus' \nPOUNDING continues.\n\nDrew moves to the door. The inside is secured by a double dead \nbolt. Instead of unlocking them, he opens a tiny, customized \nwindow which gives him a view of the hall.\n\n\t\t\t\tDREW\n\t\tWhat did I do now?\n\n\t\t\t\tAMANDA\n\t\tOpen the door, Drew.\n\nDrew unlatches the deadbolts and steps back as Gus bursts through \nthe door.\n\n\t\t\t\tGUS\n\t\tWhere do you come off lying like\n\t\tthat? \"I'm burying my dog.\" You\n\t\tthink a lie like that's never\n\t\tgonna catch up to you?\n\nDrew backs into the bed, taking a seat.\n\nAmanda comes through the door, and behind her is...\n\nZOWIE\n\nThis is our first glimpse of the resurrected dog. Fur shiny and \nwet, the gaping gunshot wound in his rear. Zowie's head hangs low, \nhis eyes GLEAMING RED. The husky is covered with dirt from head to \ntoe.\n\nDrew's eyes widen in astonishment.\n\nZowie staggers across the room towards Drew, nails clicking on the \nfloorboards. Drew shrinks back in uncertain horror as the dog \nmoves closer.\n\nZowie absently throws his arms up onto the bed, across Drew's lap. \nAnd slowly, perfunctory, his tongue licks Drew's cheek. This last \naction of Zowie displaces Drew's fear. Tears well up in the boy's \neyes.\n\n\t\t\t\tDREW\n\t\t\t(a whisper)\n\t\tZowie...\n\n\t\t\t\tGUS\n\t\tSay your goodbyes. Zowie's going\n\t\toutside. You're grounded, buddy.\n\t\tThat's the new law.\n\nDrew lifts his hand from stroking Zowie's fur. His palm is covered \nwith muddy blood.\n\n\t\t\t\tAMANDA\n\t\tI never knew an open wound could\n\t\tsmell so bad...\n\t\t\t(beat)\n\t\tHoney, he should have been looked\n\t\tat this morning. I don't know\n\t\twhat you were thinking. It's a\n\t\twonder he's still alive.\n\nDrew gazes into the dog's vacant eyes. It truly is a wonder.\n\nINT.  GEOFF'S HOUSE, LIVING ROOM - NIGHT\n\nChase enters and stops in the doorway.\n\nGeoff sits in front of the television with a pile of videotapes \nnext to him. He's scanning through Renee's old movies with the \nremote. The sound has been turned down and the effect is a little \neerie.\n\nON THE SCREEN\n\nWe see RENEE move through a scene. Geoff hits the slo-mo button \nand the image winds down. Renee's face. HER EYES stare out at us \nfrom the alien universe of the past.\n\n\t\t\t\tCHASE\n\t\t\t(gently)\n\t\tGeoff...\n\nGeoff doesn't respond. He's captivated by Renee.\n\nChase moves into the room.\n\n\t\t\t\tCHASE\n\t\tGeoff!\n\nGeoff PAUSES the tape. Renee freezes, the image flickering ever so \nslightly. For an instant, we think we see a FLASH OF Renee being \nelectrocuted. But it's only an instant.\n\nFinally, Geoff tears his eyes away from the screen, resenting his \nfather's intrusion.\n\n\t\t\t\tGEOFF\n\t\tWhat?\n\n\t\t\t\tCHASE\n\t\tYou alright?\n\nGeoff's face softens. He nods.\n\n\t\t\t\tGEOFF\n\t\tDad... do you think...\n\t\t\t(beat)\n\t\t...you think you and Mom would've\n\t\tgotten back together?\n\nChase draws closer. He takes a seat next to Geoff. The pain in his \nson's eyes is almost more than he can stand.\n\n\t\t\t\tCHASE\n\t\tI think so.\n\n\t\t\t\tCHASE\n\t\t\t(continuing)\n\t\tYour Mom and I loved each other,\n\t\tGeoff. Don't ever think that we\n\t\tdidn't.\n\n\t\t\t\tGEOFF\n\t\tI still can't believe she's\n\t\tdead...\n\nChase moves to reach for his son, and suddenly the phone RINGS, \nshattering the moment.\n\nChase hesitates, but finally he rises and answers the phone.\n\nAfter a moment, he returns.\n\t\t\t\tGEOFF\n\t\tWho was that?\n\n\t\t\t\tCHASE\n\t\tRemember Zowie, Drew's dog? He\n\t\tgot hurt again. I'm going over to\n\t\ttake a look at him.\n\nGeoff's eyes widen. He looks like a ghost walked over his grave.\n\n\t\t\t\tGEOFF\n\t\tI'm going with you.\n\nChase nods and exits to get his coat.\n\nGeoff looks back at the TV once more. The image paused.\n\nRenee staring at us from beyond the grave.\n\nEXT.  DREW'S HOUSE - NIGHT\n\nGus, Amanda, Drew and Geoff are gathered around Chase's van.\n\nEXT./INT.  CHASE'S VAN - NIGHT\n\nChase lays Zowie on his side on an examining table and shines an \noverhead light onto the wound.\n\nGeoff is looking in from outside, utterly bewildered by the \nliving, breathing dog.\n\n\t\t\t\tCHASE\n\t\tHow'd it happen?\n\nGus casts a threatening glance in Drew's direction.\n\n\t\t\t\tDREW\n\t\t\t(glaring at Gus)\n\t\tSome psycho hunter probably got\n\t\ttrigger happy...\n\nChase is too busy preparing a syringe to notice the nonverbal \nexchange.\n\n\t\t\t\tCHASE\n\t\tI'm going to give Zowie a local\n\t\tanaesthetic so I can clean up the\n\t\twound. I'd like to take him home\n\t\ttonight for observation.\n\n\t\t\t\tAMANDA\n\t\tFine.\n\n\t\t\t\tDREW\n\t\tCan you keep him at your place\n\t\tuntil he gets better?\n\n\t\t\t\tCHASE\n\t\tSure...\n\nDrew tenderly strokes Zowie's mane as Chase administers the \ninjection. Zowie stares up at Geoff with dull, blank eyes.\n\nDrew reads Geoff's bewilderment and joins him outside the van. \nTheir words are clear, but whispered.\n\n\t\t\t\tGEOFF\n\t\tMaybe he wasn't dead when we\n\t\tburied him.\n\n\t\t\t\tDREW\n\t\tHe was dead. You know he was.\n\nGeoff returns his stare to Zowie.\n\n\t\t\t\tDREW\n\t\tYou can't tell anyone, Geoff.\n\t\tEver.\n\nGeoff looks into Drew's eyes and nods in understanding.\n\n69    OMITTED\nTHRU\n75    OMITTED\n\nINT.  GEOFF'S BEDROOM - NIGHT\n\nTiger is curled up at the foot of Geoff's bed. Geoff climbs in, \ncareful not to disturb the kitten. As he lays his head back on the \npillow...\n\n\t\t\t\tVOICE (O.S.)\n\t\tSleep tight, darling. I'll be\n\t\twith you soon.\n\nIt's a woman's VOICE. A familiar one. Now we hear the rhythmic \nCREAK of a rocking chair. And with it comes the voice again, \nhumming a HAUNTING LULLABY.\n\nWide-eyed, Geoff turns his head toward the source...\n\nA WOMAN'S NONDESCRIPT FORM is seated in the rocking chair across \nthe room. Rocking forward, her face passes into a swath of \nmoonlight...\n\nIt's Renee. With the rock of the chair, her face recedes back into \nthe shadows. Her soothing HUM remains.\n\nAnd again, her face passes into the swath of light. And again it \nretreats.\n\nGeoff raises his hand, reaching out for her.\n\nRenee's hand rises from the shadows, reaching for him.\n\nBut suddenly, THE ROOM BEGINS TO STRETCH.\n\nThe rocking chair and the bed seem distanced like polar extremes, \nmother and son hopelessly separated by forces beyond their \ncontrol.\n\nLIGHTNING FLASHES in the bedside window. Renee is falling farther \nand farther away.\n\n\t\t\t\tGEOFF\n\t\tMom!!!\n\nGeoff leaps from his bed as the darkness closes in and...\n\nGEOFF\n\nbolts up from his pillow. Awake now, face wet with perspiration. \nIt was a nightmare. Except, if it was a nightmare, why do we still \nhear...\n\n...the steady CREAK of the rocking chair.\n\nGeoff slowly turns his head once again, repeating the actions of \nhis dreams.\n\nIn the shadows, the chair is still rocking. As it comes forward \ninto the moonlight, we see ZOWIE, curled up asleep on the seat of \nthe chair.\n\nTiger is not on the bed anymore. She's up on top of the bookcase \nnow, wide awake, eyes fixed on the dog. She HISSES.\n\nGeoff stares at the rocking chair, petrified.\n\nINT.  CHASE'S OFFICE - DAY\n\nChase strips off the bandage over Zowie's rear end. The wound is \ngooey and open.\n\nGeoff reads the concern in Chase's expression. Drew is right there \nat Geoff's side, looking on.\n\n\t\t\t\tDREW\n\t\tWhat's the deal?\n\n\t\t\t\tCHASE\n\t\tI don't know. He's had three\n\t\tdays. His immune system should've\n\t\tresponded by now...\n\nChase puts on his stethoscope and checks under the dog's rib-cage \nfor a pulse. He checks a number of places, then shakes his head, \ntotally confused.\n\n\t\t\t\tCHASE\n\t\tI can't seem to find a pulse... it\n\t\tmust be so weak, it's not\n\t\tregistering...\n\nGeoff and Drew share conspiratorial glances as Chase sets the \nstethoscope aside and extracts a blood sample.\n\nChase labels the capped vial of blood \"ZOWIE\" and carefully places \nit into a packing container. When he closes the lid, we see the \npreaddressed label:\n\n\t\t\tUNIVERSITY OF MAINE\n\t\tSchool of Veterinary Medicine\n\t\t\tLab Samples Enclosed\n\nUncomfortable with Chase's investigation, Geoff reaches for Zowie.\n\n\t\t\t\tGEOFF\n\t\tWe'll take him back to the\n\t\tkennels, Dad.\n\n78A   OMITTED\n\nINT.  BOARDING AREA - DUSK\n\nTHE KITTENS ARE HISSING, shrinking to the back of their kennel.\n\nZowie stands motionless before their cage, gazing in at them.\n\nGeoff and Drew are nearby, putting the finishing touches on the \nbedding inside a larger boarding kennel.\n\n\t\t\t\tGEOFF\n\t\tYou think my Dad'll figure out why\n\t\the's not getting better?\n\n\t\t\t\tDREW\n\t\tYou think he'd believe it if he\n\t\tdid?\n\nOne of the kittens SPATS fearfully at Zowie. Geoff turns to stare \nat Zowie.\n\n\t\t\t\tGEOFF\n\t\tHow can he not have a heartbeat?\n\n\t\t\t\tDREW\n\t\t\t(worried)\n\t\tMaybe it takes a while...\n\nDrew lifts Zowie into the kennel. Geoff secures the door, \nsomething that clearly must be done from the outside.\n\nZowie immediately begins to pace back and forth inside the cage. \nHe turns towards us and we...\n\n\t\t\t\t\t\t\t\tCUT TO:\n\nEXT.  TOWN, CHASE'S OFFICE - NIGHT\n\nA SNARLING WEREWOLF rushing at us.\n\nChase jumps back, frightened out of his wits and we realize...\n\nThe werewolf is part of a group of COSTUMED KIDS out trick-or-\ntreating. The kids LAUGH at Chase's reaction and hurry on, \ndragging their candy loot bags behind them.\n\nChase sighs and turns to lock the office door. He's closing up for \nthe night.\n\nHe climbs into his Mobile Vet Van. We HOLD ON the new sign in the \nback window: \"A HALLOWEEN TREAT. FREE KITTENS.\" Beneath that is a \npencil-sketch of a black arched-back kitten.\n\nINT.  GEOFF'S HOUSE - NIGHT\n\nMarjorie and Geoff are at the kitchen table with the remnants of \ndinner. Geoff is doing last-minute touches on his costume.\n\nMarjorie looks over his costume. He's got a hockey mask pushed \nback onto the top of his head.\n\n\t\t\t\tMARJORIE\n\t\tSo who're you going as, Wayne\n\t\tGretzky?\n\nFor effect, Geoff slips the hockey mask down over his face before \nanswering.\n\n\t\t\t\tGEOFF\n\t\tI'm going as Jason.\n\n\t\t\t\tMARJORIE\n\t\tJason? Who's he play for?\n\n\t\t\t\tGEOFF\n\t\tHe doesn't. He hacks people up.\n\nGeoff checks his watch.\n\n\t\t\t\tGEOFF\n\t\tI'm late.\n\nAs Geoff heads for the door, Chase is just coming in for the \nevening.\n\n\t\t\t\tCHASE\n\t\tHey! Where're you off to?\n\n\t\t\t\tGEOFF\n\t\tI'm going out, Dad!\n\nGeoff ducks out the door. Chase turns to Marjorie.\n\n\t\t\t\tCHASE\n\t\tOut?\n\n\t\t\t\tMARJORIE\n\t\tHe's probably going up to the Pet\n\t\tSematary. Kids've been going out\n\t\tthere on Halloween night for\n\t\tyears.\n\n\t\t\t\tCHASE\n\t\tWhat do they do up there?\n\n\t\t\t\tMARJORIE\n\t\tOh, you know... drink beer, tell\n\t\tghost stories. They try and spook\n\t\teach other out, talking about\n\t\tzombies and things...\n\t\t\t(she shrugs)\n\t\tIt's no big deal, Chase. I did it\n\t\twhen I was young.\n\nINT.  DREW'S HOUSE - NIGHT\n\nDrew is at the bathroom mirror.\n\n\t\t\t\tAMANDA\n\t\tHold still. Hold still.\n\nAmanda puts the finishing touches of color on Drew's lips. She's \ndone an alarmingly good job of turning Drew into THE JOKER.\n\n\t\t\t\tAMANDA\n\t\tYou make sure you're home by ten.\n\t\tIf Gus finds out I let you go...\n\n\t\t\t\tDREW\n\t\t\t(sighs)\n\t\tI'll be home, Mom. Don't worry.\n\t\tI won't let Gus blow up again...\n\nAmanda looks Drew straight in the eyes.\n\n\t\t\t\tAMANDA\n\t\tDrew, I know Gus isn't your\n\t\tfather, but you never even knew\n\t\tyour real father. He walked out\n\t\ton the both of us, and you\n\t\tremember that.\n\t\t\t(beat)\n\t\tGus isn't that way. He has it in\n\t\thim to love us both. You just\n\t\thave to give him a chance...\n\nDrew nods respectfully. Amanda gives him a kiss. Drawing back, she \nrubs out the lipmarks she's left on his made-up cheek.\n\n83    OMITTED\n\nEXT.  PET SEMATARY - NIGHT\n\nDark clouds paint the foreboding sky. A broken pulse of lightning \nstreaks through the dense haze.\n\nAbandoning their bikes next to the path, Drew and Geoff approach \nthe archway. The graveyard beyond is deathly silent.\n\nThey pass beneath the archway, entering the clearing.\n\nAnd now, a soft, chilling VOICE drifts over the graves.\n\n\t\t\t\tVOICE (O.S.)\n\t\tGeoff, honey. Mommy's here...\n\nGeoff freezes in his tracks, awestruck as...\n\nA WOMAN'S BODY\n\nswoops down from the darkness above, materializing out of nowhere. \nA fluttering negligee. Flowing blonde hair.\n\nRENEE'S FACE appears out of the shadows, masked with sadness.\n\nGeoff swallows the lump in his throat.\n\nRenee's form keeps coming. But even as she approaches, her visage \ngrows less distinguishable. Just a phantom countenance now. A \nshadow framed by golden hair, resting atop a veiled body...\n\nShe's coming so fast that she's upon Geoff in no time. He fumbles \nback, startled out of his wits...\n\nTHE BODY is upon him now, flailing wildly. Geoff thrashes and \nstruggles, screaming bloody murder.\n\nGradually, he realizes the body isn't fighting back. Geoff eases \nhis struggle, lets his scream fall off.\n\nNow he hears wild, mischievous LAUGHTER.\n\nDrew pulls the body away. It's just a heavy wad of stuffed \nclothing: A DUMMY dressed in a negligee, capped by a blonde wig. \nIt dangles near the end of a slanted wire.\n\nClyde, Stevie, Brad, and a half dozen other costumed KIDS appear \nfrom the nearby cover of bushes, doubled over in laughter.\n\nClyde tugs at a piece of twine that's connected to the back of the \ndummy's head and makes spooky sounds. The dummy jumps around on \nthe slanted wire.\n\nClyde drops the dummy and saunters forward.\n\n\t\t\t\tCLYDE\n\t\tLook at this, Junior here\n\t\tpractically shit his pants.\n\nClyde drops down, nose to nose with Geoff, who's still recovering.\n\n\t\t\t\tCLYDE\n\t\tMaybe you're too chicken to hang\n\t\tout with the rest of the boys.\n\t\tYou gonna run home to Daddy now?\n\nGeoff brushes himself off and rises to his feet. He stares into \nClyde's eyes.\n\n\t\t\t\tGEOFF\n\t\tFuck off.\n\nGeoff pushes past Clyde and moves on into the graveyard, somehow \nmanaging to keep his dignity intact.\n\nDrew follows, then the rest of the boys, leaving Clyde staring \nafter them, standing alone with the dummy.\n\nEXT.  DREW'S HOUSE - NIGHT\n\nGus' squad car slows to a stop outside. Gus swings open the door \nand ambles toward the porch.\n\nINT.  DREW'S HOUSE - NIGHT\n\nAmanda draws back from the window, mortified. She nervously \ncrosses to the refrigerator and grabs a beer, turning as Gus \nenters.\n\n\t\t\t\tAMANDA\n\t\tYou're home early.\n\n\t\t\t\tGUS\n\t\tNope. Just ran out of smokes.\n\nGus opens a kitchen drawer and fishes for a pack of cigarettes. He \nfires one up.\n\n\t\t\t\tGUS\n\t\tWhere's the boy?\n\nAmanda squirms.\n\n\t\t\t\tAMANDA\n\t\tUh... in his room...\n\nGus tightens his brow, casting a suspicious eye.\n\nA sickened look flushes through Amanda as Gus pulls his eyes away \nfrom her and marches upstairs.\n\n\t\t\t\tGUS (O.S.)\n\t\tDREW!\n\nHis feet POUND down the hallway. Silence for an instant. Then the \npowerful swing of Drew's door. Followed by Gus' hastened return \ndown the hallway. And as he hustles down the stairs...\n\n\t\t\t\tGUS\n\t\tGod damn it, Amanda! You want me\n\t\tto be a father to the boy, and as\n\t\tsoon as I lay down the law, you\n\t\tlet him break it!\n\nGus stops before Amanda.\n\n\t\t\t\tGUS\n\t\tWhere is he?\n\nOne step away from terror, Amanda shakes her head. Gus loses his \npatience. He rips the can of beer from her grip and sends it \nflying across the room.\n\n\t\t\t\tGUS\n\t\tWHERE IS YOUR SON!?\n\nAmanda sighs in quiet defeat.\n\n\t\t\t\tAMANDA\n\t\tThe Pet Sematary.\n\nGus turns away and heads out the door.\n\nEXT.  DREW'S HOUSE - NIGHT\n\nWheels spin as Gus' squad car streaks off into the night. The \ncherry top glows to life, bombarding the countryside.\n\nEXT.  PET SEMATARY - NIGHT\n\nBy now, nearly TWO DOZEN COSTUMED KIDS have gathered at the Pet \nSematary. In the midst of the graves, a small story-telling \ncampfire burns. A number of the boys sip beer, trying to pretend \nthat the bitter after-taste doesn't bother them.\n\nClyde sits up front. At fourteen, he's the elder statesmen of the \ngroup. With a beer in one hand, and a cigarette in the other, \nClyde is just finishing up a spooky yarn.\n\n\t\t\t\tCLYDE\n\t\t...yeah, that old Louis was one\n\t\tsick fuck... digging up little Gage\n\t\tlike so, maggots pouring out of\n\t\tthat kid's eyes...\n\nClyde whistles. He drags on his cigarette and puffs out a smoke \nring. Sees he still has an audience.\n\n\t\t\t\tCLYDE\n\t\tEllie was the only Creed that\n\t\tlived. Then one night a few\n\t\tmonths later, Ellie freaks out,\n\t\tand she hacks up her grandparents\n\t\twith an axe!\n\t\t\t(beat)\n\t\tPolice found her licking their\n\t\tbrains off the blade... They\n\t\tlocked her up in a psycho ward and\n\t\tall she said were two words: 'Pet\n\t\tSematary. Pet Sematary.'\n\nClyde stares at the wide-eyed kids. He grins, takes a swig of \nbeer, and moves in for the kicker.\n\n\t\t\t\tCLYDE\n\t\tOh yeah! Almost forgot! Here's\n\t\tthe best part. Two nights ago she\n\t\tescapes. Word is, she was heading\n\t\tfor Maine. Man I hope she doesn't\n\t\tshow up out here.\n\t\t\t(feigning concern)\n\t\tShit, we wouldn't even notice her,\n\t\tnot if she's wearing a costume.\n\t\tShe could be one of us...\n\nClyde casts a suspicious eye on the group. The kids uneasily look \nat each other, making sure they know who's behind each and every \ncostume.\n\nSuddenly Clyde drops his jaw in exaggerated horror.\n\n\t\t\t\tCLYDE\n\t\tOh my Goddd!!!\n\nClyde lifts a trembling finger, pointing beyond the group of \nspellbound listeners.\n\n\t\t\t\tCLYDE\n\t\tIt's... It's...\n\nThe kids are afraid to turn around, assuming Clyde's rigged up \nsome unspeakable terror...\n\nAnd for an instant, a look of real horror washes over Clyde's \nface...\n\nA FIGURE\n\nIs coming up the path beneath the archway, rising out of the \nswirling mist. A frightening silhouette, backlit by the moon.\n\nBut then Clyde realizes who it is.\n\n\t\t\t\tCLYDE\n\t\tShit! It's Drew's Dad. It's\n\t\tfuckin' Gus!\n\nDrew and the others quickly turn around, realizing it's not part \nof the punch-line scare.\n\n89    OMITTED\nTHRU\n91    OMITTED\n\nEXT.  PET SEMATARY - NIGHT\n\nThe kids quickly scramble for hiding places in the bordering \nbrush, dropping their beer cans as fast as they can.\n\nAs Drew leaps to his feet, he upsets the fire, knocking one of the \nlogs. A FLAMING EMBER rolls to the base of one of the brittle old \ncrosses.\n\nDrew and Geoff run for it.\n\nEXT.  PATH, ARCHWAY - NIGHT\n\nGus moves quickly up the meandering path, sending the blinding \nbeam of his flashlight over the graves.\n\n\t\t\t\tGUS\n\t\tYou boys better not be drinking!\n\nEXT.  PET SEMATARY - NIGHT\n\nThrough the thick woods, Drew is flanked by Geoff and Clyde.\n\n\t\t\t\tDREW\n\t\tOh man, he's gonna kick my ass...\n\nDrew starts to take off. Clyde trips him on his first stride. Drew \nhits the dirt.\n\n\t\t\t\tCLYDE\n\t\tThanks for fucking up our\n\t\tHalloween, dumbshit!\n\nClyde recedes into the woods as Gus approaches the campfire. He \nscans the area with his flashlight, illuminating the various beer \ncans.\n\n\t\t\t\tGUS\n\t\tDrew, you get your ass out here!\n\t\tFront and center!\n\nGeoff pulls Drew to his feet.\n\nGus passes the flashlight over the woods. Kids duck away, \nretreating from their hiding places...\n\nThe flashlight sweeps toward Drew.\n\nDrew freezes, spotlighted by Gus' beam. A burst of LIGHTNING \nfloods Drew's horrified face.\n\n\t\t\t\tGUS\n\t\tGet out here, Joker.\n\nGeoff remains frozen in the woods nearby, out of Gus' light.\n\nBehind Gus, the wooden cross is completely on fire now.\n\n\t\t\t\tGUS\n\t\tYou out here making a fool of me?\n\nDrew shakes his head in instant denial.\n\n\t\t\t\tGUS\n\t\tI'm warning you, buddy! You don't\n\t\tplay by the rules, I'm gonna\n\t\tshadow your ass for eternity!\n\nDrew makes a break from his spot in the woods. He weaves through \nthe markers, arcing around the outer perimeter to avoid Gus...\n\n...but Gus is quicker. He zigzags through the crosses and \nheadstones to intercept Drew.\n\nGus gets a handful of Drew's collar and yanks him in.\n\n\t\t\t\tGUS\n\t\tYou little shit!\n\nGus draws his free arm back and smacks Drew across the face. Drew \ngoes down.\n\nGEOFF\n\nis looking on from the woods, horrified. Torn...\n\nDREW\n\ncowers on the ground, trying to scramble away.\n\nGeoff bolts out into the firelight, staring defiantly at Gus in \nsilent accusation.\n\nGus is beyond furious. LIGHTNING flashes again.\n\n\t\t\t\tGUS\n\t\tYou get out of here, Geoff\n\t\tMatthews! This is between me and\n\t\tmy boy!\n\nGeoff doesn't move. Gus starts to advance forward...\n\n...but the GROWL emanating from the woods gives him pause. \nEveryone turns...\n\nA RUSTLING is heard in the bushes, and Zowie emerges into the \nbuilding firelight, flashing his fangs at Gus. His eyes GLOW RED.\n\nGus freezes, studying Zowie.\n\nZowie inches forward, poised for the attack.\n\n\t\t\t\tGUS\n\t\tCall off your dog, Drew.\n\nDrew shifts his eyes from Zowie to Gus, too terrified to heed such \na command.\n\nZowie brushes past Drew and Geoff, moving in on Gus.\n\nGus' eyes shift to burning cross at his side. With a swift boot, \nhe kicks over the cross and presses it into his grip.\n\nSwinging the cross like a primitive weapon, Gus connects with the \nside of Zowie's head.\n\nZowie spins a full circle from the impact. But he lands on all \nfours. Unphased. Taking the next step toward Gus. There's \nsomething clearly not of this world in Zowie's vicious stare.\n\n\t\t\t\tGUS\n\t\t\t(terrified)\n\t\tDrew, call him off!\n\nAll Drew can manage is a faint appeal.\n\n\t\t\t\tDREW\n\t\tZowie...\n\nZowie goes for Gus, launching into the air...\n\n\t\t\t\tGUS\n\t\tDREW!\n\n...and sinking his glistening fangs into Gus' neck.\n\nAN ERUPTION OF BLOOD showers the closest headstone.\n\nGus comes helplessly tumbling down with the weight of the dog. His \nSCREAMS are suddenly cut short as Zowie rips out his throat. His \narms flail weakly at his sides, then grow still.\n\nDrew and Geoff stare at the scene, wide-eyed with shock.\n\nZowie looks up from Gus' neck with dripping, red fangs. For a \nmoment, his eyes settle on Drew. Then Zowie bolts off, \ndisappearing into the night.\n\n\t\t\t\tDREW\n\t\tOh, God. Oh, God...\n\nDrew's eyes shift to Geoff, whose face is flushed with sickened \nfear.\n\n\t\t\t\tGEOFF\n\t\t\t(a whisper)\n\t\tIs he dead?\n\nIn dazed shock, Drew moves in for a closer look at the body.\n\nGus' eyes are wide open. Blood is still pumping in rhythm from his \njugular with each weakening beat of his heart. It's a gruesome \nimage against the roaring fire.\n\nDrew kneels at Gus' side. He wants to touch him. To shake him \nawake, but with every attempt, he draws his hand back.\n\n\t\t\t\tGEOFF\n\t\tIs he breathing? Can you hear him\n\t\tbreathing?\n\nDrew leans forward, turning his ear toward Gus' gaping mouth. And \nas he inches closer...\n\nGUS' FINGERS TWITCH\n\nHis hand jerks up and closes around Drew's neck. Gus stares up at \nhim with his crazed menace.\n\nDrew SCREAMS. His fingers claw at Gus' hand, desperate to pry it \nloose...\n\n...but then, Gus' hand relaxes as his last, dying ounce of \nstrength fades away.\n\nDrew shrinks back, crouching over the lifeless body as the blazing \nfirelight dances over it. He turns his tear-filled gaze to Geoff.\n\n\t\t\t\tDREW\n\t\tOh man, Geoff... we killed him...\n\t\twe killed him...\n\t\t\t(beat)\n\t\tWhat're we gonna do?\n\nGeoff draws closer and looks down into the dead man's face.\n\n\t\t\t\tGEOFF\n\t\tWe could bring him back.\n\nDrew's eyes widen at the suggestion.\n\nAnd now, GAZING DOWN on Gus' body, and on the boys, WE PULL UP \nINTO A SLOW SPIRAL...\n\nWe move ever higher, until we are LOOKING DOWN UPON THE ENTIRE PET \nSEMATARY. At the SOUND of a shovel cutting into rocky soil, we...\n\n\t\t\t\t\t\t\t\tCUT TO:\n\n95    OMITTED\n\nEXT.  MICMAC BURIAL GROUND - NIGHT\n\nThree quick shots:\n\nA SHOVEL sinking into the earth.\n\nGUS falling head down into the grave, landing with a heavy THUD.\n\nSOIL covering Gus' lifeless face.\n\nEXT.  DREW'S HOUSE - NIGHT\n\nAmanda is pacing back and forth on the porch, checking her watch \nevery few steps. She sighs with relief as...\n\nDrew appears from the darkness of the woods.\n\nDrew dismounts his bike and carries it up the front porch steps, \nstrangely silent. His clothes and face are caked with dirt.\n\n\t\t\t\tAMANDA\n\t\tJesus, Drew, do you know what time\n\t\tit is? Did Gus ever find you?\n\nDrew moves on past her into the house.\n\n\t\t\t\tAMANDA\n\t\t\t(calling after him)\n\t\tDrew? Drew, what happened?\n\n\t\t\t\tDREW\n\t\t\t(trying not to lose\n\t\t\tit)\n\t\tNothing happened, Mom. We just\n\t\tditched Gus, that's all...\n\nDrew pauses and stares out into the unknown darkness of the night.\n\nINT.  GEOFF'S HOUSE - NIGHT\n\nChase is in the study, perusing some files. He looks into the \nhallway as Geoff arrives home, then glances at the clock. It's \nlate. Very late.\n\nChase rises. He's both angry and relieved. Right now, though, the \nanger's winning out.\n\n\t\t\t\tCHASE\n\t\tWere you drinking?\n\nGeoff absently shakes his head. He slumps back against the wall, \ndrained from the night's horrors.\n\n\t\t\t\tCHASE\n\t\tDrew's Mom called hours ago, the\n\t\trest of the kids were back by ten.\n\t\tWhere the hell were you boys?\n\nGeoff shrugs, trying to mask his uneasiness.\n\n\t\t\t\tGEOFF\n\t\tJust out.\n\n\t\t\t\tCHASE\n\t\t\"Out.\" Well that's great, Geoff.\n\t\t\t(beat)\n\t\tLook, I've been letting you get\n\t\taway with a lot these past few\n\t\tweeks, but I'm not going to stand\n\t\tfor crap like this. I don't care\n\t\tif it's Halloween... it's a school\n\t\tnight, and if you do this again...\n\n\t\t\t\tGEOFF\n\t\t\t(cutting him off)\n\t\tI'm really tired, Dad... can I just\n\t\tgo to sleep?\n\nChase stops and looks at his son. Geoff's exhaustion is self-\nevident.\n\n\t\t\t\tCHASE\n\t\t\t(sighing)\n\t\tGo on... we'll talk about this in\n\t\tthe morning.\n\nGeoff nods and heads for the stairs.\n\nINT.  GEOFF'S ROOM - NIGHT\n\nTHE CLOCK is creeping up on 2AM...\n\nTHUNDER rumbles outside in the distance and rain starts to spatter \nthe window panes.\n\nGeoff's eyelids fall beneath unbearable weight and he nods off to \nsleep. Tiger is sprawled out on the blanket against his chest. \nSlowly, we move back towards the window...\n\nIn a flash of LIGHTNING--\n\nGUS' FACE\n\nAPPEARS OUTSIDE. Washed in the haunting white glow. Streaked with \nmud. Caked with blood. Staring in at Geoff.\n\nGeoff is jolted awake by the delayed clap of THUNDER and whips his \ngaze to the window. Before he can focus...\n\n...the pulse of lightning fades away. And with it, Gus' face. Only \ndarkness remains beyond the window pane.\n\nGeoff returns his gaze to the bedroom, unaware of Gus' appearance. \nHe sinks back to his pillow, already hurtling towards sleep once \nmore.\n\nEXT.  DREW'S HOUSE - NIGHT\n\nMOVING IN ON the house, WE SINGLE OUT a rain-obscured window on \nthe ground floor, the window to Drew's bedroom.\n\nINT.  DREW'S ROOM - NIGHT\n\nDrew is sound asleep, curled up under the sheets. He clutches his \npillow like a life preserver.\n\n\t\t\t\tGUS (O.S.)\n\t\tDrew!\n\nDrew's eyes flutter open. He turns towards the window. Now, he \nhears some activity outside. And then Gus' hushed voice.\n\n\t\t\t\tGUS (O.S.)\n\t\tDrew, buddy. I lost my keys.\n\nDrew goes saucer-eyed. He swallows the swelling lump in his throat \nand rises from his bed.\n\nINT.  KITCHEN - NIGHT\n\nDrew steadies his quivering fingers just enough to sink the key \ninto the deadbolt on the back door. Drawing the CREAKING door \nopen, he gazes out back.\n\n\t\t\t\tDREW\n\t\t\t(scared shitless)\n\t\tGus?\n\nNothing moves outside. The longer Drew watches, the more eerie \neach shadow becomes. Spooked, Drew steps back inside, quickly \nclosing the door. He locks it back up again.\n\nWhen he turns around, he's face to face with GUS.\n\nDrew stiffens, backing into the wall.\n\n\t\t\t\tDREW\n\t\tH-how'd you get in?\n\nGus offers a nightmarish grin and raises his hand, dangling his \nkeys.\n\n\t\t\t\tGUS\n\t\tFound 'em.\n\nDrew's eyes follow a flow of blood from Gus' neck to the floor. \nGus looks down at his dirty, bloody footprints. He's tracked blood \nall over the linoleum.\n\n\t\t\t\tGUS\n\t\tI'm makin' a mess of your mother's\n\t\tkitchen floor...\n\t\t\t(beat)\n\t\tI need a shower...\n\nGus turns without another word and heads for the stairs.\n\nDrew's mouth drops in utter astonishment as he watches Gus \nclumsily climbing the stairs.\n\nAfter a moment, he returns his attention to the bloody kitchen \nfloor. Tearing off a wad of paper towels, he wets them and begins \nto mop up Gus' tracks.\n\n103   OMITTED\n\nAT THE MIRROR - NIGHT\n\nGazing vacantly at his reflection, Gus covers his ravaged throat \nwith a gauze strip, wrapping it around the circumference of his \nneck again and again and again.\n\nBehind him, the shower is running, filling up the bathroom with \nsteam.\n\nFinishing the dressing off with a sloppy tape job, Gus reaches for \nthe pajamas hanging nearby. He lazily buttons the buttons, failing \nto notice their alignment is off. He never did bother to shower. \nHe's still covered with mud.\n\nINT.  AMANDA AND GUS' BEDROOM - NIGHT\n\nGus enters from the steamy bathroom. The shower is still running.\n\nAmanda stirs, sleepy eyes focusing on him.\n\n\t\t\t\tAMANDA\n\t\tGus, hon. I'm sorry about\n\t\ttonight. You coming to bed?\n\nGus lifts the covers and climbs in. With him comes the chill of \ndeath. Gus presses up behind her. His hand moves beneath the \nsheets, finding its way over the curve of her waist, caressing. \nAmanda shivers.\n\n\t\t\t\tAMANDA\n\t\tGod, you're ice cold...\n\t\t\t(turning)\n\t\t...and you smell! Lord, what did\n\t\tyou get yourself into?\n\nIt's then that Amanda sees the bandage around Gus' neck. Blood is \nseeping through the gauze.\n\n\t\t\t\tAMANDA\n\t\tMy God, Gus, what happened?\n\nAmanda reaches out to touch him, but Gus stops her hand short of \nthe bandage. Instead, he leans forward and clutches one of her \nbreasts.\n\nAmanda tries to twist away.\n\n\t\t\t\tAMANDA\n\t\tGus... stop it! What's wrong with\n\t\tyou?!\n\nBut Gus doesn't stop. He throws himself on top of Amanda, roughly \nforcing her back onto the bed.\n\n\t\t\t\tAMANDA\n\t\tGus!!!\n\nAmanda's hands beat at Gus' face and back, to no apparent effect. \nWith one arm forced against Amanda's throat, he rips open her \nnightgown with the other.\n\nWe pull away from Amanda's struggles, back to the bathroom. The \nshower running on and on, cloaking the bedroom in steam.\n\nEXT.  ROAD - DAY\n\nGeoff is riding along the highway, his backpack full of school \nbooks. Drew is waiting on the shoulder ahead. When Geoff \napproaches, Drew hops on his bike, getting up to speed.\n\nWITH THE BOYS - RIDING\n\nGeoff keeps glancing at Drew, waiting for him to say something. \nDrew maintains his enigmatic expression.\n\n\t\t\t\tGEOFF\n\t\tWell?\n\nDrew nods. Geoff's eyes widen in disbelief.\n\n\t\t\t\tDREW\n\t\tPicture this... Gus comes down to\n\t\tbreakfast and he doesn't say a\n\t\tword. He even kind of smiles,\n\t\tlike he forgot he hates me. And\n\t\tthen you know what he does? He\n\t\tserves me an extra helping of\n\t\tpancakes...\n\t\t\t(beat)\n\t\tI asked him if I was still\n\t\tgrounded... \"no.\" I asked him if\n\t\tyou could spend the night, and he\n\t\tnods. It's like we're a family.\n\t\tA real family.\n\nThe words have their own meaning for Geoff, who stares to the road \nahead in deep thought.\n\n\t\t\t\tDREW\n\t\tIt's weird...\n\n\t\t\t\tGEOFF\n\t\tWhat do you mean?\n\n\t\t\t\tDREW\n\t\tIt's like he's not Gus anymore.\n\t\tHe's different. You know, like\n\t\tZowie...\n\nThey share a chuckle that ends in silent uneasiness.\n\nINT.  CHASE'S OFFICE - DAY\n\nChase enters with a stack of files tucked under his arm. As he \norganizes them in the large filing cabinet with the others, he \nlistens to his messages on the answering machine.\n\nThe current caller sounds a little annoyed...\n\n\t\t\t\tMESSAGE MACHINE\n\t\t...Doctor Matthews, this is\n\t\tElliot Rudman at the university.\n\t\tI've looked over the blood\n\t\tspecimen you sent us on canine\n\t\tZowie...\n\nChase abandons the filing and immediately returns the call. While \nit RINGS...\n\n\t\t\t\tVOICE (O.S.)\n\t\tKnock, Knock, Doc.\n\nA MOTHER and TWO TODDLERS are standing in the doorway to Chase's \noffice, trying not to intrude on his call.\n\n\t\t\t\tMOTHER\n\t\t\t(quiet whisper)\n\t\tWe saw your sign. Are there any\n\t\tkitties left?\n\nChase studies them. They look like decent people.\n\n\t\t\t\tCHASE\n\t\tTake your pick. They're in the\n\t\tboarding area. You can go on\n\t\tback.\n\nChase turns away as his phone call is answered.\n\n\t\t\t\tCHASE\n\t\tElliot, it's Chase...\n\nINT.  LAB/INT.  CHASE'S OFFICE (INTERCUT) - DAY\n\nELLIOT RUDMAN has the phone tucked under his chin, in the midst of \nan autopsy. The WHIRR of the saw drowns out his words as he shaves \nthe dome off a dog's skull.\n\n\t\t\t\tCHASE\n\t\tI didn't get that...\n\nThe pathologist turns off the saw. His words become audible.\n\n\t\t\t\tRUDMAN\n\t\t...I said next time it might help\n\t\tif you took the blood sample while\n\t\tthe animal was still alive...\n\nThe comment hits Chase out of left field.\n\n\t\t\t\tCHASE\n\t\tWhat?\n\n\t\t\t\tRUDMAN\n\t\tI don't know what you expected to\n\t\tfind, Matthews. There's nothing\n\t\twrong with the antigens, nothing\n\t\tto indicate an unusual death...\n\n\t\t\t\tCHASE\n\t\tWait, there must be some mix-up.\n\t\tHe was... the dog is alive.\n\n\t\t\t\tRUDMAN\n\t\tNot this dog. There wasn't enough\n\t\toxygen in those red cells to pump\n\t\tlife into a flea.\n\nChase is baffled, speechless.\n\n\t\t\t\tRUDMAN\n\t\tYou took over for Doctor Yolander?\n\n\t\t\t\tCHASE\n\t\tYes... why?\n\n\t\t\t\tRUDMAN\n\t\tBecause the last person that sent\n\t\tme blood from a dead animal was\n\t\tYolander...\n\n110   OMITTED\nTHRU\n112   OMITTED\n\nINT.  BOARDING AREA - DAY\n\nThe kennels have been cleaned up, but the room retains its eerie, \ndimly lit quality.\n\nThe DRIP of a faucet reverberates from the far corner.\n\nThe mother enters with a toddler clinging to each hand. Their \nsmiles fade at the unsettling surroundings. Slowly, they move down \nthe row of kennels.\n\n\t\t\t\tTODDLER\n\t\tWhere are the kitties?\n\nINT.  CHASE'S OFFICE - DAY\n\n\t\t\t\tCHASE\n\t\t\t(into the phone)\n\t\tLook, this is ridiculous...\n\nSuddenly, BLOOD-CURDLING SCREAMS pierce the air. Chase drops the \nphone and rushes out of the office...\n\nINT.  BOARDING AREA - DAY\n\nThe toddlers are screaming at the top of their lungs. Mom is \nburying their heads in her dress.\n\nChase bursts in as the mother hastily retreats for the exit. Her \nhorrified eyes flash by Chase. In an instant, she and the toddlers \nare gone.\n\nChase remains alone, moving down the long row of kennels with \nmounting trepidation...\n\nZowie's cage is empty.\n\nChase shifts his troubled gaze to the...\n\nDRIP DRIP DRIP... as a PUDDLE OF BLOOD forms on the floor.\n\nChase raises his eyes...\n\nTHE KITTENS' KENNEL -\n\nNothing but bloody ribbons of torn flesh are left of the kittens, \ndangling from the grid gate. DRIPPING.\n\nChase looks away as a new level of fear runs through him.\n\n\t\t\t\tCHASE\n\t\tJesus...\n\nIt's too gruesome even for a man of Chase's background. Fighting \nthe gag reflex, he searches the room for the missing dog...\n\n...and then he spots the broken glass window vent along the floor. \nAnd the pile of blood-spattered shards laying on the tile.\n\nEXT.  SCHOOL, STREET - DAY\n\nClyde, Stevie, and Brad are loitering near the front bike racks. \nClyde's smoking away.\n\nAs Geoff and Drew come out of the school, the trio moves to \nintercept them.\n\n\t\t\t\tCLYDE\n\t\tHey!\n\nJust then, Chase's van pulls at the curb, interrupting whatever \ntrouble was about to happen.\n\nClyde looks from the van to Geoff, and falls back.\n\n\t\t\t\tDREW\n\t\tSaved by the bell...\n\nChase hurriedly rolls down the passenger window as Geoff and Drew \napproach.\n\n\t\t\t\tGEOFF\n\t\tCan I sleep over at Drew's\n\t\ttonight?\n\nChase is preoccupied with other concerns.\n\n\t\t\t\tCHASE\n\t\tYeah... that's fine...\n\t\t\t(beat)\n\t\tListen, Drew, I got the tests back\n\t\ton Zowie. He's not well. Don't\n\t\task me how, but he got out this\n\t\tafternoon...\n\nGeoff and Drew exchange concerned looks.\n\n\t\t\t\tCHASE\n\t\tIf he finds his way home, call me,\n\t\tno matter what the hour, okay? And\n\t\tdon't try to approach him.\n\t\tWhatever he's got might be \n\t\tinfectious. Understand?\n\nThe boys nod their heads.\n\nChase masks his anxiety with a weary smile. With a wave, he speeds \nup, leaving the boys.\n\nINT.  CHASE'S VAN - MOVING\n\nA MAP of Maine is unfolded on the passenger seat. Chase is on the \ncar phone.\n\n\t\t\t\tCHASE\n\t\tCan I have the address for Quentin\n\t\tYolander?\n\nChase jots an address down on the map. He turns the van up a \nmountain road, winding through the towering pines.\n\nEXT.  YOLANDER'S CABIN - DAY\n\nA remote, rustic dwelling nestled into the desolate backwoods.\n\nINT.  YOLANDER'S CABIN - DAY\n\nQUENTIN YOLANDER rocks back in his thick hide chair. His world is \nclosed off from daylight by the extensive blinds.\n\nHe's holding a SMALL POODLE in his lap. Its big brown eyes are \nstaring back at him.\n\n\t\t\t\tYOLANDER\n\t\tYou'd be so much more interesting\n\t\twith blue eyes...\n\nAnd now, ONE OF THE POODLE'S EYES POPS OUT. Yolander's finger \ncomes through from beneath the eye socket.\n\nOn closer examination, WE REALIZE that the dog is not alive at \nall. Yolander has his hand inside the hollowed-out carcass.\n\nHe carefully looks over a container of glass eyes on his desk and \nselects the right shade of blue. A shot of whiskey rests nearby.\n\nYolander reaches up into the poodle's belly and fits the blue eyes \nsecurely into place.\n\nThere's a KNOCK at the door. Yolander ignores it. Maybe he's deaf. \nAnother KNOCK. Yolander turns towards the door, annoyed at the \nintrusion. And behind that annoyance, there's a touch of madness.\n\nPULLING BACK, we see the rest of the room. Stuffed animals are \ncrowded from floor to ceiling. A product of Yolander's obsession \nwith TAXIDERMY.\n\n\t\t\t\tYOLANDER\n\t\tI'm immortalizing a poodle. State\n\t\tyour business!\n\nYolander presses some stuffing into the poodle's gut and begins to \nsew up the stomach.\n\n\t\t\t\tCHASE (O.S.)\n\t\tDoctor Yolander. This is Chase\n\t\tMatthews. I've moved into your\n\t\toffices in Ludlow...\n\nYolander's attention remains on the needle as he meticulously \nstitches the belly.\n\n\t\t\t\tCHASE (O.S.)\n\t\t\t(continuing)\n\t\t...I sent a blood sample out for\n\t\tanalysis. They tell me I sent\n\t\tthem the blood of a dead animal...\n\nAt this, Yolander breaks his concentration. The needle pricks his \nhand. Blood oozes from the puncture, dripping onto the dog's \nstomach.\n\n\t\t\t\tCHASE (O.S.)\n\t\t...a dog...\n\nYolander rises from his seat and swings open the door.\n\nChase stands in the doorway, startled. It doesn't take a genius to \nfigure out that the good Doctor is drunk.\n\n\t\t\t\tYOLANDER\n\t\t\t(glaring)\n\t\tWhy are you bothering me about\n\t\tthis? Can't you leave it be?\n\n\t\t\t\tCHASE\n\t\tI... um...\n\nChase glances to the right and steps back...\n\nA BOBCAT\n\nis perched nearby, frozen in mid-pounce. It takes a second for \nChase to register that the bobcat has been stuffed.\n\nNow Chase sees the rest of the room... a whole zoo of stuffed \nanimals, looking like a rural version of the Bates Motel.\n\n\t\t\t\tCHASE\n\t\t\t(momentarily thrown)\n\t\t...the pathologist... he said that\n\t\tyou had reported a similar \n\t\tincident... with a cat...\n\n\t\t\t\tYOLANDER\n\t\tThe Creed cat, that's right.\n\t\tBastard's name was \"Church\".\n\t\t\t(grins)\n\t\tLet me guess. Your dog's tissue\n\t\tisn't healing, pupils aren't\n\t\tdilating... maybe you can't find a\n\t\theartbeat?\n\n\t\t\t\tCHASE\n\t\tExactly! I thought it might be\n\t\tsome sort of blood condition...\n\t\timmune deficiency or...\n\nQuentin Yolander laughs. It's disconcerting.\n\n\t\t\t\tYOLANDER\n\t\tThere's no \"blood condition.\" The\n\t\tdog isn't sick, it's dead.\n\t\t\t(drawing closer)\n\t\tAnd so was Creed's cat. And so\n\t\twas his wife the night she was\n\t\tkilled for the second time...\n\nAs Yolander moves forward, Chase backs up. He bumps into a whole \nshelf of stuffed creatures. To his right, A RAVEN sits frozen on \nits perch. Chase regards Yolander as being completely insane.\n\n\t\t\t\tYOLANDER\n\t\t\t(menacing)\n\t\tYou want some advice, friend? You\n\t\tget in your car, you pick up your\n\t\tfamily... and you get the hell out\n\t\tof that town.\n\n\t\t\t\tCHASE\n\t\tWell... uh... thanks...\n\nChase continues to back out of the door. On his way out, he bumps \ninto the stuffed raven's perch...\n\n...only this raven isn't stuffed. It spreads its wings and \nSCREECHES.\n\nChase just about jumps out of his skin, tripping out of the \ndoorway.\n\n116D  OMITTED\nTHRU\n116F  OMITTED\n\nEXT.  DREW'S HOUSE - NIGHT\n\nGus reaches into the cage and grabs a rabbit by the ears. He \ncasually snaps the neck. Laying the limp carcass on a stump \ncutting board, he quickly skins it.\n\nHanging above the cages, there is now a line of furry pelts. Half \na dozen.\n\nDrew and Geoff are on the porch, looking on.\n\n\t\t\t\tDREW\n\t\tI guess we're having rabbit for\n\t\tdinner.\n\nGus hangs the freshly skinned fur to dry and violently snatches \nanother hare from the cage.\n\nINT.  DREW'S HOUSE - NIGHT\n\nThe dinner from Hell. Geoff splats a helping of mashed potatoes \nonto his plate, all the while keeping a wary eye on Gus...\n\nGus is serving himself a chunk of rabbit. It hits the edge of the \nplate, teetering on the rim. He passes the dish on.\n\nGus meets Geoff's gaze. For a moment, there's a deadened, vacant \nlook in Gus' eyes. Then slowly, a limp smile creeps over him, \nsending a chill up Geoff's spine.\n\nGeoff averts Gus' stare. Gus helps himself to potatoes and passes \nthe plate on. He lets go of it short of reaching Drew. Only Drew's \nquick hands save it from hitting the table.\n\nAmanda comes to the table with a dish of LIMA BEANS. She casts Gus \na cold, hateful stare and sets the limas down. She's still angry \nover last night.\n\nGus dishes a sloppy scoop and passes it toward Drew. Like before, \nhe lets it drop too early. This time Drew doesn't save it. The \nlima beans shower the floor.\n\n\t\t\t\tAMANDA\n\t\tGod damnit, Gus! This isn't\n\t\tfunny!\n\nAmanda fetches a dishtowel and kneels to clean up the mess.\n\nGeoff and Drew exchange quick glances. As Geoff reaches for the \nsalt...\n\n...Gus intercepts his wrist. Geoff gulps.\n\nGus drops his jaw, revealing a gooey mass of food. But the frozen \nsmile and the look in his eyes convey dementia rather than \nplayfulness.\n\nGeoff and Drew can't believe their eyes. They laugh uncomfortably. \nThere's no other response.\n\nGus LAUGHS too... awkward, terrible laughter. Spitting out food \nover his shirt and plate as he does so.\n\nThe boys stop laughing, but Gus just keeps on going.\n\nAmanda stares at Gus and carries the mess out of the room.\n\nThrough his laughter, Gus' bandage has slipped down, exposing part \nof his ragged wound. The wound glistens, oozing CLOTTED BLOOD and \nGOOEY PUS.\n\nDrew hesitantly reaches for Gus' neck, readjusting the bandage.\n\nGrossed out, Geoff averts his eyes and sets his fork aside.\n\nINT.  DREW'S ROOM - LATER\n\nGeoff and Drew enter. Drew swiftly secures the deadbolts on his \ndoor.\n\n\t\t\t\tGEOFF\n\t\tWhat was that all about? You\n\t\tthink he's trying to scare us?\n\n\t\t\t\tDREW\n\t\tI don't know but I'm not taking\n\t\tany chances...\n\nDrew opens the chest at the foot of his bed and produces a \nSHOTGUN. A box full of shells spill as he withdraws the gun. \nCracking open the chamber, Drew loads two shells into the chamber.\n\nEXT.  COUNTRYSIDE - NIGHT\n\nA moonlit horizon. Unmoving. Silent. The kind of silence that \npulls at the darkest recesses of imagination.\n\nAnd now, A LONE FIGURE appears on the horizon. It's Zowie, moving \nat a deliberate pace.\n\nATOP A KNOLL\n\nZowie takes pause. The TINKLING of his collar tags resumes as he \ndrops over the horizon line, cutting down the hill.\n\nINT.  CHASE'S HOUSE - NIGHT\n\nChase sits in the den, looking exhausted and disheveled. In front \nof him, the t.v. is on. RENEE'S FACE stares out at us. Chase hits \nthe remote and rises, moving to the back door.\n\nHe checks the deadbolt, then secures the chain link as a backup. \nFrom somewhere outside, we hear a DOG HOWL.\n\nChase's eyes drop to the DOGGY DOOR, a holdover from the previous \nowner. Chase bends down and latches the door.\n\nNow he pauses at his desk... considers... then pulls something out \nof the bottom drawer. It's a gun.\n\nINT.  HALLWAY - NIGHT\n\nChase moves to the front of the house, securing that door. \nSatisfied, he turns off the light and heads upstairs...\n\nWE STAY AT THE FOOT OF THE STAIRS -\n\nMOVING INTO DARKNESS, shadow and form begin to take shape. We hear \na low GROWL and see a flash of RED EYES. It's Zowie. Already in \nthe house.\n\n123   OMITTED\n\nINT.  CHASE'S BEDROOM - NIGHT\n\nComing through the door from the downstairs, Chase stops cold.\n\nRENEE is on the bed. Clothed in a negligee. Lying across a blanket \nof rose petals. Her eyes meet his with powerful longing.\n\n\t\t\t\tRENEE\n\t\tChase. I miss you so much...\n\n\t\t\t\tCHASE\n\t\t\t(dry-mouthed)\n\t\tRenee...\n\nChase approaches. Slowly. Fearful that this is all a dream.\n\nRenee reaches out her hand. They touch. This is not a dream.\n\n\t\t\t\tCHASE\n\t\tOh God...\n\nChase absently sets his gun on the bedside table as Renee draws \nhis body to hers.\n\nThey kiss. Once. Twice. Not a dream.\n\nRenee rolls Chase over, forcefully climbing on top. Chase sinks \ndown into the center of the bed as Renee straddles him.\n\nSlowly, Renee slips off the top of her negligee...\n\n\t\t\t\tRENEE\n\t\t\t(a whisper)\n\t\tI can come back, Chase...\n\n...and sinks down on top of him, kissing him hungrily.\n\nHer nipples graze his chest, then her breasts flatten as she \ngrinds her hips against his.\n\nAlmost instantly, the weight of her grows unbearable. Chase fights \nto pull his mouth from hers, to breathe...\n\n\t\t\t\tCHASE\n\t\tNo... Too heavy.\n\nThere is no pleasure in his words, just unmitigated horror as \nRenee's body comes down on him harder.\n\n\t\t\t\tCHASE\n\t\t...can't breathe... I can't...\n\nCHASE'S EYES\n\npop open, frenzied, AS HE COMES OUT OF HIS DREAM.\n\nChase is alone on the bed, but he's still feeling the weight \npressing down on him...\n\nZOWIE\n\nis laying on his chest, staring back at him, rearing his teeth in \na growl...\n\nZowie LUNGES forward, jaws flashing, and Chase twists sideways...\n\nGNASHING TEETH connect with Chase's shoulder, then with the \npillows where Chase's head used to be. A BLIZZARD OF DOWN FEATHERS \nERUPTS...\n\nChase scrambles out of bed, flailing for the gun on the bedside \ntable...\n\nTHE GUN spins out of reach and across the floor...\n\nChase DIVES for the gun and reaches it just as Zowie leaps to the \nfloor. In a panic, Chase FIRES WILD...\n\nZowie abruptly turns and SMASHES through the bedroom window, \nsending glass flying.\n\nEXT.  HOUSE - NIGHT\n\nZowie slides down the room and leaps to the ground below, \ndisappearing into the night.\n\nINT.  CHASE'S BEDROOM - NIGHT\n\nChase looks on in terror. Finally he pulls his eyes away from the \nshattered window...\n\n...and catches a glimpse of something in the dresser mirror. \nSomething that sends a chill up his spine.\n\nThe flurry of down feathers is floating to the mattress. But \nintermingling with the feathers are a handful of ROSE PETALS, \nslowly settling to the bed.\n\nINT.  BATHROOM - MORNING\n\nChase is bare-chested at the mirror, applying a dressing to the \ndog bite on his shoulder.\n\nMarjorie appears in the doorway with a basket of laundry. She \nstops short at the sight of Chase standing there in his boxers.\n\nChase catches her reflection in the mirror and is startled.\n\n\t\t\t\tMARJORIE\n\t\tI didn't mean to... I was going to\n\t\tempty the hamper...\n\nChase turns, shaking off the scare.\n\n\t\t\t\tCHASE\n\t\tIt's okay.\n\nMarjorie's eyes can't help but fix on the dog bites scattered over \nChase's chest and arms.\n\n\t\t\t\tMARJORIE\n\t\tWhat happened to you?\n\n\t\t\t\tCHASE\n\t\tI had a little run-in with Zowie.\n\n\t\t\t\tMARJORIE\n\t\tYou sure did...\n\nMarjorie sets the laundry aside.\n\n\t\t\t\tMARJORIE\n\t\tHere, let me do that...\n\nMarjorie looks over the antiseptics Chase has laid out on the \nsink. Saturating a wad of gauze with hydrogen peroxide, she gently \ncleanses the gashes on his arms.\n\nThere's nothing overtly sexual in her actions, but the gentleness \nof her touch doesn't go unnoticed by Chase.\n\n\t\t\t\tMARJORIE\n\t\tI hope he doesn't have rabies.\n\n\t\t\t\tCHASE\n\t\tHe doesn't. I don't know what he\n\t\thas, but I'm hoping to God it's\n\t\tnot infectious...\n\nChase stops and looks at Marjorie's reflection in the mirror.\n\n\t\t\t\tCHASE\n\t\tMarjorie... what do you know about\n\t\tthe Creed murders?\n\nMarjorie stiffens for a moment. Obviously the Creeds are a sore \nspot for the people in this town.\n\n\t\t\t\tMARJORIE\n\t\tDid you ever play that game where\n\t\tyou pass a story down a row of\n\t\tpeople and see how screwed up it\n\t\tgets by the time it's done?\n\t\tPeople say Louis Creed's son came\n\t\tback from the dead and it drove\n\t\thim crazy...\n\t\t\t(she rolls her eyes)\n\t\tHe killed his wife and himself,\n\t\tand that's the end of story.\n\t\tAnything else belongs in the\n\t\tNational Enquirer.\n\nMarjorie tapes the bandage over Chase's shoulder too tight. \nChase's groan snaps her back to the reality at hand.\n\n\t\t\t\tMARJORIE\n\t\tSorry. Now tell me what that has\n\t\tto do with Zowie?\n\nChase closes his eyes, shutting out the pain.\n\n\t\t\t\tCHASE\n\t\tI wish I knew.\n\nINT.  LIBRARY - DAY\n\nChase approaches the counter, looking to the ELDERLY LIBRARIAN for \nassistance.\n\n\t\t\t\tLIBRARIAN\n\t\tWhat are you looking for, Hon.\n\n\t\t\t\tCHASE\n\t\tDo you have anything on the Creed\n\t\tmurders? I can't find the \n\t\tmicrofilm from that period...\n\nThe librarian's smile vanishes. She lowers her voice, focusing her \nattention on some paperwork.\n\n\t\t\t\tLIBRARIAN\n\t\tWe don't keep anything on file\n\t\tfrom that far back.\n\n\t\t\t\tCHASE\n\t\tBut you've got files from the\n\t\tprevious years...\n\n\t\t\t\tLIBRARIAN\n\t\tWe have nothing on the Creed\n\t\tmurders, sir. Can I get you\n\t\tsomething else?\n\nChase looks around and realizes that a dozen hostile eyes are on \nhim. TOWNSPEOPLE withholding a dark secret.\n\nChase slowly backs away, eager to escape the field of hostile \nstares.\n\n127   OMITTED\nTHRU\n129   OMITTED\n\nEXT.  HIGHWAY, COUNTRY BRIDGE - DAY\n\nGeoff and Drew have parked their bikes beneath the bridge. They \nsit on the bank of the creek below, watching the water run past. \nGeoff is lost in thought.\n\n\t\t\t\tGEOFF\n\t\tDo you think everyone that came\n\t\tback would be like Gus?\n\n\t\t\t\tDREW\n\t\tI don't know...\n\t\t\t(thinking)\n\t\t...maybe it depends on what you\n\t\twere like before you...\n\n\t\t\t\tGEOFF\n\t\t\t(finishing)\n\t\tDies?\n\nDrew nods. He tosses a stone into the creek, then looks up at the \nsun and sighs.\n\n\t\t\t\tDREW\n\t\tI gotta go back and do my\n\t\tchores...\n\n\t\t\t\tGEOFF\n\t\tGo later...\n\nDrew shakes his head.\n\n\t\t\t\tDREW\n\t\tI can't. Gus'd kill me if I\n\t\tshowed up late.\n\nThe boys reluctantly rise and move to their bikes, walking them up \nthe steep grade to the highway.\n\n\t\t\t\tDREW\n\t\tSee you at school Monday?\n\nGeoff nods. He looks at Drew. The boy is genuinely frightened. But \nthere's nothing either of them can do. They're trapped in their \nroles as kids.\n\nBoth boys mount their bikes. Drew turns...\n\n\t\t\t\tDREW\n\t\tYou ever think about running away?\n\n\t\t\t\tGEOFF\n\t\tAll the time.\n\nDrew smiles at this. He waves to Geoff and pedals off.\n\n\t\t\t\tDREW\n\t\t\t(calling back)\n\t\tSee ya!\n\nGeoff waves and heads off in the opposite direction.\n\nWE STAY ON DREW -\n\nAs he moves down the road. Up ahead, we hear the approaching WHINE \nof a motorcycle...\n\nCLYDE\n\nrips by on an old junkyard fixer-up MOTORCYCLE, and he's heading \nin Geoff's direction.\n\nSeeing him, Drew brakes and pulls his bike into a U-turn, pumping \nfuriously to catch up with Geoff.\n\nON GEOFF -\n\nNow Geoff hears the WHINE of Clyde's motorcycle. He glances \nback...\n\nClyde's spotted him, REVVING the engine.\n\nGeoff pedals like mad, but it's no use. Clyde is closing in on \nhim, grinning sadistically.\n\nClyde sweeps in next to him, calling out over the ENGINE.\n\n\t\t\t\tCLYDE\n\t\tWell look who's here!\n\nClyde veers right, forcing Geoff towards the shoulder of the \nroad...\n\n131   OMITTED\n\n132   OMITTED\n\nEXT.  COUNTRYSIDE - DAY\n\nThe ground ahead drops toward a ravine. Geoff has nowhere to go \nbut down the slope. Clyde is right there beside him...\n\nLaughing, Clyde reaches over and grabs ahold of Geoff's handlebar. \nHe jerks it sideways...\n\n\t\t\t\tCLYDE\n\t\tOops!\n\nGeoff's front wheel turns perpendicular. The bike pitches forward, \nTHROWING Geoff into the dirt ahead...\n\nClyde broadies his bike to a stop. With the engine idling, he hops \noff.\n\nBefore Geoff can get to his feet, Clyde has picked up Geoff's bike \nand planted it upside down in the dirt.\n\n\t\t\t\tCLYDE\n\t\tGuess your Dad's not here to save\n\t\tyou now, is he?\n\nClyde gets a handful of Geoff's collar and drags him over toward \nthe bike. With his free hand, Clyde cranks the pedal.\n\nThe back wheel spins. Faster and faster.\n\n\t\t\t\tCLYDE\n\t\tYou ever seen a tire take off a\n\t\tnose?\n\nThrough the blur of the spokes, WE SEE Geoff, eyes widening \nfearfully.\n\n\t\t\t\tCLYDE\n\t\tNeither have I.\n\nClyde forces Geoff's face toward the spinning tread.\n\n\t\t\t\tCLYDE\n\t\tMight even kill ya. Wheel might\n\t\tchew right into your brains. You\n\t\tcould visit your mom.\n\nGeoff tries to get a hold on the frame of the bike for leverage, \nbut his arms don't reach beyond the spinning wheel.\n\nClyde is full of deranged glee, fueled by Geoff's fear.\n\nBut now, A HAND grabs the wool scarf streaming from the back of \nClyde's neck and yanks him off of Geoff.\n\nClyde reels, finding...\n\nGUS standing there behind him. He looks bad. Real bad. His \nbandages are unwound and his ruined neck is still seeping. His \nface is unearthly pale. He's deteriorated considerably since \nyesterday.\n\n\t\t\t\tCLYDE\n\t\t\t(startled)\n\t\tJesus Christ, Gus!\n\nGus levels a threatening gaze at Geoff.\n\n\t\t\t\tGUS\n\t\tGo home.\n\nBut Geoff remains frozen. Gus fixes him with a stare that could \nturn flesh to stone.\n\n\t\t\t\tGUS\n\t\tI said... GO HOME!!\n\nGeoff snaps out of it and flips his bike over. He gets a running \nstart, making a beeline for the highway without ever looking back.\n\nON THE KNOLL NEARBY\n\nDrew stops short of the ravine, watching from afar as Gus steps \ntoward Clyde.\n\nBELOW -\n\nClyde throws up his hands. He's frightened, but he tries to muster \nup a cocky front.\n\n\t\t\t\tCLYDE\n\t\tCome on, Gus, I was just fucking\n\t\twith him...\n\t\t\t(nervous laughter)\n\t\tWhat're you gonna do? Give me a\n\t\tticket? I mean, shit, Gus...\n\nClyde grows increasingly wary of Gus' evil stare. Gus steps \ncloser.\n\n\t\t\t\tCLYDE\n\t\tYou can't lay a finger on me...\n\nWrong. Gus lashes out, backhanding Clyde across the face.\n\nClyde falls to the ground, flat on his back, with his nose gushing \nblood. Terrified.\n\nGus turns around and lifts the idling motorcycle. With one hand \nunder the back of the seat, and the other working the accelerator \nhandlebar, Gus advances toward Clyde.\n\nGus kicks the bike into gear and REVS the accelerator.\n\nTHE REAR WHEEL SPINS. On the pavement it would be moving forty \nmiles an hour.\n\nClyde can't believe his eyes. Pleading.\n\n\t\t\t\tCLYDE\n\t\tGus... what are you doing?\n\n\t\t\t\tGUS\n\t\tI'm just fucking with you...\n\nGus plants his foot against Clyde's chest, pinning him, and lowers \nthe spinning rear wheel TOWARD CLYDE'S NECK. The wheel WHINES like \na circular saw.\n\nGus lowers the wheel. Then jerks it away, flashing a sadistic \nsmile.\n\nJust when Clyde thinks Gus is backing off, the wheel comes down \nagain...\n\n\t\t\t\tCLYDE\n\t\t\t(wailing)\n\t\tStop it, man! Stop it!!!\n\nGus gets into the rhythm as he lowers and retracts the spinning \nwheel at the terrified bully.\n\nBut this time, as the wheel comes down...\n\nCLYDE'S WOOL SCARF, defying gravity, gets swept up, swallowed into \nthe GEARS.\n\nAnd along with the scarf, here comes Clyde's SCREAMING face. We \ncan only imagine the gruesome instant that follows.\n\nBLOOD sprays up over Gus' arms and chest. And then we hear the \nsound of CRUNCHING BONES jamming the motorcycle's gears.\n\n\t\t\t\tGUS\n\t\t\t(dead-pan)\n\t\tWhoops.\n\nHe bares his teeth in a death's head grin.\n\nON THE KNOLL\n\nDrew has witnessed the killing. He's mortified.\n\nBELOW -\n\nGus tosses the bloody motorcycle aside, slowly raising his eyes up \nto where Drew stands. His eyes meet Drew's.\n\nDrew hastily jerks his bike around and takes off.\n\nGus starts after him on foot.\n\nINT.  DREW'S HOUSE - DAY\n\nDrew rushes through the front door, SLAMMING it behind him and \nthrowing the deadbolt.\n\nINT.  BEDROOM - DAY\n\nDrew climbs onto his bed and grabs his shotgun from the gun rack. \nHis fingers shake as he flips off the safety.\n\n\t\t\t\tDREW\n\t\tOh man...\n\nJust then we hear the CRACKLE of a POLICE P.A. and Gus' amplified \nVOICE coming from the yard outside.\n\n\t\t\t\tGUS (V.O.)\n\t\t\t(mocking)\n\t\tThis is the Police, come out of\n\t\tthe house with your hands up!\n\nGus finishes his words with a burst of FEEDBACK and then amplified \nMANIACAL LAUGHTER.\n\nDrew's eyes go wide with terror. He creeps out into the hall, \nclutching the gun.\n\nINT.  HALLWAY - DAY\n\nDrew tries to look out the window. Then we hear a low, guttural \nGROWL. Drew slowly turns...\n\nZowie is standing down the hall, leveling a dead stare. Zowie \ntakes the first step forward.\n\n\t\t\t\tDREW\n\t\t\t(horrified)\n\t\tNo, Zowie! It's me!\n\nPleading, Drew slowly retreats down the hallway.\n\nAlong the way, he backs right into...\n\nGUS, grinning from ear to ear.\n\nDrew recoils against the wall, swinging up his shotgun.\n\n\t\t\t\tDREW\n\t\tStay back!\n\nBut Gus just keeps on grinning. He takes a step forward...\n\nDrew pulls the trigger...\n\nAnd CLICK! Nothing happens. The chambers are empty.\n\n\t\t\t\tGUS\n\t\tForget something, Drew buddy?\n\nGus raises his hand. He's holding the shotgun shells. He lets them \nfall to the floor.\n\nSuddenly Gus wrenches the gun from Drew's hands. He swings it \nand...\n\n...Drew SCREAMS and ducks beneath the blow, as the shotgun butt \nSMASHES a hole in the wall above his head. Gus flings the shotgun \naside and LUNGES for Drew...\n\nDrew races down the hallway to the back door. He turns the latch. \nThe deadbolt has been locked from the inside.\n\nDrew's eyes whip to the keyholder on the wall. All the keyhooks \nare empty.\n\nHere comes the JINGLING of keys in Gus' pockets as he comes down \nthe hall...\n\nDrew dashes away from the back door.\n\nGus' eyes shift from Drew's fleeing form to A BOX OF TOOLS in the \nservice closet.\n\nAT THE FRONT DOOR\n\nDrew jimmies the knob. Again, the deadbolt is locked from the \ninside. Tears are streaming down Drew's face now.\n\nFOOTSTEPS approach. Drew spins around...\n\nGus is advancing, WITH A HAMMER tight in his grip.\n\n\t\t\t\tGUS\n\t\t\t(crazed)\n\t\tYou have the right to remain\n\t\tsilent...\n\nWHAM! Gus SMASHES the hammer into the wall to punctuate his words. \nPlaster goes flying.\n\n\t\t\t\tGUS\n\t\t\t(continuing)\n\t\t...while I bash your fucking head\n\t\tin!\n\nDrew's eyes dart frantically, looking for a way out. The closest \nroute of escape is UP THE STAIRS.\n\nDown the hallway, Zowie starts running forward. Drew's caught \nbetween a rock and a hard place...\n\n\t\t\t\tGUS\n\t\tYou have the right to a lawyer,\n\t\tbut you won't need one...\n\nHe runs for it. Gus charges to intercept him...\n\nDrew gets to the stairs first.\n\n\t\t\t\tGUS\n\t\t...cause you'll be dead!\n\nWHAM! Gus brings the hammer down with the claw end leading. It \nsinks into the stair below Drew's feet...\n\nZowie LEAPS past Gus, tearing up the stairs as Gus wrenches the \nhammer free...\n\nUPSTAIRS\n\nDrew makes it to the top of the stairs with Zowie right on his \nheels.\n\nDrew DIVES into Amanda and Gus' bedroom as...\n\nZowie springs from the floor. Drew SLAMS the door shut, SMACKING  \nZowie. Zowie collapses to the floor, dazed.\n\nINT.  BEDROOM - DAY\n\nDrew throws the latch on the door. Almost immediately, Gus is \noutside, POUNDING at the door with the claw end of the hammer. \nWood splinters fly as the hammer claw sinks through...\n\nDrew SCREAMS and goes for one of the dormer windows. It's stuck; \nhe can't get it open.\n\nFrom the hallway, Gus violently SMASHES the door again and again. \nThe door is splintering apart. WE SEE glimpses of Gus through the \nragged holes.\n\n\t\t\t\tGUS (O.S.)\n\t\tDo you understand these rights,\n\t\tDrew buddy?!\n\nDrew grabs a chair and HEAVES it through the window...\n\n\t\t\t\tGUS (O.S.)\n\t\t...OR ARE YOU JUST TOO FUCKING\n\t\tSTUPID?!\n\nThe bedroom door EXPLODES INWARD and Gus claws his way into the \nroom...\n\nWasting no time, Drew climbs through the broken window...\n\nEXT.  DREW'S HOUSE - DAY\n\nDrew slides down the slant of the roof. He hits the lattice and \ntakes it to the ground with him.\n\nUntangling himself, he gets to his feet...\n\n...and here comes Amanda, ARRIVING HOME.\n\nDrew runs for her car, waving his hands, throwing himself into her \npath so she'll go no further. She SLAMS on the brakes.\n\nDrew pulls open the passenger door and dives inside...\n\n\t\t\t\tDREW\n\t\tGus killed Clyde, Mom! He's\n\t\ttrying to kill me!\n\nJust then, the BACK DOOR flies open. Gus steps out.\n\n\t\t\t\tGUS\n\t\tDrew, buddy! Daddy's not done\n\t\tyet!\n\nAmanda spots the hammer hanging from his grip. Gus cracks a sick \nsmile and FLINGS THE HAMMER at the car...\n\nCRACK! The hammer bounces off the windshield, causing it to \nspiderweb.\n\n\t\t\t\tDREW\n\t\tGo Mom! Go!!!\n\nThat's all the convincing Amanda needs. She puts the car into \nreverse and stomps on the gas...\n\nINT.  CAR - DAY\n\nSpeeding down the highway. Drew and Amanda are mortified.\n\nSuddenly, we hear the WAIL of Gus' patrol car coming up from \nbehind. Amanda looks to the rear-view mirror...\n\nEXT.  HIGHWAY - DAY\n\nApproaching from the road ahead is a POTATO TRUCK.\n\nINT.  AMANDA'S CAR - DAY\n\nAmanda hips her head back in front of them. The potato truck is \nblaring its HORN.\n\nGus' car swerves out onto the shoulder, speeding up to match her \npace.\n\n\t\t\t\tDREW\n\t\tMom!!!\n\nGus cranks the wheel, jumping back onto the road, forcing Amanda's \ncar into the path of the oncoming truck.\n\nINT.  POTATO TRUCK - DAY\n\nTHE DRIVER stands on the BRAKES.\n\nEXT.  HIGHWAY - DAY\n\nTHE POTATO TRUCK COLLIDES WITH AMANDA'S CAR. HEAD ON.\n\nThousands of potatoes explode from the rear of the truck, \nobscuring our view.\n\nWE HEAR THE HORRIFYING SOUNDS OF CRUNCHING METAL. CRUNCHING BONES. \nAND SILENCED CRIES.\n\nGus' vehicle speeds past. WE HOLD on the mess of twisted steel. \nClearly there are no survivors.\n\nINT.  GEOFF'S HOUSE - DUSK\n\nGeoff enters first. Wearing a dark suit. Looking pale and empty \ninside. Chase follows, dressed in black. It's obvious they've been \nto a funeral.\n\nWithout a word, Geoff heads up the stairs. Chase watches on, \nfeeling utterly helpless.\n\nINT.  UPSTAIRS HALLWAY - DAY\n\nChase exits from his bedroom, pulling a sweater over a more casual \nchange of clothes. He cocks his head at the SOUNDS of Geoff moving \nabout in the attic above.\n\nThe door atop the attic stairway is barely ajar.\n\nChase wrinkles his brow, concerned. Turning away, he heads \ndownstairs.\n\nINT.  KITCHEN - DAY\n\nMarjorie is preparing dinner. Across the room, the kitchen TV is \nplaying...\n\nON TELEVISION is the evening news. A photo of Drew and Amanda \nappears above the NEWSCASTER.\n\n\t\t\t\tNEWSCASTER\n\t\t... Friends and neighbors came to\n\t\tpay respects for Drew and Amanda\n\t\tGilbert, who died in a head-on\n\t\tcollision Saturday...\n\nChase enters the kitchen, eyes moving to the TV.\n\n\t\t\t\tMARJORIE\n\t\tThose poor people. I saw Gus this\n\t\tmorning... he looked terrible.\n\nChase pulls his eyes away from the broadcast as Marjorie sets \ndinner on the table. Chase yells upstairs.\n\n\t\t\t\tCHASE\n\t\tGeoff, dinner's ready!\n\t\t\t(after no reply)\n\t\tGeoff?!\n\n\t\t\t\tGEOFF (O.S.)\n\t\tI'm not hungry.\n\nChase gives Marjorie an apologetic look and rises from the table.\n\nMeanwhile, the news broadcast continues. A photo of Clyde appears \non the screen.\n\n\t\t\t\tNEWSCASTER\n\t\t...in other news, the\n\t\tdisappearance of a Ludlow youth\n\t\tremains a mystery. Clyde Parker\n\t\twas last seen on Saturday\n\t\tafternoon. His motorcycle was\n\t\tfound off Highway 62...\n\n150   OMITTED\n\nINT.  ATTIC - NIGHT\n\nChase pushes open the door. A spring coil pulls the CREAKING door \nclosed behind him. One look at the attic and Chase turns pale...\n\nA huge window at the far end of the room allows the moonlight to \nreach all corners of the spacious old attic...\n\nAll of Renee's belongings have been unpacked. The entire attic has \nbeen converted into a museum-like room, down to the last \nmeticulous detail. A room in preparation for Renee's return.\n\nGauzy curtains billow out from some unseen draft. Pictures of \nRenee rest everywhere. Awards. Memorabilia...\n\nGEOFF is seated before the brightly lit, three-way theatrical \nmirror, casually setting out Renee's make-up.\n\n\t\t\t\tCHASE\n\t\tGeoff... what are you doing?\n\nThere's an obsessive dementia in Geoff's gaze.\n\n\t\t\t\tGEOFF\n\t\tI'm getting things ready for Mom.\n\nChase sighs. Obviously the strain of Drew's funeral has proven too \nmuch for Geoff. He moves closer.\n\n\t\t\t\tCHASE\n\t\t\t(gently)\n\t\tMom is dead, Geoff. You know\n\t\tthat...\n\nA creepy smile flickers across Geoff's face.\n\n\t\t\t\tGEOFF\n\t\tShe doesn't have to be.\n\nChase freezes as a chill runs up his spine.\n\n\t\t\t\tCHASE\n\t\tWhat are you talking about?\n\n\t\t\t\tGEOFF\n\t\tI can bring her back. The same\n\t\tway Drew and me brought Zowie\n\t\tback...\n\nAt this, Chase is positively spooked.\n\n\t\t\t\tCHASE\n\t\tGeoff, this is crazy. Zowie\n\t\tdidn't die.\n\n\t\t\t\tGEOFF\n\t\tHe did. We buried him.\n\t\t\t(intense)\n\t\tThere's a place out in the\n\t\twoods... if you bury something\n\t\tthere, it comes back alive.\n\nChase stares at his son. This is insane. It must be.\n\nJust then, the PHONE RINGS downstairs. Geoff continues to stare at \nhis father.\n\n\t\t\t\tGEOFF\n\t\tWe tried it on Zowie first. And\n\t\tthen we did it again, when Zowie\n\t\tkilled Gus. Drew didn't want Gus\n\t\tto be dead, so we brought him\n\t\tback, too...\n\nIt's too much for Chase. His mouth is hanging agape.\n\n\t\t\t\tMARJORIE (O.S.)\n\t\t\t(outside the attic\n\t\t\tdoor)\n\t\tDoctor Matthews, you've got a\n\t\tcall. It's the caretaker at the\n\t\tfuneral home. Something about\n\t\tyour wife's grave...\n\nChase nods in private acknowledgement. He stares at Geoff as he \nbacks away.\n\n\t\t\t\tCHASE\n\t\tLook, Geoff. Just... just relax,\n\t\tokay. I'm going to take this call\n\t\tand I'll be right back. Okay?\n\nGeoff doesn't respond. Chase pulls open the door and leaves.\n\nINT.  KITCHEN - NIGHT\n\nChase is on the phone. The CALLER'S WORDS bring grave concern to \nChase.\n\n\t\t\t\tCHASE\n\t\tWhat?! Christ, I'll be right\n\t\tthere...\n\nChase hangs up, stunned. He turns to Marjorie, who's watching him \nwith a concerned gaze.\n\n\t\t\t\tCHASE\n\t\t\t(hurried)\n\t\tMarjorie, I need you to stay late.\n\t\tGeoff is really upset and I have\n\t\tto take care of this. Don't let\n\t\thim leave the house, alright?\n\nChase is out the door before she has a chance to respond.\n\n151B  OMITTED\nTHRU\n151F  OMITTED\n\nINT.  ATTIC - NIGHT\n\nGeoff is laying on his mother's bed, weeping. Tiger sits at the \nfoot of the bed. Suddenly she wakens and HISSES.\n\nFrom out of the darkness...\n\nRENEE'S HAND\n\nENTERS FRAME, gently touching Geoff's side. And with its arrival, \nso comes her eerie LULLABY.\n\n\t\t\t\tRENEE\n\t\t\t(a whisper)\n\t\tI need you, Geoff...\n\nGEOFF\n\nslowly raises his head, bewildered. Renee's hand withdraws into \nthe darkness. He reaches out for her, but she's gone. The LULLABY \nremains, beckoning from down the attic stairs.\n\nThe attic door slowly swings open of its own accord.\n\nGeoff rises from the bed and follows.\n\nINT.  DOWNSTAIRS FOYER - NIGHT\n\nGeoff looks into the living room as he passes. Marjorie has fallen \nasleep on the sofa with the TV on.\n\n155   OMITTED\n\nEXT.  PET SEMATARY - NIGHT\n\nThe lullaby drifts from beyond the deadfall. The fog rolls inward, \ntowards the distant burial ground. As Geoff moves towards the \ndeadfall, the fog converges around him.\n\n157   OMITTED\n\nEXT.  THE BOG - NIGHT\n\nThe lure of Renee's lullaby pulls Geoff deeper into the woods. We \nhear the unearthly ANIMAL HOWL once more.\n\n159   OMITTED\nTHRU\n167   OMITTED\n\nEXT.  PLEASANTVILLE CEMETERY - NIGHT\n\nChase's van pulls to a stop behind a maintenance vehicle.\n\nChase is greeted by the limping CARETAKER, who quickly leads him \noff across the rolling hillside.\n\n\t\t\t\tCARETAKER\n\t\t...sorry to disturb you, Doctor\n\t\tMatthews, but I thought you'd want\n\t\tto come have a look for yourself.\n\t\tIt's the damndest thing...\n\nAT RENEE'S GRAVE -\n\nChase stops cold, gazing at the ground before him in disbelief...\n\nThe grave is a gaping cavity. The casket has been unearthed. \nRenee's body is missing.\n\n\t\t\t\tCHASE\n\t\tJesus...\n\t\t\t(uncomprehending)\n\t\tGus did this?!\n\n\t\t\t\tCARETAKER\n\t\t\t(nodding)\n\t\tHe stuck around after the funeral.\n\t\tTold me he had an order to exhume\n\t\tyour wife. I didn't think much of\n\t\tit until I saw him drag the body\n\t\tout of the coffin...\n\t\t\t(shakes his head)\n\t\tHe put your wife in his truck and\n\t\tdrove off right through Amanda and\n\t\tDrew's headstones...\n\nThe caretaker points across the hillside...\n\nTIRE TRACKS cut through the manicured grass, cutting a path of \ndestruction right through the field of headstones and on through \nthe fence.\n\n\t\t\t\tCARETAKER\n\t\tI swear, nothing this weird has\n\t\thappened since Louis Creed dug up\n\t\this boy...\n\t\t\t(beat)\n\t\tYou want me to notify the\n\t\tauthorities?\n\nChase doesn't answer, he just storms past the caretaker.\n\nINT.  VAN - NIGHT\n\nThe van is speeding down the dark, open highway. Chase is on the \ncar phone, frantic, waiting as it RINGS. There's finally an \nanswer...\n\n\t\t\t\tCHASE\n\t\tDoctor Yolander, this is Chase\n\t\tMatthews, we spoke the other\n\t\tday...\n\nYolander cuts him off.\n\n\t\t\t\tYOLANDER'S VOICE\n\t\t\t(bitter)\n\t\tYou didn't leave town, did you.\n\nINT.  YOLANDER'S HOUSE (INTERCUT)\n\nYolander sits in the darkness, a bottle of whiskey and a tumbler \nat his side. His \"creatures\" are all around him, eyes glowing with \nreflected moonlight. His voice is slurred. The voice of someone \nwho's already damned.\n\n\t\t\t\tYOLANDER\n\t\tYou sorry bastard. You stayed. I\n\t\thave nothing more to say to you,\n\t\tMatthews...\n\n\t\t\t\tCHASE'S VOICE\n\t\t\t(desperate)\n\t\tLook, just tell me one thing. Did\n\t\tI treat an animal that had been\n\t\tbrought back to life? Did I?!\n\n\t\t\t\tYOLANDER\n\t\tWhat do you think?\n\nINT.  CHASE'S VAN - NIGHT\n\nChase grips the carphone tightly, his knuckles white.\n\n\t\t\t\tYOLANDER (V.O.)\n\t\tBelieve what you saw, Matthews.\n\t\tThe dog was dead.\n\n\t\t\t\tCHASE\n\t\tMy God...\n\t\t\t(mounting horror)\n\t\t...how is that possible? You have\n\t\tto help me, Doctor Yolander. I\n\t\tdon't know what I'm dealing with\n\t\there! They've dug up my wife...\n\n\t\t\t\tYOLANDER'S VOICE\n\t\t\t(cutting him off)\n\t\tI'm retired from my practice,\n\t\tMatthews. It's your practice now,\n\t\tand it's your problem.\n\t\t\t(beat)\n\t\tGod help you...\n\n\t\t\t\tCHASE\n\t\t\t(screaming)\n\t\tWait! Don't hang up!\n\nBut Yolander does. And now we hear the DIAL TONE.\n\n\t\t\t\tCHASE\n\t\tShit!\n\nChase flings the carphone down, looking up as...\n\nAn approaching potato truck ZOOMS by. Blinding headlights. A \nBLARING HORN. Chase barely swerves out of the way.\n\nRecovering from the scare, Chase reaches over and opens the glove \ncompartment. He pulls out his gun and sets it on the seat next to \nhim.\n\nEXT.  MICMAC BURIAL GROUND\n\nGeoff climbs the stone steps, reaching the flattop meas. He stops \nshort, looking over the clearing...\n\nGUS\n\nis standing in the center of the burial ground. He's HUMMING, \nmimicking Renee's feminine tone. Now he stops and slowly turns, \nregarding Geoff with dead eyes. He's holding a pickaxe and shovel \nat his side.\n\nGus looks to the ground at his side. Geoff follows his gaze...\n\nA VISION OF RENEE'S GRAVE APPEARS -\n\nHeadstone. Manicured grass. Thriving flowers. As if it had been \nuprooted from her resting place at Pleasantville and set down \nright in the middle of the Micmac ground.\n\nAnd now, the vision of Renee's grave fades away. In its place is a \nbundle of white: RENEE'S SHROUDED BODY.\n\nGus raises the pickaxe, offering it to Geoff.\n\n\t\t\t\tGUS\n\t\tYou bury your own, Geoff.\n\nGeoff slowly nods and approaches, seduced beyond reason.\n\n169   OMITTED\nTHRU\n177   OMITTED\n\nINT.  GEOFF'S HOUSE, LIVING ROOM - NIGHT\n\nMarjorie stirs on the couch, blinking her eyes open at the SOUND \nof a THUD upstairs. Otherwise, the house is dark and silent.\n\n\t\t\t\tMARJORIE\n\t\tGeoff?\n\nINT.  HALLWAY - NIGHT\n\nMarjorie starts up the long, dark flight of stairs to the attic. \nThe thin night-shirt she's wearing does little to protect her from \nthe sudden cold. She clutches herself, shivering.\n\n\t\t\t\tMARJORIE\n\t\tGeoff? You okay up there?\n\nINT.  ATTIC - NIGHT\n\nMarjorie cautiously pushes open the door. Her concern for Geoff is \nforgotten as she beholds the Renee Hallow memorabilia.\n\nShe moves about Renee's unpacked belongings in bewildered \nreverence.\n\nThe gauzy curtains billow about Marjorie like ghosts. And then she \nglimpses something beyond the curtains...\n\nA FIGURE\n\nstands in the shadows, wearing the BEADED PEACH DRESS that \nMarjorie had admired earlier. For a moment we think it's Renee, \nbut as Marjorie draws closer, we see that the dress has been \nfitted onto a dressmaker's model.\n\nMarjorie lays a hand on the fabric, feeling the contours of the \ndesign.\n\nEEXT.  GUS' HOUSE - NIGHT\n\nChase's headlights sweep across the front of the dark house. \nPulling to a stop, Chase opens the van's door...\n\nZOWIE\n\nLEAPS out of the darkness, sinking his teeth into Chase's \nshoulder.\n\nChase is thrown back over the car seat, grappling with the \nnightmare dog as it tears into him again and again...\n\nChase SCREAMS, reaching back for the gun. He grabs hold of it and \nswings it around... FIRES...\n\nZowie is BLOWN backwards, clear out of the car, spraying CHASE \nwith BLOOD...\n\nZowie lands outside on his feet, looking stunned. His chest is a \nruined mess. Zowie WHIMPERS and drags himself weakly towards the \nfront porch.\n\nChase stumbles out of the van, clutching the gun. He's bleeding \nprofusely.\n\n179   OMITTED\n\nEXT.  PORCH - NIGHT\n\nAn old saw is laying in a pile of sawdust next to a square hole \nthat's been cut in the base of the front door.\n\nChase gives it a look as he tries the door. It's unlocked. Chase \nenters, bringing with him an illuminating swath from his \nheadlights.\n\nINT.  GUS' HOUSE - NIGHT\n\nChase's headlights stream through the windows, distorting the \ninterior. The house looks like it's been through a tornado. A \ntrail of BLOODY PAW PRINTS leads into the kitchen. The stench is \nrepulsive. Grimacing, Chase has to keep himself from gagging.\n\n\t\t\t\tCHASE\n\t\tJesus...\n\nAs Chase moves forward, he catches sight of...\n\nGUS\n\nstanding in a swath of light. At Gus' feet is Zowie, tongue \nlolling out of his mouth. Dead for the second time. Scattered \naround the dog are various tools.\n\nPropped against the wall is the cut out square of wood. It's \nfitted with hinges at the top.\n\n\t\t\t\tCHASE\n\t\tGus, what are you doing?!\n\nGus glances down at the dead dog.\n\n\t\t\t\tGUS\n\t\t\t(dead-pan)\n\t\tI was building a doggy door.\n\n\t\t\t\tCHASE\n\t\tGod damn it Gus, you dug up my\n\t\twife! What the fuck is going on\n\t\taround here?!\n\nGus brings a cordless electric drill up from his side, pointing it \nat Chase in a threatening manner.\n\n\t\t\t\tGUS\n\t\t\t(grins)\n\t\tA little drilling. A little\n\t\tkilling.\n\nAs Gus moves forward, Chase gets a good look at him for the first \ntime. He doesn't look even remotely alive.\n\n\t\t\t\tCHASE\n\t\tHoly shit!\n\nChase levels his gun with a trembling hand.\n\nGus stabs the air with the drill, feeding on Chase's horror.\n\nChase pulls the trigger. A bullet pounds Gus' chest. A SPRAY OF \nFLESH explodes from his back.\n\nUnphased, Gus regains his balance.\n\n\t\t\t\tGUS\n\t\tGod I hate when that happens...\n\nBefore Chase can squeeze off the next round, Gus rips the gun from \nhis grip...\n\n\t\t\t\tGUS\n\t\tYou got a permit for that?\n\nOpening the chamber, Gus empties the remaining bullets and tosses \nthe gun aside.\n\n\t\t\t\tGUS\n\t\tDidn't think so.\n\nGus fires up the drill. The bit spinZZZZZZ. He DIVES at Chase, \nknocking him back against the counter. The drill bit SINKS INTO \nCHASE'S ARM...\n\nChase SCREAMS as Gus withdraws it. Now, he presses it into Chase's \nshoulder. Chase is on the verge of blacking out now. The pain is \nunbearable...\n\nGus withdraws the drill once again, aiming now for Chase's eye.\n\n\t\t\t\tGUS\n\t\t\t(maniacal)\n\t\tNo brain, no pain, Chase. Think\n\t\tabout it...\n\nThe whirling drill bit is millimeters away from Chase's eye. He \nclutches Gus' arm, trying to force the drill aside...\n\nAt the last second, adrenaline kicks in and Chase diverts the \ndrill. It SINKS INTO the counter-top nearby... STUCK.\n\nGus ROARS, lashing out, but Chase manages to duck away...\n\nChase catches sight of HIS GUN on the floor. He scrambles for it, \nscooping it up...\n\nBULLETS are rolling across the floor every which way. Chase slaps \nhis palm down on one and desperately fumbles with the chamber...\n\nGus' hands CLAMP DOWN around Chase's neck. He swings Chase around \nand SLAMS him against the wall, lifting him off his feet...\n\nChase GASPS as the life is literally crushed out of him...\n\nHe brings the gun up beneath Gus' chin and jams it into his ruined \nthroat. Gus just keeps on throttling him...\n\n\t\t\t\tGUS\n\t\t\t(insane)\n\t\tJust remember, Chase... I had Renee\n\t\tfirst... and now I'm gonna have her\n\t\tlast...\n\nBLAM! The top of Gus' head BLOWS off. His BODY is thrown back by \nthe incredible force, tumbling him to the kitchen floor with a \nHEAVY THUD.\n\nChase sucks in precious air, then his head snaps up.\n\n\t\t\t\tCHASE\n\t\tGeoff!\n\nEXT.  GUS' HOUSE - NIGHT\n\nChase stumbles from the house. It's a wonder he's even conscious. \nHe swings open the van door and throws himself inside, sinking the \nkey into the ignition.\n\nINT.  ATTIC - NIGHT\n\nMarjorie is now seated before Renee's theatrical make-up mirror, \nentranced. She's wearing the beaded peach dress.\n\nWith the help of Renee's vast array of cosmetics, Marjorie has \nturned herself into a stunning beauty.\n\nThe lipstick isn't quite right. Turning to the countertop \nmagnifying mirror, she carefully touches up her ruby red lips. Her \nface fills nearly the entire mirror...\n\n...except for one rim, which reflects the dark, shadowy attic \nbehind her.\n\nA HUGE EYE joins her reflection in the distorting mirror. Marjorie \nnearly jumps out of her skin. She spins around...\n\n\t\t\t\tMARJORIE\n\t\tJesus, Geoff! Don't sneak up on\n\t\tme like that!\n\n...but no one is there.\n\nTHE MAKE-UP MIRROR catches another glimpse. Renee's RED LIPS, \nmagnified tenfold. The lips begin to move...\n\n\t\t\t\tRENEE\n\t\t\t(a whisper)\n\t\tDid you really think you could be\n\t\tlike me?\n\nRenee's fist swings in, SMASHING a panel of the mirror...\n\nMarjorie raises her hands to protect herself against the flying \nglass. And as her hands come down, she finds...\n\nRenee standing before her. Her ghostly form silhouetted by \nmoonlight. Curtains billowing around her. We never fully see her.\n\nMarjorie's face goes white with fear.\n\n\t\t\t\tRENEE\n\t\tSuch a young face... but you've got\n\t\tpotential...\n\nRenee grabs a fistful of Marjorie's hair, viciously YANKING her \nhead back...\n\n\t\t\t\tRENEE\n\t\tWe'll do the eyes first. You\n\t\talways start with the eyes...\n\nRenee lashes out, SLASHING a mirror shard across the skin beneath \nMarjorie's right eye. Marjorie SCREAMS.\n\nINT.  GEOFF'S ROOM - NIGHT\n\nGeoff awakens at the commotion upstairs. He rocks forward, rising \nfrom his bed.\n\n185   OMITTED\n\nINT.  HALLWAY - NIGHT\n\nGeoff pauses at the base of the attic stairway, looking up at the \nopen door. All he hears are the faint SOUNDS of movement.\n\n\t\t\t\tGEOFF\n\t\tMarjorie? You know you're not\n\t\tsupposed to be in the attic.\n\nGeoff starts up the stairs.\n\nINT.  ATTIC - NIGHT\n\nGeoff trepidatiously enters. He weaves through the maze of gauzy \ncurtains. And then he sees her...\n\nRenee is standing in the midst of the attic. She's perfectly made \nup. Gorgeous. Just as she was on the day she died. She smiles \nwarmly.\n\n\t\t\t\tGEOFF\n\t\tMom...\n\n\t\t\t\tRENEE\n\t\tI came back for you, Geoff. We're\n\t\tgoing to be together again.\n\nRenee raises her outstretched arms to receive him. Through the \nhaze of his tears, Geoff doesn't see the sinister, vacant gleam in \nher eyes.\n\nINT.  CHASE'S VAN - NIGHT\n\nReaching the house, Chase SKIDS to a stop across the lawn.\n\n188B  OMITTED\n\nINT.  ATTIC - NIGHT\n\nChase cautiously enters with the gun in his grasp. The spring coil \nswings the CREAKING door shut behind him.\n\nFrom Chase's vantage point, he can't see them yet. He makes his \nway around the stripped dressmaker's model, past an upright \ndressing mirror. And then he sees...\n\nMARJORIE\n\nSlumped against Renee's bed like a ragdoll. We can only see half \nof her face. It looks untouched. Chase reaches for her...\n\n\t\t\t\tCHASE\n\t\tMarjorie?\n\nMarjorie's head rolls sideways, exposing the other half of her \nface. The skin has been stripped from her skull and peeled back...\n\nChase turns his head away. And that's when he sees them...\n\nRENEE AND GEOFF\n\nHolding each other tightly. Geoff has his head buried in Renee's \nbreast. Renee looks up from her son, meeting Chase's gaze. Her \nvoice is both seductive and terrifying.\n\n\t\t\t\tRENEE\n\t\tHello, Chase.\n\nChase gasps. The word \"horror\" doesn't do the moment justice.\n\n\t\t\t\tCHASE\n\t\tOh my God...\n\n\t\t\t\tRENEE\n\t\tWe can try again, Chase. We can\n\t\tmake it work this time.\n\nChase sinks back against the wall. He's lost a lot of blood and \nhis strength is leaving him.\n\n\t\t\t\tCHASE\n\t\t\t(shaking his head)\n\t\tNo...\n\n\t\t\t\tRENEE\n\t\tDon't you love me anymore, Chase?\n\n\t\t\t\tCHASE\n\t\tYou're not Renee... Renee's dead...\n\t\t\t(screaming)\n\t\tGeoff! Get over here now!\n\nBut Geoff just holds his mother tighter. A hint of annoyance \nflickers through Renee's eyes. She strokes Geoff's hair.\n\n\t\t\t\tRENEE\n\t\t\t(looking at Chase)\n\t\tGeoff, honey, why don't you go\n\t\tdownstairs. Your father and I\n\t\tneed a moment alone. Do it for\n\t\tme?\n\nGeoff looks up at his mother, mesmerized. She releases him from \nthe embrace. He brushes past Chase without a glance and heads for \nthe attic door.\n\n\t\t\t\tRENEE\n\t\tGeoff...\n\nGeoff pauses at the door, looking back. Renee's words have a \nhauntingly familiar ring...\n\n\t\t\t\tRENEE\n\t\tI love you.\n\nGeoff smiles. Turning away, he opens the door and...\n\nCLYDE\n\nis standing there, an AXE perched on his shoulder. His face is \ntorn to shit, bones and brain matter exposed. He's covered from \nhead to toe in dirt and clotted blood. He looks worse than any of \nthe undead we've seen. A total walking nightmare.\n\n\t\t\t\tCLYDE\n\t\t\t(grinning)\n\t\tHey, Junior. Wanna play?\n\nWHOOSH! Clyde swings the axe, sinking it into the wall just in \nfront of Geoff's face...\n\nGeoff tumbles back onto the floor, snapping out of his trance.\n\nClyde brings the axe down...\n\n...and Geoff rolls to the side, barely avoiding decapitation.\n\n\t\t\t\tCHASE\n\t\tGeoff!\n\nChase stumbles forward to rescue his son. As he does so, Clyde \nbrings the axe back up, SMASHING Chase in the head with the blunt \nend...\n\nChase goes down. Unconscious.\n\n\t\t\t\tCLYDE\n\t\tOops! Looks like Daddy got a boo-\n\t\tboo...\n\nClyde turns his gaze back on Geoff.\n\n\t\t\t\tCLYDE\n\t\tNow, where were we?\n\nGeoff shuffles backwards across the floor as Clyde moves into the \nroom.\n\nRenee passes behind Clyde. She SLAMS the attic door shut and snaps \noff the knob with a jerk of the wrist, locking them all inside.\n\nScared out of his wits, Geoff makes it to his feet. Clyde swings \nagain and misses...\n\nGeoff grabs hold of the axe handle, struggling, and the two boys \ngo down...\n\nRENEE\n\nMoves to the vanity. She sweeps a hand across it, sending \neverything crashing to the ground. Crystal perfume bottles \nSHATTER, spilling their contents over the floor.\n\nRenee reaches for a lighter and flicks it on. She touches the \nflame to the perfume-soaked floor...\n\nFLAMES roar into existence, racing across the floorboards, \nigniting the curtains...\n\nWe see the flames reflected in Renee's soulless eyes.\n\nON GEOFF AND CLYDE\n\nAs they wrestle with one another across the floor. Bloody spittle \ndrips from Clyde's face. He flashes a feral snarl.\n\nClyde LUNGES forward and tears into Geoff's shoulder with his \nteeth...\n\nGeoff SCREAMS. His hands grope blindly for a weapon and close on a \nmirror shard. He JABS it up and into Clyde's eye...\n\nSomehow, Geoff manages to roll out from under Clyde. He rises to \nhis feet...\n\nClyde lets loose a DEMONIC ROAR. He charges, SLASHING the axe \nwildly, knocking aside curtains and dressing models alike. \nNothing's going to stop him. Nothing.\n\nFlames are consuming the attic, licking the rafters, igniting the \ncanopy drapings... devouring everything. SMOKE is rolling across \nthe floor...\n\nGeoff reaches a far wall. He's trapped in a corner. There's \nnowhere else to go. Behind Geoff is a CIRCUIT BOX. INSULATED \nCABLES run from the box down through the attic floor. Geoff \nturns...\n\nAnd here comes Clyde...\n\n\t\t\t\tCLYDE\n\t\tHere it comes, buddy! HERE IT\n\t\tFUCKING COMES!!!\n\nClyde swings. Geoff ducks. The axe hits the circuit box behind \nhim, severing the insulated cables...\n\nAs Clyde rips the axe out of the wall for another try, Geoff \nreaches for one of the SPARKING CABLES.\n\nClyde raises the axe above his head...\n\n\t\t\t\tCLYDE\n\t\tEat it, ass-hole...\n\n\t\t\t\tGEOFF\n\t\tEAT THIS!!!\n\n...and Geoff shoves the live cable into Clyde's mouth!\n\nSPARKS shoot out of Clyde's eyes and ears. He jerks back and \nforth, writhing in a horrific replay of Renee's electrocution.\n\nThen Clyde's face BLOWS APART in a gout of ruined flesh and BLUE \nFLAME. The circuit is blown and the SMOKING BODY falls...\n\nGeoff drops the cable. The blazing inferno is closing in. He runs \nto Chase...\n\nChase is barely conscious. Geoff drops to his knees and pulls his \nfather to his feet...\n\n\t\t\t\tRENEE (O.S.)\n\t\tDon't leave me again, Geoff!\n\nGeoff turns...\n\nRENEE\n\nis standing in the midst of the FLAMES, reaching out. The make-up \nand mortician's wax she wears fall victim to the heat and her \n\"face\" begins to MELT AWAY...\n\n\t\t\t\tRENEE\n\t\tDon't leave me alone!\n\nGeoff turns away, horrified. With Chase on his shoulder, he \nreaches the door. Locked. Geoff sets Chase against the wall.\n\nHe spots the AXE, still clutched in Clyde's hand. Geoff drags the \naxe free from the dead boy's grasp and goes to work on the door...\n\nIgnoring Renee's CRIES, Geoff swings the axe again and again, \nchopping the door apart. He coughs through the smoke. The flames \nare almost upon them...\n\nFinally, the wood splinters apart. Geoff reaches through and \ngrasps the outside handle, pulling the door open. Then he turns \nand lifts Chase up once more...\n\nAt the door, Geoff pauses for one final, tearful look back. Then \nhis face hardens and he turns away, pulling Chase to safety.\n\n\t\t\t\tRENEE\n\t\tNO, GEOFF! NO!!!\n\nON RENEE\n\nAlone in the fiery storm, SCREAMING. Flames devour her flowing \nwhite dress. Her face doesn't even look remotely human anymore.\n\nAnd as the inferno slowly closes in, we...\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT.  VETERINARY OFFICE - DAY\n\nWe PULL OUT from a sign on the door that says \"CLOSED\".\n\nChase is just now locking up the door. He's bandaged up, looking a \nlittle worse for the wear, but happy to be alive. He turns, \ngrinning...\n\nGEOFF\n\nstands near the van, holding Tiger in his arms.\n\n\t\t\t\tGEOFF\n\t\tAll set?\n\n\t\t\t\tCHASE\n\t\tAll set.\n\nChase joins Geoff at the van and together they climb inside. Chase \nstarts the engine, pulling away from the office.\n\nWE STAY ON THE VAN -\n\nAs it moves off down the street, passing the familiar landmarks of \nsleepy Ludlow.\n\nRISING UP -\n\nWe follow the van as it sweeps out of town. Ludlow looks picture-\nperfect from our bird's eye vantage point. Charming and quiet.\n\n\t\t\t\tCHASE (V.O.)\n\t\tSo where're we going?\n\n\t\t\t\tGEOFF\n\t\tAnywhere but here.\n\nWe continue rising up into the brilliant blue sky, losing the van \namidst the rolling Maine countryside and we\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT.  MICMAC FOREST - DAY\n\nRUSHING over the woods, just above the tree tops. It's an ocean of \nswaying green beneath us. A forest as ancient and mysterious as \nanything on the Earth.\n\nAND SUDDENLY -\n\nThe endless trees fall out from under us. We find ourselves above \nthe flattop mesa of the Micmac burial ground, swooping downward...\n\nThe ground surges towards us. We see Renee's OPEN GRAVE.\n\nThe quality of light is different now. We hear the wail of the \nLONESOME WIND, and perhaps, the WHISPER of something altogether \nalien.\n\nAnd on the unsettling note, we...\n\n\t\t\t\t\t\t\t\tFADE TO BLACK.\n\n\nTHE END\n\n\n\n\n\n\nPet Sematary II\nWriters :   Richard Outten  David S. Goyer\nGenres :   Horror\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:32:54.234030"}