{"title": "Pet Sematary", "film_link": "/Movie Scripts/Pet Sematary Script.html", "script_link": "/scripts/Pet-Sematary.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Pet Sematary Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Pet Sematary Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/8-stars.gif\"/> (8.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Stephen King\" title=\"Scripts by Stephen King\">Stephen King</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/><br/>\n<b>Script Date</b> :  1986<br/>\n<br/>\n<a href=\"/scripts/Pet-Sematary.html\">Read \"Pet Sematary\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n<title>\"PET SEMATARY\" by Stephen King</title>\n\n<pre>\n\n\n\n\n\n\n\n<b>\t\t\t\"PET SEMATARY\"\n</b>\n\t\t\t      by\n\n\t\t\t Stephen King\n\n\n\n\n\n\n<b>FADE IN ON\n</b>\nthat most persistent summer SOUND: crickets in high grass--\nree-ree-ree-ree... This in dark which slowly\n\n<b>\t\t\t\t\t\tDISSOLVES TO:\n</b>\n<b>EXT.  A GRAVE MARKER  SUMMER DAY\n</b>\nIt's a plywood cross leaning aslant. Written on the crossarm in \nblack paint which has faded: SMUCKY  HE WAS OBEDIENT. The letters \nare faded. They are also straggling and ill-formed--the work of a \nchild.\n\n<b>MAIN TITLES BEGIN.\n</b>\n<b>EXT.  ANOTHER GRAVE MARKER\n</b>\nA child's printing again, this time on a chunk of warped crating: \n<b>BIFFER BIFFER A HELLUVA SNIFFER UNTIL HE DIED HE MADE US RICHER  \n</b><b>1971-1974.\n</b>\n<b>MAIN TITLES CONTINUE\n</b>\n<b>EXT.  TWO MARKERS\n</b>\nI think all these shots are LAP DISSOLVES. All is silence but for \nthe crickets and the wind stirring the grass. Around the markers \nthemselves, the grass has been clipped short, and by some markers \nthere are flowers in cheap vases. Crisco cans, Skippy peanut \nbutter jars, etc.\n\nThese two markers: IN MEMORY OF MARTA OUR PET RABIT DYED MARCH 1, \n1965 (on a wide flat board) and GEN PATTON (OUR! GOOD! DOG!) APRIL \n1958 (another board).\n\n<b>MAIN TITLES CONTINUE\n</b>\n<b>EXT.  FIVE OR SIX MARKERS\n</b>\nWe can't read all of them; some are too faded (or the \n\"gravestones\" themselves too degenerated), but we can see now that \nthis woodland clearing's a rather eerie -- and well-populated -- \nanimal graveyard.\n\nWe can see: POLYNESIA, 1953 and HANNAH THE BEST DOG THAT EVER \nLIVED. HANNAH'S tombstone is part of an old Chevrolet hood, \npainstakingly hammered flat.\n\n<b>MAIN TITLES CONTINUE.\n</b>\n<b>EXT.  ANGLE ON THE PET SEMATARY\n</b>\nFrom here we can see most of the clearing, which is surrounded by \nforest pines. We can see that the graves--maybe 80 in all--are \narranged in rough concentric circles. On the far side of this \nclearing is the end of a path which spills into this graveyard \nclearing. The end of the path is flanked by wooden poles which \nhold up a crude arch. We can see no writing on this side -- the \nwords on the arch face those arriving along the path.\n\n<b>MAIN TITLES CONTINUE\n</b>\n<b>EXT.  THE ARCH, FROM THE PATH SIDE, CU\n</b>\nMAIN TITLES CONCLUDE. Written on the arch in faded black paint is \nthe work of some long-gone child: PET SEMATARY.\n\n<b>THE CAMERA HOLDS ON THIS FOR A MOMENT OR TWO, THEN PANS SLOWLY \n</b>DOWN to look through the arch. From this angle we are looking \nacross to a deadfall--a tangle of weather-whitened old dead \nbranches at the back of the graveyard. It's maybe twenty-five feet \nfrom side to side and about nine feet high. At either end are \nthick tangles of underbrush that look impassible.\n\nAS MAIN TITLES CONCLUDE, THE CAMERA MOVES SLOWLY IN on the \ndeadfall. And as it does, we realize that there is a horrible \nsnarling face in those branches. Is this an accident? Coincidence? \nOur imagination? Perhaps the audience will wonder. THE CAMERA \nHOLDS ON IT and then we\n\n<b>\t\t\t\t\t\t\tDISSOLVE TO:\n</b>\nBLACK. And a white title card: MOVING DAY.\n\n<b>EXT.  A HOUSE IN THE COUNTRY  EVENING\n</b>\nSOUND of crickets: ree-ree-ree-ree...\n\nTo the left of this house: a big empty field. Behind it: the \nwoods. Before it: a wide two-lane road.\n\nThe house is a pleasant two-story New England dwelling with a \nshed/garage attached. In front of it is a sign which reads QUINN \nREALTORS 292 HAMMOND STREET, BANGOR. A big SOLD strip, like a \nbumper sticker, has been plastered across it diagonally.\n\nGROWING SOUND: the rumble of a truck. A big, big truck. It belts \nbetween the CAMERA and the house -- a tanker truck with a silver \nbody and the word ORINCO written on the side in blue letters. Its \nshort-stack is blowing quantities of dark brown smoke. Behind it \ncomes a Ford wagon, which slows, signals, and turns into the \ndriveway of the house we've been looking at.\n\n<b>EXT.  REAR OF THE WAGON\n</b>\nAs LOUIS CREED brings it to a stop we get a good look at the \nlicense plate (Illinois) and a bumper sticker (HAVE YOU HUGGED \n<b>YOUR M.D. TODAY?)\n</b>\nThe ENGINE SOUND stops. For a moment or two we hear only the ree-\nree-ree-ree of crickets. Then:\n\n\t\t\t\tELLIE CREED (voice)\n\t\tIs this our new house, daddy?\n\n\t\t\t\tLOUIS CREED (voice)\n\t\tThis is it.\n\n<b>EXT.  THE WAGON, A NEW ANGLE\n</b>\nThe two front doors and one back door open. LOUIS CREED, about 32, \ngets out from the driver's side. RACHEL CREED, his wife, gets out \nfrom the passenger side. From the rear door comes ELLIE CREED, a \ngirl of 6. They are staring, fascinated, at the house.\n\nThey come together, the three of them, by the front of the wagon, \nstill staring at the house. LOUIS is clearly nervous.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tSo...what do you think?\n\nRACHEL begins to smile. She turns to LOUIS and hugs him.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tIt's gorgeous!\n\n<b>\t\t\t\tELLIE\n</b>\t\tAm I really gonna have my own room?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYes.\n\n<b>\t\t\t\tELLIE\n</b>\t\tYaay!\n\nShe looks toward the side lawn and sees a tire on a rope hanging \ndown from the bough of a tree.\n\n\t\t\t\tELLIE (to RACHEL)\n\t\tIs that a swing?\n\n<b>\t\t\t\tRACHEL\n</b>\t\tYes, but the rope might be--\n\n<b>\t\t\t\tELLIE\n</b>\t\tYaay!\n\nShe goes running toward it. RACHEL gives LOUIS a tired smile.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tLet her go. It's cool.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tLouis, the house is beautiful.\n\nThey kiss--gently at first, then more passionately. As he draws \nher more tightly against him, a baby--GAGE--begins to cry from the \ncar. LOUIS and RACHEL break the clinch.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tThe Master of Disaster awakes.\n\nThis SOUND is joined by the unhappy yowling of a pent-up tomcat.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tAnd Buckaroo Banzai.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tCome on--let's parole 'em.\n\nThey walk to the car, RACHEL going to one of the back seat doors, \nLOUIS to the rear of the wagon.\n\n<b>INT.  THE FRONT SEAT, WITH RAHEL AND GAGE\n</b>\nGAGE is sitting in his car seat, not exactly crying but certainly \nyelling to be let out. The seat, dash, and floorboards are \nlittered with roadmaps, soda cans, Big Mac boxes, and similar \ncrud. These folks have driven all the way from Chicago to Maine in \nthis station wagon, and the wagon looks it.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tDecided to wake up and see what home\n\t\tlooks like, huh?\n\nShe begins to unbuckle the straps and harnesses. GAGE is just \nwearing a t-shirt and a diaper. He's fifteen months old.\n\n<b>EXT.  THE REAR OF THE WAGON, WITH LOUIS\n</b>\nHe opens the doorgate and lifts out a cat carrier. We see a big \ntomcat inside--mostly what we're aware of are shining green eyes.\n\n\t\t\t\tELLIE (voice)\n\t\tDaddy! Mommy! I see a path!\n\nLOUIS, cat carrier still in hand, turns toward:\n\n<b>EXT.  ELLIE IN THE TIRE SWING\n</b>\nShe's got it penduluming back and forth in long wide arcs.\n\n<b>EXT.  THE VIEW UP TOWARD THE WOODS, ELLIE'S POV\n</b>\nWe see the field, and a clearly marked and mown path leading up \nits flank and into the dark woods.\n\nTHE CAMERA DIPS AND PENDULUMS as ELLIE swings.\n\n<b>EXT.  RACHEL AND GAGE (FRONT OF THE CAR)\n</b>\n\t\t\t\tRACHEL (irritated)\n\t\tNot so high, Ellie! You don't know\n\t\thow strong that rope is.\n\nShe puts GAGE down. He totters a bit on his little legs and then \nstands there, looking at his sister.\n\n<b>EXT.  THE ROPE AND THE BRANCH, CU\n</b>\nThe bark has rubbed off the branch--it looks like a bone peeping \nthrough decayed flesh. The rope is old, discolored. And it is \nfraying away as we look at it. Soon ELLIE, like Humpty Dumpty, is \ngoing to have a great fall.\n\n<b>EXT.  LOUIS (REAR OF THE CAR)\n</b>\nHe's set the cat-carrier down and is straightening up.\n\n\t\t\t\tELLIE (raptuous voice)\n\t\tWheee!\n\n<b>\t\t\t\tLOUIS\n</b>\t\tEllie, you heard your m---\n\nHis eyes widen.\n\n<b>EXT.  ELLIE\n</b>\n<b>\t\t\t\tELLIE\n</b>\t\tWh--\n\nSOUND: A heavy twang! as the rope breaks. The tire swing--with \nELLIE still inside it--goes crashing to the grass. ELLIE screams \nand begins to cry--a little hurt and a lot surprised.\n\nLOUIS and RACHEL run to her.\n\n<b>\t\t\tLOUIS\t\t\t\tRACHEL\n</b>\tEllie! Are you all right?\tHoney? Are you okay?\n\n<b>EXT.  ELLIE, RACHEL, LOUIS, A CLOSER SHOT\n</b>\nELLIE'S parents reach the tangle of tire, rope, and six-year-old \ngirl.\n\n<b>\t\t\t\tELLIE\n</b>\t\tHurrts! It hurrrrts!\n\n<b>\t\t\t\tLOUIS\n</b>\t\tAnyone who can scream that loud isn't\n\t\tready for intensive care just yet--\n\t\tlooks like she just skinned her knee.\n\nNevertheless, he begins to rapidly disentangle his daughter from \nthe tire. RACHEL helps.\n\n<b>EXT.  GAGE\n</b>\nHe's standing in the driveway by the front of the car, utterly \nforgotten in the heat of the moment. His diaper is sagging quite a \nbit; the boy needs a change.\n\nHe stares toward the scene of the accident for a bit, then loses \ninterest. CAMERA FOLLOWS as he walks down the side of the station \nwagon, little bare feet slapping on the asphalt. He stops for a \nmoment at the back, looking at the cat-carrier, which LOUIS never \ngot around to opening. CHURCH is staring hopefully out through the \nmesh.\n\n<b>\t\t\t\tGAGE\n</b>\t\tHi-Durch!\n\n<b>\t\t\t\tCHURCH\n</b>\t\tWaow!\n\nGAGE bends down and tries to open the cat-carrier's door. No soap. \nEither he can't solve the latch or his fingers don't have the \nstrength. Anyway, he stops trying after a moment.\n\nSOUND: Growing thunder of an approaching truck - a big one.\n\n<b>EXT.  THE ROAD (GAGE'S POV)\n</b>\nA big tanker truck--silver body, ORINCO written on the side in \nblue letters--blasts by.\n\n<b>EXT.  GAGE, BY THE CAT CARRIER\n</b>\nThe windlash if the passing truck blows GAGE'S hair back from his \nforehead. We should be scared here--not by the truck, but by \nGAGE'S lack of fear. He's smiling, happy.\n\n<b>\t\t\t\tGAGE\n</b>\t\tDruck!\n\nHe starts down the driveway toward the road.\n\n<b>EXT.  LOUIS, RACHEL, ELLIE (AT THE SWING)\n</b>\nELLIE has been disentangled from the swing. She's sitting by the \nwreckage at the end of the driveway, weeping hysterically (as much \nfrom tiredness as from pain, I think) as LOUIS and RACHEL examine \nher scraped knee. The wound doesn't look too serious.\n\n\t\t\t\tLOUIS (to RACHEL)\n\t\tWould you get the first aid kit?\n\n\t\t\t\tELLIE (screaming)\n\t\tNot the stingy stuff! I don't want the\n\t\tstingy stuff, daddy!\n\nRACHEL suddenly looks around toward:\n\n<b>EXT.  THE FRONT OF THE WAGON (RACHEL'S POV)\n</b>\nNo one there.\n\n<b>EXT.  RACHEL, ELLIE, LOUIS, BY THE SWING\n</b>\n<b>\t\t\t\tRACHEL\n</b>\t\tGage's gone!\n\n<b>\t\t\t\tLOUIS\n</b>\t\tJesus, the road!\n\nThey get up together.\n\n<b>EXT.  GAGE, AT THE EDGE OF THE ROAD\n</b>\nA truck is coming. A great big one.\n\n<b>EXT.  ANGLE ON THE TRUCK, CU\n</b>\nThe grille looks like a tombstone that's learned how to snarl.\n\n<b>EXT.  GAGE\n</b>\nHe takes a step into the road...and then big, gnarled hands grab \nhim.\n\nGAGE looks rather surprised at this, but not worried--this kid is \nused to being picked up and treated humanely. To GAGE strangers \nare as interesting as...well, as interesting as Orinco trucks.\n\n<b>EXT.  GAGE AND JUD CRANDALL\n</b>\nThe fellow who has picked GAGE up is a man of about eighty in old \nblue jeans, a faded Bruce Springsteen t-shirt. Over this he wears \na faded khaki vest with bright silver buttons. His face is deeply \nwrinkled and kindly.\n\n\t\t\t\tJUD CRANDALL (to GAGE)\n\t\tNo you don't, my friend--not in\n\t\tthat road.\n\nBut he softens this with a grin. GAGE grins back at him.\n\n<b>\t\t\t\tGAGE\n</b>\t\tDrucks!\n\n\t\t\t\tJUD (low)\n\t\tNo shit, Sherlock.\n\nJUD carries him up the driveway to the station wagon. Here he's \njoined by LOUIS and RACHEL, out of breath and really scared. ELLIE \nbrings up the rear. She's still sniffling.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tGage!\n\n\t\t\t\tJUD (hands him to her)\n\t\tHe was headed for the road, looked\n\t\tlike. I corralled him for you, missus.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tThank you. Thank you so much.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYes--thanks. I'm Louis Creed.\n\nHe sticks out his hand and JUD shakes it. LOUIS takes it easy--no \ncrushing JayCees grip, or anything like that--the old guy looks as \nif he might have arthritis.\n\n<b>\t\t\t\tJUD\n</b>\t\tJud Crandall. I live just across the road.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tI'm Rachel. Thanks again for saving\n\t\tthe wandering minstrel boy, here.\n\n<b>\t\t\t\tJUD\n</b>\t\tNo harm, no foul. But you want to watch\n\t\tout for that road. Those damn trucks go\n\t\tback and forth all day and most of the\n\t\tnight.\n\nHe leans over toward ELLIE.\n\n<b>\t\t\t\tJUD\n</b>\t\tWho might you be, little Miss?\n\n<b>\t\t\t\tELLIE\n</b>\t\tI'm Ellen Creed and I live at 642\n\t\tAlden Lane, Dearborn, Michigan. (Pause)\n\t\tAt least, I used to.\n\n<b>\t\t\t\tJUD\n</b>\t\tAnd now you live on Route 9 in Ludlow,\n\t\tand your dad's gonna be the new doctor\n\t\tup to the college, I hear, and I think\n\t\tyou're going to be just as happy as a\n\t\tclam here, Ellen Creed.\n\n\t\t\t\tELLIE (to LOUIS)\n\t\tAre clams really happy?\n\nThey all laugh--even GAGE.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tExcuse me, Mr. Crandall--I've got to\n\t\tchange this kid. It's nice to meet you.\n\n<b>\t\t\t\tJUD\n</b>\t\tSame here. Come over and visit when\n\t\tyou get the chance.\n\nAs RACHEL, carrying GAGE, moves away:\n\n\t\t\t\tELLIE (worries)\n\t\tDaddy, do I really have to have the\n\t\tstingy stuff?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tNo-I guess not.\n\n<b>\t\t\t\tELLIE\n</b>\t\tYayyy!\n\nShe goes belting off.\n\n\t\t\t\tJUD (amused)\n\t\tI guess your daughter there ain't\n\t\tgoing to die after all.\n\n\t\t\t\tLOUIS (also amused)\n\t\tI guess not.\n\n<b>\t\t\t\tJUD\n</b>\t\tHouse has stood empty for too long.\n\t\tIt's damn good to see people in it again.\n\nSOUND: A truck engine, gearing down.\n\n<b>EXT.  A MOVING VAN\n</b>\nIt blinks and comes lumbering into the Creed's driveway.\n\n<b>EXT.  LOUIS AND JUD\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tHey--they actually found the place!\n\n<b>\t\t\t\tJUD\n</b>\t\tMovin' in's mighty thirsty work. I\n\t\tusually sit out on my porch of an evening\n\t\tand pour a couple of beers over m'dinner.\n\t\tCome on over and join me, if you want.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWell, maybe I----\n\n\t\t\t\tRACHEL (voice)\n\t\tLouis, what's this?\n\n<b>EXT.  RACHEL AND GAGE\n</b>\nGAGE has been changed, and RACHEL is following him as he explores \nthe nearest edges of the new homestead. They are fairly close to \nthe wreckage of the tire swing, and here is the head of the path \nELLIE has already glimpsed.\n\n<b>EXT.  LOUIS AND JUD\n</b>\nThey cross to the van. The FIRST and SECOND MOVERS are just \nclimbing out of the van.\n\n<b>\t\t\t\tFIRST MOVER\n</b>\t\tYou Mr. Creed?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYes. Just a second.\n\n<b>EXT.  RACHEL AND GAGE, AT THE HEAD OF THE PATH\n</b>\nShe's holding GAGE on her hip now, and both of them are looking at \nthat strange (and oddly enticing) path which disappears into the \ndeepening twilight. LOUIS and JUD join them.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tThe movers--\n\n<b>\t\t\t\tRACHEL\n</b>\t\tYes--I know. This path, Louis? Where does\n\t\tit go?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI don't have the slightest idea. When I saw\n\t\tthe house, this field was under four feet\n\t\tof snow.\n\n\t\t\t\tRACHEL (smiling)\n\t\tI bet Mr. Crandall knows!\n\nJUD nods. He smiles, too, but underneath the smile we sense that \nhe is serious.\n\n<b>\t\t\t\tJUD\n</b>\t\tOh, ayuh! I know. It's a good story, and\n\t\ta good walk, too. I'll take you up there\n\t\tsometime, and tell you the story, too--\n\t\tafter you get settled in.\n\nHe smiles at them and they smile back--it is a look of \nunderstanding and real liking, in spite of the age difference \nbetween the CREEDS and JUD.\n\n<b>EXT.  THE CREED HOUSE  NIGHT\n</b>\nSOUND: Crickets. Ree--ree--ree-ree... \n\nThere's one light upstairs, one downstairs. Perhaps we see the \npath, glimmering away into the field? Either by virtue of it being \nmown, or by virtue of some gentle optical trick? Maybe.\n\n<b>INT.  THE LIVING ROOM  NIGHT\n</b>\nThere's a light on in the kitchen, but it just casts a dim glow in \nhere. The room has a fireplace and a lovely wooden floor. It's \ngoing to be nice, but now it's just a big bare box with movers' \ncartons stacked all over the place.\n\nLOUIS is drinking a can of Pepsi, and he looks pretty damned \ntired--anyone who's ever moved house and can remember the first \nnight in the new place will understand.\n\nHe finishes the last of the Pepsi and surveys the living room. He \nsits on one of the bigger boxes, takes cigarettes from his pocket, \nand lights one. He drops the spent match in the empty can, and \ntaps into the can during the scene.\n\nSOUND: Feet coming down the stairs. The door on the far side of \nthe room opens and RACHEL comes in, wearing a nightgown.\n\n\t\t\t\tRACHEL (crossing to LOUIS)\n\t\tKids are asleep, doc.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tGreat.\n\nHe hugs her. She hugs him back warmly--for a moment they are just \ntwo good people in all the big darkness of their new house.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tYou're not really going over to have a\n\t\tbeer with that old guy, are you?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWell, I've got a million questions about\n\t\tthe area, and---\n\n<b>\t\t\t\tRACHEL\n</b>\t\t---and you'll end up doing a free\n\t\tconsultation on his arthritis or urinary\n\t\tproblems and---\n\n<b>\t\t\t\tLOUIS\n</b>\t\tDid you see his shirt?\n\n\t\t\t\tRACHEL (giggles)\n\t\tSure. Bruce Springsteen.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI really do have a million questions\n\t\tabout the area...but the thing I'm\n\t\treally curious about is how come this\n\t\toctogenarian Yankee is decorating the\n\t\tslumped remains of his pecs with the\n\t\tBoss.\n\nShe laughs.\n\n<b>EXT.  THE PATH OF THE CRANDALL HOUSE  NIGHT\n</b>\nPervasive SOUND of the crickets as LOUIS comes rather hesitantly \nup the crazy-paved path from the road's edge.\n\n\t\t\t\tJUD (voice)\n\t\tThat you, doc?\n\n<b>EXT.  THE SCREENED-IN PORCH OF THE CRANDALL HOUSE\n</b>\nWe hear the SQUEAK of a rocker; we see the dim red fitful glow of \nJUD'S Pall Mall. We see by its glow that he is wearing Walkman \nearphones.\n\n<b>EXT.  LOUIS\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tIt's me.\n\n<b>INT.  THE PORCH, WITH JUD\n</b>\nThe Walkman is in his lap. He switches it off and puts the \nheadphones casually around his neck, like a kid.\n\n<b>\t\t\t\tJUD\n</b>\t\tWell, come on up and have a beer.\n\n<b>INT.  THE PORCH, A SLIGHTLY WIDER SHOT\n</b>\nLOUIS comes on up. JUD has got a pail of ice beside his chair with \nsome cans of beer in it. He opens one and hands it to LOUIS.\n\n<b>\t\t\t\tJUD\n</b>\t\tYou need a glass?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tNot at all.\n\n<b>\t\t\t\tJUD\n</b>\t\tGood for you.\n\nLOUIS drinks half the can at a draught.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tGod, that's fine.\n\n<b>\t\t\t\tJUD\n</b>\t\tAin't it just? The man who invented\n\t\tbeer, Louis, that man was having a\n\t\tprime day for himself.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWhat were you listening to?\n\n<b>\t\t\t\tJUD\n</b>\t\tAllman Brothers.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWhat?\n\n<b>\t\t\t\tJUD\n</b>\t\tThe Eat A Peach album. God, they were\n\t\tgood before drugs and bad luck caught\n\t\tup with them. Listen to this, Louis.\n\nHe passes the headphones over. LOUIS puts them on. JUD presses the \nWalkman's PLAY button.\n\nSOUND: Ramblin' Man blasts us out of our seats.\n\nLOUIS winces and rakes the spidery earphones off his head.\n\n<b>\t\t\t\tJUD\n</b>\t\tI'm sorry. Wait.\n\nHe turns it down.\n\n<b>\t\t\t\tJUD\n</b>\t\tTry that.\n\nLOUIS puts the earphones back on and listens for a few moments. \nIt's the instrumental break. Gregg and Duane Allman dueling hot \nFenders. LOUIS takes the earphones off.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tNice.\n\n<b>\t\t\t\tJUD\n</b>\t\tI like rock and roll. No...I guess\n\t\tthat's too mild. I love it. Since\n\t\tmy ears started to die out on me,\n\t\tit's the only music I can really hear.\n\t\tAnd since my wife died...I dunno, some-\n\t\ttimes a little rock and roll fills up\n\t\tnight. Not always, but sometimes. (Pause)\n\t\tOne more time--welcome to Ludlow. Hope\n\t\tyour time here will be a happy one.\n\n\t\t\t\tLOUIS (great sincerity)\n\t\tThank you, Mr. Crandall.\n\nHe drinks again--they both do. There's a moment of companionable \nsilence here, broken by the SOUND of a big truck. They look \ntoward:\n\n<b>EXT/INT.  THE ROAD (THROUGH THE PORCH SCREEN)\n</b>\nOne of those big tanker trucks goes rumbling by--now there are \nlittle amber running lights on top of it. It's going fast, too-- \nsweeps by in a blast of air.\n\n<b>INT.  THE PORCH, WITH LOUIS AND JUD\n</b>\n\t\t\t\tLOUIS (wincing)\n\t\tJesus!\n\n\t\t\t\tJUD (lights a cigarette)\n\t\tThat's one mean road, all right--you\n\t\tremember that path your wife commented on?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tThe one that goes into the woods--sure.\n\n<b>\t\t\t\tJUD\n</b>\t\tThat road--and those Orinco trucks--\n\t\tare the two main reasons it's there.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWhat's at the end of it?\n\n\t\t\t\tJUD (smiles)\n\t\tAnother day--after you get settled in a\n\t\tbit. Meantime, doc---\n\nHere JUD raises his glass in a toast.\n\n\t\t\t\tJUD (continues)\n\t\tHere's to your bones.\n\nLOUIS clinks his glass against JUD'S.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tAnd yours.\n\nThey drink.\n\n<b>EXT.  ROUTE 9  NIGHT\n</b>\nLOUIS crosses from the CRANDALL side to his own, and the CAMERA \nFOLLOWS as he walks slowly up the driveway and past the wagon. He \npauses for a moment, looking thoughtfully--hopefully--at his new \nhouse. Then something--the CRY of an OWL, perhaps--draws his \nattention the other way...toward the path.\n\nHe walks to its head and stands looking out at it--it glimmers in \na wide cut swath that's a bit ghostly in the dark.\n\nA SHAPE suddenly lurches out of the high grass at him, and LOUIS \nrecoils with a startled, muffled cry.\n\n<b>EXT.  CHURCH\n</b>\nThe cat, sure; who--or what--else? We see his big green eyes in \nthe dark as he cries his strange feline hello: Waow!\n\n<b>EXT.  LOUIS AND CHURCH, AT THE HEAD OF THE PATH\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tChurch! God, you scared the life\n\t\tout of me!\n\n<b>\t\t\t\tCHURCH\n</b>\t\tWaow!\n\nLOUIS bends and picks up the cat. As he does, that truck SOUND \ncomes again and he looks toward:\n\n<b>EXT.  THE ROAD, LOUIS'S POV\n</b>\nAnother Orinco tanker drones by, fast.\n\n<b>EXT.  LOUIS AND CHURCH\n</b>\n\t\t\t\tLOUIS (to the cat)\n\t\tI know one thing that will keep you\n\t\thome, good buddy.\n\nHe starts toward the house.\n\nBLACK. And in that blackness, we see a second title card: THE DEAD \n<b>SPEAK.\n</b>\n<b>INT.  A KITCHEN BLACKBOARD, CU  DAY\n</b>\nWritten on it is: MONDAY 1.) CHURCH SPAYED 10 A.M. QUENTIN \nJOLANDER, D.V.M. And below, in even bigger letters: 2.) ELLIE'S \n<b>FIRST DAY OF SCHOOL!!\n</b>\nTHE CAMERA PANS LEFT, showing us the kitchen. There are still a \nfew cardboard cartons around, but the place is getting in shape.\n\nWe look out the window and see the CREEDS, led by JUD CRANDALL, \nclimbing the path toward the woods. LOUIS has got GAGE in a \nGerrypak.\n\n<b>EXT.  AT THE TOP OF THE HILL, WITH CREEDS AND JUD\n</b>\nThey are also at the edge of the woods. JUD stops and lets them \ncatch up.\n\n<b>\t\t\t\tJUD\n</b>\t\tTake a look behind you.\n\nThey turn around, and their faces express their wonder.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tMy God!\n\n<b>\t\t\t\tRACHEL\n</b>\t\tIt's beautiful!\n\n<b>EXT.  THE VIEW\n</b>\nIt is indeed beautiful. The CREED house is in the f.g., Route 9 \njust behind it (with one of the ever-present Orinco trucks droning \nalong), but behind that is the great sweep of the Penobscot river \nvalley, dozing under a fall sky of clear blue.\n\n<b>EXT.  AT THE TOP OF THE HILL, WITH JUD AND THE CREEDS\n</b>\n<b>\t\t\t\tJUD\n</b>\t\tYou folks ready to go on?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tSure.\n\n<b>\t\t\t\tELLIE\n</b>\t\tBut where are we going, Mr. Crandall?\n\n<b>\t\t\t\tJUD\n</b>\t\tYou'll see soon enough, hon.\n\nThey go into the woods, still following the path.\n\n<b>EXT.  FOREST  DAY\n</b>\nThese are old woods indeed--huge trunks with dusty sunlight \nshafting through them. It looks as though man has never made his \nmark here.\n\nTHE CAMERA PANS SLOWLY DOWN to them, on the path. Here it is \ncarpeted with pine needles, but it is just as clearly marked.\n\nJUD stops. LOUIS looks glad of the rest; he's sweating and there \nare wide dark patches under his arms where the Gerrypak's straps \nare.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWho owns the woods up ahead? Paper\n\t\tcompanies?\n\n<b>\t\t\t\tJUD\n</b>\t\tNope. The Micmac Indians. What's up\n\t\tahead is all that's left of their\n\t\ttribal lands.\n\n\t\t\t\tELLIE (giggling)\n\t\tMicmac, Ricmac, Kickmac, Sickmac.\n\n\t\t\t\tJUD (smiles)\n\t\tAyuh, it's a funny word, ain't it?\n\t\tYou tired of totin' that yowwen yet, doc?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tNot yet...how much further is it?\n\n<b>\t\t\t\tJUD\n</b>\t\tAw, you'll be okay. Less than a mile.\n\nHe starts off again, fresh as a daisy. ELLIE scampers after him. \nLOUIS rolls his eyes at his wife and RACHEL rolls hers back. Then \nthey press on.\n\n<b>EXT.  THE ARCH READING PET SEMATARY\n</b>\n<b>EXT.  JUD AND THE CREEDS, ON THE PATH\n</b>\n\t\t\t\tJUD (stopping)\n\t\tThis is the place, honey.\n\nELLIE is of course second. Se tries to read the words on the arch \nbut can't. She whips around to look at her mother.\n\n<b>\t\t\t\tELLIE\n</b>\t\tWhat's it say, mommy?\n\nA strange expression has come over RACHEL'S face--she doesn't like \nthis. Not a bit.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tIt says Pet Cemetery, hon. It's\n\t\tmisspelled, but...that's what it\n\t\tsays.\n\nShe runs for the arch. RACHEL starts; looks more uneasy than ever.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tEllen--!\n\n<b>EXT.  ELLIE\n</b>\nShe's almost under the arch. She looks back, questioning.\n\n<b>EXT.  RACHEL, LOUIS, JUD\n</b>\n\t\t\t\tRACHEL (a bit lame)\n\t\tBe careful.\n\n<b>EXT.  ELLIE\n</b>\nShe goes racing into the Pet Sematary.\n\n<b>EXT.  RACHEL, LOUIS, JUD\n</b>\nJUD lights a cigarette with a wooden match, using his thumbnail.\n\n<b>\t\t\t\tJUD\n</b>\t\tI told you it was a bad road,\n\t\tLouis--it's killed a lot of pets\n\t\tand made a lot of kids unhappy.\n\t\tBut at least something good come\n\t\tof it. This place.\n\n\t\t\t\tELLIE (excited voice)\n\t\tMom! Dad! Y'oughtta see it!\n\n<b>EXT.  ELLIE, AT THE EDGE OF THE SEMATARY\n</b>\nShe surveys the rude markers with puzzled delight, then runs \ntoward the center, pausing to investigate some of the markers as \nshe goes. We clearly see the symmetrical pattern of rings.\n\n<b>EXT.  RACHEL, LOUIS, JUD\n</b>\nThey are walking slowly toward that rude archway. LOUIS is \nextremely interested in all this, but it's becoming clearer and \nclearer that RACHEL is troubled. They stop and look in.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tHow can you call it a good thing?\n\t\tA graveyard for pets killed in the\n\t\troad! Built and maintained by broken-\n\t\thearted children!\n\n<b>\t\t\t\tJUD\n</b>\t\tWell, but Missus Creed! It ain't\n\t\tquite that way, deah!\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI think it's rather extraordinary.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tExtraordinarily morbid, maybe.\n\nShe's growing more and more upset. JUD looks at her curiously.\n\n<b>\t\t\t\tJUD\n</b>\t\tWell...they have to learn about death\n\t\tsomehow, now don't they, Missus Creed?\n\t\tThe little ones?\n\n\t\t\t\tRACHEL (coldly)\n\t\tWhy?\n\n<b>\t\t\t\tJUD\n</b>\t\tWell...well, because--\n\n\t\t\t\tELLIE (voice)\n\t\tMommy! Daddy! Look at me!\n\n<b>EXT.  ELLIE, ON THE DEADFALL\n</b>\nShe has begun to climb it, and this looks like an extremely \ndangerous proposition. ELLIE, however, is having the time of her \nlife. A branch breaks under one of her feet and she switches \nnimbly to the next one up.\n\n<b>EXT.  THE GROWNUPS, AT THE ARCH\n</b>\n\t\t\t\tJUD (alarmed)\n\t\tNo, honey! You don't want to go\n\t\tclimbing on that! Come on down!\n\nHe hurries in.\n\n<b>EXT.  ELIIE, ON THE DEADFALL\n</b>\nShe looks back at JUD.\n\n<b>\t\t\t\tELLIE\n</b>\t\tIt's okay, Mr. Crandall--\n\n<b>EXT.  ELLIE'S FOOT, CU\n</b>\nThe branch she's on breaks with a dry CRRRACK. Her foot drops down \nsuddenly.\n\n<b>EXT.  ELLIE AND JUD\n</b>\nShe totters backward, pinwheeling her arms, and JUD catches her as \nshe falls. Not much of a catch because she wasn't too far up.\n\nLOUIS joins JUD and ELLIE. GAGE jounces along on his back.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tHave you got a death-wish, Ellen?\n\n<b>\t\t\t\tELLIE\n</b>\t\tWell, I thought it was safe--\n\n<b>\t\t\t\tJUD\n</b>\t\tBest never to go climbing on old blowdowns\n\t\tlike this, Ellie--sometimes they bite.\n\n<b>\t\t\t\tELLIE\n</b>\t\tBite?\n\n<b>\t\t\t\tJUD\n</b>\t\tAyuh.\n\n<b>EXT.  RACHEL, STANDING AT THE ARCH\n</b>\nHer discomfort makes one thing very clear--she doesn't want to \ncome in.\n\n\t\t\t\tRACHEL (calls)\n\t\tIs she all right, Louis?\n\n<b>EXT.  LOUIS, JUD, ELLIE\n</b>\n\t\t\t\tLOUIS (calls back)\n\t\tFine! Come and see!\n\n<b>EXT.  RACHEL, STANDING AT THE ARCH\n</b>\n\t\t\t\tRACHEL (calling)\n\t\tI think I'll sit this one out, doc.\n\n<b>EXT.  LOUIS, JUD, ELLIE--BY THE DEADFALL\n</b>\n<b>\t\t\t\tELLIE\n</b>\t\tI want to look around, daddy--\n\t\tmay I?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tFor a little while.\n\nJUD looks toward:\n\n<b>EXT.  RACHEL AT THE ARCH (ELLEN IN F.G.)\n</b>\nRACHEL has retreated a bit. She sits on the pine needle carpet of \nthe path, opens her purse, and draws out cigarettes.\n\n<b>EXT.  LOUIS AND JUD\n</b>\nJUD looks at LOUIS as if to say \"What's all this about?\" LOUIS \nlooks away.\n\n\t\t\t\tELLIE (voice)\n\t\tDad! Daddy! Look! A goldfishie!\n\n<b>EXT.  ELLIE\n</b>\nShe runs from one tombstone to the next, cheerful as maybe only a \nkid could be in such a place. She looks at BIFFER'S tombstone; at \n<b>SMUCKY'S.\n</b>\n<b>EXT.  LOUIS AND JUD\n</b>\nThey are walking slowly toward her. LOUIS is looking at the \ntombstones.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI can hardly read these.\n\n<b>\t\t\t\tJUD\n</b>\t\tAyuh--they get older as you go\n\t\ttoward the middle. (Points) Pete\n\t\tLaVasseur's dog is buried there...\n\t\t(points) the Stoppard boys' racing\n\t\tpigeon that Missus Cowley's cat \n\t\tgot...and I think that's the cat \n\t\thimself right there, although it's\n\t\tbeen so many years I can't tell for\n\t\tsure.\n\t\t\t\t(calling)\n\t\tMissy Ellen! Come over here just a \n\t\tminute!\n\n<b>EXT.  ELLEN\n</b>\nShe runs amid the tombstones--they have worked their way near to \nthe center and there are quite a few of them--and joins the \nadults.\n\n<b>\t\t\t\tJUD\n</b>\t\tI see you're quite a reader for such\n\t\ta little girl. Can you read that?\n\nHe points again, and Ellen goes over for a look-see.\n\n<b>EXT.  ELLEN, AT THE GRAVE MARKER\n</b>\nIt is a small slate marker slanted to one side. ELLEN reads the \nwords laboriously, tracing them with her finger.\n\n<b>\t\t\t\tELLEN\n</b>\t\t\"Spot a good fellow we love you boy.\"\n\t\t(Pause) \"Owned by Judson...Judson...\"\n\t\tGee, I can't read the rest.\n\n<b>EXT.  JUD AND LOUIS\n</b>\n<b>\t\t\t\tJUD\n</b>\t\tLast name's Crandall, little missy.\n\nLOUIS looks at him sharply as ELLIE rejoins them.\n\n<b>\t\t\t\tJUD\n</b>\t\tThat's where I buried my dog Spot\n\t\twhen he died of old age in 19 and\n\t\t14. Dug it good and deep. By the\n\t\ttime I finished, I had blisters all\n\t\tover my hands and a hell of a crick\n\t\tin my back. Soil's stony up here.\n\nELLIE looks awed. LOUIS looks a little awed, too.\n\nJUD sweeps a hand around, indicating the whole sematary, but is \nstill looking at ELLEN.\n\n<b>\t\t\t\tJUD\n</b>\t\tDo you know what this place is,\n\t\tEllie? Oh, I know you know it's a\n\t\tboneyard, but a bone ain't nothing\n\t\tand even a whole pile of 'em don't\n\t\tamount to much. Do you know what a\n\t\tgraveyard really is?\n\n<b>\t\t\t\tELLIE\n</b>\t\tWell...I guess not.\n\n<b>\t\t\t\tJUD\n</b>\t\tIt's a place where the dead speak,\n\t\tMissy.\n\nHe sees her startled, uneasy expression and laughs. He ruffles her \nhair reassuringly.\n\n<b>\t\t\t\tJUD\n</b>\t\tNo--not right out loud. Their stones\n\t\tspeak...or their markers. Even if the \n\t\tmarker ain't nothing but a tin can\n\t\tsomeone wrote on with a Magic Marker,\n\t\tit speaks. Ain't that so, Louis?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI think it is so, Ellie.\n\n<b>\t\t\t\tELLIE\n</b>\t\tWhat if you can't read what's\n\t\twritten on there anymore?\n\n<b>\t\t\t\tJUD\n</b>\t\tWell, it still says some animal got\n\t\tlaid down here after, don't it?\n\n<b>\t\t\t\tELLIE\n</b>\t\tYes--\n\n<b>\t\t\t\tLOUIS\n</b>\t\tAnd that someone cared enough about\n\t\tthat animal to mark the spot.\n\n<b>\t\t\t\tELLIE\n</b>\t\tTo remember.\n\n\t\t\t\tJUD (smiles)\n\t\tYes. To remember. This ain't a scary\n\t\tplace, Ellie. It's a place of rest\n\t\tand speaking. Can you remember that?\n\n\t\t\t\tELLIE (a little awed)\n\t\tYes, sir.\n\nThey start to walk slowly back toward the arch.\n\n<b>EXT.  RACHEL, OUTSIDE THE ARCH\n</b>\nIt's clear she's impatient and out-of-sorts with the whole thing.\n\n\t\t\t\tRACHEL (calls)\n\t\tLouis, can we go? I'm tired!\n\n<b>EXT.  LOUIS, ELLIE, JUD\n</b>\n<b>\t\t\t\tELLIE\n</b>\t\tMommy! This is a place where dead\n\t\tanimals talk! Mr. Crandall said so!\n\n<b>EXT.  RACHEL AND ELLIE\n</b>\nBut RACHEL is not amused. She doesn't like any of this.\n\n\t\t\t\tRACHEL (soft)\n\t\tDid he.\n\n<b>EXT.  LOUIS AND JUD\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tMy wife is not crazy about cemeteries\n\t\tof any kind. As you may have noticed.\n\n<b>\t\t\t\tJUD\n</b>\t\tMe neither. But I believe in knowing\n\t\tyour enemy.\n\nLOUIS looks at him, startled, then decides this is a joke. He \nlaughs. JUD smiles, a trifle thinly.\n\n<b>EXT.  THE ARCH, A NEW ANGLE\n</b>\nThe men rejoin RACHEL and ELLIE.\n\n\t\t\t\tLOUIS (voice)\n\t\tDid we take too long?\n\n\t\t\t\tRACHEL (curt)\n\t\tWell, if supper's burned, I'm not\n\t\tthe one going out for pizza.\n\nThey move away.\n\n<b>EXT.  THE DEADFALL, FROM THE ARCH\n</b>\nThe face we saw at the beginning of the movie wasn't there when \nthe visitors were there...but it's sure there now, leering at us.\n\n<b>INT.  THE KITCHEN TRASH CAN  NIGHT\n</b>\nThere are two greasy boxes poking out with NAPOLI PIZZA stamped on \nthem. Guess dinner was burned.\n\nTHE CAMERA PULLS BACK and we se LOUIS sitting at the kitchen \ntable. The table is covered with newspapers. On it, LOUIS is \nputting together a complicated model boat, using glue and \ntweezers. He's wearing glasses.\n\nELLIE comes in, wearing a nightgown. She watches him for awhile.\n\n\t\t\t\tLOUIS (not looking around)\n\t\tHi, babe.\n\n<b>\t\t\t\tELLIE\n</b>\t\tDaddy, that Pet Sematary is there\n\t\tbecause of the road, isn't it?\n\nLOUIS looks around at her, surprised.\n\n<b>\t\t\t\tELLIE\n</b>\t\tThat's what I think. I heard\n\t\tMissy Dandridge tell Mom when\n\t\tChurch was fixed he wouldn't\n\t\tcross the road so much.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWell, it's always better to take\n\t\tprecautions--but I'm sure Church\n\t\twill be all right, honey...\n\n<b>INT.  JUST OUTSIDE THE KITCHEN DOOR\n</b>\nRACHEL is coming along with some dirty dishes. She hears voices \nand stops, listening, her face troubled and afraid.\n\n\t\t\t\tELLIE (voice)\n\t\tNo he won't! Not in the end! He won't\n\t\tbe all right in the end no matter how\n\t\tyou fix 'im!\n\n<b>INT.  LOUIS AND ELLIE\n</b>\nEllis has started to cry.\n\n<b>\t\t\t\tELLIE\n</b>\t\tIn the end he's gonna croak, isn't he?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tLovey...Church might be still alive when\n\t\tyou're in a high school...and that's a\n\t\tvery long time.\n\n<b>\t\t\t\tELLIE\n</b>\t\tIt doesn't seem long to me. It seems\n\t\tshort. I think the whole thing about\n\t\tpets dying s-s-sucks!\n\nPoor kid's bawling her eyes out now. LOUIS folds her into his arms \nand she hugs him tightly, wanting his comfort.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tIf it was up to me I'd let Church live\n\t\tto be a hundred...but I don't make up\n\t\tthe rules.\n\n\t\t\t\tELLIE (muffled)\n\t\tWell who does? God, I suppose. But he's\n\t\tnot God's cat! He's my cat! Let God get\n\t\tHis own, if He wants one! Not mine! Not\n\t\tmine! Not--\n\nShe breaks down completely, sobbing, and LOUIS rocks her back and \nforth.\n\n<b>INT.  THE HALLWAY OUTSIDE THE KITCHEN, WITH RACHEL\n</b>\nShe is crying silently.\n\n<b>INT.  ELLIE'S BEDROOM  NIGHT\n</b>\nShe is a dimly perceived hump in the darkness. An oblong shaft of \nlight falls on her, illuminating her more clearly. She's asleep \nwith her teddy encircled by one arm and her thumb corked into her \nmouth.\n\n<b>INT.  THE DOORWAY, WITH RACHEL\n</b>\nRACHEL looks at her daughter with infinite love and then quietly \ncloses the door.\n\n<b>INT.  LOUIS'S AND RACHEL'S BEDROOM  NIGHT\n</b>\nLOUIS is in his pajamas, propped up on pillows on his side of the \nbed. There a number of medical books scattered around him and he's \nmaking notes from one as RACHEL comes in.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tShe's finally asleep.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tShe was a little over-excited,\n\t\tthat's all. Poor kid.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tIt was that place. That creepy cemetery\n\t\tup in the woods. Whatever disease the\n\t\tkids in this town have got, I don't want\n\t\tEllie to catch it.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tJesus, Rachel, what's got into you?\n\n<b>\t\t\t\tRACHEL\n</b>\t\tDo you think I didn't hear her tonight,\n\t\tcrying as if her heart would break?\n\t\tHere she is thinking Church is going to\n\t\tdie.\n\nIt should be clear to us by now that, despite her words, RACHEL is \nmuch more upset than ELLIE was. LOUIS slowly puts his notebook \naside and caps his pen.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tRachel...someday Church is going to \n\t\tdie.\n\n\t\t\t\tRACHEL (whirls on him)\n\t\tThat is hardly the point! Church is\n\t\tnot going to die today, or tomorrow--\n\t\tNever mind. I can see you don't have\n\t\tthe slightest idea what I'm talking about.\n\nShe stalks to the bathroom, which adjoins. LOUIS follows. She goes \nin and slams the door. He goes for the knob.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tRachel--!\n\n<b>SOUND: CLICK OF THE LOCK.\n</b>\nLOUIS stares at the door, bewildered and upset.\n\n<b>EXT.  ROUTE 9  NIGHT\n</b>\nHere comes a big Orinco truck, droning along, headlights glaring.\n\n<b>INT.  LOUIS'S AND RACHEL'S BEDROOM\n</b>\nThe headlights of the truck illuminate the room and we see LOUIS \nand RACHEL asleep, each as far over to his/her own side as he/she \ncan get, with a big empty space in the middle.\n\nLights and TRUCK SOUNDS slowly fade.\n\n<b>INT.  GAGE  MORNING\n</b>\nCheerful little clots of scrambled eggs are scattered all the way \nacross the tray of his high-chair--it looks a little like a map of \nthe Pacific islands done by a guy who only had a yellow crayon. \nNow he scoops up a handful and throws them.\n\n<b>INT.  THE KITCHEN TABLE, WITH ELLIE\n</b>\nSplat! Eggs on the serving plate of toast.\n\n<b>\t\t\t\tELLIE\n</b>\t\tYee-uck! Gross!\n\n<b>INT.  THE KITCHEN, A WIDER SHOT\n</b>\nRACHEL is at the sink, doing dishes (we see the blackboard with \nits message near her).\n\nLOUIS comes in, wearing a sport-coat and slacks, ready for his \nfirst day on the job...and ELLIE is in a pretty first day of \nschool dress.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tHe can't help it, babe. Emily Post is\n\t\tgoing to be beyond him for a few years.\n\n<b>INT.  BY THE KITCHEN DOOR\n</b>\nHere is the cat-carrier with CHURCH inside it. He waows unhappily.\n\n<b>INT.  THE KITCHEN TABLE, WITH ELLIE AND GAGE\n</b>\nELLIE gets down and goes across to the cat-carrier.\n\n<b>\t\t\t\tELLIE\n</b>\t\tI don't want him to get his nuts\n\t\tcut, daddy! What if he dies?\n\n<b>INT.  RACHEL AND LOUIS, BY THE SINK\n</b>\nLOUIS looks shocked and amused by ELLIE'S colorful choice of \nwords.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tGood God! Where'd you hear that?\n\n<b>INT.  ELLIE\n</b>\n<b>\t\t\t\tELLIE\n</b>\t\tMissy Dandridge. And she says it's a\n\t\toperation!\n\n<b>INT.  RACHEL AND LOUIS, BY THE SINK\n</b>\nLOUIS tries to kiss RACHEL'S mouth. She turns her head slightly so \nhe gets her cheek instead. She's still mad. LOUIS'S amusement \ndies.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tHoney, Church will be fine.\n\n<b>INT.  ELLIE, BY THE CAT CARRIER\n</b>\n<b>\t\t\t\tELLIE\n</b>\t\tBut what if he dies and has to\n\t\tgo to the Pet Sematary?\n\n<b>INT.  LOUIS AND RACHEL, BY THE SINK\n</b>\nShe gives him a look as if to say: \"There! Now do you understand \nwhat you did?\"\n\n<b>\t\t\t\tRACHEL\n</b>\t\tDon't be silly. Church is not going\n\t\tto die.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tAccording to what Mr. Crandall says, the\n\t\troad's a lot more dangerous than the\n\t\toperation. Church will be just the same.\n\t\tWell--almost the same--and we won't have\n\t\tto worry about him getting turned into\n\t\tcatburgers by one of those damn Orinco\n\t\ttrucks.\n\nAt this RACHEL tightens up still more in that funny way--she's \nactually angered by LOUIS'S reference to catburgers--but under the \nanger we sense she is deeply shocked, as a prudish woman might be \nshocked by a dirty joke. For RACHEL, that's just what death is.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tThat's enough of that kind of talk!\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI just said--\n\n<b>\t\t\t\tRACHEL\n</b>\t\tI know what you just said. Ellie,\n\t\tclear your place.\n\nELLIE goes slowly back to the table.\n\n\t\t\t\tELLIE (sets the plate down)\n\t\tI'm scared. What if school here isn't\n\t\tlike in Chicago! I'm scared and I want\n\t\tto go h-h-home!\n\nELLIE bursts into loud tears and puts her hands over her face.\n\n<b>INT.  THE KITCHEN, A NEW ANGLE (FEATURES LOUIS AND RACHEL)\n</b>\nTHE CAMERA FOLLOWS as they go to the table to comfort ELLIE.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tYou'll be fine, Ellie. Now you can be\n\t\texcused. Go and wash your face.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tAnd Church will be fine.\n\n\t\t\t\tELLIE (anxious)\n\t\tDo you promise, Daddy?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWell, honey...you know that...\n\n<b>\t\t\t\tRACHEL\n</b>\t\tDon't shilly-shally, Louis. Give\n\t\tthe little girl her promise.\n\n\t\t\t\tLOUIS (reluctantly)\n\t\tChurch will be fine. I promise.\n\n<b>\t\t\t\tELLIE\n</b>\t\tYayyyy!\n\nShe runs off, cheered up. And RACHEL is cheered up, too.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tThank you, Louis.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tOh, you're welcome. Only if some-\n\t\tthing should go wrong while he's under\n\t\tthe gas--it's a one-in-a-thousand shot,\n\t\tbut it happens--you explain to her.\n\nHe gets up and leaves the table. She looks after him, stunned and \na little frightened.\n\n<b>INT.  GAGE\n</b>\n\t\t\t\tGAGE (conversationally)\n\t\tHere, Durch!\n\nHe picks up a large glob of scrambled eggs from his tray and \nthrows it in the direction of the cat-carrier.\n\n<b>INT.  THE CAT-CARRIER\n</b>\nCHURCH is close to the mesh, looking out. Scrambled eggs hit the \nmesh, driving him back, surprised.\n\n<b>EXT.  THE CREED HOUSE  MORNING\n</b>\nThe school bus pulls up, red lights flashing. ELLIE runs toward it \nacross the lawn, with her lunch-box.\n\n<b>EXT.  LOUIS, RACHEL, AND GAGE, IN THE FRONT DOORWAY\n</b>\n<b>\t\t\t\tRACHEL\n</b>\t\tHave a great day!\n\nLOUIS grabs GAGE'S hand and makes him wave it.\n\n<b>\t\t\t\tGAGE\n</b>\t\tBye-bye!\n\n<b>EXT.  THE BUS\n</b>\nELLIE climbs aboard. The red flashers go out and the bus pulls \naway.\n\n<b>EXT.  THE CREED DRIVEWAY  MORNING\n</b>\nThe station wagon is parked there. LOUIS comes out with a heavy \nbriefcase in one hand and the cat-carrier in the other. He opens \nthe wagon's doorgate.\n\nA small car turns into the CREED driveway and parks beside LOUIS. \nA rather sour-looking middle-aged woman gets out and crosses the \nfront of her car. Her color is bad. This is MISSY DANDRIDGE. She \nlooks at the cat-carrier.\n\n<b>\t\t\t\tMISSY\n</b>\t\tGonna get his--\n\n<b>\t\t\t\tLOUIS\n</b>\t\t--nuts cut, yes. Thank you, Missy,\n\t\tfor introducing that colorful phrase\n\t\tinto my daughter's vocabulary.\n\n<b>\t\t\t\tMISSY\n</b>\t\tDon't mention it.\n\nShe opens the passenger side door of her car and we see a big neat \npile of folded sheets. She reaches for them, then winces and \npresses her hands against her midriff for a moment, as if with an \nattack of indigestion.\n\n\t\t\t\tLOUIS (sees this)\n\t\tHow's that belly-ache of yours?\n\n\t\t\t\tMISSY (gets the sheets)\n\t\tNo better and no worse.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYou ought to see a doctor about it.\n\n<b>\t\t\t\tMISSY\n</b>\t\tIt'll pass. They always do.\n\nShe starts toward the house with the sheets.\n\n<b>EXT.  THE SIDE YARD  MORNING\n</b>\nRACHEL hurries past MISSY, who turns to look and then goes on into \nthe house. LOUIS has just put the cat-carrier into the back of the \nwagon and closed the doorgate as RACHEL reaches him.\n\n\t\t\t\tRACHEL (anxious)\n\t\tStill friends, doc?\n\nLOUIS appears to consider this seriously for a moment...and then \nhe smiles and hugs her. They kiss.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tThank God. I was a little worried\n\t\tthere. Have a great first day at\n\t\tschool, doc. No broken bones.\n\n\t\t\t\tLOUIS (smiles)\n\t\tNot so much as a sprain.\n\n<b>EXT.  VICTOR PASCOW AND FRIENDS  MORNING\n</b>\nPASCOW is in a blanket that is being carried by three boys and one \ngirl. They are all yelling at each other not to joggle him, not to \ndrop him. A small knot of horrified college kids moves with the \nbearers.\n\nPASCOW'S head is upside down to the CAMERA, which retreats ahead \nof the advancing students. Fixed eyes stare. Half of his head has \nbeen shattered inward. Before the catastrophe he was a husky male \nof about twenty. He's dressed in a U of M muscle shirt and red \njogging shorts.\n\nTHE CAMERA PULLS JERKILY TO ONE SIDE, allowing the bearers to \nmount the steps of a brick building. The infirmary. The lookers-on \nbreak to either side. The infirmary doors open.\n\n<b>EXT.. NURSE CHARLTON, AT THE DOORS\n</b>\nShe's the head nurse, a tough old babe of about fifty.\n\n<b>\t\t\t\tCHARLTON\n</b>\t\tHoly Jesus.\n\t\t\t\t(turns)\n\t\tSteve! Steve! Dr. Creed! Dr. Creed,\n\t\twe've got a mess here! Stat!\n\nThe bearers sweep past her and inside, leaving a red smear of \nblood across the midriff of MARCY CHARLTON'S uniform.\n\n<b>INT.  THE INFIRMARY RECEPTION AREA\n</b>\nTHE CAMERA will show us all we need to see, but its movements will \nseem almost random; this is like being in the hotel kitchen after \nSirhan shot Bobby.\n\nAs the students bring in PASCOW, LOUIS comes running, followed by \nSTEVE MASTERTON, his P.A. Standing to one side are two student \nnurses in candystriper uniforms. They're boggled and horrified.\n\nLOUIS kneels. THE CAMERA RUSHES FORWARD, shoving between \nonlookers. LOUIS looks at the wound. There's shattered bone and \npulsing brain tissue beneath.\n\nThere's a scream; the girl who was carrying one corner of the \nblanket is having hysterics.\n\n<b>\t\t\t\tGIRL\n</b>\t\tVic! Vic! Oh Christ! Vic!\n\n\t\t\t\tLOUIS (to CHARLTON)\n\t\tGet her out. Get them all out.\n\nCHARLTON puts her arms around the girl.\n\n\t\t\t\tGIRL (struggling)\n\t\tNo! No! He can't die! He can't die!\n\nTHE CAMERA MOVES BACK DOWN as LOUIS takes an opthalmascope from \nSTEVE and shines it in PASCOW'S bulging, fixed eyes.\n\nCHARLTON is just pushing the last of them gawkers and bearers out \nthe door.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tSteve, get the ambulance over here\n\t\tright now. He's got to go to EMMC.\n\n<b>\t\t\t\tSTEVE\n</b>\t\tThe ambulance is at Sonny's Sunoco\n\t\tdowntown, getting--\n\n<b>\t\t\t\tLOUIS\n</b>\t\t--a new muffler, oh shit--\n\nPASCOW makes a weird gargling noise. Blood suddenly spurts out of \nhis mouth. He begins to seizure.\n\nOne of the candystripers shrieks. THE CAMERA JERKS UP TO COVER the \nstudent nurses. One turns and throws up on the wall.\n\nCHARLTON rushes over.\n\n<b>\t\t\t\tCANDYSTRIPER\n</b>\t\tI can't look at it...I can't stand it...\n\n\t\t\t\tCHARLTON (slaps her)\n\t\tYes you by God can. Go get the hard\n\t\tstretcher!\n\nAs they start away, one helping the other down the hall, and as \nCHARLTON starts over to where PASCOW lies dying on his blanket, \n<b>THE CAMERA DROPS TO LOUIS AND STEVE.\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tHelp me hold him.\n\nThey hold PASCOW'S spasming body.\n\n<b>\t\t\t\tSTEVE\n</b>\t\tIt wouldn't matter if we did have\n\t\tthe ambulance.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tIt wouldn't matter if we had the SST.\n\nPASCOW begins to quiet.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tHe's going. Steve, go call the motor-\n\t\tpool. Marcy, roll out the crash wagon.\n\n<b>\t\t\t\tCHARLTON\n</b>\t\tIt won't--\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI know it won't! But let's for God's\n\t\tsake do it by the rules!\n\nShe leaves. LOUIS is alone with PASCOW. CHARLTON has drawn the \ndrapes, so the doctor and the dying man have complete if temporary \nprivacy.\n\n<b>INT.  LOUIS AND PASCOW, A CLOSER SHOT\n</b>\n<b>\t\t\t\tLOIS\n</b>\t\tThere wasn't even supposed to be a\n\t\tsprain today, my friend--that's what\n\t\tI told her.\n\nPASCOW'S fixed eyes suddenly roll and his left hand bear-traps \nLOUIS'S right wrist. The dying man pulls him slowly but \nrelentlessly down, until their faces are only inches apart.\n\n<b>\t\t\t\tPASCOW\n</b>\t\t...Pet Sematary...\n\nLOUIS recoils, breaking the grip of the hand...but he cannot quite \nsnap the grip of those bright dying eyes. Blood leaks from \nPASCOW'S mouth.\n\n\t\t\t\tLOUIS (whispers)\n\t\tW-What did you say...?\n\nPASCOW struggles hard to speak again. At first he can only gurgle.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tIt's not the real cemetery...\n\t\t(Long pause) The soil of a man's\n\t\theart is stonier, Louis...a man\n\t\tgrows what he can...and tends it.\n\nLOUIS leans forward again, terrified, yet needing to know.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tHow do you know my name?\n\n\t\t\t\tPASCOW (gurgling)\n\t\tI'll come...to you.\n\nLOUIS grabs PASCOW'S bloody shoulder.\n\n\t\t\t\tLOUIS (low but urgent)\n\t\tDammit, how do you know my name?\n\n<b>INT.  HALLWAY ENTRANCE TO RECEPTION, WITH STEVE\n</b>\n<b>\t\t\t\tSTEVE\n</b>\t\tLouis, they're sending a--\n\n<b>INT.  LOUIS AND PASCOW\n</b>\nPASCOW begins to spasm again.\n\n\t\t\t\tLOUIS (snaps)\n\t\tHelp me!\n\nPASCOW spews more blood as STEVE kneels beside LOUIS.\n\n<b>INT.  THE MAIN INFIRMARY HALLWAY\n</b>\nCHARLTON is pushing along your basic MEDCU goodie-cart, covered \nwith emergency life-saving gear.\n\n<b>INT.  LOUIS, STEVE, PASCOW\n</b>\nPASCOW'S spasms are weakening.\n\n\t\t\t\tLOUIS (to CHARLTON)\n\t\tNever mind. He's going.\n\nPASCOW'S hand comes up and paws at LOUIS'S shirt, leaving a bloody \nhandprint. Then it falls limply back. PASCOW is dead.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tSteve, will you get a sheet to cover\n\t\thim with?\n\nSTEVE leaves the frame and LOUIS stares fixedly down at the body \nof VICTOR PASCOW. He closes the eyes.\n\n<b>EXT.  A COUNTRY ROAD, LATE AFTERNOON\n</b>\nIt's the leading edge of Maine fall, sunny and wonderful. Here \ncomes LOUIS'S station wagon. As it reaches THE CAMERA, it swivels \nto TRACK.\n\n\t\t\t\tRADIO (voice-over)\n\t\tTragedy struck on the first day of the\n\t\tUniversity of Maine's fall semester \n\t\twhen Victor Pascow, a nineteen-year-old\n\t\tsophomore--\n\n<b>INT.  THE CAR, WITH LOUIS\n</b>\nHe still looks shocked by the tragedy. The dying man's bloody \nhandprint is partly visible on LOUIS'S shirt in spite of his \nsport-coat.\n\nLOUIS abruptly turns off the radio and swerves over to the side of \nthe road.\n\n<b>EXT.  THE STATION WAGON\n</b>\nIT comes to a slueing, shuddering stop, almost going in the ditch.\n\n<b>INT.  LOUIS, BEHIND THE WHEEL\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tHe said my name. I heard it. He\n\t\tsaid my name.\n\nHe stares blankly through the windshield.\n\n<b>EXT.  THE CREED HOUSE  NIGHT\n</b>\nAll lights are off. It's late.\n\n<b>INT.  THE CREED BEDROOM  NIGHT\n</b>\nLOUIS and RACHEL are asleep, each on his/her own side of the big \ndouble. THE CAMERA MOVES IN ON LOUIS.\n\nSOUND: Loud, hollow BANG. It's very loud--loud enough to wake the \ndead.\n\nLOUIS sits up. Beside him, RACHEL sleeps on. LOUIS'S eyes widen in \nterror as he stares at:\n\n<b>INT.  THE DOORWAY, WITH PASCOW\n</b>\nHe's exquisitely dead. Now pallid as well as smashed up.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tCome on, doc. We got places to go.\n\n<b>INT.  LOUIS\n</b>\nHe is in terror...but he is also in a state of near-trance.\n\n<b>INT.  PASCOW\n</b>\n<b>\t\t\t\tPASCOW\n</b>\t\tCome on, doc--don't make me tell you\n\t\ttwice.\n\n<b>INT.  LOUIS\n</b>\nHe glances at RACHEL. Although PASCOW has spoken in a fairly loud \nvoice--and the opening door was like a bomb--she's still fast \nasleep. LOUIS looks back toward PASCOW...and then gets out of bed. \nHe's naked except for a pair of pajama bottoms.\n\n<b>INT.  PASCOW\n</b>\nHe turns and leaves the doorway.\n\n<b>INT.  LOUIS\n</b>\nHe reaches the bedroom doorway himself and looks back at:\n\n<b>INT.  THE BED, LOUIS'S POV\n</b>\nRACHEL is sleeping as before, and LOUIS himself is also in bed \nasleep, although his rest is uneasy...as if he's having a bad \ndream.\n\n<b>INT.  THE DOORWAY, WITH LOUIS\n</b>\n\t\t\t\tLOUIS (relieved)\n\t\tOh. Thank God.\n\n\t\t\t\tPASCOW (Voice)\n\t\tHurry up, doc.\n\n<b>INT.  THE KITCHEN\n</b>\nLOUIS enters and crosses toward the door which gives on the \nshed/garage. This door stands open. LOUIS pauses by it.\n\n\t\t\t\tPASCOW (low)\n\t\tCome on, doc...\n\nLOUIS goes into:\n\n<b>INT.  THE SHED/GARAGE\n</b>\nThe station wagon is a dark hulk. LOUIS crosses to it and stands, \nperplexed.\n\nPASCOW looms softly behind him and puts an arm around him. LOUIS \nturns... and suddenly his face is less than an inch from PASCOW'S \nmutilated face.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tLet's go, doc.\n\n\t\t\t\tLOUIS (moans)\n\t\tI don't like this dream.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tWho said you were dreaming?\n\nHe begins to move toward the garage door. After a moment LOUIS \nfollows him.\n\n<b>EXT.  THE FIELD BEHIND THE HOUSE, LONG  NIGHT\n</b>\nWe can see two shapes moving up the path toward the woods--PASCOW \nand, behind him, LOUIS.\n\n<b>EXT.  THE PET SEMATARY ARCH\n</b>\nCAMERA HOLDS, THEN PANS DOWN as LOUIS passes under the arch.\n\n<b>EXT.  LOUIS, CLOSE\n</b>\nHe looks around, obviously afraid.\n\n<b>EXT.  THE PET SEMATARY, LOUIS'S POV\n</b>\nWe can see why. By starlight this is one scary place.\n\n<b>EXT.  LOUIS\n</b>\nHe suddenly sees something else, and now his fear is close to \nterror.\n\n<b>EXT.  THE DEADFALL, LOUIS'S POV\n</b>\nThe face is back in the tumbled branches. It yawns and snarls.\n\n<b>EXT.  LOUIS\n</b>\nHe walks toward the deadfall as if hypnotized. PASCOW'S hand falls \non his shoulder. LOUIS turns, terrified.\n\n<b>EXT.  PASCOW, CLOSE\n</b>\nHe really is a dreadful mangled mess.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tThis is the place where the dead speak.\n\n<b>EXT.  LOUIS\n</b>\nHe closes his eyes.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI want to wake up. I want to wake up,\n\t\tthat's all. I--\n\n<b>EXT.  LOUIS AND PASCOW\n</b>\n<b>\t\t\t\tPASCOW\n</b>\t\tThe door must not be opened. The\n\t\tbarrier must not be crossed. Don't\n\t\tgo on, doc. No matter how much you\n\t\tfeel you have to. There's more\n\t\tpower here than you know.\n\nHe points at:\n\n<b>EXT.  THE DEADFALL\n</b>\nThat grinning face--and perhaps now there are other effects as \nwell, subtle but there? Dim red light? A misty smoke drifting \nthrough the tumbled dead branches? The director will know.\n\nAfter a moment there is a HUGE GRUNTING ROAR from the woods behind \nthe deadfall--it sounds like no animal we've ever heard before. \nThere is the sound of something huge shifting and snapping a tree \nlike a toothpick.\n\n<b>EXT.  PASCOW AND LOUIS\n</b>\nLOUIS has crumbled to PASCOW'S feet. His eyes are squeezed tightly \nshut.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tPlease, I want to wake up. Leave me \n\t\talone. It's not my fault you died; you \n\t\twere as good as dead when they brought\n\t\tyou in--\n\n<b>\t\t\t\tPASCOW\n</b>\t\tThe power of this place is old and\n\t\talways restless. Sometimes the dead\n\t\tdo more than speak. Remember, doc.\n\n<b>CAMERA BEGINS MOVING SLOWLY IN ON LOUIS.\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tLeave me alone!\n\n<b>\t\t\t\tPASCOW\n</b>\t\tRemember.\n\n<b>CAMERA IS TIGHT ON LOUIS.\n</b>\n\t\t\t\tRADIO (voice)\n\t\t--another beautiful day in Maine!\n\t\tThis is Michael O'Hara sayin' that\n\t\tthe git-go ain't gonna be that bad.\n\t\tTemps are going all the way up to 70...\n\t\tWe got the Ramones for Ludlow...here's\n\t\t\"Sheena.\"\n\nAs the Ramones start blasting \"Sheena Is A Punk Rocker\":\n\n<b>INT.  LOUIS, IN BED\n</b>\nHis eyes snap open. He's in his own bedroom. As he sits up THE \nCAMERA ANGLE WIDENS OUT so we can see that he's in bed alone; the \ncovers on RACHEL'S side are thrown back.\n\nAfter the initial confusion and fear, LOUIS looks deeply relieved;\nhe looks the way I suppose we all look upon waking up and \nrealizing our worst dreams were only dreams after all.\n\n\t\t\t\tRACHEL (calls)\n\t\tYou up, doc?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tGetting there.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tI got eggs down here!\n\n<b>\t\t\t\tLOUIS\n</b>\t\tGood d--\n\nHe throws the covers back and freezes.\n\n<b>INT.  LOUIS'S FEET, LOUIS'S POV\n</b>\nThey are covered with mud and pine needles. The sheets are greased \nwith woods-muck.\n\n<b>INT.  LOUIS, CU\n</b>\nUtter terror.\n\n<b>INT.  THE LAUNDRY CHUTE, CU\n</b>\nLOUIS'S hands enter the shot and dump a bundle of sheets into the \nchute.\n\n<b>INT.  LOUIS, IN THE UPSTAIRS HALL\n</b>\nHe's naked but for a towel around his waist. He's obviously fresh \nfrom the shower.\n\nHe starts down to the bedroom to dress.\n\nBLACK. And on it a third title card: CHURCH.\n\nOver this the SOUND of a RINGING TELEPHONE.\n\n\t\t\t\tLOUIS (voice)\n\t\tHello?\n\n<b>INT.  THE CREED LIVING ROOM  AFTERNOON\n</b>\nThere's a bowling match on TV. LOUIS, dressed in his Saturday \nafternoon grubs (jeans and a Maine sweatshirt), has the phone to \nhis ear.\n\n\t\t\t\tJUD CRANDALL (phone filter)\n\t\tLouis? 'Fraid you may have a spot of\n\t\ttrouble.\n\n\t\t\t\tLOUIS (frowning)\n\t\tJud? What trouble?\n\n<b>INT.  THE CRANDALL LIVING ROOM, WITH JUD\n</b>\nHe's on the phone, looking out his window.\n\n<b>\t\t\t\tJUD\n</b>\t\tDid you tell me Rachel took the\n\t\tkids back to Chicago for a few days?\n\n<b>INT.  THE CREED LIVING ROOM, WITH LOUIS\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tFor Ellie's birthday, yes. I didn't\n\t\tgo because her old man thinks I'm a\n\t\tshit and the feeling is heartily re-\n\t\tciprocated...they'll be back tomorrow\n\t\tnight. Jud, what's this about?\n\n<b>INT.  THE CRANDALL LIVING ROOM, WITH JUD\n</b>\n<b>\t\t\t\tJUD\n</b>\t\tWell, there's a dead cat over here on\n\t\tthe edge of my lawn, Louis. I think it\n\t\tmight be your daughter's.\n\n<b>INT.  THE CREED LIVING ROOM, WITH LOUIS\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tChurch? Oh. Oh, Jesus.\n\n<b>EXT.  THE CRANDALL HOUSE, MEDIUM-LONG\n</b>\nWe're looking across from the CREED lawn. LOUIS waits for one of \nthose trucks to go blasting by and then crosses. It's cold and \nwindy. Downed autumn leaves fly.\n\nLOUIS and JUD stand over a small furry body like mourners.\n\n\t\t\t\tJUD (voice)\n\t\tWell?\n\n<b>EXT.  THE CAT'S BODY\n</b>\nIt's lying on its belly and doesn't look much damaged. Hands--\nLOUIS'S--come into the frame. He puts one hand under the cat's \nhead and lifts it so the open eyes, now a dull green, stare into \nTHE CAMERA. There's some blood on its ruff. That's all.\n\n<b>EXT.  LOUIS AND JUD, ON THE EDGE OF THE CRANDALL LAWN\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tIt's Church.\n\n<b>\t\t\t\tJUD\n</b>\t\tI'm sorry. At least it don't look like\n\t\the suffered.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tEllie will, though. She'll suffer plenty.\n\nFrom his jacket pocket he takes a green plastic garbage bag and \nhands it to JUD. JUD holds the bag's mouth open on the ground \nwhile LOUIS kind of shoves the body in. During this:\n\n<b>\t\t\t\tJUD\n</b>\t\tLoved that cat pretty well, didn't she?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYes.\n\nLOUIS twists the bag shut and puts one of those plastic ties on \nit. Then he holds it up.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tBagged cat. What a mess.\n\n<b>\t\t\t\tJUD\n</b>\t\tYou going to bury him in the Pet\n\t\tSematary?\n\n\t\t\t\tLOUIS (a little bitter)\n\t\tI guess that's what it's there for, huh?\n\nDuring all of this JUD has grown peculiarly intense.\n\n<b>\t\t\t\tJUD\n</b>\t\tGoing to tell Ellie?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI don't know.\n\n<b>\t\t\t\tJUD\n</b>\t\tSeems like you told me about a promise\n\t\tyou made--\n\n<b>INT.  THE CREED KITCHEN  MORNING\n</b>\nGAGE is in his high chair. ELLIE, in her first-day-of-school \ndress, is in her place. LOUIS is sitting at his own place staring, \nhypnotized, at the middle of the table, where there is a large \nserving dish. On the dish is scrambled eggs, strips of bacon, and \nCHURCH'S corpse--staring eyes, bloody ruff and all.\n\n\t\t\t\tRACHEL (impatiently)\n\t\tDon't shilly-shally, Louis. Give the\n\t\tlittle girl her promise.\n\n<b>EXT.  THE CRANDALL LAWN, WITH JUD AND LOUIS\n</b>\n\t\t\t\tLOUIS (defensive)\n\t\tThat was a mistake. But Rachel...\n\t\tshe doesn't like to talk about\n\t\tdeath, or even think of it. Her\n\t\tyounger sister died of spinal\n\t\tmeningitis when Rachel was eight.\n\t\tRachel was there when it happened.\n\t\tAlone. I guess you could say it\n\t\tmade a complex.\n\n<b>\t\t\t\tJUD\n</b>\t\tCat's just as dead, Louis.\n\n\t\t\t\tLOUIS (snaps)\n\t\tWell that's a big help! (Pause) I'm\n\t\tsorry, Jud.\n\n<b>\t\t\t\tJUD\n</b>\t\tNo need to apologize.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tMaybe when they call I'll just tell\n\t\tEllie I haven't seen the damn cat\n\t\taround. You know?\n\n\t\t\t\tJUD (after a long pause)\n\t\tMaybe there's a better way.\n\n<b>EXT.  THE START OF THE PATH TO THE PET SEMATARY, LONG  EVENING\n</b>\nLOUIS and JUD cross the road from the CRANDALL side. LOUIS is \ncarrying the plastic bag in one hand and a flashlight in the \nother. JUD has a pick and shovel in one hand and a flashlight of \nhis own in the other.\n\nEvening shadows have grown long. It's maybe an hour until dark.\n\nJUD and LOUIS stop near the replaced tire-swing.\n\n<b>EXT.  LOUIS AND JUD\n</b>\nJUD has a Walkman clipped to the belt of his pants and earphones \nslung around his neck.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tJud, this is crazy. It's going to\n\t\tbe almost dark before we get back.\n\n<b>\t\t\t\tJUD\n</b>\t\tIt's going to be dark before we even\n\t\tget where we're going, Louis. But\n\t\twe can do it...and we're going to.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tBut--\n\n<b>\t\t\t\tJUD\n</b>\t\tDoes she love the cat?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYes, but--\n\n<b>\t\t\t\tJUD\n</b>\t\tThen come on.\n\nHe puts the earphones on, effectively forestalling further \nargument, and pushes the PLAY button on the Walkman. We can hear \nMarshall Crenshaw singing \"Crystal Girl.\" JUD starts away. After a \nmoment, LOUIS follows.\n\n<b>EXT.  THE PET SEMATARY AND THE BACK OF THE ARCH  LATE EVENING\n</b>\nThe SOUND of crickets...ree-ree-ree...\n\nThe SOUND of footfalls.\n\nFaintly, the SOUND of Huey Lewis and the News, singing \"Working \nFor A Living.\"\n\nIt's now almost twilight.\n\nJUD and LOUIS enter the Pet Sematary. LOUIS is looking around \ncuriously.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWell, folks, here we are, in Louis\n\t\tCreed Dreamland.\n\nJUD snaps off the Walkman and puts the earphones around his neck \nagain.\n\n<b>\t\t\t\tJUD\n</b>\t\tWhat say, Louis?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tNothing. (Pause) Do we plant him on\n\t\tthe outer circle or start a new one?\n\n<b>\t\t\t\tJUD\n</b>\t\tWe're still not where we're going.\n\nHe walks past LOUIS and toward the deadfall. LOUIS follows.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWhat do you mean?\n\n<b>\t\t\t\tJUD\n</b>\t\tThe place we're going is on the\n\t\tother side of that.\n\nHe points at the deadfall.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWe can't climb over that. We'll break\n\t\tour necks!\n\n<b>\t\t\t\tJUD\n</b>\t\tNo. We won't. I have climbed it a time\n\t\tor two before, and I know all the places\n\t\tto step. Just follow me...move easy...don't\n\t\tlook down...and don't stop. If you stop,\n\t\tyou'll crash through for sure.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI'm not climbing that.\n\n<b>\t\t\t\tJUD\n</b>\t\tGive me the cat. I'll take care of it\n\t\tmyself.\n\nHe holds out his hand and LOUIS sees the old man means exactly as \nhe says. After a moment he says:\n\n<b>\t\t\t\tLOUIS\n</b>\t\tLet's go.\n\nJUD starts up one side of the deadfall, and in spite of its \nsnarled tangles, he mounts as easily as a man climbing a flight of \nstairs. After a few second, LOUIS follows.\n\n\t\t\t\tLOUIS (low)\n\t\tThank God my Blue Cross is paid up.\n\n<b>EXT.  THEIR FEET\n</b>\nFirst JUD'S pass THE CAMERA, then LOUIS'S, partly obscured by the \nswinging cat-bag. Their feet unerringly find the right branches \nand just as unerringly miss holes which look like ankle-breakers.\n\n<b>EXT.  LOUIS\n</b>\nHe's grinning, exhilarated.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tGod, this is amazing!\n\n<b>EXT.  JUD\n</b>\nThere are beads of sweat on the old man's face. He looks both \nstern and a little scared.\n\n<b>\t\t\t\tJUD\n</b>\t\tJust don't stop and--\n\n<b>EXT.  LOUIS\n</b>\nHe looks down.\n\n<b>EXT.  LOUIS'S FEET\n</b>\nA dead branch snaps under one of them like a gunshot and that foot \nplunges down maybe six inches.\n\n<b>EXT.  LOUIS\n</b>\nHe lurches to the edge of balance, then regains it.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tAnd don't look down. Right.\n\nHe continues.\n\n<b>EXT.  THE DEADFALL, REVERSE  TWILIGHT\n</b>\nJUD reaches the top and starts down the far side. LOUIS reaches \nthe top.\n\n<b>EXT.  LOUIS\n</b>\n\t\t\t\tLOUIS (amazed)\n\t\tHoly...!\n\n<b>EXT.  BIG GOD WOODS, LOUIS'S POV\n</b>\nIn the dying glow of twilight, this should be a mystic, awe-\ninspiring shot. There's no more scrub underbrush and junk pines \nand juniper-bracken here; ancient firs rise almost like Sequoias. \nThe sunset light shafts among them. This is a real forest... an \nold forest. And winding upward among the trees along that needle-\ncarpeted floor, clearly marked by large white stones, the path \ngoes on.\n\n<b>EXT.  LOUIS\n</b>\nHe's stopped on top of the deadfall, still surveying all this with \nfrank amazement.\n\n<b>EXT.  JUD\n</b>\n\t\t\t\tJUD (turns to look)\n\t\tCome on, Louis--don't stop!\n\n<b>EXT.  LOUIS, ATOP THE DEADFALL\n</b>\n\t\t\t\tLOUIS (grinning)\n\t\tI'm all right! I'm f--\n\n<b>EXT.  LOUIS'S FEET\n</b>\nOne of the branches snaps. LOUIS'S foot plunges. His cuff rips.\n\n<b>EXT.  LOUIS, JUD'S POV\n</b>\nWe're looking up at a fairly steep angle as LOUIS staggers off-\nbalance. He steps with his other foot, misses, and goes flying.\n\n<b>EXT.  LOUIS, CLOSER\n</b>\nHe does a half-somersault in the air and hits the deadfall on his \nback, the green garbage bag flying out of his hand. His flashlight \nalso goes. Branches crack. White dust puffs out from under him.\n\n<b>EXT.  JUD, AT THE BASE OF THE DEADFALL\n</b>\nLOUIS thumps to the ground nearby. JUD kneels beside him.\n\n<b>\t\t\t\tJUD\n</b>\t\tLouis! You all right?\n\nLOUIS sits up groggily. His pants are torn. His sweatshirt is \ntorn. His ankle is bleeding.\n\n\t\t\t\tLOUIS (dazed)\n\t\tSure. I guess I just lost my happy \n\t\tthoughts for a second there.\n\nLOUIS gets slowly up and retrieves the bag, which is rather \nshredded now--and we can see catfur through some of the rents.\n\n\t\t\t\tLOUIS (continues)\n\t\tI shouldn't have stopped...and it\n\t\tdoes bite.\n\nHe whaps the flashlight against his palm a time or two and the \nlight comes on. Satisfied, he shuts it off.\n\n<b>\t\t\t\tJUD\n</b>\t\tNo, you shouldn't have stopped. But\n\t\tyou got away with it. Important thing\n\t\tis are you sure you're all right?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYes. (Pause) Where are we going, Jud?\n\n<b>\t\t\t\tJUD\n</b>\t\tYou'll see before long. Let's go.\n\nHe starts off up the path. After a moment LOUIS follows, carrying \nthe bag.\n\n<b>EXT.  LOUIS AND JUD, FROM THE DEADFALL\n</b>\nAgain, there should be a sense of awe and mystery as they go \ntolling up the path into the twilight, dwarfed by those ancient \nfirs.\n\nSOUND OF CRICKETS, LOW at first, then UP TO LOUD: Ree-ree-ree...\n\n<b>\t\t\t\t\t\t\tDISSOLVE TO:\n</b>\n<b>EXT.  LOUIS AND JUD, AT THE EDGE OF LITTLE GOD SWAMP  TWILIGHT\n</b>\nLots of undergrowth here, and creeping ground-mist, too. The SOUND \nOF CRICKETS is now only a part of the soundtrack: BUZZ OF CICADAS, \nTHUMP OF FROGS. Swamp-sounds.\n\nLOUIS looks frankly doubtful.\n\n<b>\t\t\t\tJUD\n</b>\t\tThis next bit's like the deadfall, Louis--\n\t\tyou got to walk steady and easy. Just follow\n\t\tme and don't look down.\n\n<b>EXT.  LITTLE GOD SWAMP, LOUIS'S AND JUD'S POV  DEEP TWILIGHT\n</b>\nMysterious...awesome...scary. Dead trees poke out of the murk like \ntwisted hands. There's scummy water standing around tussocks \ncovered with long grass, most of it dead. There's a lot of choking \nunderbrush.\n\nAll of this fades away into a grim, obscuring fog.\n\n<b>EXT.  LOUIS AND JUD\n</b>\n<b>\t\t\t\tJUD\n</b>\t\tMicmacs used to call it Little God Swamp.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tIs there quicksand?\n\n<b>\t\t\t\tJUD\n</b>\t\tAyuh.\n\n\t\t\t\tLOUIS (nervous; joking)\n\t\tAre there ghosts?\n\nJUD looks at him expressionlessly.\n\n<b>\t\t\t\tJUD\n</b>\t\tAyuh.\n\nJUD starts off, stepping to the first tussock. After a moment, \nLOUIS follows.\n\n<b>EXT.  JUD, CU\n</b>\nHis face is set, strange.\n\n<b>\t\t\t\tJUD\n</b>\t\tThere's a lot of funny things down\n\t\tthis way, Louis.\n\n<b>EXT.  LOUIS, BEHIND JUD\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tYou're telling me.\n\n<b>EXT.  JUD\n</b>\n\t\t\t\tJUD (still walking)\n\t\tThe air's heavier...more electrical...\n\t\tsomething. You might see St. Elmo's\n\t\tFire...what the sailors call 'foo-lights.'\n\t\tIt makes funny shapes, but it's nothing.\n\n<b>EXT.  LOUIS\n</b>\nHE looks up and his eyes widen as he sees:\n\n<b>EXT.  ANGLE ON LITTLE GOD SWAMP, LOUIS'S POV\n</b>\nA faintly glowing, ethereal shape hangs in the branches of one of \nthe dead trees. It looks a bit like a corpse. In fact, I think it \nlooks quite a bit like PASCOW'S corpse.\n\nAs we watch it fades...fades...is gone.\n\n<b>EXT.  LOUIS\n</b>\nHe's somewhere between being mystified and puzzled and being \nscared. Now a weakly glowing fireball rolls slowly across the \nsurface of the standing water toward him...and then just fades \ninto the thick mist.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tIt's funny, all right.\n\n<b>EXT.  JUD\n</b>\n<b>\t\t\t\tJUD\n</b>\t\tJust don't stop, Louis. You don't\n\t\tever want to stop down here in\n\t\tLittle God. (Pause) And you don't\n\t\tever want to look behind you,\n\t\twhatever you hear.\n\n<b>EXT.  JUD AND LOUIS, LONG ANGLE  NIGHT\n</b>\nWe see them moving through the mist like wraiths, JUD with his \ndigging tools, LOUIS with his light and his Hefty-Bag coffin. The \nwhole swamp is glowing dimly.\n\n<b>EXT.  THE FAR SIDE OF LITTLE GOD SWAMP  NIGHT\n</b>\nIn the extreme f.g. we can see firm ground sloping up. Ahead is a \nthick white mist. And here comes JUD and LOUIS slogging through it \nand out of it. Both of them are wet from the knees down. They head \ninto the woods on the far side.\n\n<b>EXT.  A LOW, STONY BLUFF OR STEEP HILL\n</b>\nIn the book this is described as being almost a cliff, but a rocky \nhill rising out of the woods would serve just as well. We can see \nsteps cut into the side, and two figures--LOUIS and JUD--toiling \nup them.\n\n<b>EXT.  JUD AND LOUIS, A CLOSER SHOT\n</b>\nJUD'S panting and out of breath; LOUIS is, if anything, in worse \nshape.\n\n<b>\t\t\t\tJUD\n</b>\t\tAlmost there, Louis.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYou keep saying that.\n\n<b>\t\t\t\tJUD\n</b>\t\tThis time I mean it.\n\nHe tops the last step and stands on a rocky level under the stars, \nthe wind blowing his hair off his deeply lined brow. A few moments \nlater LOUIS joins him and stares with undisguised wonder.\n\n<b>EXT.  THE MICMAC BURYING GROUND, LOUIS AND JUD'S POV\n</b>\nThe top of this hill or bluff is rocky and bare, but there are a \nnumber of rocky piles. But for every pile of rocks we can see, \nthere are ten littered heaps, as if the neat piles had been burst \napart. There's a shape to all of this, and it is the shape of the \nPet Sematary: concentric circles.\n\nSOUND: The wind, blowing ceaselessly.\n\n<b>EXT.  LOUIS AND JUD, AT THE EDGE OF THE BURYING GROUND\n</b>\n\t\t\t\tLOUIS (awed)\n\t\tWhat is this place?\n\n<b>\t\t\t\tJUD\n</b>\t\tThis was their burying ground, Louis.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWhose burying ground?\n\n<b>\t\t\t\tJUD\n</b>\t\tThe Micmac Indians. I brought you here\n\t\tto bury Ellen's cat.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWhy? For God's sake, why?\n\n<b>\t\t\t\tJUD\n</b>\t\tI had my reasons, Louis. We'll talk later.\n\t\tAll right?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI guess so...but...\n\n<b>\t\t\t\tJUD\n</b>\t\tYou want to rest a bit before you start?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tNo, I'm okay. Will I really be able to\n\t\tdig him a grave? The soil looks thin.\n\n<b>\t\t\t\tJUD\n</b>\t\tSoil's thin, all right. But you'll manage.\n\nHe hands him the pick and shovel.\n\n<b>\t\t\t\tJUD\n</b>\t\tI'm going to sit over yonder and have a\n\t\tsmoke. I'd help you, but you've got to\n\t\tdo it yourself. Each buries his own.\n\t\tThat's how it was done then.\n\nJUD walks away, leaving LOUIS with the digging tools in one hand \nand the flashlight in the other. After a minute, LOUIS walks out \ninto the burying ground.\n\n<b>EXT.  LOOKING DOWN INTO A SHALLOW HOLE  NIGHT\n</b>\nSOUND: The wind. It blows ceaselessly up here.\n\nThe hole's about two and a half feet deep. Stubby rocks protrude \nfrom the sides. The pick comes down, hits a rock at the bottom, \nand flashes fire.\n\n<b>EXT.  LOUIS\n</b>\nHe drops the pick and sticks his hurt hands in his armpits. Beside \nhim we see a low pile of rocks and earth.\n\n\t\t\t\tJUD (voice)\n\t\tShould be deep enough.\n\nHe joins LOUIS. He's got a lot of rocks in his arms.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYou think so?\n\nHe notices the rocks.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWhat are those for?\n\n<b>\t\t\t\tJUD\n</b>\t\tYour cairn.\n\n<b>EXT.  THE MICMAC BURYING GROUND, LOUIS'S POV\n</b>\nThose tumbled piles of rock are very obvious.\n\n<b>EXT.  LOUIS AND JUD, BY CHURCH'S GRAVE\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tDoesn't look like they last long.\n\n<b>\t\t\t\tJUD\n</b>\t\tDon't worry about that.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tJud, why am I doing all this?\n\n<b>\t\t\t\tJUD\n</b>\t\tBecause it's right.\n\nHe walks off again.\n\nLOUIS looks after him for a moment, then kneels down.\n\n<b>EXT.  LOUIS, BY THE GARBAGE BAG\n</b>\nHe opens it and looks in at CHURCH'S stiffening corpse.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tPax vobiscum, Church old buddy. You\n\t\twere a hell of a god cat. I doubt if\n\t\tyou were worth all this aggravation,\n\t\tbut you were a hell of a good cat.\n\nHe tumbles the bag containing the body into the grave, and then \nbegins pushing the stony soil over it with the spade.\n\n<b>EXT.  THE CAIRN, CU  NIGHT\n</b>\nLOUIS'S hands come into the frame and add a final two or three \nstones.\n\n<b>EXT.  LOUIS, BY THE CAIRN\n</b>\nHe looks at it for a moment and stands up. JUD is right there.\n\n<b>\t\t\t\tJUD\n</b>\t\tThat's fine. You did real good.\n\nLOUIS looks at him.\n\n<b>EXT.  THE CREED HOUSE  NIGHT\n</b>\nThere's a light on in the kitchen, but that's all. There's silence \nat first, and then the PHONE STARTS RINGING.\n\n<b>EXT.  LOUIS'S FIELD  NIGHT\n</b>\nLOUIS and JUD are coming down the path with their tools and their \nlights. They are both clearly fagged out.\n\nSOUND, FAINT: The telephone.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tOh, shit! Rachel!\n\nHe drops the tools and sprints.\n\n<b>EXT.  THE CREED'S SIDE YARD, BY THE TIRE SWING\n</b>\nLOUIS runs into the side yard. SOUND of the phone is louder.\n\n<b>EXT.  THE KITCHEN DOOR OF THE CREED HOUSE, WITH LOUIS\n</b>\nHe runs to the door and inside.\n\n<b>EXT.  THE END OF THE PATH, WITH JUD\n</b>\nHe stands there, eyes inscrutable.\n\n<b>INT.  THE LIVING ROOM, WITH THE PHONE\n</b>\nIt stops. A beat later LOUIS enters the room. He picks it up, \nalthough he already knows it's too late. He listens to the SOUND \nof the dial tone and then drops it back into the cradle, \ndisgusted.\n\nHe starts to dial a number from memory.\n\n\t\t\t\tJUD (voice)\n\t\tLouis.\n\n<b>INT.  THE KITCHEN/LIVING ROOM DOORWAY, WITH JUD\n</b>\n<b>\t\t\t\tJUD\n</b>\t\tWhen you talk to 'em, not one word\n\t\tabout what we done tonight. 'S'far's\n\t\tyou know, the cat's still fine.\n\n<b>INT.  LOUIS, BY THE PHONE\n</b>\nAfter a moment he lowers it into the cradle.\n\n<b>INT.  JUD\n</b>\n<b>\t\t\t\tJUD\n</b>\t\tYou'll understand. In the meantime,\n\t\tkeep your peace. What we did, Louis,\n\t\twas a secret thing. Women are supposed\n\t\tto be the ones who are good at\n\t\tkeeping secrets, but any woman who\n\t\tknows anything at all would tell you\n\t\tshe's never seen into a man's heart.\n\t\tThe soil of a man's heart is stonier,\n\t\tLouis--like the soil up there in the\n\t\told Micmac burying ground. A man\n\t\tgrows what he can...and tends it.\n\nDuring this, he's come across the room to LOUIS and dropped his \nhand on LOUIS'S shoulder.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tBut--\n\n<b>\t\t\t\tJUD\n</b>\t\tNo buts! Accept what's done, Louis.\n\t\tWhat we done was right. Another time\n\t\tit might not be, but tonight it was...\n\t\tat least I hope to Christ it was. Now\n\t\tyou make your call...but not a word\n\t\tabout tonight.\n\n<b>EXT.  THE ROAD, WITH JUD\n</b>\nSOUNDS: Boops and beeps of a touch-tone telephone. Ringing. Then:\n\n\t\t\t\tDORY GOLDMAN (voice)\n\t\tGoldman residence.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tHi, Dory...it's Louis--\n\nDuring this, another SOUND has been growing: an approaching truck. \nAs JUD gains his side of the road, he looks back, and we read fear \non his face--no matter what he said to LOUIS, he's sorry for \ntonight's piece of work.\n\nA moment later a highballing Orinco truck cuts between THE CAMERA \nand JUD.\n\n<b>INT.  LOUIS, IN THE LIVING ROOM  NIGHT\n</b>\nHe's on the phone, smiling and happy.\n\n\t\t\t\tRACHEL (voice)\n\t\tYou want to talk to the birthday girl?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tThat'd be real fine.\n\n\t\t\t\tELLIE (voice)\n\t\tHi...daddy?\n\n\t\t\t\tLOUIS (sings)\n\t\tHappy birthday to you/Happy birthday\n\t\tto you/Happy birthday, dear Ellie/Happy\n\t\tbirthday to you!\n\n\t\t\t\tELLIE (voice)\n\t\tThat was awful, daddy.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYeah, I know...how are things out \n\t\tthere in Chicagoland?\n\n<b>\t\t\t\tELLIE\n</b>\t\tFine...except when Mom was airing\n\t\tGage's diaper rash, he walked away and\n\t\tgot into Grampa's study and pooped in\n\t\tGrampa's favorite chair.\n\n\t\t\t\tLOUIS (grinning broadly)\n\t\tWay to go, Gage!\n\n\t\t\t\tELLIE (voice)\n\t\tWhat?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI said that's too bad. What did you\n\t\tget for presents from Gramma and Grampa?\n\n\t\t\t\tELLIE (voice)\n\t\tLots of stuff! I got two dresses...and\n\t\ta Chatty Cathy doll...\n\n<b>INT.  THE GOLDMAN LIVING ROOM, WITH ELLIE\n</b>\nShe's dressed for bed, in fuzzy pink pajamas. Her Chatty Cathy is \ncrooked in one arm. In her lap is a Garfield transistor radio.\n\n<b>\t\t\t\tELLIE\n</b>\t\t...and a Garfield radio! How's Church,\n\t\tdad? Does he miss me?\n\n<b>INT.  THE CREED LIVING ROOM, WITH LOUIS\n</b>\nThe smile fades off his face. It's replaced with a look of \ncombined guilt and unhappiness. He's looking at his hands, which \nare still dark with the dirt from CHURCH'S grave.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWell...I guess he's just fine, Ellie.\n\t\tI haven't seen him this evening, but--\n\n<b>INT.  THE GOLDMAN LIVING ROOM, WITH ELLIE\n</b>\nRACHEL, holding GAGE, sits on the arm of ELLIE'S chair.\n\n<b>\t\t\t\tELLIE\n</b>\t\tWell, make sure you put him down\n\t\tcellar before you go to bed so he\n\t\tcan't run out in the road and get\n\t\tgreased. And kiss him goodnight for me.\n\n\t\t\t\tLOUIS (voice)\n\t\tYuck! Kiss your own cat!\n\n<b>\t\t\t\tELLIE\n</b>\t\tWant to talk to Gage?\n\nBefore he can answer, she puts the phone in GAGE'S hand. ELLIE and \nRACHEL watch, amused, as GAGE gobbles into it. Perhaps RACHEL \nencourages him to say a few words.\n\n<b>INT.  THE CREED LVING ROOM, WITH LOUIS\n</b>\nFrom the telephone comes the sound of GAGE talking and chortling. \nLOUIS is not listening. His eyes--and his mind--are far away.\n\n<b>EXT.  THE CREED HOUSE  MORNING\n</b>\nLOUIS is raking leaves on the side lawn, near the tree with the \ntire swing. After a moment or two of this he props the rake \nagainst the tree and starts toward the garage. He goes in.\n\n<b>EXT.  THE GARAGE, WITH LOUIS\n</b>\nIt's dim in here. LOUIS is crossing to the door which communicates \nto the kitchen. As he passes the station wagon, he hears a cat \nHISS. He turns.\n\n<b>INT.  CHURCH, ECU\n</b>\nHe's on top of the car, but at this point we probably don't \nnotice; THE CAMERA is so close that CHURCH looks like he's coming \nright down our throats. He's hissing angrily.\n\n<b>INT.  LOUIS\n</b>\nHe recoils and stumbles backward with a cry. He hits a tool-rack \non the wall and a lot of them fall down with a LOUD JANGLING \n<b>NOISE.\n</b>\n<b>INT.  ON TOP OF THE STATION WAGON, WITH CHURCH\n</b>\nHe jumps down, frightened by the noise, and the CAMERA TRACKS as \nhe goes flying out the garage door into the sunlight.\n\n<b>INT.  LOUIS\n</b>\nHe gets slowly to his feet again. He's getting over his fright but \nwe can see he's totally freaked out by what gave him that fright. \nHe goes to the garage door and looks out.\n\n\t\t\t\tLOUIS (calls)\n\t\tChurch?\n\n<b>EXT.  THE SIDE YARD, LOUIS'S POV\n</b>\nGrass and fallen leaves. No sign of CHURCH.\n\n<b>EXT.  LOUIS'S STUNNED FACE, CU\n</b>\n<b>INT.  THE KITCHEN, WITH LOUIS\n</b>\nHe's spooning cat-food into a dish. He goes to the door--there \nshould be a total of three doors in the kitchen: one to the living \nroom, one to the shed/garage, and one which leads directly \noutside. LOUIS uses this latter door now.\n\n<b>EXT.  THE KITCHEN STOOP, WITH LOUIS\n</b>\nHe puts the dish of food down and sits beside it.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tFood, Church...food!\n\nSOUND: Miaow.\n\n<b>EXT.  THE SIDE OF THE HOUSE, LOUIS'S POV\n</b>\nCHURCH comes slinking out of the bushes and comes slowly toward \nTHE CAMERA. He stops, looking mistrustful.\n\n<b>EXT.  LOUIS\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tCome on, Church! Chow down!\n\n<b>EXT.  CHURCH\n</b>\nHe crosses to the stoop and begins eating the food.\n\n\t\t\t\tLOUIS (to himself)\n\t\tChrist. I don't believe this.\n\nHe picks CHURCH up. CHURCH miaows again--he wants the food.\n\n\t\t\t\tLOUIS (wincing)\n\t\tGod, you stink, Church.\n\nCHURCH is looking at the food, trying to get out of LOUIS'S arms.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tIn a second.\n\nHe tilts the cat's head back so he can get a look at CHURCH'S \nneck.\n\n<b>EXT.  CHURCH'S NECK, CU (LOUIS'S POV)\n</b>\nThere's some sort of mark here--a clear remnant\tof the crash. A \nline of white fur, or perhaps a dark red scar where no fur at all \ngrows.\n\n<b>EXT.  LOUIS AND CHURCH, ON THE STOOP\n</b>\nLOUIS sees something else as he lets the cat's neck go. He tweezes \nsomething out of CHURCH'S whiskers.\n\n<b>EXT.  LOUIS'S HAND, ECU\n</b>\nIt's a shred of green plastic.\n\n<b>EXT.  LOUIS AND CHURCH\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tChewed his way out. Jesus Baldheaded\n\t\tChrist, he ch--\n\nCHURCH suddenly claws at his face.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tOw!\n\nHe claps his hand to his face. CHURCH leaps for the food. LOUIS \nslowly takes his hand away. There are claw marks on his cheek, \nwelling blood. He looks at the cat.\n\n<b>EXT.  JUD CRANDALL'S GARDEN, WITH JUD\n</b>\nThe garden is a plot of about half an acre. JUD comes trundling \nslowly along a row, pushing a wheelbarrow. There are several \npumpkins in it. JUD is wearing old khaki gardening pants and a \nRamones sweatshirt. He's wearing his headphones and we can hear \nthe Romantics doing \"What I Like About You.\" JUD is singing along \nand bopping a little--as much as his arthritis will allow, if you \ncan dig it.\n\nHe sees a real big pumpkin, stops, and bends over to get it.\n\nHe takes out his pocket-knife and slits the pumpkin-vine. He gets \nthe pumpkin in his arms and stands up. He turns...and LOUIS is \nright there (kind of a cheap jump, but always fun), looking \ntotally stunned.\n\nJUD, startled, drops the pumpkin. LOUIS reaches out and slides the \nphones off JUD'S ears.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWhat did we do?\n\n<b>INT.  THE CRANDALL KITCHEN\n</b>\nLOUIS is sitting at the kitchen table. JUD is at the fridge. JUD \ncomes back with a couple of long-necked bottles of beer and opens \nthem.\n\n<b>\t\t\t\tJUD\n</b>\t\tI most generally don't start before\n\t\tnoon, but this looks like an exception.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWhat did we do, Jud?\n\n<b>\t\t\t\tJUD\n</b>\t\tWhy, saved a little girl from being\n\t\tunhappy...that's all. Drink up, Louis!\n\nLOUIS drinks about half the beer.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI tried to tell myself I buried him\n\t\talive. You know--Edgar Allan Poe meets\n\t\tFelix the Cat. But...\n\n<b>\t\t\t\tJUD\n</b>\t\tWouldn't wash?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tNo. I'm a doctor. I know death when I\n\t\tsee it, and Church was dead. He smells\n\t\thorrible and he uses his claws, but\n\t\the's alive...and I feel like I'm going\n\t\tcrazy. It was that place, wasn't it?\n\n<b>\t\t\t\tJUD\n</b>\t\tAyuh. It was the rag-man told me about\n\t\tthe place--Stanley Bouchard. Us kids\n\t\tjust called him Stanny B. He was half\n\t\tMicmac himself.\n\nLOUIS drains his beer.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tCan I have another one?\n\n<b>\t\t\t\tJUD\n</b>\t\tI guess it wouldn't hurt.\n\nHe gets up and goes to the fridge.\n\n<b>INT.  JUD, AT THE FRIDGE\n</b>\n<b>\t\t\t\tJUD\n</b>\t\tThe Micmacs used to bury their dead\n\t\tup there long before the whites came.\n\nHe returns to the table with the beer.\n\n<b>\t\t\t\tJUD\n</b>\t\tThey buried their dead and for a long\n\t\ttime their dead stayed buried. Then\n\t\tsomething happened. Half the tribe died\n\t\tin a season. The rest moved on. They\n\t\tsaid a Wendigo had soured the ground.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWendigo?\n\n<b>\t\t\t\tJUD\n</b>\t\tSpirit of the north country. Not a good\n\t\tspirit. Wendigos are great liars and\n\t\ttricksters, according to the stories. \n\t\tAnd if one touches you...\n\nJUD pauses, perhaps a flustered, and gathers his thoughts.\n\n<b>\t\t\t\tJUD\n</b>\t\tMaybe it really was a Wendigo--\n\t\tI ain't the one to say it wasn't--\n\t\tor maybe it was just some disease.\n\t\tWhatever the reason, those that were\n\t\tleft moved on. But they left that\n\t\tplace...the way it is now.\n\nJUD shrugs, and drinks.\n\n<b>EXT.  JUD AS A BOY, CU/SEPIA TONE  DAY\n</b>\nThe time here is about 1910. JUD is wearing short pants. He's \ncrying, not in any big-deal histrionic way, but as if he means to \nkeep doing it for a long time. I mean he looks really sad.\n\n\t\t\t\tJUD (voice)\n\t\tI loved my dog a lot, Louis. When Spot\n\t\tdied, I thought I was gonna die.\n\nJUD is sitting on the front stoop. It's the same house JUD lives \nin now, but the porch hasn't been added yet, and the road is dirt \nrather than tar.\n\nAlong this road comes a horse-drawn wagon--STANNY B.'S wagon. The \nwagon's full of junk, rags, bottles...stuff to sell and swap. \nStrung across the top are bells, and we can hear their CHIMING \nSOUND...but faint, like bells heard in a dream.\n\nSTANNY B. is old and drunk. Dust spumes up behind the wagon as he \ndraws up to the CRANDALL house and stops. He gets down, almost \nfalls, takes a bottle out of his back pocket, drinks, and \napproaches JUD. We can see him speaking.\n\n<b>INT.  JUD'S KITCHEN, WITH JUD AND LOUIS\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tYou and this old Indian rag-man--\n\n<b>\t\t\t\tJUD\n</b>\t\tStanny B. did for me what I did for\n\t\tyou last night, Louis. Only I wasn't\n\t\talone when Spot came back.\n\n<b>EXT.  THE CRANDALL BACK YARD/SEPIA TONE  DAY\n</b>\nJUD'S MOTHER is back to THE CAMERA, hanging sheets on the line. \nThe sheets billow. And suddenly, pushing out from behind them, \nquite near her, is a small mongrel dog. SPOT. He's covered with \ngraveyard dirt. His eyes are red and rolling. He splashes the \nsheets with the muck of his passage.\n\n\t\t\t\tJUD (voice)\n\t\tMy mother was with me.\n\nShe sees who it is--what it is--and backs away, screaming, \nhorrified.\n\n<b>EXT.  SPOT, CLOSER/SEPIA\n</b>\n\t\t\t\tJUD (voice)\n\t\tHe'd got caught in bobwire that infected.\n\t\tYou could still see the marks on him.\n\nAnd so we can, around his neck and along the side of his head. \nThese marks are the counterpart of the marks we've already seen on \n<b>CHURCH.\n</b>\nSOUND of JUD'S MOM SCREAMING. Like the bells, these are screams \nheard in a dream.\n\n<b>EXT.  THE BACK STOOP OF THE CRANDALL HOUSE/SEPIA\n</b>\nThe BOY JUD comes running out, dressed in a night-shirt.\n\n<b>EXT.  JUD'S MOM/SEPIA (JUD'S POV)\n</b>\nShe's cringing against the fence at the rear of the yard. SPOT \nstands in front of her, swaying from side to side, as if doped.\n\n\t\t\t\tJUD'S MOM (dim; far)\n\t\tGet your dog, Jud! He stinks of the\n\t\tground you buried him in! Come here\n\t\tand get your dog!\n\nShe is in utter terror.\n\n<b>EXT.  THE BOY JUD/SEPIA\n</b>\nHorrified...ashamed.\n\n<b>EXT.  JUD'S MOM/SEPIA\n</b>\n\t\t\t\tJUD'S MOM (terror)\n<b>\t\tCOME AND GET YOUR DOG!!\n</b>\n<b>INT.  JUD AND LOUIS, IN JUD'S KITCHEN\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tHow did your mother take it, Jud?\n\t\tHow did she take it when your dog\n\t\tcame back from the dead?\n\nJUD'S face is a complication. He's lying to LOUIS, certainly--but \nis he also lying to himself? Yes, I think so.\n\n<b>\t\t\t\tJUD\n</b>\t\tWell, she was a little upset at first,\n\t\tand that's why I thought you ought to\n\t\thold your peace when you talked to\n\t\tyour people last night...you did, didn't\n\t\tyou, Louis?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYes.\n\n<b>\t\t\t\tJUD\n</b>\t\tWhy, then, things should be fine.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tA little upset is all she was? Because\n\t\tI'll tell you, Jud, my brains feel a\n\t\tlittle like a nuclear reactor on the\n\t\tedge of a meltdown.\n\n<b>\t\t\t\tJUD\n</b>\t\tShe got used to the idea. Spot lived\n\t\tanother four years. He died peacefully\n\t\tin the night that second time, and I\n\t\tburied him in the Pet Sematary...where\n\t\this bones still lie.\n\n<b>EXT.  THE ROAD BETWEEN THE TWO HOUSES, WITH LOUIS AND JUD\n</b>\nWe see them crossing.\n\n\t\t\t\tLOUIS (voice)\n\t\tYou still haven't told me why you\n\t\tdid it.\n\n<b>EXT.  JUD AND LOUIS, ON THE CREED FRONT LAWN\n</b>\n<b>\t\t\t\tJUD\n</b>\t\tA man doesn't always know why he does\n\t\tthings, Louis. I think I did it because\n\t\tyour daughter ain't ready for her\n\t\tfavorite pet to die.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWhat?\n\n<b>\t\t\t\tJUD\n</b>\t\tEllie's a little scared of death. And\n\t\tthe main reason Ellie's that way is\n\t\tbecause your wife is a lot scared of\n\t\tdeath. Now you just go ahead and tell\n\t\tme I'm wrong.\n\nBut LOUIS'S reaction tells him he's not wrong--in fact, JUD has \nhit the nail right on the head.\n\n<b>INT.  BATHTUB FIXTURES, CU\n</b>\nLOUIS'S hands come into the frame and turn the spigots.\n\n<b>INT.  THE BATHROOM, WITH LOUIS\n</b>\nHe starts to undress, still looking troubled. We should notice \nthat the door behind him is firmly shut. The bathroom has no \nwindows.\n\n<b>INT.  THE BATHTUB SPIGOTS\n</b>\nThe hot water is steaming. LOUIS'S hands enter the frame and turn \noff the faucets. SOUND of LOUIS climbing in.\n\n<b>INT.  LOUIS IN THE TUB\n</b>\nA big sigh and an expression of exquisite pleasure. He relaxes in \nthe hot water. After a few moments he puts a wet washcloth over \nhis face.\n\n<b>INT.  BY THE KITCHEN SINK, WITH RACHEL\n</b>\n<b>\t\t\t\tRACHEL\n</b>\t\tDon't shilly-shally, Louis. Give\n\t\tthe little girl her promise.\n\n<b>INT.  THE KITCHEN TABLE\n</b>\nGAGE is in his high chair. ELLIE is at her place, crying. In \nRACHEL'S place sits VICTOR PASCOW, bloody and wrecked. LOUIS sits \nin his place. On the platter of bacon and scrambled eggs is \nCHURCH'S mangled body.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tThe door must not be opened. The\n\t\tbarrier must not be crossed.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYou don't understand--\n\n<b>INT.  THE BATHTUB, WITH LOUIS\n</b>\nThe washrag is slipping, but it still covers his face.\n\n\t\t\t\tLOUIS (mutters)\n\t\t--I'm a doctor.\n\n<b>INT.  THE CREED KITCHEN TABLE\n</b>\nIn attendance: PASCOW, LOUIS, ELLIE, GAGE in his high chair. Lying \nin the middle of the table, clotted with dirt and blood, eyes \nstaring, neck a gory mess of infected wounds, is SPOT. He's also \ndotted with clots of scrambled egg and bits of bacon.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tSometimes the dead do more than speak.\n\t\tRemember, doc.\n\n<b>INT.  RACHEL, AT THE KITCHEN SINK\n</b>\n\t\t\t\tRACHEL (with great force)\n\t\tDon't shilly-shally, Louis. Promise me.\n\t\tPromise me. Promise me.\n\n<b>INT.  THE BATHTUB, WITH LOUIS\n</b>\nThe washcloth has slipped enough so we can see his eyes are \nclosed--he's dozing.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tPromise...\n\n<b>INT.  THE CREED KITCHEN TABLE\n</b>\nTo LOUIS, ELLIE, PASCOW, GAGE, and the corpse of SPOT enters JUD, \nhis eyes shocked and staring.\n\n\t\t\t\tJUD (to LOUIS)\n\t\tYou do it for all the best reasons,\n\t\tbut that ain't why. You do it because\n\t\tit gets hold of you...you do it\n\t\tbecause you have to.\n\n<b>INT.  LOUIS, IN THE BATHTUB, CU\n</b>\nThe washrag has worked its way down to his mouth by now. His doze \nis deepening; he's started to snore a little.\n\nSOUND: A splash. Something has been dropped into the bath.\n\nLOUIS opens his eyes. Looks puzzled. Looks down. Eyes widen in \nshock.\n\n<b>INT.  THE BATHWATER, LOUIS'S POV\n</b>\nA very large and very mangled dead rat floats in the bath, \nactually brushing against LOUIS'S chest. Blood has begun to stain \nthe water.\n\n<b>INT.  LOUIS\n</b>\nTurns his head, preparatory to leaping out.\n\n<b>INT.  THE TOILET LID, WITH CHURCH\n</b>\nIts mouth yawns open. It hisses, showing bloodstained teeth.\n\n<b>INT.  THE BATHROOM\n</b>\nLOUIS leaps from the tub. Grabs a towel and begins to rub himself \nfrantically. He's grossed out. The cat tries to arch against him \nand he hits it. CHURCH falls to the floor, hissing.\n\nLOUIS looks at the closed door.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tHow the hell did you get in?\n\nHe may not know that, but he knows how it's going to get out. He \nopens the door to the upstairs hall. If CHURCH doesn't go at once, \nLOUIS helps it with his foot.\n\nThen he looks down at:\n\n<b>INT.  THE BATHTUB WITH BRER RAT, LOUIS'S POV\n</b>\n<b>INT.  LOUIS\n</b>\nStaring at the rat. Over this: THE SOUND OF JET ENGINES.\n\n<b>EXT.  A DELTA 727\n</b>\nIts landing gear unfolds preparatory to touching down at Bangor \nInternational Airport.\n\n<b>INT.  A DEPLANING AREA  DAY\n</b>\nLots of people making their way up the jetway.\n\n<b>INT.  LOUIS, OUTSIDE THE SECURITY POINT\n</b>\nHe's looking anxiously for his people. In one hand he's got half a \ndozen roses. His face lights up.\n\n<b>INT.  THE DEPLANING AREA, LOUIS'S POV\n</b>\nHere comes LOUIS'S family. ELLIE is a little ahead. RACHEL is \npushing GAGE in his stroller. ELLIE sees LOUIS and lights up.\n\n<b>\t\t\t\tELLIE\n</b>\t\tDaddy!\n\nShe runs for him.\n\n<b>INT.  JUST OUTSIDE THE SECURITY POINT\n</b>\nELLIE comes belting up to LOUIS, weaving among the deplanees like \na slalom skier. She leaps into his arms. LOUIS swings her \ncheerfully.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tHi, sugar!\n\nShe smacks him noisily. He smacks her back just as noisily.\n\n<b>\t\t\t\tELLIE\n</b>\t\tDaddy, is Church all right?\n\nLOUIS'S face changes. All at once he's watchful.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYes...I guess so. He was sleeping\n\t\ton the front porch when I left.\n\n<b>\t\t\t\tELLIE\n</b>\t\tCause I had a bad dream about him.\n\t\tI dreamed he got hit by a car and\n\t\tyou and Mr. Crandall buried him in\n\t\tthe Pet Sematary.\n\n\t\t\t\tLOUIS (trying to smile)\n\t\tThat was a silly dream, wasn't it?\n\n<b>\t\t\t\tELLIE\n</b>\t\tIs he really all right?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYes.\n\n<b>\t\t\t\tELLIE\n</b>\t\tBecause you promised.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI know.\n\nRACHEL reaches them. She's pretty tired. Hair hanging in her face, \ngood travelling clothes now looking a bit wrinkled and a bit \nstale.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tWant to take your son, doc?\n\nLOUIS does. GAGE is ecstatic.\n\nLOUIS kisses RACHEL deeply.\n\n<b>INT.  THE CREED KITCHEN, NIGHT\n</b>\nCHURCH at the door, waiting to be let out. ELLIE does the honors. \nCHURCH oils out into the shed/garage. ELLIE closes the door. She \nlooks distressed. She crosses the kitchen again.\n\n<b>INT.  THE CREED LIVING ROOM, NIGHT\n</b>\nRACHEL, in a flannel nightgown, is watching TV. LOUIS is reading a \nmedical tome and making notes. GAGE, zipped into a warm blanket \nsuit, is sacking on the couch.\n\n\t\t\t\tELLIE (entering)\n\t\tCan cats have shampoos?\n\n<b>\t\t\t\tRACHEL\n</b>\t\tYes--you have to take them to someone\n\t\twho grooms animals, though. I think\n\t\tit's pretty expensive.\n\n\t\t\t\tELLIE (still upset)\n\t\tI don't care. I'll save up my allowance\n\t\tand pay for it. Church smells bad.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI've noticed it, too. I'll cough up\n\t\tthe money, Ellen.\n\n<b>\t\t\t\tELLIE\n</b>\t\tI hate that smell.\n\n<b>INT.  LOUIS, CU\n</b>\nHe looks both grim and sad--a man discovering that what you pay \nfor you own, and what you own always comes home to you.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYes--I hate it, too.\n\nBLACK. And on it, a fourth title card: MISSY DANDRIDGE.\n\nSOUND: A pen scratching over paper.\n\n<b>INT.  A STUDY DESK, CU\n</b>\nA single sheet of lined paper is spotlighted by the glow of the \ndesk-lamp. On it, MISSY'S right hand is just finishing: \"Dr. says \nIntestinal Cancer. Cannot face this Pain. Sorry.\"\n\nThe hand puts the pen down. It tears the paper in two, leaving \njust the half with the message.\n\n<b>INT.  THE DANDRIDGE CELLAR, NIGHT\n</b>\nA light comes on and we see a hangman's noose strung over a beam. \nIt dangles above a kitchen table which has been relegated to \ncellar duty.\n\nSOUND: Descending footsteps.\n\n<b>INT.  THE NOOSE, CU\n</b>\nSOUND of MISSY climbing onto the table.\n\nHer face enters the frame. She looks very sick. She puts her head \ninto the noose and rakes it tight at the hyoid bone.\n\n<b>EXT.  THE DANDRIDGE HOUSE, NIGHT\n</b>\nOne light on...a cellar light.\n\nSOUND: Ree-ree-ree...then...\n\nSOUND: Kick! THUMP!\n\nSOUND: Ree-ree-ree...\n\n<b>INT.  THE CELLAR, WITH MISSY DANDRIDGE\n</b>\nShe hangs limply, hands dangling at her sides, above the table, \nwhich now lies upon its side. We can see the note clearly. She \npinned it to the bodice of her housedress.\n\nSOUND: Car engines starting up.\n\n<b>EXT.  IN FRONT OF THE GRACE METHODIST CHURCH  DAY\n</b>\nPeople are coming out and getting into their cars and turning on \nthe headlights, even though it is only mid-morning.\n\nIn the immediate f.g. is a hearse. Four pallbearers are loading a \ncoffin into it.\n\n<b>EXT.  LOUIS AND ELLIE, ON THE CHURCH STEPS\n</b>\n<b>\t\t\t\tELLIE\n</b>\t\tThey're all turning on their lights!\n\t\tDaddy, why are they all turning on\n\t\ttheir lights in the middle of the day?\n\nJUD, dressed in a rusty old black suit and a black tie, comes out \nand stands with them. He looks haggard and old.\n\n<b>\t\t\t\tJUD\n</b>\t\tThey do it to honor the dead, Ellen.\n\n<b>\t\t\t\tELLIE\n</b>\t\tIs that right, dad?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYes. To honor the dead.\n\n<b>EXT.  THE CHURCH PARKING AREA\n</b>\nMore cars start up; more lights come on; the back doors of the \nhearse swing closed.\n\n<b>EXT.  LUDLOW CEMETARY  DAY\n</b>\n[NOTE: In the book LOUIS finds it difficult to enter at night \nbecause of a high iron fence. Here we should see there's no such \nproblem; there's only a low stone wall between the graveyard and \nthe public road.]\n\nThe mourners are of course gathered around the grave of MISSY \nDANDRIDGE. The coffin rests above it on runners.\n\n\t\t\t\tMINISTER (voice)\n\t\tMay the Lord bless you and keep you;\n\t\tmay the Lord make his face to shine\n\t\tupon you, and comfort you, and lift\n\t\tyou up, and give you peace. Amen.\n\n<b>EXT.  LOUIS, ELLIE, JUD\n</b>\nAs the mourners begin to break up, these three start back toward \nLOUIS'S car.\n\n<b>\t\t\t\tJUD\n</b>\t\tRachel not feeling well?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWell...a touch of the flu...\n\n<b>\t\t\t\tELLIE\n</b>\t\tShe's in bed. She was throwing up.\n\t\tEver since Mrs. Rogers called and said\n\t\tMissy--\n\n<b>\t\t\t\tLOUIS\n</b>\t\tThat's enough, Ellen.\n\nThey've reached the CREED station wagon.\n\n<b>\t\t\t\tJUD\n</b>\t\tOut of the mouths of babes, Louis.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tThis babe has said enough.\n\nHe opens the front passenger door.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tHop in, Ellie.\n\nShe does, and LOUIS closes the door.\n\n<b>\t\t\t\tJUD\n</b>\t\tPoor Missy. God, I was sorry to\n\t\thear. I remember when she was\n\t\tno older'n Ellen there, walking down\n\t\tto the store with her Raggedy Anne\n\t\tdoll draggin' behind her in the dust.\n\t\tI don't know why God takes someone\n\t\tlike her, who should have a bunch of\n\t\tyears still in front of them, and lets\n\t\tan old shit like me just go on and on.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tMy father used to have a saying, Jud--\n\t\t\"God sees the truth, but waits.\"\n\n<b>\t\t\t\tJUD\n</b>\t\tAyuh...how is your cat, Louis?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tIt's Ellie's cat.\n\n<b>\t\t\t\tJUD\n</b>\t\tNope. He's your cat now.\n\nJUD opens one of the back doors as LOUIS goes around to the \ndriver's side.\n\n<b>INT.  THE BACK SEAT OF THE WAGON\n</b>\nJUD has tilted over in one corner and is snoring. His Walkman \n'phones are on and we can hear the tinny sounds of Billy Idol. A \nlittle old man's drool trickles down from one corner of his mouth.\n\nSOUND: ELLEN&lt; crying.\n\n<b>INT.  THE FRONT OF THE WAGON, WITH LOUIS AND ELLIE\n</b>\nTears are spilling freely down ELLIE'S face.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tEllie? What's wrong?\n\n<b>\t\t\t\tELLIE\n</b>\t\tNo more chocolate chip cookies.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tHuh?\n\n<b>\t\t\t\tELLIE\n</b>\t\tMissy made the best chocolate chip\n\t\tcookies in the world--even Mom said\n\t\tso. Now there won't be any more\n\t\tbecause she's gonna be dead forever!\n\nShe cries harder. LOUIS reaches out and strokes her hair.\n\n<b>EXT.  THE STATION WAGON, DAY\n</b>\nMoving up the country road toward home through blazing fall \nfoliage.\n\n<b>INT.  TV SCREEN, CU  NIGHT\n</b>\nOn it is a scene from \"Night of the Living Dead.\"\n\n<b>\t\t\t\tNEWSCASTER\n</b>\t\tBizarre as it may seem, it now seems\n\t\talmost beyond doubt: the dead are\n\t\treturning to eat the living.\n\n\t\t\t\tELLIE (voice)\n\t\tDaddy?\n\n<b>INT.  THE CREED LIVING ROOM  NIGHT\n</b>\nThere's a VCR on top of the TV; LOUIS has been watching \"Night.\" \nNow he quickly uses the remote control to shut down the TV.\n\nShe's dressed for bed, and comes toward him slowly.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWhat's up, sugar?\n\n<b>\t\t\t\tELLIE\n</b>\t\tDaddy, do you think Missy Dandridge\n\t\twent to heaven?\n\n<b>\t\t\t\tLOUIS\n</b>\n\t\tWhat?\n\n<b>INT.  THE KITCHEN, WITH RACHEL\n</b>\nShe's putting away the last of the supper things. She hears this \nand moves toward the living room door to listen. She doesn't look \nat all well. Her eyes are red from crying and her face is haggard.\n\n<b>INT.  THE LIVING ROOM, WITH LOUIS AND ELLIE\n</b>\nShe's gotten up into his lap.\n\n<b>\t\t\t\tELLIE\n</b>\t\tAt school Michael McDowell said she was\n\t\tgonna fry in hell. Michael McDowell says\n\t\tall sewersides fry in hell.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWell, I think Michael McDowell is so full\n\t\tof shit he probably squeaks when he walks,\n\t\tmy dear.\n\n<b>INT.  RACHEL, AT THE DOOR\n</b>\nShe smiles a little at this.\n\n<b>INT.  LOUIS AND ELLIE, IN THE LIVING ROOM\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tBut don't you dare say that.\n\n<b>\t\t\t\tELLIE\n</b>\t\tI won't...is Missy in heaven, do you\n\t\tthink?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI don't know, honey. Different people\n\t\tbelieve all sorts of different things\n\t\thappen to us when we die. Some believe\n\t\tin heaven or hell. Some think we're\n\t\tborn again as little children--\n\n<b>\t\t\t\tELLIE\n</b>\t\tSure, carnation. Like in that movie\n\t\tyou rented, Audrey Rose.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWell, it's actually reincarnation, but\n\t\tyou get the idea. And some people think\n\t\twe just wink out...like a candle flame\n\t\twhen the wind blows hard.\n\n<b>\t\t\t\tELLIE\n</b>\t\tDo you believe that?\n\nLOUIS looks toward:\n\n<b>INT.  THE LIVING ROOM SOFA, WITH CHURCH, LOUIS'S POV\n</b>\nCHURCH is sleeping.\n\n<b>INT.  LOUIS AND ELLIE\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tI think we go on. I'm not sure\n\t\twhat happens after we die, but yeah--\n\t\tI have faith in that.\n\n<b>\t\t\t\tELLIE\n</b>\t\tYou believe in it.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tOh, faith's a little more than just\n\t\tbelieving.\n\n<b>INT.  RACHEL, AT THE KITCHEN DOOR\n</b>\nListening intently.\n\n<b>INT.  LOUIS AND ELLIE\n</b>\n\t\t\t\tLOUIS (continues)\n\t\tI'll tell you what faith is--it's the\n\t\tevidence of the heart; the assurance\n\t\tof things not seen.\n\n<b>\t\t\t\tELLIE\n</b>\t\tI don't get it.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWell, here we are, sitting in my\n\t\tchair. Do you think my chair will\n\t\tbe here tomorrow?\n\n<b>\t\t\t\tELLIE\n</b>\t\tYeah, sure.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tThen you have faith in that. But\n\t\twe don't know it will be; after all,\n\t\tsome crazed chair-burglar might break\n\t\tin while we're away and steal it, right?\n\nELLIE'S giggling.\n\n<b>INT.  RACHEL, AT THE DOOR\n</b>\nShe's smiling, too...but tears are running down her cheeks.\n\n<b>INT.  LOUIS AND ELLIE\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tBut we plan on that chair. We believe\n\t\tin that chair. And I plan on going on\n\t\tsomehow as Louis Creed, after I die.\n\t\tI believe I will.\n\n\t\t\t\tELLIE (awed)\n\t\tYou have faith in that.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYes ma'am. Just like I have faith that\n\t\tit is now time for Ellen Creed to get\n\t\tready for bed. So buzz.\n\nHe gets her off his lap.\n\n<b>\t\t\t\tELLIE\n</b>\t\tI'm not tired!\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI'm sure you're not.\n\n<b>\t\t\t\tELLIE\n</b>\t\tThen why do I have to go to bed?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tBecause your mother and I need\n\t\tthe rest, sugar. Now buzz.\n\nShe heads toward the stairs.\n\n<b>INT.  LOUIS AND RACHEL'S BEDROOM\n</b>\nLOUIS is in bed, reading. RACHEL, wearing a robe over her \nnightgown, comes in.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tI heard you tonight.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI thought maybe you did. I know\n\t\tyou don't approve of the subject\n\t\tbeing raised--\n\n<b>\t\t\t\tRACHEL\n</b>\t\tThat's not true. The subject\n\t\tscares me. Because of Zelda.\n\nLOUIS puts his book down and looks at her thoughtfully.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYour sister, I know.\n\nRACHEL sits down on the end of the bed. She's clasping her hands \nnervously together.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tSometimes you're so good with her,\n\t\tLouis--so straight with her--that\n\t\tyou make me ashamed of myself.\n\nLOUIS sits up and scoots down the bed to her. He tries to put an \narm around her. She rejects it--but gently.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tI'm sorry I couldn't go with you\n\t\tto Missy's funeral. And that I\n\t\tblew up when we went to that\n\t\tsilly animal graveyard.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tThat's forgotten.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tNot by me, it isn't. I know how\n\t\tbadly I acted, how unfair I was.\n\t\tIt's just that I..you know.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYes, I guess I do.\n\nHe makes a place for her beside him and hugs her. They lie \nsilently together for awhile, taking comfort from each other.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tI'm going to try to do better.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYou're doing fine.\n\n<b>\t\t\t\t\t\t\tDISSOLVE TO:\n</b>\nBLACK. And on it, a fifth title card: GAGE.\n\nSOUND: An idling truck motor.\n\n<b>EXT.  THE GRILLE OF A TRUCK  DAY\n</b>\nIt looks monstrous...as high as a mountain.\n\n<b>EXT.  THE TRUCK, A NEW ANGLE\n</b>\nIt's an Orinco tanker. The driver, a young man in khaki fatigues \nand a baseball cap, climbs up into the cab. He slams the door and \njams the truck into gear.\n\n\t\t\t\tIRWIN GOLDMAN (voice)\n\t\tI knew something like this would happen.\n\n<b>EXT.  THE ORINCO SHIPPING YARD  DAY\n</b>\nThe truck comes rolling slowly toward the main gate...stops so the \ndriver can look both ways...and then pulls slowly out onto ROUTE \n<b>9.\n</b>\n\t\t\t\tIRWIN (voice continues)\n\t\tI told her when you were first married.\n\t\t'You'll have all the grief you can stand,\n\t\tand more,' I said.\n\n<b>INT.  A FUNERAL CHAPEL, WITH IRWIN GOLDMAN AND LOUIS  DAY\n</b>\nThere are others here, but they are in the b.g., and concentrating \non the scene the old man is making. He's RACHEL'S dad. LOUIS is \nsitting in the aisle seat of a pew-like bench. He looks terribly \nshattered--they both do, actually. He's staring at the old man as \nif he cannot in the least comprehend what he's saying.\n\n\t\t\t\tIRWIN (continues)\n\t\tAnd now look at this!\n\nHe gestures toward:\n\n<b>INT.  THE FRONT OF THE FUNERAL CHAPEL  DAY\n</b>\nHere, half-buried in floral tributes, is a child-sized coffin. \n<b>GAGE'S.\n</b>\n<b>INT.  IRWIN AND LOUIS  DAY\n</b>\n\t\t\t\tIRWIN (weeping)\n\t\tRun over in the road like a...a\n\t\tchipmunk!\n\n<b>EXT.  ROUTE 9, W/TRUCK  DAY\n</b>\nGetting up to speed.\n\n<b>EXT.  A KITE, CU\n</b>\nThere's a hand holding it--LOUIS'S. The kite begins to move and \nTHE CAMERA TRACKS IT. It flaps and flutters.\n\n<b>EXT.  THE FIELD BESIDE THE CREED HOUSE, WITH LOUIS\n</b>\nHe runs with the kite beneath a gorgeous fall sky in which fat \nclouds move like airy ocean liners.\n\n\t\t\t\tELLIE (voice)\n\t\tGo, daddy!\n\n<b>EXT.  A PICNIC TABLE  DAY\n</b>\nThe remains of a picnic lunch are spread here. Looks like everyone \nate well. In attendance: RACHEL, ELLIE, GAGE, and JUD CRANDALL.\n\n<b>\t\t\t\tGAGE\n</b>\t\tGo, dayee!\n\nThey all laugh--JUD ruffles the kid's hair.\n\n<b>EXT.  LOUIS, RUNNING WITH THE KITE\n</b>\nHe's paying out string--and the kite is going up.\n\n\t\t\t\tLOUIS (voice)\n\t\tWhere's Rachel?\n\n<b>INT.  THE FUNERAL CHAPEL, WITH LOUIS AND IRWIN\n</b>\nIRWIN looks toward:\n\n<b>INT.  THE BACK OF THE CHAPEL, WITH RACHEL AND DORY GOLDMAN\n</b>\nThey are by the sign-in book. Both are dressed in black. Both look \nhaggard. But RACHEL looks more than haggard; she looks damned near \ninsane with grief and horror.\n\n<b>INT.  LOUIS AND IRWIN\n</b>\n\t\t\t\tIRWIN (leaning forward)\n\t\tWith her mother! Where she should be!\n\t\tAs for you, I hope you rot in hell!\n\t\tIn hell, do you hear me?\n\nWe should; by now he's screaming his head off.\n\n<b>INT.  THE CAB OF THE ORINCO TRUCK  DAY\n</b>\nThe driver is whistling. A transistor radio hangs from the rear-\nview mirror on a strap. He turns it on. The Ramones. \"Sheena.\" \nHey-ho, let's go.\n\n<b>EXT.  ROUTE 9, TRUCKER'S POV\n</b>\nUnrolling before us at a good clip--too good, maybe.\n\n<b>INT.  THE TUCKER'S FOOT\n</b>\nStamping the pedal closer to the metal.\n\n<b>EXT.  THE ONCOMING TRUCK\n</b>\nBelting toward THE CAMERA. SOUND of the GROWLING ENGINE.\n\n<b>EXT.  THE SKY, WITH THE KITE\n</b>\nLOUIS has clearly gotten it up okay.\n\n<b>EXT.  LOUIS, IN THE FIELD\n</b>\nHe's holding the string, looking up at the sky. Now he looks back \nat the picnic table.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tHey, Gage!\n\n<b>EXT.  THE PICNIC TABLE\n</b>\nGAGE gets down and runs toward his father.\n\n<b>EXT.  ROUTE 9 WITH THE ORINCO TANKER\n</b>\nBelting along fast. SOUND of the Ramones.\n\n<b>EXT.  THE FIELD, WITH LOUIS AND GAGE\n</b>\nGAGE runs to his dad, chubby legs working. He reaches him, and \nLOUIS transfers thee ball of string to GAGE'S hands.\n\n<b>\t\t\t\tGAGE\n</b>\t\tDat?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tString! You're flying it,\n\t\tGage--you got the hammer, my man!\n\n<b>\t\t\t\tGAGE\n</b>\t\tGage fline it?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tBet your boots. Look--\n\nLOUIS puts his hands over GAGE'S hands and pulls them down.\n\n<b>EXT.  THE KITE\n</b>\nIt dips in the sky.\n\n<b>EXT.  LOUIS AND GAGE\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tSee?\n\n<b>\t\t\t\tGAGE\n</b>\t\tGage fline it!!\n\n\t\t\t\tLOUIS (tenderly)\n\t\tBet your ass, little hero.\n\nHe kisses his son. They look up at:\n\n<b>EXT.  THE KITE\n</b>\nDipping and drifting in that gorgeous fall sky.\n\n\t\t\t\tIRWIN GOLDMAN (voice)\n\t\tWhere were you while he was playing in\n\t\tthe road? Thinking about your stupid\n\t\tmedical articles? You stinking shit!\n\t\tYou killer of children!\n\n<b>INT.  THE FUNERAL CHAPEL, WITH LOUIS AND IRWIN\n</b>\n<b>\t\t\t\tIRWIN\n</b>\t\tYou--\n\nBut there is no way he can express his outrage with mere words. As \nLOUIS sits staring numbly up at him, IRWIN punches him in the \nnose. LOUIS sprawls backward, falling out of the pew onto the \nfloor.\n\n<b>INT.  THE REAR OF THE CHAPEL, FEATURING RACHEL AND DORY\n</b>\nRACHEL screams and starts forward. DORY pulls her back.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tLouis! Daddy! Stop it! STOP IT!\n\n<b>INT.  LOUIS AND IRWIN\n</b>\nLOUIS is getting up groggily. Hs nose is pouring blood.\n\n<b>\t\t\t\tIRWIN\n</b>\t\tHow do you like that, you son\n\t\tof a bitch? I should have done\n\t\tit sooner!\n\nIRWIN punches him in the stomach. LOUIS \"oofs\" and doubles over.\n\n<b>INT.  ANGLE ON THE OTHER MOURNERS\n</b>\nAmong them we see STEVE MASTERTON and MARCY CHARLTON.\n\n\t\t\t\tSTEVE (getting up)\n\t\tHey!\n\n<b>INT.  LOUIS AND IRWIN\n</b>\nLOUIS is slowly straightening up. IRWIN is in a sour frenzy of \nglee.\n\n<b>\t\t\t\tIRWIN\n</b>\t\tHow do you like that? How do--\n\nLOUIS pushes the old man with both hands.\n\n<b>INT.  IRWIN GOLDMAN\n</b>\nHe goes stumbling and flailing backwards...strikes the coffin... \nknocks it off its bier. A SCREAM goes up from the mourners.\n\n<b>INT.  RACHEL AND DORY\n</b>\nRACHEL screams. Her mother struggles to hold her but RACHEL easily \nbreaks free and goes running down the aisle.\n\n<b>INT.  ANGLE ON MOURNERS, WITH MARCY AND STEVE\n</b>\n<b>\t\t\t\tMARCY\n</b>\t\tStop them. Right now.\n\nSTEVE gets up and goes toward:\n\n<b>INT.  THE FRONT OF THE CHAPEL, WITH IRWIN\n</b>\nHe's picking himself out of a tangled mess of coffin and \noverturned floral tributes. His suit is wet from spilled water. \nHe's weeping.\n\nLOUIS has just reached him, and that stunned look is gone. I think \nhe intends to do the Cool Jerk all over IRWIN GOLDMAN'S puny \nlittle body. IRWIN strikes a Gentleman Jim Corbett pugilistic \npose.\n\n<b>\t\t\t\tIRWIN\n</b>\t\tCome on! I'm ready for ya! I'll\n\t\ttake y'apart!\n\nAs LOUIS wades in, STEVE MASTERTON gets between them...at the last \npossible moment.\n\n<b>\t\t\t\tSTEVE\n</b>\t\tStop it!\n\nLOUIS swings. STEVE manages to block the punch with his body.\n\n<b>\t\t\t\tSTEVE\n</b>\t\tStop it! Jesus, what's wrong with\n\t\tyou, Louis? It's your son's funeral,\n\t\tnot a boxing match!\n\nThat gets to LOUIS. He drops his fists. That stunned expression \ncreeps over his face again--that look that says he doesn't have \nthe slightest clue as to what's going on or how it could possibly \nhave happened.\n\n<b>INT.  LOUIS\n</b>\n\t\t\t\tPASCOW (voice)\n\t\tThe soil of a man's heart is stonier,\n\t\tdoc--\n\nLOUIS turns toward:\n\n<b>INT.  THE FRONT PEW, WITH PASCOW AND CHURCH\n</b>\nPASCOW, bloody and ruined in his jogging shorts and muscle shirt, \nhas the pew to himself...except for CHURCH, who is sitting on his \nlap and PURRING.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tA man grows what he can...and tends it.\n\n<b>INT.  LOUIS, CU\n</b>\nA sense of horrible awareness comes into his face...and then he \ncovers it with his hands and begins to SOB.\n\n<b>SOUND, COMING UP: A TRUCK MOTOR.\n</b>\n<b>INT.  THE CAB OF THE TANKER\n</b>\nThe trucker is singing along with the radio.\n\n<b>INT.  THE GAS PEDAL\n</b>\nIt's closer to the floorboards than ever.\n\n<b>EXT.  LOUIS AND GAGE WITH THE KITE, IN THE FIELD\n</b>\nWe are at some distance--far enough to see that the two of them \nhave moved quite close to the road.\n\n<b>EXT.  LOUIS AND GAGE, A NEW ANGLE (KITE'S POV)\n</b>\nWe can see their faces upturned to us--we can hear the AMPLIFIED \nRATTLING SOUND of the kite itself.\n\nTHE CAMERA PANS TO THE LEFT--to the road. And we can see the \ntruck, fairly close by now, and coming closer.\n\n<b>EXT.  THE PICNIC TABLE, WITH RACHEL, ELLIE, AND JUD\n</b>\nJUD'S lighting a cigarette. His Walkman 'phones are around his \nneck.\n\n<b>\t\t\t\tELLIE\n</b>\t\tI want to fly it! Can I fly it now,\n\t\tmommy!\n\n<b>\t\t\t\tRACHEL\n</b>\t\tIn a minute, hon. Let Gage finish his\n\t\tturn.\n\n<b>EXT.  LOUIS AND GAGE\n</b>\nThis is the last moment of happiness in this man's life--so let's \nmake it very happy. As he and GAGE stare up at the kite:\n\n\t\t\t\tIRWIN (voice)\n\t\tJesus. Louis. I'm sorry--\n\n<b>INT.  THE FUNERAL CHAPEL\n</b>\nThe fight has gone out of IRWIN and STEVE has backed away--but \ncautiously. He's ready to jump back in if one or the other goes \nmad again. But IRWIN is shuffling toward LOUIS, hands out--\neveryone else has gathered in a knot near the front of the chapel. \nAmong them is RACHEL and her mother, weeping in each others' arms.\n\n<b>\t\t\t\tIRWIN\n</b>\t\tI don't know what happened to me.\n\t\tLouis, please--\n\nLOUIS brushes by him with no acknowledgement that IRWIN even \nexists. He kneels down slowly by the coffin and puts his head \nagainst it.\n\n\t\t\t\tLOUIS (weeping)\n\t\tI'm sorry, Gage--I'm so sorry,\n\t\tlittle hero.\n\n<b>EXT.  LOUIS AND GAGE, IN THE FIELD\n</b>\nThere's a strong gust of wind. The ball of string falls out of \nGAGE'S hand.\n\n<b>EXT.  THE KITE, BLOWING AWAY\n</b>\n<b>EXT.  THE PICNIC TABLE\n</b>\n<b>\t\t\t\tELLIE\n</b>\t\tIt got away from him! That numb shit!\n\n\t\t\t\tRACHEL (outraged)\n\t\tEllen Creed!\n\n<b>EXT.  THE BALL OF KITE TWINE\n</b>\nIt is bouncing and unraveling. More importantly, it is being \ncarried directly toward the highway.\n\n<b>EXT.  GAGE\n</b>\nHe takes off after the ball of twine.\n\n<b>\t\t\t\tGAGE\n</b>\t\tKite fline too fast!\n\nSOUND: The oncoming truck.\n\n<b>EXT.  THE TRUCK\n</b>\nSlamming toward us--a brutal leviathan on eighteen wheels.\n\n<b>EXT.  LOUIS\n</b>\nHe's looking--looking toward his people at the picnic table.\n\n\t\t\t\tLOUIS (shrugs, good-humored)\n\t\tWhat can you d-\n\n<b>TRUCK SOUND CONTINUES.\n</b>\n<b>EXT.  THE PICNIC TABLE\n</b>\n<b>TRUCK SOUND LOUDER.\n</b>\nAlarm hits JUD'S face. He rises.\n\n<b>\t\t\t\tJUD\n</b>\t\tDon't let him go in the road, Louis!\n\nRACHEL looks; registers terrible alarm.\n\n\t\t\t\tRACHEL (screams)\n\t\tGet him, Louis!\n\n<b>EXT.  GAGE\n</b>\nHe's still scampering after the bouncing ball of kite-twine, which \nhas now almost reached the road.\n\n<b>TRUCK SOUND LOUDER.\n</b>\n<b>EXT.  LOUIS\n</b>\nThe SOUND is loud enough so he's having trouble hearing.\n\n\t\t\t\tLOUIS (cups his ear)\n\t\tWhat?\n\n<b>EXT.  THE PICNIC TABLE\n</b>\n\t\t\t\tRACHEL (shrieks)\n<b>\t\tGET THE BABY!!\n</b>\nJUD is running toward the road, although he'll never get to GAGE \nin time; only LOUIS has a chance.\n\n<b>EXT.  LOUIS\n</b>\nHorrible understanding dawns on his face. He whips around and \nsees:\n\n<b>EXT.  GAGE, LOUIS'S POV\n</b>\nThe kid's almost in the road; the ball of twine is in it.\n\n<b>RISING DRONE OF THE TRUCK.\n</b>\n<b>EXT.  THE ONCOMING TRUCK\n</b>\n<b>EXT.  GAGE, RUNNING INTO THE ROAD\n</b>\n\t\t\t\tGAGE (cheerful)\n\t\tGeddit-geddit-geddit!\n\n<b>EXT.  EVERYONE, KITE'S POV\n</b>\nGAGE reaches the middle of the road as the truck comes around the \ncorner. LOUIS is running across the field, getting close to the \nside of the road. RACHEL is clutching ELLIE by the picnic table. \nJUD is helplessly trying to wave the truck down as it passes him.\n\n<b>EXT.  GAGE, IN THE ROAD\n</b>\nAs he reaches the broken white line he grabs the ball of string.\n\n<b>SOUND OF THE ONCOMING TRUCK.\n</b>\nGAGE turns his head.\n\n\t\t\t\tGAGE (not afraid)\n\t\tDruck!\n\n<b>EXT.  THE ONCOMING TRUCK AND THE DRIVER, GAGE'S POV\n</b>\nSuddenly THE DRIVER'S face turns into a Halloween mask of horror. \nHe BLASTS THE AIR-HORN.\n\n<b>EXT.  LOUIS, ON THE VERGE OF THE ROAD\n</b>\n\t\t\t\tLOUIS (shrieks)\n<b>\t\tNO!!\n</b>\n<b>EXT.  GAGE\n</b>\nBLARE OF THE AIR-HORN. A shadow falls over his face. There is an \naudible CLICK! and we FREEZE FRAME. What we have now is a tremen-\ndously winning photograph of a little boy, not quite two, with a \nball of string in his hand...and a shadow lying across his face.\n\n<b>EXT.  PHOTO MONTAGE\n</b>\na.) LOUIS is pushing RACHEL out of a hospital door. RACHEL is in a \nwheelchair and looks radiantly happy (so, for that matter, does \nLOUIS). I think we may safely assume that the small blanketed \nbundle in RACHEL'S arms is GAGE.\n\nb.) LOUIS, bare to the waist, is tubbing a two-month-old GAGE in a \nbaby-tub. He's laughing. The infant looks confused but calm.\n\nc.) The whole family by the Christmas tree, following an orgy of \npresent-opening. ELLIE, about five, has a doll in each hand. LOUIS \nand RACHEL are in pajamas. GAGE, about five months, is lying in a \ndrift of wrapping paper. He looks confused but calm.\n\nd.) A child's sneaker lying in the road. It's splashed with blood.\n\ne.) GAGE--he's about nine months old in this snap--is propped up \nin the angle of a sofa. There's a big white rabbit in his lap. \nGAGE looks c. but c.\n\nf.) ELLIE and GAGE, bundled up against the Chicago winter. ELLIE \nis pulling a child's chair-sled. GAGE is propped up in the chair. \nHe's about eleven months old in this snap. He's laughing.\n\ng.) The Orinco tanker, overturned on the far side of Route 9.\n\nh.) This one was taken at Gage's first birthday party. He's \nwearing a party-hat and looking at a birthday cake with a single \ncandle on it while LOUIS kisses one cheek and RACHEL kisses the \nother.\n\ni.) LOUIS, in the road. He's holding GAGE'S jumper, which is torn, \nblood-soaked, and inside out. LOUIS is looking up toward the sky \nand screaming.\n\nj.) Here is a full-face studio portrait of GAGE. He is smiling at \nus, heartbreakingly lovely. CAMERA HOLDS ON THIS while:\n\n\t\t\t\tJUD (voice)\n\t\tSedative finally took hold. She's asleep.\n\n<b>INT.  THE KITCHEN TABLE, WITH LOUIS\n</b>\nHe's holding the studio portrait in his hands and looking at it \nfixedly. The other photos (the good ones, that is; not the \nscreamers--those, we may assume, exist only in LOUIS'S tortured \nmemory) are scattered on the table. We only saw a few; there are \nactually hundreds.\n\nLOUIS puts the photo down as JUD comes in and crosses to the \nfridge. LOUIS'S nose is badly swelled. He also has a black eye.\n\nJUD gets a couple of beers and comes back toward the table.\n\n<b>\t\t\t\tJUD\n</b>\t\tYour father-in-law packs a wallop,\n\t\tfor an old guy. He and his wife gone\n\t\tback to Chicago?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tNo...squatting out there at the\n\t\tHoliday Inn like a couple of vultures.\n\t\tHe really thinks Rachel's going to go\n\t\tback with them. Her and Ellie.\n\n<b>\t\t\t\tJUD\n</b>\t\tLouis--\n\nThe swing door opens. They look toward:\n\n<b>INT.  ELLIE\n</b>\nShe looks dazed and shocked. There are brown circles under her \neyes, but otherwise her complexion is much too white. She's \nwearing fuzzy pj's. She's carrying the picture of her pulling GAGE \non the sled.\n\n<b>INT.  JUD AND LOUIS, AT THE TABLE\n</b>\n\t\t\t\tELLIE (coming to the table)\n\t\tI want to go back to my own room.\n\t\tI can't sleep with mommy. She\n\t\tkeeps stealing the covers.\n\n<b>\t\t\t\tJUD\n</b>\t\tWhat you got there, Ellie?\n\nAt first she doesn't want to show him, but JUD is very kind.\n\n\t\t\t\tJUD (studying it)\n\t\tWhy that's real nice...you pullin'\n\t\thim on a sled. Bet he liked that,\n\t\tdidn't he?\n\nELLIE nods. She is starting to cry. JUD is also leaking at the \neyes.\n\n\t\t\t\tELLIE (crying)\n\t\tI used to pull 'im a lot.\n\nLOUIS, looking down at his hands, nods.\n\n<b>\t\t\t\tELLIE\n</b>\t\tI'm going to carry this picture,\n\t\tMr. Crandall, until God lets Gage\n\t\tcome back.\n\nJUD reacts violently. And LOUIS looks up, dully curious...but \nhasn't the thought already passed through LOUIS'S mind? Yes--I \nthink it has.\n\n<b>\t\t\t\tJUD\n</b>\t\tEllie...God doesn't do things like\n\t\tthat. I know you loved y'brother, but--\n\n<b>\t\t\t\tELLIE\n</b>\t\tHe can if He wants to. He can do\n\t\tanything, just like Inspector Gadget\n\t\ton TV. But I have to keep things ready\n\t\tfor him, that's what I think. I've got\n\t\this picture and I'm going to sit in\n\t\this chair--\n\n<b>\t\t\t\tLOUIS\n</b>\t\tEllie--\n\n<b>\t\t\t\tELLIE\n</b>\t\tAnd I'm going to eat his breakfast\n\t\tcereal, too, even though it tastes\n\t\tlike boogers. And...and...\n\nShe bursts into tears.\n\n<b>\t\t\t\tJUD\n</b>\t\tLouis, take care of your little\n\t\tgirl...she needs you.\n\n<b>INT.  LOUIS, CU\n</b>\nHis face is stricken.\n\n<b>INT.  ELLIE'S BEDROOM  NIGHT\n</b>\nLOUIS comes in with ELLIE in his arms. He puts her gently into her \nbed and pulls the covers up. She's already mostly asleep.\n\n\t\t\t\tLOUIS (kisses her)\n\t\tGood night, Ellie.\n\n<b>\t\t\t\tELLIE\n</b>\t\tG'night daddy.\n\nHe starts for the door.\n\n<b>INT.  ELLIE, CU\n</b>\n<b>\t\t\t\tELLIE\n</b>\t\tGod could take it back if He wanted\n\t\tto, couldn't He? If He really, really\n\t\twanted to? Can I have faith in that?\n\n<b>INT.  LOUIS, AT THE DOOR\n</b>\nHe stands looking at her for a long time, apparently thinking \nabout this quite deeply.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYes--I suppose you can. Good night,\n\t\tEllie.\n\nHe steps out, closing the door.\n\n<b>INT.  ELLIE, IN BED\n</b>\nIn some sense comforted--it may be a poison comfort but she surely \ndoesn't know this--she turns over on her side to go to sleep. We \ncan see the picture of GAGE under her arm.\n\n<b>INT.  THE UPSTAIRS HALL, WITH LOUIS\n</b>\nThe light here is fairly dim. LOUIS goes down and opens another \ndoor. He pokes his head in.\n\n<b>INT.  THE MASTER BEDROOM, WITH LOUIS\n</b>\nHe reacts first with surprise, then a species of horrified \ndisgust.\n\n<b>INT.  LOUIS AND RACHEL'S BED, LOUIS'S POV\n</b>\nCHURCH is crouched on RACHEL'S sleeping form.\n\n<b>INT.  THE BED, A NEW ANGLE\n</b>\nLOUIS comes in and swats the cat a damned good one.\n\n\t\t\t\tLOUIS (low snarl)\n\t\tFuck off, hairball!!\n\n<b>INT.  CHURCH, CU\n</b>\nIt hisses at him through a mouthful of fangs, its eyes big green \nballs...and then it flees. CAMERA FOLLOWS IT out the door.\n\n<b>INT.  LOUIS, BY THE BED\n</b>\nRACHEL stirs and mutters thickly, then lies still again...she's \ndoped to the gills. LOUIS bends over and kisses her gently.\n\nHe leaves the room and closes the door behind him.\n\n<b>INT.  THE UPSTAIRS HALL, WITH LOUIS\n</b>\nHe tries the door a couple of times to make sure it's firmly on \nthe latch (his face wears an expression of \"How'd he get in there \nin the first place?\"). Then he walks down the hall to the stairs.\n\n<b>INT.  ON THE STAIRS, CU\n</b>\nThe cat is on one of the risers. LOUIS trips over it.\n\n<b>EXT.  ON THE STAIRS WITH LOUIS, WIDER\n</b>\nFor a moment he's pinwheeling madly for balance, on the verge of \nfalling. He regains his balance as the cat goes shooting across \nthe dining room toward the kitchen.\n\nLOUIS regains his equilibrium after a bit and continues on down.\n\n<b>INT.  THE KITCHEN, WITH JUD AND LOUIS AND CHURCH\n</b>\nAs LOUIS enters through the swing door from the dining room, JUD \nis just letting CHURCH out the back door. As JUD closes the door:\n\n\t\t\t\tLOUIS (slightly antagonistic)\n\t\tI thought you'd be gone by now.\n\n<b>\t\t\t\tJUD\n</b>\t\tI got you a fresh beer out of the\n\t\tfridge, Louis.\n\nHe indicates the table, where there is indeed a fresh beer.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tJud, I buried my son today and\n\t\tI'm very tired. I wonder if we\n\t\tcould just--\n\n<b>\t\t\t\tJUD\n</b>\t\tYou're thinking of things best\n\t\tnot thought of, Louis.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI'm thinking about going to bed.\n\nBut he begins pouring the beer into a glass.\n\n<b>\t\t\t\tJUD\n</b>\t\tYou never asked me if anyone had\n\t\tburied a person up there in the\n\t\tMicmac burying ground--\n\nLOUIS'S hand jerks. Beer goes foaming across the kitchen table.\n\n<b>\t\t\t\tJUD\n</b>\t\t--but I think the thought\n\t\thas crossed your mind.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tShit! Look at this mess!\n\n<b>\t\t\t\tJUD\n</b>\t\tAyuh--it's a mess, all right.\n\nAs LOUIS goes to get a cloth to wipe up the mess:\n\n<b>\t\t\t\tJUD\n</b>\t\tI know the Micmacs thought it was a\n\t\tholy place...and then they thought\n\t\tit was a cursed place. That's why\n\t\tthey moved on.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tBecause something called a wendigo\n\t\tsoured the ground.\n\n<b>\t\t\t\tJUD\n</b>\t\tAnd because the dead walked.\n\nLOUIS stops sopping and looks at him.\n\n<b>INT.  JUD, CU\n</b>\n<b>\t\t\t\tJUD\n</b>\t\tOh, ayuh. It's been done. What you've\n\t\tbeen thinking of has been done.\n\n<b>EXT.  A COUNTRY RAILROAD STATION/SEPIA  DAY\n</b>\nThe time is the late summer of 1944, although I don't believe we \nneed to know that specifically. The sign on the station reads \nLUDLOW. There are a few 40s cars parked near the station--they \nhave gas-ration coupons on the windshields. And a hearse.\n\nA train is coming.\n\n<b>EXT.  THE HEARSE, WITH UNDERTAKER AND BILL BATERMAN/SEPIA\n</b>\nWe can see the UNDERTAKER is trying to talk to BILL BATERMAN, a \nman in his forties who periodically wipes his brow with a bandana. \nBILL walks away. He doesn't want to talk; he doesn't want comfort. \nHe's a grief-stricken, bitter man.\n\n\t\t\t\tJUD (voice over)\n\t\tTimmy Baterman was on his way home\n\t\tfrom the war with his Purple Heart\n\t\twhen he got killed in some stupid\n\t\tcar accident down in Georgia.\n\n<b>EXT.  THE TRAIN, IN FRONT OF THE DEPOT/SEPIA\n</b>\nThe door of the mail-car is open. The UNDERTAKER and three \ntrainmen are unloading TIMMY BATERMAN'S coffin, which is draped in \na 48-star flag. BILL BATERMAN stands by, watching balefully as \nthey carry his son's final apartment to the back of the hearse and \nload it in.\n\n\t\t\t\tJUD (v-o continues)\n\t\tBill was bitter--his son had been in\n\t\tthe thick of it two years and then got\n\t\tshot in the leg--a clean flesh-wound.\n\t\tHe was supposed to be coming home safe\n\t\tand sound. Instead, he come home in a\n\t\tbox after all.\n\n<b>EXT.  THE REAR OF THE HEARSE/SEPIA\n</b>\nThe doors close. The hearse pulls away. THE CAMERA PANS TO BILL \nBATERMAN, who stands staring balefully after it and mopping his \nbrow.\n\n\t\t\t\tJUD (v-o continues)\n\t\tHe wasn't able to get to the bottom\n\t\tof the truth, Louis.\n\n<b>INT.  THE CREED KITCHEN, WITH LOUIS AND JUD  NIGHT\n</b>\nLOUIS is now sitting down, drinking a beer, staring at JUD.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI'll bite--what's the bottom of the\n\t\ttruth, Jud?\n\n<b>\t\t\t\tJUD\n</b>\t\tWhy...that sometimes dead is better.\n\t\tThat's all. Sometimes dead is better.\n\n\t\t\t\tLOUIS (bitter)\n\t\tTell that to my wife and little girl.\n\n<b>\t\t\t\tJUD\n</b>\t\tIt ain't your wife and little girl\n\t\tthat's got me worried, Louis.\n\n<b>EXT.  THE LUDLOW CEMETARY/SEPIA  DUSK\n</b>\nWe're featuring a fresh grave...that of TIMMY BATERMAN. A truck, \nshowing only parking lights, turns into the graveyard and drives \nslowly up to it. It stops, and BILL BATERMAN gets out. HE looks at \nthe grave and then goes to the back of his truck.\n\n\t\t\t\tJUD (voice-over)\n\t\tTimmy was buried on July 22nd, as\n\t\tI remember.\n\n<b>EXT.  BILL BATERMAN AT THE BACK OF HIS TRUCK/SEPIA  DUSK\n</b>\nHe reaches in...and brings out a pick and shovel.\n\n<b>\t\t\t\t\t\t\tDISSOLVE TO:\n</b>\n<b>EXT.  MARGIE WASHBURN, ON HER PORCH/SEPIA  DAY\n</b>\nShe's a middle-aged woman dressed in mid-forties style. She's got \na rug-beater in one hand; the other is up to her eyes to shade the \nsun. She's staring at something, horrified.\n\n\t\t\t\tJUD (v-o continues)\n\t\tIt was four or five days later when...\n\n<b>EXT.  A COUNTRY DIRT ROAD, WITH TIMMY BATERMAN/SEPIA  DAY\n</b>\nA young man dressed in jeans and a plaid shirt is shambling up the \nroad. His eyes are vacant. His shirt is half untucked. His hair is \nsticking up in a wild crow's-nest thatch. There is an ugly mess of \nhealed scars on his neck and one side of his face. I think one of \nhis ears may be gone--torn off in the accident.\n\n\t\t\t\tJUD (v-o continues)\n\t\t...Margie Washburn seen him walking\n\t\tup the road toward Yorkie's Livery.\n\n<b>EXT.  MARGIE/SEPIA\n</b>\nShe's screaming--we hear her faintly.\n\n<b>EXT.  TIMMY/SEPIA\n</b>\nHe turns toward her and we see a green light like the St. Elmo's \nfire in the Little God Swamp glow dimly deep in his eyes. He grins \nat MARGIE.\n\n<b>EXT.  IN FRONT OF THE LUDLOW TOWN OFFICES, WITH MARGIE/SEPIA\n</b>\nShe hesitates for a moment or two and then walks up toward the \ndoor.\n\n\t\t\t\tJUD (v.o.)\n\t\tLots of people saw Timmy Baterman\n\t\twalking back and forth between the\n\t\thome place and the town line. But \n\t\tit was Margie...\n\n<b>INT.  THE TOWN OFFICES, WITH MARGIE/SEPIA\n</b>\nShe's in a hallway in front of a door with LUDLOW SELECTMEN \nprinted on the frosted glass. After a moment she opens it and goes \nin.\n\n\t\t\t\tJUD (v.o. continues)\n\t\t...who finally got up enough guts to\n\t\ttalk to the town fathers about it.\n\t\tShe knew it had to be stopped, Louis.\n\n<b>INT.  THE SELECTMEN'S OFFICE/SEPIA\n</b>\nMARGIE and four men are grouped around a desk. She's talking; \nthey're listening. THE CAMERA LAZILY PANS the four men--one, of \ncourse, is JUD as a YOUNG MAN.\n\n\t\t\t\tJUD (v.o. continues)\n\t\tShe knew it was an abomination.\n\t\tGeorge Anderson, the town postmaster,\n\t\twas there...and Alan Purinton...Hannibal\n\t\tBenson...and me. I was there.\n\n<b>EXT.  THE BATERMAN PLACE/SEPIA  SUNSET\n</b>\nIt's a ramshackle old farm which looks remarkably like the estate \nof that gentleman farmer Jordy Verrill.\n\nAn old Ford pulls into the driveway, and the four men get out.\n\nSOUND BLEEDS IN: Most of all the SOUND OF THE CRICKETS.\n\nThey go to the door, and JUD is wordlessly elected as the prime \nhoncho. He knocks. No answer. Again. No answer.\n\nSOUND: Crazy laughter.\n\n\t\t\t\tBILL BATERMAN (voice)\n\t\tStop that, Timmy!\n\nThe four men look at each other.\n\n<b>\t\t\t\tJUD\n</b>\t\tCome on.\n\nThey start around to the back.\n\n<b>EXT.  THE BACK YARD, WITH BILL AND TIMMY/SEPIA\n</b>\nTIMMY BATERMAN is staring directly into the setting sun, his eyes \nglowing with green fire. He's laughing like Goofy gone insane. \nBILL, scared, is trying to make him stop, to turn away from the \nsun.\n\n<b>EXT.  THE BACK YARD, A NEW ANGLE/SEPIA\n</b>\nThe four men come around the side of the house. They freeze when \nthey see BILL and TIMMY.\n\n<b>\t\t\t\tALAN\n</b>\t\tOh holy Jesus lookit that.\n\nBILL whirls around and sees them.\n\n<b>\t\t\t\tBILL\n</b>\t\tYou men get out of here!\n\n<b>\t\t\t\tJUD\n</b>\t\tI heard your boy was killed down\n\t\tGeorgia.\n\n\t\t\t\tBILL (agitated)\n\t\tThat was a mistake!\n\n<b>\t\t\t\tHANNIBAL\n</b>\t\tWas it?\n\n<b>\t\t\t\tBILL\n</b>\t\tYou see him standing there,\n\t\tdon't you? Now get out! Get the\n\t\tChrist off my land!\n\nNow TIMMY turns around and comes shambling forward.\n\n\t\t\t\tTIMMY (laughing)\n\t\tGe ow! Ge Cwise off eye an!\n\n\t\t\t\tGEORGE (revolted)\n\t\tOh Jesus, Jud! He's dead! I can\n\t\tsmell him!\n\n<b>\t\t\t\tBILL\n</b>\t\tHe ain't dead! Give him a day or two\n\t\tand he'll be fine! Don't you say that!\n\n<b>\t\t\t\tJUD\n</b>\t\tBill, this ain't right--you can see\n\t\tthat yourself--\n\n\t\t\t\tBILL (screaming)\n<b>\t\tGET OUT! YOU HEAR? GET OUT!!!\n</b>\n<b>EXT.  TIMMY BATERMAN/SEPIA\n</b>\n\t\t\t\tTIMMY (laughing)\n\t\tDead! We love dead! Hate living!\n\nAbruptly he reaches up with both hands and scratches down his \ncheeks, goring deep grooves in his flesh. Blood flows sluggishly \nout. Very weird blood.\n\n<b>EXT.  THE ENTIRE GROUP/SEPIA\n</b>\nBILL grabs TIMMY, who's still laughing wildly, and gets him turned \naround. TIMMY shambles back to where he was originally standing. \nBILL goes with him like a man who has charge over a trained \nbaboon. A stupid trained baboon.\n\n\t\t\t\tBILL (over his shoulder)\n\t\tYou want to get out of here before I get\n\t\tmy shotgun! You boys are trespassing!\n\n<b>EXT.  THE FOUR MEN/SEPIA\n</b>\n<b>\t\t\t\tJUD\n</b>\t\tGod help you, Bill.\n\n<b>EXT.  BILL AND TIMMY BATERMAN/SEPIA\n</b>\n\t\t\t\tBILL (snarls)\n\t\tGod never helped me. I helped\n\t\tmyself.\n\n<b>EXT.  TIMMY BATERMAN, CU/SEPIA\n</b>\nStaring directly into the setting sun and laughing wildly, \nmindlessly.\n\n<b>INT.  THE CREED KITCHEN, WITH LOUIS AND JUD\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tWhat happened?\n\n<b>EXT.  THE BATERMAN PLACE--MONTAGE  NIGHT\n</b>\na.) A car pulls up with its lights off and stops.\n\n\t\t\t\tJUD (v.o.)\n\t\tThere was a fire.\n\nb.) We see legs as people get out of the car, and hands holding \ntin cans of gasoline.\n\nc.) Hands splash gasoline from the cans along the sides of the \nhouse.\n\n<b>EXT.  THE BATERMAN PORCH  NIGHT\n</b>\nJUD (as a young man) rings the bell--an old-fashioned twist type.\n\n\t\t\t\tBILL (voice)\n\t\tWho's there?\n\n\t\t\t\tTIMMY (laughing, screeching voice)\n\t\tOoo air? Ooo air?\n\n<b>\t\t\t\tJUD\n</b>\t\tGet out, Billy--the place is\n\t\tgoing up.\n\nHe walks away. BILL BATERMAN, wearing a strappy tee-shirt, looks \nout the window.\n\n<b>\t\t\t\tBILL\n</b>\t\tI seen you! I seen you, Jud Crandall!\n\n<b>EXT.  THE BATERMAN PLACE--MONTAGE  NIGHT\n</b>\na.) A match is struck...and applied to wet boards. Whoosh!\n\nb.) The other side of the house: The same.\n\nc.) In the back yard, JUD lights a torch and heaves it through the \nkitchen windows. Ka-PLOOM!\n\nd.) The men draw away toward the front, their faces grim and \njudgmental.\n\n<b>EXT.  THE BATERMAN PLACE  NIGHT\n</b>\nBurning. Going up fast.\n\n<b>EXT.  THE MEN\n</b>\n<b>\t\t\t\tALAN\n</b>\t\tYou think Bill's gonna get out, Jud?\n\n\t\t\t\tJUD (stony)\n\t\tIf he don't, he don't.\n\n<b>EXT.  THE FRONT DOOR\n</b>\nIt bursts open. We see two men struggling at the forefront of an \ninferno--correction, one man and an undead monster. TIMMY is \ngiggling and screaming, trying to pull his father back into the \nflames.\n\n\t\t\t\tBILL (struggling)\n\t\tNo! No, Timmy! Let me go!\n\n\t\t\t\tTIMME (laughing)\n\t\tLove dead! Hate living!\n\nHe sinks his teeth into his father's arm. BILL screams.\n\nA beam falls on TIMMY, lighting him afire. BILL breaks free and \nruns down the porch steps.\n\n<b>INT.  THE FRONT HALL, WITH TIMMY\n</b>\nHe's burning and laughing.\n\n<b>\t\t\t\tTIMMY\n</b><b>\t\tLOVE DEAD! HATE LIVING!\n</b>\nAnd into the fire he goes, still shrieking and laughing.\n\n<b>EXT.  THE FRONT YARD  NIGHT\n</b>\nBILL BATERMAN is collapsed on the lawn as sparks drift down around \nhim, his face hidden against his thighs, weeping.\n\nCAMERA MOVES SLOWLY IN on the four men, who are grouped at the end \nof the driveway by the road and staring with awe at:\n\n<b>EXT.  THE BLAZING FARMHOUSE  NIGHT\n</b>\n<b>\t\t\t\t\t\t\tDISSOLVE TO:\n</b>\n<b>INT.  THE KITCHEN, WITH LOUIS AND JUD\n</b>\n\t\t\t\tJUD (softly)\n\t\tSometimes dead is better, Louis.\n\nBLACK. And on it, a sixth title card: THE DEAD WALK.\n\n<b>SOUND BLEEDS IN: JET ENGINES.\n</b>\n<b>EXT.  BANGOR INTERNATIONAL TERMINAL  DAY\n</b>\nA jet plane rises into the sky from behind the building.\n\n<b>\t\t\t\tGATE AGENT'S VOICE\n</b>\t\tThis is the final call for United's\n\t\tflight 61 to Chicago...\n\n<b>INT.  A BOARDING GATE, WITH LOUIS AND RACHEL\n</b>\nIn the b.g. we can see IRWIN and DORY GOLDMAN waiting by the \njetway with ELLIE as the last few passengers board. RACHEL looks \nconfused and grief-stricken. She also looks punchy, doped up. I \nimagine she's floating on a sea of Valium, and that makes her \neasier to deal with. LOUIS'S battle-scars are fading a little.\n\nThe GATE AGENT is standing by the jetway with a mike in one hand \nand a bunch of boarding passes in the other.\n\n\t\t\t\tGATE AGENT (concludes)\n\t\tAll passengers should now be aboard.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYou better get going, hon.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tOh Louis, I just don't know about\n\t\tthis--\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI told you last night--this can be the\n\t\tstart of patching things up with your\n\t\tfolks. If something good doesn't come\n\t\tof Gage's death, I think I'll go crazy.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tLouis, are you sure?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI'm sure.\n\n<b>INT.  THE GOLDMANS, WITH ELLIE\n</b>\n<b>\t\t\t\tELLIE\n</b>\t\tI don't want to go to Chicago,\n\t\tGramma Dory.\n\n<b>\t\t\t\tDORY\n</b>\t\tWhy not, darling?\n\n<b>\t\t\t\tELLIE\n</b>\t\tI had a bad dream last night. A\n\t\tnightmare.\n\n\t\t\t\tIRWIN (kindly)\n\t\tAbout what?\n\n<b>\t\t\t\tELLIE\n</b>\t\tAbout Daddy. (Pause) And Gage.\n\nDORY and IRWIN exchange a knowing, sad glance over the child's \nhead.\n\n<b>\t\t\t\tELLIE\n</b>\t\tAnd someone named Paxcow.\n\n<b>INT.  RACHEL AND LOUIS\n</b>\nLOUIS guides her to the jetway.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tCome on, you guys--before you miss\n\t\tthe boat.\n\nHe kisses DORY. IRWIN hugs him.\n\n<b>\t\t\t\tIRWIN\n</b>\t\tLouis, I am sorry. What can I say?\n\t\tThat I lost my mind? It's the truth,\n\t\tbut no good excuse.\n\n\t\t\t\tLOUIS (hugs him back)\n\t\tWe all lost our minds, Irwin.\n\nLOUIS kisses RACHEL. Then he kneels and hugs ELLIE.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tBe good to your mother, darlin'.\n\t\tShe needs you.\n\n<b>\t\t\t\tELLIE\n</b>\t\tCome with us, daddy. Please come\n\t\twith us!\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI'll be there in three days--four\n\t\tat the most. I've got to get the\n\t\telectricity shut off and square\n\t\tthings with your school so the\n\t\ttruant officer ain't after you, and--\n\n<b>INT.  ELLIE, CU\n</b>\n\t\t\t\tELLIE (crying)\n\t\tPlease, daddy! I'm scared!\n\n<b>INT.  LOUIS AND ELLIE\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tOf what?\n\n\t\t\t\tELLIE (crying harder)\n\t\tI don't know.\n\n\t\t\t\tLOUIS (great emphasis)\n\t\tEverything's going to be all right,\n\t\tEllie. Now go on--get aboard.\n\n<b>\t\t\t\tELLIE\n</b>\t\tDo you swear?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI swear.\n\nThe Voice of Authority has spoken. We can tell by ELLIE'S face \nthat while things are still not all right, they are a little \nbetter. She joins her mother.\n\nThe four of them--RACHEL, ELLIE, and THE GOLDMANS--start down the \njetway. ELLIE looks back once, as if begging him to come...and \nthen they're gone.\n\n<b>INT.  LOUIS, CU\n</b>\nLOUIS'S face changes. Now it is a stony and contemplative face. \nNot, when you get right down to it, a very nice face.\n\nHe turns and strides away.\n\n<b>INT.  THE AIRPORT PARKING LOT, WITH LOUIS\n</b>\nThe family station wagon is in the f.g. We hear the SOUND OF JET \nENGINES, and as LOUIS reaches the wagon he turns and watches:\n\n<b>EXT.  THE TERMINAL,, LOUIS'S POV\n</b>\nFrom behind it a United Airlines jet lifts into view and banks \naway.\n\n<b>EXT.  LOUIS, IN THE PARKING LOT\n</b>\nFace set, he gets into the wagon and drives away.\n\n<b>EXT.  ROUTE 15 IN BREWER\n</b>\nThe CREEDmobile pulls up across from the Brewer Tru-Value Hardware \nand LOUIS crosses to it.\n\n<b>INT.  THE HARDWARE STORE COUNTER, CU\n</b>\nOn it: A six-cell flashlight, Duracell D-batteries, a pick, a \nshovel, and a nylon drop-sheet in cellophane packaging. Now the \nCLERK'S hands come into the frame and drop a pair of heavy work-\ngloves into the pile.\n\n<b>INT.  LOUIS AND CLERK (SMALL PUN, HEE-HEE)\n</b>\n<b>\t\t\t\tCLERK\n</b>\t\tAnything else for you today?\n\n\t\t\t\tLOUIS (after a look)\n\t\tI think we got it all.\n\nThe CLERK starts to ring things up.\n\n<b>\t\t\t\tCLERK\n</b>\t\tLooks like heavy work.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tIt could be.\n\nThe quality of LOUIS'S reply is somehow unnatural. The CLERK looks \nat him, momentarily unsure and uncertain. Then he starts ringing \nthings up again.\n\n<b>INT.  A UNITED JETLINER, WITH ELLIE AND RACHEL\n</b>\nELLIE is in the window-seat, asleep. RACHEL is holding a paperback \nbut not reading it. Her eyes are red. She's looking into space.\n\nCAMERA DRIFTS TO ELLIE. Her sleep is not easy. Her head turns from \nside to side, as if in negation. She becomes steadily more upset. \nShe's starting to mutter. Suddenly her eyes flare open and she \nscreams.\n\n<b>INT.  JETLINER, SLIGHTLY WIDER\n</b>\nWe can see the GOLDMANS in the seats behind the CREEDS. They are \nstartled. So are other passengers. A stewardess comes running.\n\n<b>\t\t\t\tELLIE\n</b>\t\tPaxcow says it's almost too late!\n\n<b>\t\t\t\tRACHEL\n</b>\t\tEllie...Ellie...what...\n\n<b>\t\t\t\tELLIE\n</b>\t\tPaxcow says it's almost too late!\n\t\tWe have to go back! Paxcow says it's\n\t\talmost too late!\n\n<b>EXT.  LUDLOW CEMETARY  DAY\n</b>\nThe CREED wagon turns in and drives up one of the lanes. It stops \nand LOUIS gets out.\n\n<b>EXT.  LOUIS\n</b>\nHe walks to a fresh grave on which the first flowers are already \nstarting to wilt. He sits down and takes a flower. He plucks it, \nlooking at the grave steadily. He says nothing for a long time.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tIt's wrong. (Pause) What happened\n\t\tto you is wrong.\n\n<b>EXT.  GAGE, IN THE FIELD\n</b>\nHe runs toward THE CAMERA, happy and laughing, in SLOW MOTION.\n\n<b>EXT.  LOUIS, BY GAGE'S GRAVE\n</b>\nLOUIS is now weeping, but he seems calm just the same.\n\n\t\t\t\tPASCOW (voice)\n\t\tRemember, doc.\n\nLOUIS looks at:\n\n<b>EXT.  A TOMB, LOUIS'S POV\n</b>\nPASCOW, bloody and mutilated, is standing by it.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tThe barrier was not meant to be\n\t\tcrossed. The ground is sour.\n\n<b>EXT.  LOUIS, BY GAGE'S GRAVE\n</b>\nHe is not put out of countenance in the slightest by PASCOW'S \nappearance; he probably knows PASCOW is just a figment of his \nconscience or imagination, and so do we.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI'll tell you where the ground\n\t\tis sour--the ground in my heart\n\t\tis sour. Let me tell you something\n\t\telse, Vic-baby: Wrong is wrong.\n\n<b>EXT.  PASCOW\n</b>\n<b>\t\t\t\tPASCOW\n</b>\t\tTimmy Baterman. That was wrong.\n\n<b>EXT.  LOUIS, BY GAGE'S GRAVE\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tDon't talk like an asshole even if\n\t\tyou are just a bit of underdone\n\t\tpotato or a blot of mustard.\n\n<b>EXT.  PASCOW, BY THE TOMB\n</b>\nHe stands mute, just looking.\n\n<b>EXT.  LOUIS\n</b>\n\t\t\t\tLOUIS (weeping)\n\t\tHe was my son! He wasn't even two\n\t\tand he was run down in the fucking\n\t\troad and he was almost in pieces,\n\t\tand if you don't think I'm going\n\t\tto try...\n\n<b>EXT.  THE TOMB, SANS PASCOW\n</b>\nVIC has put on his boogie shoes.\n\n<b>EXT.  LOUIS, BY GAGE'S GRAVE\n</b>\nHe's crying harder. Abruptly he reaches out at the floral tributes \nand knocks a bunch of them over.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tIf it doesn't work--if he comes\n\t\tback like Timmy Baterman--I'll\n\t\tput him to sleep. But I'm going\n\t\tto try. (Pause) And if it doesn't\n\t\twork...they don't ever need to know.\n\n<b>EXT.  THE GOLDMAN HOUSE IN LAKE FOREST, ILLINOIS  NIGHT\n</b>\n<b>INT.  UPSTAIRS HALL  NIGHT\n</b>\nTHE CAMERA MOVES LEISURELY along this hallway, which is lined with \npictures of RACHEL, ELLIE...and GAGE (there may even be a couple \nin which LOUIS is featured, but damned few). Near the end of the \nhall a door is open and light spills out.\n\n\t\t\t\tRACHEL (voice)\n\t\tHoney, you just had a bad dream. You\n\t\tknow that, don't you?\n\n\t\t\t\tELLIE (voice)\n\t\tIt wasn't a dream. It was Paxcow.\n\nTHE CAMERA GOES THROUGH THE DOOR and into the room where ELLIE is \nstaying. She's in bed, still badly upset. RACHEL is sitting on the \nbed beside her. There's a single lamp on the bedside table.\n\n<b>\t\t\t\tELLIE\n</b>\t\tPaxcow says Daddy's going to do something\n\t\treally bad. He--\n\n<b>\t\t\t\tRACHEL\n</b>\t\tWho is this Paxcow? Is he like the\n\t\tboogeyman?\n\n<b>\t\t\t\tELLIE\n</b>\t\tHe's a ghost. But he's a good ghost.\n\nRACHEL turns off the bed-lamp.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tThere are no ghosts, Ellie. I want you\n\t\tto go to sleep and forget all this\n\t\tnonsense.\n\n<b>\t\t\t\tELLIE\n</b>\t\tWill you at least call and make sure\n\t\tdaddy's okay?\n\n<b>\t\t\t\tRACHEL\n</b>\t\tOf course I will.\n\nShe kisses ELLIE.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tNow will you try to go to sleep?\n\n\t\t\t\tELLIE (turns over on her side)\n\t\tYes, Mom.\n\nRACHEL gets up and leaves the room.\n\n<b>INT.  THE UPSTAIRS HALLWAY\n</b>\nPASCOW is here, halfway down the hall to the stairs, bloody as \never. RACHEL doesn't see him. She looks perplexed, a woman trying \nto think of something. She stops very near him.\n\n\t\t\t\tRACHEL (to herself)\n\t\tPaxcow, why do I know that name?\n\n<b>\t\t\t\tPASCOW\n</b>\t\tPascow.\n\nRACHEL suddenly straightens. She looks startled and afraid.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tPascow? Was she saying Pascow?\n\nShe suddenly heads for the stairs, fast.\n\n<b>EXT.  THE CREED HOME IN LUDLOW  NIGHT\n</b>\nSOUND: A car starting up.\n\nThe station wagon backs out and heads down the driveway. As it \npasses THE CAMERA, we see LOUIS driving. The wagon turns onto \nRoute 9 and heads off.\n\nCAMERA HOLDS ON THE HOUSE. A beat of silence. Then: the telephone \nstarts ringing.\n\n<b>INT.  THE GOLDMAN LIVING ROOM  NIGHT\n</b>\nIRWIN and DORY are watching RACHEL with some anxiety. RACHEL is \nholding the phone to her ear. We can hear the FILTERED SOUND of \none ring after another. She hangs up.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tHe's not home.\n\n<b>\t\t\t\tDORY\n</b>\t\tWhy, he probably went out for\n\t\ta hamburger or a chicken dinner,\n\t\tdear. You know how men are when\n\t\tthey're alone.\n\nGood old IRWIN'S face says that maybe LOUIS went out for a couple \nof grams of coke and a whore in Nazi SS boots.\n\nRACHEL is dialing another number.\n\n<b>EXT.  THE CRANDALL HOUSE  NIGHT\n</b>\nSOUND: Phone starts to ring.\n\n<b>INT.  THE CRANDALL KITCHEN, WITH JUD\n</b>\nHe shuffles to the telephone. His Walkman 'phones are around his \nneck. He's got a bottle of beer in one hand.\n\n\t\t\t\tJUD (picks up)\n\t\tHello--you got Judson.\n\n<b>INT.  THE GOLDMAN LIVING ROOM, WITH RACHEL\n</b>\n<b>\t\t\t\tRACHEL\n</b>\t\tIt's Rachel Creed, Jud. I'm\n\t\tcalling from Chicago.\n\n\t\t\t\tJUD (surprised voice)\n\t\tChicago! Is Louis with you?\n\n<b>\t\t\t\tRACHEL\n</b>\t\tNo...we're going to be here\n\t\tawhile, and he wanted a few days\n\t\tto wind up our affairs there.\n\t\tI just wondered if he was with you.\n\n<b>INT.  THE CRANDALL KITCHEN, WITH JUD\n</b>\nHis face says this is very serious.\n\n<b>\t\t\t\tJUD\n</b>\t\tNo--but if he drops by, I'll tell\n\t\thim to call you.\n\n<b>INT.  THE GOLDMAN LIVING ROOM\n</b>\n<b>\t\t\t\tRACHEL\n</b>\t\tJud, do you remember the name\n\t\tof the student that died on Louis's\n\t\tfirst day at work? The one that was\n\t\thit by a car?\n\n\t\t\t\tJUD (voice)\n\t\tI don't--\n\n<b>\t\t\t\tRACHEL\n</b>\t\tWas it Pascow?\n\n<b>INT.  THE CRANDALL KITCHEN, WITH JUD\n</b>\n<b>\t\t\t\tJUD\n</b>\t\tAyuh, I think 'twas. If I see Louis\n\t\tcome home before I go to bed, I'll\n\t\ttell him to--\n\n<b>INT.  THE GOLDMAN LIVING ROOM, WITH RACHEL\n</b>\n<b>\t\t\t\tRACHEL\n</b>\t\tDon't bother. I'm coming home.\n\n\t\t\t\tJUD (alarmed voice)\n\t\tRachel!\n\n<b>\t\t\t\tRACHEL\n</b>\t\tThank you, Jud. Goodbye.\n\nShe hangs up.\n\n<b>INT.  THE CRANDALL KITCHEN, WITH JUD\n</b>\n<b>\t\t\t\tJUD\n</b>\t\tNo! Rachel! Don't do that!\n\t\tRachel--!\n\nThe buzz of an open line. Connection broken. JUD slowly replaces \nthe receiver. The man looks very grim.\n\n<b>INT.  THE FRONT HALL OF THE GOLDMAN HOUSE\n</b>\nRACHEL comes down the stairs, dressed for travelling. She's \ncarrying a suitcase in one hand. Her parents meet her at the foot \nof the stairs.\n\n<b>\t\t\t\tDORY\n</b>\t\tRachel...darling...you're upset...\n\t\ta night's sleep...\n\n<b>\t\t\t\tRACHEL\n</b>\t\tI have to go. The connections are \n\t\ttight, and I have to be at O'Hare in \n\t\tforty minutes. Will you drive me,\n\t\tdaddy?\n\n<b>\t\t\t\tIRWIN\n</b>\t\tYou know something's wrong, don't you?\n\t\tYou know. And Ellie does, too.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tYes.\n\n<b>\t\t\t\tIRWIN\n</b>\t\tI'll drive you.\n\n\t\t\t\tELLIE (voice)\n\t\tMommy?\n\nThey all turn to:\n\n<b>INT.  ELLIE, ON THE STAIRS\n</b>\n<b>\t\t\t\tELLIE\n</b>\t\tPlease hurry.\n\n<b>INT.  RACHEL AND THE GOLDMANS\n</b>\n<b>\t\t\t\tRACHEL\n</b>\t\tI will. Come and kiss me.\n\nELLIE races into her arms.\n\n<b>EXT.  LUDLOW CEMETERY  NIGHT\n</b>\nSOUND Of a car engine, THROBBING AND LOW. It cuts off.\n\nCAMERA MOVES IN on the low stone wall between the cemetery and the \nroad. Beyond it we can see the roof of the CREED station wagon.\n\nLOUIS appears, dressed in dark clothes. He looks both ways, then \ntosses a big duffle bag over the wall. Stuff clanks inside.\n\nLOUIS climbs over the wall, grabs his bag, and checks out the \nscene.\n\n<b>EXT.  LUDLOW CEMETERY, LOUIS'S POV\n</b>\nA quiet city of the dead. Spooky. SOUND of crickets: Ree-ree-\nree...\n\n<b>EXT.  LOUIS\n</b>\nHe heads for GAGE'S grave.\n\n<b>INT.  THE GOLDMAN CAR, WITH RACHEL AND IRWIN\n</b>\n<b>\t\t\t\tIRWIN\n</b>\t\tI'll come with you if you want,\n\t\thoney.\n\n\t\t\t\tRACHEL (shakes her head)\n\t\tI've got three planes to catch and\n\t\tI got the last seats on two of them.\n\t\tIt's like God saved them for me.\n\n<b>EXT.  O'HARE UNITED AIRLINES TERMINAL, WITH IRWIN'S CAR\n</b>\nIRWIN'S car heads for it.\n\n<b>EXT.  THE GRAVE OF GAGE CREED\n</b>\nLOUIS approaches it slowly and sets down his bag of grave-robbing \nequipment. He sets aside the remaining floral tributes and then \nopens the bag and takes out the spade. He looks down at the grave \nfor a long second.\n\n\t\t\t\tLOUIS (low)\n\t\tGonna bust you out, son.\n\nHe starts to shovel.\n\n<b>EXT.  THE SHOVEL, CU\n</b>\nDigging...throwing...digging again. Already the shape of the \nexcavation is beginning to show. The work is easy; this earth is \nnew and fresh.\n\n<b>EXT.  JETLINER, IN A LINE-UP OF JETLINERS\n</b>\n<b>INT.  JETLINER, WITH RACHEL\n</b>\nEveryone looks impatient, but RACHEL looks half crazy.\n\n\t\t\t\tPILOT (voice)\n\t\tThis is the Captain speaking.\n\t\tI'm sorry about this delay, folks,\n\t\tbut we've got a real low ceiling\n\t\ttonight and air traffic control's\n\t\tplaying it safe. Looks like it's\n\t\tgoing to be about half an hour before\n\t\twe get on a roll, so I'm turning off\n\t\tthe NO SMOKING sign.\n\nSOUND: Bing!\n\nThere's a general groan. CAMERA MOVES IN ON RACHEL, who has closed \nher eyes. I think she's praying.\n\n<b>EXT.  GAGE'S GRAVE  NIGHT\n</b>\nNow it's pretty deep. Four feet, maybe. LOUIS is standing in it. \nWe see his feet as the shovel goes up and down, up and down.\n\n<b>EXT.  LOUIS  NIGHT\n</b>\nHe's sweating and dirt-streaked. He's tossing dirt on a big pile. \nSuddenly, as he takes another shovelful, we hear a SCRAPING SOUND. \nHe tosses the shovel aside and squats.\n\n<b>EXT.  IN THE GRAVE, WITH LOUIS\n</b>\nThere's a white streak on the bottom of the grave--the top of \nGAGE'S coffin. LOUIS swipes his hand through the loose dirt, \nuncovering more, and then he begins to sweep off the top of the \ncoffin with his hands.\n\n<b>EXT.  THE CRANDALL PORCH\n</b>\nJUD comes out. He's wearing a light jacket. His Walkman 'phones \nare around his neck. He's got a six-pack. He looks at:\n\n<b>EXT.  THE CREED HOUSE, JUD'S POV\n</b>\nIt's dark.\n\n<b>EXT.  THE CRANDALL PORCH, WITH JUD\n</b>\nHe sits down.\n\n<b>\t\t\t\tJUD\n</b>\t\tYou done it, you stupid old man...\n\t\tnow you got to undo it.\n\nHe puts his earphones on. Cracks a beer. Lights a cigarette. \nPushes the PLAY button on the deck. Faint SOUNDS of The Clash \nbuzz-sawing \"Rock The Casbah.\"\n\nJUD begins to watch.\n\n<b>EXT.  LOUIS\n</b>\nHe climbs out of the grave and opens his duffle bag. He starts to \npull out the pick.\n\nSOUND of an approaching car.\n\nLOUIS freezes.\n\n<b>EXT.  THE ROAD OUTSIDE OF THE CEMETERY\n</b>\nA police car comes cruising slowly along. The spotlight on the \ndriver's side comes on and runs along the graveyard's stone wall.\n\n<b>EXT.  LOUIS\n</b>\nWatching. Waiting. Hardly breathing.\n\n<b>EXT.  THE POLICE CAR\n</b>\nIt reaches the end of the wall. Everything looks jake. The \nspotlight goes out and the police car speeds up.\n\n<b>EXT.  LOUIS\n</b>\nHe relaxes perceptibly. He gets the pick and drops back into the \ngrave.\n\n<b>EXT.  THE TOP OF THE COFFIN, CU\n</b>\nLOUIS inserts the tip of the pick in the flange of the coffin and \nlevers it. CRACKING SOUND. Again. More CRACKING. Again. And the \nlock breaks. The coffin lid comes up a little, dirt gritting in \nthe hinges.\n\n<b>EXT.  LOUIS, CU\n</b>\nHere's a man on the thinnest edge between sanity and madness.\n\n<b>EXT.  JETLINER LIFTING OFF FROM O'HARE\n</b>\n<b>INT.  RACHEL AND HER SEATMATE\n</b>\n<b>\t\t\t\tSEATMATE\n</b>\t\tThink you'll make your connection\n\t\tin Boston?\n\n<b>\t\t\t\tRACHEL\n</b>\t\tI have to.\n\n<b>EXT.  LOUIS, BY GAGE'S GRAVE\n</b>\nHe's lying on his stomach, reaching in. We hear the SOUND of dirt \ngrating in hinges again.\n\n<b>EXT.  LOUIS, CU\n</b>\nWe're looking up into his face. If GAGE had a POV, this would be \nit. LOUIS'S face fills with a terrible grief.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tOh, Gage--oh, honey.\n\n<b>EXT.  JUD CRANDALL, ON HIS PORCH\n</b>\nHis chin slips to his chest, even though we hear Creedence on his \n'phones and to him the sound must be at blastoff levels. There's a \nlong round ash on his cigarette in the tray. A couple of empty \nbeer cans on the table beside him.\n\nA truck blasts by, startling him out of his doze. He jerks his \nhead up suddenly...and slaps himself. He's okay...for now.\n\n<b>EXT.  THE GRAVEYARD, WITH LOUIS\n</b>\nHe is sitting on the edge of the grave, holding his dead son in \nhis arms, rocking him. GAGE is back to us. We see only a small \nlimp figure in a dark suit. Hair flops limply.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tIt's going to be all right...I\n\t\tswear it's going to be all right...\n\nThe canvas tarp has been spread open to the right. LOUIS begins to \nlay his son down on it.\n\n<b>EXT.  THE GROUND BESIDE THE TARP, CU\n</b>\nIt's littered with flower petals. One limp hand appears among \nthem.\n\n<b>EXT.  LOUIS\n</b>\nHe closes the tarp over GAGE, making a roll. He then produces rope \nfrom the duffle bag. He cuts the rope and begins to tie one piece \naround one end of the canvas roll containing the corpse of his \nson.\n\n<b>EXT.  JETLINER IN THE NIGHT SKY\n</b>\n\t\t\t\tPILOT (voice)\n\t\tGood evening again, ladies and\n\t\tgentlemen...\n\n<b>INT.  THE JETLINER, WITH RACHEL\n</b>\nHer seatmate is knitting something. Across the aisle sits VICTOR \nPASCOW, bloody but serene, hands clasped in his lap, looking \nstraight ahead. RACHEL looks around tensely.\n\n\t\t\t\tPILOT (continues)\n\t\tI'm delighted to tell you that we've\n\t\tgot a strong tail-wind tonight and\n\t\twe expect to arrive at Boston's\n\t\tLogan Airport almost on time.\n\nPASCOW clenches his fist in a \"That's one for our side!\" gesture.\n\n\t\t\t\tRACHEL (softly)\n\t\tThank God.\n\nHer SEATMATE looks at her a bit strangely.\n\n<b>EXT.  THE GRAVEYARD, WITH LOUIS\n</b>\nHe's got the bundle containing his son and the duffle-bag with the \ntools. He runs bent over. He reaches the wall and there's the \nSOUND of another motor. He crouches at the base of the wall.\n\n<b>EXT.  THE ROAD\n</b>\nHere comes that same police car. The spotlight runs along the \nwall.\n\n<b>EXT.  LOUIS\n</b>\nCrouching against his side of the wall and sweating.\n\n<b>EXT.  THE POLICE CAR\n</b>\nIt stops. The COP gets out. He walks slowly toward the wall.\n\n<b>EXT.  LOUIS\n</b>\nCrouched. Now we see the COP looking over the top. If he looks \ndown...but he doesn't. Instead he turns around so we see his back. \nLOUIS looks up, miserably scared, pouring sweat.\n\nSilence. Then: SOUND of the cop taking a whiz.\n\n<b>EXT.  THE COP\n</b>\nAh! Relief. SOUND of his fly being zipped. He looks back at the \ncemetery for a moment.\n\n<b>\t\t\t\tCOP\n</b>\t\tI ain't afraid of no ghost.\n\nHe walks back to his cruiser, gets in, and hauls ass.\n\n<b>EXT.  LOUIS, BEHIND THE WALL\n</b>\nHe collapses with relief. Then he gets up and looks cautiously \nover the wall. Nothing there but his car, parked a little way down \non the other side of the road.\n\nHe tosses the duffle bag over the top of the wall. He puts the \ncanvas roll containing GAGE on top of the wall. Then he vaults \nover.\n\n<b>EXT.  THE STREET SIDE OF THE WALL, WITH LOUIS\n</b>\nHe takes the roll, gets the duffle bag hooked over his shoulder by \nthe string, and runs across the road like a soldier crossing enemy \nterritory. He goes to the rear of the wagon.\n\n<b>EXT.  THE REAR OF THE WAGON, WITH LOUIS\n</b>\nHe puts the body down. He feels in his pocket for his keys. No \nkeys. Mild consternation. He looks around, feeling exposed. The \nother pocket. Still no keys. More consternation. He begins to hunt \nfeverishly through his pockets. Maybe in his jacket? Nope.\n\nSOUND: An approaching car.\n\n<b>EXT.  PASSING CAR\n</b>\nA civilian--not the ubiquitous cop.\n\n<b>EXT.  LOUIS\n</b>\nHe turns his pockets out, spilling change everywhere. Nothing. \nSuddenly a little light goes on in his eyes. He goes to the \ndriver's side of the car and looks in at:\n\n<b>INT.  IGNITION, LOUIS'S POV\n</b>\nThe keys are in the switch.\n\n<b>EXT.  LOUIS\n</b>\nHe snatches the keys and returns to the back of the wagon. He uses \nthe key to open the doorgate. He puts GAGE'S body in gently, then \nthe duffle bag. He closes the doorgate and returns to the front of \nthe car. He opens the driver's door and freezes.\n\nLOUIS returns to the rear, gets his keys from the doorgate, comes \nback to the front, gets in, and drives away.\n\n<b>INT.  A JETWAY AT LOGAN INTERNATIONAL\n</b>\nPeople are debarking into the gate area. Through them comes \nRACHEL, running fast, pushing some people, excusing herself \nincoherently. PASCOW is walking near her.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tThere's just time. If you run.\n\nWithout looking at PASCOW, RACHEL takes off her shoes and runs.\n\n<b>INT.  THE CONCOURSE, WITH RACHEL\n</b>\nShe's sprinting down the concourse--look out, Joanie Benoit!\n\n<b>INT.  GATE 27, WITH FEMALE GATE AGENT AND PASCOW\n</b>\nThe FEMALE GATE AGENT is starting to close the jetway door.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tDon't do that, babe.\n\nThe GATE AGENT looks puzzled, as if she just had a thought (or \nmaybe a gas pain). She stops closing the door. RACHEL runs into \nthe area. She sees:\n\n<b>INT./EXT.  THE JET PLANE, THROUGH THE GATE WINDOWS\n</b>\nIt is just starting to swing ponderously away from the jetway.\n\n<b>INT.  RACHEL AND FEMALE GATE AGENT (PASCOW IS GONE)\n</b>\n<b>\t\t\t\tRACHEL\n</b>\t\tMake it come back!\n\n<b>\t\t\t\tFEMALE GATE AGENT\n</b>\t\tI can't--\n\nRACHEL bolts down the jetway. The GATE AGENT stares after her, and \nthen runs for her stand, where we can see FLIGHT 61 and BANGOR on \nthe slide-cards. She picks up her mike.\n\n<b>EXT.  THE JETWAY  NIGHT\n</b>\nRACHEL stands all alone at the end of it.\n\n<b>AMPLIFIED SOUNDS OF JET ENGINES.\n</b>\n\t\t\t\tRACHEL (screams)\n<b>\t\tCOME BACK, MOTHERFUCKER!!\n</b>\n<b>EXT.  THE JET, RACHEL'S POV\n</b>\nIt starts to swing back to pick her up.\n\n<b>EXT.  RACHEL\n</b>\nPASCOW appears behind her and puts a hand on her shoulder.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tYou're doing just fine.\n\n<b>EXT.  JUD CRANDALL, ON HIS PORCH\n</b>\nHe's fast asleep with the tinny sound of Graham Parker coming out \nof his Walkman 'phones.\n\nSOUND: An approaching car.\n\n<b>EXT.  THE CREED HOUSE\n</b>\nThe station wagon turns in and parks. LOUIS gets out. He opens the \nback, removes the body in the tarp and the duffle bag filled with \ntools. He manages to get everything together and walks to the edge \nof the path. He looks at:\n\n<b>EXT.  THE PATH TO THE PET SEMATARY, LOUIS'S POV\n</b>\nOff it goes, glimmering in the dark.\n\n<b>EXT.  LOUIS\n</b>\nHe holds the corpse of his little boy to him.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tPlease God--let this work.\n\nHe sets off.\n\n<b>EXT.  JUD, ON HIS PORCH\n</b>\nZonked out. He missed the whole thing. Nice going, Jud.\n\n<b>EXT.  OUTSIDE THE ARCH TO THE PET SEMATARY, WITH LOUIS\n</b>\nLouis passes under like a ghost.\n\n<b>EXT.  THE PET SEMATARY, WITH LOUIS\n</b>\nLOUIS is crying. He crosses to the deadfall.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tAin't gonna stop, Gage. Ain't\n\t\tgonna look down.\n\nHe begins to mount the deadfall.\n\n<b>EXT.  LOUIS, A NEW ANGLE\n</b>\nHe reaches the top. And woven into the deadfall, behind him, \nfacing the Pet Sematary, is that snarling face.\n\nLOUIS descends the other side.\n\n<b>EXT.  THE FOOT OF THE DEDFALL, WOODS SIDE\n</b>\nLOUIS reaches the bottom and looks at:\n\n<b>EXT.  THE WOODS, LOUIS'S POV\n</b>\nThe path winds onward through those gigantic trees--it glows \nslightly.\n\n<b>EXT.  LOUIS, MOVING UP THE PATH\n</b>\n<b>EXT.  LOUIS, AT THE EDGE OF LITTLE GOD SWAMP\n</b>\nThat phosphorescent glow is a lot more pronounced. SOUNDS of \nCRICKETS and FROGS. The water is mucky and still. Hummocks stick \nup like knobs on the back of a creature best not seen. Fog drifts \nthrough the dead trees. LOUIS doesn't want to go in there. Smart \nman. I wouldn't either.\n\nBut he does.\n\n<b>INT.  THE HERTZ DESK, AT BIA WITH RACHEL AND CLERK--AND PASCOW\n</b>\nPASCOW is lounging back against the rack of folders--and getting \nsome of them bloody.\n\n<b>\t\t\t\tHERTZ CLERK\n</b>\t\tI'm sorry...it's been very busy\n\t\ttonight. I really don't have\n\t\tanything.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tWhat about the Aries K with the\n\t\tscratch on the side?\n\nThe CLERK starts looking through her papers.\n\n<b>\t\t\t\tCLERK\n</b>\t\tI do have an Aries K, but it came\n\t\tin sort of beat up--there's a long\n\t\tscrape up one side--\n\n<b>\t\t\t\tRACHEL\n</b>\t\tI'll take it.\n\n<b>EXT.  LOUIS, IN LITTLE GOD SWAMP\n</b>\nHe comes walking toward THE CAMERA with GAGE in his arms and the \nduffle bag over his shoulder. Mist swirls around him. The \nlandscape is weird, surreal. CRICKET SOUNDS, AMPLIFIED. In fact \nthere are a lot of swampy, marshy SOUNDS--too many. It sounds \nalmost prehistoric.\n\n<b>SOUND: HARSH, SCREAMING LAUGHTER\n</b>\nLOUIS stops. He looks slowly around at:\n\n<b>EXT.  MIST-FACE, LOUIS'S POV\n</b>\nA demonic face takes shape in the mist and FLOATS SLOWLY TOWARD \nTHE CAMERA. It runs out a tongue that's about nine feet long.\n\nIts eyes blow out. Blood and thick, gooey stuff runs from the \nsockets.\n\n<b>EXT.  LOUIS\n</b>\nHe closes his eyes. After a moment he opens them.\n\n<b>EXT.  LITTLE GOD SWAMP, LOUIS'S POV\n</b>\nNothing there.\n\n<b>EXT.  LOUIS\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tSee? Just imagination. Just--\n\n<b>EXT.  LOUIS'S FEET\n</b>\nWe can barely see them because they are thick in mist, but he is \nstanding on a couple of low, marshy tussocks. Suddenly a thick \ntentacle slimes its way out of the standing water and slithers \naround his ankle.\n\n<b>EXT.  LOUIS, LOOKING DOWN\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tNothing...there.\n\nHe turns around and begins to walk again.\n\n<b>EXT.  LOUIS'S FEET\n</b>\nThe tentacle falls away.\n\n<b>EXT.  LOUIS, IN LITTLE GOD SWAMP\n</b>\nMYRIAD SOUNDS, none of them pleasant--laughter, gobbling howls, \nscreams. Sounds like the swamp has been invaded by a pack of \nescaped lunatics. LOUIS continues on regardless.\n\n<b>EXT.  WOODS\n</b>\nLOUIS comes into the frame. He's obviously tiring now, but he \nkeeps moving along.\n\nSOUND: Approaching footsteps. Big ones. Thudding ones. Something \nis coming which sounds approximately the size of a Tyrannosaurus \nRex. And it just keeps getting louder and louder and louder. LOUIS \nlooks plenty scared.\n\nSOUND: A falling tree.\n\n<b>EXT.  WOODS, LOUIS'S POV\n</b>\nThose SOUNDS keep getting closer and closer. Another tree falls--\nwe see this one. And now we see a SHAPE--just a SHAPE.\n\n<b>EXT.  LOUIS\n</b>\nHe's scared almost to death. His face turns up...up...up.\n\n<b>EXT.  THE WOODS--AND THE SHAPE, LOUIS'S POV\n</b>\nIt is vaguely manlike: perhaps sixty feet tall, perhaps eighty. We \ndon't see it very well, nor do we have to--I'm not even sure it's \nflesh and blood. But there is a clear suggestion of a head. Now it \nturns and looks down...looks at LOUIS CREED. We see great yellow \neyes the size of lighthouse lamps.\n\nIt makes a huge GRUNTING SOUND...and then walks on.\n\n<b>EXT.  LOUIS\n</b>\nThe SOUND OF FOOTFALLS is slowly diminishing.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tIt was the Wendigo. Dear God, I\n\t\tthink the Wendigo just passed\n\t\twithin sixty feet of me.\n\nSlowly he begins to walk again.\n\n<b>EXT.  LOUIS, A NEW ANGLE\n</b>\nIn the extreme f.g. is a tree which has just fallen--it is no \nsmall tree, either, but a great big old fir.\n\nLOUIS approaches it. Stops. Looks at the tree. Looks down at:\n\n<b>EXT.  THE FOREST FLOOR, LOUIS'S POV\n</b>\nHere is a gigantic animal track--if it was full of water, LOUIS \ncould swim in it. It looks like no animal track we've ever seen \nbefore. Three big claws at the end of it.\n\n<b>EXT.  LOUIS\n</b>\nLooks up again. His face is set and hard.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tIt doesn't matter. Come on, Gage.\n\nHe starts to walk again.\n\n<b>EXT.  THE MICMAC BURYING GROUND\n</b>\nSOUND: The wind, lonesome and keening.\n\nTHE CAMERA MOVES SLOWLY toward the slope, dreaming its way over \nthose rocky cairns...most of them burst apart.\n\nSOUND: Tortured breathing. Panting.\n\nLOUIS toils his way into view, carrying his bundle. He reaches the \ntop. He makes his way slowly into the burying ground. He stumbles \nover a rock. Falls down. Slowly gathers his things together and \ngets up again. He goes a little further and then stops and looks \nat:\n\n<b>EXT.  A BROKEN CAIRN AND THE GRAVE BENEATH, LOUIS'S POV\n</b>\nWe can also see the shredded remains of a green garbage bag.\n\n<b>EXT.  LOUIS\n</b>\nHe slowly kneels down. He puts the canvas tarp to one side and \nslowly takes the pick and shovel from the duffle bag. By now he is \nclearly a man approaching total exhaustion.\n\n<b>EXT.  A COUNTRY ROAD, WITH AN ARIES K\n</b>\nIt tracks past THE CAMERA.\n\n<b>INT.  THE ARIES K WITH RACHEL AND PASCOW\n</b>\nBoth of them look tense. RACHEL is bolt upright behind the wheel. \nSuddenly, BANG! as one of the tires blow.\n\n<b>EXT.  THE ARIES K\n</b>\nIt goes skidding and slueing across the road, the rear tire half \noff the rim. IT climbs the curb and hits a tree.\n\n<b>INT.  RACHEL\n</b>\nShe lurches forward, but she's wearing her seat-belt--good girl! \nShe unbuckles it and gets out.\n\n<b>EXT.  RACHEL\n</b>\nShe looks at the car, which now has quite a bit more wrong with it \nthan just a scratch up the side.\n\nRACHEL slumps, near tears. LOUIS isn't the only one who's been \nthrough a lot tonight.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tNow what?\n\nPASCOW comes from around the tree as RACHEL walks to the road, \nlooking for cars, or something. He looks urgent and upset.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tIt's trying to stop you. Do you\n\t\thear me? It's trying to stop you.\n\nRACHEL looks around uncertainly...a little afraid. As she scans \nthe scene she looks at--and through--PASCOW.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tIs anyone there?\n\nAfter a moment of silence she turns back to the road. Lights \nappear and brighten as a car approaches. RACHEL steps to the \nshoulder and after a moment she sticks out her thumb, surely for \nthe first time in her life.\n\nThe car sweeps by her without slowing.\n\n<b>EXT.  GAGE'S CAIRN, CU\n</b>\nLOUIS'S hands enter the shot and put a few more rocks on it. THE \nCAMERA PULLS BACK and we see him surveying his work. Beside him is \nthe canvas tarp, now open and empty.\n\nAbsently, LOUIS stuffs the tarp into the duffle bag (where his \ntools have also been replaced) and stands up with a wince. One \nhand goes to his lower back. He looks down at the cairn.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tCome back to me, Gage. Come back\n\t\tto us.\n\nHe turns away toward the stairs.\n\n<b>EXT.  RACHEL, ON ROUTE 9\n</b>\nShe's walking down the shoulder with her high heels in one hand. \nLights. An approaching car. She turns, thumb out. The car blasts \nby.\n\n\t\t\t\tRACHEL (shouts)\n<b>\t\tMAY THE SEWERS OF RANGOON BACK UP\n</b><b>\t\tIN YOUR BEDROOM, ASSHOLE!\n</b>\nShe starts walking again.\n\n<b>EXT.  THE FIELD BESIDE LOUIS'S HOUSE\n</b>\nLOUIS is moving down the path. As he passes the tire swing he \npushes it, setting it in motion.\n\n<b>INT.  THE GARAGE\n</b>\nLOUIS slings the duffle bag wearily to one side and goes into the \nkitchen. CHURCH is under the table but LOUIS Doesn't see him.\n\n<b>INT.  THE UPSTAIRS HALL\n</b>\nSOUND of LOUIS slowly plodding up the stairs. He comes into view, \ndirty and exhausted, his hair hanging in his face. He walks down \nthe hall toward the master bedroom.\n\n<b>INT.  THE BEDROOM\n</b>\nThe clock on the bedtable reads 2:17 A.M. LOUIS falls face-first \non the immaculate bedspread and lies still.\n\nIn this shot we should note the closet door is standing open.\n\n<b>EXT.  THE MICMAC BURYING GROUND, FEATURING GAGE'S CAIRN\n</b>\nTHE CAMERA MOVES IN SLOWLY. Holds. Nothing for a beat. Then:\n\nA small white hand slams up through the rocks, hopefully scaring \nthe living shit out of us.\n\nCAMERA MOVES CLOSER as the hand begins to feel around. It takes \none of the rocks and pushes it aside. Another. Another. Another.\n\nThe SOUNDS are not encouraging. It is GRUNTING and GROWLING. There \nis nothing human here.\n\nRocks begin to tumble as GAGE starts to come out of his grave.\n\n<b>INT.  THE CREED BEDROOM, WITH LOUIS\n</b>\nFast asleep on the coverlet in his dirty jeans and black sweater.\n\n<b>EXT.  RACHEL\n</b>\nMy babe is still takin' a hike. But here comes another vehicle.\n\n<b>EXT.  THE DEADFALL IN THE PET SEMATARY\n</b>\nTHE CAMERA MOVES IN on that snarling face.\n\nSOUNDS: GAGE coming. Dead dry breath. Low snarling noises.\n\nNow we see small feet in dirty black shoes walking down the \ndeadfall.\n\n<b>EXT.  RACHEL\n</b>\nSuddenly, as the lights appear, she does a Claudette Colbert, \npulling her skirt up and exhibiting a very lovely leg.\n\nLights--it's an Orinco truck, naturally--spotlight her. The truck \nstops.\n\n<b>EXT.  RACHEL AND THE TRUCK\n</b>\nThe driver leans over and opens the door.\n\n<b>\t\t\t\tDRIVER\n</b>\t\tHop in, baby.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tThank you.\n\nShe does.\n\n<b>INT.  THE CREED KITCHEN, WITH CHURCH\n</b>\nHe's under the kitchen table, green eyes gleaming. I think he \nloves dead, hates living.\n\nSOUND: The doorlatch. CHURCH MIAOWS.\n\n<b>INT.  THE KITCHEN, A NEW (LOW) ANGLE\n</b>\nGAGE'S shoes grit slowly across the linoleum, leaving dirty \ntracks. CHURCH turns to watch GAGE'S passage, and then follows.\n\n<b>INT.  THE BEDROOM, WITH LOUIS\n</b>\nCAMERA HOLDS ON LOUIS as those gritting footsteps approach. Then \nwe pan to the closet. On the floor is LOUIS'S little black bag. We \nhold on this as the footfalls near. A small white hand enters the \nframe and pulls the doctor-bag out of the closet. Now another hand \nenters the frame and opens the bag. The hands search around inside \nand bring out a scalpel.\n\nThey hold it up. The GAGE-THING makes a contented SOUND.\n\n<b>EXT.  THE ORINCO TRUCK, ON ROUTE 9  NIGHT\n</b>\nIt sweeps past THE CAMERA\n\n<b>INT.  THE CAB, WITH RACHEL AND DRIVER\n</b>\n<b>\t\t\t\tRACHEL\n</b>\t\tCan't you go any faster?\n\n<b>\t\t\t\tTRUCKER\n</b>\t\tLady, I got nine points on my\n\t\tlicense right now.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tI understand. It's just that--\n\nShe looks at him, pleading. The TRUCKER speeds up.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tThank you. If you only understood\n\t\thow important this is--\n\n<b>\t\t\t\tTRUCKER\n</b>\t\tThat's all right, babe. Only if we\n\t\tget stopped, next time I'll be the\n\t\tone hitchin' and you can give me a\n\t\tride.\n\n<b>EXT.  JUD, ON HIS PORCH\n</b>\nMore deeply asleep than ever. Suddenly, from inside, comes the \nsound of Quiet Riot singing/screaming \"Bang Your Head.\" It's the \nstereo, and boy, is it cranked.\n\nJUD straightens up so suddenly he almost falls off his chair. His \nhands go first to his earphones--his first thought on waking is \nthat it's coming from there--and then he hurries inside.\n\nCAMERA PANS DOWN to small muddy tracks on the porch floor.\n\n<b>INT.  THE LIVING ROOM, WITH JUD\n</b>\nHe hurries in, turns on the light, and rushes across to his stereo \nsystem, which is state-of-the-art digital--it looks like a flying \nsaucer among the more traditional furnishings of the room. He \nshuts it off and looks around, frowning.\n\nSOUND: Todd Rundgren, singing \"Bang on the Drum All Day\" at the \ntop of his voice.\n\nJUD'S head snaps toward the SOUND.\n\n<b>INT.  A SONY RADIO, CU\n</b>\nTHE CAMERA PULLS BACK as JUD hurries across the kitchen to the \ncounter, where the radio is. He turns it off, looking around, more \nbewildered than ever.\n\n\t\t\t\tJUD (sharply)\n\t\tWho's here?\n\nHe walks toward the door which gives on the hall.\n\n<b>INT.  THE HALL, WITH JUD\n</b>\nIt's dimly lit by light-spill from the living room and kitchen.\n\n<b>\t\t\t\tJUD\n</b>\t\tCome on, stop playing games!\n\nSOUND: Molly Hatchet, \"Flirtin' with Disaster,\" being played top \nend, from upstairs.\n\nJUD hurries up. Let me suggest that there is a certain psychology \nat work here--for the moment he's more concerned about waking the \nneighborhood with all this high-decible rock and roll than with \nthe prowler...and he would certainly know who--or what--that \nprowler was, if he had time to think.\n\n<b>INT.  JUD'S BEDROOM\n</b>\nHe enters and turns on the light. We see a portable phonograph \nwith the record, turning. JUD rushes over and turns it off.\n\nHe looks around, and we see by his face that he knows.\n\n<b>\t\t\t\tJUD\n</b>\t\tGage? (Pause) Are you the one\n\t\tplaying games?\n\nHe goes to the window and looks out at:\n\n<b>INT./EXT.  THE CREED HOUSE, WITH THE STATION WAGON, JUD'S POV\n</b>\n<b>INT.  THE BEDROOM, WITH JUD\n</b>\nHe turns slowly and walks toward the bed.\n\n<b>\t\t\t\tJUD\n</b>\t\tGage? Come on out.\n\nHe reaches in his pocket and brings out a pocket-knife. He unfolds \nthe blade.\n\n<b>\t\t\t\tJUD\n</b>\t\tI want to show you something.\n\nSOUND: Miaow!\n\n<b>INT.  THE DOORWAY, WITH CHURCH, JUD'S POV\n</b>\n<b>INT.  JUD, BY THE BED\n</b>\n\t\t\t\tJUD (to the cat)\n\t\tHow did you--?!\n\n<b>INT.  JUD'S FEET\n</b>\nA small hand holding a scalpel shoots out from beneath the skirt \nof the coverlet and slashes JUD'S calf,\n\n<b>INT.  JUD\n</b>\nHe screams with pain and staggers backward.\n\n<b>INT.  JUD'S FEET\n</b>\nThe other hand shoots out. GAGE grabs one of JUD'S ankles and \npulls.\n\n<b>INT.  JUD\n</b>\nWith a startled yell, he falls.\n\n<b>INT.  JUD AND GAGE\n</b>\nThis one's gotta be pretty rough. George will know what to do. We \nfinally see GAGE, but it should be clear to us that it's not \nreally GAGE at all. Some daemonic presence is riding inside the \nmouldering, disfigured shell of GAGE.\n\nThere is a struggle. JUD is repeatedly slashed with the scalpel. \nPerhaps he gets GAGE a time or two with the pocketknife.\n\nGAGE screams and gibbers--nothing intelligible here; only sounds.\n\nJUD expires.\n\nGAGE sits on top of him...and then bites into his throat.\n\n<b>EXT.  ROUTE 9, BETWEEN THE CRANDALL AND CREED HOUSES\n</b>\nHeadlights. RACHEL'S truck has arrived. It pulls up.\n\nRACHEL opens the passenger door, which is on JUD'S side.\n\n<b>EXT.  ANGLE ON THE CAB\n</b>\nWe can see PASCOW sitting in the passenger seat where RACHEL just \nwas.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tThank you so much.\n\n<b>\t\t\t\tTRUCKER\n</b>\t\tI didn't get a ticket, so you're\n\t\twelcome, lady.\n\t\t\t(And, more seriously)\n\t\tWhatever your problems are, I hope\n\t\tthey work out.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tIt's the end of the line for me,\n\t\ttoo--I'm not allowed any further.\n\n\t\t\t\tRACHEL (to the trucker)\n\t\tI'm sure things will be fine.\n\n<b>\t\t\t\tPASCOW\n</b>\t\tI'm not.\n\nShe closes the door and steps down.\n\nThe truck starts off with a HISS OF RELEASED AIRBRAKES. As it \npulls past her, RACHEL starts across the road, when:\n\n\t\t\t\tGAGE (soft voice)\n\t\tMummy!\n\nShe stops, startled. Her face wears a \"did I hear that?\" \nexpression. She looks back toward JUD'S house.\n\n\t\t\t\tGAGE (soft voice)\n\t\tMummy!\n\nRACHEL walks halfway up JUD'S paved walk and looks at:\n\n<b>EXT.  JUD'S HOUSE, RACHEL'S POV\n</b>\nThe one place in the whole world we do not want RACHEL to go.\n\n<b>EXT.  RACHEL\n</b>\nShe goes. Up the steps to the porch. All through this she's been \ntravelling with two bags: her handbag and a light tote with her \ninitials on it. Now she sets the tote down on the top step and \nopens the porch door.\n\nShe looks very uncertain. This is the wee hours of the morning, \nand someone else's house. But...that voice...\n\n\t\t\t\tGAGE (voice)\n\t\tMummy, I need you!\n\nRACHEL looks stunned--rocked. She steps onto the porch.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tWho--\n\nThe door to the house swings open. After a moment CHURCH comes \ninto the doorway and sits down.\n\n<b>\t\t\t\tCHURCH\n</b>\t\tMiaow!\n\n<b>\t\t\t\tRACHEL\n</b>\t\tChurch!\n\n\t\t\t\tGAGE (voice)\n\t\tMummy, I need you!\n\nShe crosses to the open door.\n\n<b>\t\t\t\tRACHEL\n</b>\t\tGage? Gage?\n\nNo answer. RACHEL steps in.\n\n<b>EXT.  THE CREED HOUSE  MORNING\n</b>\n<b>INT.  THE CREED BEDROOM, WITH LOUIS\n</b>\nHe's restless, having a very bad dream, from the look. He rolls \nback and forth. Closer and closer to the edge. Finally, with a \nwild yell, he goes over onto the floor.\n\n<b>INT.  LOUIS, ON THE FLOOR\n</b>\nHe comes awake. Sits up. Ouch! He's aches from top to bottom and \nside to side...but his back is worst. His hands go to it.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tJesus!\n\nHe starts to get up very slowly, and this his eyes fix on:\n\n<b>INT.  GAGE'S TRACKS ON THE BEDROOM FLOOR, LOUIS'S POV\n</b>\nThey enter the house, go to the closet, then leave again.\n\n<b>INT.  LOUIS\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tGage--?\n\nHe scrambles for the closet, his aches and pains forgotten. He \nstares in wildly.\n\n<b>INT.  THE DOCTOR-BAG\n</b>\nIt's open.\n\n<b>INT.  LOUIS\n</b>\nHe pulls the doctor-bag out. His original hope is now tempered \nwith the first signs of fear. He begins to go through the doctor-\nbag. Suddenly he brings out a case and opens it. The case is \nempty, but the indented shape is clear. There was a scalpel in \nthis case...but not anymore.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tOh my God. (Pause) Gage!\n\n<b>INT.  THE HALL, WITH LOUIS\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tGage!\n\nLOUIS stands there, tensely listening, for a moment or two, but \nthere's only silence. He rushes down the hallway and opens the \ndoor to GAGE'S room.\n\n<b>INT.  GAGE'S ROOM, LOUIS'S POV\n</b>\nEmpty.\n\n<b>INT.  LOUIS, ON THE STAIRS\n</b>\nHe goes downstairs, yelling GAGE'S name.\n\n<b>INT.  THE KITCHEN, WITH LOUIS\n</b>\nNothing. The phone RINGS. LOUIS almost jumps out of his skin \nreaching for it.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tHello!\n\n\t\t\t\tIRWIN (voice)\n\t\tHello, Louis--it's Irwin.\n\t\tI just wanted to be sure Rachel\n\t\tgot back all right.\n\nAs IRWIN says this, LOUIS'S eyes fix upon something.\n\n<b>INT.  THE FLOOR, WITH TWO SETS OF GAGE-TRACKS, LOUIS'S POV\n</b>\nOne set comes in from the shed-garage and heads for the parlor and \nupstairs. The other comes out of the parlor and crosses to the \nkitchen door giving directly on the outside.\n\n<b>INT.  THE KITCHEN, WITH LOUIS\n</b>\nIn his eyes we suddenly see that he understands everything...or \nalmost everything.\n\n\t\t\t\tIRWIN (voice)\n\t\tLouis...are you there?\n\n\t\t\t\tLOUIS (slowly)\n\t\tYes--I'm here.\n\n\t\t\t\tIRWIN (voice)\n\t\tDid she get there all right?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tYes, she's fine.\n\n\t\t\t\tIRWIN (voice)\n\t\tWell, put her on at that end and\n\t\tI'll put Ellie on at this one.\n\t\tEllie's very worried about her\n\t\tmother. (Pause) She's almost\n\t\tin hysterics.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tShe...Rachel's asleep.\n\n\t\t\t\tIRWIN (an edge in his voice now)\n\t\tThen I suggest you wake her up.\n\t\tEllie...I think she had a dream that\n\t\ther mother was dead.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI'll call you right back.\n\n\t\t\t\tIRWIN (voice)\n\t\tLouis--!\n\nBut LOUIS, whose last few responses have been almost trancelike, \nhangs up. He looks at the tracks, then goes into the parlor.\n\n<b>INT.  THE CRANDALL LIVING ROOM, WITH THE PHONE\n</b>\nTiny bloody hands lift it off the cradle. A tiny bloody finger \ndials.\n\n<b>INT.  THE CREED KITCHEN\n</b>\nThe phone starts to ring. After two or three ringy-dingys, LOUIS, \nlooking extremely upset, comes out of the parlor and picks it up.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tIrwin, you'll just have to--\t\t\t\t\n\n\t\t\t\tGAGE (voice)\n\t\tI'm at Jud's, daddy. Will you come\n\t\tover and play with me?\n\nLOUIS is dumbfounded...slack-mouthed with terror.\n\n\t\t\t\tLOUIS (a bare whisper)\n\t\tGage?\n\n\t\t\t\tGAGE (voice)\n\t\tMommy already came. We played, daddy.\n\t\tFirst I played with Jud and then mommy\n\t\tcame and I played with mommy. We had\n\t\tan awful good time. Now I want to play\n\t\twith you.\n\nGAGE begins to giggle...a really awful sound.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWhat did you do? What did you--\n\nCLICK! The GAGE-THING hangs up, still giggling.\n\n<b>INT.  THE CREED BED, CU\n</b>\nHe puts the doctor-bag down on the bed and roots through it. He \ncomes up with three syringes, still wrapped in paper, and puts \nthem aside. Then he roots around some more and comes up with \nseveral ampoules. He holds one up for inspection and we can read \nthe word MORPHINE on it very clearly.\n\n<b>INT.  THE BEDROOM, WITH LOUIS\n</b>\nHe carries the syringes and ampoules of morphine over to the \nwindow. His hair has gone partially white.\n\nHe fills all three syringes with morphine (using two ampoules for \neach syringe--i.e., enough to kill a polar bear) and puts them in \nthe left breast pocket of his shirt. He puts the spare ampoules in \nthe right breast pocket of his shirt.\n\nLOUIS is slowly going insane. What remains of his rationality is \nlike a rapidly fraying rope.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tWhat you buy is what you own, and\n\t\tsooner or later what you own comes\n\t\thome to you. Wasn't that what you\n\t\tsaid, Jud? Wasn't that pretty much it?\n\nHe leaves the room.\n\n<b>EXT.  THE FRONT DOOR OF THE CREED HOUSE\n</b>\nLOUIS comes out the door. In one hand he's got a raw pork chop. In \nthe other he is carrying a pair of Playtex rubber gloves. He walks \nto the soft shoulder and waits for an Orinco truck to pass. Then \nhe crosses.\n\n<b>EXT.  THE CRANDALL WALK, WITH LOUIS\n</b>\nHe walks most of the way to the house, then stops.\n\n<b>EXT.  CHURCH, LOUIS\"S POV\n</b>\nHe gets up, humping his back warily.\n\n<b>EXT.  LOUIS\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tHi, Church. Want some grub?\n\nHe tosses the pork chop onto the grass.\n\n<b>EXT.  CHURCH\n</b>\nHe hurries down the steps, goes to the chop, sniffs it, and starts \nto chow up. He looks up at:\n\n<b>EXT.  LOUIS\n</b>\nHe is pulling on the rubber gloves.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tDon't mind me. Eat it while you can.\n\t\tEat all you want.\n\n<b>EXT.  CHURCH\n</b>\nHe starts worrying the chop again. Smack-smack-smack.\n\n<b>EXT.  ANGLE ON LOUIS AND CHURCH\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tEat all you can...all you want...\n\t\tthat's right...today's Thanksgiving\n\t\tday for cats, but only if they came\n\t\tback from the dead...\n\nHe finishes with the gloves, gets one of the loaded syringes out \nof his breast pocket, holds it up, squirts a drop out of the tip, \nthen moves toward CHURCH.\n\nCHURCH looks up. LOUIS stops moving. CHURCH starts eating again, \nand LOUIS starts moving again as soon as he does. All the time he \ntalks to the cat in that soothing voice. He bends down...and grabs \nhim.\n\nCHURCH begins to squall and fight. LOUIS holds onto him. He tries \nto get the syringe into the cat and CHURCH almost gets away.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tNo, you don't!\n\n<b>EXT.  CHURCH, CU\n</b>\nThe syringe plunges into his haunch.\n\n<b>EXT.  CHURCH AND LOUIS\n</b>\nThe needle is still dangling out of CHURCH'S haunch. The cat looks \ndazed. It tries to walk and falls over on its side. It tries to \nget up...and then falls over again.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tGo on. Lie down. Play dead. Be dead.\n\nHe walks to the porch steps and picks up the tote-bag.\n\n<b>EXT.  THE TOTE-BAG, LOUIS'S POV\n</b>\nAny doubt he might have allowed himself the luxury of having is \nerased by the initials--R.C., same as the cola.\n\n<b>EXT.  LOUIS\n</b>\nTwang! One of the few remaining strands of sanity has now parted. \nHe looks back at:\n\n<b>INT.  CHURCH, ON THE PATH, LOUIS'S POV\n</b>\nDead.\n\n<b>EXT.  LOUIS\n</b>\nHe climbs the steps and goes onto the porch.\n\n<b>EXT. LOUIS, ON THE PORCH\n</b>\nHe strips off the rubber gloves. He tosses them onto the table \nbeside JUD'S beer-cans as he goes inside.\n\n<b>INT.  THE FOYER OF THE CRANDALL HOME, WITH LOUIS\n</b>\nIt's dark in here, and spooky.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tRachel? (Pause) Jud? (Longer pause)\n\t\tGage?\n\nNo answer. He looks down and sees:\n\n<b>INT.  A SHOE, LOUIS'S POV\n</b>\nOne of RACHEL'S shoes. It lies by the foot of the stairs.\n\n<b>INT.  LOUIS\n</b>\nHe goes over and picks up the shoe. It's a three-quarter heel, and \nit's pretty badly scuffed. RACHEL, after all, did some pretty hard \ntravelling to get here.\n\nThere's a spot of blood on it.\n\nSOUND: A low giggle.\n\nLOUIS looks up:\n\n<b>INT.  THE STAIRS, LOUIS'S POV\n</b>\nMighty dark. Mighty shadowy.\n\nSOUND: Another giggle.\n\n<b>INT.  LOUIS, AT THE FOOT OF THE STAIRS\n</b>\n<b>\t\t\t\tLOUIS\n</b>\t\tGage?\n\n<b>INT.  THE STAIRS\n</b>\n\t\t\t\tGAGE (voice)\n\t\tLet's play, daddy! Let's play hide\n\t\tand go seek!\n\n<b>INT.  LOUIS\n</b>\nHe takes one of the loaded syringes from his pocket.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tAll right, Gage...let's.\n\nHe begins to climb the stairs.\n\n<b>INT.  UPSTAIRS, WITH LOUIS\n</b>\nLOUIS arrives on the landing. We begin the nerve-wracking business \nof checking rooms. First, the bathroom...and the shower curtain is \nof course pulled. LOUIS yanks it back. Nothing.\n\nHe checks the linen closet. Nothing. Goes back to the hall. Looks \ndown it. He walks slowly along it. He checks one room. It's a \nguest room. Shadowy and empty.\n\nDown the hall. A closet door. A bag falls off the top shelf, and a \nbunch of ceramics inside it SHATTER LOUDLY. LOUIS flinches back.\n\nDown the hall. Now he's at JUD'S room. He goes in.\n\n<b>INT.  JUD'S ROOM, WITH LOUIS\n</b>\nHe checks the closet. No go. He steps around the bed and sees:\n\n<b>INT.  THE FLOOR, LOUIS'S POV\n</b>\nA bloodstain.\n\n<b>INT.  LOUIS\n</b>\nHe gets down on his hands and knees and examines the bloodstain. \nHe sees the skirt on the bedspread. He lifts it. He is nose to \nnose with JUD, who is dead with his eyes open, an expression of \nincredible horror on his face.\n\nThe DOOR SLAMS.\n\nLOUIS bolts to his feet as GIGGLES fade down the hall.\n\nSlowly, he kneels down and speaks to the skirt of the spread, \nwhich has mercifully fallen back into place.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI'm sorry, Jud. I'm so sorry. I'm--\n\nThere's a SQUEAKING, SQUEALING SOUND.\n\nLOUIS turns around. He gets up again. He starts for the door. Then \nhe turns back and speaks to JUD again.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tI'm going to set things back in\n\t\torder. I...I know just what to do.\n\nHe goes out.\n\n<b>INT.  THE HALLWAY, WITH LOUIS\n</b>\nHe takes one of the two remaining loaded syringes from his breast \npocket.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tGage?\n\nAnother SQUEAKING SOUND. And another GIGGLE.\n\nLOUIS starts slowly forward. He gets about halfway down the hall--\nand our nerves are tuned to the breaking point--when there is a \nSQUEALING CREAK and a GRATING THUMP from overhead.\n\n<b>INT.  CEILING TRAPDOOR\n</b>\nThis happens fast. The trap--which presumably gives on the attic \nwith a set of folding stairs--rises, and RACHEL'S body plunges \ndown through and then hangs, swinging: she has been bound around \nthe armpits and as become a grotesque parody of MISSY DANDRIDGE.\n\nHalf her face is gone. Eaten.\n\n<b>INT.  LOUIS\n</b>\nHe SCREAMS and backs against the wall. Twang! The last silver \nthread parts.\n\n<b>INT.  THE TRAPDOOR, WITH GAGE\n</b>\nHe leaps down, crashes on the floor, and then picks himself up. He \nis waving the scalpel.\n\n\t\t\t\tGAGE (screeching)\n\t\tAllee-allee-in-free! allee-allee-\n\t\tin-free! Allee-allee-in-free!\n\n<b>INT.  LOUIS AND GAGE\n</b>\nI won't choreograph all the moves, but GAGE slashes his stunned \nfather up pretty badly with the scalpel. He's screeching the whole \ntime. LOUIS finally begins to react. He grapples with the little \ncritter, and tries to get the syringe into him. No good. It's \nbatted out of his hand just before he can do it. It breaks.\n\nLOUIS and GAGE fall to the floor. LOUIS gets the other syringe out \nof his pocket, but it's also knocked out of his hand. Only \nconsolation is this one isn't broken. It rolls off along the \nfloor. LOUIS finally manages to get it again as the struggle goes \non, and plunges it into GAGE'S neck.\n\n<b>\t\t\t\tGAGE\n</b>\t\tNo fair! NO FAIR!\n\nHe gets to his feet, clawing for the needle lolling out of his \nneck. He's lost all interest in his father. He goes staggering \naway. He's slowing down. He goes to his knees...and falls on his \nface.\n\nLOUIS watches this... and then his vacant, half-catatonic gaze \ngoes to:\n\n<b>INT.  RACHEL, LOUIS'S POV\n</b>\nShe swings slowly back and forth.\n\n<b>EXT.  THE BACK YARD OF THE CRANDALL HOUSE\n</b>\nTime has passed. It's late afternoon. LOUIS comes out with a \nsheet-wrapped form in his arms. RACHEL, of course.\n\nHe sets the body down and goes back inside.\n\n<b>INT.  THE KITCHEN, WITH LOUIS\n</b>\nHe's splashing around a can of coal-oil. When he's got the room \nwetted down to his satisfaction, he goes to the door, lights a \nmatch, and tosses it.\n\nFlame runs across the floor. The fire is slow at first, but then \nit begins to gain rapidly.\n\nLOUIS goes out.\n\n<b>EXT.  THE BACK LAWN, WITH LOUIS\n</b>\nHe picks up the sheet-wrapped form of his wife and walks around \nthe side of the house as flames shoot through the kitchen windows.\n\n<b>EXT.  THE FRONT OF THE CRANDALL HOUSE, FROM ACROSS THE ROAD\n</b>\nLOUIS appears with his shrouded burden and approaches the road.\n\n<b>---\n</b><b>PAGE 134 MISSING FROM HARD COPY\n</b><b>---\n</b>\n<b>EXT.  THE SMOULDERING RUINS OF THE CRANDALL HOUSE  NIGHT\n</b>\nCAMERA HOLDS FOR A MOMENT, then rises and looks toward the CREED \nhouse. There's one light on--in the kitchen.\n\nTOLLING CONTINUES: Three...four...five...\n\n<b>INT.  THE KITCHEN TABLE, WITH LOUIS\n</b>\nLOUIS is filthy, covered with dried blood. He is playing at \nPatience. He holds a handful of cards.\n\nTOLLING CONTINUES: Six...seven...\n\nSOUND: The back door opens.\n\nSOUND: Crickets from outside. Ree-ree-ree...\n\nSOUND: Gritting footsteps.\n\nLOUIS looks up. He doesn't look behind, at what's coming. He looks \nstraight ahead.\n\n<b>\t\t\t\tLOUIS\n</b>\t\tAnd what you own always comes home\n\t\tto you.\n\nHe flips up one card.\n\nTOLLING CONTINUES: Eight...\n\n<b>INT.  THE CARD\n</b>\nIt's the Bitch, the Queen of Spades, she who supposedly poisoned \nthe laddies in the Tower.\n\nLOUIS'S hand falls upon it.\n\nTOLLING CONTINUES: Nine...ten...\n\n<b>INT.  LOUIS, CU\n</b>\nA hand clotted with grave-dirt falls on his shoulder. A woman's \nhand.\n\nTOLLING CONCLUDES: Eleven...twelve...\n\n\t\t\t\tRACHEL (voice)\n\t\tDarling.\n\n<b>FADE OUT ON THE SOUND OF CRICKETS.\n</b>\n\n</pre>\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Pet Sematary</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Stephen King\" title=\"Scripts by Stephen King\">Stephen King</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Pet Sematary Script.html#comments\" title=\"Pet Sematary comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:13:21.160645"}