{"title": "Petulia", "film_link": "/Movie Scripts/Petulia Script.html", "script_link": "/scripts/Petulia.html", "info_raw": "\n\nPetulia Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Larry Marcus\nGenres  Drama\nScript Date : March 1967\nMovie Release Date : June 1968\n\nRead \"Petulia\" Script\n\n\n", "script": "\n\n\n\n \n                                PETULIA\n\n\n                               Written by\n\n                              Larry Marcus\n\n\n\n\n\n \n                                                   March 30, 1967\n\n          \n\n\n\n          1 ALLEY LOADING PLATFORM AND CORRIDOR OF FAIRMONT HOTEL\n\n          NIGHT\n          The story begins in this grubby alley, where two extra\n          large ambulances screech to a stop beside a loading\n          platform. Onlookers gather in the alley entrance to\n          see how many people died; nobody died, the backdoors\n          of the ambulances are opened by attendants, and six\n          perfectly fine victims of perfectly terrible automobile\n          accidents are lifted into wheelchairs.\n          The cripples are beautifully dressed, the men in tuxedos,\n          the women in splendid evening dresses. One of the women\n          wears a neck brace which forces her always to look\n          skyward, so she cantt see the beautiful orchid corsage\n          pinned to her bosom.\n          Quickly, attendants roll the wheelchairs past all the\n          stacks of fruit and vegetables on the loading platform,\n          past great bales of laundry, past whatever horrors one\n          finds behind the warm, smiling face of a hotel. Watch-\n          men, pastry cooks, valets are watching the rush of the\n          wheelchairs without much interest.\n          Then doors swing open, and we are in the tram It of the\n          grand ballroom.\n\n          2 INTO GRAND BALLROOM\n          It is a charity ball. The sign says \"Shake for Highway\n          Safety.\"' The wheelchairs and their occupants no longer\n          interest us. They are the guests of honor, and people\n          gather about them to arrange them appealingly, and we\n          rush past the go-go band, the shakers, and the door\n          prize, which is a little convertible, spinning endlessly\n          on a pedestal.\n          CAMERA reaches PETULIA, who is dancing with her husband,\n          DAVID, but trying not to lose sight of ARCHIE. ARCHIE\n          really wants to leave, but he is too polite to make it\n          too obvious. As he bends over to put his punch cup on\n          a table, he is bumped by the wheelchair of one of the\n          guests of honor. He is not at all comfortable.\n\n          0\n\n          \n\n          \n\n          \n\n          \n\n          2 CONTINUED\n\n          E\n          It's not easy for Petulia to keep an eye on Archie;\n          gasping faces get in the ways hunks of twisting bodies\n          get in the way, and the dance won't end. The music\n          stops for a second, everyone sags and thinks, \"Thank\n          God it's over,\" but instantly the music begins again\n          and everyone good naturedly swears, \"Those crazy kids\n          are trying to kill us,\" and meanwhile Petulia sees\n          that Archie has reached the place where you get your\n          coat.\n\n          MED. ARCHIE\n          He is searching through his pockets for the ticket\n          that will let him reclaim his coat. All the coats\n          are in an incredible piles and in the semi-hysterical\n          care of a debutante attendant.\n\n          PETULIA' S VOICE\n          You can't leave\n          He turns and sees Petulia.\n\n          PETULIA\n          You're an official host.\n          She nods to the ribbon and cardboard which along with\n          'Official Host' says Dr. A. Bollen. Archie takes the\n          ribbon off, as though to pin it on Petulia.\n\n          PETULIA\n          Careful. Can you tell I'm not wearing\n          a brassiere?\n\n          ARCHIE\n          No.\n\n          PETULIA\n          Don't think about it. It will only\n          excite you.\n          Archie finally finds the ticket for his coat, which the\n          attendant now tries to find. On through this Petulia\n          continues.\n\n          L`\n\n          \n\n          \n\n          \n\n          \n\n          3\n\n          2 CONTINUED\n\n          PETULIA\n          That's my husband over there,\n\n          ARCHIE\n          Ahh ...\n\n          PETULIA\n          I've been married six months and I've\n          never had an affair,\n\n          ARCHIE\n          It can happen\n\n          PETULIA\n          Don't take it so bloody well. I've just\n          turned you down. He's looking at us.\n          My husband,\n\n          MED. DAVID WITH HIS MOTHER AND FATHER\n          somewhere near the free whiskey table asking for Pernod,\n          which, of course, they don't have.\n          The father is watching the charity affair with utter\n          disapproval. He tips a waiter by shoving a half-dozen\n          raffle tickets into the waiter's jacket pocket,\n\n          MR, DANNER\n          I hope you win the car, sir,\n          Mrs. Danner is charmed by her husband's generosity.\n          She simply adores the man. David is busy not watching\n          Archie and Petulia,\n\n          PETULIA'S VOICE\n          Isn't he gorgeous? He's a naval architect.\n          It really zings when you say it. \"My\n          husband David is a naval architect.\"\n          Actually, we're starving. You wouldn't\n          want to buy a sixty foot sloop? David's\n          \"Momma\"` and \"Poppa' keep us. Look how\n          disgusted Poppa is. He hates this sort\n          of thing.\n\n          0\n\n          \n\n          \n\n          \n\n          \n\n          L\n\n          2 CONTINUED\n\n          ARCHIEIS VOICE\n          Poppa is too sensitive.\n\n          PETULIA'S VOICE\n          Sensitive, my ass. He's bored. Highway\n          safety's so blah. Also, he hates amateurs.\n          Give him something he can sink his teeth\n          into - \"Rheumatoid Arthritis\" Â® \"Muscular\n          Dystrophy\"' -m and he's the best there is.\n          A real pro. A little lame girl with a\n          ribbon in her hair and a crutch under her\n          arm, and Poppa can set the world on fire.\n          He's really slumming tonight.\n\n          BARNEY'S VOICE\n          Hello, Archie.\n\n          MED. PETULIA AND ARCHIE\n          have been joined by BARNEY and WILMA, Archie's best\n          friends. Barney and Wilma are taking off their coats.\n          Barney is already beginning to move to the music.\n          0 Wilma is doing absolutely nothing but looking at\n          Petulia.\n\n          WILMA\n          Everybody came late.\n\n          ARCHIE\n          I came early. G'bye Wilma. G'bye\n          Barney.\n\n          DEBUTANTE ATTENDANT\n          Could you describe the coat?\n\n          ARCHIE\n          A. coat. A raincoat. Sleeves.\n          Barney has begun to snap his fingers and move his shoulders,\n          becoming part of \"The Scene\", about which Wilma couldn't\n          care less.\n\n          WILMA\n          You can't go, Archie. I'd be very\n\n          DISAPPOINTED\n\n          0\n\n          \n\n          \n\n          \n\n          \n\n          2 CONTINUED\n\n          E\n          Archie accepts this silently,\n\n          WI LMA\n          Alright, then. I won't tell you who\n          I bumped into last week\n\n          ARCHIE\n          buying a well larded rib roast.\n\n          WILMA\n          Smarty. Have you seen what she's done\n          to her hair?\n\n          ARCHIE\n          Wild, huh?\n\n          WILMA\n          I said, \"Polo, for heaven's sake, you\n          look like a teenager.\"\n          Archie doesn't seem too interested and, besides, all\n          this is said while Wilma continues to look at Petulia.\n\n          Â\u0080¢\n\n          WILMA\n          Your Mike's getting so fat. Is that\n          much weight good for a boy his age?\n\n          ARCHIE\n\n          (SHRUGGING)\n          If it's alright for a rib roast\n\n          WILMA\n          Smarty.\n          Barney suddenly forgets the music to rescue his Vicuna\n          coat which the debutante is smothering under other\n          coats as she finally finds Archie's.\n\n          W ILMA\n          (to Petulia)\n          I don't believe we've met.\n\n          PETULIA\n          Screw you, Wilma.\n\n          ARCHIE\n          Now you've met.\n\n          \n\n          \n\n          \n\n          \n\n          B\n\n          2 CONTINUED\n          Wilma moves off with Barney. Archie can't spend one\n          more second with his coat. He simply puts it on, and\n          turns to leave, walking toward the door.\n\n          PETULIA\n          My name is Petulia,\n\n          ARCHIE\n          Itm not surprised,\n\n          PETULIA\n          Polo's your wife,\n\n          ARCHIE\n          Ex-wife, G' night.\n          Petulia turns to face her husband David, who has taken a few\n          steps toward her. She whirls around to face the departing\n          Archie.\n\n          PETULIA\n          Archie!\n          He turns, almost at the door.\n\n          PETULIA\n          Say something warm.\n\n          0\n\n          ARCHIE\n          Like what?\n\n          PETULIA\n          I mean it\n          There is something goofily desperate in her voice that\n          stops him. He looks at her for awhile.\n\n          ARCHIE\n          Your hair, It gleams.\n\n          PETULIA\n\n          (DISAPPOINTED)\n          Oh, Archie...\n\n          ARCHIE\n          Left arm or right? How do you brush it?\n\n          PETULIA\n          Left.\n\n          ARCHIE\n          An hour a day.\n\n          0 PETULIA\n          At least.\n\n          \n\n          \n\n          \n\n          \n\n          0\n\n          2 CONTINUED\n\n          ARCHIE\n          You' 11 have a problem. The bursa sheath.\n          Very sensitive, Bursitis. It'll hurt.\n\n          PETULIA\n          I'll come to you.\n\n          ARCHIE\n          I wouldn't be able to help much. Just aspirin.\n\n          PETULIA\n          And sympathy?\n\n          ARCHIE\n          Sure.\n\n          _. PETULIA\n          Thank you, Archie. Damn it, how can I have an\n          affair with an unmarried man. There has to be\n          some equality of guilt.\n\n          ARCHIE\n          My divorce doesn't become final till next\n\n          Â\u0080¢\n          month.\n\n          PETULIA\n          I'll get my purse.\n          But in turning to do so she sees David, then the\n          spinning car, the door prize.\n\n          PETULIA\n\n          ARCHIE\n          What?\n\n          PETULIA\n          I've been told that I'll be the one to draw\n          the winning ticket. I'm always picked for\n          things like that. I radiate incorruptibility.\n          Money can't buy me.\n          She shakes her head, thoughtfully. During all this the door-\n          man has been busily opening and closing the door for them as\n          they keep changing their mind.\n\n          PETULIA\n          It feels so super. Suddenly, all that love.\n\n          \n\n          \n\n          \n\n          \n\n          8\n\n          3 EXT. BUS TERMINAL\n\n          All we see is the wheel of a car resting on the back\n          of a small boy, pinning him to the ground and people\n          shocked, not knowing what to do.\n\n          ARCHIE'S VOICE\n          Well, stay then.\n\n          L PETULIA'S IMAGE ENDS AND WE ARE BACK IN THE GRAND BALLROOM\n\n          PETULIA\n          Archie, why do you play this dumb game?\n          This crappy pretense at resisting the\n          beautiful lady? You're bloody lucky I'm\n          even talking to you. How many kids do\n          you have besides fat Mike?\n\n          ARCHIE\n          Six.\n\n          PETULIA\n          G'night.\n\n          ARCHIE\n          Actually, only one besides Mike.\n\n          PETULIA\n          Meet you outside.\n\n          5 EXT. DREAM MOTEL NIGHT\n\n          A motel sign: \"Dream Motel.\"' A concrete oval, spiral-\n          ling up four floors. You drive to your room and everything\n          is geared to get you to bed electronically. But you must\n          have a car, and Petulia and Archie have come by cab.\n          Archie is paying the cabbie.\n\n          PETULIA\n          (to cabbie)\n          You mustn't take it personal.\n          (she indicates the \"No Cabs\" sign)\n          Lucky we don't have luggage.\n\n          ARCHIE\n          Does this trouble you?\n\n          PETULIA\n          A little.\n\n          ARCHIE\n          I suggested my place.\n\n          PETULIA\n\n          0\n          I'd always imagined a tourist cabin, with\n          paper thin walls, the sounds of a man from\n          Tennessee in the cabin next door, sobbing\n          endlessly, \"M4ude, Maude, Maude 8 8\"'\n\n          \n\n          \n\n          \n\n          \n\n          91\n\n          CONTINUED\n          Archie sees a car moving through the processes of\n          E registration. Grabbing Petulia's hand, he starts to\n          what is presumably the entrance -- at least it is the\n          bottom of the ramp. They arrive at the booth and\n          Archie steps on the. place marked 'Stand Here.' A\n          T.V. screen lights up.\n\n          MAN ON TV\n          Evenin'. Where's your auto?\n          Archie nods for Petulia to see the T.V. camera which\n          is scanning them.\n\n          PETU LIA\n          Lost in a hailstorm this side of Pocatello,\n          Idaho. Those hailstones really came down,\n          didn't they, Zeke?\n\n          MAN ON TV\n          No auto?\n\n          ARCHIE\n          No auto.\n\n          MAN ON TV\n          It's a problem.\n\n          0\n\n          ARCHIE\n          Only if we make it one.\n\n          PETULIA\n          Do you have any slides or swings for children?\n\n          MAN ON TV\n          No, ma'am. You got kids?\n\n          PETULIA\n          No, no. I was told to be suspicious of\n          motels which cater to the family trade.\n\n          MAN ON TV\n          This isn't that sort of place. No auto.\n\n          WELL\n          There is a small sound and a gadget reaches out which\n          normally would fasten to the side of the car. On it is\n          an electronic register, an electronic pen and a key with\n          a great metal tag (as an example of how this might be\n          designed, I recommend visiting a drive-in bank in Los\n          Angeles). As Archie registers, and puts the ten dollar\n          bill where it belongs, Petulia looks at the T.V. set.\n\n          E\n\n          \n\n          \n\n          \n\n          \n\n          10\n\n          S\n          s Continued\n\n          PETULIA\n          You've got a very nice T,V, face.\n\n          MAN ON TV\n          Thank you, ma' amp,\n\n          PETULIA\n          You have to use pancake make-up, things\n          like that?\n\n          MAN ON TV\n          (a slight giggle)\n          No, just be natural.\n          Archie has finished registering and takes the keys.\n\n          MAN ON TV\n          We've got an elevator but its just for going\n          out for the paper and the like. I mean when\n          you don't want to take the car. You'll have\n          to use the ramp because of the key. It lets\n          you know when you get to your room.\n\n          INT. RAMP\n\n          Archie and Petulia start up ramp.\n          It's a long dark run and they are soon winded,\n\n          ARCHIE\n\n          (GASPING)\n\n          CHARMING\n\n          PETULIA\n\n          (GASPING)\n          It shouldn't be charming. You're missing\n          the whole point. It should be menacing .,,\n          Another couple in a proper car, rushes by. There is\n          a blaze of headlights, and a rush of sound.\n\n          PETULIA\n          ,..gray . terribly distraught\n           headlights of passing cars lighting up our\n          room .,.\n          Archie tugs at her, and gasps.\n\n          0\n\n          \n\n          \n\n          \n\n          \n\n          11\n\n          6 CONTINUED\n\n          PETULIA\n\n          (CONTINUING)\n          ... a police car careening down the highway,\n          sirens going full blast. And I plunge\n          madly into your arms\n          But she is now totally winded and cannot say another\n          word. Archie reacts to a sudden phenomena: a tiny\n          light on the key in his hand starts flicking on and off\n          furiously. Just ahead of him is the door of their motel\n          room. Archie is aghast at the pulsating key.\n\n          ARCHIE\n\n          (PLAINTIVELY)\n          My apartment's only four blocks from\n\n          HERE\n\n          7 INT. DREAM MOTEL ROOM\n\n          Stark is hardly the word but it will have to do. A\n          control panel takes care of the drapes, T.V., stereo,\n          announcements from the office, etc., etc., etc. There\n          are mirrors everywhere and the first thing Petulia\n          does is establish contact between the vanity mirror,\n          the mirror on the bathroom door and the medicine cabinet\n          mirror so that she is reflected endlessly.\n\n          PETULIA\n          You have 624 women in this room and\n          I'm still counting.\n          Archie moves behind her and begins unbuttoning the top\n          buttons on the back of her dress.\n\n          PETULIA\n\n          (HARSHLY)\n          Just wait a minute, okay?\n          Archie plops on the bed in his coat, a most iropic smile\n          on his face -- he is beginning to suspect he is not\n          going to get laid. Petulia is examining all the Petulia\n          faces in the mirrors.\n\n          PETULIA\n          My great-grandmother is ninety-one and\n          still has a granite chin.\n          Archie pushes a gadget beside the bed and it begins to\n          vibrate. Petulia sees endless Archies vibrating on\n          endless beds.\n\n          \n\n          \n\n          \n\n          \n\n          12\n\n          7 CONTINUED\n\n          PETULIA\n          What a lecherous lot\n\n          ARCHIE\n          She's ninety-ones eh?\n\n          PETULIA\n          But no fun.\n\n          ARCHIE\n          Not at ninety-one, hell\n\n          PETULIA\n          She stopped having fun at twenty-eight when her\n          husband was killed in the first war, in a\n          trench looking just like Cary Grant with a\n          waxed moustache. She can't remember him but\n          she does remember Cary Grant because he is\n          from Bristol, too, and often in the news. If\n          his picture is in the paper he gets a waxed\n          moustache whether he likes it or not.\n          She turns to face Archie. She is afraid and she is\n          angry and she doesn-t know quite what to do from one\n          moment to the next. But she knows he shouldn't be in an\n          overcoat jiggling on a jiggling bed,\n\n          Â\u0080¢\n\n          PETULIA\n          Stop being so damn casual.\n          Archie sits up but is still casual,\n\n          PETULIA\n          We're about ï¿½td become lovers, Did you bring\n          an instrument, Archie?\n\n          ARCHIE\n          Eh?\n\n          PETULIA\n          Ring for room service. Ask the robot for\n          something splendid and musical,,\n\n          ARCHIE\n          Saxophone? Electric Organ? Tuba?\n\n          PETULIA\n          A tuba. Absolutely; Bless you, Ar--hie; A\n          tuba; Something large and twirly and pom\n           to pom .pomX Archie, this is an event. We\n          0 are about to become lovers.\n\n          \n\n          \n\n          \n\n          \n\n          7 CONTINUED\n\n          ARCHIE\n          You said that.\n\n          PETULIA\n          It can't be said often enough.\n\n          ARCHIE\n          Are we?\n\n          PETULIA\n          Are we what?\n\n          ARCHIE\n          About to become lovers?\n\n          PETULIA\n          No.\n\n          ARCHIE\n          Ah, you swinging young marrieds.\n          He leaves.\n\n          8 EXT. ROOM\n\n\n          0\n          Across from the ramp there is the elevator the man on\n          T.V. mentioned. Archie is already there waiting for it\n          to arrive. Petulia starts toward him angrily.\n\n          PETULIA\n          Where do you have to rush? If we were making\n          love you would be exploring my navel about now.\n          Time would be the last thing on your mind.\n          An old man in a bathrobe, sadly out of contrast with\n          the electronic motel, looks up from the open trunk of\n          his car. The elevator doors open. Petulia and Archie\n          enter,\n\n          9 INT. ELEVATOR\n\n          The elevator doors shut and inside the elevator a\n          loud speaker begins playing a medley of San Francisco\n          songs.\n\n          PETULIA\n          You. look like a gargoyle. Poor, dumb Archie.\n          I'm all mixed up sexually. Old Mum's a\n          prostitute. The oldest professional lady in\n          0 all Bristol. Mavis, too, my sister. But\n          I mean she's not a landmark yet.\n\n          \n\n          \n\n          \n\n          \n\n          9 CONTINUED\n          During this Archie notices that the back of Petulia's\n          dress remains unbuttoned. He moves behind her and\n          begins rebuttoning her. At the touch of his hand,\n          something happens to Petulia.\n\n          10 INT. FIRST AID ROOM\n\n          Archie's hands are holding a little boy under the bright\n          lights of a first aid table. The boy is a bloody mess but\n          Archie's hands are soothing him even as they so gently\n          prod, examining his injuries. Nurses are cutting the boy's\n          bloody jeans off him, an expensive watch falls to the\n          floor, they retrieve it.\n\n          11 INT. ELEVATOR\n\n          Petulia's head presses against Archie's hand. She\n          kisses it, she rubs her cheek against it.\n          The elevator has come to a stop and the doors have opened.\n          Archie sees Petulia's tears on his hand.\n\n          ARCHIE\n          Real honest-to-God tears, Petulia?\n\n          PETULIA\n          Tears, Archie.\n\n          0\n\n          ARCHIE\n          Petulia, you're a kook.\n          He exits the elevator and whistles at a cruising cab.\n\n          12 EXT. DREAM MOTEL\n\n          Archie crosses to the cab and opens the door. He hustles\n          Petulia inside the cab.\n\n          ARCHIE\n          If he gets you there in time, you can still\n          pick the winning ticket and make somebody happy.\n\n          PETULIA\n          (very quietly)\n          Archie, I'm going to marry you.\n          The cab pulls away and Archie sees Petulia looking at him\n          through the rear window. Archie allows himself the\n          drollest of smiles.\n\n          ARCHIE\n          It's the Pepsi generation\n          0 He walks into the night alone.\n\n          \n\n          \n\n          \n\n          \n\n          15\n          E 12 Continued\n          A jalopy full of dizzy dames with \"LOVE\" painted in\n          huge awkward letters on its side almost runs him\n          down. Archie continues in the night.\n          Now, we can see the Golden Gate Bridge.\n\n          13 EXT. DANNER HOUSE DAWN\n\n          The house is on the edge of the sea and a cliff rises\n          behind it. Petulia is going up the open lift which\n          climbs the cliff. It is a very different Petulia.\n          She hurts.\n\n          INT. ARCHIE'S BEDROOM MORNING\n\n          Archie is sleeping. There is the SOUND of a bell\n          ringing. After awhile Archie's hand reaches out for\n          the phone.\n\n          ARCHIE\n          (into phone)\n          I'm up, thanks.\n          Then his dizzy brain realizes the ringing is continuing\n          and is constant. He sees the alarm clock, 6:1 He\n          stumbles and staggers to the front door.\n\n          ARCHIE\n          Yeah... yeah 000 yeah 000\n          He opens the door to come face to face with the large\n          and twirly front end of a tuba. The tuba is stark\n          white for no particular reason.\n\n          14A EXT. ARCHIE'S APARTMENT\n\n          We see some of the hall, a yawning milkman, etc., but\n          mostly Petulia and the tuba.\n\n          14B INT. ARCHIE'S APARTMENT\n\n          Dazedly,.Archie steps back to make room for Petulia\n          and the tuba.\n\n          ARC HIE\n          I'll make some coffee.\n          Petulia blows with all her strength, emitting a sad\n          little peep, then collapses to the floor, tuba and all.\n\n          \n\n          \n\n          \n\n          \n\n          16\n          14B Continued\n\n          PETULIA\n          Aren't I a kook? If you think you're\n\n          SURPRISED\n\n          ARCHIE\n          (at the same time)\n          No, I've been up for hours, waiting for\n          the doorbell to ring,\n\n          PETULIA\n          , 0 think how surprised the-man who owns\n           the pawnshop is going to be when he sees\n          all that broken glass.\n\n          14C EXT. PAWN SHOP\n\n          A brick smashes the glass, scattering cameras, mandolins,\n          etc. in the midst of which is the white tuba.\n\n          PETULIA'S VOICE\n          Archie, how come the burglar alarm didn't\n          go off?\n\n           14D INT. ARCHIE'S APT.\n\n          0 The scene continues.\n\n          PETULIA\n          Wherets it all going to end if the\n          burglar alarms won't go off? Take me\n          to bed, Archie,\n\n          ARCHIE\n          Get the hell out of here . please.\n          He reaches to help Petulia to her feet but as he touches\n          her waist to lift her, she screams and faints,\n\n          15 INT. HALLWAY OF DANNER HOUSE NIGHT\n\n          But we don't know it's the Danner house. All we see is\n          Petulia crumpling as she is struck. She hits the floor\n          and just lies there, not making a sound.\n          (Also SHOOT in slow motion.)\n\n          16 INT. ARCHIE' S APARTMENT\n\n          Archie breaks an ammonia ampule under Petulia's nose.\n          Her head wrenches away and she opens her eyes. Archie\n          has begun to prod her side; she is in pain.\n\n          \n\n          \n\n          \n\n          \n\n          17\n\n          16 CONTINUED\n\n          PETULIA\n          I've got a broken rib, I think, I can\n          feel it broken, Archie.\n\n          ARCHIE\n          Don't you know you can puncture a lunge\n\n          PETULIA\n          Hopping around with tubas and stuff --\n          isntt it kooky, though?\n          Archie has begun to remove her dress.\n\n          PETULIA\n          When are we going to stop trying to\n          undress me?\n\n          ARCHIE\n          Shut up.\n\n          PETULIA\n          Leave me alone, Archie.\n          Archie sees she really means it,\n\n          ARCHIE\n\n          0\n          It's just a rib to me,\n\n          PETULIA\n          That's why. Call a proper doctor,\n\n          ARCHIE\n          What do you think I am?\n\n          PETULIA\n          A hairy legged old lecher running around\n          in pajama bottoms,\n\n          ARCHIE\n          Get your clothes off,\n\n          PETULIA\n          As a woman, not as a rib.\n          Archie is harassed. The phone begins ringing. He grabs\n          it angrily.\n\n          ARCHIE\n          (into phone)\n          I'm awake! I'm awake; How many times\n          are you gonna call?I\n          He hangs up, then realizes this was the first wake up call.\n\n          \n\n          \n\n          \n\n          \n\n          18\n\n          16 CONTINUED\n\n          E ARCHIE\n          (to Petulia)\n          You know what a- you'll drive me cuckoo.\n          He sighs. and begins dialing a number. Petulia is in real\n          pain. Like a,little child she crawls under the covers of\n          his bed, pulling the quilt up around her as though Archie's\n          left over warmth will make the pain go away.\n\n          ARCHIE\n          (into phone)\n          Barney? Archie. Fine fine , , fine ,\n          I want you to look at a patient for me.\n          Now. At my place. My apartment, Barney,\n          it's very complicated and I haven't had\n          my morning coffee yet. Her name is Petulia.\n          I don't know her last name, Barney. Yes,\n          Petulia. Barney, shut up. I have to get\n          to the hospital.\n\n          16A BARNEY'S BEDROOM MORNING\n          During the above we catch a glimpse of sleepy Barney\n          sleepily asking stupid questions.\n\n          16B INT. ARCHIE'S APARTMENT\n\n          Archie hangs up, goes to a medicine case which he had\n          hastily opened for the ammonia ampule and now he takes out\n          a couple of pills, which he gives to Petulia,. She takes\n          them obediently,\n\n          PETULIA\n          You've got a super build for a man your age.\n          Archie says nothing. He crosses to the bathroom and\n          hastily begins dressing.\n\n          PETULIA\n          Where are all the family pictures?\n          Archie is busy brushing his teeth,\n\n          PETULIA\n\n          (LOUDLY)\n          The family pictures!\n          He looks out from the bathroom blankly,\n\n          PETULIA\n          Polo and the boys.\n\n          Â\u0080¢\n          Archie goes back to brushing his teeth electrically, with\n          salt.\n\n          \n\n          \n\n          \n\n          \n\n          19\n          16B Continued\n\n          â\u0080¢ PETULIA\n          I'll bet you named her Polo. Don't ever\n          start mucking about with \"Petulia\".\n          Archie exits from the bathroom, all the time continuing\n          to dress,\n\n          PETULIA\n          WhatÂ°s her real name?\n\n          ARCHIE\n          Prudence.\n\n          PETULIA\n          And you named her Polo. That's kind\n          of sickening, Archie.\n          Archie stops his dressing long enough to gaze at this girl\n          in his bed, beyond which is an overturned tuba. Archie\n          sighs somewhat philosophically, not nearly as amused as\n          you'd think.\n\n          17 INT. HOSPITAL\n\n          We are in the examining room of the orthopedic ward.\n          Archie is working on Oliver, the little Mexican boy of\n\n          Â\u0080¢\n          seven whom we have seen earlier as a bloody mess in the\n          flashback. Now, Oliver is healing nicely, but it's still\n          not pleasant to be examined. A woman hovers in the back-\n          ground. A nurse assists Archie. Oliver is a brave, solemn\n          little boy, with shadows of fatigue around his eyes. He\n          is also a tough little bastard, let me tell you. He is\n          now wearing the broken gold watch; though to fit his\n          skinny wrist the band has been tied in a knot,\n\n          ARCHIE\n          I want him here every day. For therapy.\n\n          WOMAN\n          Si, Yes, doctor. I do,\n          Oliver speaks only a few words of English, mostly the\n          necessary scatological and sexual phrases that would be\n          necessary in his line of business.\n\n          ARCHIE\n          Every day. Tell him that.\n          The woman says it to Oliver in Spanish. Oliver says\n          something obviously obscene.\n\n          \n\n          \n\n          \n\n          \n\n          20\n\n          17 CONTINUED\n\n          ARCHIE\n          What'd he say?\n\n          WOMAN\n\n          (EMBARRASSED)\n          He say yes.\n\n          ARCHIE\n          (dubiously, to woman)\n          You sure?\n          (to Oliver)\n          Otherwise we keep you in the hospital.\n          You're not well, just better.\n          (to woman)\n          Say that.\n          The woman tells Oliver in Spanish as Archie continues\n          examining the leg.\n\n          ARCHIE\n          Sorry, pal.\n          Oliver says something in Spanish.\n\n          WOMAN:\n          (smiling a bit)\n\n          Â\u0080¢\n          Where he learn such words shame on you.\n          (then in Spanish)\n          Shame.\n          Archie realizes Oliver is in great pain and close to tears.\n          He stops the examination and rubs his hand gently through\n          the kid's hair,\n\n          ARCHIE\n          Every day. Same time. Two o'clock,\n          right on the dot.\n          (he hits watch on wrist.\n          The last bit of glass falls\n          out.)\n          Sorry , ,\n          Oliver swears in Spanish and the woman clacks her tongue.\n\n          WOMAN\n\n          (EMBARRASSED)\n          He terrible.\n\n          ARCHIE\n\n          (CHUCKLING)\n          I like the way he heals.\n\n          0\n\n          \n\n          \n\n          \n\n          \n\n          21\n\n          17 CONTINUED\n          Archie smiles and leaves. The nurse is left with Oliver\n          who avoids her touch,\n\n          NURSE\n          Cut that out, you little spit,\n\n          18 TNT. CORRIDOR\n          Archie stops to hear what the woman has to say.\n\n          WOMAN\n          About the bill, Doctor.\n          Barney is passing by.\n\n          ARCHIE\n          Is she okay?\n\n          BARNEY\n\n          (DARKLY)\n          Lunch.\n          Archie looks up at the woman.\n\n          â\u0080¢ ARCHIE\n          His leg will be fine. Don't worry too\n          much about the bill. Just enough to pay it.\n\n          WOMAN\n          I have money to pay it,\n          A pipe smoking public relations man leads a casually\n          dressed group past Archie and the woman.\n\n          PUBLIC RELATIONS MAN\n          Yea, we had ABC filming a documentary\n          here last week\n\n          19 INT. THE ROARING 20'S CAFE DAY\n\n          All through the scene Barney and Archie will be served by\n          topless waitresses while other topless waitresses slide\n          down a big brass pole in the centre of the room. As the\n          scene begins Barney is alone, morosely munching a corned\n          beef sandwich. Now Archie appears, threading his way\n          through topless fashion show. A topless ANNOUNCER is\n          doing the fashion commentary into a chrome microphone,\n          as the topless models majestically move about.\n\n          Â\u0080¢\n\n          \n\n          \n\n          \n\n          \n\n          22\n\n          0 19 CONTINUED\n\n          ANNOUNCER\n          (no fashion cliche untouched)\n          Springtime in Paree. Our elegante dinner\n          pajamas. In airy aquamarine chiffon and\n          Mediterranean blue peau de soie.\n          Delightfully carefree, yet formal enough\n          for an ambassadorial reception at the\n          Palace of Versailles.\n\n          BARNEY\n          \"Screw you, Wilma.\" Why didn't you tell\n          me?\n\n          ARCHIE\n          How is she?\n\n          BARNEY\n          You tell me.\n\n          ARCHIE\n          Oh, great, terrific, you wouldn't\n          believe it. Terrific. And her rib?\n\n          BARNEY\n          I taped it. Gave her some seconal.\n          â\u0080¢ Should have a vertical just to be safe.\n          A waitress hovers\n\n          ARCHIE\n          Why do we have to eat topless?\n\n          BARNEY\n          The best Irish stew in town.\n          He is eating a corned beef sandwich. Archie is ordering\n          the same.\n\n          BARNEY\n          She said you beat her up. Kidding,\n          of course.\n          Archie bites into his sandwich with small enthusiasm.\n          Breasts with their pasties always intrude.\n\n          BARNEY\n          You must have been a little rough on her,\n          daddy.\n\n          E\n\n          \n\n          \n\n          \n\n          \n\n          23\n\n          19 CONTINUED\n          The second model, a beautiful topless Negress, is now\n          wandering past the tables. The announcer goes on and on.\n\n          ANNOUNCER\n          Opening Night at the Opera. Though the\n          curtain has risen on the first act of\n          Aida, all eyes are on the Royal Box,\n          Mi Lady in dazzling velvet: Cardinal\n          Richelieu Rouge. The utter simplicity\n          of her full-length gown is subtly accented\n          by the merest suggestion of gay abandon.\n          Archie eats his sandwich. An off-duty topless waitress\n          sits in the corner having lunch, holding a napkin over\n          her bosom with one hand, while eating with the other.\n\n          BARNEY\n          Archie ?\n\n          ARCHIE\n           Barney ?\n\n           BARNEY\n\n           (UNEASILY)\n           You know how long I've known you?\n\n          Â\u0080¢\n\n          ARCHIE\n          Forever?\n\n          BARNEY\n          That's how long. And Polo and the kids.\n          That's exactly how long.\n          Another silence. Archie is watching the brass pole.\n          Every other girl sliding down looks like Petulia. Archie\n          accepts his hallucination with mild pleasure. Barney\n          will not be stopped.\n\n          BARNEY'S VOICE\n          So I have a right to my opinion; It's\n          breaking Wilma's heart; That's all we\n          talk about. You think you're different\n          than anybody else? Every time I leave my\n          house it's the last time, I'm never coming\n          back. You're not listening to me, Archie.\n\n          ARCHIE'S VOICE\n          Barney, for Chrissake, I'm listening to you,\n\n          BARNEY'S VOICE\n          You're thinking about that hot cat in your\n          bed, you bastard.\n\n          \n\n          \n\n          \n\n          \n\n          24\n\n          19 CONTINUED\n          Now, in the continuous luncheon fashion show, the\n          \"Psychedelic Yvonne\" has appeared, topless amid a wild\n          pattern of lights, The dialogue between Barney and Archie\n          continues elsewhere as the orgy of colors becomes:\n\n          20 INT. HOSPITAL\n\n          The left side of a patient's face and the right shoulder\n          and arm of the patient's body are sprayed with a special\n          liquid which instantly dries a violent blue and then very\n          quickly starts changing into all the colors of the rainbow.\n          These various colors indicate physical conditions. They\n          are watched, measured, and timed by Archie, Barney and\n          their assistants,\n\n          BARNEY'S VOICE\n          My record is far from spotless, if you\n          don't know that, who does? But baby, it's\n          just not the answer, not at our age.\n\n          ARCHIE'S VOICE\n          So what's the answer, baby?\n\n          BARNEY'S VOICE\n          â\u0080¢ Someplace you can belch without saying\n          excuse me!\n\n          ARCHIE'S VOICE\n          I can do that in the steam room at the YMCA.\n\n          BARNEY'S VOICE\n          (going right on)\n          And if a little monkey business comes along,\n          whose gonna throw rocks? You and Polo were\n          a marvellous looking couple.\n\n          21 INT. HOSPITAL LEAD ROOM\n\n          The patient is in a lead room being scanned by an atomic\n          computer. The activator moves in a rhythmic, graceful\n          pattern over the patient's drab, withered body. In the\n          control area Archie and Barney listen to the strange sounds\n          emanating from the computer, each sound again indicating a\n          physical condition. The patient's room looks like a comfy\n          hotel room: wood paneling, couches, magazines, plants.\n          The door leading to outside is three inches thick and\n          solid lead. The noise from the equipment is deafening.\n\n          IS\n\n          \n\n          \n\n          \n\n          \n\n          25\n\n          21 CONTINUED\n\n          10 BARNEY'S VOICE\n          Is there something wrong with being a\n          groovy looking couple? People turning\n          around to stare? What was it, Archie?\n          The sex bit? Huh? The ole sex bit ,,,?\n\n          ARCHIE'S VOICE\n          Barney, what would you say if I told you\n          that one day I just got very tired of being\n          married?\n\n          22 INT. A DECOMPRESSION OPERATING ROOM\n\n          This is a really glorified pressure chamber where a complete\n          atmosphere is created to suit whatever surgery is going on.\n          The patient can no longer be seen. He is draped in plastic\n          which creates a sub-atmosphere. The doctors and nurses\n          are swathed in plastic, again in the atmosphere that lets\n          them function best, (This is for real. It exists, for\n          instance, at Mt. Sinai Hospital in New York.) The doctors\n          and nurses communicate with each other through throat\n          mikes and seem like other world automatons. In all this\n          the patient simply does not exist. The colors are eerie\n          yellows and blues with only occasionally and very\n          impersonally the red of blood,\n\n          Â\u0080¢\n\n          BARNEY'S VOICE\n          (he never listens)\n          It's still better than being out there in\n          the dark, all by your goddam lonesome!\n          Nobody has a life anymore. Quicksand,\n          It scares me. What do you want, Archie?\n\n          23 INT. DOCTOR'S GYM\n\n          Archie and Barney are in a white cubicle playing handball.\n          Their dialogue, of course, continues,\n\n          ARCHIE\n\n          (GASPING)\n          I don't know what I want. To feel something,\n\n          BARNEY\n\n          (GASPING)\n          That's no answer; Archie, grow up!\n          The ball comes whizzing at Barney who suddenly wants it\n          to hit him, which it does,\n\n          BARNEY\n          Archie, what am I going to do about Wilma?\n\n          0\n\n          \n\n          \n\n          \n\n          \n\n          26\n\n          24 EXT. ARCHIE'S APARTMENT LATE AFTERNOON\n\n          Archie has just parked his car and is going toward the\n          entrance, when he sees Petulia sitting on a bus-stop\n          bench, the tuba beside her. She is dozing.\n\n          ARCHIE\n\n          (SOFTLY)\n          Hey, you.\n          She opens her eyes, smiles.\n\n          PETULIA\n          I'm drunk.\n\n          ARCHIE\n          It's the stuff Barney gave you.\n\n          PETULIA\n          I'm drunk.\n\n          ARCHIE\n          I'll drive you home.\n\n          PETULIA\n          Thank you, I'll take the bus.\n\n          0\n\n          ARCHIE\n          Don't be silly.\n\n          PETULIA\n          Don't pry, Archie.\n\n          ARCHIE\n          How'm I prying?\n\n          PETULIA\n          I'll go home by bus.\n\n          ARCHIE\n          If I were prying, I would ask you how you\n          broke your rib. Right?\n\n          PE TULIA\n          You fall on a tuba and you break your\n          rib. Right.\n\n          ARCHIE\n          Wrong. The rib was broken hours before\n          your fall.\n          L' During this the bus comes to a stop. Petulia rises shakily\n          to board it but she can't go through the entrance with\n          the tuba.\n\n          \n\n          \n\n          \n\n          \n\n          27\n\n          CONTINUED\n\n          BUS DRIVER\n          Anytime you're ready, Lady.\n\n          ARCHIE\n          I'll keep it for you.\n\n          PETULIA\n          It has to be returned. \"Friends of\n          the Evergreen,\"\n          Archie looks blank.\n\n          PETULIA\n          It's a lodge. In Chinatown. On Grant.\n          Ask for Mr. Howard.\n          The bus driver really leans on his horn to make everything\n          charming.\n\n          ARCHIE\n          (shouting above horn)\n          Petulia, take a cab!\n\n          PETULIA\n          (shouting above horn)\n\n          Â\u0080¢\n          Don't pry, Archie:\n          She groggily enters the bus, leaving the tuba in Archie's\n          arms.\n\n          25 INT. BUS\n\n          Petulia takes a seat at an open window. The bus is now\n          stopped for a moment more by the traffic light. Petulia,\n          under the best of circumstances doesn't make much sense,\n          and now she's quite groggy.\n\n          PETULIA\n          Will you remember that? \"Friends of\n          the Evergreen.\"\n\n          ARCHIE\n          Petulia, where are you going?\n\n          PETULIA\n          Mr. Howard. Tell him I'm sorry I goofed.\n          Archie, you know something? The tuba\n          makes you look ten years younger, and\n           . you'know ... Thingy\n          0 The bus starts with a jolt and Petulia winces in pain.\n\n          \n\n          \n\n          \n\n          \n\n          28\n\n          26 INT. DANNER HOUSE KITCHEN\n\n          Petulia is wincing with pain as she puts groceries on\n          the shelf. David is watching her, concerned.\n\n          DAVID\n          Petulia?\n\n          PETULIA\n          Hi.\n\n          DAVID\n          You okay?\n\n           PETULIA\n           Uh huh.\n\n           DAVID\n           Sure?\n\n           PETULIA\n           Of course.\n\n           DAVID\n           Just before ---\n\n          I\n\n          PETULIA\n          I'm fine.\n\n          DAVID\n          ... for a split second there\n\n          PETULIA\n          Ism okay.\n\n          DAVID\n          I thought maybe you\n\n          PETULIA\n          David.\n          Somehow or other we begin to sense that madness has\n          entered what is really a commonplace scene. Something\n          has gone wrong and we can't for the life of us under-\n          stand what and before we can even guess, we are:\n\n          27 INT. BUS\n\n           Petulia is still in the bus and we realize she has\n          0 imagined the foregoing. She gets off the bus.\n\n          \n\n          \n\n          \n\n          \n\n          29\n\n          28 EXT. THE VERY. MODEST OFFICES OF THE \"FRIENDS OF THE\n\n\n          EVERGREEN\" DAY.\n          The sign on the door identifies this as a fraternal\n          organization, founded in 1886 for the betterment of man,\n          but the door is securely padlocked for the night.\n          Archie stands there, holding the tuba and feeling\n          stupid. Haplessly, he returns to his car and begins\n          stowing the tuba inside, banging it against his nose\n          in the process. He is a far from happy man.\n\n          29 EXT./INT. A CLUTTERED, MEAN LITTLE KITCIEN\n\n\n           IN A SLUM HOUSE DAY\n          Petulia is filling the noisy old electric ice box with\n          milk, ice cream and fresh fruit. A man enters from\n          another room. He is a big, sleepy-eyed Mexican. He\n          has just awakened, is wearing his pajama bottoms and\n          is hairy, sweaty and fat.\n          Petulia obviously knows tlleiman, nods hello, to which\n          the man answers a non-committal grunt. He squeezes\n          past Petulia to drink from the sink. He sticks his\n          head under the tap.\n\n          0\n\n          PETULIA\n          (she speaks slowly because he\n          doesn't understand English)\n          I came by to make sure there was enough\n          milk and things.\n          He finds the situation amusing, reaching in past Petulia\n          to grab an orange. There should be a feeling of a\n          possible relationship between Petulia and this man.\n          In the next room a screen door opens and closes.\n          Petulia closes the ice box door and we and she see\n          Oliver and the Woman standing in the doorway.\n\n          30 INT. ARCHIE'S APARTMENT NIGHT\n\n          Archie is doing research at a desk. Working from notes,\n          he is talking into a tape recorder about new techniques\n          in the treatment of arthritis that would not require\n          surgery. This is a moment to glimpse Archie as a\n          thoughtful man. There are a couple of beer bottles\n          nearby. The bed is still unmade. The tuba stands\n          in the corner.\n\n          0\n          The front doorbell rings and Archie crosses over to\n          let in his wife, Polo, a very attractive young matron.\n\n          \n\n          \n\n          \n\n          \n\n          30\n\n          30 CONTINUED\n           Polo looks about the apartment dubiously, from tuba to\n           unmade bed. She can't keep her eyes off the unmade bed.\n\n          ARCHIE\n          (after `awhile )\n          Hi, Polo.\n\n          POLO\n          It's very nice.\n          Archie looks at her questioningly.\n\n          POLO\n          I've never been here before.\n          It's very nice.\n\n          ARCHIE\n          Thanks.\n\n          POLO\n          It's strange, coming into your husband's\n          bachelor apartment for the first time.\n          Feels slightly illegal. Is that a tuba?\n\n          0\n\n          ARCHIE\n          That's a tuba.\n\n          POLO\n          Make a marvelous lamp.\n\n          ARCHIE\n          You just had to say it.\n\n          POLO\n          Predictable Polo.\n\n          ARCHIE\n          \"Predictable Polo.\" Has a certain zing.\n          How're the kids?\n\n          POLO\n          Looking forward to the weekend.\n          Lest I forget\n          She opens her large handbag, takes out a cellophane bag\n          of cookies.\n\n          POLO\n          As usual, I baked enough for an army.\n\n          ARCHIE\n          Okay.\n\n          \n\n          \n\n          \n\n          \n\n          31\n\n          0 30 CONTINUED\n\n          POLO\n          This is very strange. I didntt think\n          I'd feel like this. Mostly sad.\n          Archie's sad, too, therefore he is more brusque than\n          necessary. Also he is bugged by the cookies.\n\n          ARCHIE\n          You need anything, Polo?\n\n          POLO\n          No. Well, yes. Well, yes and no.\n\n          ARCHIE\n\n          (SMILING)\n          I think that covers all the possibilities.\n          Polo laughs, suddenly they share a moment of warmth.\n\n          POLO\n          It's such a puzzle. We really got on\n          so marvelously. Never fought. Never\n          screamed at each other. Not once.\n          â\u0080¢ Something in his silence, plus that damned unmade bed,\n          is beginning to make her angry.\n\n          POLO\n          Everybody we knew envied us.\n\n          ARCHIE\n          We were a handsome couple.\n          This makes her so angry she can now say what she came\n          to say.\n\n          POLO\n          I think I've fallen in love. The\n          man is Warren Smith. He's an engineer\n          and very good with the children, but he\n          wants to go back to school and get his\n          masters in hydraulics.\n          (very long pause)\n          Well, say something.\n\n          ARCHIE\n\n          (BLANDLY)\n          I think that's fine, Polo.\n\n          â\u0080¢ POLO\n\n          (MILDLY)\n          Go to hell.\n\n          \n\n          \n\n          \n\n          \n\n          32\n\n          0 30 CONTINUED\n           Tie phone begins ringing. Archie crosses to it.\n\n           ARCHIE\n           Hello?\n           (no answer)\n           Hello?\n\n          POLO\n          Were going to'be married.\n\n          ARCHIE\n          Great.\n           (into phone)\n           Hello?\n\n          31 INT. DANNER HOUSE NIGHT\n\n          ' David is on the phone and Petulia'has just entered.\n           David hangs up the phone.\n\n          PETULIA\n\n          â\u0080¢ DAVID\n\n          PETULIA\n          She stops. She waits for a moment, wondering if the\n          scene she imagined on the bus is now going to occur.\n          Will David now say, \"Just for a second there .?\"\n\n          DAVID\n          Come on, let's eat. Morrie finally\n          got a shipment of Dungeness crab.\n\n          PETULIA\n          About time.\n\n          DAVID\n          Well, poor guy. They had all that trouble.\n          David crosses to the dining area. And that's that.\n\n          32 INT. ARCHIE'S APARTMENT NIGHT\n\n\n          POLO\n          Not right away. He's also divorced.\n          There's alimony ... child support\n          It looks absolutely obscene.\n\n          \n\n          \n\n          \n\n          \n\n          33\n          â\u0080¢ 32 Continued\n          Archie sees her. looking at his bed.\n\n          ARCHIE\n\n          (ANNOYED)\n          So the kids like him, eh?\n\n          POLO\n          Adore him.\n\n          ARCHIE\n          How about that?\n\n          POLO\n          Don't you have maid service?\n\n          ARCHIE\n\n          (SUDDENLY)\n          What the hell are you doing, bringing\n          me cookies?\n          He flings the bag at her, barely missing her. They\n          are both stunned by this outburst,\n\n          'OLO\n          â\u0080¢ (shakily)\n           Well ... this is a new side of your\n          natured For two people who never fight\n          Absently, Polo sags down on the edge of the unmade bed,\n          which has so fascinated her. During the following, no\n          matter what their bodies happen to be doing, Polo and\n          Archie continue to speak in a most logical manner.\n\n          ARCHIE\n          What's so great about not fighting?\n\n          POLO\n          I came to tell you about Warren,\n\n          ARCHIE\n          You told me about Warren.\n          He sits beside her, well not really beside her, actually\n          as far away from her as the bed will permit. She decides\n          she will instantly get up off the bed, but she does not.\n\n          ARCHIE\n\n          (CONTINUING)\n          Warren is working for his m'tstah's\n          in hydraulics.\n\n          \n\n          \n\n          \n\n          \n\n          34\n\n          0 32 CONTINUED\n          Polo knows she shouldn't smile at Archie making fun of\n          Warren, but she does. Archie touches her smile with his\n          finger, then his hand moves across her face, to the back\n          of her neck. It is a clumsy gesture and they clumsily\n          sprawl on the bed.\n\n          POLO\n          Well, I'm afraid well still need\n          all the money you pay me. And I'll\n          be seeing him, Archie\n\n          32A INT. POLO'S BEDROOM\n\n          It's a nice enough room, which makes what she says\n          later quite absurd,'\n          She and Warren are preparing for bed Â®m already in a\n          boring ritualistic fashion; she with curlers in her\n          hair, he hanging his trousers on a hanger,\n\n          POLO IS VOICE\n           , (continuing)\n           ., at the house. I mean until Warren\n\n          Â\u0080¢\n          and I get married, which won't be\n\n          32B. INT. ARCHIE'S APARTMENT\n\n          By now, entirely out of habit, Archie's hand has\n          pushed up Polo's shirt, as he continues the sex ritual.\n          Wholly out of habit, Polo lets him. Their bodies, old\n          friends for so long, and once having been lovers,\n          simply ignore whatever tripe their mouths happen to\n          be saying,\n\n          POLO\n\n          (CONTINUING)\n          until he is established with some\n          hydraulics firma I hope it won't be\n          too long, I mean for everybody's sake.\n\n          ARCHIE\n          If he's a bright guy, he'll make out okay.\n\n          POLO\n          Needless to say there are certain problems.\n          By now, Archie is on top of Polo, and out of habit she\n          is adjusting her body for him.\n\n          \n\n          \n\n          \n\n          \n\n          35\n          32B Continued\n\n          POLO\n          He lives in such a depressing, rented\n          room. It gives me claustrophobia.\n\n          ARCHIE\n          Poor Polo.\n\n          POLO\n          It's such an icky little room.\n          Archie is, perhaps, two seconds away from entering Polo,\n          when he suddenly sits up, wondering what the hell he's\n          been doing. He walks to the far side of the room,\n          sticks his shirt in, wipes the sleeve of his shirt\n          across his face.\n          Polo feels no particular rancor, the entire thing was\n          totally unplanned, and she has no more desire to\n          \"make it\" with Archie than he has with her. She pulls\n          down her skirt and adjusts her garters.\n\n          ARCHIE\n          Tell the kids I'll come for them\n          0 Sunday at eight.\n\n          POLO\n          They'll be ready. I thought the\n          decent thing was to come here and\n          talk in a civilized manner. About\n          the change in my situation.\n\n          ARCHIE\n          I appreciate it, Polo.\n\n          POLO\n          Good night, Archie.\n\n          ARCHIE\n          You've got a run in your stocking.\n          Polo exits, Archie can't figure out why in the world\n          he even thought of making love to Polo after all this\n          time. He sits down on the unmade bed, finds one of\n          Polo's cookies on the sheets, and pops it into his\n          mouth.\n\n          33. EXT. TEA GARDEN DAY\n\n          0 It's a busy Saturday and everything is lovely. A\n\n          \n\n          \n\n          \n\n          \n\n          36\n\n          33 CONTINUED\n          LARGE GUARD with a bull horn is keeping people moving\n          on the Japanese bridge. Many soldiers on pass, a few\n          hippies, but mostly just tourists.\n\n          LARGE GUARD\n          (with bull horn)\n          Now you folks keep moving along that\n          bridge. You keep moving along and give\n          other folks a chance. There's lots of\n          pretty things to do. You keep moving\n          right along. You won't want to forget\n          our Niponese souvenir pagoda where every\n          item is the real McCoy. That's right.\n          Keep moving, that's the ticket.\n          Sergeant, you've been standing there\n          some time now.\n          During this, MAY and Archie talk.\n          '.s 32 and pretty. Its a nice day but Archie is\n          not happy. Polo, Warren, maybe Petulia mostly it's\n          kind of a lousy day to be a bachelor, . and May have\n          been sitting on the grass. Gracefully she rises to\n          her feet, doing everything just right, even this.\n          0 She puts away her portable martini kit.\n\n          ARCHIE\n          Nobody in the world can sit on the\n          grass and not wrinkle.\n          She looks.\n\n          ARCHIE\n          No, perfect. Not even a blade of\n          grass. Why don't I marry you, May?\n\n          MAY\n          Why don't you, Ar^hie?\n          They walk along holding hands. Archie should feel\n          better than he does.\n\n          ARCHIE\n          Tell me about Bobby Kennedy.\n          She looks at him, smiling.\n\n          ARCHIE\n\n          (SHRUGGING)\n          Picasso? Pickles?\n          She smiles tolerantly as they walk along.\n\n          \n\n          \n\n          \n\n          \n\n          37\n          â\u0080¢ 33 Continued)\n\n          ARCHIE\n          Choose a subject. Ice cubes. Any\n          damn thing. Take either side. Talk\n          for thirty seconds against ice cubes.\n\n          MAY\n\n          (EASILY)\n          Why the hostility, Archie?\n\n          ARCHIE\n          That dress shop of yours. \"Boutique.\"\n          I've never seen one of those ... your\n          rubber mannequins .. I've never once\n          seen the pipe sticking out of their\n          bottoms. Not once, not one damn time.\n          That bothers me, May.\n          May stops. She doesn1t know whether to be annoyed or\n          amused. Shets a little of both.\n\n          ARCHIE\n          I'm not hostile, it's frustration.\n          In all that perfection, how could a\n          clumsy clot like me possibly be\n          fitted in? I mean, without spoiling\n          the whole effect.\n          They have now reached the area of the stunted trees.\n          Nuns are passing through empty benches; kids are\n          improvising on the stage and shouting.\n\n          MAY\n          Don't worry about it. You'll be\n          going back to Polo.\n\n          ARCHIE\n          No, she's found a fellah.\n\n          MAY\n          Oh.\n          She watches the kids for a moment.\n\n          MAY\n          I'd just about given up on you,\n\n          ARCHIE\n          What I should do is marry you.\n          For May this has been said once too often. She is now\n\n          Â\u0080¢\n          thoroughly annoyed.\n\n          \n\n          \n\n          \n\n          \n\n          38\n\n          33 CONTINUED)\n\n          KAY\n          Archie, if it would please you, I'll\n          submit a list of my faults, some of\n          which might shake you up a bit.\n\n          ARCHIE\n          It would be a fake list.\n\n          MAY\n          Probably, It wouldn't be a fake\n          list. Actually, I wear arch supports,\n          my depilatory causes a nasty little\n          rash, and I've lost 10% of my hearing\n          in less than a year .. Okay?\n\n          ARCHIE\n\n          OKAY;\n          They laugh, kiss, grab at each other, and hurry toward\n          the parking lot for Archie's car.\n\n          34 EXT. STEPS OF ARCHIE' S APARTMENT DAY\n\n          Petulia waits on the steps. When she is not being observed,\n          when she is not \"on,\" there are moments when Petulia seems\n          utterly forlorn. This is such a moment. But then she sees\n          Archie and May and instantly she is \"with it.\"\n\n          ARCHIE\n          Well of all people.\n\n          PETULIA\n          All that crap about the humanitarian-\n          ism of the medical profession.\n          She darts alongside the building and begins frantically\n          calling to a little old man in white duck pants and an\n          \"aloha\" hat,\n          May looks at Archie questioningly.\n\n          ARCHIE\n          Don't ask.\n          Petulia and the old man are back joining Archie and May\n          on the steps.\n\n          PETULIA\n\n          (ACCUSINGLY)\n          Archie, this is Mr. Howard.\n\n          0 MR. HOWARD\n          I was looking at the foundation.\n          Once in a while you find one from\n          before the earthquake. It's a thrill,\n          believe you me.\n\n          \n\n          \n\n          \n\n          \n\n          39\n          0 3L1. Continued\n          Petulia resents any sense of cordiality at this\n          particular time.\n\n          PETULIA\n          Mr. Howard is the'watchman for\n          the \"Friends of the Evergreen.\"\n          Or was.\n\n          ARCHIE\n          The tuba.\n\n          PETULIA\n          No wonder people are becoming cynical\n          about doctors.\n\n          ARCHIE\n          I tried to return it. The place\n          was locked.\n\n           MR. HOWARD\n           No harm done,\n\n           PETULIA\n          â\u0080¢ I didn't expect this of you,\n          Archie'.\n\n          ARCHIE\n          I tried to return the tuba Friday\n\n          NIGHT;\n\n          MR. HOWARD\n          It's O.K.\n\n          PETULIA\n          (accusingly to\n\n          ARCHIE)\n          The \"Friends of the Evergreen\" are\n          very proud of their brass band.\n\n          MR. HOWARD\n          All's well that ends well.\n\n          PETULIA\n          Stay out of this, Mr. Howard.\n          She sees May watching all this with wry amusement.\n\n          PETULIA\n          I'm Petulia Danner. I'm sorry about\n          this.\n\n          \n\n          \n\n          \n\n          \n\n          40\n\n          0 35 INT. ARCHIE'S APARTMENT DAY\n\n          Mr. Howard is casually testing the valves on the tuba.\n\n          MR . HOWARD\n          She said there was this elderly lady whose\n          first husband used to play tuba with John\n          Phillip Sousa. She said it would cheer\n          her up and make her want to live. She\n          gave me five bucks.\n\n          ARCHIE\n          (looking at Petulia)\n          All that broken glass\n\n          MR. HOWARD\n          (finished with the tuba)\n          Its okay.\n          Archie crosses to the front door and opens it.\n\n          ARCHIE\n          Goodbye, Mr. Howard. Goodbye, Petulia.\n          Petulia crosses to Mr. Howard and presses a dollar bill\n          into his shirt pocket.\n\n          Â\u0080¢\n\n          PETULIA\n          Take a taxi. You can at least say\n          you're sorry, Archie.\n\n          ARCHIE\n          I'm sorry, Mr, Howard. Goodbye, Petulia.\n          But Petulia just sits on the edge of a chair tapping\n          her fingers in annoyance. Mr. Howard leaves. The door\n          remains open for Petulia to leave. May watches Petulia\n          in amused tolerance.\n\n          ARCHIE\n          What's the next move, Petulia?\n\n          PETULIA\n          I'd like to discuss your irresponsibility.\n          People are passing in the hallway, peering in.\n\n          ARCHIE\n          Goodbye, Petulia.\n           He advances on her, somewhat threateningly.\n\n          Â\u0080¢\n\n           PETULIA\n           My rib.\n           Archie slams the door shut ets a bottle and a couple g\n           of glasses, pointedly, exclu ding Petulia.\n\n          \n\n          \n\n          \n\n          \n\n          41\n\n          0 35 CONTINUED\n\n          ARCHIE\n          I should explain about Petuliaa She is\n          a kook. We are going to be married.\n\n          PETULIA\n          Archie, when you try to sound cool and\n          \"with it,\" you're really pathetic.\n          We're trying to have an intelligent\n          conversation...\n\n          ARCHIE\n          About what?\n\n          PETULIA\n          Well, about Polo, among other things.\n\n          ARCHIE\n          Polo is none of your damned business.\n\n          PETULIA\n          That's dumb. Dumb. She's my business\n          and she's this lady's business. I\n          happen to hate Polo.\n\n          ARCHIE\n          (to May)\n          Needless to say she's never even met Polo.\n\n          PETULIA\n          I look at you and I know Polo.\n          (to Map)\n          Explain that to him.\n          May looks at Archie in bewilderment, she is not quite sure\n          how to react; but when she makes up her mind it will be\n          the exactly right reaction. Also, in all truth, Petulia\n          is frightened by May.\n\n          PETULIA\n          How many years were you married., Archie?\n          Eight? Ten? Anyhow, the best, Wasted.\n          Gone down the drain.\n\n          ARCHIE\n          Oh, come on ..o\n\n          PETULIA\n          Archie, we are from two different worlds.\n          We've got nothing to agree on. Except one\n          thing. You're a lonely screwed up mess.\n          0 Archie, I'm trying to save you. You're\n          a very special man.\n\n          \n\n          \n\n          \n\n          \n\n          42\n\n          0 35 CONTINUED\n\n           ARCHIE\n           Oh, God.\n\n          PETULIA\n          Tell him, May.\n          Petulia doesn't like May's amused reaction.\n\n          PETULIA\n          You don't think so?\n\n          MAY\n          I won't put Archie on a pedestal. He'll do.\n\n          PETULIA\n\n          (ANGRY)\n          You've got yourself another winner, Archie.\n\n          MAY\n          (to Archie)\n          It's a joke, you're both putting me on.\n\n          ARC HIE\n          Petulia. I mean it. Tubas. All this\n          E \"I Love Lucy\" jazz. It's only cute for\n          awhile.\n\n          PETULIA\n          It's not meant to be cute. I'm\n          fighting for your life.\n\n          ARCHIE\n          Who's trying to kill me?\n\n          MAY\n          The two million, five hundred thousand\n          subscribers to the \"Ladies Home Journal\"\n          ... right, dear?\n\n          ARCHIE\n          Petulia, go home and save what's his name.\n          I really don't want to see you anymore.\n          Archie's voice is cold. Petulia is suddenly defeated,\n          mostly by May. She gets up and leaves.\n\n           36 INT. HOSPITAL NIGHT\n\n           It's after 3 a.m. and Archie is hollow-eyed and drenched\n          0 with sweat from an emergency operation. He is with a\n          patient in the recovery room, obviously concerned about\n\n          \n\n          \n\n          \n\n          \n\n          43\n          i 36 Continued\n          the patient's chances. He crosses to a sink, bathes his\n          face and hands with cold water. He is exhausted. As we\n          sometimes glimpse Petulia when no one else is looking\n          and see beyond the kookiness, so for an instant we see\n          beyond Archie's look of professional assurance and see\n          the fearful uncertainty. He now moves into the corridor,\n          with each step assuming the doctor's look that is expected\n          of him.\n\n          PETULIA'S VOICE\n          Hi.\n          Archie turns. Petulia is in the medical library with\n          books scattered all about her.\n\n          ARCHIE\n          You're kidding.\n\n          PETULIA\n          I think I've discovered a cure for cancer.\n\n          ARCHIE\n          Well, if you're on the brink of something.\n          How did they let you in.\n\n          Â\u0080¢\n          She joins him.\n\n          PETULIA\n          You look exhausted.\n\n          ARCHIE\n          Do you know it's almost three? Doesn't\n          Mr. Danner worry at all about things like that?\n          Petulia looks at him reverently.\n\n          PETULIA\n\n          (TENDERLY)\n          Look at you.\n          Archie is so unaccustomed to hearing a straight line\n          from Petulia that her tone and look of tenderness stop\n          him for a moment. Then, without a word, they fall into\n          step beside each other, leaving the hospital.\n\n          37 EXT. PARKING LOT NIGHT\n\n          At this time of night hardly a car remains. Archie's car\n          is quite by itself.\n\n          0\n\n          \n\n          \n\n          \n\n          \n\n          37 CONTINUED\n\n          ARC HIE\n          Shall I drop you off?\n          (she doesn't answer)\n          It's too late for the bus.\n          She gets in.\n\n          38 INT . CAR\n\n          ARCHIE\n          Petulia, you've got to stop following\n          me around like this.\n          Petulia is absolutely silent but her eyes are devouring\n          him with infinite tenderness which Archie is finding\n          very touching. It is a facet of Petulia he has never\n          seen before.\n\n          ARCHIE\n          Where to? I could use a steak sandwich.\n          There's a jazz joint that stays open\n          all night.\n          He reaches to start the car just as she grabs at him,\n          â\u0080¢ awkwardly, aggressively.\n\n          ARCHIE\n\n          (SURPRISED)\n          Hey, come on Â®m why this sudden\n          Petulia is relentless and voracious. Her hands and mouth\n          are everywhere on Archie. A car is a lousy bedroom but\n          it will have to do. Heads bump against windows, elbows\n          jam against steering wheels, but Petulia will not be\n          stopped. Finally, Archie grips her shoulders and forces\n          her to stop.\n\n          ARCHIE\n          No.\n\n          PETULIA\n          Yes.\n\n          ARC HIE\n          Not here.\n\n          39 INT. SUPERMARKET PRE-DAWN\n\n          Though the streets outside are deserted, the supermarket\n          is jammed with people. Archie is pushing a market\n          â\u0080¢ basket already piled high with groceries while Petulia\n          keeps finding things to buy. Archie knows that Petulia\n          is going through this massive shopping spree simply to\n          get even for his rejection of the moment she chose to\n          make love.\n\n          \n\n          \n\n          \n\n          \n\n          45\n          â\u0080¢ 39 Continued\n\n          ARCHIE\n          It m not really hungry.\n\n          PETULIA\n          I'm starving.\n\n          ARCHIE\n          Am I being punished?\n\n          PETULIA\n          Loganberry jam ... we'll have a case.\n\n          ARCHIE\n          I'd rather have a new plastic raincoat.\n\n          PETULIA\n          You don't save anything on plastic raincoats.\n\n          ARCHIE\n          Shall I get another cart? Polo can fill\n          three or four when she really puts her\n          mind to it.\n          Petulia gets the point and instantly takes her place\n\n          0\n          in the long line before the cashier.\n\n          WOMAN SHOPPER\n          (as if it's Petulia's fault)\n          You know what time it is? It's after fivB.\n\n          PETULIA\n          Ilia sorry.\n\n          WOMAN SHOPPER\n          I want to go to bed.\n\n          PETULIA\n          So do we.\n\n          40 EXT. SUPERMARKET\n\n          Petulia and Archie leave the supermarket with their rolling\n          basket of groceries. There is no one else on the street.\n          In front of the market is a clown on a pedestal gesticu-\n          lating with arms and mouth at people who are not there,\n          but making no sound. Petulia quizzically looks up at the\n          silent violent clown, while Archie waits for her at the\n          car. Finally he taps the horn and she turns and looks at\n          him. She starts running toward the car, suddenly wanting\n          0 very much to be with him. They kiss lightly.\n\n          \n\n          \n\n          \n\n          \n\n          46\n\n          9 41 INT. ARCHIE'S BEDROOM NIGH'\n\n          Archie is sound asleep, breathing heavily. Petulia sits\n          wrapped in a blanket on the floor near the window, her\n          head resting on the sill, lonely.\n\n          42 TNT. ARCHIE'S BEDROOM NIGHT\n          Petulia is sound asleep. Through the open bedroom door\n          we see Archie drinking a lonesome Coke.\n\n          43 INT. ARCHIES BEDROOM NIGHT\n\n          Petulia and Archie are both in the bed, asleep and\n          somehow as far apart as two human beings can be.\n\n          44 INT. ARCHIE'S BEDROOM NIGHT\n\n          In the midst of her sleep, Petulia begins jabbering in\n          some language all her own. Archie Is eyes open and he\n          looks at her and he smiles. Still sound asleep,\n          Petulia finishes her statement, whatever the hell it\n          was and settles down on the pillow. Archie looks at her.\n          She wakes up. They look at each other so gravely that\n          they both begin to smile. Neither one is having the\n          best night of their life but both are aware of a sense\n          â\u0080¢ of tenderness that has caught them unexpectedly.\n          45 INT. ARCHIEtS BEDROOM MORNING\n          Petulia wakes up suddenly. Though she is nude under the\n          sheets, Archie is fully dressed for his day with the\n          boys. Though his clothes are very sporty he looks\n          anything but sporty as he talks quietly into the phone-\n\n          ARCHIE\n          (into phone)\n          Okay. Wells why not do some slides anyhow?\n          (in sudden anger)\n          To satisfy myself, that's who. Okay.\n          He hangs up the phone and sees Petulia looking at him.\n\n          ARCHIE\n          Well, we knocked off another one. Another\n          notch in the old stethoscope.\n\n          PETULIA\n          You're a wonderful doctor, Archie.\n\n          ARCHIE\n          I keep a little black bow tie in my desk. In\n          0 case the services are in the morning and 1 have\n          no time to go home. The neekband's all stained\n          with sweat.\n\n          \n\n          \n\n          \n\n          \n\n          47\n\n          45 CONTINUED\n\n          PETULIA\n          Why are you dressed?\n\n          ARCHIE\n          Have to pick up the, kids, I'm already late.\n\n          PETULIA\n          You're not abandoning me? I mean, I wasn't\n          all that bad, was I?\n\n          ARCH IE\n          Amateur night,\n          He leans over and kisses her mouth.\n\n          PETULIA\n          Before I've brushed my teeth? Are you a\n          communist, Archie?\n\n          ARCHIE\n          I guess so\n\n          PETULIA\n          Tell Mike to watch that weight.\n\n          0\n\n          ARCHIE\n          Will you be here when I get back?\n\n          PETULIA\n\n          (SMILING)\n          Dumb, Archie. Dumb.\n          Archie starts out, then stops, troubled.\n\n          PETULIA\n          Yes?\n\n          ARCHIE\n\n          WELL\n\n          PETULIA\n          I'm divorcing David, if that's what you mean,\n\n          ARC HIE\n\n          (SHARPLY)\n          That's none of my business.\n          Petulia is suddenly hurt.\n\n          PETULIA\n          Phone me.\n\n          9\n\n          ARCHIE\n          Where?\n\n          \n\n          \n\n          \n\n          \n\n          48\n\n          0 45 CONTINUED\n\n           PETULIA\n           Here.\n\n          ARCHIE\n          Listen, this worries me. Really.\n\n          PETULIA\n          Write the Number down so you won't forget.\n          Archie grins, sighs, and starts out. Petulia will do\n          anything to hold him one second more.\n\n          PETULIA\n          Hey,, you.\n          Archie turns at the door.\n\n          PETULIA\n          Don't have any illusions about all those\n          groceries. I can't cook.\n\n          ARCHIE\n          And you hate loganberry Jam.\n\n          PETULIA\n          No, as a matter of fact, I rather like it.\n          He smiles, continues out.\n\n          46 EXT. CORRIDOR & STEPS OUTSIDE ARCHIE'S APT.\n\n          He has barely gone ten steps when he is stopped by a\n          whistle. He turns. Her head is popped out the door (or\n          window). Anything to hold him, anything.\n\n          PETULIA\n          If somebody calls and wants medical advice on\n          something really obscure, is it okay if I\n          wing it on my own?\n          He makes an amused \"you nuts\" gesture and leaves, but\n          not before Petulia says:\n\n          PETULIA\n          Phone.\n          He is gone.\n\n          47 EXT. A WHARF ON SAN FRANCISCO BAY\n\n          â\u0080¢ A cruise boat that takes tourists across the bay is ready\n          to go.\n\n          \n\n          \n\n          \n\n          \n\n          0 47 CONTINUED\n          Mike and Steven, Archie's sons, are anxiously waiting for\n          their father to join them. Archie is in a phone booth\n          next to the ramp that leads to the boat. The boys are\n          yelling to Dad to come ono\n\n          ARCHIE\n          (into phone)\n          Hi,\n          (to boys)\n          Shut up, you guys,\n\n          PETULIA'S VOICE\n          Hi. What's all the noise?\n\n          ARCHIE\n          Mike.\n\n          PETULIA\n          Fat Mike?\n\n          ARCHIE\n          He's not all that fat.\n          During this series of dumb, ordinary telephone conversa-\n\n          Â\u0080¢\n          tions to follow,, we begin seeing the moments which have\n          brought on Petulia's current crisis with Oliver.\n\n          48 INT. BULL RING TIJUANA\n\n          It's a hot summer afternoon. Petulia and David have\n          driven down from San Francisco. They are members of the\n          \"San Francisco Matador Club\". David has drunk too much\n          wine from his bota bag and the sour wine and the hot sun\n          have made him violently ill. Though there are still two\n          bulls left to kill, David and Petulia are leaving. As she\n          moves down the spindly stairway, Petulia becomes aware of\n          Oliver. He is with a gang of other kids at the butcher\n          shed where the previous bulls are being dressed for market.\n          They are all soaking banderillos in blood so they can be\n          sold as \"the real thing\" .\n\n          49 EXT. A STREET IN TIJUANA\n\n          Petulia and David in their convertible. David has passed\n          out in the back seat and Petulia is having a hell of a\n          time trying to move the car out of the parking space.\n          Again kids swarm about her like wild animals, trying to\n          sell hats, cushions, gum, pottery, etc. Again she sees\n          Oliver among them (or is it another kid who looks like\n          0 Oliver?) ,\n\n          \n\n          \n\n          \n\n          \n\n          50\n\n          40 50 EXT. BORDER GATE AT TIJUANA LATE AFTERNOON\n\n          Thousands of cars are waiting to get through. Hot, noisy,\n          dusty, unbearable. Kids storm every car, hustling their\n          captured audience. Among them is Oliver. Have the others\n          been Oliver? In Petulia's exhaustion and discomfort, the\n          heat, the flies, the blaring horny she can't be sure.\n          (NOTE, All through the Tijuana scenes, we HEAR Archie\n          and Petulia's telephone conversation. It is utterly banal\n          and they know it and are amused by its banality.)\n          PETULIA: I was dozing.\n          ARCHIE: That's good.\n          PETULIA: You left without having breakfast.\n          ARCHIE: I had a cup of coffee on the way.\n          PETULIA: A cup of coffee. You should have had\n          eggs or waffles.\n          ARCHIE: I'm fine.\n          PETULIA: Me too.\n\n          PAUSE\n          PETULIA: I had a tall glass of pineapple juice.\n          ARCHIE: Make some toast, too. And milk.\n          Breakfast is a very important meal.\n          PETULIA: I wish you'd remember that.\n          ARCHIE: Well, goodbye.\n          0 PETULIA: Archie?\n          ARCHIE: Yes?\n          PETULIA: You won't forget to phone.\n\n          51 EXT. WHARF\n\n          Archie hangs up the phone and starts running with his sons\n          toward the boat. He is very pleased with his absolutely\n          nothing phone conversation.\n\n          52 EXT. BOAT DECK\n\n          Children run scurrying around the mildly crowded deck.\n          The boat is passing Alcatraz Island. Archie and the boys\n          are standing at the rail,\n\n          ARCHIE\n          They used to think that escape from that\n          prison was impossible.\n\n          52A EXT. BOAT DECK\n\n          Same scene, different Sunday. Warren and the boys are\n          standing at the rail.\n\n          WARREN\n          They used to think that escape from that\n          prison was impossible.\n\n          52B BACK TO SCENE 52\n          We resume with Archie and the boys.\n\n          \n\n          \n\n          \n\n          \n\n          SI\n          52B Continued\n\n          MIKE\n          Yes, Dad. Warren told us that last week.\n\n          ARCHIE\n          Warren. Well, we could have gone somewhere\n          else. I didn't know you had been.\n\n          STEVIE\n          (the youngest)\n          We thought maybe you had never been, Dad.\n\n          ARCHIE\n          No - well, thanks, actually I haven't\n          been before, Stevie.\n\n          MIKE\n          In fact, we don't call him Stevie anymore.\n\n          ARCHIE\n          Who doesn't?\n\n          MIKE\n          Mom thinks he's getting a little old for\n          being called Stevie, in fact.\n\n          Â\u0080¢\n\n          ARCHIE\n          I called you Stevie two weeks ago -e we were all\n          calling you Stevie two weeks ago -- I was.\n\n          STEVIE\n          Before that.\n\n          MIKE\n          Warren says that Alcatraz taught the world you\n          can get out of anything if you want to bad\n          enough.\n\n          ARCHIE\n          That's what Warren said, eh?\n\n          MIKE\n          Yes, Dad.\n\n          53 ANOTHER VIEW OF THE BOAT\n          The boys are watching Archie who is in that section of the\n          boat where the radar and electronic equipment are kept.\n          Archie is on the ship telephone. He is trying to keep\n          a straight face but since he is obviously talking to Petulia,\n          it is difficult.\n\n          â\u0080¢ MIKE :\n          (to another kid)\n          Doctors can do things like that. Call\n          their patients from wherever they are.\n          Archie finishes the call and returns to them, smiling.\n\n          \n\n          \n\n          \n\n          \n\n          52\n\n          53 CONTINUED\n\n          ARCHIE\n          How about clams on the wharf when we get back?\n\n          MIKE\n          Clams make Steve vomit.\n\n          ARCHIE\n          Oh.\n\n          MIKE\n          You forgot that.\n\n          ARCHIE\n          No, it just slipped my mind.\n          Archie really does like his kids but his thoughts are\n          somewhere else.\n\n          54 INT. A FISH PLACE ON THE WHARF\n\n          While Mike and Stevie are gorging themselves, Archie\n          is at the wall telephone.\n\n          ARCHIE\n          â\u0080¢ Hello there.\n\n          LATE AFTERNOON\n\n          55 EXT. THE BORDER GATE AT TIJUANA\n\n          During this silent scene we watch Oliver seduce Petulia\n          into giving him a lift in her convertible. Petulia is\n          so bored as the cars take hours to get past the gate,\n          Oliver is an absolute scoundrel. David is such a clod,\n          passing out in the back seat, his legs hanging out over\n          the door of the car, one sandal missing. His beautiful\n          face is somehow an obscene parody of itself, fiery\n          red from the sun.\n          Oliver mimics David, Petulia, the guard at the gate,\n          dances, skips, romps, annoys Petulia, makes her laugh,\n          dares her, goads her. Finally, when Petulia's car is\n          just one away from the border guard, Oliver impudently\n          hops into the seat beside her, expecting to be thrown\n          out but also expecting maybe a nickel in the bargain.\n          But the joke's on Oliver. Petulia is even kookier than\n          he is. Is it the look of David that sickens her? Is\n          it her annoyance at having to wait so long and do the\n          driving while he lies collapsed and useless? Is it\n          that \"useless\" that goads her?\n\n          \n\n          \n\n          \n\n          \n\n          53\n\n          55 CONTINUED\n          Most of all Petulia is doing something of absolutely no\n          importance; she knows Oliver will hop out of the car the\n          moment they reach the guard. All it amounts to is two\n          kooks having a few seconds of horsing around.\n          The joke is on both of them -- the guard, harassed by\n          the honking of thousands of cars and having fully\n          inspected the car just ahead of Petulia, waves the\n          convertible on through.\n          Petulia stops the car a few hundred yards past the\n          border to let Oliver climb out, but he just sits there.\n          Petulia thinks, \"okay, you little bastard . \" and\n          zooms down the highway, intending to stop at the first\n          moment the look of superior arrogance leaves Oliver's\n          tough little face.\n          During this we hear Archie and Petulia's second tele-\n          phone conversation which is as blab and loving as before.\n          ARCHIE: Hi, there.\n          PETULIA: Hello.\n          ARCHIE: I'm having lunch with the boys.\n          PETULIA: You eat a good lunch, Archie,\n          ARCHIE: I will, I will.\n           PETULIA: You only had a cup of coffee for breakfast.\n          ARCHIE: I'll eat a good lunch, Petulia.\n          PETULIA: Like what?\n          ARCHIE: Petulia, they have a thousand different\n           things on the menu.\n          PETULIA: You should have a sirloin steak with french\n          fries or baked beans.\n          ARCHIE: Okay.\n          PETULIA: That's easy to say, Archie, But I know you.\n          ARCHIE: Steak with french fries or baked beans.\n          PETULIA: Do they have fresh sea-food?\n          ARCHIE: Yes.\n          PETULIA: Sea bass is nice.\n          ARCHIE: Yes, sea bass is great.\n          PETULIA: If they grill it,\n          ARCHIE: I'll have grilled sea bass.\n          PETULIA: Unless they do a nice omelet.\n          ARCHIE: I'm sure they would if I asked.\n          PETULIA: It's such a problem.\n          ARCHIE: Yes, I know. Goodbye, Petulia.\n          PETULIA: Phone.\n\n          56 INT. FISH PLACE\n\n          Archie laughingly hangs up. He goes back to his kids.\n\n          \n\n          \n\n          \n\n          \n\n          54\n\n          0 57 EXT. FORT WINFIELD SCOTT DAY\n\n          The sign says all the dreadful penalty of being caught\n          in the fort. Archie takes the boys in.\n\n          ARCHIE\n          Warren take you here?\n\n          MIKE\n          No.\n\n          ARCHIE\n          He would see the sign, eh? See\n\n          57A INT. FORT ROUND THE GALLERIES\n\n          The boys whoop off up some stairs.\n\n          STEVIE\n          Hey, this is great.\n          Archie chases them through the floors.\n          Archie sees a telephone above which is a sign which\n          says that this phone is for the military and is to be\n          used only in emergency. Archie approaches it warily,\n          then loses his nerve and turns back to his kids.\n          Archie wants to get back to Petulia.\n\n          58 EXT. FORT BARRACK FLOORS DAY\n\n\n          ARCHIE\n          Alright?\n          The boys look at him uncertainly.\n\n          ARCHIE\n\n          (CONTINUING)\n          Its ten to two. Can you imagine that?\n          The time really went\n          The boys know that means he wants to take them home.\n\n          ARCHIE\n\n          (CONTINUING)\n          I'm really bushed.\n\n          MIKE\n\n          (COLDLY)\n          I feel okay.\n          Stevie is willing to let his dad off the hook.\n\n          STEVIE\n          I been sneezing.\n\n          \n\n          \n\n          \n\n          \n\n          55\n\n          58 CONTINUED\n\n          ARCHIE\n          So I noticed.\n\n          MIKE\n          He's always sneezing.\n\n          ARC HIE\n          Hey, next week I want you guys over for the\n          entire weekend. None of this three or four\n          hour stuff.\n\n          STEVIE\n          All weekend?\n\n          ARCHIE\n          Why not?\n\n          MIKE\n          To do what?\n\n          ARCHIE\n          You 'gust wait!\n           Stevie is instantly excited,\n\n          â\u0080¢ STEVIE\n          Something really interesting?\n\n          ARCHIE\n          Bet your life'.\n\n          MIKE\n          What?\n\n          ARCHIE\n          Just leave it to melt\n\n          MIKE\n          Warren said something about the Roller Derby.\n\n          ARCHIE\n          Oh.\n\n          STEVIE\n          Friday night till late Sunday?\n\n          ARCHIE\n          Unless you guys don't want to.\n\n          MIKE\n          The Roller Derby's pretty darn interesting.\n\n          ARCHIE\n          Yeah.\n\n          \n\n          \n\n          \n\n          \n\n          56\n\n          58 CONTINUED\n\n          MIKE\n          We'd have to sleep over. I mean if we were\n          going to spend the whole weekend.\n\n          ARCHIE\n          I want you to.\n\n          MIKE\n\n          (SUDDENLY)\n          Well, it's fine by me.\n\n          STEVIE\n          Me toot Boy l\n\n          ARCHIE\n          Okay, it's a dealt\n          Mike turns away.\n\n          STEVIE\n           He's going to cry I guess -- he does that.\n\n          59 INT. ARCHIE'S APARTMENT BUILDING HALLWAY DAY\n\n          Archie has had a pretty good day with the boys, is thinking\n          â\u0080¢ about Petulia waiting in his apartment, and feels pretty\n          damn good about the whole thing. He opens the door of\n          his apartment. He is carrying a bag of Mexican paper flowers\n\n          60 INT. APARTMENT\n\n          It is empty. Archie knows at once that Petulia is gone.\n          All the joy goes out of him. The apartment is a mess.\n          The television set is on: a program without sound of\n          soldiers fighting. Archie is so disappointed that\n          Petulia isn't here. He angrily flips the dial getting\n          the same type of program.\n\n          ARCHIE\n          A nice, neat kid.\n          After all the exuberance he feels so empty. Everywhere\n          things are scattered about.\n\n          61 INT. BEDROOM\n\n          The bedroom is the worst of all. The sheets and blanket\n          have literally been stripped from the bed and flung pall\n          mall onto the floor behind. Archie really is annoyed.\n          Then he stops, he crosses slowly to the tangle of sheets\n          and blanket on the floor. A lifeless arm protrudes.\n          Archie crumples to his knees and tears at the blankets.\n          Petulia is broken, bloodied and seemingly dead.\n\n          \n\n          \n\n          \n\n          \n\n          57\n\n          61 CONTINUED\n          Thï¿½-, phone is off the hook. Archie doesn't know where to\n          turn first. He feels Petulia's throat for a pulse, isn't\n          sure she has one,\n          Petulia is wearing his hooded sweatshirt from Se. 23.\n          Archie attempts heart massage, but Petuliats so taped up\n          from the broken rib that this is impossible.\n          Archie presses his mouth over Petulia's to attempt to get\n          her breathing again. He tries this only for an instant\n          then crosses to the phone, hangs it up and dials an\n          emergency number.\n          Archie goes back to Petulia. He feels again for a pulse\n          in her throat, can find no pulse. He begins trembling.\n          As always when a crisis really happens, it isn't as easy\n          as the Red Cross advertisements say. Her mouth won't\n          open right. His mouth seems unable to make the connection\n          with hers. It all looks more like very bad love-making\n          than a life-saving procedure.\n\n          62 INT./EXT. HALLWAY & STEPS OUTSIDE ARCH IE' S APARTMENT\n\n           Two special officers are moving Petulia down a hallway on\n\n          0\n          a stretcher. A third walks behind her pressing a rubber\n          oxygen mask over her mouth.\n          We feel Sunday late afternoon rudely shattered, but limp-\n          ing along nevertheless. Television, cokes, sex, stereo,\n          facials, isometric exercises. funny-papers, ailments;\n          boring endless Sunday late afternoon -- suddenly bloodied.\n          Doors are opening up and down the hallway. People come\n          out to stare. A big friendly old sheepdog wild with\n          enthusiasm, leaps at the stretcher and almost topples\n          Petulia. Archie, smeared with Petulia's blood, his\n          shirt-tails out, in a state of shock himself, whams the\n          dog as hard as he can. This entire sequence should\n          seem like a nightmare.\n          The dog's owner goes berserk.\n\n          DOG'S OWNER\n          Don't you hit Lennie!\n          Archie is too distressed about Petulia to even respond.\n          At every door there is a tenant. A jumble of voices all\n          spoken together.\n\n          1ST TENANT\n          0 That's sex for you.\n\n          2ND TENANT\n          It could be a gas leak.\n\n          \n\n          \n\n          \n\n          \n\n          58\n\n          62 CONTINUED\n\n          0 3RD TENANT\n          She's dead.\n\n          4TH TENANT\n          Those rescue cops never give up.\n\n          5TH TENANT\n          Yes'. but they're all racists.\n          Of course, one of the officers is a Korean and the other\n          a Negro. All through this we have also been aware of many\n          T.V. sets, all with programs with various kinds of violence.\n          One youbgster comes to the door holding a portable T.V. and\n          we see on the tube war casualties being flown out of the\n          Jungle by helicopters.\n          Archie has crossed ahead of the special officers to lead\n          the way down the steps. Half a dozen \"hippies\"' loaded\n          down with Chinese food and a yellow guitar are coming up\n          the steps. Everything is chaos.\n          The officers just can't manage the stretcher down the\n          narrow stairway. Poor Petulia is twisted and turned every\n          which way - all in the name of saving her life.\n\n          7TH TENANT\n\n          Â\u0080¢\n          (a rich old queen in\n          purple Bermuda shorts)\n          I had trouble like that with my piano. Two\n          hundred dollars to bring it through the window.\n          And its never been the same.\n          A record player is playing a Herb Alpert recording and\n          the stretcher seems to move along to its rhythm.\n\n          63 EXT. A HIGHWAY RESTAURANT NIGHT\n\n           This is the stretch of highway 1 - 01 going north from.Mexico.\n          The restaurant is a mass of neon, and does very well in,the\n          hot coffee department as the sleepy travellers take a\n          break on their way north.\n          Among the cars many are filled with bull fight\n          afficianados.\n          It's about ten p.m. There is a general feeling of\n          exhaustion and spent passions. People are bleary-eyed,\n          recovering from hangovers, beginning to feel the effects\n          of sunburns. All this we see later. First we see Oliver.\n          Oliver is sitting in the car staring coldly at David who\n          0 has just awakened. David is probably just about to say\n          \"Who the hell are you\" when Petulia appears carrying a\n          cardboard carton of coffee and orange juice.\n\n          \n\n          \n\n          \n\n          \n\n          59\n\n          63 CONTINUED\n          David takes a sip of coffee. Oliver grabs at the orange\n          juice, toppling it, spilling some of it on the seat but\n          saving most. He gulps it down then uses the straw to\n          make bubbles. David looks at Oliver and then at\n          Petulia, all through the bubbles.\n\n          PETULIA\n          Say hello to \"Petulia\"s Folly.\"\n          David says nothing.\n\n          DAVID\n          Oh?\n\n          PET ULIA\n          (with careful wit)\n          If, in the past, you thought me a bit odd,\n          feast your eyes on this little goodie.\n\n          DAVID\n          WhatÂ°s the problem?\n\n          PETULIA\n          (to Oliver)\n          Why can't you speak English?\n          (to David)\n          Why the hell don't they teach them English?\n          This little hustler picked me up in Tijuana --\n\n          DAVID\n          (to Oliver, very gently)\n          What's your name?\n\n          PETULIA\n          I've got a name for him!\n          Oliver doesn't understand what is being said, but he is\n          getting uneasy.\n\n          O LIVER\n          Lady say \"hey come on us go San Francisco\n          ten bucks.\"\n\n          PET UL IA\n          You bleeding little liar!\n          Oliver looks at Petulia innocently.\n\n          PETULIA\n\n          (CONTINUING)\n          I never did!\n          She's worried about David.\n\n          \n\n          \n\n          \n\n          \n\n          60\n\n          0 63 CONTINUED\n\n          PETULIA\n          What I said to this malicious little fink was\n          that maybe one day if we went back to Tijuana --\n\n          DAVIT?\n          (to Oliver)\n          San Francisco?\n\n          OLIVER\n          San Francisco.\n          Each says it in his own accent, and so begins a word game.\n\n          DAVID\n\n          (GIGGLING)\n          San Francisco.\n\n          OLIVER\n\n          { GIGGLING)\n          San Francisco.\n\n          DAVID\n          Okay. \"San Francisco.\"\n          0 He pronounces it like Oliver.\n\n           PET ULIA\n\n           DAVID\n          David doesn't answer her.\n\n          DAVID\n          (to Oliver)\n          What's your name?\n          (in bad Spanish)\n          What are you called?\n\n          OLIVER\n           (pronouncing it Spanish)\n          Oliver.\n\n           DAVID\n           (pronouncing it English)\n          Oliver.\n\n           OLIVER\n           (pronouncing it Spanish)\n          Oliver.\n          They begin laughing again. Petulia is becoming\n          t.\n          completely unnerved.\n\n          \n\n          \n\n          \n\n          \n\n          61\n\n          0 63 CONTINUED\n\n          PETULIA\n          David. The San Diego bus is due at twelve\n          fifteen. I've already bought him a ticket.\n\n          DAVID\n          We've got to get this on tape. He's really\n          something else'. I get a real kick out of him!\n          (imitating Oliver)\n          \"San Francisco.\" Unless he's a midget. Hey,\n          sure! Oliver is a sixty-three-year-old midgets\n          Oliver grins, not understanding but feeling he has an\n          ally.\n\n          DAVID\n          (to Petulia)\n          Get in. It's still a long drive. We'll\n          never get home.\n\n          PETULIA\n          Okay. He can wait inside. The cashier's a\n          sweet old dear. I'll have him keep an eye on\n          the ckeeky little bugger!\n          0 She opens the car door to take Oliver out, tense,\n          wanting to get past this moment but fearful that she won't.\n\n          DAVID\n          You promised \"Oliver\" \"San Francisco.\"\n\n          PETULIA\n          I did not.\n\n          DAVID\n          Like hell you didn't'.\n          David abruptly hops over the seat and sits behind the\n          wheel. He signals for Petulia to get in beside Oliver.\n          Petulia hesitates.\n\n          DAVID\n          I dig, bitch, I dig!\n          She's stunned. His hand reaches out and brutally jerks\n          her into the car.\n\n          DAVID\n          I dig.\n          CAMERA HOLDS on Petulia's frightened face. Now suddenly\n          0 the face has a tube in the nose; there's another tube in\n          her throat; and she's unconscious.\n\n          \n\n          \n\n          \n\n          \n\n          62\n\n          0 6L!. INT. EMERGENCY ROOM HOSPITAL\n\n          Half a dozen people are working to keep Petulia alive.\n          They're used to their work, it's no big deal for them.\n          Actually the feeling should be that they're as relaxed\n          as if they were mechanics working on a motor car.\n          Archie sits on a white stool in a corner, watching\n          everything, not as a doctor any more but as a\"deeply\n          involved man. When one of the doctors hits a vein by\n          mistake and murmurs \"Whoops .\" Archie can take no\n          more and leaves.\n\n          65 INT. DOCTORS' SHOWER ROOM\n\n          Archie sits on a little stone shelf, just letting the\n          water from the shower hit him.\n\n          BARNEY'S VOICE\n          Hey you.\n          Barney is looking over the shower door at Archie with a\n          mixture of concern and anger.\n\n          BARNEY\n          (shouting over sound of shower)\n          0 Did you know there's a policeman outside\n          wanting to talk to you?\n          Archie nods dully.\n\n          BARNEY\n          What the hell is going on?\n          Archie nods dully.\n\n          BARNEY\n          Can you have dinner with us tonight?\n          Archie nods dully.\n\n          66 INT. BARNEY' S DEN (LATE AFTERNOON)\n\n          Barney is working the film projector showing slides of a\n          recent holiday with Wilma and their daughter. Each\n          slide projects an enormous colored image against an\n          entire wall. Archie is slumped on a couch popping\n          peanuts into his mouth.\n\n          BARNS Y\n          You like this new lens, Archie? Is\n          this the greatest lens you ever saw?\n\n          0\n\n          \n\n          \n\n          \n\n          \n\n          63\n\n          66 CONTINUED\n\n           ARCHIE\n           Mrnmmmm?\n\n          BARNEY:\n\n          (ANNOYED)\n          What am I supposed to do -- spend\n          the money on belly dancers?i\n          Wilma enters from another room. She's exhausted,\n\n          .WI LMA\n          (to Barney)\n          Ask me what your daughter put in her\n          steam inhalator,\n\n          BARNEY\n          I don't want to know,\n\n          WILMA\n          Ask.me, Cottage cheese,\n\n          BARNEY\n          Actually I'm relieved,\n\n          0\n\n          WILMA\n          (to Archie)\n          I'm afraid she's madly in love with\n          your Stevie,\n\n          ARCHIE\n\n          (ABSENTLY\n          Steven.\n          Wilma looks at the pictures on the wall,\n\n          WILMA\n          Wasn't that a gorgeous week! I just\n          adore Big Sur!\n\n          BARNEY\n          It rained every day. You kept\n          insisting you were pregnant,\n\n          WILMA\n          (to Archie)\n          You must take Polo and the boys --\n          She stops embarrassed,\n\n          Â\u0080¢\n\n          BARNEY\n          Wilma-The-Magic-Talking-Machine. Put\n          a dime in and she talks all night.\n\n          \n\n          \n\n          \n\n          \n\n          64\n\n          66 CONTINUED\n\n          0 WILMA\n          I'm sorry Archie.\n\n          ARCHIE\n          Forget it.\n\n          WILMA\n          (she might cry)\n          I just can't think of you without\n          thinking of Polo.\n          Archie nods.\n\n          BARNEY\n\n          (REMINISCING)\n          Had to drive\n          Made me run a frog test on her.\n          forty miles in the rain. Almost hit a truck.\n          Could have been dead and buried three years.\n          Through this Barney keeps changing slides. Suddenly there\n          is a picture of Archie, Polo and Wilma on another vacation.\n          In this slide they are posing in corny T-shirts. The\n          T-shirts say, \"Kiss me you fool\" and \"I love the\n          Rolling Stones\"., etc.\n\n          BARNEY\n\n          Â\u0080¢\n          Oh, hey, I'm sorry.\n          Wilma looks very superior.\n\n          WILMA\n          I'll bet he's sorry.\n\n          BARNEY\n          There's nothing wrong with a little\n          old-fashioned nostalgia.\n\n          WI LMA\n          Do you remember that crazy Labour Day\n          weekend we drove to Tahoe?\n\n          BARNEY\n          (too quickly)\n          I've got them right her\n          Archie frowns at Wilma and Barney. But they are clumsy\n          and obvious, and he is somewhat touched.\n\n          BARNEY\n          I keep everything. They just happen to be\n          here. What do you think this is, a conspiracy?\n\n          E\n\n          \n\n          \n\n          \n\n          \n\n          6;\n\n          E\n\n          66 CONTINUED\n\n          ARCHIE\n          Yes,\n          Really they are all good friends, and they laugh good-\n          naturedly,\n\n          WILMA\n          Let's see them Archie.\n          Barney starts showing different slides of the Tahoe vacation.\n          Archie watches scratching his ear, and eating peanuts.\n          Wilma looks like the tears are about to start,\n          C.S. A child cries \"Mommy!\"\n\n          WILMA\n          (to Barney)\n          You go this time.\n          Barney goes, leaving the slide still showing on the wall.\n          Wilma looks at Archie for a long moment.\n\n          ARCHIE\n\n          (SHRUGGING)\n          â\u0080¢ Wilma what do you want me to say?\n          They were great old times,\n\n          WILMA\n          Archie what's happening to you?\n\n          ARCHIE\n          Nothing.\n\n          WILMA\n          Dontt say nothing -- the policeman\n          even called here!\n\n          ARCHIE\n          Itm sorry.\n\n          WILMA\n          I've had a splitting earache all day.\n          Friends have certain rights, even the\n          right to be obnoxious. Do you love\n          this woman?\n          Archie shrugs.\n\n           WILMA\n          i Well you must feel something.\n\n          ARCHIE\n          Yeah I guess so. Pity.\n\n          \n\n          \n\n          \n\n          \n\n          66\n\n          66 CONTINUED\n\n          0 W I LMA\n          Pity. Go to the dog pound. You'll find two\n          hundred dogs ready to be gassed.\n          Policemen.\n          Then Wilma sighs.\n\n          WI LMA\n          Shall I tell you something? I wish I\n          had your guts.\n\n          67 INT. INTENSE CARE UNIT DAWN\n\n          Archie is in Petulia's little cubicle slumped on a\n          chair, sound asleep. Petulia lies on the bed, tubes\n          protruding from arms and neck. She is still unconscious.\n          Archie is awakened by a nun entering the cubicle to\n          hook up another pint of blood. Archie's presence\n          disconcerts the nun. She can't show her annoyance\n          openly, but is so disturbed she does her work badly\n          this time.\n\n          NUN\n          Who would do such a thing to a girl like\n          this? She's a child. Is there an\n          orthopaedic problem, Dr. Bollen?\n\n          0\n          Archie doesn't answer.\n\n          NUN\n          A. doctor should get his sleep.\n\n          ARCHIE\n          You left the needle in.\n          The nun would like to scream at Archie about the\n          impropriety of his presence here but she can't.\n          She is proud of the bottle of blood.\n\n          NUN\n          From the Archbishop's Fund.\n\n          ARCHIE\n          Take the needle out.\n\n          \n\n          \n\n          \n\n          \n\n          67\n\n          67 CONTINUED\n\n          0 NUN\n          All races and creeds. Why hasn't her\n          husband been notified?\n\n          ARCHIE\n          I suppose they've tried.\n\n          NUN\n          It would be such a nice surprise to have his\n          picture here when she finally awakens.\n          Wouldn't that be nice?\n\n          ARCHIE\n          Yes,\n\n          NUN\n          It would give her some small comfort,\n\n          ARCHIE\n          I would put a bit more tape around the needle,\n\n          NUN\n          I mentioned her this morning in the chapel.\n          I mention all my criticals.\n\n          â\u0080¢ ARCHIE\n          In the future be more careful of the needle.\n\n          NUN\n          She hardly makes a bump under the sheets.\n          She leaves. Archie moves closer to Petulia examining\n          her throat and eyes for vital signs. He pushes open an\n          eyelid and Petulia's dead eye stares glassily into his\n          living face.\n\n          68 INT. HOSPITAL DAY\n\n          We spend awhile watching Archie function as a doctor,\n          moving through the wards, examining broken legs, arms,\n          or whatever. In one of these scenes we pass through\n          the orthopaedic room.\n\n          69 INT. ORTHOPAEDIC ROOM\n\n          Oliver is being given therapy in a whirling bath. He's\n          only one of some twenty patients and Archie barely\n          notices him, simply waving to him as he does to other\n          patients who don't need his care anymore. Oliver is\n          too frightened of the whirling bath to give a damn\n          about the doctor. Archie goes and we stay with Oliver.\n\n          0\n\n          \n\n          \n\n          \n\n          \n\n          68\n\n          69 CONTINUED\n\n          OLIVER'S ATTENDANT\n          Come on, come on, get on with it.\n\n          70 INT. A SMALL BEDROOM IN THE DANNER HOUSE\n\n\n          JUST BEFORE DAWN\n          Three weeks ago. Oliver is wide awake, wolfing down a\n          loaf.of bread that he has stolen from the Danner kitchen.\n          As he gnaws on the bread, he listens to indistinct\n          sounds from the master bedroom. moans and groans,\n          a sudden cry, all of which he supposes are the sounds\n          of love-making. He grins to himself in the dark.\n          Abruptly a door opens and Petulia is coming down the\n          hall. She has hastily put on a pair of slacks and a\n          blouse, and is struggling into a coat. Her hair is\n          tousled, her face filled with anguish.\n\n          71 INT. STAIRWAY DANNER HOUSE\n\n          Petulia is hurriedly taking the hurriedly dressed\n          Oliver down the steps. He is protesting. Before they\n          can reach the front door, the door of the master\n          bedroom opens. David is standing there in his\n          pyjama pants.\n\n          DAVID\n          Hey, \"San Francisco\"!\n          He pronounces it like Oliver does. He comes down\n          the steps, three at a time. He stops before the kid.\n\n          DAVID\n\n          (GENTLY)\n          I sure hope there's no hard feelings.\n          Oliver understands none of this, and of course David\n          knows this, but it doesn't stop him.\n\n          DAVID\n          It isn't a question of hospitality, I\n          want you to understand that. I feel\n          terrible. Dragging you all the way\n          up to San Francisco and then not even\n          showing you Fisherman's Wharf.\n          Comprehend.?\n          Petulia goes into the living room to find the keys\n          to the car.\n\n          DA VID\n          0 Hold it a minute!\n\n          \n\n          \n\n          \n\n          \n\n          69\n\n          0 71A INT. DANNER HOUSE LIVING ROOM DAWN\n\n\n          DAVID\n          (to Oliver)\n          What's the rushy Whereas the fire!\n          He stoops down beside the boy and shows him a\n          wrist watch.\n\n          DAVID\n          You've go to have some little memento.\n          Right?\n\n          PETUL IA\n          David, for God's sakes\n          The wrist watch is much too big for Oliver's skinny\n          wrist so David starts to fasten it around Oliver's\n          biceps. Even this is too skinny so David starts\n          fastening it around Oliver's lower leg. Oliver\n          has no idea what is happening, but his hustler's\n          heart tells him he is being given something very\n          valuable. Petulia is repelled.\n\n          DAVID\n          (to Oliver)\n          You see the basic problem is we just don't\n          have the room for all the folks my old\n          lady invites for a visit. Were kinda\n          short of room. I'd give you the shirt off\n          my back. I'm West-Texas and proud of it.\n          But start loading up the house with\n          make-believe kids, plus every Tom, Dick\n          and Harry whose one and only claim to\n          fame is that he knows how to do \"it\" --\n\n          72 EXT. DANNER HOUSE DAWN\n\n          Petulia begins sobbing, and trying to tug the boy\n          toward the lift.\n\n          DAVID\n          Hands off!\n          The watch won't fasten to the leg either. David\n          tries to fit it around the boy's neck. David begins\n          to cry.\n\n          S\n\n          \n\n          \n\n          \n\n          \n\n          70\n\n          72 CONTINUED\n\n          DA V1'D\n          It won't fit any place.\n          Petulia somehow gets Oliver into the lift and pushes the\n          button. which starts it moving upward.\n\n          DAVID\n          (calling up)\n          I don't want any hard feelings' It\n          was nothing personals Hey, we'll look\n          you up sometime; When we're down that\n          way., Have a real old-fashioned fiesta;\n          We'll have a ball; \"Oliver?\"\n          During the preceding speech we CUT to Petulia and Oliver,\n          Oliver, infuriated at Petulia, defiantly shows her that he\n          has David's watch in his fist.\n\n          OL I VER\n          He give me!\n          Petulia stares out toward the sea. Davis is still screaming\n          atl.them, and his voice sounds so unlikely in all the splendor\n          of morning coming to San Francisco.\n\n          0\n\n          73 INT, HOSPITAL'S UNDERGROUND GARAGE DAY\n          Archie is maneuvering his car out of his parking space when\n          he sees the nun of the Intense Care Unit cross to another\n          car driven by another nuns There are many cars with many\n          nuns zooming around,\n\n          ARCHIE\n          How's your patient?\n\n          NUN\n          Oh, Mrs. Danner.\n\n          ARCHIE\n          Mrs. Danner. How's Mrs. Danner?\n\n          NUN\n          She woke up awhile ago.\n\n          ARCHIE\n          She woke up?\n\n          NUN\n          Should .I have called you`d\n\n          0\n          Archie starts out of the car.\n\n          \n\n          \n\n          \n\n          \n\n          71\n\n          73 CONTINUED\n\n          ?N\n          She's asleep now. I'm, to buy her blue\n          Cornflowers and a hairbrush. Sister\n          Teresa phoned the police. Prayers help,\n          Dr. Bollena She asked for Mr. Danner.\n          I hope there's no orthopedic problem.\n          But really she's not all that bad, this nun, mostly she\n          believes that the sanctity of marriage happens to be true.\n          She is not unmoved by the look of exhaustion on Archie's\n          face.\n\n          NUN\n          Blue Cornflowers.\n          They exchange a smile.\n\n          NUN\n          I'm'also to go all the way across town\n          and deliver a message to the Mendoza\n          family, I'm to tell them everything\n          is okay. And give them this.\n\n          ARCHIE\n          Let me.\n\n          Â\u0080¢\n          He takes the envelope on which the address has been written.\n\n          7. EXT. MENDOZA HOUSE DAY\n\n          This is the house in which Oliver is boarding. Now, as\n          Archie drives up, there is no sign of anybody. Archie\n          crosses to the door, puzzled. He knocks on the door but\n          there is no answer. He goes around to the back. There's\n          an old car without wheels, butane tanks, other junk but no\n          sign of life. Archie knocks on the back door and finally\n          the door is opened. Beyond the screen door is the Mexican\n          we have seen earlier. He has been awakened from sleep and\n          is annoyed.\n\n          ARCHIE\n          Mr. Mendoza?\n          Mendoza yawns sleepily.\n\n          ARCHIE\n          I'm Dr. Bollen. Do you know Mrs.\n          Danner? Petulia Danner?\n\n          MENDOZA\n\n          Â\u0080¢\n          No hablo ingles. Lo siento.\n\n          \n\n          \n\n          \n\n          \n\n          72\n          74. Continued\n\n          ARCHIE\n          Petulia Danner. She gave me this\n          address,\n          The Mexican shakes his head in complete indifference, is\n          already thinking about going back to sleep, and starts\n          closing the door,\n\n          ARCHIE\n          She was beaten. Almost to death. Are\n          you Mr. Mendoza?\n\n          MEXICAN\n          \"Mendoza,\" si,\n\n          ARCHIE\n          (giving envelope)\n          This is for you,\n\n          MEXICAN\n          Gracia.\n          He starts to open the envelope. It contains a twenty dollar\n          bill,\n\n          ARCHIE\n          Can I talk to you for a minute?\n          Mendoza, with no idea what Archie is saying, starts closing\n          the door and pocketing the money.\n\n          ARCHIE\n\n          HEYP\n          He pounds on the door. The door opens. The Mexican says in\n\n          SPANISH:\n\n          MEXICAN\n          (in Spanish)\n          I work all night. Go away.\n          He closes the door. Archie pounds on the door again.\n          He hurts his hand. He sucks on the slight wound. He kicks\n          at the door. He crosses around to the front of the house,\n          A negro and a white teenager are passing.\n\n          ARCHIE\n          Do either of you fellows speak Spanish?\n          a NEGRO TEENAGER\n          I speak a lot of Polish, if it would be\n          any help, sir.\n\n          \n\n          \n\n          \n\n          \n\n          73\n          â\u0080¢ 74 Continued\n\n          ARCHIE\n          I've got to talk with this man in here.\n          A woman was almost beaten to death.\n\n          TEENAGER\n          Here?\n\n          ARCHIE\n          Not here.\n\n          TEENAGER\n          You said here,\n\n          NEGRO\n          Almost, but not quite to death, sir?\n\n          ARCHIE\n          Yes.\n\n          TEENAGER\n          Here but not quite here?\n\n          ARCHIE\n          Listen, just find a cop, huh;\n\n          â\u0080¢ NEGRO TEENAGER\n          He'd better speak Polish, sir. I'm on\n          a fantastic Polish kick.\n          The two chase each other down the street yelling \"Da:\" and\n          \"Paderewskii\" and even \"Yawohl;\", etc,\n          Archie looks at the house and then at his car and then at his\n          bruised hand. He's furiousâ\u0080\u009e A police car passes'. Archie\n          looks, but somehow can't bring himself to hail it. He\n          wonders why he let the police car pass. He goes back to his\n          car,\n\n          75 INTO INTENSIVE CARE UNIT DAY\n          Archie moves swiftly to the screened cubicle that held\n          Petulia. He goes inside. He stops short. An old man lies\n          in the bed with a rubber stop in his mouth to keep him from\n          swallowing his tongue until he regains consciousness. His\n          false teeth lie on the table beside him. Archie is plunged\n          deeper into the sense of the unreal.\n\n          76 INT. A HOSPITAL ROOM\n\n          Petulia is in a two-bedded room. She has blue Cornflowers\n          and a hairbrush. She is conscious now but looks quite wan.\n\n          I\n          In the next bed is a middle-aged lady looking at T.V.\n          Petulia sees Archie.\n\n          \n\n          \n\n          \n\n          \n\n          7.\n          â\u0080¢ 76 Continued\n\n          PETULIA\n          Why weren't you there when I woke up?\n          You better not say you were when the\n          bill comes, Dr. Bollen.\n\n          ARCHIE\n          Who is this guy, Mendoza? Why am I\n          always finding you in a different bed?\n          What are you?\n\n          PETULIA\n          Avery sick girl.\n\n          ARCHIE\n          Who beat you up?\n\n          PETULIA\n          What happened to your hand?\n\n          ARCHIE\n          Nothing happened to my hand.\n\n          PETULIA\n          I love your hands. I want plaster of\n          paris molds for bookcases. Bookends.\n\n          Â\u0080¢\n\n          ARCHIE\n          Did David beat you up? Was it Mendoza?\n          Why did you send him money?\n\n          PETULIA\n          I'm still very sick.\n\n          ARCHIE\n          I don't care.\n\n          OTHER PATIENT\n          This man is a doctor?\n\n          PETULIA\n          The world's best, madame\n          The patient turns her back on the two of them.\n\n          ARCHIE\n          Petulia,you're turning me into a nut.\n          Why hasn't David been here?\n\n          PETULIA\n          Ask me questions.\n\n          Â\u0080¢\n\n          ARCHIE\n          Petulia, is it possible for you to\n          tell the truth about anything?\n\n          \n\n          \n\n          \n\n          \n\n          REIPULIA\n\n          (DROWSILY)\n          so Mendoza was looking after Oliver\n          for nae She\" s our cleaning lady s\n\n          SISTER\n\n          ARCHIE\n          There was no Mrs o Mendoza Z\n\n          PETULIA\n          ' drowsily)\n          I had to have some place for him to\n          stay,, David would never have let e\n          bring him home\n\n          ARCHIE\n          Bring who home?\n\n          PETT LIA\n          Iqm beginning to hurt.\n\n          ARCHIE\n          Petuliag I don't understand the kind\n          of world you live ina Come on. For\n          Ghri.st$s sake, a\n          pretty young gi.rl9\n          what the hell is going on, who would\n          lay a hand on you, how could you get\n          so screwed up?\n          Through this Petulia simply lies there, just looking a\n          Archie.\n\n          ARCHIE\n          I cans t stand it.\n\n          PETULIA\n          Irm asleep. They gave me a pill.and\n          I' asleep,, Really0 I am really very\n          sleepy,, Can we talk later, Archie?\n          When ivm asleep kiss my forehead.\n          She closes her eyes and sleeps. Archie gives her fore-\n          head a kiss and she giggles. He leaves.\n\n          \n\n          \n\n          \n\n          \n\n          CHANGE\n\n          4/26/67\n\n          75AA\n\n          77 INTO ARCHIEBS APARTMENT NIGHT.\n          Furniture Is pushed back and three pup tents circle the\n          center of the room. Archie and his sons have been having\n          a camp-in. They are all dressed in jeans and sweat shirts\n          and Stevie even wears moccasins - as though they were in\n          the:High Sierras. The remainders of T.V. dinners are\n          scattered around plus. Coke bottles plus their bed rolls\n          from last night. Actually though it :rust: have sounded.\n          like a great idea the two bogs are very bored, Archie,,:\n          though trying to be \"with-it' is far away,, and they sense\n          it.\n\n          STEVIE.\n          Shouldn't we police the area?\n\n          ARCHIE\n          Good idea. Police the area.\n\n          MIKE\n          This is keen, Dad. Water canteens and\n          everything.\n\n          STEVIE\n          I'm out of water.\n\n          \n\n          \n\n          \n\n          \n\n          76\n\n          77 CONTINUED\n\n          ARCHIE\n          Always make sure you've got water.\n          You'll find some in the kitchen. What's\n          on T.V.?\n\n          STEVIE\n          I''m hot. In fact.\n\n          ARCHIE\n          Switch the fire off then.\n          Stevie goes to switch the electric fireplace off.\n\n          MIKE\n          It's really keen, Dad.\n          The bell rings and Polo is standing there, She looks around,\n          smiling.\n\n          POLO\n          I' don't believe it.\n\n          STEVIE\n          Even canteens, Mom.\n          0 Polo really only has eyes for Archie. She is troubled by\n          how haggard and worn he looks.\n\n          POLO\n          Roller Derby starts at eight.\n\n          STEVIE\n          We have to police the area.\n\n          MIKE\n          It's really been keen, Mom. Nobody\n          ever heard of a. camp-in.\n          The two boys now busy themselves with straightening out the\n          place as Polo crosses to-Archie,\n\n          ARCHIE\n          It's been really keen, Mom.\n\n          POLO\n          Poor Archie.\n\n          ARCHIE\n          Not \"dumb\" Archie?\n\n          0\n\n          \n\n          \n\n          \n\n          \n\n          77\n\n          77 CONTINUED\n\n          POLO\n          Never. The brightest. I used to have\n          such terrible anxiety that I would die\n          suddenly. Before I could say thank you,\n          Archie is very touched.\n\n          STEVIE\n          I have to go to. the latrine.\n          Stevie goes.\n\n          MIKE\n          Is Dad allowed to come to the Roller\n          Derby? I mean since Uncle Warren\n          couldn't?\n          He is so bad at matchmaking that Polo and Archie can hardly\n          keep a straight face.\n\n          78 INT. ROLLER DERBY\n\n          The place is almost empty, but the, fans are wildly\n          enthusiastic and are placed to look ;like thousands for the\n          T.V. camera. The women's team is on the rink, skating,\n          0 banging into each other with great good-natured brutality,\n          One of the skaters bucks another clear off the rink, smashing\n          through the rail.\n          The kids are in heaven, but Polo is so shocked she instinc-\n          tively turns-to Archie and buries her face in his shoulder.\n          Out of habit, he lets her, even touching the back of her'\n          head' comfortingly, assuring her no fatality has occurred.\n          Mike, the ace matchmaker, watches them with satisfaction.\n\n          MIKE\n\n          (SCREAMING)\n          Don't let'that old fat butt get awa\n          with tat;\n\n          POLO\n\n          (SHOCKED)\n\n          MICHAELE\n\n          MIKE\n\n          FAT BUTT;\n\n          POLO\n          (to Archie)\n          Will you please tell.your son --\n\n          0\n\n          \n\n          \n\n          \n\n          \n\n          78\n\n          78 CONTINUED\n\n          0\n          She turns to 4rchie and sees him watching the fighting\n          intently.\n          The women are really brutal with each other. One small\n          blonde lady is being, pummelled unmercifully by several\n          others. As her head twists and turns from the forest of\n          fists she seems to become Petulia.\n\n          STEVIE\n          I want to go home.\n\n          M IKE\n          They don't mean it.\n\n          STEVIE\n          I want some popcorn.\n\n          ARCHIE\n          I'll get it.\n          He rises quickly and moves to the refreshment counter behind\n          the grandstand.\n          Archie finds a telephone booth. Polo watches him at the\n          â\u0080¢ phone booth.\n          Her eyes lose their warmth.\n          The women's team races around the track. Archie returns with\n          a box of Cracker Jacks.\n\n          STEVIE\n          I said popcorn.\n\n          POLO\n\n          (COLDLY)\n          How is she? Dead I hope?\n          Archie is stunned at Polo's abrupt coldness.\n\n          ARCHIE\n          You don't even know her.\n\n          POLO\n\n          (COLDLY)\n          I just have to look at you.\n          ,Archie stops, remembering this is approximately what Petulia\n          had said about Polo. He does a \"how odd:\" without saying it.\n\n          \n\n          \n\n          \n\n          \n\n          79\n\n          78 CONTINUED\n\n          ARCHIE\n          She's not going to die.\n\n          POLO\n          What a shame.\n\n          ARCHIE\n          She has her first visitor. Mr. Danner.\n          Polo couldn't care less. Five skaters smash into each other\n          on the rink but Polo doesn't flinch. She wouldn't think of\n          turning to Archie for comfort.\n\n          ARCHIE\n          \"His Mastahs in'Hydraul:ics.\"\n          They sit coldly wit4 their children, a million miles apart.\n\n          79 INT. PETULIA'S HOSPITAL ROOM NIGHT\n\n          The Mr. Danner who is with Petulia is David's father.\n          Petulia lies in the bed staring straight ahead at an\n          enormous cotton giraffe, obviously a gift. The patient in\n          the next bed has three middle-aged girl friends visiting her.\n          They are playing bridge. Their presence frustrates Mr.\n          â\u0080¢ Danner. The other patient's T.V. set is on, and on the tube\"\n          we barely notice the continued violence of the outside world.\n\n          MR. DANNER\n          It's been a terrible shock to us...\n          to Mother and me,..Our sailor boy\n          and his pretty bride.\n\n          79A INT. FATHER DANNER'S LIVING ROOM\n\n          He stands at a great eye of a window. Mother Danner is\n          mournfully quartering apples for an apple pie.\n\n          MR. DANNER'S VOICE\n          As I told Mother, \"the values we lived\n          by just don't seem to mean anything at\n          all anymore. Our kids can chuck out\n          two thousand years of Western civilization\n          ..of Christianity...as though it wasn't\n          worth a red cent.'\n\n          \n\n          \n\n          \n\n          \n\n          80\n\n          0 79B INT. PETULIA'S HOSPITAL ROOM\n\n\n          MR, DANNER\n\n          (CONTINUING)\n          I must say Mother's answer surprised\n          and, well, really sort of tickled me:\n          \"It's easy to be an angel when you're\n          old and worn out and nobody wants you\n          anymore,\" You see we do try, Petulia.\n          I mean there you were in that man's\n          apartment. Where I come from ...in \"little\n          pockets of ignorance\" I suppose you'd call\n          it...you'll find people who still live by\n          the unwritten law.\n\n          790 INT. FATHER DANNER'S LIVING ROOM\n\n\n          MR. DANNER\n          There's still many a county courthouse\n          where the husband could kill both\n          parties and not spend one night in jail,\n          O.S. We hear SOUNDS of a bell ringing incessantly in short\n          bursts.\n\n          79D INT. PETULIA'S HOSPITAL ROOM\n\n\n          0\n          The bell is still ringing signifying the end of visiting\n          hours and the other patient's visitors sigh, put the playing\n          cards together and prepare to leave. Mr. Danner makes no\n          move to leave,\n\n          MR. DANNER\n          In the hospital of my dreams people\n          won't be chased out like sheep. People\n          are better than most of the medicines\n          they give you. David has finally'got\n          around to repairing that wharf. He hired\n          a couple of boys. The three of them are\n          really working up a sweat. He's thinking\n          of sailing all the way down the coast to\n          Lima. That's in Peru.\n          All through this there's no response whatever from Petulia.\n          Her eyes are fixed on the eyes of the giraffe.\n\n          MR. DANNER\n          They say Lima is a terrific city. If\n          you watch out for flies and take sensible\n          sanitary precautions. I'll tell you a\n          secret but don't you snitch: I'm using\n          propaganda on David so that the four of\n          0 us can go. Mother's a better sailor than\n          I am. Even though I served eighteen\n          months on a mine sweeper. Which should\n          have prepared me for anything.\n\n          \n\n          \n\n          \n\n          \n\n          81\n          79D Continued\n          A nun looks in.\n\n          NUN\n\n          (BRIGHTLY)\n          Visiting hours are over.\n\n          MR. DANNER\n          (taking his turmoil\n          out on the nun)\n          I had lunch with your Mr. Pearl less\n          than two weeks ago;\n          The nun looks blank.\n\n          MR. DANNER\n          Mr. Pearl happens to be the superintendent\n          of this Hospital; Two weeks ago at the\n          Blue Fox Restaurants Just the six of usl\n          The nun shrugs and leaves. Mr. Danner is really trembling\n          now from his controlled emotion. Petulia will not take her\n          eyes from the giraffe. The patient in the next bed is\n          grumbling something about \"what's sauce for the goose should\n          be' sauce for the gander\", etc. Mr. Danner abruptly takes a\n          â\u0080¢ small leather bound photograph from his pocket. It's the\n           wedding picture of Petulia and David. Without a word he puts\n           it on the night stand. Petulia will not look at it.\n\n           79E EXT. DAVID AND PETULIA DANNER HOUSE\n\n           The end of Sc. 72 is very quickly replayed.\n\n           80 EXT. BUS STATION DAWN\n\n          During Sc. 79E and 80 we continue to hear Mr. Danner:. Its\n          a tiny bus station and hardly anyone is around this time of\n          mo'rnin'g. Petulia waits with Oliver who is very annoyed at\n          what has been done to him. A few other early travelers are\n          about.- As the bus comes into sight, Oliver, grasping his last\n          chance of freedom, suddenly darts away. IN A SERIES OF\n          FLASHES we see Oliver; hit by a car; the look of agony on\n          Petuliaa's face; the reaction of the spectators; and finally\n          the ultimate image: the boy pinned under the wheel.\n\n          MR.. DANNER'S VOICE\n          (during preceding scene)\n          David and I went at it hot and heavy.\n          About the value of psychiatry. I mean\n          sensible psychiatry. None of that \"Sex-\n          is-the-reason-for-everything\" junk. It\n          E won't ever replace a visit to the wood-\n          shed and a good whack across the backside,\n          but its late in the old ball game for that.\n\n          \n\n          \n\n          \n\n          \n\n          82\n           81 JN 7-1 o PETULIA'S HOSPITAL ROOM NIGHT\n          â\u0080¢ The nun reappears.\n\n          NUN\n          I'm sorry Sir, but it's time for the\n          lady's medication.\n\n          MR. DANNER\n          Does anyone ever report how filthy\n          this room is?\n          He loses all his aplomb, He squats, he points, he finds\n          imaginary objects on the floor.\n\n          MR, DANNER\n          Look at this'. Look at this! I\n          personally raised fifty thousand\n          dollars for this Hospital during\n          the last campaign. You didn't\n          know that did you; Well ask Mr,\n          Pearl'. I mean if you knew what\n          he looked like'. Filthy'.\n          He gets up to go, The nun leaves, Mr. Danner brushes\n          imaginary dust from his knees. He's perspiring, dis-\n          hevelled, and still hasnÂ°t said what he came to say.\n          He waits there a moment more, Finally in a flat voice\n\n          40\n          without even looking at him:\n\n          PETULIA\n          Tell David, it's alright. He can\n          come out of the cupboard.\n          The old man almost sobs. Instead he exclaims in a\n          jolly voice.\n\n           MR. DANNER\n           Chin up'.\n\n          81A ROLLER DERBY\n          This time we are with the T.V. CAMERAMAN, and we are\n          looking through his scanner. We see all the excited\n          people, but among them sit Archie and Polo, as cold as\n          death. Suddenly, on the scanner, we see Polo rise and\n          begin to leave tugging the two boys along with her,\n          Archie makes no move to stop them.\n\n          82 INT. HOSPITAL CORRIDOR DAY\n\n          Archie wearing his white doctor's smock enters\n          Petulia's room.\n\n          \n\n          \n\n          \n\n          \n\n          83\n\n          83 INT. HOSPITAL ROOM\n\n\n          0\n          The'bed where the second patient lay is empty. In\n          Petulia's bed is the withered old man who earlier had\n          taken Petulia's place in the Intense Care Unit. He's\n          quite chipper now but is in many splints and braces.\n\n          OLD MAN\n          I'm not sick! Don't waste time on me!\n          Archie turns to face the nun in attendance.\n\n          ARCHIE\n          Where is she?\n\n          NUN\n          Mrs. Danner? They picked her up.\n          Dr. Worthington said it was alright\n          so long as she had proper nursing.\n\n          ARCHIE\n          Who picked her up.\n\n          NUN\n          Her husband I suppose.\n\n          ARCHIE\n\n          0\n\n          DANNER\n\n          NUN\n          They had a long talk with Dr. Worthington.\n          He seemed entirely satisfied.\n\n          ARCHIE\n          They kidnapped hero\n          He hurries down the hall. The'nun is startled.\n\n          OLD MAN\n          Take care of the sick people! I'm\n          in tip-top shape!\n\n          81E EXT. DANNER HOUSE DAY\n\n          Archie hops off the lift as it reaches the bottom of the\n          cliff. At the front of the house we see David and two\n          colored men at work on the wharf. At the wharf is the\n          yacht. Archie racies up to the nearest door and begins\n          ringing the bell.\n\n           85 INT. THE MASTER BEDROOM\n\n           Petulia couldn't be lovelier, or happier. She's in a\n\n          IS\n          special hospital bed. There are flowers everywhere. She\n          has her own colour T.V. set which is silently showing\n          scenes of violence. An efficient nurse is in attendance.\n\n          \n\n          \n\n          \n\n          \n\n          84\n\n          85 CONTINUED\n          0 The nurse is sitting at the foot of the bed, and Petulia\n          is brushing the nurse's hair.\n          Archie stands in the doorway overwhelmed at the normality\n          of it all. Obviously Petulia has fixed her hair too.\n\n          PETULIA\n          Hi Archie.\n          Dazedly Archie crosses to the night stand where there\n          is a pitcher of tomato juice. Because he has nothing\n          else to do he sniffs the tomato juice,\n\n          PETULIA\n          (to nurse)\n          This is Dr. Bollen of the Hospital.\n          He's a splendid doctor,\n          (to Archie)\n          This is Agnes Lillywhite.\n\n          NURSE\n          Our young lady is doing nicely. We\n          have a few problems, but nothing\n          serious.\n\n          PETULIA\n          â\u0080¢ I get hiccups.` I go along merrily\n          hiccupping for hours on end.\n\n          ARCHIE\n          Why did you leave the hospital?\n\n          PETULIA\n          I was feeling ever so much better, Archie.\n          Mrs. Danner looks in. She is wearing an apron and\n          stirring a batch of something.\n\n          MRS. DANNER\n          Will you be staying for lunch, sir?\n          Goodness knows there's plenty of meatloaf.\n          She goes and David enters. He looks extremely handsome.\n          He wears white duck pants and a slip-over sweater. And\n          a happy-go-lucky grin.\n\n          PETULIA\n          You two haven't met.\n          (to David)\n          This is Dr. Bollen.\n\n          0\n\n          \n\n          \n\n          \n\n          \n\n          85\n\n          85 CONTINUED\n\n          0\n\n          DAVID\n\n          (CHEERFULLY)\n          Yes, I thought so. Hello, there!\n          David sees that Archie has no intention of shaking\n          his hand, so he crosses to the bed and begins to\n          playfully Drank Petulia up and down.\n\n          ARCHIE\n          (to Petulia)\n          I want you to go back to the hospital.\n\n          DAVID\n          Dr. Worthington says she's doing fine.\n          He's going to make daily house calls.\n\n          PETULIA\n          He's very good about that.\n\n          ARCHIE\n          Petulia _mÂ® !\n          During this Mr. Danner has entered. He is really the\n          only one not good at the charade.\n\n          0\n\n          PETULIA\n\n          (CHEERFULLY)\n          Well, you're finally meeting our\n          whole family.\n\n          MR. DANNER\n          Dr. Bollen, I wouldn't exactly call\n          this good taste. Not to mention\n          medical ethics.\n\n          DAVID\n          Dad, you old fuddy-duddy, things happen.\n          Archie suspects he is having a nightmare. With the\n          exception of Mr. Danner, he has never seen so many\n          cheerful people in one place.\n\n          ARCHIE\n          (to Petulia)\n          You told the policeman you had a\n          dizzy spell.\n\n          PETULIA\n          Right. I fell on my bottom.\n\n          0\n\n          \n\n          \n\n          \n\n          \n\n          86\n\n          85 CONTINUED\n\n          0 ARCHIE\n          You were beaten up. You were somebody's\n          punching bag.\n\n          MR. DANNER\n          won't have you cross-examining this\n          girl.\n\n          ARCHIE\n          Your son nearly killed this girl.\n\n          DAVID\n\n          (FRIENDLY)\n          Hey now listen, doe, I'll stand still\n          for only so much.\n\n          MR. DANNER\n          (to the nurse)\n          I want you to remember what this man\n          just said.\n          (to Archie)\n          Though it's none of your business, my\n          boy was in Baton Rouge, Louisiana.\n          Looking at boats.\n\n          PETULIA\n          We've decided we're quite happy with\n          the one we have.\n\n          DAVID\n          When Dad phoned me I was having dinner\n          with a cousin of ours. Real mouth-\n          watering Creole cooking.\n          He and Petulia chuckle at each other as though this\n          were some kind of private joke. Archie crosses to\n          Petulia and just stands there looking at her. He\n          doesn't know what to do.\n\n          PETULIA\n\n          (HAPPILY)\n          I'm fine Archie. Except I burp a lot.\n          Everybody gets dizzy spells.\n          Archie looks incredulously from Petulia who has resumed\n          brushing the nurse's hair; to David; to Mr. Danner who's\n          obviously annoyed at Archie's bad taste; to Mrs. Danner\n          who is in the dining room setting up an extra place\n          for Archie. What can he do? Abruptly he rushes from\n          the house.\n\n          \n\n          \n\n          \n\n          \n\n          87\n\n          86 EXT. HOUSE\n\n          Archie runs toward the lift that will move him up the\n          cliff. He can't get away fast enough. He climbs into\n          the lift and pushes the button. The lift begins moving,\n          but too slowly for him. He hops off the lift and begins\n          scrambling up the side of the cliff.\n\n          87 INT. PETULIA'S BEDROOM\n\n          Petulia looks out the window and sees Archie scrambling\n          up the cliff, She fits a curler into the nurse's hair.\n\n          PETULIA'S VOICE\n          Going back to the house was the only\n          thing I could do.\n           scenes 87A B D .,and E occur only in Petulia's mind.\n\n          87A EXT. ATOP CLIFF DAY\n\n          Petulia is waiting for Archie at the top of the cliff\n          as he staggers toward her. Since everything is taking\n          place in her mind, this is how Petulia really is.\n\n          PETULIA\n\n          (CONTINUING)\n          Where else could I go? A lonely hotel\n          room? I don't have a penny of my own.\n          Mr. Danner promised me I'd never be left\n          alone. I thought I'd try it for a few\n          days. Don't be-angry. It was nobody's\n          fault. Actually, if anyone is to blame,\n          it's you, Archie.\n\n          ARCHIE\n\n           (GASPING)\n           Me?I.o\n\n          87B INT. FAIRMONT HOTEL NIGHT\n\n          Petulia now recreates the moment when she first met Archie.\n          Archie is searching through his pockets for the ticket\n          to reclaim his coat, Petulia rushes up to him, with\n          none of the fake nonsense of the actual meeting, but\n          with absolute desperation. Archie is dressed as he\n           is on the hill (Scene 86).\n\n           PETULIA\n           I'm Petulia Danner . save me like\n           you saved Oliver ... save me from David!\n           Don't lust scramble up the hill like a\n          â\u0080¢ b oody fool o\n\n          \n\n          \n\n          \n\n          \n\n          88\n          87B Continued\n          Archie is stunned.\n\n          ARCHIE\n          I'm looking for the ticket for my raincoat.\n\n          PETULIA\n\n          NOL\n\n          87C INT. PETULIA'S BEDROOM\n\n          From her bedroom window Petulia watches Archie scramble\n          up the hill.\n\n          PETULIA'S VOICE\n          Coming for me in that pokey little car.\n\n          87D EXT. A BEAUTIFUL COUNTRY ROAD DAY\n\n          In Petulia's mind, a great white ambulance is moving\n          majestically through towering trees, carrying Petulia\n          to safety.\n\n          PETULIA'S VOICE\n\n          (CONTINUING)\n          9 Why didn't you bring a proper ambulance?\n          As though you really meant it.\n\n          ARCHIE'S VOICE\n          I didn't know what to do. I was going\n          from one moment to the next.\n\n          PETULIA'S VOICE\n          Spectacular entrance, lousy exit. Sounds\n          familiar, Archie.\n          Suddenly all the anger goes out of Petulia.\n\n          PETULIA'S VOICE:\n          No, it's not your fault.\n\n          87E THE GOLDEN GATE BRIDGE DAY\n          Petulia dismisses the ambulance from her mind because\n          she has something very serious to say to Archie. She\n          is with him on the rocks below the bridge.\n\n          PETULIA\n          I went back to the house because I owed it\n          to David. I have a brown thumb when it\n          comes to men. I put them on the Cross and\n          call them Jesus. And there they hang. I\n          don't know why I do it. Not because of any\n          high opinion of myself... oh, Archie, if you\n          only knew...\n\n          \n\n          \n\n          \n\n          \n\n          89\n          87E Continued\n          She looks up at the bridge and instantly creates David\n          standing there. An incredibly heroic figure in a white\n          blazer and turtle neck sweater. Yet somehow we must\n          sense that despite how grand David looks, at any moment\n          in Petulia's mind he may leap to his death.\n\n          PETULIA\n          Look at him. Isn't he super. A six foot\n          three Coca Cola bottle. Empty. I did\n          that. I'd ruin you, Archie.\n\n          87F INT. BEDROOM\n\n          We are now back in visual reality with Petulia, and\n          the playful David who is trying to make Petulia laugh,\n          which she does.\n\n          PETULIA'S VOICE\n          David was the gentlest man I ever knew.\n\n           88 EXT. CLIFF\n\n           Archie has neared the top of the cliff. His pants are\n           ripped, his hands are scraped, he is gasping in anguish.\n\n          Â\u0080¢\n\n          PETULIA'S VOICE\n          I'd ruin you. In five weeks, I'd be\n          running around with a black eye.\n          By now, Archie has reached the top of the cliff and is\n          a complete mess. He turns for one last look at the\n          Danner house and the yacht beyond. He shakes his fist\n          maniacally.\n\n          89 EXT0 MUIR WOODS DAY\n          During the following SEQUENCE OF SCENES Archie is\n          trying to get back to normality. He's having a nice\n          sensible talk with Warren Smith, Polo's fiance. It\n          is a pleasant sunny day and a group of Indian boys are\n          being told about the forest by an Irish guide. In the\n          background Archie's two children are playing with\n          Warren's child.\n\n          WARREN\n          It's never too soon to think of the\n          boys' education.\n          Warren winks at him knowingly.\n\n          ARCHIE\n          Have you thought of doing something\n          about that?\n\n          \n\n          \n\n          \n\n          \n\n          90\n\n          89 CONTINUED\n\n           WARREN\n           What ?\n\n          ARCHIE\n          ; ; ^ ^ ï¿½ï¿½ï¿½,, That twi Lch v v d.\n\n          WARREN\n          What twitch? I don't have a twitch.\n\n          ARCHIE\n          You do. Come and see me. Don't touch\n          it, it'll give you a phobia. I'll fix\n          it for free.\n\n          WARREN\n          Thanks, I will. You know, I like you\n          more t han I ever thought I would.\n\n          ARCHIE\n          Warren, you're a beautiful human being.\n          They turn to watch the boys at play.\n          Nearby, the guide is explaining something to the Indians.\n\n          INDIAN CHILD\n          What happens next?\n\n          GUIDE\n          Spring.\n          Archie smiles hoeefully.\n\n          90 INTO A MARVELOUS RESTAURANT NIGHT\n          Beyond is the entire shockingly beautiful panorama of\n          San Francisco. Archie and May are having champagne\n          cocktails. They clink glasses and look at each other\n          through candlelight. Archie spills some of his cock-\n          tail but May doesn't spill a drop. Archie smiles\n          hopefully.\n\n          91 INTO DISCOTHEQUE NIGHT\n          Archie dances with many girls, some hippies, some chic,\n          all terribly young and unsmiling. Archie smiles\n          hopefully.\n\n          \n\n          \n\n          \n\n          \n\n          92 EXT. A SA111'\n\n           For the first EQ ENCE BEGAN Archie is\n           not smiling. He _L z ri g at Petulia. Archie and his\n           boys are riding on ou side of a cable car. The car\n          has stopped at the t p of the hill as has the car going\n          the other way. in the other car is Petulia by herself.\n          Petulia waves f.rst. Archie waves back. Petulia has\n          shopping parcels.\n\n          AR C HIE\n          You look better.\n\n          PETULIA\n          Feel marvelous. Michael and Stevie?\n          Archie nods,\n\n          ARCHIE\n          We?-re going to see the penguins.\n          Everything okay with your\n\n          PETULIA\n          Oh yes, fine.\n          The cars start down their separate ways.\n\n          93 INT. PENGUIN PLACE DAY\n\n          Thirty penguins march around the rim of their pool to the\n          music of Pomp and Circumstance. Through the Public\n          Address System, a voice explains that the penguins\n          represent all nations and are gathered 'here for their\n          own Olympics which they originated two million years ago,\n          when penguins were nine feet tall and great athletes.\n          Archie senses someone staring at him, turns and sees\n          Petulia sitting in the grandstand with her parcels. He\n          tries to ignore her by concentrating on his kids, but\n          he cannot. Actually, he doesn't want to ignore Petulia.\n          He looks back, she is still there, smiling happily.\n          Archie gestures for the boys to stay where they are, then\n          starts toward Petulia.\n          The penguins are now going through various acrobatics\n          while the narrator is telling more about their exotic\n          origins. Archie stumbles through laughing children,\n          ruins a tourist's snapshot, etc., until he finally reaches\n          Petulia.\n          Now one penguin is pushing another penguin in a baby\n          carriage. Everyone thinks it's adorable.\n          Archie sits beside Petulia not really knowing what to say.\n          He hasn't decided whether to be angry that she has followed\n          him,- or amused, or delighted -- or all three.\n\n          \n\n          \n\n          \n\n          \n\n          92\n\n          0 93 CONTINUED\n          Now the taped music is blaring a Loud marching song as\n          the penguins lumberingly form into a Roman legion, The\n          laughter,, music and applause ?make any intimate conversa-\n          tion almost impossible. But Petulia is waiting for\n          Archie to say something.\n          Archie sees that Mike has turned from the penguins to\n          stare at his father accusingly. Mike won't stop staring.\n          Mike now tries to make Stevie turn and look accusingly\n          with him, Archie doesn't know what to do0\n          Finally, Petulia rises and gathers her parcels,, still\n          quite pleasant. She drops a parcel and Archie retrieves\n          it for hero Its from a sportswear shop,, colorful and\n          gay. As Archie gives Petulia the parcel, she touches\n          his hand, running her fingers lightly over his skin,\n          thoughtful, as though wanting to remember something.\n          Petulia moves quickly through people toward the exit.\n          Archie almost calls her back, but there is too much noise.\n\n          9. INT. CORRIDOR ARCHIE'S APARTMENT DAY\n\n          Archie is returning from work, weighted down with\n          books for his research, plus miscroscope.\n          He sees his apartment door ajar. His heart stops.\n          He kicks his door open with his foot, not daring to\n          think who will be inside.\n\n          95 INT. ARCHIE'S APARTMENT\n\n          No, you're wrong. Its not Petulia. Two elderly\n          gentlemen in spotless dungarees are just finishing\n          installing a portable greenhouse in Arc hie's living\n          room. The Mexican paper flowers have been carefully\n          moved.\n\n          FIRST GENTLEMAN\n          Oh, oho We were supposed to be out of\n          here before you came home, Dr. Bollen.\n          So you'd think it came from Santa Claus,\n          The two elderly gentlemen chuckle at Archie's puzzled\n          look.\n\n          \n\n          \n\n          \n\n          \n\n          93\n\n          95 CONTINUED\n\n          FIRST GENTLEMAN\n          Wonderful. i.sn g t - t ? They sell like\n          hot cakes. Gives you something alive\n          in all this stone.\n\n          ARCHIE\n          There must be some mistake.\n          He sags down on a chair, draped in his research books.\n          The two old gentlemen couldn't be more pleased.\n\n          FIRST GENTLEMAN\n          Mac and I get a, big kick out of people's\n          first reaction. Its not a toy. It's\n          a working greenhouse. You control heat\n          and humidity with these.\n          (he indicates dials)\n          You've got a little bit of everything.\n          Ornamental plants,, Zinnias, Asters.\n          Even a little vegetable garden. The\n          most important thing to remember is\n          to keep the sun out. These new kind\n          of lights work so much better, there's\n          no comparison.\n\n          Â\u0080¢\n\n          ARCHIE\n          You've got the wrong apartment l\n\n          FIRST GENTLEMAN\n\n          (CHEERFULLY)\n          No we have not s Dr. Bollen3\n\n          ARCHIE\n          What screwball ...?I\n          Then he stops, He knows what screwball.\n\n          ARCHIE\n          No gift card?\n\n          FIRST GENTLEMAN\n          It might come by mail.\n          Archie starts chuckling. He crosses to the green-\n          house, still chuckling.\n\n          \n\n          \n\n          \n\n          \n\n          9L.\n\n          95 CONTINUED\n\n          Â\u0080¢\n\n          ARCHIE\n          This one heat, and this one humidity,\n          right?\n\n          FIRST GENTLEMAN\n          Exactly. We've left a manual of\n          operations, and wetll check everything\n          out in a month. Okay, Dr. Bollen?\n\n          ARCHIE\n          (still chuckling)\n          Okay, okay! Goodbye,'\n          He enters the greenhouse, having to stoop almost double, as\n          the two old gentlemen exit from the apartment.\n\n          96 INT. GREENHOUSE\n\n          Though extremely uncomfortable, Archie is entirely happy.\n          Suddenly he is ripping up flowers and vegetables to make a\n          kooky bouquet. He is positively exultant. He adds radishes\n          and turnips to the bouquet. This is the happiest we have\n          ever seen Archie.\n\n          Â\u0080¢\n\n          97. EXT. DANNER HOUSE DAY\n\n          Archiets car is parked on the cliff.\n          The Danner house is dark, deserted, abandoned.\n          Archie is standing by himself on the wharf bouquet in hand.\n          The yacht has gone. And so has Petulia.\n          Archie feels utterly alone, and as a matter of fact, he is.\n          He tosses the bouquet into the water. The lettuce floats.\n\n          97A EXT. THE YACHT DAY\n\n          Theoretically, we should be at some flea bag port in South\n          America. Mostly, we SEE the yacht.\n\n          40\n\n          \n\n          \n\n          \n\n          \n\n          95\n\n          0\n          97A Continued\n          Petulia is sunbathing on the yacht. She looks much better\n          now. Weeks have passed, she has a golden tan. Beside her,\n          a transistor radio has picked up a local broadcast which\n          would be in either Spanish or Portuguese and which consists\n          mostly of music.\n          David hops onto the yacht carrying a bag of groceries.\n          He, too, is deeply tanned, marvelously healthy, but somehow\n          uneasy.\n\n          DAVID\n          Hi.\n\n          PETULIA\n          Did you get mama on the plane all right?\n\n          DAVID\n          Sure. But what a dinky plane. Poor\n          mamats stomach problems are far from over.\n          He enters the cabin. Petulia sits up after a moment, looks\n          about, sees no one else, then then in alarm peers into one\n           of the windows that looks down into the cabin.\n\n          Â\u0080¢\n\n           97B INT. CABIN\n\n          David is stowing food into the refrigerator.\n\n          PETULIA\n          You didn't leave papa alone in that\n          horrible little town?\n\n          DAVID\n          It's not such a horrible little town.\n          (he holds up a can)\n          Hearts of artichokes'\n\n          PETULIA\n\n          (UNEASILY)\n          David...\n\n          DAVID?\n          Take your \"Vitamer Zed,\" you blinkint\n          Limey.\n\n          Â\u0080¢\n\n          \n\n          \n\n          \n\n          \n\n          96\n          0 97B Continued\n          He uses the English way of saying \"vitamin,\" and then a bit\n          too rakishly he tosses an orange up through the window.\n          Instinctively, Petulia makes an effort to catch, misses,\n          and it hits her lightly on the shoulder. Though it causes\n          no damage,'David is suddenly in terror. He races up out\n          of the cabin to Petulia.\n\n          97C EXT. YACHT DAY\n\n          David rushes to Petulia. Of course the orange did no damage\n          whatever, but there is an abrupt tension between them. He\n          flops down beside her and begins peeling the orange,\n\n          DAVID\n          Papa went with her at the last minute.\n          Petulia REACTS, shocked.\n\n          DAVID\n\n          (CONTINUING)\n          She was so pale and seared. They aren't\n          even pressurized. The plane. You suck\n          on a tube and hope it's oxygen.\n\n          S\n          During this he has peeled the orange and torn it into\n          segments, which he now tries to feed her.\n\n          DAVID\n          Open.\n\n          PETULIA\n          How could he have gone? Just like that?\n\n          DAVID\n          Where mama is concerned, papa is a very\n          loving man. Open.\n          Instead, Petulia jumps frightened to her feet, She seems\n          about to leave the yacht.\n\n          DAVID\n          Please don't.\n\n          PETULIA\n          He Dromised;\n\n          DAVID\n          Honey. It'll be okay, Cross my heart.\n\n          0 PETULTA\n          He promised.\n\n          \n\n          \n\n          \n\n          \n\n          97\n          0 97C Continued\n          A middle-aged couple are passing by on their way to their\n          luxurious yacht which is anchored close by. They are\n          trailed by a rather tacky Mari-ache trio,\n\n          W OMAN\n          Hello there you gorgeous people.\n          Everyone's invited for Margueritas\n          and cha-cha-cha.\n\n          PETULIA\n\n          (DAZEDLY)\n          Mr. and Mrs. Danner are gone,\n\n          WOMAN\n          (a`s corny as this)\n          Oooh la la; Lucky you;\n          The group goes off, toward their yacht. Petulia doesn't know\n          what to do. David skims off his jeans and jackknifes into\n          the water. The sun glints on his exquisite body. Confusedly,\n          Petulia pops a segment of an orange into her mouth. David\n          surfaces from the water laughing up at her. He looks great.\n\n          97D EXT. YACHT NIGHT\n\n          Petulia and David are returning from the other yacht. They\n          are dressed casually, but very well. David is completely\n          happy. Petulia is uneasy -- uneasy hell, she's frightened\n          out of her wits. From the other yacht we still hear the\n          SOUNDS of the Mariache trio and people squealing with delight\n          David is humming along with the music.\n\n          PETULIA\n          We didn't have to come back this early..\n\n          DAVID\n          You're still not one hundred per cent\n          well.\n          They've reached the cabin. He enters. She waits outside.\n          Suddenly his hand is around her wrist, somewhat too hard, and\n          in a gesture he hopes is playful, he pulls her down the steps\n          into the cabin.\n\n           97E INTO CABIN\n\n           DAVID\n           Icy hands.\n\n          0\n\n          PETULIA\n          Warm heart.\n\n          \n\n          \n\n          \n\n          \n\n          98\n          97E Continued\n\n          10\n\n          DAVID\n          So they say,\n          Petulia says nothing. She begins undressing,\n\n          DAVID\n\n          (CONTINUING)\n          I didn't tell papa to leave.\n          She doesn't answer.\n\n          DAVID\n\n          (CONTINUING)\n          He only had the clothes on his back.\n          She doesn't answer.\n\n          DAVID\n\n          (CONTINUING)\n          I didn't.want him to leave.\n\n          PETULIA\n          All right, David.\n\n          â\u0080¢ DAVID\n          \"All right, David,\" through chattering\n          teeth.\n          Petulia crawls under the sheet of a bunk.\n\n          DAVID\n          Only a crazy man hits a woman. Or a\n          coward. T won't ever again. I'd\n          stick my hand into a garbage disposal.\n          I would, Petulia. I'd grind it up,\n          Petulia lies under the sheet, silent, rigid, David\n          abruptly crosses to a cabinet and takes out a signal flare\n          pistol. He snaps in a flare and tosses it at Petulia.\n          She sits up in panic.\n\n          DAVID\n          Hang on to it. If I come for you let\n          me have a flare. Between the eyes.\n          I'll melt in ten seconds.\n          Petulia is touched.\n\n          0\n\n          \n\n          \n\n          \n\n          \n\n          99\n          97E Continued\n          ï¿½ï¿½;IULï¿½iA\n          I couldn't do that, Youtre too beautiful\n          to melt.\n\n          DAVID\n          (suddenly angry)\n          Girls are beautiful,\n\n          PETULIA\n\n          (GRINNING)\n          So are centaurs, unicorns, minataurs,0.\n\n          DAVID\n\n          (GRINNING)\n          , ,astron.uts, short order cooks, trumpet\n          players,,,\n\n          PETULIA\n          Cavalry officers, aging poets, men of\n          science,,.\n          They are enjoying the nonsense. Then on \"Men of Science':\n\n          0 97F DAVID'S IMAGE:\n          His finger is pressed against the doorbell over which is\n          the nameplate \"DR, A. BOLEN.\" The door finally opens and\n          Petulia is standing there in Archie's hooded sweatshirt.\n          Her eyes widen in terror as David enters Archie's apartment.\n          She knows he has come here to kill her,\n          97G The image ends. David is abruptly withdrawn, but Petulia\n          is carried away by memory.\n\n          PETULIA\n          The first time I saw you, you were being\n          charming to- somebody who didn't buy a\n          boat after all, You were wearing a light\n          blue turtleneck sweater. Your sunglasses\n          wÂ®re'pushed up into your hair. You had\n          sandals, but'-no socks. Trying. to sell a\n          forty foot yacht without socks. I had\n          never seen anything so perfect. \"He's\n          not real. He's one of those plastic\n          gadgets Americans do so well. Ah, but\n          I want one.\"\n\n          \n\n          \n\n          \n\n          \n          w _ has c r ` .e r.; I. u aa!= radars g 'e\n\n           ;R; R 'N\n           _ ;b.v st a t.base are rbi w s\n           Gt A.,I., b f t' m \"` ..a. '_ aH i e e Y .\n\n           G\n           eï¿½ is'\n           tb w y. arS 7c a , 4 ï¿½'â\u0080\u009eylergency Ox\n          mi ea e, l L scent!\n          They\" re very\n          sii ?â\u0080¢,;' erï¿½.}r f tma y .\n           X47 :Lid.`\n           Honey, yll Yarre about uha\n           __ Ancnis and 2010 are\n          mmarv. and , ._ r a 5 an Outsi ?5'.C\n\n          F;}LO\n          W at was their name?\n          -.7 well mote\".\n\n          POLO\n          No! exact i phy. -o\n\n          ARGHT\n           3so Z tt: i i iÂ£ \" r e z niked.yt z 1:tdden-=: yrE: QU,\n           Warres I s bein :el oat. Big will r_ot .sae w63y\n          -nocs u ses in Wyly o Warr e jo ' in t-o .iect ng\n\n          \n\n          \n\n          \n\n          \n\n          101\n\n          98 CONTINUED\n          Then Petulia sees Archie beside her bed. He is wearing\n          his hospital jacket which gives him the run of the place.\n\n          PETULIA\n          They can't keep any secrets around here.\n\n          ARCHIE\n          When did you get back?\n\n          PETULIA\n          A year ago. You didn't forget me,\n\n          ARCH IE\n          How could I? All those laughs.\n          He dabs a Kleenex on her sweat-beaded face.\n\n          ARCHIE\n          So, Things go better with Mr. and Mrs. Danner,\n\n          PETULIA\n          Obviously,\n          They look at each other tenderly.\n\n          Â\u0080¢\n\n          PETULIA\n          Why did you let me get away?\n\n          ARCHIE\n          Bad timing. Dumb Archie.\n\n          PETULIA\n          Girls like me are very rare, Archie\n          Archie cannot endure this,\n\n          ARCHIE\n\n          (SUDDENLY)\n          I could.call an ambulance. Take you to a\n          private hospital in Oakland. If we didn't\n          make it in time, so what, I don't know\n          how many babies I delivered as an intern.\n\n           98A EXT. THE AMBULANCE DAY\n\n\n           FOR AN INSTANT WE SEE PETU LIA'S IDYLLIC AMBULANCE\n\n           AGAIN CARRYING HER TO HAPPINESS,\n\n           DAY\n\n           98B INT. LABOR ROOM\n\n\n          40 ARCHIE\n          There's nothing to it. Especially a\n          girl with your pelvis, You've got a\n          very superior pelvis.\n\n          \n\n          \n\n          \n\n          \n\n          102\n          98B Continued\n           She begins to ;ry.\n\n          ARCHIE\n          We'd never be apart again0\n\n          PETULIA\n          You don't mean it.\n\n          ARCHIE\n          I do.\n          Petulia twists in pain. The nurse looks over.\n\n          NURSE\n          That wasn't four minutes.\n          The nurse makes a note then turns her attention to\n          another lady who must be wheeled to the Delivery Room,\n\n          PETULIA\n          I hurt. Touch it Archie. Make it hurt less.\n          His hand touches her belly very gently.\n\n          PETULIA\n          0 It doesn't help.\n\n           ARCHIE\n           You see?\n\n          PETULIA\n          But your hands were magic with Oliver.\n\n          ARCHIE\n          Who?\n          Her pain has subsided, and she looks up at Archie.\n\n          PETULIA\n          Would you really?\n\n          ARCHIE\n          Yes.\n\n          PETULIA\n          You'd call an ambulance? At this\n          late stage?\n\n          ARCHIE\n          Say the word.\n\n          PETULIA\n          No. I'm different now. Damn it Archie,\n          why did I go to that Motel with you?\n\n          \n\n          \n\n          \n\n          \n\n          103\n          98B Continued\n          The pregnant ladies react to this.\n\n          PETULIA\n\n          (CONTINUING)\n          Do you realize we were actually only\n          a one night stand? We never even gave\n          each other a cold, All we really did\n          was pass each other going the other\n          way. Have I changed you, Archie?\n\n          ARCHIE\n          You turned me into a nut.\n\n          PETULIA\n          Is that good?\n\n          ARCHIE\n          Yes, I think so, Who knows? I hope\n\n          PETULIA\n          Archie, call the ambulance.\n          Archie crosses to the phone, picks up the receiver,\n          then almost at once he puts it down again.\n\n          â\u0080¢ PETULIA\n          When I lay dying -- twenty years from\n          now -- a middle-aged old lady --\n          wondering what my life was all about,\n          you won't even cross my mind.\n          Archie winces. He starts out. He cantt even say\n          goodbye.\n\n          PETULIA\n          Hey, wait I lied.\n\n          ARCHIE\n          About what?\n\n          PETULIA\n          I'll never forget you, Arnold.\n\n          ARCHIE\n          Arnold?\n          He starts laughing, then she starts laughing. He crosses\n          to her and holds her hand in his very tightly. Then he\n          leaves.\n\n          \n\n          \n\n          \n\n          \n\n          10TH\n\n          99 INT. HOSPITAL LOBBY\n\n\n          D\n          Archie feels unexpectedly giddy and carefree. He\n          meets David carrying a silly, sweet gift. David\n          tenses for a show-down, Archie impulsively flips out\n          David's tie and continues on his way,\n\n          100 EXT0 HOSPITAL DAY\n          As Archie exits from the hospital a kid on a roller\n          board almost kills him.\n          He has an ice cream bar. He sees three pretty girls,\n          one with blonde hair like Petulia's. But it's the\n          dark-haired girl who feels his gaze and looks back.\n          Archie, watching the girl, and eating his ice cream,\n          leans against an electrical appliance shop window.\n          Inside, among endless other items is a single T.V.\n          tube, on which the world's violence flickers silently\n          and unnoticed as before.\n          As we leave Archie, we feel a sense of euphoria -- well,\n          what do you know, it all ended rather sweetly after all.\n\n          101 INT. DELIVERY ROOM\n\n          Petulia is looking up at the bright light on the\n          ceiling. Two hands move toward her face holding an\n          ether mask. The hands seem infinitely gentle. One\n          hand touches Petulia's face to reassure her.\n\n          PETULIA\n          (in a whisper)\n          Archie .?\n\n          \n\n\n                                 THE END\n\n\n\n\n\n\nPetulia\nWriters :   Larry Marcus\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:32:55.089214"}