{"title": "Piano, The", "film_link": "/Movie Scripts/Piano, The Script.html", "script_link": "/scripts/Piano,-The.html", "info_raw": "\n\nPiano, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.33 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Jane Campion\nGenres  Drama  Romance\nScript Date :  1991\n\nRead \"Piano, The\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nThe Piano Lesson\n\n\n\n THE PIANO LESSON\n\n\n\n                    Screenplay for a film by\n                         JANE CAMPION\n\n                         Producer\n                         JAN CHAPMAN\n\n\n\n                         Script editor\n                         BILLY MACKINNON\n\n\n\n                         Maori dialogue and translator\n                         SELWYN MURU\n\n\n\n\n\n\n\n\n\n(c) copyright:\nJan Chapman Productions Pty Ltd\n2 Fairlight Street Leichhart 2040\nNSW Australia\n\n4th draft 1991\nDeveloped with the assistance of\nThe Australian Film Commission\n\n\n      ----------------------------------------------------------------\n\nSc 1                                                  Sc 1\n                         ADA (VO - Scs 2 to 7)\n               The voice you hear is not my \n               speaking voice, but my mind's \n               voice.\n\n               I have not spoken since I was \n               six years old. No one knows \n               why, not even me. My father \n               says it is a dark talent and \n               the day I take it into my head \n               to stop breathing will be my \n               last.\n\n               Today he married me to a man \n               I've not yet met. Soon my \n               daughter and I shall join him \n               in his own country. My husband \n               said my muteness does not \n               bother him. He writes and hark \n               this: God loves dumb creatures, \n               so why not he!\n\n               Were good he had God's patience \n               for silence affects everyone in \n               the end. The strange thing is I \n               don't think myself silent, that \n               is, because of my piano. I \n               shall miss it on the journey.\n\nSc 2     EXT     SCOTTISH FIELD NEAR HOUSEDAY     Sc 2\n\nA woman in a dark crepe Victorian dress sits leaning against a tree, \nher hands cover her face, around her neck she wears a writing pad. She \ncrosses a field with large bare trees, in the far background stands a \n3 storey stone house.\n\nSc 3     INT     SCOTTISH HOUSE CORRIDOR     DAY     Sc 3\n\nA small girl roller skates down a dimly lit corridor. A parlour maid \nlooks down the hall where the girl has disappeared.\n\nSc 4     INT     SCOTTISH HOUSE DRAWING ROOMDAY     Sc 4\n\nThree men wearing long grey aprons are fitting the packing for a \npiano. On one of the men's arms is a tattoo of a whale in a wild sea.\n\nSc 5     EXT     SCOTTISH HOUSE GROUNDS     DAY     Sc 5\n\nThe girl wearing her skates sits on a small black pony. An old man is \npulling it, but it won't move. (In the background, another aspect of \nthe grey stone house.)\n\nSc 6     INT     SCOTTISH HOUSE FLORA'S BEDROOM NIGHTSc 6\n\nThe woman lifts back the sheets from the bottom of the sleeping girl's \nbed. She is still wearing her skates. The woman cuts through the laces \nand removes the boots. One disembodied skate rolls across the room.\n\nSc 7     INT     SCOTTISH HOUSE DRAWING ROOMNIGHT     Sc 7\n\nThe woman stands at a window lit by moonlight. Her skin appears \nluminescently white. She touches the wooden window frame, the curtain, \nthe objects on the window sill, her mind abstracted, her hands \nunconsciously performing a farewell. Turning from the window she moves \nto a square piano crowded by packing boxes. In the dim light she \nbegins to play strongly. Her face strains, she is utterly involved, \nunaware other own strange guttural sounds that form an eerie \naccompaniment to the music.\n\nAn old maid in night-dress looks in. Abruptly the woman stops playing. \nThe emotion leaves her face, it whitens and seems solid like a wall.\n\n                    CUT TO BLACK\n\nSc 8     EXT     UNDERWATER BEACH          DAY     Sc 8\n\nUnder water a long boat passes overhead, its oars breaking the \nsurface.\n\nSc 9     EXT     BEACH                    DAY     Sc 9\n\nAmidst a riotous sea a woman, ADA, is carried to shore on the \nshoulders of five seamen. Her large Victorian skirt spreads across the \nmen's arms and backs, on her head a black bonnet, around her neck her \npad and pen. We should be forgiven if this woman seems a sacrificial \noffering as the bay they carry her to is completely uninhabited. A \nblack sand backs on to an endless rise of dense native bush.\n\nThe breakers are chaotic, the men strain to keep their footing, \ncalling to each other.\n\n                         SEAMEN\n               Hold still you smutt! Blast the \n               boat!\n               Look up! Look up!\n               Lay to! Lay to.\n               Up with it you buggerers, hold \n               hard!\n               Damn me won't you hold?!\n               Etc.\n\nTwo of the men are black, all are battered, tattooed and tough, some \nare drunk.\nBehind the woman is her daughter, a girl of ten in Scottish dress. She \ntoo is carried on the shoulders of seamen.\n\nADA is placed on the sand. She looks down at her feet sinking into the \nwet sand, then up at the huge confusion of fern and bush in front of \nher. The sound of sea behind is thunderous.\n\nSeveral of the seamen have formed a group and are pissing on the sand.\n\n\nHer daughter is on all fours evidently being sick. But ADA's attention \nis diverted to the seamen who are staggering through the waves with a \nhuge piano shaped box. They put it down as soon as they get to 5hore \nbut ADA makes gestures that they must immediately bring it to higher \nsafer ground. The piano placed to her satisfaction she hovers near it, \none hand in constant touch of it while her daughter grips her free \nhand.\n\nSc 10     EXT     BEACH                         DAY     Sc 10\n\nTWO SEAMEN finish carrying the last crate to shore. Trunks and boxes \nincluding an open crate with hens are scattered carelessly along the \nshore.\n\nThe SEAMEN gather together. After a discussion in which they look \nbetween ADA and her child and their Coaster out on the sea, one of the \nmen approaches. Behind him the other men keep their eyes out to sea or \ndown on the sand. They don't want to be involved. The sight of the \nwomen alone on this beach is too hopeless.\n\n                         SEAMEN\n               It's a little rough out there. \n               Could be they can't get through \n               to you in this weather. Maybe \n               they'll come over land.\n\nADA nods.\n\n                         SEAMEN\n               Have you things for shelter?\n\nADA nods.\n\n                         SEAMEN\n               What things have you?\n\nADA signs to her daughter. The little girl speaks clearly and loudly \nwithout emotion.\n\n                         FLORA\n               She says, \"thank you\".\n\nPuzzled, the man walks off, then turns and comes back.\n\n                         SEAMEN\n               Does your mother prefer to come \n               on with us to Nelson?\n\nADA signs vigorously to FLORA.\n\n                         FLORA\n               She says, No. She says she'd \n               rather be boiled alive by \n               natives than get back in your \n               tub.\n\n                         SEAMEN\n               (stunned) You be damn fortuned \n               I don't smack your puppy gob, \n               missy. Damn lucky.\n\nSCENE 11 DELETED\n\nSc 12     EXT     BEACH                         DAY     Sc 12\n\nADA is sheltering behind the crated piano, anxiety etched on her face.\n\nFLORA  is asleep at her feet a half eaten biscuit in her hand ADA has \nfound a gap through the crate so that she might lift the lid and play \na few notes. The sweetness and comfort of the piano seem only to \nexaggerate their isolation and hopelessness.\n\n2- See notes\n\nSuddenly a rush of sea water shoots straight under the raised crate of \nthe piano wetting her shoes. ADA stands, pushing FLORA onto her feet. \nShe is aghast to see the tide has crept in completely unnoticed.\n\nThey watch three of their boxes float out to sea. One of the hens has \nescaped the crate and is bobbing up and down in the waves.\n\nSCENE 13 DELETED\n\nSc 14     EXT     BEACH                         DUSK     Sc 14\n\nThere is just a pink streak left in the sky. ADA and FLORA shelter \ninside their make-shift tent, a hooped petticoat secured at the edges \nwith stones.  Inside the tent a candle lights up their conversation.\n\nADA is hand signaling a story to FLORA who lies back watching, nervous \nand afraid. ADA's whole self is involved in the \"telling\", her face is \nalight with expression, now tender, now sad, now humorous, now soft, \nwhile her hands and fingers are deft and precise. From outside it is \nan odd shadow play.\n\n                         FLORA\n               (hand signaling) Mother... I'm \n               thinking\n\nADA pauses.\n\n               (speaking) I'm not going to \n               call him Papa.  I'm not going \n               to call HIM anything. I'm not \n               even going to look at HIM.\n\nSc 15     EXT     BUSH ON WAY TO BEACH          DAY     Sc 15\n\nThrough a dense bush walk a party of fourteen MAORI people and two \nEUROPEAN MEN. The wetness, closeness and darkness of the bush is such \nthat the air seems green, like at the bottom of a deep sea. Two of the \nMAORIS share one pair of shoes and all of them are clothed in a \nmixture of native and European costume. Of the Europeans one is small \nand has a shy manner. He has a half completed Maori tattoo across his \ncheeks. The other is a similar age about 45 and wears a suit, muddy \nand out of place here in the bush. He staggers, spurts forward then \nslows to a stop. His hair and face are wet and his skin reflects the \ngreen foliage. BAINES the younger man turns and slows.\n\n                         BAINES\n               Are we stopping?... Do you want \n               to stop?\n\nThe MAORI voices and laughter are becoming fainter. BAINES watches \ntorn between his concern for STEWART and the split in their party.\n\n3-See Notes\n\n                         BAINES\n               Shall we stop?\n\nUnable to get an answer BAINES runs after the MAORIS.\n\n                         BAINES\n               Tai hoa! Me tatari tatou .., me \n               tutatou I konei.\n               (Wait! We are stopping.. we're \n               stopping.)\n                         SUBTITLED\n\nSTEWART takes out a comb and drags it dazed and zombie like through \nhis wet hair. Inside the darkness of his pocket, he turns over and \nover a small, worn edged photograph, a smudge of green light allows us \nto see ADA's tumbling face. Taking it in the heel of his hand he \nsecretly looks at it. Just as the party return and settle he stares on \nahead possessed and determined.\n\n                         STEWART\n               We must get on.\n\nThe MAORIS look at BAINES bewildered.\n\n                         TAME\n               Aue tepatupsiarehe!\n               (The fairy people, what can you \n               expect?) \n                         SUBTITLED\n\nSc 16     EXT     BEACH                     MORNINGSc 16\n\nIt is early morning. The sea is calmer and the tide is again low. The \nparty or two EUROPEANS and fourteen MAORI MEN and WOMEN come out on to \nthe beach. About half the MAORI party head straight for the shoreline \nwhere an older woman loudly organises a pipi collection. All sorts of \ncontainers are used from flax baskets to shirts with knots in their \narms. The rest follow STEWART and BAINES over to the boxes. STEWART \nautomatically re-combs his hair, patting it against his forehead, \nwhere it sticks in a raked pattern. On his head he carefully places a \nformal top hat, oddly dean compared to his mud splattered suit. The \nparty stops short of the petticoats where a tell-tale foot reveals its \noccupants.\n\n                         STEWART\n               Miss McGrath, Alisdair Stewart. \n               You'll have to wake yourself. \n               I've got men here to carry your \n               things.\n\nADA and FLORA struggle up to find themselves confronted by a group of \nmen and women. The MAORIS stare curiously and comment on the women.\n\n               Aut he anahera enci?\n               (Are they angels, they look \n               like angels.)\n                         SUBTITLED\n\nA man points at FLORA's feet and gestures as if holding one of the \nlittle shoes in his hand.\n\n               Te monohi hoki! \n               (So small!) \n                    SUBTITLED\n\nFLORA is struck by shyness and hides under her mother's skirt. ADA \ncannot look straight at STEWART and STEWART also cannot look at her.\n\n                         STEWART\n               I see you have a good many \n               boxes, I'd like to know what is \n               in each.\n\nAs ADA does not move STEWART is puzzled.\n\n                         STEWART\n               CAN - YOU - HEAR - ME?\n\nADA nods and looks up coldly, insulted by his slow loud speaking.\n\n                         STEWART\n               Well that is good, yes that is \n               good, good.\n\nSTEWART smiling searches ADA's face for some sign of comprehension but \nis unnerved by her lack of response. He stops smiling, and, patting \nhis hair walks to the closest box. Several of the MAORI party follow \nbehind STEWART while one of them closely and particularly mimics him.\n\n\n                         STEWART\n               What's in here?\n\nADA points to the writing already on the box saying \"Crockery and \nPots\".\n\n                         STEWART\n               Ohh, yes so it is, written \n               there, crockery.\n\n                         STEWART\n               And this one?\n\nADA writes \"bedclothes and linen\" on the pad around her neck- While \nshe writes he takes the opportunity to scrutinise her.\n\n                         STEWART\n               You're small. I never thought \n               you'd be small.\n\nHe walks to another chest\n\n                         STEWART\n               What's here?\n\nShe writes \"clothes\". The MAORI mimic also pretends to write.\n\nFinally he comes to the piano box. He lifts a corner experimentally.\n\n                         STEWART\n               What's in here then, lead?\n\n                         FLORA\n               (gravely) It's my mother's \n               piano.\n\n                         STEWART\n               A piano?\n\nThe MAORIS touch the exposed legs of the piano.  STEWART speaks to the \nother European man BAINES.\n\n                         STEWART\n               Tell them to carry in pairs. \n\n               Those three and those two the \n               black and the red, then the \n               suitcases.\n\nSTEWART holds BAINES back a moment.\n\n                         STEWART\n               What do you think?\n\nSTEWART nods towards ADA. BAINES thinks a moment then turns towards \nADA too.\n\n                         BAINES\n               She looks tired.\n\n                         STEWART\n               She's stunted, that's one \n               thing.\n\nBAINES walks over to HONE a big man and the MAORJ leader, he stands \ntall with a great sense of his own importance. (Mana)\n\n                         BAINES\n               Anei nga pouaka - ko era e \n               toro.\n               Me era e raa.\n               (Here are the boxes, those \n               three and those two.) \n                    UNSUBTITLED\n\n                         HONE\n               E Hoal\n\nHONE takes an aggressive fighting posture towards BAINES, insulted \nthat BAINES should suggest he might carry anything. HONE does not \ncarrying, he is the boss. With great dignity HONE retreats, too \ninjured to help. Other MAORIS come up and BAINES assigns them boxes. \nADA gets worried, the piano is being left alone. She writes on her \npad, \"THE PIANO?\" She shows STEWART.\n\n                         STEWART\n               Oh no, it can't come now.\n\n                         FLORA\n               It must come.\n\nSTEWART looks at FLORA\n\n                         FLORA\n               She wants it to come.\n\n                         STEWART\n               Yes and so do I, but there are \n               too few of us here to carry it. \n               TOO - HEAVY\n\nADA writes \"I NEED THE PIANO.\" Her MAORI mimic copies her.\n\n                         STEWART\n               Do you mean you don't want your \n               kitchenware or your clothes? Is \n               that what you mean?\n\nADA signs to FLORA.\n\n                         FLORA\n               We can't leave the piano\n\n                         STEWART\n               Let us not discuss this \n               further. I am very pleased....\n\nSTEWART slows down as he watches ADA again sign to FLORA, he has the \nuncomfortable impression he is being interrupted.\n\n                         FLORA\n               Mother wants to know if they \n               could come back directly for \n               it?\n\nSTEWART is shocked, his mouth hangs slightly open, paused in mid \nspeech. TAHU mimics this mouth drop perfectly.\n\n                         FLORA\n               After they have taken the other \n               things?\n\nSTEWART is growing confused and anxious. His two mimics and their \ngrowing audience unnerve him further.\n\n                         PITO\n               Kei Riri a te raho Maroke. \n               (shouted loudly at TAHU)\n               (Watch it dry balls is getting \n               touchy.)\n\n                    SUBTITLED\n\nSTEWART nods suspiciously towards the MAORI speaker not understanding \nhim, the speaker smiles and nods back.\n\n                         STEWART\n               I suggest you prepare for a \n               difficult journey. The bush \n               will tear clothes and the mud \n               is deep in places.\n\n\nSTEWART walks away. ADA stands beside the piano turned away from the \nactivities. FLORA pats her hand trying to cheer her. Down on the beach \na fire is lit and pipis are prepared for cooking. Some of the young \nmen are racing naked into the sea.\n\n                         STEWART\n               (to BAINES about the MAORIS) \n               What are they doing? We don't \n               have time for that.\n\nSc 17     EXI     BEACH                         DAY     Sc 17\n\nIt is some hours later and the carrying party are beginning to make \ntheir way up into the bush. ADA still stands beside her piano. FLORA \nwants to follow the party. BAINES comes back along the beach, trailed \nby a young Maori boy, KAHA.\n\n                         BAINES\n               Mr. Stewart asked if I might \n               show you to the path. (ADA does \n               not move) ... May I carry \n               something?\n\nADA turns to BAINES, her face angry and defiant, her eyes full of \ntears. BAINES falls back, struck by her show of emotion. ADA and FLORA \nwalk past him toward the bush.\n\nSc 18     EXT     CLIFF ABOVE BEACH               DAY     Sc 18\n\nThe party threads its way through the bush along the cliff. ADA pauses \nat the cliff top to see her piano below on the sand, tiny and \ndesolate. Its distance and her love of it suddenly strike her. Its \nmusic is faint and becomes loud over the next scene.\n\nSc 19     EXT     BUSH FROM BEACH               DAY     Sc 19\n\nBrown feet squelch through the mud, finally followed by dainty boots \ncaked in dirt. The MAORI leaders of the party have stopped.\n\n4 - See Note\n\nBAINES works his way to the front.\n\n                         BAINES\n               aha tenei?\n               (What is it?) \n                    SUBTITLED\n\n                         HONE\n               E hinga te Koroua ra B Pitama i \n               konci. Kare noa Kia hikina te \n               tapu.\n               (Old man Pitama died here. \n               (points to the spot) \n               The Tapu hasn't been lifted)\n                    UNSUBTITLED\n\nSTEWART struggles up to the front to join BAINES, he speaks over the \ntop of HONE.\n\n                         STEWART\n               What's he say?\n\n                         BAINES\n               Someone died here. It's tapu.\n\n                         STEWART\n               But we came down this way \n               didn't we? I'm sure we did.\n\nThe MAORI leaders continue discussing.\n\n               0h Pitama eh.\n\n                         HONE\n               E Tarna heke atu ki ram - tiro \n               his atu.\n               Rapuhia mai he huarahi re!\n               (Go and look, find another \n               track eh!)\n                    UNSUBTITLED\n\n                         TIPI\n               'cia tupato he ana taniwba ke \n               raro na. \n               (Go easy there's a ghost down \n               there.)\n                    SUBTITLED\n\n                         HOTU\n               'Ca, rongo koe i te haunga a \n               tans tutae i te tuatahi. (You \n               smell his shit first.) \n                    UNSUBTITLED\n\nSTEWART continues over the top of the MAORI discussion.\n\n                         STEWART\n               They want more money. They are \n               trying to make two days out of \n               it?\n\n                         BAINES\n               No, no they know another track \n               - to the side of this.\n\nADA and FLORA sit watching, out of breath. The bush is dense, \nclaustrophobic and exotic. One of the MAORI women sits close to ADA \napparently not looking at her- Slowly she draws the scarf that is in \nADA's lap into her own. Defiantly she puts it on.\n\nMeanwhile another woman makes a very dignified attempt to wipe the \nfreckles from FLORA's face.\n\nSc 20     EXT     STEWART'S                    DAY     Sc 20\n\nIt is another day and STEWART'S hut, bleakly set amidst smoking stumps \nis full of squeals, chasing and antics.\n\nSc 21     INT     STEWART'S HUT               DAY     Sc 21\n\nThe reverend in frock coat has a wedding dress stuck part way up his \narms. It is not a normal wedding dress but a backless one used again \nand again as a photographic prop. Stewart's AUNT MORAG and her \ncompanion NESSIE are trying to pull it off.\n\n                         AUNT MORAG\n               Watch your feet!\n\n                         NESSIE\n               Watch your feet!\n\nADA and FLORA find the family fun frightening and have taken refuge in \nthe bedroom.\n\n                         AUNT MORAG\n               Careful! Watch his hand.\n\n                         NESSIE\n               Watch his hand\n\nThe REVEREND tickles his sister as she tries to get the sleeve off his \nhand. NESSIE squeals with excitement.\n\n                         AUNT MORAG\n               Stop it!\n\nNESSIE looks towards ADA panting with excitement at the fun.\n\n                         AUNT MORAG\n               (shooing the Reverend out) \n               We'll bring out the bride.\n\nThe two women now fit the wedding dress on ADA.\n\n                         AUNT MORAG\n               LIFT - YOUR - ARM - UP - DEAR.\n\nFLORA sits on the bed sulkily. She leans back and crosses her leg.\n\n                         FLORA\n               My REAL father was a famous \n               German composer\n\n                         AUNT MORAG\n               Ohh the tag is broken.\n\n                         FLORA\n               (continues) .... They met when \n               my mother was an opera \n               singer... in Luxemburg...\n\nThe two women pause to look at FLORA. ADA signs to FLORA \"THAT'S \nENOUGH!\"\n\n                         FLORA\n               Why?\n\nADA looks away, the two women finish primping the dress. FLORA crosses \nher arms.\n\n                         FLORA\n               I want to be in the photograph.\n\nSc 22     EXT     STEWART'S Hut                DAY     Sc 22\n\nNESSIE half holds an umbrella over ADA as they make their way to where \nthe camera is setup in front of a chair and a sparse display of three \ntoi-toi. All about the house is muddy, so much so that they must weave \ntheir way through on planks and logs. A fine veil of rain is falling \nacross the distant bush, the whole valley is shrouded in mist. STEWART \nlooks through the camera at the REVEREND and the photographer who are \nposing as the couple, complete with tatty bouquet. STEWART notices \nADA's arrival and seeing her as a real bride, his bride, he is \nstruckdumb with pride, even the rough tapes at the back or the dress \ncannot destroy the illusion.\n\n                         STEWART\n               Beautiful.\n\nThe umbrellas are held away, the rain pours down.\n\nSc 23     INT/EXT     STEWARTS HUT BEDROOM     DAY     Sc 23\n\nAUNT MORAG has brought a chair into the bedroom and sits knee to knee \nwith FLORA.\n\n                         AUNT MORAG\n               I thought she met your father \n               in Luxemburg.\n\n                         FLORA\n               Well, yes, in Austria where be \n               conducted the Royal Orchestra. \n\n                         AUNT MORAG\n               (frowning) And where did they \n               get married?\n\nAUNT MORAG checks to see if someone is coming.\n\n                         FLORA\n               (her Scottish accent becomes \n               thick and expressive) In an \n               enormous forest, with real \n               fairies as bridesmaids each \n               holding a little elf's hand.\n\nAUNT MORAG sits back, regarding FLORA with obvious disapproval and \ndisappointment. She smooths back her hair.\n\n                         FLORA\n               No, I tell a lie, it was in a \n               small country church, near the \n               mountains\n\nAUNT MORAG is becoming involved again. She leans forward.\n\n                         AUNT MORAG\n               Which mountains are those dear?\n\n                         FLORA\n               The Alps.\n\n                         AUNT MORAG\n               Ohhh I've never been there. \n               (she leans forward)\n\n                         FLORA\n               Mother used to sing the songs \n               in German and her voice would \n               echo across the valleys\n\n               That was before the \n               accident....\n\n                         AUNT MORAG\n               Oh what happened?\n\nMORAG looks over her shoulder as FLORA continues to talk, so \npersuasive is FLORA's storytelling that the scene comes vividly to \nlife, albeit in FLORA's dark pupil.\n\n                         FLORA\n               One day when my mother and \n               father were singing together in \n               the forest, a great storm blew \n               up out of nowhere. But so \n               passionate was their singing \n               that they did not notice, nor \n               did they stop as the rain began \n               to fall and when their voices \n               rose for the final bars of the \n               duet a great bolt of lightening \n               came out of the sky and struck \n               my father so that he lit up \n               like a torch... And at the same \n               moment my father was struck \n               dead my mother was struck dumb! \n               She- never-spoke-another-word.\n\n                         AUNT MORAG\n               Ohhh ... dear. Not another word    \n               From the shock, yes it would \n               be.\n\nThe story is interrupted by the return of the wedding party who are \ndripping wet, exactly as the couple in the story. AUNT MORAG bustles \nover to take off the wet wedding gown, her face puckered with tragedy.\n\n                         AUNT MORAG\n               Terrible.  Terrible\n\nBefore she can undo the ties ADA pulls it from herself so aggressively \nthat the ties and part of the gown comes apart. None of this is a \nconcern to ADA who is distracted with fear for her piano. She crosses \nto the little window and stares anxiously at the falling rain.\n\nSc 24     EXT     BEACH                         DUSK     Sc 24\n\nSoft piano music has been playing over the previous scene. Now it \nbuilds to strength as sea water swirls high around the piano, small \nand embattled on the dark rainy beach.\n\nSc 23     INT     STEWART'S HUT BEDROOM          DAY     Sc 25\n\nIt's morning of the next day. ADA and FLORA sit amongst tea chests in \nthe bedroom. ADA is signing intently to FLORA. FLORA signs back, \nsometimes using words. STEWART watches uneasy with their secret \ncommunication. As STEWART enters the animation is suspended. ADA \nstands and takes a step back as if to attention.\n\n                         STEWART\n               I shall be gone for some days. \n               There is some Maori land I want \n               and may buy very reasonably. \n               (STEWART shuffles) I am hoping \n               you will use the time to settle \n               in, and, in some ways we may \n               start again\n\nFLORA and ADA look at each other.\n\n                         STEWART\n               All right?\n\nADA looks at him blankly, then nods.\n\nSc 26     EXT     STEWART'S                    DAY     Sc 26\n\nADA and FLORA dressed in cloaks and bonnets skirt the dense bush \ntrying to find a path in. It is not easy, because the bush is so \ntight. ADA's leg slides in up to her calf in mud.\n\nSc 27     EXT     BAINES'                    DAY     Sc 27\n\nADA and FLORA arrive at BAINES' rough hut. It is mid-morning but \nBAINES is not yet dressed. ADA hands him a note. BAINES looks at it \nblankly.\n\n                         BAINES\n               I'm not able to read.\n\nADA signs to FLORA.\n\n                         FLORA\n               Please take us to the beach \n               where we landed.\n\n                         BAINES\n               I'm sorry, I can't do that. \n               (FLORA and ADA stare evenly at \n               him) \n               I don't have the time.\n               (They continue to stare.)\n               Goodbye\n\nSc 28     EXT     BAINES'                    DAY     Sc 28\n\nIt is much later when BAINES emerges from his hut with a saddle over \nhis arm. The two women are still there. ADA looks up at him \nexpectantly.\n\nFLORA mirrors her expression.\n\n                         BAINES\n               I - can't - take - you there. I \n               can't do it.\n\nHe puts the saddle over a rail. He continues to saddle up, sneaking \nglances at them from under the horse and around its side. They watch \nhim closely, not pleadingly, but stubbornly1 eerily of one mind.\n\nSc 29     EXT     BEACH                         DAY     Sc 29\n\nThe sky is blue with long wisps of cloud.\n\nThe party of three break onto the long expanse of beach where the \npiano still stands. It has not been without visitors. There are \nfootprints on the sand and some of the boards have been pulled back. \nADA passes BAINES, walking urgently towards it. Soon, ADA has removed \nenough boards that she may lift the lid and play the keys. EMNES stays \nback. ADA takes great delight in feeling her fingers on the keys \nagain. Her whole composition is altered. She is animated, joyful, \nexcited.\n\nDown on the wet sand FLORA does a wild dance of her own invention \nusing a seaweed wig. She finishes by rolling down the beach in the \nsand.\n\nBAINES views them with suspicion, yet he is magnetically drawn to the \nspectacle He has never seen women behave with so much abandon. His \nattention fixes on ADA's uninhibited emotional playing, and as he \nwatches, he finds himself edging irresistibly closer.\n\nSc 30     EXT     BEACH                    LATE AFTER NOONSc 30\n\nThe shadows are long on the sand when BAIN'ES collects the boards. ADA \nand FLORA are attempting a duet. ADA notices him come towards them \nwith the boards, obviously intending that they should leave. Her mood \ndarkens, she continues playing stubbornly even though FLORA has \nstopped. Abruptly she finishes. In black spirits she replaces her cape \nand bonnet. BAINES is struck by this sudden change, he watches her \nmesmerised as he replaces the boards.\n\nSc 31     EXT     BEACH                    NIGHT          Sc 31\n\nFrom a helicopter, the camera tracks along the beach, following the \ncrashing wave line, to find the piano.\n\nSCENE 32 DELETED\n\nSc 33     EXT     STEWART'S HUT & KITCHEN     DUSK          Sc 33\n\nThe hut puffs smoke out into the valley. The lie of the land traps \nsound like a shell and the clear high notes of a voice echo out. \nSuspicious that ADA is singing, STEWART approaches the house quietly. \nThrough the open kitchen door he sees that the keys of a piano have \nbeen etched on the table top. While ADA \"plays\" the notes FLORA sings \nthem.\n\nSTEWART puts his pack down. ADA stands to attention, folding the \ntablecloth back over the table. \n\n5, 6 + 7 See notes\n\n                         STEWART\n               Hello, then.\n\n                         FLORA\n               Hello.\n\n\nADA nods. STEWART'S hand explores the markings on the table. ADA \nwatches his hand moving under the checked cloth.\n\nSc 34     INT     MISSION HOUSE               DAY     Sc 34\n\nAUNT MORAG, NESSIE and TWO MAORI GIRLS dressed in proper Victorian \ncostume are kneeling around a huge double white sheet, sewing and \ncutting it. The MAORI girls are part of the mission's good works. They \nare dressed in European style and while their training is in polite \nproper domestic behaviour they constantly corrupt it with their \ndemonstrative displays of affection, and their clay tobacco pipes to \nwhich they are addicted.\n\nSTEWART is standing, looking on. BAINES is behind him in the kitchen \nremoving his boots.\n\n                         AUNT MORAG\n               (looking carefully at STEWART) \n               Well you stopped combing your \n               hair, which is a good thing, it \n               was looking over done. \n               (without pause but referring to \n               the sheet) You see these are \n               the slits that the heads will \n               go through, show him Nessie ... \n               they'll be dead, the Reverend \n               is going to use animal blood, \n               no doubt it will be very \n               dramatic. Tea! \n               (for NESSIE rather than to her)\n\n                         NESSIE\n               It will be very dramatic.\n\n\nNESSIE leaves to get the tea. HENI, the MAORI girl with a Moku tickles \nMARI'S back while she sews.\n\nThey sing the anthem in snatches. It is background to the \nconversation.\n\n                         STEWART\n               (sitting down) \n               What would you think if someone \n               played a kitchen table like it \n               were a piano?\n\n                         AUNT MORAG\n               Like it were a piano?\n\n                         STEWART\n               It's strange isn't it? I mean \n               it's not a piano, it doesn't \n               make any sound.\n\nNESSIB puts STEWART'S tea down. BAINES comes in with his tea cup \ndwarfed in his big hands. He stands back leaning against a wall.\n\n                         AUNT MORAG\n               (hissing to NESSIE) Biscuits.' \n               No, no sound.\n\nNESSIE hustles back to the kitchen.\n\n                         STEWART\n               I knew she was mute, but now \n               I'm thinking it's more than \n               that. I'm wondering if she's \n               not brain affected.\n\n                         AUNT MORAG\n               No sound at all?\n\n                         STEWART\n               No, it was a table.\n\n                         AUNT MORAG\n               (musing) Well, she was very \n               violent with the gown. She tore \n               off a chunk of lace. if hadn't \n               been there I'd have sworn she'd \n               used her teeth\n\n                         NESSIE\n               and wiped her feet an it.\n\n                         STEWART\n               Well it has not yet come to \n               anything. Just a concern.\n\nAUNT MORAG pats her chest. a calming device.\n\n                         AUNT MORAG\n               Oh, yes, yes of course, a \n               concern.\n\n                         STEWART\n               There is something to be said \n               for silence\n\n                         AUNT MORAG\n               Oh indeed. Cotton'.\n\nShe holds her needle up for NESSIE to thread.\n\n                         STEWART\n               (warming)  And with time she \n               will, I'm sure, become \n               affectionate.\n\n                         AUNT MORAG\n               Certainly, there is nothing so \n               easy to like as a pet and they \n               are quite silent.\n\nBAINES watches quietly on.\n\nSc 35     EXT     STEWART'S WOODCHOP          DAY     Sc 35\n\nSTEWART is at the woodshop cutting firewood. He displays his \nvirtuosity as an axeman, cutting the wood into ever more slender \npieces, FLORA is watching and stacking the fallen timber. She flinches \nas the axe hits the wood, but scurries in to pick up the timber. \nBAINES is standing talking to STEWART.\n\n                         BAINES\n               Those 80 acres, that cross the \n               stream, what do you think of \n               them?\n\n                         STEWART\n               On your property?\n\n                         BAINES\n               Yes\n\nBAINES carries a log across for STEWART who talks without pausing in \nhis work,\n\n                         STEWART\n               Good, flatish land with \n               reliable water, why? I don't \n               have money. What are you about?\n\n                         BAINES\n               I'd like to make a swap.\n\n                         STEWART\n               What for?\n\n                         BAINES\n               The piano.\n\n                         STEWART\n               The piano on the beach? Ada's \n               piano?\n\nBAINES nods. STEWART stops, this is serious.\n\n                         STEWART\n               It's not marshy is it?\n\nSTEWART has walked a few paces away from his wood chop in the \ndirection of the land.\n\n                         BAINES\n               No.\n\n\n                         STEWART\n               You'd have to organise it up \n               here.\n\n                         BAINES\n               Yes, I thought that.\n\n                         STEWART\n               Well Baines the music lover, I \n               never would have known. Hidden \n               talents George.\n\n                         BAINES\n               I'll have to get lessons. It \n               wouldn't be much use without \n               them.\n\n                         STEWART\n               Yes, I suppose you would.\n\nBAINES remains silent. He looks away.\n\n                         STEWART\n               Well Ada can play.\n\nBAINES shrugs.\n\n                         STEWART\n               I have it in a letter she plays \n               well. She's been playing since \n               she was 5 or6.\n\nFLORA has stopped stacking. She is lying along the top of the wood, \nlifting a leg up and down, watching the men.\n\nSc 36     INT     STEWART'S KJTCHEN               DAY     Sc 36\n\nSTEWART, flushed with his plans, is pouring tea into cups. FLORA peers \nat cup level through the steam. ADA sits beside her at the table.\n\n                         STEWART\n               I have got us some excellent \n               land. Baines has taken some \n               queer idea to have a piano, and \n               you are to give him lessons. \n               Have you taught before?\n\nADA signs to FLORA.\n\n                         FLORA\n               What on?\n\n                         STEWART\n               On your piano, that is the \n               swap.\n\nALA finger signs, her face furious.\n\n                         STEWART\n               What does she say?\n\n                         FLORA\n               She says it's her piano, and \n               she won't have him touch it. \n               He's an oaf, he can't read, \n               he's ignorant.\n\n                         STEWART\n               He wants to improve himself... \n               and you will be able to play on \n               it ... (ADA is not responding \n               well) Teach him to look after \n               it.\n\nADA's breathing becomes heavy with anger, she writes Curiously on her \npad.\n\n               NO! NO! THE PIANO IS MINE! IT'S \n               MINE!\n\nSTEWART regards her note and her passion with suspicion and disdain\n\n                         STEWART\n               (getting up) You can't go on \n               like this, we are a family now, \n               all of us make sacrifices and \n               so will you.\n               You will teach him. I shall see \n               to that!\n\nADA's emotions are suddenly removed and she views STEWART blankly, \neerily so.\n\nSc 37     EXT     BUSH FROM BEACH               DAY     SC 37\n\nThe piano is taken up through the bush by a group of six to eight \nMAORI MEN. It's very heavy and awkward and they grunt and struggle \nwith it.\n\n               HiM na ake 'nun na'. \n               (Lift up the back)  \n                    UNSUBTITLED\n\n               Tern - tern!\n               (Ass hole!)\n\n               Hei niti niti maan! \n               (turning around) \n               You lick it.)\n\nSomeone stumbles and the back of the piano comes crashing to the \nground thundering out in the bottom end of the scale. People scatter. \nOnly one stays who warrior like challenges the piano.\n\nSc 38     EXT     PATH TO BAINES                DAY      Sc38\n\nThe women duck low to avoid a branch as STEWART leads them to BAINE'S \nhut. STEWART carries the piano stool.  The path slopes up through a \nstrange, bearded forest where the tops of trees are bare and ghost \nlike.\n\n                         STEWART\n               I'd try children's tunes, \n               nothing more complicated\n\nADA is unrepentant, she does not want to teach BAINES the piano.\n\n                         STEWART\n               Just be encouraging no one expects him to be good.\n\nSc 39      INT/EXT     BAINES' HUT                DAY     SC 39\n\nThe piano is the only cared for item in the rough hut\n\n                         STEWART\n               (lifting the lid) It looks \n               good, very nice looking thing. \n               Well . I wish you luck. The girls \n               are very excited about the \n               lessons.\n\nThe \"girls\" look anything but excited. FLORA shy, plays obsessively \nwith a long strand of greasy hair. ADA is cold and grim.\n\n                         STEWART\n               Flora will explain anything Ada says.\n               They talk through their fingers, \n               you can't believe what they say \n               with just their hands.\n\nSTEWART leaves. BAJNES goes to the piano and lifts the lid. He looks \nat them. ADA signs to FLORA.\n\n                         FLORA\n               My mother wants to see your \n               hands. Hold them out.\n\nBAINES holds out his hands, spread wide as if holding a ball.\n\n               No, no, like this\n\nFLORA puts her neat little fingers together, first with their backs up \nthen she turns them over. HAINES does the same only his bands are big \nand coarse. ADA signs to FLORA. BAINES is shyly keen.\n\n                         FLORA\n               You have to wash them.\n\n                         BAINES\n               They are washed.\n\nADA signs.\n\n                         FLORA\n               Wash them again.\n\n                         BAINES\n               The marks do not come out.  \n               They are scars and hardened \n               skin.\n\nADA and FLORA do not move. Humiliated BAINES takes a scrub brush, soap \nand bucket and goes outside. ADA can see him from the window. She \nmoves to her piano. She wants to touch it but she is torn by her \nfeelings, wanting it, but not owning it. She strokes the varnished \nwood with her hand and softly lifts the lid. Outside FLORA stands \nbeside BAINES pointing out hits of his hand he should still scrub. \nFurtively she lays her hands on the keys. The instrument is horribly \nout of tune, almost every note is off. She goes outside and signs to \nFLORA.\n\n                         FLORA\n               There's no tune left in the \n               piano so she can't teach you.\n\nThe two women leave.\n\nSc40     EXT      STEEP BUSH HILL                DAY     Sc40\n\nTwo men come crashing out down a steep bush hill, They are tied to \neach other. BAINES, the younger and stronger, is trying to break their \nfall by grasping hold of branches and shoots. Finally their fall is \nchecked. The old man is white haired, the front of his suit splattered \nwith the debris of many meals. He sits up feeling about for his \nglasses. He is blind. His eyes, though closed, wobble and roll BAINES \nfinds the glasses One of the lenses has gone, the other is very dark. \nThe old man fits his handkerchief in the gap.\n\nSc 41     EXT     HUGESCREE                    DAY     Sc 41\n\nBAINES carries the old man on his back, they cross a huge scree. Each \nof BAINES' steps dislodge a fall of rocks. The crashing of stones \nechoes across the valley. BAINES and he are but small dots in this \ngiant earth scar\n\nSCENE 42 DELETED\n\nSc 43     INT     BAINES' HUT                    DAY     Sc 43\n\nInside BAINES' hut the old man feels the piano.\n\n                         BLIND MAN\n               Ah, a Broadbent. A fine \n               instrument. I've not come \n               across one here, or in the \n               Islands where I have tuned some \n               200. Yes, they like their \n               pianos there.\n\nOut of his pocket he takes a carefully wrapped tuning fork. He unwraps \nthe package, lifts the back and lid and starts to tune. He sniffs the \nair. BAINES watches, He sniffs close to the keys.\n\n               Scent? And salt of course.\n\nHe works on.\n\n               What will you play when it's \n               tuned? What music do you play?\n\nBAINS looks over at him from the meal he is preparing.\n\n                         BAINES\n               I can't play.\n\nThe blind man stops working.\n\n                         BLIND MAN\n               You don't play?\n\n                         BAINES\n               No, I can't.\n\n               I'm going to learn.\n\nThe man goes back to work somewhat depressed by the futility of the \nventure.\n\n                         BLIND MAN\n               Well my dear Miss Broadbent, \n               tuned, but silent.\n\nSCENE 44 DELETED\nSCENE 45 DELETED\n\nSC 46     EXT     BAINES' HUT                    MORNINGSc 46\n\nA slash of sunlight falls across the piano. Thousands of particles of \ndust become visible floating in the air. BAINES is at the window in \nhis shirt/night shirt. He notices the dust on the piano and strips off \nhis shirt which he uses as a duster. Under the shirt he is naked. As \nhe wipes the smooth wood he becomes aware of his nakedness. His \nmovements become slower until he is no longer cleaning, but caressing \nthe piano.\n\nSc 47     EXT     PATH TO BAINES'               DAY     Sc 47\n\nOn the path to BAINES' house, ADA and FLORA sit in the bush. ADA's \nhead is bowed. Her hands held over her face. FLORA tries to catch the \nspots of light in her palm as they twinkle through the thick canopy of \nleaves over head.\n\n\nSc 48     EXT/INT     BAINES' HUT                    DAY     Sc 48\n\nThe door opens. ADA and FLORA stand in their cloaks and bonnets.\n\n                         FLORA\n               Mother says she can't stand to \n               teach piano with it all out or \n               tune. So I'm to do scales.\n\nADA turns and walks off. FLORA bustles in. BAINES watches ADA from the \nwindow,\n\n                         FLORA\n               I hope you've scrubbed your \n               hands.\n\nFLORA begins a scale.\n\n               Oh, it's in tune.\n\nShe looks over at BAINES who is still gazing out the window.\n\n                         FLORA\n               What's out there?\n\nShe gets up to see what BAINES is looking at. She sees her mother and \ndivines BAINES is looking at nothing.\n\n                         FLORA\n               You have to watch me where I \n               put my fingers.\n\nFLORA starts again. ADA can only hear the piano faintly but moves \ncloser as she too hears it's in tune.\n\nAs she enters the hut BAINES pulls his fingers away from the piano. \nFLORA sees this and stops too. She looks at her mother.\n\n                         FLORA\n               It's in tune.\n\nADA checks the other notes. FLORA stands with her arms folded, a bit \nsulky and fluffed up.\n\n                         FLORA\n               (Hissing) I was teaching.\n\nADA tries the piano. She looks over at BAINES then signs to FLORA.\n\n                         FLORA\n               She wants to see what you can \n               do.\n\n                         BAINES\n               I'd rather not play. I want to \n               listen and learn that way.\n\n                         FLORA\n               Everyone has to practice.\n\n                         BAINES\n               I just want to listen.\n\nADA is a bit nonplussed. She does not want to be listened to anymore \nthan she wants to teach. She pulls a strand of her hair then signs to \nFLORA.\n\n                         FLORA\n               What do you want to hear?\n\nBAIWES shrugs shyly and locks away out the window. He doesn't know\n\n                         BAINES\n               Anything.\n\nADA is slow to start. Unobliging as ever she plays scales. But once \nbegun her belligerence fades as her absorption in the music \nstrengthens.\n\n\nSc 49     INT     STEWART'S HUT/ADA'S BEDROOM      NIGHT     Sc 49 \n\nBack at STEWART'S hut, ADA lies dispirited on the bed. FLORA lies \nbeside her holding ADA's hand.\n\n                         FLORA\n               Tell me about my real father.\n\nADA nods and strokes FLORA's hair from her face. FLORA leans back.\n\n               How did you speak to him?\n\nADA signs to FLORA who watches in love with all the stories of her \nmother and unreal father.\n\n                         ADA (subtitled)\n               I didn't need to speak, I could \n               lay thoughts out in his mind \n               like they were a sheet\n\n                         FLORA\n               What happened? Why didn't you \n               get married?\n\nADA continues to sign her hands casting odd animal like shadows on the \nnewspapered walls.\n\n                         ADA cont.\n               After a while he became \n               frightened and he stopped \n               listening.\n\n\nSTEWART enters their bedroom. FLORA stops and ADA stands against the \nwall. STEWART finds the atmosphere curious yet impenetrate.\n\n                         STEWART\n               Shall I kiss you goodnight?\n\nFLORA looks up at her mother. ADA shrugs.\n\nSTEWART nods stiffly, and uncomfortably, he leaves.\n\nSc 50     EXT     BAINES' VERANDAH               DAY     Sc 50\n\nIt's raining heavily, FLORA sits on the small verandah outside BAINES' \nhut, her legs stuck straight out into the wet. She is overseeing a \nmerciless power game with the dog, forcing it out of the verandah with \na stick.\n\nSc 51     INT     BAINE'S HUT                    DAY     Sc 51\n\nADA's playing can be heard inside. BAINES sits back watching ADA. Her \ncape on the hook is dripping a puddle on to the floor and there is a \ncircle of drips around her skirt hem. She is totally absorbed in her \npiano music as she was on the beach.\n\nBAINES watches. Her long white neck, now wet from rain, proves \nirresistible. He comes across the room and kisses her. ADA jumps up \nand prepares to leave. BAINES stands in front of the door.\n\n                         BAINES\n               Do you know how to bargain, nod \n               if you do.\n\nShe doesn't move,\n\n               There's a way you can have your \n               piano back. Do you want it \n               back? You want it back?\n\nADA eyes him suspiciously.\n\n                         BAINES\n               You see I'd like us to make a \n               deal. There's things I want to \n               do while you stay. If you let \n               me you can earn it back.\n\n               What do you think, one visit \n               for every key.\n\nADA is tense but she is thinking about it. She holds up a finger then \npoints to the black of her dress.\n\n                         BAINES\n               Your dress?\n\nADA shakes her head.\n\n               Skirt ...?\n\nShe walks over to her piano and points to a black key. \n\n               For every black one?\n\nADA turns raising her head, nodding. \n\n               That's a lot less, half.\n\nBAINES is counting the keys. ADA starts for the front door. \n\n               All right, all right then, the \n               black keys.\n\nShe sits back at the piano. She plays the lowest black key as in \nnumber one\n\nShe takes her hands off the piano waiting.\n\n               It's better that you play.\n\nObediently she begins, stopping abruptly, indignantly, as he touches \nher neck.\n\n                         BAINES\n               Play... Keep playing.\n\nAfter a moment she settles back to the piano.\n\nSc 52     EXT     BAINES' VERANDAH               DAY     Sc 52\n\nOutside FLORA is cradling the poor confused dog, asking him what cruel \nmiserable person had sent him out into the cold and wet.\n\nSc 53     EXT     RIVERHOLE NEAR BAINES'          DAY     Sc 53\n\nBAINES bathes in a riverhole. He is watched by a gathering of Maori, \nsometimes with great seriousness, at other times with hilarity. They \npass between them his clothes, trying them on and mimicking him. One \nof the older women HIRA crouches close to the bank keeping up a steady \nline of inquiry. Her manner is relaxed but focused and persistent. She \nsmokes a pipe-\n\n                         HIRA\n               I got the good wife for you \n               Peini. She pray good. Clean. \n               Read Bible. You sleep her \n               Peini. She chief daughter.\n\n                         BAINES\n               No, no bible readers.\n\nBAINES continues good humouredly washing.\n\n                         HIRA\n               Why? We need you pakeha clever. \n               You sleep her.\n\n                         TAHU\n\n               (A big man dressed as a woman) \n               (Background) I give her plenty \n               clever. (Gestures sexually)\n\n                         BAINES\n               I have a wife.\n\n                         TAHU\n               (camping it up) I give her \n               clever eb Peini. Hallelujah!\n\n\n                         HIRA\n               Don't answer, he low born. Jun \n               look at him, mongrel. Your wife \n               where she?\n\n                         BAINES\n               She lives her own life in New \n               Jersey, America.\n\n                         HIRA\n               You have spare wife here Peini. \n               You get rnana for that. Our \n               chief four wives.\n\nBAINES shakes his head amusedly. As he gets out of the river HIRA \nslaps him.\n\n               I marry white man Peini, he a \n               whaler like you. He very good \n               to me. Love me, nurse me.\n\nHIRA touches her own face where BAINES' tattoo is.\n\n                         HIRA\n               Who do that? It not finish, \n               that no good Peini. You finish!\n\nSeveral people on the bank are taking turns to comb their hair, \npeering into a tiny piece of mirror.\n\nSc 54     EXT/INT     BAINES' HUT                    DAY     Sc 54\n\nBAINES' dog hears ADA and FLORA approach. It takes off under the \nhouse. FLORA calls the dog. It keeps well hidden. ADA has gone on \ninside and the door is closed. FLORA stands outside the door left out \nand lonely. She knocks. BAINES answers.\n\n                         FLORA\n               (small voice) \n               I want to speak to my mother\n\nShe buries her head in her mother's skirt.\n\n               I don't want to be outside, I \n               want to watch. \n\nADA signs to FLORA.\n\n               I'll be very quiet.\n\nADA leads her to the door signing to her\n\n               I won't look at him!\n\nFLORA is shut out.\n\nSc 55     INT     BAINES' HUT                    DAY     Sc 55\n\nADA sits at the piano. She is shy and nervous She turns to BAINES who \nnods. ADA begins to play. BAINIES keeps his head bowed, but as the \nplaying becomes more confident he raises his head to watch.  He sits \nat a far corner of the room apparently enjoying the whole vision or \nthis woman at her piano.\n\nAfter some time BAINES, affected by the music, takes his chair to a \ncloser position and from an opposite angle. ADA glances up as she \nfeels him passing behind her.  He seems satisfied to watch. His \nattention finally focuses on her neck as it bends further or closer to \nthe piano.\n\nAgain he shifts his chair, taking it round the back and to the other \nside of the piano. As he moves ADA watches warily. From this position \nbe doesn't try to touch her, but watches, enjoying her fingers moving \non the keys and the small details of motion on her face. Twice he \ncloses his eyes and breathes deeply BAINES is experiencing an \nunpractised sense of appreciation and lust. When his eyes are closed, \nADA glances at him with curiosity and suspicion.\n\nSc 56     INT     SCHOOL HALL                    DAY     Sc 56\n\nFLORA stands on a kitchen chair. AUNT MORAG and NESSIE have paused \nfrom fitting FLORA's bodice and wire angel wings. They are attempting \nto learn the hand gestures as FLORA signs:\n\n               \"I shall listen hard to rehearsal, \n               because I live too \n               far away to go often.\"\n\n                         AUNT MORAG\n               (suspiciously) Which sign is \n               the word rehearsal?\n\nFLORA deftly demonstrates.\n\n                         AUNT MORAG\n               I can't imagine a fate worse \n               than being dumb. Turn around.\n\n                         NESSIE\n               To be deaf?\n\n                         AUNT MORAG\n               Oh yes, dear too - TERRIBLE! \n               AWFUL!\"'\n\n                         FLORA\n               Actually, to tell you the whole \n               truth, Mama says most people \n               speak rubbish and it's not \n               worth the listen.\n\nAUNT MORAG and NESSIE exchange looks.\n\n                         AUNT MORAG\n               (stiffly) Well, that is a \n               strong opinion.\n\n                         FLORA\n               Yes, it's unholy.\n\nSc 57     INT     BAINES' HUT                    DAY     Sc 57\n\nADA is quick to remove a used plate and cup left on top of the piano.\n\nBAINES is sitting next to the window, his elbow on the sill, his head \nturned away.\n\n                         BAINES\n               Lift your skirt,\n\nADA stops playing. She turns to him. Thinks about it then slowly lifts \nher skirt a little to show her boots.\n\n               Lift it higher.\n\nADA pulls the skirt up fractionally so the top other boots are \nexposed.\n\nBAINIES nods ADA starts to play again, not so confidently as before.\n\nBAINES moves close, he goes down on his knees to watch her feet on the \npedals.\n\n                         BAINES\n               Higher.\n\nADA doesn't hear.\n\n               Lift it higher.\n\nShe stops and lifts her skirt to her knees. She looks at BAINES with \nill-disguised contempt. BAINES is enthralled with her legs, or what he \ncan now see of them. He moves back to watch them from behind. He's \nlying on the ground, head propped on his arm. ADA's slim stockinged \ncalves work the pedals, one of the stockings has a small hole through \nwhich her white skins shows\n\nSc 58     EXT      MISSION HOUSE GROUNDS          DUSK     Sc 58\n\nHENI holds STEWART'S horse near a wooden gate. Its wet coat steams in \nhe night air, making the whole horse glow. HENI talks softly to it in \nMaori.\n\nSc 59     INT     MISSION HOUSE               NIGHT     Sc 59\n\nInside the REVEREND is closely watched by STEWART, AUNT MORAG and \nNESSIE as he cuts out the shape of an axe from a piece of marbled \ncardboard. A lamplight flickers warm tones across their faces while \nthe rest of the room is dark giving it a conspiratorial air.\n\n                         REVEREND\n               Nessie, your hand out ... out \n               here, please.\n\n                         NESSIE\n               Oh, no use Mr Stewart, I can't \n               act.\n\n                         REVEREND\n               Nessie, please.\n\nNESSIE hesitatingly puts her arm out towards him and the REVEREND \nchops away in the air two feet in front other, NESSIE looks at AUNT \nMORAG puzzled.\n\n                         REVEREND\n               Look you are being attacked!\n\nThe REVEREND points to the opposite rose-papered wall, where his \nshadow and paper axe now look very real as they loom large above the \ncrouching NESSIE chopping into her. NESSIE squeals, as does MARY.\n\n                         REVEREND\n               And with the blood ... it will \n               be a good effect:\n\nSc 60     INT     BAINES' HUT               DAY     Sc 60\n\nADA's finger plays the fourth black key from the left hand side, \ndenoting lesson four.\n\n                         BAINES\n               Undo your dress. This part, \n               (he indicates the top) I want \n               to see your arms.\n\nADA is taken unawares. She sits a moment unsure if she wants to \ncooperate, then slowly she staffs to undo her buttons.\n\nADA pulls her arms out of the tight sleeves. Underneath she wears a \nworn-in bodice. Her arms are so white they seem transparent. A \ndelicate network of blue-green veins crisscross up the soft underpart \nof her arms. A dark growth of hair in her armpit suggests a shadowy \ndepth. The back of her hands, normally white, are quite tanned in \ncomparison.\n\n                         BAINES\n               Play.\n\nBAINES draws his chair close. Gently he places his hand on the soft \nunderpart of her forearm. ADA stiffens and pulls away. He grips the \narm.\n\n               Two keys.\n\nADA continues to play. Slowly he moves his hand higher towards her \nshoulder. Clearly unnerved she changes the music to something brisk, \nalmost comical. BAINES feels suddenly ridiculous, his mood broken. He \ntakes his hand away and moves back to the window injured. ADA is \nvictorious, she is pleased to have won herself a respite.\n\nSc 61     EXT     STEWART'S WOODCHOP          DAY     Sc 61\n\nSTEWART is at the woodchop talking to AUNT MORAG and NESSIE.\nMARY and HENI, AUNT MORAG'S Maori girls lie sprawled out under a tree.\n\n                         AUNT MORAG\n               I hardly need to give one to \n               you, but there you are anyway.\n\nNESSIE has been sorting through a basket of invitations, finding \nSTEWART'S she hands it to AUNT MORAG who hands it to STEWART.\n\n               Don't be late. You will see \n               there are two times and since \n               you are accompanying a \n               performer, you will need to \n               make the earlier time\n\nSTEWART has stopped listening, he is watching ADA and FLORA pick their \nway through the fallen logs to BAINES path.\n\n                         STEWART\n               Wait.\n\nThe two women stop. There is a Japanese sense of deferment to STEWART\n\n                         STEWART\n               How are the lessons going?\n               ADA nods enthusiastically.\n               He's getting on all right?\n               ADA nods again\n               Good.\n\n                         AUNT MORAG\n               That is good, yes.\n\nAs ADA walks on AUNT MORAG leans towards STEWART.\n\n               She seems quieted down.  Is she \n               more affectionate?\n\nSTEWART looks after them unable to answer.\n\n                         AUNT MORAG\n               Ah well, slowly, slowly\n\nSc 62     INT     BAINES' HUT                    DAY     Sc 62\n\nBAINES secures a chair against the door while ADA is removing her \ndress top. She sits at the piano hugging herself against the chill.  \nAs BAINES passes be knocks the jacket off the chair back. He picks it \nup and takes it across to her seat by the window.\n\nBAINES nods and ADA begins to play. BAINES fingers the still warm \njacket1 he lifts it up and smells it. ADA turns around and stops \nplaying suddenly appalled by his odd sensual pleasure taking. She \nholds out her hand for the jacket, her expression stern and \ncensorious. She indicates he should return it to the chair back. \nBAINES ignores her. ADA stands and comes over to BAINES. She pulls the \njacket from his hands and replaces it across the chair back, but as \nshe turns to sit,\n\nBAINES is beside her. He pulls the shoulders of her bodice down, \nexposing her shoulders and some of her breast. ADA immediately stands, \nbut BMNES is much stronger and man-handles her across to the bed. ADA \nstruggles seriously, this is much, much more than she was expecting.\n\n                         BAINES\n               Ada, four keys.\n\nADA holds up five fingers and mouths 'five'.\n\n               I just want to lie.\n\nADA shakes her head vigorously and again mouths five'. \n\n               All right, all right five.\n\nADA no longer struggles. She is stiff and still. BAINES intoxicated by \nthe smell and presence of her skin becomes soft and gentle. He kisses \nand touches her with feeling and affection. Then suddenly aware of her \nstillness he too becomes still. He pulls himself up to see whether her \nface betrays her feelings. ADA seizes this opportunity to return to \nthe uncertain sanctuary of her piano. From the bed, BAINES watches her \nrun a hand noiselessly over the polished ivory keys, a gesture \nbetraying affection never afforded to him. BAINES gets up. He shuts \nthe piano lid forcing ADA to remove her hand.\n\nADA immediately stands and dresses, marking hurtfully BAINES' \nownership of her piano.\n\nSc 63     EXT     STEWART'S HUT               SUNSETSc 63\n\nA golden evening. STEWART in his best shirt and trousers prepares the \nhorse and cart.\n\nSc 64     INT      STEWART'S HUT  ADA's BEDROOM      SUNSETSc 64\n\nInside FLORA is in her finished Angel costume, she sings softly to \nherself while ADA undoes the long strands of plaits and separates them \nto comb.\n\n                         FLORA\n               The Holly and the Ivy...\n\nSTEWART comes in to put on his jacket, but the collar is all tucked \nin. ADA automatically adjusts it for him, settling it around his neck. \nHer touch, meant practically, strangely affects him. In an impassioned \nimpasse, meant gallantly, he tries to kiss ADA's finger tips. The \ngesture falters as ADA, surprised, jumps back.\n\nSc 65     EXT     SCHOOL HALL                    DUSK     Sc 65\n\nPeople are arriving at the school hall. One family is being ferried \nthrough the mud in a wheelbarrow.\n\n10 See Notes\n\nSc 66     INT     SCHOOL HALL                    NIGHT     Sc 66\nSome people are already seated in the hall. Several other angels have \narrived, and they like FLORA are ushered backstage.\n\nSc 67     INT     SCHOOL HALL BACKSTAGE          NIGHT     Sc 67\nBACKSTAGE, the Sunday School teacher is gathering the children \ntogether, reminding them of the order of songs, checking their hair, \netc. The local dramatic society are also preparing themselves. One of \nthe women is peeping through a hole in a make-shift curtain to watch \nthe townspeople seating themselves.\n\n                         WOMAN\n               They're bringing in extra \n               seats!\n\nDespite this, there would still be only a maximum of forty people. 10 \nor so of them MAORIS in their best European dress.\n\n                         ANOTHER WOMAN\n               Oh God, don't pin my hair too \n               high Alfred!\n\n                         STILL ANOTHER\n               Yes, me too, do it about here \n               ... (she shows Alfred)\n\nTwo of the women are putting a little c4ouring on each of the angels \nwhile two other angels are being smacked for putting their white gloved \nhands in the bucket of blood.\n\nSc 68     INT     SCHOOL HALL                    NIGHT     Sc 68\n\nEveryone is chatting at each other's seats, except the MAOIRI guests \nwho wait solemnly. AUNT MORAG is organising the placement of the new \nseats. BAINES arrives.\n\n                         MAN ONE\n               Look who's here, the musical MR BAINES\n               What will we have tonight \n               George, \"Twinkle, twinkle?\"\n\nBAINES smiles and blinks, the teasing continues as BAINES scans the \nroom for ADA. Two of the MAORI PARTY share one pair of shoes so that \nonly one may be in the hall at a time, while the other waits \nbarefooted outside.\n\n                         ANOTHER MAN\n               'Mary had a little lamb' or a \n               polka, come on George what's it \n               to be?\n\nAUNT MORAG hustles over to BAINIES and pushes him in front of her \ntowards NESSIE and the piano.\n\n\n                         AUNT MORAG\n               Mr. Baines, do come and turn \n               pages\n\nBAINES looks wildly about for rescue.\n\n                         BAINES\n               I can't read music, I have just \n               begun.\n\nBAINES backs off from NESSIE whose face drops in disappointment. He \nhas spotted ADA and is eager to take a seat near her. He takes the \nseat next to ADA but one. He sits smiling and blinking. The teasing \ncontinues, behind him.\n\n                         STEWART\n               (turning) Lot of fools. Come \n               on, move up.\n\nADA puts her hand on the seat and shakes her head indicating that she \nis saving it for FLORA. BAINES is rebuffed and looks across at ADA who \nignores him.\n\nThe main lights are put out and everyone returns to their places. In \nthe dark STEWART shyly takes ADA's hand in his. BAINES watches STEWART \nsqueezing her hand and quite out of control stands and leaves \naccompanied by a chorus of eshhhhhhhhhhhhhn. Satisfied, ADA watches \nhim go.\n\nThe children file on with their candles, They stand in a group singing \nwith great seriousness, but struck with shyness their voices are so \nsmall as barely to be heard.\n\n               -sing up Billy!\n               -Come on sing out!\n\nOne of the smallest promptly pees. An arm reaches under the curtain to \nwipe the stage.\n\nSc 69     INT     SCHOOL RALL & BACK STAGE     NIGHT     Sc 69\n\nBackstage all is ready for the main dramatic event. There seems to be \nmore peep-holes than curtains as eyes press themselves to the little \nflap. The master of ceremonies, the REVEREND is on stage explaining \nthe dramatics. He is wearing harlequin tights and rompers, his face is \ndramatically paled. The candles are blown out.\n\n                         REVEREND\n               And so the young maid came upon \n               each and all of Bluebeard's \n               missing wives, their severed \n               heads still bleeding, their \n               eyes still crying.\n\nThe piano accompaniment is suspenseful while the audience shriek \nappreciatively. Backstage AUNT MORAG provides the dripping blood, \nmoving between the corpses, she peers at the audience through a peep-\nhole in the curtain.\n\n                         REVEREND\n               But who it this? \n\n(AUNT MORAG looks around gasping, fooled despite herself)\n\nA loud improvised door slam and heavy footsteps. NESSIE, in costume, \nfreezes. The shadow of Bluebeard moves clumsily down the cut-out \nbanister and along the corridor.\n\n                         BLUEBEARD\n               I am home early my sweet wife \n               ... where art thou?\n\nThe girl scrambles for the fallen key and rushes out of the closet \ninto the silhouette corridor.\n\n                         YOUNG WIFE\n               Hello husband, what a surprise!\n\n                         BLUEBEARD\n               Yes wife, a surprise indeed! So \n               now you know my secret you, the \n               sweetest and youngest or all my \n               wives must be prepared to die.\n\nBLUEBEARD pulls out a cut-out axe and moves towards her.\n\nTwo of the young warriors in CHIEF NIHE's party rise to their feet.\n\n               Auc! Ha aba ra tenei?\n               (Hey! What's this)\n                    SUBTITLED\n\n               E Nilie, E Nihe he Kohuru, he \n               kohurn?\n               (Nihe, Nihe is this murder?)\n                    SUBTITLED\n\nNIHE waves them down, but they are shaken up and only crouch above \ntheir seats. The others stare anxiously between NIHE and the stage.\n\n                         NIHE\n               (Amused by them)\n               E te whsnau keite pai-he takaro \n               tenei.\n               (Everything is fine this is \n               just a game)\n                    SUBTITLED\n\nBLUEBEARD moves closer, the young wife drops to her knees her hands \nheld up in prayer.\n\n                         YOUNG WIFE\n               No, no wait!\n\n                         BLUEBEARD\n               I shall not wait. Bare your \n               neck.\n\nAs BLUEBEARD raises his axe again, first one then the other of the \nyoung warriors run forward, shouting a fierce war cry and parting the \naudience, who flee to either side while the corpses come very much to \nlife.\n\n               Kia hiwara! Kin hiwara! \n               (Be on the alert! Brace \n               yourself)\n\n               Pokokohun - whakaputa mai ja \n               koc! \n               (Coward! Show yourself, come \n               out!)\n                    SUBTITLED\n\nOnly NIHE and his top-hatted daughter remain calmly in their seats. \nThe warriors have BLUEBEARD cornered and whimpering an umbrella held \nspear-like above him. NIHE stomps his stick, his great voice booming \nout.\n\n                         NIHE\n               Hoki rnai! Hoki rnai!\n               (Come back here! Come back \n               here!)\n                    SUBTITLED\n\nSc 70     INT     SCHOOL HALL BACK STAGE       NIGHT     Sc 70\n\nBackstage the CHIEF and his party are shown the theatrical devices; \nthe blood-bucket, the paper axe, the splits in the sheets.\n\nSc 71     INT     BAINES' HUT                    DAY     Sc 71\n\nADA goes to the piano, she is upset that BAINES has again left a plate \non top of it. BAINES intercepts her, stepping several times between \nher and the piano. She sees the game and stands still. He steps aside. \nShe removes the plate, gently, lovingly wiping the surface underneath. \nThere is a sulky irritation in the ways BAINES watches her.\n\n                         BAINES\n               I have been waiting. You are \n               very late.\n\nADA starts to play, BAINES watches then looks away.\n\n                         BAINES\n               I don't want you to play. I \n               just want you to sit.\n\nADA keeps playing until she has finished. Without looking at him she \nholds up two fingers against the piano.\n\n                         BAINES\n               (angry) No, not two keys.\n\nADA starts playing again, BAINES feels powerless. He no longer admires \nher absorption with the piano, he is jealous of it.\n\n                         BAINES\n               (shouts) Two keys then!\n\nShe stops playing. There is an insolence or casualness in the way she \nregards BAINES. He pulls her chair back from the piano. This upsets \nher, as much of her confidence was associated with the instrument. \nBAINES kisses her passionately on the mouth. ADA pulls back, BAINES \npersists, he is desperate and romantic.\n\n\nSc 72     EXT     BASE OF BUSH COVERED HILL     DAY     Sc 72 \n\nSTEWART, with BAINES interpreting, talks with a group of MAORIS at the \nbase of a bush covered hill. The MAORIS sit behind a small \nrepresentation of the hill marked out with twigs on the ground. The \natmosphere is tense.\n\n\n                         MAORI NEGOTIATOR\n               (pointing to the places)\n               Nga awa kau kau, nga ana koiwi \n               0 matoti mattia tunpuna; kei \n               runga katoa i te whenua nei \n               korerongia atu ki to tangata na \n               e Peini. \n               (The bathing waters, the caves, \n               that house, the remains of our \n               ancestors are all part of this \n               land. Explain it to the man \n               Baines.)\n                         SUBTITLED\n\n                         STEWART\n               (muttering to BAINES across the \n               previous speech) What do they \n               say? Are they selling? Offer \n               the blankets for half the land.\n\nSTEWART holds up his ten fingers and then two more.\n\n                         STEWART\n               T-w~e-l-v~e.\n\n                         BAINES\n               Te, kawnarna paraikete mo te \n               tahi hawlie 0\n               te whenna uci.\n               (he'll give you twelve blankets \n               for half the land.)\n                    UNSUBTITLED\n\nThe MAORIS look carefully at the quality of the blankets, noting the \ndepth of the weave and the strength of the Wool. They shake their \nheads as they discuss them.\n\n                         STEWART\n               (Quietly to BAINES)\n               Offer the guns.\n\n                         MAORI NEGOTIATOR\n               Kahore atu he kororo. Kahore \n               niaton Kote hake whentia. Engad \n               mate peaks ne. \n               (No more talk, we won't sell \n               the land. I will trade you \n               pigs, that is all.)\n                    SUBTITLED\n\nHe messes up the pattern of twigs as he speaks.\n\nANGRY MAORI\n(Angry to the NEGOTIATOR) \nHe aha te pononga 0 te whenus \npena kahore he Pu hei pupuri?\n(What is the point of owning \nour land if we have no guns to \nhold it?)       \n\n     SUBTITLED\n\nThe MAORI NEGOTIATOR gets up to leave as do the others, STEWART \nsnatches back his blankets and sulkily shakes them out to fold.\n\n                         BAINES\nE hoa ma, haria atu ra takit \nkia Nihe. \n(Give my regards to Chief \nNihe.)\n\nMAORI NEGOTIATOR\n(Others join in)\n\nAc ra. Kia Ora! Kia Ora! Te \nPeini.\n(Yes indeed! Thank you. Thank \nyou, Peini.)\n\n\nSc 73EXT     BUSH AT NEW BOUNDARY MARKERSDAYSc 73 \n\nBAINES and STEWART walk through the bush. STEWART laden down with his \nblankets, red-faced and irritable.\n\n\n\n                         STEWART\nWhat do they want it for? They \ndon't cultivate it, burn it \nback, anything. How do they \neven know it's theirs?\n\nBAINES stops as he comes to a freshly placed fence post. STEWART winds \ndown his complaints watching BAINES anxiously. BAIXES walks down to \nthe next one. he touches the freshly split post.\n\n(tentatively) I thought I might \nas well mark it out.\n\n                         BAINES\nYes, why not.\n\n                         STEWART\nAda says you're doing well with \nthe piano?\n\nBAINES keeps walking from post to post.\n\n                         STEWART\nI'll have to come and hear you \nplay. what do you play.\n\n                         BAINES\nNothing just yet\n\n\n                         STEWART\nNo. Well I suppose it takes \ntime.\n\nSc 74EXT     STEWARTS VEGETABLE PATCHDAYSc 74\n\nADA has cut a good sized cabbage in the vegetable patch. She throws it \nto FLORA who misses, dropping it in a pool of mud, spattering her face \nand dress. ADA smiles and FLORA who was about to cry gives the cabbage \na big football beet towards her mother. ADA's mouth falls open, but \nthen she too kicks it and they begin to dribble the mud caked cabbage \ntowards the hut, all the time signing playful insults. Into this \narrives STEWART.\n\n                         STEWART\nBaines can't play a damn thing. \nIs that right he can't play a \nthing?\n\nWe're going to lose that land, \nthe way he was carrying on over \nit.\n\nIs he musical? You've got to \nteach him a song. Something \nsimple.\n\nFLORA has her foot on the cabbage, she nudges it off behind her. It \nroll down the hill. STEWART can't help but notice,\n\n                         STEWART\nWhat's that?\n\nHe follows the cabbage down the hill' where he scrapes some of the mud \noff.\n\nThis thing's been knocked to \npieces.\n\nSc 75     INT/EXT     BAINES' HUT                    DAY     Sc 75\n\nFLORA is seen through BAINES' window Inside, ADA as ever charts her \nprogress on the black keys, eleven. She turns to BAINES for \ninstructions.  BAINES is not himself, he is sulky and distant.\n\n                         BAINES\nDo what you like. Play what you \nlike.\n\nADA is perplexed by this turn about of behaviour. A little \nuncertainly, she sets about her playing. After a little she too turns \nto see what BAINES is doing. He's not there. She is surprised then \nanxious as she fears the deal may be off when there are flaw so few \nkeys to go. She starts to play again, but her anxieties prove too \ngreat. She stops and listens. She looks out the window, where FLORA is \nmucking about in the yard. She walks to his bedroom, listens, then \nopens the door. BAINES stands naked looking at her. ADA is taken aback\n\n                         BAINES\nI want to lie together without \nclothes on. How many would that \nbe?\n\nADA holds up ten fingers an impossibly high number of keys.\n\nBAINES nods.\n\nADA is surprised; she didn't expect him to agree. ADA checks again \nholding up her hands.\n\n                         BAINES\nYes, ten keys.\n\nHesitantly, she starts to undress. She lies on her petticoat, having \ndeemed the bed too dirty. BAINES lies, very still on top of her. A \nscraping sound is heard.\n\nSc 76     EXT/INT     BAINES' HUT                    DAY     Sc 76\n\nFLORA is outside walking on sticks and logs trying to make sure she \nnever puts her foot on the ground. She looks over at the house \nsuddenly aware that the piano playing has stopped again. She \ninvestigates the mystery peeping through the various cracks and holes \nin the loosely built hut. Her vision is always only parts of bodies, \nthe venture is one of challenge and curiosity.\n\nSc 77     EXT     NATIVE PINE FOREST          DAY     Sc 77\n\nFLORA and three small Maori children play amongst some native pines. \nTwo MAORI WOMEN smoke and chat nearby. The children rub up and down \nagainst the tree trunks kissing and hugging them. The game has an edge \nof promiscuity to it as they exchange trunks and hug one tree as a \ngroup. Unseen by the children STEWART marches towards FLORA. He pulls \nher off the tree.\n\n                         STEWART\n               Never behave like that, never \n               any where. You are greatly \n               shamed and you have shamed \n               those trunks. (trees)\n\nThe MAORI WOMEN keep up an unacknowledged chant.\n\n                    MAORI WOMEN\n               What o'clock say Mr Stewart?\n               -Ge Tupeka?\n               (got tobacco?)\n               -Time for puff puff.\n\nSc 78     EXT     NATIVE PINE FORESTDAY     Sc 7$\n\nWith a bucket of dull soapy water FLORA begins the task of washing the \ntree trunks.\n\nThe MAORI WOMEN laugh and point to their feet meaning her to wash them \ntoo.  Their children are lying in their laps playing string games.\n\nSc 79     EXT     NATIVE PINE FORESTDUSK     Sc 79\n\nFLORA is still washing the tree trunk silhouetted against the evening \nsky\n\nFLORA is tearful and sorry for herself. The job has an increased \nfutility as it has begun to rain- STEWART is inspecting her penance. \nShe follows STPWART about the trees.\n\n                         FLORA\n               (sulkily) I know why Mr. Baines \n               can't play the piano.\n\n                         STEWART\n               You've missed this bit.\n\n                         FLORA\n               She never gives him a turn.\n\nSTEWART stops and looks at her.\n\n               She just plays whatever she \n               pleases, sometimes she doesn't \n               play at all.\n\nSTEWART continues through the trees more slowly.\n\n                         STEWART\n               And when is the next lesson?\n\n                         FLORA\n               Tomorrow.\n\nFLORA puts her bucket on her head to protect herself from the rain.\n\nSc 80     EXT     PATH TO BAINES'          DAY     Sc 8O\n\nThe next day is very windy, the tops of trees are thrashed by fierce \ngusts of wind and some smaller branches crash to the ground. ADA's \nlong dress and cape flap uncontrollably. FLORA's smaller cape stands \nout on end. Birds fly in mad wind-battered courses, swooped up then \nstrangely drawn down.\n\nSc 81     EXT     BAINES'               DAY     Sc 81\n\nADA and FLORA arrive at BAINES' place to see the piano emerge from the \nhut carried by six MAORI MEN, one of whom does nothing but walk beside \nit \"plonking\" the keys. Another group of MAORIS sit cross-legged on \nthe verandah playing draughts. Panicked ADA hurries down the hill to \nthe hut. FLORA follows behind.\n\nSc 82     INT     BAINES' HUT               DAY     Sc 82\n\nInside the hut, HIRA, the old woman from the bathing spot, is smoking \nher pipe. ADA enters distraught and indicates what she has seen. Her \nface is flushed and whipped by the wind. She is much more expressive \nthan normal.\n\n                         BAINES\n               I am giving the piano back to \n               you. I've had enough.  The \n               arrangement is making you a \n               whore and me wretched.\n               I want you to care for me, but \n               you can't.\n\nBAINES sits down on a chair and prepares to eat, somewhat ignoring \nADA. ADA is confused not quite believing the situation. She watches \nBAINES for some kind of confirmation.\n\n                         HIRA\n               (softly) George, can I use this \n               comb?\n\n\nBAINES nods. ADA is still watching. HIRA scrapes the inside of her \npipe with the comb.\n\n                         BAINES\n               It's yours, leave, go on go!\n\nADA is off balanced by the reversal of attitudes, surprised too, that \nshe doesn't want to go. FLORA is fast to leave, ADA follows to \norganise and protect her piano on the journey.\n\nSc 83     EXT     BAINES' HUT & BUSH     DAY     Sc 83\n\nAs she climbs out of the small valley surrounding BAINES' hut, she \nstops and walks back to look down at BAINES and his hut, in the EXACT \nsame manner that she once looked at her piano from the cliff-top above \nthe beach. BAINES is throwing the scraps of his meal to his dog, he \ndoes not look up.\n\n\nSc 84     EXT     PATH TO BAINES' HUT STEEP HILL DAY     Sc 84 \n\nSTEWART, on his way to BAINES, sees THE PIANO BEARERS and ADA way \nbelow him in the bush. He scrambles down a steep slope towards them.\n\n                         STEWART\n               (stiffly from some distance) \n               Stop right there'. This isn't \n               yours  what are you doing with \n               the piano?\n\nThe women exchange looks.\n\n                         FLORA\n               He's given it to us.\n\n                         STEWART\n               (out of breath) Hah, you're \n               very cunning Ada, but I've seen \n               through you, I'm not going to \n               lose the land this way. Wait \n               here!\n\nSTEWART is off, pounding on down through the bush.\n\n\nSc 85EXT/INT     BAINES' HUT/BEDROOM     DAY     Sc 85 \n\nHIRA is sitting on the front step of BAINES' place, blocking STEWART'S \neasy access.\n\n                         HIRA\n               George sick, he don't wanna see \n               nobody. You got Tupeka for the \n               Hira?\n\nSTEWART goes around to a side window in BAINES' bedroom. BAINES is \nsitting on the bed, but lies back as he hears STEWART coming about the \nside of the house. STEWART opens up the window.\n\n                         STEWART\n               I don't think you should have \n               given up the piano. I will make \n               sure you are properly taught, \n               with music written on to sheets \n               and...\n\n                         BAINES\n               I don't want to learn.\n\n                         STEWART\n               You don't want to learn.\n\n                         BAINES\n               No.\n\n                         STEWART\n               And what does this do to our \n               bargain? I cannot afford the \n               piano if you mean me to pay.\n\n                         BAINES\n               No, no payment. I have given it \n               back. I don't want it.\n\n                         STEWART\n               Well, I doubt I want it very \n               much myself.\n\n                         BAINES\n               It was more to your wife that I \n               gave it.\n\n                         STEWART\n               Well, thank you, I expect she \n               will appreciate it.\n\nHe closes the window.\n\n               So that is agreed on?\n\nBAINES nods.\n\nHIRA has wandered stiffly into BAINES' room. She sits on the edge of \nhis bed.\n\n                         HIRA\n               You make BIG mistake George. In \n               first place you should swap \n               land for wife. Now look, she \n               gone, you no land, no music \n               box, you got nothing.\n\nSCENE 86 DELETED\n\nSc87     EXT/INT     STEWART'S HUT     DAY     Sc 87\n\nAt the door of the hut STEWART is distributing buttons to the piano \nbearers. \nOne squats catching them as they fall. A commotion begins as one of \nthe MAORIS snatches the whole jar and runs off. Two of them give chase \nwhile the others insist on tobacco.\n\n11 See Note\n\nInside the hut ADA had lifted the top of the piano and is peering in \nwhile playing notes to check tune and damage.\n\n                         STEWART\n               Is it all right? Aren't you \n               going to play something?\nADA pulls up a chair and seats herself at the piano. She rubs her \nhands and places them lightly on the keys, she turns from habit over \nher left shoulder where STEWART waits crossed armed. Quickly she \nremoves her hands, stands and gestures FLORA to play. FLORA proudly \ntakes ~p the seat, she pulls her lips in trying to control her \nhappiness to say in front of both her mother and STEWART.\n\n                         FLORA\nWhat will I play?\n\nShe looks to ADA, who looks back through her not concentrating.\n\n                         STEWART\nPlay a gig.\n\n                         FLORA\n(to ADA) Do I know any gigs?\n\n                         STEWART\nPlay a song then\n\nFLORA starts a song, ADA walks past them out of the hut, STEWART \nignores her exit moving up to lean on the piano. ADA is seen through \nthe hut window wandering amidst the ghostly, blackened trunks. \nSTEWART'S attention is drawn to ADA, he interrupts FLORA'S singing \nwith a sudden outburst.\n\n                         STEWART\n(exasperated) Why won't she \nplay it? We have it back, and \nshe just wanders off!\n\nFLORA stops to watch her mother through the window. ADA looks towards \nthe house as the music stops.\n\n                         STEWART\nKeep playing!\n\nGrimly STEWART slaps the top of the piano to FLORA's playing.\n\nADA continues to walk, her face dark and puzzled. She stops. Her head \nstiffly, irresistibly, lifts and turns in the direction BAINES' hut. \nShe peers deep into the bush as if attempting to penetrate a puzzle. \nShe thinks and walks on.\n\nSc 88     INT     STEWART'S KITCHEN     DAY     Sc 88\n\nThe next day ADA and her piano face each other across the kitchen. A \nslit of light falls across the piano highlighting it's rosey walnut \nwood. ADA's expression is critical and distant.\n\nTaking a cloth she begins to clean and polish the piano. Her finger \nholds down one of the keys and we glimpse an old inscription on its \nside, a small heart, and an arrow. Putting the cloth aside she sits at \nthe piano to begin playing.\n\nShe starts with wholehearted feeling, her eyes closed, but before long \nshe is surprised by a moving reflection across the piano and she \n'starts', glancing over her shoulder. She stops and begins again. But \nonce more a reflex has her glance across her left shoulder and she \npauses in her playing. Disquieted she starts again and again she looks \naway. She stops, confused, unable to go on, unable to getup, one hand \non the lid and one on the piano keys.\n\nSc 89     EXT     PATH TO BAINES'     DAY     Sc 89\n\nADA carrying her cape and bonnet hurries through the narrow bush path \nto BAINES' hut, FLORA has a fist of her skirt and is pulling back. ADA \nturns on FLORA and snatches the skirt out of the girl's hand. ADA \nsigns to her and continues on.\n\n                         FLORA\nWhy? Why can't I?\n\nADA signs again.\n\n                         FLORA\n(crossing her arms) I shan't \npractise and I DON'T CARE!\n\nBut ADA does not wait to listen. FLORA walks back through the bush \nmuttering childish expletives to herself. STEWART and his two MAORI \nhelpers come out of the bush towards her. FLORA squeals with fright.\n\n                         STEWART\n(looking up the hill) Where's \nyour mother? Where has she \ngone?\n\nFLORA pauses petulant and grumpy.\n\n                         FLORA\n               To HELL!\n\nFLORA races off as fast as she can, enlivened by her wickedness. \nSTEWART clambers back up the path. He just glimpses the distant figure \nof ADA nervously turning, her skirts flying as she hurries up the bush \npath The wind bothers the tops of the trees, setting them groaning, \nrubbing their branches against each other.\n\nSc 90     INT     BAINES' HUT          DAY     Sc 90\n\nADA enters BAINES' hut, she is breathless1 announcing her presence by \nsimply being there, standing there. BAINES comes through from the \nbedroom. Seeing ADA he is aloof, suspicious and his blinking becomes \npronounced.\n\n                         BAINES\n               So what brings you here? Did \n               you leave something? I have not \n               found anything.\n\nADA does not respond, finally she looks at BAINES and her look has a \nvulnerability and frankness that takes him off guard.\n\n               Does he know something?\n\nADA shakes her head.\n\n               The piano is not harmed? It \n               arrived safely? Would you like \n               to sit? I am going to sit.\n\nADA does not sit. She stands immobilised.  BAINES attempts to maintain \nhis casual charade) he pours a tea.\n\nHe turns to her about to speak, but stops unmanned by a new fragility \nto her strength. He blinks rapidly\n\n                         BAINES\n               Ada, I am unhappy because I \n               want you, because my mind has \n               seized on you and thinks of \n               nothing else. This is how I \n               suffer, I am sick with longing. \n               I don't eat, I don't sleep. If \n               you do not want me, if you have \n               come with no feeling for me, \n               then go!\n\nBAINES walks roughly towards the door and opens it, his softness \nturned suddenly cruel.\n\n               Go! Go NOW! Leave!\n\nADA is stung by his change of tune, she takes a step towards him and \neyes filling with tears of anger hits him hard across the face. \nBAINES' nose begins to bleed yet his face slowly lights up as if she \nhas spoken words of love. ADA is flushed, shocked, the two face each \nother at this very moment of profound awareness of each other, \nprofoundly equal. With each new breath, with every moment that their \neyes remained locked together the promise of intimacy is confirmed and \nreconfirmed and detailed until like sleepwalkers who do not know how \nthey came to wake where they did, they are standing next to each other \nand beginning to kiss each other, the lips, the cheeks, the nose. \nThere is nothing practised about their tenderness, only their feelings \nand emotions guide their instincts. BAINES' face crumples with the \nexquisite pain of his pleasure, ADA cradles his head to her chest. \nBAINES struggles through her dress anxious to touch her skin.\n\nSc 91     EXT/INT     BAINES' HUT          DAY     Sc 91\n\nOutside STEWART surveys the hut suspiciously. BAINES' dog growls as he \nclimbs on to the small verandah. Carefully STEWART peers through some \nloosely slatted boards. There are sounds inside which are worrying \nhim. By standing on the seat he has found a spyhole where he can see \nADA and BAINES kissing, undressing\n\nHe reels back angry, but just as we might expect him to burst through, \nhe steps up to look again; the fatal second look, the look for \ncuriosity. He watches BAINES bare-chested undressing ADA, her buttons \nburst, ADA laughs, BAINES touches her under her skirts - anywhere, he \ntakes himself under her dress pulling down her stockings. STEWART \nwatches, stepping down to peer lower as BAINES buries into ADA's \nskirt. He does not seem to notice the dog licking his hand. Suddenly \nhe pulls his hand away and looks at it, wet with dog saliva, he wipes \nit on the boards and continues watching as if mesmerised.\n\nSc 92     INT     BAINES' BEDROOM     DAY     Sc 92\n\nInside BAINES' small bedroom the raw dark boards contrast with the \nsoftness, whiteness of BAINES' and ADA's bodies, The long black \nstrands of ADA's hair stick to her cheek and wrap around her neck. Her \nface is flushed and her eyes are bright. BAINES rolls his face across \nher chest, gently, slowly savouring the flavour of her body. Drunkenly \nthey continue their sex slowly, slowly. ADA's breaths turn to low \nmurmurs; these small sounds are extraordinarily moving to BAINES whose \nface swoons with joy.\n\n                         BAINES\n               What?  What?  whisper....\n\nSc 93     INT     BAINES' BEDROOM&UNDER HOUSEDAYSc 93 \n\nAs ADA dresses, BAINES sits on his bed watching. He is unhappy, \nthoughtful.\n\n                         BAINES\n               Now you are going I am \n               miserable, why is that? (He \n               catches her hand and draws her \n               to hint) Ada I need to know, \n               what will you do? Will you come \n               again?\n\nADA is distracted, collecting her buttons from the floor, concerned at \nthe time past, worried to dress and return.\n\nThe camera cranes down and down to find STEWART wedged under the loose \nwooden floor slats. He cannot hear clearly, but ADA's hand reaching \nfor each button is only inches away. One falls through a slat on to \nSTEWART'S neck and on down his shirt collar. As she stands he rolls \nout.\n\n                         BAINES\n               Wait! I don't know what you're \n               thinking. (gently, teasingly) \n               Does this mean something to \n               you? Hey? (Stroking a strand of \n               hair behind her ear) I already \n               miss you. Ada, do you love me?\n\nADA considers this question. Clearly she doesn't know, the question is \nmore complex to her than to him, then as if by way of answer she \nkisses him strongly and sexually. BAINES pulls away confused. ADA \nfinishes dressing. BAINES comes up behind her to help with the \nbuttons.\n\n                         BAINES\n               (anxiously) Come tomorrow. If \n               you are serious, come tomorrow.\n\nADA turns and kisses him passionately, with the new born enthusiasm of \nsomeone who has just discovered their appetite for sex. Then as \nquickly as she began, she takes her hood and cape and goes to leave.\n\n                         BAINES\n               Tomorrow?\n\nShe nods and is gone.\n\nSc 94     INT     STEWART'S HUT ADA'S BEDROOMNIGHTSc 94\n\nFLORA and ADA are both in their white nightgowns. FLORA stands behind \nADA on a chair trying to sort out the knots that have matted at the \nback of ADA's head. ADA shakes her head from side to side playfully, \nmaking the difficult job impossible.\n\n                         FLORA\n               Stay still! It's the very worst \n               knots.\n\nFLORA tries to hold her mother's head still but ADA's high spirits are \nunstoppable and her hair flies out from side to side flicking FLORA in \nthe face.\n\n                         FLORA\n               Mama STOP IT!\n\nFLORA starts to giggle and retaliates flinging her own hair from side \nto side. The two women are twirling in the small bedroom their hair \nflying about them, FLORA is shrieking with the fun, then stops dizzy \nand sick. ADA continues flicking FLORA as she twirls.\n\n                         FLORA\n               Stop it I feel sick!\n\nBut ADA doesn't stop, her dark hair whirls about her, as giddy and \ndisorientated, she knocks against the walls\n\nSc 95     INT     STEWART'S HUT     NIGHT     Sc 95\n\nNext door STEWART sits on his bed listening, his hair wet and neatly \ncombed. He has a journal of pressed botanical specimens beside him. \nHearing FLORA squealing he goes to the kitchen and standing back in \nthe shadows, watches ADA frenetic, whirling through the part open \ndoor.\n80\nSc 96     INT     STEWART'S HUT ADA'S BEDROOMDAWNSc 96\n\nDaylight floods the room as ADA secures the pins at the back of her \nhair.\n\nSc 97     EXT     PATH TO BAINES'          DAYSc 97\n\nMusic builds and plays throughout.) The sky is dark and the wind is \nballooning ADA's cape, wrapping it up high around her. The tree tops \nare swaying furiously. Inside the bush it is dark and ADA hurries up \nthrough the path. She is out or breath and glancing behind her as if \nto guard against followers, when directly in front of her STEWART \nsteps out onto her path. ADA stops short. The look on his face is \nunlike any expression she has yet seen. His eyes do not look at her, \nbut all about her in a way more animal than human. She lowers her eyes \nand calling his bluff walks steadily past him. But STEWART takes her \narm and spinning her back, pulls her close and blind to all protest \nkisses her. ADA struggles furiously. His grip falters and she steps \nback staring at him, then runs off down the hill, but STEWART is on \ntop of her clasping her skirts, pulling her towards him hand over \nhand, she slips and falls to the ground. STEWART is upon her, lifting \nher dress, touching her legs, ADA goes quite still, which throws \nSTEWART long enough for her to scramble away, yet again STEWART \ncatches her and again they roll on the ground, STEWART touching and \nkissing her, ADA turning herself this way and that to avoid it. There \nis a cat and mouse quality to their mute struggle finally broken by \nFLORA calling up the path, distraught and in tears, her angel wings \nhave twisted about her waist.\n\n                         FLORA\n               (TOP OF HER LUNGS) Mumma! \n               Mumma! They are playing your \n               piano!\n\nSTEWART allows ADA to get up and the two women go back down the path \ntowards home. The distant sound of the piano keys thumping.\n\nSc 98     INT     STEWART'S HUT     DAY     Sc 98\n\nAt the piano and with solemn dignity sits a MAORI WOMAN. She is \nwearing a top hat and a long black dress, beside her stands the MAORI \nwho absconded with the buttons, most of which he has attached to his \njacket. She plays loudly with two closed fists, her companion listens \ngravely, placidly, blinking at the crashes, two others listen from the \ndoorway, one with his bands over his head.\n\nSc 99     INT/EXT     STEWART1S HUT     DAY     Sc 99\n\nFLORA and ADA stand in the hut while fierce hammering can be heard \noutside. STEWART is boarding over the windows, barricading them in.\n\nFLORA joins in the spirit of be exercise gaily pointing out any slats \nSTEWART has missed.\n\n                         FLORA\n               Here Papa!\n\nADA's face pales in the diminishing light. Exasperated by the \nthreatened incarceration she shakes her head with anguish and moving \nto the piano lifts the lid and plays several bars brutally and \nstrongly. She passes on to the bedroom, where she picks up the small \nhand mirror and looks at her face puckered with frustration. She \ntouches her face and neck tenderly, then throws herself on the bed, \nface to the wall, her hands over her ears.\n\nFLORA stands over her mother.\n\n                         FLORA\n               You shouldn't have gone up \n               there, should you? I don't like \n               it and nor does Papa. Mama, we \n               can play cards together.\n\nADA rolls over, her eyes closed she pushes her face and body against \nthe mattress. The movement is sensual and removed. FLORA stops dealing \nthe cards on to the bed and watches her mother puzzled.\n\nSc 100INT     STEWART'S HUT     NIGHT     Sc 100\n\nIt is night and ADA is walking in the dark, ghostly in her white \nnightgown. She sits at her piano and begins to play loudly and \nstrongly. Her hair is loose and she seems half-asleep. FLORA and \nSTEWART wake to the loud playing and fumble their way to the kitchen. \nSTEWART carries a lit candle. ADA continues her playing\n\nFLORA passes a hand in front of ADA's face.\n\n                         FLORA\n               She is asleep, look.\n\nOne night she was found in her nightgown on the road to London. \nGrandpa said her feet were cut and bleeding so badly she couldn't walk \nfor a week.\n\nThe two watch ADA, mesmerised by her compulsive playing.\n\n12 See Note\nSc 101EXT     STREAM NEAR STEWARTS'DAY     Sc 101\n\nSTEWART stands guard while ADA and FLORA wash their clothes in the \nstream. FLORA is taking the lead, soaping up the clothes, she passes \nthe garments to her mother to rinse. ADA is distracted and as she \ntakes the clothes, she just as soon lets them go and they float off \ndown the stream past STEWART who tries to catch them but can't. Two \nMAORI BOYS continue the chase, enjoying the fun, thinking it a great \nadventure.\n\n                         STEWART\n               You are letting the clothes \n               float off... They are floating \n               off.\n\nADA stares off into the distance rocking lightly back and forth as she \ncrouches on a stone. Her dress unhitched floats down the stream behind \nher.\n\n12.See notes\n\n                         FLORA\n               Mama! Look out!\n\nFLORA wades across to grasp yet another garment ADA has let drift off.\n\nSc 102EXT     STEWART'S          DAY     Sc 102\n\nOn the way back to the barricaded hut FLORA swings between ADA and \nSTEWART.\n\n                         FLORA\n               One, two, three\n               One, two, three\n\nADA glances around at the bush. FLORA beams enjoying a feeling of \nfamilyness of which she is now the boss. The two women go ahead into \nthe hut which STEWART shuts and secures with a beam.\n\nSc 103INT     STEWART'S HUT ADA'S BEDROQOMNIGHT     Sc 103\n\nIt is night. ADA is tossing in the small bed beside FLORA, her hair \nwound across her face, she makes low moaning sounds as she pushes her \nface and body up against the sleeping FLORA. Her movement and moans \nincrease until she wakes suddenly sitting bolt upright.\n\nSc 104INT     STEWART'S KITCHEN & BEDROOMNIGHT     Sc 104\n\nADA walks through the kitchen, small slithers of moonlight lighting \nher path. She walks past the piano into STEWART'S room who has gone to \nsleep with his candle still alight. ADA looks, then slowly her hand \nhovers above him before lightly touching his face. His eyes open, he \nlooks towards ADA anxious and surprised, but as ADA continues, his \nreserve breaks and he is captive to his own sensations. She pulls down \nthe sheet and strokes his neck, shoulders, chest, he reaches out \ntowards her.\n\n                         STEWART\n               Ada!\n\nBut ADA scowls and pulls away roughly, STEWART lies back anxious not \nto break the spell and when he is still ADA continues to caress his \nchest. His eyes well with tears and he looks up into her face like a \nchild after a bad dream, fearful and trusting. ADA continues like a \nnurse spreading ointment on a wound, tenderly and attentively she \nstrokes down towards his belly. STEWART'S skin goose bumps and be \nshudders. He puts his hand on hers to still it1 she slides hers out \nand continues stroking. He looks at her pleadingly and childlike, she \nstops and kisses the soft skin of his belly, STEWART groans clutching \nthe mattress. ADA seems removed from STEWART as if she has a separate \ncuriosity of her own.\n\nSc 105INT     STEWART'S KITCHEN          DAY     Sc 105\n\nNext day AUNT MORAG stands circling in STEWART'S small darkened house. \nFLORA and ADA sit quietly together\n\n                         AUNT MORAG\n               Ohhh, it's so dark, it's like a \n               dank cave.\n\n                         NESSIE\n               Yes, like a cave.\n\n                         AUNT MORAG\n               Ohh no, it makes my skin creep!\n\nSTEWART comes into the house with some logs, AUNT MORAG follows him \nacross to the fire.\n\n                         AUNT MORAG\n               Alisdair, is it because of our \n               play? Have the natives \n               aggressed you?\n\n\nShe continues following him to the door.\n\nI have to say you have done the wrong thing here, you see you have put \nthe latch on the outside. When you close the door, (and she doses it) \nit will be the Macna that lock you in, you see? With the latch on that \nside you are quite trapped.\n\n                         NESSIE\n               (nodding her head in imitation) \n               ... you are quite trapped.\n\nAUNT MORAG walks inside and continues to the table where her basket \nfull of clothes and packets of food have been left. She lifts it from \nthe table and begins to spread the cloth.\n\n                         AUNT MORAG\n               We have just come from George \n               Banes' and they have taken him \n               over. It is no wonder he is \n               leaving, he has got in too deep \n               with the natives. They sit on \n               his floor as proud as Kings, \n               but without a shred of manners.\n\n                         NESSIE\n               (in unison) ... without a shred \n               of manners.\n\nNESSIE and AUNT MORAG are unpacking parcels of cakes and biscuits\n on plates putting them about the table.\n\n                         AUNT MORAG\n               He is quite altered, as if they \n               had been trying some native \n               witchcraft on him. Well \n               tomorrow or the day after he \n               will be gone.\n\n                         STEWART\n               Baines is packing up?\n\n                         AUNT MORAG\n               Well he has NOTHING to pack, \n               but he is leaving. And it is \n               just as well; Nessie has \n               foolishly grown an affection \n               for him ... we have had some \n               tears\n\nAt this mention NESSlE's face crumples and tears again begin to flow.\n\n                         AUNT MORAG\n               (very firmly) STOP IT! STOP! \n\nNESSIE remarkably obeys, blinking her face back to shape.\n\nADA attempts to disguise her agitation, she moves to the piano and \nstrokes it, she begins to play.\n\n               I am quite frightened of the \n               way back, we must leave in good \n               light. Will we be safe?\n\n                         STEWART\n               (wanting them gone) If you \n               leave soon, yes, I am sure of \n               it.\n\nSTEWART and MORAG watch ADA at the piano. Her playing develops until \nshe is fully absorbed. AUNT MORAG is intrigued despite herself\n\nSc 106EXT     BUSY ROAD TO MISSIONDAY     Sc 106\n\nOn the edge of the bush beside the dirt road to town AUNT MORAG \nattempts a discrete toilet stop. NESSIE keeps guard holding up the \ncape while one of their MAORI charges holds up another.\n\n                         AUNT MORAG\n               You know I am thinking of the \n               piano. She does not play the \n               piano as we do Nessie.\n\nThe cape begins to droop as NESSIE listens.\n\n               UP! UP! No she is a strange \n               creature and her saying is \n               strange like a mood that passes \n               into you. You cannot teach that \n               Nessie, one may like to learn \n               but that could not be taught.\n\nNESSIE again lets the cape droop.\n\n               Up! Your playing is plain and \n               true and that is what I like. \n               To have a sound creep inside \n               you is not all pleasant\n\nA fluttering sound in the bush.\n\n               what is that?\n\n                         NESSIE\n               (frightened) Ohhhhhh!\n\n                         MARY/HENI\n               (slow, relaxed) A pid-geon \n               Auntie.\n\nThe party finish and hurry a little spooked on the road to town.\n\nSc 107INT     STEWART'S ROOM     NIGHT     Sc 107\n\nIt is night. ADA enters the room, STEWART looks at her shyly.\n\n                         STEWART\n               I've been hoping you would \n               come.\n\nADA strokes his brow. STEWART closes his eyes, breathing heavily \nrelieved. ADA strokes the nape of his neck and on down his back. \nSTEWART'S face puckers, his eyes fill with tears. She strokes so \nsoftly, the tenderness is shocking to him. Gently she pulls his under-\ngarment down, exposing his buttocks. STEWART grabs nervously at them, \nhauling them up with his hands. ADA unclenches his fist and once more, \nslowly pulls them down. She begins to stroke his buttocks, STEWART is \npainfully eroticised, painfully vulnerable, he begins to weep, the \nintimacy and soft-ness unman him and he is helpless. STEWART sits up \nhunching over himself, retreating\n\n                         STEWART\n               I want to touch you Why can't I \n               touch you? Do you like me?\n\nSlowly he raises his head to look at ADA. She looks back moved by his \nhelplessness, but distanced as if it has nothing to do with her.\n\n               Do you?\n\nADA does not respond. STEWART slumps into disappointment and despair.\n\n               Why? Why not?!\n\nSc 108INT     STEWART'S KITCHEN     DAY     Sc 108\n\nThe next morning, ADA, FLORA and STEWART sit together in the small \ndark hut. FLORA preens a miniature landscape of moss and tiny branches \nall piled on a dinner plate. A slit of sunlight falling across the top \nsmall branches gives it a magical glow. FLORA's small dirty fingers \npush in another 'tree', she looks up happily\n\n                         FLORA\nThis is going to be Adam's tree \nand then I'm going to make a \nserpent to live here, with a \nvery long tongue. (She pokes \nher tongue out and waggles it).\n\nSTEWART reads, he glances at ADA who is glum and lifeless.\n\nSc 109INT     STEWART'S HUT     DAY     Sc 109\n\nADA and FLORA wake to sunlight streaming in on their faces, more and \nmore of it as STEWART rips the boards from the windows FLORA runs \nabout in nightgown and boots happy to be in the sunlight. ADA winds \nher hair into a bun. STEWART walks inside, he packs food and fencing \nequipment\n\n                         STEWART\n               (Clears his throat) We must \n               both get on. I have decided to \n               trust you to stay here. You \n               will not see Baines?\n\n               (ADA nods) Good, good. Perhaps \n               with more trying you will come \n               to like me?\n\nSc 110EXT     STEWART'S          DAY     Sc 110\n\nADA hangs out washing restlessly scanning the bushline. A tiny STEWART \nwalks along the crest of the hill, eventually dropping out of sight.\n\nSc 111INT     STEWART'S HUT     DAY     Sc 111\n\nInside the hut ADA is pacing, anguished and frustrated. Impulsively \nshe picks up a knife from the kitchen table, opens the back of the \npiano and cuts one of the keys loose. Carefully she engraves on the \nside in Victorian handscript.\n\nDEAR GEORGE, YOU HAVE MY HEART. ADA McGRATH.\n\nSc 112EXT     STEWART'S          DAY     Sc 112\n\nUnder the sheets FLORA has constructed a dolls' clothes line on which \nshe hangs small strips of cloth ADA hands her the key wrapped and tied \nin white cotton. ADA signs. Her black shadow behind the sheet recalls \nthe macabre play.\n\n               No!\n\nThe little girl continues defiantly with her miniature washing. ADA \nrips the washing line up and flings it aside. FLORA is shocked, \nstunned. She takes the key and walking off she turns and shouts.\n\n                         FLORA\n               We're not supposed to visit \n               him'.\n\nADA signals GO!\n\n\nSc 113EXT     PATH TO BAINES' AT FENCEDAYSc 113\n\nAt the junction of the path to BAINES' hut is the beginning of \nSTEWART'S boundary fence. At this place FLORA has paused. She looks \nback to see if her mother is watching; she's not- FLORA turns sharply \nright so that she now follows alongside STEWART'S boundary fence and-\naway from BAINES' hut.\n\nSc 114EXT     HILLS WITH FENCE     DAY     Sc 114\nThe fence appears and disappears behind hills.  Flora too dips behind \nthe hills to reappear on the other side. She sings a brisk song to \nherself.\n\n                         FLORA\n               The grand old Duke of York. He \n               had ten thousand men etc.\n\nSc 115EXT     VALLEY WITH FOXGLOVE & FENCEDAYSc 115\nShe pauses in one of the valleys, stifled by clumps or tall, mauve \nfoxglove.\n\nSc 116EXT     COMPLETE FENCE ON HILLDAY     Sc 116\nThe fence line seems endless as the tired FLOW4 trudges up yet another \nhill but from there, she can see where the fence finishes, half way up \nthe crest of the next hill and at this point is STEWART, driving in a \nnew fence post. He is watched by MANA and his friend who squat passing \na pipe between themselves. MANA strums tirelessly on his buttons.\n\n                         FLORA\n               Mumma wanted me to give this to \n               Mr. Baines.\n\nShe holds out the cotton covered piano key. STEWART looks up.\n\n               I thought maybe it was not a \n               proper thing to do. \n\nSTEWART keeps working, hammering the post into the earth.\n\n               Shall I open it?\n\n                         STEWART\n               No!!\n\nHe stops and takes the key, suspicious and uncomfortable. He slowly \nunwraps it and turning it over reads it. Squeezing the key in his \nfist, STEWART staggers off in a daze, He returns, picks up his open \npack spilling the nails. Finally he drops the pack and the key) and \nleaves with only his axe. FLORA follows confused. The MAORIS waste no \ntime investigating the booty. MANA presses the piano key repeatedly.\n\n                         MANA\n               Knare e Wainta! Kaare e Wajata! \n               (no sing, no sing)\n\nSc 117EXT          STEWART'S     DAY     Sc 117\nThe sky is dark and rain is falling heavily as STEWART strides fast \ntowards the hut, his axe swinging in his hand. FLORA is far behind \nhim, her angelwings sodden.\n\nSc 118INT     STEWART'S HUT     DAY     Sc 118\n\nSTEWART bursts into the hut, his wet hair is splattered against his \nforehead. his face is white. ADA looks up from her book, moving her \nhands from the table. STEWART swings his axe hard. It slices into the \ntable, splitting a section off her book. ADA pushes her chair back.\n\n                         STEWART\n               (exasperated) why? WHY? I \n               trusted you!\n\nHe pulls the axe out of the table and swings it at the piano.\n\n               WHY?\n\nADA runs forward to restrain him, but it sinks deep into the wood. The \nstruck piano lets ont a strange resonant moan.\n\n               I trusted you, do you hear? I \n               trusted you. I could love you.\n\nHe takes her by the wrist.\n\n               Why do you do this? Why do you \n               make me hurt you? Do you bear? \n               Why have you done it? We could \n               be happy\n\nSTEWART shakes her violently.\n\n               You have made me angry. SPEAK!!\n\nSc 119EXT     STEWART'S HUT & WOODCHOPDAY     Sc 119\n\nHe pulls her out of the hut, past the now terrified FLORA.\n\n               You shall answer for this. \n               Speak or not you shall answer for \n               it!\n\nHe drags her out through the mud, towards the wood chop. It is raining \nhard.\n\nADA sees where they are headed and suddenly she is very scared. She \nbucks and struggles, but STEWART is infinitely stronger. At the wood \nchop she breaks free and crawls away through the woodchips and mud. \nBut axe in hand he grasps her by the neck of her dregs, then her hair, \nand pulls her backwards towards the cutting block. There, he takes her \nright hand and holds it in place with his boot, so that only ADA's \nindex finger shows, ADA's head is held twisted between the wood chop \nand STEWART'S leg.\n\n                         STEWART\n               (anguished) Do you love him? Do \n               you?! Is it him you love?\n\nADA blinks rigid with fear. The rain is driving down.\n\n                         FLORA\n               No, she says NOOOOOO!!!\n\nThe axe falls. ADA's face buckles in pain. Blood squirts onto FLORA's \nwhite pinafore, her angel wings are splattered in mud.\n\n                         FLORA\n               (Screaming) Mother!!\n\nADA stands. She looks faint, her finger is pulsing blood, she shakes \nher hand then seeing the blood she puts it behind her back shocked. \nShe watches FLORA, concerned and confused. Uncontrollably her whole \nbody starts to shake and as if by reflex ADA begins to walk. FLORA \ntrots parallel to her.\n\n                         FLORA\n               Mama!\n\nADA keeps walking blindly like her being depends on it. Her face is \nashen, her eyes fearful as she walks unseeingly straight into a large \ntree stump. She sinks into the mud.\n\nSTEWART wraps the finger in a white handkerchief and gives it to FLORA \nwho backs away from him terrified.\n\n                         FLORA\n               (quietly) Mama.\n\n                         STEWART\n               Take this to Baines. Tell him \n               if he ever tries to see her again \n               I'll take off another and another \n               and another!\n\nThe figures seem tiny amidst the rain drenched skeleton forest.\n\nSCENE 12O DELETED*\n\nSc 121EXT     MAORI PA     DAY     Sc 121\n\nThe formal farewells are over and HIRA and BAINES finishes shaking \nhands and pressing noses with her people.\n\nHIRA holds his arm, she is sad and tearful. He places his hat on her \nhead affectionately and slips her a much appreciated tin of tobacco.\n\nA soft rain begins to fall. BAINES and HIRA make their way past the \nMeeting House and the low sleeping houses to the Pa entrance where his \nhorse waits,\n\n                         HIRA\n               I worry for us Peini. Pakeha \n               cunning like wind, KNOCK you \n               over, yet you not see it. Some \n               they say, how can pakeha get \n               our land if we won't sell it?\"\n\nA crowd of children run beside them, dogs scurry off and pigs are \nkicked out of the way, their owners protesting loudly. Some hold mats \nover their heads to protect themselves from the rain, one has a \nbattered umbrella.\n\n                         HIRA\n               They wrong Peini. We need guns \n               to hold it.\n\nBAINES mounts his heavily laden horse. MANA pushes forward to say his \nfarewell, but is abruptly shoved aside, evidently unpopular with the \nothers. BAINES glances over and sees the piano key the man has \nfashioned into an earring.\n\n                         HIRA\n               (angrily)I worried Feini. \n               What's gonna happen you, you go \n               home, but where we go? We got \n               nowhere to go.\n\nHIRA's voice rises as BAINES lets go of her arm and rides through the \ngroup towards MANA. He takes the piano key in his hand, MANA pulls \nback.\n\n                         MANA\n               (In Macit) \n               It is mine. I found it.\n\nBAINES turns it over and finds the writing on it.\n\n                         BAINES\n               (urgently)\n               Homni 'ci au.\n               (I want this.)\n                    SUBTITLED\n\n                         MANA\n               (sulky) \n               Ncrr! Naaku. It\u0092s mine. Me find \n               it\n\n                         BAINES\n               He aha to hiahia? Ask for it? \n               Tobacco?\n               (What do you want?)\n                    SUBTITLED\n\n                         HIRA\n               (still angry) \n               Gun, ask for his gun!\n\nMAYA rubs his nails up and down his buttons while he considers what he \nwill have.\n\n                         OTHERS\n               - Nga rarahe\n               (The glasses)\n\n               - Wana Putu\n               -Te whitiki, gettem ehoal\n               (The belt)\n                    UNSUBTITLED\n\nSc 122EXT     MAORI PA     DAY     Sc 122\n\nOutside the Pa walls near the kumera gardens, HIRA holds BAINES' \nsaddle bags. It is raining hard as he rides out, hatless, shoeless and \ngunless, but clutching to his chest ADA's engraved key.\n\n                         HIRA\n               Go Peini ... Haere atu e Peini.\n\n                         BAINES\n               I'll be back.\n\nSc 123EXT     SCHOOL     DAY     Sc 123\n\nBAINES crosses through the pony paddock of the one room colonial \nschool hall, school house. He has a piece off flax knotted around his \nwaist to bold up his trousers. In the paddock are five very shabby \nlooking rides'. one huge old wagon horse, built to carry a whole \nfamily, down to a tiny sour looking Shetland. The girls have long, \nstained, once white pinafores and everyone wears boots that seem too \nbig, except the little boy who has the front cut off his hoots so his \ntoes can hang out.\n\nFour little girls play a sedate game of skip rope, using a bush vine.  \nBAINES watches, noticing in particular a little girl of about 9 with a \nbock. The boys and some of the wilder girls play BullRush.\n\nNOTE  SCENE 123 REPLACES SCENES 124 AND 125\nDELETE SCENES 124 AND 125\n\nSc 126EXT     GENTLE STREKM     DAY     Sc 126\n\nThe girl with the book goes off sit by a little stream. BAINES follows \nand sits beside her.\n\n                         BAINES\n               Can you read?\n\nThe little girl immediately closes the book and walks off.\n\nThe girl keeps walking, before she turns about to watch him from a \nsafe distance.\n\nAnother little girl drops down from a tree.\n\n                         TREE GIRL\n               I can.\n\n                         BAINES\n               You can read? \n\n(She is very small.)\n\n                         TREE GIRL\n               Yes ... lots of things.\n\nThe skipping group of girls join them.\n\n                         BIG SISTER\n               She can't read, she's my \n               sister, I ought to know.\n               Are those sweets?\n\n                         TREE GIRL\n               I can read!\n\n                         BIG SISTER\n               She can't.\n\nBAINES holds out the packet to the little girl. \n\n               Don't give her one.\n\nBAINES does anyway.\n\n                         BIG SISTER\n               She can't read.\n\nThe little girl throws the lolly paper away, which one of the other \ngirls picks up and sniffs, she hands it to the others.\n\n               Mmm Caramels\n\n                         BAINES\n               Can you read?\n\nHe holds out the piano key BIG SISTER takes it with great authority, \nher friends crowd behind her. She frowns at the writing. She turns it \nover.\n\n                         BIG SISTER\n               Running writing, we haven't \n               done that yet.\n\n                         READING GIRL\n               Myrtle can read it, her mother \n               taught her.\n\nThe key is snatched from BIG SISTER and given to MYRTLE, the girl with \nthe book. The others crowd around.\n\n                         MYRTLE\n               (frowning) D e a r  G e o r g e\n\nThe children look over at BAINES to see if this is right so far.\n\n               You (in unison)... have\n\n                         BIG SISTER\n               That's \"My\".\n\n                         MYRTLE\n               Its not an M\n\n                         BIG SISTER\n               Yes it is.\n\n                    MYRTLE & BIG SISTER\n               Dear - George - you - have - my\n\n                         MYRTLE\n               heart? (She pulls a face as if \n               it doesn't make sense) Ada \n               McGrath.\n\n                         BIG SISTER\n               It doesn't make sense.\n\nThe little girls read it again together. MYRTLE turns the key over \nmatter of factly to see if there is more writing.\n\n                         MYRTLE\n               That's all\n\nThey all look up at him.\n\n                         BAINES\n               Say it again, just you.\n\nEveryone turns and listens to MYRTLE\n\n                         MYRTLE\n               Dear George you have my heart, \n               Ada McGrath.\n\nShe gives a little \"Is that all?\" gesture.\n\n                         BAINES\n               You say it. (He points to BIG \n               SISTER, who has a crazy deep \n               voice.)\n\n                         BIG SISTER\n               Dear George you have my heart, \n               Ada McGrath.\n\n\nAnother little girl spontaneously recites the message. And so does \nanother. Through all this BAINES keeps his bead down shaking it in \ndisbelief and shy happiness. He starts to laugh with relief and \npleasure. The little girls think it is something funny in the line and \ncontinue to repeat it, which each then appears to give BAINES fresh \npleasure. Meanwhile the smallest of the girls is quietly helping \nherself to the sweets.\n\nSCENE 127 DELETED\nSCENE 128 DELETED\n\n\nSc 129EXT     BAINES\u0092     DUSK     Sc 129\nBAINTS rides up to his house in the evening light He is silly with \nhappiness. HIRA comes running out to meet him\n\n                         HIRA\n               Peini, Peini, liddle gel. I \n               seen her come up here, scream, \n               scream . blood on her. Look \n               bad... very bad\n\nBAINES jumps off his horse and strides into his hut.\n\nSc 130INT     BAINES' HUT     DUSK     Sc 130\n\nInside he finds FLORA crouching in a corner, her face is white, tear \nstained and splattered with mud. Her angel wings are squashed behind \nher and blood stained. On seeing BAINES she cries with renewed pain \nand relief\n\n                         BAINES\n               What has happened? Hush, hush, \n               what is it?\n\nFLORA thrusts the wrapped finger at BAINES. He takes the blood soaked \nobject and unwraps it. The finger unravels into his hand, he reels \nback groaning, choking about to be sick.\n\n                         FLORA\n               (yelling) He says you're not to \n               see her or he'll chop her up!\n\n                         BAINES\n               (angry, horrified) \n               What happened?\n\nBut FLORA cannot speak. She bursts into loud sobs. BAINES kneels in \nfront of her shaking her.\n\n               TELL ME! TELL ME!\n\nBAINES stops shaking her, she scrambles away and out the door. BAINES \nchases after her.\n\nSc 131EXT     BAINES     DUSK     Sc 131\nFLORA screams as he catches her.\n\n                         BAINES\n               Quiet down! Shhh! Where is she?\n\n                         FLORA\n               (whimpering) \n               He chopped it off\n\n                         BAINES\n               Jesus! I'll kill him! I'll kill \n               him.\n               What did she tell him?\n\n               (shaking her)\n               What?\n\n                         HIRA\n               Put her down Peirn She is \n               liddle.\n\nHIRA takes the quivering FLORA in her arms.\n\n               There girl. there\n\nBAINES notices the blood on FLORA'S dress, he touches it, she shys \naway.\n\nSc 132EXT     STEWARD'S HUT     NIGHT     Sc 132\nSTEWART walks outside his hut disconsolate.\n\nSc 133INT     STEWART'S HUT     NIGHT     Sc 133\n\nSTEWART enters ADA's room with a lamp. He puts it down beside her on \nthe table. He studies her pale face and dry lips. ADA's eyes flicker \nopen.\n\n                         STEWART\n               (speaking to his feet) \n               I lost my temper. I'm sorry.\n\nSTEWART looks at ADA.\n\n                         STEWART\n               You broke my trust, you pushed \n               me hard, to hard. (he sighs) \n               You cannot send love to HIM you \n               cannot do it.  Even to think on \n               it makes me angry, very angry\n\nADA opens her eyes and looks at STEWART. It is evident she hears \nnothing and has understood nothing, she is struggling with pain. Her \nface grimaces and she groans.\n\n                         STEWART\n               I meant to love you. I clipped \n               your wing, that is all.\n\nSTEWART sings two lines of an English love ballad to ADA.\n\n                         STEWART\n               We shall be together, you will \n               see it will be better...\n\nHer forehead is damp with fever. She thrashes at the blankets. STEWART \npulls them off to cool her. He feels her brow.\n\n                         STEWART\n               (whispering) ... \n               my love bird.\n\nHer nightgown is damp with sweat and clings to her body. STEWART \nreaches out to adjust her gown, his hand touches her leg and he holds \nit there, feeling a tingle of pleasure, that grows and builds the \nlonger his hand remains.\n\n                         STEWART\n               Ohhhhh my love\n\nHis hand begins to move further and further up her leg, nudging the \nnightgown higher and higher. He looks at her face. She is closed-eyed, \nunconscious. STEWART'S face crinkles into a pained expression and all \nhis control melts into a drive to hold and extend this moment. He \nbrings his mouth to her leg and begins to kiss her knee, her thigh. A \nnew thought occurs to him, a terrible thought, but as he has phrased \nthe thought to himself, he cannot resist it. He glances at her face \nstill fevered and unconscious. Quietly, stealthily, he begins to undo \nhis belt buckle. He bends across her to gently separate her legs. As \nhe moves his body over her, he looks towards her and to his shame and \nhorror she is looking directly back at him, her eyes perfectly on his, \nperfectly focused. Quietly STEWART moves back and pulls down her gown, \nall the time keeping his eyes on her.\n\n                         STEWART\n               You are feeling better?\n\nADA's lips move slightly and STEWART turns suddenly as if he has heard \nsomething. Slowly he turns back to ADA.\n\nSTEWART looks at ADA intently, moving closer to her bed, closer to ADA \nhis eyes locked on hers.\n\n                         STEWART\n               What...?\n\nThe sound of his own voice makes him blink. He watches her as if \nlistening to her speak in a voice that is so faint, and distant, that \nonly with great concentration and perseverance can he make it out. As \nhe watches her his face transforms; his eyes fill, his lips soften and \nhis eyebrows take on the exact expression of her own.\n\nThe kerosene lamp burns fitfully, fluttering a light pulse across \ntheir faces. STEWART moves closer to ADA. Outside a wind bangs the \niron roof and rubs branches against each other making a high-pitched \nsee-saw sound. He leans closer still.\n\nSc 134EXT     STEWARTS     NIGHT     Sc 134\n\nSTEWART carrying a candle in a glass box makes his way through ghostly \ntree stumps. In his other arm he has his gun.\n\nSc 135EXT/INT     BAINES'     NIGHT     Sc 135\n\nAt BAINES' hut STEWART steps over the curled figure of HIRA sleeping \non the verandah and walks through the hut towards the bedroom where a \nlit candle flickers.\n\nSc 136INT     BAINES' BEDROOMNIGHT     Sc 136\n\nIn the bed lies FLORA wrapped in a blanket with BAINES beside her, axe \nin hand, both fast asleep. STEWART nudges BAINES awake with the butt \nof his rifle prodding him under the chin. BAINES wakes rudely with a \nstart, frozen by the sight of STEWART and his rifle.\n\n                         STEWART\n               Put that away, on the floor.\n\nBAINES obeys, careful not to disturb the sleeping child. STEWART sits \nnear the bed on a box, resting his gun across his knee, his face is \nglowing, he looks closely at BAINES, examining him.\n\n                         STEWART\n               I look at you, at your face. I \n               have had that face in my head \n               hating it. But now I am here \n               seeing it ... it's nothing, you \n               blink, you have your mark, you \n               look at me through your eyes, \n               yes. you are even scared of me\n\nSTEWART laughs.\n\n                         STEWART\n               Look at you!\n\nBAINES watches him stiffly, disconcerted, unable to read STEWART'S \nstrange mood. STEWART stares back at him.\n\n                         STEWART\n               (softly) \n               Has Ada ever spoken to you?\n\n                         BAINES\n               You mean in signs?\n\n                         STEWART\n               No, words. You have never heard \n               words?\n\n                         BAINES\n               No, not words.\n\nSTEWART nods.\n\n                         STEWART\n               Never thought you heard words?\n\nBAINES shakes his head.\n\n\n                         STEWART\n               (slowly) \n               She has spoken to me. I heard \n               her voice. There was no sound, \n               but I beard it here (he presses \n               his forehead with a palm of his \n               hand). Her voice was there in \n               my head. I watched her lips, \n               they did not make the words, \n               yet the harder I listened the \n               clearer I heard her, as clear \n               as I hear you, as dear as I \n               hear my own voice.\n\n                         BAINES\n               (trying to understand) \n               Spoken words?\n\n                         STEWART\n               No, but her words are in my \n               head. (he looks at BAINES and \n               pauses) I know what you think, \n               that it's a trick, that I'm \n               making it up. No, the words I \n               heard, were her words.\n\n                         BAINES\n               (suspiciously) What are they?\n\nSTEWART looks up at the ceiling as if reciting something he has learnt \nby heart and means to repeat exactly as he heard it.\n\n                         STEWART\n               She said, \"I have to go, let me \n               go, let Baines take me away, \n               let him try and save me. I am \n               frightened of my will, of what \n               it might do it is so strange \n               and strong\".\n\nBAINES recovering himself eyes STEWART angrily.\n\n                         BAINES\n               You punished her wrongly, it \n               was me, my fault.\n\nSTEWART does not answer. Finally be looks up, his eyes full with \ntears.\n\n                         STEWART\n               Understand me. I am here for \n               her, for her I wonder that I \n               don't wake, that I am not \n               asleep to be here talking with \n               you. I love her. But what is \n               the use? She doesn't care for \n               me. I wish her gone. I wish you \n               gone. I want to wake and find \n               it was a dream, that is what I \n               want. I want to believe I am \n               not this man. I want my self \n               back; the one I know.\n\nFLORA moves and turns in her sleep. The two men watch. Her brow frowns \nthen smoothes. Her eyelids roll as her eyes dart back and forth in \ndream.\n\nSc 137EXT     STREAM NEAR BAINES'DAY     Sc 137\n\nHIRA washes out the mud from FLORA's dress and angel wings in a bush \nstream.\n\nSc 138INT/EXT     STEWART'S          DAY     Sc 138\n\nADA's trunks are delivered outside STEWART'S hut by AUNT MORAG and her \ngirls. ADA is led from STEWART'S hut by NESSIE. She wears a black \ndress and her arm is tied in a white sling. The light outside makes \nher blink. NESSIE smoothes her hair behind her shoulders. FLORA \ntimidly peeps at her mother from behind BAINES.\n\nSc 139EXT     BUSH ON WAY TO BEACHDAY     Sc 139\n\nThe piano is carried on ahead while in the secrecy of the bush BAINES \nkisses ADA passionately. She looks back at him worried.\n\nSc 140EXT     STEWART'S HTJT     DAY     Sc 140\n\nSTEWART is fencing his new land. Suddenly be looks off in to the far \ndistance.\n\nSc 141EXT     BEACH               DAY     Sc 141\n\nOn the beach ADA sits looking out to sea while FLORA plaits her hair \nin one thick braid behind her back. She places the bonnet carefully on \ntop At the sea edge in front of them the piano is being loaded on the \ncanoe.\n\nSc 142EXT     BEACH               DAY     Sc 142\n\nHIRA and BAINES are next to each other by the canoe. HIRA is looking \nat ADA,\n\n                         HIRA\n               I worry for you.\n\n                         BAINES\n               No, I love her, we will be a \n               family. I have her piano. I \n               will mend it, she will get \n               better.\n\n                         HIRA\n               I miss you.\n\nSc 143EXT     AT SEA/BEACH     DAY     Sc 143\n\nThe sea is choppy and the piano is difficult to steady in the canoe. \nBAINES helps the rigging of the piano, thick rope ends coil under the \nwomen's feet. HIRA is left on the shore with one child and two other \nMAORI people.\n\nTears run openly down her big sad face as she sings her farewell to \nBAINES.\n\n                         HIRA\n               He rimu teretere koc ete. Peini \n               eeeii,\n               Tere 'Ci Tawhiti 'ci Paniamao \n               eeeii\n               He waka Teretere He waka \n               teretere.\n               Ko koe ka tere 'ci tua whakuere \n               eeeii. \n\n               You are like seaweed drifting \n               in the sea BAINES.\n               Drift far away, drift far \n               beyond the horizon\n               A canoe glides hither, a canoe \n               glides thither\n               But you though will journey on \n               and eventually\n               be beyond the veil~)\n                    UNSUBTITLED\n                         (by Selwyn Mum)\n\n                         MAROI OARSMEN\n               Tarinaharawa - alanel tahuri \n               ai. \n               (It's too heavy - the canoe \n               will tip over.)\n                    SUBTITLED\n\n                         BAINES\n               Keite pail Kaare e titahataha \n               aria. \n               (It's all right! Look it's \n               nicely balanced.)\n                    SUBTITLED\n\n                         ANOTHER OARSMAN\n               (Shrugging) Te-hau-jua-kahake \n               te pupuhi. \n               (The wind is already strong.)\n\n                         ANOTHER OARSMAN\n               Leave it - its too heavy.\n\n                         BAINES\n               No, she needs it, she must have \n               it.\n\n\nSCENE 144 IS NOW COMBINED WITH SCENE 143 \nSCENE 144 DELETED\n\nSc 145EXT     AT SEA/BEACHDAY     Sc 145\n\nThe canoe has paddled away from the shore. FLORA leans over the edge \nof the canoe, her mouth open, her hair held back by BAINES.\n\n                         FLORA\n               I can't\n\nBAINES rubs her back. FLORA straightens up.\n\n               I can't.\n\nThey retake their seats, FLORA's back to the piano, while BAINES sits \nnext to ADA. He tenderly takes her good hand. ADA removes hers and \nsigns to FLORA who looks at her mother then BAINES amazed.\n\n                         BAINES\n               What did she say?\n\n                         FLORA\n               (puzzled) She says, throw the \n               piano overboard.\n\n                         BAINES\n               (to ADA) It's quite safe, they \n               are managing...\n\nADA signs again.\n\n                         BAINES\n               (Cautiously) What?\n\n                         FLORA\n               She says, throw it overboard. \n               She doesn't want it. She says \n               it's spoiled\n\n                         BAINES\n               I have the key here, look, I'll \n               have it mended...\n\nADA mimes directly to BAINES, \"PUSH IT OVER\". Her determination is \nincreasing.\n\n                         MAORI OARSMAN\n               Ae! Peja. Turakina'. Bushit? \n               Peja te kawheha kite moana.\n               (Yeah she's right push it over, \n               push the coffin in the water.) \n                    SUBTITLED\n\n                         BAINES\n(softly, urgently) Please, Ada, \nyou will regret it. It's your \npiano, I want you to have it.\n\nBut ADA does not listen, she is adamant and begins to untie the ropes.\n\n                         FLORA\n               (panicking)\n               She doesn't want IT!\n\nThe canoe is unbalancing as ADA struggles with the ropes.\n\n                         BAINES\n               All right. sit down, sit down.\n\nADA sits, pleased. Her eyes glow and her face is now alive.\n\nBAINES speaks to the MAORIS who stop paddling and together they loosen \nthe ropes securing the piano to the canoe.\n\nAs they maneuver the piano to the edge ADA Jocks into the water. She \nputs her hand into the sea and moves it back and forth.\n\nThe piano is carefully lowered and with a heave topples over. As the \npiano splashes into the sea, the loose ropes speed their way after it. \nADA watches them snake past her feet and then out of a fatal \ncuriosity, odd and undisciplined, she steps into a loop.\n\nThe rope tightens and grips her foot so that she is snatched into the \nsea, and pulled by the piano down through the cold water.\n\nSc 146INT     SEA NEAR BEACH     DAY     Sc 146\n\nBubbles tumble from her mouth. Down she falls, on and on. her eyes are \nopen, her clothes twisting about her. The MAORIS diving after her \ncannot reach her in these depths. ADA begins to struggle. She kicks at \nthe rope, but it holds tight around her boot. She kicks hard again and \nthen with her other foot, levers herself free from her shoe. The piano \nand her shoe continue their fall while ADA floats above, suspended in \nthe deep water, then suddenly her body awakes and fights, struggling \nupwards to the surface.\n\nSc 147 EXT     AT SEA BEACH     DAY     Sc 147\n\nAs ADA breaks the surface her VOICE OVER begins:\n\n                         ADA (VOICE OVER)\n               What a death!\n               What a chance!\n               What a surprise!\n               My will has chosen life!?\n               Still it has had me spooked and \n               many others besides!\n\nADA coughing and spluttering is pulled on to the canoe. She is wrapped \nin jackets and blankets.\n\nSc 148INT     SEA NEAR BEACH     DAY     Sc 148\n\nUnderwater we see the canoe bottom, its oars dipping the surface\n\nSc 149INT     ADA'S NELSON DRAWING ROOM     DUSK     Sc 149\n\n                         ADA (VOICE OVER)\n               I teach piano now in Nelson. \n               George has fashioned me a metal \n               finger tip, I am quite the town \n               freak which satisfies! I am \n               learning to speak. My sound is \n               still so bad I am ashamed. I \n               practice only when I am alone \n               and it is dark.\n\nADA's hands move across the piano keys, her metal finger shines in the \ndull light.\n\nDISSOLVE TO:\n\nSc 150INT     ADA'S NELSON DRAWING ROOM     NIGHT     Sc 150\n\nADA paces up and down the small drawing room. There are no lights on \nonly  a dim blue evening wash. Over her head she has a dark cloth, her \nvoice makes low guttural sounds as it repeats the vowels.\n\nDISSOLVE TO: \n\nSc 151INT     SEA BED NEAR BEACH     DAY     Sc 151\n\n                         ADA (VOICE OVER)\n               At night! I think of my piano \n               in its ocean grave, and \n               sometimes of myself floating \n               above it. Down there everything \n               is so still and silent that it \n               lulls me to sleep. It is a \n               weird lullaby and so it is; it \n               is mine.\n\nADA's piano on the seabed, its lid fallen away. Above floats ADA, her \nhair and arms stretched out in a gesture of surrender, her body slowly \nturning on the end of the rope. The seaweed's rust coloured fronds \nreach out to touch her.\n\nTHERE IS A SILENCE WHERE HATH BEEN NO SOUND\nTHERE IS A SILENCE WHERE NO SOUND MAY BE\nIN THE COLD GRAVE, UNDER THE DEEP DEEP SEA.\n\n(Hood)\n\n\n\n\nNOTES AND EXTRA DIALOGUE\n\n1.\nSc 10 SEAMAN'S DISCUSSION\n\nThe wind and the low manner of their speaking makes it impossible to \nhear the exact nature of the discussion.\n\n-'Tis a dead shore, a dead shore\n-Leave her here, it's what she wanted.\n-A pox on you!\n-Ay very nice, leave her and be lynched for the pleasure. \n-Do what you like, I'm off this shore\n\nETC.\n2.\nSc 12 ART DEPARTMENT NOTE\n\nADA's finger is seen INSIDE the dark crate sounding a few notes\n\n3.\nSc 15 TRANSLATION NOTE\n\n(i) With the MAORI language dialogue of BAINES and the MAORI PEOPLE, \nthe general scheme is that only when necessary to sense or humour will \nsubtitled translation be given. However for the benfit of its readers \nthis script will translate everything noting what will and won't be \nsubtitled.\n\n(ii)EXTRA MAORI DIALOGUE  SC 15\n\nAwe!\n(What wag that?)\n\n-He Kehua?\n(Is it a ghost)  \n     UNSUBTITLED \n\n(iii)Many of the MAORIS have coughs, running noses and sores. \n(They have no immunity to European diseases.)\n(iv)MAORI NAMES\n\nMEN\nTnTame\nVitoHotu\nHonePara\nTipiKahu (boy)\n\nWOMEN\nTaiAni\n\n4.\nSc 19\n\n(i)BACKGROUND DIALOGUE FOR BEGINNING OF SCENE\n\nHe ahu te rarurarti\n(what happened?)\n          SUBTITLED\n\nI konei tonu, ka moe te koroua nei. \n(He just decided to go to sleep) \n          SUBTITLED\n\n(ii)BACKGROUND DIALOGUE FOR END OF SCENE\n\nTaiho. Kei muri pea inga rakan nei. Auc!\nTino matatoru konei.\nMe haere ake ano an ki runga.\n\n(Hold on maybe behind this clump. Gee the\nundergrowth is thick here. I'll come up again.)\n\n          UNSUBTITLED\n\nKahore ne huarahi - kahorene tutae.\n(No track, no shit)\n          UNSUBTITLED\n\n5.\nSc 29ADA's piano piece duration approximately 90 sees.\n\n6.\nSc 30Duet 20-30 sees\n\n7.\nSc 33FLORA's singing 20 sees\n\n8.\n\nSc 34HENI/MARY phrasing of National Anthem\n\nHENI/MARY\n\nGot safe ah gayshy Quin\nLong hf a gayshy Quin\nOat shayf a Quin\nShendab Wikitoria\nHar - py en a Clohria\nLong to rain ourush\nGot Safe ah Quin\n\n9.\nSc 37 TRANSLATION NOTE:\n\nWho is it that rumbles within?\nIs it Ruaumoko, is it Ruaurnoko?\nJab, smash, jab, smash\nJab, smash, jab, smash\nThe Taniwha, the Taniwba.\nThat is within ... He!\n          UNSUBTITLED\n\n\n10.\nSc 65  The mud around the School Hall is so deep that a labyrinths of \nplanks is setup to avoid it.\n\n11.\nSc 87 Extra dialogue\n\nMAORI PIANO CARRIERS\n\nTahi Patene ruapuri patene\nTekan patene ornatekau pwari patene\n(One button, two bloody buttons.\nTen buttons, twenty bloody buttons.)\n'cia Whai tarau ano ra monga patene! \n(We need pants for the buttons eh!)\n\nHe patene te kai, he patene te kai A popo ka tiko patene ahan patene \nma nga tangata katoa.\n\n(Buttons for food, buttons for food. Buttons for everybody. By \ntomorrow I'll be shitting buttons.)\n\n12.\nSc 100 Approximately 60 sec. of ADA's piano playing.\n                                                  \n                         \n\n\n\n\n\n\n\n\nPiano, The\nWriters :   Jane Campion\nGenres :   Drama  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:32:58.998269"}