{"title": "Pirates of the Caribbean", "film_link": "/Movie Scripts/Pirates of the Caribbean Script.html", "script_link": "/scripts/Pirates-of-the-Caribbean.html", "info_raw": "\n\nPirates of the Caribbean Script\n\n\n\n\nIMSDb opinion  Y'arrrrr! I thought it was great.\nIMSDb rating   (9 out of 10)\nAverage user rating   (9.77 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Ted Elliot  Terry Rossio\nGenres  Action  Adventure  Comedy\n\nRead \"Pirates of the Caribbean\" Script\n\n\n", "script": "\nFADE IN:\n\nEXT. CARIBBEAN SEA - DAY\n\nA gray, impenetrable wall of fog. From somewhere comes the\nFAINT SOUND of a LITTLE GIRL'S VOICE, singing, slow tempo,\nalmost under her breath.\n\n                     YOUNG ELIZABETH (O.S.)\n           Yo, ho, yo, ho, a pirate's life for me\n           Yo, ho, yo, ho, it's a pirate's life\n           for me...\n\nSuddenly a massive SHIP emerges from the grey, the Winged\nVictory maidenhead looming. It's a British dreadnought,\nthe H.M.S. Dauntless. Formidable, frightening, twenty-five\ngun ports on a side, and rail guns to boot.\n\nEXT. H.M.S. DAUNTLESS - FORECASTLE - DAY\n\nELIZABETH SWANN, strawberry blond hair, stands at the bow\nrailing, gazing at the seas, still singing --\n\n                     ELIZABETH\n           ...drink up me hearties, yo, ho...\n\nJOSHAMEE GIBBS, who was born old, skin a dark leather,\nclutches her shoulder, startling her.\n\n                     GIBBS\n               (sotto)\n           Quiet, missy! Cursed pirates sail\n           these waters. You want to call\n           'em down on us?\n\nElizabeth stares wide-eyed at him.\n\n                        NORRINGTON\n           Mr. Gibbs.\n\nNORRINGTON, a dashing young man, Royal Navy to the core,\nglares sternly at Gibbs. Standing besides him is GOVERNOR\nWEATHERBY SWAN, a man of obvious high station, brass\nbuttons on his thick blue jacket. He is Elizabeth's\nfather.\n\n                     NORRINGTON (CONT'D)\n           That will do.\n\n                    GIBBS\n          She was singing about pirates.\n          Bad luck to sing about pirates,\n          with us mired in this unnatural\n          fog-- mark my words.\n\n                    NORRINGTON\n          Consider them marked.   On your\n          way.\n\n                    GIBBS\n          'Aye, Captain.\n              (as he moves off)\n          Bad luck to have a woman on board,\n          too. Even a mini'ture one.\n\nHe returns to his deck-swabbing duties, surreptitiously\ntakes a quick swig from flask.\n\n                    ELIZABETH\n          I think it would be rather\n          exciting to meet a pirate.\n\n                    NORRINGTON\n          Think again, Miss Swan.   Vile and\n          dissolute creatures, the  lot of\n          them. I intend to see to   it that\n          any man who sails under a  pirate\n          flag, or wears a pirates  brand,\n          gets what he deserves: a  short\n          drop and a sudden stop.\n\nElizabeth doesn't know what 'a short drop and a sudden\nstop' means. Gibbs helpfully mimes: a man being hung.\n\n                    SWAN\n          Captain Norrington... I appreciate\n          your fervor, but I am concerned about\n          the effect this subject will have on\n          my daughter.\n\n                    NORRINGTON\n          My apologies, Governor.\n\n                    ELIZABETH\n          Actually, I find it all fascinating.\n\n                    SWAN\n\n          And that's what concerns me. Elizabeth,\n          dear... we will be landing in Port\n          Royal very soon, and beginning our new\n          lives. Wouldn't it be wonderful if we\n          comport ourselves as befits our class\n          and station?\n\n                    ELIZABETH\n          Yes, father.\n\nChastised, she turns away, to look out over the bow rail.\n\n                    ELIZABETH (CONT'D)\n              (to herself)\n          I still think it would be exciting\n          to meet a pirate...\n\nThe fog still hems in the ship; very little of the sea is\nvisible --\n\n-- but suddenly, a FIGURE comes into view. A young boy,\nWILL TURNER, floating on his back in the otherwise empty\nwater. There is nothing to show where he came from, or how\nhe came to be there.\n\n                     ELIZABETH (CONT'D)\n          Look!   A boy! In the water!\n\nNorrington and Swann spot him --\n\n                    NORRINGTON\n          Man overboard!\n\n                    ELIZABETH\n          Boy overboard!\n\n                    NORRINGTON\n          Fetch a hook! Haul him out of\n          there!\n\nQuick movement and activity on the deck. Sailors use a\nboathook to snag the boy he the passes. Norrington and\nSwann haul him aboard, and lay him on the deck. Elizabeth\nsidles in for a closer look.\n\n                    NORRINGTON (CONT'D)\n          He's still breathing.\n\n                     SWAN\n\n          Where did he come from?\n\n                    GIBBS\n          Mary mother of God ...\n\nAttention is turned away from the boy --\n\nThe sea is no longer empty. WRECKAGE from a ship litters\nthe water... along with the bodies of its crew. What is\nleft of the ship's hull BURNS, a ragged British flag\nhanging limply from the stern.\n\nThe H.M.S. Dauntless slips silently through it all.   The\nscene calls for hushed voices.\n\n                    SWAN\n          What happened here?\n\n                    NORRINGTON\n          An explosion in the powder magazine.\n          Merchant vessels run heavily armed.\n\n                    GIBBS\n          Lot of good it did them...\n              (off Swan's look)\n          Everyone's thinking it! I'm just\n          saying it! Pirates!\n\n                    SWAN\n          There is no proof of that. It could\n          have been an accident. Captain, these\n          men were protection. If there is even\n          the slightest chance one of those poor\n          devils is still alive, we cannot\n          abandon them!\n\n                     NORRINGTON\n          Of course not, Governor.\n              (to the crew)\n          Come about and strike the sails! Unlash\n          the boats! Gunnery crew... jackets off\n          the cannons!\n              (to Swann)\n          Hope for the best...prepare for\n          the worst.\n              (to two sailors)\n          Move the boy aft. We'll need the\n          deck clear.\n\nThey lift the boy. Swann pulls Elizabeth away from the\nrail, away from the hideous scene in the water.\n\n                    SWAN\n          Elizabeth, I want you to accompany\n          the boy. He's in your charge now.\n          You'll watch over him?\n\nElizabeth nods gravely. Swann hurries away to help unstow\nthe longboat. The sailors lay the boy gently on the poop\ndeck, behind the wheel, then hurry off. Elizabeth kneels\ndown besides the boy.\n\nHis good looks are not lost on her. She reaches out,\ngently brushes the blond hair from his eyes --\n\nSuddenly, he grabs her wrist, awake now. Elizabeth is\nstartled, but their eyes lock. She takes his hand in hers.\n\n                    ELIZABETH\n          My name is Elizabeth Swann.\n\n                    WILL\n          Will Turner.\n\n                    ELIZABETH\n          I'm watching over you, Will.\n\nHe clutches her hands, then slips back into\nunconsciousness.\n\nHis movement has opened the collar of his shirt; Elizabeth\nsees he wears a chain around his neck. She tugs it free,\nrevealing--\n\nA GOLD MEDALLION.   One side is blank.   She turns it over --\n\nA SKULL gazes up at her. Vaguely Aztec in design, but to\nher eyes, it means one thing only:\n\n                    ELIZABETH (CONT'D)\n          You're a pirate.\n\nShe glances back at the crew.   Sees Norrington, giving\norders, moving toward her.\n\nShe looks back at Will -- comes to a quick decision. Takes\nthe medallion from around his neck. Hides it under her\ncoat.\n\nNorrington arrives.\n\n                    NORRINGTON\n          Did he speak?\n\n                    ELIZABETH\n          His name is Will Turner -- that's\n          all I found out.\n\n                       NORRINGTON\n          Very good.\n\nNorrington hurries off. Elizabeth steals away to the stern\nof the ship. Examines her prize -- the gold medallion. A\nwisp of wind, and she looks up --\n\nOut over the sea, moving through the fog, silent as a\nghost, is a large sailing ship, a schooner --\n\nIt has BLACK SAILS.\n\nElizabeth stares, too frightened to move, or cry out.\n\nThe ship is obscured by the fog it as it passes -- but not\nthe mizzen-top ... and there hangs the frightening skull\nand crossbones of the Jolly Roger.\n\nElizabeth looks from it to the medallion -- the skull on\nthe flag is the same as the one on the medallion.\n\nFog surrounds and closes in on the black ship -- except for\nthe black flag. As Elizabeth watches, the skull appears to\nTURN and GRIN at her --\n\nElizabeth shuts her eyes tight --\n\n                       EIGHT YEARS LATER\n\nINT. GOVERNOR'S MANSION - ELIZABETH'S BEDROOM\n\n-- and then snap open again, startled wide with fear.\n\nBut this is no longer twelve-year-old Elizabeth standing on\nthe stern of the Dauntless; this is twenty-year-old\nElizabeth, lying in bed in the dark.\n\nShe remains motionless (were the images we just saw a\nnightmare, or a jumbled childhood memory?)\n\nElizabeth slowly looks as far out the corner of her eyes as\npossible without moving. Might there be someone in the\nroom with her, looming over her?\n\nShe turns, ready for anything.   She is alone.\n\nElizabeth sits up, turns up the flame on an oil lamp\nbesides the canopied bed. She carries the lamp across the\nroom to a dressing table, sits down.\n\nShe pulls one of the small drawers all the way out, reaches\ninto a space beneath it and removes --\n\nThe MEDALLION. She has kept it all this time. It has not\nlost its luster -- or its sense of menace. She gazes at it\nas she absently returns the draw to its place --\n\nA BOOMING knock on the door;    Elizabeth jumps up, startled\nknocking over her chair.\n\n                    SWANN (O.S.)\n          Elizabeth? Is everything all\n          right? Are you decent?\n\n                    ELIZABETH\n          Yes -- yes.\n\nShe puts the medallion on, throws on a dressing gown as\nSwann enters, carrying a large box. A uniformed maid,\nESTRELLA, follows.\n\n                    SWANN\n          Still abed at this hour?    It's a\n          beautiful day!\n\nEstrella pulls back the heavy curtains, revealing:\n\nBeneath a blue sky lies the bucolic town of PORT ROYAL,\nbuilt on a natural harbor. On a bluff at the mouth of the\nharbor stands FORT CHARLES, its stone parapets lined with\ncannon.\n\n                    SWANN (CONT'D)\n          I have a gift for you.\n\nHe opens the boxes, and displays for her a gorgeous velvet\ndress. She lets out an admiring gasp.\n\n                    ELIZABETH\n\n          It's -- beautiful. May I inquire\n          as to the occasion?\n\n                    SWANN\n          Is an occasion necessary for a father\n          to dote upon his daughter with gifts?\n\nElizabeth happily takes it, disappears behind a screened-\noff dressing area. Estrella follows, carrying the box.\n\n                    SWANN (CONT'D)\n          Although...I did think you could\n          wear it to the ceremony today.\n\n                       ELIZABETH (O.S.)\n          Ceremony?\n\n                    SWANN\n          Captain Norrington's promotion\n          ceremony.\n\nElizabeth peeks around the screen.\n\n                       ELIZABETH\n          I knew it.\n\n                    SWANN\n          Or, rather, Commodore Norrington...a\n          fine gentleman, don't you think?\n              (no answer)\n          He fancies you, you know.\n\nBehind the screen, Elizabeth GASPS.\n\n                       SWANN (CONT'D)\n          Elizabeth?     How's it coming?\n\nON ELIZABETH -- She holds her hair and      the medallion (still\naround her neck) out of the way as the      maid cinches her\ninto a corset over her slip. Estrella       has her foot in\nElizabeth's back as she pulls the laces      tight.\n\n                    ELIZABETH\n          Difficult ... to say.\n\n                    SWANN (O.S.)\n          I'm told that dress is the very latest\n          fashion in London.\n\n                    ELIZABETH\n              (holding her breath)\n          Women in London must have learned to\n          not breath.\n\nEstrella is finished.   Elizabeth takes a breath -- and\nwinces.\n\nA butler appears in the doorway of the room.\n\n                    BUTLER\n          Governor? A caller is here for\n          you.\n\nINT. GOVERNOR'S MANSION - FOYER - DAY\n\nThe caller, dressed in rough clothing, stands in the foyer,\nlooking very out of place, and knowing it. He holds a long\npresentation case. He polishes the toes of his boots on\nthe back of his calves, but it doesn't help.\n\n                     SWANN\n          Ah, Mr. Turner! It's good to see\n          you again!\n\nThe caller turns -- it is WILL TURNER. Handsome, with a\nwatchful demeanor that gives him weight beyond his years.\n\n                    WILL\n          Good day, sir.\n              (holds out the case)\n          I have your order.\n\nSwann hurries to him, opens the case. Inside is a\nbeautiful dress sword and scabbard. Swann takes it out\nreverently.\n\n                    WILL (CONT'D)\n\n                    WILL (CONT'D)\n          The blade is folded steel. That's\n          gold filigree laid into the\n          handle. If I may -\n\nHe takes the sword from Swann, and balances it on one\nfinger at the point where the blade meets the guard.\n\n                    WILL (CONT'D)\n\n          Perfectly balanced. The tang is nearly\n          the full width of the blade..\n\n                    SWANN\n          Impressive. .. very impressive.\n          Commodore Norrington will be pleased,\n          I'm sure. Do pass my compliments on to\n          your master.\n\nWill's face falls. Clearly, the work is his, and he is\nproud of it. With practiced ease, he flips the sword\naround, catches it by the hilt and returns it to the case.\n\n                    WILL\n              (bows slightly)\n          I shall. A craftsman is always pleased\n          to hear his work is appreciated --\n\nHe stops speaking abruptly, staring past Swann -\n\nElizabeth stands on the stairs. Granted, the dress may be\npainful to wear, but holy smokes!\n\n                    SWANN\n          Elizabeth! You look stunning!\n\nWill tries to speak, but can't. He gives up, smiles to\nhimself, and simply nods emphatically.\n\n                    ELIZABETH\n          Will! It's so good to see you!\n\nHer hand goes to the chain around her throat (the medallion\nis hidden in the bodice of her dress).\n\n                    ELIZABETH (CONT'D)\n          I dreamt about you last night.\n          Will reacts with surprise:\n          \"Really?\n\n                    SWANN\n          Elizabeth, this is hardly\n          appropriate -\n\n                    ELIZABETH\n              (ignores her father)\n          About the day we met. Do you\n          remember?\n\n                    WILL\n          I could never forget it, Miss\n          Swann.\n\n                    ELIZABETH\n          Will, how many times must I ask\n          you to call me 'Elizabeth'?\n\n                    WILL\n          At least once more, Miss Swann. As\n          always.\n\nElizabeth is disappointed and a little hurt by his\nresponse.\n\n                    SWANN\n          Well said! There's a boy who\n          understands propriety. Now, we must be\n          going.\n\nSwann takes the case from Will, opens the door for\nElizabeth.\n\nElizabeth straightens her back, gathers her skirts and\nstrides past Will.\n\n                    ELIZABETH\n          Good day, Mr. Turner.\n\nEXT. GOVERNOR'S MANSION - DAY\n\nSwann follows Elizabeth out the door.\n\n                      WILL\n          Good day.\n\nHe watches as she is helped aboard a carriage by the\ndriver.\n\n                     WILL (CONT'D)\n              (to himself)\n          Elizabeth.\n\nIN THE CARRIAGE: Swann glowers at his daughter.\n\n                    SWANN\n          Dear, I do hope you demonstrate a bit\n          more decorum in front of Commodore\n          Norrington. After all, it is only\n\n          through his efforts that Port Royal has\n          become at all civilized.\n\nEXT. PORT ROYAL - HARBOR - DAY\n\nThe skeletal remains of four pirates, still clad in\nbuccaneer rags, hang from gallows erected on a rocky\npromontory. There is a fifth, unoccupied gallows, bearing a\nsign:\n\nPIRATES - YE BE WARNED.\n\nThe top of a billowing sail passes regally in front of\nthem. On the landward face of the sail, apparently high in\nthe rigging, is a man for whom the term 'swashbuckling\nrogue' was coined: Captain JACK SPARROW.\n\nHe gazes keen-eyed at the display as they pass. Raises a\ntankard in salute. Suddenly, something below catches his\nattention. He jumps from the rigging -\n\n-- and that's when we see that his is ship is not an\nimposing three-master, but just a small fishing dory with a\nsingle sail, plowing through the water -- the Jolly Mon.\n\nAnd it leaks. Which is why he has the tankard: to bail.\n\nJack steps back to the tiller, and using a single sheet to\ncontrol the sail, and the Jolly Mon comes around the\npromontory, the whole of Port Royal laid out before him.\n\nThe huge British dreadnought, H.M.S. Dauntless dominates\nthe bay. But Jack's attention is on a different ship: the\nH.M.S. Interceptor, a small sleek vessel with rail guns and\na mortar in the middle of the main deck. It is tied up at\nthe Navy landing, at the base of the cliffs below Fort\nCharles.\n\nEXT. PORT ROYAL - DOCKS - DAY\n\nSmoothly and with no wasted movement, Jack hauls down the\nsail, stows it, guides the dory alongside a dock. The\nHARBORMASTER, a long ledger tucked under his arm, is there\nto catch a line and help Jack tie up.\n\n                    HARBORMASTER\n          If you're out rolling scuppers in\n          this tub, you're either incredibly\n          brave or incredibly stupid.\n\n                    JACK\n          It's remarkable how often those\n          two traits coincide.\n\nHe starts up the dock, strapping on his sword belt; besides\nthe scabbard, it also carries a compass, pistol and small\npowder horn. The Harbormaster cuts him off.\n\n                    HARBORMASTER\n          It's a shilling for the dock\n          space, and you're going to have to\n          give me your name.\n\n                    JACK\n          What do you say to three\n          shillings, and we forget the name?\n\nHe tosses three shillings onto the ledger. The Harbormaster\nconsiders, then shuts the ledger on the coins, steps aside.\n\n                    HARBORMASTER\n          Welcome to Port Royal, Mr. Smith.\n\nJack gives him a half-salute as he goes past. Looks across\nthe water toward the Interceptor -- and smiles. Above the\nInterceptor, among the parapets of Fort Charles, a ceremony\nis underway -\n\nEXT. FORT CHARLES - DAY\n\nWith choreographed precision, Swann removes the sword and\nscabbard from the presentation case, held by a uniformed\nNavy man. He slides the sword into the scabbard, holds it\nout vertically to Norrington, in full dress uniform.\n\nNorrington grasps the scabbard above Swann's hand, and\nSwann lets go. Norrington draws the sword, flourishes the\nsword, and snaps the blade up in front of his face. Swann\nsteps forward, pins a medal to Norrington's jacket, steps\nback.\n\nNorrington nods, turns smartly and nods to his fellow\nofficers, turns again and nods to the audience -\ndignitaries, merchants, plantation owners, their families.\nAnother flourish, and he returns the sword to its scabbard.\n\nThe silence is broken by loud APPLAUSE. Backslapping from\nthe Navy men.\n\nIn the audience, Elizabeth doesn't look so good, out\nbeneath the hot sun. She applauds briefly, then winces.\nDiscreetly tries to adjust the corset through the material\nof the dress, then resumes clapping, trying to hide her\ndiscomfort.\n\nEXT. PORT ROYAL - NAVY DOCK - DAY\n\nTwo sailors on sentry duty, MURTOGG and MULLROY, take\nadvantage of what little shade there is on the dock. But\nwhen Jack saunters up, they are immediately on alert.\n\n                     MURTOGG\n          This dock is off-limits to\n          civilians.\n\n                    JACK\n          Sorry, I didn't know.\n\nMusic drifts down from Fort Charles. Jack looks up, shields\nhis eyes.\n\n                    JACK (CONT'D)\n          Some sort of to-do up at the fort, eh?\n          You two weren't invited?\n\n                     MURTOGG\n          No ... someone has to make sure\n          this dock stays off-limits to\n          civilians.\n\n                    JACK\n          This must be some important boat.\n\n                       MULLROY\n          Ship.\n\n                       JACK\n          Ship.\n\n                    MURTOGG\n          Captain Norrington's made it his\n          flagship. He'll use it to hunt\n          down the last dregs of piracy on\n          the Spanish Lake.\n\n                       MULLROY\n          Commodore.\n\n                    MURTOGG\n          Right. Commodore Norrington.\n\n                    JACK\n          That's a fine goal, I'm sure ... But it\n          seems to me a ship like that --\n              (indicates the Dauntless)\n          -- makes this one here just a wee\n          superfluous.\n\n                    MURTOGG\n          Oh, the Dauntless is the power in\n          these waters, true enough -- but\n          there's no ship that can match the\n          Interceptor for speed.\n\n                    JACK\n          That so? I've heard of one, supposed to\n          be fast, nigh uncatchable ... the Black\n          Pearl?\n\nMullroy scoffs at the name.\n\n                    MULLR0Y\n          There's no real ship as can match\n          the Interceptor.\n\n                    MURTOGG\n          The Black Pearl is a real ship.\n\n                    MULLROY\n          No, it's not.\n\n                    MURTOGG\n          Yes it is. I've seen it.\n\n                    MULLR0Y\n          You've seen it?\n\n                    MURTOGG\n          Yes.\n\n                    MULLROY\n          You've seen the Black Pearl?\n\n                    MURTOGG\n          Yes.\n\n                    MULLR0Y\n\n          You haven't seen it.\n\n                    MURTOGG\n          Yes, I have.\n\n                    MULLR0Y\n          You've seen a ship with black sails\n          that's crewed by the damned and\n          captained by a man so evil that hell\n          itself spat him back out?\n\n                     MURTOGG\n          ... No .\n\n                     MULLROY\n          No.\n\n                    MURTOGG\n          But I've seen a ship with black sails.\n\n                    MULLR0Y\n          Oh, and no ship that's not crewed by\n          the damned and captained by a man so\n          evil hell itself spat him back out\n          could possibly have black sails and\n          therefore couldn't possibly be any ship\n          other than the Black Pearl. Is that\n          what you're saying?\n\n                     MURTOGG\n          ... no.\n\n                    MULLR0Y\n              (turns back to Jack)\n          Like I said, there's no real ship\n          as can match -- Hey!\n\nBut Jack's not there. Murtogg and Mullroy look around, spot\n-\n\nJack standing at the wheel of the Interceptor, casually\nexamining the mechanism.\n\n                     MULLROY (CONT'D)\n          You!\n\nJack looks over in exaggeratedly innocent surprise. The\nsailors hurry toward the gangplank.\n\n                    MULLROY (CONT'D)\n          Get away from there! You don't\n          have permission to be aboard\n          there!\n\nJack spreads his hands in apology.\n\n                    JACK\n          I'm sorry. It's just such a pretty\n          boat. Ship.\n\nThe sailors study him suspiciously.\n\n                    MURTOGG\n          What's your name?\n\n                       JACK\n          Smith.\n\n                    MULLR0Y\n          What's your business in Port\n          Royal, 'Mr. Smith' ?\n\n                    MURTOGG\n          And no lies!\n\n                    JACK\n          None? Very well. You've rumbled\n          me. I confess: I intend to\n          commandeer one of these ships,\n          pick up a crew in Tortuga, and go\n          out on the account, do a little\n          honest pirating.\n\n                    MURTOGG\n          I said, no lies.\n\n                    MULLR0Y\n          I think he's telling the truth.\n\n                    MURTOGG\n          He's not telling the truth.\n\n                       MULLROY\n          He may be.\n\n                    MURTOGG\n          If he were telling the truth he\n          wouldn't have told us.\n\n                    JACK\n          Unless, of course, he knew you wouldn't\n          believe the truth if he told it to you.\n\nMurtogg and Mullroy consider that point --\n\nEXT. FORT CHARLES - DAY\n\nElizabeth, pale and perspiring, fans herself weakly,\noblivious to the music and chatter.\n\n                    NORRINGTON\n          May I have a moment?\n\nHe extends his arm. She takes it. He walks her away from\nthe party, toward the parapet. A rather too long of a\nsilence as Norrington works up his courage.\n\n                    NORRINGTON (CONT'D)\n              (a burst)\n          You look lovely. Elizabeth.\n\nElizabeth frowns, unable to focus. Norrington mistakes her\nexpression as disapproval.\n\n                    NORRINGTON (CONT'D)\n          I apologize if I seem forward --\n          but I must speak my mind.\n\n\n                     NORRINGTON (CONT'D)\n              (working up his\n               confidence to do so)\n          This promotion confirms that I have\n          accomplished the goals I set for myself\n          in my career. But it also casts into\n          sharp relief that which I have not\n          achieved. The thing all men most\n          require: a marriage to a fine woman.\n              (beat)\n          You have become a fine woman,\n          Elizabeth.\n\n                    ELIZABETH\n          I can't breathe.\n\n                    NORRINGTON\n              (smiles)\n\n          I'm a bit nervous, myself --\n\nElizabeth loses her balance, stumbles away from Norrington.\nShe reaches a hand out to the parapet to steady herself,\nbut it slides off -\n\n-- and then she vanishes over the wall. Gone.\n\n                    NORRINGTON (CONT'D)\n          Elizabeth! .\n\nEXT. PORT ROYAL - NAVY DOCKS - DAY\n\nJack reacts, pushes Murtogg aside to see -\n\nElizabeth plummets from the top of the cliff. It seems to\ntake her a long time to reach the sea --\n\nElizabeth hits the water, narrowly missing the sharp rocks.\nA wave breaks, and then she is washed out away from the\ncliff, struggling feebly.\n\nAT THE FORT, Norrington looks down --\n\nNORRINGTON ELIZABETH!\n\nHe leaps to the top of the parapet, prepared to dive -- a\nlieutenant, GILLETTE catches his arm.\n\n                    GILLETTE\n          The rocks, sir! It's a miracle she\n          missed them!\n\nNorrington shakes off his arm, looks down -- and realizes\nGillette is right. He jumps down and runs --\n\nEXT. PORT ROYAL - NAVY DOCKS - DAY\n\nJack, Murtogg and Mullroy are still in shock from the\nsight.\n\n                    JACK\n          Aren't you going to save her?\n\n                    MULLR0Y\n          I can't swim.\n\nMurtogg shakes his head -- neither does he.\n\n                    JACK\n              (rolls his eyes)\n          Sailors.\n\nAbove where Elizabeth struggles in the water. Norrington\nand several other men pick their way down the cliffs. They\nare too far away to get to her in time.\n\nJack scowls. He has no choice -- and it pisses him off.\n\n                    JACK (CONT'D)\n          Fine.\n\nHe pulls a pistol from his sword belt, hands it to Murtogg;\nthen hands the belt to Mullroy.\n\n                    JACK (CONT'D)\n          Don't lose these.\n\nAnd then he dives into the water, swims toward Elizabeth.\n\nElizabeth struggles to keep above water, gasping for air '-\nthen a swell rolls over her, and she is submerged -\n\nUNDERWATER, Elizabeth drifts down, unconscious. The current\nturns her, and the MEDALLION slips loose from her bodice.\n\nThe MEDALLION turns slowly, until the SKULL is fully\nvisible. A shaft of filtered sunlight hits it, and it\nGLINTS -\n\nEXT. PORT ROYAL - VARIOUS - DAY\n\nFORT CHARLES: The British flag flies, blown from an\noffshore breeze. Suddenly the wind dies, and the flag goes\nlimp.\n\nON THE DOCKS: Wood and metal fittings on lines bang against\nmasts. The wind dies, and there is silence.\n\nON THE EDGE OF TOWN: A CARIBE WOMAN feeds clucking\nchickens, frowns when they all suddenly go quiet ...\n\nIN THE VILLAGE: A weather vane moves slightly in the wind.\nThe wind stops, and all is still. And then ...\n\n... the weather vane TURNS, and holds steady -- the wind\nhas picked up again, but now blows .from the sea toward the\nland.\n\nl)ON THE BEACH: an OLD SALT pulls a rope line, pauses.\nTurns and gazes to the sky, frowning. The mangy hound at\nhis side starts BARKING incessantly -\n\nON THE DOCKS: The lines bang against the other sides of the\nmasts, the wind far stronger now.\n\nFORT CHARLES: the British flag flies in the opposite\ndirection, snapping in the new onshore breeze.\n\nEXT. PORT ROYAL - CLIFFSIDE - DAY\n\nNorrington rushes down, intent on the climb. Beyond him,\npast the rocky point, far out to sea, FOG gathers -\n\nEXT. PORT ROYAL - OCEAN - DAY\n\nUNDERWATER: the medallion hangs below Elizabeth's unmoving\nform - - and then Jack is there. He wraps an arm around her\nand makes for the surface.\n\nON THE SURFACE, Jack swims toward the dock, struggling. It\nis .: far more difficult than it should be. He stops\nstroking, and they submerge.\n\nUNDERWATER: Jack realizes that   it is Elizabeth's heavy\nvelvet dress that is weighing   them down. He pulls at the\nbuttons on the back, and they   give way. He skins her out of\nthe dress, and kicks away from   it.\n\nThe dress falls like a cloud into darkness -\n\nON THE SURFACE: Jack swims with Elizabeth, much more\nquickly.\n\nAT THE DOCK, Murtogg and Mullroy are there to help haul\nElizabeth out of the water.\n\nJack climbs up, exhausted. Elizabeth is on her back;\nMurtogg holds her arms above her head, pumping them.\nMullroy puts his cheek to her nose and mouth.\n\n                    MULLROY\n          Not breathing.\n\nMurtogg looks down; it seems hopeless. Jack steps up,\ndrawing Murtogg's knife from its sheath.\n\n                    JACK\n\n          Move.\n\nHe pushes past Mullroy, kneels over Elizabeth, raises the\nknife -- Murtogg is shocked -\n\nJack slits the corset down the middle, yanks it away.\n\nElizabeth remains still. And then -- she coughs up water\nand gasps, choking on her first full breath. Jack is\nrelieved.\n\n                    MULLROY\n          I never would have thought of\n          that.\n\n                     JACK\n          Clearly, you've never been to\n          Singapore.\n\nJack flips the knife and hands it hilt-first to Murtogg -\nand that's when he spots -\n\nThe MEDALLION. Jack catches it up in his \"hand.\n\n                    JACK (CONT'D)\n          Where did you get this?\n\nBefore Elizabeth can answer, the BLADE of a SWORD is at\nJack's THROAT -- Norrington's new ceremonial sword, in\nfact, looking bright and sharp.\n\n                    NORRINGTON\n          On your feet.\n\nIt looks bad -- Jack standing over Elizabeth, most of her\nclothes gone. He gets to his feet. The rest of Elizabeth's\nerstwhile rescuers reach the scene, including Swann.\n\n                    SWANN\n          Elizabeth! Are you all right?\n\nHe strips off his jacket, drapes it around her.\n\n                    ELIZABETH\n          Yes -- yes, I'm fine -- Commodore\n          Norrington, do you intend to kill\n          my rescuer?\n\nNorrington looks at Jack. Jack nods as best he can with a\nblade beneath his chin. Norrington sheathes his sword, and\nextends his hand.\n\n                    NORRINGTON\n          I believe thanks are in order.\n\nJack takes Norrington's hand gingerly. They shake -\n\n-- and Norrington tightens his grip, yanks Jack's arm\ntoward him, then tears back the sleeve of Jack's shirt -\n\n-- exposing a BRAND on Jack's inner wrist: a large 'P.'\n\n                    NORRINGTON (CONT'D)\n          Had a brush-up with the East India\n          Trading Company, did you ... pirate?\n\nThe others react in shock, but the sailors are well-trained\n--in an instant, half a dozen pistols are aimed at Jack. He\nstands there, still holding the corset.\n\n                    NORRINGTON (CONT'D)\n          Keep your guns on him, men. Gillette,\n          fetch some irons.\n\nNorrington notices something else -- below the 'P' brand is\na tattoo: a small bird in flight across water.\n\n                    NORRINGTON (CONT'D)\n          Well, well... Jack Sparrow, isn't it?\n\n                    JACK\n          Captain Jack Sparrow. If you please.\n\nNorrington looks out at the bay.\n\n                    NORRINGTON\n          I don't see your ship -- Captain.\n\n                    MURTOGG\n          He said he'd come to commandeer one.\n\n                    MULLROY\n              (to Murtogg)\n          I told you he was telling the truth.\n              (currying favor)\n          These are his, sir.\n\nHe holds out Jack's pistol and belt. Norrington takes the\npistol, examines it, notes the powder horn on Jack's belt.\n\n                    NORRINGTON\n              (to Jack)\n          Extra powder, but no additional shot.\n\nJack shrugs. Norrington unhooks the compass from the belt,\nopens it. He frowns at the reading. Moves the compass this\nway and that, keeping it parallel to the ground.\n\n                    NORRINGTON (CONT'D)\n          It doesn't bear true.\n\nJack looks away, a bit embarrassed. Norrington returns the\ncompass to the belt. Draws the sword half from the\nscabbard.\n\n                    NORRINGTON (CONT'D)\n          I half-expected it to be made of wood.\n\nHe slides it back into the scabbard, hands it to Mullroy.\n\n                    NORRINGTON (CONT'D)\n          Taking stock: you've got a pistol with\n          only one shot, a compass that doesn't\n          point north ... and no ship. You are\n          without a doubt the worst pirate I have\n          ever heard of.\n\n                    JACK\n          Ah, but you have heard of me.\n\nGillette returns with shackles, approaches Jack.\n\n                    NORRINGTON\n          Carefully, lieutenant.\n\nElizabeth steps forward. Swann's jacket slips off her. She\nis unconcerned, but he is intent on putting it back on her.\n\n                    ELIZABETH\n          Commodore, I must protest. Pirate or\n          not, this man saved my life.\n\n                    NORRINGTON\n          One good deed is not enough to redeem a\n          man of a lifetime of wickedness.\n\nGillette snaps the manacles closed on Jack's wrists.\n\n                    JACK\n          But it seems to be enough to condemn\n          him.\n\n                    NORRINGTON\n              (smiles)\n          Indeed.\n\nNow that Jack is safely chained, Norrington nods to his\nmen. All but one stow their weapons, and two step forward -\n\n                       JACK\n          Finally.\n\nLightning-quick, he snaps the   corset  around the hand and\nwrist of the man holding the   pistol  and yanks. The pistol\nsails into the water. Before   anyone  can react to that, Jack\nhas the manacle chain wrapped   around  Elizabeth's throat.\n\nPistols are drawn again, but now Elizabeth serves as a\nshield. Norrington raises a cautioning hand to his men.\n\n                    JACK (CONT'D)\n              (backing away, toward land)\n          Commodore Norrington ... my pistol and\n          belt, please.\n\nNorrington hesitates, balls his fists in frustration.\n\n                       JACK (CONT'D)\n          Commodore!\n\nMullroy hands the pistol and belt to Norrington. Norrington\nholds them out to Jack.\n\n                    JACK (CONT'D)\n          Elizabeth -- it is Elizabeth?\n\nElizabeth is more angry than frightened.\n\nELIZABETH Miss Swann.\n\n                    JACK\n          Miss Swann, if you'll be so kind?\n\nShe takes the belt and pistol from Norrington -- Jack's\nquicker than she is, and takes the pistol from her. He\njerks her around so she is facing him, belly to belly.\n\n                    JACK (CONT'D)\n          Now, if you'll be very kind?\n\nShe figures out what he wants: put the belt on him.\n\n                    ELIZABETH\n              (as she works)\n          You are despicable.\n\n                    JACK\n          I saved your life; now you've\n          saved mine. We're square.\n\nDone. He turns her again, and then backs up until he bumps\nagainst the cargo gantry.\n\n                    JACK (CONT'D)\n          Gentleman. .. m' lady. .. you will\n          always remember this as the day\n          you almost caught Captain Jack\n          Sparrow.\n\nHe shoves Elizabeth away, grabs a rope and pulls free a\nbelaying pin -- a counterweight drops and Jack is lifted up\nto the middle of the gantry, where he grabs a second rope -\n\nPistols fire -- and miss. Jack swings out, out, out, away\nand around from the gantry.\n\nNorrington has held his shot. With careful aim, he tracks\nJack's trajectory-\n\nJack drops from the rope even as Norrington FIRES. His shot\ntears the rope -\n\n-- as Jack plummets past one of the gantry's guy lines, he\nsnaps the length of manacle chain over the line and grabs\nhold of the far loop -- slides down the line -\n\n-- drops to the deck of a ship. He runs, leaping to another\nship, then out of sight -\n\n                    NORRINGTON\n          On his heels! Gillette, bring a\n          squad down from the fort!\n\n              (to Elizabeth)\n          Elizabeth, are you -\n\n                    ELIZABETH\n          Yes, I'm all right, I'm fine! Go\n          capture him.\n\nNorrington's taken aback by her ire, and wisely hurries\naway. Swann drapes his coat around Elizabeth.\n\n                    SWANN\n          Here, dear ... you should wear this.\n\nElizabeth shivers, finding suddenly that she is cold.\nGlances out at the bay -\n\n-- where a THICK FOG moves across the top of the water. She\ntakes the jacket.\n\n                    ELIZABETH\n          Thank you, Father ... and let that\n          be the last of your fashion\n          advice, please.\n\nBut she accepts his comforting embrace.\n\nEXT. PORT ROYAL - TOWN - ALLEY - DAY\n\nThe fog creeps through, casting an eerie twilight pall. An\narmed search party moves along the street. They glance down\nan alley-\n\nOn the far side is another search party. The men nod to\neach other, continue on.\n\nA moment, and then Jack drops from his hiding place beneath\nthe eaves of a building. He still wears the manacles.\n\nAcross the street is a shop with barn doors, a pass-thru\ndoor set in the middle. Above is a sign with a black anvil.\n\nINT. BLACKSMITH'S FORGE - DAY\n\nJack slips in through the door, takes a look around:\n\nNo windows. The forge is dark, lit   by lanterns. Work-in-\nprogress is scattered about: wagon   wheels, wrought iron\ngates, pipes -- even a cannon with   a crack in it. But every\ntool is in place; the workbench is   tidy and neat.\n\nJack is startled by a noise: MISTER BROWN, in a\nblacksmith's apron, snores in the corner, cradling a\nbottle. Jack gives him a hard poke. Another. Brown snorts,\nturns away.\n\nSatisfied, Jack sheathes his sword, takes a short-handled\nsledge from its place on the wall. Moves to the glowing\ncoke furnace in the middle of the room.\n\nSlowly... he holds his right hand over the furnace, the\nchain down in the embers. The chain begins to GLOW. Jack\nsweats, grimaces at the pain -\n\nMoving quickly, he wraps the chain around the nose of an\nanvil, brings the sledge down with a fast, hard stroke on\nthe glowing links. One SHATTERS. Jack drops the sledge,\nplunges his manacled hand in a bucket of water. Steam\nbillows.\n\nJack pulls his hand out, flexes it. Blisters form beneath\nthe manacle -- but his hands are free.\n\nThe SOUND of the latch on the door -- Jack dives for cover.\n\nWill enters the forge, shuts the door behind him. Spots the\ndrunken Mister Brown in the corner.\n\n                    WILL\n          Right where I left you.\n\nSomething catches his eye: an empty peg on the wall. The\nsledge lying beside the anvil.\n\n                    WILL (CONT'D)\n              (under his breath)\n          Not where I left you.\n\nHe moves casually toward the sledge. Then grabs for it --\nbut the flat of a sword blade slaps his hand. Will jumps\nback.\n\nJack stands there, sword leveled at Will. He backs Will up,\ntoward the door. Will glares at him.\n\n                    WILL (CONT' D)\n              (voice low and tight)\n          You're the one they're hunting.\n          The pirate.\n\nJack acknowledges it with a tip of his head ... then\nfrowns, regards Will.\n\n                    JACK\n          You look familiar ... Have I ever\n          threatened you before?\n\n                    WILL\n          I've made a point of avoiding\n          familiarity with pirates.\n\n                    JACK\n          Ah. Then it would be a shame to\n          put a black mark on your record.\n          So if you'll excuse me ...\n\nBeside the door is a grindstone, a sword resting in\nthe honing guide. Before Jack can react, Will has it\nin hand.\n\n                    JACK (CONT'D)\n          Do you think this is wise, boy?\n          Crossing blades with a pirate?\n\n                    WILL\n          You threatened Miss Swann.\n\n                    JACK\n          Only a little.\n\nIn response, Will assumes an en garde position. Jack\nappraises him, unhappy to see Will knows what he's doing.\n\nJack attacks. The two men stand in one place, trading\nfeints, thrusts and parries with lightning speed, almost\nimpossible to follow. Will has no trouble matching Jack.\n\n                    JACK (CONT'D)\n          You know what you're doing, I'll\n          give you that ... Excellent form\n          ... But how's your footwork? If I\n          step here -\n\nHe takes a step around an imaginary circle. Will steps the\nother way, maintaining his relationship to Jack.\n\n                    JACK (CONT'D)\n          Very good! And if I step again,\n          you step again. . .\n\n              (continuing to step\n               around the circle)\n          And so we circle, circle, like\n          dogs we circle. . .\n\nThey are now exactly opposite their initial positions.\n\n                    JACK (CONT'D)\n          Ta!\n\nJack turns and heads for the door, now directly behind him.\n\nWill registers angry surprise -- and then with a vicious\noverhand motion, he throws his sword -\n\n-- the sword buries itself into the door, just above the\nlatch, barely missing Jack. Jack registers it, then pulls\non the latch, but it won't move up -- the sword is in the\nway.\n\nJack rattles the latch. Tugs on the sword a few times -- it\nis really stuck in there. Jack mouths a curse, but when he\nturns back to Will, he's smiling.\n\n                    JACK (CONT' D)\n          That's a good trick. Except, once\n          again, you are between me and the\n          way out.\n              (points his sword at the\n               back door)\n          And now you have no weapon.\n\nEyes on Jack, Will simply picks up a new sword from an\nanvil. Jack slumps in dismay -- but then leaps forward.\n\nWill and Jack duel. Their blades flash and ring. Suddenly,\nJack swings the chain still manacled to his left hand at\nWill's head. Will ducks it, comes up wide-eyed.\n\nThen Jack's chain smashes across Will's sword, disarming\nhim.\n\nWill quickly picks up another sword. Jack becomes aware\nthat the entire room is filled with bladed weapons: swords,\nknives, boarding axes in various stages of completion.\n\n                    JACK (CONT'D)\n          Who makes all these?\n\n                    WILL\n          I do. And I practice with them. At\n          least three hours a day.\n\n                    JACK\n          You need to find yourself a girl.\n              (Will sets his jaw)\n          Or maybe the reason you practice\n          three hours a day is you've found\n          one -- but can't get her?\n\nA direct hit -- and Will coils even more tightly with\nanger.\n\n                    WILL\n          No. I practice three hours a day\n          so that when I meet a pirate ... I\n          can kill him.\n\nHe explodes: kicks a rack, causing a sword to fall into his\nhand; uses his foot to bring his dropped sword into the\nair, catches it -- and attacks Jack, both blades flashing.\n\nJack parries with sword and chain. Jack's chain wraps\naround Will's sword; Will twists the handle of his guard\nthrough a link, and stabs the sword up into the ceiling -\n\nSo Jack's manacled left arm is now suspended from the\nceiling. Not good. He parries using one hand, twisting and\ndodging around the furnace -\n\nJack compresses the bellows, blowing a SHOWER OF SPARKS\ninto Will's face. Jack grabs the chain, hoists himself up,\nkicks with his feet, knocking Will back.\n\nJack uses his full weight, yanks the sword from the\nceiling. Hurls a wooden mallet at Will, then a second,\nhitting Will on the wrist. Will drops his sword, falls\ndown, gets up -\n\nJack's pistol is aimed directly between Will's eyes.\n\nWill steps back, directly in front of the back exit.\nGlares, rubs his wrist gingerly.\n\n                    WILL (CONT'D)\n          You cheated.\n\n                    JACK\n\n              (smiles; what do you expect?)\n          Pirate.\n\nJack steps forward. Will steps back, fully blocking the\ndoor.\n\n                       JACK (CONT'D)\n          Move away.\n\n                       WILL\n          No.\n\n                       JACK\n          Move!\n\n                    WILL\n          No. I can not just step aside and\n          let you escape.\n\nJack cocks the pistol. Will stares back. The stand-off\nlasts for a long moment.\n\n                    JACK\n          You're lucky, boy -- this shot's\n          not meant for you.\n\nJack uncocks the pistol. Will is surprised, reassesses Jack\n-\n\nSuddenly, Mister Brown SLAMS his bottle against Jack's\nskull. Jack crumples to the ground.\n\nThe front and back doors smash open, and SAILORS fill the\nroom. Norrington pushes forward, sees Jack on the ground.\n\n                    NORRINGTON\n          Excellent work, Mister Brown.\n          You've aided in the capture of a\n          dangerous fugitive.\n\n                    BROWN\n          Just doing my civic duty.\n\nJack groans. Norrington stands over him, smiles.\n\n                    NORRINGTON\n          I believe you will always remember\n          this as the day Captain Jack\n          Sparrow almost escaped.\n\nNorrington's men haul Jack away. Will watches them go.\nBrown looks at his bottle -- broken.\n\n                    BROWN\n          That ratter broke my bottle.\n\nEXT. PORT ROYAL - NIGHT\n\nThe thick fog blankets the entire bay now, and the town.\n\nThe only structure visible is Fort Charles, high on the\n\nbluff, like a tall ship sailing a sea of grey.\n\nAbove the Fort is a clear black sky sprinkled with stars. A\nwaxing moon shines, giving both Fort and fog an eerie glow.\n\nANGLE - FORT CHARLES,\n\njust below the stone parapets of the fort, visible briefly\ndeep in the fog, like a shark fin slicing through the\nwater: the TOPMAST of a ship, BLACK SAILS billowing. Flying\nfrom the mast is a flag with white Aztec skull.\n\nThe Black Pearl has come to Port Royal.\n\nINT. GOVERNOR'S MANSION - ELIZABETH'S BEDROOM - NIGHT\n\nA maid removes a bed warmer from the fireplace, slides it\nbetween the sheets at the end of Elizabeth's bed.\n\n                     ELIZABETH\n          Nice and toasty. Thank you,\n          Estrellia.\n\nThe maid nods, exits. Elizabeth opens a book, begins\nreading, toying absently with the medallion chain around\nher neck.\n\nThe lamp flame begins to diminish. Elizabeth tries to turn\nit up. No good. The flame goes out, and the room is black.\n\nINT. BLACKSMITH'S FORGE - NIGHT\n\nWill, shirtless, wearing a leather apron, heats an iron\ningot at the furnace, hammers it flat -- he stops.\n\nHis attention is drawn to the window. He opens the shutter\nand peers out -- nothing but fog. Almost without noticing,\n\nhe reaches for a boarding axe hanging on the wall. Takes it\ndown; it has a satisfying weight in his hands.\n\nINT. CELL BLOCK - NIGHT\n\nCLOSE ON: A mutt of a dog, holding a ring of keys in his\nmouth.\n\nThree seedy-looking prisoners try to coax the dog to their\ncell door. One holds a loop of rope; another waggles a\nbone. The dog just sits and cocks its head.\n\n                    PRISONER\n          Come here, boy... Want a nice,\n          juicy bone?\n\nIn an adjoining cell, Jack lies on a pile of straw.\n\n                    JACK\n          You can keep doing that forever,\n          that dog's never going to move.\n\n                    PRISONER\n          Excuse us if we ain't resigned\n          ourselves to the gallows just yet.\n\nEXT. FORT CHARLES - PARAPETS - NIGHT\n\nA noose hangs from a gallows in the courtyard. Norrington\nand Swann walk along the far wall.\n\n                    SWANN\n          Has my daughter given you an\n          answer yet?\n\n                    NORRINGTON\n          No. She hasn't.\n\n                    SWANN\n          Well, she had a taxing day...\n          Ghastly weather tonight.\n\n                    NORRINGTON\n          Bleak. Very bleak.\n\nFrom the distance, there is a BOOM -\n\n                    SWANN\n          What was that?\n\n-- and then the WHISTLE of an incoming ball --\n\n                    NORRINGTON\n          Cannon fire!\n\nHe tackles Swann as the wall of the parapet EXPLODES --\n\nINT. CELL BLOCK - NIGHT\n\nJack sits up. There are more BOOMS -\n\n                    JACK\n          I know those guns!\n\nHe peers out through the bars of the window. The other\nprisoners crowd around their window as well.\n\n                    JACK (CONT'D)\n          It's the Black Pearl.\n\n                     PRISONER\n              (frightened)\n          The Black Pearl? I've heard\n          stories ... she's been preying on\n          ships and settlements for near ten\n          years ... and never leaves any\n          survivors.\n\n                    JACK\n          There are a lot of stories about\n          the Black Pearl.\n\nEXT. PORT ROYAL - HARBOR - NIGHT\n\nThe Black Pearl still cannot be seen -- but the fog lights\nup around her with each boom of her guns. She's firing on\nboth sides now, hammering both the fort and the town.\n\nEXT. PORT ROYAL - TOWN - NIGHT\n\nStreets, buildings, docks and ships shatter and explode\nbeneath the onslaught. Villagers panic, run for cover,\ndodge flying debris as best they can. If this is not hell\non earth, then it's about to be --\n\n-- long boats emerge out of the fog, carrying ARMED\nPIRATES. They swarm from the boats, striking down\n,villagers indiscriminately and setting fires.\n\nINT. BLACKSMITH'S FORGE - NIGHT\n\nWill slips the boarding axe into his belt at the small of\nhis back. He puts a dirk in his belt, then a second and a\nthird. He picks up a second axe and a sword.\n\nWill slides back the doors of the forge --\n\nA woman runs past, chased by a ONE-ARMED PIRATE wearing a\nyellow bandeau. Will backhands the axe square into his\nchest, a deadly blow. Will heads out, up the street --\n\nEXT. FORT CHARLES - PARAPETS - NIGHT\n\nThe moon is obscured by smoke rising from the burning\ngallows and wooden roofs. Cannon fire continues to rain\ndown, but the fort's own cannons now return fire.\n\n                    NORRINGTON\n          Governor! Barricade yourself in my\n          office!\n              (Swann hesitates)\n          That's an order!\n\nSwann turns to go -- but finds himself face-to-face with a\npirate -- KOEHLER, a handsome blond man with gold earrings.\nBeyond Koehler, more pirates come up over the far wall.\nKoehler grins and raises a cutlass -\n\n-- Norrington's sword blocks Koehler's slash.\n\n                    NORRINGTON (CONT'D)\n          They've flanked us! Men! Swords\n          and pistols!\n\nThe battle is joined --\n\nINT. GOVERNOR'S MANSION - ELIZABETH f S BEDROOM - NIGHT\n\nElizabeth looks out a window at the scene below: even\nthrough the fog, multiple fires are visible, and ships burn\nin the harbor. Shouts and cries of pain. Cannon fire\nECHOES.\n\nShe notices movement directly below her window: two SHADOWY\nFIGURES, approaching the house -- pirates. Elizabeth bolts\nfrom her room--\n\nINT. SECOND FLOOR HALLWAY - NIGHT\n\nShe reaches the railing overlooking the foyer, and cries\nout, just as the butler opens the door -- too late; there\nis the BOOM of a gun, and the butler crumples.\n\nElizabeth ducks down in horror, peering through the\nbalusters. The pirates scan the foyer, searching. The\nleader is PINTEL, a sallow-looking pirate with a bald head.\n\nSuddenly Pintel looks up, and locks eyes with Elizabeth.\nHow could he know she was there?\n\n                      PINTEL\n          Up there!\n\nThe pirates rush for the stairs. Elizabeth scrambles back\ninto the nearest room--\n\nINT. SITTING ROOM - NIGHT\n\nElizabeth shuts the door, locks it, listens as the pirates\npound up the stairs --\n\n                    ESTRELLA\n          Miss Elizabeth?\n\nElizabeth jumps. Estrella is right behind her, terrified.\nThey whisper:\n\n                    ESTRELLA (CONT'D)\n          Are they come to kidnap you, miss?\n          The daughter of the governor would\n          be very valuable.\n\nElizabeth realizes she's right. There is the SLAM of a body\nagainst the door.\n\n                    ELIZABETH\n          Listen, Estrella -- they haven't\n          seen you. Hide, and first chance,\n          run for the fort .\n\nEstrella nods. Another SLAM at the door -- it gives a bit -\n-\n\nElizabeth shoves Estrella into the corner, between a tall\nwardrobe and the wall. Dashes for the side door.\n\nWhen the door smashes inward, it slams into the wardrobe,\nand the maid cannot be seen. The pirates run in -- spot the\nopen side door, and run for it --\n\nINT. ELIZABETH'S BEDROOM - NIGHT\n\nPintel is the first through, and gets the pan of the bed\nwarmer in the face for his trouble -- he staggers back,\nholding his nose --\n\nINT. SITIING ROOM - NIGHT\n\nEstrella breaks cover, runs for the hall, unnoticed.\n\nINT. ELIZABETH'S BEDROOM - NIGHT\n\n-- Elizabeth swings the bed warmer at the second pirate,\nbut he catches it by the handle -- Elizabeth can't jerk it\nfree, so she wrenches it over -- the pan lid swings down,\nBANGING the second pirate -- hot coals spill on his head,\nsizzling.\n\nElizabeth dashes for the hallway stairs -\n\nINT. SECOND FLOOR HALLWAY/FOYER - CONTINUOUS - NIGHT\n\nThe pirates burst from the bedroom -- Pintel goes for the\nstairs, but the second pirate vaults the handrail --\n\nEstrella registers the butler's body, but continues out the\nstill-open front door at a dead run. Elizabeth follows --\n\nThe second pirate lands between Elizabeth and the front\ndoor. His face is BURNED, his hair SMOLDERS -- he reaches -\n-\n\nElizabeth pulls up short, runs the other way --\n\nPintel, on the stairs, grabs her by the hair -- Elizabeth\n\ndoesn't slow -- she spins, grabs Pintel's arm with both\nhands and pulls him hard, belly-first, into the cap of the\nnewel post -- he lets go of her hair -- Elizabeth keeps\ngoing\n\nINT. DINING ROOM - NIGHT\n\nElizabeth slams the double doors shut, throws the bolts.\nThe interior shutters are closed over the windows. Above\nthe fireplace are two crossed swords.\n\nElizabeth climbs on the firebox; she grabs one of the\nswords by the hilt and pulls -- but it won't come free.\nBoth swords are securely attached to the wall. Damn!\n\nA SMASH from the doors -- the pirates are relentless -\n\nOn the table is a platter with fruit, cheese and bread.\nElizabeth grabs the knife from the platter -\n\nLike any bread knife, it has a round point. Elizabeth jabs\nit into her palm -- it's useless as a weapon. Double damn!\n\nThe blade of a boarding axe breaches the door -- the\npirates will be through soon -- Elizabeth looks around -\n\nINT. FIRST FLOOR HALLWAY - NIGHT\n\nThe doors give way; the pirates charge through -\n\nINT. DINING ROOM - CONTINUOUS - NIGHT\n\nEmpty. Elizabeth nowhere to be seen. Pintel and Smoldering\nPirate search, under the table, behind draperies.\n\n                    PINTEL\n          We know you're here, poppet. Come\n          out and we promise we won't hurt\n          you.\n\nSmoldering pirate gives him look -- he wants to hurt her\nplenty. Pintel shakes his head: 'Don't worry, I'm lying.'\n\n                    PINTEL (CONT'D)\n          We will find you, poppet ...\n          You've got something of ours, and\n          it calls to us!\n\nINT. DUMBWAITER - NIGHT\n\nElizabeth hides in the dumbwaiter box, wrapped around the\ndouble pulley ropes that go through the center.\n\n                    PINTEL (O.S.)\n          The gold calls to us!\n\nElizabeth registers that -- she pulls out the medallion,\nrubs\n\nthe gold with her thumb. This is their objective. Light\n\nspills into the- box through gaps in the top as the door\nabove is slid open -- Elizabeth looks up through the gaps -\n\nPintel leers down at her.\n\n                      PINTEL (CONT'D)\n            Hello, poppet.\n\nElizabeth works the ropes to lower  the box. Pintel pulls\nthe other way; he's stronger, and  the box rises. Elizabeth\ntries to stop it -- wraps her left  forearm through the rope\nand lets it jam against the top of  the box.\n\nElizabeth gasps at the pain, but the box stops. She saws at\nthe rope with the bread knife.\n\nSmoldering pirate helps pull the rope, crushing Elizabeth's\nforearm. Tears of pain on her face, she keeps sawing -\n\nThe rope parts, and the dumbwaiter box PLUMMETS -\n\nINT. KITCHEN - NIGHT\n\nFrom behind the door of the dumbwaiter comes a CRASH, and a\ncloud of dust. The door slides open, and Elizabeth clambers\nout. Her head is cut, she is streaked with dirt, and can\nbarely stand. She leans over the table, trying to recover.\n\nThe sound of running FOOTSTEPS gets louder ...\n\n                      ELIZABETH\n            Please, no ...\n\nElizabeth touches the chain of the medallion ... and a\ndesperate idea occurs to her.\n\nThe pirates burst through the door. Elizabeth backs away,\nholds the bread knife out to ward them off. They come\naround either side of the table, stalking her -\n\n                      ELIZABETH (CONT'D)\n                (gasps it out)\n            Par. .. Parlay!\n\nPintel can't believe his ears.\n\n                    PINTEL\n          What?\n\n                    ELIZABETH\n          Parlay! I invoke the right of\n          parlay! According to\" the Code of\n          the Brethren, set down by the\n          pirates Morgan and Bartholomew,\n          you must take me to your Captain!\n\n                    PINTEL\n          I know the code.\n\n                    ELIZABETH\n          If an adversary demands parley,\n          you can do them no harm until the\n          parlay is complete.\n\n                    PINTEL\n          It would appear, so do you.\n\n                    SMOLDERING PIRATE\n          To blazes with the code!\n\nHe steps forward, dirk drawn -- Pintel stops him.\n\n                    PINTEL\n          She wants to be taken to the\n          Captain, and she'll go without a\n          fuss.\n\nHe looks to Elizabeth: 'right?' Elizabeth nods.\n\n                    PINTEL (CONT'D)\n          We must honor the code.\n\nSmoldering Pirate concedes the point, sheaths his dirk. He\ngrabs Elizabeth roughly by the arm -\n\nEXT. PORT ROYAL - STREET - NIGHT\n\nWill races along, momentarily free of the pirates. He spots\nthe Governor's Mansion in the distance. There are FIGURES\nmoving away from it -- Elizabeth, forced by the two\npirates.\n\nWill hurries forward -\n\nSuddenly a PIRATE jumps out from the shadows, slashes; Will\ndefends himself. The pirate has one arm and wears a yellow\nbandana. Will hesitates -- didn't he already kill this guy?\n\nThe hesitation is just enough for another PIRATE, swinging\na flaming torch, to SLAM Will in the head from behind. Will\ncrumples.\n\nThe pirate lights a second torch, hands it to One-arm; they\nhoot with delight and head off, setting fires as they go.\n\nOn the ground, Will doesn't move.\n\nINT. FORT CHARLES - CELL BLOCK - NIGHT\n\nThe wall of the cells EXPLODES inward. Jack pulls himself\nout from under rubble. Moonlight spills in through the\ngaping hole created by the cannon ball. Beyond it: freedom.\n\nBut it is centered on the other cell. The part of Jack's\ncell that is gone is too small for a man to slip through.\n\n                       PRISIONER\n          Praise be!\n\nHe and the other two scramble through.\n\n                    PRISONER (CONT'D)\n              (back to Jack)\n          My sympathies, friend - - you've\n          no manner of luck at all!\n\nThe three descend the rocks beyond, disappearing from view.\n\nJack is alone. Cannon fire continues, occasional hits\nshaking the fort. The dog cowers under a long bench, key\nring still in his mouth. Jack sighs -- resigned, he picks\nup the bone from the other cell, and tries coax the dog\nforward.\n\n                    JACK\n          It's all right, doggie ... come\n          here,\n\nboy. Come here, Spot. Rover. Fido?\n\nTo his surprise, the dog crawls out from under the bench.\nJack continues to coax him closer.\n\nThe key ring is nearly within Jack's reach -- suddenly, the\ndog's attention goes to the door into the cell block. He\nBRISTLES, GROWLS. He backs away from the door, whining.\n\n                    JACK (CONT'D)\n          What's the matter, boy?\n\nThe dog bolts, through the bars, into the cell, then out\nthrough the breached wall -- taking the keys with him.\n\nThe door to the cell block bursts open. A pair of pirates\nstep in: KOEHLER and TWIGG.\n\n                    TWIGG\n          This isn't the armory.\n\nHe turns to go, but Koehler has spotted Jack.\n\n                    KOEHLER\n              (Dutch accent)\n          Well, well... Look what we have\n          here, Twigg. It's. Captain\n          Sparrow.\n\n                    TWIGG\n          Huh. Last time I saw you, you were\n          all alone on a God-forsaken\n          island, shrinking into the\n          distance. I'd heard you'd gotten\n          off, but I didn't believe it.\n\n                    KOEHLER\n          Did you sprout little wings and\n          flyaway?\n\n                    TWIGG\n          His fortunes aren't improved much.\n\nThe two laugh. Jack doesn't. He steps forward, close to the\nbars. This puts him in a spill of moonlight. He is tight\nwith fury.\n\n                    JACK\n          Worry about your own fortunes. The\n          lowest circle of hell is reserved\n          for betrayers ... and mutineers.\n\nKoehler and Twigg don't like hearing that. Koehler lashes\nout, grabs Jack by the throat through the bars. Jack\nclutches the pirate's wrist, looks down -\n\nWhere they enter the moonlight, Koehler's wrists and hands\nare skeletal.\n\nJack's eyes go wide -- he is holding a skeleton arm.\n\n                    JACK (CONT' D)\n          You are cursed.\n\nKoehler sneers, shoves Jack backwards, hard. Now out of the\nmoonlight, his hand is normal. Jack stares, realizing -\n\n                    JACK (CONT'D)\n          The stories are true.\n\nKoehler ushers Twigg toward the door. Looks back.\n\n                    KOEHLER\n          You know nothing of hell.\n\nAnd then they're gone.\n\nEXT. PORT ROYAL - NIGHT\n\nAmid the thunder of cannon fire, a longboat slips through\nthe fog. Elizabeth sits in the prow. Columns of water from\ncannon balls geyser up around the boat.\n\nThe fog parts. Elizabeth looks up to see --\n\nThe Black Pearl, a tall galleon, its black sails looming\nhigh above her. At the bow is an ornately carved figurehead\nof a beautiful woman, arm held high, a small bird taking\nwing from her outstretched hand.\n\nThe longboat makes for a pair of lines dangling from a\nwinch.\n\nEXT. BLACK PEARL - MAIN DECK - NIGHT\n\nLit by lanterns; no moon is visible beneath the fog. Smoke\nhangs heavy above the deck.\n\nElizabeth's longboat is raised above the deck rail --\npirates spot her, and stare. One polite fellow steps\n\nforward to offer his hand. She takes it and steps down. She\nhuddles, self-conscious in her nightgown and dressing robe.\n\n                    BOSUN\n          I didn't know we was taking\n          captives.\n\n                    PINTEL\n          She's invoked the right of\n          parlay... with Captain Barbossa.\n\nON THE POOP DECK -- an imposing FIGURE in silhouette stands\nby the wheel, too far away to have heard Pintel's words.\nBut his head turns at the mention of his name.\n\nThe silhouetted figure moves toward the stairs. A cloud of\nSMOKE obscures him -- and then, as if he skipped the\nstairs, he strides out of the SMOKE on the main deck-\n\nThis is BARBOSSA. Despite the bright colors of clothing,\ndefinitely not a man you'd want to meet in a dark alley --\nor anywhere, for that matter.\n\nElizabeth, more terrified than ever, cannot look away from\nhis eyes. But she musters her courage -\n\n                    ELIZABETH\n          I am here to --\n\nThe Bosun SLAPS her.\n\n                    BOSUN\n          You'll speak when spoken to!\n\nHis wrist is grabbed -- painfully -- by Barbossa.\n\n                    BARBOSSA\n          And you'll not lay a hand on those\n          under the protection of parlay!\n\n                       BOSUN\n          Aye, sir.\n\nBarbossa releases him. Turns to Elizabeth, smiles -- it\nshows both silver and gold teeth.\n\n                       BARBOSSA\n\n          My apologies, miss. As you were\n          saying, before you were so rudely\n          interrupted?\n\n                    ELIZABETH\n          Captain Barbossa ... I have come\n          to negotiate the cessation of\n          hostilities against Port Royal.\n\nBarbossa is both impressed and amused.\n\n                    BARBOSSA\n          There was a lot of long words in\n          there, miss, and we're not but\n          humble pirates. What is it you\n          want?\n\n                     ELIZABETH\n          I want you to leave. And never\n          come back.\n\nBarbossa and the pirates laugh.\n\n                    BARBOSSA\n          I am disinclined to acquiesce to\n          your request.\n              (helpfully)\n          Means' No. '\n\n                       ELIZABETH\n          Very well.\n\nShe quickly slips the medallion off, darts to the side\nrail, dangles it over the side of the ship. The pirates go\nquiet.\n\n                    ELIZABETH (CONT'D)\n          I'll drop it!\n\n                    BARBOSSA\n          My holds are bursting with swag.\n          That bit of shine matters to me\n          ... Why?\n\n                    ELIZABETH\n          Because it's what you're searching\n          for. You've been searching for it\n          for years. I recognize this ship.\n\n          I saw it eight years ago, when we\n          made the crossing from England.\n\n                    BARBOSSA\n              (interested)\n          Did you, now?\n\nElizabeth glares at him. She's getting nowhere.\n\n                    ELIZABETH\n          Fine. I suppose if this is\n          worthless, there's no reason to\n          keep it.\n\nShe flips the medallion up, off her finger -\n\n                    BARBOSSA\n          NO!\n\nShe catches it by the chain, smiles at him triumphantly.\n\n                    BARBOSSA (CONT'D)\n          You have a name, missy?\n\n                     ELIZABETH\n          Elizabeth -\n              (stops herself from\n               saying \"Swann\"; then:)\n          Turner.\n              (embroidering)\n          I'm a maid in the governor's\n          household.\n              (curtsies)\n          Barbossa reacts to the name\n          Turner: it confirms what he has\n          suspected. The other pirates\n          surreptitiously exchange glances\n          and nods.\n\n                    BARBOSSA\n          You've got sand, for a maid.\n\n                    ELIZABETH\n              (curtsies again)\n          Thank you, sir.\n\n                    BARBOSSA\n\n          And how does a maid come to own a\n          trinket such as that? A family\n          heirloom, perhaps?\n\n                    ELIZABETH\n          Of course.\n              (offended)\n          I didn't steal it, if that's what\n          you mean.\n\n                    BARBOSSA\n          No, no, nothing like that.\n              (comes to a decision)\n          Very well. You hand that over,\n          we'll put your town to our rudder\n          and ne'er return.\n\n                    ELIZABETH\n          Can I trust you?\n\n                    BARBOSSA\n          It's you who invoked the parlay!\n          Believe me, Miss, you'd best hand\n          it over, now... or these be the\n          last friendly words you'll hear!\n\nElizabeth hesitates, but she has no choice. She holds out\nthe medallion. He grabs it, clutches it in his fist like\nhope.\n\n                    ELIZABETH\n          Our bargain. . ?\n\nBarbossa grins devilishly -- but then nods to the Bosun.\n\n                    BOSUN\n          Still the guns, and stow 'em!\n          Signal the men, set the flags, and\n          make good to clear port!\n\nFor the first time since the attack began, the BOOMING of\nthe guns ceases. Elizabeth is surprised -- and relieved.\nThe pirates hustle to follow orders. Barbossa turns away.\n\n                    ELIZABETH\n          Wait! You must return me to shore!\n          According to the rules of the\n          Order of the Brethren -\n\nBarbossa wheels on her.\n\n                     BARBOSSA\n          First. Your return to shore was\n          not part of our negotiations nor\n          our agreement, and so I 'must' do\n          nothing. Secondly: you must be a\n          pirate for the pirate's code to\n          apply. And you're not. And\n          thirdly...\n\nthe code is more what you'd call guidelines than actual\nrules.\n\n(grins gold and silver)\n\nWelcome aboard the Black Pearl, Miss Turner.\n\nElizabeth stares in speechless terror -\n\nEXT. PORT ROYAL - HARBOR - PRE-DAWN\n\nAs the Black Pearl turns out to sea, Elizabeth is led back\nalong the deck to the captain's cabin.\n\nThe fog starts to dissipate, turning to a light mist;\nthrough it, the Black Pearl makes for the scarlet glow of\ndawn.\n\nEXT. PORT ROYAL - STREET - PRE-DAWN\n\nWill comes to, still where he fell, gets to his feet.\n\nHe takes in the devastation of Port Royal: the harbor is\ndotted with burning and sunken ships; buildings are razed\nand still smolder. The aftermath of hell on earth.\n\nWill turns, and runs for the Governor's Mansion.\n\nINT. GOVERNOR'S MANSION - MORNING\n\nWill races past the smashed doors, into the foyer. Calls\nout:\n\n                    WILL\n          Miss Swann! Elizabeth!\n\nA terrible silence answers him. He spots an overturned\nchair, fallen bookshelf -\n\nINT. FORT CHARLES - NORRINGTON'S OFFICE - MORNING\n\nWill bursts in, still armed with sword and boarding axe.\n\n                     WILL\n          They've taken her! They've taken\n          Elizabeth!\n\nA group stares at him: Swann, Norrington, and Gillette\namong others, gathered around a map. The map is so large it\ndrapes over the Governor's desk, the far end supported by a\nchair.\n\n                    NORRINGTON\n          We're aware of the situation.\n\n                    WILL\n          We have to hunt them down -- and\n          save her!\n\nSwann's worry has made him short-tempered.\n\n                    SWANN\n          Where do you propose we start? If\n          you have any information that\n          concerns my daughter, then share\n          it! If anyone does, tell me!\n              (Will is silent)\n          Leave, Mr. Turner.\n\nMurtogg has remembered something. He ventures it warily:\n\n                    MURTOGG\n          That Jack Sparrow... he talked\n          about the Black Pearl.\n\n                    MULLROY\n          Mentioned it, is more what he did.\n\n                     MURTOGG\n          Still --\n\n                    WILL\n          We can ask him where it is --\n          maybe he can lead us to it!\n\n                     SWANN\n\n          That pirate tried to kill my\n          daughter. We could never trust a\n          word he said!\n\n                    WILL\n          We could strike a bargain -\n\n                    NORRINGTON\n          No. The pirates who invaded   this\n          fort left Sparrow locked in   his\n          cell. Ergo, he is not their   ally,\n          and therefore of no value.\n              (through with Will)\n          We will determine their most\n          likely course, and launch a   search\n          mission that sails with the   tide.\n\nWill slams the boarding axe into the desk, through the map.\n\n                    WILL\n          That's not good enough. This is\n          Elizabeth's life!\n\nNorrington is quick to react; he throws a strong arm across\nWill's back, and guides him roughly to the door.\n\n                    NORRINGTON\n          Mr. Turner, this is not the time\n          for rash actions.\n              (low)\n          Do not make the mistake of\n          thinking you are the only man here\n          who loves Elizabeth.\n              (firm)\n          Now, go home.\n\nHe opens the door, and then turns away. Will watches him\nwalk back to the desk. Will's face sets in resolve, and he\nleaves.\n\nINT. FORT CHARLES - JAIL CELLS - MORNING\n\nJack strains, trying to budge one of the bars. Even with\nthe damage from the cannon ball, it won't move. He hears\nthe sound of the door latch -\n\nThe door opens, and Will slips in. Looks around. Jack\nlounges on the floor of his cell, apparently relaxed and\nunconcerned. Will marches straight up to the bars.\n\n                    WILL\n          Are you familiar with that ship?\n          The Black Pearl?\n\n                      JACK\n          Somewhat.\n\n                    WILL\n          Where does it make berth?\n\n                    JACK\n          Surely you've heard the stories? The\n          Black Pearl sails from the dreaded Isla\n          de Mureta... an island that cannot be\n          found -- except by those who already\n          know where it is.\n\n                    WILL\n          The ship's real enough. So its\n          anchorage must be a real place. Where\n          is it?\n\n                    JACK\n          Why ask me?\n\n                    WILL\n          Because you're a pirate.\n\n                    JACK\n          And you want to turn pirate\n          yourself?\n\n                    WILL\n          Never.\n              (beat)\n          They took Miss Swann.\n\n                    JACK\n              (he was right)\n          So it is that you found a girl. Well,\n          if you're intending to brave all and\n          hasten to her rescue and so win fair\n          lady's heart, you'll have to do it\n          alone. I see no profit in it for me.\n\nWill slams his fist against the bars in frustration. Jack\nis surprised at the outburst. Will thinks ... makes a\ndecision.\n\n                    WILL\n          I can get you out of here.\n\n                    JACK\n          How? The key's run off.\n\n                    WILL\n              (examines the cell)\n          I helped build these cells. Those are\n          hook-and-ring hinges. The proper\n          application of strength, the door'll\n          lift free. Just calls for the right\n          lever and fulcrum. . .\n\nJack watches Will as he speaks, and it dawns on him -- Will\nis the spitting image of someone he's known in the past.\n\n                    JACK\n          Your name is Turner.\n\nWill gives him a puzzled look.\n\n                    WILL\n          Yes. Will Turner.\n\nJack grins.\n\n                    JACK\n          Will Turner...\n              (he stands)\n          I'll tell you what, Mr. Turner. I've\n          changed my mind. You spring me from\n          this cell, and on pain of death, I'll\n          you to the Black Pearl.\n              (sticks out his hand)\n          Do we have an accord?\n\nWill gives him a suspicious look. The deal seems too good.\nJack keeps his hand out, still smiling. Will shakes it.\n\n                    WILL\n          Agreed.\n\n                    JACK\n          Agreed!\n\nWill looks around, figures out   what he needs. He makes a\nchair his fulcrum, and levers   the long bench under the\ndoor. Pushes down -- it's hard   work -- but the cell door\nrises, and then falls forward,   CRASHING down on the bench\nand chair.\n\nJack is impressed. He steps out of the cell.\n\n                    WILL\n          Someone will have heard that.\n          Hurry.\n\nWill heads for the door. Jack searches the desk, cupboards.\n\n                    JACK\n          Not without my effects.\n\n                    WILL\n          We need to go!\n\nJack finds his pistol, sword belt, and compass. Straps on\nthe belt, checks the shot in his pistol.\n\n                    WILL (CONT'D)\n          Why are you bothering with that?\n\n                     JACK\n          My business, Will. As for your business\n          -one question, or there's no use going.\n               (joins Will at the door)\n          This girl -- what does she mean to you?\n          How far are you willing to go to save\n          her?\n\n                    WILL\n              (no hesitation)\n          I'd die for her.\n\n                    JACK\n          Good.\n\nEXT. PORT ROYAL - DOCKS - MORNING\n\nThe Jolly Mon, four inches of water in the bottom, squats\nlow in the water, heeled to one side, creaking on its\nlines.\n\n                    JACK (O.S.)\n          Ah, now there's a lovely sight!\n\nJack hops down into the boat. Prepares to make way.\n\n                    JACK (CONT'D)\n          I knew the Harbormaster wouldn't report\n          her. Honest men are slaves to their\n          conscience, and there's no predicting\n          'em. But you can always trust a\n          dishonest man to stay that way...\n\nJack notices that Will is standing, frozen on the dock,\nstaring at the boat in dismay.\n\n                    JACK (CONT'D)\n          Come aboard.\n\n                    WILL\n          I haven't set foot off dry land I was\n          twelve, when the ship I was on\n          exploded.\n              (regards the boat)\n          It's been a sound policy.\n\n                    JACK\n          No worries there. She's far more\n          likely to rot out from under us.\n\nWill steels himself, steps into the boat as if its going to\ncapsize with the slightest movement. Jack hoists the sail.\n\n                    JACK (CONT'D)\n          Besides, we are about to better\n          our prospects considerably.\n\nHe nods toward the H.M.S. Dauntless, looming in the harbor.\nWill whiteknuckles the gunwales.\n\n                    WILL\n          We're going to steal a ship? That\n          ship?\n\n                    JACK\n          Commandeer. We're going to\n          commandeer a ship. Nautical term.\n\n                    WILL\n          It's still against the law.\n\n                    JACK\n\n          So's breaking a man out of jail. Face\n          it, Will: you may say you'll never be a\n          pirate, but you're off to a rip-roaring\n          start.\n              (smiling)\n          My advice -- smile and enjoy it.\n\nEXT. PORT ROYAL - MORNING\n\nThe Jolly Mon bobs its way across the bay, dwarfed against\nthe H.M.S. Dauntless. Will holds a stay line with iron\nfists.\n\n                     WILL\n          This is either crazy, or\n          brilliant.\n\n                    JACK\n          Remarkable how often those two\n          traits coincide.\n\nThe Jolly Man nears the rudder of the much larger ship -\n\nEXT. H. M. S. DAUNTLESS - MAIN DECK - MORNING\n\nThere's been a breakdown in discipline; about a dozen Navy\nsailors are gathered together on the main deck, playing\ndice. Murtogg and Mullroy among them.\n\nSuddenly, Jack and Will jump out, into the open -\n\nbrandishing pistols.\n\n                    JACK\n          Everybody stay calm. We're taking\n          over the ship!\n\n                    WILL\n              (a beat)\n          Aye! Avast!\n\nJack gives him a look, shakes his head: don't do that.\n\nThe sailors all look   at them -- and then burst out\nLAUGHING. They grin,   shake their heads. Jack stands there,\ngrinning with them --   but his gun is still level. The\nLieutenant, GILLETTE,   steps forward.\n\n                       GILLETTE\n\n          You're serious about this.\n\nJack moves his pistol across, points it at Gillette.\n\n                    JACK\n          Dead serious.\n\n                    GILLETTE\n          You understand this ship cannot be\n          crewed by only two men. You'll never\n          make it out of the bay.\n\n                    JACK\n          We'll see about that.\n\nMore guffaws from the crew. A couple sailors move forward,\nhands on swords -- Gillette holds up a hand.\n\n                    GILLETTE\n          Sir, I'll not see any of my men killed\n          or wounded in this foolish enterprise.\n\n                    JACK\n          Fine by me. We brought you a nice\n          little boat, so you can all get back to\n          shore, safe and sound.\n\n                    GILLETTE\n              (a curt nod)\n          Agreed. You have the momentary\n          advantage, sir. But I will see you\n          smile from the yard arm sir.\n\n                    JACK\n          As likely as not.\n              (calling)\n          Will, short up the anchor, we've\n          got ourselves a ship!\n\nEXT. DAUNTLESS - STERN - MORNING\n\nSailors make their way down a rope ladder, crowd onto the\nJolly Mon. Will pushes hard against the windlass, to no\navail ... the anchor is too heavy for one man. Jack\nnotices.\n\n                    JACK\n          A little help?\n\nGillette shrugs, gestures to Murtogg and Mullroy. The three\nmen throw their weight into the windlass, and it turns.\nJack's pistol is on them the whole time.\n\n                    MURTOGG\n          I can't believe he's doing this.\n\nThe windless turns, bringing Mullroy into view.\n\n                    MULLROY\n          You didn't believe he was telling the\n          truth, either.\n\nThe windless turns some more, and there's Gillette.\n\n                    GILLETTE\n              (over his shoulder, to Will)\n          Do you have any idea, boy, what you're\n          doing?\n\nAnother quarter turn -\n\n                      WILL\n          No.\n\nEXT. DAUNTLESS - FORECASTLE - DAY\n\nJack and Will crank a capstan, raising the forward jib\nsail. It luffs and billows out. The huge ship inches\nforward slowly, pulled by just the one sail. Jack grins.\n\n                    JACK\n          Lookee there, mate! We're\n          underway!\n\nEXT. PORT ROYAL - DOCK - DAY\n\nNorrington moves along, concentrating on a manifest.\nAlongside him is governor Swann, who glances over -\n\nSees the tiny Jolly Mon headed toward them, riding low in\nthe water, overloaded with sailors. Beyond that, the\nDauntless sails -- albeit slowly -- for open waters.\n\n                    SWANN\n          Commodore --\n\n                      NORRINGTON\n          A moment.\n\n                    SWANN\n          But --\n\n                    NORRINGTON\n          Please.\n\n                    SWANN\n          Dammit, man, it appears someone is\n          stealing your ship!\n\nNorrington glances out at the bay. Sure enough, the\nDauntless is on the move. Norrington takes a brass\ntelescope from his belt, opens it, trains it on --\n\nThe main deck. He picks out Will -\n\n                    NORRINGTON\n          Rash, Turner, too rash.\n\n-- then spots Jack, at the wheel. Lowers the telescope.\n\n                    NORRINGTON (CONT'D)\n          That is, without doubt, the worst\n          pirate I have ever seen.\n\nEXT. H . M. S. DAUNTLESS - DAY\n\nOut in the open sea, Jack leans on the wheel, relaxed; not\nmuch sailing to do with a following wind. Will looks back -\n\n                    WILL\n          They're coming!\n\nHe points: the sails of the Interceptor fill out, and the\nship cuts through the water toward them-\n\nEXT. H.M.S. INTERCEPTOR - DAY\n\nNorrington's smaller ship quickly comes alongside the\nslowmoving Dauntless. Its decks appear empty. Grappling\nhooks are thrown, and sailors draw the two ships together.\n\nNorrington's men swarm across.\n\n                    NORRINGTON\n          Search every cabin, every hold,\n          down to the bilges!\n\nPULL BACK, away from the   Dauntless, and past the railing of\nthe Interceptor, where a   single SENTRY stands watch -- and\nwe find a soaked Jack and   Will as they climb up over the\nside of the smaller ship,   unseen.\n\nJack tackles the Sentry from behind, covers hi1rmouth.\n\n                    JACK\n          Can you swim?\n              (the man struggles)\n          Can. You. Swim?\n\nJack removes his hand.\n\n                    SENTRY\n          Of course, sir. Like a fish. I\n          grew up summers living in Dover,\n          with my uncle -\n\n                    JACK\n          Good.\n\nJack lifts the man up, throws him overboard. Quickly unties\nthe ropes to the grappling hooks. Will cranks the capstan\nbars, raising the foresail -\n\nEXT. H . M. S. DAUNTLESS - DAY\n\nNorrington emerges from a gangway -- and sees his other\nship moving away.\n\n                    NORRINGTON\n          Sailors! Back to the Interceptor!\n\nBut the distance is already too great. One brave sailor\ntries to swing across on a rope, Errol-Flynn style, but\nfalls short with a splash.\n\nJack waves, and shouts across the distance -\n\n                    JACK\n          Thank you, Commodore, for getting our\n          ship ready to make way! We'd've had a\n          hard time of it by ourselves!\n\nNorrington seethes, but his order to Gillette is measured:\n\n                    NORRINGTON\n          Raise the sails.\n\n                    GILLETTE\n          The wind is quarter from astern\n          ... by the time we're underway,\n          we'll never catch them.\n\n                    NORRINGTON\n          We need only to come about, to put\n          them in range of the long nines.\n\nGillette looks surprised at the order -- but relays it.\n\n                    GILLETTE\n          Hands! Come about! Jackets off the\n          cannons!\n              (to Norrington)\n          We are to fire on our own ship?\n\n                    NORRINGTON\n          Better to see it at the bottom of the\n          sea than in the hands of a pirate.\n\nThe STEERSMAN turns the wheel. The Dauntless' course does\nnot change one whit.\n\n                    STEERSMAN\n          Captain, there's a problem.\n\nThe Steersman spins the wheel. It goes round and round,\nwith no signs of slowing.\n\n                    STEERSMAN (CONT'D)\n          He's disabled the rudder chain, sir.\n\n                    NORRINGTON\n          So it would seem.\n\nThe Interceptor dwindles with distance. Gillette watches it\ngo, with some degree of admiration.\n\n                    GILLETTE\n          He's got to be the best pirate\n          I've ever seen.\n\nNorrington reaches out, stops the spinning ship's wheel.\n\n                    NORRINGTON\n          So it would seem.\n\nThe Interceptor makes for the horizon line. A SLOW DISSOLVE\nand with the time passage, the ship is gone; the sky turns\na deep twilight blue -\n\nEXT. CARIBBEAN SEA - EVENING\n\n-- with the fat white moon riding just above the horizon.\nSuddenly, the edge of a black sail cuts into the\nforeground, accompanied by the ROAR of the wind and the\nSNAP of canvas -\n\nINT. BLACK PEARL - CAPTAIN'S CABIN - EVENING\n\nElizabeth stalks the cabin. Pintel enters, carrying a black\nsilk dress.\n\n                    PINTEL\n          You'll be dining with the Captain,\n          and he requests you wear this.\n\n                    ELIZABETH\n          Tell the captain that I am disinclined\n          to acquiesce to his request.\n\n                    PINTEL\n              (happy)\n          He said you say that! He also said if\n          that be the case, you'll be dining with\n          the crew, and you'll be naked.\n\nAngry, Elizabeth holds out her hand. Pintel's grin fades.\n\n                    PINTEL (CONT'D)\n              (hands it over)\n          Fine.\n\nHe exits, pouting. Elizabeth examines the dress -\n\nINT. BLACK PEARL - CAPTAIN'S CABIN - NIGHT\n\nBarbossa enters, followed by PIRATES carrying trays of\nfood, wine, table setting, etc. Elizabeth stands at the\nsmall table in the dress -- lovely.\n\n                    BARBOSSA\n          Maid or not, it fits you.\n\n                    ELIZABETH\n\n          Dare I ask the fate of its previous\n          owner?\n\n                    BARBOSSA\n          Now, none of that. Please dig in.\n\nThe table is set. Elizabeth sits, cuts a tiny piece of\nmeat, eats it daintily.\n\n                    BARBOSSA (CONT'D)\n          No need to stand on ceremony, and no\n          call to impress anyone. You must be\n          hungry.\n\nElizabeth drops the pretense: she's starving, and begins to\neat like it. Barbossa watches her intently.\n\n                    BARBOSSA (CONT'D)\n          Try the wine.\n\nElizabeth does, a huge swig; she tears off a hunk of bread,\ndevours it.\n\n                    BARBOSSA (CONT'D)\n          And the apples -- one of those next.\n\nShe starts to bite into the apple -- stops. She is suddenly\naware of Barbossa's gaze -- and that he is not eating.\n\n                    ELIZABETH\n          It's poisoned!\n\nShe shoves her plate away -- and takes the opportunity to\npalm her knife. Barbossa LAUGHS.\n\n                    BARBOSSA\n          Oh, there would be no sense in killing\n          you, Miss Turner.\n\n                    ELIZABETH\n          Then why aren't you eating?\n\n                    BARBOSSA\n          Would that I could.\n\nHe produces the medallion, lets it dangle from his fingers.\n\n                    BARBOSSA (CONT'D)\n\n          Do you not know what this is,\n          then?\n\n                    ELIZABETH\n          It's a pirate medallion.\n\n                    BARBOSSA\n          It's a piece of the treasure of Isla de\n          Muerta .\n\nElizabeth gives an infinitesimal shrug, intrigued despite\nherself.\n\n                    BARBOSSA (CONT 'D)\n          Ah, so you don't know as much as you\n          pretend. Back when Cortes was cutting a\n          great bloody swath through the New\n          World, a high priest gave. him all the\n          gold they had, with one condition: that\n          he spare the people's lives. Of course,\n          Cortes being Cortes, he didn't.\n              (nods)\n          He'd've made a great pirate, that one.\n\nBarbossa stands, moves to a shelf. Puts a key to a medium-\nsized polished wooden box -- the Captain's chest. Opens it.\n\n                    BARBOSSA (CONT'D)\n          So the priest, with his dying breath,\n          called on the power of the blood of his\n          people, and put on the gold a curse. If\n          anyone took so much as a single piece,\n          as he was compelled by greed, by greed\n          he would be consumed.\n\nInside the chest are charts, some gold, a sextant -- and a\n\nfew pages of a Mayan CODEX, pieces of tree bark inscribed\nwith Mayan glyphs. Barbossa removes them carefully, sets\nthem on the table. Pours over them.\n\n                    BARBOSSA (CONT'D)\n          Within a day of leaving port for Spain,\n          the treasure ship carrying the gold ...\n          something went wrong. The ship run\n          aground, every man aboard dead, save\n          one. He survived long enough to hide\n          the gold ashore.\n\n              (beat)\n          Over time, the dark magic of the curse\n          seeped into the place, making it a\n          cursed island. An island of death. Isla\n          de Muerta.\n\nHe looks up. Elizabeth has been rapt, involved in the story\n-but feigns a dismissive attitude.\n\n                    ELIZABETH\n          That's all very interesting, but I\n          hardly believe in ghost stories\n          any more.\n\nBarbossa is angry. He stands, sweeps the food off the\ntable.\n\n                    BARBOSSA\n          You idiot girl! It's no make-\n          believe! My crew and I, we found\n          the gold, and we did more than\n          take one piece, we took it all.\n          Rich men we were and we spent it\n          and traded it and gave it away in\n          exchange\n\nfor drink and food and pleasant company. But we found out:\nthe drink could not sate us, and the food turned to ashes\nin our mouths, and no amount of pleasant company could ease\nour torment.\n\n(regains his composure)\n\nWe are cursed men, Miss Turner,\n\ncondemned, to be forever consumed by our own greed. Gold\ncalls to UB, always, and we are driven, always, to find\nmore, and add it to the treasure.\n\nBarbossa picks up the priceless Codex. Crushes them in his\nfist.\n\n                    BARBOSSA (CONT'D)\n          There is but one way to remove the\n          curse. All of the scattered pieces\n          of the treasure must be restored\n          in full, and the blood repaid.\n\n                 (he throws the pages\n                  aside)\n             We've recovered every piece --\n             save for this.\n                 (holds up the medallion)\n             And as for the blood ... that's\n             what we have you for.\n                 (pleasant, finally\n                  getting to his point)\n             And that's why there's no sense in\n             killing you. Yet.\n\nElizabeth stares at him, horrified. Using the toe of his\nboot, Barbossa flips an apple up off the floor, catches it,\nextends it to Elizabeth.\n\n                       BARBOSSA (CONT'D)\n             Apple?\n\nElizabeth slowly reaches for the apple -- and then comes up\nout of her chair, trying to run around Barbossa_ They\nstruggle briefly, and then suddenly he shoves her away-\n\nElizabeth's stolen KNIFE is buried in Barbossa's chest, to\nthe hilt --\n\nBarbossa is completely unaffected. He opens his shirt to\nget a better look at the knife, pulls it out with little\neffort. There is BLOOD on the blade, but none anywhere\nelse.\n\n                       BARBOSSA (CONT'D)\n             I'm curious -- after killing me,\n             what is it you were planning to do\n             next?\n\nElizabeth backs away, whirls and barrels out the door -\n\nEXT. BLACK PEARL - MAIN DECK - NIGHT\n\n-- Elizabeth comes to dead stop. She stares, her jaw\nworking, trying to scream but unable to -\n\nThe pirate crew works at their stations, coiling lines,\nnavigating the ship, swabbing decks -- but where the\nmoonlight falls across their bodies, they are nauqht but\nSKELETONS. .\n\nElizabeth turns away from the sight -\n\nBarbossa stands just inside the doorway, out of the\nmoonlight. He grabs her roughly by the shoulders and jerks\nher back around -- Elizabeth shuts her eyes -\n\n                    BARBOSSA\n          Look!\n              (shakes her)\n          LOOK! The moonlight shows us for\n          what we really are! We are not\n          among the living and so we cannot\n          die -\n\nHe spins her back around to face him -- he leans forward,\nputting his face in the moonlight, turning it into a\ngleaming SKULL with gold and silver teeth -\n\n                    BARBOSSA (CONT'D)\n          -- but neither are we dead! We\n          have all the desires of the\n          living, but cannot satisfy them!\n          Ten years I have been parched of\n          thirst, and unable to quench it!\n          Ten years, I have been starving to\n          death -- and haven't died!\n              (raises his hand)\n\n                    BARBOSSA (CONT'D)\n          And I have not felt anything for\n          ten years ... Not the wind on my\n          face, nor the spray of the sea ...\n              (reaches toward\n               Elizabeth)\n          ... nor the flesh of a woman ...\n\nElizabeth flinches away from the skeletal hand. It drops\naway -- he takes a bottle of wine from the opened case\nbeside the cabin door, uncorks it with his teeth, raises it\n-\n\n                    BARBOSSA (CONT'D)\n          You'd best start believing in\n          ghost stories, Miss Turner.\n          Because now you're in one.\n\nHe tilts the bottle and drinks -- it runs over his jaw,\nthrough his rib cage, drenching his clothes.\n\nElizabeth darts around him, back into the cabin, and shuts\nthe door. Barbossa hurls the bottle away.\n\nINT. BLACK PEARL - CAPTAIN'S CABIN - NIGHT\n\nElizabeth huddles in the far corner of the cabin,\nterrified.\n\nEXT. CARIBBEAN SEA - DAY\n\nThe Interceptor cuts across the waves. Jack at the wheel;\nWill tightens a line, moves back astern.\n\nEXT. INTERCEPTOR - MAIN DECK - DAY\n\nWill sharpens his sword with a whetstone: shhhk -- shhhk\n...\n\n                    JACK\n          For a man whose made an industry\n          of avoiding boats, you're a quick\n          study.\n\n                     WILL\n          I worked passage   from England as a\n          cabin boy.\n              (an attempt  at guile)\n          After my mother  passed, I came out\n          here ... looking  for my father.\n\n                    JACK\n          Is that so?\n\n                    WILL\n          My father. William Turner?\n\nJack says nothing. Will has lost the patience for guile.\n\n                    WILL ( CONT ' D)\n          I'm not a simpleton. At the jail -\n          - it was only after you learned my\n          name that you agreed to help.\n              (a smile)\n          Since that's what I wanted, I\n          didn't press the matter. But now -\n\n{an accusation}\n\nYou knew my father.\n\nJack considers his reply -- settles on 'truth.'\n\n                    JACK\n          I knew him. Probably one of the\n          few who knew him as William\n          Turner. Most everyone just called\n          him Bill, or 'Bootstrap' Bill.\n\n                    WILL\n          'Bootstrap?'\n\n                    JACK\n          Good man. Good pirate. And clever\n          -\"- I never met anyone with as\n          clever a mind and hands as him.\n          When you were puzzling out that\n          cell door, it was like seeing his\n          twin.\n\n                    WILL\n              (angry)\n          That's not true.\n\n                    JACK\n          I swear, you look just like him.\n\n                    WILL\n          It's not true that my father was a\n          pirate.\n\n                    JACK\n          Figured you wouldn't want to hear\n          it.\n\n                    WILL\n          He was a merchant marine! He was a\n          respectable man who obeyed the\n          law, and followed the rules--\n\n                    JACK\n              (laughs)\n          You think your father is the only\n          man who ever lived the Glasgow\n          life, telling folk one thing, and\n          then going off to do another?\n          There's quite a few who come here,\n          hoping to amass enough swag to\n          ease the burdens of respectable\n\n          life. And they're all 'merchant\n          marines.'\n\n                    WILL\n          My father did not think of my\n          mother -his family -- as a burden.\n\n                    JACK\n          Sure -- because he could always go\n          pirating.\n\n                    WILL\n          My father -- was not -- a pirate!\n\nWill's sword is out, levelled at Jack. Jack gives him a\ndisbelieving look, sighs.\n\n                    JACK\n          Put it away, Will. It's not worth\n          getting beat again.\n\n                    WILL\n          You didn't beat me. You ignored\n          the rules of engagement. In a fair\n          fight, I'd kill you.\n\n                    JACK\n          Then that's not much incentive for\n          me to fight fair, is it?\n\nHe kicks a lever on a wench. The sail boom whips around and\nslams Will in the chest -- sweeping him off the ship. His\nsword clatters onto the deck. Will dangles above the water.\n\nJack slips a loop of rope around the wheel to hold the\ncourse. Picks up the sword -- and pokes at Will with it.\nWill hand-over-hands away from the blade, to the end of the\nboom.\n\n                    JACK ( CONT ' D)\n          As long as you're just hanging\n          there, pay attention. Must,\n          Should, do, don't, shall, shall\n          not -- those are just suggestions.\n          There are only two absolute rules.\n              (ticks them off on his\n               fingers)\n\n                    JACK (CONT'D)\n          What a man can do. And what a man\n          can I t do.\n\nWill looks away, not interested.\n\n                    JACK (CONT'D)\n          For instance: you can accept that\n          your father was a pirate and still\n          a good man... or you can't. Now\n          me, I can sail this ship to\n          Tortuga, by myself. . .\n              (Will looks alarmed)\n          But I can't just let you drown.\n\nJack swings the boom back in. Will drops to the deck. Jack\nholds the hilt of the sword out. Will takes it. Glares at\nJack, considers what he'll do next. Jack watches him\ncoolly.\n\nWill turns and strides to his spot on the deck, sits down,\nand resumes sharpening his sword: shhhk -- shhhk -- shhhk\n...\n\nJack breathes silent sigh of relief. Notices his hand is\nshaking -- he takes the wheel.\n\n                     WILL\n          Tortuga?\n\n                    JACK\n          Oh -- did I forget to mention\n          that?\n\nEXT. TORTUGA - DAY\n\nA dank and dirty port, where the tides seem to have swept\ntogether the scum of the Caribbean -- pirates, privateers,\nprostitutes, thieves, and drunkards.\n\nWith its cantered, rotting docks, weatherbeaten buildings,\nand odd assortment of livestock running free -- a donkey,\nchickens, etc. -- it is far less civilized than Port Royal.\n\nJack and Will move through the crowd. A REDHEADED woman\nturns her head -- she has noticed Jack.\n\n                     JACK\n\n          We need a crew. We can manage the\n          ship between islands, but the open\n          sea, that's another matter -\n\nSuddenly the Redhead SLAPS Jack, hard. Satisfied, she turns\nand strides off. Will ignores her.\n\n                    WILL\n          Just do it quickly.\n\n                    JACK\n              (rubbing his jaw)\n          Don't worry. I've already got my\n          Quartermaster -- there!\n\nJack leads Will toward a pub: the Faithful Bride, the\nemblem over the door a politically incorrect painting of a\nsmiling woman holding a bouquet in her chained-and-manacled\nhands.\n\nJack pulls open the door; Will goes inside passing a pretty\nASIAN women coming out -- she sees Jack and immediately\nSLAPS him, cursing something in Chinese. Jack backs away -\n\nINT. THE FAITHFUL BRIDE - DAY\n\nJack closes the door on the woman, joins Will. They take in\nthe place -- it is populated with a slightly higher class\nof scum. Jack spots a BARTENDER, smiles, moves forward -\n\n--and is suddenly DECKED by a waitress. This is ANAMARIA,\ntall, strong, tough; she didn't spill a drink off her tray.\n\n                    ANAMARIA\n          You stole my boat.\n\n                    JACK\n          AnaMaria! Have you seen Gibbs? I\n          need to put together -\n\nShe SLAPS him again. Will shakes his head, heads for the\nbar. Jack gets up.\n\n                    JACK (CONT'D)\n          Borrowed. Borrowed your boat.\n              (off her look)\n          Without permission.\n\nAnaMaria charges; Jack backs away, puts a table between\nthem. She chases him around the table, still carrying the\ntray.\n\n                    ANAMARIA\n          My dory. The Jolly Mon. Where is\n          it?\n\n                    JACK\n          Safe! At Port Royal. With the\n          Royal Navy.\n\n                    ANAMARIA\n          That boat is my livelihood!\n\n                    JACK\n          You'll get it back. Or one better.\n\n                    ANAMARIA\n              (a threat)\n          I will.\n\nAway from them, a PATRON calls for his food. AnaMaria\nscowls at Jack, moves away -- comes back for. one more\nSLAP!\n\n                    WILL\n          Jack! Over here!\n\nAT THE BAR, Will has spoken to the Bartender. Jack arrives,\nrubbing his chin.\n\n                    WILL (CONT'D)\n          He knows Gibbs.\n\nThe Bartender nods 'yes.' Then nods 'out back.' Then\nproduces a water bucket from behind the bar.\n\nJack and Will exchange a look,-and Jack takes the bucket.\n\nEXT. THE FAITHFUL BRIDE - REAR - DAY\n\nA drunken man lays in the mud, having a friendly\nconversation with two pigs. He wears an old tattered Navy\njacket.\n\nA sudden SPRAY OF WATER splashes across his face,\nrevealing: this is old JOSHAMEE GIBBS (the man who told\n\npirate stories to Elizabeth when she was a child). He\nsputters and roars:\n\n                    GIBBS\n          Curse you for breathing, you\n          slack-jawed idiot\n              (recognizes Jack)\n          Mother's love, Jack, you know\n          better than to wake a man when\n          he's sleeping. It's bad luck!\n\n                    JACK\n          Well, fortunately, I know how to\n          counter it. The man who did the waking\n          buys the man who was sleeping a drink,\n          and the man who was sleeping it drinks\n          it while listening to a proposition.\n\n                    GIBBS\n          Aye, that'll about do it.\n\nJack helps Gibbs to his feet -- and then Gibbs is hit with\na second wave of water. Will stands there with the bucket.\n\n                    GIBBS (CONT'D)\n          Blast it, I'm already awake!\n\n                    WILL\n          I know. That was for the smell.\n\nINT. THE FAITHFUL BRIDE - DAY\n\nJack and Gibbs sit at a table in the shadows, a single\ncandle illumining them, speaking in hushed voices. Will is\naway from them, at the door, hand on sword, keeping a look-\nout.\n\nA tankard is set down. Gibbs lifts it to take a swig -\n\n                    JACK\n          Just the one.\n\nGibbs pauses. He takes a dainty sip.\n\n                    GIBBS\n          Make it_ast, then. Now, what's the\n          nature of this venture of yours?\n\n                    JACK\n\n          First -- have you found me a crew?\n\n                    GIBBS\n          Oh, there's a hard tale, Jack.\n          Most of the decent pirates in town\n          won't sail with you -- seem to\n          think you're a jinx.\n\n                    JACK\n          Now where, I wonder, would they\n          have gotten that idea?\n\nGibbs evades answering by taking a long sip. Jack leans\nforward. Gibbs leans forward.\n\n                    JACK (CONT'D)\n          I'm going after the Black Pearl.\n\nGibbs straightens up like he's been hit. He stares. He\nreaches for the drink as if to down it -- but then sets it\nback down. He leans forwards again. Jack has not moved.\n\n                       GIBBS\n          Say again?\n\n                    JACK\n          Ilm going after the Black Pearl. I\n          know where its going to be, and\n          I'm going to take it.\n\n                     GIBBS\n          Jack, it's a fool's errand: You've\n          heard the tales they tell about\n          the Pearl.\n\n                    JACK\n          Aye, and that's why I know where it's\n          going to be, and that's why I know what\n          Barbossa is up to. All I need is a\n          crew.\n\n                    GIBBS\n              (shakes his head)\n          A fool's errand.\n\n                       JACK\n\n          Not if the fool has something\n          Barbossa wants. Something he\n          needs.\n\n                    GIBBS\n          And you've got that, have you?\n\nANGLE ON: Jack, as he smiles enigmatically, and shifts his\neyes' -- behind him, Will, still on guard, glares a sailor\naway from the table.\n\n                    JACK\n          Back there, guarding the door is\n          the son of old Bootstrap Bill\n          Turner.\n\nGibbs' eyes widen over the edge of the tankard. Peers at\nWill. Then smiles, with more missing teeth than good ones.\n\n                    GIBBS\n          Well, lookee there. I'll allow you\n          may be onto something, Jack.\n              (considers, nods)\n          There's bound to be sailors on\n          this rock crazy as you. I'll find\n          some men.\n\nGibbs downs the drink, SLAMS the tankard on the table.\n\nWill reacts to the sound, draws both sword and dagger,\nkicks over a table for cover, and whirls on anyone who\nmoves.\n\n                    GIBBS (CONT'D)\n          Kid's a bit of a stick, isn't he?\n\n                    JACK\n          That he is.\n\nEXT. TORTUGA - DOCK - LATER - DAY\n\nOn the docks, a disheveled, motley and weatherbeaten group\nof about a dozen swabs stand in a ragged line-up.\n\n                    GIBBS\n          Feast your eyes, Cap'n. All of 'em\n          good sea-faring men, faithful hands\n          before the mast, every one worth his\n          salt --\n\n              (sotto, making his point)\n          -- and crazy, to boot.\n\nJack holds up a hand -- enough. He moves down the line,\nGibbs at his side. Then he notices AnaMaria in line,\ndressed like a man, He raises an eyebrow.\n\n                    ANAMARIA\n          You owe me a boat.\n\nJack nods, continues. One sailor is quite fat, another\nthin and sickly. Jack is not happy with his choices.\n\nHe stops in front of COTTON, a short sailor with a large,\ncolorful PARROT on his shoulder. Jack raises an eyebrow.\n\n                    GIBBS\n          Cotton here is mute, sir. Poor\n          devil had his tongue cut out --\n\nCotton opens his mouth to show this -- Jack grimaces.\n\n                    GIBBS (CONT'D)\n          -- so he went and trained the parrot to\n          do the talking for him, nobody knows\n          how. Nobody knows the parrot's name,\n          neither, so we just call it 'Cotton's\n          parrot.'\n\nJack decides to test this.\n\n                    JACK\n          Mr. Cotton. Do you have the courage\n          and fortitude to follow orders and stay\n          true, in the face danger, and almost\n          certain death?\n\nCotton lifts the parrot off his shoulder, raises it --\n\n                    COTTON'S PARROT\n          Wind in your SAILS! Wind in your SAILS!\n\n                    GIBBS\n          Mostly, that seem to mean 'yes.'\n\nCotton nods vigorously, lowers the parrot, and it goes\nsilent. Jack shakes his head. Steps back.\n\n                    JACK\n\n          That goes for the rest of you!\n          Danger and near certain death.\n              (turns away)\n          For we are to sail for the Isla de\n          Muerta, to rescue the daughter of\n          Governor Swann. An equal share of the\n          reward shall be -\n\nJack hears movement, looks back -- several potential crew\nmembers back away in fright; first one, then another, turn\nand run, followed by more.\n\nSoon just a half dozen are left, including Cotton (with\nparrot) -- and AnaMaria.\n\n                    WILL\n          Shut up, before you lose them all!\n\n                    JACK\n          These are the only ones worth\n          having.\n              (glances at the sky)\n          And we're going to need them-\n\nEXT. H. M. S. INTERCEPTOR - DAY\n\nA FLASH of lightening and the CRACK of thunder. The canvas\nof every sail is stretched taut. The ship rocks as it drops\ninto the valley of huge swell, climbs up the other side.\n\nOn board, the new crew members scurry about their tasks,\npulling lines and trimming sails. Excellent sailors, it\ntakes everything they have to keep the ship afloat.\n\nAnaMaria is at the helm. Gibbs staggers along the deck.\n\n                    GIBBS\n          That fool will have us lose the\n          canvas, and the masts besides!\n\nOn Jack, a ROARING wind blowing back his hair, eyes intent\non their course. Gibbs climbs the tilted deck toward him.\n\n                    GIBBS (CONT'D)\n          Werd best drop canvas, sirl\n\n                    JACK\n          She can hold a bit longer.\n\nThe wind picks up, howling. Jack smiles.\n\n                    GIBBS\n              (shouts)\n          What's in your head to put you in such\n          a fine mood?\n\n                    JACK\n              (shouts)\n          We're catching up!\n\nJack turns back to the sea, enjoying himself. Gibbs stares\nat him like he's a crazy man.'\n\nINT. BLACK PEARL - CAPTAIN'S CABIN - DAY\n\nThe sound of RAIN pounds down on the deck above - - then\nsuddenly stops. Elizabeth moves to the stern windows, looks\nout at the rolling sea below -- no escape there.\n\nShe hears the sound of a VQICE calling, gazes up, wondering\n-\n\nEXT. BLACK PEARL - CROW' S NEST - DAY\n\nHigh on the main mast, Twigg cups his hands to his face, calls\ndown:\n\n                    TWIGG\n          Isla de Muerta! Isla de Muerta,\n          off the port bow!\n\nON DECK, Barbossa moves to the rail. The storm clouds are\nbreaking up. On the horizon is a dark, ominous shape: ISLA DE\nMUERTA. Mostly sheer unfriendly cliffs that shoot straight into\nthe water. It is surrounded by a slate grey sea.\n\nBarbossa grasps the rail with both hands, his expression a\nmixture of loathing and fear. Jacoby approaches, hesitant.\n\n                    JACOBY\n          Orders, Captain?\n\n                    BARBOSSA\n          Bring her in, not too close. I won't\n          brave the reef, not until high tide. We\n          lay anchor before dark.\n\nJacoby nods, backs away. Barbossa continues to stare -\n\n                    BARBOSSA (CONT'D)\n          ... that is, if it first doesn't\n          sink back down to hell from where\n          it came.\n\nEXT. CARIBBEAN SEA - DAY\n\nThe Interceptor, on open waters, glorious, her white sails\nset wing-to-wing.\n\nEXT. H.M.S. INTERCEPTOR - DAY\n\nCLOSE ON: Jack's compass, cradled in both hands. Jack leans\nover and studies it -- almost like he's praying.\n\nON THE COMPASS -- the face shows old-fashioned rose petal\nstyle direction markers below a quivering indicator that\nsettles on -- southeast.\n\n                    JACK\n          Bear three points starboard.\n\nAnaMaria turns the wheel, adjusting course. The ship leans\ninto the new direction. Jack looks down -\n\nON THE COMPASS -- where the indicator spins, reverses,\nsettles on -- northeast.\n\n                    JACK (CONT'D)\n          Six points port!\n\nAnaMaria frowns, but follows the order, turns the wheel\nback, and the ship responds.\n\nWill works on deck, coiling a rope -- but he watches Jack\nand AnaMaria, clearly not happy. Gibbs hobbles up.\n\n                    GIBBS\n          Left handed-ropes are coiled against\n          the sun, or it's bad luck!\n              (twirls a finger)\n          Anty-clockwise.\n\nGibbs takes over the task. The ship shifts course again.\nWill has had enough.\n\n                    WILL\n\n          How do we expect to find an island no\n          one can find -- with a compass that\n          doesn't work?\n\n                    GIBBS\n          Now, lad, just because it don't point\n          north don't mean it don't work.\n              (voice low)\n          That compass gives bearings to the Isla\n          de Muerta, wherever it may lie.\n\n                    WILL\n          Really?\n              (moves closer)\n          So ... what's the story on the\n          pistol?\n\nGibbs settles in, happy to have a willing listener.\n\n                    GIBBS\n          I'll tell lee. Now, Jack Sparrow\n          has an honest streak in him, and\n          that's where the whole problem\n          starts. This was when he was\n          Captain of the Black Pearl -\n\n                    WILL\n          What? He never told me that.\n\n                    GIBBS\n          Ah -- he's learned, then. Plays things\n          more close to the vest. See, Jack was a\n          cartographer, back in Old England.\n          Somehow I he came by the money to\n          commission the Pearl. Hired himself a\n          crew, promised each man an equal share.\n              (lowers his voice)\n          So, they're forty days out, and the\n          First Mate says, everything's an equal\n          share, that should mean the location of\n          the island, too. So Jack gave up the\n          bearings.\n              (shakes his head)\n          That night, there was mutiny.\n\nGibbs voice is a whisper, now, so Will has to lean closer.\n\n                    GIBBS (CONT'D)\n\n          Jack gave hisself up for the sake of\n          his loyal crewmen. He was marooned on\n          an island, left there to die.\n\n                    WILL\n          How did he get off the island?\n\n                    JACK\n              (loud)\n          I didn't!\n\nWill and Gibbs jump. Jack is right there beside them.\n\n                    JACK (CONT'D)\n          My body's still there, rotting\n          away, and I am but a ghost!\n\nWill and Gibbs aren't sure what to make of that. Jack\nlaughs.\n\n                    GIBBS\n          How did you get off the island?\n\n                    JACK\n          Ah, that's a dark and unpleasant\n          tale, best left untold.\n\nHe starts off.\n\n                    WILL\n          Wait -- what about the pistol?\n\n                    JACK\n          The pistol. When a pirate is marooned,\n          Will, he's given a pistol with a single\n          shot. No good for hunting, or\n          surviving, really. But after three\n          weeks of starvation and thirst -- the\n          option of that pistol begins to look\n          good.\n\nJack lets this sink in. He pulls out the pistol, raises it.\n\n                    JACK (CONT'D)\n          But I survived. And I still have\n          that single shot. It's meant for\n          one man. My mutinous first mate -\n\n                    WILL\n\n          Barbossa.\n\nJack shoots a glance at Will -- nods, and moves away.\n\nEXT. ISLA DE MUERTA - CAVE ENTRANCE - EVENING\n\nOn Barbossa, face upturned. No expression in his eyes.\n\nAround him a group of pirates, Elizabeth among them, stand\nas still as stones, in front of a dark cave opening. Their\nfaces look upward, their total lack of movement\ndisconcerting.\n\nAbove the cave, on a hillock, the pirate Koehler gazes out\ntoward the horizon. Slowly he TRANSFORMS, head-to-toe, from\npirate to SKELETON-\n\nThe MOON has climbed free of the storm clouds, rising\nlarge. and full on the horizon. The skeleton turns -\n\n                    KOEHLER\n          Moonrise, Captain! First night of full.\n\n                      BARBOSSA\n          Hah!\n              (to the pirates)\n          Be mindful of pits and crevasses.\n          Stay together.\n\nHe takes a torch. Moves into the cave. The pirates follow.\n\nINT. ISLA DE MUERTE -     CAVES    - NIGHT\n\nThe group keeps together under the firelight. The path\nleads between boulders on a slope downhill. From the echoes\nand shadows, it's clear the cave system must be huge.\n\nElizabeth glances over -- the torches illumine caverns off\nto the side -- and just the edge of a mound of coins.\nClearly there is more, but the rest is lost in darkness.\n\nTwigg, gazing upward in wonder, moves a few feet away from\nthe group. Barbossa grabs him as he nears a chasm.\n\n                    BARBOSSA\n          Careful, mate. Fall down there, you'd\n          die and miss Judgement Day -- for not\n          even the Lord himself'll come look for\n          you here.\n\nBarbossa lets go, and moves on, descending down, twisting\nand turning, but always down -\n\nEXT. H.M.S. INTERCEPTOR - NIGHT\n\nCotton pulls a sail line, looks out -- sees something. He\nlifts the parrot off his shoulder, strokes it along the\nback.\n\n                    COTTON'S PARROT\n          Land HO! Land HO! LAND ho! LAND\n          ho!\n\nIndeed, the faint outline of Isla de Muerta is in the\ndistance on the port side. Will stands, excited, jumps onto\nthe rigging for a better look.\n\nBut AnaMaria, at the helm, stares at Cotton, and the\nparrot.\n\n                    ANAMARIA\n          How does he do that?\n\n                    JACK\n          They'll be anchored on the lee side.\n          Haul your wind, and keep to the weather\n          of the island -\n\nINT. ISLA DE MUERTE - CAVES - NIGHT\n\nFlickering torchlight. Pirates stoop low to enter a cavern\n-\n\n-- and revealed is the spectacular treasure of Isla de\n\nMuerta: overflowing ,chests of coins, gold and silver\ningots, jewelry, objects d' art, jade and ivory, brightly\ncolored silks, furniture, jewels and pearls; mirrors and\nswords -anything and everything of value that might be\ncarried by ship, is here.\n\nThe pirates move through, Elizabeth can't help but gaze in\nwonder.\n\n                    ELIZABETH\n          The curse drove you to gather\n          this?\n\n                    BARBOSSA (O.S.)\n\n          Aye. And not a bit of it any use\n          to us, only hoarded. But it will\n          drive us no longer.\n\nElizabeth pauses, staring at herself in a jewel-encrusted\nmirror -- and then is pushed along by the pirates.\n\nEXT. ISLA DE MUERTE - LAGOON - NIGHT\n\nThe Interceptor lies at anchor in the distance. Closer,\nJack and will row away from the larger vessel in a small\nlongboat, toward the rocky shore.\n\nThe RUSH of a waterfall grows louder. Will looks: ahead of\nthem is a black CAVE MOUTH, right at water level.\n\n                    WILL\n          What's that?\n\n                     JACK\n          Depends.\n\n                     WILL\n          On what?\n\n                    JACK\n          On whether the stories are    all\n          true. If they are, that's    a\n          waterfall that spills over    at high\n          tide, with a short drop to    an\n          underground lagoon. If not    -\n\nBy now, the moving water tugs on the longboat, and they are\nsucked in --\n\n                    JACK (CONT'D)\n          -- well, too late.\n\nThe boat rushes forward, plunges into the darkness -\n\nINT. CAVES - UNDERWATER LAGOON - NIGHT\n\n-- the longboat takes a harrowing drop over a short\nwaterfall ... but then lands safely in a gorgeous\nunderwater lagoon, floats lazily toward a sandy shore.\n\n                    JACK\n          Chalk one up for the stories.\n\nWill leaps out into the water, pulls the boat ashore -\n\nINT. CAVES - BED CAVERN - NIGHT\n\nThe pirate group reaches the end of a small chamber of\nmostly jewels and pearl piled around a large bed -\n\nINT. CAVES - MAIN CAVERN - NIGHT\n\n-- and then emerge into the largest cavern of all, also\ncrammed with treasure, including several mountains of gold\ncoins that reach the ceiling. Treasure everywhere -\n\nExcept for one spot in the center. A hole in the ceiling\nlets in a column of moonlight, which illumines:\n\nA stone chest, lid pushed back, decorated with carved Aztec\nglyphs, filled with gold coins identical to Will's\nmedallion. A sharp stone knife lies on top.\n\nIn front of it, buried in the sand is a skeleton -- and\nthis one doesn't look like it's going to move ever again,\njudging by the sword in its back. A crab scurries away from\nit as the group approaches.\n\n                    BARBOSSA\n          Here we stand before the cursed\n          treasure of Cortez himself. Won by\n          blood, it demands blood in return.\n\nAll eyes turn -- onto Elizabeth. Pintle takes the stone\nknife from the chest, approaches her. Elizabeth shrinks\nback, but is held by two other pirates.\n\nPintel grins. Grabs her by the wrist. She turns her head\naway, shuts her eyes.\n\nPintle raises the knife ...\n\n... and then very carefully, daintily, uses just the sharp\ntip of the knife to just prick! Elizabeth's finger.\n\nOne tiny red drop of blood appears, and drips down onto the\nmedallion.\n\nElizabeth opens her eyes, surprised.\n\n                    PINTEL\n\n             What did you expect? We're all\n             gentlemen here, right and proper.\n\nThe pirates laugh. Barbossa takes the medallion, grins at\nElizabeth.\n\n                       BARBOSSA\n             You know the first thing I'm going\n             to do after the curse is lifted?\n                 (grins)\n             Eat a whole bushel of apples.\n\nBarbossa approaches the chest, shining in the beam of\n\nmoonlight.\n\n                       BARBOSSA (CONT'D)\n             What was begun by blood, let blood\n             now end!\n\nHe tosses the gold medallion onto the others.\n\nThe pirates tense, waiting, expectant. A long beat. They\nall look at each other, look at themselves. Nothing\nhappens.\n\n                       KOEHLER\n             Did it work?\n\n                       DEADEYE\n             I don't feel no different.\n\n                       JACOBY\n             How do we tell?\n\nBarbossa frowns, draws his pistol, and SHOOTS the pirate\nnext to him -- Jacoby -- square in the chest. Jacoby reacts\nin shock, grabs his chest ... but doesn't die.\n\n                       KOEHLER\n             You're not dead.\n\n                       JACOBY\n             No.\n                 (realizes)\n             He shot me!\n\n                       TWIGG\n\n          It didn't work! The curse is still\n          upon us!\n\nBarbossa searches his mind for an answer ... turns to\nElizabeth.\n\n                     BARBOSSA\n          You. Maid. Your father. What was\n          his name?!\n              (grabs her roughly)\n          Was your father William Turner?!\n\nElizabeth takes time to smile before answering:\n\n                    ELIZABETH\n          No.\n\nThe pirates cry out in alarm. Barbossa gathers himself,\ngetting his rage under steely control.\n\n                    BARBOSSA\n          Where's his child? The child that\n          sailed from England eight years\n          ago, the child who is the real\n          owner of that medallion, the child\n          in whose veins flows the blood of\n          William Turner?! Where?\n\nBarbossa SLAPS her hard across the face, sending her\nsprawling.\n\n                    JACOBY\n              (to Pintel)\n          You brought us the wrong person!\n\n                    PINTEL\n          She had the medallion! She's the\n          right age. She said her name was\n          Turner!\n\n                    TWIGG\n              (to Barbossa)\n          You brought us here for nothing?\n\nBarbossa whirls on him --\n\n                    BARBOSSA\n\n          If you had sailed with Morgan for\n          ten years like I have, you'd know\n          not to question me!\n\nElizabeth sits up, watching the pirates argue, for a moment\nunnoticed. Suddenly, a scabbard comes down, right above\nher.\n\nStartled, Elizabeth looks up --\n\n-- Will is at the top of a mound of coins, reaching down\nwith his scabbard for her to grab onto.\n\nElizabeth quickly leans forward, takes the bloodied\nmedallion from the pile. Reaches back, grabs the scabbard.\nWill pulls her up -\n\n                    BARBOSSA (CONT'D)\n          If any coward here dare challenge\n          me, let him speak! Any more talk,\n          I'll chain ye to a cannon and send\n          ye to the watery depths!\n\nA sound catches his attention -- coins falling. He looks\nup, sees Will and Elizabeth at the top of the treasure\nstack.\n\nATOP THE STACK, Will grabs a large shield, flings them\nforward -- the two ride down the mountain of coins on the\nfar side, slide through a small opening -\n\nINT. ISLA DE MUERTE - SMALL CAVERN - NIGHT\n\nBehind them, loose coins from their slide come down in an\navalanche, sealing the entrance.\n\nElizabeth jumps up, silver platter in hand, ready to swing\n-Jack catches her before she can do any damage. They\nrecognize each other.\n\n                    ELIZABETH\n          You?!\n\n                    JACK\n          Me!\n\n                    ELIZABETH\n          You're in league with Barbossa!\n\n                    JACK\n          No, I'm -- rescuing you.\n\nElizabeth can't comprehend that one.\n\n                      ELIZABETH\n          You?!\n\nWill gains his footing in the rubble.\n\n                     WILL\n          Miss Swann! We're here to rescue\n          you!\n               (sounds of pursuit,\n                approaching)\n          It's going badly!\n\n                      JACK\n          This way!\n\nThey race off, toward a bit of moonlight -\n\nEXT. ISLA DE MUERTE - NIGHT\n\nThe three climb up a dark crevasse that leads out onto the\nisland. Will takes Elizabeth's hand, helps her.\n\n                    WILL\n          I'm glad we got here in time.\n\n                    ELIZABETH\n          Truthfully -- you were a bit late.\n\n                    JACK\n          The trick isn't getting here, it's\n          getting away.\n\nAs if on cue, they hear the yells of pirates, coming\ncloser. They take off -\n\nEXT. ISLA DE MUERTE - CLEARING - NIGHT\n\nThe three race through the rocks, the sounds of pursuit\nclose behind. Suddenly Jack stops.\n\n                      ELIZABETH\n          Come on!\n\n                      JACK\n\n          No. This won't work.\n              (a quick decision)\n          I'll stay behind, and fight them.\n          You go on.\n\nWill and Elizabeth stare at him.\n\n                    WILL\n          No.\n\n                    JACK\n          I'll lead them away.\n\nThe sounds are closer.\n\n                    JACK (CONT'D)\n          Go to the opposite end of the\n          island, and signal the ship. I'll\n          keep 'em busy.\n\n                    WILL\n          Are you sure? Jack -- this is not\n          something you have to do.\n\n                    JACK\n          I'm sure. When you've led the kind\n          of life I have, there are debts\n          that must be paid. Maybe I can\n          balance the scales a little.\n\nWill nods, hesitates... gives Jack his sword - - now Jack\nhas two, ..one for each hand. Elizabeth gives him a quick\nkiss.\n\nWill and Elizabeth race away, and are gone.\n\nJack watches them for a moment, turns to face the pirates.\nHe sticks the two swords in the ground, crossed. Leans\ncasually against a rock.\n\nA group of pirates round a corner, cutlasses drawn, ready\nto fight -- but Jack raises his hand.\n\n                    JACK (CONT'D)\n          I invoke the right of parlay,\n          according to the Code of the\n          Brethren, set down by the pirates\n          Morgan and Bartholomew...\n\nEXT. ISLA DE MUERTE - NIGHT\n\nJack stands before Barbossa, surrounded by pirates. Jack\nhas a wide smile on his face -- and Barbossa doesn't like\nit.\n\n                    BARBOSSA\n          I'm inclined to kill you now, Jack\n          Sparrow, without so much as a\n          word, if you don't lose that grin\n          from your face.\n\nJack's smile remains. Barbossa puts a hand to his cutlass -\n\n                    JACK\n          The woman's blood didn't work, did\n          it?\n\nBarbossa hesitates.\n\n                    JACK (CONT'D)\n          I know who's blood you need, to\n          end the curse.\n\n                    BARBOSSA\n          Say the name, or I slit your\n          throat.\n\n                    JACK\n          No you won't.\n\nBarbossa nods. Pintel steps forward, puts a blade to Jack's\nthroat. Jack's smile widens.\n\n                      PINTEL\n          Now?\n\n                      BARBOSSA (NODS)\n          Now.\n              (Pintel grins)\n          No, don't kill him.\n\nSurprised, Pintel lowers his cutlass. Jack's expression\nhasn't changed.\n\n                    BARBOSSA (CONT'D)\n          Allow me the humor of listening to\n          your terms.\n\n                    JACK\n          Simple. I have something you want more\n          than anything. The way to free you from\n          the curse of the treasure. You have\n          something I want -- more than anything.\n\n                     BARBOSSA\n          The Pearl?\n              (laughs)\n          Oh, that's fine. And just how do\n          you expect this to work?\n\n                    JACK\n          You give me the Pearl. Then I tell\n          you who you need.\n\nBarbossa stares at him, incredulous.\n\n                    BARBOSSA\n          That's your offer? You, sailing\n          away nice and pretty with the\n          Black Pearl, and all I have is a\n          name?\n\n                    JACK\n          That's right.\n\n                    BARBOSSA\n          I'm supposed to ... trust you?\n\nThe pirates laugh.\n\n                    JACK\n          I'm a man of my word.\n\nThe pirates laugh louder.\n\n                    JACK (CONT' D)\n          You see, I've got this honest streak in me\n          -- in its own way, a sort of curse. Oh, and\n          there's the fact that you have no choice.\n\n                    BARBOSSA\n          I'll torture it out of you.\n\n                    JACK\n          You left me on a desert island --\n          what worse can you do?\n\nJack is still smiling, intentionally smug now. Barbossa\nsees his options dwindling, begins to pace.\n\n                    BARBOSSA\n          Blast you! I'll throw you in\n          prison.\n\n                    JACK\n          Wait as long as you like.\n\n                    BARBOSSA\n          You're setting me up for a double\n          cross, you with the ship, and me with\n          nothing more than your word!\n\n                    JACK\n          Let's say I tell you the wrong\n          person. What would you do?\n\n                    BARBOSSA\n          Track you down and -\n\nHe sees where Jack is headed.\n\n                    JACK\n          And if I tell you the truth, you become\n          mortal, and you won't come near me\n          because you know I'd kill you.\n\nBarbossa hesitates. The pirates are amazed at how the tide\nhas turned; Barbossa has gone past considering the idea,\nand might even do it.\n\n                    BARBOSSA\n          Jack, I don't trust you, and\n          that's a fact. Never trust a\n          smiling man, you can lay to that.\n\n                    JACK\n          See, that's where we're different.\n          I trust you ... to do what it\n          takes to get what you want.\n\n                    BARBOSSA\n          You're playing this as close to\n          the edge as any man, I'll give you\n          that.\n              (decides, smiles)\n\n             We might just have to sign\n             articles, you and I. Jack, you're\n             a pirate at heart, that's certain.\n\nJack nods.\n\n                       BARBOSSA (CONT'D)\n             Pintel ... set sail. If this fool plan\n             is to work, we'll need the medallion,\n             and that means catching the ship which\n             brought 'em here.\n\nJack is caught completely off guard. For the first time,\nhis smile fades.\n\n                       JACK\n             What -- you don't have the medallion?\n\n                       BARBOSSA\n             That fool woman took it. You be\n             careful around her, Jack -- she's\n             pretty enough, she'll steal your\n             heart -- but pure evil inside.\n\n                       JACK\n             I'll watch my back.\n\n                       BARBOSSA\n             Bosun! Set up Mr. Sparrow's quarters,\n             nice and fine ... in the brig.\n                 (to Jack, a smile)\n             Meaning no disrespect, of course.\n\nJack nods, and is taken away. Barbossa stares after him,\nnot hiding his mistrust.\n\nEXT. INTERCEPTOR - DAY\n\nAt full sail, headed out to sea. Gibbs glances at Elizabeth\nand Will, talking alone on the forecastle -- shakes his\nhead.\n\n                       GIBBS\n             Two women on board? A man don't have to\n             be superstitious to know that's\n             trouble.\n\nElizabeth holds the medallion, and finishes her tale:\n\n                    ELIZABETH\n          ... you were in danger ... so I took\n          the medallion. And I've kept it ever\n          since. They thought I was you, that\n          they needed my blood. And it didn't\n          work.\n\nShe hands him the medallion.\n\n                    WILL\n          Why would my father send this to me?\n\n                    ELIZABETH\n          To keep it away from them? No pirate\n          would sail to London, for fear of\n          Execution Dock.\n\n                    WILL\n          If I had known-\n\n                    ELIZABETH\n              (anticipating him)\n          -- then we never would have met.\n\nWill nods. They hold each other's gaze a moment. Will turns\naway first, leans on the rail. Looks out to sea, back the\ndirection they came.\n\n                    WILL\n          I can't believe he would make such\n          a sacrifice for us.\n\n                    ELIZABETH\n          I guess you can never truly know\n          someone else's heart.\n\nWill glances at her, and nods.\n\nAT THE HELM, Gibbs peers forward, scanning the horizon.\nThere\n\nis a tiny island in front of them.\n\n                    GIBBS\n          Shift your heading, steer clear of that\n          island. Fifteen degrees starboard.\n\nOn the aft deck, Cotton concentrates on his work, securing\na halyard. Suddenly Cotton's parrot flaps its wings, takes\noff, lands on the starboard bulwark, squawking -\n\n                    COTTON'S PARROT\n          Dead men tell NO tales! Dead men tell\n          NO tales! Dead men tell NO tales!\n\nCotton looks up - on the horizon, following: black sails.\nGibbs and AnaMaria appear, and see the ship.\n\n                    ANAMARIA\n          Can we outrun them?\n\n                    GIBBS\n          Not a chance. Make for the reef.\n\nEXT. CARIBBEAN OCEAN - DAY\n\nMiles of blue water. The Interceptor tacks, leaving a long\nwhite wake. The Black Pearl matches it -- gaining.\n\nEXT. BLACK PEARL - DAY\n\nBarbossa and Pintel eye the Interceptor, two hounds chasing\nthe fox.\n\n                    PINTEL\n          What's he doing? Is he going to\n          run her aground?\n\nEXT. INTERCEPTOR - DAY\n\nThe Black Pearl is now close behind the Interceptor -- and\nthe Interceptor is headed for the island.\n\n                    GIBBS\n          Drop the forward anchor!\n\nA SAILOR at the stern of the ship pulls a release, and the\n\nship's anchor races down into the water, the metal chain\n\njumping and twisting on deck.\n\nThe chain stops, and the Sailor locks it -\n\nEXT. CARIBBEAN SEA - DAY\n\nWith its forward momentum and the anchor down, the\nInterceptor to turn quickly, pivoting around the anchor.\n\nEXT. BLACK PEARL - DAY\n\nBarbossa and Pintel watch as the huge ship brings its\ncannons to bear right in front of them.\n\n                    BARBOSSA\n          All hands! Prepare to come about!\n\nBut for now, the Interceptor has the advantage, and takes\nit:\n\nits cannons boom, and cannonballs rain down.\n\nINT. BLACK PEARL - BRIG - DAY\n\nJack sees what he can out the porthole. In the cell with\nhim is Twigg, acting as a guard.\n\n                    JACK\n          Don't hit my ship! I mean, kill\n          the lying scoundrel -\n              (to Twigg)\n          I'm a little conflicted, here.\n\nTwigg just stares.\n\nEXT. INTERCEPTOR - DAY\n\nElizabeth watches  as the Black Pearl comes about -- and\nthen there is the  low, loud RUMBLE of two dozen cannons\nfiring as one. The  Interceptor is hit. A barrage of shots\nfollow; most find  their mark.\n\nSailors dive for cover, leaving their cannons; clearly they\nare overmatched.\n\nEXT. BLACK PEARL - PORT SIDE - DAY\n\nBarbossa laughs.\n\n                    BARBOSSA\n          Strike your colors, you bloody\n          cockroaches!\n\nEXT. INTERCEPTOR - DAY\n\nAnother round of fire; Barbossa shows no mercy.\n\n                    ANAMARIA\n          Looks like they mean to send us under.\n\n                    GIBBS\n          There -- she's raised the Jolly Roger,\n\nupside down.\n\nAnaMaria, Gibbs, Cotton, even Elizabeth -- all know what\nthis means. Will doesn't. He looks to Gibbs for an\nexplanation:\n\n                    GIBBS (CONT 'D)\n          It's a signal. If we resist, it won't\n          just be death. There'll be torture as\n          well.\n\n                    WILL\n          We're not going to just surrender!\n\nGIBBS That we are.\n\nThe Black Pearl fires again, a double-ball shot with a\nchain connecting the two. It hits the main mast dead ani a\nCRACKING, SPLINTING sound as it breaks, falls to the deck.\n\nBarbossa moves his ship alongside, preparing to board.\n\n                    WILL\n          We can at least fight -- we might\n          be able to kill a few-\n\n                    GIBBS\n          Will -- it'll go worse for us -- for\n          Elizabeth, especially -- if we fight.\n\nWill stares -- and nods. But his expression is still\ndefiant.\n\nThe deck slants; the ship is sinking. pirates swarm across\non ropes, and take control of the Interceptor.\n\nEXT. BLACK PEARL - MAIN DECK - DAY\n\nThe top masts of the H.M.S. Interceptor sink into the\nsmooth' crystal waters of the Caribbean -\n\n-- as Will and Elizabeth, held by pirates, are brought\nbefore Barbossa -- and see that Jack stands beside him,\nmanacled.\n\nGibbs, AnaMaria and Cotton and the other crewmembers huddle\ntogether.\n\nBarbossa's wrath falls on Elizabeth.\n\n                    BARBOSSA\n          Welcome back, Miss. Last time on board,\n          you played me right clever, make\n          pretending and all. I hope your stay\n          this time is more pleasant. Boys, show\n          her some hospitality!\n\nHe shoves her into a group of pirates; they yell their\napproval. She is pushed from one to another.\n\nThis goads Will to action. He head-butts the pirate behind\nhim, grabs a pistol, waves it at the pirates.\n\n                    WILL\n          She goes free!\n\nWill leaps onto the ship's rail. He steadies himself with a\nhand on the rigging. Points the pistol at Barbossa.\n\n                    BARBOSSA\n          What's in your head, boy?\n\n                    WILL\n          She. Goes. Free.\n\n                    BARBOSSA\n          You've got one shot -- and we can't\n          die.\n\n                    WILL\n          You can't. I can.\n\nHe leans out over the ocean.\n\n                       ELIZABETH\n          No!\n\nJack pushes forward.\n\n                       JACK\n\n          Will -- don't do anything stupid!\n          Don't say anything stupid -\n\n                    WILL\n          My name is Will Turner, the son of\n          Bootstrap Bill Turner. His blood runs\n          in my veins.\n              (raises the gun to his head)\n          You need my blood. And on my word I\n          will pull this trigger, and sink all\n          the way down to Davy Jones' Locker!\n\nPintel squints at Will; the pirates murmur surprise.\n\n                    TWIGG\n          It's true - he's the spittin' image of\n          old Bootstrap. Even talks the same!\n\nJack drops his head. Barbossa grins at him.\n\n                    BARBOSSA\n          Looks like you're back to having\n          nothing to offer.\n\n                    PINTEL\n          And hers got Old Bill's courage. A\n          curse on him, and you!\n\nBarbossa steps forward.\n\n                    BARBOSSA\n          Enough of that!\n              (to Will)\n          Name your terms.\n\n                    WILL\n          Elizabeth goes free!\n\n                    BARBOSSA\n          We got that part. Anything else?\n\n                    WILL\n          And Jack. And the crew. Free and\n          unharmed. I f you agree... then...\n          I will remain with you.\n\nBarbossa considers; his crew waits. Finally -\n\n                    BARBOSSA\n\n          Agreed. You have my word, as a\n          gentleman of fortune -\n\n                    ELIZABETH\n          Will -- you can't trust him.\n\n                    WILL\n          You must swear by the Holy Bible.\n\n                    BARBOSSA\n          Eh? You have my word, then -- on the\n          Good Book, I do swear, and the Lord\n          spare my worthless soul.\n\nBarbossa crosses himself, as do many of his men.\n\nWill lowers the gun ... steps down -- the pirates surround\nhim. They snatch away the pistol.\n\n                    BARBOSSA (CONT'D)\n          Boatswain! Take your captives\n          belowdecks. Chain them in the galley,\n          and teach 'em how to row.\n\nGibbs, AnaMaria, Cotton and the rest are led away under\nguard. Barbossa looks out to sea, toward the islet.\n\n                    BARBOSSA (CONT'D)\n          Hah. Look there. That's the very\n          same island we made Jack governor\n          of on our last trip.\n              (nods\")\n          When you sail the open sea as long as\n          I, you learn to trust the signs fate\n          sends your way.\n\n                    GIBBS\n              (dejected)\n          Amen to that...\n\n                    BARBOSSA\n          Jack, Elizabeth ... I'm a man of my\n          word and you're to be set free, right\n          quick.\n              (loudly)\n          Men, break out the plank!\n\nA CHEER goes up from the pirates. Will realizes what\nBarbossa intends to do, struggles with his captors.\n\n                    WILL\n          No! You gave your word!\n\n                    BARBOSSA\n          Quiet, boy, or you'll lose your tongue.\n          Those as know me know I wouldn't cross\n          my word, and bring down bad luck on the\n          ship.\n              (nods)\n          I agreed to set them free. I didn't say\n          when. .. nor where.\n\nEXT. CARIBBEAN SEA - DAY\n\nThe Black Pearl lies at anchor, closer now to the islet.\n\nEXT. BLACK PEARL - MAIN DECK - DAY\n\nJack, wrists still bound, stands in the classic 'walking\nthe plank' pose. Elizabeth is next in line. Pirates crowd\nthe ship's rail to watch.\n\n                    JACK\n          It's pure evil to make a Captain walk\n          the plank of his own ship, twice in one\n          lifetime. No good can come of it.\n\n                    BARBOSSA\n          Now, Jack. That reef is less than a\n          league distant. It's a square deal all\n          around, and you can't hope for better.\n\n                    JACK\n          Someone needs to cut these bonds, then.\n\nBarbossa smiles, shows a pistol. Points it at Jack.\n\n                    BARBOSSA\n          You'd best take a swim, Jack.\n\n                    JACK\n          The last time you did this, you\n          left me a pistol, with one shot.\n\nThe pirates mutter agreement.\n\n                    PINTEL\n          That's proper, sir, according to the\n          code.\n\n                    BARBOSSA\n          By the Powers, you're right!\n              ( turns around)\n          Where's Jack's pistol? Who's got\n          it? Bring it forward!\n\n                    JACK\n          A gentleman might give us two pistols,\n          seeing as there are two of us, this\n          time.\n\nA pirate hands Jack's pistol to Barbossa.\n\n                    BARBOSSA\n          Tell you what. I'll   give you one\n          pistol, and let you   be the gentleman,\n          an' shoot the lady,   and starve to death\n          yourself!\n              (grins)\n          That is, presuming   you're not both drownded.\n\nThe pirates laugh. Barbossa tosses Jack the pistol -- but\nover his head, and down into the water with a splash.\n\n                    BARBOSSA (CONTID)\n          So how did you get off that island,\n          anyway?\n\n                    JACK\n          You can go to your grave not knowing.\n\n                    BARBOSSA\n          That's fair.\n\nJack glares at Barbossa. Then he's prodded with a cutlass,\ntakes a step out. Reaches the end of the plank -- steps\noff.\n\nJack plunges down into the water. Appears on the surface,\nfloundering, struggles to stay afloat. Will and Elizabeth\nexchange helpless looks; there is nothing they can do.\n\n                    BARBOSSA (CONT'D)\n\n          The lady's next. But first, I'll be\n          wanting that dress back, if you please.\n\nElizabeth hesitates ... then strips it off, leaving her in\na silk slip. She throws it at him.\n\n                    ELIZABETH\n          Here -- it will go well with your\n          black heart !\n\nBarbossa indicates the plank.\n\n                    ELIZABETH (CONT' D)\n          I will not walk into the ocean.\n          You'll have to throw me in!\n\nBarbossa raises an eyebrow, grins, nods.\n\n                    BARBOSSA\n          Have at her, lads!\n\nThe pirates rush to comply. Lift her up, toss her over the\nrail -- with a scream she falls --\n\nEXT. CARIBBEAN SEA - UNDERWATER - DAY\n\nWe follow Elizabeth amid foam and bubbles as she PLUNGES\ndown\n\nthrough the water. Blue and clear, with streaks of sunlight\ncutting down; bright coral and tropical fish, and a lovely\nyoung woman in a silk dress. .. if it weren't for the\nmortal danger, the scene could be described as gorgeous.\n\nElizabeth spots Jack, below her now, sinking, struggling.\nShe swims down ... unties his bonds.\n\nElizabeth starts for the surface. Inexplicably, Jack swims\nthe other way, further down into the depths.\n\nEXT. CARIBBEAN SEA - DAY\n\nElizabeth breaks the surface, looks around. And then,\nfinally Jack appears, sucking in air. He shows what he went\nafter: his pistol. He tucks it into his shirt.\n\n                    ELIZABETH\n          You went back for that? We need to\n          head for the reef!\n\nShe starts swimming. Jack hesitates. The Black Pearl is\nalready underway; he stares at it.\n\n                    JACK\n          That's the second time I've had to\n          watch that man sail away with my ship.\n\nHe turns away, and swims after Elizabeth.\n\nEXT. ISLET - BEACH - DAY\n\nCLOSE ON: The surf line. Elizabeth's feet leave prints in\nthe sand ... and then meet up with matching footprints she\nmade earlier, going in the same direction. She has walked\nall the way around the island.\n\n                    JACK (O.S.)\n          Not all that big, is it?\n\nJack lays on the beach. He has dismantled his pistol; the\nparts, ball and powder dry on his scarf.\n\n                     ELIZABETH\n          Has it changed since the last time you\n          were here?\n\n                    JACK\n          The trees are taller.\n\nJack checks to see if the pistol parts are dry; they are.\nHe sets about re-assembling and loading his pistol.\n\n                    ELIZABETH\n          I hope you have no intention of using\n          that.\n\nJack has finished putting his pistol back together. He\nshoves it in his belt, walks off.\n\n                    JACK\n          Not yet. Ask me again in a few weeks.\n\nElizabeth can't believe it.\n\n                    ELIZABETH\n          Captain Sparrow! We have to get\n          off this island -- immediately!\n\n                    JACK\n\n          Don't be thinking I'm not already\n          working on it.\n\nHe climbs up toward a clump of palm trees. Digs for\nsomething beneath the sand. He finds it: a large iron ring.\n\n                    ELIZABETH\n          What is that? Is there a boat\n          under there?\n\nJack heaves the trap door up and over, revealing a pit.\nInside are barrels and bottles of rum ... all covered with\ndust and cobwebs, long abandoned. Jack's face falls.\n\n                    ELIZABETH (CONT'D)\n          What? What's wrong? How will this\n          help us get off the island?\n\n                    JACK\n          It won't. It won't, and so we\n          won't.\n\nHe jumps down into the pit, cracks open a bottle of rum,.\ntakes a swig.\n\n                    ELIZABETH\n          But ... you did it before! Last\n          time -\n\n                    JACK\n          Last time, I was here a grand\n          total of three days. Last time,\n          the rumrunners who used this\n          island as a cache came by, and I\n          bartered passage off.\n\n                    JACK (CONT'D)\n          But from the looks of this,\n          they've long been'out of business,\n          and so that won't be happening\n          again.\n              (takes another swig)\n          We probably have your friend\n          Norrington to thank for that.\n\n                    ELIZABETH\n          So that's it? That's the secret\n          grand adventure of the infamous\n\n          Jack Sparrow? You spent three days\n          on the beach drinking rum?\n\n                    JACK\n          Welcome to the Caribbean, love.\n\nHe gathers up a few bottles, heads for the beach.\n\n                    JACK (CONT'D)\n          You should look at our contretemps\n          this way: we've got shade trees,\n          thank the Lord. We've got some\n          food on the trees, thank the Lord\n          again. And we've got rum, praise\n          the Lord. We can stay alive a\n          month, maybe more. Keep a weather\n          eye open for passing ships, and\n          our chances are fair.\n\n                    ELIZABETH\n          A month? Will doesn't have a\n          month! We've got to do something\n          to help him!\n\n                    JACK\n          You're right.\n              (hoists the bottle)\n          Here's luck to you, Will Turner.\n\nHe drinks -- and defiantly returns Elizabeth's angry gaze.\nBut then turns away, sits down.\n\n                    JACK (CONT'D)\n          Don't be thinking I'm happy about\n          this, Elizabeth. But I see no use\n          in wailing and gnashing my teeth\n          over that which I can do nothing\n          about.\n\n                    ELIZABETH\n          Not when you can drink instead, at\n          least.\n\nJack tosses her a bottle.\n\n                    JACK\n\n          Try it. It goes down rough, but it\n          goes down - - and the second swig\n          goes down easier.\n\nElizabeth considers. Comes to a decision. She unseals the\nbottle, takes a swig. They sit in silence for a bit.\n\n                    ELIZABETH\n          And you will call me Miss Swann.\n\nJack toasts her: you got it. Elizabeth studies her\nbottle... gives Jack a sidelong glance. Back to her bottle\n...\n\n                    ELIZABETH (CONT'D)\n              (under her breath)\n          Drink up me hearties, yo ho...\n\n                    JACK\n          What? What was that?\n              (Elizabeth smiles)\n          Something funny, Miss Swann? share.\n          Please,\n\n                    ELIZABETH\n          Nothing ... it's nothing. Just ...\n          I'm reminded of a song I learned\n          as a child. A song about pirates.\n\n                    JACK\n          I know a lot of songs about pirates,\n          but none I'd teach a child. Let's hear\n          it.\n\n                    ELIZABETH\n          Oh, no ... it's silly.   Back in\n          England we didn't know   a thing\n          about pirates, really.   They seemed\n          so romantic and daring   -\n\nJack likes the way that sounds.\n\n                    ELIZABETH (CONT'D)\n              (looks at him)\n          That was before I met one, of\n          course.\n\n                    JACK\n\n          Now I must hear this song. An\n          authentic pirate song. Have at it.\n\n                    ELIZABETH\n          Well, perhaps ... with a bit more\n          to drink, I might ...\n\n                    JACK\n          More to drink!\n\nHe gathers two more bottles, tosses one to her. She drops\nher half-finished bottle to catch it. Opens it, takes a\nsip.\n\n                    JACK (CONT'D)\n          Well?\n\nElizabeth clears her throat, begins to sing self-\nconsciously, becoming stronger as she goes on.\n\n                    ELIZABETH\n          We pillage, we plunder, we rifle,\n          we loot, Drink up me hearties, yo\n          ho.\n\nShe gestures for him to drink. He does.\n\n                    ELIZABETH (CONT'D)\n          We kidnap and ravage and we don't\n          give a hoot, Drink up me hearties,\n          yo ho -\n\nEXT. ISLET - BEACH - LATER - NIGHT\n\nThe middle of the night. A fire BLAZES. Jack and Elizabeth\nare roaring drunk, arm in arm, singing the song all the way\nup to the stars --\n\n                    JACK/ELIZABETH\n          Yo ho, yo ho, a pirate's life for\n          me!\n\nYo ho, yo ho, it's a pirates life for me!\n\n                    JACK\n          I LOVE this song!\n              (sings)\n          Yo ho, yo ho, a pirate's life for\n          me! We're beggars and blighters,\n\n          ne'er do well cads, Drink up me\n          hearties, yo ho!\n              (gives it a touch of\n               Irish ballad)\n          Aye but we're loved by our mums and our\n          dads. Drink up me hearties, yo ho!\n\nThey hoist their bottles, but only Jack drinks. He drains\nthe bottle, then tosses it away.\n\n                    JACK   (CONT'D)\n          When I get the   Black Pearl back, I'm\n          going to teach   it to the whole crew,\n          and we'll sing   it all the time!\n\n                    ELIZABETH\n          You'll be positively the most fearsome\n          pirates to sail the Spanish Main.\n\nElizabeth salutes the idea with her bottle. Jack doesn't\nhave a bottle to salute back. She hands him hers. He\ndrinks, then settles shakily to the ground. Elizabeth sits\nbeside him.\n\n                    JACK\n          Not just the Spanish Main. The whole\n          ocean. .. the whole world. Wherever we\n          want to go, we go. That's what a ship\n          is, you know. Not just a keel and a\n          hull and a deck and sails. That's what\n          a ship need_ ... but what a ship is --\n          what the Black Pearl really-is ... is\n          freedom.\n\nElizabeth lays her head on his shoulder.\n\n                    ELIZABETH\n          Jack, it must be so terrible for you,\n          to be trapped here on this island, all\n          over again.\n\n                    JACK\n          Ah, well... the company is better\n          than last time. And the scenery\n          has definitely improved.\n\n                      ELIZABETH\n              (coy)\n\n          Mr. Sparrow! I'm not sure I've had\n          enough rum to allow that kind of talk.\n\n                    JACK\n          We've got a few bottles left ...\n          and we've yet to tap the kegs.\n\nElizabeth shrugs with a sleight -- but promising -- smile.\nShe picks up the empty bottle from the ground, holds it up.\n\n                    ELIZABETH\n          To freedom.\n\n                    JACK\n          To the Black Pearl.\n\nThey tap the bottles together. Elizabeth feigns a drink as\nhe chugs. He taps his bottle against her again. She laughs,\nfeigns another drink -\n\nEXT. ISLET - BEACH - MORNING\n\nCLOSE ON -- JACK'S FACE, dead asleep, lying in the\nsunlight. His nose twitches. A bit of SMOKE drifts by. His\nnose twitches again. His eyes open.\n\nJack GROANS and sits up. He rubs his head, looks over -\n\n-- all of the foliage in the middle of the island is ON\nFIRE. Smoke rises high up into the clear blue sky.\n\nJack leaps to his feet. He sees Elizabeth, as she pours out\nthe last of the rum, dowsing a scrub brush at the base of a\npalm tree. It goes up in FLAMES. She rolls the barrel\nforward -- it starts to BURN merrily.\n\nJack can't believe his eyes.\n\n                    JACK\n          What are you doing? You've burned\n          our food, the shade -- the rum!\n\n                    ELIZABETH\n          Yes, the rum is gone.\n\nShe wipes her hands together. One of the rum barrels in the\nfire EXPLODES.\n\n                    JACK\n\n          Why?\n\n                    ELIZABETH\n          One, because it is a vile drink that\n          turns even the most respectable men\n          into scoundrels. Two -\n\nShe points to the sky.\n\n                    ELIZABETH (CONT'D)\n          That signal is over a thousand feet\n          high, which means it can be seen for\n          two hundred leagues in every direction.\n          The entire Royal Navy is out to sea\n          looking for me -- do you think there is\n          even a chance they could mass it?\n\n                    JACK\n          You -- you burned up the island, for a\n          one-time chance at being spotted?\n\n                     ELIZABETH\n          Exactly.\n\nElizabeth turns toward the sea.\n\n                    ELIZABETH (CONT'D)\n          Just you wait, Captain. In an hour,\n          maybe two, keep a 'weather eye open'\n          and you'll be seeing white sails on\n          that horizon!\n\nShe sits down, determined. Shields her eyes, scans the\nwater, waiting, searching. Jack is speechless. He throws up\nhis hands, stalks up the sand dune, just to get away from\nher.\n\nEXT. ISLET - LEEWARD SHORE - DAY\n\nAt the crest of the dune, Jack stops -- and stares,\nincredulous. We come around to see what he is looking at -\n\nPast Jack, anchored the other side of the island, white\nsails glorious against the turquoise waters, is the H.M.S.\nDauntless. A longboat is already being rowed toward them.\n\nJack shakes his head.\n\n                     JACK\n\n          They'll be no living with her\n          after this.\n\nEXT. H.M.S. DAUNTLESS - MAIN DECK - DAY\n\nNorrington gives Elizabeth a hand disembarking from the\nraised long boat.\n\n                    NORRINGTON\n          Elizabeth, I'm\" relieved you're\n          safe.\n              (re: Jack)\n          Clap him in irons. And behind his\n          back this time.\n\n                    ELIZABETII\n          Commodore, you can't do that!\n\n                    NORRINGTON\n          You're speaking up for him again?\n\n                    ELIZABETH\n          He can locate Isla de Muerta --\n          but I doubt he'll be willing to\n          help us from the brig.\n\n                    JACK\n              (she's right)\n          We had time to get to know each other.\n\n                    NORRINGTON\n          We are bound for Port Royal, not\n          Isla de Muerta.\n\n                    ELIZABETH\n          No. The pirates have taken Will -\n\n                    NORRINGTON\n          Your father is frantic with worry.\n          Our mission was to rescue you and\n          return home. That is what we shall\n          do. Mr. Turner's fate is\n          regrettable. But so was his\n          decision to engage in piracy.\n\n                    ELIZABETH\n          Commodore, please!\n\n                    JACK\n\n          Norrington, think about it ... the\n          Black Pearl, its captain and\n          crew... the last pirate threat in\n          the Caribbean. How can you pass\n          that up?\n\n                    NORRINGTON\n          By remembering that I serve\n          others, not only myself.\n\n                    ELIZABETH\n          Commodore, I beg you -- please do\n          this ... for me. As a wedding\n          gift.\n\n                    NORRINGTON\n          I am to understand that you will\n          accept my marriage proposal on the\n          condition I rescue Mr. Turner?\n\n                    ELIZABETH\n          Not as a condition -- a request.\n\nNorrington considers. To Gillette:\n\n                    NORRINGTON\n          Free Mister Sparrow, and prepare to\n          come about. He'll give you our heading.\n\nGillette unlocks Jack's manacles. Jack raises an eyebrow.\n\n                    JACK\n          Congratulations, sir.\n\nCrew men lead Jack toward the bridge. Sailors go about\ntheir tasks, and the ship begins its slow turn.\n\n                    NORRINGTON\n          Elizabeth, I hereby withdraw my\n          proposal.\n\n                    ELIZABETH\n          What?\n\n                    NORRINGTON\n          I know now where your heart truly\n          lies.\n\nElizabeth looks at Norrington, seeing him in a new light.\n\n                    ELIZABETH\n          And now I know... where yours\n          does, as well.\n\nThey gaze at each other for a moment. Norrington looks\naway.\n\n                    NORRINGTON\n          You may seclude yourself in my\n          cabin. I'm afraid we do not have\n          any ladies' clothing aboard.\n\n                    ELIZABETH\n          Then I can wear men's clothing.\n\n                    NORRINGTON\n          That would hardly be proper.\n\n                    ELIZABETH\n          Well, I am not going to stay\n          hidden in a some cabin, 80 I\n          suppose it's going to be heaving\n          bosoms and bare ankles for the\n          remainder of the voyage!\n\nNorrington is exasperated, but then can't help but grin -\nthis is exactly why he loves her. She grins back at him -\nshe's not going to change.\n\n                    NORRINGTON\n          Murtogg, take our guest below, and find\n          her some trousers, and a shirt.\n\nElizabeth smiles, allows herself to be escorted away.\nNorrington watches her go ... then turns his gaze to the\nsea.\n\nINT. THE BLACK PEARL - BRIG - DAY\n\nPintel enters the cell. It appears empty -- but that's\nbecause Will is hanging from the rafters, trying to shove\nup the ceiling planks with his legs.\n\n                    PINTEL\n          That ain't going to work. That's the\n          gun deck above yea\n\nWill drops lightly to the deck. Suddenly:\n\n                    WILL\n          What happened to William Turner?\n\n                    PINTEL\n          Ah, William Turner. Stupid blighter. He\n          threw in with us after we relieved Jack\n          Sparrow of his captaincy, but turned\n          out, it never sat well with him-\n          particularly after we found Cortes'\n          treasure, and its peculiar condition.\n          He thought we deserved to be cursed,\n          for leaving ol' Jack to the fate we\n          did. That's why he sent off a piece of\n          the treasure -- to you, as it were: so\n          it would never be recovered, and so\n          cursed we_ remain.\n\n                    WILL\n          And then he ran. And he's hiding out\n          someplace where you haven't been able\n          to find him.\n\n                    PINTEL\n          That's a nice thought, to be sure, and\n          I wager your da wishes he'd thought it\n          hisself. But, no. See, what he'd done,\n          _ didn't sit too well with Captain\n          Barbossa ... so he chained a cannon to\n          his legs and dumped him over.\n\nWill reacts with shock at the account of his father's fate.\n\n                    PINTEL (CONT'D)\n          Yep, last I saw of Bootstrap Bill,\n          was his face looking up, as he\n          sank down to the crushing black\n          oblivion of Davy Jones' locker.\n              (sighs)\n          It was only after, we found out we\n          needed his blood to solve the curse.\n          That's what you call ironic.\n\nBarbossa appears behind Pintel, flanked by several other\npirates. He regards Will for a moment, then:\n\n                       BARBOSSA\n          Bring him.\n\nEXT. H. M.. S.. DAUNTLESS - MAIN DECK - EVENING\n\nJack goes to the rail and waits, pretending to look out at\nthe sea. Elizabeth, dressed in sailor's clothes to\nexcellent effect, joins him.\n\n                    ELIZABETH\n          You didn't tell Commodore Norrington\n          everything.\n\n                    JACK\n          Nor did you, I noticed.\n\n                    ELIZABETH\n          He might delay the rescue ... and\n          that would be too late.\n\n                     JACK\n          Exactly.\n\n                    ELIZABETH\n          These men will be facing an enemy\n          that seemingly cannot be killed.\n\n                     JACK\n          I have a plan. If it succeeds, then any\n          battle will be decidedly brief ... and\n          one-sided.\n\n                    ELIZABETH\n          What's your plan?\n\n                     LOOKOUT (O.S.)\n          LAND HO!\n\nIsla de Muerta lay dark and menacing on the horizon.\n\n                    NORRINGTON\n          Elizabeth -- below decks. I will\n          not compromise your safety..\n\nShe starts to speak; he turns away..\n\n                    NORRINGTON (CONT'D)\n          Lieutenant, escort Elizabeth to my\n          quarters, and make sure she stays\n          there.\n\nNorrington gazes through his spyglass, at the island. Jack\nwatches with some amusement as Elizabeth is escorted away.\n\n                    NORRINGTON (CONT'D)\n          I don't like the situation, mister\n          Sparrow. The island is riddled\n          with caves. I will not put my men\n          at a disadvantage.\n\n                    JACK\n          Funny, I was thinking   along those lines.\n          How about you let me   go in alone, and\n          while you're setting   up an ambush, I'll\n          trick the pirates out   to you.\n\n                    NORRINGTON\n          You would do that?\n\n                    JACK\n          They left me stranded. Twice. What\n          have you got to lose?\n\n                    NORRINGTON\n              (looks at him)\n          Nothing I wouldn't be please to be rid\n          of.\n\n                    JACK\n              (smiles)\n          I knew you'd listen to reason!\n\nEXT. ISLA DE MUERTA - CAVE ENTRANCE - EVENING\n\nTorches are lit. Barbossa leads Will, guarded by Pintel and\na band of pirates, into the caves.\n\nEXT. H.M.S. DAUNTLESS - MAIN DECK - NIGHT\n\nA long boat is prepared to be lowered over the side. Jack\nwraps his pistol securely in an oilskin pouch.\n\n                    JACK\n          That chart I drew up'11 get you\n          past the reefs. If you're\n          steersman's good enough, that is.\n\n                    NORRINGTON\n          I'll be at the wheel myself.\n\n                    JACK\n          I'll slip in, talk them into to come\n          out, and you'll be free to blow holy\n          high heaven the whole lot of them.\n\nThe crewmen release the lines, and the boat drops -\n\nINT. ISLA DE MUERTA - CAVES - NIGHT\n\nThe pirate group moves deeper into the caves. Will moves\nalong unwillingly.\n\n                    PINTEL\n          No reason to fret. It's just a prick of\n          the finger and a few drops of blood.\n\n                     BARBOSSA\n          Turner blood doesn't flow pure in\n          his veins.\n              (grins)\n          Best play it safe, and spill it all.\n\n                    PINTEL\n          I guess there is a reason to fret.\n\nEXT. ISLA DE MUERTE - NIGHT\n\nThe Dauntless drifts into the lagoon. Norrington and his\nmen prepare to go ashore.     h\n\nINT. ISLA DE MUERTA - CAVES - NIGHT\n\nLit by torchlight. Will notices: a crack runs between the\nfloor and the wall of the cave, widening into a ravine.\n\n                    BARBOSSA\n          Careful, now. You could fall in and\n          still be wonder'n when you'll hit dirt.\n\nWill makes a decision. He intentionally stumbles. Pintel\n\nshoves him forward -- Will continues forward, grabs the\npirate in front of him, swings him into the wall of the\ncave. Catches the pirate's torch, and uses it to ward off\nthe others.\n\n                    WILL\n          You deserve to be cursed -- and\n          remain cursed!\n\nHe steps to one side -- and drops into the ravine. The wall\nof the ravine becomes a loose gravel slope; Will hits it,\nand tumbles down, disappears into black.\n\n                    BARBOSSA\n          Blast him! A pox on him, and his\n          father, and the whole damnable\n          line! Fan out! Find him!\n\nINT. DAUNTLESS - CAPTAIN'S QUARTERS - NIGHT\n\nElizabeth looks out the Captain's small porthole -- sees\nboats laden with Navy men headed for shore.\n\nShe turns away from the porthole, wishing there was\nsomething she could do. Suddenly there is a flutter at the\nwindow--\n\nCotton's parrot is there.\n\n                    COTTON'S PARROT\n          Drink UP me hearties yo ho! Drink UP me\n          hearties yo ho!\n\nThe bird flutters off; Elizabeth races to the porthole, and\nthen to the stern window to see it flyaway.\n\nShe looks down -- and there, fastened to the stern of the\nship, is a small rowboat.\n\nINT. ISLA DEMUERTA - CAVES - NIGHT\n\nWill races forward, turning this way and that. He sees a\nlight ahead, heads for it, turns a corner -\n\n-- and runs straight into Jack.\n\n                    JACK\n          Do you have any idea where you're\n          going?\n\n                    WILL\n          Jack!\n\n                    JACK\n          Don't talk. These caves magnify\n          sound. Just follow me.\n\nEXT. ISLA DE MUERTA -       THE BEACH - NIGHT\n\nNorrington and men land on the beach, and spread out. They\nsilently take up positions around the main cave entrance.\n\nINT. CAVES - NIGHT\n\nJack leads Will out of a narrow passage -- and stops,\nstaring. Will is a few steps behind.\n\n                    WILL\n          Are you certain this is the right way?\n\n                    JACK\n          It's the right way.\n\nWill join him -- and see what Jack is staring at:\n\nTreasure piled on treasure, sparkling, glowing, seemingly\n\nendless. At the center is the moonlit clearing, and the\nstone Aztec chest.\n\n                    BARBOSSA\n          Thank you, Jack Sparrow.\n\nThe jump -- Barbossa is standing right behind them, flanked\nby his men. The trio whirl to run - - more pirates emerge\nfrom hiding. Nearly the entire crew of the Black Pearl is\nthere.\n\nThe pirates grab Will and Jack. Will struggles, but Jack\ndoes not fight at all.\n\n                    BARBOSSA (CONT'D)\n          You couldn't have led him back\n          more directly if you knew exactly\n          where you were going.\n\nHe laughs, and moves toward the stone chest. The pirates\nfollow, dragging Will and Jack with them.\n\n                     WILL\n          You did know where you were going!\n          You did lead us directly to them!\n               (Jack's silence confirms it)\n          Why?\n\nJack looks away -- as Will is manhandled toward the chest.\nBarbo8sa steps up to him (becoming skeletal in the\nmoonlight) and puts the medallion around Will's neck.\n\nHe picks up the stone knife.\n\n                    BARBOSSA\n          What was begun by blood, let blood now\n          end!\n\nHe raises the knife to Will's throat -\n\n                    JACK\n          You don't want to be doing that.\n\nBarbossa pretends to think about his words.\n\n                    BARBOSSA\n          No, I really think I do.\n\n                    JACK\n              (shrugs)\n          All right then.\n\nThat makes Barbossa pause. He steps out of the moonlight.\n\n                    BARBOSSA\n          Why don't I want to do this?\n\n                    JACK\n          Because, right about now, the H.M.S.\n          Dauntless is lying in wait in the\n          harbor.\n\n                    WILL\n          Jack!\n\n                    JACK\n          - - and its guns and crew will cut you\n          and your men to pieces the moment you\n          step outside these caves.\n\nA buzz of apprehension sweeps through the pirates.\n\n                    PINTEL\n          Do you believe him?\n\n                    BARBOSSA\n          No.\n              (indicates Will)\n          But him I believe. He is genuinely\n          angry.\n\n                    JACK\n          You've no hope of surviving\n          Norrington's attack ... that is, if\n          you're mortal.\n\n                    BARBOSSA\n          What're you suggesting?\n\nJack shakes off the hands holding him, strolls toward\nBarbossa, Will, and the chest of coins.\n\n                    JACK\n          Simple. Don't kill the boy yet.\n          Wait for a more opportune moment.\n\nWill glares, listening to every word he says. Jack scoops\nup a handful of coins from the chest.\n\n                    JACK (CONT'D)\n              (drops the coins one-by-\n               one back into the chest)\n          Like after you've killed... Every...\n          Last ... One ... of Norrington's men.\n\n                    BARBOSSA\n          I can't help wondering, Jack, why\n          you're being so helpful and all? Last\n          time you did that, it didn't end 80\n          well for you.\n\n                    JACK\n          The situation has changed.\n\n                     BARBOSSA\n          That so?\n\n                    JACK\n          Aye. See, after you're done with the\n          Royal Navy, you'll have a bit of a\n          problem: the H.M.S. Dauntless. There\n          you'll be, with two lovely ships on\n          your hands, and what to do? Of course\n          you'll decide you deserve the bigger\n          one, and who's to argue? The Dauntless\n          a first-rate ship-of-line, and with it,\n          you can rule the seas.\n              (beat)\n\n          But if you're Captain of the Dauntless,\n          who's left for the Black Pearl?\n\nJack smiles and spreads his hands: me.\n\n                     JACK (CONT'D)\n          I sail for you as part of your fleet, I\n          give you fifteen percent of my plunder,\n          and you get to introduce yourself at\n          tea parties and brothels as 'Commodore\n          Barbossa.'\n              (sticks out his hand)\n          Do we have an accord?\n\nBarbossa licks his lips. It's tempting ...\n\n                    JACK (CONT'D)\n          Now, you can take care of the\n          Dauntless, right?\n\n                    BARBOSSA\n          Men! Are you up for it?\n\nThe pirates yell to the affirmative.\n\n                    BARBOSSA (CONT'D)\n          Mr. Pintel, select five men to\n          stay here. Take the rest of the\n          men out ... not through the caves.\n\nJack's expression falters; this he hadn't planned for.\n\n                    JACK\n          There's ... another exit?\n\n                    BARBOSSA\n          Aye, for us there is.\n\nEXT. LAGOON - UNDERWATER - NIGHT\n\nMoonlight shines down into the shallow waters, brightening\ncoral, sparkling over the rippled sand floor.\n\nSuddenly all the fish SCATTER. Briefly, the waters are\nempty.\n\nAnd then FIGURES appear in the distance, seeming to waver\nin the shifting current. They scuffle forward, kicking up\nclouds of sand --\n\nThe figures resolve into the skeleton PIRATES, moving\nsilently across the lagoon floor, swords glinting. The\ntatters of their clothing drift in the water. Their skull\nheads are fixed in an endless grin.\n\nThe LEAD PIRATE glides forward -\n\nAnd stops next to a huge iron ANCHOR -- twice his' height,\neven buried halfway into the sand. A heavy CHAIN with\nbarrel-sized links climbs up toward the surface -\n\nA SHADOW falls across the Lead Pirate -- he TRANSFORMS, and\nwe see that it is Pintel. He looks up -\n\nAbove, the heavy chain leads to the giant bottom hull of\nthe H.M.S. Dauntless, silhouetted by moonlight.\n\nThe huge shift drifts, again spilling moonlight below -\n\nAnd the pirates gathered around the anchor are once again\nSKELETONS, staring with upturned faces. The Pintel-skeleton\nputs a knife between his teeth, starts to crawl up the iron\nrings.\n\nOther pirates crowd forward, and soon the anchor-chain is\nclustered with skeletons -\n\nEXT. LAGOON - NIGHT\n\nElizabeth has the small boat out, and rows away from the\nDauntless, looking ahead over her shoulder. Cotton's parrot\nis nowhere to be seen.\n\nIn the distance, Pintel breaks the surface near the\nDauntless, intent on climbing the anchor; he looks over -\n\nJust as Elizabeth rounds the point, and rocks obscure the\nsmall longboat from view.\n\nMore skeleton-pirates appear, and Pintel continues his\nclimb.\n\nEXT. LAGOON - DAUNTLESS - NIGHT\n\nTwo SAILORS, alert and vigilant, stare out toward shore.\nThe island reveals nothing but blackness.\n\nThere is a scurrying sound -- bones scraping against wood -\nand the sailors JUMP. They listen, intently -- nothing.\n\n                    TALL SAILOR\n          Ship rats. Big ones.\n\n                    SHORT SAILOR\n              (nods)\n          Hate those things.\n\nThey turn back toward the island, continue their vigil. A\nlong pause.\n\n                    SHORT SAILOR (CONT'D)\n          Taste all right, though.\n\n                    TALL SAILOR\n          That they do.\n\nFrom behind, the two sailors at the rail are well-lit by a\nlantern. Suddenly shadows appear, skeletons, climbing up\nthe sailor's backs. -MOVE CLOSER and then the skeletons\nappear, reaching -- the two sailors are grabbed from behind\n-\n\nEXT. DAUNTLESS - SIDE - NIGHT\n\nTwo bodies are tossed out over the rail, hit the water with\na splash.\n\nEXT. DAUNTLESS - SIDE - NIGHT\n\nPintel looks down into the water, satisfied. Puts away his\nknife. Notices, pulls out a long piece of seaweed from his\nrib cage. Tosses it. Turns to the others.\n\n                    PINTEL\n          Be quick, now. Train the starboard guns\n          on the beach, and set your aim. Wait\n          for my signal, we don't want to spook\n          them.\n\nThe pirates hurry to comply -\n\nEXT. LAGOON - BLACK PEARL - NIGHT\n\nElizabeth rounds the point further, and sees: the Black\nPearl, anchored in the neighboring cove. A fleck of color -\nCotton's parrot, as it darts in through a porthole.\n\nElizabeth slows her efforts, silently approaching the ship.\n\nEXT. BLACK PEARL - MAIN DECK - NIGHT\n\nFour PIRATES -- who really ought to be keeping watch -\n\ninstead have gathered wine bottles and rum casts into a\npile, along apples, biscuits -- all the food on the ship.\n\nThey act out a mock-feast, in anticipation of the curse\nbeing lifted. A SKINNY skeleton offers two bottles BIG\nBONED\n\nskeleton.\n\n                      SKINNY\n            Which would you prefer first, good\n            sir -rum, or wine?\n\n                      BIG-BONES\n            I believe I'll have a spot o' rum, if\n            you don't mind, and thank'ee kind sir!\n\nThey burst out laughing -- a hideous sound that wheezes\nthrough their bones.\n\nBehind them, unnoticed, Elizabeth peeks cautiously around a\ncorner. She picks her moment and sneaks past quickly, down\na gangway, disappearing into the blackness of the ship.\n\nEXT. ISLA DE MUERTA - BEACH - NIGHT\n\nGillette crouches, running low behind a line of rocks. He\nreports to Norrington:\n\n                      GILLETTE\n            All the men in place, sir. Ready to\n            fire.\n\n                      NORRINGTON\n            Wait for my order -- what the blazes is\n            that?\n\nIt's the sound of cannon fire -- coming from the Dauntless.\nCannonballs hit the shore; men cry out in anguish.\n\n                      NORRINGTON (CONT'D)\n            Men! Take cover!\n\nThe sailors scramble to find refuge -\n\nINT. ISLA DE MUERTA - MAIN CAVERN - NIGHT\n\nWill, guarded by pirates, glares at Jack.\n\n                    WILL\n          You've been planning this from the\n          beginning. Since you learned my name.\n\nJack takes the opportunity to move toward him.\n\n                    JACK\n          Oh, please -- do I really seem that\n          clever?\n\nBefore Will can answer, Jack smoothly slips the sword from\na Pirate's scabbard -- tosses it to Will, who catches it\ndespite his surprise.\n\n                    JACK (CONT'D)\n          Use it well.\n\nHe draws his own sword -- and clobbers the Pirate. Barbossa\nand the other pirates stare in shock -\n\n                    BARBOSSA\n          Confound it, Jack -- I was\n          actually beginning to like you!\n\nSwords are drawn, and the Pirates attack.\n\nJack and Will take on multiple opponents, each with his own\nstyle: Will parries, glissades and disarms with lightning\nfast and perfect form, while Jack uses his blade, fists,\nacrobatics and anything within reach to survive.\n\nEXT. ISLA DE MUERTA - BEACH - NIGHT\n\nThe sailors charge. The moon emerges from behind a cloud -\n\nSuddenly army of SKELETON PIRATES rise up from the sea, and\ncharge the stunned sailors -- several men are struck down -\n\n                    NORRINGTON\n          Steady, men! Remember -- we're the\n          Navy!\n\nThe sailors recover their nerve, and engage the enemy. It's\na full on battle, Royal Navy against Skeleton Pirates -\n\nThe Navy men are driven back, surrounded -\n\nSuddenly there is a massive BOOM of cannon fire.\nNorrington, in the midst of a swordfight, tries to see -\n\n                    NORRINGTON (CONT'D)\n          What is happening out there?\n\nEXT. LAGOON - NIGHT\n\nIt's the Black Pearl, manned by Gibbs, AnaMaria and Cotton,\nand captained by Elizabeth, coming around the point,\ncannons blazing.\n\nEXT. H.M. S. DAUNTLESS - NIGHT\n\nThe pirates on the ship are caught by surprise, try to turn\ntheir cannons to this new foe -\n\nEXT. ISLA DE MUERTA - BEACH - NIGHT\n\nGillette sees the Black Pearl firing on the Dauntless.\n\n                    GILLETTE\n          They're on our side! Take heart, men!\n\nThe Royal Navy stand their ground and fight -\n\nINT. CAVE - MAIN CHAMBER - NIGHT\n\nOnly two pirates left: Barbossa and Jacoby. Jacoby rounds\non Will; Barbossa faces off against Jack.\n\n                    BARBOSSA\n          Just so you know, Jack -- I don't\n          think you're that clever. I think\n          you're a fool. A mortal fool.\n\n                    JACK\n          Remarkable how often those two\n          traits coincide.\n\nJack drives him back, making Barbossa laugh.\n\n                    BARBOSSA\n          You can't beat me, Jack.\n\nTo prove his point, he drops his own sword -- and catches\nJack's sword with both hands. Jack can't free it. Barbossa\ntwists the sword from Jack's grip, reverses it -\n\n- - AND DRIVES THE SWORD INTO JACK'S CHEST.\n\nWill battling Jacoby, sees it -- he smashes Jacoby in the\njaw, crumpling him\n\n                    WILL\n          Jack!\n\nJack stares down at the sword jutting from his chest. He\ntakes a few steps backward, toward the Aztec gold -- when\nhe steps into the moonlight, JACK BECOME SKELETAL.\n\n                    JACK\n          Well, isn't that interesting.\n\nSkeleton Jack pulls the sword from his chest. He pulls\nsomething from his pocket: one of the Aztec coins.\n\n                    JACK (CONT' D)\n          They're so pretty, I just couldn't\n          resist stealing one. It's a curse,\n          I guess.\n\nBarbossa grabs up his sword, and rushes Jack. Both men are\nin moonlight now, two skeletons in pitched battle.\n\n                    BARBOSSA\n          So what now, Jack Sparrow? Are we\n          to be two immortals, locked in\n          epic battle until the trumpets of\n          Judgment Day?\n\n                    JACK\n          Or you could surrender.\n\nHe shoves Barbossa back, out of the moonlight. Barbossa\nstalks the room, his attention focused on Jack.\n\n                    BARBOSSA\n          Or I could chain you to a\n          cannonball and drop you in the\n          deepest part of the ocean, where\n          you can contemplate your folly\n          forever.\n\nBarbossa charges -\n\nA SHOT RINGS OUT -\n\nJack stands out of the moonlight, flesh and blood again,\nholding his smoking pistol, still aimed at Barbossa.\n\n                     BARBOSSA (CONT'D)\n          Hah. Ten years you carried that\n          pistol, and you end up wasting\n          your shot.\n\n                    WILL\n          He didn't waste it.\n\nWill stands over the Aztec chest, holding a bloody sword,\nhis left hand in a fist. He opens the fist -\n\n-- the medallion, blood covering it, drops from his hand,\nrevealing the cut in his palm.\n\nBarbossa stares, then looks down at his chest. Blood\nblossoms on his shirt around the bullet hole. It spreads\nquickly.\n\nBarbossa clutches his chest, his face registering pain for\nthe first time in years. Barbossa falls heavily to the\nground, dead.\n\nJack blows the smoke from the barrel of his pistol...\ntosses it away.\n\nEXT. ISLA DE MUERTA - BEACH - NIGHT\n\nMurtogg FIRES a pistol at a pirate. The pirate is hit,\nscreams in pain, and crumples to the ground. Mullroy runs\nthrough another with his sword.\n\nThe pirates react to the sight, and quickly realize their\nperil. They set their weapons down in surrender.\n\nEXT. ISLA DE MUERTA - LAGOON - NIGHT\n\nThe Black Pearl comes alongside the Dauntless, and Jack's\ncrew swarm across, overwhelming the pirates.\n\nThe sailors on the beach see it, and CHEER.\n\nINT. ISLA DE MUERTE - CAVE - MAIN CAVERN - NIGHT\n\nWill wraps a cloth around his palm; Jack joins him near the\nchest.\n\n                    WILL\n          Well, you're the worst pirate I've ever\n          heard of.\n              (smiles)\n          You're a man who can be trusted, who\n          can be counted on, and who can It\n          betray his friends. What kind of pirate\n          is that?\n\n                     JACK\n              (admits it)\n          The worst.\n              (beat)\n          On the other hand, maybe I'm a man who\n          can't pass up a chance for revenge\n          against the black-hearted bastard who\n          stole my ship and left me to die in the\n          middle of the ocean -- twice! -- and\n          who knows how to get what he wants. Now\n          that's a great pirate.\n\nJack cuts his palm, grips the coin he stole above the chest\n... and then hesitates.\n\nWill looks at him...\n\nJack releases the coin. It lands in the chest beside the\nother bloody coin.\n\nSuddenly, the lid of the chest, all on its own, SLAMS SHUT.\nElizabeth stares at it.\n\n                    WILL\n          Let's get out of here.\n\nEXT. ISLA DE MUERTA - BEACH - NIGHT - LATER\n\nJack, Will, and Norrington gather together on the beach.\nElizabeth calls out:\n\n                    ELIZABETH\n          You're all right!\n\nThe three men turn as one. An awkward moment -- which of\nthem does she mean?\n\nElizabeth races across the sand, toward them -- and\nstraight to Will. She throws her arms around his neck in a\nhug.\n\n                    WILL\n          Miss Swann -- are you wearing trousers?\n          And how did you get off the island?\n\nElizabeth can't believe that's what he noticed. Indignant,\nshe steps away from him.\n\n                    ELIZABETH\n          Yes, I am wearing trousers. And as for\n          how we got off the island -- ah, that's\n          a grand adventure, but now is not the\n          time to talk about it.\n\nShe reaches a hand behind his neck, decisively kisses him.\n\n                    ELIZABETH (CONT'D)\n          There. And don't you dare tell me\n          that wasn't a proper kiss!\n\n                    WILL\n          Elizabeth, I think it doesn't matter-\n          that we are of a different class -\n\n                    ELIZABETH\n          It doesn't!\n\n                    WILL\n          -- but that was not a proper kiss.\n\nPure consternation on Elizabeth's face -\n\n                    WILL (CONT'D)\n          This is a proper kiss.\n\nWill sweeps her in his arms, leans her back, and kisses her\nlong and well -\n\nJack puts a hand on Norrington's shoulder.\n\n                    JACK\n          Tough luck. I was rooting for you.\n\nEXT. PORT ROYAL - FORT CHARLES - DAY\n\nClose on: Will's face, stoic, staring forward. He stands\nstraight and unmoving. Around him are members of the Royal\nNavy, standing before for a group of witnesses from town.\n\nIt is the courtyard on the top of Fort Charles. A trial is\nunderway -- with Will as the defendant.\n\n                      NORRINGTON\n          ...and though I do say so with\n          regret, the law is clear. The\n          penalty for piracy is death by\n          hanging.\n\nIn the crowd, Elizabeth squeezes the hand of her father,\nSwann. She lets go as Swann stands.\n\n                    SWANN\n          By your leave, I wish to speak on\n          behalf of the boy.\n              (a glance at Elizabeth)\n          It is clear that these deeds were\n          performed out of a sincere desire   to do\n          good, at great personal risk. It   seems\n          to me, that in the rare occasion   where\n          the right course is committing an   act\n          of piracy, then an act of piracy   is the\n          right course!\n              (cheers of approval)\n          So in my capacity as Governor, I   intend\n          to grant a pardon to --\n\n                    GILLETTE\n          Sir!\n\nAll eyes turn. Gillette stands at the top of a stairway.\n\n                    GILLETTE (CONT'D)\n          Jack and his crew have escaped!\n              (gasps from the crowd)\n          There was no damage to the cell ...\n          they must have been set free.\n\nWill and Elizabeth exchange looks. You? Not me, you? No,\nnot me either! Swann notices something the parapet, points\n-\n\n                    SWANN\n          The Black Pearl!\n\nPeople rush to the parapet. Sure enough, below in the bay\nare the distinctive black sails of the Pearl. The ship cuts\nthrough the waters very close to the point -\n\n-- where the gallows of the pirates are. Suddenly Jack\nappears, on the point; he swings off the one empty\ngallows, across and down onto the ship's rigging as it\npasses.\n\n                    GILLETTE\n          Sir! Shall I break out the\n          cannons?\n\n                    NORRINGTON\n          I don't think that will be necessary.\n\nNorrington raises his hand ... twirls a key on his finger.\n\n                    NORRINGTON (CONT'D)\n          A day's head start. That's all he gets.\n\nWill, Elizabeth and Swann look out toward ocean-\n\nEXT. BLACK PEARL - STERN DECK - DAY\n\nJack monkeys down the rigging. AnaMaria is at the wheel.\n\n                    ANAMARIA\n          Captain Sparrow -- the Black Pearl\n          is yours!\n\nJack runs a hand lovingly along the rail, then takes the\nwheel. It feels good -- right -- in his hands. He enjoys\nit, and then shifts to 'Captain' mode.\n\n                    JACK\n          AnaMaria, trim the mainsail!\n\n                    ANAMARIA\n          Aye, aye, sir!\n\n                    JACK\n          Mr. Gibbs, organize a cleaning detail -\n          you and Cotton. I want every inch of\n          the Pearl spic-and-span and ship-shape!\n\nGibbs actually stomps the deck, executes a salute.\n\nJack stands at the wheel: he's got his ship back, and all\nis right with the world. He begins to unconsciously hum:\n\"Yo, ho, yo, ho, a pirate's life for me ...\"\n\nHe realizes what he's doing and smiles, the orchestra takes\nover as the Black Pearl sails for uncharted waters ... and\nwe FADE UP large words in script:\n\n                    THE END\n          FADE OUT and CREDITS ROLL\n\n\n\n\n\nPirates of the Caribbean\nWriters :   Ted Elliot  Terry Rossio\nGenres :   Action  Adventure  Comedy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:33:01.001822"}