{"title": "Pitch Black", "film_link": "/Movie Scripts/Pitch Black Script.html", "script_link": "/scripts/Pitch-Black.html", "info_raw": "\n\nPitch Black Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  David Twohy\nGenres  Horror  Sci-Fi  Thriller\nScript Date : March 1998\n\nRead \"Pitch Black\" Script\n\n\n", "script": "\n\n\n\n   \"Pitch Black\", shooting draft, revised by David Twohy\n\n\n\n   \n\n\n\n\n\n\n\n\n\n                           PITCH BLACK\n\n                           Screenplay\n\n                               by\n\n                           David Twohy\n\n\n               Based on material by Ken and Jim Wheat\n\n\n\n\n\n\n                                             Revised First Draft\n                                             3/3/98\n\n\n\n\n\n\n\n\n     NOTE: THE HARD COPY OF THIS SCRIPT CONTAINED SCENE NUMBERS\n     AND SOME \"OMITTED\" SLUGS. THEY HAVE BEEN REMOVED FOR THIS\n     SOFT COPY.\n\n     NOTE ALSO: THE HARD COPY OF THIS SCRIPT WAS IN THE NON-\n     PREFORMAT FONT \"TIMES NEW ROMAN\". THIS HAS BEEN CHANGED\n     TO PREFORMATTED TEXT FOR THIS SOFT COPY.\n\n\n\n\n\n\n\n\n\nThough mentioned often in the script, the creatures in PITCH BLACK are \nseldom seen at length; rather, they are glimpsed, they are heard, they are \nfelt. They are, really, the embodiment of your nocturnal fears: A howling \ncoyote that jars you awake; the painting on the wall that comes to life\nwhen stared at too long...the sway of your bed just before the earthquake \nhits. Chimera of the night. The point is made so the reader appreciates\nthat the focus of the finished film will not be on what the creatures do, \nbut on what the creatures do to reveal the inner nature of the characters. \nFor PITCH BLACK is, at its heart, a story of humanity and courage -- and \nlack of the same.\n\n\n\n                                                       David Twohy\n\n\n\n\n\n\n\n\n     CUT IN:\n\n     INT. MAIN CABIN\n\n     A CRYO-LOCKER BLOWS OPEN, spitting out...\n\n     CAROLYN FRY. She hits the deck of the main cabin: Four crew\n     lockers in a forward section, countless more in back. But the\n     deck is canted at a sick angle and ALARMS SCREAM everywhere:\n     The world is dying around her.\n\n     Legs wobbly, shivering like a flu victim, Fry stumbles to the\n     next forward locker. It's riddled with holes. One DEAD CREWIE\n     is seen through fractured plexi, body pocked and bloodied. But\n     in the next cryo-locked...\n\n     The CAPTAIN is struggling awake. Fry's face floods with relief.\n     Slapping an intercom:\n\n                              FRY\n               Hear me? Cap'n? Some kinda compromise to\n               the hull...holding for now, but...Goddamn,\n               I'm glad you're alive. Gotta pull your\n               E-release...no, red handle, red handle.\n               I'll get the warm-ups out while --\n\n     PHFUT-PHFUT-PHFUT-PHFUT: Particles bore through the cabin,\n     blasting open the captain's chest, shattering plexi, DETONATING\n     INSTRUMENTS on the opposite wall and leaving CONTRAILS\n     HISSING in the air.\n\n     Fry lands on her ass, horrified. Suddenly...\n\n     Another LOCKER BLOWS OPEN. A body falls right on top of Fry --\n     but this one's still alive. Disoriented, frantic:\n\n                              OWENS\n               Why did I fall on you?\n\n                              FRY\n               He's dead. Cap'n's dead. Christ, I was\n               looking right at him when --\n\n                              OWENS\n               I mean, I mean, chrono shows we're 22\n               weeks out, so gravity wasn't supposed to\n               kick in for another 19. I mean, I mean,\n               I mean, why did I fall at all?\n\n                              FRY\n               You hear me? Captain's dead. Owens too.\n\n                              OWENS\n               Oh, no. Not Owens, not.... Wai', wai',\n               wait. I'm Owens. Right?\n\n     They swap nightmare looks, momentarily unsure of their own\n     identities.\n\n                              FRY\n               Cryo-sleep. Swear to God, it sloughs\n               brain cells.\n\n\n     INT. NAV-BAY - MAIN CABIN\n\n     They stumble into nav-bay. ALARMS CONTINUE. Fry grabs warm-up\n     suits out of storage, pitches one to Owens, checks her screens.\n\n                              FRY\n               1550 millibars, dropping 20 MB per minute,\n               shit, we're hemorrhaging air. Somethin'\n               took a swipe at us.\n\n                              OWENS\n               Just tell me we're still in the shipping\n               lane. Just show me all those stars, all\n               those bright, beautiful, deep-space....\n\n     Owens activates an exterior view: A planet rushes up at us.\n     That's why they have gravity.\n\n                              FRY\n               Jesus God....\n\n\n     EXT. SHIP - PLANET'S ATMOSPHERE - DAY\n\n     The SHIP PLOWS through the upper atmosphere, antennae pylons\n     already disintegrating.\n\n\n     INT. PASSAGE TO FLIGHT DECK\n\n     Heart battering her ribs, Fry runs forward, using hand-holds to\n     steady herself. Over a headset:\n\n                              OWENS (V.O.)\n               They trained you for this, right? Fry?\n               FRY?\n\n     She doesn't answer.\n\n\n     INT. FLIGHT DECK - DAY\n\n     Fry harnesses in, starts running switches -- but fumbles a few\n     times, making mental errors. Finally she gets crash-shutters\n     open to reveal...\n\n     CLOUD STRATA sweeping up past the windscreen like floor-lights\n     on a dropping elevator. We're shedding big altitude.\n\n\n     INT. NAV-BAY - MAIN CABIN\n\n                              OWENS\n               ... crisis program selected Number Two of\n               this system because it shows at least some\n               oxygen and more than 1,500 -- would you\n               SHUT THE FUCK UP!\n                         (hammers a button,\n                          SILENCES ALARMS)\n               -- more than 1,500-millibars of pressure\n               at surface-level. Okay, so maybe the ship\n               did something right for a change....\n\n\n     INT. FLIGHT DECK - DAY\n\n     As Fry runs more switches.\n\n\n     INT. SHIP - DAY\n\n     As JETTISON DOORS CLOSE around the ship.\n\n\n     INT. FLIGHT DECK - DAY\n\n     As Fry flips up a security-latch -- and thumbs the switch below.\n\n\n     EXT. SHIP - PLANET'S ATMOSPHERE - DAY\n\n     MULTIPLE SHOTS: EXPLOSIVE BOLTS RAPID-FIRE around the ship's\n     skin, blowing away non-essentials that hinder aerodynamics --\n     including big deep-space drives. But this last separation puts\n     the ship into a dangerous roll.\n\n\n     INT. FLIGHT DECK - DAY\n\n     Out the windscreen, cloud strata roll vertiginously. Fry throws\n     actuators...\n\n\n     EXT. SHIP - PLANET'S ATMOSPHERE - DAY\n\n     And airbrakes deploy. She manages to kill the roll. But the\n     ship's still coming in nose-high.\n\n\n     INT. NAV-BAY - MAIN CABIN\n\n                              OWENS\n               ...showing no major water bodies...maximum\n               terrain, 220 meters over mean surface...\n               largely cinder and gypsum with some\n               evaporite deposits....\n\n     JETTISON DOORS CLOSE behind Owens, segregating him from the\n     passenger compartment. It scares him for a new reason.\n\n                              OWENS\n               Fry? What're you doing?\n\n\n     INT. FLIGHT DECK - DAY\n\n     Fry flips up a new security-latch. INTERCUTTING:\n\n                              OWENS\n               Fry?\n\n                              FRY\n               Can't get my nose down...too much load\n               back there....\n\n                              OWENS\n               You mean that \"load\" of passengers?\n\n                              FRY\n               So what, we should both go down too?\n               Out of sheer fucking nobility?\n\n     Tortured silence. Fry's thumb moves to the switch that will\n     jettison the passenger cabin. Jettison 50 people.\n\n\n     INT. MAIN CABIN\n\n     SELECTED SHOTS of faces inside cryo-lockers, among them JOHNS.\n     He's prime-of-life, badge on display, some kind of cop. Shaken\n     awake, he clears condensation to check the locker directly across\n     from his, finding...\n\n     RIDDICK. Small black goggles hide his eyes. A metal bit wedged\n     in his mouth lends a perpetual grimace. A read-out admonishes\n     \"LOCK-OUT PROTOCOL IN EFFECT. ABSOLUTELY NO EARLY\n     RELEASE.\"\n\n\n     INT. FLIGHT DECK - DAY\n\n                              OWENS\n               Look, Fry. Company says we're responsible\n               for every one of those --\n\n                              FRY\n               Company's not here, is it?\n\n                              OWENS\n               When captain went down, you stepped up --\n               whether you like it or not. Now they\n               train you for this, so --\n\n                              FRY\n               And there wasn't a simulated cockroach\n               alive within 50 clicks of the simulated\n               crash site! That's how they train you!\n               On a fucking simulator!\n\n     Owens unbuckles from his chair.\n\n                              OWENS\n               Don't touch that switch!\n\n     Overcome by guilt, Fry retracts her thumb of mass destruction.\n     But a HUGE JOLT puts the thumb right back.\n\n                              FRY\n               I'm not dying for them.\n\n     She pushes it. But this time...\n\n\n     EXT. SHIP - PLANET'S ATMOSPHERE - DAY\n\n     No bolts fire. Nothing separates from the SHIP THAT SCREAMS DOWN\n     through the clouds.\n\n\n     INT. NAV-BAY - MAIN CABIN\n\n     Now we see why: Owens reopened the jettison doors locally -- and\n     blocked them open.\n\n                              FRY\n               Owens!\n\n                              OWENS\n               70 seconds! You still got 70 seconds to\n               level this beast out!\n\n\n     INT. FLIGHT DECK - DAY\n\n     Seething anger and guilt, Fry pops more airbrakes, shedding more\n     speed, more heat. The ship does level -- but it's still being\n     pounded hellishly. She tries to get a stable view out...\n\n     The windscreen. We're breaking through cloud-bottoms. There's\n     just a glimpse of landscape before...\n\n\n     EXT. SHIP - PLANET'S ATMOSPHERE - DAY\n\n     An airbrake fails. It shears off and pinwheels into...\n\n\n     INT. FLIGHT DECK - DAY\n\n     The windscreen. It cracks into a thousand spiderwebs -- but\n     impossibly it holds. For now.\n\n                              OWENS (V.O.)\n               What the shit was that?\n\n     Sunlight flares from every fractured edge: It's like looking\n     into burning diamonds, and Fry can only get an impression\n     of the outside world. Now she has to rely on...\n\n     A ground-mapping display. 120 meters altitude. And dropping.\n\n\n     INT. CRYO-LOCKER - DAY\n\n     INTERCUT Johns. Realizing he's in some kind of shit-storm, he\n     claws at safety restraints.\n\n\n     INT. FLIGHT DECK - DAY\n\n     Ground-mapper: 60 meters. COLLISION ALARMS kick in.\n\n     Out the fractured windscreen, we see a huge dark mass rise up\n     into view. Land.\n\n     40 meters...30...20...10....\n\n     Fry braces.\n\n     IMPACT. The WINDSCREENS IMPLODE. AIR HURRICANES in.\n\n\n     INT. NAV-BAY - MAIN CABIN\n\n     IMPACT. Chairs rip from their moorings. Strapped into one,\n     Owens slams into the ceiling.\n\n\n     INT. MAIN CABIN - DAY\n\n     IMPACT. Johns BLOWS OUT of his locker -- and wishes to God he\n     would've stayed inside, because just beside him...\n\n     The hull is cracking open.\n\n     NIGHTMARE SHOT: A huge section of the cabin tears free...\n     skitters and CRASHES along the planetfloor behind us...and\n     disintegrates out of sight. 40 cryo-lockers vanished with it.\n     40 lives.\n\n\n     INT. FLIGHT DECK - DAY\n\n     Hammered by WIND, Fry opens her eyes experimentally.\n\n     FRY'S POV: A vortex of motion, of speed, of blurring debris.\n     But the ship is burrowing in. Burrowing under.\n\n     Fry pivots her chair 180 degrees a nanosecond before...\n     Dirt avalanches into the cockpit. It buries CAMERA.\n\n                                                       BLACKOUT\n\n\n     INT. MAIN CABIN - CRASH SHIP - DAY\n\n     Choking yellow dust. Ghostly silhouettes are COUGHING, MOANING,\n     CALLING OUT to other survivors in English and, surreally, in\n     Arabic. Soon we find...\n\n     Johns. Ears running blood. Stumbling his way to...\n\n     Riddick's cryo-locker. Empty. Johns reaches for his holster.\n     Gone, torn right off his belt. No prisoner and no weapon --\n     spooky combination. Nearby he sees...\n\n     The light of a cutting torch. Someone's using it to open a\n     jammed cryo-locker. The plexi is torched away to reveal...\n\n     AUDREY, 12 years old. Unscathed.\n\n                              AUDREY\n               Somethin' went wrong, huh?\n\n     Johns searches for his pistol. Behind him, two chained feet\n     lower into FRAME -- and then attack, swinging over Johns' head...\n     getting the chain on his neck...twisting hard, using the chain as\n     a choke-collar. Johns flicks open a baton, swings it up at...\n\n     Riddick. Still in body chains and mouth-bit. Clinging to a\n     ceiling support. Riding out the baton blows.\n\n     Seconds from blacking out, Johns strains forward...forward...and\n     finally breaks Riddick's grip on the support. He keeps hold of\n     the chained feet so that...\n\n     Riddick SLAMS HEADFIRST into the deck. Johns lays the baton on\n     his neck.\n\n                              JOHNS\n               One chance and you blew it, Riddick.\n               Never cease to disappoint me.\n\n\n     INT. FLIGHT DECK - CRASH SHIP - DAY\n\n     Darkness. A light beam sweeps the dusty air of the cockpit.\n     It's packed with dirt, no signs of life. About to search\n     elsewhere, Johns turns back at...\n\n                              FRY (O.S.)\n               Hey.\n\n                              JOHNS\n               Hey, who?\n\n                              FRY (O.S.)\n               Hey, me. Over here.\n\n     His light finds a headrest sticking up from the dirt. Johns\n     crawls closer, checks the other side of the headrest and finds\n     her. Fry. Buried to the gills.\n\n                              JOHNS\n               Amazing. I'm Johns.\n\n                              FRY\n               Carolyn Fry. I'd shake hands, but...\n\n     He manages a smile and starts digging her out. Almost dreading\n     to ask:\n\n                              FRY\n               Are there any others, Johns?\n\n\n     INT. MAIN CABIN - CRASH SHIP - DAY\n\n     Johns helps Fry through the carnage. She's stunned by it all --\n     but especially by the blast of sunlight where a hull used to be.\n\n     Realizing she's in nav-bay, Fry starts digging like a search dog\n     to uncover...\n\n     Owens. Still strapped to his chair. Metal rod piercing his\n     chest close to the heart. Dead. Fry reaches out to touch him.\n\n                              OWENS\n               Out, out, out, GET IT OUTTA ME!\n\n     She recoils hard. He's still alive. The other survivors bungle\n     over. Ten seconds of pure chaos:\n\n                              VOICES\n               Pull it out of him...No, it's too close to\n               the heart...You gotta do it, just do it\n               fast....\n\n     Fry grabs the rod.\n\n                              OWENS\n               Don't touch it! Don't touch that switch!\n\n                              VOICES\n               You'll kill him, I'm tellin' you, shit,\n               just leave it alone...delirious...doncha\n               you got some drugs for this poor man....\n\n                              OWENS\n               Don't touch that switch!\n\n                              FRY\n               Awright, awright, someone...there's\n               Anestaphine in the med-lock, that end of\n               the cabin...next to....\n\n     But there is no more \"that end.\" In exquisite pain, Owens\n     screams on. REACTION SHOTS of Johns, Audrey. Seldom are human\n     beings witness to such raw suffering.\n\n                              FRY\n               Get away. Everybody.\n\n     The others leave -- except for Audrey, staying behind to watch\n     in morbid fascination. Johns doubles back and collars her.\n     Leaving, they pass...\n\n     Riddick, cuffed to a bulkhead. His eyes, still hidden by\n     goggles, track Johns and Audrey toward daylight.\n\n\n     EXT. CRASH SHIP - DAY\n\n     The survivors straggle outside. CAMERA SURVEYS new faces:\n\n     ZEKE and SHAZZA. Male-female team of bushwhackers, partners in\n     life. Shazza has a tough sexiness. Zeke's face shows aboriginal\n     blood. (30s.)\n\n     PARIS. Overfed, overgroomed. A puff pastry of a man. (40s or\n     50s.)\n\n     Four male \"Chrislams\": The pillar-steady IMAM (50ish), and\n     THREE PILGRIMS, young and excitable (late-teens). (NOTE: The\n     Chrislams represent a union between Christianity and Islam. They\n     have the iconography of Christians yet the physical look of Arab\n     Muslims.)\n\n     WIDE SHOT: All around them is stark and unforgiving terrain.\n     The valley floor is relieved only by low hills to one side,\n     spiked with earthen spires. Scorching down on everything are\n     two suns -- one red, one yellow.\n\n                              PARIS\n               Well. Our own little slice of heaven.\n\n     The Chrislams fall to their knees. Confusion as they try to\n     orient themselves.\n\n                              IMAM\n               Please...which way to New Mecca? We must\n               know the direction in order to pray.\n\n     North? South? East? West? Nobody knows. Johns snaps open a\n     compass, finds the needle swaying rudderlessly. The SCREAMING\n     inside the ship finally ends.\n\n\n     INT. CRASH SHIP - DAY\n\n     As Fry holds Owens, now dead.\n\n\n     EXT. CRASH SHIP - DAY\n\n     The four Chrislams have devised a way to pray: Backs together,\n     each faces a different compass point.\n\n\n     EXT. TOP OF CRASH SHIP - DAY\n\n     Fry climbs onto the back of the ship. Johns Paris, Zeke, Shazza,\n     Audrey are already here.\n\n                              JOHNS\n               Big talk about a scouting party...\n\n     Fry sees the huge smoldering scar in the ground behind the ship.\n     One glance confirms that there are no other survivors.\n\n                              JOHNS (CONT'D)\n               ...then we saw this.\n\n                              PARIS\n               Anyone else having breathing problems?\n               Aside from me?\n\n                              AUDREY\n               Like I just ran, or something....\n\n                              SHAZZA\n               Feel one lung short. All of us.\n\n                              PARIS\n               Well, I tend toward the asthmatic. And\n               with all this dust....\n\n     Faces turn to Fry: They're looking to her for answers.\n\n                              FRY\n               It's the atmosphere. Too much pressure,\n               not enough oxygen. Might take a few days\n               to --\n\n                              ZEKE\n               So what the bloody hell happened, anyways?\n\n                              FRY\n               Somethin' knocked us off-lane. Maybe a\n               rogue comet. Maybe we'll never know.\n\n                              SHAZZA\n               Well, I for one, am thoroughly fucking\n               grateful. This beast wasn't made to land\n               like this. But cripes, you rode it down.\n                         (to others)\n               C'mon, you lousy ingrates, only reason\n               we're alive is a'cuzza her.\n\n     Others CHIME AGREEMENT, laying thankful hands on Fry's shoulders.\n     HOLD on Fry, her face betraying nothing as they anoint her their\n     savior.\n\n\n     INT. MAIN CABIN - CRASH SHIP - DAY\n\n     Breaking out pressure suits:\n\n                              FRY\n               Liquid oxygen canisters inside. Start\n               ripping them out. Quick hits only -- try\n               to make it last.\n\n                              AUDREY\n               Well, is someone coming for us? Or are\n               we all just gonna die of exposure or\n               dehydration or sunstroke or maybe even\n               something worse?\n                         (off their looks)\n               Hey, you don't have to worry about scaring\n               me.\n\n                              SHAZZA\n               We're worried you'll scare us.\n                         (ushering her away)\n               Name's \"Audrey,\" right, love? And you're\n               goin' to Taurus Three like we were?\n\n                              AUDREY\n               Yeah, but...do we even have enough food\n               to get there? Or will we have to resort\n               to cannibalism?\n\n                              ZEKE\n                         (to Fry)\n               I'll see 'bout makin' this air go a bit\n               further, cap'n. With your permission,\n               a' course.\n\n     Fry blinks. \"They actually think I'm the captain.\" Zeke and the\n     others get to work. Fry finds herself staring at another\n     problem. Riddick.\n\n                              FRY\n               And him?\n\n                              JOHNS\n               Big Evil?\n\n                              FRY\n               We just keep him locked up forever?\n\n                              JOHNS\n               Be my choice. Already escaped once from\n               the max-slam facility on --\n\n                              FRY\n               I don't need his life story. Is he really\n               that dangerous?\n\n                              JOHNS\n               Only around humans.\n\n     Riddick has his mouth on the hull, virtually licking the metal.\n     Fry moves closer -- and now sees it sheeting down the hull.\n\n                              FRY\n               Oh, Christ....\n\n     They're losing water. Suddenly Fry is running, snatching up an\n     emergency light, climbing wall-rungs...\n\n\n     INT. MACHINE LEVEL - CRASH SHIP - DAY\n\n     And crawling through dusty superstructure to reach the water\n     cistern. She opens a crank-hatch -- and finds light invading the\n     interior. Her face dies.\n\n                              ZEKE (V.O.)\n                         (shouting)\n               Well? Is it just the pump?\n\n                              FRY\n               Ask if anyone has anything in cargo!\n               Anything to drink!\n\n\n     INT. CARGO HOLD - DAY\n\n     Oversize DOORS RUMBLE open. Fry, Johns, and Paris climb into\n     this dark corridor lined with cargo containers. Each container\n     has an access door.\n\n                              PARIS\n               Mine here....\n\n     As Paris unlocks, Johns steadies himself, suddenly light-headed.\n\n                              FRY\n               S'matter?\n\n                              JOHNS\n               Little swamp-flu from the Conga system.\n               Never shook it with all this cryo-sleep.\n\n     Paris opens his container to reveal...\n\n\n     INT. PARIS' CONTAINER - CARGO HOLD - DAY\n\n     Tiffany chairs stacked 10 high. Bronze eagle lecterns. Oriental\n     umbrellas. Neo-Egyptian castings.\n\n                              JOHNS\n               King Tut's tomb....\n\n                              PARIS\n               Be surprised what these will fetch in the\n               Taurus system. Here. This Wooten here --\n               easy, easy. Very rare.\n\n     They open the Wooten desk. Cubbyholed inside are dusty bottles\n     of sherry. Vintage Port. Glenfiddich. Bicardi 151.\n\n                              FRY\n               This is it? Booze? That's what you have\n               to drink?\n\n                              PARIS\n                         (educating her)\n               200-year-old single-malt scotch is to\n               \"booze\" as foie gras is to \"duck guts.\"\n\n                              JOHNS\n                         (cracking a bottle)\n               A toast to whatever he just said.\n\n                              PARIS\n               I'll need a receipt for that.\n                         (to Fry)\n               For all these.\n\n                              FRY\n               Top of my list.\n\n     She joins Johns for a drink. Entering, the Chrislams watch with\n     both envy and aversion.\n\n                              FRY\n               I don't suppose....\n\n                              IMAM\n               One of the Christian habits we didn't\n               adopt -- perhaps unfortunately. We'll\n               have to wait.\n\n                              JOHNS\n               For what? There is no water. You\n               understand that, don't you?\n\n                              IMAM\n               All deserts have water, somewhere. God\n               shall lead us there.\n\n\n     INT. MAIN CABIN - CRASH SHIP - DAY\n\n     START on the cutting torch, abandoned in wreckage. Staring at it\n     is...\n\n     Riddick. With his hands cuffed behind him and around a bulkhead,\n     he can't get near it. Or can he? Near the ceiling, the bulkhead\n     is fractured -- a slim spot where maybe chains could pass through.\n\n     Riddick stands. With a GRUESOME POPPING, he dislocates both\n     shoulders...carries his arms overhead...passes the chains through\n     the broken spot...and brings his arms down in front of him. A\n     body-flex POPS HIS SHOULDERS back into joint.\n\n     Free, he reaches for the cutting torch.\n\n\n     EXT. CRASH SHIP - DAY\n\n     Pistol in hand, Johns runs into a BIG CLOSEUP, eyes sweeping.\n     Nothing on the horizon. But something lies on the ground nearby.\n     It's Riddick's mouth-bit.\n\n                              JOHNS\n               Like we needed another way to die.\n\n\n     INT. CARGO HOLD - DAY\n\n     FAST CLOSEUPS: Hands pillaging storage lockers, pulling out\n     anything that might qualify as a \"weapon.\" It all gets hauled\n     back and dumped into...\n\n     INT. NAV BAY - CRASH SHIP - DAY\n\n     Nav-bay. Gathered, the survivors take inventory: Johns has a\n     pistol, shotgun, baton. Zeke and Shazza offer up a pick-ax,\n     digging tools, hunting boomerang. Imam shows a ceremonial blade.\n     Paris straggles in with antique curios.\n\n                              JOHNS\n               What the hell are these?\n\n                              PARIS\n               Maratha crow-bill war-picks from Northern\n               India. Very rare.\n\n                              ZEKE\n               An' this?\n\n                              PARIS\n               Blow-dart hunting stick from Papua New\n               Guinea. Very very rare, since the tribe's\n               extinct.\n\n                              ZEKE\n               'Cuz they couldn't hunt shit with these\n               things, be my guess.\n\n                              PARIS\n               Well, what's the need, anyway? If he's\n               gone, he's gone. Why should he bother us?\n\n                              JOHNS\n               First, because he can only live out there\n               for so long -- he's gonna come back and\n               take what we got. Second, for the sheer\n               thrill of the kill.\n\n     A beat. They all grab for weapons.\n\n\n     EXT. CRASH SHIP - DAY\n\n     Johns stands atop the crash ship, scanning with a scope. He\n     fixates on...\n\n     A blue glow on the horizon. \"What the hell is it?\"\n\n     Zeke and Shazza modify breather units, adding straps and tubing\n     and ball-floats. The prototype is tested on Audrey. She sucks\n     on the mouthpiece -- and finds that it works, supplying oxygen on\n     demand rather than in a constant flow.\n\n     Chrislams convert to traditional bedouin head-gear, readying for\n     travel.\n\n     Fry finishes wrapping Owens' body. She looks to the yellow sun,\n     low on the horizon. The red sun seems inclined to follow.\n\n                              FRY\n               Imam. We should leave soon. Before\n               nightfall but while it's cooler.\n\n                              ZEKE\n               What, you're goin' off, too?\n\n                              FRY\n               Johns is leaving you a gun. Just do me a\n               favor, huh? Get my crewies buried? They\n               were good guys who died bad.\n\n                              SHAZZA\n               A'course we will.\n\n                              PILGRIM #1 (O.S.)\n               Imam...Imam....\n\n     (NOTE: \"Imam\" is pronounced \"el-ee-MAM.\")\n\n     Fry and the others round the ship to see...\n\n     A blue star flaring into view. It's rising as the other suns are\n     setting.\n\n                              SHAZZA\n               My bloody oath....\n\n                              AUDREY\n               Three suns?\n\n                              ZEKE\n                         (to Fry)\n               So much for your nightfall.\n\n                              PARIS\n               So much for my cocktail hour.\n\n                              IMAM\n               We take this to be a good sign -- a path,\n               a direction from God.\n\n     Johns swings down from the top of the ship.\n\n                              JOHNS\n               A very good sign.\n                         (re: blue sun)\n               That's Riddick's direction. You do not\n               wanna be caught in the dark with this guy.\n\n                              FRY\n               Thought you found his restraints over\n               there. Toward sunset.\n\n                              JOHNS\n                         (nodding)\n               Which means he went toward sunrise.\n\n\n     EXT. PLANET - DAY\n\n     Trekking, the Chrislams waft incense pots and CHANT FROM\n     THE KORAN as they head toward the blue star. Johns provides\n     shotgun escort; Fry carries Paris' second war-pick on a shoulder.\n     Silhouetted against the alien sky, the scouting party is an odd,\n     odd sight.\n\n     Already sun-battered, Johns crafts an eye-visor out of plexi.\n     Fry tries to wrap her head like the Chrislams. Imam helps.\n\n                              FRY\n               So quiet. You get used to the sounds of\n               the ship, then....\n\n                              IMAM\n               You know who Muhammad was?\n\n                              FRY\n               Some prophet guy?\n\n                              IMAM\n               \"Some prophet guy.\" And a city man. But\n               he had to travel to the desert -- where\n               there was quiet -- to hear the words of\n               God.\n\n                              FRY\n               You were on a pilgrimage? To New Mecca?\n\n                              IMAM\n                         (nodding)\n               Chrislam teaches that once in every\n               lifetime should there be a great hajj --\n               a great pilgrimage. To know God, better,\n               yes, but to know yourself as well.\n\n                              FRY\n               Frightening thought.\n\n                              IMAM\n                         (finishes wrapping her)\n               We're all on the same hajj now.\n\n     Fry notices Johns scope-locked on something.\n\n                              FRY\n               What?\n\n                              JOHNS\n                         (hands her scope)\n               Tell me it's not a mirage.\n\n     SCOPE POV: Beyond a distant rise, strange branches.\n\n                              FRY\n               Trees?\n\n\n     EXT. CRASH SHIP - DAY\n\n     Paris has taken over as look-out atop the ship. He deals with\n     the heat by erecting a \"misting\" umbrella: He fills a reservoir\n     with liquor, dials up a regulator. Umbrella spars shoot bursts\n     of cooling alcohol vapor. Paris luxuriates in it.\n\n                              ZEKE (O.S.)\n               Comfy up there?\n\n     Zeke appears below. He loads a scrap-metal sled with tarp,\n     cable, pick-ax.\n\n                              PARIS\n               Amazing how you can do without the\n               essentials of life -- so long as you have\n               the luxuries.\n\n                              ZEKE\n               Well, just keep your bloody-fuckin' eyes\n               open. Don't want that ratbag sneakin' up\n               on me bloody-fuckin' arse.\n\n     He drags the sled toward the spired hills. Keeping one eye on\n     Zeke, Paris eases into a chair, lays the war-pick across his lap,\n     pours himself a spot of sherry. As he sips, a blade touches his\n     throat.\n\n                              AUDREY\n               He'd probably get you right here, right\n               under the jaw. And you'd never hear him\n               coming. That's how good Riddick is.\n\n     Paris eases the hunting boomerang away.\n\n                              PARIS\n               Now did you run away from your parents?\n               Or did they run away from you?\n\n     EXT. BONEYARD OVERLOOK - DAY\n\n     The scouting party approaches a rise. The trees loom just beyond.\n\n                              PILGRIMS\n               Allahu Akbar...Allahu Akbar....\n\n     The young pilgrims break into a excited run, anticipating an\n     oasis. But Fry hangs back, taking a harder look at the trees.\n     They don't move in the wind.\n\n     The pilgrims scramble up the rise -- and go motionless. Fry,\n     Johns and Imam catch up to behold...\n\n     The \"trees\" are actually the dorsal bones of a titanic skeleton,\n     tinted green by lichen. Beyond is a sea of bleached animal\n     bones. Impossibly, the bones seem to MOAN IN PAIN. All told,\n     it's like Hell overflowed right here.\n\n                              FRY\n               Is this whole planet dead?\n\n     A pilgrim questions Imam IN ARABIC.\n\n                              IMAM\n               He asks what could have killed so many\n               great things...\n         \n\n     EXT. BONEYARD - DAY\n\n     Moving into the boneyard:\n\n                              IMAM\n               Some...communal graveyard, perhaps...\n               like the elephants of Earth....\n\n     Fry touches one of the towering bones. It shows cut-marks --\n     almost as if the bone was hacked by a sword. \"Graveyard? Or\n     killing field?\"\n\n                              JOHNS\n               Long time ago. Whatever happened.\n\n\n     EXT. SKULL - BONEYARD - DAY\n\n     Pilgrim #1 reaches a huge skull laced with baleen-like combing.\n     Wind hitting the comb makes a LOW HARMONIC MOANING. By\n     moving a hand over the comb, the pilgrim can \"play\" DIRGELIKE\n     MUSIC. Wanting to show off the trick:\n\n                              PILGRIM #1\n               Ah....\n\n     He looks for Pilgrim #3 but can't spot him. And when he turns\n     back to the skull -- a face is staring through the combing. But\n     it's only...\n\n\n     INT. SKULL - BONEYARD - DAY\n\n     Pilgrim #3, inside the skull. Johns enters and chases him out.\n     About to leave, Johns notices...\n\n     Bone-chippings piled on the ground. It could be nothing, but\n     still...\n\n     Johns double-checks shadows, probing with the muzzle of his\n     shotgun. Satisfied, Johns exits. Now BOOM UP to reveal...\n\n     Riddick. Hidden in a sinus cavity.\n\n\n     EXT. SKULL - BONEYARD - DAY\n\n     Trailing the others, Fry pauses to change out the O2 on her\n     breather.\n\n\n     INT. SKULL - BONEYARD - DAY\n\n     Riddick drops to the ground. His arms and hands are now pierced\n     with shards of boneyard ivory -- fashionable little body talons.\n     Spotting a shadow on the combing, he draws closer. And sees Fry.\n     Alone.\n\n\n     EXT. SKULL - BONEYARD - DAY\n\n     Johns doubles back to Fry. He takes a hit of scotch, offers her\n     some.\n\n                              FRY\n               Probably makes it worse. Dehydrates you\n               even more.\n\n                              JOHNS\n               Probably right.\n\n     They drink anyway. Moving out of the sun, Fry leans up against\n     the combing. It brings her within arm's length of...\n\n\n     INT. SKULL - BONEYARD - DAY\n\n     Riddick. He pulls a bone-shiv, freshly chiseled.\n\n                              JOHNS (O.S.)\n               You know, I woulda played road dog for\n               these guys. You could've stayed back.\n               Pro'bly should've -- because, you know,\n               if we don't find water....\n\n     \"We may not make it back.\"\n\n                              FRY (O.S.)\n               No, no, I wanted to get away.\n\n                              JOHNS (O.S.)\n               So I noticed. Never seen a \"captain\"\n               quite so ready to leave her ship.\n\n     Just as Riddick eases his blade toward Fry's neck...\n\n\n     EXT. SKULL - BONEYARD - DAY\n\n     She steps away.\n\n                              FRY\n               Better keep moving....\n\n                              JOHNS\n               What'd Owens mean? 'Bout not touching\n               the switch?\n\n     Fry searches his eyes, wondering if she can trust him -- and\n     again she leans back on the combing. We can actually see Riddick\n     now. They could too, if they would just TURN THE FUCK AROUND!\n\n                              JOHNS (CONT'D)\n               Hey. You can tell me, Carolyn.\n\n                              FRY\n               Promise me. Swear to me you won't --\n\n                              JOHNS\n               You see anybody else here? Just between\n               you and me.\n\n                              FRY\n               During the landing...when things were\n               at their worst...Owens was at his best.\n               He's the one who wouldn't let the pilot\n               dump the passenger cabin.\n\n     Johns blinks, stunned. \"Are you shittin' me?\"\n\n\n     INT. SKULL - BONEYARD - DAY\n\n     Trying again, Riddick reaches out with his shiv -- and deftly\n     slices off some of Fry's hair. A locket. A souvenir. That's\n     all he wanted.\n\n                              FRY (O.S.)\n               So now you know.\n\n                              JOHNS (O.S.)\n               Fuck. Guess I'm more glad to be here than\n               I thought.\n\n     Riddick watches them move off -- then looks at the scotch bottle,\n     left behind. It's still got one good swallow.\n\n\n     EXT. START OF GAUNTLET - DAY\n\n     Leaving the boneyard, the scouting party reaches a cleft in the\n     hills. Ahead is a canyon.\n\n                              JOHNS\n               Hold up.\n\n     He jumps onto a rock, puts the scope to an eye.\n\n                              JOHNS (CONT'D)\n               Didn't bite.\n\n                              FRY\n               What?\n\n                              JOHNS\n               Thought he might be coolin' it in the\n               boneyard -- could either double-back to\n               the ship or slip in behind us. So I left\n               the bottle out as bait.\n\n     SCOPE POV: PANNING the boneyard. FINDING the bottle. It's\n     still got that one swallow.\n\n                              JOHNS (CONT'D)\n               But nah. Didn't bite.\n\n\n     EXT. BONEYARD - DAY\n\n     CLOSER on the bottle. Only we see that the scotch has been\n     emptied -- and replaced with sand.\n\n\n     EXT. GRAVE SITE - SPIRED HILLS - DAY\n\n     Working under the shade of a tarp, Zeke digs a communal grave.\n     Three wrapped corpses wait nearby. He keeps a sight-line on...\n\n     The crash ship. Shazza waves. Zeke waves back.\n\n\n     EXT. RIBCAGE - THE GAUNTLET - DAY\n\n     The scouting party transits a narrowing canyon. Lined with rib\n     bones, it makes us feel like we're in the belly of some beast.\n\n     Fry squints at the ridgetops. More of those spires are visible\n     on the canyon rims, looming like silent sentinels. \"What are\n     they? Just mineral deposits?\"\n\n                              PILGRIM #1\n               Captain...captain....\n\n     The Chrislams have found what appears to be a small desert plant.\n     Leathery petals are spread wide, revealing a round stringy core.\n     ARABIC DISCUSSION. Desert fruit? Is it edible?\n\n                              FRY\n               Wait, wait, wait....\n\n     Fry takes the \"plant,\" pushes the \"petals\" back down over the\n     core. They all stare. It's a baseball.\n\n                              IMAM\n               We are not alone here, yes?\n\n     They look ahead, wondering what awaits them. But Johns is\n     looking back.\n\n                              JOHNS\n               Never thought we were.\n\n\n     EXT. SETTLEMENT - DAY\n\n     HIGH ANGLE: An old WEATHER COCK CREAKS in the wind. Fry,\n     Johns, and the Chrislams enter FRAME far below.\n\n                              PILGRIM #1\n               Assalamoo ahlaykum!\n\n     The GREETING ECHOES through the settlement, built from stacked\n     shipping containers. Tattered sun-shades flap in the wind. A\n     rusty bike lies on the ground.\n\n                              PILGRIM #2\n               Assalamoo ahlaykum!\n\n                              JOHNS\n               Long gone. Whoever they were.\n\n     They move around a building -- and pull up short. Before them\n     looms a moisture-recovery unit, a hulking machine in disrepair.\n     Old jugs litter the ground.\n\n                              IMAM\n               Water...water there was here....\n\n                              PILGRIMS\n               Allahu Akbar....\n\n\n                              IMAM\n                         (translating)\n               \"God is Great,\" yes?\n\n                              JOHNS\n               I'm born-again.\n\n     Fry manages a weary smile -- but soon her eyes revisit the\n     abandoned buildings. \"Who were these people? Why did they\n     leave so much behind?\"\n\n\n     INT. MAIN ROOM - SETTLEMENT - DAY\n\n     Through a window, we see the Johns and the Chrislams crawling\n     over the moisture-recovery unit, assessing repairs. PULL BACK to\n     include Fry inside the settlement, inspecting...\n\n     Refectory table. Place settings out. Years of dust.\n\n     Photos on the wall: Settlers working modest gardens. Playing\n     baseball. Posing with children.\n\n     INT. LIVING QUARTERS - SETTLEMENT - DAY\n\n     Fry enters a dark room.\n\n                              FRY\n               Lights.\n\n     No response to her command. She pats around for old-style wall\n     switches. Nothing. Perceiving black-out blinds on a window, she\n     throws them open to reveal...\n\n     A man standing right outside.\n\n                              JOHNS\n                         (through window)\n               Hey. Don't go too far, huh?\n\n     Fry nods. Johns smiles, leaves. Just as her heart settles,\n     SOMETHING CREAKS behind her.\n\n     It's an orrery, a mechanical device that shows the motion of the\n     planets around their suns. Solar powered, the orrery starts\n     turning, CREAKING. One planet seems always to have sunlight.\n\n                              FRY\n               No darkness. No lights because no\n               darkness....\n\n\n     EXT. PORCH - SETTLEMENT - DAY\n\n     Fry reaches a porch. It looks out over the rear of the\n     settlement and more unforgiving terrain. She starts back\n     inside -- but something glints at the edge of her vision. Fry\n     turns back...parts clothes on a laundry line...and sees the\n     source of the glint.\n\n     Excited hits on her breather.\n\n     Fry vaults off the porch -- and starts walking as if on magnetic\n     bearing. Soon she's running.\n\n\n     EXT. SETTLEMENT - DAY\n\n                              FRY (V.O.)\n               Allahu Akbar! Allahu Akbar!\n\n     Johns and the Chrislams trade looks.\n\n\n     EXT. SKIFF - DAY\n\n                              FRY\n               Allahu Akbar!\n\n     Fry stops on a groomed runway, out of breath. The others catch\n     up. They too marvel at...\n\n     The skiff, a light-duty vehicle of hybrid technology -- part bush\n     plane, part space craft. Its fabric wings are wind-torn -- but\n     the hull looks intact.\n\n\n     EXT. TOP OF CRASH SHIP - DAY\n\n     CLOSE on caviar being added to toast-points.\n\n     A SCRABBLING SOUND stops Paris in mid-bite. He eases out of his\n     rocker, moves to the rear edge of the ship and looks down on...\n\n     A shadow ducking under him. Small rocks still trickle down a\n     dirt rampart just climbed by...someone.\n\n                              PARIS\n               This now qualifies as the worst fun I've\n               ever had. Stop it.\n\n     No response.\n\n\n     EXT. CRASH SHIP - DAY\n\n     War-pick in hand, Paris eases to ground-level. He checks the\n     perimeter, looks inside the ship. Nobody. Is he being fucked\n     with? Again? He hopes?\n\n                              PARIS\n               Audrey? Oh, Audrey....\n\n                              AUDREY (O.S.)\n               What?\n\n     Paris spins. The voice came from the cargo hold -- and not where\n     he expected.\n\n\n     INT. CARGO HOLD - DAY\n\n     Blades of sunlight stream in through cracks in the hull. Paris\n     enters to find Shazza and Audrey cutting open containers,\n     searching for usable goods.\n\n                              PARIS\n               Tell me that was you.\n\n                              AUDREY\n               Okay, it was me. What'd I do now?\n\n                              PARIS\n               Assailing my fragile sense of security,\n               that's what.\n\n                              SHAZZA\n               What're you goin' on about? She's been\n               right here for the last....\n\n     They all see it: Sun-blades are momentarily blocked by something\n     passing outside. Someone.\n\n                              SHAZZA\n                         (a quiet probe)\n               Zeke?\n\n     No answer. Audrey springs to the other side of hold, puts an eye\n     to a crack there.\n\n     HULL-CRACK POV: Far away, Zeke finishes digging the grave. He\n     starts toward the ship.\n\n     Audrey whirls back, mouths a silent alarm: \"RIDDICK!\"\n\n     Paris goes bloodless. Shazza grabs the war-pick out of his\n     frozen hands, moves catlike to the main doors and poises there,\n     ready to strike. Audrey follows with the hunting boomerang.\n     All eyes watch as...\n\n     The sun-blades, winking off and on, chart Riddick's approach:\n     We feel like we're inside a magician's sword box, watching the\n     blades shave closer and closer to us. Suddenly he appears...\n\n     And Shazza swings hard.\n\n                              AUDREY\n               No!\n\n     Facing them is a TOTAL STRANGER -- burned, half naked, one hand\n     still clutching the emergency-release lever of his cryo-locker.\n     Shazza stopped one inch short of killing him.\n\n                              TOTAL STRANGER\n               I thought...my God, I thought I was the\n               only one who....\n\n     He lurches toward Shazza, trying to embrace her -- and sees blood\n     and brain-bits BLAM-BLAMMING against her. His own. The stranger\n     sinks bonelessly to the ground. FAST RACK to reveal Zeke in the\n     background, pistol leveled. He reads Shazza's horrified face --\n     and understands what he's done.\n\n                              PARIS\n               Oh, Lord....\n\n                              AUDREY\n               It was just somebody else. From the\n               crash. He was just....\n\n                              ZEKE\n               Cripes galore, I thought it was him. The\n               murderin' ratbag. I thought he was....\n\n     He rushes over to check the dead stranger. As he bends down,\n     FAST RACK AGAIN to reveal Riddick in the background. He stands\n     20 paces off, still unseen by the others. His goggle eyes\n     covet...\n\n     Zeke's breather.\n\n\n     EXT. SKIFF - DAY\n\n     Fry exits the skiff.\n\n                              FRY\n               No juice, looks like it's been laid up\n               for years. But we might be able to\n               adapt --\n\n                              JOHNS\n               Shut up.\n\n     Outside, Johns has an ear cocked to the wind.\n\n                              JOHNS (CONT'D)\n               Sorry. Thought I heard something.\n\n                              FRY\n               Like what?\n\n                              JOHNS\n               Like my pistola.\n\n\n     EXT. GRAVE SITE - SPIRED HILLS - DAY\n\n     START on the drag-sled carrying Corpse #4-- the stranger.\n\n     Zeke reaches the grave. The sun-tarp has fallen on one side,\n     blocking the sight-line between ship and grave. Zeke starts to\n     unload the body -- but sees something he didn't notice before:\n     There's some kind of opening at the bottom of the grave.\n\n                              ZEKE\n               Now what the bloody hell....\n\n     Zeke hops down into the grave. CAMERA MOVES to reveal Riddick\n     hidden among the spires. He's been waiting for a chance just\n     like this.\n\n\n     EXT. GRAVE - DAY\n\n     Zeke drops to all fours. Looks into the tunnel. There seems to\n     be some kind of burrow beyond.\n\n     BURROW POV: Staring back at Zeke.\n\n     Zeke takes a handlight off his belt, shines it into the burrow.\n     It's the last thing he ever does.\n\n\n     INT./EXT. CRASH SHIP - DAY\n\n     As MORE GUNSHOTS jar Paris, Audrey, Shazza.\n\n\n     EXT. GRAVE - DAY\n\n     FURIOUS CLOSEUPS: Zeke fighting for his life. PISTOL BLASTING.\n     Something slashing at him. Blood dancing on air.\n\n\n     EXT. CRASH SHIP - DAY\n\n     Shazza sprints across hard-pack, heading for...\n\n\n     EXT. GRAVE SITE - SPIRED HILLS - DAY\n\n     The grave. She slaps aside the tarp to find...\n\n     Riddick. Bone-shiv in hand, he just stands on the other side of\n     the grave. Shazza looks down. And SCREAMS.\n\n\n     EXT. SPIRED HILLS - DAY\n\n     CAMERA PURSUES Riddick as he lopes through the spires, running\n     from the scene of the crime. He turns a blind corner -- and\n     SOMETHING NEARLY BLOWS HIS HEAD OFF at close range. He hits\n     ground. A boot steps on his neck, keeping him there.\n\n                              JOHNS\n               Same crap, different planet, huh?\n\n\n     EXT. SETTLEMENT - DAY\n\n     Sucking on their breathers, Fry and the Chrislams make it back to\n     the ship. They find Johns beating Riddick like a chained dog.\n\n                              JOHNS\n               ...I don't play that...I don't play that\n               so just try again. C'mon, Riddick, tell\n               me a better lie....\n\n                              FRY\n               Ease up, ease up. JOHNS! Just tell me\n               what....\n\n     She hauls him off -- only to have Shazza start punching Riddick.\n\n                              SHAZZA\n               What'd you do with 'im? You bloody sick\n               animal you, what'dja do with me Zeke?\n\n\n     EXT. GRAVE SITE - SPIRED HILLS - DAY\n\n     Fry and Johns stand over the grave. It's a gory mess -- but no\n     sign of Zeke. Johns has Riddick's confiscated shiv.\n\n                              FRY\n               He used that?\n\n                              JOHNS\n               Sir Shiv-a-lot. He likes to cut.\n\n                              FRY\n               So why isn't it all bloody?\n\n                              JOHNS\n               I assume he licked it clean.\n\n\n     INT. MAIN CABIN - CRASH SHIP - DAY\n\n     Riddick is back in chains, face pulpy from the beating, listening\n     to SOTTO VOCE VOICES outside. Fry enters, looks at him hard.\n\n                              FRY\n               So where is he?\n\n     Riddick turns away, revealing a broken goggle-lens. The eye\n     beneath is closed: For some reason, he won't look at her.\n\n                              FRY\n               Tell me about the sounds. You told them\n               you heard something right before....\n                         (no response)\n               If you don't talk to me, Johns'll take\n               another crack at it -- at your skull.\n\n                              RIDDICK\n               'Mean the whispers?\n\n                              FRY\n               What whispers?\n\n                              RIDDICK\n               The ones tellin' me to go for the sweet\n               spot -- just to the left of the spine,\n               fourth lumbar down. The abdominal aorta.\n               What a gusher. Had a cup on his belt,\n               so I used it to catch a little run-off.\n               Metallic taste to it, human blood.\n               Coppery. But if you cut it with\n               peppermint schnapps, that goes away.\n               Course, that's more for winter.\n               Summertime, I take mine straight.\n\n     Fry stares. Riddick gets a black satisfaction from his role as\n     Boogeyman: If fear is the only kind of respect he can get,\n     Riddick is going to grab some with both hands.\n\n                              FRY\n               Why don't we try the truth now?\n\n     A head-shaking beat, then:\n\n                              RIDDICK\n               All you people are so scared of me --\n               an' most days, I'd take that as a\n               compliment -- but it ain't me you gotta\n               worry about now.\n\n                              FRY\n               Show me your eyes.\n\n     Again he turns away. She strips the goggles off. He sits with\n     lids shut tight, anticipating the pain.\n\n                              FRY\n               Show me, Riddick.\n\n     Imagine a virgin undressing in front of someone for the first\n     time. That's how Riddick opens his eyes, startling us: No\n     irises, just huge black-pool pupils. And from deep within, a\n     jewel-like eyeshine. His eyes are as beautiful and unsettling as\n     those of a starved jaguar.\n\n                              FRY\n               You did this? To yourself?\n\n                              RIDDICK\n               Slam doctor. Well, we called him \"doctor.\"\n\n                              FRY\n               Heard about it. Just never seen it.\n\n                              RIDDICK\n               Fairly fuckin' ironic, wouldn't you say?\n               Slamlight's so dim that you go and get\n               your eyeballs taken out and shined up --\n               then you wind up here. Three ass-kick\n               suns.\n                         (replacing goggles)\n               Maybe I did do a few people. But not this\n               one. No ma'am, not this time.\n\n                              FRY\n               Then where is he? He's not in the hole.\n               We looked.\n\n                              RIDDICK\n               Look deeper.\n\n     He CLICKS HIS TONGUE at her.\n\n\n     EXT. CRASH SHIP - DAY\n\n     Chain looped over one shoulder, Fry heads back to the grave site.\n     Johns, Imam, Shazza, and Audrey keep pace as...\n\n                              JOHNS\n               I know what happened -- he went off on the\n               guy, buried him on the hill somewhere, and\n               now he's trying to --\n\n                              FRY\n               Let's just be sure.\n\n                              JOHNS\n               I am sure. Look, murders aside, Riddick\n               belongs in the Asshole Hall of Fame. He\n               loves the jaw-jackin', loves making you\n               afraid, 'cuz that's all he has. And\n               you're playing right into --\n\n                              FRY\n               We're gonna find the body, Johns. Christ,\n               you're a cop. Why am I tellin' you this?\n               We gotta go down and find it.\n\n                              JOHNS\n               Well, don't ask me to.\n\n                              FRY\n               Thought you didn't believe his story.\n\n                              JOHNS\n               I don't. But that ground looked none too\n               stable, and I don't want anyone --\n\n                              AUDREY\n               If you're afraid, I'll go.\n\n     He shoots Audrey a scowl.\n\n                              FRY\n               Nobody else is going down but me, okay?\n\n                              JOHNS\n                         (pulling her aside)\n               Hey. Bein' ballsy with your life now\n               doesn't change what came before -- it's\n               just stupid.\n\n                              FRY\n               What, you think I'm doin' this to prove\n               something?\n\n                              JOHNS\n               You said it, not me. Let's just not let\n               one bad call lead to another.\n\n                              FRY\n               Thanks for the tip, Johns.\n\n     \"Now get outta my way.\"\n\n\n     EXT. GRAVE - DAY\n\n     Chain hooked to her web belt, Fry drops into the grave. She\n     peers into the burrow...looks back up at the halo of faces above\n     her...then slithers out of sight.\n\n\n     INT. BURROW - DAY\n\n     Letting her eyes adjust, Fry pats around lightly. Quickly she\n     finds Zeke's handlight, tries it. Broken.\n\n\n     EXT. GRAVE-SITE - SPIRED HILLS - DAY\n\n     CLOSE on the chain slithering through hands, playing out as Fry\n     moves deeper underground.\n\n\n     INT. UPHILL TUNNEL - DAY\n\n     Fry makes an uphill turn. Sees a spray of light ahead. Worms\n     forward to reach...\n\n\n     INT. THE LAIR - DAY\n\n     Another chamber, wide and just large enough to stand in. Shafts\n     of daylight bore down into the room. More old bones litter the\n     floor. Fry moves into one shaft and looks up at...\n\n     An earthen funnel. The inside of a spire.\n\n                              FRY\n               They're hollow....\n\n     CLICK-CLICK.\n\n     Fry slow-turns toward the sound.\n\n     CLICK-CLICK-CLICK.\n\n     There's something here, something just beyond the cusp of light.\n     Something unfolding.\n\n     An icy hand grips her heart. Soundlessly, Fry backtracks her\n     chain, but...\n\n     Something shadows across the exit. It stops her cold.\n\n     Her hand finds something new. She angles it to the light. It's\n     one of Zeke's boots -- with a bit of Zeke still in it.\n\n     CLICKITY-CLICKITY-CLICKITY....\n\n     The whole chamber is coming alive around her, shadows unfurling,\n     skulking the perimeter, circling.\n\n     Something impales the boot out of her hand, reclaiming it. It\n     was faster than a lightning-strike.\n\n     A paralyzed beat before...\n\n     Fry makes her move, rolling back into the shaft of daylight and\n     springing straight up into...\n\n\n     INT. SPIRE - DAY\n\n     The spire. Bracing against the walls, Fry tries to \"walk\" her\n     way up -- but her chain goes taut. Did it catch on something?\n     Or did something catch it? Fry starts pounding the earthen walls.\n\n                              FRY\n               Here! I'm in HERE, HERE, HERE!\n\n\n     EXT. GRAVE-SITE - SPIRED HILLS - DAY\n\n                              IMAM\n               Did you hear....\n\n     They drop down and suspend their heads over the bloody grave,\n     listening. Nothing now.\n\n\n     INT. SPIRE - DAY\n\n                              FRY\n               I'm over here in the --\n\n     Something tugs on her chain.\n\n                              FRY\n               Oh, God....\n\n     CLOSE on her feet. Kicking hard at the walls, trying to gouge\n     out footholds.\n\n     A stronger tug. Fry loses altitude, slipping closer to...\n\n     The MADLY CLICKING LAIR below.\n\n     She tries to jettison her belt -- but can't brace herself up and\n     undo the belt. Suddenly...\n\n     Something explodes near her head. Daylight appears, followed by\n     faces, human faces. They're breaking through the spire with the\n     pick-ax. Hands reach inside...\n\n\n     EXT. SPIRED HILLS - DAY\n\n     ...and birth her into daylight. Overlapping:\n\n                              JOHNS\n               We got you...it's okay, it's okay...we got\n               you now....\n\n                              IMAM\n               The child heard you before any of us could\n               even....\n\n                              SHAZZA\n               Did you find him? You find Zeke?\n\n                              FRY\n                         (half insane)\n               ...wasn't Riddick...it was...it was...\n               goddamn, that was stupid....but wasn't\n               Riddick. Somethin' else down there that\n               got Zeke and nearly got --\n\n     Her. She flies back into the spire. Something's still got the\n     chain.\n\n     The others grab at flailing limbs. It's a tug-of-war now, human\n     hands on one end, unseen \"hands\" on the other -- and the humans\n     are losing. Until...\n\n     Imam unsheathes his blade...\n\n     And slices through Fry's belt.\n\n\n     INT. SPIRE - DAY\n\n     As the chain falls down the spire. Without Fry.\n\n\n     INT./EXT. CRASH SHIP - DAY\n\n     FAST SHOTS: Survivors packing up O2, liquor, umbrellas, the\n     Koran -- whatever qualifies as \"essential\" on this planet. Amid\n     the activity, Audrey pauses to look at...\n\n     The spired hills.\n\n\n     INT. BATTERY BAY - CRASH SHIP - DAY\n\n     Fry and Imam pull a power cell from the ship's battery bay,\n     THUMPING it down on the deck.\n\n                              IMAM\n               One is all?\n\n                              FRY\n               For now.\n\n\n     INT. CARGO HOLD - DAY\n\n     At his personal locker, Johns digs out a box of shotgun shells.\n     He bypasses the blue-metal shells for a red-metal one. There's\n     something special about it -- though what, we can't be sure.\n\n\n     INT. MAIN CABIN - CRASH SHIP - DAY\n\n     A shadow falls over Riddick. He doesn't look up.\n\n                              RIDDICK\n               Found somethin' worse than me, huh?\n\n                              JOHNS\n               We're movin'. And I'm just wondering if\n               I shouldn't lighten the load right now.\n\n     Now their eyes meet. Johns RATCHETS HIS SHOTGUN and points it\n     at Riddick's head.\n\n                              RIDDICK\n               Woof, woof.\n\n     The SHOTGUN EXPLODES. CAMERA PANS off of Johns to show\n     Riddick still alive. The shotgun discharged next to his head and\n     blew off his wrist chains.\n\n                              JOHNS\n               Want you to remember this moment, Riddick.\n               The way it coulda gone and didn't.\n\n                              RIDDICK\n                         (deaf)\n               Say that again.\n\n                              JOHNS\n               Here's the deal. You work without the\n               chains, without the bit -- without the\n               shivs. You help us get off this rock....\n\n                              RIDDICK\n               For what? The honor of goin' back to some\n               asshole of a cell?\n\n                              JOHNS\n               Truth is, Riddick, I'm tired of this\n               head-up shit. I wanna be free of you as\n               much as you wanna be free of me.\n\n     A beat. The future rearranges in Riddick's head.\n\n                              RIDDICK\n               You'd cut me loose, Boss?\n\n                              JOHNS\n               Only if we both get outta this alive.\n               And there may be a way.\n\n     He offers a hand to help Riddick up, to seal the deal.\n\n                              RIDDICK\n                         (staring at hand)\n               My recommendation: Do me. Don't take\n               the chance that I'll get shiv-happy on\n               your wannabe ass. Ghost me, Riddick.\n               Would if I were you.\n\n                              JOHNS\n               If you were me, I'd kill us both. C'mon,\n               you wanna sit at the grown-up table or not?\n\n     A beat. Riddick reaches out for the hand -- and grabs the\n     shotgun with his off-hand. A blur of movement. Suddenly Johns\n     is staring at the eyes of his own shotgun.\n\n                              RIDDICK\n               Want you to remember this moment.\n\n     He pumps shotgun, spitting blue shells over Johns. He drops the\n     emptied gun and walks away.\n\n\n     EXT. PLANET - DAY\n\n     EXTREMELY WIDE: Blue sun setting, yellow and red sun rising.\n     The survivors trek for the settlement. Fry and Imam lug the\n     power cell between them, but the real load is shouldered by...\n\n     Riddick. Promoted from murderous monster to beast of burden,\n     he tows a drag-sled heavy with cargo.\n\n                              PARIS\n                         (to Johns)\n               So just like that. Wave your little wand\n               and he's one of us now.\n\n                              JOHNS\n               Didn't say that. But least this way I\n               don't have to worry about falling asleep\n               and not wakin' up.\n\n                              IMAM\n               Well, I feel we owe Mr. Riddick amends.\n\n                              SHAZZA\n               Oh, right. Let's all line up and beg his\n               forgiveness. Right you are.\n\n                              IMAM\n               At least give the man some oxygen....\n\n                              JOHNS\n               He's happy just bein' vertical. Leave him\n               be.\n\n                              AUDREY\n               So I can talk to him now?\n\n                              JOHNS/SHAZZA\n                         (in unison)\n               No.\n\n     Paris drops a wine bottle. Trailing, Riddick collects it.\n\n                              PARIS\n               Paris P. Ogilvie. Antiquities dealer,\n               entrepreneur.\n\n                              RIDDICK\n                         (shaking hands)\n               Richard B. Riddick. Escaped convict,\n               murderer.\n\n     Instead of returning the bottle, Riddick opens it and drinks.\n     Paris hurries to catch up to the others.\n\n                              PARIS\n               You know, if I owned Hell and this\n               planet...I believe I'd rent this out and\n               live in Hell.\n\n\n     EXT. THE GAUNTLET - DAY\n\n     FRY'S POV: Of spires high above us.\n\n     The group falls silent as they transit the canyon, all eyes on\n     the spires. Fry stops short, hearing...\n\n     CLICKITY-CLICK.\n\n     Neck hairs rise -- but soon the sound vanishes. The group starts\n     moving again, faster.\n\n     CLICKITY-CLICKITY-CLICK.\n\n     Are they being stalked? Nervously, Fry traces the sound back\n     to...\n\n     Beads dangling from the belt of Pilgrim #1. Whenever he moves,\n     the STRINGS CLACK together.\n\n\n     EXT. SKIFF - DAY\n\n                              PARIS\n               I mean, usually I can appreciate antiques,\n               but, uh....\n\n     The survivors have reached the settlement. Fry is trying to get\n     the power cell aboard the skiff as the others walk its exterior.\n\n                              JOHNS\n               Little ratty-ass.\n\n                              FRY\n               Nothing we can't repair -- so long as the\n               electrical adapts.\n\n                              SHAZZA\n               Not a star-jumper.\n\n                              RIDDICK\n               Doesn't need to be. Use this to get back\n               up to the Sol-Track Shipping Lanes, stick\n               out a thumb. You'll get picked up.\n                         (to Fry)\n               Right?\n\n     Fry looks from Riddick to Johns. \"How did he know that?\"\n\n                              FRY\n               Little help here?\n\n     They muscle the power cell aboard. Riddick starts to follow, but\n     Johns blocks. He doesn't want Riddick inside.\n\n                              JOHNS\n               Check those containers for me. See what\n               we can patch wings with.\n\n\n     EXT. SETTLEMENT - DAY\n\n     With religious fervor, the Chrislams are repairing the moisture-\n     recovery unit -- the machine Allah led them to.\n\n\n     INT. SKIFF - DAY\n\n     START on the battery bay. Hands are adapting the power cell to\n     the skiffs older electrical system. Soon...\n\n     Lights wink on throughout the ship.\n\n                              FRY\n               Okay, that should buy us a sys-check.\n               But we'll need more cells.\n\n                              JOHNS\n               How many?\n\n                              FRY\n               15 6-gigs here...90 gigs total...other\n               ship carries 20-gig cells, so...five.\n               Five total to launch.\n\n                              JOHNS\n               25 kilos each, huh?\n\n                              SHAZZA\n               Old sand-cat outside. See if I can't get\n               it up and chuggin'.\n\n                              JOHNS\n               Do it. And if you need an extra hand,\n               tap our problem child out....\n                         (looking out)\n               Where's Riddick?\n\n\n     EXT. SETTLEMENT - DAY\n\n     He's walking the ghost town, finding dead gardens...upended\n     chairs and furniture...broken skylights. Behind his back...\n\n     Audrey and Pilgrim #3 (the youngest Chrislam) scurry through\n     FRAME, stalking this curious monster in their midst.\n\n\n     EXT. MOISTURE-RECOVERY UNIT - SETTLEMENT - DAY\n\n     CLOSE on the other Chrislams, faces charged with anticipation\n     while awaiting...\n\n     The first drop of water. It appears at the bottom of a pipette.\n\n     Tongues fight for it. Another drop forms in its place. Now\n     another and another. It brings CHEERS.\n\n\n     INT. MAIN ROOM - SETTLEMENT - DAY\n\n     CLOSE on Paris' hands. Getting ready to celebrate, he unwraps\n     crystal goblets...dusts off the refectory table...and rehangs an\n     old Christmas garland. INTERCUT WITH...\n\n\n     EXT. CORING ROOM - SETTLEMENT - DAY\n\n     Hands digging in dirt.\n\n     Covertly, Audrey and Pilgrim #3 watch Riddick digging near the\n     entrance of a tall windowless structure.\n\n     He excavates a pair of broken eyeglasses... a shattered light...\n     and a child's tin robot, timeless. Riddick thumbs a solar panel\n     clean. The robot's language program warbles to life:\n\n                              ROBOT\n               \"...to all intruders. I am the guardian\n               of this land. I will protect my masters\n               at all cost. Death to all intruders...\"\n\n     Riddick stands and tries the doors. Locked. He peers through a\n     small filthy window. Is there something moving inside? Nothing\n     now. Riddick removes some windblown trash from a doorside sign.\n     \"Coring Room.\"\n\n                              JOHNS (O.S.)\n               Missin' the party. C'mon.\n\n     It's Johns, keeping him on a short leash. Leaving, Riddick kicks\n     a trash bin. Hard.\n\n                              RIDDICK\n               Missin' the party. C'mon.\n\n     He leaves. HOLD on the trash bin a beat.\n\n\n                              AUDREY (O.S.)\n               Talkin' to me?\n\n\n     INT. CORING ROOM - DAY\n\n     PILGRIM'S POV: Of Audrey exiting the trash bin and running after\n     Riddick and Johns.\n\n     Pilgrim #3 is at the window of the coring room. He's found a way\n     inside. By the window's feeble light, he starts exploring. Just\n     visible at the center of this room is a vertical coring drill.\n\n\n     INT. MAIN ROOM - SETTLEMENT - DAY\n\n                              IMAM\n               ...and for this, our gift of drink, we\n               give thanks in the name of our Prophet,\n               Muhammad, peace be upon him, and to our\n               Lord, Jesus Christ of Nazareth, and to his\n               father, Allah the Compassionate and the\n               Merciful.\n\n                              PARIS\n                         (to himself)\n               The strangest religion....\n\n     Pilgrims finish pouring cloudy water into goblets. Riddick gets\n     the last of it -- the part with sediment. SELECTED CLOSEUPS as\n     they drink. Nothing ever tasted finer.\n\n                              PARIS\n               Perhaps we should toast our hosts. Who\n               were these people, anyway? Miners?\n\n                              SHAZZA\n               Looks like geologists. Advance team,\n               moves around from rock to rock.\n\n                              JOHNS\n               Musta crapped out here, huh?\n\n                              AUDREY\n               But why did they leave their ship?\n\n     Silence. It's a question no one has chosen to deal with yet.\n     Imam notices one water glass unspoken for.\n\n\n     EXT. CORING ROOM - DAY\n\n     CLOSE on the \"Coring Room\" sign. An attached solar panel begins\n     moving, orienting toward sunlight. When it catches the full\n     brunt of the suns' rays...\n\n     STORM SHUTTERS unlatch on the roof.\n\n\n     INT. CORING ROOM - DAY\n\n     Pilgrim #3 hears SHOOTING LATCHES overhead. That sound brings\n     another sound: A strange SKITTERING. The pilgrim looks up. Is\n     there something in the rafters?\n\n\n     INT. MAIN ROOM - SETTLEMENT - DAY\n\n                              JOHNS\n                         (answering Audrey)\n               Well, just a skiff. Disposable, really.\n\n                              PARIS\n               Like an emergency life-raft, right?\n\n                              SHAZZA\n               Sure. Coulda had a real drop-ship take\n               them off-planet. Long gone.\n\n                              PARIS\n               A toast to their ghosts, then....\n\n     Goblets rise.\n\n                              RIDDICK\n               Didn't leave, these people. Whatever got\n               Zeke got them. They're all dead.\n\n     It's like he just pissed in the punchbowl.\n\n                              RIDDICK (CONT'D)\n               What, you don't really think they left\n               with their clothes on the lines? Photos\n               on the walls?\n\n                              SHAZZA\n               Maybe they had weight limits, you don't\n               know.\n\n                              RIDDICK\n               I know you don't uncrate your emergency\n               ship unless there's a fucking emergency.\n\n                              JOHNS\n               Rag it, Riddick. Nobody wants your\n               theories on --\n\n                              FRY\n                         (to Riddick)\n               So what happened? Where are they, then?\n\n     Fry is the only one willing to look at reality -- or at least\n     glance its way. At the window, Imam scans outside.\n\n                              IMAM\n               Has anyone seen the young one? Ali?\n\n                              RIDDICK\n                         (to Fry and Imam)\n               Has anyone checked the coring room?\n\n\n     INT. CORING ROOM - DAY\n\n     Now the storm shutters start yawning open, spreading daylight\n     over Pilgrim #3 and...\n\n     The ceiling rafters. They're encrusted with thick nests of...\n     something. The SKITTERING grows louder, more agitated.\n\n     Sensing trouble, Pilgrim #3 hurries for a sliver of daylight in\n     a wall -- the breach he entered through. He never gets there:\n\n     Sunlight hits the first nest. It EXPLODES WITH LIFE.\n\n\n     INT./EXT. MAIN ROOM - SETTLEMENT - DAY\n\n     As Imam hears the SCREAM.\n\n                              IMAM\n               Ali....\n\n\n     INT. CORING ROOM - DAY\n\n     CHAOTIC SHOTS: More NESTS EXPLODE into individual creatures,\n     winged hatchlings moving like bats in a fire, talons hacking and\n     slashing. His exit blocked, Pilgrim #3 veers into...\n\n     A dark supply room. He slams the door, MUMBLES A BLESSING and\n     waits for the storm to pass. He's been cut -- but at least he's\n     still alive.\n\n\n     EXT. SETTLEMENT - DAY\n\n     As the survivors run for the coring room.\n\n\n     INT. MAIN ROOM - SETTLEMENT - DAY\n\n     As Riddick stays behind to drink their water.\n\n\n     INT. CORING ROOM - DAY\n\n     HINGES ARE BLASTED AWAY. The door caves in. Imam shoulders\n     past Johns to enter and find...\n\n     The empty coring room.\n\n                              IMAM\n               Ali?\n\n     A NOISE from the supply room. Is it Ali? Just too scared to\n     come out? Imam opens the door...\n\n     And hatchlings pour out.\n\n     Moving with a gang-intelligence, they circle the room in a wave,\n     soar high into the rafters -- then plunge into the coring shaft,\n     SQUEALS VANISHING to infinity. Shocked silence, then...\n\n     Pilgrim #3 tumbles to the ground. He's been shredded into bloody\n     kite-tails. There was a nest inside the supply room.\n\n     Imam falls on him in grief. Johns and Fry inch forward to peer\n     down...\n\n     The coring shaft. It's littered with human bones. The skeletons\n     of the settlers. Scattered about and picked clean.\n\n\n     EXT. SETTLEMENT - DAY\n\n     Against a blue sunrise, the Chrislams hold a prayer service.\n     Paris and Audrey attend. Riddick watches from afar.\n\n\n     INT. CORING ROOM - DAY\n\n                              SHAZZA\n               Why was the door chained up? Why the\n               bloody hell would they lock themselves in\n               like that?\n\n                              JOHNS\n               Not sure, but tell you what: Chrislams\n               better not be diggin' another grave out\n               there.\n\n                              RIDDICK (O.S.)\n               Other buildings weren't secure...\n\n     They turn. Riddick enters.\n\n                              RIDDICK (CONT'D)\n               ...so they ran here. Heaviest doors.\n               Thought they'd be safe inside, but...\n                         (looks down shaft)\n               Someone forget to lock the back door.\n\n     Shazza joins him at the shaft. Gazing on the human remains:\n\n                              SHAZZA\n               So that's what come of me Zeke. An' you\n               saw it. You was right there.\n\n     Riddick nods.\n\n                              SHAZZA (CONT'D)\n               You were tryin' to kill him too.\n\n                              RIDDICK\n                         (shrugging, \"not\n                          necessarily\")\n               Just wanted his O-2.\n                         (a beat)\n               Though I notice he tried to ghost my ass.\n               When he shot up that stranger instead.\n\n     Shazza can't deny it. She looks at him differently now, the man\n     she once beat while in chains. She takes off her breather.\n\n                              SHAZZA\n               Take it.\n\n                              RIDDICK\n                         (suspicious)\n               What, it's broken?\n\n                              SHAZZA\n               Startin' to acclimate, anyhow. Take it.\n\n     Riddick accepts it awkwardly, sucks down some pure O2. Johns\n     watches the exchange closely, not much liking the idea of Riddick\n     being promoted to oxygen-breathing human.\n\n                              JOHNS\n                         (to Fry)\n               Let's board this up and get the hell gone.\n               They seem to stick to the dark, so if we\n               stick to daylight, should be all --\n\n                              FRY\n               60 years ago.\n\n                              JOHNS\n               Wha'?\n\n     Coring samples line the room, laid out on counters. Fry's been\n     scrutinizing them.\n\n                              FRY\n               Core-samples are dated. Last one is 60\n               years ago. This month.\n\n                              SHAZZA\n               Yeah? What's special about that?\n\n                              FRY\n               Dunno. Maybe nothing, but....\n\n     But now Fry remembers...\n\n\n     INT. LIVING QUARTERS - SETTLEMENT - DAY\n\n     The orrery. The year-counter clicks over to \"45\" as...\n\n     Fry opens the drive box and starts turning the main gear,\n     accelerating the orbits.\n\n     CLOSE on the counter. \"56...57...58...59...60.\"\n\n     They all see it: A giant ringed world eclipses the suns and\n     plunges their planet into darkness. Persistent darkness.\n\n                              JOHNS\n               Are you fuckin' kidding me?\n\n                              RIDDICK\n               Not afraid of the dark, are you?\n\n\n     EXT. SETTLEMENT - DAY\n\n     Crossing the yard in wide strides:\n\n                              FRY\n               ...need those cells from the crash ship.\n               Shit, still gotta check out the hull,\n               patch the wings --\n\n                              JOHNS\n               Let's wait on the power cells.\n\n                              FRY\n               Wait for what? Until it's so dark we\n               can't even find our way back to --\n\n                              JOHNS\n               We're not sure when it happens, so let's\n               not --\n\n                              FRY\n               Get the fucking cells over here, Johns.\n               What's the discussion?\n\n     A beat.\n\n                              JOHNS\n               Ever tell you how Riddick escaped?\n\n\n     INT. SKIFF - DAY\n\n     Alone inside the skiff, Johns and Fry continue with more privacy.\n\n                              FRY\n                         (jarred)\n               He can pilot?\n\n                              JOHNS\n               Hijacked a prison transport, made a\n               helluva good run 'fore I tracked him down.\n\n                              FRY\n                         (with faint hope)\n               Okay, maybe that's a good thing. Maybe I\n               can use him to help with --\n\n                              JOHNS\n               He also figured out how to kill the pilot,\n               Fry.\n\n     A mental shiver.\n\n                              FRY\n               You said we were going to trust him now.\n               You said there was a deal.\n\n                              JOHNS\n               That's what I said.\n\n     He challenges her to read his mind.\n\n                              FRY\n               Oh, this is a dangerous game you're\n               playing, Johns.\n\n                              JOHNS\n               May've noticed chains don't work on this\n               guy. Only way we're truly safe is if he\n               believes he's goin' free. But if he stops\n               believin' --\n\n                              FRY\n               You mean, if he learns that you're gonna\n               royally fuck him over.\n\n                              JOHNS (CONT'D)\n               -- we need a fail-safe. Bring the cells\n               over at the last possible minute -- when\n               the wings are ready, when we know we're\n               ready to launch.\n\n     Fry looks at him with new eyes.\n\n                              FRY\n               You know, he hasn't harmed any of us.\n               Far as I can tell, he hasn't even lied\n               to us. Just stick to the deal, Johns.\n               Let him go if that's what it --\n\n                              JOHNS\n               He's a murderer. The law says he's gotta\n               do his bid.\n\n     Shaking her head, she looks off.\n\n                              FRY\n               Dancin' on razor blades here...\n\n                              JOHNS\n               I won't give him a chance to grab another\n               ship -- or to slash another pilot's throat.\n\n\n     EXT. SKIFF - SETTLEMENT - DAY\n\n     Johns descends the gangway -- and finds Riddick erecting a field\n     table in the shade of the skiff. He seems out of earshot. Now,\n     anyway. As they trade looks, another flu-like shiver runs\n     through Johns.\n\n                              RIDDICK\n               Bad sign. Shakin' like that in this heat.\n\n     Johns moves on. The Chrislams appear, shouldering a roll of\n     Vectran (wing-fabric material). They drop it on the table.\n     Ready to cut bindings, Imam pats his hip for the knife that was\n     just there.\n\n                              RIDDICK\n                         (looking after Johns)\n               I'll cut.\n\n     He has the knife.\n\n\n     EXT. SETTLEMENT - DAY\n\n     As Shazza and Audrey repair the sand-cat.\n\n\n     EXT. SKIFF - DAY\n\n     CLOSE on the knife slicing through the Vectran.\n\n     Riddick hands the trim to Pilgrim #1. CAMERA FOLLOWS as he\n     scampers onto the skiff...balance-beams over wing-struts...and\n     delivers the piece to Imam, who stitches the fabric like an old\n     Berber rug-weaver. Pilgrim #1 pauses to check on...\n\n     The setting blue sun. Nothing unusual. Yet.\n\n\n     INT. SKIFF - DAY\n\n     The hatch closes, seals.\n\n     CLOSE on a monitor. A \"HULL INTEGRITY TEST\" is underway. Fry\n     scans rising pressure gauges.\n\n                              RIDDICK (O.S.)\n               Looks like we're a few shy....\n\n     Fry whirls. Riddick is aboard, staring at the depleted battery\n     bay. And he has Imam's blade.\n\n                              RIDDICK (CONT'D)\n               Power cells.\n\n                              FRY\n               They're coming.\n\n                              RIDDICK\n               Strange, not doin' a run-up on the main\n               drive yet.\n                         (half-beat)\n               Strange unless he told you the particulars\n               of my escape.\n\n                              FRY\n               I got the quick-and-ugly version.\n\n                              RIDDICK\n               An' now you're worried about a repeat of\n               history?\n\n                              FRY\n               Entered our minds.\n\n                              RIDDICK\n               I asked what you thought.\n\n                              FRY\n               You scare me, Riddick. That's what you\n               wanna hear, isn't it? There, I admit it,\n               Can I get back to work now?\n\n     She finds the courage to turn her back on him. Riddick moves\n     closer -- and takes a beat to scan the controls. The cabin\n     pressure builds.\n\n                              RIDDICK\n               Think Johns is an do-right man? You\n               think I can trust him to cut me loose?\n\n     A beat. Does Riddick already know? Is he testing her?\n\n                              FRY\n               Why, what'd you hear?\n\n                              RIDDICK\n               Well, guess if it was trickeration he'd\n               just do me, huh? Then again...I am worth\n               twice as much alive.\n                         (reading her face)\n               Didn't know? Johns ain't a cop. Oh, he's\n               got that shiny badge an' all, but nah --\n               he's just a merc and I'm just a payday.\n               That's why he won't kill me. The creed is\n               greed.\n\n     It knocks her off stride, but...\n\n                              FRY\n               Save it, Riddick. We aren't gonna turn on\n               each other -- no matter how hard you try.\n\n     Riddick moves right up behind her.\n\n                              RIDDICK\n               I don't truly know what's gonna happen\n               when the lights go out, Carolyn -- but I\n               do know that once the dyin' starts, this\n               little psycho family of ours is gonna rip\n               itself apart. So you better find out the\n               truth. Come nightfall, you better know\n               exactly who's standing behind you.\n\n     A monitor chirps the news: \"HULL INTEGRITY --100%.\" EXHALING\n     GASSES, the hatch opens automatically.\n\n                              RIDDICK\n               Oh, ask him 'bout those shakes. And ask\n               why your crew-pal had to scream like that\n               'fore he died.\n\n\n     INT. PRIVATE ROOM - SETTLEMENT - DAY\n\n     CLOSEUPS: Hands select a red-metal shotgun shell from a box...\n     pull the shell open...remove a glass ampule hidden inside...drop\n     the ampule into a injection syringe. The syringe touches an\n     eager arm vein.\n\n                              FRY (O.S.)\n               Who are you? Really?\n\n     Shirt off, Johns looks up. She's in the doorway.\n\n                              FRY (CONT'D)\n               You're not a real cop, are you? Just some\n               mercenary who goes around talkin' about\n               the law like --\n\n                              JOHNS\n               I never said I was.\n\n                              FRY\n               Never said you were a hype, either.\n\n     She moves closer. Rummages through his stuff brazenly. Finds a\n     shitload of red shells with the hidden ampules.\n\n                              JOHNS\n               You have a little caffeine in the morning,\n               I have a little morphine. So what?\n\n                              FRY\n               And here you got two mornings every day.\n               Wow, were you born lucky?\n\n                              JOHNS\n               Not a problem unless you're gonna make --\n\n                              FRY\n                         (lashing)\n               You made it a problem when you let Owens\n               die like that. When you had enough drugs\n               to knock out a fucking mule-team.\n\n                              JOHNS\n               Owens was already dead. His brain just\n               hadn't caught on to that fact.\n\n                              FRY\n               Anything else we should know about you,\n               Johns? Christ, here I am lettin' you play\n               games with our lives when --\n\n     He catches her hands -- and moves them around his body, forcing\n     her into an embrace. We understand why when we see a CLOSEUP\n     of her hands: They find a jagged purple scar beside his spine.\n\n                              JOHNS\n               My first run-in with Riddick. Went for\n               the sweet-spot and missed. They had to\n               leave a piece of the shiv in there. I can\n               feel it, sometimes, pressing against the\n               cord.\n                         (giving her hands back)\n               So maybe the care and feeding of my\n               nerve-endings is my business.\n\n                              FRY\n               You coulda helped. And you didn't.\n\n     O.S., we hear the Chrislams JABBERING ARABIC and calling for\n     \"Captain, Captain....\"\n\n                              JOHNS\n               Yeah, well, look to thine own ass first.\n               Right, \"captain\"?\n\n     It cuts deep.\n\n\n     EXT. SETTLEMENT - DAY\n\n     Fry and Johns move outside. The others have gathered, all eyes\n     gang-locked on...\n\n     An arch in the sky. Luminous, ominous, it grows from the horizon.\n\n                              PARIS\n               What do my eyes see?\n\n                              FRY\n               It's starting....\n\n     They watch hypnotically as the arch rises, inching toward the two\n     suns. Shazza shakes out of the trance first.\n\n                              SHAZZA\n                         (to Fry)\n               If we need anything from the crash ship --\n               I suggest we kick on. That sand-cat's\n               solar.\n\n\n     EXT. SETTLEMENT - DAY\n\n     MULTIPLE SHOTS: Shazza cranking the sand-cat...hands snatching\n     up lights, water, ropes...Chrislams piling aboard the sand-cat.\n\n                              FRY\n               LET'S GET THOSE CELLS!\n\n     Sand-cat moving...Riddick jumping onto the rear bed....Paris and\n     Audrey running, catching up.\n\n                              SHAZZA\n               We stay together! C'mon!\n\n\n     INT. PRIVATE ROOM - SETTLEMENT - DAY\n\n     Johns doubles back, grabs his shotgun shells, swings out the\n     door...\n\n\n     EXT. INCINERATOR - SETTLEMENT - DAY\n\n     ...and catches up to the sand-cat. Riddick reels him aboard.\n\n                              RIDDICK\n               Don't wanna miss this.\n\n                              AUDREY\n               Lookit. Lookit!\n\n     They turn back to see the rim of a giant planet. It's cresting\n     over the horizon. The luminous arch is the planet's rings.\n\n\n     EXT. RIBCAGE - THE GAUNTLET - DAY\n\n     The sand-cat storms through the canyon. As it passes through the\n     massive ribcage...\n\n     The ROLL CAGE SMASHES OUT some low-bridge bones.\n\n\n     EXT. CRASH SHIP - DAY\n\n     The sand-cat reaches the crash ship. Bodies leap off. Paris\n     steals a look at...\n\n     The rising planet. It threatens to blot out suns, sky, universe.\n\n\n     INT. BATTERY BAY - CRASH SHIP - DAY\n\n     Johns yanks the first power cell and starts dragging it over the\n     deck. Riddick yanks a second cell and, carrying it on his\n     shoulder, passes Johns with a suck-my-ass grin. Johns shoulders\n     his cell and stumbles after.\n\n\n     EXT. CRASH SHIP - DAY\n\n     Shazza wheels the sand-cat around, getting clearance between it\n     and the ship.\n\n     The Chrislams lash a scrap-metal sled to the sand-cat.\n\n     Riddick drops the first cell onto the sled, Johns the second.\n     They're racing the eclipse and each other.\n\n\n     EXT. SKY - DAY TO DUSK\n\n     As the rings of the planet eclipse the yellow sun.\n\n\n     EXT. CRASH SHIP - DUSK\n\n     It's like God just closed a blind: Daylight dims. The change in\n     light brings a GROWING HIGH-PITCHED SOUND.\n\n                              FRY\n               Don't stop, don't stop....\n\n     But Paris can't help himself. He squints to see...\n\n\n     EXT. SPIRED HILLS - DUSK\n\n     The spires. THE SOUND seems to come from there.\n\n\n     EXT. SKY - DUSK\n\n     As the rings eclipse the red sun.\n\n\n     EXT. CRASH SHIP - DEEP DUSK\n\n     A second darkness sweeps over the survivors. Now they all stop,\n     beholding...\n\n\n     EXT. SPIRED HILLS - DEEP DUSK\n\n     Something pouring from the spire-tops. Backlit by coronal light,\n     it first seems to be smoke or ash -- but soon we realize these\n     are living things, HATCHLINGS SQUEALING IN DELIGHT over their\n     first nightfall.\n\n\n     EXT. CRASH SHIP - DEEP DUSK\n\n                              JOHNS\n               Jesus, how many can there....\n\n     They keep coming, filling the sky with thick waves. Mercifully,\n     the hatchlings seem to be moving away. But now one wave cleaves\n     from another -- and does a quick about-face.\n\n                              PARIS\n               Just a suggestion, but perhaps we should\n               flee.\n\n                              FRY\n               Cargo hold, everyone in the cargo hold.\n               lesgo, lesgo, lesgo.\n\n     They run. Reach the cargo hold. Turn back to see...\n\n     Riddick and Shazza still coming. Hearing the SQUEALING WAVE\n     descending on them...\n\n     Riddick and Shazza hit to the dirt. Hatchlings torrent just\n     inches overhead.\n\n     CLOSE on Shazza. Horrified. Hard to breathe. Like being\n     underwater.\n\n     CLOSE on Riddick. He watches in awe, no more frightened that a\n     kid lying on his back looking up at the stars. Experimenting, he\n     eases a bone-shiv into the hatchlings. Instantly it's whittled\n     down to nothing. It's like a river of razor blades.\n\n     The hatchling keep coming. Shazza whips a panicky look at the\n     cargo hold. Can she make it? Should she even try?\n\n                              AUDREY\n               Tell her to stay there. Stay down.\n               SHAZZA, JUST STAY DOWN!\n\n     Shazza starts worming toward the cargo hold. Suddenly the\n     hatchings vanish. A beat. Is it safe? Shazza gets to her\n     feet...\n\n                              FRY\n               No, no, NO, NO, NO....\n\n     ...and the wave is back, enveloping Shazza.\n\n\n     INT./EXT. CARGO HOLD - DEEP DUSK\n\n     Standing in the mouth of the cargo container, the others get a\n     last glimpse of Shazza as she flies by the doors, caught up in\n     the funnel-cloud of hatchlings. Then she's simply gone.\n\n\n     EXT. CRASH SHIP - DEEP DUSK\n\n     Still on the ground, Riddick checks left and right like someone\n     about to cross a busy street. Now he gets up, smacks his hands\n     clean, strolls for the hold. Behind him...\n\n     A rising GANG-CLICKING.\n\n     CLOSE on Fry. She knows the sound better than anyone.\n\n\n     EXT. SPIRED HILLS - DEEP DUSK\n\n     The spires are crumbling, torn down from within.\n\n\n     EXT. CRASH SHIP - DEEP DUSK\n\n     Reaching the cargo hold, Riddick turns around for one last look.\n     PUSH IN as he sheds goggles -- and looks at the world with his\n     jaguar eyes.\n\n     RIDDICK'S POV: In degraded image, we see the predators -- adult\n     hatchlings -- emerge from the spires. They're large, mammalian,\n     hammer-headed. They CLICK with echo-location, sounding out the\n     world they haven't inhabited in 60 years.\n\n                              FRY\n               What is it? What's happening?\n\n     RIDDICK'S POV: The predators launch from the hills, gliding,\n     SOUNDING, searching.\n\n                              RIDDICK\n               Like I said. Ain't me you gotta worry\n               about.\n\n\n     EXT. SKY - DEEP DUSK TO NIGHT\n\n     The rim of the planet overtakes both suns. The world goes dark.\n\n\n     INT. CARGO HOLD - NIGHT\n\n     Vault-like DOORS BOOM CLOSED.\n\n     The survivors are locked inside the only secure part of the ship.\n     Somehow they've been reduced to neanderthals huddling in their\n     cave, listening to the howls of the sabertooths.\n\n                              AUDREY\n               What if...what if she's still out there...\n               still alive....\n\n                              JOHNS\n               Well, I don't want to jump to conclusions\n               here...but 'member that boneyard? These\n               just might be the fuckers that killed\n               every other living thing on this planet,\n               okay? Chances of Shazza knockin' on that\n               door anytime soon are just about zero\n               squared.\n\n                              FRY\n                         (agreeing)\n               I saw the cut-marks on the bones. Wasn't\n               a natural die-off.\n\n                              IMAM\n               Quiet, please. Everyone.\n\n     Imam is listening at the cargo door. The others pile up\n     alongside, ears tuned like radar. CLICKING SWEEPS PAST outside.\n\n                              AUDREY\n                         (whispering)\n               Why do they do that? Make that sound?\n\n                              IMAM\n               Perhaps the way they see. With sound,\n               reflecting back.\n\n                              FRY\n                         (realizing)\n               Echo-location. That's what it is....\n\n     Now MORE CLICKING -- behind them. Lights whip around to find...\n\n     Nothing. Only the door of an open container about halfway down\n     the tunnel-like hold.\n\n     A volley of looks. \"How the fuck could one get in here?\"\n\n                              FRY\n               Breach in the hull. I dunno.\n\n     More CLICKING. Johns realizes they expect him to check it out.\n\n                              JOHNS\n               I'd rather piss glass.\n\n                              RIDDICK\n               Well, you got the big gauge.\n\n                              JOHNS\n               Wanna rag your fat mouth?\n\n                              AUDREY\n               Maybe it's just their beads again. Imam,\n               are you still --\n\n                              IMAM\n               No, no, no, I do not believe --\n\n                              JOHNS\n               C'mon, man, you're drivin' everybody\n               bugfuck with those things. Why don't you\n               just lose the goddamn....\n\n     More CLICKING -- along with the sound of TOPPLING CARGO.\n\n                              RIDDICK\n               Big beads.\n\n     Butching up, Johns sucks on his breather and shimmies toward...\n\n     The open container. Leading with his shotgun, he FIRES blindly\n     around the door. Something SQUEALS -- then silence. Johns eases\n     his head and a light around the door to spot...\n\n     Hatchlings on the ground, blasted into dog food.\n\n                              JOHNS\n                         (to others)\n               Okay. We're okay. Just some small ones\n               that musta --\n\n     Something WHOOSHES for his head, swinging like a scythe. It\n     catches his shotgun, DISCHARGING IT, giving us...\n\n     A flash-image of an adult predator. Up close.\n\n     In one thin second, Johns is back with the others.\n\n                              JOHNS\n               Very big beads.\n\n                              PARIS\n               Not staying in here another....\n\n     He goes for the main-door lever, ready to flee into the night.\n     Fry lunges for him.\n\n                              FRY\n               Christ, you don't know what's out there!\n\n                              PARIS\n               I know what's in here!\n\n                              IMAM\n               Everybody come, this way and we should be\n               safe. Hurry, please....\n\n\n     INT. FIRST CONTAINER - CARGO HOLD - NIGHT\n\n     Imam shepherds them into a container. The door slams closed.\n     At first, only the sound of MOUTHS SUCKING BREATHERS. Then a\n     SCRATCHING.\n\n     Johns fumbles with a cutting torch. Gets it burning. Adjusts\n     the gasses to illuminate...\n\n     The door. Scythe-like blades are probing joints. Suddenly HEAVY\n     BLOWS drive everyone back.\n\n                              RIDDICK\n                         (to Johns)\n               Can you do sumpin' else with that?\n               'Sides holding it in my fucking face?\n\n     Taking the hint, Johns starts cutting the common wall between\n     containers. It's a race between the sparks of his cutter and the\n     blades of the predators.\n\n\n     INT. SECOND CONTAINER - CARGO HOLD - NIGHT\n\n     An burn-outline appears in the common wall. Johns kicks out the\n     escape hatch. Audrey speed-crawls through first as...\n\n\n     INT. FIRST CONTAINER - CARGO HOLD - NIGHT\n\n     Predators shred into the container right behind them, CLICKING,\n     sweeping, hunting.\n\n\n     INT. THIRD/FOURTH CONTAINERS - CARGO HOLD - NIGHT\n\n     SERIES OF SHOTS: Again and again, they burn a new escape hatch\n     just as the predators break into the container being vacated,\n     always entering darkness.\n\n\n     INT. FIFTH CONTAINER - CARGO HOLD - NIGHT\n\n     Inside their fifth container now, Johns torches away. Fry and\n     Paris use cargo to block the entrance hole -- then block the\n     cargo with their bodies.\n\n     Riddick adds his weight -- until he notices pepper-shot in the\n     cargo. Suspecting the worst, he leaves the others behind...\n\n                              PARIS\n               Hello, hello?\n\n     ...and moves to the front of the container where darkness\n     prevails. Something SQUISHES underfoot. He slips off goggles.\n\n     RIDDICK'S POV: Of dead hatchlings on the floor. This is the\n     open container, the one where Johns found predators.\n\n     Sensing energy, Riddick lifts his face.\n\n     RIDDICK'S POV: Of an adolescent predator. It squats atop cargo,\n     eating a hatchling. A heavy bone-blade crowns its skull.\n\n     Sensing Riddick, it sweeps the area with INQUISITIVE CLICKS.\n\n     PREDATOR POV: Of Riddick.\n\n     (NOTE: The PREDATOR POV is a crude image that gives impression\n     without detail. We're \"seeing\" what the predator hears with\n     echo-location. Think of a sonagram that strobes and wraps its\n     subject in 3-D space.)\n\n     Oblivious, the others kick out the new escape hatch. Audrey,\n     Fry, and Johns worm through. Imam and Pilgrim #2 hang back.\n     \"Where's Riddick?\"\n\n     He's in a stare-down with a predator.\n\n     Searching, Pilgrim #2 rounds a corner -- and finds his head\n     caught in a vice-like grip.\n\n                              RIDDICK\n               Don't. Move.\n\n     RIDDICK'S POV: As a second predator appears above them. This\n     one reaches down with its scythe blade...\n\n     And gently probes the two men. It wants know what they're made\n     of.\n\n     CLOSE on the pilgrim's shoes. Over-running with piss.\n\n     More blades descend, moving over them like surgical instruments.\n     One test-slices Riddick's shirt.\n\n\n     INT. SIXTH CONTAINER - CARGO HOLD - NIGHT\n\n     In the next container, Fry waits anxiously. Hissing through the\n     escape hatch:\n\n                              FRY\n               Imam? Where are they?\n\n\n     INT. FIFTH CONTAINER - CARGO HOLD - NIGHT\n\n     CLOSE on a predator's scythe blade. It test-slices the pilgrim's\n     skin. Blood wells up. All CLICKING CEASES.\n\n                              IMAM (O.S.)\n               Hasan?\n\n                              FRY (O.S.)\n               Riddick?\n\n     TIGHT on the pilgrim -- more scared now that the clicking has\n     stopped. Losing his nerve, he bolts.\n\n                              RIDDICK\n               No....\n\n     The predators are on him, just blurs in the dark. DEATH-SCREAM.\n\n     RIDDICK'S POV: A third predator appears above him.\n\n     Making his move, Riddick darts around cargo and heads for the\n     escape hatch as...\n\n     Fry's light catches him square in the face. Blinded, Riddick\n     HOWLS and stumbles forward. Fry's light leaps deeper to hit...\n\n     The predator right behind him. With a similar reaction, the\n     beast HOWLS and flails back.\n\n     HOLD on Fry for a time-stopped moment. What stopped it? Was it\n     really her? Suddenly a SHOTGUN EXPLODES beside her head. Jacked\n     up, Johns is BLASTING shadows.\n\n                              FRY\n               Stop it, stop it, STOP IT!\n\n                              JOHNS\n               'Sokay, 'sokay. I killed it.\n\n     They give him a look. \"Sure you did.\" Suddenly a CARCASS SLAMS\n     to the floor, sending everyone jumping back in a perfect splash-\n     pattern. \"Christ, he did kill one.\"\n\n     Fry reclaims her dropped light and beams it on the carcass.\n     Wherever the light strikes it, the flesh chars and steams.\n\n                              FRY\n               There....\n\n                              PARIS\n               Like the light is scalding it.\n\n                              FRY\n               It hurts them. Light actually hurts\n               them....\n\n     VULTURE SOUNDS from the two O.S. adolescents, fighting over the\n     scraps of the pilgrim.\n\n                              IMAM\n               Is that...Hasan?\n\n     Riddick nods.\n\n                              JOHNS\n               We'll burn a candle for him later. C'mon.\n\n\n     INT. SIXTH CONTAINER - CARGO HOLD - NIGHT\n\n     Cargo has been shoved against the door and walls. The survivors\n     gather around Fry's handlight. Audrey -- tough little Audrey --\n     has been reduced to a shivering lump of mush.\n\n                              FRY\n               ...one cutting torch...one handlight here,\n               two more in the cabin...I think two\n               more....\n\n                              PARIS\n               Spirits. Anything over 45 proof burns\n               well.\n\n                              FRY\n               How many bottles?\n\n                              PARIS\n               Not sure. Ten?\n\n                              FRY\n               Those umbrellas, the ones that mist.\n               Would they burn?\n                         (reading his face)\n               If you got a receipt?\n\n                              PARIS\n               Possibly.\n\n                              FRY\n               Awright. So maybe we'll have enough light.\n\n                              JOHNS\n               Enough for what?\n\n     Now she challenges him to be the mind-reader.\n\n                              JOHNS (CONT'D)\n               Oh, lady. If you're in your right mind,\n               I pray you go insane.\n\n                              FRY\n                         (to others)\n               We can stick to the plan. If we get four\n               cells back to the skiff, we're off this\n               rock.\n\n                              PARIS\n               I hate to kill a beautiful theory with an\n               ugly fact, but that sand-cat won't run at\n               night.\n\n                              FRY\n               We'll have to carry the cells...drag\n               them...whatever it takes.\n\n     Troubled faces. Is it just our imagination? Or is the light on\n     the floor growing dimmer?\n\n                              AUDREY\n               You mean...tonight? With all those things\n               still out there?\n\n                              PARIS\n               Oh, sure. Why not? Sounds like a hoot.\n\n                              JOHNS\n               Back it up. How long can this last? Few\n               minutes? Couple hours?\n\n     No one knows for sure.\n\n                              IMAM\n               I had the impression...from the model...\n               that the two planets were moving as one.\n               That there would be...a lasting darkness.\n\n                              JOHNS\n               Those suns gotta come back sometime. And\n               if these animals really are phobic about\n               light, we just sit tight till then.\n\n                              FRY\n               I'm sure that's what someone else said.\n               Locked inside that coring room.\n\n     A persuasive thought. Eyes swing back to Audrey.\n\n                              JOHNS\n               Look, we gotta think about everyone now --\n               the kid especially. How scared is she\n               gonna be out there?\n\n                              FRY\n               Oh, don't use her like that, for a smoke\n               screen.\n\n                              JOHNS\n               Smoke screen for what?\n\n                              FRY\n               For your own fear.\n\n                              JOHNS\n                         (eyes narrowing)\n               Hey. Why don't you rag your hole for two\n               seconds and let someone else come up with\n               a plan that doesn't involve MASS SUICIDE?\n\n     Two seconds pass.\n\n                              FRY\n               How much you weigh, Johns?\n\n                              JOHNS\n               What the hell's it matter?\n\n                              FRY\n               How much?\n\n                              JOHNS\n               79 kilos.\n\n                              FRY\n               Because you're 79 kilos of gutless white\n               meat, and that's why you can't come up\n               with a better plan.\n\n     He makes a move for her. Riddick blocks. Johns' shotgun bumps\n     the underside of Riddick's chin.\n\n                              RIDDICK\n               Think about that reward, Johns.\n\n                              JOHNS\n               I'm willing to take a cut in pay.\n\n                              RIDDICK\n               How 'bout a cut in your gut?\n\n     Johns looks down. CAMERA DROPS to reveal the shiv Riddick holds,\n     poised for evisceration.\n\n                              JOHNS\n               Oh, Trash Baby, you're gonna regret this.\n\n                              IMAM\n               Please...this solves nothing...please....\n\n     Johns backs off first. The light grows dimmer.\n\n                              FRY\n                         (to Audrey)\n               They're afraid of our light. That means\n               we don't have to be so afraid of them.\n\n                              IMAM\n               And you're certain you can find the way\n               back? Even in the dark?\n\n                              FRY\n               No, I'm not. But he can.\n\n     She's pointing, of course, to Riddick.\n\n\n     EXT. PLANET - NIGHT\n\n     The eclipsing planet dominates half the sky. In whatever coronal\n     light remains, we see clouds forming.\n\n\n     EXT. CRASH SHIP - NIGHT\n\n     Cargo doors crack open. Mixed for maximum flame, the cutter is\n     pushed outside and swept around. Fry appears behind it.\n\n     Moving like hostages, the survivors cross open ground, trying not\n     to heed the PRIMAL SOUNDS beyond their light. Soon they reach...\n\n     The main cabin. Blackness inside.\n\n                              FRY\n               Riddick.\n\n     He lifts his goggles.\n\n     RIDDICK'S POV: Checking the cabin. Finding a lot of wreckage\n     but no life.\n\n                              RIDDICK\n               Looks clear.\n\n     Johns shoulders ahead and crawls in first. Just as he stands up\n     inside...\n\n     A PREDATOR BUZZSAWS over his head, fleeing the cabin, taking off\n     into the night.\n\n                              JOHNS\n               Fuck me. You said \"clear.\"\n\n                              RIDDICK\n               Said \"looks clear.\"\n\n                              JOHNS\n               Well, what's it look like now?\n\n                              RIDDICK\n                         (rechecking)\n               Looks clear.\n\n                              FRY\n               Just get the goddamn lights on....\n\n     They scramble aboard. Riddick TONGUE-CLICKS behind Johns.\n     He isn't amused.\n\n\n     INT. MAIN CABIN - CRASH SHIP - NIGHT\n\n     PREP MONTAGE: We see the survivors powering up cabin lights...\n     yanking three more cells from the battery bay...threading nylon\n     cord through Paris' misting umbrellas, filling the reservoirs\n     with high-octane liquor...swapping out O2 canisters.\n\n\n     INT. MAIN CABIN - CRASH SHIP - NIGHT\n\n     Reloading his shotgun, Johns finds himself shaking again. He\n     unpockets a shell -- a red morphine shell -- and gives it a\n     lover's look. Behind him...\n\n                              FRY\n               Ready, Johns.\n\n     He palms the shell.\n\n                              JOHNS\n               He'll lead you over the first cliff.\n               You know that, don't you?\n\n                              FRY\n               We're just burnin' light here.\n\n                              JOHNS\n               You give him the cells and the ship --\n               and he will leave you. He will leave you\n               all out there to die.\n\n                              FRY\n               I don't get it, Johns. What is so goddamn\n               valuable in your life that you're worried\n               about losing? Huh? Is there anything at\n               all? Besides your next hype?\n                         (no response)\n               Got no right to be so scared. Neither one\n               of us.\n\n\n     INT. BATTERY BAY - CRASH SHIP - NIGHT\n\n     As hands yank the last power cell.\n\n\n     INT. MAIN CABIN - CRASH SHIP - NIGHT\n\n     Cabin lights die. Still brooding, Johns finishes loading his\n     shotgun in the dark.\n\n\n     EXT. CRASH SHIP - NIGHT\n\n     CLOSE on a burning wick. Alcohol mist shoots across the flame to\n     create...\n\n     A FIREBALL. Two umbrella torches, fabric already burned away,\n     BELCH FIREBALLS into the night. By this light and more, we see...\n\n     Imam chained into the first harness of the drag-sled. Beside\n     him, Johns fumbles with a second harness. Hands help him into\n     the chains. The hands belong to...\n\n     Riddick. Both men recognize the irony of the prisoner helping\n     his captor into chains.\n\n                              FRY\n                         (to all)\n               Keep the light going. That's all we have\n               to do to live through this. Just keep\n               your light burning.\n\n     Riddick loops a handlight over his neck, places it to shine light\n     down his back. A beacon.\n\n                              RIDDICK\n                         (to Fry)\n               Be runnin' about 10 paces ahead. I want\n               light on my back -- but not in my eyes.\n               And check your cuts. These things know\n               our blood now.\n\n     CLOSE on Audrey. Overhearing, she goes stone-faced.\n\n                              FRY\n               Riddick...was thinkin' we should make some\n               kind of deal. Just in case, you know,\n               this actually --\n\n                              RIDDICK\n                         (shaking head)\n               Had it with deals.\n\n                              FRY\n               But I just wanted to say --\n\n                              RIDDICK\n               Nobody's gonna turn a murderer loose.\n               I fuckin' knew better.\n\n     It worries Fry. \"If he doesn't expect to go free....\"\n\n                              RIDDICK (CONT'D)\n               Been a long time since anyone's trusted\n               me. That's somethin' right there.\n\n                              FRY\n               We can, can't we? Trust you?\n\n                              RIDDICK\n               Actually...\n                         (completely genuine)\n               That's what I been askin' myself.\n\n     He walks away. HOLD on Fry -- wondering if she hasn't made a\n     terrible, terrible mistake.\n\n\n     EXT. NIGHT\n\n     The drag-sled begins moving.\n\n     SERIES OF TRACKING SHOTS: Riddick running point, goggles off,\n     eyes flashing. Johns and Imam pulling the drag-sled like\n     malamutes, handlights sweeping. Pilgrims #1 at the first side-\n     guard position, Fry and Audrey at the second, each position\n     carrying an umbrella torch, FIREBALLS BLAZING. Paris stumbling\n     along at rear-point, sweeping the cutter back and forth, every\n     shadow a threat. They are a train of light.\n\n     CLOSE on the sled. Holding four power cells and eight bottles\n     of booze.\n\n     CLOSE on Fry. Looking down. Noting sand-cat tracks underfoot.\n\n\n     EXT. NIGHT\n\n     Below us run the survivors. CRANE UP AND AWAY so that their\n     lights become insignificant...so that we include, in FOREGROUND,\n     the silhouettes of gliding predators. They're following from\n     above, awaiting their chance.\n\n\n     EXT. NIGHT\n\n     FRY'S POV: Of the ground. The sand-cat tracks have vanished.\n\n                              JOHNS\n               So you noticed too?\n\n                              FRY\n               Riddick. Riddick.\n\n     The procession grinds to a halt. Everyone sucks hard on\n     breathers as they muster inside the light.\n\n                              FRY\n               Where are the sand-cat tracks? Why aren't\n               we still following them?\n\n                              RIDDICK\n               Saw something I didn't like.\n\n                              JOHNS\n               Such as.\n\n                              RIDDICK\n               Hard to tell, sometimes...even for me...\n               but looked like a bunch of those big boys\n               chewin' each other's gonads off. Thought\n               we'd swing wide. Okay by you?\n\n     Paris looks over his shoulder. \"We went around what?\" Nearby\n     CLICKING breaks up the confrontation.\n\n                              FRY\n               Let's move.\n                         (to Audrey)\n               Just a detour. He'll get us there.\n\n                              PARIS\n               Can we switch?\n\n                              FRY\n               What, switch what?\n\n                              PARIS\n               I think I twisted my ankle running\n               backwards like that. And I'm not sure I\n               can....\n                         (off their stares)\n               Okay, that's a lie. I just don't want to\n               be alone back there anymore. If you could\n               just give me a few minutes up front here --\n\n                              JOHNS\n               She's the pilot, she should stay close to\n               the cells.\n\n                              PARIS\n               Oh, so I'm disposable?\n\n                              FRY\n               I'll switch, I'll switch! Christ, just\n               get this train moving!\n\n\n     EXT. NIGHT\n\n     They trundle on, Fry the new tail-gunner.\n\n     At side guard, Paris relaxes a bit -- even though the CLICKING\n     never seems far from earshot. A weak FIREBALL SPEWS from his\n     torch. He checks the reservoir. Almost empty.\n\n                              PARIS\n               Light, please, need light here....\n\n     Still moving, Johns and Imam train lights on Paris while he\n     refuels. For a brief moment, Audrey strays from the light.\n\n     PREDATOR'S POV: Dive-bombing the girl.\n\n     A HIGH-VELOCITY CLICKING: It's like an incoming missile. Imam\n     lunges at the last nanosecond...\n\n     And flattens Audrey to the ground. Scythe blades swing...\n\n     CHINKING the harness-chains on Imam's back.\n\n     Johns whirls, BLASTS. Light-beams leap around. But the predator\n     is long gone.\n\n                              IMAM\n                         (trembling)\n               Please...have we been cut? Can someone\n               tell me if....\n\n     He finds his dropped light, thumbs the switch again and again.\n     Broken.\n\n     In the confusion, Paris has been left in the dark. Something\n     slashes him from behind. It's like the night has claws.\n\n                              PARIS\n               Oh, sweet Jesus....\n\n     The bottle drops.\n\n     The blood flows.\n\n     The CLICKING STOPS.\n\n                              PARIS\n               Oh, sweet Jesus, WILL YOU GET ME SOME\n               LIGHT OVER HERE!\n\n     Faces whip around. But before their lights can rescue him...\n\n     Paris is gone, snatched away by a swooping blur.\n\n     Light-beams jump fitfully, vainly.\n\n     RIDDICK'S POV: Of predators feasting on Paris. Carrying a\n     youngling on its back, a female predator arrives late and can't\n     find a place at the trough. With shocking apathy, it whips the\n     youngling off its back and begins devouring it. Other predators\n     start in-fighting, killing themselves for food. POV PANS to a\n     pair of predators, closer, SOUNDING out new prey. POV PANS\n     AGAIN to include the object of their desire. Audrey.\n\n     CLOSE on Riddick. Trying to figure it out.\n\n     CLOSE on Audrey. Listening to the HORRIFIC FEEDING SOUNDS.\n     Oblivious to all the attention she's getting.\n\n                              FRY\n               What do you see? Riddick?\n\n                              RIDDICK\n               Hunger. I see 60 years of hunger.\n\n\n     EXT. SKY - NIGHT\n\n     As clouds mass.\n\n\n     EXT. NIGHT\n\n     Into a rising wind, the survivors range on.\n\n     Audrey now carries Paris' torch, refueled and COUGHING FIREBALLS\n     at regular intervals. Fry seems to be handling rear-point fairly\n     well, until...\n\n     The cutter sputters and dies. She ditches it and takes the torch\n     from Audrey.\n\n                              FRY\n               Bottle-count.\n\n                              AUDREY\n               Four fulls, one half. That mean we're\n               halfway there? I hope?\n\n     Good question. They've just been blindly following...\n\n     The light on Riddick's back.\n\n                              FRY\n               Can we pick up the pace?\n\n     Working like a mule, Johns growls to himself. \"If you think you\n     can do better....\" Abruptly he slaps an arm across Imam's chest,\n     spotting...\n\n     A sled-track. In front of them.\n\n     Fry hears a SHOTGUN RATCHET. She spins to see...\n\n     Johns out of his chains. Moving forward. Jamming the shotgun\n     into the back of Riddick's neck.\n\n                              JOHNS\n               We aren't completely stupid.\n\n                              FRY\n               Stay in the light! Everybody! Stay in\n               the fucking --\n\n                              IMAM\n               We crossed our own tracks.\n\n                              JOHNS\n               He's running us 'round in circles. Look\n               for yourself. Look!\n\n                              FRY\n               Riddick? What the hell are you --\n\n                              RIDDICK\n               Listen.\n\n     Imagine a hundred Geiger-counters next to a truckload of\n     plutonium. That's the SOUND that rides the wind now.\n\n                              RIDDICK\n               Canyon ahead. I circled once to buy some\n               time to think.\n\n                              FRY\n               Think about what?\n\n                              JOHNS\n               About how to kill us and still get these\n               cells to the skiff. Goddamnit, we're just\n               doin' the heavy lifting for this prick!\n\n                              RIDDICK\n                         (answering Fry)\n               About the girl.\n\n                              FRY\n               What about her?\n\n                              RIDDICK\n               What it's gonna be like when we hit that\n               canyon. With her bleeding.\n\n                              JOHNS\n               What're you jaw-jackin' about? Girl's not\n               cut.\n\n                              RIDDICK\n                         (agreeing)\n               No. She's not.\n\n     It hits Fry like a two-by-four. She looks at Audrey.\n\n                              AUDREY\n                         (confessing)\n               I didn't want you to leave me there...\n               back at the ship...that's why I didn't\n               say anything....\n\n                              FRY\n               No, we'd never....Oh, God, honey, you\n               shoulda told me sooner.\n\n                              JOHNS\n                         (finally getting it)\n               Aw, this can't be happening to me....\n\n                              RIDDICK\n               They been nose-open for her ever since we\n               left. They go off blood.\n\n                              IMAM\n               Well...we must keep her close, then.\n               Here, she'll be safe if we put her\n               between --\n\n                              RIDDICK\n                         (scanning)\n               There is no \"safe.\"\n\n     An epic beat. The wind gusts...the FLAMES CHATTER...their ears\n     fill with CANYON SOUNDS.\n\n                              FRY\n               It's not gonna work. We gotta go back.\n\n     Johns brays.\n\n                              JOHNS\n               Hey, you're the one who got me out here,\n               turned me into a goddamn sled dog. An'\n               now you 'spect me to go back like a\n               whipped dog?\n\n                              FRY\n               I was wrong. I admit it. My bad, okay?\n               Now let's just go back to the ship.\n\n                              JOHNS\n               I dunno. Nice breeze, wide open spaces --\n               you know, I'm startin' to enjoy myself out\n               here.\n\n                              FRY\n               Are you fucking high again? Just listen\n               to --\n\n                              JOHNS\n               No, no, you're right, Fry. What's to be\n               afraid of? My life is a steamin' pile of\n               meaningless toadshit anyhow. So I say\n               mush on! Canyon's only couple hundred\n               meters, after that we're in Skiff City!\n               So why don't you just butch up, stuff a\n               cork in that kid, and get --\n\n                              IMAM\n               She's the captain, we should listen to --\n\n                              JOHNS\n               Listen to her? Her? When she was willing\n               to sacrifice us all?\n\n     A beat. Eyes turn to Fry. She wants to protest -- but can't.\n\n                              AUDREY\n               What's he talkin' about?\n\n                              JOHNS\n               During the crash, she --\n\n                              FRY\n                         (a warning growl)\n               This does not help us, Johns.\n\n                              JOHNS\n               -- she tried to blow the whole fucking\n               passenger cabin, tried to kill us --\n\n                              FRY\n               Just shut up, okay?\n\n                              JOHNS\n               -- tried to kill us in our sleep. Paris\n               had it right -- we are disposable. We're\n               just walking ghosts to her.\n\n                              FRY\n               Would you RAG YOUR STUPID HOLE!\n\n     She rushes him, ready to rip his eyes out. He shunts her aside.\n\n                              JOHNS\n               We're not alive because of her -- we're\n               alive in spite of her.\n\n     He swung below the belt -- and connected. Fry's chin quakes,\n     her knees fail. The undertow of events finally pulls her down.\n\n                              FRY\n               We cannot go through there....\n\n                              JOHNS\n                         (lording)\n               How much you weigh right now, Fry? Huh?\n\n                              IMAM\n                         (pushing him back)\n               Fine, fine, you've made your point. We\n               can all be so scared as you.\n\n     Johns snatches a light away from Imam.\n\n                              JOHNS\n                         (to all)\n               Verdict's in. The light moves forward.\n\n\n     EXT. BONEYARD - NIGHT\n\n     They trudge on, slower now, building reserves for the canyon-run.\n     At rear-point, Fry follows like a broken rudder. Pilgrim #1 now\n     draws the sled with Imam. And up ahead...\n\n\n     EXT. BONEYARD - NIGHT\n\n     Johns falls in step with Riddick.\n\n                              JOHNS\n               Ain't all of us gonna make it.\n\n                              RIDDICK\n               Just realized that, huh?\n\n     CLICKING nearby. Johns BLASTS the night, driving the sound\n     away -- and reminding everyone of who carries the Big Gauge.\n\n                              JOHNS\n               Six of us left. If we could get through\n               that canyon and lose just one, that'd be\n               quite a fucking feat, huh? A good thing,\n               right?\n\n                              RIDDICK\n               Not if I'm the one.\n\n                              JOHNS\n               What if you're one of five?\n\n     Riddick stares. \"I'm listening.\"\n\n\n     EXT. BONEYARD - NIGHT\n\n                              AUDREY\n               What're they doin' up there?\n\n                              IMAM\n               Talking about the canyon, I suppose.\n               How to get us through.\n\n     Overhearing, Fry looks. It's odd to see Johns and Riddick\n     walking side by side, like equals. Like partners.\n\n\n     EXT. BONEYARD - NIGHT\n\n                              JOHNS\n               Look, it's hellified stuff -- but no\n               different than those battlefield doctors\n               when they have to decide who lives and who\n               dies. It's called \"triage,\" okay?\n\n                              RIDDICK\n               Kept calling it \"murder\" when I did it.\n\n                              JOHNS\n               Either way, figure it's something you can\n               grab onto.\n\n                              RIDDICK\n                         (doping it out)\n               Sacrifice play. Hack up one body, leave\n               it at start of the canyon. Like a bucket\n               of chum.\n\n                              JOHNS\n               Trawl with it. There's a cable on the\n               sled. We can drag the body behind us.\n\n                              RIDDICK\n               Nice embellishment.\n\n                              JOHNS\n               Don't wanna feed these land-sharks -- just\n               keep 'em off our scent.\n\n                              RIDDICK\n                         (looking back)\n               So which one caught your eye?\n\n                              JOHNS\n               Don' look, don' look, don' look....\n\n\n     EXT. BONEYARD - NIGHT\n\n     Fry spots Riddick's look -- and Johns' non-look.\n\n                              FRY\n               Imam. Slow down.\n\n                              IMAM\n               What?\n\n                              FRY\n               Don't stop, just slow down.  Little more\n               space 'tween us and them.\n\n                              IMAM\n               I would rather we all stay--\n\n                              FRY\n               Do what I say. Please.\n\n\n     EXT. BONEYARD - NIGHT\n\n                              RIDDICK\n               What's her name, anyway?\n\n                              JOHNS\n               What do you care?\n\n     Riddick shrugs. \"I don't.\"\n\n                              JOHNS\n               Then let's not name the Thanksgiving\n               turkey, okay? I assume you still got a\n               shiv.\n\n                              RIDDICK\n               What, you 'spect me to do it?\n\n                              JOHNS\n               What's one more to you? Like this is the\n               one that sends you to Hell?\n\n                              RIDDICK\n               Oh, you're a piece of art, Johns. They\n               oughtta hang you in a museum somewhere.\n               Or forget the museum -- maybe they should\n               just hang you.\n\n\n     EXT. BONEYARD - NIGHT\n\n     As Fry and the others keep slowing.\n\n\n     EXT. BONEYARD - NIGHT\n\n                              JOHNS\n               Awright. You do the girl, I'll keep the\n               others off your back.\n\n     Riddick stops. Reconsiders.\n\n                              JOHNS (CONT'D)\n               Aw, don't tell me you're growin' scruples.\n\n                              RIDDICK\n                         (shakes head)\n               Just wonderin' if we don't need a bigger\n               piece of chum.\n\n                              JOHNS\n               Like who, Mr. Chrislam?\n\n     EXTREMELY TIGHT on both men: In their eyes, we see the new\n     partnership splintering apart: \"Like Mr. Johns.\"\n\n     Riddick makes a play for the shotgun. It BLASTS skyward.\n\n\n     EXT. BONEYARD - NIGHT\n\n     As the fight erupts:\n\n                              FRY\n               Bring the light!\n\n                              AUDREY\n               What're they doing? What're we --\n\n                              FRY\n               Leave the sled, let's go, go, go!\n\n\n     EXT. BONEYARD - NIGHT\n\n     FIGHT SCENE: Johns' light hits the ground, creating an arena of\n     illumination. FAST CLICKING nearby. Still struggling, Riddick\n     and Johns somehow manage to gang-aim the shotgun and BLAST THE\n     CLICKING AWAY.\n\n     The shotgun goes free. Johns lunges for it, but Riddick kicks it\n     into the night. And then pulls his shiv.\n\n                              RIDDICK\n               Gotta stay in the light, Johns. That's\n               the only rule.\n\n     Johns circles inside the light. Fucking with him, Riddick starts\n     poking and jabbing, backing him up against the wail of dark.\n     Johns stumbles over something. A bone. A club.\n\n     Riddick finds his own bone-club, and now they go at it like two\n     cavemen. Riddick beats on Johns' club-hand, breaking fingers,\n     forcing him to drop the bone. Just trying to get away now, Johns\n     makes a desperate lunge for the light, but...\n\n     Riddick shivs open his back.\n\n                              RIDDICK\n               Remember that moment?\n\n     Gushing blood, Johns starts crawling pathetically with the light.\n     Riddick dogs him.\n\n                              RIDDICK\n               Shoulda never took the chains off, Johns.\n               You were one brave fuck, before. Now look\n               at you. Oh, yeah, you were Billy Bad-ass\n               with your gauge...with your chains....\n\n     Johns finds the shotgun. \"And I'm still Billy Bad-ass.\" He\n     sweeps it around with the light, ready to kill...\n\n     Blackness. Where'd Riddick go?\n\n     CLICKING behind Johns. He whirls to see...\n\n     Something big coming for him. Johns BLASTS IT back into the\n     night, dropping the light as he does. Eyes in the back of his\n     head, he whirls again and takes aim on...\n\n     Another bull-rushing predator.\n\n     Johns triggers a bad round. Crazed, he ratchets and levels the\n     shotgun for another try. He's too late.\n\n     BIG CLOSEUP as the ejected shell rolls to a stop. It's red.\n     Johns loaded a morphine shell in the dark.\n\n     RIDDICK'S POV: With Johns skewered by the armpits, the predator\n     lifts him off the ground and \"stares\" with a deceptively gentle\n     CLICKING-COOING SOUND.\n\n     PREDATOR'S POV: Of Johns' final expression.\n\n     RIDDICK'S POV: The predator rears back its head -- then slams\n     forward, hitting Johns with the full force of its skull-blade,\n     splitting him in two.\n\n\n     EXT. NIGHT\n\n     Fry, Imam, Audrey, Pilgrim #1. They're running, stumbling,\n     trying to backtrack the sled marks. Checking for pursuit, Fry\n     looks over her shoulder...\n\n     And crashes into Riddick. He was just standing in the dark,\n     waiting for them.\n\n                              RIDDICK\n               Back to the ship, huh?\n\n                              FRY\n               Get out of our way.\n\n                              RIDDICK\n               So everybody huddles together till the\n               lights burn out? Until you can't see\n               what's eating you? That the big plan?\n\n                              IMAM\n               Where's Mr. Johns?\n\n                              RIDDICK\n               Which half?\n\n                              IMAM\n               You mean....\n\n     Conflicted, they all look back. Audrey starts to puddle up.\n\n                              AUDREY\n               Gonna lose everybody out here....\n\n                              RIDDICK\n               He died fast. And if we got any choice,\n               that's the way we should all go out.\n                         (to Audrey, softly)\n               Don't you cry for Johns. Don't you dare.\n\n\n     EXT. CANYON RIM - THE GAUNTLET - NIGHT\n\n     BLACK SCREEN. We hear the canyon in full cry now -- CLICKING...\n     BATTLING BONE-BLADES...MATING CRIES...the RENDING OF FLESH\n     and SNAPPING OF TENDON. Far below, twin flames appear as the\n     survivors reach the gauntlet. Predators perch in FOREGROUND,\n     just hulking silhouettes \"watching\" from a canyon rim.\n\n\n     EXT. START OF GAUNTLET - NIGHT\n\n     They are but five: Fry, Riddick, Audrey, Imam, and Pilgrim #1.\n     CLOSE on each face as they listen to the CANYON. There must be\n     countless predators ahead.\n\n                              FRY\n               How many you see?\n\n                              RIDDICK\n               One or two.\n\n                              FRY\n               Audrey?\n\n                              AUDREY\n               Three full bottles. But almost time to\n               refill.\n\n                              FRY\n               Doesn't seem like enough to turn back on,\n               does it?\n\n                              RIDDICK\n               Only see one way. Turn the sled over and\n               drag it like that, girl down low. Light\n               up everything we got -- and run through\n               like dogs on fire.\n\n     A beat.\n\n                              IMAM\n                         (understanding)\n               The sled as a shield....\n\n                              FRY\n               And what about the cells?\n\n                              RIDDICK\n               I'll take those.\n\n     She looks at him hard.\n\n                              FRY\n               We're just here to carry your light,\n               aren't we? Just the torch-bearers.\n\n                              RIDDICK\n               Let's drop back an' boot up.\n\n\n     EXT. BONEYARD - NIGHT\n\n     START on the power cells. They're been lashed together into one\n     queue.\n\n     Working amid the giant bones, Riddick crafts a new harness from\n     the old straps. Close behind him, Imam is MUTTERING IN ARABIC.\n\n                              RIDDICK\n               What're you doin'?\n\n                              IMAM\n               Blessing you like the others.\n                         (off his look)\n               It's painless.\n\n                              RIDDICK\n               And pointless.\n\n                              IMAM\n                         (a beat)\n               I see. Well, even if you don't believe\n               in God, it doesn't mean He won't be --\n\n                              RIDDICK\n               You don't see.\n\n     Riddick shrugs into the harness, snugs it down.\n\n                              RIDDICK (CONT'D)\n               'Cuz you don't spend half your life in\n               lock-down with a horse-bit in your mouth\n               and not believe. And you surely don't\n               start out in a liquor store trash bin with\n               an umbilical cord wrapped around your neck\n               and not believe. Oh, absolutely I believe\n               in God. And I absolutely hate the fucker.\n\n                              IMAM\n               He will be with us. Nonetheless.\n\n                              RIDDICK\n               Give my blessing to the girl. She needs\n               a spare.\n\n\n     EXT. START OF GAUNTLET - NIGHT\n\n     The torches. Maxed out. Burning non-stop.\n\n     Fry and Imam. Sled chains on. Lapping up O2. Each holding a\n     torch.\n\n     Pilgrim #1. Clutching a handlight.\n\n     Audrey. Rolling under her sled-shield, becoming the turtle in a\n     metal carapace.\n\n     Riddick. Goggles on. He has no desire to see what horrors will\n     surround them. There's just one path, anyway: Straight through.\n\n                              RIDDICK\n               As fast as you can.\n\n                              FRY\n               You sure you can keep --\n\n                              RIDDICK\n               As fast as you can.\n\n\n     EXT. THE GAUNTLET - NIGHT\n\n     SLEW OF SHOTS: Fry and Imam on the move, dragging the shield\n     fast. Audrey speed-crawling beneath. Pilgrim #1 tripping along\n     behind the shield. And Riddick behind them all, face already\n     tortured, pulling 200 pounds of stubborn-mule cargo -- yet\n     somehow keeping pace. The torch flames, stretched by the wind,\n     flank them in fire.\n\n\n     EXT. CANYON RIM - THE GAUNTLET - NIGHT\n\n     As predators launch from the rim.\n\n\n     EXT. THE GAUNTLET - NIGHT\n\n     First come the hatchlings, streaming right into their faces --\n     then veering away at the last second, repulsed by light. Next\n     come FERAL SOUNDS overhead.\n\n                              RIDDICK\n               Don't look.\n\n     Thin blue liquid spatters them.\n\n                              RIDDICK\n               Do not look up.\n\n     More spattering. Fry looks up -- and stumbles when she beholds...\n\n     A ceiling of predators. At the cusp of light, they dive and\n     weave and dart, slashing each other in a rabid desire to SOUND\n     OUT the humans below. It's like looking into a bucket of angry\n     eels.\n\n                              RIDDICK\n               Keep going, keep going, keep going,\n               keep going!\n\n     His voice whips them like the Devil's coxswain. Chastened, Fry\n     keeps her eyes down and speed up.\n\n     More blue blood showers down -- followed by entrails dropping\n     out of the sky. Could this be Hell itself?\n\n                              IMAM\n                         (a muttered mantra)\n               \"So dark the clouds around my way\n                    I cannot see,\n               But through the darkness I believe\n                    God leadeth me.\n               I gladly place my hand in His when\n                    all is dim,\n               And, closing my weary eyes, lean\n                    hard on him....\"\n\n     Now WHOLE CORPSES ARE CRASHING DOWN around them, victims\n     of in-fighting. Fry and Imam start slaloming through the ghastly\n     mess.\n\n     Pilgrim #1 passes too close to a corpse: A blade slices his leg,\n     drawing blood. He keeps his mouth shut.\n\n\n     EXT. CHOKE-POINT - THE GAUNTLET - NIGHT\n\n     The passage narrows into a choke-point. Fry sees it first.\n\n                              FRY\n               Riddick? RIDDICK?\n\n     Ahead, a clot of dead predators blocks the canyon.\n\n                              AUDREY\n               What? What is it?\n\n                              RIDDICK\n               It's a fucking staircase! Go over it!\n               GO OVER IT!\n\n     Steeling themselves, they start climbing.\n\n     But Audrey, on all fours, has to discover the corpses with her\n     hands. Then, taking exception at being walked on...\n\n     One \"corpse\" snaps at her. Audrey recoils sideways...\n\n     And tumbles down the mound of corpses. She's exposed.\n\n     PREDATORS' POV: Rapid-fire images of Audrey. Flashes from 10\n     different predators.\n\n                              FRY\n               Audrey!\n\n     Audrey shakes out of it and scrambles for the shield just as...\n\n     A predator kamikazes onto the shield, its bone-blades piercing\n     the metal...\n\n     And nearly skewering Audrey beneath.\n\n     Caught in torchlight, steaming, the PREDATOR HOWLS as it tries\n     to rip free of the shield.\n\n     Beneath, Audrey hangs on and takes a thrashing.\n\n     The predator tears clear, spins, pounces blindly at...\n\n     Riddick, standing at light's edge. Stunningly, he catches the\n     beast under its scythe blades, blunting the attack. The predator\n     CLICKS MADLY at him.\n\n     PREDATOR'S POV: Of Riddick's face.\n\n     The predator rears back its head, ready to bisect Riddick with\n     its skull-blade.\n\n     Switchblade fast, Riddick drops a hand...\n\n     ...yanks his shiv...\n\n     ...and sweeps it over the belly of the beast. HOWLING, the\n     predator falls, disemboweled.\n\n     REACTION SHOTS of Fry and Imam. Stunned.\n\n                              RIDDICK\n               Didn't know who he was fuckin' with.\n\n     They regroup. Imam's head swivels back and forth: They're one\n     person short.\n\n                              IMAM\n               Suleiman!\n\n                              RIDDICK\n               Get the girl back under. Keep going.\n\n                              IMAM\n               SULEIMAN!\n\n                              RIDDICK\n               KEEP GOING OR I WILL!\n\n     Suddenly Pilgrim #1 reappears, thrust back into the light by\n     unseen forces. He's still alive -- but shouldn't be. He makes\n     a feeble attempt to grab onto Imam, to anyone, but he's gone\n     again before they can even react, jerked out of the light. Out\n     of existence.\n\n\n     EXT. THE GAUNTLET - NIGHT\n\n     They flail on. And now, finally...finally....\n\n     The canyon widens, opening up like some door to Heaven. The\n     WORST SOUNDS fall behind. We can see it in their sweat-sheened\n     faces: The faintest hope that maybe they've survived the Seventh\n     Circle of Hell. But then...\n\n     The TORCHES SPIT AND SPUTTER.\n\n     Audrey hears PATTERING on the metal shield.\n\n     Blood falls anew.\n\n     One torch dies -- yet somehow comes back to life.\n\n     Imam upturns a hand, checking the liquid for color. But this\n     blood has no hue.\n\n                              FRY\n               Oh, no. No, no, no....\n\n                              IMAM\n               Rain.\n\n\n     EXT. THE GAUNTLET - NIGHT\n\n     RAIN MONTAGE: Water rilling, running, flowing over rocks and\n     ground.\n\n\n     EXT. THE GAUNTLET - NIGHT\n\n     Caught in a downpour, the survivors slog to a stop. One torch\n     goes out -- and won't relight.\n\n                              RIDDICK\n               So where the hell's God now, huh?\n                         (no answer from Imam)\n               I'll tell you where! He's up there\n               PISSING ON ME!\n\n                              FRY\n               Riddick? How close?\n\n     Riddick sheds goggles to look ahead. We don't know what he\n     sees -- nor what he's thinking.\n\n                              FRY\n               Tell me the settlement is right there!\n               RIDDICK, PLEASE!\n\n                              RIDDICK\n               We can't make it.\n\n     HOLD on Fry's anguished face, rendered in dying torchlight.\n     Somewhere behind, the AWFUL SOUNDS RETURN.\n\n                              RIDDICK\n               Here...hide here....\n\n     He's found a crevice in the canyon wall.\n\n                              RIDDICK\n               Inside...inside....\n\n\n     EXT. CREVICE - THE GAUNTLET - NIGHT\n\n     They crawl into the fissure. The second torch dies behind them.\n\n\n     EXT. THE GAUNTLET - NIGHT\n\n     There's just one light left now -- the one Riddick wears on his\n     back. By its glow, we watch him lift the shield, muscle it over\n     to the crevice...\n\n\n     EXT. CREVICE - THE GAUNTLET - NIGHT\n\n     ...and slide it over the opening. A black beat.\n\n                              AUDREY\n                         (a beat)\n               Why's he still out there?\n\n     Fry's not sure. Is he protecting them? Or entombing them?\n\n\n     EXT. MUDDY RISE - THE GAUNTLET - NIGHT\n\n     Working like Sisyphus, Riddick hauls the cells up a muddy rise.\n     He stops at the top, peers through the rain.\n\n     RIDDICK'S POV: Of the settlement.\n\n     Riddick disappears over the rise. The four cells follow,\n     slithering through the mud like a serpent's tail.\n\n\n     EXT. CREVICE - THE GAUNTLET - NIGHT\n\n                              AUDREY\n               He's not coming back, is he?\n\n     Fry checks Imam's face. Did Riddick say anything to you?\" Imam\n     wags his head. A bleak beat -- before Fry realizes she can see\n     his face.\n\n                              FRY\n               There's light in here.\n\n     It's a soft glow from above. Imam climbs higher to discover\n     small blue-white lights clinging to rocks. He plucks a few.\n\n                              FRY\n               What are they?\n\n     CLOSE on the lights in Imam's palm. They writhe with life.\n\n                              IMAM\n               Larva....\n\n                              AUDREY\n               Glow worms....\n\n                              FRY\n                         (mind racing)\n               How many bottles we got? Empty ones?\n\n\n     INT. SKIFF - NIGHT\n\n     Riddick boards the dark craft.\n\n     Connects the power cells to the battery bay.\n\n     Watches the ship come to life.\n\n\n     EXT. CREVICE - THE GAUNTLET - NIGHT\n\n     CLOSE on a liquor bottle. It's half full of glow-worms.\n\n                              AUDREY\n               More, more, we need more....\n\n     They climb higher. Little by little, the bottle brightens their\n     world.\n\n\n     EXT. SKIFF - NIGHT\n\n     Drenched in light, Riddick stands in the hatchway of the skiff,\n     looking out into dark rain. Is he struggling with a decision?\n     Or just savoring the safe harbor? Then very deliberately...\n\n     Riddick smashes his handlight on the hull. He steps inside and\n     closes the hatch behind him.\n\n\n     EXT. MUDDY RISE - THE GAUNTLET - NIGHT\n\n     Something claws its way up the rise. Standing, we see that it's\n     Fry, a bottle of glow-worms strung around her neck. Ahead she\n     spies...\n\n     The settlement. Silhouetted by engine-light.\n\n\n     EXT. SKIFF - NIGHT\n\n     As the skiffs ENGINES WARM UP.\n\n\n     INT. SKIFF - NIGHT\n\n     As Riddick dabbles with flight controls.\n\n\n     EXT. SETTLEMENT - NIGHT\n\n     As Fry, running, splashes past buildings.\n\n\n     EXT. CREVICE - THE GAUNTLET - NIGHT\n\n     Audrey and Imam huddle around a bottle of glow-worms: This is\n     all they could harvest. Presently SCRABBLING SOUNDS on the\n     shield. Imam eases one eye to a small hole in the shield. He\n     can't see much until...\n\n     A blade rushes through the hole. Imam recoils hard, snatches up\n     the glow-worm light to see...\n\n     More predator blades exploring the edges of the shield. The\n     light drives them away. For now.\n\n\n     INT. SKIFF - NIGHT\n\n     Riddick dims interior lights, activates exterior lights. He's\n     actually startled by the sight of...\n\n     Fry. Standing in the skiffs headbeams. Daring him to run her\n     over.\n\n     Eye-lock.\n\n     Riddick opens the hatch.\n\n\n     EXT. SKIFF - NIGHT\n\n     They meet at opposite ends of the gangway -- Fry in the rain,\n     Riddick in the light.\n\n                              RIDDICK\n               Strong survival instinct. Admire that in\n               a woman.\n\n                              FRY\n               You're not leaving. Not until we go back\n               for the others.\n\n     He laughs at that.\n\n                              FRY (CONT'D)\n               I promised them we'd go back with more\n               light. And that's exactly what we're\n               gonna do..\n\n                              RIDDICK\n               Think you've mistaken me for somebody who\n               gives a fuck.\n\n                              FRY\n               What, you're afraid?\n\n                              RIDDICK\n               Confusin' me with Johns now -- fear was\n               his monkey. I only deal in life and\n               death. All that stuff in between? Some\n               shade of grey my eyes don't see.\n\n                              FRY\n               I trusted you, Riddick. Goddamn, I\n               trusted that some part of you wanted to\n               rejoin the human race.\n\n                              RIDDICK\n               Truthfully? I wouldn't know how.\n\n     Fry realizes it's impossible to shame a shameless man. With\n     desperation edging her voice:\n\n                              FRY\n               Then wait for me. I'll go back myself.\n               Just give me more light for them.\n\n     He tosses her a light. The broken one.\n\n                              FRY\n               Just come with me!\n\n                              RIDDICK\n               Got a better idea. Come with me.\n\n     Fry's mouth moves but nothing comes out.\n\n                              RIDDICK (CONT'D)\n               They're already dead. Get on board.\n\n                              FRY\n               You're fuckin' with me. I know you are.\n\n                              RIDDICK\n               'Course I am -- but doesn't mean I won't\n               leave you here. If you believe anything\n               about me, better be that.\n\n                              FRY\n               No, you see, I promised them...I have\n               to...I have to go and....\n\n     She's bleeding resolve. Riddick can see it -- can smell it --\n     and he keeps slashing away.\n\n                              RIDDICK\n               Step aboard, Carolyn.\n\n                              FRY\n                         (tortured)\n               I can't....I can't....\n\n                              RIDDICK\n                         (approaching, extending\n                          a hand)\n               Here. Make it easy on you.\n\n                              FRY\n               Don't do this to me....\n\n                              RIDDICK\n               Just give me your hand.\n\n                              FRY\n               But they...they could still be....\n\n                              RIDDICK\n               No one's gonna blame you. C'mon. Take my\n               hand and save yourself, Carolyn.\n\n     A beat. She takes his hand -- and jerks him down the gangway.\n     They sprawl through mud. She gets a knee on his neck.\n\n                              FRY\n               I will not give up on them! I Will not\n               leave anyone on this rock with those\n               fucking things, even if it means --\n\n     In a blur, Riddick rolls and slaps a shiv on her neck. Is\n     history repeating itself? Riddick's face, though, is strangely\n     calm. Curious. Even gentle.\n\n                              RIDDICK\n               You'd die for them?\n\n                              FRY\n               I would try for them.\n\n                              RIDDICK\n               You barely know them.\n\n                              FRY\n               But I'm human. I know you view that as a\n               weakness, but I'm sorry -- I do feel fear,\n               theirs too. Goddamnit, Riddick -- yes.\n               I would die for them.\n\n\n     EXT. CREVICE - THE GAUNTLET - NIGHT\n\n     MORE SCRABBLING at the shield. Imam cocks his blade back, ready\n     to do battle with...\n\n     Fry. She heaves the shield aside. Behind her, Riddick.\n\n                              AUDREY\n                         (big-eyed)\n               You came for us....\n\n                              RIDDICK\n               Yeah, yeah -- we're all fuckin' amazed.\n               Anyone not ready for this?\n\n\n     EXT. THE GAUNTLET - NIGHT\n\n     Protected by the meager light of two glow-worm bottles, the four\n     remaining survivors head out.\n\n                              RIDDICK\n               Tighter, tighter....\n\n\n     EXT. MUDDY RISE - THE GAUNTLET - NIGHT\n\n                              RIDDICK\n               Stop.\n\n     They pile up awkwardly. Fry listens hard. Only RAINFALL.\n\n                              FRY\n               I don't hear --\n\n     He covers her mouth.\n\n     RIDDICK'S POV: Water has pooled at the base of the muddy rise.\n     A predator drinks there.\n\n                              RIDDICK\n                         (on his breath)\n               Doesn't see us...wait for it to leave....\n\n     RIDDICK'S POV: Another predator lands to drink. Then another.\n     Their backs are to us, but the pool is turning into a major\n     gathering place.\n\n     Soon they all can hear CLICKING above the RAIN. Their nightmare\n     is far from over.\n\n                              RIDDICK\n               Get behind me.\n\n     RIDDICK'S POV: Of a half-dozen predators shifting places at the\n     pool. A slim gap appears.\n\n                              RIDDICK\n               When I go, we go. Full-throttle.\n\n     CLOSE on their hands, gripping each other.\n\n                              RIDDICK\n               Ready...ready....\n\n     RIDDICK'S POV: The gap between predators widens into a passage.\n     A gauntlet within a gauntlet.\n\n     Riddick runs. Linked like paper dolls, the others follow blindly.\n\n     RIDDICK'S POV: Of a predator turning to \"stare\" over its\n     shoulder.\n\n     PREDATOR'S POV: Of Riddick bearing down fast.\n\n     The survivors hit the water like lawn mowers on legs, crashing\n     through, scattering water and predators alike, managing to\n     reach...\n\n     The muddy rise. Audrey loses her grip on the others...\n\n     And starts back-sliding. She CRIES OUT, turning the head of...\n\n     Riddick. He catches Audrey as her legs hit the pool. He muscles\n     her back up the rise and heaves her over the top, sending her\n     slip-sliding down the other side.\n\n                              RIDDICK\n               You know the way!\n\n     Not waiting for him, Fry and Imam disappear over the rise.\n\n     RIDDICK'S POV: Of the predators. Regrouping. Crawling up the\n     rise at us.\n\n\n     EXT. NIGHT\n\n     Fry, Imam, and Audrey run hard, glow-worm lights bouncing wildly.\n\n     RIDDICK'S POV: Chasing them.\n\n     PREDATOR'S POV: Chasing Riddick.\n\n\n     EXT. SETTLEMENT - NIGHT\n\n     Fry, Imam, and Audrey reach the settlement. They spill around a\n     corner and see...\n\n     The light of the skiff.\n\n\n     EXT. SETTLEMENT - NIGHT\n\n     RIDDICK'S POV: Ahead of us, we see Fry, Imam, and Audrey\n     vanishing around the corner. BREATHING LIKE A RACEHORSE, we\n     follow in their steps, storming around the same corner. Suddenly\n     a predator is right there, right in our face.\n\n     PREDATOR'S POV: Of Riddick skidding to a stop. He snaps a look\n     up.\n\n     RIDDICK'S POV: Of another predator perched gargoyle-like on the\n     building. It SPEED-CLICKS at us.\n\n     PREDATOR'S POV: Of Riddick slowly pulling two shivs. Bracing\n     himself. Ready to blade it out.\n\n\n     EXT. SKIFF - NIGHT\n\n     Imam and Audrey stagger aboard. Safe in the light of the\n     headbeams, Fry turns back, panting, waiting.\n\n     Waiting.\n\n                              IMAM\n               Captain....\n\n     He wants her to board the skiff. Fry gives it another beat, eyes\n     sweeping the dark rain. And just when we think it's over for\n     Riddick -- TERRIBLE SCREAMS are heard from both man and predator:\n     There's a helluva fight going on out there. Close out there.\n\n     Fry snatches the glow-worms off Imam's neck...\n\n     And plunges into the darkness, homing in on the SOUNDS until...\n\n     A blade flashes in her face. She ducks and spots...\n\n     Riddick. Bloody, muddy, he's down on his knees, still trying to\n     fight off the shadow-beasts that swirl and slash all around him.\n     Around them both.\n\n                              FRY\n               It's me, it's me, it's me!\n\n     She gets the light around his neck. Now we see his face\n     clearly -- and see a very human expression there: Fear. Fry\n     grabs his armpits and tries to pull him up.\n\n                              FRY\n               C'mon, Riddick -- said I'd die for them,\n               not you.\n\n     He gets his feet under him. Gripping each other, they start\n     moving, turning like dancers in a macabre waltz, hoping the\n     predators can't fix on Riddick's blood.\n\n                              FRY\n               Just 10 steps...keep turning, keep\n               turning...that's right...others're already\n               'board, waitin' for us right now...five\n               steps...c'mon, almost there, Riddick...\n               almost there...we're almost --\n\n     Something jolts them. ALL CLICKING STOPS.\n\n     EXTREME CLOSEUPS: Searching each other's eyes. Someone just got\n     slashed from behind, slashed bad. But who?\n\n                              RIDDICK\n               Not for me....\n\n     In an eyeblink she's gone, ripped from his arms. There was no\n     scream. No cry. No final words. Just...\n\n     Blackness.\n\n\n     EXT. PLANET'S ORBIT - NIGHT\n\n     Out of the blackness, a spot of fire races toward us. It\n     resolves into the skiff, fabric wings burning off as it hits\n     escape velocity.\n\n\n     INT. SKIFF - NIGHT\n\n     CLOSE on a bloody hand. It toggles through nav-charts, plots a\n     rendezvous with \"Sol-Track 17B\" shipping lane.\n\n     In the cockpit, Riddick finds Audrey beside him. She stares\n     hypnotically at the stars ahead.\n\n                              RIDDICK\n               Probably okay to talk to me now.\n\n                              AUDREY\n               Not sure where to go. I was just runnin'\n               away when this whole thing started.\n                         (a beat)\n               Where you goin'?\n\n                              RIDDICK\n               Not sure. I was just runnin' away when\n               this whole thing....\n\n     Interior smiles. Stars sweep the windscreen as the skiff makes\n     a course-correction. One very bright star comes into view.\n\n                              RIDDICK\n               Might interest you....\n\n     Imam moves forward. Seeing, his face lifts.\n\n                              IMAM\n               New Mecca....\n\n                              RIDDICK\n               Think a soul could get lost there? With\n               all those pilgrim-types?\n\n                              IMAM\n               It's more a place where souls are found,\n               Mr. Riddick.\n\n     As Riddick ponders the possibilities, we CUT TO...\n\n\n     EXT. PLANET'S ORBIT - NEW DAWN\n\n     The first sun flares out from behind the eclipsing planet. Its\n     light feels cleansing. Renewing. Life-giving.\n\n                                                            FADE OUT\n\n\n\n\n\n\n\n\n\n\n   \n\n\n\n\n\n\nPitch Black\nWriters :   David Twohy\nGenres :   Horror  Sci-Fi  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:33:03.115371"}