{"title": "Planet of the Apes, The", "film_link": "/Movie Scripts/Planet of the Apes, The Script.html", "script_link": "/scripts/Planet-of-the-Apes,-The.html", "info_raw": "\n\nPlanet of the Apes, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (6.60 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Michael Wilson\nGenres  Action  Drama  Sci-Fi\n\nRead \"Planet of the Apes, The\" Script\n\n\n", "script": "\n\n\nPlanet of the Aples - 1967\n\n\n\n\n\n\nback\n\n\n\n\n\t\t\t\t\"PLANET OF THE APES\"\n\n\t\t\t\tScreenplay\n\t\t\t\tby\n\t\t\t\tMichael Wilson\n\n\n\t\t\t\tBased on Novel\n\t\t\t\tBy\n\t\t\t\tPierre Boulle\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSHOOTING SCRIPT\n \t\t\t\t\t\t\tMay 5, 1967\n\n\t\t\t\t\t\t\tREVISED:\n\t\t\t\t\t\t\t05/11/67\n\t\t\t\t\t\t\t05/16/67\n\t\t\t\t\t\t\t05/23/67\n\t\t\t\t\t\t\t06/09/67\n\t\t\t\t\t\t\t06/15/67\n\t\t\t\t\t\t\t06/22/67\n\t\t\t\t\t\t\t07/06/67\n\t\t\t\t\t\t\t07/27/67\n\n\n\n\n\n\n\n\n\n\tFADE IN\n\t\n1\tEXT. CONSTELLATION OF ORION - NIGHT\n\n\tStars glitter like diamonds on the black velvet backdrop of space. \n\tThe Belt of Orion is center screen, but much nearer and larger \n\tthan ever seen by an Earth-bound astronomer.\n\n\tA speck of light appears in the lower left corner of the screen. \n\tNo spaceship can be seen, but only a glowworm, a solitary sperma-\n\ttosoan gliding through the womb of the universe. Over this we HEAR \n\tthe voice of an astronaut. He is concluding a report.\n\n\t\t\t\tASTRONAUT'S VOICE\n\t\t\t\t(o.s.)\t\n\t\t\tSo ends my last signal until we reach\n\t\t\tour destination. We are now on automatic, \n\t\t\ta mere hundred and five light years from \n\t\t\tour base ... and at the mercy of com-\n\t\t\tputers. I've tucked in my crew for the \n\t\t\tlong sleep. I'll join them presently.\n\n2\tINT. CABIN OF SPACESHIP - ESTABLISHING SHOT - NIGHT\n\n\tThe cabin is neither cramped nor spacious, but about the size of the \n\tPresident's cabin in Air Force One. In the immediate f.g. is a console \n\tof dials and switches flanked by four chairs. Only one of the chairs \n\tis occupied. The astronaut's back is to CAMERA. There is a ladder \n\tamidships which leads to an escape hatch. The after Dart of the cabin\n\tis obscured in darkness. We hear the MUSIC of a Mozart sonata emanating\n \tfrom a phonograph of stereotape. The astronaut is speaking into a\n \tmicrophone.\n\n\t\t\t\tASTRONAUT\n\t\t\tWithin the hour we shall complete\t\n\t\t\tthe sixth month of our flight from\n\t\t\tCape Kennedy. By our time, that is ...\n\n\tHe pauses, looking up at:\n\n3\tTWO LARGE CLOCKS - ON CABIN WALL\n\n\tOne clock is marked SELF TIME, but instead of twelve numerals it has \n\ttwenty-four. One of the needles is moving very slowly.\n\n\tThe other clock is labeled EARTH TIME, and its units, like those of a\n \ttachometer, are given by hundreds and thousands.\n\n\tThe largest needle of this clock makes one revolution every second.\n \tOver this we hear:\n\n\t\t\t\tASTRONAUT'S VOICE\n\t\t\t\t(o.s.)\n\t\t\tBut according to Dr. Hasslein theory of \n\t\t\ttime in a vehicle traveling at close to \n\t\t\tthe speed of light, old Mother Earth has \n\t\t\taged a few thousand years since our de-\n\t\t\tparture -- while we have scarcely aged \n\t\t\tat all.\n\n4\tCLOSE ON ASTRONAUT\n\n\tThis is TAYLOR. He wears simple dungarees (or Churchill suit) and\n \tcomfortable boots. He seems calm and pensive. Extracting the butt of \n\ta cigar from the breast pocket of his dungarees, he lights it, then\n \tcontinues:\n\n\t\t\t\tTAYLOR \n\t\t\tIt may be so. This much is probable: the \n\t\t\tmen who sent us on this journey have long \n\t\t\tsince been moldering in forgotten graves; \n\t\t\tand those, if any, who read this message \n\t\t\tare a different breed. Hopefully, a \n\t\t\tbetter one.\n\n\tHe begins to roll up his left sleeve.\n\n\t\t\t\tTAYLOR \n\t\t\tI leave the twentieth century without \n\t\t\tregret. Who was it? Marshall? ... said \n\t\t\t'Modern man is the missin 'a link between \n\t\t\tthe ape and the human being.'\n\n\tHe removes the cigar from his mouth, turns to look out through one \n\tof the portholes into the astral night.\n\n\t\t\t\tTAYLOR \n\t\t\tOne final thought -- nothing scientific, \n\t\t\tpurely personal. Seen from up here, \n\t\t\teverything looks different ... Time bends \n\t\t\tand space is boundless. It squashes a \n\t\t\tman's ego. He begins to feel like no more \n\t\t\tthan a mote in the eye of eternity. And \n\t\t\the is nagged by a question: ahat if any-\n\t\t\tthing, will greet us on the end of man's \n\t\t\tfirst journey to a star? Are we to believe \n\t\t\tthat throughout these thousands of galaxies, \n\t\t\tthese millions of stars, only one, that \n\t\t\tspeck of solar dust we call Earth, has \n\t\t\tbeen graced -- or cursed -- by human life?\n\t\t\t\t(pause) \n\t\t\tI have to doubt it.\n\n\tHe extracts a hypodermic needle from his breast pocket and injects \n\tit into the vein of his forearm. He continues speaking.\n\n\t\t\t\tTAYLOR \n\t\t\t\t(sardonically) \n\t\t\tThat's about all. I wonder if Man, that \n\t\t\tmarvel of the universe, that glorious \n\t\t\tparadox who has sent me to the unknown... \n\t\t\tstill makes war against his brother., and \n\t\t\tlets his neighbor's children starve.\n\n\tTaylor withdraws the hypodermic needle from his vein and secures it in \n\ta drawer of the console.\n\n\t\t\t\tTAYLOR \n\t\t\tWell then, Earthmen: A missing link \n\t\t\tsalutes you. Bless you, my descendants.\n\n\tTaylor snuffs out the cigar butt and places it in the drawer beside the\n \thypodermic. Then, flicking a switch Au cut off the Mozart, he rises and \n\tlooks up again at:\n\n5\tTHE CLOCK MARKED EARTH TIME\n\n\tThe longest needle of this clock now makes nearly two revolutions per \n\tsecond. The shortest needle points to the numeral 2105.\n\n6\tINT. CABIN - TRACKING WITH TAYLOR\n\n\tSpace scientists have presumably solved the problem of weightlessness, \n\tfor Taylor walks the short distance from; the console to the after \n\tsection without particular effort. CAMERA FOLLOWS him, and we can now \n\tsee four glass capsules, or \"caskets\", in the rear of the cabin. Taylor \n\tlooks down at them.\n\n7-\tSEVERAL SHOTS - THE FOUR CASKETS - FROM TAYLOR'S P.O.V.\n10\n\tOne of them is open. The other three are occupied by astronauts: DODGE, \n\tLANDON and STEWART. They, too, wear dungarees and boots. Dodge and \n\tLandon are thirtyish, clean-shaven, virile -- America's finest. Stewart \n\tis a handsome young woman, her hair bobbed short. Their eyes are closed \n\tand they do not appear to be breathing -- yet no undertaker could make \n\tthem so alive.\n\n11\tANOTHER ANGLE - FAVORING TAYLOR\n\n\tHe grasps the handle of his own casket and slowly pulls himself into\n \tit. Continuing SILENCE. CAMERA MOVES IN as Taylor Dulls the glass lid\n \tshut and secures it. He adjusts two dials inside the capsule and lies\n \tback, buckling his safety belt. CAMERA MOVES INTO A CLOSEUP of Taylor.\n \tHis eyes are open. He seems serene, even enraptured.\n\n\t\t\n\t(NOTE: Credits will appear here over a series of shots designed to\n \tconvey a sense of loneliness, of separation, and of the passage of\n \ttime.)\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n12-\tA SERIES OF SHOTS - A DISTANT GLOBE (MINIATURE)\n16\t\n\tWe see a strange and distant planet. At first the globe occupies but a \n\tsmall area of the screen; but with each new VIEW it comes closer and\n \tlooms larger, as if\" observed from a spaceship in a spiraling orbit of\n \tdescent.\n\n\tThe topography of the planet bears little resemblance to our own. Much\n \tof it is obscured by cloud cover; even more of-it appears to be\n \tcratered desert of reddish hue. We can, however, make out a few narrow\n \t\"green belts\" and a patch of blue water.\n\n\tIn the FINAL SHOTS of this SEQUENCE we see the strange planet as it\n \twould be observed from a spacecraft plummeting from twenty thousand\n \tfeet to one thousand feet. It appears that the ship will fall into a \n\tvast lake surrounded by soaring sandstone pinnacles. The water is \n\tblue-black, the pinnacles vermillion. (This is the Lake Powell\n \tlocation, at Lone Rock.)\n\n17\tINT. SPACESHIP - FULL SHOT - DAY\n\n\tFour empty pilot seats are seen in f.g., the four glass caskets in \n\tb.g. We HEAR the RHYTHMIC BLEAT of a WARNING SIGNAL, a RUSH OF WIND \n\tas in a rapid descent, and perhaps the ROAR OF RETROJETS. Then, a \n\tgreat CRASH as the craft hits water. The whole ship shudders on impact.\n \tLoose equipment falls to the cabin floor. CAMERA MOVES DOWN the cabin\n \taisle as the ship begins to roll in the water and HOLDS on the four\n\tglass caskets. There are THREE LOUD METALLIC CLICKS as the glass \n\tdomes of the caskets swing open automatically.\n\n18\tCLOSE ON TAYLOR\n\n\tHe now has a full beard. His eyes come open. Instantly alert, he \n\trises to a sitting position, gazing across at:\n\n19\tDODGE AND LANDON - FROM TAYLOR'S P.O.V.\n\n\tThey, too, awaken and sit up, starring at Taylor. They, too, are\n\tbearded.\n\n\t\t\t\tTAYLOR'S VOICE \n\t\t\t\t(o.s.)\n\t\t\tYou all right?\n\n\tThey nod.\n\n20\tBACK TO TAYLOR - CLOSE SHOT\n\n\tHe glances at the casket beside his own.\n\n\t\t\t\tTAYLOR \n\t\t\tStewart?\n\t\t\t\t(struggling to his feet) \n\t\t\tStewart?\n\n21\tCLOSE-SHOT --THE FOURTH CASKET\n\n\tIts dome remains unopened. The young woman is a skeleton in a \n\tChurchill suit.\n\n22\tREACTION SHOT - THE THREE ASTRONAUTS\n\n\tDodge and Landon have joined Taylor and-stare at the grinning skull \n\tof their dead comrade. A low, descending HUM of equipment is heard.\n \tSimultaneously the lights begin to FADE. A moment later they brighten,\n \tbut not as much as before.\n\n\t\t\t\tTAYLOR \n\t\t\tThere goes our primary power. We're on \n\t\t\tauxilliary.\n\n\tA slight CRACKING sound is heard. Taylor turns quickly away and o.s.:\n\n23\tREVERSE ANGLE - THE FORWARD CABIN\n\n\tA trickle of water has begun to seep through a ruptured seam in the\n \tcabin. Taylor darts to a porthole and peers cut.\n\n24\tLONG SHOT - WHAT TAYLOR SEES:\n\n\twater \n\n\tThe porthole is no more than six inches above the line. In the \n\tdistance we discern a shoreline of red desert.\n\n\t\t\t\tTAYLOR'S VOICE \n\t\t\t\t(o.s.)\n\t\t\tWe're in the soup. We're sinking.\n\n25\tINT. CABIN - FULL SHOT\n\n\tThe leak in the seam becomes a growing spray of water. Taylor \n\tturns away from the porthole, calling:\n\n\t\t\t\tTAYLOR\n\t\t\tDodge! Read the atmosphere!\n\n\tDodge moves instantly to the ladder beneath an escape hatch and \n\tmounts it. Taylor stumbles down the aisle of the rolling ship toward\n \tthe console and addresses Landon, who is still staring at Stewart's\n\tskeleton.\n\n\t\t\t\tTAYLOR\n\t\t\tLandon! Send a last signal.\n\n\t\t\t\tLANDON\n\t\t\t\t(dazed) \n\t\t\tWhat signal?\n\n\t\t\t\tTAYLOR \n\t\t\tTo Earth! That we've landed!\n\n\tAs Landon lurches toward the communications equipment in f.g.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\n26\tEXT. TIM STRANGE PLANET - LONG PANORAMIC SHOT - LATE AFTERNOON (LONE\n \tROCK, LAKE POWELL)\n\n\tWe are looking at a lifeless desert of sandstone buttes and pinnacles.\n \tThere is no sign of vegetation anywhere. CAMERA PANS DOWN to a body \n\tof water that could be the bay of an inland sea. The deep blue of the\n \tsea contrasts sharply to the red sands of the shoreline. CAMERA HOLDS\n \ton the stricken spaceship, wallowing like a beached whale a hundred\n \tyards offshore. The portholes of the craft are beneath the water, and\n \tonly its roof and the tail fin of its tail assembly are visible. The\n \tred-hot skin of the ship vaporizes the water around it.\n\n\tSuddenly a snorkel-like tube sprouts from the escape hatch, which is \n\tlocated amidships.\n\n27\tINT. CABIN - CLOSE ON CLOSED ESCAPE HATCH\n\n\tDodge, standing halfway up the ladder., has fastened a kit of gauges \n\tto the end of the snorkel tube. He reads the dials, removes the kit,\n \tsniffs the air in the tube and then, taking a deep breath, announces:\n\n\t\t\t\tDODGE \n\t\t\tIt's breathable.\n\n\t\t\t\tTAYLOR'S VOICE \n\t\t\t\t(o.s.) \n\t\t\tOkay! Blow the hatch before we lose \n\t\t\tauxilliary power.\n\n\tDodge reaches for a control mechanism near the escape hatch.\n\n28\tCLOSE ON TAYLOR AND LANDON\n\n\tThe spray of water coming through the ruptured seam is increasing. \n\tThe LIGHTS DIM again and the SOUND of the warning signal FADES. While\n\tLandon fiddles with the radio, Taylor tries to get the tape recorder\n \trolling, but all we hear are scrambled and unintelligible noises.\n\n\t\t\t\tLANDON\n\t\t\tIt's no use ... there she goes.\n\n\t\t\t\tTAYLOR\n\t\t\tForget it. Abandon ship.\n\n29\tWIDER ANGLE - TIM CABIN\n\n\tThe escape hatch is now open. Taylor darts over to the ladder and\n \tpasses a folded life raft up to Dodge. When Landon reaches the ladder,\n \tTaylor hands him two neatly packed rucksacks, and Landon climbs \n\tthrough the escape hatch. Taylor is about to follow with a third\n \trucksack, then turns and crosses the cabin for a last look at:\n\n30\tTHE TWO CLOCKS - FROM TAYLOR'S P.O.V.\n\n\tBoth clocks have stopped: the red needle of the clock labeled SELF \n\tTIME rests on the numeral 18; the red needle of the clock marked \n\tEARTH TIME rests on the numeral 3975.\n\n31\tEXT. TOP OF SPACECRAFT - MED. SHOT\n\n\tDodge inflates the raft with a cartridge of compressed air and \n\ttosses it into the water. He and Landon jump into the water and \n\tclimb onto the raft as Taylor emerges from the hatch, Taylor slips \n\tinto the water and climbs onto the raft. He and Landon begin to \n\tpaddle toward shore, while Dodge immediately opens another kit and \n\ttakes a sample of the water.\t\n\n32\tCLOSE ON THE MEN IN THE RAFT\n\n\t\t\t\tDODGE\n\t\t\t\t(half to himself) \n\t\t\tBriny...twenty-five percent salinity. \n\t\t\tNear the saturation point.\n\n\t\t\t\tLANDON\n\t\t\t\t(looking back)\n\t\t\tShe's still sinking...\n\n33\tTHE SPACESHIP - FROM THEIR P.O.V.\n\n\tOnly the radio antenna and the tip of the tail fin remain visible.\n\n\t\t\t\tLANDON'S VOICE \n\t\t\t\t(o.s.)\n\t\t\tGoing ... going...\n\n \tThe craft vanishes beneath the water.\n\n34\tCLOSE ON THE MEN IN THE RAFT\n\n\tDodge is still busy with his kit. Landon is still looking back, but \n\tTaylor doesn't bother to turn his head.\n\n\t\t\t\tLANDON \n\t\t\tGone.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(flatly)\n\t\t\tWe're here to stay.\n\n35\tANOTHER ANGLE - MOVING WITH THE RAFT\n\n\tThey gaze at the forbidding sandstone battlements as they near the\n \tshore.\n\n\t\t\t\tLANDON  \n\t\t\tWell? Where are we? Have any notion, \n\t\t\tskipper?\n\n\t\t\t\tTAYLOR \n\t\t\t\t(confidently) \n\t\t\tWe're some three hundred and twenty \n\t\t\tlight years from Earth. On an unnamed \n\t\t\tplanet in orbit around a star in the \n\t\t\tconstellation of Orion. \n\t\t\t\t(looks off at \n\t\t\t\tthe \"sun\") \n\t\t\tThat could be Bellatrix.\n\n36\tTHE SUN - FROM THEIR P.O.V.\n\n\tLow on the horizon, seen through a dense envelope of dust particles.\n\n\t\t\t\tDODGE'S VOICE\n\t\t\t\t(o.s.)\n\t\t\tToo red for Bellatrix.\n\n37\tBACK TO ASTRONAUTS IN RAFT\n\n\tLandon glances skeptically at Taylor.\n\n\t\t\t\tLANDON \n\t\t\tYou didn't have time to check the \n\t\t\ttapes, so you don't really know, \n\t\t\tdo you?\n\t\t\t\t(as Taylor ignores\n\t\t\t\thim) \n\t\t\tWhat went wrong?\n\t\t\t\t(sardonically)\n\t\t\tWe weren't programmed to land\n\t\t\tin water.\n\n\t\t\t\tDODGE \n\t\t\t\t(grinning) \n\t\t\tThe question, Landon, is not so much \n\t\t\twhere we are as when we are.\n\n\t\t\t\tTAYLOR \n\t\t\t(stands up in raft) \n\t\t\tWe've had a nice snooze. Let's start \n\t\t\tearning all our back pay.\n\n38\tWIDER ANGLE - THE BEACH\n\n\tAs the three astronauts step out into shallow water and pull the \n\traft ashore.\n\n\t\t\t\tTAYLOR \n\t\t\tTake your soil test, Dodge. I'll \n\t\t\tcheck the equipment.\n\n\tDodge moves inland about ten yards, removes a small hand drill \n\tfrom his belt, extends the rod of the drill three feet and begins \n\tto take some subsoil samplings. Taylor begins to examine the contents\n\tof the three rucksacks. Landon sits down on the beach., hands around \n\this knees, gazing moodily at the sunken spaceship. During this and \n\tsucceeding scenes we sense that Dodge's obsession with scientific \n\tinquiry leaves him immune to fear: Landon is possibly more courageous \n\tand certainly more \"human,\" for he has many fears to control: while \n\tTaylor -- detached, cool and misanthropic -- is something of an enigma.\n\n\t\t\t\tTAYLOR \n\t\t\t\t(calls Dodge) \n\t\t\tGot your sensors?\n\n\t\t\t\tDODGE \n\t\t\tYo!\n\n\t\t\t\tTAYLOR \n\t\t\tGeiger counter?\n\n\t\t\t\tDODGE \n\t\t\tYo!\n\n\t\t\t\tTAYLOR\n\t\t\t\t(taking inventory) \n\t\t\tOne pistol... twenty-four rounds of \n\t\t\tammo. two medical kits.. one camera... \n\t\t\tone TX9.\n\t\t\t\t(loudly to the\n\t\t\t\tothers) \n\t\t\tWe've enough food and water for three \n\t\t\tdays.\n\n\t\t\t\tDODGE\n\t\t\tBut how long is a day?\n\n\t\t\t\tTAYLOR \n\t\t\tGood question.\n\t\t\t\t(turning) \n\t\t\tLandon -- check your communications \n\t\t\tkit.\n\n39\tANOTHER ANGLE - FAVORING LANDON\n\n\tHe seems not to have heard.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(sharply)\n\t\t\tLandon! Join the expedition.\n\n\t\t\t\tLANDON\n\t\t\t\t(rising)\n\t\t\tSorry... \n\t\t\t\t(crossing to his kit)\n\t\t\tI was thinking of Stewart. What\n\t\t\td'you suppose happened?\n\n\t\t\t\tTAYLOR\n\t\t\t\t(flatly)\n\t\t\tAir leak. Died in her sleep.\n\n\t\t\t\tLANDON \n\t\t\tYou don't seem very cut up about \n\t\t\tit.\n\n\t\t\t\tTAYLOR \n\t\t\tIt's a little late for a wake. She's \n\t\t\tbeen dead nearly a year.\n\n\t\t\t\tLANDON \n\t\t\tThen we've been away from Earth for \n\t\t\teighteen months.\n\n\t\t\t\tTAYLOR \n\t\t\tBy our time.\n\t\t\t\t(smiling at Landon)\n\t\t\tYou've turned gray.\n\n\tLandon involuntarily touches the gray hair of his temple as Taylor \n\tadds lightly:\n\n\t\t\t\tTAYLOR \n\t\t\tApart from that, you look pretty chipper \n\t\t\tfor a man who's two thousand and thirty \n\t\t\tone years old.\n\t\t\t\t(casually) \n\t\t\tI read the clocks. They bear out Hasslein's \n\t\t\thypothesis. We've been away from Earth for \n\t\t\ttwo thousand years, give or take a decade.\n\t\t\t\t(pause) \n\t\t\tStill can't accept it, huh?\n\n\t\t\t\tLANDON\n\t\t\t\tlong pause) \n\t\t\tYou know it.\n\n\t\t\t\tTAYLOR \n\t\t\tBecause time has wiped out everyone and \n\t\t\teverything you cared for -- they're dust.\n\n\t\t\t\tLANDON \n\t\t\tProve it. If we can't get back, it's still \n\t\t\tjust a theory.\n\n\t\t\t\tTAYLOR\n\t\t\tIt's a fact, Landon. Buy it. You'll sleep \n\t\t\tbetter.\n\n\tDodge enters scene. A handful of reddish sand dribbles through his \n\tfingers.\n\n\t\t\t\tDODGE \n\t\t\tNothing will grow here .... there's just a \n\t\t\ttrace of hydrocarbons, and most of the \n\t\t\tnitrogen is locked into nitrates.\n\n\t\t\t\tTAYLOR\n\t\t\tAny sign of dangerous ionization?\n\n\t\t\t\tDODGE\n\t\t\tNo.\n\n\t\t\t\tTAYLOR \n\t\t\t\t(rising) \n\t\t\tOkay. If there's no life here, we've got \n\t\t\tjust seventy-two hours to find it. That's \n\t\t\twhen the groceries run out.\n\n\tHe picks up one of the rucksacks and puts it on. The others follow \n\tsuit.\n\n\t\t\t\tDODGE\n\t\t\tWhich direction?\n\n\t\t\t\tTAYLOR\n\t\t\t\t(decisively, pointing\n\t\t\t\twest) \n\t\t\tThat way.\n\n\t\t\t\tDODGE\n\t\t\tAny particular reason?\n\n\t\t\t\tTAYLOR \n\t\t\tNone at all.\n\n\tHe moves out. Dodge follows. CAMERA PANS with them. They have gone \n\tonly a few paces when Taylor looks back over his shoulder and halts.\n\n40\tREVERSE ANGLE - FEATURING LANDON\n\n\tLandon is squatting in the sand, sticking something into the soil. \n\tIt is a small American flag, the size of a handkerchief.\n\n41\tREVERSE  ANGLE - FEATURING TAYLOR AND DODGE\n\n\tMirth bubbles up in Taylor's throat. He explodes with wild laughter. \n\tHe is still laughing as they move out.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\n41-A\tDAWN SHOT (GUNSIGHT\tLOC #43)\n\n42\tTHE ASTRONAUTS' TREK\n\n\tThey descend from the plateau (Ochre Dunes)\n\n43\tASTRONAUTS CONTINUE MARCH,\n\n\tAcross the top of the hills there suddenly runs a line of fire (Black \n\tDunes).\n\n44\tTHEY MOVE ACROSS THE TERRAIN\n\n\tJagged bolts of lightning flash across the sky, but bring, no rain, and \n\tthunder claps sound like heavy artillery. (Gray Area)\n\n45-\tOUT\n58\n\n\t\t\t\t\t\t\t\tQUICK DISSOLVE TO:\n\n59\tANOTHER PART OF THE CANYON (OCHRE DUNES AREA) - GROUP\n\tSHOT - DAY\n\n\tSeveral huge boulders are dislodged, and the three astronauts run.\n\twildly to escape the falling rocks. When the avalanche ends, they \n\tsprawl on the lifeless sands, breathing heavily and drenched with\n \tsweat, surrounded by enormous boulders. Taylor looks about him.\n\n\t\t\t\tTAYLOR\n\t\t\tEverybody all right?\n\n\tMurmurs of assent from Dodge and Landon. Taylor rummages through a\n \tlimp rucksack, comes up with some empty food cartons,rummages again,\n \tcoming up with a cigar butt.\n\n\t\t\t\tTAYLOR \n\t\t\tWater check.    \n\n\tDodge takes a plastic canteen from another rucksack and inspects it.\n\n\t\t\t\tDODGE \n\t\t\tEight ounces.\n\n\tDodge lies back and looks up at the sky.\n\n\t\t\t\tDODGE \n\t\t\tIt doesn't add up. There's a mantle of \n\t\t\tdust around this planet and yet it's \n\t\t\tas humid as a jungle. Thunder and \n\t\t\tlightning and yet no rain. Cloud cover \n\t\t\tevery night and that strange luminosity, \n\t\t\tand yet no moon.\n\n\tLandon also looks up at the sky.\n\n\t\t\t\tLANDON\n\t\t\tIf only we could get a fix.\n\n\t\t\t\tTAYLOR \n\t\t\t\t(needling him) \n\t\t\tWhat would you learn? I've told you \n\t\t\twhere you are and when you are.\n\n\t\t\t\tDODGE \n\t\t\t\t(gently) \n\t\t\tTaylor -- quit riding him.\n\n\t\t\t\tTAYLOR \n\t\t\t\t(harshly, to Landon) \n\t\t\tYou're more than three hundred light \n\t\t\tyears from your precious planet. Your \n\t\t\tloved ones have been dead and forgotten \n\t\t\tfor twenty centuries. Even if you could \n\t\t\tget back, they'd think you were \n\t\t\tsomething that fell out of a tree.\n\n\t\t\t\tLANDON \n\t\t\t\t(wearily)\n\t\t\tAll right --\n\n\t\t\t\tTAYLOR \n\t\t\tThere's only one reality left. We're \n\t\t\there and it's now. You get ahold of that \n\t\t\tand hang on tight, or you might as well \n\t\t\tbe dead.\n\n\t\t\t\tLANDON \n\t\t\t\t(quietly) \n\t\t\tI'm prepared to die.\n\n\tTaylor turns to Dodge, throws up his hands.\n\n\t\t\t\tTAYLOR \n\t\t\tHe's prepared to die! Doesn't that make \n\t\t\tyou misty? Chalk up another victory for \n\t\t\tthe human spirit!\n\n\tDodge rises and moves off, o.s., either embarrassed by this colloquy\n \tor unwilling to hear it again. Taylor, cigar clamped between his\n \tteeth, spins toward Landon.\n\n\t\t\t\tTAYLOR \n\t\t\tStraighten me out on something. Why did \n\t\t\tyou come along at all? You volunteered. \n\t\t\tWhy?\n\t\t\t\t(a beat; no answer) \n\t\t\tI'll tell you. They nominated you for the \n\t\t\tBig One and you couldn't turn it down. Not \n\t\t\twithout losing your All-American standing\n\n\t\t\t\tLANDON\n\t\t\t\t(hard) \n\t\t\tClimb off me, will you!\n\n\t\t\t\tTAYLOR \n\t\t\tAnd the glory, don't forget that. There's \n\t\t\ta life-sized bronze statue of you somewhere. \n\t\t\tIt's probably turned green by now, and nobody \n\t\t\tcan read the name plate. But never let it be \n\t\t\tsaid we forget our heroes.\n\n\t\t\t\tLANDON\n\t\t\tTaylor.\tI'm telling you --\n\n\t\t\t\tTAYLOR\n\t\t\tOh, and one last item. Immortality.\n\t\t\tYou wanted to go on forever.\n\t\t\t\t(pause) \n\t\t\tWell, you damn near made it. Except for \n\t\t\tDodge and me, you've lived longer than \n\t\t\tanybody. And with Stewart dead, it looks \n\t\t\tlike we're the last of the strain. You got \n\t\t\twhat you wanted, kid. How does it taste?\n\n\tSilence.\tTaylor lies down, spent of his venom, pillowing\n\this head on a rucksack.\n\n\t\t\t\tLANDON\n\t\t\t\t(softly)\n\t\t\tOkay. You read me well enough.\n\t\t\tWhy can't I read you?\n\n\t\t\t\tTAYLOR \n\t\t\tDon't bother\n\n\t\t\t\tLANDON \n\t\t\t\t(looking off) \n\t\t\tDodge ... he's not like me at all. But\n \t\t\the makes sense. Held walk naked into a \n\t\t\tlive volcano if he thought he could learn \n\t\t\tsomething no other man knew. I understand \n\t\t\twhy  he's here. But you...You're no seeker. \n\t\t\tYou're negative.\n\n\t\t\t\tTAYLOR\n\t\t\tBut I'm not prepared to die.\n\n\t\t\t\tLANDON \n\t\t\t\t(heatedly) \n\t\t\tI'd like to know why not. You thought \n\t\t\tlife on Earth was meaningless. You despised \n\t\t\tpeople. So what did you do? You ran away.\n\n\tTaylor's eyes are closed. He is silent for a moment. When he speaks,\n \this tone is soft, reflective.\n\n\t\t\t\tTAYLOR \n\t\t\tNo, not quite, Landon. I'm a bit of a \n\t\t\tseeker myself. But my dreams are a lot \n\t\t\temptier than yours. \n\t\t\t\t(pause) \n\t\t\tI can't get rid of the idea that somewhere \n\t\t\tin the Universe there must be a creature \n\t\t\tsuperior to man.\n\n60\tANOTHER ANGLE - FEATURING DODGE\n\n\twho has been wandering around, studying the boulders and the barren \n\tsoil. Taylor and Landon can be seen in b.g. Dodge spots something and \n\tsquats down to examine it.\n\n61\tCLOSEUP - WHAT DODGE SEES:\n\n\tIt is a tiny desert flower, no more than an inch high.\n\n62\tCLOSEUP - DODGE\n\t\n\tHis eyes light up as he calls:\n\n\t\t\t\tDODGE \n\t\t\tTaylor! Over here!\n\n63\tCLOSE. GROUP SHOT - ANGLING DOWN\n\n\tas Taylor and Landon hurry over and kneel down on either side of Dodge. \n\tThe astronauts hover over the tiny flower like three magi perceiving \n\tthe infant Deliverer.\n\n\t\t\t\tDODGE \n\t\t\tLife. \n\n\tHe digs gently around the roots of the plant with a small instrument.\n\n\t\t\t\tDODGE \n\t\t\tWhere there's one there's another. And \n\t\t\tanother. And another. \n\n\t\t\t\tTAYLOR \n\t\t\tLet's find them all.\n\n63-A\tSUNSET SHOT\n\n64\tEND OF THE TREK AS THE ASTRONAUTS START FROM THE CANYON\n\tTO THE TAMARISK AREA\n\n\tAbsolute desolation (Ochre Area). The astronauts start down\n\tthe canyon.\n\n65\tASTRONAUTS CAST HUGE SHADOWS\n\n\tAs they move across the terrain (top of Crazy Canyon).\n\n65-A\tJUMP SHOT\n\n\tAs they jump across a gap. Thunder and lightning again (top of \n\tCrazy Canyon).\n\t\n65-B\tTHEY MOVE DOWN\n\n\tThey march across Crazy Canyon overlook.\n\n65-C\tREACTION SHOTS OF ASTRONAUTS\n\n66-\nA-R\tSERIES OF SHOTS OF DESCENT OF ASTRONAUTS DOWN SHEER FACE OF A CANYON\n \t(Wire Grass Canyon).\n\n\tFor a brief moment several \"creatures\" appear. We cannot identify the \n\tspecies.\n\n\t\t\t\t\t\t\t\tQUICK DISSOLVE T0:\n\n67\tEXT. A DRY WASH - CLOSE GROUP SHOT - DAY\n\n\tBlooming tamarisks border a. dry stream bed. Taylor and Landon hover \n\tover Dodge, who is probing the soil with his drill. Their dungarees and \n\tfaces are caked with dust.\n\n\t\t\t\tDODGE\n\t\t\tIt's a stream bed., no doubt about \n\t\t\tit -- but bone dry.\n\n\tLandon strightens up and looks off, startled by something he sees.\n\n\t\t\t\tLANDON \n\t\t\tLook. . .\n\n68\tLONG SHOT - A CLIFF BEYOND THE TAMARISKS\n\n\twith the astronauts in f.g. In the distance, on the skyline, we can \n \tmake out a long row of wooden crosses. Some animal or vegetable matter \n\tappears to be tied to the crosses.\n\n\t\t\t\tLANDON \n\t\t\tScarecrows?\n\n\t\t\t\tTAYLOR \n\t\t\tLet's take a look.\n\n\tTaylor plunges into the thicket of tamarisks, followed by Dodge and \n\tLandon. Their view of the cliff is momentarily obscured. CAMERA HOLDS \n\ton the distant crosses. For an instant only, three \"creatures\" again \n\tappear on the skyline near the crosses. Then they vanish.\n\n69\tREVERSE ANGLE - THE ASTRONAUTS\n\n\tas they emerge from the tamarisk thicket-nearer to the base of the-\n\tcliff. They halt and look up at:\n\n70\tTHE CROSSES - ANGLING UP - FROM ASTRONAUT'S P.O.V.\n\n\tWe can now see the pelts of unrecognizable animals have been bound to \n\tthe crosses and, thus mounted in a long row, seem to make a boundary\n\tor serve as a warning. The living bipeds are no longer visible.\n\n71\tBACK TO THE ASTRONAUTS\n\n\tDodge and Landon are still looking up at the strange crosses, but \n\tTaylor is scanning the terrain at the base of the cliff. The sound of \n\trushing water can be heard.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(half to himself)\n\t\t\tNever mind the scarecrows.\n\n\tHe breaks into a run, CAMERA PANNING with him as he moves toward a \n\tdeclivity in the face of the cliff.\n\n72\tMOVING SHOT - DODGE AND LANDON\n\n\tAgonized with thirst, they follow Taylor.\n\n73\tFLASH SHOT - THE TOP OF THE CLIFF\n\n\tFor an instant we see the bipeds again, moving in the same direction.\n\n74\tEXT. A DECLIVITY IN THE CLIFF - FEATURING TAYLOR\n\n\tHe scrambles up a rock-strewn gorge and looks off at the terrain \t\n\tbeyond.\n\n75\tEXT. A WATERFALL - FROM TAYLOR'S P.O.V.\n\n\tThe cascade is not spectacular, but the vegetation around it is \n\tstartlingly lush. (This location is not at Lake Powell, but at the \n\tRanch).\n\n76\tCLOSEUP - TAYLOR\n\n\tHis parched lips break into a smile.\n\n\t\t\t\t\t\t\t\tQUICK DISSOLVE TO:\n\n77\tEXT. WATERFALL AND POOL - FULL SHOT - DAY\n\n\tThe cascade has formed a cool and inviting pool. Thick foliage grows to \n\tits very edge. Dodge is on his hands and knees, testing the liquid with \n\this kit. The others wait expectantly.\n\n\t\t\t\tDODGE \n\t\t\tIt's loaded with minerals, but safe.\n\n\tWithout further ado Landon ducks his face into the pool. Dodge scoops\n\tup water in his hands and drinks. Taylor\tfollows suit.\n\n\t\t\t\tLANDON\n\t\t\t\t(coming up for air) \n\t\t\tCan we take a dip?\n\n\t\t\t\tTAYLOR\n\t\t\t\t(looks around)\n\t\t\tOkay.\n\n\tLandon and Dodge immediately remove their boots, strip down and plunge \n\tinto the pool. But Taylor does not yet disrobe. Alert and curious, he \n\tstrolls along the bank of the pool, looking around.\n\n78\tDODGE AND LANDON SWIMMNG\n\n79\tTAYLOR\n\n\tas he briefly looks around, then starts taking off his shirt.\n\n80\tDODGE AND LANDON\n\n\tas they arrive at opposite shore.\n\n81\tMED . SHOT - FAR SIDE OF POOL\n\n\tas Landon sees something on shore.\n\n82\tTAYLOR IN WATER\n\n\tas he swims across.\n\n\t\t\t\tLANDON'S VOICE \n\t\t\t\t(o.s.) \n\t\t\tHey, Taylor! Look at this --\n\n\tDodge and Taylor climb out of the pool and squat beside Landon.\n\n83\tCLOSE SHOT - WHAT THEY SEE:\n\n\tThe print of a large five-toad foot is clearly visible in the wet sand.\n\n84\tGROUP SHOT - THE THREE ASTRONAUTS\n\n\tTaylor rises and walks slowly toward the underbrush, scanning the \n\tground for other sports.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\n85\tTHE OTHER SIDE OF THE POOL - FULL PANNING SHOT\n\n\tOur view of the astronauts beyond the cascade in b.g. is partially \n\tobscured by broad-leafed foliage directly in front of CAMERA, which \n\tPANS SLOWLY away from the waterfall and HOLDS on the astronauts' \n\tclothing at the edge of the pool. Suddenly and inexplicably a pair of \n\tdungarees slithers away into the underbrush. A few seconds pass. Now a \n\tpair of bronzed and brawny shoulders fill the SCREEN, blocking our \n\tview.\n\n86\tREVERSE ANGLE - CLOSE ON A HUMAN FACE IN HEAVY FOLIAGE\n\n\tOr is it human? The hair is matted, the face bearded, the jaw \n\tprognathous, the orbital rim prominent.\n\n87\tANOTHER ANGLE - AT EDGE OF POOL\n\n\tA brown thick-fingered hand appears from behind heavy foliage and \n\tplucks at a boot. The boot vanishes.\n\n88\tBACK TO THE ASTRONAUTS - ON OTHER SIDE OF POOL\n\n\tDodge is standing near Taylor and looking back at the spot where they \n\tleft their clothing. Suddenly he seizes Taylor's arm and points \n\tsilently at the far bank of the pool. \n\n89\tWHAT THEY SEE:\n\n\tAnother pair of dungarees slithers into the underbrush and disappears.\n\n90\tREVERSE ANGLE - FULL PANNING SHOT - THE ASTRONAUTS\n\n\tLed by Taylor, they dive back into the pool and swim to the other bank. \n\tEmerging from the water, they look around in bewilderment. Taylor makes \n\thand signals to indicate absolute silence and a reconnaissance. The \n\tthree astronauts fan out and move cautiously into the jungle (or rain \n\tforest).\n\n91-\n93\tEXT. - JUNGLE (OR RAIN FOREST) - SEVERAL SHOTS - MOVING WITH THE \n\tASTRONAUT'S\n\n\tLittle sunlight penetrates this dense vegetation. These SHOTS are \n\tINTERCUT with:\n\n94\tWHAT THE ASTRONAUTS SEE:\n\n\tfleeting forms as yet unidentified; trembling foliage; brown shadows \n\tagainst a green backdrop.\n\n95\tEXT. A SMALL CLEARING - FAVORING THE THREE ASTRONAUTS\n\n\twho stop at the edge of the clearing, startled by\n\n96\tWHAT THEY SEE:\n\n\ta number of primitive bipeds, male and female, scarcely visible behind \n\ttrees and bushes on the other side of the clearing -- here a face, \n\tthere a portion of a head and torso. Throughout this sequence, the   \n\tprimitives are never seen clearly or at close range.\n\n97\tBACK TO THE AST40IONAUTS\n\n\treacting. They speak in whispers.\n\t\n\t\t\t\tLANDON\n\t\t\tMy God..they look almost human.\n\n\t\t\t\tDODGE \n\t\t\tThey -- there's a herd of them.\n\n\t\t\t\tTAYLOR\n\t\t\tShow them we're friendly.\n\n\tCAMERA PULLS BACK as Taylor advances a few steps into the clearing, \n\textending his empty hands and beaming like a politician.\n\n\t\t\t\tTAYLOR \n\t\t\t\t(warmly)\n\t\t\tGreetings!\n\n98\tREVERSE - THE STRANGE CREATURES - FROM TAYLOR'S P.O.V.\n\n\tThere are perhaps a dozen of them. They shrink back as Taylor advances \n\t-- hostile, frightened or both. We now see that some of them are \n\tclutching articles of the astronauts' clothing and equipment. Taylor \n\tstops, stares at them glumly.\n\n\t\t\t\tTAYLOR\n\t\t\tNo cigar.\n\n\t\t\t\tLANDON\n\t\t\tTry telling them our names.\n\n\tTaylor grimaces at Landon.\n\n\t\t\t\tTAYLOR\n\t\t\tWell, if we're looking for an icebreaker...\n\t\t\t\t(turning to the creatures)\n\t\t\tListen, folks .....\n\n\tMore shrinking back by the frightened primitives.\n\n\t\t\t\tDODGE \n\t\t\t\t(softly) \n\t\t\tI'm afraid they aren't having any.\n\n99-\tOUT\n102\n\n103-\tA SERIES OF FLASH SHOTS - THE JUNGLE (OR RAIN FOREST):\n105\n\n\tA pistol goes off with a deafening crash, and the primitive creatures \n\tscatter in panicky flight. After a while, quiet returns to the jungle.\n\n106\tEXT. A JUNGLE PATH - THE ASTRONAUTS\n\n\tThey examine the remnants of their clothing and equipment and start to\n\tdon whatever is able to be worn. Taylor puts on what remains of a \n\tripped pair of trousers; Dodge starts to improvise from the remnants of \n\tthe kit (it is a torn shelter half). Landon, like Taylor, has the \n\tremains of his pants.\n\n\t\t\t\tDODGE \n\t\t\tThey didn't leave much did they?\n\n\t\t\t\tLANDON \n\t\t\tShall we follow them?\n\n\t\t\t\tTAYLOR \n\t\t\tHaven't much choice.\n\n\tAs they walk off down the jungle path.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n107\tEXT. A GROVE OF FRUIT TREES - ESTABLISHING SHOT - DAY\n\n\tThis need not be a cultivated grove. A few trees (peach or apricot or \n\tavocado, it matters not) grow wild in a pleasant glade. Nor is the \n\tgrove extensive. The three astronauts sit under a tree in f.g.; the \n\tprimitives sit under a clump, of trees some fifty yards away. Each camp \n\tis feeding and warily watching the other. In the distance beyond the \n\tfruit trees is an open grassy plain or cultivated field.\n\n108\tTHE PRIMITIVES - FROM LANDON'S P.O.V.\n\n\tThey too are sitting under trees, munching fruit. There are no more \n\tthan a dozen altogether.\n\n109\tBACK TO ASTRONAUTS - CLOSE GROUP SHOT\n\n\t\t\t\tTAYLOR\n\t\t\tWell, at least they haven't\n\t\t\ttried to bite us.\n\n\t\t\t\tDODGE\n\t\t\tBlessed are the vegetarians.\n\n110\tTHE OTHER CAMP - FEATURING A YOUNG WOMAN\n\n\tSquatting on her haunches, eating fruit, gazing back at Taylor. Her \n\thair is long and black, her skin nut brown, her face hauntingly lovely \n\tand hauntingly stupid. This is NOVA.\n\n111\tBACK TO ASTRONAUTS\n\n\tLandon looks o.s. at the primitives.\n\n\t\t\t\tLANDON\n\t\t\tWe got off at the wrong stop.\n\n\t\t\t\tTAYLOR\n\t\t\tYou're our optimist Look at the bright \n\t\t\tside. If that's the best there is \n\t\t\taround here, in six months we'll be \n\t\t\trunning this planet.\n\n\t\t\t\tDODGE\n\t\t\t\t(suddenly)\n\t\t\tLook...\n\n112\tTHE PRIMITIVES - THEIR P.O.V.\n\n\tThey appear to be agitated although neither we nor the astronauts \n\thave yet heard or seen any cause for alarm. The primitives get to \n\ttheir feet, sniffing, listening\n\n113\tCLOSE GROUP SHOT - THE ASTRONAUTS\n\n\tPuzzled and alarmed by the primitives' behavior, they too get to \n\ttheir feet.\n\n\t\t\t\tLANDON\n\t\t\tThink they'll attack us?\n\n\tTaylor turns, looks back at:\n\n114\tTHE DISTANT JUNGLE (OR FOREST)\n\n\tFrom which they recently emerged. There is no sign of life.\n\n115\tLONG PANNING SHOT - THE PRIMITIVES\n\n\tThey suddenly run laterally across the grove, heading  back toward\n\ttheir jungle. A rumble becomes audible\tit is the SOUND of HOOFBEATS.\n\n116\tVERY LONG SHOT - THE JUNGLE (OR FOREST)\n\n\tTwelve \"horsemen\" suddenly emerge from the trees, riding abreast at a \n\tcanter, like a squadron of cavalry about to charge. The horses look \n\thuge. So do the riders, but at this distance we cannot identify them.\n\n117\tLONG PANNING SHOT - THE PRIMITIVES\n\n\tCut off from their natural habitat, they reverse direction and flee \n\ttoward the tall grasses of the savanna (or cultivated field).\n\n118\tLONG SHOT - THE RIDERS\n\n\tWith an exultant battle cry they break into a gallop. The hunt is on.\n\n119\tCLOSE GROUP SHOT - THE THREE ASTRONAUTS\n\n\tStupefied, frozen in place.\n\n120 \tLONG SHOT - THE RIDERS\n\n\tComing closer. We HEAR a rifle shot, then a flurry of shots.\n\n121\tMED. SHOT.\n\n\tA bullet spanks into the fruit trees above their heads. They run, \n\tCAMERA PANNING with them as they race toward the tall grass in deep \n\tb.g.\n\n122-\tA SERIES OF FLASH SHOTS - THE HUNT IN THE SAVANNA\n124\n\tAs the \"horsemen\" close in on the creatures fleeing on foot.\n\n125\tMED. CLOSE SHOT - A RIDER\n\n\tHe reins in, raises his rifle and fires. For the first time, we se that \n\the is a GORILLA. He wears a simple quasi-military uniform -- tunic, \n\ttrousers and boots.\n\n126\tFLASH SHOT - DODGE\n\n\tRunning through the high grass. He is shot in the back and falls.\n\n127\tFLASH SHOT - TAYLOR\n\n\tHe drops at the side of his fallen comrade.\n\n128\tCLOSE TWO SHOT - ANGLING DOWN ON DODGE\n\n\tAs Taylor rolls him over. Dodge is dead.\n\n129\tWIDER ANGLE SHOT - THE SAVANNA - FEATURING A LINE OF BEATERS\n\n\tThe beaters are all GORILLAS. They carry long sticks and nets, and \n\ttheir task is to flush out the terrified primitives cowering in the \n\ttall grass.\n\n130-\tA SERIES OF SHOTS - THE HUNTERS AND THE HUNTED:\n135\t\n\t(a)\tLandon flees from one rider only to be cut off by another. \n\t\tHe stumbles and a rearing stallion tramples him.\n\t\n\t(b)\tA third mounted gorilla flings a net over a running female. \n\t\tShe is hopelessly entangled. This is Nova.\n\t\n\t(c)\tLandon lies unconscious on the grassy plain, an ugly gash \n\t\ton his forehead.\n\t\n\t(d)\tTaylor crawls through the tall grass on his hands and knees. \n\t\tA rider crosses his path without seeing him.\n\t\n\t(e)\tThe beaters close in on Taylor, blocking his escape route.\n\t\n\t(f)\tTaylor changes direction and decides to run for it.\n\n136\tEXT, SAVANNA - PANNING WITH TAYLOR\n\n\tBent low, he flees through the tall grass. A SHOT rings out. Taylor \n\tfalls.\n\n137\tCLOSE ON TAYLOR\n\n\tLying on his back. His fingers go to his throat. Blood appears between \n\this fingers. He opens his mouth in pain, but no sound comes forth, as \n\tTaylor sinks into unconsciousness.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n138\tEXT. GROVE - FULL SHOT - THE HUNTERS - DAY\n\n\tThe hunting party has reassembled here beneath the fruit trees. Some of \n\tthe gorillas have dismounted; others are still on horseback. In the \n\tmiddle distance is a crude horse-drawn wagon. The sides and top of the \n\twagon form a wire cage. Three captive males and one female are visible \n\twithin the cage. Dodge and Landon are nowhere to be seen. Two gorilla \n\tporters enter scene, dragging a male human corpse by the ankles, as two \n\tother bearers enter scene with a living burden on a long carrying pole. \n\tTaylor dangles from the pole, held aloft by the bonds around his wrists \n\tand ankles. CAMERA PANS with the two gorillas as they dump Taylor into \n\tthe wagon and close the tail gate.\n\n139-\tOUT\n140\n\n141\tCLOSE ON TAYLOR - WITHIN WAGON CAGE\n\n\tHis throat is smeared with blood. His eyelids flutter as he regains \n\tconsciousness.\n\n142\tCLOSE SHOT - WHAT TAYLOR SEES:\n\n\tThree primitive males bound hand and foot. They seem docile in\n \tcaptivity. The female, Nova, clasps bound wrists around her bound \n\tankles and gazes blankly at Taylor. There is a JOLT of MOVEMENT as the\n \twagon gets underway\n\n143\tCLOSE ON TAYLOR\n\n\tWith a great effort he raises himself on one elbow and looks out from \n\tthe cage.\n\n144\tTRUCKING WITH THE WAGON - WHAT TAYLOR SEES:\n\n\tA gorilla hunter stands over a dead man, one foot planted he chest of \n\this kill and his rifle butt resting on the on   abdomen. Facing him is \n\tanother gorilla with an old-fashioned camera on a tripod.\n\n\t\t\t\tAPE PHOTOGRAPHER\n\t\t\tSmile.\n\n\tThe hunter bares his teeth.\n\n145 \tCLOSE ON TAYLOR\n\n\tHe faints.\n\n\t\t\t\t\t\t\t\tFADE OUT\n\n\t\t\t\t\t\t\t\tFADE IN\n\n146\tINT. A SURGERY - ANGLING DOWN ON TWO OPERATING TABLES NIGHT\n\n\tThe surgery is dimly-lit. (If possible we should be unaware of the \n\tsource of illumination.) Taylor lies strapped to the nearer table. He \n\tappears to be unconscious. The young female captive, Nova, is strapped \n\tto the table beside him. She is conscious. Taylor is receiving a direct \n\tblood transfusion from her.\n\n\tHovering over Taylor are a NURSE and a surgeon named GALEN. Both are \n\tchimpanzees. Galen wears a bloody surgical apron, the nurse a white \n\tsmock. Galen is removing a filthy bandage from Taylor's neck. A door \n\tbehind them opens and DR. ZIRA, an animal psychologist,\tenters. She, \n\ttoo, is a chimpanzee and wears a smock like the nurse's.\n\n\t\t\t\tZIRA \n\t\t\tWhich one was wearing the strange \n\t\t\tclothes?\n\n\t\t\t\tGALEN\n\t\t\tHim.\n\n\tZira looks down at Taylor.\n\n\t\t\t\tZIRA\n\t\t\tWill he live?\n\n\t\t\t\tGALEN \n\t\t\t\t(irritably) \n\t\t\tI don't know. This beast lost a lot \n\t\t\tof blood.\n\n\tGalen paws through a tray of surgical instruments. The equipment is \t\n\tobsolescent and the room untidy -- like that of a callous small-town \n\tveterinarian.\n\n\t\t\t\tGALEN\n\t\t\t\t(to Nurse )\n\t\t\tThere's no probe here. Find one!\n\n\t\t\t\tNURSE\n\t\t\tYes, sir.\n\n\tShe exits. Zira runs a forefinger across a dusty table.Her voice is \n\tsoft and well-modulated.\n\n\t\t\t\tZIRA\n\t\t\tThis place is dirty, doctor.\n\n\t\t\t\tGALEN \n\t\t\t\t(defensively) \n\t\t\tThese animals are dirty, doctor. They \n\t\t\tstink, and they carry communicable \n\t\t\tdiseases. Why aren't they cleaned up \n\t\t\tbefore they're brought here?\n\n147\tCLOSE TWO SHOT - TAYLOR AND NOVA\n\n\tHis eyes come open. Over this we hear:\n\n\t\t\t\tZIRA'S VOICE \n\t\t\t\t(o.s.) \n\t\t\tYou don't sound happy in your work.\n\n\t\t\t\tGALEN'S VOICE \n\t\t\t\t(o.s.) \n\t\t\tI'm nothing more than a vet in this \n\t\t\tlaboratory...\n\n\tTaylor feebly turns his head and looks at Nova. She returns his gaze \n\twith an unchanged empty stare. We sense that Taylor realizes her blood \n\tis flowing into his veins. Over this we hear:\n\n\t\t\t\tGALEN'S VOICE \n\t\t\t\t(o.s.) \n\t\t\tYou promised to speak to Dr. Zaius \n\t\t\tabout me.\n\n\t\t\t\tZIRA'S VOICE \n\t\t\t\t(o.s.) \n\t\t\tI did. But you know how he looks down \n\t\t\this nose at chimpanzees.\n\n\tTaylor rolls his eyes toward the apes. Weak as he is,we see his \n\tastonishment at hearing them talk.\n\n148\tBACK TO GROUP AROUND OPERATING TABLE\n\n\tas the Nurse reenters with a probe and hands it to Dr. Galen, who \n\tprotests to Zira:\n\n\t\t\t\tGALEN \n\t\t\tBut the quota system's been abolished! \n\t\t\tYou made it. Why can't I?\n\n \t\t\t\tZIRA\n\t\t\tWhat do you mean, made it? I'm an \n\t\t\tanimal psychologist, that's all. We \n\t\t\tdon't have any authority.\n\n\t\t\t\tGALEN \n\t\t\tYou do pretty well when it comes to \n\t\t\tgetting space and equipment.\n\n\t\t\t\tZIRA \n\t\t\tThat's because Dr. Zaius realizes our \n\t\t\twork has value.\n\n\t\t\t\tGALEN\n\t\t\tHmph.\n\n\t\t\t\tZIRA \n\t\t\tThe foundations of scientific brain \n\t\t\tsurgery are being laid right here - \n\t\t\tin studies of cerebral function in \n\t\t\tthese animals.\n\n\t\t\t\tGALEN \n\t\t\tThey're still dirty. And their bite is \n\t\t\tseptic. Look at that ...\n\n\tHe shows Zira infected teeth marks on the back of his left hand.\n\n\t\t\t\tGALEN \n\t\t\t\t(to Nurse) \n\t\t\tHold his head.\n\n\tThe Nurse complies, gripping Taylor's skull with both hands. Galen \n\tleans down and begins to probe the throat wound. Taylor passes out.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n149\tINT. A ROW OF CAGES - ANIMAL LABORATORY - TRACKING SHOT DAY\n\n\tThe cages are no larger than small jail cells. There are four of them. \n\tBars, not walls, divide the cages, so that all four are visible. Each \n\tof the first three cages is occupied by a primitive male. At the moment \n\tthe first two are quiet -- dozing or scratching apathetically. The \n\tthird occupant is stolidly regarding a half-dozen brightly colored \n\thollow wooden boxes, or blocks, Of varying sizes and proportions on the \n\tfloor of his cage. He is trying to stack the boxes in such a way as to \n\treach a banana dangling from a cord twelve feet overhead. He has \n\tcorrectly selected the first two large, sturdy blocks for his tower \n\tunder the banana -- but the tall third block is too unstable on its \n\tsmall base to support the broad-based fourth block.\n\n149-A\tCLOSE - TAYLOR\n\n\tTaylor, Looking much stronger, sits on a pile of dirty straw in the \n\tfourth cage. There is a clean bandage around his throat. He watches the \n\tblock-building primitive with contemptous amusement.\n\n\tBoth the third and fourth blocks tumble to the floor when the primitive \n\ttries to mount his tower. He stands there, staring dully at the \n\tscattered blocks, then up at the unattainable banana.\n\n149-B\tMED. - THE\tLABORATORY\n\t\n\tA door at the end of the aisle opens and a gorilla named JULIUS enters, \n\tdressed in a keeper's uniform. He quickly closes the door, snatches up \n\ta broom, starts sweeping. Julius is obviously late for work. Taylor \n\tstruggles to his feet, moves to the bars of the cage, tries to call \n\tout.\n\n\t\t\t\tTAYLOR \n\t\t\t\t(soundlessly) \n\t\t\tHey! Hey!\n\n\tThe three other primitives move toward the bars of their cages. Julius \n\tbarks at them.\n\n\t\t\t\tJULIUS\n\t\t\tSimmer down!\n\t\t\t\t(points at Taylor) \n\t\t\tYou especially.\n\n\tThe third primitive goes back to stacking his blocks. Julius comes up \n\tto Taylor's cage, indicates a like set of blocks strewn across its \n\tfloor, extends his broom handle to whack the banana overhead.\n\n\t\t\t\tJULIUS \n\t\t\tBetter give it a try, stupid. Unless \n\t\t\tyou like going hungry.\n\n\tHe returns to his sweeping. Taylor glowers at him. A moment later, the \n\tdoor at the end of the aisle opens and Dr. Zira enters.\n\n\t\t\t\tJULIUS\n\t\t\tGood morning, Dr. Zira.\n\n\t\t\t\tZIRA \n\t\t\tGood morning, Julius. How's our patient \n\t\t\ttoday?\n\n\t\t\t\tJULIUS \n\t\t\tNo change. The minute you open the door, \n\t\t\the goes into his act.\n\n\tShe starts down the aisle toward Taylor's cage. He grasps the bars, \n\tawaiting her anxiously. As she passes the second cage, the primitive in \n\tit shakes the bars, jumps up and down. His tongue is hanging out. Zira \n\tsmiles, stops, digs into the pocket of her smock.\n\n\t\t\t\tZIRA \n\t\t\t\t(playfully) \n\t\t\tWell, what do we want this morning? Do \n\t\t\twe want something? Speak! Come on, speak!\n\n\tThe primitive continues to jump up and down energetically. Zira takes a \n\tcube of sugar from her pocket, holds it up for his inspection.\n\n\t\t\t\tZIRA\n\t\t\tDo we want some sugar, old-timer?\n\n\tThe man eagerly sticks his hand through the bars. She drops the cube in \n\this hands. He jams it into his mouth.\n\n\t\t\t\tJULIUS \n\t\t\t\t(concerned) \n\t\t\tYou could get hurt doing that, Doctor.\n\n\t\t\t\tZIRA\n\t\t\tDon't be silly. He's perfectly tame.\n\n\tShe moves toward Taylor's cage, Julius behind her.\n\n\t\t\t\tJULIUS \n\t\t\tThey're all tame until they take a \n\t\t\tchunk out of you.\n\n150\tCLOSE SHOT - FEATURING TAYLOR - ZIRA AND JULIUS\n\n\tTaylor starts to open his mouth as Zira comes up to the bars.\n\n\t\t\t\tZIRA\n\t\t\tWell, Bright Eyes, is our throat\n\t\t\tfeeling better?\n\n\t\t\t\tTAYLOR\n\t\t\t\t(frantic mouthing)\n\t\t\tListen, listen -- I can speak --\n\n\tHe winces, puts his hand to the bandage.\n\n\t\t\t\tZIRA\n\t\t\t\t(sympathetically)\n\t\t\tAwww, it still hurts, doesn't it?\n\n\t\t\t\tJULIUS \n\t\t\tSee? He keeps pretending he can \n\t\t\ttalk.\n\n\tTaylor glares at Julius, slams the bars.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(mouthing)\n\t\t\tI'm not pretending! I can talk!\n\n\tZira hurriedly takes a pen and notebook from the breast Docket of her \n\tsmock, starts to scribble.\n\n\t\t\t\tZIRA\n\t\t\t\t(excitedly)\n\t\t\tDid you see that? It's remarkable!\n\n\t\t\t\tJULIUS\n\t\t\tHuh?\n\n\t\t\t\tZIRA\n\t\t\tHe's trying to form words.\n\n\t\t\t\tJULIUS\n\t\t\tWell, you know what they say.\n\t\t\tHuman see, human do.\n\n\tTaylor is staring in silent fascination at the open and notebook.He \n\tstops mouthing, points at them.\n\n\t\t\t\tJULIUS\n\t\t\tNow what?\n\n\tTaylor gestures for Zira to come closer to the bars.\n\n\t\t\t\tZIRA\n\t\t\tHe seems to want something.\n\n\tShe advances tentatively toward the cage.\n\n\t\t\t\tJULIUS\n\t\t\tI'd be careful, doctor.\n\n\tTaylor suddenly reaches through the bars, tries to snatch the pen and \n\tnotebook from Zira. Julius instantly jabs his broom handle through the \n\tbars, hitting Taylor in the ribs.\n\n\t\t\t\tJULIUS \n\t\t\tWhat did I tell you! \n\t\t\t\t(to Taylor) \n\t\t\tTry that again, I'll break your arm!\n\n\tZira draws back, looking at Taylor in surprise.\n\n151\tCLOSER - TAYLOR\n\n\tHis face is twisted in frustration.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(mouthing)\n\t\t\tWhat's the matter with you? I can\n\t\t\ttalk! Can't you see that?\n\n\tOver this a door is heard opening o.s., and Julius' voice, nervous, \n\tdeferential:\n\n\t\t\t\tJULIUS' VOICE \n\t\t\t\t(o.s.)\n\t\t\tGood morning, Your Excellency.\n\n\tTaylor looks o.s.\n\n152-\tOUT\n160\n\n161\tBOOM SHOT - THE THREE APES - FROM TAYLOR'S P.O.V.\n\n\tJulius and Zira cross to a stout, imposing orangutan who has just \n\tentered the laboratory. Julius bows to him. This is DR. ZAIUS. Like the \n\tother apes, he wears a simple tunic and trousers, but his garments are \n\tof a Costlier material, and several decorations are woven into the sash \n\tof his tunic.\n\n\t\t\t\tZIRA \n\t\t\t\t(bubbling) \n\t\t\tDr. Zaius, I'm so glad you could come. \n\t\t\tHe's over here.\n\n\tZaius crosses with them to Taylor's cage. Beneath his austere manner, \n\twe sense tension, worry. Zira looks up at Taylor, her tone an appeal.\n\n\t\t\t\tZIRA\n\t\t\tBright Eyes, show him! Go ahead!\n\t\t\tDo your trick!\n\n\tTaylor just glares at her.\n\n\t\t\t\tZIRA\n\t\t\tSpeak! Go on.\tSpeak again.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(silent mouthing) \n\t\t\tMy - name - isn't - Bright Eyes It's \n\t\t\tTaylor!\n\n\t\t\t\tZIRA \n\t\t\tThere! Can you believe it? I looks \n\t\t\tlike he's talking.\n\n\t\t\t\tZAIUS \n\t\t\t\t(evenly) \n\t\t\tYes, amusing. A man who acts like an ape.\n\n\tTaylor turns to Zaius.\n\n\t\t\t\tTAYLOR \n\t\t\t\t(silent mouthing) \n\t\t\tI'm not acting! I can talk! How much \n\t\t\tproof do you want?\n\n\t\t\t\tZIRA \n\t\t\t\t(thunderstruck) \n\t\t\tDr. Zaius, I could have sworn he was \n\t\t\tanswering you!\n\n\t\t\t\tZAIUS \n\t\t\t\t(nodding, but unmoved) \n\t\t\tHe shows a definite gift for mimicry.\n\n\tZira wiggles her fingers excitedly.\n\n\t\t\t\tZIRA\n\t\t\tI wonder how held score on a Hopkins\n\t\t\tmanual dexterity test?\n\n\tZaius' voice is quiet, but there is steel in it.\n\n\t\t\t\tZAIUS\n\t\t\tAn animal?\n\n\t\t\t\tJULIUS\n\t\t\tLook!\n\n\tTaylor is frantically wiggling his fingers.\n\n\t\t\t\tZIRA\n\t\t\tHe's moving his fingers!\n\n\t\t\t\tZAIUS\n\t\t\tOf course. He saw you moving yours.\n\n\t\t\t\tZIRA\n\t\t\tBut perhaps he understood --\n\n161-A\tCLOSE - TAYLOR \n\n\tHe is pleading silently as Zaius' voice is heard over the SHOT.\n\n\t\t\t\tZAIUS' VOICE \n\t\t\t\t(o.s., hard) \n\t\t\tMan has no understanding, Dr. Zira. \n\t\t\tHe can be taught a few simple tricks. \n\t\t\tNothing more.\n\n\t\t\t\tZIRA'S VOICE\n\t\t\t\t(o.s.)\n\t\t\tI beg to disagree. According to my exper-\n\t\t\timents --\n\n161-B\tCLOSE - ZAIUS\n\n\tA warning burns out of his eyes as he stares at Taylor.\n\n\t\t\t\tZAIUS \n\t\t\tA word to the wise, Dr. Zira. Experimental \n\t\t\tbrain surgery on these creatures is one \n\t\t\tthing. I'm all for it.\n\n161-C\tCLOSER - TAYLOR\n\n\tFear clouds his eyes. Abruptly, he stops moving his lips.\n\n161-D\tMED. THE GROUP\n\n\tZaius sees the effect his words have had on Taylor. He turns to Zira, \n\tgoes on in a more detached tone.\n\n\t\t\t\tZAIUS \n\tBut your behavioral studies are another matter entirely. To suggest \n\tthat we can learn something about simian nature from a study of man is \n\tnonsense. Besides, men are a nuisance. They outgrow their own food \n\tsupply in the forest and migrate to our green belts and ravage our \n\tcrops. \n\t\t\t\t(looking casually \n\t\t\t\tat Taylor) \n\tThe sooner they're exterminated, the better.\n\n\tHe turns toward the door. A disappointed Zira follows him. Zaius looks \n\tback at Taylor just before going out.\n\n\t\t\t\tZAIUS\n\t\t\tIt's a question of simian survival.\n\n161-E\tCLOSE - TAYLOR\n\n\tHe stares after Zaius, than looks away, slumps to the floor. A pause, \n\tthen a VOICE is heard.\n\n\t\t\t\tAPE GUARD\n\t\t\tIs this the one you wanted, Doctor?\n\n\t\t\t\tZIRA'S VOICE \n\t\t\t\t(o.s.)\n\t\t\tYes, thank you.\n\t\t\t\t(pause, her voice \n\t\t\t\tmuch closer) \n\t\t\tBright Eyes?\n\n\tTaylor looks up.\n\n\t\t\t\tZIRA'S VOICE \n\t\t\t\t(o.s.)\n\t\t\tI've got a present for you.\n\n161-F\tANOTHER ANGLE - THE CAGE\n\n\tStanding outside the cage, held on a leash by an APE GUARD  is Nova. \n\tShe looks at Taylor without expression. Zira gestures at JULIUS.\n\n\t\t\t\tZIRA\n\t\t\tPut her in with him.\n\n\tJulius unlocks the cage door-, leads Nova inside, removes her leash and \n\tcollar. Taylor has gotten to his feet. Julius goes out, locking the \n\tdoor behind him. Nova hesitates, then slowly reaches out, takes \n\tTaylor's hand. Zira beams at them.\n\n162-\tOUT\n169\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n170\tEXT.-  EXERCISE YARD - ANIMAL COMPOUND - ESTABLISHING SHOT DAY\n\n\tIt is nothing elaborate, A wire fence encloses a dirt yard. This \n\tcompound is situated on the outskirts of Apetown and the town is \n\tvisible in the distance.\n\n\tThere are about a dozen adult human captives within the enclosure, no \n\tmore than a third of them females. Some of them trudge around the dusty \n\tyard like convicts in a penitentiary. Others squat against the sun-\n\tdrenched wall.\n\n\tA big male suddenly runs to the fence and tries to climb it. Several \n\tguides, armed with whips and torches, immediately close in on him. The \n\tprimitive recoils in fear from a fiery torch and rejoins the captives' \n\tcircle.\n\n171\tCLOSER ANGLE - THE YARD - FEATURING TAYLOR\n\n\tHe plods sullenly back and forth across the rear of the yard, \n\toccasionally glancing off toward the approaches to the compound. Nova \n\tis at his heels. He ignores her. Once again he looks off, stops \n\tsuddenly. Nova bumps into him. He turns, impatiently shoos her away, \n\tthen looks o.s., again.\n\n172\tZIRA AND COMPANION - TAYLOR'S P.O.V.\n\n\tZira can be seen approaching with a young chimpanzee, DR. CORNELIUS. He \n\twears a simple smock over his tunic and trousers. Cornelius glances \n\tsurreptitiously around, covertly takes Zira's hand.\n\n\t\t\t\tCORNELIUS\n\t\t\tDo you have to work tonight?\n\n\t\t\t\tZIRA \n\t\t\tNo.\n\n\t\t\t\tCORNELIUS \n\t\t\tNeither do I.\n\n\tHe gives her a quick peck on the cheek.\n\n173\tCLOSER - TAYLOR\n\n\tHe drifts toward the fence, Nova behind him.\n\n174\tMED. SHOT - ZIRA AND CORNELIUS\n\n\tThey come up to the fence. Zira nods toward Taylor.\n\n\t\t\t\tZIRA \n\t\t\tThat's Bright Eyes. The one I was telling \n\t\t\tyou about.\n\n\t\t\t\tCORNELIUS \n\t\t\tWhat's so special about him?\n\n\t\t\t\tZIRA\n\t\t\tWatch.\n\t\t\t\t(to Taylor)\n\t\t\tHello, Bright Eyes. How's our\n\t\t\tthroat today?\n\n\tTaylor stares at her impassively, then looks around to a that no guards \n\tare watching, hunkers down, begins to scratch in the dust. Nova extends \n\tunclean fingers to touch the bandage on his throat. Taylor flinches, \n\tpushes her hand away. Nova touches a bluish bruise on the inside of her \n\town forearm, then searches for a similar bruise on Taylor's forearm.\n\n\t\t\t\tZIRA \n\t\t\t\t(excited)\n\t\t\tLook -- she remembers.\n\n\t\t\t\tCORNELIUS\n\t\t\tRemembers what?\n\n\t\t\t\tZIRA\n\t\t\tThe blood transfusion.\n\n\t\t\t\tCORNELIUS \n\t\t\t\t(peeved)\n\t\t\tZira, come on. You know they\n\t\t\tcan't --\n\t\t\t\t(he stops, looking off)\n\t\t\tOh oh. Here comes Number One.\n\n\tTaylor looks up and o.s., quickly rises.\n\n175\tANOTHER ANGLE - THE YARD - FEATURING DR. ZAIUS\n\n\tWho is approaching the two scientists from deep b.g. Zaius is followed \n\tby a huge and much decorated gorilla Whom we recognize as the Leader of \n\tthe Hunt Club.\n\t\n\t\t\t\tZIRA\n\t\t\t\t(in a whisper, to\n\t\t\t\tCornelius)\n\t\t\tSomething's bothering him. He's\n\t\t\tbeen prying around the lab for the last \n\t\t\ttwo days ...\n\n\t\t\t\tZIRA  \n\t\t\t\t(as Zaius comes \n\t\t\t\tnearer) \n\t\t\tGood morning, Dr. Zaius. You know Dr. \n\t\t\tCornelius, my fiance.\n\n\tCornelius bows respectfully. Zaius is patronizingly polite.\n\n\t\t\t\tZAIUS\n\t\t\tOh, yes -- the young ape with\n\t\t\ta shovel. I hear you're planning\n\t\t\tanother archeological expedition.\n\nA-175\tMED. SHOT - TAYLOR\n\n\tHe has stepped back from the marks he made in the-dust, is watching \n\tZaius with concern.\n\n\t\t\t\tCORNELIUS' VOICE \n\t\t\t\t(o.s.)\n\t\t\tYes, sir. If the academy agrees.\n\n\t\t\t\tZAIUS' VOICE\n\t\t\t\t(o.s.) \n\t\t\tThe project will require my support, of \n\t\t\tcourse.\n\n176\tMED. CLOSE SHOT - ANGLING DOWN ON TAYLOR AND NOVA\n\n\tA primitive male squats down to see what Taylor has marked on the \n\tground. In letters a foot high he has written:\n\n\t\t\tI CAN WRITE\n\n\tNova, at once petulant and playful, erases the WRITE with a bare foot. \n\tTaylor angrily flings her aside. This violence provokes the primitive \n\tmale, who snarls at Taylor and cuffs him. Over this we HEAR from a \n\tdistance:\n\n\t\t\t\tCORNELIUS' VOICE\n\t\t\t\t(o.s.)\n\t\t\tI hope I can count on it, sir.\n\n\t\t\t\tZAIUS' VOICE\n\t\t\t\t(o.s)\n\t\t\tA friendly warning, Cornelius --\n\t\t \twhen you're digging for artifacts,\n\t\t\tdon't bury your reputation.\n\n\tTaylor slugs the snarling male, who wades in, trying to bite him.\n\n\t\t\t\tA VOICE\n\t\t\t\t(o.s.)\n\t\t\tGuards!\n\n177\tWIDER ANGLE - THE FIGHT\n\n\tTwo gorilla guards rush in to break up the fight. One of them lashes \n\tout with his whip. The other pokes his torch at Taylor. Its flame \n\tbrushes his arm. Taylor opens his mouth, gives a silent yell of pain, \n\tshrinks back. Zira runs to the fence.\n\n\t\t\t\tZIRA \n\t\t\t\t(to guards) \n\t\t\tStop! You've hurt him! Take them inside!\n\n\tProdding the malcreants with their torches, the two guards herd them \n\ttoward a doorway in the wall. Zira hurries around the side of the fence \n\tand o.s.\n\n178\tMED. SHOT - ZAIUS, CORNELIUS, HUNT CLUB LEADER\n\n\t\t\t\tZAIUS \n\t\t\tCornelius, if you have a moment today, I'd \n\t\t\tlike to discuss this expedition of yours \n\t\t\tin more detail.\n\n\t\t\t\tCORNELIUS \n\t\t\t\t(eagerly) \n\t\t\tCertainly, sir. I'll get my notes and come \n\t\t\tright over.\n\n\tHe exits hurriedly. The Hunt Club Leader turns to Zaius.\n\n\t\t\t\tHUNT CLUB LEADER \n\t\t\tI don't understand these animal psychologists. \n\t\t\tWhat's Dr. Zira trying to prove? \n\n\t\t\t\tZAIUS\n\t\t\tThat man can be domesticated.\n\n\tThe hunter guffaws. Zaius turns away and looks down at:\n\n179\tTHE DUST UNDERFOOT\n\n\tJust beyond the fence we can make out the letters:\n\n\t\t\tI CAN\n\n\tZaius' extended foot appears beneath the bottom wire of the fence. The \n\tfoot wipes out the letters.\n\n180\tCLOSEUP - ZAIUS\n\n\tHis face is a mask.\n\n181\tINT. TAYLOR'S CAGE - MED. SHOT - DAY\n\n\tHe is slumped against the bars of the cell, gingerly touching a large, \n\treddening blotch on his arm. Julius watches him uncertainly from a few \n\tyards away . In the b.g., the outside door opens and Zira rushes in, \n\thurries down the aisle.\n\n\t\t\t\tJULIUS \n\t\t\tWhat happened?\n\n\t\t\t\tZIRA \n\t\t\tThose fools and their torches! Do you \n\t\t\thave any ointment?\n\n\t\t\t\tJULIUS \n\t\t\tI'll see.\n\n\tHe moves to a cabinet at the other end of the laboratory, rummages \n\tthrough some drawers.\n\n182\tMED. SHOT - ZIRA - FROM TAYLOR'S P.O.V.\n\n\tZira comes up to Taylor's cage, studies him solicitously.\n\n\t\t\t\tZIRA\n\t\t\tI'm sorry, Bright Eyes.\n\n183\tANOTHER ANGLE - TO INCLUDE TAYLOR\n\n\tHe looks steadily at Zira, who is only an arm's length away. CAMERA \n\tMOVES IN on them. Suddenly Taylor reaches out, snatching the pen and \n\tnotebook from the pocket of her smock. Zira leaps back with a cry. \n\tJulius grabs a club, races up to the cage, unlocks the door.\n\n\t\t\t\tJULIUS\n\t\t\tI told you what you'd get!\n\n184\tWIDER ANGLE - TO INCLUDE THEM ALL\n\n\tTaylor is scribbling furiously on a sheet of note paper. The guard \n\tmoves in, his club upraised.\n\n\t\t\t\tZIRA\n\t\t\t\t(pleading)\n\t\t\tJulius, don't. It doesn't matter.\n\n\tJulius swings his-club at Taylor's head. Taylor lifts his right arm to \n\tward off the blow, and the stick strikes him sharply on the hand. He \n\tdrops the pen and notebook. The guard swings again, driving Taylor to \n\tthe wall. Then Julius retrieves the stolen articles.\n\n185\tANOTHER ANGLE - FAVORING ZIRA\n\n\tThe guard returns her pen and notebook with the comment:\n\n\t\t\t\tJULIUS \n\t\t\tNatural born thieves, aren't they?\n\n\tZira glances at the notebook. Her face clouds.\n\n186\tINSERT - WHAT SHE READS:\n\n\tA hasty, almost illegible scrawl:\n\n\t\tMY NAME IS TAYLOR.\n\n187\tCLOSEUP - ZIRA\n\n\tHer eyes afire with a wild surmise.\n\n188\tTWO SHOT - ZIRA AND JULIUS\n\n\tHer eyes never leave Taylor as she tells the guard:\n\n\t\t\t\tZIRA \n\t\t\tGet me a collar and leash. I'm \n\t\t\ttaking him to the infirmary.\n\n\t\t\t\tJULIUS \n\t\t\tHe's vicious, Doctor. Besides, it's \n\t\t\tagainst the rules.\n\n\t\t\t\tZIRA \n\t\t\tDo as I say.\n\n\tThe guard shrugs and moves Off 0.3. Zira beckons to Taylor. He comes \n\tforward to the bars of the cage.\n\n\t\t\t\tZIRA \n\t\t\t\t(sotto voce) \n\t\t\tYou wouldn't hurt me, would \n\t\t\tyou... Taylor?\n\n189\tINT. DR. CORNELIUS' OFFICE - ESTABLISHING SHOT - DAY\n\n\tThe office is simple, almost Spartan. There are books but no bric-a-\n\tbrac; several painted portraits of Great Apes but no tape recorder or \n\tother modern office equipment. Taylor sits at a desk, scribbling \n\tfuriously on a sheet of paper. His leash has been removed, but not his \n\tcollar. Zira stands at his elbow. Cornelius paces nervously up and \n\tdown, reading a sheaf of notes Taylor has already written.\n\n\t\t\t\tCORNELIUS\n\t\t\t\t(stubbornly)\n\t\t\tIt's a stunt. Humans don't write.\n\n\t\t\t\tZIRA\n\t\t\tDear, you're a scientist. Don't\n\t\t\tyou believe your own eyes?\n\n\t\t\t\tCORNELIUS\n\t\t\t\t(to Taylor)\n\t\t\tWhere did you learn to do this?\n\n190\tANOTHER ANGLE - THE OFFICE\n\n\tTaylor scribbles something on a small desk pad, rips off the page, \n\thands it to Cornelius.\n\n\t\t\t\tCORNELIUS \n\t\t\tJefferson Public School, Fort Wayne, \n\t\t\tIndiana?\n\n\tHe looks at Taylor narrowly. Taylor nods.\n\n\t\t\t\tCORNELIUS \n\t\t\t\t(sardonically) \n\t\t\tBack on that planet you say you came from? \n\t\t\t\t(Taylor nods again) \n\t\t\tUm-hm. \n\t\t\t\t(to Zira) \n\t\t\tHe may be intelligent, but he's also mad.\n\n\tTaylor scribbles something else on the pad, hands it to Zira, points at \n\tCornelius.\n\n\t\t\t\tZIRA\n\t\t\t\t(reads aloud)\n\t\t\t'And you're a fool'.\n\n\tShe smiles. Cornelius bristles.\n\n\t\t\t\tCORNELIUS\n\t\t\tNow, just a minute --\n\n\t\t\t\tZIRA\n\t\t\tOh, Cornelius, be quiet.\n\n\tTaylor has resumed writing. He hands the sheet to Zira, who reads \n\taloud.\n\n\t\t\t\tZIRA \n\t\t\t'Dodge was killed in the hunt. What \n\t\t\thappened to Landon?' \n\t\t\t\t(looking at Taylor) \n\t\t\tI don't know.\n\n\t\t\t\tCORNELIUS \n\t\t\t\t(scornfully) \n\t\t\tAnd they fell out of the sky with you?\n\n\tTaylor writes quickly, hands the note to Zira.\n\n\t\t\t\tZIRA\n\t\t\t\t(reading)\n\t\t\t'Not fell -- flew!'\n\n\tTaylor impatiently begins to fold a sheet of paper.\n\n\t\t\t\tCORNELIUS\n\t\t\tFlight is a scientific impossibility.\n\n\t\t\t\tZIRA\n\t\t\tAnd even if it weren't, why fly?\n\t\t\tWhere would it get you?\n\n\tTaylor points to the floor and mouths the word \"Here.\" He flings the \n\tpaper plane he has just fashioned into the air. It describes a graceful \n\tarc around the room and lands at the feet of Cornelius, who slowly \n\tpicks it up, then exchanges a long glance with Zira.\n\n\t\t\t\tCORNELIUS\n\t\t\t\t(softly)\n\t\t\tWell, now...\n\n\tTaylor scribbles on a piece of paper, hands it to Zira.\n\n\t\t\t\tZIRA\n\t\t\t\t(reading)\n\t\t\t'Do you have maps?'\n\n\tCornelius puts the paper plane on his desk, crosses to a wall map \n\tdesigned like a window shade. He pulls it down Taylor and Zira join him \n\tat the map.\n\n191\tCLOSE ON MAP\n\n\tIt's not a map of the whole planet, of course, but only of that portion \n\tknown to the apes. Therefore it has the antique and fragmentary aspect \n\tof a map drawn by some Babylonian cartographer.\n\n\tA swatch of blue at the right margin indicates a sea. In the southwest \n\tquadrant are the \"greenbelts\" of the ape civilization, looking on the \n\tmap like jade stones strung on crescent-shaped necklace. Rubyidots in \n\tthe lade indicate ape communities. The northwest quadrant, colored \n\tbrown, is apparently uninhabited. East of the green belts is a patch of \n\tgreen savanna, and next to it the darker green of a jungle. The eastern \n\tquadrants are rendered in yellow, and except for a blue lake, appear to \n\tbe lifeless desert and barren mountain. This area is marked FORBIDDEN \n\tZONE.\n\n\tUsing a pointer, Cornelius orients Taylor, indicating a red dot in the \n\tmiddle of the green belt.\n\n\t\t\t\tCORNELIUS\n\t\t\tWe are here ...\n\t\t\t\t(moving pointer)\n\t\t\tYou were captured about here.\n\n\tTaylor studies the map, then pointing at the lake in the eastern \n\tdesert, he goes into a brief charade, dramatizing the astronauts' \n\tlanding and trek.\n\n\t\t\t\tZIRA \n\t\t\t\t(interpreting his \n\t\t\t\tmovements) \n\t\t\tYou fell in the water here? ... you came \n\t\t\tashore ... you marched across the desert ... \n\t\t\tthe mountains ... many days and nights ... \n\t\t\tand reached the jungle.\n\n\tTaylor nods, smiles gratefully.\n\n\t\t\t\tCORNELIUS\n\t\t\t\t(flatly)\n\t\t\tOut - of - the - question!.\n\n\tTaylor slams his fist against the wall in frustration.\n\n\t\t\t\tZIRA \n\t\t\t\t(annoyed) \n\t\t\tCornelius, why do you insist on \n\t\t\tprovoking him?\n\n\t\t\t\tCORNELIUS \n\t\t\t\t(tapping map) \n\t\tNo creature can survive in that part of \n\t\tthe Forbidden Zone. I've been there. I've \n\t\tseen it.\n\n192\tWIDER ANGLE - THE THREESOME\n\n\tTaylor strides to the desk, writes something, hands it to Zira.\n\n\t\t\t\tZIRA\n\t\t\t\t(reading)\n\t\t\t'Then how do you account for me?,\n\n\t\t\t\tCORNELIUS \n\t\t\tI don't. And I'm not going to try.\n\n\t\t\t\tZIRA \n\t\t\tBut what about your theory? The existence \n\t\t\tof someone like Taylor might prove it.\n\n\t\t\t\tCORNELIUS \n\t\t\t\t(shushing her) \n\t\t\tZira, are you trying to get my head cut \n\t\t\toff?\n\n\t\t\t\tZIRA \n\t\t\tDon't be foolish. If it's true, they'll \n\t\t\thave to accept it.\n\n\t\t\t\tCORNELIUS \n\t\t\tNo, they won't -\n\n\tTaylor touches Zira on the arm, makes a gesture of inquiry.\n\n\t\t\t\tZIRA \n\t\t\tCornelius has developed a brilliant \n\t\t\thypothesis -\n\n\t\t\t\tCORNELIUS\n\t\t\t\t(quickly)\n\t\t\tIt's probably wrong --\n\n\t\t\t\tZIRA \n\t\t\t-- that the ape evolved from a lower order \n\t\t\tof primate, possibly man. In his trip to \n\t\t\tthe Forbidden Zone he discovered traces of a \n\t\t\tculture older than recorded time -\n\n\t\t\t\tCORNELIUS\n\t\t\tThe evidence was very meager --\n\n\t\t\t\tZIRA\n\t\t\tYou didn't think so then.\n\n\t\t\t\tCORNELIUS \n\t\t\tThat was before Dr. Zaius and half the \n\t\t\tAcademy said the idea was heresy.\n\n\t\t\t\tZIRA \n\t\t\tHow can scientific truth be heresy? What \n\t\t\tif Taylor is exactly the proof you needed? \n\t\t\tA mutation. A missing link between the \n\t\t\tunevolved primate and the ape -\n\n\tTaylor bangs his fist on the desk, mouths the word \"No!\" scribbles \n\tsomething on a piece of paper.\n\n\t\t\t\tCORNELIUS \n\t\t\tHe's touchy, isn't he?\n\n\tTaylor thrusts the sheet at Zira, who reads it aloud.\n\n\t\t\t\tZIRA\n\t\t\t'I am not a missing link.'\n\n\t\t\t\tCORNELIUS \n\t\t\tBecause if he is a missing link, it means \n\t\t\tthe Sacred Scrolls aren't worth their \n\t\t\tparchment.\n\n\t\t\t\tZIRA \n\t\t\tWell, maybe they're not.\n\n\t\t\t\tCORNELIUS\n\t\t\tNo, thank you'. I won't get into\n\t\t\tthat battle.\n\n\t\t\t\tZIRA\n\t\t\tOh, Cornelius, show some strength!\n\n\t\t\t\tCORNELIUS \n\t\t\tZira, listen to me. We've got a fine \n\t\t\tfuture ahead of us. Marriage. Stimulating \n\t\t\tcareers. I'm up for a raise --\n\n\tAt that moment \tthere is a. loud RAP at the door o.s. All turn.\n\n193\tREVERSE ANGLE - TO INCLUDE THE DOOR\n\n\tDr. Zaius enters with another portly figure, DR. MAXIMUS. Like Zaius., \n\tMaximus is an orangutan.\n\n\t\t\t\tCORNELIUS\n\t\t\t\t(flustered)\n\t\t\tDr. Zaius --\n\n\t\t\t\tZAIUS\n\t\t\t\t(not unkindly) \t\n\t\t\tDid you forget our appointment, \n\t\t\tCornelius?\n\n\t\t\t\tCORNELIUS\n\t\t\tOh., no., sir. I was just assembling \n\t\t\tmy notes.\n\n\t\t\t\tZAIUS \n\t\t\tYou know Dr. Maximus, our Commissioner \n\t\t\tfor Animal Affairs?\n\n\t\t\t\tCORNELIUS \n\t\t\tCertainly, sir. It's a pleasure to see \n\t\t\tyou again.\n\n\tHe hurries to his desk, starts gathering papers. Maximus notes Taylor \n\twith distaste.\n\n\t\t\t\tMAXIMUS\n\t\t\tWhat is that?\n\n\t\t\t\tZIRA\n\t\t\tA man, Dr. Maximus.\n\n\t\t\t\tMAXIMUS \n\t\t\tI know it's a man. And you know the \n\t\t\trules. No animals outside the compound, \n\t\t\tand most certainly not without a leash.\n\n194\tANOTHER ANGLE - THE OFFICE - FAVORING ZAIUS\n\n\tDuring the ensuing exchange, Zaius wanders idly through the office. He \n\tglances at the scattered handwritten notes, but does not read them. \n\tMeanwhile a rattled Zira replies to Maximus.\n\n\t\t\t\tZIRA\n\t\t\tYes, Sir. But this -- creature\n\t\t\tis a special case.\n\n\t\t\t\tMAXIMUS\n\t\t\tWhy special?\n\n\t\t\t\tZIRA \n\t\t\tWe're -- conducting a new experiment.\n\n\t\t\t\tZAIUS \n\t\t\tWouldn't it more properly be done in \n\t\t\tyour office?\n\n\t\t\t\tZIRA\n\t\t\tYes, Sir.\n\n\t\t\t\tMAXIMUS \n\t\t\t\t(calling)\n\t\t\tGuards?\n\n\tThe gorilla GUARDS enter from outside.\n\n\t\t\t\tMAXIMUS\n\t\t\tReturn this beast to the compound.\n\n195\tANOTHER ANGLE - FAVORING TAYLOR\n\n\tHe regards the apes with hostility as they cross to him. One picks up \n\this leash. Over THE SHOT we hear:\n\n\t\t\t\tZAIUS' VOICE\n\t\t\t\t(o.s.) \n\t\t\tWhat's this?\n\n196\tREVERSE ANGLE - FEATURING ZAIUS\n\n\tZira stiffens, looking at Zaius. He is holding the paper plane\n\tfashioned by Taylor.\n\n\t\t\t\tZIRA\n\t\t\tA toy. It floats on the air.\n\t\t\t\t(faint defiance)\n\t\t\tTry it.\n\n\t\t\t\tCORNELIUS\n\t\t\t\t(a warning)\n\t\t\tZira....\n\n\tZaius looks down at the paper plane in his hand, then back to Zira. He \n\tsmiles tolerantly.\n\n\t\t\t\tZAIUS\n\t\t\tNonsense.\n\n\tHe crumples the paper plane into a b all., drops it on the desk. The \n\tape hooks the leash to Taylor's collar, starts leading him out. Zira \n\tfollows them.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n197 \tINT. CAGES - ANIMAL COMPOUND - FULL SHOT - DAY\n\n\tThe caged primitives are asleep. Julius, the keeper, dozes in a chair \n\toutside Taylor's cage. CAMERA PIVOTS MOVING IN ON Taylor, who is lying \n\ton his side, also asleep. Nova is curled up behind him. At the sound of \n\ta door opening, she comes instantly awake, sitting up and clutching \n\tTaylor's arm. He comes groggily awake, raising his head in time to \n\thear:\n\n\t\t\t\tJULIUS' VOICE\n\t\t\t\t(o.s.)\n\t\t\tWhat's up, Lieutenant?\n\n198\tREVERSE ANGLE - WHAT TAYLOR SEES:\n\n\tTWO GORILLA OFFICERS have just entered the compound. They wear side \n\tarms. Julius has just risen from his  chair.\n\n\t\t\t\tAPE LIEUTENANT \n\t\t\tWe're taking Number Four over to surgery \n\t\t\tin five minutes. Have him ready.\n\n\t\t\t\tJULIUS \n\t\t\tHow come? The beast's throat is nearly \n\t\t\thealed.\n\n\t\t\t\tLIEUTENANT \n\t\t\t\t(snickering) \n\t\t\tIt's not his throat this time. The vet's \n\t\t\tgoing to geld him.\n\n199\tCLOSEUP - TAYLOR\n\n\tHe stiffens but does not move. The apes, of course, speak freely in \n\tfront of him, believing the animal cannot understand.\n\n\t\t\t\tJULIUS' VOICE \n\t\t\t\t(o.s.) \n\t\t\tDr. Zira won't like it. She wants this \n\t\t\tpair to mate.\n\n200\tBACK TO THE APES - FROM TAYLOR'S P.O.V.\n\n\tAs the Lieutenant replies:\n\n\t\t\t\tLIEUTENANT \n\t\t\tThese orders came from Dr. Zaius himself. \n\t\t\tThere's nothing she can do about it.\n\n\tThe two gorillas exit. The guard crosses to a wall peg for a collar and \n\t'Leash.\n\n201\tCLOSE TWO SHOT - TAYLOR AND NOVA\n\n\tPushing Nova aside, Taylor rises.\n\n202\tMED. SHOT - THE CAGE\n\n\tAs Julius unlocks the door and cautiously approaches Taylor, carrying \n\tthe collar and leash.\n\n\t\t\t\tJULIUS \n\t\t\t\t(murmuring) \n\t\t\tIf only you knew, Bright Eyes, what \n\t\t\tthey're going to do ... \n\t\t\t\t(raising collar) \n\t\t\tStand still now...don't give me any \n\t\t\ttrouble.\n\n\tThe heel of Taylor's right palm crashes into the keeper's, chin, nearly \n\tsnapping his neck. Julius falls unconscious. Taylor leans over him, \n\ttaking his night stick and a set of keys on his belt.\n\n203\tREVERSE ANGLE - TO INCLUDE NOVA AND MALE IN ADJACENT CAGE\n\n\tThe male has awakened. He stares stupidly at Taylor. Nova is \n\twhimpering, little strange cries of fear. Taylor moves o.s.\n\n204\tANOTHER ANGLE - PANNING WITH TAYLOR\n\n\tHe leaves the cage, moves swiftly to the nearby door and exits.\n\n205\tINT. A DARK CORRIDOR - FULL SHOT - DAY\n\n\tBarefoot, Taylor silently pads down the corridor to a locked door.\n\n206\tCLOSE ON A DOOR\n\n\tWhich is visible because of a beam of sunlight from the half-open door\n \tof a guard room. We HEAR a murmur of ape voices and LAUGHTER. Taylor \n\tfumbles with the keys, finds one that fits the lock and opens the door.\n\n207\tEXT. ANIMAL COMPOUND - MED. SHOT - TAYLOR - DAY\n\n\tHe emerges, quietly locking the door behind him. Two tethered horses\n\tcan be seen in deep b.g., and another gust of LAUGHTER can be heard \n\tfrom the nearby guard room. Taylor looks off.\n\n208\tLONG SHOT - WHAT TAYLOR SEES:\n\n\tAs already established, the animal compound is situated on the \n\toutskirts of the apes' community. The strange skyline of the town can \n\tbe seen in the distance.\n\n209\tPANNING WITH TAYLOR\n\n\tHe starts to cross an open field outside the compound. At that moment \n\twe HEAR a shrill police WHISTLE from the guard room. Taylor breaks into \n\ta run.\n\n210\tREVERSE ANGLE - THE COMPOUND\n\n\tAs the two gorilla officers emerge from the building and run toward \n\ttheir horses.\n\n211\tEXT. A DIRT ROAD - LONG SHOT - TAYLOR\n\n\tHe runs down the road, starts across the long causeway that bisects a \n\tsmall lake, looking over his shoulder.\n\n\t\t\t\t\t\t\t\tQUICK DISSOLVE TO:\n\n212\tEXT. APETOWN - LONG ESTABLISHING SHOT - DAY\n\n\tThe community we sue at the end of the causeway is small and arcane. \n\tThere are no power lines, no street lamps -- indeed, no streets as \n\tsuch, but only a small cluster of buildings around a pleasant mall. The \n\tarchitecture of the buildings is faintly derivative of the simpler and \n\tless rococo work of Antonio Gaudi -- columns and pillars of brick or\n \texterior masonry look like the trunks and branches of great trees and \n\tsuggest an arboreal past.\n\n\tA small number of apes are visible on the mall:\n\n\tTaylor darts behind the buttress of a building, casing the situation. \n\tHe looks back at:\n\n213\tEXT. LAKE AND CAUSEWAY - LONG SHOT - MORNING\n\n\tThe two mounted gorilla-police can be seen on the causeway, galloping \n\tstraight toward CAMERA. It is evident they will soon spot Taylor.\n\n214\tBACK TO TAYLOR - CLOSE SHOT\n\n\tHe retreats from the buttress to a dark archway and vanishes inside the \n\tbuilding.\n\n215\tINT. A DARK VESTIBULE - MOVING WITH TAYLOR\n\n\tThe vestibule is nothing, no set required, a dark space through which \n\tTaylor moves toward a shaft of light. We HEAR faintly the discordant \n\tchords of an organ. Or is it an organ? At any rate,a strange and \n\tmelancholy tune. Taylor arrives at a font.\n\n216\tINT. A TEMPLE - PANNING WITH TAYLOR\n\n\tHe appears out of darkness into half-light. The rear of the temple is \n\tobscure. Taylor darts behind a screen. Crouching there, he observes:\n\n217\tA FUNERAL CEREMONY IN THE TEMPLE - MED. LONG SHOT\n\n\tThe temple itself is small and austere. There is no altar, but against \n\ta plain backdrop we see a statue of the Lawgiver, a Great Ape holding a \n\tbook. Below the Lawgiver is an ORANGUTAN MINISTER clothed in black \n\trobes. He stands in front of a closed coffin. A dozen mourners, seated \n\ton comfortable wicker chairs, form a semi-circle around the coffin. The \n\tape ladies wear cowls.\n\n\t\t\t\tMINISTER \n\t\t\tWeep if you must, but make an end of \n\t\t\tsorrow. He lives again. Yes, he has \n\t\t\tfound peace in Heaven.\n\n218\tCLOSEUP - TAYLOR\n\n\tCrouching, listening, wide-eyed.\n\n\t\t\t\tMINISTER'S VOICE \n\t\t\t\t(o.s.) \n\t\t\tHe was a model for us all, a gorilla to \n\t\t\tremember; hunter, warrior, defender of \n\t\t\tthe Faith.\n\n219\tBACK TO FUNERAL CEREMONY - FROM TAYLOR'S P.O.V.\n\n\tAs the minister continues his eulogy, a small ape boy detaches himself \n\t(as children will) from the group of mourners and comes marching up the \n\taisle toward the rear of the temple.\n\n\t\t\t\tMINISTER \n\t\t\tCherished husband, beloved father, \n\t\t\tgenerous master -- yes, he was a font \n\t\t\tof simian kindness.\n\n220 \tREVERSE ANGLE - SHOOTING AT TAYLOR\n\n\tWho is still crouching behind the screen in deep b.g. The small fry is \n\tcoming closer. Over this we hear:\n\n\t\t\t\tMINISTER'S VOICE\n\t\t\t\t(o.s.)\n\t\t\tThe dear departed once said to me:\n\t\t\t'I never met an ape I didn't like'...\n\n\tThe small fry spots Taylor.\n\n\t\t\t\tCHILD\n\t\t\t\t(shrill soprano)\n\t\t\tLook!. It's a man!\n\n\tThe mourners' heads turn. Taylor slinks toward the vestibule.\n\n221\tANOTHER ANGLE - FEATURING THE MINISTER\n\n\tHe is aghast.\n\n\t\t\t\tMINISTER\n\t\t\tIn Heaven's name ...\n\t\t\t\t(aside to ushers)\n\t\t\tGet rid of that creature.\n\n\tTwo ushers rise, moving past CAMERA and o.s.\n\n222\tEXT. TEMPLE - CLOSE ON VESTIBULE DOOR\n\n\tStaying close on the temple wall, Taylor moves stealthily away from the \n\tvestibule door. The two ape ushers appear.\n\n\t\t\t\tFIRST USHER \n\t\t\t\t(pointing) \t\n\t\t\tThere he is:\n\n\tThey move toward Taylor.\n\n223\tFLASH SHOT - TAYLOR\n\n\tHe runs out onto the mall.\n\n224\tFULL SHOT - THE MALL\n\n\tTaylor belatedly sees that he is running straight toward his two\n \tmounted pursuers. Darting off in another direction, he races past \n\tstartled pedestrians.\n\n225\tREACTION SHOT - TWO CHIMP PEDESTRIANS\n\n\tThey do a slow take.\n\n\t\t\t\tFIRST CHIMP\n\t\t\tYou see what I saw?\n\n\t\t\t\tSECOND CHIMP\n\t\t\tMust've escaped from the zoo.\n\n226\tMED. SHOT - A MOUNTED COP\n\n\tHe has spotted Taylor. Drawing a folded net from his saddlebag, he \n\tswings it overhead (like a cowboy with a lariat) and gallops off in \n\tpursuit of the man.\n\n227-\tSEVERAL SHOTS - TAYLOR AND PURSUING MOUNTIE\n231\n\n\tTaylor runs frantically from building to building, rounding corners, \n\tvanishing momentarily and reappearing on another part of the mall. At \n\tone point the mountie nearly overtakes him and flings his net, which \n\tfalls short. Taylor runs on.\n\n232\tEXT. AN AMPHITHEATER - LOW ANGLE SHOT (FROM GROUND LEVEL)\n\n\tIt is an open-air structure, like a Greek theater, located near the \n\tcentral mail. Steeply tiered, it seats no more than fifty apes. The \n\tdais in the pit is some fifteen feet above ground level.\n\n\tTaylor enters scene, running toward the amphitheater. Changing \n\tdirection, he darts into what appears to be an access tunnel. A moment \n\tlater the pursuing cop rides into' scene, dismounts and walks toward \n\tthe amphitheater, looking around for Taylor.\n\n233\tEXT. AMPHITHEATER - HIGH ANGLE SHOT (FROM TOPMOST TIER)\n\n\tTaylor suddenly emerges from the access tunnel and runs up a ramp \n\tencircling the amphitheater. (A retaining wall shields him from the \n\tview of the apes.) Pausing for breath at the top of the ramp, Taylor \n\tcrouches behind the uppermost tier of seats and peers down:\n\n\tTHE AMPHITHEATER - FROM TAYLOR'S P.O.V.\n\n\tThe cop looks around, spots Taylor at the top tier, and starts up after \n\thim.\n\n235-\tOUT\n237\n\n238\tEXT. TOP OF AMPHITHEATER - PANNING WITH TAYLOR\n\n\tHe starts to run back down the ramp, but is suddenly confronted by his \n\toriginal pursuer (the dismounted cop coming up the ramp. Reversing \n\tdirection, Taylor runs around the rim of the amphitheater and vanishes \n\tinto an exit tunnel. The cop blows his whistle, summoning another cop, \n\twho joins him in the chase.\n\n239-\tANOTHER PART OF THE MALL - A SWIFT SEQUENCE OF SHOTS\n244\n\n\tIn which we see the fugitive, his pursuers and the reactions of ape \n\tshoppers and workers.\n\n245-\tEXT. OPEN-AIR MARKET - SEVERAL SHOTS\n248\n\n\tA market has been set up on one side of the mall, where street vendors \n\tbehind carts or tables hawk their wares: fruits, vegetables, wearing \n\tapparel, etc. As Taylor runs frantically through the market place, \n\tseveral apes join the chase. In the ensuing pandemonium, like the \n\tproverbial Chinese fire drill, several tables are overturned.\n\n249\tEXT. A BUILDING - CLOSE ON AN ARCHWAY\n\n\tTaylor runs into scene, pauses, panting, and looks back at his \n\tpursuers. Then he darts through the archway into the building.\n\n250\tINT. BUILDING - TRACKING WITH TAYLOR - DAY\n\n\tFor the moment he is the sole visitor in this wing. His pace slows to a \n\twalk as he and we observe fleetingly the specimens in what is a simian \n\tmuseum: Possibly several stuffed and unfamiliar animals; primitive \n\tartifacts and fossils; possibly the skeleton of a dog, a cat, etc. Over \n\tthis we hear a shrill police WHISTLE.\n\n251\tFLASH SHOT - TAYLOR\n\n\tHe runs again.\n\n252\tMED. SHOT - AN APE MOTHER AND CHILD\n\n\tLooking at the stuffed animals as Taylor races past. The mother gives a \n\tstartled SCREAM.\n\n253\tREACTION SHOT - A MUSEUM GUARD\n\n\tHe starts after the fugitive.\n\n254\tANOTHER PART OF THE MUSEUM - FEATURING TAYLOR\n\n\tHe runs past displays of other stuffed animals toward CAMERA and halts \n\tabruptly in close f.g., shocked by:\n\n255\tWHAT HE SEES: \tDODGE\n\n\tstuffed and mounted, Dodge bares his teeth at the world.\n\n256\tCLOSEUP - TAYLOR\n\n\tReacting in horror. He hears another police WHISTLE and the echoing \n\tFOOTSTEPS of approaching guards, which mufffle his strangled gasp:\n\n\t\t\t\tTAYLOR\n\t\t\tDodge ...\n\n\tTaylor vanishes in a BLUR of movement.\n\n\t\t\t\t\t\t\t\tCUT TO:\n\n257\tEXT. THE MALL - APETOWN - FULL SHOT FROM ON HIGH - DAY\n\n\tOrder has been restored in the open-air market. Taylor bursts suddenly \n\tinto view from a building on the far side of the mall, running in panic \n\tfrom ape guards in close pursuit. A mounted policeman spots him and \n\theads him off. Changing direction, Taylor is intercepted by another \n\tmounted Gorilla. And then a third.\n\n\tCAMERA HOLDS, ANGLING DOWN on the center of the mall. We are witnessing \n\ta hideous game: \"baiting the man.\"  The mounted police do not shoot or \n\tclub Taylor, for he cannot escape -- but they circle him, their long \n\twhips CRACKING over his head.\n\n258\tCLOSER ANGLE - THE CIRCLE AROUND TAYLOR - FAVORING A MOUNTIE\n\n\twho unfolds his net, swings it overhead and flings it at Taylor. This \n\ttime he bags his quarry. Taylor gives up. Spent, docile, entangled in \n\tthe net, he stands stock-still in the center of the mall. Guards and \n\tcivillians on foot join the circle around the man at bay. They regard \n\thim warily.\n\n259\tCLOSE SHOT - DR. ZIRA\n\n\tShe pushes through the simian crowd around Taylor and hurries to his \n\tside.\n\n260\tCLOSE TWO SHOT - TAYLOR AND ZIRA\n\n\tShe paws at the net, crying impulsively:\n\n\t\t\t\tZIRA\n\t\t\tTaylor, why'd you run away?\n\n\tZira removes the net from his face. Panting with exhaustion, Taylor \n\tflicks a wild glance at her. He looks demented.\n\n261\tWIDER ANGLE - TO INCLUDE TWO GORILLA OFFICERS\n\n\twho approach Taylor and Zira. (They are the same gorillas introduced in \n\tScene 198.) One of them carries a collar and leash. The other presents \n\tan I.D. card to Zira.\n\n\t\t\t\tLIEUTENANT \n\t\t\tSecurity police.\n\n\t\t\t\tZIRA\n\t\t\t\t(promptly)\n\t\t\tI'm in charge of this man. \n\n\t\t\t\tLIEUTENANT \n\t\t\tNo longer, madame. He is now in the \n\t\t\tcustody of the Ministry of Science.\n\n\tHis colleague moves toward Taylor with a muzzle.\n\n262\tCLOSE SHOT - FEATURING TAYLOR\n\n\tHe speaks at last, his voice hoarse but audible.\n\n\t\t\t\tTAYLOR\n\t\t\tGet away from me, you dirty ape!\n\n263\tFULL SHOT - THE SIMIANS AROUND TAYLOR\n\n\tThe arresting officer steps back involuntarily. All the apes freeze,\n\tstaring at the speaking animal with mute astonishment as we:\n\n\t\t\t\t\t\t\t\tFADE OUT\n\n\t\t\t\t\t\t\t\tFADE IN\n\n264\tINT. CAGES - CLOSE SHOT - TAYLOR AND NOVA - DAY\n\n\tThe compound is dimly lit. Taylor, the bandage now gone from his \n\tthroat, is back in his old cage. The other cages, however, are empty -- \n\ttheir occupants presumably having been moved to the surgery or the zoo. \n\tHe is seated on a pile of straw in the rear corner, Nova's head cradled \n\ton his lap. Idly he strokes her coarse hair. There is a dull glow of \n\tmadness in his eyes, and his manner is one of abstract soliloquy, like \n\ta man talking to a dog.\n\n\t\t\t\tTAYLOR \n\t\t\t...and that's when I decided to take \n\t\t\tup astronautical engineering., you see. I \n\t\t\twas halfway through college and I...\n\t\t\t\t(he breaks off) \n\t\t\tIt's an old trick! The silent treatment. \n\t\t\tFour weeks and three days, and not a word \n\t\t\tfrom anyone. Not Zira.,or Cornelius...or \n\t\t\tthat damn Julius. No one'll listen... \n\t\t\tonly you. You...Nova. NO-VAH.\n\n\tHis manner is now more direct, and educative., but she stares in blank \n\tcomprehension. She brushes his moving lips with her fingers. He shrugs \n\twryly.\n\n\t\t\t\tTAYLOR \n\t\t\tYeah...me Tarzan, you Jane. That's all \n\t\t\tright ... I had a puppy once that never \n\t\t\tbarked. He just licked my hand.\n\t\t\t\t(pause) \n\t\t\tHe's dead now. They're all dead. Everything... \n\t\t\tI think maybe they'll kill me, too. Are they \n\t\t\tafraid of me? I can't hurt them... but I \n\t\t\tthreaten them somehow. Threaten their faith \n\t\t\tin simian superiority. Yeah ... you're right. \n\t\t\tThey'll have to kill me.\n\n\tFaint footsteps are heard o.s. Taylor and Nova look in the direction of \n\tthe sound. A sudden stream of water shoots through the bars and strikes \n\tTaylor in the chest.\n\n265\tWIDER ANGLE - WHAT THEY SEE:\n\n\tAn ape GUARD has a high pressure hose trained on Taylor. It forces him \n\tback toward the rear of the cage. Julius, whip in hand, unlocks the \n\tcage, steps inside. He unlimbers the whip., cracks it-'in Nova's \n\tdirection. She recoils. The jet of water hold Taylor at bay. Julius \n\tgrabs Nova, begins to pull her toward the door of the cage. Taylor \n\ttries to fight his way through the water toward Julius.\n\n\t\t\t\tTAYLOR\n\t\t\tLet her alone!\n\n\tJulius swings the whip. It cracks against Taylor's legs, biting into\n\tthe skin. Taylor stumbles, falls to one knee\n\n\t\t\t\tTAYLOR \n\t\t\tWhere are you taking her? What are you \n\t\t\tgoing to do?\n\n\tJulius drags and pushes the girl through the door, slamming and locking \n\tit behind him. Taylor, fights through the stream of water, flings \t\n\thimself against the bars.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(raging) \n\t\t\tTake your hands off her, you black \n\t\t\tmonster! You filth!\n\n\tJulius shoves Nova across the aisle to a cage opposite Taylor's, locks \n\ther inside.\n\n\t\t\t\tTAYLOR \n\t\t\tWhy are you doing this? Say something,\n\t\t\tyou hairy scum!\n\n\tJulius gestures toward the ape guard\n\n\t\t\t\tJULIUS\n\t\t\tTurn it off!\n\n\tThe ape guard shuts off the hose.\n\n\t\t\t\tTAYLOR\n\t\t\tAnswer me!\n\n\tJulius strides over to Taylor's cage.\n\n\t\t\t\tJULIUS \n\t\t\t\t(fiercely) \n\t\t\tShut up! The reason no one'll talk to \n\t\t\tyou is because you're a freak!\n\n\t\t\t\tTAYLOR\n\t\t\tWhere's Dr. Zira? Why--?\n\n\t\t\t\tJULIUS\n\t\t\tI said shut up!\n\n\tHe slashes viciously with his whip handle against Taylor's fingers. \n\tTaylor yells in pain. Julius and the ape guard start out of the \n\tcompound.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(wildly)\n\t\t\tApe! Apes wearing clothes!\n\t\t\tIt's a madhouse! A madhouse!\n\n\tHe sinks to the floor as the apes go out.\n\t\n266\tOUT\n\n267\tFULL SHOT - CAGE \n\n\tTaylor looks desolately through the bars across to Nova's cage. She \n\teyes him sadly.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(gently)\n\t\t\tNow I don't even have you.\n\t\t\t\t(pause)\n\t\t\tImagine me -- needing someone. Back on \n\t\t\tEarth there was nobody. Women, yes. \n\t\t\tLots of them. Love making  ithout love. \n\t\t\tThat's the kind of world it was turning \n\t\t\tinto, with the help of cynics like myself. \n\t\t\tSo I left it -- because there was no one \n\t\t\tdear enough to keep me there.\n\t\t\t\t(pause)\n\t\t\tDid I tell you about Stewart?\n\t\t\t\t(Looking away) \n\t\t\tThere was a lovely girl. The most precious \n\t\t\tcargo we brought along. If human life could \n\t\t\tsurvive here, she was to be the new Eve.\n\t\t\t\t(morosely) \n\t\t\tIt's probably just as well she didn't live \n\t\t\tto see this.\n\n\tHe looks at Nova. She stretches her hands through the bars toward him.\n\n\t\t\t\tTAYLOR\n\t\t\tI wonder if it's Love between us. \n\t\t\t\t(looks around, \n\t\t\t\tsmiles ironically) \n\t\t\tWhat a place to find it.\n\nC-267\tFULL SHOT - THE CAGE\n\n\tTwo gorilla officers enter, carrying torches. (These are the same apes \n\tintroduced in Scene 198.) One carries a double set of manacles. Julius \n\tcomes to meet them. The Lieutenant takes the two sets of manacles from \n\tthe other officer, hands them to Julius, whispers something. Julius \n\tcomes over and unlocks the door of Taylor's cage. He advances to \n\tTaylor, who does not move, bends down and clamps the manacles around \n\teach of his ankles. Then he straightens, lifts Taylor's arms, pulls his \n\twrists together, snaps on the cuffs.\n\nD-267\tWIDER ANGLE - THE CAGE\n\n\tTaylor looks across at Nova, blows her a kiss. Julius leads him out of \n\tthe cage, takes his leash from a snaps it onto Taylor's collar, hands \n\tthe other end to the Lieutenant. Nova and Julius watch in silence as \n\tTaylor is led down the aisle and out the door.\n\n268-\tOUT\n272\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\n273\tINT. INQUIRY ROOM - ESTABLISHING SHOT - DAY\n\n\tTaylor, wearing his manacles, is seated at a table in the otherwise \n\tdeserted chamber. There is an empty chair on either side of him. Across \n\tthe room stands a dais with three rude, high-backed chairs. There is a \n\tsmall table directly below the dais. A third table stands at right \n\tangles to the dais. Taylor looks around the empty room. A door is \n\topened by a gorilla BAILIFF, and Zira and Cornelius come into the room, \n\tsit down on each side of Taylor. A moment later, DR.HONORIUS, the \n\tProsecutor and a CLERK enter, take their seats at the third table.\n\n\t\t\t\tTAYLOR \n\t\t\t\t(softly) \n\t\t\tWhere have you been? Why didn't you come \n\t\t\tto see me?\n\n\t\t\t\tZIRA\n\t\t\tShhhh!\n\n\t\t\t\tTAYLOR\n\t\t\tWhat is this?\n\n\t\t\t\tZIRA\n\t\t\tA hearing.\n\n\t\t\t\tCORNELIUS \n\t\t\t\t(hissing)\n\t\t\tBe clever. Be quiet,\n\n\t\t\t\tBAILIFF\t\n\t\t\tAll rise!\n\n\tEveryone gets up as THE PRESIDENT, Dr. Zaius and Dr. Maximus enter and \n\tmount the dais. The President takes the center chair; the other two \n\tflanking him.\n\n\t\t\t\tBAILIFF\n\t\t\tBe seated.\n\n\tAll sit down.\n\n\t\t\t\tPRESIDENT \n\t\t\t\t(pounds gavel once) \n\t\t\tThis ad hoc Tribunal of the National \n\t\t\tAcademy is now in session. President of \n\t\t\tthe Academy presiding. On my right, Dr. \n\t\t\tMaximus, Commissioner for Animal Affairs. \n\t\t\tOn my left, Dr. Zaius, Minister of Science \n\t\t\tand Chief Defender of the Faith... \n\t\t\t\t(glancing at Prosecutor) \n\t\t\tAppearing for the State, Dr. Honorius, \n\t\t\tDeputy Minister of Justice.\n\n\tHonorius rises and bows.\n\n\t\t\t\tPRESIDENT\n\t\t\t\t(raps gavel once)\n\t\t\tLet it be clear at the outset that all \n\t\t\tmatters pertaining to this inquiry are \n\t\t\tconfidential, and anyone discussing them\n\t\t\toutside this chamber will be held in \n\t\t\tcontempt of the Tribunal.\n\t\t\t\t(a beat)\n\t\t\tYou may proceed, Dr. Honorius.\n\n\t\t\t\tZIRA \n\t\t\t\t(rising) \n\t\t\tBy your leave, Mr. President -- the \n\t\t\tTribunal has not yet defined the purpose \n\t\t\tof this inquiry.\n\n\tThe President appears to be taken aback. He glances at his colleagues.\n\n\t\t\t\tMAXIMUS \n\t\t\tYou asked for the opportunity to present \n\t\t\tyour case. Surely you must know why you're \n\t\t\there.\n\n\t\t\t\tZIRA \n\t\t\tMy own purpose is to save this exceptional \n\t\t\tcreature from mutilation.\n\n\t\t\t\tMAXIMUS\n\t\t\t\t(promptly)\n\t\t\tAnd our purpose is to settle custodial and \n\t\t\tjurisdictional questions concerning this \n\t\t\tbeast, and determine what's to be done with \n\t\t\thim.\n\n\t\t\t\tZIRA \n\t\t\tAt the very least, this man has the right \n\t\t\tto know whether there's a charge against \n\t\t\thim.\n\n\t\t\t\tHONORIUS \n\t\t\t\t(rising) \n\t\t\tObjection. The accused is indeed a man. \n\t\t\tTherefore, he has no rights under ape law.\n\n\t\t\t\tPRESIDENT\n\t\t\tWell, Dr. Zira? This is a man, is he not?\n\n274\tCLOSE GROUP SHOT - THE DEFENDANT'S TABLE\n\n\tSensing that the President has given them an opening, Zira smiles \n\tconfidently.\n\n\t\t\t\tZIRA\n\t\t\tHe is unlike any man you have ever seen - \n\t\t\tas we hope to prove.\n\n\t\t\t\tPRESIDENT'S VOICE \n\t\t\t\t(o.s.) \n\t\t\tAnswer the question. Is he a man?\n\n\t\t\t\tCORNELIUS \n\t\t\t\t(tentatively) \t\n\t\t\tSir? The question is the point at issue: \n\t\t\tIs he a man? Or a deviate? Or a freak of \n\t\t\tnature?\n\n\t\t\t\tHONORIUS' VOICE\n\t\t\t\t(o.s.) \n\t\t\tObjection!\n\n275\tFULL SHOT - THE INQUIRY ROOM\n\n\tAs the Prosecutor continues:\n\n\t\t\t\tPRESIDENT \n\t\t\tSustained. In all fairness, Dr. Zira, \n\t\t\tyou must admit the accused is a nonape, \n\t\t\tand therefore has no rights under ape law.\n\n\t\t\t\tZIRA\n\t\t\t\t(rising)\t\n\t\t\tThen why is he called the accused Your \n\t\t\tHonors must think him guilty of something.\n\n\tHonorius seems confounded. Zaius takes over.\n\n\t\t\t\tZAIUS\n\t\t\tThis man is not being tried. He is being \n\t\t\tdisposed of.\n\t\t\t\t(pointing at\n\t\t\t\tZira and Cornelius) \n\t\t\tIt is scientific heresy that is actually \n\t\t\ton trial here.\n\n\t\t\t\tMAXIMUS\n\t\t\tWell put, Dr. Zaius. Let us warn\n\t\t\tour friends that they endanger their\n\t\t\town careers by defending this animal.\n\n276\tCLOSE SHOT - THE DEFENSE\n\n\tBoth Cornelius and Zira appear shaken by this threat. Sensing their \n\tpredicament, Taylor rises impatiently.\n\n\t\t\t\tTAYLOR\n\t\t\tThen I'll defend myself.\n\n277\tFULL SHOT - THE INQUIRY ROOM\n\n\tAlthough the judges and Prosecutor have been told that this man can \n\tspeak, they react in stunned silence to the first sound of his voice. \n\tFlustered, the President bangs his gavel.\n\n\t\t\t\tPRESIDENT\n\t\t\tDr. Zira -- tell Bright Eyes to \n\t\t\tsit down.\n\n\t\t\t\tTAYLOR \n\t\t\tMy name is Taylor.\n\n\tThe President refuses to address Taylor directly. Checking a document, \n\the speaks to Zira.\n\n\t\t\t\tPRESIDENT\n\t\t\tIt says here that his name is Bright \n\t\t\tEyes. You gave him that name yourself.\n\n\t\t\t\tTAYLOR \n\t\t\t\t(voice rising) \n\t\t\tThis hearing is absurd! Let me tell \n\t\t\tmy story...\n\n\t\t\t\tPRESIDENT\n\t\t\t\t(pounds gavel)\n\t\t\tBailiff! Make the animal be quiet.\n\n\tThe Bailiff quickly crosses to Taylor and shoves him roughly into his \n\tchair.\n\n\t\t\t\tPRESIDENT \n\t\t\tState your case, Mr. Prosecutor.\n\n\t\t\t\tHONORIUS \n\t\t\tLearned Judges: My case is simple. It is \n\t\t\tbased on our first Article of Faith: that \n\t\t\tthe Almighty created the ape in his own \n\t\t\timage; that He gave him a soul and a mind; \n\t\t\tthat He set him apart from the beasts of \n\t\t\tthe jungle, and made him the lord of the \n\t\t\tplanet.\n\n278\tCLOSE GROUP SHOT - THE DEFENDANT'S TABLE\n\n\tTaylor has begun to write something on a sheet of paper. Zira and \n\tCornelius remain attentive to:\n\n\t\t\t\tHONORIUS' VOICE \n\t\t\t\t(o.s.) \n\t\t\tThese sacred truths are self-evident. The \n\t\t\tproper study of apes is apes. But certain \n\t\t\tyoung cynics have chosen to study man - \n\t\t\tyes, perverted scientists who advance on \n\t\t\tinsidious theory called 'evolution.'\n\n279\tFULL SHOT - THE INQUIRY ROOM\n\n\tAs the Prosecutor continues:\n\n\t\t\t\tHONORIUS \n\t\t\tThere is a conspiracy afoot to undermine \n\t\t\tthe very cornerstone of our Faith\n\n\t\t\t\tPRESIDENT\n\t\t\tCome to the point, Dr. Honorius.\n\n\t\t\t\tHONORIUS \n\t\t\tDirectly, Mr. President. This wretched man, \n\t\t\tthe accused, is only a pawn in the conspiracy.\n\t\t\tWe know that he was wounded in the throat at \n\t\t\tthe time of his capture. The State charges \n\t\t\tthat Dr. Zira and a corrupt surgeon named \n\t\t\tGalen experimented on this wounded animal, \n\t\t\ttampering with his brain and throat tissues \n\t\t\tto create a speaking monster ...\n\n\t\t\t\tZIRA\n\t\t\t\t(on her feet)\n\t\t\tThatÕs a lie!\n\n\t\t\t\tPRESIDENT\n\t\t\t\t(pounding gavel)\n\t\t\tMind your tongue, madame.\n\n\t\t\t\tZIRA\n\t\t\tDid we create his mind too? Not only \n\t\t\tcan this man speak. He can write. He can \n\t\t\treason.\n\n\t\t\t\tHONORIUS\n\t\tHe can reason? With the Tribunal's permission, \n\t\tlet me expose this hoax by direct examination.\n\n\t\t\t\tPRESIDENT\n\t\tProceed. But don't turn this hearing into a \n\t\tfarce.\n\n\tHonorius crosses to the defendant's table and favors Taylor with an \t\n\tevil smile.\n\n\t\t\t\tHONORIUS \n\t\t\tTell the court, Bright Eyes -- what is \n\t\t\tthe second Article of Faith?\n\n\t\t\t\tTAYLOR \n\t\t\tI admit, I know nothing of your culture.\n\n\t\t\t\tHONORIUS \n\t\t\tOf course he doesn't know our culture - \n\t\t\tbecause he cannot think.\n\t\t\t\t(to Taylor) \n\t\t\tTell us why all apes are created equal.\n\n\t\t\t\tTAYLOR \n\t\t\tSome apes, it seems, are more equal than \n\t\t\tothers.\n\n\t\t\t\tHONORIUS \n\t\t\tRidiculous. That answer is a contradiction \n\t\t\tin terms. Tell us, Bright Eyes, why do men \n\t\t\thave no souls? What is the proof that a \n\t\t\tdivine spark exists in the simian brain?\n\n\t\t\t\tTAYLOR\n\t\t\t\t(hands paper to Zira) \n\t\t\tShow this to the President.\n\n\tZira moves toward the dais. Honorius returns to his own table.\n\n\t\t\t\tZIRA \n\t\t\tSince the defendant is forbidden to speak \n\t\t\tin his own defense, he asks that this \n\t\t\tstatement be read into the record.\n\n\t\t\t\tPRESIDENT \n\t\t\tRead it yourself.\n\n\t\t\t\tZIRA\n\t\t\t\t(reading aloud) \n\t\t\t'I have come to you from a planet in a \n\t\t\tdifferent solar system. I am an explorer \n\t\t\tin space, with no hostile intentions against \n\t\t\tyour civilization. On my planet it was the \n\t\t\tprimate Man who evolved Into a thinking \n\t\t\tanimal, while the apes remained...\"\n\n\t\t\t\tPRESIDENT\n\t\t\t\t(rapping gavel) \n\t\t\tStop right there. Bring me that paper.\n\n\tZira crosses to the dais, handing the statement to the President. He \n\tglances at it, laughs derisively and passes it to Zaius.\n\n\t\t\t\tPRESIDENT\n\t\t\t\t(to Zira)\n\t\t\tThis is a joke in very poor taste.\n\n\t\t\t\tZIRA\n\t\t\tIs it a joke to seek the truth about \n\t\t\tthis man?\n\n\t\t\t\tZAIUS\n\t\t\t\t(glancing at document) \n\t\t\tDr. Zira -- you state here that a ship \n\t\t\tfrom outer space sank in an inland sea \n\t\t\tof our eastern desert.\n\n\t\t\t\tZIRA\n\t\t\tI do not state it, sir. The prisoner does.\n\n\t\t\t\tZAIUS \n\t\t\tDo you believe him?\n\n\t\t\t\tZIRA\n\t\t\t\t(uneasily) \n\t\t\tLike you, I find it difficult.\n\n\t\t\t\tZAIUS \n\t\t\tBut how convenient that the proof of \n\t\t\this arrival has vanished?\n\t\t\t\t(glancing again\n\t\t\t\tat document) \n\t\t\tYou also state that Bright Eyes had two \n\t\t\tintelligent companions at the time of \n\t\t\this capture.\n\n\t\t\t\tZIRA\n\t\t\tThis is his assertion.\n\n\t\t\t\tZAIUS\n\t\t\tWhere are they now?\n\n\t\t\t\tTAYLOR\n\t\t\t\t(blurting it out)\n\t\t\tOne is in a museum!\n\n\t\t\t\tPRESIDENT\n\t\t\t\t(pounding gavel)\n\t\t\tDr. Zira! Silence that man!\n\n\tReturning to her table, Zira gestures to Taylor to remain silent.\n\n\t\t\t\tZAIUS\n\t\t\tHow sad. Stuffed and mounted, eh? Dead \n\t\t\tmen, like sunken ships, can tell no \n\t\t\tstories. And his other companion?\n\n\t\t\t\tZIRA\n\t\t\tHe doesn't know.\n\n\t\t\t\tZAIUS\n\t\t\tMr. President, I believe the Prosecutor \n\t\t\thas reassembled all he surviving humans \n\t\t\tcaptured in the hunt along with Bright Eyes.\n\n\t\t\t\tHONORIUS \n\t\t\tThat's true, Dr. Zaius. My witnesses -- \t\n\t\t\tcorrection -- my exhibits are on display in \n\t\t\tthe amphitheater.\n\n\t\t\t\tPRESIDENT \n\t\t\tVery well. I suggest we go and look at them.\n\n\tThe President rises, starts out, followed by the others. Taylor is \n\tlast, being led on a leash by the bailiff.\n\n280 \tOUT\n\n281\tEXT. AMPHITHEATER - FULL SHOT - DAY\n\n\tThe inquiry group files through a door into the amphitheater. Two APES \n\tstand guard over a number of leashed and nearly naked human beings in \n\tthe center of the pit below the dais. There are three primitive males, \n\tthe female Nova -- and Landon. He is dirty and bearded, but his hair is \n\tcropped close.\n\n282\tCLOSE - TAYLOR\n\n\tHe turns to Zira, his eyes shining with vindication.\n\n\t\t\t\tTAYLOR \n\t\t\t\t(a whisper) \n\t\t\tIt's him...Landon.\n\n\t\t\t\tZIRA\n\t\t\tWhich one?\n\n\t\t\t\tTAYLOR \n\t\t\tSecond from the left.\n\n283\tFULL SHOT - THE AMPHITHEATER\n\n\tZaius glances at the accused.\n\n\t\t\t\tZAIUS \n\t\t\tWell...do you acknowledge kinship with \n\t\t\tany of these creatures?\n\n\t\t\t\tTAYLOR\n\t\t\tWith one of them.\n\n\t\t\t\tZAIUS \n\t\t\tIdentify him, then. Speak to him.\n\n\tTaylor moves forward for a few paces, stops.\n\n\t\t\t\tTAYLOR\n\t\t\tLandon?\n\n284\tCLOSER SHOT - FEATURING LANDON - FROM TAYLOR'S P.O.V.\n\n\tLandon looks catatonic. His face is in shadow\n\n285\tWIDER ANGLE - TO INCLUDE TAYLOR\n\n\tStunned by Landon's imbecility.\n\n\t\t\t\tTAYLOR \n\t\t\tJohn ... it's me, Taylor.\n\n\tTaylor steps forward to grasp his arm. There is still no response. \n\tTaylor takes Landon's head in his hands and looks at his face. There is \n\ta fresh scar running from his forehead to the top of his cranium.\n\n286\tFULL SHOT - THE AMPHITHEATER\n\n\tAs Taylor whirls on Zira.\n\n\t\t\t\tTAYLOR \n\t\t\tYou! ... You knew about this?\n\n\t\t\t\tZIRA\n\t\t\tNo, I swear -- I never saw this\n\t\t\tman before.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(whirling on Zaius) \n\t\t\tYou did this to him! You've removed his \n\t\t\tfrontal lobes!\n\n\t\t\t\tPRESIDENT\n\t\t\tSilence!\n\t\t\t\t(turning)\n\t\t\tBailiff, take the prisoner inside!\n\n\tThe bailiff Jerks brutally on Taylor's leash, pulling him toward the \n\tdoor leading under the amphitheater.\n\nA-286\tINT. INQUIRY ROOM - MED. SHOT - DAY\n\n\tThe bailiff enters, dragging Taylor behind him, shoves him into his \n\tchair. Moments later the other apes enter the room. All take their \n\tseats but Zaius. Taylor glares at him furiously.\n\n\t\t\t\tZAIUS \n\t\t\t\t(calmly) \n\t\t\tMr. President, a word of explanation: the \n\t\t\tcreature in question suffered a skull \n\t\t\tfracture during the hunt. Two fine \n\t\t\tveternary surgeons under my direction \n\t\t\twere able to save his life. But the beast \n\t\t\tcould not speak, of course. Nor will he\n\t\t\tever speak\n\n\tTaylor leaps from his chair, livid with rage, approaches the dais.\n\n\t\t\t\tTAYLOR \n\t\t\tYou destroyed his memory! His mind! His \n\t\t\tidentity! And, you want to do the same to \n\t\t\tme!\n\n\t\t\t\tPRESIDENT \n\t\t\t\t(pounding gavel) \n\t\t\tBailiff! Stop this outburst! Gag that\n\t\t\tmonstrosity!\n\n\tThe bailiff and a husky guard seize Taylor, who continues shouting:\n\n\t\t\t\tTAYLOR \n\t\t\tYou barbarians!\n\n\tThe powerful guard twists Taylor's arms behind his back and the bailiff \n\tlashes his wrists together. Then the bailiff gags Taylor. His voice is\n\tcut off as the bailiff ties the twisted kerchief around his open mouth.\n\tThe guard holds Taylor's leash during the rest of this scene.\n\n\tMeanwhile, Cornelius has risen to his feet. His tone is firm, but \n\tconciliatory.\n\n\t\t\t\tCORNELIUS\n\t\t\tMay it please the Tribunal: I for one \n\t\t\tgrant that this being cannot have come \n\t\t\tfrom another planet. But this much is \n\t\t\tcertain -- he comes from somewhere in the\n\t\t\tForbidden Zone. He has described the region  \n\t\t\tto us, and described it accurately, for I \n\t\t\thave been there.\n\n\t\t\t\tPRESIDENT \n\t\t\tYou visited the Forbidden Zone?\n\n\t\t\t\tCORNELIUS \n\t\t\tWhy, yes, sir. A year ago. With the special \n\t\t\tpermission of the Academy.\n\n\t\t\t\tZAIUS \n\t\t\t\t(to President) \n\t\t\tHe exceeded his orders. His travel permit \n\t\t\twas promptly revoked.\n\n\t\t\t\tCORNELIUS \n\t\t\tYes, sir, so it was -- thanks to you. But \n\t\t\tnot before I discovered evidence of a simian \n\t\t\tculture that existed long before the Sacred \n\t\t\tScrolls were written ...\n\n\t\t\t\tHONORIUS \n\t\t\tObjection! These remarks are profane and irrelevant.\n\n\t\t\t\tPRESIDENT\n\t\t\tSustained.\n\t\t\t\t(to Cornelius) \n\t\t\tYour archeological theories have no bearing \n\t\t\ton the disposition of this creature.\n\n\t\t\t\tZAIUS\n\t\t\t\t(softly)\t\n\t\t\tLet them talk, Mr President. Let them talk.\n\n\t\t\t\tZIRA \n\t\t\t\t(rising) \n\t\t\tSirs: our theories have a bearing on his \n\t\t\tidentity.\n\n\t\t\t\tPRESIDENT\n\t\t\tHow so?\n\n\t\t\t\tZIRA \n\t\t\tLet us assume, as common sense dictates, \n\t\t\tthat the prisoner's story is false. But if \n\t\t\the does not come from another planet, then \n\t\t\tsurely he sprang from our own. Yes, sprang.\n\t\t\t\t(a beat) \n\t\t\tAs an animal psychologist, I have found no \n\t\t\tphysiological defect to explain why humans \n\t\t\tare mute.\n\n\t\t\t\tHONORIUS\n\t\t\tObjection!\n\n\t\t\t\tPRESIDENT\n\t\t\tSustained.\n\n\t\t\t\tZIRA\n\t\t\t\t(plunging on) \n\t\t\tTheir speech organs are adequate. The flaw \n\t\t\tlies not in anatomy but in the brain.\n\n\t\t\t\tHONORIUS\n\t\t\tObjection!\n\n\t\t\t\tPRESIDENT\n\t\t\tSustained.\n\n\t\t\t\tZIRA\n\t\t\t\t(voice rising) \n\t\t\tSustain all objections, but face the truth!\n\n\tCornelius has regained his courage. Rising to Zira's support, he points \n\tat Taylor.\n\n\t\t\t\tCORNELIUS \n\t\t\tYes! Behold this marvel, this living paradox, \n\t\t\tthis missing link in an evolutionary chain!\n\n\t\t\t\tPRESIDENT\n\t\t\t\t(pounding gavel) \n\t\t\tSilence!\n\t\t\t\t(Puffing with rage) \n\t\t\tYou have gone too far.\n\n\t\t\t\tZAIUS\n\t\t\t\t(calmly) \n\t\t\tThere you are, Mr. President. I warned you \n\t\t\tthese two would use this hearing as a forum \n\t\t\tfor subversion.\n\n\t\t\t\tMAXIMUS \n\t\t\tYou were right! The advocates of heresy have \n\t\t\trevealed themselves.\n\n\t\t\t\tZAIUS \n\t\t\tMr. President, I think an indictment is \n\t\t\tin order.\n\n\t\t\t\tHONORIUS \t\n\t\t\t\t(promptly) \n\t\t\tYes, sir. The State charges Doctors Zira \n\t\t\tand Cornelius with contempt of this Tribunal, \n\t\t\tmalicious mischief and scientific heresy.\n\n\t\t\t\tPRESIDENT \n\t\t\tBe it so ordered. The Tribunal will examine \n\t\t\tall the evidence presented here and in due \n\t\t\ttime render a verdict on the proposed \n\t\t\tindictment and on the disposition of the \n\t\t\tdeviate in question. \n\t\t\t\t(pounds gavel once) \n\t\t\tThis hearing is adjourned.\n\n\tAll rise. The guard drags Taylor from the inquiry room. Zira and \n\tCornelius stand there, stunned by the entrapment into which Zaius has \n\tmaneuvered them.\n\n287-\n289 \tOUT\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n290\tINT. A SMALL OFFICE - CLOSE ON DR. ZAIUS - NIGHT\n\n\tThe office is as unadorned and Spartan as that of Cornelius  -- in \n\tfact, with minor changes in decor, the same set can be used. There are \n\tmany thick leatherbound books on this scholar's desk. Zaius is reading \n\tone of them and taking notes. He looks up as someone KNOCKS at the \n\tdoor.\n\n291\tREVERSE ANGLE - SHOOTING PAST ZAIUS\n\n\tThe two agents push Taylor through the doorway.\n\n\t\t\t\tZAIUS \n\t\t\tWait outside.\n\n\tThe officers withdraw, closing the door. Collared, wrists manacled, \n\tTaylor stands facing the desk.\n\n\t\t\t\tZAIUS \n\t\t\tThe verdict is in. At the moment your \n\t\t\tsimian friends -- and  sponsors -- are \n\t\t\tfree on bail. But they'll soon be brought \n\t\t\tto trial for heresy.\n\n292\tANOTHER ANGLE - FAVORING ZAIUS\n\n\twho falls silent, as if this were the only news of import. We note at \n\tonce a change In Zaius' tone and attitude. He no longer treats Taylor \n\tlike a freak animal, but addresses him as an imaginative adversary who \n\tmust be intimidated by the threat of terror.\n\n\t\t\t\tTAYLOR\n\t\t\tWhat about me?\n\n\t\t\t\tZAIUS\n\t\t\t\t(offhandedly) \n\t\t\tOh, your case was preordained. In a way, \n\t\t\tyou performed a service for the State ...\n\t\t\t\t(smiling) \n\t\t\tBecause your hearing made it possible \n\t\t\tfor us to expose Zira and Cornelius.\n\t\t\t\t(a beat) \n\t\t\tAnd now the Tribunal has placed you in \n\t\t\tmy custody for...final disposition. Do \n\t\t\tyou know what that means?\n\n\t\t\t\tTAYLOR\n\t\t\tNo.\n\n\t\t\t\tZAIUS\n\t\t\tEmasculation, to begin with. Then \n\t\t\texperimental surgery. On the speech \n\t\t\tcenters. On the brain. Ultimately, a \n\t\t\tkind of living death.\n\n\tTaylor stiffens but says nothing. Zaius lets this prospect sink in, \n\tthen continues.\n\n\t\t\t\tZAIUS\n\t\t\tHowever, it's within my power to grant\n\t\t\tYou a reprieve.  That is why I summoned \n\t\t\tyou here tonight.\n\t\t\t\t(a beat) \n\t\t\tTell me who and what you really are and \n\t\t\twhere you come from, and no veterinary \n\t\t\twill touch you.\n\n\t\t\t\tTAYLOR\t \n\t\t\tI told the truth at that 'hearing'of yours.\n\n\t\t\t\tZAIUS\n\t\t\tYou lied. Where is your tribe?\n\n\t\t\t\tTAYLOR \n\t\t\tMy tribe, as you call it, lives on another \n\t\t\tplanet in a distant solar system.\n\n\t\t\t\tZAIUS \n\t\t\tThen how is it we speak the same language?\n\t\t\t\t(suddenly intense) \n\t\t\tEven in your lies, some truth slips \n\t\t\tthrough! That mythical community you're \n\t\t\tsupposed to come from -- Fort Wayne'?\n\n\t\t\t\tTAYLOR \n\t\t\tWhat about it?\n\n\t\t\t\tZAIUS \n\t\t\tA fort! Unconsciously, you chose a name \n\t\t\tthat was belligerent.\n\t\t\t\t(more calmly) \n\t\t\tWhere were you nurtured?\n\n\t\t\t\tTAYLOR \n\t\t\tI take it you don't believe the prosecutor's \n\t\t\tcharge -- that I'm a monster created by \n\t\t\tDr. Zira.\n\n\t\t\t\tZAIUS\n\t\t\tCertainly not.\tYou're a mutant.\n\n\t\t\t\tTAYLOR \n\t\t\tThat's exactly what Zira and Cornelius \n\t\t\tclaim. You're talking heresy, doctor.\n\n\t\t\t\tZAIUS\n\t\t\t\t(smiling) \n\t\t\tOf course.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(growing bolder) \n\t\t\tAll right, suppose I am a mutant? Why \n\t\t\tdoes the appearance of one mutant send \n\t\t\tyou into a panic?\n\n\t\t\t\tZAIUS \n\t\t\tBecause you're not unique. There was the \n\t\t\tone you call Landon --\n\n\t\t\t\tTAYLOR\n\t\t\tThen you admit --\n\n\t\t\t\tZAIUS \n\t\t\tI admit that where there's one mutant there's \n\t\t\tprobably another. And another. A nest of them. \n\t\t\tWhere's your nest, Taylor? Where are your women?\n\n\t\t\t\tTAYLOR\n\t\t\t\t(pause)\n\t\t\tThank you for calling me Taylor.\n\t\t\t\t(more firmly)\n\t\t\tDr. Zaius, I know who I am. Who are you? How \n\t\t\tdid this upside down civilization ever get \n\t\t\tstarted?\n\n\t\t\t\tZAIUS\n\t\t\t\t(strangely calm) \n\t\t\tYou may well call it upside down, since you \n\t\t\toccupy its lowest level. And deservedly.\n\t\t\t\t(pause) \n\t\t\tThe eastern desert has never been explored -- \n\t\t\tbecause we've always assumed that no life can \n\t\t\texist there.\n\t\t\t\t(a beat) \n\t\t\tSave yourself, Taylor. Tell me -- is there \n\t\t\tanother jungle beyond the Forbidden Zone?\n\n\t\t\t\tTAYLOR \n\t\t\tI don't know.\n\n\t\t\t\tZAIUS \n\t\t\tIf you are protecting others of your kind, \n\t\t\tit will cost you your identity.\n\n\t\t\t\tTAYLOR \n\t\t\tI'm not protecting anybody! That hearing \n\t\t\twas a farce. What have I done?\n\n\t\t\t\tZAIUS \n\t\t\tYou're a menace! A walking pestilence. I \n\t\t\tdo know who you are, Taylor. As I know \n\t\t\tthat others of your kind must live in the \n\t\t\tForbidden Zone.\n\t\t\t\t(decisively) \n\t\t\tYou have just six hours to make a full \n\t\t\tconfession. After that I'll employ surgery \n\t\t\tto obtain one.\n\t\t\t\t(calling off) \n\t\t\tGuards!\n\n\tThe two burly security agents open the door and enter.\n\n\t\t\t\tZAIUS \n\t\t\tTake this creature back to his cage.\n\n\tThe guards seize Taylor, start to shove him toward the doorway. He \n\ttwists around, faces Zaius.\n\n\t\t\t\tTAYLOR\n\t\t\tAll right, you can cut me to pieces. It's \n\t\t\twithin your power.\n\t\t\t\t(with force)\n\t\t\tBut know this, doctor. You do it because \n\t\t\tyou're afraid of me. You do it from fear!\n\n\tZaius jerks his head silently toward the door. The apes drag Taylor \n\tthrough it.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n293\tINT. ADJACENT CAGES - MED. SHOT - NIGHT\n\n\tA few hours have passed. Nova is watching Taylor from her cage across \n\tthe aisle. He sits on the pile of straw. There is an ugly welt on his \n\tcheek made by the security officer's whip. FOOTSTEPS are heard. Taylor \n\tand Nova look up and off.\n\n294\tREVERSE ANGLE - WHAT THEY SEE:\n\n\tA solemn, teen-age chimp named LUCIUS appears outside the cage. The \n\tguard Julius rises from his chair.\n\n\t\t\t\tLUCIUS\n\t\t\tAre you Julius?\n\n\t\t\t\tJULIUS\n\t\t\tWhat do you want?\n\n\t\t\t\tLUCIUS\n\t\t\tI'm from the Office of Animal Affairs. \n\t\t\t\t(indicating Taylor)\n\t\t\tThis male's to be transferred to the zoo.\n\n\t\t\t\tJULIUS\n\t\t\tAt this hour? Who says so?\n\n\tTaylor enters scene, coming over to the cage bars as Lucius continues \n\tgravely, with just a note of disdain.\n\n\t\t\t\tLUCIUS \n\t\t\tDon't they tell you anything? The Anti-\n\t\t\tvivisectionist Society is up in arms. They're \n\t\t\tgoing to save this beast from those butchers \n\t\t\tin the lab. If he can speak he belongs in the \n\t\t\tpublic zoo. \n\t\t\t\t(taking off) \n\t\t\tBut what'll probably happen is that some \n\t\t\tmoney-mad grown-up will put him in a circus. \n\t\t\tAnd then we'll have to pay to see what \n\t\t\trightfully should have --\n\n\t\t\t\tJULIUS \t\n\t\t\tStop making speeches and show me the order.\n\n\tLucius hands the guard a document. It is dark here, so Julius crosses \n\tto a beam of light near the bars and studies the document. Lucius, \n\tbehind the guard's back, signals frantically for Taylor to seize or \n\tstrike the guard. Taylor is slow to understand. Lucius shakes his\n\thead impatiently.\n\n\t\t\t\tJULIUS  \n\t\t\t\t(peering at document)\n\t\t\tThis order's no good. It must be counter-\n\t\t\tsigned by Dr. Zaius --\n\n\tLucius suddenly gives Julius a violent shove. The guard's head crashes \n\tagainst the bars and he is stunned.\n\n\t\t\t\tLUCIUS\n\t\t\tHit him!\n\n\tTaylor complies  bringing down the heel of his fist on the nape of the \n\tguard's neck. Julius collapses. The youngster immediately squats down, \n\tgags him, and begins to bind him hand and foot. CAMERA MOVES IN.\n\n\t\t\t\tTAYLOR \n\t\t\tWho are you?\n\n\t\t\t\tLUCIUS\n\t\t\t\t(looking up,coolly) \n\t\t\tSo you can talk.\n\t\t\t\t(as he works) \n\t\t\tI'm Dr. Zira's nephew. This abduction was \n\t\t\ther idea. You're not really going to the \n\t\t\tzoo. That's just our cover story in case \n\t\t\twe're stopped.\n\t\t\t\t(off again) \n\t\t\tAlthough I do feel that if it ever came \n\t\t\tdown to a question of whether something \n\t\t\tlike you should be public or private \n\t\t\tproperty --\n\n\t\t\t\tTAYLOR\n\t\t\tCome on. Get me out of here.\n\n\tTaking the guard's keys, Lucius rises and unlocks the cage. Nova enters \n\tthe scene, coming to the bars of her cage.\n\n295\tCLOSE TWO SHOT - TAYLOR AND NOVA\n\n\tHe gazes at her, tense with indecision. She flashes an imploring smile, \n\ta mute appeal that cannot be denied. Over this we hear:\n\n\t\t\t\tLUCIUS' VOICE \n\t\t\t\t(o.s.)\n\t\t\tWe've got to move fast.\n\n296\tWIDER ANGLE - TO INCLUDE LUCIUS\n\n\tas Taylor leaves his cage.\n\n\t\t\t\tTAYLOR\n\t\t\tShe comes along too.\n\n\t\t\t\tLUCIUS\n\t\t\tZira doesn't want your female.\n\n\t\t\t\tTAYLOR\n\t\t\tI want her.\n\n\t\t\t\tLUCIUS\n\t\t\t\t(a shrug)\n\t\t\tIf you insist. But I'm not taking\n\t\t\tany orders --\n\n\t\t\t\tTAYLOR\n\t\t\tFine. Just let her out.\n\n\tLucius unlocks Nova's cage. She comes out quickly, takes Taylor's hand. \n\tThey follow Lucius out of the compound.\n\n297\tEXT. ANIMAL COMPOUND - MED. SHOT - NIGHT\n\n\tA horse-drawn caged wagon (like that used in the hunt) stands near the \n\tbuilding. Zira waits at the rear of the wagon. Lucius, Taylor and Nova \n\temerge from a doorway or archway and join her. Zira notes Nova's\n \tpresence with disapproval. They speak in undertones.\n\n\t\t\t\tZIRA\n\t\t\t\t(to Lucius) \n\t\t\tI told you not to bring the other one.\n\n\t\t\t\tLUCIUS \n\t\t\tHe wouldn't leave her.\n\n\t\t\t\tZIRA\n\t\t\t\t(with a sigh)\n\t\t\tAll right...\n\t\t\t\t(to the humans)\n\t\t\tGet in...hurry.  Put this on.\n\n\t\t\t\tTAYLOR\n\t\t\tListen-\n\n\t\t\t\tZIRA \n\t\t\tTaylor -- just keep quiet and we may get \n\t\t\taway with this. Remember that men all \n\t\t\tlook alike to most apes. \n\n\tTaylor and Nova comply, climbing into the cage. Lucius closes the \n\ttailgate. Lucius and Zira move to the front of the wagon and climb \n\taboard. Lucius takes the reins. As they move off:\n\n\t\t\t\t\t\t\t\tWIPE TO:\n\n298\tEXT. LAKE AND CAUSEWAY - LONG HIGH ANGLE SHOT - NIGHT\n\n\tAs previously established, the animal compound is on the outskirts of \n\tApetown. The abductors must cross the causeway on their route of \n\tescape. In the distance, near the gazebo, we can see the lights of \n\tseveral torches.\n\n\tThe caged wagon rolls into scene and out onto the causeway. At the same \n\ttime a mounted gorilla leading two pack animals appears on the far side \n\tof the causeway, coming toward CAMERA. Lucius stops the wagon.\n\n299\tCLOSE TWO SHOT - LUCIUS AND ZIRA - ON THE WAGON\n\n\t\t\t\tLUCIUS\n\t\t\t\t(apprehensively)\n\t\t\tGorilla hunters ...\n\n\t\t\t\tZIRA \n\t\t\tKeep moving. We can't turn back now.\n\n300\tBOOM SHOT - THE CAUSEWAY\n\n\tAs the mounted hunter nears the wagon, we can see two bodies slung \n\tacross the backs of the pack animals.\n\n301\tFLASH SHOT - TAYLOR AND NOVA - IN WAGON CAGE\n\n\tThey look out at:\n\n302\tTHE PASSING HORSES - FROM THEIR P.O.V.\n\n\tThe bodies on the horses are naked human corpses.\n\n303\tMED. LONG SHOT - THE CAUSEWAY - REVERSE ANGLE\n\n\tIn immediate f.g., near the gazebo, is a similar wagon. It has lost a \n\twheel, and its rear axle lies on the edge of the causeway. Two naked \n\tprimitive males can be dimly seen within the cage. Four or five armed \n\tgorilla hunters stand near the wagon: two of them carry torches; the \n\tothers are passing a jug from hand to hand-.\n\n\tThe leader of the Hunt Club, still on horseback, holds up his hand as \n\tthe lab wagon approaches.\n\n\t\t\t\tLEADER \n\t\t\tHold it!\n\n\tLucius obeys. The hunters on foot swarm around his wagon as their \n\tleader calls authoritatively:\n\n\t\t\t\tLEADER \n\t\t\tAh, Doctor Zira! Our wagon broke down! I'm \n\t\t\tafraid we'll have to commandeer yours.\n\n304\tCLOSER ANGLE - THE LAB WAGON\n\n\tas the Hunt Club Leader rides over, recognizing the animal \n\tpsychologist.\n\n\t\t\t\tZIRA \n\t\t\tYou can't! I've two sick humans in the \n\t\t\tcage. We're taking them to the chief vet \n\t\t\tat the zoo ...\n\n\t\t\t\tLEADER \n\t\t\t\t(indicating his \n\t\t\t\town wagon) \n\t\t\tWe bagged two live ones today. I'll have \n\t\t\tto ask you to take them along.\n\n\tHe moves to the rear of the wagon.\n\n\t\t\t\tZIRA \n\t\t\t\t(following him; \n\t\t\t\tfrantically) \n\t\t\tNo, no, my animals are diseased... Leave \n\t\t\tthem alone! They're diseased, I tell you!\n\n\tLucius jumps down and runs toward the rear of the wagon.\n\n305\tREVERSE ANGLE - REAR OF WAGON\n\n\tThe hunters have opened the tailgate and are shining their torches on \n\tthe humans. They sound ready for sport.\n\n\t\t\t\tFIRST HUNTER \n\t\t\tGive him a taste of fire!\n\n\tOne of the hunters points his torch at Taylor, who, quite naturally, \n\tshrinks back as Lucius runs into scene.\n\n\t\t\t\tLUCIUS\n\t\t\tStand back! He's dangerous!\n\n\t\t\t\tFIRST HUNTER\n\t\t\tWhy?\n\n\t\t\t\tZIRA\n\t\t\tHe's rabid! His bite is fatal!\n\n\t\t\t\tFIRST HUNTER\n\t\t\tYou serious?\n\n\t\t\t\tLUCIUS\n\t\t\tYou would die in agony! \n\t\t\t\t(with appropriate gestures)\n\t\t\tFrothing at the mouth!\n\n\tThe hunters fall back. Lucius promptly locks the tailgate and he and \n\tZira run back to the front of the wagon. Lucius snaps the reins and the \n\twagon moves off. The hunters follow it a few paces, pausing near their \n\tmounted leader.\n\n\t\t\t\tFIRST HUNTER \n\t\t\tThey treat those animals better than they \n\t\t\ttreat us.\n\n\t\t\t\tLEADER \n\t\t\tI still say the only good human is a dead \n\t\t\thuman.\n\n\tThe fugitives' wagon recedes beyond the gazebo, as we:\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n306\tEXT. AN OPEN RANGE - LONG SHOT - DAWN\n\n\tThe horse-drawn wagon is silhouetted-against the dawn light, bumping \n\tacross a semi-arid plain studded with mesquite and sage. (This SCENE \n\tcan be SHOT either on the Navajo reservation near Page or on the \n\tRanch).\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n307\tEXT. SAVANNA (OR CULTIVATED FIELDS) - LONG SHOT - MORNING\n\n\tThis is the same area described on page 24, where the hunt occurred. As \n\tthe wagon rolls along a dirt track, the tall grasses of the savanna (or \n\tcultivated field) can be seen in b.g.\n\n308\tCLOSE TWO SHOT - TAYLOR AND NOVA - IN WAGON CAGE\n\n\tTaylor is dozing, but the girl is alert and nervous. She peers out at \n\tthe field, apparently recognizing or remembering this terrain. She \n\tnudges Taylor, waking him.\n\n309\tEXT. GROVE OF WILD FRUIT TREES - LONG PANNING SHOT - DAY\n\n\tThis, too, is the location described on page 24. CAMERA PANS with the \n\twagon as it rolls into the grove and HOLDS on three horses. Cornelius \n\tsits astride one horse; the other two nags are heavily burdened with \n\tpacks and saddlebags.\n\n310\tCLOSER ANGLE - THE GROVE - FAVORING CORNELIUS\n\n\tHe dismounts as Zira and Lucius jump down from the wagon\n\tand hurry toward him. Cornelius and his fiancee embrace and kiss \n\tlightly, ape-fashion.\n\n\t\t\t\tCORNELIUS\n\t\t\tHow did it go?\n\n\t\t\t\tZIRA \n\t\t\tThere was one bad moment -- some hunters \n\t\t\tstopped us.\n\n\t\t\t\tLUCIUS   \n\t\t\t\t(calmly)  \n\t\t\tI pursuaded them our beasts had rabies.\n\n311\tCLOSE TWO SHOT - TAYLOR AND NOVA - IN CAGED WAGON\n\n\tThe apes discussing the abduction are out of earshot. Exasperated to be \n\tthus ignored and caged, Taylor kicks the tailgate, shouting:\n\n\t\t\t\tTAYLOR \n\t\t\tLet me out of here!\n\n312\tWIDER ANGLE - TO INCLUDE THE GROUP\n\n\tLucius hurries back to unlock the tailgate. Taylor gets out of the \n\twagon, stretching his stiffened joints. Nova follows suit. During the \n\tensuing exchange the girl seems strangely agitated, pacing to and fro, \n\ther eyes scanning the grove and fields in search of someone or \n\tsomething.\n\n\t\t\t\tCORNELIUS\n\t\t\t\t(approaching)\n\t\t\tWell, Taylor -- we're all fugitives now.\n\n\t\t\t\tTAYLOR\n\t\t\tDo you have any weapons?\n\n\t\t\t\tCORNELIUS\n\t\t\tThe best. But we won't need them.\n\n\t\t\t\tTAYLOR\n\t\t\tJust the same, I want one.\n\n\tHe moves toward one of the horses. Cornelius starts after him.\n\n\t\t\t\tCORNELIUS \n\t\t\tLook here, Taylor. I'm in charge of this \n\t\t\texpedition --\n\n\tTaylor takes a rifle from one of the packs, examines it.\n\n\t\t\t\tTAYLOR\n\t\t\tFair enough. But you're no longer in \n\t\t\tcharge of me. And I don't mean to be \n\t\t\tcaptured again.\n\n\tZira and Lucius have come up.\n\n\t\t\t\tCORNELIUS \n\t\t\t\t(peeved) \t\n\t\t\tAs you wish.\n\n\t\t\t\tTAYLOR \n\t\t\tZaius seems to think there might be \n\t\t\tanother jungle beyond the Forbidden Zone. \n\t\t\tThat's what  we'll try for. What about you?\n\n\t\t\t\tZIRA \n\t\t\tCornelius and I have been indicted for \n\t\t\theresy. Unless we can prove our theories, \n\t\t\twe don't stand a chance of acquittal.\n\n\t\t\t\tTAYLOR \n\t\t\tYou're going back to the Forbidden Zone?\n\n\t\t\t\tCORNELIUS\t\n\t\t\tTo the diggings I worked at a year ago. \n\t\t\tIt's a three day ride across the eastern \n\t\t\tdesert, near where you claim you landed \n\t\t\tfrom that planet of yours.\n\n\t\t\t\tTAYLOR\n\t\t\tYou still don't believe me, do you?\n\n\t\t\t\tCORNELIUS \n\t\t\t\t(shrugs) \n\t\t\tIt's a long detour to Dead Lake. What \n\t\t\twould we find?\n\n\tTaylor makes a helpless gesture, realizing that he cannot present sure \n\tproof.\n\n\t\t\t\tTAYLOR \n\t\t\tNothing much. The remnants of a life raft. \n\t\t\tMaybe a small flag. The emblem of my \n\t\t\tcountrymen.\n\n\t\t\t\tCORNELIUS \n\t\t\tSorry, Taylor. The terrain around that lake \n\t\t\tis poisonous. There is no fresh water, no \n\t\t\tvegetation. Nothing.\n\n\t\t\t\tTAYLOR\n\t\t\tI know ... Nevertheless, I thank you\n\t\t\tfor saving us. You'll be in trouble for \n\t\t\tgoing there.\n\n\t\t\t\tZIRA \n\t\t\t\t(a smile) \n\t\t\tWe've been in trouble since the moment we \n\t\t\tmet you.\n\n\tNova seizes Taylor's arm to get his attention. Trying to communicate,\n \tshe makes whimpering sounds and points at:\n\n313-\n314\tOMIT\n\n315\tTHE DISTANT JUNGLE - AS SEEN FROM THE GROVE\n\n\tThis is the same view of the jungle that Taylor saw when the gorilla\n \thunters emerged from the trees. (Page 25)\n\n\t\t\t\tZIRA'S VOICE \n\t\t\t\t(o.s.)\n\t\t\tWhat's she pointing at?\n\n316\tBACK TO TAYLOR AND THE OTHERS\n\n\tTaylor smiles at Nova, gives her a reassuring shrug.\n\n\t\t\t\tTAYLOR \n\t\t\tThat's the way home. And she knows it.\n\n\tNova turns away, still holding Taylor's arm, tries to lead him toward \n\tthe jungle.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(sharply)\n\t\t\tNova!\t\n\t\t\t\t(she turns; he shakes\n\t\t\t\this head, says gently)\n\t\t\tWe can't stay there. It's not safe.\n\n\tShe looks at him sadly.\n\n\t\t\t\tZIRA \n\t\t\tWe'd better get started. If the mounted \n\t\t\tpolice pick up our trail, they'll come \n\t\t\tthis far at least.\n\n\t\t\t\tCORNELIUS\n\t\t\tRight. \n\t\t\t(to Lucius) \t\n\t\tLet's put the water and provisions in \n\t\tthe wagon.\n\n\tHe and Lucius move off toward the horses.\n\n\t\t\t\tZIRA\n\t\t\t\t(indicating Nova)\n\t\t\tAre you going to take her with you?\n\n\t\t\t\tTAYLOR\n\t\t\tYes.\n\n\t\t\t\tZIRA \n\t\t\tActually, you're a different breed. \n\t\t\tThis creature will never evolve.\n\n\t\t\t\tTAYLOR\n\t\t\tMaybe not.\n\n\t\t\t\tZIRA \n\t\t\t\t(smiling) \n\t\t\tYou want her that much?\n\n\t\t\t\tTAYLOR \n\t\t\t\t(testily) \n\t\t\tYou threw us together, remember? And you \n\t\t\tguessed right. Men, like apes, get \n\t\t\tdespondent without a mate.\n\n\tHe walks off to help Lucius and Cornelius. Nova tags along behind him \n\tas we:\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\nA-316\tTHE GROUP MOVES ACROSS A PLATEAU\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n317\tEXT. DRY WASH AND TAMARISKS - FEATURING SCARECROWS - DAY\n\n\tThe caravan is crossing, in a reverse direction, the route taken by the \n\tastronauts on page 17. The three apes are on horseback. Taylor and Nova \n\tfollow in the wagon. They are nearing the row of sinister scarecrows on \n\tthe bluff above the dry wash.\n\n318\tMED. SHOT - THE THREE MOUNTED APES\n\n\tThey halt briefly and look up at the crosses. Lucius is impressed.\n\n\t\t\t\tLUCIUS \n\t\t\tWho put them up?\n\n\t\t\t\tZIRA\n\t\t\tThe Hunt Club.\n\n\t\t\t\tLUCIUS \n\t\t\tTo scare off humans?\n\n\t\t\t\tCORNELIUS\n\t\t\tTo scare us, too. We're entering\n\t\t\tthe Forbidden Zone.\n\n\tThey move off again, riding across the dry wash.\n\n319\tTWO SHOT - TAYLOR AND NOVA - SEATED ON THE WAGON\n\n\tThey, too, have stopped and are looking up at the scarecrows. Nova is \n\tplainly terrified. She grabs Taylor's arm, whimpers.\n\n\t\t\t\tTAYLOR \n\t\t\tDon't worry. You'll be safe with me.\n\t\t\t\t(sudden smile) \n\t\t\tHere. It's time you learned to earn \n\t\t\tyour keep.\n\n\tHe hands the reins to Nova. She just sits there. He demonstrates.\n\n\t\t\t\tTAYLOR\n\t\t\tYou can do it. Like this ...\n\n\tNova flicks the reins, reacting in wide-eyed, open-mouthed disbelief as \n\tthe horse obeys her.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n320\tEXT. DESERT PLATEAU - LONG HIGH ANGLE SHOT - DAY FOR NIGHT\n\n\tThe party is traversing a red desert to the east of Dead Lake. Great \n\tsandstone monoliths rise from the desert floor. From this vantage point \n\tthe horses look no bigger than ants.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n321\tEXT. RIM OF A DEEP GORGE - HELICOPTER SHOT - DAY\n\n\tThis is terrain never before seen in this picture. (Lake Powell \n\tlocation, a few miles northeast of Wahweap). The party can be seen on \n\tthe rim of a flat desert tableland that falls away abruptly to a vast, \n\tirregular river of deep blue water. Taylor, Cornelius and Lucius are \n\tunloading the wagon and repacking their provisions and equipment on the \n\tbacks of horses. Zira watches them.\n\nA-321\tCLOSER ANGLE - THE GROUP\n\n\tZira wanders off, falls to her knees.\n\n\t\t\t\tLUCIUS\n\t\t\tSomething's wrong with your mate.\n\n\tTaylor looks off. He and the others move quickly to Nova, CAMERA \n\tPANNING with them.\n\nB-321\tCLOSE GROUP SHOT - AROUND NOVA\n\n\tShe has been retching. Taylor lifts her up. She is faint with nausea. \n\tZira squats down beside them.\n\n\t\t\t\tZIRA \n\t\t\tLet me handle this. \n\t\t\t\t(ruefully, to Taylor) \n\t\t\tYou may be smarter than I am, but I'm \n\t\t\tthe veterinary on this planet.\n\n\tAssisting Nova to her feet, Zira leads her off toward the wagon.\n\nC-321\tMED. SHOT - CORNELIUS, TAYLOR AND LUCIUS.\n\n\tTaylor watches the departing females, then looks down at the river.\n\n\t\t\t\tTAYLOR\n\t\t\tWhere does the river lead?\n\n\t\t\t\tCORNELIUS \n\t\t\tIt empties into a sea some miles from \n\t\t\there. That's where the cave is.\n\nD-321\tLONG SHOT - THE RIVER - FROM THEIR P.O.V..\n\n\tThe river winds o.s. between the sheer sandstone Cliffs rising from \n\teither bank.\n\n\t\t\t\tTAYLOR'S VOICE\n\t\t\t\t(o.s.)\n\t\t\tAnd beyond that?\n\nE-321\tTHREE SHOT - TAYLOR, LUCIUS AND CORNELIUS\n\n\t\t\t\tCORNELIUS \n\t\t\tDon't know. At high tide you can't ride \n\t\t\talong the shore, and we had no boats on \n\t\t\tthe last expedition.\n\n\t\t\t\tTAYLOR \n\t\t\tYou've never told me why this region's \n\t\t\tcalled the Forbidden Zone.\n\n\t\t\t\tCORNELIUS \n\t\t\tNo one really knows. It's an ancient \n\t\t\ttaboo. Set forth in the Sacred Scrolls. \n\t\t\tThe Lawgiver pronounced the area deadly.\n\n\t\t\t\tLUCIUS \n\t\t\tShouldn't we be moving on?\n\n\t\t\t\tTAYLOR\n\t\t\tI'm for that.\n\n\tThey start toward the horses and wagon.\n\nF-321\tGROUP SHOT - NEAR WAGON\n\n\tZira is looking curiously at Nova, who stands in the shade leaning \n\tagainst the wagon as the males enter the scene. Nova's nausea has \n\tpassed, and she comes smiling to Taylor.\n\n\t\t\t\tTAYLOR \n\t\t\tWhat's the diagnosis, doctor? A touch \n\t\t\tof the sun?\n\n\t\t\t\tZIRA\n\t\t\tShe's not sick at all.\n\t\t\t\t(a beat)\n\t\t\tShe's pregnant.\n\nG-321\tCLOSEUP - TAYLOR\n\n\tConsternation slowly gives way to wonder. He grins.\n\n\t\t\t\tTAYLOR\n\t\t\tSo I'm not an altogether\n\t\t\tdifferent breed, you see?\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n322-\n325\tTHE DESCENT OF THE GORGE - SEVERAL SHOTS - DAY\n\n\tTo reach the camp site -- a beach at the base of the gorge -- the party \n\tmust lead the horses along a narrow trail that zigzags down the face of \n\tthe sandstone cliffs. They have abandoned the wagon.\n\n\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n326\tEXT. ARCHEOLOGICAL CAMP - ESTABLISHING SHOT - DAY\n\n\tSand bars and two narrow beaches are in evidence here. The camp itself \n\tconsists of several lean-tos against the cliff wall. Above the camp, \n\treached by ladders connected to scaffolding, is the mouth of a cave. \n\tZira is cleaning up the breakfast things; Zaius and Lucius are sorting \n\tout equipment.\n\nA-326\tCLOSER ANGLE - TAYLOR AND ZIRA\n\n\tA small bowl of water rests on the ground in front of Taylor He has \n\tnearly finished shaving himself with a sharp hunting knife. Nova \n\twatches, a look of fascinated approval on her face. Taylor rinses off \n\this knife, starts to dry it. Nova reaches out, gently strokes his \n\tsmooth -- if nicked -- chin.\n\n\t\t\t\tTAYLOR \n\t\t\t\t(smiling) \n\t\t\tYou like it?\n\n\tLucius and Cornelius come up, Zira with them.\n\n\t\t\t\tLUCIUS \n\t\t\t\t(disapprovingly) \n\t\t\tWhy did you do that? Scrape off your \n\t\t\thair?\n\n\t\t\t\tTAYLOR\n\t\t\tIn my world -- before I left it - \n\t\t\tonly youngsters of your age wore un-\n\t\t\tscraped hair.\n\n\t\t\t\tCORNELIUS \n\t\t\t\t(to Taylor, quizzically) \n\t\t\tIt makes you look somehow ... less \n\t\t\tintelligent.\n\n\tTaylor grins wryly at Cornelius, picks up his rifle.\n\n\t\t\t\tTAYLOR \n\t\t\tWhen are you going to show me what's \n\t\t\tin the cave?\n\n\t\t\t\tCORNELIUS \n\t\t\tRight now, if you like.\n\n\tThey cross the beach to the ladders, when suddenly they hear the sound \n\tof horses. They look o.s.\n\nB-326\tWHAT THEY SEE:\n\n\tDr. Zaius and five armed and mounted apes have come around the corner \n\tof the beach and ride toward them through the rocks.\n\nC-326\tMEDIUM - THE GROUP\n\n\tTaylor scrambles up onto the lower scaffold. Lucius runs to a lean-to, \n\tscoops up his rifle.\n\n\t\t\t\tCORNELIUS\n\t\t\tLucius -- don't fire at them.\n\n\tThe party rides up.\n\n\t\t\t\tZAIUS \n\t\t\tYou're all under arrest! \n\t\t\t\t(to Lucius) \n\t\t\tYou seditious scoundrel. Drop that \n\t\t\trifle.\n\n327-\tOUT\n348\n\n349\tFLASH SHOT - LUCIUS\n\n\tHe wavers, lowering his piece.\n\n350\tWIDER ANGLE - TO INCLUDE BOTH GROUPS\n\n\tZaius' gorillas ride forward a few paces, but halt again as Taylor \n\tshouts:\n\n\t\t\t\tTAYLOR \n\t\t\tStop right there.\n\n\t\t\t\tZAIUS \n\t\t\tDon't be a fool. You're outnumbered \n\t\t\tand outgunned.\n\n\tTaylor aims at Zaius and calls out:\n\n\t\t\t\tTAYLOR \n\t\t\tIf there's any shooting, Dr. Zaius, \n\t\t\tyou'll be the first to die. Depend \n\t\t\ton it.\n\n\t\t\t\tCORNELIUS \n\t\t\t\t(protesting) \n\t\t\tTaylor, you're not in command here. \n\t\t\tPut down that gun.\n\n\t\t\t\tTAYLOR\n\t\t\tShut up.\n\n\tSilence.\tZaius knows Taylor isn't bluffing.\n\n\t\t\t\tZAIUS\n\t\t\tVery well.\n\t\t\t\t(to his followers) \n\t\t\tLower your weapons.\n\n\tThey obey. Taylor calls again:\n\n\t\t\t\tTAYLOR \n\t\t\t\t(pointing) \n\t\t\tTell them to move around the point. \n\t\t\tOut of range.\n\n\tZaius turns and whispers to his apes. They rein about and ride away \n\tthrough the rocks. Zaius dismounts and approaches the fugitives alone. \n\tHe is unarmed.\n\n351\tCLOSER ANGLE - THE GROUP\n\n\tAs Zaius draws nearer) Lucius lowers his rifle. But Taylor keeps his at \n\tthe ready.\n\n\t\t\t\tCORNELIUS \n\t\t\t\t(uncertainly) \n\t\t\tHow did you know we'd come here?\n\n\t\t\t\tZAIUS \n\t\t\tIt wasn't difficult. Only an apostate \n\t\t\tor a lunatic would flee to the Forbidden \n\t\t\tZone. \n\t\t\t\t(a glance at Taylor) \n\t\t\tI see you brought along the female of \n\t\t\tyour species.\n\t\t\t\t(Taylor nods) \n\t\t\tI didn't realize a man could be monogamous.\n\n\t\t\t\tTAYLOR\n\t\t\tOn this planet -- it's easy.\n\n\tZaius laughs derisively, then turns to the apes.\n\n\t\t\t\tZAIUS \n\t\t\t\t(evenly) \n\t\t\tI ask you to reconsider the rash course \n\t\t\tyou've taken. If you're convicted of heresy, \n\t\t\tthe most you'll get is two years. But if \n\t\t\tyou persist in pointing guns in my direction, \n\t\t\tyou'll hang for high treason.\n\n\t\t\t\tCORNELIUS \n\t\t\t\t(respectfully) \n\t\t\tWe've never meant to be treasonable, sir.\n \t\t\t\t(pointing off) \n\t\t\tBut up there, in the face of that Cliff, \n\t\t\tis a vast cave -- and in that cave a \n\t\t\tfabulous treasure of fossils and artifacts.\n\n\t\t\t\tZAIUS \n\t\t\tI've seen some of your fossils and artifacts. \n\t\t\tThey're worthless.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(derisively) \n\t\t\tAnd that's your Minister of Science. Honor-\n\t\t\tbound to expand the frontiers of knowledge.\n\n\t\t\t\tZIRA\n\t\t\t\t(worried)\t\n\t\t\tTaylor, please --\n\n\t\t\t\tTAYLOR \n\t\t\tExcept that he's also the Chief Defender \n\t\t\tof the Faith.\n\n\t\t\t\tZAIUS\n\t\t\t\t(loftily) \n\t\t\tThere is no contradiction between faith \n\t\t\tand science. True science.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(suddenly angered) \n\t\t\tAll right, let's see if you're willing \n\t\t\tto put that statement to a test.\n\n\t\t\t\tCORNELIUS \n\t\t\tTaylor, I'd rather you -\n\n\t\t\t\tTAYLOR\n\t\t\tNo. You saved me from this fanatic. Maybe \n\t\t\tI can pay you back.\n\n\t\t\t\tZAIUS\n\t\t\t\t(calmly)\n\t\t\tWhat is your proposal?\n\n\t\t\t\tTAYLOR \n\t\t\tWhen were the Sacred Scrolls written?\n\n\t\t\t\tZAIUS \n\t\t\tTwelve hundred years ago.\n\n\t\t\t\tTAYLOR \n\t\t\tVery well. If Zira and Cornelius can prove \n\t\t\tthat those scrolls don't tell the whole \n\t\t\ttruth of your history; if they can show you \n\t\t\tdefinite evidence of another culture from an \n\t\t\tunrecorded past -- will you exonerate them?\n\n\t\t\t\tZAIUS\n\t\t\tOf course.\n\n\t\t\t\tTAYLOR\n\t\t\tOkay.Up to the cave.\n\n\tHe gestures toward the path leading to it. Zaius, Zira, and Cornelius \n\tstart upward. Lucius starts to follow them.\n\n\t\t\t\tTAYLOR \n\t\t\tSorry, Lucius. You'll have to stay here \n\t\t\tand guard the horses.\n\n\t\t\t\tLUCIUS \n\t\t\tAlways giving orders. Just like every \n\t\t\tother adult.\n\n\t\t\t\tTAYLOR\n\t\t\tRelax. You'll see it all later.\n\n\tHe pats the barrel of Lucius' gun, in the manner of a stern but \n\tbenevolent non-com, then starts up the trail with Nova at his heels. \n\tLucius, unused to taking commands from an animal, scowls after him, \n\tthen shrugs, adjusting to the Idea.\n\n352-\n355\tOUT\n\n356 \tEXT. WESTERN WALL OF GORGE - LONG SHOT - ANGLING UP\n\tAFTERNOON\n\n\tThe sun hovers over the lofty rim of the lake like a great red balloon. \n\tThe wall of the gorge, in shadow, is a darker hue.\n\n357\tEXT.  EASTERN WALL OF GORGE - LONG SHOT - ANGLING UP\n\n\tThe crenelated east wall, looking like a red cathedral, is aglow with \n\tsunlight. So is the mouth of the cave as the three apes, Taylor and \n\tNova pass through it and o.s.\n\n358\tINT. CAVERN - BOOM SHOT - DAY\n\n\tNature has formed a vaulted room here. It need not be enormous, but \n\tshould be as weird and fantastic as production capabilities permit. \n\tThere is an ape-made excavation in the floor of the cave, some ten feet \n\tsquare and eight feet deep. Some small objects lie on the rim of the \n\texcavation. Zaius, Cornelius, Zira, Taylor and Nova enter from the \n\toutside.\n\n\t(AUTHOR'S NOTE: The effect should be an eyeful. I wish to create an \n\tillusion of sunlight penetrating this cave, flooding it with direct, \n\trefracted illumination, transforming it into a kaleidoscopic cavern.)\n\n\t\t\t\tZAIUS\n\t\t\tPresent your evidence, Cornelius.\n\n\tCornelius clambers down into the pit, followed by Zira. Taylor bends \n\tdown, examines some of the artifacts lined along the edge of the \n\texcavation. Nova sits beside him.\n\n\t\t\t\tCORNELIUS \n\t\t\t\t(pointing) \n\t\t\tIt was at this level I discovered traces \n\t\t\tof an early ape creature -- stage of \n\t\t\tprimitive barbarism, really -- dating back \n\t\t\troughly thirteen hundred years. It was here \n\t\t\tI found cutting tools and arrowheads of \n\t\t\tquartz and the fossilized bones of \n\t\t\tcarnivorous gorillas.\n\n\tCAMERA (ON BOOM) MOVES IN SLOWLY as Cornelius continues:\n\n\t\t\t\tCORNELIUS \n\t\t\tBut the artifacts lying at your feet \n\t\t\twere found here, at this level. And \n\t\t\tthat's the paradox. The more ancient \n\t\t\tculture is the more advanced. Admittedly, \n\t\t\tmany of these objects are unidentified, \n\t\t\tbut clearly they were fashioned by beings \n\t\t\twith a knowledge of metallurgy.\n\n\tCAMERA KEEPS MOVING IN on the group in and around the excavation as \n\tCornelius continues:\n\n\t\t\t\tCORNELIUS \n\t\t\tIndeed, the very fact that these tools \n\t\t\tare unknown to us could suggest a culture \n\t\t\tin certain ways almost equal to our own. \n\t\t\tSome of the evidence is uncontestable ...\n\n\t\t\t\tZAIUS\n\t\t\t\t(interrupting) \n\t\t\tDon't speak to me in absolutes. The \n\t\t\tevidence is contestable.\n\n\t\t\t\tCORNELIUS\n\t\t\tI apologize.\n\n\t\t\t\tZAIUS \n\t\t\tTo begin with, your methods of dating \n\t\t\tthe past are crude, to say the least. There \n\t\t\tare geologists on my staff who would laugh at \n\t\t\tyour speculations.\n\n\t\t\t\tTAYLOR \n\t\t\tPerhaps that's why they're on your staff.\n\n\tZaius flicks a hostile glance at Taylor, then looks down at the \n\tartifacts. He nudges them with his foot.\n\n\t\t\t\tZAIUS \n\t\t\tSecondly, if these 'tools' as you call \n\t\t\tthem, are unidentified, why are they \n\t\t\tintroduced as 'evidence' of anything?\n\n\t\t\t\tZIRA \n\t\t\t\t(promptly) \n\t\t\tBut there's the doll, sir.\n\n\t\t\t\tZAIUS\n\t\t\tWhat?\n\n\t\t\t\tCORNELIUS\n\t\t\t\t(pointing)\n\t\t\tRight there. The human doll.\n\n\tZaius deigns to stoop and pick it up.\n\n359\tCLOSE ON DOLL - IN ZAIUS' HAND\n\n\tIt is only a porcelain fragment, but the head is intact, and it is \n\tunmistakably the form of a human child.\n\n\t\t\t\tZAIUS\t\n\t\t\tWhat does this prove? My grand-\n\t\t\tdaughter plays with human dolls.\n\n360\tFULL SHOT - THE EXCAVATION - INCLUDING TAYLOR\n\n\tExasperated, Zira turns to the man for confirmation.\n\n\t\t\t\tZIRA \n\t\t\tTaylor! Tell him.\n\n\t\t\t\tTAYLOR \n\t\t\tHe has a point. On my planet children \n\t\t\toften play with ape dolls.\n\n\tZaius idly tosses the doll to the ground near Nova. She picks it up, \n\tstudies it.\n\n361\tGROUP SHOT - THE THREE APES\n\n\tCornelius tries again.\n\n\t\t\t\tCORNELIUS \n\t\t\tA doll alone proves nothing. True. But \n\t\t\tthe doll was found beside the jawbone \n\t\t\tof a man -- and no trace of simian fossils \n\t\t\thas turned up in this deposit.\n\n\t\t\t\tZAIUS \n\t\t\tYour conclusion is premature. Have you \n\t\t\tforgotten your Scripture? The Thirteenth \n\t\t\tScroll?\n\t\t\t\t(quoting from memory) \n\t\t\t'And Proteus brought the upright beast \n\t\t\tinto the garden, and chained him to a tree, \n\t\t\tand the children made sport of him.'\n\n\t\t\t\tCORNELIUS\n\t\t\t\t(impatiently)\n\t\t\tNo sir, I haven't forgotten.\n\n\t\t\t\tZAIUS\n\t\t\tWell? For a time the ancients kept humans \n\t\t\tas household pets.\tUntil the Lawgiver \n\t\t\tproved that man could not be tamed. Keep \n\t\t\tdigging Cornelius. You'll find evidence of\n\t\t\tthe master of this house: an ape.\t\n\nA-361\tANOTHER ANGLE - TO INCLUDE TAYLOR AND NOVA\n\n\tAs Zira again appeals to the man.\n\n\t\t\t\tZIRA \n\t\t\tAre you going to let that pass without \n\t\t\tan answer?\n\n\tTaylor, who has been toying with objects in the dirt, looks up.\n\n\t\t\t\tTAYLOR \n\t\t\tYes. I have to agree. From all you've \n\t\t\tfound so far, his position's as good as \n\t\t\tyours.\n\n\t\t\t\tCORNELIUS\n\t\t\t\t(annoyed)\n\t\t\tWhat are you doing there?\n\n\t\t\t\tTAYLOR \n\t\t\tReconstructing a life. Care to have a \n\t\t\tlook?\n\n\tCornelius and Zira cross the pit and Zaius walks around the rim of the \n\texcavation.\n\nB-361\tMED. CLOSE SHOT - FAVORING TAYLOR AND NOVA\n\n\tAs the apes come close. A number of artifacts have been arranged in \n\tfront of Taylor.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(to Cornelius) \n\t\t\tThese were found near the human doll, \n\t\t\tright?\n\t\t\t\t(Cornelius nods) \n\t\t\tWell, whoever owned them was in pretty \n\t\t\tbad shape.\n\n\tHe picks up the twisted fragment of a pair of spectacles.\n\n\t\t\t\tTAYLOR\n\t\t\tDefective eyesight..\n\n\tAs Taylor continues his monologue, he picks up the other objects one by \n\tone.\n\n\t\t\t\tTAYLOR \n\t\t\tHe wore false teeth. \n\t\t\t\t(pause) \n\t\t\tHe suffered from a hernia and used \n\t\t\tthis truss to hold up his insides ...\n\t\t\t\t(pause)  \n\t\t\tAnd toward the end, these little rings \n\t\t\tof stainless steel enclosed a prefab-\n\t\t\tricated valve in his failing heart.\n\n\tTaylor pauses. Zaius picks up two of the steel rings, studies them.\n\n\t\t\t\tTAYLOR \n\t\t\tI don't say he was a man like an Earthman, \n\t\t\tbut I'd call him a close relative, for \n\t\t\the was plagued by most of man's ills. \n\t\t\t\t(to Zaius pointedly) \n\t\t\tYet, fragile as he was, he came before you \n\t\t\t-- and was superior to you.\n\n\t\t\t\tZAIUS \n\t\t\t\t(a calm smile) \n\t\t\tThat's lunacy. I can give an alternate \n\t\t\tdescription for everyone of those objects \n\t\t\tthat's equally as inventive as yours. But \n\t\t\tit would be conjecture, not proof.\n\n362\tWIDER ANGLE - TO INCLUDE TAYLOR AND NOVA\n\n\tShe is poking her finger inside the decapitated head of the doll. From \n\tit comes a distorted SOUND.\n\n\t\t\t\tDOLL'S HEAD \n\t\t\tMamma! Mamma! Mamma!.\n\n\tThe apes stare at the doll in astonishment. Taylor snatches the doll \n\tfrom Nova, brandishes it at the astonished Zaius.\n\n\t\t\t\tTAYLOR \n\t\t\tDr. Zaius! Would an ape make a human \n\t\t\tdoll that talks?\n\n\tZaius looks at him, speechless. At that moment the CRACK of a distant \n\trifle shot reverberates through the cavern. All present freeze, \n\tlistening.\n\n\t\t\t\tZIRA\n\t\t\tLucius....\n\n363-\n364\tOUT\n\n365\tFULL SHOT - THE CAVERN - REVERSE ANGLE\n\n\tTaylor alone is armed. Raising his rifle, he glowers at Zaius.\n\n\t\t\t\tTAYLOR\n\t\t\tYou louse!\n\n\tCornelius is already crossing the pit. He climbs out arid races toward \n\tthe mouth of the cave. Taylor runs after him. Zira and Nova hurry after \n\tTaylor.\n\n366\tMED. SHOT - ZAIUS\n\n\tExpressionless, he looks down at the doll, then moves toward the mouth \n\tof the cave.\n\n367\tEXT. TRAIL FROM CAVE TO CAMP - ANGLING UP\n\n\tCornelius emerges from mouth of the cave and runs down the trail toward \n\tCAMERA. He halts in f.g., looking down at:\n\n368\tTHE CAMP SITE - AS SEEN FROM THE TRAIL\n\n\tTwo of Zaius' gorillas have disarmed Lucius and are clubbing him with\n\ttheir rifle butts. Two other mounted apes are driving the scientists' \n\thorses back beyond the trees.\n\n369\tEXT. THE TRAIL - AS SEEN FROM THE BEACH\n\n\tCornelius, Taylor, Nova and Zira (in that order) can be seen high \n\tabove, descending the trail. CAMERA PULLS BACK TO DISCLOSE A GORILLA \n\tSNIPER in immediate f.g., crouching behind a boulder near the water. He \n\tsights his rifle at the man on the trail. Taylor is still too distant \n\tto make a sure target, and so the sniper waits.\n\n370\tCLOSER ANGLE - TAYLOR ON THE TRAIL\n\n\tThis portion of the trail has no cover or concealment. Unaware of the \n\tsniper, Taylor looks down at the camp as he makes his descent.\n\n371\tLONG SHOT - TAYLOR - AS SEEN IN THE SNIPER'S SIGHTS\n\n\tThe gorilla fires.\n\n372\tCLOSE SHOT - TAYLOR\n\n\tThe bullet ricochets off the rock wall a foot above his head. Taylor \n\tscans the terrain bewlow, looking for the sniper. Nova comes to his \n\tside, pointing at:\n\n373\tTHE SNIPER - FROM THEIR P.O.V.\n\n\tHis head is visible behind the boulder as he reloads his piece\t.\n\n374\tFLASH SHOT\n\n\tHe aims and fires.\n\n375\tFLASH SHOT - THE SNIPER\n\n\tTaylor has missed him, but the sniper ducks behind the boulder.\n\n376\tTHE TRAIL - PANNING WITH TAYLOR AND NOVA\n\n\tTaylor takes her hand and they race back up the trail to where Zira is \n\tstanding. Outcroppings of rock offer some  cover here. Taylor pushes \n\tNova down behind a rock and signals for Zira to follow suit.\n\n377\tCLOSE GROUP SHOT - TAYLOR, NOVA AND ZIRA\n\n\tThe sniper's SECOND SHOT rings out. Instead of returning the fire, \n\tTaylor looks up the rail at:\n\n378\tZAIUS - FRO14 TAYLOR'S P.O.V.\n\n\tHe is standing impassively on the trail a short distance below the \n\tmouth of the cave.\n\n379\tFLASH SHOT - TAYLOR\n\n\tBent low, he comes charging up the trail toward Zaius. The sniper's \n\tTHIRD SHOT splatters rock fragments around him.\n\n380\tREVERSE ANGLE - THE TRAIL - ANGLING UP\n\n\tZaius starts to retreat to the cave, but stumbles and falls on some \n\tloose shale. No sooner has Zaius regained his feet than Taylor \n\tovertakes him. Seizing the ape around the neck with his left arm. \n\tTaylor drives the muzzle of his pistol into Zaius' kidney. He spins \n\tZaius around, using him as a shield.\n\n381\tCLOSE TWO SHOT - ZAIUS AND TAYLOR\n\n\tTaylor releases the pressure on Zaius' throat but keeps the gun pointed \n\tat his back.\n\n\t\t\tTAYLOR\n\t\tTell him to pull back!\n\n\t\t\tZAIUS \n\t\t\t(a hoarse cry)\n\t\tCease fire! Withdraw!\n\n\tHis command echoes from the west wall of the canyon.\n\n382\tLONG SHOT - THE FLOOR OF THE GORGE - FROM THEIR P.O.V.\n\n\tThe sniper emerges from behind a boulder near the shore, and walks off \n\talong the beach.\n\n383\tBACK TO TAYLOR AND ZAIUS \n\n\tTaylor lift's the muzzle of his rifle and presses it against the back\n\tof Zaius' head.\n\n\t\t\t\tTAYLOR\n\t\t\tI ought to kill you right now.\n\t\t\t\t(nudging him) \n\t\t\tLet's go.\n\n\tThey move off down the trail.\n\n384\tEXT. ARCHEOLOGICAL CAMP - MED. SHOT - DAY\n\n\tZira rushes down the trail to Lucius, who is sprawled on the ground. He \n\thas a bloody nose and a lump on his forehead. Nova and Cornelius come \n\tnext, then Taylor, prodding Zaius ahead of him at gun point. Lucius \n\tappears to be more humiliated than hurt.\n\n\t\t\t\tLUCIUS \n\t\t\tThey took me by surprise. Sneaked\n\t\t\tup on me while I was watering the\n\t\t\thorses. What's happened to honor?\n\t\t\t\t(pause, glum) \n\t\t\tI got off one round to warn you.\n\n\t\t\t\tCORNELIUS\n\t\t\t\t(gloomingly)\n\t\t\tThey've taken everything.\n\n\t\t\t\tTAYLOR\t\n\t\t\tNot everything. They left a hostage.\n\t\t\t\t(a pause)\n\t\t\tHow do you feel, Lucius?\n\n\t\t\t\tLUCIUS\n\t\t\tDisillusioned... \n\t\t\t\t(turning on)\n\t\t\tBut vindicated! I've been right all \n\t\t\talong. You can't trust the older \n\t\t\tgeneration. It's a matter of values --\n\n\t\t\t\tTAYLOR\n\t\t\t\t(gently)\n\t\t\tAll right, all right. Will You do me \n\t\t\ta favor? No orders.\n\n\t\t\t\tLUCIUS\n\t\t\t\t(pause) \n\t\t\tWhat is it?\n\n\t\t\t\tTAYLOR \n\t\t\tI want you to go around the bend and \n\t\t\ttell those gorillas their leader is my \n\t\t\tprisoner.\n\n\t\t\t\tLUCIUS\n\t\t\t\t(thoughtfull pause)\n\t\t\tYes, I can do that.\n\n\t\t\t\tTAYL0R\n\t\t\tGood. Say I want a week's supply of food \n\t\t\tfor the woman and myself. A horse. A spade.\n\t\t\tAnd fifty rounds of ammunition.\n\n\t\t\t\tLUCIUS\n\t\t\tWhat if they won't agree to your terms?\n\n\t\t\t\tTAYLOR\n\t\t\tThen tell them Dr. Zaius won't leave \n\t\t\there alive.\n\n\t\t\t\tZIRA \n\t\t\t\t(shocked) \n\t\t\tTaylor, you can't.\n\n\t\t\t\tZAIUS\n\t\t\t\t(Calmly)\n\t\t\tOh yes he can. He's a born killer.\n\t\t\t(to Lucius)\n\t\tDeliver the message.\n\n\tLucius looks to Taylor for confirmation. Taylor nods. The young ape \n\thurries away through the rocks. Taylor crosses to a useless saddle, \n\tpicks up a coil of rope, gestures at Zaius, indicating a nearby tree.\n\n\t\t\t\tTAYLOR\n\t\t\tSit down. Over there.\n\n\tZaius squats on the ground beside the tree. Taylor sets his rifle \n\tagainst the trunk, fashions a noose and places it around Zaius' neck.\n\tThen, using an ingenious combination of knots, he ties Zaius' hands \n\tbehind his back, and finally fastens the rope around the base of the \n\ttree.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(as he works)\n\t\t\tNow, \tMinister of Science - let me explain \n\t\t\tcertain principle stress and strain. If \n\t\t\tyou exert pressure to remove these bonds, \n\t\t\tyou'll choke yourself to death. It'll be \n\t\t\tsuicide, you see?\n\n\tZira and Cornelius look down at the captive mandarin. Their rebellious \n\tspirit has evaporated, and they are clearly afraid.\n\n\t\t\t\tZIRA\t\n\t\t\tTaylor, please -- don't treat him that \n\t\t\tway.\n\n\t\t\t\tTAYLOR\n\t\t\tWhy not?\n\n\t\t\t\tZIRA \n\t\t\tIt's humiliating.\n\n\t\t\t\tTAYLOR \n\t\t\tWasn't I humiliated? By all of you? \n\t\t\tDidn't you lead me around on a leash?\n\n\t\t\t\tCORNELIUS \n\t\t\tThat was different. We thought you \n\t\t\twere .... inferior.\n\n\t\t\t\tTAYLOR \n\t\t\t\t(wintry smile) \n\t\t\tAnd now you know the truth. \n\t\t\t\t(to Zaius) \n\t\t\tCornelius has beaten you, Doctor. He \n\t\t\tproved it. Man preceded you here. You \n\t\t\towe him your science, your language, \n\t\t\twhatever knowledge you have.\n\n\t\t\t\tZAIUS \n\t\t\t\t(quietly) \n\t\t\tThen answer this: If ran was superior, \n\t\t\twhy didn't he survive?\n\n\t\t\t\tTAYLOR\n\t\t\t\t(shrugging) \n\t\t\tHe might have been wiped out by a plague. \n\t\t\tNatural catastrophe. Like a fiery storm \n\t\t\tof meteors. From the looks of this part \n\t\t\tof your planet, I'd say that was a fair bet.\n\n\t\t\t\tZIRA,\n\t\t\t\t(weakly)\n\t\t\tBut we can't be sure.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(indicating Zaius)\n\t\t\tHe is. He knew all the time. Long before \n\t\t\tyour discovery, he knew.\n\t\t\t\t(to Zaius) \n\t\t\tDefender of the Faith. Guardian of the \n\t\t\tterrible secret. Isn't that right, doctor?\n\n385-\n388 \tOUT\n\n389\tREVERSE ANGLE -\tCIRCLE - FAVORING ZAIUS\n\n\tAs Zira and Cornelius look at him expectantly.\n\n\t\t\t\tZAIUS \n\t\t\tWhat I know of man was written long ago \n\t\t\t-- set down by the wisest ape of all --\n\t\t\tour Lawgiver.\n\t\t\t\t(to Cornelius)\n\t\t\tOpen my breast pocket.\n\n\tCornelius crosses to Zaius, and takes a small book bound in black \n\tleather from the breast pocket of his tunic.\n\n\t\t\t\tZAIUS \n\t\t\tRead it to him: the twentythird Scroll, \n\t\t\tninth Verse.\n\n\tCornelius thumbs through the book, finds the citation and reads aloud:\n\n\t\t\t\tCORNELIUS \n\t\t\t'Beware the beast man, for he is the \n\t\t\tdevil's pawn. Alone among God's primates, \n\t\t\the kills for sport, or lust or greed. \n\t\t\tYes, he will murder his brother to possess \n\t\t\this brother's land. Let him not breed \n\t\t\tin great numbers, for he will make a desert \n\t\t\tof his home and yours. Shun him. Drive him \n\t\t\tback into his jungle lair: For he is the \n\t\t\tharbinger of death'.\n\n\tCornelius falls silent and looks down at Zaius.\n\n\t\t\t\tZAIUS \n\t\t\t\t(quietly) \n\t\t\tI found nothing in the cave to alter that \n\t\t\tconception of man. And I still live by its \n\t\t\tinjunction.\n\nA-389\tANOTHER ANGLE - THE GROUP\n\n\tLucius hurries out of the rocks leading a saddled horse. Zaius' five \n\tmounted gorillas appear behind him. Taylor calls out to them:\n\n\t\t\t\tTAYLOR\n\t\t\tStay where you \tare!\n\n\tLucius comes up with the horse. Taylor checks the provisions in the \n\tsaddlebags. Lucius is frowning.\n\n\t\t\t\tLUCIUS \n\t\t\tThey think you're behaving foolishly. I \n\t\t\tmust say I agree. Where will you go?\n\n\t\t\t\tTAYLOR\n\t\t\t\t(nodding o.s.) \n\t\t\tI'll start by following the shoreline.\n\t\t\t\t(a smile) \n\t\t\tAnd my nose.\n\n\t\t\t\tZIRA\n\t\t\tBut suppose you find nothing but a \n\t\t\twasteland. How will you survive?\n\n\t\t\t\tZAIUS \n\t\t\t\t(firmly) \n\t\t\tHe won't survive. \n\t\t\t\t(all look at him) \n\t\t\tDo you know what sort of life awaits \n\t\t\tyou out there, Taylor? That of an animal. \n\t\t\tIf you aren't eventually hunted down and \n\t\t\tkilled by apes, some jungle beast will \n\t\t\tdevour you.\n\n\t\t\t\tTAYLOR \n\t\t\tThen there is another jungle?\n\n\t\t\t\tZAIUS \n\t\t\t\t(shrugs; then, \n\t\t\t\tsardonically) \n\t\t\tOf course, you could return with us. Our \n\t\t\tsociety might find a place for you and \n\t\t\tyour mate.\n\n\t\t\t\tTAYLOR\n\t\t\tSure.\tIn a cage.\n\n\t\t\t\tZAIUS \n\t\t\tWhere else, but in a cage, does man \n\t\t\tbelong?\n\n\t\t\t\tTAYLOR\n\t\t\tNo, thanks. I'll take freedom.\n\n\tTaylor mounts the horse, extends a helping hand to Nova, who vault's \n\tnimbly onto the horse's rump. Taylor looks at Zira and Cornelius.\n\n\t\t\t\tTAYLOR\n\t\t\tWould you like to come along?\n\n\t\t\t\tZIRA\n\t\t\tWe can't.\n\n\t\t\t\tTAYLOR\n\t\t\tIt's better than going to prison for \n\t\t\theresy.\n\n\t\t\t\tCORNELIUS\n\t\t\tThey can't convict us of that. You \n\t\t\tproved our innocence. Besides...\n\t\t\t\t(indicating Zaius)\n\t\t\t... his culture is our culture.\n\n\t\t\t\tTAYLOR \n\t\t\tGood luck then.\n\n\tHe reaches down, grasps Cornelius' hand, then grins crookedly.\n\n\t\t\t\tTAYLOR \n\t\t\tDr. Zira, I'd like to kiss you \n\t\t\tgood-bye.\n\n\t\t\t\tZIRA \n\t\t\tAll right, but.... \n\t\t\t\t(tears in her eyes) \n\t\t\t...you're so damned ugly!\n\n\tTaylor smiles, leans down, kisses her.\n\n\t\t\t\tZIRA \n\t\t\t\t(softly) \n\t\t\tGo with God, Taylor. \n\t\t\t\t(half smile) \n\t\t\tThat's an old expression. it comes \n\t\t\tfrom both ape and man.\n\n\t\t\t\tTAYLOR\n\t\t\tGod bless you.\n\n\tHe extends his hand to Lucius, who takes it.\n\n\t\t\t\tTAYLOR\n\t\t\tLucius.\n\n\t\t\t\tLUCIUS\n\t\t\tI think you're making a mistake.\n\n\t\t\t\tTAYLOR \n\t\t\tThat's the boy. Keep 'em flying.\n\n\t\t\t\tLUCIUS\n\t\t\tWhat?\n\n\t\t\t\tTAYLOR \n\t\t\tThe flags of discontent. It's the only \n\t\t\tway anything ever gets changed. \n\t\t\t\t(to Zaius) \n\t\t\tDon't try to follow us. \n\t\t\t\t(pats stock of \n\t\t\t\this rifle) \n\t\t\tI'm pretty handy with things like this.\n\n\t\t\t\tZAIUS \n\t\t\tOf that I'm sure. All my life I've \n\t\t\tawaited your coming and dreaded it. \n\t\t\tLike death itself.\n\n\tTaylor looks piercingly at Zaius, more troubled than offended.\n\n\t\t\t\tTAYLOR \n\t\t\tWhy? From the first, I've terrified you, \n\t\t\tDoctor. And in spite of every sign that \n\t\t\tI'm an intelligent being who means no \n\t\t\tharm, you continue to hate and fear me. \n\t\t\tWhy?\n\n\t\t\t\tZAIUS \n\t\t\t\t(calmly, \n\t\t\t\twithout rancor) \n\t\t\tBecause you are a man. And you were right \n\t\t\t-- I have always known about man. From the \n\t\t\tevidence, I believe his wisdom must walk \n\t\t\thand in hand with his idiocy. His emotions \n\t\t\tmust rule his brain. He must be a warlike \n\t\t\tanimal who gives battle to everything around \n\t\t\thim -- even himself.\n\n\t\t\t\tTAYLOR \n\t\t\tWhat evidence? No weapons were found in \n\t\t\tthe cave.\n\n\t\t\t\tZAIUS \n\t\t\tThe Forbidden Zone was once a paradise. \n\t\t\tYour breed made a desert of it, ages ago.\n\n\t\t\t\tTAYLOR \n\t\t\t\t(he waits, \n\t\t\t\tthen wearily) \n\t\t\tWe're back at the beginning. I still don't \n\t\t\tknow the why. A planet where apes evolved \n\t\t\tfrom men. A world turned wrong side up.  \n\t\t\tA puzzle with one piece missing.\n\n\t\t\t\tZAIUS \n\t\t\t\t(softly) \n\t\t\tDon't look for it, Taylor. You may not \n\t\t\tlike what you find.\n\nB-389\tWIDER ANGLE - TAYLOR AND THE GROUP\n\n\tTaylor shakes his head, still baffled, digs his heels into the horse's \n\tflank. It canters off along the sandy shore.\tZira, Cornelius and \n\tLucius sadly watch the departure.\n\n\t\t\t\tZAIUS \n\t\t\tUntie me!\n\n\tCornelius moves quickly to remove the rope from Zaius' neck. Behind \n\tthem, the five mounted gorillas gallop forward. Zaius gets up, waves \n\tthem to a halt.\n\n\t\t\t\tZAIUS \n\t\t\tNo, no! Let him go!\n\nC-389\tMOVING SHOT - TAYLOR AND NOVA ON HORSEBACK\n\n\tTaylor looks back, sees that Zaius has stopped the mounted apes, slows \n\this horse to a trot, smiles at Nova.\n\n390-\tOUT\n405\n\n406\tMED. SHOT - THE APES\n\n\tZaius watches as Taylor's horse moves farther away along the beach. \n\tThen he turns to an ape called MARCUS.\n\n\t\t\t\tZAIUS \n\t\t\t\t(quietly) \n\t\t\tFetch your explosives. We're going \n\t\t\tto seal the cave.\n\n\t\t\t\tMARCUS\n\t\t\tYes, sir.\n\n\tHe remounts his horse and rides o.s.\n\n\t\t\t\tCORNELIUS\n\t\t\t\t(aghast) \n\t\t\tSeal the cave?\n\n\t\t\t\tZAIUS\n\t\t\tThat's correct. And you will both stand \n\t\t\ttrial for heresy.\n\n\t\t\t\tZIRA\n\t\t\tBut the proof? The doll?\n\n\t\t\t\tZAIUS \n\t\t\tIn a few minutes there will be no doll. \n\t\t\tThere can't be. \n\t\t\t\t(honest regret) \n\t\t\tI'm sorry.\n\n\tCornelius throws himself at Zaius.\n\n\t\t\t\tCORNELIUS\n\t\t\tYou mustn't! You gave your 'word!\n\n\tZaius looks emptily at one of his apes.\n\n \t\t\t\tZAIUS\n\t\t\tWhat I do, I do with no pleasure. Silence \n\t\t\thim.\n\n\tA hairy hand is clapped over Cornelius' mouth. He is dragged off, \n\tstruggling, kicking. Julius, unafraid, glares at Zaius.\n\n\t\t\t\tLUCIUS \n\t\t\tDr. Zaius, this is inexcusable! Why must \n\t\t\tknowledge stand still? What about the \n\t\t\tfuture?\n\n\tZaius looks benevolently at Julius.\n\n\t\t\t\tZAIUS\n\t\t\tI may just have saved it for you.\n\n\tJulius and Zira look at each other, befuddled. Once more their eyes \n\tfollow the retreating figures of Taylor and Nova. The beach separating \n\tthe water from the canyon becomes narrower as they move downstream.\n\n\t\t\t\tLUCIUS\n\t\t\tWhat will he find out there, doctor?\n\nA-406\tCLOSEUP - ZAIUS\n\n\tHis face is A mask, his tone enigmatic.\n\n\t\t\t\tZAIUS\n\t\t\tHis destiny.\n\nB-406\tWIDER ANGLE - TIE APES P.O.V.\n\n\tA moment later, as they watch, Taylor and Nova vanish around the bend.\n\n407-\tOUT\n408\n\t\t\n409\tEXT. PALISADE AND BEACH - LONG HIGH ANGLE SHOT - DAY\n\n\tTaylor and Nova are already far downstream. There is a striking change \n\tin the terrain. The area is still desolate,but some vegetation can be\n \tseen on the palisade above the narrow beach, and the river has widened \n\tto form a vast tidal basin where it meets the sea.\n\n\tA NOTE ON PRODUCTION: If feasible at new location site, this scene \n\tshould be shot at high tide, so that the water laps at the base of the \n\tcliffs, making a passage difficult and risky.\n\n410\tCLOSER ANGLE - PANNING WITH TAYLOR AND NOVA ON HORSEBACK\n\n\tHe is alert, sniffing the salt air, sizing up the situation. Hearing \n\tthe CRIES of birds, he reins in and looks' up.\n\n411\tSKY SHOT - CIRCLING BIRDS\n\n\tSea gulls are soaring overhead.\n\n412\tTWO SHOT - TAYLOR AND NOVA ON HORSEBACK\n\n\tHis expression is expectant, searching. Nova emits a whimper of \n\tanticipation, pointing off.\n\n413\tLONG SHOT - WHAT THEY SEE:\n\n\tA verdant forest atop a distant palisade. Their view of the beach below\n\tthe forest, is cut off by a rocky promontory in the middle distance.\n\n414\tCLOSE SHOT - NOVA AND TAYLOR\n\n\tHe smiles at her hopefully.\n\n\t\t\t\tTAYLOR\n\t\t\tYes, Nova -- I see it.\n\t\t\t\t(looks again at\n\t\t\t\tforest)\n\t\t\tIn my old profession green meant\n\t\t\tsafe. Green meant go.\n\n\tThe horse moves off at a trot, CAMERA PANNING. But they have gone only \n\ta short distance when they hear the distant THUNDER of an EXPLOSION. \n\tTaylor reins in and looks back.\n\n415\tVERY LONG SHOT - A CLOUD OF SMOKE\n\n\tA column of smoke and dust rises from the exploded cave far upstream.\n\n416\tBACK TO TAYLOR AND NOVA\n\n\tFrowning with concern, Taylor gazes for a moment at the smoke, then \n\tdecides this is no time to linger. He digs his heels into the horse's\n\tflanks and they move off at a canter, riding toward the promontory that \n\tsplits the beach. They are nearing the promontory that blocks their \n\tview of the beach beyond.\n\n417-\tOUT\n418\n\n419\tCLOSER ANGLE - TRACKING WITH TAYLOR AND NOVA.\n\n\tAs they round the promontory, the tip of a strange rock formation comes \n\tinto view. it appears to be jutting from the sea.\n\n420\tREACTION SHOT - TAYLOR\n\n\tHe reins in momentarily, baffled by what he sees. Then he rides on.\n\n421\tTHE STRANGE FORMATION - AS SEEN BY TAYLOR\n\n\tAn immense column juts from the beach at a thirty-degree angle. We can \n\tnow see that it is not rock, but metal. Green metallic tints show \n\tthrough its gray salt-stained surface. As we draw closer, the object \n\ttakes on the appearance of a massive arm, its top shaped like a hand\n\tholding a torch.\n\n422\tREVERSE ANGLE - FAVORING TAYLOR\n\n\tFrowning with consternation. His horse proceeds at a slow walk.\n\n423\tTRACKING WITH TAYLOR - WHAT HE SEES:\n\n\tNear the base of the column, where the shore and water meet, are a row \n\tof metal spikes. From this angle they look like tank traps.\n\nA-423\tCLOSER - TAYLOR\n\n\tDumbfounded, he slides from his saddle, approaches the  spikes. Nova \n\tdismounts and follows him.\n\n\t\t\t\tTAYLOR\n\t\t\t\t(a cry of agony)\n\t\t\tMy God!\n\n\tHe falls to his knees, buries his head in his hands. CAMERA SLOWLY \n\tDRAWS BACK AND UP to a HIGH ANGLE SHOT disclosing what Taylor has \n\tfound. Half-buried in the sand and washed by the waves is the Statue of \n\tLiberty.\n\n424-\tOUT\n451\n\n\t\t\t\t\t\t\t\t\tFADE OUT\n\n\n\n\t\t\t\tTHE END\n\n\n\n\n\nback\n\n\n\n\n\n\n\n\nPlanet of the Apes, The\nWriters :   Michael Wilson\nGenres :   Action  Drama  Sci-Fi\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:33:03.908622"}