{"title": "Point Break", "film_link": "/Movie Scripts/Point Break Script.html", "script_link": "/scripts/Point-Break.html", "info_raw": "\n\nPoint Break Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  W. Peter Iliff  Rick King  Kathryn Bigelow\nGenres  Action  Crime  Adventure  Thriller  Drama\nScript Date :  1991\n\nRead \"Point Break\" Script\n\n\n", "script": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                        POINT BREAK\n\n\n\n\n\n\n\n\n                             by\n\n                       James Cameron\n\n                             &\n\n                      Kathryn Bigelow\n\n\n\n\n\n\n\n\n                   From the Screenplay by\n\n                       W. Peter Iliff\n\n\n\n\n\n\n\n\n\n\nFADE IN:\n\nWe are in the belly of a wave.\nLight refracts in a constant collision of water.\nSLOW MOTION, the hallucinatory prisms, like liquid\ndiamonds taking flight, dreamlike...\n\n\nEXT.  OCEAN - DUSK\n\nBacklit against a flaming sun a solitary SURFER glides\nacross the green glassy peak.  TIME IS STRETCHED until his\nmovements gain a grace and fluidity not of this world.\nTotal Zen concentration.  Body weight centered, eyes\nforward and on the next section.\n\n\nEXT.  URBAN STREET - DUSK\n\nSLOW MOTION ON a black sedan.\nCreeping along store fronts.  Past a Winchell's.\nPEOPLE splash steps down rain-washed sidewalks in DREAM\nMOTION.  The sedan turns past the FIRST VIRGINIA BANK and\ninto an alley.\n\n\nINT.  BLACK SEDAN\n\nTWO MEN and ONE WOMAN in SUSPENDED TIME put on overcoats\nand hats.  Under their hats strips of Scotch tape stretch\ntaut from the base of their nose to their forehead,\nhideously distorting their features.  Makes them look like\nhuman PIGS.\n\n\nEXT.  OCEAN\n\nSILVERY in this light, almost metallic, as if from some\nfuture-scape.  The lone surfer SHREDS a long, endless\nright wall.\nACCELERATING INTO REAL TIME -- as he stares into the pit,\ndigs in, drops into the sweet spot on the wave, hunkers\ndown.\nHis moves becoming aggressive, frenzied--\n\n\nINT.  BLACK SEDAN\n\nAn M-16 clip is SMACKED into place and cocked with a\nCACHACK!  Ammo clips are SNICK-SNICKED into handgun butts\nand a long clip is SSSNICKED into an UZI.\nWatches are checked.  The PIG NOSE people nod to each\nother.\n\n\nEXT.  BANK\n\nPig Nose #1, steals into position near the glass doors,\nslams his back to the wall, weapon to cheek, breath fast.\n\n\nEXT.  OCEAN\n\nFAST NOW -- the surfboard rips a brutal gash in the face\nof the wave.  The surfer TRIMS down the line, pivoting the\nboard and going straight down, CARVING the bottom.  He\nslashes viciously back toward the lip and--\n\nIn a radical INVERTED AIR ATTACK sails SIX feet above the\nwave in an explosion of water--\n\n\nINT.  BANK\n\n--BAAAAAAMMM!\nGlass doors explode OPEN and Pig Nose #1 SPINS inside.  He\nfires a burst into the ceiling.  BRRAAMM!!\n\n                         PIG NOSE #1\n          EVERYBODY on the floor!\n\nPEOPLE drop.\nVERY FAST HERE--\nTwo bandits handle BANK EMPLOYEES and customers--\nAnother PIG NOSE watches the door--\nPig Nose #1 moves behind counter, Uzi and canvas sack in\nhand.\n\n\nINT.  SURVEILLANCE VAN\n\nDark. Monitors SHOW SLOW SCANS of the bank INTERIOR.\nTwo MEN wear headphones and black windbreakers with FBI\nstenciled on the back.  One watches with binoculars.\n\n                         BINOCULARS\n          Bingo.  We're on.  Let's go.\n          Where's the big college\n          quarterback?!  Are you with us,\n          Utah?\n\n\nEXT.  BANK WALL\n\nA MAN in his twenties.  His head spins revealing rain-\nslicked hair and face, eyes wide, bright.  An edgy\nhandsomeness to him.\nHe pops a stick of Wrigley's in his mouth, rests a shotgun\non one leg and leans against the wall.  He wears a\nheadset... through which we hear the FBI guy yelling for\nhim.\nThis is JOHNNY UTAH.\n\n                         BINOCULARS (FILTERED)\n          Utah, where the hell are ya!?\n\nUtah takes his headset off...\n\n\nINT.  BANK\n\nPig Nose #1 LEAPS over the counter, holds a canvas sack\nfilled with booty from tellers' drawers.\n\n                         PIG NOSE #1\n          Fuckin' shake it!\n\nPig Nose #2 nods with his snubby nose, hurries toward the\nexit.\n\n\nEXT.  FIRST VIRGINIA BANK\n\nThe bandits burst through the doors and sprint to the\nalley where they jump into the SEDAN.  THE DRIVER, the\nWOMAN PIG NOSE, punches it and the TIRES WHIRRR on the\nslick pavement.\nThe sedan launches down the alley.\n\nUtah running.  Like a freight train.  Splashing through a\ncross-alley.  He doesn't break stride as he slams his\nshoulder into a large, steel GARBAGE DUMPSTER.\nDRIVING it like a football training sled into the ALLEY\nwhere--\n\nTHE SEDAN LOCKS 'EM UP seconds too late as it SKIDS and\nSLAMS into it, CRUNCHING into the brick wall and--\nStill alive -- GRINDS into reverse back down the alley,\nHEADLIGHTS SMASHED, it guns it backward as--\n\nUTAH leaps over the dumpster and sprints after the car.\nHe has a brick in his right hand.  He cocks it back.\nJohnny HEAVES the brick thirty yards and--\n\nSMASH!  The brick EXPLODES into the windshield,\nSPIDERWEBBING the glass.\nLady Pignose flinches from the glass fragments thrown into\nher face.\n\n                         LADY PIGNOSE\n          Son of a bitch!\n\nThe car slews backward onto the street, slamming a parked\ncar.  Lady Pignose slams the thing into DRIVE, cuts the\nwheel hard, and punches it, skidding on wet pavement.\n\nUTAH hurtles from the alley.  He leaps, somehow TACKLES\nthe DRIVER'S door handle and is dragged along the street.\nHe pulls himself up, reaches inside the window, and whips\nthe steering wheel hard right.\n\nThe SEDAN fishtails into a parked Toyota.  Utah bounces\nforward, slamming into the asphalt.  Glass shards and\ncrushed steel are strewn everywhere, as radiator steam\nwhistles hot.\n\nPig Nose #2, riding shotgun, is trapped.  Can't get his\ncrushed door open.  The DRIVER pushes open her door.\nGropes for her pistol.  Utah springs -- no respect for a\nlady.  He slams the door, pins her arm and slams again and\nagain until the gun drops.  Utah kicks it away as the\nwoman collapses in pain.\n\nPig Nose #1 bails out and runs across parking lot.  Utah\nleaps up onto the crushed hood and draws down with the\nshotgun.\n\n                         UTAH\n          Halt.  FBI!\n\nPig Nose #1 spins.  We sense reckless anger.  He raises\nthe UZI.  Utah squeezes the trigger.\n\nNo death.  No blood.\nJust buzzers and flashing bulbs.\nPig Nose's flak vest lights up like a pinball machine.\nUtah's laser weapon hit the \"kill zone\".  Pig Nose rips\nthe tape off his face and the FBI CADET shakes his head in\ndisgust.\n\nOBSERVERS step forward.  Bank customers.  Bank tellers.\nAll FBI personnel.  MEDICAL STAFF offer the woman driver\nassistance.  Pig Nose #1 heads for Johnny, but is subdued\nby other agents.\n\n                         PIG NOSE #1 (FBI CADET)\n          I wanna say just two words to you,\n          asshole, SIMU-LATION!!!  Johnny-\n          fuckin' Utah.  Guys like you will do\n          anything to win!\n\nUtah stares back in defiance.\nThe SURVEILLANCE van pulls up nearby.\nBINOCULARS runs out and pinches two fingers together,\nright in Johnny's face.\n\n                         BINOCULARS\n          This far, Utah!  You're this far\n          from being the most overqualified\n          guy Burger King ever had.  Get me?!\n\n                         UTAH\n          Yes sir.  Sir?\n\n                         BINOCULARS\n          What?\n\nJohnny gestures to the car.\n\n                         UTAH\n          I did stop the perpetrators.\n\nUtah turns to go.  As he passes he casually raises his\nlaser-shotgun and re-triggers Pig Nose's flak vest.\nLIGHTS AND BUZZERS.\nPig Nose explodes.  More agents restrain him.\nScreams and shoving matches and pissed off guys.\nUtah walks off, down the simulated street, past a sign\nwhich bears the FBI SEAL and reads \"Combat Village,\nQuantico, Virginia.\"\n\n                                            DISSOLVE TO:\n\nEXT.  PACIFIC OCEAN - DAY\n\nRed sky.  A luminous Pacific.  Five foot faces.  Nice\ncurl.  A lineup of SURFERS wait outside the break.\nSilhouetted, bobbing like a pack of sea mammals.\n\n\nINT./ EXT.  TAXI\n\nA flood of orange through the windshield as the cab crawls\ndown Ocean Park to the sea.  CAMERA HANDHELD from the back\nseat.\nThe driver turns to us.\n\n                         DRIVER\n          Anywhere?  You don't care?\n\n                         UTAH (V.O.)\n          Anywhere.  I've just never seen the\n          ocean before.\n\n                                            CUT TO:\n\nEXT.  VENICE BEACH\n\nJOHNNY UTAH trudging across the sand, holding his shoes.\nGarment bag and a big duffel over his shoulder.\nHe looks silly in his dark suit, tie loosened, wearing a\nturned around baseball cap.\nHe wiggles his toes in the sand, looks around like a kid.\nA pack of BOUNCING BEAUTIES jog through frame.\nUtah grins, reaches up and turns his cap around.\nIt reads \"I Love L.A.\"\n\n                                            CUT TO:\n\nEXT.  FEDERAL BUILDING\n\nLooking down the face of the concrete monolith at Wilshire\nand Veteran.  Ant-like, Johnny Utah's tiny figure moves\ntoward the entrance.\n\n                         VOICE (OVER)\n          Day One in LA, special agent Utah.\n          You may have been top two percent of\n          your class at Quantico but you have\n          exactly zero hours in the field\n          here.  You know nothing...\n\n\nINT.  FEDERAL BUILDING - FBI BULLPEN\n\nSupervising Agent BEN HARP leads Utah across the bullpen.\nRows of desks.  Agents sitting at computer terminals.\nData hell.  Looks like he got a job at Xerox.\n\n                         HARP\n          You know less than nothing.  If you\n          even knew that you knew nothing, at\n          least that would be something, but\n          you don't.\n\n                         UTAH\n          Yes, sir.\n\nUtah is wearing a suit, carrying a briefcase.  Harp is\nmid-thirties, confident of stride, tanned of skin, perfect\nof hair.  GQ.  Aggressive.\n\n                         HARP\n          Eating solid breakfasts, Utah?\n\n                         UTAH\n          Sir?\n\n                         HARP\n          All the food groups?  Avoiding\n          sugar?  Caffeine?  I see to it that\n          my people maintain cardiovascular\n          fitness.  We stay off hard liquor,\n          cigarettes...\n\n                         UTAH\n                  (poker face)\n          I take the skin off chicken.\n\nHarp glances at him, eyes narrowing.  They reach a\nglassed-in compound of small offices.  Harp swings the\ndoor open and the other agents look up as Utah enters.\n\n                         HARP\n          This is us.  Bank Robbery.  And\n          you're in the bank-robbery capital\n          of the world--\n\n                         UTAH\n          1322 last year in LA county.  Up 26\n          percent from the year before.\n\n                         HARP\n          That's right.  And we nailed over a\n          thousand of them.  We did it by\n          crunching data.  Good crime-scene\n          work, good lab work, good data-base\n          analysis.  Nobody had to tackle a\n          car once.  You getting the signal,\n          special agent?\n\n                         UTAH\n          Zero distortion, sir.\n\nHe picks up a donut from someone's desk, a succulent\nglazed jelly.\n\n                         UTAH\n          I love these things.\n\nHe looks right at Harp.  Takes a big fuck-you bite.\n\n                         HARP\n          You're a real blue-flame special,\n          aren't you, Utah?  I don't know why\n          they sent you to LA.  Must be an\n          asshole shortage.\n\n                         UTAH\n          Not so far.\n\n                                            CUT TO:\n\nUNDERWATER\n\nA blue field with a pulsing network of rippling lines.\nVOOM!  A figure rockets down INTO FRAME in a curtain of\nbubbles.  A gawky AGENT, in less than stylish FBI trunks,\nflails around blindfolded looking for bricks at the bottom\nof a pool.\n\n\nINT.  GYMNASIUM POOL - DAY\n\nThe pool casts wavy distortions upon TWO DOZEN MEN, all\ngrumbling as they stand in line, wearing T-shirts with FBI\nlogos, sweats and sneakers.  We hear a splash, and the men\nshuffle forward.\n\n                         PAPPAS (V.O.)\n          The dolls love this baby.  It brings\n          them luck when they rub it -- right\n          between their buttons.\n\nCLOSE ON tape measure wrapped around a generous belly.\nPULL BACK to reveal VETERAN AGENT COREY measuring the\nample waist of ANGELO PAPPAS.  This 54 year old silver\nhaired Greek stands rubbing his belly like a Zulu chief.\n\n                         COREY\n          Angelo, we need a bigger tape.\n\n                         PAPPAS\n          Just read the goddamn number.\n\n                         COREY\n          Still a 46.  Maybe we can cinch it\n          down, wear a girdle--\n\n                         PAPPAS\n          Screw you and this holistic fitness\n          crap!  At least my arms don't flap\n          in the wind.\n\nCorey secretly squeezes his bicep as...\nA whistle blows.  A broad shouldered MAN wearing an FBI\ncap barks at the Greek.\n\n                         BIG SHOULDERS\n          Okay, Pappas, let's put on the\n          blindfold.  Wanna see you retrieve\n          at least two bricks from the bottom.\n\nJOHNNY UTAH enters the pool area in the distance.  Says\nsomething to one of the agents.  Is pointed toward us as--\nCorey ties the blindfold and guides Pappas to the edge of\nthe pool.\n\n                         PAPPAS\n          I've been in the field 33 years,\n          fired my piece 23 times in the line\n          of duty, and I got no idea what a\n          blind man fetching bricks has gotta\n          do with being a Special Agent!\n\nJohnny has walked up.  Pappas, blindfolded, turns directly\nto Utah as he continues, thinking it's Corey.\n\n                         PAPPAS\n          Added to which indignity, I got\n          three months left to retirement and\n          they saddle me with some blue-flamer\n          fresh out of Quantico for a partner.\n          Some quarterback punk, Johnny Unitas\n          or something.\n\n                         UTAH\n          The shit they pull, huh?\n\nPappas snorts agreement and cannonballs into the pool.\nHuge backblast of water.  The other agents hoot and\nholler.\nCorey swears and wipes off his clipboard.\nJohnny steps to the edge, looks down.\nWe see the blindfolded Pappas groveling along the bottom.\nThe other agents cheer as Pappas heads for the surface.\n\n                         COREY\n          Here he comes.  Hold up a fish,\n          he'll take it right outta your hand.\n\nPappas surfaces in an explosion of spray as he sputters\nfor breath.  He grabs the edge and angrily slaps two\nbricks on the tiles.  He rips off the blindfold looks up\nand frowns.\n\nA HAND ENTERS FRAME to help him up.  Pappas takes it and\nJohnny hauls him on deck.\n\n                         COREY\n          Hey Shamu, this is your guy.\n\nPappas eyes the new agent warily.  Extends his hand.\n\n                         PAPPAS\n          Pappas.  Angelo Pappas.\n\n                         UTAH\n          Punk.  Quarterback Punk.\n\n                         PAPPAS\n                  (grinning)\n          Welcome to Sea World, kid.\n\n\nINT.  SEDAN - DAY\n\nSERIES OF TIGHT SHOTS\nECU sweep hand of a dive watch clicks through the\nseconds.\nMagnum shells are fed into a pump shotgun.\nVelcro straps of Second Chance body armor are fastened.\nWhite gloves are pulled snug over strong hands.\nA silk tie is straightened.  A shotgun slide is cocked.\nThe sweep hand approaches the twelve.\nA LATEX MASK is pulled over the back of a man's head.\n\n                         VOICE\n          The little hand says...\n\nThe mask turns into FULL CLOSE-UP.  It is RONALD REAGAN.\n\n                         REAGAN\n          ... let's rock and roll.\n\n\nINT.  BANK OF AMERICA\n\nBusiness as usual.  The scene so normal you know something\nis about to happen.  An exiting MAN stuffs bucks into his\nwallet, reaching for the door which--\nSLAMS INWARD.  He is hit by a wall of EX-PRESIDENTS.\n\nREAGAN charges in with his buddies RICHARD M. NIXON,\nLYNDON BAINES JOHNSON and JOHN F. KENNEDY.\nReagan throws the poor guy skidding across the floor.\nNixon buttstrokes a guard, hard in the nuts, with his 12\ngauge.\nThe other guard goes for his holster -- finds himself\nfacing three shotguns and one very large handgun.\nReagan sights down the pistol.\n\n                         REAGAN\n          Use a gun, go to heaven.\n\nThe guard freezes.  White and sweaty.\nTricky Dick slips up to him and collects the pistol.\nKennedy covers the stunned customers.\nJohnson backs up against the door jam, watching the\nstreet, and the sedan idling at the curb.\n\n                         REAGAN\n          EVERYBODY FREEZE!!  That's right.\n          ALL TELLERS step back from the\n          counter!  Hands on heads!  MOVE!!\n\nNixon and Reagan move quickly to the counter as the\ntellers comply.\n\n                         REAGAN\n          Everybody else on the floor!  Do it!\n          On the floor, let's go.\n\n                         NIXON\n          SUCK LINOLEUM, BITCH!!  You got\n          earwax?!\n\nNixon grabs a stunned woman by the arm and hurls her to\nthe floor.\nShe lands hard.  Everyone is on the deck by now.\nThe Presidents move fast.\nReagan leaps onto the counter.  Stands up where he can see\nall.\nNixon hurdles to tellers' side and they start moving down\nthe line together.  Reagan controlling the room as Nixon\nquickly empties the tellers' cash drawers into the sack.\nHis hands move like lightning.\n\n                         REAGAN\n          Just stay cool.  Everybody stay\n          cool.  Heads down.  Eyes down.  The\n          money's insured--\n\nTIGHT ON -- MONEY flying into the sack.\n\n                         REAGAN\n          -- it's not worth dying for.\n          Another 45 seconds of your time.\n          That's all.  Then -- Whoa, Tricky\n          Dick!\n\nNixon pulls a pack of twenties back out of the bag and\ntosses it to the BANK MANAGER.  Who reflexively catches\nit.\nThen drops it like a hot-potato just before--\nIt EXPLODES into a cloud of blue ink.  The manager is dyed\nblue.\nBurnt money showers on the terrified customers.\n\nLBJ looks at his watch and WHISTLES.\nThe bandits sprint for the front doors.\nKennedy exits first, followed by Reagan.\nLBJ pauses under the surveillance camera, drops his\ntrousers and MOONS.  Thank you is written across his white\nbutt.\n\nBLACK AND WHITE VIDEO MONITOR--\n\nHigh angle, distorted wide shot.  LBJ hoists his pants and\nsplits, followed out by Nixon, who exits backward with the\nfamous double peace-sign held high overhead.\n\nIMAGE FREEZES.  Victorious Nixon, grainy... something from\na time warp.  The image SUDDENLY GOES INTO HIGH-SPEED\nREVERSE.  The bank robbery sequence zips backward.\n\n                         PAPPAS (V.O.)\n          Twenty-seven banks in three years.\n          In and out in 90 seconds.  Nobody\n          ever gets shot.  We're talking solid\n          professionals.\n\nWE ARE IN--\n\n\nINT.  BANK CRIME SCENE - LATER\n\nUTAH & PAPPAS are watching a monitor in the glassed-in\noffice.  The robbery REPLAYS on grainy BLACK & WHITE\nvideotape.\nThe bandits barge in, raise shotguns and order everybody\nto the floor.\n\n                         UTAH\n          Good move.\n\n                         PAPPAS\n          Yeah, they control the room well.\n          Stick strictly to the cash drawers.\n\nVIDEO TAPE -- Utah is reverse-scanning.  The bandits walk\nBACKWARD into the bank.  The explosion of blue ink is\nsucked back into the pack of money, then leaps back into\nPresident Nixon's hand.\n\n                         UTAH\n          They don't go for the vault?\n\n                         PAPPAS\n          Never go for the vault.  They never\n          get greedy.\n\n                         UTAH\n          Smart.  You burn time in the vault.\n\n                         PAPPAS\n          Reagan usually drives.  Stolen\n          switch car, they leave it running at\n          the curb, looks parked from a\n          distance.  When they run, they dump\n          the vehicle and vanish.  And I mean\n          vanish.\n\nUtah stops the video, now FAST-FORWARDING it, stopping\nwhere President Nixon separates the exploding \"dye pack\"\nplanted with the money, before he tosses it aside.\n\n                         UTAH\n          Surgical.  Look at them separate the\n          dye packs.  Dick and Ronny know\n          their jobs.\n\n                         PAPPAS\n          The Ex-Presidents are the best I've\n          seen, kid.\n\nOutside the windowed partition POLICE OFFICERS interview\nfrightened customers.\nHotshot agents MUNOZ and COLE enter from the main floor of\nthe bank.  Think they're very slick.\n\n                         MUNOZ\n          Anytime you two are finished jerking\n          off watching MTV I need to get a\n          look at that tape.\n\n                         COLE\n                  (sloppy grin)\n          Hey, Pappas, you tell the kid your\n          theory on the Presidents?\n\n                         PAPPAS\n          Just take the tape, Cole.\n\nNow Munoz starts to smile.\n\n                         MUNOZ\n          Hang ten, Pappas, like totally\n          rad...\n                  (to Utah)\n          I gotta tell ya, the department\n          loves it.\n\n                         UTAH\n          What's he talking about, Angelo?\n\nHarp raps glass.  Cole and Munoz look sharp.\nHarp enters addressing Pappas and Utah.\n\n                         HARP\n          They found the drop car up on\n          Mulholland.  I want you two to go\n          work it.\n\n                         PAPPAS\n          What?  Now I'm working the drop car?\n          Who's handling the scene here?\n\n                         HARP\n          Cole and Munoz.  I'm uh... letting\n          them run with the ball for a while.\n\nCole and Munoz gloat.\n\n                         PAPPAS\n          Cole and Munoz?  I been on this case\n          for two years.\n\n                         HARP\n                  (zeroing in on\n                   Pappas)\n          That's the point, isn't it?\n\n                         PAPPAS\n          Yeah, I get it.  Time to play let's\n          dick the old guys, huh, Harp?\n\n                         HARP\n          Supervising Special Agent, Harp.\n          Now I want you to go work the drop\n          car, okay, Angelo?  Okay?\n\nThe Greek rises like a proud bull.\n\n                         PAPPAS\n          Sure.  No problem.  How about your\n          office?  Your office need vacuuming?\n          We could do that too.\n\nPappas and Utah move toward the door.  It's a tight\nsqueeze as they pass Cole and Munoz.  Especially Pappas.\n\n                         PAPPAS\n          Excuse me.\n\nRead as fuck you.\n\n\nEXT.  MULHOLLAND SCENIC TURNOUT - NIGHT\n\nThe diamond field of LA glitters below.  The small parking\narea off Mulholland is filled with squad cars.  Red and\nblue disco.\nA flock of UNIFORMS milling about a non-descript CHEVY.\n\n\nINT.  SEDAN FRONT SEAT\n\nFLASHLIGHT BEAM prowls the interior, stopping on a small\nprinted card, folded like a pup tent, left upon the bench\nseat.  It reads \"Sanitized For Your Protection.\"\n\n                         PAPPAS\n          Cute huh?  They love to fuck with\n          us.\n\nUTAH & PAPPAS pull their heads out of the sedan.  Forensic\nexpert, HALSEY, stands behind them.\n\n                         PAPPAS\n          Don't tell me, let me guess.  The\n          switch-car was stolen this morning...\n                  (Halsey is nodding\n                   his head)\n          They vacuumed and 409'd the\n          interior, did the windows, emptied\n          the ashtrays...\n\n                         HALSEY\n          Yeah, the usual drill.\n\nUtah pulls on a rubber glove and lifts the card off the\nseat.  Studies it.  Talks to Halsey like Halsey's the one\nthat just out of Quantico, not Utah.\n\n                         UTAH\n          Could've taken their gloves off\n          before setting that card.  Laser it\n          for prints.  Maybe held it to his\n          teeth -- check the edges for saliva.\n                  (a beat)\n          Today was a scorcher.  This Chevy\n          doesn't have air conditioning...\n\n                         HALSEY\n          Sweat secretions in the seatbacks?\n\n                         PAPPAS\n          You through, Mr. Wizard?  Let me\n          know if you find Jimmy Hoffa under\n          the seat while you're at it.\n                  (looks at his watch)\n          Hell, it's only 7:30.  The night's\n          still young... you can solve this\n          case and start on another one.\n\n                         UTAH\n          Well, what're your ideas on these\n          guys?\n\n                         PAPPAS\n          Forget about it, kid.  They're\n          ghosts.  Let the goddamn yuppie\n          Mormon affirmative action assholes\n          handle it.  See I'm almost 55... so\n          I must be senile, right?  They\n          better get me out before I start\n          pissing myself in public.  Drooling.\n          It would look bad for the Bureau,\n          right?\n\n                         UTAH\n          So you're gonna coast to retirement,\n          when you could nail these guys and\n          go out with come dignity.\n\n                         PAPPAS\n          You watch your fucking mouth!\n                  (pounds his chest)\n          Mr. Hoover himself pinned the Seal\n          of Honor right here!\n\nThe two men glare at each other.  Utah looks away.\n\n                         UTAH\n          Sorry.\n\n                         PAPPAS\n          Yeah.  That was thirty years ago\n          anyway.\n                  (stares out at the\n                   bright horizon)\n          L.A.'s changed a lot since then.\n          The air got dirty and the sex got\n          clean.\n                  (after a beat)\n          So you want to nail the Ex-\n          Presidents?  Be a big hero?\n\n                         UTAH\n          Yeah.  What's your theory?\n\n                         PAPPAS\n          The fucking punks are surfers.\n\n                                            CUT TO:\n\nGRAINY BLACK & WHITE VIDEO WITH TIME CODE\n\nEx-Presidents charge into bank, raise shotguns.\nImage STOPS, then FAST-FORWARDS to the end.\nWE ARE IN--\n\n\nINT.  FEDERAL BUILDING - BULLPEN - NIGHT\n\nDark, lit by the TV at the far end of the bullpen.  PAPPAS\nand UTAH sit in front of the flickering Sony in the big\nempty room.  Angelo punches a button on the VCR.\n\nON THE SCREEN--\n\nLBJ turns his back to the fish-eye lens, drops trousers\nand moons the camera.  Thank you.\nAngelo FREEZES on LBJ'S butt.\n\n                         PAPPAS\n          I'm tellin' ya, kid, it's in our\n          face.  Lookit the tan on this guy.\n\nThe young agent looks forward.\nStares at the white inscribed butt bracketed by deep\nbronze tan lines.\n\n                         UTAH\n          Oh well he must be a surfer.\n\n                         PAPPAS\n          Shutup, you might learn somethin'\n          you're not careful... So last year\n          Nixon scuffs a counter going over.\n          There was a soil sample.  Non-\n          specific mud traces of asphalt,\n          oils, blah, blah... sand and...\n          carnuba wax.  So I became a wax\n          expert.  There's 80 some uses for\n          this stuff, something like five\n          hundred products.\n\nHe tosses Utah a ream of computer printout.  Utah scans\nlists of brand names.\n\n                         UTAH\n          Candle wax.  Car wax.  Mustache wax?\n          Could be anything.  Guy's waxing his\n          mustache at the beach.  Gets sand in\n          it.  Wipes it off with a shoe.  Shoe\n          scuffs the counter.\n\n                         PAPPAS\n          The lab made three possible matches,\n          this was one of 'em.\n\nPappas opens his desk drawer, takes something out and\nthrows it to Johnny.  A pastel blue hockey puck wrapped in\ncellophane.\nA block of \"Mr. Zog's Sex Wax\".\n\n                         UTAH\n                  (reading)\n          Sex wax?  You're not into kinky\n          shit, are you Angelo?\n\n                         PAPPAS\n          Surfers use it on their boards.\n          They rub sand into it for traction.\n\n                         UTAH\n          Thanks for the tip.  I needed this\n          knowledge.\n\nPappas shoves a thick file folder toward Utah.\n\n                         PAPPAS\n          Now lookit the dates on the\n          robberies.  This is strictly a\n          summer job for these guys.\n\nJohnny leafs through it.\n\n                         UTAH\n          ... Four months.  June to October.\n          Mmmm...same the year before.\n\n                         PAPPAS\n          Another month and we don't see 'em\n          again 'til next summer.\n\nUtah stares at Angelo as it dawns.  Grins suddenly.\n\n                         UTAH\n          They're traveling the rest of the\n          year on the money, going where the\n          waves are...\n\nPappas starts to smile.  Suddenly, he jumps up onto his\ndesk, gets down in a speed-crouch, arms extended.\n\n                         PAPPAS\n                  (to one and all)\n          The Ex-Presidents rip off banks to\n          finance their endless summer!\n\nJohnny watches, grinning.  The night security GUARD walks\nin.  Utah turns to the guard, shrugs.\n\n                         UTAH\n          I think he needs a vacation.\n\nThe guard nods understanding.\n\n                                            CUT TO:\n\nINT.  SURFSHOP - MALIBU PIER - DAY\n\nLong stack-up rack of gleaming SURFBOARDS.\nA HAND reaches in, pulling out a board from the middle of\nthe deck.\n\nJOHNNY UTAH hefts it.  Sights along it.  Trying to look\nfamiliar with alien equipment.  Behind him is a whip-thin\n15 YEAR OLD SALESMAN.  Nut-brown with platinum hair,\njammed day-glo shorts, sleeveless T-shirt, unlaced Ug-\nboots.\n\n                         15\n          Highest performance, very kind.  If\n          you want to get aggro, man, this\n          stick can handle your best rage.\n          Where you surf?\n\n                         UTAH\n          I don't.\n\n                         15\n          Whoa!!  Back up!  This's a 5'6\" tri-\n          fin squash-tail thruster.  You'd eat\n          major shit on this, dude.\n\nACROSS THE ROOM we see Pappas trying on purple wraparound\nsunglasses.\n\nThe salespunk pulls down a wide board with a garish\nfirebird paint scheme.  Like a lowrider flame-job.  The\nlogo reads \"Dance with the Universe.\"\n\n                         15\n          Here, you need a rhino chaser like\n          this one to learn on.  Good board.\n          I mean for a pig board.\n\nUtah hefts the board.  Scowls.  Hates anything he's not\ngreat at.\n\nPAPPAS sets his purchases on a counter: the glasses, some\nplutonium-pink shorts, T-shirts, sun-block.  The GIRL\nbehind the counter is sixteen, barely contained in a\nmacrame bikini-top and \"Dolphin\" shorts.  Angelo picks up\na package of Sex Wax from a rack.  Sniffs it.\n\n                         PAPPAS\n                  (reading the label)\n          \"Best for your stick\", huh?  This\n          might not be enough.  I better get\n          two.\n\nThe girl stifles a grin.  Thinks he's cute.  At the other\nend of the counter, 15 is ringing up Utah's board.\n\n                         15\n          Hey, man, guys your age learning to\n          surf, it's cool, there's nothing\n          wrong with it.\n\n                         UTAH\n          I'm twenty-five.\n\n                         15\n          See that's what I'm saying, it's\n          never too late.\n\nUtah picks up the board and moves to leave.\n\n                         15\n          Hope you stay with it.  Surfin's\n          the source.  It'll change your life.\n          Swear to God.\n\n\nEXT.  MALIBU PIER - DAY\n\nUtah and Pappas walking back to the car.\nTwo FBI agents in suits and ties walking with a day-glo\norange surfboard.  Surreal image.  The ocean shimmers in\nB.G.\n\n                         PAPPAS\n          Johnny, it's the only way.\n\n                         UTAH\n          Why can't I just walk around with\n          this thing under my arm and act\n          stoned?  Ask a few questions.\n\nAngelo stops at the railing, points toward the ocean.\n\n                         PAPPAS\n          Look.  Look at them out there.\n\nLONG LENS on packs of surfers sitting outside.  Bobbing\nslowly.  Hunched like sea birds.  Waiting for an unseen\nsign.  Disappearing and reappearing beyond the break.\n\n                         PAPPAS\n          They're like some kind of tribe.\n          Got their own language.  You can't\n          just walk up to these guys.  You've\n          got to get out there.  Learn some\n          moves.  Get into their head.  Pick\n          up the speech.\n\n                         UTAH\n          Angelo, this stuff is for little\n          rubber people who don't shave yet.\n\n                         PAPPAS\n          It's all balance, right?  And\n          coordination.  How hard can it be?\n\n                                            CUT TO:\n\nEXT.  SURFRIDER BEACH - DAY\n\nWHAAAAAM!  Johnny is CLOBBERED by a wave.\nHe's flipped off his board and hits the water face-first\nas the wave crashes over him.  Other surfers steer clear.\n\nPAPPAS lounges in a beach chair in his plutonium pink\nshorts, purple Vuarnet's and a T-shirt emblazoned with\n\"Surf This\" across the chest.  A picnic basket sits close\nat hand.  He winces at Utah's wipeout.  Shouts from his\nbeach chair.\n\n                         PAPPAS\n          I think you gotta hit them straight\n          on!\n\n                         UTAH\n                  (out of breath)\n          Got it...\n\nUTAH holds the tip steady, gouges the face of a wave and\nsquirts out the other side.  Another wave rises and Utah\nglides up over the hump.  He clears the swell and the\nocean suddenly smooths out like a giant lake.  Triumphant\nover having made the lineup, he sits up on the board, and\nfalls over.\n\nPAPPAS slices a green apple, some feta cheese and eats off\nthe knife.\n\nUTAH climbs back on his board.  WHISTLES and HOOTS sound\nas SURFERS spot a new swell.  Utah watches as the regulars\nstart catching rides.  Suddenly he feels like a lost dog\non a busy freeway.\nA young LOCAL in a neon wetsuit slashes past him, inches\naway.\n\n                         LOCAL\n          Outta the way, you dick!\n\nAnother, shredding viciously, is blasting toward him.\n\n                         LOCAL 2\n          Move it, kook!\n\nJohnny paddles rapidly, ducks under.\nSees another, bigger wave coming.\nPissed off... at himself, at the downy-cheeked hotshots,\nat the frustration, he turns his board around and starts\npaddling hard.\nHe somehow gets the soles of his feet in contact with the\ntop of the board, then struggles up.  He's standing --\nsort of.\nArms pinwheeling, he topples in a nasty crash...\nRight in front of a SHAVED-HEAD SURFER on full\nafterburner.\n\nJohnny vanishes in an explosion of spray.  His board\nSHOOTS OUT.\nIt SMASHES SIDEWAYS INTO RAZORHEAD.\nThe guy does an ugly endo.\nUtah comes up GASPING for air, arms flailing.\nHis board, floating a few feet away, tugging at his ankle.\nHe drapes his torso across the board and pants for breath.\nRazorhead, already back on his board, paddles over.\nPoints to a small dent in the fiberglass.\n\n                         RAZORHEAD\n          You dinged my board, kook!!\n\nUtah looks up in apology as--\nA CRUSHING RIGHT HOOK SMACKS HIS FACE!\nKnocks him under.\nRazorhead pulls a KNIFE from a sheath held by a thong\naround his neck.  As Johnny surfaces, Razorhead slashes in\na vicious arc--\nSevering Utah's leash, close to the board.\nHis flame-job surfboard bobs away.\n\n                         RAZORHEAD\n          Politeness counts, ASSHOLE!\n\nThe surf punk plunges under a wave, disappearing.\n\n                         UTAH\n          Goddamn son-of-a--\n\nBefore Utah can finish, another wave engulfs him and he\ntumbles to shore, Razorhead nowhere to be seen.\n\nON PAPPAS as Johnny's flame-job board washes in at his\nfeet.  He calmly picks it up as Utah staggers INTO FRAME\nout of the knee-deep whitewash.  Johnny rubs his jaw.\nSpits blood.\n\n                         PAPPAS\n          Kid, maybe this ain't your sport.\n\nUtah grabs the board out of Pappas' hands and stalks off\nacross the beach.\n\n\nINT.  UTAH'S BEDROOM - NIGHT\n\nJohnny dead asleep.  Silence.  Then BRRRRR!!\nHe jacknifes up like he just took 20,000 volts.  His eyes\nread panic.  He rolls up, legs scissor against tangled\nsheets and he collapses over empty boxes.  He stumbles\nlike a blind man through the mess until he finds--\nA tiny Indianapolis Colts FOOTBALL HELMET with a digital\nclock for eyes.  5:00 a.m.  Johnny emits a drawn out\ngroan.\n\n\nEXT.  OCEAN - DAWN\n\nDeafening BOOM as a monster wave CRASHES below a sky the\ncolor of slate.  A distant Pacific storm has brought the\nswell.  10 foot faces.  Glassy, green walls the size of\nhouses beckoning from beyond the soup.\n\nA lone FIGURE bobbing out beyond the break.\nThe surfer disappears behind the swell.\nThen REAPPEARS, grinning across the smooth offshore\nbarrel.\n\nUTAH wearing a wetsuit stands beside his surfboard,\ncraning forward to get a better look.\nThe surfer is a WOMAN.\nShe moves with liquid grace, in perfect harmony with the\nsea, long hair flying out behind her.  She undulates like\na dancer.\nDipping, carving, slicing, making it look sooooo easy.\nJohnny shakes his head.  Oh man, if she can do it...\n\n                         UTAH\n          Fuck it.\n\nHe stands, grabs his board and heads out into the icy\nfoam.\n\nOCEAN BREAK\nA horizon of whitecaps churn behind him.\nHe lies on his board, rising and dropping with the swell.\nSo far so good.  He spots a wave.  A fluid gray-green\nhouse rising, forever rising.  Utah turns.  Paddles.  The\nhouse catching him, lifting him high upon its roof.\n\nUtah is committed.  He gets to his feet as his board\nslices along the lip.  He peers over the falls, down the\nface -- holy shit!  -- it looks like Niagara.  He loses\nbalance and spirals airborne, falling bullseye into the\nIMPACT ZONE.  The entire force of the wave crashing upon\nhim, plunging him down into the--\n\nWASHING MACHINE (UNDERWATER)\n\nwhere he SPINS like a whirling dervish, LASHED to a\nslamdancing surfboard at the mercy of God.\nHe is held prisoner in a grey-green churning nightmare,\nlike a six-ton pit bull has him by the neck, shaking him.\nHe looks around.  Can't tell up from down.\nWHAM!  His head slams into the bottom -- rocks and sand.\nStunned, he struggles toward the light, finally bursting\nto the--\n\nSURFACE.  Gasping for breath.\nThe good news is he's breathing, the bad news is he's\nsurfaced in the impact zone.  Another wave crashes down,\nstuffing him back into the washing machine.  Leaving no\nsign of life in the white froth.  The orangeade surfboard\nlaunches high into the sky, spinning like a misfiring\nTrident missile, trailing its broken leash like a kite\ntail.\n\nIN THE WASHING MACHINE, Utah tumbles in a cold green hell.\nHis chest is convulsing, needing air now.\nSuddenly a FIGURE lunges down INTO FRAME.\nA hand snatches a fistful of his hair and yanks him\ntoward--\n\nTHE SURFACE.  The WOMAN SURFER bursts through the foam.\nGrabs her board for leverage.  Hauls Utah's head above the\nwater with one strong arm.\nHe is choking, coughing, slapping fatigued arms against\nthe surf, panic registering in his movements.\n\n                         WOMAN SURFER\n                  (yelling above the\n                   roar)\n          Swim, goddammit!  Come on!  Move\n          it!\n\nThe woman gets her board under one of his arms for support\nand sidekicks fiercely into the wave, holding him in a\npainful grip.\nWith powerful strokes, she helps Utah make it to calmer\nwater outside the break.  The big waves, just forming up,\nlift them and drop them as they pass.  Muted thunder when\nthe waves hit the beach.  She drags him half onto her\nsurfboard.\nPractically slamming his face into the board.\nHe's coughing out saltwater.\n\nON THE WOMAN, our first good look at her.\nShe is EXQUISITE.  Hair slicked tight to her high-\ncheekboned face, she looks sleek and feral, with eyes that\nburn bright.\nEspecially when she's pissed.\n\n                         WOMAN\n          Look crazy son of a bitch!  You\n          wanna commit suicide, you do it\n          someplace else!\n\nShe undoes her leash and swims rapidly off, returning in a\nfew seconds with Johnny's board.  He takes it from her and\nflops over it, still coughing.\nWipes at the salt-snot running out of his nose.\nThere is a cut over his eye from when he re-arranged the\nrocks on the bottom.\n\n                         WOMAN\n          Look at this pig-board piece-a-shit.\n          It's still got the price tag on it,\n          for Chrissakes.  What'd you do, buy\n          it yesterday?  You've got no\n          business out here whatsoever.\n\nStill gagging and gasping, Johnny manages a goofy grin.\n\n                         UTAH\n          Well, I saw you and--\n\n                         WOMAN\n          Yeah, you saw me and you figured\n          that if a mere girl can do it, a big\n          strong stud like you shouldn't have\n          any problem.  Right?!  Well you\n          figured wrong, dork!\n\nShe yanks her board around and strokes powerfully away\nfrom him.\n\n                         UTAH\n          Hey!  Uh, how do I get back in?\n\n                         WOMAN\n                  (without turning)\n          Carefully, tough guy.  Very\n          carefully.\n\n                         UTAH\n                  (yelling now)\n          My name's Johnny Utah!\n\n                         WOMAN\n          Who cares!\n\n                         UTAH\n          I'm telling you so when you look\n          back on this moment, you can\n          think... there was this guy named\n          Utah and he was pretty much a dork\n          but maybe not such a bad person and\n          I let him drown in conditions he had\n          no business being in whatsoever...\n          when I could have easily helped him.\n\nJohnny calmly starts paddling toward shore.\nThundering white water pounding the rocks ahead of him.\nHe's stoic in the face of certain death.\n\n                         UTAH\n                  (over his shoulder,\n                   gamely)\n          Bye.\n\n                         WOMAN\n          Wait!  Jesus Christ!\n                  (swimming back to\n                   him)\n          You're fucking crazy, you know that?\n          You go in there you're gonna eat it\n          on the rocks.  Here, follow me.\n\nThe woman paddles parallel to the shore and Utah pumps\nalong behind her.  She gets him away from the rocks, then\nstarts watching the incoming swell, timing it to the lull\nbetween sets...\n\n                         WOMAN\n          Go when I say.  But stay down.  Just\n          lie on the board.  Alright, let's\n          go!\n\nUtah paddles rapidly, following her, watching what she\ndoes.\nHe is borne up by a low glassy wall.\nHe bellyboards all the way into the mushy shorebreak.\nTumbles.  Stands unsteadily, grabbing his board.  Runs\nclumsily out of the retreating foam as another wave comes,\nsucking water out.\nOn terra firma he looks back to see the woman kick-out\ngracefully and disappear beyond the wave.\n\nHe flops on the sand.  Shivering.  Miserable.\n\n\nEXT.  COAST HIGHWAY - LATER\n\nLONG LENS... the woman is peeling off her wetsuit next to\na BATHTUB PORSCHE that needs a paint job.  Her board is\npropped in the passenger seat.  Stereo is pumping.\n\nUTAH WATCHES THROUGH BINOCULARS from 50 yards up the road.\n\nTHE WOMAN, in a bikini, towels off briskly.\nSwimmer's shoulders.  Long muscular legs.  Lean and mean.\nShe jumps into the car without bothering to open the door.\nLooks at her watch -- her manner is late, in a hurry.\nThrough the tiny windshield we watch her shimmy and shake\nas she pulls her bottoms off and struggles into something\nelse, not too concerned about the morning traffic right\nnext to her.\nShe pulls on a T-shirt and them performs a Houdini act to\nextract the bikini top out of one sleeve hole.\n\nUTAH WATCHES IMPASSIVELY.  He starts his car and pulls out\nonto PCH to follow as the bathtub Porsche zooms past.\n\n\nEXT.  NEPTUNE'S NET\n\nUtah cruises up slowly, pulls off the road.\nUp ahead the Porsche turns into the parking lot of\nNEPTUNE'S NET, a Coast Highway hangout that serves high-\ngrade steamed sea-critters and beer to low-grade road\ntrash, bikers and surfers.\n\nLean-and-Mean, wearing jeans and T-shirt, jumps out of the\nPorsche.  She hurries to the door of the Net, unlocking it\nfor a couple of Mexican cooks -- helpers wearing\nexpressions like they wait like this for her every day.\n\nUTAH puts down his binoculars and jots the Porsche's\nlicense number down on a Tastee-Freeze bag.  867CDH.\n\n                                            CUT TO:\n\nINT.  COMPUTER ROOM - DAY\n\nGreen glow washes the intent faces of Utah and Pappas as\nMISS DEER data specialist, enters 867 CDH into her\ncomputer.\nShe is purebred American Indian, strong featured and\nbeautiful.\nThe screen freezes and the hard disk churns.\nThe DMV rap sheet scrolls down the screen.\n\n                         PAPPAS\n          This is your surfer contact?\n          Female.  Blond hair.  Green eyes.\n          5'6\".  119 lbs?\n\n                         MISS DEER\n          Hmm, not bad, Utah.\n\n                         UTAH\n          Tyler Ann Endicott.  Born 11-27-64.\n\nThe rap sheet scrolls and scrolls and scrolls.  There is\nsomething frightening about the length of this file.\n\n                         UTAH\n                  (reading from the\n                   screen)\n          ... Exhibition of speed.  Indecent\n          exposure inside moving vehicle...\n\n                         MISS DEER\n          Hot, very hot.\n\n                         UTAH\n          Felony arrest!  \"See adjoining\n          file\"...\n                  (he types quickly)\n          Kidnapping?!\n\nPappas crowds over Johnny's shoulder, reading.\n\n                         PAPPAS\n          This is great.  She ties some guy\n          up.  Nude.  Leaves the scene and\n          fails to return for 24 hours.  No\n          convection.\n\n                         MISS DEER\n          Gotta avoid the rope tricks, Johnny.\n\nUtah gives her a \"very funny\" look.  More data scrolls\nforth.\n\n                         UTAH\n          What else they got on her?  I still\n          haven't found anything I can really\n          use.  I gotta find an approach, a\n          way in -- here we go...\n                  (he reads)\n          Both parents deceased.  Plane crash.\n          San Diego, '84.  Mmmm.  Yeah,\n          definitely.\n\n                                            CUT TO:\n\nEXT.  NEPTUNE'S NET - DAY\n\nA fat biker pulls out on a loud Harley (like there's any\nother kind).  The place is almost empty in the weekend\nlull between lunch and dinner.\nUtah's car pulls in off PCH.\n\n\nINT.  NEPTUNE'S NET\n\nTyler Endicott is working the counter.  She jams an order\non the wheel and turns TO US.\n\n                         TYLER\n          Next!  Oh, no.\n\nREVERSE ON Johnny standing there.  Her only customer.\n\n                         TYLER\n          What do you want?\n\n                         UTAH\n          Shrimp and fries.\n\n                         TYLER\n          I mean, what do you want?  What are\n          you doing hanging around here.\n\n                         UTAH\n                  (very serious)\n          I need you to teach me.\n\n                         TYLER\n          Gimme a break.\n                  (to cook)\n          One shrimp and fries to go!\n                  (to Johnny)\n          Anything to drink?\n\n                         UTAH\n          I'm serious.\n\n                         TYLER\n          I can see that.  But forget it.\n          Stick to tennis, or whatever you're\n          good at.  Miniature golf.  Here,\n          your number's 37.\n\n                         UTAH\n          Well, I'm just gonna go back out\n          there till I catch on to it or break\n          my neck.\n\nShe's looking at him.  This guy's nuts.  She laughs.\n\n                         TYLER\n          What is it?  You all of a sudden got\n          this bug you had to go surfing?\n          This is a line, right?\n\n                         UTAH\n          No, no.  See, all my life I've done\n          things for other people.  In high\n          school I played football because my\n          old man expected me to.  Then my\n          parents always figured I'd go to law\n          school, so I did.  Football\n          scholarship.  Graduated Phi Beta\n          Kappa--\n\n                         TYLER\n          This gonna take long?\n\n                         UTAH\n          Wait, so I'm a big hero to my folks,\n          right?\n                  (he leans forward, a\n                   little awkward)\n          But two years ago they got killed in\n          a car wreck and I just suddenly\n          realized all my goals had been their\n          goals.  And I hadn't been living my\n          own life.  So I wanted something for\n          myself.  Something that maybe didn't\n          make any sense.  You know what I\n          mean?\n\nTyler's smile has faded during this.  He's managed to\ntouch her, break through the tough-waitress act.  Now\nshe's looking him right in the eye.\n\n                         UTAH\n          I came out here from Ohio a month\n          ago.  Never saw the ocean before.  I\n          didn't think it would effect me so\n          much.  Like I'm drawn to it, or\n          something.  I want to do what you\n          do.  It's the truth.\n\n                         TYLER\n          Tomorrow, 6 AM.  Here.  If you're a\n          minute late I'm gone.\n                  (he's grinning)\n          And Stud... I didn't take you to\n          raise.  I can show you a few things\n          but after that you're on your own.\n          That'll be four fifty.\n\nHe plunks down a ten and backs out the door, grinning.\n\n                         UTAH\n          Keep the change, Teach.\n\n                                            CUT TO:\n\nEXT.  BEACH - DAWN\n\nUTAH & TYLER walk across the sand.\nTyler drops her board.\n\n                         TYLER\n          Stop here.\n                  (she turns to him)\n          Do you agree to do exactly what I\n          say when I say it?\n\n                         UTAH\n          Sure.\n\n                                            CUT TO:\n\nUTAH pops INTO FRAME, arms extended, one leg in front of\nthe other, torso bent at the waist: classic surfing\nstance.\nSuddenly, he drops OUT OF FRAME.\n\nWE PULL BACK -- Revealing Utah on his board, on the sand.\n\n                         TYLER\n          Do it again.\n\nTyler is making him \"pop\" up to his feet.  Again and\nagain.  GAWKERS stop to watch.  Utah fights humiliation.\nHe pops again.  And again.  Quick cuts.\nOn the next pop we--\n\nPULL BACK to reveal Utah on his board, in a wave.  He is\nsurfing.\nFor about three seconds.  He flies off the deck, ass over\nteakettle.\nOn the SPLASH we start--\n\nA SEQUENCE OF TIME CUTS\n\nTyler and Utah straddle their boards outside the break.\nShe nods as the set comes, mellow right tubes.  Utah digs\nin, arms pumping.\nHe feels the bite as the wave picks up his board and\nstarts down the wall.\nAnd endos.\n\nCLOUDY PLATINUM DAWN...\nTyler shouting at Utah as he fights for balance.\nHe flies off again.\n\nBLINDING BRIGHT SUNRISE.  TYLER NEXT TO UTAH in the\nlineup, straddling boards.  She moves her hands like a\nfighter pilot explaining a dogfight maneuver.  Utah\nwatches intently.\n\nUtah, backlit in glorious slow motion, tries a little turn\nand feels his feet slip out.  He slams down butt-first on\nthe board, flips over, feet sticking straight up out of a\nblast of diamond spray.\nTyler cringes, giving a look like it's hopeless.\n\nTYLER AND UTAH, at their cars, skinning out of their\nwetsuits.  Utah looks exhausted, downcast.  She snaps her\nwet towel at his ass, cheering him up.\n\nMALIBU PIER.  RAIN.  Tyler jumps out of her Porsche and\nsees Utah sitting in his car.  She goes to him, opens the\ndoor and starts pulling him out.  Come on you pussy.\n\nUTAH and TYLER wait their turn in the lineup.  Rain pelts\ntheir faces.  The waves are depressing inside mushers\nunder a gray sky.\nUtah starts to paddle.  Tyler shakes her head no.  Utah is\ncommitted to the I'face.  Tyler stifles a laugh.\n\n                         TYLER\n                  (to the other\n                   surfers)\n          I'm not with him.\n\nJohnny gouges the lip, pops and begins the drop.\nSuddenly, miraculously, he catches an edge and, still\nstanding, is carried along the tiny wall.\n\nThe wall begins to sag.  Utah shoots along the mush\nhooting and continues hooting madly as he thrashes all the\nway to shore.\nHe turns and grins foolishly out to sea.\nTyler bursts out laughing.\n\n\nEXT.  MALIBU PIER - DUSK\n\nBig surf.  Rough conditions.  Closeout set.\nUTAH, board in arm, follows Tyler out of the whitewater\nonto the beach.\n\n                         TYLER\n          It's closing out completely.  Let's\n          call it.\n\nUtah nods.  His eyes track the unruly break.\n\n                         UTAH\n          Who's that?\n\nA LONE SURFER slashing through the pilings of the pier.  A\nreal kamikaze run as the whitewater walls thunder behind\nhim.\nSILHOUETTED against a crimson sky and backlit spray the\nfigure pumps among the pier pilings in a frenzy of motion\nthat is somehow balletic.\nLaying out bottom turns, torquing his body and blasting\nthe lip a few times, moving so fast his long dark hair\nstands straight back as if he were leaning out a car\nwindow on the freeway.\n\n                         TYLER (V.O.)\n          That's Bodhi.  They call his the\n          Bodhisattva.\n\nUtah watches as THE BODHISATTVA gets vertical with a snap,\ntrims down the volcanic wall, carves the bottom, pivots,\npumps to the top, gouging the lip, getting six feet of\nair.\nGawkers HOWL and shout praise at the manic surfer.\n\n                         TYLER\n          The modern savage.  Guy's even\n          crazier than you, Johnny Utah.\n          C'mon.\n\nThey start to walk.  The sky darkens as the sea finally\ncloses out completely.  The Bodhisattva seems to levitate\nthrough the shapeless mush to shore.\n\n                         ROACH (O.S.)\n          Brah!\n\nSuddenly a football whistles through the air above Utah's\nhead.\nHe watches as--\nThe Bodhisattva, board under arm, walking out of the\nwhitewater, makes a one-handed chest catch.\n\nA few yards away two teams of SURFERS play football.\nUtah gazes down the beach at the Bodhisattva.\nAlmost 30 years old, his body lean and hard as a tree\ntrunk.  Hardness in the face accented by long Comanche\nhair.\n\n                         BODHI\n          Hey Tyler!\n\nShe whirls.  Bodhi pumps his arm.  Tyler jogs back for the\ncatch.  Bullseye.  She shoots Bodhi a look.  Something\ncrosses her face.\nBodhi smiles.  Tyler doesn't.  Then it passes.\nShe chucks the ball to Utah.\nWho drops his board and makes the catch in one move.\nHe SPINS the football on his fingertip, drops it on his\nfoot, kicks it up into his hands.  Razzle dazzle.  He\ngrins evilly.\n\n\nEXT.  BEACH - NIGHT\n\nRimmed by a dozen car HEADLIGHTS at the edge of the sand.\nUtah crouches, waiting for the snap from NATHANIEL,\nponytailed and powerfully built.  Facing them on defense\nare Bodhi, Tyler and three others: ROACH, gonzo and\nspiked-haired.  GROMMET... 17 and thin as a stick, and\nROSIE, a biker with piggy eyes and arms blue with tattoos.\n\nMONTAGE STYLE -- Utah tosses a flurry of mindboggling\npasses.  Every one picture perfect.  Nathaniel scrambles\nz-out left, turns and the ball is practically waiting for\nhim.  Touchdowns galore.  Endzone dancing.  Bodhi stares\nat him curiously.\n\nTyler rushes.  Utah enjoys scrambling, ducking left and\nright, twisting her into a pretzel.  Play after play.\nUtah tosses another touchdown, but Tyler keeps coming.\nSacking him.\nThey lie together in a heap, laughing.\n\nBodhi quarterbacks.  Utah rushes.  Bodhi fakes a pass then\nruns, ball tucked in his arm.  Utah tears after him.  Flat\nout speed run.\nRoach attempts a block.  Utah hits him like a freight\ntrain.\nRoach hits the sand face first.\nGrommet and Rosie the biker in a squeeze play.\nUtah, fierce now, blasts between them.  No mercy.\nUtah can't play for fun.  We see his expression.\nSomething scary there.  What we will call \"juggernaut\nmode\".\nTyler just steps aside.\n\nBodhi running along wet sand as a wave sweeps up the\nbeach.  Looks back.  Sees a demon shooting up roostertails\nof spray behind him, gaining.  Pours it on.  Both of them\npistoning through curtains of water.  Not a game anymore.\nClosing on the endzone.  5 yards.  Utah is airborne.\nSLAMS BODHI LIKE A SAM MISSILE.  They crash and burn\ntogether in the surf.\n\nThe other surfers run up.  Who's this newcomer that just\ncenterpunched their main man?  Industrial strength\ntension.\n\n                         ROACH\n          The fuck you doin' man?!  You\n          fuckin' crazy?\n\nBodhi flashes a million dollar smile.\n\n                         BODHI\n          Chill, brah.  You know who this is?\n          Johnny Utah.  Ohio State, all-\n          conference.\n                  (to Utah)\n          Rose Bowl three years ago.  Right?\n\nJohnny nods.  Tyler looks at him -- no shit?\n\n                         ROACH\n          Johnny fuckin' Utah!  Fuckin'-A!\n          Yeah, I remember that game, man.\n          You were on-fire.  They could not\n          stop your ass.\n\n                         GROMMET\n          Radical!  Head-butt, dude!!\n\nJohnny gestures \"Please no\".\nEnthused by the concept, Grommet turns to Nathaniel.\n\n                         GROMMET\n          Head-butt!!!\n\nThey do.  Their foreheads CRACK together.  They stumble\nbackwards in giddy euphoria.  Nathaniel laughs like Pee\nWee Herman.\n\n                         BODHI\n          Something happened.  You got nuked\n          in the last quarter.\n\n                         UTAH\n          Yeah, my knee got folded about 90\n          degrees the wrong way.\n\n                         BODHI\n          And that's why you never went pro?\n\n                         UTAH\n          Two years of surgery.  I missed my\n          window.  Limped through law school\n          instead.\n\n                         BODHI\n          Mmm.  A lawyer, huh?\n                  (like it's a disease)\n          Too bad.  But at least you're\n          surfing now.  So your life's not\n          over yet, right?\n\n                         UTAH\n          Not yet.\n\n                                            CUT TO:\n\nINT.  FEDERAL BUILDING - 16TH FLOOR - DAY\n\nUtah, in shorts and T-shirt, carries his flame-job\nsurfboard past surveillance cameras and portraits of Bush,\nHoover and Webster.  Special Agent Cole walks by.  Eyes\nthe board.  Speaks deadpan.\n\n                         COLE\n          Like totally rad stick, dude.\n\n\nINT.  BULLPEN\n\nUtah tries to act casual as he carries the board to his\ndesk on the other side of the room.  He has to walk past\nthe entire gauntlet to get there.\n\n                         SEVERAL AGENTS\n          Gnarly, man... hang ten...\n          cowabunga... surf patrol... rip it\n          up!\n\nHarp comes straight for him like a homing missile.\n\n                         HARP\n          How was the beach?\n\n                         UTAH\n          Fine.\n\n                         HARP\n          Surf conditions okay?\n\n                         UTAH\n          A little mushy.\n\n                         HARP\n          A little mushy!  You think the\n          taxpayers would like it, Utah, if\n          they knew they were paying a federal\n          agent to surf and pick up girls?\n\n                         UTAH\n          Babes.\n\n                         HARP\n          What?\n\n                         UTAH\n          The correct term is babes, sir.  Uh,\n          this type of undercover operation is\n          entirely dependent on picking up the\n          idiom of the speech.  Otherwise\n          penetration is not possible, sir.\n          Of the social infrastructure, I\n          mean.\n\nHarp inhales through his nose.  A bad sign.\n\n                         HARP\n          Where is Pappas?\n\nUtah points across the room.  Harp turns.\nPAPPAS, sitting behind his desk in his \"Surf This\" T-shirt\nand pink shorts, lifts the purple Vuarnets like Tom Cruise\nin Risky Business.\nLooks directly at Harp.  Smiles innocently.\n\n\nINT.  HARP'S OFFICE\n\nHarp paces.  Type-A suppressed rage.\nUtah and Pappas endure Harp's wrath.\n\n                         HARP\n          Special Agent Utah, this is not some\n          job flippin' burgers at the drive-in.\n          Yes, the surfboard bothers me.  Yes,\n          your approach to this case bothers\n          me.  And yes, you bother me.  You\n          two have produced squat in the last\n          two weeks, during which time the Ex-\n          Presidents have robbed two more\n          banks!!  Do you have anything even\n          remotely interesting to tell me?\n\n                         UTAH\n          Caught my first tube this morning.\n\nPappas signals, unseen by Harp, for Utah to shut the fuck\nup.\n\n\nINT.  CORRIDOR TO COMPUTER ROOM\n\nJohnny and Angelo walking.\n\n                         PAPPAS\n          What, you couldn't have just left\n          the thing in your car?\n\n                         UTAH\n          It sticks out, so I can't lock it.\n          Look, Angelo, you think I joined the\n          FBI to learn to surf?  This was your\n          lame-o idea in the first place.  You\n          gotta back me up on this.\n\n                         PAPPAS\n          Johnny, all I can say is we better\n          come up with something real soon.\n\nJohnny cocks an eyebrow and opens the door to the computer\nroom ceremonially, like a doorman at the Ritz-Carlton.\nMiss Deer looks up as they enter.\n\n\nINT.  COMPUTER ROOM\n\nTIGHT ON CRT as a lab report scrolls up the screen.  Gas\nchromatography and spectroanalysis.  Columns of elements\nand compounds, listed as percentage-of-sample.\n\n                         MISS DEER (V.O.)\n          Encino Savings & Loan guard grabbed\n          LBJ's ponytail.  We recovered one\n          hair.\n\nWIDER, showing Utah and Pappas over her shoulder at the\nterminal.\n\n                         PAPPAS\n          Yeah, yeah, I remember, last year.\n          Guy got his jaw broken for it.\n\n                         MISS DEER\n          One four centimeter strand.  Color\n          brown.  Oily.  Slight wave.\n\n                         PAPPAS\n          Hell, what're we waiting for, let's\n          go pick the guy up.\n\n                         UTAH\n          Angelo, pay attention.  There's\n          gonna be a test afterward.  Lab is\n          showing traces of toxins.  PCBs.\n          Heavy elements... selenium, titanium\n          and arsenic.\n\n                         PAPPAS\n          Guy's the Toxic Avenger.\n\nUtah is excited as he fits the pieces together for his\npartner.\n\n                         UTAH\n          The beaches are always being closed\n          because of waste spills, right?  And\n          surfers are territorial.  They stick\n          mostly to certain breaks.  If we can\n          get some hair samples, and get a\n          match to a certain beach, we'd know\n          which break the Ex-Presidents surf.\n          You buyin' this?\n\n                         PAPPAS\n          No.  But let's do it, anyway.  It's\n          gonna bug the shit out of Harp.\n\n                                            CUT TO:\n\nEXT.  LATIGO - DAY\n\nDepartment of Health sign reads, \"Beach Temporarily\nClosed.\" Beyond it crashes a wasted northwest swell.\n\nTwo frustrated teenage SURFERS huddle underneath a towel.\nMarijuana smoke seeps upward.\nA sandaled FOOT enters frame and taps their leg.  Angry\nheads poke up from beneath the towel, nostrils and mouths\nbillowing smoke.\nThe two wear T-shirts which read \"Passion for Slashin\" and\n\"Psycho Stick\".\nPAPPAS smiles, standing there in his beach wear, trying to\nblend in.  He doesn't.\n\n                         PAPPAS\n          When you two are done makin' out, I\n          need to talk to you.\n\n                         \"PSYCHO-STICK\" T-SHIRT\n          Hey, I ain't no butt-bouncer, dude.\n          We're from the valley.  Mall babes\n          'n shit.\n\nThe kids proudly high-five.\n\n                         PAPPAS\n          I just want to know if you surf here\n          a lot.\n\n                         \"PASSION FOR SLASHIN'\" T-SHIRT\n          Shit yeah, like totally everyday\n          when it's jammin'.  What is this,\n          fucking narco entrapment or what,\n          dude?\n\nPappas flashes his FBI star.  He whips out a pair of\nscissors.\nBrandishes them like some over-the-hill \"Jason\".\n\n                         PAPPAS\n          Not exactly, dudes.\n\n\nEXT.  COUNTY LINE - DAY\n\nRow of SURFMOBILES parked along a cliff, facing the ocean,\ndoors open, stereos blasting, SURFERS hanging, sitting on\nhoods.\nUtah moves along the cars, looking surfed-out.\nHe's tanned, relaxed.  Hair starting to bleach out.  One\nof the tribe.\n\n                         UTAH\n          Whoa, brah, easy now... Don't move!\n                  (Utah bends close,\n                   reaching for Surf-\n                   Rat's ear)\n          Got some huge sucker crawling into\n          your--\n                  (he plucks at a tuft\n                   of hair)\n          Got it!  Uuuughhh.\n\n                         SURF-RAT\n          Leave some fuckin' hair, man!\n\nUtah squashes, then inspects the mysterious creepy-crawler\nhidden in his palm.  He wipes his hand on his towel, which\nhe keeps balled up in his other hand.\n\n                         SURF-RAT\n          What was it?\n\n                         UTAH\n          Saved your butt, bro.  Close one.\n\nUtah shivers in disgust, then coyly turns and walks away.\nThe surf-rat desperately pats his ear for traces.\n\n                                            CUT TO:\n\nINT.  FORENSICS LAB - NIGHT\n\nA long series of ENVELOPES are displayed on a desk.  Each\nhas the name of a Southern California beach and is\nattached to a forensic printout.\nHALSEY inspects each envelope.\n\n                         HALSEY\n          Naw, this isn't it.\n\nUTAH holds up an envelope with a skinny woven ponytail\nsticking out.\nPAPPAS shrugs.\n\n                         PAPPAS\n          He moved.\n\nHalsey picks up an envelope marked \"Latigo Beach\".\n\n                         HALSEY\n          PCBs, selenium, titanium, arsenic.\n          The percentages look right.  Here's\n          a match.\n\n                         UTAH\n          Latigo Beach.\n\nPappas grabs the envelope, studies it, crooks his head.\n\n                         PAPPAS\n          Surf's up, ace.\n\n                                            CUT TO:\n\nEXT.  LATIGO BEACH - DAY\n\nEXTREME LONG LENS scans the beach from a height.  A gray,\nmiserable day.  Beach crowd thin except for diehards.\n\nThe image drifts across faces, BODIES.  Surfers walking\nwith boards.\nTalking, sitting with pubescent girls.\nThe image settles on Johnny, astride his board, bobbing\nbeyond the break.\n\nON PAPPAS, scanning with powerful binoculars from his car.\n\nCLOSE ON UTAH, out among the flock of hardcore surfers.\nOstensibly waiting for a wave, his eyes search the others\naround him, clicking methodically from face to face.\nFinally he swings his board around and awkwardly catches a\nride.\nThe modest wave carries him toward the beach as he\nbalances, tense and style-less.\n\nHe passes someone we've seen before.  The RAZORHEAD from\nthe first day.  In concentration, Johnny doesn't see the\nguy.\nBut Razorhead definitely sees him.\n\nJOHNNY reaches the beach and jogs up the sand.  He picks\nup a towel and talks into it as he dries his hair.  A\nglimpse of the walkie-talkie hidden beneath.\n\n                         UTAH\n          Big zippo so far.  How about you?\n\n                         PAPPAS (RADIO)\n          Patience hotshot.  Patience.  It'll\n          be subtle, if it's here at all.\n\nPAPPAS WATCHES as Johnny crosses toward the outside shower\nnext to the public restroom.\nLONG LENS view of Utah passing OUT OF SIGHT behind the\nbuilding.\n\nAT THE SHOWER Johnny sets down his gear and opens his\nwetsuit to the warm, salt-free jet of water.  TRACKING\nSLOWLY IN on him as he lets it pour over his face.\nA HAND ENTERS FRAME, shutting off the water suddenly.\n\nTIGHT ON UTAH, his eyes opening.\n\nREVERSE, revealing RAZORHEAD and THREE OTHERS.\nThey are powerfully built SURF-NAZIS.\nScalps shaved on the sides.  Hair military short on top,\nlengthening into pigtails in the back.  Tattoos.  Wrist\nchains.\nTONE, ARCHBOLD and WARCHILD.  The one who socked Utah\nbefore is BUNKER.  They spread out flanking him.\n\n                         WARCHILD\n          This the guy?\n\n                         BUNKER\n          Yeah.\n\n                         UTAH\n                  (good natured)\n          Okay, so this is where you tell me\n          all about how locals rule and yuppie\n          insects like me shouldn't be surfing\n          your break and all that, right?\n\n                         BUNKER\n          No.\n\n                         TONE\n          Waste of time.\n\n                         WARCHILD\n          We're just going to fuck you up.\n\n                         UTAH\n          Oh.\n\nAs they lunge, Utah grabs his board and swings it in a\nwhistling roundhouse.  Its edge slams Warchild in the gut\nand folds him double.  The bad news is... Warchild gets an\narm around it and brings a pile-driver hammer-punch down.\nThe board splits into two pieces.\nUtah drops his end as the others close.  A flurry of\npunches and kicks, most of which he blocks.  But he's lost\nthe offensive.\nBunker takes him to his knees with a vicious karate-style\nside-kick.\n\nTIGHT ON Utah's towel, talking with Pappas' voice.\n\n                         PAPPAS\n          Johnny?  You there?\n\nANGELO gets out of the car fast.  He jogs twenty feet and\nraises the binoculars.  Catches a glimpse of the carnage\naround the edge of the building.  Breaks into a run,\nmassive legs pistoning.\n\nJOHNNY HITS THE GROUND hard.  He rolls and comes up fast.\nThe razorhead brothers are a little surprised.\n\n                         ARCHBOLD\n          The dude can fight!\n\nWarchild grabs Utah from behind.  Gets him in a headlock.\nArchbold and Tone pin his arms.  Bunker starts working him\nlike a practice bag.  At this moment, Johnny is getting\nthe proverbial shit beat out of him.\nSUDDENLY, a new figure blurs INTO FRAME.\n\nBODHI seizes Bunker and flings him aside.  He spins with\nremarkable agility and drives his heel into Warchild's\nface.\nUtah breaks free, staggering back on the sand.  The fight\nis still there in his eyes.\n\nBodhi is at his side -- holding the others at bay with a\nraised hand and an evil look.\n\n                         BODHI\n          Back off!  Now!!  Just let it go!\n\n                         BUNKER\n          Stay outta this, Bodhi!\n\n                         BODHI\n          He's with me.  Now back off.\n          Seriously.Just do it!\n                  (they relax slightly)\n          You alright Warchild?\n\n                         WARCHILD\n                  (holding his bleeding\n                   nose)\n          Fuck you.\n\nEverybody has backed off a bit, panting.\nUtah steps toward Bunker.  Like he's maybe going to shake\nhands.\n\n                         UTAH\n          What's your name?\n\n                         BUNKER\n          Bunker.\n\n                         UTAH\n          Well, listen, Bunker... I'm actually\n          kinda glad you found me.\n\n                         BUNKER\n          Yeah?  Why?\n\nJohnny answers with a LIGHTNING ROUNDHOUSE that hits with\na CRACK!  They can hear it in Pomona.\nBUNKER HITS THE GROUND.  Flat out.  Lights out.\nTone, Archbold and Warchild lunge like dogs.\nBodhi yanks Utah out of the line of fire.\n\n                         BODHI\n          Whoa!  Whoa!  Hold it, ladies.  Give\n          it a rest.\n                  (to Utah)\n          Let's go.\n\nHe literally turns Utah around.\nThey begin to walk, stepping over the pieces of Johnny's\nboard.\n\n                         BODHI\n                  (under his breath)\n          Do me a favor, Johnny, just keep\n          walking.\n\nTone starts to go after them.  Archbold grabs his arm.\nThey help Bunker up.  Warchild holds he bleeding nose.\nUtah and Bodhi start up the stairs, turn a corner and run\nHEAD-ON into a huffing PAPPAS.\nThe big man clocks a battered but intact Utah.\nWe see him shift gears in his head in 2 tenths of a\nsecond.\n\n                         PAPPAS\n                  (out of breath)\n          Uh, you guys seen a kid, maybe 10,\n          12, running with a car stereo?\n          Stole the fucking CD too, you\n          believe it?\n\nUtah is grateful for the cover.\n\n                         UTAH\n          No, but there are four guys back\n          there you might check out.\n\n                         PAPPAS\n          Thanks, buddy.\n\nHe shoves on.\n\n\nEXT.  PARKING LOT\n\nBodhi and Utah weave among the cars and motorcycles,\nbeach-types coming and going.\n\n                         UTAH\n          Friends of yours, huh?\n\n                         BODHI\n          The one you decked is Bunker Wiess.\n          The big one is his brother,\n          Warchild.  The other two always\n          hang.  They think they're some kinda\n          death squad around here.\n\n                         UTAH\n          What's their program?\n\n                         BODHI\n          They're punks.  Nazis.  Their brains\n          are wired wrong.  They hurt surfing\n          because they give nothing back, and\n          they have no respect for the sea.\n          They just want to get radical.  It's\n          mindless aggression.  They'll never\n          get it, the spiritual side of it.\n\n                         UTAH\n          You always talk like this?  You're\n          not gonna start chanting or anything\n          are you?\n\n                         BODHI\n                  (laughing)\n          No.\n                  (beat)\n          So I was up the beach.  I saw it\n          going down.  you didn't hesitate...\n          they never backed you up an inch.\n          That's rare in this world.\n\n                         UTAH\n          Thanks for stepping in.\n\n                         BODHI\n          De nada.\n\nBodhi keeps on walking as Utah reaches his car and stops.\nFive paces on, he stops and turns back.  A moment of\ndecision...\n\n                         UTAH\n          Gonna be some people at my house\n          tonight.  Maybe you can make it.\n\n                         UTAH\n          Where?\n\n                         BODHI\n          Come with Tyler.  She knows.\n\nBodhi turns and saunters away.  Utah considers his last\nwords, wondering how well Tyler and Bodhi know each other.\n\n                                            CUT TO:\n\nINT./ EXT.  CAR - PCH - SANTA MONICA - DAY\n\nUtah is struggling into a T-shirt as Pappas drives,\nintently following a beat-to-shit JEEP.  Paramilitary\nolive-drab and full of surfboards.  And razorhead.\n\n                         PAPPAS\n          Ten seconds you're out of sight.\n          Unbelievable.\n\nJohnny is equipment-juggling now... cradling a cellular\nphone at his ear while steadying Pappas' binoculars in\nfront of his eyes.\n\n                         UTAH\n          You're losin' them.\n                  (into phone)\n          That's right.  Two-denver-four-sam-\n          niner-five-niner.  Late seventies\n          Jeep.\n\nLONG LENS, JOHNNY'S POV through binoculars.  Bunker's jeep\nweaves aggressively through traffic ahead.  Horns honk.\nTone flips off the driver of a Toyota.\n\n                         PAPPAS\n          Look, if you're gonna go leavin'\n          your piece and your shield in the\n          car, you can damn well stay in\n          sight.  Okay?\n\n                         UTAH\n          Okay, Dad.\n\n\nEXT.  VENICE STREET - DAY\n\nLow rent street off Washington.\nEXTREME LONG LENS on Jeep as it pulls onto the dead front\nlawn of a brown stucco house with bars on the windows.\nThe razorheads get out, pulling boards and wetsuits from\nthe Jeep.  They are dressed now in ripped jeans, GI boots,\nsleeveless Megadeth T-shirts, etc.\nWatching, we become aware that two of them have brown hair\nin a radical style... shaved sides and a short ponytail.\n\n                         UTAH (V.O.)\n          The jeep is registered to a Bradley\n          Wiess.  My buddy.  Guy's got quite a\n          sheet.\n                  (into phone)\n          Yeah, yeah... skip all that.  Gimme\n          the greatest hits.  Misdemeanor\n          possession of cocaine.  That's\n          good...\n\n\nINT./ EXT.  CAR\n\nUtah on the cellular, Pappas behind the wheel as they\nslide to a stop half a block from the stucco house.\n\n                         UTAH\n          ... Felony B and E, three months in\n          juvey.  Better.  Felony assault.\n          Postgraduate work at Chino.\n          Excellent.  I'm lovin' it.  What\n          about the brother?\n                  (Utah is grinning)\n          Great!  Another model citizen.\n          These guys really fit the profile.\n\n                         PAPPAS\n          Remember, all bank robbers are\n          losers, but not all losers are bank\n          robbers.\n\nLONG LENS POV of Razorheads house.  Through the windows we\nsee the four moving inside.  Tone throws Archbold and\nBunker a Coors from the fridge.  Archbold shakes his and\nopens it in Warchild's face.  Warchild, in no mood, slams\nhim against the wall.  We feel the revved-up, chaotic\nenergy of the group in silent pantomime.\n\nBunker is met by a GIRL coming from the back of the house.\nShe is wearing only panties and a black leather vest.\nShort black hair and tattoos stark on her white skin.\nBunker puts one arm around her neck in a head lock embrace\nand slides his other hand under her vest.  Tone pulls the\ncurtains.\n\n                         UTAH\n          These are the guys.  I can feel it.\n          I say we lay it on Harp.\n\n                                            CUT TO:\n\nEXT.  STREET NEAR HOUSE - NIGHT\n\nTELEPHOTO VIEW of house.\nBunker and Archbold have partially disassembled the engine\nof a Kawasaki 1100 parked in the living room.  They are\ndrinking beer and arguing about the carburetors, lit by\nthe blue glow of the TV.  Warchild is watching a living-\ndead movie on tape.\nHe replays the gory parts.  Not a happening night at the\nRazorheads.\n\nREVERSE, as binoculars are lowered, revealing Cole.\nWIDER, to show the dynamic team of Cole and Munoz\nglowering in a plain sedan, Utah leaning in the side\nwindow.\n\n                         MUNOZ\n          This is bullshit.  This is a\n          bullshit lead.  This is totally\n          bullshit.  Harp must be fucking\n          desperate if he's listening to you\n          two flakes.\n\n                         UTAH\n          See you bright and early, guys.\n\nPappas walks up with a grease-stained box.  Jams it\nthrough the window.\n\n                         PAPPAS\n          Cold pizza?  It's great for\n          breakfast.\n\n\nINT./ EXT.  PAPPAS' CAR - NIGHT\n\nPappas pulls away from the curb, roaring past the other\nagents sedan.  Utah and Cole flip each other off\nperfunctorily as they pass.\n\n                         UTAH\n          When did Harp say they'd have the\n          warrant?\n\n                         PAPPAS\n          He's pushing it through first thing.\n          You better get some sleep tonight,\n          it could be an interesting morning.\n\n                                            CUT TO:\n\nEXT.  BODHI'S HOUSE - NIGHT\n\nA bunker-like structure built of stone and glass on a\ncliff overlooking the Pacific.  Surfmobiles and\nmotorcycles parked in front.  A strong backbeat thumps\nthrough the open front doors.\nTyler's Porsche pulls into the driveway.  She and Johnny\nget out and head for the entrance.\n\n                         UTAH\n          Nice place.\n\n                         TYLER\n          He rents it for the summer.  Bodhi\n          always gets some slick place and\n          throws it open to every surf burnout\n          around.  Most a these guys can't\n          keep a job.  When the swell comes,\n          they're gone, they have to ride.\n\n\nINT./ EXT.  BODHI'S HOUSE\n\nTyler leads Utah through the steady flow of SURF-RATS and\nother PCH NOMADS toward a large outdoor deck where a\nbarbecue is in progress.  Moonlit waves pound the shore\neighty feet below.\n\nThey are immediately distracted by the small crowd\ngathering around GROMMET who has his nose pressed flat\nagainst the center of a dart board.\nHis eyes swivels back to ROACH, standing fifteen feet\naway, dart in hand, getting ready to throw.\n\n                         GROMMET\n          Do your worst, man!\n\nRoach drains a beer in one gulp, spies the sharp needle\npoint of the dart, then squints at the target.\nROSIE moves through the small crowd collecting bets.\n\nSuddenly Roaches arm snaps back.  A collective hush...\nIn a blur of tattoos the small feathered missile is\nairborne.\n\nTWAAAPPPPPP!  Bulls-eye.  Centimeters from flesh.  Grommet\nsecretly exhales.  Roach howls as Rosie rains money on his\nhead.\nThe crowd goes wild.\nBODHI stands nearby with his arm around a BEAUTIFUL WOMAN.\nPleased to see Utah, he motions him over.\n\n                         UTAH\n          Don't you gamble?\n\n                         BODHI\n          Only make bets I can't afford to\n          lose.  Only way to be 100%\n          committed.\n\nWith that, Bodhi smiles, then he and the woman vanish into\nthe crowd.  Utah watches them go, turns to Tyler.\n\n                         UTAH\n          Who's the girl?\n\n                         TYLER\n          Catch of the day.\n\n                         UTAH\n          Oh, oh.  That sounds personal.\n\n                         TYLER\n          People are expendable to Bodhi.\n\n                         UTAH\n          Meaning you were expendable.\n\n                         TYLER\n                  (shrugs)\n          We went out for about five\n          minutes... which is four minutes\n          longer than most of them.  But you\n          can't hold it against him, he's...\n          different.\n\n                         UTAH\n          Sure, he's \"the Bodhisattva\".\n\n                         TYLER\n                  (she chuckles)\n          Yeah, he thinks he's evolved to a\n          higher plane of existence, or\n          something.\n                  (thoughtful)\n          Maybe he has.  You've seen him\n          surf... that frenzy.  It seems like\n          anger.  It's not.  It's the energy\n          of lovemaking.  The sea is the woman\n          in his life.  She's his only true\n          lover.\n\nUtah studies her a moment.  He's caught the faintest hint\nof regret in her voice.  But also the straight-ahead\npragmatism.  He looks down at the waves pounding\nmercilessly against the rocks.\n\n                         UTAH\n          All she does is beat the shit out of\n          me.\n\n                                            DISSOLVE TO:\n\nPARTY - LATER\n\nLingering surf-rats stoned and drunk.\nNathaniel stands on the railing of the deck, Corona in\nhand, gazing out at the black water.  He grins sloppily,\nbody wavering dangerously as he hunkers down into a\nsurfing stance.\n\n                         NATHANIEL\n                  (beer soaked speech)\n          ... Okay, so you're in the face,\n          it's twenty-five feet straight down,\n          your balls are about this big.\n                  (like he's holding up\n                   two BB's)\n          And the whole thing's moving, right,\n          roaring like you're stuck to the\n          front of a freight train.  There\n          ain't nothin' like it, man.  The\n          ultimate rush.  Forget about sex, it\n          doesn't even come close.\n\n                         ROACH\n          You lose it right then, you're\n          history.  The fish'll be pickin' you\n          outta the coral.\n\nNathaniel cackles that absurd Pee-Wee Herman laugh.  He\nstarts to flail, arms pinwheeling.\nUtah catches him by the back of the shorts and pulls him\nback.  Nathaniel spins and drops clumsily onto the deck.\n\n                         NATHANIEL\n                  (matter of factly)\n          Thanks, brah.\n\nTyler sits next to Johnny, sipping a beer.  Bodhi is not\nin sight.\n\n                         ROACH\n          See, it's all dynamic, it's all in\n          motion.  You can't just stop and\n          walk on in to the beach if you don't\n          like the way things are going, y'\n          know what I mean?  You gotta ride it\n          out man, all the way.\n\n                         GROMMET\n          You ride the monsters, you gotta\n          know you're ridin' a line between\n          life and death.  There ain't no\n          forgiveness.\n\n                         UTAH\n          So what's the biggest?  Waimea?\n\n                         BODHI (V.O.)\n          No, Bells Beach, Australia.\n\nBodhi glides into the group and sits, his expression dark\nand enigmatic.  The beautiful girl kneels behind him,\nmassaging his neck.  He seems not to notice.\n\n                         GROMMET\n          Shit, yeah!  I remember that day...\n          gnarly fuckin' ass!  Was your\n          birthday--\n\n                         ROACH\n          The set was northwest.  Jacking up\n          like a fucking mountain of gray\n          glass--\n\n                         BODHI\n          I made that one mistake you pray\n          you'll never make--\n\n                         NATHANIEL\n          You shoulda fuckin' seen it... it\n          was like he fell for-ever.  Then the\n          curl crashes down and he's gooone--\n\n                         GROMMET\n          -- held down in the washing machine,\n          man... it was severe, we couldn't\n          see nothin' thought it was all over\n          for sure--\n\nNathaniel HOWLS.\nTyler watches Utah watching Bodhi.  Notices how he is\nmesmerized by these war stories.  Bodhi smiles,\nunexpectedly.\n\n                         BODHI\n          Not tragic to die doing what you\n          love.  You want the ultimate thrill,\n          you gotta be willing to pay the\n          ultimate price.\n\n                         NATHANIEL\n          Fuckin' A.\n\n                         GROMMET\n                  (draining a Corona)\n          Hell, I ain't gonna see 30.\n\nHe and Nathaniel slap a warm, brotherly handshake.\nUtah notices that Tyler is giving him a dark look.\nShe gets up suddenly and walks away from the group.\n\n                         UTAH\n                  (to the surfers,\n                   covering)\n          Uh.  I need another beer.\n\nHe heads out after Tyler.\n\n\nINT.  HALLWAY - DEN\n\nJohnny moves through the house, looking for her.  As he\npasses the den, he sees Tyler standing inside, and goes\ninto the dark room.\nIt is the only personalized space we have seen in the\nhouse.\nA kind of shrine to the Bodhisattva.\nShelves filled with books and artifacts from his travels.\nMaori masks, a blowgun, a skeletal shark mouth two feet\nacross, a huge fossil ammonite... an unbelievable variety\nof tribal artifacts and marine specimens.\nThe books include political literature, eastern religion,\nphilosophy.  A strange hodgepodge of titles and authors:\nNietzsche, Marx, the Tao, \"Steal this Book\", \"The Book of\nFive Rings\", Frederick Forsyth thrillers.\n\nTyler is looking at a wall of photographs and Johnny walks\nup behind her.  Shots of Bodhi surfing a monster wave,\nmountain-biking, skydiving, flying an ultralight airplane,\nbungee-cord jumping, cliff diving.\nEvery kamikaze activity in the book.\n\n                         TYLER\n          Bunch of goddamn adrenaline junkies.\n          I hope you're not buying into this\n          banzai-bullshit like the rest of\n          Bodhi's moonies.\n\n                         UTAH\n          What are you talking about?\n\n                         TYLER\n          I've seen that kamikaze look,\n          Johnny.  You've got it.  And Bodhi\n          can smell it a mile away.  He'll\n          take you to the edge... and past it.\n                  (she looks past\n                   Johnny, sees\n                   something)\n          Hey, Bodhi.\n\nUtah turns.  Bodhi is in the doorway.\n\n                         BODHI\n          Johnny has his own demons, don't\n          you, Johnny?\n\nBodhi seems to stare into him.\nUtah breaks the look.  Turns back to the photo gallery.\nBodhi's eyes swivel.  He ponders something.  Looks at\nTyler.\n\n                         BODHI\n          Feel it?\n\nRoach and some of the other surfers appear in the hallway,\nwondering what happened to their leader.  He turns to\nthem.\n\n                         BODHI\n          Gentlemen, it's time.\n\nHOOT AND CHEERS.  Everyone bursts into motion.  Yelling\nand running through the house.\n\n                         UTAH\n          What's goin' on?\n\n                         TYLER\n          Swell's here, Johnny.  Bodhi always\n          knows.\n\nBodhi returns from another room with... AN ALL-BLACK\nSURFBOARD.  It gleams like obsidian.  Near the tip, in\nsmall gray letters it says \"Stealth Fighter\".  Bodhi\nthrusts it into Johnny's hands.\nThe others WHOOP maniacally.\nJohnny feels the challenge.  The pull of the tribe.\n\n                         BODHI\n          Let's go, Utah.  Time for a little\n          stealth mission.\n\n                                            CUT TO:\n\nEXT.  LATIGO BEACH - NIGHT\n\nSIX DARK FIGURES walk toward us out of shafts of light...\nthe headlights of Bodhi's CHEVY 4WD and Tyler's Porsche.\nThe figures are Bodhi, Johnny, Tyler and the other\nsurfers.\nROSIE hangs back with the idling vehicles, tattooed arms\ncrossed.  He puffs on a cigarette.\n\nA WIDE SHOT (MATTE) of the beach shows a pool of light\nfrom the headlights, beyond it a vast silver ocean under a\nblack sky.  The full moon casts the world in cold\nmonochrome.  The little figures reach the sea.\n\n                         ROACH\n                  (a voice in the\n                   distance)\n          Gaping barrels!  Way overhead, man!\n\nCLOSER, as moonlit figures run into the water.\nUtah stands on the beach, hoping his eyes will adjust.\n\n                         UTAH\n          I can barely do this in broad\n          daylight.\n\n                         TYLER\n          Come on.  At least no one's gonna\n          see how bad you are.\n\nJohnny clenches his jaw and charges past her into the\nwater.\nHe strokes powerfully out through the black swell.\n\nUTAH'S EBONY BOARD pierces the wave and he slides down the\nbackside to where the others are waiting.  Roach and\nNathaniel, silhouettes nearby, see one they like and take\noff yelling.\nJohnny turns as a figure glides up next to him.\n\n                         UTAH\n          I gotta be fucking crazy.\n\n                         BODHI\n          Yeah, but are you crazy enough?\n\nGrommet gets a ride, slicing across in front of them.\nA ghost moving off into the silvery distance.\nTyler waves jauntily and takes the next one.  It's\nJohnny's turn.\n\n                         BODHI\n          Football's a man-made game.  You\n          keep score with numbers.  But in\n          this, there's no field, no rules, no\n          opponent.  Just you and the wave.\n\n                         UTAH\n          I know that part.  Tell me something\n          I can use, here.\n\n                         BODHI\n          I've watched you once or twice.  You\n          surf like it's some kind of street\n          fight.  You jerk along from moment\n          to moment, fighting everything that\n          comes at you.  Always trying to win.\n\n                         UTAH\n          A flaw I'm working on.\n\n                         BODHI\n          The only way to win out here is to\n          surrender.  You have to feel what\n          the wave is doing, accept its\n          energy, get in sync.  Just feel it\n          all moving in the blackness... you\n          don't need to see.\n\n                         UTAH\n          Yeah, right, vision is highly over-\n          rated.\n\nBodhi is looking at the lights along the shoreline.\nWithout looking back, he senses the incoming swell.\n\n                         BODHI\n          This one's got your name on it,\n          Johnny.\n\nUtah looks.  Huge glassy face, perfectly formed.  Black\nand terrifying.\n\n                         BODHI\n          Let's go.\n\nBodhi digs in with both hands, driving himself forward.\nJohnny starts grabbing water right behind him.  The wave\npicks them up.\n\n                         UTAH\n          Shit, I'm gonna die.  I'm gonna die\n          now.\n\nJohnny uses the patented Tyler-pop and makes it to his\nfeet.  Suddenly he's going like a shot.\nHe moves back on the board, trims out, slowing down.\nMaintains a fragile control.\nOn pure adrenalized instinct, heart pounding, he falls in\nbehind Bodhi, taking the same line along the roaring black\nface.\n\nBodhi is like the Silver Surfer, ahead of him in the\nmoonlight.\nNot wanting to drop too far behind, Johnny walks a little\nforward on the board.  The nose dips, picking up speed.\n\nJohnny starts letting the speed work for him, learning\nthat he can make long floating turns up and down the\nglassy face.\n\nFeeling the water under his feet, the tons of water piling\nup behind him... feeling its awesome power and borrowing a\nlittle of it.\n\nThe Silver Surfer and the quarterback rocket through the\nnight.\nUtah has a big feral grin plastered on his face.\nBodhi looks back.  Gives him a thumbs up.\nThen he cuts left and drops giddily down to the bottom,\nslashing back and climbing.\nUtah tries it, feels the drop like freefall... feels the\nspeed.\nHe makes his bottom turn, nearly falling.\nThe grin dropping off his face.\n\nHe falls in behind Bodhi again as the wave wraps over them\nlike a great black wing.\n\nTYLER, paddling back out, watches them shoot past her.\nUtah raises his arms above his head and HOWLS like a gonzo\nwolf as they go by.\nShe grins to herself, watching him.\nKnows he's gotten the ride that will make him a surfer for\nlife.\n\n\nEXT.  BEACH PARKING LOT\n\nRosie sits on the sand next to a blazing fire in a cement\nfirepit.\n\nANGLE THROUGH THE HEAT HAZE above the flames.  Tyler\npunches through, a few feet away.  She paddles toward him,\ncoming alongside.\n\n                         TYLER\n          You had enough?\n\n                         UTAH\n          Yeah.  I just want to sit out here\n          for a minute.\n\nHe watches the lights along the shoreline as the gentle\nswell between sets lifts and drops them.  His face is\nsomehow childlike.\nA slow grin spreads itself across his face.\n\n                         TYLER\n          Look at you.\n\n                         UTAH\n          What?\n\n                         TYLER\n          Well, usually you have this sort of\n          intense scowl of concentration, like\n          you're doing this for a school\n          project or something... I don't\n          know, like something's driving you.\n                  (she puts her\n                   fingertip to  his\n                   forehead)\n          See, it's gone.  If I didn't know\n          better I'd say you looked almost\n          happy.\n\n                         UTAH\n          I... I don't know.  I can't describe\n          what I'm feeling.\n\n                         TYLER\n                  (smiling)\n          You don't have to.\n\nHer face seems luminous in the moonlight.  The ocean\nsilver.  The shore a shimmering line of gold.  The sky\nblack velvet.\n\nUtah turns to Tyler, eyes exploring her, as in a dream.\nWater beads on her dark skin like crawling diamonds.\nHe glides closer, holding her board like an uneasy horse\nalongside his.\nHe runs his fingertips down her arm.\n\n                         UTAH\n          Goosebumps.  Come here.\n\nShe leans closer and he rubs his hands up and down her\narms, warming her.  His hands stop on her shoulders.\nHe pulls her to his mouth.  Her tongue meets his.\nShe wants this.\nHe is surprised by the fierceness of her kiss, which\noverwhelms his.\n\nTIGHT ON THE ZIPPER of her shorty wetsuit as Johnny's\nfingers draw it down.  Slowly down, to where it ends\nbetween her legs.\nHe spreads the front and slips his hands inside, along her\nribs.\n\n                         TYLER\n          Those are cold.\n\n                         UTAH\n          Warm them up.\n\nShe moves his strong hand onto her breast.\nHis fingers massage her cold-stiffened nipple.\nShe moans and grabs his wet hair in her other hand,\npulling him into another intense kiss.\n\n\nEXT.  OCEAN - UNDERWATER\n\nLooking up from the bottom,  we see the silhouettes of two\nboards surrounded by pulsing shafts of moonlight.\nCAMERA TILTS DOWN to show the bottom.\nThe dreamlike blue light shimmering on the sand and rocks.\nA big shark browses gracefully, ignoring the lovers.\nTheir moment of harmony with the sea will be honored.\n\n                                            DISSOLVE TO:\n\nEXT.  BEACH - NIGHT\n\nTyler's Porsche stands alone in an empty lot.\nHer surfboard sticks up in back, next to Utah's \"stealth\nfighter\".\nRosie's fire is burning low.\nTyler, half-wrapped in a blanket from the car, straddles\nJohnny on the sand like she straddles her board.  The\nblanket slips down.\nNaked silhouettes in the firelight.\nShe arches her back as they move together in prefect sync.\nGrips his shoulders and stares into his face, her teeth\nbared in a grimace of pleasure that looks like pain.\nShe makes love like she does everything... with honesty\nand intensity.\nUtah, surprisingly, is gentle and slow.\nHe strokes her hair after she collapses onto him.\n\n                                            DISSOLVE TO:\n\nEXT.  BEACH - DAWN\n\nECU JOHNNY as he cracks one eye open, registering the dawn\nlight.\nHe bolts up, looking around.  Tyler is asleep beside him,\nwith the quilt from the car pulled up tight to her chin.\nShe looks radiant in sleep.\nHe grabs his watch out of the sand and looks at it.\n\n                         UTAH\n          Holy shit.\n\n                                            CUT TO:\n\nEXT.  ALLEY BEHIND RAZORHEAD HOUSE\n\nLONG LENS on UTAH'S SEDAN fishtailing through the alley,\nnarrowly missing dumpsters and parked cars.\nHe pulls up next to several unmarked FBI sedans.  No one\nin sight.\n\nUTAH jumps out tucking in yesterday's shirt, stuffing his\nBeretta into his waistband.  He also shoves a small\nleather case into his belt.\n\nUtah pulls open the door to one of the unmarked cars and\nrips a walkie-talkie out of the charging rack on the front\nseat.\nRunning, he passes a gate.  Goes back.  Looks.\n\nHIS POV -- FOUR MEN huddled behind a garage.  COLE, MUNOZ,\nAND TWO OTHER AGENTS.  All with guns and walkie-talkies.\n\n                         UTAH\n                  (whispering)\n          You guys need any help?\n\n                         COLE\n                  (not amused)\n          You're late.\n\nWe hear Pappas' voice over the radio.\n\n                         PAPPAS (V.O.)\n          Did that worthless punk partner of\n          mine ever show up?\n\n                         UTAH\n                  (grinning)\n          Right here, partner.\n\n\nEXT.  STREET - NEARBY\n\nPappas has his shirt hiked up as another agent, BABBIT,\ntapes a microphone transmitter to his stomach.  Pappas\ntalks into his top button.\n\n                         PAPPAS\n          Good of you to join us, hotshot.\n                  (to Babbit)\n          Watch it.  I told you, not on the\n          hairs, goddammit.\n\nBabbit moves the transmitter, putting the tape on\ndifferently.\n\n                         UTAH\n          I'm ready to rock, Angelo.  Where\n          you want me?\n\n                         PAPPAS\n          Cole and Munoz are going in the back\n          door.  Babbit is backing me.  So I\n          want you at the side window by the\n          hedge.  You're strictly backup, got\n          it?\n\n                         UTAH\n          Got it.\n\n                         PAPPAS\n          Awright.  Get into position.  I'm\n          rolling.\n\nPappas pulls the loose Hawaiian shirt down over the radio-\nmike gear and his stalwart .38 snub.\nHe steps out from behind a fence and walks along the\nsidewalk toward Bunker's house, two doors down.  He is\nwearing polyester shorts and sandals, and carrying a DOG\nLEASH.\n\n                         PAPPAS\n          Here Scooby!  Where are you boy?\n          Here Scooby!!  You furball piece of\n          shit.\n\nCOLE AND MUNOZ snap around the corner of the garage and\nsprint low toward the rear of the brown stucco house.\n\nUTAH circles back out through the alley.  TRACKING WITH\nHIM as he makes it to the neighbor's back hedge and crab-\nwalks toward Bunker's house.  BABBIT and ANOTHER AGENT\nmake it to the front corner of the stucco house, staying\nout of sight of the windows.\n\nANGELO is walking up to the falling-down porch of this\nlow-rent roach-hotel.\n\nJOHNNY is elbow-crawling between the house and a tall\nhedge.\nHe slides quietly in below a bedroom window.\nHe pulls out the little leather kit he tucked in his\nwaistband.  Removes something from it.  A DENTAL MIRROR.\nMoving slowly, he raises it above the window sill, angling\nit where he can see inside.\n\nTIGHT ON DENTAL MIRROR, Johnny's POV.\nWe see a bedroom through a gap in the venetian blind.\nTone is lying on the bed, wearing headphones.  Cranked up\nspeedmetal.\nHis eyes are screwed shut, and his fists pump to the beat\nlike karate on 40,000 volts.\nThe door to a bathroom is open, and the black-haired girl\ncan be made out behind rippled shower glass.\n\nTIGHT ON DOORBELL as Pappas rings it.\n\nUTAH JUMPS at an explosion of sound.  He spins in a\nmicrosecond, pistol aimed at... A LAWN MOWER.\nThrough the hedge we can just see THE NEIGHBOR, sixtyish\nand polyester clad, as he adjusts the choke on the roaring\nmachine about two feet from Johnny's face.  Utah exhales\nand lowers the gun.  Wipes sweat from his eyes.\n\nTIGHT ON PAPPAS, smiling open-faced and goofily charming\nas...\n\nTHE DOOR opens, revealing a GIRL we haven't seen before.\nShe has hair like bleached fiberglass, black eye-makeup\nand nails.  Ramones-style wardrobe.  She looks tense, and\nwon't open the door very far.\n\n                         FIBERGLASS\n          Yeah?  What?\n\n                         PAPPAS\n          Have you seen a little dog?  Kind of\n          a cockapoo lookin' thing.  About\n          this big.\n\n                         FIBERGLASS\n          No.\n\nUTAH blinks at what he sees.\n\nHIS POV, in the little mirror.\nLike a silent pantomime under the ROAR OF THE MOWER, he\nsees Bunker and Warchild come flying into the room.\nThey are hyper and manic.  Eyes wild.\nBunker leaps clear over the bed.\nGrabs a COMBAT SHOTGUN from the closet.  Throws it to\nWarchild.  Tone is oblivious.\nBunker thumps him in the chest and Tone leaps up like an\noverwound toy, gaping \"What the fuck?!\" we read his lips\nsaying.\nBunker grabs a STEYR ASSAULT RIFLE, white knuckled, while\nTone fumbles around and comes up with a .45 COLT AUTO.\n\n                         UTAH\n                  (into his headset)\n          Babbit.  Get Angelo out of there.\n          They're pulling out a fucking\n          arsenal!  Babbit, you copy?  Cole?\n          Don't let him pull his badge!\n\n\nEXT.  BACK YARD\n\nCole and Munoz push their earpieces in deeper.  Scowl.\n\n                         MUNOZ\n          Utah, say again.  What?\n                  (to Cole)\n          I can't hear jack shit over this\n          lawnmower.  Christ.\n\n\nINT.  RAZORHEAD'S HOUSE\n\nIn the bedroom, Bunker looks through a slit of door at\nFiberglass.  We hear Pappas just outside.\n\n                         PAPPAS (V.O.)\n          ... and the guy next door said he\n          saw it go into your backyard.  My\n          wife'll kill me if I lose the little\n          bastard.  Me, I could care less.\n          Whole house smells from it's liftin'\n          its leg all the time...\n\nBunker looks like he's on paranoia overdrive.\n\n                         BUNKER\n          Something's goin' down, man.  This\n          ain't right.\n\n                         TONE\n                  (freaked)\n          No, man, it's nothin'.  It's\n          nothin'.\n\n                         BUNKER\n          Will you shut the fuck up!  Check\n          the windows.  Do it!!\n\n\nEXT.  RAZORHEAD'S HOUSE\n\nUtah sucks up against the wall as Warchild looks furtively\nout the window.  We see them both, but Warchild doesn't\nsee Johnny, plastered right below him.\nJohnny closes his eyes and grits his teeth.  Shiiiiittt!\n\nPAPPAS, AT THE FRONT DOOR, is bobbing his head, trying to\nlook inside.\n\n                         PAPPAS\n          You sure he isn't out back?  You\n          mind if I go take a look?\n\n                         FIBERGLASS\n          Look, I don't know anything about\n          your dog, okay--\n\n                         PAPPAS\n          Well is there anyone else here that\n          might have seen him?\n\n                         FIBERGLASS\n          There's nobody else here...\n\n\nINT.  HOUSE\n\nWarchild slams into the wall next to Bunker.\n\n                         WARCHILD\n          There's two guys by the back door.\n          Ducked down.\n\n                         TONE\n          Oh, shit.  Shit!!  We're fucked,\n          man.\n\n                         BUNKER\n          That fat fuck comes through the door\n          I'm gonna pump him up.  Swear to\n          Christ, man, I'm gonna blow the dude\n          up!\n\nScared and vicious, like a cornered dog.  We believe him.\nBunker jacks the bolt on the Steyr.  Warchild cocks the\nshotgun.\n\n\nEXT.  HOUSE\n\nJOHNNY is pissing himself.  He can see it all going down.\nSo fast he doesn't have time to think.\nHe goes into motion -- slipping rapidly along the wall to\nthe next window.\nThe bathroom window.\n\nPAPPAS, AT THE FRONT DOOR, makes his move.\nHe pushes the door open, breaking the security chain, and\njams his FBI shield in the girl's face as he grabs her\narm.\n\n                         PAPPAS\n          FBI, gorgeous.  Now let's take a\n          look around--\n\n\nINT.  HOUSE\n\nBunker's eyes bug out as he sees Pappas coming through the\ndoor.  He snaps the assault rifle to his shoulder.\nSuddenly Johnny is behind him -- half-in the bathroom\nwindow, pistol gripped double-handed like they taught him\nin Quantico.\n\n                         UTAH\n          FBI!!  DROP IT!\n\nBunker whips around.  Squeezing off a wild burst!  B-B-B-\nBLAM!\nIt rips the plaster next to Johnny's shoulder.\nShatters the shower door behind him.  The BLACK-HAIRED\nGIRL screams.\nJohnny flinches, FIRING RAPIDLY.  Wild.\nBunker drops, hit.\nWarchild lets go with the 12 gauge.  KABOOM!\nTakes a chunk like a shark bite out of the doorframe by\nJohnny's head.\nDeafening in the confined space.\nJohnny flattens himself behind the doorframe.\nTone just splits.  Down the hall like a greyhound.\n\nPAPPAS is on one knee, his piece drawn fast, holding\nFiberglass in a neck-lock with one massive arm.\nBunker, wild-eyed and bleeding, is on his knees in the\nbathroom doorway.\nHe raises the Steyr.  Mistake.\n\nAngelo FIRES.  30 years in the field tends to show.\nThree rounds.  Chest.  Chest.  Head.\nBunker is off the planet.\n\nMUNOZ KICKS THE BACKDOOR IN like they do in the movies.\nHe and Cole charge into the rancid kitchen.  Badass FBI\nagents.\n\nJOHNNY, hotwired and hyperventilating, pops out for a shot\naround the doorframe.  He gets a glimpse of Warchild's\nback disappearing into the hallway.  FIRES.  His shot is\nwasted, punching plaster.\n\nSuddenly a pink freight-train hits him.\nHe forgot about the girl in the shower.\nNaked except for her tattoos, she bodyslams him face-first\ninto the wall.\nAs he tries to turn she grabs his hair in both hands and\nhammers his head into the medicine-cabinet -- CRASH --\nshattering the mirror.\nThen she knees him in the balls as he ricochets off the\nwall into her.\nShe drives her elbow into his back as he drops.\n\"FREIGHT TRAIN\" lands knee-first on his gun hand, and\nviciously kicks the pistol away with one bloody foot.  It\nskitters under the bed.\n\nShe's cut up from flying glass.  Demon-eyed and wired, her\nbody lithe and muscular under white skin.  She sprints\nacross the bedroom, leaving Utah slumped, heaving for\nbreath.\n\nIN THE HALLWAY, Tone is hidden behind a doorway.\nWhite-knuckling the forty-five.  A wild-eyed kid with a\nbig gun and not the slightest idea how to use it.\nHe hears footsteps POUNDING behind him and spins.\nIt's Warchild, running with the shot-gun.\n\n                         WARCHILD\n          Move it, man.  Let's get the fuck\n          out of here!\n\nOff-guard, Tone is SLAMMED BY THE DOOR as Munoz drives\ninto it with his shoulder.\nPounded between the door and wall, Tone is wired so tight\nhe pulls the trigger and blows a hole through his own\nright foot.\nHe screams and drops to the floor.\nMunoz sandwiches him with the door and draws down on\nWarchild, who dives into a doorway.\nCole drives past Munoz, who has Tone pinned, and pounds\ndown the corridor.\n\nCole reaches the doorway and goes for the shot on\nWarchild.\n\"Freight-train\" appears behind him from another door.\nShe raises a pair of scissors and drives them into his\nback up to the hilt.\nPulls them out, going for another stab, when--\nPappas spins her around and slams her face-first into the\nwall.\n\nUTAH, in the bedroom, sees Warchild blur across his field\nof vision.\nOn pure instinct, he kicks into overdrive.  Johnny leaps\nthe bed and goes ballistic.  His flying tackle catches\nWarchild at the window.\n\n\nEXT.  HOUSE\n\nThe window EXPLODES OUTWARD in a spray of sunlit glass.\nUtah and Warchild crash to the ground.\nThe razorhead, with 50 pounds on Johnny, rises like a\nbull.\nBleeding from superficial lacerations, Warchild plows\nthrough the hedge.\nJohnny dives after him.\nThe Polyester Neighbor stands paralyzed as the two crazed\nfigures careen toward him.  He is knocked flying, and the\nROARING LAWNMOWER is flipped onto its side.\n\nUtah and Warchild are locked together.\nThe shotgun lies nearby, out of play.\nWarchild jerks a 6 INCH KNIFE free from its sheath,\nhanging from a thong around his neck.  He trusts straight\nat Johnny's throat.\nJohnny deflects the thrust -- INTO THE WHIRLING LAWNMOWER.\nKA-WHANGGG!!!  The knife is hammered out of Warchild's\nhand.\nWhistles away, spinning.\n\nWarchild grabs Johnny as they scramble, and heaves him\nbodily toward the spinning blade.  Utah catches the rim of\nthe mower with both hands, stopping himself inches from\nthe rotor.\nWarchild puts all his weight on Johnny.\nPushing him face-first toward the blades.\nJohnny feels the wind on his face.\nThe engine is roaring, full throttle.\n\nPAPPAS APPEARS BEHIND THEM.\nHe aims the .38.  FIRES TWICE.\nThe little Briggs & Stratton dies young, its casing\nshattered.\nThe rotor spins to a stop.\nWarchild looks up into the black eye of Pappas' gun.\nTwo inched from his face.\n\n                         PAPPAS\n          Speak into the microphone.\n\nThe razorhead sags, the fight going out of him.\nBabbit kicks him off Johnny, face down onto the lawn.\nCuffs him.\n\n\nINT.  BATHROOM - BEDROOM - LATER\n\nUTAH dry heaves over the sink.  Turns the faucet on full\nblast and hoses his head.  He lifts a dripping face, wipes\nwater out of his eyes, stops on the reflection in the\nmirror.  Pappas is there.\n\n                         PAPPAS\n          It's always been lasers and paper\n          targets until today, right?\n\nUtah looks up at him and nods.  He glances through the\ndoorway at Bunker, dead in a pool of blood.  Tone is\nwailing as paramedics work on his foot.  Cole is being\ntaken out on a stretcher.\n\n                         PAPPAS\n          No difference, Utah.  Just a little\n          more to clean up.\n                  (squeezes the\n                   rookie's  shoulder)\n          It's alright.  You did good today.\n\nAcross the bedroom AGENT BABBIT rips the back off a big\nspeaker unit.  Behind it, taped to the woofer, are two\nlarge packets of a white substance.\n\n                         PAPPAS\n          Oh shit.\n\nUtah stares at the dope.\n\n                                            CUT TO:\n\nINT.  POLICE HQ - OUTSIDE INTERROGATION ROOM - NIGHT\n\nTIGHT ON WARCHILD manacled to the chair screaming his head\noff.  We cannot hear him through the glass.  It looks like\npantomime.\n\nUTAH and PAPPAS watch through the one way observation\nwindow.\nTHWAAAAAP!!  The two taped packets slam the wall inches\nfrom Utah's right ear.  Johnny snaps his head around.\nStares into the face of DIETZ who looks like Warchild's\nmeaner brother.\nAnd he's pissed as hell...\n\n                         DIETZ\n          You know what this is?!  Two keys\n          uncut crystal meth!\n\n                         UTAH\n          What the hell's your problem?\n\nDietz manically grabs a clump of his stringy hair.\n\n                         DIETZ\n          You think I like this haircut?  My\n          wife wants me to stay at Ramada -- I\n          been working on these guys for THREE\n          MONTHS!  Finally -- finally--\n                  (nodding to Warchild)\n          -- I get dickwad in there wantin' to\n          play wheel of fortune so I can find\n          out their supplier!\n\nHARP emerges from the interrogation room, we hear a sliver\nof Warchild's battle cry.  He spies Utah.\n\n                         HARP\n          This is agent Dietz, DEA.  He's got\n          a record of your suspect's movements\n          every day for the last three months.\n\n                         DIETZ\n                  (stabbing the air\n                   with the packets)\n          All I wanna know is how are these\n          guys supposed to be holding up\n          Tarzana City National on August 2nd,\n          when they are in Fort-fucking-\n          Lauderdale August 2ND!!!\n\n                         HARP\n          Not an easy thing to do, is it,\n          Utah?\n\n                         UTAH\n          Aw shit.\n\n                         PAPPAS\n          Nice tattoo, Dietz.\n\nWe hear a faint BUZZ, growing louder as we...\n\n                                            CUT TO:\n\nINT.  BEDROOM - UTAH'S APARTMENT - DAWN\n\nThe doorbell BUZZ shrieks through the room.  It stops.\nStarts again.  A ghostly dawn finds UTAH and TYLER\nsleeping peacefully, limbs entwined like vines.\nJohnny's eyes snap open.  Spies the clock.  4:00 a.m.\nTyler stirs beside him, coming out of sleep.\nJohnny wraps a blanket around his waist and staggers to\nthe door.\n\nBODHI stands outside the door wearing a lunatic grin.\nBehind him NATHANIEL, ROACH and GROMMET hoot from the\npickup.\n\n                         BODHI\n          C'mon brah, there's a righteous\n          swell.  Let's go!  Let's go!\n\nTyler comes into the room, wrapped in a sheet.\nUtah sees her knowing smile.\n\n                         TYLER\n          He does this.\n\n                                            CUT TO:\n\nEXT.  BEACH - PREDAWN\n\nVampire morning.  A misty predawn, bled of all color.\nSteel gray tones.  The ocean vanishes in the fog a few\nfeet from shore.\nTyler and Johnny, carrying their boards, walk toward the\nwater.\n\n                         TYLER\n          Come on, Utah.  Everybody's out\n          there catchin' all the good rides.\n\nShe realizes he has stopped ten feet behind her, like a\ngreat weight has dragged him to a halt.\n\n                         TYLER\n          What's wrong Johnny?\n                  (goes back to him)\n          You're like a different person.\n\nHe stares at her.  His expression dark... wrestling with\nsomething.\n\n                         UTAH\n          I am a different person, Tyler.\n\nHe lets out a long breath and looks away, out to sea.\n\nJOHNNY'S POV... the water receding into a backlit wall of\nmist.\nFIGURES APPEAR, faint silhouettes in the fog.\nShades of gray in the gray.\nIN SLOW MOTION they weave hypnotically across the screen,\ntheir shapes merging and unmerging as they cross each\nother.\n\nSTACKED UP BY THE EXTREME LONG LENS, Bodhi, Roach, Grommet\nand Nathaniel crave and slash toward us with mystical\ngrace.\n\nIn SUSPENDED TIME we see them hooting and grinning at each\nother as they cut aggressive moves close to each other.\nDolphins playing.\nChallenging each other in mock combat.\nSo good, their boards slash past each other with inches to\nspare.\nThere is an incredible sense of freedom and exhilaration.\nBonding forged through mastery of this arcane art.\nFor the first time we see the core group of Bodhi's tribe,\nby themselves.  It dawns on us...\nThere are four of them.\nAnd at that moment Nathaniel drops in front of Bodhi,\nlaughing at the near miss, and drops his pants in a nasty\nwig-wagging moon.\n\nTRACKING SLOWLY IN ON JOHNNY staring, mouth open.\nWatching the four horsemen of the Apocalypse ride toward\nhim.\n\nIN SLOW MOTION, BODHI grins as he slashes past Nathaniel's\nshining white butt.\n\nON JOHNNY, as he reacts to the dawning certainty.\nHe feels weak, dizzy... like the ground is moving under\nhim.\n\n                         TYLER\n          Hey.  You okay?  You look like you\n          saw a ghost.\n\nSHOCK CUT -- ANGELO TURNING TOWARD HIM, at the drop car\nscene.  Eons ago.  The sound of his voice ringing...\n\n                         PAPPAS\n          Forget about it, kid, They're\n          ghosts...\n\nBACK TO JOHNNY, as he backs away from Tyler.  Still in\nshock, recoiling from the situation.\n\n                         UTAH\n          I... I gotta go.\n\n                         TYLER\n          Johnny... what's going on?  I don't\n          get it... did I do something?\n\n                         UTAH\n          No.  I'm sorry.  I have to go.\n          I'll, uh... I'll call you later.\n          I'm sorry.\n\nHe sets off running up the beach.\nTyler stares after him.  Confused and hurt.\n\n                                            DISSOLVE TO:\n\nEXT.  PAPPAS' HOUSE - NIGHT\n\nEarly evening.  Utah pulls into the driveway.  When he\nkills the engine we hear Greek music from inside the\nhouse.\n\nAT THE ENTRANCE Johnny finds the door ajar.  He pushes it\nopen a little to reveal--\n\n\nINT.  HOUSE\n\nPappas dancing alone in the living room with his shirt\noff, holding a glass of ouzo.  Facing away from the door\nthe ample Greek hears Utah's tentative knock.  Without\nbreaking from his dance or turning he calls out--\n\n                         PAPPAS\n          Hey, babe.  Get on over here so the\n          big dog can teach ya how to bark.\n\nPappas howls like a bloodhound, then twirls around.\n\n                         UTAH\n          Woof, woof.\n\nWe see the startled Pappas, at a loss for the first time.\n\n                         PAPPAS\n          Johnny!  Uh, you, uh... should call\n          first, you know?  Hey, where the\n          hell were you all day?  You gotta at\n          least call in or something.  You\n          okay?\n\n                         UTAH\n          Angelo, we gotta talk.\n\nPappas moves toward him, kind of subconsciously herding\nUtah back out the door.\n\n                         PAPPAS\n          Listen, uh... if you're okay, can it\n          wait till tomorrow morning, kid,\n          I...\n\nJohnny hears footsteps and turns.\nMiss Deer comes through the door like it's not the first\ntime, carrying a bag of groceries.\n\n                         MISS DEER\n          Angie, they didn't have the kind of\n          wine you like but I got... oh, hi\n          Johnny!\n\nHer icy office persona obviously got left there.  Her hair\nis unbound and flows around her shoulders, and in halter\ntop and jeans she looks delectably off-duty.\n\nAngelo looks at Utah like don't you say a fucking word.\n\n                                            CUT TO:\n\nEXT.  HOUSE\n\nA few minutes later.  Utah and Pappas leaning on his car.\nThe younger agent seems to have regained his hunt-down\nfever.\n\n                         UTAH\n          ... so I started tailing him.\n\n                         PAPPAS\n          This Zen master surfer.\n\n                         UTAH\n          Bodhi, yeah.  I'm on him all day,\n          right.  He goes here, he goes there,\n          he goes to Tower Records and buys\n          come CDs, he has lunch at Patrick's\n          Road House...\n                  (mock casual)\n          ... he goes into the Assured Trust\n          Savings and Loan.\n\n                         PAPPAS\n          Did he rob it?\n\n                         UTAH\n          Cute.  He was inside for about 20\n          minutes.  The other guy, Roach,\n          waited in the truck.  They were\n          scoping it out, right?!\n\n                         UTAH\n          Yeah, or cashing a check.\n\n                         UTAH\n          Wait, wait.  Then these guys go back\n          to their beach house and box up all\n          their shit.  Load it in Bodhi's\n          truck and take it to a public\n          storage unit.  You see?  Summer's\n          almost over.  They're splitting.\n          They're gonna pick up a little\n          traveling money tomorrow.  The next\n          day at the outside latest.  I got a\n          feeling.\n\n                         PAPPAS\n          Last time you got a feeling I had to\n          kill a man, which I always hate\n          because it looks bad on the report.\n\n                         UTAH\n          Angelo... I'm right this time.  We\n          can still win this one.\n\nAngelo looks at the conviction in the other agent's eyes.\nPappas sighs and puts a hand on Johnny's shoulder.\n\n                         PAPPAS\n          Alright, look... banks are closed.\n          Nothing's gonna go down tonight,\n          right?  So we'll be on these guys\n          like white on rice... first thing\n          tomorrow morning.  Okay?  Tomorrow.\n          Okay?\n\nUtah nods.  Then grins.  Pappas starts backing up, like a\nlong rubber band which was stretched taut is pulling him\nback into the house.\n\n                         UTAH\n          Woof, woof.\n\n                                            CUT TO:\n\nEXT.  STREET NEAR BODHI'S HOUSE - DAY\n\nLONG LENS POV scanning Bodhi's house.  There is a \"FOR\nRENT\" sign out front.  The driveway and carpet are\nempty... no vehicles in sight.\n\n                         UTAH (V.O.)\n          They're gone.  Son of a bitch.  We\n          missed them.\n\nUTAH LOWERS HIS BINOCULARS.  He's standing next to the car\nwhile Pappas sits on the hood, sipping coffee from a\nthermos.\n\n                         PAPPAS\n          They're on their way to Maui.\n\n                         UTAH\n          No way.  Not yet.  Come on.\n\nUtah jumps in and starts the car.  Pappas is screwing the\ncap on the thermos.  Johnny puts the car in gear, forcing\nAngelo to scramble in as the car starts to roll.\n\n                         PAPPAS\n          Jesus Christ, kid!  The banks don't\n          open 'till nine.\n\n\nEXT.  CITY STREET - TRAFFIC - DAY\n\nJohnny weaves the sedan among the creeping commuters.\nLong glittering lines and heat waves.\n\n                         UTAH\n          I say we call it in.  Get some\n          backup.  But you gotta do it.  Harp\n          won't listen to me.\n\n                         PAPPAS\n          Sure.  No problem.  I'll just call\n          up and tell him his favorite agent\n          saw this one surfer moon another\n          surfer yesterday and it looked real\n          suspicious.  Shit, he'll probably\n          call out the National Guard.\n\n                         UTAH\n          I say we don't call it in.  Under no\n          circumstance are we to call this in.\n\n                         PAPPAS\n          Look, we handle it ourselves, for\n          right now, okay?  We cover the bank,\n          whatever.  You and me.  That way if\n          nothing happens, or more accurately,\n          when nothing happens... I don't get\n          my tits any further into the wringer\n          than they already are.\n\n                                            CUT TO:\n\nEXT.  ASSURED TRUST SAVING AND LOAN\n\nSLOW PAN from the facade of the bank halfway up the block\nto Utah's sedan in the TIGHT F.G.  Head flopped back over\nthe seat, Angelo snoozes in the hot sun with a sports page\nover his face.  Johnny looks at his watch for the fiftieth\ntime.  Whole lot of nothing going on.\n\nAngelo slides the sports page down to his chin, without\notherwise moving.\n\n                         PAPPAS\n          Time for lunch.\n\n                         UTAH\n          Angelo, it's eleven thirty.\n\n                         PAPPAS\n          That place up the street has\n          meatball sandwiches.  Get me two.\n\nUtah slides out of the car.  Feeling a little exposed he\npulls his Dodgers cap down a little tighter, and adjusts\nhis sunglasses.\nHe trudges off through the sidewalk crowd toward the FAST-\nFOOD STAND nearby.\nPappas pulls the sports page back up to block the sun.\n\n                                            CUT TO:\n\nEXT.  FAST FOOD PLACE\n\nON A LONG LENS, very stacked up, we see Johnny standing at\nthe grody pick-up window.  He keeps looking at the bank,\nvisible B.G.\nThe pick-up window opens and food appears, sliding out.\nUtah turns, pulling out his wallet.\n\n                         VOICE FROM INSIDE\n          Two meatball, one tuna on wheat,\n          two lemonades.  Total's seven eighty\n          four.\n\nAs Johnny is counting out the bills, a BURGUNDY\nTHUNDERBIRD pulls up in front of the bank.  The doors fly\nopen.\nThe Ex-Presidents jump out.\nThey sprint for the entrance.  All this OUT OF FOCUS, B.G.\nJohnny misses it as he picks up the food order.\nThe Presidents disappear inside.\nJohnny looks toward the bank again.  There is no movement.\n\nREVERSE, as Utah walks back toward his car.  Pappas is\nstill under the paper.  He slides it down when he smells\nfood.\n\n                         UTAH\n          Here, yours is the one that looks\n          like a road kill.  Enjoy.\n\nUtah throws a big stack of napkins through the window into\nPappas' lap.  Still standing next to the car.\n\n                         UTAH\n          Here's your lemonade.\n                  (he looks down the\n                   street)\n          Did you see that T-Bird pull up?\n\nPappas pulls a disgusting mass from the bag, unwrapping\none end.\n\n                         PAPPAS\n                  (without looking)\n          Damn, I could eat the ass out of an\n          elephant.  I shoulda had you get me\n          three a these.  What T-Bird?\n\nPappas is about to take a huge bite when a meatball falls\nout of the end of the sandwich.  It lands on the seat next\nto him.\nHe looks at it.  Picks it up.  Pops it into his mouth\nand--\nFreezes, mouth open.  Eyes focused on...\nThe Ex-Presidents, in living color, flashing through the\ndoors of the bank 80 feet away.\n\nJohnny is so astounded he doesn't do anything for about\ntwo seconds.  Pappas coughs out his meatball, eyes\nbugging.\n\n                         PAPPAS\n          Jesus Christ!!  It's them!\n\nThe Presidents are piling into the car.\nJohnny reacts characteristically.  He whips out the\nBeretta and yells--\n\n                         UTAH\n          FBI!!  Freeze!!  Right now!\n\nNIXON spins, raising his shotgun.\nBut Reagan knocks the muzzle down with his hand.  Shoves\nhim into the car.  Then Reagan jumps behind the wheel.\nThe back wheels light up, smoking, as the T-Bird launches.\n\nUtah FIRES.\nBLAM!  BLAM!  BLAM!\nHe puts two into the trunk and blows the back window into\njunk jewelry.  The T-Bird peels out into traffic, clipping\na Subaru which locks them up and spins.\n\n                         PAPPAS\n          Come on, kid, get in the car!\n          Jesus!\n\n\nINT./ EXT.  SEDAN\n\nPappas reaches across, starting the engine as Johnny jumps\nin the driver's side.  Utah buries the throttle into the\nfirewall and charges aggressively through the medium\ntraffic.\nTheir sedan slews around the back of an eighteen wheeler,\nfishtailing.  It straightens out.  No T-Bird in sight.\n\n                         UTAH\n          The hell are they?!\n\n                         PAPPAS\n          They took a left at the next light!\n\n                         UTAH\n          You sure?!\n\nUtah is totally wired.  Totally concentrated.  The\nadrenalin is kicking in, flashing through his system.  His\nbrain is on turbo boost, reacting a thousand times a\nsecond as they hit sixty through the traffic, which seems\nto be standing still.\n\n                         UTAH\n          I got 'em.  I see 'em.  I'm on it,\n          I'm on it.\n\nHigh-speed slalom through cars and trucks.\nThe world passes by in a hysterical blur.\n\n                         PAPPAS\n          You even watching the road?\n\nA car pulls out, straight ahead.\nUtah swerves wildly, mostly gets around him.  The guy's\nbumper and front grille are removed.  Utah does a smoking\nskid-recovery.  Doesn't even slow down.\n\nThe late model T-Bird is weaving manically.  It makes a\nsliding turn onto a cross street half a block ahead of the\nFBI agents.\n\nUtah cuts the wheel into a huge Ralph's parking lot.\nPedestrians scatter.  Utah center-punches a week's supply\nof groceries in a cart.\n\n\nINT./ EXT.  T-BIRD\n\nThe Presidents hold on desperately as Reagan white-\nknuckles it through civilian traffic.  They're looking all\naround, trying to see where Utah went.\n\n                         LBJ\n          Where are they, man?  I don't see\n          'em.  We lose 'em?\n\nNot exactly... THROUGH THE WINDSHIELD we see an airborne\nUtah hurtling from a Ralph's entrance.  The sedan lands on\nthe street, tearing chunks out of the asphalt with the\nundercarriage.\nAn instant later it hammers into the side of the T-Bird.\n\nThe two cars spin out of control.  Utah cuts the wheel,\nslamming into them again.  Side by side demolition derby.\nWHAM!!  Utah hits them again.  The Presidents lose\ncontrol, jumping a curb, losing the right front tire in\nthe process.\n\nUtah's car starts to swap ends.  Hit the center island\nbroadside.\nThe sedan flips onto its back in an explosion of glass.\nSCREECH of steel on concrete as it comes to rest.\nHanging upside down, Pappas is mightily pissed off.\n\n                         PAPPAS\n          Nice fuckin' work, hotshot.\n          Christ!\n\nThey can see the T-Bird still moving.\nIt slews drunkenly as the driver maintains speed on\nflapping rubber.\n\nJohnny shimmies out of the wreckage, sliding on his back\nin broken glass.  Pappas is packed in, upside down,\nwriggling to get out through the side window.  A tight\nfit.\n\n\nINT./ EXT.  T-BIRD\n\nThe Presidents are hammered up and down by the flailing\ntire.\n\n                         REAGAN\n          Emergency sanitization!  Here we go!\n\n\nEXT.  GAS STATION\n\nThe T-Bird vaults into the parking lot and slides to a\nsmoking stop at one of the pump islands.  The Presidents\nexplode out of the car in a blur.\n\nReagan bodyslams a TEENAGER putting gas in his MUSTANG.\nHe flips his big pistol to LBJ as the other Presidents\ncharge past him.  Nixon jumps behind the wheel of the\nMustang.  LBJ and JFK pile in.\n\nReagan grabs the gas nozzle out of the car.\nHe pulls out a ZIPPO LIGHTER.\nReagan raises the gas nozzle like a gun and holds the\nzippo below and slightly in front of it.  He flicks the\nflame.\nThen pulls the trigger on the nozzle.\n\nLike an impromptu flame thrower, the nozzle spews A TWENTY\nFOOT JET OF FIRE which engulfs the T-Bird in an instant.\nAny physical evidence in the car is rapidly incinerated.\nCustomers are running, screaming.\nNixon has the Mustang fired up.\n\n                         NIXON\n          Let's go!  Move it, Ronny!\n\nRonny's eyes sparkle behind his mask as he paints the\nscene with the jet of fire.  You can see it getting good\nto him.  In a second he's going to blow up the whole\nblock.  But he's getting his rocks off.  He sets two other\ncars on fire.\n\nA FIGURE BLURS INTO FRAME.\nIn a flying tackle, Utah catapults Reagan off his pins.\nThey roll, skidding across the oily concrete.\nSpraying wild, the fire swirls around the pump island.\n\nOut of the black smoke, PAPPAS charges like an angry bull,\nhis snubnose held high.  NIXON sees him and floors it.\nThe Mustang smokes out of the gas station as Pappas' shots\nblow out the back window.\n\nUtah and Reagan roll away from the blaze.  Johnny's pants\nare burning.  He gets to his knees in time for Reagan's\nkick to take him square in the solar plexus.  He folds in\nhalf.  Drops to the cement.\nReagan kicks him again and takes off running.\nThe President is burning.\nHis suit jacket is ablaze.  He shucks out of it as he\nruns.\n\nGasping, Johnny rapidly slaps his jeans.  Puts himself\nout.  He comes up running, pulling his Beretta.  Sees the\nback of Reagan's head disappearing into an alley behind\nthe gas station.\n\n\nEXT.  ALLEY\n\nA non-descript L.A. alley... commercial buildings on one\nside, walled suburb on the other.  Two men running all\nout.\nA recent President and a wild-eyed cop trailing smoke like\na crashing jet fighter.\n\nBeyond the buildings behind them A FIREBALL EXPLODES\nSKYWARD.  We hear sirens and shouting, which recede as the\ntwo pelt along the alley.  It gets quieter.  Just the\nmachine-gun slap of the shoes on pavement, and the hard\nbreathing of the two men, each in overdrive, going all out\nin long blurring strides.\n\nREAGAN looks back.  Sees the demon cop behind him,\ngaining.\nUtah has become an engine, a running machine... juggernaut\nmode.\n\nAHEAD OF THEM a BLACK AND WHITE swings into the alley.\nReagan hangs a hard left and blasts a wooden gate half off\nits hinges.  Utah whips through the gate a second later.\nDiving into suburbia.\n\n\nINT./ EXT.  NEIGHBORHOOD - FOOTCHASE SEQUENCE\n\nIt becomes a blur.  Pure kinetic energy.  Two meteors\nrocketing through a low-rent suburb.  And God help anyone\nwho gets in the way.\n\nReagan crosses a cluttered backyard.\nBroken field run through toys, swing set, stacks of god-\nknows-what.\nHe runs through a Mr. Turtle Pool in an explosion of\nspray.\nCrashes through a hedge.\nThrough the narrow gap between houses.\nUtah powers into the tight space behind him.\nBlurring along between stucco walls.\n\nThey emerge into the front yard.\nA WOMAN watering her lawn is so surprised she yelps and\nfalls down.\nReagan and Utah both hurdle her.\n\nAHEAD, KIDS ON BIKES, racing along the sidewalk.\nReagan dodges the first, Utah slams into the next two.\nHe crashes, rolling, tangled up in bikes and squawking\nteenagers.\nHe comes out of a pile-up somehow still in high gear.\n\nReagan flashes across the sunlit street.\nDodges in front of a GARBAGE TRUCK which locks up the\nbrakes.\nIt stops so fast, one of the guys falls off the back.\nThe GUY is getting up as Utah whips around the back of the\ntruck.\nKnocks him sprawling.\nUtah doesn't stop.  Doesn't look back.\nLike he doesn't see anything in the real world but the\nfigure running ahead of him.  Like it's some kind of\nhyperkinetic video game.\n\nEverything is a blur.  Suburbia smeared into staccato\nimpressions.\nThe house across the street is blocked by fence on both\nsides.\nA MAN is picking up his mail.\nReagan pounds past him.  Right through the front door of\nthe house.\nUtah follows.\n\nPanting as he sprints down a dark hallway.\nA WOMAN with a basket of washing SCREAMS as Reagan blasts\npast her, knocking her flying.\nUtah leaps over her sprawled legs.\nCats blur underfoot.  Utah crunches down on a tail.  A CAT\nEXPLOSION.  Screeching merges with the woman's shrill\nshouts as Utah slams the back screen door off its hinges.\n\nAcross the back yard.  Fence.  Over it.  Running on.\n\nREAGAN looks back.\nSees Utah still behind him like in a bad dream.\nHe enters the next house.  Sliding glass door.\nUtah sees Reagan pull it closed.  Locking it.\nWithout breaking stride Johnny grabs a potted plant off a\npatio wall.\nHeaves it ahead of him.\n\nThe glass BURST INTO A WALL OF DIAMONDS.\nUtah blasts through a microsecond later.\nTopples the kitchen table.  Furniture and crockery\ncrashing everywhere.\nHe sprints down a hallway after Reagan.\nA FIERCE WOMAN in a housecoat shouting at them as they\npass, holding a vacuum cleaner like it's shot-gun.\n\n                         WOMAN\n          Get the fuck out of this house!\n          What the fuck do you think you're\n          doing--\n\nAround a corner.  A VICIOUS SNARLING SOUND.\nUtah sees something flying at him.  Reflexively catches\nit.\nReagan has thrown a PIT-BULL.\nThe Fierce Woman's fierce dog.\n\nUTAH'S POV -- the snarling little demon right in his face.\nHe drop-kicks it like a goddamn field-goal right through a\ndoorway and runs on.\nAnother door.  Another explosion of sunlight.  Another\nyard.\nSprinklers this time.  Reagan and Utah running through\nsunlit walls of rain.  They crash through another hedge.\nEmerging drenched.\n\nThe ground drops away.  Slipping and sliding on iceplant,\nthey skid down a steep slope.  Reagan reaches bottom.\nA TEN FOOT RETAINING WALL, dropping off like a cliff to\npavement below.\nReagan falls, landing on his feet.\nPanting now, feeling it, he stumbles up and runs on.\n\nUtah rips down through the iceplant like a human\nlawnmower.\nSlides over the edge.  Falls -- lands hard.\n\nTIGHT ON HIS KNEE and SLOW MOTION.\nTaking the impact.\nWe HEAR something go.\nUtah crashes to the pavement, his face contorted with\npain.\nHe grabs his tortured knee with both hands.\n\n                         UTAH\n          Not now.  Not now!\n\nReagan runs on.  They are in an enclosed storage yard of\nsome kind.  Ten foot chainlink all around.\nUtah struggles to get up and run.\nHe sprawls forward, biting back a howl of pain.\nWe see the incredible will driving him on.\nHe gets up and again, hobbling.  Trying to run.\n\nReagan reaches the fence.\nHe is heaving for breath.  Holding his side.\nUtah stumbles, gets up, clutching his knee.\nHobbling forward.  His eyes wild, the veins in his neck\nbulging.\n\nReagan starts to climb.  Utah collapses to his knees.  He\ncan't go on.\nReagan reaches the top of the fence.  He looks back.\n\nUTAH HAS THE BERETTA POINTED RIGHT AT HIM.\nTwenty feet away.  The muzzle rock-steady.  He can't miss.\nThey both are frozen, panting.  Locked into the moment.\n\n                         REAGAN\n          You want me, there's only one way.\n\nPAPPAS reaches the top of the hill, 200 feet away, panting\nlike he's about to collapse.  He sees the tableau.\n\nECU -- UTAH'S FINGER on the trigger.  Tightening.\nRACK TO his eyes.  Blinking, water running into them.\nGod, he wants to.\n\nECU -- REAGAN'S EYES, through the mask.  Locked with\nUtah's.\n\nUTAH suddenly snaps his hand up and FIRES VERTICALLY.\nHE HOWLS WITH RAGE, FRUSTRATION AND PAIN.\nFIRES AGAIN.  And AGAIN.\nSlumping back, his shoulders slam down onto the concrete.\nStraight-arming the Beretta he FIRES RAPIDLY...\nBulleting the blue sky.\n\nHIGH ANGLE, looking straight down on the tableau.\nReagan leaps off the fence and runs OUT OF FRAME, as Utah\nempties the magazine straight at us, the shots merging\nwith his agonized howl, echoing as we--\n\n                                            CUT TO:\n\nINT.  FBI BUILDING - BULLPEN - NIGHT\n\nUTAH sits next to the DISPATCHER waiting for news like a\nsailor in a storm.  His leg is popped up on a chair with\njeans split to the thigh and an ace bandage wrapped around\nhis knee.\nHis face is a nasty patchwork of scratches and bruises.\nHe drains his coffee and gazes out at the empty bullpen.\n\nPAPPAS comes through the doors, wiping the remains of\ndinner off his mouth.\n\n                         PAPPAS\n          Nothing?\n\n                         UTAH\n          Nothing.\n\nThe Dispatcher talks into his headset, glances up at\nPappas, shakes his head.\n\n                         PAPPAS\n          Go home, kid.  Get the hell outta\n          here.  Get some sleep.  You look\n          like shit.  They get anything even\n          resembles your guy, I'm on your\n          beeper.  Here.  You like feta?\n\nHe smiles warmly, handing his younger partner a brown\npaper sack.\n\n                         UTAH\n          Feta.  My favorite.\n\nManaging a weary smile.  Lifts his body out of the chair,\nturns to go.\nAngelo ponders something.\n\n                         PAPPAS\n          Johnny...\n\nUtah stops.  Looks back at the man.\n\n                         PAPPAS\n          All I wanna know is one thing, why\n          didn't you just take the shot?\n\nJohnny's gaze turns inward.\n\n                         UTAH\n          I don't know.\n\n                                            CUT TO:\n\nINT.  BATHROOM - UTAH'S APARTMENT - NIGHT\n\nUTAH sits on the bathroom floor as Tyler dabs Betadyne\nantiseptic over his wounds.  Utah cringes.\n\n                         UTAH\n          Ouch.\n\n                         TYLER\n          Betadyne doesn't hurt.\n\n                         UTAH\n          You're kneeling on my hand.\n\nShe laughs, shifts her weight and keeps tending him.\n\n                         TYLER\n          So what'd the other guy look like?\n\n                         UTAH\n          Never saw him, was your basic hit\n          and run.\n\n                         TYLER\n          But you look like you been in a\n          train wreck, how'd he just drive\n          away?\n\nUtah acts like he wants to say something but his mouth\nwon't quite form the words.  Tyler dabs his face, touches\na finger to his forehead.\n\n                         TYLER\n          Johnny, what is it with you?  You\n          have that look again, it's like\n          you're about to tell me something\n          and then you don't... or you can't.\n          What's going on?\n\nJohnny searches her eyes.\nShe stares at him, becoming fragile suddenly.\n\n                         TYLER\n          What?  What do you want to tell me?\n\nUtah's brow unfurls.  The thought has passed.  He slowly\ncups his hand over hers.  Gently pulling her close.\n\n                         UTAH\n          I'm glad you pulled me out of the\n          water that day...\n\nHe presses his lips to the smooth curve of her forehead.\nA kiss to each downcast eye.  Searching out her mouth with\nhis own as his hands glide down the small of her back.\nTheir reflection in the mirror as Utah slowly lowers Tyler\nto the bathroom floor.  She clings tightly in a breathless\nkiss.\n\n\nEXT.  CLIFF - NIGHT\n\nA Buddha in the moonlight, BODHI sits crosslegged upon the\ncliff, staring at the ocean.\nCAMERA CIRCLES AROUND HIM, focusing in upon his eyes.\n\n                                            DISSOLVE TO:\n\nINT.  BEDROOM - NIGHT\n\nUTAH asleep, flopped in a spread-eagled X.\nWE HEAR the bedroom door opening, see a slash of light\nfall across the bed.\nJohnny doesn't stir.\nA shadow appears on the wall, moving toward him.\nAn outstretched arm holding a gun.\nUtah snores softly, sleeping like a baby.\nCAMERA TRACKS IN on his peaceful face.\nA single eyelid flutters.  Total silence, until...\n\nKABOOOOMMM!  The Pillow beside him EXPLODES into a\nblizzard of goosedown.  Johnny rears up, eyes wide, mouth\nagape.\nTYLER stands above him, recovering from the kick of the\nsmoking 9mm Beretta in her hand.\n\n                         TYLER\n          A lawyer!?  You lied to me!\n\nShe throws his FBI gold star at his face.\n\n                         TYLER\n          Look, Tyler, I can--\n\nBOOM!  Tyler SQUEEZES off another round.\nCascading goosefeathers falling like snow.\nUtah flinches sideways.\n\n                         TYLER\n          Jesus Christ, Johnny -- you've been\n          using me!  Your jacket's on the\n          floor in the bathroom -- this\n          goddamn thing's half out of the\n          pocket... Oh God, it's all part of\n          some case, isn't it?\n\n                         UTAH\n          Tyler, put the gun down.\n\n                         TYLER\n          You tell me the fucking truth\n          Johnny... did your parents really\n          die in a car crash?  DID THEY?!\n\nShe waves the Beretta in his face.\n\n                         UTAH\n          No.  They live in Columbus Ohio.\n\nTyler lowers the pistol slowly, the strength leaving her.\nHer face begins to flood with tears.\n\n                         UTAH\n          I work bank robbery.  Guys I'm after\n          are surfers.  I needed you, at\n          first, but not--\n\n                         TYLER\n          Fuck you, Johnny Utah.  Fuck you!!\n          Don't you have a soul?  Goddamn you\n          to hell!\n\nShe goes limp as the sobs rack her body.  The gun flops\nfrom her grip.\nUtah sweeps it under the bed with his foot.\nHe moves to gently comfort her.\nShe bolts at his touch, running from the bedroom.\nUtah is up and hopping into his pants to follow her.  He\nstumbles.\n\n                         UTAH\n          Tyler!  Wait!!\n\nFrom the living room we hear a rattling of keys, the front\ndoor opens and slams shut.  He hobbles to the door,\nfavoring his knee.  Opens it.  We hear the Porsche\nscreeching away.\nUtah sags, the breath coming out of him long and slow.\n\n                                            CUT TO:\n\nUTAH on the bed staring up at the ceiling.  Phone cradled,\nlistening to--\n\n                         TYLER (V.O.)\n          Hi, it's me.  Leave a message.\n\nBEEP!  He rests the telephone on his chest, letting the\ntape roll a moment before he speaks.\n\n                         UTAH\n          Tyler I... look, I fucked up, okay.\n          I know I fucked up.  I wanted to\n          tell you, but I couldn't -- I was\n          afraid you'd leave... good guess,\n          huh?\n                  (grimacing)\n          Fuck, why can't I ever say what I\n          really mean?  I lied to you.  I'm an\n          asshole... but I need you, Tyler.  I\n          want you to know that I've never\n          known anyone like you before in my\n          life... and I... I hope you change\n          your mind...\n\nHe cradles the receiver, looks out the window.  Black of\nnight.  Dead still.\n\n                                            DISSOLVE TO:\n\nUTAH asleep, telephone still perched on his bare chest.\n\nBUZZZZZZ!  The rasp of the doorbell.\nJohnny is airborne, phone flying across the floor.\nHunting for his pants, realizes they are already on, limps\nin fast motion to the door.\n\n                         UTAH\n          Tyler!  Wait, I--\n\nWhips it open.\nBODHI standing in the doorway, smiling like an excited\nchild.\n\n                         BODHI\n          Howdy brah.\n\nNATHANIEL, ROACH, and GROMMET are there behind him.\nThey look like sentry dogs.  Johnny freezes.\nBodhi walks past Utah, into the room.\n\n                         BODHI\n          C'mon, get your gear on, we're\n          rollin'.\n\nCheerful, hardly able to contain his exuberance.\nHe moves through the room, grabbing Johnny's shirt from a\nchair, a pair of sneakers on the floor.\nUtah sees his FBI shield sitting on the dresser in plain\nsight.\nHe palms it when Bodhi is turned away, and slips it into\nhis hip pocket to conceal it.\n\n                         UTAH\n          What going on, Bodhi?\n\nBodhi plucks a couple socks off the couch, hands them to\nUtah.\n\n                         BODHI\n          Here.\n                  (spying Johnny's cut\n                   face)\n          Hey, what happened?  Ya cut\n          yourself shaving?\n\nJohnny meets Bodhi's cold stare.\n\n                         UTAH\n          I don't think I wanna surf right\n          now.\n\nBodhi's face takes on a crazy glow.\n\n                         BODHI\n          Naw, this is different, Johnny.\n          This is something totally\n          different... you're gonna love this.\n\nHe winds an arm around Johnny's shoulders, guides him\ntoward the door.\n\n                         BODHI\n          C'mon, let's go, let's go.  Time's\n          wastin', brah.\n\nBodhi claps Utah on the back, ushering him outside.\nNathaniel, Roach and Grommet fall into step beside them.\nThe door closes behind them.\nCAMERA DRIFTS back through the apartment, coming to rest\non the 9mm Beretta, on the floor under the bed... useless.\n\n                                            CUT TO:\n\nEXT.  BODHI'S PICKUP - PREDAWN\n\nThe pickup is a funnel of dust along the desert road.\nBlack mountains against a silver sky.\n\n\nINT.  BODHI'S PICKUP\n\nThe tapedeck blasts.  BODHI and UTAH sit inside the cab.\nThrough the rear window, we see NATHANIEL, ROACH and\nGROMMET in the flatbed.\nBodhi swivels his eyes to Johnny, lowers the volume.\n\n                         BODHI\n          Life's sure got a sick sense of\n          humor, don't you think so Johnny?\n\nFace splitting into a shit-eating grin.\n\n                         UTAH\n          How you figure?\n\n                         BODHI\n                  (slight laugh)\n          News, last night... those guys, the\n          Ex-Presidents... they robbed my bank\n          yesterday.  And I was just there the\n          day before, cashing a check.  See...\n          look.  Assured Trust... same place.\n\nHe takes a beat up checkbook off the dash and flips it to\nJohnny.\nUtah opens the cover and looks.\nSure enough.  Assured Trust Savings and Loan.\n\n                         BODHI\n          I was picking up some bucks cause\n          we're leaving town.  Bizarre, huh?\n          If I'd waited a day I'd been right\n          in the middle of it.  Kinda sorry I\n          missed it.  I'd liked to've seen\n          them.\n\nA long pregnant pause.  Utah breathes deeply, remaining\ncalm, his voice carrying a chilling bravado.\n\n                         UTAH\n          Takes guts to rob a bank.  All that\n          adrenalin pumping, waving loaded\n          guns, taking out the guards, getting\n          everybody on the floor, never\n          knowin' who's gonna burst in...\n                  (looks right at\n                   Bodhi)\n          ... wondering what it's like to take\n          a bullet.  Must be some ride.\n\nUtah's smile is a personal challenge.  Bodhi sits\nperversely intrigued.  The mental warfare escalates.\n\n                         BODHI\n          Banks are insured, brah.  Long as\n          nobody gets shot, it's really a\n          victimless crime.  Just gotta scare\n          'em a little, would be my guess.\n                  (ponders something)\n          Now if I was gonna rob a bank, with\n          all those guys wearin' body armor\n          these days, know what I'd carry?\n\nBodhi reaches his hand underneath the seat.\nHe pulls out a huge holstered handgun, rests it in his\nlap, draws and holds the gun up against his cheek.\n\n                         BODHI\n          .454 Casull.  Most powerful handgun\n          on the planet.  Muzzle velocity of\n          2000 feet per second.  Twice the\n          kinetic energy of a .44 Magnum.\n\nBodhi stares at Utah, then flashes his signature smile.\nUtah says coldly.\n\n                         UTAH\n          One shot stopping.\n\n                         BODHI\n                  (laughs)\n          'One shot stopping'... good, very\n          good.  I like you, Johnny.  I like\n          you because you'll sacrifice\n          anything to win.  I respect that.\n          It elevates you a little above the\n          drones who have learned compromise.\n          Here, hold it.  Check out the\n          weight.\n\nHe twirls the gun, grabs the barrel and extends the handle\nto Utah.\nJohnny takes it slowly.  Now it's aimed at Bodhi.\n\n                         BODHI\n                  (cheerfully)\n          Whoa.  Careful.  You got the muzzle\n          pointing right at me, brah.\n\nHe casually pushes the barrel away, looking back at the\nhighway.\nJohnny swings a stiff arm out his window and pumps a ROUND\ninto open desert.  KABOOOM!!  The recoil blows Johnny's\narm back over the top of the truck.  Practically breaks\nhis wrist.\nThunder rolls across the dark hills.\nFrom the back of the pickup Nathaniel howls.\nGrommet and Roach high five.\n\nJohnny turns to Bodhi, breaking slowly into a feral grin.\n\n                         UTAH\n          Nice.\n\nHe hands the smoking weapon back to him.\nAs if to say \"two can play this game\".\nBodhi stands challenged.\nEach snared in the other's power...\nBodhi takes the weapon back, casually.  Slips it under the\nseat.\n\n                         BODHI\n          It's a special day, Johnny U.  A\n          very special day...\n\nUtah's gaze travels beyond the windshield.\nWhere tentacles of brand new morning light vein the sky.\n\n                                            CUT TO:\n\nEXT.  DESERT AIRSTRIP\n\nTIGHT ON A turbo-prop engine ROARING.\n\nWIDER reveals a big Cessna twin.  The PILOT, a weaselly\nguy we haven't seen before, fires up the second engine.\nThe plane shudders eagerly in the metallic predawn light.\nA desert airstrip near Palmdale.  A couple of aluminum-\nsiding hangers and no tower.  A few other planes around\nbut no activity besides Bodhi's rock-steady crew.\n\nUTAH watches Grommet whip back a tarp in the bed of\nBodhi's truck and starts tossing out PARACHUTE PACKS.\nRoach tosses one to Bodhi, who chucks it to Utah.\n\n                         BODHI\n          Ever done this before?\n\n                         UTAH\n          Once.\n\n                         BODHI\n          Pure adrenalin, right?!  The\n          ultimate rush.  Other guys snort for\n          it, jab a vein for it -- all you\n          gotta do is jump.\n\n                         UTAH\n          Sure, it's a blast, but listen, I\n          sorta screwed up my knee yesterday--\n\n                         BODHI\n          Yeah, I noticed you limping.\n                  (grins)\n          But don't worry about it, brah.\n          Don't worry at all.  We're not gonna\n          land on land!\n\nBodhi grabs his sleeve, ushering him into the plane.\n\n                         UTAH\n          Oh, well, that's fine then.  I feel\n          so much better.\n\n                                            CUT TO:\n\nINT.  CESSNA\n\nUtah sits, wearing a day-glo jump suit, hugging the chute\nin his lap.  Next to him is the gaping door.  Beyond... a\nspectacular down sunburst at 10,000 feet.  ROAR of wind\nand engines.\n\nUtah watches Bodhi, Nathaniel, Grommet and Roach wriggling\ninto their colorful freefall suits.  Nathaniel pulls on a\npair of purple shorts over his suit.  Looks real dorky.\nGrommet has on duck feet.  Bodhi, apparently, is going to\njump barefoot.\nNobody has their chutes on yet.\nJohnny hefts his, as if weighing it, somehow judging the\ncontents.  His brain is racing.  Bodhi shouts over the\nroar.\n\n                         BODHI\n          It's a little ceremony we always\n          have at the end of summer.  One last\n          speedstar.\n\n                         UTAH\n          So, who... uh, who packed my chute?\n\n                         BODHI\n          I did.  What's the matter?  Don't\n          trust me?\n\n                         UTAH\n          You gotta earn trust.\n\n                         BODHI\n          Then we'll earn it together.  Here,\n          take mine.\n\nBodhi swaps chutes with Johnny.\nUtah looks at the new chute uncertainly.\nIs this a game?  Poker moves?\nDid Bodhi anticipate this step?\n\n                         ROACH\n          Hey... you don't want Bodhi's, man.\n          His pack-jobs suck... they only open\n          half the time.  Take Grommet's, man.\n\nRoach's grin is evil as he grabs Grommet's chute out of\nhis hands and switches it with Johnny's.  Keeps that one\nand gives his to Grommet.\n\n                         GROMMET\n          Whoa, unfair, dude!\n\nGrommet grabs his chute back and hands Johnny the one he\nhad, which was Roach's.  I think.\nJohnny looks at the pack in his hands.  Then at the\ngrinning faces.\nRussian surfer freefall roulette.  Shit.\nBodhi studying him.  Some kind of test.\nFuck it.  Utah starts putting the damn thing on.\n\n                         UTAH\n          We gonna jump or jerk off?\n\n                         BODHI\n          My man!\n\n\nEXT.  10,000 FEET - DAWN\n\nMulti-colored figures explode from the plane.  Leaping\ninto freefall.  Tumbling end over end.\nWEARING HEADSETS, they hurtle downward.\n\n                         BODHI (RADIO)\n          Utah, you copy bruddah?\n\n                         UTAH (RADIO)\n          Whoooaaah!  Shhiiittt!  Whoooaaah!\n\n                         BODHI\n          I'll take that as a yes.\n\nOne by one they stabilize.  Falling face down, knees bent,\nthey angle their hands and feet minutely to move\nlaterally.  Utah flails, the last to trim out.  But he's\nholding his own.\n\nGrommet, working his duckfeet, pitches himself into a wild\nspin, rotating like a dervish in a head down dive.  He\nflares out and \"flies\" back to the others.\nRocketing through the void at 120 mph they seem to\nparadoxically hang above the world, almost unmoving... on\na separate plane of existence.\nA hurricane of wind.  Wild HOOTING.\nDespite his terror, Johnny has to grin at Nathaniel,\nfalling butt first like he's sitting on a big inner tube\nin the pool.\n\n                         ROACH\n          Whip it out dudes!  Cheap sex with\n          the cosmos!\n\n                         BODHI\n          Ten thousand feet.  Let's do it.\n\nThe group stabilizes, moving together.\nFirst Bodhi and Roach link arms, trimming constantly.\nConcentrating.  Nathaniel flips over onto his stomach and\nmaneuvers toward them.  He grabs Roach's arm.\nGrommet works his way next to Nathaniel.  Locks in.\nThey need Utah to complete the ring.\nFour faces beckoning to him, distorted by the hurricane\nwind.\n\n                         BODHI\n          Come on Johnny.  Get in here!\n\nJohnny moves his hands like flippers and glides clumsily\ntoward them.  Bodhi and Grommet grab him.  He's in.\nA perfect five-man star.\n\n                         BODHI\n          Relax, brah.  I got you, I got you.\n\n                         GROMMET\n          Righteous-ass speedstar, dudes!\n\n                         BODHI\n          You diggin' this?\n\n                         UTAH\n          Great!  GREAT!\n\nJohnny is exhilarated more than he could have thought.\nScreaming down through the dawn sky at 130.\nLocked into the ring.  Part of something.\nConnected to these guys far above the planet.\nLess far every second... Bodhi's chest altimeter reads\n6,000 feet.\n\n                         BODHI\n          Purty-thirty and we're meat waffles,\n          folks.  See ya downtown!\n\nHe releases Roach's arm and the star disintegrates,\ndrifting apart.\nBodhi stays with Utah, falling parallel to the horizon,\nfacing each other, holding hands.  4000 feet.  Airspeed\n140.\n\nGrommet pulls his ripcord.  He seems to be jerked upward\nby a great force.  Suddenly he is far above, a brightly\ncolored disc of fabric.\nUtah is suddenly aware of the earth rushing up at him.\nNathaniel pulls, then Roach.  They shoot upward,\ndisappearing.\nBodhi and Utah fall on, alone.\n\n                         BODHI\n          You gonna pull?\n\n                         UTAH\n          After you, Alfonse.  I insist!\n\nBodhi looks at Utah.  A slow grin.  The meter on his chest\nharness reads 2000 ft.  150 mph.  12 seconds to Valhalla.\n\n                         BODHI\n          Don't screw around man, pull it!\n\n                         UTAH\n          You do it... you first!\n\n                         BODHI\n          One thousand feet.  Pull the goddamn\n          cord!\n\n                         UTAH\n          You first!\n\n                         BODHI\n          Okay!\n\nBodhi reaches out suddenly and pulls Utah's ripcord\nhandle.\nHe waves goodbye as Johnny's canopy deploys.  Utah is\njerked upward.  He feels his weight hanging brutally in\nthe harness.\nJohnny looks down.\nImpossibly close to the ground.  Bodhi's canopy BURSTS\nOUT, an explosion of color.  Below him is the shimmering\nmirror of a LARGE RESERVOIR.  Two seconds later the bright\nyellow canopy meets its reflection and goes slack.  An\nexplosion of white water marks Bodhi's impact.\n\nLOW ANGLE AT WATER LEVEL as Utah hits.\nIN SLOW MOTION a glorious wall of backlit spray shouts\nskyward.\nMolten glass falling back in the bright desert dawn.\nUtah surfaces, sputtering, and shucks out of the harness.\nHe floats like a jellyfish, gasping for breath.\n\n                         UTAH\n          Jesus Christ.  I gotta be losin' it.\n\n                                            CUT TO:\n\nEXT.  AIRFIELD - DAY\n\nBodhi walks toward us, dripping wet and grinning.\nHe wraps his arm around Utah's shoulders as the others\nwalk up.\nThey're all soaked and stoked.\n\n                         BODHI\n          Ya see... I told you Johnny U was\n          gonna be just fine!\n\nRoach and the others clap him on the back.  A moment of\nacceptance into the tribe.  Utah isn't sure what it means\nyet.\n\n                         BODHI\n          C'mere.  There's something you need\n          to see.\n\nBodhi leads him toward a PLAIN UTILITY VAN parked nearby.\nIt was there earlier but Utah had no reason to notice it.\nBodhi opens the rear doors and motions Johnny inside.\nUtah, puzzled and suddenly alert, steps in.  Bodhi\nfollows.\n\n\nINT.  VAN - DAY\n\nThe interior is empty except for several canvas duffel\nbags and a small portable VCR.  It is one of the new sales\npresentation models, with deck and monitor together in one\ntiny unit.\n\n                         UTAH\n          What's this?\n\n                         BODHI\n          Insurance policy.  Now this is going\n          to sting a bit, but it's for your\n          own growth, brah.  Press play.\n\nUtah hits the button and an image comes up on the tiny\nscreen.\n\nTIGHT ON SCREEN.  A night shot.  Rosie the biker has Tyler\nin a powerful grip.  Her hands are cuffed behind her, and\nher mouth is taped.  He has his switchblade up to her\nthroat.  Her eyes are wild, but with rage, not fear.\nShe's trying to struggle out of his grip, kicking at him\nviciously.\nHe controls her efficiently.\nBodhi stops the tape.\n\n                         BODHI\n          She's a wild one, isn't she...\n          Special Agent Utah?\n\nUtah lunges, pinning Bodhi to the wall of the van... an\nelbow across his throat.\n\n                         UTAH\n          You're a fucking dead man--\n\n                         BODHI\n                  (gasping for breath)\n          Whoa, whoa!!  Think it through!  I'm\n          the only one knows where they are.\n          Just let me talk for a second.\n\nJohnny pulls back.  Barely in control.\n\n                         UTAH\n          Talk.\n\n                         BODHI\n          She'll be fine, Rosie won't do\n          anything.  At least not as long as I\n          meet him at a certain place and time,\n          about... let's see...\n                  (he looks at his\n                   dive Rolex)\n          ... six hours from now.\n\nUtah's voice sounds kind of strangled.\n\n                         UTAH\n          You call him... right now... and\n          tell him to let her go.\n\n                         BODHI\n          Sorry, can't do it, brah.  He's on\n          the road.  And where they're going\n          there's no phones.  Damn, I hate\n          this Johnny, I really do.  I hate\n          violence.  See, that's why I need\n          Rosie.  I could never make this\n          thing work, myself.  No way I could\n          hold a knife to Tyler's throat, man!\n          She was my woman, once.  We shared\n          time in this world.  But Rosie, he's\n          kind of a... mechanism.  Once you\n          set him in motion, he won't stop.\n          That's his gift, a kind of...\n          blankness.  Noon comes, straight up,\n          he'll gut her like a pig and try not\n          to get any on his shoes.  Nothing I\n          can do, unless I get there.\n\nUtah blanches as he takes this in.  Knows Bodhi well\nenough now to know he means business.\n\n                         BODHI\n          So that makes us partners, doesn't\n          it?  Because now we both have the\n          same goal... to get me where I need\n          to go.  Right?\n\nUtah's expression turns suddenly cold as an executioner's.\n\n                         UTAH\n          We're wasting time.\n\n                         BODHI\n          See!  That's what I like about you,\n          man!  You're just sharp as a razor\n          blade.\n\nBodhi jumps out of the van and approaches the others,\ngathered nearby.  He addresses the pilot first...\n\n                         BODHI\n          Get the plane down to Santa Monica\n          and top up the tanks.\n                  (to the others)\n          Let's go.  Let's saddle up!\n\n                                            CUT TO:\n\nEXT.  L.A. STREETS - DAY\n\nA STYLIZED LONG LENS SHOT stacks the cars into a dreamlike\nmirage.  The van weaves slowly among them with predatory\nstealth.\n\n                         BODHI (V.O.)\n          Okay.  All I'm askin' for is ninety\n          seconds of your life, Johnny.\n          That's all.\n\n\nINT.  VAN\n\nEXTREME CLOSEUP ON the velcro straps of Second Chance\narmor.  Tanned fingers cinch it tight.  A SHELL slides\ninto the cylinder of the Casull.  A SHOTGUN is cocked.\nKACHACK!\n\n                         BODHI\n          It's basic dog psychology, brah.  If\n          you scare them, get them pissing\n          down their leg, they submit... you\n          control them.  If you project\n          weakness, you draw aggression...\n          that's how people get hurt.\n\nWIDER, revealing that Bodhi is in the back with Utah and\nRoach.\nNathaniel and Grommet sit up front.\nThe duffels contents are strewn around.  Masks.  Weapons.\nThey're all pulling on suit pants and jackets.  Tying\nties.  Slipping on white gloves.  Snappy Oxfords.\nBodhi is pulling a suit jacket on over his BODY ARMOR.\nUtah is fumbling with his armored vest.  He works with\nvicious, jerky moves.  His jaw locked.  Eyes down.\n\n                         BODHI\n          Fear causes hesitation, and\n          hesitation will cause your worst\n          fears to come true.  You project\n          strength to avoid conflict.\n\n                         ROACH\n          Peace through superior firepower,\n          babe.\n\nBodhi conspicuously empties all the shells from a PUMP 12\nGAUGE.\nPockets the shells.  Tosses the weapon to Utah.\n\n                         BODHI\n          Here, you need this.  You can't be\n          comin' through that door with your\n          dick in your hands, right?\n\n                         UTAH\n          I can't do this.\n\n                         BODHI\n          Sure you can!  You may even like\n          it... it's a killer rush.  You'll\n          see.  Hey, don't I show you things,\n          Johnny U?\n\n                         UTAH\n          Bodhi, this is your wake up call,\n          man -- I... am... an... Eff...\n          Bee... Eye... Agent!!\n\n                         BODHI\n          Wild, ain't it?!  See, we exist on a\n          higher plane, you and I.  We make\n          our own rules.  Why be a servant of\n          the law Johnny U... when you can be\n          it's master?\n\n                         GROMMET\n          Fuckin' A!\n\n                         BODHI\n          Ninety seconds, man, door to door.\n          A small price to pay for someone who\n          loves you.\n                  (he looks up)\n          She does you know.  It's not her\n          style to fall so hard... I don't\n          think she did with me.\n\nHe pulls the Ronald Reagan mask over his head smoothly.\nRoach pulls his on.  NIXON.  Nathaniel becomes KENNEDY.\nGrommet transforms into LBJ.\nBodhi looks in the bag -- no more masks.\n\n                         BODHI\n          Sorry, Johnny.  Guess you don't get\n          to be president.\n\nJOHNNY'S POV -- the back doors of the van.  And the\npromise of what is beyond.  Bodhi enters FRAME.  Looks\nstraight at us.\n\n                         BODHI\n          Rock and roll!\n\nBOOM -- THE DOORS bang open, REVEALING--\n\n\nEXT.  STREET - BANK - DAY\n\nSTILL IN POV (HANDHELD) we hurl ourselves from the dark\nvan into blasting daylight.  Bodhi is ahead of us in the\nsprint for the bank doors.  Dizzying forward momentum as\nwe hammer through the doors into--\n\n\nINT.  BANK\n\nTHE HANDHELD POV CONTINUES as we follow Bodhi, a wolf\nplunging among the sheep.  A FAT GUARD inside the doors.\nHe turns to us just as Bodhi butt-strokes him hard in the\ngut.\nSomeone screams.\n\n                         BODHI\n          Everybody freeze!!  Don't move!!\n\nAHEAD of us GROMMET/LBJ covers the SECOND GUARD with his\n12 gauge.\n\n                         GROMMET\n          Don't fucking do it, man!\n\nThe guy has his hand on the grip of his pistol but it's\nlike the thing suddenly weighs eight tons, he can't seem\nto lift it from the holster.  ROACH/NIXON slips up next to\nhim and helps him with it.  The guy is visibly trembling.\n\nA YOUNG JOCK makes a move to run.\n'OUR' SHOTGUN comes up like a reflex, right in his face.\nRoach/Nixon throws the guy to the floor by his hair.\nAHEAD OF US, Bodhi is in action.  Moving to the counter,\nshouting--\n\n                         BODHI/REAGAN\n          All Tellers back away from the\n          counter!  Hands on your heads!\n          RIGHT NOW!!  That's right.  You know\n          the drill.\n\nIt's like a replay of the robbery Utah saw on video.  But\nhe's right in the middle of it, like in some kind of\nnightmare.\n\nWE'RE STILL IN POV, the image WHIPPING wildly from side to\nside as Utah scans the room.  We whirl dervish among the\nstatuary of the customers and bank employees.  Our gaze\ndrifts across THE FLOOR MANAGER, a short guy in a brown\nsuit standing with his hands clasped behind his back.\n\n                         BODHI/REAGAN\n          All customers on the floor.  Let's\n          go!  Move it!  Get down!  On the\n          floor!  Right now!  Let's go.\n\nRoach and Grommet are pushing them down.\nUtah stands stiffly with the shotgun.  He seems dazed.\nHe catches the eye of a CUSTOMER.  In a tenth of a second\nwe see Johnny see the customer see his uncertainty.  Fear\nhas them both hyper-aware.\nJohnny gestures fiercely with the shotgun.\n\n                         UTAH\n          On the floor, asshole!  What's your\n          problem?!  I blow your fucking\n          kneecaps out, you'll be on the\n          floor!!\n\nThe guy hits the deck like a sack of cement.\nBODHI/REAGAN floats beside Johnny, scanning with the\nCasull.  He speaks without turning his head.\n\n                         BODHI/REAGAN\n          Kick in the ass, ain't it?  Gonna be\n          kinda hard to explain though... when\n          they play the tapes back down at the\n          bureau.  Could look bad on your\n          monthly evaluation.\n\nJohnny looks up at surveillance camera.  He's quite\nfucked.\n\n                         UTAH\n          Can we just get the goddamn money\n          and get out of here?!\n\n                         BODHI/REAGAN\n          That's the spirit!!\n                  (to the room)\n          Head's down!  Eyes down!  Just a\n          couple minutes of your life and\n          we're gone.\n\nBodhi leaps to the counter, commanding the room.\nBut at this point they diverge from their time-proven\nplan.\nRoach isn't going for the drawers... he's sprinting for\nthe VAULT.\n\n                         BODHI/REAGAN\n          You!\n                  (reading a name-tag)\n          Miss Jennings... of New Accounts.\n          Be a dear and open the inner gate\n          for my associate.  NOW!!\n\n                         MISS JENNINGS\n          He -- he -- he has the keys.  Mr.\n          Duggan.\n\n                         BODHI/REAGAN\n          Whatta say, Mr. Duggan?  Wanna give\n          her the keys or do I pick through\n          the blood and chunks for them?\n\nDUGGAN, the bank manager, is surprisingly calm as he takes\nthe keys from his pocket.  Holds them out to the terrified\nwoman.\n\n                         DUGGAN\n          Do whatever they say, Terry.\n\nMISS JENNINGS hurries to comply.\nShe unlocks the STEEL CAGE inside the big vault door.\nRoach/Nixon and Grommet/LBJ take her inside with them.\n\nA CUSTOMER, lying on the floor near the fat guard catches\nhis eye.\nThe guard, face jammed against the linoleum, blanches as\nhe sees the customer lift a corner of his shirt to reveal\nTHE BUTT OF A PISTOL.  The customer mouths the words \"I'm\na cop\".\nThe guard is hyperventilating.\n\nAT THE FRONT DOORS A WOMAN comes in out of the bright\nsunlight.\nJFK pulls her in fast and throws her to the floor.  Then\ngoes back to watching the street.\n\nJOHNNY is next to Bodhi/Reagan.\n\n                         UTAH\n          You're blowing it, man!  You're\n          breaking your own rules... pulling\n          too much time!\n\n                         BODHI/REAGAN\n          JFK, how we doin'?\n\n                         NATHANIEL/JFK\n          All clear, man!\n\nINSIDE THE VAULT Grommet and Roach are pillaging rapidly.\nTheir hands blur as nice fat STACKS OF 20s and 100s are\ndumped into canvas sacks.\n\nON THE MAIN FLOOR the OFF DUTY COP slips his hands slowly\naround the butt of his pistol, concealing the move with\nhis body.\nHe signals with his eyes to the fat guard, glancing at the\nguard's ankle.\n\nTIGHT ON THE GUARD'S ANKLE where we can see a sliver of\nBACK-UP GUN, a tiny .25 auto in an ankle holster.\nThe guard's eyes are pleading with the hard-on cop.\n\"Don't make me do this\".\nThe guy is sweating, shaking.  A yellow liquid spreads\nacross the tiles next to his quivering hips.  He's\nactually pissing himself, he's so scared.\n\nTIGHT ON the off-duty cop.  Watching like a ferret.  He\ncocks his .38.\nECU GUARD'S EYES, wide with terror.\n\nIt happens like lightning.  The cop pops to his knees,\nstraight-arming the .38.  The guard goes for his ankle\nholster.\nREAGAN spins.\nThe cop FIRES.  BLAM!\nReagan is catapulted backward off the counter by the\nimpact.\nHe crashes onto a desk on his back.  Slides off,\nscattering papers.\nA teller screams.  The cop spins toward Utah.\nJohnny throws down the shotgun.  Shows his palms.  He's\nholding out his gold star.\n\n                         UTAH\n          Federal agent!  Undercover!\n\nThe cop FIRES TWICE.  Two in the chest.  Utah is hurled\nback.  Slams into the tellers' counter.\n\nNATHANIEL/LBJ lets go with the 12 gauge.  BOOM!\nThe cop spins, hit by some 00 buck pellets.\nThe guard caps-off like a maniac.  BLAM, BLAM, BLAM,\nBLAM!!!\nAll of them wild, but serving to get Nathaniel pinned down\nbehind a check-writing island.\n\nROACH/NIXON LEAPS THE COUNTER and lands behind the guard.\nThe guard's shoulder explodes as Roach's 12 gauge\ndetonates.  He pitches onto his face, screaming and\nholding the wreckage of his upper arm.\nGrommet/LBJ is coming over the counter behind Roach as the\noff-duty cop spins and fires.  BLAM!  BLAM!  Roach takes\nit in the chest.  Staggers back, firing into the floor.\nTrips and drops his shotgun.\nGrommet clutches his throat as blood streams over his\nfingers.\n\nIN SLOW MOTION Reagan's face rises above the counter.\nThe mask is askew.  In order to see, Bodhi pulls it off.\nThe Casull comes up in a slow, deliberate arc as--\n\nTHE COP turns, terrified now, whipping his gun around,\nnightmarishly slow as--\n\nBODHI COCKS THE CASULL in dream-time and--\nKABOOOOM!!!  The world's most powerful handgun proves its\nclaim at 2000 feet per second.\n\nA gout of hamburger explodes out of the cop's chest.\nHe is lifted off his feet.  Hits and slides across the\nfloor leaving a two-foot wide red smear.\nEchoes slap the walls.  Then all is still.  Plaintive\nwhimpering and moaning.  The air is blue with smoke.\n\nJohnny is trying to catch his breath.  He rips his shirt\nopen to see two deep indentations in the Second Chance\nvest.  Flattened .38 slugs caught in the Kevlar mesh.  But\nno blood.\n\nBodhi drops over the counter near Utah.\nThe two men look at each other.\nBodhi's eyes seem lost.  He stares around at the carnage\nhe has wrought, the bloody wreckage of his ego game.\nHis expression changes to something new -- truly crazed\nnow.  We feel that the madness which has been held in\ncheck so long has been let off its leash.\n\n                         BODHI\n          Don't anybody fucking move!\n\nRoach, clutching his side, moves to Grommet, who is on his\nknees.\nBeneath LBJ's stony countenance a river of blood flows\ndown Grommet's chest.  Roach pulls off the mask.\nRevealing a terrified kid.\nGrommet pulls his blood-drenched hand away from his\nthroat, stares at it bug-eyed.\n\n                         GROMMET\n          Oh no, oh my god, oh god... it's all\n          comin' out man, gotta stop it...\n          it's all gonna come out... do\n          something!!\n\nHe's trying to hold it in with his hands.  This doesn't\nwork.\nA paste-white frightened kid.  Eighteen years old.\nSuddenly realizing that this is not some video game.  That\ndeath is real.\nHe slumps back, losing the battle for consciousness.\nWE HEAR SIRENS APPROACHING.\n\n                         ROACH\n                  (freaking to Bodhi)\n          We gotta bug out, man!  We're eatin'\n          it bad on this one.  Let's go!\n\nBodhi reaches down and picks up Johnny's FBI shield off\nthe floor.\nHe considers it for a long time.  Then looks up at Johnny.\nHis eyes seem to ask for forgiveness...\nA moment before he smashes the Casull into Johnny's skull.\n\nJOHNNY'S POV, as he drops to his knees.  Everything going\ndark as we see Bodhi's face distantly, his mouth moving\nslowly...\n\n                         BODHI\n          Goodbye, Johnny.\n\nThe floor rushes up and smashes us in the face.\nA view of shoes, running away from us, leaving bloody\nfootprints.  Then total darkness.\n\n                                            CUT TO:\n\nINT./ EXT.  FIRST SECURITY BANK - LATER\n\nTen minutes later the bank \"crime scene\" is in full swing.\nUNIFORM COPS are everywhere, trying to get statements from\nsobbing witnesses.  HARP, MUNOZ, COLE AND PAPPAS represent\nthe FBI contingent.  Cole has one arm strapped to his body\nin a fairly elaborate sling, and he moves slowly.\n\nHarp is barking orders to everyone in sight.  Outside\n(visible beyond the doors) it's total pandemonium, with\ncops and ambulances, and of course a huge crowd of\nrubberneckers.  A MINICAM CREW shows up.  Harp starts\nshouting at them.\n\nCOLE, with evident pleasure, cinches down a pair of\nhandcuff's on Utah's wrists with his good hand.  Johnny\nhas a deep cut on his forehead, and the blood is trickling\ninto his eyes, but he seems not to notice.  Not to hear\nMUNOZ speaking monotonously--\n\n                         MUNOZ\n          -- if you so desire, an attorney\n          will be provided for you free of\n          cost.  Do you understand these\n          rights I have explained to you?\n          Utah?\n\nPappas charges through the crowd, pushing Munoz aside.\n\n                         PAPPAS\n          He knows his goddamn rights!\n                  (looks at Utah)\n          Jesus, kid.  I knew you were getting\n          too close to these guys.\n                  (turns to the other\n                   agents)\n          Gimme the goddamn key to these\n          things, Cole.  Christ!\n\nHe gestures to the cuffs still cutting into Johnny's\nwrists.\nCole hands him the key.\nHarp storms toward them.\n\n                         HARP\n          Don't take those off.  Just leave\n          them on!  Your partner's an\n          accessory to murder.  You realize\n          that?\n\nHarp spins Johnny by the shoulder to look at--\nParamedics carrying the covered body of the off-duty cop.\nBeyond, still on the floor, is Grommet, his eyes staring\nin death.\nHe was right about not making thirty.\n\n                         HARP\n          Three men dead.  One of them a cop.\n          How's that sit in your gut, Utah?\n\n                         UTAH\n                  (cold and scary)\n          Take your hand off my shoulder right\n          now.\n\nHarp pulls back instinctively.  Utah's eyes burn into him.\nLooks like Johnny's not in the FBI anymore.\n\n                         PAPPAS\n          Look, Harp.  Don't turn him over to\n          the uniforms like some punk.  Let me\n          ride him in.\n\n                         HARP\n          Yeah, sure.  Why not?  You two\n          screw-ups deserve each other.\n          That's why I put you together in the\n          first place.  Christ Pappas, you're\n          as bad as he is... talk about the\n          blind leading the blind--\n\nPappas steps close to the Supervising Agent.\n\n                         PAPPAS\n          Harp, let me tell you something.  I\n          was an agent in this bureau when\n          your mommy was still wiping your\n          shinny pink ass, and you know one\n          thing I learned in all those years\n          that you still haven't?\n\n                         HARP\n          What that?\n\nAngelo steps in with a roundhouse that has all of his 280\npounds behind it.\nHarp's head snaps back, and he flops in a heap.\n\n                         PAPPAS\n          Respect your elders.\n                  (he takes Utah by\n                   the arm)\n          Let's go kid.\n\nHarp struggles to sit up, rubbing his jaw, as Pappas\nstuffs Utah into his car.  Harp is so shocked he doesn't\nsay a word.\n\n                                            CUT TO:\n\nINT.  PAPPAS' CAR\n\nThey drive for a couple of blocks in silence, side by\nside.\nUtah in disgrace.  Contrite.  Stony.  Finally...\n\n                         UTAH\n          I know where they're going.\n\n                         PAPPAS\n          Figured you did.\n\nAngelo flips Johnny the key.\nJohnny lets himself out of the cuffs.  He sits rubbing his\nwrists.\n\n                         UTAH\n          Only problem is... we can't arrest\n          them or shoot them.\n\nON PAPPAS' \"what the fuck?!\" expression we--\n\n                                            CUT TO:\n\nEXT.  SANTA MONICA AIRPORT\n\nLONG LENS SHOT through a forest of small planes as Pappas'\nsedan glides INTO FRAME.  It moves sharklike among through\nthe Cessna forest.  Slows to a stop.\nThrough the jungle of wings and fuselages we see Pappas\nget out of the car and start working his way among the\naircraft.\nUtah slides behind the wheel and drives on.\n\nTIGHT ON TURBOPROP ENGINE roaring as it warms up.\nThe same aircraft as before.\nBodhi and Nathaniel are loading duffel bags into the open\nback door as the pilot completes his pre-flight checks.\nThe Ex-President's suits have been removed, along with the\nbody armor, and no guns are in sight.  Just a couple of\nguys getting ready for a charter flight.  Bodhi looks up\nand stops his work as...\n\nTHE FBI SEDAN stops about 50 feet away.\nNathaniel pulls a shotgun out of one of the duffels.\nUtah gets out.  He holds his hands out from his body and\nturns completely around.  Without his jacket on, it is\nevident that he is not carrying a gun.\nHe walks forward.\n\n                         UTAH\n          I'm not armed.\n\n                         BODHI\n          But you're not alone.\n\n                         UTAH\n          Good guess.  There's a gun on you\n          right now.\n\nBodhi feigns casual interest.  Looks around.  He can't\nsee...\n\nPAPPAS nearby.  Moving cat-like behind a row of service\nvehicles.  He gets his snubnose .38 propped on the bumper\nof one, with a clear shot at Bodhi and Nathaniel.\n\n                         UTAH\n          Where's Roach?\n\n                         BODHI\n          Around somewhere.  Listen, I'm in\n          kind of a hurry, Johnny U.  What can\n          I do for you?\n\n                         UTAH\n          You gotta tell me where she is.\n\n                         BODHI\n          And let my policy expire?  Sorry.\n\n                         UTAH\n          Look, Bodhi man.  People are dead.\n          The ride is over.\n\n                         BODHI\n          I say when it's over!\n\n                         UTAH\n          The guy you killed was an off duty\n          cop!  If you get out of here they'll\n          nail you wherever you land.  They\n          have a new thing called radar.\n          Maybe you've heard of it.\n\nThough he can't hear what's going on.  THE PILOT has\nclocked the tension between the two men.  And the shotgun\nin Nathaniel's hands.  He blanches, and starts to shut\ndown the plane's power.\nBy his reaction we see that he's obviously not in on it.\n\nROACH comes out of the hangar building nearby.  Neither\nUtah nor Pappas see him.  But he sees Pappas drawn down on\nBodhi.  He drops quickly to one knee and opens the duffel\nhe was carrying.\n\nTIGHT ON DUFFEL BAG, as it opens.  The pistol grip of a 12\ngauge riot-gun sticks out of lots and lots of money.\nRoach's hand slides the gun out slowly.\n\nUTAH IS VERY CLOSE to Bodhi.\n\n                         UTAH\n          I know you man, when they fall on\n          you, you won't back down.  They'll\n          have to burn your ass to the ground.\n          And I can't stop them... I'm the\n          last person they're ready to listen\n          to right now.  Thanks to you.\n\n                         UTAH\n          Shit may or may not happen.\n\n                         UTAH\n          Look, you got a death wish, you want\n          to ride to glory... fine!  But don't\n          take her with you, man.  I'm begging\n          you... tell me where she is.  Then I\n          walk away.  We've earned that much\n          trust, haven't we?\n\nThe pilot opens the door and is climbing out when\nNathaniel wheels on him.  The pilot goes cross-eyed\nstaring down the muzzle of the 12 gauge, inches from his\nface.\n\n                         BODHI\n                  (to the pilot)\n          Back in the hotseat, campadre.\n          NOW!\n\nBEHIND THE TRUCKS, Pappas senses something.\nHis head snaps around.\nRoach is behind him with the 12 gauge.  He FIRES.\nPappas hurls his weight sideways, as the buckshot punches\ninto the truck fender.  Some of it catches Pappas in the\nhip.  He hits the ground hard and whips up the .38 BAM!\nBAM!  BAM!\nRoach flips onto his back.\nThe shotgun blows a hole in the sky as he hits the deck.\nPappas is on the ground, totally exposed, 20 feet from the\nothers.\n\nNATHANIEL fires once, wild.  Terrified.  His shot blows a\ndivot out of the asphalt next to Pappas.\nHe pumps the slide, chambering another round.\nThen Pappas' fourth and fifth rounds drill into him.\nHe slams back against the Cessna's fuselage.\nSlides down.  Two red smears on the white aircraft.\nBodhi lunges for the fallen 12 gauge.\nPappas takes aim.  One round left.\nUtah sprints between them.\n\n                         UTAH\n          Angelo!  Don't fire!\n\n                         PAPPAS\n          Kid, get outta the way!!\n\n                         UTAH\n          NOOO!!\n\nUtah is blocking Bodhi with his body.\nBodhi's fingers are poised, frozen, a few inches from the\nshotgun.\nStandoff.\n\n                         PAPPAS\n          GODDAMMIT!!\n\nHe snaps the pistol up, aimed at the sky.\nPappas stands panting.  Enraged and frustrated.  Pain\nsearing his leg.  Everything is tense and electrified.\nBOOM!!  Pappas' chest EXPLODES with a spray of blood!\n\nBEHIND HIM, ROACH is lying on one elbow in a pool of\nscarlet.\nHe cocks another round into the chamber and fires again.\nBOOM!\n\nAngelo drops to his knees, holding his ruined body like\nhe's hugging himself.  Johnny lunges toward him, his face\ndistorted with shock.\n\n                         UTAH\n          NNNOOOOOO!!!\n\nAngelo's eyes meet his for a moment.\nIn his dilated pupils is the great question.\nThen he slumps forward and lies very still.\nThe breath leaves his body and doesn't go back in.\n\nJohnny moves toward his friend in a daze.  Drops to one\nknee beside him.\nRoach aims the shotgun at him, coughing blood.\nUtah doesn't notice.  Or is beyond caring.\nBodhi holds his hand up in a gesture like a benediction.\nRoach's finger relaxes on the trigger.\n\nUtah puts his hand on Angelo's white crewcut hair.\nHe hears the scraping of steel on asphalt behind him as\nBodhi picks up the other twelve gauge.\n\nRoach is working himself to his knees.  His breath is\nsucking through a bloody hole in his chest as well as the\ncustomary breathing orifices.  Bodhi crosses to him and\nhelps him up.  He covers Utah with the shot gun as he\nhalf-carries Roach to the plane.  The pilot is white with\nshock.  He'd run if he could remember how.\n\n                         PILOT\n          I ain't flyin' you guys to San\n          Phillipe man, forget it.  Not now--\n\n                         BODHI\n          Thanks for telling the nice FBI\n          agent where we're going.\n\nRoach works his way up into the plane.  He waves the\nshotgun at the pilot, his face a vicious, blood-flecked\nmask.\n\n                         ROACH\n          Get in the fucking plane.\n\nBodhi stands behind Johnny, the shotgun aimed at his head.\nTheir expressions are lethally cold.\nWe see that Utah hates this man who was his friend, his\nteacher, more now than he dreamed it was possible to hate.\n\n                         BODHI\n          We're gonna ride this out, all the\n          way, Johnny.  You and me.  Let's go.\n\nJohnny nods slowly, as if accepting that this was all\nsomehow pre-ordained, and that they both knew the game\nwould take them this far and beyond.  He stands and walks\nto the plane.\n\n                                            CUT TO:\n\nEXT.  MEXICO - DAY\n\nTHE SCREEN EXPLODES WITH A BLUR OF MOTION.\nPOV of the ground racing below us at 180 mph.\n\nREVERSE, preceding the plane as it rockets through barren\ncanyons.\nAs close to the earth as the terrified pilot will take it.\nUnder the radar.\n\n\nINT.  PLANE\n\nThe aircraft bucks like a bull as the pilot jinks and\nbanks wildly.\nBodhi has the Casull aimed at the base of his skull from\nthe jump seat just behind him.\nRoach holds the shotgun on Utah, seated across from him in\nthe rear seats.\nRoach is a pale, sweaty mask.  He is propped against a\nbulkhead, seemingly collapsed in on himself like a\ndiscarded coat.\nHis entire shirtfront and lap are slick with blood.\nBut his gaze is steady, and the shotgun is aimed into\nUtah's guts.\nNo one talks or moves on this grim hell-ride.\n\n\nEXT.  ARROYO\n\nNear noon.  The sun blisters a landscape out of time.\nThe white Cessna rockets above the saguaros, its shadow\npumping up and down over the broken terrain like some\nmanic alter ego below it.  It WOOSHES over us, raising\ndust devils.\n\n\nINT.  PLANE\n\nThe pilot yells over his shoulder to Bodhi...\n\n                         PILOT\n          Look, we been in Mexico the last\n          half hour... can I quit mowing the\n          lawn here or what?  I'm getting more\n          brush in the wheels than I usually\n          like, you know what I'm saying?!\n\n                         BODHI\n          Yeah, get some height.  Take her up\n          to eight thousand on this heading.\n\nThe pilot pulls back on the yoke and the plane climbs.\nBodhi moves back next to Roach, who's fading.\n\n                         ROACH\n          We're gonna pop up on their screens.\n\n                         BODHI\n          Doesn't matter now.  We're almost\n          there, man.  Here, let me help you\n          get your gear on.\n\nBodhi drags a parachute pack up onto the seat next to\nRoach and starts helping him into the harness.  Roach\nkeeps the shot gun pointed at Johnny.\n\n                         ROACH\n          I'm cold.\n\n                         BODHI\n          You're gonna be fine.  Just fine.\n          Johnny, toss me that money bag will\n          you.  Easy does it.\n\nUtah hefts the duffel.  Weighs its contents, and their\nprice.\n\n                         UTAH\n          You're cold because all the blood is\n          running out of your body, Roach.\n          You're going to be dead soon.\n                  (he tosses the bag)\n          I hope it was worth it.\n\nRoach clutches the canvas sack to his chest like a Teddy\nbear.  Glares at Utah.  He hooks the strap of the duffel\nover one shoulder.\n\n                         BODHI\n          Hey, Johnny's just trying to psych\n          you man, forget it.  Just keep\n          thinking about all those senoritas\n          nursin' you back to health.  Come\n          on, amigo, let's get you set for the\n          jump.\n\nBodhi props Roach next to the open door and takes a\nwalkie-talkie from the seat, keying it.\n\n                         BODHI\n          Rosie, Rosie, this is Air Force One,\n          do you copy, over?\n\nA burst of static is followed by a surprisingly clear\nvoice.\n\n                         ROSIE (V.O.)\n          Copy you, Air Force One.  We have a\n          visual on you.  Lookin' fine.\n\n                         UTAH\n          Tell him to release Tyler.\n\n                         BODHI\n          Why should I?\n\n                         UTAH\n          What if your chute fails, Bodhi?\n          Rescind the order.  Let her off the\n          hook, she's served her purpose.  Do\n          it, man, you owe me that much.  Let\n          me hear it before you check out.\n\nBodhi meets his eyes and considers for a couple of\nseconds, then keys the walkie.\n\n                         BODHI\n          Rosie, listen carefully.  Surgery\n          is canceled, is that clear?  Repeat\n          it back to me.\n\n                         ROSIE (V.O.)\n          Copy you.  Surgery is canceled.\n          I'm lettin' the bitch go.\n\nBodhi looks out the doorway.  Gauging distance, airspeed,\nthe geography below.  He looks at Utah, aiming the Casull\nat him.\nJohnny stares back at him like a pit viper.\n\n                         BODHI\n          I know it's hard for you Johnny.\n          You want me so bad it's like acid in\n          your mouth.  But not his time.\n                  (he braces Roach at\n                   the door)\n          Let's go.\n\nBodhi signals the pilot and Utah feels the plane drop as\nthe engines are cut back to an idle.  Bodhi slaps Roach on\nthe shoulder and Roach slumps backward out of the plane.\nBodhi braces to jump, looking at Johnny for a last split-\nsecond.\n\n                         BODHI\n          You lose, campadre.\n\nHe chucks the Casull onto the seat beside the door and\nbails.\nBodhi tumbles out into space.  It's over.\n\nUtah's knuckles are white, gripping the seat.  There's a\ndynamo, spinning out of control in his head.  He leaps up\nin an explosion of rage and drives his fists into a\nbulkhead.  Looks around like a rabid animal.  TWO SECONDS.\nTHREE SECONDS.  Then...\n\n                         UTAH\n          FUCK IT!!!\n\nUtah grabs the Casull off the seat and dives out of the\nplane.\n\n\nEXT.  PLANE\n\nUTAH, WITHOUT A PARACHUTE, but carrying a very large gun,\nrockets downward.  He presses his arms to his sides and\nfalls head-down, building speed.\n\nThree hundred feet below him is Bodhi, freefalling in a\nspread-eagle position.  Utah moves his feet and hands,\nangling toward him.\nBodhi doesn't see him.  Falling flat, he tops out at\nterminal velocity for that position.  130 mph.\n\nUtah slashes downward at 160 mph.  The gap between them\ncloses.\nUtah is almost blinded by the windstream.  His eyes burn.\nHis lips are peeled back by the blasting air.\nBodhi is eighty feet below him... 4000 feet to terra\nfirma.\nUtah focuses all his incredible will and concentration.\nHe's only going to have one shot at this.\nBodhi is right below him.\nUtah is closing like a SAM missile.\nHe trims a little, and...\nWHAM!  Slams into Bodhi in a mid-air tackle.\n\nBodhi's eyes are wide with amazement as they tumble\ntogether.\nUtah has made the grab and locked his arms around Bodhi in\nan iron grip.\nHe pulls the Casull's muzzle up to Bodhi's head and\nscreams in his face.\n\n                         UTAH\n          Pull the parachute!!\n\nBodhi looks at the gun.  Looks at Utah.  Grins wildly.\n\n                         BODHI\n          Pretty radical, Johnny.  Even for\n          you.  Why don't you pull it?\n\n                         UTAH\n          No games, Bodhi.  Pull the cord!\n          Now!!\n\n                         BODHI\n          Naw, you pull it!\n\nUtah looks down.  The earth is rushing at them.  2500\nfeet.\n\n                         BODHI\n          Go on, Johnny.  Pull it.  But you\n          gotta drop the gun, first!  Right?!\n          You use your other hand what you\n          gonna hold on with?\n\n                         UTAH\n          Pull it right now or I'll blow your\n          fucking head off and pull it myself!\n\n                         BODHI\n          Well that's the only way it's gonna\n          happen, man.  Do it!  Come on, you\n          want to do it.  You're gonna die,\n          Johnny.  Five more seconds.  Four...\n\n1000 feet.  The ground is close enough to see details.\nCactus, sagebrush.  They rocket past the bright yellow\ncanopy of Roach's chute a hundred feet away.\n\n                         UTAH\n          You fucking crazy!?  Pull it!!\n\nThey're right in each other's faces.  Taking it way beyond\nthe edge.\nBodhi's eyes are wild.  A gleeful, adrenalized madness...\nhis pupils are the entrance to Hell.\n\n                         BODHI\n          Three seconds... two... one...\n\n                         UTAH\n          SHIT!!\n\nUtah flings the Casull away and pulls the rip-cord so hard\nhe almost loses his grip anyway.  POOM!  The canopy cracks\nout.\nFull and round and bright red.\nThe ground roars at us.\nWHAP!  Utah and Bodhi hit.  Hard.\n\nThey slide and tumble down the slope of an arroyo in a\ncloud of dust.\nRocks and debris clatter into silence.\n\nNEARBY Roach hits the ground limp as a rag doll.\nHe moves listlessly as his chute lines tug at him but his\neyes stare without blinking right at the sun.  Next to him\nthe money satchel's contents are spilled right into the\nsand.  Roach's lifeless hands lie limp among the bills\nthat caper in the desert wind.\n\nUTAH AND BODHI are both completely still as the dust\nclears.  Finally they groan and stir.  Necks move, hands\nmove, legs move.  Bodhi rolls to his knees.  He is cut and\nscraped, the blood running bright down his dust-covered\nskin.\n\nUtah looks around, blinking.\nSurreal that he should be plopped down here in the red-hot\nMexican desert.\nBodhi staggers to his feet and grins at him.\n\n                         BODHI\n          Wild ride, huh?\n\n                         UTAH\n                  (gasping)\n          Jesus Christ, Bodhi!\n\nUtah tries to rise and -- grabs his knee in agony.  We see\nby his mask of pain that it's totaled inside.\n\n                         BODHI\n          That pesky knee, huh?  Too bad.\n\nHe looks up at the sound of an engine.\n\nBODHI'S POV of his big four-by roaring toward us with a\nmeteor tail of dust.  It slides to a stop next to them.\nRosie gets out of the driver's side and stands calmly with\na sawed-off over his shoulder.\n\nUtah blinks through his sweat and pain at--\n\nTYLER running toward him out of the dust.  She kneels next\nto him and puts her arms around him.  Bodhi limps to the\ntruck.  Through the swirling dust we see him look back.\n\n                         BODHI\n          You had me worried there, for a\n          second, Johnny U.\n\nHe swings up into the four-by and guns the engine.  Rosie\nhops into the shotgun seat and the truck hurls up\nroostertails as it tears out across the desert toward\nRoach's billowing gravemarker.\n\nJohnny touches Tyler's face tenderly, leaving a smear of\nblood.\nHe gives her a wan version of the Johnny Utah grin.\n\nHOLD ON the truck moving off in a heat-shimmered cloud of\ndust, becoming a mirage, then a memory as we--\n\n                                            DISSOLVE TO:\n\nAN ENORMOUS WAVE which FILLS FRAME, seeming to rise\nendlessly before thundering down in a holocaust of spray.\n\n\nEXT.  BEACH DAY - DAY\n\nAn unfamiliar beach laid waste by monster waves under a\nstorm sky.\nWind whips sand across the narrow beach-road, throwing it\nagainst the front doors of the LIGHTHOUSE PUB.\nTITLE OVER: ONE YEAR LATER...\n\n\nINT.  LIGHTHOUSE PUB - DAY\n\nDark.  Almost empty.  A snarling crocodile head is mounted\nabove a tapper of Guinness Stout.  A Koala bear with\nplastic eyes holds a Foster's.  A BARTENDER with leathered\nskin washes glasses.\nAt the bar, a single disheveled customer... human\ndriftwood.\nGUST OF WIND blows open a shuttered window.\nThe bartender moves to close it.\n\n                         BARTENDER\n          Gonna close early today, mate, 'fore\n          the bloody storm hits.\n\nJOHNNY UTAH swivels toward CAMERA.  His tanned face is\nbarely recognizable, jaws hidden underneath a slight\nbeard, long bleach-out hair swept behind an ear.  His\nmuscular shoulders pop from a sleeveless football jersey.\nThe man seems deadly focused.\n\n                         UTAH\n          Storm's already here... It's\n          bringing me the swell.\n\nJohnny stares into his drink.\nANOTHER BLAST OF COLD as the front door opens.\nJohnny turns at the sound.\nTYLER takes a step inside.  Her hair is different, more\nbleached out, frazzled from the sun.  Her eyes adjust to\nthe dark room.\n\n                         TYLER\n          John, they're here.\n\nUtah downs the drink and slides off his stool.  He has a\npronounced limps as he crosses to Tyler at the door.\nThey exit into daylight under an old wooden sign which\nreads: LIGHTHOUSE PUB - BELL'S BEACH, AUSTRALIA\n\n                                            CUT TO:\n\nEXT.  LIGHTHOUSE PUB - DAY\n\nUTAH and TYLER walk out onto the roadway as several\nAustralian Police cars converge on them.  A dozen\nuniformed OFFICERS step out.  The ranking officer, a\nfortyish LIEUTENANT, walks up to Utah.\n\n                         LIEUTENANT\n          D'you see him, Mr. Utah?\n\n                         UTAH\n          No.  But he's here.\n\n                         LIEUTENANT\n          Now, look, I know you used to be a\n          federal agent up in the states and\n          all that, but you're a citizen now,\n          so just find him and we'll handle it\n          from there.\n\n                         UTAH\n          No problem.  Just give me a couple\n          minutes with him first.\n\nJohnny limps out across the huge expanse of sand alone.\n\n                                            CUT TO:\n\nEXT.  BELL'S BEACH - AUSTRALIA - DAY\n\nWALL OF SOLID WATER FIVE STORIES HIGH CRASHES straight\ndown in a holocaust of spray...\nRising up from the ocean to meet a tormented sky, roll the\nmost terrifying waves any surfer has ever seen.  They\nclose out, pummeling the ocean floor, casting a shockwave\nup the shore.\nSURFERS gather on the sand, gaze out to sea.\n\n                         1ST SURFER\n          Jesus Almighty, the bloody sand's\n          shakin'.\n\nThe beach sounds like a MORTAR RANGE.\nJOHNNY passes among the brahs.\n\n                         2ND SURFER\n          Totally closed-out.  It's fuckin'\n          death on a stick.\n\nON BODHI, sitting crosslegged in the sand, arms folded\naround his knees.  He stares pensively out at the waves.\nHis hand reaches out and absently strokes a surfboard\nlying next to him.\n\n                         UTAH (V.O.)\n          I knew you wouldn't miss the fifty\n          year storm, Bodhi.\n\nBodhi smiles, the odd smile of a sportsman who appreciates\nthe cunning of his opponent.  Utah sits beside his prey\nand stares at the ocean.  Bodhi stares with glittering\neyes at the heaving ocean before him, face splitting into\nthat feral, death's head grin.\n\n                         BODHI\n          And I always knew I could count on\n          you, Agent Utah.\n\n                         UTAH\n          I'm not FBI anymore.\n\n                         BODHI\n          You never were...\n\n                         UTAH\n          I asked them to give me a couple\n          minutes...\n\nUtah calmly glances over his shoulder.\nBodhi follows Johnny's gaze to the cops watching from the\nroad.\n\n                         BODHI\n          It went bad, brah.  Real bad.\n                  (smiles inwardly)\n          I just felt it was time...\n\nA BOOMING ROAR sounds from the ocean.\nBodhi just stares at the waves, with awe and perhaps fear.\n\n                         BODHI\n          Time to dance with the universe.\n                  (he turns to Utah)\n          I could never handle a jail cell.\n          You'll do this for me, won't you\n          Johnny?  Haven't I earned this\n          much?\n\nUtah doesn't move to stop him as he stands, hefting the\nlongboard.\nHe half smiles, then turns toward the water, and starts\nwalking.\nHe stops.  Turns around.\n\n                         BODHI\n          Thanks, brah.\n\nBodhi doesn't wait for a reply.  He walks to the water's\nedge, and never looks back.  He throws his board into the\nfoam and paddles, the riptide pulling him out.  The\nmonsters dwarf his body as they quickly suck him into the\ntrough of the holocaust.\n\nUTAH stands and solemnly waits for the universe to deliver\nfinal justice.  The cops are running clumsily across the\nsand, too late to stop Bodhi.  Tyler steps up behind\nJohnny, and puts her hands on his shoulders.\n\nBODHI is nothing more than a SPECK as he shoots across the\nlip of the colossal wave, carving the board downward -- AN\nUNTHINKABLE FOREHAND BLAST sends him into a 180 degree\nslide straight down the enormous face, eyes wild, his\nmouth opens in a soundless howl -- Bodhi and the outer-\nlimits wave are locked for one impossible yet glorious\nmoment in perfect harmony, perfect symmetry, perfect\nunion... There is no fear in his face, only awe as the\nmountain of water closes out, burying the Bodhisattva in a\nwhitewater grave... Pieces of broken surfboard explode\nupward, only to fall back into the raging whiteness and\nvanish.\n\nUTAH remains pensive, eyes fixed on the riderless surf.\nTyler lowers her head.  A fragment of surfboard washes up\nonto wet sand.  The wind gathers force.\nJohnny finally turns to his woman, curls an arm around her\nshoulder, gathering her close.  Tears are streaming down\nher face as she stares at the sea.\n\n                         UTAH\n          He rode it all the way.\n\nCAMERA PULLS BACK AND UP, rising high above their heads as\nthe liquid vertical walls continue to hammer the\nAustralian shore...\n\nFADE TO BLACK\n\n\n\n\n\n\n\n\nPoint Break\nWriters :   W. Peter Iliff  Rick King  Kathryn Bigelow\nGenres :   Action  Crime  Adventure  Thriller  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:33:07.826981"}