{"title": "Pokemon: Mewtwo Returns", "film_link": "/Movie Scripts/Pokemon: Mewtwo Returns Script.html", "script_link": "/scripts/Pokemon-Mewtwo-Returns.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Pokemon: Mewtwo Returns Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Pokemon: Mewtwo Returns Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/4-stars.gif\"/> (3.50 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Masamitsu Hidaka\" title=\"Scripts by Masamitsu Hidaka\">Masamitsu Hidaka</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Animation\" title=\"Animation Scripts\">Animation</a><br/>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a><br/>  <a href=\"/genre/Family\" title=\"Family Scripts\">Family</a><br/>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/><br/>\n<b>Script Date</b> :  2000<br/>\n<br/>\n<a href=\"/scripts/Pokemon-Mewtwo-Returns.html\">Read \"Pokemon: Mewtwo Returns\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>Movie: MewTwo Strikes Back ***This is not an official manuscript. \nThis is a translation of an untranslated episode and is only \nreleased as a reference material to the pokémon series and games. \nAll copyrights belong to Nintendo, Game Freaks, and all creators \nof the movie***\n\n\n\t(Opens when the camera is underwater.)\n\nVoice\nWho am I? I've been dreaming about this world which doesn't exist \nin my memory. \n\t(Mew swims by)\nWho are you? Wait! Am I apart of you...? Or not...?\n\t(Camera goes into a darker place with orange bubbles then \nit shows someone's eye open. Human figures are seen outside where \nhe is.)\nWhere is this? Who am I? Who brought me here?\n<b>\t\n</b>\t(We now see who the voice belongs to, it's Mewtwo.)\n\nMewtwo\nWho am I and why am I here? I just appeared here. I haven't even \nbeen born to this world yet. Who am I?\n\t(Mewtwo opens his eyes completely and shatters the glass \nand all the wires fall of him!)\n\nScientist\nIt has awakened!\n\nMewtwo\nDid he do this? \n\nScientist\nWonderful! Mewtwo has been completed.\n\n<b>   \n</b>\nMewtwo\nMewtwo?\n\nScientist\nThat's you. We created you from a Mew the rarest pokémon in the \nworld! Yes, that's the pokémon which is said to be the most rare \nof all pokémon. Mew.\n\nMewtwo\nMew? Is that my parent? My father? My mother?\n\nScientist\nYou can say that, but not really. You've been made stronger based \non a Mew.\n\nMewtwo\nWho is this? If neither my father nor mother. Then was it god? \nDid God create me?\n\nScientist\nIn the world the only ones that can create new life is man and \ngod.\n\nMewtwo\nWho did this? Humans made me?\n\nScientist\nThis is truly a victory for science.\n\nAnother scientist\nWith this we've proven our theory correct. We can continue the \nstudy.\n\nThird scientist\nThis place will become the new Mecca.\n\nScientist\n\t(all shaking hands)\nI'm going to contact the other offices.\n\nMewtwo\nWho am I? Where is this place? What was I born for?\n\t(Mewtwo floats up and starts destroying the whole lab. Then \ntons of little metal hand like things come down to stop him but \nhe just blows them up. Soon the whole lab is in flames.)\n\nScientist\nTo make the strongest pokémon ever.. that was our dream...\n\t(The whole lab blows up. Giovanni, the leader of Team \nRocket comes down in a chopper and confronts Mewtwo.)\n\nMewtwo\nIs this my power? I'm the strongest pokémon in the world. Mew. Am \nI stronger then you?\n\nGiovanni\nYou surly are the strongest pokémon in the world. But there is \nanother that would be the strongest.\n\nMewtwo\nThe humans?\n\nGiovanni\n\n\t(nods)\nIf you and a human were to cooperate then the world would be \nours.\n\n<b>  \n</b>\nMewtwo\nThe world would be ours?\n\nGiovanni\nIf your power is set free the world would be ruined. You must \ncontrol your power.\n\nMewtwo\nControl?\n\nGiovanni\nAre you okay with destroying the world as it is with that power?\n\nMewtwo\nWhat should I do? \n\t(Giovanni smiles. Mewtwo is at TRHQ getting loads of armor \nput on.)\n\nMewtwo\nControl myself with the armor that protects me? What are you \ngoing to make me do?\n\nGiovanni\nIt's simple. All you have to do are the things everyone else has \nbeen doing...\n\nMewtwo\nand that is?\n\nGiovanni\nFighting, destruction, and plunder. The stronger will win.\n\n<b>--------------------------------------------------------\n</b>Mewtwo is sent into an arena to fight pokémon first an Onix which \nMewtwo throws into a wall with his mind. Then it shows Mewtwo out \nin a field with a lot of wild Tauros. He raises them up with his \nmind control and TR throws pokéballs out and catches them all. \nThen it shows Mewtwo in the gym again fighting Alakazam, Mewtwo \ndoes just what he did to Onix. Then came Electron and he used an \nelectric attack and Mewtwo reflected it back at him. Next came \nGary's Arcanine and Nidoking... he took care of them easily. Next \nscene, back in Giovanni's lab.\n<b>--------------------------------------------------------\n</b>\nMewtwo\nWhat am I fighting for? What am I living for?\n\nGiovanni\nYou are a pokémon. Pokémon made by humans, what else are you \nworth?\n\nMewtwo\nMy worth? Who am I? What do I live for?\n\t(Mewtwo starts breaking free of the wires)\n\nGiovanni\nWhat are you doing?\n\nMewtwo\nI was made by humans. But I, who was created by humans, am not \neven a pokémon.\n\t(Mewtwo blows up the place and flies off while all his \narmor slowly falls of into the sea. He lands on a rock.)\nWho am I? Where is this place? Who asked to make me? Who wished \nto make me? I hate everything that made me! So this is neither an \nattack not a declaration of war but revenge on you who made me!\n\n<b>----------------------------------------------------\n</b>Introduction\n<b>----------------------------------------------------\n</b>\n\n\t(Brock is cooking lunch for everyone.)\n\nNarrator\nAsh and the others are on a journey training to be pokémon \nmasters. It's a beautiful day so they take a break in a field.\n\nAsh\nIs it ready yet?\n\nMisty\nAsh you can help too.\n\nAsh\nI can't I can't even move one millimeter because I'm so starved.\n\nBrock\nStew well and raise slowly. You mustn't be in a rush with both \nsoup or pokémon.\n\t(Pikachu and Togepy spot someone coming)\n\nPirate\nHey you! The boy over there! Are you Ash from Pallet Town?\n\nAsh\nThat's right.\n\nPirate\nCan I have a Pokémon battle with you?\n\nAsh\n\n\t(runs over to him)\nOkay! I must have a solid fight!\n\nMisty\nI thought you couldn't move one millimeter?\n\nAsh\nJust one or two pokémon fights before breakfast.\n\nBrock\nThis is lunch, so that would be before lunch.\n\nPikachu\npika..chu...\n\n\n\t(Has the Japanese Pokémon intro music through this battle \nthe whole time. Ash pulls out a pokéball and throws out \nBulbasaur. Then the pirate throws out Donfan. Bulbasaur charges \nand Donfan rolls into a ball and hits Bulbasaur, then turns \naround and hits him again! Then he tries it again but Bulbasaur \nuses Solar Beam and Donfan faints. The Pirate then sends out \nMachamp. Ash sends out Squirtle. Machamp kicks Squirtle down and \nthen goes to kick him again but Squirtle dodges it and bubbles \nhim till Machamp faints. The pirate gets mad and throws 3 \npokéballs down. one is a Venomoth another is a Golem and the \nother is a Pinsir. Pikachu jumps off ashes shoulder and does \nThundershock and all 3 faint.)\n\n<b>   \n</b>\nPirate\nOh My God! \n\t(this was possibly the funniest part of the entire movie :)\n\nAsh\nI did it!\n\nMisty\nIt was just because your opponent was weak.\n\nBrock\nHe didn't even raise them well\n\n\n\t(flash to Team Rocket who is on a cliff watching our \nheroes.)\n\nJames\nPikachu gets stronger and stronger.\n\nJessie\nBeautiful\n\nMeowth\nWe couldn't beat him even once. But the word surrender isn't in \nour dictionary.\n\nJessie\nI will get that Pikachu.\n\nJames\nBut look at that. \n\t(looks at them all eating)\n\nMeowth\nI'm so hungry.\n\nJessie\nI got a frying pan...\n\nMeowth\nWhat good is such a thing without meat and vegetables? It's just \nan iron board.\n\n<b>---------------------------------------------\n</b>A Fearow with a camera flies over head then it shows inside some \nplace where you can see Ash and Pikachu on the screens.\n<b>---------------------------------------------\n</b>\n<b>     \n</b>\nLady\nAre you sending them an invitation?\n\nMewtwo\nCertainly.\n\t(Dragonite flies out of the control center with a purse. It \nflies over the sees and then over Team Rocket and they fall then \nit flies over Ash and everyone's head knocking them all over then \nshe lands.)\n\nAsh\nWhat are you? \n\t(Dragonite hands Ash an invitation)\nThis? For me?\n\t(He hits a button and a hologram of the lady is displayed)\n\nLady\nPlease forgive me for the abrupt letter.\n\nBrock\nWhat a beautiful lady...\n\nLady\nSince you are a promising pokémon trainer of the future, we'd \nlike to invite you to a party of my master who is the strongest \npokémon trainer in the world. The place is the New Island, \nPokémon Castle. Please check the reply card for whether your \ncoming or not. Please accept the invitation for the strongest \ntrainer in the world.\n\nBrock\nBeautiful Lady...\n\nMisty\nWhat do we do?\n\nBrock\nLets go for it. We should go for it.\n\nAsh\nI don't feel uncomfortable with being told I'm a promising future \ntrainer.\n\nMisty\nWell then check yes on the card.\n\n\n\t(They check yes, and hand the invitation back to Dragonite. \nDragonite takes the card and flies off but Jessie, James and \nMeowth take out a net in an attempt to steal this rare pokémon. \nAsh's invitation falls out of Dragonites purse.)\n\nJessie\nDon't say Goodbye without saying hello.\n\nMeowth\na post card?\n\n<b>---------------------------------------------\n</b>Scene change. We see Mewtwo waving his hand back and forth moving \nthe clouds, causing a big storm to start. We then see mew \nsleeping in a bubble underwater as the bubble floats to the top \nand pops, Mew wakes up and flies off. Ash and everyone run out of \nthe storm and into a ocean side house that has all the other \ntrainers who were invited.\n<b>---------------------------------------------\n</b>\nA Trainer\nCalm down Kingler! Cut it out!\n\t(Our heroes run inside wet.)\n\nAsh\nIt was a beautiful day!\n\nBrock\nThe weather along this beach can change easily.\n\t(we notice a big crowd of trainers by the door and Officer \nJenny standing with a woman talking to them all)\n\nCrowd\nHuh? The ferry has been canceled?\n\nSweet\nWe can't go to the New Island?!\n\nCrowd\nOh No! We were invited to go!\n\nOfficer Jenny\nBe quiet everyone. Here is the Pier Master.\n\nBoijer\nI'm Boijer. If you want to know about the sea ask the seagulls on \nthe pier. No need to bother. Just look at the flaw of the clouds. \nI've never seen such a hurricane in all my years.\n\nOfficer Jenny\nIs it that terrible?\n\nBoijer\nI grew up on a port and I've never experienced such a storm. \nBesides the storm is above New Island offshore of this pier. I \ncan't let you be placed in danger. That's my wish as the one who \nguards this pier.\n\nOfficer Jenny\nAs you heard the ferry has been cancelled.\n\nUmio\nIts okay with my pokémon. My pokémon are stronger in water. I can \ncross the sea.\n\nBoijer\nWait. I'm the one who knows the sea and I say no!\n\nOfficer Jenny\nShe's right! Besides if the pokémon were to get hurt now they \nwouldn't be able to get treatment at a Pokémon Center.\n\nAsh\nWhat do you mean?\n\nOfficer Jenny\nNurse Joy at the Pokémon Center is missing. Pokémon can't receive \ntreatment without Nurse Joy. The poster over there is the missing \nperson report\n\t(Brock looks at it)\n\nBrock\nBeautiful... Who? I've seen her somewhere before...\n\t(Some of the trainers go outside in the storm wanting to \ncross the ocean. Soroa gets onto his Pidgeot and flies off. Umio \ngets on his Gyarados and swims across.)\n\nOfficer Jenny\nStop! Stop or I'll arrest you!\n\t(Sweet gets on her Dewgong and starts swimming away.)\n\nBoijer\nThere's no use trying to stop them. After all they're pokémon \ntrainers. If they were children who would stop after being told \nto, they wouldn't have gathered here. Let's just pray for there \nsafety.\n\t(Ash, Brock, Misty and Pikachu run outside and see everyone \nleaving.)\n\nAsh\nAcross the sea lives the strongest trainer in the world. I can't \ncop out now.\n\nMisty\nBut we can't cross this sea using our pokémon.\n\nAsh\nRight.\n\t(A Small wooden ship pulls up with 2 people in it. Guess \nwho?)\n\nJessie\nWant a ride? Not saying that it's free but depending on the \nsituation. I might allow you onboard. \n\t(They get on and start going and Meowth is dressed like a \ngirl in front of the boat, then a huge wave and Team Rocket's \ncostumes fall off. then the waves start getting really rough.)\n\nAsh\nYou guys! You guys again?!\n\nBrock\nYou guys appear at the very worst times!\n\nAsh\nWhat do you want?\n\nJessie\nIf we're asked what we want...\n\nJames\nThe answer to that is..\n\nMeowth\nThere's no time for saying that!\n\t(A huge wave flips the boat. Misty shoots out Staryu and \nswims to the surface.)\n\nBrock\nAsh! Misty!\n\t(Misty comes up and he grabs onto Staryu.)\n\nMisty\nWhere is Ash and Pikachu?!\n(A big wave comes again, and they go back under and see As h \nswimming up with Squirtle.)\n\n<b>  \n</b>\nAsh\nHold on tight everyone!\n\t(Squirtle and Staryu keep swimming under the waves until \nthey see light. Then it shows Mew flying above the clouds. Ash \nand everyone get to the castle and climb out of the water, and \nthe mysterious lady is standing there.\n\nLady\nWelcome to the New Island. Please show me your invitation.\n\nAsh\nHow's this?\n\t(He shows her).\n\nB rock\nThat was you just as I thought!\n\nLady\nYes?\n\nBrock\nThat picture of Nurse Joy I saw in the missing person report at \nthe pier was you.\n\nMisty\nThat reminds me, she looks like her.\n\nLady\nI don't know what your talking about. I've been serving this \ncastle ever since I was born. Come this way. The other guests are \nalready waiting.\n\n<b>---------------------------------------------\n</b>They go inside and Team Rocket floats up from the water on top of \nWeezing. Then it shows Mew playing with the windmill on top of \nthe castle. MEANWHILE Ash and everyone are inside the castle.\n<b>---------------------------------------------\n</b>\nLady\nThose are the trainers who have already arrived.\n\nAsh\nOnly 3?\n\nLady\nThe trainers who couldn't cross that storm aren't worth inviting.\n\nBrock\nSo then you tested us?\n\nLady\nPlease take out the pokémon from the pokéballs and be seated. You \nare the chosen trainers.\n\nJames\n\n\t(outside and the front door shuts)\nWell then, let's sneak into this castle...\n\nJessie\nThe only way is to use the exit.\n\nMeowth\nWhere's the exit?\n\nJessie\nOver there...\n\nMeowth\nThe s..s..sewer!? I'm not a brown rat!\n\nJessie\nDon't complain!\n\t(All of a sudden Mew comes down from behind TR and looks at \nthem. Jessie turns her head but Mew disappeared.)\n\nJames\nWhat's wrong Jessie?\n\nJessie\nNothing lets go.\n\n<b>---------------------------------------------\n</b>Meanwhile...\n<b>---------------------------------------------\n</b>\nSorao\nYou came too?\n\nAsh\nYou?\n\nSorao\nI flew here. My Pidgeot can cross such a hurricane in one flight. \nEveryone greet them! \n\t(all his pokémon say their names Then they see a Gyarados.)\n\nUmio\nThat's my Gyarados. I rode him across the sea. Those kind of \nwaves are nothing for it. \n\nAsh\nGyarados is a brutal pokémon isn't it?\n\nUmio\nYeah, but if you can handle it, no one is more reliable.\n\nSweet\nMy pokémon are just the same over there. \n\t(points to her Blastoise, Wigglytuff, and more. Then all \nthe lights turn off, there is a bright beam of light coming down \nthe center of a huge spiral staircase.)\n\nLady\nThat you for waiting everyone. The strongest pokémon trainer is \ncoming. \n\t(All of a sudden Mewtwo starts floating down and all the \npokémon get worried.)\n\n\nLady\nYes, this is the strongest pokémon trainer and strongest pokémon. \nMr. Mewtwo.\n\t(The lights come back on and everyone can see him clearly.)\n\nAsh\nMewtwo?\n\nUmio\nA Pokémon is a pokémon trainer? It can't be. \n\t(It becomes apparent that MewTwo is telepathically \ncontrolling Joy...)\n\nMewtwo\nI've decided my own rules.\n\nMisty\nThat voice!\n\nBrock\nTelepathy!\n\t(Mewtwo raises Umio up in the air and throws him into a \npool \n\t(using his mind)\n\nUmio\nDarn it! Go Gyarados!\n\t(Gyarados attacks with Hyper Beam, it goes to Mewtwo and \nMewtwo stops it and turns it around and it hits Gyarados causing \nit to faint.)\n\nMewtwo\nThat was easy. \n\t(looks at Joy)\nI no longer have any need for you anymore.\n\t(Joy faints into Brock's arms)\n\nBrock\nNurse Joy.\n\nNurse Joy\nWhere is this place? Why am I here?\n\nMewtwo\nTo make you take care of me, I took you from the Pokémon Center. \nA doctor who is familiar with pokémon is convenient. You were \nquite useful. You don't remember anything though.\n\nBrock\nWhat did you say?\n\nMewtwo\nHumans can be manipulated in any way with my power.\n\nMisty\nWith what power?\n\nPikachu\n<b>PIKA!\n</b>\t(Meanwhile TR are in the castle and they find a strange \nroom and they enter it.)\n\n\nMeowth\nWhat is this place? \n\t(They look and see a Charizard, Venusaur and a Blastoise in \nBig Glass Test Tubes sleeping.)\n\nMeowth\nCute!\n\nJames\nIs it really?\n\nJessie\nThese aren't like any treasures I've seen.\n\t(Jessie walks away and sits on some button and a computer \nturns on with a very fuzzy screen.)\n\nComputer\n...our study... to continue in our research ... we would have to \ncollect samples from our test subjects...\n\t(All of a sudden something grabs Meowth and throws him in a \nmachine)\n\nMeowth\n<b>HELP! HELP!\n</b>\nJessie\nMeowth!\n\t(Both Jessie and James start pull to get Meowth out and \nthey do get him out but not before the machine got 3 hairs from \noff of his tail.)\n\nMeowth\nOUCH! My hair!\n\t(on the computer screen a figure of a Meowth shows up and \nthe computer starts saying some weird stuff then in an empty test \ntube next to Team Rocket, a Meowth falls down from a pipe into \nit)\n\nAll of TR\n<b>MEOWTH?!\n</b>\nMeowth\nI am Meowth.\n\nJames\nThen this is.... Meowth's copy? \n\t(Mew appears behind Team Rocket again.)\n\nComputer\nBut the copy we created is more than we've imaged. The pokémon \nwhich we found.... in the depths... it's name is Mew... We \nsucceeded in finding fossilized eye lashes of a mew. From the \ngathered components we created Mewtwo with this machine. The goal \nwas to make the strongest pokémon with our own hands. That was \nour dream. But soon Mewtwo displayed unmeasurable violence. Its \nall over. The research office will be destroyed. The only way \nleft to abandon this place and escape. \n\t(the computer shuts off)\n\nJessie\nThis is the research office?\n\nJames\nI think so.\n\nMeowth\nYeah\n\nJames\nBut there's nothing wrong with it.\n\nJessie\nOr maybe something created it again.\n\nJames\nBut who?\n\nMewtwo\nI thought of working with humans once. But I was disappointed. \nHumans are the worst creatures inferior to pokémon. If creatures \nthat are weak and cruel like humans control this world, this \nplanet will come to ruin. \n\nBrock\nAre you saying like your gonna rule it?\n\nMewtwo\n\n\t(shakes his head)\nPokémon are no good either because this planet is ruled by humans \nour pokémon... pokémon who lived for humans.\n\nPikachu\nPika..pika pika!\n\nMewtwo\nWhat did you say? You're not being controlled? You're with the \nhumans because you want to be? To be with them by itself is \nwrong.\n\t(Mewtwo lifts Pikachu up with his mind and throws him but \nAsh jumps back and catches him!)\n\nPikachu\npika!\n\nAsh\nPikachu!\n\nMewtwo\nWeak pokémon rely on humans.\n\nMisty\nAsh! Are you ok?\n\nAsh\nYeah. How dare you attack Pikachu?!\n\nSoroa\nWe can get him no matter what kind of pokémon he is, as long as \nhe's a pokémon, GO RYHORN!\n\t(Ryhorn charges at Mewtwo and is 1 inch from him and Mewtwo \nstops him and raises him into the air, and shoots Ryhorn across \nthe room!)\n\n<b> \n</b>\nSoroa\nRyhorn!\n\nMewtwo\nIt's no use. I was born as the strongest of any pokémon in the \nworld.\n\nAsh\nYou don't know that before we try.\n\nMewtwo\nYou wan to try?\n\nAsh\nWe can ask for nothing better.\n\n<b>--------------------------------------------------------\n</b>Mewtwo eyes start glowing then it shows in the lab with Team \nRocket in it Charizard, Venusaur, and Blastoise come out of there \ntest tubes and walk out the door. then Mew flies out with them.\n<b>--------------------------------------------------------\n</b>\nJames\nWas that a..?\n\nJessie\nMew?\n\n\n\nMewtwo\nAny human who are aiming to be pokémon trainers go first. \nCharizard, Blastoise, Venusaur.\n\t(The 3 copies raise up from the ground.)These are the \nevolved forms of the copies I've made. \n\nSweet\nCopies?\n\nSoroa\nThey are...?\n\t(Everything starts shaking and a huge door opens and inside \nis a pokémon battle field.)\n\nBrock\nA battle field? Is he going to have a pokémon battle?\n\nSoroa\nI've got Venusaur for that copy one!\n\nSweet\nI've got Blastoise for that copy one!\n\nAsh\nI've got Charizard too. Charizard I chose you!\n\t(Charizard comes out and gives Mewtwo and evil look then \nshoots fire out at him but Mewtwo makes a force field around him \nso it doesn't even touch him.)\nCharizard, that's a surprise attack. \n\t(Mewtwo shoots up water and the fire goes out.)\n\nMewtwo\nWhat a bad tempered Charizard. So who's first?\n\t(Soroa's Venusaur walks out.)\n\n\nSoroa\nI was careless before, but it won't go that way this time.\n\n\n\t(The copied Venusaur walks out.)\n\nSoroa\nVenusaur! Razorleaf!\n\nMewtwo\nVine Whip.\n\t(Copied Venusaur's vines chop up the razor leafs then his \nvines wrap around Venusaur and tosses him across the room!)\n\nSoroa\nVenusaur!\n\nSweet\nI'm next! Go Blastoise!\n\t(Mewtwo points for copied Blastoise to go.)\n\nSweet\nBlastoise, Hydro Pump!\n\t(Copied Blastoise spins right threw the water and hits \nBlastoise causes him to go crashing hard into the wall.)\n\nSweet\nBlastoise!\n\n<b> \n</b>\nMisty\nBe careful Ash! His skills are strong!\n\nAsh\nI know.\n\t(Mewtwo signals Copied Charizard to go.)\n\nAsh\nCharizard! Lets fight with speed not power! Okay go!\n\t(Both Charizard fly up. Ashes Charizard keeps using Flame-\nthrower but copied Charizard dodges them all and keeps hitting \nCharizard in the stomach.)\n\nMisty\nWhere are the speed attacks?\n\nBrock\nThe enemy is to fast!\n\t(Copied Charizard grabs Charizard and starts flying down to \nthe ground!)\n\nAsh\nCharizard!\n\nMewtwo\nDive Bomb Slam!\n\nCharizard hits into the ground then gets up.. roars loudly.. then \nfaints.\n\nAsh\n\n\t(Runs out to Charizard)\nHold on Charizard! Are you okay?\n\nMewtwo\nBoth speed and power are lacking.\n\t(Mewtwo then throws his hands up and 3 black pokéballs \nappear he shoots them all out and captures Sweet's Blastoise \nanother gets Soroa's Venusaur and the other captures ashes \nCharizard! A small gold statue lifts up and the 3 balls shoot \ndown into the hole.)\n\nAsh\n<b>STOP!\n</b>\nMisty\nAre you taking the other's pokémon?!\n\nMewtwo\nTaking them? No. I'm going to make stronger copies than the \npokémon you are so proud of.\n\t(Mewtwo raises his arms again and hundreds of Black \npokéballs appear!)\nIt's suitable enough for me.\n\nBrock\nCopies?\n\nAsh\nStop! That's a violation of the rules!\n\nMewtwo\nDon't tell me what to do. \n\t(Mewtwo looks at Ash and throws him into Brock)\nI've decided my own rules.\n\t(Mewtwo drops his arms and all the black pokéballs start \nflying everywhere)\n\nBrock\nThey're Coming!\n\nAsh\nRun everyone!\n\n<b>--------------------------------------------------------\n</b>The pokéballs are everywhere catching the trainers pokémon, the \nGyarados was caught then the Golduck, then Seaking, then Scyther, \nthen Hitmonlee, then Sandslash the trainers are trying to protect \nthere pokémon but there is nothing they can do! then Dewgong was \ncaught, then Rapidash, then Vileplume. Then Bulbasaur and \nSquirtle are fighting them off, then Wigglytuff was caught, then \nPidgeot and when they get caught the pokéballs fly back into the \nwhole under the statue lifted up in the air.\n<b>--------------------------------------------------------\n</b>\nAsh\nI've got it! Take your own pokémon back to your own pokéballs! \nReturn Squirtle and Bulbasaur! \n\t(they both go back into their pokéballs)\n\n\n<b>  \n</b>\nMewtwo\nIt's no use.\n\t(2 black pokéballs go to Ash, open, and capture the \npokéballs Bulbasaur and Squirtle are in!)\nNothing is impossible with the black pokéballs I have made. \n\t(Misty puts Togepy in her bag and shuts it tight while \nBrock holds Vulpix close.)\n\nNurse Joy\nThis place is no good. Let's run outside!\n\t(Nurse Joy, Psyduck, Misty and Brock start running but then \na black ball catches Psyduck)\n\nMisty\nMy Psyduck!\n\t(A black ball catches Vulpix.)\n\nBrock\nVulpix!\n\t(Pikachu is being hunted down by tons of black pokéballs! \nThen Pikachu falls and is about to be caught! But Ash jumps in \nfront of him and the pokéballs hit him.)\n\nAsh\nRun Pikachu! \n\t(Pikachu is running and starts climbing the spiral stairs \nwith ash running after him. Pikachu keeps using Thundershock to \nblow up all the pokéballs around him but more keep coming! Ash \nstarts running up the stairs a little behind Pikachu)\nDon't give up Pikachu! \n\t(Pikachu gets tired and he accidentally falls of the \nstairs! Ash jumps after him and is about to grab him but then a \nblack pokéballs snatches Pikachu! But Ash catches the pokéball \nand then falls into some water but when he does the pokéballs \nslips out of his hands and goes into the hole. Since it was the \nlast pokémon the statue starts to drop but Ash just barely makes \nit and jumps down into the hole after the Pikachu in the ball! \nTeam Rocket is still in the Lab, which is where all the copies \nare going. They are amazed at all the copies dropping into all \nthe test tubes everywhere but then Ash falls down chasing after \nPikachu!)\n\nJessie\nBrat?\n\nAsh\nI'm sorry, I don't have time to deal with you today!\n\t(Ash jumps and grabs Pikachu's pokéball but right when he \ndoes about 25 little metal mini hand like things come down trying \nto keep Pikachu, Ash is fighting off the mini hands.)\nLet it go! Darn it! Let him go! Let go of my Pikachu! Let go! \n\t(All the hands break and the whole copy machine starts \nblowing up and Pikachu comes out of his ball.)\nPikachu!\n\nPikachu\nPika!\n\nBut then all the Copy pokémon start coming out of there tubes \nbecause the whole copy machine is all blown up. All the copies \nstart walking out of the room.\n\nJessie\nOh no! There coming out!\n\nMeowth\nMy copy to!\n\nAsh\nThose are all copies?\n\nJessie\nWhere are they all going?\n\nAll of a sudden there's an explosion and all the black pokéballs \ncome out and all the original pokémon come out!\n\nJames\nThe real ones have come out to!\n\n2 of the black balls open and 2 normal pokéballs come out, then \nthose open and Squirtle and Bulbasaur come out! Ash and Pikachu \nruns over and starts laughing and hugging each other then ash \nstops and looks up and looks angry!\n\nMeanwhile up stairs...\n\nMewtwo\nHumans, I won't take your lives too. Leave here.\n\nThe doors open to the exit.\n\nMewtwo\nThat is if you an make it out in that storm.\n\nThen there is an explosion and all the copied pokémon come \nwalking out.\n\nMewtwo\nWhat happened here?\n\nFrom the smoke, Ash and all the original pokémon come walking \nout.\n\nAsh\nI can not forgive...! I will not forgive you!\n\nMisty/Brock\nAsh!\n\nMisty\n\n\t(sees Psyduck)\nPsyduck!\n\nBrock\n\n\t(sees Vulpix)\nVulpix!\n\nMewtwo\nDid you set them free?\n\nAsh\nI will protect my pokémon, my friends.\n\t(Ash charges at Mewtwo and goes to punch him but Mewtwo \nthrows him down to the ground. Ash gets up and tries again and \nMewtwo lifts him up.)\n\nMisty\nAsh!\n\nBrock\nStop!\n\t(Mewtwo throws Ash into a huge statue but just as he's \nabout to hit it -which we know would really hurt\na pink bubble stops him and Ash bounces a few times on that.)\n\nMewtwo\nWhat?\n\t(Mew flies up to Ash and stares at him, Ash then looks at \nMew and Mew pops the bubble and Ash falls -only like a foot then \nMew starts giggling.)\nYou're... \n\t(Mew makes another bubble and starts jumping up and own on \nit giggling and having a good time, then Mewtwo makes a black \nelectric ball and shoots it up and it pops mew bubble. Mew turns \naround and looks at Mewtwo confused. Mewtwo makes another and \nblows up when it hits Mew. Mewtwo makes 3 more and throws them \nall up at Mew, Mew dodges them all and starts giggling again.)\n\nBrock\nThat's...\n\nMisty\nPokémon?\n\nMew flies down and looks at Mewtwo\n\nMewtwo\nMew. The pokémon that's supposed to be the rarest pokémon in the \nworld.\n\nBrock\nMew? \n\t(Mew looks around at everyone... I love this guy!)\n\nMewtwo\nI was made from you. But I am the stronger one...I am the true \none.\n\t(Mew is still looking around acting like its paying no \nattention to Mewtwo.)\n\nBrock\nMew and Mewtwo.\n\nSweet\nMewtwo was made from Mew.\n\nMewtwo\n\n\t(starts glowing)\nI am the only one who will survive. \n\t(Mewtwo starts chasing mew everywhere shooting tons of \nthose black electric balls at him. But Mew keeps running away \ndodging everything.)\n\nMewtwo\nWho don't you want to fight? The reason why you avoid fighting is \nbecause your afraid of me? \n\t(Mewtwo makes another black electric ball and shoots it at \nMew and knocks Mew right in the face and mew goes flying in the \ndistance. Everyone is then shocked, but then the same type of \nball only blue comes back and hits Mewtwo and he goes into a \nwall. Mew flies back down. and Mewtwo floats up from the fire and \nrubble. TR Enters the room.)\n\nMewtwo\nYour attacks are ineffective against me. Now is the time to \ndecide which one of us is the true one, you the copy... which is \nthe stronger? We were made stronger than the real ones.\n\nMew\nmew, mew..mew mew mew...mew, mew..mew mew mew\n\nMeowth\nI see.\n\nJessie\nWhat is it saying?\n\nMeowth\nThe real one is real. If they fight only using bodies without \nskills. The true ones will not be beaten by their copies\n\nMewtwo\nThe real one is real?.... Fine! \n\t(Mewtwo shoots another black electric ball at Mew but Mew \ndodges it and just barely misses Ash! Ash then starts climbing \ndown the statue.)\nLets decide which is the real one without skills. You're the \nstronger ones, GO! \n\t(All the copies start attacking their originals. The copies \nare winning. Mewtwo makes a visible blue force field around \nhimself. Mew does the same except its pink and they fly up high \nin the air and keep ramming into each other. Then Pikachu is \nlooking around at the big copy war then he sees his copy standing \nthere ready to fight him! Pikachu can't believe it.)\n\n\nNurse Joy\nWhat is this fighting? Both the real ones and copies are alive \nnow.\n\nSweet\nEveryone is a living thing\n\nBrock\nThough they were created, there are living beings that live in \nthis world.\n\nMisty\nThe real ones and the copies... But both of them are the same \nliving things. There's no such thing as a win and losing.\n\nJames\nIf we were asked that, I wouldn't know what to say\n\nJessie\nI feel so sorry\n\nJames\nThey're bullying themselves.\n\nJessie\nIts like seeing what we used to be.\n\nJames\nIts like seeing what we are now.\n\nBoth\nFeels Bad! \n\t(Meowth's copy walks up to Meowth.)\n\nMeowth\nIts you! \n\t(they take out there claws and are ready fight)\nThis is gonna hurt. But every pokémon is fighting each other, \nyou're unfair.\n\nCopy Meowth\nMeow meow...\n\nMeowth\nWhat? I'm more unfair? It's because I'm not fighting with you? \nYour nails would hurt more wouldn't they?\n\nCopy Meowth\nmeow meow meow\n\nMeowth\nYou said tonight's moon would be round? You're right, it must be \na full moon.\n\nCopy Meowth\nmeow meow\n\nMeowth\nTalking about the moon at a time like this is tasteful. Its \nphilosophical.\n\t(Meanwhile Mew and Mewtwo are still bouncing around \nfighting. And Ash finally makes it back to the ground.)\n\nAsh\n\n\t(looks at everyone fighting and getting so tired)\nThat's Enough! Stop!\n\nBrock\nAsh!\n\nAsh\nI've got to stop them.\n\nBrock\nNo. The battle will continue unless Mew and Mewtwo stop fighting.\n\nNurse Joy\nAnimals don't hand over there territory to the same type of \nanimal.\n\nMisty\noh no.\n\nNurse Joy\nThey will fight until they drive their opponents away. That is \nthe way of living beings.\n\nBrock\nThat may be for living beings but Mewtwo was made by humans.\n\nMisty\nBut now he's a living being. \n\nAsh\nNow they are all living beings. Mew and Mewtwo, Pikachu and that \nother Pikachu. \n\t(Mew and Mewtwo's fight finally goes on ground and they \nboth take off there force field. Mew and Mewtwo both shoots a \nbeam out at each other and starts to run between them not seeing \nthe 2 beams coming!)\nStop!\n\nBrock\nAsh! \n\t(Both beams hit Ash and he falls to the ground and turns to \nstone.)\n\nMewtwo\nIt can't be. A human tried to stop our fight. \n\t(Pikachu runs out to Ash and starts shaking Ash. Then he \nthunder shocks him many times and Ash still doesn't move. Pikachu \nbegins to cry. Then all the other pokémon look at Pikachu -\nincluding the copies\nand they start crying. All there tears float over and land on ash \nthen last, Pikachu's tears fall onto Ash and Ash regains his hold \non life, and turns back to flesh from rock)\n\nAsh\nPikachu!\n\nPikachu\nPika pi!!\n\nMewtwo\nActually, both you and I are pokémon that already exist.\n\nMew\nmew.\n\nMewtwo\nIt might be better if no one knows about us, or any of this...\n\nMew\nmew...\n\t(Mew and Mewtwo start flying away and then all the copies \npokémon lift up into the air and fly with them!)\n\nAsh\nWhy are you going everyone?\n\nMewtwo\n\n\t(flying away with all the copies)\nWe were born and alive. We will continue to live somewhere in \nthis world. \n\t(All of a sudden the whole castle fills up with bright \nlight and everyone disappears......... Now we are back where all \nthe trainers what to go on the ferry.)\n\nOfficer Jenny\nThe ferry has been canceled! There's a hurricane coming!\n\nNurse Joy\n\n\t(walks through the crowd)\nDon't worry everyone. I'm going to open the Pokémon Center as a \nshelter. Follow me those who need it.\n\nBrock\nNurse Joy, the officer, and Ms. Boijer. Even more beautiful than \nusual when they are wet by the rain.\n\nAsh\nBut why are we here?\n\nMisty\nI don't know. We're here because we're here.\n\nAsh\nIt doesn't matter. Well... Huh? \n\t(Everyone runs outside)\nIt can't be...\n\nOfficer Jenny\nThe hurricane... it's as if it never existed.\n\nBoijer\nI can run the ferry for again tomorrow.\n\nAsh\n\n\t(looks up and sees a mew in the sky)\nLook.\n\nMisty\nWhat? I can't see anything.\n\nBrock\nBesides the clouds.\n\nAsh\nOn the day I left to become a pokémon trainer, I saw a phantom \npokémon... and now.. I've seen it again.\n\nBrock\nPhantom Pokémon.\n\nAsh\nYes, someday I will \n\t(Meanwhile, TR is still on the New Island except now the \ncastle is gone.)\n\nJessie\nWell if its this empty...\n\nJames\nClean and clear...\n\nMeowth\nAnd different than it usually is. \n\nJessie/James/Meowth\n<b>FEELS GOOOOOOOOOOOOOOOOD!!!!!\n</b>\n\n\n<b>------------------------------------------\n</b>End theme\n<b>------------------------------------------\n</b>\nWhere do I keep walking too? I stop, asked by the wind. Efforts \nto celebrate your birthday increase, You left the one and only \nhome town for a journey Still seeking something even now. Big \nEyes Are Shining There not with your but with someone else. Many \nhellos and Many Good-byes. A Bit of memory like an illusion. \nWhere do you keep walking to? Asked by the wind as you look over \nthe sky Where am I going to keep walking? Lets start walking with \nthe wind! Standing Firmly on the ground lets go on forever... \nUntil catching the dream we're aiming for. Standing Firmly on the \nground lets go on forever... Until catching the dream we're \naiming for. La La La La La La La La La La La La La La La...\n\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Pokemon: Mewtwo Returns</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Masamitsu Hidaka\" title=\"Scripts by Masamitsu Hidaka\">Masamitsu Hidaka</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Animation\" title=\"Animation Scripts\">Animation</a>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a>  <a href=\"/genre/Family\" title=\"Family Scripts\">Family</a>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Pokemon: Mewtwo Returns Script.html#comments\" title=\"Pokemon: Mewtwo Returns comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:13:39.090307"}