{"title": "Postman, The", "film_link": "/Movie Scripts/Postman, The Script.html", "script_link": "/scripts/Postman,-The.html", "info_raw": "\n\nPostman, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (2.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Brian Helgeland  Eric Roth\nGenres  Action  Adventure  Drama  Sci-Fi\nScript Date : November 1996\n\nRead \"Postman, The\" Script\n\n\n", "script": "\n      THE POSTMAN\n\n            screenplay by\n\n     Brian Helgeland and Eric Roth\n\n\n\n        based on the novel by\n\n              David Brin\n\n\n\n\n           November 4, 1996\n\n        Early Production Draft\n\n\n\n\nFOR EDUCATIONAL PURPOSES ONLY\n\n    FADE IN:\n\n\n1   EXT. DESERT LANDSCAPE (UTAH) - DAY                            1\n\n    Jagged mountains defy a dark, foreboding sky. We hear\n    PLODDING HOOVES, CREAKING LEATHER. A lone wanderer\n    appears. Wearing a long coat and a battered hat, he\n    carries a bolt-action carbine. His name forgotten,\n    history remembers him simply as THE POSTMAN.\n\n    His laden pack mule, BILL, BRAYS, as they pass a battered\n    sign: \"The Great Salt Lake Marina.\" They start down a\n    slope and begin to cross a...\n\n\n    DRY LAKE BED\n\n    A bizarre, wind-swept sight. Dozens of boats resting lee-\n    to on the dry, cracked earth. It's like God pulled the\n    plug. Rusty mooring chains snake their way around house\n    boats, ski boats and a cabin cruiser or two.\n\n                             WOMAN (V.O.)\n               The last of the great cities died\n               when my father was a child.\n               Another victim of yet another war.\n               The plagues followed. And the\n               terrors. The living hid\n               themselves away in tiny hamlets in\n               hopes of surviving whatever new\n               madness conspired to rob them of\n               the little that remained. The\n               Earth itself had fallen prey to\n               chaos. For three years a dirty\n               snow fell that even summer could\n               not erase. The ocean was barren.\n               Poisoned. Near death.\n\n    As The Postman continues to cross, the CAMERA PULLS BACK.\n    He's soon lost in the massive vista.\n\n                             WOMAN (V.O.)\n               Sixteen long years passed before\n               the great lungs started working\n               again. My father said it was as\n               if the ocean breathed a great sigh\n               of relief...\n\n    A RUMBLE of THUNDER. RAIN begins to fall. The earth just\n    sucks it up at first, but it's coming hard. Rivulets run.\n    Puddles form. We begin to get the feeling that soon these\n    boats will be tugging at the mooring chains once again.\n\n                                                    (CONTINUED)\n\n                                                           3.\n\n1   CONTINUED:                                                   1\n\n    TRACK a rivulet as it runs, filling up a depression in the\n    sand. And then, running to fill another in a series of\n    depressions. They make a pattern we recognize as --\n\n\n    MAN'S FOOTPRINTS\n\n    These tracks may already be days old as they fill with\n    rain water. Then, the sound of light, padded FOOTFALLS.\n    A LION ENTERS FRAME. Lean, hungry and dangerous, the big\n    cat has been tracking this man. He lets out a low,\n    disappointed GROWL. The rain has foiled his dinner\n    plans -- for now.\n\n\n2   EXT. HIGHWAY ON-RAMP (UTAH) - DAY                            2\n\n    A bullet-ridden sign reads: \"U.S. 84 North.\" The Postman\n    leads Bill down a barren 4-lane. Weeds poke up through\n    the asphalt. The rusting hulk of a car rests in the\n    median, covered in a tangle of purple wisteria. The\n    Postman plucks a flower. He sticks it into a buttonhole\n    and continues.\n\n    BILL BRAYS woefully.    In answer:\n\n                               THE POSTMAN\n                 I don't know. And if you ask me\n                 again, I'm going to slug you.\n\n    They near a sign: \"Thank You For Visiting Utah.\" The\n    Postman waves, shouts to the sign as he passes it.\n\n                               THE POSTMAN\n                 It's been fun, hasn't it, kids?\n                        (to the sign)\n                 You're welcome!\n\n\n3   EXT. 4-LANE (IDAHO) - BILLBOARD - DAY                        3\n\n    Bill tugs up weeds as The Postman is climbing up a ladder\n    on a highway that razor cuts the plains to the horizon.\n\n    Above, The Postman sands atop a billboard catwalk. He\n    references a tattered road atlas, scans the horizon\n    through binoculars with one broken lens. He pauses at a\n    Union 76 ball just visible above the tree line.\n\n                                                            4.\n\n4   EXT. HIGHWAY TRAVEL STOP (IDAHO) - DAY                        4\n\n    A 76 Station and the remains of a Howard Johnson's.\n    Alert, carbine in hand, The Postman leads in the mule.\n    Rusting cars sag on flattened tires. There's a stripped\n    fire engine, its cracked hoses leading to the HoJo\n    foundation which bristles with burned timbers.\n\n    Bill stops to drink out of a stream.   The Postman swats at\n    him with his hat.\n\n                            THE POSTMAN\n              Damnit, Bill, you know I need to\n              check it first!\n\n    Bill hangs his head. The Postman digs through his pack.\n    He removes an old Tupperware container and replaces its\n    contents -- a tiny sheaf of litmus papers and several\n    small bottles -- with stream water. He adds a few drops\n    from each bottle. Swirls it around. Then dips a tiny\n    strip of paper into the water. The paper turns a vivid\n    purple. The Postman is dubious.\n\n                            THE POSTMAN\n              Better than turpentine.\n                     (touches some\n                      to his lips)\n              Tastes about the same. Your call,\n              Bill.\n\n    Bill drinks.\n\n                            THE POSTMAN\n              You ain't picky, Bill. I like\n              that about you.\n\n    The Postman takes his carbine and a burlap sack and\n    crosses to the 76 Station. An old extension ladder on the\n    ground. The pole holding up the 76 ball has a 30-degree\n    bend in it, like someone once tried to pull it over.\n    Beyond the 76 ball, the sun sets -- but we here in the\n    20th Century have never seen such a wild riot of color\n    before.\n\n    The Postman tries the station door. Locked. Smiling\n    ironically, he steps in through the blown-out window.\n\n\n5   INT. 76 STATION - OFFICE - DAY                                5\n\n    A shambles. The Postman kicks around the table. He finds\n    a few beat-up CDs, flips through them. Reads the label.\n\n                                                   (CONTINUED)\n\n                                                              5.\n\n5   CONTINUED:                                                      5\n\n                               THE POSTMAN\n                 'Running on Empty'? Tell me about\n                 it.\n\n    Tossing it, he turns, stops. There, resting on a pile of\n    trash is a bashed-in portable TV. The Postman smiles.\n\n                                THE POSTMAN\n                 Hey, Bill! We got TV! 147\n                 channels. Everything from Jesus\n                 to 'Jeopardy'.\n\n    He steps over, switches on the set.      Nothing happens, but\n    The Postman pretends just the same.      He mimics static,\n    then:\n\n                               THE POSTMAN\n                 'Like sands through the hour-\n                 glass, so are the days of our\n                 lives...'\n                        (switching channels)\n                 'Michael Shields, come on down,\n                 you're the next contestant\n                 on...'The Price is Right'.'\n                        (switching again)\n                 I'll take Domestic Nuclear\n                 Disasters for two hundred\n                 thousand, Alex...\n\n    The Postman stops suddenly.    Click.\n\n                               THE POSTMAN\n                 We interrupt our regularly\n                 scheduled program to bring you the\n                 Second Civil War... Well, shit.\n\n    The Postman stares at the blank screen a moment. There's\n    a sudden, panicked RUSTLING from behind the service\n    manager's desk. The Postman wheels around, raises the\n    carbine.\n\n                               THE POSTMAN\n                 I don't want any trouble... I bet\n                 you don't either... Let's just\n                 call it a draw, okay?\n\n    Sudden MOVEMENT. The Postman shouts in surprise as a Doe\n    dashes out from behind the desk. Scared, it bounds back\n    and forth between the walls. Then freezes in the corner.\n    The Postman sighs in relief, lowers the carbine.\n\n                               THE POSTMAN\n                 Look out, Bill!\n\n                                                      (CONTINUED)\n\n                                                               6.\n\n5   CONTINUED:    (2)                                               5\n\n    The doe bolts for the window and runs right into Bill.\n    Bill has a conniption fit.\n\n    Investigating further, The Postman spots a cigarette\n    machine. The front glass is smashed and all the slots are\n    empty. But he looks down to the lock at the bottom. It's\n    intact. He pulls a crowbar from the sack, crouches by the\n    machine and digs the pry into a seam and pulls.\n\n    The panel bursts open to reveal four half-open cartons of\n    cigarettes. He doesn't believe it for a second. Then:\n\n                               THE POSTMAN\n                 I'm rich.\n\n\n6   EXT. 76 STATION - NIGHT                                         6\n\n    Embers of a campfire glow.    The Postman is asleep, the\n    carbine in reach.\n\n    BILL BRAYS and nervously stamps his hooves. The Postman\n    reaches for the carbine only to find the barrel of a\n    shotgun pointed in his face.\n\n    Three BANDITS! Hard-eyed and ugly. One, barely 20, is\n    mostly just ugly. The Postman looks down the barrels of a\n    shotgun, a rifle and a revolver. The LEAD BANDIT kicks\n    the carbine out of reach.\n\n                               THE POSTMAN\n                 I'm just passing through. I don't\n                 mean anyone any harm.\n                        (re: stream)\n                 Water's good.\n\n    The Lead Bandit pokes at The Postman's shoulder with the\n    muzzle of his rifle. The Postman knows why.\n\n                               THE POSTMAN\n                 I'm not a Holnist.\n\n    The Lead Bandit pokes again. Harder. The Postman opens\n    his shirt, reveals his bare left shoulder.\n\n                               THE POSTMAN\n                 Okay?\n\n    They just stare at him, none saying a word.      Creepy.\n\n                               THE POSTMAN\n                 I'm headed for a town called St.\n                 Rose. Somewhere west of Portland.\n\n                                                      (CONTINUED)\n\n                                                             7.\n\n6   CONTINUED:                                                     6\n\n                               LEAD BANDIT\n                 Portland's under twenty feet of\n                 water.\n\n                               THE POSTMAN\n                 Well, I heard different.\n\n                               LEAD BANDIT\n                 You mouthin' me?\n\n                               THE POSTMAN\n                 No, it's just that it's hard to\n                 get good information.\n\n    The third BANDIT, a HULKING brute, has been quiet.\n\n                               HULKING BANDIT\n                 He is mouthin' you; I say we kill\n                 him.\n\n                               LEAD BANDIT\n                 Don't be in such a rush, Martin.\n                        (back to\n                         The Postman)\n                 Now I see a pack mule over there,\n                 but I don't see no packs.\n\n                               THE POSTMAN\n                 This is all I got.\n\n                               LEAD BANDIT\n                 Oh... Kill him, Martin.\n\n    The Hulking Bandit, raises his shotgun. The butt end.\n    He's going to bludgeon The Postman to death.\n\n                                THE POSTMAN\n                         (pointing)\n                 Okay!   My stuff's up there!\n\n    The 76 ball is twenty feet above the ground. In the gloom\n    you can just see a hole has been punched through the side.\n\n                               BANDIT #20\n                 What do you got in there?\n\n    The Lead Bandit swats Bandit #20 upside the head.\n\n                               LEAD BANDIT\n                 Shut up.\n                        (to Postman)\n                 What do you got in there?\n\n                                                     (CONTINUED)\n\n                                                               8.\n\n6   CONTINUED:    (2)                                               6\n\n                                THE POSTMAN\n                 Dried peas.   Beef jerky.\n                 Cigarettes.\n\n                                ALL THREE BANDITS\n                 Cigarettes!\n\n                                THE POSTMAN\n                 Sure.   There's the ladder.\n\n                               BANDIT #20\n                 Maybe he's got it booby-trapped.\n\n    The Lead Bandit is about to smack Bandit #20 again -- then\n    he sees the logic out of it. The Postman shakes his head,\n    but isn't that convincing.\n\n                               LEAD BANDIT\n                 You go up and get it.\n\n                                                     CUT TO:\n\n\n7   EXT. 76 BALL - DAWN                                             7\n\n    The ladder set against the bent pole. Prodded by a\n    shotgun, The Postman climbs, disappears through the hole\n    and into the tilting 76 ball.\n\n\n8   INT. 76 BALL - DAWN                                             8\n\n    Full of The Postman's earthly possessions. Trick is, how\n    to save them and his life at the same time. He spies an\n    old wrench: remnant of an attempt to remove the rusty\n    bolts holding the ball in place. An idea begins to take\n    shape.\n\n                               LEAD BANDIT (O.S.)\n                 Just you start tossing those\n                 cigarettes down!\n\n\n    BANDITS\n\n    There's no answer.     The Bandits eye each other nervously.\n\n                               BANDIT #20\n                 Maybe he fell asleep.\n\n                                                     (CONTINUED)\n\n                                                             9.\n\n8   CONTINUED:                                                     8\n\n    76 BALL\n\n    The Postman grabs the wrench, starts working one of the\n    last two rusted bolts. As it starts to give...\n\n                               THE POSTMAN\n                 It's going to take a second.    I\n                 got my stuff bolted in.\n\n\n    BANDITS\n\n    The Lead Bandit takes a cautious step back.\n\n                               LEAD BANDIT\n                 Put some buckshot through it,\n                 Martin. Just to hurry him up.\n\n                               HULKING BANDIT\n                 I only got three shells left.\n\n                               LEAD BANDIT\n                 So use his gun.\n\n    The Hulking Bandit picks up the carbine and aims. CLICK.\n    It isn't loaded. The Hulking Bandit tosses the gun aside,\n    pulls a knife from his boot. Grimly, he begins to climb.\n\n\n    76 BALL\n\n    Cramped, The Postman's busy at the base of the ball,\n    trying to unscrew the last remaining bolt. It won't\n    budge.\n\n\n    LADDER\n\n    The Hulking Bandit has only a few more rungs to go.\n\n\n    76 BALL\n\n    No good.   Time's up.   The Postman starts rocking the pole.\n\n\n    LADDER\n\n    The Hulking Bandit has reached the opening -- feels the\n    rocking motion. Hangs on.\n\n                                                     (CONTINUED)\n\n                                                          10.\n\n8   CONTINUED:    (2)                                            8\n\n    76 BALL\n\n    Knife in hand, the Hulking Bandit looks inside. At that\n    instant, The Postman rocks the pole one more time. The\n    rusty bolt is not enough to keep the ball's full weight in\n    place. It pops. The ball is frozen for an instant before\n    going with the pole's tilt.\n\n\n    LADDER\n\n    The 76 ball drops off the pole, rolling over the Hulking\n    Bandit's back and down the ladder's incline. The other\n    Bandits dive clear as the 76 ball hurtles past.\n\n\n    THE POSTMAN\n\n    whips head over heels as the ball speeds away.\n\n\n    FIELD\n\n    The 76 ball launches off a dirt berm, but soon comes to a\n    stop as it slams into an old utility pole and bursts\n    apart. Fighting the vertigo, The Postman staggers to his\n    feet.\n\n                               THE POSTMAN\n                 Bill!\n\n    Bill bolts from the station as the Lead Bandit raises the\n    RIFLE and FIRES at The Postman.\n\n    Losing balance, The Postman lands on his butt just before\n    a bullet splinters the utility pole above his head.\n    Wobbly, he tries to gather his packs. The Bandits charge,\n    quickly closing the ground, but Bill is there first.\n\n    Holding as much as he can, The Postman heaves himself over\n    Bill's back. As the mule gallops away, the Lead Bandit\n    aims the rifle. He's got The Postman in his sights.\n\n    He's about to fire when -- Bandit #20 stands up INTO the\n    SHOT. He's got a fistful of cigarettes in each hand and\n    he's laughing like a hyena!\n\n                               BANDIT #20\n                 We're rich!\n\n                                                            11.\n\n9    EXT. OVERLOOK HILL (IDAHO) - DAY                             9\n\n     The Postman sits on a rock, holding Bill's halter so the\n     mule must face him. They are in the midst of an argument.\n\n                             THE POSTMAN\n               It's true, we haven't done this in\n               a while, but it's like riding a\n               bicycle. Now, open your mouth.\n\n     The Postman pries his mouth open. Taking a toothbrush, he\n     tends to Bill's teeth, then gives him an appraising look.\n     BILL BRAYS.\n\n                             THE POSTMAN\n               I know the rule. It's my rule!\n               Avoid civilization at all costs.\n               But we gotta eat, don't we?\n                      (as BILL BRAYS again)\n               What are you so worried about,\n               Bill? All you gotta do is stand\n               there. I'm the one with all the\n               lines.\n\n     The Postman leads the mule down the hill toward the town\n     far below. Making his case all the while -- even as BILL\n     BRAYS in protest.\n\n\n10   EXT. VILLAGE SQUARE (IDAHO) - DAY                            10\n\n     A patch of mud. In the center of the square fifty\n     townspeople stand before a plank stage where The Postman\n     wraps up a performance of MacBeth. He plays it with a\n     mis-remembered gusto the people enjoy. Children\n     especially are enamored. A heavily-muscled man, WOODY,\n     lingers on the fringe of the crowd -- watching The Postman\n     with inscrutable intensity.\n\n                             THE POSTMAN\n               They said, 'Fear not, MacBeth,\n               'til Birnam Wood comes to\n               Dunsinane'!\n\n     He looks off stage for someone, but no one appears.\n\n                             THE POSTMAN\n               I said, Birnam Wood comes to\n               Dunsinane!\n\n     Bill trots on-stage. Covered with twigs, BILL is Birnam\n     Wood. He BRAYS lustily. The audience laughs in delight.\n     The children clap. Only Woody seems unaffected.\n\n                                                    (CONTINUED)\n\n                                                              12.\n\n10   CONTINUED:                                                     10\n\n     The Postman grabs two wooden swords -- he knows it's going\n     well.\n\n                                THE POSTMAN\n                  Arm, arm yourselves! If the\n                  witch's words are true, there'll\n                  be no running or hiding here!\n\n     Shaking off the twigs, Bill takes one of the swords in his\n     mouth. The two of them dash back and forth pretending to\n     fight off an imaginary attack. Finally, The Postman looks\n     out at the audience, remembers the words the best he can.\n\n                                THE POSTMAN\n                  Tomorrow, and tomorrow, and the\n                  day after that. Out brief candle!\n                  Life's but a walking shadow, a\n                  poor player that struts his hour\n                  upon the stage and is heard no\n                  more. It's a tale told by a\n                  moron. Full of sound and fury,\n                  signifying nothing.\n                         (waves sword)\n                  But blow, wind! Come wrack! At\n                  least we'll die with the harness\n                  off our back!\n\n     The audience erupts in applause. But Woody stands still\n     as stone. The Postman takes a bow. Even Bill does a\n     cross-legged dip. Knowing when to quit, he steps off the\n     stage to many hearty handshakes.\n\n     Woody watches his every move. MRS. THOMPSON, one of the\n     town's leaders, steps up. She's accompanied by crotchety\n     old CURMUDGEON LARRY.\n\n                                MRS. THOMPSON\n                  The children have never heard\n                  Shakespeare before.\n\n                                THE POSTMAN\n                         (grinning)\n                  They still haven't.\n\n     The Curmudgeon is still clapping.\n\n                                 THE POSTMAN\n                  Thanks.   You're very nice.\n\n                                CURMUDGEON LARRY\n                  I'm clapping because you stink.\n\n                                                      (CONTINUED)\n\n                                                               13.\n\n10   CONTINUED:    (2)                                               10\n\n                                THE POSTMAN\n                  I don't think you understand how\n                  it works.\n\n                                CURMUDGEON LARRY\n                  When I was young, I tried to be an\n                  actor. I was awful. But now I\n                  won't die thinking I was the worst\n                  one.\n\n                                THE POSTMAN\n                  I'm glad I could help.\n\n                                MRS. THOMPSON\n                  Larry, stop it.\n                         (to The Postman)\n                  You were very good.\n\n                                THE POSTMAN\n                  Good enough to get something to\n                  eat?\n\n     Before she can answer, a SENTRY cries...\n\n                                 SENTRY\n                  Holnists!   Holnists are coming!\n\n     All eyes look down the road leading into town. A raiding\n     party of Holnist Cavalry are on their way in. Mrs.\n     Thompson sees The Postman's concern.\n\n                               MRS. THOMPSON\n                  It's okay. We give them food and\n                  supplies. All the towns do.\n\n                                MAN #1\n                  They hardly kill anyone lately.\n                  Just take a woman sometimes.\n\n                                THE POSTMAN\n                  Well, I'd just as soon not give\n                  them anything of mine. Let's find\n                  the back door, Bill.\n\n     The Postman gathers his stuff, slings packs onto Bill.\n\n     The forty Holnists in orange and black uniforms ride in.\n     They're armed with mostly pistols and rifles. Some carry\n     bows, knives, spear guns and swords. On their bare\n     shoulders, branded into the flesh -- the number \"8.\"\n\n                                                       (CONTINUED)\n\n                                                              14.\n\n10   CONTINUED:    (3)                                              10\n\n     Out front, always leading by example is, GENERAL\n     BETHLEHEM. Tough, smart, merciless with style. Commander\n     of the United Clans of Holn. Nothing escapes his eye.\n\n     A little behind him is the mysteriously silent Colonel\n     Getty, second in command.\n\n     The Postman, finished packing, begins to move from\n     building to building -- careful not to attract any\n     attention.\n\n                                BETHLEHEM (O.S.)\n                  What are you doing there?\n\n     The Postman freezes, turns, is relieved to find\n     Bethlehem's not talking to him at all. The General looks\n     down from his horse at children playing an impromptu game\n     of \"Birnam Wood.\"\n\n     The children stop, stare at their feet. Bethlehem affects\n     a \"kindly\" smile to accompany his gentler tone.\n\n                                BETHLEHEM\n                  I said, what are you doing?\n\n     Meantime, The Postman continues his surreptitious escape.\n     The MAYOR hurries forward to greet Bethlehem.\n\n                                MAYOR\n                  It's just a game, General\n                  Bethlehem. Something they saw in\n                  a play. No harm in it.\n\n                                BETHLEHEM\n                  A play?\n                         (to kids)\n                  Show me. It's all right,\n                  children, show me.\n\n     One BRAVE BOY finds his voice, barely.\n\n                                BRAVE BOY\n                  Arm, arm yourselves! No running\n                  from the witches!\n\n                                BETHLEHEM\n                         (surprised)\n                  Shakespeare, is it? Well, I'm\n                  sorry I missed it.\n\n                                                     (CONTINUED)\n\n                                                               15.\n\n10   CONTINUED:    (4)                                               10\n\n                                MAYOR\n                  You should know, sir, we haven't\n                  nearly stocked the game we thought\n                  we would.\n\n                                 BETHLEHEM\n                  Really?   But you had time for a\n                  play?\n\n     Head down, The Postman makes for \"the back way.\" But it's\n     guarded by three daunting Holnist soldiers. No getting by\n     them. The Postman does a quick 180, goes back the way he\n     came.\n\n     Bethlehem looks at the frightened townsfolk.\n\n                                BETHLEHEM\n                  I'm taking three conscripts from\n                  each town. They will have the\n                  honor of serving in the Holnist\n                  Army until such time as I see fit.\n                         (to Mayor)\n                  Three men. You suppose you could\n                  do that?\n\n     The Mayor nods in acquiescence. Bethlehem looks to a\n     Holnist officer. The officer, IDAHO, steps up and\n     addresses the town.\n\n                                IDAHO\n                  All men between 15 and 50 and of\n                  suitable ethnic foundation are\n                  required to show themselves now.\n\n     The Holnist soldiers fan out, prodding any likely or\n     unwilling candidates forward.\n\n     The Postman is now walking behind Bethlehem. Some of the\n     Townspeople cast him a furtive glance as he makes his way\n     toward the open courtyard and, ultimately, the gate out of\n     town.\n\n     Three conscripts are hustled before Bethlehem. He looks\n     over the first -- Woody. Smells him. Not much of a\n     decision here.\n\n                                 BETHLEHEM\n                  Acceptable.\n\n                                 IDAHO\n                  Sir?\n\n                                BETHLEHEM\n                  Acceptable, Captain!\n\n                                                       (CONTINUED)\n\n                                                               16.\n\n10   CONTINUED:    (5)                                                10\n\n     The second -- a thin teenager. Bethlehem feels his arm,\n     turns his head from side to side.\n\n                                BETHLEHEM\n                  You'll need to put some meat on,\n                  but I like an impressionable mind.\n                  Acceptable.\n\n     The third -- an innocuous man. Or so we think. Bethlehem\n     stares hard at his olive skin, traces a finger over the\n     bump on the man's nose.\n\n                                 BETHLEHEM\n                  Mongoloid.   Unacceptable.\n\n     Soldiers shove the man back into the crowd. The Brave Boy\n     that was playing Birnam Wood allows himself a tiny smile\n     when he sees that The Postman might make it.\n\n                                BETHLEHEM\n                  I want pure blood. Someone\n                  like...\n\n     Bethlehem notes the Boy, turns to see the object of his\n     attention, and spots The Postman leaving out the front\n     gate.\n\n                                   BETHLEHEM\n                  That man.\n\n     Idaho and another soldier are on it. The Postman tries to\n     back away as the two dismount and come toward him.\n\n                                THE POSTMAN\n                  You don't understand...\n\n     But Idaho and the soldier aren't programmed for\n     explanations -- they grab him.\n\n                                IDAHO\n                  You were required to show\n                  yourself.\n\n                                THE POSTMAN\n                  But, I'm not with these people.\n                  I'm just passing through. I --\n\n     Idaho silences him with a rifle butt to the head.\n     Everything falls OUT OF FOCUS\n\n                                   IDAHO (O.S.)\n                  Take the mule.\n\n                                                       DISSOLVE TO:\n\n                                                            17.\n\n11   EXT. HOLNIST TRAINING CAMP (WESTERN IDAHO) - DAY             11\n\n     Spread out in the valley is General Bethlehem's Holnist\n     Expeditionary Force. A five hundred-man army enjoying all\n     the comforts a bivouac can offer.\n\n     19 head-shaved CONSCRIPTS, including Woody and The\n     Postman, are held in a cramped, barbed wired pen. They\n     watch as three more are shoved inside. One of them is\n     Bandit #20. He and The Postman come face to face,\n     recognize each other.\n\n                              BANDIT #20\n               Hi.\n\n                             THE POSTMAN\n                      (astonished)\n               Hi?\n\n     The Postman steps toward him, Bandit #20 backs off\n     quickly.\n\n                             BANDIT #20\n               Well... I mean, we know each\n               other, kind of...\n\n                              THE POSTMAN\n               Kind of.\n\n                             BANDIT #20\n                      (looking around)\n               Wow!\n\n                             THE POSTMAN\n               So what did you guys do with my\n               cigarettes?\n\n                             BANDIT #20\n               We traded them for a woman.\n\n                              THE POSTMAN\n               Wonderful.   What happened to your\n               partners?\n\n                             BANDIT #20\n               They traded me to the Holnists.\n\n                              GUARD (O.S.)\n               Ten hut!\n\n     General Bethlehem approaches on horseback. Colonel Getty\n     follows behind. Bethlehem looks his new recruits over.\n     Dismounting, he enters the pen and walks among them.\n\n                                                    (CONTINUED)\n\n                                                               18.\n\n11   CONTINUED:                                                      11\n\n                                BETHLEHEM\n                  Welcome, gentlemen, to your new\n                  life. You have been born again as\n                  soldiers in the army of the United\n                  Clans of Holn. The strong have\n                  been sapped by the whimpering\n                  propaganda of the weak. Men,\n                  strong men, have been denied their\n                  destiny. You men have been saved\n                  from that fate. Redemption is\n                  within your grasp.\n\n     He starts down the line, looking the men over. He stops\n     in front of a GANGLY RECRUIT. The Postman is alongside.\n\n                                BETHLEHEM\n                  You. What did you do before you\n                  were given this opportunity?\n\n                                GANGLY RECRUIT\n                  I had a shovel. I digged holes.\n\n     Bethlehem regards him benevolently.\n\n                                BETHLEHEM\n                  You digged holes... Well, now\n                  you're going to fill them.\n                         (turns to Postman)\n                  And you?\n\n                                 THE POSTMAN\n                  Me?\n\n                                BETHLEHEM\n                  Is there any question in anyone's\n                  mind that I was talking to you?\n                  Yes, you. You look like a\n                  dangerous man. Are you?\n\n                                THE POSTMAN\n                  I'm just a performer.\n                  Shakespeare. Stuff like that.\n\n                                 BETHLEHEM\n                  Shakespeare?\n\n                                THE POSTMAN\n                  He was a writer. He --\n\n                                BETHLEHEM\n                  I know who Shakespeare was... 'Cry\n                  \"Havoc!\" and let slip the dogs of\n                  war.'\n\n                                                       (CONTINUED)\n\n                                                               19.\n\n11   CONTINUED:    (2)                                               11\n\n     Bethlehem says the lines boldly, encourages his men to\n     clap for him. He looks at The Postman expectantly.\n     Finally...\n\n                                THE POSTMAN\n                  I, um, you want a line?\n\n     Bethlehem nods.     The Postman thinks a moment...\n\n                                THE POSTMAN\n                  'To be or not to be: That is the\n                  question.'\n\n     Bethlehem looks at his men as if to say, \"Is this all this\n     guy's got?\" Bethlehem eyes The Postman; he wants a\n     contest.\n\n                                BETHLEHEM\n                  'We few, we happy few, we band of\n                  brothers.'\n\n     The Holnists clap, they know their General can best this\n     guy.\n\n                                THE POSTMAN\n                         (gaining confidence)\n                  'Now is the winter of our\n                  discontent made glorious summer by\n                  this son of York.'\n\n     Bethlehem claps The Postman on the back.\n\n                                BETHLEHEM\n                  You're pretty good. You're also a\n                  fighter. I see it in your eyes.\n\n     The Postman doesn't answer. Hesitant, he doesn't want to\n     get into any more trouble than he's already in.\n\n                                BETHLEHEM\n                  Don't you agree? Come on, a man's\n                  got to speak his mind.\n\n     Bethlehem sounds sincere.    He seems like a good guy.\n\n                                THE POSTMAN\n                  I don't mean any disrespect, sir,\n                  but you'd be better off just\n                  letting me go. A fighter is about\n                  the last thing I am.\n\n                                                       (CONTINUED)\n\n                                                                20.\n\n11   CONTINUED:    (3)                                                11\n\n     The Postman doubles over as Bethlehem hooks a fist into\n     his gut. Bethlehem clubs him in the head, dropping him to\n     his knees, then digs a boot into his side. The Postman\n     goes down.\n\n                                BETHLEHEM\n                  Don't you think I should be the\n                  judge of that, soldier?\n\n     The Postman gasps to catch his breath.\n\n                                 BETHLEHEM\n                  Get up.   I said, get up.\n\n     The Postman staggers to his feet. Blood trickles from his\n     nose as he stares across at Bethlehem.\n\n                                BETHLEHEM\n                  Put up your fists.\n\n                                   THE POSTMAN\n                  You'd win.\n\n     Bethlehem looks to Getty. CLICK. Getty shoves a PISTOL\n     is into The Postman's ear. The Postman reluctantly raises\n     his fists. Bethlehem gives him a satisfied nod.\n\n                                   BETHLEHEM\n                  Now fight.\n\n     The Postman takes a tentative step forward. Bethlehem\n     drives him back with a flurry of blows. The Postman is\n     dazed, nearly out on his feet. Bethlehem holds him up.\n\n                                BETHLEHEM\n                  You're right. You're not a\n                  fighter. But you will be. I'm\n                  giving you a chance at a life that\n                  means something. A life worth\n                  living.\n\n     That said, Bethlehem delivers one last blow to The\n     Postman's face. Everything goes BLACK...\n\n\n12   EXT. HOLNIST TRAINING CAMP (WESTERN IDAHO) - DAWN                12\n\n     A brutal REVEILLE BLASTS the sleeping conscripts awake.\n\n                                   IDAHO (O.S.)\n                  Let's move it.     Everybody up and\n                  at 'em.\n\n                                                        (CONTINUED)\n\n                                                              21.\n\n12   CONTINUED:                                                     12\n\n     The Postman comes to. He licks his dry, blood-caked lips.\n     A sudden movement startles him -- it's Woody, shoving him\n     a battered cup of water. It's like he's been keeping\n     watch. The Postman is surprised, a little suspicious, and\n     very grateful as he gulps the water down.\n\n                                 THE POSTMAN\n                  Thanks.   Did I win?\n\n     Woody shakes his head \"no.\"\n\n                                THE POSTMAN\n                  I tried to tell him...\n\n                                  WOODY\n                  Say it again.\n\n                                  THE POSTMAN\n                  Say what?\n\n                                WOODY\n                  The words you said in town. About\n                  the wind blowing. And the rest...\n                  Say it again.\n\n                                 THE POSTMAN\n                  'Blow, wind. Come wrack. At\n                  least we'll die with the harness\n                  off our back.'\n\n                                WOODY\n                  What's it mean?\n\n                                THE POSTMAN\n                  Live free or die.\n\n     Woody and The Postman scramble to fall-to with the other\n     conscripts. Idaho surveys the ranks.\n\n                                IDAHO\n                  All right, girls. We're gonna\n                  run. Twenty miles. With packs.\n                  You got three hours. Everybody\n                  makes it. Or nobody eats.\n\n\n13   EXT. TRAINING CAMP - MESS LINE - CLOSE ON MEAT - DAY           13\n\n     A COOK dumps a scoop of gristly, gray meat into each mess\n     pail as the conscripts wait in line. They fall to\n     ravenously, too hungry to taste how bad it is. Idaho\n     supervises.\n\n                                                      (CONTINUED)\n\n                                                                22.\n\n13   CONTINUED:                                                       13\n\n                                  IDAHO\n                  Eat up!    You got meat tonight.\n\n     The line has almost passed. Just The Postman left and\n     Bandit #20 bringing up the rear. Idaho looks at The\n     Postman, addresses the COOK.\n\n                                IDAHO\n                  Why don't you tell Shakespeare\n                  what kind of meat that is.\n\n                                  COOK\n                  Mule.\n\n     Probably Bill -- and The Postman knows it. He stares in\n     revulsion at the putrid meat ladled into his pail.\n\n                                IDAHO\n                  A godawful animal. The sterile\n                  offspring of a horse and a donkey.\n                  Can you imagine that?! There's no\n                  room in this new world for a\n                  bastard like that.\n\n     Bandit #20 holds out his pail.       But the cook won't fill\n     it.\n\n                                  IDAHO\n                  Uh uh.\n                         (loudly; for all)\n                  Any man last in line ain't hungry\n                  enough. You show up last, you\n                  don't eat!\n\n     Bandit #20 steps away in disbelief. Not knowing what else\n     to do, he sits down beside The Postman, the only man with\n     food who isn't eating.\n\n                                BANDIT #20\n                  I'll die before I'm last in line\n                  again.\n\n                                THE POSTMAN\n                  That's what they're hoping for.\n\n     He holds his pail out to Bandit #20.\n\n                                 BANDIT #20\n                  Serious?   This isn't bad.\n\n     Lost in despair, The Postman stares out at the skewed\n     palette.\n\n                                THE POSTMAN\n                  These were supposed to be the best\n                  years of my life.\n\n                                                           23.\n\n14   EXT. TRAINING GROUNDS - DAY                                  14\n\n     The conscripts stand at attention under the guard of Idaho\n     and two other soldiers. To their right is a dead oak\n     tree. Behind them, three rows of folding chairs.\n\n     Two figures approach. Bethlehem and Getty. Getty carries\n     a sheathed sword. Bethlehem surveys the troops -- taking\n     no more notice of The Postman than anyone else.\n\n                             BETHLEHEM\n               The laws of eight, gentlemen.\n               That is the legacy handed down to\n               us by Nathan Holn.\n\n     At the mention of this name, the RECRUITS shout as one.\n\n                             RECRUITS\n               God rest his soul!\n\n                             THE POSTMAN\n                      (low)\n               May he burn in hell.\n\n     Getty looks over at him. He heard him. The Postman\n     swallows hard. Getty stares hard. Then he turns away.\n     He's not going to bust him on it.\n\n                             BETHLEHEM\n               These are the laws that we live\n               by. The eight is our symbol.\n               Each man will bear it with pride.\n\n     Bethlehem nods at Idaho who pushes up his own sleeve to\n     reveal the branded 8.\n\n                             BETHLEHEM\n               Only then will you be part of the\n               clan. Sit down, gentlemen.\n\n     The men move to sit in one of the three rows. Only then\n     does it become apparent that there are 18 men and only 17\n     chairs. One SLOW RECRUIT is left standing. It doesn't\n     take him long to realize that he's in trouble.\n\n                             BETHLEHEM\n               Law One. You will obey orders\n               without question.\n                      (to Slow Recruit)\n               I told you to sit.\n\n                             SLOW RECRUIT\n                      (scared)\n               There weren't enough chairs.\n\n                                                   (CONTINUED)\n\n                                                                 24.\n\n14   CONTINUED:                                                        14\n\n                                BETHLEHEM\n                  I didn't specify chairs. You\n                  could've sat down on the ground.\n\n     The Slow Recruit moves to do so.\n\n                                 BETHLEHEM\n                  You disobeyed a direct order.    You\n                  broke Law One.\n\n     Idaho and another soldier step up beside the Slow Recruit.\n\n                                 BETHLEHEM\n                  Law Two.   Punishment shall be\n                  swift.\n\n     They hustle the Recruit to the tree. Idaho unslings a\n     coil of rope, throws it over a tree limb. They quickly\n     slip a loop over the Slow Recruit's ankles and haul him\n     upside down into the air.\n\n                                BETHLEHEM\n                  Law Three: Mercy is for the weak.\n                  Four: Terror will defeat reason.\n                  Five: Your allegiance is to the\n                  clan. Six: Justice can be\n                  dictated. Law Seven. Any\n                  clansman may challenge for\n                  leadership of the clan. Does any\n                  man here wish to challenge me?\n\n     There are no takers.\n\n                                  BETHLEHEM\n                  On your feet!\n\n     The conscripts stand like jackknives snapping open.\n\n     Without a word, without a look -- Bethlehem reaches out\n     and draws a sword from a sheath that Getty holds.\n     Bethlehem steps to the Slow Recruit -- who slowly twists\n     around.\n\n                               BETHLEHEM\n                  Law Eight: There is only one\n                  penalty: Death.\n\n     Bethlehem raises the sword.\n\n                                SLOW RECRUIT\n                  Please, I'm begging you.\n\n                                                         (CONTINUED)\n\n                                                                 25.\n\n14   CONTINUED:    (2)                                                 14\n\n     THE POSTMAN\n\n     As the sword finds its mark.     Bethlehem looks at him, but\n     addresses all.\n\n                                BETHLEHEM\n                  You will get out of this army what\n                  you put into it. Work and you'll\n                  be fed. Fight and you'll be\n                  respected. Die and you'll be\n                  remembered. It's up to you.\n\n     Bethlehem turns and walks away.     Getty following behind.\n     The Postman watches as they go.     Idaho steps up to him.\n\n                                IDAHO\n                  You thinking of challenging for\n                  leadership of the clan?\n\n                                 THE POSTMAN\n                  No, sir.   I'm a follower not a\n                  leader.\n\n                                IDAHO\n                  You see Colonel Getty? Always\n                  following the General? He's the\n                  only man who ever challenged.\n                  Fight lasted six seconds, but the\n                  General didn't kill him. He cut\n                  off his tongue and he cut off his\n                  balls and old Getty's been\n                  following him like a dog ever\n                  since.\n\n     The Postman looks back to see Bethlehem and Getty\n     disappear into the gloom. Idaho grins, likes how this\n     affects a new man.\n\n     The Postman moves on.     Idaho stops Woody as he passes.\n\n                                IDAHO\n                  The General don't see it, but I\n                  say you got some nigger in you.\n\n     Woody clenches his jaw, but wisely doesn't answer.\n\n\n15   EXT. PLAINS - DAY                                                 15\n\n     Rain as the army moves. Boots suck at the mud. War\n     wagons heave out of ruts. A monster gun is mounted on an\n     old John Deere semi, pulled by a team of ten horses. The\n     conscripts fill the middle ranks, each bearing a heavy\n     pack.\n\n                                                       (CONTINUED)\n\n                                                               26.\n\n15   CONTINUED:                                                      15\n\n     Marching beside Woody, The Postman stares blankly ahead.\n     The cry to halt. The conscripts unsling their packs,\n     catch their breath. Idaho pulls The Postman out of line.\n\n                                IDAHO\n                  The General would like a word with\n                  you, Shakespeare.\n\n\n16   INT. GENERAL BETHLEHEM'S TENT - DAY                             16\n\n     Bethlehem stands before a painter's easel, palette in\n     hand. He's got a mirror set up so he can see his\n     reflection. He's doing a self-portrait in the tradition\n     of the great Dutch Masters -- but it's a dismal failure.\n\n     He continues painting even as Idaho leads The Postman in.\n     Idaho salutes, steps back. For a moment, The Postman\n     doesn't quite know what to do.\n\n                                 BETHLEHEM\n                         (re: the book and\n                          binoculars on the\n                          table)\n                  They're yours. A solitary man,\n                  aren't you? Binoculars. To watch\n                  life from a distance. And\n                  Shakespeare. To read about it\n                  instead of living it.\n\n     Bethlehem wants an answer.    The Postman clears his throat.\n\n                                THE POSTMAN\n                  No offense, General, but you seem\n                  to have read some Shakespeare\n                  yourself.\n\n                                BETHLEHEM\n                  If he wishes to rise above mere\n                  thuggery, a military commandeer\n                  must be classically educated.\n                  Philosophy, history. Even a sense\n                  of the dramatic.\n                         (a beat)\n                  Do you know what I did before the\n                  war? Do you think I was in the\n                  army? I sold copying machines. I\n                  was a salesman. The talent to\n                  lead men and devise and execute a\n                  battle plan were locked away\n                  inside me.\n\n                                                       (CONTINUED)\n\n                                                              27.\n\n16   CONTINUED:                                                     16\n\n     He picks up Finding A Way to Win by Nathan Holn.     A 20-\n     year-old self-help book.\n\n                                BETHLEHEM\n                  If Nathan Holn hadn't come along,\n                  I'd still be selling copying\n                  machines. Can you imagine the\n                  wasted life? Can you imagine the\n                  magnitude of it? But war... War\n                  gives men like me a chance.\n\n     He turns to a dog-eared page in the book.\n\n                                 BETHLEHEM\n                  Here... 'The prize is often left\n                  unclaimed. Have the courage to\n                  grasp it. For fortune always\n                  favors the bold.'\n                         (moved)\n                  It always inspires me.\n                         (beat)\n                  I have a design for the future. A\n                  master plan. I'll need able\n                  officers to carry it out. You\n                  have the intelligence. If your\n                  heart matches, you'll go far.\n                         (a beat)\n                  We'll talk more in the weeks to\n                  come. Dismissed.\n\n     The Postman leaves.     Idaho stands at the ready.\n\n                                BETHLEHEM\n                  Issue the binoculars to a scout.\n\n                                IDAHO\n                  And the book, sir?\n\n                                 BETHLEHEM\n                  Burn it.\n\n     Idaho leaves. Bethlehem goes back to his painting. He\n     considers himself in the mirror. After a long stare-down,\n     he shouts:\n\n                                 BETHLEHEM\n                  Quit moving.\n\n\n17   EXT. CAMP - DAY                                                17\n\n     The Postman rejoins the conscripts. Bandit #20 slides\n     over.\n\n                                                      (CONTINUED)\n\n                                                            28.\n\n17   CONTINUED:                                                   17\n\n                                   BANDIT #20\n                  What happened?\n\n     Troubled, The Postman doesn't answer. He heads for a\n     corner where Woody stands alone. Relentless, Bandit #20\n     follows.\n\n                                BANDIT #20\n                  What did he say?\n\n                                   THE POSTMAN\n                  Nothing.\n\n                                BANDIT #20\n                  Did he say anything about me?\n\n                                   THE POSTMAN\n                  No.\n\n     They reach the quiet corner; it's just the three of them.\n\n                                THE POSTMAN\n                  We got to get out of here.\n\n                                BANDIT #20\n                  What are you talking about?\n\n                                THE POSTMAN\n                  Escaping.\n                         (low)\n                  You ever hear of St. Rose? It's\n                  on the coast. They say it's a\n                  paradise. They've even got\n                  electric lights.\n\n     Bandit #20 looks scared, Woody unreadable.\n\n                                   BANDIT #20\n                  We can't.\n\n                                THE POSTMAN\n                  Between the three of us, we\n                  could --\n\n                                BANDIT #20\n                  No, no. I can't. I like it here.\n                  I like being a part of something.\n\n     The Postman can't believe what Bandit #20 just said.\n     Bandit #20 turns, hurries away.\n\n     The Postman looks to Woody who doesn't tip his hand either\n     way. He moves away as well.\n\n                                                                29.\n\n18   EXT. CAMP - DAY                                                  18\n\n     The conscripts break camp. Hot work. Glistening with\n     sweat, The Postman stops to stretch. Across the way, he\n     sees Bandit #20 talking to Getty. Getty glances at The\n     Postman who returns to work, watches under his eyebrows as\n     Idaho joins the group. There's trouble brewing here.\n\n     Worried, The Postman looks to Woody, who watches the\n     exchange as well. He is, as usual, inscrutable.\n\n\n19   EXT. CLEARING - RIVER - DAY                                      19\n\n     The river is swollen and swift from the spring thaw.\n     Marching along the east ridge above it, the army is given\n     the order to halt.\n\n     The Postman looks ahead to where Idaho confers with\n     Bethlehem. Something's wrong. They look to where:\n\n     Two carbine-toting soldiers stand alertly at guard by a\n     thicket across the river. A rotten wood and rope bridge\n     spans the space between the ridges.\n\n     Idaho rides to the conscripts:\n\n                             IDAHO\n               One of you dogs has earned himself\n               a treat. Over there.\n\n     Idaho points to the thicket as he proceeds down the line.\n\n                             IDAHO\n               Those men hunted themselves a lion\n               this morning. Must've been a zoo\n               around here before the war.\n               Anyhow, they shot him and he\n               crawled into that thicket. A\n               third man went in after him. We\n               don't know if he's dead or alive.\n               I need a volunteer. Someone's\n               gotta go in and get our boy out.\n\n     No volunteers, except the zealot Bandit #20.\n\n                               BANDIT #20\n               I'll go.\n\n     Idaho ignores him, stops in front of Woody.\n\n                             IDAHO\n               I guess size ain't a measure of\n               courage, is it? Shakespeare!\n\n     The fix is in.    The Postman steps out of line.\n\n                                                        (CONTINUED)\n\n                                                              30.\n\n19   CONTINUED:                                                     19\n\n     Idaho's about to hand The Postman a carbine when --\n\n                                BETHLEHEM (O.S.)\n                  I don't think so, Captain.\n\n     Bethlehem nods to Getty. Getty takes a hunting knife from\n     a belt-sheath and tosses it, blade first, into the ground\n     between The Postman's feet.\n\n                                BETHLEHEM\n                  Come out alive and you got\n                  yourself a lion steak.\n\n     Hefting the knife, The Postman stares at the west ridge.\n\n                                 IDAHO\n                         (winks)\n                  Maybe you'll find your St. Rose up\n                  there.\n\n     The Postman looks to Bandit #20 who stares back defiantly.\n\n                                IDAHO\n                  What are you waiting for,\n                  Christmas?\n\n     Bandit #20 can't contain his giggling, so Idaho backhands\n     the sound out of him -- then looks back to The Postman.\n\n     Grim The Postman starts forward, looks from the rotten\n     bridge to the water and back again as he moves.\n\n     All eyes on him as he starts across...\n\n\n20   EXT. BRIDGE - DAY                                              20\n\n     The Postman steps lightly. Far below, the river rages. A\n     knotty plank starts to crack underfoot. Scooting off it,\n     he takes a last look around. Continues across to...\n\n\n21   EXT. WEST RIDGE - DAY                                          21\n\n     The soldiers greet him -- unholy smiles on their ugly\n     mugs. They point him ahead, prod him forward toward a\n     trail of wet blood which leads deeper into the thicket.\n\n     Stooping, The Postman enters. The soldiers split off and\n     track along with him on either side of the thicket.\n\n                                                               31.\n\n22   EXT. THICKET - DAY                                              22\n\n     Thorns catch and tear at his clothes as The Postman pushes\n     his way through. He freezes. Ahead, sprawled and\n     twisted, the mauled, bloody corpse of a Holnist soldier.\n\n                               SOLDIER (O.S.)\n                 Why are you stopping?\n\n                                  THE POSTMAN\n                 I found him.\n\n                                  SOLDIER (O.S.)\n                 He alive?\n\n     Clearly he is not.\n\n                                  THE POSTMAN\n                 Yeah.\n\n                                  SOLDIER (O.S.)\n                 Bring him out.\n\n     The Postman heaves the corpse onto his back. Rising,\n     steadying himself, he looks back over his shoulders at a\n     GUTTURAL GROWL. He hurries forward.\n\n\n     ARMY\n\n     Everyone stares across the river, straining to see as The\n     Postman emerges with the corpse on his back.\n\n\n     ON BRIDGE\n\n     The Postman starts across, hampered by his burden.   He\n     pauses, at his feet, the cracked, knotty plank.\n\n                               IDAHO\n                        (across river)\n                 Hurry up! You still got a lion to\n                 bag!\n\n     The Postman decides, deliberately steps on the PLANK.\n     CRACK. The Postman and the corpse drop thirty feet down,\n     disappear in the river below.\n\n     The corpse surfaces first, floats in the water.\n\n     Then The Postman. Farther down the river. Swimming\n     downstream with powerful strokes. Between his efforts and\n     the current, he's being quickly swept away from the\n     Holnists.\n\n     As Bethlehem's eyes narrow in fury.\n\n                                                     (CONTINUED)\n\n                                                              32.\n\n22   CONTINUED:                                                     22\n\n     A RIFLE BARKS a SHELL BACK after The Postman, but he\n     disappears around a bend in the river.\n\n     Bethlehem signals to two soldiers. They start running\n     along the east ridge toward the riverbend.\n\n     Two more start across the bridge to the west -- moving\n     with military precision.\n\n     Bethlehem wheels toward the conscripts, points out Woody.\n\n                                BETHLEHEM\n                  In the water. Come back without\n                  him and you and another man will\n                  die in his place.\n\n     Woody dives in the water. Bethlehem looks to Idaho who\n     dives in as well. Conscripts buzz with nervous\n     excitement.\n\n                                CONSCRIPTS\n                  Go!   Go!\n\n                                BANDIT #20\n                         (caught up)\n                  I'll get him, sir.\n\n     He takes off running across the bridge.\n\n\n23   EXT. RIVER - DAY                                               23\n\n     A fallen tree spans the river. As The Postman is swept\n     beneath, he reaches up and catches hold. Pulling himself\n     out of the water, he scrambles for the west shore. He\n     disappears into the woods as two soldiers appear.\n\n     They catch hold of the tree, look to the west banking, see\n     footprints in the mud where The Postman pulled himself\n     out. They start after him.\n\n\n24   EXT. CLEARING - WOODS - DAY                                    24\n\n     Clothes in tatters, his lungs ready to burst, The Postman\n     stops. He takes cover as the two soldiers run past.\n\n     Breathing hard, The Postman steps out, starts across the\n     clearing. He's halfway when Bandit #20 steps out from the\n     trees. They look at each other for a moment.\n\n                                THE POSTMAN\n                  Just let me go. I don't want to\n                  be part of your army.\n\n                                                     (CONTINUED)\n\n                                                             33.\n\n24   CONTINUED:                                                    24\n\n     Bandit #20 hesitates for a moment, then breaks into a\n     grin.\n\n                                 BANDIT #20\n                  My army.   I like the sound of\n                  that.\n\n     The Postman gestures with his knife.\n\n                                  THE POSTMAN\n                  Don't --\n\n                                 BANDIT #20\n                  I got him!   Over --\n\n     The Postman lunges, digs into Bandit #20's gut.   He blinks\n     in surprise, then sags to the ground.\n\n     The Postman takes a step back. A shadow falls over him.\n     It's Woody. Staring down at The Postman. They can hear\n     others approaching from the river.\n\n                                WOODY\n                  They sent me to kill you.\n\n                                  THE POSTMAN\n                  Come with me.\n\n     At that moment, Idaho and the second soldier come into the\n     clearing. Idaho grins, relaxes his grip on his gun when\n     he sees the mismatch between Woody and The Postman.\n\n                                 IDAHO\n                  Good, boy.   Get him.\n\n                                WOODY\n                  It's you or me.\n\n                                  THE POSTMAN\n                  I know.\n\n                                  IDAHO\n                  Finish it.\n\n     Woody circles The Postman, until he's facing Idaho and the\n     soldier. Woody takes a long look at The Postman, smiles.\n\n                                WOODY\n                  No harness on my back.\n\n     As The Postman realizes what he's doing, Woody flips his\n     knife through the air and into the soldier's throat.\n\n                                                   (CONTINUED)\n\n                                                             34.\n\n24   CONTINUED:    (2)                                             24\n\n     As Woody rushes him, Idaho raises his GUN.\n\n     Idaho pumps TWO ROUNDS into Woody, but the big man keeps\n     coming. The THIRD ROUND finds his heart, puts Woody down.\n     Dead. But not before he lands on top of Idaho.\n\n     As Idaho struggles to get out from under Woody's massive\n     frame, The Postman heads for the trees.\n\n\n     Covered in Woody's blood, Idaho FIRES a ROUND as The\n     Postman disappears into the woods. Idaho starts after\n     him.\n\n\n     IDAHO\n\n     Tracking. He sees a dribble of fresh blood.   He touches\n     it with his fingers and smiles.\n\n     He cocks his head at MOVEMENT to his left. Smiling,\n     hefting his pistol, Idaho moves in. More SHUFFLING.   Just\n     ahead. He's got him now.\n\n                                IDAHO\n                  You want your St. Rose?\n\n     There's a RUSTLE of BRUSH just before a ROAR splits the\n     air. Idaho doesn't even have time to scream as the LION\n     pounces down on top of him.\n\n\n25   EXT. CLIFF - DAY                                              25\n\n     The Postman, lungs heaving, stops his climb long enough to\n     take stock of the Army waiting on the distant river edge.\n\n     Strength ebbing, he heaves himself up and continues\n     climbing.\n\n                                                   DISSOLVE TO:\n\n\n26   EXT. WOODS (EASTERN OREGON) - NIGHT                           26\n\n     A chilling RAIN drills down, washing across an old forest\n     road. Covered with undergrowth and dotted with saplings,\n     nothing's been down here in years.\n\n     Blue-lipped and shivering, his clothes torn and soaked,\n     The Postman trudges along. He tries to rub some warmth\n     back into his numbed limbs, but a coughing spell wracks\n     his body.\n\n                                                   (CONTINUED)\n\n                                                               35.\n\n26   CONTINUED:                                                      26\n\n     He trudges forward, shoes heavy with freezing mud. He's\n     made his escape, but he won't last the night if he doesn't\n     find some shelter.\n\n     An unnatural shape ahead, just off the road.    Square.   He\n     cautiously pulls back a few branches.\n\n     An old, rusted Jeep with faded    U.S. government markings.\n     Its hood buried under the dirt    of an old mud slide. The\n     Postman stoops to look through    the passenger side window,\n     comes face-to-face with death.     A skeleton sits inside,\n     the skull grinning against the    glass facing The Postman.\n\n\n     But The Postman doesn't jump back. He just stares. The\n     two heads meet halfway as The Postman's face is reflected\n     on the glass, superimposed over the skull.\n\n     A hypothermic shiver wracks his body. The Postman tries\n     the door, but it won't budge. The other side of the Jeep\n     is buried. But seeing that the windshield is partly\n     smashed, he clears away the debris, peels back the spider-\n     webbed safety glass and climbs inside.\n\n\n     JEEP\n\n     Pulling the glass back down, he looks almost shyly at the\n     skeleton, like two kids about to \"park\" for the first\n     time.\n\n                                 THE POSTMAN\n                  Hey.   How ya doin'?\n\n     The back of the Jeep is filled with bags marked U.S. Mail.\n     The Postman picks up a hat off the console. Oddly\n     respectful, he runs a finger along the band over the\n     \"Horse & Rider\" emblem.\n\n     The Postman reaches, touches the embroidered American flag\n     patch on the skeleton's jacket shoulder. Another shiver.\n     A moment later, The Postman is pulling the nice dry jacket\n     off the skeleton and shoving his own arms inside.\n\n     A sloshing sound. He pats down the jacket. Finds a\n     liquor. He gives the skeleton a \"you shouldn't have\"\n     look. But the cap won't budge. He twists, pries, bangs\n     the neck of the steering wheel. At last it gives. He\n     takes a long, hard swallow. The warming fire streams down\n     his throat.\n\n     The Postman grabs a random letter, reads it aloud.\n\n                                                      (CONTINUED)\n\n                                                            36.\n\n26   CONTINUED:    (2)                                            26\n\n                                THE POSTMAN\n                  'Jerry Ball, Pine View.'\n\n     He starts to open it, looks at the skeleton and shrugs.\n\n                                 THE POSTMAN\n                  So, arrest me.\n                         (reading)\n                  Here's a piece of good news.\n                  Jerry's decided to go to school to\n                  get his contractor's license.\n\n     Tossing it aside, he takes a drink, opens another.   The\n     words are in crayon -- a child's scrawl.\n\n                                THE POSTMAN\n                         (smiles to skeleton)\n                  Little Jimmy wants his grandpa to\n                  know he lost a tooth.\n\n     The Postman turns the envelope over in his palm. A tiny\n     tooth falls out. The Postman considers it. This suddenly\n     isn't so amusing. He puts it back in the envelope.\n\n     Shoving mail sacks aside, he climbs in the back.\n     Burrowing in, he pulls the sacks back, covering himself\n     with a blanket of mail. Getting warmer already, he\n     regards the skeleton a beat as the RAIN DRUMS ON the ROOF.\n\n\n27   EXT. JEEP - DAY                                              27\n\n     Wearing the blue uniform, The Postman looks down at the\n     fresh grave, realizes a eulogy is in order. He takes off\n     the hat, holds it over his chest for a heartfelt moment of\n     silence.\n\n                                THE POSTMAN\n                  Thanks for being there for me.\n                         (raising the flask)\n                  Here's to you. I consider my\n                  taxes very well spent.\n\n     He swallows the last few drops, then sets the flask down\n     as a headstone. What now?\n\n                                THE POSTMAN\n                  All dressed up. Nowhere to go.\n\n                                                               37.\n\n28   EXT. RURAL HIGHWAY (SOMEWHERE IN OREGON) - DAY                  28\n\n     His hair growing back nicely, The Postman has reached the\n     proverbial fork in the road. He considers his two\n     options: \"Pine View -- 32 miles.\" Or \"Ridgemont -- 220\n     miles.\" He looks the two roads over, thinks.\n\n                                THE POSTMAN\n                  Well, that's easy.\n\n\n29   EXT. GATES (PINE VIEW, OREGON) - DUSK                           29\n\n     The town is protected by a tall, long palisade.     Like Ft.\n     Apache. All is dark as The Postman approaches.\n\n                                THE POSTMAN\n                  Greetings, Pine View, Oregon!\n\n     TWO SENTRIES appears from the gate house.    They aim\n     arrows.\n\n                                SENTRY #1\n                  Just head back the way you came.\n                  Pine View ain't buying, ain't\n                  listening and don't give charity.\n\n     A moment of truth is here.    Finally, with authority:\n\n                                THE POSTMAN\n                  Civilian, I'm on official\n                  business. I demand entry into the\n                  town of Pine View.\n\n                                SENTRY #2\n                  What the hell are you talking\n                  about?\n\n                                THE POSTMAN\n                  I'm through talking to you, buddy\n                  boy! Now get somebody with\n                  authority to open this gate!\n\n     More silhouettes appear on the palisade.     One is SHERIFF\n     BRISCOE, a big, no-nonsense man.\n\n                                BRISCOE\n                  I'm Sheriff Briscoe. Who the hell\n                  are you?\n\n                                THE POSTMAN\n                  I'm a representative of the United\n                  States Government --\n\n     An uproar.    He makes himself heard above it.\n\n                                                       (CONTINUED)\n\n                                                               38.\n\n29   CONTINUED:                                                      29\n\n                                THE POSTMAN\n                  Authorized by order 417 of the\n                  restored Congress to reestablish a\n                  communication route to Idaho and\n                  lower Oregon. Now open that damn\n                  gate!\n\n                                BRISCOE\n                  What does that mean in English?\n\n                                THE POSTMAN\n                  I'm your postman!\n\n     There's a silent hush.\n\n                                BRISCOE\n                         (to someone on wall)\n                  Hand me your gun.\n\n                                THE POSTMAN\n                  Understand that tampering with or\n                  obstructing the mail is a federal\n                  offense. Furthermore, the Bolin\n                  Act requires you to provide all\n                  mail carriers with sanctuary and\n                  nourishment.\n                         (starting forward)\n                  Now open that damn gate!\n\n                                BRISCOE\n                  You got three seconds to get your\n                  ass outta here.\n\n                                THE POSTMAN\n                  Is Jerry the contractor here?\n\n     Briscoe pumps his shotgun, aims it at The Postman.\n\n                                 THE POSTMAN\n                  Wait! I'm going to get something\n                  out of my bag.\n\n     The Postman dumps the pack over, frantically shuffles\n     through the letters.\n\n                                 BRISCOE\n                  One!\n\n                                 THE POSTMAN\n                  Paul Davis!   124 Vernon Street!\n\n                                BRISCOE\n                  Never heard of him. Two!\n\n                                                       (CONTINUED)\n\n                                                                39.\n\n29   CONTINUED:    (2)                                                29\n\n                                 THE POSTMAN\n                  Lois Kent!   14 Weymoth Lane!\n\n                                 BRISCOE\n                  Three!\n\n     He fumbles for the last letter.       Briscoe takes aim.\n\n                                 THE POSTMAN\n                  Irene March!   478 River Road!\n\n     There's an absolute stunned silence.      Like a switch was\n     thrown.\n\n\n30   EXT. INSIDE GATES - DAY                                          30\n\n     The crowd parts as everyone turns to look back at IRENE\n     MARCH. Mrs. March, in her late 50s, is blind, her eyes\n     clouded by cataracts. In disbelief...\n\n                                MRS. MARCH\n                  Did he say my name?\n\n     The sense of hope is palpable as the gates are swung back.\n     Two TOWNIES hurry Mrs. March out to meet The Postman.\n     They're followed by a throng. As he sees she's blind...\n\n                                 THE POSTMAN\n                  Oh, no...\n\n     Too late now. They stop Mrs. March in front of him.        She\n     stares off just to his left, a little afraid.\n\n                                MRS. MARCH\n                  I'm Irene March.\n\n                                THE POSTMAN\n                         (uncomfortable)\n                  I have a letter for you.\n\n     He presses it into her hands, but she won't take it.\n\n                                MRS. MARCH\n                  Would you read it?\n\n                                THE POSTMAN\n                  I'm sure it's personal.\n\n                                 MRS. MARCH\n                  Please.   Someone has to.\n\n                                                        (CONTINUED)\n\n                                                                 40.\n\n30   CONTINUED:                                                         30\n\n     The Postman has little choice.     As he opens the\n     envelope...\n\n                                THE POSTMAN\n                  We're delivering the old stock\n                  piles, but I'll accept all new\n                  correspondence as well.\n\n                                TOWNIE\n                  Just read it, will ya?\n\n     Excited, the people move closer.      Someone holds up a torch\n     and The Postman starts.\n\n                                THE POSTMAN\n                  'Dear Irene. Sorry I haven't\n                  written. Everything's so crazy.\n                  The strange weather. The food\n                  shortages. That farmer Nathan\n                  Holn causing all that trouble.\n                  It's hard to understand. David's\n                  home from the Army. The war was\n                  over before he even got there.\n                  Thank God for that. He's still my\n                  baby no matter how big he gets.\n                  We're going to miss you for\n                  Christmas, but maybe next year.\n                  All our love. Donna.'\n\n     Mrs. March reaches out a trembling hand to take the\n     letter.\n\n                                MRS. MARCH\n                  My sister in Denver. Fifteen\n                  years ago. Thank you.\n\n     The populace erupts with excitement.        Mrs. March takes The\n     Postman's hand, clasps it tightly.\n\n                                MRS. MARCH\n                  You're a Godsend. A savior.\n\n     The Postman pulls his hand back, rejects the title.\n\n                                 THE POSTMAN\n                  No.   I'm just... a postman.\n\n     An almost awesome silence.     Too much for The Postman.\n\n                                THE POSTMAN\n                  I've been on the road a while. I\n                  could use a little something to\n                  eat --\n\n                                                         (CONTINUED)\n\n                                                             41.\n\n30   CONTINUED:    (2)                                             30\n\n                                 MRS. MARCH\n                  Oh, yes, absolutely... Is there\n                  anything else?\n\n     The townspeople welcome him with cheers. The Postman\n     raises a silencing hand. As they quiet...\n\n                                THE POSTMAN\n                  Yes, there is! If there are dogs\n                  in this town, you have to leash\n                  them while I'm here!\n\n     Only The Postman laughs. No one else reacts. Briscoe\n     watches dubiously from the wall as the people surround The\n     Postman and sweep him through the gates and into town.\n\n     One couple watches The Postman closely as he makes his way\n     into town. She is ABBY -- a sweet-faced, pretty woman.\n     Her husband, MICHAEL, is a decent-looking sort, tall and\n     strong.\n\n\n31   INT. ABANDONED HOTEL - ROOM 7 - NIGHT                         31\n\n     A freestanding tub has been set up, water \"bucketed\" in.\n     The Postman luxuriates in his first hot bath in years and\n     sings a familiar tune to himself.\n\n                               THE POSTMAN\n                  'Stop. Oh, yes, wait a minute,\n                  Mr. Postman. Waaa-ait, Mr.\n                  Postman...'\n\n\n32   EXT. PARKING LOT (PINE VIEW) - NIGHT                          32\n\n     FORD crosses the parking lot of an abandoned motel. He's\n     a black kid, maybe 16, too young to remember any other\n     life but this. He carries The Postman's uniform on a\n     hanger.\n\n\n33   INT. ABANDONED HOTEL - ROOM 7 - NIGHT                         33\n\n     The Postman looks up at a KNOCK. Ford steps in. Like\n     most kids, he needs a hero. Holding up the uniform, he\n     just found one.\n\n                                FORD\n                         (beaming)\n                  Cleaned and pressed, sir.\n\n                                                     (CONTINUED)\n\n                                                               42.\n\n33   CONTINUED:                                                      33\n\n                                THE POSTMAN\n                  Thanks. Didn't somebody say\n                  something about dinner?\n\n                                FORD\n                  Yeah, I'm supposed to take you to\n                  Foster's.\n                         (extending a hand)\n                  My name's Ford. Ford Lincoln\n                  Mercury.\n\n     The Postman just nods, hoisting himself out of the tub and\n     hurriedly wrapping a towel around himself.\n\n                                FORD\n                  Used to be John Stevens, but I\n                  changed it on account of I want to\n                  drive cars.\n\n     Hoping to impress, Ford reaches into a pocket, pulls out a\n     worn, creased flyer for a \"Ford Lincoln Mercury\"\n     dealership. Ford finds The Postman just staring at him,\n     waiting for the uniform he's still got in his hand.\n     Embarrassed, Ford quickly hands it over.\n\n\n34   EXT. STREET (PINE VIEW) - NIGHT                                 34\n\n     Ford leads the way as they leave the motel behind. The\n     Postman looks good in his uniform. They cross a parking\n     lot where five partly-stripped cars have been sitting for\n     years. There's a potted plant outside the driver's door\n     of one.\n\n                                FORD\n                  I live in that car. A 2003\n                  Pontiac Sinatra. With a nine-\n                  banger and a Q-eight.\n\n                                THE POSTMAN\n                  V-eight. Eight cylinders.   That\n                  means an eight-banger.\n\n                                FORD\n                         (in awe of him)\n                  Were they fast?\n\n                                FORD\n                  A buck seventy-five on a strip.\n\n                                                       (CONTINUED)\n\n                                                                  43.\n\n34   CONTINUED:                                                         34\n\n                                FORD\n                  A buck seventy-five? I thought\n                  maybe I could fix some of them up.\n                  It's nothing compared to what you\n                  do.\n\n     This is the last thing he expected to hear out of this\n     kid's mouth. A moment, then...\n\n                                THE POSTMAN\n                  The important thing to remember\n                  about cars is, you can't eat 'em.\n\n     Ahead, people are gathered inside an old Foster's Freeze.\n\n\n35   INT. FOSTER'S FREEZE (PINE VIEW) - NIGHT                           35\n\n     The townspeople fill the booths, line the walls. They\n     talk excitedly amongst themselves, break into spontaneous\n     applause as Ford and The Postman enter.\n\n     The Postman is surprised, uncomfortable at this display.\n     But then he sees that a banquet has been laid out on the\n     counter. The centerpiece is a huge vat of steaming stew.\n\n     The PEOPLE clear a path for him.\n\n                                MAN #1\n                  Tell us about the government!\n\n                                WOMAN #1\n                  Yes, tell us everything!\n\n     Startled, The Postman doesn't quite know what to say.\n     They seat him at a table -- but the food looks miles away.\n\n                                MAN #2\n                  Is there a President?\n\n                                THE POSTMAN\n                  Yeah.\n\n                                WOMAN #2\n                  What's his name?\n\n                                THE POSTMAN\n                  You know, I'm pretty hungry.\n\n     But these people won't be denied.       Finally...\n\n                                                          (CONTINUED)\n\n                                                                44.\n\n35   CONTINUED:                                                       35\n\n                                THE POSTMAN\n                  His name is, uh... Richard\n                  Starkey. From Maine. He has a\n                  saying. 'Things are getting\n                  better, getting better all the\n                  time.'\n\n     There's warm applause at that.    Several people try the\n     expression out on each other.\n\n                                MAN #3\n                  He a Democrat or a Republican?\n\n                                THE POSTMAN\n                  Parties are over with. The\n                  individual is what counts. You\n                  vote for the best man.\n\n     Ellen sets a steaming bowl of stew in front of The\n     Postman. Famished, he digs in.\n\n                                MAN #4\n                  What about Europe? Any word?\n\n     The Postman tries to speak through a mouthful of food.\n\n                                THE POSTMAN\n                  Lady Di's in charge. Sixty years\n                  old and she still kicks ass.\n\n                                WOMAN #3\n                  Is Nathan Holn still alive?\n\n                                THE POSTMAN\n                         (smiles at irony)\n                  He died. Skin cancer.\n\n     That's sure good news to everyone.       But...\n\n                                WOMAN #4\n                  And the Holnists? They're still\n                  out there. What's the government\n                  going to do about them?\n\n     The Postman looks at the desperate faces -- he'd rather\n     get back to his meal -- but this may be the most important\n     question of all. He doesn't want to lie.\n\n                                THE POSTMAN\n                  The government's just getting\n                  started. You're on your own for\n                  at least eighteen months.\n\n                                                       (CONTINUED)\n\n                                                              45.\n\n35   CONTINUED:    (2)                                              35\n\n                                MAN #5\n                  What about the Marines Corp?\n\n     A clamor of Holnist questions.\n\n                                ELLEN\n                  Be quiet, everyone! Can't we just\n                  let this man eat?\n\n     The people nod and The Postman finally gets to eat. He\n     catches sight of Briscoe watching him from the door.\n     After a moment, Briscoe leaves.\n\n\n36   INT. FOSTER'S FREEZE - LATER                                   36\n\n     A band plays an odd array of instruments. There's\n     dancing. The Postman sits behind four empty bowls.\n     People watch him eat like it was a religious experience.\n     He pushes back the fifth bowl.\n\n                                THE POSTMAN\n                  Never thought I'd hear myself say\n                  this, but I can't eat anymore.\n\n     He's cut off by the sight of a silent, little boy.    The\n     kid's looking up, staring intently at something.\n\n                                  THE POSTMAN\n                  What?\n\n     The boy just stares.\n\n                                  THE POSTMAN\n                          (re:   the cap)\n                  This?\n\n     The boy nods. The Postman shakes his head and smiles to\n     himself. He takes off the cap, sets it on the kid's head.\n\n                                  THE POSTMAN\n                  Almost fits.\n\n     The boy's eyes go wide with wonder. His stock's gone up\n     1000%. Before he can rush off to impress his friends,\n     ELLEN -- his mother -- steps over and gently chides him.\n\n                                ELLEN\n                  That's not a toy, honey. That's\n                  very important. Give it back.\n\n                                                      (CONTINUED)\n\n                                                                   46.\n\n36   CONTINUED:                                                          36\n\n     The boy carefully removes the cap, hands it back to The\n     Postman. Ellen smiles gratefully and gently guides her\n     son away.\n\n     The Postman shrugs, turns to find Abby, the pretty woman\n     we saw at the Pine View gates. She smiles at The Postman.\n\n                                ABBY\n                  Would you like to dance?\n\n                                 THE POSTMAN\n                  I don't know if I can, I think I'm\n                  still on duty.\n\n     He laughs.    Abby says nothing.\n\n                                THE POSTMAN\n                  It's been a long time.\n\n     Abby holds out her hand like a promise.\n\n                                ABBY\n                  All you got to do is hold on.\n\n\n     DANCE FLOOR\n\n     Abby and The Postman dance.          She keeps looking him over.\n\n                                THE POSTMAN\n                  Is something wrong?\n\n                                ABBY\n                  How tall are you?\n\n                                THE POSTMAN\n                  About six feet.\n\n                                   ABBY\n                  Are you smart?\n\n                                THE POSTMAN\n                  Smarter than some I guess.       Why?\n\n                                 ABBY\n                  Just wondering. Did you ever have\n                  the bad mumps?\n\n     The Postman smiles.    She's odd, but beautiful.\n\n                                THE POSTMAN\n                  Never had the bad mumps.\n\n                                                           (CONTINUED)\n\n                                                                47.\n\n36   CONTINUED:    (2)                                                36\n\n                                ABBY\n                  Have you ever had herpes or\n                  syphilis or anything like that?\n\n     He shakes his head \"no.\"    They continue to dance.\n\n                                ABBY\n                  So as far as you know, you have\n                  good semen?\n\n                                THE POSTMAN\n                  Is that a trick question?\n\n                                ABBY\n                  I don't mean to be nosy. I'm only\n                  asking because I want you to make\n                  me pregnant.\n\n     Stunned, The Postman stops dancing.      Abby takes this\n     moment to grab Michael.\n\n                                THE POSTMAN\n                         (to himself)\n                  It's got to be the uniform.\n\n     Abby takes Michael's arm, introduces him proudly.\n\n                                ABBY\n                  This is my husband.    Michael.\n\n     Michael smiles, shakes hands with a grave-digger's grip.\n     The Postman doesn't know what to think.\n\n                                ABBY\n                  We've been trying to have a baby\n                  for three years. We can't on\n                  account of Michael had the bad\n                  mumps when he was twelve. So we\n                  need a body father. We could ask\n                  a man here, but it could cause\n                  trouble. I've seen it happen.\n                  Things go okay until the woman\n                  starts to show. Then it can be\n                  bad. But you'll only be around\n                  once in awhile with the mail.\n\n     The Postman just stares at them.      Abby looks to Michael.\n\n                                ABBY\n                  He hasn't said 'no'.\n\n                                                       (CONTINUED)\n\n                                                              48.\n\n36   CONTINUED:    (3)                                              36\n\n                                MICHAEL\n                         (undaunted)\n                  What do you say, mister?     You'd be\n                  doing us a favor.\n\n                                THE POSTMAN\n                  I'll have to think about it.\n\n     The Postman excuses himself with a nod and turns away,\n     shaking his head at the strangeness of this new world.\n\n     But no rest for the wicked, as soon as he's free from Abby\n     and Michael, he's running smack into another group of\n     well-wishing TOWNIES. Mrs. March is among them. She's\n     holding an envelope.\n\n                                TOWNIE #1\n                  Mrs. March wants to give you\n                  something.\n                         (to Mrs. March)\n                  He's right here, Irene.\n\n                                MRS. MARCH\n                         (re: letter)\n                  It's to my daughter Annie. She\n                  left five years ago. She was only\n                  fifteen. The last I heard, she\n                  was living up north...\n\n     The Postman swallows hard, looks from the envelope to the\n     faces around him, to Mrs. March. She looks blindly back.\n     How can he lie to her?\n\n                                THE POSTMAN\n                  Look, Mrs. March, you should know\n                  that...\n\n                                 MRS. MARCH\n                  Know what?\n\n                                 THE POSTMAN\n                  Know that...\n\n     But she stops him, grabs for his hand.\n\n                                MRS. MARCH\n                  I have a feeling about you. I\n                  know you'll do what's right.\n\n     Her hand leaves his and she disappears into the crowd.\n     She's left him with her letter and no choice at all.\n\n                                THE POSTMAN\n                  I got to get out of here.\n\n                                                              49.\n\n37   EXT. PINE VIEW - NIGHT                                         37\n\n     The Postman moves through town. The streets are deserted.\n     He's got his pack on, his mailbag. He passes a 7-11\n     converted to a blacksmith shop. There's a horse tethered\n     to the railing in front of it. He grins; maybe he's going\n     to make it out of here after all. As he starts to move\n     toward the horse...\n\n                                OLD MAN (O.S.)\n                  It's right around the corner.\n\n     An OLD MAN sits on his porch across the street.\n\n                                THE POSTMAN\n                         (freezes, startled)\n                  What is?\n\n                                OLD MAN\n                  What you're looking for.\n\n     The Old Man winks knowingly, then heads inside. As The\n     Postman turns the corner, he finds himself in front of the\n     post office. An old brick building. Chiseled in the\n     granite facing: \"UNITED STATES POST OFFICE. EST. 1884.\"\n\n\n38   INT. POST OFFICE (PINE VIEW) - NIGHT                           38\n\n     Long ago stripped, it still has a proud, official, almost\n     holy feel. The Postman wanders in, stops to read the\n     credo calligraphied on the wall. \"Neither snow, nor\n     rain...\" He turns at a SOUND. Ford is here, leaning\n     against a wall.\n\n                                FORD\n                  I knew you'd come here.\n\n                                  THE POSTMAN\n                  You did, huh?\n\n     Ford nods.    A sage sixteen-year-old.\n\n                                FORD\n                  How do you get to be a postman,\n                  anyhow?\n\n                                THE POSTMAN\n                  You have to be in the right place\n                  at the right time.\n\n                                FORD\n                  How could I do it?\n\n                                                      (CONTINUED)\n\n                                                              50.\n\n38   CONTINUED:                                                     38\n\n                                THE POSTMAN\n                  I thought you wanted to drive\n                  cars.\n\n                                FORD\n                  Not anymore. That was kid's\n                  stuff. This is real. So, where's\n                  the right place?\n\n                                THE POSTMAN\n                  Could be anywhere. Anytime. Only\n                  another postman can make you a\n                  postman.\n\n                                FORD\n                  Kinda like vampires, right?\n\n                                THE POSTMAN\n                  Something like that. You have to\n                  be sworn in.\n\n     Ford raises his right hand, palm out, ready to take the\n     oath. It takes The Postman a moment to realize.\n\n                                THE POSTMAN\n                  The organization's kinda shaky.\n                  It might not last.\n\n                                FORD\n                  What does?\n\n                                THE POSTMAN\n                  You'd meet a lot of people who\n                  don't believe in you.\n\n                                FORD\n                  I'll set them straight.\n\n                                THE POSTMAN\n                  It's a lonely job.\n\n                                FORD\n                  I've been lonely all my life.\n\n     This response strikes a chord. The Postman sees how badly\n     Ford wants something to hold onto. He sees himself.\n\n                                THE POSTMAN\n                  So have I, Ford. So have I.\n\n     The Postman looks up at the creed on the wall.    Finally...\n\n                                                      (CONTINUED)\n\n                                                                51.\n\n38   CONTINUED:    (2)                                                38\n\n                                   THE POSTMAN\n                  What the hell?     Repeat after me.\n\n                                POSTMAN/FORD\n                         (repeating)\n                  Neither snow, nor rain, nor heat\n                  nor gloom of night stays these\n                  couriers from the swift completion\n                  of their appointed rounds.\n\n                                   THE POSTMAN\n                  Okay then.\n\n                                FORD\n                         (repeating)\n                  Okay, then.\n\n                                THE POSTMAN\n                  No, no, no, I'm saying that. You\n                  just listen... By my authority you\n                  are now empowered to carry the\n                  mail.\n                         (extends a hand)\n                  Congratulations, you're a postman.\n\n     They shake hands. The Postman doesn't realize, but this\n     is the most important moment in Ford's life.\n\n                                FORD\n                  I want you to know I'd die to get\n                  a letter through.\n\n     Ford's intensity takes The Postman back.       But the moment\n     is broken when...\n\n                                BRISCOE (O.S.)\n                  Johnny, why don't you run along.\n                  I need to speak to this man.\n\n     Ford bristles at \"Johnny,\" looks to The Postman.\n\n                                FORD\n                  I'll see you around.\n\n                                THE POSTMAN\n                  Sure thing, Ford.\n\n     Ford exits.\n\n                                BRISCOE\n                  Johnny's real impressed with you.\n                  Whole town's real impressed with\n                  you.\n\n                                                        (CONTINUED)\n\n                                                              52.\n\n38   CONTINUED:    (3)                                              38\n\n                                THE POSTMAN\n                  I take it you're not.\n\n                                BRISCOE\n                  Smarter than you look.\n\n                                THE POSTMAN\n                  What can I do for you, Sheriff?\n\n                                BRISCOE\n                  You can clear out. Or I can throw\n                  you out. Either way suits me\n                  fine.\n\n                                THE POSTMAN\n                  I'm afraid you don't understand,\n                  Sheriff. I'm a government\n                  employee. Authorized by --\n\n                                BRISCOE\n                  You're not authorized by shit.\n                  You're nothing but a drifter who\n                  found a bag of mail. And I want\n                  you out of my town.\n\n                                THE POSTMAN\n                  This is going in my report.\n\n                                BRISCOE\n                  These people don't need dreams,\n                  Mr. Postman. They need something\n                  real. They need help with the\n                  goddamn Holnists. Are you going\n                  to bring them that?\n                         (as The Postman\n                          doesn't answer)\n                  Didn't think so. All you cost us\n                  so far is a few bowls of soup and\n                  maybe later a few broken hearts.\n                  I aim to keep it that way. You\n                  can stay till morning. Then I\n                  don't ever want to see you again.\n\n     Briscoe exits, leaves The Postman alone in the post\n     office.\n\n\n39   INT. ABANDONED HOTEL - ROOM 7 - NIGHT                          39\n\n     The Postman arrives home. He pushes open the door,\n     knocking over a stack of letters that have been shoved\n     under the door. He gathers them up, flips through them.\n     They're written on scraps, the backs of pictures, on\n     handkerchiefs and homemade paper. They aren't old.\n\n                                                      (CONTINUED)\n\n                                                                53.\n\n39   CONTINUED:                                                       39\n\n     They're brand new.      Shaking his head, he closes the door.\n\n     The Postman has no sooner done so when there's a KNOCK on\n     the window. He looks over at a woman. She shrugs,\n     smiles, holds up a letter. The Postman sighs; he's\n     trapped in here.\n\n\n40   EXT. FOSTER'S FREEZE - NIGHT                                     40\n\n     CAMERA STARTS ON a man with a string-tied package crossing\n     the streets and DRIFTS TO the abandoned car where Ford\n     lives. He's home.\n\n\n     ON FORD\n\n     Concentrating, Ford holds a needle and thread and a piece\n     of cloth on which he's drawn an approximation of the post\n     office shoulder patch. By moonlight he embroiders it in.\n     Not exactly work you'd pay money for, but not bad either.\n\n\n41   INT. ABANDONED HOTEL - ROOM 7 - CLOSE ON STRING-TIED             41\n     PACKAGE - NIGHT\n\n     ~from the previous scene.       It's on the table with a\n     growing stack of mail.\n\n     The Postman is in bed, trying to sleep. But it's hard-\n     coming. He laces his fingers behind his head, stares up\n     at the moon through a hole in the wall. A KNOCK at the\n     door.\n\n                                   THE POSTMAN\n                  Just leave it.\n\n     There's a pause.    And then, ANOTHER KNOCK.\n\n                                THE POSTMAN\n                  I said leave it.\n\n     The door opens. Surprise. Abby stands in the doorway,\n     her hair held up by an old red ribbon. He sits up.\n\n                                   THE POSTMAN\n                  Hello, Abby.\n\n                                ABBY\n                  You'll be leaving tomorrow?\n\n                                   THE POSTMAN\n                  I guess.\n\n                                                        (CONTINUED)\n\n                                                                   54.\n\n41   CONTINUED:                                                          41\n\n                                ABBY\n                         (enters; closes door)\n                  Everybody's up late writing\n                  letters for you to take. We're\n                  not supposed to waste candles like\n                  that, but they're so excited.\n\n                                   THE POSTMAN\n                  How about you?     Do you have a\n                  letter?\n\n                                ABBY\n                  I don't have anybody to write to.\n\n                                THE POSTMAN\n                  I'll find you a pen pal. Someone\n                  with interests similar to your\n                  own. Dancing, checking for mumps.\n\n     Abby laughs.    The Postman is charmed.\n\n                                ABBY\n                  You're funny. Hardly anyone's\n                  funny around here.\n\n                                THE POSTMAN\n                  I guess no one feels much like\n                  laughing.\n\n     The two of them just look at each other a moment.         Abby\n     fingers the ribbon in her hair.\n\n                                ABBY\n                  Have you decided yet?\n\n                                THE POSTMAN\n                  Oh, well, I've been thinking about\n                  it.\n\n     A beat. Abby lets her shift drop to the floor, then\n     slides under the sheets alongside him.\n\n                                 THE POSTMAN\n                  Sure.   Why not?\n\n     They lie there awkwardly for a moment.          He looks at her.\n\n                                THE POSTMAN\n                  God, you're beautiful. Sorry, I\n                  know you'd probably like to keep\n                  things more clinical.\n                         (beat)\n                  You don't even know my name.\n\n                                                           (CONTINUED)\n\n                                                                 55.\n\n41   CONTINUED:    (2)                                                 41\n\n     She shushes him, covers his mouth with her hand.\n\n                                ABBY\n                  I don't want to.\n\n     He nods he understands.     She stares into his eyes.\n\n                                ABBY\n                  It would be easier for me if you\n                  closed your eyes.\n\n     The Postman closes his eyes. Abby slides her hand away\n     from his mouth. And as they start to make love...\n\n                                                       DISSOLVE TO:\n\n\n42   INT. ABANDONED HOTEL - ROOM 7 - DAY                               42\n\n     The Postman wakes, reaches for the warm body that was\n     there last night. But Abby is gone. All that's left\n     behind is her red ribbon. Wistful, he picks it up.\n\n\n43   EXT. ABANDONED HOTEL - DAY                                        43\n\n     The Postman exits. In uniform, his bag slung over his\n     shoulder. He starts then stops short. Only now do we see\n     most of the townspeople have silently assembled here.\n     They've been waiting for him, starving for him.\n\n     Ford steps up, hands him another fresh packet of letters.\n     The Postman sees that Ford hangs on to four or five.\n\n                                THE POSTMAN\n                  What about those?\n\n                                FORD\n                  These are going to Blue Jay.\n                  About twenty miles east. I\n                  thought I could take them.\n\n     The Postman scans the crowd.      Looking for Abby maybe?\n\n                                 THE POSTMAN\n                          (absently)\n                  Okay.   They're yours.\n\n     Briscoe rides up, regards The Postman sternly.\n\n                                BRISCOE\n                  I'm your escort out of town.\n\n     Some of the town's CITIZENS lead up a saddled mare.\n\n                                                       (CONTINUED)\n\n                                                             56.\n\n43   CONTINUED:                                                    43\n\n                                CITIZEN #1\n                  We took a vote, Mr. Postman.   We\n                  want you to have this horse.\n\n                                CITIZEN #2\n                  Now don't say no. A man on\n                  horseback can cover ten times the\n                  territory of a man on foot.\n\n                                THE POSTMAN\n                         (smiles at Briscoe)\n                  I'll take it.\n\n     He ties his mailbag to the saddle, swings himself up.\n\n                                CITIZEN #3\n                  There's a bedroll, some oats and a\n                  week's rations.\n\n                                THE POSTMAN\n                  Thank you.\n\n                                CITIZEN #1\n                  Where do you figure you'll go from\n                  here?\n\n                                THE POSTMAN\n                  Go?... Oh yeah... I'll head west,\n                  then work my way back here in a\n                  sort of figure eight.\n\n     \"8.\" Everyone's quiet a moment. They shift\n     uncomfortably. The Postman looks out at the crowd. They\n     crave hope. He should probably just keep his mouth shut.\n\n                                THE POSTMAN\n                  Times seem hard right now. But\n                  you have to believe it's getting\n                  better. Birds are migrating\n                  again. The rains are back.\n\n     The people consider him and then each other. By God, they\n     do feel hopeful. Suddenly, Ellen, her little boy by her\n     side, begins to sing. It's weak at first, but one-by-one\n     the others join in. Soon the whole town is singing:\n\n                                ELLEN & TOWN\n                  'Oh beautiful for spacious skies,\n                  for amber waves of grain. For\n                  purple mountain's majesty, above\n                  the fruited plain. America...'\n\n     The Postman looks around. They sing their hearts out.\n     The guilt is overwhelming. He digs his heels into the\n     horse's flanks and rides out of town.\n\n                                                           57.\n\n44   EXT. PALISADE GATES (PINE VIEW) - DAY                        44\n\n     People line the top as The Postman and Briscoe ride out.\n     The strains of \"AMERICA\" still in the background.\n\n                             BRISCOE\n               You got a helluva nerve, whoever\n               you are.\n\n     The Postman doesn't rise to the bait.\n\n                             THE POSTMAN\n               Is Abby around?\n\n                             BRISCOE\n               She and Michael are working the\n               north meadow this morning.\n\n     Briscoe reins up -- he's gone as far as his duty commands.\n\n                             BRISCOE\n               Well, you're on your own.\n\n     The Postman tips his cap and continues riding by \"Pine\n     View - Population 132.\" Briscoe watches a moment, then\n     calls after him:\n\n                            BRISCOE\n               Hey! Are you really who you say\n               you are?\n\n                             THE POSTMAN\n               If I come back with some mail,\n               you'll know!\n\n     The Postman continues. Caught in an inner turmoil,\n     Briscoe reaches into his pocket, and pulls out a letter.\n     He turns it over in his hands, looks off at The Postman.\n\n                              BRISCOE\n               God damn it!\n\n     Briscoe urges his horse forward, catches up. He hands The\n     Postman the letter, then rides back for town. The Postman\n     watches Briscoe. The people lining the wall. And he\n     realizes just what effect he's had. There's nothing to\n     do, but shrug his shoulders and ride. Strains of\n     \"AMERICA\" still ECHO hauntingly OVER:\n\n\n45   EXT. ON ROAD - SUN                                           45\n\n     A green and lavender sunset. In the middle of nowhere,\n     The Postman rides, chewing a piece of jerked beef. He\n     flips through some of the letters entrusted to him.\n\n                                                   (CONTINUED)\n\n                                                              58.\n\n45   CONTINUED:                                                     45\n\n                                   THE POSTMAN\n                  Eugene.     Benning. Portland.\n                            (stops short)\n                  Boston!\n                         (resumes)\n                  Seattle. Boise... St. Rose,\n                  Paradise on the Pacific...\n\n     He considers the letter, looks around as if someone may be\n     watching. He just begins to tear the corner, then stops.\n\n                                 THE POSTMAN\n                  Maybe one thing can still be\n                  sacred.\n                          (to horse)\n                  All in all, not a bad gig, huh?\n\n     The HORSE SNORTS. Smiling, The Postman shoves the\n     envelope into his bag. As he does, he finds something\n     else. The red ribbon. He runs it through his fingers,\n     thinks wistfully of Abby. Then, like a knight of old\n     representing a lady's honor, he ties it to his mailbag and\n     rides on.\n\n\n46   EXT. WELL (PINE VIEW) - DAY                                    46\n\n     Abby's washing clothes with a tub and washboard. Waging\n     war on dirt. Michael leans against a tree, watches Abby\n     at work until she notices him. She wipes the sweat from\n     her brow, tries not to smile.\n\n                                ABBY\n                  What are you looking at?\n\n                                  MICHAEL\n                  Everything.\n\n     He steps over and they're in each other's arms. This is\n     love. But as Michael kisses her, we hear a familiar\n     alarm:\n\n                                  SENTRY\n                  Holnists!    Holnists are coming!\n\n\n47   EXT. PALISADE GATES (PINE VIEW) - DAY                          47\n\n     Led by Bethlehem and Getty, the soldiers ride in.\n     Something about the citizens disturbs Bethlehem.\n\n                                BETHLEHEM\n                  They don't usually look at me.\n\n                                                      (CONTINUED)\n\n                                                                59.\n\n47   CONTINUED:                                                       47\n\n     Bethlehem reins in across from the post office.     Someone\n     has hung a tattered old American flag.\n\n                                BETHLEHEM\n                  Who's responsible for that?!\n\n     No one answers.     All heads are down now.\n\n\n48   INT. POST OFFICE - DAY                                           48\n\n     Ford is sweeping up. The place looks almost presentable.\n     He stops when he hears Bethlehem calling once more for the\n     responsible party.\n\n     Ford starts forward.    Suddenly Briscoe is blocking his\n     way.\n\n                                BRISCOE\n                  Holnists, Johnny. You gotta stay\n                  out of sight.\n\n                                FORD\n                  I'm a postman. And I'm not hiding\n                  from anyone. I --\n\n     Briscoe grabs him by the shirt, hauls him out the back\n     way.\n\n                                BRISCOE\n                  You stay out of this, or I'll lock\n                  you up myself damnit.\n\n\n49   EXT. PINE VIEW - DAY                                             49\n\n     Bethlehem picks Michael out of the crowd.\n\n                                BETHLEHEM\n                  You.  You'll be responsible.\n                         (to soldiers)\n                  Get him a torch.\n\n     Michael walks out into the square. One of the soldiers\n     returns with a burning torch, gives it to Michael.\n\n     Bethlehem looks at the town, then at Michael.\n\n                                BETHLEHEM\n                  Set that flag on fire.\n\n                                                       (CONTINUED)\n\n                                                                60.\n\n49   CONTINUED:                                                       49\n\n     ON MICHAEL\n\n     It's killing him, but Michael sets the torch to the flag.\n                              BETHLEHEM\n               Now throw it through the window of\n               your 'post office.'\n\n     CRASH!    The TORCH goes through the post office WINDOW.\n\n\n     ON FORD\n\n     Struggling to get out, but Briscoe blocks his way.\n\n\n     ON BETHLEHEM\n\n     As flames grow, he takes one last look around.\n\n                                BETHLEHEM\n                  The United States doesn't exist.\n                  That flag is an abomination.\n\n     Briscoe steps forward, attempts to diffuse the situation.\n\n                                BRISCOE\n                  General Bethlehem.\n                         (as Bethlehem turns)\n                  We're gathering the tribute, sir.\n                  Can I take your wagons?\n\n     Bethlehem decides not to kill anyone, looks to Getty.\n\n                                BETHLEHEM\n                  Make sure that fire doesn't go\n                  out.\n\n     The General joins Briscoe.\n\n     Tears on his cheeks, Ford watches the post office burn.\n\n\n50   EXT. PARKING LOT (PINE VIEW) - EARLY EVENING                     50\n\n     Bethlehem relaxes with his officers as wagons are loaded.\n     Michael is just passing with a sack of grain on his\n     shoulder, when Bethlehem looks across the street -- spies\n     Abby and some of the other women sewing grain sacks shut.\n\n                                BETHLEHEM\n                  Good Lord. That, gentlemen, is a\n                  first-rate piece of ass.\n\n                                                      (CONTINUED)\n\n                                                               61.\n\n50   CONTINUED:                                                      50\n\n     Michael overhears. He looks over as Bethlehem's men nod\n     in agreement. Michael sees that they're talking about\n     Abby.\n\n                                BETHLEHEM\n                  Tell the Sheriff I want to be\n                  introduced. She does not belong\n                  in a mudhole like this.\n\n     One of the men hurries off. It's concern for Abby, not\n     for his manhood that makes him step forward.\n\n                                MICHAEL\n                  Excuse me.\n\n                                BETHLEHEM\n                         (looks over)\n                  You again?\n\n                                 MICHAEL\n                  That's my wife, General.   She's a\n                  married woman.\n\n                                BETHLEHEM\n                  Do you know what system of\n                  government we have here, son?\n                         (as Michael shrugs)\n                  A feudal system. Like the Middle\n                  Ages. With lords and vassals.\n                  That's you and me. Those lords,\n                  they had some ideas. If a vassal\n                  got married, it was the lord's\n                  right, his right, to sleep with\n                  the bride on the wedding night.\n\n                                MICHAEL\n                  Me and Abby have been married for\n                  three years.\n\n                                BETHLEHEM\n                  Sorry, but I wasn't invited to the\n                  wedding. Now, you've already done\n                  me one favor, son. Don't let this\n                  be a black mark on an otherwise\n                  perfect record.\n\n\n     ABBY\n\n     Another woman has pointed out to her what's going on. She\n     can't hear what's being said, but she watches, concerned.\n\n                                                       (CONTINUED)\n\n                                                                 62.\n\n50   CONTINUED:    (2)                                                 50\n\n     PARKING LOT\n\n                                BETHLEHEM\n                  We'll be civilized about this. I\n                  want you to give me your blessing.\n\n                                   MICHAEL\n                  Sir, I can't.     You can't.\n\n                                BETHLEHEM\n                  Can't? I'm tired of can't. We\n                  had a great nation once. Do you\n                  know what made it that way? I\n                  can! Till the weak came along.\n                  The 'I can'ts' destroyed us. But\n                  I'm going to make us strong again.\n                  I'm going to be the father of a\n                  new nation.\n                         (draws his sword)\n                  Do you know why it will be me?\n\n     Michael looks to Abby as she starts across the street.\n\n                                   BETHLEHEM\n                  Because I can!\n\n     The SWORD WHISTLES down.       Accompanied by an anguished cry:\n\n                                   ABBY\n                  Michael!\n\n     Abby rushes forward, but she's blocked by Getty and\n     another man. She cries out again and again.\n\n     Filled with impotent fury, Briscoe squeezes out the words.\n\n                                BRISCOE\n                  You didn't have to --\n\n                                BETHLEHEM\n                  Didn't have to what, Sheriff?\n\n     Three Holnist soldiers draw down on Briscoe.      Bethlehem\n     circles, menacing on his horse.\n\n                                BETHLEHEM\n                  Your people seem seditious.    You\n                  seem seditious.\n\n     Briscoe stares down at Michael's crumpled form.      Abby\n     wails.\n\n                                                        (CONTINUED)\n\n                                                           63.\n\n50   CONTINUED:    (3)                                            50\n\n                                   BRISCOE\n                  Aw, Michael...\n\n     Briscoe might go after Bethlehem despite the odds.\n\n                                BETHLEHEM\n                  What am I seeing here? I'm\n                  waiting.\n\n                                BRISCOE\n                         (burying his anger)\n                  Man came through here. With mail.\n                  Said he was a postman. Said the\n                  government had been restored back\n                  east.\n\n                                BETHLEHEM\n                  What government?\n\n     From out of the crowd -- a voice.         Ford.\n\n                                FORD\n                  The United States government.\n\n     Bethlehem whirls his horse at the noise.\n\n                                   BETHLEHEM\n                  Who said that?\n\n     Not waiting for an answer, Getty charges the crowd, knocks\n     one of the onlookers down. A dead silence.\n\n     Bethlehem frowns, thinks it over a minute.\n\n                                BETHLEHEM\n                  Which way did he go?\n                         (a beat)\n                  Do not make me ask again.\n\n                                   BRISCOE\n                          (lies)\n                  East.\n\n                                BETHLEHEM\n                         (to Getty)\n                  Send a patrol east. Send three\n                  more south, north and west.\n                         (to Briscoe)\n                  They'd better find him east.\n\n\n51   EXT. PALISADE GATES (PINE VIEW) - NIGHT                      51\n\n     The Holnist army rides out. Overcome by grief, tied at\n     the wrists, Abby stumbles behind one of the wagons.\n\n                                                             64.\n\n52   EXT. BURNT-OUT POST OFFICE - NIGHT                            52\n\n     Before the smoking ruins, Ford pulls on a blue shirt, his\n     homemade postal flag on the shoulder. As Briscoe steps\n     up, Ford shows him a bundle of singed, but intact letters.\n\n                             FORD\n               I managed to save these.\n\n                             BRISCOE\n                      (re: shirt)\n               Take that thing off, Johnny.    You\n               want to die, too?\n\n     Ford shoves the letters in a makeshift bag, then climbs\n     onto his waiting pony.\n\n                             FORD\n               I'm headed south. With the mail.\n\n                             BRISCOE\n                      (grabs harness)\n               Don't be a damn fool.\n\n                             FORD\n               What kind should I be?... Haw!\n\n     Ford digs his heels into the pony and is off in a flash\n     doing damn near a buck seventy-five.\n\n\n53   INT. MOVIE THEATER (BENNING, OREGON) - DAY                    53\n\n     Mail call. The Postman stands in front of the torn\n     screen. Hoping for glory by association, the smiling\n     Mayor stands beside him. The ragged people of Benning\n     clamor in front. Kids smile up at him as he calls out\n     names:\n\n                              THE POSTMAN\n               Rachel Clark!\n                      (as she's there)\n               Charlie Sykes!\n                      (as he's there)\n               Graham Druitt!\n\n                             VOICE\n               G.D. died last winter of flu.\n\n     The Postman nods, sticks the letter back in his bag.\n\n                             THE POSTMAN\n               That's it for now, folks.\n               There'll be more once a real\n               system is in place.\n\n                                                     (CONTINUED)\n\n                                                               65.\n\n53   CONTINUED:                                                      53\n\n     As usual, The Postman is assaulted with questions.\n\n                                MAN\n                  Tell us about President Starkey!\n\n                                WOMAN\n                  What about New York City?   Did\n                  they survive the plague?\n\n                                THE POSTMAN\n                  Survive? They got Broadway up and\n                  running again. There's a kid\n                  doing Andrew Lloyd Webber like you\n                  wouldn't believe.\n\n     An older woman sheds a happy tear -- this is wonderful\n     news.\n\n                                MAN #3\n                  How much is it to mail a letter?\n\n                                THE POSTMAN\n                         (smiles)\n                  A buck seventy-five.\n\n                                MAN #3\n                  That sounds awful cheap.\n\n                                THE POSTMAN\n                  The catch is the only currency\n                  recognized are silver American\n                  coins minted before 1964 and two\n                  dollar bills. Look for Thomas\n                  Jefferson. Of course, food is\n                  always acceptable as barter.\n\n     The moment is split by a SIREN.\n\n\n54   EXT. BENNING, OREGON - DAY                                      54\n\n     A long double-line of Holnist Cavalry stand in formation\n     in front of the city walls made from stacks of crushed\n     cars. On top, a SKINNY SENTRY CRANKS the SIREN while a\n     CHUBBY SENTRY watches.\n\n     Bethlehem rides through them with Abby in tow -- her\n     wrists tied by a rope which is looped around the pommel of\n     Bethlehem's saddle. Her face is bruised, her bottom lip\n     split. Bethlehem reins up, puzzled by the apparent stall.\n\n                                                       (CONTINUED)\n\n                                                           66.\n\n54   CONTINUED:                                                  54\n\n                                GIBBS\n                         (rides up; salutes)\n                  They won't open the gates, sir.\n\n                                BETHLEHEM\n                  What?\n\n                                GIBBS\n                  They say they got a representative\n                  of the restored United States in\n                  there. They say this army is\n                  illegal. They say --\n\n     The Chubby Sentry answers from the top of the palisade.\n\n                                CHUBBY SENTRY\n                  Drop dead and go to hell!\n\n     The Chubby Sentry disappears back behind cover. Bethlehem\n     remains controlled, but his manner becomes deadly.\n\n                                BETHLEHEM\n                  The Romans had an expression they\n                  used to scare their children.\n                  'Hannibal ad portas!' -- Hannibal\n                  is at the gates. Do you know who\n                  Hannibal was?\n                         (as she doesn't answer)\n                  Of course not. A pretty girl like\n                  you wouldn't know a thing.\n                         (to Getty)\n                  Colonel Getty, get some men up\n                  there and open that gate.\n\n\n55   EXT. INSIDE GATES - DAY                                     55\n\n     The Mayor hurries over, The Postman following reluctantly\n     behind. The Mayor spots the Sentries up on the parapet.\n\n                                MAYOR\n                  What the hell are you doing?!\n                  Open the gates!\n\n                                SKINNY SENTRY\n                  Government's restored! We don't\n                  have to take their crap anymore!\n\n\n56   EXT. PALISADE GATES (BENNING) - DAY                         56\n\n     Two Holnists scale the gates. They're near the top when\n     the Skinny Sentry appears. He FIRES an ARROW. Hit\n     through the shoulder, one Holnist falls. The other jumps.\n\n                                                               67.\n\n57   EXT. PARAPET - INSIDE WALLS - DAY                               57\n\n     Chubby and Skinny duck down behind the safety of the\n     walls, trading high-fives.\n\n\n58   EXT. PALISADE GATES (BENNING) - DAY                             58\n\n     Bethlehem orders his men to pull back. He shakes his\n     head, a quiet rage building. But he knows there's no\n     military threat here. It's going to be a massacre.\n\n\n59   EXT. PARAPET - INSIDE WALLS - DAY                               59\n\n     Climbing an inside ladder, the Mayor slams the Chubby\n     Sentry against the wall.\n\n                              MAYOR\n               Idiots!\n\n                             CITIZEN #1\n                      (realizing; scared)\n               They're gonna kill us all.\n\n     The Mayor peers out through an observation hole.   The\n     Postman and several others join him.\n\n                              CHUBBY SENTRY\n               No!   Let's fight them!\n\n                             MAYOR\n               With what? We got five guns maybe\n               20 rounds of ammo in the whole\n               town! How do we fight them with\n               that?!\n\n     The Postman watches the Holnists prepare for attack.\n\n                            THE POSTMAN\n               You don't. Negotiate a\n               settlement. Give them extra\n               supplies.\n\n     The men look at each other.   Sounds reasonable enough.\n\n                             MAYOR\n               Okay. You're a government rep.\n               You go tell them.\n\n     The look on The Postman's face says it all.\n\n                                                               68.\n\n60   EXT. GATES (BENNING, OREGON) - DAY                              60\n\n     They open enough to let the Postman ride out, then close\n     behind him. He sits nervously on his horse waving a white\n     flag. He's met, dismounts and is led to a command post\n     where Bethlehem is studying a rough map of the town.\n\n                                BETHLEHEM\n               Make it quick.     I've got an attack\n               to coordinate.\n\n                             THE POSTMAN\n               General, um, they've asked me to\n               negotiate a peace treaty.\n\n     The last time he and Bethlehem were face-to-face, the\n     Postman had a shaved head, was dressed in rags, and was\n     covered with cuts and bruises. Bethlehem can't place him,\n     but there's something familiar all the same.\n\n                                BETHLEHEM\n               Do I know you?\n\n                             THE POSTMAN\n               I don't think so, sir. I --\n\n                             BETHLEHEM\n                      (scans uniform)\n               You're the Postman, aren't you?\n\n\n     ABBY\n\n     watches from the flap of Bethlehem's tent.    The guard sees\n     and shoves her back inside.\n\n\n     BETHLEHEM AND THE POSTMAN\n\n     Bethlehem flicks at the uniform flag shoulder patch.\n\n                             BETHLEHEM\n               The restored United States. Do\n               these people really believe that\n               shit? Who are you really?\n\n     Although he wants to confess everything, something tells\n     The Postman he has to try to brass it out.\n\n                             THE POSTMAN\n               I am a United States Postman.\n               Authorized by order 417 of the\n               restored Congress to --\n\n                                                       (CONTINUED)\n\n                                                                  69.\n\n60   CONTINUED:                                                         60\n\n                                BETHLEHEM\n                  I was at the Battle of Georgetown.\n                  I watched the White House burn to\n                  the ground. Don't try to sell me\n                  on any restored U.S...\n\n                                THE POSTMAN\n                  The new capital is based in\n                  Minneapolis. Inside the Hubert\n                  Humphrey Metrodome. You know,\n                  where the Vikings used to play?\n\n                                  BETHLEHEM\n                  You're funny.    Now, what are the\n                  terms?\n\n                                THE POSTMAN\n                  They'll open the gate and give you\n                  double what they usually give.\n                  Just don't hurt anybody. This was\n                  all a misunderstanding.\n\n     Bethlehem thinks this over.\n\n\n61   INT. ABBY'S TENT - DAY                                             61\n\n     Abby tracks the guard's silhouette through the canvas.\n     Her eyes search the tent -- land on the cot in the corner\n     and focus on its heavy, wooden legs.\n\n\n62   EXT. GATES - DAY                                                   62\n\n     Bethlehem has decided.\n\n                                BETHLEHEM\n                  Appreciate your offer, Postman.\n                  Problem is, you're in no position\n                  to negotiate. These people made\n                  it through the bugs and the riots\n                  and the three year winter. But\n                  they're not going to survive you.\n\n     Bethlehem looks to Getty and nods.      Getty motions to a\n     gunner. The MONSTER GUN is FIRED.       Just as a SHELL\n     EXPLODES against the gates --\n\n63   INT. ABBY'S TENT - DAY                                             63\n\n     Abby brings the heavy wooden cot leg down on the\n     unsuspecting guard's head.\n\n                                                              70.\n\n64   EXT. CITY GATES - DAY                                          64\n\n     The cavalry ride through roiling smoke into the open town.\n\n     Horrified, The Postman steps forward, but rifles are on\n     him. All he can do is watch. The Mayor is the first to\n     go down.\n\n                              BETHLEHEM\n                Law six, justice can be dictated.\n                       (to soldiers)\n                Kill him. And kill the restored\n                United States with him.\n\n     Bethlehem turns his attention to the battle.   A CAPTAIN\n     steps forward with gun raised.\n\n                              CAPTAIN\n                       (by rote)\n                In accordance with law eight and\n                by the authority of Emergency\n                Order 46, you are hereby --\n\n     A CRACK of RIFLE FIRE. The Captain's forehead explodes\n     and he falls to the ground.\n\n     Shocked, Bethlehem whirls for the source of the GUNFIRE.\n\n     Abby!   FIRING from a position behind a supply wagon.\n\n     But even as Bethlehem turns, an ARROW SINGS in and lodges\n     in his arm. Fired from a pocket of sentries up on the\n     palisade. Bethlehem bellows in outrage and pain.\n\n     The Postman takes advantage of the moment of chaos to grab\n     the fallen Captain's gun.\n\n     He pulls a Holnist rider from his horse and swings into\n     the saddle. The unhorsed rider goes for his gun. But\n     once more SHOTS RING OUT and he goes down.\n\n     Bethlehem ducks as another BULLET ZINGS close.    Too close.\n\n                              BETHLEHEM\n                Get her.\n\n     Two soldiers move forward.\n\n     Suddenly The Postman's HORSE comes THUNDERING -- trampling\n     the Holnist nearest him.\n\n     The other Holnist hears, looks back, sees The Postman\n     coming and takes aim just as The Postman brings his gun to\n     bear.\n\n                                                      (CONTINUED)\n\n                                                                 71.\n\n64   CONTINUED:                                                         64\n\n     The Holnist FIRES first. We don't see the hit. Just\n     watch as The Postman FIRES an answering ROUND. The\n     Holnist goes down.\n\n     The Postman reins up alongside the wagon. Grunting with\n     pain, he reaches down, takes Abby's arm and swings her up\n     behind him. Then digs his heels in for all he's worth.\n\n     More Holnists come on the run. They FIRE. The HORSE\n     SNORTS in pain. He's hit. But The Postman urges him on,\n     heading into the woods.\n\n     Bethlehem snaps off the arrow shaft and shouts:\n\n                                   BETHLEHEM\n                  Colonel Getty!\n\n\n65   EXT. WOODLAND ROAD - DAY                                           65\n\n     Abby is concerned as the horse slows to a trot.\n\n                                ABBY\n                  We can't stop now. They'll be\n                  coming after us.\n\n     The Postman's head lolls forward. She feels something on\n     her hand, pulls it back smeared with blood. The Postman's\n     shot in the belly.\n\n     The horse is failing.       Near death.\n\n     We hear the sound of PURSUING CAVALRY. Abby urges the\n     horse off the road. When the thicket grows too dense,\n     Abby jumps down. She catches The Postman as he slides\n     off, easing him to the ground.\n\n                                   THE POSTMAN\n                            (disoriented)\n                  Abby...\n\n     Abby shushes him. She pulls on the horse's bridle to\n     force him farther along. But it's no good, the wounded\n     horse goes down on its knees.\n\n     And five RIDERS THUNDER past.       Fooled.   All but the SIXTH,\n     who pulls up to listen.\n\n     In the deep b.g., flames lick at the billowing black\n     smoke. The town is burning.\n\n     The HORSE WHINNIES: in its death throes.        Abby panics,\n     tries to quiet the horse.\n\n                                                         (CONTINUED)\n\n                                                             72.\n\n65   CONTINUED:                                                    65\n\n     The Sixth Soldier has heard the suffering horse. He draws\n     his rifle from the saddle boot and starts into the\n     thicket.\n\n\n     ON ABBY AND POSTMAN\n\n     The Postman lies unconscious on the ground. Abby sits\n     beside him, rifle in hand. The Sixth Soldier appears.\n\n                                  ABBY\n                  Don't move.\n\n     He hesitates at first. Then dismounts and moves toward\n     her. Abby cocks the rifle.\n\n                                SIXTH SOLDIER\n                  If you'd had a bullet, you'd a\n                  used it by now.\n\n     Moving closer still, he doesn't see the BRANCH pulled back\n     in The Postman's hand until it SNAPS hard into his face.\n\n     He stumbles back.\n\n                                  ABBY\n                  You're right.\n\n     Abby dashes out, rifle in hand. She swings for the\n     bleachers. The butt catches the side of the Sixth\n     Soldier's head. He falls hard.\n\n     The Postman's eyes flutter. Dazed, he watches as Abby\n     pilfers through the Soldier's gear. She takes everything\n     of value: a knife, bullets, a canteen. His eyes flutter\n     closed.\n\n\n66   EXT. WOODS - DAY                                              66\n\n     Snowflakes swirl. Abby lays a sapling travois beside The\n     Postman. He groans as she rolls him onto it, tucks a\n     blanket around him. Using all the strength God gave her,\n     Abby lifts one end, gets it high enough to hitch it to the\n     Sixth Soldier's horse. As Abby leads the horse away...\n\n\n67   EXT. WOOD ROAD - DAY                                          67\n\n     The snow has increased. A Holnist patrol moves down the\n     road, disappears around a bend. A beat.\n\n                                                   (CONTINUED)\n\n                                                               73.\n\n67   CONTINUED:                                                       67\n\n     Abby appears, leading the horse and travois.   She crosses\n     the road and disappears into the woods.\n\n     A moment later, she reappears with a pine branch which she\n     uses to brush at the snow, obscuring their tracks.\n\n\n68   EXT. CASCADE MOUNTAINS (OREGON) - DAY                            68\n\n     Riding into a blizzard, Abby leads the way up a zigzag\n     path. A valley opens up below. The unconscious Postman\n     lies bundled on the travois.\n\n\n69   EXT. HUNTING SHACK - DUSK                                        69\n\n     A little square shape just visible beyond a creek.     Abby\n     leads the horse and travois-bound Postman to it.\n\n\n70   INT. HUNTING SHACK - DUSK                                        70\n\n     One room. Dirt floor. The WINDOWS RATTLE in the WIND.\n     Snow falls through a hole in the roof. The wooden DOOR\n     BURSTS back and Abby enters. Half-frozen, she leads the\n     horse and the travois right inside.\n\n\n71   INT. HUNTING SHACK - NIGHT                                       71\n\n     A fire has been lit.\n\n     The Postman lies unconscious, his shirt open as Abby\n     washes around his wound. She pulls the shirt back to\n     clean his chest. The material falls away and Abby stops\n     short. There -- high on his biceps -- a branded \"8.\" She\n     stares in disbelief.\n\n                                                     DISSOLVE TO:\n\n\n72   INT. HUNTING SHACK - DAY                                         72\n\n     The Postman lies on a cot below the window.    He's\n     conscious, but pale as a ghost.\n\n     Abby brings him a bowl of soup. Very thin soup.       Stirring\n     it with a spoon, The Postman smiles at Abby.\n\n                                THE POSTMAN\n                  Thank you.\n\n     She turns her back on him without a word.   The Postman\n     tries an exchange just the same.\n\n                                                     (CONTINUED)\n\n                                                               74.\n\n72   CONTINUED:                                                      72\n\n                                THE POSTMAN\n                  I don't think I ever had water\n                  soup before. Maybe next time we\n                  could try it with a little sand?\n                         (as she doesn't respond)\n                  Dirt? Wood?\n                         (as she doesn't smile)\n                  A twig garnish?\n\n     She goes about her business in silence.\n\n                                THE POSTMAN\n                  You used to think I was funny.\n\n                                ABBY\n                  They killed Michael.\n\n                                   THE POSTMAN\n                  I'm sorry.\n\n     He takes a spoonful of soup and she comes to him.\n\n                                ABBY\n                  How sorry are you?\n\n                                THE POSTMAN\n                  What's that supposed to mean?\n\n     Her right hand flashes out, holds a knife up under his\n     chin.\n\n                                THE POSTMAN\n                  What's with you?\n\n                                ABBY\n                  You got the mark of eight on you.\n\n     A long beat. Finally, he swallows the soup in his mouth.\n     The action presses his Adam's apple against the blade.\n\n                                THE POSTMAN\n                  A mark doesn't mean I'm a --\n\n                                   ABBY\n                  You're a liar.     I should've let\n                  you die.\n\n                                THE POSTMAN\n                  Then, why didn't you?\n\n     If she knows, she's not ready to say yet.\n\n                                                       (CONTINUED)\n\n                                                                75.\n\n72   CONTINUED:    (2)                                                 72\n\n                                THE POSTMAN\n                  You were with Bethlehem. Does\n                  that make you one of them?\n\n     Abby considers this, The Postman's gaze flickers down to\n     the spoon he still holds in his hand. Taking one last\n     stab at a joke.\n\n                                THE POSTMAN\n                         (re: the spoon)\n                  Don't make me use this.\n\n     Abby doesn't laugh.      But she does relent.   She steps away.\n\n\n73   EXT. HUNTING SHACK/VALLEY PASS - SUNSET                           73\n\n     The hunting shack huddled against the south side of a low\n     rise. Beyond the rise, a pass. But there's no\n     negotiating it now. It's completely snowed in. And\n     another storm is on the way.\n\n\n74   INT. HUNTING SHACK - DAY                                          74\n\n     WIND HOWLING in the b.g. The Postman lies back on his\n     cot. The little shack has been scoured clean. Abby\n     stares listlessly at the fire. The silence is torture.\n     The Postman tries to strike up a conversation.\n\n                                THE POSTMAN\n                  Wind's come up.\n                         (no response from\n                          Abby)\n                  Getting colder too. Must be\n                  another storm --\n\n     Abby gets up and throws a log on the fire.\n\n                                   ABBY\n                  Anything else?\n\n                                THE POSTMAN\n                  I didn't mean for you to --\n\n                                ABBY\n                  Your legs are going to rot off if\n                  you don't try to walk.\n\n                                   THE POSTMAN\n                  I'm hurt.\n\n                                                        (CONTINUED)\n\n                                                              76.\n\n74   CONTINUED:                                                      74\n\n                                 ABBY\n                  You're lazy.\n\n                                THE POSTMAN\n                  Lazy?! I got a hole in my\n                  stomach. I'm weak. The two big\n                  meals around here are grass and\n                  snow. And we're running out of\n                  grass.\n\n     As the two of them glare at each other for a moment.     Abby\n     starts to put on her coat.\n\n                                THE POSTMAN\n                  Where are you going?\n\n     Abby doesn't answer. She picks up the rifle and starts to\n     lead the horse outside.\n\n                                THE POSTMAN\n                  You're not leaving me here, are\n                  you?\n\n     Abby is out the door without a word.\n\n\n75   EXT. HUNTING SHACK - DAY                                        75\n\n     HOLD ON The Postman in the window as she continues past.\n     He watches a moment, suddenly grimaces. A GUNSHOT. The\n     THUD of a BODY SLAMMING to the GROUND. Abby has shot the\n     horse.\n\n                                                    CUT TO:\n\n\n76   EXT. HUNTING SHACK/PASS - SUNRISE                               76\n\n     Tiny tracks in the snow, leading away from the shack.\n     Abby struggles to make the monumental climb from the shack\n     to the top of the rise where she can get a clear view of\n     the pass.\n\n     PAN PAST her UP TO the top of the rise. It's a clear day\n     -- but the pass is still snowed-in. No sign of winter\n     receding.\n\n                                                    DISSOLVE TO:\n\n77   INT. HUNTING SHACK - DAY                                        77\n\n     Abby ladles a meager portion of horse meat stew into a\n     bowl.\n\n                                                    (CONTINUED)\n\n                                                               77.\n\n77   CONTINUED:                                                       77\n\n                                ABBY\n                  This is the last of it.\n\n     She walks with the bowl past The Postman -- who sits on\n     his cot with arms outstretched -- and pointedly sets the\n     bowl on the table.\n\n                                THE POSTMAN\n                         (mumbled)\n                  Give me a break...\n\n     Abby starts putting on layer after layer of clothing.\n\n                                ABBY\n                  I'm going to check the pass.\n\n                                THE POSTMAN\n                  Why are you in such a hurry to get\n                  out of here? I can think of worse\n                  places. And worse company to --\n\n     And with the SLAM of the DOOR she is gone.\n\n                                                       DISSOLVE TO:\n\n\n78   INT. HUNTING SHACK - DAY                                         78\n\n     A few flakes of snow have begun to drift down. The\n     Postman sits at the window -- starts to play tic-tac-toe\n     in the frost. But then it dawns on him:\n\n                                THE POSTMAN\n                  You can't play tic-tac-toe with\n                  yourself.\n\n\n79   EXT. WOODS - DAY                                                 79\n\n     Disoriented, Abby stops to take stock of her surround-\n     ings. But she can't make anything out -- the snowfall is\n     too thick.\n\n\n80   INT. HUNTING SHACK - DAY                                         80\n\n     The fire is dying. The food untouched. The Postman sits\n     in bed staring anxiously out the window. The snow has\n     turned into a blizzard. He runs Abby's red ribbon through\n     his hands.\n\n                                                           78.\n\n81   EXT. WOODS - DAY                                             81\n\n     Abby trudges along heavily. She stumbles as the ice\n     covering the stream breaks beneath her feet.\n\n                                ABBY\n               Help!\n\n\n82   INT. HUNTING SHACK - DAY                                     82\n\n     The Postman hears her call.\n\n\n83   EXT. HUNTING SHACK - DAY                                     83\n\n     The door opens and out steps The Postman. In pain, he\n     staggers around the back of the cabin -- in search of her.\n\n\n84   EXT. STREAM - DAY                                            84\n\n     Abby looks up, sees him coming. The Postman collapses\n     across from her. Both prone, they're also nearly nose-to-\n     nose.\n\n                             THE POSTMAN\n               I can't help you.\n\n     Finally, he pulls himself to his knees. She does the\n     same. They climb each other to a standing position. Arm-\n     in-arm, they start for the cabin.\n\n\n85   INT. HUNTING SHACK - DUSK                                    85\n\n     Abby sits huddled in blankets. The fire is blazing. The\n     Postman steps over, sets the once-again-hot bowl of stew\n     before her.\n\n     She considers the food a moment.\n\n                             ABBY\n               I told you that's all there was.\n\n                             THE POSTMAN\n               That's why you should have it.\n\n                             ABBY\n               I knew you could walk.\n\n                             THE POSTMAN\n               You're weird, you know that?\n\n                                                             79.\n\n86   INT. HUNTING SHACK - NIGHT                                    86\n\n     The Postman lies in bed, stares through the hole in the\n     roof. A full moon is on the rise. Abby lies in her own\n     makeshift bed, also awake. After a long silence:\n\n                             THE POSTMAN\n               We walked on the moon once, Abby.\n\n                               ABBY\n               So?    What good is that now?\n\n                             THE POSTMAN\n               Obviously you've forgotten Tang\n               and microwave ovens.\n                      (a beat)\n               Your face looks pretty.\n\n     Abby looks up.\n\n                             THE POSTMAN\n               Not so bruised.\n\n                             ABBY\n               Look, there's something you'd\n               better know. You're going to find\n               out soon enough. I'm pregnant.\n                      (a long beat)\n               It's Michael's baby. You're just\n               the body father.\n\n                             THE POSTMAN\n               How do you know it's mine and not\n               Bethlehem's?\n\n                             ABBY\n               He tried with me almost every\n               night. He couldn't do it. So he\n               beat me. Said it was my fault.\n\n                                                   DISSOLVE TO:\n\n\n87   EXT. HUNTING SHACK/PASS - DAY                                 87\n\n     Abby stands atop the low rise -- looking out to the pass.\n     Spring has come to the mountains. At long last the snow\n     is starting to recede.\n\n                                                   DISSOLVE TO:\n\n\n88   EXT. FISHING POOL - DAY                                       88\n\n     The Postman kneels by the bank, sharpening a knife to\n     clean the fish he's caught.\n\n                                                   (CONTINUED)\n\n                                                                   80.\n\n88   CONTINUED:                                                          88\n\n     Then, he catches his reflection in the water.       Tangled\n     beard. Matted hair. Is that him?\n\n     He suddenly starts sharpening the knife with renewed\n     vigor. We get a sense he's not going to use it on the\n     fish.\n\n\n     HANDS\n\n     plunge into the water, pull splashfuls up. We START ON\n     The Postman's back, then ARC AROUND as he washes his face.\n     He's just finished shaving off his beard with the hunting\n     knife. He's nicked-up, but it's a definite improvement\n     and he smiles in satisfaction -- until he sees --\n\n     Abby, reflected in the water.\n\n                                   THE POSTMAN\n                  Abby.\n\n     The Postman whips around to see her standing there.\n\n                                 THE POSTMAN\n                  What is it?   What's wrong?    Is it\n                  the baby?\n\n                                ABBY\n                  The pass is clear. It's time to\n                  go.\n\n     Behind her, he sees the cabin is on fire.       Takes off\n     running.\n\n\n89   EXT. HUNTING SHACK - DAY                                            89\n\n     The fire is blazing. The hunting shack is too far gone to\n     save. The Postman turns around.\n\n                                   THE POSTMAN\n                  What happened?\n\n     He's nonplused to find Abby standing beside a pile of\n     their neatly-packed gear.\n\n                                THE POSTMAN\n                  You got our stuff out.\n\n                                   ABBY\n                  Of course.\n\n                                                         (CONTINUED)\n\n                                                              81.\n\n89   CONTINUED:                                                      89\n\n                                 THE POSTMAN\n                  Of course?   I don't understand.\n\n                                ABBY\n                  I set the fire.\n\n                                THE POSTMAN\n                  Am I missing the point here?\n\n                                ABBY\n                  You didn't think we'd stay here\n                  forever, did you?\n                         (The Postman has\n                          no response)\n                  I'd appreciate if you'd walk with\n                  me long enough to find someplace\n                  safe for the baby. Then we can\n                  split up.\n                         (a beat)\n                  You shaved.\n\n     The Postman has all but forgotten.\n\n                                   THE POSTMAN\n                  Yeah...\n\n                                   ABBY\n                  It looks nice.\n\n     Before he can respond, she's heading off toward the pass,\n     leaving The Postman to shake his head at the absurdity of\n     it all. He shouts after her.\n\n                                THE POSTMAN\n                  You're really weird, you know\n                  that?\n\n                                                      DISSOLVE TO:\n\n\n90   EXT. VALLEY - BELOW CASCADE MOUNTAINS - DAY                     90\n\n     Carrying their gear, Abby and The Postman walk across a\n     meadow of wild flowers, headed for an old road.\n\n                                THE POSTMAN\n                  Have you ever heard of St. Rose,\n                  Abby?\n\n                                ABBY\n                  I've heard people talk. I've\n                  heard lots of names. Bliss.\n                  Hesperia. New Eden. Sheriff\n                  Briscoe says it's a fantasy.\n\n                                                      (CONTINUED)\n\n                                                             82.\n\n90   CONTINUED:                                                    90\n\n                               THE POSTMAN\n                  He's wrong. St. Rose is out\n                  there. And I'm going to find it.\n\n                                ABBY\n                  But you're The Postman.\n\n                                THE POSTMAN\n                  Look, I'm nobody, Abby. I'm\n                  just...\n\n     Before he can come clean -- they see a distant RIDER\n     coming hard. The Postman unslings the rifle, slides a\n     round into the chamber.\n\n                                THE POSTMAN\n                  This is what I hate. Strangers.\n                  Do you say 'hi' or do you blow\n                  their head off? Do they want to\n                  share what they got or take what\n                  you have? And if they want to\n                  take, how far are you willing to\n                  go to stop them? Damn it.\n                         (to the Rider)\n                  All right. That's far enough.\n\n     The Rider pulls up short, wearing a blue home-made\n     uniform.\n\n                                THE POSTMAN\n                  We don't want any trouble.\n\n                                RIDER\n                  Me neither, mister.\n\n     The Postman is taken aback. The Rider, a girl, pulls off\n     her cap, mops it across her brow. Maybe 14, we'll always\n     know her by her Ponytail. Abby registers the uniform\n     first.\n\n                                  ABBY\n                  What are you?\n\n                                PONYTAIL (RIDER)\n                  Carrier 18. U.S. Postal Service.\n                  Got any mail?\n\n     Lowering the rifle, The Postman looks over at Abby, back\n     to Ponytail.\n\n                                THE POSTMAN\n                  That's impossible.\n\n                                                     (CONTINUED)\n\n                                                              83.\n\n90   CONTINUED:    (2)                                              90\n\n                                PONYTAIL\n                  Ain't you heard of The Postman?\n\n                                  ABBY\n                  No, tell us.\n\n                                PONYTAIL\n                  He's only the greatest man who\n                  ever lived. He crossed the\n                  wasteland, shook his fist at the\n                  enemy and spit in the eye of\n                  General Bethlehem himself. He's\n                  back east with President Starkey\n                  right now.\n\n                                THE POSTMAN\n                  Who told you all this?\n\n                                PONYTAIL\n                  Postmaster Ford Lincoln Mercury.\n                  He's in direct contact with the\n                  restored congress.\n\n                                THE POSTMAN\n                  Direct contact... I don't believe\n                  this.\n\n                                PONYTAIL\n                         (growing irritated)\n                  Do you have mail, or don't you?\n\n                                THE POSTMAN\n                  You said Carrier Eighteen. That\n                  mean there's eighteen of you?\n\n                                  PONYTAIL\n                  Thirty-two.    As of midnight.\n\n\n91   EXT. R.V. PARK - DAY                                           91\n\n     Oregon's main post office. A silver Airstream, fifty\n     mobile homes and rusty Winnebagos resting on flat tires.\n     Flying from a pole: the flag of the restored United\n     States. A young recruit is ringing a bell on the top of a\n     Winnebago.\n\n     Ford walks along an RV boulevard. He's joined by two\n     young carriers, RED and Chubby (the sentry from Benning).\n     All wear hip, personalized variations of the official\n     uniform.\n\n                                CHUBBY\n                  You got another letter?\n\n                                                      (CONTINUED)\n\n                                                              84.\n\n91   CONTINUED:                                                     91\n\n     They come around the corner to where seven young recruits\n     wait. They're joined by another twenty carriers.\n\n                                   FORD\n                  More recruits?\n\n                                RED\n                  Seven of them. They're coming\n                  from everywhere.\n\n     Ford looks them over in satisfaction.\n\n                                CHUBBY\n                  Did you get a letter or didn't\n                  you?\n\n     Ford smiles, reaches into his pocket. He pulls out a\n     creased sheet of paper. Chubby grins.\n\n                                FORD\n                  Gather 'round, everybody. Got\n                  another letter here. Came in last\n                  night.\n\n     Buzzing with excitement, the carriers gather around Ford.\n\n\n     SOUTH END OF BOULEVARD\n\n     Ponytail leads Abby and The Postman. They come up in the\n     back of the crowd. Flanked by Red and Chubby, Ford stands\n     on the hood of a car, letter in hand. The Postman taps a\n     clueless YOUNG CARRIER on the back.\n\n                                THE POSTMAN\n                  What's all this?\n\n                                YOUNG CARRIER\n                  Postman sent Ford another letter.\n                  He's gonna read it.\n\n                                FORD\n                         (reading)\n                  'Hello, all postal carriers.'\n\n                                  CARRIERS\n                           (a ritual)\n                  Hello!\n\n                                                      (CONTINUED)\n\n                                                                 85.\n\n91   CONTINUED:    (2)                                                 91\n\n                                FORD\n                  I'm here in Minneapolis with\n                  President Starkey, but my thoughts\n                  are with you. Remember, nothing\n                  worth doing can be done overnight.\n                  Keep your chins up and do your\n                  best not to get shot. Signed, The\n                  Postman.\n\n     A buzz goes through the crowd.       Ponytail looks over.\n\n                                PONYTAIL\n                  His letters are always kind of\n                  short.\n\n     Abby and The Postman exchange a look.\n\n                                FORD\n                         (looks up)\n                  Hold on now. There's a P.S...\n                  Anybody know what P.S. stands for?\n\n     The Postman raises his hand. Ford looks his way. His\n     mouth drops as he realizes. In silence, he walks over to\n     The Postman. They embrace and all the weight Ford's been\n     carrying on his young shoulders suddenly falls to The\n     Postman. The kid nearly collapses.\n\n                                 CHUBBY\n                  Holy shit...\n\n                                RED\n                  That would be H.S., Chubby.\n\n                                CHUBBY\n                  I seen him once when I lived in\n                  Benning. It's The Postman!\n\n     Word goes through the crowd like a wave.\n\n     The Postman takes the letter, reads.\n\n                                 THE POSTMAN\n                  P.S.   Ford knows what to do.\n\n     Ford shrugs sheepishly.\n\n                                FORD\n                  Guess you want to talk about this?\n\n     The Postman takes Ford by the elbow. They disappear into\n     the tent. The carriers just staring after them,\n     awestruck.\n\n                                                        (CONTINUED)\n\n                                                               86.\n\n91   CONTINUED:    (3)                                               91\n\n                                 PONYTAIL\n                  I found him!   I found him!\n\n     They clamor around her.\n\n\n92   INT. TENT - DAY                                                 92\n\n     The Postman and Ford.\n\n                                THE POSTMAN\n                  President Starkey? Minneapolis?\n                  Ford knows what to do?\n\n                                FORD\n                  I thought you were dead.\n\n                               THE POSTMAN\n                  So? I'm not making the\n                  connection. What's all this then?\n\n                                FORD\n                  I lied. I told people you were in\n                  contact with me.\n\n                                 THE POSTMAN\n                  Why?\n\n                                FORD\n                  Because I didn't want it to end.\n\n                                THE POSTMAN\n                  I don't know how long I can stay,\n                  Ford. President Starkey will send\n                  word one day and I'll have to move\n                  on. Understand?\n\n                               FORD\n                  Sure. But you'll stay till he\n                  sends word? Right?\n\n     The Postman can't answer, just turns and walks out of the\n     tent.\n\n\n93   EXT. TENT - DAY                                                 93\n\n     As The Postman exits, Chubby leads the carriers in a\n     salute. The Postman actually turns a moment to see if\n     someone else is standing behind him.\n\n     He looks back, sees the young, shining faces.\n\n                                                       (CONTINUED)\n\n                                                                  87.\n\n93   CONTINUED:                                                         93\n\n                                THE POSTMAN\n                  Aw, don't do that. Hands down.\n\n     Their hands go down in one crisp military move. The\n     Postman looks at Abby, to Ford as he exits the tent.         The\n     kid is craving reassurance.\n\n                                FORD\n                  You'll stay 'til President Starkey\n                  sends word, right? Right?\n\n                                THE POSTMAN\n                  Yeah, till he sends word, right.\n\n     Ford smiles, gestures to the carriers.\n\n                                FORD\n                  Could you say a few words?\n\n     The Postman looks over at the carriers.    They quiet under\n     his gaze, immediately respectful.\n\n     The problem is, he has no idea what to say.       Finally:\n\n                                THE POSTMAN\n                  Two plus two equals four.\n\n     The cheering is tumultuous. The Postman picks Abby out of\n     the cheering crowd -- the look on her face says it all.\n\n\n94   EXT. RV PARK - WINNEBAGO ROW - DAY                                 94\n\n     The guts of the operation. Several carriers are busy\n     sorting and bagging letters. It goes out pinned to a\n     clothesline which crisscrosses back and forth. Everyone\n     follows as Ford takes The Postman on a tour. There are\n     hushed whispers among those who are seeing him for the\n     first time.\n\n                                FORD\n                  We bring all the mail here first.\n                  We sort it, group it and then it\n                  goes out. So far we got thirty\n                  routes.\n\n     Ford leads The Postman and Abby into another Winnebago.\n     Chubby and Red and Ponytail follow. Those that can't fit\n     just peer in through the windows.\n\n                                                           88.\n\n95   INT. WINNEBAGO - DAY                                         95\n\n     An old manual crank printing press is working away. Ford\n     proudly removes a sheet, shows it to The Postman. A\n     caricature of eight evil Holnists, forming a figure eight.\n     Beneath: \"Unite Against Holnist Tyrraney!\"\n\n                             THE POSTMAN\n               You spelled tyranny wrong.\n\n                             CHUBBY\n                      (low, to Red)\n               Boy, he's smart.\n\n\n96   EXT. RV CAMP - GREEN LAWN - DAY                              96\n\n     The seven young Recruits seen earlier stand in a line.\n     They're joined by OLD GEORGE, every day of 75 years old.\n\n     Ponytail holds up her hand, swears them in.\n\n                             PONYTAIL/RECRUITS\n               Neither snow, nor rain, nor heat,\n               nor gloom of night...\n\n     As they finish, The Postman and Ford pass by. The\n     Recruits salute. Shaking his head, The Postman's about to\n     salute back when he spots Old George. George has a faded\n     purple \"AIRBORNE\" tattoo on his arm and a twinkle in his\n     eye. There's an old crow on his shoulder.\n\n                             THE POSTMAN\n               How old are you?\n\n                             OLD GEORGE\n               Seventy-five, sir.\n\n     The Postman looks over at Ford, who shrugs.\n\n                               THE POSTMAN\n               Can you ride?\n\n                            OLD GEORGE\n               Nope. Can't walk too good,\n               either.\n\n                             THE POSTMAN\n               Why are you here?\n\n                               OLD GEORGE\n               I know stuff.\n\n     The Postman looks at Ford again.   Then:\n\n                                                   (CONTINUED)\n\n                                                               89.\n\n96   CONTINUED:                                                      96\n\n                                THE POSTMAN\n                         (re: tattoo)\n                  When did you get that?\n\n                                 OLD GEORGE\n                  1970. A girl with eyes as big as\n                  saucers did me in a little town\n                  called Saigon.\n\n\n97   EXT. RV CAMP - AIRSTREAM - SUNSET                               97\n\n     Carriers move items out of the trailer. The camp is\n     buzzing as usual. The Postman looks on -- sees Abby\n     passing by.\n\n                                THE POSTMAN\n                  Abby --\n\n                                ABBY\n                  Yes?\n\n     He's got her attention, just doesn't know what to do with\n     it.\n\n                                THE POSTMAN\n                  Ford wants me to have his trailer.\n                  Said it's the best one.\n\n                                ABBY\n                  I'm on the other side of town.\n\n                                THE POSTMAN\n                  I got plenty of room here.\n\n     She shakes her head, and then walks away. The Postman\n     watches her disappear into the bustle of the camp.\n\n                                THE POSTMAN\n                  So much for the uniform theory.\n\n\n98   EXT. HOLNIST WINTER CAMP (NORTHERN CALIFORNIA) - SUNSET         98\n\n     The same sun sets on the Holnist camp.\n\n\n99   INT. BETHLEHEM'S TENT - SUNSET                                  99\n\n     Bethlehem once again at his easel with palette in hand.\n     He's trying another style -- Impressionism -- and it's\n     worse than the last. He looks over as Getty and Gibbs\n     approach with a PRISONER.\n\n                                                       (CONTINUED)\n\n                                                              90.\n\n99   CONTINUED:                                                     99\n\n                                BETHLEHEM\n                  What do you think, Lieutenant?\n\n                                GIBBS\n                  Can't tell what it is if you stand\n                  too close. The colors all kinda\n                  run together, don't they?\n\n                                BETHLEHEM\n                  Yes...\n\n     Bethlehem looks away from his painting to see Gibbs and\n     Getty flanking a scared, blue-clad mail carrier. For an\n     instant, mistakes him for:\n\n                                BETHLEHEM\n                  Well, if it isn't our old friend\n                  the U.P.S. man.\n\n                                GIBBS\n                  We captured him on the Oregon\n                  border.\n\n     Realizing, Bethlehem turns the face from side-to-side.\n\n                                BETHLEHEM\n                  Who the hell are you?\n\n                                CARRIER (PRISONER)\n                  Carrier Twelve. United States,\n                  um, Postal Service.\n\n     Getty sets some of the Carrier's anti-Holnist propaganda\n     onto Bethlehem's field table. Bethlehem picks it up.\n\n     It's hard to say what he's thinking.      Finally:\n\n                                BETHLEHEM\n                  I want the camp struck at dawn.\n                  We're moving north.\n\n                                GIBBS\n                  Yes, sir.\n\n     Bethlehem looks back to Carrier Twelve.\n\n                                BETHLEHEM\n                         (chilling)\n                  You spelled tyranny wrong.\n\n                                                              91.\n\n100   EXT. RV CAMP - DAWN                                           100\n\n      Ten letter carriers are on horseback. Among them, Red and\n      Ponytail. Ford and The Postman are also on horses. Each\n      rider salutes The Postman, then gets a sheaf of anti-\n      Holnist propaganda from Ford.\n\n                              THE POSTMAN\n                I wish they'd stop saluting.\n\n      It's annoying him. As Chubby rides up. The Postman\n      catches his right wrist as he attempts to salute. So\n      Chubby salutes with the left hand instead. As they line\n      up:\n\n                              THE POSTMAN\n                Just stay safe and remember. The\n                mailman's more important than the\n                mail.\n\n                              CHUBBY\n                Boy, he's smart.\n\n      The sun just peeks up over the horizon. At that signal,\n      the carriers thunder off, the ground trembling under them.\n      The look on their faces. The glory of it all. They're\n      alive! The Postman hesitates, watches after them a\n      moment.\n\n                                 THE POSTMAN\n                What the hell?\n\n      Urging his horse forward, he rides after them. With them.\n      And then, like an exploding firework, each postman shoots\n      off in a separate direction. Headed for all points of the\n      compass and some in between.\n\n\n101   EXT. OREGON HAMLET - DAY                                      101\n\n      The Postman looks down on the gathered crowd from his\n      horse and smiles.\n\n                              THE POSTMAN\n                For President Starkey and the\n                First Congress of the Restored\n                United States, I officially\n                declare Postal Station 10...\n                What's the name of this town?\n\n                              YOUNG LEADER\n                We never named it.\n\n                              THE POSTMAN\n                       (thinks; smiles)\n                I officially declare Postal\n                Station 10 in Elvis, Oregon, open\n                for business!\n\n                                                              92.\n\n102   EXT. TOWN (SOMEWHERE IN OREGON) - DAY                         102\n\n      An eye-blink of a town. Ponytail stands on a crate\n      reading names and handing letters to the grateful people\n      massed around her.\n\n\n103   EXT. TOWN (IDAHO BORDER) - DAY                                103\n\n      Red and Chubby finish mail call, exchange an amazed look\n      as they're offered a platter of food.\n\n\n104   EXT. HIGHWAY - NIGHT                                          104\n\n      The moon hangs low over an interstate. A rider is\n      silhouetted by the silvery orb, looking like some post-\n      apocalyptic Don Quixote. It's The Postman.\n\n\n105   EXT. FARMHOUSE/COUNTRY ROAD - DAY                             105\n\n      Seen FROM the porch, a rider gallops hard on the road\n      beyond.\n\n      A LITTLE BOY comes rushing out, letter in hand. The boy\n      pulls up short; realizes the rider is already too far\n      gone. The boy's shoulders sag; he's crushed.\n\n                                LITTLE BOY\n                I missed him.\n\n      It's an almost psychic moment as the rider reins up in the\n      distance and turns back around. A frozen beat and he\n      starts galloping back down the road.\n\n      Fearless, the boy holds out the letter. The rider closes;\n      it's The Postman. The boy stretches out as far as he can.\n      Without breaking stride, The Postman leans out of the\n      saddle, snatches the letter as he passes.\n\n      The boy watches after him -- knows what he's going to be\n      when he grows up.\n\n\n106   EXT. PINE VIEW GATES - DAY                                    106\n\n      Sheriff Briscoe huffs and puffs his big frame up the\n      ladder and onto the top of the palisade.\n\n                              BRISCOE\n                Phil, this better not be another\n                of your U.F.O.'s.\n\n      He looks where the sentry points. The Postman waits at\n      the gate, behind him on horseback: Ford and Abby.\n\n                                                    (CONTINUED)\n\n                                                                93.\n\n106   CONTINUED:                                                      106\n\n                                  THE POSTMAN\n                   I'm back!   And I got mail.\n\n                                 BRISCOE\n                          (amazed)\n                   I'll be damned.\n\n\n107   EXT. PINE VIEW STREETS - DAY                                    107\n\n      The Postman rides with Briscoe, hurrying to stay alongside\n      him. Half the town jogs along behind them.\n\n                                 FORD\n                   Bethlehem is offering a 1000\n                   pounds of gold to whoever brings\n                   you in. Dead or alive.\n\n                                 THE POSTMAN\n                   Thank God it wasn't a carton of\n                   cigarettes.\n\n                                 BRISCOE\n                   I'd have shot you myself.\n\n\n108   EXT. PINE VIEW STREETS - NIGHT                                  108\n\n      Pine View is throwing a party. It's in full swing. A\n      couple of guitars. A banjo and a trombone. Everyone\n      dances.\n\n      The Postman walks with Briscoe, sees Mrs. March as her\n      letter is read to her. Catches a glimpse of Abby dancing\n      with Ford. He seems, for the first time, truly happy.\n      For that matter, so does Briscoe.\n\n                                 BRISCOE\n                   Things are getting better.\n                   Getting better all the time.\n                          (a beat)\n                   I don't know who you are, but I do\n                   know I was wrong about you.\n\n      The Postman smiles, reaches in his bag for an envelope.\n\n                                 THE POSTMAN\n                   Got a letter for you, Sheriff.\n\n      Briscoe turns it over in his hands, looks up in wonder.\n\n                                 BRISCOE\n                   It's from my sister. I thought\n                   she was dead.\n\n                                                        (CONTINUED)\n\n                                                               94.\n\n108   CONTINUED:                                                     108\n\n                                 THE POSTMAN\n                   You thought wrong.\n\n      Briscoe has tears in his eyes.    The Postman continues on,\n      embarrassed but affected.\n\n\n      DANCE\n\n      The Postman taps Ford's shoulder, wants to cut in on him\n      and Abby. Ford steps aside. A beat before Abby decides\n      it's okay. They begin. Her eyes are on her feet, careful\n      that she doesn't take a misstep. But his eyes are on her.\n      And over it all, BLEEDING IN, the sound of HOOF BEATS.\n\n\n109   EXT. LONELY ROAD (SOUTHERN OREGON) - NIGHT                     109\n\n      A mail carrier, Red, rides like the devil himself was in\n      pursuit. Almost. It's Getty and three Holnists.\n\n      INTERCUT WITH:\n\n\n      DANCE\n\n      They whirl as the tempo picks up. The Postman pulls Abby\n      in closer. Her eyes now move up to his.\n\n\n      ROAD\n\n      They're closing in on the terrified Red.\n\n\n      DANCE\n\n      Abby and The Postman.    The chemistry is undeniable.\n\n\n      ROAD\n\n      RIFLES CRACK. SHOT in the back, Red throws back his arms.\n      Letters flutter from the mail bag over his shoulder; he\n      seems to glide along that way forever.\n\n\n      DANCE\n\n      The Postman looks at Abby; she's so beautiful.    Like only\n      a pregnant woman can be.\n\n                                                       (CONTINUED)\n\n                                                                  95.\n\n109   CONTINUED:    (2)                                                 109\n\n                                 THE POSTMAN\n                   Tell me about the baby, Abby.   I\n                   want to know.\n\n      Abby snaps out of the dream she's in. This isn't right.\n      Breaking away, she heads off. As he watches her go:\n\n\n      ROAD\n\n      Red falls from his horse.    One of the soldiers scoops up\n      his mailbag.\n\n                                                        CUT TO:\n\n\n110   INT. COMMAND TENT (SOUTHERN OREGON) - NIGHT                       110\n\n      By lantern, Bethlehem and Getty watch as Gibbs sorts\n      through the contents of the confiscated mailbag.\n\n                                 GIBBS\n                   Births and deaths, the weather,\n                   gossip. There's nothing here.\n\n                                 BETHLEHEM\n                   Nothing? Everything is here.    Am\n                   I the only one who sees that?\n                          (to Gibbs)\n                   Get out!\n\n      Gibbs hurries away, leaving Bethlehem and Getty alone.\n\n                                 BETHLEHEM\n                   Give the people back their hope\n                   and their dreams won't be far\n                   behind.\n\n      Bethlehem sees Getty waiting.\n\n                                 BETHLEHEM\n                   What is it, Getty?\n\n      Getty hands Bethlehem a sheet of paper -- something Gibbs\n      missed. It's a propaganda sheet featuring a caricature of\n      The Postman leading a few carriers against Bethlehem and\n      his army -- represented as Hitler and the Nazis. The\n      caption underneath reads: \"Ride Against the Holnist\n      Tide!\"\n\n                                                        (CONTINUED)\n\n                                                                96.\n\n110   CONTINUED:                                                      110\n\n                                 BETHLEHEM\n                          (crumpling the paper)\n                   A military man, especially a\n                   commander, should keep a journal.\n                   After he's gone, it's the only\n                   real defense against the slander\n                   that arises.\n\n\n111   INT. OLD GEORGE'S TRAILER - NIGHT                               111\n\n      Old George sits hunched over a home-made shortwave radio\n      with a joint in his mouth. The Postman sits beside him,\n      listening as STATIC pours from an old car SPEAKER.\n\n                                 THE POSTMAN\n                   Who do you talk to?\n\n                                 OLD GEORGE\n                   Not a soul in seven years of\n                   trying. But I will.\n\n      The Postman steps to a telescope pointing up through a\n      hole in the trailer ceiling.\n\n                                 OLD GEORGE\n                   Go ahead. Take a look.\n                          (offering joint)\n                   Want some?\n\n                                 THE POSTMAN\n                   No. No thanks. Hey, don't let\n                   the kids see that.\n\n      George nods and goes on playing with the dials --\n      searching for a voice in the void.\n\n      The Postman focuses on the moon.\n\n                                 OLD GEORGE\n                   I was an aerospace engineer. I\n                   helped design the Galileo space\n                   station.\n                          (scanning sky)\n                   I dream it's orbiting Earth\n                   forever. With a dozen human\n                   skeletons all grinning at each\n                   other. Laughing at us down here.\n\n      There's an urgent KNOCKING on the trailer door.    Ford\n      appears.\n\n                                 THE POSTMAN\n                   What is it?\n\n                                                       (CONTINUED)\n\n                                                            97.\n\n111   CONTINUED:                                                   111\n\n                                  FORD\n                   It's Red.   He's overdue.\n\n                                 THE POSTMAN\n                   That makes five. All on Southern\n                   routes.\n\n\n112   EXT. TRUCK STOP - DAY                                        112\n\n      Five dead mail carriers have been laid out on the asphalt.\n      Bethlehem walks the line, looking for his elusive arch-\n      enemy.\n\n                                 BETHLEHEM\n                   No.  No. Not him. No.\n                          (looks to soldiers)\n                   Children. I want a man and you\n                   bring me children!\n\n\n113   EXT. OREGON ROAD - DAY                                       113\n\n      A beautiful day. Ponytail rounds a bend at a lope -- and\n      then -- her eyes widen in terror. She jerks the reins;\n      the horse rears in protest.\n\n      Ahead: the truck stop. The five mail carriers hang\n      upside down from the roof's overhang. A macabre sight.\n\n\n      POV THROUGH RIFLE SCOPE\n\n      SIGHTING ON Ponytail. A hand comes INTO FRAME and brings\n      the rifle barrel down. It's --\n\n\n      GIBBS AND HOLNIST SHARPSHOOTER\n\n                                 GIBBS\n                   Not yet. General wants the\n                   message to get back.\n\n\n114   EXT. RV. CAMP - NIGHT                                        114\n\n      PAN UP FROM The Postman's dusty boots TO his grimly\n      determined face as he strides through camp and stops at\n      Old George's trailer.\n\n      He moves OUT OF FRAME, revealing -- Abby and Ponytail in\n      the b.g.\n\n                                                                98.\n\n115   INT. OLD GEORGE'S TRAILER - NIGHT                               115\n\n      As usual, Old George is hunkered down before his short\n      wave. He looks as the door opens and The Postman enters.\n\n                                 THE POSTMAN\n                   Tell me about the other stuff you\n                   know...\n\n      George crosses the trailer, opens a cabinet. Inside:\n      twenty odd guns plus the parts for several more. The CROW\n      CAWS.\n\n\n116   EXT. ELVIS, OREGON - DAY                                        116\n\n      Quiet. An old flag ruffles outside the post office -- the\n      only new structure in town. Old George sweeps the porch\n      as a patrol of ten Holnist soldiers ride into town.\n      George makes no move to flee as they near. As they rein\n      up across from him he just smiles and continues sweeping.\n\n      Sensing it, the Holnist officer looks up. There, on the\n      roof, stands The Postman. Ford and Briscoe flank him --\n      along with twenty mailmen and locals, armed with guns,\n      bows and rocks.\n\n      As the soldiers raise their rifles, the roofies OPEN FIRE.\n      George whips up a sawed-off SHOTGUN. BOOM! Caught in the\n      storm, the ten soldiers go down.\n\n      Grim, The Postman looks to Ford as the locals cheer.\n      George resumes sweeping. The mailmen climb down to strip\n      the weapons off the dead.\n\n                                 THE POSTMAN\n                   Ford, I want you to get rid of the\n                   bodies. I don't want these people\n                   blamed for what we did.\n\n      Ford nods.\n\n\n117   EXT. HOLNIST ARMY CAMP - NIGHT                                  117\n\n      Two sentries guard the east. They peer into the gloom at\n      the sound of a WAGON APPROACHING. It sounds like it's\n      coming fast.\n\n                                  SENTRY\n                   Halt!   Identify yourself!\n\n                                                        (CONTINUED)\n\n                                                               99.\n\n117   CONTINUED:                                                     117\n\n      WAGON\n\n      tearing along. Ford at the reins, urging the horses to\n      all possible speed.  Then he stands, leaps to the ground.\n\n\n      SENTRIES\n\n      They raise their rifles as the riderless wagon looms out\n      of the night. They each get off a SHOT before being\n      forced to dive out of the way. The wagon continues on,\n      down to...\n\n\n      HOLNIST CAMP\n\n      A soldier finally grabs hold of one of the halters and\n      brings the wagon to a stop. Half-dressed, Bethlehem steps\n      up. A tarp covers the back upon which is written...\n\n                                  BETHLEHEM\n                          (reading)\n                   Postage due...\n\n      Bethlehem yanks away the tarp to reveal the 10 dead\n      Holnist soldiers. The men around Bethlehem exchange\n      looks, can't believe it. Bethlehem bellows in rage.\n\n\n118   EXT. WOODS - NIGHT                                             118\n\n      Ford, hidden in the woods, smiles at the sound.\n\n\n119   EXT. HOLNIST CAMP - NIGHT                                      119\n\n      Bethlehem steps forward and shouts his challenge into the\n      night.\n\n                                 BETHLEHEM\n                   You want a war? I'll give you a\n                   war. I was born for it!\n\n\n120   EXT. WOODS - NIGHT                                             120\n\n      Bethlehem's words reach Ford, his smile fades. He's just\n      a scared boy. He kicks his horse into a gallop and rides\n      away.\n\n                                                     CUT TO:\n\n                                                            100.\n\n121   EXT. SMALL AIRFIELD - DAY                                    121\n\n      In the fog, the sound of hollow HOOF BEATS. The Postman\n      rides past the shapes of airplanes. Standing silent.\n      Forever grounded. The ghosts of the past.\n\n\n122   EXT. RV CAMP - DAY                                           122\n\n      Ford is swearing in four new recruits.\n\n\n      ON FORD AND RECRUITS\n\n      As they repeat after him we realize they've changed the\n      oath a bit.\n\n                              FORD/RECRUITS\n                Neither snow, nor heat, nor gloom\n                of night. Through bandit's hell,\n                through fire fight. Through flood\n                and plague we cannot fail. No\n                Holnist trash will stop the mail.\n\n\n      THE POSTMAN\n\n      riding his weary mount into town, saddlebags bulging with\n      mail. He pauses by the new recruits long enough to hear\n      the words they're saying.\n\n      As he dismounts, a fresh-faced carrier takes the bridle.\n      The Postman's well past the point of fatigue. He's living\n      on pure adrenaline.\n\n                              THE POSTMAN\n                Get this mail sorted. Bring me a\n                fresh horse. Something to eat.\n\n      As fresh-face starts away, The Postman calls after him.\n\n                              THE POSTMAN\n                And all the mail going South!\n\n      The Postman watches as Ford shakes the hands of the new\n      recruits.\n\n      The Postman reaches for his canteen. Empty. Damn. A tin\n      cup filled with water appears from nowhere. Abby. The\n      Postman takes it, too tired to acknowledge the gesture.\n\n                              THE POSTMAN\n                They changed the oath.\n\n                                                    (CONTINUED)\n\n                                                                101.\n\n122   CONTINUED:                                                       122\n\n                                  ABBY\n                   Ford's idea.\n\n                                 THE POSTMAN\n                   Figures.\n                          (scoffs)\n                   They don't think to ask who\n                   they're replacing. Or why.\n\n      He drains the cup and hands it back to her.      Just then,\n      one of the new recruits, LUKE, steps over.\n\n                                 LUKE\n                   Sir? It'd be an honor if I could\n                   shake your hand.\n\n      A farmboy-type, Luke looks like a younger version of\n      Woody. The Postman sees this, is lost in reverie. Luke\n      still holds his hand out.\n\n                                  LUKE\n                   Sir?\n\n                                 THE POSTMAN\n                   You look like... Do I know you?\n\n                                  LUKE\n                   No, sir.\n\n                                 THE POSTMAN\n                   Well, good luck to you.\n\n      Nodding in awe, Luke heads off.\n\n                                  THE POSTMAN\n                   Nice kid.   Probably be dead in a\n                   week.\n\n                                 ABBY\n                          (ignores it)\n                   You're exhausted. You need rest.\n                   There's food in the trailer --\n\n      Ponytail rides by; two sacks of mail hang from her saddle\n      pommel. The Postman grabs her horse's halter, stops her.\n\n                                 THE POSTMAN\n                   Where are you going?\n\n                                 PONYTAIL\n                   Route twenty-two. I'm already an\n                   hour late.\n\n                                                        (CONTINUED)\n\n                                                               102.\n\n122   CONTINUED:    (2)                                               122\n\n                                 THE POSTMAN\n                   You're grounded. Get off the\n                   horse. You know the rule.\n\n                                 PONYTAIL\n                   What rule?\n\n                                 THE POSTMAN\n                   Twenty-two's too far south.\n\n                                 PONYTAIL\n                   But they're waiting on their mail\n                   down there.\n\n                                 THE POSTMAN\n                   Get off the goddamn horse.\n\n      Shocked, she does. At the same time, fresh-face comes up\n      leading a second horse laden with mail.\n\n                                  THE POSTMAN\n                          (re: Ponytail's\n                           horse)\n                   Tie him off to this one.\n\n      Fresh-face goes about tying the second horse to the first.\n\n                                 ABBY\n                   You can't keep doing this.\n\n                                 THE POSTMAN\n                   Doing what?\n\n                                  ABBY\n                   Riding all the routes.   You're not\n                   saving anyone.\n\n      The Postman climbs on Ponytail's horse, looks at Abby.\n\n                                 THE POSTMAN\n                   Did I ever tell you how I got to\n                   be a postman, Abby?\n                          (doesn't give\n                           her time to answer)\n                   I don't know if you'd laugh or\n                   cry.\n\n      The Postman digs in his heels. The horse gallops away,\n      the second one following behind.\n\n                                                               103.\n\n123   EXT. ELVIS, OREGON - CLOSE ON BLOODIED POSTAL CARRIER -         123\n      NIGHT\n\n      A crowd of townsfolk are visible in deep b.g.   Beyond\n      them, the town of Elvis burns to the ground.\n\n      The CAMERA CIRCLES AROUND the BLOODIED CARRIER until we're\n      looking OVER his shoulder at a firing squad led by Colonel\n      Getty and Lieutenant Gibbs. Bethlehem watches.\n\n                              GIBBS\n                Ready!\n\n      The only building not on fire is the post office. A\n      SOLDIER rides up, carrying a torch, meaning to burn it.\n\n                              SOLDIER\n                The post office, General?\n\n                              BETHLEHEM\n                No. Let it stand. All by itself.\n                So it can remind them what it cost\n                them.\n\n                              GIBBS\n                Aim!\n\n      Rifles are aimed.\n\n                              GIBBS\n                Fire!\n\n      Shock and dismay from the townsfolk as SHOTS RING OUT.\n\n\n      CLOSE ON BLOODY CARRIER'S FACE\n\n      as he realizes he's still standing.\n\n      PULL BACK to reveal nine bodies lying on the ground.     Only\n      the Bloodied Carrier is still standing.\n\n      Bethlehem points at the Bloodied Carrier, crooks a finger\n      for him. He staggers up. Bethlehem smiles.\n\n                              BETHLEHEM\n                You think you can ride?\n                       (as the Carrier\n                        nods)\n                Then today's your lucky day.\n\n\n124   INT. RV PARK - AIRSTREAM - DAY                                  124\n\n      Abby tends to the Bloodied Carrier.   He tries to salute as\n      The Postman enters the trailer.\n\n                                                      (CONTINUED)\n\n                                                                104.\n\n124   CONTINUED:                                                       124\n\n      Ford and Chubby watch and wait as The Postman goes to the\n      boy's side.\n\n                                 BLOODIED CARRIER\n                   Bethlehem says...\n\n      The Postman motions it's okay as the Carrier struggles.\n\n                                 BLOODIED CARRIER\n                   ... he's... headed north. He's\n                   gonna kill ten people in every\n                   town. Then burn it to the ground.\n                   For what you did...\n\n      The Postman is puzzled.    But Ford knows what and why.\n\n                                 BLOODIED CARRIER\n                   He said to tell you Pine View's on\n                   his way. He said he'd wait there,\n                   but not for long.\n                          (breaking down)\n                   I was so scared, sir... I thought\n                   they were going to kill me, too...\n                   I wish they would have...\n\n\n125   EXT. RISE ABOVE PINE VIEW - DAY                                  125\n\n      The Postman poised on a rise that affords a view of the\n      gruesome spectacle below.\n\n\n      POSTMAN'S POV\n\n      Pine View in flames. The big John Deere gun has blown\n      several gaps into the palisade. Bethlehem watches as his\n      army sacks the town. The people have been rounded up.\n      The selection of the ten has begun.\n\n\n126   EXT. RISE ABOVE PINE VIEW - DAY                                  126\n\n      The Postman wheels his horse around. But Ford, Ponytail,\n      Chubby and Luke are standing in his way.\n\n                                 FORD\n                   What are you going to do?\n\n                                 THE POSTMAN\n                   I'm going to stop this.\n\n                                 FORD\n                   You can't.\n\n                                                        (CONTINUED)\n\n                                                                 105.\n\n126   CONTINUED:                                                        126\n\n                                 THE POSTMAN\n                   Get out of my way, Ford. All of\n                   you.\n\n                                 FORD\n                          (shaking his head)\n                   They'll kill you.\n\n      The Postman starts to ride through them.      Luke, Chubby and\n      Ponytail move their horses to block.\n\n      Ford maneuvers his horse in close and grabs The Postman's\n      harness.\n\n                                  THE POSTMAN\n                   Goddamnit --\n\n      The Postman jumps off his horse. Ford tackles him. The\n      Postman shoves him away, continues on. Luke and Chubby\n      pounce on him. With Ford's help, they hold him down.\n\n                                 FORD\n                   You can't help them!\n\n                                 THE POSTMAN\n                   There's still time, Ford!\n\n      The Postman struggles.      They're genuinely having trouble\n      holding him down.\n\n                                 PONYTAIL\n                          (re: The Postman)\n                   You're hurting him.\n\n      But there's no let-up.\n\n                                 FORD\n                   No, this is all my doing.    I went\n                   against your orders.\n\n      There's a moment of shocked surprise.\n\n                                 FORD\n                   The Holnists we killed. You told\n                   me to bury them. But I didn't. I\n                   sent Bethlehem the bodies.\n\n                                  THE POSTMAN\n                   Why?\n\n                                 FORD\n                   Because Bethlehem has to know that\n                   we're not going to stop.\n\n                                                         (CONTINUED)\n\n                                                                106.\n\n126   CONTINUED:    (2)                                                126\n\n                                 THE POSTMAN\n                   God damn you, Ford. Those people\n                   down there are dying because of\n                   us. Because of what we did.\n\n                                 FORD\n                   Bullshit. They're dying because\n                   of Bethlehem. They're dying\n                   because this is a shitty world.\n                   And if we're ever going to change\n                   it, then somebody might have to\n                   die. If I could make it be me\n                   down there I would. But I can't.\n\n      A terrible SCREAM gives them all pause.\n\n\n127   EXT. PINE VIEW - DAY                                             127\n\n      Down below -- Holnist soldiers hold back a screaming\n      mother as her 10-year-old boy is pulled into the line.\n\n      Sheriff Briscoe is among the ten, he puts his hand on the\n      boy's shoulder -- the picture of grace under pressure.\n\n\n128   EXT. RISE ABOVE PINE VIEW - ON POSTMAN AND CARRIERS              128\n\n                                 THE POSTMAN\n                   My God, what have I done?\n                          (beat)\n                   We don't even know their names...\n\n\n129   EXT. PINE VIEW - CLOSE ON LITTLE BOY - DAY                       129\n\n      His eyes wide and fearful.    Like a kitten's.\n\n\n130   EXT. RISE ABOVE PINE VIEW - DAY                                  130\n\n                                 PONYTAIL\n                          (holding back\n                           the tears)\n                   We know their names. The little\n                   one's my brother. His name is\n                   Billy.\n\n      A moment of stunned silence.\n\n                                 PONYTAIL\n                   What Ford did was wrong. But it\n                   doesn't change anything for any of\n                   us. Does it?\n\n                                                        (CONTINUED)\n\n                                                                 107.\n\n130   CONTINUED:                                                        130\n\n      She looks to the other carriers -- it's written all over\n      their faces -- they stand with Ponytail and Ford.\n\n\n131   EXT. PINE VIEW - DAY                                              131\n\n      Bethlehem looks the line-up over. The firing squad stands\n      at the ready. Bethlehem looks to the trees -- feeling\n      something.\n\n                                 BETHLEHEM\n                          (to Getty)\n                   He's out there somewhere.\n                   Watching. I can feel it.\n\n      Briscoe follows his gaze. He doesn't see anything, but\n      maybe gets the same feeling. Bethlehem looks to Briscoe.\n\n                                 BETHLEHEM\n                   You feel it too, don't you?\n                   Didn't have to end like this,\n                   Sheriff. He knew where I'd be if\n                   he wanted to face me like a man.\n                   Instead, he's hiding like a\n                   rabbit. So much for your Postman.\n\n                                    GIBBS\n                   Ready!    Aim!\n\n      Rifles are raised. Briscoe seems to grow as he throws his\n      shoulders back and shouts...\n\n                                 BRISCOE\n                   Ride, Postman! Ride! You hear\n                   me? I said ride!\n\n\n132   EXT. RISE ABOVE PINE VIEW - DAY                                   132\n\n      The WORDS ECHO.       Nothing The Postman can do, but watch.\n\n\n133   EXT. PINE VIEW - DAY                                              133\n\n      Bethlehem's eyes go wild --\n\n                                    BETHLEHEM\n                   Fire!\n\n      The RIFLES BARK.      Everyone falls dead.\n\n\n134   EXT. RISE ABOVE PINE VIEW - DAY                                   134\n\n      Something in The Postman breaks. He just lies there.       The\n      witnesses move back, taking The Postman with them.\n\n                                                                108.\n\n135   EXT. PINE VIEW - DAY                                             135\n\n      Sheriff Briscoe lies dead.   The letter from his sister\n      blows from his hand.\n\n                                                     CUT TO:\n\n\n136   INT. AIRSTREAM - NIGHT                                           136\n\n      The Postman folds a letter, shoves it into an envelope.\n      He writes \"Bethlehem\" across the front, starts to write a\n      second letter. The door opens and Abby enters.\n\n                              ABBY\n                Ford thinks you're going to do\n                something.\n\n                               THE POSTMAN\n                I am.\n\n      The Postman watches as, outside, the mail carriers begin\n      to assemble.\n\n                              THE POSTMAN\n                If I don't, those kids are going\n                to keep on getting themselves\n                killed.\n\n                              ABBY\n                Ford doesn't know what it means to\n                be a kid. He doesn't have your\n                memories. None of them do. All\n                they've got is the lousy world we\n                gave them. And this is the only\n                decent thing in it.\n\n                               THE POSTMAN\n                What? Being a postman? It's all\n                bullshit, Abby. All of it.\n                       (beat)\n                I took this uniform off a skeleton\n                to stay warm. I made up the rest\n                to stay fed. There is no restored\n                United States.\n\n                              ABBY\n                I knew it was something like that.\n\n      The Postman fingers the brim of the cap, softens.\n\n                                                     (CONTINUED)\n\n                                                               109.\n\n136   CONTINUED:                                                      136\n\n                                 THE POSTMAN\n                   Weird thing is, being a Postman\n                   was almost the best thing that\n                   ever happened to me...\n                          (re: red ribbon)\n                   Remember this? You left it behind\n                   that night.\n\n                                   ABBY\n                   I remember...\n\n                                 THE POSTMAN\n                   I always liked to think you left\n                   it on purpose. But maybe you just\n                   forgot it.\n\n      Abby doesn't answer.    She leaves instead.\n\n\n137   EXT. R.V. CAMP - NIGHT                                          137\n\n      Twelve mail carriers, including Ford, Ponytail, Chubby,\n      Luke and Old George, wait as The Postman steps up before\n      them. Abby's off to the side.\n\n                                 THE POSTMAN\n                   Is this everybody?\n\n                                 FORD\n                   The rest are on the overdue list.\n\n                                 THE POSTMAN\n                   This is everybody.\n                          (for all)\n                   Got a letter from President\n                   Starkey.\n\n      An excited murmur among the carriers. Only Ford eyes The\n      Postman suspiciously. The Postman reads:\n\n                                 THE POSTMAN\n                   'Greetings all carriers.'\n\n                                 CARRIERS\n                   Greetings, President Starkey!\n\n                                 THE POSTMAN\n                          (reading)\n                   'I've been in contact with The\n                   Postman. I've received all the\n                   reports. I'm proud of you all.'\n\n      He looks at them, doesn't need to read what's in his\n      heart.\n\n                                                       (CONTINUED)\n\n                                                               110.\n\n137   CONTINUED:                                                      137\n\n                                 THE POSTMAN\n                   In dark days, in a weary world,\n                   you gave everything and asked for\n                   nothing. You beat back despair\n                   and replaced it with hope and for\n                   that your country can never repay\n                   you. But the price is too high.\n                   I won't see anymore of my bravest\n                   die. It is my duty to hereby\n                   disband the Postal Service of the\n                   restored United States. You are\n                   to burn your uniforms and The\n                   Postman is to return to\n                   Minneapolis at once. Thank you\n                   and that is all.\n\n      A hushed silence. The Postman walks away. The carriers\n      exchange tired, defeated looks. Abby just sighs, knows\n      he's not necessarily wrong.\n\n      Ford catches up with The Postman.    He stares at The\n      Postman; The Postman stares back.\n\n                                  FORD\n                           (low; fierce)\n                   The President never wrote that\n                   letter.\n\n                                 THE POSTMAN\n                   If he could've that's what he\n                   would have said.\n\n      Ford gestures to the second letter.\n\n                                 FORD\n                   Who's the other letter to?\n\n                                 THE POSTMAN\n                   Bethlehem. I'm taking it to him\n                   in the morning.\n\n                                 FORD\n                   What does it say?\n\n                                 THE POSTMAN\n                   Mail's private. You know that.\n\n                                 FORD\n                   What does it say?\n\n                                 THE POSTMAN\n                          (stops; turns)\n                   It says it's over. It says we\n                   quit.\n\n                                                       (CONTINUED)\n\n                                                                111.\n\n137   CONTINUED:    (2)                                                137\n\n                                 FORD\n                   It says you quit. What about the\n                   oath?\n\n                                 THE POSTMAN\n                   Tell me something, Ford. How much\n                   mail can a dead postman deliver?\n                   It's over.\n\n      The Postman starts to walk away again.\n\n                                 FORD\n                   Then I'll take it.\n\n                                 THE POSTMAN\n                   I can't trust you.\n\n      Ford gathers courage and confronts The Postman.\n\n                                 FORD\n                   If this is the end. If this is\n                   the last piece of mail that ever\n                   gets delivered. I'll take it.\n\n                                 THE POSTMAN\n                   Whoever takes this letter probably\n                   dies for it.\n\n      Ford thrusts out his hand.\n\n                                 FORD\n                   I'm still a postman. You owe it\n                   to me... I owe it to me.\n\n      The Postman hesitates, studies the intense young man.\n      Gives him the letter.\n\n\n138   EXT. R.V. CAMP - STABLE AREA - DAY                               138\n\n      The Postman is packing bags onto a horse as Abby\n      approaches.\n\n                                 THE POSTMAN\n                   I'm going to St. Rose, Abby. And\n                   I'm taking you with me. I know\n                   you don't want to hear it, but\n                   that's my child inside you. I\n                   want to see it born somewhere\n                   safe. I have a right to that,\n                   Abby. Whether you like it or not.\n\n      Abby walks away. The Postman rests his head on his pack\n      for a moment. Heavy.\n\n                                                        (CONTINUED)\n\n                                                                112.\n\n138   CONTINUED:                                                       138\n\n      The CLICK of a GUN causes The Postman to lift his head and\n      see Luke standing there.\n\n                                 THE POSTMAN\n                   Thought I recognized you.\n\n                                 LUKE\n                   General Bethlehem said...\n                          (raises the pistol)\n                   ... You should be on your knees\n                   when I do it.\n\n                                 THE POSTMAN\n                   I don't give a damn what that\n                   asshole said.\n\n                                 LUKE\n                   The general is a great man.\n\n                                 THE POSTMAN\n                   The general is a fucking lunatic.\n\n      The Postman steps forward. Stops when the barrel of the\n      pistol is right against his own chest.\n\n                                 THE POSTMAN\n                   You don't own a thought in that\n                   goddamn head of yours, do you?\n                          (a beat)\n                   You want to see a man?\n\n      The Postman turns to watch as Ford starts out of camp.\n\n                                   THE POSTMAN\n                   That's a man.\n\n      The Postman turns, sees Luke's face fraught with confusion\n      and emotion.\n\n                                 THE POSTMAN\n                   You don't understand, do you? You\n                   never will until you can think for\n                   yourself and be willing to pay the\n                   price for it.\n\n      Luke stares back into The Postman's eyes.      A frozen beat.\n\n                                   THE POSTMAN\n                   You ready?\n\n                                   ABBY (O.S.)\n                   Yes.\n\n                                                        (CONTINUED)\n\n                                                               113.\n\n138   CONTINUED:    (2)                                               138\n\n      Abby sits on her horse. She's witness to it all. Luke is\n      confused and ashamed. The Postman mounts his horse and\n      moves to Abby's side.\n\n                                 THE POSTMAN\n                   You're a better man than\n                   Bethlehem, Luke. I've seen it.\n\n\n139   EXT. RIDGE - R.V. CAMP - DAY                                    139\n\n      Some carriers drop their uniforms into a bonfire.\n\n      The Postman and Abby ride up on the ridge above the RV\n      camp. They pause to look back one last time. Across the\n      way, on the other side, Ford is doing the same thing. As\n      though he senses it, Ford stops and looks back.\n\n      Ford raises his hand, salutes. Slowly, The Postman brings\n      up his own hand. But he doesn't salute. He waves. Good-\n      bye. As Ford turns away, so does The Postman.\n\n\n      ON CHUBBY, PONYTAIL AND CARRIER NAMED DREW\n\n      watching as The Postman and Abby disappear from sight.\n\n                                 CHUBBY\n                   Guess Minneapolis is that way.\n\n\n140   EXT. INTERSTATE - DAY                                           140\n\n      A sign prohibits pedestrians, horses and bicycles. The\n      Postman and Abby ride by. The Postman no longer wears his\n      uniform. Their gear is packed behind their saddles.\n\n      As a family of transients begin to rise from where they're\n      camped in the breakdown lane:\n\n                                 THE POSTMAN\n                   We can't help you. We're just as\n                   lost as you are.\n\n      The Postman rides on. Abby watches over her shoulder as\n      they slowly begin to sit back down.\n\n\n141   EXT. HOLNIST CAMP - BETHLEHEM'S TENT - DAWN                     141\n\n      Bethlehem sits waiting at his camp table.     Behind him, a\n      finished painting.\n\n                                                       (CONTINUED)\n\n                                                                 114.\n\n141   CONTINUED:                                                        141\n\n      This time he's painted himself in the grand Rococo-style -\n      - as part of the Holy Family with doves and flowers and\n      glowing rays from Heaven. It's awful.\n\n      Getty and Gibbs bring in a prisoner.       It's Ford!\n\n                                 BETHLEHEM\n                   Good lord, what do we have here?\n\n                                 FORD\n                   I'm a representative of the\n                   restored United States --\n\n      Bethlehem backhands Ford.\n\n                                 GIBBS\n                   He's got a letter. Says The\n                   Postman sent it.\n\n                                 BETHLEHEM\n                   A letter?\n\n      Bethlehem tears open the letter and starts to read:\n\n                                 BETHLEHEM\n                   'Bethlehem. This letter is my\n                   testimony to the fact that there\n                   is no restored United States and\n                   there is no Postal Service.'\n                          (laugh; grim)\n                   Then who the hell have we been\n                   fighting...?\n                          (reads on)\n                   'My carriers are returning home.\n                   In exchange, I'm asking you to let\n                   them be. The Postman.'\n\n      Bethlehem eyes Ford with undisguised contempt.\n\n                                 BETHLEHEM\n                   He expects me to believe this?\n\n                                 LUKE (O.S.)\n                   It's true, sir. I was there. He\n                   disbanded the carriers and rode\n                   west.\n\n      Ford turns blazing eyes to Luke -- he's been standing\n      there all along.\n\n                                 FORD\n                   Traitor...\n\n      It takes a moment for the news to sink in.      But it does.\n\n                                                         (CONTINUED)\n\n                                                                  115.\n\n141   CONTINUED:    (2)                                                  141\n\n                                    BETHLEHEM\n                   Then I've won.     I've won.\n\n      As the assembled Holnists congratulate each other,\n      Bethlehem looks at Luke.\n\n                                 BETHLEHEM\n                   You were supposed to kill him.\n\n                                 LUKE\n                   I couldn't get close enough.\n                          (re: Ford)\n                   This one's his second in command.\n\n      Bethlehem looks Ford over.\n\n                                 BETHLEHEM\n                   Why doesn't that surprise me?\n\n      Ford stares back.    Proud.     Bethlehem looks to Getty.\n\n                                 BETHLEHEM\n                   Bring out the one we found\n                   yesterday. They can die together.\n\n      A frightened CARRIER is brought up. He wears a purple\n      uniform with CALI sewn on the shoulder. Neither we nor\n      Ford have seen him before. As a firing squad assembles,\n      Ford is shoved over with him.\n\n                                    FORD\n                   Who are you?\n\n                                 CAL CARRIER\n                   Name's Clark. Postal Carrier of\n                   the restored Republic of\n                   California. Who are you?\n\n      Ford looks at him a second, can't help but laugh.      From\n      Gibbs; the shout of \"ready!\"\n\n                                 FORD\n                   Postmaster Ford Lincoln Mercury.\n\n                                    CALI CARRIER\n                   It's an honor.\n\n      Bethlehem watches as Clark holds out his hand.      Ford\n      shakes it. \"Aim!\"\n\n                                 BETHLEHEM\n                   Wait a minute... wait a minute!\n\n                                                         (CONTINUED)\n\n                                                            116.\n\n141   CONTINUED:    (3)                                            141\n\n                                   GIBBS\n                   Sir?\n\n                                  BETHLEHEM\n                   Hold your fire! You don't know\n                   each other?\n                          (to himself, quiet\n                           anger building)\n                   This will never be over. It'll go\n                   on except I'll be fighting a\n                   goddamn ghost.\n\n                                 GIBBS\n                   Should we fire, sir?\n\n                                   BETHLEHEM\n                   No goddamnit.\n\n      Bethlehem crumples the letter, tosses it.\n\n                                 BETHLEHEM\n                   No, I won't fight a ghost. Tabula\n                   rasa, gentlemen. A clean slate.\n                   I want all mail carriers hunted\n                   down. I want The Postman found.\n                   I want him dealt with.\n                          (to Getty)\n                   Colonel, organize the scouts.\n                          (to Luke)\n                   He rode west?\n\n\n142   EXT. RIVER - DAY                                             142\n\n      A pair of boots are walking through the water. It's The\n      Postman. He turns over a body in the water. It wears a\n      homemade postal uniform, a bag of mail twisted around his\n      arm. It's a young face, one we haven't seen before. He\n      looks up to Abby on a ridge.\n\n                                 THE POSTMAN\n                   I don't know him. Do you?\n\n                                 ABBY\n                          (shakes her head)\n                   Where do you think he came from?\n\n      Puzzled, The Postman shakes his head. He gently releases\n      the body. The current takes it and they watch as it\n      continues on its way to Postal Valhalla.\n\n\n143   EXT. INTERSTATE - DAY                                        143\n\n      The family of transients are grilled by three Holnist\n      scouts. One man points the way Abby and Bethlehem rode.\n\n                                                                 117.\n\n144   EXT. PLAIN - DAY                                                  144\n\n      Littered with rubble. The wood, brick, steel and concrete\n      of what was once a small town. Amazingly, one gray house\n      still stands, miraculously untouched by whatever disaster\n      visited this place.\n\n      A wild-haired SQUATTER steps out on the porch as Abby and\n      The Postman ride by. He waves hello with a .45.\n\n                             SQUATTER\n                Howdy. Welcome to sunny\n                California.\n\n                              THE POSTMAN\n                       (re: the town)\n                What happened here?\n\n                              SQUATTER\n                Little accident. The ground\n                started to shake big time and the\n                Hanford nuclear plant went...\n                       (motions an explosion)\n                ... 'Poof.' Destroyed everything\n                for miles. But the sunsets are\n                beautiful.\n\n                              THE POSTMAN\n                You ever hear of a city called St.\n                Rose?\n\n                              SQUATTER\n                Friend, I've never heard of St.\n                Shit.\n\n      The Squatter laughs and laughs -- like it was the funniest\n      thing in the world. The Postman and Abby exchange a look,\n      continue on their way.\n\n                              SQUATTER\n                Hey, don't go! I got Monopoly in\n                the house! Boardwalk, Park Place\n                and the Reading Railroad!\n\n                                                       CUT TO:\n\n\n145   EXT. EDGE OF RUBBLE - DAY                                         145\n\n      Ponytail, Chubby, and Draw watching from afar.    Chubby has\n      the telescope.\n\n                              CHUBBY\n                You think that's President\n                Starkey?\n\n                                                       (CONTINUED)\n\n                                                                 118.\n\n145   CONTINUED:                                                        145\n\n      Ponytail takes the telescope from Chubby for a look.\n\n                                 PONYTAIL\n                   No.\n\n                                 CHUBBY\n                   What makes you so sure?\n\n                                 PONYTAIL\n                   President lives in a white house.\n                   That guy's place is gray.\n\n      Drew and Chubby exchange a look.       That makes sense.\n\n\n146   EXT. SKY - DAY                                                    146\n\n      A lightning bolt shreds the sky.       It's day, but the sky is\n      black with rain.\n\n\n147   EXT. HIGH TENSION TOWERS - DAY                                    147\n\n      The useless towers cutting across a valley.      Rain beats\n      down, as The Postman and Abby trudge along.\n\n      Up ahead, a rail-road tunnel promises shelter from the\n      storm.\n\n                                 THE POSTMAN\n                          (re: the tunnel)\n                   We can rest in there.\n\n      Abby is quick to agree.\n\n      Out of the corner of his eye, The Postman catches a blur\n      of movement.\n\n      He turns his head quickly, but he's barely in time to see\n      a wooden basket, attached to one of the high wires, swing\n      from a distant tower. There's a sentry inside it.\n\n      The basketed sentry whistles away at 40 mph, heading\n      straight for an adjacent tower. In a matter of seconds,\n      he's lost from view.\n\n      The Postman looks back at Abby.       She's shivering.\n\n                                 THE POSTMAN\n                   Did you see that?\n\n                                 ABBY\n                          (shaking her head)\n                   I'm hungry, Postman.\n\n      The Postman guides her toward the train tunnel.\n\n                                                              119.\n\n148   INT. TRAIN TUNNEL - DAY                                        148\n\n      Abby sleeps beside the fire. The Postman, silhouetted\n      against the flames, heads toward the far tunnel exit.\n\n\n149   EXT. FAR SIDE OF TUNNEL - DAY                                  149\n\n      The Postman peers into the rain, taking in the view of a\n      distant bridge. Abby comes to stand at his side.\n\n\n150   EXT. COLUMBIA RIVER GORGE (BRIDGE CITY) - DAY                  150\n\n      A town settled between spans of a steel truss bridge. The\n      Columbia River rushes far below. A sentry spots Abby and\n      The Postman approaching, blows a whistle.\n\n                              GUARD\n                Set the rifle on the ground.\n\n                              THE POSTMAN\n                This old thing? It isn't even\n                loaded. Where are we?\n\n      The BRIDGE CITY MAYOR, a middle-aged retro-hippie, steps\n      up.\n\n                              B.C. MAYOR\n                You're in Bridge City. Where we\n                don't allow guns.\n\n      The Postman sets down the carbine.    The Guard steps over\n      to scoop it up.\n\n                              B.C. MAYOR\n                Sentry said you were coming.\n\n      The Postman stares at the Mayor a beat.\n\n                                 THE POSTMAN\n                I know you.     You're famous.\n\n                              B.C. MAYOR\n                I was once. Not anymore.\n                       (beat)\n                Are you looking to cross?\n\n                              THE POSTMAN\n                We will be. Right now, we'd just\n                appreciate some food.\n                       (as the Mayor\n                        nods his assent)\n                I got some kids behind me, too.\n\n                                                      (CONTINUED)\n\n                                                                120.\n\n150   CONTINUED:                                                       150\n\n                                   B.C. MAYOR\n                   How many?\n\n                                   THE POSTMAN\n                   Three.\n                          (as the Mayor\n                           agrees once more)\n                   Hey, guys, come on in! I know\n                   you're out there!\n\n                                 CHUBBY SENTRY\n                   Boy, is he smart...\n\n      As they stand, show themselves.\n\n\n151   EXT. NORTH BOUND LANE (BRIDGE CITY) - DUSK                       151\n\n      Fog rolls in.    Abby rests.\n\n      Ponytail, Chubby and Drew look up gratefully as one of the\n      citizens of Bridge City doles out bread.\n\n      The Mayor steps over, hands The Postman two loaves.\n\n                                 B.C. MAYOR\n                   For you and your wife.\n\n                                   THE POSTMAN\n                   Thanks.    She's not my wife.\n\n      The exchange cuts Abby like a knife. She gets up and\n      leaves. The Mayor keeps his council -- not sure what to\n      make of this arrangement.\n\n                                 THE POSTMAN\n                   Let me ask you something, have you\n                   ever heard of a town with electric\n                   lights?\n\n                                   B.C. MAYOR\n                   St. Rose?\n\n                                   THE POSTMAN\n                   Yeah!\n\n                                 B.C. MAYOR\n                   Never been. But they say it's a\n                   ways down on the coast.\n\n                                   THE POSTMAN\n                   How far?\n\n                                                        (CONTINUED)\n\n                                                                121.\n\n151   CONTINUED:                                                       151\n\n                                 B.C. MAYOR\n                   Couple hundred miles at least.   I\n                   couldn't say for sure.\n\n      It's the discovery of a lifetime. The Postman looks to\n      the west end of the bridge, where Abby stands alone.\n\n                                 THE POSTMAN\n                   You seem like a decent man. And\n                   these seem like decent people.\n\n                                   B.C. MAYOR\n                   We try to be.\n\n                                 THE POSTMAN\n                   And this seems like a safe place.\n\n                                 B.C. MAYOR\n                          (intuitive)\n                   You want to leave her?\n\n      The Postman looks back to the Mayor, then slowly nods.\n\n                                 THE POSTMAN\n                   All of them. I'll give you the\n                   horses and my gear. Abby's\n                   special. She's strong. Probably\n                   end up running the place.\n\n                                 B.C. MAYOR\n                   Why don't you take the night to\n                   think. Decide if that's what you\n                   really want.\n\n\n152   EXT. BRIDGE - NIGHT                                              152\n\n      Fog obscures the east end. A sentry squints at the\n      MUFFLED CLOP of HOOVES. The mist parts to reveal, seventy\n      yards away: three Holnist scouts on horseback.\n      Emissaries from hell.\n\n      As the sentry blows a whistle...\n\n\n      BRIDGE\n\n      As word spreads, folks move down the bridge for a look.\n      Eating their bread, The Postman, Abby and the carriers\n      join them.\n\n                                                        (CONTINUED)\n\n                                                              122.\n\n152   CONTINUED:                                                     152\n\n      EAST END\n\n      The Mayor stands across from the lead scout -- conferring.\n      Finally, the Mayor points him back the way he came. The\n      lead scout doesn't budge, spots The Postman in the crowd.\n\n      He and The Postman seem to stare at each other forever.\n      Then, with a flick of the reins, he's gone. The other two\n      follow. Swallowed up by the misty evening gloom. The\n      Postman's head swims dizzily. It's not over.\n\n      The Mayor returns to dozens of nervous questions.\n\n                                 B.C. MAYOR\n                   They're looking for The Postman.\n\n                                 B.C. MAN\n                   No such thing anymore.\n\n                                 B.C. MAYOR\n                   Man on the horse says there is.\n                   Says he thinks he's here. Says\n                   he's coming back with friends.\n\n      A little BOY steps forward, sings out.\n\n                                 B.C. BOY\n                   What's a postman?\n\n      A silent moment. It's been so long, no one's sure how to\n      answer. The Postman looks down at the ground. The\n      carriers exchange deflated looks. Then...\n\n                                 ABBY\n                          (stepping forward)\n                   You never heard of a postman?\n\n      He shakes his head \"no.\" Seems a shame. As The Postman\n      looks over at Abby, she takes a page from his book.\n\n                                 ABBY\n                   There used to be a postman for\n                   every street in America. They\n                   wore uniforms. And hats. Like\n                   this one...\n\n      She goes to The Postman's gear, returns with his postal\n      cap. Sets it on the boy's head.\n\n                                 B.C. BOY\n                   Wow...\n\n                                                      (CONTINUED)\n\n                                                                123.\n\n152   CONTINUED:    (2)                                                152\n\n                                 ABBY\n                   My postman knew the name of every\n                   kid on my street. He knew our\n                   birthdays. He'd even find the\n                   baseballs you'd hit down the\n                   street. I can still see the smile\n                   on his face. The tip of his cap\n                   -- when he had a letter in his bag\n                   with my name on it. Mine always\n                   came just after school. You could\n                   set your watch by him. Unless you\n                   were waiting on something special\n                   -- like a present from somewhere\n                   far away or a letter from your\n                   sweetheart. Then it seemed like\n                   he'd never come. I used to think\n                   they could make time stand still.\n\n      Several other listeners nod -- they're completely with\n      her.\n\n                                 ABBY\n                   I don't think we ever really\n                   understood what they meant to us\n                   until they were gone. Getting a\n                   letter made you feel like you were\n                   part of something bigger than\n                   yourself. No place was ever too\n                   far away for the postman. So\n                   nobody ever had to be alone. The\n                   postman was someone you could\n                   count on. Things just made more\n                   sense when they were around.\n                          (beat)\n                   That's the kind of world we used\n                   to have. A world a lot of us took\n                   for granted. And now we've got\n                   this one. And it makes me\n                   wonder -- what kind of world do I\n                   want my child to live in? I want\n                   my child to live in a world where\n                   hopes and dreams aren't just lies\n                   you tell yourself to get through\n                   another day. I want my child, and\n                   I want my friends -- I want all of\n                   us to live in a world where you\n                   still get your mail.\n\n      It's a   moment before anyone speaks.\n\n                                 B.C. MAYOR\n                          (to The Postman)\n                   Are you The Postman?\n\n                                                        (CONTINUED)\n\n                                                               124.\n\n152   CONTINUED:    (3)                                               152\n\n      The Postman takes the cap off the little boy's head,\n      touches the emblem, and answers.\n\n                                 THE POSTMAN\n                   Yes.\n\n                                 B.C. MAYOR\n                   I've heard of you, man. You're\n                   famous.\n\n                                 THE POSTMAN\n                   Yeah, I guess I am. And all of a\n                   sudden, I'm not wearing the right\n                   clothes.\n\n      And as he puts on his cap, he accepts the mantle as well.\n\n\n153   EXT. BRIDGE - CLOSE ON PINE BOX - MORNING                       153\n\n      lowered from the top of the bridge. Hands reach up to\n      steady it and bring it gently to the ground. It's one of\n      many.\n\n      The Postman and Abby gasp as the Mayor opens the lid to\n      reveal: 20 well-oiled rifles and 15 pistols with ammo.\n      The Postman blinks over at the Mayor.\n\n                                 B.C. MAYOR\n                   Fact that we don't allow 'em\n                   doesn't mean we don't have 'em.\n                   We're not stupid, after all.\n\n                                 THE POSTMAN\n                   I'm sorry I've brought this on\n                   you.\n\n                                 B.C. MAYOR\n                   No need to be sorry. Long as we\n                   get our mail on time.\n\n                                 PONYTAIL (O.S.)\n                   Ready for duty, sir.\n\n      The Postman looks over to see Ponytail, Drew and Chubby\n      ride up. Like him, they are back in uniform.\n\n                                 THE POSTMAN\n                   The order was to burn all\n                   uniforms.\n\n      The carriers look away -- sheepish.\n\n                                                       (CONTINUED)\n\n                                                                  125.\n\n153   CONTINUED:                                                         153\n\n                                 THE POSTMAN\n                   You know what to do then?\n\n                                 PONYTAIL\n                   Talk to the people. Gather who's\n                   willing. Tell them it's\n                   important. Tell them we can make\n                   a difference.\n\n                                 CHUBBY SENTRY\n                   And tell 'em we're going to kick\n                   ass.\n\n                                 THE POSTMAN\n                   Yeah, tell them that, too.\n\n\n154   EXT. NEAR BRIDGE - DAY                                             154\n\n      At the edge of the Gorge. The three carriers, and the\n      mounted locals thunder off the bridge and down the road.\n      High above...\n\n\n155   EXT. HIGH TENSION TOWER - POSTMAN AND ABBY                         155\n\n      The Mayor is in the b.g. helping one of the sentries\n      prepare the basket for travel.\n\n                                 ABBY\n                   This is hard for me.\n                          (beat)\n                   Michael was the best man I ever\n                   knew. I never thought there'd be\n                   another man I could love the way I\n                   loved him.\n                          (searching for\n                           the words)\n                   I don't know why I've been so\n                   blessed. And I've tried to find a\n                   way to be thankful, but I swear,\n                   if I lose you...\n\n      Her eyes start to tear and he takes her in his arms.\n\n                                 THE POSTMAN\n                   Abby, do you think a lie can\n                   become the truth?\n\n                                 ABBY\n                   I don't know, but I believe in\n                   you. You have a gift, Postman.     I\n                   saw it back in Pine View.\n                                 (MORE)\n\n                                                          (CONTINUED)\n\n                                                                126.\n\n155   CONTINUED:                                                       155\n\n                                 ABBY (CONT'D)\n                   You made Mrs. March feel like she\n                   could see again. You made Ford\n                   feel like he was part of the\n                   world. You give out hope like it\n                   was candy in your pocket.\n\n      He starts to speak.    She stops him, taking his hand.\n\n                                 ABBY\n                   When you come back, we'll be\n                   waiting here for you. So you can\n                   take us to St. Rose.\n\n      The Postman lets go of her hand and starts for the basket.\n\n      The Mayor gestures to the line of towers extending into\n      the distance.\n\n                                 B.C. MAYOR\n                   There's three good-sized towns up\n                   that way. Enough folks to be a\n                   big help to you. If you can\n                   convince them to come.\n\n      As The Postman steps into the basket, he makes the mistake\n      of looking over the edge. It's a long, long way down.\n\n                                 B.C. MAYOR\n                   A lot higher than it looks, huh?\n\n      The Postman looks at the contraption with more than a\n      little trepidation. The Mayor grins.\n\n                                  B.C. MAYOR\n                   Don't tell anybody, but I like to\n                   ride the damn thing just for the\n                   hell of it. Being a city official\n                   has its perks.\n\n      He winks and as he reaches for the release pin.     The\n      Postman's hand meets his there.\n\n                                 B.C. MAYOR\n                   Trust me, man. This'll get you\n                   there a lot faster.\n\n                                 THE POSTMAN\n                   How do I stop --\n\n      But it's too late.    The Mayor releases the pin.\n\n                                                       (CONTINUED)\n\n                                                                127.\n\n155   CONTINUED:    (2)                                                155\n\n                                 B.C. MAYOR\n                   Don't worry about it. Good luck\n                   and Godspeed.\n\n\n      COUNTERWEIGHT\n\n      Plummeting into the Columbia River Gorge.      The Mayor lets\n      out a rebel yell.\n\n\n      BASKET\n\n      The Postman is whipped along, past the riders below.     The\n      speed exhilarating.\n\n\n156   EXT. PINE VIEW, OREGON - DAY                                     156\n\n      The town's gone, but the palisade remains. Chubby rides\n      along it, exhorting the people who watch from above. But\n      it's The Postman we hear, all the magic back in his voice.\n\n                                 THE POSTMAN (V.O.)\n                   Once more into the breach, dear\n                   friends, once more. Or close the\n                   wall with our dead. In peace\n                   nothing so becomes a man as\n                   modesty and humility. But when\n                   the blast of war blows in our\n                   ears, then imitate the action of\n                   the tiger.\n\n\n157   EXT. ELVIS, OREGON - NIGHT                                       157\n\n      A few makeshift structures are back up. Carrying a torch,\n      Ponytail gallops hard into town. People wake, including\n      Mrs. March's daughter. As Ponytail speaks to them...\n\n                                 THE POSTMAN (V.O.)\n                   Summon up the blood. Disguise\n                   fair nature with rage and lend the\n                   eye a terrible aspect.\n\n\n158   EXT. FIELD - DAY                                                 158\n\n      Captured by a Holnist cavalry patrol, Old George and four\n      other carriers are lined up, hands bound before them.\n      Holnist soldiers force them to their knees as Gibbs\n      organizes an impromptu firing squad.\n\n                                                        (CONTINUED)\n\n                                                                128.\n\n158   CONTINUED:                                                       158\n\n      Old George looks down the line.    The carriers are about to\n      break down.\n\n                                 OLD GEORGE\n                   Steady, boys, steady.\n\n      And as Gibbs steps up, all hope is gone.\n\n                                 GIBBS\n                   In accordance with Law Eight...\n\n                                 OLD GEORGE\n                   Get on with it, you floppy-eared\n                   sonuvabitch!\n\n      We see the faces of the young carriers. Defeated, bitter.\n      But there's a sudden spark in Old George's eyes. He\n      starts to rise.\n\n      The soldiers pick up their guns and that's when they see\n      The Postman.\n\n\n      THE POSTMAN\n\n      Riding over the crest. Galloping toward them. Behind\n      him, forty new mail carriers. All riding like mad. One\n      of them carries the flag of the restored United States.\n\n      Gibbs and his men run for their horses. SHOTS are FIRED.\n      Four Holnists go down. The rest gallop away.\n\n      The Postman and his carriers meet.\n\n\n159   EXT. CROSSROADS - DAY                                            159\n\n      Converging. The Postman with his forty-five coming from\n      the west. Drew, Chubby, and a ragtag thirty coming from\n      the north. And from the south, Ponytail leading a\n      contingent of fifty!\n\n      The forces converge and continue east.\n\n\n160   EXT. HOLNIST CAMP - DAY                                          160\n\n      The army has gathered.    Three hundred strong.\n\n      Bethlehem and Getty stand outside the command tent,\n      listening to a winded, frightened Gibbs. We FOLLOW\n      Bethlehem's eyes OVER Gibbs' SHOULDERS TO the horizon,\n      where he sees: The Postman and his army of two hundred\n      carriers cresting a distant rise.\n\n                                                        (CONTINUED)\n\n                                                              129.\n\n160   CONTINUED:                                                     160\n\n                                 GIBBS (O.S.)\n                   ... We were outnumbered, sir.\n\n                                 BETHLEHEM\n                   How many?\n\n                                 GIBBS\n                   A least a hundred. With guns.\n\n                                 BETHLEHEM\n                          (feigning shock)\n                   With guns? Are you sure?\n\n                                 GIBBS\n                   Yes, sir...\n\n                                 BETHLEHEM\n                   Looks more like two hundred to\n                   me...\n\n      He steps away to get a better vantage point of the\n      approaching army. He reaches out -- Getty hands him a\n      pair of binoculars.\n\n                                 BETHLEHEM\n                          (donning a pair of\n                           leather gloves)\n                   Only thing worse than a coward is\n                   one who can't count. Lieutenant,\n                   do yourself a favor. Die well in\n                   this battle. In my army a\n                   deserter's life is a brief and\n                   unpleasant one.\n\n      Bethlehem watches The Postman through the binoculars -- a\n      hint of a smile on his face.\n\n                                 BETHLEHEM\n                          (to himself)\n                   At last, someone with courage\n                   enough to bring the fight to me.\n\n      A Holnist soldier stands by with Bethlehem's horse.   The\n      General mounts -- the model of military calm and\n      precision. Getty reins up beside him.\n\n                                 BETHLEHEM\n                   Reckoning, gentlemen. This is the\n                   day I've dreamed of.\n\n\n161   EXT. BATTLEFIELD - DAY                                         161\n\n      A sea of wildflowers separates the carriers from the\n      Holnists. The monster John Deere gun is ready for battle.\n\n                                                              130.\n\n162   EXT. HOLNIST LINE - DAY                                        162\n\n      Bethlehem stands with Getty, scanning the postal line with\n      his binoculars. The carriers look, just spoiling for a\n      fight. Bethlehem lowers his binoculars, smiles grimly.\n\n                              BETHLEHEM\n                They're an eager-looking bunch.\n                Morale's a dangerous thing.\n                       (to Getty)\n                Bring him up. I want this postman\n                to see how the game is played.\n\n\n163   EXT. CARRIERS' LINE - DAY                                      163\n\n      The Postman, Chubby, Ponytail and Old George and all the\n      carriers have taken positions.\n\n      The Postman sights through a telescope.\n\n      He scans further down the line -- then stops when he sees\n      Ford. Bloody, beaten within inches of his life. He's\n      shackled -- surrounded by Holnist guards.\n\n      The Postman's eyes turn to stone.\n\n                              THE POSTMAN\n                       (to carriers)\n                Stay here. No one moves until I\n                give the orders.\n\n      He clicks his horse forward, toward the Holnist line.\n\n\n164   EXT. HOLNIST LINE - DAY                                        164\n\n      Bethlehem, flanked by Getty and the Holnist Sergeant,\n      watches as The Postman makes his approach. He reaches\n      into his pocket, withdraws a white kerchief and holds it\n      in the air.\n\n                              SERGEANT\n                Are they surrendering?\n\n                              BETHLEHEM\n                God, I hope not.\n\n      He watches for a moment as The Postman crosses the field -\n      - moving well within range of Holnist fire. Then, he\n      coaxes his horse forward.\n\n                                                              131.\n\n165   EXT. MEADOW - DAY                                              165\n\n      Bethlehem and The Postman riding toward each other. They\n      meet when The Postman is almost three-quarters of the way\n      over to the Holnists' side.\n\n\n      BETHLEHEM AND POSTMAN\n\n      As they come face-to-face.\n\n                              BETHLEHEM\n                My little shipping clerk.\n\n                              THE POSTMAN\n                We're both a couple of frauds.\n                You know it; I know it.\n\n      Bethlehem sneers.\n\n                              BETHLEHEM\n                Great men are made by other great\n                men. Patton had Rommel. Grant\n                had Lee. But I get you.\n\n                              THE   POSTMAN\n                You're no fucking   general. You're\n                a copying machine   salesman.\n                You're not even a   good painter.\n\n                              BETHLEHEM\n                Are you trying to goad me into a\n                fight?\n\n                              THE POSTMAN\n                Wouldn't it be great if wars could\n                be fought just by the assholes who\n                started them? We could settle\n                this thing right here. You and\n                me.\n\n                              BETHLEHEM\n                Unfortunately, it doesn't work\n                that way.\n\n                              THE POSTMAN\n                It does in your army.\n\n      The Postman kicks his horse up into a gallop, and rides up\n      the Holnist line. No one, least of all Bethlehem, is sure\n      what's going on.\n\n                              THE POSTMAN\n                I invoke law seven of the Laws of\n                Eight! Any man may challenge for\n                leadership of the clan!\n\n                                                      (CONTINUED)\n\n                                                               132.\n\n165   CONTINUED:                                                      165\n\n                                 BETHLEHEM\n                   What?\n\n      The Postman wheels his horse around.\n\n                                 THE POSTMAN\n                   I challenge you.\n\n      Bethlehem is caught completely by surprise, but recovers.\n\n                                 BETHLEHEM\n                   You're not a Holnist. You're not\n                   a member of the clan. You don't\n                   have the right.\n\n      The Postman rolls up his sleeve. He rides the Holnist\n      lines displaying his brand for all to see. The Holnists\n      murmur amongst themselves.\n\n                                 THE POSTMAN\n                   I have every right. I invoke law\n                   seven!\n\n      Bethlehem can't believe his eyes.\n\n                                 THE POSTMAN\n                   I challenge for leadership of the\n                   clan!\n\n      The seed of doubt is planted. Is Bethlehem violating one\n      of the Laws of Eight? The men look at one another. Gibbs\n      looks to Getty. Bethlehem looks from The Postman's tattoo\n      to his face.\n\n                                 BETHLEHEM\n                   Where do I know you from?\n\n                                THE POSTMAN\n                   'Cry Havoc! And let slip the dogs\n                   of war.' Remember that?\n\n                                  BETHLEHEM\n                   Shakespeare. The one who didn't\n                   want to fight.\n\n                                 THE POSTMAN\n                   I should've found a way to kill\n                   you then. But you seemed so\n                   strong.\n\n                                 BETHLEHEM\n                   Law seven it is.\n                          (to all)\n                   This war is settled here!\n\n                                                       (CONTINUED)\n\n                                                                 133.\n\n165   CONTINUED:    (2)                                                 165\n\n      As The Postman nods in agreement.\n\n      They take their positions -- and without a word -- they\n      kick their horses into a charge. Coming straight for each\n      other like medieval jousters.\n\n      Bethlehem reaches for his sword.    But before it clears the\n      scabbard, The Postman lunges.\n\n      The horses collide.    Bethlehem and The Postman hit the\n      ground hard.\n\n      Holnists and Carriers alike begin to move forward for a\n      better look.\n\n      The fight is fierce. Bloody. The Postman and Bethlehem\n      are at each other like coiled snakes.\n\n      It's more of a fight than any of the Holnists --\n      especially Getty -- expected. The spectators pull in\n      tighter.\n\n      Both combatants have taken a beating -- and still, they\n      fight on -- trading bloody, raw-knuckled punches.\n\n      One of Bethlehem's connects. The Postman loses his\n      footing, hits the ground -- knocking his head on a rock\n      with a resounding CRACK. Dazed, he's slow to rise.\n\n      It's just the moment Bethlehem needs, he straddles the\n      fallen Postman, reaches for his knife with one hand --\n      grabs The Postman's throat with the other.\n\n                                 BETHLEHEM\n                   I study people. I know your\n                   problem. Do you know why you\n                   can't fight?\n\n      The Postman can't answer.\n\n                                 BETHLEHEM\n                   You have nothing to fight for.\n                   You don't care about anything.\n                   You don't value anything. You\n                   don't believe in anything. That's\n                   what makes me better.\n\n      The Postman grabs Bethlehem's knife-hand -- using all his\n      remaining strength to keep him at bay.\n\n                                 THE POSTMAN\n                          (barely audible)\n                   I believe in the United States\n                   Postal Service.\n\n                                                       (CONTINUED)\n\n                                                                 134.\n\n165   CONTINUED:    (3)                                                 165\n\n      The Postman lets go of Bethlehem's hands, grabs his belt\n      and pulls him over. As they roll to their feet, The\n      Postman club-fists Bethlehem on the side of the head.\n\n                                  THE POSTMAN\n                   Neither snow...\n                          (wham!)\n                   Nor rain...\n                          (wham!)\n                   Nor heat...\n                          (wham!)\n                   Nor gloom of night...\n                          (wham!)\n                   Will stay this courier from the\n                   swift completion of his appointed\n                   rounds...\n\n      Bethlehem reels, stumbling back. The Postman pounces on\n      top of him, begins to strangle him. Bethlehem tries to\n      pry the fingers from his throat, but can't. He's going to\n      die.\n\n      The Postman is urged on. By both sides. Holnists.\n      Carriers. Ford. Even Holnist Luke. He looks up at the\n      faces -- and finally lets Bethlehem go. The General gasps\n      for breath.\n\n      As Ponytail and Chubby move forward to untie Ford, The\n      Postman looks to both sides.\n\n                                 THE POSTMAN\n                   It doesn't have to be this way.\n                   We don't have to kill each other.\n                   We can live together. We can --\n\n      Ford takes Chubby's pistol, sets it against the side of\n      Bethlehem's head.\n\n                                  FORD\n                   Law three.   Mercy is for the weak.\n\n                                    THE POSTMAN\n                   Ford, don't...\n\n      Bethlehem shakes his head -- doesn't want him to, either.\n\n                                 FORD\n                   Law eight. There is only one\n                   penalty and that penalty is death.\n\n      Ford's going to shoot.\n\n                                                         (CONTINUED)\n\n                                                                135.\n\n165   CONTINUED:    (4)                                                165\n\n                                 THE POSTMAN\n                   He isn't worth it. I'm the head\n                   of the clan now! There are going\n                   to be new laws!\n                          (to all)\n                   Law one! No more killing!\n                   There's going to be peace!\n\n      The Postman looks at carriers and Holnists alike.\n\n                                  THE POSTMAN\n                   Who else?   Who else has a law?\n\n                                 WOMAN\n                   Everyone has to learn how to read.\n\n                                 THE POSTMAN\n                   That's law two. Who else?!\n\n                                   CARRIER #1\n                   Three.    Liberty and justice for\n                   all!\n\n                                   LUKE\n                   Four.    No more tattoos.\n\n                                  CARRIER #2\n                   Law five.   Give peace a chance!\n\n                                HOLNIST SOLDIER #2\n                   Law six. Mercy is, it's okay\n                   sometimes!\n\n                                   CARRIER #3\n                   Seven!    Bring back vacations!\n\n      The Postman nods solemnly, looks to Ford.\n\n                                 THE POSTMAN\n                   How about it, Ford Lincoln\n                   Mercury? You give us law eight.\n\n      Ford grits his teeth.\n\n                                 THE POSTMAN\n                          (close -- for Ford)\n                   Be a leader, Ford.\n\n                                   FORD\n                   Law eight...\n\n      Ford FIRES! Bethlehem flinches, then sags as he realizes\n      Ford has fired into the ground.\n\n                                                        (CONTINUED)\n\n                                                                136.\n\n165   CONTINUED:    (5)                                                165\n\n                                 FORD\n                   ... Live and let live.\n\n      The Postman smiles in relief as Ford lowers the revolver\n      and starts to hand the weapon over.\n\n      Forgotten for an instant, Bethlehem makes a last, wild\n      lunge, grabs Ford's gun.\n\n      As Bethlehem aims at The Postman, a SHOT rings out. Hit\n      in the chest, Bethlehem blinks in amazement before he\n      falls to the ground, dying. Getty has shot him.\n\n                                 BETHLEHEM\n                   Would I had bestowed that time in\n                   the tongues that I have in\n                   fencing, dancing and bear-baiting.\n                   Oh, had I but followed the arts...\n\n      He dies.\n\n                                 THE POSTMAN\n                   Grow like savages -- as soldiers\n                   will -- that nothing do but\n                   mediate on blood.\n\n      Getty throws his rifle on the ground. Other weapons are\n      laid down. The war, at long last, is over.\n\n                                 THE POSTMAN\n                   Somebody take a letter.\n\n                                 CHUBBY\n                   Huh?\n\n                                 THE POSTMAN\n                   A letter...\n\n                                                        DISSOLVE TO:\n\n\n166   INT. ABBY'S PLACE (BRIDGE CITY) - DAY                            166\n\n      Abby, in bed, holding her new baby in her arms. She's\n      reading a letter. What she reads makes her smile. She\n      puts the letter down and cuddles her baby.\n\n                                 ABBY\n                   Your daddy wrote to tell you that\n                   he'll be here as soon as he can.\n                   And that he loves you very much.\n\n      Abby looks up to see The Postman standing at her door.\n      She looks at him, smiling with tears in her eyes.\n\n                                                        (CONTINUED)\n\n                                                                  137.\n\n166   CONTINUED:                                                         166\n\n                                  THE POSTMAN\n                   Mail's slow.   I'll have to see\n                   about that.\n\n      Abby smiles down at the child in her arms.\n\n                                    ABBY\n                   Your daughter.     Her name is Hope.\n\n      The Postman takes the tiny child in his arms.\n\n                                 WOMAN (V.O.)\n                   And so my father returned home\n                   after the Holnists were\n                   defeated...\n\n\n167   EXT. ST. ROSE - DAY                                                167\n\n      A beach town. No wall, no sentries, just cottages lining\n      a dozen sand-swept streets. A crowd has gathered to hear\n      The Postman's daughter, HOPE, mid-thirties, speak. Beside\n      her, a bearded, 52-year-old Ford in his postmaster's\n      uniform. They stand before a large, tarp-draped statue.\n\n                                 HOPE\n                   But he never did see St. Rose.\n                   There was too much to be done.\n                   He'd made a promise and in keeping\n                   it -- he traded one dream for\n                   another. With no regrets. And\n                   so, in honor of my father...\n\n      She unveils the statue: we've seen this before. It's The\n      Postman on his horse, low-slung in the saddle, leaning\n      down to pluck the letter from the Little Boy's hand.\n\n      There's an OLDER MAN in the audience who seems especially\n      moved by the statue. There's a younger man beside him.\n\n                                    OLDER MAN\n                   That was me.\n\n      As St. Rose applauds...\n\n\n                                                          FADE OUT.\n\n\n\n\n                                    THE END\n\n\n\n\n\nPostman, The\nWriters :   Brian Helgeland  Eric Roth\nGenres :   Action  Adventure  Drama  Sci-Fi\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:33:09.425897"}