{"title": "Program, The", "film_link": "/Movie Scripts/Program, The Script.html", "script_link": "/scripts/Program,-The.html", "info_raw": "\n\nProgram, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  David S. Ward  Aaron Latham\nGenres  Action  Drama\nScript Date : November 1992\nMovie Release Date : September 1993\n\nRead \"Program, The\" Script\n\n\n", "script": "\n\n\n\n\n                                       THE PROGRAM\n\n\n\n                                        Written by\n\n                                David S. Ward & Aaron Latham\n\n\n\n\n                                                 REVISED TAN 11/23/92\n                                                 SHOOTING DRAFT\n\n               FADE IN\n\n               ON BLACK SCREEN\n\n                                     SPORTSCASTER'S VOICE (V.O.)\n                         Allright, bowl bid ridin' here for \n                         E.S.U. Fourth down on the Georgia \n                         Tech 18. 4 ticks left. Kane sets 'em \n                         down.\n\n                                                            INSTANT CUT TO:\n\n               LINE OF TAPED KNUCKLES - NIGHT\n\n               smashing into the mud, as a football OFFENSIVE LINE comes \n               set, frosted breath steaming across to:\n\n               The DEFENSIVE LINE digging in, ready to explode.\n\n               CLOSE ON JOE KANE\n\n               E.S.U. quarterback, barking signals. The ball is snapped, \n               and we go to SLOW MOTION as the lines crash together in the \n               slop.\n\n               Joe rolls to the right, looking downfield. A huge DEFENSIVE \n               END bears down on him. Joe jukes. The end whips on by, \n               grabbing for jersey, slipping off. But big NUMBER 75 is \n               closing the gap. On the run, Joe releases a desperation pass \n               toward the end zone, just as 75 catches him and buries him \n               face-down in the swamp.\n\n               We FOLLOW THE BALL, spiraling through the slanting rain. RAY \n               GRIFFEN, black running back, glances back for it, two \n               DEFENSIVE BACKS with him. All three leap in unison, climbing \n               as high as they can, clutching, clawing for the ball. The \n               ball floats down, kisses off the tangle of fingers, splashes \n               to the ground, and rolls to a stop in the mud. Incomplete. \n               The BANG of the final gun snaps us back to LIVE ACTION.\n\n               Joe on his knees in the muck, stares at the goal line, then \n               drops his head in defeat.\n\n               ANGLE ON SAM WINTERS\n\n               Betraying little emotion, Coach SAM WINTERS, wiry, intense, \n               early 50's, takes off his headset, lets it drop, heads across \n               the field.\n\n                                     REPORTER #1 (V.O.)\n                         Coach, this is the second year in a \n                         row you've failed to go to a bowl \n                         game. Do you feel your program's in \n                         decline?\n\n               INT. LOCKER ROOM - NIGHT\n\n               Coach Winters stands outside his office surrounded by \n               reporters, a bouquet of microphones stuck in his face.\n\n                                     WINTERS\n                              (keeping his cool)\n                         No, we're just a young team on the \n                         verge. We'll be back in a major bowl \n                         next year.\n\n               Elsewhere in the locker room, we pick up a weary, mud-\n               splattered Joe Kane taking off his pads in front of his \n               locker. ALVIN MACK, black linebacker, comes by. Alvin exudes \n               danger; big, fast and hostile on the field, slightly surly, \n               a sense of repressed anger off it.\n\n                                     ALVIN\n                         Good throw, Joe. It was there.\n\n                                     JOE\n                         So was half their team.\n                              (trailing off)\n                         Shit, another Christmas at home.\n\n                                     ALVIN\n                         Next year, man. Next year we sell \n                         out. Next year we dominate.\n\n               ON COACH WINTERS AGAIN\n\n               still fielding questions.\n\n                                     REPORTER #2\n                         You still need a deep threat or a \n                         breakaway back to go with Joe Kane. \n                         What are you gonna do to address \n                         this need?\n\n                                     COACH WINTERS\n                              (a little edgy)\n                         Stop wastin' my time talkin' to you \n                         guys for a start.\n\n               As Winters gets up to go, we hear:\n\n                                     WILSON (V.O.)\n                         I'm not gonna lead you into the fog \n                         here, Sam...\n\n               INT. CHANCELLOR WILSON'S OFFICE - DAY\n\n               CHANCELLOR GRANT WILSON, 60, grey-haired eminence, sits behind \n               his desk. Seated across from him are Coach Winters and GALEN \n               HOWARD, 50, the Athletic Director.\n\n                                     CHANCELLOR WILSON\n                         I'm concerned about our Program. \n                         It's always been a source of pride \n                         to our students and alumni, but two \n                         straight so-so seasons are having a \n                         damaging effect on our fund-raising, \n                         both public and private.\n\n                                     WINTERS\n                              (half-joking)\n                         Then stop raising the entrance \n                         requirements on me. We never could \n                         have gotten Alvin Mack in here under \n                         the new guidelines.\n\n                                     CHANCELLOR WILSON\n                         As Chancellor, my first responsibility \n                         is to the academic interests of this \n                         University.\n\n               Wilson points to a representation of a football field affixed \n               to the wall. A football rests on the 40 yard line, which is \n               marked 160 million. The end zone (60 yards away) is \n               $400,000,000.\n\n                                     WILSON\n                         At a time when we're committed to a \n                         400 million dollar building program, \n                         alumni donations are down 15% the \n                         last two years. Because they've also \n                         voiced their displeasure to their \n                         legislators, we can expect a \n                         corresponding drop in state funds.\n\n                                     HOWARD\n                         The Athletic Fund is suffering too. \n                         Season tickets sales are off, \n                         merchandising's slow...\n\n                                     WINTERS\n                         You layin' all this at my door? \n                         There's been a recession on.\n\n                                     CHANCELLOR WILSON\n                         Yes, but the heaviest drop has been \n                         from the big donors, the 100,000 \n                         dollar club. These people are \n                         recession proof. They sit in my box \n                         every game, and they're much more \n                         generous when we're ranked and going \n                         to bowl games. Two of them, as you \n                         know, are on the Board of Regents, \n                         including the Chairman.\n\n                                     WINTERS\n                         What are you trying to say to me, \n                         Grant? After 12 years, my job's in \n                         jeopardy?\n\n                                     CHANCELLOR WILSON\n                         I'm not prepared to discuss your job \n                         right now; I just want you to be \n                         aware of the situation. The alumni \n                         and the legislature are unhappy and \n                         they vote with their checkbooks. I \n                         don't pretend to be an expert on \n                         football, Sam, and I'll deny that \n                         this conversation ever took place, \n                         but I do know we need to win next \n                         year.\n\n               INT. STADIUM TUNNEL - LATE AFTERNOON\n\n               Coach Winters flanked by two assistant coaches, HUMES and \n               CLAYTON, walks down a cavernous tunnel beneath the stands to \n               a waiting car. At the end of the tunnel, a scarecrow EFFIGY \n               of Coach Winters hangs from an overhead pipe.\n\n                                     CLAYTON\n                              (ignoring the effigy)\n                         Tickets are in your coat. Itinerary \n                         and player profiles are in your \n                         briefcase. We got a 9:00am tomorrow \n                         in Philly with this kid Darnell \n                         Jefferson.\n\n               Coach Winters stops, looks up at the effigy. Humes and Clayton \n               fear an outburst, a display of rage.\n\n                                     WINTERS\n                         Looks like I've lost weight.\n\n               That's it. He strides on. Humes and Clayton race to catch \n               up.\n\n                                     CLAYTON\n                         This kid's the gamebreaker we've \n                         been lookin' for.\n\n               MUSIC STARTS. TITLES BEGIN.\n\n               EXT. INTERNATIONAL AIRPORT - EVENING\n\n               A Boeing 737 roars into the night sky.\n\n                                     COACH CLAYTON (V.O.)\n                         Had a 108 yard kickoff return against \n                         Taft. Michigan's been down to see \n                         him twice.\n\n               INT. ST. LUKE'S HOME FOR BOYS - MORNING\n\n               Winters, Humes, Clayton and Joe Kane sit across from DARNELL \n               JEFFERSON and REVEREND WALLACE in a tattered parlor room. \n               Other boys of various ages and color look in from the \n               adjoining door. Darnell is black, good-looking, street-hip, \n               the letters D.J. shaved in block letters into his fade.\n\n                                     WINTERS\n                         Darnell, you have the potential to \n                         start for us as a freshman. That 108 \n                         yard kickoff return you made against \n                         Taft? One of the greatest runs I've \n                         ever seen a high school player make. \n                         Now, Michigan is set at tailback for \n                         two years. You won't play till you're \n                         a junior. With Joe here gettin' you \n                         the ball, runnin' 28 Thunder right, \n                         you'll be All-American with us as a \n                         Sophomore.\n\n                                     REVEREND WALLACE\n                         Yes, but I'm really more concerned \n                         with Darnell's education. He came \n                         here late. He's got some catching up \n                         to do.\n\n                                     WINTERS\n                         Believe me, education is the first \n                         priority in our program. That's why \n                         all the players are smarter than me. \n                         After all, a football coach is smart \n                         enough to understand the game, but \n                         dumb enough to think it's important.\n\n               This gets a little chuckle from the Reverend. It was intended \n               to.\n\n               EXT. RURAL SOUTH CAROLINA TENANT FARM - DAY\n\n               We see a run-down tenant SHACK on the edge of a large cotton \n               field.\n\n               INT. TENANT SHACK - DAY\n\n               Two rooms. Dirt floor. Two-foot Christmas tree on an apple \n               cart. Alvin Mack's MOTHER opens a Christmas present as Alvin \n               and his TWO SISTERS look on. It's an ENGRAVED LIONSHEAD \n               DOORKNOCKER, the kind you'de find on the door of an affluent \n               home. The inscription reads THE MACK'S. Alvin's mother thinks \n               it's beautiful, but isn't sure what to do with it.\n\n                                     ALVIN'S MOTHER\n                         It's real pretty, Alvin.\n\n                                     ALVIN\n                         When I turn pro, I'll get you the \n                         house to go with it.\n\n               INT. COACH WINTERS' HOUSE - DAY\n\n               Winters' daughter LOUANNE, 20, is on the phone with her \n               father. Louanne is sexy, clothes too tight, but good-natured, \n               somewhat needy and loyal as a labrador. She holds a hopelessly \n               out-of-style sweater her dad's given her for Christmas.\n\n                                     LOUANNE\n                              (lying)\n                         It's real nice, Dad.\n\n               INT. ROADSIDE MOTEL - DAY\n\n               Winters sits on the bed, eating Chinese take-out, the phone \n               cradled in his neck, talking to Louanne.\n\n                                     WINTERS\n                         I knew you'de like it, Lou. Merry \n                         Christmas. Put some fresh flowers on \n                         your Mom's grave for me. I'll be \n                         home in a couple days.\n\n               EXT. SMALL BRICK HOUSE - DAY\n\n               Battered and old, in a declining Pennsylvania neighborhood, \n               hard by a STEEL WORKS.\n\n               INT. SMALL BRICK HOUSE - DAY\n\n               Joe sits on the couch with his older brother, FRANK, watching \n               the bowl game he would have been in, had E.S.U. won their \n               last game. His FATHER, a grizzled man in his fifties, nods \n               in and out in a tattered armchair. All three have been \n               drinking beer, their empties scattered around. Frank tosses \n               Joe an Iron City beer.\n\n                                     FRANK\n                         Have another Vitamin I, Joey. Didn't \n                         think we'de see you here this \n                         Christmas, little brother.\n\n                                     JOE\n                         You won't next year.\n\n                                     JOE'S FATHER\n                              (getting up)\n                         Yeh, well we won't rent your place \n                         on the couch.\n\n               As Joe's father heads for the kitchen, he hangs his empty \n               beer can, by the pull tab, on a branch of the Christmas tree. \n               We see that the whole tree is covered with cans.\n\n               INT. PHILADELPHIA BOY'S HOME - NIGHT\n\n               Darnell talks on a pay phone in the hall.\n\n                                     DARNELL\n                         You're from E.S.U?\n\n                                     GIRL'S VOICE\n                         Yeh. I was just sittin' here by the \n                         fire doin' my homework, and decided \n                         to give you a call. See how you're \n                         doin'.\n\n               INT. OFFICE IN E.S.U. ATHLETIC DEPARTMENT - NIGHT\n\n               We see who Darnell is talking to: AUTUMN HALEY, beautiful \n               black girl, stylish, long straight hair, definitely not \n               street.\n\n                                     AUTUMN\n                         Coach Winters has been telling me \n                         about you. I'm looking forward to \n                         seeing you when you come to visit. \n                         I'll be your guide. You are coming \n                         to visit aren't you?\n\n               We PULL BACK and REVEAL Autumn in an office with 15 other \n               telephones, a coed on every one. ASST. COACH MYERS supervises \n               with a clipboard of names and numbers.\n\n               EXT. TUNNEL OF WOLFDEN STADIUM - DAY\n\n               Joe leads Darnell down to the end of the tunnel, where Autumn \n               is waiting. He introduces them. She's even more attractive \n               than Darnell thought she'd be.\n\n               She takes Darnell's hand and leads him out onto the field \n               where he's greeted by the E.S.U. BAND playing the school \n               fight song. The CHEERLEADERS whip into action, legs kicking, \n               pom-poms whirling.\n\n               The band parts and Darnell walks out into the 90,000 seat \n               stadium, an awesome sight for any young man. Autumn points \n               to the giant DIAMOND VISION SCOREBOARD. Darnell's name and \n               picture appear. The stadium P.A. ANNOUNCER cuts in.\n\n                                     P.A. ANNOUNCER\n                         Now for the starting line-up for the \n                         E.S.U. Timber Wolves. At tailback, \n                         number 20, Darnell Jefferson!!\n\n                                     DARNELL\n                         You got that right.\n\n               Darnell, in his excitement, does a little end-zone dance. \n               Slaps hands with Joe.\n\n               EXT. PICTURESQUE CAMPUS WALK - NIGHT\n\n               Romantic, Ivy-League look, lit by soft-glo footlights. Darnell \n               and Autumn walk, side by side, stopping outside Autumn's \n               dorm.\n\n                                     DARNELL\n                         Thanks for showin' me around, Autumn. \n                         I don't meet too many females like \n                         you. You got a lotta class. Real \n                         efficacious. Maybe I'll check you \n                         out in the fall.\n\n                                     AUTUMN\n                         I hope so, Darnell.\n\n               He leans down to kiss her. She hesitates, not sure about \n               this, then comes forward, kisses him on the lips, starts to \n               let it deepen, then breaks it off.\n\n                                     AUTUMN\n                         Good night.\n\n               As he watches her go up the steps, we go to:\n\n               EXT. THE BOYS HOME - DAY\n\n               Early February: It's National Decision Day and Darnell's \n               home is under seige. Reporters. Microphones. Television \n               cameras. Darnell steps out onto the porch wearing an ESU \n               jersey with #1 emblazoned on it.\n\n                                     DARNELL\n                         Now you know where I'm going and \n                         what we're indubitably going to be.\n\n               MUSIC and TITLES END.\n\n               EXT. E.S.U. CAMPUS - DAY\n\n               A hot, late summer day. Over the deserted Quad, we see the \n               title: 6 MONTHS LATER.\n\n               It fades and we MOVE TO REVEAL a city BUS pulling up at a \n               curb adjacent to the Quad. Off steps Darnell, carrying one \n               battered suitcase. Joe Kane and BUD LITE KAMINSKY, offensive \n               line tackle, are there to greet him.\n\n                                     JOE\n                         Hey, Darnell, Welcome to E.S.U.\n\n                                     DARNELL\n                              (shaking hands)\n                         Yeh, good to see you guys. What \n                         happened to the band and the dancin' \n                         honies?\n\n                                     JOE\n                         Regular students don't come back for \n                         two weeks yet. Not that they woulda \n                         been here. Now that you've enrolled, \n                         you're just another wormshit freshman.\n\n               INT. BROWNING ATHLETIC DORM - DAY\n\n               A dorm devoted exclusively to football players. Luxurious \n               lounges, study halls, saunas, recreation and media rooms. \n               Spacious living quarters. A world unto itself.\n\n               Joe and Bud usher Darnell into his room.\n\n                                     JOE\n                         Here's your room. If you need anything \n                         call the hall manager.\n\n               Darnell looks around, taking it all in. He tries to be cool, \n               but this is easily the nicest room he's ever had.\n\n                                     JOE\n                         See ya later. Freshman Placement \n                         test tomorrow at nine. McKinnley \n                         Hall.\n\n               Joe and Bud start down the hall. Darnell turns back into his \n               room, then starts to pace off it's dimensions, heel to toe.\n\n               EXT. THE 911 - NIGHT\n\n               College hang-out, bar, catering to athletes and their \n               admirers. A black HARLEY DAVIDSON, driven by Joe Kane with \n               Darnell on the back, pulls up at the curb. They get off, \n               head inside.\n\n               INT. THE 911 - NIGHT\n\n               Joe and Darnell pass a table of three girls, conspicuous \n               among them is Louanne Winters. Joe and Darnell give her a \n               nod and proceed on to a table where three fellow players \n               wait: Bud Lite, BOBBY COLLINS, good-looking, silver-tongued \n               ladies man and 2nd string quarterback, and STEVE LATTIMER, \n               heavily muscled, surf-punk defensive end. Between them is a \n               large pitcher of beer.\n\n                                     BOBBY\n                         Uh, oh, the Lead Dog is back. There \n                         goes my cover of the media guide.\n\n                                     JOE\n                         Hey, Bobby, Lats, how ya doin? This \n                         is Darnell Jefferson, freshman \n                         tailback.\n\n                                     DARNELL\n                         How ya' doin'?\n\n                                     BOBBY\n                         I was hopin' you'de have rolled your \n                         bike or somethin'. Nothin' serious, \n                         just enough to keep you out for the \n                         season.\n\n                                     JOE\n                              (pouring himself some \n                              beer)\n                         No such luck, Backup Man. But I'll \n                         try to engineer a few blowouts. Get \n                         you get some mop-up time.\n                              (studying Lattimer)\n                         Shit, Lats, you look buffed, man. \n                         You put on some weight?\n\n                                     LATTIMER\n                         35 lbs. Spent the summer in the gym. \n                         I'm tired of watchin' you guys play. \n                         I intend to start this year.\n\n                                     BUD\n                         You get any bigger, you can play \n                         offense.\n\n                                     LATTIMER\n                         Yeh, but don't I have to get dumber \n                         too?\n\n               Bud takes a good-natured swipe at him. Lattimer deflects it.\n\n               Joe notices Bobby looking over at Louanne. She gives Bobby a \n               surreptitious little wave to come over and sit with her. He \n               gives her the \"just a minute\" sign.\n\n                                     BUD\n                         You still seein' Louanne?\n\n                                     BOBBY\n                         Yeh. Now and then, when the tide \n                         rises. Don't want her to think this \n                         is some kind've exclusive deal.\n\n                                     JOE\n                         Coach finds out you're nailin' his \n                         daughter, you'll be playin' dorm \n                         ball.\n\n                                     BOBBY\n                         I'll bail before that. Besides, this \n                         is what he gets for not startin' me.\n\n               Bobby laughs and heads over to Louanne's table, as Joe pours \n               himself another beer.\n\n               Alvin enters the bar, goes to Joe's table, plops a copy of \n               Sports Illustrated down in front of Joe.\n\n                                     ALVIN\n                         Hey, man, you seen this?\n\n               On the cover is a picture of Joe and ONE OTHER QUARTERBACK, \n               TIM WAYMEN. The coverline reads, HEISMAN HOPEFULS: THE YEAR \n               OF THE QUARTERBACK.\n\n                                     ALVIN\n                              (ribbing Joe)\n                         You must be some very bad-ass \n                         motherfucker.\n\n               Joe stares at the cover. He's more stunned than elated.\n\n                                     JOE\n                         Jesus...\n\n                                     LATTIMER\n                         What? You didn't know?\n\n                                     JOE\n                         I knew there was gonna be an article. \n                         I didn't know it was gonna be on the \n                         cover.\n\n                                     ALVIN\n                         Shit, we do all the work. You get \n                         all the pub. Too bad we're not allowed \n                         to hit you in practice. Be fun to \n                         kick the shit out of a Heisman Trophy \n                         Candidate.\n\n                                     JOE\n                         I guess you'll have to wait till we \n                         get to the pros.\n\n                                     ALVIN\n                              (to Darnell)\n                         Beer boy, get me some.\n\n                                     DARNELL\n                         Are you serious?\n\n                                     ALVIN\n                         Does it look like I'm serious?\n\n               Joe drains his beer, pours another. Lattimer starts to read \n               form the article.\n\n                                     LATTIMER\n                         Listen to this. \"E.S.U. has a solid \n                         nucleus returning, but the \n                         Timberwolves, coming off two \n                         disappointing seasons, will only go \n                         as far as the strong right arm of \n                         Heisman Candidate Joe Kane will take \n                         them.\" That right, Joe? You gonna \n                         lead us to the promised land?\n\n                                     JOE\n                         I'm gonna lead... but can you follow?\n\n               Muted chuckles, but set faces. The challenge accepted. Joe \n               chugs his beer, pours another.\n\n               EXT. TWO LANE HIGHWAY - NIGHT\n\n               The crowd from the 911 (Bud, Alvin, Lattimer, Darnell, Bobby \n               and Louanne) follow Joe down the hill behind the bar toward \n               a busy two-lane highway. Joe, a little drunker than the \n               others, starts HOWLING at the moon like a Timber Wolf. The \n               others join in.\n\n                                     BUD\n                         What are we doin', Joe?\n\n                                     JOE\n                              (slightly slurred)\n                         There's something I wanta try. Gotta \n                         wake up our Mojo. Start settin' the \n                         tone for the season.\n\n                                     BUD\n                         This is not a good time to be settin' \n                         anything. You're in no shape...\n\n               Suddenly Joe makes a dash out onto the highway.\n\n                                     BUD\n                         Joe, c'mon Joe, don't be an asshole. \n                         Joe! God-damnit, why's he always \n                         doin' shit like this? Coach'll fuckin' \n                         kill me. Alvin, go get him, will ya?\n\n                                     ALVIN\n                         Hell no, you go get his ass. Crazy \n                         motherfucker.\n\n               Joe stands on the white line, cars and trucks whizzing by, \n               then lies down on his back, arms at his side.\n\n               JOE'S POINT OF VIEW\n\n               Cars and trucks blast toward us, roar on by, right on top of \n               us, honking, spraying grime, shaking the asphalt.\n\n               Bud and the others on the side of the road are increasingly \n               worried now.\n\n                                     BUD\n                         Fuck this shit.\n\n               Pissed off, Bud sprints out to the white line. The draft-\n               wake of a passing truck almost blows him over.\n\n                                     BUD\n                         C'mon, Joe, that's enough. Let's get \n                         the hell outa here. What if somebody \n                         drifts or crosses the line to pass?\n\n                                     JOE\n                         What's the matter, Bud? Can't you \n                         follow?\n\n               Bud hesitates a second, scared, but stung by this dare.\n\n                                     BUD\n                              (torn)\n                         God-damnit, god-damnit. Shit.\n\n               Bud can't fight it. He lies down on the line, his head \n               touching Joe's feet. Joe begins to HOWL again. Bud joins in. \n               Alvin and the others can't believe it.\n\n                                     ALVIN\n                         Startin' to look like a loaf of Wonder \n                         bread out there.\n\n                                     BOBBY\n                         They're makin' us look like pussies, \n                         ya know. Standin' here suckin' our \n                         thumbs.\n\n                                     LATTIMER\n                              (to Alvin)\n                         Yeh, and there's nobody from the \n                         Defense out there.\n\n               Bobby and Lattimer look at each other a beat. Time to ante \n               up. Both turn to Alvin.\n\n                                     ALVIN\n                         What are you lookin' at? You think \n                         you're bad?\n\n               Alvin snorts in disgust and starts out onto the blacktop. \n               Bobby and Lattimer smile, go to follow. Louanne grabs Bobby, \n               holds him back.\n\n                                     LOUANNE\n                              (vaguely sexual)\n                         Bobby, be careful, o.k? Please, be \n                         careful.\n\n               Bobby smiles, grabs her ass, pulls her to him, gives her a \n               long, passionate kiss, then sprints out to the white line, \n               leaving her breathless.\n\n               Alvin, Bobby and Lattimer lie down in front of Bud. Now \n               there's a line of five, a human highway median. Everybody \n               scared shitless, howling their lungs out.\n\n               Louanne and Darnell watch from the side of the road.\n\n                                     DARNELL\n                         This guy do this kinda shit a lot? \n                         They never mentioned this in \n                         recruiting.\n\n               Finally, Joe laughing wildly, jumps up and they all scramble \n               back to safety. Out of breath, but pumped up, they exchange \n               exhilarated high fives. Alvin just shakes his head.\n\n                                                               DISSOLVE TO:\n\n               INT. EXAMINATION ROOM - MORNING\n\n               Twenty freshman football players, including Darnell, are \n               scattered at tables around the room, writing furiously in \n               test booklets, as a PROCTOR paces the room. Darnell starts \n               to write an answer, stops, stumped. Worried, he looks at the \n               clock, goes on to the next page.\n\n               EXT. E.S.U. CAMPUS - MORNING\n\n               Darnell and Joe walk across campus. Darnell carries a \n               gleaming, chromed TROPHY with a football player on top. He's \n               still thinking about the test.\n\n                                     DARNELL\n                         I don't know... I left a lot of 'em \n                         blank.\n\n                                     JOE\n                         Don't worry, you'll do all right. \n                         Lotta people don't finish.\n\n                                     DARNELL\n                              (not convinced)\n                         Yeh.\n\n                                     JOE\n                         What are you doin' with the trophy?\n\n                                     DARNELL\n                         Coach Winters asked me to bring it \n                         to the meeting. I don't know what \n                         for.\n\n               Suddenly Darnell sees Autumn walking across the Quad.\n\n                                     DARNELL\n                         I'll see ya at the meeting.\n                              (handing him the trophy)\n                         Take this for me, will ya?\n\n               Joe starts to protest, but Darnell is already off, racing \n               across the Quad, quickly catching up with Autumn.\n\n                                     DARNELL\n                         Hey, Autumn, hold up! What're you \n                         doing here? I thought students didn't \n                         come back for two weeks.\n\n                                     AUTUMN\n                              (rather coolly)\n                         I came back early to see a friend.\n\n                                     DARNEL\n                         You're looking fresh, Autumn. A \n                         package of pulchritudiness. What \n                         about getting together later tonight? \n                         Maybe get a pizza? They got pizza in \n                         this town don't they?\n\n                                     AUTUMN\n                         I can't tonight.\n\n                                     DARNELL\n                         How about tomorrow night?\n\n                                     AUTUMN\n                         I don't think it's a real good idea \n                         for us to see each other, Darnell.\n\n                                     DARNELL\n                         What's the matter? I'm not good enough \n                         for you all of a sudden? Too young, \n                         is that it? I'm not, ya know. They \n                         held me back a year.\n\n                                     AUTUMN\n                         No, it's not that... I've got a \n                         boyfriend.\n\n                                     DARNELL\n                         Did you have this boyfriend when you \n                         showed me around?\n\n                                     AUTUMN\n                              (reluctant to admit \n                              it)\n                         Yes.\n\n                                     DARNELL\n                         Yeah, well, it didn't seem to bother \n                         you then. I'm willing to overlook it \n                         now.\n\n                                     AUTUMN\n                         I was mad at him.\n\n                                     DARNELL\n                         For what?\n\n                                     AUTUMN\n                         I caught him with another girl. A \n                         white girl.\n\n                                     DARNELL\n                         And you're still with this nigger?\n\n               She nods, slightly embarrassed.\n\n                                     AUTUMN\n                         Look, I got to get going, Darnell. \n                         I'm sorry. I didn't mean to lead you \n                         on. I'm glad you came here.\n\n               She starts walking away.\n\n                                     DARNELL\n                         Wait a minute. I can at least walk \n                         with you, can't I? Nothin' wrong \n                         with that.\n\n               She speeds up. He speeds up.\n\n                                     AUTUMN\n                         I'm in a hurry.\n\n                                     DARNELL\n                         I can keep up. I run the forty in \n                         four-four.\n\n               She's just about to say something when RAY GRIFFEN arrives. \n               Ray's the starting tailback, black, handsome, clean-cut, \n               well-spoken, middle class.\n\n                                     RAY\n                         Hey, Autumn --\n\n               This is exactly what Autumn didn't want to happen. Ray and \n               Darnell eye each other like a couple of roosters.\n\n                                     AUTUMN\n                         Hi, Ray. This is...\n\n                                     DARNELL\n                              (cutting in, offering \n                              his hand)\n                         Darnell Jefferson.\n                              (pointedly)\n                         Tailback.\n\n                                     RAY\n                              (shaking Darnell's \n                              hand)\n                         Ray Griffen.\n                              (just as pointedly)\n                         Starting tailback.\n\n                                     DARNELL\n                         I know. That's why they recruited \n                         me.\n\n               Autumn can't believe he said this. She starts to interject \n               something to break the tension, but never gets the chance.\n\n                                     RAY\n                         The two guys they recruited before \n                         you are handing out Gatorade now.\n                              (making the jerkoff \n                              motion)\n                         Better start strengthening your wrist.\n\n                                     DARNELL\n                         We'll see.\n                              (departing, to Ray)\n                         Give my best to Miss Lilly.\n\n               Autumn's mortification is complete.\n\n                                     RAY\n                              (to himself)\n                         What the hell is that supposed to \n                         mean?\n\n               EXT. E.S.U. CAMPUS - DAY\n\n               Establish the new, modern KELLER CENTER, home of the E.S.U. \n               Athletic Department.\n\n               INT. KELLER CENTER - DAY\n\n               The football meeting room. A quarter amphitheatre. The \n               Freshman, including Darnell, down in front. Nervous, talking \n               very little, eyes playing over the pictures of former E.S.U. \n               greats arranged on the Wall of Honor.\n\n               Behind them, the Upperclassmen, bantering, conversation \n               punctuated with laughter.\n\n               A door opens. The Assistant Coaches file in. The room hushes \n               immediately. Coach Winters walks in. The Upperclassmen break \n               into applause; the Freshmen quickly take their cue and join \n               in.\n\n                                     WINTERS\n                         Good to see you again, gentlemen.\n                              (catching sight of \n                              Darnell)\n                         Jefferson, either take off the earring \n                         or put on a dress.\n\n               The upperclassmen hoot, as Darnell, embarrassed, takes off \n               his earring.\n\n                                     WINTERS\n                         I wanna talk a little about what \n                         we're trying to do here. There are \n                         many highly respected people who \n                         feel football is about preparation \n                         for life.\n\n               The players nod reverentially at this established axiom of \n               the football cannon.\n\n                                     WINTERS\n                         These people are full of shit. You \n                         see, football is not like life.\n                              (pause)\n                         It's better. More exciting, more \n                         intense, more fun. In life, people \n                         are always wondering how they measure \n                         up; whether they're getting ahead or \n                         fallin' behind. In football, you \n                         know. Every week you get a chance to \n                         show what you're made of, a chance \n                         to demonstrate the physical and \n                         personal qualities that all those \n                         poor bastards who can't play this \n                         game are left to agonize about.\n\n               Spreading smiles all around. It's good to be a football \n               player.\n\n                                     WINTERS\n                         Last year we didn't make enough of \n                         those chances. Last year everyone \n                         felt we let the school down. Fuck \n                         the school. We let ourselves down.\n                              (pointing to the Wall \n                              of Honor)\n                         We let down a great tradition, a 120-\n                         year-old Line of Champions.\n\n               The smiles are gone. Lots of set faces now. Shame. anger, \n               retribution.\n\n                                     WINTERS\n                         Any football program worth the name \n                         is a special brotherhood, an elite \n                         corps of warriors, a select group of \n                         knights. That first time our starting \n                         unit takes the field, the first time \n                         we huddle up; that's our inner circle, \n                         that's our Round Table. If I were an \n                         upperclassman, I'd be real nervous \n                         about my seat, cause we got some \n                         very talented new-comers this year. \n                         Guys who want a place at the Table.\n                              (producing Darnell's \n                              trophy from behind \n                              the podium)\n                         This is the trophy one of our \n                         freshman, Darnell Jefferson, won as \n                         a Pennsylvania State High School \n                         First Team All-American. You know \n                         what this says to me?\n\n               The freshmen are hanging on every word.\n\n                                     WINTERS\n                         Not a god-damn thing.\n\n               He smashes the trophy on the podium, breaking it in half, \n               shattering the base. Darnell and the other freshmen are agog. \n               The upperclassmen stifle laughs, particularly Ray Griffen.\n\n                                     WINTERS\n                              (to the freshmen)\n                         Everybody here was a high school All-\n                         American.\n                              (to all the players)\n                         Whatever any of you have done before \n                         is out the window. We're startin' \n                         over. Ground zero. The Table is empty. \n                         Are you ready?\n\n               The upperclassmen nod, steely, purposeful. We go to the \n               freshmen. They're not so sure.\n\n                                                              SMASH CUT TO:\n\n               EXT. E.S.U. PRACTICE FIELD - DAY\n\n               Passing drills. Joe Kane takes a snap, fades to pass, throws \n               an out. The ball sails two feet over the receiver's head. \n               Joe's angry with himself.\n\n                                     COACH CLAYTON\n                              (to Winters)\n                         He's too pumped up. Tryin' to win \n                         the damn Heisman on every throw. I'm \n                         not sure he's ready for all this \n                         hype.\n\n                                     COACH HUMES\n                         Little late to be worryin' about \n                         that. If we don't follow up the Sports \n                         Illustrated cover with something, \n                         it'll look like we didn't believe in \n                         our own player.\n\n                                     WINTERS\n                         Don't worry, Joe's a tough kid. He'll \n                         be allright.\n\n               EXT. PRACTICE FIELD - DAY\n\n               Scrimmage. Joe hands off to Darnell. He sweeps right, cuts \n               it up, blows past the end. In a spectacular display of broken \n               field running, Darnell breaks to the sideline, cuts back, \n               eluding the corner back, and stiffarms the safety. Alvin, \n               pursuing the play, finally tackles him from behind, stripping \n               the ball at the same time. There's a wild scramble for the \n               fumble. Darnell is crushed under the pile, as the defense \n               recovers it, ruining an otherwise brilliant run.\n\n               The players unpile to reveal Darnell, writhing on the ground, \n               the wind knocked out of him. Ray Griffen runs by to take his \n               place.\n\n                                     GRIFFEN\n                         Hey, nice writhing, Jefferson. You \n                         got all the moves.\n\n                                     WINTERS\n                              (shouting to the team)\n                         Allright, move it up. Let's go, 15 \n                         yards, run the next play.\n\n               The scrimmage moves up 15 yards leaving Darnell behind. \n               Winters sprints over to Lattimer, grabs him by the face mask.\n\n                                     WINTERS\n                         Cut the necktie tackle horseshit. \n                         You think you're in some kinda \n                         highlight reel? He left you huggin' \n                         air. Target his guts. Drive right \n                         through his abdomen. I wanta see \n                         snot bubbles in his nose. I wanta \n                         see shit in his underwear.\n\n               Lattimer nods chastised. Winters moves over to check on \n               Darnell.\n\n                                     WINTERS\n                         You injured, Jefferson, or just hurt?\n\n                                     DARNELL\n                              (gasping)\n                         What do you mean?\n\n                                     WINTERS\n                         If you're hurt, you can still play. \n                         If you're injured you can't. Are you \n                         hurt or are you injured?\n\n                                     DARNELL\n                         I think I'm just hurt.\n\n                                     WINTERS\n                         O.k., then get up.\n\n               Winters extends a hand. Darnell grabs it, struggles shakily \n               to his feet\n\n                                     WINTERS\n                         Nice run. Think what it coulda done \n                         for us if we still had the ball.\n                              (handing him the ball)\n                         This is a football. I want you to \n                         carry it with you wherever you go. \n                         Never let it out of your sight.\n                              (to the rest of the \n                              team)\n                         Any of you see him on campus, take a \n                         swipe at the ball. Try to knock it \n                         out of his hands. Recover it.\n                              (to Darnell again)\n                         If anybody, but you, returns this \n                         ball to me, you'll wish you'de never \n                         been born.\n\n               Winters wheels off leaving a wobbly Darnell alone with his \n               football.\n\n                                     WINTERS (V.O.)\n                         This isn't gonna get it, goddamnit.\n\n               INT. WINTER'S OFFICE, LOCKER ROOM - DAY\n\n               Winters, mad as hell, is berating his assistant coaches who \n               are sitting, cowed in his office.\n\n                                     WINTERS\n                         I see tackling, but I don't see \n                         hitting. I see effort, but I don't \n                         see ferocity. What do you think, \n                         they're gonna motivate themselves? \n                         Football's just a game to most of \n                         these kids. This is our program, our \n                         livelihood. It's our job to make \n                         them care as much about it as we do. \n                         Make them hate me if you have to. \n                         It'll bring them together, give them \n                         a focus. So get off your butts and \n                         put the fear of God in these guys.\n\n               INT. LOCKER ROOM - LATER AFTERNOON\n\n               Dead tired players toweling off, dressing. The trainer's \n               room is crowded with aching, cramped-up, contused players. \n               Across the way, Lattimer lifts weights, alone in the weight \n               room. Clayton and Humes consider this from outside Winters' \n               office.\n\n                                     CLAYTON\n                         Shit, Lattimer's an animal all of a \n                         sudden. Benchin' 450. He's gotta be \n                         on somethin'.\n\n                                     HUMES\n                         What, steroids? Why do you always \n                         think my guys are juicin'?\n\n                                     CLAYTON\n                         I don't know... he's on the punt \n                         team for three years, then gains 35 \n                         pounds of rip in one summer and an \n                         attitude to go with it.\n\n               Winters, who's heard all this, comes by.\n\n                                     WINTERS\n                         We're not doctors, gentlemen. The \n                         NCAA has testing programs for this. \n                         Let's let them worry about it.\n                              (to Clayton)\n                         Besides, it's not that hard to put \n                         on 35 pounds in a summer, if you \n                         really hit the gym.\n\n               Winters walks on into his office. Clayton nods, realizing \n               this subject is now closed.\n\n               INT. DARNELL'S ROOM - LATE AFTERNOON\n\n               Darnell walks in, wrung out from the day's practice, stumbles \n               to the bed where he sees something that stops him - lying \n               there is his PENNSYLVANIA STATE ALL AMERICAN TROPHY. Coach \n               Winters actually smashed a replica. A smile appears on \n               Darnell's tired face.\n\n               INT. TRAINING TABLE DINING ROOM - NIGHT\n\n               For football players only. Bud Lite moves through the \n               cafeteria line.\n\n                                     BUD\n                         What you got tonight?\n\n                                     CAFETERIA WORKER\n                         Choice of three entrees. Shrimp, \n                         lasagna, T-bone steak.\n\n                                     BUD\n                         Tough choice. I'll take all three.\n\n                                     CAFETERIA WORKER\n                         What a surprise.\n\n               ANGLE ON DARNELL\n\n               at another table with Alvin and several other black players. \n               Lattimer is the only white.\n\n                                     DARNELL\n                         When do they give ya the scores on \n                         that Placement Test?\n\n                                     LATTIMER\n                         Who cares? I flunked it three times, \n                         before I got in.\n\n                                     ALVIN\n                         Long as you're in the program, they'll \n                         get you through. Maybe not with a \n                         degree, but they'll keep you eligible. \n                         Just don't do nothin' embarrassing \n                         they can't cover you for.\n\n                                     LATTIMER\n                         Hell, they even give Alvin copies of \n                         his tests in advance. He sells 'em \n                         for a hundred bucks a pop to people \n                         in his class. 'Course he's gotta \n                         have somebody read 'em to him.\n\n                                     ALVIN\n                         Fuck you, doughboy. I can read. See \n                         that shoe?\n                              (points to his shoes)\n                         That says Nike.\n\n                                     DARNELL\n                         I still don't wanna flunk that test. \n                         I wanta get a degree.\n\n                                     ALVIN\n                         What do you think, nigger? You're \n                         gonna be on the Supreme Court? All \n                         you need to know is how to sign an \n                         N.F.L. contract.\n\n               Darnell's stung by this. He'd like to think of himself as \n               capable of more.\n\n               Suddenly, Coach Winters appears at the door, a surprise \n               visitor to the training table. All the players wearing \n               baseball caps, quickly doff them. Winters is angry.\n\n                                     WINTERS\n                         What's the matter with you guys? \n                         You're supposed to be a team. Winning \n                         depends on thinking and acting and \n                         going to war together. But you don't \n                         even eat like a team. You eat like \n                         two teams. A white one and a black \n                         one. What do I have to do? Make out \n                         a seating chart? Now get up. Move \n                         around. Mix it up. Now!\n\n               The players all look at each other, then reluctantly get up \n               and change tables. Darnell sits next to Joe.\n\n                                     DARNELL\n                              (mock introduction)\n                         Hi there. Darnell Jefferson. I'm a \n                         young black man.\n\n                                     JOE\n                         Hey, glad to meet ya. Joe Kane, \n                         Caucasian. So what doya think a that \n                         new Garth Brooks album?\n\n                                     DARNELL\n                         I love that motherfucker.\n\n               Coach Winters surveys the scene, sees that all the tables \n               are integrated now.\n\n                                     WINTERS\n                         That's more like it.\n\n               He turns and walks on out. Immediately, the players begin to \n               drift back to their old tables.\n\n               INT. WEIGHT ROOM - NIGHT\n\n               Joe, Bud Lite and Bobby Collins, all suffering from various \n               aches and pains are getting Naperson and analgesic balm out \n               of the non-prescription drug cabinet. Joe pops a Nap and \n               looks across to the weight room where a stunning co-ed CAMILLE \n               SCHAEFFER works a knee lift. Camille's the perfect marriage \n               of Southern patrician beauty and athletic confirmation. Joe \n               leaves the others, heads over, pokes his head in.\n\n                                     JOE\n                         How ya' doin'?\n\n                                     CAMILLE\n                         Fine.\n\n                                     JOE\n                         Little late to be workin' out, isn't \n                         it?\n\n                                     CAMILLE\n                              (with a little edge)\n                         Only time I could get in here when \n                         the football team wasn't usin' it.\n\n                                     JOE\n                              (trying to get a rise \n                              out of her)\n                         Well, if it wasn't for the football \n                         team, might not be a weight room to \n                         use. You tryin' to firm up a little, \n                         or what?\n\n                                     CAMILLE\n                              (unfazed)\n                         Don't need to firm up. I'm \n                         strengthening my knee. Had \n                         arthroscopic surgery.\n\n                                     JOE\n                         Had my knee scoped once too. When \n                         you're finished here, maybe we could \n                         get a yogurt, compare scars.\n\n                                     CAMILLE\n                         Sorry, I don't date football players. \n                         They're all full of themselves. I \n                         saw you on the cover of Sports \n                         Illustrated, so you're probably worse \n                         than most.\n\n                                     JOE\n                         That's real open minded of you. So \n                         you won't consider doin' anything \n                         with me?\n\n                                     CAMILLE\n                         No.\n\n                                     JOE\n                         Well at least tell me what happened \n                         to your knee. What'd you do? Fall \n                         outa your convertible?\n\n               Camille stops her knee lift, turns to Joe. We think she's \n               going to fire on him. Wrong.\n\n                                     CAMILLE\n                         You know, there's maybe one thing \n                         I'd do with you.\n\n                                     JOE\n                         What's that?\n\n                                     CAMILLE\n                         Tennis. I'll play tennis with you.\n\n               Camille starts to walk away.\n\n                                     JOE\n                         Tennis. You mean now? It's raining.\n\n                                                              SMASH CUT TO:\n\n               CAMILLE - TENNIS COURTS - NIGHT\n\n               smashing a two-fisted forehand right at us, grunting with \n               the exertion. Joe scrambles to get it back, but Camille's a \n               world-class player. She attacks with a vengeance, blasting \n               every shot ala Jimmy Connors, as Bud Lite and Bobby Collins \n               watch, amazed.\n\n               We begin a SERIES OF CUTS detailing Camille's relentless \n               dismantling of Joe: Camille drilling a backhand down the \n               line, Joe barely getting it back to the net. Camille hitting \n               a powerhouse service ace, Joe lunging and whiffing the return. \n               Camille crushing another forehand. Joe crushes it back, sends \n               it over the fence and into the parking lot. Camille serving \n               again at match point. Joe pops up a weak return. Camille \n               puts it away with a powerhouse overhead, the ball almost \n               knocking Joe down. He flings his racket against the fence. \n               Camille comes to the net to shake hands, but Joe hangs back.\n\n                                     CAMILLE\n                         Thanks for the game, Heisman. You \n                         took it really well.\n\n               And she walks away along to the net. Joe goes after her, \n               pissed.\n\n                                     JOE\n                         What's this Heisman crap?\n\n               Camille's taken aback, not realizing she'd struck a nerve.\n\n                                     JOE\n                         I didn't say anything about being a \n                         Heisman candidate. I don't go around \n                         strokin' myself about it. So what's \n                         this shit you're givin' me?\n\n                                     CAMILLE\n                         I... I'm sorry... I just figured you \n                         were probably kissin' yourself in \n                         the mirror every morning.\n\n                                     JOE\n                         You figured wrong.\n\n               Now Joe walks away and Camille goes after him.\n\n                                     CAMILLE\n                         So what do you want, an apology? I \n                         just gave you one.\n\n                                     JOE\n                         I want a rematch.\n\n                                     CAMILLE\n                         A rematch?\n\n                                     JOE\n                         Some other sport. I took my beating. \n                         You owe me one. Either that or we go \n                         out.\n\n               Camille considers, tries to figure out what she'd dislike \n               least, knowing it'd be cheap to choose neither.\n\n                                     CAMILLE\n                         I'll think about it.\n\n               Camille walks off, disappearing through the gate. Joe walks \n               off in the other direction. Bud Lite and Bobby follow.\n\n                                     BOBBY\n                         Real good date, Joe. Remind me to \n                         take her out.\n\n                                                                  FADE OUT:\n\n               FADE IN:\n\n               EXT. E.S.U. CAMPUS - MORNING\n\n               Opening day of school. We take CUTS of students arriving, \n               football players checking out the new girls from atop the \n               wall of the athletic dorm, Louanne and Autumn greeting \n               returning sisters at the sorority, students registering for \n               classes etc.\n\n               INT. ACADEMIC ADVISOR'S OFFICE - MORNING\n\n               Darnell sits across from WILLIAM SMITH, Academic Advisor.\n\n                                     ADVISOR SMITH\n                         Darnell, I've reviewed your placement \n                         test and I'm afraid you failed to \n                         meet our entrance requirements in \n                         two areas.\n\n                                     DARNELL\n                         What does that mean? I can't play \n                         football?\n\n                                     ADVISOR SMITH\n                         No. It means you're going to have to \n                         take some remedial classes, what we \n                         call \"zero level\" courses. \n                         Specifically Math 0 and English 0.\n\n               Darnell is clearly deflated by this painful indication of \n               his academic standing.\n\n                                     ADVISOR SMITH\n                         You won't get college credit for \n                         them, but they will help you prepare \n                         to take the Placement Test again at \n                         the end of the quarter. If you pass \n                         at that time you'll be able to \n                         officially enter the university and \n                         take college level courses. You'll \n                         still be able to take an American \n                         History survey course, but it won't \n                         count on your record until you pass \n                         the Placement Test. But first things \n                         first. To start, I'm approving a \n                         tutor for you.\n\n                                     DARNELL\n                         A tutor? I don't need no tutor.\n\n                                     ADVISOR SMITH\n                         Any tutor. And yes you do.\n\n               INT. ATHLETIC DEPARTMENT CONFERENCE ROOM - DAY\n\n               A meeting of the football brain trust; Coach Winters, Athletic \n               Director, GALEN HOWARD, a publicist, SHARON BRAVER, and the \n               Sports Information Director (S.I.D.) LARRY NICHOLS. Also \n               present is Joe Kane, somewhat discomfited at being the center \n               of all this attention.\n\n                                     HOWARD\n                         I think both Joe and the university \n                         are best served by a straightforward \n                         Heisman campaign. Nothing too \n                         gimmicky.\n\n                                     BRAVER\n                         We've compiled a mailing list of \n                         around 1300 opinion makers; \n                         newspapers, football writers, and \n                         sports anchors. First we send them a \n                         packet on Joe and his achievements. \n                         Bio, stats, plus human interest stuff; \n                         commitment to academics, charity \n                         work, etc. Then we update it each \n                         week with a postcard. Heisman voters \n                         hate opening envelopes.\n\n               Joe is increasingly uneasy with all this.\n\n                                     JOE\n                         I haven't really done any charity \n                         work...\n\n                                     BRAVER\n                         You're gonna start. We've got some \n                         things lined up.\n\n                                     NICHOLS\n                         Unfortunately, because we weren't in \n                         the top 20 last year, we only have \n                         one network T.V. game to give Joe \n                         national exposure. Although it's a \n                         good one; Michigan. But we'll also \n                         be taping all our other games and \n                         buying satellite time. That way we \n                         can produce our own highlight package \n                         and interview pieces and send them \n                         out to T.V. stations all over the \n                         country for their sportscasts.\n\n                                     WINTERS\n                         Any questions, Joe?\n\n               If Joe was uneasy before, he's overwhelmed now. He tries not \n               to show it. After all, who could turn down a Heisman campaign? \n               Still it's a megaton of pressure.\n\n                                     JOE\n                         Ah, no... I just... you really think \n                         I got a shot to win this?\n\n                                     WINTERS\n                         Hell, yes. Plus it's a good thing \n                         for the program. Publicizes the \n                         school, gives a boost to recruiting, \n                         and it's a great thing for you. Jumps \n                         up your draft position, the size of \n                         your first contract, everything. \n                         It's a hell of an opportunity.\n\n                                     NICHOLS\n                         All you gotta do is back it up on \n                         the field, and we have no doubts \n                         about that, cause we know \"Kane is \n                         Able.\"\n\n               Nichols holds up a black CAMPAIGN BUTTON with the phrase \n               \"Kane is Able\" enblazoned on it in gold letters. This gets a \n               rise out of everyone except Joe, who's still not sure about \n               all this.\n\n               INT. JOE KANE'S BEDROOM - LATE NIGHT\n\n               Joe lies on his bed, staring up at the ceiling, unable to \n               get to sleep.\n\n               INT. CAMILLE'S BEDROOM - LATE NIGHT\n\n               The phone rings. Camille, who's been asleep, rolls over and \n               answers it.\n\n                                     CAMILLE\n                         Hello...\n\n               ON JOE\n\n                                     JOE\n                         This is Joe Kane. What did you decide?\n\n                                     CAMILLE\n                              (still drowsy)\n                         What?\n                              (looking at the clock)\n                         It's 3:00 in the morning.\n\n                                     JOE\n                         I wanta know what you decided.\n\n                                     CAMILLE\n                         I don't know... I couldn't think of \n                         any other sports I could beat you \n                         at.\n\n                                     JOE\n                         Then I'll pick you up tonight at \n                         6:00.\n\n               He hangs up.\n\n                                     CAMILLE\n                         What?\n\n               INT. CAMPUS LIBRARY - DAY\n\n               Autumn sits at a tutorial table, looking at her notes. She \n               becomes aware of someone approaching. She looks up to see \n               Darnell.\n\n                                     DARNELL\n                         Hey, Autumn.\n\n                                     AUTUMN\n                         Hi, Darnell. What are you doin here?\n\n                                     DARNELL\n                         My advisor says I need a tutor. Ya \n                         know, just to get me over a couple \n                         rough spots.\n                              (showing her a paper)\n                         I saw your name on this list. I \n                         figured if you couldn't keep my \n                         attention, nobody could.\n\n                                     AUTUMN\n                         I'm sorry, Darnell, but I've already \n                         been assigned. You're gonna have to \n                         find somebody else. I'm tutoring \n                         Scott Sherman.\n\n                                     DARNELL\n                         Not anymore. I asked Coach Winters \n                         to switch us.\n\n                                     AUTUMN\n                         Coach Winters wouldn't do that.\n\n                                     DARNELL\n                         Yeh he would. I'm a bigger prospect \n                         than Sherman.\n                              (pointing across the \n                              way)\n                         He's a lineman on the scout team.\n\n               Autumn looks back to where Darnell is pointing. Sure enough, \n               SCOTT SHERMAN is hard at work with another Tutor. Autumn \n               can't believe it. She tries to compose herself.\n\n               Darnell sits down across the table from her.\n\n                                     DARNELL\n                         C'mon Autumn, you could teach me \n                         some real erudition.\n\n                                     AUTUMN\n                              (trying to whisper, \n                              pissed)\n                         Will you stop using those big words. \n                         It sounds ridiculous.\n\n                                     DARNELL\n                              (serious about this)\n                         What doya mean? I'm improvin' myself. \n                         I learn a new word out of the \n                         dictionary every day. Mendacious, \n                         pejorative, antithetical, \n                         commensurate...\n\n                                     AUTUMN\n                         And you don't ever use them right. \n                         Pretending to be smart is not the \n                         same as being educated. Or erudite. \n                         It's just a con. And it makes you \n                         sound stupid, no matter how big a \n                         prospect you are.\n\n               Darnell is genuinely hurt by this dose of reality. His \n               customary bravado melts away.\n\n                                     DARNELL\n                         O.K... even more reason for you to \n                         be my tutor. You already taught me \n                         something.\n\n               Autumn, disarmed by his sudden humility, has no real rebuttal. \n               She would have had to tutor him anyway, but now she's having \n               trouble being angry about it.\n\n               ALVIN MACK\n\n               At another table, looking distracted and bored as his TUTOR \n               reads his history assignment to him. Alvin takes out a walkman \n               and puts the headphones on. WE HEAR A HORN BEEP.\n\n               EXT. CAMILLE'S DORM - LATE AFTERNOON\n\n               Camille comes out the front door, summoned by the horn. She \n               stops at the sight of something. We REVERSE TO REVEAL Joe on \n               his Harley.\n\n                                     CAMILLE\n                         We goin' on that?\n\n                                     JOE\n                         Yeh. I thought we might take a ride.\n\n                                     CAMILLE\n                         I promised my dad I'd never get on \n                         one of those.\n\n                                     JOE\n                         What are you, one of these trust-\n                         fund princesses? It's fine for me to \n                         play a game I don't know, but I ask \n                         you to try somethin' different and \n                         you hide behind your daddy.\n\n               He holds out a motorcycle helmet toward her, daring her. She \n               burns, but her competitiveness makes it impossible for her \n               to decline this challenge.\n\n                                     CAMILLE\n                              (snatching the helmet)\n                         All right. But we go slow. No cowboy \n                         stuff.\n\n               Joe smiles and kicks the starter. Camille climbs on and they \n               roar off.\n\n               EXT. TWO LANE HIGHWAY - NIGHT\n\n               Just outside town. Joe and Camille come down the highway at \n               moderate speed. Camille's hanging on for dear life, but we \n               can tell she's enjoying it.\n\n                                     JOE\n                         This speed, o.k.?\n\n                                     CAMILLE\n                         Yeh, fine.\n\n                                     JOE\n                         Good.\n\n               Joe immediately accelerates, throwing Camille's head back. \n               Her SHRIEK is lost in the whine of the engine, as they speed \n               away from camera.\n\n                                     CAMILLE\n                         Slow down, damnit. Joe... Joe!\n\n               They approach a high-banked turn, beyond which appears to be \n               a long, sheer dropoff. Joe looks back at Camille, smiles \n               devilishly, not looking where he's going. Camille sees they're \n               heading straight for the edge.\n\n                                     CAMILLE\n                              (freaked)\n                         Joe, look out!!!\n\n               Too late. Joe brakes, fishtails, but goes over the top of \n               the bank, off the edge, flying out into oblivion, Camille \n               screaming.\n\n                                                                    CUT TO:\n\n               ANGLE ON HARLEY\n\n               As it plops down onto a wide LEDGE not visible from the road, \n               three feet below the top of the bank. Joe lands it, skids to \n               a professional stop, breaks into raucous laughter. Camille \n               jumps off the bike, scared stiff and livid with anger.\n\n                                     CAMILLE\n                         How could you do that, you stupid \n                         punk? It isn't funny, god-dammit, \n                         you coulda killed us! You're crazy, \n                         you know that...\n\n                                     JOE\n                         Take it easy. I've done that a hundred \n                         times. No big deal.\n\n                                     CAMILLE\n                         Oh, yeh? Then why are you shaking?\n\n                                     JOE\n                              (embarrassed)\n                         I don't know... I guess cause I've \n                         never done it with someone else on \n                         the bike.\n\n                                     CAMILLE\n                         You just wanted to scare me. Are you \n                         happy now?\n\n                                     JOE\n                         Yeh, pretty much. And the scream was \n                         even better than I thought it'd be. \n                         Every dog within hearing distance \n                         wants to mate with you now.\n\n               Camille's ready to throttle him, then something catches her \n               ear. Sure enough, there are SEVERAL DOGS BARKING in the \n               distance. Joe smiles at her. She looks away, still angry, \n               but amused in spite of herself.\n\n               INT. ROADSIDE BAR - NIGHT\n\n               Working class, sawdust floor, George Thoroughgood's \"Who Do \n               You Love\" on the jukebox. Camille and Joe are sitting in a \n               booth. Joe putting away the beers.\n\n                                     CAMILLE\n                         You come here a lot?\n\n                                     JOE\n                         Now and then. Why?\n\n                                     CAMILLE\n                         It's not exactly a campus favorite. \n                         This is almost like hidin' out.\n\n                                     JOE\n                         I like places where nobody knows me. \n                         This too low-rent for you?\n\n                                     CAMILLE\n                         No, my dad owned a place like this.\n\n                                     JOE\n                         Your dad? You mean he owned a chain \n                         of these?\n\n                                     CAMILLE\n                         Not everybody with a Southern accent \n                         has their own plantation. My dad \n                         could never afford to send me here. \n                         I learned to play tennis on public \n                         courts. Mighta been able to play pro \n                         someday, if I hadn't hurt my knee.\n\n                                     JOE\n                         So you're just a scholarship jock \n                         like me.\n\n                                     CAMILLE\n                         Yeh. You disappointed?\n\n                                     JOE\n                         No, I've just never been out with a \n                         jock before.\n\n                                     CAMILLE\n                         Is that what we're doin' here? Goin' \n                         out?\n\n                                     JOE\n                         I don't know. What doya think?\n\n               Joe gets up, takes Camille's hand and pulls her to her feet. \n               They dance to a slow song.\n\n                                     CAMILLE\n                         I think you're crazy for jeopardizing \n                         your scholarship and a pro future by \n                         jumping motorcycles off of highways.\n\n                                     JOE\n                         Just tryin' to keep my edge, Camille. \n                         The other guys look to me cause they \n                         think I'll do anything. I lose that, \n                         I'm just another guy, and we all get \n                         our ass kicked.\n\n                                     CAMILLE\n                         I don't know, Joe. You scare me.\n\n               INT. ATHLETIC DORM GARAGE - NIGHT\n\n               Joe roars in on his motorcycle. Parks. Starts inside. Finds \n               himself face to face with a very unhappy Coach Winters. \n               Winters holds out his hand.\n\n                                     WINTERS\n                         The keys.\n\n               Joe hesitates a second, then reluctantly hands over his \n               motorcycle keys.\n\n                                     WINTERS\n                         I told you, as long as you're in \n                         this program, you don't take \n                         unnecessary risks off the field. A \n                         man in contention for the Heisman \n                         Trophy should be able to remember \n                         that.\n\n               Joe nods, contrite. Winters just walks on off.\n\n               INT. STUDY HALL - CAMPUS LIBRARY - DAY\n\n               Autumn is tutoring Darnell, checking her lesson notes.\n\n                                     AUTUMN\n                         O.K., using the things we worked on \n                         yesterday, I want you to write a two \n                         or three page essay on some aspect \n                         of your life. Something other than \n                         football.\n\n                                     DARNELL\n                         Like what?\n\n                                     AUTUMN\n                         Your father, maybe. You could write \n                         about your dad.\n\n                                     DARNELL\n                         Don't know that much about him. He \n                         was off in Detroit workin' in a car \n                         plant when I was born. Got laid off, \n                         tried to rob a jewelry store to get \n                         us some money. He died in prison. \n                         Some kinda heart problem.\n\n               Autumn wasn't ready for this level of hardship. She tries to \n               press on gamely.\n\n                                     AUTUMN\n                         How about your mother?\n\n                                     DARNELL\n                         She was always workin'. Usually two \n                         jobs. Comin' home one night she \n                         stopped to get us some root beer. \n                         Got caught in a gang crossfire. Shot \n                         three times... died on the way to \n                         the hospital. You want me to write \n                         about that?\n\n                                     AUTUMN\n                              (blown away)\n                         No...\n\n                                     DARNELL\n                         Good, 'cause none of it's true.\n\n               Autumn jumps up.\n\n                                     AUTUMN\n                              (raising her voice)\n                         Jesus Christ, Darnell what a terrible \n                         thing to do to somebody. That's not \n                         funny. That's sick.\n\n               Autumn realizes she's in the library and sits back down.\n\n                                     DARNELL\n                         Had ya goin', didn't I?\n\n                                     AUTUMN\n                              (soft library voice)\n                         No you didn't. You just... How could \n                         you make up somethin' like that?\n\n                                     DARNELL\n                              (contrite now)\n                         Sounded more interesting than the \n                         truth. My mom took a vacation to \n                         Chicago when I was 12. Never came \n                         back. Don't know who my dad was.\n\n               Autumn's anger melts away in the face of this painful truth.\n\n                                     AUTUMN\n                         Who took care of you?\n\n                                     DARNELL\n                         I started hangin' with the J.B.M., \n                         gang-bangin'... Did some time in the \n                         Hall. Reverand Wallace saw me playin' \n                         football on a juvenile probation \n                         team. Took me in, got me into high \n                         school. Only reason they accepted me \n                         was 'cause I could play football. \n                         Sorta like here. Football saved my \n                         life. I'd be nowhere without football.\n\n               Autumn just nods, still trying to take this all in.\n\n                                     AUTUMN\n                         Well, then... maybe you could write \n                         about football this once.\n\n                                     DARNELL\n                         Yeh, o.k... thanks.\n                              (pause)\n                         I've seen a lotta shitty things in \n                         my life, Autumn. That's why I know \n                         when I see somethin' good.\n\n               Autumn knows this is no line. He means it. She's seeing him \n               with new eyes. Moved by his pain, engaged by his sincerity, \n               and more than a little taken by his regard for her.\n\n               ON ALVIN\n\n               across the room with his tutor.\n\n                                     TUTOR\n                         Let's review the chapter I read you \n                         yesterday. Which two city states \n                         fought in the Punic Wars?\n\n                                     ALVIN\n                         I dunno. Detroit and Buffalo.\n\n                                     TUTOR\n                         C'mon, Alvin. You're gonna be tested \n                         on this.\n\n               INT. FOOTBALL MEETING - AFTERNOON\n\n               A video projector projects various football formations on \n               the wall.\n\n                                     WINTERS\n                         Okay, Alvin, this is Mississippi \n                         State's offensive set. 2nd and 2 on \n                         our 24. What defense are you in?\n\n                                     ALVIN\n                         Eagle. Zipper. Hero. Unless the set \n                         back shifts into the I.\n\n                                     WINTERS\n                         Good.\n                              (slide changes)\n                         How about here? 3rd and 7.\n\n                                     ALVIN\n                         Okie. Thunder. Lion.\n\n                                     WINTERS\n                         What's your assignment?\n\n                                     ALVIN\n                         Kill the Quarterback.\n                              (slide changes)\n                         Hit the tight end so hard his \n                         girlfriend dies.\n                              (slide changes)\n                         Kill everybody.\n\n               MUSIC UP - MONTAGE SEQUENCE BEGINS\n\n               EXT. JOE'S ROOM - EVENING\n\n               Joe watches Bud Lite, Darnell, Alvin and Lattimer file in \n               and unveil a life-size CARDBOARD STAND-UP of Joe's Sports \n               Illustrated cover pose. They whoop it up, as Joe tries to \n               muster some enthusiasm.\n\n               INT. STUDY HALL - NIGHT\n\n               Autumn's pointing out a figure on a graph in Darnell's math \n               book. As she explains, Darnell leans close to kiss her. Autumn \n               quickly leans away, glances around to see if anyone saw \n               Darnell's attempt. Darnell laughs.\n\n               INT. AMERICAN HISTORY CLASSROOM - DAY\n\n               A group of football players sits in the back of the class. \n               As the HISTORY PROFESSOR lectures at the board, Darnell \n               furiously takes notes. Scott Sherman, seizing the opportunity, \n               leans forward from the desk behind him and pokes the football \n               out of Darnell's left hand. Darnell, Scott and two other \n               FRESHMAN FOOTBALL PLAYERS spring out of their seats, \n               scrambling after the loose ball. The prof and the other \n               students watch appalled as Darnell and the others dive under \n               chairs and overturn desks in pursuit of the elusive ball. \n               Finally, Darnell, winded and disheveled, comes up with it. \n               He and the others quickly return to their seats. The prof \n               looks at Darnell aghast.\n\n                                     DARNELL\n                         Sorry... I lost my football.\n\n               INT. RAQUETBALL COURT - DAY\n\n               Joe and Camille are locked up in a furious game of raquetball. \n               Joe makes a wicked kill shot on the last point, and pumps a \n               fist in triumph. Camille, pissed at losing, throws her racket \n               and stomps around.\n\n               EXT. CAMPUS - DAY\n\n               Darnell and Autumn are having a daytime tutoring session on \n               a secluded patch of lawn. Darnell holds his football. As he \n               begins to read aloud from East of Eden, Autumn pokes the \n               ball out of his hand. They both scramble for it, Darnell \n               winding up slightly on top of her. They eye each other a \n               beat. Darnell bends down to kiss her. She lets herself kiss \n               him for a second, then gets up and starts to collect her \n               books.\n\n               INT. ATHLETIC CENTER - DAY\n\n               Several of the players are gathered around a bulletin board \n               in the hall. The starting lineup for the first game has been \n               posted. Darnell traces his finger from the designation \n               TAILBACK over to the name RAY GRIFFEN. He drops his eyes, \n               obviously disappointed.\n\n               Lattimer, meanwhile, is checking the defensive board. He \n               finds his name posted as a starting defensive end. Punching \n               the air, he dashes out of the building.\n\n                                     LATTIMER\n                         Yes!! Starting defense. Place at the \n                         table. Whooo!! Yes!!\n\n               EXT. PARKING LOT - DAY\n\n               Lattimer, in his euphoria, races out into the lot, and begins \n               head-butting car windows. He breaks out three in a row, and \n               yells in triumph, his forehead dripping blood.\n\n               Winters, walking with the TEAM TRAINER, has seen this from \n               across the street. He knows there's something dark at work \n               here.\n\n                                     WINTERS\n                         N.C.A.A. is gonna test half the team \n                         before the game Saturday. Make sure \n                         Lattimer knows about it.\n\n               MUSIC AND MONTAGE END\n\n               INT. FOOTBALL MEETING ROOM - NIGHT\n\n               The chairs are arranged in several circles, ten players to a \n               circle, like a bunch of formalized huddles. Coach Winters \n               addresses the assembly.\n\n                                     WINTERS\n                         As the veteran players know, we have \n                         Pride Night every year before our \n                         opening game. It's a chance to get \n                         to know each other better, share \n                         some thoughts, and bring us closer \n                         together as a team. So to start off, \n                         I'd like each player to tell the \n                         others in his group what he likes \n                         best about football and then what \n                         he's most proud of off the field. \n                         I've asked some of the seniors to \n                         lead it off. Gentlemen.\n\n               ANGLE ON LATTIMER IN HIS CIRCLE\n\n                                     LATTIMER\n                         I don't know... It's the battle. The \n                         goin' to war with the other guys. \n                         Hangin' together.\n\n               INT. CAMPUS BALLROOM - GAME DAY\n\n               The team walks through several plays. They wear coats and \n               ties, but no socks. Their ankles are taped.\n\n                                     LATTIMER (V.O.)\n                         Bein' different from everybody else. \n                         Havin' our own dorm, stayin' in hotels \n                         the night before games. Settin' \n                         ourselves apart.\n\n               INT. LOCKER ROOM - GAME DAY\n\n               Before the game. An NCAA OFFICIAL gives Lattimer a little \n               test tube to urinate in for his drug test. Lattimer goes \n               into one of the restroom stalls, reaches around to the back \n               of the tank, where a VIAL OF CLEAN URINE is taped. He pours \n               it in the test vial.\n\n                                     LATTIMER (V.O.)\n                         Havin' a chance to be somebody. To \n                         do somethin' that people look up to \n                         you for. Your strength and your \n                         courage. Not everybody can play \n                         football. We're the lucky ones.\n\n               INT. FOOTBALL MEETING ROOM - THE NIGHT BEFORE AGAIN\n\n                                     DARNELL\n                         The thing I'm most proud of myself \n                         for?\n\n               INT. LOCKER ROOM - GAME DAY\n\n               Darnell listening to a Walkman, is going through a pregame \n               ritual by his locker; pivoting from leg to leg, switching \n               the ball from arm to arm.\n\n                                     DARNELL (V.O.)\n                         Just that I'm here. That I'm not \n                         dead or in jail.\n\n               INT. FOOTBALL MEETING ROOM - THE NIGHT BEFORE AGAIN\n\n                                     JOE\n                         The great thing about football is \n                         you can lose yourself in it.\n\n               INT. LOCKER ROOM - GAME DAY\n\n               Joe sits off in a corner by himself, his head back against \n               the wall, staring out into space, the only movement the \n               rhythmic tapping of his feet.\n\n                                     JOE (V.O.)\n                         There's no time to think, to worry, \n                         to have doubts. Everything else fades \n                         away. You just move and react.\n\n               INT. FOOTBALL MEETING ROOM - THE NIGHT BEFORE\n\n                                     ALVIN\n                         The best thing is when you dominate. \n                         That feeling when you hit a guy real \n                         good, really stick him, and you hear \n                         that little moan.\n\n               INT. LOCKER ROOM - GAME DAY\n\n               Alvin, his ass-kicking game face on, walks over to where \n               Lattimer is finishing decorating his face with Indian war \n               paint. They chuck each other's pads, then Lattimer opens his \n               mouth. Alvin spits into it. Then Lattimer spits into Alvin's. \n               Darnell can't believe this shit.\n\n                                     ALVIN (V.O.)\n                         You know it's killin' him, but you \n                         feel great. It's just him and you, \n                         and he's the one that's hurtin'.\n\n               We move in on the burning ferocity of Alvin's eyes and\n\n                                                              SMASH CUT TO:\n\n               INT. STADIUM TUNNEL - GAME DAY\n\n               The Players are bunched together in the tunnel, slapping \n               pads, yelling encouragement. Winters waves them forward. \n               They start to run down the tunnel.\n\n               PLAYERS P.O.V.\n\n               CAMERA runs with the players as the light at the end of the \n               tunnel becomes larger and brighter. Crowd NOISE becomes louder \n               until finally the camera emerges into the stadium and the \n               light and 95,000 VOICES ROAR. AND ROAR! AND ROAR! This is \n               Big Time College Football.\n\n               INT. RADIO BROADCAST BOOTH\n\n               E.S.U. announcer BRAD HARVEY and colorman, HARMON SLOAN are \n               holding forth.\n\n                                     HARVEY\n                         Welcome everybody to the Wolf Den \n                         where the E.S.U. Timberwolves, led \n                         by Heisman candidate Joe Kane, open \n                         their season against the tough \n                         Mississippi State Bulldogs under \n                         head coach Jackie Sherrill.\n\n               EXT. THE FIELD - DAY\n\n               The crowd stands, waving banners, as the E.S.U. kicker comes \n               forward and kicks the ball high into the fall sky. The \n               MISSISSIPPI STATE RETURN MAN fields the ball at the four \n               yard line and returns it to the 22 where he's buried. The \n               defense trots out and huddles up.\n\n                                     ALVIN\n                         All right, let's get evil. 60 minutes, \n                         balls out. Let's open a can of kick-\n                         ass. Kill 'em all. Let the paramedics \n                         sort 'em out.\n\n               The Mississippi State offense breaks it's huddle, comes to \n               the line of scrimmage. Alvin, prowling behind the line, locks \n               eyes with the tailback, No.23.\n\n                                     ALVIN\n                         Hey, 23, don't think I don't recognize \n                         you, you little fuck.\n\n               The tailback looks away.\n\n                                     ALVIN\n                         Hey, pay attention when I'm talkin' \n                         to you, nigger. You're the guy that \n                         shot my mother aren't you?\n\n                                     TAILBACK\n                         What?\n\n                                     ALVIN\n                         You were tryin' to steal her fuckin' \n                         car weren't you, cocksucker.\n\n                                     TAILBACK\n                         Shut up. I never heard of your mother.\n\n               On the sidelines, Darnell is watching this exchange.\n\n                                     DARNELL\n                              (to Joe)\n                         What's Alvin saying to that guy?\n\n                                     JOE\n                         Just gettin' himself pumped up.\n\n                                     DARNELL\n                         He wasn't pumped up already?\n\n               ANGLE ON ALVIN AGAIN\n\n                                     ALVIN\n                              (to tailback)\n                         Thought I'd never find you didn't \n                         ya? But I got you now nigger, and \n                         I'm gonna kill you motherfucker. I'm \n                         gonna bust your guts open and watch \n                         you die.\n\n               The ball is snapped. The quarterback pitches to the tailback \n               as Alvin charges into the hole, screaming at the top of his \n               lungs. The tailback, eyes wide with fear, cuts back, away \n               from Alvin, where he's promptly crunched by Lattimer. The \n               ball flies loose, there's a scramble, Alvin comes up with \n               it. E.S.U. ball.\n\n               ANGLE ON\n\n               The bench and stands erupt as Lattimer and Alvin but heads \n               and trot off the field.\n\n                                     WINTERS\n                         Atta baby, Alvin, heads up. Big pop, \n                         Steve, way to stick 'em.\n                              (turning to Joe)\n                         O.K. Joe, let's go up top. Take it \n                         to 'em right away.\n\n               Joe leads the offense on. A disappointed Darnell stands on \n               the sidelines.\n\n                                     JOE\n                              (in huddle)\n                         O.K. let's put the women and children \n                         to bed, and go lookin' for dinner. \n                         Don't let em up. 51 Strike, Orange \n                         left. On 4.\n\n               Joe begins to howl like a wolf. The others join in. A pack \n               of Timberwolves. They break the huddle, come to the line of \n               scrimmage. Bud Lite begins to sing.\n\n                                     BUD LITE\n                         Bali Hi, will call you, anytime, any \n                         day. Here am I, your special island...\n\n               Bud lines up opposite a big, black DEFENSIVE TACKLE.\n\n                                     BLACK TACKLE\n                         Shut up, snowflake. You think you're \n                         in the school play?\n\n                                     BUD LITE\n                         No, Bali Hi, the endzone is calling. \n                         And the highway runs right over your \n                         ass.\n\n                                     BLACK TACKLE\n                         Bullshit, you're gonna be my bitch, \n                         baby. You gonna be my punk bitch.\n\n                                     BUD LITE\n                              (singing again)\n                         So long, farewell, auf Wiedersehen, \n                         good night, I hate to go and leave \n                         this pretty sight.\n\n               Joe hits the 4 count, and the ball is snapped. Bud Lite and \n               the Big Tackle fire out. Bud drives a forearm into the stomach \n               of the Black Tackle, doubling him over. The Black Tackle \n               comes back, slamming a forearm up under Bud's chin, snapping \n               his neck back.\n\n               Joe, meanwhile, fades to pass, pump fakes, steps up. Bud \n               Lite, chicken fighting the Black Tackle, sticks his fingers \n               in the Tackle's eyes, then cut-blocks him to the ground. The \n               Tackle falls on Bud, and smashes a fist into his ribs. Bud \n               rolls him over.\n\n               Joe spots his flanker back, MAURICE WARD, on a flag pattern. \n               Lofts a perfect spiral to him in the corner of the endzone. \n               Touchdown.\n\n               The crowd goes wild, as Bud Lite pushes off the Black Tackle's \n               throat getting up from the pile. Joe pumps a fist in the \n               air, hugs Ward, as the team celebrates. MUSIC BEGINS.\n\n                                                           FADE THROUGH TO:\n\n               ANGLE ON SCOREBOARD\n\n               It reads E.S.U. 28, Mississippi State 20. 4th Quarter.\n\n                                     WINTERS\n                         Jefferson! In for Griffen.\n\n               Darnell jazzed at his first chance to see action, buttons \n               his chinstrap, races onto the field.\n\n                                     HARVEY (V.O.)\n                         2:05 left. Kane hands to Jefferson...\n\n               ANGLE ON DARNELL\n\n               He takes a handoff, runs a trap up the middle, is hit by \n               THREE TACKLERS, clawing at the ball. They bring him down, \n               but Darnell doesn't fumble. He gets up, still clutching the \n               ball, and starts back to the huddle with it. The REFEREE \n               hustles after him.\n\n                                     REFEREE\n                         Excuse me, son, but we're gonna need \n                         that football for another couple \n                         minutes.\n\n               Darnell, suddenly realizing, gives it up. Even Winters has \n               to laugh. We go to:\n\n               ANGLE ON LATTIMER\n\n               Lattimer, sacking the quarterback, tackling him high, ripping \n               his helmet off. Lattimer runs off the field, holding it up \n               like a trophy.\n\n               The gun sounds, the game is over.\n\n               ANGLE ON COACH WINTERS\n\n               Accepting congratulations from his staff.\n\n                                     WINTERS\n                         Guess we'll be on the payroll for \n                         another week.\n\n               ANGLE ON BUD LITE AND THE BLACK TACKLE\n\n               walking off the field together, both their jerseys blood-\n               stained.\n\n                                     BUD LITE\n                         Good game, man. Really enjoyed it.\n\n                                     BLACK TACKLE\n                         Yeh, you're a strong motherfucker. \n                         Shitty singer though.\n\n               INT. PENTHOUSE HOTEL SUITE - AFTERNOON\n\n               A reception of some sort for the players is in progress. \n               Darnell, looking a little lost, fills his cup from a punch \n               bowl. A FAT CAT ALUMNUS approaches him.\n\n                                     ALUMNUS\n                         Good to see ya in there, Darnell. \n                         Way to hold on to that pigskin.\n\n               As he walks by, he slips an ENVELOPE into Darnell's coat \n               pocket. Darnell opens it to find a 50 dollar bill. Surprised, \n               he goes over to Alvin.\n\n                                     DARNELL\n                         Hey, some guy just gave me a 50 dollar \n                         bill.\n\n                                     ALVIN\n                         Don't worry, you'll get 5 or 6 hundred \n                         once you're startin', depending on \n                         how you play.\n\n                                     DARNELL\n                         But we're not supposed to get any \n                         are we?\n\n                                     ALVIN\n                         Hey, man, you can't live on $500 a \n                         month scholarship money. And the NC \n                         double assholes won't let us have \n                         jobs, so you take your money where \n                         you can get it.\n                              (taking Darnell's \n                              envelope)\n                         I'll keep it for you, till you see \n                         the light. Shit, they oughta be payin' \n                         us anyway. Athletic Department gets \n                         3 million just for goin' to a bowl \n                         game.\n\n               INT. JOE'S ROOM - EVENING\n\n               Joe sits alone on his bed watching T.V. He's being interviewed \n               in the locker room, a bouquet of microphones in his face.\n\n                                     REPORTER (V.O.)\n                         This performance today -- two \n                         touchdown passes, another you ran \n                         in. Where do you think this puts you \n                         in the Heisman race?\n\n               Joe hates this question. We go to the screen.\n\n                                     JOE\n                              (uncomfortable)\n                         I really have no idea. That's up to \n                         you guys.\n\n               ANGLE ON SCREEN\n\n               The image changes to ESPN anchor CHRIS BERMAN in the studio.\n\n                                     BERMAN\n                         Now let's turn to our Heisman watch.\n                              (does the pose while \n                              remaining seated)\n                         We begin with Sports Illustrated \n                         cover boy Joe Kane of E.S.U. who led \n                         his team to an impressive victory \n                         this afternoon. Well, if Joe continues \n                         to raise Kane, he may well be Able \n                         to dust off a large space on his \n                         trophy shelf. Although the real test \n                         will come in four weeks against \n                         Michigan and their Heisman hopeful, \n                         Tim Waymen.\n\n               EXT. CAMPUS - EVENING\n\n               Joe walks across campus, headed for Camille's dorm.\n\n                                     BERMAN (V.O.)\n                         Michigan also won big today. Timothy, \n                         \"He Could Go All The Way Men\", will \n                         be looking to do so against the \n                         Timberwolves. And of course the able \n                         Kane will be looking to also. I can't \n                         wait.\n\n               INT. CAMILLE'S DORM - NIGHT\n\n               Joe comes down the hall, knocks on Camille's door. No answer. \n               Knocks again. Nothing. Disappointed, he turns and walks away.\n\n               INT. FRATERNITY HOUSE - NIGHT\n\n               The post-game victory party is in full swing. All the players, \n               their girls and various groupies, dancing, drinking, \n               celebrating. Bud Lite and Joe stand drinking beer, watching \n               the action.\n\n                                     BUD LITE\n                         I don't know, I never seem to make \n                         out at things like this.\n\n               Bobby, who's overheard this, walks by with Louanne.\n\n                                     BOBBY\n                         You don't make out anywhere. Or did \n                         you finally break the snatch barrier \n                         this summer?\n\n                                     BUD LITE\n                         Fuck you, Bobby.\n                              (realizing Louanne's \n                              there)\n                         Excuse me, Louanne.\n\n               ANGLE ON DARNELL\n\n               sitting across the room with Alvin but his attention is on \n               Autumn and Ray out on the dance floor. Alvin notices.\n\n                                     ALVIN\n                         Forget it, nigger. No chance for you \n                         there.\n\n                                     DARNELL\n                         Why not?\n\n                                     ALVIN\n                         Griffin's goin' to medical school. \n                         She likes that light-skinned \n                         respectable shit. You're just her \n                         ghetto toy.\n\n               Darnell challenged by this, gets up and goes over to where \n               Ray and Autumn are standing. A slow tune plays.\n\n                                     DARNELL\n                              (to Autumn)\n                         Can I have this one?\n\n                                     RAY\n                         I don't think so.\n\n                                     DARNELL\n                         What are you so worried about? You \n                         haven't lost your starting job yet.\n\n               Autumn realizes this could quickly get out of hand.\n\n                                     AUTUMN\n                              (turning to Ray)\n                         Just one.\n\n               Ray reluctantly backs off. Darnell and Autumn start to dance. \n               Several players who've picked up on the tension, watch them \n               as they move around the floor. They try to pretend they're \n               just having a nice little chat.\n\n                                     AUTUMN\n                              (whispering)\n                         Take it easy, Darnell. This isn't a \n                         good time to push things. You're \n                         putting me in an awkward position.\n\n                                     DARNELL\n                         Yeh, well, I got a little \n                         encouragement along the way.\n\n                                     AUTUMN\n                         That kiss... it was just... a kiss.\n\n                                     DARNELL\n                         Bullshit. You meant it. I wouldn't \n                         be standing here now, everybody \n                         thinkin' I'm a stupid asshole, if I \n                         didn't know you meant it. I wanna \n                         see you, Autumn. Not in study hall. \n                         Not like your student. Like somebody \n                         to be taken seriously.\n\n                                     AUTUMN\n                         I do take you seriously, Darnell, \n                         but I'm still with Ray. I can't just \n                         go paradin' around town.\n\n                                     DARNELL\n                         I don't need to go paradin'. We'll \n                         go someplace different. Someplace \n                         nobody'll see us.\n\n               She looks at him a long beat. She doesn't need this \n               complication, this conflict, but she can't say no.\n\n                                     AUTUMN\n                         God, why am I even considering this?\n\n               The song ends. Ray moves in to reclaim her.\n\n                                     RAY\n                              (to Darnell)\n                         All caught up on your arithmetic?\n\n               Darnell, pissed, gives Ray a shove.\n\n                                     DARNELL\n                         Yeh, you only gained 37 yards on 12 \n                         carries.\n\n               Ray lunges back at him, but quickly several players, led by \n               Joe and Bud Lite, step between them. Darnell shrugs them off \n               and leaves the party.\n\n                                     JOE\n                              (to Bud Lite)\n                         Just what we need, a little team \n                         unity.\n\n               Ray takes Autumn's arm, pulls her out onto the patio.\n\n                                     RAY\n                         I'm gettin' a little sick of this \n                         asshole, Autumn. I don't like you \n                         hangin' out with him. It's \n                         embarrassing.\n\n                                     AUTUMN\n                         I don't hang out with him. I tutor \n                         him.\n\n                                     RAY\n                         Then have him get another tutor.\n\n                                     AUTUMN\n                         I can't do that. I made a commitment \n                         to help him pass his qualifying exam. \n                         I can't bail out on him now.\n\n                                     RAY\n                         What the hell difference does it \n                         makes? They'll grease him through no \n                         matter what he does. Nobody's ever \n                         gonna see his graduation. Don't tell \n                         me you're falling for this guy. He's \n                         just another gang-banger with speed.\n\n                                     AUTUMN\n                         I just said I wanted to help him. \n                         What are you more afraid of, losing \n                         your girl or your position?\n\n                                     RAY\n                         Maybe you oughta think about what \n                         you're in danger of losing.\n\n                                     AUTUMN\n                         Maybe I will.\n\n               Autumn rips free of his grip, and walks out of the party \n               too.\n\n               EXT. CAMPUS - NIGHT\n\n               Darnell sits alone on a bench under an old Willow, just \n               staring out at the night. He hears a voice behind him.\n\n                                     VOICE (V.O.)\n                         So where you wanna go?\n\n               He turns. It's Autumn.\n\n               INT. FRATERNITY HOUSE - NIGHT\n\n               The party's still in full gear. Ray is now chatting up a few \n               of the groupies. Joe and Bud Lite sit off in a corner. Joe's \n               knocked back several beers. He's a little tipsy, and lost in \n               thought.\n\n                                     JOE\n                         Maybe she's out with some guy.\n\n                                     BUD\n                         Who? Camille? I don't think she's \n                         the type to screw around on ya. Shoot \n                         ya, maybe...\n\n                                     JOE\n                         It wouldn't be screwing around. It's \n                         not like we're going together.\n\n               Joe's gaze falls on a sultry brunette, SHERI, at a table \n               across the way. She's eyeing Joe big time. She wants him. He \n               stares back at her. She doesn't blink.\n\n               EXT. CAMPUS LIBRARY - NIGHT\n\n               Camille, carrying an armload of books, comes down the library \n               steps, having been studying late. As she heads for her dorm, \n               she sees Joe and Sheri going across the Quad; Sheri draped \n               around Joe, nuzzling him.\n\n               Joe looks over, spots Camille, stops; surprised, embarrassed \n               to see her. They exchange a look. Camille, upset, turns and \n               wheels off. Joe wants to say something to her, but can't get \n               it out.\n\n               ON DARNELL AND AUTUMN\n\n               We don't know where yet, but they seem to be slipping and \n               sliding, clutching on to each other.\n\n                                     AUTUMN\n                         You're right, nobody would ever see \n                         us here.\n\n               PULL BACK TO REVEAL\n\n               INT. ICE SKATING RINK - NIGHT\n\n               Near closing time. Darnell and Autumn lurch and stumble around \n               the ice, collapsing against the boards now and then. There \n               are few other skaters at this hour.\n\n                                     DARNELL\n                         Yes, I figure the key is to go places \n                         only white people go. Next time we'll \n                         go bowling.\n\n               Autumn laughs, as the house lights start to blink, indicating \n               it's closing time.\n\n                                     DARNELL\n                         Plus I saw this in Rocky. I never \n                         believed a guy who was supposed to \n                         be an athlete would skate that bad, \n                         but now I know.\n\n               They make their way to an opening in the boards, stumble \n               over to a bench, begin to unlace.\n\n                                     AUTUMN\n                         Thanks, that was fun, sort of.\n\n                                     DARNELL\n                         You were pretty good for the first \n                         time.\n\n                                     AUTUMN\n                         Well, it's not really my first time. \n                         My dad took me skating once.\n\n                                     DARNELL\n                         He used to play ball for E.S.U., \n                         didn't he?\n\n                                     AUTUMN\n                         Yeah, how'd you know that?\n\n                                     DARNELL\n                         I saw his picture on the Wall of \n                         Fame. You got his eyes. Luckily, you \n                         didn't get his thighs.\n\n               She laughs, looks at him a beat, starts to come forward to \n               kiss him. He puts a finger to her lips.\n\n                                     DARNELL\n                         Make sure you mean it this time.\n\n               She hesitates a beat, then comes forward again. They fall \n               into a deep kiss. We PULL BACK to LONGSHOT. Two people alone \n               in the expanse of the ice rink. The lights flicker and go \n               out.\n\n               INT. WEIGHT ROOM - LATE NIGHT\n\n               Camille, unable to sleep, enters in her workout clothes. \n               Languid, melancholy, she goes to the treadmill, as Joe comes \n               out of the steam room with nothing but a towel around his \n               waist. Both are surprised to see the other.\n\n                                     JOE\n                         What are you doin' here?\n\n                                     CAMILLE\n                         Couldn't sleep.\n\n                                     JOE\n                         I was just sweatin' out some of the \n                         beer.\n\n               Camille just nods. Long, silent pause.\n\n                                     JOE\n                         I didn't go home with her. I thought \n                         about it... but I didn't.\n\n                                     CAMILLE\n                         You drink too much.\n\n                                     JOE\n                         Yeh.\n\n               He turns, starts toward the door.\n\n                                     CAMILLE\n                         Why didn't you?\n\n                                     JOE\n                         Why didn't I what?\n\n                                     CAMILLE\n                         Go home with her?\n\n                                     JOE\n                         I don't know... I guess I figured \n                         maybe there was somethin' goin' on \n                         between you and me.\n\n               Camille hesitates, not sure whether to believe him, then \n               gets off the bike and walks toward him.\n\n                                     CAMILLE\n                         Then why'd you pick her up in the \n                         first place?\n\n                                     JOE\n                         I was drunk... I needed some company.\n\n                                     CAMILLE\n                              (angry)\n                         Company? Yeh, I can see you havin' a \n                         real far-ranging discussion with \n                         Sheri.\n\n                                     JOE\n                         I mean, ya know, physical company... \n                         I was... I just needed to pounce on \n                         somebody I guess.\n\n               Camille, really steamed now, snatches the towel from around \n               Joe's waist, leaving him naked.\n\n                                     CAMILLE\n                         Why can't you pounce on me? Aren't I \n                         good enough to pounce on?\n\n               Camille snaps the towel at him, driving him back. Joe's \n               totally thrown by this reaction in her.\n\n                                     JOE\n                         Well, you're more conservative... \n                         classier... you're not that kinda \n                         girl...\n\n               She snaps the towel again, backing him against the training \n               table.\n\n                                     CAMILLE\n                              (insulted)\n                         How do you know? You've never slept \n                         with me.\n\n               She pounds on his chest, pushing him back on the table.\n\n                                     CAMILLE\n                         What makes you think she's such a \n                         great ride?\n                              (climbing up on top \n                              of him)\n                         I'm prettier, my legs are longer...\n                              (pulling down her \n                              leotard)\n                         I've got better tits.\n                              (exasperated)\n                         Why would you go to her, when you \n                         have me?\n\n                                     JOE\n                         I didn't know I had you.\n\n                                     CAMILLE\n                              (softer, leaning close)\n                         Well you do.\n\n               He looks at her a beat, then pulls her mouth down to his. \n               They fall into a long, white-hot kiss.\n\n               INT. THE TRAINING ROOM - LATER THAT NIGHT\n\n               Joe and Camille are making love passionately, energetically. \n               Camille, still worked up, rolls up on top.\n\n                                     CAMILLE\n                              (between kisses)\n                         You shoulda looked for me at the \n                         library, or don't you ever go there?\n\n                                     JOE\n                              (rolling back on top)\n                         I go there. I got a 3.2 in Political \n                         Science. I just don't go there on \n                         Saturday nights.\n\n                                     CAMILLE\n                              (rolling back on top \n                              again)\n                         I have a paper due Monday. What'de \n                         she do? Sit on your lap or just give \n                         you the nail-me stare?\n\n                                     JOE\n                         Shut up, Camille.\n\n               Joe rolls back on top, the momentum carrying both of them \n               off the table and out of sight.\n\n               INT. HUGE LECTURE HALL - MORNING\n\n               Some 100 students are taking a history test in blue books. A \n               T.A., checking attendance, walks up to Louanne. She's uneasy \n               as the T.A. checks his chart.\n\n                                     T.A.\n                         What's your name?\n\n                                     LOUANNE\n                         Bobby Collins.\n\n                                     T.A.\n                         Can I see your I.D.?\n\n               Louanne knows she's in deep trouble.\n\n               INT. COACH'S VIDEO ROOM - DAY\n\n               A high-tech room full of video machines and monitors used to \n               run simultaneous views of different positions during the \n               same play. A grim-looking group of assistant coaches \n               approaches Winters as he runs through and reprograms the \n               images on the screen.\n\n                                     CLAYTON\n                         Coach, we, ah... got a problem with \n                         Bobby Collins.\n\n                                     WINTERS\n                         Yeh...\n\n                                     CLAYTON\n                         He talked... a friend... into taking \n                         a test for him and got caught. They \n                         had a new T.A. in there...\n\n                                     WINTERS\n                         What's the penalty?\n\n                                     CLAYTON\n                         Well, the rules say automatic \n                         expulsion for both of them.\n\n                                     WINTERS\n                         Fortunately, we've got friends on \n                         the Board of Regents. I think we can \n                         beat this if we really go to bat for \n                         him. We got Mack off when he turned \n                         in that other guys term paper.\n                              (shaking his head)\n                         But what kinda idiot would do \n                         something like that?\n\n                                     CLAYTON\n                         Well, I guess Bobby figured he was \n                         gonna flunk...\n\n                                     WINTERS\n                         I don't mean Bobby. I mean what kinda \n                         guy would be dumb enough to take a \n                         test for him?\n\n                                     CLAYTON\n                         Uh, well... it wasn't a guy.\n\n                                     WINTERS\n                         A girl? Typical Collins. He must \n                         have banged her until she couldn't \n                         think straight. Who was it?\n\n                                     CLAYTON\n                              (barely able to get \n                              it out)\n                         It was... Louanne.\n\n               Winters' face goes dead.\n\n               INT. COACH WINTERS' DEN - DAY\n\n               Winters, enraged, is venting his spleen at Louanne.\n\n                                     WINTERS\n                         Jesus, Louanne, how could you be so \n                         stupid?\n\n                                     LOUANNE\n                         I... he was behind, he needed help. \n                         I'm sorry. I just...\n\n                                     WINTERS\n                         Sorry! You're sorry! You've destroyed \n                         my credibility at the University, my \n                         authority with the players... Christ, \n                         it looks like I'm running a dirty \n                         program. And Collins of all people! \n                         What the hell's the matter with you, \n                         Louanne?\n\n                                     LOUANNE\n                              (crying)\n                         I don't know... I thought he... loved \n                         me...\n\n                                     WINTERS\n                         Loved you? He loves anything that \n                         winks back, the little rat bastard. \n                         And what are you gonna do for school \n                         now? I use my influence to get you \n                         back in, it'll stink to high hell. \n                         The press'll crucify me.\n\n                                     LOUANNE\n                         I'll get in someplace.\n\n                                     WINTERS\n                         God, Louanne, I told you to stay \n                         away from my players. That was my \n                         cardinal rule, stay away from the \n                         damn players...\n\n                                     LOUANNE\n                         They've always been good enough for \n                         you. Good enough to devote your life \n                         to. Why aren't they good enough for \n                         me? Or are they too good?\n\n                                     WINTERS\n                         You're changing the subject, Louanne. \n                         We're talkin' about you breakin' the \n                         rules.\n\n                                     LOUANNE\n                         Didn't you ever break the rules just \n                         a little? Didn't you tell me once \n                         that 90 per cent of the schools obey \n                         the NCAA rules, and the other 10 per \n                         cent go to bowl games? Was that just \n                         a joke?\n\n               She gets up and walks out of the room. Winters closes his \n               eyes and slumps down on the couch.\n\n               INT. STUDY HALL - NIGHT\n\n               Darnell sits at his table waiting for Autumn. Autumn storms \n               in, obviously upset about something. She slaps a corrected \n               test down in front of him.\n\n                                     AUTUMN\n                         You seen this? You got a D on your \n                         math test.\n\n                                     DARNELL\n                         Yeh, I kinda figured that. I had \n                         some trouble on this last part...\n\n                                     AUTUMN\n                         We went over that last week, Darnell. \n                         What is this time we spend in here? \n                         Just a joke to you? I don't even \n                         think you've been listening to me.\n\n                                     DARNELL\n                         I've been listening to you, baby...\n\n                                     AUTUMN\n                         Don't call me baby. I thought you \n                         wanted to learn. But if all you wanta \n                         do is fake your way through, then \n                         get another tutor to waste time with.\n\n                                     DARNELL\n                         C'mon, Autumn, we just had a good \n                         time, and now you're gettin' all \n                         nuts behind this. It's just one test.\n\n                                     AUTUMN\n                         So far, it's the only test. I want \n                         you to study this whole chapter. By \n                         yourself, without me here. When I \n                         come back, we'll discuss it. Be ready \n                         to do problems based on it.\n\n                                     DARNELL\n                         Whatever you say, Teach.\n                              (big grin)\n                         I don't wish to be cast in a \n                         pejorative light, so I'm dedicating \n                         myself to achieving on a level more \n                         commensurate with my abilities.\n\n               She shakes her head and walks away. Darnell's grin fades. He \n               looks at his test, a hint of tears in his eyes. He's \n               embarrassed and deeply worried.\n\n               INT. FOOTBALL LOCKER ROOM - DAY\n\n               The players are dressing for Monday practice, but it's \n               strangely subdued. Bobby Collins opens his locker to find a \n               BULLET-RIDDLED PRACTICE JERSEY hanging inside. Immediately \n               the rest of the players burst into raucous laughter.\n\n                                     BUD LITE\n                         Coach'd probably shoot ya lower.\n\n               Suddenly the room goes silent. Standing in the doorway is \n               Coach Winters.\n\n               He says nothing, looks around the room, the players avoiding \n               his gaze. His eyes come to rest on Bobby. Bobby tries to \n               hide the shirt, but Winters has seen. Winters just stares at \n               Bobby a beat, then.\n\n                                     WINTERS\n                         You all played a fine game on \n                         Saturday. Take the day off.\n\n               With that, he turns and walks out the door. The players remain \n               silent. Bobby throws the shirt in the trash.\n\n               INT. LOUANNE'S SORORITY HOUSE - DAY\n\n               Winters walks in the front door, past the desk, up the stairs \n               and down the hall to his daughter's room. She's packing her \n               things. He goes over to her, takes her in his arms and hugs \n               her tight. Neither speak. A tear rolls down Louanne's cheek. \n               Hits the floor.\n\n               EXT. HALL OF ATHLETIC BUILDING - DAY\n\n               A very nervous Bobby Collins comes down the hall and knocks \n               on Coach Winter's door.\n\n                                     WINTERS\n                         C'mon in, Collins.\n\n               INT. COACH WINTER'S OFFICE\n\n               Bobby enters and stands across from Winters' desk. Winters \n               doesn't invite him to sit.\n\n                                     BOBBY\n                         Listen, Coach, I just want you to \n                         know I'm really sorry about this \n                         whole thing with Louanne. I was real \n                         glad to hear she's gonna be goin' to \n                         junior college here...\n\n                                     WINTERS\n                              (cutting him off)\n                         Shut up.\n\n               Bobby does. Instantly.\n\n                                     WINTERS\n                         I could easily take your case to the \n                         Board of Regents. You've had no prior \n                         infractions and I could argue that \n                         you were under abnormal pressure.\n                              (pause)\n                         But I won't. You embarrassed me, you \n                         embarrassed my family, you embarrassed \n                         the program. As of now, you are no \n                         longer a member of this university \n                         or it's football team. Clean out \n                         your locker.\n\n               Bobby just stands there a beat, in confusion and disbelief. \n               There is no wavering, no sympathy in Winters' eyes. Finally, \n               dazed and disoriented, Bobby turns and walks out.\n\n               EXT. E.S.U. CAMPUS LIBRARY - DAY\n\n               Joe is posed in front of the school library, one of it's \n               more photogenic buildings. T.V. sportscaster LYNN SWANN and \n               his video crew wait to interview him as a MAKEUP GIRL finishes \n               applying makeup to Joe's face. Publicist Sharon Braver watches \n               like a hawk.\n\n                                     SWANN\n                              (to his cameraman)\n                         We ready, Jerry? O.K., let's mark \n                         it.\n\n               An assistant marks the take, and Swann turns to Joe.\n\n                                     SWANN\n                         Joe, this game is being billed as a \n                         potential \"Heisman Shootout\". Did \n                         you feel any added pressure this \n                         week...\n\n               EXT. PRACTICE FIELD - DAY\n\n               A phalanx of photographers crowd around, snapping away as \n               Joe goes through passing drills.\n\n                                     SWANN (V.O.)\n                         ...knowing that you're going head to \n                         head with Heisman rival, Tim Waymen?\n\n               EXT. CAMPUS LIBRARY - DAY, THE PRESENT AGAIN\n\n                                     JOE\n                         Well, ya know, you try to block it \n                         out, but it's basically impossible... \n                         Everybody seems to be talkin' about \n                         it, all the newspapers, the \n                         interviews...\n\n               INT. T.V. STUDIO - NIGHT\n\n               Joe is being interviewed by DALLAS PERRY on a local television \n               show.\n\n                                     JOE (V.O.)\n                         The hype on T.V., tryin' to get \n                         somethin' goin...\n\n               EXT. CAMPUS LIBRARY - THE PRESENT AGAIN\n\n               Sharon Braver steps directly in front of the video camera, \n               waves off the take.\n\n                                     BRAVER\n                         Hold it! Hold it!\n\n                                     SWANN\n                         What?! What's the problem?\n\n               Braver takes Joe aside, talks to him confidentially.\n\n                                     BRAVER\n                         What you're saying is true, of course, \n                         but I don't think it's the message \n                         you want to send.\n\n               INT. PIZZA PARLOR - NIGHT\n\n               Joe and Camille are sharing a pizza, but not alone. A video \n               spotlight shines on them, as yet another crew rolls tape.\n\n                                     BRAVER (V.O.)\n                         It makes you seem a little nervous. \n                         Like the pressure might be getting \n                         to you.\n\n               EXT. CAMPUS LIBRARY - THE PRESENT AGAIN\n\n                                     BRAVER\n                         This game is nationally televised, \n                         so most Heisman voters will be \n                         watching. I think a more casual \n                         approach is better. Modest, \n                         controlled, casual.\n\n               Joe nods and heads back in front of the camera.\n\n                                     SWANN\n                              (to Braver, irritated)\n                         We all set now?\n                              (gets a nod)\n                         Let's mark it.\n                              (the take is marked)\n                         Joe, this game is being billed as a \n                         potential \"Heisman Shootout.\"\n\n               EXT. E.S.U. QUAD - NIGHT\n\n               A huge bonfire burns, as a large segment of the student body \n               has gathered in front of the Timberwolf statue. The \n               cheerleaders, all wearing \"KANE IS ABLE\" buttons, whip the \n               crowd up, as Joe is introduced on the podium.\n\n                                     SWANN (V.O.)\n                         Did you feel any added pressure this \n                         week, knowing that you're going head \n                         to head with Heisman rival, Tim \n                         Waymen?\n\n               The cheerleaders begin to chant, \"Let's go, Joe.\" On \"Joe\", \n               they assume the Heisman trophy pose. Joe seems slightly \n               embarrassed by it all.\n\n               EXT. CAMPUS LIBRARY - THE PRESENT AGAIN\n\n                                     JOE\n                         No, I don't really think too much \n                         about that kinda thing.\n\n               Swann shoots Braver a poisonous look.\n\n               EXT. EMBANKMENT - NIGHT\n\n               Joe and Camille sit on a bank looking down at the railroad \n               tracks below. Neither says anything. Joe seems strangely \n               preoccupied. Camille decides to break the silence.\n\n                                     CAMILLE\n                         Your parents comin' to the game \n                         tomorrow?\n\n                                     JOE\n                         My mom's dead. My dad has never seen \n                         me play.\n\n                                     CAMILLE\n                         Why not?\n\n                                     JOE\n                         Guess he's not that interested in \n                         football.\n\n                                     CAMILLE\n                         But you're one of the best players \n                         in the country.\n\n                                     JOE\n                              (snapping)\n                         He's just not into it, o.k.?\n\n                                     CAMILLE\n                              (chastised)\n                         O.k.\n                              (silence)\n                         What's goin' on, Joe? You ask me out \n                         here, like you wanta talk about \n                         somethin', then you don't say \n                         anything. You worried about tomorrow?\n\n                                     JOE\n                         No... I'm worried about the days \n                         after that. I just. I don't know... \n                         I feel like tomorrow's gonna be my \n                         last game. I want to stay up, make \n                         the time go slow.\n\n                                     CAMILLE\n                         Why would it be your last game? You \n                         afraid of getting hurt?\n\n                                     JOE\n                         No, that'd be a relief. Then, at \n                         least, I wouldn't be a failure.\n\n                                     CAMILLE\n                         Joe, why are you thinking like this? \n                         Why would you be a failure? You're \n                         having a great year, you're a Heisman \n                         Trophy candidate, you got millions \n                         of dollars waiting for you in the \n                         pros.\n\n                                     JOE\n                              (testy)\n                         How do you know what's waiting for \n                         me? You don't know me at all.\n\n                                     CAMILLE\n                              (hurt)\n                         I don't know you? How can you say \n                         that?\n\n                                     JOE\n                         Because you wouldn't be here now if \n                         you did. You only know the guy that's \n                         supposed to make millions in the \n                         pros.\n\n                                     CAMILLE\n                         Is that what you think? That I'm \n                         with you for the money?\n\n                                     JOE\n                         Why else?\n\n               Infuriated, she slaps him across the face.\n\n                                     CAMILLE\n                         Fuck you, Joe.\n                              (starting to cry)\n                         I don't give a shit about your money. \n                         I don't even give a shit about \n                         football. And you know what? Maybe \n                         you're right, maybe I don't know \n                         you.\n\n               She turns and storms away up the hill, as we hear a TRAIN \n               WHISTLE. Joe watches her go, then starts down the hill toward \n               the tracks as the train comes into view.\n\n               Camille stops, turns back, sees Joe headed for the tracks, \n               starts to worry.\n\n               Joe reaches the grade and steps into the middle of the tracks \n               facing the oncoming train. Horrified, Camille runs down the \n               embankment toward him.\n\n                                     CAMILLE\n                         Joe! Joe! My god, Joe, what are you \n                         doing? No! No!\n\n               As the train approaches, it's horn blaring, Joe lies face \n               down on the tracks, his hands gripping the railroad ties. \n               Camille arrives at the bottom of the hill in time to see the \n               train race over him. She falls to her knees screaming.\n\n               Under the train, we see Joe desperately hugging the ground, \n               head down, toes dug in, hands clutching the ties. It's like \n               a tornado under there, dirt debris flying everywhere, his \n               clothes flapping wildly.\n\n               The train passes. Camille looks up, afraid to breath as Joe \n               lies motionless on the tracks. Suddenly he stirs, pushes \n               himself up to his knees. She lets out a scream of joy, races \n               toward him, as he gets to his feet, stumbles off the grade. \n               She hugs him to her, tears streaming down her face, helps \n               him over to the embankment.\n\n                                     CAMILLE\n                         God Joe, oh god, are you allright?\n\n                                     JOE\n                              (drained)\n                         Yeh, just got some dirt in my teeth. \n                         Guess you've really seen the dark \n                         side now, huh? You should've gotten \n                         out while you had the chance. Before \n                         it all goes to hell.\n\n                                     CAMILLE\n                         I don't wanta get out, damnit. What's \n                         wrong Joe? Why would it all go to \n                         hell?\n\n                                     JOE\n                         I'm a Kane, Camille. That's all it \n                         takes. We're cut out to be drunks \n                         and fuck-ups. We never live up to \n                         expectations. It's in our blood. My \n                         dad, brothers, uncles -- we all drink \n                         and sooner or later we all fuck up. \n                         My dad went the longest. Waited till \n                         he was playin' triple A ball, before \n                         he hit the wall. Sometimes I feel \n                         like I'm just waiting for my turn. \n                         The better I do, the closer it gets.\n\n                                     CAMILLE\n                         You're not like them, you can beat \n                         all that. You can stop drinking, you \n                         can break the chain.\n\n                                     JOE\n                         If I gave up that, I wouldn't be \n                         much of a football player. And if I \n                         wasn't a football player, what would \n                         I be?\n\n               The question hangs in the air.\n\n                                     CAMILLE\n                         You'de still be Joe. And I'd still \n                         love you.\n\n               He pulls her to him, kisses her hair, they slump against \n               each other.\n\n                                     JOE\n                         Just don't say I never warned you.\n\n               EXT. WOLF DEN STADIUM - DAY\n\n               STEVE ZABRISKIE and BO SCHEMBECKLER in the foreground, the \n               jammed to capacity stadium in the background. This shot is \n               going out on nationwide T.V., the college Game of the Week.\n\n                                     ZABRISKIE\n                         4:29 to go and it's been a great \n                         one. Two undefeated teams goin' after \n                         each other. Michigan up by four, 24-\n                         20, but the lead has changed hands \n                         three times, and you get the feeling \n                         that whoever has the ball last is \n                         gonna win it.\n\n               ANGLE ON FIELD\n\n               Joe brings the offense to the line of scrimmage. Yells \n               signals.\n\n                                     SCHEMBECKLER (V.O.)\n                         Well, it was billed as a Heisman \n                         shootout, and it's been all of that. \n                         Both Waymen and Kane moving their \n                         teams up and down the field, having \n                         big days.\n\n               Joe fades to pass, looks right, looks left, can't find a \n               receiver, decides to run for it. He sprints up the middle, \n               15, 10; a SAFETY comes at him at the 5. We see\n\n               Joe's P.O.V. through HELMETCAM. He pushes the lunging safety \n               away, turns back just in time to be blasted by the OTHER \n               SAFETY he never saw. Joe is knocked down, over the goal line \n               and out cold. The crowd goes wild.\n\n                                     ZABRISKIE (V.O.)\n                         Kane back to pass, can't find anybody, \n                         gonna run it himself, ten, five, hit \n                         at the goal-line... Touchdown E.S.U.!! \n                         Great run by Kane!\n\n               Joe lies motionless as his teamates run over to him.\n\n                                     SCHEMBECKLER (V.O.)\n                         He's still down. Looks like he's \n                         hurt.\n\n               We go to Winters, worried on the sideline, as the celebration \n               around him begins to die down.\n\n               ANGLE ON JOE\n\n               As he's carried off the field, his arms around two linemen's \n               shoulders, and lowered onto the bench. We go to a BLURRY \n               IMAGE of a man's face waving something. We REVERSE to REVEAL \n               a DOCTOR waving smelling salts under Joe's nose. Joe begins \n               to come around. The doctor holds up two fingers.\n\n                                     DOCTOR\n                         How many fingers am I holding up?\n\n                                     JOE\n                         Four.\n\n               EXT. THE FIELD - DAY\n\n               Michigan comes to the line of scrimmage. As Tim Waymen gets \n               under center, Alvin begins to yell at him.\n\n                                     ALVIN\n                         Hey, powderpuff. You're the white \n                         boy that ratted my brother out. Sent \n                         him to jail, cocksucker. Ran off \n                         with the fuckin' money. Left the \n                         blood to do the time, huh?\n\n               Waymen begins to call signals.\n\n                                     ALVIN\n                         Yeh, you're the little bastard. \n                         Account of you, my bros' datin' his \n                         cell mate. You hear me, powderpuff? \n                         Gonna make you pay. You gonna be my \n                         cellmate now. You gonna have 250 \n                         lbs. of pissed-off nigger up your \n                         ass.\n\n                                     ZABRISKIE (V.O.)\n                         E.S.U. in an eight-man line looking \n                         for the run on third and short.\n\n               The ball is snapped. Waymen fakes a handoff to his fullback, \n               hides the ball on his hip, fades to pass. On the sideline, \n               Coach Winters yells, \"Pass! Pass!\"\n\n               Alvin's not fooled by the run, he shakes his blocker and \n               takes dead aim on Waymen. Just as Waymen releases the ball, \n               Alvin blasts him, driving him into the turf.\n\n                                     ZABRISKIE (V.O.)\n                         Waymen fakes to Simms, Mack on the \n                         blitz, Waymen is goin for it all! \n                         Hit as he throws.\n\n               The ball, however, flies through the air, a perfect spiral. \n               The E.S.U. secondary has been fooled by the play fake and is \n               a step behind. The ball comes down in the hands of the \n               Michigan tight end, JERRY HUNT.\n\n                                     ZABRISKIE (V.O.)\n                         Hunt has got a step. He's got it! \n                         Touchdown!\n\n               Winters slams his headphones to the ground.\n\n                                     SCHEMBECKLER (V.O.)\n                         Great clutch throw under pressure. \n                         Can't do it much better than that.\n\n               ANGLE ON JOE\n\n               The Doctor examines Joe, shines a light in his eyes, makes \n               him track his finger, etc.\n\n                                     DOCTOR\n                         You're vision's back to normal.\n\n                                     WINTERS\n                         You think you can go?\n\n                                     JOE\n                         Yeh, I'm fine. Just a little headache.\n                              (getting up, shouting \n                              to his teamates)\n                         O.K. Offense, let's get it back.\n\n               Alvin, meanwhile, plops down on the bench in disgust.\n\n                                     ALVIN\n                         Damn tough to scare that little white \n                         boy. Either his momma dropped him on \n                         his head, or the motherfucker is \n                         deaf.\n\n               Coach Winters goes to Darnell.\n\n                                     WINTERS\n                         Jefferson, in for Griffen.\n\n               Griffen slams his helmet to the ground.\n\n               EXT. FIELD - DAY\n\n               Joe breaks the huddle as the E.S.U. offense comes to the \n               line.\n\n                                     ZABRISKIE (V.O.)\n                         Ball on the Michigan 47, 1:02 to go, \n                         Kane brings 'em to the line of \n                         scrimmage.\n\n               Joe fades to pass once again, lets the rush come, then flares \n               out a screen pass to Darnell. Darnell grabs it and takes \n               off, slipping tackles, cutting back, juking. Darnell finally \n               runs out of bounds at the twenty.\n\n                                     ZABRISKIE (V.O.)\n                         Great run by Jefferson, the highly-\n                         touted Freshman, the longest of the \n                         day for the Wolves. And this one is \n                         turning out to be everything we \n                         thought it would be.\n\n               ANGLE ON DARNELL\n\n               coming back to the huddle, pumped up. Joe kneels in the \n               center.\n\n                                     JOE\n                         O.K., time to put the women and \n                         children to bed, and go looking for \n                         dinner.\n\n               He begins to howl, as do all the others. The Call of the \n               Wild.\n\n                                     JOE\n                         82 Strike, Eagle, Crown, on 2.\n\n               They clap hands, come to the line. Joe looks over the defense, \n               bends under center and barks signals, The ball is snapped. \n               Action goes to SLOW MOTION.\n\n               Joe fakes to Darnell, fades to pass. The Michigan cornerback \n               comes on a blitz, locked on Joe. Joe starts to roll, but \n               knows the corner will catch him. On the run, he launches the \n               ball toward Darnell. Darnell opens his hands to receive it, \n               but at the last second, the Michigan SAFETY steps in front \n               and intercepts it.\n\n                                     ZABRISKIE (V.O.)\n                         Kane looking for Jefferson. It's... \n                         Intercepted! Intercepted by Freeman! \n                         And that should do it.\n\n               Joe sinks to his knees in frustration. The blitzing cornerback \n               does a quick pit-pat on Joe's helmet. Winters looks like \n               he's been punched.\n\n               As Michigan and Tim Waymen celebrate on the sideline, we go \n               to:\n\n               INT. BROADCAST BOOTH - AFTERNOON\n\n               Steve Zabriskie is doing the wrap-up, the emptying stadium \n               behind him.\n\n                                     ZABRISKIE\n                         Well, it was everything we expected \n                         it to be. Fine performances on both \n                         sides of the field.\n\n               INT. E.S.U. LOCKER ROOM - AFTERNOON\n\n               Players undress and shower in relative silence. No joy here.\n\n                                     ZABRISKIE (V.O.)\n                         The edge in the much ballyhooed battle \n                         of the quarterbacks would probably \n                         have to go to Michigan's Tim Waymen \n                         who threw for 2 touchdowns, and ran \n                         for another. Joe Kane accounted for \n                         three E.S.U. touchdowns, but had \n                         that crucial interception in the \n                         waning moments. And that proved to \n                         be the difference.\n\n               The door of the locker room opens, and a flood of reporters \n               enter. Joe hides back in the showers, leaning his forehead \n               against the wall, the water coursing over him.\n\n               EXT. TUNNEL BENEATH STADIUM - LATE AFTERNOON\n\n               Darnell comes out of the locker room, having showered and \n               dressed. He's surprised to see Autumn and her father talking \n               to Coach Humes.\n\n                                     DARNELL\n                         Hey, Autumn.\n\n                                     AUTUMN\n                         Hi, Darnell.\n\n                                     DARNELL\n                         Is this your dad?\n\n                                     AUTUMN\n                         Yes...\n\n                                     DARNELL\n                         How do you do, Mr. Haley. I'm Darnell \n                         Jefferson.\n\n                                     MR. HALEY\n                         Jefferson? Nice run you made on that \n                         screen pass. Another block and you \n                         might have scored.\n\n                                     DARNELL\n                         Thank you. We'll get 'em next year.\n\n                                     MR. HALEY\n                         How do you and Autumn know each other? \n                         You a friend of Ray's?\n\n               Darnell is jolted by this question. It's obvious that Autumn \n               has never told her dad about him.\n\n                                     AUTUMN\n                              (filling the void)\n                         Ah, I tutor him...\n\n                                     MR. HALEY\n                         Oh really? In what?\n\n               Darnell would like to crawl under a rock.\n\n                                     DARNELL\n                         Math and English.\n\n                                     MR. HALEY\n                         Ah.\n\n               There's a slight tone of condescension in Mr. Haley's voice. \n               He realizes Darnell hasn't passed his entrance exam. This is \n               not lost on Darnell.\n\n                                     MR. HALEY\n                         Well, stay on top of that, Darnell. \n                         I'd have been in real trouble if I \n                         hadn't gotten my degree. I played \n                         ball once. Hurt my knee.\n\n                                     DARNELL\n                         Yeh, I know...\n\n                                     MR. HALEY\n                         I used to put a copy of my report \n                         card inside the webbing of my helmet \n                         to remind me that college was more \n                         important than football.\n\n                                     DARNELL\n                              (forcing enthusiasm)\n                         Good idea. Well, I gotta get goin'. \n                         Nice to meet you Mr. Haley.\n\n                                     MR. HALEY\n                         Nice to meet you, Darnell.\n\n                                     DARNELL\n                         See you around, Autumn.\n\n               Before Autumn can respond, Ray Griffen approaches from the \n               other direction.\n\n                                     RAY\n                         Hey, Mr. Haley. Good to see you.\n\n                                     MR. HALEY\n                         Hey, Ray. You still havin' dinner \n                         with us tonight?\n\n               Darnell embarrassed and humiliated, hears all this as he \n               walks away. Autumn wants to go explain, but can't in front \n               of her father.\n\n               INT. FRAT HOUSE - NIGHT\n\n               The post-game party. Not as raucous as after the opening \n               game victory. A few players are dancing, but most are sitting, \n               drinking, commiserating.\n\n                                     BUD LITE\n                              (to Alvin)\n                         Anybody seen Joe?\n\n                                     ALVIN\n                         Not yet. Probably out with Camille. \n                         Haven't seen Darnell either.\n\n               INT. UPSTAIRS BEDROOM - NIGHT\n\n               Lattimer's sitting on the bed with a coed named LESLIE. \n               They're kissing softly, light necking. Lattimer starts to \n               unbutton her blouse. She begins to demur.\n\n                                     LESLIE\n                         I think we better get back downstairs.\n\n                                     LATTIMER\n                         No, Leslie, we're just getting to \n                         know each other.\n\n                                     LESLIE\n                              (starting to get up)\n                         No, I think...\n\n               Lattimer grabs her arm roughly, pulls her back to the bed. \n               She's starting to get a little scared.\n\n                                     LATTIMER\n                         C'mon Leslie, you didn't come up \n                         here to stop now.\n\n               He tries to kiss her again, she pushes him away, starts for \n               the door. Angered, that steroid pump in his eyes, he grabs \n               her again, throws her violently on the bed. She screams.\n\n                                     LATTIMER\n                         What were you doin'? Leadin' me on?\n\n               He gets on the bed, kneels above her. She starts to struggle. \n               He slaps her across the face, rips her blouse open. Freaked, \n               she begins to scream and kick. Enraged, Lattimer slaps her \n               around, picks her up, shakes her like a rag doll, slaps her \n               some more, throws her to the floor. Picks her up again, when \n               suddenly the door BURSTS OPEN and Bud Lite and Alvin race \n               in.\n\n                                     LATTIMER\n                              (throwing Leslie on \n                              the bed again)\n                         Get outa here!\n\n               Bud Lite and Alvin charge Lattimer, try to wrestle him down, \n               but his hormone level is so high, he fights like a bull. Two \n               other players charge in and finally all four are able to \n               shackle Lattimer. He continues to struggle a bit, then gives \n               up, a panting, sweating, shaking hulk.\n\n                                     BUD\n                         This is it, man. No more 'roids. \n                         This shit has gotta stop.\n\n               Lattimer breaks down and cries.\n\n               INT. JOE'S ROOM - NIGHT\n\n               Joe lies on his bed, a bottle of vodka next to his coca-cola. \n               He stares at the larger than life cardboard stand-up of \n               himself. He takes a drink, then gets up and grabs his jacket. \n               The phone rings. He looks at it a beat, then walks out of \n               the room.\n\n               INT. CAMILLE'S ROOM - NIGHT\n\n               Camille's on the phone, waiting, the one calling Joe. She \n               listens a few more rings, hangs up, concerned.\n\n               INT. WINTERS HIGH-TECH VIDEO ROOM - NIGHT\n\n               Winters sits at the main console replaying the game-ending \n               interception over and over. The phone rings.\n\n                                     WINTERS\n                         Hello, yeh... What?!\n\n               INT. WINTERS ATHLETIC OFFICE - NIGHT\n\n               The rest of the locker room is dark except for the light on \n               in Winters' office. All the assistant coaches are there.\n\n                                     CLAYTON\n                         It looks like this will blow over. \n                         The girl's father is a big booster, \n                         contributed a lotta money. So he \n                         said they won't go to the press.\n\n                                     WINTERS\n                         He said that? The father?\n\n                                     CLAYTON\n                         Yeh, he's not exactly happy about \n                         all this, but he doesn't wanta hurt \n                         the program.\n\n                                     WINTERS\n                         We're still gonna have to suspend \n                         Lattimer.\n\n                                     HUMES\n                         What for? There aren't any charges. \n                         Nobody outside the program knows \n                         about this.\n\n                                     WINTERS\n                         He's outa control, Lyle. We can't \n                         ignore this anymore. I don't know \n                         what pisses me off more -- that he's \n                         juicin' or that he's doin' such a \n                         shitty job of hidin' it.\n\n                                     HUMES\n                         He's never tested positive. If we \n                         suspend him without proof, he could \n                         sue us for jeopardizing his draft \n                         status, his pro career.\n\n                                     WINTERS\n                         Yeh, but we can't sit and wait till \n                         he kills somebody. I hate to lose \n                         him as much as you do, but we gotta \n                         clean him up before he does somethin' \n                         that lands the whole program on \n                         probation. Plus, we have to take \n                         some action or the girl's dad is \n                         gonna start havin' second thoughts. \n                         I don't care how many checks he's \n                         written.\n\n                                     CLAYTON\n                         So what do we do?\n\n               All eyes go to Winters.\n\n                                     WINTERS\n                         Bring him down here.\n\n               INT. COACH WINTERS LOCKER ROOM OFFICE - 20 MINUTES LATER\n\n               Close on a contrite, but shaken Steve Lattimer.\n\n                                     LATTIMER\n                         Three games? Why so many?\n\n                                     WINTERS\n                         You oughta be grateful I didn't \n                         suspend you for the whole year.\n\n               Lattimer nods, he knows it's true.\n\n                                     LATTIMER\n                         What are you gonna give as the reason?\n\n                                     WINTERS\n                         We'll say you've got a hamstring \n                         pull.\n\n                                     LATTIMER\n                              (relieved)\n                         Thank you, Coach.\n\n                                     WINTERS\n                         Don't thank me. During those three \n                         weeks, you better kick the roids, \n                         cause when you come back I'm gonna \n                         personally test you before every \n                         game. No N.C.A.A. shit either. I'm \n                         gonna watch the piss go into the \n                         bottle. You got that?\n\n                                     LATTIMER\n                              (barely audible, shamed)\n                         Yes, sir.\n\n                                     WINTERS\n                         Start practicing your limp.\n\n               INT. LOCAL BAR - NIGHT\n\n               Not the 911 we saw earlier. Joe sits at a table in the back, \n               with Darnell, drinking tequila with a beer chaser. Both are \n               down in the dumps. At a nearby table there's a group of \n               TOWNIES and their GIRLFRIENDS.\n\n                                     JOE\n                         Coupla real college heroes, huh? \n                         Tearin' up the town.\n\n                                     DARNELL\n                         First time I ever lost a girl and a \n                         game on the same day. Guess I never \n                         really had the girl.\n\n               Joe looks up to see one of the townies' girls, DEBBIE, giving \n               him the once over and a little smile. Joe smiles back, not \n               really interested. Debbie's BOYFRIEND notices.\n\n                                     BOYFRIEND\n                         You know that guy?\n\n                                     DEBBI\n                         Not really...\n\n                                     BOYFRIEND\n                         Then why you smilin' at him?\n\n                                     DEBBI\n                         I don't know... he looks like that \n                         E.S.U. quarterback guy. Joe, what's \n                         his name?\n\n                                     BOYFRIEND\n                         So what? So you go and smile at him?\n\n               The boyfriend, drunk and looking for trouble, goes over to \n               Joe's table.\n\n                                     BOYFRIEND\n                         You been lookin' at my girlfriend?\n\n                                     JOE\n                              (a little drunk himself)\n                         I don't know. Which one is she?\n\n                                     BOYFRIEND\n                         Wise guy, huh? Mr. bigtime \n                         quarterback. The one who choked his \n                         ass off today. You got nothin' better \n                         to do then look at my girlfriend?\n\n               Joe says nothing.\n\n                                     BOYFRIEND\n                         Hey, Heisman, I'm talkin' to you. \n                         You too good to talk to me?\n\n                                     JOE\n                         I'm not even interested in talkin' \n                         to you.\n\n                                     BOYFRIEND\n                         You think you're a bad ass? You think \n                         my girl's hot for you? Take your \n                         pads off, you're just another pussy.\n\n               Joe gets up to go. The boyfriend grabs him, Joe pushes him \n               away. The guy charges Joe. The bar owner rushes to the phone \n               as a full scale brawl begins. Joe takes a blow, knocks the \n               boyfriend back into a table, knocking beer bottles to the \n               floor. The boyfriend falls on one, opening a deep gash in \n               his shoulder.\n\n                                     DARNELL\n                              (grabbing him)\n                         C'mon we gotta get outa here.\n\n               EXT. HIGHWAY - NIGHT\n\n               A speeding car goes by us, weaving, crossing the yellow line \n               on the curves.\n\n               INT. SPEEDING CAR - NIGHT\n\n               Joe's driving, Darnell's holding on. Suddenly we hear SIRENS. \n               Joe sees flashing lights in the rear-view mirror.\n\n                                     JOE\n                         Oh shit...\n\n               INT. COACH WINTERS' HOUSE - LATE NIGHT\n\n               Winters is asleep. The phone rings. He picks it up.\n\n                                     WINTERS\n                         What is it now?... Oh Jesus...\n\n               INT. COACH WINTERS' STADIUM OFFICE - DAY\n\n               Joe sits across the desk from Winters, just the two of them.\n\n                                     JOE\n                         The guy went for me first. What was \n                         I supposed to do?\n\n                                     WINTERS\n                         Doesn't make any difference. It made \n                         the papers, all the wire services. \n                         The guy had to go to the hospital. \n                         Worst of all they got you on drunk \n                         driving. You had a blood alcohol \n                         level .50 above the legal limit. We \n                         can't smooth that over, Joe. It'd \n                         look like we were sprayin' Pledge on \n                         bird shit. We had to agree to send \n                         you to Rehab.\n\n                                     JOE\n                         Rehab? I'll be a god-damn joke. You \n                         can't do this to me.\n\n                                     WINTERS\n                         It was the only way we could get \n                         them to drop the assault and D.W.I. \n                         You go to trial on those, we lose \n                         you for a year, and risk NCAA \n                         investigation. C'mon, lotsa athletes \n                         have been through Rehab.\n\n                                     JOE\n                         Not in the middle of the season. Not \n                         in the middle of a Heisman campaign.\n\n                                     WINTERS\n                         You'll only miss four games. You'll \n                         be back in time for the last one, \n                         Georgia Tech, and a Bowl if we get \n                         there. Plus, you've still got your \n                         senior year.\n\n                                     JOE\n                         Yeh, but what will I come back as? \n                         What kinda player?\n\n                                     WINTERS\n                         Don't worry, you'll still be the \n                         Man. You'll still be the leader of \n                         this team.\n\n               Joe doesn't believe it, but he manages a nod, as he gets up \n               to leave.\n\n                                     JOE\n                         I'm sorry, Coach.\n\n                                     WINTERS\n                         These things happen.\n\n               Joe walks on out, Winters watches him go, then slams the \n               desk in anger. Drained, he sinks back in his chair.\n\n                                     WINTERS\n                         Fuckin' kids.\n\n               EXT. CAMPUS - DAY\n\n               Darnell's walking across campus toward class. Autumn sees \n               him, calls out to him.\n\n                                     AUTUMN\n                         Darnell, wait. C'mon Darnell, I wanta \n                         talk to you.\n\n               Darnell doesn't slow up. Autumn has to run to catch up.\n\n                                     AUTUMN\n                         Where you been, I been callin' you?\n\n                                     DARNELL\n                         Been busy.\n\n                                     AUTUMN\n                         Darnell, I'm sorry about Saturday. \n                         It was an awkward situation.\n\n                                     DARNELL\n                         It wasn't awkward. It was educational. \n                         I realized how you see me. I'm good \n                         enough to tutor, to go places with, \n                         but not to tell your father about.\n\n                                     AUTUMN\n                         That's not it. It's just that my \n                         father expects me to be with somebody \n                         like Ray. He wouldn't understand us.\n\n                                     DARNELL\n                              (stopping)\n                         Why not?\n\n                                     AUTUMN\n                         I don't know... he likes Ray cause...\n\n                                     DARNELL\n                         He's a good student, he acts right... \n                         he doesn't need football. He's class \n                         and I'm not, right?\n\n                                     AUTUMN\n                         I didn't say that.\n\n                                     DARNELL\n                         You don't have to, Autumn. I'm \n                         everything your dad used to be and \n                         don't want you fallin' back into.\n\n                                     AUTUMN\n                         Darnell...\n\n                                     DARNELL\n                         You were right before, Autumn. I \n                         should have another tutor. Thanks \n                         for everything you did for me.\n\n               Darnell walks away. Autumn can only watch him go.\n\n               INT. JOE'S ROOM - DAY\n\n               Joe finishes packing his bags. He sees a picture of Camille \n               on the dresser. Picks it up, looks at it a beat, drops it in \n               the trash. He carries his Heisman cardboard standup into the \n               shower, pulls out a match and lights it. He watches it catch \n               fire, then grabs his suitcase and walks out of the room. We \n               hold on the burning standup, as flames lick at Joe's smile.\n\n               INT. REHAB CENTER - AFTERNOON\n\n               Joe is shown into his room. Bare. One cot. One dresser. He \n               drops his bag, sags onto the bed.\n\n                                     ALVIN (V.O.)\n                         Four fuckin' weeks?\n\n               INT. LOCKER ROOM - DAY\n\n               A tired and depressed group of E.S.U. football players undress \n               after practice. Bud and Alvin sit in their pads, Lattimer \n               standing in street clothes. Bud softly sings \"Don't Cry For \n               Me Argentina.\"\n\n                                     ALVIN\n                         Shit, the defense is gonna have to \n                         pitch shutouts now...\n                              (to Lattimer)\n                         and you're gone for 3. What the hell \n                         did you take that shit for?\n\n                                     LATTIMER\n                         Nobody seemed to mind when I was \n                         knockin' people's dicks in the dirt.\n\n                                     ALVIN\n                         I bust chops too. I don't have to \n                         get all fucked up.\n\n                                     LATTIMER\n                         Not everybody has the ability you \n                         do, Alvin. You do what you have to \n                         do to play.\n\n                                     ALVIN\n                         Well, you're not playin' much now \n                         are you? Shit, whole fuckin' season \n                         down the drain.\n\n               EXT. WOLF DEN STADIUM - DAY\n\n               Winters and Galen Howard are walking across the field after \n               practice. The stadium is deserted.\n\n                                     HOWARD\n                         I been talkin' to Chancellor Wilson...\n\n                                     WINTERS\n                         What's he wanta do now, cut practice \n                         down to once a week?\n\n                                     HOWARD\n                         No, he's happy with the way the \n                         season's gone so far. The Alumni \n                         have pretty much stayed off his back, \n                         but with Joe out now, it could all \n                         be up for grabs again.\n\n                                     WINTERS\n                         He thinks he's gonna have trouble \n                         marchin' the ball down the old fund-\n                         raisin' board, huh?\n\n                                     HOWARD\n                         The facts are, all we have left are \n                         freshman quarterbacks, and nothin' I \n                         saw at practice today, convinced me \n                         that any of them are ready to step \n                         in.\n\n                                     WINTERS\n                         What are you sayin?\n\n                                     HOWARD\n                         We gotta get Bobby Collins back.\n\n                                     WINTERS\n                         Wilson say that?\n\n                                     HOWARD\n                         He didn't have to.\n\n                                     WINTERS\n                         Forget it, Galen, Collins is no All-\n                         Star either.\n\n                                     HOWARD\n                         Yeh, but he's good enough to get us \n                         a split of the next four games.\n\n                                     WINTERS\n                         Look, just because you're Wilson's \n                         boy all of a sudden, doesn't mean \n                         I'm gonna let him make me look like \n                         a fuckin' whore.\n\n                                     HOWARD\n                         Don't give me that high and mighty \n                         shit. There's a lotta people on the \n                         bubble here. Four straight loses and \n                         we're out of bowl contention. How's \n                         that gonna make you look? If you're \n                         too stupid to consider your own \n                         situation, then maybe you oughta \n                         think about your assistant coaches. \n                         They've got families to feed too.\n\n               Howard walks away, pissed off, leaving Winters alone in the \n               middle of the field.\n\n               INT. BOARD OF REGENTS HEARING ROOM - DAY\n\n               The seven members of the BOARD OF REGENTS sit on one side of \n               a long rectangular table, the Chairman in the middle. On the \n               other side are coach Winters, Bobby Collins, the President \n               of the Faculty Senate, EDWARD LEARNIHAN, Academic Advisor, \n               ARTHUR SHANE, President of the Student Body, RICHARD FOWLER, \n               and Galen Howard. Fowler is addressing the board.\n\n                                     FOWLER\n                         Therefore, I respectfully submit \n                         that Bobby Collins should not be \n                         given special treatment just because \n                         he's a football player. Would a \n                         regular student get a reinstatement \n                         hearing if they'de been caught \n                         cheating? Nobody's talking about \n                         letting the girl who took the test \n                         back in.\n\n               Winters could kill this kid.\n\n                                     LEARNIHAN\n                         I think it's also instructive to \n                         look at some of the courses this \n                         young man has taken. Beginning Golf, \n                         Voice and Speech Improvement...\n\n                                     SHANE\n                         I'd like to point out that Mr. Collins \n                         was still on schedule to get his \n                         degree.\n\n                                     LEARNIHAN\n                              (pointing to Collin's \n                              transcript)\n                         In what, Swimming Pool Management?\n\n                                     CHAIRMAN\n                         Would you like to respond, Coach \n                         Winters?\n\n               Winters rises, sweating, less from nervousness than from the \n               odious nature of what he has to do.\n\n                                     WINTERS\n                         I don't know much about all this \n                         other stuff, but I do know the \n                         punishment should fit the crime. \n                         Cheating's bad, but I don't think it \n                         deserves a life sentence. Here's one \n                         of those athletes who takes college \n                         level courses, who wants to graduate. \n                         I think Bobby Collins made a big \n                         mistake, but he's already been \n                         suspended for several weeks. He's \n                         served his time. I think he deserves \n                         a second chance.\n\n                                     LEARNIHAN\n                         Like Alvin Mack? We gave him a second \n                         chance and since he's had 5 \n                         incompletes, 4 withdrawals and still \n                         reads at a fourth grade level. You're \n                         using his body to make money for the \n                         Athletic Department -- you, yourself, \n                         are making three times what the \n                         Chancellor is -- but obviously no \n                         one is making an effort to see that \n                         this kid gets an education.\n\n                                     WINTERS\n                         He's helpin' to pay for your physics \n                         lab too. If you're willin' to go \n                         without a new office, maybe I could \n                         hold him out a few games. Save his \n                         body.\n\n                                     CHAIRMAN\n                         Gentlemen...\n\n                                     SHANE\n                         Alvin was way behind in school when \n                         he got here. You can't make up for, \n                         in four years, what it took 18 to \n                         create.\n\n                                     LEARNIHAN\n                         Then he should never have been \n                         admitted in the first place. It's \n                         not fair to other students who worked \n                         hard to get here.\n\n                                     HOWARD\n                         Is it fair to exclude kids who come \n                         from inferior schools? You hold \n                         everybody to the same standards, \n                         you're discriminating against the \n                         poor kids.\n\n                                     WINTERS\n                         Most of my players are farm boys, \n                         inner-city kids. Football is their \n                         deliverance.\n\n                                     LEARNIHAN\n                         Deliverance from what? A valid \n                         education?\n\n                                     WINTERS\n                         You throw Bobby Collins and Alvin \n                         out, you take away their futures. In \n                         Alvin's case you probably cost him a \n                         couple million dollars in the pros.\n\n                                     LEARNIHAN\n                         But this is not a football vocational \n                         school. It's an Institute of Higher \n                         Learning.\n\n                                     WINTERS\n                         Yeh, but when was the last time 80,000 \n                         people showed up to watch a kid do a \n                         chemistry experiment?\n\n                                     CHAIRMAN\n                         Gentlemen, please, let's get back to \n                         the business at hand, Bobby Collins. \n                         As you know, I played football here. \n                         And I remember how hard it was to \n                         practice and then study when you're \n                         dead tired. So I have some sympathy \n                         for this young man. But I never \n                         cheated, so the real question is his \n                         character. Since you know him better \n                         than anyone else in this room; and \n                         having talked to him and observed \n                         him over the last several weeks, do \n                         you feel he's learned his lesson? In \n                         other words, can you vouch for his \n                         character?\n\n               Winters would rather cut off his own head with a razor blade.\n\n                                     WINTERS\n                              (it's killing him)\n                         Yes, sir, I can.\n\n               Bobby Collins breaks into a wide, triumphant smile.\n\n               EXT. ADMINISTRATION BUILDING - DAY\n\n               Learnihan and Winters come down the steps, their faces set. \n               As they split off:\n\n                                     LEARNIHAN\n                         Another case like this, I'll take it \n                         all the way up to the Governor.\n\n                                     WINTERS\n                         Don't mess with me, Learnihan. I'll \n                         have you teachin' Study Hall.\n\n               INT. LOCKER ROOM - DAY\n\n               Bobby Collins walks in prior to practice. His teammates gather \n               round, slap him on the back, high five etc. Winters watches \n               from his office, disgusted.\n\n               INT. COACH WINTER'S OFFICE - NIGHT\n\n               Coach Winters is in his video alcove watching footage of his \n               upcoming opponent -- it's like he's looking through it though, \n               his mind elsewhere, something boiling up inside him. Suddenly, \n               he smashes his fist into the screen, breaking it into pieces. \n               His hand bleeds. He doesn't care. He just sits there and \n               seethes.\n\n               INT. CAMILLE'S ROOM - DAY\n\n               Camille's on the phone.\n\n                                     CAMILLE\n                         Hello, my name is Camille Schaeffer. \n                         I'd like to speak to Joe Kane.\n\n               INT. JOE'S ROOM IN REHAB CENTER - DAY\n\n               Joe is aimlessly flipping cards toward a wastebasket. A NURSE \n               knocks on his door.\n\n                                     NURSE\n                         You've got a phone call. A Camille \n                         Schaeffer.\n\n               Joe says nothing, not wanting to deal with this.\n\n                                     NURSE\n                         She says she's your girlfriend\n\n                                     JOE\n                         I don't want to talk to her.\n\n                                     NURSE\n                         You sure?\n\n                                     JOE\n                         Yeh.\n\n               The nurse leaves. Joe gets up, goes to the wall, and starts \n               pounding it with his right hand.\n\n               INT. CAMILLE'S ROOM - DAY\n\n                                     NURSE (V.O.)\n                         I'm sorry, he doesn't wish to speak \n                         to you right now.\n\n               Crushed and angry, Camille hangs up.\n\n               INT. ATHLETIC DORM HALL - DAY\n\n               Bud Lite is watching television. Louanne enters on her way \n               to Bobby Collins' room, carrying an armload of neatly-pressed \n               laundry. But Lite gets up to bar her way.\n\n                                     BUD\n                         Hey, Louanne, how ya' doin?\n\n                                     LOUANNE\n                         Fine, Bud, ya know. Goin to J.C., \n                         hopin' to get back in here next year. \n                         Just came by to give Bobby some \n                         laundry I did for him.\n\n                                     BUD\n                         You two seein' each other again?\n\n                                     LOUANNE\n                         Yeh, he was even talking about us \n                         gettin' a place off campus together, \n                         until he got reinstated. I don't \n                         know how I woulda told my dad.\n\n               Bud just nods blankly. Louanne starts to head for Bobby's \n               room.\n\n                                     BUD\n                         Ah, Louanne...\n                              (pained to say it)\n                         I wouldn't go in there right now.\n\n                                     LOUANNE\n                         Why not?\n\n               Bud doesn't have the heart to tell her. She finally realizes \n               Bobby's with another girl.\n\n                                     LOUANNE\n                         Ah. Guess I'm pretty stupid when it \n                         comes to men. I never learn, do I?\n\n                                     BUD\n                         I think maybe men are just stupid \n                         when it comes to you. If you ever \n                         feel like, ya know, just talkin' \n                         sometime, gettin' a beer -- let me \n                         know. My schedule's pretty open.\n\n                                     LOUANNE\n                         Thanks, Bud\n                              (handing him the \n                              clothes)\n                         Give him these, will ya?\n\n               Bud nods. Louanne, fighting back tears, walks back down the \n               hall with as much dignity as she can muster.\n\n               INT. JOE'S REHAB CENTER - DAY\n\n               Winters comes to the door, hesitates, walks in and finds Joe \n               huddled on his bed. Shivering.\n\n                                     WINTERS\n                         Get up. I wanta talk to you.\n\n               Joe looks resentful but makes an effort and sits up.\n\n                                     WINTERS\n                         Don't sit up. Stand up. If you can.\n\n               Joe gets unsteadily to his feet. He feels sick. Winters \n               reaches out to shake hands. Joe does not reciprocate. Hides \n               his right hand behind his body.\n\n                                     WINTERS\n                         What's the matter, Joe? You won't \n                         shake hands with me.\n                              (Joe is silent)\n                         You don't want me to see your hand, \n                         do you?\n                              (more silence)\n                         So I guess what I heard was true, \n                         huh? You been poundin' the walls \n                         with your passin' hand, right?\n                              (silence)\n                         I tell you what, Joe, you want to \n                         hit somethin', hit me.\n\n               Joe doesn't move.\n\n                                     WINTERS\n                         I said hit me. I'm the one who put \n                         you in here. Don't hit the damn wall. \n                         It ain't the wall's fault. Hit me! \n                         Go on, hit me right now!\n\n               Joe is angry but he doesn't want to do anything about it.\n\n                                     WINTERS\n                         Who else you wanta hit, huh? you're \n                         daddy maybe? Cause he's a no-show \n                         prick? Well, I'm a daddy, too, and \n                         not a very good one at that. So just \n                         hit me instead! I'll take your daddy's \n                         beatin' for him. Go on, you want to. \n                         Hit me, damnit!\n\n               Joe shakes his head.\n\n                                     WINTERS\n                              (pushes Joe in the \n                              chest)\n                         Hit me! I'm not gonna leave you alone \n                         until you hit me.\n                              (shakes Joe by \n                              shoulders)\n                         The guys'll thank you. They've always \n                         wanted to do it. So do it now, damnit! \n                         Do it!\n\n               Joe sinks to his knees. Winters stares down at him, then \n               kneels also, his own anger and frustration draining away.\n\n                                     WINTERS\n                         O.K., Joe, it's o.k. I guess I need \n                         it more than you do.\n                              (pause)\n                         You gotta quit beatin' up on yourself. \n                         Let me see that hand.\n\n               Joe reveals his hand. It's barked and cut, but not badly \n               swollen.\n\n                                     WINTERS\n                         It's o.k.\n                              (playfully)\n                         You can still throw with it, you \n                         fuckin' mook.\n                              (pause)\n                         Look, the nurses say this is the \n                         toughest time for you right now. I \n                         thought I'd stick around a little, \n                         case you wanta play some cards, pick \n                         a fight with the wall again, \n                         whatever...\n\n                                     JOE\n                         You don't have to.\n\n                                     WINTERS\n                         Yes I do.\n\n               INT. STEVE LATTIMER'S ROOM - NIGHT\n\n               Lattimer fills a bag with all his steroid paraphernalia. He \n               carries it to his bathroom where he slowly empties it into \n               his toilet. Syringes, vials and bottles of pills all tumble \n               into the water. He flushes.\n\n                                                               DISSOLVE TO:\n\n               INT. JOE'S ROOM IN REHAB CENTER - MORNING\n\n               The sun shines through the window. Joe wakes up, raises up, \n               looks over at Winters who is asleep in a chair. Winters \n               rouses. Joe gives him a little smile, he's allright. Winters \n               gives him a nod of approval.\n\n               MUSIC UP. BEGIN A SERIES OF SHOTS\n\n               detailing the Timberwolves progress over the next four games.\n\n               ON FIELD\n\n               1) Players shaking hands at midfield after the game. The \n               scoreboard reads E.S.U. 14 Boston College 10.\n\n               INT. STUDY HALL\n\n               2) Darnell in study hall, with his new tutor concentrating \n               on her explanation, applying himself.\n\n               ON SIDELINE - DAY\n\n               3) Steve Lattimer, in street clothes, paces the sidelines, \n               jumping up and down in frustration, his hamstring bandaged \n               to sell the injury ruse. He catches himself, gets back on \n               his crutches. A newspaper fades up through the shot. It reads \n               \"Wolves Offense Fires Blanks in 13-0 Loss to Texas.\"\n\n               INT. CAFE - NIGHT\n\n               4) Darnell sits in a cafe, drinking coffee and studying. Ray \n               comes in, his arm around a co-ed, MONICA. They buy a pastry \n               and leave, not having seen Darnell. Darnell ponders this a \n               second, goes back to studying.\n\n               INT. REHAB CENTER - DAY\n\n               5) A group of patients is gathered around a T.V. set in the \n               Rehab Center, watching a pre-game show. One goes to Joe's \n               room, where Joe's lying on his cot.\n\n                                     PATIENT\n                         Hey, Joe, don't you wanta watch the \n                         game? It's on cable.\n\n                                     JOE\n                         No thanks.\n\n               Joe leans back, staring at the ceiling.\n\n               ON T.V. SCREEN\n\n               6) Sportscaster DALLAS PERRY is holding forth on the local \n               evening news.\n\n                                     PERRY\n                         E.S.U. on the strength of a 62 yard \n                         touchdown run by freshman Darnell \n                         Jefferson, squeaked by the North \n                         Carolina Tarheels today, 14 to 13, \n                         keeping their bowl hopes alive.\n\n               EXT. CAMPUS NIGHT\n\n               7) Darnell, with his books, on the way to the library, passes \n               the frat house where the victory party is in progress. He \n               sees Ray and Autumn walking together. Autumn sees him, her \n               face lights up. He gives her a slight smile, keeps walking. \n               She watches him with a certain longing.\n\n               INT. LIBRARY - LATE NIGHT\n\n               8) Darnell, alone in the library, late at night, studying.\n\n               INT. LOCKER ROOM - DAY\n\n               9) Lattimer, carrying his gear bag, walks into the locker \n               room. His teammates come over to shake his hand, slap him on \n               the back, welcome him back to the team.\n\n               MUSIC ENDS\n\n               INT. JOE'S REHAB CENTER ROOM - NIGHT\n\n               Joe sits on his bed listening to the E.S.U. broadcast.\n\n                                     HARVEY (V.O.)\n                         E.S.U. hoping to get past a tough \n                         Iowa Hawkeyes team in their last \n                         game before the return of star \n                         quarterback, Joe Kane.\n\n               EXT. KINNICK STADIUM - NIGHT\n\n               The E.S.U. defense is on the field. Alvin moves up opposite \n               the OFFENSIVE GUARD.\n\n                                     ALVIN\n                         I know you, motherfucker. You're the \n                         prick who got my little sister \n                         pregnant. We ain't seen you around \n                         lately. Where you been, huh? Answer \n                         me, motherfucker, or I'm gonna peel \n                         your cap.\n\n               The ball is hiked. Iowa runs a sweep left. Lattimer tries to \n               get outside to contain, but is blocked by the fullback, who \n               goes low and cuts his legs out from under him.\n\n                                     WINTERS\n                         Shit, Lattimer...\n\n               Alvin pursues the play as the ballcarrier heads for the \n               corner, then suddenly cuts back. Alvin has overrun the play \n               slightly. We go to SLOW MOTION as he turns and is hit with a \n               wicked CRACK-BACK BLOCK by the guard he taunted. Alvin's leg \n               flexes at a horrifying angle. We HEAR THE SNAP of bone and \n               tendon, as Alvin plummets to the ground, writhing in pain, \n               grabbing his left leg.\n\n                                     WINTERS\n                         Oh, no...\n\n               The doctor and trainers sprint out to the field.\n\n               INT. JOE'S REHAB CENTER ROOM - NIGHT\n\n               We move in on Joe's face, as Harvey is heard on the radio in \n               the b.g.\n\n                                     HARVEY (V.O.)\n                         Oh, boy, this does not look good, \n                         Harmon. They're bringing the \n                         stretchers out...\n\n               Joe's eyes close. He knows what this means.\n\n               EXT. THE FIELD - NIGHT\n\n               Alvin is being strapped on the stretcher.\n\n                                     ALVIN\n                              (wailing in pain)\n                         Oh, shit, oh shit, I'll kill that \n                         motherfucker. I'll... Oh shit...\n\n               EXT. KINNICK STADIUM - NIGHT\n\n               An ambulance carrying Alvin emerges from the stadium. We \n               hear CHEERING inside, the SIREN outside.\n\n                                     HARVEY (V.O.)\n                         Twelve seconds left, Iowa driving \n                         for the winning touchdown. Fourth \n                         and goal at the one. E.S.U. trying \n                         to hold on without their star middle \n                         linebacker, Alvin Mack.\n\n               EXT. THE FIELD AGAIN - NIGHT\n\n               The E.S.U. defensive line digs in. Lattimer tries to suck up \n               his remaining strength.\n\n               Iowa runs a blast to Lattimer's side. He fights through one \n               block, the ballcarrier coming right toward him. They meet in \n               a titanic collision at the goal line. The back keeps driving, \n               twisting. Lattimer tries to hold him, but weaker than he was \n               on steroids, is unable to. The back falls over the goal line. \n               Touchdown. IOWA 13 E.S.U. 10.\n\n               As the Iowa players celebrate all around him, Lattimer sits \n               where he fell, a beaten and humiliated young man.\n\n                                     REPORTER (V.O.)\n                         Coach, you've lost two of your last \n                         four.\n\n               INT. INTERVIEW ROOM UNDER STADIUM - NIGHT\n\n               Coach Winters faces the press.\n\n                                     REPORTER\n                         Why do your teams seem to nose dive \n                         at the end of the last couple seasons?\n\n                                     COACH WINTERS\n                         This was a tough loss, but this ain't \n                         any nose dive. We've had some key \n                         players out, but if we win next week, \n                         we'll still win the conference and \n                         go to a major bowl on New Year's \n                         Day. I mean, I know you guys can't \n                         write, but I thought you could at \n                         least count.\n\n               INT. HOSPITAL ROOM - EVENING\n\n               Alvin lies on a bed, his leg bandaged and elevated. He's \n               still a little groggy from anesthetic. Coach Winters stands \n               beside him.\n\n                                     WINTERS\n                         You look good, Alvin.\n\n                                     ALVIN\n                         Yeh, I feel o.k.\n\n                                     WINTERS\n                         Any of the guys been down yet?\n\n                                     ALVIN\n                         They called.\n\n                                     WINTERS\n                         Hell, you know how football players \n                         are about hospitals and injuries.\n\n                                     ALVIN\n                         Yeh.\n\n               Several beats of silence. Then:\n\n                                     ALVIN\n                         I'm never gonna play again, am I?\n\n                                     WINTERS\n                         Doctors aren't always right, Alvin... \n                         but I just want you to know... you're \n                         the best defensive football player I \n                         ever coached.\n\n               Alvin nods. Winters comes forward, hugs him around the head, \n               gives him a smile, walks out. Tears brim in Winters eyes as \n               he leaves. Alvin's head goes back against the pillow. Tears \n               aren't brimming here. They're rolling down his cheeks.\n\n               MUSIC BEGINS\n\n               EXT. REHAB CENTER - MORNING\n\n               Joe walks out with his suitcase. Coach Winters waits for \n               him. Shakes his hand. They get in the car.\n\n                                     WINTERS (V.O.)\n                         Congratulations. I'm proud of you, \n                         Joe.\n\n               INT. CAR - DAY\n\n                                     WINTERS\n                         I know you had a difficult time. \n                         Michigan is easy, right? Bourbon is \n                         tough.\n\n                                     JOE\n                         Scotch.\n\n               They share a laugh. Winters pulls out two sets of round trip \n               airline tickets.\n\n                                     WINTERS\n                         I got somethin' for ya. Coupla round \n                         trip tickets. Go see your dad. Get \n                         it cleaned up.\n\n               Joe takes the tickets, just looks at him.\n\n               INT. STEVE LATTIMER'S ROOM - NIGHT\n\n                                     LATTIMER\n                              (on the phone)\n                         I'm gonna have to take a test with \n                         the coach right there. You sure you \n                         got somethin' better than blockers?\n\n                                     DEALER (V.O.)\n                         Much better. This guy is foolproof. \n                         See ya Saturday.\n\n               Lattimer hangs up, picks up a HYPODERMIC. Stares at it a \n               second, sweat beading on his forehead. Then plunges it an \n               inch deep into his thigh. Pulls it out, sits on the bed a \n               beat, then picks up a barbell and begins to pump it furiously, \n               biceps bulging.\n\n               MUSIC ENDS\n\n               INT. COACH WINTER'S OFFICE - AFTERNOON\n\n               The coach is facing Ray and Darnell across his desk.\n\n                                     WINTERS\n                         I wanta do something different for \n                         this game. Try to maximize our speed, \n                         but keep you both in the lineup at \n                         the same time. Ray, I'm moving you \n                         to fullback. Darnell, you're startin' \n                         at tail.\n\n               Ray is stunned, Darnell elated, but neither says a word.\n\n                                     WINTERS\n                         Ray, you'll be carrying the ball \n                         less and blocking more, but they'll \n                         still have to respect your running \n                         and pass-catching ability. Not \n                         everybody can make a transition like \n                         this. You think you can handle it?\n\n                                     RAY\n                              (tight lipped)\n                         Yes, sir.\n\n                                     WINTERS\n                         Good. We can't afford any hang dogs.\n\n               EXT. TENNIS COURTS - DAY\n\n               Camille comes off the court, after tennis practice. She's \n               surprised to find Joe waiting for her.\n\n                                     JOE\n                         Hello, Camille.\n\n                                     CAMILLE\n                              (cool)\n                         Hello, Joe. You allright now?\n\n                                     JOE\n                         Yeh... yeh, I think so.\n\n                                     CAMILLE\n                         Good, I'm happy for you.\n\n               She starts to walk away, heading for the bike racks.\n\n                                     JOE\n                         Camille, hold on, O.K.? I'm sorry \n                         that I didn't want... that I couldn't \n                         see you.\n\n                                     CAMILLE\n                         You couldn't even talk to me. What \n                         happened to \"there's somethin' goin' \n                         on between you and me\"?\n\n               Camille gets on her bike...\n\n                                     JOE\n                         C'mon, Camille, I was embarrassed. I \n                         couldn't...\n\n               and pedals off.\n\n                                     JOE\n                              (shouting after her)\n                         I couldn't understand why anybody \n                         would wanta talk to me. Camille!\n\n               She just keeps on going.\n\n               EXT. PENNSYLVANIA STEEL TOWN - DAY\n\n               A bus comes up the hill toward us, on the main street of \n               Joe's sooty, little home town, the huge stacks of moribund \n               steel works filling the sky in the background. The bus stops \n               at a corner. Joe steps off. No bag. He's not planning on \n               staying long.\n\n               EXT. JOE'S HOUSE - DAY\n\n               Joe goes to the front door. Knocks, gets no answer, pushes \n               the door open, walks through the messy, cluttered house to \n               the back porch. Seated in a metal folding chair, smoking a \n               cigarette, looking out at the yard is Joe's DAD. He's got a \n               couple days growth of beard, and although not drunk now, he \n               has the look of one.\n\n                                     JOE\n                         How ya doin', Dad?\n\n                                     DAD\n                              (surprised to see him)\n                         Joe! What's this? They throw you \n                         out?\n\n                                     JOE\n                         No.\n\n                                     JOE'S DAD\n                         I heard about your little set-to. \n                         They had it on the news here.\n\n                                     JOE\n                         Yeh, they sent me to rehab.\n\n                                     JOE'S DAD\n                         We know what that's worth. Your \n                         brother's been through it three times.\n\n               Joe nods sadly.\n\n                                     JOE'S DAD\n                         So what are you doin' here?\n\n                                     JOE\n                         I've been thinking about some things, \n                         Dad.\n\n                                     JOE'S DAD\n                         That's what that damn rehab'll do. \n                         Make you think about a lotta things \n                         you can't do nothing' about.\n\n                                     JOE\n                         I kinda been wonderin' why you never \n                         came to any of my games. All those \n                         years.\n\n                                     JOE'S DAD\n                         Oh, I don't know. I guess I didn't \n                         wanta make you nervous. You mighta \n                         tried too hard and screwed up.\n\n                                     JOE\n                         Or I mighta done real well. Which \n                         woulda been harder on you, Dad?\n\n                                     JOE'S DAD\n                              (sensing the anger)\n                         What do you mean?\n\n                                     JOE\n                         Mighta made you feel bad. Like maybe \n                         it wasn't written someplace that we \n                         all gotta go on our ass. Like maybe \n                         you coulda done somethin' more, if \n                         you'de tried a little harder.\n\n                                     JOE'S DAD\n                         Or maybe I didn't wanta see you \n                         gettin' all excited, all pumped up \n                         with pride, when I knew one day it \n                         would all come crashin' down. Just \n                         like it did.\n\n                                     JOE\n                         I think I spent the last couple years \n                         hopin' I'd die before that day. But \n                         you know what Dad? That day came and \n                         I'm still here. And I got one more \n                         game this year. I don't know how \n                         well I'll play or even how much, but \n                         I want you there.\n\n                                     JOE'S DAD\n                         How would you feel introducing your \n                         drunk dad to all your friends? You \n                         think about that?\n\n                                     JOE\n                         I could live with it, if you could.\n                              (handing him a ticket)\n                         Here's a ticket. Section 2, Row 6. \n                         Fifty yard line. If you don't come, \n                         I'll never ask you again.\n\n                                     JOE'S DAD\n                         O.K., Joey. And good luck.\n\n               They give each other a short, quick hug. Nothing sentimental. \n               Joe walks back through the house. His dad stares out at the \n               yard.\n\n               INT. COLLEGE LIBRARY - NIGHT\n\n               Darnell is up late again, studying at one of the tables. He \n               hears footsteps, becomes aware of the presence of another \n               person. He looks up to see Autumn.\n\n                                     DARNELL\n                         Hey, Autumn. How's Ray?\n\n                                     AUTUMN\n                         Don't know. Haven't seen him since \n                         the night I saw you. He'd been goin' \n                         out.\n\n                                     DARNELL\n                         Monica Lambert.\n\n                                     AUTUMN\n                         You knew? Why didn't you tell me?\n\n                                     DARNELL\n                         Didn't wanta win you over that way.\n\n               Silence. Darnell looks back at his books.\n\n                                     AUTUMN\n                         I just wondered how your studying \n                         was comin'. You ready for tomorrow?\n\n                                     DARNELL\n                         The test? I hope so. I been workin' \n                         pretty hard.\n\n                                     AUTUMN\n                         Good...\n                              (sitting down)\n                         I talked to my dad last night.\n\n                                     DARNELL\n                         Oh, yeah? How's he doin?\n\n                                     AUTUMN\n                         Fine. We talked about you.\n\n                                     DARNELL\n                         What did you say?\n\n                                     AUTUMN\n                              (eyes brimming)\n                         I told him I'd gone out with you... \n                         I told him I wished I could still go \n                         bowling.\n\n               Darnell gets up and pulls her to her feet. He hugs her.\n\n               MUSIC BEGINS\n\n               INT. EXAMINATION ROOM - AFTERNOON\n\n               Darnell is bent over his test booklet. He writes furiously, \n               stops to think, starts writing again.\n\n               EXT. PRACTICE FIELD - DAY\n\n               Joe takes a snap, fades to pass, throws an out. The ball \n               flutters badly, falling short.\n\n                                     CLAYTON\n                         He's rusty. I doubt if we can start \n                         him.\n\n                                     WINTERS\n                              (simmering)\n                         He's worse than that. He's outa shape.\n                              (blowing his whistle)\n                         All right, that's enough for today. \n                         Practice is cancelled. Everybody off \n                         the field, but Kane.\n                              (the players hesitate)\n                         C'mon what the hell are you standin' \n                         around lookin' at? Get outa here.\n\n               The players, surprised at this turn of events, begin to file \n               off. Even the coaches are baffled. Winters walks over to \n               Joe, who has no idea what this is about.\n\n                                     WINTERS\n                         Didn't do much while you were in \n                         there, did ya?\n\n                                     JOE\n                         Well, we didn't exactly have a team...\n\n                                     WINTERS\n                         You could've worked out on your own.\n\n                                     JOE\n                         I had some other things to worry \n                         about...\n\n                                     WINTERS\n                         Well, we're gonna make up for lost \n                         time. We'll start by hoppin' the \n                         steps.\n\n                                     JOE\n                         Hoppin' the steps?! What, you're \n                         gonna punish me now.\n\n                                     WINTERS\n                         Don't talk back to me, Joe. I'll \n                         kick your ass. I went easy on you, \n                         'cause you had to get through detox, \n                         but that's out to sea now. You let \n                         this team down; you let this program \n                         down. Start those steps. Right leg.\n\n               ANGLE ON JOE - STADIUM\n\n               Hopping up the stadium steps on his right foot, laboring as \n               he passes Winters, halfway up.\n\n                                     WINTERS\n                         Now the left.\n\n               Joe switches to his left foot and continues hopping up the \n               steps, his quadriceps bursting with pain.\n\n                                                               DISSOLVE TO:\n\n               JOE - LATER - STADIUM\n\n               hanging by his arms, moving hand over hand along the crossbar \n               of the goalpost, panting with fatigue, Winters watching from \n               below.\n\n                                                               DISSOLVE TO:\n\n               JOE - AT SUNSET - STADIUM\n\n               Bone weary now. Winters has him run 20 yards, get down and \n               do 10 pushups, run another 20 yards, do 10 more pushups etc.\n\n               Joe staggers the 20 yards, drops to do his pushups, can only \n               do 4. Winters yanks him to his feet, pushes him forward to \n               run again.\n\n                                     WINTERS\n                         70 guys. 70 guys who busted their \n                         butts all year. Because of you they \n                         might not win the conference. Because \n                         of you they might not go to a bowl.\n\n                                     JOE\n                              (barely able to stand)\n                         I didn't wanna leave... I just screwed \n                         up...\n\n                                     WINTERS\n                         You dogged on them.\n\n                                     JOE\n                              (stopping, exhausted)\n                         No, no I never dogged. I worked my \n                         ass off. I played hard...\n\n                                     WINTERS\n                              (pushing him forward)\n                         Then you shoulda stayed in shape. \n                         Keep runnin', dammit.\n\n                                     JOE\n                              (wobbling, starting \n                              to break down)\n                         I always played hard. I gave my \n                         everything for you. When you came to \n                         the Center, I thought you were really \n                         worried about me. But you don't give \n                         a shit. We're all just a buncha sled \n                         dogs. If you had another guy who \n                         could throw, you'da left me in the \n                         fuckin' hospital.\n                              (falling to his knees, \n                              sobbing)\n                         The only thing that matters is the \n                         program, the god-damn program.\n\n               Winters pushes Joe down to do his pushups. Joe has to strain \n               mightily to do two.\n\n                                     WINTERS\n                         Nobody forced you to play football, \n                         Joe. Not me, not the program, nobody. \n                         But when you sign on, you commit \n                         yourself to pay the price, to do \n                         whatever it takes. Well, you haven't \n                         paid the price yet. You still owe \n                         this team. You owe this team big-\n                         time.\n                              (walking away)\n                         Get a shower.\n\n               Joe tries to get up, but collapses face down on the turf, as \n               Winters continues to walk away.\n\n               INT. LOW RENT DOCTOR'S OFFICE - MORNING\n\n               Lattimer lies on a table, a CATHETER TUBE going into his \n               side. A DOCTOR'S AIDE supervises. Lattimer's dealer is there.\n\n                                     LATTIMER\n                         What's this doin?\n\n                                     DEALER\n                         Takin' doped urine outa your bladder \n                         and puttin clean back in. Call it an \n                         oil change.\n\n               INT. LOCKER ROOM - BEFORE THE GAME\n\n               Coach Winters watches unknowingly as Lattimer pees the \n               catheterized urine into a cup.\n\n               MUSIC ENDS\n\n               INT. LOCKER ROOM - JUST BEFORE THE GAME\n\n               The team is gathered around. Conspicuous among them is \n               Lattimer, who's painted his face like a skeleton. Coach \n               Winters is whipping them up with a pre-game rant.\n\n                                     WINTERS\n                         Gotta get it done today, boys. Gotta \n                         ring that bell. 60 minutes. 60 minutes \n                         of mean. No prisoners. No mercy. \n                         Nothin' but snot bubbles. Gotta ring \n                         that bell, gotta ring that \n                         Championship bell.\n\n                                     LATTIMER\n                              (shouting)\n                         Ding Motherfucking Dong!!\n\n               Pumped to the gills, the E.S.U. team explodes in yells and \n               races out into the tunnel. The YELLING continues OVER and \n               mixes with the CHEERING OF THE CROWD as:\n\n               EXT. WOLF DEN STADIUM - AFTERNOON\n\n                                     HARVEY (V.O.)\n                         Wolves movin' left to right on your \n                         radio dial. Looking to generate some \n                         offense. They've been up and down \n                         the last few weeks.\n\n               ANGLE ON BOBBY COLLINS in the huddle.\n\n                                     COLLINS\n                         28 Thunder right. On go.\n\n               They break and the E.S.U. offense comes to the line. Collins \n               calls signals. We go to SLOW MOTION as he fades to pass. \n               Darnell fakes a block, then rolls out for a screen pass. \n               Georgia Tech's defensive line comes hard. Bobby flips the \n               ball over the charging defenders. Darnell catches it, gets a \n               good block from Bud Lite, then tucks in behind Ray who is \n               out ahead blocking.\n\n               There's only one linebacker to beat and Darnell will be into \n               the secondary. Figuring Ray will block the guy, Darnell begins \n               to look for the safeties. Ray, however, barely brushes the \n               linebacker, who doesn't even break stride. He lowers his \n               head, and drives into Darnell, his helmet hitting the \n               football. Fumble! There's a scramble. The Yellow Jackets \n               free safety comes up with it.\n\n               REGULAR SPEED\n\n               The crowd and the E.S.U. bench, quickly deflated, sit back \n               down. Darnell gets to his feet, glares at Ray, but says \n               nothing. He knows Ray tanked the block.\n\n               INT. ALVIN MACK'S SHACK - DAY\n\n               Alvin sits alone in the \"living room\", listening to the E.S.U. \n               game on the radio, his leg propped up on an apple crate. His \n               mother mends a pair of jeans in the b.g.\n\n                                     HARVEY (V.O.)\n                         So the Wolves defense has held after \n                         the fumble, and the Yellow Jackets \n                         will opt for the field goal. Around \n                         a 34 yarder. Ball is down, it's away, \n                         it's long enough. And good! Georgia \n                         Tech jumps out on top 3-0.\n\n               Alvin's mother looks to see if there's any reaction from \n               Alvin. There's none.\n\n               EXT. WOLF DEN STADIUM - AFTERNOON\n\n               Bobby Collins fades back to pass, is rushed, throws a quick \n               sideline, but it's a little short. The Yellow Jackets' \n               CORNERBACK sprints up, intercepts it and runs 30 yards down \n               the sideline for a touchdown.\n\n                                     HARVEY (V.O.)\n                         Collins back to pass, rushed, now \n                         fires out in the flat. It's picked \n                         off by Hill. Down the sideline. He's \n                         gonna go in untouched. Touchdown, \n                         Georgia Tech.\n\n               INT. E.S.U. LOCKER ROOM - AFTERNOON\n\n               A discouraged bunch of E.S.U. players drag into the locker \n               room. Some swear, some bang their lockers.\n\n                                     LATTIMER\n                         C'mon guys, we're only down ten. \n                         Let's get our fuckin' shit together.\n\n               Darnell marches over to Ray's locker.\n\n                                     DARNELL\n                         You missed that block on purpose, \n                         didn't you, asshole.\n\n                                     RAY\n                         You're full of shit. You fumble, you \n                         try to blame me.\n\n                                     DARNELL\n                         It's Autumn isn't it? That's what \n                         this is all about.\n\n                                     RAY\n                         The hell with Autumn. You just can't \n                         take a hit.\n\n               Infuriated, Darnell goes for Ray, and they start swinging. \n               Darnell tackles Ray, they roll on the floor, still swinging, \n               trying to beat the shit out of each other. Finally, several \n               players manage to pull them apart. Coach Winters charges \n               over.\n\n                                     WINTERS\n                         Don't tell me who started it. I don't \n                         care. All I care about is this \n                         football team. We win together. We \n                         lose together. So whatever your \n                         problem is, get over it. I don't \n                         want any more of this shit. \n                         Understand?\n\n                                     DARNELL AND RAY\n                         Yes, sir.\n\n                                     WINTERS\n                         As for the rest of you guys. Here's \n                         what I think of the way you played.\n\n               Winters walks over to a table set up with 75 cups of Orange \n               Juice and Gatorade. He swipes the cups off the table creating \n               a small flood on the floor. Then turns the table over. The \n               players are shocked. They've seldom seen him like this.\n\n                                     WINTERS\n                              (pointing toward the \n                              Yellow Jackets' locker \n                              room)\n                         They're laughin' at you over there. \n                         Makin' plans for the evening. They \n                         never dreamed it'd be this easy. You \n                         guys are nothin' but bugs splattered \n                         on their windshield. You better stock \n                         up on potato chips, 'cause you're \n                         gonna be watching a lotta T.V. on \n                         New Years Day.\n\n               Winters walks away, as the players are left to contemplate \n               their mistakes. Winters goes over to Joe.\n\n                                     WINTERS\n                         Get warm, Joe. You're startin' the \n                         second half.\n\n               Joe nods, excited but uncertain. Winters moves on to Ray \n               Griffen.\n\n                                     WINTERS\n                         By the way... don't let me see you \n                         miss anymore blocks.\n\n               EXT. WOLF DEN STADIUM - AFTERNOON\n\n               The E.S.U. players return to their bench for the start of \n               the second half, gather in a circle. Joe looks up in the \n               stands to the seat he reserved for his father. It's empty.\n\n               BEGIN A SERIES OF SHOTS:\n\n               1) Joe takes the snap from center, fumbles it, falls on it.\n\n               2) Joe looks to throw over the middle, waits too long, is \n               sacked.\n\n               3) Joe underthrows Darnell coming out of the backfield.\n\n               EXT. WOLF DEN STADIUM - AFTERNOON\n\n               Clayton approaches Winters on the sideline.\n\n                                     CLAYTON\n                         Joe's too tentative, too cautious \n                         out there. He seems flat. Maybe we \n                         oughta give Collins another shot.\n\n                                     WINTERS\n                         Joe just needs to get the feel back. \n                         He'll be allright.\n\n                                     CLAYTON\n                         Sam, we can't afford to wait...\n\n                                     WINTERS\n                              (snapping)\n                         I said he'll be allright.\n\n               ANGLE ON JOE\n\n                                     HARVEY (V.O.)\n                         5:51 to go. Georgia Tech up 10 to \n                         nothing. The Wolves are gonna have \n                         to find some offense in a hurry here. \n                         Their defense has been keepin' them \n                         in it.\n\n               As he starts off the bench for the field, Coach Winters comes \n               up to him.\n\n                                     WINTERS\n                         Joe, I know that Rehab was good for \n                         you. Got rid of a lotta bad habits. \n                         But what about the rest of you? What \n                         happened to the Joe Kane that used \n                         to take command of this team, the \n                         Joe Kane these guys i'd run through \n                         a bulldozer for? They put him out \n                         with the trash? What are you waitin' \n                         for, somebody to feel sorry for you \n                         cause you've had some problems? Nobody \n                         in this stadium gives a shit. It's \n                         time to step up, Joe. Time to sit at \n                         the head of the Table.\n\n               ANGLE ON THE E.S.U. OFFENSIVE HUDDLE\n\n               As Joe comes into the huddle. He's all business now.\n\n                                     JOE\n                         All right, we've held these guys up \n                         long enough. Give me time back here, \n                         and I'll rip 'em apart. 16 shift, \n                         green, bolt. First sound.\n\n               Joe brings the offense to the line of scrimmage, yells \"Go!\" \n               The ball is snapped, Joe drops back, hits Darnell on the \n               sideline. First down. In quick succession, we see Joe:\n\n               1) Complete a 15 yarder to Ray over the middle.\n\n               2) Fades to pass, is rushed. Forced out of the pocket, \n               scrambles for his life, manages to get down to the 4 yard \n               line. He gets up, surveys the distance to pay dirt.\n\n                                     HARVEY (V.O.)\n                         Nice bit of scrambling by Kane to \n                         get it to the four, but it's gonna \n                         bring up fourth and goal. No doubt \n                         about it, with 3:45 they've gotta go \n                         for it here, if they're gonna get \n                         back in this game.\n\n               ANGLE ON THE SIDELINE\n\n               Winters puts his arm around Ray who will take the play into \n               the huddle.\n\n                                     RAY\n                         Give it to me up the gut, Coach. \n                         They've been ignoring me. I know I \n                         can score.\n\n                                     WINTERS\n                         No, we're gonna go with the sweep.\n\n               Winters gives Ray a shove and he runs onto the field. Ray is \n               upset, angry. He swears to himself.\n\n               ANGLE ON FIELD\n\n               Ray enters the huddle, whispers in Joe's ear.\n\n                                     JOE\n                         28 Thunder right. On 2.\n\n               The team breaks out, comes to the line. Joe looks over the \n               defense, screams signals as the CROWD NOISE is building.\n\n               We go to SLOW MOTION as the ball is snapped. Ray takes one \n               step forward then turns right, leading the play. Joe pitches \n               to Darnell who follows Ray. Georgia Tech's outside linebacker \n               comes up to stop the play. Ray stumbles before he can make \n               the block. He drops out of our picture.\n\n                                     DARNELL\n                         Shit!\n\n               Darnell is forced to go wider toward the sideline. The \n               linebacker and cornerback are closing, both have the angle \n               on him. Darnell starts to cut back. He lowers his shoulder \n               to take the linebacker's blow. Suddenly, out of nowhere, Ray \n               reappears and throws a devastating block on the linebacker, \n               knocking him back into the cornerback, taking them both out. \n               Darnell cuts it up and blasts over the safety at the goal \n               line. Touchdown, E.S.U.\n\n               The stands erupt. It's the first thing they've had to cheer \n               about all day. Winters just looks at the clock, goes over to \n               talk to his defense.\n\n               Darnell foregoes his touchdown dance. He runs over to Ray, \n               grabs him by the helmet.\n\n                                     DARNELL\n                         Monster block, man. Monster \n                         motherfuckin' block.\n\n               Ray smiles. They butt heads and run off the field\n\n               INT. ALVIN'S SHACK\n\n                                     ALVIN\n                              (softly to himself)\n                         All right, defense. Let's get evil. \n                         Kill 'em all, let the paramedics \n                         sort 'em out.\n\n               EXT. WOLF DEN STADIUM - AFTERNOON\n\n               Georgia Tech has the ball. They break their huddle.\n\n                                     HARVEY (V.O.)\n                         1:11 and counting. Third and one. \n                         The Wolves have got to stop them on \n                         this play if they're gonna get the \n                         ball back. A first down here and \n                         it's all she wrote. E.S.U. is out of \n                         timeouts.\n\n               The Georgia Tech quarterback fakes to his fullback, hands \n               off to his TAILBACK on the countertrap. The tailback runs \n               behind his big, pulling tackle, both right at Lattimer. \n               Lattimer takes on the tackle, sheds his block. The back lowers \n               his head, starts to power into Lattimer. Lattimer lets out a \n               fierce yell.\n\n               Smash! Lattimer explodes into the tailback, the collision \n               lifting the back off the ground, whiplashing his neck, \n               vibrating his helmet. Lattimer's legs churn, driving the \n               tailback back and into the ground. We see the back's face. \n               There are snot bubbles in his nose. No first down. No way.\n\n               Lattimer jabs both arms in the air. The crowd goes nuts, as \n               the defense slaps helmets, and runs off the field, windmilling \n               their arms, whipping up the crowd.\n\n               ANGLE ON SIDELINE\n\n               Winters congratulates the defense as it comes off the field. \n               He meets Lattimer, looks into his eyes. Sees the steroids \n               there. He knows it's the only way the kid could have done \n               it. Decides not to bust him. Lattimer knows it. Winters gives \n               his helmet a little slap, more in sympathy than praise.\n\n               ANGLE ON THE YELLOW JACKET PUNTER\n\n               He catches the snap, boots the ball away.\n\n               Darnell fields it at his 12, starts toward the right sideline, \n               where hemmed in, he looks like dead meat. Suddenly, he \n               reverses his field, racing for the opposite sideline, where \n               a picket line of blockers awaits him, if he can get there. \n               He turns on the jets, barely beating two tacklers to the \n               corner, and then turns it up the left sideline, picking up a \n               wicked series of crack-back blocks, until he's finally run \n               out of bounds at the Yellow Jacket 35 yard line.\n\n               ON STANDS\n\n               The E.S.U. fans are on their feet. Winters races over to \n               Joe.\n\n                                     WINTERS\n                         Time for 2 plays. If it's not open \n                         in the end zone, take the sideline. \n                         As the offense runs onto the field, \n                         Winters checks the scoreboard. 17 \n                         seconds left. Georgia Tech 10. E.S.U. \n                         7.\n\n               INT. WOLF DEN STADIUM - AFTERNOON\n\n               Joe brings the Wolves up.\n\n                                     HARVEY (V.O.)\n                         Ball on the Yellow Jacket 35. 17 \n                         seconds left. Kane barking signals.\n\n               Joe takes the snap, drops to pass, finds no one, rolls away \n               from the rush. Just as he's about to go out of bounds, he \n               fires a bullet down the sideline. Ray Griffen catches it and \n               goes out of bounds at the twelve.\n\n               ANGLE ON SIDELINE\n\n               Joe runs over to Coach Winters, knowing they have no more \n               time outs, as the refs move the chains.\n\n                                     HARVEY (V.O.)\n                         Field goal here ties it, but a tie \n                         may not get the Wolves into a bowl. \n                         Tough decision for Winters.\n\n                                     WINTERS\n                              (to Joe)\n                         You want me to send in the kicking \n                         team or you think you can handle it?\n\n                                     JOE\n                         Give me the ball.\n\n                                     WINTERS\n                         O.K., let's do 24 inside slot, left \n                         blue lightning.\n\n               ON FIELD\n\n               Joe races back out onto the field and into the huddle, as \n               the crowd's roar goes off the charts.\n\n                                     JOE\n                              (in huddle)\n                         O.K., 24 inside slot, left blue \n                         lightning. Let's put the women and \n                         children to bed, and go lookin' for \n                         fuckin' dinner. On 2.\n\n               He starts the wolf howl. The others join in, howling for all \n               they're worth, eleven jacked-up warriors. They clap and break \n               the huddle.\n\n               The crowd is standing, waving fists in unison toward the \n               Georgia Tech end zone. Joe looks up in the stands again at \n               the seat he left for his father. It's still empty.\n\n                                     JOE\n                         This one's for you, Dad.\n\n               Joe starts to call signals as Bud Lite sings \"Bali Hi.\" We \n               go to SLOW MOTION as the ball is snapped.\n\n               The Georgia Tech defense fires off the line, throwing \n               everything at Joe. Joe drops back five steps. Bud Lite picks \n               up a blitzing linebacker, knocks him over a fallen player. \n               Joe looks for Darnell in the corner, but another pass rusher \n               breaks through, forcing Joe out of the pocket. It's wartime \n               as tackles and blockers collide, hand-fight, go down, scramble \n               up, collide again, all in pursuit of Joe.\n\n               Darnell, realizing Joe's in trouble, breaks off his pattern \n               and heads to the center of the end zone. Joe dodges one \n               tackler, shakes free of another's ankle tackle, heads back \n               for the center of the field. He spots Darnell breaking between \n               defensive backs. Just as he's buried by two massive linemen, \n               Joe fires a rocket down the middle toward the sliver of open \n               space that Darnell is heading for.\n\n               The ball barely clears the hands of a lunging linebacker. \n               Darnell and two defensive backs, one from each side, close \n               on the ball as it cuts through the air, a perfect spiral. \n               Darnell dives. The two defensive backs dive. The ball passes \n               between their outstretched hands by a fraction of an inch, \n               landing in Darnell's. He clutches it to his chest, rolls \n               over, holds the ball up for the ref to see. Touchdown! This \n               time Darnell does go into his touchdown dance.\n\n               ANGLE ON STANDS\n\n               Pandemonium. The crowd including Autumn and her dad goes \n               crazy. Winters just gives a few quick nods, watching almost \n               wistfully as the players and coaches hug each other, knowing \n               none of them will hug him. Joe, Bud and the others mob \n               Darnell.\n\n               INT. ALVIN'S SHACK - DAY\n\n               Alvin listens to the celebration a few beats, then switches \n               off the radio, knowing this is an experience he'll never be \n               a part of again. We leave him staring off into an uncertain \n               future.\n\n               INT. CHANCELLOR'S SKY-BOX - DAY\n\n               The Chancellor and his guests are celebrating the victory, \n               congratulating each other. Conspicuous among them are the \n               Fat Cat Alumnus who gave Darnell the money, and the Chairman \n               of the Board of Regents.\n\n                                     CHAIRMAN\n                         Looks like the Timberwolves are back. \n                         Probably brought the library with \n                         them.\n\n                                     CHANCELLOR\n                         Hope so.\n                              (turning to Galen \n                              Howard)\n                         Give my sincere congratulations to \n                         Coach Winters.\n\n                                     HOWARD\n                         He'll be delighted.\n\n               The Fat Cat Alumnus goes to a replica of the Building Fund \n               football field and starts advancing the ball.\n\n                                     FAT CAT ALUMNUS\n                         15,10, touchdown!\n\n               This brings applause all around.\n\n               EXT. WOLF DEN STADIUM - AFTERNOON\n\n               As Darnell comes off the field, Autumn runs out and hugs \n               him, leads him to her dad.\n\n                                     AUTUMN\n                         Daddy, you remember Darnell.\n\n                                     MR. HALEY\n                         Yes, I do. Great catch, Darnell.\n\n                                     DARNELL\n                         Thank you, sir. I got somethin' for \n                         you.\n\n               Darnell reaches into his helmet and takes out a sweat-stained \n               piece of paper.\n\n                                     DARNELL\n                         My entrance exam. Got a 92. Coach \n                         Winters said you got an 87. He looked \n                         it up.\n\n                                     MR. HALEY\n                              (laughing)\n                         I'll kill him.\n\n               ANGLE ON JOE KANE\n\n               walking toward the tunnel, acknowledging the plaudits of the \n               fans. He looks for Camille, doesn't see her. Coach Winters \n               comes up next to him.\n\n                                     WINTERS\n                         Hell of a throw, Joe. Good to see \n                         you back.\n\n               Winters gives him a quick, but firm hug.\n\n                                     WINTERS\n                         And don't worry about the Heisman. \n                         We'll gear up for it next year.\n\n               Joe manages a weary smile.\n\n               ANGLE ON BUD LITE\n\n               coming down the tunnel, Bobby Collins next to him. Both stop \n               as Louanne walks toward them. Bobby smiles to himself in \n               anticipation of her fawning over him. She walks right by him \n               and up to Bud.\n\n                                     LOUANNE\n                         You still feel like gettin' a beer?\n\n               Bud smiles. Bobby quickly looks around for someone else to \n               hit on, hails a cheerleader. Bud and Louanne walk off \n               together. Louanne stops when she sees her father, fearful of \n               his reaction.\n\n                                     LOUANNE\n                         He's not a football player any more. \n                         He's graduating this year.\n\n                                     WINTERS\n                         He's still got a bowl game.\n\n               Louanne waits, not sure whether her father's angry or not.\n\n                                     WINTERS\n                         So make sure he doesn't violate \n                         curfew.\n\n               Louanne smiles. Winters returns it, and walks away.\n\n               ANGLE ON STEVE LATTIMER\n\n               Sitting on the bench, his head in his hands, weeping.\n\n                                     HARVEY (V.O.)\n                         An amazing conclusion to a great \n                         season. We can see Steve Lattimer \n                         down on the bench weeping tears of \n                         joy as E.S.U. goes back to a bowl \n                         for the first time in three years.\n\n               These are not tears of joy, but a man/boy who knows he'll \n               never be able to play pro football without steroids.\n\n               EXT. E.S.U. CAMPUS - LATE AFTERNOON\n\n               Joe sits on a bench at the intersection of four converging \n               Quad paths. Camille approaches from the opposite direction, \n               stops when she sees Joe.\n\n                                     CAMILLE\n                         What are you doin' here?\n\n                                     JOE\n                         Waitin' for you. I figured you'de \n                         have to come through here on your \n                         way to dinner.\n\n               This softens, relaxes her a bit.\n\n                                     CAMILLE\n                         Shouldn't you be out celebrating? \n                         You played real well.\n\n                                     JOE\n                         I need your help with somethin'. I \n                         know I'm not your favorite guy right \n                         now, but it's all startin' again. \n                         The expectations, the pressure, the \n                         talk about the Heisman next year. I \n                         was wonderin' if you'de like to go \n                         somewhere, maybe share a six-pack \n                         with me?\n\n               Camille's shocked that he might be drinking again. He pulls \n               a six pack of 7-Up out from behind his back. She laughs in \n               spite of herself. They settle again.\n\n                                     JOE\n                         I miss you, Camille. I don't like \n                         bein' without you.\n\n                                     CAMILLE\n                         I'll think about it.\n\n               They look at each other a beat, come forward into a long \n               kiss and embrace as we pull up and back.\n\n               CREDITS BEGIN TO ROLL AS\n\n               EXT. STADIUM TUNNEL - DAY\n\n               Coach Winters, flanked by Humes and Clayton, walks down the \n               tunnel to a waiting car. No effigy this time.\n\n                                     HUMES\n                         Tickets are in your coat. Itinerary \n                         and player profiles in the briefcase. \n                         We got a 9:00am tomorrow in Baltimore \n                         with the kid from Park. Then we're \n                         on to...\n\n               They continue down the tunnel toward a new recruiting season, \n               another year in the annals of The Program.\n\n                                                                   FADE OUT\n\n                                         THE END\n\n\n\n\n\nProgram, The\nWriters :   David S. Ward  Aaron Latham\nGenres :   Action  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:33:19.907140"}