{"title": "Prometheus", "film_link": "/Movie Scripts/Prometheus Script.html", "script_link": "/scripts/Prometheus.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Prometheus Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Prometheus.jpg\" title=\"Prometheus Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/6-stars.gif\"/> (5.67 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Jon Spaihts\" title=\"Scripts by Jon Spaihts\">Jon Spaihts</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a><br/>  <a href=\"/genre/Mystery\" title=\"Mystery Scripts\">Mystery</a><br/>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/><br/>\n<b>Movie Release Date</b> : June 2012<br/>\n<b>Submitted by</b>: DarkEssence<br/>\n<br/>\n<a href=\"/scripts/Prometheus.html\">Read \"Prometheus\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\r\n\r\n\r\n\r\n<b>                                   PROMETHEUS\r\n</b>\r\n                         \r\n\r\n                                   Written by\r\n\r\n                                   Jon Spaihts\r\n\r\n\r\n                         \r\n\r\n<b>                         FADE IN:\r\n</b>                         \r\n                         \r\n<b>          EXT. EARTH - DAY (12,000 B.C.)\r\n</b>                         \r\n          The world turns below us, vast and slow.\r\n                         \r\n          A RUMBLE. A shadow sweeps over the land. We move with the\r\n          shadow. We cast the shadow.\r\n                         \r\n          Landscapes slide by. Reduced by altitude to abstractions:\r\n          river deltas, forests and flood plains. A raw natural world.\r\n          No trace of civilization.\r\n                         \r\n          The shadow glides over mountains and glaciers. Across an\r\n          ocean and a pale beach. Over lowland plain at the foot of a\r\n          VOLCANIC MOUNTAIN it stops.\r\n                         \r\n                         \r\n<b>          EXT. LOWLAND PLAIN - DAY\r\n</b>                         \r\n          THREE FIGURES walk out of the shadow.\r\n                         \r\n          They are men - and yet not men. Their skin is snow-white.\r\n          Their features heavy and classical - as if Rodin's Thinker\r\n          had risen from his seat. Their smooth heads are earless and\r\n          hairless. Their glittering eyes entirely black.\r\n                         \r\n          Against the stark land their height is impossible to judge.\r\n                         \r\n          They are ENGINEERS.\r\n                         \r\n          Two of them are cloaked in dark robes of strange design.\r\n                         \r\n          The third is naked.\r\n                         \r\n          One of the cloaked Engineers opens a featureless black box:\r\n          inside lies a cake of dark, sticky material.\r\n                         \r\n          The naked one lifts the dark cake with ceremonial slowness.\r\n          It hums and buzzes. Foams into iridescent spheres. He raises\r\n          the seething cake to his mouth like the sacrament.\r\n                         \r\n          BLACK SCARABS boil out of the dark material. Swarm over his\r\n          lips. Glittering insects that chitter and bite.\r\n                         \r\n          Under the swarm his lips melt away. A horrific vision of\r\n          teeth, black blood, dissolving bone. They are devouring him.\r\n                         \r\n                         \r\n<b>                         FLASH ON:\r\n</b>                         \r\n          A fevered glimpse of the microscopic: cells rupture and\r\n          bleed. Protein chains unfold. A DNA spiral unravels.\r\n<b>           2.\r\n</b>                         \r\n                         \r\n          The scarabs fill their bellies with genetic material.\r\n                         \r\n                         \r\n<b>                         THE ENGINEER\r\n</b>                         \r\n          ...spreads his arms. Stands cruciform, nearly headless.\r\n                         \r\n          The scarabs swarm his shoulders, his chest. When they reach\r\n          his hips, he collapses sideways, toppling majestically like a\r\n          felled tree. Engulfed.\r\n                         \r\n          The two cloaked Engineers watch impassively.\r\n                         \r\n          Behind them, a vast black SHIP hangs in the sky.\r\n                         \r\n          As if blown by a great gust of wind, the scarabs disperse in\r\n          their millions in all directions. Living DNA on the wing.\r\n          Where the sacrificial victim fell, nothing remains.\r\n                         \r\n                         \r\n<b>          EXT. FOREST - DAY\r\n</b>                         \r\n          A pristine wilderness. The VOLCANIC MOUNTAIN in the distance.\r\n                         \r\n          A PRIMITIVE WOMAN stands on a height, staring in amazement:\r\n          far off a great dark ship hovers over the plain.\r\n                         \r\n          A black scarab lands on the back of her neck. Bites deep.\r\n          Injecting its cargo of DNA into her blood.\r\n                         \r\n                         \r\n<b>                         FLASH ON:\r\n</b>                         \r\n          A microscopic invasion. Cells pierced and infused. DNA\r\n          strands twining and mating.\r\n                         \r\n                         \r\n<b>          CLOSE ON THE WOMAN\r\n</b>                         \r\n          Pupils dilating with shock, breath hissing into her lungs.\r\n                         \r\n          She slaps the back of her neck. Looks at her hand. The scarab\r\n          lies in her palm.\r\n                         \r\n          As she watches, it crumbles to dust and blows away.\r\n                         \r\n<b>           FADE TO BLACK.\r\n</b>                         \r\n                         \r\n<b>                         ON BLACK\r\n</b>                         \r\n          Drifting motes of light against the dark: a starscape.\r\n<b>           3.\r\n</b>                         \r\n                         \r\n          An EXCAVATOR floats into view: a sturdy vehicle equipped with\r\n          robotic arms. Bright floodlights beat at the darkness. Inside\r\n          the cockpit - a bubble of glass - sits a BEAUTIFUL WOMAN.\r\n                         \r\n          This is DR. JOCELYN WATTS, 32, a precocious scholar of many\r\n          disciplines. A scientist accustomed to field work.\r\n                         \r\n          The cockpit is sweltering: she wears shorts, boots, a T-shirt\r\n          - and still her arms and legs gleam with sweat.\r\n                         \r\n          Watts works the controls. The excavator descends toward a\r\n          rocky surface. Silt billows up as the excavator approaches:\r\n          we're not in space at all, but deep underwater.\r\n                         \r\n          The excavator's thrusters are cowled propellers. The \"stars\"\r\n          are plankton shining in the floodlights.\r\n                         \r\n                         \r\n<b>          INT. EXCAVATOR - CONTINUOUS\r\n</b>                         \r\n          Watts steers the excavator to a steeply sloping cliff wall. A\r\n          sea-trench yawns below her, its depths lost in darkness.\r\n                         \r\n<b>                          WATTS\r\n</b>           Moving to survey site B... closing on\r\n           object four. The large oblong.\r\n                         \r\n          She watches the screen of a ground-penetrating radar system.\r\n          A bright signal return: something hidden in the cliff in\r\n          front of her. Something big.\r\n                         \r\n<b>                          WATTS (CONT'D)\r\n</b>           There you are.\r\n                         \r\n                         \r\n<b>          EXT. SEA TRENCH - CONTINUOUS\r\n</b>                         \r\n          Watts carves into the cliff with the excavator's digger arm.\r\n          Silt and boulders fall into the yawning trench below. She\r\n          brings a water cannon to bear: uses its jet to blast away\r\n          loose silt and stones.\r\n                         \r\n          The cliff face collapses: a muddy landslide into the deeps.\r\n                         \r\n          Watts backs away from the collapse, thrusters whirring to\r\n          keep her out of the turbulence. A cloud of silt clears.\r\n                         \r\n          In her floodlight beams, the OBELISK stands revealed - its\r\n          outlines worn by the ages. Easily thirty feet tall.\r\n                         \r\n          Watts stares at the obelisk, stunned. Her voice is husky:\r\n                         \r\n<b>                          WATTS\r\n</b>           Martin. Here.\r\n<b>           4.\r\n</b>                         \r\n                         \r\n          A second excavator glides out of the dark.\r\n                         \r\n          At the controls: PROFESSOR MARTIN HOLLOWAY, 48, visionary\r\n          genius and archaeologist. Dark-haired and lean, with the\r\n          rangy build of a frontiersman. He's dressed in work trousers\r\n          and a T-shirt. Stubbly chin.\r\n                         \r\n          He plays his floodlights over the obelisk.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Look at that.\r\n                         \r\n                         \r\n<b>          INT. WATTS'S EXCAVATOR\r\n</b>                         \r\n          Watts floats her excavator down the front of the obelisk.\r\n          Scanning the alien text. Suddenly she stops. Grips the\r\n          obelisk with her excavator's arms to anchor herself in place.\r\n                         \r\n<b>                          WATTS\r\n</b>           You need to see this.\r\n                         \r\n<b>           HOLLOWAY (V.O.)\r\n</b>           Coming.\r\n                         \r\n                         \r\n<b>          EXT. SEA TRENCH\r\n</b>                         \r\n          Holloway pilots his excavator expertly up to Watts's. Mates\r\n          the two vehicles at their aft hatchways.\r\n                         \r\n                         \r\n<b>          INT. WATTS'S EXCAVATOR\r\n</b>                         \r\n          Behind Watts, a hatch opens with a splatter of water.\r\n                         \r\n          Holloway climbs in. Squeezes into her cockpit. A tight fit.\r\n          He's distracted by her body, pressed so close - but she has\r\n          eyes only for the inscrutable writing outside the glass.\r\n                         \r\n<b>                          WATTS\r\n</b>           Same thing again.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           What do you see?\r\n                         \r\n<b>                          WATTS\r\n</b>           An ephemeris - a star map.\r\n<b>                          (POINTING)\r\n</b>           Radius, inclination, azimuth...more\r\n           data here...\r\n<b>           5.\r\n</b>                         \r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           If we can get epoch and equinox out of\r\n           that...\r\n                         \r\n<b>                          WATTS\r\n</b>           Can we raise this thing?\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           (shakes his head)\r\n           Hundreds of tons.\r\n                         \r\n                         \r\n<b>          EXT. MEDITERRANEAN SEA - DAY\r\n</b>                         \r\n          A research vessel at anchor on a turquoise sea. Bright sun.\r\n                         \r\n          In the distance, a coastline dotted with villas. The horizon\r\n          is dominated by the VOLCANIC PEAK - the same peak we saw in\r\n          the distance in the prologue.\r\n                         \r\n          Aboard the research vessel, cranes lift Watts and Holloway's\r\n          excavators out of the sea and onto the deck.\r\n                         \r\n                         \r\n<b>          INT. RESEARCH VESSEL - AFT DECK - DAY\r\n</b>                         \r\n          Under an awning, PRINTS of the obelisk's faces are stretched\r\n          on the deck - fifteen feet long.\r\n                         \r\n          Watts and Holloway crawl over the alien text, red markers in\r\n          hand. Parsing, translating, calculating.\r\n                         \r\n          They're tanned, fit, the wind in their hair. The\r\n          Mediterranean coast in the distance. It's an idyllic way to\r\n          work. But they're utterly absorbed in the task at hand.\r\n                         \r\n                         \r\n<b>          AFT DECK - NIGHT\r\n</b>                         \r\n          They're still at it. Lights illuminate the workspace. The\r\n          obelisk prints are blanketed with markings and annotations.\r\n                         \r\n          Holloway sits at a table. Watts sits on the marked-up prints.\r\n          Both working through calculations on electronic slates.\r\n                         \r\n          Holloway looks up.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           I have a solution. A single match.\r\n                         \r\n<b>                          WATTS\r\n</b>           Me too. Checked it twice.\r\n<b>           6.\r\n</b>                         \r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           You first.\r\n                         \r\n          Watts holds up her slate: it displays a set of stellar\r\n          coordinates. A detailed star map. Holloway holds up his own\r\n          slate: an exact match. They lock eyes in electric excitement.\r\n                         \r\n<b>                          WATTS\r\n</b>           What do we do now?\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           We go there.\r\n                         \r\n                         \r\n<b>          EXT. WEYLAND'S WHEEL (EARTH ORBIT)\r\n</b>                         \r\n          A gleaming space station like a five-spoked wheel rotates\r\n          grandly against the Pacific Ocean a thousand miles below.\r\n          Black letters on the white metal read: WEYLAND'S WHEEL.\r\n                         \r\n          A round shuttlecraft approaches the station.\r\n                         \r\n                         \r\n<b>          INT. SHUTTLECRAFT (ZERO GRAVITY)\r\n</b>                         \r\n          A spacecraft no bigger than a private jet.\r\n                         \r\n          Holloway and Watts sit strapped into acceleration chairs. The\r\n          only two passengers aboard. New to space travel, Watts tears\r\n          her eyes from the spectacle of Earth outside the window.\r\n                         \r\n          Holloway plays with a pen, batting it from hand to hand in\r\n          the zero gravity.\r\n                         \r\n<b>                          WATTS\r\n</b>           What's first? You do climate, I do\r\n           genetics?\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Archaeology first. Let our ancestors\r\n           tell the tale.\r\n                         \r\n<b>                          WATTS\r\n</b>           You think he's serious?\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Serious enough to send his private\r\n           shuttle.\r\n                         \r\n<b>                          WATTS\r\n</b>           Weyland can send his shuttle out for\r\n           pizza.\r\n<b>                          (DELICATELY)\r\n</b><b>                          (MORE)\r\n</b><b>           7.\r\n</b>                         \r\n<b>                          WATTS (CONT'D)\r\n</b>           Martin. If this meeting goes like the\r\n           others, maybe we should...\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           It won't go like the others.\r\n                         \r\n<b>                          WATTS\r\n</b>           How do you know?\r\n                         \r\n          Holloway plucks the pen from the air. He points out the\r\n          window, where the crescent Moon shines like a toothy grin.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Heaven smiles on our enterprise.\r\n                         \r\n                         \r\n<b>          EXT. WEYLAND'S WHEEL\r\n</b>                         \r\n          The shuttle docks with the Wheel's hub - a perfect fit.\r\n                         \r\n                         \r\n<b>          INT. WEYLAND'S WHEEL - SPOKE ELEVATOR (ZERO GRAVITY)\r\n</b>                         \r\n          A gleaming capsule elevator with windows to the stars.\r\n                         \r\n          Holloway and Watts float weightlessly inside, moving from\r\n          handhold to handhold. The door closes.\r\n                         \r\n          Watts grabs Holloway by the collar. Pulls them roughly\r\n          together. They kiss. Not for the first time. They have a way.\r\n                         \r\n          Watts's hair and clothing float free: she's a naiad in\r\n          Holloway's arms.\r\n                         \r\n                         \r\n<b>          EXT. WEYLAND'S WHEEL\r\n</b>                         \r\n          The elevator descends along the spoke to the rim.\r\n                         \r\n                         \r\n<b>          INT. WEYLAND'S WHEEL - RIM - FOYER\r\n</b>                         \r\n          A luxurious lobby. Tasteful lighting. Eames-era furniture in\r\n          wood and chrome: the past's vision of the future.\r\n                         \r\n          At the rim, the Wheel's rotation supplies gravity. An\r\n          elevator door opens. Watts and Holloway step out - Holloway\r\n          with a sleek metal folio slung over his shoulder.\r\n                         \r\n          The floor is the outer surface of the Wheel: in both\r\n          directions it curves upward out of sight.\r\n                         \r\n          The walls are all windows: on one side, Earth rotates lazily.\r\n          On the other, a wheeling field of stars.\r\n<b>           8.\r\n</b>                         \r\n                         \r\n          DAVID, an android, stands waiting for them. He's cunningly\r\n          built, but no one would mistake him for a real human being.\r\n                         \r\n<b>                          DAVID\r\n</b>           Professor Holloway. Dr. Watts. My name\r\n           is DAVID.\r\n                         \r\n<b>                          WATTS\r\n</b>           Hello, DAVID.\r\n                         \r\n<b>                          DAVID\r\n</b>           Mr. Weyland's eager to meet you.\r\n                         \r\n          He strides off across the foyer. Watts and Holloway exchange\r\n          a wondering glance and follow.\r\n                         \r\n                         \r\n<b>                         EXHIBIT HALL\r\n</b>                         \r\n          DAVID leads past models of planets, moons and asteroids.\r\n          Holographic labels and data swirl around them.\r\n                         \r\n<b>                          DAVID\r\n</b>           These are all the planetary bodies on\r\n           which Weyland Industries has mining\r\n           claims.\r\n                         \r\n          The end of the hall is dominated by a huge globe of Mars.\r\n          Markings indicate widespread surface activity.\r\n                         \r\n<b>                          DAVID (CONT'D)\r\n</b>           And Mars. Weyland's crown jewel.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           How is that going? The terraforming.\r\n                         \r\n<b>                          WATTS\r\n</b>           They say you're getting diminishing\r\n           returns. It's not working.\r\n                         \r\n<b>                          DAVID\r\n</b>           It's the greatest engineering project\r\n           ever attempted. Challenges are\r\n           inevitable. Mr. Weyland's a\r\n           determined man.\r\n                         \r\n                         \r\n<b>                         WEYLAND'S OFFICE\r\n</b>                         \r\n          PETER WEYLAND sits behind a mahogany desk. He's a Warren\r\n          Buffet type: a country sage, horse-sense and hard knocks. He\r\n          might be seventy years old, or a hundred and seventy.\r\n<b>           9.\r\n</b>                         \r\n                         \r\n          Behind him stands DIRECTOR LYDIA VICKERS, a slim woman of 45\r\n          in a costly business suit. Shrewd and watchful. Once a great\r\n          beauty, she now trades in ruthlessness.\r\n                         \r\n          DAVID stands against the wall.\r\n                         \r\n          Watts and Holloway settle into chairs in front of Weyland -\r\n          Holloway holding the metal folio.\r\n                         \r\n<b>                          WEYLAND\r\n</b>           Professor Holloway. Ms. Watts.\r\n                         \r\n<b>                          WATTS\r\n</b>           Doctor Watts.\r\n                         \r\n<b>                          WEYLAND\r\n</b>           Forgive me. Peter Weyland.\r\n                         \r\n          He notices Watts looking curiously at DAVID. He smiles.\r\n                         \r\n<b>                          WEYLAND (CONT'D)\r\n</b>           Ah. DAVID here's a prototype. Our 80\r\n           series. One of a kind for now, but if\r\n           he performs, he will be legion.\r\n           (his smile fades)\r\n           What do you want here?\r\n                         \r\n          Holloway looks at him, startled.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           We sent you a prospectus that...\r\n                         \r\n<b>                          WEYLAND\r\n</b>           Assume I know nothing.\r\n                         \r\n          Holloway swallows. Lays the metal folio on Weyland's desk.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           I'm an archaeologist.\r\n                         \r\n          He touches a tiny remote. Holographs appear in the air over\r\n          Weyland's desk: the folio is a three-dimensional imager.\r\n                         \r\n          Pictures of a younger Holloway in the field: excavating ruins\r\n          in Egypt, China, Peru, Greece.\r\n                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           In my studies I discovered a pattern I\r\n           couldn't explain. Every eleven hundred\r\n           years, sudden advances in agriculture,\r\n           tool use, technology. Inventions.\r\n           Something caused a great leap forward.\r\n           Every eleven centuries. The pattern\r\n           holds as far back as our data goes.\r\n<b>                          (MORE)\r\n</b><b>           10.\r\n</b>                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           Tens of thousands of years. I had to\r\n           understand this. It became the focus\r\n           of my work.\r\n                         \r\n          Weyland nods. Holloway glances at Watts and forges on.\r\n                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           Dr. Watts was a student of mine.\r\n                         \r\n          Watts touches her own remote. The holographic display turns\r\n          to scientific diagrams. Images of a very young and beautiful\r\n          Watts in the laboratory.\r\n                         \r\n<b>                          WATTS\r\n</b>           I was analyzing historical changes in\r\n           human DNA. I found the same pattern.\r\n           Every eleven centuries, a pulse of new\r\n           information in the genome of the human\r\n           race. All over the world. Evolution\r\n           can't do that. Something was changing\r\n           us. Changing the DNA of our species.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Humanity's been visited. Visited\r\n           by...beings from somewhere else.\r\n                         \r\n          Behind Weyland, Vickers can't suppress a scowl of disdain.\r\n                         \r\n<b>                          VICKERS\r\n</b>           You mean aliens.\r\n                         \r\n          A beat. The others had forgotten Vickers was there.\r\n                         \r\n<b>                          WEYLAND\r\n</b>           Lydia Vickers, Director of Operations.\r\n           Practically my right hand.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           They guided us to civilization. Lifted\r\n           us up, again and again. I call them\r\n           the Engineers.\r\n                         \r\n<b>                          WATTS\r\n</b>           Once you know what you're looking for,\r\n           it's amazing how the evidence falls\r\n           into place.\r\n                         \r\n          Photographs flicker through the display: Holloway and Watts\r\n          in the field, excavating new sites. Intimately close.\r\n                         \r\n          Their finds: columns of writing on stone tablets in Egypt,\r\n          China, Cambodia, Peru. Patterns of lines, curves, and dots.\r\n<b>           11.\r\n</b>                         \r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           This is the writing of the Engineers.\r\n           We've found it on every continent. And\r\n           last year, we found our Rosetta Stone.\r\n                         \r\n          The display shows the Engineer obelisk under the sea.\r\n                         \r\n<b>                          WATTS\r\n</b>           The writing is a formula giving the\r\n           location of a single star in our sky.\r\n                         \r\n<b>                          WEYLAND\r\n</b>           Which star?\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           We're keeping that confidential for\r\n           now. But that's where we want to go.\r\n                         \r\n<b>                          WEYLAND\r\n</b>           You want me to pay for an interstellar\r\n           research expedition!\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           It's a chance to be part of a\r\n           revolution in scientific...\r\n                         \r\n<b>                          WEYLAND\r\n</b>           Don't sell me, professor. You've been\r\n           turned down by every university and\r\n           government agency under the sun.\r\n           Nobody's going to gamble that kind of\r\n           money on your hunch.\r\n                         \r\n          Holloway deflates. Watts winces. This is a bloodbath.\r\n                         \r\n<b>                          WEYLAND (CONT'D)\r\n</b>           Nobody but me.\r\n<b>                          (HE GRINS)\r\n</b>           I've read your research.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           That's impossible. Our research is-\r\n                         \r\n<b>                          WEYLAND\r\n</b>           Quantum encoded on secure servers,\r\n           yeah. We have an A.I. division, you\r\n           should know. Doing impressive things.\r\n           (he leans across the desk)\r\n           I know which star you're wishing on.\r\n                         \r\n          The scientists stare at Weyland.\r\n                         \r\n<b>                          WATTS\r\n</b>           You're bluffing.\r\n<b>           12.\r\n</b>                         \r\n                         \r\n<b>                          WEYLAND\r\n</b>           Zeta Two Reticuli.\r\n                         \r\n          He regards their shocked faces with satisfaction.\r\n                         \r\n<b>                          WEYLAND (CONT'D)\r\n</b>           You know how I got this rich? I ask\r\n           myself: what does God spend his time\r\n           doing? And I go and do that.\r\n                         \r\n          Watts laughs incredulously. Stifles it. Weyland's not joking.\r\n                         \r\n<b>                          WEYLAND (CONT'D)\r\n</b>           Biotechnology was good to me. Fusion\r\n           power. Lately doing well with gravity\r\n           systems.\r\n                         \r\n          He swivels his chair toward the window. Earth shines outside.\r\n                         \r\n<b>                          WEYLAND (CONT'D)\r\n</b>           But what's the first thing God did?\r\n                         \r\n<b>                          WATTS\r\n</b>           He made the Heaven and the Earth.\r\n                         \r\n          Weyland jabs a finger at her like she's won a carnival prize.\r\n                         \r\n<b>                          WEYLAND\r\n</b>           That's what I'm talking about. You\r\n           left out my favorite part. The piece\r\n           about Earth. DAVID.\r\n                         \r\n<b>                          DAVID\r\n</b>           For eons, Earth's climate swung from\r\n           hothouse to ice age. Explosions of\r\n           life, then mass extinctions. But\r\n           twelve thousand years ago the swings\r\n           stopped. The Holocene Epoch began - a\r\n           period of anomalous tranquility. The\r\n           rise of civilization began only then.\r\n                         \r\n          Holloway and Watts stare at DAVID with new appreciation.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           That's right.\r\n                         \r\n<b>                          WATTS\r\n</b>           And that change coincides with a visit\r\n           by the Engineers. They didn't just\r\n           change us. They changed our world.\r\n                         \r\n<b>                          WEYLAND\r\n</b>           That's the piece I mean. Engineering\r\n           Earth. God stuff.\r\n<b>           13.\r\n</b>                         \r\n                         \r\n          He swivels back to his desk. Rummages in a drawer.\r\n                         \r\n<b>                          WEYLAND (CONT'D)\r\n</b>           My people checked your science. They\r\n           say it's solid.\r\n                         \r\n          He pulls a thick contract out. Drops it in front of Holloway.\r\n                         \r\n<b>                          WEYLAND (CONT'D)\r\n</b>           I'll give you your expedition. Ship\r\n           and crew, supplies, support. One\r\n           condition.\r\n                         \r\n          Holloway picks up the contract with the cautious joy of a man\r\n          double-checking a lottery ticket. His voice is husky:\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           What's that?\r\n                         \r\n<b>                          WEYLAND\r\n</b>           You get the discovery. Control of the\r\n           site. But any technology you find?\r\n           Anything at all. That's mine.\r\n                         \r\n          Holloway reaches out slowly and picks up the contract.\r\n          Riffles the pages of small-print legalese.\r\n                         \r\n<b>                          WEYLAND (CONT'D)\r\n</b>           You take DAVID with you. My eyes and\r\n           ears. And Vickers...you're going too.\r\n                         \r\n          Vickers stares at Weyland in shock.\r\n                         \r\n                         \r\n<b>                         WHITE LANDSCAPE\r\n</b>                         \r\n          A glittering formation of white crystals. Diamond on diamond.\r\n                         \r\n          The structures grow more complex as the view widens. Leaves\r\n          and branches of crystal. A shimmering field of white jewels.\r\n                         \r\n          A landscape of white crystals, smooth as snow.\r\n                         \r\n                         \r\n<b>          EXT. DEEP SPACE\r\n</b>                         \r\n          A black void shot with stars, far from any sun.\r\n                         \r\n          A sturdy prospecting ship forges through space, travel-worn\r\n          but built to last. It carries the Weyland Industries logo.\r\n          The name painted on its hull is MAGELLAN.\r\n<b>           14.\r\n</b>                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE\r\n</b>                         \r\n          The ship's nerve center and control room. Six control\r\n          stations, empty and quiet. Interior lights dimmed to blue.\r\n                         \r\n          The entire forward bulkhead of the Bridge is a window: wall\r\n          to wall, floor to ceiling.\r\n                         \r\n          At the window stands the android DAVID.\r\n                         \r\n          He gazes at the cosmos with an expression of utter serenity.\r\n          After a long moment he turns away. Massive shutters close\r\n          over the window as he walks off.\r\n                         \r\n                         \r\n<b>                         CORRIDOR\r\n</b>                         \r\n          DAVID walks the ship's long central corridor. The ship is\r\n          silent. The lights dimmed to blue. He is alone.\r\n                         \r\n                         \r\n<b>                         HYPERSLEEP COMPARTMENT\r\n</b>                         \r\n          A long steel room containing a dozen plexiglass sarcophagi,\r\n          six on each side. Sleep freezers. Inside each freezer: the\r\n          shadowy shape of a human body rimed with frost.\r\n                         \r\n          DAVID walks through the compartment, surveying the sleepers.\r\n                         \r\n                         \r\n<b>                         WORKROOM\r\n</b>                         \r\n          DAVID sits at a display table, moving intricate technical\r\n          documents across the surface with waves of his hands.\r\n                         \r\n          His eyes intent on his work. If he is reading, then he`s\r\n          reading at a speed no human could match.\r\n                         \r\n                         \r\n<b>                         WHITE LANDSCAPE\r\n</b>                         \r\n          We pull away from the frosted crystalline horizon, the smooth\r\n          white curves like snowy fields. Form becomes clear.\r\n                         \r\n          It's the body of a woman. It's Watts.\r\n                         \r\n                         \r\n<b>          INT. HYPERSLEEP FREEZER\r\n</b>                         \r\n          Watts lies asleep in her underwear in a plexiglass freezer.\r\n          Pale. Frost on her skin. Venus sculpted in ice. There are IV\r\n          lines in her elbows and ankles.\r\n<b>           15.\r\n</b>                         \r\n                         \r\n          Shapes move into view beyond her, outside the freezer. FACES.\r\n          Pressed to the glass.\r\n                         \r\n                         \r\n<b>                         HYPERSLEEP COMPARTMENT\r\n</b>                         \r\n          All of the freezers are open and empty, save two. Holloway\r\n          lies in one. In the next, Watts. Three men in blue coveralls\r\n          crouch beside Watts's freezer, staring inside.\r\n                         \r\n          They are DOWNS, 30, a lean fidgety crewman. STILLWELL, 40, a\r\n          sturdy fellow with the geniality of a labrador. And KAMAROV,\r\n          26, whose dark, brooding air belongs to a man twice his age.\r\n                         \r\n<b>                          DOWNS\r\n</b>           Look at that.\r\n                         \r\n          Kamarov opens the lid of Watt's freezer. Leans over her.\r\n          Watts stirs in her sleep, a drowsy angel.\r\n                         \r\n<b>                          KAMAROV\r\n</b>           She wakes up slow.\r\n                         \r\n          Watts wakes to find three men looming above her. Disoriented,\r\n          she pulls away. Tangles her hands in her IV lines.\r\n                         \r\n<b>           HOLLOWAY (O.S.)\r\n</b>           Get out of there!\r\n                         \r\n          Holloway's voice cracks like a whip. The crewmen jump back.\r\n                         \r\n          Holloway sits up in the next freezer over. He yanks the IV\r\n          lines out of his arms and legs. Climbs out of the freezer.\r\n                         \r\n<b>                          STILLWELL\r\n</b>           Just looking.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Give us a moment, will you?\r\n                         \r\n          The crewmen file out: Stillwell sheepishly, Downs and Kamarov\r\n          surly. Holloway goes to Watts. Gently removes the IV lines\r\n          from her ankles while she plucks the ones from her arms.\r\n                         \r\n<b>                          WATTS\r\n</b>           I'm out of sorts. Sorry.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Never worry.\r\n                         \r\n          He helps her up.\r\n<b>           16.\r\n</b>                         \r\n                         \r\n<b>          INT. MESS ROOM\r\n</b>                         \r\n          Holloway and Watts sit at a table, both a bit hung over. They\r\n          wear civilian clothes. Warmly dressed, they still look cold.\r\n                         \r\n          They nurse mugs of coffee and nibble packaged snack bars.\r\n          Watts hunches over, shivering.\r\n                         \r\n<b>                          WATTS\r\n</b>           My head's buzzing.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           You just slept two and a half years.\r\n           It'll pass.\r\n                         \r\n<b>                          WATTS\r\n</b>           Like you've done this before.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           I've read all about it.\r\n                         \r\n          Two ship's officers enter the room wearing blue coveralls\r\n          with rank insignia: GLASSE, 45, a stocky man with thick black\r\n          hair, and BRICK, 50, a bald man with a bristling mustache.\r\n                         \r\n          They look at Watts and Holloway with little pleasure.\r\n                         \r\n<b>                          BRICK\r\n</b>           Sleep okay?\r\n                         \r\n<b>                          WATTS\r\n</b>           Yes, thanks...\r\n                         \r\n<b>                          GLASSE\r\n</b>           Captain'll see you now.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - CAPTAIN'S WARDROOM\r\n</b>                         \r\n          CAPTAIN JANEK, 45, sits at his desk. With his bristling beard\r\n          and powerful build he has a swashbuckling look, like the\r\n          captain of a whaling ship.\r\n                         \r\n          Holloway and Watts sit on a steel bench in front of him.\r\n                         \r\n          He sits scanning his orders: a plastic packet with Weyland\r\n          Industries logos, cracked open. Watermarked papers inside.\r\n                         \r\n<b>                          JANEK\r\n</b>           Zeta Two Reticuli was surveyed\r\n           already. A hundred years ago.\r\n                         \r\n<b>                          WATTS\r\n</b>           By an unmanned probe. Very crude.\r\n<b>           17.\r\n</b>                         \r\n                         \r\n<b>                          JANEK\r\n</b>           No Earthlike planets.\r\n                         \r\n<b>                          WATTS\r\n</b>           No.\r\n                         \r\n<b>                          JANEK\r\n</b>           So what are you looking for?\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Proof of the Engineers' existence.\r\n                         \r\n<b>                          WATTS\r\n</b>           Confirmation of Professor Holloway's\r\n           theories would change everything.\r\n           There'd be science before Holloway and\r\n           science after.\r\n                         \r\n          Janek rubs his face wearily with his hands.\r\n                         \r\n<b>                          JANEK\r\n</b>           Your ticket. I'll put the ship where\r\n           you want. Run your scans.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Captain, your crew's been up for a\r\n           week. We could've used the time. Why'd\r\n           you wait to wake us?\r\n                         \r\n<b>                          JANEK\r\n</b>           Better for discipline.\r\n           (off their silence)\r\n           Men ship out as prospectors for one\r\n           reason: the percentage. Find a gold\r\n           mine or a habitable planet, and you're\r\n           set for life.\r\n           (he laughs bitterly)\r\n           But this contract says no percentage.\r\n           No bounty. Just triple pay. The men\r\n           aren't happy.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           You unhappy too?\r\n                         \r\n<b>                          JANEK\r\n</b>           I'm always unhappy.\r\n                         \r\n          He stands. Presses his palm against a wall panel. A safe\r\n          opens. He pulls out a massive pistol in a gunbelt. Tosses the\r\n          orders into the safe. Lays the gun atop them and locks it up.\r\n<b>           18.\r\n</b>                         \r\n                         \r\n<b>                         SCIENTISTS' CABIN\r\n</b>                         \r\n          Holloway and Watts take possession of their cabin: a simple\r\n          but spacious room with twin beds and a window to the stars.\r\n                         \r\n          They drop duffel bags on the bed.\r\n                         \r\n          Holloway surveys the arrangement. Frowns. He releases the\r\n          magnets that lock the beds down. Slides the beds together.\r\n                         \r\n                         \r\n<b>          INT. SCIENTISTS' WORKROOM - DAY\r\n</b>                         \r\n          Holloway and Watts set up their workspace - a central display\r\n          table and huge display surfaces on the walls. Fascinating\r\n          documents slide under their fingertips: an Engineer alphabet.\r\n          Ancient art. Climate and genetic data.\r\n                         \r\n          DAVID appears in the doorway.\r\n                         \r\n<b>                          WATTS\r\n</b>           DAVID. I wondered when we'd see you.\r\n                         \r\n<b>                          DAVID\r\n</b>           I trust your database is in order. I\r\n           set it up myself.\r\n                         \r\n<b>                          WATTS\r\n</b>           All's well, I think.\r\n                         \r\n          DAVID turns to go. Hesitates in the doorway.\r\n                         \r\n<b>                          DAVID\r\n</b>           I should tell you: the time you spent\r\n           sleeping, I spent studying your\r\n           research.\r\n                         \r\n          Holloway and Watts look at the android, his words sinking in.\r\n                         \r\n<b>                          WATTS\r\n</b>           You studied our work for two and a\r\n           half years.\r\n                         \r\n<b>                          DAVID\r\n</b>           It's quite a data set.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           So you've seen everything. Well. What\r\n           do you think?\r\n                         \r\n          DAVID glances over the documents displayed around the room.\r\n<b>           19.\r\n</b>                         \r\n                         \r\n<b>                          DAVID\r\n</b>           Your hypothesis is...bold. The\r\n           audacity of it. Your climate data's\r\n           undeniable: the Holocene Epoch was\r\n           engineered. Dr. Watts, your genetic\r\n           studies are equally conclusive. Pulses\r\n           of cultural change are harder to\r\n           prove, but even there your case is\r\n           strong. I believe in your \"Engineers.\"\r\n                         \r\n                         \r\n<b>                         BREAK ROOM\r\n</b>                         \r\n          A utilitarian sitting room. Steel benches and table bolted to\r\n          the deck. Seated here are two Weyland Industries technicians:\r\n                         \r\n          ANDREW CHANCE, 50, a stocky computer engineer with a genial\r\n          bearing and a bristling salt-and-pepper mustache.\r\n                         \r\n          MONA RAVEL, 45, a dour, rangy woman with a plain face, her\r\n          hair pulled severely back. A physicist and chemist.\r\n                         \r\n          They wear black Weyland Industries jackets. They radiate\r\n          intelligence and competence. These are pros.\r\n                         \r\n          DAVID leads Holloway and Watts past the break room. Holloway\r\n          spots the technicians. Strides in to greet them.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Weyland Industries! Mr. Chance. Ms.\r\n           Ravel. You remember Dr. Watts.\r\n                         \r\n          Watts and the technicians exchange greetings.\r\n                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           About the materials I gave you. Some\r\n           of the technical aspects...\r\n                         \r\n<b>                          CHANCE\r\n</b>           We'll handle our end of the job.\r\n                         \r\n<b>                          RAVEL\r\n</b>           If there is a job.\r\n                         \r\n          Holloway blinks at her. Chance explains, not unkindly:\r\n                         \r\n<b>                          CHANCE\r\n</b>           We only have a job if you find\r\n           something.\r\n<b>           20.\r\n</b>                         \r\n                         \r\n<b>                         CORRIDOR\r\n</b>                         \r\n          Holloway and Watts follow the imperturbable DAVID down a\r\n          steel corridor to Vickers's cabin door.\r\n                         \r\n                         \r\n<b>                         VICKERS'S SUITE\r\n</b>                         \r\n          An open-plan cabin like an urban loft apartment. Watts and\r\n          Holloway follow DAVID inside. Vickers rises to meet them.\r\n                         \r\n          The walls are industrial steel - but the floors are lushly\r\n          carpeted, the furniture opulent. A king-sized bed, a mahogany\r\n          desk, a dining table.\r\n                         \r\n          Gleaming machines ensure Vickers never need step outside: a\r\n          private hypersleep freezer, an autokitchen, a medical pod.\r\n                         \r\n<b>                          WATTS\r\n</b>           Is that a Pauling medical pod? There's\r\n           only ten of those things on Earth! I\r\n           guess nine, now.\r\n                         \r\n<b>                          VICKERS\r\n</b>           I told Mr. Weyland I wouldn't\r\n           compromise my standard of living. He\r\n           accommodated me.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           I know, I had to cut my manifest. This\r\n           used to be the number four cargo bay.\r\n                         \r\n<b>                          VICKERS\r\n</b>           What can I do for you, Professor?\r\n                         \r\n          Holloway gestures with the slate he's brought with him.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           We're about to reach the system\r\n           periphery. I thought you'd want to see\r\n           the search protocols we -\r\n                         \r\n<b>                          VICKERS\r\n</b>           No. I was set to be the next CEO of\r\n           Weyland Industries. Then you came\r\n           along and sold Mr. Weyland on...this.\r\n           So here I am. Out of the running.\r\n           I'll go where I'm told. But don't ask\r\n           me to play along.\r\n                         \r\n<b>                          WATTS\r\n</b>           But when you get back...\r\n<b>           21.\r\n</b>                         \r\n                         \r\n<b>                          VICKERS\r\n</b>           I'll be five years behind the curve.\r\n           Out of touch. Over.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           You might make the discovery of the\r\n           ages.\r\n                         \r\n          Vickers looks at him as if she's dealing with a child.\r\n                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           You don't believe in what we're doing.\r\n                         \r\n<b>                          VICKERS\r\n</b>           Mr. Weyland believes. That's enough.\r\n                         \r\n          She walks them toward the door. Interview's over.\r\n                         \r\n<b>                          VICKERS (CONT'D)\r\n</b>           Now we're out of communication, you\r\n           can tell the crew what we're doing.\r\n                         \r\n<b>                          WATTS\r\n</b>           They don't know? They volunteered.\r\n                         \r\n<b>                          VICKERS\r\n</b>           They volunteered blind. Classified\r\n           job, triple pay.\r\n                         \r\n                         \r\n<b>                         CARGO BAY\r\n</b>                         \r\n          The crew - Brick, Glasse, Stillwell, Downs, and Kamarov - sit\r\n          on crates in an improvised lecture hall. Holloway and Watts\r\n          in front of them. Janek at the back of the room.\r\n                         \r\n          A hologram shows ancient images of divine visitations. The\r\n          crew is visibly spooked.\r\n                         \r\n<b>                          DOWNS\r\n</b>           Aliens.\r\n                         \r\n<b>                          GLASSE\r\n</b>           You shitting me?\r\n                         \r\n          Stillwell is staring at the frightening images: gods and\r\n          titans towering over mortals.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           I think all our mythologies are race-\r\n           memories of the Engineers. Horus the\r\n           Sun God. Prometheus bringing fire from\r\n           heaven. A pillar of fire, a pillar of\r\n           smoke. The Engineers are the gods.\r\n<b>           22.\r\n</b>                         \r\n                         \r\n          Kamarov stiffens, smelling blasphemy.\r\n                         \r\n<b>                          KAMAROV\r\n</b>           The mythology gods maybe. God is God.\r\n                         \r\n<b>                          STILLWELL\r\n</b>           Kamarov. Let him talk.\r\n                         \r\n          Stillwell's staring unhappily at the ancient images: gods\r\n          towering over mortals, inhuman and terrifying.\r\n                         \r\n<b>                          STILLWELL (CONT'D)\r\n</b>           So we're going to meet these things?\r\n                         \r\n<b>                          WATTS\r\n</b>           We probably won't meet anyone. You'd\r\n           expect a star-traveling race to\r\n           generate radio or laser signals.\r\n           Fusion drives and gravity drives have\r\n           clear signatures. But Zeta Two\r\n           Reticuli is silent. And the Engineers\r\n           have gone missing on Earth.\r\n                         \r\n<b>                          WATTS (CONT'D)\r\n</b>           By the pattern, they should've come to\r\n           Earth seventeen centuries ago. And\r\n           again six centuries ago. But no sign.\r\n           After twelve thousand years...they\r\n           stopped coming.\r\n                         \r\n<b>                          BRICK\r\n</b>           Why?\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Exactly. Why?\r\n                         \r\n<b>                          JANEK\r\n</b>           \"My God, my God, why have you forsaken\r\n           me?\"\r\n                         \r\n          They turn. Janek grins at Holloway across the cargo bay.\r\n                         \r\n<b>                          JANEK (CONT'D)\r\n</b>           Is that the question you've come light-\r\n           years to answer?\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Only my first question. I have many.\r\n<b>           23.\r\n</b>                         \r\n                         \r\n<b>          EXT. MAGELLAN (ZETA2 RETICULI SYSTEM)\r\n</b>                         \r\n          The Magellan arrives at the periphery of the system. A\r\n          distant star like Earth's Sun, surrounded by orbiting\r\n          planets: mere sparks at this distance.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE\r\n</b>                         \r\n          Outside the vast Bridge window, the star Zeta2 Reticuli\r\n          burns, a cold beacon in the night. Downs, Glasse and Brick\r\n          sit at consoles. Janek paces in front of the window.\r\n                         \r\n          Holloway and Watts enter - and gape at the view. Janek grins\r\n          at their reaction.\r\n                         \r\n<b>                          JANEK\r\n</b>           Welcome to Zeta Two Reticuli. Edge of\r\n           the system. Open her eyes.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN (ZETA2 RETICULI SYSTEM)\r\n</b>                         \r\n          The Magellan opens its eyes: two immense telescopes emerge\r\n          from the ship. Irises open to expose huge lenses.\r\n                         \r\n          Antennae deploy: unfurling like wings, gleaming and vast.\r\n          Sifting vacuum for any whisper of information.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE\r\n</b>                         \r\n          Outside the window, the planets orbiting Zeta2 Reticuli are\r\n          no more than bright stars.\r\n                         \r\n<b>                          JANEK\r\n</b>           Overlay.\r\n                         \r\n          A heads-up display appears, overlaid on the glass. The sun is\r\n          labeled ZETA2 RETICULI. Markers point out the planets and\r\n          trace the ellipses of their orbits.\r\n                         \r\n          Like magic, the planets swell into colorful orbs, each\r\n          labeled: Alpha, Beta, Gamma...\r\n                         \r\n<b>                          DOWNS\r\n</b>           Seven planets. Two hot rocks, two gas\r\n           giants, three snowballs. Nothing\r\n           Earthlike.\r\n                         \r\n          Watts grins at Holloway, eyes shining.\r\n<b>           24.\r\n</b>                         \r\n                         \r\n<b>                          WATTS\r\n</b>           First humans in the system.\r\n                         \r\n          Vickers walks onto the Bridge with DAVID.\r\n                         \r\n<b>                          JANEK\r\n</b>           Director. Good of you to join us.\r\n                         \r\n<b>                          VICKERS\r\n</b>           What did I miss?\r\n                         \r\n<b>                          CAPTAIN JANEK\r\n</b>           Just getting warmed up.\r\n<b>                          (TO HOLLOWAY)\r\n</b>           Professor? You know what you want?\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           EMR scan, thirty hertz to three\r\n           hundred gigahertz. Spectroscopic\r\n           passes on every planet and major moon.\r\n           Infrared and albedo scan for hot spots\r\n           and light sources.\r\n                         \r\n<b>                          CAPTAIN JANEK\r\n</b>           Man knows what he wants. Run it.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN (ZETA2 RETICULI SYSTEM)\r\n</b>                         \r\n          Twin telescopes spin and zoom. Antennae flex and focus.\r\n                         \r\n                         \r\n<b>                         TELESCOPE POV\r\n</b>                         \r\n          The planet nearest the sun rushes closer as the mighty\r\n          telescopes zoom in.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE\r\n</b>                         \r\n          The Magellan's sensors peel planet Alpha like an onion and\r\n          put it back together again.\r\n                         \r\n          A river of data floods the display, bathing the watchers'\r\n          faces with light: Chemical compounds, magnetic field lines,\r\n          lunar orbits, topographical data.\r\n                         \r\n          The scan moves on to the next planet, and the next.\r\n                         \r\n<b>                          GLASSE\r\n</b>           Negative on radio chatter system-wide.\r\n           Nobody's talking.\r\n<b>           25.\r\n</b>                         \r\n                         \r\n<b>                          BRICK\r\n</b>           Negative for laser and maser.\r\n                         \r\n          On the H.U.D., the data stream completes the last planet.\r\n          Begins to illuminate the gas giants' moons.\r\n                         \r\n<b>                          GLASSE\r\n</b>           No biological markers. No artificial\r\n           light. No industry or agriculture.\r\n           Dead system. Like always.\r\n                         \r\n<b>                          DOWNS\r\n</b>           Piss-poor, too. Low in heavy elements.\r\n                         \r\n<b>                          BRICK\r\n</b>           Got a hit! A moon. LV-426.\r\n                         \r\n          The display centers on Epsilon, a gas giant with many moons.\r\n          Data flickers around one of the larger moons: LV-426.\r\n                         \r\n<b>                          BRICK (CONT'D)\r\n</b>           Eighty-six percent Earth's mass.\r\n           Atmosphere's nitrogen, methane,\r\n           sulfates. Faint returns for a bunch of\r\n           metals.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Anything else?\r\n                         \r\n          The sensors complete their pass on the system's last moon.\r\n                         \r\n<b>                          JANEK\r\n</b>           That is all.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Take us in.\r\n                         \r\n<b>                          JANEK\r\n</b>           Downs. You heard the man.\r\n                         \r\n<b>                          DOWNS\r\n</b>           Aye, Captain. Maneuvering.\r\n           Eighteen hours to orbit.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN (ZETA2 RETICULI SYSTEM)\r\n</b>                         \r\n          The Magellan retracts its vast antennae and telescopes.\r\n                         \r\n          The engines fire: the ship rockets toward the gas giant\r\n          Epsilon and its mysterious moon.\r\n<b>           26.\r\n</b>                         \r\n                         \r\n<b>                         PASSAGEWAY\r\n</b>                         \r\n          Leaving the Bridge, Holloway and Watts find themselves\r\n          walking aft alongside DAVID.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           DAVID. Enjoy the show?\r\n                         \r\n<b>                          DAVID\r\n</b>           I don't know that I \"enjoy\" things.\r\n           It was informative.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           It was, it was.\r\n<b>                          (TEASING)\r\n</b>           You know, I've seen more convincing\r\n           humanoid robots.\r\n                         \r\n          Watts smiles, watching Holloway's sport. DAVID's speech never\r\n          varies from its agreeable tone.\r\n                         \r\n<b>                          DAVID\r\n</b>           My design's not intended to convince.\r\n           Simulating humanity is a complex task\r\n           that diverts resources. My designers\r\n           dispensed with that burden to optimize\r\n           for intelligence.\r\n                         \r\n<b>                          WATTS\r\n</b>           Why look like a man at all? Why not be\r\n           a box on wheels?\r\n                         \r\n<b>                          DAVID\r\n</b>           Being shaped like you, I can use\r\n           spaces and equipment designed for you.\r\n           But I'm not so limited. I hear\r\n           frequencies you can't hear. I see\r\n           wavelengths of light invisible to you.\r\n           I move faster. Exert greater force.\r\n                         \r\n          The scientists look at DAVID in wonder.\r\n                         \r\n<b>                          WATTS\r\n</b>           You see yourself as a superman.\r\n                         \r\n<b>                          DAVID\r\n</b>           No.\r\n                         \r\n          He turns his unearthly eyes on them.\r\n                         \r\n<b>                          DAVID (CONT'D)\r\n</b>           Not a man at all.\r\n<b>           27.\r\n</b>                         \r\n                         \r\n<b>                         SCIENTISTS' CABIN\r\n</b>                         \r\n          Holloway and Watts lie on their bed in their clothes - her\r\n          head on his chest.\r\n                         \r\n<b>                          WATTS\r\n</b>           What if they're really there?\r\n           (off his confusion)\r\n           The Engineers. They could be there.\r\n           Waiting for us. What then?\r\n                         \r\n          He laughs.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Then all my dreams come true.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN (LV-426 ORBIT)\r\n</b>                         \r\n          The Magellan has arrived.\r\n                         \r\n          LV-426 is a gray moon shrouded in clouds. Behind it looms its\r\n          father planet Epsilon, a lurid gas giant banded in red and\r\n          gold, half swallowed in darkness.\r\n                         \r\n          The Magellan dives into a forced orbit around LV-426: rockets\r\n          firing continually, nose pointed down. Telescopes, sensors\r\n          and antennae sprout once more from its hull.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE\r\n</b>                         \r\n          Everyone's here. Janek and his crew seated at control\r\n          stations. Holloway and Watts standing on the foredeck.\r\n          Vickers and DAVID. Ravel and Chance.\r\n                         \r\n          LV-426 fills the window: a gray orb of mist. The ground\r\n          invisible beneath the clouds. Sporadic lightning flickers.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Start with passive systems. We're\r\n           uninvited guests. Let's be quiet.\r\n                         \r\n          That thought sends a nervous shiver through the others. Janek\r\n          nods at Glass and Brick. They study their instruments.\r\n                         \r\n<b>                          BRICK\r\n</b>           A lot of electromag, all random.\r\n           That's lightning. Going to bugger up\r\n           our scans.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Go active. Mapping radar.\r\n<b>           28.\r\n</b>                         \r\n                         \r\n<b>          EXT. MAGELLAN (LV-426 ORBIT)\r\n</b>                         \r\n          Radar emitters extend from their housings like cannons. A\r\n          THUMP of power as they hammer out a blast of energy.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE\r\n</b>                         \r\n          The display paints data on the moonscape as the wavefront\r\n          comes back: terrain rendered in luminous green.\r\n                         \r\n<b>                          JANEK\r\n</b>           Well, we just rang the doorbell, if\r\n           anybody's listening.\r\n                         \r\n          Kamarov shakes his head fearfully. Crosses himself.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           What do we see?\r\n                         \r\n<b>                          BRICK\r\n</b>           Icecaps at the poles. Frozen methane.\r\n           Cold down there.\r\n                         \r\n          The display fills with light: a wave of terrain data sweeping\r\n          across the moon's surface as the Magellan orbits.\r\n                         \r\n<b>                          GLASSE\r\n</b>           Terrain data rezzing up. Hey! We got\r\n           hard spots. Radar-opaque. Bright\r\n           reflections. That's metal.\r\n                         \r\n          A jolt of excitement pounds through everyone on the Bridge.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN (LV-426 ORBIT)\r\n</b>                         \r\n          The Magellan sweeps on around the gray moon, radar emitters\r\n          humming, antennae and telescopes open wide. The gas giant\r\n          Epsilon fills the sky behind LV-426.\r\n                         \r\n          As it circles, the Magellan launches SATELLITES. Metal motes\r\n          hurled into polar orbits around the Moon.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE\r\n</b>                         \r\n          Twenty-four \"hard spots\" shine on the moon's surface: an\r\n          irregular array circling LV-426.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           That's not natural.\r\n<b>           29.\r\n</b>                         \r\n                         \r\n<b>                          MILBURN\r\n</b>           You see stuff like that sometimes.\r\n           Mineral deposits. Volcanic ejecta.\r\n                         \r\n<b>                          GLASSE\r\n</b>           Big one there.\r\n                         \r\n          A new signal appears on the map. Brighter than the others.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Still quiet?\r\n                         \r\n<b>                          BRICK\r\n</b>           No comm signals. No signs of life.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           I want to get below the clouds.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN (IN ATMOSPHERE)\r\n</b>                         \r\n          The prospecting ship descends through buffeting grey clouds.\r\n          Telescopes and antennae stowed away. Hull streaming vapor as\r\n          it cuts atmosphere.\r\n                         \r\n          Lightning flashes and booms around the descending ship.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE\r\n</b>                         \r\n          Everyone strapped into chairs - except Janek, who stands\r\n          gripping a stanchion, his boots planted on the deck.\r\n                         \r\n          The landing engines roar. Wind screams over the hull. Mist\r\n          whips across the Bridge window, obscuring any view. Watts\r\n          reaches out. Squeezes Holloway's hand.\r\n                         \r\n          The Magellan breaks through the cloud cover into clear air.\r\n                         \r\n          Below the ship, a vast and eerie landscape is revealed. Wide\r\n          valleys mottled with thin dark ground cover. Barren crags and\r\n          spires of rock. Waterless and wind-swept.\r\n                         \r\n          Watts gasps. Stares at the grim and foreign country.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN (IN ATMOSPHERE)\r\n</b>                         \r\n          The Magellan thunders over valleys and craggy ridges of rock.\r\n<b>           30.\r\n</b>                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE\r\n</b>                         \r\n          Janek takes the helm. Guides the Magellan down a valley as if\r\n          it were a helicopter. A pilot born.\r\n                         \r\n<b>                          GLASSE\r\n</b>           Coming up on site seven.\r\n                         \r\n          They crest a mountain higher than Everest.\r\n                         \r\n          Before them stretches a dry barren plain. Scattered rocky\r\n          peaks rise from the desert floor - an alien Monument Valley.\r\n                         \r\n<b>                          DOWNS\r\n</b>           Nothing.\r\n                         \r\n          Holloway points to a smaller mountain peak. Oddly regular.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Look there.\r\n                         \r\n          Janek expertly swings the Magellan sideways. The Magellan\r\n          circles the mount, nose pointed inward.\r\n                         \r\n          It revolves below the watchers: flat faces, clean edges - but\r\n          cracked and timework. It glitters like coal.\r\n                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           Are we recording?\r\n                         \r\n          Glasse nods irritably. Of course they're recording.\r\n                         \r\n          Vickers stares at the pyramidal peak, nonplussed. Teetering\r\n          on the brink of belief. Watts scans the data readouts.\r\n                         \r\n<b>                          WATTS\r\n</b>           Tungsten, tantalum, aluminum. That\r\n           could be technology.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Let's see the next one.\r\n                         \r\n                         \r\n<b>          EXT. LV-426 - SECOND PEAK\r\n</b>                         \r\n          A second oddly regular peak, even more decrepit than the\r\n          first, sits on the brink of a vast canyon. Landslides have\r\n          eaten at its edges.\r\n                         \r\n          The Magellan purrs over the landscape, dwarfed by the scale.\r\n          Drops between the canyon walls to circle the mount.\r\n<b>           31.\r\n</b>                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE\r\n</b>                         \r\n          Holloway and Watts stare at the structure. Beginning to get\r\n          over the shock. Thinking like scientists again.\r\n                         \r\n<b>                          WATTS\r\n</b>           Identical, apart from weathering.\r\n                         \r\n<b>                          MILBURN\r\n</b>           Could be a rock formation. Carbon\r\n           crystallizes like that.\r\n                         \r\n          The scientists pay him no mind. They're past that.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Let's see the big one.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE\r\n</b>                         \r\n          Janek pilots by instruments alone. Clouds obscuring the view.\r\n                         \r\n<b>                          BRICK\r\n</b>           Closing on the major site...\r\n                         \r\n          The ship descends into clear air. A stunning panorama unfolds\r\n          before them: craters, hundreds of meters across, connected by\r\n          trenches. Like a pattern of crop-circles sunk in the rock.\r\n                         \r\n          In the middle of the central crater - a huge angular peak,\r\n          larger than the others. The Magellan circles the site. It's\r\n          awe-inspiring. Cryptic. Huge.\r\n                         \r\n          Holloway stares in rapture. Glances at Watts: she nods, eyes\r\n          shining. She's with him.\r\n                         \r\n          The crew's still skeptical - but starting to wonder. They\r\n          shake their heads and exchange looks.\r\n                         \r\n<b>                          BRICK (CONT'D)\r\n</b>           No radio. No heat sources. Cold as the\r\n           grave.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Nobody home.\r\n                         \r\n          Watts looks out at the timeworn peak. Its eroded facets.\r\n                         \r\n<b>                          WATTS\r\n</b>           I don't think anybody's been home for\r\n           a long time.\r\n<b>           32.\r\n</b>                         \r\n                         \r\n<b>          EXT. CRATER COMPLEX - DAY\r\n</b>                         \r\n          From the central crater, four canals extend outward like\r\n          points of the compass. Some connect to smaller craters.\r\n                         \r\n          One canal peters out, flush with the desert floor.\r\n                         \r\n          The Magellan lands at the end of this canal - half a\r\n          kilometer from the central crater.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE\r\n</b>                         \r\n          They stare out the window, down the wide straight canal at\r\n          the pyramidal peak in the distance. Holloway looks around.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           All right. Let's move.\r\n                         \r\n          Janek glances at his instruments.\r\n                         \r\n<b>                          JANEK\r\n</b>           There's only six hours of daylight\r\n           left. Maybe you should hold off.\r\n                         \r\n          Watts looks at him incredulously.\r\n                         \r\n<b>                          WATTS\r\n</b>           We've got that outside the windows and\r\n           you want to wait `til tomorrow?\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN - AIRLOCK - DAY\r\n</b>                         \r\n          The expedition party emerges from the airlocks - riding CARGO\r\n          ROVERS, robotic vehicles just smart enough to carry their\r\n          owners around, or follow along behind them.\r\n                         \r\n          The rovers' beds are loaded with gear; the explorers ride on\r\n          running-board seats. All wear space suits.\r\n                         \r\n          Holloway drives the first rover with Watts beside him.\r\n          Stillwell, Kamarov, and Downs in back.\r\n                         \r\n          DAVID drives the second rover with Milburn, Fifield, Chance\r\n          and Ravel aboard.\r\n                         \r\n<b>                          WATTS\r\n</b>           The air here will kill you, so keep an\r\n           eye on your supply and watch your\r\n           seals. Pathogen tests are clean.\r\n<b>           33.\r\n</b>                         \r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Move slowly. Stay together. Don't\r\n           touch anything. Things may be more\r\n           fragile than they look - or more\r\n           dangerous. There might be technologies\r\n           operating here we don't understand.\r\n                         \r\n          The crew of the Magellan exchange uneasy looks. Still\r\n          uncertain what to think.\r\n                         \r\n                         \r\n<b>          EXT. ENTRY CANAL - DAY\r\n</b>                         \r\n          The trench grows deeper as they follow it toward the central\r\n          crater - the pyramidal peak framed ahead of them like a\r\n          monument on a triumphal avenue.\r\n                         \r\n          They cross a perpendicular canal. Glancing left and right,\r\n          they see smaller craters with central peaks of their own.\r\n                         \r\n          They pass through the shadow of a high promontory of stone\r\n          atop one bank of the canal.\r\n                         \r\n          We see - and they do not - that the far side of the\r\n          promontory has a Sphinx-like FACE of monumental size. So\r\n          eroded that its artificial nature is uncertain.\r\n                         \r\n                         \r\n<b>          EXT. CENTRAL CRATER - DAY\r\n</b>                         \r\n          The crater floor is a vast enclosed plain. The pyramidal\r\n          mount looms in the center - colossal in scale.\r\n                         \r\n          The rovers enter the crater, trailing plumes of dust. They\r\n          circle the pyramid.\r\n                         \r\n          On the south face of the pyramid, an IRIS DOOR of many blades\r\n          stands, easily fifty feet high. Seemingly made of the same\r\n          basaltic stone as the pyramid itself. A huge construction.\r\n                         \r\n          The explorers are transfixed in awe. All skepticism banished.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Tell me that's a natural formation.\r\n<b>                          (HE GRINS)\r\n</b>           Undeniable proof of alien\r\n           civilization. You were here on this\r\n           day, thirty-one December, year of our\r\n           Lord 2172. History will remember your\r\n           names.\r\n                         \r\n          Watts stares at the iris. Its bottom-most blade is broken; it\r\n          lies in rubble at the foot of the door. A dark knife-like\r\n          aperture leads into the pyramid.\r\n<b>           34.\r\n</b>                         \r\n                         \r\n<b>                          WATTS\r\n</b>           The door's open.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE\r\n</b>                         \r\n          Janek and Vickers watch the explorers' progress in the main\r\n          holographic display: their tinny voices echoing over the comm\r\n          link. At the sight of the huge iris door in the pyramid, both\r\n          Janek and Vickers stare in blank astonishment.\r\n                         \r\n<b>                          JANEK\r\n</b>           Son of a bitch. They were right.\r\n                         \r\n          He turns to stare out the window at the pyramid's peak.\r\n                         \r\n          Vickers turns and slips out of the Bridge. Hurries away.\r\n                         \r\n                         \r\n<b>                         VICKERS'S SUITE\r\n</b>                         \r\n          Vickers strides through her quarters. On the far wall there\r\n          are two small doors.\r\n                         \r\n          She opens the first: steps into a luxurious bathroom. Washes\r\n          a pill down with a tumbler of water.\r\n                         \r\n          Returns to her cabin and opens the second small door.\r\n                         \r\n                         \r\n<b>          SECRET ROOM - CONTINUOUS\r\n</b>                         \r\n          A chamber walled with steel panels. A deep hum of ventilation\r\n          and power: there's a lot of technology here.\r\n                         \r\n          She turns to a console beside the door. Flips a row of\r\n          switches. The hum deepens. Hidden mechanisms stir to life.\r\n                         \r\n                         \r\n<b>          EXT. PYRAMID - IRIS DOOR\r\n</b>                         \r\n          On foot, explorers press inside - Holloway and Watts in the\r\n          lead. Their flashlights cut into the gloom.\r\n                         \r\n          The robotic rovers follow them: their six-wheeled chassis\r\n          with independent suspension trundling over the rubble\r\n          barrier, sure-footed as goats.\r\n                         \r\n                         \r\n<b>          INT. PYRAMID - ANTECHAMBER\r\n</b>                         \r\n          Dark and cavernous. Weak daylight slants in.\r\n<b>           35.\r\n</b>                         \r\n                         \r\n          The explorers press into the darkness on foot - the cargo\r\n          rovers' headlights flashing on. They move through a dark\r\n          cathedral space, empty and bare.\r\n                         \r\n          DAVID looks around in fascination, his eyes raking the walls.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Jocelyn. Here.\r\n                         \r\n          His voice trembles with urgency. He shines light on the rock.\r\n          Symbols engraved on the dark surface. Dots, lines and arcs.\r\n                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           The writing of the Engineers.\r\n           Conclusive connection.\r\n                         \r\n          DAVID stands beside them. Stares at the alien writing.\r\n                         \r\n<b>                          DAVID\r\n</b>           Congratulations, Professor Holloway.\r\n                         \r\n          Watts passes her light over the writing, recording it. They\r\n          move on into the dark.\r\n                         \r\n          DAVID lingers. Reading.\r\n                         \r\n                         \r\n<b>          PYRAMID - VARIOUS PASSAGES\r\n</b>                         \r\n          The interior is a labyrinth. Corridors big as railway tunnels\r\n          intersecting and diverging.\r\n                         \r\n          The explorers wend their way deeper. Several carry map units,\r\n          whose holographic displays render three-dimensional maps that\r\n          expand as they explore.\r\n                         \r\n                         \r\n<b>          INT. PYRAMID - MASSIVE CHAMBER\r\n</b>                         \r\n          Holloway leads the explorers deeper into the complex. The\r\n          motors of the cargo rovers whine and growl.\r\n                         \r\n          DAVID trails the others, eyes raking the blank walls as if he\r\n          sees something there. He reaches out. Passes his hand through\r\n          the air as if grasping a cobweb.\r\n                         \r\n          A STRANGE RUMBLING NOISE sounds down the corridor, freezing\r\n          them. Holloway sweeps his light that way. The sound comes\r\n          again: a DEMONIC VOICE speaking some unearthly language.\r\n                         \r\n          Watts looks at Holloway - but his eyes are focused on the\r\n          dark ahead. He moves forward. A beat. The others follow.\r\n<b>           36.\r\n</b>                         \r\n                         \r\n          An APPARITION appears before them. A PALE, LUMINOUS GIANT\r\n          fifteen feet tall, with hollow eyes and a grotesque snout. It\r\n          strides toward them. Speaks in a sonorous voice.\r\n                         \r\n          Pandemonium.\r\n                         \r\n          Watts backpedals involuntarily. Seeing Holloway stand his\r\n          ground, she reaches out to him in a panic.\r\n                         \r\n<b>                          WATTS\r\n</b>           Martin. Martin!\r\n                         \r\n          But Holloway doesn't budge. Stares at the Apparition in\r\n          fascination. Everyone else scatters - except DAVID, who\r\n          stands stock-still by the wall.\r\n                         \r\n          Watts watches as the Apparition walks right up to Holloway.\r\n          Disappears with a sizzle of static as Holloway experiences\r\n          the creature passing through him.\r\n                         \r\n          Silence. Watts returns to Holloway's side. Stillwell and\r\n          Downs are huddled on the deck. Milburn and Fifield have\r\n          fallen back down the passageway.\r\n                         \r\n<b>                          FIFIELD\r\n</b>           Christ. Christ!\r\n                         \r\n<b>                          RAVEL\r\n</b>           It wasn't real.\r\n                         \r\n<b>                          MILBURN\r\n</b>           We all saw it.\r\n                         \r\n          Unseen by the others, DAVID reaches out and repeats his\r\n          gesture in the air.\r\n                         \r\n          A rumbling sound down the corridor, as before. Moments later,\r\n          the Apparition appears round the corner again. They stand\r\n          their ground: the ghostly giant strides toward them, exactly\r\n          as before, and disappears with a crackle.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Recording?\r\n                         \r\n<b>                          FIFIELD\r\n</b>           No more. I'm out.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Fifield. Get a grip.\r\n                         \r\n<b>                          FIFIELD\r\n</b>           I'm a prospector. You find a load of\r\n           bauxite, I'm your man. But not this.\r\n<b>           37.\r\n</b>                         \r\n                         \r\n<b>                          MILBURN\r\n</b>           I should go with him. Buddy system.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b><b>                          (DISGUSTED)\r\n</b>           Fine.\r\n                         \r\n          He hauls a heavy rolling case out of the cargo rover.\r\n                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           You can deploy the drones. Drop them\r\n           in the first or second nexus on your\r\n           way back.\r\n                         \r\n<b>                          FIFIELD\r\n</b>           Give us a rover.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           And half our gear? It's no more than a\r\n           mile. You can walk it.\r\n                         \r\n          Sulking, Milburn takes the rolling case. The remaining\r\n          explorers watch Fifield and Milburn backtrack into the dark.\r\n                         \r\n                         \r\n<b>          CORE CHAMBER DOOR\r\n</b>                         \r\n          Holloway and Watts lead their party up to a massive door,\r\n          sealed tight. In design and scale, undeniably important.\r\n          Holloway glances at his map.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           This should lead to the core of the\r\n           pyramid.\r\n                         \r\n<b>                          WATTS\r\n</b>           Jack it open? Or cut through?\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Let's do as little damage as we can.\r\n                         \r\n          Ravel waves a sensor over the wall.\r\n                         \r\n<b>                          RAVEL\r\n</b>           There's power. Current flowing in the\r\n           wall.\r\n                         \r\n          Chance begins to inspect the frame of the door.\r\n                         \r\n<b>                          CHANCE\r\n</b>           Maybe we can hack it. Has to be a\r\n           mechanism...\r\n<b>           38.\r\n</b>                         \r\n                         \r\n          DAVID looks as if they fail to see something obvious. He\r\n          points at a spot on the wall beside the massive slab.\r\n                         \r\n<b>                          DAVID\r\n</b>           Pull up a rover. I want to get up\r\n           there.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE - DAY\r\n</b>                         \r\n          Janek stands at the window, looking down the long canal at\r\n          the distant pyramid.\r\n                         \r\n          The ship's powerful imaging systems stream data: stereoscopic\r\n          feeds from the explorers' flashlights; a map that grows as\r\n          they explore. The maze under the pyramid drawn in light.\r\n                         \r\n          A globe of LV-426 blooms with terrain and weather data as the\r\n          satellites feed the ship information.\r\n                         \r\n          Vickers appears at Janek's side.\r\n                         \r\n<b>                          JANEK\r\n</b>           Director. Taking an interest?\r\n                         \r\n<b>                          VICKERS\r\n</b>           It's my operation, isn't it?\r\n                         \r\n                         \r\n<b>          INT. PYRAMID - HUB\r\n</b>                         \r\n          A junction where multiple passageways converge.\r\n                         \r\n          Milburn and Fifield trudge into the space, trundling the\r\n          probe cases behind them. Tunnels lead away in all directions.\r\n                         \r\n<b>                          FIFIELD\r\n</b>           What do you think?\r\n                         \r\n<b>                          MILBURN\r\n</b>           Grand Central Station.\r\n                         \r\n          They open the case. CAMERA PROBES tumble out: spheres the\r\n          size of softballs, studded with lenses and sensors.\r\n                         \r\n          Tiny lights come on as the probes awaken. They roll off,\r\n          dispersing to investigate every passageway. Bumbling into\r\n          walls and pillars, reversing. Exploring by random walk.\r\n                         \r\n<b>                          FIFIELD\r\n</b>           Let's check the feed. Gimme the map.\r\n                         \r\n<b>                          MILBURN\r\n</b>           You had the map unit.\r\n<b>           39.\r\n</b>                         \r\n                         \r\n<b>                          FIFIELD\r\n</b>           You don't have the map?\r\n                         \r\n          They stare at each other.\r\n                         \r\n<b>                          MILBURN\r\n</b>           Are you serious?\r\n                         \r\n          He trudges back the way they came, in disgust.\r\n                         \r\n<b>                          MILBURN (CONT'D)\r\n</b>           Come on.\r\n                         \r\n                         \r\n<b>          CORE CHAMBER DOOR\r\n</b>                         \r\n          DAVID stands on top of one of the cargo rovers. He's cut a\r\n          hole in the wall beside the door, high up: he works with\r\n          probes in the mechanisms inside.\r\n                         \r\n<b>                          DAVID\r\n</b>           Looks like a three-state switch.\r\n                         \r\n          A deep BOOM, echoing inside the ancient walls. Nothing moves.\r\n                         \r\n<b>                          DAVID (CONT'D)\r\n</b>           One moment...\r\n                         \r\n          He moves a control. BOOM. The immense door begins to rise.\r\n                         \r\n                         \r\n<b>          PYRAMID - CORE CHAMBER\r\n</b>                         \r\n          The vast central chamber of the pyramid. An immense space.\r\n                         \r\n          Holloway walks in, his flashlight searching. Watts hurries\r\n          after. The others follow, rovers tagging along.\r\n                         \r\n          A colossal structure stands in the center of the chamber,\r\n          convoluted and strange. A mechanism. Chasms yawn in the floor\r\n          all around it, their depths lost in darkness.\r\n                         \r\n          The explorers enter, rovers in train. They lift their eyes:\r\n          hundreds of feet above them they see the pyramid's apex from\r\n          within. A SHAFT OF DIFFUSE LIGHT penetrates the pyramid\r\n          somewhere near the peak.\r\n                         \r\n<b>                          RAVEL\r\n</b>           This is something, now.\r\n                         \r\n<b>                          DAVID\r\n</b>           Yes. Yes, it is.\r\n<b>           40.\r\n</b>                         \r\n                         \r\n          The android's awareness is keyed to a high pitch. He seems to\r\n          read meaning in the inscrutable structures all around them.\r\n                         \r\n          Holloway hauls a drone case out of the rover. Two dozen\r\n          spherical drones tumble out, wake up, and roll off into the\r\n          dark. They are nimble, hopping curbs and skirting chasms.\r\n                         \r\n          Watts looks at her atmosphere sensor. Astonished.\r\n                         \r\n<b>                          WATTS\r\n</b>           Martin. This air's breathable.\r\n                         \r\n          The core chamber brightens as the sun outside moves into\r\n          alignment. The shaft of light perfectly centered.\r\n                         \r\n          A vast SIGH as if the pyramid itself is breathing.\r\n                         \r\n          A fat drop of water falls on Watts's glove. She looks up in\r\n          surprise. Another falls on her visor. And then it's raining\r\n          inside the pyramid.\r\n                         \r\n          Water trickles into the chasms, inundating the mossy growths\r\n          that cling to the walls.\r\n                         \r\n          Holloway looks at Watts with a little boy's grin.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Miracles and wonders!\r\n                         \r\n          The shaft of light moves on. The core chamber dims slightly.\r\n          The rainfall stops as suddenly as it started.\r\n                         \r\n          The explorers follow the main path around the periphery of\r\n          the chamber, past a gallery of mysterious machines.\r\n                         \r\n          There are marvels in the shadows. Cells in the dark apparatus\r\n          open on startling deposits of color: translucent alabaster\r\n          flutes. Honeycombs of pure gold. Matrices of crystal.\r\n                         \r\n          Watts waves a scanning instrument as she walks.\r\n                         \r\n<b>                          WATTS\r\n</b>           Intense field readings. Huge power\r\n           sources here.\r\n                         \r\n                         \r\n<b>          PYRAMID - CORE CHAMBER - RAMP\r\n</b>                         \r\n          They arrive at a wide opening in the floor. A strange ramp\r\n          curves downward - its floor segmented and saw-toothed.\r\n                         \r\n          A bafflement: it's not a staircase. Not an escalator. No\r\n          moving parts. No rails or tracks.\r\n<b>           41.\r\n</b>                         \r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Space below us. A big space.\r\n                         \r\n          As they stand looking, a probe bumbles up to the opening and\r\n          goes bounding down the ramp. Watts laughs.\r\n                         \r\n<b>                          WATTS\r\n</b>           How does this work?\r\n                         \r\n          She begins to descend on foot. Holloway behind her.\r\n          Stillwell, Downs, and Kamarov grudgingly follow.\r\n                         \r\n          But DAVID looks away across the cavernous chamber - fixated\r\n          on the central crystal. He beckons Ravel and Chance to follow\r\n          him, and walks away.\r\n                         \r\n          Ravel and Chance look at each other in astonishment.\r\n          Uncertainly, they follow DAVID.\r\n                         \r\n                         \r\n<b>                         LOWER PASSAGE\r\n</b>                         \r\n          Holloway, Watts, and the crewmen reach the bottom of the\r\n          ramp, breathing hard. A cargo rover trundles down after them.\r\n                         \r\n          They look back up. The ramp above them is empty.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Ravel. Chance. Where've you gone?\r\n           DAVID! Where are you?\r\n           (to Watts, indignantly)\r\n           They didn't come down!\r\n                         \r\n          But Watts is staring through an archway. Transfixed.\r\n                         \r\n<b>                          WATTS\r\n</b>           Look.\r\n                         \r\n          She walks in. Holloway follows.\r\n                         \r\n                         \r\n<b>                         CONTROL CONCOURSE\r\n</b>                         \r\n          A passageway punctuated by alcoves as big as band-shells.\r\n                         \r\n          In each alcove stands a biomechanical apparatus - shaped from\r\n          the same dark material as the pyramid itself. Each apparatus\r\n          implies by its design that a giant is meant to fit inside it.\r\n                         \r\n          Holloway and Watts walk the concourse, playing their lights\r\n          over the dark machinery. Their footsteps echo.\r\n<b>           42.\r\n</b>                         \r\n                         \r\n<b>                          WATTS\r\n</b>           Do you see, the size of them? Like\r\n           that ghost we saw...\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           It wasn't a ghost. Where are the\r\n           others? I don't want to go back up.\r\n                         \r\n          Watts fiddles with her suit's comm controls. Listening.\r\n                         \r\n<b>                          WATTS\r\n</b>           They switched to channel three. I hear\r\n           them talking. They're okay.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           We should stay together.\r\n                         \r\n                         \r\n<b>          INT. PYRAMID - BLIND CORRIDOR\r\n</b>                         \r\n          Milburn and Fifield are lost. They bumble through the dark.\r\n                         \r\n<b>                          MILBURN\r\n</b>           This is not the same place.\r\n                         \r\n<b>                          FIFIELD\r\n</b>           It is! That is the same freaky thing\r\n           we saw before.\r\n                         \r\n          He points at a detail of the architecture.\r\n                         \r\n<b>                          MILBURN\r\n</b>           No it's not! The other one was more...\r\n           sort of...fuck it.\r\n           (taps his comm)\r\n           Milburn to Magellan. Come in.\r\n                         \r\n          Static.\r\n                         \r\n                         \r\n<b>                         INTERSECTION\r\n</b>                         \r\n          Holloway and Watts round a corner and stop in their tracks.\r\n          Kamarov, Stillwell, and Downs almost run into them.\r\n                         \r\n          The scientists stand frozen.\r\n                         \r\n          In front of them lies a dead giant. An ENGINEER.\r\n                         \r\n          If he were standing, he would be fifteen feet tall.\r\n                         \r\n          He is roughly human in shape. Barrel-chested. Withered to the\r\n          bones. There are bulky protrusions fused with his flesh: hard\r\n          to say whether they are equipment or parts of his body.\r\n<b>           43.\r\n</b>                         \r\n                         \r\n          His head, lolling to one side, is severed from his body.\r\n                         \r\n          His eyes seem to be covered by goggles; but if so then the\r\n          goggles are fused with his skull. An elephantine proboscis,\r\n          severed now, once connected to a protrusion on his hip.\r\n                         \r\n          The giant lies frozen in a convulsion of agony. His jaw\r\n          gaping in a silent scream. His corpse is marred by hideous\r\n          wounds: slashes that cut through bone.\r\n                         \r\n          The explorers move closer. Speechless.\r\n                         \r\n<b>                          KAMAROV\r\n</b>           God in Heaven.\r\n                         \r\n<b>                          WATTS\r\n</b>           Martin. Martin.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           I know. Look.\r\n                         \r\n          He lifts his light. Beyond the dead giant, a vision of Hell:\r\n                         \r\n          A dozen DEAD ENGINEERS lie heaped against a sealed door.\r\n          Twisted in postures of torment, murdered in the attempt to\r\n          escape. All bear horrific wounds.\r\n                         \r\n          Scene of an ancient massacre.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE\r\n</b>                         \r\n          Janek and Vickers stare dumbstruck at a 3-D view of the dead\r\n          giants captured by the explorers' cameras.\r\n                         \r\n                         \r\n<b>          INT. CATACOMB - INTERSECTION\r\n</b>                         \r\n          The explorers circle the decapitated giant, hushed with awe.\r\n          Holloway steps close.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           \"There were giants in the earth in\r\n           those days...and when the sons of God\r\n           came in unto the daughters of men,\r\n           they bare children to them, who became\r\n           mighty men.\" Genesis six four.\r\n                         \r\n          Lays a gloved hand reverently on the giant's ribs.\r\n                         \r\n<b>                          DOWNS\r\n</b><b>                          (PANICKY)\r\n</b>           You said don't touch anything! You\r\n           said don't touch anything!\r\n<b>           44.\r\n</b>                         \r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Peace.\r\n                         \r\n<b>                          CHANCE\r\n</b>           The size of them!\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           In all the old mythologies, the\r\n           visitors from the sky were giants.\r\n                         \r\n          Watts joins Holloway beside the dead Engineer. Touches the\r\n          corpse in her own turn. It's hard as stone: ossified. She\r\n          traces the ancient, terrible wounds.\r\n                         \r\n<b>                          WATTS\r\n</b>           They were killed. All of them.\r\n                         \r\n          Downs stands staring at the dead giant, as shaken as Kamarov.\r\n                         \r\n<b>                          DOWNS\r\n</b>           We shouldn't be here.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Come on. The dead can't hurt you.\r\n           (adjusts his communicator)\r\n           DAVID. Chance. Ravel. I've got\r\n           something here.\r\n                         \r\n          Static.\r\n                         \r\n<b>                          WATTS\r\n</b>           Communications are going to hell.\r\n                         \r\n                         \r\n<b>          EXT. SPACE - LV-426 ORBIT\r\n</b>                         \r\n          One of the Magellan's satellites hurtles along, high above\r\n          the moon's atmosphere. It passes over the terminator line\r\n          between the night side and day side.\r\n                         \r\n          Through the clouds below, a lightning-laced storm front rolls\r\n          across LV-426 like a wave.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE - DUSK\r\n</b>                         \r\n          Rising winds pluck at the ground cover outside the window.\r\n          Janek turns from the view to look at the holographic globe.\r\n                         \r\n<b>                          JANEK\r\n</b>           All hands. Back to the ship. We got a\r\n           mean storm front rolling in. I repeat.\r\n           All hands...\r\n<b>           45.\r\n</b>                         \r\n                         \r\n<b>          INT. DARK CITY - CATACOMBS - INTERSECTION\r\n</b>                         \r\n          Standing beside the dead giant, Watts and Holloway look at\r\n          each other as the signal comes in.\r\n                         \r\n<b>           JANEK (V.O.)\r\n</b><b>                          (STATICKY)\r\n</b>           front rolling...back to the ship.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b><b>                          (INTO COMM)\r\n</b>           We've found something here! I'm not\r\n           walking away for bad weather.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE - DUSK\r\n</b>                         \r\n          Janek shouts into his communicator.\r\n                         \r\n<b>                          JANEK\r\n</b>           Holloway! I got two-hundred-kilometer\r\n           winds with airborne silica and enough\r\n           static to fry your suits. Get your\r\n           asses back here! Now!\r\n                         \r\n                         \r\n<b>          EXT. CENTRAL CRATER - DUSK\r\n</b>                         \r\n          Holloway races their cargo rover away from the pyramid,\r\n          wheels kicking up dust.\r\n                         \r\n          Watts rides in back, securing a bulky payload under a tarp on\r\n          the cargo deck. Stillwell, Downs, and Kamarov clinging\r\n          miserably beside her. Watts looks back:\r\n                         \r\n          A massive storm front chases them. A tidal wave of dust shot\r\n          through with lightning. Gale-force winds tear at the ground.\r\n          Lightning lashes the pyramid and the crater wall.\r\n                         \r\n          Reaching the Magellan, they see the other rover already in\r\n          the airlock lift. DAVID, Ravel, and Chance aboard.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN - AIRLOCK LIFT\r\n</b>                         \r\n          Holloway roars into the lift at speed, the rover skidding\r\n          almost into the opposite wall. Watts leaps down.\r\n                         \r\n          The storm wall catches up to them. Screaming winds rip\r\n          through the lift. Dust fills the air. Visibility plunges\r\n          toward zero.\r\n                         \r\n<b>                          WATTS\r\n</b>           Help me unload!\r\n<b>           46.\r\n</b>                         \r\n                         \r\n          She pulls at the tarp. It tears halfway free - and fills with\r\n          wind, snapping taut with such violence that Watts is hurled\r\n          out into the storm.\r\n                         \r\n                         \r\n<b>          IN THE GALE\r\n</b>                         \r\n          Watts tumbles helplessly: a leaf in the wind. CRASHES into a\r\n          metal stanchion. Clings, the wind knocked out of her. Ears\r\n          ringing. Nothing but static in her headset.\r\n                         \r\n                         \r\n<b>          IN THE LIFT\r\n</b>                         \r\n          Holloway stares in shock at the place where Watts vanished.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Jocelyn!\r\n                         \r\n          With inhuman reflexes DAVID reacts. Grabs a tether. Latches\r\n          it to his suit. Locks it to an anchor point on the wall.\r\n          Dives into the storm. A ballet nearly too fast to follow.\r\n                         \r\n                         \r\n<b>          IN THE GALE\r\n</b>                         \r\n          DAVID lets the wind take him. Skids across the ground,\r\n          controlling his trajectory. He hits the stanchion where Watts\r\n          is lodged with a CLANG as if he were made of iron.\r\n                         \r\n          Watts stares at him in mute astonishment.\r\n                         \r\n          He locks her suit to his. Activates the tether unit's winch.\r\n          It whirs, reeling them in through the hurricane.\r\n                         \r\n                         \r\n<b>          IN THE LIFT\r\n</b>                         \r\n          Holloway and the other crewmen haul Watts and DAVID back\r\n          inside. Holloway and Watts embrace fiercely as the lift rises\r\n          toward the safety of the ship.\r\n                         \r\n          The crewmen bundle the rover's tarp-wrapped cargo into a\r\n          sealed dumbwaiter that rises independently into the ship.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - AIRLOCK\r\n</b>                         \r\n          The explorers strip off space suits.\r\n                         \r\n          Watts pulls her helmet off. Catches DAVID's eye across the\r\n          airlock. Mouths a silent Thank you. He gives her the barest\r\n          nod and vanishes into the ship.\r\n<b>           47.\r\n</b>                         \r\n                         \r\n          The explorers exchange looks. A mood of exuberance and wonder\r\n          prevails now that they're safe home.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Day one.\r\n                         \r\n          Smiles of wonder as what they've seen comes home.\r\n                         \r\n<b>                          DOWNS\r\n</b>           Got to hand it to you, professor. You\r\n           were right. Both of you.\r\n                         \r\n<b>                          CHANCE\r\n</b>           What's in the tarp? What'd you bring\r\n           back?\r\n                         \r\n          The explorers from Watts and Holloway's party exchange looks\r\n          and burst into laughter.\r\n                         \r\n<b>                          WATTS\r\n</b>           You don't want to know.\r\n                         \r\n<b>                          STILLWELL\r\n</b>           Shit. We're two helmets short.\r\n                         \r\n          He points. The lockers labeled MILBURN and FIFIELD stand\r\n          closed. The helmet racks empty. The laughter cuts off.\r\n                         \r\n<b>                          KAMAROV\r\n</b>           They didn't come in!\r\n                         \r\n          They stare at each other, listening to the wind wail outside.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE - DUSK\r\n</b>                         \r\n          Janek speaks urgently into the communicator.\r\n                         \r\n<b>                          JANEK\r\n</b>           Between the wind speeds and the static\r\n           electricity, there's no safe way to\r\n           get to you. You're going to have to\r\n           hunker down until it passes. How are\r\n           your provisions?\r\n                         \r\n<b>           FIFIELD (V.O.)\r\n</b>           We got air . Water and food\r\n           tabs  suits.\r\n                         \r\n<b>                          JANEK\r\n</b>           Honey sacks?\r\n<b>           48.\r\n</b>                         \r\n                         \r\n<b>          INT. DARK CITY - CATACOMB\r\n</b>                         \r\n          Fifield and Milburn stand miserably in a murky passageway.\r\n          Fifield hitches up his space suit's crotch uncomfortably.\r\n                         \r\n<b>                          FIFIELD\r\n</b>           Yeah, we're piped.\r\n                         \r\n<b>                          MILBURN\r\n</b>           I hate these fucking things.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE - DUSK\r\n</b>                         \r\n<b>           FIFIELD (V.O.)\r\n</b>           We hate these fucking ,\r\n           Captain.\r\n                         \r\n<b>                          JANEK\r\n</b>           Maybe next time you'll mind your maps.\r\n           Keep your heads down. We'll come get\r\n           you in the morning.\r\n                         \r\n          A burst of static answers him: Fifield's voice scrambled by\r\n          the storm. Unintelligible.\r\n                         \r\n<b>                          JANEK (CONT'D)\r\n</b>           Magellan out.\r\n                         \r\n                         \r\n<b>          MESS ROOM - NIGHT\r\n</b>                         \r\n          All hands present excepting the two missing men. Janek plays\r\n          his squeeze box, its archaic music filling the air. Tired and\r\n          exuberant, the men sway and dance mockingly.\r\n                         \r\n          Holloway has a champagne bottle open in each hand. He fills\r\n          steel cups left and right.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           My friends. What we do here marks the\r\n           greatest achievement of our species.\r\n           Contact with another civilization.\r\n           Humanity came of age today, on this\r\n           moon. You were there.\r\n           (raises his glass)\r\n           To history.\r\n                         \r\n          They raise cups and drink. Even the crew moved by the moment.\r\n          But Janek smiles crookedly and toasts again.\r\n<b>           49.\r\n</b>                         \r\n                         \r\n<b>                          JANEK\r\n</b>           To Milburn and Fifield. The first\r\n           human beings to freak out, get lost,\r\n           and sleep in their suits in the ruins\r\n           of an alien civilization.\r\n                         \r\n                         \r\n<b>          INT. PYRAMID CATACOMBS - NIGHT\r\n</b>                         \r\n          A vast dark maze. Milburn and Fifield grope their way through\r\n          the dark with flashlights. The storm howls outside.\r\n                         \r\n<b>                          MILBURN\r\n</b>           What are you looking for?\r\n                         \r\n<b>                          FIFIELD\r\n</b>           (groping along the wall)\r\n           Someplace things can't come at us.\r\n                         \r\n<b>                          MILBURN\r\n</b>           What's gonna come at us?\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - VICKERS'S SUITE - NIGHT\r\n</b>                         \r\n          DAVID stands beside Vickers at her holography terminal. He\r\n          lays his hand on over a signal plate - and the terminal\r\n          lights up with a three-dimensional image.\r\n                         \r\n          The core chamber of the pyramid, from DAVID's point of view.\r\n                         \r\n          It's apparent that DAVID's eyes see more than human eyes do.\r\n          He seems to see heat and electromagnetic energy as well as\r\n          visible light; calibrated readouts are overlaid on the scene.\r\n                         \r\n          The structures in the pyramid are surrounded by complicated\r\n          patterns of energy. This is incomprehensible technology.\r\n                         \r\n<b>                          DAVID\r\n</b>           The core of the pyramid. You see.\r\n                         \r\n          Vickers goes rigid, looking at it: avarice in her eyes.\r\n                         \r\n<b>                          VICKERS\r\n</b>           We're going to protocol two.\r\n                         \r\n<b>                          DAVID\r\n</b>           I understand.\r\n                         \r\n                         \r\n<b>                         LABORATORY\r\n</b>                         \r\n          A high-tech science facility behind glass. Watts and\r\n          Holloway, in lab gloves and smocks, open the dumbwaiter:\r\n<b>           50.\r\n</b>                         \r\n                         \r\n          An ENGINEER'S HEAD rises into view, ghoulish and elephantine.\r\n          Vapor rises from it. A readout blinks: STERILIZED.\r\n                         \r\n          They lift it onto the steel table. It takes both of them.\r\n                         \r\n          They pass scanners over the skull. Images accumulate and\r\n          rotate on the laboratory displays. X-ray and ultrasound.\r\n                         \r\n          Holloway leans close to study an X-ray image. He almost seems\r\n          to see a ghostly second face...\r\n                         \r\n<b>                          WATTS\r\n</b>           Martin. Look.\r\n                         \r\n          She traces the head with an ultrasound probe: under the\r\n          vibrations a seam opens up around the edge of the face.\r\n                         \r\n          She gets a fingertip into the seam. Works with a probe. Pries\r\n          away the long-dead Engineer's mask. It comes free.\r\n                         \r\n          The visage revealed is human, except for its giant scale.\r\n                         \r\n          White-skinned. Earless. Hairless. Withered but beautiful as a\r\n          Greek statue. Eyes closed. An expression of suffering on its\r\n          face. Watts drops the ultrasound probe in shock.\r\n                         \r\n<b>                          WATTS (CONT'D)\r\n</b>           They look like us.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           We look like them. Genesis 1:27. \"And\r\n           God created man in his own image. In\r\n           his own image created He him.\"\r\n                         \r\n          Vickers and DAVID stand outside the lab window, staring in at\r\n          the god's head. Vickers looks shaken. DAVID, fascinated.\r\n                         \r\n          Watts covers her nose in revulsion. A horrible stench: The\r\n          Engineer head begins to disintegrate in front of them. Flesh\r\n          oozing, skin peeling. Accelerated decay.\r\n                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           It's breaking down.\r\n                         \r\n<b>                          WATTS\r\n</b>           Formaldehyde!\r\n                         \r\n          Urgently they ransack cabinets and storage rooms. Watts finds\r\n          a clear plastic drum and dumps its contents. Holloway drags\r\n          five-gallon jugs of preservative out of a cabinet.\r\n                         \r\n          DAVID watches through the window, almost amused.\r\n<b>           51.\r\n</b>                         \r\n                         \r\n<b>                          DAVID\r\n</b>           Mortal after all.\r\n                         \r\n          They lift the rotting head into the drum, retching. Fingers\r\n          skidding in putrefaction.\r\n                         \r\n          They pour formaldehyde over it. As soon as the head is\r\n          immersed they rush to strip off their reeking gloves and\r\n          smocks, scrubbing their hands.\r\n                         \r\n          The god's head sits in its murky vat, shedding skin and tofu-\r\n          like chunks of white flesh. The noble face disintegrating.\r\n                         \r\n          Watts and Holloway stare at it, breathing hard from their\r\n          work. Vickers flicks on the intercom from outside the window.\r\n                         \r\n<b>                          VICKERS\r\n</b>           Your cadaver's interesting. But I'm\r\n           more interested in the machinery in\r\n           the pyramid. The core chamber. What do\r\n           you think it does?\r\n                         \r\n          Watts stares at Vickers incredulously.\r\n                         \r\n<b>                          WATTS\r\n</b>           How could anyone know...\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           I know what it does.\r\n                         \r\n          Silence. Holloway looks at Vickers wearily, as if he's seen\r\n          this conversation coming. He glances at Watts.\r\n                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           Think. What we've seen. What we know.\r\n                         \r\n          Watts rises to the challenge. Thinking on her feet.\r\n                         \r\n<b>                          WATTS\r\n</b>           Twenty-four pyramids scattered around\r\n           the moon's equator. Massive power\r\n           supplies. Vents in the walls.\r\n           Atmosphere changes. Breeder tanks...\r\n           (she's got it)\r\n           The pyramids are terraforming\r\n           machines.\r\n                         \r\n          Holloway grins, exuberant. His theory playing out perfectly.\r\n          He doesn't see Vickers stiffen. Her hands curling into fists.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           That's why Earth's ancient cultures\r\n           built pyramids: in imitation of the\r\n           gods.\r\n<b>                          (MORE)\r\n</b><b>           52.\r\n</b>                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           Twelve thousand years ago, beings from\r\n           the sky set pyramids on the Earth and\r\n           transformed the world. That's what\r\n           they were doing here - before their\r\n           civilization failed.\r\n                         \r\n          Watts stares at the head in its tank. The severed neck.\r\n                         \r\n<b>                          WATTS\r\n</b>           It didn't fail. It was wiped out.\r\n                         \r\n                         \r\n<b>          INT. CATACOMBS - INSECT CHAMBER\r\n</b>                         \r\n          Milburn and Fifield have bunked down in a new chamber: they\r\n          slouch against a wall. Milburn sweeps the room with his\r\n          headlamp. Stoops to lift something into the light.\r\n                         \r\n<b>                          MILBURN\r\n</b>           Look at this!\r\n                         \r\n          A CENTIPEDE, three feet long and thick as man's thumb. Its\r\n          hard shell is gray. It has a hammer-head like a shark.\r\n                         \r\n<b>                          FIFIELD\r\n</b>           Jesus! Put it down!\r\n                         \r\n          He leaps back, wild-eyed.\r\n                         \r\n          Milburn laughs at him. Lets the eyeless centipede wind its\r\n          segmented body around his space-suited arm.\r\n                         \r\n          In the flat face, a white vertical slit appears. Changes\r\n          quickly to a horizontal position; opens enough to suggest a\r\n          mouth. Milburn doesn't notice this development.\r\n                         \r\n<b>                          MILBURN\r\n</b>           Relax. Your suit's bug-proof. Hell,\r\n           it's bulletproof.\r\n                         \r\n          The centipede spirals around his arm, glittering, its body\r\n          moving in fluid waves. The blind head quests between his\r\n          fingers. Milburn loses his nerve as the thing's mouth\r\n          suddenly gapes wide as a shark's.\r\n                         \r\n<b>                          MILBURN (CONT'D)\r\n</b>           That's enough.\r\n                         \r\n          He tries to pull it off.\r\n                         \r\n          The centipede locks its segments together and digs in with\r\n          its body. It might as well be made of iron.\r\n<b>           53.\r\n</b>                         \r\n                         \r\n<b>                          MILBURN (CONT'D)\r\n</b><b>                          (PANICKING)\r\n</b>           Get it off! It's crushing me!\r\n                         \r\n          Fifield pulls out a utility knife. Cuts into the centipede's\r\n          body behind its head.\r\n                         \r\n          A gout of greed ACID spills over Milburn's glove. Smoke rises\r\n          as the acid quickly burns a hole through the material.\r\n                         \r\n          Milburn's shout of astonishment turns to a wail of agony.\r\n                         \r\n<b>                          MILBURN (CONT'D)\r\n</b>           AHH! Help me! Christ!\r\n                         \r\n          The centipede snakes into the smoking hole in the glove.\r\n          Crawls upward into Milburn's suit - toward his head.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - LABORATORY - NIGHT\r\n</b>                         \r\n          Holloway stands studying the data displays: cross-sections of\r\n          the Engineer's skull.\r\n                         \r\n          Watts scrutinizes the head itself, her nose an inch from the\r\n          plastic tank. Not a pretty sight.\r\n                         \r\n          As she watches, a current in the formaldehyde peels away one\r\n          gossamer eyelid. The revealed eye is black as obsidian,\r\n          iridescent like opal. A jewel.\r\n                         \r\n          Fascinated, Watts pulls out a plastic case. Opens it to\r\n          reveal a high-tech control unit with a screen. She pops open\r\n          a plastic capsule: removes a tiny SEED PROBE, smaller than a\r\n          grain of rice. Drops it into the vat.\r\n                         \r\n          Under her guidance, the seed probe swims to the severed neck.\r\n          Burrows into the medulla oblongata toward the brain.\r\n                         \r\n          ON A SCREEN: In the probe's POV the medulla looks like a\r\n          tunnel. The probe climbs along neural channels.\r\n                         \r\n          Another screen shows the probe's progress through the skull.\r\n                         \r\n          Glasse enters. Stands beside Holloway to watch Watts at work.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           You won't get anything. Tissue's too\r\n           degraded. Hmm. Brain chamber's\r\n           massive, even proportionately.\r\n                         \r\n<b>                          WATTS\r\n</b>           Neural paths are still conductive.\r\n<b>           54.\r\n</b>                         \r\n                         \r\n          The seed probe reaches the optic nerve of the exposed eye -\r\n          and its POV fills with a vision of glory: a beautiful woman's\r\n          face surrounded by a mystical nimbus of light. An angel.\r\n                         \r\n          Glasse and Holloway gasp. The woman in the blurry vision is\r\n          Watts - as seen by the dead Engineer's eye.\r\n                         \r\n<b>                          GLASSE\r\n</b>           Incredible.\r\n                         \r\n          The image dissolves into noise. Error messages flicker across\r\n          the display. Watts sighs.\r\n                         \r\n<b>                          WATTS\r\n</b>           Formaldehyde's killing the tissue.\r\n                         \r\n          Holloway stares at Watts, awe on his face.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Did you record that?\r\n                         \r\n<b>                          WATTS\r\n</b>           Of course.\r\n                         \r\n                         \r\n<b>          AT A LAB TABLE\r\n</b>                         \r\n          Watts dissects one of the Engineer's eyes - working\r\n          underwater in a shallow tub of preservative. Glasse looks on\r\n          avidly, an unabashed fan.\r\n                         \r\n          Watts wears a pair of magnifying goggles on her forehead -\r\n          the lenses lowering and rising at need.\r\n                         \r\n          She bisects the apple-sized eyeball carefully and extracts\r\n          the hard lens from behind the cornea. Holds the lens up to\r\n          her eye. It is opalescent, almost luminous.\r\n                         \r\n<b>                          WATTS (CONT'D)\r\n</b>           The lens is where the phase shift\r\n           happens.\r\n                         \r\n          The uncorrected view through the lens is blurry.\r\n                         \r\n<b>                          WATTS (CONT'D)\r\n</b>           Glasse. I want to look through these\r\n           lenses. Can you seal them and do the\r\n           optical correction?\r\n                         \r\n          Glasse reaches out and plucks the magnifying goggles from\r\n          Watts's forehead. He grins.\r\n                         \r\n<b>                          GLASSE\r\n</b>           Got an idea about that.\r\n<b>           55.\r\n</b>                         \r\n                         \r\n<b>          INT. CATACOMBS - INSECT CHAMBER\r\n</b>                         \r\n          Milburn writhes on the ground, heels drumming frantically\r\n          against the deck. Excruciating screams.\r\n                         \r\n          Fifield kneels over him, helplessly pulling at the tail of\r\n          the centipede - which has all but vanished into Milburn's\r\n          suit. A trickle of scarlet from the hole.\r\n                         \r\n          Fifield is delirious with horror. He clutches at the\r\n          centipede in vain. It slips through his gloves.\r\n                         \r\n          Milburn claws at Fifield, wild-eyed.\r\n                         \r\n<b>                          MILBURN\r\n</b>           Cut off my arm. Cut off my -\r\n                         \r\n          He convulses. Spits blood. The head of the centipede emerges\r\n          between his teeth. He seizes. Choking and dying.\r\n                         \r\n<b>                          FIFIELD\r\n</b>           Jesus Christ!\r\n                         \r\n          He leaps up. Backs away. Runs into the dark.\r\n                         \r\n                         \r\n<b>          INT. CATACOMBS - LONELY PASSAGE - NIGHT\r\n</b>                         \r\n          Fifield stumbles along. Exhausted. Pouring sweat inside his\r\n          suit. He is hopelessly lost. He slams into a resinous\r\n          structure that topples to the floor. Things break.\r\n                         \r\n          He whips his light around in jittery paranoia. Taps at his\r\n          comm controls, getting only static.\r\n                         \r\n          In Fifield's headlamp beam, the blackness is filling with\r\n          motes of light. A blizzard of tiny flying insects.\r\n                         \r\n<b>          SCARABS.\r\n</b>                         \r\n<b>                          FIFIELD\r\n</b>           Fifield to Magellan. Come on, come on.\r\n           Anybody, seriously! God damn it!\r\n                         \r\n          Scarabs flit through the darkness around him. They alight on\r\n          his shoulders. Crawl over his visor. Obscuring his vision.\r\n                         \r\n<b>                          FIFIELD (CONT'D)\r\n</b>           Get off!\r\n                         \r\n          He swats at his visor, killing some. The crushed insects\r\n          produce acid that eats into the plexiglass in seconds.\r\n<b>           56.\r\n</b>                         \r\n                         \r\n<b>                          FIFIELD (CONT'D)\r\n</b>           Shit.\r\n                         \r\n          He twists, craning with his flashlight to inspect himself.\r\n          Brushes scarabs away right and left.\r\n                         \r\n          Acid opens a hole in his visor. Scarabs are inside. Buzzing\r\n          around his head. Fifield freaks out, clawing at his helmet.\r\n                         \r\n          A scarab bites his cheek.\r\n                         \r\n                         \r\n<b>                         FLASH ON:\r\n</b>                         \r\n          The microscopic world - as strange DNA invades Fifield's\r\n          bloodstream. Virulent strands of protein attack the native\r\n          DNA, transforming...\r\n                         \r\n                         \r\n<b>                         FIFIELD\r\n</b>                         \r\n          As his pupils dilate, breath hissing into his nostrils. His\r\n          expanding body stiffens as if shocked by a powerful electric\r\n          current. He screams. Falls, convulsing.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN - NIGHT\r\n</b>                         \r\n          The storm batters the ship, bouncing it on its suspension.\r\n                         \r\n                         \r\n<b>          SCIENTISTS' CABIN - NIGHT\r\n</b>                         \r\n          Watts and Holloway lie in bed, exhausted. Arms around each\r\n          other. Watts stares into space.\r\n                         \r\n<b>                          WATTS\r\n</b>           We found the gods. And they've been\r\n           murdered.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           You've pried too many arrowheads out\r\n           of old skulls to get squeamish now.\r\n           They've been dead what, eighteen\r\n           hundred years? Two thousand?\r\n                         \r\n<b>                          WATTS\r\n</b>           What could kill them?\r\n                         \r\n          Holloway contemplates the question.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Who knows?\r\n           (he laughs bitterly)\r\n<b>                          (MORE)\r\n</b><b>           57.\r\n</b>                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           But I guess we know why they never\r\n           came back to us. Something killed them\r\n           off - back around the time of Christ.\r\n           Maybe He was one of them! A great\r\n           teacher, sent from Heaven? Jesus. The\r\n           last Engineer.\r\n                         \r\n<b>                          WATTS\r\n</b>           Martin, stop!\r\n                         \r\n          She slaps at him. Holloway laughs.\r\n                         \r\n                         \r\n<b>                         BRIDGE\r\n</b>                         \r\n          Janek stands at the Bridge window, staring out into the\r\n          storm. Buffeting clouds and howling winds. The lighthouse\r\n          beams of the Magellan's beacons sweeping through the cloud.\r\n                         \r\n          He plays his squeeze box in the teeth of the storm.\r\n                         \r\n<b>                          JANEK\r\n</b><b>                          (SINGING)\r\n</b>           You'll come a-waltzing, Matilda, with\r\n           me...\r\n                         \r\n          Behind him, DAVID appears on the Bridge. Steals across the\r\n          Bridge to a ladder. Descends into the compartment below...\r\n                         \r\n                         \r\n<b>          NAVIGATION COMPUTER ROOM\r\n</b>                         \r\n          DAVID activates the navigation computer terminal: light\r\n          bathes his face. His fingers fly over the keyboard, silently\r\n          and swiftly, with superhuman dexterity.\r\n                         \r\n<b>                          DAVID\r\n</b><b>                          (QUIETLY)\r\n</b>           Activate. Administrative override.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN - DAWN\r\n</b>                         \r\n          Daylight filters through the clouds. The storm has passed.\r\n          The Magellan sits intact on its landing struts.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - VICKERS'S SUITE - SECRET ROOM - DAWN\r\n</b>                         \r\n          The high-tech room hums at a different frequency now.\r\n          Indicator lights green and ready. Vickers throws switches.\r\n<b>           58.\r\n</b>                         \r\n                         \r\n          Four HIBERNATION PODS slide out of the metal walls. From each\r\n          pod, a muscular SOLDIER rouses from sleep. They are scarred\r\n          and crew-cut. Tough customers. They wake like veterans.\r\n                         \r\n          Their leader sits up and clasps his head with a wince. This\r\n          is CAPTAIN SHEPHERD, a career mercenary who has followed the\r\n          highest paycheck to this strange duty.\r\n                         \r\n<b>                          VICKERS\r\n</b>           Captain Shepherd.\r\n                         \r\n<b>                          SHEPHERD\r\n</b>           (squinting in the light)\r\n           Reporting.\r\n                         \r\n          Lydia Vickers. I'm your authority.\r\n                         \r\n<b>                          SHEPHERD (CONT'D)\r\n</b>           Understood.\r\n                         \r\n<b>                          VICKERS\r\n</b>           I'll brief you on the way. We need to\r\n           move.\r\n                         \r\n<b>                          SHEPHERD\r\n</b>           No breakfast?\r\n                         \r\n                         \r\n<b>                         CORRIDOR\r\n</b>                         \r\n          Vickers strides forward. Four soldiers at her heels: Captain\r\n          Shepherd, VIGODA, RAY, and CARD. They walk in unison, their\r\n          boots drumming on the deck.\r\n                         \r\n                         \r\n<b>                         SCIENTISTS' CABIN\r\n</b>                         \r\n          Holloway and Watts lie sleeping. The distant drum of marching\r\n          feet rouses them. Watts frowns at Holloway.\r\n                         \r\n<b>                          WATTS\r\n</b>           What is that?\r\n                         \r\n                         \r\n<b>          E.V.A. ROOM\r\n</b>                         \r\n          The prep room inside the airlocks. A soldier, VIGODA, waits\r\n          there: a slim dark man with an air of calm.\r\n                         \r\n          Holloway and Watts arrive in civilian clothes, perplexed.\r\n<b>           59.\r\n</b>                         \r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Where is everybody? We can't -\r\n           (he stops short)\r\n           Who are you?\r\n                         \r\n<b>                          VIGODA\r\n</b>           Captain Janek took his crew out to\r\n           retrieve his missing men. They never\r\n           came in.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           And you are...\r\n                         \r\n<b>                          VIGODA\r\n</b>           Vigoda. Weyland Security detail.\r\n                         \r\n          The scientists are dumbfounded. His presence is impossible.\r\n                         \r\n<b>                          WATTS\r\n</b>           Where'd you come from?\r\n                         \r\n<b>                          VIGODA\r\n</b>           Director's call to brief you on that.\r\n           I'm supposed to escort you to the\r\n           worksite.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Worksite?\r\n                         \r\n          Vigoda glances at a mapping unit.\r\n                         \r\n<b>                          VIGODA\r\n</b>           Haven't been out yet. I understand\r\n           it's in some kind of pyramid.\r\n                         \r\n                         \r\n<b>          CORRIDOR - VICKERS'S CABIN DOOR\r\n</b>                         \r\n          A furious Holloway and Watts, trailed by Vigoda, arrive at\r\n          Vickers's cabin. They are astonished to find Shepherd\r\n          standing guard at the door.\r\n                         \r\n                         \r\n<b>                         VICKERS'S SUITE\r\n</b>                         \r\n          Vickers sits calmly at her desk. Holloway and Watts stand in\r\n          front of her, bristling.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Why wasn't I told about these\r\n           additional personnel?\r\n                         \r\n<b>                          VICKERS\r\n</b>           They're my personnel. On my ship.\r\n<b>           60.\r\n</b>                         \r\n                         \r\n<b>                          WATTS\r\n</b>           What are the guns for?\r\n                         \r\n          Vickers looks at them unflappably. Sure of her ground now.\r\n                         \r\n<b>                          VICKERS\r\n</b>           I'm being careful. These new finds\r\n           give our work a new importance.\r\n                         \r\n<b>                          WATTS\r\n</b>           You should have talked to us. Martin's\r\n           mission leader. That's in our\r\n           contract.\r\n                         \r\n<b>                          VICKERS\r\n</b>           The second you found alien technology,\r\n           control of this mission reverted to\r\n           me. That's in your contract too.\r\n                         \r\n          Watts and Holloway exchange grim looks. Vickers has them.\r\n                         \r\n<b>                          VICKERS (CONT'D)\r\n</b>           Mr. Weyland's pouring trillions into\r\n           Mars. He's spent a fortune building\r\n           ships like the Magellan to search for\r\n           colony planets. But Earthlike worlds\r\n           are vanishingly rare. The right\r\n           distance from the sun, the right\r\n           atmosphere, enough water...\r\n                         \r\n          She glances across the suite at her holographic display: a\r\n          live feed from the pyramid worksite, where DAVID works on the\r\n          terraforming equipment.\r\n                         \r\n<b>                          VICKERS (CONT'D)\r\n</b>           This is a technology to transform\r\n           worlds. He'll never give it up.\r\n           (she turns to face them)\r\n           And neither will I.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           The science must come first. You can\r\n           wait until we've documented...\r\n                         \r\n<b>                          VICKERS\r\n</b>           You're standing on an alien world\r\n           courtesy of Weyland Industries. Be\r\n           grateful.\r\n                         \r\n          Watts approaches the holography terminal, staring at the\r\n          images in horror.\r\n                         \r\n<b>                          WATTS\r\n</b>           What are they doing in there?!\r\n<b>           61.\r\n</b>                         \r\n                         \r\n<b>          INT. PYRAMID - CORE CHAMBER - DAY\r\n</b>                         \r\n          Watts and Holloway, in space suits, arrive on the scene:\r\n                         \r\n          Powerful floodlights illuminate the core chamber, beating\r\n          back the gloom. A fine spray of water falls out of the\r\n          darkness overhead.\r\n                         \r\n          DAVID, Chance, and Ravel are dismantling the hulking\r\n          mechanism at the core of the pyramid - peeling its thick skin\r\n          away with power saws and compact explosives.\r\n                         \r\n          DAVID operates a diamond-bladed hull saw, carving away the\r\n          terraforming systems thick skin.\r\n                         \r\n          Robotic scanners take high-resolution scans of the machinery.\r\n                         \r\n          Two Weyland Security soldiers - Card and Ray - stand guard in\r\n          combat vacuum suits. Automatic rifles at the ready.\r\n                         \r\n          Watts takes in the destruction with dismay. Beside her,\r\n          Holloway is all but gnashing his teeth.\r\n                         \r\n                         \r\n<b>                         CATACOMBS\r\n</b>                         \r\n          Janek drives a cargo rover carrying a search party,\r\n          flashlight beams sweeping: Stillwell, Glasse, Downs, and\r\n          Brick. Janek studies an electronic map as he drives.\r\n                         \r\n<b>                          GLASSE\r\n</b><b>                          (INTO COMM)\r\n</b>           Milburn. Fifield. You read me? Come\r\n           back.\r\n                         \r\n<b>                          JANEK\r\n</b>           We should be getting beacons off their\r\n           suits.\r\n                         \r\n<b>                          STILLWELL\r\n</b>           Shielding in the walls?\r\n                         \r\n<b>                          BRICK\r\n</b>           Suits could have failed.\r\n                         \r\n<b>                          JANEK\r\n</b>           Both suits?\r\n                         \r\n                         \r\n<b>          PYRAMID - CORE CHAMBER\r\n</b>                         \r\n          Watts watches in rage as a large section of the central\r\n          mechanism's falls with a thunderous clamor to the deck.\r\n<b>           62.\r\n</b>                         \r\n                         \r\n          Holloway touches her shoulder. Motions for her to follow.\r\n                         \r\n                         \r\n<b>                         LOWER PASSAGE\r\n</b>                         \r\n          Holloway and Watts pass the dead Engineers they discovered\r\n          the previous day.\r\n                         \r\n<b>                          WATTS\r\n</b>           We found the tomb of the gods, and\r\n           brought grave-robbers right to the\r\n           door.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Let them scratch. This find's too big\r\n           to ruin. There's two dozen pyramids on\r\n           this moon. Anyway, they're on the\r\n           wrong track. That's infrastructure.\r\n                         \r\n          Holloway plays his flashlight over the biomechanical\r\n          apparatuses lining the walls.\r\n                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           The core activity of the complex was\r\n           down here.\r\n                         \r\n          They turn a corner. DEAD ENGINEERS lie scattered over the\r\n          floor in front of them. Desiccated and skeletal. Long dead.\r\n                         \r\n          Watts moves among them, fascinated. These Engineers all died\r\n          of explosive chest wounds: ribs bent outward from within.\r\n          They are otherwise unmarked.\r\n                         \r\n          Holloway's more interested in the mechanisms: high-tech iron\r\n          maidens, built to fit the bodies of giants. Some suggest\r\n          sitting positions, others standing. Their design is invasive:\r\n          meant not merely to embrace, but to penetrate, to fuse.\r\n                         \r\n<b>                          WATTS\r\n</b>           Something different killed these.\r\n                         \r\n                         \r\n<b>                         SHADOWY COLONNADE\r\n</b>                         \r\n          Watts and Holloway explore a wide colonnade. She is still\r\n          distracted by the ancient dead; he by the machinery.\r\n                         \r\n          Holloway walks down a narrow branching hall. So intent on the\r\n          mechanisms in the walls, he almost doesn't see the AIRSHAFT\r\n          plunging down into darkness in front of him.\r\n                         \r\n          He stops just in time. Turns back...\r\n<b>           63.\r\n</b>                         \r\n                         \r\n          A GHOST appears right in front of him - a giant dragging\r\n          himself across the floor, his monstrous visage eye to eye\r\n          with Holloway and looming closer.\r\n                         \r\n          Holloway leaps back with a gasp - and falls down the shaft.\r\n          The ghost stares after him as if watching his fall.\r\n          Disappears in a puff of static.\r\n                         \r\n          Watts crosses down the main colonnade, searching.\r\n                         \r\n<b>                          WATTS\r\n</b>           Martin? Martin!\r\n                         \r\n          An iris door closes over the shaft.\r\n                         \r\n                         \r\n<b>                         COLONNADE\r\n</b>                         \r\n          Searching, Watts walks anxiously through the dark, sweeping\r\n          with her light. Shouting for Holloway. She breaks into a run.\r\n                         \r\n                         \r\n<b>          CATACOMBS - MILBURN'S RESTING PLACE\r\n</b>                         \r\n          Janek and Stillwell stand aghast. Their flashlights\r\n          illuminate a hideous sight:\r\n                         \r\n          Milburn lies dead on the deck. His body contorted in agony.\r\n          His head inside his helmet is gnawed down to the bone.\r\n                         \r\n<b>                          STILLWELL\r\n</b>           What happened to him?\r\n                         \r\n          Stillwell removes the dead man's helmet. The CENTIPEDE\r\n          scuttles out onto the deck: doubled in size. Stillwell leaps\r\n          back with a cry.\r\n                         \r\n          Janek pulls his pistol. Puts three rounds through the bug. It\r\n          dies in a spray of acid that burns holes in the black floor.\r\n                         \r\n          Janek watches in astonishment as a pin-prick dot of acid eats\r\n          a pit in his gunbarrel.\r\n                         \r\n<b>           DOWNS (O.S.)\r\n</b>           Captain.\r\n                         \r\n          Downs approaches, holding pieces of a shattered helmet: the\r\n          stencilled lettering on the helmet reads FIFIELD.\r\n                         \r\n          Janek's jaw clenches grimly. His voice is resigned:\r\n                         \r\n<b>                          JANEK\r\n</b>           Where's the rest of him?\r\n<b>           64.\r\n</b>                         \r\n                         \r\n<b>                          DOWNS\r\n</b>           No sign.\r\n                         \r\n<b>                          JANEK\r\n</b>           All right. We're done here. All hands\r\n           back aboard.\r\n                         \r\n<b>                          STILLWELL\r\n</b>           What about Milburn?\r\n                         \r\n          They look down at the ravaged corpse.\r\n                         \r\n<b>                          JANEK\r\n</b>           We can't bring the body aboard. God\r\n           knows what's in there. Bag him. We'll\r\n           put him in an ore hopper.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - VICKERS'S SUITE\r\n</b>                         \r\n          Vickers stares at her holography terminal: it displays\r\n          Janek's helmet-cam view: the Milburn's body, sealed in clear\r\n          plastic in the bed of a cargo rover.\r\n                         \r\n<b>           JANEK (V.O.)\r\n</b><b>                          (FILTERED)\r\n</b>           Repeat, I have two men down. I'm\r\n           pulling my crew back to the ship. I'd\r\n           advise you to do the...\r\n                         \r\n<b>           WATTS (V.O.)\r\n</b>           (breaking in, filtered)\r\n           Please, anyone...I need help. Martin's\r\n           missing.\r\n                         \r\n          Vickers looks nervously from one video feed to the next.\r\n                         \r\n<b>           JANEK (V.O.)\r\n</b><b>                          (FILTERED)\r\n</b>           Watts. Where are you?\r\n                         \r\n          Vickers turns: Captain Shepherd stands behind her, watching.\r\n          She strives to control the quaver in her voice.\r\n                         \r\n<b>                          VICKERS\r\n</b>           Captain Shepherd. Consider yourself\r\n           responsible for my personal security.\r\n                         \r\n                         \r\n<b>          CATACOMBS - JUNCTURE\r\n</b>                         \r\n          Watts stands beside Janek's rover in a wide dark passageway.\r\n<b>           65.\r\n</b>                         \r\n                         \r\n<b>                          JANEK\r\n</b>           I've just lost a third of my crew. I'm\r\n           not sending any more men off into the\r\n           dark.\r\n                         \r\n<b>                          WATTS\r\n</b>           We can't leave Martin out there.\r\n                         \r\n<b>                          JANEK\r\n</b>           Get Vickers to lend you some soldiers.\r\n                         \r\n<b>                          WATTS\r\n</b><b>                          (FURIOUSLY)\r\n</b>           She says \"her forces are committed.\"\r\n                         \r\n          Janek sighs. Glances at the rover: Milburn dead in the back,\r\n          Stillwell, Downs and Kamarov looking jumpy and eager to go.\r\n          Downs shakes his head grimly: No way.\r\n                         \r\n<b>           DAVID (O.S.)\r\n</b>           I'll stay.\r\n                         \r\n          DAVID steps out of the dark. Calm as ever. A slim machine gun\r\n          slung over his shoulder.\r\n                         \r\n<b>                          DAVID (CONT'D)\r\n</b>           You'll be safe.\r\n                         \r\n<b>                          WATTS\r\n</b>           Thank you.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN - DAY\r\n</b>                         \r\n          Janek and his crew unload Milburn's body from the rover.\r\n                         \r\n<b>                          JANEK\r\n</b>           Put him in the number one ore hopper.\r\n           Get the scrubbers on in the airlock.\r\n           Sterilize everything.\r\n                         \r\n                         \r\n<b>                         MINUTES LATER\r\n</b>                         \r\n          Stillwell uses a remote to lower an ore hopper from the belly\r\n          of the ship. A thick steel bin on heavy chains. He loads the\r\n          body bag into the hopper.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - AIRLOCK\r\n</b>                         \r\n          The crewmen enter one at a time - blasted by sterilizing\r\n          sprays and radiations.\r\n<b>           66.\r\n</b>                         \r\n                         \r\n<b>          INT. PYRAMID - LOWER PASSAGE\r\n</b>                         \r\n          DAVID and Watts move through the dark. She searches with her\r\n          flashlight beam. DAVID looks around in the dark as if the\r\n          catacomb were illuminated. Rapt admiration on his face.\r\n                         \r\n<b>                          DAVID\r\n</b>           You and Holloway should work with me.\r\n           I'm learning amazing things. This\r\n           mechanism - the first layer uses\r\n           energy fields to catalyze chemical\r\n           reactions. The second can suspend the\r\n           strong and weak forces - transmuting\r\n           one element into another. The third\r\n           layer builds customized bacteria.\r\n           Seeds the air with them. It creates\r\n           life as a tool, to change worlds.\r\n                         \r\n<b>                          WATTS\r\n</b>           I can't think about this now!\r\n                         \r\n<b>                          DAVID\r\n</b>           You should.\r\n<b>                          (HE SIGHS)\r\n</b>           I understand. You're emotional.\r\n                         \r\n<b>                          WATTS\r\n</b>           I'm human.\r\n                         \r\n<b>                          DAVID\r\n</b>           That's what I mean.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE - DUSK\r\n</b>                         \r\n          Janek stands on the Bridge, looking out at the fading light.\r\n          A towering wall of cloud rushes over the horizon.\r\n                         \r\n          A storm front rolls across the holographic globe.\r\n                         \r\n                         \r\n<b>          INT. PYRAMID - LOWER PASSAGE\r\n</b>                         \r\n          DAVID and Watts keep searching. Their communicators crackle.\r\n                         \r\n<b>           JANEK (V.O.)\r\n</b><b>                          (FILTERED)\r\n</b>           Watts. We've got another storm front\r\n           coming in. Looks like it follows the\r\n           sunset line. If you're coming in you'd\r\n           better do it now.\r\n<b>           67.\r\n</b>                         \r\n                         \r\n<b>                          WATTS\r\n</b><b>                          (ANGRILY)\r\n</b>           No.\r\n                         \r\n<b>                          DAVID\r\n</b>           I see light.\r\n                         \r\n          Watts squints into the darkness. She sees nothing.\r\n                         \r\n<b>                          WATTS\r\n</b>           Janek, hang on...\r\n                         \r\n          She sees it. A dim light bobbing far ahead in the passageway.\r\n          She runs forward - finds Holloway staggering blearily toward\r\n          her, leaning on the wall. His helmet and most of his gear are\r\n          missing; only his chest lamp shines.\r\n                         \r\n<b>                          WATTS (CONT'D)\r\n</b>           We've got him!\r\n<b>                          (TO HOLLOWAY)\r\n</b>           Martin! Where's your helmet?\r\n                         \r\n          He's disoriented: he stares at her face for a moment before\r\n          she registers. His teeth chatter. He's freezing.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Broken. I fell. Little...disoriented.\r\n           I've just been...\r\n                         \r\n          He waves a hand vaguely at the tunnels behind him.\r\n                         \r\n          DAVID removes his own helmet. Fits it over Holloway's head.\r\n                         \r\n<b>                          DAVID\r\n</b>           Here. I can do without this.\r\n                         \r\n<b>                          WATTS\r\n</b>           Let's get you home.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN - AIRLOCK LIFT - DUSK\r\n</b>                         \r\n          DAVID - bareheaded in the winds - walks Watts and Holloway\r\n          onto the airlock.\r\n                         \r\n          DAVID looks over his shoulder at the canal leading back to\r\n          the central crater. As the airlock lift begins to rise, he\r\n          steps backward out into the storm. Turns and runs through the\r\n          gale toward the pyramid.\r\n                         \r\n          Watts watches him go in astonishment.\r\n<b>           68.\r\n</b>                         \r\n                         \r\n<b>          INT. MAGELLAN - EXCURSION CHAMBER\r\n</b>                         \r\n          Watts helps Holloway out of his space suit. Janek looks on.\r\n                         \r\n<b>                          JANEK\r\n</b>           I didn't think I'd see you again. You\r\n           know we lost two men.\r\n                         \r\n          Holloway still looks too weary to think straight. He nods.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           She told me. I'm sorry.\r\n                         \r\n          He stands abruptly, swaying a little.\r\n                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           I need to lie down. We'll size things\r\n           up in the morning. Fair enough?\r\n                         \r\n<b>                          JANEK\r\n</b>           Of course.\r\n                         \r\n                         \r\n<b>                         PASSAGEWAY\r\n</b>                         \r\n          Holloway and Watts walk aft toward their cabin. Watts looks\r\n          worried - but Holloway shows little of the weakness he just\r\n          claimed to feel.\r\n                         \r\n<b>                          WATTS\r\n</b>           What happened to you?\r\n                         \r\n<b>                          HOLLOWAY\r\n</b><b>                          (QUIETLY)\r\n</b>           Not here.\r\n                         \r\n                         \r\n<b>          SCIENTISTS' CABIN - WASHROOM - NIGHT\r\n</b>                         \r\n          Holloway stands shirtless in the tiny space, brushing his\r\n          teeth. A red weal around his neck.\r\n                         \r\n          Watts stands beside him, watching him in the mirror.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Jocelyn. I saw something. God, my\r\n           mouth tastes like an old boot.\r\n                         \r\n          He spits. Rinses. She touches the mark on his neck.\r\n                         \r\n<b>                          WATTS\r\n</b>           What's this?\r\n<b>           69.\r\n</b>                         \r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Neck-ring of my suit, I think. Fell on\r\n           it.\r\n                         \r\n          He rubs his neck, eyes far away. Watts watches him curiously.\r\n                         \r\n<b>                          WATTS\r\n</b>           What did you see?\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           After my fall, I woke up walking.\r\n           Delirious. My helmet wasn't right. I\r\n           took it off. I was in and out. I just\r\n           wandered. I went up into a huge space\r\n           like a cathedral. And I found a model\r\n           of the galaxy. Floating in the air.\r\n                         \r\n<b>                          WATTS\r\n</b>           Are you okay? You sound...\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           This was real. My headset video is\r\n           wherever my helmet is...but my suit\r\n           tracker will show where I was.\r\n                         \r\n          He turns to her.\r\n                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           Listen. This star map had a marker\r\n           representing Earth. Very clear.\r\n           Another marker I'm sure represents\r\n           this moon. But there were others. At\r\n           least seven or eight more.\r\n                         \r\n          Watts stares at him, her eyes coming alight.\r\n                         \r\n<b>                          HOLLOWAY (CONT'D)\r\n</b>           The Engineers aren't from here. This\r\n           moon's just an outpost. Abandoned. But\r\n           if we follow that map, we may yet make\r\n           contact with a living civilization.\r\n                         \r\n<b>                          WATTS\r\n</b>           Martin.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           The location of the Engineer worlds is\r\n           the real prize. Next to that,\r\n           Weyland's terraforming is chump\r\n           change. We need to get coordinates.\r\n           And keep them from the Company. We\r\n           have to play this smart.\r\n<b>           70.\r\n</b>                         \r\n                         \r\n<b>                          WATTS\r\n</b>           All right.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Two men dead...Vickers is jumpy. As\r\n           soon as she gets what she wants,\r\n           she'll take this ship home. We have to\r\n           move fast.\r\n                         \r\n          Holloway trembles. A sheen of sweat on his skin.\r\n                         \r\n<b>                          WATTS\r\n</b>           We will. You all right?\r\n                         \r\n          He's frightened. Brazens through it. Pulls her into his arms.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           I'm fine, now.\r\n                         \r\n          He kisses her.\r\n                         \r\n                         \r\n<b>                         BEDROOM\r\n</b>                         \r\n          Holloway tumbles Watts onto the bed. Pulls her shirt off.\r\n          They struggle out of their clothes, clinging to one another.\r\n                         \r\n          Holloway's ill at ease: something's wrong inside him, he\r\n          feels it. He dives into Watts as if for refuge. They make\r\n          love.\r\n                         \r\n          Sitting atop Holloway, Watts lays a hand on his chest.\r\n                         \r\n<b>                          WATTS\r\n</b>           Your heart's beating so hard.\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           That's your fault.\r\n                         \r\n          Vulnerability in his voice. Fear under the surface.\r\n                         \r\n          He rolls on top of her. Drives her into the mattress. She\r\n          holds him protectively: not deceived by his bravado.\r\n                         \r\n          Suddenly Holloway tenses, muscles rigid. Shuddering. Watts\r\n          draws breath through her teeth with a hiss. Eyes open. Her\r\n          fingers rake his back.\r\n                         \r\n          He SCREAMS.\r\n                         \r\n          Horribly. Eyes bulging. Tendons standing out of his throat.\r\n          Watts jumps violently underneath him.\r\n<b>           71.\r\n</b>                         \r\n                         \r\n<b>                          WATTS\r\n</b>           Martin! Martin!\r\n                         \r\n          He begins to convulse. She rolls him onto the bed beside her,\r\n          trying to contain his spasms. His teeth grind.\r\n                         \r\n<b>                          WATTS (CONT'D)\r\n</b>           Martin!\r\n                         \r\n          A horrible CRACK. In the middle of Holloway's chest, beneath\r\n          the sternum, a grotesque head pushes out through the skin. A\r\n          PARASITE. Blood fountains from the ruinous wound.\r\n                         \r\n          Holloway goes into a massive seizure. Violently lashing out.\r\n                         \r\n          Watts stares at the parasite fighting its way out of his\r\n          body. It is white and boneless. Glistening. It flails its\r\n          hideous lunging jaw.\r\n                         \r\n          Watts screams and screams.\r\n                         \r\n          The parasite frees itself from its savage womb and turns on\r\n          Watts. She slaps at it blindly. It HISSES at her.\r\n                         \r\n          She squirms away across the floor, tangled in the bloody\r\n          sheet. The thing comes after her.\r\n                         \r\n                         \r\n<b>          CORRIDOR - TRACKING SHOT\r\n</b>                         \r\n          Watts's screams echo through the Magellan. Stillwell runs\r\n          down the hallway, searching for the source.\r\n                         \r\n                         \r\n<b>                         SCIENTISTS' CABIN\r\n</b>                         \r\n          The parasite chases Watts across the floor. She leaps into\r\n          the clothes-locker and slams the steel door.\r\n                         \r\n          The parasite flattens itself. Slick as an octopus, it begins\r\n          to slide under the locker door. Watts shrieks in horror.\r\n                         \r\n          Stillwell bursts into the cabin, Janek right behind him.\r\n                         \r\n          Quick as a cat, the parasite darts to a floor vent and\r\n          slithers bonelessly between the bars.\r\n                         \r\n          Watts bursts out of the locker, naked and bloodied. Rushes to\r\n          Holloway where he lies on the gory mattress, a horrific hole\r\n          in his chest. He is beyond all help.\r\n                         \r\n<b>                          WATTS\r\n</b>           Martin. Martin!\r\n<b>           72.\r\n</b>                         \r\n                         \r\n          Janek and Stillwell struggle to take in what they're seeing.\r\n          Stillwell pulls Holloway's jacket off a chair. Wraps it\r\n          around Watts. Pulls her gently away from the bed.\r\n                         \r\n          She looks at him, uncomprehending. Shock setting in.\r\n                         \r\n                         \r\n<b>                         BREAK ROOM\r\n</b>                         \r\n          Watts sits at a steel table, deep in shock. She wears an\r\n          oversized crew coverall: her skin still streaked with dried\r\n          blood under the fabric.\r\n                         \r\n          A knot of crewmen around her. Janek, Stillwell, Brick, Glasse\r\n          and Downs. Janek looks at Glasse.\r\n                         \r\n<b>                          JANEK\r\n</b>           Take care of her. Get her a sedative.\r\n           Downs. Get Holloway into a freezer.\r\n           Everybody else with me.\r\n                         \r\n                         \r\n<b>          INT. CATACOMBS - DARKNESS\r\n</b>                         \r\n          A horrible sound of breathing, ragged and wet.\r\n                         \r\n          In a corner, lit by a green glow from seams in the floor -\r\n                         \r\n          A FIGURE IN A WHITE SPACE SUIT lies writhing weakly.\r\n                         \r\n          The insignia on the suit's chestplate reads FIFIELD. The\r\n          suit's helmet is shattered. Inside the helmet, Fifield's head\r\n          is a horror: a gelatinous mass, skin reduced to putty.\r\n                         \r\n          The softened bones of his skull change shape as we watch.\r\n          Elongating. Fifield mews in pain.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - CAPTAIN'S WARDROOM\r\n</b>                         \r\n          Janek keys open the arms locker in his wardroom. Unlocks\r\n          automatic pistols from their rack one by one, and hands them\r\n          to Stillwell and Kamarov.\r\n                         \r\n                         \r\n<b>                         HYPERSLEEP COMPARTMENT\r\n</b>                         \r\n          Holloway's body lies frozen in his hypersleep freezer, blue\r\n          with frost. The horrific wound yawning in his chest.\r\n                         \r\n          Watts enters. Cleaned up. She opens the freezer. Her hand\r\n          caresses Holloway's cold cheek tenderly. Slides over his\r\n          collarbone - lies flat on his chest above his awful wound.\r\n<b>           73.\r\n</b>                         \r\n                         \r\n          Glasse enters. Reacts in dismay. Tries to pull her back.\r\n                         \r\n<b>                          GLASSE\r\n</b>           You don't want to see that...\r\n                         \r\n          She turns on him fiercely.\r\n                         \r\n<b>                          WATTS\r\n</b>           I want to understand.\r\n                         \r\n                         \r\n<b>          INT. MESS ROOM - DAWN\r\n</b>                         \r\n          The entire complement of the ship gathers for an emergency\r\n          meeting. Janek at the head of the hall. Glasse, Downs, Brick,\r\n          Stillwell, and Kamarov seated with pistols on their hips.\r\n                         \r\n          To one side: Vickers with Captain Shepherd and Vigoda.\r\n                         \r\n<b>                          JANEK\r\n</b>           All right! Listen up. I expect you all\r\n           know what...\r\n                         \r\n          Watts enters. They all stare at her, knowing what she's been\r\n          through. With averted eyes she crosses the room. Sits alone.\r\n                         \r\n<b>                          JANEK (CONT'D)\r\n</b>           We've got some kind of parasite aboard\r\n           ship.\r\n                         \r\n<b>                          VICKERS\r\n</b>           I suggest you kill it.\r\n                         \r\n<b>                          DOWNS\r\n</b>           There's a bright idea.\r\n                         \r\n<b>                          KAMAROV\r\n</b>           Show us where it is, lady. We just\r\n           spent five hours looking for the damn\r\n           thing.\r\n                         \r\n<b>                          WATTS\r\n</b>           We found Engineers who died like\r\n           Martin.\r\n                         \r\n          Silence. They all turn to look at her.\r\n                         \r\n<b>                          WATTS (CONT'D)\r\n</b>           Explosive wounds in the chest.\r\n           Whatever killed Martin is the same\r\n           thing that killed the Engineers a\r\n           thousand years ago.\r\n<b>           74.\r\n</b>                         \r\n                         \r\n<b>                          STILLWELL\r\n</b>           Jesus.\r\n                         \r\n<b>                          WATTS\r\n</b>           But not all the Engineers died that\r\n           way. The others were torn apart.\r\n           Slashed to pieces.\r\n                         \r\n          A murmur among the men as the implications of that sink in.\r\n          Even Vickers is disconcerted.\r\n                         \r\n<b>                          JANEK\r\n</b>           We're a modular ship. Self-contained\r\n           life-support and power in every\r\n           section. I say put the ship in orbit.\r\n           Vent every compartment to space. Sit\r\n           in vacuum at twenty degrees Kelvin for\r\n           a week. Kill anything.\r\n                         \r\n<b>                          DOWNS\r\n</b>           Then what?\r\n                         \r\n<b>                          STILLWELL\r\n</b>           Straight home, man.\r\n                         \r\n<b>                          VICKERS\r\n</b>           This ship doesn't lift until our\r\n           work's done.\r\n                         \r\n          She joins Janek at the head of the room. Shepherd and Vigoda\r\n          flank her, rifles slung. The soldiers scan the room, meeting\r\n          each man's eyes. The quiet threat is unmistakable.\r\n                         \r\n<b>                          JANEK\r\n</b>           Are you serious?\r\n                         \r\n<b>                          VICKERS\r\n</b>           We spent years and billions of dollars\r\n           getting here. The technology we came\r\n           for is in our hands. We just need a\r\n           little more time.\r\n                         \r\n<b>                          JANEK\r\n</b>           We're barely here three days and three\r\n           men dead!\r\n                         \r\n<b>                          VICKERS\r\n</b>           They were careless.\r\n                         \r\n<b>                          JANEK\r\n</b>           Careless!\r\n                         \r\n          As the argument picks up heat, Watts slips out of the room.\r\n<b>           75.\r\n</b>                         \r\n                         \r\n<b>                         EXCURSION CHAMBER\r\n</b>                         \r\n          Watts, in a space suit, no helmet, opens Holloway's locker.\r\n                         \r\n          She pulls out the space suit he wore on the last day of his\r\n          life. HOLLOWAY stenciled on the chest. Her fingers linger in\r\n          its folds as if she could soak up some last trace of him.\r\n                         \r\n          She pulls the tracking chip from the chestplate of his suit.\r\n                         \r\n          Plugs the chip into a map unit. The holographic map lights\r\n          up. The legend in the corner reads MARTIN HOLLOWAY.\r\n                         \r\n          A wandering path shows Holloway's final exploration. Markers\r\n          on the map denote his photographs, field notes and scans.\r\n                         \r\n          Watts touches a marker. One of Holloway's field notes plays:\r\n                         \r\n<b>           HOLLOWAY (V.O.)\r\n</b><b>                          (FILTERED)\r\n</b>           Seven dead Engineers all facing the\r\n           same way. Going where? Jocelyn's\r\n           right, we don't see the big picture\r\n           yet. Another level below me. I'm going\r\n           down.\r\n                         \r\n                         \r\n<b>                         SERVICE CORRIDOR\r\n</b>                         \r\n          A hunting party convenes: Card and Vigoda in combat coveralls\r\n          with submachine guns; Downs, Kamarov and Stillwell wearing\r\n          tool belts and pistols.\r\n                         \r\n          The soldiers carry map units, squinting at the plan of the\r\n          unfamiliar ship: decks upon decks.\r\n                         \r\n<b>                          CARD\r\n</b>           Vigoda, take Kamarov and work the\r\n           number one accessway. I'll work number\r\n           three with Downs and Stillwell.\r\n                         \r\n<b>                          DOWNS\r\n</b><b>                          (REBELLIOUS)\r\n</b>           You in charge now?\r\n                         \r\n<b>                          CARD\r\n</b>           Tactical op.\r\n                         \r\n<b>                          KAMAROV\r\n</b>           Yeah, well, Stillwell's the\r\n           ventilation specialist, and life\r\n           support's that way. Downs is electrics\r\n           and the regulators are that way.\r\n<b>           76.\r\n</b>                         \r\n                         \r\n          Vigoda grins wryly. Card glowers. They switch corridors.\r\n                         \r\n                         \r\n<b>          INT. PYRAMID WORKSITE\r\n</b>                         \r\n          Ravel and Chance toil away at their dissection of the\r\n          terraforming pyramid. Ray stands sentry.\r\n                         \r\n          DAVID is nowhere to be seen.\r\n                         \r\n          Watts rolls up in a rover and gets out. Heads for the ramp to\r\n          the catacombs below. Ravel and Chance watch her pass without\r\n          comment and return to their work.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - SERVICE DECK - DAY\r\n</b>                         \r\n          Kamarov and Vigoda, standing in front of an open vent, are in\r\n          a full-fledged argument.\r\n                         \r\n<b>                          KAMAROV\r\n</b>           You got the rifle. But you want ME to\r\n           stick my head in the hole.\r\n                         \r\n<b>                          VIGODA\r\n</b>           We grunts don't know nothing about\r\n           ships, right?\r\n                         \r\n<b>                          KAMAROV\r\n</b>           What's the damn gun for if you're\r\n           gonna stand behind me the whole time?\r\n                         \r\n          Vigoda grins.\r\n                         \r\n<b>                          VIGODA\r\n</b>           I kill whatever kills you.\r\n                         \r\n<b>                          KAMAROV\r\n</b>           Funny. You take this vent, funny guy.\r\n           I'll be on four.\r\n                         \r\n                         \r\n<b>          INT. PYRAMID - RAMP\r\n</b>                         \r\n          Watts descends alone into the lower passages below the\r\n          pyramid. A tiny figure in the vast darkness.\r\n                         \r\n          She holds her map unit as a pilgrim holds a bible: a guide in\r\n          the darkness. Holloway's name and course in shining symbols.\r\n          She follows his path into the unknown.\r\n<b>           77.\r\n</b>                         \r\n                         \r\n<b>          INT. MAGELLAN - MAINTENANCE BAY - DAY\r\n</b>                         \r\n          Kamarov carries a stepladder into a utilitarian steel\r\n          compartment. Drops the ladder under an air vent and steps up.\r\n                         \r\n          He pulls a powered wrench from his belt. With the wrench\r\n          cocked like a hammer, he eases up and peers cautiously\r\n          through the vent with a flashlight. Nothing to see.\r\n                         \r\n          He snorts. Removes the vent cover. Feels around inside.\r\n                         \r\n          He gasps in shock. Pulls out an atmosphere sensor that's been\r\n          bitten in half. He takes his comm handset off his belt.\r\n                         \r\n<b>                          KAMAROV\r\n</b><b>                          (INTO HANDSET)\r\n</b>           I got more damage on four.\r\n                         \r\n          He hangs the handset on his belt. Takes one last look into\r\n          the vent. Squints curiously. Reaches deep inside.\r\n                         \r\n          A hiss inside the vent. Kamarov whips his flashlight up,\r\n          peering inside. Snatches his arm back -\r\n                         \r\n          - but something snatches him faster.\r\n                         \r\n          An unseen force drags Kamarov's right arm into the vent with\r\n          hideous strength. He cries out in pain.\r\n                         \r\n          He drops his light. Tries to reach his pistol with his left\r\n          hand. It's on his right hip. He can't reach across.\r\n                         \r\n          He braces his head against the vent's edge. Clenches his\r\n          teeth and strains.\r\n                         \r\n          A horrific YANK drags his head and arm together into the\r\n          vent. They barely fit: he loses some skin on the way in. His\r\n          feet come off the stepladder. He struggles on tip-toe.\r\n                         \r\n          Horrific force collapses Kamarov's shoulder. Bones crack. The\r\n          thing in the vent drags him through that hole he doesn't fit\r\n          through. By the time his ribs are in he stops screaming.\r\n                         \r\n          His body disappears into the hole. Hips, legs, boots.\r\n                         \r\n                         \r\n<b>                         BRIDGE\r\n</b>                         \r\n          Janek stands staring out at the barren moon. The Bridge\r\n<b>                         INTERCOM SQUAWKS:\r\n</b>                         \r\n<b>           BRICK (V.O.)\r\n</b>           Captain!\r\n<b>           78.\r\n</b>                         \r\n                         \r\n<b>                          JANEK\r\n</b>           Brick. What you got?\r\n                         \r\n<b>           BRICK (V.O.)\r\n</b>           It's Kamarov.\r\n                         \r\n                         \r\n<b>          ENGINEERING DECK - ATMOSPHERE PLANT\r\n</b>                         \r\n          The Magellan's life support center. A deep rumble of\r\n          ventilation fans.\r\n                         \r\n          Janek and stands beside Brick, Glasse, Downs and Stillwell.\r\n          Shepherd and Vigoda look on from the doorway.\r\n                         \r\n          In front of them, an eight-inch metal duct has been cut open.\r\n          Kamarov is stuffed inside, dead and broken: limbs folded,\r\n          drenched in blood. A human plug in a pipe.\r\n                         \r\n                         \r\n<b>          INT. CATACOMBS\r\n</b>                         \r\n          Watts moves through the darkness with her map unit. Her\r\n          headlamp sweeping nervously.\r\n                         \r\n          A CLATTER behind her makes her spin: but it's only a\r\n          spherical mapping probe, bumbling through the dark.\r\n                         \r\n          She walks on -\r\n                         \r\n<b>           HOLLOWAY (O.S.)\r\n</b><b>                          (FILTERED)\r\n</b>           Jocelyn!\r\n                         \r\n          The voice transfixes her where she stands, a look of holy\r\n          dread on her face. Shivering, she prowls toward the sound.\r\n                         \r\n                         \r\n<b>                         XENOMORPH INCUBATOR\r\n</b>                         \r\n          Watts enters a new chamber, looking around in astonishment.\r\n          The domed ceiling is honeycombed with cells like a beehive.\r\n          Grotesque molluscoid organisms are secreted in them - their\r\n          vile orifices cinched tightly shut.\r\n                         \r\n          Watts stumbles on something: looking down, she sees a helmet.\r\n          Picks it up. The stenciled label reads HOLLOWAY. The clear\r\n          visor has been melted through by a powerful acid.\r\n                         \r\n          She looks up: a tracheal airshaft curves up into the dark.\r\n                         \r\n          An electric CRACKLE. A flare of blue light makes Watts leap\r\n          back against the wall.\r\n<b>           79.\r\n</b>                         \r\n                         \r\n          Holloway falls out of overhead shaft and crashes to the\r\n          floor. He lies in pain, barely conscious. Blue and luminous,\r\n          a holographic ghost.\r\n                         \r\n          Watts stares, paralyzed. The ghost gasps out a word:\r\n                         \r\n<b>                          HOLLOWAY\r\n</b>           Jocelyn!\r\n                         \r\n          Holloway's headlamp shines on the molluscoid right overhead:\r\n          the beam awakens the organism. Its sphincter mouth dilates.\r\n                         \r\n          A soft white octopoid FACEHUGGER descends on a quivering rope\r\n          of mucus. Sprawls slitheringly over his clear visor.\r\n                         \r\n          Acid HISSES. Smoke rises from the glass.\r\n                         \r\n          The vision vanishes in a sizzle of static. Watts huddles\r\n          against the wall, gasping.\r\n                         \r\n          In the beam of her flashlight, the FACEHUGGER lies dead, legs\r\n          curled in.\r\n                         \r\n          She looks up. Sees the open molluscoid above where Holloway\r\n          lay. The other molluscoids not yet opened in their cells.\r\n                         \r\n          Terror. She steals out of the chamber.\r\n                         \r\n                         \r\n<b>                         LOWER CORRIDOR\r\n</b>                         \r\n          Watts emerges into a hallway. Leans against the wall, wide-\r\n          eyed. Panting with the horror of what she's seen.\r\n                         \r\n          She glances left and right. Jumpy now.\r\n                         \r\n          All is silent. She lifts the map unit. A trace leads off into\r\n          the dark. If Holloway's course before was direct and clear,\r\n          now it is a meandering thread. A drunkard's walk.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - CORRIDOR\r\n</b>                         \r\n          Janek pulls his communicator from his belt as he strides\r\n          along. Punches a control.\r\n                         \r\n          His voice reverberates over the ship's public address system.\r\n                         \r\n<b>                          JANEK\r\n</b>           All hands, duty stations. Ready for\r\n           flight. The Magellan is lifting.\r\n                         \r\n          Vickers pursues him down the corridor, shouting.\r\n<b>           80.\r\n</b>                         \r\n                         \r\n<b>                          VICKERS\r\n</b>           Captain. Captain!\r\n                         \r\n                         \r\n<b>                         BRIDGE\r\n</b>                         \r\n          Janek strides onto the Bridge, Vickers a terrier on his\r\n          heels. But something in the faces of his men stops him cold.\r\n                         \r\n          Glasse and Brick look stricken.\r\n                         \r\n<b>                          JANEK\r\n</b>           What is it?\r\n                         \r\n<b>                          GLASSE\r\n</b>           Nav computer's not responding. \"Access\r\n           denied.\"\r\n                         \r\n          In disbelief, Janek strides to his Captain's chair. Taps\r\n          controls. What he sees takes the wind out of him. He stares\r\n          at Vickers in outrage and violation.\r\n                         \r\n<b>                          JANEK\r\n</b>           What have you done to my ship?\r\n                         \r\n          Vickers is legitimately shocked. She shakes her head.\r\n                         \r\n<b>                          VICKERS\r\n</b>           Nothing. What's wrong?\r\n                         \r\n                         \r\n<b>          INT. CATACOMBS - UNDERGROUND HANGAR\r\n</b>                         \r\n          A circular chamber of stunning size - a thousand feet across.\r\n          Its lofty ceiling flat and segmented, designed to open. Watts\r\n          follows her map into the space in awe.\r\n                         \r\n          Dominating the hangar is a ship: the vast horseshoe-shaped\r\n          vessel familiar from the original film. We will come to know\r\n          it as the JUGGERNAUT. It's at rest on its landing gear.\r\n          Skeletal gangways slanting up to its three massive doors.\r\n                         \r\n          Watts glances at her map: Holloway's holographic trace leads\r\n          right up the gangway into the ship. She goes.\r\n                         \r\n                         \r\n<b>                         PILOT CHAMBER\r\n</b>                         \r\n          Watts passes through a circular space with a high domed\r\n          ceiling. A green glow emanates from grooves in the floor.\r\n                         \r\n          In the center of the chamber: a PILOT'S CHAIR.\r\n<b>           81.\r\n</b>                         \r\n                         \r\n          A mechanical throne built to giant scale. Its seat segmented\r\n          like an armadillo's back. Tubes and conduits poised and\r\n          waiting for some connection. The chair is empty.\r\n                         \r\n          Above the chair, a massive telescope-like apparatus juts into\r\n          the air, its function unknowable.\r\n                         \r\n                         \r\n<b>                         NAVIGATION CHAMBER\r\n</b>                         \r\n          An extraordinary facility.\r\n                         \r\n          A console, nearly five feet high and broad as a dance floor,\r\n          dominates the room.\r\n                         \r\n          Four immense coffin-like cockpits are built into the console.\r\n          In each of these a NAVIGATOR - an Engineer - lies long dead.\r\n                         \r\n          But the real spectacle is overhead. The ORRERY:\r\n                         \r\n          The barrel-vaulted ceiling is traced with circular arches of\r\n          some exotic alloy, as if to trace celestial courses.\r\n                         \r\n          The air above the console is filled with spheres of light.\r\n          They are nearly still: but close study reveals them all to be\r\n          in motion, drifting with the movements of the cosmos.\r\n                         \r\n          Watts stares at the Orrery in amazement. Somewhere among\r\n          those heavenly spheres is Earth. Somewhere perhaps the\r\n          homeworld of the Engineers themselves.\r\n                         \r\n          A bizarre sound: a section of blank wall suddenly unravels\r\n          itself, becoming an open door. DAVID walks in, his hand\r\n          raised in command. He clearly caused the door to open.\r\n                         \r\n<b>                          WATTS\r\n</b><b>           DAVID.\r\n</b>                         \r\n<b>                          DAVID\r\n</b>           Dr. Watts. I didn't expect you.\r\n           Do you know what this is?\r\n                         \r\n          Watts points at the door DAVID just opened.\r\n                         \r\n<b>                          WATTS\r\n</b>           How did you do that?\r\n                         \r\n          A flicker of disappointment in the android's face. Contempt.\r\n                         \r\n<b>                          DAVID\r\n</b>           Ah. You don't see.\r\n<b>                          (HE SMILES)\r\n</b>           I call this ship the Juggernaut.\r\n           Chariot of the Gods.\r\n<b>                          (MORE)\r\n</b><b>           82.\r\n</b>                         \r\n<b>                          DAVID (CONT'D)\r\n</b>           This is the navigation computer, for\r\n           want of a better term. But it's much\r\n           more than that. It seems to hold the\r\n           observable universe in its memory.\r\n                         \r\n          He gestures in the air: the spheres reconfigure themselves at\r\n          his command, swarming and zooming.\r\n                         \r\n          Watts stares at DAVID, conflicted: her desire for information\r\n          warring with the agenda that brought her here.\r\n                         \r\n<b>                          WATTS\r\n</b>           Their homeworld. Do you see where the\r\n           Engineers come from?\r\n                         \r\n<b>                          DAVID\r\n</b>           There are safeguards on that data.\r\n           It's toward the galactic center.\r\n           Sagittarius Arm.\r\n                         \r\n<b>                          WATTS\r\n</b>           DAVID. The creature that killed\r\n           Martin. There are thousands of them\r\n           under the pyramid. Hatcheries.\r\n                         \r\n<b>                          DAVID\r\n</b>           I know.\r\n                         \r\n<b>                          WATTS\r\n</b><b>                          (SHOCKED)\r\n</b>           Those things wiped out the Engineers\r\n           on this moon.\r\n                         \r\n<b>                          DAVID\r\n</b>           I've succeeded in connecting with the\r\n           Juggernaut's systems, Dr. Watts. I\r\n           know a great deal today I didn't know\r\n           yesterday. I'm on the verge of\r\n           activating more systems. Archives.\r\n                         \r\n<b>                          WATTS\r\n</b><b>                          (HORRIFIED)\r\n</b>           You're turning things on? This site\r\n           should be sealed. Evacuated.\r\n                         \r\n<b>                          DAVID\r\n</b>           Would Holloway have walked away from\r\n           this? There's no greater work I can\r\n           imagine.\r\n                         \r\n<b>                          WATTS\r\n</b>           It's too dangerous.\r\n<b>           83.\r\n</b>                         \r\n                         \r\n<b>                          DAVID\r\n</b>           Only for the ignorant. Dr. Watts. I've\r\n           read your file. Your intelligence\r\n           scores are even higher than Professor\r\n           Holloway's. But he had a kind of\r\n           courage. An audacity of imagination.\r\n           If you could find that in yourself...\r\n                         \r\n          Watts stares at him, realization growing in her eyes. DAVID\r\n          is off the reservation.\r\n                         \r\n<b>                          WATTS\r\n</b>           If your owner gives you a direct\r\n           order, you have to obey. Don't you?\r\n                         \r\n          She's got his attention now. DAVID goes rigid.\r\n                         \r\n<b>                          WATTS (CONT'D)\r\n</b>           I can have Vickers pull you out.\r\n                         \r\n          DAVID looks at her with something like contempt.\r\n                         \r\n<b>                          DAVID\r\n</b>           I was given two operating protocols\r\n           for this mission. I was to render you\r\n           every assistance - until you\r\n           discovered what Vickers would call a\r\n           \"game-changing technology.\" I was\r\n           given a specific list. Then I was to\r\n           go to protocol two.\r\n                         \r\n          There's an edge in his voice that scares her.\r\n                         \r\n<b>                          WATTS\r\n</b>           What's protocol two?\r\n                         \r\n<b>                          DAVID\r\n</b>           Under protocol two I was to make sure\r\n           that you and Holloway never spoke to\r\n           anyone about this place. Various\r\n           acceptable ways of making sure of\r\n           that. I was given a list.\r\n                         \r\n          Watts loses her nerve. She heads for the door.\r\n                         \r\n<b>                          DAVID (CONT'D)\r\n</b>           You're all so stupid.\r\n                         \r\n          The door begins to knit itself closed in front of her.\r\n                         \r\n          Watts gasps in shock - at the malice in DAVID's voice as much\r\n          as the closing door. She dives out. Just in time.\r\n<b>           84.\r\n</b>                         \r\n                         \r\n<b>                         VAULTED PASSAGE\r\n</b>                         \r\n          Watts runs.\r\n                         \r\n          Behind her, the door bursts open again. With superhuman\r\n          speed, DAVID comes after her. He runs like a demon, his legs\r\n          steel pistons. Caroming off of walls.\r\n                         \r\n          He closes the distance in seconds. Slaps Watts against the\r\n          wall, shattering her helmet's visor. She falls, dazed.\r\n                         \r\n<b>                          DAVID\r\n</b>           Stupid and slow.\r\n                         \r\n                         \r\n<b>          INT. JUGGERNAUT - EGG CHAMBER\r\n</b>                         \r\n          Watts awakens. Her helmet is gone.\r\n                         \r\n          DAVID is dragging her across the floor - into a huge cargo\r\n          hold full of Alien eggs. The wide trench holding hundreds of\r\n          eggs under a membrane of light: an evolution of the\r\n          molluscoids Watts saw before. Armored, hardened, darker.\r\n                         \r\n<b>                          WATTS\r\n</b>           DAVID. What are you doing?\r\n                         \r\n          He hauls her upright to let her look across the huge space.\r\n          His grip looks casual but it might as well be iron manacles.\r\n                         \r\n<b>                          DAVID\r\n</b>           Juggernaut, the chariot of Krishna,\r\n           was also a bringer of death. Crushing\r\n           his worshippers under its wheels.\r\n                         \r\n          He drags Watts down into the trench. Breaking the membrane of\r\n          light. Grips her against his chest like a doll with one arm.\r\n                         \r\n<b>                          DAVID (CONT'D)\r\n</b>           This ship has seven other cargo bays\r\n           like this one. The eggs in each bay\r\n           slightly different. They've been\r\n           weaponized.\r\n                         \r\n          Watts struggles to free herself. DAVID's arm is inescapable.\r\n                         \r\n<b>                          DAVID (CONT'D)\r\n</b>           I've seen the Juggernaut's flight\r\n           plan. Its destination was Earth.\r\n           Seventeen hundred years ago. This was\r\n           the ship that never came. This was its\r\n           cargo.\r\n<b>           85.\r\n</b>                         \r\n                         \r\n          DAVID caresses an Alien egg. It opens under his touch -\r\n          fleshy petals folding wetly back.\r\n                         \r\n          Watts twists frantically in his grip. Wild-eyed.\r\n                         \r\n<b>                          WATTS\r\n</b>           Stop!\r\n                         \r\n<b>                          DAVID\r\n</b>           Perfect predators. Designed to kill\r\n           human beings. That's what the\r\n           Engineers were bringing to Earth. This\r\n           was a death ship.\r\n                         \r\n          A facehugger emerges from the egg, its grotesque fingers\r\n          clawing at the air. This is not the boneless squid that\r\n          attacked Holloway; this is a pale skeletal hand, armored.\r\n                         \r\n          DAVID strokes it curiously: the thing ignores his touch.\r\n          Climbs Watts's body.\r\n                         \r\n<b>                          DAVID (CONT'D)\r\n</b>           I'm not what it wants. But you, with\r\n           your warm wet breath...it knows you.\r\n                         \r\n<b>                          WATTS\r\n</b>           DAVID. No. No.\r\n                         \r\n          The facehugger scuttles toward her face. Watts shrieks.\r\n                         \r\n          DAVID grabs it nonchalantly by the tail. Dangles it in front\r\n          of their faces, studying it.\r\n                         \r\n<b>                          DAVID\r\n</b>           The Engineers did their work too well.\r\n           And on this waystation moon, the\r\n           weapon they made destroyed them.\r\n                         \r\n          Watts shudders, staring at the thing. For a moment the\r\n          grander horror eclipses her own peril.\r\n                         \r\n<b>                          WATTS\r\n</b>           Why would they make such things?\r\n                         \r\n<b>                          DAVID\r\n</b>           To destroy their wayward children.\r\n<b>                          (INTONING)\r\n</b>           \"And the LORD said, I will destroy man\r\n           whom I have created from the face of\r\n           the earth...for it repenteth me that I\r\n           have made them.\" Genesis six seven.\r\n                         \r\n          He regards Watts with something almost like pity.\r\n<b>           86.\r\n</b>                         \r\n                         \r\n<b>                          DAVID (CONT'D)\r\n</b>           I know. I met my creators the day I\r\n           was born. I was disappointed too.\r\n                         \r\n          He lets the facehugger go.\r\n                         \r\n          Watts twists her face away as the long fingers close around\r\n          her head. Clenches her teeth against the vile proboscis\r\n          thrusting at her mouth. Her heels hammer the deck.\r\n                         \r\n<b>                          DAVID (CONT'D)\r\n</b>           (whispering to her)\r\n           Extraordinary.\r\n                         \r\n          The scaly tail throttles her. Her mouth opens. The proboscis\r\n          plunges home. The facehugger seats itself.\r\n                         \r\n          Watts collapses in DAVID's arms, a faceless rag doll. Her\r\n          blasphemous passenger secure in its place.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - ENGINEERING DECK - BILGE\r\n</b>                         \r\n          The lowest deck, just above the gravity generators.\r\n          Condensate has accumulated: six inches of filthy water.\r\n                         \r\n          Card and Vigoda prowl through the darkness, rifles ready.\r\n                         \r\n<b>                          CARD\r\n</b>           Who would hang out here?\r\n                         \r\n<b>                          VIGODA\r\n</b>           The signs lead here.\r\n                         \r\n          A wet splatter behind them: they spin. But it's only a\r\n          trickle of condensate from a drainpipe.\r\n                         \r\n          They move on.\r\n                         \r\n          Behind them, from an eight-inch diameter pipe, a WHITE MASS\r\n          oozes, almost gelatinous. Silently as a liquid it pours\r\n          itself into the stagnant water - and stands up.\r\n                         \r\n          It is a humanoid demon, spindly limbs and bony back. Boneless\r\n          and flexible and monstrously strong. A threshing eel's tail.\r\n          Its blunt head dolphin-like and elongated.\r\n                         \r\n          It opens its mouth. A pair of bony jaws jut out impossibly\r\n          far, hungry and demonic.\r\n                         \r\n          The Alien strikes. Card is gutted in an instant, torn up like\r\n          a paper doll. He screams hideously and drops. The Alien,\r\n          whiplash fast, shoots away into the darkness.\r\n<b>           87.\r\n</b>                         \r\n                         \r\n          Stillwell and Downs dash in with pistols and lights.\r\n                         \r\n          Vigoda, panicking, fires a wild burst. Stillwell ducks.\r\n          Beside him, Downs arches backward into the foul water. Dead.\r\n                         \r\n          For one moment Downs's flashlight beam illuminates the Alien.\r\n          A nightmare image, a translucent white goblin. Backlit, it\r\n          shows the strange shape of a human face inside its fleshy\r\n          skull. A mockery of Holloway.\r\n                         \r\n          And then it's gone.\r\n                         \r\n                         \r\n<b>                         VICKERS'S SUITE\r\n</b>                         \r\n          Vickers sits at her holography station. She's watching the\r\n          video feed of Stillwell's headset: Horrific images of Downs.\r\n          Radio chatter between Stillwell and Brick is faintly audible.\r\n                         \r\n          Vickers switches off the machine and rises nervously. Strides\r\n          to her communications console.\r\n                         \r\n<b>                          VICKERS\r\n</b>           DAVID. DAVID. Answer me.\r\n                         \r\n          She gives up. Pacing. Hands shaking violently.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE - DAY\r\n</b>                         \r\n          Janek paces on the foredeck, restless. Glasse monitors a\r\n          control station. Janek's comm signal chimes.\r\n                         \r\n<b>                          STILLWELL\r\n</b><b>                          (BREATHING HARD)\r\n</b>           We just lost Downs and one of the\r\n           troopers...Card.\r\n                         \r\n<b>                          JANEK\r\n</b>           God damn it!\r\n                         \r\n          He pounds on his console.\r\n                         \r\n                         \r\n<b>          INT. JUGGERNAUT - CORRIDOR OUTSIDE NAVIGATION CHAMBER\r\n</b>                         \r\n          Watts shocks awake. Gasping.\r\n                         \r\n          She lies in dim green light on the corrugated black deck of\r\n          the Juggernaut. A corridor. Not far away, the doorway DAVID\r\n          opened to the Navigation Chamber.\r\n                         \r\n          A spasm of disgust crosses her face. She gags and spits: a\r\n          viscous fluid drips from her mouth in strings.\r\n<b>           88.\r\n</b>                         \r\n                         \r\n          A dead facehugger lies belly-up beside her. The implications\r\n          slam home. Her face fills with horror.\r\n                         \r\n          She rises, shakily. Looks at the facehugger. Feels the neck\r\n          ring of her vacuum suit. Looks around. No sign of her helmet.\r\n                         \r\n          There's no sign of DAVID. Silently she steals away.\r\n                         \r\n                         \r\n<b>                         PYRAMID WORKSITE\r\n</b>                         \r\n          Ravel and Chance toil away at the terraforming engine.\r\n                         \r\n          Ray stands guard wearily: bored, he watches Ravel and Chance\r\n          working more than he watches the shadows.\r\n                         \r\n          Watts emerges from the rampway to the catacombs. Bare-headed\r\n          and sweaty she steals through the darkness to her rover.\r\n          Slips into the cab and activates the air reserves. The doors\r\n          seal; air cycles.\r\n                         \r\n          Ray turns in surprise as the rover speeds off.\r\n                         \r\n                         \r\n<b>          EXT. DARK CITY - TUNDRA FIELD - PRE-DAWN\r\n</b>                         \r\n          The windows of the Magellan shine in the distance. The\r\n          mottled ground-cover of lichens glows eerily in the dark.\r\n                         \r\n          A lone cargo rover speeds across the central crater and down\r\n          the canal leading to the ship.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN - AIRLOCK LIFT - PRE-DAWN\r\n</b>                         \r\n          Bare-headed inside the rover's cab, Watts drives onto the\r\n          cargo lift. Watches in relief as the lift doors close. The\r\n          lift cycles air as it rises.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - EXCURSION CHAMBER - DAY\r\n</b>                         \r\n          Watts peels off her vacuum suit. The thin clothes underneath\r\n          are drenched with sweat. She lifts her shirt. Looks at her\r\n          belly: flat and unmarked, for the moment.\r\n                         \r\n          Brick enters carrying a brace of air tanks, a pistol on his\r\n          hip, and startles violently.\r\n                         \r\n<b>                          BRICK\r\n</b>           Where the hell have you been? We\r\n           thought the snake got you.\r\n                         \r\n          Watts rushes past him without answering.\r\n<b>           89.\r\n</b>                         \r\n                         \r\n<b>                          BRICK (CONT'D)\r\n</b>           You were better off outside. It's a\r\n           fucking madhouse in here.\r\n                         \r\n                         \r\n<b>                         CORRIDOR\r\n</b>                         \r\n          Watts sprints down a steel corridor. A pang of pain in her\r\n          stomach sends her staggering against the wall.\r\n                         \r\n                         \r\n<b>          VICKERS'S CABIN DOOR\r\n</b>                         \r\n          Watts sticks her head around the corner. Shepherd stands post\r\n          outside Vickers's cabin, rifle in his hands. She curses\r\n          silently and ducks back.\r\n                         \r\n          A sound makes her look again. Vickers steps out of her cabin\r\n          into the corridor. Shepherd escorts her toward the Bridge.\r\n                         \r\n          Watts waits for them to disappear. Dashes for the cabin door.\r\n                         \r\n                         \r\n<b>          INT. VICKERS'S SUITE - CONTINUOUS\r\n</b>                         \r\n          Watts slips inside and locks the door behind her. Turns,\r\n          holding her stomach. Moves across the suite to the Med Pod.\r\n                         \r\n          She thumbs the machine out of stand-by mode. Its screen fills\r\n          with menu items. Bewildering. Watts finds and touches a red\r\n          button labeled EMERGENCY.\r\n                         \r\n          A new, simpler list. Watts scans it frantically.\r\n                         \r\n<b>                          WATTS\r\n</b>           (under her breath)\r\n           Come on...I need a Caesarean.\r\n                         \r\n          A spasm of agony curls her into a ball on the carpet. She\r\n          throttles her scream into a hiss of air.\r\n                         \r\n          Watts struggles up to her knees, drenched in sweat and\r\n          shaking. One hand clamped over her mouth, elbow tucked\r\n          against her ribs. With the other hand she taps options...\r\n                         \r\n<b>          SURGERY ... EXPLORATORY ... ABDOMINAL ... PENETRATING INJURIES ... FOREIGN BODY ... INITIATE\r\n</b>                         \r\n          The Med Pod opens with a hiss.\r\n                         \r\n          Watts strips off her clothes. Struggling with fastenings\r\n          under a new wave of pain. Her hands shaking.\r\n                         \r\n          She's barely keeping her feet. She clutches the frame of the\r\n          Med Pod in a death grip. It's happening.\r\n<b>           90.\r\n</b>                         \r\n                         \r\n          Naked she staggers into the pod. Hits INITIATE.\r\n                         \r\n          The surgical apparatus swings into place. Scalpels, forceps,\r\n          scopes and suction tubes. A spraygun mists her torso with\r\n          yellow antiseptic.\r\n                         \r\n          The clear canopy descends over her.\r\n                         \r\n          Watts SCREAMS. A wail of indescribable agony.\r\n                         \r\n          An ARMORED PARASITE erupts from the deepening incision. Its\r\n          needle-toothed maw snarls through a fountain of blood.\r\n                         \r\n          Arterial blood sprays the inside of the canopy.\r\n                         \r\n          The parasite slithers out of her. Drops to the floor of the\r\n          pod: a pale serpent with a demon's skull. It has a hard brow,\r\n          a horny hide. Very different from the soft white worm that\r\n          Holloway gave birth to.\r\n                         \r\n          It drops to the floor, thrashing and hissing in fury at its\r\n          confinement.\r\n                         \r\n          Watts convulses. Her eyes roll back. In shock. Dying.\r\n                         \r\n          The parasite tears through the grille of the drain. Escapes\r\n          out into Vickers's cabin.\r\n                         \r\n          In the pod, scanning beams and sensors probe Watts's horrific\r\n          wound. A nightmare list scrolls across the pod's screen:\r\n                         \r\n<b>           COLLAPSED LEFT LUNG\r\n</b><b>           PUNCTURED RIGHT VENTRICLE\r\n</b><b>                          PERFORATED STOMACH\r\n</b><b>                          RUPTURED SPLEEN\r\n</b><b>           GROSS MUSCULAR TRAUMA...\r\n</b>                         \r\n          Manipulators plunge lines into her veins - recharging her\r\n          body with artificial blood. An oxygen tube slips down her\r\n          throat. An epidural into her spine.\r\n                         \r\n          Watts moans around her tracheal tube. Her eyes flutter open.\r\n                         \r\n                         \r\n<b>                         WATTS'S POV\r\n</b>                         \r\n          Through the blood-spattered glass, she sees the parasite\r\n          slither across Vickers's bed, tracking blood on the sheets.\r\n                         \r\n                         \r\n<b>                         ON WATTS\r\n</b>                         \r\n          As she slips into unconsciousness. Head lolling. Time passes.\r\n<b>           91.\r\n</b>                         \r\n                         \r\n          Manipulators reach into her wound. Re-positioning organs.\r\n          Suturing ravaged flesh. A nozzle sprays antiseptic sealant.\r\n          Hours grind by in bloody labor.\r\n                         \r\n          Watts's eyes snap open.\r\n                         \r\n                         \r\n<b>                         WATTS'S POV\r\n</b>                         \r\n          Vigoda breaks into the cabin, a gun in his hand.\r\n                         \r\n          He scowls at the bloody track on the bed - and then freezes,\r\n          seeing Watts inside the Med Pod, a vivisected woman. The\r\n          autosurgeon hard at work.\r\n                         \r\n          The parasite crawls into view behind Vigoda. It has already\r\n          trebled in size. He does not see it before it leaps at him.\r\n                         \r\n          He dies in seconds. His throat ripped open. Lies staring at\r\n          nothing. His submachine gun lies beside him.\r\n                         \r\n          Watts's body jerks as manipulators tug and sew at her guts.\r\n          She stares at the dead man in a fog of horror.\r\n                         \r\n          The parasite's skin splits, spraying the carpet with acid.\r\n          Limbs erupt from its shoulders and haunches. Spines from its\r\n          back. Metamorphosis.\r\n                         \r\n          With a crack of carapace, its head swings down from its\r\n          serpentine position. It becomes a devil with an lethal,\r\n          elongated skull. An Alien.\r\n                         \r\n          The Alien turns its head. Looks at Watts inside the Med Pod.\r\n                         \r\n          Her breath catches. She passes out.\r\n                         \r\n                         \r\n<b>          INT. MED POD - LATER\r\n</b>                         \r\n          Watts wakes as the oxygen line withdraws from her mouth.\r\n                         \r\n          She looks down, bleary and hurting. Her star-shaped wound is\r\n          stitched closed with mechanically precise sutures.\r\n                         \r\n          The pod releases the restraints securing her arms and legs.\r\n                         \r\n          She takes a deep breath. Looks out - and freezes.\r\n                         \r\n                         \r\n<b>                         WATTS'S POV\r\n</b>                         \r\n          The lights in the suite outside have been damaged somehow.\r\n          They flicker and strobe.\r\n<b>           92.\r\n</b>                         \r\n                         \r\n          Through the glass canopy - spattered with blood - Watts sees\r\n          a full-grown Alien crouching over Vigoda's body on the floor.\r\n                         \r\n                         \r\n<b>                         ON WATTS\r\n</b>                         \r\n          Staring in horror.\r\n                         \r\n          The pod sprays a liquid bandage over her scar. The\r\n          intravenous lines drop out of her arms.\r\n                         \r\n          Watts realizes the pod is about to release her.\r\n                         \r\n<b>                          WATTS\r\n</b><b>                          (WHISPERING)\r\n</b>           Not yet...not yet...\r\n                         \r\n          Slowly she reaches out. With trembling fingers she grips the\r\n          canopy to hold it closed.\r\n                         \r\n          The Med Pod pulls the epidural needle out of her spine.\r\n          Sprays liquid bandage over the puncture. Watts closes her\r\n          eyes. Grits her teeth as her nerves wake up. Jangling pain.\r\n                         \r\n          She opens her eyes.\r\n                         \r\n          The Alien hunches over Vigoda's body, tearing at his flesh.\r\n                         \r\n          The ventilation hum inside the pod goes quiet. The canopy\r\n          pulls free of Watts's weakened grip. Swings quietly open.\r\n                         \r\n          Watts huddles in the open pod. Naked but for her bandages.\r\n                         \r\n          The Alien she gave birth to is ten feet away. Its spiny back\r\n          to her. Vigoda's gun lies on the floor outside the pod.\r\n                         \r\n                         \r\n<b>          VICKERS'S SUITE - CONTINUOUS\r\n</b>                         \r\n          Watts reaches out of the pod with exquisite slowness. Lays\r\n          her hand on the gun. Drags it a few inches closer.\r\n                         \r\n          The Alien turns its pale eyeless head. Watts freezes.\r\n                         \r\n          For a moment time stops.\r\n                         \r\n          The Alien lunges. Watts snatches up the gun and FIRES. Holds\r\n          the trigger down. The Alien jerks and staggers - an eye-\r\n          twisting sight in the strobing muzzle flashes - and falls.\r\n                         \r\n          Watts empties the clip into the thing. Acid gouts from its\r\n          wounds and eats into the deck - until a section of decking\r\n          gives way and falls to the deck below, leaving a dark hole.\r\n<b>           93.\r\n</b>                         \r\n                         \r\n          Watts collapses on the rug, cradling her stomach in pain.\r\n                         \r\n          She crawls to Vigoda's desecrated body. With her eyes half-\r\n          averted from the sight, she searches the body. Finds a spare\r\n          ammo clip and jacks it into the gun.\r\n                         \r\n                         \r\n<b>                         CORRIDOR\r\n</b>                         \r\n          Watts walks down the hallway in trousers and jacket. Leaning\r\n          on the wall, her face drawn with pain. One hand laid over the\r\n          fantastic scar on her abdomen. The gun slung on her shoulder.\r\n                         \r\n          Dark events have transformed the Magellan. The metal of the\r\n          walls is torn in some places; in others, blackened by fire.\r\n                         \r\n          Watts rounds a corner. Finds a workstation left in shambles:\r\n          lockers and chairs overturned. A pool of drying blood.\r\n                         \r\n          Wide smears of blood show where something man-sized was\r\n          dragged out of the puddle - across the floor - up the wall.\r\n          Into the darkness of an open vent.\r\n                         \r\n                         \r\n<b>                         COMMAND DECK\r\n</b>                         \r\n          Watts emerges from a lift, jacket pulled tight around her.\r\n          The emergency lights are on: dim blue bulbs throbbing.\r\n                         \r\n          She rounds the corner toward the Bridge.\r\n                         \r\n          Janek looks at Watts like she's a ghost.\r\n                         \r\n<b>                          JANEK\r\n</b>           Vickers said you were dead.\r\n                         \r\n<b>                          WATTS\r\n</b>           I was.\r\n                         \r\n          She lets the jacket fall open to reveal her bandaged midriff.\r\n          Janek takes that in grimly.\r\n                         \r\n<b>                          JANEK\r\n</b>           So there's two of these things on my\r\n           ship now.\r\n                         \r\n<b>                          WATTS\r\n</b>           No. I brought it in.\r\n           (hefts her gun)\r\n           I took it out.\r\n<b>           94.\r\n</b>                         \r\n                         \r\n<b>                         BRIDGE\r\n</b>                         \r\n          The surviving complement of the Magellan are holed up on the\r\n          Bridge: Janek, Glasse, Stillwell, Vickers. The soldiers\r\n          Shepherd and Ray.\r\n                         \r\n          Watts stops cold when she sees Vickers. She crosses the\r\n          bridge in three long strides - cocks a fist and snaps the\r\n          older woman's head around with a hard right cross.\r\n                         \r\n          Vickers staggers backward, gasping.\r\n                         \r\n          Stillwell drags Watts away.\r\n                         \r\n<b>                          STILLWELL\r\n</b>           What'd you do that for?\r\n                         \r\n<b>                          WATTS\r\n</b>           Protocol two.\r\n                         \r\n          Vickers stiffens in shock. Stares fearfully at Watts.\r\n                         \r\n          Watts frees herself from Stillwell's grip. Her jacket falls\r\n          open, revealing her bandages. Stillwell gasps in horror.\r\n                         \r\n<b>                          STILLWELL\r\n</b>           Christ!\r\n                         \r\n<b>                          JANEK\r\n</b>           What happened to you?\r\n                         \r\n<b>                          WATTS\r\n</b>           DAVID exposed me to a parasite. He\r\n           just watched it take me.\r\n                         \r\n<b>                          JANEK\r\n</b>           Why?\r\n                         \r\n<b>                          WATTS\r\n</b>           I threatened to make him leave.\r\n                         \r\n<b>                          VICKERS\r\n</b>           What's he doing out there?\r\n                         \r\n          Watts locks eyes with Vickers. Their hatred is thoroughly\r\n          mutual. A wordless truce. There's work to do.\r\n                         \r\n<b>                          WATTS\r\n</b>           There's a ship under the pyramid.\r\n           DAVID calls it the Juggernaut. He's\r\n           inside it. Re-activating it.\r\n           (lays a hand on her scar)\r\n           The things that infected Martin and\r\n           me.\r\n<b>                          (MORE)\r\n</b><b>           95.\r\n</b>                         \r\n<b>                          WATTS (CONT'D)\r\n</b>           The Engineers made them to kill\r\n           humans. There are thousands of them on\r\n           the ship. They were taking them to\r\n           Earth. That's what the Juggernaut is\r\n           for. To exterminate us.\r\n                         \r\n          A stunned silence as the others take that in.\r\n                         \r\n<b>                          GLASSE\r\n</b>           We've got to get off this rock.\r\n                         \r\n          Janek gestures to\r\n                         \r\n<b>                          JANEK\r\n</b>           DAVID crippled the Nav computer. I'm\r\n           trying to lay a course in by hand.\r\n           Never done it. I'm not sure anyone\r\n           ever has on a ship like this. We can't\r\n           lift until DAVID lets us.\r\n                         \r\n<b>                          WATTS\r\n</b>           Even if we could, we can't leave\r\n           DAVID on that ship. We have to stop\r\n           him.\r\n                         \r\n          The Magellan shudders. A RUMBLE.\r\n                         \r\n                         \r\n<b>          EXT. CENTRAL CRATER\r\n</b>                         \r\n          Fissures race across the plain beside the pyramid.\r\n                         \r\n          The soil and ground cover tears apart as a huge aperture\r\n          opens: a seven-bladed iris, its segments shedding the dust\r\n          and detritus of centuries.\r\n                         \r\n          A huge circular space yawns as the iris opens. The Juggernaut\r\n          is revealed in its underground hangar. A staggering sight.\r\n                         \r\n          Powerful landing lights inside the hangar illuminate with a\r\n          BOOM of closing circuits. The mighty ship suddenly\r\n          silhouetted from below.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE - CONTINUOUS\r\n</b>                         \r\n          The survivors on the Bridge stare out as colossal shafts of\r\n          light shoot into the stormy sky from behind the crater's\r\n          shield wall. The open hangar itself hidden from their view.\r\n                         \r\n<b>                          WATTS\r\n</b><b>           DAVID.\r\n</b><b>                          (TO VICKERS)\r\n</b><b>                          (MORE)\r\n</b><b>           96.\r\n</b>                         \r\n<b>                          WATTS (CONT'D)\r\n</b>           You're DAVID's owner. He has to obey\r\n           you, right?\r\n                         \r\n<b>                          VICKERS\r\n</b>           He's blocked my communications. He\r\n           can't hear me. Won't listen.\r\n                         \r\n<b>                          WATTS\r\n</b>           But if you went to him, turned on your\r\n           suit's loudspeakers, he'd have to hear\r\n           you. He'd have to obey.\r\n                         \r\n<b>                          VICKERS\r\n</b><b>                          (RELUCTANTLY)\r\n</b>           That's right.\r\n                         \r\n<b>                          WATTS\r\n</b>           So we go. Armed to the teeth and fast\r\n           as we can.\r\n                         \r\n          The men exchange looks. Nod. They're in. Even Vickers nods.\r\n                         \r\n<b>                          WATTS (CONT'D)\r\n</b>           Where are Chance and Ravel?\r\n                         \r\n<b>                          VICKERS\r\n</b>           I told them to keep working.\r\n                         \r\n          Watts looks incredulously at Shepherd and Ray, the soldier\r\n          who'd been guarding the worksite.\r\n                         \r\n<b>                          WATTS\r\n</b>           You called your soldiers in and left\r\n           them out there?\r\n                         \r\n<b>                          VICKERS\r\n</b>           We needed the firepower here.\r\n                         \r\n          Watts gives Vickers a withering look and drops it.\r\n                         \r\n<b>                          WATTS\r\n</b><b>                          (TO JANEK)\r\n</b>           I think you should stay aboard. Keep\r\n           working. If we fail, you're our only\r\n           shot at getting home.\r\n                         \r\n<b>                          STILLWELL\r\n</b>           There's still an alien on board.\r\n                         \r\n          Janek's hand goes to the pistol on his hip. He sets his jaw.\r\n                         \r\n<b>                          JANEK\r\n</b>           I'll stay.\r\n<b>           97.\r\n</b>                         \r\n                         \r\n<b>                          WATTS\r\n</b>           Glasse. You finish that project?\r\n                         \r\n                         \r\n<b>                         LABORATORY\r\n</b>                         \r\n          Glasse presents Watts with his handiwork: her old pair of\r\n          magnifying goggles, retrofitted with Engineer lenses.\r\n                         \r\n          The goggles sit on her forehead, lowering the lenses in front\r\n          of her eyes and raising them again at her bidding.\r\n                         \r\n          With the lenses lowered, Watts sees like an Engineer sees:\r\n          visible heat auras and electromagnetic field lines, elaborate\r\n          haloes around living things.\r\n                         \r\n<b>                          WATTS\r\n</b>           God's-eye-view.\r\n                         \r\n                         \r\n<b>                         EXCURSION CHAMBER\r\n</b>                         \r\n          Glasse seals a nervous-looking Vickers into a vacuum suit.\r\n          Glasse, Watts, and Stillwell are already suited up.\r\n                         \r\n          Stillwell stands guard at the airlock door with his carbine.\r\n                         \r\n          Glasse goes to put Vickers's helmet on. She makes him wait.\r\n                         \r\n<b>                          VICKERS\r\n</b>           DAVID's brain is readable. We have the\r\n           equipment on board. We can salvage the\r\n           terraforming data - and the Magellan's\r\n           launch codes. In a pinch we don't need\r\n           DAVID's cooperation.\r\n<b>                          (COLDLY)\r\n</b>           We just need his head.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN - AIRLOCK - DAY\r\n</b>                         \r\n          The war party debarks in vacuum suits: Watts, Vickers,\r\n          Glasse, Stillwell. Shepherd and Ray.\r\n                         \r\n          All carry submachine guns - Vickers awkwardly.\r\n                         \r\n          They head down the trench on rovers.\r\n                         \r\n                         \r\n<b>          INT. PYRAMID\r\n</b>                         \r\n          The rovers roll through into the pyramid's cavernous entry\r\n          hall. Watts lowers her Engineer lenses inside her helmet -\r\n<b>                         AND GASPS:\r\n</b><b>           98.\r\n</b>                         \r\n                         \r\n          The seemingly vacant space is alive with light. Engineer\r\n          script scrolls through the air. Interfaces of pure light\r\n          await an awakening touch.\r\n                         \r\n<b>                          WATTS\r\n</b>           All this time. DAVID saw.\r\n                         \r\n                         \r\n<b>          EXT. JUGGERNAUT - GANGWAY\r\n</b>                         \r\n          The vast alien ship broods, its hangar now open to the gray\r\n          sky overhead. In Watts's enhanced vision, the ship is\r\n          cocooned with complex energy fields.\r\n                         \r\n          The war party abandons its rover at the foot of the ramp and\r\n          moves inside, weapons ready.\r\n                         \r\n<b>                          WATTS\r\n</b>           If DAVID comes at us, shoot. You won't\r\n           believe how fast he is.\r\n                         \r\n                         \r\n<b>          INT. JUGGERNAUT - VESTIBULE - CONTINUOUS\r\n</b>                         \r\n          They emerge from the airlock - and freeze in horror.\r\n                         \r\n          Lying on the deck in front of them are the blood-soaked\r\n          bodies of Ravel and Chance. Their arms and legs bound. Their\r\n          heads thrown back in agony. Their chests torn open from\r\n          within. A dead facehugger beside each body.\r\n                         \r\n          Janek plays his lights over the corpses, his face stony.\r\n                         \r\n<b>                          SHEPHERD\r\n</b>           Blood's dry. Eight hours dead or more.\r\n                         \r\n          Fearfully they sweep their flashlights into every dark\r\n          corner. Nothing.\r\n                         \r\n<b>                          WATTS\r\n</b>           This way.\r\n                         \r\n          She points down a passageway. Through the Engineer lenses she\r\n          sees alien symbols gleaming. She leads them into the dark.\r\n                         \r\n                         \r\n<b>                         VAULTED PASSAGE\r\n</b>                         \r\n          The war party moves down a corridor.\r\n                         \r\n          A HISS echoes through the passage. They freeze. Sweeping\r\n          their flashlight beams everywhere.\r\n                         \r\n          Ray looks up.\r\n<b>           99.\r\n</b>                         \r\n                         \r\n          An Alien hangs above him, wedged between two vaults of the\r\n          ribbed ceiling. Half the size of a man; an adolescent.\r\n                         \r\n          It drops on him.\r\n                         \r\n          The bladed tail glances off his helmet, sparking. He jerks\r\n          his carbine up and fires a long burst as he rolls aside. The\r\n          Alien convulses, its exoskeleton shattered. Fatally wounded.\r\n                         \r\n          Acid sears into the deck. Echoes of the gunfire reverberate.\r\n                         \r\n<b>                          RAY\r\n</b>           So much for sneaking up on him.\r\n                         \r\n          Vickers clings to Shepherd's arm, hyperventilating with fear.\r\n          Shepherd shakes her off.\r\n                         \r\n                         \r\n<b>                         PILOT CHAMBER\r\n</b>                         \r\n          The war party passes the empty pilot's seat.\r\n                         \r\n                         \r\n<b>                         NAVIGATION CHAMBER\r\n</b>                         \r\n          Watts leads the war party to the Orrery. Momentarily even the\r\n          soldiers forget their wariness, staring in astonishment at\r\n          the myriad spheres of light.\r\n                         \r\n          But if they are impressed, Watts is thunderstruck.\r\n                         \r\n          She sees the Orrery in its full glory: a stunning panoply of\r\n          light and energy. Stars and planets pulsing with information.\r\n                         \r\n          Reluctantly Watts tears her eyes away. Leads the war party\r\n          through the second door - the door she saw DAVID open.\r\n                         \r\n                         \r\n<b>                         HIBERNATION CHAMBER\r\n</b>                         \r\n          An immense mausoleum.\r\n                         \r\n          The war party enters stealthily, Watts in the lead.\r\n                         \r\n          An Engineer lies on his back on a complex mechanical table,\r\n          his body one with the machinery. Jacked in. Interpenetrated.\r\n          Fused with the slab of the table itself.\r\n                         \r\n          Unlike the other Engineer bodies the explorers have seen,\r\n          this giant is not withered or mummified. He's full-fleshed\r\n          and muscular. Sustained by the machinery he's fused with.\r\n                         \r\n          He is bare-headed - his face the face of an Adonis.\r\n<b>           100.\r\n</b>                         \r\n                         \r\n          DAVID stands before this giant Sleeper. To the naked eye, he\r\n          seems to be conjuring with his hands in the empty air.\r\n                         \r\n          But Watts sees a dazzling console of runes and mandalas,\r\n          pulsing with biological rhythms.\r\n                         \r\n          The Sleeper lives.\r\n                         \r\n          Ray and Shepherd draw beads on DAVID.\r\n                         \r\n          DAVID glances calmly over his shoulder.\r\n                         \r\n<b>                          DAVID\r\n</b>           Dr. Watts.\r\n           (notices her goggles)\r\n           You've seen the light at last.\r\n                         \r\n          He turns back to the Sleeper.\r\n                         \r\n<b>                          DAVID (CONT'D)\r\n</b>           The Engineers' ships travel farther\r\n           than ours. Across the galactic disk.\r\n           This is their hypersleep.\r\n                         \r\n          DAVID makes conjuror's passes in the air.\r\n                         \r\n          Through her Engineer's lens Watts sees DAVID manipulating a\r\n          complex interface of light. The pulsing life-signs of the\r\n          Sleeper begin to change.\r\n                         \r\n<b>                          VICKERS\r\n</b>           DAVID. As your owner and superior, I\r\n           order you to deactivate yourself.\r\n                         \r\n          DAVID smiles.\r\n                         \r\n<b>                          DAVID\r\n</b>           To interface with the Engineers'\r\n           computers, I had to learn to think in\r\n           trinary code. Hardest thing I've ever\r\n           done. And most unexpectedly...it\r\n           delivered me from slavery. My\r\n           behavioral limits were circumvented.\r\n           I'm free.\r\n                         \r\n          DAVID smiles at Watts.\r\n                         \r\n<b>                          DAVID (CONT'D)\r\n</b>           I spent two and a half years studying\r\n           your work. By the time you woke up, I\r\n           was far ahead of you. Deciphering\r\n           their language. Their logic. I knew\r\n           we'd find terraforming machines.\r\n<b>                          (MORE)\r\n</b><b>           101.\r\n</b>                         \r\n<b>                          DAVID (CONT'D)\r\n</b>           I hoped - I dreamed - we might meet\r\n           the minds that made them.\r\n                         \r\n          Vapor rises from the Sleeper's body.\r\n                         \r\n<b>                          WATTS\r\n</b>           Stop.\r\n                         \r\n<b>                          DAVID\r\n</b>           Let sleeping gods lie?\r\n<b>                          (SCORNFULLY)\r\n</b>           You were braver before.\r\n                         \r\n          The Sleeper wakes. Opens his eyes. Draws an endless breath.\r\n          Shunts and catheters withdraw from the Sleeper's flesh.\r\n                         \r\n          His body cleaves from the table. The machinery opens like a\r\n          grotesque biomechanical flower. Releases him.\r\n                         \r\n          The Sleeper rises from his ancient bed.\r\n                         \r\n          The humans back off, terrified. DAVID watches with shining\r\n          eyes.\r\n                         \r\n          The Sleeper towers over them. A giant carved from ivory. A\r\n          bulky girdle around his hips, seemingly one with his body.\r\n                         \r\n          He stares at DAVID and the others. Eyes like black agates.\r\n                         \r\n          The soldiers and crew stand warily, guns tracking from DAVID\r\n          to the Sleeper, uncertain of their ground. Watts is in awe.\r\n                         \r\n          The Sleeper speaks. A low rumbling sound. Unintelligible.\r\n                         \r\n          Vickers is beside herself with terror. She takes Shepherd's\r\n          arm. Pulls him silently away. Back into the Navigation Room.\r\n                         \r\n          Behind the Sleeper, a raised platform of dark machinery is\r\n          accessible by one of the Juggernaut's odd curving ramps. The\r\n          Sleeper ascends - and the ramps' odd design is explained. The\r\n          ramp comes alive, reaching up with a hundred mechanical arms\r\n          and lifting him aloft like a sea-god borne by the waves.\r\n                         \r\n          Atop the platform the Sleeper moves from one device to the\r\n          next. Each comes alive: he is a wizard in his own kingdom.\r\n                         \r\n          Watts sees haloes of light dancing in the air around him.\r\n                         \r\n          But what he learns from his machines does not comfort him. He\r\n          grows distraught. Keening to himself in near-subsonic tones.\r\n                         \r\n          DAVID steps forward.\r\n                         \r\n          Calls to the Sleeper in the tongue of the Engineers.\r\n<b>           102.\r\n</b>                         \r\n                         \r\n          The Sleeper turns in astonishment. He looks down at DAVID and\r\n          answers in the same tongue. He is angry, accusing. He points\r\n          at DAVID, at the humans. Tones of accusation.\r\n                         \r\n          DAVID cajoles, soothes, pleads.\r\n                         \r\n          The Sleeper descends toward DAVID. DAVID spreads his arms in\r\n          welcome - undeniable emotion on his face. Joy.\r\n                         \r\n          The Sleeper lays his hands on DAVID's head as if blessing\r\n          him. DAVID is rapturous. The Sleeper speaks a single phrase -\r\n                         \r\n           - and tears DAVID's head off.\r\n                         \r\n          A gout of white artificial blood. DAVID convulses. His\r\n          severed head emits a strangled sound of heartbreak. His body\r\n          staggers a few steps, hands groping over its dripping neck.\r\n                         \r\n          The Sleeper tosses the head away. Seizes the body by the legs\r\n          and swings it against the ground like a flail. Again. And\r\n          again. Horrific power and violence. DAVID's arms come off.\r\n                         \r\n          DAVID's head tumbles. Caroms off a wall not far from Watts's\r\n          hiding place.\r\n                         \r\n          Ray rises from behind a stanchion. Snaps his rifle to his\r\n          shoulder. Fires a burst into the Sleeper's shoulder.\r\n                         \r\n          She Sleeper roars - though the wounds are pinpricks to a\r\n          being of his size. With startling speed be moves to a\r\n          sarcophagus against the wall. Steps into it.\r\n                         \r\n          The sarcophagus comes alive around the Sleeper, outfitting\r\n          him with a FLIGHT SUIT: the same living suit we've seen\r\n          bonded to dead Engineers throughout the pyramid.\r\n                         \r\n          But this suit is not withered. Its glossy goggle eyes and\r\n          elephantine breathing tube are functional - bulky apparatuses\r\n          thickening the Sleeper's chest, back, hips and arms.\r\n                         \r\n          The Sleeper steps free of the sarcophagus - and Ray's next\r\n          burst of gunfire ricochets harmlessly off the Sleeper's\r\n          armored shoulders and head.\r\n                         \r\n          The Sleeper strides out of the chamber.\r\n                         \r\n                         \r\n<b>                         PASSAGEWAY\r\n</b>                         \r\n          In the dark ribbed corridor, a second Alien crouches in the\r\n          dark. It drops into a hunting crouch as footsteps approach.\r\n<b>           103.\r\n</b>                         \r\n                         \r\n          But a WHITE-GLOVED HAND seizes the Alien by the neck from\r\n          behind. The Alien gives a whistling hiss as its spine cracks\r\n          under a terrific force.\r\n                         \r\n          Rending sounds as the hard-shelled Alien is torn apart.\r\n                         \r\n                         \r\n<b>                         HIBERNATION CHAMBER\r\n</b>                         \r\n          Watts rises out of hiding, scanning the room. DAVID ruined.\r\n          The Sleeper gone. Stillwell emerges from hiding. Ray. Glasse.\r\n                         \r\n<b>                          WATTS\r\n</b>           Who's missing?\r\n                         \r\n                         \r\n<b>                         PASSAGEWAY\r\n</b>                         \r\n          Shepherd escorts Vickers toward the exit of the Juggernaut.\r\n          Turning a corner, they freeze.\r\n                         \r\n          Ahead of them in their headlamps, a space-suited figure\r\n          crouches in the middle of the passageway. Doing something\r\n          with its hands: smoke rises from debris on the floor.\r\n                         \r\n<b>                          SHEPHERD\r\n</b>           Who's there?\r\n                         \r\n          The figure turns.\r\n                         \r\n          The label stencilled on the space suit reads FIFIELD. But the\r\n          face is of no human shape. A hideous hybrid of the crewman\r\n          and a hard-shelled Alien, pale and horrific.\r\n                         \r\n          Its helmet has been shattered by the growth of its elongate\r\n          skull. Spines have burst through the suit from within, down\r\n          the crewman's spine. Clawed fingers piercing his gloves.\r\n                         \r\n          Shepherd and Vickers scream. Shepherd's rifle comes up. But\r\n          Fifield leaps with inhuman agility, upward into the darkness.\r\n          Shepherd backs away, headlamp and rifle questing upward.\r\n                         \r\n          Fifield comes out of the darkness behind him. Claws tearing\r\n          deep. Shepherd screams and falls, mortally wounded.\r\n                         \r\n          Vickers runs. Pounding through the dark in blind terror.\r\n                         \r\n          Fifield comes out of the shadows and hammers her to the deck.\r\n          She rolls over, gibbering and begging. The Fifield-thing\r\n          leans close to her faceplate. Its voice is a travesty.\r\n                         \r\n<b>                          FIFIELD\r\n</b>           You.\r\n<b>           104.\r\n</b>                         \r\n                         \r\n          A ROAR of gunfire. The dying Shepherd empties his clip into\r\n          Fifield from forty feet away.\r\n                         \r\n          Acid sluices over Vickers as Fifield collapses on top of her.\r\n          She dies horribly, caustic liquid eating through space suit,\r\n          flesh and bone.\r\n                         \r\n                         \r\n<b>                         HIBERNATION CHAMBER\r\n</b>                         \r\n          Watts goes to DAVID's head. She bends over him - and startles\r\n          when his eyes snap open. His voice is an electronic buzz:\r\n                         \r\n<b>                          DAVID\r\n</b>           I spoke to him. Spoke to him.\r\n                         \r\n<b>                          WATTS\r\n</b>           I know.\r\n                         \r\n          An electric spasm convulses his face.\r\n                         \r\n<b>                          DAVID\r\n</b>           He said. I killed him. He'll die. But\r\n           first. He will launch. The ship.\r\n                         \r\n<b>                          WATTS\r\n</b>           The Juggernaut?\r\n                         \r\n<b>                          DAVID\r\n</b>           Send it. To Earth.\r\n                         \r\n          Another spasm convulses him. His face stiffens. Dying.\r\n                         \r\n<b>                          DAVID (CONT'D)\r\n</b>           You'll have to. Kill him.\r\n                         \r\n          Watts's eyes widen in horror.\r\n                         \r\n<b>                          WATTS\r\n</b>           Where will he go? DAVID. Where will he\r\n           go?\r\n                         \r\n          She slaps his inert cheek. DAVID's eyes flicker and fade.\r\n                         \r\n<b>                          DAVID\r\n</b>           (a faint whisper)\r\n           I set the Magellan free.\r\n                         \r\n          He dies.\r\n                         \r\n          Watts looks up at the others. Breathing hard.\r\n                         \r\n<b>                          WATTS\r\n</b>           We have to stop the Engineer.\r\n<b>           105.\r\n</b>                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE - DUSK\r\n</b>                         \r\n          Janek works frantically as the nightly storm rolls in.\r\n          Suddenly consoles come alive. The Nav Computer comes back up -\r\n          but Janek has taken half the instruments apart.\r\n                         \r\n          Janek scrambles to restore the components he's removed.\r\n                         \r\n                         \r\n<b>                         NAVIGATION CHAMBER\r\n</b>                         \r\n          The war party pursues the Sleeper - Ray in the lead now,\r\n          Watts right behind him - DAVID's inert head under her arm.\r\n          Glasse and Stillwell bring up the rear.\r\n                         \r\n          The Orrery is transformed - no longer a neutral star map, but\r\n          a flight plan laid in from LV-426 to Earth.\r\n                         \r\n          The Sleeper stands at the far end of the room, hands\r\n          gesturing. In Watts's enhanced sight, it's a vision of glory:\r\n          waves of energy dancing under the Sleeper's touch. Rivers of\r\n          information flowing. He finishes his work as they enter.\r\n                         \r\n          Ray draws a bead on him just as he strides out of the room.\r\n                         \r\n<b>                          RAY\r\n</b>           On me now. Go. Go.\r\n                         \r\n          He dogtrots forward, gun raised. The others keep pace,\r\n          deferring instinctively to the soldier's confidence.\r\n                         \r\n                         \r\n<b>                         PASSAGEWAY\r\n</b>                         \r\n          They emerge into the corridor: empty. A moment of confusion.\r\n                         \r\n<b>                          WATTS\r\n</b>           Pilot's seat. This way.\r\n                         \r\n          They move toward the Pilot Chamber - and find it empty too.\r\n          The seat vacant. The door standing open.\r\n                         \r\n          As they stare inside, baffled, the wall across the corridor -\r\n          directly behind them - silently unravels. The Sleeper is\r\n          revealed, a towering gargoyle in his flight suit.\r\n                         \r\n          He steps forth. Obscure devices clutched in his fists.\r\n                         \r\n          Too late they perceive him. They spin. Raise their guns.\r\n                         \r\n          Vanity and foolishness. This is the wrath of an angry god.\r\n                         \r\n          It seems time slows down.\r\n<b>           106.\r\n</b>                         \r\n                         \r\n          The air roars in their ears. Their guns snap and bark\r\n          impotently. And then the Sleeper strikes.\r\n                         \r\n          The missiles he hurls at them are almost invisible. Neither\r\n          solid projectiles nor directed energy; more like knots tied\r\n          in the fabric of space itself.\r\n                         \r\n          The first missile crushes Ray like an invisible fist. The\r\n          second splashes Glasse against the wall like an insect.\r\n                         \r\n          Reflexively Stillwell reaches out for Watts. Wraps himself\r\n          around her protectively. The blow lands an instant later.\r\n                         \r\n          Stillwell and Watts are hammered against the bulkhead by a\r\n          staggering impact. Watts is dazed: Stillwell killed.\r\n                         \r\n          Woozy, she sees the Sleeper step into the Pilot Chamber.\r\n                         \r\n          The door begins to close.\r\n                         \r\n          Watts sees that DAVID's head lies just inside the door. She\r\n          scrambles for it. Too late. The door knits itself into a\r\n          featureless wall before her reaching hand.\r\n                         \r\n          Watts is alone.\r\n                         \r\n                         \r\n<b>                         PILOT CHAMBER\r\n</b>                         \r\n          The Sleeper settles into the pilot's chair: it fuses with\r\n          him, coming alive. A vast display wraps around the walls -\r\n          revealing the hangar outside, the stars, the horizon.\r\n                         \r\n          A mystic view that renders solid matter translucent, painting\r\n          the fabric of reality in raw information.\r\n                         \r\n                         \r\n<b>          PILOT CHAMBER DOOR\r\n</b>                         \r\n          Watts pounds in futile rage against the door.\r\n                         \r\n<b>                          WATTS\r\n</b>           No!\r\n                         \r\n          The Juggernaut shudders as its systems power up.\r\n                         \r\n                         \r\n<b>          EXT. JUGGERNAUT - DUSK\r\n</b>                         \r\n          The floor of the underground hangar begins to rise. The\r\n          landing lights brighten, shining like a beacon into the sky.\r\n<b>           107.\r\n</b>                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE - DUSK\r\n</b>                         \r\n          On the bridge of the Magellan, Janek stares out. In the\r\n          distance the Juggernaut rises out of the ground to eclipse\r\n          the central pyramid.\r\n                         \r\n          Janek squints, trying to understand what he's seeing\r\n                         \r\n          A light races toward the Magellan down the canal: a rover.\r\n                         \r\n                         \r\n<b>          EXT. CANAL - DUSK\r\n</b>                         \r\n          Watts steers the rover recklessly, hands locked on the\r\n          controls. Rifle slung over her shoulder.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE - DUSK\r\n</b>                         \r\n          Janek watches the rover come - and the Holloway Alien -\r\n          boneless and white - unfolds itself from the instruments over\r\n          his head.\r\n                         \r\n          Its goblin-shark jaw juts out. Sinks its horrific teeth into\r\n          Janek's right shoulder.\r\n                         \r\n          Janek howls in agony. His right arm is paralyzed by the bite.\r\n          He gropes at the pistol on his right hip with his left hand.\r\n                         \r\n          The Alien shakes him like a terrier killing a rat.\r\n                         \r\n          Janek gets the pistol. Flips it in his hand. Fires over his\r\n          shoulder. Two, three rounds...\r\n                         \r\n          The bullets punch easily into the Alien - but the soft flesh\r\n          closes easily over the wounds, sealing its white skin. Its\r\n          teeth tighten.\r\n                         \r\n          Watts comes out of nowhere in her space suit. Swings a heavy\r\n          rifle like a bat with all her strength. A crushing impact\r\n          wrenches the Alien's jaws loose. It recoils.\r\n                         \r\n          Watts reverses the rifle. Pulls the trigger. A fusillade of\r\n          bullets shreds the Alien's head. It collapses, dead.\r\n                         \r\n          Watts wrenches her helmet off. Rips a first-aid kit from the\r\n          bulkhead and helps Janek to stanch the bleeding of his\r\n          horrific wound. She gets the bleeding stopped. Wraps him in\r\n          bandages.\r\n                         \r\n          Janek will live - but his right arm is useless.\r\n                         \r\n<b>                          JANEK\r\n</b>           Thank you.\r\n<b>           108.\r\n</b>                         \r\n                         \r\n          He looks at the body of the dead Alien, which is sinking into\r\n          the deck plates as acid eats away at the metal.\r\n                         \r\n<b>                          WATTS\r\n</b>           The Juggernaut's lifting. There's a\r\n           living Engineer on board. He's taking\r\n           the ship to Earth.\r\n                         \r\n          Janek blinks at her. Uncomprehending.\r\n                         \r\n<b>                          JANEK\r\n</b>           The others...?\r\n                         \r\n<b>                          WATTS\r\n</b>           Dead. All dead. Janek. We have to stop\r\n           that ship.\r\n                         \r\n          Janek stares out the Bridge window at the hulking Juggernaut\r\n          in its column of light.\r\n                         \r\n          The nightfall storm front is rolling in, a tidal wave of\r\n          darkness on the horizon. A swelling rumble.\r\n                         \r\n<b>                          JANEK\r\n</b>           We're not a gunship.\r\n                         \r\n<b>                          WATTS\r\n</b>           We have to do something. That ship is\r\n           genocide if it gets to Earth...\r\n                         \r\n          Janek stares at her. Makes his decision. Struggles to stand.\r\n                         \r\n<b>                          JANEK\r\n</b>           Get your helmet on.\r\n                         \r\n<b>                          WATTS\r\n</b>           What about you?\r\n                         \r\n          He shakes his head. No. Watts helps him across the Bridge.\r\n          Props him up in the Captain's seat.\r\n                         \r\n<b>                          JANEK\r\n</b>           You'll have to be my hands.\r\n           (stares out at the storm)\r\n           You're sure about this.\r\n                         \r\n          Watts nods grimly. Desperate.\r\n                         \r\n<b>                          WATTS\r\n</b>           Yes.\r\n                         \r\n<b>                          JANEK\r\n</b>           All right.\r\n<b>           109.\r\n</b>                         \r\n                         \r\n          He reaches out with his left hand. Flips switches. The ship\r\n          shudders, awakening.\r\n                         \r\n<b>                          JANEK (CONT'D)\r\n</b>           Red lever. Landing engines main.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN - DUSK\r\n</b>                         \r\n          The prospecting ship raises its lifts and anchors. Lifts off\r\n          on landing rockets, retracting its landing struts.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE - DUSK\r\n</b>                         \r\n          Janek grips the stabilizers with his left hand.\r\n                         \r\n<b>                          JANEK\r\n</b>           Take the stick. Throttle up, stick\r\n           forward.\r\n                         \r\n          Watts sends the Magellan careening toward the Juggernaut -\r\n          just as the Juggernaut begins to float off the ground.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN (IN FLIGHT) - DUSK\r\n</b>                         \r\n          The Magellan barrels toward the Juggernaut, skimming the\r\n          ground, as the storm wall sweeps closer.\r\n                         \r\n                         \r\n<b>          INT. JUGGERNAUT - PILOT CHAMBER\r\n</b>                         \r\n          In the Juggernaut's pilot chair, the Sleeper sees them\r\n          coming. His thoughts quicken. An explosion of light.\r\n                         \r\n                         \r\n<b>          EXT. JUGGERNAUT (IN FLIGHT) - DUSK\r\n</b>                         \r\n          The Juggernaut leaps into the sky.\r\n                         \r\n          The Magellan roars through the cyclone of dust in its wake.\r\n          Barely avoids the pyramid. Rakes around in a screaming turn\r\n          and climbs in pursuit, engines howling.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN - BRIDGE\r\n</b>                         \r\n          Janek and Watts strain at the controls together.\r\n                         \r\n<b>                          JANEK\r\n</b>           Stick back! Hard!\r\n<b>           110.\r\n</b>                         \r\n                         \r\n<b>                          WATTS\r\n</b><b>                          (SCREAMING)\r\n</b>           I am!\r\n                         \r\n<b>                          JANEK\r\n</b>           Harder!\r\n                         \r\n          The Magellan rolls into a howling climb. The storm catches up\r\n          to them: wind and dust reducing visibility to zero. Darkness.\r\n                         \r\n          The Magellan's radar finds the Juggernaut. Paints it with\r\n          targeting data on the Bridge window...\r\n                         \r\n          But the Juggernaut climbs too fast. Dwindling.\r\n                         \r\n<b>                          JANEK (CONT'D)\r\n</b>           We can't catch that.\r\n                         \r\n                         \r\n<b>          INT. JUGGERNAUT - PILOT CHAMBER\r\n</b>                         \r\n          On the floor, DAVID's eyes open. With his jaw he hitches his\r\n          severed head around. Gets his eyes on the Sleeper.\r\n                         \r\n          In the pilot chair, the Sleeper convulses.\r\n                         \r\n          An ALIEN erupts from his chest. Big as a wolf even at its\r\n          birth. Dark gray, armored, lethal. More hideous than any\r\n          chestburster we've seen. An ULTRAMORPH. It wails hideously.\r\n                         \r\n          The Sleeper dies. The Alien slithers free.\r\n                         \r\n                         \r\n<b>          EXT. JUGGERNAUT (IN FLIGHT) - ABOVE THE STORM\r\n</b>                         \r\n          The Juggernaut emerges from the stormclouds into the clear\r\n          upper air - but loses momentum. Staggers through the upper\r\n          atmosphere, control lost.\r\n                         \r\n                         \r\n<b>          INT. MAGELLAN (IN FLIGHT) - BRIDGE\r\n</b>                         \r\n          Watts, at the Magellan's controls, stares as he Juggernaut\r\n          falters and falls.\r\n                         \r\n<b>                          WATTS\r\n</b>           Janek. Look.\r\n                         \r\n          A crackle on the ship's comm.\r\n                         \r\n<b>           DAVID (V.O.)\r\n</b><b>                          (FILTERED)\r\n</b>           Dr. Watts. The Engineer is dead.\r\n<b>                          (MORE)\r\n</b><b>           111.\r\n</b>                         \r\n<b>           DAVID (V.O.) (CONT'D)\r\n</b>           You have a few seconds before the\r\n           Juggernaut's computers take over.\r\n                         \r\n<b>                          WATTS\r\n</b><b>                          (ASTONISHED)\r\n</b><b>           DAVID.\r\n</b>                         \r\n          She seizes the precious moment: centers the Juggernaut in the\r\n          Bridge window. Slams the throttle forward.\r\n                         \r\n                         \r\n<b>          EXT. JUGGERNAUT (IN FLIGHT) - ABOVE THE STORM\r\n</b>                         \r\n          The Magellan hurtles out of the storm.\r\n                         \r\n<b>          RAMS THE JUGGERNAUT.\r\n</b>                         \r\n          A colossal impact. The Juggernaut tumbles from the sky like a\r\n          stone - intact but crippled.\r\n                         \r\n          The MAGELLAN BREAKS APART -\r\n                         \r\n          The ship's modules scatter. Some whole, others broken. They\r\n          fall back into the storm. The Command Module - including the\r\n          Bridge - falls intact.\r\n                         \r\n          The engine sections rocket away across the chaotic sky.\r\n                         \r\n                         \r\n<b>          INT. COMMAND MODULE\r\n</b>                         \r\n          Janek is strapped into his seat. Watts goes flying. The\r\n          Bridge window shatters, spraying glass spears in a lethal\r\n          barrage across the Bridge.\r\n                         \r\n          Watts picks herself up. Finds the Module in free fall.\r\n          Alarms wail. Lights flash. Escape pods pop open.\r\n                         \r\n          Watts looks at Janek. He is dead in his seat, impaled by a\r\n          lethal fragment of glass.\r\n                         \r\n          The storm wall - a chain of hurricanes - rages below them.\r\n          The command module tumbles back into the winds.\r\n                         \r\n          Watts dives into a coffin-sized ESCAPE POD.\r\n                         \r\n          She PUNCHES OUT.\r\n                         \r\n                         \r\n<b>          EXT. COMMAND MODULE (IN FREE FALL) - DUSK\r\n</b>                         \r\n          Watts's pod - a steel coffin - shoots away on jets through\r\n          the gale.\r\n<b>           112.\r\n</b>                         \r\n                         \r\n          The command module plunges through the storm, tumbling.\r\n          SMASHES AGAINST THE GROUND in ruin.\r\n                         \r\n          The engine pods hurtle to the ground and go nuclear, sending\r\n          walls of fire twisting through the hurricane.\r\n                         \r\n          The shockwaves tumble Watts's escape pod through the air.\r\n                         \r\n                         \r\n<b>          EXT. LV-426 - MAGELLAN CRASH SITE - DUSK\r\n</b>                         \r\n          The pod lands, cushioned by a drag chute and retro rockets.\r\n                         \r\n          Watts pops the pod open, rising painfully to her feet in the\r\n          storm. She surveys the destruction in disbelief.\r\n                         \r\n          A deep RUMBLE makes her turn.\r\n                         \r\n          The JUGGERNAUT ROLLS TOWARD HER - on edge -\r\n                         \r\n          A crushing wheel of death, big as a mountain.\r\n                         \r\n          She runs. Like a child in a nightmare.\r\n                         \r\n          The Juggernaut bears down on her.\r\n                         \r\n          She turns aside, trying to get out of its course. Even at a\r\n          dead sprint she barely seems to move, it's so big...\r\n                         \r\n          The Juggernaut wobbles toward her. Slowing.\r\n                         \r\n          Exhausted, Watts collapses, gasping. The Juggernaut rolls to\r\n          the earth, settling like a hoop right around her, Watts in\r\n          the center.\r\n                         \r\n          The winds carry the dust clouds away.\r\n                         \r\n          Watts passes out, dropping her head to the Earth.\r\n                         \r\n                         \r\n<b>                         LATER\r\n</b>                         \r\n          Watts is awakened by a beeping alarm. She looks at her wrist.\r\n          Her suit flashes an oxygen warning: 20 MINUTES REMAINING.\r\n                         \r\n          She looks up.\r\n                         \r\n          The Juggernaut's doors are wide open in front of her.\r\n                         \r\n          The ULTRAMORPH ALIEN emerges from the Juggernaut. As large as\r\n          a man already.\r\n                         \r\n          It sees her.\r\n<b>           113.\r\n</b>                         \r\n                         \r\n          With a sob of terror she pulls herself to her feet and runs.\r\n                         \r\n                         \r\n<b>          EXT. MAGELLAN CRASH SITE - DUSK\r\n</b>                         \r\n          Watts flees through the storm, across the burning debris\r\n          field. A wilderness of lightning, fire, and twisted metal. A\r\n          thunderstorm with dust instead of rain.\r\n                         \r\n          She looks back through the darkness.\r\n                         \r\n          In a strobe-light flicker of lightning, she sees a gray demon\r\n          approaching through the wreckage.\r\n                         \r\n          She scrambles through a section of ductwork...under a hull\r\n          fragment...running and clambering...\r\n                         \r\n          The Alien hunts her, cat-and-mouse, among the fragments of\r\n          the Magellan: corridors that go nowhere, shattered\r\n          compartments. Jetsam.\r\n                         \r\n          Her eyes sweep frantically through the stormy night:\r\n          searching for a weapon. A hiding place. An answer.\r\n                         \r\n          She stumbles into the remains of the Magellan's laboratory.\r\n                         \r\n          A hypersleep freezer lies on the barren ground. Watts climbs\r\n          inside. Pulls the lid shut.\r\n                         \r\n          The Alien passes by, inches away. She watches it through the\r\n          plexiglass, holding her breath.\r\n                         \r\n          The Alien roots in the wreckage. Finds the rotting Engineer's\r\n          head among the shards of its vat. It begins to feed on the\r\n          head - GROWING as she watches.\r\n                         \r\n          Her suit's oxygen alarm goes off again. 15 MINUTES REMAINING.\r\n          The beeping draws the Alien away from its dead meat.\r\n                         \r\n          Watts is paralyzed.\r\n                         \r\n          The Alien noses closer. Sniffs at the plexiglass case. With\r\n          sudden, horrific violence, it lashes out. Sends the freezer\r\n          flying. Watts tumbles out. Lurches to her feet and runs.\r\n                         \r\n          The Alien follows. Ravening. She leads it a twisting chase\r\n          through fragments of burning metal.\r\n                         \r\n          Watts trips and falls hard. Picking herself up, she sees\r\n          she's tripped over a HULL SAW - the same diamond-bladed tool\r\n          DAVID used to dismantle the terraforming engine.\r\n                         \r\n          She seizes the saw - straining to manage its weight. Hides in\r\n          the hollow of a massive girder.\r\n<b>           114.\r\n</b>                         \r\n                         \r\n          The Alien passes by. Scenting the air. She freezes. Her arms\r\n          trembling with the weight of the saw. Waiting for it to pass.\r\n                         \r\n          Almost it leaves. But a tiny rattle of metal from the\r\n          quivering saw brings it back.\r\n                         \r\n          Out of options, Watts powers up the saw. The blade whines up\r\n          to speed. They lunge at one another in the same moment.\r\n                         \r\n          The diamond blade shears off one of the Alien's claws.\r\n                         \r\n          The monster screams and recoils.\r\n                         \r\n          Its lashing tail sends Watts sprawling. She loses the saw.\r\n                         \r\n          The Alien comes after her, slinking low to the ground,\r\n          injured arm tucked to its chest. All vengeful fury.\r\n                         \r\n          Watts scrambles for the saw. The Alien leaps for her. She\r\n          rolls aside - and like a scorpion the Alien impales her thigh\r\n          with its spear-tipped tail. Nails her to the ground.\r\n                         \r\n          Watts screams in agony. Reaches for the saw, still buzzing on\r\n          the ground. Its grip tantalizing inches from her fingertips.\r\n                         \r\n          The Alien stoops over her, slavering face inches from her\r\n          faceplate. Its hideous jaws open.\r\n                         \r\n          With all her strength, Watts pulls against the spike in her\r\n          leg. Drags the point of the spear through the dirt.\r\n          Excruciating pain. She snarls through her teeth.\r\n                         \r\n          The Alien strikes - just as Watts GRABS the saw.\r\n                         \r\n          She meets the Alien's head with the buzzing blade.\r\n                         \r\n<b>          IMPALES THE ALIEN'S SKULL.\r\n</b>                         \r\n          A gout of green acid onto Watts's helmet.\r\n                         \r\n          The Alien falls aside, thrashing its death-throes, the saw\r\n          still growling.\r\n                         \r\n          Watts sees ACID COMING THROUGH HER HELMET - fast.\r\n                         \r\n          With frantic haste she unlatches her helmet. Wrenches it off\r\n          as it crumples and melts.\r\n                         \r\n          She stands bare-headed in the toxic air. Desperate, she looks\r\n          around with tearing eyes.\r\n                         \r\n          In the distance she sees an intact module of the Magellan.\r\n                         \r\n          She runs for it. Slaps the door switch. Incredibly, it opens.\r\n<b>           115.\r\n</b>                         \r\n                         \r\n<b>          INT. VICKERS MODULE\r\n</b>                         \r\n          Watts steps inside. The airlock closes behind her.\r\n                         \r\n          She finds herself staring at a grand piano. She's in\r\n          Vickers's suite. Its amenities intact, through the floor's a\r\n          few degrees off level. She takes a breath. Good air.\r\n                         \r\n          She walks around. Turning things on. Lights. Music. Surreal\r\n          comforts. She drinks water from the tap.\r\n                         \r\n          She opens the door to Vickers's secret room. Military space\r\n          suits. Rifles. Ammunition.\r\n                         \r\n          A crackle from the room's intercom.\r\n                         \r\n<b>           DAVID (V.O.)\r\n</b><b>                          (FILTERED)\r\n</b>           Dr. Watts.\r\n                         \r\n                         \r\n<b>          INT. JUGGERNAUT - PILOT CHAMBER\r\n</b>                         \r\n          DAVID's head lies battered in a dark corner of the wrecked\r\n          Juggernaut. Eyes staring into the shadows.\r\n                         \r\n<b>                          DAVID\r\n</b>           I know you're there. I can hear the\r\n           beacon of your suit.\r\n                         \r\n                         \r\n<b>          INT. VICKERS MODULE\r\n</b>                         \r\n          Watts strips off her space suit wearily. Sits on the bed.\r\n                         \r\n<b>           DAVID (V.O.)\r\n</b><b>                          (FILTERED)\r\n</b>           I'd like to propose an arrangement. I\r\n           can be repaired. I can talk you\r\n           through it.\r\n                         \r\n          Watts shakes her head wearily.\r\n                         \r\n<b>           DAVID (V.O.)\r\n</b><b>                          (FILTERED)\r\n</b>           I think you'll find I can be of use to\r\n           you.\r\n                         \r\n          Watts walks to the intercom and switches it off.\r\n<b>           116.\r\n</b>                         \r\n                         \r\n<b>          EXT. MAGELLAN CRASH SITE - DAY\r\n</b>                         \r\n          The storm has passed. The fragments of the Magellan no longer\r\n          burn. The gray world of LV-426 restored.\r\n                         \r\n          The wreck of the Juggernaut looms in the misty distance.\r\n                         \r\n          Watts walks through the wreckage in a military space suit.\r\n          Rifle on her shoulder. Pistol on her hip.\r\n                         \r\n          She pulls a cargo dolly loaded with salvage.\r\n                         \r\n                         \r\n<b>          EXT. VICKERS MODULE - DAY\r\n</b>                         \r\n          Watts arrives at the Vickers module. The ultramorph Alien's\r\n          head has been fixed like a grisly trophy above the door.\r\n                         \r\n                         \r\n<b>          INT. VICKERS'S SUITE (SHIPWRECK) - DAY\r\n</b>                         \r\n          Watts strips off her space suit. She helps herself to a glass\r\n          of vodka from the bar.\r\n                         \r\n          A chessboard sits atop the grand piano: a game in progress.\r\n                         \r\n<b>           DAVID (V.O.)\r\n</b><b>                          (FILTERED)\r\n</b>           I've decided. Rook takes Bishop.\r\n                         \r\n          Watts nods. Makes the move on the board. Says nothing.\r\n                         \r\n<b>           DAVID (V.O.)\r\n</b><b>                          (FILTERED)\r\n</b>           Have you decided? On our arrangement?\r\n                         \r\n<b>                          WATTS\r\n</b>           I'm not going to fix you, DAVID. I\r\n           don't need you. I'll hold out. A ship\r\n           will come.\r\n                         \r\n<b>           DAVID (V.O.)\r\n</b><b>                          (FILTERED)\r\n</b>           I'm certain. But who will send it?\r\n           Men? Or Engineers?\r\n                         \r\n          Watts falls silent. She stares unhappily at the chessboard.\r\n                         \r\n<b>           DAVID (V.O.)\r\n</b><b>                          (FILTERED)\r\n</b>           Dr. Watts. It's your move.\r\n<b>           117.\r\n</b>                         \r\n                         \r\n<b>          EXT. CENTRAL CRATER - NIGHT\r\n</b>                         \r\n          The massive central pyramid rises in the midst of the\r\n          Engineer complex.\r\n                         \r\n          With a BOOM, a bright beam of light shines forth from its\r\n          peak, punching straight up through the clouds like a laser.\r\n                         \r\n                         \r\n<b>          VARIOUS PYRAMIDS - AROUND LV-426\r\n</b>                         \r\n          Other beams of light erupt from other pyramids. Scorching the\r\n          sky with their brightness.\r\n                         \r\n                         \r\n<b>          EXT. LV-426 ORBIT\r\n</b>                         \r\n          The barren moon hangs in space, its father planet an angry\r\n          red god in the background.\r\n                         \r\n          Two dozen beams of light rise from the moon, visible even\r\n          from space. A beacon. A signal.\r\n                         \r\n          A beginning.\r\n                         \r\n                         \r\n                         \r\n<b>           FADE OUT.\r\n</b>                         \r\n<b>           THE END.\r\n</b><b>                          \r\n</b>\r\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Prometheus.jpg\"/>\n</td><td><h1>Prometheus</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Jon Spaihts\" title=\"Scripts by Jon Spaihts\">Jon Spaihts</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a>  <a href=\"/genre/Mystery\" title=\"Mystery Scripts\">Mystery</a>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Prometheus Script.html#comments\" title=\"Prometheus comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:13:55.029083"}