{"title": "Prom Night", "film_link": "/Movie Scripts/Prom Night Script.html", "script_link": "/scripts/Prom-Night.html", "info_raw": "\n\nProm Night Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  William Gray  Bob Guza\nGenres  Horror  Mystery  Thriller\nMovie Release Date : July 1980\nSubmitted by: Vinnie\n\nRead \"Prom Night\" Script\n\n\n", "script": "\n\r\n\r\n \r\n                                  PROM NIGHT\r\n\r\n\r\n\r\n                                  Written by\r\n\r\n                                 William Gray\r\n\r\n\r\n\r\n                                From a story by\r\n\r\n                                   Bob Guza\r\n\r\n\r\n\r\n                                                     FINAL DRAFT\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         FADE IN:\r\n\r\n          EXT. ELEMENTARY SCHOOL - DAY\r\n\r\n          SUPER: April 27, 1973\r\n          All is quiet outside this suburban school on a sunny\r\n          Friday afternoon. Cars idle in the driveway awaiting\r\n          the three o'clock onslaught of liberated children.\r\n          Two faded yellow buses stand ready.\r\n\r\n          The lull is shattered by the CLANGING of the final BELL.\r\n          A swarm of children pours out the door and down the\r\n          broad front steps, scattering across the lawn toward\r\n          the cars and the buses.\r\n\r\n          Moving slowly through the crowd, ROBIN and ALEX HAMMOND,\r\n          nine-year-old identical twins, appear at the doorway..\r\n          Attractive, dark-haired children, they seem more sub-\r\n          dued than the others. As they walk quietly down the\r\n          stairs, Robin lags behind, staring at a boy teasing a\r\n          girl nearby. He is NICK MCBRIDE, eleven years old,\r\n          two grades ahead of Robin and the most popular boy in\r\n          school. The pretty girl laughing at his antics is KIM\r\n          HAMMOND, also eleven, Robin's older sister.\r\n\r\n                         ALEX\r\n          C'mon, Robin.\r\n\r\n                         ROBIN\r\n\r\n                         (STUTTERING BADLY)\r\n          W-w-where's D-d-daddy?\r\n\r\n                         ALEX\r\n          He's got a meeting at the high\r\n          school. We're supposed to walk\r\n          home with Kim...\r\n          (sees Robin watching\r\n          the young couple)\r\n          She's too busy. Let's go\r\n          by ourselves.\r\n\r\n                         ROBIN\r\n          N-n-n-no, Alex. Let's w-w-wait.\r\n\r\n                         ALEX\r\n          Why?\r\n          Robin is staring at Nick. Alex looks, understands.\r\n          He's angry.\r\n\r\n                         ALEX\r\n\r\n                         (CONTINUING)\r\n          You're crazy, I'm not waiting.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         CONTINUED :\r\n          He strides away. Robin's eyes remain on Nick and Kim.\r\n          Nick says something to Kurt. She shakes her head and\r\n          pains toward Robin. Robin quickly turns away as they\r\n          look at her.. When she glances back, Ki_m is walking\r\n          towards her and Nick is bicycling away.\r\n\r\n                         KIM\r\n          Okay, let's go.\r\n          The sisters start to walk across the lawn.\r\n\r\n                         ROBIN\r\n          Y-you 1-1-like him?\r\n\r\n                         KIM\r\n          Who?\r\n\r\n                         ROBIN\r\n\r\n                         (SMILES SHYLY)\r\n          Y-you know.\r\n\r\n                         KIM\r\n          Nick? Oh, he's all right, I guess.\r\n          They walk on in silence with Robin stealing glances at\r\n          her big sister.\r\n\r\n                         ROBIN\r\n\r\n                         (FINALLY)\r\n          Are y-y-you g-gonna m-in-marry him?\r\n\r\n                         KIM\r\n          Robin?\r\n          Robin smiles and takes Kim's hand. They walk along the\r\n          road, kicking rocks and swinging their bookbags. Sud-\r\n          denly Kim halts.\r\n\r\n                         KIM\r\n\r\n                         (CONTINUING)\r\n          Oh, damn!\r\n          Robin looks up in surprise.\r\n\r\n                         KIM\r\n\r\n                         (CONTINUING)\r\n          Debbie was gonna lend me her new\r\n          record. Look, you go on home\r\n          by yourself. Tell Mom I'll be\r\n          a little late.\r\n          Before Robin can reply, Kim is hurrying away.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          3.\r\n\r\n          CONTINUED! (2)\r\n          Robin watches her go, then moves off alone, breaking\r\n          into a skip and playing imaginary hopscotch.\r\n          As she turns off the main road into a side street,\r\n          Robin passes a construction site. The empty skeleton\r\n          of a half-finished apartment building looms up above\r\n          the dark shade trees. Hearing VOICES, Robin stops to\r\n          investigate.\r\n\r\n                         ROBIN\r\n\r\n                         (CALLS OUT)\r\n          Alex?\r\n          The VOICES continue. Robin moves closer, peering\r\n          through the tall bushes surrounding the lot. She\r\n          sees Nick playing in.the framework with three of his\r\n          classmates. Robin recognizes JUDE CUNNINGHAM, and\r\n          KELLY LYNCH as Kim's two best friends. The fourth\r\n          child, WENDY RICHARDS, is a dark-haired girl, domin-\r\n          eering and loud. As Robin watches, Wendy jumps\r\n          up onto the floor of the building.\r\n\r\n                         WENDY\r\n          I want to play 'Murder.' Who's\r\n          the killer?\r\n\r\n                         NICK\r\n          You, Wendy!\r\n\r\n                         JUDE\r\n\r\n                         (GIGGLING)\r\n          you, Nick.\r\n\r\n                         KELLY\r\n          Yes, Nick!\r\n\r\n                         WENDY\r\n\r\n                         (LAUGHING)\r\n          You'll never catch me. Hide your\r\n          eyes, killer!\r\n          As Nick turns his back, hiding his eyes against an ex-\r\n          posed beam, the children scatter through the structure.\r\n          Robin watches with mounting excitement as Nick finishes\r\n          counting, and whirls around.\r\n\r\n                         NICK\r\n          The killer is coming for you!\r\n          He moves into the building, chanting \"Kill, kill.,\" in a\r\n          low monotone. As he disappears from view, Robin cau-\r\n          tiously edges out of the bushes and moves up to the\r\n          building.\r\n\r\n          NICK (O.S.\r\n          The killer strikes!\r\n\r\n                          (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          4.\r\n\r\n                         1 CONTINUED; (3) I\r\n          Robin hears Jude's SQUEAL of LAUGHTER. Nick has caught\r\n          her. Immediately Jude's VOICE TAKES UP the \"kill\"\r\n          chant in unison with Nick.\r\n\r\n          INT. APARTMENT BUILDING UNDER CONSTRUCTION - DAY 2\r\n\r\n          Robin climbs up onto the floor and peers into the dark,\r\n          gloomy structure. Suddenly, she hears a SHRIEK. Ter-\r\n          rified, she backs against a wall. LAUGHTER FOLLOWS im-\r\n          mediately and Robin hears Kelly's VOICE TAKING UP the\r\n          chant. As the three \"killers\" move through the vast\r\n          structure searching for Wendy, \"KILL, KILT\" ECHOES off\r\n          the walls and hardwood floors.\r\n          Robin cautiously steps out of the doorway into the im-\r\n          mense unfinished lobby. Ominous shadows slash across\r\n          the floor as the excited girl listens to the relentless\r\n          CHANTING of the children.\r\n          Robin pushes on a makeshift wooden door. It slips off\r\n          its temporary hinges, crashing down to the floor. The\r\n          NOISE is like a rifle shot; suddenly, there is ABSOLUTE\r\n          SILENCE in the structure.\r\n          Petrified, Robin crouches behind a wall, waiting. The\r\n          CHANTING quickly RESUMES and she breathes a long sigh\r\n          of relief.\r\n          Robin moves through a dark corridor, hugging the walls.\r\n          Flushed with excitement, she imagines herself a \"killer\"\r\n          searching for Wendy. As she moves past an empty room,\r\n          she hears a SOFT GIGGLE. Robin stops and listens care-\r\n          fully. Once again she hears the GIGGLE, LOUDER this\r\n          time, coming from nearby.\r\n          Stepping to a doorway, she leans around the corner and\r\n          peers inside. In the darkness she can see nothing.\r\n          Gathering her courage, she quietly slips into the room.\r\n          The room appears empty but a closet door is slightly\r\n          ajar. As Robin approaches, she hears a FAINT GASP from\r\n          behind her. Whirling around, she sees Wendy crouched\r\n          behind a cardboard box in the corner.\r\n\r\n                         WENDY\r\n\r\n                         (HISSING)\r\n          You better not tell!\r\n          Before Robin can react, she hears a THUD from above.\r\n          Looking up, she sees Nick's head appear through an\r\n          opening in the ceiling. Seeing Robin, then Wendy\r\n          standing in the corner, he howls in triumph.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          5.\r\n\r\n                         CONTINUED:\r\n\r\n                         NICK\r\n\r\n                         (CALLING OUT)\r\n          Here, killers, here!\r\n          Nick's head disappears from the opening and Robin hears\r\n          the POUNDING of RUNNING FEET.\r\n\r\n                         WENDY\r\n\r\n                         (MALICIOUSLY)\r\n          Now you've done it, you idiot!\r\n          The CHANTING GROWS LOUDER as the \"killers\" rush towards\r\n          the room. Trapped, Wendy looks frantically for an es-\r\n          cape but finds nothing. Turning around suddenly, she\r\n          grins at Robin, a cruel, hard expression on her face.\r\n\r\n                         WENDY\r\n\r\n                         (CONTINUING; SLOWLY)\r\n          Kill, kill, kill...\r\n          Picking up the chant, Wendy begins to advance on Robin.\r\n          Terrified, Robin turns and rushes out of the room,\r\n          bowling over Nick in the doorway. Delighted that the\r\n          game is continuing with a new victim, he follows Wendy\r\n          in pursuit of Robin.\r\n          Robin flees down the long, dark corridor, \"KILL, KILL\r\n          ECHOING in her wake. As she rounds a corner, Jude ap-\r\n          pears, looming up in front of her. Robin screams and\r\n          sprints in the opposite direction. Kelly leaps out of\r\n          a doorway and grabs for her, but Robin, swinging out\r\n          blindly, escapes the \"killer.\"\r\n\r\n          INT. STORAGE ROOM - DAY 3\r\n\r\n          Darting into the large room, Robin collapses against a\r\n          wall, gasping for breath. As her eyes adjusts to the\r\n          darkness, she spies a rickety ladder extending through\r\n          a hole in the floor to the basement below. Stacked up-\r\n          right near the opening are several sheets of window\r\n          glass. Before Robin can make a move towards the lad-\r\n          der, she hears a horrible SCREECH and Wendy appears in\r\n          the doorway, a vicious look on her face.\r\n\r\n                         WENDY\r\n          Killers, here!\r\n          Wendy advances. Terrified, Robin begins to back away.\r\n\r\n                         ROBIN\r\n          N-n-n-no!\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          6.\r\n\r\n                         CONTINUED:\r\n          Nick, Jude and Kelly appear in the doorway, chanting\r\n          \"Kill, kill.\" Moving quickly, Robin grabs the ladder\r\n          and starts down into the basement, careful not to knock\r\n          over the sheets of glass stacked near the opening.\r\n          Peering into the pitch-black basement, Robin hesitates.\r\n          But as Wendy and her fellow \"killers\" close in on her,\r\n          Robin continues down the ladder. Wendy rushes up and\r\n          grabs the ladder.\r\n\r\n                         ROBIN\r\n\r\n                         (CONTINUING)\r\n          P-p-please!\r\n          Wendy grins and shakes the ladder. The chanting is\r\n          deafening. Robin hugs the wooden slats. Wendy shakes\r\n          even harder. Robin screams. Nick moves around Wendy\r\n          to get a better look. He accidentally bumps the glass\r\n          stacked next to the opening. The sudden movement is\r\n          just enough to dislodge a razor-sharp pane of glass and\r\n          send it hurtling down directly at Robin.\r\n          The girl's last scream catches in her throat as the\r\n          glass slices through her neck. She is instantly\r\n          decapitated.\r\n          Horrified, Wendy watches the glass and the body crash\r\n          to the concrete basement floor. Kelly screams. Jude\r\n          sobs loudly. Nick can only stare in shock. Finally,\r\n          he manages to speak.\r\n\r\n                         NICK\r\n\r\n                         (WHISPERING HOARSELY)\r\n          We gotta get somebody quick!\r\n          Nick starts to go. Wendy instantly whirls, grabs his\r\n          arm.\r\n\r\n                         WENDY\r\n          Are you crazy? They'll put us in\r\n          jail!\r\n          Confused, Nick cannot reply. The other girls grow\r\n          silent.\r\n\r\n                         WENDY\r\n\r\n                         (CONTINUING)\r\n          If we tell anyone, they'll say\r\n          it's our fault. Who'd believe it\r\n          was an accident?\r\n          Nick starts to protest.\r\n\r\n                         WENDY\r\n\r\n                         (CONTINUING;\r\n\r\n                         INTERRUPTING)\r\n          Listen to me!\r\n\r\n                         (MORE)\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          7.\r\n\r\n                         CONTINUED: (2)\r\n\r\n           WENDY (C ONT D )\r\n          We'll go home now and never ever\r\n          tell anyone. They'll think it was\r\n          an accident. 1,10 one but us will\r\n          ever know.\r\n          She looks at each of them. They are still too numb to\r\n          respond.\r\n\r\n                         WENDY\r\n\r\n                         (CONTINUING)\r\n          Everybody swear never to tell!\r\n          Wendy glares at Jude.\r\n\r\n                         WENDY\r\n\r\n                         (CONTINUING)\r\n          Jude?\r\n\r\n                         JUDE\r\n\r\n                         (SOFTLY)\r\n          I swear.\r\n\r\n                         WENDY\r\n          Kelly?\r\n          Kelly looks from Wendy to the mangled body and begins\r\n          to whimper.\r\n\r\n                         WENDY\r\n\r\n                         (CONTINUING; STERNLY)\r\n          Kelly!\r\n          The frightened girl looks up at Wendy.\r\n\r\n                         KELLY\r\n\r\n                         (WHISPERS)\r\n          I don't wanta go to jail...\r\n\r\n                         WENDY\r\n          Swear!\r\n\r\n                         KELLY\r\n          I swear.\r\n          Wendy turns to Nick. At first he appears defiant, ready\r\n          to object, but he wilts under her withering gaze.\r\n\r\n                         NICK\r\n\r\n                         (FINALLY)\r\n          I won't tell.\r\n\r\n                         WENDY\r\n\r\n                         SLOWLY NODS)\r\n          Good.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         CONTINUED: (3)\r\n          With a final glance down at Robin's mutiliated body,\r\n          Wendy quickly ushers her shocked friends out of the\r\n          room.\r\n          As their FOOTSTEPS ECHO away across the hardwood floor,\r\n          there is a terrible silence. Then, starting very\r\n          quietly, more FOOTSTEPS are HEARD, this time a single\r\n          person approaching the ladder from above. The FOOT-\r\n          STEPS STOP and a deep, black shadow falls across the\r\n          ladder; HEAVY BREATHING punctuates the oppressive\r\n          quiet, growing louder and more anguished.\r\n\r\n                         CUT TO:\r\n\r\n          INT. STORAGE ROOM - DUSK\r\n\r\n          We slowly TILT UP TO the tortured features of RAYMOND\r\n          HAMMOND, Robin's father. A handsome, dark-haired man\r\n          in his late thirties, he teaches history at George\r\n          Winston High School.\r\n          Wracked with grief, he stands near the opening in the\r\n          floor and watches as two Paramedics bring up the body\r\n          of his daughter from the dark basement.\r\n          A young Policeman standing nearby raises the white\r\n          sheet covering Robin's remains. Hammond steps up\r\n          and gazes at his daughter's decapitated body. A\r\n          look of absolute horror and revulsion freezes\r\n          on his face; what he sees he will never forget.\r\n          Paralyzed, Hammond barely hears the CAR PULLING UP\r\n          in front of the construction site. He turns and\r\n          looks out the window.\r\n\r\n          EXT. APARTMENT BUILDING UNDER CONSTRUCTION - DUSK 5\r\n\r\n          A Police Officer is getting out of his car. Walking\r\n          around to the passenger side, he opens the door\r\n          for an attractive blonde woman in her mid-thirties.\r\n          VIVIAN HANMOND, Robin's mother, appears pale and\r\n          haggard as she steps out of the car. Kim and Alex\r\n          slowly climb out of the back, With the Police Officer\r\n          escorting her, Vivian and her children move toward\r\n          the skeleton of a building.\r\n          Catching sight of her husband framed in a lower window,\r\n          Vivian suddenly breaks. away from the Police Officer and\r\n          runs inside the building.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          INT. STORAGE ROOM - DUSK\r\n\r\n          Hammond moves quickly to the door, grabbing his\r\n          hysterical wife as she bursts into the room.\r\n\r\n                         HA:MMIOND\r\n          No!\r\n\r\n                         VIVIAN\r\n\r\n                         (SOBBING WILDLY)\r\n          Where is she? Where is Robin?\r\n          Seeing the covered figure lying on a stretcher, Vivian\r\n          moans in anguish.\r\n          Struggling furiously, she strains to break her hus-\r\n          band's hold, but he is too powerful.. They are both\r\n          in tears, shaking with grief, when Kim and Alex step\r\n          into the doorway.\r\n\r\n                         KIM\r\n\r\n                         WHISPERING)\r\n          Daddy?\r\n\r\n                         HAMMOND\r\n          (angrily,\r\n\r\n                         TO VIVIAN)\r\n          Why did you bring them here?\r\n          Vivian collapses, burying her head in his shoulder\r\n          and sobbing furiously, but Hammond pushes her out of\r\n          the room.\r\n\r\n          HA ` 0 N D\r\n\r\n                         (CONTINUING)\r\n          Kim! Alex! Stay out in the\r\n          hallway!\r\n          Kim stumbles out into the corridor and begins to\r\n          cry softly. Alex takes his mother's hand and tries\r\n          comfort her.\r\n          The Paramedics pick up the stretcher and maneuver it\r\n          out of the room. As they pass through the doorway into\r\n          the corridor, a corner of the sheet slips off Robin's\r\n          corpse. Before a Paramedic can replace it, the de-\r\n          capitated torso is briefly glimpsed by the family.\r\n          Alex is shocked. Kim doesn't appear to realize what\r\n          she sees. But Vivian's horror wells up in her\r\n          throat, bursting out in a deranged scream.\r\n\r\n                         CUT TO:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          INT. BEDROOM - DAY\r\n\r\n          Another SCREAM, as throbbing DISCO MUSIC pulsates from\r\n          a large portable RADIO sitting on a dresser.\r\n\r\n          SUPER: APRIL 27, 1980.\r\n          A young woman with long, golden brown hair and a trim\r\n          figure is slipping into a pair of tight jeans. Pull-\r\n          ing on a halter top, she sways to the MUSIC.\r\n\r\n          VIVIAN (O.S.)\r\n\r\n                         (CALLS OUT)\r\n          Kim! Turn that music down. You're\r\n          driving me crazy!\r\n          Turning around at the SOUND of her mother's VOICE, Kim\r\n          Hammond reaches for the volume control Now eighteen,\r\n          she is a strikingly beautiful girl with an open,\r\n          innocent quality.\r\n\r\n                         KIM\r\n\r\n                         (CALLS OUT)\r\n          Okay, Mom!\r\n          Kim quickly finishes dressing, whirling around the room\r\n          to the pounding disco rhythm. Giving her hair a few\r\n          final strokes with a brush, she gazes at a photograph\r\n          of a young man stuck in her mirror. On the picture\r\n          is written: \"To Kim, the best on the floor... dancing,\r\n          that is! Love, Nick.\"\r\n          Kim glances at another photograph stuck in her mirror.\r\n          This one shows her sister, Robin, taken a few days be-\r\n          fore the accident. Her sadness passes as quickly as it\r\n          came. Gathering her textbooks, she switches OFF the\r\n          RADIO and exits.\r\n\r\n          8 INT. KITCHEN - DAY\r\n\r\n          Raymond and Vivian Hammond are just finishing break-\r\n          fast. The years have favored him; except for a touch\r\n          of gray around the temples and a few extra pounds, he\r\n          looks much the same way as we remember him. Vivian,\r\n          however, wears the strain of the past seven years\r\n          in her gaunt, drawn features and high-strung manner.\r\n          Thumbing through his morning newspaper, Hammond steals\r\n          quick glances at his wife. She does not look up at\r\n          him, but stares at the table, toying with her spoon.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         8 CONTINUED:\r\n\r\n                         HAMMOND\r\n          (reading the paper)\r\n          I'll tell you, Vi, I'm thinking\r\n          of starting up an armed robbery\r\n          course at the high school..\r\n          I've got a feeling it'd be\r\n          popular...\r\n          He smiles at his joke, looks at her. She doesn't seem\r\n          to have heard him.\r\n\r\n                         HAMMOND\r\n\r\n                         (CONTINUING)\r\n          I just hope there's no trouble\r\n          at the prom tonight...\r\n          Kim bursts into the kitchen, interrupting her father\r\n          with a kiss on the head.\r\n\r\n                         KIM\r\n\r\n                         (LAUGHS)\r\n          Mmmm, sounds like fun!\r\n\r\n                         HAMMOND\r\n\r\n                         (SMILING)\r\n          And how is the next queen of the\r\n          Winston High Junior-Senior Prom?\r\n\r\n                         KIM\r\n          Scared tiff.\r\n          She leans over to kiss her mother. Vivian automatical-\r\n          ly turns her cheek to Kim without looking at her.\r\n\r\n                         KIM\r\n\r\n                         (CONTINUING)\r\n          Morning, Mom. We got any yogurt?\r\n\r\n                         VIVIAN\r\n\r\n                         (WITHOUT LOOKING\r\n\r\n                         AT KIM)\r\n          No, dear. Fix yourself a good\r\n          meal. You're getting awfully\r\n          thin.\r\n          Kim and her father exchange glances. He shrugs\r\n\r\n                         HAIVMOND\r\n          who's your lucky escort tonight?\r\n\r\n                         KIM\r\n          You know, Daddy... Nick.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          1L,\r\n\r\n                         CONTINUED: (2)\r\n\r\n                          HAM`IOND\r\n\r\n                          (NODS)\r\n          I've been trying to forget. The\r\n          boy's too sure of himself.\r\n\r\n                         KIM\r\n\r\n                         (INTERRUPTS)\r\n          Mom, tell him...\r\n\r\n                         VIVIAN\r\n\r\n                         (SOFTLY)\r\n          Seven years ago today.\r\n          Hammond carefully folds his paper and places it on the\r\n          table.\r\n\r\n                         HAMÏ¿½TOND\r\n          (affects a casual\r\n\r\n                         ATTITUDE)\r\n          Vi, I made you an appointment with\r\n          Dr. Fairchild.\r\n          Vivian finally looks up at him.\r\n\r\n                         HAMMOND\r\n\r\n                         (CONTINUING)\r\n          It's this morning, actually.\r\n          Sorry I forgot to mention it.\r\n\r\n                         VIVIAN\r\n          Today?\r\n\r\n                         HAMMOND\r\n\r\n                         (LOOKS AWAY)\r\n          You'd better get ready. He's\r\n          fitting you in early before his\r\n          other... people.\r\n\r\n                         VIVIAN\r\n\r\n                         (UPSET)\r\n          It doesn't help. You know that!\r\n\r\n                         HAMIOND\r\n          Now, Vi...\r\n          Vivian stumbles to her feet and rushes out of the kitch-\r\n          en before he can finish. With a glance at Kim, Hammond\r\n          hurries after his wife. Going out through the swinging\r\n          door, he bumps into a young man just entering.\r\n\r\n                         HAM4OND\r\n\r\n                         (CONTINUING)\r\n          Morning, Alex.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          1J.\r\n\r\n                         CONTINUED: (3)\r\n          Hammond exits. Alex, now sixteen, a tall, slender\r\n          boy, casts a knowing look at Kim. Kim nods. Alex.\r\n          shakes his head, then begins to rummage through the\r\n          Pantry, pulling out a Hostess viTikie. ?lopping\r\n          down at the table, he flips open his electronics book\r\n          and begins to read. Munching on his Twinkie, he\r\n          swipes sips from Kim's glass of milk.\r\n\r\n                         KIM\r\n          Have you got a date for tonight?\r\n          His mouth crammed.full of Twinkie, Alex mumbles his\r\n          reply.\r\n\r\n                         KIM\r\n\r\n                         (CONTINUING)\r\n          I happen to know Jude might be\r\n          available. Of course, she is older,\r\n          but...\r\n          Alex almost chokes.\r\n\r\n                         ALEX\r\n          C'mon, Kimbo, I may be hard up...\r\n\r\n                         KIM\r\n          Alex! Jude's cute... Besides,\r\n          she's funny and really smart.\r\n          Give you somebody to do equations\r\n          with!\r\n\r\n                         ALEX\r\n\r\n                         (SARCASTIC)\r\n          Great... Anyway, I'm in charge of\r\n          the sound system tonight.\r\n\r\n                         KIM\r\n          Not bad but it's not romance.\r\n\r\n                         ALEX\r\n          It'll do for tonight.\r\n          Kim shoots him a look, then backs off.\r\n\r\n                         KIM\r\n          If you get a chance, dance with\r\n          Jude once or twice, okay?\r\n\r\n                         ALEX\r\n          Sure.\r\n          He returns her glass of milk, empty.\r\n\r\n                          (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         8 CONTINUED: (4) 8\r\n\r\n                         ALEX\r\n\r\n                         (CONTINUING)\r\n          Any more milk?\r\n\r\n          9 INT. LIVING ROOM - DAY\r\n\r\n          Hammond and Vivian are standing by the fireplace. His\r\n          hand is on her shoulder. She faces the mantel, her\r\n          back to him. On the mantel is a small shrine to the\r\n          memory oftheir dead daughter; a framed photograph,\r\n          fresh roses, two candles and a lock of her hair in a\r\n          glass case.\r\n\r\n                         HAMMOND\r\n          Trust me.\r\n          Vivian does not move. Finally, after a long pause,\r\n          she turns toward her husband. Her eyes filled with\r\n          tears, she nods.\r\n\r\n          10 INT. CAR (MOVING) - DAY 10\r\n\r\n          Hammond is driving. Vivian stares blankly out the win-\r\n          dow at the grimy city streets. Sitting in the back,\r\n          Kim and Alex exchange uncertain glances. A tense si-\r\n          lence pervades.\r\n\r\n          11 EXT. OFFICE BUILDING - DAY 11\r\n\r\n          The Hammonds' car pulls up in front of a towering\r\n          modern building.\r\n\r\n          12 INT. CAR - DAY 12\r\n\r\n          Hammond cuts off the engine and turns to Kim and Alex.\r\n\r\n                         HAMMOND\r\n          I'll just be a minute...\r\n          Vivian is already reaching for the door handle,\r\n\r\n          13 EXT. OFFICE BUILDING - DAY 13\r\n\r\n          Alex jumps out of the car and opens the door for his\r\n          mother. Taking her arm, he helps her out. Kim leans\r\n          over in the back seat.\r\n\r\n                         KIM\r\n          See you later,'Mom.\r\n          Vivian gives her a thin smile. Hammond takes her arm\r\n          and leads her into the imposing building.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          15.\r\n\r\n          14 INT. LOBBY - DAY 14\r\n\r\n          Hammond and Vivian cross the room. Though she offers\r\n          no resistance, it appears he is pulling her along.\r\n          They hurry into an elevator after an elderly CLEANING\r\n          WOMAN carrying a mop and a bucket.\r\n\r\n          15 INT. ELEVATOR - DAY 15\r\n\r\n          They stand in silence. The Cleaning Woman puffs on a\r\n          cigarette, blithely ignoring the NO SMOKING sign posted\r\n          on the wall. Vivian nervously reaches into her purse\r\n          and removes a bottle of Valium. Quickly popping two\r\n          pills into her mouth, she swallows with difficulty and\r\n          snaps her purse shut. Hammond says nothing.\r\n          Just as the elevator doors slide open, the Cleaning Wo-\r\n          man touches Vivian on the shoulder, causing her to jump\r\n          in fright.\r\n\r\n                         CLEANING WOMAN\r\n          Could I have one of those? My\r\n          nerves are shot this morning.\r\n          With a terrified glance back at the woman, Vivian\r\n          rushes out of the elevator. Hammond follows.\r\n\r\n          16 INT. CORRIDOR - DAY 16\r\n\r\n          Hammond and Vivian move down the long, empty hallway.\r\n          As they round a corner, a figure is visible unlocking\r\n          a door.\r\n\r\n                         HAI` IOND\r\n\r\n                         (CALLS OUT)\r\n          Dr. Fairchild!\r\n          DR. RUPERT FAIRCHILD straightens up and turns around.\r\n          He's a. portly man in his fifties, trying to disguise\r\n          his girth with careful tailoring.\r\n\r\n          17 INT. OFFICE - DAY 17\r\n\r\n          Fairchild bustles about the reception area, turning on\r\n          lights, checking his messages and appointment calendar.\r\n          Fairchild is obsessively neat, the office reflects him.\r\n\r\n                         HAIIOND\r\n          We appreciate your seeing... us.\r\n          I know how busy you must be.\r\n          Vivian is staring at a painting of a young girl playing\r\n          with a kitten. Catching Fairchild's eye, Hammond nods\r\n          toward the outer door. Vivian does not notice the\r\n          gesture.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         17 CONTINUED: 17\r\n          Fairchild nods in return. Stepping over to his inner\r\n          office, he opens the door.\r\n\r\n                         FAIRCHILD\r\n          Have a seat, Vivian. I'll be\r\n          right in.\r\n          She slowly crosses the room, turning suddenly in the\r\n          doorway.\r\n\r\n                         VIVIAN\r\n\r\n                         (TO HAMMOND)\r\n          Don't forget we're going to the\r\n          cemetery this afternoon. I want\r\n          Robin to have her flowers.\r\n          Hammond moves over to his wife. Taking her by the\r\n          shoulders, he kisses her lightly on the forehead.\r\n\r\n                         HAMMOND\r\n          I won't forget.\r\n          Vivian looks from Hammond to Fairchild, who smiles.\r\n          She enters the office, leaving the door open. Hammond\r\n          shakes hands with Fairchild, and for Vivian's benefit\r\n          adds...\r\n          HAï¿½I`i IOND\r\n\r\n                         (CONTINUING)\r\n          Thank you, Doctor.\r\n          Hammond exits.\r\n\r\n          18 , INT. CORRIDOR - DAY 18\r\n\r\n          Hammond leans against the wall outside Fairchild's of-\r\n          fice. He glances at his watch. The door opens and\r\n          Fairchild steps out, holding a container. Hammond\r\n          walks with him down the corridor towards the water\r\n          fountain.\r\n\r\n          H.ANMOND\r\n          She's at it again.\r\n\r\n                         FAIRCHILD\r\n\r\n                         (NODS)\r\n          Today's the date?\r\n\r\n                         HAIM BOND\r\n          Seven years ago today Robin was\r\n          killed.\r\n          Fairchild looks up from filling his container with\r\n          water.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          17.\r\n\r\n                         18 CONTINUED: 18\r\n\r\n          HA,E,10ND\r\n\r\n                         (CONTINUING; MUSING)\r\n          This would have been her first prom.\r\n\r\n                         FAIRCHILD\r\n          Pardon?\r\n\r\n                         HAKMOND\r\n          Tonight's the Junior-Senior Prom\r\n          at our high school. Robin would\r\n          have been sixteen, She and Alex.\r\n\r\n                         FAIRCHILD\r\n          The twins... How is Alex?\r\n\r\n                         HAIIOND\r\n          Fine. I just thank God he was too\r\n          young to really understand what\r\n          happened to his sister.\r\n\r\n                         FAIRCHILD\r\n          And your older daughter?\r\n\r\n                         HANMOND\r\n\r\n                         (SMILES)\r\n          Kimmy's my princess. Sometimes she'll\r\n          get depressed for a while... but it\r\n          never lasts long. Young people seem\r\n          so much more... resilient.\r\n          They walk back to the office.\r\n\r\n                         FAIRCHILD\r\n          (looking up at Hammond)\r\n          And yourself? No scars?\r\n\r\n                         HATIOND\r\n          (after a pause)\r\n          I've learned to live them..\r\n          Vivian seems worse this time.\r\n\r\n                         FAIRCHILD\r\n\r\n                         (NODS)\r\n          The persistence of Vivian's trauma.\r\n          I wonder if there isn't something\r\n          more serious at work here?\r\n\r\n                         HAMOND\r\n          Something more serious than her\r\n          daughter's death?\r\n\r\n          19 INT. OFFICE - DAY 19\r\n\r\n          Vivian fidgets in her chair. She seems very small and\r\n          vulnerable in the large, somber office.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          18.\r\n\r\n          20 INT. CAR (MOVING) DAY 20\r\n\r\n          Alex is seated opposite his father in the front seat.\r\n          Kim is in back. Easy listening MUSIC PLAYS softly on\r\n          the car RADIO. Alex fiddles with the tuning dial,\r\n          searching for music more to his tastes. Lost in\r\n          thought, Hammond does not see the young girl skipping\r\n          through the pedestrian crossing.\r\n\r\n                         KIM\r\n\r\n                         (SCREAMS)\r\n          Daddy!\r\n          Hammond slams on the brakes, throwing Alex against\r\n          the dashboard.\r\n\r\n          21 EXT. STREET - DAY 21\r\n\r\n          The CAR SCREECHES to a halt inches away from the terri-\r\n          fied child who stands frozen in the middle of the\r\n          crossing. After a moment, realizing she is safe, the\r\n          girl giggles nervously and skips away.\r\n\r\n          22 INT. CAR - DAY 22\r\n\r\n          Hammond lets out a sigh and turns to his children.\r\n\r\n                         HAMMOND\r\n          You all right?\r\n          They both nod. Alex massages his wrist. Hammond\r\n          slips the car into gear and cautiously continues\r\n          driving.\r\n\r\n                         KIM\r\n          You're worried about Mom?\r\n\r\n                         HALMOND\r\n          I was...\r\n          He is interrupted by DISCO MUSIC ON the RADIO. Play-\r\n          ing with the tuning dial, Alex quickly tries to pass\r\n          over the music.\r\n\r\n                         KIM\r\n          Hey, keep that!\r\n          Alex groans but does as she asks.\r\n\r\n                         ALEX\r\n          Disco sucks!\r\n\r\n                         HAMZMOND\r\n\r\n                         (REPROVINGLY)\r\n          Alex!\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          19.\r\n\r\n                         22 CONTINUED: 22\r\n\r\n                          ALEX\r\n           Sorry, Dad...\r\n           (turns back to\r\n\r\n                          KIM)\r\n          Disco bites it!\r\n\r\n                         HAMMOND\r\n\r\n                         (DRYLY)\r\n          That's much better.\r\n          The car pulls into the Winston High School parking lot.\r\n          They pile out.\r\n\r\n          23 EXT. PARKING LOT - DAY 23\r\n\r\n           Hammond, Kim and Alex walk through the empty lot\r\n           towards the school. Suddenly, we HEAR a loud GRATING\r\n          SOUND coming from nearby. The sudden noise startles\r\n          Kim and she huddles against her father.\r\n          A seedy little middle-aged man with a stubble of gray\r\n          beard appears from behind a row of bushes, brandishing\r\n          a pair of electric hedge clippers.\r\n\r\n                         HANMMMOND\r\n          Good morning, Mr. Sykes.\r\n          SANFORD SYKES, the newly-hired custodian, bares his\r\n          yellow teeth in a crooked grin and waves the whirring\r\n          blades in salute. Kim shudders and stays close to\r\n          her father as they walk on.\r\n\r\n                         KIM\r\n          He's creepy.\r\n\r\n                         ALEX\r\n          I heard he's wacko.\r\n\r\n                         HAIIOND\r\n          The man is not... wacko.\r\n\r\n                         KIM\r\n          Kelly says he's a pervert, spying\r\n          on the girls undressing in the\r\n          locker room.\r\n\r\n                         HAIIOND\r\n          Sykes may have some problems, but\r\n          he's no Peeping Tom. He's been\r\n          thoroughly checked out.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          20,\r\n\r\n                         23 CONTINUED: 23\r\n          They climb the broad front steps of the high school.\r\n          Hammond glances at his watch.\r\n\r\n                         HAMNIOND\r\n\r\n                         (CONTINUING)\r\n          You're early today. Plenty of\r\n          time to study with no one to\r\n          bother you.\r\n          Kim reaches up.and kisses her father on the cheek.\r\n          Pulling out a fashion magazine, she rushes off, call-\r\n          ing back over her shoulder.\r\n\r\n                         KIM\r\n          I'.ve got to decide on my hair\r\n          style for tonight.\r\n\r\n                         HAMMOND\r\n\r\n                         (WRYLY)\r\n          Wonderful. Alex?\r\n\r\n                         ALEX\r\n          I'm building an atomic bomb in\r\n          shop.\r\n          Smiling, he moves inside. Hammond shakes his head\r\n          and hurries off.\r\n\r\n          24 INT. CORRIDOR - DAY 24\r\n\r\n          Hammond moves through the empty hallway, stopping at\r\n          a door which reads: PRINCIPAL: RAYMOND HAMMOND. He\r\n          is fumbling for his key when he sees through the\r\n          frosted glass a figure moving around in his office.\r\n          Reaching for the doorknob, he very quietly opens the\r\n          door.\r\n\r\n          25 INT. OFFICE DAY 25\r\n\r\n          As the door slowly swings open, Hammond sees the outer\r\n          office covered with pieces of paper; sheets are\r\n          scattered across desks and chairs and over most of\r\n          the floor. Stepping inside, Hammond spies a WOMAN\r\n          bending over, frantically picking up paper from the\r\n          floor.\r\n          He slams the door. At the sudden SOUND, the startled\r\n          Woman whirls around, still squatting, and falls on her\r\n          rear.\r\n\r\n                         HAMMIOND\r\n          Who are you?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          21.\r\n\r\n                         25 CONTINUED: 25\r\n          Flustered, the attractive young Woman hastily gets to\r\n          her feet and straightens her skirt.\r\n\r\n                         WOMAN\r\n\r\n                         (BADLY FLUSTERED)\r\n          Oh God! They told me you wouldn't\r\n          be in till nine!\r\n\r\n                         HAMMOND\r\n\r\n                         (INCREDULOUS)\r\n          What're you doing, robbing me?\r\n\r\n                         WOMAN\r\n\r\n                         (GIGGLING\r\n\r\n                         NERVOUSLY)\r\n          Oh... no, I'm your Working Girl\r\n          Hammond stares, wide-eyed.\r\n\r\n                         WOMAN\r\n\r\n                         (CONTINUING)\r\n          your temporary secretary.\r\n          What's-her-name is sick.\r\n          (extends her hand)\r\n          Hi. I'm Adele.\r\n\r\n                         HAM 0ND\r\n          (taking her hand)\r\n          What happened?\r\n\r\n                         WOMAN (ADELE)\r\n          Well you see, Mr. Hammond, the,\r\n          air conditioner fan was set for\r\n          high but...\r\n\r\n                         HAP-MOND\r\n\r\n                         (INTERRUPTS)\r\n          Please, Miss... Adele,\r\n\r\n                         ADELE\r\n\r\n                         (INTERRUPTS)\r\n          Cooper... Ms. Cooper.\r\n\r\n                         HA MOND\r\n          Whatever! I have some important\r\n          calls to make. Please see that I'm\r\n          not disturbed...\r\n          (wades through the\r\n          papers to his inner\r\n\r\n                         OFFICE DOOR)\r\n          , and put all this back where it\r\n          belongs!\r\n          He enters his office.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          26 INT. HA,1NI OND' S OFFICE - DAY 26\r\n\r\n          Hammond tosses his briefcase onto the desk and drops\r\n          into his chair. He stares at the telephone for a long\r\n          moment, drumming his finger on the desk.\r\n\r\n                         CUT TO:\r\n\r\n          27 INT. BEDROOM - DAY 27\r\n\r\n          A pink TELEPHONE RINGS. The plush bedroom is empty;\r\n          suddenly Wendy Richards rushes in. Now eighteen, Wendy\r\n          is a raven-haired beauty with a full figure, accentua-\r\n          ted by a low-cut black blouse and tight designer jeans.\r\n          Tossing her books onto the bed, she eagerly grabs the\r\n          receiver.\r\n\r\n                         WENDY\r\n\r\n                         (BREATHLESSLY)\r\n          Nick?\r\n          A long pause, followed by HEAVY BREATHING. Wendy is\r\n          about to respond when the inhuman VOICE speaks in an\r\n          eerie, androgynous stutter.\r\n\r\n                         TELEPHONE VOICE\r\n          W-Wendy? T-t-tonight it's m-m-my\r\n          t-turn!\r\n          Wendy's shock quickly turns to anger.\r\n\r\n                         WENDY\r\n          Screw you, Lou!\r\n          Wendy slams the receiver into its cradle. Grabbing her\r\n          books, she storms out of her bedroom.\r\n\r\n          28 INT. FRONT HALL - DAY 28\r\n\r\n          Wendy hurries do-in the ornate staircase.\r\n          Waiting at the bottom holding the girl's sweater is\r\n          MAUDE, the Richards' elderly housekeeper.\r\n\r\n                         MAUDE\r\n          You be home for dinner, Wendy?\r\n          Wendy angrily grabs her sweater from the woman.\r\n\r\n                         WENDY\r\n          How the hell do I know?\r\n          She exits.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          L3.\r\n\r\n          29 EXT. RICHARD'S HOUSE - DAY 29\r\n\r\n          The expansive residence sits back off the road in this\r\n          upper-middle-class suburb. Wendy climbs into her\r\n          white Mustang and starts the engine. TIRES SQUEALING,\r\n          she ROARS out of the driveway with the RADIO BLASTING.\r\n\r\n          30 INT. KITCHEN - DAY 30\r\n\r\n          Kelly Lynch is just finishing breakfast when the\r\n          TELEPHONE RINGS. The petite blonde eighteen-year-old\r\n          stuffs a last bite of toast into her mouth and picks\r\n          up the receiver.\r\n\r\n                         KELLY\r\n\r\n                         (MUMBLING )\r\n          Hullo?\r\n          A pause, then HEAVY BREATHING. Kelly's eyes grow wide\r\n          as the dreadful voice speaks.\r\n\r\n                         TELEPHONE VOICE\r\n          K-K-Kelly? T-tonight it's m-m-ï¿½IZ\r\n          Horrified, Kelly drops the phone. The DOORBELL RINGS.\r\n          Frightened, she gasps, hugging the wall. The DOORBELL\r\n          RINGS again. Very slowly she moves out of the kitchen.\r\n\r\n          31 INT. HALL - DAY 31\r\n\r\n          Kelly cautiously approaches the front door. Peering\r\n          through a crack in the drapes, she sees a dark figure\r\n          huddled near the door. With the latch secured, she\r\n          takes a deep breath and opens the door.\r\n\r\n                         KELLY\r\n          Yes?\r\n\r\n          DREW (O.S.)\r\n          Christ, Kelly, c'mon! We're late!\r\n          Relief floods across her face. Kelly quickly unfastens\r\n          the latch.\r\n\r\n                         KELLY\r\n          Oh, Drew, thank God!\r\n          She throws herself into the arms of the pleasantly sur-\r\n          prised DREW SHINNICK, a muscular blond athlete.\r\n\r\n                         DREW\r\n          (holding her tightly)\r\n          I'm glad to see you, too.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          24.\r\n\r\n                         31 CONTINUED: 31\r\n          She looks up at him.\r\n\r\n                         KELLY\r\n          Drew, this horrible -voice...\r\n\r\n                         DREW\r\n          Nightmare?\r\n\r\n                         KELLY\r\n          On the telephone. It sounded so\r\n          evil!\r\n\r\n                         DREW\r\n\r\n                         (LAUGHING)\r\n          What'd you get, a heavy breather?\r\n\r\n                         KELLY\r\n          Worse than that...\r\n\r\n                         DREW\r\n\r\n                         (INTERRUPTS)\r\n          Turned you on did he? Maybe I\r\n          should try that!\r\n          She breaks from his grasp.\r\n\r\n                         KELLY\r\n          'm serious!\r\n          Drew makes a grab for her but she avoids him, hurries\r\n          inside. He sighs and leans against the doorjamb to\r\n          wait.\r\n\r\n                         DREW\r\n          So am I.,.\r\n\r\n          32 INT. CAR (MOVING) - DAY 32\r\n\r\n          Drew is driving, his-arm around Kelly. She still\r\n          appears shaken by the telephone call. The RADIO is ON.\r\n          His right hand slowly descends towards her breast.\r\n          She swats it away. The hand moves to her back, slid-\r\n          ing down. She leans back, pinning his arm against the\r\n          seat.\r\n          The car stops at a light and Drew is instantly on Kelly,\r\n          biting her neck and kissing her hard on the mouth. She\r\n          pushes him back.\r\n\r\n                         KELLY\r\n\r\n                         (ANGRY)\r\n          I thought we were late.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         32 CONTINUED: 32\r\n\r\n                         DREW\r\n          We'll get there... eventually.\r\n\r\n                         KELLY\r\n          Really?\r\n          Drew HONKS the HORN at another driver.\r\n\r\n                         DREW\r\n          Hell, you should be glad. A lot\r\n          of girls would love to have\r\n          someone steady like me.\r\n          His irrepressible right hand starts up her leg.\r\n\r\n                         KELLY\r\n\r\n                         (MOCK-SWEETLY)\r\n          Steady? You mean persistent,\r\n          don't you, darling?\r\n          Grabbing his hand, she holds it firmly in her lap,\r\n          which doesn't bother Drew at all.\r\n\r\n          33 INT. HALL - DAY\r\n\r\n          Jude Cunningham is leaving her house when the TELE-\r\n          PHONE RINGS. The chubby, brown-haired girl rushes\r\n          back into the hallway.\r\n          A plump, middle-aged woman hurries out of the kitchen,\r\n          wiping her hands on an apron. MRS. CUNNINGHAM\r\n          eagerly watches her daughter snap up the receiver.\r\n          The pause, the HEAVY BREATHING and the strange,\r\n          terrifying voice.\r\n\r\n                         TELEPHONE VOICE\r\n          J-Jude? T-t-tonight it's my-my\r\n          t-t-turn!\r\n          A disappointed Jude slowly replaces the receiver. Mrs.\r\n          Cunningham looks on sympathetically.\r\n          Still no date?\r\n\r\n                         JUDE\r\n          (shakes her head)\r\n          Getting closer, though.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          26.\r\n\r\n                         33 CONTINUED: 33\r\n\r\n           MRS. CUNNINGHAM\r\n           A boy?\r\n\r\n                         JUDE\r\n\r\n                         (SMILES)\r\n          An obscene call... and not very\r\n          obscene at that!\r\n          Mrs. Cunningham starts to say something.\r\n\r\n                         JUDE\r\n\r\n                         (CONTINUING)\r\n          Sorry, Mom, gotta run.\r\n          Giving her mother a quick peck on the cheek, Jude\r\n          exits.\r\n\r\n          34 EXT. CUNNINGHAM'S HOUSE - DAY\r\n\r\n          The small house appears almost identical to the other\r\n          dwellings in this lower-middle-class neighborhood. Jude\r\n          pulls an apple from her large purse, munching while\r\n          she walks to the bus stop.\r\n          A gaudily-painted van pulls up alongside her. The win-\r\n          dow slowly rolls down and a young curly-haired GUY\r\n          wearing glasses sticks out his head.\r\n\r\n                         GUY\r\n          Hey, beautiful, need a lift?\r\n          Jude continues walking, the van moving slowly alongside\r\n          her.\r\n\r\n                         JUDE\r\n          No thanks.\r\n\r\n                         GUY\r\n          C'mon, I won't bite.\r\n          Jude chomps down hard on her apple.\r\n\r\n                         JUDE\r\n          So who are you?\r\n          TheGuy leans further out the window.\r\n\r\n                         GUY\r\n          Seymour Stone but..\r\n          He's cut short as the van bounces up onto the sidewalk.\r\n          Jude shrieks. The flustered boy steers the van quickly\r\n          back onto the road.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          27.\r\n\r\n                         34 CONTINUED: 27\r\n\r\n                         GUY\r\n\r\n                         (CONTINUING)\r\n          but they call me Slick!\r\n          Jude laughs, almost choking on her apple.\r\n\r\n                         JUDE\r\n          I can see why... How old are you,\r\n          Slick?\r\n\r\n                         GUY (SLICK)\r\n          Old enough...\r\n\r\n                         JUDE\r\n          I've heard about guys like you...\r\n          running over girls on the sidewalk...\r\n\r\n                         SLICK\r\n          Just some girls... If they're good\r\n          lookin' I give 'em a ride.\r\n\r\n                         JUDE\r\n\r\n                         (SMILING)\r\n          Can you stop that thing?\r\n          Slick jams on the brakes. The van jerks to a halt.\r\n          He opens the passenger door.\r\n\r\n                         JUDE\r\n\r\n                         (CONTINUING)\r\n          I'm going straight to Winston High,\r\n          understand?\r\n\r\n                         SLICK\r\n\r\n                         (NODS)\r\n          Straight to Winston.\r\n          She climbs inside.\r\n\r\n          35 INT. VAN (MOVING- DAY 35\r\n\r\n          The interior is decked out in plush red carpet with a\r\n          bed in back, a stereo cassette deck, and a small fridge.\r\n          MUSIC is PLAYING. Jude looks around.\r\n\r\n                         JUDE\r\n          Looks like a cheap motel.\r\n\r\n                         SLICK\r\n          Cheap?... that's a two hundred\r\n          dollar waterbed there...\r\n          Jude turns around for a look.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         35 CONTINUED: 35\r\n\r\n                         SLICK\r\n\r\n                         (CONTINUING)\r\n          Hand me that history book.\r\n\r\n                         JUDE\r\n          You think this is the time to study?\r\n          She grabs the book, gives it to him. He places it on\r\n          the fold-down table between them, flips it open. The\r\n          inside is hollowed out into a container. It contains\r\n          nearly a hundred neatly rolled joints.\r\n\r\n                         SLICK\r\n          Straight to Winston High?\r\n\r\n          36 EXT. SCHOOL PARKING LOT DAY\r\n\r\n          The van weaves through the parked cars, passing up\r\n          several vacant spots. It finally SCREECHES to a halt\r\n          at the far end of the lot near some high bluffs over-\r\n          looking a lake.\r\n\r\n          37 INT. VAN\r\n\r\n          The air is thick with smoke.\r\n\r\n                         JUDE\r\n\r\n                         (COUGHING)\r\n          How old are you, really?\r\n\r\n                         SLICK\r\n          You won't believe it...\r\n\r\n                         (PAUSES FOR\r\n\r\n                         DRAMATIC EFFECT)\r\n          Sixteen!\r\n\r\n                         JUDE\r\n\r\n                         (CONSIDERING\r\n          I believe it.\r\n          They both break up giggling.\r\n\r\n                         SLICK\r\n          You going to the prom tonight?\r\n          Jude looks away, embarrassed.\r\n\r\n                         JUDE\r\n          Sure, of course.\r\n\r\n                         SLICK\r\n\r\n                         (GLUMLY)\r\n          Not me. My date got sick.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          LV.\r\n\r\n                         37 CONTINUED: 37\r\n\r\n                         JUDE\r\n\r\n                         (BRIGHTENING)\r\n          Yeah? Well, as a matter of fact..\r\n\r\n                         (THINKING FURIOUSLY)\r\n          My date is uh, not that certain...\r\n          Something might be happening, he's\r\n          not sure, you know?\r\n\r\n                         SLICK\r\n\r\n                         (NODDING SOLEMNLY)\r\n          Yeah, right...\r\n          Jude watches him. He's slow picking up her hint.\r\n\r\n                         JUDE\r\n          So I guess we're both maybe not\r\n          going...\r\n\r\n                         SLICK\r\n          Yeah... too bad...\r\n          He looks at her.\r\n\r\n                         SLICK\r\n\r\n                         (CONTINUING)\r\n          Hey, you think...\r\n\r\n                         JUDE\r\n          I'd love to!\r\n          She kisses him on the cheek.\r\n\r\n                         JUDE\r\n\r\n                         (CONTINUING)\r\n          See you at eight, same spot!\r\n          She exits, hurrying across the parking lot as he grins\r\n          foolishly after her. Suddenly, it dawns on him.\r\n\r\n                         SLICK\r\n\r\n                         (CALLS OUT)\r\n          What's your name?\r\n\r\n          38 INT. APARTMENT LIVING ROOM - DAY 38\r\n\r\n          A tall rugged-looking man wearing a police uniform\r\n          stands in ,the center of the room checking over his\r\n          revolver. He's DARRYL McBRIDE, forty-eight years old\r\n          and a veteran Sergeant on the Police Force. Satisfied\r\n          with the condition of the gun, he jams it back into its\r\n          holster, turns, calls out.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          30.\r\n\r\n                         38 CONTINUED:\r\n\r\n                         MCBRIDE\r\n          Let's go, son!\r\n          A handsome dark-haired boy of eighteen emerges from a\r\n          back room. He's Nick McBride. His father pulls open\r\n          the front door.\r\n\r\n                         MCBRIDE\r\n\r\n                         (CONTINUING)\r\n          For a guy who moves so fast around\r\n          a disco floor, you are the slowest\r\n          goddamn thing...\r\n          Nick nods sleepily, yawns.\r\n\r\n                         NICK\r\n          Right, I know...\r\n          McBride steps out into the hallway. Nick grabs his\r\n          books and follows. The TELEPHONE RINGS. Nick hesi-\r\n          tates. Shaking his head he exits, shutting the door.\r\n\r\n          39 INT. CORRIDOR - DAY\r\n\r\n          The TELEPHONE keeps RINGING. McBride looks at his son.\r\n\r\n                         MCBRIDE\r\n          Why didn't you answer i\r\n\r\n                         NICK\r\n          It's just Wendy. She's pissed off.\r\n          She wants me to take her to the\r\n          prom tonight.\r\n\r\n                         MCBRIDE\r\n          I thought you two broke up.\r\n          The TELEPHONE continues to RING.\r\n\r\n                         NICK\r\n          Three months ago... you can't tell\r\n          Wendy anything she doesn't want to\r\n          hear.\r\n\r\n                         MCBRIDE\r\n          Aren't you going with the Hammond\r\n          girl? The principal's daughter?\r\n\r\n                         NICK\r\n\r\n                         (SMILES)\r\n          Kim.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         39 CONTINUED; 39\r\n\r\n                         MCBRIDE\r\n          God, I wish I had your women\r\n          problems.\r\n          They walk down the corridor as the TELEPHONE continues\r\n          to RING.\r\n\r\n          40 INT. SCHOOL SHOP - DAY 40\r\n\r\n          Alex is alone in the large room. ROCK MUSIC BOOMS out\r\n          of two huge SPEAKERS suspended from the ceiling. Alex\r\n          sits behind a console, flipping switches and turning\r\n          dials, electronically distorting the music.\r\n          A wall TELEPHONE RINGS.. Caught up in his own manufac-\r\n          tured sounds, Alex ignores it. After several more\r\n          RINGS, he reluctantly leaves the console and answers\r\n          the phone.\r\n\r\n                         ALEX\r\n          Hello... what?...\r\n          He listens, expressionless, then hangs up. He flips\r\n          a switch on the console and the MUSIC STOPS. He sits\r\n          there a moment, thinking. Then he turns out the lights\r\n          and exits.\r\n\r\n          41 INT. SCHOOL CORRIDOR - DAY 41\r\n\r\n          Kim walks down the long deserted corridor. She hears\r\n          FOOTSTEPS. She turns. No one. Shaking her head, she\r\n          continues walking.\r\n          The FOOTSTEPS return, louder. Kim begins to hurry.\r\n          She rounds a corner and slips against the wall, waiting.\r\n          Silence. With a deep breath, she moves on to her\r\n          locker.\r\n          Kim quickly twists the dial on the combination lock and\r\n          yanks open the door. Grabbing several books she slams\r\n          the door shut.\r\n          A mop HANDLE CRASHES into the locker, missing her head\r\n          by inches. The SHARP REPORT echoes down the corridor.\r\n          Terrified, Kim jumps back, spins around. Sykes is\r\n          standing there.\r\n\r\n                         SYKES\r\n          S-s-sorry, Missy. You hurt?\r\n          Her heart pounding wildly, Kim rushes into the gym.\r\n          Sykes picks up his mop.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         32-\r\n\r\n          42, INT. DAY 42\r\n\r\n          Kim runs into the huge deserted gym, glancing frantical-\r\n          ly over her shoulder. Her FOOTSTEPS CLATTER across the\r\n          hardwood floor. She stops, waits to recover her breath.\r\n          The room glows tgith a crystalline light sparkling off\r\n          the silver decorations put up for the Prom. Stretched\r\n          across the bleachers is a banner reading: \"DISCO\r\n\r\n          MADNESS.\"\r\n          Gazing around, Kim feels the excitement of anticipation.\r\n          Imagining herself in Nick's arms, she begins to dance,\r\n          whirling through the gym to the music in her head.\r\n          Suddenly, someone is clapping, slowly.\r\n\r\n          WENDY (O.S.)\r\n          Bravo...\r\n          Kim stops abruptly. Standing onstage, watching her, is\r\n          Wendy.\r\n\r\n                         WENDY\r\n\r\n                         (CONTINUING)\r\n          Practicing for tonight?\r\n\r\n                         KIM\r\n          Yes, as a matter of fact... I was\r\n          just...\r\n\r\n                         WENDY\r\n          Thinking about Nick, maybe?\r\n\r\n                         KIM\r\n          That's my business.\r\n\r\n                         WENDY\r\n          You wish! Nick is King of the\r\n          Prom, you happen to be Queen of\r\n          the Prom... that's all there is to\r\n          it, Hammond... As far as anything\r\n          else... Nick is mine...\r\n\r\n                         KIM\r\n          You really ought to tell him that.\r\n\r\n                         WENDY\r\n          I'm telling you, okay? Stay away\r\n          from Nick!\r\n\r\n                         KIM\r\n          You and Nick haven't been together\r\n          in ages.\r\n\r\n                         WENDY\r\n          You know nothing about it!\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         _J _J\r\n\r\n                         42 CONTINUED: 42\r\n\r\n                         KIM\r\n          Really? So who are you going with\r\n          tonight?\r\n\r\n                         WENDY\r\n          It's not who you go with, honey...\r\n          it's who takes you home.\r\n\r\n                         KIM\r\n          I'll try and remember that.\r\n\r\n                         WENDY\r\n          Wait and see, bitch... Just wait\r\n          and see...\r\n\r\n          43 INT. HALLWAY - DAY 43\r\n\r\n          The corridor is packed with students -- flirting,\r\n          gossiping, fighting, a few even studying. We PICK UP\r\n          Kim and VICKI CANTRELL, eighteen, moving down the crowd-\r\n          ed hallway through the various conversations.\r\n\r\n                         KIM\r\n          : So then she threatened me.\r\n\r\n                          VICKI\r\n          Wendy's a jerk!\r\n\r\n           FIRST MALE (V.0.)\r\n          She didn't!\r\n\r\n           SECOND MALE (V.0.)\r\n          Swear to God!\r\n\r\n           FIRST MALE (V.0.)\r\n\r\n                          (INCREDULOUS)\r\n          In the teachers' lounge?\r\n\r\n                         OTHER VOICES\r\n          Dual headers... thinks he's a\r\n          fox... Dust'll run you... long and\r\n          slinky and tight... swings like my\r\n          mother... how much for half a lid?\r\n          Jude joins Kim and Vicki as they walk.\r\n\r\n                         JUDE\r\n          guys.\r\n\r\n                         KIM\r\n          Jude.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          34.\r\n\r\n                         43 CONTINUED: 43\r\n\r\n                         VICKI\r\n          Missed you on the bus today.\r\n\r\n                         JUDE\r\n          I didn't ride it.\r\n\r\n                         VICKI\r\n          I thought you were too big to hide.\r\n\r\n                         KIM\r\n\r\n                         (CHIDING)\r\n          Vicki...\r\n\r\n                         JUDE\r\n\r\n                         (IGNORING VICKI)\r\n          I got a ride.\r\n\r\n                         VICKI\r\n          Who with?\r\n\r\n                         KIM\r\n          None of your business.\r\n\r\n                         JUDE\r\n\r\n                         (BLASE)\r\n          A guy.\r\n          Vicki and Kim are left hanging, waiting for more.\r\n\r\n                         VICKI\r\n\r\n                         (FINALLY)\r\n          Jude!\r\n          Jude can hold it back no longer.\r\n\r\n                         JUDE\r\n\r\n                         (EXPLODES)\r\n          I'm going to the prom!\r\n          Kim. and Vicki excitedly hug Jude. A big, bushy-haired\r\n          youth with a stubble of beard strolls by, smirking when\r\n          he sees the girls embracing. LOU PERANO, a twenty-year-\r\n          old high school junior, stops and stares.\r\n\r\n                         LOU\r\n          I knew there was some reason Kim\r\n          wouldn't go out with me. She likes\r\n          girls!\r\n          The girls separate.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         43 CONTINUED: (2) 43\r\n\r\n                         VICKI\r\n          Say goodbye, Lou.\r\n\r\n                         KIM\r\n          (to Vicki and Jude)\r\n          Let's go.\r\n          They head down the hallway to their lockers. Lou tags\r\n          along.\r\n\r\n                         LOU\r\n          You girls get bored with each\r\n          other, I'm always around, you know?\r\n          They pass Kelly and Drew huddled at her locker. His\r\n          hands rest on her shoulders. They are talking intently.\r\n\r\n                         VICKI\r\n          Poor girl must be exhausted. Look\r\n          how he has to hold her up...\r\n          (sees Nick approaching\r\n\r\n                         WITH WENDY)\r\n          Uh oh.\r\n          Kim stops suddenly and turns to look. Lou bumps into\r\n          her, his hand purposely grazing her rear.\r\n\r\n                         KIM\r\n          Go play with yourself, Lou.\r\n\r\n                         LOU\r\n          I'm saving it for you.\r\n          Kim sighs with disgust and turns around as Nick walks\r\n          up talking to Wendy.\r\n\r\n                         NICK\r\n          Wendy, for Christ sake, I never...\r\n\r\n                         (SEES KIM)\r\n          Kim!\r\n\r\n                         KIM\r\n\r\n                         (IGNORING WENDY)\r\n          Hello, Nick.\r\n          Seeing Kim, Wendy quickly reaches up and kisses Nick on\r\n          the mouth.\r\n\r\n                         WENDY\r\n          We'll talk about it later, lover.\r\n          Bye.\r\n          Wendy smiles and strolls away. Lou follows her.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          36.\r\n\r\n          43. CONTINUED: (3) 43\r\n\r\n                         NICK\r\n\r\n                         (EMBARRASSED)\r\n          I told her to leave me alone.\r\n\r\n                         KIM\r\n\r\n                         (NODS)\r\n          Worked real well.\r\n          The BELL RINGS signalling first period class. Kim\r\n          turns to Vicki and Jude.\r\n\r\n                         KIM\r\n\r\n                         (CONTINUING)\r\n          We'd better go.\r\n          Kim brushes past Nick without a word. The two girls ex-\r\n          change puzzled glances and follow her.\r\n\r\n                         NICK\r\n\r\n                         (WORRIED)\r\n          Kim?\r\n          Kim does not turn back. Walking next to her, Vicki\r\n          watches her friend curiously. Kim giggles. A sneaky\r\n          smile creeps across her face.\r\n\r\n                         JUDE\r\n\r\n                         (GRINNING)\r\n          That's cruel!\r\n\r\n                         KIM\r\n          Shhh!\r\n\r\n                         VICKI\r\n          Oh no you don't...\r\n          (turns back and\r\n          calls to Nick)\r\n          She's smiling, Nick. Big grin\r\n          spread all over her face.\r\n          Kim punches her friend but the damage is done. Nick\r\n          grins broadly. Blushing, Kim turns back, flashes him a\r\n          quick smile and disappears around a corner to the hoots\r\n          of Vicki and Jude.\r\n\r\n          44 INT. CORRIDOR - DAY 44\r\n\r\n          A tall dark figure walks quickly down a concrete cor-\r\n          ridor. From somewhere nearby, loud VOICES, SPLASHING\r\n          water, can be HEARD.\r\n\r\n          45 INT. POOL GALLERY 45\r\n\r\n          A shadow moves behind the opaque glass plate of a heavy\r\n          door.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         45 CONTINUED: 45\r\n          The door edges open. Raymond Hammond appears. Prop-\r\n          ping the door open with his shoulder, he starts down\r\n          across the narrow gallery to the pool below.\r\n\r\n          46 INT. POOL 46\r\n\r\n          A class of senior male students occupies the water,\r\n          among them Nick McBride and Drew Shinnick. With no\r\n          Phys. Ed. instructor in sight, it's a general goof-off\r\n          period.\r\n          Nick walks out onto the diving board. Drew is treading\r\n          water below him.\r\n\r\n          47 ANGLE ON HAMMOND 47\r\n          as he watches Nick intently from the gallery door.\r\n\r\n          48 INT. POOL 48\r\n\r\n          Nick launches himself out over Drew in an apparent\r\n          belly-flop. At the last moment, he tucks in and hits\r\n          the water in a flipped over cannonball. He surfaces to\r\n          a chorus of whistles and cheers. It was a close shave.\r\n\r\n                         DREW\r\n          You wanta take care of yourself,\r\n          man... Kim's expecting a lot from\r\n          you tonight...\r\n          Nick laughs.\r\n\r\n          49 INT. GALLERY DOOR 49\r\n\r\n          The door is easing shut. Hammond is nowhere to be seen.\r\n\r\n          50 INT. GYM - DAY 50\r\n\r\n          A side door opens. Hammond steps in, gazes around.\r\n          The gym is empty, silent. He walks to the stage steps,\r\n          climbs up, pushes through the thick curtain.\r\n\r\n          51 INT. GYM - BACKSTAGE 51\r\n\r\n          It's a dark cluttered area broken up by tall partitions,\r\n          discarded flats from old student productions, banks of\r\n          lights.\r\n          Hammond crosses to a rear door, tries it. It's locked.\r\n          He turns back. As he does so there's a sudden WHIRRING\r\n          SOUND. A row of spotlights flashes on right in front\r\n          of him, almost blinding him. He tries to shield his\r\n          eyes.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          38.\r\n\r\n                         51 CONTINUED: 51\r\n          He spins around. Another bank of lights flares at\r\n          him. He staggers downstage. The curtains begin to\r\n          swing open. Startled, he jumps away from them. His\r\n          foot lands on a package of photo-flood bulbs.. There's\r\n          a LOUD POP. Then a VOICE.\r\n\r\n          ALEX (O.S.)\r\n          Who's there?\r\n          Hammond, shaken, looks across to the far wing. There's\r\n          an elevated platform where the electronic control panel\r\n          is located. Alex peers down.\r\n\r\n                         HAMMOND\r\n          Alex?... What the hell're you\r\n          doing?\r\n\r\n                         ALEX\r\n          I'm testing the board... I didn't\r\n          hear you... nobody's supposed to\r\n          be here yet...\r\n\r\n                         HAMMOND\r\n          No, well'...\r\n          He looks around. He's still trying to get himself\r\n          together.\r\n\r\n                         HAMMOND\r\n\r\n                         (CONTINUING)\r\n          I'm.. I'm thinking we might have\r\n          a fire hazzard here, all these\r\n          extra lights.\r\n          He looks awkward, as if he'd been caught at something.\r\n          H.A1 ll4OND\r\n\r\n                         (CONTINUING)\r\n          all right...\r\n          He turns, climbs down the stage steps and starts back\r\n          across the gym. At the other end of the floor a door\r\n          opens, Sykes looks in. Hammond sees him.\r\n\r\n          HA, MOND\r\n\r\n                         (CONTINUING)\r\n          Ah... Mr. Sykes...\r\n          Sykes waits as Hammond hurries across to him. The two\r\n          men go out together.\r\n          Alex walks out onto the stage, watches them go.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          39.\r\n\r\n          52 INT. CLASSROOM (LAB) - DAY 52\r\n\r\n          First period biology class features MONTY WELLER, a\r\n          tall, thin Englishman in his late thirties. This stuf-\r\n          fy, dour science teacher drones on about the joys of ex-\r\n          ploring frog vertebrae while most of his class naps,\r\n          daydreams or passes notes.\r\n          Seated in the back near the door, Jude is furtively\r\n          opening a handwritten note. She quickly reads it.\r\n          Stifling a giggle, she looks up to see Kim and Vicki\r\n          across the aisle, eagerly awaiting her reply. Jude\r\n          tears out part of a page from her biology book and\r\n          scrawls her answer. Folding the note, she taps the boy\r\n          next to her and motions for him to pass it on.\r\n          Vicki grabs the note from the boy. Quickly scanning\r\n          it, she nods, impressed. Kim reads it and mouths the\r\n          word \"Wow\" to Jude who blushes happily.\r\n          Glancing out into the hallway, Jude notices Slick walk-\r\n          ing past. Seeing her in class, he stops and waves.\r\n          Jude frantically tries to motion him away. Their backs\r\n          to the door, Kim and Vicki watch with curiosity as Jude\r\n          gestures in their direction. Seeing her friends\r\n          watching her, Jude smiles and tries to ignore Slick.\r\n          Not to be denied, he exaggeratedly mimes Weller, nose\r\n          to his textbook, lecturing on, oblivious to his class.\r\n          Jude laughs in spite of herself. Kim and Vicki turn\r\n          around.\r\n          Glancing out the door, the two girls stare in disbelief\r\n          at the small weird curly-haired boy doing a perfect im-\r\n          itation of the eminently boring Weller. Their surprise\r\n          turns to hilarity as they realize this boy must be\r\n          Jude's prom date. Kim holds up the note, raising her\r\n          eyebrows as she gestures toward Slick. Jude nods. Kim\r\n          and Vicki can barely contain their laughter. They do\r\n          not notice Mr. Weller eyeing them suspiciously as he\r\n          rattles on about frog intestines. Slick mouths the\r\n          words, \"See you at lunch.., in the van.\" Jude nods and\r\n          smiles.\r\n          With a final bow and a wave, he exits.\r\n          Kim suddenly looks up to find a red-faced Mr. Weller\r\n          looming above her.\r\n\r\n                         WELLER\r\n          Miss Hammond!\r\n          Wide-eyed, Kim desperately tries to crush the note in\r\n          her hand.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         52 CONTINUED: 52\r\n\r\n                         WELLER\r\n\r\n                         (CONTINUING)\r\n          Since you obviously find your own\r\n          words more interesting than those\r\n          of Farnsworth on the anatomy of a\r\n          frog...\r\n          (pauses to share his\r\n          wit with the class)\r\n          , read the note!\r\n\r\n                         KIM\r\n          (barely a whisper)\r\n          Read the note?\r\n\r\n                         WELLER\r\n\r\n                         (STERNLY)\r\n          Now, Miss Hammond!\r\n          Kim swallows and steals a quick glance at her friends.\r\n          Vicki winces. Jude tries to disappear beneath her, seat.\r\n\r\n                         KIM\r\n          Yessir...\r\n          (clears her throat)\r\n          Well, it's mostly talking\r\n          about...\r\n\r\n                         WELLER\r\n\r\n                         (INTERRUPTS)\r\n          Word for word, please. Exactly\r\n          as it is written.\r\n\r\n                         KIM\r\n\r\n                         (NODS)\r\n          Right..\r\n          (coughs and finally\r\n          begins, slowly, in a\r\n\r\n                         STILTED MANNER)\r\n          What a hunk!\r\n          Titters from the class.\r\n\r\n                         KIM\r\n\r\n                         (CONTINUING)\r\n          Really cute... Tall... a great\r\n\r\n                         BODY\r\n          The class roars with laughter.\r\n\r\n                         KIM\r\n\r\n                         (CONTINUING)\r\n          Kinda the Latin lover type.\r\n\r\n                         (MORE)\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         41-\r\n\r\n                         52 CONTINUED (2) 52\r\n\r\n           KIM (CONS'' D)\r\n          (reading ahead,\r\n\r\n                         KIM GIGGLES)\r\n          and his name is Slick!\r\n          The classroom erupts into laughter as the BELL RINGS,\r\n          signaling the end of the class. Still laughing, stu-\r\n          dents gather their books and shuffle out, several giv-\r\n          ing Kim sympathetic glances as they pass.\r\n\r\n                         WELLER\r\n          After school, Miss Hammond. One\r\n          hour detention study hall... you\r\n          and your friends!\r\n          Kim looks from Jude to Vicki.\r\n\r\n                         KIM\r\n          But, Mr. Weller, tonight's the\r\n          prom...\r\n\r\n                         WELLER\r\n\r\n                         (DISDAINFULLY)\r\n          Tell that to your...\r\n\r\n                         (SNIFFS)\r\n          hunk!\r\n          He spins on his heel and marches back to his desk. The\r\n          three girls hurriedly exit.\r\n\r\n          53 INT. ROOM (SCHOOL) - DAY 53\r\n\r\n          A hand is flipping through the pages of the Winston\r\n          High yearbook, the back pages where the individual\r\n          photographs of graduating students are placed. The\r\n          hand stops, moves across an open page to a smiling head\r\n          shot of Nick McBride.\r\n          The hand rips the picture from the page, sets it down\r\n          on a plain wooden desk alongside three other pictures\r\n          -with similar torn edges. The other pictures are of\r\n          Jude Cunningham, Kelly Lynch, and Wendy Richards.\r\n          The yearbook is slammed shut.\r\n\r\n          54 INT. CAFETERIA - DAY 54\r\n\r\n          Kim, Jude and Vicki enter the crowded room. MUSIC from\r\n          several portable RADIOS can be HEARD above the clamor\r\n          as the girls move into the long lunch line. Kim spots\r\n          Alex seated nearby and waves to him.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          4L.\r\n\r\n                         54 CONTINUED: 54\r\n\r\n                         VICKI\r\n\r\n                         (NUDGING JUDE)\r\n          Here comes the incredible hunk\r\n          himself.\r\n          Jude looks up to see Slick slowly making his way down\r\n          the line towards them. He is carrying a tray piled\r\n          high with snack food: potato chips, cookies, candy.\r\n          Jude smiles as he passes her, grinning.\r\n\r\n                         KIM\r\n          Looks like a party.\r\n\r\n                         JUDE\r\n          Yeah -- I don't think he's gonna\r\n          be too good for my diet...\r\n          Slick moves down the lunch line. Suddenly he is bumped\r\n          from behind, sending the tray and the snacks flying\r\n          across the room. Looking around, Slick jumps back,\r\n          startled by a tall figure wearing a dark ski mask.\r\n\r\n                         SLICK\r\n\r\n                         (ANGRILY)\r\n          Hey, clown, what the...\r\n          Three of Lou's gang quickly step up behind the masked\r\n          figure.\r\n\r\n                         LOU\r\n          Say what?\r\n\r\n                         SLICK\r\n\r\n                         (SHRUGS)\r\n          Forget it, Lou.\r\n\r\n                         LOU\r\n\r\n                         (SMIRKS)\r\n          That's what I figured.\r\n          Slick bends over to pick up his lunch.\r\n\r\n                         SLICK\r\n\r\n                         (SOFTLY)\r\n          Asshole!\r\n          Lou and his friends shove ahead in the line until he is\r\n          standing behind Kim. Lou nuzzles Kim's neck.\r\n\r\n                         LOU\r\n          (muffled by the mask)\r\n          Like me better now?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          43.\r\n\r\n                         54 CONTINUED: (2) 54\r\n          Startled, Kim spins around. Her fear quickly becomes\r\n          anger.\r\n\r\n                         KIM\r\n          It's an improvement!\r\n          She turns her back to him.\r\n\r\n                         LOU\r\n          You like it so much...\r\n          (spins her around to\r\n\r\n                         FACE HIM)\r\n          Have a taste.\r\n          He kisses her hard on the mouth. Swinging at him, Kim\r\n          breaks away. Laughing, Lou grabs her wrists and rough-\r\n          ly pulls her to him. Alex instantly jumps to his feet.\r\n\r\n                         LOU\r\n\r\n                         (CONTINUING;\r\n          holding Kim close)\r\n          Be nice...\r\n          Alex leaps over the metal railing separating the line\r\n          from the tables. Crashing into Lou, he drives the\r\n          larger boy back into the salad counter, sending food\r\n          and utensils flying. As they tumble off the counter\r\n          onto the floor, Alex gets in several furious punches\r\n          before Lou's gang can pry him loose.\r\n          Two of the gang pin Alex against the counter. Wiping\r\n          blood from his mouth, Lou grins maliciously and slugs\r\n          Alex in the stomach. The boy groans and doubles over.\r\n          Lou grabs Alex's hair and slams his head back against\r\n          the glass shield of the counter.\r\n          As Lou rears back to throw another punch, his two\r\n          friends suddenly release Alex and scatter. The boy\r\n          crumples to the floor. Lou turns around to see two\r\n          MALE TEACHERS rapidly approaching. The larger teacher\r\n          grabs Lou.\r\n\r\n                         TEACHER\r\n          This time you're out, Perano.\r\n          Lou points to Alex who is being helped up from the\r\n          floor.\r\n\r\n                         LOU\r\n          He started i\r\n\r\n                         TEACHER\r\n          I'll bet... Alex?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         54 CONTINUED: (3) 54\r\n          Alex nods, leaning on the other teacher for support.\r\n\r\n                         KIM\r\n          That's not true! Alex was trying\r\n          to help me.\r\n          The teacher looks from Kim to Lou to Alex.\r\n\r\n                         TEACHER\r\n          You'd better come along to your\r\n          father's office.\r\n\r\n                         LOU\r\n\r\n                         (SNEERS)\r\n          Wonder who'll get off with just\r\n          a warning?\r\n          Several students laugh. The two Teachers march Lou and\r\n          Alex through the silent cafeteria. Lou swaggers bask-\r\n          ing in the attention. Alex walks with his head bowed.\r\n          They exit.\r\n\r\n          55 INT. HALLWAY - DAY 55\r\n\r\n          Lou and Alex accompany the teachers down the corridor\r\n          toward the principal's office. Nick and Wendy approach\r\n          from the opposite direction, talking heatedly.\r\n\r\n                         NICK\r\n          I don't care who. Just\r\n          somebody else!\r\n\r\n                         WENDY\r\n\r\n                         (BITTER)\r\n          You never had it so good as with\r\n          me.\r\n\r\n                         NICK\r\n          I've got it now... better!\r\n\r\n                         WENDY\r\n\r\n                         (ANGRILY)\r\n          You don't even know...\r\n          (spots Lou and\r\n\r\n                         CALLS OUT)\r\n          Lou!\r\n          The surprised Lou tries to stop but the Teachers hurry\r\n          him and Alex past the couple. Wendy watches Nick.\r\n\r\n                         LOU\r\n          (turning back to Wendy)\r\n          I got this appointment.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          45.\r\n\r\n                         55 CONTINUED: 55\r\n\r\n                         WENDY\r\n\r\n                         I'LL WAI\r\n          Wendy turns to see Nick's reaction but he is already\r\n          walking towards the cafeteria. The irate girl glares\r\n          after him.\r\n\r\n          56 INT. OFFICE - DAY 56\r\n\r\n          Hammond is talking on the telephone. He appears agi-\r\n          tated, running his fingers through his hair and tugging\r\n          at the knot in his loosened tie.\r\n\r\n                         HAMMOND\r\n\r\n                         (EXASPERATED)\r\n          No, Vi. I didn't forget.\r\n          I told you we'd go to the cemetery...\r\n          The door opens and Adele Cooper's head peers around the\r\n          corner. Seeing Hammond talking on the phone, she nods\r\n          toward the outer office. Hammond gestures for her to\r\n          wait. She persists until he angrily takes the receiver\r\n          from his ear and covers the mouthpiece.\r\n\r\n                         HAMMOND\r\n\r\n                         (CONTINUING)\r\n          What is it?\r\n\r\n                         ADELE\r\n\r\n                         (WHISPERING)\r\n          There are some gentlemen here to\r\n          see you, Mr. Hammond.\r\n\r\n                         HAMMOND\r\n          Can't it wait?\r\n\r\n                         ADELE\r\n          I didn't ask... But one looks\r\n          a little like that child in the\r\n          picture on your desk.\r\n          Hammond automatically glances at the photograph of\r\n          Robin framed alongside one of the rest of his family.\r\n\r\n                         HAMMOND\r\n          (into the receiver)\r\n          I've got to go now, Vi... We'll be\r\n          there within the hour...\r\n          There's a loud CLICK on the other end of the line.\r\n\r\n                         HAIIOND\r\n\r\n                         (CONTINUING)\r\n          Damn!\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          46.\r\n\r\n                         56 CONTINUED: 56\r\n          Frustrated, Hammond slams the receiver into its cradle.\r\n\r\n                         HAMMOND\r\n\r\n                         (CONTINUING)\r\n          All right, send them in.\r\n          The two Male Teachers enter first, followed by Lou and\r\n          finally Alex. Hammond gives his son a sharp look, then\r\n          turns to glare at Lou.\r\n\r\n                         HAMMOND\r\n\r\n                         (CONTINUING ;WEARILY)\r\n          You again?\r\n\r\n                         TEACHER\r\n\r\n                         (NODS)\r\n          Brawling in the cafeteria... both\r\n          of them.\r\n          He places Lou's ski mask on Hammond's desk. The prin-\r\n          cipal glances at it.\r\n\r\n                         HAMMOND\r\n\r\n                         (FINALLY)\r\n          Thank you. I'll handle it.\r\n          The Teachers exit.\r\n\r\n                         HAMMOND\r\n\r\n                         (CONTINUING)\r\n          Explanations?\r\n          He looks at Alex. The boy stares at the floor and says\r\n          nothing. Hammond holds the mask up to Lou.\r\n\r\n                         HAIIOND\r\n\r\n                         (CONTINUING)\r\n          Halloween?\r\n\r\n                         LOU\r\n          I was just foolin' around with\r\n          this girl...\r\n\r\n                         ALEX\r\n\r\n                          (INTERRUPTS)\r\n          Kim!\r\n          Hammond frowns.\r\n\r\n                          LOU\r\n          when this -- your son\r\n          tackled me and...\r\n\r\n                         HAMMOND\r\n\r\n                         (INTERRUPTS)\r\n          Is this true, Alex?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          47.\r\n\r\n                         56 CONTINUED: (2) 56\r\n\r\n                         LOU\r\n\r\n                         (SNIDE)\r\n          I knew It !\r\n          Hammond whirls on him.\r\n\r\n                         HAMMOND\r\n          You knew what?\r\n\r\n                         LOU\r\n          It just figures.\r\n\r\n                         HAIV MOND\r\n          (his voice rising\r\n\r\n                         WITH ANGER)\r\n          That I'll play favorites? That\r\n          I'll go easy on Alex because he's\r\n          my son?\r\n          (pauses, waiting for\r\n          Lou to back down and\r\n\r\n                         LOOK AWAY)\r\n          Damn right I will! You're a\r\n          disgrace to this school and this\r\n          community...\r\n\r\n                         (RECOVERS SOMEWHAT)\r\n          You're suspended --\r\n          indefinitely! Now get out!\r\n\r\n                         LOU\r\n\r\n                         (SNEERS)\r\n          What about your son?\r\n\r\n                         HAMMOND\r\n\r\n                         (ICILY)\r\n          If you're not off school grounds\r\n          in five minutes, I'll have you\r\n          arrested for trespassing.\r\n          Lou stalks to the door. Opening it, he turns to Alex.\r\n\r\n                         LOU\r\n          See you around.\r\n          He exits, slamming the door.\r\n\r\n                         HAMMOND\r\n\r\n                         (WITHOUT LOOKING\r\n\r\n                         AT ALEX)\r\n          Have the nurse take a look at you,\r\n          then get back here.\r\n          Alex exits. Hammond angrily grabs Lou's ski mask and\r\n          hurls it at the trash can_\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          48.\r\n\r\n          57 EXT. FRONT LAWN - DAY 57\r\n\r\n          Kim and Vicki are sprawled on the grass eating lunch.\r\n          Lou storms down the front steps. Pausing at the bottom,\r\n          he turns, strolls over to Kim.\r\n\r\n                         LOU\r\n          Watch for me, little girl. You\r\n          know I'm just a kiss away.\r\n          Lou laughs and walks off toward the parking lot. Kim\r\n          shudders.\r\n          Wendy's white Mustang slides up to the curb. The pass-\r\n          enger window rolls down and Lou leans over to look in-\r\n          side. After a moment he climbs in and the MUSTANG\r\n          PEELS out of the lot, leaving twin black tread marks in\r\n          its wake.\r\n\r\n                         KIM\r\n          What a pair!\r\n\r\n                         VICKI\r\n          Made for each other!\r\n          Kim opens a carton of yogurt.\r\n\r\n                         KIM\r\n          You wearing that green gown tonight?\r\n\r\n                         VICKI\r\n          You kidding? That was last year.\r\n          This year... red silk!\r\n          (smiles and runs her\r\n          hand from her neck\r\n          to her waist)\r\n          Cut to here! ...\r\n\r\n          NICK (O.S.)\r\n          Cut to where?\r\n          Kim and Vicki turn to see Nick ambling across the lawn\r\n          toward them.\r\n\r\n                         VICKI\r\n\r\n                         (MOCK-SEDUCTIVELY)\r\n          Anywhere you like...\r\n\r\n                         KIM\r\n\r\n                         (SMILING)\r\n          On the prowl!\r\n\r\n          58 EXT. STREET - DAY\r\n\r\n          Wendy's white Mustang streaks through traffic, dodging\r\n          in and out of lanes, running yellows, burning around\r\n          corners.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          59 INT. MUSTANG 59\r\n\r\n          Lou sits pinned to the passenger seat, eyes wide,\r\n          staring straight ahead as if he can't quite believe\r\n          this trip. His bravado seems to have left him. He\r\n          glances over at Wendy in the driver's seat. She's\r\n          puffing on a cigarette, handling the wheel almost\r\n          casually. She's in control,\r\n\r\n          60 EXT. DRIVE-IN 60\r\n\r\n          The Mustang suddenly slows down and makes a hard left\r\n          turn, narrowly beating a horn-honking oncoming van.\r\n          The big white car bounces up over the curb and sweeps\r\n          into the end slot at a sprawling fast-food drive-in.\r\n\r\n          61 INT. MUSTANG 61\r\n\r\n          Lou's still pinned to his seat. Wendy shuts off the\r\n          engine, looks at him. He looks at her, lets out a\r\n          long deep breath.\r\n          A cute little CAR-HOP in a cut-off costume and roller\r\n          skates glides over. She leans into Wendy's window,\r\n          talks through a wad of gum.\r\n\r\n                         CAR-HOP\r\n          Ready to order?\r\n\r\n                         WENDY\r\n\r\n                         (TO LOU)\r\n          What do you want?\r\n          Lou's shifting around in his seat, pulling himself\r\n          together.\r\n\r\n                         LOU\r\n          I'm uh... a little short on cash..\r\n\r\n                         WENDY\r\n          You can owe me.\r\n\r\n                         LOU\r\n          Yeah? Okay then, a couple of\r\n          burgers, a large fries... what\r\n          kind of beer you got?\r\n\r\n                         CAR- HOP\r\n          C'mon man, this is a drive-in not\r\n          a bar.\r\n\r\n                         LOU\r\n          All right, all right... don't get\r\n          nervous... Gimme a coke...\r\n\r\n                         (MORE)\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          50.\r\n\r\n                         61 CONTINUED:\r\n\r\n                          LOU (CONT'D)\r\n          (nods to Wendy)\r\n          She'll have the same.\r\n\r\n                         WENDY\r\n          A small diet cola.\r\n\r\n                         WENDY\r\n          That ' sit.\r\n          The Car-hop shrugs, wheels away. Wendy turns to Lou.\r\n\r\n                         WENDY\r\n          I'll buy you one for Christmas,\r\n          all right? Now, how do I know\r\n          you're serious?\r\n\r\n                         LOU\r\n          Whatta you mean, serious? I hate\r\n          that school, Hammond and his\r\n          asshole family...\r\n\r\n                         WENDY\r\n          I don't want anyone hurt... not\r\n          badly.\r\n\r\n                         LOU\r\n          You got it... anything your little\r\n          heart desires...\r\n\r\n                         WENDY\r\n          Lou, shouldn't we go over this.\r\n          Lou puts his finger to her mouth, silencing her.\r\n\r\n                         LOU\r\n          I'll take care of it, Scout's\r\n          honor... Don't worry about it...\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n          Di.\r\n\r\n                         61 CONTINUED: (2) 61\r\n          He caresses her cheek and lips, then kisses her. At\r\n          first reluctant, Wendy quickly takes over. When they\r\n          finally break from their passionate clinch, he is\r\n          gasping.\r\n\r\n                         LOU\r\n\r\n                         (CONTINUING)\r\n          Jesus Christ!\r\n\r\n                         WENDY\r\n          Don't worry about it..\r\n          She unbuttons his shirt and begins to kiss and lick his\r\n          chest. Slowly she works her way down. Lou begins to\r\n          writhe. Wendy's head disappears from VIEW. Lou's eyes\r\n          snap open in surprise.\r\n          Wendy groans.\r\n\r\n                         WEND Y\r\n          Damn stick shift!\r\n          Lou starts to protest, then dissolves.\r\n\r\n          62,. INT. MUSTANG - DAY 62\r\n\r\n          The Car-hop wheels up to the Mustang carrying a tray\r\n          loaded with food. She leans over and peers inside.\r\n          Wendy is behind the wheel, perfectly composed. A mind-\r\n          blown Lou is hurriedly doing up his belt, tucking in\r\n          his shirt. He glances at the Car-hop then turns away\r\n          to finish the job.\r\n\r\n                         CAR-HOP\r\n          Enjoy your meal.\r\n\r\n          63 EXT. LAKE-SIDE BLUFFS - DAY 63\r\n\r\n          A WIDE VIEW; high weather-worn bluffs tumbling down to\r\n          a strip of beach and the calm blue waters of the lake.\r\n          Above the bluffs there's a narrow shaded park and then\r\n          the buildings and parking lots of Winston High.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         63 CONTINUED:\r\n          Nick and Kim walk slowly along the rim of the bluffs.\r\n          Nick has his arm around her. She leans into him.\r\n\r\n                         KIM\r\n          I am excited, it's just... in some\r\n          ways it's such an awful day... It's\r\n          Robin's day...\r\n\r\n          64 EXT. BLUFFS CLOSER ANGLE 64\r\n\r\n\r\n                         KIM\r\n          My mother's all upset, as usual.\r\n          My father too... he doesn't show\r\n          it so much... It's hard to get\r\n          over something like that. Robin\r\n          would have been a junior, like\r\n          Alex. This would've been her first\r\n          prom... I guess that's'why it seems\r\n          so much worse this year...\r\n          She stops, turns and faces Nick. It's hard for him to\r\n          meet her gaze.\r\n\r\n                         KIM\r\n\r\n                         (CONTINUING)\r\n          The Queen of the Prom is determined\r\n          not to let it get to her... She\r\n          must maintain her... whatever, at all\r\n          costs..\r\n          She tries a weak smile. Nick stares at her, then sud-\r\n          denly takes her, pulls her to him, embraces her. She's\r\n          caught by surprise, but she responds.\r\n          She smiles.\r\n\r\n                         KIN\r\n          I love you too.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n          Di.\r\n\r\n                         64 CONTINUED: 64\r\n\r\n                         NICK\r\n          I'm... I want you to know that...\r\n          Robin's death... I remember it and\r\n          I've always been... so sorry\r\n          about it...\r\n          Kim looks puzzled.\r\n\r\n                         NICK\r\n\r\n                         (CONTINUING)\r\n          I mean... I know what you're\r\n          feeling... I've...\r\n          (looks at her)\r\n          :Listen I...\r\n          Across the school parking lot a CAR HORN BLARES, inter-\r\n          rupts Nick. Kim reacts.\r\n\r\n                         KIM\r\n          That's my father... I've got to go,\r\n          Okay?\r\n\r\n                         NICK\r\n          Yeah... I'll see you later.\r\n          She hesitates a moment, then kisses him quickly, turns\r\n          and goes. Nick looks shaken up. He stares after her\r\n          as she hurries away.\r\n          Behind Nick, in the other corner of the parking lot, a\r\n          metal door slides open, loud RAUNCHY ROCK and ROLL sud-\r\n          denly infests the air. Nick turns, sees Jude climbing\r\n          out of Slick's van. Jude looks about as stoned as she\r\n          can get. She spots Nick, waves.\r\n\r\n                         JUDE\r\n          Hey, Nick!\r\n          Nick turns and heads the other way.\r\n\r\n          65 EXT. CEMETERY - HAMMOND PLOT - DAY 65\r\n\r\n          There's a small marble headstone inset with the carved\r\n          face of an angel and the inscription \"Robin Anne Hammond\r\n          1964 - 1973 Too Soon Taken From Us.\"\r\n          Kneeling beside the grave is Vivian Hammond. She's ar-\r\n          ranging a large bouquet of mixed flowers, fussing with\r\n          them, trying for some kind of impossible perfection.\r\n\r\n          HP`ï¿½MOND (0. S.\r\n          We have to go, Vi.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          J4.\r\n\r\n                         65 CONTINUED: 65\r\n          She doesn't react, she keeps playing with the flowers.\r\n          Hammond moves in behind her, puts his hands on her\r\n          shoulders. She looks at him.\r\n\r\n                         HAMMOND\r\n\r\n                         (CONTINUING)\r\n          We have to get back.\r\n          She stands, with her husband's support. Kim and Alex\r\n          are standing quietly at the foot of the grave. Vivian\r\n          looks at them both. Her eyes hold a terrible rage, a\r\n          terrible sadness. Hammond carefully guides her away.\r\n          Kim has a flower of her own, a white rose, which she\r\n          drops on her sister's grave. She turns, meets Alex's\r\n          stare, moves off after her parents. Alex remains a mo-\r\n          ment longer, then. he, too, goes.\r\n\r\n          66 EXT. TENNIS COURTS DAY\r\n\r\n          During the afternoon phys. ed. class, the girls play\r\n          tennis: Kim with Kelly and Vicki with Jude. Sykes\r\n          lingers nearby, watching the girls. Their instructor\r\n          is Miss HENRI-ANNE BENTON, a stocky woman in her late\r\n          thirties with teased, lacquered hair. A product of\r\n          genteel Southern womanhood, Henri-Anne stalks the\r\n          courts in her baggy Bermuda shorts, constantly blowing\r\n          a silver whistle hanging from her neck.\r\n          A very stoned, giggling Jude runs Vicki ragged, hitting\r\n          balls over the fence, straight up in the air and occa-\r\n          sionally even back over her head. Each time a ball\r\n          flies over the fence, Vicki runs to retrieve it to the\r\n          delight of Sykes.\r\n          At one point, Vicki bends over to pick up a ball under\r\n          Sykes' appreciative gaze. The shrill WHISTLE inter-\r\n          rupts her as Henri-Anne rushes over.\r\n\r\n                         HENRI-ANNE\r\n\r\n                         (SOUTHERN ACCENT)\r\n          No, no, Miss Cantrell! Never bend\r\n          from the waist... Squat!\r\n\r\n                         (DEMONSTRATES)\r\n          Always squat to retrieve.\r\n          Otherwise, you look like the broad\r\n          side of a barn!\r\n          (glares at Sykes)\r\n          Isn't that so, Mr. Sykes?\r\n          Embarrassed, the custodian scuttles away to the girls'\r\n          Laughter.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         66 CONTINUED: 66\r\n\r\n                         HENRI-ANNE\r\n\r\n                         (CONTINUING)\r\n          That's enough for today, ladies.\r\n          We don't want you all worn out for\r\n          the ball tonight.\r\n          Kim, Jude and Kelly gather'around with the other girls.\r\n\r\n                         JUDE\r\n\r\n                         (GIGGLING)\r\n          Ball?\r\n\r\n                         KIM\r\n          Shhh!\r\n          Kelly takes Jude aside as Kim and Vicki approach Henri\r\n          Anne.\r\n\r\n                         KIM\r\n\r\n                         (CONTINUING;\r\n\r\n                         WHISPERS)\r\n          You sure she likes Weller?\r\n\r\n                         VICKI\r\n          Positive. I heard her say she's\r\n          had the hots for him since they\r\n          met!\r\n\r\n                         KIM\r\n          She said that?\r\n\r\n                         VICKI\r\n          Well, not exactly.\r\n\r\n                         HENRI-ANNE\r\n          Oh, Kim. You'll be in the gym\r\n          promptly at three-fifteen for\r\n          rehearsal?\r\n\r\n                         KIM\r\n          Well, actually no, Miss Benton.\r\n          can't make it... You know Mr.\r\n          Weller?\r\n\r\n                         HENRI-ANNE\r\n          We're... acquainted.\r\n\r\n                         KIM\r\n          He.. umm..\r\n\r\n                         VICKI\r\n\r\n                         (BLURTS OUT)\r\n          He's got a crush on Kim!\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          56.\r\n\r\n                         660 CONTINUED: (2) 66\r\n          Kim stares in amazement aL Vicki;\r\n\r\n                         HENRI --ANNE\r\n          (staring at Kim)\r\n          He has what?\r\n          Kim, wide-eyed, can only look at Vicki.\r\n\r\n                         VICKI\r\n          He keeps making Kim stay after\r\n          school in detention study hall for\r\n          no reason... Just so he can be\r\n          near her.\r\n\r\n                         HENRI-ANNE\r\n          That's horrible!\r\n          Kim gulps.\r\n\r\n                         HENRI-ANNE\r\n\r\n                         (CONTINUING)\r\n          You mean to tell me that awful man\r\n          A girl half his age!\r\n          (a very slight\r\n\r\n                         SMILE)\r\n          So you have detention this\r\n          afternoon?\r\n          Kim nods meekly. Lost in thought, Henri-Anne fondles a\r\n          tennis ball, a curious smile playing across her face.\r\n\r\n                         HENRI-ANNE\r\n\r\n                         (CONTINUING;\r\n\r\n                         FINALLY)\r\n          Leave everything to me...\r\n          She hurries away. Kim turns on Vicki and starts to\r\n          protest.\r\n\r\n                         VICKI\r\n\r\n                         (INTERRUPTING)\r\n          It worked, didn't it?\r\n\r\n          67 EXT. SCHOOL GROUNDS - DAY 67\r\n\r\n          Kim and Vicki, and behind them, Jude and Kelly are\r\n          walking back to the gym and the dressing rooms from the\r\n          tennis courts. Vicki's in high spirits and Jude still\r\n          can't stop giggling.\r\n          Vicki spots old Sykes heading out toward the playing\r\n          field. She calls out to him.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         57-\r\n\r\n                         67 CONTIPRJED 67\r\n\r\n                         VICKI\r\n          Mr. Sykes!\r\n\r\n                         KIM\r\n          Vicki, don't...\r\n\r\n                         VICKI\r\n          Oh, Mr. Sykes...\r\n          Sykes stops, turns around.\r\n\r\n                         VICKI\r\n\r\n                         (CONTINUING)\r\n          This is just for you...\r\n          She turns, bends over, quickly yanks down her shorts\r\n          and moons him. There's a squeal of laughter from Jude\r\n          and from Kelly. Vicki whips her shorts back up and\r\n          runs to the gym door, the other girls in pursuit.\r\n          Kim looks back at Sykes. He's just standing in the\r\n          field, not moving. There's a look in his eyes.\r\n\r\n          68 INT. GIRLS' LOCKER ROOM - DAY 68\r\n\r\n           Kim and Kelly are undressing. Three girls pass them\r\n          headin g for the showers.\r\n\r\n                         KELLY\r\n          I'm not like the others, Kim.\r\n          Drew needs somebody like Vicki\r\n          who'll give him what he wants.\r\n\r\n                         KIM\r\n\r\n                         (LAUGHS)\r\n          Vicki's sex life is more talk than\r\n          action. Besides, Drew wants you.\r\n\r\n                         KELLY\r\n          I'm afraid if I don't make it with\r\n          him he'll find somebody who will.\r\n\r\n                         KIM\r\n\r\n                         (SHRUGS)\r\n          Let him.\r\n\r\n                         KELLY\r\n          I'd die if he did...\r\n          The girls wrap towels around themselves and walk to-\r\n          wards the showers.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n          Sa .\r\n\r\n          69 INTT. SHIER AREA - DAY 69\r\n          A girl (MELANIE) is leaving as Kim and'Kelly enter.\r\n          Wendy is standing in front of a mirror drying her hair.\r\n          Kim ignores her and Wendy returns the compliment.\r\n\r\n                         MELANIE\r\n          See you outside, Wendy.\r\n\r\n                         WENDY\r\n          Just be a minute...\r\n          Kim and Kelly hang up their towels and step into the\r\n          showers.\r\n\r\n                         KELLY\r\n          What about you and Nick?\r\n\r\n                         KIM\r\n          What about us?\r\n          Wendy finishes brushing her hair, shoots Kim.a dark\r\n          look, exits.\r\n\r\n                         KELLY\r\n          What.happened when he asked you?\r\n          Kim smiles.\r\n\r\n                         KIM\r\n          Maybe I asked him...\r\n          Kelly looks at her friend.\r\n\r\n          70 INT. LOCKER ROOM - DAY 70\r\n\r\n          Wendy finishes buttoning her blouse. She's pulling on\r\n          her jeans when she hears a SCUFFLING SOUND.\r\n\r\n                         WENDY\r\n          I'll be right there, Melanie.\r\n          No answer. Curious, Wendy moves around the lockers,\r\n          investigating. The room appears empty.\r\n          There's a sudden LOUD CREAKING. Wendy whirls around.\r\n          A locker door is swinging slowly open.\r\n\r\n                         WENDY\r\n\r\n                         (CONTINUING)\r\n          Melanie?...\r\n          Still no answer. Shaking her head, Wendy returns to\r\n          her locker.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         70 CONTINUED: 70\r\n          She's about to shut it when she sees something, a pic-\r\n          ture, taped to the side of the door. It's her photo,\r\n          torn from the School Yearbook. She rips it from the\r\n          door, looks at it.\r\n\r\n                         WENDY\r\n\r\n                         (CONTINUING)\r\n          What's this for, Melanie?\r\n          Her voice echoes through the empty room. She gazes\r\n          around, fear creeping into her face. She quickly\r\n          finishes dressing, grabs her books, turns to leave.\r\n          Suddenly she screams.\r\n\r\n          71 INT. SHOWER AREA 71\r\n\r\n          Wendy's SCREAM is all but DROWNED OUT by the SHOWERS.\r\n          Rinsing off, Kim and Kelly hear nothing.\r\n\r\n                         KELLY\r\n          I think I'll let Drew do it.\r\n          The door to the locker roor slowly opens behind them.\r\n\r\n                         KIM\r\n          Let him?\r\n          She looks at Kelly. Neither girl hears the SQUISH of\r\n          RUBBER SOLES moving across the wet tile floor.\r\n          Suddenly there are LOUD VOICES. Melanie comes through\r\n          from the locker room, laughing. Behind her, Wendy's\r\n          ANGRY WORDS are AUDIBLE.\r\n\r\n          WENDY (O.S.)\r\n          If you ever try anything like that\r\n          again, you cow!\r\n          Melanie thinks it's hilarious.\r\n\r\n                         MELANIE\r\n          (to Kim and Kelly)\r\n          You should've seen her jump...\r\n          Nadia Comenici never did better...\r\n          Wendy storms in. She's got the photo in her hand. She\r\n          waves it at Kim and Kelly.\r\n\r\n                         WENDY\r\n          What's this supposed to mean?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n          vv.\r\n\r\n                         71 CONTINUED - 71\r\n\r\n                         KIM\r\n\r\n                         (SARCASTIC)\r\n          I know it's not much of a picture,\r\n          Wendy, but you didn't have to go\r\n          that far...\r\n          Wendy is furious.\r\n\r\n                         WENDY\r\n          I didn't!\r\n          She turns, glares at Melanie.\r\n\r\n                         MELANIE\r\n          Don't look at me...\r\n\r\n                         WENDY\r\n          You're all... children...\r\n          She storms out. Melanie looks at Kim and Kelly,\r\n          shrugs, follows Wendy. A DOOR SLAMS in the locker\r\n          room.\r\n          Kim and Kelly look at each other, laugh, turn their\r\n          faces back to the steaming water. Neither one hears\r\n          the SOUND across the room, a HARSH RHYTHMIC HEAVY\r\n\r\n          BREATHING.\r\n          Kelly bends her head away from the water, clears her\r\n          eyes., She squints out through the steam at the big\r\n          wall mirror across the room. She sees something. She\r\n          steps back into Kim, her eyes wide with fear.\r\n\r\n                         KIM\r\n          Watch it...\r\n          Kelly covers her breasts with her arms, presses against\r\n          the wall, terrified.\r\n          Suddenly there's an EXPLOSION of SOUND. Kim screams,\r\n          jumps back, stares. There's a jagged hole in the cen-\r\n          ter of the mirror, huge cracks radiating from it,\r\n          spidering across its surface.\r\n          For a moment no one moves. Splinters of GLASS TRICKLE\r\n          down to the floor. There's no other sound. Kim grabs\r\n          for her towel, steps out of the shower, looks. There's\r\n          no one. She heads for the locker room door. Kelly\r\n          runs after her.\r\n\r\n                         KELLY\r\n\r\n                         KIM 1\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          61.\r\n\r\n          72 INT. LOCKER ROOM 72\r\n\r\n          Kim rushes into the room, Kelly right behind her.\r\n          There's no one. Kelly is quivering. She clutches at\r\n          Kim's arm. Kim looks at her.\r\n\r\n                         KIM\r\n          What did you see?\r\n          Kelly just shakes her head.\r\n\r\n                         KELLY\r\n          Just... just... a shadow or.,.\r\n          Kim heads for the exit door across the room. Kelly\r\n          stays with her.\r\n\r\n          73 EXT. SCHOOL 73\r\n\r\n          Kim opens the outside door, peers down the walkway to\r\n          the tennis courts, playing fields. There's no sign of\r\n          anyone. She closes the door.\r\n\r\n          74 INT. LOCKER ROOM 74\r\n\r\n          Kim turns back.to Kelly who's started to cry.\r\n\r\n                         KELLY\r\n          Someone was there! Someone was...\r\n          in there...\r\n          Kim is taking charge. She moves cautiously back to the\r\n          shower room door, opens it, looks in. She gasps.\r\n\r\n                         KELLY\r\n\r\n                         (CONTINUING)\r\n          What? What!s wrong?\r\n          Kelly's on the edge of hysteria. She runs over to Kim.\r\n          They both look.\r\n\r\n          75 KIM'S AND KELLY'S POV 75\r\n          What the girls see is the mirror. Something has\r\n          changed. A long wedge of glass has been lifted out o\r\n          it.\r\n\r\n          76 BACK TO SCENE 76\r\n          Kim shuts the door, presses against it, stares at\r\n          Kelly.\r\n\r\n          77 INT. HALLWAY - DAY 77\r\n\r\n          Kim walks quickly down a long school corridor and turns\r\n          into her father's office.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          UL.\r\n\r\n          78 INT. OFFICE - DAY 78\r\n\r\n          Kim enters. Adele Cooper is seated behind the secre-\r\n          tary's desk thumbing through a fashion magazine.\r\n\r\n                         KIM\r\n          I'd like to see my f ather .\r\n\r\n                         ADELE\r\n          Another Hammond?\r\n\r\n                         KIM\r\n\r\n                         (AGITATED)\r\n          Is he here?\r\n\r\n                         ADELE\r\n          No, he's not. He said he'd be\r\n          back but...\r\n          She trails off. Kim is obviously upset.\r\n\r\n                         ADELE\r\n\r\n                         (CONTINUING)\r\n          What's urrong?\r\n\r\n                         KIM\r\n          Oh... There was... Somebody broke\r\n          a mirror in the shower room...\r\n          There was somebody in there...\r\n\r\n                         ADELE\r\n          A mirror? Seven years bad luck...\r\n          She tries to smile. Kim just looks at her.\r\n\r\n          79 INT. HALLWAY - DAY 79\r\n\r\n          Kim turns a corner, heading for class, and almost runs\r\n          into Sykes, cleaning the floor. Sykes turns. For a\r\n          moment their eyes lock. Then Kim hurries away, almost\r\n          running. Sykes stares after her.\r\n\r\n          80 INT. HALLWAY (WELLER'S CLASSROOM) - DAY 80\r\n\r\n           Kim comes down the hallway and stops at the door.\r\n           There's a piece of paper with a hastily scrawled mes-\r\n           sage taped there. It heads: \"Detention Postponed\r\n           Until Monday -- EMERGENCY! Weller.\"\r\n\r\n           VICKI (O.S.)\r\n          Did it work?\r\n          Kim is startled, turns. Vicki and Jude and approach-\r\n          ing. Vicki hurries to the door, reads the note.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n          ai.\r\n\r\n                         80 CONTINUED : 80\r\n\r\n                         VICKI\r\n\r\n                         (CONTINUING)\r\n          It worked!\r\n          She lets out a whoop, embraces Jude. Kim stands back,\r\n          somehow less impressed.\r\n\r\n          81 INT. GYM - DAY 81\r\n\r\n          Several students are putting last-minute touches on the\r\n          decor as Kim comes in. Huge speakers are being hoisted\r\n          on pulleys to hang from the ceiling. A vast, raised\r\n          platform covers much of the gym floor, its plexiglass\r\n          surface designed to be illuminated from below. Perched\r\n          on a ladder, Weller is hanging shimmering silver strips\r\n          while Henri-Anne Benton supervises from the disco\r\n          floor.\r\n\r\n                         HENRI-ANNE\r\n          Careful, Monty... A little\r\n          higher...\r\n          (sees Kim and\r\n\r\n                         SMILES)\r\n          I'm glad you could make it!\r\n\r\n                         KIM\r\n          Something came up...\r\n          (looks at Weller)\r\n          'Afternoon, Mr. Weller.\r\n\r\n                         WELLER\r\n\r\n                         (EMBARRASSED)\r\n          Oh, hello, Miss... Hammond. I was\r\n          just... uh...\r\n          Henri-Anne mercifully interrupts him.\r\n\r\n                         HENRI-ANNE\r\n          Let's get started.\r\n\r\n                         (CALLS OUT)\r\n          Nick!\r\n          Nick pokes his head out of the sound booth set on a\r\n          platform near the stage.\r\n\r\n                         HENRI-ANNE\r\n\r\n                         (CONTINUING)\r\n          Onstage! Tell Alex we're ready.\r\n          Alex emerges from the booth. DAVY MATLOCK, a pudgy,\r\n          fifteen-year-old sophomore and Alex's technical assis-\r\n          tant, leans out behind him.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         81\r\n\r\n                         81 CONTINUED:\r\n\r\n                         ALEX\r\n          All set, Miss Benton. Just have\r\n          Davy roll the tapes.\r\n\r\n                         HENRI -ANNE\r\n          Wonderful. You can be Mr. Hanunond\r\n          for the rehearsal!\r\n          Alex groans. Kim smiles as Nick joins her. She takes\r\n          his hand, clutches it. They start to walk away, talk-\r\n          ing quietly. Nick puts his arm around her.\r\n\r\n                         HENRI-ANNE\r\n\r\n                         (CONTINUING)\r\n          Nick! Kim! Come with me.\r\n          Henri-Anne bounds up onto the stage. Kim and Nick fol-\r\n          low her behind the curtain.\r\n\r\n          82 INT. GYM (BACKSTAGE) - DAY 82\r\n\r\n          Henri-Anne takes Kim to one of the wings of the dark\r\n          cluttered area.\r\n\r\n                         HENRI -ANNE\r\n          You'll wait here...\r\n          (looks around for\r\n\r\n                         NICK)\r\n          Nick?\r\n          Nick silently creeps from behind a partition and moves\r\n          up directly behind Henri-Anne. He mimes choking her, a\r\n          crazed expression on his face. Kim has to laugh at his\r\n          clowning.\r\n\r\n                         HENRI-ANNE\r\n\r\n                         CONTINUING; WHIRLS\r\n\r\n                         AROUND)\r\n          Nick!\r\n\r\n                         NICK\r\n\r\n                         (GRINS)\r\n          Scary place!\r\n\r\n                         HENRI-ANNE\r\n          You have to stand up here tonight,\r\n          not me. If you don't know what to\r\n          do, you'll look the fool!\r\n          Nick glances at Kim. She shrugs.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         65-\r\n\r\n                         82 CONTINUED: 82\r\n\r\n                          HENRI-ANNE\r\n\r\n                          (CONTINUIN\r\n\r\n                          G)\r\n          Come along.\r\n          Nick follows her to the opposite wing. Kim cannot see\r\n          them from her position.\r\n\r\n                         HENRI-ANNE\r\n          (continuing; calls out)\r\n          Can you hear me, Kim?\r\n\r\n                         KIM\r\n\r\n                         CALLS)\r\n          Yes.\r\n          Kim leans against a wall, gazing around at her gloomy\r\n          surroundings. She does not hear the WHISPERED CONVER-\r\n          SATION coming from behind a nearby partition. She does\r\n          not see Wendy and Lou lurking there, watching her.\r\n\r\n                         HENRI-ANNE\r\n\r\n                         (SHOUTING)\r\n          All right, Alex, start the tape.\r\n          A TRUMPET FANFARE BLARES OUT of the SPEAKERS.\r\n\r\n                         HENRI-ANNE\r\n\r\n                         (CONTINUING;\r\n\r\n                         SHOUTING)\r\n          Listen for your cue, king and\r\n          queen...\r\n          PROFESSIONAL MUSIC is HEARD.\r\n\r\n                         HENRI-ANNE\r\n\r\n                         (CONTINUING;\r\n\r\n                         SHOUTING)\r\n          Start walking -- slowly!\r\n          Kim begins to cross the stage. She smiles when she\r\n          spots Nick. The curtain slowly opens.\r\n\r\n                         VOICE (TAPED)\r\n          The King and Queen of the George\r\n          Winston High School Junion-Senior\r\n          Prom for 1980 -- Nick McBride and\r\n          Kim Hammond!\r\n          They meet backstage center and turn towards the parting\r\n          curtain. Henri-Anne stands at the front of the stage,\r\n          her hand resting on Alex's shoulder, as Kim and Nick\r\n          proceed downstage.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          66.\r\n\r\n                         82 CONTINUED: (2) 82\r\n\r\n                          VOICE (TAPED)\r\n\r\n                         (CONTINUING)\r\n          These two seniors were selected by\r\n          their fellow students as the most\r\n          popular boy and girl in the class..\r\n\r\n                         NICK\r\n          (to Kim as they\r\n\r\n                         WALK)\r\n          Bullshit!\r\n          Kim smiles.\r\n          Peeking out from behind the curtain, Wendy turns to\r\n          Lou.\r\n\r\n                         WENDY\r\n\r\n                         (BITTERLY)\r\n          Bullshit!\r\n\r\n                         LOU\r\n\r\n                         (GRINS)\r\n          Shhh!\r\n\r\n                         VOICE (TAPED)\r\n          Nick is a three-sport letterman\r\n          and president of the Key Club. He\r\n          plans to attend State University\r\n          in the fall.\r\n\r\n                         KIM\r\n          Because he can't get in anywhere\r\n          else!\r\n\r\n                         VOICE (TAPED)\r\n          Kim is the head cheerleader and\r\n          ranked number one on the girls'\r\n          tennis team. She hopes to become\r\n          a teacher.\r\n\r\n                         NICK\r\n          If she ever graduates...\r\n          Nick and Kim stop downstage center.\r\n\r\n                         HENRI-ANNE\r\n\r\n                         (SHOVING ALEX\r\n\r\n                         FORWARD)\r\n          Now, Alex.\r\n          Self-consciously, Alex stumbles up to Kim and pretends\r\n          to give her a bouquet of roses.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          67.\r\n\r\n                         82 CONTINUED: (3) 82\r\n\r\n                         HENRI -ANNE\r\n\r\n                         (CONTINUING)\r\n          That's it, Alex. Now kiss her!\r\n\r\n                         ALEX\r\n          My sister?\r\n\r\n                         HENRI-ANNE\r\n          Alex!\r\n          Alex awkwardly kisses Kim on the cheek.\r\n\r\n                         HENRI-ANNE\r\n\r\n                         (CONTINUING)\r\n          Now the king.\r\n\r\n                         ALEX\r\n          Kiss the king?\r\n\r\n                         NICK\r\n          On the mouth!\r\n          Kim laughs at Alex's discomfort.\r\n\r\n                         HENRI-ANNE\r\n          Shake hands...\r\n          They shake.\r\n\r\n                         HENRI -ANNE\r\n\r\n                         (CONTINUING)\r\n          Alex, step back...\r\n          Alex moves next to her.\r\n\r\n                         HENRI -ANNE\r\n\r\n                         (CONTINUING)\r\n          Kim and Nick, start down the..\r\n          (looks at the\r\n\r\n                         STAGE APRON)\r\n          Where are the steps?\r\n          Silence.\r\n\r\n                         HENRI-ANNE\r\n          (continuing; to the\r\n\r\n                         ENTIRE GYM)\r\n          You expect our king and queen to\r\n          jump to the floor?\r\n          A STUDENT in the back timidly responds.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          68.\r\n\r\n                         82 CONTINUED: (4) 82\r\n\r\n                         STUDENT\r\n          I'll find them, Miss Benton.\r\n          Henri-Anne turns back to Nick and Kim.\r\n\r\n                         HENRI-ANNE\r\n          You'll descend the steps...\r\n          Nick and Kim climb down from the stage.\r\n\r\n                         HENRI-ANNE\r\n\r\n                         (CONTINUING)\r\n          Nick, give Kim your arm...\r\n          (as he does)\r\n          Move to the center of the floor.\r\n          Nick and Kim self-consciously cross the room, aware\r\n          that everyone is watching them.\r\n\r\n                         HENRI-ANNE\r\n\r\n                         (CONTINUING)\r\n          Wait for the spotlights and your\r\n          music cue, then dance...\r\n\r\n                         (SIGHS)\r\n          It'll be beautiful!\r\n\r\n          83 TNT. HALLWAY - DAY 83\r\n          Kim strides down the empty corridor, flushed and ex-\r\n          cited from the rehearsal. Arriving at her father's of-\r\n          fice, she flings open the door.\r\n\r\n          84 INT. OFFICE - DAY 84\r\n\r\n          Kim enters and surveys the apparently empty office.\r\n          Hearing GRUNTS and GROANS from behind the desk, Kim\r\n          steps around and sees Adele Cooper stretched across the\r\n          floor. The secretary is practicing her \"Rainbow\" exer-\r\n          cise, arching her body towards the ceiling while keep-\r\n          ing her hands and feet on the floor.\r\n\r\n                         KIM\r\n          Hello?\r\n          Adele twists her head around to look at Kim. Her\r\n          \"Rainbow\" collapses. Spinning around, Adele sits\r\n          cross-legged on the floor and smiles at Kim.\r\n\r\n                         ADELE\r\n          You okay?\r\n\r\n                         KIM\r\n          Yeah... I've calmed down a bit...\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          69.\r\n\r\n                         84 CONTINUED: 84\r\n          Adele launches into another contortion.\r\n\r\n                         ADELE\r\n          This works for me.\r\n\r\n                         KIM\r\n          Has my father been back?\r\n\r\n                         ADELE\r\n          Nope. Haven't seen him all\r\n          afternoon.\r\n\r\n                         KIM\r\n          And he didn't leave a message?\r\n\r\n                         ADELE\r\n          Not a word.\r\n\r\n                         KIM\r\n\r\n                         (PUZZLED)\r\n          Strange... He usually gives me a\r\n          ride home.\r\n\r\n                         ADELE\r\n          Let me finish and I'll give you a\r\n          lift.\r\n\r\n                         KIM\r\n          Thanks, but I can walk.\r\n          Kim starts to leave, turning around at the door.\r\n\r\n                         KIM\r\n\r\n                         (CONTINUING)\r\n          Guess I won't be seeing you again.\r\n          Standing on her head, Adele smiles.\r\n\r\n                         ADELE\r\n          Guess again. Three different\r\n          students asked me to the prom\r\n          tonight... I thought you had to be\r\n          enrolled!\r\n\r\n                         KIM\r\n          You're going?\r\n\r\n                         ADELE\r\n\r\n                         (NODS)\r\n          Not with any of them. Know any\r\n          good-looking fathers?\r\n\r\n                         CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          70.\r\n\r\n                         84 CONTINUED: (2) 84\r\n\r\n                         KIM\r\n\r\n                         (SMILES) -\r\n          I'll keep my eyes open. See you\r\n          later.\r\n          She exits as Adele slowly lowers her legs to the floor.\r\n\r\n          85 INT. HALLWAY - DAY 85\r\n\r\n          Jude approaches her locker, stops. There's a picture\r\n          taped to her locker door, her picture, ripped out of\r\n          the Winston High Yearbook. She looks at it, reaches up\r\n          and pulls it off the door. She winces, looks at her\r\n          finger. It's bleeding. She looks at the picture.\r\n          There's a tiny sliver of glass embedded in it.\r\n          Jude hears SOMEONE COMING. She turns to see Kelly com-\r\n          ing toward her.\r\n\r\n                         KELLY\r\n          Jude... look...\r\n          She has something in her hand. It's a photo of her, a,\r\n          Yearbook photo with the same torn edges. Jude holds up\r\n          her version.\r\n\r\n                         KELLY\r\n\r\n                          (CONTINUING)\r\n           Why?\r\n\r\n          86 INT. SHOWER ROOM - DAY 86\r\n\r\n          The DOOR CREAKS open. A light is flicked on. Sykes\r\n          stands there, a broom and a big waste-pan in his hands.\r\n          He stares at the broken mirror with its center hole and\r\n          its missing wedge.\r\n          He shuffles across the floor and starts to clean up the\r\n          debris.\r\n\r\n          87 EXT. HAMMONDS' HOUSE - DUSK 87\r\n\r\n          The split-level suburban residence sits on a tree-lined\r\n          street in an older, middle-class neighborhood. Walking\r\n          up the driveway, Kim hears a LOUD THUD from behind the\r\n          house. As the SOUND CONTINUES, Kim walks around back\r\n          to investigate.\r\n\r\n          88 EXT. HAMONDS ' BACKYARD - DUSK 88\r\n\r\n          Stepping around the corner of the house, Kim sees her\r\n          father furiously chopping an old stump in the flower\r\n          garden.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           / l.\r\n\r\n                         88 CONTINUED: 88\r\n          Hammond's axe slashes into the rotten wood, sending\r\n          splinters flying in all directions. Kim watches him\r\n          work. He appears angry and upset.\r\n\r\n                         KIM\r\n          Hi.\r\n          Oblivious, Hammond buries the axe in the stump. Kim\r\n          moves around to face him. When he sees her, Hammond\r\n          jumps, startled.\r\n\r\n                         HAMMOND\r\n          I didn't hear you.\r\n\r\n                         KIM\r\n\r\n                         (SMILES)\r\n          Sorry.\r\n          Wiping the sweat from his forehead, Hammond struggles\r\n          to catch his breath.\r\n\r\n                         HAMMOND\r\n          I'm getting too old for this.\r\n\r\n                         KIM\r\n          Why are you doing it now?\r\n\r\n                         HAMMOND\r\n          Your mother's been hounding me to\r\n          get it done... You got nay message?\r\n\r\n                         KIM\r\n\r\n                         (PUZZLED)\r\n          No.\r\n\r\n                         HAMMOND\r\n\r\n                         (ANGRILY)\r\n          I told that woman to tell you I\r\n          had a meeting and couldn't drive\r\n          you home.\r\n\r\n                         KIM\r\n          Your secretary?\r\n\r\n                         HAMMOND\r\n\r\n                         (NODS)\r\n          Idiot!\r\n\r\n                         KIM\r\n          I liked her.\r\n          Hammond angrily jerks the axe from the stump.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          72.\r\n\r\n                         88 CONTINUED: 2) 88\r\n\r\n                         KIM\r\n\r\n                         (CONTINUING)\r\n          You okay?\r\n\r\n                         HA` ONND\r\n\r\n                         (SHRUGS)\r\n          This thing with your mother...\r\n          Have you seen her yet?\r\n\r\n                         KIM\r\n          No. How is she?\r\n\r\n                         HAMMOND\r\n\r\n                         (SIGHS)\r\n          One minute she's depressed, the\r\n          next she's bubbling over like a\r\n          child... She wants to go with me\r\n          tonight.\r\n\r\n                         KIM\r\n          Great!\r\n\r\n                         HAMMOND\r\n          I'm not so sure.\r\n\r\n                         KIM\r\n          I think getting dressed up and\r\n          going out might be good for her.\r\n\r\n          HA\",24OND\r\n          She's had a bad day, Kim. I'm not\r\n          sure she can handle it... See if\r\n          you can talk to her.\r\n          Hammond picks up the axe and sends it crashing into the\r\n          stump.\r\n\r\n          89 INT. KITCHEN - DUSK 89\r\n\r\n          Kim enters from the backyard. Looking around, she no-\r\n          tices that nothing is being prepared for dinner.\r\n          Curious, she moves toward the living room.\r\n\r\n          90 INT. LIVING ROOM - DUSK 90\r\n\r\n          Vivian is arranging fresh roses on the mantel shrine\r\n          when Kim enters. The girl stands for several seconds\r\n          watching her mother before she speaks.\r\n\r\n                         KIM\r\n          Hi, Mom.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          /,5\r\n\r\n                         90 CONTINUED: 90\r\n\r\n                         VIVIAN\r\n\r\n                         (WITHOUT TURNING\r\n\r\n                         AROUND)\r\n          Hello, Robin. Don't eat anything.\r\n          Dinner's almost ready.\r\n          Disturbed, Kim frowns and slowly crosses the room to\r\n          her mother.\r\n\r\n                         KIM\r\n          Nothing's cooking, Mom. You\r\n          must've forgotten.\r\n          Slipping out of her reverie, Vivian turns around to\r\n          face Kim.\r\n\r\n                         VIVIAN\r\n          Oh.. I don't know what I was\r\n          thinking.\r\n\r\n                         KIM\r\n\r\n                         (SMILES)\r\n          It doesn't matter.\r\n\r\n                         VIVIAN\r\n\r\n                         (EXCITEDLY)\r\n          Have you seen the new satin\r\n          pantsuit I'm wearing?\r\n          Vivian smiles at her daughter. Kim studies her for a\r\n          long moment, then leans over and kisses her on the\r\n          cheek.\r\n\r\n                         KIM\r\n          You'll be beautiful.\r\n\r\n          91 INT. HALLWAY - HAMMONDS' HOUSE - DUSK\r\n\r\n          As Kim walks down the hallway, she notices that Alex's\r\n          door is closed. She enters her bedroom.\r\n\r\n          92 INT. BEDROOM - DUSK 92\r\n\r\n          Kim crosses the room and switches ON her RADIO. ROCK\r\n          MUSIC is HEARD as she tosses her books onto the desk\r\n          and moves to the closet. She carefully pulls out her\r\n          prom dress, a mid-length, off-the-shoulder gown in a\r\n          white, clinging material. Holding it up against her\r\n          body, she inspects the gown in the full-length mirror\r\n          on the closet door. Watching her reflection, Kim\r\n          twirls around, hugging the gowm to her body. Satis-\r\n          fied, she gently lays the go%.m on her bed.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         92 CONTINUED: 92\r\n          Kim begins to undress. Outside, the twilight shadows\r\n          deepen.\r\n          THROUGH the VINDOM, a slight movement is SEAN among the\r\n          trees; suddenly, a dark figure becomes VISIBLE, ap-\r\n          proaching.the window. Kim does not notice the figure\r\n          as she finishes undressing. She wraps herself in a\r\n          robe and sits at her dressing table.\r\n          Putting her hair up, she does not see the shadowy\r\n          figure peering inside. When Kim stands up, the figure\r\n          slips away from the window. As she crosses the room,\r\n          the face reappears, hidden by the shadows, watching her\r\n          enter the bathroom.\r\n\r\n          93 INT. BEDROOM - DUSK 93\r\n\r\n          Wearing only a bra and panties, Wendy is sprawled\r\n          across her bed, talking on the telephone. A black silk\r\n          gown is draped across her legs.\r\n\r\n                         WENDY\r\n          (into the receiver)\r\n          What I'm wearing now?... Oh,\r\n          tonight!\r\n          (smiles, gently\r\n          stroking the gown)\r\n          You'll find out soon enough.\r\n\r\n                         (STIFFENS)\r\n          Now, are we all set?... It better.\r\n          I don't want her to ever forget\r\n          tonight!... Okay, 'bye.\r\n          Wendy hangs up the receiver and glances at her night\r\n          table. A photograph of a grinning Nick McBride stares\r\n          back. Wendy smiles and caresses her gown.\r\n\r\n          94 INT. BEDROOM - NIGHT 94\r\n\r\n          Seated at her dressing table, Kim puts the final touch-\r\n          es on her makeup. Her hair is swept up and back, fall-\r\n          ing in soft waves to her shoulders. Wearing the rav-\r\n          ishing white gown, she looks older and very beautiful.\r\n          Vivian's VOICE is HEARD from down the hall.\r\n\r\n          VIVIAN (O.S.)\r\n          Kim!\r\n          Vivian comes in looking anxious and flustered. She's\r\n          dressed in an elegant black satin pantsuit. Kim turns,\r\n          looks at her.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          75.\r\n\r\n                         94 CONTINUED: 94\r\n\r\n                         KI`RF\r\n          Mom, it looks great...\r\n          Vivian doesn't seem to hear her. She's rummaging\r\n          through her purse.\r\n\r\n                         VIVIAN\r\n          Kim, have you got any of my\r\n          makeup?\r\n\r\n                         KIM\r\n          No... I never...\r\n\r\n                         VIVIAN\r\n          That deep red lipstick, you\r\n          remember? You liked it...\r\n\r\n                         KIM\r\n          I wouldn't take it without asking\r\n          you...\r\n          Vivian's very wound up.\r\n\r\n                         VIVIAN\r\n          It was on my dressing table, I set\r\n          it aside...\r\n          She's looking around Kim's room as if she expects to\r\n          see it.\r\n\r\n                         VIVIAN\r\n\r\n                         (CONTINUING)\r\n          Why does this always happen at\r\n          the last minute?\r\n          Hammond's VOICE bellows from downstairs.\r\n\r\n          HAMMOND (O.S.)\r\n          let's go, we can't be late...\r\n\r\n                         VIVIAN\r\n\r\n                         (TO KIM)\r\n          I set it aside...\r\n          She heads for the door, stops, looks fully at Kim for\r\n          the first time.\r\n\r\n                         VIVIAN\r\n\r\n                         (CONTINUING)\r\n          You look lovely, dear.\r\n          She goes out.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          76.\r\n\r\n          95 INT. DOWNSTAIRS HALL - NIGHT 95\r\n\r\n          Hammond stands in front of a hall mirror, straightening\r\n          his bow tie. He seems agitated, nervous. He turns as\r\n          Vivian starts down the stairs. He looks surprised at\r\n          her outfit. There's a certain similarity between it\r\n          and his own formal suit.\r\n\r\n                         HAMIM0ND\r\n          My God, we're going to look like\r\n          twins.\r\n          Vivian stops dead, looks at him. Hammond forces a\r\n          smile.\r\n\r\n                         HAMMOND\r\n\r\n                         (CONTINUING)\r\n          I'm joking, Vi, it's beautiful.._\r\n          C'mon...\r\n          She hesitates, then comes down to him.\r\n\r\n                         VIVIAN\r\n          I told you I'd bought it.\r\n\r\n                         HAMMOND\r\n          Of course you did.\r\n          He opens the door for her. She pauses to check herself\r\n          in the mirror.\r\n\r\n                         HAMMOND\r\n\r\n                         (CONTINUING)\r\n          we've got to go.\r\n          He puts an arm around her, kisses her gently on the\r\n          cheek. She just stares at herself in the mirror.\r\n\r\n          96 EXT. HOUSE - NIGHT 96\r\n\r\n          Hammond takes Vivian's arm as they step outside, walk\r\n          toward the car in the driveway.\r\n\r\n          97 INT. PARKED CAR - POV 97\r\n\r\n          Someone is watching Hammond and Vivian from a car\r\n          parked across and just down the street. A shadow moves\r\n          in the foreground, in the front seat of the car.\r\n\r\n          98 EXT. HOUSE 98\r\n\r\n          Hammond guides his wife to their family car, opens the\r\n          passenger door for her_ He looks past her, down the\r\n          street, sees a car parked there.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         I I\r\n\r\n                         98 CONTINUED: 98\r\n          A streetlight reflecting off its windshield prevents\r\n          him from seeing inside. Vivian interrupts his\r\n          speculations.\r\n\r\n                         VIVIAN\r\n          I'm going back to change.\r\n          She turns back to the house. Hammond holds on to her\r\n          arm.\r\n\r\n                         HAMMOND\r\n          Vi... there's no time...\r\n\r\n                         VIVIAN\r\n          I'm not going to look ridiculous!\r\n\r\n                         IAMMOND\r\n          You don't look ridiculous, you\r\n          look fine...\r\n\r\n          99 INT. PARKED CAR - POV 99\r\n\r\n          The figure in the front seat watches the confrontation\r\n          in the Hammond driveway.\r\n\r\n          100 EXT. HOUSE 100\r\n\r\n          Hammond takes Vivian by the shoulders, faces her.\r\n\r\n                         HAMMON D\r\n          Vi.. this is a big night for the\r\n          school, it's a big night for me...\r\n          I know how you're feeling... I\r\n          understand... It's difficult for\r\n          all of us... But we've got to make\r\n          a special effort, Vi... We can't\r\n          let the... terrible memories of\r\n          this day affect us... That may\r\n          seem cold and... insensitive to\r\n          you, but it's the way it has to\r\n          be..\r\n          He pauses, staring down at his wife. She's holding his\r\n          gaze.\r\n\r\n                         HAMMOND\r\n\r\n                         (CONTINUING)\r\n          Now, Vi, if you think it's going\r\n          to be too difficult for you...\r\n\r\n                         VIVIAN\r\n          You don't want me to go.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          78.\r\n\r\n                         100 CONTINUED: 100\r\n\r\n                         HAMMOND\r\n\r\n                         T\r\n          Certainly I want you to go,\r\n          just saying...\r\n\r\n                         VIVIAN\r\n          You don't think I can do it... You\r\n          think I'll embarrass you...\r\n\r\n                         HARMOND\r\n          No! I don't... believe me..\r\n\r\n                         VIVIAN\r\n          Then why are you saying these\r\n          things?\r\n\r\n                         HAMMMOND\r\n          Vi... I just..\r\n          He's trying to stay calm, to keep the lid on. She's on\r\n          the verge of tears.\r\n\r\n                         HAMMOND\r\n\r\n                         (CONTINUING)\r\n          I'm sorry... I didn't mean to\r\n          upset you...\r\n\r\n                         VIVIAN\r\n          You treat me like a child! I'm\r\n          your wife!\r\n          She glares at him. He releases her from his grip, ges-\r\n          tures toward the car.\r\n\r\n                         HANMOND\r\n          Let's get going...\r\n          He walks around to the driver's door. Vivian stares\r\n          after him with hard cold eyes.\r\n\r\n          101 INT. PARKED CAR - POV 101\r\n\r\n          The figure in the parked car watches as Hammond starts\r\n          up the car, waits for Vivian to get in, backs out of\r\n          the driveway, and moves off down the street.\r\n\r\n          102 EXT. PARKED CAR 102\r\n\r\n          The figure climbs out of his car, gazes at the fading\r\n          taillights of the Hammond car. The figure is Nick\r\n          McBride.\r\n\r\n          103 INT. BEDROOM - NIGHT 103\r\n\r\n          Kim reaches for a small bottle of cologne.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          79.\r\n\r\n                         103 CONTINUED: 103\r\n          As she gently tracks the perf me across her skin, she\r\n          is startled by another reflection in her mirror.\r\n          Whirling around, she sees Alex. Standing up, she pir-\r\n          ouettes and curtsies before her brother.\r\n\r\n                         KIM\r\n          Well?\r\n          Alex gapes, stunned by his sister's appearance.\r\n\r\n                         ALEX\r\n\r\n                         (FINALLY)\r\n          Amazing!\r\n\r\n                         KIM\r\n\r\n                         (SMILES)\r\n          You like?\r\n\r\n                         ALEX\r\n          You look almost like a woman!\r\n\r\n                         KIM\r\n\r\n                         (LAUGHS)\r\n          Thanks!\r\n          She picks up her corsage from her dressing table.\r\n\r\n                         KIM\r\n\r\n                         (CONTINUING)\r\n          You want to help or just leer?\r\n\r\n                         ALEX\r\n          You're my sister... I'll leer!\r\n\r\n                         KIM\r\n\r\n                         (LAUGHS)\r\n          Pin this on me, you creep,\r\n          late.\r\n          Alex takes the corsage. As he attaches the bright red\r\n          flower on her gown, she playfully dabs perfume on his\r\n          neck. He pulls back, pricking himself on the pin.\r\n\r\n                         ALEX\r\n          Hey!\r\n\r\n                         KIM\r\n          You shouldn't have pulled away...\r\n          The DOORBELL RINGS.\r\n\r\n                         KIM\r\n\r\n                         (CONTINUING)\r\n          It's him!\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          80,\r\n\r\n          103 CONTINUED: (2) 103.\r\n\r\n                         ALE \r\n          er's face is revealed. It is the nine-year-old Alex.\r\n          Kim cradles the killer on the ground. She turns his\r\n          head toward the light. We SEE his face full-on.\r\n\r\n                         VIVIA N\r\n          Robin!\r\n          She rushes forward, lunging for the body. Hammond\r\n          grabs her, restraining her.\r\n          Alex's dark eyes stare back unseeing at his family.\r\n          His resemblance to his dead twin sister is uncanny.\r\n          His hair falls onto his forehead in bangs, as Robin's\r\n          had done seven years before. His makeup has been slop-\r\n          pily applied. The rouged cheeks and the smudged red\r\n          lips amplify the grotesque impersonation.\r\n          Kim strokes her brother's hair. Hammond presses his\r\n          hysterical wife to him. The onlookers slowly close in.\r\n          We SLOWLY DISSOLVE FROM Alex's face TO a photograph of\r\n          the Hammond family taken seven years earlier. We MOVE\r\n          IN CLOSE ON the twins. Alex and Robin are smiling.\r\n\r\n          FADE OUT.\r\n\r\n                         THE END\r\n\r\n\r\n\r\n\n\n\n\nProm Night\nWriters :   William Gray  Bob Guza\nGenres :   Horror  Mystery  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:33:20.934329"}