{"title": "Quantum Project", "film_link": "/Movie Scripts/Quantum Project Script.html", "script_link": "/scripts/Quantum-Project.html", "info_raw": "\n\nQuantum Project Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (1.60 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  David Aaron Cohen\nGenres  Drama  Short\n\nRead \"Quantum Project\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nQUANTUM PROJECT: ORIGINAL SCREENPLAY\n\n\n\n      1     INT.  A BIOCHEMICAL LANDSCAPE                            1\n\n            A violent electrical storm.  Veins of light pulse outward, branching\n            off into a spidery network of \n\n            GLOWING INTERCONNECTEDNESS\n\n            We are inside a human brain.  A pack of neurons FIRE OFF to the left,\n            and rocket their way across synapses to the optic nerve.  Passing the\n            eye socket, they speed toward a silky, curvilinear membrane (the\n            retina) on which we see an image projected:\n\n            AN UPSIDE DOWN COMPUTER SCREEN\n\n            Neurons PING into the membrane: the picture suddenly FLIPS RIGHT SIDE\n            UP and we follow the light, flashing in a blur through the iris and\n            cornea until, exiting the eye we reverse POV and\n\n      2     EXT.  THE WORLD AS WE KNOW IT - DAY                      2\n\n            CLOSE ON A PAIR OF EYES\n\n            Deep deep blue.  Radiating more intelligence than wisdom.  Inside\n            each pupil is the reflection of a COMPUTER SCREEN.  A deferential\n            VOICE sounds from off camera.\n\n                                VOICE\n                      Professor Pentcho?\n\n      3     INT.  ATOMIC LABORATORIES  (PROFESSOR PAUL PENTCHO) - DAY3\n\n            Twenty-nine, athletic, owlishly handsome.  \n\n                                VOICE (ARLETTE)\n                      Multi-tasking again?\n\n            Pentcho raises his blue eyes from the computer screen and up at\n            ARLETTE (50's), his mannish Swiss assistant.  \n\n                                ARLETTE\n                      We can start the descent now.  \n\n      4     INT.  THE LABORATORIES (MOVING) - DAY                    4\n\n            A SERIES OF SHOTS\n\n            as Pentcho and Arlette stride through the facility.  They pass a\n            group of green-tagged VISITORS and their Swiss-accented GUIDE.\n\n                                GUIDE\n                      Two hundred feet below us is the world's\n                      largest particle accelerator...\n\n            His VOICE continues on overlap as they reach a hallway.\n\n                                GUIDE (OC) (CONT'D)\n                      27 kilometers in circumference, the beam\n                      pipe actually runs beneath the borders of\n                      Switzerland and France...\n\n                                PENTCHO\n                      Did you get that data off to Braverman at\n                      Cal Tech?\n\n            They are facing the CAPSULE/ELEVATOR that leads to the tunnel.\n\n                                ARLETTE\n                      Done.\n\n            Next to the elevator, two plants are dying in their pots, their\n            growing lamps off.  Pentcho looks around, finds the plug, pushes it\n            into the socket.  The lights glow.  He peers at a leaf: a tiny bug\n            crawls across...\n\n                                GUIDE (OC)\n                      ...at the moment of impact the electrons\n                      inside the pipe are travelling six hundred\n                      sixty six million miles per --  \n\n                                ARLETTE\n                      We need to progress.\n\n            He breaks out of it, swipes his I.D. card.  The capsule doors WHOOSH\n            open.  Pentcho nods at the man inside.  This is JACQUE, his accent\n            heavily Italian.\n\n                                JACQUE\n                      Hey, it is 3-P-O!  P, P, P!  Professore\n                      Paulo Pentcho!\n\n                                PENTCHO\n                      That's not an official nickname, Jacque.\n\n            Pentcho looks from Jacque to Arlette, who blushes.  Pentcho sits down\n            in the heavily consoled captain's chair.\n\n                                JACQUE\n                      Beh!  Eets just tun-nel humor.   \n\n            The giant lab disappears from sight as they DROP twenty stories below\n            the earth. \n\n                                PENTCHO\n                      Did they recalibrate the 3k turn?  \n\n            Jacque nods.  They hit bottom.  Pentcho keys in data on the console\n            computer as the capsule moves LATERALLY on a track parallel to the\n            beam pipe, stopping in front of the RF CAVITY, bursting with a\n            billion dollars worth of nanotechnology.\n\n                                PENTCHO (CONT'D)\n                      Give me more angle-control on the bounce.\n\n                                JACQUE\n                      Benissimo, Professore.  \n\n            ON PENTCHO: a little bored, manning the console.\n\n                                PENTCHO\n                      Fifteen seconds Arlette...\n\n      5     INT.  PENTCHO'S BRAIN FIELD - DAY                        5\n\n            The camera surges forward into Pentcho's eyes:\n\n            DOUBLE CLICK\n\n            We see an image draw itself on the empty 'page' of the field: \n\n            A BLACK DOT LOOPING INTO A STRING\n\n            accompanied by the following thought text:  \n                      \"...two spatially separated particles will\n                      irresistibly attract...\"\n\n            MOUSE CLICK - A WOMAN'S FACE\n\n            wide-set brown eyes brimming with emotion.  A hint of a SONG playing\n            somewhere in the BG.  \n\n            MOUSE CLICK\n\n            to the previous 'page' where the LOOP has formed into a sheet moving\n            through space, followed by the floating thought text: \n                      \"...until the force of the collision fuses\n                      them into...\"\n\n                                PENTCHO'S VOICE\n                      Ten, nine, eight...\n\n            MOUSE CLICK - POV: LOOKING STRAIGHT DOWN AT\n\n            the BROWN-EYED WOMAN, her face dreamy, her body naked beneath silk\n            sheets.  PULL BACK: she's floating on an enormous Renaissance mural -\n            a wedding scene - that is a bedroom floor.  Off in the corner,\n            PENTCHO sits hunched over a clunky laptop, his fingers dancing,\n            dervish-like, across the keyboard.\n\n                                PENTCHO'S VOICE (CONT'D)\n                      Four, three, two...\n\n                                WOMAN\n                      Then goodbye...\n\n            CRACK!  Suddenly, the woman drifts away.  Pentcho looks up: THEIR\n            EYES LOCK WITH LONGING AS:\n\n      6     INT.  THE CAPSULE CONSOLE - SAME TIME                    6\n\n            Pentcho's FINGER depresses the START button. \n\n      7     INT.  PARTICLE ACCELERATOR - DAY                         7\n\n            as we follow the PULSE SIGNAL from the keyboard to the CPU, across\n            the LOCAL AREA NETWORK to the MAINFRAME in the RF cavity, sending its\n            own signal into the BEAM PIPE, where two soon-to-be accelerated\n            ELECTRONS are released,  like horses bolting from the same starting\n            gate, but in opposite directions.  THE ROLLER-COASTER RIDE BEGINS. \n\n            POV - ONE LIGHT INFUSED ELECTRON \n\n            BLASTING through the beam pipe like a COMET, fused inside of a\n            looping, twenty seven kilometer single lane race track. WHOOOSH!\n\n            As the electron accelerates, so too does the sound, rushing to GUT\n            SPLITTING, EAR WRENCHING DB'S.  Heading around the turn, it barrels\n            STRAIGHT INTO THE PATH OF THE SECOND ELECTRON on its own speed-of\n            light power surge.\n\n            HERE COMES THE IMPACT POINT... but SCREEEEECH!  \n\n            What disc brakes might sound like, slammed to the floor of a vehicle\n            travelling six hundred sixty six million miles per hour.\n\n            SUDDENLY THE ELECTRON HAS STOPPED, SUSPENDED,\n\n            its phosphorescent glow trained like a spotlight on:\n\n            PENTCHO - EXTREME CLOSE UP\n\n            the dual computer screens reflecting out of his pupils, again.  A\n            VOICE speaks from nowhere, sonorous and packed with reverb:\n\n                                FEMALE VOICE\n                      WHAT DO YOU WANT?\n\n            The camera SURGES into Pentcho's eyes as the brain field opens to the\n            sounds of a nine alarm fire.  DING DING DING DING DING! The thought\n            text marches by in giant, attention-getting letters: \"ELECTRONS DON'T\n            TALK!\"\n\n                                FEMALE VOICE (CONT) (CONT'D)\n                      WHAT DO YOU WANT, PAUL?\n\n            More thought text scrolls by on the field, now in RED LETTERS:\n                      \"I'm having a psychotic episode.\"\n\n            The field collapses back into PENTCHO, ashen-faced, watching his\n            computer screen, and seeing: the cursor (electron) blinking.\n\n                                JACQUE'S VOICE\n                      Impact!\n\n            Suddenly, we are back inside the pipe, HURTLING toward\n\n            KABLOOM!  THE SUB-ATOMIC EXPLOSION\n\n            A particle meteor shower of magnificent proportions.  They glow and\n            charge off and disappear, as the laws of E=mc2 take visual flight\n            inside this billion dollar kaleidoscope.  \n\n      8     INT. AIRPLANE IN 1ST CLASS (ON PENTCHO) - DAY            8\n\n            staring out the window, not really seeing the clouds as we SURGE into\n            his eyes and CLICK\n\n      9     INT.  THE BRAIN FIELD (POPPING OPEN) - DAY               9\n\n            stacking up windowlike flashbacks with startling ferocity.  \n\n            The glowing electron - CLICK -  Arlette: \"multi-tasking again?\" CLICK\n            - the capsule doors closing - CLICK - \"you're having a psychotic\n            episode\" - CLICK - the echo of the electron's voice: \"WHAT DO YOU\n            WANT, PAUL?\" \n\n     10     INT.  THE AIRPLANE (PENTCHO) - DAY                      10\n\n            puts down a drink glass on the tray table of the seat next to him. \n            Places headphones onto his ears.  Fiddles with the music channels:\n            country, stand-up, classical... Stays put on a Mozart concerto.  He\n            gazes back out at the clouds, fails to notice that\n\n            HIS DRINK GLASS IS MOVING\n\n            sliding slowly across the tray table.  It stops near the edge and\n            waits, as Pentcho looks up from the window.  As his head drifts back\n            toward the clouds outside\n\n            THE GLASS MOVES ACROSS THE TRAY TABLE IN THE OTHER DIRECTION \n\n     11     EXT.  SAN FRANCISCO INTERNATIONAL AIRPORT - DAY         11\n\n            Pentcho's plane touches down.\n\n     12     INT.  A RED VOLKSWAGEN BEETLE - DRIVING                 12\n\n            On the freeway, heading for Berkeley, in eternal rush hour.  Stop,\n            go, sixty miles per hour, then five, then thirty. \n            Pentcho drives, distracted, stares at his own eyes reflected in the\n            rear view mirror.  The camera SURGES in: CLICK\n\n     13     INT.  FLASHBACK - AIRPLANE - DAY                        13\n\n            It's Pentcho himself, on the airplane, listening to Mozart.  In the\n            foreground, the tray table and glass.  In the BG, his eyes fixed\n            aimlessly on the clouds outside.  Suddenly, Pentcho's face \n\n            SPLITS INTO TWO DIMENSIONS\n\n            One stays focused forward, while the SECOND ONE turns to the side and\n            watches in amazement as\n\n            THE GLASS SLIDES ACROSS THE OPEN TRAY TABLE\n\n            Suddenly a horn BLARES, and CRASH!\n\n     14     INT/EXT.  THE BEETLE (PENTCHO) - DAY                    14\n\n            SLAMS into the car in front of him, triggering   \n\n            SLOW MOTION EFFECT\n\n            A three car COLLISION with Pentcho in the middle, an object lesson in\n            physics seen from ten different camera angles:\n\n            SCREECH CRUNCH CRUNCH \n\n            Bumpers crumple, metal tears, human molecules SNAP forward.  POP POP\n            POP!  Like gunfire, bullet AIRBAGS clamp the drivers' heads back\n            against their headrests.  \n\n     15     INT. PENTCHO'S BRAIN - DAY                              15\n\n            The field ROCKS SIDEWAYS, in total OVERLOAD, so flooded with messages\n            that each one is undecipherable.  \n\n     16     EXT.  THE FREEWAY ACCIDENT SITE - DAY                   16\n\n            The three cars form a tangled metal sculpture.  Incredibly, as\n            Pentcho himself sees, they are all RED VW BEETLES.  He sits in a\n            daze.  A man's voice interrupts, scaling up into a SHOUT.\n\n                                VOICE\n                      What the hell were you thinking?  What?  I\n                      want to know!  WHAT?!!\n\n            This is WILL (30's), a scratch over one eye, peering in at Pentcho,\n            still behind the air bag/steering wheel, craning his stiffening neck\n            forward and back at the crumpled row of red automobiles.  He blinks,\n            then answers in an eerie voice.\n\n                                PENTCHO\n                      Probability of this happening, same make,\n                      model, color and year is less likely than\n                      the proof for the existence of God.  \n\n                                WILL\n                          (seething)\n                      Sorry I asked. (beat) You got insurance?  \n\n     17     EXT.  THE FREEWAY SITE (LIGHT RAIN IS FALLING) - DAY    17\n\n            A tow truck backs up to Pentcho's car.  He stands, dazed, off on the\n            shoulder, luggage next to him.  His eyes drift toward Will, giving\n            instructions into his cell phone.\n\n                                WILL\n                      Up the ramp.  Yeah... I'll -- (he turns) \n                      There you are!  See me?  See?  They won't\n                      let you in?  Just walk... Here I am.\n\n            He waves at a red Dodge Durango on the street below.  \n\n            PENTCHO stares idly at the Durango as we \n\n     18     INT. PENTCHO'S BRAIN - (MUSIC ON OVERLAP)               18\n\n            The picture is blurry but the song clear.  \n\n                                SINGER'S VOICE\n                      I know this world is kil...ling you...\n\n            CLICK - THE PICTURE SHARPENS\n\n            on a man and a woman, MAKING LOVE on a big brocade couch.  Their\n            bodies rock in unison, faces unseen. \n\n                                SINGER'S VOICE (CONT'D)\n                      My aim is true-ooooh.  \n\n            The field collapses closed upon:\n\n     19     EXT.  THE FREEWAY ACCIDENT SITE - DAY                   19\n\n            A woman from the Durango is approaching, as Will, back on the phone,\n            argues with his boss.\n\n                                WILL\n                      I'll be there, Trent.  Yes.  20 minutes --\n\n            Click.  Will reddens, sees the sunglassed face of the woman, looking\n            past him and over to PENTCHO, signing the tow truck papers.  The\n            battered front end of his Beetle CRANKS upward.  \n\n                                WILL (CONT'D)\n                      Son-of-a-bitch.  As if it was my fault I got\n                      rear-ended by...\n\n            The woman stares, curiously, at Pentcho.  \n\n                                WILL (CONT'D)\n                      ...some schmuck dreaming about God.  Mia? \n\n            She doesn't hear him.  Takes off her sunglasses, slowly.  Wide-set\n            brown eyes.\n\n                                WOMAN\n                      Paul...?\n\n            Finished now with the tow truck driver.  His head turns.  She moves\n            closer.  Will's voice protests from the BG.\n\n                                WILL'S VOICE\n                      Mia...\n\n            ON PENTCHO - SEEING HER, REALLY, FOR THE FIRST TIME\n\n     20     INT.  PENTCHO'S BRAIN -  (PRESENT DAY MIA)              20\n\n            overlapped by another photograph that slowly comes into focus - top\n            third, middle third, bottom - like a downloading Internet image from\n            his personal files.\n\n            IT'S MIA, YOUNGER, THE SAME WIDE-SET DARK EYES\n\n            Pentcho's heartbeat pounds LOUDER, drowning out the whisper:\n\n                                MIA\n                      Then goodbye...\n\n     21     EXT.  THE FREEWAY ACCIDENT SITE (BACK TO REALITY) - DAY 21\n\n            They lock into a stare, the molecules around them swirling with\n            emotion.  Barely audible:\n\n                                PENTCHO\n                      Less likely than the existence of God.\n\n            Mia brushes back a strand of hair.  Bites her lip.\n\n                                PENTCHO (CONT'D)\n                      I've been dreaming about you.\n\n                                MIA\n                      Day or night?\n\n            Pentcho loses himself in her brown eyes.\n\n                                PENTCHO\n                      Both.  \n\n            Atoms are vibrating, interchanging by the billions.  Another voice\n            gets in the way.\n\n                                WILL'S VOICE\n                      Mi.\n\n                                PENTCHO\n                      Is that your...\n\n                                MIA\n                      No. (beat) Not yet.\n\n            She shifts her weight from one slim leg to the other.\n\n                                PENTCHO\n                      Could we go somewhere?\n\n                                MIA\n                      I'm heading out of town.\n\n                                PENTCHO\n                          (deep breath)\n                      Okay.\n\n            Mia does a tiny double-take.  It's very sexy.\n\n                                MIA\n                      What?\n\n                                PENTCHO\n                      I could go out of town.  \n\n            Mia laughs.  This is so preposterous.\n\n                                MIA\n                      Could you?\n\n                                PENTCHO\n                          (nodding)\n                      Where to?\n\n                                MIA\n                      A place you've never been.  \n\n                                PENTCHO\n                      That's the physicist's playground.\n\n     22     EXT.  ADVENTURE WILDERNESS STORE - DAY                  22\n\n            Will SLAMS the Durango door shut and stalks into the store.\n\n     23     EXT.  HEADING TO XANADU (A SERIES OF INTERCUTS) - DAY   23\n\n            as the Durango motors into the alpine landscape.  Mia turns, looks at\n            her former lover.  He stares back, smiles. \n\n                                MIA\n                      Why am I doing this?\n\n                                PENTCHO\n                      It's an experiment.\n\n            Mia turns onto a private road.  A MANSION appears in the distance,\n            cresting the hill.  \n\n    23a     EXT/INT.  XANADU - NIGHT                               23a\n\n            A massive wooden door.  Mia holds a flashlight, slips an oversized\n            key into the lock and turns.  \n\n            POV: THROUGH THE DOORWAY\n\n            An enormous hall.  Scaffolding rises from the stone floor.  Forty\n            foot high walls are draped in thick sheets of plastic. \n\n            They enter like thieves.\n\n    23b     INT.  XANADU - A SHORT TIME LATER                      23b\n\n            Mia stands on top of an eight foot riser.  Pentcho passes up\n            harnesses and rope to her outstretched hands.  \n\n                                MIA\n                      We flopped the first time out.\n\n                                PENTCHO\n                      At the sub-atomic level, particles obey\n                      their own logic.  They connect in\n                      unimaginable ways.   \n\n            Mia slings the gear over her shoulder.  Looks very much in her\n            element.\n\n                                MIA\n                      And you think this is relevant to our\n                      relationship?  \n\n            Pentcho starts his own climb up the scaffolding.  Reaches the first\n            plank.\n\n                                PENTCHO\n                      Could be.  \n\n                                MIA\n                          (wryly)\n                      What universe are you in, Paul?\n\n                                PENTCHO\n                      A quantum one.  \n\n    23c     INT.  A HIGHER SCAFFOLDING - A SHORT TIME LATER        23c\n\n            Pentcho clips a safety line to his belt.  The two of them wear \n            yellow hardhats and climbing harnesses.  They suddenly KICK OFF the\n            scaffold and DANGLE twenty five feet above the stone floor.  Hand\n            over fist, they start to ascend, hoisting themselves up the tug\n            ropes.\n\n                                PENTCHO\n                      The shorthand is, when you send electrons\n                      through space, it's impossible to say\n                      precisely what they are: particles or waves.  \n\n            They spin around slowly like tops as they hoist themselves up.\n\n                                PENTCHO (CONT'D)\n                      They come into being as one or the other at\n                      the moment we observe them.   \n\n            His words echo off the giant walls.  \n\n                                PENTCHO (CONT'D)\n                      Nothing is real until it's perceived.\n\n                                MIA\n                      The Buddhists have been saying that for a\n                      millennium.\n\n                                PENTCHO\n                      How?\n\n            Mia reaches an electric box, hanging a yard below the ceiling.\n\n                                MIA\n                      Baby, reality is what you choose to make it.\n\n            She flips the switch.  A set of lights FLARE ON.  Pentcho swallows a\n            breath.  In awe.\n\n                                PENTCHO\n                      God.\n\n            WE SEE WHAT HE SEES: \n\n            A GIANT RENAISSANCE-STYLE FRESCO COVERS THE ENTIRE CEILING. \n\n            Flocks of ANGELS fly above a GODDESS.  Cherubs.  Heralds.  \n\n            Pentcho's face flushes.  He's exhilarated.  She takes note:\n\n                                MIA\n                      But only if you live your life that way.  If\n                      you experience every moment as discovery.  \n\n            Pentcho's already there.  He kicks his legs out.  Joyrides on the tug\n            rope, arcing back and forth like a mad pendulum.\n\n                                PENTCHO\n                      Mia!  You're restoring heaven with dabs of\n                      paint.  You're bringing new order to the\n                      universe.\n\n            She beams from his excitement.\n\n                                MIA\n                      I always said we were in the same\n                      business... \n\n            His wayward motion swings him STRAIGHT INTO HER.  They lock arms. \n            The ropes shudder. \n\n                                PENTCHO\n                      If you're right, we have a chance. (beat) To\n                      be together.\n\n            Pentcho reaches out to kiss her.  Doesn't see that their collision\n            has jogged the clutch on his harness rope.  Now it opens all the way.\n\n            WHOOSH!\n\n            In an instant, he's gripping air, FALLING at the speed of Newton's\n            discovery.\n\n            He hurtles downward in slow motion.  There's a SOUND rushing in\n            behind him, the RUMBLE OF A MEGA-EARTHQUAKE.  \n\n            Pentcho catches a glimpse up over his shoulder: the angels, the\n            goddess, Mia, all of it has been\n\n            SUCKED OUT OF EXISTENCE...\n\n            as Pentcho's eyes stare for a millisecond at \n\n            THE VOID.  NOTHINGNESS.  NADA.\n\n            And then he's FALLING again, accelerating toward his own last\n            particle collision, when a VOICE murmurs from somewhere.\n\n                                VOICE (OC)\n                      I'm not done.\n\n            THWACK!  The safety line holds, dangling Pentcho a meter above the\n            stone floor.\n\n    23d     INT.  XANADU - SOME TIME LATER                         23d\n\n            They camp on old couch cushions, side by side, staring up at the\n            illuminated fresco.  Pentcho is bruised, battered, vulnerable.  \n\n                                PENTCHO\n                      When I was a kid I used to snap my head back\n                      like a gunfighter on the draw, hoping to\n                      catch a glimpse behind me.  \n\n            Mia props her head up on one elbow.\n\n                                MIA\n                      Of what?\n\n            ON THE FRESCO: A CHORUS OF ANGELS \n\n                                PENTCHO\n                      God.  I dunno.  The eternal nothingness. \n                      Mia. \n\n            It's a plea.  She turns, stares directly into his eyes.\n\n                                PENTCHO (CONT'D)\n                      The universe is snapping my head back.  I'm\n                      losing my focus.  \n\n            Mia's face fills with light.  Her best smile.\n\n                                MIA\n                      Welcome, Paul.  Welcome.  \n\n            She traces a line from his forehead to the bridge of his nose,\n            quoting Yeats (from \"The Second Coming\") as a celebration:\n\n                                MIA (CONT'D)\n                      \"Things fall apart; the center will not\n                      hold.  Mere anarchy is loosed upon the\n                      world.\"\n\n            He pulls her close to him.  They lie, spooned together, breathing in\n            unison, gazing up at the painted heaven.  \n\n            A firefly enters from outside, flutters in the air above them,\n            blushing a trace line of yellow light.\n\n                                PENTCHO\n                      An electron spoke to me yesterday.  (beat) I\n                      swear.  \n\n            Mia tries to suppress a giggle.  Can't.  \n\n                                MIA\n                      What did it want?\n\n                                PENTCHO\n                      That's what it asked me.  \"What do you\n                      want?\"  I didn't answer.  I was in the\n                      middle of an experiment.\n\n                                MIA\n                      Like now?  \n\n            He hesitates, then surrenders to the fact.\n\n                                PENTCHO\n                      Yes.  \n\n            The firefly dances above them.  Pentcho sits up (and away from her). \n            Mock serious:\n\n                                PENTCHO (CONT'D)\n                      Did you know electrons have lovers?  \n\n            Mia notes his distance.  Faces him, cross-legged.\n\n                                MIA\n                      No.  I didn't.  (dryly) I'm listening.\n\n                                PENTCHO\n                      Inside every semi-conductor... you have two\n                      particles, with opposite charges, separated\n                      by an impassable barrier...\n\n            She looks, sees him disappear into his head.  \n\n                                PENTCHO (CONT'D)\n                      A strip of silicon, which for you and me\n                      would be like...\n\n            The vulnerability is gone.  And Mia, with it.\n\n                                MIA\n                      She's in L.A., he's in the Bay area --\n\n                                PENTCHO\n                          (plowing ahead)\n                      A five hundred foot thick steel wall.  But\n                      the connection between these two electrons\n                      is so --\n\n                                MIA\n                      Dysfunctional --\n\n                                PENTCHO\n                      That they tunnel, magically, through any\n                      obstacle, defying the practical laws of\n                      physics, in order to end up together --\n\n                                MIA\n                      And glow happily ever after.  \n\n            Silence.  The story hangs between them like a fog.\n\n                                MIA (CONT'D)\n                      Don't science me Paul.  (beat) What do you\n                      want?\n\n            ON PENTCHO'S FACE: It's blank.   \n\n            MIA looks up at the angels, closes her eyes, TURNS AWAY.\n\n            (OMIT SCENES 24, 25, 26, 27, 28)\n\n     29     EXT.  CITY STREET - EARLY MORNING                       29\n\n            The Durango pulls up, stops.  Pentcho gets deposited on the curb. \n            Barely closes the door before the car SPEEDS away.  He looks up. \n            Sees the sign on the bus stop bench:\n                      \"LOVE NEVER FAILS\"  Corinthians 13:8\n\n     30     EXT.  THE BAY AREA - DAY                                30\n\n            Storm clouds gather over the ocean.\n\n     31     EXT.  THE BERKELEY HILLS - POURING RAIN                 31\n\n            A taxi stops in front of a two story cottage, looking abandoned in\n            the wet weather.  Pentcho walks out, passing his dented VW BEETLE in\n            the driveway.  Ascends a flight of brick steps to the:\n\n     32     INT.  PENTCHO'S COTTAGE - ENTERING                      32\n\n            An alternately stark and cluttered space, less lived in than occupied\n            by a man on the run between his office and his mind.\n\n            Rivulets of water run from an open window, across a large desk, and\n            down onto the wood floor.  Pentcho scans around, unfazed.  Locates a\n            towel.  Mops up.  Dries off the computer and keyboard.  Bag still on\n            his shoulder, he fires up the machine and logs \n\n            ON THE COMPUTER SCREEN\n\n            E-mail.  Lots of it.  Hundreds and hundreds of messages scrolling by\n            on the screen.  He turns away, sees his own rain soaked clothes\n            forming a puddle on the floor.  LIGHTNING cascades across the sky,\n            visible through the large bay window behind the desk.  Pentcho's eyes\n            stray back to the screen\n\n            STILL SCROLLING E-MAIL MESSAGES\n\n            as the thunder follows almost immediately.  CRACK!  He looks up: \n            Veins of light pulse outward, branching into a spidery network\n\n            OF GLOWING INTERCONNECTEDNESS\n\n            A voice SOUNDS from somewhere non-local:\n\n                                VOICE (OC)\n                      Paul?  Pauly?\n\n            Pentcho leans toward the glass, looking out as we reverse POV:\n\n            A SINGLE LIGHTNING BOLT descends from the heavens on its own speed-of\n            light path straight at...\n\n            WHOMP!  It strikes the BEETLE dead on -- (SLOW MOTION) -- scorching\n            the roof.  Reverse POV:\n\n            ON PENTCHO - pupils dilated as we surge inward to \n\n     33     INT.  PENTCHO'S BRAIN - (OPENING ON) NIGHT              33\n\n            AN OLDER MAN\n\n            wild, white Einstein hair.  He CLUTCHES suddenly at his chest, like a\n            heart attack victim.  His lips call out, but no voice follows.  He\n            fades, ominously, to black at the sound of\n\n     34     EXT.  THE SKY - (ROARING THUNDER) DAY                   34\n\n            Pentcho blinks once, his face illuminated by a dozen flashes of\n            lightning.  He touches his fingers to the glass:\n\n            A SECOND LIGHTNING BOLT DESCENDS\n\n            on the exact same path toward...  KABOOM!  THE RED BEETLE.\n\n            A plume of smoke rises out of the punctured roof.  \n\n     35     (OMIT)                                                  35\n\n     36     (OMIT)                                                  36\n\n     37     INT.  THE AIRPLANE - NIGHT                              37\n\n            Pentcho sits in his window seat, staring at the open tray table next\n            to him.  There's a glass.  It doesn't move.  \n\n    37a     EXT.  STOCK SHOT - LANDING IN LAX                      37a\n\n            The plane touches down.  We see the landmark spider-restaurant.\n\n     38     EXT.  CAR RENTAL FACILITY - NIGHT                       38\n\n            Pentcho crosses the lot with the rent-a-car EMPLOYEE.\n\n                                EMPLOYEE\n                      Rented every last ve-hicle.  'Cept one.  \n\n                                PENTCHO\n                      I'll take it.\n\n            It's a red 2000 BEETLE.\n\n     39     EXT.  THE 110 FREEWAY - NIGHT                           39\n\n            The sign says: \"Hollywood - North.  Long Beach, San Pedro - South.\"\n\n     40     EXT.  SAN PEDRO/HOUSE - NIGHT                           40\n\n            The rain has stopped.  The red bug parks in front of a\n\n            GRAND HOUSE GONE TO SEED.  \n\n            Ditto the neighborhood.  A 7-Eleven sign blinks on the corner.\n            Pentcho walks up the cracked sidewalk to a sagging wooden porch.  \n            Looks for signs of life.  A light.  Something.  \n\n            He pushes on the front door.  Locked.  Rummages through his key ring\n            in the dark.  Slides one into the top lock.  Won't turn.\n            Tries another key.  Gets stuck.  He pulls it out.  Presses his face\n            close against the window.\n\n            TIRES SCREECH.  POLICE SIRENS BLARE.  \n\n            Pentcho turns, his EYES lit by the flashing bubble lights.  \n\n     41     INT.  THE BRAIN FIELD - POPPING OPEN ON                 41\n\n            THE EINSTEIN MAN\n\n            Crumpled on the floor, hands still clutching his chest.  The screen\n            COLLAPSES at the sound of \n\n     42     EXT. HOUSE (VOICES SHOUTING FROM THE CORNER) - NIGHT    42\n\n            Foreign voices, jabbering at high speed.  Policemen BARK BACK on\n            loudspeakers.  Walkie-talkies.  \n\n            Pentcho RAPS ON THE GLASS.  He's frantic.  Harder now.  A THUNK\n            sounds from inside.  Or was it?  He picks one last key out in the\n            glare of the blue lights.  Jams it in the lock.  Twists and\n\n     43     INT.  THE HOUSE - PENTCHO                               43\n\n            bursts into the darkened foyer.  His foot catches on a thick doormat. \n            He SPRAWLS forward as\n\n            A GUNSHOT ERUPTS ABOVE HIS HEAD\n\n            He drops, convulsed with fear.  Snaps his head back to see:\n\n            THE EINSTEIN MAN (ALEXANDER)\n\n            in bathrobe and slippers, hands shaking around a shotgun.\n\n                                ALEXANDER\n                      Paul... Pauly... \n\n            Pentcho struggles to breathe.  Staccato:\n\n                                PENTCHO\n                      I... I thought you were dead.\n\n            Alexander drops the gun.  In shock, a whisper:\n\n                                ALEXANDER\n                      I must be.  \n\n     44     INT.  BAR AREA (A TEA KETTLE WHISTLES) - NIGHT          44\n\n            Alexander, recomposed, marches to the burners.  There's anger in his\n            every movement.  Restlessness.  This is no feeble old man.  He pours\n            tea like he was filling shot glasses.  Doubles.\n\n                                ALEXANDER\n                      Look at me.  \n\n            Pentcho stirs in a lump of sugar first.  Raises his eyes.  \n\n                                ALEXANDER (CONT'D)\n                          (contemptuous)\n                      \"Alexander the Great.\"  \n\n            He lifts a kitchen chair, spins it around, straddles the back.  \n\n                                ALEXANDER (CONT'D)\n                      22 I built the first machine to transfer\n                      digital bits over a land line.  I wrote the\n                      TCP/IP protocol before thirty.  This mind\n                      (tapping his temples), the one and only, was\n                      OBGYN at the birth of the Internet.  And\n                      where has it taken me?  \n\n            He shoots upright.  Peers out the row of double sash windows, covered\n            by impenetrable iron grates.  \n\n                                ALEXANDER (CONT'D)\n                      To isolation.  To an armed camp.  To a\n                      biblical spoof of a crazed father firing a\n                      gun at his only son. \n\n                                PENTCHO\n                      You taking any medication?\n\n            Alexander's eyes FLARE in anger.  \n\n                                ALEXANDER\n                      Don't waste it Pauly.  This is not an\n                      everyday talk.  Just input the information\n                      and ask relevant questions.  One: how did a\n                      celebrated life of the mind bring me\n                      (pulling the gun out) to this particular\n                      switching station?\n\n                                PENTCHO\n                      Dad...\n\n            He shoves the shotgun into an open trash can.\n\n                                ALEXANDER\n                      Two: what if I didn't miss?  \n\n                                PENTCHO\n                      You did.\n\n                                ALEXANDER\n                      Spare me your classical answer. \n                      Measurements in.  Results taken.  What if I\n                      didn't miss?  \n\n                                PENTCHO\n                      You did miss --\n\n                                ALEXANDER\n                      -- What if your seven and a half precious\n                      liters were downloading over the parquet\n                      floor?  What then?  (softer) What did your\n                      life mean? (beat) Who did you nurture,\n                      Pauly?  Who did you love?\n\n            Pentcho shifts, uncomfortably, in his seat.  Ditto Alexander's mood. \n            He does a startling one-eighty into nonchalance.   \n\n                                ALEXANDER (CONT'D)\n                      What was her name?\n\n                                PENTCHO\n                      Excuse me???\n\n                                ALEXANDER\n                      What was her name?  The one I met.\n\n            Alexander reaches out a finger, touches the dab of paint on Pentcho's\n            forehead.\n\n                                PENTCHO\n                      Mia...?\n\n                                ALEXANDER\n                      Yes.... \n\n            He rubs the paint between his fingers. \n\n                                ALEXANDER (CONT'D)\n                      The restorer...\n\n            Now he wanders off, disappears into the dark.\n\n            ON PENTCHO: wired, incredulous, heart thump thump thumping.  \n\n            He calls out after his father.  \n\n                                PENTCHO\n                      I need some air. (beat) Don't shoot me.  \n\n                                ALEXANDER'S VOICE (OC)\n                      Good night.  \n\n            INT.  ALEXANDER'S HOUSE - A SHORT TIME LATER\n\n            Pentcho paces in front of the open window, stops.  He turns to walk\n            out, is surprised by\n\n            ALEXANDER\n\n            Standing in the dark.\n\n                                ALEXANDER\n                      We've been kidding ourselves, Pauly.  Until\n                      you look for it, it doesn't even exist.  \n\n     45     EXT.  SAN PEDRO WHARF - NIGHT                           45\n\n            Pentcho slogs down the wharf.  Running from it.  Looking for it. \n            Past homeless people slipping in and out of the shadows.  He snaps\n            his head back over his shoulder, sees an OLD WOMAN playing  the\n            accordian.  She stops.  Her eyes bore in on his own. \n\n                                OLD WOMAN\n                      You would have a son with me...\n\n            Pentcho blinks.  The woman is suddenly FIFTY YEARS YOUNGER:\n\n                                YOUNG OLD WOMAN\n                      ...and his name would be Hope.\n\n     46     INT.  PENTCHO'S BRAIN - (A MATHEMATICAL FORMULA)        46\n\n            Numbers fly up on the field, are inscribed, erased, considered and\n            measured.  Pentcho's own VOICE is heard on overlap:\n\n                                PENTCHO'S VOICE\n                      \"If you could look back fast enough, at near\n                      to the speed of light, then there would be\n                      no reality behind you, because it hadn't yet\n                      been created --\n\n     47     EXT.  THE WHARF - (A FOGHORN) NIGHT                     47\n\n            BELLOWS in the dark.  Pentcho twists his head forward, spots:\n\n            A PINK NEON HEART\n\n            blinking above a tatto parlor.  His eyes lock on, see the heart \n\n            GLOWING BIGGER AND BIGGER, \n\n            its electric pulse mimicing the beating of a real organ.  \n\n            CLOSER STILL - ON PENTCHO\n\n            Running from it.  Looking for it.  He stops dead in his tracks, tries\n            one last time to play gunfighter with the quantum reality:\n\n            HE SNAPS HIS HEAD BACK OVER HIS SHOULDER\n\n            and we see him, making the same move, from four different camera\n            angles: from his LEFT, his RIGHT, from the TOP OF HIS HEAD, and\n            looking up FROM GROUND ZERO as \n\n            HE FINALLY WINS THE DRAW.\n\n            The RUMBLE OF A MEGA-EARTHQUAKE is unleashed.   Here it comes,\n            rolling in with a giant WHOOSHING SOUND...\n\n            POV PENTCHO: WATCHING REALITY SUCKED OUT OF EXISTENCE\n\n            The ships, the dock, the harbor OBLITERATED by an onrushing,\n            transparent cloud of NOTHINGNESS, EMPTINESS, a tabula rasa\n            superimposed upon the disappeared wharf.  \n\n            ON PENTCHO, FALLING TO HIS KNEES\n\n            hammered by his own victory, numb from shock and ecstasy, staring\n            into the void as we surge forward \n\n     48     INT.  THE BRAIN FIELD                                   48\n\n            It's completely blank, just like the void.  The VITALS are flatlined. \n            A single piece of thought text floats across the emptiness, almost\n            like a screen saver:\n                      Say Uncle.... Say Uncle...\n\n     49     EXT.  THE WHARF - (A VOICE) - NIGHT                     49\n\n                                VOICE\n                      Uncle, hey... \n\n            A face, peering down at Pentcho.  The face belongs to the MAGIC MAN,\n            in a mad hatter hat, and a potpourri of found item clothing.  Like a\n            Baptist preacher on his sidewalk pulpit:\n\n                                MAGIC MAN\n                      Can you feel it, uncle?  Can you feel it\n                      right down to your bones?!  \n\n            ON PENTCHO: EXTREME CLOSE UP\n\n            Inside each pupil is the reflection of the NEON HEART.  We pull back\n            on Pentcho's face.  Calm.  Serene.\n\n                                PENTCHO\n                      Yes.  (beat) Yes I can.\n\n     50     EXT.  ALEXANDER'S HOUSE - NIGHT                         50\n\n            Pentcho turns the key, effortlessly opens the front door.\n\n            INT.  UPSTAIRS HOUSE - AN ORNATE TILE SHOWER - NIGHT\n\n            He stands beneath the stream of hot water, cleansing himself of a day\n            that began a very long time ago.\n\n            INT.  THE GUEST BEDROOM - NIGHT\n\n            Pentcho dresses, taking in the smell and texture of fresh clothes\n            against his body.  He sits down on the bed.  Sees a clock.  5:00 a.m. \n            TUGS UP one of the double sash windows that faces the 7-Eleven. \n            VOICES rise from the parking lot.  \n\n            Pentcho stretches out on the musty bedspread, eyes on the carved\n            plaster ceiling.  Suddenly, floating up through the open window:  \n\n                                WOMAN'S VOICE\n                      What do you want?!  \n\n            Pentcho cranes his head.\n\n                                WOMAN'S VOICE (CONT'D)\n                      Tell me!  Now!  Now!  \n\n            The old sash falls shut.  BOOM.  It's like a dam bursting inside him,\n            only the flood is LAUGHTER that starts deep in his belly, as a\n            giggle, then a chuckle that cascades upward and out into enormous\n            GUFFAWS.  The sound rocks the house.  Pentcho's smile is a mile wide. \n            His eyes sparkle, then tear up as the\n\n            FRONT DOORBELL RINGS\n\n            He jumps off the bed, and bounds down the stairs.  \n\n     53     INT. THE FRONT HALL - NIGHT                             53\n\n            Alexander's already there, ushering MIA inside to:\n\n     54     INT.  THE LIVING ROOM - AT THE MOMENT THAT              54\n\n            Pentcho arrives.  He stops, incredulous, at the sight of her.  \n\n                                ALEXANDER\n                      Guess who's coming to dinner.\n\n            Mia jumps right in.  To Pentcho:\n\n                                MIA\n                      I didn't want to leave things the way we\n                      did.  Not this time.\n\n                                PENTCHO\n                      Wait.  I want to tell you something.\n\n            He takes her arm, steering her away from Alexander, into the living\n            room.  She stops cold at the sight of the MURAL.\n\n                                MIA\n                      I've been dreaming about this.\n\n                                PENTCHO\n                          (excited)\n                      Then you get it.  You'll understand.\n\n                                MIA\n                      What?\n\n            His face has the look of the little boy who has just stumbled upon\n            the pirate's treasure.  \n\n                                PENTCHO\n                      I know what I want.  I let go, and a second\n                      later you materialized at the door.  You\n                      see?  \n\n            CLOSE ON PENTCHO\n\n            feeling the feelings.\n\n                                PENTCHO (CONT'D)\n                      Mia.  I can create reality.  (beat) I can\n                      choose to love you with all my heart.  \n\n            Tears pool along the rims of her eyes.  She stares straight at him,\n            hiding nothing.\n\n                                MIA\n                      You know those people who won't be\n                      photographed because they're afraid you're\n                      stealing their souls...?  \n                          (long beat)\n                      I came to take back my picture.  The one I\n                      keep leaving with you.\n\n            His heart deflates.  His voice follows.  Barely audible:\n\n                                PENTCHO\n                      Why?\n\n                                MIA\n                      So I can move on.  You too.\n\n            A horn blares from outside.\n\n                                MIA (CONT'D)\n                      Be who you are, Paul.  I love who you are. \n                      I do.\n\n            She turns and runs out the front door.\n\n     55     EXT.  ALEXANDER'S HOUSE - SECONDS LATER - NIGHT         55\n\n            Mia runs down to the curb where where boyfriend WILL holds open the\n            passenger door of the red Durango.\n\n                                MIA'S VOICE\n                      I'll drive.\n\n            She circles the car, disappears behind the wheel.  Will gets in his\n            side.  \n\n            ON THE FRONT PORCH\n\n            Pentcho, agitated, pushes open the door.  Alexander's already\n            outside, watching Mia motor off.  He turns, stares at his son.\n\n                                ALEXANDER\n                      Do you want to think about it some more?  \n\n            PENTCHO SPRINTS DOWN TO THE CURB.  Jumps into the Beetle.  The\n            headlights FLASH ON in the pre-dawn night.\n\n     56     INT.  THE DURANGO (DRIVING) - NIGHT                     56\n\n            Mia grips the wheel with two hands.  Will feigns nonchalance. \n\n                                WILL\n                      You okay?\n\n            She nods.  Barely.  They merge onto the highway. \n\n     57     INT.  THE BEETLE (DRIVING) - NIGHT                      57\n\n            Pentcho grips the wheel.  Eyes focused.  We surge into \n\n     58     INT.  PENTCHO'S BRAIN FIELD - OPENING ON                58\n\n            PEARLS, PLAYING OUT, LOOPING INTO A STRING \n\n            whose shape recalls the original brain field.  Thought text scrolls\n            below, accompanied now by Pentcho's own inner voice.\n\n                                VOICE AND TEXT\n                      Each part of physical reality is constructed\n                      of all the other parts...\n\n            EXTREME CLOSE-UP, ON A SINGLE PEARL\n\n            inside of which, the entire strand is reflected.\n\n                                VOICE AND TEXT (CONT'D)\n                      A web of connections created by the\n                      interdependence of all things...\n\n            The field collapses back into:\n\n     59     INT.  MIA IN THE DURANGO (DRIVING) - NIGHT              59\n\n            eyes on the rear view mirror, as a horn BLARES from the entrance to\n            the Long Beach bridge.\n\n            She re-checks the mirror, filled with bobbing headlight beams.  One\n            beam LOCKS ON, straight into the center of the glass, blinding her\n            for a split second.  She blinks.  Gasps to herself as the beam seems\n            to \n\n            LIFT OUT OF HER MIRROR \n\n            and train its phosphorescent glow on:\n\n            MIA - EXTREME CLOSE UP\n\n            the point of light reflecting out of her pupils.  PENTCHO'S VOICE\n            speaks from nowhere, sonorous and packed with reverb:\n\n                                PENTCHO'S VOICE\n                      What do you want?\n\n            Mia blinks again.  The beam is gone.  She looks over at WILL,\n            oblivious, checking his watch. \n\n            BACK ON MIA\n\n            the understanding flooding her eyes as \n\n            SHE SNAPS HER HEAD BACK (JUST LIKE PENTCHO THE GUNFIGHTER)\n\n            And we see her making her move from FOUR DIFFERENT CAMERA ANGLES,\n            from her left, right, up above, and from the back seat of the car as\n            the RUMBLE OF A MEGA-EARTHQUAKE WHOOSHES BY...\n\n            POV MIA: THE BRIDGE, THE CARS, THE BAY\n\n            all sucked out of existence until nothing remains but         \n\n            THE VOID.  NOTHINGNESS.  NADA.   CRASH!\n\n     60     INT.  THE DURANGO (SLAMMING INTO THE CAR AHEAD) - NIGHT 60\n\n            triggering a chain reaction of vehicles fish-tailing across the\n            bridge.  In quick succession come a STREAM OF IMAGES:\n\n            The pearls colliding...\n\n            Mia and Will exchanging a LOOK...\n\n            Traffic HALTING on the bridge...\n\n            Will getting SCORCHED by the MAN they plowed into...\n\n            Mia, exiting her side, looking BACK BEHIND HER...\n\n            PENTCHO, ditching his Beetle, ten car lengths south...\n\n            HE RUNS FORWARD, straight down the path of a tunnel-like headlight\n            beam.  \n\n            MIA PICKS UP SPEED, churning from the other direction.  \n\n            PULL BACK: FROM THE BRIDGE\n\n            as the two of them move toward the same point.  Suddenly, tiny sparks\n            of light GLOW and JUMP from portions of the bridge cable.\n\n            SLOW MOTION: PENTCHO AND MIA\n\n            gliding still closer.  A VOICE sounds:\n\n                                VOICE\n                      Impact!\n\n            Their bodies CONNECT, arms intertwine, lips touch lips...\n\n            PULL BACK - HIGHER\n\n            It's like a plug in the socket of the physical landscape\n\n            LIGHTING THE ENTIRE ELECTROMAGNETIC SPECTRUM\n\n            Every cell line, radio wave, satellite feed, fiber-optic cable, all\n            stretching in every possible direction \n\n            FROM BRIDGE TO SEA TO SKY\n\n            pulsing outward into a spidery network of\n\n            GLOWING INTERCONNECTEDNESS. \n\n                                     THE END\n\n\n\n\n\n\nQuantum Project\nWriters :   David Aaron Cohen\nGenres :   Drama  Short\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:33:29.059700"}