{"title": "Rambling Rose", "film_link": "/Movie Scripts/Rambling Rose Script.html", "script_link": "/scripts/Rambling-Rose.html", "info_raw": "\n\nRambling Rose Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Calder Willingham\nGenres  Drama\n\nRead \"Rambling Rose\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nRambling Rose - by Calder Willingham\n\n\n\nFADE IN:\n\nEXT. DELTA TERMINAL - KENNEDY AIRPORT - DAY\n\nOn a taxi arriving at the Delta terminal of Kennedy Airport.\nA man in a well-tailored gray suit gets out of the taxi.\n\nCUT TO a CLOSER SHOT of the man as he pays the cabbie. He is\nWILLCOX HILLYER, the middle-aged \"Buddy\" of this story and\nthe observer through whose eyes it is seen. He has a dry,\nironic, rather agreeable manner and he should seem like\neveryone's idea of a successful author, a slightly graying,\ntrim, still-youthful-looking fifty. The CAMERA follows him as\nhe walks into the terminal carrying a small travel bag.\n\nINT. DELTA TERMINAL - KENNEDY AIRPORT - DAY\n\nCUT TO a shot of Willcox Hillyer at a counter getting his\nticket processed. A little smile is on his face as he talks\nto a pretty airline girl. This character likes girls; his\naloofness is modified, his face changes when he talks to\nthem. The airline girl smiles back, she finds him attractive.\nWe don't hear what they are saying, no dialogue on track --\nit is obvious he is flirting with the girl in a mild way, but\nnow a frown comes on his face and he turns his head as if\nslightly annoyed by something.\n\nCUT TO a POV shot of a tall, gaunt, almost totally bald man\nat the next ticket counter. The man is about sixty-five and\nlooks like a half senile Great Dane. He is DAVE WILKIE,\nerstwhile husband of the heroine of this story. Age has not\nbeen at all kind to Dave; his face is lined with bitterness,\nhe is a sour, angry, lonely man and now he is making a very\nunpleasant scene with a ticket girl and an airline\nrepresentative, waving his ticket and gesticulating angrily.\nHe wears an expensive, ill-fitting suit and a Texas-type hat.\nWe don't hear his angry complaints, no dialogue is on the\ntrack.\n\nCUT BACK to a CLOSE SHOT of Willcox Hillyer as he stares with\na frown at the man. It's as if he knows the man but can't\nplace him. The airline ticket girl speaks to him and he turns\nback to her, his face softening as he answers her, obviously\nsaying he'll carry his bag. He nods goodbye to the girl,\nturns and the CAMERA follows him as he walks some distance\naway and stops, looks back with another pensive frown at the\ntall, gaunt man at the next counter.\n\nCUT TO ANOTHER POV shot of Dave Wilkie, a longer shot than\nthe first. The man is now arguing angrily with two airline\nrepresentatives, still waving his ticket and shaking his\nhead. We don't hear him. Lip-readers might pick up what he is\nsaying: \"I'm supposed to be in first class, not tourist.\nWhat's the matter with this friggin' airline?\"\n\nCUT BACK TO Willcox Hillyer, a CLOSE SHOT of his face as he\nrubs his chin and frowns obviously struggling to remember the\nman. The CAMERA holds on him as he stares at the gaunt angry\nDave, racking his brain. He shakes his head, he cannot place\nthe man and yet he knows him. The CAMERA moves in closer on\nWillcox Hillyer's face as he stares in pensive puzzlement at\nthis ghost from the past and now we hear, as if from a\ndistance, FAINT MUSIC on the track -- it is \"Dixie,\" played\nwith beautiful lazy mocking love by the great Louis Armstrong\nin his prime. At first we can barely hear it, then the MUSIC\nbecomes LOUDER as Hillyer's frown deepens and he seems almost\nto know the man.\n\nMAIN TITLE (SUPERIMPOSED): \"RAMBLING ROSE\"\n\nThe MUSIC remains a bit in the distance, but it can be heard.\n\nOTHER TITLES (SUPERIMPOSED): over the following action.\n\nVARIOUS SHOTS, on Willcox Hillyer. He gives up his effort to\nrecognize the strangely familiar Dave with a little shrug,\nturns and walks away with his travel bag.\n\nINT. DELTA TERMINAL - LOUNGE - DAY\n\nWe see him entering the departure lounge and boarding the\nplane.\n\nINT. DELTA AIRPLANE - DAY\n\nA shot of him as he smiles rather nicely at a very attractive\nyoung stewardess as he walks down the aisle of the plane. He\nis not a crass or lewd flirt, but life comes into his face\nwhen he sees a pretty girl -- he seems to have a real\naffection for girls: toward men he is polite but rather dry\nand ironic, almost aloof, but girls he likes. We see him sit\nin a seat, open his travel bag and take out long galley\nsheets. He stares for a moment rather wearily at the galleys,\nthen sighs, puts on reading glasses and begins to make\ncorrections as boarding passengers walk by in the aisle.\n\nSomething or someone disturbs him, he looks up with a slight\nfrown and CUT TO a POV shot of Dave Wilkie, all wonder and\nenthusiasm. This OVER the TITLES and we do not hear the\ndialogue they speak, what we heard is LOUIS ARMSTRONG, but I\nwill put the dialogue in here so the actors can act it. We do\nnot want to hear it, the sense of what they are saying will\nbe obvious from the acting.\n\n\t\t\tDAVE WILKIE \n\t\t(not on track)\n\tBuddd-dee! My God, if it ain't\n\tBuddy! Well, if this ain't the\n\tdarnest thing!\n\nANOTHER ANGLE, on them both as Dave blocks the aisle, an\nidiot false-toothed grin on his face. Hillyer has a pained\nembarrassed smile.\n\n\t\t\tWILLCOX HILLYER \n\t\t(not on track)\n\tExcuse me... your voice is familiar\n\tand I'm sure I know you from\n\tsomewhere...\n\n\t\t\tDAVE WILKIE \n\t\t(not on track, with\n\t\t delighted injury)\n\tAwww-rr, Buddy, come on, you know\n\tme!\n\n\t\t\tWILLCOX HILLYER \n\t\t(not on track)\n\tWell, I... I... ah-h, let's see...\n\n\t\t\tDAVE WILKIE \n\t\t(not on track)\n\tIt's Dave Wilkie! I'm Dave Wilkie,\n\tdon't you remember me?\n\n\t\t\tWILLCOX HILLYER \n\t\t(not on track)\n\tOh. Oh, God. Of course, Dave, how\n\tare you?\n\nThe men shake hands, Dave enthusiastically, Hillyer less so.\nWe see Dave stow his suitcase and take the seat next to\nHillyer.\n\nEXT. KENNEDY - DAY\n\nCUT TO a shot of a big Delta jet making its final taxiing\nturn and ROARING into a take-off.\n\nINT. KENNEDY - DAY\n\nCUT TO a dramatic underbelly shot of the jet going up.\n\nEND OF TITLES.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. DELTA AIRPLANE - DAY\n\nA shot of the attractive, young stewardess, harried as she\nfixes drinks.\n\nINT. DELTA AIRPLANE - DAY\n\nCUT TO Dave and Willcox Hillyer as the young stewardess gives\nthem drinks. Dave bestows a sour glance on her when he sees\nthe single drink, but at the moment he is in the midst of an\naggressively self-satisfied conversation and says nothing to\nher. He speaks to Hillyer, who is making a real effort to be\npolite but is less than happy about the encounter.\n\n\t\t\tDAVE WILKIE \n\tWell, I am in the construction\n\tbusiness, Buddy, and without\n\tbraggin' I have done real good at\n\tit. \n\t\t(with a meaningful\n\t\t bitterness)\n\tThere are those who wouldn't have\n\texpected that out of me. \n\t\t(pauses as if waiting for\n\t\t a reaction, but Hillyer\n\t\t is very silent)\n\tRight now I'm buildin' a giant\n\tmotel unit near Alexandria, outside\n\tWashington, D.C. Not fi-nance, I'm\n\ton the construction side.\n\n\t\t\tWILLCOX HILLYER \n\t\t(making polite talk)\n\tWell, that's interesting, Dave. I\n\talways liked Washington, it's a\n\tpretty town.\n\n\t\t\tDAVE WILKIE \n\tOh, it's all right, beats Jew York.\n\tBut the niggers have took it over,\n\tjust like every other city we got,\n\tonly worse.\n\nHillyer gives a barely perceptible wince at this speech, but\nDave doesn't notice, he goes on with aggressive self\nsatisfaction after a swallow of whiskey.\n\n\t\t\tDAVE WILKIE (CONT'D)\n\tBut I have done real good in the\n\tconstruction field. What I don't\n\tknow about buildin' ain't worth\n\tknowin'. I knocked off twenty-eight\n\tthousand smackeroos last year,\n\thow's that for an old country boy?\n\nDave pauses, realizes this might not impress; glances down\nwith curiosity at the galley sheets, then an unpleasant\nsmile.\n\n\t\t\tDAVE WILKIE (CONT'D)\n\tHa ha, course you make a lot more. \n\t\t(points at the galleys)\n\tWhat's that you got there, Buddy?\n\n\t\t\tWILLCOX HILLYER \n\t\t(reluctantly)\n\tGalley proof.\n\n\t\t\tDAVE WILKIE \n\tGalley what?\n\n\t\t\tWILLCOX HILLYER \n\tPage proof of a book I'm working\n\ton.\n\n\t\t\tDAVE WILKIE \n\tHow about that. Well, you always\n\twere a screwball.\n\n\t\t\tWILLCOX HILLYER \n\t\t(lifts an eyebrow in mild\n\t\t irony)\n\tOh, yeah?\n\n\t\t\tDAVE WILKIE \n\t\t(unfazed)\n\tI don't mean that the way it\n\tsounds. \n\t\t(stares at galleys as if\n\t\t rattlesnake)\n\tImagine it, a book. And I used to\n\tknow you personal way back when.\n\t\t(pauses, then earnestly)\n\tTell me something, Buddy, how do\n\tyou dream up all that stuff?\n\n\t\t\tWILLCOX HILLYER \n\t\t(absolutely straight)\n\tWell, actually, we have a little\n\tblack boy named Her---t who lives\n\tin the garage. He does it for me.\n\n\t\t\tDAVE WILKIE \n\t\t(for a moment half\n\t\t believes it, then a slow,\n\t\t stupid grin)\n\tHeh heh heh heh, same old Buddy,\n\talways jokin' around. Almost as\n\tmuch of a joker as your Daddy. \n\t\t(drains his drink,\n\t\t grimaces; a heavy\n\t\t drinker, Dave)\n\tI saw your Daddy a coupla years\n\tago, I was up in Glenville lookin'\n\tat a motel site. I guess that's\n\twhere you're headed, huh, to see\n\thim?\n\n\t\t\tWILLCOX HILLYER \n\t\t(stares out of plane\n\t\t window)\n\tThat's right, Dave, I'm headed for\n\tGlenville on a whisperin' jet.\n\n\t\t\tDAVE WILKIE \n\t\t(suddenly calls out)\n\tHey, girl! Hey, you, give us\n\tanother drink! \n\t\t(to Hillyer, sullenly)\n\tDumb little bitch, supposed to give\n\tus two in the first place.\n\nWillcox Hillyer listens with a pained half smile, a hand at\nhis temple.\n\n\t\t\tDAVE WILKIE (CONT'D)\n\tThis friggin' airline's out of its\n\tmind. \n\t\t(a martyr)\n\tThe sons of bitches tried to put me\n\tin tourist.\n\t\t(portentuously\n\t\t philosophical)\n\tBut our whole civilization is\n\tscrewed up, Buddy. The heebies and\n\tthe coconuts have took it over and\n\truined it.\n\nWillcox Hillyer half closes his eyes in weariness, but says\nnothing. Gently, he rubs his temple. It is plain Dave Wilkie\ngives him a headache.\n\nINT. DELTA AIRPLANE\n\nANOTHER ANGLE, on the pretty young stewardess as she brings\ntwo more drinks. Dave stares sourly at her, wholly unmoved by\nher charm.\n\n\t\t\tDAVE WILKIE \n\tTook your time gettin' here.\n\n\t\t\tWILLCOX HILLYER \n\tShe has other things to do, Dave.\n\nWillcox smiles apologetically at girl.\n\n\t\t\tDAVE WILKIE \n\tSupposed to get two drinks in the\n\tfirst place. This friggin' airline\n\tcan't do nothin' right.\n\nThe stewardess purses her lips at Dave, who is bowed over his\ndrink busy opening it. Hillyer lifts an eyebrow at the girl\nas if to say, \"Don't blame me because of this damned idiot,\"\nand she half smiles at him.\n\n\t\t\tWILLCOX HILLYER \n\t\t(obviously getting him off\n\t\t subject)\n\tTell me about that job in\n\tAlexandria, Dave, the big motel\n\tyou're building.\n\n\t\t\tDAVE WILKIE \n\t\t(with pedantic exactitude,\n\t\t the man is a complete\n\t\t pain in the ass)\n\tNear Alexandria. It isn't in\n\tAlexandria, it is outside it.\n\n\t\t\tWILLCOX HILLYER\n\tI see. Outside it.\n\n\t\t\tDAVE WILKIE\n\tThat's correct -- outside it, not\n\tin it. As for the job, well, the\n\tJewboy suppliers give me a lot of\n\tgrief and we use a pile of niggers\n\tto haul and tote and they ain't\n\tworth a sorry-ass damn. \n\t\t(takes big swallow of\n\t\t drink)\n\tBut I can build anything, Buddy.\n\tGive me the plans and I can build a\n\tgoddamn staircase to the moon. It's\n\ta fact, I can build anything... \n\t\t(pauses, then bitterly)\n\t... but she never believed that.\n\tOh, hell, no, she never believed in\n\tme.\n\nThis is another pointed bitter reference to the unknown\n\"she.\" Once again, Willcox Hillyer is deliberately\nunresponsive.\n\n\t\t\tWILLCOX HILLYER\n\tUm-m, well...\n\n\t\t\tDAVE WILKIE \n\t\t(broodingly)\n\tDoubted my ability all along, the\n\tlittle bitch. I never remarried,\n\tBuddy, you know that, don't you?\n\n\t\t\tWILLCOX HILLYER \n\tWell, no, I didn't actually.\n\n\t\t\tDAVE WILKIE \n\tShe's te reason -- cured me of\n\twomen once and for all. Oh, I got\n\trid of her, Buddy, I didn't waste\n\tno time kickin' that bitch out.\n\tHell, she was screwin' everybody in\n\tSavannah. I caught her in a motel\n\twith this long tall son of a bitch\n\tand boy did I beat the everlastin'\n\tpiss out of him!\n\nDave Wilkie's eyes narrow with vindictive anger as he says it\nand one can well believe the streak of raw violence in the\nman. It is frightening even now; he is a clown, but he is a\ndangerous clown. As his long, bitter, impassioned tirade\ncontinues, Willcox Hillyer becomes increasingly tense and\npale -- it is obvious he detests what the man is saying and\nhe is struggling to control himself.\n\nDave's tone and voice are laconically Southern, but the\nhatred and misery in his eyes are raw.\n\n\t\t\tDAVE WILKIE (CONT'D)\n\tShe didn't marry him, though, later\n\tshe married another guy and went to\n\tWinston-Salem. It didn't last\n\tThat girl couldn't have no lastin'\n\tmarriage, she left him and married\n\tanother dumb sucker and went out\n\twest. Little bitch left him, too,\n\tand you know what she's married to\n\tright now?\n\t\t(puts a big finger on\n\t\t Hillyer's chest)\n\tA kike. That's right, some kind of\n\tkike horse doctor named Schapiro\n\tout in Seattle, who's got the nerve\n\tto have the same first name I got.\n\tWouldn't you know it, Rose would\n\twind up married to a goddamn kike?\n\tShe was always out of her friggin'\n\thead and I'll tell you why.\n\t\t(his eyes narrow and again\n\t\t he puts a finger on\n\t\t Hillyer's chest)\n\tBuddy, she was sick in her mind and\n\tbetween her legs, too. She was\n\ta nymphomaniac.\n\n\t\t\tWILLCOX HILLYER\n\t\t(he has had enough; with a\n\t\t pale trembling anger and\n\t\t in even tone)\n\tDave, you are as full of shit as a\n\tChristmas turkey and you know it.\n\tNow if you want to start a fight on\n\tthis plane and get yourself in\n\tjail, go right ahead. But I am\n\ttelling you, you are full of shit\n\tright up to your eyeballs.\n\n\t\t\tDAVE WILKIE \n\t\t(with surprising mildness;\n\t\t a little smile almost as\n\t\t if he is pleased)\n\tI don't want to start no fight with\n\tyou, Buddy. Why do you say I'm full\n\tof shit?\n\n\t\t\tWILLCOX HILLYER \n\tDave Schapiro is no horse doctor\n\tand Rose has been a good wife to\n\thim for a long time. To call her a\n\tnymphomaniac is the most stupid\n\tthing I ever heard in my life.\n\n\t\t\tDAVE WILKIE \n\t\t(again surprisingly mild)\n\tYou loved her, didn't you. Well, so\n\tdid I. \n\t\t(a little shrug)\n\tYou'll have to admit she had four\n\thusbands.\n\n\t\t\tWILLCOX HILLYER \n\tYeah, it took her a while to grow\n\tup and find Mr. Right, but she did\n\tit. She found him.\n\n\t\t\tDAVE WILKIE \n\t\t(another little smile)\n\tShe used to call me Mr. Right.\n\tRemember that, Buddy?\n\n\t\t\tWILLCOX HILLYER \n\t\t(he is pale with anger)\n\tYeah, I remember it.\n\nWillcox picks up galley sheets, half turns away.\n\n\t\t\tDAVE WILKIE \n\tWell, I tell you, I don't know what\n\tthe world's come to these days.\n\tThings used to be better. We didn't\n\thave any money, but things were\n\tbetter. \n\t\t(grimaces in anger)\n\tGoddamn niggers and kikes burning\n\tthe flag, rioting, raising hell --\n\tthey ought to shoot their asses\n\toff. I tell you, Buddy, where this\n\tcountry made its mistake was\n\tallowing people without property to\n\tvote.\n\nDuring this speech, Willcox Hillyer grits his teeth but says\nnothing. He keeps his eyes down on the galley sheets. As Dave\nshakes his head in sorrow at the state of the nation ..\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. ATLANTA TERMINAL - HERTZ COUNTER - DAY\n\nA shot of Willcox Hillyer at a Hertz Counter in the Atlanta\nairport. A tense, wrought up Dave Wilkie is in the b.g. of\nthe shot. During the following brief exchange, Hillyer is\npolitely cool, Wilkie under a great strain.\n\n\t\t\tDAVE WILKIE \n\t\t(holds out hand)\n\tWell, got to get a plane to\n\tSavannah. Great running into you,\n\tBuddy. Give my best to your Daddy.\n\n\t\t\tWILLCOX HILLYER \n\tYeah, I'll do that, Dave.\n\n\t\t\tDAVE WILKIE \n\t\t(sweating, tense, under\n\t\t some kind of awful\n\t\t emotional strain)\n\tAh-h, if you happen to run into\n\tRose sometime... do me a favor,\n\tgive her a message for me, will\n\tyou?\n\n\t\t\tWILLCOX HILLYER \n\t\t(a trifle wearily)\n\tDave, I haven't seen Rose for\n\tyears.\n\nHillyer takes rental car papers from a pretty young HERTZ\nGIRL, gives the girl a little smile, picks up his travel bag.\nIn desperation, Dave takes his arm.\n\n\t\t\tDAVE WILKIE \n\tBuddy, I'm a sick man. I had a\n\theart attack last year, I wasn't\n\texpected to live.\n\nHillyer turns to Dave, puzzled and interested; Dave earnestly\nexplains.\n\n\t\t\tDAVE WILKIE (CONT'D)\n\tYou might see her. She writes your\n\tDaddy, and she and that doctor came\n\tto see him, didn't they? I wish\n\tyou'd tell her something... I never\n\tcould write letters.\n\n\t\t\tWILLCOX HILLYER \n\t\t(in a different tone,\n\t\t interested, curious)\n\tWhat do you want me to tell her,\n\tDave?\n\n\t\t\tDAVE WILKIE \n\t\t(a painful inward\n\t\t struggle; the man is\n\t\t tormented, miserable)\n\tOh, to hell with it, never mind.\n\tDon't tell her anything. Don't even\n\ttell her you saw me. \n\t\t(half turns his back, his\n\t\t face twisted with strong\n\t\t emotion)\n\tGot to run, Buddy, I'll miss my\n\tplane.\n\nWillcox Hillyer and the pretty young Hertz Girl stare after\nDave Wilkie as he walks away with spasm-like steps. Hillyer\nseems affected, less hostile toward Dave now. He speaks half\nto himself, half to the Hertz Girl.\n\n\t\t\tWILLCOX HILLYER \n\tHe still loves her. The poor damn\n\tfool still loves her.\n\n\t\t\tHERTZ GIRL \n\tWho was she?\n\n\t\t\tWILLCOX HILLYER \n\tA girl named Rose.\n\t\t(pulls himself back into\n\t\t the world of reality)\n\tStill take R75 to Glenville?\n\n\t\t\tHERTZ GIRL \n\tYes, sir.\n\nWillcox nods thanks and walks away carrying his travel bag.\n\nEXT. ATLANTA AIRPORT - ROAD - DAY\n\nCUT TO a shot of the red Ford driving from the airport.\n\nEXT. INTERSTATE 75 - DAY\n\nA shot of the red Ford on Interstate 75, Atlanta skyline in\nb.g.\n\nEXT. GEORGIA INTERSTATE - DAY\n\nOn the red Ford as it speeds along a Georgia Interstate\nthrough red clay hills in green springtime.\n\nINT./EXT. CAR - GEORGIA INTERSTATE - DAY\n\nCUT TO a shot on Willcox Hillyer CLOSE ON his face in the\ncar. He is lost in reflection. A look of bitter sweet emotion\nis on his face, an expression of sadness mixed with\namusement. As the CAMERA holds on his face, we hear again on\nthe track Louis Armstrong's great version of \"DIXIE,\" or\nmusic of comparable power, beauty and nostalgic evocation.\nNow the music is stronger, much stronger than behind the\ntitles, we are beginning to hear it full force.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nBLURRED SCREEN FLASHBACK:\n\nEXT. HILLYER HOME - DAY\n\nA shot of a thirteen-year-old boy on the front porch of a\nhouse in the sleepy Depression South of many years ago. He is\nBUDDY, Willcox Hillyer as a boy. The MUSIC continues as he\nshades his eyes to look at something far away.\n\nEXT. HILLYER HOME - DRIVEWAY - DAY\n\nCUT TO a LONG POV shot of a young and very pretty blonde girl\nwalking slowly up an oak-shaded driveway. A ZOOMAR LENSE\ntakes us TOWARD her. She is carrying a cardboard suitcase\ntied with a string. Her clothes are cheap, her shoes are\ndusty, runs are in her stockings. She is sweaty, tired and\nseems very nervous. ROSE is a very attractive girl, but her\nprimary quality is not sexiness, but an innocence and\nsweetness. She pauses to wipe sweat from her forehead with\nthe back of her hand and nervously moistens her lips as she\nstares ahead uncertainly at the \"nice\" Southern home which to\nher seems very grand. It is apparent she is badly frightened\nand apprehensive about what lies ahead. She is also exhausted\nfrom the heat and a long hot walk in the Southern sun. She\nblinks at perspiration, swallows in anxiety again and forces\nherself to walk on.\n\nEXT. HILLYER HOME - PORCH\n\nCUT TO a shot of Buddy on the porch. Expressionless,\nunreadable, neither friendly nor hostile, he stares with an\neven gaze directly into the CAMERA. He has his hands on his\nhips in a distinctive way that we will later see is a\nmannerism of his father's.\nBuddy tries to imitate the style of his father, not always\nwith complete success. Unreadable as a Sphinx, he stands\nthere, waiting.\n\nEXT. HILLYER HOME PORCH - DAY\n\nCUT TO a POV shot of Rose at the foot of the porch steps. A\ntentative little smile is on her face. It is very plain she\nis nervous and frightened.\n\n\t\t\tROSE \n\tHello. I'm Rose, and I've come to\n\tlive with you and your family.\n\nSilence. The damn boy says nothing. A trifle crestfallen,\nRose moistens his lips and swallows. She ventures another\nlittle smile and the CAMERA follows her as she walks up the\nsteps. The at-times-insufferable Buddy comes into the shot.\nHe still has his hands on his hips Daddy-style and his\nexpression is inscrutable, neither friendly nor hostile.\n\n\t\t\tROSE (CONT'D)\n\tWhat's your name? What do they call\n\tyou?\n\nFinally, the boy speaks -- and he is not so bad. He's a child\nafter all.\n\n\t\t\tBUDDY \n\tLots of things. Buddy, mostly.\n\n\t\t\tROSE \n\t\t(greatly reassured, a real\n\t\t smile now)\n\tBuddy. Well, now, that's a nice\n\tname, I like it. I am real pleased\n\tto meet you. \n\t\t(solemnly holds out her\n\t\t hand, they shake)\n\tHey, look, do you think you got a\n\tcold drink of ice water somewhere?\n\n\t\t\tBUDDY\n\tSure. Let me take your suitcase.\n\nA warm and beautiful smile comes on Rose's face and a little\ntwinkle comes into her eyes. The innocence and sweetness are\nnot lost, that is never lost, but this is a girl who likes\nboys and men.\n\n\t\t\tROSE \n\tYou're sweet.\n\nINT. HILLYER HOME BEDROOM STUDY - DAY\n\nCUT TO a shot of Buddy's mother, Mrs. Hillyer, in a Morris\nchair in her bedroom study.\n\nMOTHER is a sensitive, kind and rather appealing if slightly\neccentric lady of about 37 or 38. She wears glasses, has a\nVictorian hairdo and a 1930ish style dress. At the moment\nMother is absorbed in her studies -- notebooks and history\nbooks are littered and piled everywhere around her chair. She\nis drinking a Coca-Cola and smoking a cigarette held by a\nbobbie pin. Calmly, she glances up as Buddy enters the room.\nThe CAMERA pulls back to include him.\n\n\t\t\tBUDDY \n\tThe new girl is here.\n\n\t\t\tMOTHER \n\tWonderful. What's she like,\n\tBrother? What is your impression of\n\ther?\n\n\t\t\tBUDDY \n\tShe talks a great deal and smiles a\n\tlot. She's very pretty, she has a\n\treal good figure. She's very\n\tgirlish or womanish, if you know\n\twhat I mean. She wouldn't hurt\n\tanybody, this girl. She couldn't.\n\nMother accepts her son's precocious pronouncement as\nperfectly normal; talks to him as if he's an adult.\n\n\t\t\tMOTHER \n\tYour impression is very reassuring,\n\tBrother. Of course she's had\n\ttroubles, poor thing, but I sensed\n\tthat was that the girl was like and\n\tI'm glad to have it reconfirmed.\n\n\t\t\tBUDDY \n\tYou mean confirmed, Mother. I\n\tdidn't confirm it before. I would\n\thave had to confirm it previously,\n\tin order for it to be reconfirmed.\n\n\t\t\tMOTHER \n\tAll right, all right. Doll and\n\tWaski are upstairs taking their\n\tnap, you go get them and bring them\n\tdown to the living room. Where is\n\tthe girl?\n\n\t\t\tBUDDY \n\tIn the kitchen drinking all the ice\n\twater in Glenville. She walked out\n\there, she didn't go by the hotel.\n\n\t\t\tMOTHER \n\tWalked, in all that heat? It's a\n\twonder she hasn't got sunstroke.\n\tI'll phone Daddy and you go get\n\tDoll Baby and Waski.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - LIVING ROOM\n\nA shot of Mother, Rose, Buddy, Doll and Waski in the living\nroom of the Hillyer household. DOLL is a pretty little girl\nof about 11, WASKI a boy of 5. Mother's tone is very gentle,\nvery sweet, very kind. Her unabashed admiration for her own\nchildren has an ingenuousness that is more amusing than\noffensive.\n\n\t\t\tMOTHER \n\tRose, this is Waski. His real name\n\tis Warren but we call him Waski. He\n\tdoesn't like it much and I suppose\n\tsomeday we'll have to stop calling\n\thim that.\n\n\t\t\tWASKI\n\tYou can stop it right now.\n\n\t\t\tMOTHER \n\tWhen he was baby we called him \"Wa\n\tWa,\" a baby name, you know. You\n\twill find him a very good boy. His\n\tbrother can be bad and so can his\n\tsister, but Waski is a very good\n\tboy. And as you can see he's\n\tbeautiful.\n\n\t\t\tWASKI \n\tOh, Mother, cut it out.\n\n\t\t\tMOTHER \n\t\t(serenely)\n\tThere are plenty of girls who would\n\tgive thousands of dollars to have\n\tyour auburn hair. Beauty is beauty\n\tand that's all there is to it.\n\tBeauty is there and we have to\n\trecognize it. Now Rose, the little\n\tgirl sitting across from you with\n\tthe blue eyes is Doll Baby. She\n\tlooks like an angel and she is an\n\tangel, but she can be a naughty\n\tangel sometimes, although her\n\tfather won't believe it. Her real\n\tname is Frances, but we call her\n\tDolly or Doll.\n\n\t\t\tDOLL \n\tI don't like that, either, it's\n\tworse than Waski. I want to be\n\tcalled Fran.\n\n\t\t\tMOTHER \n\tDaddy wouldn't hear that. Now the\n\tredhaired boy you see sitting\n\tthere, of course you have met him,\n\the is my oldest son and my most\n\tbrilliant child. All children have\n\tgreat creative powers, but I don't\n\twant to rattle on about my\n\tchildren, they say I brag too much\n\tabout them, especially about\n\tBrother. Am I boring you, Rose?\n\nRose has not as yet caught on to Mother's style and is\nstaring at her with lips apart and blue eyes slightly popped.\n\n\t\t\tROSE \n\t\t(feebly)\n\tOh, no, ma'am.\n\n\t\t\tMOTHER \n\tWell, it's rather interesting about\n\tBrother, actually. I realized the\n\tremarkable thing he had when he was\n\tsix weeks old. He looked at me and\n\tunderstood me, he knew exactly who\n\tI was. I know it sounds crazy but\n\tit's true. He's very remarkable, he\n\twas born for the ministry and could\n\tmove millions, but he doesn't know\n\tthat yet. I have to warn you about\n\thim, he can be very dangerous,\n\tthere is an evil streak in him, a\n\tstreak of pure sheer meanness. But\n\tat heart Brother is saintly and\n\tthat is why he was born for the\n\tministry even if he doesn't know\n\tit.\n\nThus, Mother. Slightly cuckoo, a bit out of touch with\nreality, but no fool. A very intelligent woman really, and\nvery, very gentle and kind.\nHer style, however, takes a little getting used to and her\nlong speech throws Rose completely. She stares at Mother in\nspeechless open-mouthed awe, unable to say a word.\n\nThe CAMERA moves in CLOSER on Rose as she moistens her lips,\nswallows, tries to talk and can't. She is very, very nervous.\nNow she flinches and looks around as we hear a deep masculine\nVOICE OVER the shot. It is the voice of DADDY, Mr. Hillyer,\nBuddy's father.\n\n\t\t\tDADDY'S VOICE \n\tHoney, you'll scare the gizzard out\n\tof the girl going into the fourth\n\tdimension like that.\n\nANOTHER ANGLE on Daddy in the doorway of the living room. He\nis a handsome man of about forty with a style and a manner\nall his own. As extravagant as his remarks often are and\nfunny though he is at times, the man has a courtly Southern\ndignity that is never lost. He is no clown, he is not even a\ncomedian, he is a man and a formidable man at that: all the\ncharacters in this story love and fear him. We see now where\nBuddy got his unreadable expression thing and his hands on\nthe hips thing. Daddy is unreadable. A straw hat is on the\nback of his head, a rolled-up Glenville Tribune is in his\nhand, his hands are on his hips. He is staring with what\nseems to be stern fierceness at them all, but his attitude\nreally is inscrutable.\n\n\t\t\tMOTHER \n\tIt isn't the fourth dimension. To\n\tyou it's the fourth dimension,\n\tmaybe, to me it's simply the truth.\n\n\t\t\tDADDY \n\t\t(staring fiercely at Rose)\n\tWell, well, well. So Miss Rosebud\n\thas arrived. Un-hmm. And you're all\n\tassembled here. Yes, indeed. Un\n\thmmm.\n\nDaddy walks in as Rose stares wide-eyed at him. It is obvious\nhe scares the absolute bejesus out of her, she looks actually\nas if she might faint, her hands trembling on her lap and her\nknees quivering beneath her cheap and tacky dress. But she\nhas a surprise coming. She is soon to lose all her fear of\nhim, every bit of it. Daddy walks over and sits in a chair\nbeside her, stares fiercely at her for a moment, then begins\na long speech. Again, extravagant as this speech is, he is no\nclown, he is not \"being funny,\" he means every word he says.\n\n\t\t\tDADDY (CONT'D)\n\tWell, Rosebud, now you are here,\n\tdarling, and I swear to God\n\tgraceful as the capital letter S.\n\tYou will adorn our house, Rosebud,\n\tyou will give a glow and a shine to\n\tthese old walls. If there's one\n\tthing I like to have around, it's a\n\tfrizzy-haired blonde. Now I assume\n\tMrs. Hillyer and the children have\n\tintroduced themselves and made your\n\tacquaintance, and so forth and so\n\ton?\n\nRose can barely answer, eyes fixed in rapt fascination on\nhim, a half whisper.\n\n\t\t\tROSE \n\tYes, sir.\n\n\t\t\tDADDY \n\tAll right. Now as head of this\n\thousehold I have a couple of\n\tremarks to make. It is my dear\n\twife's belief, which I accept\n\talthough I do not totally grasp it,\n\tthat to hire a person to do\n\thousehold work is a criminal\n\tpractice. Therefore, you are here\n\tnot as a servant, you are here as a\n\tfriend, as a guest and hopefully as\n\ta member of this family. You will\n\teat your meals with us, you will\n\tshare life itself with us -- in\n\tlove and harmony, dear Rosebud, in\n\tlove and harmony. Do you understand\n\tme?\n\n\t\t\tROSE\n\t\t(a half whisper)\n\tYes, sir.\n\nDaddy pauses, then in a different tone, his hidden gentleness\nand kindness are much more plain; as he talks Rose's eyes\nbegin to well with tears.\n\n\t\t\tDADDY \n\tNow, I know you've had some\n\ttroubles in your life, those...\n\tscoundrels in Birmingham and so\n\tforth trying to... lead you astray.\n\tI hope you find a safe haven here,\n\thoney, I know you've had a hard\n\ttime. Life can be cruel to a young\n\tgirl all alone. We welcome you to\n\tour home, Rosebud, we all welcome\n\tyou from the heart and hope you are\n\thappy here.\n\nRose bites her lip, her eyes are filled with tears; an\ninaudible whisper.\n\n\t\t\tROSE \n\tYes, sir.\n\nINT. HILLYER HOME\n\nVARIOUS SHOTS of Rose doing household chores: sweeping the\nfloor, vacuuming, cooking. She is cheerful in her work,\nsmiling, good-humored and she works hard. It is obvious she\nis happy. We see the children in most of these shots. It is\napparent Rose is a very good worker and very happy in her new\nhome.\n\nINT. HILLYER HOME - KITCHEN - DAY\n\nRose is washing the dishes while the children finish\nbreakfast. Buddy looks up from this cornflakes with a\nslightly sly expression.\n\n\t\t\tBUDDY \n\tRose, who were those scoundrels in\n\tBirmingham?\n\n\t\t\tROSE \n\tNobody.\n\n\t\t\tBUDDY \n\tBut who were they?\n\n\t\t\tROSE \n\tThey were just bad men, that's all.\n\n\t\t\tBUDDY \n\tIn what sense were they bad?\n\n\t\t\tROSE \n\tBad is bad, Buddy. There ain't no\n\tsense to it.\n\n\t\t\tBUDDY \n\tDid they try to induce you to\n\tbecome a prostitute?\n\nRose turns around, lifts her eyebrows, tosses down the\ndishcloth.\n\n\t\t\tROSE \n\tI don't answer talk like that,\n\tBuddy. I just don't hear it, I turn\n\tmy back and look away.\n\nRose turns her back on him.\n\n\t\t\tBUDDY \n\tWas that what they tried to do? Was\n\tthat why Daddy gave you the job, to\n\tsave you from those scoundrels?\n\n\t\t\tROSE \n\tYour Daddy is a wonderful man, I'll\n\tsay that. He's the best and most\n\tkind-hearted man in the world.\n\n\t\t\tBUDDY \n\tHey, Rose, did you hear about that\n\tterrible thing down in Cave\n\tSprings?\n\n\t\t\tROSE \n\tWhat terrible thing in Cave\n\tSprings?\n\n\t\t\tBUDDY \n\tThere was this old man that ate his\n\tniece.\n\nRose stares emptily for a moment, then bites her lips\ntogether.\n\n\t\t\tROSE \n\tI didn't hear you. I didn't hear\n\tthat.\n\n\t\t\tBUDDY \n\tHe really did, he ate his little\n\tniece. He made pork chops out of\n\ther.\n\n\t\t\tROSE \n\tI don't hear you. I just turn my\n\tback on that kind of talk and look\n\taway.\n\n\t\t\tBUDDY \n\tWell, it's only the truth. There\n\tare horrible things in the world,\n\tRose.\n\n\t\t\tROSE \n\tBuddy, you are in one of your evil\n\tmoods, I don't want to talk to you.\n\tI'm going out and sweep the patio.\n\nRose exits and the CAMERA stays on Buddy, Doll and Waski.\n\n\t\t\tBUDDY \n\tRose is almost as sentimental as\n\tMother. If there's one thing I\n\tcan't stand it's sentimentality. In\n\tChattanooga this man committed an\n\talmost perfect murder. He killed\n\this wife with a black widow spider.\n\n\t\t\tDOLL \n\tOh, shut up, Buddy.\n\n\t\t\tWASKI \n\tYeah, shut up.\n\nEXT. HILLYER HOME - PATIO - DAY\n\nCUT TO a shot of Rose on the stone patio of the Hillyer\nhouse, an attractive area with outdoor furniture and\ncrabapple tree limbs overhead. Rose is busy sweeping. The\nCAMERA PANS to follow her and we pick up Mrs. Hillyer,\nMother. It is a nice day and she is studying out on the\npatio, books and notebooks piled around. Rose glances down\ncuriously at her.\n\n\t\t\tROSE \n\tWhat are you studying now, Mrs.\n\tHillyer?\n\n\t\t\tMOTHER \n\tMore history, Rose.\n\n\t\t\tROSE \n\tAre you going to get your degree\n\tsoon?\n\n\t\t\tMOTHER \n\tWell, I am working on my thesis.\n\n\t\t\tROSE \n\t\t(as she busily sweeps)\n\tIt must be wonderful to be so\n\tsmart. I don't see how you do it,\n\treading all those books, learning\n\tall that stuff.\n\n\t\t\tMOTHER \n\t\t(looks up, and gently)\n\tRose, you work too hard. Why don't\n\tyou go sit down somewhere and drink\n\ta Co-Cola?\n\n\t\t\tROSE \n\t\t(smiles, trusts and knows\n\t\t Mother now, not at all\n\t\t afraid of her)\n\tYou're so sweet.\n\nRose again busily sweeps.\n\n\t\t\tMOTHER \n\tReally, why don't you go sit down\n\tsomewhere?\n\n\t\t\tROSE \n\tI like to work. I don't mind work.\n\tIt's the least I can do after all\n\tyou and Mr. Hillyer have done for\n\tme. \n\t\t(stares worshipfully at\n\t\t Mother)\n\tYou're so sweet. There never was\n\tnobody like you.\n\n\t\t\tMOTHER \n\t\t(gently)\n\tWell, you run on now.\n\n\t\t\tROSE \n\tYes, Ma'am.\n\nExit Rose. Mother adjusts her notebook and turns the page of\na history book as she resumes her studies. We hear the sound\nof an approaching CAR and she glances up.\n\nEXT. HILLYER HOME - DRIVEWAY - DAY\n\nCUT TO a shot of a slightly worn-out 1932 Model-A Ford as it\nrolls up the driveway of the Hillyer home, Daddy at the\nwheel.\n\nEXT. HILLYER HOME - PATIO - DAY\n\nANOTHER ANGLE, on Daddy as he gets out of the Model-A. He has\nhis usual straw hat on the back of his head. The CAMERA\nFOLLOWS him as he walks onto the patio.\n\n\t\t\tDADDY \n\tGood morning, sweetheart. Beautiful\n\tday.\n\n\t\t\tMOTHER \n\tYes, it's so nice I thought I'd\n\twork outside.\n\n\t\t\tDADDY \n\tHow goes it, darlin'?\n\n\t\t\tMOTHER \n\tSlow, hon. But at least I can\n\tconcentrate now that Rose is here.\n\n\t\t\tDADDY \n\tWhat do you think of her, honey?\n\nMother doesn't answer, she writes on, head bowed over her\nnotebook. We see in this shot the hearing aid she wears and\nhear from it a faint BUZZ.\n\n\t\t\tDADDY (CONT'D)\n\tTurn up your hearing aid.\n\n\t\t\tMOTHER \n\tWhat?\n\n\t\t\tDADDY \n\tYour hearing aid, it's buzzing at\n\tme like a snake.\n\n\t\t\tMOTHER\n\t\t(adjusts hearing aid)\n\tOh. Did you say something?\n\n\t\t\tDADDY \n\tI asked you what you think of\n\tRosebud, now that she's been here a\n\twhile.\n\n\t\t\tMOTHER \n\tHoney, she's perfect. She works all\n\tthe time and she's wonderful with\n\tthe children. And they love her,\n\teven Brother likes her though he\n\twon't admit it. I think she's just\n\tperfect.\n\n\t\t\tDADDY \n\tUm-hmm. Almost too perfect.\n\n\t\t\tMOTHER \n\tAnd she's such a good-hearted\n\tthing, there isn't an ounce of harm\n\tor malice in her.\n\n\t\t\tDADDY \n\tWell, I'll admit I don't see any\n\tflies on her yet.\n\n\t\t\tMOTHER \n\tThere are no flies on Rose, I don't\n\tknow what you're talking about.\n\n\t\t\tDADDY \n\tWell, she must have done something\n\tto encourage those scoundrels in\n\tBirmingham, even if she did run\n\taway from them.\n\nINT. HILLYER HOME - KITCHEN - DAY\n\nCUT TO a shot of Buddy in the window of the kitchen. He is\npropped on his elbows and listening with keen interest to the\ntalk on the patio. We hear the VOICES of his parents OVER the\nshot.\n\n\t\t\tMOTHER'S VOICE \n\tIf you mean... boys and men, I\n\tdon't think so. Rose seems very\n\tcalm about all of that.\n\n\t\t\tDADDY'S VOICE \n\tWell, so far I have to agree. She\n\tseems calm as lettuce.\n\nThe CAMERA FOLLOWS Buddy as he draws back into the kitchen.\nWe see Doll and Waski playing a game on the kitchen table.\n\n\t\t\tBUDDY \n\tDaddy says Rose is calm as lettuce.\n\tDo you believe that, Doll?\n\n\t\t\tDOLL \n\tNo.\n\n\t\t\tWASKI \n\tNeither do I.\n\n\t\t\tBUDDY \n\tOh, Waski, you don't even know what\n\twe're talking about.\n\n\t\t\tWASKI\n\tI do, too.\n\nBuddy turns, looks back out the window.\n\nEXT. HILLYER SOME - PATIO - DAY\n\nCUT TO Mother and Daddy on the patio. Daddy stands up.\n\n\t\t\tDADDY \n\tWell, let's hope for the best,\n\tdarlin'.\n\n\t\t\tMOTHER \n\tHope for the best? I don't\n\tunderstand all this skepticism. I\n\tthought you liked Rose.\n\n\t\t\tDADDY \n\tI love Rosebud, I am wild about\n\tRosebud. I just hope she doesn't\n\tturn out to be a hidden hotcha\n\tcharacter, that's all. We have\n\tgrowing children in the house.\n\n\t\t\tMOTHER \n\tHotcha character. If I had to live\n\twith your cynicism, I wouldn't want\n\tto live at all. What you can't\n\tunderstand is that the creative\n\tforces of the universe are\n\tpositive, not negative.\n\n\t\t\tDADDY\n\t\t(gently, his irony is\n\t\t mild)\n\tAll right, darlin', don't go off\n\tinto the fourth dimension.\n\n\t\t\tMOTHER \n\tI'm not in the fourth dimension --\n\t\t(points a finger at him)\n\t-- you are in the fourth dimension,\n\twhen you allow skepticism and doubt\n\tto take control. As Blake said, if\n\tGod had doubt the sun would go out.\n\n\t\t\tDADDY \n\t\t(again gentle irony,\n\t\t always courtly toward\n\t\t her)\n\tForgive my crudity, darlin'. I\n\tdon't understand these deeper\n\tthings the way you do.\n\n\t\t\tMOTHER \n\t\t(reaches up, takes his\n\t\t hand)\n\tBe nice to Rose. She's never had a\n\treal home.\n\n\t\t\tDADDY \n\tYou're a wonderful woman, darlin'.\n\tAs long as you're around, I'm sure\n\tthe sun wouldn't dare go out.\n\nINT. HILLYER HOME - KITCHEN - DAY\n\nCUT TO a shot of Buddy and Doll and Waski in the kitchen.\nDoll and Waski are playing parchesi on the kitchen table.\nBuddy turns from eavesdropping at the window and strolls\nacross the kitchen, hands in his khaki pants.\n\n\t\t\tBUDDY \n\tIt's pitiful. Neither one of them\n\tknow.\n\n\t\t\tDOLL \n\t\t(as she shakes dice)\n\tI think Daddy suspects.\n\n\t\t\tBUDDY \n\tNo, he doesn't. Not really.\n\nThe CAMERA FOLLOWS Buddy as he goes to the hall door,\ncarefully opens it to make no noise and peers down the hall.\n\nINT. HILLYER HOME - FRONT HALL - DAY\n\nCUT TO a POV shot of Rose busy dusting hall furniture,\nhumming as she works. We hear on the track the SOUND of the\nModel-A starting, and Rose freezes. Then, quickly, Rose\nhurries down the hall toward the front door.\n\nON Buddy as he watches her through a crack in the door. He\nhas his hands on his hips Daddy-style and his face is\nexpressionless.\n\nANOTHER ANGLE, POV of Buddy but CLOSER on Rose at the end of\nthe hall. She is staring soulfully through the glass of the\nfront door as we hear the Model-A go down the driveway. Rose\nlifts a hand between her breasts, sighs. A lovesick\nexpression is on her face.\n\nINT. HILLYER HOME - KITCHEN - DAY\n\nON Buddy, as he comes back into the kitchen sadly shaking his\nhead.\n\n\t\t\tBUDDY\n\tIt's really pitiful. She's in bad\n\tshape.\n\n\t\t\tDOLL\n\tShe's watching the car again?\n\n\t\t\tBUDDY\n\tYeah.\n\n\t\t\tDOLL\n\tI get so irritated with Daddy. He's\n\tso dumb sometimes.\n\n\t\t\tWASKI\n\tYeah, I know.\n\n\t\t\tBUDDY\n\tOh, Waski, you don't know anything.\n\n\t\t\tWASKI\n\tI do, too!\n\n\t\t\tBUDDY\n\tAll right, what do you know?\n\n\t\t\tWASKI\n\tRose is madly in love with Daddy...\n\n\t\t\tDOLL\n\t\t(pauses, then solemnly)\n\tWell, don't tell Mother.\n\n\t\t\tWASKI\n\tDo you think I'm crazy?\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - DINING ROOM - NIGHT\n\nA shot of the family at dinner in the dining room at night.\nDaddy is at the head of the table, Mother is at the other\nend.\n\nBuddy, Doll and Waski are all seated in neat, nice clothes,\nhands washed and hair combed. Rose is serving, but a place is\nset for her. She wears an attractive little apron and is\nsmiling, blushing, happy as Daddy teases and jokes at her.\n\n\t\t\tDADDY\n\t(in a good humor) \n\tRosebaby Blossom, these are the\n\tmost delicious candied yams I ever\n\tate! Why, they just melt in my\n\tmouth. And this fried chicken is\n\tfit for a king. How do you do it,\n\tPeachbird? What is the secret of\n\tyour art, Plum Blossom, huh?\n\n\t\t\tROSE\n\t\t(blushing, smiling)\n\tOh, I don't know, I... I...\n\n\t\t\tDADDY \n\tRosebird Baby, you are the light of\n\tmy life, darlin'. How did we ever\n\tget by without you?\n\n\t\t\tROSE \n\t\t(stares at him, stricken)\n\tI... I'll get the grits.\n\nThe CAMERA FOLLOWS Rose as she exits, and STOPS on Buddy and\nDoll. Buddy slews his eyes toward his sister, who meets his\ngaze for a moment then looks down at her plate. The CAMERA\nMOVES on to Mother, who is utterly oblivious of anything\ngoing on between Rose and Daddy.\n\n\t\t\tMOTHER \n\tRose does have a gift for cooking.\n\tShe learns so fast, but mainly I\n\tthink it's that she tries so hard.\n\nINT. HILLYER HOME - DINING ROOM - NIGHT (LATER)\n\nANOTHER ANGLE, on the family as they eat dinner. Rose is\nseated at the table now. She is picking lifelessly at her\nfood and glancing from time to time with a lovesick\nexpression at Daddy, who is busy eating and seems wholly\nunaware of it. Mother also is wholly unaware, but all the\nchildren know what is happening. Rose takes a gravy for a\nbiscuit and spills a little, her hand is trembling.\n\n\t\t\tMOTHER\n\t\t(gently, suspects\n\t\t absolutely nothing)\n\tRose, you're in an awful dither\n\ttonight. What's the matter with\n\tyou, honey, are you sick or\n\tsomething?\n\n\t\t\tROSE\n\t\t(in a feeble voice)\n\tNo, ma'am, I'm just fine.\n\n\t\t\tMOTHER \n\tYou look sick if you ask me. I hate\n\tto leave you with the dishes and\n\tall, but I'm supposed to go to a\n\tmeeting of the Garden Club this\n\tevening.\n\t\t(to Daddy)\n\tI'll need the car keys.\n\n\t\t\tDADDY \n\tI'll drive you, darlin'. You've got\n\tno business behind the wheel of an\n\tautomobile. You don't think about\n\twhat you're doing and you'll run\n\tinto a telephone pole.\n\n\t\t\tMOTHER \n\tI think about what I'm doing all\n\tthe time, and I've got as much\n\tbusiness behind the wheel of an\n\tautomobile as anybody. Besides, I\n\twant you to stay and help Rose with\n\tthe dishes, the poor girl isn't\n\tfeeling well.\n\n\t\t\tDADDY \n\tAll right, darlin'.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - DINING ROOM - NIGHT (LATER)\n\nA shot of Daddy alone in the dining room, reading a newspaper\nand drinking coffee. Rose comes INTO THE PICTURE, gets dishes\nas she clears the table. She stares with a lovesick\nexpression at Daddy, who is absorbed in paper.\n\n\t\t\tDADDY\n\t\t(to himself, mostly)\n\tHmmp. Did you realize there are a\n\tthousand Coca-Cola millionaires in\n\tAtlanta?\n\nINT. HILLYER HOME - FRONT HALL - NIGHT\n\nCUT TO a shot of Buddy and Doll tiptoeing down the darkened\nhall toward the front door. We hear the MODEL-A going down\nthe drive. They peer out of the glass of the front door. They\nwhisper.\n\n\t\t\tBUDDY\n\tThere goes Mother.\n\n\t\t\tDOLL\n\tYeah.\n\n\t\t\tBUDDY \n\tLet's go peep from the living room.\n\n\t\t\tDOLL\n\tOkay.\n\nINT. HILLYER HOME - LIVING ROOM - NIGHT\n\nThe CAMERA FOLLOWS them as they tiptoe into the darkened\nliving room. They go over to the sliding doors and silently\nstruggle for the best peeping spot. Buddy gets up high, Doll\ndown low, at the crack in the doors through which light\nshines.\n\nINT. HILLYER HOME - DINING ROOM - NIGHT\n\nCUT TO a POV shot of the dining room, as seen by children.\nDaddy sits absorbed in his paper, oblivious of Rose. She is\nstaring down at him with a pale look of love.\n\nINT. HILLYER HOME - LIVING ROOM - NIGHT\n\nCUT TO a CLOSE-UP of Buddy and Doll, their heads together.\nThey whisper.\n\n\t\t\tDOLL\n\tI think she's gonna kiss him.\n\n\t\t\tBUDDY\n\tAt least.\n\nINT. HILLYER HOME DINING ROOM - NIGHT\n\nCUT TO a POV shot of Daddy and Rose, as seen by children. The\ntable now is cleared and Rose stands half behind Daddy,\nstaring down at him with a stricken expression.\n\n\t\t\tDADDY \n\t\t(half to himself)\n\tEhh, Lord, should have bought that\n\tstock when we had some money. A\n\tthousand millionaires.\n\nRose suddenly makes up her mind, places her hand on his\nshoulder, turns sideways, sits down on his lap, puts an arm\naround his neck.\n\n\t\t\tROSE \n\tOh, oh! Oh, Mr. Hillyer, I love\n\tyou, I love you so much! I've\n\ttried, but I can't help it! Please\n\tkiss me -- will you kiss me?\n\nFor a long time Daddy stares groggily at her with a half\nfrown as if he can't believe it. In order to stare at her, he\nmust tilt his head back and, handsome man though he is, he\nlooks a bit like a startled rooster. Her breasts are pressed\nagainst him, and her eager -pink lips are waiting for a kiss.\n\n\t\t\tDADDY \n\t\t(finally clears his\n\t\t throat)\n\tAhh-hem! Now, Rose, get off my lap.\n\tWhat are you doing, girl? Are you\n\tcrazy?\n\n\t\t\tROSE\n\tYes, crazy about you! Kiss me, Mr.\n\tHillyer!\n\n\t\t\tDADDY \n\tWhy, I'm not going to kiss you, you\n\tcrazy girl. Now I'm telling you\n\tagain, get off my lap. Come on,\n\tRose, get up. Now you get up, I\n\tsay, and stop this!\n\n\t\t\tROSE \n\tNo, no! You don't understand, I\n\tlove you! It's real love and I\n\tcan't help it! Please kiss me, Mr.\n\tHillyer, I love you, I love you so\n\tmuch...\n\nRose breaks down and begins crying, her head on his shoulder.\nShe has her arms wound tight around him and Daddy seems at a\nloss what to do.\n\n\t\t\tDADDY\n\t\t(in a shaken voice)\n\tAll right, all right. Now calm\n\tdown, Rose, the children will hear\n\tyou. Calm down, let's talk... about\n\tthis thing, let's discuss it.\n\n\t\t\tROSE\n\t\t(sobbing)\n\tDon't make me... me... me... get\n\tup!\n\n\t\t\tDADDY \n\tCalm down, Rose, let's calm down\n\tand discuss it ...\n\nINT. HILLYER HOKE - LIVING ROOM - NIGHT\n\nCUT TO a shot of Buddy and Doll. Doll is down near the floor\nand can't see as well. They whisper.\n\n\t\t\tDOLL \n\tI can't see. What are they doing,\n\twhat's happening?\n\n\t\t\tBUDDY \n\tThey're discussing it.\n\n\t\t\tDOLL \n\tI can't see, let me see...\n\nDoll tries to rise up and Buddy puts a hand on her head and\nshoves her down.\n\n\t\t\tBUDDY \n\tThis is my place and you can't have\n\tit.\n\n\t\t\tDOLL\n\t\t(a whispered moan of\n\t\t frustration)\n\tOhhh-hh... what's happening now?\n\n\t\t\tBUDDY\n\t\t(his eyes open wide)\n\tHe's trying to get up -- good God,\n\tone of her titties is out!\n\n\t\t\tDOLL \n\tLet me see!\n\nINT. HILLYER HOME - DINING ROOM - NIGHT\n\nCUT TO a POV shot of Daddy and Rose, as he struggles to rise\nfrom the chair. They are half falling to the floor and now\nthey fall, Rose still on his lap. One of her breasts has come\nout of her dress, which is very loose and low-cut. She has no\nbra, the breast is bare. Daddy is staring groggily at the\nbreast as if slightly dazed.\n\nINT. HILLYER HOME - LIVING ROOM - NIGHT\n\nCUT BACK TO Buddy and Doll. Buddy is frustrated now.\n\n\t\t\tBUDDY \n\tNow I can't see. What are they\n\tdoing?\n\n\t\t\tDOLL \n\t\t(happy, peeping through\n\t\t crack)\n\tBoy! Wow!\n\nBuddy groans and peers intently through crack.\n\nINT. HILLYER HOME - DINING ROOM - NIGHT\n\nA POV shot of scene as observed by Buddy. He is up too high,\nthe dining table blocks his view. We see the lower half of\nRose and Daddy. Rose's skirt is up well above her knees.\n\nINT. HILLYER HOME - LIVING ROOM - NIGHT\n\nCUT TO a shot of Buddy and Doll.\n\n\t\t\tDOLL \n\tWow! Brrrother!\n\n\t\t\tBUDDY \n\tWhat are they doing?\n\n\t\t\tDOLL \n\tBuddy, this is amazing, you\n\twouldn't believe it.\n\n\t\t\tBUDDY \n\tWhat are they doing, Doll?\n\n\t\t\tDOLL \n\t\t(staring, enthralled)\n\tHe kissed her.\n\n\t\t\tBUDDY\n\tIs that all?\n\n\t\t\tDOLL \n\t\t(happily, enjoying it)\n\tHe had his hand on her titty.\n\n\t\t\tBUDDY \n\tLet me look. \n\t\t(can't stand it, grabs her\n\t\t around waist and pulls\n\t\t her away; eagerly looks,\n\t\t sags)\n\tAww-rr...\n\nCUT TO a POV shot of the scene in the dining room.\n\nINT. HILLYER HOME - DINING ROOM - NIGHT\n\nDOWN LOW, we can see under the dining room table now. Daddy\nhas his hands on Rose's shoulders and is firmly pushing her\naway.\n\n\t\t\tDADDY\n\tAll right, that is enough of this\n\tnonsense, and I mean enough! Get up\n\toff this floor, Rose, and put your\n\tdamned tit back in your dress! Do\n\tyou hear me, girl, get up off of\n\tthat floor!\n\nRose, on all fours, blonde hair over her face, making little\nwhimpering noises of dismay:\n\n\t\t\tROSE\n\tOhh-hhh... ohh...\n\nINT. HILLYER HOME - LIVING ROOM - NIGHT\n\nCUT TO Buddy and Doll.\n\n\t\t\tBUDDY \n\t\t(disappointed)\n\tShe's putting the titty back.\n\n\t\t\tDOLL \n\t\t(a furious whisper)\n\tBuddy, that was my place.\n\nDoll forces her way in and they both peep through crack in\ndoor.\n\nINT. HILLYER HOME - DINING ROOM - NIGHT\n\nCUT TO a POV shot of Rose and Daddy. Rose stands sheepishly\nby the dining room table, half-crying as she adjusts her\ndress. Daddy sits in his dining room chair. Daddy is glaring\nat her.\n\n\t\t\tDADDY \n\tGoddamn you, girl! You've made me\n\tmake a fool out of myself, damn\n\tyour hide, but let me tell you I am\n\tstanding at the pass of Thermopylae\n\tand I won't budge! The very idea,\n\tmy own home with children in the\n\thouse, to say nothing of my wife --\n\toh-h, you had better believe I am\n\tstanding at Thermopylae, you little\n\tnut, you had better believe it!\n\tWhat are you, crazy? A man is\n\tsupposed to be a fool like this,\n\tbut a woman is supposed to have\n\tsome control and sense! Are you a\n\tnitwit? What's the matter with you?\n\n\t\t\tROSE \n\t\t(weeping)\n\tOh-h, I'm sorry. I'm sorry, Mr.\n\tHillyer... I just... couldn't help\n\tmyself. I'm sorry...\n\nINT. HILLYER HOME - LIVING ROOM - NIGHT\n\nCUT TO a shot of Buddy and Doll as they peep at the door.\nDoll whispers angrily at him.\n\n\t\t\tDOLL \n\tBuddy, that was pretty snotty of\n\tyou, pushing me away like that just\n\twhen it was interesting.\n\n\t\t\tBUDDY \n\tYou shouldn't watch such things,\n\tDoll.\n\nThey continue to peep with interest through the crack in the\ndoors.\n\nINT. HILLYER HOME - DINING ROOM - NIGHT\n\nCUT TO a shot of Rose and Daddy. Now Rose is sitting penitent\nand crying in one of Daddy's handkerchiefs. Daddy's anger is\ngone, he has gotten control of himself and speaks to her now\nin a different tone.\n\nHe sits beside her, an arm around her shoulders in a fatherly\nway.\n\n\t\t\tDADDY \n\tRose, Rose, Rose, you poor\n\tmiserable little child, don't you\n\tknow I love you? Do I have to put\n\tmy hand on your body or kiss your\n\tpretty lips to prove it? You are\n\tbeautiful to me, Rose, I've loved\n\tyou since you first came here,\n\tdarlin'. And don't you know Mrs.\n\tHillyer loves you, too, that she's\n\talready taken you into her heart,\n\tand that that woman's heart is as\n\twide as the blue sky itself and as\n\tdeep as the stars?\n\n\t\t\tROSE \n\t\t(weeping in handkerchief)\n\tOh, I know. She's so sweet, she's\n\tbeen so good to me...\n\n\t\t\tDADDY \n\tDo you know what a friend you have\n\tgot there? Do you know she would\n\tfight for you like a tiger, that\n\tshe would fly to your defense in an\n\tinstant with all the courage in her\n\tsoul if anyone tried to hurt you?\n\tIs this any way to repay her trust\n\tand love? Are you ashamed as I am\n\tashamed? \n\t\t(pauses as Rose sobs in\n\t\t handkerchief)\n\tDon't cry, honey, don't cry. But\n\tlet me warn you, damn your hide,\n\tthis is Thermopylae and I am\n\tstanding here. Do you hear me, damn\n\tyou. I am standing at Thermopylae\n\tand the Persians shall not pass!\n\tNow get your tail out of here and\n\tgo wash those dishes, and stop\n\tcrying!\n\nINT. HILLYER HOME - LIVING ROOM - NIGHT\n\nCUT TO Buddy and Doll in the darkened living room. He\ngestures that they'd better leave, and they do. The CAMERA\nFOLLOWS them as they tiptoe out of the living room.\n\nINT. HILLYER HOME - FRONT STAIRS - NIGHT\n\nANOTHER ANGLE, on Buddy and Doll as they tiptoe up the front\nstairs.\n\nINT. HILLYER HOME - TOP OF STAIRS - NIGHT\n\nON Buddy and Doll at the top of the stairs. They pause to\ntalk and now they don't have to whisper. Doll is happy,\npleased.\n\n\t\t\tDOLL \n\tWasn't Daddy wonderful? He wanted\n\tto kiss her some more and play with\n\ther, but he didn't, because he\n\tloves Mother and all of us, and he\n\tloves Rose, too. Isn't he\n\twonderful, isn't he great?\n\n\t\t\tBUDDY \n\t\t(dryly, aloof; he doesn't\n\t\t mean this really)\n\tWonderful? He kissed her and played\n\twith her titty, and I don't see\n\tanything so great about that. He\n\twas probably afraid Mother would\n\tcome back early and catch him.\n\n\t\t\tDOLL \n\tYou know, Buddy, sometimes you make\n\tme sick.\n\nDoll gives him a venomous glance and walks away. The CAMERA\nSTAYS on Buddy as he stares after her with a thin little\nsmile. Be seems wryly amused that he has made her angry.\nAfter a moment, he turns and stares in the direction of\ndownstairs and his face changes. His smile fades, then slowly\nreturns as he thinks of what has happened.\n\n\t\t\tBUDDY \n\t\t(quietly, to himself)\n\tThermopylae. The Persians shall not\n\tpass.\n\nIt is obvious that secretly Buddy admires very much his\nfather's behavior.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME BUDDY'S BEDROOM - NIGHT\n\nA shot of Buddy at night in his small bedroom.\n\nHe wears a rather skimpy old-fashioned nightshirt that comes\nmidway between his hips and knees. At the moment he is\nfinishing brushing his teeth at the bureau, using an old\nfashioned water pitcher and bowl. The CAMERA FOLLOWS as he\nwalks across the room in the light of the lamp by his bed. He\nlooks around cautiously, then picks up the mattress of his\nbed. He pushes it far back and we see springs. He takes out a\nsmall \"book\" or pamphlet and stares gravely at it.\n\nCLOSE-UP: The front cover of the pamphlet. We see the overall\ntitle: LITTLE DIRTY COMIC BOOKS. And beneath it: BLONDIE AND\nDAGWOOD. And beneath that, in smaller letters: \"Mr. Dithers\nComes to Dinner -- and How!\" We see Buddy's hands in the\nshot, and he opens the pamphlet and we catch enough of a\nglimpse of the thing to know it is pretty awful -- a drawing\nmaybe of \"Blondie\" stark naked with a finger in her mouth\ngoing, \"Tee-Hee!\"\n\nON Buddy, as he stares down with grave intentness at the\nLittle Dirty Comic Book. Slyly now, he retraces his steps to\nthe bureau and takes out a flashlight. He goes back to the\nbed, switches off the lamp, gets in the bed and turns on the\nflashlight and pulls the covers over his head. We hear a\nfaint SOUND on the track and Buddy suddenly yanks back the\ncovers, puts the flashlight on the table by the bed and\nthrows the Little Dirty Comic Book under the bed. He lies on\npillow and pretends he's asleep, and we hear the door of his\nroom OPEN and a CREAKING on the floor.\n\nANOTHER ANGLE, on a weepy Rose in a very thin nightgown. The\nshot is FROM BELOW as Buddy might see her as she stands over\nhis bed. She looks very lonely and unhappy and is half\ncrying.\n\n\t\t\tROSE \n\tBuddy... are you asleep?\n\nANOTHER ANGLE, on both of them. Buddy stares at her in\nsurprise. It is dim in the room, but we can see them in the\nmoonlight.\n\n\t\t\tBUDDY\n\tNo, I'm awake. What's the matter?\n\n\t\t\tROSE \n\tBuddy, I am wandering in a\n\twilderness, lost. \n\t\t(sits glumly on edge of\n\t\t bed)\n\tI just feel awful. Do you mind if I\n\tget in bed with you for a little\n\twhile?\n\n\t\t\tBUDDY \n\tWell, all right.\n\nANOTHER ANGLE, on Rose and Buddy in the bed in the moonlight.\nIt is all innocent enough, Buddy is a child and Rose\nobviously has no lewd intent in getting into his bed. She\nlies back on a pillow staring up at the ceiling and smoking a\ncigarette.\n\n\t\t\tROSE \n\tI thought I'd go crazy back there\n\tin that room all by myself with\n\tnobody to talk to. As a child, I\n\tnever had no room all to myself, we\n\twere awful poor. Buddy... I have\n\tgot a confession to make.\n\n\t\t\tBUDDY \n\tWhat is it, Rose?\n\n\t\t\tROSE \n\tIt's so terrible I can't tell you.\n\tOh, Buddy, you don't know how it\n\thurts to have a broken heart, what\n\ta terrible feeling it is, and I've\n\thad a broken heart so many times.\n\tMen, I don't understand them, I\n\tcan't figure them out and they\n\tbreak my heart, that's all. I can't\n\tfind Mr. Right, Buddy, I can't find\n\thim no matter how hard I look, all\n\tI find is a whole pile of Mr.\n\tWrongs. But this is the worst ever\n\tbecause it wasn't his fault. It was\n\tmy fault, oh yes, my fault, I was\n\tbad -- oh God, I was bad, you\n\twouldn't believe how bad I was.\n\n\t\t\tBUDDY \n\t\t(a little smile)\n\tWhat'd you do, Rose?\n\n\t\t\tROSE \n\tBuddy, I was horrible. I can't tell\n\tyou who it was, but do you know\n\twhat I did? I sat on his lap and\n\tgot ahold of him and wiggled and\n\twiggled my ass on him and was\n\tworse'n you could know, a child\n\tlike you. Why, I let one of my tits\n\tfall out deliberate on purpose and\n\tpractically smack him in the face\n\twith it and I let my dern skirt\n\tcome up so he could see my\n\tdrawers... \n\t\t(pauses, realizes this\n\t\t isn't too dignified)\n\tBut to get back serious to what I\n\twas sayin', it is not only, Buddy,\n\tthe loss of him but my own bad\n\tbehavior what bothers me so...\n\n\t\t\tBUDDY \n\tYou were pretty bad, huh?\n\n\t\t\tROSE \n\tWhy, it has just made me ill,\n\tBuddy. I'm sick. I don't want to\n\teat nothin', I don't, and me I got\n\ta good appetite, that ain't nat'ral\n\tfor me. I'm ill.\n\n\t\t\tBUDDY\n\t\t(slyly, pretends he\n\t\t doesn't know)\n\tBut, Rose, what is the cause of it\n\tall?\n\n\t\t\tROSE\n\tPromise not to tell Doll? -- or\n\tnobody? Buddy, it's your Daddy! I'm\n\tso much in love with him I am out\n\tof my mind!\n\n\t\t\tBUDDY\n\tBut, Rose, how could such a thing\n\tas that happen?\n\n\t\t\tROSE\n\tI fell madly in love with him when\n\the called me Rosebud. You know that\n\tfirst day when I come and he said I\n\tlooked graceful like a capital\n\tletter S and called me Rosebud? I\n\tfell madly in love with that man\n\tright then.\n\t\t(sighs tragically)\n\tBut it's a lost love, Buddy. He's a\n\tgood man and won't have nothin' to\n\tdo with me.\n\nANOTHER ANGLE, on Rose and Buddy in the bed. Buddy has\npropped on an elbow and is staring down at her breasts in the\nmoonlight -- we see the soft notch between her breasts in the\nopen V of her thin nightgown. She is completely unself\nconscious with him.\n\n\t\t\tBUDDY \n\t\t(casually)\n\tCan I touch you here?\n\nBefore she can answer, he touches her breast with his finger\nthrough her nightgown.\n\n\t\t\tBUDDY (CONT'D)\n\tHmmm, it's soft. It's awful soft.\n\n\t\t\tROSE \n\t\t(casually, doesn't object)\n\tWhat did you expect?\n\n\t\t\tBUDDY \n\tWell, I thought they were more like\n\ta cantaloupe.\n\n\t\t\tROSE \n\tHa ha ha, that's some idea, a\n\tcantaloupe.\n\n\t\t\tBUDDY \n\t\t(touches her breast more\n\t\t boldly, his hand outside\n\t\t the nightgown)\n\tThere's some kind of gristle in it,\n\tthough.\n\n\t\t\tROSE \n\tBuddy, quit that, you're just a\n\tchild, you're not supposed to be\n\tinterested in such things.\n\n\t\t\tBUDDY \n\tActually, I am, though.\n\n\t\t\tROSE \n\t\t(dreamily, thinking of\n\t\t Daddy as she smokes\n\t\t cigarette and stares up\n\t\t at the ceiling)\n\tYou know, that Daddy of yours is\n\tthe funniest man, the things he\n\tsays, you never know what's going\n\tto come out of his mouth next.\n\n\t\t\tBUDDY\n\tCan I put my hand inside your\n\tnightgown, Rose?\n\n\t\t\tROSE \n\tNo, you can't. And I'll tell you\n\tthis -- he scares me. As kind as he\n\tis, he scares me. You can't fool\n\taround with him, not with that man.\n\tAnd, boy, I sure better not try\n\tnothin' like that with him again,\n\the'll fire me.\n\n\t\t\tBUDDY\n\tRose, can't I see what the nipple\n\ton it is like?\n\n\t\t\tROSE\n\t\t(frowns)\n\tBuddy, what's come over you? A\n\tchild like you, askin' such things.\n\n\t\t\tBUDDY\n\tBut I'm curious, Rose.\n\nPuts his hand in her nightgown.\n\n\t\t\tROSE \n\tBuddy, get your hand offa me! Quit\n\tit, get you hand away...\n\nTakes his wrist.\n\n\t\t\tBUDDY \n\tJust for a second. Please, Rose,\n\twhat's the harm?\n\n\t\t\tROSE \n\t\t(gently)\n\tBuddy, you don't realize it but\n\twhat you're doing isn't nice.\n\n\t\t\tBUDDY \n\tAw, come on, Rose, I want to see\n\twhat the nipple on it is like.\n\n\t\t\tROSE \n\tYou don' t need to know that. It's\n\tnone of your business.\n\n\t\t\tBUDDY \n\tAw, be a good sport, Rose. \n\t\t(sweetly, almost sugarily)\n\tYou like me, don't you? I like you\n\ta lot.\n\nINT. HILLYER HOME - MASTER BEDROOM - NIGHT\n\nCUT TO a shot of Mother's bedroom-study in the moonlight. We\nsee Daddy lying wide-awake in a single bed staring broodingly\nout into space. Mother lies asleep in a big four poster in\nthe background of the shot. Daddy sighs wearily to himself in\nthe grip of \"insomnia in reverse.\"\n\nINT. HILLYER HOME - BUDDY'S BEDROOM - NIGHT\n\nCUT BACK to Buddy and Rose in bed. He has evidently sweet\ntalked her into letting him fiddle with her; his hand is- in\nher nightgown. There is no indication of lewd interest on\nRose's part, a peeved and exasperated look is on her face.\nBuddy seems quite fascinated, however.\n\n\t\t\tROSE \n\tWell, are you satisfied now? Can we\n\tjust lie and talk, huh?\n\n\t\t\tBUDDY \n\tHmmph. It has a nipple, all right.\n\n\t\t\tROSE \n\t'Course it does.\n\n\t\t\tBUDDY \n\tFirst I couldn't feel it, but now I\n\tfeel it easily, it's like a little\n\tacorn.\n\n\t\t\tROSE \n\t\t(moistens her lips,\n\t\t swallows; it is affecting\n\t\t her; she frowns)\n\tAll right, that's enough. \n\t\t(firmly pushes his hand\n\t\t away)\n\tYou're just a child and wouldn't\n\tunderstand it, but that type of\n\tthing can stir a girl up. Now lie\n\tback and we'll talk.\n\n\t\t\tBUDDY \n\tThat was very interesting. Thank\n\tyou, Rose.\n\n\t\t\tROSE \n\t\t(lighting cigarette)\n\tDon't mention it.\n\n\t\t\tBUDDY\n\t\t(pensively, with the\n\t\t solemn pedanticness of a\n\t\t precocious child)\n\tIt was softer'n I thought, that was\n\tmy main impression. You know, if\n\tyou hit a girl there it would hurt\n\ther a lot.\n\n\t\t\tROSE \n\tWho would want to do such a thing\n\tas that?\n\n\t\t\tBUDDY \n\tWell, some fiend might.\n\n\t\t\tROSE \n\t\t(stares wonderingly at\n\t\t him)\n\tYou know, Buddy, sometimes I can't\n\tfigure you out at all. You can be\n\tvery nice, but like your mother\n\tsaid there's an evil streak in you.\n\n\t\t\tBUDDY \n\tThere's an evil streak in\n\teverybody, Rose.\n\n\t\t\tROSE \n\tThere ain't none in your Daddy. You\n\tknow, what happened has just made\n\tme love him all the more. I not\n\tonly love him, I respect him, I\n\tadmire him.\n\n\t\t\tBUDDY \n\tRose, I have a serious favor to ask\n\tyou.\n\n\t\t\tROSE \n\tMost men wouldn't do what he done.\n\tIf they can get a girl they go\n\tright ahead and get her -- I guess\n\tto hell they do, just like a dern\n\trabbit. 'Course later they'll tell\n\ther she's no good when they done\n\tthe same thing their selves.\n\tThey're a bunch of monkeys. I like\n\t'em, but they're a bunch of\n\tmonkeys.\n\n\t\t\tBUDDY \n\t\t(trying to be casual)\n\tRose, since you're here in bed with\n\tme and everything and I've already\n\ttouched your titty...\n\nCan't quite say it; leans over and whispers in her ear and we\ndon't hear what he says.\n\n\t\t\tROSE \n\t\t(her eyes open wide as he\n\t\t whispers)\n\tWhy, Buddy, shut your mouth! What\n\tan awful thing to say, and where\n\tdid you get any such idea as that,\n\tanyhow?\n\n\t\t\tBUDDY \n\tI'm curious to see what it's like.\n\tI'm very curious, Rose.\n\n\t\t\tROSE \n\tWell, now that is just too bad!\n\tCuriosity killed the cat.\n\n\t\t\tBUDDY \n\tYeah, but satisfaction brought him\n\tback. Can I?\n\n\t\t\tROSE \n\tNo! You ought to be ashamed of\n\tyourself astin' such a nasty things\n\ta child your age!\n\n\t\t\tBUDDY\n\tCan't I touch it a little, Rose --\n\tnot a lot, just a little?\n\n\t\t\tROSE \n\tOf course you can't! I'm... I'm\n\tshocked at you, Buddy, real\n\tshocked! Now you be quiet or I'm\n\tgoing back to my own bed!\n\n\t\t\tBUDDY\n\tPlease, Rose. I'm curious, that's\n\tall, I have a natural curiosity,\n\tit's only human. You're my friend,\n\taren't you? Don't you like me? \n\t\t(again sweetly, almost\n\t\t sugarily)\n\tI like you, Rose, a lot -- in fact,\n\tI love you.\n\n\t\t\tROSE \n\t\t(softens despite herself)\n\tWell, you're sweet, but you don't\n\treally love me.\n\n\t\t\tBUDDY \n\tYes, I do. Please, Rose, be a good\n\tsport.\n\n\t\t\tROSE \n\tBuddy, you're just a child.\n\n\t\t\tBUDDY \n\tI'm thirteen. And I have a natural\n\tcuriosity. It's only nature, Rose,\n\tthat's all. Now what's wrong with\n\tnature, huh?\n\n\t\t\tROSE \n\tWell, nothin'.\n\nINT. HILLYER HOME - MASTER BEDROOM - NIGHT\n\nCUT TO a shot of Daddy sitting on the edge of his bed in\npajamas. He looks frowzle-haired and glum. The CAMERA FOLLOWS\nhim as he wearily gets up and walks across the bedroom in the\nmoonlight and takes a package of cigarettes from a bureau. Be\nglances over his shoulder as we hear Mother.\n\n\t\t\tMOTHER \n\tWhat's the matter, hon? Is anything\n\twrong?\n\n\t\t\tDADDY \n\tNo, darlin'. Just that damnable\n\tinsomnia in reverse. I sleep like a\n\tbaby for an hour then I'm wide\n\tawake. You go back to sleep.\n\nDaddy lights a cigarette and walks to the window and stares\nout at the moonlit night.\n\nThe CAMERA MOVES IN CLOSER on his face and we see a weariness\nand strain he has not shown before.\n\n\t\t\tDADDY \n\tThe Depression has got me. That\n\tmiserable hotel, no money anywhere,\n\tstrong men out of work, children\n\thungry. It's a great life if you\n\tdon't weaken.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - BUDDY'S BEDROOM - NIGHT\n\nA shot close on Rose and Buddy in bed. Evidently Rose has\nweakened and is allowing him to fiddle with her, but we can\nonly surmise this, the shot is on their heads and shoulders\nand a cloud has crossed the moon, the light is more dim. A\ndifferent look is on her face, a solemn expression as if she\nis listening to some far away sound that she finds strangely\nhaunting. She moistens her lips, speaks in a slightly feeble\nvoice.\n\n\t\t\tROSE \n\tYou better quit that.\n\n\t\t\tBUDDY \n\tBut Rose...\n\n\t\t\tROSE \n\tI must be outta my mind. Buddy,\n\tquit it.\n\n\t\t\tBUDDY \n\tAm I hurting you?\n\n\t\t\tROSE \n\t\t(pauses, stares off as if\n\t\t listening, then in an\n\t\t even feebler tone, a half\n\t\t whisper)\n\tNo. No, you're not hurting me. \n\t\t(moistens her lips,\n\t\t swallows)\n\tBut I think you better quit it.\n\n\t\t\tBUDDY \n\tBut why, if I'm not hurting you?\n\n\t\t\tROSE \n\tYou wouldn't understand.\n\t\t(puts a hand on his\n\t\t shoulder as if to push\n\t\t him away, but can't; puts\n\t\t her other hand over her\n\t\t eyes)\n\tOh, God, I must be outta my mind.\n\tWhat would your Momma think?\n\nThe hand falls limply from Rose's eyes and she turns her head\nto the side and closes her eyes. Helplessly, she lies there\nas the boy fiddles with her.\n\nINT. HILLYER HOME - FRONT HALL - NIGHT\n\nCUT TO a shot of Daddy walking down the downstairs hall in a\nbathrobe and slippers. He looks very frowzled and sleepy.\n\nINT. HILLYER HOME - KITCHEN - NIGHT\n\nON Daddy as he walks into the kitchen, turns on the light. He\ngoes to the ice box, an old-fashioned type made of wood that\ntakes cakes of ice. Be pours out a glass of milk.\n\nINT. HILLYER ROME - BUDDY'S BEDROOM - NIGHT\n\nCUT TO a very CLOSE SHOT on Rose's face. The light is dim but\nwe see perspiration on her forehead. Her breathing is not\nnormal. Her eyes are shut tight, her teeth are clenched.\n\nCUT TO a shot CLOSE on Buddy. We do not see what he is doing,\nbut evidently he is fiddling with her. He seems quite\ninterested in the proceedings.\n\n\t\t\tBUDDY \n\tRose, beyond a doubt this is the\n\tmost fascinating experience of my\n\tlife.\n\nINT. HILLYER HOME - KITCHEN - NIGHT\n\nCUT TO a shot of Daddy in the kitchen as he sits rather\ngloomily at the kitchen table drinking the glass Of milk.\n\n\t\t\tDADDY \n\t\t(to himself)\n\tEhh-hh, Lord, man born of woman\n\thath few days and they are full of\n\ttrouble.\n\nINT. HILLYER HOME - BUDDY'S BEDROOM - NIGHT\n\nCUT TO a shot close on Rose ai Buddy in the bed. The shot is\nof their heads and shoulders.\nShe has an arm very tight around his shoulders and her eyes\nare shut tight. The moment of truth is at hand.\n\n\t\t\tROSE \n\tOhh-hh! Ohhh-hh! \n\t\t(it's all over; she twists\n\t\t sideways, puts both arms\n\t\t around him)\n\tOh, Buddy, you're so sweet. I love\n\tyou a lot.\n\nINT. HILLYER HOME - KITCHEN - NIGHT\n\nCUT TO a shot of Daddy as he washes out the glass in the\nsink.\n\nINT. HILLYER HOME - BUDDY'S BEDROOM - NIGHT\n\nCUT TO a shot of Rose and Buddy in the bed. The extremity of\nher crime has dawned on Rose and she is sitting up in the bed\nwith a look of horror on her face. Buddy is staring worriedly\nat her.\n\n\t\t\tBUDDY \n\tRose, are you all right? Are you\n\tsick or something?\n\n\t\t\tROSE \n\t\t(staring off in space,\n\t\t lost in horror)\n\tNo. No, I'm all right. \n\t\t(turns, stares at him,\n\t\t puts a hand in woe on her\n\t\t forehead)\n\tOh, God, what have I done? I have\n\trobbed a cradle and fallen into\n\thell!\n\t\t(fumbles desperately on\n\t\t bed for cigarettes)\n\tI must be crazy, a child like you.\n\tOh, God, oh, Lord. This is awful,\n\tthis is terrible, I gotta get outta\n\there!\n\nANOTHER ANGLE, on Rose and Buddy as Rose in a panic gets out\nof the bed, pulls down her thin nightgown and tiptoes toward\nthe door. She stops and looks back as a chilling thought\noccurs to her.\n\n\t\t\tROSE \n\tBuddy, you wouldn't tell nobody,\n\twould you?\n\n\t\t\tBUDDY \n\t\t(a trifle too piously)\n\tDon't worry, Rose, I won't tell a\n\tsoul.\n\n\t\t\tROSE \n\tI sure hope you don't.\n\t\t(still in a panic)\n\tI gotta get outta here, good night.\n\n\t\t\tBUDDY \n\t\t(sweetly)\n\tGood night, Rose.\n\nINT. HILLYER SOME - UPSTAIRS HALL AND DOWNSTAIRS HALL\n\nCUT TO a shot of Daddy walking down the downstairs hall in\nhis bathrobe. The shot is down the staircase and Rose in the\nupstairs hall tiptoes into the picture. A floorboard creaks\nand he looks up and sees her.\n\n\t\t\tDADDY \n\tRose, what are you doing up?\n\n\t\t\tROSE \n\tNothin', just goin' to the\n\tbathroom.\n\n\t\t\tDADDY \n\tIs anything wrong?\n\n\t\t\tROSE \n\tNo, sir.\n\n\t\t\tDADDY \n\tWell, good night.\n\nANOTHER ANGLE on Rose in the upstairs hall. Fortunately for\nher the light is dim. Her knees are shaking beneath the\nnightgown, she looks as if she might faint.\n\n\t\t\tROSE \n\tGood night.\n\nThe CAMERA FOLLOWS her as she goes on shaky legs down the\nhall.\n\nINT. HILLYER HOME - ROSE'S BEDROOM - NIGHT\n\nCUT TO a shot of Rose as she enters her small bedroom.\nFeebly, as if totally exhausted, she shuts the door behind\nher then leans against a bureau and states into its mirror.\nThe horror of her own criminality has overwhelmed her. With\ntrembling hands, she takes a cigarette from her half empty\npack and finds a wooden kitchen match on the bureau.\nHer hands tremble visibly as she strikes the match. She has\nnot turned on the light in her room and her considerable\ncharms are very apparent in the orange glow of the match.\nBurning match in her fingers, she stares at her own\nreflection in the bureau mirror, transfixed by a horrible\nrealization.\n\nINT. HILLYER HOME - DREAM - CELLAR\n\nQUICK DISSOLVE TO BLURRED SCREEN: the border of the screen is\nblurred, we are obviously seeing a nightmare fantasy. The\nshot is of an eager, excited, diabolically mischievous Buddy\nand an astonished, awed DOLL. They are in some far dark\nrecess of the cellar of the house and the scene is furtive,\nmurky, cobwebby.\n\n\t\t\tBUDDY \n\tWait till you hear what happened!\n\tNow you wont believe this, Doll,\n\tbut Rose came in my room and got in\n\tmy bed last night...\n\nANOTHER ANGLE on Buddy from below with candlelight giving his\nchild's face a sinister look. Now he has \"Dracula\" teeth and\nevil arched eyebrows.\n\n\t\t\tBUDDY (CONT'D)\n\t... and she sweated and snorted\n\tlike a horse and had a horrible\n\tfit, her eyebrows were all\n\tscrunched up and she groaned like\n\tshe was eying and foamed at the\n\tmouth!\n\nINT. HILLYER HOME - ROSE'S BEDROOM - NIGHT\n\nCUT TO a shot of Rose standing horrified before the mirror.\nThe match is still burning in her fingers.\n\n\t\t\t\t\t\t\tQUICK CUT TO:\n\nINT. HILLYER HOME - MASTER BEDROOM/STUDY\n\nA shot of Mother in her study, a worried Doll stands before\nher. The border of the screen is blurred, it is another flash\nof fantasy.\n\n\t\t\tMOTHER \n\tYes, dear, what is it?\n\n\t\t\tDOLL \n\tMother, Buddy says Rose got in his\n\tbed last night and he fiddled with\n\ther and she snorted and had a fit --\n\tand he says I would too if I was\n\tgrown-up. Is it true, Mother --\n\twould I sweat and snort and froth\n\tat the mouth and have a horrible\n\tfit like he says?\n\nMother stares in consternation at Doll.\n\n\t\t\t\t\t\t\tQUICK CUT TO:\n\nINT. HILLYER HOME - FRONT PORCH - NIGHT\n\nA shot of Daddy and Rose on the front porch of the house. The\nscene is murky, dark, gloomy night and the weather is bad.\nDaddy has his arm rigidly thrust outward as he points down\nthe driveway. A weeping, slumped Rose sadly walks down the\nsteps carrying her cardboard suitcase. Fantasy.\n\n\t\t\tDADDY \n\tOut! Out, you viper in the grass!\n\tOut! Never darken our doorstep, you\n\timmoral, terrible girl!\n\nINT. HILLYER HOME - ROSE'S BEDROOM - NIGHT\n\nCUT BACK to Rose standing before the mirror, sick with\nhorror. A feeble whimper-like groan comes from her.\n\n\t\t\tROSE\n\tOhh-hh, ohhh-hh... \n\t\t(match burns her fingers,\n\t\t she shakes it out)\n\tOuch! Oh-hh... ohh...\n\nANOTHER ANGLE on Rose as she turns from the bureau and stares\noff into space, a very badly frightened girl. Half-crying,\nshe speaks to herself.\n\n\t\t\tROSE (CONT'D)\n\tHe'll tell 'em for sure, he will.\n\tOh, Lord, what can I do?\n\nINT. HILLYER HOME - BUDDY'S BEDROOM - NIGHT\n\nCUT TO a shot of Buddy half asleep in bed. The light of the\nlamp by his bed goes on and he sleepily opens his eyes. The\nCAMERA COMES BACK and we see Rose in her nightgown standing\nby his bedside. She is very pale and tears are on her cheeks.\n\n\t\t\tROSE \n\tI hate to turn on this light, you\n\tDaddy's awake downstairs, but I\n\thave to take the chance.\n\t\t(sits by him on bed)\n\tBuddy, please don't tell on me.\n\n\t\t\tBUDDY\n\t\t(rather coolly)\n\tI said I wouldn't. \n\n\t\t\tROSE\n\t\t(her lip trembles)\n\tBuddy, I have to ask you, as bad as\n\tI've been please have pity on me\n\tand don't ruin me by telling them\n\twhat I did. I know it was bad, it\n\twas bad and dumb. But mostly it was\n\tdumb, I didn't mean you no harm,\n\tI'd never want to hurt a hair on\n\tyour head and that's the truth. I\n\tlove you. But they'd think I did,\n\tthey'd think I was awful, they'd\n\tdespise me and hate me...\n\nRose bows her head and begins crying into her hands.\n\nCUT TO a CLOSE SHOT of Buddy. We hear the soft sound of Rose\nweeping over the shot. Buddy is affected, his flinty child's\nheart has been touched, but he is not quite ready to admit it\nyet. He is struggling with himself, trying to remain \"cool\"\nand not show his emotion. He frowns, moistens his lips,\nswallows. With seeming coolness, very much as in the scene\nwith Doll in which he deprecated Daddy's stand at\nThermopylae, he shrugs.\n\n\t\t\tBUDDY \n\tWell, I don't know what you're\n\tworried about. It was my idea, I\n\twas the one who thought of it, not\n\tyou.\n\nThe CAMERA PULLS BACK to include Rose. She is staring at the\nboy with hopeless despair.\n\n\t\t\tROSE \n\tYou don't understand. They'd blame\n\tme, not you. And they'd think I was\n\tawful, a disgustin' girl, which I\n\tam, but Buddy, please don't tell\n\tthem. Please don't. Ill have to go\n\tand I love it here, I love your\n\twhole fam'ly, your Daddy, your\n\tMother... \n\t\t(pauses, then makes her\n\t\t final and ultimate plea\n\t\t in a shaking voice as\n\t\t tears run down)\n\tBuddy, I know I'm no good, I'm a\n\tbad girl but I can't help it,\n\tplease have pity on me and don't\n\ttell! Please don't, please...\n\nToo much for Buddy, he loses his \"cool.\" He swallows and\nblinks as if he might cry, then sits erect in the bed and\nsquares his shoulders and assumes a stern expression Daddy\nstyle.\n\n\t\t\tBUDDY \n\t\t(very solemnly)\n\tRose, they could stick splinters\n\tunder my fingernails, and I will\n\tnever say a word! I will never tell\n\tthem, because... I love you!\n\n\t\t\tROSE \n\t\t(sees that he means it,\n\t\t smiles in relief and\n\t\t throws her arms around\n\t\t him)\n\tOh, Buddy, you do love me! I knew\n\tyou did, knew it all the time...\n\nINT. HILLYER HOME - MASTER BEDROOM - NIGHT\n\nCUT TO a shot of Daddy, lying in bed and staring up\nsleeplessly at the ceiling. Insomnia in reverse has got him.\n\n\t\t\tDADDY \n\t\t(a half whisper to\n\t\t himself)\n\tEhh-hh, Lord... great life if you\n\tdon't weaken.\n\nINT. HILLYER HOME - BUDDY'S BEDROOM - NIGHT\n\nCUT TO a shot of Rose and Buddy. Rose is sitting on the bed\nbeside him and she has dried her tears and got herself in\nhand.\n\n\t\t\tROSE \n\tWell, Ill tell you this. I have\n\tlearned a lesson tonight. I wasn't\n\tgonna run around, but when I start\n\tbotherin' your Daddy and worse\n\trobbin' a cradle, I gotta face the\n\tfacts of life. \n\t\t(pauses, then with firm\n\t\t resolution)\n\tTomorrow mornin', I'm gonna get\n\tmyself up and go out.\n\n\t\t\tBUDDY \n\t\t(a wee mite puzzled)\n\tYou're going to get yourself up and\n\tgo out?\n\n\t\t\tROSE \n\tBuddy, Mr. Right is out there\n\tsomewhere and I'm gonna find him!\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - KITCHEN - DAY\n\nA shot of a coolly angry Mother in the kitchen. It is late\nmorning. As she talks the CAMERA PULLS BACK to show a\nsheepish Buddy standing \"on the carpet before her. The other\nchildren, Doll and Waski, are seated at the kitchen table\nhaving hamburgers for lunch. They are happily smiling with\nschadenfreude amusement at their brother's discomfiture.\n\n\t\t\tMOTHER \n\tBrother, when I have to wake you up\n\tat eleven o'clock in the morning\n\tyou're either sick or you were up\n\tvery late last night. \n\t\t(points a finger at him)\n\tAnd you weren't reading Huckleberry\n\tFinn. I looked and its not in your\n\troom. Now what were you doing?\n\n\t\t\tBUDDY \n\t\t(sheepish)\n\tMother, I have to tell the truth. I\n\twasn't reading Huckleberry Finn, I\n\twas reading one of those Little\n\tDirty Comic Books.\n\n\t\t\tMOTHER \n\t\t(sadly)\n\tOh, Brother, I am so disappointed\n\tin you. You mustn't look at those\n\thorrible things, they degrade the\n\thuman image.\n\n\t\t\tBROTHER \n\t\t(hangs head)\n\tThey're filthy, Mother.\n\n\t\t\tMOTHER \n\tSex isn't ugly, sex is one of the\n\tmost beautiful things in life, the\n\tcreative power of the universe is\n\tbehind it.\n\n\t\t\tBROTHER \n\tI know, Mother.\n\n\t\t\tMOTHER \n\tBut we must respect that power, we\n\tmust be in awe of it.\n\n\t\t\tBROTHER \n\tI am in awe of it, Mother.\n\n\t\t\tMOTHER \n\tI don't think you are sufficiently\n\tin awe of it. Get the castor oil.\n\n\t\t\tBROTHER \n\t\t(winces, as Doll and Waski\n\t\t happily smile)\n\tOh, Mother, not the castor oil.\n\n\t\t\tMOTHER\n\tThis isn't punishment, I don't\n\tbelieve in punishment. It's for\n\tyour health. Obviously you're sick\n\tif you can act like that.\n\nAs she talks, Buddy reluctantly gets a bottle of castor oil\nand a tablespoon from a shelf and brings it to her. A smiling\nDoll comes forward and hands Buddy half of an orange. He\nmakes a face at her. Mother takes the bottle and pours out a\ntablespoon of castor oil.\n\n\t\t\tBUDDY\n\t\t(wanly)\n\tMother, cant you make it calomel\n\tinstead of castor oil?\n\n\t\t\tMOTHER\n\tThis is for your own good. When you\n\tlook at negative, destructive\n\tthings like those little filthy\n\tcomic books, you are sick. Here,\n\ttake this.\n\n\t\t\tBUDDY\n\t\t(he is resigned, there's\n\t\t no way out; he makes a\n\t\t face, swallows the castor\n\t\t oil)\n\tGeccch, yehh, guhhhh!\n\n\t\t\tMOTHER \n\tStop gagging like that and putting\n\ton a show, and swallow it. \n\n\t\t\tBUDDY \n\tUhhh, gahdam stuff! \n\n\t\t\tMOTHER \n\tWhat did you say, Brother? \n\n\t\t\tBUDDY \n\tI said ahhh-dam stuff. \n\n\t\t\tMOTHER\n\tNo, you didn't say that, Brother.\n\n\t\t\tBUDDY \n\tYes, I did, mother. Your hearing\n\taid isn't working right. I said\n\tahhh-dam stuff.\n\n\t\t\tDOLL \n\tNo, Mother, he's lying...\n\n\t\t\tBUDDY\n\tShut up, Doll. I'll cut your guts\n\n\t\t\tWASKI\n\t\t(happily excited,\n\t\t stammering)\n\tHe did lie, and... and... and\n\tMother, yesterday he stole money\n\tout of your pocketbook!\n\n\t\t\tBUDDY\n\tQuiet, you little muddy-eyed brat,\n\tor Ill kill you!\n\n\t\t\tMOTHER\n\tChildren, children! Be quiet, all\n\tof you! \n\t\t(the children at once\n\t\t simmer down)\n\tThe vibrations in this house are\n\tstrange today. Where's Rose,\n\tanyhow?\n\n\t\t\tBUDDY\n\tShe's getting herself up to go out.\n\n\t\t\tMOTHER \n\t\t(frowns, adjusts hearing\n\t\t aid)\n\tWhat'd you say, Brother?\n\n\t\t\tBUDDY \n\tShe's getting herself up to go out.\n\tI think she's coming down the hall\n\tnow.\n\n\t\t\tMOTHER\n\tOh, yes, it's Thursday. \n\t\t(glances around at sound\n\t\t of an opening door)\n\tHello, Rose, dear... \n\t\t(her eyes open wide as she\n\t\t stares at Rose,\n\t\t disconcerted; now weakly)\n\t... my, you're... looking pretty...\n\nCUT TO a shot of Rose in the doorway of the kitchen. She is\nquite an apparition. She wears bright red lipstick, pink\nrouge on her cheeks, mascara and her hair is coiffed up in\nsome outlandish manner, but her clothes are the most\nremarkable thing of all.\n\nThe skirt is of strange, pink, semi-shiny and very thin\nmaterial and has about a dozen tiny little flowers that could\nbe rosebuds sewed on it. It fits extremely snugly to say the\nleast. The blouse seems a composite: it has frilly white\nsleeves that are opaque and otherwise is made of filmy white\nmaterial that is hardly opaque at all. She has no bra and her\nbreasts are half visible, the nipples denting the material.\nIt is pretty wild for 1935. She seems to have on no underwear\nof any kind; the skirt, which clings to her like a bathing\nsuit, shows no panty seams. She is carrying a shiny black\npatent leather pocketbook and has on high heel black patent\nleather shoes and no stockings. An ingenuous little smile is\non her face.\n\n\t\t\tROSE \n\tHow do you like my outfit? I made\n\tmost of it myself.\n\nRose walks in, \"modeling\" the outfit and the CAMERA PICKS UP\nMother.\n\n\t\t\tMOTHER \n\t\t(smiling, slightly aghast)\n\tWell, it's... very gay.\n\nWe hear the SOUND of the Model A on the driveway.\n\n\t\t\tBUDDY \n\tHere comes Daddy.\n\n\t\t\tROSE \n\t\t(staring down admiringly\n\t\t at the outfit)\n\tI have a knack for designing\n\tclothes. But I had to buy the shoes\n\tand the pocketbook.\n\n\t\t\tMOTHER \n\t\t(makes up her mind to\n\t\t defend Rose)\n\tWell, I think it's charming, Rose. \n\t\t(tactfully)\n\tBut don't you think... ah, the\n\tskirt is a little tight?\n\n\t\t\tROSE \n\tOh, no, that's the style. It's\n\tmeant to be clinging.\n\nWe hear the PORCH DOOR SLAM. Smiling, happy, Rose glances\naround. We hear the SOUND of the kitchen door opening.\n\nCUT TO a POV SHOT of Daddy in the kitchen doorway. As usual,\nhe has a rolled-up Glenville Tribune in his hand and a Straw\nhat on the back of his head.His hands are on his hips and he\nis hunched forward as if he cannot believe what he sees.\n\n\t\t\tDADDY \n\tYe gods and little fishes. What\n\thave you done to yourself, Rose?\n\nON THEM ALL. Rose is smiling, happy to be the center of\nattention.\n\n\t\t\tROSE \n\tNothin'. I got myself up, that's\n\tall.\n\n\t\t\tDADDY \n\tGot yourself up?\n\n\t\t\tROSE \n\tYeah. I'm goin' out.\n\nDaddy walks slowly into the kitchen shaking his head. Sits at\ntable.\n\n\t\t\tDADDY \n\tUm-hmm. Well, that is the damndest\n\toutfit I ever saw in my life. You\n\twalk down the street like that and\n\tthey'll put you in jail, Rose.\n\n\t\t\tMOTHER \n\tWhy, they won't either. She looks\n\tpretty. And I wish you wouldn't\n\tpick on the poor girl all the time.\n\tDon't listen to him, Rose, you look\n\tpretty, even beautiful.\n\n\t\t\tROSE \n\t\t(smiles affectionately at\n\t\t Mother)\n\tYou're so sweet.\n\n\t\t\tDADDY \n\tIf you've got time before you go\n\t\"out,\" get me a half-a-cup of\n\tcoffee, Rose. Not a whole cup, a\n\thalf-a-cup.\n\n\t\t\tROSE \n\tWhy, sure, always got time to get\n\tyou a half-a-cup, and one of these\n\tdays I'm gonna get you a whole cup\n\tand see what happens.\n\n\t\t\tDADDY \n\t\t(a growl, doesn't like\n\t\t jokes about his foibles)\n\tUm-hmmuhh. I never drink a whole\n\tcup, my nerves can't stand the\n\tcaffeine. Ehh-hh, Lord awful\n\tinsomnia in reverse last night. Lay\n\tthere and sweated blood for hours.\n\n\t\t\tDOLL \n\t\t(sweetly)\n\tDaddy, Buddy was up late last night\n\treading little dirty comic books.\n\tMother gave him a dose of castor\n\toil and he cursed it, he took the\n\tLords name in vain, then claimed he\n\thadn't said it. He lied, Daddy.\n\n\t\t\tMOTHER \n\tYou mustn't be a tattletale, dear.\n\tYou mustn't be Delilah-ish and\n\tJezebel-ish toward your brother,\n\tdear.\n\n\t\t\tDOLL \n\tI'm only trying to help him,\n\tMother.\n\n\t\t\tBUDDY \n\tHeh, what a hypocrite.\n\n\t\t\tMOTHER \n\t\t(to Daddy)\n\tI do wish you'd speak to Brother.\n\tIt's true he's been looking at\n\tthose horrible little books again.\n\n\t\t\tDADDY \n\t\t(stares sternly at Buddy)\n\tLay off of that stuff, son. It\n\tupsets your mother.\n\n\t\t\tMOTHER \n\t\t(genuinely worried)\n\tI'm serious. We forget he's just a\n\tchild. I wish you'd speak to him.\n\n\t\t\tDADDY \n\tI'll take him with me downtown. \n\t\t(glances at Rose as she\n\t\t comes with coffee)\n\tAnd you, too, Rose, if you want a\n\tride.\n\n\t\t\tROSE \n\tSure, love one. Here's your half-a\n\tcup of coffee.\n\nDaddy is staring with a very dubious frown at Rose's skirt.\nHe slowly shakes his head.\n\n\t\t\tDADDY \n\tThat's a pretty stylish skirt,\n\tRose. The only thing I don't\n\tunderstand is how did you ever get\n\tit on.\n\n\t\t\tROSE \n\t\t(happy, pleased by his\n\t\t interest)\n\tWell, it has buttons.\n\nPoints to little buttons on right side of the skirt.\n\n\t\t\tDADDY \n\tHow can the buttons stand the\n\tpressure?\n\n\t\t\tROSE \n\tThere are more on the other side.\n\nPoints to buttons on left side.\n\n\t\t\tDADDY \n\tTurn around, darlin'.\n\nHappy to oblige, Rose turns around. Her plump, round,\nfeminine behind is only too plainly revealed through the thin\nmaterial. Daddy slowly shakes his head.\n\n\t\t\tDADDY (CONT'D)\n\tThey'll put her in jail. The damn\n\tlittle fool might as well be naked.\n\n\t\t\tMOTHER \n\t\t(a wee mite worried)\n\tWell, it is a little tight. But it\n\tisn't as bad as all that. No one\n\twill notice unless they have such\n\tthoughts in the first place.\n\n\t\t\tDADDY \n\tWho doesn't have such thoughts? \n\t\t(glances at wristwatch)\n\tWe'd better get going.\n\n\t\t\tMOTHER \n\tYou're not having lunch?\n\n\t\t\tDADDY \n\tJust half-a-cup of coffee. I never\n\teat, darlin', you know that. Not\n\teating and reverse insomnia are my\n\tcurses. Let's go, Rose, you and\n\tBrother, let's hit the road.\n\n\t\t\tMOTHER \n\tRose, you and Brother wait in the\n\tcar. I want to speak for a moment\n\tLo Mr. Hillyer.\n\n\t\t\tROSE \n\tYes, Ma'am.\n\n\t\t\tMOTHER \n\tDoll, you and Waski run on, too.\n\nEXT. HILLYER HOME - PATIO - DAY\n\nCUT TO a shot of Rose and Buddy as they walk out onto the\npatio of the house. Rose walks down the steps to the flower\ngarden and Buddy follows.\n\nANOTHER ANGLE on Rose and Buddy as Rose picks a red rose and\nputs it in her hair.'\n\n\t\t\tROSE \n\tDid your Momma really give you\n\tcastor oil?\n\n\t\t\tBUDDY \n\tYeah.\n\n\t\t\tROSE \n\t\t(puts an arm around his\n\t\t shoulders)\n\tYou're my sweetheart.\n\nINT. HILLYER HOME KITCHEN - DAY\n\nCUT TO Mother and Daddy at the kitchen table.\n\n\t\t\tMOTHER \n\t\t(earnestly)\n\tI wish you wouldn't pick on Rose\n\tand tease her like that. Of course\n\ther clothes are silly, but she's\n\tignorant, naive, she doesn't know\n\tany better.\n\n\t\t\tDADDY \n\tThe girl worries me. If she walks\n\tdown the street like that, an army\n\twill be following her.\n\n\t\t\tMOTHER \n\tWell, I admit that outfit isn't\n\tvery modest. But she doesn't mean\n\tany harm, she just wants to\n\tattract, attention.\n\n\t\t\tDADDY \n\tShe will succeed.\n\n\t\t\tMOTHER \n\tI don't think you understand her.\n\tIt isn't sex she wants, it's love\n\tshe wants and this is the only way\n\tshe knows how to get it.\n\n\t\t\tDADDY\n\t\t(musingly)\n\tThat farmer in Gadsden was awful\n\teager to get rid of her, and I'm\n\tbeginning to see why.\n\n\t\t\tMOTHER \n\tHe and his wife both said she had a\n\tfine moral character and was\n\twonderful with children.\n\n\t\t\tDADDY \n\tWell, she loves children, all\n\tright.\n\t\t(adds dryly)\n\tShe loves everybody.\n\n\t\t\tMOTHER \n\tBut that's a wonderful quality, not\n\ta bad quality.\n\t\t(takes his hand)\n\tHave a little patience with her.\n\tShe's such a good-hearted little\n\tthing and tries so hard.\n\n\t\t\tDADDY \n\t\t(stares pensively at her)\n\tYou are the one who's good-hearted.\n\t\t(rises)\n\tAs for Rose, let's hope for the\n\tbest.\n\n\t\t\tMOTHER\n\t\t(rises, again takes his\n\t\t hand)\n\tBe kind to her. She loves you so\n\tmuch.\n\t\t(Daddy stiffens slightly,\n\t\t and she adds)\n\tIn a perfectly proper way, of\n\tcourse.\n\n\t\t\tDADDY\n\tYes, of course.\n\nEXT. HILLYER HOME - DRIVEWAY - DAY\n\nCUT TO a shot of Rose and Buddy waiting in a Model A. Rose is\nsmiling, happy to be going out. The red rose is prominent in\nher hair, Daddy walks INTO THE SHOT, gets into the driver's\nseat of the car, He glances in a wry manner at the flower in\nher hair.\n\n\t\t\tDADDY \n\tWhat have you got in your hair,\n\tgirl?\n\n\t\t\tROSE\n\tMy rose. It's kind of like a motto.\n\tPeople will say, there comes Rose\n\twith her rose.\n\nDaddy gives her another wry stare and starts the Model A.\n\nCUT TO a shot of the Model A going down the driveway.\n\nEXT. MODEL A IN TOWN - DAY\n\nANOTHER SHOT or two of the Model A on the quiet summer\nstreets of a sleepy little town in the Depression South of\nyears ago.\n\nINT./EXT. MODEL A - DAY\n\nCUT TO a shot of Daddy, Rose and Buddy in the car. Buddy is\nin the middle. Daddy is staring expressionlessly straight\nahead. His tone is sternly neutral as he speaks.\n\n\t\t\tDADDY\n\tYou were up late last night,\n\tBrother.\n\n\t\t\tBUDDY\n\tWell, a little.\n\n\t\t\tDADDY\n\tReading dirty comic bocks.\n\t\t(glances shrewdly at him)\n\tAnd you admitted it?\n\n\t\t\tBUDDY\n\t\t(a trifle uncomfortable)\n\tWell, yeah.\n\nBoth Rose and Buddy begin to look increasingly tense.\nHawkshaw the Detective is on the scent. Daddy stares ahead.\n\n\t\t\tDADDY \n\tYou were up late last night, too,\n\tRose.\n\n\t\t\tROSE \n\t\t(meekly)\n\tYes, sir. I had to go to the\n\tbathroom.\n\nA long pause, as Daddy stares ahead. His expression is\ninscrutable.\n\n\t\t\tDADDY \n\t\t(finally, \"casually\")\n\tSometimes I think I was born to be\n\ta detective. I get a feeling about\n\tthings. I'm not always right, but\n\toften I am.\n\nEXT. MODEL A BY LIGHT - DAY\n\nCUT TO a shot of the Model A as it stops for a red light.\n\nINT./EXT. MODEL A - DAY\n\nCUT TO a shot of Daddy, Rose and Buddy in the car. Daddy\nturns and stares sternly at Buddy.\n\n\t\t\tDADDY \n\tSon, was Rose in your room last\n\tnight?\n\n\t\t\tBUDDY \n\t\t(scared, but a good liar)\n\tNo. Why should Rose be in my room?\n\nDaddy sternly scans them both. They stare back \"innocently\"\nat him. Finally he seems to accept it.\n\n\t\t\tDADDY \n\tI can't imagine why. It was just a\n\tthought.\n\nDaddy shifts gears and faces front. Buddy glances upward in\nrelief, as if to say, \"Wow, that was close.\"\n\n\t\t\tDADDY (CONT'D)\n\tWhere do you want me to let you\n\tout, Rose?\n\n\t\t\tROSE \n\tOh, anywhere downtown.\n\n\t\t\tDADDY \n\tYou don't know where you're going?\n\n\t\t\tROSE \n\tOh, I'll just mosey around here and\n\tthere.\n\nEXT. MODEL A - DAY\n\nCUT TO a shot of the Model A as it stops off the main street\nof a small sleepy Southern town.\n\nINT./EXT. MODEL A - DAY \n\nCUT TO a shot through the side window on Rose, Buddy and\nDaddy.\n\n\t\t\tDADDY \n\tIs this ill right?\n\n\t\t\tROSE \n\tIt'll do just fine.\n\t\t(gets out of car)\n\tBye-bye, see you later.\n\nRose waves goodbye and walks off down the sidewalk, swinging\nher hips and her pocketbook,\n\nINT./EXT. MODEL A - DAY\n\nCUT TO a front shot of Daddy and Buddy in the car as they\nstare after Rose.\n\nEXT. STREET - DAY\n\nCUT TO a shot of POV Daddy and Buddy of Rose walking along.\nMUSIC.\n\nINT./EXT. MODEL A\n\nCUT TO Daddy and Buddy. Daddy slowly shakes his head, shifts\ngears..\n\nEXT. MODEL A - DAY\n\nCUT TO a shot of the Model A as it rolls along the main\nstreet.\n\nEXT. MODEL A - DAY\n\nANOTHER SHOT of the Model A as it abruptly turns a corner.\n\nEXT. MODEL A - DAY\n\nON the Model A as it abruptly turns around corner. Evidently\nit is circling the block.\n\nEXT. STREET - DAY\n\nCUT TO a shot of Rose as she walks along, swinging her hips\nand her pocketbook and smiling at whoever she sees. She\npasses a few people and she smiles cheerfully at them -- the\nmen stare with a flat interest at her and the women frown,\nbut she smiles at one and all.\n\nEXT. MODEL A\n\nCUT TO a shot of the Model A as it creeps along.\n\nINT./EXT. MODEL A - DAY\n\nOn Daddy and Buddy in the car.\n\nDADDY \n\nThey might arrest her. I doubt it, but they might.\n\nEXT. STREET - BUS STOP - DAY\n\nCUT TO a shot of Rose as she walks up to a bus stop. A fairly\nWELL-DRESSED MAN with a door-to-door salesman kit is standing\nthere. Rose glances at him then sidles up alongside him as if\nshe's waiting for a bus. He glances at her for a moment with\ninterest, but doesn't want to stare, looks away. We see the\nModel A stop in the background of the SHOT.\n\nEXT. STREET - DAY\n\nCUT TO a shot of Daddy and Buddy in the car, watching Rose.\n\nEXT. STREET - DAY\n\nCUT TO a shot of Rose and the Young Salesman. Rose glances at\nthe man, glances at him again, then sighs and speaks.\n\n\t\t\tROSE\n\tMy feet sure do hurt.\n\n\t\t\tYOUNG SALESMAN \n\t\t(turns to her with a slow\n\t\t smile)\n\tOh, yeah?\n\nEXT. STREET - DAY\n\nCUT TO a shot of Daddy and Buddy in the car, watching.\n\nEXT. STREET - DAY\n\nCUT TO a LONG POV SHOT of Rose and the Young Salesman. They\nare talking amiably. Both are smiling.\n\nEXT. STREET - DAY\n\nCUT TO a shot of Daddy and Buddy.\n\n\t\t\tDADDY\n\tShe has made contact.\n\nEXT. STREET - DAY\n\nCUT TO ANOTHER POV SHOT of Rose and the Young Salesman. It is\nanother LONG SHOT. MUSIC ON TRACK. They are smiling, talking.\nThe Young Salesman seems to ask Rose a question. She nods and\ntakes his arm and they walk off.\n\nEXT. STREET - DAY\n\nCUT TO Daddy and Buddy. Daddy is staring pensively at the\nscene.\n\n\t\t\tDADDY\n\tI never saw anything like it. How\n\tdid she pick him up so fast?\n\n\t\t\tBUDDY\n\tI don't know.\n\n\t\t\tDADDY\n\tThe girl strikes like a cobra.\n\nSlowly shaking his head, Daddy starts the car.\n\nEXT. STREET - DAY\n\nA shot of Rose and the Young Salesman as they walk along. She\nis holding his arm and they are smiling and talking as if the\nbest of friends. We hear MUSIC ON THE TRACK. The MUSIC\ncontinues over the following MONTAGE OF SHOTS.\n\nINT. HONKY TONK - VARIOUS SHOTS\n\nON Rose in a beer \"honky tonk\" with the Young Salesman in a\nbooth. He is drinking beer, she is drinking Coca Cola from a\nbottle.\n\nON Rose in the booth, ANOTHER ANGLE. A second man has joined\nthem, a big beefy man -- he is BUSTER.\n\nEXT. STREET - LATE AFTERNOON\n\nON Rose as she walks down a sidewalk in late afternoon with\nBuster and still another man, a tall fellow in a Coca-Cola\nDelivery Man's uniform or shirt. Rose seems to be innocently\nhappy, but the men appear to be having a mild dispute.\n\nON Rose getting into Busters car as Buster holds the door for\nher, smiling. The COCA-COLA DELIVERY MAN is left on the\nsidewalk, disappointed.\n\nINT./EXT. BUSTER'S CAR - DUSK\n\nCUT TO a shot of Rose in the car eating barbecue with Buster.\nShe is talking animatedly and he seems enchanted with her. It\nis dusk.\n\nEXT. HILLYER HOME - NIGHT\n\nCUT TO a shot of a car pulling up in the driveway of the\nHillyer house. Rose gets out, waves goodbye to Buster. It is\nnight. End MUSIC.\n\nINT. HILLYER HOME - MASTER BEDROOM - NIGHT\n\nCUT TO a shot of Daddy in pajamas peering out of the bedroom\nwindow.\n\n\t\t\tDADDY \n\tWell, she's back.\n\n\t\t\tMOTHER (O.S.)\n\tWhat time is it?\n\n\t\t\tDADDY \n\tQuarter of twelve.\n\n\t\t\tMOTHER (O.S.)\n\tIs she all right?\n\n\t\t\tDADDY \n\tI don't see any bruises or broken\n\tbones.\n\nCUT TO a shot of Mother in bed in the four poster.\n\n\t\t\tMOTHER \n\tBruises and broken bones, what kind\n\tof thing is that to say?\n\nDaddy walks INTO THE SHOT, sits on the edge of the bed.\n\n\t\t\tMOTHER (CONT'D)\n\tWhy shouldn't she go out and have\n\tboyfriends?\n\n\t\t\tDADDY \n\tNo reason at all, darlin'.\n\n\t\t\tMOTHER \n\tWell, I wish you'd stop criticizing\n\tand picking on her.\n\n\t\t\tDADDY \n\tForgive my crudity, darlin'. All\n\tI'm saying is that a girl who would\n\twear clothes like that is going to\n\tget in trouble sooner or later.\n\n\t\t\tMOTHER \n\t\t(doubtfully)\n\tWell, time will tell, won't it?\n\n\t\t\tDADDY \n\tYes, darlin', time will tell.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. HILLYER HOME - PATIO - DAY\n\nA SHOT of Mother on the patio studying. It is a sunny\nafternoon. Mother looks up idly, looks back down at her\nnotebook, then looks up again with a frown.\n\nCUT TO A POV SHOT of a SCRUFFY-LOOKING KAN as he darts behind\none tree to another. The Scruffy-looking Man does not seem\nsinister, but he definitely is scruffy.\n\nON Mother. Frowning, she puts down her notebook and rises,\nwalks toward the door of the kitchen.\n\nINT. HILLYER HOME - KITCHEN - DAY\n\nCUT TO a shot of Rose washing dishes in the kitchen. As\nusual, she is in a cheerful good humor. We see Buddy at the\nkitchen table building a model airplane. Mother comes INTO\nTHE SHOT, worried, frowning.\n\n\t\t\tMOTHER \n\tRose, that scruffy-looking man is\n\tout in the yard again.\n\n\t\t\tROSE\n\t\t(her smile fades)\n\tMrs. Hillyer, I don't know who he\n\tis, I really don't.\n\n\t\t\tMOTHER \n\tI had better call Daddy.\n\nINT. HOTEL - DAY\n\nCUT TO a shot of Daddy behind the desk of a slightly run-down\nsmall hotel of the Depression era. He is handing a key to a\nguest.\n\n\t\t\tDADDY \n\tGlad to have you with us, Mr.\n\tWatson. Make yourself at home.\n\tShadrach, take Mr. Watson's bag.\n\nA black bellboy takes the guest's bag as Daddy turns to\nanswer a BUZZING switchboard.\n\nINT. HILLYER HOME - KITCHEN - DAY\n\nCUT TO a shot of Mother talking on a phone.\n\n\t\t\tMOTHER \n\tHello, honey? That scruffy-looking\n\tman is out in the yard again.\n\nINT. HOTEL - DAY\n\nCUT TO a shot of Daddy at the switchboard. Be is grim.\n\n\t\t\tDADDY \n\tLuckily, Johnson just walked in to\n\trelieve me. I'll be right out\n\tthere!\n\nINT. HILLYER HOME - KITCHEN - DAY\n\nCUT TO a shot of Buddy and Rose in the kitchen.\n\n\t\t\tBUDDY \n\tRose, you must know who the fellow\n\tis.\n\n\t\t\tROSE\n\t\t(innocently)\n\tWell, he might be that man who\n\tfollowed me home from the store the\n\tother day. But I don't know who he\n\tis, Buddy, I really don't.\n\nEXT. HILLYER HOME - YARD\n\nCUT TO a shot of the Scruffy-looking Man. Be is half-crouched\nbehind a big oak, peering at the Hillyer house. We hear the\napproach of a car and the man looks over his shoulder.\n\nCUT TO a shot of Daddy in the Model A. The TIRES SCREECH as\nhe puts on the brakes.\n\nCUT TO a shot of the Scruffy-looking Man as he turns and\nruns.\n\nOn Daddy as he jumps out of the car.\n\n\t\t\tDADDY \n\tCome back here, sir! Come back\n\there, you!\n\nDaddy runs after the man.\n\nCUT TO a shot of Daddy running after him.\n\nCUT TO A FINAL SHOT of the Scruffy-looking Man as he leaps a\nhedge in full stride.\n\nEXT. HILLYER HOUSE - FRONT PORCH\n\nCUT TO a shot of a worried-looking Mother on the front porch\nof the house. Buddy and a meek-looking Rose are in the\nbackground in the doorway. A weary, out-of-breath Daddy comes\nINTO THE SHOT and walks up the steps, straw hat in hand.\n\n\t\t\tDADDY \n\tI couldn't catch him. He ran like a\n\tdeer.\n\nDaddy fixes a stern glance on Rose. As he does so, Mother and\nBuddy also turn and look at her. Rose smiles wanly.\n\n\t\t\tROSE \n\tI don't know him.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - MASTER BEDROOM - DAY\n\nA SHOT of Mrs. Hillyer in her bedroom study. She is drinking\na Coca-Cola and smoking a cigarette held by a bobbie pin. We\nhear the SOUND of an old-fashioned doorbell. She ignores it.\n\nEXT. HILLYER HOME - FRONT PORCH - DAY\n\nCUT TO a shot of a sullen-looking young boy on the front\nporch. He is poorly dressed. He rings the doorbell. This is\nBILLY.\n\nINT. HILLYER HOME - MASTER BEDROOM - DAY\n\nCUT TO a shot of Mother. Frowning, she gets up.\n\nEXT. HILLYER HOME - FRONT PORCH\n\nON Mother as she opens the front door. A sullen Billy stares\nat her.\n\n\t\t\tMOTHER \n\tYes?\n\n\t\t\tBILLY \n\tIs Rose here?\n\n\t\t\tMOTHER \n\tShe must have gone out for a walk\n\twith the children.\n\n\t\t\tBILLY \n\t\t(sullenly)\n\tWell, I got to see her.\n\n\t\t\tMOTHER \n\tShe isn't here. And I'm sorry, but\n\tMr. Hillyer doesn't want her to\n\thave callers during working hours.\n\n\t\t\tBILLY \n\t\t(sullenly)\n\tWhere is she?\n\n\t\t\tMOTHER \n\tI said she isn't here. NOW you go\n\thome. Be a nice boy and go home.\n\nGently but firmly, Mother shuts the door in Billy's face.\n\nA SHOT of Billy frustrated on the front porch. Sadly,\nreluctantly, he turns and walks off the porch down the steps.\n\nINT. HILLYER HOME - FRONT HALL - DAY\n\nON mother, peering worriedly through the curtains of the\nfront door.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - DINING ROOM - NIGHT\n\nA SHOT of the family at dinner at night. Daddy, Mother, Rose,\nBuddy, Doll and Waski. The SHOT FAVORS Mother.\n\n\t\t\tMOTHER \n\tThat sulky boy was here again this\n\tafternoon. I was almost scared, he\n\twouldn't go away.\n\n\t\t\tDADDY \n\t\t(throws his napkin on\n\t\t table)\n\tRose, my patience is wearing thin.\n\tFirst a scruffy man who runs like a\n\tdeer and now a sulky boy who wont\n\tgo away. This is getting to be a\n\tregular monkey and dog show.\n\n\t\t\tROSE \n\tI swear to God I don't know who in\n\tthe world he is. Really, I don't, I\n\tdon't know no boy like that, I\n\tdon't.\n\nSlowly, his face grim, Daddy returns his napkin to his lap\nand resumes eating. The children are very silent and look a\ntrifle scared.\n\n\t\t\tMOTHER \n\t\t(finally, in a small\n\t\t voice)\n\tWell, it isn't Rose's fault boys\n\tand men like her. You cant blame\n\ther for that, hon.\n\n\t\t\tDADDY \n\tRose, I realize you don't know this\n\tboy, but if you know anybody who\n\tdoes know him, if you have even a\n\tfaint clue as to who he might be,\n\tthen convey to him that he had\n\tbetter stay away from my house and\n\tstop scaring my wife... and I don't\n\tmean maybe.\n\nINT. HILLYER SOME - BUDDY'S BEDROOM - NIGHT\n\nCUT TO a shot of Buddy in his room at night. He is dressed\nand at a study table listening with cheap earphones to a\nhomemade crystal radio set. Enter a rather somber-faced Doll\nin her nightgown.\n\n\t\t\tBUDDY \n\t\t(listening)\n\tChattanooga. I had St. Louis,\n\tMissouri.\n\n\t\t\tDOLL \n\tBuddy, I'm worried about Rose.\n\n\t\t\tBUDDY \n\tSo am I.\n\n\t\t\tDOLL \n\tShe hasn't got any sense. In some\n\tways, she's awful dumb.\n\n\t\t\tBUDDY \n\t\t(takes off earphones,\n\t\t gives it a moment of\n\t\t grave consideration, then\n\t\t his opinion)\n\tIt isn't that she hasn't got any\n\tsense, Doll. Her basic intelligence\n\tis probably above average, maybe\n\tquite a bit above average.\n\n\t\t\tDOLL \n\tThen why does she act so dumb?\n\n\t\t\tBUDDY \n\tDumbness doesn't concern her, Doll.\n\tAnd neither does smartness. You see\n\t--\n\nBuddy is interrupted by the SOUND of the distant angry shout\nof a man's voice, evidently from somewhere outside in the\nwoods because Buddy and Doll turn at once toward the window.\nIn shock they listen.\n\n\t\t\tFIRST MAN'S VOICE \n\tYou son of a bitch, what are you\n\tdoing here?!\n\n\t\t\tSECOND MAN'S VOICE \n\tI'd like to ask you the same\n\tquestion, you bastard!\n\n\t\t\tFIRST MAN'S VOICE \n\tI told you to stay away from her,\n\tgoddamn you!\n\n\t\t\tSECOND MAN'S VOICE \n\tYou got no right to tell me to stay\n\taway from her, I knew her before\n\tyou did!\n\n\t\t\tBUDDY \n\tOh, boy. Oh, boy, oh boy. Daddy\n\tisn't going to like this.\n\n\t\t\tFIRST MAN'S VOICE \n\tShe told you to leave her alone,\n\tdidn't she?\n\n\t\t\tSECOND MAN'S VOICE \n\tLike hell she did! You're the one\n\tshe wants to get shed of!\n\n\t\t\tBUDDY \n\tCome on!\n\nHe and Doll hurry from the room.\n\nINT. HILLYER HOME - UPSTAIRS HALL AND STAIRS - NIGHT\n\nCUT TO a shot of Buddy and Doll running down the upstairs\nhall and down the stairs. The CAM M FOLLOWS them down the\nstairs.\n\nINT. HILLYER HOME - BACK HALL - NIGHT\n\nCUT TO a shot of Buddy and Doll as they slow down and creep\ncautiously down the back hall to the back porch. We hear the\nmen yelling somewhere out in the dark bushes.\n\n\t\t\tFIRST MAN'S VOICE \n\tYou'll swallow teeth yourself if\n\tyou don't leave her alone, you ugly\n\tbastard! Go on, throw one, throw\n\tone!\n\n\t\t\tSECOND MAN'S VOICE \n\tI'll throw one, you son of a bitch!\n\nWe hear a great CRASHING in the bushes, a SMACK of a fist, a\nGROAN of shock, an OATH, a SHOUT, more CRASHING.\n\nEXT. BACK PORCH - NIGHT\n\nCUT TO a shot from the POV of the children, on Daddy on the\nback porch as the lights blaze on. He wears his bathrobe and\nhas a big shotgun in his hands. Now he speaks in a loud,\nclear and very angry voice.\n\n\t\t\tDADDY \n\tAll right, I have got a Parker\n\tshotgun here and it is loaded and\n\tthe trigger is cocked and wherever\n\tyou birds are and whatever you are\n\tdoing you had better get the hell\n\tout of here goddamned quick!\n\nA sudden total silence ensues, then a sudden CRASHING in the\nbushes as the \"birds\" take off.\n\n\t\t\tDADDY (CONT'D)\n\tAnd do not come back, you sons of\n\tbitches! Stay away from my house\n\tand home and my wife and children\n\tor I'll blow your goddamned heads\n\toff!\n\nINT. HILLYER HOME - BACK HALL - NIGHT\n\nCUT TO a shot of Buddy and Doll as they cower in awe in the\ndownstairs hall. Daddy walks up to them carrying the shotgun.\nHe is grim and furious, but his voice is surprisingly calm.\n\n\t\t\tDADDY \n\tYou children go to bed. And\n\tBrother, stay away from Rose, I'll\n\tspeak to her in the morning.\n\nINT. HILLYER HOME - UPSTAIRS HALL - NIGHT\n\nCUT TO a shot of Buddy and Doll in the upstairs hall. Doll\nmeekly goes to her room.\nBuddy hesitates, looks at Rose's door, glances nervously back\nat the stairs, then goes to Rose's door, knocks softly, opens\nit.\n\nINT. HILLYER HOME - ROSE'S BEDROOM - NIGHT\n\nCUT TO a shot of Buddy and Rose as he stands in the doorway\nof her room. Rose is sitting on the edge of her bed in her\nnightgown, a damp cloth held against her jaw which seems a\nlittle swollen. A look of fear and guilt is on her face.\n\n\t\t\tROSE \n\t\t(rather feebly, as if it\n\t\t explains something)\n\tI got an awful toothache.\n\n\t\t\tBUDDY \n\t\t(quietly)\n\tRose, if you don't keep your\n\tboyfriends away from the house,\n\tDaddy is going to fire you.\n\n\t\t\tROSE \n\t\t(innocently)\n\tBut I don't know who they are.\n\nBuddy makes an exasperated grimace and exits, shutting door.\nThe CAMERA REMAINS on Rose as she rolls her eyes upward in\ndismay.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - DINING ROOM - DAY\n\nA shot of the family at breakfast in the dining room. The\nsilence is deafening. Everyone looks depressed except Daddy,\nwho is aloofly calm. Rose's head is bowed meekly over her\nplate as we hear the CLATTER of silverware. Finally, Daddy\nspeaks in an almost pleasant tone.\n\n\t\t\tDADDY \n\tWell, Rose, my sleep was a little\n\tdisturbed last night, and so was\n\tMrs. Hillyer's, and so was the\n\tchildren's. How about you? Was your\n\tsleep disturbed, too?\n\n\t\t\tROSE \n\t\t(solemnly)\n\tYes, Mr. Hillyer, it was. I... I\n\theard strange voices in the night.\n\n\t\t\tDADDY \n\t\t(softly strumming fingers,\n\t\t finally)\n\tStrange voices, Rose?\n\n\t\t\tROSE \n\t\t(innocent as an angel)\n\tYes, sir.\n\n\t\t\tDADDY \n\t\t(still aloofly polite)\n\tNow Rose, stop behaving as if\n\tyou're Bo Peep. Those men had a\n\tflight last night because of some\n\tfemale in this house, and it wasn't\n\tDolly or Mrs. Hillyer.\n\n\t\t\tMOTHER \n\t\t(very tense)\n\tI don't think we ought to discuss\n\tthis in front of the children.\n\n\t\t\tROSE\n\t\t(weeping, a hand over her\n\t\t eyes)\n\tOh... oh... oh! I think... maybe...\n\tone of 'em... was Foster... but I\n\tdon't hardly know him!\n\n\t\t\tDADDY\n\tOh, shut up, Rose. Shut your mouth\n\tand quit crying!\n\n\t\t\tMOTHER\n\t\t(draws herself up)\n\tI will not sit here and listen to\n\tyou be brutal to this poor girl.\n\n\t\t\tDADDY\n\tI am not being brutal to her!\n\n\t\t\tMOTHER\n\tYou certainly are! She has an awful\n\ttoothache, look at her jaw, it's\n\tall swollen.\n\n\t\t\tDADDY\n\t\t(trying to restrain\n\t\t himself, aloofly polite\n\t\t to the utmost)\n\tDarlin', it is not my fault if the\n\tgirl has epizootics --\n\n-- The word means \"an animal epidemic,\" and it's a pet word\nof Daddy's; he pronounces it epi-zoo-tics, not epi-zoo-ot\ntics, and uses it to mean any outrageous human malady --\n\n\t\t\tDADDY (CONT'D)\n\t-- I am not responsible for her\n\tepizootics and I did not bring\n\tabout her epizootics. Now listen to\n\tme. When I have to get up in the\n\tmiddle of the night and defend my\n\thome with a shotgun against a\n\tcouple of damned scoundrels\n\tfistfighting in the bushes --\n\n\t\t\tMOTHER\n\tScoundrels? They weren't\n\tscoundrels, they were just boys.\n\n\t\t\tDADDY \n\tBoys? You say to me boys?\n\n\t\t\tMOTHER\n\tYes! Yes, I say that to you, they\n\twere boys! Boy friends of Rose,\n\tchat's what they were, and why\n\tshouldn't she have boy friends? Do\n\tyou want her to be unnatural? Don't\n\tyou think she's human the same way\n\tyou are yourself? It's the South,\n\tthat's what it is, the South with\n\tits horrible traditions, of slavery\n\tand crime and the oppression of\n\twomen, who are just as good as men\n\tand just as human!\n\n\t\t\tDADDY \n\t\t(his eyes are a trifle\n\t\t glazed)\n\tNow darlin', what has the South got\n\tto do with this?\n\n\t\t\tMOTHER \n\t\t(in a real snit, afraid he\n\t\t will fire Rose)\n\tAnd when I try to talk to you\n\tseriously, when I try to explain to\n\tyou the unlimited creative power of\n\tlife, how beautiful it would be if\n\twe gave up this hopeless struggle\n\tand simply loved each other from\n\tour hearts, what do you do -- you\n\tmock me!\n\n\t\t\tDADDY \n\t\t(mildly, his eyes are even\n\t\t more glazed)\n\tI don't intend to mock you, dear. I\n\trespect your philosophy. It's\n\tbeyond my comprehension, but I\n\trespect it.\n\n\t\t\tROSE\n\t\t(head bowed, weeping in a\n\t\t little handkerchief)\n\tOhhh-hh, ohhh...\n\n\t\t\tDADDY \n\t\t(exasperated)\n\tOh, shut up, Rose, eat your\n\tcornflakes!\n\n\t\t\tROSE \n\t\t(piteously)\n\tI'm not hungry.\n\nThe word is hongry, not hungry.\n\n\t\t\tDADDY \n\tNow you listen to me, Rose --\n\n\t\t\tMOTHER \n\t\t(with fire in her eyes)\n\tJust a moment! You are not going to\n\tfire this girl for an innocent\n\tthing like having boy friends, not\n\twhile there is breath in my body!\n\n\t\t\tDADDY \n\tI don't intend to fire her,\n\tdarlin'.\n\n\t\t\tMOTHER \n\tIt isn't her fault if she's\n\tpopular... what?\n\n\t\t\tDADDY \n\tI said I don't intend to fire her.\n\tI just want to ask her to keep her\n\tboy friends away from my home and\n\thearth, that's all.\n\n\t\t\tMOTHER \n\t\t(simmers down at once, now\n\t\t calmly)\n\tWell, that's very reasonable. Howe\n\tI hate to bring it up, but she's\n\tgot an awful toothache, we've got\n\tto carry her to the dentist.\n\n\t\t\tROSE \n\tI don't want to go to the dentist.\n\n\t\t\tMOTHER \n\tBe quiet, Rose.\n\n\t\t\tDADDY \n\tDarlin', I'll take a taxi to the\n\thotel. You and Brother can handle\n\tthe girl's epizootics. I'll just\n\tsay one more thing. \n\t\t(turns to Rose and, in a\n\t\t grave tone)\n\tRose, I told you you had a friend\n\tin Mrs. Hillyer, didn't I, that she\n\twould fight for you like a tiger?\n\n\t\t\tROSE \n\t\t(meekly)\n\tYes, sir.\n\n\t\t\tDADDY \n\tAll right, thanks to her, and\n\tthanks to this case of epizootics,\n\tyou are getting another chance. \n\t\t(points a finger at her,\n\t\t and sternly)\n\tBut don't try my patience again. We\n\thave growing children in this\n\thouse. Do you understand me?\n\n\t\t\tROSE \n\tYes, sir.\n\nINT. DENTIST'S WAITING ROOM - DAY\n\nCUT TO a shot of Mother, Rose and Buddy in a dentist's\nwaiting room. Rose is holding a rubber ice bag to her jaw,\nwhich is quite swollen. She is groaning and half weeping in\npain.\n\n\t\t\tMOTHER\n\tPoor thing. Does the ice help,\n\tRose?\n\n\t\t\tROSE\n\tOhh-hh, a little. Oh-h, I ain't\n\tnever been to no dentist before.\n\tHe's gonna kill me, I just know it.\n\n\t\t\tMOTHER\n\tNo, Rose, he'll help you.\n\nANOTHER ANGLE, Rose shrinks in fear as, enter the dentist in\na white coat, DR. WINTON, a kindly-looking, gray-haired man.\nWe see a nurse behind him. He smiles in a reassuring manner.\n\n\t\t\tDR. WINTON \n\tNurse says we have a nervous\n\tpatient. Now, young lady, be calm.\n\tFirst of all, let me tell you, I am\n\tnot going to hurt you.\n\n\t\t\tROSE \n\tYes, you are.\n\n\t\t\tDR. WINTON \n\tNo, I am not.\n\n\t\t\tROSE \n\tLook, you can't kid me.\n\n\t\t\tMOTHER \n\t\t(rises, takes her by the\n\t\t hand)\n\tNow, come on, Rose. Stop being so\n\tchildish, come on.\n\nINT. DENTIST'S OFFICE - DAY\n\nANOTHER ANGLE, on Rose and Mother and Dr. Winton, as they\nguide and lead Rose into the dentist's operating room.- She\nplants her feet and her eyes open wide with horror as she\nsees the chair and other equipment.\n\n\t\t\tROSE \n\tI'm not goin' in there, I don't\n\tlike the looks of it!\n\n\t\t\tMOTHER \n\t\t(annoyed)\n\tRose, sit down in that chair and be\n\tquiet! We're trying to help you,\n\tyou silly creature, sit in that\n\tchair!\n\n\t\t\tROSE \n\t\t(very reluctantly sits in\n\t\t chair)\n\tOh-hh, ohh-hh, Lord, he's gonna\n\tkill me.\n\n\t\t\tDR. WINTON \n\tYou and the boy wait outside.\n\nINT. DENTIST'S WAITING ROOM - DAY\n\nCUT TO a shot of Mother and Buddy in the waiting room. Enter\nDr. Winton with a little frown.\n\n\t\t\tDR. WINTON \n\tWell, she finally let me look in\n\ther mouth. Is it true she's never\n\tbeen to a dentist?\n\n\t\t\tMOTHER \n\tShe was raised on a poor dirt farm.\n\tI'm sure she's never seen a dentist\n\tor hardly even a doctor.\n\n\t\t\tDR. WINTON \n\tWell, she has one mouth in ten\n\tthousand, I don't see teeth like\n\tthat once in ten years. Her trouble\n\tis an impacted wisdom tooth, but\n\tthere isn't a cavity in her head,\n\tnot a single one. She has perfect\n\tteeth.\n\n\t\t\tMOTHER \n\tBut the wisdom tooth will have to\n\tbe pulled?\n\n\t\t\tDR. WINTON \n\tYes, and it's very bad. It probably\n\tshould be done at the hospital\n\tunder general anesthesia.\n\n\t\t\tMOTHER \n\tThat would scare her to death.\n\tShe's terrified of hospitals. To\n\ther, a hospital is where you go to\n\tdie.\n\n\t\t\tDR. WINTON \n\tI think you're right, it would be\n\tharder on her. But you'd better\n\tcall Mr. Hillyer, she's going to\n\tneed help to get home.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. COUNTRY ROAD - DAY\n\nA shot of Daddy behind the wheel of the model-A. Rose lies\npale and exhausted on Mother's shoulder on the front seat. A\ntrace of bloody gauze can be seen in her mouth and her eyes\nare closed. Buddy is on the back seat.\n\n\t\t\tROSE\n\t\t(a whisper, muffled by the\n\t\t bloody gauze)\n\tNever again, never again...\n\n\t\t\tMOTHER\n\t\t(with pity, gently)\n\tI know it was bad, honey. I'm\n\tsorry...\n\n\t\t\tROSE \n\tNo more dentists, no more\n\tdentists...\n\n\t\t\tMOTHER \n\tIt'll get better now.\n\nEXT. HILLYER DRIVEWAY - DAY\n\nCUT TO a shot of the Model-A in the driveway of the Hillyer\nhome. Mother helps Rose out of the car, but Rose can't stand\non her feet. Daddy has to catch her from falling. Daddy picks\nher up in his arms and carries her up the steps as Buddy runs\nahead to open the front door.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. HILLYER PATIO - DAY\n\nA shot of Mother and Daddy and Buddy on the patio. It is a\nbeautiful sunny morning. Mother and Daddy are seated at an\noutdoor table about to have coffee. Daddy is opening mail and\nBuddy, in the b.g., is gluing up a kite. Enter a smiling and\nhealthy Rose with orange juice, toast, cups and coffee on a\ntray.\n\n\t\t\tDADDY \n\tGood morning, Rose. And how do you\n\tfeel today?\n\n\t\t\tROSE \n\tWonderful. Except I can touch the\n\tplace back there with my tongue, I\n\twouldn't even know I had that tooth\n\tpulled.\n\n\t\t\tDADDY \n\t\t(dryly, as he looks at\n\t\t mail)\n\tWell, I know it, I just got the\n\tbill for it.\n\n\t\t\tROSE \n\tBoy, for four or five days there I\n\tdidn't think I'd live. But I'm my\n\told self again!\n\n\t\t\tDADDY \n\tUmm. Well. Yes. But no more strange\n\tvoices in the night, Rose.\n\n\t\t\tROSE \n\tOh, no, sir.\n\n\t\t\tMOTHER \n\tRose has learned her lesson,\n\thaven't you, Rose?\n\n\t\t\tROSE \n\tYes, ma'am.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HOTEL - MEZZANINE - DAY\n\nA shot of Daddy peering down at an old pool table in the\nmezzanine of the family hotel. Buddy stands by with a pool\nstick in hand. In the b.g., we see a black bellboy, SHADRACH,\napproaching.\n\n\t\t\tDADDY \n\tI see my mother-in-law's face, son.\n\tRead 'em and weep, boy, I am\n\tplaying a spectacular combination,\n\ta triple. The nine ball in the\n\tcorner! \n\t\t(takes his stance with cue\n\t\t as Shadrach walks up)\n\tRead 'em and weep, boy, that's all\n\tshe wrote.\n\n\t\t\tSHADRACH \n\tMistah Hillyer, the Chief of Police\n\twants you on the telephone.\n\n\t\t\tDADDY \n\t\t(about to make his shot,\n\t\t looks around)\n\tThe Chief of Police?\n\n\t\t\tSHADRACH \n\tYassuh.\n\nDaddy straightens up, sets his jaw, leans the cue against the\ntable and marches toward the elevator as Buddy stares after\nhim. The CAMERA STAYS on Buddy.\n\nINT. HOTEL - DAY\n\nCUT TO a shot of Buddy going down the hotel stairs. He holds\nonto the banister, sliding with his hands far ahead in order\nto take four and even five steps at a time -- it is a\nchildish trick, the point of the game is to touch as few\nstairs as possible.\n\nANOTHER ANGLE, on Buddy as he jumps down the last remaining\nfive steps and walks into the lobby. Daddy comes from behind\nthe desk, grim.\n\n\t\t\tDADDY \n\tRose is in jail. She bit a\n\tpoliceman's thumb. Come on, son,\n\tShadrach can run the hotel.\n\nEXT. MODEL-A - STREET - DAY\n\nCUT TO a shot of Daddy and Buddy in the Model-A. Daddy stares\ngrimly ahead. Buddy steals a worried glance at him.\n\nINT. LOCAL JAIL - DAY\n\nCUT TO a shot in the local jail. The shot is on Daddy as he\nstands before jail bars staring sternly into a cell. His\nhands are on his hips, his straw hat is on the back of his\nhead and a bit to one side. Buddy stands beside him, a little\nbit behind, a worried look on his face. The CHIEF OF POLICE,\na fat man, is on the other side of Daddy.\n\nCUT TO a POV shot of Rose in the cell. Her hair is mussed,\nher dress is torn. A little innocent, frightened smile is on\nher face. The CAMERA PANS to include Daddy and the Chief of\nPolice.\n\n\t\t\tCHIEF OF POLICE \n\tThat was a awful brawl down at the\n\tBusy Beaver, Mr. Hillyer. You know\n\tthat fat Horton, the bootlegger?\n\n\t\t\tDADDY \n\tYes, I know the son of a bitch.\n\n\t\t\tCHIEF OF POLICE \n\tSon of a bitch is right, he dern\n\tnear killed a man. And this girl\n\twas the cause of it all. What's\n\tmore, she bit a police officer's\n\tthumb right to the bone.\n\n\t\t\tDADDY \n\tWell, Rose, what have you got to\n\tsay for yourself?\n\n\t\t\tROSE \n\t\t(coughs, then feebly)\n\tI got an awful bad cold.\n\n\t\t\tDADDY \n\t\t(nods slowly, then with\n\t\t aloof politeness)\n\tThat's all you've got to say,\n\tyou've got a bad cold?\n\n\t\t\tROSE \n\t\t(coughs again)\n\tWell, I don't know what happened.\n\tThey were arguin' about baseball,\n\tthen all of 'em started fightin'.\n\tAs for that policeman, I didn't\n\tbite him, I don't think I bit him.\n\nIn dour silence, Daddy and the Chief of Police stare at Rose.\nShe gives them a little smile, as if to say, \"See how\ninnocent I am?\" The Chief turns to Daddy and asks with dry\nirony:\n\n\t\t\tCHIEF OF POLICE \n\tWell, she's your girl, Mr. Hillyer.\n\tYou want me to release her in your\n\tcustody?\n\n\t\t\tDADDY \n\tNo, not really. But I guess we'll\n\thave to do that, John. Let her out.\n\tLet the crazy creature out and I'll\n\ttake her home.\n\nINT./EXT. MODEL-A - DAY\n\nCUT TO a shot of Daddy, Rose and Buddy in the Model A. Daddy\nstares grimly ahead, silent. Buddy looks solemn. Rose is\nbadly frightened and still coughing. Finally she ventures a\nlittle smile and speaks to Daddy.\n\n\t\t\tROSE \n\tI got an awful cold, I think I'm\n\tsick.\n\nDaddy is silent, his eyes fixed ahead.\n\nEXT. HILLYER DRIVEWAY - DAY\n\nCUT TO a shot of the Model A as it turns onto the Hillyer\ndriveway.\n\nINT./EXT. MODEL A\n\nCUT TO a shot of Daddy, Rose and Buddy in the car. She tries\nagain.\n\n\t\t\tROSE \n\tI didn't mean to bite him. He was\n\thitting Horton with a blackjack in\n\tthe meanest way and... and I bit\n\thim accidental.\n\n\t\t\tDADDY \n\t\t(stops the car, turns to\n\t\t Rose)\n\tI have to go back to the hotel. I'm\n\ton duty at the desk and who knows a\n\tquest might arrive. I will see you\n\tat suppertime, Rose.\n\n\t\t\tROSE \n\t\t(a feeble smile)\n\tI didn't mean to bite him, I really\n\tdidn't.\n\n\t\t\tDADDY \n\tI will see you at suppertime, Rose.\n\n\t\t\tROSE \n\t\t(feebly)\n\tYes, air.\n\nEXT. HILLYER HOME - FRONT STEPS - DAY\n\nCUT TO a shot of a shaky, slumped Rose going up the steps\nwith Buddy as the Model A drives away. Rose is coughing,\nlooks miserable.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - LIVING ROOM - NIGHT\n\nA SHOT of Buddy and Doll in the living room of the Hillyer\nhome at night. Doll is half-heartedly practicing scales on\nthe piano and Buddy is pacing the floor, hands clasped behind\nhim in something like the style of his father. As the CAMERA\nFOLLOWS Buddy in his pacing we see Waski playing with marbles\non the floor.\n\n\t\t\tDOLL \n\t\t(turns around on piano\n\t\t stool, to Buddy)\n\tWhat is Rose going to do? Where can\n\tshe go?\n\n\t\t\tBUDDY \n\tThey've been in there the longest\n\tkind of time. I can't stand it, I\n\tgotta find out what's going on.\n\n\t\t\tDOLL \n\tYou better not snoop, Daddy'll kill\n\tyou!\n\nINT. HILLYER HOME - FRONT HALL - NIGHT\n\nCUT TO a shot of Buddy coming with great furtiveness from the\nliving room out into the front hall. Very cautiously, he\ntiptoes across the hall and bows down and listens at the door\nof his mother's bedroom-study. He crouches down, peeps\nthrough the keyhole.\n\nINT. HILLYER HOME - MASTER BEDROOM/STUDY - NIGHT\n\nCUT TO a \"keyhole shot\" of Daddy and Mother in the bedroom.\nMother sits in her study chair, a handkerchief to her eyes.\nDaddy sits in a chair nearby. He looks depressed.\n\n\t\t\tDADDY \n\tI'm sorry, darlin', I hate it as\n\tmuch as you do.\n\n\t\t\tMOTHER\n\t\t(wanly)\n\tWell, she does seem to cause a lot\n\tof trouble, I admit. But she\n\tdoesn't mean any harm and it'll\n\tbreak the children's hearts, they\n\tall love her.\n\n\t\t\tDADDY \n\tIt's because of the children she's\n\tgot to go. I don't want to be\n\tholier-than-thou, but the girl\n\tdoesn't have the same outlook we\n\tdo. Morals don't mean a thing to\n\ther, not a thing, and we can't have\n\ta girl like that in this house.\n\n\t\t\tMOTHER \n\tWho is to say our morals are better\n\tthan hers?\n\t\t(frowns, sighs)\n\tBut maybe you're right. She\n\tcould... influence Dolly...\n\n\t\t\tDADDY \n\tThat is exactly what I'm afraid of. \n\t\t(pauses, and firmly)\n\tThe girl has got to go, darlin'.\n\n\t\t\tMOTHER \n\tBut morals come from the heart, not\n\tfrom rigid rules and empty laws.\n\tAnd in her heart Rose has never\n\thurt anyone and she never would.\n\tTherefore, she's not immoral. Not\n\treally.\n\n\t\t\tDADDY \n\tNow look, darlin', this is no time\n\tto go off into the fourth\n\tdimension.\n\n\t\t\tMOTHER \n\tBut what I said is the simple\n\ttruth. And now I see something\n\telse, I see more deeply into it...\n\nMother has a slightly \"other-worldly\" look on her face. Daddy\nglances at the door of the bedroom, he suspects something.\n\n\t\t\tDADDY \n\tJust a moment, darlin'.\n\nINT. HILLYER HOME - FRONT HALL - NIGHT\n\nCUT TO a shot of Buddy crouched at the keyhole. With great\nalacrity, he jumps up and hurries across the hall and shuts\nthe living room door just as Daddy whisks open the bedroom\ndoor. Daddy grimaces.\n\n\t\t\tDADDY \n\tCould of sworn that boy was out\n\there.\n\nDaddy shuts the door and at once almost like the movement of\na ballet Buddy opens the living room door and tiptoes back to\nthe keyhole.\n\nINT. HILLYER HOME - MASTER BEDROOM - NIGHT\n\nCUT TO a Shot of Daddy and Mother. It is another \"keyhole\nshot.\"\n\n\t\t\tMOTHER \n\tHow could Rose really be a bad\n\tinfluence on Dolly? She has a\n\tloving nature, you ought to want\n\tsomeone like that around your\n\tchildren. Why do you think those\n\tboys and men like her?\n\n\t\t\tDADDY\n\tWell, I have a pretty good idea.\n\n\t\t\tMOTHER \n\tIf you mean sex, you couldn't be\n\tmore wrong. Rose likes those boys\n\tand men, she has love in her heart,\n\tand that is what they want. It's\n\tthe most rare and beautiful thing\n\tin life and that is why they follow\n\ther.\n\n\t\t\tDADDY \n\tThey follow her because she's a -- \n\t\t(he is about to say \"piece\n\t\t of tail,\" but interrupts\n\t\t himself)\n\t-- no, I won't say that.\n\n\t\t\tMOTHER \n\tWhat she doesn't understand is that\n\ther behavior is disturbing to other\n\tpeople. She's young, she's got to\n\tlearn to restrain the life force\n\tthat's in her. Its creative, but in\n\ther case it's too creative.\n\n\t\t\tDADDY \n\tDarlin', Rose has got to go!\n\n\t\t\tMOTHER \n\t\t(rises)\n\tI'll talk to her, I'll reason with\n\ther.\n\nINT. HILLYER HOME - FRONT HALL - NIGHT\n\nCUT TO a shot of Buddy in the hall. He jumps up and hurries\nacross the hall into the living room. Again, as the living\nroom door shuts the bedroom door opens. Mother starts up the\nstairs, her mouth determined.\n\nINT. HILLYER HOME - LIVING ROOM - NIGHT\n\nCUT TO a shot of Buddy and Doll and Waski in the living room.\n\n\t\t\tDOLL\n\tWhat's happening?\n\n\t\t\tBUDDY \n\tMother is struggling desperately.\n\tIn fact she's fighting like a\n\ttiger. But I don't know, it's\n\tclose, it's mighty close.\n\n\t\t\tDOLL \n\t\t(pauses, then in a low\n\t\t tone, slightly wide-eyed)\n\tBuddy... does Rose really... \"do\n\tit\" with all those boys and men?\n\n\t\t\tBUDDY \n\t\t(aloofly, like Daddy)\n\tDoll, don't ask childish questions.\n\n\t\t\tWASKI \n\t\t(indignantly, to Doll)\n\tOf course not!\n\n\t\t\tBUDDY \n\tOh, Waski, you don't even know what\n\twe're talking about.\n\nINT. HILLYER HOME - UPSTAIRS HALL - NIGHT\n\nCUT TO a shot of Mother going down the upstairs hall. She\nknocks on Roses door and enters.\n\nINT. HILLYER HOME - ROSE'S BEDROOM - NIGHT\n\nCUT TO a shot of Mother as she walks over and stares down in\nshock at Rose on the bad. Rose is lying back on a pillow and\nstaring groggily at her, obviously not quite all there.\nFrowning with worry, Mother sits beside her and puts a hand\non her forehead.\n\n\t\t\tMOTHER \n\tRose, you're very sick. You're\n\tburning up. Rose, can you hear me?\n\tRose?\n\n\t\t\tROSE \n\t\t(semi-delirious)\n\tWhat? Wha-at? Mrs. Hillyer?\n\nEXT. HILLYER SOME - NIGHT\n\nCUT TO a shot of an ambulance pulling up outside the Hillyer\nhouse. Attendants get out of it carrying a stretcher.\n\nINT. HILLYER HOME - FRONT HALL - NIGHT\n\nCUT TO a shot of Buddy, Doll and Waski in the front hall.\nThey are badly frightened, even terrified.\nThe CAMERA PANS to show the ambulance attendants carrying\nRose strapped in a stretcher down the stairs, as Mother helps\nand Daddy follows, both of them very worried. Rose is\nconscious now and her eyes roll with terror toward the\nchildren.\n\n\t\t\tROSE \n\tBuddy! Dolly! They're takin' me to\n\tthe hospital! Don't let 'em, don't\n\tlet 'em!\n\nThe CAMERA STAYS on the frightened silent children as they\nstare after Rose on the stretcher.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HOSPITAL CORRIDOR - NIGHT\n\nA shot of Mother, Daddy, Buddy, Doll and Waski in the\ncorridor of a hospital. All look very solemn. A nurse leads\nthem to a door and opens it.\n\nINT. HOSPITAL ROOM - NIGHT\n\nCUT TO a shot of a hospital room. A very pale, sick-looking\nRose lies in a hospital bed. The nurse, mother, Daddy, Buddy,\nDoll and Waski enter, all of them looking very grave.\n\nANOTHER ANGLE, CLOSE ON Rose as she weakly turns her head on\nthe pillow. Her eyes well with tears as she recognizes the\nchildren.\n\n\t\t\tROSE\n\t\t(a feeble whisper)\n\tPray for me...\n\nANOTHER ANGLE, on the nurse as she speaks in a whisper we\ndon't hear to Mother and Daddy, obviously telling them they'd\nbetter go. Daddy beckons to the children and they start to\nleave, all looking depressed.\n\nINT. DOCTOR'S OFFICE - NIGHT\n\nCUT TO a shot of DR. F. ROBERT MARTINSON, a rather unpleasant\nman with a spade beard. He has a superior, patronizing way of\ntalking and very little Southern accent if any. The scene is\nhis office and he is in a swivel chair behind his desk.\n\nAs he speaks the CAMERA PULLS BACK to show Daddy, Mother and\nthe Hillyer children.\n\n\t\t\tDR. MARTINSON \n\tWell, Mrs. Hillyer, the girl is\n\tstrong as an ox and that is what is\n\tkeeping her alive. But not many\n\tpeople walk away from double\n\tpneumonia, Madam, not many.\n\n\t\t\tMOTHER \n\tShe looks terrible, just awful.\n\n\t\t\tDR. MARTINSON \n\tOf course she does and I must say\n\tI'm puzzled by your delay in\n\tgetting her to the hospital. I\n\tshould think ordinary powers of\n\tobservation would have suggested to\n\tyou that she was seriously ill.\n\n\t\t\tMOTHER \n\tShe hid it from us, Doctor. She's\n\tafraid of the hospital.\n\n\t\t\tDR. MARTINSON \n\t\t(a thin superior smile)\n\tAfraid of the hospital?\n\n\t\t\tMOTHER \n\tDeathly afraid of it. Her people\n\twere poor tenant farmers and she\n\tdoesn't know anything about doctors\n\tor medicine or hospitals.\n\n\t\t\tDR. MARTINSON \n\t\t(frowns in open disbelief)\n\tA tenant farm? Are you trying to\n\ttell me that girl is a product of\n\tthe hookworm and pellagra belt?\n\n\t\t\tMOTHER \n\tWell, her people were very poor.\n\tShe says she was often hungry as a\n\tchild, and I'm sure the food she\n\tate was pretty awful, not a\n\tbalanced diet at all.\n\n\t\t\tDR. MARTINSON \n\tExactly, and that's why she\n\tcouldn't possibly have come from\n\tsuch a farm.\n\n\t\t\tDADDY \n\t\t(icily polite)\n\tExcuse me, sir, are you calling my\n\twife a liar?\n\n\t\t\tMOTHER \n\t\t(embarrassed)\n\tHoney, please...\n\n\t\t\tDR. MARTINSON \n\t\t(a thin unpleasant smile)\n\tIt's simply that I find it\n\tincredible, Mr. Hillyer. Aside from\n\tthe girl's illness at the moment,\n\tshe is very strong, a very healthy\n\tspecimen of a young human female --\n\tand a comely one, too. She must\n\thave gotten protein somewhere as a\n\tyoung child, if only sporadically.\n\n\t\t\tMOTHER \n\tIt is kind of amazing. The dentist\n\tsays she has perfect teeth, there\n\tisn't a cavity in her mouth.\n\n\t\t\tMR. MARTINSON \n\t\t(tries to make a\n\t\t supercilious joke)\n\tHer entire mouth is a cavity,\n\tMadam, ha ha ha.\n\n\t\t\tDADDY \n\t\t(dryly, doesn't like the\n\t\t man a bit)\n\tHa ha ha ha.\n\nMother frowns at Daddy and Dr. Martinson gives him an aloof\nglance.\n\n\t\t\tDR. MARTINSON \n\t\t(with spurious dignity)\n\tThe point is you don't grow up like\n\tthat on a diet of sorghum and\n\thominy grits. She got protein\n\tsomewhere, she's a very strong girl\n\tand I think she'll live... despite\n\tthe delay in medical treatment.\n\n\t\t\tDADDY \n\tThat's all I want to know. \n\t\t(rises)\n\tLets get out of here before I get\n\tthe epizootics myself. Thank you,\n\tDoctor, for your discourse, it was\n\tfascinating, no doubt.\n\n\t\t\tMOTHER \n\tYes, thank you, Doctor.\n\n\t\t\tDR. MARTINSON \n\t\t(as they leave)\n\tI beg your pardon, epi-zoo-tics? Do\n\tyou mean \"epi-zoo-ot-tics,\" an\n\tanimal epidemic?\n\n\t\t\tDADDY \n\t\t(icily polite, from the\n\t\t door)\n\tNo, I mean epizootics.\n\nINT. HOSPITAL - NIGHT\n\nCUT TO a shot of Mother, Daddy, Buddy, Doll and Waski as\nDaddy comes out of the Doctor's office and shuts the door.\n\n\t\t\tDADDY \n\tI can't stand that polecat. They\n\tought to hang him.\n\n\t\t\tMOTHER \n\tYou don't like him because he's a\n\tYankee. He's a brilliant doctor.\n\n\t\t\tDADDY \n\tHe's a polecat, dear.\n\nINT. HOSPITAL ELEVATOR - NIGHT\n\nCUT TO a shot of Daddy, Mother and the Hillyer children in a\nhospital elevator as a black elevator operator runs them\ndown. Daddy has his hat politely removed and is staring\npensively ahead.\n\n\t\t\tDADDY\n\tRosebud looked pretty pitiful in\n\tthat bed. \n\t\t(sighs, shakes his head)\n\tI hope she'll be all right, but I\n\tstill think we ought to fire her.\n\n\t\t\tMOTHER \n\tI don't see how you can even think\n\tof it now.\n\nDaddy purses his lips but says nothing. It is obvious the\n\"epizootics\" have saved Rose, at least for the time being.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - ROSE'S BEDROOM - NIGHT\n\nA SHOT of Rose in bed in her own bedroom. She is propped up\non pillows and wearing a rather attractive pink silk\nhousecoat of Mother's.\nA tray is on her lap and she is eating her supper as Buddy\nsits on the edge of the bed talking with her, or rather\nlistening to her. It is obvious she is well on the road back\nto health.\n\n\t\t\tROSE \n\tOh, he's so kind, so gentle inside,\n\tand so unhappy with that rich wife\n\twho doesn't understand him, her\n\tbeing a Southerner and everything,\n\tand what a bedside manner he has\n\tgot -- so gentle and kind beneath\n\tthe professor way he acts!\n\n\t\t\tBUDDY \n\tRose, you are too uncritical of\n\tpeople.\n\n\t\t\tROSE \n\tYou don't know the bedside manner\n\tthat man has got. Why, it does me\n\tgood just to see him sit there all\n\tsolemn and go pokin' in his bag\n\tlike he's gonna cure me, which he\n\tdid of course. And even more\n\timportant he loves me, like a\n\tpatient I mean, the other day he\n\tgot tears in his eyes just\n\tlistenin' to my heart beat.\n\n\t\t\tBUDDY \n\tHe did?\n\n\t\t\tROSE \n\tYeah, he tried to hide it but I saw\n\t'em, and a little bit he says to\n\tme, \"You know, you are beautiful.\"\n\tNow wasn't that a nice thing for a\n\tdoctor to say to a patient, wasn't\n\tit? What could cheer a girl up\n\tmore?\n\n\t\t\tBUDDY \n\tRose, I have got doubts about that\n\tdoctor and so does Daddy.\n\n\t\t\tROSE \n\tHe's got doubts about hisself and\n\tthat's the saddest thing of all.\n\tWould you believe that poor man\n\tthinks nobody likes him?\n\n\t\t\tBUDDY \n\tYeah, I'd believe it.\n\n\t\t\tROSE \n\tWell, I like him. I used to be\n\tafraid of doctors but not any more.\n\tWhy, he could operate on me any old\n\ttime and I wouldn't even be scared.\n\n\t\t\tBUDDY \n\tRose, you are just entirely too\n\tuncritical of people.\n\n\t\t\tROSE \n\tI ain't neither. Listen here,\n\tBuddy, besides all his vast medical\n\tknowledge, he has the most kindest\n\theart beneath the professor way he\n\tacts -- he wants justice in the\n\tworld and he's got some real\n\tinterestin' ideas.\n\nINT. HILLYER HOME - FRONT DOOR - NIGHT\n\nCUT TO a shot of Mother opening the front door. Dr. Martinson\nis there-with his black bag, an icy polite look on his face.;\n\n\t\t\tMOTHER \n\tOh, good evening, Doctor. Rose is a\n\tlot better, I just gave her her\n\tsupper. She's almost all well now.\n\n\t\t\tDR. MARTINSON \n\tLet me be the judge of that, Madam.\n\n\t\t\tMOTHER \n\tYes. Well. She's upstairs.\n\nINT. HILLYER HOME - ROSE'S BEDROOM - DAY/NIGHT\n\nCUT TO a shot of Buddy and Rose in Rose's bedroom.\n\n\t\t\tROSE \n\tJustice, that's what he wants,\n\tjustice for everybody and\n\tespecially for niggers. And I think\n\tthat's real nice of him because\n\tblack people don't have a very good\n\tlife, you got to admit that, to be\n\ta nigger is sometimes practic'ly\n\tfatal, but the wife don't\n\tunderstand all of that, she thinks\n\tniggers are just so much dirt,\n\twhich anybody ought to know better\n\tif they been on their ass their\n\townselves -- and that is the cause\n\tof his profound unhappiness, Buddy,\n\tthat no-good-mean wife with all her\n\tSouthern prejudice against niggers\n\tand everything!\n\nIt is a very long speech and delivered with a non-stop\nvitality that leaves Buddy a trifle groggy. Slowly, he shakes\nhis head, as enter Mother.\n\n\t\t\tMOTHER \n\tThe Doctor is here. And Brother,\n\tsupper is ready.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - DINING ROOM - NIGHT\n\nA SHOT of the Hillyer family minus Rose eating dinner in the\ndining room. The meal is almost finished, Daddy cutting apple\npie.\n\n\t\t\tDADDY \n\tIs that Doctor still up there,\n\tBrother.\n\n\t\t\tBUDDY \n\tYeah, he's still up there.\n\n\t\t\tDADDY \n\tWhat's taking the rascal so long?\n\n\t\t\tMOTHER \n\tHoney, Dr. Martinson isn't a\n\trascal, he's one of the finest\n\tphysicians in Glenville. He studied\n\tat Johns Hopkins University.\n\n\t\t\tDADDY \n\tI don't care where the polecat\n\tstudied.\n\n\t\t\tMOTHER \n\tSometimes the negativism and\n\tcynicism in you makes me want to\n\tvomit. \n\t\t(shakes her head sadly as\n\t\t Buddy surreptitiously\n\t\t puts his napkin on table)\n\tYour real trouble is that you're\n\tanti-intellectual. The irony is\n\twomen are supposed to be emotional,\n\tbut I never saw anybody who\n\tdepended more on emotion and\n\tprejudice than you do.\n\n\t\t\tBUDDY \n\t\t(a half audible murmur)\n\tExcuse me, gotta go to bathroom.\n\n\t\t\tMOTHER \n\tNow I have a plan about Rose, an\n\teducational plan. She's getting\n\tbetter and we don't want any more\n\ttrouble --\n\t\t(notices Buddy slipping\n\t\t out)\n\tBrother, you ought to hear this.\n\n\t\t\tBUDDY \n\tI'll be right back.\n\nThe CAMERA FOLLOWS Buddy as he slips out during following\nspeech.\n\n\t\t\tMOTHER \n\tFirst, those clothes she wears.\n\tThey're too provocative. I've\n\ttalked to her a lot about it and I\n\tthink she understands...\n\nINT. HILLYER HOME - FRONT HALL - NIGHT\n\nCUT TO a shot of Buddy as he goes down the hall, eyes\nnarrowed.\n\nON Buddy posted in the doorway of the living room. He has his\nhands on his hips Daddy-style and is staring sternly up the\nstairs.\n\nCUT TO A POV SHOT of Dr. Martinson with his black bag in hand\nand shoulders hunched coming down the stairs. The man is\nslinking, has quilt written all over him. As he goes down the\nstairs he glances to one side, sees Buddy and frowns. The man\ngives a sudden nervous start of fright as we hear Daddy's\nvoice loud on the TRACK.\n\n\t\t\tDADDY (O.S.)\n\tEverything all right, Doctor?\n\nCUT TO A POV shot of Daddy at the rear of the downstairs\nhall, napkin in hand and hands on hips. He is staring sternly\nat the doctor.\n\nCUT BACK TO the Doctor. He glances nervously again toward\nBuddy.\n\nANOTHER POV SHOT of Buddy. Looks just like Daddy, hands on\nhips.\n\nON Dr. Martinson, as he looks back at Daddy.\n\n\t\t\tDR. MARTINSON \n\tOh, yes. Yes. Just fine. A few more\n\tdays... a little more rest...\n\tshe'll be perfectly healthy.\n\nANOTHER ANGLE on Daddy as he walks forward down the hall\ntoward Buddy. The CAMERA PICKS UP Buddy and both of them\ngrimly stare after the fleeing doctor.\n\n\t\t\tDADDY \n\t\t(in a low, conspiratorial\n\t\t tone)\n\tWhat do you think, Brother?\n\n\t\t\tBUDDY \n\tI don't know. But you better watch\n\thim like a hawk, if he comes back\n\tagain.\n\n\t\t\tDADDY \n\tHe's not coming back again. We\n\tscared the rascal off, son.\n\t\t(puts a hand on Buddy's\n\t\t shoulder)\n\tCome on back to supper. Your mother\n\thas a theory about how to educate\n\tRose.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - KITCHEN - DAY\n\nA SHOT of Mother and Rose and the children in the kitchen. We\nsee a sewing machine and evidences of dressmaking. Rose has\non a new and modest little dress that Mother evidently has\nmade for her.\n\n\t\t\tMOTHER \n\tYou see, Rose? Now that's the kind\n\tof dress you ought to wear.\n\n\t\t\tROSE\n\t\t(less than enthusiastic)\n\tYeah, it's kinda nice.\n\n\t\t\tMOTHER \n\tYou look very pretty in it, Rose.\n\tReally, you do.\n\n\t\t\tROSE \n\t\t(smiles at Mother)\n\tWell, you're real sweet to make it\n\tfor me.\n\t\t(puts an arm around\n\t\t Mother's shoulder)\n\tThere never was nobody like you.\n\tAnd you don't need to worry, I\n\tain't goin' out no more.\n\n\t\t\tMOTHER \n\tWell, there's no reason you\n\tshouldn't go out, Rose... in\n\tmoderation.\n\n\t\t\tROSE \n\t\t(a little shrug)\n\tI don't want to. When I was lyin'\n\tthere in that hospital bed at\n\tdeath's door I says to myself, I\n\tain't goin' out no more. If I ever\n\tget outta this, I'll just stay\n\thome.\n\nRose casually pulls the dress over her head and stands there\nin panties and bra, oblivious of Buddy and the children. She\nhas about as much modesty as a small child herself.\n\n\t\t\tROSE (CONT'D)\n\t\t(rather sadly)\n\tBesides, there ain't no Mr. Right\n\tout there. Or if there is I can't\n\tfind him, all I find is a pile of\n\tMr. Wrongs. I ain't goin' out no\n\tmore.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. CHURCH - DAY\n\nA SHOT of Daddy, Mother, Rose, and the children all in their\nSunday best going up the steps of a church. Rose looks\nvirginal in the modest dress Mother made for her.\n\nINT. CHURCH - DAY\n\nA SHOT of Rose, Mother, Daddy and the children on a bench in\nchurch. We hear singing. Rose looks innocent, virginal as she\nsings. Mother gives her an approving look, exchanges glances\nwith Daddy.\n\nEXT. CHURCH - DAY\n\nCUT TO a shot of the Hillyer family coming out of church. We\nsee them shaking hands with the Minister. Rose smiles\nsweetly, modestly.\n\nEXT. HILLYER DRIVEWAY - DAY\n\nCUT TO a shot of the Model A driving up in the driveway of\nthe Hillyer house.\n\nANOTHER ANGLE on them all as they get out of the car. Rose\ntakes Doll's hand with one hand and Waski's hand with the\nother.\n\n\t\t\tROSE \n\tAll right, we'll play monopoly\n\tthen.\n\nMother, Daddy and Buddy watch Rose go up the steps with Doll\nand Waski.\n\n\t\t\tMOTHER \n\tShe's like a different person.\n\tBeing so sick made a big impression\n\ton her. I really think she's\n\tlearned a lesson.\n\n\t\t\tDADDY \n\tUm-hmm. \n\t\t(waits as Mother goes on\n\t\t up steps, then turns to\n\t\t Buddy and in a low tone)\n\tCome with me, Brother. I want to\n\tshow you something.\n\nEXT. HILLYER HOME - ROSE GARDEN - DAY\n\nCUT TO a shot of Daddy and Buddy in a rose garden below the\nwindows of the house.\n\nIt is Hawkshaw the Detective and his Unwilling Assistant.\nDaddy solemnly points to dim marks in the flower bed.\n\n\t\t\tDADDY \n\tSee that, son? Now this is a heel,\n\tsee, and there, that's the ball of\n\ta foot. Someone has been walking\n\there.\n\n\t\t\tBUDDY \n\t\t(reluctantly)\n\tWell, it's not very plain.\n\n\t\t\tDADDY \n\tThat is because it rained recently,\n\tthe rain has obscured the evidence.\n\tBut you could still take plaster\n\tcasts of these footprints, then\n\tmatch up the plaster casts with\n\twhosever shoes they are, and that\n\tway you could catch him --\n\tunderstand?\n\n\t\t\tBUDDY \n\tBut how would you find him?\n\n\t\t\tDADDY \n\tWell. Well, what I mean is, you\n\tcould prove it was his shoes if you\n\tdid catch him. But look this,\n\tBrother, it is even more\n\tinteresting. Look at this mark\n\there, and that mark over there. Now\n\twouldn't you say those marks are\n\tthe marks of a ladder?\n\n\t\t\tBUDDY \n\tWell, I don't know. \n\t\t(trying to sound like a\n\t\t fellow detective, but\n\t\t doesn't want Rose to get\n\t\t caught)\n\tNo, I don't know, Daddy, I think\n\tthe rain has obscured it.\n\n\t\t\tDADDY \n\tTrue, but if you look sharply you\n\tcan see that those marks are the\n\tmarks of a ladder. Now let's go\n\tback to the garage and see if the\n\tladder has been tampered with.\n\nINT. GARAGE - DAY\n\nCUT TO a shot of Daddy and Buddy back in the garage. They are\nscrutinizing a wooden ladder that hangs on pegs alongside the\ngarage. All Daddy needs is a cap and a pipe to be a dead\nringer for Sherlock Holmes. He is in dead earnest about this,\nit is no Joke and he does not dream of being funny.\n\n\t\t\tDADDY \n\t\t(points to ladder, eyes\n\t\t narrowed)\n\tSee, son? The paint is flaked off\n\there, freshly. Look at it, Brother,\n\tthere is no question about it. Some\n\tperson or persons unknown have very\n\trecently tampered with this ladder.\n\n\t\t\tBUDDY \n\tWell... maybe...\n\n\t\t\tDADDY \n\tAnd there's only one reason anybody\n\twould want this ladder -- to get up\n\tinto Rose's bedroom in the dark of\n\tnight! I am going to chain up this\n\tladder and padlock it! -- and that\n\tis not all I am going to do!\n\nBuddy stares at him in apprehension.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - DINING ROOM - NIGHT\n\nA shot of the whole family at dinner including Rose. Daddy\nputs down his napkin.\n\n\t\t\tDADDY \n\tThat was a delicious repast, Rose,\n\tas usual. Now I have something of\n\tgrave import to say to you and to\n\tMrs. Hillyer. \n\t\t(pauses, points at Buddy) \n\tAnd I don't want you children\n\tsnooping, do you hear me, Brother?\n\tGo up to your rooms.\n\nINT. HILLYER HOME - UPSTAIRS - NIGHT\n\nCUT TO a shot of Buddy, Doll and Waski in the upstairs. They\ntiptoe along furtively.\n\nINT. HILLYER HOME - STAIRCASE - NIGHT\n\nCUT TO a shot of the children going down backstairs.\n\nINT. HILLYER HOME - CELLAR - NIGHT\n\nCUT TO a shot of Buddy leading Doll and Waski down the steps\nof the cellar. The CAMERA follows as they walk past an\nancient coal-burning furnace and...\n\nINT. HILLYER HOME - CRAWL SPACE - NIGHT\n\nclimb up into 'a crawl space beneath the front of the house.\n\nA shot of Buddy, Doll and Waski crawling along on dirt in the\ncrawl space under the house. They come to a floor heat\nventillator grill and stop. Buddy holds his fingers to his\nlips and listens intently.\n\nINT. HILLYER HOME - MASTER BEDROOM - NIGHT\n\nCUT TO a shot of Daddy, Mother and Rose in Mother's bedroom\nstudy. We see the grillwork of the heat ventillator in the\nfloor. Daddy is at the climax of his speech.\n\n\t\t\tDADDY \n\tWe all love you, Rose. Even more\n\tnow, since you've bravely\n\tsurmounted all these epizootics. We\n\tadmire you, we esteem you, we hold\n\tyour hand with love and affection,\n\twe have an investment in you -- and\n\tI don't mean money, although God\n\tknows we have that, too,\n\tconsidering those godawful hospital\n\tbills...\n\nINT. HILLYER HOME - CRAWL SPACE - NIGHT\n\nCUT TO a shot CLOSE on Buddy, Doll and Waski in the crawl\nspace. Buddy is smiling in relief. He whispers to Doll and\nWaski.\n\n\t\t\tBUDDY \n\tHe's not going to fire her.\n\nINT. HILLYER HOME - MASTER BEDROOM - NIGHT\n\nCUT BACK TO Daddy, Mother and Rose in the bedroom-study.\n\n\t\t\tDADDY \n\tI mean a human investment, Rose, we\n\tcare about you, you matter to us.\n\tBut we have innocent and unformed\n\tchildren in this house and the\n\tmonkey and dog show has got to\n\tstop. Do you hear me?\n\n\t\t\tROSE \n\t\t(meekly)\n\tYes, sir.\n\n\t\t\tMOTHER \n\t\t(a bit overwhelmed by\n\t\t Daddy)\n\tShe hasn't actually done\n\tanything...\n\n\t\t\tDADDY \n\t\t(very firmly)\n\tJust a moment, dear. \n\t\t(turns to Rose and almost\n\t\t sadly)\n\tWe can't have it, Rose. Can you\n\tbehave yourself -- or not? That is\n\tthe question, to behave or not to\n\tbehave, to suffer the slings and\n\tarrows of outrageous chastity and\n\tkeep your skirt down or to hoist it\n\tin the light of the moon and make\n\twhoopee -- that is the coil\n\tshuffling question. \n\t\t(a dramatic pause, then\n\t\t points at her)\n\tIf you can't behave I am going to\n\tfire you and I say it in front of\n\tyou and Mrs. Hillyer and I mean it.\n\tI point my rigid finger right at\n\tyour nose, Rose, and I stare\n\tunwaveringly into your big blue\n\teyes and I tell you... this is a\n\tfinal warning. Do you hear me?\n\n\t\t\tROSE \n\t\t(very meekly)\n\tYes, sir.\n\nINT. HILLYER HOME - CELLAR - NIGHT\n\nCUT TO a shot of Buddy, Doll and Waski as they climb from the\ncrawl space down into the cellar by the furnace.\n\n\t\t\tDOLL \n\tWell, if she's got any sense at\n\tall, she'll listen to that.\n\n\t\t\tBUDDY \n\tSense doesn't mean anything to\n\tRose. But I think we're on safe\n\tground now. Daddy chained up the\n\tladder, whoever it is can't get in\n\tthe house.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - BUDDY'S BEDROOM - DAY\n\nA shot of Buddy sound asleep in his bed in the early gray\ndawn. As we DISSOLVE IN on the shot, we hear a loud BANGING\nand DADDY'S VOICE. \n\n\t\t\tDADDY (O.S.)\n\tOpen that door! Open it up, open it\n\tthis instant! Do you hear met open\n\tthat door!\n\nBuddy sits quickly up in bed, at once pushes back the covers\nand gets out of the bed, hurriedly reaches for his khaki\npants.\n\nINT. HILLYER HOME - UPSTAIRS HALL - DAY\n\nCUT TO a shot of Daddy in the upstairs hall. He is fully\ndressed and is banging angrily on Rose's door.\n\n\t\t\tDADDY\n\tRose! Rose! Open this goddamn door!\n\tOpen it or I'll break it down!\n\nANOTHER ANGLE on Buddy as he hurries down the hall up to\nDaddy, in khaki pants and pulling a shirt over his head.\n\n\t\t\tDADDY (CONT'D)\n\tOpen that door, damn you!\n\n\t\t\tBUDDY\n\tDaddy, what's the matter?\n\n\t\t\tDADDY \n\t\t(glances around at him)\n\tShe's got somebody in there,\n\tBrother! His shoes are on the back\n\tporch -- there they were, naked and\n\tsmiling at me! \n\t\t(bangs on door)\n\tRose, open this door immediately!\n\nANOTHER ANGLE on Daddy as he bangs on the door. We see a\nfrightened Doll in her nightgown in the b.g. down the hall, a\nhand to her mouth. Daddy commences kicking at the door.\n\nANOTHER ANGLE, CLOSE ON Daddy.\n\n\t\t\tDADDY (CONT'D)\n\tOpen up, Rose! Procrastination\n\twon't help you!\n\nFinally, the CLICK of a bolt and slowly the door opens. We\nsee a wide-eyed, terrified Rose. She has a sheet around her\nand evidently nothing more.\n\n\t\t\tDADDY (CONT'D)\n\t\t(he pushes past her)\n\tAll right, where is he? Where's the\n\tculprit?\n\nINT. HILLYER HOME - ROSE'S BEDROOM - DAY\n\nCUT TO a shot of Daddy in the bedroom. He yanks open the\ncloset door, looks under the bed as he talks.\n\n\t\t\tDADDY \n\tWhere is he? I know he's in here,\n\twhere is he, Rose? His shoes were\n\ton the back porch I smiling at met\n\tWhere are you, you son of a bitch?\n\nIn her distress and dismay, the sheet has come down over\nRose's shoulder and one of her breasts is exposed.\n\n\t\t\tROSE \n\t\t(feebly, she is terrified)\n\tThere ain't nobody here, Mr.\n\tHillyer! Honest, there ain't!\n\n\t\t\tDADDY \n\tWhere is he? Where have you got him\n\thid? \n\t\t(notices curtain blowing\n\t\t in wide open window)\n\tAh, ha!\n\nThe CAMERA follows Daddy as he strides angrily toward the\nwindow and leans out of it and stares down. Rose makes a\nlittle whimpering sound.\n\nEXT. HILLYER SOME - GARDEN - DAWN\n\nCUT TO a POV shot of the garden below as seen by Daddy from\nthe window. We see lying on the ground BILLY, the Sulky Boy\nwho scared Mother. He wears only undershorts and is groaning,\nholding his leg, which evidently he has injured in jumping\nfrom the window.\n\nINT. HILLYER HOME - ROSE'S BEDROOM - DAWN\n\nOn Daddy, as he turns from the window to Rose.\n\n\t\t\tDADDY \n\tAnd who, Rose, may I ask, is that?\n\n\t\t\tROSE \n\tWell, it's Billy.\n\n\t\t\tDADDY \n\tAnd what, may I ask, was Billy\n\tdoing here?\n\n\t\t\tROSE \n\t\t(a straight answer)\n\tWell, Mr. Hillyer, Billy's very\n\tpoor, he don't have no money and\n\tthere wasn't no place else to go.\n\n\t\t\tDADDY \n\tWell, it was a silly question.\n\n\t\t\tROSE \n\tHe's a nice boy, you'd like him. He\n\twants to be a fireman.\n\n\t\t\tDADDY \n\tYe gods and little fishes, a\n\tfireman. Put on some clothes, Rose,\n\tyou're naked as a jay bird. When\n\tyou're dressed, come on downstairs.\n\tI'm afraid your friend Billy is\n\tinjured, where are his clothes?\n\n\t\t\tROSE \n\t\t(begins weeping, both\n\t\t breasts now are exposed)\n\tUnder the mattress. I hid 'em so\n\tyou wouldn't be mad. He wants to\n\tmarry me, he loves me. I can't\n\tmarry him, he's too young and\n\thasn't got no job, but he loves\n\tme... now you wouldn't hurt him,\n\twould you?\n\nDaddy gently pulls the sheet around her to cover her breasts.\n\n\t\t\tDADDY \n\tI won't hurt him, honey.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - KITCHEN - DAY\n\nA shot of Daddy, Mother and Rose at the kitchen table\ndrinking coffee in the early morning. Daddy looks grave,\nMother looks sad, and Rose is crying into a handkerchief.\n\n\t\t\tROSE \n\tMr. Hillyer, I know it was bad and\n\tI hadn't ought to of done it. But\n\tI'm only a human girl and I... I\n\tain't always perfect. I promise I\n\twon't let him in the house no more,\n\tI promise. Won't you and Mrs.\n\tHillyer forgive me?\n\n\t\t\tDADDY \n\tRose, darlin', you break my heart.\n\tBut I am only a human man myself of\n\tthe father variety. Rose, pack your\n\tbag, baby, as of this moment you\n\tare hired, mired and fired.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - DINING ROOM - DAY\n\nA shot of the family at breakfast in the dining room. The\ndissolve suggests that some time has gone by. Daddy looks a\nbit grim, Rose has a wan and depressed expression. Mother\nlooks worried.\n\n\t\t\tDADDY \n\t\t(politely)\n\tWell, Rose, going out to look for a\n\tjob today?\n\n\t\t\tROSE \n\t\t(eyes down)\n\tWhat's the use, there ain't none.\n\n\t\t\tDADDY \n\tMmm. Would you get me another half\n\ta-cup of coffee, dear?\n\nRose rises and he watches her leave, then turns to Mother.\n\n\t\t\tDADDY (CONT'D)\n\tIt has been three weeks since I\n\t\"fired\" her. Is there no way to get\n\trid of this girl? Are we stuck with\n\ther for life?\n\n\t\t\tMOTHER \n\tShe can't get a job, it's a\n\tdepression. And we can't just throw\n\ther out on the street.\n\n\t\t\tDADDY \n\tThe hell we can't.\n\nRose returns with coffee and pours it out for Daddy.\n\n\t\t\tMOTHER \n\tRose, you don't look well and you\n\thaven't eaten a bit of breakfast.\n\n\t\t\tROSE \n\tI'm not hungry. I can't eat\n\tnothin', I haven't been able to eat\n\tsince I got fired. I think maybe\n\tI'm sick.\n\n\t\t\tDADDY \n\tGod forbid. You're not sick, Rose,\n\tforget it. Don't get any notions in\n\tyour head, you're not sick.\n\n\t\t\tROSE \n\tYes, sir.\n\n\t\t\tMOTHER \n\tShe does look a little peaky.\n\n\t\t\tDADDY\n\tNo, she doesn't, she's fine, fine.\n\tShe's perfectly healthy, don't give\n\ther ideas.\n\n\t\t\tROSE \n\tWell, I'll do the dishes, then I'm\n\tgoin' to lie down a minute and\n\trest. My stomach hurts.\n\nDaddy watches Rose exit to the kitchen, then leans forward\nand speaks to Mother, his expression a bit sly.\n\n\t\t\tDADDY \n\tHer plan is obvious, plain as day.\n\tShe's going on a hunger strike. The\n\tquestion is, how do we foil her?\n\n\t\t\tMOTHER \n\tShe's just nervous and worried. And\n\tyou would be, too, if you had no\n\tjob and no place to go.\n\n\t\t\tDADDY \n\t\t(thinking hard)\n\tSomething has got to be done or\n\tRose is going to be in this house\n\tforever.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. HILLYER HOME - DRIVEWAY AND PATIO - DAY\n\nA shot of the Model A coming up the driveway of the Hillyer\nHouse. It is late afternoon.\n\nCUT TO a shot of Daddy getting out of the car. He has a\ntriumphant little smile on his face.\n\nA shot of Daddy as he walks onto the patio, a rolled-up copy\nof the Glenville Tribune in his hand and his straw hat on the\nback of his head. He definitely has a triumphant expression.\nBuddy on the patio notices it.\n\nINT. HILLYER HOME - KITCHEN - DAY\n\nCUT TO a shot of the kitchen on Mother and Rose. Mother is\nhelping a rather wan Rose prepare dinner. Enter Daddy.\n\n\t\t\tDADDY \n\t\t(as if everyone will be\n\t\t pleased)\n\tWell, I have got news! I called\n\tlong distance and spoke to Cousin\n\tHop and you'll be glad to know,\n\tRose, I have found you a job!\n\n\t\t\tROSE \n\tTennessee?\n\n\t\t\tDADDY \n\tYes, Tennessee, a lovely state!\n\n\t\t\tROSE \n\tWell. What kinda job is it?\n\n\t\t\tDADDY \n\tAhh-hh, you'll like it. It's a\n\tfine, outdoor-type job.\n\n\t\t\tROSE \n\tYou mean a farm?\n\n\t\t\tDADDY \n\tNo, no, not exactly. It isn't a\n\tfarm in the sense that it's a farm.\n\tNot at all. It's a... dairy\n\testablishment. You'll 1ike it! I'm\n\tsure you'll like it because it's\n\tso... peaceful!\n\nRose bows her head and begins crying.\n\n\t\t\tMOTHER \n\tHoney, Rose was born on a farm and\n\thas terrible memories of farm life.\n\tNow I don't think --\n\n\t\t\tDADDY \n\tJust a minute, Rose, you don't\n\tunderstand. This isn't a dirt farm\n\tlike the one you were born on, it's\n\tnice. A neighbor of Cousin Hop's, I\n\ttalked to him on the phone, a fine\n\tman... it's not a farm, damn it,\n\tit's a beautiful dairy\n\testablishment! Stop crying, Rose!\n\tDo you hear me? Stop crying, it's\n\tideal!\n\n\t\t\tMOTHER \n\tI don't know how you can call it\n\tideal -- don't you know what the\n\tword \"farm\" means to her?\n\n\t\t\tDADDY \n\tI don't give a hoot in hell's\n\thollow what it means to her! She\n\tcan't stay in this house forever! I\n\tfired her, damn it!\n\n\t\t\tMOTHER \n\tIt sounds like a farm to me.\n\tCalling it a dairy establishment,\n\tthat's just trickery and flummery.\n\n\t\t\tDADDY \n\tTrickery and flummery or not, she's\n\tgoing there tomorrow on the bus!\n\tIt's settled! And I must say we've\n\tbeen more than fair to you, Rose,\n\tit's pretty selfish and mean\n\thearted of you to sit there and cry\n\tlike that!\n\nRose sits head bowed at the kitchen table.\n\n\t\t\tROSE \n\tI'm not cryin' because of me, I'm\n\tcryin' because of somebody else.\n\n\t\t\tDADDY \n\t\t(stops in mid-air, so to\n\t\t speak)\n\tWhat?\n\nEXT. HILLYER HOME - PATIO - DAY\n\nCUT TO a shot of Buddy outside on the patio, listening\nintently at the window. He leans forward with a keen\ninterest, eyes wide.\n\nINT. HILLYER HOME - KITCHEN\n\nCUT TO a shot CLOSE on Daddy. He is peering intently at Rose.\n\n\t\t\tDADDY \n\tWhat did you say, Rose?\n\nCLOSE ON Rose, as she turns, weeping.\n\n\t\t\tROSE \n\tWell, I was born on a farm\n\tmyself... and I hate to think of\n\tthe baby being born on one.\n\nOn them all. Daddy and Mother stare in shock at Rose.\n\n\t\t\tDADDY \n\tWhat baby? What baby? What baby are\n\tyou speaking about?\n\n\t\t\tROSE \n\tMine.\n\n\t\t\tDADDY \n\tYour baby?\n\n\t\t\tROSE \n\tYes, mine. I'm going to have one.\n\n\t\t\tDADDY \n\t\t(he is \"poleaxed,\"\n\t\t staggered)\n\tGood God almighty. This is a\n\tcatastrophe, they won't hire her.\n\n\t\t\tMOTHER \n\t\t(looks up, sees Buddy in\n\t\t patio window)\n\tBrother, get out of that window!\n\nBuddy ducks down out of eight instantly. Both Mother and\nDaddy, however, are too preoccupied and upset to be concerned\nwith him.\n\n\t\t\tDADDY\n\t\t(stares off groggily into\n\t\t space)\n\tThis is a total catastrastroke. As\n\tof this moment I am stumped, I\n\tadmit, I am stumped and treed both,\n\tthe hound dogs have me surrounded.\n\n\t\t\tMOTHER \n\t\t(as Rose begins crying)\n\tPoor thing, don't cry, Rose. I know\n\tyou feel awful, but don't cry,\n\thoney, nobody's perfect. Who's the\n\tfather, dear?\n\n\t\t\tROSE \n\tWell, I... I... I don't know...\n\tmaybe it was... but no, you can't\n\tbe sure about a thing like that. It\n\twasn't Billy, I didn't know him.\n\n\t\t\tMOTHER \n\t\t(gently)\n\tI know it's embarrassing... but who\n\twere you exposed to, dear?\n\tROSE \n\tWell, now, Mrs. Hillyer, I... ah-h,\n\tthat's kinda hard to say.\n\n\t\t\tDADDY \n\tYou're not going to get anywhere\n\twith that line of questioning. The\n\tproblem is, what are we going to\n\tdo?\n\n\t\t\tMOTHER \n\tThat's why I'm asking her who the\n\tfather is. It's the most vital\n\tquestion of all. Who's the father,\n\tdear?\n\n\t\t\tDADDY \n\t\t(offhand; he is thinking\n\t\t hard about what to do)\n\tShe already told you, she doesn't\n\tknow.\n\n\t\t\tMOTHER\n\t\t(naively)\n\tBut she must know... unless...\n\tunless... Rose, was there more than\n\tone person?\n\n\t\t\tROSE \n\t\t(weeping in handkerchief)\n\tOh-h, Mrs. Hillyer, I... I can't\n\tthink. I... I'm not really sure.\n\n\t\t\tMOTHER \n\t\t(gently, a tiny frown, a\n\t\t bit shocked)\n\tRose, really, you shouldn't act\n\tlike that.\n\n\t\t\tROSE \n\t\t(weeping)\n\tOh, I know. But I didn't, really.\n\tHonestly, I didn't. There was only\n\tone, but he's out of town and leave\n\tno forwardin' address.\n\n\t\t\tDADDY\n\t\t(a brilliant idea)\n\tAh, ha! Hold the phone! No\n\tforwarding address, huh? \n\t\t(turns to Mother)\n\tIn the shock of this brilliant\n\tmove, I forgot something.\n\n\t\t\tMOTHER \n\tWhat did you forget?\n\n\t\t\tDADDY \n\tI forgot that Rose will lie like a\n\tchild. She's no more pregnant than\n\tI am, she just doesn't want to go\n\tto that farm!\n\n\t\t\tROSE \n\tYes, I am.\n\n\t\t\tDADDY \n\tNo, you're not.\n\n\t\t\tROSE \n\tYes, Mr. Hillyer, I am.\n\n\t\t\tDADDY \n\t\t(triumphant, sure he's\n\t\t right)\n\tAll right, tell us, Rose, what\n\tmakes you think you're pregnant?\n\n\t\t\tROSE\n\t\t(simply)\n\tI haven't had my period for three\n\tmonths and my stomach is getting\n\tbig.\n\n\t\t\tDADDY\n\t\t(again \"poleaxed\" for a\n\t\t moment, but pulls himself\n\t\t together)\n\tI don't believe it.\n\n\t\t\tROSE\n\tIt's so, Mr. Hillyer.\n\n\t\t\tDADDY\n\tAll right, damn it. We've seen you\n\twith your clothes off around here,\n\tstand up and pull up your dress and\n\tlet's take a look!\n\n\t\t\tMOTHER\n\tHoney!\n\n\t\t\tDADDY\n\tShe doesn't have to take her\n\tpanties off, we can see her stomach\n\twith 'em on. All she has to do is\n\tpull up her dress and let us see\n\ther belly.\n\n\t\t\tROSE \n\tWell, all right, if you just won't\n\tbelieve me.\n\nRose stands up.\n\n\t\t\tMOTHER \n\tRose, you don't have to.\n\n\t\t\tROSE \n\tI don't mind.\n\n\t\t\tDADDY \n\tNow, you will see, she's lying like\n\tshe always does -- that belly will\n\tbe flat as a pancake!\n\nRose lifts her dress and Daddy leans forward eagerly to\nconfirm his belief. Rose stands there with her skirt lifted.\nShe has on a pair of skimpy white panties. An unmistakable,\ndefinite protrusion can be seen in the area below her navel\njust above the line of her panties. A stupefied look is on\nDaddy's face.\n\n\t\t\tMOTHER \n\tI'd say about three months. Are you\n\tsatisfied?\n\n\t\t\tDADDY \n\tI am poleaxed and in a non compos\n\tmentis condition. I wash my hands\n\tor the whole thing.\n\nEXT. HILLYER HOME - PATIO - DAY\n\nCUT TO a shot of Doll walking up onto the patio with\nschoolbooks. The CAMERA follows her as she walks over to\nBuddy, who is crouched down eavesdropping at another window.\nShe whispers to him.\n\n\t\t\tDOLL \n\tWhat's goin' on?\n\n\t\t\tBUDDY \n\tRose says she's goin' to have a\n\tbaby and she sure looks it, but I\n\tdon't think so.\n\n\t\t\tDOLL \n\tA baby... and she isn't even\n\tmarried.\n\n\t\t\tBUDDY \n\tThat's the least of her troubles.\n\tRose had a rare tropic disease and\n\tthe little tubes in her that babies\n\tswim down are all stopped up, she\n\ttold me all about it.\n\n\t\t\tDOLL \n\tIf it isn't a baby... what is it?\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. DR. MARTINSON'S HOME OFFICE WAITING ROOM - NIGHT\n\nA shot of Buddy and Rose in a rather elegant Doctor's waiting\nroom. It is night and they are alone on a small sofa. Buddy\nhas a very solemn and worried look. Rose lies weeping in\nterror on his shoulder.\n\n\t\t\tROSE \n\tOh, Buddy, they're gonna cut me all\n\tup! They're gonna cut my stummick\n\tall open, I'll die!\n\n\t\t\tBUDDY \n\t\t(trying to be brave)\n\tYou won't die, Rose.\n\n\t\t\tROSE \n\tBuddy, I'm scared, I'm scared!\n\nINT. DR. MARTINSON'S SOME OFFICE - NIGHT\n\nCUT TO a shot of Dr. Martinson's private office in his home,\nquite a bit more luxurious than his office at the hospital. A\nsober-looking Mother and Daddy sit talking to him. He almost\nseems to relish the situation.\n\n\t\t\tDR. MARTINSON \n\tI'm not surprised you thought she\n\twas pregnant. An ovarian cyst can\n\tlook very much like pregnancy. But\n\tit was pure wishful thinking on her\n\tpart. The girl can never have\n\tchildren, she had gonorrhea at\n\tfifteen and it was untreated.\n\n\t\t\tMOTHER \n\t\t(shocked, rather feebly)\n\tGonorrhea?\n\n\t\t\tDR. MARTINSON \n\tDon't worry, Madam, she can't\n\tinfect your dear little kiddies.\n\tShe long ago fully recovered, but\n\tthe disease did irreparable damage.\n\tThe girl is permanently barren.\n\n\t\t\tMOTHER \n\tWell, that's pathetic. Poor Rose,\n\twhat a life she has had.\n\n\t\t\tDR. MARTINSON \n\tWe make our own lives, Madam. As\n\tfor malignancy, I don't think so,\n\tit's very unlikely. I probably\n\tshouldn't have even mentioned that\n\tpossibility to her.\n\n\t\t\tMOTHER \n\t\t(rather coldly, seems\n\t\t disenchanted with him)\n\tNo, you shouldn't have, it was\n\tneedlessly cruel. She thinks she\n\thas cancer and is going to die.\n\n\t\t\tDR. MARTINSON\n\tShe's an adult, Mrs. Hillyer, I was\n\tmerely giving her the facts.\n\n\t\t\tDADDY \n\tWell, it's a disaster. I don't know\n\twhat to say, Doctor, I am floored.\n\tHow dangerous is the operation?\n\n\t\t\tDR. MARTINSON \n\tAny major operation is dangerous.\n\tHowever, as we know from her\n\tprevious illness, she's a very\n\tstrong girl.\n\n\t\t\tDADDY \n\tWell, if it isn't malignant and she\n\tcan get through the operation all\n\tright, it might be better than her\n\treally being pregnant. She doesn't\n\teven know who the father might have\n\tbeen.\n\n\t\t\tDR. MARTINSON \n\tOh, it's definitely better, beyond\n\tquestion. A fatherless child, an\n\tignorant girl with no job, no\n\tmoney, no home. It's fortunate, a\n\tblessing really, and a stroke of\n\tgood luck for another reason I want\n\tto mention to you.\n\n\t\t\tMOTHER \n\t\t(totally disenchanted with\n\t\t the Doctor)\n\tThis conversation is making me a\n\tlittle sick.\n\n\t\t\tDADDY \n\tHoney, that's no way to talk to the\n\tDoctor, he's merely doing his job,\n\tdear.\n\nOddly enough, in the stress of the situation, Daddy now seems\nalmost friendly to Dr. Martinson, whom previously he\nconsidered a polecat.\n\nINT. DR. MARTINSON'S HOME OFFICE WAITING ROOM - NIGHT\n\nCUT TO a shot of Buddy and Rose in the waiting room. He is\nhelping her lie on the couch on pillows as she weeps, a hand\nover her face.\n\n\t\t\tBUDDY\n\tI gotta find out what they're\n\tsaying. You lie back and rest,\n\tRose, and I'll give you a report on\n\tit.\n\n\t\t\tROSE \n\tI don't want to know...\n\nINT. DR. MARTINSON'S HOME OFFICE - NIGHT\n\nCUT TO a CLOSE shot of Dr. Martinson. An expression of\ndistaste is on his face. The CAMERA pulls back as he talks to\nMother and Daddy.\n\n\t\t\tDR. MARTINSON \n\tI'm sorry the truth nauseates you,\n\tMrs. Hillyer, because before you\n\tleave there's a bit more of it I'd\n\tlike to put to you. This operation\n\tprovides a therapeutic opportunity\n\tthat I feel is quite important in\n\tregard to this particular girl, who\n\tsuffers not only from an ovarian\n\tcyst but from a certain\n\tpsychoneurotic condition as well.\n\n\t\t\tMOTHER \n\tWhat do you mean, what kind of\n\tgobbledygook talk is that?\n\n\t\t\tDADDY \n\tGo ahead, Doctor, I think I am\n\tfollowing you.\n\n\t\t\tDR. MARTINSON \n\t\t(gives Mother an aloof\n\t\t glance, then to Daddy)\n\tFirst, about the girl's history.\n\tEvidently she's been very\n\tpromiscuous since early childhood,\n\tshe has no control over her sexual\n\timpulses. Furthermore, she is\n\tpermanently barren, she can't have\n\tchildren.\n\n\t\t\tDADDY \n\tGo on, Doctor.\n\n\t\t\tMOTHER\n\t\t(quietly)\n\tYes, go on.\n\n\t\t\tDR. MARTINSON \n\tI am thinking particularly of the\n\tother ovary. As a rule I don't\n\tbelieve in removing it. The woman's\n\thormonal system is profoundly\n\tdisturbed, she is subject to\n\tpossibly serious depression, she\n\tloses many of her secondary sexual\n\tcharacteristics for example, her\n\tbreasts might shrink and become\n\tflabby, facial hair might appear\n\talong with a coarsening of the\n\tfeatures, and of course her sexual\n\tdrive is greatly diminished,\n\tespecially in a girl or young\n\twoman. For these reasons I am\n\topposed to removing the other\n\tovary, as a rule. Do you follow me?\n\n\t\t\tDADDY \n\tI am ahead of you.\n\n\t\t\tDR. MARTINSON \n\tThen... may I speak quite frankly\n\twith you, Mr. Hillyer?\n\n\t\t\tDADDY \n\tPlease do.\n\n\t\t\tDR. MARTINSON \n\tI have of course observed the girl\n\tin treating her.\n\n\t\t\tDADDY \n\tOf course.\n\n\t\t\tDR. MARTINSON \n\tI think we both know her.\n\n\t\t\tDADDY \n\tYes, we know her.\n\n\t\t\tMOTHER \n\tWhat are you talking about? I don't\n\tunderstand all this mumbo jumbo and\n\tthe funny looks on your faces.\n\n\t\t\tDR. MARTINSON \n\tMrs. Hillyer, this girl is sick in\n\tmore ways than one. She is an\n\textreme psychoneurotic with\n\tuncontrollable sexual impulses. It\n\twould be a mercy to spare her the\n\tsuffering she causes herself and\n\tothers. Therefore I recommend as a\n\ttherapeutic measure the removal of\n\ther second ovary. It is ethically\n\tand medically the only proper\n\tdecision in this case and I suspect\n\tyour husband agrees with me.\n\n\t\t\tDADDY \n\tReluctantly, I do. It would be a\n\tblessing to her and everyone else.\n\tThe girl is oversexed and I say --\n\tspay her!\n\n\t\t\tMOTHER \n\t\t(slowly rises to her feet\n\t\t and in a trembling voice)\n\tOver... my... dead... body!\n\nA long, frozen pause as both Daddy and Dr. Martinson stare at\nMother in surprise. She stares at the Doctor with fire in her\neyes. He seems already to shrink a little. Finally she speaks\nwith a calm fury.\n\n\t\t\tMOTHER (CONT'D)\n\tAre you human beings or are you\n\tsome kind of male monsters? Is\n\tthere no limit to which you won't\n\tgo to keep your illusions about\n\tyourselves?\n\n\t\t\tDR. MARTINSON \n\t\t(shrinking a little)\n\tIllusions, Madam?\n\n\t\t\tMOTHER \n\tYou'd go so far as to mutilate a\n\thelpless girl who has no means to\n\tdefend herself, you'd go that far?\n\tDon't you think I know what you've\n\tjust said and don't you think I\n\tunderstand the dreadful and\n\trevolting crime you've just\n\tconspired to commit?\n\nDr. Martinson stares at her in fear and shock, intimidated by\nthe calm fury and ice-cold moral indignation.\n\nHe opens his mouth as if to speak, but no sound comes out.\nMother turns to Daddy.\n\n\t\t\tMOTHER (CONT'D)\n\tI thought I knew you. I thought I\n\tknew you better, I thought in your\n\theart you were a good and kind man.\n\tWell, I can't believe what I've\n\tjust heard in this room. A\n\tdefenseless girl depending on you\n\tfor protection, and you propose to\n\tmutilate and destroy her. How could\n\tyou listen even for a moment to\n\tthat sadistic man?\n\n\t\t\tDADDY\n\t\t(slightly shattered)\n\tWell, now, darlin'... give me a\n\tchance to defend myself.\n\n\t\t\tMOTHER \n\tI can't believe you really meant\n\tit, if I did I'd want to die. You\n\taren't a male monster, that man is\n\tbut you aren't. Look me in the eye\n\tand tell me, do you really want to\n\ttake Rose's womanhood away from her\n\twhen it's all she has got?\n\n\t\t\tDADDY \n\tWell, I... I hadn't thought about\n\tit that much. I was thinking...\n\twell, it's an idea, the girl is\n\toversexed, and...\n\n\t\t\tMOTHER \n\tRose isn't oversexed, that's\n\tridiculous. If you're going to talk\n\tnonsense, I don't want to talk to\n\tyou at all. Rose is exactly the\n\tsame as the rest of us, except more\n\tso.\n\n\t\t\tDADDY \n\tWell, I know, more so. That's why I\n\twas thinking... maybe she'd be\n\tbetter off.\n\n\t\t\tMOTHER\n\t\t(with a quiet fury)\n\tBetter off? How could she ever find\n\tlove and happiness, if you did what\n\tyou're talking about? Are you\n\tinsane?\n\n\t\t\tDR. MARTINSON \n\t\t(rather feebly)\n\tNow, may I say, I am against that\n\tparticular procedure, as a general\n\trule. But in a case of near\n\tnymphomania, it doesn't seem\n\tmonstrous to me at all, but\n\tmedically advisable.\n\nBoth Mother and Daddy totally ignore him. Mother's eyes are\nfixed on Daddy and he is struggling with himself, staring\ndown at the floor.\n\n\t\t\tDADDY \n\tWell, now, I admit... in Rose's\n\tcase, it would be cruel. If Rose\n\twasn't attractive and pretty...\n\twell, it would probably be bad for\n\talmost any young woman. I don't\n\tknow exactly what I was thinking\n\tabout, the doctor said it and it\n\tsounded reasonable.\n\nDaddy finally looks up at Mother and admits his error like a\nman.\n\n\t\t\tDADDY (CONT'D)\n\tBut you're right, darlin', you're\n\tabsolutely dead right, it would be\n\tan awful and horrible thing to do.\n\tI'm sorry, honey, forgive me, I\n\tdidn't mean it.\n\nMother turns from Daddy and walks up to the desk and stares\ndown at Dr. Martinson as if he is a loathesome bug upon which\nshe intends to step.\n\n\t\t\tMOTHER \n\tI will not cry like a woman. If I'm\n\tupset it's because of what my\n\thusband said, not because of you.\n\tYou can't make me cry like a woman,\n\ta woman has got just as much\n\tintelligence and self-control as a\n\tman. And you get this in your head.\n\tIf you hurt that girl, I'll hire\n\tlawyers and sue you for malpractice\n\tfor every penny you have got, I'll\n\tdo my level best to ruin you. Do\n\tyou understand me?\n\n\t\t\tDR. MARTINSON\n\t\t(a sickly smile, he is\n\t\t licked totally)\n\tYes, I understand you, but you have\n\tmisunderstood me completely.\n\n\t\t\tMOTHER \n\t\t(icy cold)\n\tI understand you perfectly. You\n\tleave that girl alone, you wretched\n\tman, or you will be sorry.\n\n\t\t\tDR. MARTINSON \n\t\t(a foolish smile, as if\n\t\t Mother has paid him some\n\t\t kind of compliment)\n\tActually of course I won't operate,\n\tI don't do major surgery. Dr. Hardy\n\twill operate and of course he'll be\n\tguided by your wishes in this\n\trespect.\n\n\t\t\tMOTHER \n\tLet him be guided not by my wishes\n\tand not by Rose's wishes, although\n\tI am sure they are identical. Let\n\thim be guided by the wishes of the\n\tcreative power of life itself,\n\tbecause that is what has spoken\n\tthrough me tonight.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. STREET BY HOSPITAL - DAY\n\nA shot of the Model A parked on the street outside a hospital\nin a small Southern town. We see Daddy slowly pacing back and\nforth in front of the hospital entrance, his head bowed and\nhis hands clasped behind him.\n\nANOTHER ANGLE, CLOSER on the Model A. Buddy sits in the\nmiddle on the front seat, Mother is at the window. Doll and\nWaski are on the back seat. They all are staring with pale\nworry at the pacing Daddy fifty feet away. All are\nfrightened, Mother is very pale. Doll has a tiny handkerchief\nto her eyes and is half crying. Even Waski is very scared.\n\n\t\t\tWASKI \n\t\t(seems on verge of tears)\n\tMother... is Rose going to die?\n\n\t\t\tMOTHER\n\t\t(in a trembly voice)\n\tNo, Waski, she won't die, because\n\twe are praying for her.\n\nCUT TO a shot of Daddy from the POV of the car. He looks at\nhis wristwatch, frowns and walks into the entrance of the\nhospital.\n\nANOTHER ANGLE, on them all in the car. They wait, pale and\nsilent. Doll sniffles in her handkerchief.\n\n\t\t\tDOLL \n\tWhy is it taking so long?\n\n\t\t\tBUDDY \n\tHere comes Daddy.\n\nCUT TO a POV shot of Daddy as he slowly walks up to the car,\nhis straw hat in his hand.\n\nCUT TO a shot of Mother CLOSE on her face as she stares at\nher husband as if trying to read the news on his face. A tiny\nfrown comes on her forehead as icy fear comes in her eyes.\n\nANOTHER ANGLE, CLOSE on Daddy as he walks up to the window of\nthe car, hat in hand. A trace of tears can be seen in his\neyes, but when he speaks his voice is calm.\n\n\t\t\tDADDY\n\t\t(philosophically)\n\tWell, I thought I'd seen the limit,\n\tbut these are the most great, gaga\n\tepizootics she's ever had.\n\nANOTHER ANGLE on Daddy and them all. In pale fear, mother\nstares at him, uncertain what has happened.\n\n\t\t\tMOTHER \n\tHow is she?\n\n\t\t\tDADDY \n\tFine.\n\nAs mother sighs in heartfelt relief...\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. HILLYER HOME - KITCHEN - DAY\n\nA shot of Daddy sitting with mother at the kitchen table.\n\nBright cheerful sunshine comes in the window that opens on\nthe patio. Rose comes into the SHOT carrying a coffee pot, a\nsunny smile on her face.\n\n\t\t\tDADDY \n\tYou're looking very chipper this\n\tmorning, Rose. Sow do you feel?\n\n\t\t\tROSE \n\tPerfect, wonderful, good as I ever\n\tfelt! Except for a big old scar on\n\tmy stummick, I wouldn't even know I\n\tbeen in the hospital.\n\n\t\t\tDADDY \n\t\t(with mild irony, as she\n\t\t pours him coffee)\n\tWell, we know you were there. The\n\tbill that hospital sent was\n\tabsolutely horrendous.\n\n\t\t\tROSE \n\t\t(her smile fades a trifle)\n\tWell, I'll pay you that back\n\tsometime, Mr. Hillyer.\n\n\t\t\tMOTHER \n\tDon't worry about it, honey.\n\nDaddy pauses, seems to be struggling with himself, he is\nfrowning.\n\n\t\t\tDADDY \n\tRose... I hate to be mean, but... \n\t\t(another pause, then a\n\t\t little shrug)\n\tOh, nevermind, forget it.\n\n\t\t\tROSE \n\t\t(in a little sad voice)\n\tWhat was it, Mr. Hillyer?\n\n\t\t\tDADDY \n\t\t(rises)\n\tNothing, Rose.\n\nDaddy stops beside her, puts an arm around her shoulders and\nwith weary irony.\n\n\t\t\tDADDY (CONT'D)\n\tWe all love you, darlin'.\n\nDaddy wearily picks up his straw hat from the kitchen counter\nand walks out of the kitchen on the patio, as the CAMERA\nstays on Rose and mother.\n\n\t\t\tMOTHER \n\tDon't worry, honey, you'll find\n\tsomething.\n\n\t\t\tROSE \n\tI was offered that job as a\n\twaitress.\n\n\t\t\tMOTHER \n\tForget about it, I don't want you\n\tworking in one of those honky\n\ttonks.\n\nEXT. HILLYER HOME - PATIO - DAY\n\nCUT TO a shot of Buddy on the patio. He has eight or nine\ngourds on an outdoor table and is cutting round holes in them\nand emptying out the seed. He glances up as Rose walks up to\nhim, pocketbook in hand. She seems a little sad. But she\nsmiles at him.\n\n\t\t\tROSE \n\tHi, Buddy. \n\t\t(puts an arm around his\n\t\t shoulders)\n\tHow's my sweetheart who never told\n\ton me when I was bad?\n\n\t\t\tBUDDY \n\tOkay.\n\n\t\t\tROSE \n\t\t(picks up a hollowed out\n\t\t gourd)\n\tMakin' homes for purple martins,\n\thuh? We had 'em on the farm.\n\tThey're the prettiest things.\n\tThat's what I wish I was, a bird.\n\tJust fly around catch bugs and have\n\ta lot of fun.\n\n\t\t\tBUDDY \n\tWhat are you going to do, Rose?\n\n\t\t\tROSE \n\tTake a little walk with me, huh?\n\nEXT. HILLYER HOME - GARDEN\n\nCUT TO a shot of Rose and Buddy on a beautiful summer day\nwalking in the garden behind the Hillyer house. They walk up\nto an empty rabbit hutch. The hutch is made of rough lumber\nand chicken wire and has cubicles for about a dozen rabbits.\n\n\t\t\tROSE\n\t\t(as she stares at the\n\t\t empty hutch)\n\tI guess I'll work as a waitress,\n\tBuddy. I done that before and it\n\tgot me in worse trouble than you\n\tcould know, but I can't stay here\n\tno more. Why did you get rid of\n\tyour rabbits, Buddy?\n\n\t\t\tBUDDY \n\tThey're dumb things. I got tired of\n\tthem.\n\n\t\t\tROSE \n\t\t(smiles, touches chicken\n\t\t wire)\n\tDid you know when I was a child we\n\thad pretty near five hundred\n\trabbits?\n\n\t\t\tBUDDY \n\tFive hundred rabbits?\n\n\t\t\tROSE \n\tYep, we had 'em in orange crates\n\tall over. It was Daddy's dream. He\n\twas goin' to get rich raisin'\n\trabbits. It was what killed Daddy.\n\tHe didn't drown hisself till a long\n\ttime later after Momma and Lunette\n\tdied of typhoid, but it was them\n\trabbits what killed him.\n\n\t\t\tBUDDY \n\tHow did the rabbits kill him?\n\n\t\t\tROSE \n\tHe thought he could sell 'em, but\n\tnobody but country folks eat\n\trabbits, Buddy, and they ain't got\n\tno money. We had to eat them dern\n\trabbits our own selves. Every dern\n\tone, and it took about four years\n\tto eat 'em all up.\n\n\t\t\tBUDDY\n\t\t(a little smile)\n\tWell, that doctor said you got\n\tprotein somewhere and I guess he\n\twas right.\n\n\t\t\tROSE \n\tBoy did I get sick of rabbit. But\n\tlater on after Momma died and Daddy\n\twasn't doin' nothin' but drinkin',\n\tI sure would of been glad for a\n\tlittle rabbit stew. You know, I\n\toughtn't to of told you about what\n\tDaddy done when I was a child.\n\tUntil them rabbits ruined him, he\n\twas a real good man, Buddy.\n\n\t\t\tBUDDY \n\tWhat was your mother like?\n\n\t\t\tROSE \n\tA saint just like your own mother.\n\tShe's up in heaven right now, her\n\tand Lunette, there ain't no doubt\n\tabout it.\n\nANOTHER ANGLE as Buddy and Rose walk away hand in hand away\nfrom the rabbit hutch.\n\n\t\t\tBUDDY \n\tMaybe it was eating all those\n\trabbits that made you sexy, Rose.\n\n\t\t\tROSE \n\tBuddy, sex don't mean a thing to\n\tme. It ain't nothin' but a mosquito\n\tbite. \n\t\t(stops, smiles, puts an\n\t\t arm around his shoulders)\n\tI'll tell you a secret. Girls don't\n\twant sex, Buddy, girls want love.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nHILLYER HOME - LIVING ROOM NIGHT\n\nA shot of Mother and Daddy in the Hillyer living room late at\nnight. Mother sits with a worried expression on a chair, a\nkimono around her shoulders. Daddy is pacing worriedly in\npajamas and a bathrobe. He looks at his wristwatch.\n\n\t\t\tDADDY \n\tIt's twenty after one.\n\n\t\t\tMOTHER \n\tI don't understand it. Even in the\n\twild days she was never as late as\n\tthis.\n\n\t\t\tDADDY \n\tI'm afraid it's my fault. I made\n\ther feel guilty this morning --\n\t\t(glances around, sees\n\t\t something in doorway)\n\tBrother, what are you doing up?\n\nANOTHER ANGLE on Buddy in pajamas as he enters the living\nroom.\n\n\t\t\tBUDDY \n\tI heard you talking. Hasn't Rose\n\tcome in?\n\n\t\t\tDADDY \n\tNo, she hasn't. \n\t\t(frowns, looks around)\n\tI think I hear a car.\n\nEXT. HILLYER HOME - DRIVEWAY\n\nCUT TO a shot of a 1930's automobile in the Hillyer driveway\nat night as it drives up and stops before the front steps.\n\nANOTHER ANGLE, CLOSE on Rose and Dave Wilkie in the car. Here\nDAVE is much YOUNGER, of course, and a rather handsome man in\na stolid way. Even though he is younger than when we saw him\non the plane, he is quite a bit older than Rose. Rose's eyes\nare opened wide, she is a bit breathless, obviously something\nimportant has happened. Dave stares at her as if fascinated,\nalmost as if awed.\n\n\t\t\tDAVE \n\t\t(rather stiffly)\n\tI want to thank you for a wonderful\n\tafternoon and evenin'. Can I see\n\tyou in the mornin'?\n\n\t\t\tROSE \n\t\t(a bit breathless)\n\tYes. Year you can, you sure can.\n\nINT. HILLYER HOME - LIVING ROOM - NIGHT\n\nCUT TO a shot of Daddy peering out of the window of the\nliving room.\n\n\t\t\tDADDY\n\tWhy, that looks like Dave Wilkie,\n\n\t\t\tMOTHER \n\tWho?\n\n\t\t\tDADDY \n\tYou know Dave, his wife used to do\n\tdressmaking for you before she\n\tdied.\n\nEXT. HILLYER HOME - FRONT STEPS - NIGHT\n\nCUT TO a shot of Rose on the steps. Happy as a clam, she\nturns and waves at Dave in the car, then goes on up the\nsteps.\n\nINT. HILLYER HOME - FRONT HALL - NIGHT\n\nCUT TO a shot of the front hall as Rose comes through the\nfront door. She is very excited, happy.\n\nINT. HILLYER HOME - LIVING ROOM - NIGHT\n\nThe CAMERA follows her as she goes into the living room with\nher big news.\n\n\t\t\tROSE \n\tYou'll never guess what happened! \n\t\t(pauses, then\n\t\t dramatically)\n\tI have met Mr. Right! I been with\n\thim all day and he loves me, I know\n\the does, he loves me and he's going\n\tto marry met Be's practi'cly ast me\n\talready!\n\n\t\t\tMOTHER \n\tWell... well, that's wonderful,\n\tRose.\n\n\t\t\tROSE\n\tAnd who do you suppose he is? That\n\tpoliceman who arrested me, the one\n\tI bit! He is Mr. Right!\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. CHURCH - DAY\n\nVARIOUS SHOTS of a wedding in a tiny country church. We see\nshots of Rose in a white wedding dress, smiling, happy. Dave\nis stiff and solemn in his best suit. Daddy gravely gives\nRose away. We hear no dialogue here, MUSIC on track. We see\nMother, Buddy, Doll and Waski in the front row, all in Sunday\nbest and very solemn. We see a CLOSE SHOT of Rose's knees\ntrembling beneath her white wedding dress as a country\nminister marries them. VARIOUS SHOTS of a rather idyllic\ncountry wedding in a very plain, unpretentious country\nchurch, and...\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. CHURCH - DAY\n\nA shot of Rose, Dave, Buddy, Doll and Waski at a picnic\ncelebration outside the church by a running brook.\n\nThe scene should be beautiful in summertime. We see a\nbarbecue pit, homemade ice cream in the metal can, other\npicnic things. A happy Rose is kissing first Buddy, then\nDoll, then Waski. Dave smiles fondly, but rather stiffly at\nher.\n\n\t\t\tROSE \n\tAnd now Waski, are you and Buddy\n\tand Dolly ready for some ice cream,\n\thuh? Do you like picnics or don't\n\tyou?\n\n\t\t\tWASKI \n\tWe like 'em! We love 'em!\n\n\t\t\tDAVE \n\tWell, it isn't a picnic, honey.\n\tIt's a barbecue.\n\n\t\t\tROSE\n\t\t(a little smile)\n\tOkay.\n\n\t\t\tDAVE \n\tA picnic doesn't involve roast\n\tmeat, hon. At a barbecue you have a\n\tlot of roast meat.\n\nCUT TO a shot CLOSE on Buddy as he stares pensively at Dave.\nThe CAMERA stays on him as we hear VOICES OVER. Rose is\nhappy, Dave phlegmatic.\n\n\t\t\tROSE (V.O.) \n\tWell, all I know is there's ice\n\tcream. And I'm gonna have me a\n\tplate right now!\n\n\t\t\tDAVE (V.O.)\n\tBetter wait, hon. It'll spoil your\n\tappetite. Have some barbecue first.\n\nThe CAMERA stays on Buddy, as he stares pensively at Dave. He\nhas no expression on his face at all.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. CHURCH - DAY\n\nA shot of Rose and Dave bidding goodbye to the Hillyers.\nDaddy, Mother, Buddy, Doll and Waski are in the model A. Rose\nis obviously on the verge of tears as Dave speaks solemnly to\nDaddy.\n\n\t\t\tDAVE \n\tWell, we are off to Savannah, Mr.\n\tHillyer. No more police work, I'm\n\tgetting in the construction field.\n\n\t\t\tDADDY \n\tGood luck, Dave. And good luck to\n\tyou, too, Rosebud.\n\n\t\t\tROSE\n\t\t(begins crying)\n\tOh, Mr. Hillyer! I just can't stand\n\tto say goodbye!\n\nDaddy starts the Model A.\n\n\t\t\tROSE (CONT'D)\n\tI love you all! Goodbye, Buddy!\n\tGoodbye, Dolly! Goodbye, Waski!\n\nANOTHER ANGLE on Rose as she weeps and waves the\nhandkerchief.\n\n\t\t\tROSE (CONT'D)\n\tGoodbye! Goodbye!\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT./EXT. MODEL A - STREET - DAY\n\nA shot of Daddy and Mother in the Model A as Daddy drives. We\nsee Doll and Waski solemn on the back seat, but Buddy is not\nvisible.\n\n\t\t\tDADDY \n\tWell, thank God we are rid of her\n\tat last. And the best thing of all\n\tis that she's happy. The little nut\n\tis happy, she found Mr. Right in\n\tthe nick of time!\n\n\t\t\tMOTHER \n\tWell, yes, she's happy. Of course\n\tDave doesn't have her life force,\n\tnot at all. There isn't much\n\tfurniture in his house, just a\n\ttable and one or two chairs,\n\twhereas Rose has furniture coming\n\tout of the windows.\n\n\t\t\tDADDY \n\tHoney, he is Mr. Right.\n\n\t\t\tMOTHER \n\t\t(slowly nods)\n\tYes, I think so. He adores her,\n\tit's almost pitiful the way he\n\tworships her. I just hope she isn't\n\ttoo much for him.\n\nMother pauses, frowning, she has her doubts, looks over her\nshoulder.\n\n\t\t\tMOTHER (CONT'D)\n\tWhat do you think, Brother?\n\nMother frowns in surprise.\n\nCUT TO a POV shot of Buddy on the back seat of the car. Now\nit is clear why we couldn't see him in the other shot. Be is\nlying down on the seat of the car with his Sunday coat pulled\nover his head.\n\nANOTHER ANGLE on Mother and Buddy, Doll, Waski. Buddy lies on\nthe seat, motionless with his coat over his head.\n\n\t\t\tMOTHER (CONT'D)\n\tWhat's the matter with him?\n\n\t\t\tDOLL \n\t\t(seems awed, staring down\n\t\t at Buddy)\n\tI don't know. I think he's cryin'!\n\nCUT TO ANOTHER ANGLE on Mother, from the front as she slowly\nturns back and stares thoughtfully ahead. The shot is also on\nDaddy. They both stare ahead in pensive silence. Finally\nMother speaks.\n\n\t\t\tMOTHER\n\t\t(rather sadly)\n\tMaybe Brother is right. Maybe so.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEND OF FLASHBACK\n\nINT./EXT. HERTZ CAR ON INTERSTATE - DAY\n\nON Willcox Hillyer behind the wheel of the Hertz car. He is\nstaring pensively ahead, a faint trace of tears in his eyes.\nIt is a very faint trace, a look of mild irony and amusement\nis on his face.\n\n\t\t\tWILLCOX HILLYER \n\t\t(dryly, to himself)\n\tMr. Right. Dave Wilkie.\n\nWillcox slowly shakes his head.\n\nEXT. HERTZ CAR - INTERSTATE EXIT - DAY\n\nCUT TO a shot of the red Ford as it takes a turn-off from an\nInterstate.\n\nEXT. HERTZ CAR - BUSTLING CITY - DAY\n\nCUT TO a shot of the red Ford as it drives into a rather\nbustling little Southern city that does not look at all like\nthe \"Glenville\" we have seen. A lot of traffic, new roads,\nfilling stations, prosperity. It could be Rome, Georgia as it\nis today.\n\nEXT. CAR PAST HOLIDAY INN - DAY\n\nANOTHER SHOT of the red Ford going past a modern Holiday Inn\nin the city.\n\nEXT. HILLYER HOME - DRIVEWAY - DAY\n\nON the red Ford as it turns into a familiar driveway, that of\nthe old Hillyer home.\n\nBut insofar as possible it looks different now, like a relic\nfrom the past.\nMaybe the house needs painting, the garden is in weeds -- the\nplace is not exactly dilapidated, but it is marked by time.\n\nA SHOT of Willcox Hillyer as he gets out of the red Ford and\nwalks up the familiar steps of the front porch, travel bag in\nhand.\n\nEXT. HILLYER HOME - FRONT PORCH - DAY\n\nON Willcox Hillyer at the front door. He tries the knob,\nopens the door and goes inside.\n\nINT. HILLYER HOME - FRONT HALL - DAY\n\nCUT TO a shot of Willcox Hillyer as he glances into the\nliving room. The room looks the same but different -it is\nmusty, dim.\n\nWillcox Hillyer stares at it as if haunted a bit, turns and\nthe CAMERA follows him as he crosses the hall and looks into\nMother's old bedroom-study. This room is quite different. The\nfour poster is gone. The room is dusty, musty, dark.\nMagazines are on the floor in a ring around Mother's old\nstudy chair. We see \"male\" things. It is apparent Daddy lives\nalone in this room.\n\nA SHOT of Willcox Hillyer as he walks down the familiar hall\nback to the kitchen.\n\nINT. HILLYER HOME - KITCHEN - DAY\n\nHe looks around. No one is there. He glances at a modern\nrefrigerator that is in pretty poor shape, glances with a\nfrown at dishes in the sink unwashed. He goes on out to the\npatio.\n\nEXT. HILLYER HOME - PATIO - DAY\n\nCUT TO a shot of Daddy putting out seed for birds on a table\non the patio. Daddy now is a very old man, but his\npersonality and style are the same as ever. He looks up with\na stern frown as Willcox Hillyer comes out on the patio.\n\n\t\t\tDADDY \n\tWell, you rascal, where'd you come\n\tfrom?\n\n\t\t\tWILLCOX HILLYER \n\tHello, Daddy. How are you?\n\n\t\t\tDADDY \n\tAbout as good as can be expected\n\twith one foot in the grave. Good to\n\tsee you, son. \n\t\t(they shake hands)\n\tDid you bring any of that Yankee\n\twhisky with you?\n\n\t\t\tWILLCOX HILLYER \n\tIt isn't Yankee whisky, Daddy, it's\n\tScotch.\n\n\t\t\tDADDY \n\tIt's Yankee whisky to me.\n\nDaddy takes him by the arm, leads him back into the kitchen.\n\n\t\t\tDADDY (CONT'D)\n\tHow do you stand it up there, boy,\n\tin all that ice and snow? What are\n\tyou, a polar bear?\n\nINT. HILLYER HOME - KITCHEN - DAY\n\nCUT TO a shot of Willcox Hillyer and Daddy as they enter the\nkitchen. The former opens his travel bag and takes out a\nbottle of Teacher's.\n\n\t\t\tWILLCOX HILLYER \n\tI can use a drink after the plane\n\tride I had.\n\n\t\t\tDADDY \n\tYour wife and children are back in\n\tNew Hampshire in the snow?\n\n\t\t\tWILLCOX HILLYER \n\t\t(a little smile; it is\n\t\t summer, there couldn't be\n\t\t snow in New Hampshire)\n\tYeah, they're in the snow.\n\nWillcox opens whisky, looks for glasses in the dusty familiar\ncupboard.\n\n\t\t\tDADDY\n\tAre they polar bears, too?\n\n\t\t\tWILLCOX HILLYER \n\t\t(frowns at cupboard)\n\tGood God, the way you live here.\n\tThis place hasn't been dusted since\n\tMother died. Look at that goddamned\n\trefrigerator.\n\n\t\t\tDADDY \n\tGot another twenty years in it,\n\tboy. \n\t\t(something seems to be\n\t\t bothering him)\n\tBy the way, son, do you recall\n\tRose, that pretty blonde girl who\n\tcame to our house way back in 1935\n\tor 1936 and caused such a damnable\n\tcommotion.\n\n\t\t\tWILLCOX HILLYER \n\t\t(frowns, turns and stares\n\t\t at him)\n\tOf course I recall Rose. In fact\n\tI've been thinking of no one else\n\tfor the last hour and a half.\n\n\t\t\tDADDY \n\tHow could that be, son?\n\n\t\t\tWILLCOX HILLYER \n\tDave Wilkie of all people was\n\tsitting by me on the plane -- her\n\tfirst husband. It's funny you would\n\tmention Rose. Did you hear from\n\ther?\n\nWillcox pours out whisky.\n\n\t\t\tDADDY \n\t\t(casually)\n\tWell, yes, in a manner of speaking.\n\tYou'll have the back bedroom, son,\n\tMother's old art room. Just be\n\tcareful going down the stairs you\n\tdon't break your Yankee neck.\n\nEXT. HILLYER HOME - PATIO - DAY\n\nCUT TO a shot of Willcox Hillyer and Daddy as they walk with\ntheir drinks out to the patio.\n\n\t\t\tWILLCOX HILLYER \n\tWhat's all this about Rose? What do\n\tyou mean, you heard from her in a\n\tmanner of speaking?\n\n\t\t\tDADDY \n\tOh, I heard from her, I got a\n\tletter from her, she's fine. But\n\tthere is some sad news.\n\n\t\t\tWILLCOX HILLYER \n\tWhat sad news? Did her cancer come\n\tback?\n\n\t\t\tDADDY \n\tOh, no, no, she got all over that.\n\tRose is fine. Let's sit down, son.\n\n\t\t\tWILLCOX HILLYER \n\tIs her husband sick or something?\n\n\t\t\tDADDY \n\tNo, it's another thing. I was going\n\tto write you about it, but since\n\tyou were coming down anyway I\n\tthought I'd wait till you got here.\n\tWhat did Dave Wilkie have to say?\n\nANOTHER ANGLE on Willcox Hillyer and the aged Daddy as they\nsit on the patio sipping whisky. Willcox Hillyer is not\ndisturbed or worried about Rose, Daddy has been very casual\nand offhand about it and he has no inkling of what the news\nreally is.\n\n\t\t\tWILLCOX HILLYER \n\tThe pitiful son of a bitch said\n\tRose was a nymphomaniac.\n\n\t\t\tDADDY \n\tUm-hmm, and I suppose that incensed\n\tyou?\n\n\t\t\tWILLCOX HILLYER \n\tYou're damn right it incensed me,\n\tthe miserable bastard. He also said\n\tthe kikes and the niggers have\n\ttaken over Washington. D.C.\n\n\t\t\tDADDY\n\t\t(nods somberly)\n\tYeah, I know, he was up here. It's\n\tpitiful like you say. When he lost\n\tRose it ruined the man, it\n\tdestroyed him totally when he lost\n\tRose.\n\n\t\t\tWILLCOX HILLYER \n\tHe didn't lose her, he threw her\n\taway.\n\n\t\t\tDADDY \n\tYes, I guess he did. He threw her\n\taway and it was the mistake of his\n\tlife.\n\n\t\t\tWILLCOX HILLYER \n\t\t(staring off pensively\n\t\t into space)\n\tYou know, I don't know this town\n\tany more. All this traffic, new\n\tbuildings, prosperity...\n\t\t(pauses, almost as if in\n\t\t pain)\n\tWhere have the years gone, Daddy?\n\tWhere is the little town I knew as\n\ta boy?\n\n\t\t\tDADDY \n\tAt rest in the creative universe\n\twith Mother, son.\n\n\t\t\tWILLCOX HILLYER \n\t\t(a little smile)\n\tThat's what she would say herself.\n\n\t\t\tDADDY\n\t\t(simply, he is not\n\t\t emoting)\n\tA wonderful woman, boy.\n\n\t\t\tWILLCOX HILLYER \n\tIt always gives me a funny feeling\n\tto come home. Dear old Southland.\n\tGone. It's all gone, Daddy --\n\t\t(a fond little smile)\n\t-- except you, you're still here.\n\n\t\t\tDADDY \n\t\t(matter-of-factly)\n\tNot for long, boy. I've outstayed\n\tmy welcome already.\n\n\t\t\tWILLCOX HILLYER \n\tIt's funny you would mention Rose,\n\tI was thinking about her all the\n\tway up in the car.\n\t\t(gives him a glance)\n\tOr maybe it isn't so funny.\n\n\t\t\tDADDY \n\t\t(as if in previous\n\t\t thought)\n\tI'm older than hell, boy. But this\n\tYankee whisky is mighty fine, I'll\n\tsay that.\n\n\t\t\tWILLCOX HILLYER\n\tAll right, Daddy. We have our\n\tdrink, we're out on the patio, you\n\thave prepared me for it. Rose's\n\tcancer has come back, hasn't it?\n\n\t\t\tDADDY \n\t\t(simply, quietly)\n\tNo, son, she is dead. \n\n\t\t\tWILLCOX HILLYER \n\t\t(numb with shock, for a\n\t\t moment can't speak or\n\t\t think)\n\tDead, Rose is dead? You mean... she\n\tdied?\n\n\t\t\tDADDY \n\tI am afraid so, son. About a week\n\tago. Her husband phoned me, she had\n\tasked him to call me if anything\n\thappened.\n\n\t\t\tWILLCOX HILLYER \n\t\t(in awful shock)\n\tBut... but how? She was young! Rose\n\twasn't old!\n\n\t\t\tDADDY \n\tShe was fifty-six, son. Of course\n\tshe didn't look it, nowhere near\n\tit. The cancer came back, I'm\n\tafraid I fibbed about that. But it\n\twas very quick, son. She was in the\n\thospital only two weeks, and the\n\tlast week she didn't know anything.\n\n\t\t\tWILLCOX HILLYER \n\t\t(in distress, a slightly\n\t\t choked voice)\n\tExcuse me, I'll be right back.\n\nWillcox Hillyer rises with his drink in hand and walks across\nthe patio to the kitchen door.\n\nINT. HILLYER HOME KITCHEN - DAY\n\nCUT TO a shot of Willcox Hillyer as he goes into the kitchen.\nHe picks up the whisky bottle and pours himself a very large\ndrink.\n\nANOTHER ANGLE, CLOSE on Willcox Hillyer as he stares across\nthe kitchen lost in thought.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nBLUR-BORDERED SHOT OF ROSE\n\nin the kitchen, a sunny smile on her face as she pours coffee\nfor Daddy. A very quick moment, only a few seconds.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nA CLOSE SHOT OF WILLCOX HILLYER\n\nin the kitchen, drink in hand, a look of grief on his face.\nHe struggles to control himself, puts a hand over his eyes,\nthen pulls himself together, turns from the kitchen.\n\nSHOT OF THE PATIO\n\nON Willcox Hillyer and Daddy as the former walks up with his\nrefreshed drink and sits down. He is in control now, his face\nis expressionless and he is seemingly calm.\n\n\t\t\tWILLCOX HILLYER \n\tWell, you have knocked me for a\n\thell of a loop, old man. A hell of\n\ta loop.\n\n\t\t\tDADDY \n\t\t(simply)\n\tI know. You loved her. So did I. It\n\twas an awful shock to me, too. An\n\tawful shock. Rose was so alive it's\n\thard to believe.\n\n\t\t\tWILLCOX HILLYER \n\tI can't believe it, Daddy. I know\n\tit must be true, but I can't\n\tbelieve it.\n\n\t\t\tDADDY \n\tIt's true, son. The girl with the\n\tcornflower eyes is dead, she is no\n\tmore,\n\nDaddy pauses, in trouble emotionally, but gets a grip on\nhimself and in an almost dispassionate manner; but powerful\nfeeling is behind his words.\n\n\t\t\tDADDY (CONT'D)\n\tShe got cancer of the breast, was\n\toperated on and had a seven-year\n\trecovery, then after a brief\n\tillness passed on in her sleep, as\n\tthe man with whom she'd lived in\n\tbeautiful love and harmony for\n\ttwenty-five years held her hand.\n\tThat is what happened, son, and God\n\trest her lovely soul!\n\nCUT TO a CLOSE SHOT of Willcox Hillyer. Despite his efforts\nto control himself, tears are in his eyes. He clenches his\nteeth, takes a big swallow of his drink.\n\nANOTHER ANGLE on them both as Daddy rises.\n\n\t\t\tDADDY (CONT'D)\n\tAnd now, if you are through with\n\tthat Yankee whisky, we'll go to the\n\tHoliday Inn and get some dinner.\n\nSHOT OF WILLCOX HILLYER AND DADDY\n\nas they walk toward the red rental Ford. Daddy uses a cane.\nHe is a very old man. Willcox Hillyer looks in pain, he\ngrimaces as they walk along.\n\n\t\t\tWILLCOX HILLYER \n\tWhy Rose? Why Rose, Daddy?\n\n\t\t\tDADDY \n\tNobody lives forever, boy. Who'd\n\twant to?\n\n\t\t\tWILLCOX HILLYER \n\tThat's a hell of a thing to say.\n\tWhy, Rose?\n\n\t\t\tDADDY \n\t\t(stops and firmly)\n\tNow look, boy, get a grip on\n\tyourself. Rose had a good life. She\n\tfound her. Right, didn't she? She\n\ttriumphed over everything, what are\n\tyou blubbering about?\n\n\t\t\tWILLCOX HILLYER\n\tI'm not blubbering.\n\nCUT TO a shot of the red Ford going down the familiar\ndriveway.\n\nSHOT ON DADDY AND WILLCOX HILLYER\n\nin the car. Daddy is staring fiercely ahead, Willcox Hillyer\nstares ahead in gloom.\n\nSHOT OF THE RED FORD\n\nas it pulls up in front of the Holiday Inn we have already\nseen.\n\nSHOT ON DADDY AND WILLCOX HILLYER\n\nin the car. Willcox Hillyer sits there staring off into space\nin deep gloom. Daddy eyes him and now relents. We see\nsympathy in his face.\n\n\t\t\tDADDY \n\t\t(gently)\n\tRose isn't dead, son. Not really.\n\tSome of us die, but some of us\n\tdon't. Rose lives. As long as some\n\tlittle girl somewhere gets herself\n\tup and goes out, Rose lives.\n\nCUT TO a shot of Daddy and Buddy, now middle-aged Willcox\nHillyer, as they walk toward the entrance of the Holiday Inn.\nMUSIC.\n\t\t\t\t  THE END\n\n\n\n\n\n\n\nRambling Rose\nWriters :   Calder Willingham\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:33:34.692123"}