{"title": "Real Genius", "film_link": "/Movie Scripts/Real Genius Script.html", "script_link": "/scripts/Real-Genius.html", "info_raw": "\n\nReal Genius Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Neal Israel  Pat Proft  Peter Torokvel\nGenres  Comedy\n\nRead \"Real Genius\" Script\n\n\n", "script": "\n\n        REAL GENIUS\n\n\n\n\n\nBODY { background-color: \"#FFFFFF\"; font-family: Courier New, Helvetica, sans-serif; font-size:10.0pt }\n\nDIV { position:absolute; left:5px; top:20px; width:734px; height:500px;  }\n\n#loc { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:1.2in; margin-bottom:0in;\nmargin-left:0.8in;text-transform:uppercase } \n\n#slug {\n\tfont-family:Courier New;\n\tfont-weight: normal;\n\tmargin-top:0in;\n\tmargin-right:1.2in;\n\tmargin-bottom:0in;\n\tmargin-left:0.8in;\n\ttext-transform:uppercase;\n<b>\t\n</b><b>} \n</b>\n#act { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:1.8in; margin-bottom:0in;\nmargin-left:0.8in } \n\n\n#speaker { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:1.in; margin-bottom:0in;\nmargin-left:2.8in;text-transform:uppercase }\n\n#spkdir { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:2.7in; margin-bottom:0in;\nmargin-left:2.2in }\n\n#dia { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:2.6in; margin-bottom:0in;\nmargin-left:1.6in }\n\n#pg { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:1.75in; margin-bottom:0in;\nmargin-left:6.5in }\n\n#right { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:0.75in; margin-bottom:0in;\nmargin-left:5.0in }\n\n\n\n\n\n\n\n\n\n\nREAL GENIUS\n\nEXT. SKY-DAY\nA Black B-1 Bomber banks steeply exposing its underside to us.\n\nMAN (V.O./FILTERED)\nSlingshot this is Watchdog. Rabbit's home.\n\nRolling out of its bank, the bomber begins a steep climb revealing the fact that it is carrying a small delta winged shuttle on it back. The bomber's wings slide back.\n\nBOMBER PILOT (V.O./FILTERED)\nRoger watchdog. Understand we are go for crossbow.\n\nSuddenly a rocket engine on the back of the modified bomber fires thrusting the plane into steep climb.\n\nINT. B-1 FLIGHT DECK-DAY\nTHE PLANE VIBRATES. The pilot and co-pilot are busy in their seats. Behind them sits a third pilot wearing a space suit. He gives them a thumbs-up signal, rises and crawls to the rear.\n\nBOMBER PILOT\n(into the mike/ over the roar)\nWatchdog, Slingshot. let us know when the rabbit's in the hole.\n\nEXT. A CROWD-DAY\nA blond haired, blue-eyed man with a small walkie-talkie is standing in the midst of a group of cheering Central American peasants and townsfolk. He is disguised as one of them.\n\nANGLE ON VILLA BALCONY\n\nThe uniformed President of this formerly sleepy, now strategically critical nation is waving to his people. He is flanked by military guards. He turns and walks into the villa.\n\nEXT. B-1 BOMBER-DAY\nThe bomber approaches the top of it's arc.\n\nATHERTON\nThe shuttle pilot climbs into his seat, straps in and checks his instruments.\n\nSHUTTLE PILOT\nAll systems check. Crossbow is armed.\n\nBOMBER PILOT (V.O.)\nRoger, Ignition sequence, start, separation in five...\n\nEXT. TOP OF THE BOMBER\nThe explosive bolts blow on the shuttle mount.\n\nINT. BOMBER FLIGHT DECK\nThe pilot pushes his yolk forward.\n\nEXT. BOMBER\nAs the bomber falls way, the shuttle's booster ignites with a roar, thrusting it toward space.\n\nEXT. SPACE-LOOKING BACK\nWe see a tiny glowing speck coming towards us. very quickly it gains in altitude and we see that it is the shuttle. Suddenly it is upon us and blasts over our heads.\n\nANGLE FROM BEHIND\n\nWe follow the shuttle. The engine stops. There is a small explosion, which pushes the booster rocket away. Small maneuvering rockets fire and the shuttle establishes itself in a nose down altitude.\n\nSHUTTLE PILOT (V.O. FILTERED)\nCrossbow is established.\n\nBOMBER PILOT (V.O./FILTERED)\nRoger, we have ground confirmation. Reference grid seven. Check pathfinder, on.\n\nSHUTTLE PILOT (V.O. FILTERED)\nRoger, I'm going on the scope. Moving Target Indicator, engage.\n\nBehind and above the cockpit a large hatch opens and a large circular spinning mirror rises and locks into position.\n\nINT. SHUTTLE\nThe pilot reaches above him and pulls down a viewfinder and begins looking through it.\n\nEXT. THE SHUTTLE.\nA target sighting lens moves from right to left, stops, and then moves back but this time with the mirror moving in unison.\n\nINT. THE SHUTTLE\nWhile still looking through the viewfinder, the pilot manipulates the targeting controls.\n\nINSERT\nPILOT'S POV OF THE SCREEN\nCrosshairs, a grid patter and digital, rangefinder readouts appear over various parts of the Earth's topography as the pilot searches for his target. Then it steadies on a polarized image of a group of people. One of the images seems to stand out brighter than the others.\n\n\nEXT. VILLA PATIO-DAY\nThe president and his aide are chatting with a group of visiting dignitaries. There is a jovial atmosphere as they order drinks from a waiter. The president is proudly displaying one of his medals to his guests. it has a very unique jewel-like object in its middle.\n\nINT. THE SHUTTLE\nThe pilot is watching through the viewfinder.\n\nPILOT\n(into mike)\nScanner on. Target locked. Tracking locked.\n\nEXT. THE SHUTTLE\nThe mirror and sighting lens adjust as they track the target.\n\nEXT. VILLA PATIO\nThe President is served a cup of coffee. He asks the waiter for sugar. The waiter turns back to his cart.\n\nINT. THE SHUTTLE\nThe pilot puts his hands on the joysticks and flips open the trigger covers.\n\nPILOT\nNice and easy does it.\n\nEXT. THE SHUTTLE\nDead silence, then the mirror erupts in brilliant light and sends an incredibly bright beam toward the Earth. Behind the shuttle we see exhaust gases venting in giant plumes into space.\n\nEXT. VILLA PATIO\nThe beam strikes the president like the finger of god. He vaporizes. The waiter turns back with the asked-for sugar to find a smoking hole where the President once stood.\n\nEXT. SPACE\nThe shuttle finishes its work and the beam shuts down. The mirror folds away and the shuttle arcs across the screen preparing for re-entry, firing small retro rockets.\n\nPILOT (V.O)\nI'm coming home. Just like shooting ducks in a barrel.\n\nPULL BACK TO REVEAL\n\nINT. A HIGH-LEVEL GOVERNMENT CONFERENCE ROOM-NO WINDOWS \nA large screen at one end of the room continues to show the re-entry.\n\n\nANNOUNCER (V.O.)\nThe Crossbow Project. There's no defense like a good offense.\n\nIn the middle of the room is a giant donut of a round conference table. Another circle hangs above and casts light downward in such a way as to light the table-top but caser those sitting around it in shadow. We can see them but not well. There are SIX MEN in suits. The look is sinister as Hell; but the talk is for Rotary Club meeting.\n\nA MAN, sitting at three o'clock, wearing an Air force major's uniform, points at a remote control device at the screen and stops the film. The lighting does not change. he turns to the man sitting at twelve o'clock.\n\nCARMICHAEL\nNice little weapon isn't it, Dave?\n\nDECKER\nWell, I guess so, but gosh, Don, it's a movie. You want me to start buying weapons from George Lucas?\n\nPolite laughter all around.\n\nCARMICHAEL\nNow that would be somethin', wouldn't it?\n\nDECKER\nWell, sometimes I think I might as well.\n(to one of the others)\nWhat do you think of what you saw, Roy?\n\nROY\nI think there weren't enough girls.\nMore polite laughter. Then Roy turns ice cold in a flash.\n\nROY (cont'd)\nIs this thing for biological targets only?\n\nCARMICHAEL\nNo, Sir, this thing would take the skin right off, of Air Force One if you wanted. Not that I'm saying we'd ever want to kill our own President, but, you know, for example.\n\nROY\nOur studies indicate that this type of weapon is totally useless for warfare.\n\nDECKER\nIt's not intended for use in your kind of warfare, Roy. This is a perfect peace time weapon.\n\nROY\nWhat's the kill potential?\n\nCARMICHAEL\nAs soon as the size-to power ratio is licked we'll have about seven bangs for the buck.\n\nROY\nWhen that?\n\nCarmichael shrugs the sign for \"who knows?\"\n\nDECKER\nSeriously, Don, I have to report to the Secretary that everything's on schedule. We have plans for your little ray's gun this summer.\n\nCARMICHAEL\n(Trying to cover)\nAs I understand it, guys, there's some major practical difficulties. I'm pushing as hard as I can.\n\nDECKER\nWell, Don, you tell those geniuses you've got until the end of the next fiscal quarter to come up with a working model or I'm pulling the plug on the funding.\n\nCARMICHAEL\n(very nervous)\nI'm assured they're on the verge of a major breakthrough.\n\nDECKER\nGood. Just as long as we get a working weapon out of it by June. Right, general?\n\nROY\nI wouldn't know, Dave. I haven't had a working weapon since Korea.\n\nDECKER\nRight.\n(to assistant)\nLarry, let's see the film on blinding techniques, then we'll have some lunch, all right?\n\nINT. EXHIBITION HALL -DAY\nWE OPEN on a sign: \"Effects of marijuana on Rodents.\" A cage is divided in half. One side is marked \"NO Marijuana.\" A chinchilla is running furiously on a treadmill. The other side is marked \"Marijuana.\" A chinchilla is lying in a little hammock.\n\nDOLLY BACK TO WIDE SHOT. We see we are in a large hall. There are dozens of booths and exhibits. A banner strung across the hall lets us know that this is the \"WESTERN REGIONAL HIGH SCHOOL WINTER SCIENCE FAIR.\"\nANGLE ON a pretty female student at a booth standing in front of a clear glass cylinder that has vacuum hoses connected to it. There are two colored gases inside the cylinder. A sign behind her says: HOW TORNADOS ARE FORMED.\" A small group of boys stand watching her in as sexist a way as possible.\n\nGIRL\nIt doesn't seem to be working; but if it was, these gases would be going around.\n\nA BOY\nWe don't care.\n\nANGLE ON another part of the hall. Two blond-haired, male twins stand proudly in their booth. \"THE GRAVITATIONAL PULL OF HEAVENLY BODIES.\"  A large, crudely painted diorama of the Milky Way is in the background. Several painted balls are suspended in front, labeled \"Mercury,\" \"Venus,\" etc. The sun is represented by a large electromagnet. All the \"planets\"\n\nANGLE ON a booth near the entrance. A ROBOT attracts a crowd. It has a video screen for a face which reads: \"Hi, my name is Harry. Let me guess your weight and age.\"  With jerky motions he extends his mechanical arms and shakes hands with passersby. He is speaking to a small KID.\n\nHARRY\nHi, my name is Harry. Let me guess your weight and age...midget mutant; weight... \n\nThe kid shoots it in the neck with a toy space gun. The ROBOT SHORT CIRCUITS: sparks shoot out, its arms fly in circles until a FUSE BLOWS and it SIZZLES to a burning stop.\n\nWE PAN OVER TO the door just in time to see the entrance of DR. JERRY ATHERTON, professor of physics at Pacific Tech, and a popular host of a PBS television show about science. His manner and bearing mark him as a classic anal retentive. He is a perfect cross between Carl Sagan and Jerry Brown. Brilliant, intense, seemingly sincere but, in fact, incredibly manipulative. There is an intentional aura of superiority surrounding him.\n\nWe FOLLOW him in and down an aisle where he draws the attention of the crowd in the manner of the celebrity he is. An OLD LADY stops him. He beams a smile at her.\n\nOLD LADY\nAre you Dr. Atherton?\n\nATHERTON\nYes, dear.\n\nOLD LADY\nI just love your television show.\n\nATHERTON\nWell, thank you. We try.\n\nOLD LADY\nWhat's Albert Einstein really like?\n\nATHERTON\nDead.\n\nOLD LADY\nOh, I thought you had him on.\n\nATHERTON\nNo, that was just an actor.\n\nOLD LADY\nIs everyone an actor, then?\n\nATHERTON\n(beginning to tire of this)\nNo, I'm a physicist.\n\nOLD LADY\nBut Einstein isn't?\n\nATHERTON\n(dismissing her)\nNice talking to you.\n\nHe walks away.\n\nANGLE ON a booth where we meet MITCH SIMON, aged fifteen. Mitch is a genius. He's known that since he was old enough to understand the word, which was on his first birthday. He was doing college level work by the time he was in the fourth grade. Although he's intellectually precocious, he's still only 15 years old and has all the problems of any average adolescent. His shyness and intellect have always made him feel different and uncomfortable in social situations.\n\nHe stands with his PARENTS near a demonstration table. Unlike some of the other exhibits we've seen, there is nothing amateurish about this one. In fact, it is an impressive display of a dye laser. We can see the beams of multi-colored rays bouncing between mirrors, moving through liquids, combining with gases.\n\nMITCH is trying to explain his work to MR. SIMON, who is a nice enough guy but who pretty much regards the fact that his son is gifted as a pain in the butt.\n\nMITCH\nSee, Dad, it's coherent light.\n\nMR. SIMON\nIt talks?\n\nMITCH\nNo. \n\nATHERTON APPROACHES. He is seen by MRS. SIMON, who greets him.\n\nMRS. SIMON\nDr. ATHERTON, what a surprise.\n\nATHERTON\nHello, Mrs. Simon. How are you?\n\nMR. SIMON\nNo problem with Mitch's test scores or anything, is there?\n\nATHERTON\nNo, no. I just thought I'd stop by, bring you the good news myself. I just got word from the admissions committee. We did it. Mitch is in.\n\nMRS. SIMON\nIsn't that wonderful.\n\nATHERTON\n(to Mitch)\nHello, Mitch.\n\nMITCH\n(shyly)\nHi.\n\nATHERTON\nNice little display?\n\nMITCH\nThanks\n\nATHERTON\nWhat's your medium?\n\nMITCH\nJust Argon. But I have it all structured for HF if I could get some.\n\nATHERTON\nThat would be interesting.\n\nMITCH\nIt's all theoretical at this stage, but I have the power supply completely worked out.\n\nATHERTON\nVery nice.\n\nMITCH\n(a kid again)\nThanks.\n\nATHERTON turns to Mitch's parents.\n\nATHERTON\nYou must be very proud. he's the first student we've ever accepted for winter term entrance at Pacific Tech.\n\nMR. SIMON\nI image he's the youngest, too.\n\nATHERTON\nNo, actually. The youngest we've had was a twelve, but he cracked under the pressure within six months so we don't really count him.\n\nMRS. SIMON\n(almost in tears)\nFifteen year old and off to college. Image.\n\nMR. SIMON\nListen Doc. This scholarship thing, does he get any kind of whatya call it, signing bonus sort of thing?\n\nATHERTON\n(hoping this is not going to be a problem)\nWell, no...but by allowing Mitch to progress at an accelerated rate we give him the opportunity to fulfill a far greater portion of his remarkable intellectual potential. Don't you agree?\n\nMR. SIMON\nYeah, I guess. It's just that athletes get, you know, cars and stuff.\n\nATHERTON\n(polite for Mitch's sake)\nWell, I guess we scientists are a little different than athletes.\n\nMR. SIMON\nCheaper.\n\nATHERTON\nSmarter\n\nMR. SIMON\nNot when it comes to getting cars.\n\nMRS. SIMON\nWe just want the best for Mitchie.\n(changing gears)\nDr. Atherton, I saw your show the other night, about radioactive isotopes, and I have a question for you.\n\nATHERTON\nOh, yes?\n\nMRS. SIMON\nIs that your real hair?\n\nMR. SIMON\nWell, I wondered that, too.\n\n\n\nATHERTON\n(struggling for manners)\nWell, interesting question, when you consider the philosophical aspects of whether anything on television is \"real\" or actually just an \"image\" being broadcast.\n\nMR. SIMON\nDidn't look real. Anyway, listen, I got to get something to eat or I'm gonna die.\n\n\nMRS. SIMON\nCome on, let's look for something.\n\nThey start away.\n\nMRS. SIMON (cont'd)\nI saw over there one of the kids was doing an experiment with insect protein.\n\nMR. SIMON\nDid you see anyone doing anything with corned beef?\n\nThey exit.\n\nATHERTON\nYour parents...\n\nMITCH\nYes?\n\nATHERTON\nThey're...nice\n\nMITCH\nThey're Okay. They just sometimes don't have any idea of what I'm talking about.\n\nATHERTON\nI'm sure of that. Afraid you're going to miss your friends?\n\nMITCH\nNo. I don't have any. I think I intimidate other kids.\n\nATHERTON\nGood boy.\n\nMITCH\nI don't want to.\n\nATHERTON\nRemember, compared to you, most people have the IQ of a carrot. We're different than most people, Mitch, but you should be proud of that. I mean, look around. From now on, you'll BE amongst peers, colleagues. I suppose I might as well tell you now, I've put you on my personal research team. Some of the finest minds on campus, not the least of which is, of course, my own.\n\nMITCH\nIt sounds great.\n\nATHERTON\nWell, now, I'm expecting great things from you, my boy. This is only the second time I've given this honor to a freshman. The first was...\n\nMITCH\nChris Kinsley.\n\nATHERTON\nYou know Chris?\n\nMITCH\nNo, but he's a legend in the Physics Club.\n\n\nATHERTON\nWell, you're going to become a legend yourself. You'll be working with Chris. He's a senior now but he's still on the team and still as brilliant as ever.\n\nMITCH\nWow.\n\nINT. PACIFIC ELECTRONICS INSTRUMENTS-DAY\n\nWe see CHRIS KINSLEY, Chris has on his head a pair of those jiggling antennae-like things. WE PULL BACK to revel that he is on a tour of the facilities.\n\nA huge hanger-like room filled with workers constructing and assembling scientific instruments. This place has the look and feel of the Big Time.\n\nWorkers put the finishing touches on a communication SATELLITE. Passing through this Disneyland of Science is a well-dressed executive. ROBERT JENSEN, who is guiding Chris on the tour. Chris was heralded as one of the smartest people to ever enter Pacific Tech.  He proved to be even smarter than many of his professors. He also proved to be one of the most outrageous people to ever enter Pacific Tech. his antics are legend. Unimpressed with authority, pomposity and bullshit in general., Chris dresses on the sloppy side of life. Currently he's wearing a sports jacket that's seen better days, over a faded sweatshirt that has the logo \"I ? Toxic Waste.\"\n\nThey approach a second executive/scientist, MIKE DODD, who is wearing a lab coat, and a beautiful public relations executive named SHERRY NUGIL, who is also wearing a lab coat but in a whole new way.\n\nJENSEN\n(as they approach the couple)\nGuys, I want you to meet Chris Kinsley. Chris, this is Sherry Nugil, my assistant, and Mike Dodd.\n\nCHRIS\nDr. Dodd?\n\nJENSEN\nHe's the man who just designed the new Telcom Satellite here.\n\nCHRIS\nI know. Nice to meet you Dr. Dodd. Isn't the Telcom raining debris all over Europe?\n\nDODD\n(smiling, but angry)\nThat was a launch problem, not a design problem. Why are you wearing that toy on your head?\n\nChris takes the thing from his head.\n\nCHRIS\nOh, this. Sorry, I was worried that people would think I was stuffy, You know, no fun; all brain, no penis,\n\nJENSEN\nPardon?\n\nCHRIS\nI'm sorry, it's just an infantile response to authority.\n\n\n\nJENSEN\n(confused)\nYes. you are Chris Kinsley, aren't you?\n\nCHRIS\nNo. Well, yes. I mean, I used to be.  Now I'm Mhavishnue Kinsley.\n\nJENSEN\n(relieved)\nI see. You are being funny.\n\nCHRIS\nWell, I just can't help it. You're such a fun guy yourself.\n\nJENSEN\nOh yes. I think you'll find we all are, right Mike?\n\nDODD\nNo.\n\nJENSEN\nNow Chris, Sherry is going to show you around the place. She can answer any questions you might have about fringe benefits or dress codes or anything and I'll see you back upstairs when you're done, okay? Sherry, take good care of this young man. He's one of the ten finest minds kin the country.\n\nCHRIS\nSomeday I hope to be two of them.\n\nJENSEN\nSee you later.\n\nJensen and Dodd exit.\n\nCHRIS\nYou are very beautiful.\n\nSHERRY\nYou don't act like one of the top ten minds in America.\n\nCHRIS\nOh, really? How many of them have you met?\n\nSHERRY\n(with a really dirty look in her eye)\nSeven.\n\nCHRIS\nReally?\n\nSHERRY\nYou'll be eight. Six was Professor Hostetler at M.I.T.\n\nCHRIS\n\nOld Professor Hostetler? Isn't he dead?\n\nSHERRY\nHe is now.\n\nINT. ANOTHER PART OF THE PEI FACILITY- ALITTLE LATER \n\nSherry and Chris stare intently into one another's eyes.\n\n\nSHERRY\nAnd so, coupled with full insurance coverage and bonus plans, you find it adding up to a fairly sizable perks package.\n\nCHRIS\nI have a pretty sizable perks package right now.\n\n\nSHERRY\nAlso, we understand that you people don't care too much for rigid timetables, and that's pretty rare in private industry.\n\nCHRIS\nSo are you.\n\nSHERRY\nIs it true that school of yours keeps getting smarter and smarter kids every year?\n\nCHRIS\nYup! I mean no!\n\nINT. YET ANOTHER PART OF PEI- A LITTLE LATER.\n\n\nSHERRY\nYou see the funding associations are the same. Our theoretical work is in the Blue Sky sector as well.\n\nCHRIS\nYou have no idea how much I need that kind of continuity in my life right now.\n\nINT. CATWALK ABOVE A HUGH LAB- A LITTLE LATER STILL\n\nSHERRY\nYou just belong here, Chris. We have several of Dr. Atherton's former students and they're all doing quite well with us.\n\nCHRIS\nWhat number was he?\n\n\nSHERRY\nTwo. One of his other students was four.\n\nCHRIS\nYou're wonderful.\n\n\nSHERRY\nI know.\n\nCHRIS\nCan we go somewhere?\n\n\nSHERRY\nYes.\n\nEXT. ROOF OF HANGER-DUSK\nThe giant dish of a huge radio telescope faces heavens.\n\nSHERRY (O.C)\n(between kisses)\nTalk smart to me.\n\nCHRIS (O.C.)\nWhat?\n\nANGLE ON CHRIS AND SHERRY\nThey are lying in the middle of the dish. Passion mounts, fingers cope with belts and buttons, clothing falls away; my god, these people are having sex.\n\n\nSHERRY\nPlease I need it. What was your favorite course?\n\nCHRIS\nI guess right now I'd have to say Fluid Mechanics.\n\n\nSHERRY\nOooooooooh...\n\nCHRIS\n(responding to something interesting Sherry just did with her hips)\nAnd Gym.\n\n\nSHERRY\nPlease.\n\nCHRIS\nSorry.\n\n\nSHERRY\nWhat's your research with Artherton?\n\nCHRIS\nUltra-high power laser as an energy force for fusion. Tremendous boon to all mankind. And womankind, too.\n\n\nSHERRY\nFusion, more fusion.\n\nCHRIS\nIt's the process for obtaining enormous amounts of energy from forms of hydrogen, like Deuterium and Tritium.\n\n\nSHERRY\nOh, my God, more.\n\nCHRIS\nExtracting the fuels is no problem.\n\n\nSHERRY\nHmmmm.\n\nCHRIS\nGetting them to combine and release the energy is the problem.\n\n\nSHERRY\nOohh, yes\n\nCHRIS\nIt takes temperatures of 100 million degrees Celsius.\n\n\nSHERRY\nOh, God.\n\nCHRIS\nSo, I'm...\n\n\nSHERRY\nYes.\n\nCHRIS\n...building...\n\n\nSHERRY\nYes.\n\nCHRIS\n...a laser...\n\n\nSHERRY\nOh, yes.\n\nCHRIS\n...that pulses...\n\n\nSHERRY\nHmmmmmmmm.\n\nCHRIS\n...very hot...\n\n\nSHERRY\nOhhh...\n\nCHRIS\n...and causes...\n\n\nSHERRY\nYes.\n\nCHRIS\n...Fusion...\n\n\nSHERRY\nAhhhhhhhhhhh.\n\nEXT. PACIFIC TECH CAMPUS-DAY \nIt is an impressive campus of older California Spanish building mixed with modern architectural marvels. This is the Sunday before the beginning of the Winter Term.\n\nWe pick up MITCH SIMON and FOLLOW him as he crosses campus. He is wearing a tie and jacket, which only adds to his general sense of being out of place. He is carrying a map which he stops to consult every now and again. He stops an upper classman and asks him a question while pointing at the map. The older asks him a question while pointing at the map. The older student takes great delight in turning the map right side up.\n\nEXT. PRESIDENT'S HOUSE-AFTERNOON\nThe tasteful and elegant official residence of the university's President. DR. EUGENE MEREDITH. MITCH approaches the open front door, where he is greeted by MRS. MEREDITH.\n\nMITCH\nGood afternoon. I'm looking for \n(reading from the invitation in his hand)\nthe President's Freshman Tea.\n\nMRS. MEREDITH.\n(leading him inside)\nOh, good. I'm so glad we have one then. Who are you?\n\nINT. THE HOUSE-CONTINOUS\nThey pass through on their way to the backyard.\n\nMITCH\nMitch Simon.\n\n\n\nMRS. MEREDITH.\nOh yes. You're the special case. I know Gene wants to meet you. You're just in time for his traditional talk. Would you like a glass of sherry?\n\nMITCH\nI'm a minor.\n\nMRS. MEREDITH.\nAha, well of course you are. That would explain your height.\n\nThey exit out onto the patio.\n\n\nEXT. THE PATIO AND GROUNDS OF THE HOUSE-CONTINUOUS\nThe returning freshman class has gathered for a social. Mitch is the only one in a tie. He stands on the patio with Mrs. Meredith whose husband, the apparently ever-jovial professional academic administrator, is about to speak to the assembled.\n\nMEREDITH\nPeople, if I might get your attention.\n\nThe din begins to quiet.\n\nMEREDITH (CONT'D)\nWelcome back, freshmen! I take it you all put the Christmas break to good use?\n\nThere is good-natured jeering.\n\n\nMEREDITH (CONT'D)\nNow, if you'll indulge me, I'd like to speak seriously for a moment. You will recall that when I welcomed you to the Pacific institute of Technology a few short months ago I spoke of how we are one of the finest scientific institutions in the world. I think the finest. I mentioned our six Nobel Prize winners, our members of the national Academy of Sciences, and our members of the National Academy of Engineering.  This is an intellectual oasis of technological achievement in the dessert of general academic mediocrity we see inmost colleges and universities today.\n\nThere is some applause and good-natured banter. Mitch is truly moved. This environment is exactly what Mitch has hoped for all his life.\n\n\nMEREDITH (CONT'D)\nI also spoke of the fact that you are the finest freshmen class we have ever had here.\n\nThere are cheers and applause.\n\nMEREDITH (CONT'D)\nI say this to every freshman class. Each year we raise our entrance requirements and each year there is a group of students like you who meet and surpass those requirements.\n\nAlmost jubilant cheering and clapping.\n\nMEREDITH (CONT'D)\nAs you have no doubt already noticed by now, over a third of you are gone. By the end of the year another third of you will have followed them out of Eden and into mediocrity.\n\nThe crowd goes deathly silent as Meredith continues in his cherry manner.\n\nMEREDITH (CONT'D)\nWe want only the best. Hard work and high standards are expected of everyone. And if you aren't up to it Cal tech or M.I.T. might take you, but you don't fit in here.\n\nMEREDITH (CONT'D)\nLet me remind you that this place is an opportunity, not a right; a chance not a gift; a working lunch, not a picnic. Welcome back.\nSeveral waitresses begin serving tea but the despair of reality creeps over the students and they begin to disperse. Mitch stands waiting for the approaching Dr. Meredith.\n\nMRS. MEREDITH \nGene, this is Mitch Simon.\n\nMEREDITH\nOh, yes, Professor Artherton's bright star.\n\n\nMITCH\nYes, sir.\n\nMEREDITH\nAnd I understand you're already on his project. I'm assured you're going to do great things.\n\nMITCH\nI hope so.\n\nMEREDITH\nLet me give you some advice.\n\nMITCH\nThank you.\n\nMEREDITH\nDon't screw up.\n\nMITCH\nOkay. I guess I better go now.\n\nHe walks away.\n\nMEREDITH\n(watching Mitch with satisfaction)\nI think the young people really appreciate my \" getting down\" verbally, don't you?\n\nMRS. MEREDITH \nAbsolutely.\n\nEXT. CAMPUS-LATER\nOnce again Mitch, map in hand, must ask another student for directions. This one also turns the map right-side up and then points to the building they are standing in front of. As he heads for it he passes a bronze bust of one of the founding fathers, DR. BRADFORD. The students have decorated him with a muffler, earmuffs and carrot nose to look like a snowman.\n\nINT. APPLIED PHYSICS BUILDING-MOMENTS LATER\nMitch walks down a long corridor. He passes several open doors that reveal laboratories with all kinds of scientific equipment all over them.\n\nMitch stops in front of a closed door. He checks the number, then looks down at a card in his hand. He turns the card right-side up. He OPENS the door to REVEAL a darkened lab. In the darkness there is a veritable light show of laser beams. A voice calls out from the darkness.\n\nVOICE (O.C.)\nHey!\n\nMITCH\nYes?\n\nVOICE (O.C.)\nCome in here.\n\nINT. LAB-CONTINUOUS\nMitch ENTERS quickly and shuts the door behind himself.  In the instrument glow we can make out the forms of three other students. They are: KENT, CARTER and BODIE, members of Dr. Atherton's research team.\n\nKENT\nJust leave the sandwiches and go.\n\nMITCH\nMe?\n\nKENT\nNo, Yoda; yeah, you.\n\nMITCH\nI don't have any ah...\n\nCARTER\nBrains?\n\nMITCH\nNo, sandwiches.\n\nKENT\nWell then, what good are you?\n\nCARTER\nWhat are we supposed to eat?\n\nMITCH\n(getting a little fed up)\nHow about my shorts.\n\nKENT\nHey! Who do you think you're talking to?\n\nThe laser snaps off and the lights snap on. The glare is a little intense at first.\n\nKENT (CONT'D)\nAre you from the restaurant or not?\n\nWith the lights on we get a chance to have a better look at the team. Kent is an elitist, intellectual snob with very little imagination who likes to think of himself as Atherton's protégé. He wears braces on his teeth because he knows how important a proper smile can be in the marketplace.\n\nMITCH\nNo. I'm Mitch Simon. I'm a student. Dr. Atherton told me to come up here.\n\nKENT\nOh, you're the new stud, are you. Or is it dud?\n\nMITCH\nHow do you mean?\n\nBODIE\nStud. Hot shot. Brain. You're the twelve-year-old, right?\n\nMITCH\nI'm fifteen.\n\nCARTER\nDoes your body know that?\n\nMitch attempts a good-natured laugh. It's not a great attempt.\n\nMITCH\nAre you expecting him or...\n\nKENT\nSure. Can I get you something? A balloon?\n\nMITCH\nAre any of you guys Chris Kinsley?\n\nThey all freeze.\n\nKENT\nNo, Thank God.\n\nCARTER\nHey Kent, I hear Kinsley got that PEI job all locked up.\n\n\nKENT\nDamn! I wanted that job.\n\nMITCH\nWhy?\n\nKENT\nWhy? Because it starts at fifty thousand a year, that's why. Plus travel, car, stock options...\n\nMITCH\nOh. Well, I'm supposed to have a look at your work up to date. Check it over.\n\nKENT\nCheck it over.\n\nMITCH\nYes.\n\nKENT\nFor what?\n\nMITCH\nMistakes, I guess. He said you guys are stuck.\n\nThe room goes rigid. Evidently this little punk of an upstart needs to be told what Christ died for.\n\nKENT\nLet's get something very clear here. Everything you've heard about the supportive student body and the honor code might hold for the rest of the campus, but it doesn't count for squat in here. Which means when jerry's not here, you do what I say. From God to Jerry to me, get it?\n\nAtherton ENTERS.\n\nKENT (CONT'D)\nHi Jerry.\n\nATHERTON\nI've told you before, Kent, you don't get to use my first name.\n\nKENT\nDid I?\n\n\nATHERTON\n(to Mitch)\nGood to see you, Mitch.\n\nATHERTON (CONT'D)\n(to the group)\nI'm sure you're all going to become fast friends.\n\nKENT\nWe're well on our way already.\n\nATHERTON\nGood, because after Mitch is brought up to date, I want the rest of you to take your cues from him. He'll be in charge of the group.\n\nKENT\nWhat? I mean, good choice, Jerry.\n\nATHERTON\nYou're doing it again, Kent.\n\nKENT\nAm I?\n\nATHERTON\nWhere's Chris?\n\nKENT\nHe didn't bother to come in today.\n\nBODIE\nHe said he didn't feel like it; and then I said 'you better'; and then he said ' or what?'; and then I said ' or he'd get the heck,' and then he said 'jam it, it's Sunday' and he looks for God on Sundays; so I said 'okay, but I'm telling.'\n\nATHERTON\nThank you Bodie. I notice you've stopped stuttering.\n\nBODIE\nYes, I've been giving myself some sock treatment and it's working.\n\nATHERTON\nGood.\n(to Mitch)\nI'm sorry he isn't here. I wanted you to meet your hero.\n\nCARTER\nHero? That clown? Look at this.\n\nHe points to a table full of laser equipment comprised of various angled mirrors and gas cambers and drib units. The others gather around it.\n\nCARTER (Cont'd)\nWe heard he wasn't coming in. Kent and I figured we'd go ahead and run his section without him. And we started getting picosecond ratings that aren't even in the ballpark.\n\nKENT\nIt looks like it'll take at least a week to re-do all this and start again.\n\nMitch is carefully studying the equipment and checking some notes that were on the table.\n\nKENT (CONT'D)\nAnother costly mistake.\n\nATHERTON\nAre you sure?\n\nCARTER\nPositive.\n\nKENT\nPositive.\n\nMITCH\n(reading from notes)\nNegative.\n(innocently, to Carter and Kent)\nThere's a mistake all right, but I think you guys made it. Look, you inverted the last two steps.\n\nCARTER\n(grabbing the notes)\nI don't make mistakes...\n(reading)\n...Usually.\n\nATHERTON\nDamnit, don't touch other people's things.\n\nMITCH\n(adjusting the equipment)\nThis shouldn't take too long to fix.\n\nATHERTON\nI'm glad that you were here, Mitch.\n\nKENT\nYes, thanks for pointing out Carter's mistake, Mitch.\n\nATHERTON\nDon't bother with that now. I'm sure you want to go get settled.\n\nMITCH\n(relieved)\nWell, it has been kind of a long day.\n\nAtherton starts to leave.\n\nATHERTON\nOh, I forgot Kent, I need your help.\n\nKENT\nAnything, Jerry.\n\nATHERTON\nStop it.\n\nKENT\nWhat?\n\nATHERTON\nGet copies made of everything so young Mitch here can get started  checking everything tomorrow.\n\nKENT\nMy pleasure.\n\nATHERTON\nAnd then, on your way back, stop at my cleaners.\n\nKENT\nDon't give it a thought. I enjoy it.\n\n\n\nATHERTON\n(to Mitch)\nShall we?\n\nMITCH\nSure.\n\nAtherton exits, followed by Mitch.\n\nBODIE\nI guess it goes from God to Jerry to you to the cleaners, right Kent?\n\nEXT. DORM HALL- LATE AFTERNOON\nMitch enters the arched column portico of this dormitory building.\n\nINT. ROOM\nThe room is small, cramped, and more than a little disheveled. PEI, NASA and science fiction posters hang on the ceiling and wall, over and around one of the two beds. Junk food and soft drink containers are littered everywhere. In one corner is a fully-stocked Frito Lay Chip display.\n\nMitch crosses to his bed and sits. He is exhausted and depressed. The door opens and Mitch see a strange, tall, bulkily- built, hermit-looking kind of a guy enter. He is carrying a McDonald's bag. He stops when he see Mitch and stares at him in a quirky way for a second, then crosses to the closet, opens the door and exits into it.\n\nMITCH\nHello?\n\nGetting no response, Mitch rises, goes to the closet, opens it and looks in.\n\nMITCH\nHello?\n\nThere is no one there.\n\nMITCH\nWhat kind of place is this?\n\nMitch crosses to his luggage. he opens a bag and, to his surprise, he finds it empty. he then looks in the other bag and find they've all been cleaned out. Puzzled, he shuts the bags.\n\nSuddenly, the door swings open and CHRIS KINSLEY , who we saw earlier at PEI, ENTERS. He's dragging a large piece of mechanical equipment. it is, in fact, a baseball pitching machine.\n\nCHRIS\nHi.\n\nMitch stares.\n\nCHRIS (CONT'D)\nHey, you just gonna sit there admiring the room or are you going to help me with this?\n\nMITCH\nWhat is this thing?\n\nCHRIS\nIt's a penis stretcher. You want to try it out?\n\nMITCH\nNo!\n\nCHRIS\nOh really? Well, congratulations, then, No, It's an Iron Mike.\n\nMITCH\nWhat?\n\nCHRIS\nA baseball pitching machine.\n\nChris is setting it up.\n\nMITCH\nI was here for a second this morning...\n\nCHRIS\n(frightened)\nYou didn't straighten the place up, did you?\n\nMITCH\n(looks around at the mess)\nNo.\n\nCHRIS\nGood. 'Cause all my filth's in alphabetical order.\n\nChris puts on a baseball cap and grabs a bat.\n\nMITCH\nAnyway, I dropped off my luggage and now all my bags are empty.\n\nA ball is pitched. Chris connects and the ball smashes through the window.\n\nCHRIS\nI put your stuff away for you.\n\nAnother pitch. He smashes a ball into a wall.\n\nCHRIS (CONT'D)\nIt's all in the bottom drawer. Shirts, pants, underwear, shoes. I had a little trouble with your sport jacket, so I threw it out. Nah, only kidding. This one's for you, little Johnny.\n\nHe whacks another pitch. He does a crowd cheer and circles the bases.\n\nCHRIS\nWhat a game. I'm Chris Kinsley.\n\nMITCH\nOh, no.\n\nINT. MOVING CAR- SAME TIME\nDr. Atherton is riding in a rental car with DON CARMICHAEL, a government contract monitor. These two guys are part of an old boy network involved with research and development.\n\nCARMICHAEL\nWe're falling way behind, Jer.\n\n\nATHERTON\nWell, we're not making cheese sandwiches here, you know, Don.\n\nCARMICHAEL\nThat's a good one. I'll have to remember to use that, Jer.\n\nATHERTON\nThe new boy is quick.\n\nCARMICHAEL\nHe better be because the company needs a practical working model within four months.\n\nATHERTON\nYou can't dictate innovation.\n\nCARMICHAEL\nLet me put this another way, Jer. You  know all that money we've been spending for development?\n\n\nATHERTON\nYes\n\nCARMICHAEL\nWell, when a project gets cut off, the finance boys always run an audit.\n\nATHERTON\nI see.\n\nThe car pulls up to Atherton's house, where there is a great deal of construction going on. Once the work is completed, this is going to be beautifully restored, rather large Victorian home.\n\nCARMICHAEL\n(looking out)\nHaving a little work done on the old place, are you? Looks nice.\n\nINT. MITCH'S ROOM-THAT NIGHT\nMitch is gathering up some books. He looks at a chart on the wall.\n\nMITCH\nLibrary... library...205.\n\nThe door to the room opens while Mitch is looking the other way. We catch a glimpse of the same tall, bulkily-built man opening Mitch's closet door and disappearing inside. Mitch turns just in time to see the door close. he goes into it, opens it and looks inside. Nothing. he goes to the door of his room. Mitch opens the door, steps into the hall and slips, landing on his ass. His books go flying.\n\nINT. HALLWAY\n\nThe hall floor is covered with ice wall-to-wall. Skating MUSIC is playing on a cassette somewhere. A few students, dressed for winter, are skating. Chris skates over and helps Mitch to his feet.\n\nCHRIS\nWelcome to Pacific Tech's \"Smart People On Ice.\"\n\nHe whirls away, leaping from wall to wall, sliding quickly down the ice. He stops in front of a short, roly-poly kid of Japanese descent, MARK ICKAGAMI, better know as ICK. Ick is a bio-chemist who spends a great deal of time in his lab experimenting with various fun compounds that do things ranging from making artificial ice to increasing memory.\n\nCHRIS\n(with a proletariat accent)\nIce turned out real good, Ick.\n\nICK \nYeah, it worked., didn't it?\n\nCHRIS\nWhat did you use?\n\nICK \n(teasing)\nOh, sure, I tell you then you tell somebody else, and the next thing you know we're in the middle of another ice age.\n\nCHRIS\n(yelling down the hall)\nCome on, people. Nobody's skating.\n\nA STUDENT (O.C.)\nJust 'cause you're a slack, Kinsley.\n\nCHRIS\nMoles and trolls.\n\nMITCH\nWhat?\n\nCHRIS\nMoles and trolls. Work, work, work, work. I plan this for weeks. I go to a lot of trouble and all they want to do is study. I'm hurt. I know that's it's not like me but I'm sorry. I'm starting to get discouraged, people. We had nobody at the mutant hamster races, one entry in the Madame Curie look-alike contest, and he was disqualified later. Why do I even bother?\n\nChris skates off.\n\nMITCH\n(to Ick)\nHow does he do it?\n\nICK \nWell, I'm not an expert, but I think he puts one foot in front of the other and pushes.\n\nMITCH\nNot skating. The horsing around. The never studying. I know he's smart. but nobody's that smart.\n\n\nICK \nI don't know how smart he is. Before he even came here he invented a solar battery, which laid the groundwork for the system that provides the energy for Amarillo, at half the cost. He'd be a millionaire today if he been smart enough to make them pay for it. How he pulls the grades, I don't know.\n\n\nJust then, ROARING down the hall, face down on a sled, comes JORDANS COCHRAN. She is an advanced engineering student with great theoretical and mechanical skill who can never seem to pitched energy of a hyper-kinetic kindergarten class. She crashes at Mitch's feet. He reaches down to help her.\n\nMITCH\nYou okay?\n\nJORDAN\nNo, not emotionally, no I'm not. I'm disappointed... not terribly, but still, it should have gone much, further, much faster. It's okay, though, I know what the problem is, that's simple, it's obviously the drag coefficient, I'll just have to re-design the blades. I can do that, that's easy. I can do that here; but I have to cut then after they're designed, that takes tools, that takes time. How long is this stuff going to last, do you know?\n\nICK \nMaybe another half an hour.\n\nJORDAN\nThat's great, that's good. I can do that, no problem, lots of time.\n(to Mitch)\nWhat's your name?\n\nMITCH\nMitch\n\nJORDAN\nThanks for the help. See you.\n\nAnd in a flash she is gone.\n\nMITCH\nYour welcome.\n(to Ick)\nWho was that?\n\nICK \nThat? that was...\n\nJordan rushes back.\n\nJORDAN\n(to Mitch)\nI'm Jordan, I realized I'd forgotten to tell you my name, it's Jordan. I heard there was going to be someone new this term, are you a freshman?\n\nMITCH\nYes.\n\nJORDAN\nDo you have a bed?\n\nMITCH\nYeah.\n\nJORDAN\nOh, I was going to make you one if you needed it but you don't so that's okay. Well, I gotta go, I'll see you later, probably. See you Ick, see you Mitch.\n\nAs she races off, KENT enters carrying several binders.\n\nKENT\nWhat's all this suppose to be?\n\nCHRIS\nThis? This is new kind of shovel.\n\nMitch finds this very funny and reacts accordingly by laughing.\nKent can't stand to be laughed at.\n\nKENT\n(Dumping the binders into Mitch's hands)\nThis should keep you busy for awhile. This, plus your regular class load should turn your brains to mush in a month.\n\nMITCH\nAw! Kent, we were going to name you King of the Winter Carnival.\n\nKENT\nHa ha.\n(to Ick)\nI suppose you're in on this, too. Did you make this stuff?\n\n\nICK \nI'm not saying.\n\nKENT\nWho's going to clean it up?\n\nICK \nDon't have to. It's going to go from solid form directly to gas.\n\nKENT\n(impressed by this fairly uncommon phenomenon)\nReally? What is it?\n\nICK \nI'm not saying. But I can tell you that it's fairly rare, and very unstable.\n\nKENT\nYou're all a bunch of degenerates.\n\nCHRIS\nWe are? What about that time I caught you naked with a bowl of Jello?\n\nKENT\n(flustered)\nI...you... I was hot and I was hungry. And anyway...Look, Kinsley, you're not number one anymore.\n\nCHRIS\nNumber one what?\n\nKENT\n(pointing to Mitch)\nMighty mouse, here, beat your placement scores by over twenty points.\n\nCHRIS\nReally? I guess you think you're pretty hot stuff?\n\nMITCH\n(uncomfortable, unsure if this is real)\nWell...no, I mean\n\nCHRIS\nHey! Maybe you are smarter than me, but, can you do this?\n\nChris pushes himself off backwards and slides along the ice in an attempt at a fancy figure skating move. Just as he's about to finish he crashes to the floor at the precise moment that the floor turns into a cloud of rising gas. Chris disappears in the cloud.\n\n\nICK \n(excited)\nIt worked!\n\nMITCH\nThat's neat.\n\nICK \n(teasing)\nNow if we can just keep it from exploding.\n\nKent runs away.\n\nCHRIS\n(from inside the growing cloud)\nHey, Ick.  Is it okay to breathe this stuff?\n(beat)\nIck?\n(beat)\nIck?\n\nThe cloud fills the screen.\n\nINT. CHRIS AND MITCH'S ROOM-THE NEXT MORNING\n\nPerfect morning light streams through the window, making even this dump look beautiful. Chris is asleep in a strange position on his bed, proving that even asleep he is eccentric. We Pan across the room to Mitch. He has obviously fallen asleep while reading the binders that Kent had given him the night before. We HEAR the sound of the door opening, followed by some heavy footsteps. This causes Mitch to wake up. it takes him a second to realize where he is. He sits up.\n\nMITCH'S POV\n\nAgain we catch just a glimpse of that same mysterious figure opening the closet door. He is holding a \"McDonald's\" bag. He closes the door behind him.\n\n\nANGLE ON MITCH\nTo say the least, he's thrown by this strange intrusion.\n\nMITCH\nHello?\n\nHe waits a beat, listening. Nothing happens so he gets up and crosses to the closet, looks inside.\n\nOVER MITCH'S SHOULDER INTO CLOSET\nThere's nothing in there but clothes. Mitch pushes the garments aside and finds just a wall.\n\nANGLE ON MITCH\nHe shakes his head. This is getting frustrating. He exits the room.\n\nINT. BATHROOM\nMitch crosses to the urinal. Just as he is about to relieve himself, the door opens. Jordan enters. This is an experience Mitch has never before and as a result he is one uncomfortable fifteen-year-old.\n\nJORDAN\nHi, good morning, I thought I saw you come in here, you must be an earlier riser, we met last night, I'm Jordan, remember? I had a sled with me, I made you a sweater.\n\nShe holds out a sweater. He leans into the urinal, trying to hide himself the best he can.\n\nMITCH\nLast night?\n\nJORDAN\nyeah, it's just something I do with my hands while I'm reading. I hope I got the size right, I'm pretty sure I did, I have a brother so I use him as a sizing comparison, and I have a pretty good eye for that sort of thing, so I just went ahead and made you one because I was, you know, up. Peeing?\n\nMITCH\nYeah.\n\nJORDAN\nI never sleep. I don't know why. It drove my roommate nuts. I mean really nuts, they had to take her away in an ambulance and everything, she's okay now thought but she had to be transfer to an easier school but I don't know if that part has anything to do with being my fault, but still, anyway, if you ever want any help studying at night or just let me know, okay, 'cause I'm just a couple of doors down from you guys and I'm usually up and I wouldn't mind, okay?\n\nMITCH\nThanks, I will.\n\nJORDAN\nAre you finished yet?\n\nMITCH\nI can't start.\n\nJORDAN\nBecause I'm here?\n\nMITCH\nI think so.\n\nJORDAN\nIsn't that weird? Well, I have to go.\n\nMITCH\nMe, too.\n\nJORDAN\nRight, well, don't forget what I said, I'll put the sweater in your room, see you later, tell Chris that if he wants one I'll be happy to make him one but nit today because after classes I'm going to rebuild the back part of my room, you should come down and see it later, I have to go, bye.\n\nShe exits.\n\nMITCH\n(stunned)\nbye.\n\nINT. THE LOBBY AREA OF THE DORM- A LITTLE LATER\nMitch is coming down a hallway into the area. He is dressed in his tie and jacket and has books under his arm. As he crosses past the self-serve vending machine he spots Chris entering the kitchen. Mitch follows him inside.\n\nMITCH\nSomething strange happened to me this morning.\n\nCHRIS\nWas it a dream where you see yourself dressed up in kind of sun god robes standing on top of a pyramid with all theses nude women throwing little pickles at you?\n\n\nMITCH\nNo\n\nCHRIS\nWhy am I the only person who has that dream?\n\nBefore Mitch can ask another question, Chris open the freezer compartment and takes out a large thermos-like container. He takes it over to the cutting board, then takes from his pocket a pair of calipers, a pair of tweezers, and a little box that looks like a dental floss kit. He opens the container which immediately starts pouring thick steam.\n\nMITCH\nLiquid nitrogen?\n\nChris uses calipers to extract a length of tubing from inside the container. he puts it down on the board and, using the tweezers, pushing out a cylindrical mound of ice from inside the tube. Then, from the dental floss kit, he pulls out a length of very fine wire, which he uses to cut the ice into a number of thin \"coins\" and slides then into the lid of the container, which he picks up and takes out the door with him. Mitch follows.\n\nINT. VENDING MACHINE AREA\n\nCHRIS\nCoffee?\n\nUsing the tweezers, Chris picks up an ice coin and puts it into one of the machines. There is a high-pitched squeak. To Mitch's astonishment, the machine accepts the bogus money and a cup drops down and fills with coffee.\n\nCHRIS\nSo, what's happened?\n\nMITCH\nOh. There's a guy living in our closet.\n\nCHRIS\nYou've seen him too?\n\nChris puts his coins in several of the machines and retrieves from them junk food junky's treasure trove of goodies.\n\nMITCH\nWho is it?\n\nCHRIS\nHopsfield.\n\n\nMITCH\nIs he... safe?\n\nCHRIS\nSo far.\n\nChris exits. Mitch stares after him.\n\nSCHOOL MONTAGE:\nA quick series of shots moves us through the next two months of time, accompanied by an original song.\n\nINT. LECTURE HALL-DAY\n\nAn older professor is lecturing, pointing to a complicated algebraic problem on a blackboard, Mitch is in the last row of this student-filled, multi-tiered classroom. Everyone else listens intently and makes notes while Mitch thumbs quickly through a textbook, then closes it and makes a note in a loose-leaf binder.\n\nINT. ATOM SMASHER ROOM-DAY\nMitch stands with a group of other students watching an instructor explain the intricacies of nuclear fission. Mitch opens a notebook and starts writing furiously.\n\nINT. ATHERTON'S PROJECT LAB-DAY\n\nMitch is using his notes and some pieces of equipment to explain something to the rest of the team. Chris is impressed. Kent shakes his head in disagreement until Atherton nods his approval, at which point Kent also agrees.\n\nINT. CHRIS AND MITCH'S ROOM-NIGHT\nit is late but Mitch is still hard at the books. Hopsfield goes by and disappears in the closet. Mitch doesn't even notice anymore. There is a knock at the door and Jordan enters. She has brought Mitch a device that she just built which holds textbooks and turns the pages automatically.\n\nINT. LECTURE HALL-DAY\nMitch, dressed more informally, is in the same room with the same professor as in scene 54. This time, however, there are several empty seats. The people have been replaced by cassette tape recorders. Mitch takes notes.\n\nINT. CHEMICAL ENGINEERING LAB-DAY\n\nMitch enters with another student to find a teddy bear waiting for him at his place.\n\nINT. ATHERTON'S LAB-NIGHT\nMitch and Chris work alone. it is obviously very late. Using a variety of exotic-looking devices, they put the laser through its paces and make notes.\n\nINT. LECTRURE HALL-DAY\n\nThis time, Mitch is the only student. Tape recorders sit in front of every seat. The professor drones on, apparently oblivious to what he sees in front of him.\n\nINT. WAVE TANK ROOM-DAY\nA very attractive instructress is demonstrating a dye trace experiment in a huge wave tank. Mitch takes notes.\n\nINT. DINING HALL\nMitch and Ick are carrying trays of food, looking for a place to sit. They pass a seated Kent, who points out a place for Mitch, who looks to see a highchair at the end of the table.\n\nEXT. LIBRARY-MORNING\nMitch comes down the stairs with several books under his arms. He stumbles and drops one of the books. As he struggles to recover it, it is handed to him by none other than Hopsfield. By the time Mitch realizes who it is, the mysterious figure is once again gone.\n\nEXT. STREET-DAY\nMitch is crossing the street carrying a huge load of books. Suddenly a yellow Citroen pulls up behind him and honks its horn causing Mitch to drop everything. He looks at the driver and sees that it is a laughing Kent.\n\n\nINT. ATHERTON'S CLASSROOM\nChris, Kent, Bodie and Carter are present as Atherton wraps up a day's class. People take serious notes. Chris reads a magazine. People file out and Mitch enters approaches Chris to get him to work on the laser. Chris shakes his head.\n\nINT. ATHERTON'S LAB-LATE NIGHT\nMitch is working alone. He adjusts the laser and turns it on. It burns through a very thick block of wood, but Mitch is still not pleased.\n\nINT. HALLWAY-NEXT MORNING\nA very tired Mitch heads for the lecture hall. He comes to the door, opens it and enters to see a tape recorder lecturing to a roomful of tape recorders.\n\nINT. CHRIS AND MITCH'S ROOM-ANOTHER NIGHT\nIn need of a break from studying, Mitch goes to the closet in hopes of figuring out how to open the wall.\n\nHe examines the walls and the floor and looks, for hidden switches or secret mechanisms, all to no avail. As he's about to give up, the closet door swings closed. When it closes, the wall opens to reveal a small elevator-like cage. Mitch steps in and the cage descends. It hits a lever and stops. But before Mitch steps in and the can get off, it begins to move sideways, triggering another pulley, and goes down again into the steam tunnels, then drags along the floor and stops. Mitch gets out. It's spooky. In the distance there is a glow of light.\nMitch goes forward until he can see the home of Hopsfield. It's a very utilitarian example of life on the edge, with all the comforts. At the console of an amazing, hand-built computer sits amazing Hopsfield. Mitch watches in awe from the darkness.\n\nINT. ATHERTON'S LAB-DAY\nThere is an experiment in progress. A large laser is building up an energy load. Atherton, Kent, Bodie, Carter, and Mitch monitor various pieces of equipment. Things hum and click and there is a sense that something big is going to happen. Atherton seems pleased, while Mitch seems troubled. Suddenly, a valve blows and a stream of liquid nitrogen hisses from a hose, spewing frost over everything. Everyone jumps for switches and they shut the experiment down.\n\nCARTER\n(checking the valve)\nIt's nothing. It's just mechanical.\n\nATHERTON\nGOOD. Don't bother changing it. I want you and Bodie to rebuild the whole unit; same output in half the size. Should hold up, right Mitch?\n\nMITCH\nSure, as long as we go with H.F.\n\nATHERTON\nWell, gentlemen, now what? Things are going okay so far, aren't they?\n\nKENT\nThey certainly are in my area, Jerry.\n\nATHERTON\n(warning)\nKENT\n\nKENT\n(unaware)\nYes?\n\nMITCH\nBoy, when I think of all the applications for this...!\n\nATHERTON\n(covering)\nWe've got enough theory to deal with without talking applications. You just worry about giving me that power breakthrough. how close are you?\n\nKENT\n(gloating)\nNot very, from what I hear.\n\nATHERTON\n(to Mitch)\nAren't you and Chris working together?\n\nMITCH\nYes...but...\n\nATHERTON\nWhere is Mr. Kinsley?\n\nKENT\n(anxious to get Chris in trouble)\nHe's outside.\n\nKent goes to the window and shouts down.\n\nKENT (CONT'D)\n(shouting)\nKinsley! Dr. Atherton wants you.\n\nEXT. LAB BUILDING-MEDIUM CLOSE ON CHRIS-WAIST UP\nHe's sitting on a chaise lounge with a stack of encyclopedias, sipping a beer.\n\nCHRIS\nComing.\n\nPULL OUT TO REVEAL that the chaise lounge has balloons tied to each corner. Chris dumps a volume from his lap and the chaise rises straight up in the air.\n\nANGEL ON ATHERTON AND CHRIS-FRAMED BY THE WINDOW\nChris hovers in mid-air.\n\nATHERTON\nWhat are you doing out there?\n\nCHRIS\nFloating, sir.  And thinking.\n\n\nATHERTON\n(fuming)\nI want to see you at my house at six o'clock. Sharp.\n\nCHRIS\nSounds fun. Should I bring anything?\n\nATHERTON\nHow about a proper attitude for a change?\n\nCHRIS\nI'll try and borrow one. Now, if you'll excuse me, there are millions of boys and girls everywhere waiting for me to bring them presents. Ho ho ho.\n\nHe hands Atherton a volume and floats from view.\n\nINT. LAB\nAtherton, Mitch and Kent stand at the window, watching Chris ascend.\n\nKENT\nHe's really pushing it, isn't he, Jerry?\n\nANGLE ON MITCH\nHe smiles as he watches his roommate and friend float off.\n\nEXT. ATHERTON'S HOUSE-EARLY EVENING\nThe restoration work is reaching completion and the house is looking pretty beautiful. \n\nA small crew of workmen paint and do other finishing work. Chris is sitting on the porch, watching. He is eating a very large puffs of popcorn from a bag. We SEE Atherton returning from his daily jog. He is decked out in an expensive designer jogging suit and has all the appropriate accessories. he also has all the silly habits of the trendy runner for cooling down and stretching.\n\nCHRIS\nYou wanted to see me, your joggingness?\n\nATHERTON\nMr. Kinsley. Right on time. What a surprise. Do you run?\n\nCHRIS\nOnly when chased.\n\nATHERTON\nWhat are you eating?\n\n\nCHRIS\nIt's one of mark's Ickagami's experiments. He's been irradiating corn with strontium. it's his hobby; big food.\n\nATHERTON\nThat's popcorn?\n\nCHRIS\nIt's big popcorn.\n\nATHERTON\n(over reacting)\nGet it away from me. I can't stand it. I hate popcorn. Leave it there.\nChris puts the bag down on the porch.\n\nCHRIS\nOkay. Have you ever considered switching to de-caffeinated coffee?\n\nAtherton leads Chris to the front door, where he removes his shoes and then stands and waits until Chris does the same. They proceed into the house.\n\nINT. ATHERTON'S HOUSE- CONTINUOUS\nThe interior is immaculate. A classic example of elegant good taste. Atherton is fastidiously protective of his things.\n\nATHERTON\nI want to start seeing a lot more of you in the lab.\n\nCHRIS\nYou want me to work nude?\n\nATHERTON\nVery funny, you're a major disappointment to me, Chris.\n\nCHRIS\nAnd you to me, Jerry.\n\nATHERTON\n(angry)\nWe had a deal!\n\nCHRIS\nAnd I advanced your project more than any three guys on campus.\n\nATHERTON\nThat was yesterday. What have you done for me today?\n\nCHRIS\nHey, aren't you getting a little obsessive about this? I took in the new kid. He's working his guts out for you.\n\nATHERTON\nYour arrogant, disrespectful behavior is distracting him. If you keep it up, you're going to pay for it.\n\nCHRIS\nHey, I'm out of here. Delenda Est Cartheo. P.E.I. July one.\n\nATHERTON\nYou still have to pass, dear boy, and considering the fact that my class is a requisite, it would seem that I would have some control over your destiny. From now on, you and Mr. Simon are going to spend every waking moment working on my power problem and you will solve it by my deadline.\n\nCHRIS\nOkay, Jerry, but I really think you should see an analyst.\n\nChris exits. Atherton watches him go.\n\nINT. ATHERTON'S LAB-NIGHT\nMitch is alone and trying to work on the new, smaller laser. He looks tired and upset. He tinkers around for a while, then goes back to his table and looks at his notes. Nothing seems to make sense anymore. Chris enters with a beaker in his hand.\n\nCHRIS\nHi. Do me a favor, taste this.\n\nMitch is confused.\n\nCHRIS (CONT'D)\nCome on, you won't hurt my feelings.\n\nMITCH\nI...\n\nChris rams the spoon in his mouth.\n\nCHRIS\nWell, too sweet?\n\nMitch makes a face.\n\nMITCH\nWhat is it?\n\nCHRIS\nBeats me. I just found it in one of the labs.\n\nMITCH\nAggghh!!\n\nCHRIS\nCome on. I'm just pulling your leg. How are you doing?\n\nMITCH\nI'm stuck. Dr. Atherton says we've got to miniaturize the power supply and you're not helping.\n\nCHRIS\nLighten up. It's only a laser.\n\nChris goes to the laser. Mitch is annoyed.\n\nCHRIS (CONT'D)\nInstead of trying to take that roomful of capacitors over there and putting new perspective. Charge this baby up. Everything you've got.\n\nMITCH\nWhat for?\n\nCHRIS\nYou'll see. Go\n\nMitch goes next door. Chris, meanwhile, measures a certain distant from the floor and mounts a mirror on the wall above his head. He then moves to the laser and repositions it to shoot at the mirror. Mitch returns and makes some adjustments to a control panel.\n\nMITCH\nAll set, I think.\n\nCHRIS\nDo it.\n\nMitch throws a switch. Immediately, a loud electrical hum fills the air. Chris goes over and opens the door to the hall and glances left.\n\nCHRIS'S POV\nA roomful of capacitors loading.\n\nEXT. THE CAMPUS-NIGHT\nThe lights twinkle from various buildings. WE HEAR the hum\nEXT. THE CAMPUS-NIGHT\nThe lights twinkle from various buildings. We hear the hum growing.\n\nMITCH (V.O.)\nWhat are you doing now?\n\nCHRIS (V.O.)\nMaking hamburgers.\n\nSuddenly, there are several loud snaps and all the lights on campus go off at once as the power overload blows the sub station fuses.\n\nMITCH (V.O.)\nOh, no!\n\nINT. THE LAB IN DARKNESS\n\nCHRIS\nRelax, it's just the fuses at the sub station. They'll have it back on in a second. More importantly, did we get a charge?\n\nSuddenly there is a loud \"crack\" and the laser sends out a beam across the room, bouncing off the mirror on the wall., out the door, where it hits another mirror and disappears from sight.\n\nMITCH\nWow!\n\nEXT. THE CAMPUS-CONTINUOUS\nThe beam has formed a web of light across the darkened campus. The effect is quite spectacular. People look in awe. Chris and Mitch exit the physics building.\n\nCHRIS\nFollow the yellow brick road.\n\nMITCH\nHave you ever considered the fact that you are completely wasting your life?\n\nCHRIS\nConstantly.\n\nThe lights on campus come back on as Chris and Mitch continue to follow the beam.\n\nINT. WAVE TANK BUILDING\nAn open window above the door lets the beam of light enter. Chris and Mitch enter.\n\nINT. HALLWAY-CONTINUOUS\nChris and Mitch walk down a stairway through an open door, following the beam.\n\nINT. WAVE TANK ROOM-CONTINUOUS\nThe place has been turned into an indoor Waikiki. The beam has been directed into a hood-shaped device that has split it into enough rays to cook a bunch of hot dogs and hamburgers on an improvised barbeque, managed by ICK, who is dressed for the beach and wearing a welding mask.\n\nPast him we can see that there about twenty girls and some guys present. Several of them are water-skiing on the mechanically produced waves inside the tank, towed by an elaborated pulleys system. Others are frolicking on the \"beach\" and cut out palms stand around, achieving the desired effect. Blankets have been laid out and girls sit on them eating hot dogs and talking. There are sun lamps set up in one area and some kids are smoothing sun tan oil and shagging a few rays. Rock music fills the room.\n\nICK \n(lifts his mask)\nAloha.\n\nANGLE ON THE DOORWAY\nA lot of the guys we've seen around the dorm have started to arrive. They enter hesitantly at Chris's urging.\n\nCHRIS\nCome on in, boys. Surf's up.\n\nAwestruck, shy but excited, they approach.\n\nCORNELL\n(a nerdy student)\nI have a geochemistry test tomorrow and I do not feel adequately prepared.\n\nCHRIS\nBut the main thing is you look good.\n\nCORNELL\nThanks.\n\nMILTON\nWhat if we end up having too much fun and end up failing?\n\nCHRIS\nAnd would that be the end of the world. Milton?\n\nMILTON\nYes, it would.\n\nCHRIS\nYeah, you're right. Maybe you should go back to the library.\n\nMILTON\nWell, maybe I could just look for a minute.\n\nCORNELL\n(noticing)\nAre those girls?\n\nCHRIS\nI haven't had them all tested yet, Cornell, but so far so good.\n\nMITCH\nWho are they?\n\nMILTON\nThey're not from here. I'd know.\n\nCHRIS\nNo, no they're not, they're from a nearby college though.\n\nMITCH\nWhich one?\n\nCHRIS\nThe Wanda Trossler School of beauty.\n\nMITCH\nThey're beauticians?\n\nCHRIS\nNot yet.\n\nCORNELL\nGee, I don't know...\n\nCHRIS\nThey'll teach you. Let's get serious here, lads. There are 670 guys at pacific tech and 136 girls.\n\nMILTON\nA ratio of 4.93 to 1\n\nCHRIS\nGood, Milton. Of the 136 girls, most of them can find guys a lot better than you.\n\nCORNELL\nOh, easily.\n\nCHRIS\nThese girls are not used to geniuses. You might impress them.\n\nCORNELL\nI don't see how.\n\nCHRIS\nLet me put this another way. Given the type of people you are and the environment you're in, you guys have to admit the strong probability that this may be the only chance you'll ever get in your entire lives to have sex.\n\nThere is a pause while everyone considers the hypothesis.\n\nCHRIS (CONT'D)\nThink about it.\n\nHe turns and heads into the party. After a beat, everyone except Mitch follows Chris's lead.\n\nANGLES ON VARIOUS ACTIVITIES- A LITTLE LATER\nWater-skiing, dancing, a volleyball game. Most of the guys are making an effort to socialize. Mitch watches quietly.\n\nANGLE ON MILTON TALKING TO A GIRL OVER BY THE SUN LAMPS.\n\nVIVIAN\nSo, what do you guys do? Just be smart all the time?\n\nMILTON\nWell...\n\nVIVIAN\nWhat's your major?\n\nMILTON\nAstrophysics.\n\nVIVIAN\nIs that like sports medicine?\n\nMILTON\nSpace.\n\n\nVIVIAN\n(impressed)\nOh! Let me ask you something about that. If I was on the moon, Could I like tease hair much higher?\n\nMILTON\nTheoretically.\n\nVIVIAN\nThis is fascinating.\n\nANGLE ON another guy named Fenton and a girl. They're necking.\n\nCONNIE\nMy friend Evelyn, tells me that brilliant men are the best lovers.\n\nFENTON\nI'd say that's true.\n\nCONNIE\nUp to now, what's been your ultimate sexual experience?\n\nFENTON\nI once fell off a ladder and landed on my sister, Bernice.\n\nANGLE ON CONNELL, and a girl in the tank. they both bob up out of the water. Cornell still has his glasses on. He takes them off and can't see.\n\nLOUISA\nWhy do you wear those glasses?\n\nCORNELL\nSo I can see.\n\nLOUISA\nBut you look very sexy without them.\n\nReflexively he breaks his glasses in his hands.\n\nANGLE ON MILTON AND VIVIAN. He rubbing suntan oil on her back\n\nMILTON\nI really should be studying.\n\nVIVIAN\nMe too. I have a bleaching final tomorrow.\n\nMILTON\n(sneezing)\nAchew.\n\nVIVIAN\nBless you.\n\nMILTON\nI'm allergic to suntan oil.\n\nVIVIAN\nMaybe you should stop.\n\nMILTON\n(aroused)\nI don't think I can\n\nANGLE ON CORNELL AND LOUISA. They are sitting on the \"beach\" toweling off.\n\nLOUISA\n(very sexy)\nYou know, I read in the Enquirer that woman paid twenty thousand dollars for the sperm of a genius.\n\nCORNELL\nReally?\n\nLOUISA\n(putting her arms around him)\nI've GOT TWENTY BUCKS?\n\nCORNELL\nDo you have a cup?\n\nANGLE ON MITCH\nThe party is in full swing and most of the guys have become very comfortable. Some are making out. Mitch now seems like the only one left out. he sees a pretty GIRL just coming out of the water. She adjusts her top. Mitch wanders over to her.\n\nMITCH\n(with great effort)\nHi.\n\nTAMMY\nHi.\n\nMITCH \nI was watching you...swim.\n\nTAMMY\nYes?\n\nMITCH \nI was thinking of maybe going for a swim myself.\n\nTAMMY\nYeah? Is this the kiddy pool?\n\nShe exits, leaving Mitch devastated. He goes and sits in a corner. Meanwhile, Chris is looking around proudly. It's obvious he didn't see what just happen to Mitch. He smiles at the fun everyone is having. A girl passes him eating a hamburger.\n\nCHRIS\nDon't eat that!\n\nKIMBERLY\nHuh?\n\n\nCHRIS\nDon't you know eating that stuff can give you very large breasts?\n(mock despair)\nOh. My god! I see I'm too late.\n\nShe laughs. He puts his arms around her and they walk off. As Chris and Kimberly EXIT, we catch a glimpse of a face in a window. We push in to see Kent, spying.\n\nINT. CLASSROOM-SAME TIME (BUT APPEARS TO BE DAY)\n\nOPEN TIGHT on Atherton's face. He looks odd, as there are Kleenex tissues sticking out from his shirt collar. A hand comes into frame, holding a pancake makeup puff, and starts applying it to his face.\n\nATHERTON\nChrist, Don. I'm doing the best I can.  You act like I don't want my own invention to work. There are only so many hours in a day.\n\nCAMERA PULLS BACK\n\nCARMICHAEL\nI agree. And what's more important, massaging your ego on television explaining the digestive system of a rabbit to the great unwashed or \"project crossbow\"\n\nMAKEUPMAN\nOff-hand, I'd say television.\n\nATHERTON\n(angrily to make up man)\nJust get rid of the crows' feet!\n(to Carmichael carefully)\nThere's nothing more important than \" crossbow,\" but when went from blue sky to black you turned into Bigfoot.\n\nThe STAGE MANAGER approaches.\n\nSTAGE MANAGER\nReady to go, Dr. Atherton.\n\nHe exits.\n\nATHERTON\nPushing me doesn't help. You tell them that.\n\nHe walks away. There is definitely no love between them.\n\nATHERTON (CONT'D)\n(under his breath)\nSon of a bitch.\n\nCARMICHAEL\n(under his breath)\nAsshole.\n\nANGLE ON ATHERTON as he walks over to the cue card man and checks through the cards. KENT enters in a rush.\n\nKENT\nI have something to...\n\nATHERTON\n(cutting him off)\nDid you pick up my dry cleaning?\n\nKENT\nYes I did... there's something you should know.\n\nATHERTON\nThe gravy stain?\n\nKENT\nNo, that came out.\n(very pleased)\nChris and Mitch aren't working. They're at a party.\n\nAtherton begins to seethe.\n\nATHERTON\nI want to show me where, right after I'm finished here.\n\nKENT\n(all smiles)\nMy pleasure.\n\nSTAGE MANAGER\nIn five...four...\n\nKent forgets to move. Atherton shoves him off. We HEAR an off-stage CRASH.\n\nSTAGE MANAGER (CONT'D)\n...three...two...and...\n\nWe PUSH in on nearby monitor. the show's logo comes on, along with its theme MUSIC.\n\nANNOUNCER (V.O.)\nWELCOME TO \"SCIENCE,\" WITH YOUR HOST, Dr. JEROME ATHERTON. FUNDED BY...\n\nA NEW CARD SHOWS ON THE MONITOR.\n\nANNOUNCER (V.O.)\n... A grant from Pacific Electric Instruments. PEI. And now, Dr. Atherton.\n\nAtherton appears on the monitor.\n\nANGLE ON ATHERTON IN THE STUDIO\nHe smiles broadly and reads from the cue cards.\n\nATHERTON\nGood evening. Tonight we're going to look at something most of us take for granted... the colon. What's it look like?\n\nKENT WANDERS BY IN THE BACKGROUND.\n\nINT. WAVE TANK ROOM-LATER THAT NIGHT\nTHE PARTY IS STILL GOING STRONG.\nANGLE ON JORDAN\nShe tosses a volleyball up into the air in a one-woman game of catch. Mitch approaches forlornly.\n\nJORDAN\nWanna play?\n\nMITCH\nI'm not very...\n\nHE GETS SMACKED IN THE HEAD BY THE BALL.\n\nMITCH (CONT'D)\nSure, all right.\n\nThrough the following, Mitch and Jordan volley the ball between them.\n\nJORDAN\nSome party, huh?\n\nMITCH\nI guess.\n(hesitant)\nHow come you're not...\n\nJORDAN\nNecking?\n\nMITCH\nwell...\n\nJORDAN\nI'm not gay.\n\nMITCH\n(embarrassed)\nI didn't... I wouldn't even...\n\nJORDAN\nLook, I'm seventeen. I'm brilliant, and I'm hyper kinetic. Guy are a little afraid of me, you know. It'll pass...I hope.\n\nANGLE ON MITCH\n\nMITCH\n(softly)\nI think you're very nice.\n\nMitch gets smashed on the head with the ball, sending his glasses flying.\n\nSuddenly, Atherton burst into the room, followed closely by Kent.\n\nATHERTON\n(seeing Mitch)\nSimon!\n\nHe passes the tape deck and snaps it OFF. Everything comes to a stop as Atherton heads for Mitch, all eyes trained on the pending drama.\n\nATHERTON\nYou were supposed to be in the lab tonight.\n\nKENT\n(chiming in)\nWeren't you!\n\nMITCH\nI was and...\n\nATHERTON\nYou are at Pacific Tech to work, not to behave like a philistine.\n\nKENT\nThat's right!\n\nMITCH\nI was working, I...\n\nATHERTON\nWhere's Kinsley. I imagine this was his idea.\n\nKENT\nNo doubt!\n\nATHERTON\n(annoyed)\nKent!\n\nKENT\n(stiffening)\nyes?\n\nATHERTON\n(to Mitch, very angry)\nI took a big chance recommending a fifteen-year-old. I guess I made a mistake. I hope you're proud of yourself.\n\nKent is in seventh heaven as Atherton turns and heads for the door. As they exiting, they pass Cornell and his date.\n\nCORNELL\nDr. Atherton?\n\nATHERTON\nWhat!\n\nCORNELL\nAre you wearing makeup?\n\nAtherton can only stare in his rage.\n\nLOUISA\nIs it too try and hide those crows' feet?\n\nHe growls and exits.\n\nANGLE ON MITCH\nHe is truly at a loss in the face of this cruelty. Everyone is staring at him. He runs out the door.\n\nANGLE ON JORDAN\nShe watches Mitch go, feeling very badly for him\n\nINT. ATHERTON'S LAB-THE NEXT NIGHT\nMitch, tired, looking like a kid who's been working for hours, is staring at a formula on the blackboard. Frustrated, he throws his screwdriver against it in anger and runs into the adjacent room and begins disconnecting the capacitor bank. \n\nINT. LAB HALLWAY-EARLY MORNING\nKent, Bodie and Carter cross toward the lab. Just then, Mitch comes out. He looks exhausted and very upset. As he passes Kent, he turns away from his stare.\n\nKENT\n(mock concern)\nGee, he looks depressed.\n\nThe other guys yuk it up. They turn and watch Mitch go into Atherton's office down the hall. They follow in time to HEAR:\n\nMITCH (O.S.)\nI'd like to make a collect call to Mrs. Bill Simon.\n\nKent's eyes light up with an idea.\n\nINT. ATHERTON'S OFFICE\nMitch is on the phone. He's very upset.\n\nMITCH\nI know, but I don't like it here anymore. I want to live at home with you...\n(reluctant)\nYeah, and dad. I want to go back to high school. I-dad did what?\nRented out my room? ...Well, why can't Mr. Echevarria and I share it?... Please, ma, I want to come home.\n\nINT. KENT'S LAB-TIGHT ON A MINI TAPE RECORDER\nIts reels are spinning. It's being held up to a telephone receiver.\n\nMITCH (V.O./FILTER)\n(crying)\nPlease let me come home. I don't want to stay here.\n\nWIDEN to reveal Kent holding the recorder as cater and Bodie watch. The workbench area in Kent's lab is covered with a drop cloth. Kent chuckles as MITCH pleads with his mother.\n\nINT. DORM HALL-DINING ROOM-NEXT MORNING\nThe dorm population is eating their breakfast. Kent and his unholy two are smugly downing their \"shredded wheat\" Mitch is alone off in the corner. It's obvious he hasn't slept.\n\nChris enters and crosses to Kent. A WAITRESS, middle-aged, is serving coffee.\n\nCHRIS\nKent...let's never fight like that again.\n\nKENT\nWhat?\n\nCHRIS\nWe've been lovers too long to have a silly argument come between us.\n\nThe waitress stares disgustedly at Kent.\n\nKENT\nChris...\n\nCHRIS\nPlease. Don't speak. You were right. Tonight I'll wear the cowboy suit.\n\nCHRIS EXITS\n\n\nKENT\n(sputtering)\nYou...\n\nWAITRESS\nDo your parents know about this?\n\nKENT\nOf course not!\n\nShe nods and exits. Kent calls after her.\n\nKENT (CONT'D)\nNobody knows. I mean, there's nothing to know.\n\nANOTHER ANGLE\nChris walks over to Mitch.\n\nCHRIS\nWhere were you all last night?\n\nMITCH\nThe lab. Where you were supposed to be. \n\nCHRIS\nJordan told me about Atherton coming down on you...what exactly did...\n\nMitch abruptly turns his back to Chris and continues eating. Chris sees the conversation is over.\n\nCHRIS (CONT'D)\n(referring to the sentence he never finished)\n...Let me hold that thought and get back to ya.\n\nANOTHER ANGLE\nKen, Bodie and Carter. The gentle strains of classical music fill the room.\n\nKENT\nSomething soothing to eat by.\n\nThe tape is abruptly interrupted by the RECORDING Kent made of Mitch on the phone to his mother.\n\nANGLE ON MITCH\nHe can't believe his ears. His expression runs from surprise to embarrassment.\n\n\nANOTHER ANGLE\nEveryone stops eating and listens to Mitch begging his mother to come home. They share his embarrassment and lower their heads. Even Kent's friends are uncomfortable. Kent, on the other hand, is laughing it up, having a great time.\n\nANGLE ON MITCH\nHe's in a state of shock.\n\nANGLE ON KENT\n\nKENT\n(he can't wait )\nHere comes the crying!\n\nHe loves it.\n\nANGLE ON MITCH\nHe runs out of the dinning room. Kent loves Mitch reaction. It makes him laugh harder.\n\nANGLE ON CHRIS\n\nCHRIS\n(to himself)\nToo low.\n\nINT. MITCH'S ROOM-A FEW MINUTES LATER\nMitch is trying to pack, but it's difficult because the place is in such disarray. Chris enters. He watches and tries to think of what to say.\n\nCHRIS\nOkay, if you want to leave, go ahead. But you'll miss the fun.\n\nMITCH\n(sour)\nWhat fun?\n\nCHRIS\nIck invented a new virus and we're gonna release it in Kent's room.\n\n\nMitch turns on Chris with surprising hostility.\n\nMITCH\nThat's sick! That's a sick thing to do!\n\nCHRIS\nHey, I was just kidding, I...\n\nMITCH\nYou're always just kidding. There's something wrong with you.\n\nCHRIS\nJust a second...\n\nMITCH\nThe other night I needed your help and all you wanted to do was party.\n\nCHRIS\nI tried to help you. I tried to help you relax.\n\nMITCH\nBeing snubbed by beauticians isn't my idea of relaxing.\n\nCHRIS\nStudent beauticians.\n\nMITCH\n(Blows up)\nI thought this place was going to be different, but it's just the same. I'm either used or made fun of. In high school they pushed me in a mailbox, did I tell you that?\n\nCHRIS\nThey called me Chris the whiss'...\n\nMITCH\nReally? What's a whiss?\n\nCHRIS\nI think they meant wuss, but it didn't rhyme...when I was three years old, I balanced my father's checkbook so they sent me to school and fired their accountant. My father was so intimidated, he stopped speaking to me. My teacher disliked me because I was smarter than they were, and my classmates hated me because I bell the bell curve. Sound familiar? And tell me why my...why did my mother dress me in white shirts, hush puppies and a briefcase, guaranteeing that a girl would never talk to me?\n\nMitch looks down at his own white shirt and hush puppies.\n\nMITCH\nYOU?\n\nCHRIS\n(Dramatic)\nAnd then one night, in this room, I was sitting right where you are sitting now. I had a vision. I saw him.\n\nMITCH\ngod\n\nCHRIS\nHopsfield.\n\nMITCH\nHopsfield? Oh! The guy in the closet.\n\nCHRIS\nYeah. Laslo Hopsfield. I followed him. Through the closet; down into the steam tunnels. And down there I saw the most disgusting thing I\u0092ve ever seen.\n\nMITCH\n(Frighten)\nWhat?\n\nCHRIS\nHopsfield in his pajamas. \n\nMITCH LAUGHS.\n\nCHRIS\n(Lighter, but sincere)\nAnd I talk to the guy . Turned out that in the Seventies he was the number one stud around here. Smarter than you and me put together. So brilliant, so sharp, so advanced, so long.\n\nMITCH\nWhat do you mean?\n\nCHRIS\nHe graduated. Went to work for some chemical company. One day someone told him he was making stuff that was killing people. I think it was his mother. He freaked. You see, he was totally unprepared for the real world. He had no philosophy. He thought science was the answer for everything.\n\nMitch\nAm I gonna wind up in a steam tunnel?\n\nCHRIS\nYes, you are, Metaphorically speaking. Unless you see that the same thing that has made your life miserable can make it great; your brain. When you're smart, people need you, and you can learn how to work that for fun and profit.\n\nMITCH\nYou had a arrangement going with Atherton, don't you? That's why you don't have to study.\n\nCHRIS\nHey, I don't carry a briefcase.\n(pause) \nYou're a nice kid. If you leave I'll miss you.\n\nMITCH\n(thinking about it)\nIf I stay, what should I do, I mean...\n\nCHRIS\nWell, the first thing you have to do is get even with Kent. It's a moral imperative.\n\nMITCH\n(smiles)\nYeah.\n\nEXT. CAMPUS-NIGHT\nKent's Citroen pulls up. Kent and Carter get out and walk by Jordan, who is sitting nearby.\n\nKENT\nAnd at Northern Electronics you get the stock options, but not the free housing, It's what makes PEI so sweet. You get everything.\n\nCARTER\nYeah, and Kinsley's got that locked.\n\nKENT\n(knowingly)\nMaybe he does, and maybe he doesn't.\nThey walk away.\n\nAfter a beat, CHRIS, MITCH and ICK jump out from behind another car. Mitch carries a TOOL BOX.\n\nJORDAN\nOver here!\n\nThe others rush over to her. Chris trains a light on the license plate. It reads, \"KENT.\"\n\nCHRIS\nHe puts his name on his car. He does the same thing with his underwear.\n\nMitch flops down the tool box.\n\n5R5DISSOLVE TO:\n\nMONTAGE\nChris, Mitch, Jordan and Ick working on Kent's car. They are undoing bolts, talking out wires, removing fenders, etc. The last DISSOLVE and we see the car is gone. And no sign of our foursome.\n\nEXT. DORM HALL-NIGHT\nChris quietly goes up the stairs inside the dorm carrying a steering wheel. Ick and Mitch have an engine on a flatbed cart. Jordan enters carrying heavy chains and a drill.\n\nEXT. KENT'S ROOM-EARLY MORNING\nFilthy with crankcase oil, Chris, Mitch, Ick and Jordan exit and scamper down the hall. All are very pleased with themselves.\n\n\nEXT. KENT'S ROOM-LATER THAT MORNING\nKent is coming down the hall. he opens his door and walks inside.\n\n\nINT. KENT\"S ROOM\nCLOSEUP ON KENT. His jaw drops open.\n\nANOTHER ANGLE\nChris and Mitch enter.\n\nCHRIS\nHey, Kent. That's your car.\n\nMITCH\nYou're not supposed to park on campus.\n\nKENT\nThis isn't funny. You went too far this time, Kinsley.\n\nCHRIS\nI had help.\n\nKENT\n(surprised, to Mitch)\nYou?\n(a beat)\nI'm going to get you guys. Dr. Atherton's gonna hear about this.\n\nHe storms out of his room.\n\nCHRIS\n(calls to Kent)\nHey, Kent, you owe us ten dollars for the gas.\n(to Mitch)\nHe'll never pay us.\n\nEXT. ATHERTON'S HOUSE-DUSK\nThe restoration has been completed and the house looks beautiful. Chris comes up the walk, goes to the door and rings the bell. A very pretty girl named SUSAN answers the door.\n\nINT. ATHERTON'S HOUSE-CONTINUOUS\n\nChris enters.\n\nCHRIS\nWow! Hello.\n\nSUSAN\nHi.\n\nCHRIS\nJerry asked me to drop by. What did he ask you to do?\n\n\nSUSAN\nWhat?\n\nCHRIS\nWhich word didn't you understand?\n\n\nSUSAN\nAre you here for the meeting?\n\nCHRIS\nWhat meeting?\n\n\nSUSAN\nI don't know.\n\nCHRIS\nOkay.\n\nSUSAN\nI'm just waiting.\n\nCHRIS\nRight.\n\nThe study doors open and Atherton, Carmichael and Decker step out.\n\nDECKER\n(finishing their conversation)\nAnd finally, it comes down to, if you can't do it, we'll get somebody else. I have a timetable, doctor.\n\nCARMICHAEL\nWe're very close, Dave, don't worry, everything's going to be fine.\n\nDECKER\n(cold as ice)\nDon, try and remember you work for me.\n(to Atherton)\nI think I've made my point, haven't I?\n\nATHERTON\n(equally as cold)\nCrystal clear, Mr. Decker.\n\nDECKER\nGood.\n\nCHRIS\nAnything I should know about?\n\nATHERTON\nShut up Kinsley. I'll be with you in a moment.\n\nDECKER\nGoodbye, Jerry, and good luck. Susan?\n\nThey begin to exit. Chris takes Susan's hand.\n\nCHRIS\nI guess this is goodbye. I'm sorry I didn't get a chance to know you. At all.\n(to the boys in admiration)\nHave you ever seen breasts like theses before?\n\nDECKER\nShe happens to be my daughter.\n\nCHRIS\nOh, then I guess you have.\n\nCARMICHAEL\n(to Atherton)\nI'll be reporting to him every day.\n\nDECKER\nComing, Don?\n\nCARMICHAEL\nYes, Sir.\n\nThey exit.\n\nATHERTON\nWhat do you think you're doing?\n\nCHRIS\nYou said come over.\n\nATHERTON\nTake off those shoes.\n\nChris removes his shoes to reveal even dirtier socks.\n\nATHERTON (CONT'D)\nStay off the rugs.\n\nINT. STUDY-CONTINOUS\n\nCHRIS\nWhat's up, Doc.\n\nATHERTON\nI'm withdrawing your recommendation to PEI.\n\nCHRIS\nWhat?\n\nATHERTON\nI'm giving Kent the job.\n\n\nCHRIS\nDid you suddenly find humor?\n\nATHERTON\nYou haven't solved my power problem.\n\nCHRIS\nI'm trying.\n\nATHERTON\nNo, you're not. So, I'm going to fail you, so you won't graduate, so you can't take the job. Q.E.D.\n\nCHRIS\nI'll pass your exam.\n\nAtherton just smiles a \"so what\" smile.\n\nCHRIS (CONT'D)\nWe had a deal!\n\nATHERTON\nDid we? That doesn't sound very ethical.\n\nCHRIS\nYou can't do this. I'll go to Dr. Meredith.\n\nATHERTON\n(enjoying this)\nGo ahead. What are you going to tell him. Don't forget, like most scientists, he is an honorable, moral man who thinks everyone else is too. I'll just deny anything you say.\n\nCHRIS\nYou dick!\n\nATHERTON\nCount on it.\n\nEXT. DORM ROOF-NIGHT\nChris sits, lost in thought, outside the window of his room, Mitch appears at the window, sees Chris and climbs out to join him.\n\nMITCH\nWhat are you doing?\n\nCHRIS\nSelf-realization. I was thinking of jumping, but it's only twelve feet.\n\nMITCH\nSomething wrong?\n\nCHRIS\nNo. Atherton is going to flunk me out of school.\n\nMITCH\nBut you had a deal.\n\nCHRIS\nYeah, and he says I didn't deliver. You sleep with pits, you wake up smelly. I think Aristotle said that. It was him or Eva Gabor. At least Hopsfield still has his integrity.\n\nMITCH\nExcuse me?\n\nCHRIS\nI thought I was so smart. I didn't want to be like the other dumb geniuses like Hopsfield. I though I could use Them., instead of Them using me. But, Guess what?\n\nMITCH\nI have to agree. It does appear that you've been the victim of your own erroneous logic.\n\nCHRIS\nThank you.\n\nMITCH\nHowever, this doesn't mean that you can't get yourself out.\n\nCHRIS\nHow?\n\nMITCH\nHard work?\n\nCHRIS\nBut that's the old way.\n\nGRINDING MONTAGE\nA series of shots showing Chris hard at work, underscored by an original song.\n\nINT. LASER LAB\nMitch and Chris dismantle part of the laser.\n\nINT. DINING HALL\nMitch, Jordan and Ick are listening as Chris shows them diagrams and formulas for a laser supercharger while they try to eat.\n\nINT. BIOCHEMISTRY LAB\nChris and Ick search for a new gas combination for the laser supercharger. \n\nINT. ATHERTON'S LAB\nMitch and Chris work hard on a second laser. Kent is both upset and suspicious of Chris' new interest in work.\n\nINT. ATHERTON'S CLASSROOM\nChris enters carrying books and a note pad. Kent sees this and is shocked. Atherton gives Chris a \"you haven't got a chance\" grin.\n\nINT. CHRIS AND MITCH'S ROOM-NIGHT\nThey both study for exams; on the wall is a chart of exam week showing Mitch's exam schedule, a big red square around Chris' exam with Atherton and, in every free hour is written \" Laser\".\n\nINT. DORM LIBRARY\nMany students, including our gang, study for exams. Suddenly, Milton can't take the pressure any longer and momentarily goes out of his mind and runs from the room.\n\nINT. ATHERTON'S LAB\nA tired looking Chris and Mitch attach a second laser to the original but nothing improves. They check their notes and diagrams. Kent, Bodie and carter chuckle in the corner.\n\nINT. AN EXAM ROOM\nMitch is taking an exam with a bunch of people he doesn't recognize from the Professor who everyone tape recorded. One of the students appears to be near panic as he deals with a pile of mangled tape.\n\nINT. JORDAN'S ROOM-VERY LATE NIGHT\nChris and Jordan use a blackboard diagram to discuss the engineering difficulties of Chris' laser supercharger assembly.\n\nINT. DORM HALL\nChris runs down the hall and enters his room. Mitch is sprawled out asleep under a math text. Chris feels bad about it but wakes him up.\n\nINT. ATHERTON'S LAB\nA wasted Chris and Mitch build the new assembly that will allow a second laser to shoot at the gas jets of the principal laser.\n\n\nINT. DORM LIBRARY-NIGHT\nChris is studying hard. Mitch is asleep, his head on the table.\n\nMITCH\n(in his sleep)\nPlease, Vito, not in the mailbox again.\n\nCHRIS\nMitch!\n\nMitch wakes up.\n\nMITCH\nOh... I was just reliving some high school highlights.\n\nCHRIS\nLook, you don't have to stay up with me. It's not like we're driving. Get some sleep. You're a growing boy. I hope.\n\nHopsfield enters carrying two large boxes of what appear to be file cards. Mitch is stunned. They all stare for a beat.\n\nCHRIS\nHi, Laslo.\n\nHOPSFIELD\nI thought you might want some help so I dug into the computer and got every question Artherton's ever asked on every final he ever given.\n\nCHRIS\nGee, I didn't get you anything. Is that them?\n\n\nHOPSFIELD\nNo, these are entries for McDonald's Sweepstakes. No purchase necessary. Enter as often as you want. So, I am.\n\nCHRIS\nReally?\n\n\nHOPSFIELD\nThis box makes it one million, six hundred thousand. I should win thirty two point six percent of the prizes, including the car.\n\n\nCHRIS\nKind of takes the fun out of it, doesn't it?\n\nHOPSFIELD\nI suppose so. But they set up the rules, and lately, I have come to realize that I have certain materialistic needs.\n\nCHRIS\nSo where are the questions?\n\nHOPSFIELD\n(insulted)\nI memorized them.\n\nChris and Mitch look at each other, impressed and a little frightened.\n\nMITCH\nI have to go to sleep now.\n\n\nHOPSFIELD\nWant my pajamas?\n\nMITCH\nUhhh...thanks, no.\n\n\nHOPSFIELD\nSmart kid. He's going to grow five inches in the next year.\n\nCHRIS\nHow do you...never mind.\n\nINT. MITCH'S ROOM\nHe opens the door and enters. It's dark.\n\nFEMALE VOICE\nMitch?\n\nMITCH\n(surprised)\nJordan?\n\nHe turns on the light. Much to his surprise and ours, seated on his bed is Sherry Nugil, the girl Chris met at PEI - the genius groupie. She's dressed for the occasion.\n\n\nSHERRY\nMitch Simon?\n\nMITCH\nWho?\n\nSHERRY\nI'm Sherry Nugil. And I've been waiting three years for this.\n\nMITCH\nFor what?\n\nSHERRY\nFor you to be old enough.\n\nMITCH\nFor what?\n\nSHERRY\nFor this.\n\nShe kisses him.\n\nSHERRY (CONT'D)\nAre you ready?\n\nMITCH\nFor what?\n\nSHERRY\nWhy do you keep saying, 'For what?'\n\nMITCH\n'Cause so far it's working great.\n\nINT. JORDAN ROOM-NIGHT\nJordan is using a big machine to sand her floors. There's a knock on the door.\n\nJORDAN\n(shouts)\nCome in.\n\nMitch enters, He appears dazed and disheveled.\n\nJORDAN\nOh, hi, Mitch. I'm just sanding the floor.\n\nMITCH\nCould you turn that off a second?\n\nShe does. She starts moving the furniture back.\n\nJORDAN\nWhat's wrong? Why are you sweating?\n\nMITCH\nI...I just...I came back from helping Chris and there was this woman in my room.\n\nJordan stops, It's the first time we've seen her doing nothing.\n\nJORDAN\nA woman?\n\nMITCH\n(with emphasis)\nA woman. I mean she was...blessed\n\nJORDAN\nOh?\n\nMITCH\nAnd she wanted to...How can I say this so as not to offend you?\n\nJORDAN\nJump you?\n\nMITCH\nYeah. I hope you're not offended.\n\nJORDAN\nSo what happened?\n\nMITCH\n(excited)\nShe kissed me. Then she took off her clothes. Then I took off my clothes-she had to help me. I kept blacking out - then... it was unbelievable.\n\nJORDAN\nYou made it with her?\n\nMITCH\nNo. That's what was unbelievable.\n\nJORDAN\nSure.\n\nMITCH\nIt's true. I stopped her and told her I didn't want to.\n\nJORDAN\nAfraid?\n\nMITCH\nNo...I mean I really did want to ... but not with her.\n\nHe looks at her hopefully. She smiles.\n\nINT. ATHERTON'S LAB-DAY\nChris puts the finishing touches on the second laser assembly. He seems pretty pleased with himself. Kent, Bodie and Carter watch conspiratorially. Carter looks at his watch and starts for the door.\n\n\nCARTER\nLet's go girls\n\nBODIE\nWhat's that supposed to mean?\n\nCARTER\nIt's just a f..f..figure of speech, Bodie. You guys coming to the exam or not?\n\nCHRIS\n(finishing his work)\nI guess we should, seeing as he's gone to all the bother of having one and everything.\n\nThey all begin to exit, but then Kent holds up.\n\nKENT\nYou guys go ahead. I have to go to the bathroom.\n\nCHRIS\n(exiting)\nOkay, Kent, but I don't think that's going to help your confidence, do you?\n\nThe others exit as Kent goes back to Chris' laser, opens it up and starts to fiddle with the works.\n\nKENT\n(to himself)\nSo, Mr. Funny Man, let's see how funny you think this is.\n\n\nINT. ATHERTON'S CLASSROOM-DAY\nStudents wait to begin taking their final exams. Chris, Bodie and Carter enter and take their seats. Atherton is passing out the booklets.\n\nATHERTON\nYou will have exactly three hours. And remember, we believe in the honor system here, people.\n\nANGLE ON KENT\nHe enters and heads for his seat beside Chris.\n\nKENT\nGood luck, buddy boy.\n\nCHRIS\nIs it okay if I name my first child after you? Dipshit Kinsley has a nice ring to it.\n\n5R5DISSOLVE TO:\n\nINT. ATHERTON'S CLASSROOM-LATER\nThe students are busy taking the test.\n\nANGLE ON CHRIS\nHe seems to be breezing through it.\n\nANGLE ON KENT\nHe's taking the test. He looks up and is distressed at Chris apparent lack of trouble. Chris looks over and throws Kent a big kiss. Kent turns away immediately.\n\nINT. ATHERTON'S OFFICE\nAtherton is going over some plans. Carmichael ENTERS. Atherton rises.\n\nATHERTON\n(reprimanding)\nThis is my class hour!\n\nCARMICHAEL\n(loud whisper)\nWe're past the deadline. Don't you understand, Decker's dangerous. We need those plans.\n\nATHERTON\n(snaps back)\nIt's not ready yet. But it will be. I've got Kinsley cooking now. He'll do it. Believe me, I know how to push that kid's buttons.\n(rolling up the plans)\nHere are my drawings for the optics in the sighting system.\n\nCARMICHAEL\n(cutting him off)\nDecker wants the laser by the end of the week.\n\nATHERTON\n(close to losing it)\nI'm doing all I can, damnit!\n\nAtherton storms out.\n\nINT. CLASSROOM\nAtherton enters like a dark cloud. He sits at his desk.\n\nANGLE ON CHRIS\nHe finishes his last question. He gets out of his seat.\n\n\nANGLE ON ATHERTON\nSitting at his desk. Chris places his test on the desk. Atherton looks up.\n\nANGLE ON CHRIS AND ATHERTON\nChris has a big grin on his face. He takes a piece of paper and writes on it and then slides it in front of Atherton.\n\nINSERT\nThe piece of paper. It says, \"I aced this.\"\n\nANGLE ON ATHERTON\nHe writes a message and slides it to Chris.\n\nINSERT\nA piece of paper which reads, \"Ace the laser.\"\n\nANGLE ON CHRIS\nChris places an apple on Atherton's desk. He exits. Atherton tosses the apple in the wastebasket. The APPLE EXPLODES.\n\nEXT. CAMPUS-DAY\nChris is heading for the lab. The place has that look of exam period desertion.\n\nCHRIS\n(muttering to himself)\nOkie-dokie, doc, a house doesn't have to fall on ole Chris Kinsley.\n\nINT. ANTHERTON'S LAB-DAY\nChris enters and prepares to test the new equipment. He aligns the secondary laser and let it charge up. He makes some final checks and then throws a switch. The laser fires for an instant but then seems to go crazy. The new laser overheats and the main chamber sparks and smokes. Chris tries to shut it down but to now avail. he tears the cover off in hopes of pulling the wiring, but he's too late. We see everything melting away as the machine eats itself. We also see a message left for Chris just before it too melts. It reads: \"1 laser=1car.\" Chris is on the verge of a complete mental collapse as he watches his work go up in smoke.\n\nCHRIS\n(in anguish)\nNo!!!!\n\nThere is nothing but the echo of his voice in response. The main laser stands like a huge, frozen bird in the empty room. In anger and frustration he swears at the machine.\n\nCHRIS (CONT'D)\nYou bastard. This is your  fault.\n\nHe kicks the wastepaper basket in hopes of getting rid of some of this anger; but, instead, all he gets is the basket bouncing back and hitting him in the shin.\n\nCHRIS (CONT'D)\nShit! I deserve that. It all comes back on you in the end.\n\nHe suddenly stands up straight as though he were having a stroke.\n\nCHRIS (CONT'D)\nHoly shit!\n\nInspiration takes hold and Chris begins running around like a madman, gathering up parts to the laser.\n\nCHRIS (CONT'D)\n(almost singing, he's so happy)\nOf course, it's so simple. Echoes, bouncing back at me and you.\n\nEXT. DORM-A LITTLE LATER\nChris runs up the stairs three at a time.\n\nINT. CHRIS AND MITCH'S ROOM\nHe bursts in.\n\nCHRIS\nMitch?!\n\nThe room is empty.\n\nThe closet door opens and Hopsfield steps out, carrying another box of cards.\n\nCHRIS (CONT'D)\nLaslo! Buddy! Have you seen Mitch?\n\nHOPSFIELD\nNo. How did you do?\n\nCHRIS\n(elated)\nI failed!\n\nHOPSFIELD\nYou shouldn't have.\n\nCHRIS\nThat's true. But never mind that now. It came to me. The power problem. I solved it. Echoes! It's so simple, four little mirrors. It bounces back and supercharges the gas itself. I've got to find Mitch to help me build it but it should increase the power ten-fold at least. If you see him, tell him to meet me at the lab. Bye.\n\nChris exits, leaving Hopsfield lost in thought.\n\nEXT. STUDENT UNION-MOMENTS LATER\nA hand-painted sign hangs over the door that says: \"Exam Week Decompression Here.\" Chris runs in the door.\n\nINT. DECOMPRESSION ROOM-CONTINUOUS\nThe room is full of students who are blowing off steam from studying for and taking exams. They are engaged in all sorts of silly, mindless activities, ranging from tiddly-winks and video games to watching cartoons. There are supplies of \"brain food\" and health drinks around. Mitch, Ick and Jordan are in the corner. Chris runs up to them.\n\nJORDAN\nOh, Chris. How did it go?\n\nCHRIS\nGreat. It was a snap. But Atherton said he's failing me anyway.\n\nJORDAN\nThat's terrible. You must be feeling awful. Are you all right?\n\nCHRIS\nThank you, Jordan. I do feel terrible but I can't talk about it right now. I need Mitch. Gotta go. Bye.\n\nHe grabs Mitch and pulls him out.\n\nICK \nHe seems to be handling it all right.\n\n5R5FADE OUT\n\nEXT. ATHERTON'S HOUSE-LATER THAT NIGHT\nChris knocks on the front door. Atherton answers the door. He is less than thrilled to see Chris.\n\nINT. ATHERTON'S HOUSE\n\nCHRIS\n(forcing his way in)\nHiya, Jerry, how's it going?\n\nATHERTON\nWhat do you want Kinsley?\n\nCHRIS\nWorld peace, but I don't think this is the time to discuss it.\n\nATHERTON\nWhat are you doing here? I've already told you you've burned out and you've failed me and yourself miserably.\n\nCHRIS\nYes, I know that. But I thought you might be interested.\n\nATHERTON\nI'm not interested in anything you have to say.\n\nJust then a pretty COED starts to come down the stairs. She is dressed only in one of Atherton's shirts.\n\nCOED\nJerry?\n\nCHRIS\nI solved the power problem, Jerry.\n\nAtherton pauses. He looks at Chris, then the girl.\n\nATHERTON\nDebbie, go home.\n\nINT. ATHERTON'S LAB-LATER THAT NIGHT\nAtherton, Kent, Bodie and Carter stand by the laser as Chris explains what he's done with formulas on the blackboard.\n\n\nCHRIS\nAs you know, I was working on supercharging the DF by means of a fusion technique using a secondary laser. Well, when I tried it, I discovered Kent had sabotaged it so it collapsed on itself.\n\nEveryone looks at Kent in disgust.\n\nCHRIS (CONT'D)\nAnd I want to thank him for the thought.\n\nKENT\nWhat????\n\nCHRIS\nThe Deuterium and Fluorine take up enough space by themselves, right? Well, the mistake we've been making up to now is in trying to kick up the power by means of yet another outside source. Big and bulky, right? Well, the elegance of this is that by reflecting part of the lasing light back in the gas jets we supercharge the whole deal, increasing the power tenfold with no increase in size.\n\nKENT\nThis is a complete waste of time.\n\nMitch has been preparing the laser for demonstration. He is struggling to lift several thick metal plates.\n\nCHRIS\nKent, make yourself useful for once and help put those plates against the wall.\n\nKent does and everyone stands back.\n\nCHRIS (CONT'D)\nOkay, Mitch do it. This should work.\n\nMitch switches on the main laser. It comes to life. Gases flow and a beam appears, hitting the plate without effect.\n\nMITCH\nNow we open the vacuum chamber.\n\nHe turns a valve and the beam begins to heat up the plate.\n\nCHRIS\nSo far so good. And now, cross your fingers.\n\nHe throws a switch. There's a beat. And then, suddenly, the beam glows intensely brighter, cuts through the plate, the  cabinets behind it and through the wall out into the night. Chris and Mitch jump shut the whole thing off.\n\nCHRIS\nSorry about the wall, sir.\n\nKENT\n(looking through the hole)\nAnd the tree across the quad.\n\nATHERTON\n(in awe)\nScrew the wall, you did it! You really did it.\n\nKENT\n(petulant)\nI've done my part, too.\n\nATHERTON\n(ignoring Kent)\nOkay, Kinsley. You did it. You pass.\n\nCHRIS\nThank you, sir.\n\nATHERTON\nAnd I think we can get that job back for you at PEI.\n\nKENT\n(apoplectic)\nWhat! You can't. That's my job. I've done everything you've ever asked. I get your laundry, and I finished the mirror. Look.\n\nKent runs out of the room as Mitch and Chris exchange a look and Atherton shakes his head. Kent returns, rolling a circular precision mirror one meter in diameter.\n\nKENT\nSee! Do you have any idea how hard it is to make a film virtually 100 per cent reflective, one micron thick and apply it to a mirror this shape?\n\nATHERTON\nGood, Kent.\n(to Chris, in a hurry)\nI have to go. I have a pressing...\n\nHe exits.\n\nMITCH\n(very happy for Chris)\nLet's celebrate.\n\nCHRIS\nAbsolutely. Kent, you with us?\n\nKENT\n(totally frustrated)\nOh...eat me.\n\nEXT. CAMPUS-NIGHT\nChris, Mitch, Ick and Jordan are looking at the laser hole in the tree.\n\n\nEXT. LIBRARY-NIGHT\nThey look at where the beam has cut a hole through the head of the statue of Dr. Bradford.\n\nEXT. STREET-NIGHT\nThey look high up at a hole where the beam went through a telephone pole and then across the street, even higher, where it burned through a billboard on top of tavern. They cheer.\n\nINT. BAR-LATER\nOur group is celebrating. The jukebox blares. Chris and Ick are drinking beers; Mitch and Jordan are holding hands, sharing a milkshake and feeding each other French fries.\n\nMITCH\nI don't think I'm ready for that yet. Maybe we should wait a year; at least until I get my license.\n\nJORDAN\nI understand. There are a lot of things to be considered here. For example, I could drive.\n\nHopsfield enters and sits down at the table. Everyone stares for a beat.\n\nHOPSFIELD\n(to Chris)\nI've been thinking about your laser solution.\n(a beat)\nI figure you've increased the output to six megawatts.\n\nCHRIS\nYeah.\n\nHOPSFIELD\nWhat would you use that for?\n\nMITCH\nThe applications are unlimited. Industrial for one.\n\nHOPSFIELD\nWith the gas tanks you've designed the beam would only last for forty seconds. What good is that?\n\nCHRIS\nI don't care, Laslo. I graduated.\n\nMITCH\nLet the engineers figure out a use for it. That's not our concern.\n\nHOPSFIELD\nMaybe somebody already has a use for it, one for which it's perfectly designed.\n\nJORDAN\nYou mean Atherton had something in mind all along?\n\nHOPSFIELD\nLooks at the facts: very high power, portable, limited firing time, unlimited range. All you'd need is a big spinning mirror and you could vaporize a human target from space.\n\nHopsfield gets up and walks outside. Silence for a beat.\n\nCHRIS\nThis is not good.\n\nICK \nYou want another beer?\n\nMITCH\nHow big a mirror?\n\nINT. HALLWAY-EARLY MORNING\nChris, Mitch, Ick, Jordan and Hopsfield run down the hall and enter the lab.\n\nANGLE- THE LAB\nThe laser is gone.\n\nINT. HALLWAY\nChris runs next door and forces Kent's lab door open, looks in.\n\nINT. KENT'S LAB\nThey all enter.\n\nCHRIS\nThe mirror is gone, too. Atherton, you worm! You pig! You fuck! Kent, you too!\n\nChris is venting his rage on every inanimate object in the room, kicking and punching.\n\nCHRIS (CONT'D)\nI should have seen it! How could I have not seen it!\n\nMITCH\nHe lied to us.\n\nCHRIS\nIt's easy to lie to you. You trust people! I'm cynic! What an asshole I am!\n\nHOPSFIELD\nI understand how you feel, Chris, and you're right. But what we should be doing now is trying to find out what he's doing.\n\nINT. CHRIS AND MITCH'S ROOM-NIGHT\nChris and Mitch sit waiting. Chris is very despondent. Very. Jordan enters.\n\nMITCH\nDid you do it?\n\nJORDAN\nI put a receiver in it too.\n(referring to Chris)\nIs he okay?\n\nMITCH\nI don't know he stopped talking about an hour ago. May I see it?\n\nShe holds out her hand and we see an almost microscopic electronic device. Ick enters carrying several gas masks, a gas bottle, some tubing an atomizer.\n\nICK \nReady?\n\nINT. DORM HALLWAY -MOMENTS LATER\nMitch, Jordan and Ick are gathered around the closed door to Kent's room wearing the gas masks. Ick feeds the end of the tube under the door and opens the valve on the bottle.\n\n\nICK \nWe'll have two minutes.\n\nA STUDENT walks by, not batting an eye.\n\nSTUDENT\nHi, guys.\n\nINT. KENT'S ROOM\nThe gas has knocked Kent out. He sleeps peacefully in a chair. The door opens and our gang enters.\n\nJORDAN\n(to Mitch)\nOpen his mouth.\n\nHe does and she pulls out some dental tools and goes to work, placing the receiver in Kent's mouth.\n\nJORDAN (cont'd)\nIt was his braces that gave me the idea. They're a perfect antenna. His whole..\n\nICK \nIt's about time someone put it to good use.\n\nINT. CHRIS AND MITCH'S ROOM-MOMENTS LATER\nThey all huddle around a homemade radio transceiver.\n\nMITCH\n(disguising his voice, into a microphone)\nKent. Kent. Wake up, Kent.\n\nINT. KENT'S ROOM-SAME TIME\nKent begins to stir. We can HEAR  Mitch's voice coming from Kent's head. At first he thinks he's dreaming.\n\nMITCH (V.O.)\nI'm talking to you, Kent.\n\nKENT\nWhat?\n\nMITCH (V.O.)\nI said I'm talking to you.\n\nKENT\n(shaking his head, violently)\nNo!\n\nMITCH (V.O.)\nYes.\n\nKENT\n(slapping himself)\nI'm not asleep. I must be overworked.\n\nMITCH (V.O.)\nYou're not overworked, Kent.\n\nKENT\nWell, I'm not insane!\n\nSilence.\n\nKENT (CONT'D)\nAm I?\n\nINT. CHRIS AND MITCH'S ROOM\n\nMITCH\nThat remains to be seen, Kent. But we are having a conversation.\n\nINT. KENT'S ROOM\n\nKENT\nI have to metabolize this. Um... who is this?\n\nMITCH (V.O.)\nThis is Jesus, Kent, and you've been a very naughty boy.\n\nKENT\n(cracking up, laughing)\nAll right! Who is this?! Bodie? Carter?\n\nMITCH (V.O.)\nI am known by many names. I am the One. Turn to me and be saved.\n\nKENT\nOh, Sure.\n\n\nMITCH (V.O.)\nCut the crap, Kent, you've built a weapon.\n\nKENT\nHow did you know that?\n\nMITCH (V.O.)\nI know everything.\n\nKENT\nOh. God.\n\nINT. CHRIS AND MITCH'S ROOM\n\nMITCH\nThat's right, Kent. Where is the laser now?\n\nINT. KENT'S ROOM\n\nKENT\nI can't tell you.\n\nMITCH (V.O.)\nHow would you like to burn for the rest of time?\n\nKENT\n(panicking)\nNo, they're testing it on the twenty-seventh but I don't know where. It's classified.\n\nMITCH (V.O.)\nOh.\n\nKENT\nWhat?\n\nMITCH (V.O.)\nNothing. I want you to think about what you've done and repent, and from now on, stop playing with yourself.\n\n\nKENT\nI don't...okay\n\nINT. CHRIS AND MITCH'S ROOM\n\n\nMITCH\nNow what?\n\nThe closets door opens and Hopsfield appears.\n\nHOPSFIELD\nPhase two.\n\nINT. STEAM TUNNELS\nThey are near Hopsfield's lair. Hopsfield has removed the cover from an enormous terminal. Chris seems remote and depressed.\n\nHOPSFIELD\nThis is the phone terminal for the entire school.\n\nMITCH\nOkay, we tap Atherton's office phone. What about his home?\n\nICK \nAll the faculty's home phone are part of the University system.\n\nJORDAN\n(enthusiastically, looking at the maze of wiring)\nGreat, all we have to do is find it!\n\nHOPSFIELD\nWe'll find it.\n\nJordan and Hopsfield set to work searching for Atherton's lines. Ick is concerned about Chris.\n\nICK \nI'm depressed. Why did I listen to my parents? I should have become a ping-pong pro.\n\nHOPSFIELD\nIt's not too late.\n\nMITCH\nYou shouldn't be depressed. It's us he used.\n\nJORDAN\nDowntown Schmidlap.\n\nMITCH\nExcuse me?\n\n\nJORDAN\n(Still working)\nErnie \"Downtown\" Schmidlap. From my high school. He was captain of everything. One day he told me he wanted to \"date me up.\" so for a month he'd come over and I'd do his homework for him. He was going to take me to the prom. But once he passed his courses, he took Roberta Preen. I stayed home and re-wired our housekeeper's TV.\n\nICK \nThat's awful!\n\nMITCH\nYou think that hurts?  You should've met my Uncle Stan. He was a Weasel.\n\nICK \nThat bad, huh?\n\nMITCH\nNo, that was his lodge. The Royal order of Friendly Weasels.  Every Wednesday when I was eight, he'd take me down to his lodge meeting and he'd challenge people to call out two five-digit numbers. I had to multiply them in my head faster than a guy could do it on a calculator. They'd bet on me. Of course, after the meeting, he'd take me for ice cream.\n\nICK \nThat's nice.\n\nMITCH\nWell...he'd take me to the supermarket and I had to dip my hand in.\n\nHOPSFIELD\nI've got his office.\n\nJORDAN\nI've got his home.\n\nINT. STEAM TUNNEL- SOMETIME LATER\nThey've all made themselves comfortable as they sit and wait for the phone tap to produce results. Hopsfield has wired a speaker so that they can hear,\n\nCHRIS\nWhy doesn't your phone ring, you jogging, syphilitic microbe?\n\nICK \n(sotto, to Mitch)\nI think he's coming around.\n\nSuddenly, from the speaker, we HEAR the sound of Atherton's phone being picked up.\n\nATHERTON (V.0./FILTER)\nHello\n\nVOICE (V.O.)\nIs this Jerome Atherton?\n\nATHERTON (V.O.)\nYes, it is.\n\nVOICE (V.O.)\nThis is Bill Carlisle. I saw your television show the other night about the reproductive system.\n\nATHERTON (V.O.)\nThank you, I hope you enjoyed it.\n\nVOICE (V.O.)\nI love it. Everything you said was copied word for word from my book and I expect a lot of money for it.\n\nATHERTON (V.O.)\nNeed I remind you, it's public television, an attempt to teach people something. And all you can think of is personal greed. It's people like you that make me feel bad about being American.\n\n\nVOICE (V.O.)\nI'm Canadian\n\nATHERTON (V.O.)\nI'm not surprised. Good day.\n\nThey hang up.\n\nICK \nGod, he's good at that. He almost gets away with it. That's the most manipulative guy I've ever seen... I mean heard.\n\nCHRIS\nHe does get away with it.\n\nMITCH\nNot anymore.\n\n\nINT. STEAM TUNNEL-LATER STILL\nEveryone lies asleep in various places and positions, Mitch awakens. He is amazed to find Jordan asleep on his shoulder, so amazed he has to wake her.\n\nMITCH\nJordan?\n\nJORDAN\nHmmmmmmmm.\n\nMITCH\nYou were sleeping.\n\nJORDAN\nI was? Gee\n(snuggling)\nI guess you relax me.\n\nMITCH\n(proudly)\nWow!\n\nCHRIS\n(awakening)\nWhat's going on?\n\nMITCH\nI put Jordan to sleep.\n\nCHRIS\nAnd you're proud of that?\n\nMITCH\nYeah.\n\nThe speaker comes to life with the sound of the receiver being groped for and then Atherton's groggy voice.\n\nATHERTON (V.O.)\n(mumbling)\nYes...hello\n\nDECKER (V.O.)\nJer? Dave Decker How are you?\n\nATHERTON (V.O.)\nChrist, Dave what time is it?\n\nDECKER (V.O.)\nNine thirty here in Washington. I thought you Californians all get up early and exercise. Ha, ha\n\nCHRIS\nThis is it. That's the guy I saw at his house with the daughter.\n\nATHERTON (V.O.)\nVery funny, Dave. What do you want?  I'm busy.\n\nDECKER (V.O.)\nIt sounds like it. Listen, I'll be out there tomorrow for the test but I want you to go to the Marsh this afternoon and check optics systems one more time.\n\nATHERTON (V.O.)\nWhy?\n\nDECKER (V.O.)\nBecause I'm in charge, Doctor. Goodbye. He hangs up. All look to Chris.\n\nICK \nWell?\n\nCHRIS\n(comes to life)\nIt's happening.\n\nMITCH\nIt's only weapon if it works, right?\n\nCHRIS\n(determined)\nYou're absolutely right! The time has come, people. No more being used. No more Downtown Schmidlaps or Uncle Stans or Jerry Athertons. We're going to take responsibility for our own brains. Remember, without ethics there can be no morality. Without morality there is no society and without society there can be no fast food restaurants. So the whole country, nay, in the world, is counting on us to get even in a big way. Thank you.\n\nICK \nNice logic.\n\nCHRIS\nThanks. Synchronize watches.\n\n\nMITCH\nWhy?\n\nCHRIS\nIt's just something you say at a time like this.\n\nHOPSFIELD\nI don't need a watch.\n\nCHRIS\nOkay, forget it. Let's go.\n\nEXT. ATHERTON'S HOUSE-DAY\nAtherton comes out and heads for his car carrying an over-night bag. As he drives away we SEE  that Ick has been spying on him.\n\nEXT. A FILED-DAY\nIck is hiding behind some bushes on a knoll. he is looking through binoculars.\n\nICK POV\nAtherton's car is passing through a high security gate into Marsh field.\n\nEXT. SHIPPING DOCK-DAY\nChris, Mitch and Hopsfield are loading the last of several large boxes into a beat-up van.\n\nEXT. ATHERTON'S HOUSE-EVENING\nThe van pulls up in front. Painted on the side is a plumber's logo. Mitch, Jordan and Ick start unloading boxes. Chris goes to the front door.\n\nANGLE ON THE DOOR.\nChris picks the lock.\n\nINT. HOPSFIELD'S LAIR-LATER THAT NIGHT\nChris and Mitch enter to see Hopsfield as he works at the computer, attempting to interface with another computer. Each time he hits the keys the READOUT replies \"Negative.\"\n\nHOPSFIELD\nBoy, these secret fields are so untrusting.\n\nCHRIS\nSo we can't get on-base clearance.\n\nHOPSFIELD\nI guess not.\n\nCHRIS\nForget it. We'll balls it.\n\nJordan enters carrying two I. D. cards.\n\nJORDAN\nHow do these look?\n\nINSERT\nTwo fake I. D.'s with Mitch's and Chris's picture on them.\nPerfect. I hope.\n\nANGLE BACK ON THE ROOM\n\nMITCH\nWhat if they don't fool anybody?\n\nCHRIS\nThey shoot us.\n\nEXT.  MARSH AIR FORCE BASE- MIDDLE OF THE NIGHT\nTechnicians check monitors and prepare for the coming test. Nearby stands a firing command module very reminiscent of the pilot's compartment in the opening sequence. Atherton goes over last minute details with various people. He seems distracted as an engineer discusses a problem with him.\n\nENGINEER\nAre you all right?\n\nATHERTON\nWhat? Oh, yes, fine. Have you ever had a feeling that there's something terribly wrong?\n\nENGINEER\nNo.\n\nEXT. MAIN GATE OF THE BASE-NIGHT\nThere are two Air force Police GUARDS in the shack. Chris and Mitch pulls up in Kent's Citroen, behind a government sedan awaiting clearance at the gate. They are dressed as technicians and Mitch sports a moustache.\n\nINT. THE CITROEN\nMitch is a wreck and Chris doesn't help. He begins humming the theme from \"Mission Impossible.\"\n\nGUARD (V.O.)\nAll clear, Mr. Decker. Just follow the yellow line.\nChris accidentally hits the horn. Through the windshield we SEE Decker and the guard look back. Chris recognizes Decker.\n\nCHRIS\n(covering)\nHow long does it take?\n\nMitch whimpers. Decker's car pulls away. The guard uses one finger to motion Chris forward. Chris pulls the car up. The guard leans in the window.\n\nGUARD\nI.D.\n\nMitch, obviously shaking, hands his to Chris who hands them to both guard.\n\nCHRIS\nSnap it up, will ya? We just flew in. We're tired. We're hungry. We have this stupid car.\n\nThe guard turns away and walks into the shack.\n\nMITCH\nAre you out of your mind?\n\nCHRIS\nYou have to intimidate these guys.\n\nThe guard returns.\n\nGUARD\nYou're not on the list.\n\nCHRIS\nOf course not. We're classified.\n\nWe HEAR the phone RING. The second guard answers it.\n\nINT. COMMAND CENTER\nAn Air Force Officer is on the phone. An impatient Atherton stands beside him.\n\nATHERTON\nI don't know what he should look for, just tell him if he sees anything out of the...let me tell him.\n\nHe grabs the phone.\n\nINT. THE CITROEN\n\nGUARD\nAren't you guys a little young to be technicians?\n\nCHRIS\nLasers are a young science. There, fine, now you've made me say it. Now we're all in trouble.\n\nMitch looks like he's going to die.\n\n\nGUARD\nLook, I'll call the duty officer.\n\nHe starts towards the phone shack.  The other guard is still on the phone.\n\nCHRIS\n(his demeanor changing)\nExcuse me.\n\nThe guard turns back.\n\nCHRIS (CONT'D)\nLook, pal, don't call anybody.  We're four hours late. It's our jobs.   Give us a break, will ya?  Someday you might be in the private sector, right?\n\nA beat. Mitch dies. Chris gives the guard a goofy grin.\n\nEXT. THE GATE\n\nThe guard waves them through.  The car pulls away. The guard returns to the booth.\n\nSECOND GUARD\nWe're supposed to look for anything out of the ordinary.\n\nFIRST GUARD\nOkay.\n\nEXT. THE RAMP - NIGHT\n\nA B-1 Bomber, painted black, sits in the glow of the work lights.  Technicians, who are wearing jumpsuits similar to the ones Mitch and Chris have on, are busy working around the plane.\n\nChris and Mitch ENTER FRAME and walk up to the plane.  A couple of the technicians watch them curiously as they go up the stairs into the bomb bay.\n\nINT. BOMB BAY\n\nChris and Mitch enter.  Three technicians are inside the plane running last minute checks on the laser, which sits in the middle of the cabin.  Chris crosses to the technician who is in the middle of the cabin.  He watches him making mental notes as he checks the program.  The technician turns, sensing his presence.\n\nCHRIS\nNice work. Keep it up.\n\nMitch, meanwhile, checks out the laser optics.  After a beat, one of the technicians signals for the others to complete their jobs and exit.  They start to file out.  One of them turns and looks at Chris, who is just standing there.\n\nCHRIS\nWhat?!\n\nThe technician shakes his head uncertainly and exits with the others.  Finally, Mitch and Chris are alone.  Chris opens the BRIEFCASE. It contains a cellular phone, a modem and an EEPROM Processor.\n\nINT. HOPSFIELD'S LAIR - SAME TIME\nThe computer receives a signal.  Hopsfield turns to Jordan and Ick.\n\nHOPSFIELD\nWe've got a connection.  They're in.\n\nINT. BOMB BAY\n\nCHRIS\nGet the EEPROMs.\n\nMitch opens up the computer and clips a couple of power lines and pulls out four computer chips and hands them to Chris, who plugs them into the processor.  Chris picks up the phone.\n\nCHRIS\n(into phone)\nAbbott to Costello.\n\nINT. HOPSFIELD'S LAIR\nJordan picks up the phone.\n\nJORDAN\n(into phone)\nThis is Costello. Go ahead, Abbott.\n\nINT. BOMB BAY\n\nCHRIS\n(into phone)\nCostello,  who's on first?\n\nMitch hits him impatiently.\n\nCHRIS (CONT'D)\nWe've got the goodies.\n\nJORDAN (V.O.)\nWe have the target coordinates computed for trajectory adjustment.\n\nCHRIS\nGreat. Shoot.\n\nINT. HOPSFIELD'S LAIR\nHopsfield's computer screen fills with machine code of ones and zeros.  He begins searching through many screens of code.\n\nHOPSFIELD\nOh, oh.\n\nICK \nWhat?\n\nHOPSFIELD\nOh, nothing.\n\nINT. BOMB BAY\nChris and Mitch freeze as a mechanic walks by the open bomb bay door.\n\nINT. COMMAND CENTER - EARLY MORNING\nTechnicians are checking monitors and a radar scope at a control panel.  Atherton is in the rear of the room briefing a group of civilians and military brass.  Amongst them is Decker.  Atherton points to a drawing on a large chart.\n\nATHERTON\nThe plane will reach an altitude of sixty-five thousand feet.  When it is over, the target will fire the laser from here .... \n(points to the firing module)\n ... for five point two seconds.\n\nCarmichael enters.\n\nCARMICHAEL\nThey're all set for the final onboard check.\n\nATHERTON\nFine.  Right this way, gentlemen.\n\nThey all follow Atherton and Decker to the exit at the rear of the room.\n\nINT. BOMB BAY\nChris and Mitch sweat it out.\n\nINT. HOPSFIELD'S LAIR\nHopsfield is scanning the screens.\n\nHOPSFIELD\nI think I've found it.  May I have the coordinates, please.\n\nICK \n(reading from paper)\nThirty-four degrees, ten minutes, fifteen seconds North; one hundred eighteen degrees, nine minutes, three seconds West.\n\nHopsfield enters the data into his computer.\n\nJORDAN\n(into phone)\nWe're sending.\n\nINT. BOMB BAY\n\nCHRIS\n(into phone)\nWe're taking.\n\nMitch suddenly panics as he looks out.\n\nMITCH'S POV\nAtherton and his group come around the corner of a building and head for the plane.\n\nANGLE ON MITCH AND CHRIS\n\nMITCH\nThey're coming this way.\n\nCHRIS\n(into phone, overly calm)\nYou may be interested in knowing that Mitch reports that Herr Professor is approaching and I'm not even sweating.  Isn't that remarkable?\n\nINT. HOPSFIELD'S LAIR\n\nJORDAN\nPlease hurry.  Atherton's coming.\n\nHOPSFIELD\n(typing furiously)\nPlease, I don't work well under pressure.\n\nHe finishes.\n\nHOPSFIELD (cont'd)\nThere. I hope that does it.\n\nJORDAN\n(into phone)\nOkay, Chris  ... I mean Abbott.  Hello ... hello ... hello ...\n\nEXT. BOMBER\nAtherton and his group approach and enter the bomb bay.\n\nINT. BOMB BAY\nAs they enter, there is no sign of Chris and Mitch.  Atherton checks out the laser and the computer.  The others examine various gauges and switches and the flight deck.\n\nCARMICHAEL\nEverything all right?\n\nATHERTON\nOf course.\n\nEXT. BOMBER\nAs the group exits the plane, Chris and Mitch drop out of the forward landing gear well in the background.\n\nATHERTON\n(turning back)\nOh, I forgot ...\n\nATHERTON'S POV\nA glimpse of Chris and Mitch as they disappear around the corner of the building.\n\nCLOSE ON ATHERTON\nUncertain of what he has just seen.\n\nCARMICHAEL (O.S.)\nWhat is it?\n\nATHERTON\nNothing.\n\nINT. DORM LIBRARY - PRE-DAWN\nKent looks the worse for wear as he sits surrounded by psychology books dealing with schizophrenia.\n\nMITCH (V.O.)\nHi, Kent.\n\nKENT\n(surprised)\nOh, I thought you were gone.\n\nMITCH (V.O.)\nNot yet.  Have you been touching yourself?\n\nKENT\nYes. I mean, no.\n\nINT. CHRIS AND MITCH'S ROOM - SAME TIME\n\nMITCH \n(into mike)\nGood, Kent.  Dad, my father, you know, God, wants to show you something.\n\nKENT (V.O./FILTER)\nWhy?  I mean, what?\n\nMITCH\nI've learned not to ask.\n\nINT. DORM LIBRARY\n\nMITCH (V.O.)\nHe wants you to wait on the sidewalk at six thirty nine Ivy Crest Drive at precisely six-oh-eight this morning.\n\nKENT\nIvy Crest?\n\nMITCH (V.O.)\nJust wait there and you shall receive a sign.  Do not despair and do not go inside.\n\nKENT\nWhy not?  Hello?  Hello, Jesus?\n\nA student walks in and looks at him strangely.\n\nINT. COMMAND CENTER - DAWN\nAtherton and company watch the bank of monitors as the flight controller clears the bomber for take off.\n\nEXT. CAMPUS - DAWN\nChris and Mitch jump into the van and drive off.\n\nINT. COMMAND CENTER\nSome monitors show the bomber climbing while others show the desert target area.  It is a mock up of a Presidential motorcade.  The open cars are filled with test dummies, and are linked together and are being towed slowly across the desert by a tractor.\n\nCONTROLLER \n(into mike)\nCrossbow One, radar contact.  Climb and maintain flight level six five oh.\n\nEXT. ATHERTON'S HOUSE\nThe van pulls up and parks across the street.  Chris and Mitch get out.  Just then, a Volvo pulls up and Jordan, Ick and Dr. Meredith get out.  Dr. Meredith is wearing a bathrobe, pajamas and slippers.\n\nMEREDITH\nAh, Mr. Kinsley.  Why am I not surprised to see you here?  Perhaps you have the explanation for this so-called event I'm suppose to witness.\n\nCHRIS\nYes, sir, I do, but first may I take this opportunity to compliment you on  your fashion sense.\n\nINT. CONTROL CENTER\n\nCONTROLLER \n(into mike)\nCrossbow One, turn left to two eight zero.\n\nPILOT (V.O./FILTER)\nTwo eight zero, roger.\n\nA technician hits a switch and a monitor pops on. Crosshairs dominate the center of the screen.  The desert floor rushes by.  Atherton turns to a specialist standing by.\n\nATHERTON\nNorman, if you'd be so kind. This cockpit mock-up duplicates the shuttle flight deck and we've placed it here to demonstrate the firing technique.\n\nThe specialist takes his place inside the command module.\n\nPILOT (V.O./FILTER)\nWe are thirty one DME from the target.\n\nCONTROLLER \n(mike)\nRoger, Crossbow. Open the doors.\n\nINT. BOMB BAY\nThe doors open to reveal clouds rushing past and the ground far below.\n\nEXT. ATHERTON'S HOUSE\n\nMEREDITH\nThese are rather strong accusations, Chris.\n\nCHRIS\nYes, sir, I know.\n\nMEREDITH\nIf they're true, I'm going to need some proof.\n\nCHRIS\nI think we're going to be able to accommodate you in just a minute, sir.\n\nLooking past Meredith, Chris sees Kent approaching.\n\nANGLE ON KENT as he arrives at the house and stars up at it.  He glances at his watch and waits impatiently.\n\nINT. COMMAND CENTER\nInside the firing module, the specialist pulls down the target sighting device and puts his hands on the joysticks.\n\nSPECIALIST\nPower on.\n\nCONTROLLER\nT minus fifty and counting.\n\nINT. BOMB BAY\nThe large mirror lowers into its firing position and the laser powers up.\n\nEXT. ATHERTON'S HOUSE - MORNING\nThe group watch Kent, who is nervously pacing back and forth, talking to himself.\n\nCHRIS\n(to Mitch)\nBoy, if this works, he's going to start a new religion.\n\nMITCH\nIf it doesn't work ...?\n\nChris shoots him a censoring look.\n\nINT. COMMAND CENTER\nThis countdown continues.  Monitors display the target sight, the pilot's sighting screen of the ground and a camera's view of the bomber.\n\nTECHNICIAN\nTrajectory command relay, locked.\n\nATHERTON\nNow, Norm here has firing control.\n\nANGLE ON TARGETING MONITOR\nThe target motorcade is sighted.\n\nINT. BOMB BAY\nThe laser mirror and sighting lens move in unison as they line up on target.\n\nINT. COMMAND CENTER\nThe crosshairs line up on the sighting monitor.\n\nEXT. ATHERTON'S HOUSE\n\nJORDAN\nWhat's he doing?\n\nTHEIR POV\nKent has now started toward the front door.\n\nMITCH\nI told him not to go in!\n\nCLOSER ANGLE ON KENT\n\nKENT\n(muttering to Jesus)\nLook, this is Jerry's house, we're very close, so if you're not going to answer me, then I'm going in ...\n\nHe reaches for the front door.\n\nKENT (CONT'D)\n... here I come.\n\nANGLE ON CHRIS AND MITCH\n\nCHRIS\n(shouting)\nKent! Stop!\n\nANGLE ON KENT\nwho turns and sees them.\n\nINT. COMMAND CENTER\nEveryone is riveted to the sighting monitor.\n\nSPECIALIST\nTarget locked. In ten, nine, eight ...\n\nAs the countdown continues.\n\nINT. BOMB BAY\nThe computer comes to life and electronically unlocks the laser optics from the sighting camera.  The mirror turns to the left.\n\nINT. COMMAND CENTER\nThe aerial view of the motorcade remains centered on the sighting monitor.\n\nINT. ATHERTON'S HOUSE\nKent opens the front door and enters.\n\nKENT\n(to himself)\nThat looked like Dr. Meredith in a bathrobe. First I'm hearing things, now I'm seeing things.\n\nHe closes the door.\n\nKENT (CONT'D)\nOkay, God. Let me have it.\n\nThe room is dark, lit only by morning light coming through a large stained glass window at the top of the stairs.  In the middle of the room is what looks like a large above-ground swimming pool, covered in aluminum foil.  Kent is amazed.\n\nINT. COMMAND CENTER\n\nSPECIALIST\n... three, two, one, bingo.\n\nHe hits the trigger.\n\nINT. BOMB BAY\nThe laser fires.\n\nEXT. SKY\nThe laser beam traces through the atmosphere.\n\nINT. COMMAND CENTER\nThe group waits expectantly.  Nothing happens to the target.\n\nEXT. ATHERTON'S HOUSE\nChris and Mitch, who are running toward the house, are stopped in their tracks by the incredible sight of the red laser beam shooting down out of the heavens, striking the grass, tracking across the lawn then up the wall of Atherton's house.\n\nINT. ATHERTON'S HOUSE\nThe beam strikes the window and for one tiny moment causes the most incredible light show anyone has ever seen.\n\nKENT\n(in awe)\nOh!\n\nThe window is obliterated by the laser light, which crashes down directly onto the aluminum foil-covered pool.\n\nKENT (CONT'D)\nOh, my!\n\nThe foil is heated instantly in the laser light and there is the SOUND of tiny explosions, building to a roar.  In a second, the foil rises violently and tears open.  Kent picks up a piece of debris and examines it.\n\nKENT\nPopcorn?\n\nIn the next instant, he is engulfed in popcorn.\n\nEXT. ATHERTON'S HOUSE\nThe beam disappears as suddenly as it came.  Everyone stands in awe.  A few kernels fly out of the broken window, then a storm.\n\nINT. ATHERTON'S HOUSE\nKent and furniture are being forced up the stairs by a rising tide of popping popcorn.  He struggles against it, loses, and sinks into the mound like a dinosaur in quicksand.\n\nEXT. ATHERTON'S HOUSE\nThe windows are filling up with popcorn.  Finally, they crack and break as popcorn forces its way out of the house wherever it can.\n\nMITCH \nKent!\n\nChris and Mitch head for the front door.  Suddenly, it bursts open and Kent is carried out by a moving wall of popcorn.\n\nINT. COMMAND CENTER\nPeople furiously check systems.\n\nCARMICHAEL\nI don't understand. Did it fire?\n\nTECHNICIAN\nYes, we indicate a shot.  We've got another problem, though.  It's not shutting down.\n\nINT. BOMB BAY\nThe computer is still working. The laser optics and equipment begin to melt.  It's been wired to self-destruct.\n\nINT. COMMAND CENTER\nThe devastated group watches the laser self destruct on the monitor.\n\nDECKER\nNice going, Jer.\n\nATHERTON\nSomething's wrong here.  Unlock the bird's eye.\n\nHe takes over the command module sighting system\n\nATHERTON\nI'm tracing where the shot went.\n\nWe watch as the monitor's view swings away and across a residential neighborhood, coming to rest on a bird's eye view of his own house.\n\nATHERTON (CONT'D)\nOh, no.\n\nThe monitor view moves in to reveal what looks like a growing mushroom.\n\nDECKER\nWhat have you done?\n\nATHERTON\nRetired.\n\nEXT. ATHERTON'S HOUSE\nThe group looks on as the mountain of popcorn continues to engulf the house.  Meredith goes to see if Kent is all right.\n\nCHRIS\n(to Mitch)\nDo you think we used too much?\n\nMITCH\nMaybe a little.\n\nCHRIS\nWell, I guess we all learned something here today.\n\nJORDAN\nWhat?\n\nCHRIS\nI don't know, but it seemed like the right thing to say, didn't it?\n\nICK \nIt did to me.\n\nAs they continue to watch the destruction of the house, and various neighbors come out to see what's what, a Winnebago pulls up and stops.  Hopsfield gets out.\n\nHOPSFIELD\nI think  you used too much.\n\nCHRIS\nReally? I'm sorry you missed it.\n\nHOPSFIELD\nYeah, well, I had to pack.\n\nCHRIS\nWhy?\n\nHOPSFIELD\nI'm getting married.\n\nCHRIS\nWhat? To whom?\n\nMITCH \n(looking at the U-Haul)\nWhat is all this?\n\nHOPSFIELD\nOh, I won. Only thirty-one point eight percent though. I have to figure that out. But not this summer.\n\nMitch suddenly sees Sherry standing at the Winnebago door.\n\nMITCH\nSherry?\n\nSHERRY \n(kissing Hopsfield)\nHi. Isn't it wonderful. I finally found him. Number  One. I've been looking for him for ten years.\n\nHOPSFIELD\nWhat can I do?  She loves me.\n\nCHRIS\nRight.  Congratulations.\n\nHOPSFIELD\nThanks.  Anyway, we probably won't ever get to see you again, so, bye.\n\nCHRIS\nWhat do you mean?  Where are you going?\n\nSHERRY\nI've got a little survival place in Wyoming.  We're going to live there.\n\nHOPSFIELD\nYeah, it's getting too weird around here.  See ya.\n\nThey climb into the Winnebago and it pulls away. The others watch it go.\n\nICK \nYou think it's getting too weird around here.\n\nCHRIS\nAbsolutely.\n\nJORDAN\nI didn't notice.\n\nMITCH\nI like it.\n\nIn the background, the popcorn has split the walls of the house and finally lifts the roof off like the top of a pot. The whole house tilts to its side and the popping stops.\n\nAs we PULL BACK, Atherton's car pulls up and he gets out, dumbstruck.  Dr. Meredith walks over to him and confronts him. Kent joins Chris and the others who watch.\n\nTHE END.\n\n\n\n\n\n\n\n\n\n\nReal Genius\nWriters :   Neal Israel  Pat Proft  Peter Torokvel\nGenres :   Comedy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:33:37.602246"}