{"title": "Rebel Without A Cause", "film_link": "/Movie Scripts/Rebel Without A Cause Script.html", "script_link": "/scripts/Rebel-Without-A-Cause.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Rebel Without A Cause Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Rebel Without A Cause Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/8-stars.gif\"/> (8.09 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Stewart Stern\" title=\"Scripts by Stewart Stern\">Stewart Stern</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/>\n<br/>\n<a href=\"/scripts/Rebel-Without-A-Cause.html\">Read \"Rebel Without A Cause\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n<title>Rebel Without A Cause</title>\n\n<pre>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<b>                 REBEL WITHOUT A CAUSE\n</b>\n                           by\n\n                     Stewart Stern\n<b>\n</b>\n\n\n<b>                     CAST OF CHARACTERS\n</b>\n<b>                        JIM'S FAMILY\n</b>\nJIM'S GRANDMA: A chic, domineering woman in her sixties who\n      has made her son Frank dependent upon her for every\n      breath he takes.  She is the irritant in the\n      household--the silent ruler--the silent enemy of\n      Frank's marriage.\n\nJIM'S FATHER: Frank is an unfeathered man who has never been\n      able to have fun.  He is anxious to be a real father\n      to Jim, but has never learned how.\n\nJIM'S MOTHER: Tense and immature, she has never found the\n      husband she married.  Upset by the presence of her\n      mother-in-law, mated with an ineffectual and joyless\n      man, she takes out her disappointment on him and on\n      her son.\n\nJIM: The angry victim and the result.  At seventeen he is\n     filled with confusion about his role in life.  Because\n     of his \"nowhere\" father, he does not know how to be a\n     man.  Because of his wounding mother, he anticipates\n     destruction in all women.  And yet he wants to find a\n     girl who will be willing to receive his tenderness.\n\n<b>                        JUDY'S FAMILY\n</b>\nJUDY'S FATHER: a junior partner in a law firm.  Boyish,\n       attractive and debonair.  Because he is frightened by\n       the adolescence of his daughter, Judy, his only\n       recourse is to criticize her.\n\nJUDY'S MOTHER: Self-centered and frightened by the coming of\n       middle-age.  She feels that Judy's blossoming youth\n       is threatening her wifely position as the desirable\n       object of the husband's attentions.\n\nJUDY: The victim and the result.  At sixteen, she is in a\n      panic of frustration regarding her father--needing his\n      love and suffering when it is denied.  This forces her\n      to invite the attention of other men in order to\n      punish him.\n\nBEAU: Judy's brother.  Because he is very young he is a\n      danger to nobody and thus will grow up happily--\n      certain of the love of his father who feels comfortable\n      in giving it.\n\nPLATO: Son of a divided family--an absent father and a\n       traveling mother--he feels himself the target of\n       desertion. At fifteen he wants to find a substitute\n       family for himself so that he need no longer feel\n       cold, and especially a friend who will supply the fatherly\n       protection and warmth he needs and cannot find.\n\nBUZZ: A sado-masochistic boy of seventeen, who acts out\n      aggressively his idea of what a man should be in order\n      to hide his real sensitivities and needs.  He was\n      probably rejected by both parents and must constantly\n      court danger and must constantly court danger in order\n      to achieve any sense of prestige or personal worth.\n\n<b>                          THE KIDS\n</b>\nHELEN, CRUNCH, MOOSE, GOON, CHICK, COOKIE, MIL: All\n       searching for recognition in the only way available\n       to them; all suffering from unfulfilled hungers at\n       home; all creating an outside world of chaos in order\n       to bear the chaos they feel inside.  They are\n       soldiers in search of an enemy.\n\n<b>FADE IN.\n</b>\nA deep night sky.  Matte shot.  Camera searches slowly\nupward through the heavens and the silver tone of a bell is\nheard sounding the strokes of midnight.\n\nOn the final note of the bell, camera is full on the Milky\nWay and there it rests, just long enough for a burst of\nEaster singing to arise.  The hymn is sung by the crude,\nunmatched voices of children.  Camera pans down to include:\n\nSpire of a church.  Camera continues its downward pan as the\nsinging continues and we pass a window beyond which is the\nsource of the singing.  Camera pans off window to show--\n\nLong shot.  City.  Night.  Suddenly revealed--crisp and\nsparkling with lights.  Camera pans down and over:\n\nA lonely street full of parked cars.  The singing diminishes\nbut a thread of it remains.  A car has just parked.  The\nheadlights snap off.  A MAN emerges whistling the same\nmelody and pulls some gifts from the front seat.  He slams\nthe door and starts down the street in the direction of a\nhouse with bright windows.  He must pass an empty lot full\nof rusty grass and litter which lies in darkness between two\nstreet lights.\n\nAs the MAN walks by the lot, still whistling, a GROUP OF\nFIGURES rises silently from the grass, figures who have been\nlying in concealment until now.  They step noiselessly onto\nthe pavement and follow the MAN.  At the sound of their\nboots the whistling stops.\n\nThe MAN glances behind him and sees the figures walking\nafter him, filling the pavement.  A street light shows them\nto be boys and girls and all quite young.  The MAN moves on\nmore swiftly and the sound of their pursuit increases.  He\nbegins to run toward the lighted house and the following\nsteps run too.  Suddenly he stops under the next street\nlight and turns to face the figures.  They are upon him and\naround him quickly.  Nobody speaks for a moment, then one of\nthe boys grins.  His name is BUZZ.  He is big and filled\nwith an awareness of his own masculinity.\n\n<b>                         BUZZ\n</b>                   (friendly, cool)\n            That was pretty what you were\n            whistling.  Whistle some more.\n\nThe MAN whistles a nervous phrase, trying to make a joke of\nthe situation which he doesn't understand.\n\n<b>                         BUZZ\n</b>                   (continuing; suddenly)\n            You got a cigarette?\n\n<b>                         MAN\n</b>            Oh, I think so--\n\nThe MAN fumbles in his pocket, finds a pack and drops it in\nhis nervousness.  The FIGURES wait until he picks it up.  He\noffers one to BUZZ.\n\n<b>                         MAN\n</b>                   (continuing)\n            Filter tips.\n\n<b>                         BUZZ\n</b>                   (smiling, encouraging)\n            You smoke it.  Smoke it, Dad.\n\nSmiling uncertainly, the MAN puts the cigarette in his mouth.\nBUZZ, still smiling, takes out a packet of wooden matches.\n\n<b>                         BUZZ\n</b>                   (continuing)\n            I'll light it for you, Dad.\n\nBUZZ ignites a match and holds it near the Man's face for a\nsecond, searching it.  Then he ignites the whole box under\nhis nose.  The MAN shrieks, and his packages fall.  BUZZ\nslaps him sharply, his smile gone.\n\nThe camera pans away as the figures enclose him, and holds\non a small mechanical monkey which has dropped from its\nwrappings.  It begins to dance madly on the pavement, then\nruns down.\n\nThe feet of the figures scatter past the unmoving monkey.\nThen camera rises to show that the man has disappeared.\nThere is a moment of awful stillness, then we see a boy\ncoming down the street alone.  He is quite drunk, and he\nslips once.  This is JIM, a good-looking kid of seventeen\nwith a crew-cut and wearing a good suit.  The spilled\npackages on the pavement stop him.  He bends down to see\nwhat they are and picks up the mechanical monkey from the\nwreckage.  He smiles and winds it up.  He sets it on the\nsidewalk and sits down.  He watches it dance for a moment,\nhappily.  A siren is heard distantly, growing louder.  JIM\npays no attention to it as he winds the monkey again and\nreleases it for its dance.\n\nSUPERIMPOSE TITLE: \"REBEL WITHOUT A CAUSE\" STARRING ____ as\nsiren rises piercingly close, and JIM looks up, we:\n\n<b>                                            DISSOLVE TO:\n</b>\nClose shot.  Throbbing light of police car.  Night.  The\nsiren screaming wildly, then dying.  The sound of brakes.\nCamera moves to reveal the police car stopped at the\nentrance of a Precinct Station.  Two officers dismount,\nbearing between them the struggling JIM.  They bear him up\nthe steps and in through the double doors.\n\nInside precinct station. Reception area.  A large open space\nonto which several corridors converge.  In the middle is a\nSergeant's desk, really a quadrangular counter in the center\nof which the SERGEANT stands.  There are a few glass-walked\ninterviewing rooms which open off the area, and several\nbenches lining the walls.  The scene is one of confusion,\nactivity and waiting.  Phones ring.  The arrested pass in\ncustody of officers.  Present among others at JIM's entrance\nare: JUDY, who is blonde and sixteen.  She sits on a crowded\nbench wearing an expression of downcast bitterness.  On a\nbench across the way from her are three remarkably dirty\nlittle Mexican children without shoes or socks.  The oldest\nis a BOY of four who is protecting his little SISTER who in\nturn mothers an infant crying on the bench beside her.\nStanding at a corner of the desk is a docile, undersized boy\nof fifteen named JOHN \"PLATO\" CRAWFORD.  He is shivering.\nWith him is a large NEGRO WOMAN, his maid.  JIM comes\nthrough the doors and is led to the desk.  One of the\nofficers presents a brief report to the SERGEANT, who\nexamines it.\n\n<b>                         SERGEANT\n</b>            Mixed up in that beating on Twelfth\n            Street?\n\n<b>                         OFFICER\n</b>            No.  Plain drunkenness.\n\n<b>                         SERGEANT\n</b>            This says he was picked up there.\n\n<b>                         OFFICER\n</b>            They had him on the carpet for an\n            hour at Headquarters.  He's clear.\n            Plain drunkenness.\n\n<b>                         SERGEANT\n</b>            Young squirt.  All right--You want\n            to lean him against something?\n            Stand him over there.\n\nThe officer leads JIM to JUDY's bench and stands him against\nthe wall beside it.\n\nJIM is frisked, a look of prayer on his upturned face.  The\nOFFICER finds the toy monkey in his pocket and would take\nit, but when JIM asks to keep it, the OFFICER hands it back\nand moves away.  Another officer enters and leads the\nprisoner who is sitting next to JUDY into another room.  JIM\nsits beside her.  He smiles at her but receives only a\nchilling look.  He winds the monkey up and sets it dancing\non the floor, but she is not amused.  Camera pans to show\nothers reacting to the monkey with pleasure.  We see PLATO\nlook up and smile a little.  Camera stops on the MEXICAN\nCHILDREN who are smiling too.  A bald JUVENILE OFFICER named\nGENE, squats before them, smiling.\n\n<b>                         GENE\n</b>            You going to tell me your name now?\n\nThe little boy shakes his head.\n\n<b>                         LITTLE BOY\n</b>                   (touching GENE's bald pate)\n            Where's your hair?\n\n<b>                         GENE\n</b>            It's all gone.\n\n<b>                         LITTLE BOY\n</b>            Did you get a haircut?\n\n<b>                         GENE\n</b>            No--it just fell out!\n\n<b>                         LITTLE BOY\n</b>                   (sympathetically)\n            Aw--\n\nGENE laughs as another Juvenile Officer enters and pauses to\nlook at the children.  His name is RAY.\n\n<b>                         RAY\n</b>            What gang does he belong to?\n\n<b>                         GENE\n</b>            Give him a couple of years.\n\n<b>                         RAY\n</b>            Where's your mamma, honey?\n\n<b>                         LITTLE BOY\n</b>            I don't know.\n\nRAY and GENE exchange looks, then RAY moves across to JUDY--\ncamera following.  He looks down at her, consults the file\nin his hand.\n\n<b>                         RAY\n</b>            Judy--we're ready for you now.\n\n<b>                         JUDY\n</b>                   (a mumble)\n            He hates me.\n\n<b>                         RAY\n</b>            What?\n\n<b>                         JUDY\n</b>            He hates me.\n\nShe rises.  RAY leads her to one of the glass-walled offices.\nCamera moves with them.  JIM watches them go.\n\n<b>                         RAY\n</b>            What makes you think he hates you,\n            Judy?\n\n<b>                         JUDY\n</b>            I don't think.  I know.  He looks\n            at me like I'm the ugliest thing in\n            the world.  He doesn't like my\n            friends--he--\n\nRAY leads her into the office.\n\nInside small office as JUDY comes in, RAY following.  He\nindicates a chair for her while he sits down behind a desk.\n\n<b>                         JUDY\n</b>                   (continuing)\n            He doesn't like anything about me--\n            he calls me--he calls me--\n\nShe starts to cry.  She doesn't hide it, but keeps wiping\nthe tears with the palms of her hands.\n<b>                         RAY\n</b>            He makes you feel pretty unhappy?\n\n<b>                         JUDY\n</b>                   (crying)\n            He calls me a dirty tramp--my own\n            father!\n\n<b>                         RAY\n</b>            Do you think your father means that?\n\n<b>                         JUDY\n</b>            Yes!  I don't know!  I mean maybe\n            he doesn't mean it but he acts like\n            he does.  We're altogether and\n            we're going to celebrate Easter and\n            catch a double bill.  Big deal.  So\n            I put on my new dress and I came\n            out and he--\n\n<b>                         RAY\n</b>            That one?\n\n<b>                         JUDY\n</b>            Yes--he started yelling for a\n            handkerchief--screaming.  He\n            grabbed my face and he rubbed all\n            my lipstick off--he rubbed till I\n            thought I wouldn't have any lips\n            left.  And all the time yelling at\n            me--that thing--the thing I told\n            you he called me.  Then I ran out\n            of the house.\n\n<b>                         RAY\n</b>            Is that why you were wandering\n            around at one o'clock in the morning?\n\n<b>                         JUDY\n</b>            I was just talking a walk.  I tried\n            to call the kids but everybody was\n            out and I couldn't find them.  I\n            hate my life.  I just hate it.\n\n<b>                         RAY\n</b>            You weren't looking for company,\n            were you?\n\n<b>                         JUDY\n</b>            No.\n\n<b>                         RAY\n</b>            Did you stop to talk to anyone,\n            Judy?\n                   (she is silent)\n            Do you enjoy that?\n\n<b>                         JUDY\n</b>            No.  I don't even know why I do it.\n\n<b>                         RAY\n</b>            Do you think you can get back at\n            your Dad that way?  I mean\n            sometimes if we can't get as close\n            to somebody as we'd like we have to\n            try making them jealous--so they'll\n            have to pay attention.  Did you\n            ever think of that?\n\n<b>                         JUDY\n</b>            I'll never get close to anybody.\n\n<b>                         RAY\n</b>            Some kids stomped a man on Twelfth\n            Street, Judy.\n\n<b>                         JUDY\n</b>            You know where they picked me up!\n            Twelfth Street!  I wasn't even near\n            there!\n\n<b>                         RAY\n</b>            Would you like to go home if we can\n            arrange it?\n                   (no answer; to WOMAN OFFICER)\n            Did you notify the parents?\n\n<b>                         WOMAN OFFICER\n</b>            She wouldn't give me their number.\n\n<b>                         RAY\n</b>            What's your number, Judy?  We'll\n            see if your Dad will come and get you.\n\nJUDY looks up hopefully.\n\n<b>                         RAY\n</b>            Unless you really don't want to go\n            home.\n                   (silence)\n            Would you rather stay here?\n\nCamera moves close on JUDY.  She looks up and speaks very\nquietly.\n\n<b>                         JUDY\n</b>            Lexington 05549.\n\nThe wail of a siren is heard.  JUDY looks off through the\nglass wall toward JIM.  RAY is heard dialing.\n\nMed. shot.  JIM's bench.  JIM sits with his head back, eyes\nclosed.  As the siren mounts louder, JIM opens his mouth and\nimitates it--a long, forlorn wail.\n\nMed. shot, PLATO and NEGRO WOMAN.  PLATO smiles faintly and\nmoves out toward JIM, NEGRO WOMAN following.  Camera pans\nwith them.  PLATO sits by JIM.  She stands over them.  JIM's\nwailing continues.\n\nMed. shot.  JIM, PLATO, NEGRO WOMAN.  An OFFICER moves into\nshot.\n\n<b>                         OFFICER\n</b>            Hey!\n\nJIM continues for a moment.\n\n<b>                         OFFICER\n</b>                   (continuing)\n            Hey!  That's enough static out of you.\n\n<b>                         JIM\n</b>            Want me to imitate a stupid cop?\n\n<b>                         OFFICER\n</b>            Cut it out now.  I'm warning you.\n\n<b>                         JIM\n</b>            Yes, ma'am.\n\nThe OFFICER moves out.  The NEGRO WOMAN bends over PLATO who\nis shivering violently.\n\n<b>                         NEGRO WOMAN\n</b>            You shivering, John?  You cold?\n\nPLATO shakes his head.  JIM notices him.\n\n<b>                         JIM\n</b>            Want my jacket?\n\nPLATO looks up at JIM.\n\n<b>                         JIM\n</b>                   (continuing)\n            You want my jacket?  It's warm.\n\nPLATO wants it but shakes his head \"no.\"\n\nFull shot.  JUDY's office.  RAY and JUDY seated as before.\nJUDY is still gazing through the glass.\n\n<b>                         RAY\n</b>            Your mother will be down in a few\n            minutes, Judy--\n\n<b>                         JUDY\n</b>                   (clearing)\n            What?\n\n<b>                         RAY\n</b>            Your mother will be down in a few\n            minutes.\n\n<b>                         JUDY\n</b>                   (startled)\n            My mother?\n\nRAY signals to a WOMAN OFFICER just outside and leads JUDY\nto the door.\n\nOutside door as RAY turns JUDY over to the WOMAN OFFICER.\n\n<b>                         RAY\n</b>            She's being called for.\n\n<b>                         JUDY\n</b>            You said you'd call my father.\n\n<b>                         RAY\n</b>            Goodbye, Judy.  Take it easy.\n\nJUDY doesn't answer.  RAY goes back inside as camera leads\nthe WOMAN OFFICER and JUDY past JIM's bench.  Camera stops\non JIM, PLATO and the NEGRO WOMAN.  JIM stares at JUDY and\nwhistles but gets no reaction.  GENE enters and comes to the\n<b>NEGRO WOMAN.\n</b>\n<b>                         GENE\n</b>            John Crawford?\n\n<b>                         NEGRO WOMAN\n</b>            Yes, sir.\n\n<b>                         GENE\n</b>            Come with me, John.\n\nPLATO rises and goes with GENE, the NEGRO WOMAN following.\nJIM is alone.  He closes his eyes, throws his head back and\ngives another siren wail as camera moves close on his face.\n\n<b>                         MOTHER (O.S.)\n</b>            Jim!\n\nJIM looks up suddenly, scared.  Then he smiles mysteriously\nand staggers to his feet.\n\nLow angle.  Tight three.  JIM's parents and grandma framed\nin the doorway, frozen.  They are all dressed in evening\nclothes.  The MOTHER is a very chic but rather hard-faced\nwoman.  The FATHER is an unfeathered man.  The GRANDMA is\nthe smallest, also very chic and very bright-eyed.\n\nMed. shot.  JIM as he faces them.\n\n<b>                         JIM\n</b>            Happy Easter.\n\nTight shot.  The family.\n\n<b>                         MOTHER\n</b>            Where were you tonight?  They\n            called us at the club and I got the\n            fright of my life!\n\nSilence.\n\n<b>                         FATHER\n</b>            Where were you tonight, Jimbo?\n\nClose shot.  JIM.  He says nothing.\n\nClose shot.  FATHER laughing uncomfortably.\n\nMed. shot.  JIM.\n\n<b>                         JIM\n</b>            You think I'm funny?\n\nJIM turns suddenly and walks to the glass wall of the office\nbehind which PLATO, the NEGRO WOMAN and GENE are visible.\nHe looks through the glass partition which separates him\nfrom PLATO.\n\n<b>                         JIM\n</b>                   (continuing)\n            Why didn't you take my jacket?\n\nInside office.  JIM is seen through the glass.  He moves\naway.  PLATO is still shivering, cracking his knuckles.\n\n<b>                         GENE\n</b>            Do you know why you shot those\n            puppies, John?\n                   (silence)\n            Is that what they call you or do\n            you have a nickname?\n\n<b>                         PLATO\n</b>                   (a murmur)\n            Plato.\n\n<b>                         NEGRO WOMAN\n</b>            You talk to the man nice now, hear?\n            He's going to help you.\n\n<b>                         PLATO\n</b>            Nobody can help me.\n\n<b>                         GENE\n</b>            Can you tell me why you killed the\n            puppies, Plato?\n\n<b>                         PLATO\n</b>            No, sir.  I just went next door to\n            look at them like I always do.\n            They were nursing on their mother\n            and I did it.  I guess I'm just no\n            good?\n\n<b>                         GENE\n</b>            What do you think's going to\n            happen, you do things like that?\n\n<b>                         PLATO\n</b>            I don't know.  End up in the\n            electric chair?\n\n<b>                         GENE\n</b>            Where did you get the gun?\n\n<b>                         PLATO\n</b>            In my mother's drawer.\n\n<b>                         NEGRO WOMAN\n</b>            She keep it to protect herself, sir.\n            She scared without a man in the house.\n\n<b>                         GENE\n</b>            Where's your mother tonight, Plato?\n\n<b>                         PLATO\n</b>            She's away.\n\n<b>                         NEGRO WOMAN\n</b>            Seems like she's always going\n            somewhere.  She got a sister in\n            Chicago and she go for the holiday.\n            She says her sister is all the\n            family she has.\n<b>                         GENE\n</b>            Where's your father?\n\nPLATO is silent.\n\n<b>                         NEGRO WOMAN\n</b>            They not together, sir.  We don't\n            see him in a long time now.\n\n<b>                         GENE\n</b>            Do you hear from him, son?\n\nPLATO looks up as JIM and his family move into the next\noffice.  JIM smiles at PLATO, who returns it feebly, then\nlooks away--embarrassed.\n\n<b>                         GENE\n</b>            You know if the boy ever talked to\n            a psychiatrist?\n\n<b>                         PLATO\n</b>                   (smiling a bit)\n            Head-shrinker?\n\n<b>                         NEGRO WOMAN\n</b>                   (laughing)\n            Oh, Mrs. Crawford don't believe in\n            them!\n\n<b>                         GENE\n</b>            Well maybe she better start.\n\nOther office.  JIM, his parents, GRANDMA and RAY are\ngathered in the small room.  JIM is humming THE RIDE OF THE\nVALKRYIES to himself as if he had absolutely no interest in\nwhat is happening around him.  RAY suspects this is\nsomething more than mere disinterest, so lets the humming go\non, in order to discover its real purpose.  GRANDMA watches\neverything like a tennis match, reacting with soft little\nsounds of terror or astonishment or sympathy.  No one pays\nany attention to her.  For a moment no one talks.  RAY\nwatches JIM as he hums.  Then the FATHER shakes his head and\nlooks up.\n\n<b>                         FATHER\n</b>            I don't see what's so bad about\n            taking a little drink.\n\n<b>                         RAY\n</b>            You don't?\n\n<b>                         FATHER\n</b>            No.  I definitely don't.  I did the\n            sa--\n\n<b>                         RAY\n</b>            He's a minor, Mr. Stark, and it\n            looks to me like he had more than a\n            little drink.\n\n<b>                         FATHER\n</b>                   (chuckling)\n            Say, listen--\n\n<b>                         MOTHER\n</b>                   (to JIM: in intimate,\n                   half-humorous disapproval)\n            Jim--don't hum.\n\nJIM merely rolls his eyes at her, then away--but continues\nhis humming.\n\n<b>                         FATHER\n</b>            I guess I cut pretty loose in my\n            day too.\n\n<b>                         MOTHER\n</b>            Really, Frank?  When was that?\n\n<b>                         FATHER\n</b>            Listen--can't you wait till we get\n            home?\n\n<b>                         RAY\n</b>            Whoa!  Whoa!  I know you're a\n            little upset but--\n\n<b>                         FATHER\n</b>            Sorry.\n\n<b>                         RAY\n</b>            What about you, Jim?  Got anything\n            to say for yourself?\n\nJIM stops humming and shrugs.\n\n<b>                         RAY\n</b>            Not interested, huh?\n\nJIM shakes his head.\n\n<b>                         MOTHER\n</b>            Can't you answer?  What's the\n            matter with you anyhow?\n\n<b>                         FATHER\n</b>            He's just loaded, honey.\n\n<b>                         MOTHER\n</b>            I was talking to Jim.\n\n<b>                         FATHER\n</b>                   (to RAY)\n            Let me just explain to you--we just\n            moved here, y'understand?  The kid\n            has no friends yet and--\n\n<b>                         JIM\n</b>            Tell him why we moved here.\n\n<b>                         FATHER\n</b>            Hold it, Jim.\n\n<b>                         JIM\n</b>            You can't protect me.\n\n<b>                         FATHER\n</b>                   (to JIM)\n            You mind if I try?  You have to\n            slam the door in my face?\n                   (to RAY)\n            I try to get to him--what happens?\n                   (to JIM)\n            Don't I give you everything you\n            want?  A bicycle--you get a bicycle.\n            A car--\n\n<b>                         JIM\n</b>            You buy me many things.  Thank you.\n\n<b>                         FATHER\n</b>            Not just buy!  You hear all this\n            talk about not lovely your kids\n            enough.  We give you love and\n            affection, don't we?\n\nSilence; JIM is fighting his emotion but his eyes grow wet.\n\n<b>                         FATHER\n</b>            Then what is it?  I can't even\n            touch you anymore but you pull away.\n            I want to understand you.  Why'd\n            you get drunk?  You must have had a\n            reason.\n\nJIM stares straight ahead, trying not to listen.\n\n<b>                         FATHER\n</b>            Was it because we went to that\n            party?\n                   (silence)\n            You know what kind of drunken\n            brawls those parties turn into--\n            it's no place for kids.\n\n<b>                         MOTHER\n</b>            A minute ago you said you didn't\n            care if he drinks.\n\n<b>                         GRANDMA\n</b>            He said a little drink.\n\n<b>                         JIM\n</b>                   (exploding)\n            You're tearing me apart!\n\n<b>                         MOTHER\n</b>            What?\n\n<b>                         JIM\n</b>            Stop tearing me apart!  You say one\n            thing and he says another and then\n            everybody changes back--\n\n<b>                         MOTHER\n</b>            That's a fine way to behave!\n\n<b>                         GRANDMA\n</b>                   (smiling)\n            Well you know who he takes after!\n\n<b>                         RAY\n</b>            Outside, Jim.  Come outside.\n\nRAY pushes him out the door firmly, and into office vacated\nby PLATO and GENE.\n\n<b>                         RAY\n</b>            Excuse us a minute?\n\n<b>                         FATHER\n</b>                   (very overwrought)\n            Sure.  Sure.\n\nGENE's office.  RAY and JIM alone.\n\n<b>                         JIM\n</b>            Someone should put poison in her\n            epsom salts.\n\n<b>                         RAY\n</b>            Grandma?\n\nNo answer.  JIM turns away from RAY.\n\n<b>                         JIM\n</b>            Get lost.\n\n<b>                         RAY\n</b>            Hang loose, boy.  I'm warning you.\n\n<b>                         JIM\n</b>            Wash up and go home.\n\n<b>                         RAY\n</b>            Big tough character.  You don't kid\n            me, pal.  How come you're not\n            wearing your boots?\n\nSuddenly JIM flings himself at RAY who deftly flips him past\nand drops him near the desk.\n\n<b>                         RAY\n</b>                   (continuing)\n            Too bad you didn't connect.  You\n            could have gone to Juvenile Hall.\n            That's what you want, isn't it?\n\n<b>                         JIM\n</b>            No.\n\n<b>                         RAY\n</b>            Sure it is.  You want to bug us\n            till we have to lock you up.  Why?\n\n<b>                         JIM\n</b>            Leave me alone.\n\n<b>                         RAY\n</b>            No.\n\n<b>                         JIM\n</b>            I don't know why--!\n\n<b>                         RAY\n</b>            Go on--don't give me that.  Someone\n            giving you hard looks?\n\n<b>                         JIM\n</b>            I just get so--\n                   (fighting tears)\n            Boy, sometimes the temperature goes\n            way up.\n<b>                         RAY\n</b>                   (suddenly gentle)\n            Okay.  Okay.  Let it out.\n\nJIM starts crying.\n\n<b>                         RAY\n</b>            You feel like you want to blow your\n            wheels right now?\n\n<b>                         JIM\n</b>            All the time!  I don't know what\n            gets into me--but I keep looking\n            for trouble and I always--I swear\n            you better lock me up.  I'm going\n            to smash somebody--I know it.\n\n<b>                         RAY\n</b>            Try the desk.\n\nJIM smashes his fist against it, letting loose for a moment.\nRAY watches, then sits near him.\n\n<b>                         RAY\n</b>            That why you moved from the last\n            town? 'Cause you were in trouble?\n            You can talk about it if you want\n            to--I know about it anyway.\n            Routine check.\n\n<b>                         JIM\n</b>            And they think they are protecting\n            my by moving.\n\n<b>                         RAY\n</b>            You were getting a good start in\n            the wrong direction back there.\n            Why did you do it?\n\n<b>                         JIM\n</b>            Mess that kid up?\n\nRAY just nods.\n\n<b>                         JIM\n</b>                   (continuing)\n            He called me chicken.\n\n<b>                         RAY\n</b>            And your folks didn't understand?\n\n<b>                         JIM\n</b>            They never do.\n\n<b>                         RAY\n</b>            So then you moved?\n\n<b>                         JIM\n</b>            They think I'll make friends if we\n            move.  Just move and everything'll\n            be roses and sunshine.\n\n<b>                         RAY\n</b>            But you don't think that's a solution.\n\nJIM is silent; he picks at his nails.\n\n<b>                         RAY\n</b>                   (continuing)\n            Things pretty tough for you at home?\n\n<b>                         JIM\n</b>            She eats him alive and he takes it.\n\nJIM stares at his family through hole in door.\n\n<b>                         JIM\n</b>            What a zoo!\n\n<b>                         RAY\n</b>            What?\n\n<b>                         JIM\n</b>            A zoo.  He always wants to be my\n            pal, you know?  But how can I give\n            him anything when he's--I mean I\n            love him and I don't want to hurt\n            him--but I don't know what to do\n            anymore except maybe die.\n\n<b>                         RAY\n</b>            Pretty mixed up?\n\n<b>                         JIM\n</b>            If he could--\n\n<b>                         RAY\n</b>            \"If he could\" what?  You mean your\n            father?\n\n<b>                         JIM\n</b>            I mean if he had the guts to knock\n            Mom cold once I bet she'd be happy\n            and I bet she'd stop picking.  They\n            make mush out of him.  Just mush.\n            One thing I know is I never want to\n            be like him.\n\n<b>                         RAY\n</b>                   (interrupts)\n            Chicken?\n\n<b>                         JIM\n</b>            I bet you see right through me,\n            don't you?\n\nRAY shrugs.\n\n<b>                         JIM\n</b>            How can anyone grow up in this circus?\n\n<b>                         RAY\n</b>            You got me, Jim--but they do.  Want\n            some water?\n\n<b>                         JIM\n</b>                   (as RAY gets a cup of\n                   water from cooler)\n            Boy--if I had one day when I didn't\n            have to be all confused and ashamed\n            of everything--or I felt I belonged\n            some place.\n\n<b>                         RAY\n</b>                   (giving him water)\n            Here.  Look, will you do something\n            for me?  If the pot starts boiling\n            again, will you come and see me\n            before you get yourself in a jam?\n            Even if you just want to talk--come\n            in and shoot the breeze.  It's\n            easier sometimes than talking to\n            your folks.\n\n<b>                         JIM\n</b>            Okay--\n\n<b>                         RAY\n</b>            Any time--day or night.  You calmed\n            down enough to go back now?\n\n<b>                         JIM\n</b>                   (smiling)\n            You serious?\n\nRAY smiles and opens the door.\n\nRAY's office as JIM comes towards his MOTHER and forces\nhimself to kiss her.\n\n<b>                         JIM\n</b>            I'm sorry.\n\n<b>                         MOTHER\n</b>            All right, darling.\n\nShe rises and takes his arm.  They start out through the\ndoor into the hall, followed by GRANDMA and FATHER.\n\n<b>                         GRANDMA\n</b>                   (to RAY)\n            This was all very unfortunate, but\n            he made a mistake and he's sorry--\n            so we're not going to have any more\n            trouble.  He's always been a lovely\n            boy--\n\n<b>                         JIM\n</b>            Lovely!  Grandma--if you tell\n            another lie you're going to turn to\n            stone.\n\n<b>                         RAY\n</b>            Luck, Jim.  Don't forget.\n\n<b>                         FATHER\n</b>                   (offering RAY three cigars)\n            Have some cigars.\n\n<b>                         RAY\n</b>            No thanks, I don't smoke.\n\n<b>                         FATHER\n</b>            Go on--Give 'em to your friends.\n\n<b>                         RAY\n</b>            No--thanks, very much, Mr. Stark.\n\n<b>                         MOTHER\n</b>            Frank--he doesn't want any.\n\nJIM grins at RAY who nods.  They all leave.  RAY looking\nafter them, shakes his head and lights a cigarette.  We see\nJIM and his family pass through the main door.  Waiting to\nenter, in the custody of some uniformed police, are BUZZ and\nthe kids we saw at the opening, sullen and truculent.  As\nthey march into the lobby and JIM grows smaller in the\ndistance, the music comes up and out.\n\n<b>                                            FADE OUT.\n</b>\n<b>FADE IN.\n</b>\nLow angle.  Alley.  Morning.  A rabbit comes running down\nthe alley followed by a group of young kids, screaming with\npleasure.\n\nAs camera pans with the group, the littlest, a boy of five,\nstops near us looking after the disappearing group.  The\nshouts of the children wane.\n\nJUDY rushes out from a backyard beyond him.  She is carrying\nschool books and a bag lunch.  She wears a polo coat against\nthe winter wind.\n\n<b>                         JUDY\n</b>                   (yelling)\n            Beau!\n\nThe boy, who is her brother, BEAU, looks up but doesn't move.\nJUDY stops at her gate.  A car careens down the alley, past\nhim.\n\nLong shot.  JUDY and BEAU seen through a window in JIM's\nhouse.  JIM is in f.g. looking out through the curtains.  He\nsmiles.\n\n<b>                         JUDY\n</b>                   (yelling)\n            What are you trying to do, get\n            yourself killed?\n\n<b>                         BEAU\n</b>                   (laughing)\n            Yes!\n\n<b>                         MOTHER (O.S.)\n</b>            Your eggs are on the table, dear.\n\nJIM turns from window and passes camera.\n\nFull shot JIM's dining room.  The MOTHER is just settling a\nplate of eggs at JIM's place.  They FATHER is seated,\ndrinking coffee and looking at the newspaper.  GRANDMA comes\nin from kitchen.  JIM is neatly dressed in tie, tweed jacket\nand slacks.\n\n<b>                         MOTHER\n</b>                   (continuing)\n            Sit down and eat--you'll be late.\n\n<b>                         JIM\n</b>                   (approaching table)\n            It'd stick in my throat, Mom.  I'm\n            nervous or something--\n\n<b>                         GRANDMA\n</b>            It's a wonder we don't all have TB\n            or some other terrible disease\n            after living in all those smokey\n            cities!\n\n<b>                         MOTHER\n</b>            Well, drink your milk anyhow.\n\n<b>                         GRANDMA\n</b>                   (muttering)\n            There aren't so many factories here.\n\n<b>                         FATHER\n</b>            Mother--\n\n<b>                         JIM\n</b>                   (still standing; he drinks)\n            You make any sandwiches?\n\n<b>                         FATHER\n</b>            My first day of school, mother'd\n            make me eat and by golly I could\n            never even swallow till recess--\n\n<b>                         MOTHER\n</b>                   (bringing bag of\n                   lunch from buffet)\n            There's nothing to be nervous about.\n            Here's peanut butter and meat loaf--\n\nJIM makes a mouth-stuck-together-with-peanut-butter sound.\n\n<b>                         GRANDMA\n</b>            What did I tell you?  Peanut butter!\n\n<b>                         MOTHER\n</b>            Well, there's a thermos of orange\n            juice and some apple-sauce cake in\n            the wax paper to wash it down.\n\n<b>                         GRANDMA\n</b>            I baked that!\n\n<b>                         JIM\n</b>                   (kisses her cheek)\n            'Bye, Mom.\n\n<b>                         MOTHER\n</b>            Goodbye, dear.\n\n<b>                         FATHER\n</b>                   (rising)\n            So long, young fella.  Knock 'em\n            dead, like your old man used to!\n\n<b>                         JIM\n</b>            Sure--\n                   (gets to door and turns)\n            You know something?  I have a\n            feeling we're going to stay here.\n\n<b>                         FATHER\n</b>            And listen--watch out about the\n            pals you choose--Know what I mean?\n            Don't let them choose you--\n\nBut JIM is on his way out.\n\nFull shot.  JIM's backyard as JIM comes out of the kitchen\ndoor into the early sunshine.\n\n<b>                         JUDY (O.S.)\n</b>            Come out of the alley, Beau!  This\n            is the last time I'm going to call\n            you.\n\nJIM blinks, pauses and sees JUDY.  He takes off his tie and\nputs it in his pocket.  Then he starts across the backyard,\ncamera panning with him to:\n\nFull shot.  The Alley with JIM coming out his gate, JUDY and\nBEAU visible beyond.  He stops again.\n\n<b>                         JUDY\n</b>            Beau!  All right--go to school alone!\n\nShe starts down the alley.  BEAU skips after her and starts\ntightrope-walking the gutter gravel.\n\n<b>                         JIM\n</b>                   (calling)\n            Hey!\n\nJUDY glances at him briefly, but continues.  JIM follows a\nfew yards, but on his side of the alley.\n\n<b>                         JIM\n</b>                   (continuing)\n            Hey, didn't I see you before some\n            place?\n\nJUDY ignores him, but something self-conscious happens to\nher walk.  JIM runs across the alley.\n\nMed. shot.  JUDY stopping as JIM enters.  BEAU tight-rope\nwalking on down the hill.\n\n<b>                         JIM\n</b>            Hi.  I saw you before.\n\n<b>                         JUDY\n</b>            Bully for you.\n\n<b>                         JIM\n</b>            You don't have to be unfriendly.\n\n<b>                         JUDY\n</b>            Now that's true!\n\n<b>                         JIM\n</b>                   (smiling)\n            See?\n\n<b>                         JUDY\n</b>            \"Life is crushing in on me.\"\n\n<b>                         JIM\n</b>                   (smiling)\n            \"Life can be beautiful.\" Hey, I\n            know where it was.\n\n<b>                         JUDY\n</b>            Where what was.\n\n<b>                         JIM\n</b>            Where I saw you.\n                   (no answer)\n            Everything going okay now?\n                   (no answer)\n            You live around here?\n\n<b>                         JUDY\n</b>                   (relieved)\n            Who lives?\n\n<b>                         JIM\n</b>            See, I'm new.\n\n<b>                         JUDY\n</b>            Won't mother be proud.\n\n<b>                         JIM\n</b>            You're really flipped--aren't you.\n\nJUDY looks up a little surprised.\n\n<b>                         JIM\n</b>                   (continuing)\n            Where's Dawson High School?\n\n<b>                         JUDY\n</b>            You going there?\n\n<b>                         JIM\n</b>            Yeah--why--\n\n<b>                         JUDY\n</b>            Dig the square wardrobe!\n\n<b>                         JIM\n</b>                   (defensively)\n            Yeah.  So where's the high school?\n\n<b>                         JUDY\n</b>                   (softer)\n            University and 10th--Want to carry\n            my books?\n\nAn auto horn, stuck, in the distance.\n\n<b>                         JIM\n</b>            I was just getting my car.  I could\n            take you.\n\nThe horn approaches, loud.\n\n<b>                         JUDY\n</b>            The kids take me.\n\n<b>                         JIM\n</b>            Oh.\n\nAnother angle.  JIM and JUDY as the car, horn blowing,\nwheels into view above them and comes careening into the\nalley.  JUDY sees it and moves a step away from JIM.\n\n<b>                         JUDY\n</b>            I'll bet you're a real yo yo.\n\n<b>                         JIM\n</b>            A what?\n\n<b>                         JUDY\n</b>                   (yelling over horn)\n            Goodbye!  See you!\n\n<b>                         JIM\n</b>                   (yelling)\n            I'm not so bad.\n\nJUDY is moving toward the car.\n\nMed. shot.  Car full of kids as it comes to a jolting stop\nnear JUDY.  The boys wear suede coats, leather jackets,\nblack peggers, boots.  Their clothing is not uniform--it is\nthe air they assume which is uniform: swaggering, self-\nconscious, piratical.  Someone is always combing his hair.\n\nThe driver is BUZZ, whom we recognize as the leader of the\nstomp gang we met on Easter.  He wears a leather jacket.\nWith him are CHICK, a slight bespectacled lad; CRUNCH,\nBUZZ's first lieutenant; COOKIE, a hanger-on; GOON, a\ncharacter; and the girls HELEN and MILLIE.  The kids are\nscreaming as BUZZ jams on the brakes.  JUDY comes forward.\nJIM hangs back.\n\n<b>                         BUZZ\n</b>            Stella-a-a-a!\n\nJUDY comes to them quickly, smiling.\n\n<b>                         JUDY\n</b>            Steady Marlon!\n\n<b>                         BUZZ\n</b>            Wanna make the colored lights go\n            around and around?\n\nJUDY and BUZZ kiss ardently and without love.  JIM goes for\nhis car.\n\n<b>                         BUZZ\n</b>                   (looks after JIM then\n                   at JUDY)\n            What's that?\n\n<b>                         JUDY\n</b>            A new disease.\n\n<b>                         BUZZ\n</b>                   (a little suspicious)\n            Friend of yours?\n\n<b>                         JUDY\n</b>            I'm glad they let you out.\n\n<b>                         BUZZ\n</b>            Nobody chickened.\n\n<b>                         JUDY\n</b>            I heard about it.  You're lucky he\n            lived.\n\n<b>                         BUZZ\n</b>            They always live.\n\nDuring this JIM has gotten his car and has driven up.\n\n<b>                         JIM\n</b>            Where's University and 10th?\n<b>                         JUDY\n</b>                   (pointing right)\n            That way!\n\n<b>                         CHICK\n</b>                   (pointing left)\n            That way!\n\n<b>                         BUZZ\n</b>                   (pointing up)\n            That way!\n\nSimultaneously, the kids laugh wildly.  The radio blares.\nJUDy lays her head on BUZZ's shoulder and his arm goes\naround her as the car zooms away.  JIM looks after them a\nmoment, then follows.\n\n<b>                                            DISSOLVE TO:\n</b>\nClose shot.  Bicycle rack.  Wheels spin in, one after\nanother and drive straight into their slots.  As the nearest\nbike moves in:\n\nMed. shot.  PLATO just getting off his motor scooter.  He\ncomes forward, passes camera which pans with him then\nstops--as the school is suddenly revealed.  Music starts\nwith a crash and keeps mounting through the following.\nPLATO sighs and moves away from us to join the parade of\nstudents filling the Main approach.\n\nParking lot as cars scream into their places noisily.  JIM\ngets out of one and comes forward.  A motorcycle roars by,\njust missing him.  JIM stares off and starts to move as\ncamera pans with him to:\n\nAnother angle.  School.  Another crash of music.  JIM moves\ntoward the parade.\n\nFull shot.  Mid-way down main approach.  A number of kids\npass, gossiping happily as they greet each other for the\nfirst time since vacation.  Camera searches over them and\nstops upon our special group moving toward us--BUZZ, JUDY\nand the rest, all abreast.  Others must park at their\npassage or be elbowed out of the way, staring resentfully,\nbut not daring to challenge the group's priority.  PLATO\nruns forward, past them.\n\nDoor from within bouncing from hand to hand as students\nenter.  PLATO moves through the door and disappears in a\nmilling of kids.  JUDY enters with her group and moves on\nwith them.\n\nMed. shot.  Monitor (inside corridor).  The Monitor is an\nathletic letter-sweater boy with an arm brassard that bears\nthe letters \"HC\".  Kids pour past him.  JIM enters.\n\n<b>                         JIM\n</b>            Hi--can you tell we where I go?\n            I'm just starting here.\n\n<b>                         MONITOR\n</b>                   (pointing at brassard)\n            Mr. Bassett's office--203.  He'll\n            tell you where your home room is--\n\n<b>                         JIM\n</b>            Thanks a lot.\n\nJIM moves out.\n\nAngle shot.  Corridor.  Shooting past a row of steel lockers.\nThe clash and slam of doors as kids throw in coats, pull out\nbooks and primp for the day ahead.  PLATO comes to his\nlocker, which is the nearest, and opens it.\n\nFull shot.  Corridor.  JIM moves toward us from the distance.\nCrowded at the entrance to a classroom in f.g. are JUDY and\nher pals.  They are sneaking a smoke, passing the cigarette\nfrom one cupped hand to another.  As JIM comes near, JUDY\nsees him.  So do the others.  They fold their arms across\ntheir chests and whistle \"We are the girls of the\ninstitute\"--all but JUDY.  JIM glances at her and continues\non past camera.  A bell starts ringing crazily over the music.\n\nClose shot.  PLATO.  He is straightening his tie in the\nmirror.  Above it, pasted to the locker door, is a still of\nAlan Ladd.  In the mirror we can see JIM moving past.  PLATO\nsees him too.  He wheels around and stares.\n\n<b>                         PLATO\n</b>                   (to himself)\n            Hi.\n\nThe strident music of the students diminishes.  The ringing\nof the bell stops.  There remain only JIM's footsteps.\n\nLong shot.  JIM moving off down the corridor.  PLATO is in\nf.g. looking after him.  He slams his locker and starts\nafter JIM, moving at the same speed and hovering near the\nwall.  The footsteps of the two boys echo stonily.  They are\nalone.  JIM stops at a bulletin board near a bend in the\ncorridor.  PLATO stops too.\n\nBulletin board.  JIM looking at the notices.  PLATO drifts\nin several yards away and hangs near the wall watching JIM\nwho doesn't see him.  JIM reads:\n\nInsert: Bulletin board, \"Attention All Juniors and Seniors\"--\nPlanetarium field trip--2 pm--Sharp!\"\n\nAnother angle.  JIM and PLATO as JIM turns from bulletin\nboard and starts away.\n\n<b>                         PLATO\n</b>                   (clearing his throat)\n            Hi.\n\n<b>                         JIM\n</b>            Hi there.\n\n<b>                         PLATO\n</b>            You remember me?\n\n<b>                         JIM\n</b>            No.  I don't think so--\n\n<b>                         PLATO\n</b>            I'm sorry--I made a mistake.\n\nJIM starts toward camera as PLATO after another look, turns\nin the opposite direction and walks away from us, smashing\nhis fist against the wall as he goes.  JIM stops, full in\ncamera.  His face clouds, trying to remember.  He turns full\naround to look after PLATO, then turns back and continues on\nhis way.  The footsteps fade.\n\n<b>                                            DISSOLVE TO:\n</b>\nFull shot.  Planetarium seen from the parking lot--a great\ndome crowns it--the city lies below.  Camera picks up JIM's\ncar maneuvering through the crowded lot.  In b.g. a few\nother late-comers are dashing up steps to Planetarium.  JIM\ndrives into a small lot behind observator, parks, then runs\nto observatory entrance.\n\nFull shot.  Lobby as JIM runs through, opens door of theater\nand passes inside.\n\nLong shot.  Sky full of stars seen past JIM's head.\nDarkness.  This is not our sky.  It is a replica of it\nprojected onto the dome of the Planetarium.  The stars slide\ntheir tentative ways in an ever-changing pattern.  One of\nthem is much larger than the rest and increases in size as\nwe watch.  Music of the spheres is heard--a high threatening\ntremolo.\n\n<b>                         LECTURER (O.S.)\n</b>            For many days before the end of our\n            earth people will look into the\n            night sky and notice a star,\n            increasingly bright and increasingly\n            near.\n\nJIM looks around for a seat and passes down aisle.  Seen\nbeyond him is the projector, moving slowly, its great dumb-\nbell head sparkling with pin-points of light.  JIM takes a\nseat in front row.  PLATO, in the row behind him, moves over\na seat to be nearer.  They exchange looks.\n\nFull shot.  Normal students watching intently.\n\n<b>                         LECTURER (O.S.)\n</b>            As this star approaches us, the\n            weather will change.  The great\n            polar fields of the north and south\n            will rot and divide, and the seas\n            will turn warmer.\n\nLow angle.  LECTURER.  A dry, elderly man in a stiff white\ncollar.  He is seated at a desk, the light from the reading\nlamp spilling upward onto his face.\n\n<b>                         LECTURER\n</b>            The last of us search the heavens\n            and stand amazed.  For the stars\n            will still be there, moving through\n            their ancient rhythms.\n\nAngle shot.  Students.  Some watching, some taking notes.\nAn OLD LADY TEACHER in f.g. taps the heads of two kids in\nthe row before her.  They stop their whispering.  She smiles\nat them.\n\n<b>                         LECTURER (O.S.)\n</b>            The familiar constellations that\n            illuminate our night will seem as\n            they have always seemed, eternal,\n            unchanged and little moved by the\n            shortness of time between our\n            planet's birth and its demise.\n\nMed. shot.  PLATO staring upward.\n\n<b>                         LECTURER (O.S.)\n</b>            Orion, the Hunter.\n\nPLATO looks off.\n\nMed. shot.  JIM (from PLATO's angle).  JIM is seated in the\nrow ahead of PLATO.  His lips are parted as he looks up.\n\n<b>                         JIM\n</b>            Boy!\n\n<b>                         PLATO\n</b>                   (leaning forward)\n            What?\n\n<b>                         JIM\n</b>                   (surprised)\n            Once you been up there, you know\n            you been some place!\n\n<b>                         LECTURER (O.S.)\n</b>            Gemini, the Twins.\n\nTwo shot.  JUDY and BUZZ.  BUZZ has his arm around her.  He\nis nuzzling her ear.  She is blandly watching the dome.\n\n<b>                         LECTURER (O.S.)\n</b>                   (continuing)\n            Cancer, the Crab.\n\nBUZZ pokes JUDY who looks at him.  He curves his wrist\ntoward her, opening and closing his first two fingers like\nthe pincers of a crab.\n\n<b>                         BUZZ\n</b>            I'm a crab!\n\nShe laughs.  So do the others.\n\nMed. shot. JIM (PLATO behind).  Seen from JUDY's angle.  JIM\nturns at the sound of the laughter, and smiles.\n\n<b>                         LECTURER (O.S.)\n</b>            Taurus, the Bull.\n\n<b>                         JIM\n</b>                   (in good imitation)\n            Moo!\n\nHe waits for approval.\n\nAngle shot.  JUDY, BUZZ and group (seen from JIM's angle).\nHe is in f.g.  They are staring at him.  Nobody laughs.\n\n<b>                         CRUNCH\n</b>                   (flat)\n            Yeah, moo.\n\n<b>                         BUZZ\n</b>            Moo.  That's real cute.  Moo.\n\n<b>                         GOON\n</b>            Hey, he's real rough--\n\n<b>                         CRUNCH\n</b>            I bet he fights with cows.\n\n<b>                         BUZZ\n</b>            Moo.\n\nThey turn from him.  JIM withers and looks front.  JUDY\nsmiles a little and looks away so the others cannot notice\nher amusement.\n\n<b>                         LECTURER (O.S.)\n</b>            Sagittarius and Aries--all as they\n            have ever been.\n\nPLATO leans in and touches JIM's shoulder, lightly at first,\nthen harder.  JIM turns to him.\n\n<b>                         PLATO\n</b>            You shouldn't monkey with him.\n\n<b>                         JIM\n</b>            What?\n\n<b>                         PLATO\n</b>            He's a wheel.  So's she.  It's hard\n            to make friends with them.\n\n<b>                         JIM\n</b>            I don't want to make friends.\n\nHe turns back, unhappy at having revealed himself.\n\nAnother shot.  JUDY, BUZZ, CRUNCH.  JIM seen in b.g.  The\nkids are whispering among themselves and pointing at JIM,\nwho looks up and notices.  He is getting uncomfortable.\n\n<b>                         LECTURER (O.S.)\n</b>            And while the flash of our\n            beginning has not yet traveled the\n            light years into distance--\n\nFull shot.  The dome.  The star rushes nearer, looming\nlarger and larger.  The music rises in tension and volume.\n\n<b>                         LECTURER (O.S.)\n</b>            Has not yet been seen by planets\n            deep within the other galaxies, we\n            will disappear into the blackness\n            of the space from which we came.\n\nTwo shot.  JIM and PLATO staring upward, cringing back into\ntheir seats as the light on their faces increases.  Music is\nup loud.\n\nFull shot.  The dome seen past PLATO's head.  The heavens\ngrow brighter as the star plummets near.  Music at crescendo.\n\n<b>                         LECTURER (O.S.)\n</b>            Destroyed as we began in a burst of\n            gas and fire.\n\nThe sky is blasted by a wild flash of light.  Music reaches\nexplosion.  The stars appear again.\n\nMoving shot.  Faces of normal kids watching seriously--very\nimpressed.\n\n<b>                         LECTURER (O.S.)\n</b>                   (continuing)\n            The heavens are still and cold once\n            more.  In all the complexity of our\n            universe and the galaxies beyond,\n            the Earth will not be missed.\n\nMed. shot.  JIM and PLATO looking up.\n\n<b>                         LECTURER (O.S.)\n</b>            Through the infinite reaches of\n            space, the problems of Man seem\n            trivial and naive indeed.  And Man,\n            existing alone, seems to be an\n            episode of little consequences.\n\nPLATO ducks his head down on the back of JIM's chair.  JIM\nlooks at him.\n\n<b>                         LECTURER (O.S.)\n</b>            That's all.  Thank you very much.\n\nThe lights go on.  The rustle and confusion of kids\nstretching after sitting too long.  Scattered applause.  JIM\nrises and ruffles PLATO's hair.\n\n<b>                         JIM\n</b>            Hey, it's over.  The world ended.\n\nPLATO looks up at him.\n\n<b>                         PLATO\n</b>            What does he know about Man alone?\n\nMed. shot.  LECTURER as he reaches over and turns a dial.\n\"Morning Song\" by Grieg comes on softly.\nLow angle.  OLD LADY TEACHER rising.  She stares around at\nthe bustling students and claps her hands sharply, but the\nnoise is barely heard above the tumult.\n\n<b>                         TEACHER\n</b>                   (shrill)\n            May I have your attention?  May I\n            please have your attention?\n            Classes will meet at the busses\n            outside.  May I have your attention?\n                   (to herself)\n            The heck with it.\n\nShe picks up her coat and bag.\n\nPlanetarium parking lot.  School busses and autos, some new\nand some heaps, are parked in f.g.  Beyond is the dome of\nthe Planetarium.  Kids mill about, some already driving off\nin their cars.  One bus, already full, pulls past camera.\n\nMed. shot.  Front of bus seen from within.  Driver in f.g.\nKids swarm up the steps and enter.  PLATO is among them, but\nkeeps looking back for JIM.  PLATO boards the bus and pauses\nnear the driver to peer through windshield.  His face clouds.\n\nLong shot.  JUDY and group.  Seen from PLATO's angle through\nwindshield.  They are standing idly in a loose line near\nBUZZ's car.  They are looking back toward Planetarium.\n\nMed. shot.  Front of bus, seen from within.  PLATO turns\nsuddenly and pushes his way past the kids who are boarding.\n\n<b>                         PLATO\n</b>            Excuse me.  Excuse me.\n\nFull shot.  Parking lot.  Bus in f.g.  Beyond it JUDY and\nthe group are visible.  PLATO squeezes out.\n\n<b>                         MALE TEACHER\n</b>            John, where you going?\n\n<b>                         PLATO\n</b>            I forgot something.  I'll get a hitch.\n\nPLATO moves quickly past the teacher who climbs in.  The\ndoor slams, the bus moves away.  PLATO stops and looks after\nit.  The last cars are clearing the lot.  Only JIM's and\nBUZZ's remain.  PLATO looks at the small, waiting group.\n\nMed. shot.  The group seen from the rear.  PLATO in the\ndistance facing them.\n\n<b>                         BUZZ\n</b>            What you looking at?\n\nMed. shot.  PLATO wild-eyed with fear.\n\n<b>                         PLATO\n</b>            Nothing.\n\nHe runs off, camera panning with him.  His goal is the\nPlanetarium Entrance, visible beyond.  He races toward it\nfrantically.\n\nMed. shot.  The group looking off after PLATO.  BUZZ,\nnearest camera, pulls a switch-knife from his pocket and\npops the long blade open.  JUDY stares at it, then looks up\nat BUZZ apprehensively.  CRUNCH sits down on the bumper and\nlights a cigarette.\n\nDisplay lobby.  Planetarium as PLATO rushes in, out of\nbreath, stops and looks around.  In distance he sees JIM\nleaning over the pendulum pit, smoking quietly.  PLATO\ndoesn't move.  JIM hasn't even looked up.\n\n<b>                         PLATO\n</b>                   (screaming as if he\n                   were yelling \"fire!\")\n            What's your name!\n\n<b>                         JIM\n</b>            Jim.  What's yours?\n\n<b>                         PLATO\n</b>                   (a little quieter)\n            Plato.  It's a nickname.\n\nJIM nods.  PLATO goes over to him, camera following, until\nthey are close together, both leaning over the rail.\n\n<b>                         PLATO\n</b>            Listen, I told you not to fool with\n            them.  Now they're waiting for you.\n\n<b>                         JIM\n</b>            I know.  That's why I came back.\n\n<b>                         PLATO\n</b>            You scared?\n\n<b>                         JIM\n</b>            I just don't want trouble.\n\n<b>                         PLATO\n</b>            He has a knife.\n\n<b>                         JIM\n</b>            I saw it.  Gee, look at that thing\n            swing, will you?  Do you think it\n            never stops?\n\n<b>                         PLATO\n</b>            No.  It's perpetual motion.\n\n<b>                         JIM\n</b>            Oh, I bet some little guy comes in\n            here at night and pushes it.  Go-\n            go-go!\n\nPLATO walks cautiously to the door and starts outside,\ncamera following.\n\nLong shot.  Kids (corner of Observatory) with PLATO leaning\nout of door, seeing them, pulling back quickly.\n\nInside display lobby as PLATO pulls back through the door.\nJIM seems to have disappeared.  PLATO stares around frightened.\n\n<b>                         PLATO\n</b>            Jim?\n\nJIM is looking at another exhibit whose mechanical voice is\nheard.\n\n<b>                         JIM\n</b>            I'm here.\n\n<b>                         PLATO\n</b>                   (coming with him)\n            They're still there!\n\nJIM nods.  They watch the exhibit a while longer.\n\n<b>                         PLATO\n</b>            Jim--Do you think when the end of\n            the world comes it'll be at night?\n\n<b>                         JIM\n</b>            No.  In the morning.\n\nPLATO looks up questioning.  JIM smiles and shrugs.\n\n<b>                         JIM\n</b>            I just have a feeling.\n\nThey start moving, camera leading.\n\n<b>                         PLATO\n</b>            If you don't want trouble, I know a\n            place we can go--\n\nJIM looks up at him.\n\n<b>                         PLATO\n</b>            It's a big mansion and we could\n            sneak around there and they\n            wouldn't even know.  You could be\n            safe--\n\nThey turn a corner quickly.\n\nDoors to balcony (from inside) as JIM and PLATO come to them\nfrom behind camera, fling the doors open and step outside.\n\nBalcony as JIM and PLATO come onto it, lean on the parapet.\nPLATO points off.\n\n<b>                         PLATO\n</b>            There it is.\n\nHigh long shot.  Mansion. (Matte).  It is falling into\nelegant ruin, casting long afternoon shadows on the great\nlawns and promenades.\n\nCloseup PLATO looking urgently at JIM.\n\n<b>                         PLATO\n</b>            Should we go?\n\nTwo shot.  JIM and PLATO.  PLATO's back is to us.  JIM looks\npast him and sees something.\n\n<b>                         JIM\n</b>                   (quietly)\n            The shadows are getting long.\n\nPLATO turns to look too.\n\nLong high shot.  Parking lot.  JIM's car is where he left it.\nInto the driveway, like logs driven before a sea, the\nshadows of the waiting kids appear and advance until the\nkids themselves come into view.  They pause there a moment,\nthen look up.\n\n<b>                         HELEN\n</b>                   (smiling)\n            Le soleil tombe dans la mer.\n\nLaughter.  The kids scatter along the wall at the foot of\nthe balcony stairs.  BUZZ goes to JIM's car, knife in hand,\nand stands silently.\n\nLow angle.  Two shot.  JIM and PLATO staring down from\nbalcony parapet.  At last JIM moves out past camera.\n\nLow angle.  Long shot.  JIM and PLATO.  JUDY in f.g.  The\ntwo boys walk down the stairs.  Camera pans with them as\nthey reach parking lot level and start walking past other\nmembers of the group.\n\nTraveling shot.  JIM and PLATO coming forward.\n\nDolly shot.  BUZZ from JIM's angle.  As camera moves in\ntoward BUZZ standing alone at the car, he suddenly bends\ndown and slashes JIM's tire.  Camera stops.  There is the\nhiss of air escaping.  BUZZ straightens and smiles past camera.\n\nClose shot.  JIM inhaling sharply in shock and suppressed\nanger.\n\nFull shot over JIM's car.  Group in b.g. motionless.  JIM\nand PLATO approach the car.  JIM stops and looks down.  BUZZ\nstands smiling and puts away the knife.\n\nClose shot.  Rear wheel.  The tire slashed, the wheel rests\non the ground.\n\nFull shot.  Car.  Shooting between group and BUZZ toward\nbacks of JIM and PLATO, who are looking down at car which\nrests on its rims.  JIM turns and moves toward group.  He\nstops, looks from one to the other and smiles nervously.\nThen he looks straight at BUZZ.\n\n<b>                         JIM\n</b>                   (wearily)\n            You know something?\n\n<b>                         BUZZ\n</b>            What?\n\n<b>                         JIM\n</b>                   (reproachfully)\n            You watch too much television.\n\nMed. shot.  The group and JIM.  JUDY has come to BUZZ,\nstands on the wall above him.\n\n<b>                         BUZZ\n</b>            Hey, he's real abstract and different.\n\n<b>                         JIM\n</b>            I'm cute, too.\n\nSuddenly GOON starts clucking softly like a chicken.  One by\none the others pick it up.  BUZZ, the last, crows.  Silence.\n\nMed. shot.  The group and JIM.\n\n<b>                         JIM\n</b>            Meaning me?\n\n<b>                         BUZZ\n</b>            What?\n\n<b>                         JIM\n</b>            Chicken?\n\nThe group gives a quick, short laugh.\n\nMed. shot.  JIM as he takes off his glasses, smiles.  Shakes\nhis head disapprovingly.\n\n<b>                         JIM\n</b>            You shouldn't call me that.\n\nClose shot.  PLATO watching anxiously.\n\nMed. shot.  BUZZ with JUDY watching above him.  JIM enters\nshot until he is close to BUZZ's face.  He looks up at JUDY.\nCamera closes in until we are tight on the three.  The heads\nare nearly touching.\n\n<b>                         JIM\n</b>                   (softly to JUDY)\n            You always at ringside?  You always\n            travel in this rank company?\n\nBUZZ clutches JIM's hair and jerks his head up.  He cracks\nJIM smartly across the face with the palm of his hand.\n\nClose shot.  JUDY looking at JIM.  Her eyes clear in\nrecognition.\n\nAnother angle.  The group and JIM as JIM tears free and\ncomes at BUZZ, slugging.  But BUZZ, with a laugh, leaps onto\nthe parapet and turns, the knife in his hand again.  JIM\nstops short.  The group and PLATO move in around him.\n\n<b>                         JIM\n</b>            I thought only punks fought with\n            knives.\n\n<b>                         BUZZ\n</b>            Who's fighting?  This is the test,\n            man.  It's a crazy game.\n\n<b>                         HELEN\n</b>            Les jeux de courage!\n\nClose-up.  CRUNCH.  He is smiling.  His arms are around the\nshoulders of the kids who flank him.\n\n<b>                         CRUNCH\n</b>                   (wetting his lips)\n            Machismo.  Machismo.\n\nMed. shot.  Group.\n\n<b>                         JIM\n</b>            Machismo?\n\n<b>                         BUZZ\n</b>            Somebody find him a knife.\n\nClose shot.  PLATO seen between heads of MIL and COOKIE.\nCOOKIE holds up a switch knife and tosses it over into the\ncircle.\n\n<b>                         PLATO\n</b>            Jim!\n\nFull shot.  Circle as the knife falls at JIM's feet.  JIM\nstoops and picks up his weapon, then faces BUZZ.  Then he\nsprings his blade.\n\n<b>                         BUZZ\n</b>            You know the action?  No cutting.\n            Just sticking--jab real cool.\n\nBUZZ hops from the parapet.  They begin stalking each other.\nBUZZ slides his knife from hand to hand trying to hypnotize\nJIM.  Suddenly he pokes out and pricks JIM's shirt.  The\ngroup sighs \"Ole!\" JIM makes no effort at self-defense.\nSilence.  BUZZ pricks JIM again, \"Ole!\"\n\n<b>                         BUZZ\n</b>                   (as he maneuvers)\n            What you waiting on, Toreador?  I\n            thought you wanted some action!\n\nJIM cuts out half-heartedly.\n\n<b>                         BUZZ\n</b>            Big brave bull.  Hah!  Toro!  Hah!\n            Hah!\n\n<b>                         GOON\n</b>            Moo!\n\n<b>                         BUZZ\n</b>            Come on--Fascinate us.  Impress us.\n            What's happening?  Let's go!\n\n<b>                         JIM\n</b>            I don't want trouble.\n<b>                         BUZZ\n</b>                   (furious suddenly)\n            You crud chicken!  You're wasting\n            our time!\n\nBUZZ viciously slaps JIM across the face.  JIM lashes out\nand misses.  BUZZ hops back.\n\n<b>                         BUZZ\n</b>            Yeah--that's pretty close.  How\n            about a little closer, Toreador?\n            Cut off a button and you get to\n            join the club!\n\nOutside entrance of parking lot.  A uniformed GUIDE of\nmiddle-age stares past camera.  Cries of \"Ole,\" are heard in\nthe distance.\n\n<b>                         GUIDE\n</b>                   (turning)\n            Mr. Minton!  Mr. Minton!  Trouble!\n\nThe LECTURER appears running.  He stops short at what he\nsees, and blinks in the sunlight.\n\n<b>                         GUIDE\n</b>            Look.  There's your audience.\n\n<b>                         LECTURER\n</b>            Oh, I don't think so.  From the\n            school?\n\nInside circle.  JIM is covered with sweat and about to drop.\nHe is getting the worst of it, still refusing to defend\nhimself.\n\nClose shot.  PLATO.  He is looking on in despair.\n\n<b>                         GROUP\n</b>            Ole!  Ole!\n\nSuddenly, with a cry, PLATO pushes through.\n\nInside circle as PLATO comes through.  His eyes are wild.\nHe holds a tire chain in his hand.\n\n<b>                         MIL\n</b>            Buzzy!  Look out!  He's got a chain!\n\n<b>                         BUZZ\n</b>                   (smiling as he sees PLATO)\n            Hey!  Chicken Little!\nBUZZ trips PLATO quickly and kicks him while he's down.\nCRUNCH grabs the chain.\n\n<b>                         JIM\n</b>            All right--you want it, you got it!\n\nSuddenly JIM transforms.  He bores forward expertly--pricks\nBUZZ again and again.  Cries of Ole greet him.  BUZZ is\nsurprised.\n\nFull shot.  Group.  We hear only the breathing of the\ncombatants.  Beyond we see the GUIDE approaching swiftly.\nThe LECTURER trails at a safe distance.\n\nCloseup.  CRUNCH.  He looks up.  His smile fades.\n\n<b>                         CRUNCH\n</b>            Honk.  Let's split.\n\nGroup as they look off and see the GUIDE and LECTURER\napproach.  BUZZ and JIM are both breathing hard.  PLATO is\ngetting to his feet.\n\n<b>                         BUZZ\n</b>            Split for what?  Couple old poopheads?\n\nHe folds up his knife and puts it away.  So does JIM.\n\n<b>                         JIM\n</b>            You satisfied or you want more?\n\n<b>                         BUZZ\n</b>            How 'bout you?  Say the word and\n            you're cold, Jack--you're dead.\n\n<b>                         JUDY\n</b>            Buzzie--we better get out of here.\n\n<b>                         BUZZ\n</b>            What's eating you, Judy?  You want\n            him alive?\n\n<b>                         JIM\n</b>            Where can we meet?\n\n<b>                         BUZZ\n</b>            Know the Millertown bluff?\n\n<b>                         COOKIE\n</b>            The bluff, Buzz!  That's dangerous\n            up there.\n\n<b>                         BUZZ\n</b>            Draw him a picture, Chicken Little.\n            Eight o'clock.  Cookie, you call\n            Moose and get a couple cars.  We're\n            going to have us some real kicks.\n            Little chickie-run.  You been on\n            chickie-runs before?\n\n<b>                         JIM\n</b>            Sure--that's all I do.\n\nThe GUIDE bursts in among them.  The LECTURER remains on the\nfringe.\n\n<b>                         GUIDE\n</b>            All right--all of you--start moving!\n\n<b>                         JUDY\n</b>            You mean l'il ol' us?  What's the\n            matter with the nice man?\n\n<b>                         GUIDE\n</b>            Don't clown with me.\n\n<b>                         BUZZ\n</b>            Why'nt you go suck on something sweet?\n\n<b>                         GUIDE\n</b>            You think you're tough?  I got a\n            son twice your size and I can still\n            handle him.\n\n<b>                         LECTURER\n</b>            Don't lose control, Mr. Jamison.  I\n            think if we just explain--\n\n<b>                         GUIDE\n</b>            Explain to these?  They think they\n            own the world!\n\n<b>                         CRUNCH\n</b>            The world is round!\n\n<b>                         MIL\n</b>            The world is flat!\n\n<b>                         COOKIE\n</b>            All the world's a stage!\n\nThere is wild laughter from the kids as they close around\nthe GUIDE and start edging him away, up the steps toward the\nPlanetarium balcony.\n\n<b>                         KIDS\n</b>            The world goes round the sun!\n            Goodbye proud world!\n            I got the world on a string!\n            The world's my oyster!\n            Hey!  A fish-eater!  Brain food.\n\nThey are gone.  The LECTURER looks after them then comes to\nJIM.  JIM looks down at his shirt.  There are spots of blood.\nPLATO opens it, spits on a handkerchief and starts to wipe\nthe blood away.\n\n<b>                         LECTURER\n</b>                   (smiling wanly, to JIM)\n            Sometimes the world is too much\n            with us, isn't it, son?  What was\n            the disturbance?\n\n<b>                         JIM\n</b>            Nothing.\n\n<b>                         LECTURER\n</b>            You're bleeding.  Are you all right?\n\n<b>                         JIM\n</b>            I scratched my mosquito bites.  I'm\n            fine.\n\nLECTURER hesitates.\n\n<b>                         JIM\n</b>            I'm fine--thanks!\n\nLECTURER goes.  JIM impatiently closes his shirt.\n\n<b>                         PLATO\n</b>            Are you really going to meet them?\n\n<b>                         JIM\n</b>            Who knows.  Plato?\n\n<b>                         PLATO\n</b>            What?\n\n<b>                         JIM\n</b>            What's a chickie-run?\n\n<b>                                            DISSOLVE TO:\n</b>\nDownstairs hall.  JIM's house.  A single light is burning.\nJIM steals in from the kitchen, peers cautiously into the\nliving room, then starts up the stairs.  A crash is heard\nabove.  JIM stops, undecided whether to go or stay, then\nmoves quickly up the stairs, no longer trying to be quiet.\n\nUpper hall.  JIM's house as JIM rises into view at the top\nof stairs.  He sees a figure on hands and knees mopping\nsomething off the rug.  Leaklight from the staircase dims\ndetails.  An apron is tied around the figure's waist and its\nbow sticks bravely in the air.\n\n<b>                         JIM\n</b>            Mom?\n\nThe figure straightens and turns around, smiling.  It is the\nFATHER.  He is neatly dressed in his business suit but wears\na Mary Petty apron.\n\n<b>                         FATHER\n</b>            Hiya, Jimbo.\n\nJIM leans against the wall, shaking his head and trying not\nto laugh.  The FATHER laughs unhappily, trying to make it\nall seem a joke.\n\n<b>                         FATHER\n</b>            You thought I was Mom?\n\n<b>                         JIM\n</b>            Yeah!\n\n<b>                         FATHER\n</b>            It's just this get-up.  The girl's\n            out and I was bringing Mom's supper.\n\n<b>                         JIM\n</b>                   (giggling)\n            And you dropped it?\n\n<b>                         FATHER\n</b>                   (laughing too)\n            Yeah!  Shh!\n\n<b>                         JIM\n</b>            That's funny!\n\n<b>                         FATHER\n</b>            I better clean this up before she\n            sees it.\n\nHe starts dabbing among the spilled dishes with a wet cloth.\nJIM watches him.\n\n<b>                         JIM\n</b>            Let her see.  What could happen.\n\nThe FATHER continues dabbing.\n\n<b>                         JIM\n</b>            Dad--\n\nThe FATHER looks up at him.\n\n<b>                         JIM\n</b>            Dad--don't.  Don't.\n\nJIM touches his FATHER's elbow, bringing him to his feet.\nThey look at each other a moment then JIM goes to his\nbedroom.  The FATHER goes back to mopping up the mess.\n\nInside JIM's room as he comes in, shuts the door and throws\nhimself miserably on his bed.  He writhes as if the pain he\nfeels were physical.  Outside, radios are heard in the\nnight--tuned to different stations.  He feels under his\njacket and holds up his hand to the moonlight.  There is\nblood on it.  He reaches up and takes his alarm clock and is\nsetting it as camera glides to his window and holds over the\nrooftops.\n\nFull shot.  JUDY's backyard.  Moonlight.  JUDY stands near\ncamera looking up at the moon.  The radios seem louder out\nhere.  One breaks through.\n\n<b>                         ANNOUNCER\n</b>            Time now for the seven o'clock news.\n            Friends, the next time you go\n            shopping.\n\n<b>                         JUDY'S FATHER (O.S.)\n</b>            Judy.\n\nShe wheels around.\n\nLong shot.  The FATHER standing erect on back porch,\nsilhouetted against a window.\n\n<b>                         JUDY'S FATHER\n</b>            What are you wishing for, Judy?\n\nMed. shot.  JUDY.  She hasn't moved.\n\n<b>                         JUDY\n</b>                   (softly)\n            I wasn't wishing.  I was looking at\n            the moon.\n\nFull shot.  Backyard featuring the FATHER.  We see him now\nas a tall and handsome man.  There is something boyish and\nappealing about him.\n\n<b>                         JUDY'S FATHER\n</b>                   (singing lightly)\n            \"Man in the Moon, how came you\n            there--\n            Up in the sky where you are\n            shining--\n            Floating so high in the frosty\n            air--?\n            Oh, say--Man in the Moon!\"--\n\nJUDY comes forward, stands below him on the step.  Her look\nis adoring.\n\n<b>                         JUDY\n</b>                   (astonished)\n            How did you know that?\n\n<b>                         JUDY'S FATHER\n</b>            We used to sing it in school.\n                   (smiles)\n            Don't look at me with such horror.\n            They had schools in those days.\n\n<b>                         JUDY\n</b>            But the same song.  I think it's\n            fantastic!\n\n<b>                         JUDY'S FATHER\n</b>            We were romantic then too--\n\n<b>                         JUDY\n</b>            Are you and Mom home tonight?\n\n<b>                         JUDY'S FATHER\n</b>            No.  Why?\n\n<b>                         JUDY\n</b>            Nothing, only it'd be nice to spend\n            an evening together for a change.\n\n<b>                         JUDY'S FATHER\n</b>            With us old creeps?  Come on, we\n            have to eat.\n\n<b>                         JUDY\n</b>                   (rising)\n            Daddy--\n\nHe looks at her.\n\n<b>                         JUDY\n</b>            Good evening.\n\n<b>                         JUDY'S FATHER\n</b>            Hi.\n\nHe turns away and goes into the house.  She hesitates and\nthen follows.  Something in the moods has changed.  He has\nneglected to hold the door for her.\n\nDining room.  JUDY's house as the FATHER comes to the head\nof the table and takes his seat.  Three places are set.\nJUDY follows.  She stands above his chair, looking down at\nhim as he drinks his tomato juice.\n\n<b>                         JUDY\n</b>                   (quietly, afraid)\n            Didn't you forget something?\n\n<b>                         JUDY'S FATHER\n</b>            What?\n\nJUDY doesn't answer, but leans down and kisses him quickly\non the lips.\n\n<b>                         JUDY'S FATHER\n</b>                   (continuing; shocked)\n            What's the matter with you?\n\nJUDY freezes, frightened.  He collects himself a little.\n\n<b>                         JUDY'S FATHER\n</b>                   (continuing)\n            You're too old for that kind of\n            stuff, kiddo.  I thought you\n            stopped doing that long ago.\n\n<b>                         JUDY\n</b>                   (very hurt)\n            I didn't want to stop.\n\nThe mother enters briskly from another part of the house--an\nattractive, brittle woman of thirty-five.\n\n<b>                         JUDY'S MOTHER\n</b>            Didn't want to stop what?\n\n<b>                         JUDY'S FATHER\n</b>            Nothing.\n\n<b>                         JUDY\n</b>            I was talking to Dad.\n\n<b>                         JUDY'S FATHER\n</b>            I didn't kiss her so it's a big thing.\n\n<b>                         JUDY'S MOTHER\n</b>                   (calling to kitchen)\n            Bertha!  You can serve the souffle!\n                   (to FATHER)\n            Fish souffle.\n                   (to JUDY)\n            You don't have to stand there,\n            darling.  Drink your tomato juice.\n\nJUDY slides into her chair reluctantly and unfolds her napkin.\n\n<b>                         JUDY\n</b>            I guess I just don't understand\n            anything.\n\n<b>                         JUDY'S FATHER\n</b>            I'm tired, Judy.  I'd like to\n            change the subject.\n\n<b>                         JUDY\n</b>            Why?\n\n<b>                         JUDY'S FATHER\n</b>            I'd like to, that's all.  Girls\n            your age don't do that.  You need\n            an explanation?\n\n<b>                         JUDY\n</b>                   (very low)\n            Girls don't love their father?\n            Since when?  Since I got to be\n            sixteen?\n\nShe half-rises to kiss him again.\n\n<b>                         JUDY'S FATHER\n</b>            Stop it now!  Sit down!\n\nSuddenly the FATHER slaps her.  Even as he does it he is as\nstunned as JUDY.  The mother stops eating.  She has never\nseen such a display and is shocked.  He tries to control\nhimself by buttering a piece of bread.  There is a terrible\nsilence into which BEAU enters in his pajamas.  He runs to\nhis FATHER's chair, then halts--looking from face to face.\nThe FATHER puts an arm around him, hugs him almost savagely.\n\n<b>                         JUDY'S FATHER\n</b>                   (thickly)\n            Hi, rascal.\n\n<b>                         BEAU\n</b>                   (hushed)\n            Hi.\n\nJUDY rises, weeping.\n\n<b>                         JUDY\n</b>            May I please be excused?\n\nShe starts out.  The FATHER rises and follows after her.\n\n<b>                         JUDY'S FATHER\n</b>                   (softly)\n            Hey, hey, Glamorpuss.  I'm sorry.\n\nShe leaves the room, interrupting the joke he was going to\nmake.  He turns back to the table and sits down.  The MOTHER\nrises and comes to him.\n\n<b>                         JUDY'S FATHER\n</b>                   (continuing)\n            I don't know what to do.  All of a\n            sudden she's a problem.\n\nThe mother stands behind his chair.  She tips his head back\nagainst her body and kneads his neck and shoulders.\n\n<b>                         JUDY'S MOTHER\n</b>            She'll outgrow it, dear.  It's just\n            the age.\n\n<b>                         BEAU\n</b>                   (in a sudden burst)\n            The atomic age!\n\nThe door slams.\n\n<b>                         JUDY'S MOTHER\n</b>                   (kissing her\n                   husband's hair)\n            It's the age when nothing fits.\n\nInside JIM's room.  We see him lying on his bed as before.\nHis eyes are open.  The alarm clock goes off.  JIM starts as\nif shot, then stops the wild ringing.  The time is seven-\nforty-five.  He makes no move to leave the bed.  There is a\nlight tap on the door, then it opens and the FATHER is\nthere, seen in light from the hall and still wearing the apron.\n\n<b>                         FATHER\n</b>            You awake?\n\n<b>                         JIM\n</b>            Yes.\n\n<b>                         FATHER\n</b>            Listen--I took a steak out of the\n            freezer.  I thought we could have a\n            real old-fashioned stag party--just\n            the two of us, what do you say?\n\n<b>                         JIM\n</b>            I'm not hungry.\n\nThe FATHER turns away.\n\n<b>                         JIM\n</b>            Hey--I want to ask you something.\n\n<b>                         FATHER\n</b>                   (happily)\n            Shoot, Jimbo.\n\n<b>                         JIM\n</b>            Suppose you knew that you had to do\n            something very dangerous--where you\n            have to prove something you need to\n            know--a question of honor.  Would\n            you do it?\n\n<b>                         FATHER\n</b>                   (laughing)\n            Is there some kind of trick answer?\n\n<b>                         JIM\n</b>            What would you do, Dad?\n\n<b>                         FATHER\n</b>                   (evading)\n            I wouldn't do anything hasty.\n            Let's get a little light on the\n            subject.\n\nThe FATHER turns on the light and looks at JIM who is now\nsitting on the edge of the bed.  He removes his jacket and\nthe bloody shirt is revealed.  The FATHER stares.\n\n<b>                         JIM\n</b>            Blood.\n\n<b>                         FATHER\n</b>            How'd that happen!  What kind of\n            trouble you in?\n\n<b>                         JIM\n</b>            The kind we've been talking about.\n            Can you answer me now?\n\n<b>                         FATHER\n</b>            Listen--nobody should make a snap\n            decision--This isn't something you\n            just--we ought to consider all the\n            pros and cons--\n\n<b>                         JIM\n</b>            We don't have time.\n\n<b>                         FATHER\n</b>            We'll make time.  Where's some\n            paper.  We'll make a list and if\n            we're still stuck then we ought to\n            get some advice--\n\nHe goes out, to the study next door.  JIM rises.\n\n<b>                         JIM\n</b>            What can you do when you have to be\n            a man?\n\n<b>                         FATHER\n</b>            Well, now--\n\n<b>                         JIM\n</b>            Just give me a direct answer!\n                   (pause)\n            You going to stop me from going, Dad?\n\n<b>                         FATHER\n</b>            You know I never stop you from\n            anything.  Believe me--you're at a\n            wonderful age.  In ten years you'll\n            look back on this and wish you were\n            a kid again.\n\n<b>                         JIM\n</b>            Ten years?  Now, Dad--I need an\n            answer now!\n\n<b>                         FATHER\n</b>            I just want to show you how foolish\n            you are.  When you're older you'll\n            laugh at yourself for thinking this\n            is so important--\n\nDuring this, JIM has kicked off his shoes and put on his\nboots and jacket and goes out.\n\nLiving room featuring stairs.  JIM comes running down the\nstairs and out the kitchen door.\n\n<b>                         FATHER (O.S.)\n</b>            Jim?  Will you listen?  You can't\n            go out till we--Jim!\n\nThe FATHER comes down the stairs, goes to the front door and\ncalls:\n\n<b>                         FATHER\n</b>            Jim?  Jim!\n\nHe goes to kitchen door, calls again, gets no answer, comes\nback into the living room, sees he is still wearing the\napron.  He rips it off and throws it down--then starts for\nthe stairs.\n\n<b>                                            DISSOLVE TO:\n</b>\nThe Plateau.  Moonlight.  Wind shrieks over the exposed\nplateau, which is several hundred yards long.  It cuts into\nthe darkness like the prow of a ship and ends in empty air.\nA dozen cars are scattered about, defining a sort of runway\nin the center.  There are twenty kids present, but very\nlittle talk.  Most of them belong to BUZZ's group but there\nare a few whom we have not met before.  They stand in small\nclots, murmuring and smoking.  The atmosphere is strung\ntightly, like the moments before a dawn attack.  In b.g.\nnear the cliff's edge, are two cars of similar make and\nmodel.  They face away from camera toward the edge of the\nplateau.  There are no headlights anywhere...blackout\nconditions.\n\nMOOSE, a boy in a leather jacket and cheap yachting cap\nstands guard between the cars, his back to us.  His hands\nare on his hips.  His legs are spread.  Some girls drift in.\n\nAnother angle.  Plateau featuring PLATO as he wanders\nthrough the crowd searching for JIM.  He passes BUZZ's car\nwhere BUZZ, JUDY and the rest are eating hamburgers.  They\nhave all changed into fighting wardrobe.\n\n<b>                         BUZZ\n</b>                   (calling out)\n            Hey, Chicken-Little.\n\nPLATO stops.\n\n<b>                         BUZZ\n</b>            Where's Toreador?  He beg off?\n\n<b>                         PLATO\n</b>            He's not scared of you.\n\n<b>                         BUZZ\n</b>                   (laughing)\n            Yeah?\n                   (to GOON)\n            Goon!  You seen that adolescent\n            type anywheres?\n\n<b>                         COOKIE\n</b>            He won't show.\n\n<b>                         GOON\n</b>            Well, you going to wait all night?\n            I'm getting nervous, man!  We got\n            to do something!\n\n<b>                         CRUNCH\n</b>                   (looking off)\n            Hey, Buzz!\n\n<b>                         BUZZ\n</b>            What?\n\n<b>                         COOKIE\n</b>            Over there.\n\nBUZZ snaps on the spotlight again and swings it off.\n\nFull shot.  JIM's car as JIM gets out and PLATO runs to him.\n\n<b>                         JIM\n</b>            How'd you get here?\n\n<b>                         PLATO\n</b>            I hitched.\n\n<b>                         JIM\n</b>            Boy, I bet you'd go to a hanging.\n\n<b>                         PLATO\n</b>            My personality's showing again.\n            Should I leave?\n\n<b>                         JIM\n</b>            No.  It's okay.\n\nBUZZ enters.\n\n<b>                         BUZZ\n</b>            Come on.  Let's see what we're\n            driving.\n\nJIM gets out; PLATO starts to follow.\n\n<b>                         BUZZ\n</b>            Just him.\n\n<b>                         JIM\n</b>            Stay there.\n\nThe two boys move away.  PLATO looks after them, hurt, then\ngoes to side of JUDY and stands.\n\nDolly shot.  JIM and BUZZ as they come forward.\n\n<b>                         BUZZ\n</b>            What you say your name was?\n\n<b>                         JIM\n</b>            Jim Stark.\n\n<b>                         BUZZ\n</b>            Buzz Gundersen.\n\n<b>                         JIM\n</b>            Hi.\n\n<b>                         BUZZ\n</b>            Glad to meet you.\n\nThey shake hands briefly as they walk.  They come to MOOSE\nand stop.\n\n<b>                         MOOSE\n</b>            Got some goodies for you, Buzzie-boy.\n\n<b>                         BUZZ\n</b>            Flashlight?\n\nMOOSE produces one and hands it to BUZZ who goes to one of\nthe guarded cars, motioning JIM to come, too.\n\nCloser shot.  BUZZ, JIM and MOOSE seen as hood is raised,\nrevealing their faces beneath it.  BUZZ explores the motor\nwith the flashlight.\n\n<b>                         BUZZ\n</b>            Looks good.\n\n<b>                         MOOSE\n</b>            Clean as a whistle.  They both got\n            plenty breeze.\n\n<b>                         BUZZ\n</b>            Look good to you?\n\n<b>                         JIM\n</b>            Sure.  It's fine.\n\n<b>                         BUZZ\n</b>            Okay.\n\nHe closes the hood.  Group moves across to other car.\n\nJUDY and PLATO.  The other kids are behind them.  JUDY looks\nto see that their attention isn't on her, then speaks\nquietly to PLATO.\n\n<b>                         JUDY\n</b>            Is he your friend?\n\n<b>                         PLATO\n</b>            Yes.  My best friend.\n\n<b>                         JUDY\n</b>            What's he like?\n\n<b>                         PLATO\n</b>            Oh, I don't know.  You have to get\n            to know him.  He doesn't say much\n            but when he does you know he means\n            it.  He's sincere.\n\n<b>                         JUDY\n</b>            Well, that's the main thing--don't\n            you think so?\n\n<b>                         PLATO\n</b>            Maybe next summer he's going to\n            take me hunting with him--and\n            fishing.  I want him to teach me\n            how and I bet he won't get mad if I\n            goof.  His name's Jim.  It's really\n            James but he likes Jim more.\n                   (laughing)\n            People he really likes--he lets\n            call him \"Jamie.\"\n\n<b>                         JUDY\n</b>            Want to finish my hamburger?  I\n            only took a bite.\n\n<b>                         PLATO\n</b>            Okay.\n\nFull shot.  Guarded cars.  JIM is close in f.g. at wheel of\nhis car.  BUZZ is beyond, at wheel of his.  Both boys are\ngunning their engines, listening critically.  JIM lets his\nidle.\n\nJUDY, GOON and group.  They watch in silent anticipation.\nPLATO starts away from them.\n\nTraveling shot.  PLATO hurrying away from the group.  He\nstops, looking off.\n\nJIM and BUZZ.  PLATO in distance.\n\n<b>                         BUZZ\n</b>            Better try the doors.  Jump out.\n\nJIM opens his door.\n\n<b>                         BUZZ\n</b>            No--quick, man!  You got to break\n            quick.\n\nJIM shuts his door and tries again.  So does BUZZ.  Then\nboth boys walk forward to the edge.  Neither says a word.\nBUZZ puts his hand on JIM's shoulder.\n\nHigh angle.  The edge of the bluff (process).  JIM and BUZZ\nare directly below us.  Under them the plateau falls steeply\naway in a sheer drop of a hundred feet to the ocean below.\n\nTwo shot.  JIM and BUZZ.  JIM is staring below.  He is\nbeginning to perspire.  He lights a cigarette.  Without\ntaking his hand from JIM's shoulder, BUZZ borrows the\ncigarette from his lips, takes a drag and hands it back.\nJIM takes another puff then tosses it into the abyss.\n\n<b>                         BUZZ\n</b>                   (quietly)\n            This is the edge, boy.  This is the\n            end.\n\n<b>                         JIM\n</b>            Yeah.\n\n<b>                         BUZZ\n</b>            I like you, you know?\n\n<b>                         JIM\n</b>            Buzz?  What are we doing this for?\n\n<b>                         BUZZ\n</b>                   (still quiet)\n            We got to do something.  Don't we?\n\nLong shot.  JIM and BUZZ with PLATO in f.g.  JIM and BUZZ\nappear to him as two close friends.  Suddenly they break and\ngo, without speaking further, to their cars.  They back up\nto the opposite end of the plateau, headlights dark.  PLATO\nfollows them with his gaze.\n\nGroup shot.  GOON and others looking up as the cars glide by.\n\nMed. shot.  JUDY waiting as BUZZ and JIM move into starting\nposition next to her.  JUDY goes to BUZZ.  JIM is in b.g.--\nlooking on.\n\n<b>                         JUDY\n</b>            Feel okay?\n\n<b>                         BUZZ\n</b>            Give me some dirt.\n\nShe bends out of sight for a moment as BUZZ goes on talking,\nthen hands him the dirt.  He rubs it into his palms.\n\n<b>                         BUZZ\n</b>            Hey, Toreador!  She signals.  We\n            head for the edge.  The first guy\n            who jumps--chicken!\n\nJUDY and BUZZ kiss, without much interest.\n\n<b>                         BUZZ\n</b>            What's happening?\n\n<b>                         JUDY\n</b>            Good luck, Buzz.\n\nShe starts out, without kissing him again.\n\n<b>                         JIM\n</b>                   (calling softly)\n            Judy.\n\nMed. shot.  JIM's car as JUDY comes to him.\n\n<b>                         JIM\n</b>            Me too.\n\nShe looks at him a moment then bends and hands him some dirt.\nTheir heads touch for an instant.\n\n<b>                         JIM\n</b>            Thank you.\n\nShe breaks the look and hurries away.\n\nLong shot.  The cars.  They are lined up in two rows--\nheadlights facing each other.  JUDY comes into shot.  When\nshe gets near camera, she stops and turns back to face them.\n\n<b>                         BUZZ\n</b>            Hit your lights!\n\nSuddenly the headlights of all the cars come on full.\n\nReverse shot.  JUDY.  She is in the center of the glare.\nBehind her we see the other kids filing out of their cars,\nhurrying toward the edge of the bluff.  The sound of the two\nmotors revving then dying and revving again.\n\nInside JIM's car.  JIM grips the wheel firmly, relaxes his\nhands to rub his palms together and crack his knuckles.  He\ngrips the wheel again.  Steps on the accelerator, winding\nhis engine into a roar.  He lets up, looks tensely at--\n\nBUZZ in his car.  His chin juts forward.  He lets go of the\nwheel, starts to comb his hair.\n\nSlow pan shot.  Spectators staring off at the cars.  A boy\nhas his arm around the girl in front of him, his cheek\nagainst hers.  Both are looking off.  Some of the kids smoke.\nAll are involved in the blasting of engines.\n\nPLATO among the spectators near edge of the bluff.  He is\nchewing his lip.  Camera pans down to show that the fingers\nof both his hands are tightly crossed.\n\nClose shot.  JUDY staring tensely into the glare.  Suddenly\nshe raises her hands high above her head.\n\nClose shot.  JIM sweating it out.  He leans forward,\nsquinting, ready.\n\nClose shot.  BUZZ.  He puts his comb between his teeth and\nclamps it hard.  He settles himself for the run.\n\nLong shot.  Plateau.  The cars are in close, seen from the\nrear.  JUDY is a small distant figure, arms stretched high.\nThe exhaust blasts.  Now she drops her arms.  The cars leap\nahead.\n\nMed. shot.  JUDY.  She whirls to see the cars snap by, then\nbegins running up the center of the plateau between the\nlines of spectators.\n\nFull shot.  Spectators.  Shooting over their shoulders as\nthe cars approach and scream past.\n\nPit shot.  Cars.  As they approach, gaining speed, and\nthunder over the camera.\n\nInside JIM's car. (Process).  He is tense.\n\nInside BUZZ's car. (Process).  His hands hard on the wheel.\nThe comb is still between his teeth.  He begins edging\ntoward the door on his left.\n\nMoving close shot.  JUDY biting hard on her finger, as she\nruns forward.\n\nClose shot.  PLATO.  Both hands cover his mouth.  The\nfingers are still crossed.\n\nInside JIM's car. (Process).  As he edges to his left.  He\nis driving with one hand.  He opens the door, gets set for\nhis jump.\n\nInside BUZZ's car. (Process).  He reaches for the door\nhandle and misses.  As he raises his arm to reach again, the\nstrap of his windbreaker sleeve slips over the handle.  He\nlooks down in panic, then back at the drop ahead.  He tugs\nbut cannot get the sleeve loose.\n\nCloseup.  PLATO staring.  He shuts his eyes tight and keeps\nthem shut.\n\nShooting at backs of the two cars as they race through the\nrow of lights toward the edge.\n\nInside JIM's car. (Process).  His face is soaked.  He looks\nonce toward BUZZ--then ahead.  His eyes widen in fear.  He\nshoves left and flings himself forward, and out.\n\nOutside JIM's car as he sprawls forward--into camera.\n\nInside BUZZ's car. (Process).  BUZZ leans way forward now.\nHe seems to rise in his seat.  His mouth opens and the comb\nfalls out.\n\nFull shot spectators staring in disbelief.  Suddenly a youth\nducks his face into the neck of his girlfriend so he cannot\nsee.  At the same instant--\n\n<b>                         CROWD\n</b>                   (in a single breath)\n            Oh!\n\nRear view.  Edge of the bluff as the two cars go over.\nThere is NO human sound.\n\nClose shot.  JIM as he stops rolling.\n\nBUZZ's car in flight. (Special effects).  The car soars\nthrough the night, the vehicle of a terrible journey.\n\nMed. shot.  BUZZ. (Process).  Surprise has gone.  He rides\nlightly on the thrill of his last moment--then suddenly, his\nface twists in a spasm of protest and loss.\n\nThe kids staring at his flight.\n\nJIM unaware of the disaster--glad he made it.\n\nLow angle.  Edge of the bluff.  With headlights blazing,\nboth cars dive down.\n\nMed. shot.  JUDY standing frozen as the spectators shove\npast and around her.\n\nWide angle.  Edge of the bluff as spectators swarm to it,\nstand looking down.\n\nJIM on hands and knees, trying to rise.  Legs rush by him,\nknock him onto his face.\n\nLong shot. (Special effects).  Both cars plunge into the\nocean below.\n\nJIM at edge of bluff.  He is pushing through spectators.\n\n<b>                         JIM\n</b>                   (a harsh whisper)\n            Where's Buzz!  Where's Buzz!\n\nPLATO working his way through the crowd.\n\n<b>                         PLATO\n</b>                   (calling)\n            Jim!  Jim!\n\nCRUNCH.  CRUNCH looks up as he hears JIM's repeated cry.\nJIM enters behind him, continuing blindly on his way.\n\n<b>                         CRUNCH\n</b>                   (tight fury)\n            Down there!  Down there is Buzz!\n\nJIM looks over the edge.\n\nRear view.  Spectators.  A siren wail approaches.  The kids\nwheel and scatter, panicking past the camera.\n\nClose shot.  MOOSE.  Looks at JIM.  Runs.\n\nClose shot.  GOON.  Turns.  Runs.\n\nMed. shot.  JIM seen between legs of hurrying kids.  The\nsirens and the pounding of their feet on the hard turf.  JIM\nis sitting on the edge of the bluff.  PLATO rushes in, stops\nshort as he sees him.\n\n<b>                         PLATO\n</b>            Come on, Jim!  We got to get out of\n            here!\n\nJIM doesn't move.  PLATO grabs his arm and yanks.\n\n<b>                         PLATO\n</b>            Get up!  Get up!  Come on!\n\nJIM stands.  PLATO pushes him.\n\n<b>                         PLATO\n</b>            Go on!  Move!\n\nThey start away, PLATO still pushing from behind.\n\nMed. shot.  JUDY.  She is standing alone in the wind on the\nemptying plateau.  JIM and PLATO move past in the distance.\nJIM sees her and stops.\n\nClose shot.  JUDY.  She is shuddering violently but there\nare no tears.  She seems not to see or hear or be aware of\nanything around her.\n\nFull shot.  JIM and PLATO watching JUDY.  JIM moves toward\nher, camera panning with him and leaving PLATO behind.  JIM\nstands before JUDY until she notices him.  He shakes his\nhead for all the sorrow he feels, but no words come.\nTentatively he offers her his hand.  After a moment, she\ntakes it.  She knows only that help is being offered and\nthat she will accept it with trust.  JIM leads her away\ntoward the car.\n\n<b>                                            DISSOLVE TO:\n</b>\nHigh long shot.  JIM's street.  Night.  There is no movement\nanywhere.  In the house bordering the street a few lights\nstill burn.  JIM's car approaches out of distance and slows\nwhen it reaches the alley.\n\nMed. shot.  JIM's car as it slows and stops.  JIM, JUDY and\nPLATO in the front seat.  JUDY has the door open before the\ncar even stops.  She is shaking, agitated and withdrawn.\n\n<b>                         JUDY\n</b>                   (hardly audible)\n            This is fine--\n\nShe gets out and starts away, leaving door open.\n\n<b>                         JIM\n</b>                   (calling quietly)\n            Judy.  Will you be okay?\n\nPLATO looks at him.  JUDY hesitates.  JIM raises a hand to\nher in a shy farewell.  She smiles vaguely, then hurries\naway from them.\n\nNear JIM's backyard (alley).  JIM and PLATO.\n\n<b>                         JIM\n</b>            I got to go in.  You better get\n            home too.\n                   (touches PLATO)\n            Hey--what?\n\n<b>                         PLATO\n</b>            Why don't you come home with me?  I\n            mean nobody's home at my house--and\n            I'm not tired, are you?  I don't\n            have many--people I can talk to.\n\n<b>                         JIM\n</b>            Who has?\n\n<b>                         PLATO\n</b>            If you want to come we could talk\n            and then in the morning we could\n            have breakfast like my dad used\n            to--\n                   (pauses--then\n                   excitedly as though\n                   an idea had suddenly\n                   struck him)\n            Gee...if you could only have been\n            my father...we could...\n\n<b>                         JIM\n</b>                   (interrupting)\n            Hey...you flipped--or something?\n            You better take off...\n\n<b>                         PLATO\n</b>                   (suddenly, pleasantly)\n            O.K.  G'night.  I got to pick up my\n            scooter.  See you tomorrow.\n\n<b>                         JIM\n</b>            Yeah.\n\nPLATO turns, walks up the alley to the street.  JIM goes\ninto his kitchen door.\n\nHallway.  JUDY's house.  Three doors open onto it: one is\nclosed--this is JUDY's room:--another, leading into BEAU's\nroom is open, but the room beyond is dark: the third, also\nopen, reveals the bedroom of JUDY's parents.  As JUDY comes\ninto the hallway, the parents, who are reading in their\nbeds, look up.  JUDY hesitates, then starts toward her own\nroom.\n\n<b>                         BEAU (O.S.)\n</b>                   (quietly)\n            Hello, little cute sister.\n\nJUDY stops.  BEAU appears at his door in white pajamas, a\nsmall ghost.  JUDY looks at him.\n\n<b>                         BEAU\n</b>            Hello, darling, baby-pie, glamor-\n            puss, sweetie--\n\nJUDY touches BEAU's head and tries to smile.\n\n<b>                         JUDY'S FATHER\n</b>                   (calling from his bed)\n            Beau!  You belong in bed!\n\nBEAU flees.  JUDY turns without another glance at her\nparents, and opens the door of her room.\n\nInside bedroom of JUDY's parents.  As JUDY slams her bedroom\ndoor o.s., the FATHER reacts.  Perhaps, he wishes she had\ngiven him a chance to say goodnight.  The MOTHER, who use\nreading glasses, looks up at the slam.  Then she looks over\nat her husband, shrugs when she catches his gaze, and goes\nback to her magazine.\n\nInside JIM's living room.  The television is on, but only a\nhum comes from it, and the screen is a flickering gray.  The\nFATHER sits lumpily in a chair by the fireplace, still\ndressed but with his collar open.  The sound of JIM's step\nin the dining room makes him open his eyes.  Fear of facing\nhis son makes him shut them again.  The boy comes in, a\nbottle of milk in his hand.  Seeing his FATHER there, he\nstops short--his impulse is to flee.  Instead he comes in\nand looks down at the sleeping man whose eyelids, fluttering\nin the FATHER's masquerade of sleep, make him seem to be\nhaving a dream.  JIM is torn between his desire to leave and\nhis need to speak.  He turns off the television quietly,\nthen lies down on the couch across the way.  He mumbles the\nthings he would say to his FATHER and the answers he feels\nhe would get.  The old man opens his eyes once, sees the boy\nthere, head banging upside down from the couch.  Then he\nshuts them again.\n\nUpside down long shot.  Room (JIM's viewpoint).  Suddenly,\ninverted in his vision, the MOTHER appears at the head of\nthe stairs, in bathrobe and nightgown.  She pauses a moment,\nthen runs down crying:\n\n<b>                         MOTHER\n</b>            He's home!  You're home!  You're\n            all right!\n\nThe camera rights itself suddenly.\n\nJIM as he completes his turn, pulling his head up and sitting.\n\nFATHER as he pretends to awaken with a start.\n\nFull shot, room as the MOTHER hurries to JIM, holds him,\ninspects him, kisses him.\n\n<b>                         MOTHER\n</b>            What happened, darling.  We were so\n            worried.  I was going to take a\n            sleeping pill, but I wouldn't till\n            I knew you were home.\n\n<b>                         JIM\n</b>            I have to talk to someone, Mom.  I\n            have to talk to you both.  And Dad\n            this time you got to give me an\n            answer.\n\n<b>                         FATHER\n</b>            Go ahead.\n\n<b>                         JIM\n</b>            I'm in terrible trouble.--You know\n            that big high bluff near Miller-\n            town Junction?\n\n<b>                         FATHER\n</b>            Sure--there was a bad accident\n            there.  They showed the pictures on\n<b>            T.V.\n</b>\n<b>                         JIM\n</b>            I was in it.\n\n<b>                         MOTHER\n</b>            How!\n\n<b>                         JIM\n</b>            It doesn't matter how.  I was\n            driving a stolen car--\n\n<b>                         MOTHER\n</b>            Do you enjoy doing this to me or\n            what--\n\n<b>                         JIM\n</b>            Mom--I'm not--\n\n<b>                         MOTHER\n</b>            And you wanted him to make a list!\n\n<b>                         FATHER\n</b>            Will you let him tell it!\n\n<b>                         JIM\n</b>            She never wants to hear.  She\n            doesn't care!\n\n<b>                         MOTHER\n</b>            I guess when I nearly died giving\n            birth to you--that shows how much I\n            don't care!\n\n<b>                         FATHER\n</b>            Just relax, please relax!\n\n<b>                         JIM\n</b>            I told you Dad, it was a question\n            of honor.  They called me chicken--\n            you know, chicken!  I had to go or\n            I would never have been able to\n            face any of those kids again.  So I\n            got in one of these cars and a boy\n            called Buzz got in the other.  We\n            had to drive fast and jump before\n            the cars went over the edge of the\n            bluff.  I got out okay but Buzz\n            didn't.  He was killed.\n\n<b>                         MOTHER\n</b>            Good Lord!\n\n<b>                         JIM\n</b>            I can't keep it to myself anymore--\n\n<b>                         FATHER\n</b>            Well, just get it off your chest, son.\n\n<b>                         JIM\n</b>            That's not what I mean.  I've never\n            done anything right.  I've been\n            going around with my head in a\n            sling for years...I don't want to\n            drag you into this but I can't help\n            it.  I don't think I can prove\n            anything by going around pretending\n            I'm tough any more, so maybe you\n            look like one thing but you still\n            feel like another.\n\n<b>                         FATHER\n</b>            You're absolutely right!\n\n<b>                         JIM\n</b>            Are you listening to me?  You're\n            involved in this!  I want to go to\n            the police and tell them I was\n            mixed up in this thing tonight?\n\n<b>                         FATHER\n</b>            You what?\n\n<b>                         MOTHER\n</b>            No!\n\n<b>                         FATHER\n</b>            Did anyone see you there?  I mean\n            did they get your license number or\n            anything?\n\n<b>                         JIM\n</b>            I don't think so--\n\n<b>                         FATHER\n</b>            Well--\n\n<b>                         MOTHER\n</b>            What about the other boys--Do you\n            think they'll go to the police?\n\n<b>                         JIM\n</b>            What's that got to do with it?\n\n<b>                         MOTHER\n</b>            Why should you be the only one.\n\n<b>                         FATHER\n</b>            Look Jim.  Far be it from me to\n            tell you what to do, but there's--\n\n<b>                         MOTHER\n</b>            Are you going to preach now?  Are\n            we going to have a sermon?\n\n<b>                         FATHER\n</b>            I'm just explaining what you mean!\n            You can't be an idealist all your\n            life!  Nobody thanks you for\n            sticking your neck out!\n\n<b>                         MOTHER\n</b>            That's right!\n\n<b>                         JIM\n</b>            Except yourself!\n\n<b>                         FATHER\n</b>            Will you wait a minute?\n\n<b>                         JIM\n</b>            You don't want me to go.\n\n<b>                         MOTHER\n</b>            No!  I don't want you to go to the\n            police!  There were other people\n            and why should you be the only one\n            involved!\n\n<b>                         JIM\n</b>            But I am involved!  We're all\n            involved, Mom!  A boy was killed!\n            I don't see how we can get out of\n            that by pretending it didn't happen!\n\n<b>                         FATHER\n</b>            You know you did wrong.  That's the\n            main thing, isn't it?\n\n<b>                         JIM\n</b>            No!  It's nothing!  Just nothing!\n            You always told me to tell the\n            truth.  You think you can just turn\n            that off?\n\n<b>                         MOTHER\n</b>            He's not saying that!  He's saying\n            don't volunteer!\n\n<b>                         JIM\n</b>            Just tell a little white lie?\n\n<b>                         FATHER\n</b>            You'll learn as you get a little\n            older, Jim.\n\n<b>                         JIM\n</b>            I don't want to learn that!\n\n<b>                         MOTHER\n</b>            Well, it doesn't matter anyhow--\n            because we're moving.\n\n<b>                         JIM\n</b>            No!  You're not tearing me loose\n            any more.\n\n<b>                         MOTHER\n</b>            Do I have to spell it out?\n\n<b>                         JIM\n</b>            You're not going to use me as an\n            excuse again, Mom.  Every time you\n            can't face yourself you want to\n            move and you say it's because of me\n            or the neighborhood or some other\n            phony excuse.  Now I want to do one\n            thing right and I'm not letting you\n            run away.\n                   (silence)\n            Dad?\n\n<b>                         FATHER\n</b>            Son--this is all happening so fast--\n\n<b>                         JIM\n</b>            You better give me something, Dad.\n            You better give me something\n                   (stops as he sees the\n                   emptiness in them)\n            Mom?\n\n<b>                         MOTHER\n</b>            Jimmy, you're very young--and a\n            foolish decision now could wreck\n            your whole life.\n\n<b>                         JIM\n</b>            Dad--answer her--aren't you going\n            to stand up for me?\n\nThe FATHER is mute, helpless...  Suddenly JIM screams.\n\n<b>                         JIM\n</b>            Dad?\n\nHe leaps at his FATHER, dragging him to his feet, hands at\nthe man's throat.\n\n<b>                         MOTHER\n</b>            Stop it!  You'll kill him!  Jim!\n            Do you want to kill your father?\n\nSuddenly JIM loosens his hands and rises.  He looks swiftly\nat each of them--moves a few steps toward the door, looks\nback at them again--then rushes out of the house.  The\nparents stand frozen.\n\n<b>                                            DISSOLVE TO:\n</b>\nOutside Precinct Station.  JIM's car comes to a stop at the\ncurb.  JIM gets out and approaches the flight of steps\nleading up the entrance.  A bare bulb on either side is the\nonly illumination.  As he mounts the first step, the double\ndoors above him swing open revealing several people.  JIM\nstops short.  So do they.\n\nLow angle.  CRUNCH, MOOSE and their parents.  JIM's back in\nf.g.  The boys stare down at him.\n\nHigh angle.  JIM (from the boys' point of view) as he stares\nup at them.  MOOSE's father takes his arm and starts him\ndown the stairs, the others moving too.\n\n<b>                         MOOSE\n</b>            Let go of me--\n\n<b>                         MOOSE'S FATHER\n</b>            You want a good crack in the mouth?\n\nJIM starts forward up the steps.  CRUNCH grabs him.\n\n<b>                         CRUNCH\n</b>            This place appeal to you or something?\n\nThey move down the steps as JIM breaks away and continues up.\nHe goes through the doors.\n\nInside doors as JIM comes through and stops.  He looks back\nthrough the glass.  We see the group reach the curb where\ntheir cars are parked.  There is a brief discussion which we\ncannot hear, then CRUNCH and MOOSE move off to MOOSE's car.\nJIM turns back.  He looks worried as he passes camera.\n\nMed. shot.  CRUNCH and MOOSE.  They stop at MOOSE's car and\nlook back at the entrance.  The parents are seen beyond\nthem, getting into their cars.  CRUNCH is near tears with\nanger.\n\n<b>                         CRUNCH\n</b>            What's he going to pull--\n\n<b>                         MOOSE\n</b>            Nothing, Crunch.  They picked him\n            up like the rest of--\n\n<b>                         CRUNCH\n</b>            You see any cops?\n\n<b>                         MOOSE'S FATHER\n</b>                   (yelling)\n            You monsters start home.  We're\n            going to--\n\n<b>                         MOOSE\n</b>            Yeah.  Yeah.\n\n<b>                         MOOSE'S FATHER\n</b>            We're following you so better get\n            there.\n\n<b>                         CRUNCH\n</b>            You see any cops?\n\n<b>                         MOOSE\n</b>            No--\n\n<b>                         CRUNCH\n</b>            He's going to cheese, I tell you.\n            Nobody arrested him!\n\n<b>                         MOOSE\n</b>            I think I should go home.\n\n<b>                         CRUNCH\n</b>            No.  We're going to bring him down.\n\n<b>                         MOOSE\n</b>            Crunch--my father's--You going to\n            kill him?\n\n<b>                         CRUNCH\n</b>                   (crying)\n            You clean out of your head?  Come on!\n\nCRUNCH gets into the car.  MOOSE follows.  They gun the\nmotor and throw the car into a sharp U-turn.  MOOSE'S FATHER\njumps into his car.  He steps on the starter but nothing\nhappens--just the empty whirring, over and over.  Finally it\nstarts, but the boys have gone.\n\nInside Precinct Station.  Juvenile division.  A desk\nsergeant is writing in the record book.  Facing him across\nthe desk and handcuffed to an officer is a young hoodlum,\nvery different in appearance from the kids we have met--a\ntypical duck-tail 'cat'.\n\n<b>                         SERGEANT\n</b>                   (spelling)\n            W-O-J-T-what?\n\n<b>                         HOODLUM\n</b>            O-W-I-C-Z.  Wojtowicz.  What's the\n            matter, man?  That's the craziest\n            name in town!  It swings!\n\n<b>                         JIM\n</b>            Excuse me--but--You know where I\n            can find--I mean I don't remember\n            his last name--\n\n<b>                         SERGEANT\n</b>            Look--can't you see I'm writing?\n\n<b>                         HOODLUM\n</b>                   (combing his duck-tail)\n            Man, this cat never stops.  He just\n            keeps going like Big Jay at a session!\n<b>                         OFFICER\n</b>            Shut up.\n\n<b>                         HOODLUM\n</b>            He's writing a book about me--\n\n<b>                         SERGEANT\n</b>            What I could write about you they\n            wouldn't print.\n\n<b>                         JIM\n</b>            I think his first name's Ray--I\n            have to see him.  It's very important.\n\n<b>                         SERGEANT\n</b>            What's the charge?\n\n<b>                         OFFICER\n</b>            Assault with a deadly weapon.\n\n<b>                         JIM\n</b>            Listen--\n\n<b>                         SERGEANT\n</b>                   (annoyed)\n            He's not here.  He's not at\n            Juvenile Hall.  I don't know where\n            he is.  He's out on a call and\n            he'll be out all night.  How old\n            are you?\n\n<b>                         JIM\n</b>            My parents know I'm out.  They know\n            I'm here.\n\n<b>                         SERGEANT\n</b>            Come back tomorrow.\n\n<b>                         JIM\n</b>            I'll wait for him.\n\n<b>                         SERGEANT\n</b>            Why don't you come back tomorrow,\n            son?\n                   (to hoodlum)\n            Ever been booked before?\n\nJIM turns away, notices a phone on the wall--puts in a coin,\nasks for a number.\n\nBedroom of JUDY's parents.  Through an open door we hear a\nradio playing-- a late disc-jockey show for teenagers in\nwhich numbers are dedicated by request.  JUDY'S MOTHER and\nFATHER are in bed, FATHER has phone in his hand.\n\n<b>                         JUDY'S FATHER\n</b>            Who wants her?  Who?  Jim who?\n            Never heard of you.\n\nHe hangs up phone, looks at his wife.  She rolls over in bed.\nThe FATHER turns off the bed lamp, then sits up, worried in\nthe dark.\n\nJUDY's bedroom.  It is her radio we have heard.  She turns\noff light, opens the door a crack, and looks out toward her\nparent's room.\n\n<b>                                            DISSOLVE TO:\n</b>\nTraveling shot.  PLATO.  He is coming up the walk to his\nhouse.  When PLATO has come a few feet, somebody whistles.\nPLATO and camera stop.  Short, quiet whistles come from the\nboxwood and shrubbery on both sides of the walk.  PLATO\nturns and starts to run, camera following.  He gets to his\ndoor, tries the key, but in his panic it will not go into\nthe lock.  Suddenly a hand reaches in and jerks him around.\nCRUNCH stands above him.  GOON closes in from the other side.\nAll very tense and hotted up!\n\n<b>                         PLATO\n</b>            What do you want!\n\n<b>                         CRUNCH\n</b>            You know what we want.  We want\n            your friend.\n\n<b>                         GOON\n</b>            We got eyes for him.\n\n<b>                         PLATO\n</b>            Listen, you guys ought to go home.\n            The cops are cruising every--\n\n<b>                         GOON\n</b>            Where does he live?\n\nPLATO reaches up swiftly and rings the bell.  GOON grabs him.\nCRUNCH cracks him.\n\n<b>                         CRUNCH\n</b>            You better tell us and I'm not\n            kidding.\n\n<b>                         PLATO\n</b>            My old man's got a gun.\n\n<b>                         GOON\n</b>            His old man's got a gun.  What do\n            you think of that!\n                   (drives a hard blow\n                   at PLATO's belly)\n            Your friend talked--\n                   (belts him again)\n            Now you talk!  Talk!\n\nThe door opens and the NEGRO WOMAN is there.  CRUNCH sends\nPLATO spinning into the house past her.  He falls.\n\n<b>                         NEGRO WOMAN\n</b>                   (yelling)\n            What you doing!  What you doing to\n            him!  You clear out of here 'fore I\n            call the police!\n\nShe swings at CRUNCH who faces her, challenging.\n\n<b>                         NEGRO WOMAN\n</b>            Clear out.  Go on!  Go on now!\n\n<b>                         MOOSE\n</b>            Let's go, Crunch.\n\nThey turn and move past camera.  PLATO gets up off the floor.\nWe hear the sound of a heap starting.  The NEGRO WOMAN\ncloses the door.\n\nInside PLATO's foyer as NEGRO WOMAN bolts the door.\n\n<b>                         NEGRO WOMAN\n</b>            Why you like to mix with bad boys\n            like that?  Why you get in trouble\n            all the--\n\n<b>                         PLATO\n</b>            I have to go out.  I have to warn him.\n\nHe starts up the stairs.  She follows him heavily.\n\n<b>                         NEGRO WOMAN\n</b>            You not going anywhere!  You\n            staying home while your mama's away.\n\nBedroom of PLATO's mother, a lacy affair with imported dolls\non the pillows.  PLATO rushes in, opens the drawer of the\nnight-table and pulls out a gun.  He checks to see that it\nis loaded.  The NEGRO WOMAN appears in the door and stares\nat him, turns on the light which illuminates the bed-lamp.\n\n<b>                         NEGRO WOMAN\n</b>            John!  What you doing with that!\n            You leave that be!  Put it down\n            before you hurt yourself.  Hear me?\n\nBut PLATO moves past her and out of the room.  She turns\nafter him.\n\n<b>                         NEGRO WOMAN\n</b>                   (continuing)\n            John!  You stay home!  John!  John!\n\nThe slam of a door is heard below.\n\n<b>                                            DISSOLVE TO:\n</b>\nJIM's garage.  Night.  JUDY waiting inside.  JIM's car pulls\nin, a radio going softly.  He turns the motor off and is\nabout to turn off the radio when we hear the announcer:\n\n<b>                         ANNOUNCER\n</b>            Coming up now another request--this\n            time from the boys down at Anna's\n            Pizza Paradise--A new arrangement\n            of a great oldie in rhythm and\n            blues.  Jim, this is dedicated to\n            you--from Buzz.\n\nJIM stares at the radio, then turns it off.\n\nAnother angle.\n\n<b>                         JUDY\n</b>            They'll be looking for you.\n\n<b>                         JIM\n</b>            They saw where I jumped!  I didn't\n            chicken!  What do I have to do--\n            kill myself?\n\n<b>                         JUDY\n</b>            It doesn't matter to them.\n\n<b>                         JIM\n</b>            You were looking for me, weren't you?\n\n<b>                         JUDY\n</b>                   (a small voice)\n            No--I was just--maybe--\n\n<b>                         JIM\n</b>            I tried to call you before.\n<b>                         JUDY\n</b>            I thought so.\n\n<b>                         JIM\n</b>            Want some milk?\n\nJUDY comes forward.\n\n<b>                         JIM\n</b>            That's all I can do when I'm\n            nervous.  Drink milk.  Here--have a\n            slug.\n\nShe shakes her head.  He takes a sip.\n\n<b>                         JIM\n</b>            You still pretty upset?\n\n<b>                         JUDY\n</b>            I'm numb.\n\nShe is shuddering a little.\n\n<b>                         JIM\n</b>            You cold?\n\n<b>                         JUDY\n</b>            Even if I'm near a fire, I'm cold.\n            I guess just about everybody's cold.\n\n<b>                         JIM\n</b>            I swear, sometimes, you just want\n            to hold onto somebody!  Judy, what\n            am I going to do?  I can't go home\n            again.\n\n<b>                         JUDY\n</b>            Neither can I.\n\n<b>                         JIM\n</b>            No?  Why not?\n                   (no answer)\n            You know something?  Sometimes I\n            figure I'll never live to see my\n            next birthday.  Isn't that dumb?\n\n<b>                         JUDY\n</b>            No.\n\n<b>                         JIM\n</b>            Every day I look in the mirror and\n            say, \"What?  You still here?\" Man!\n\nThey laugh a little.\n\n<b>                         JIM\n</b>            Hey!  You smiled!\n\nJUDY shakes her head--beginning to warm to him.\n\n<b>                         JIM\n</b>            Like even today.  I woke up this\n            morning, you know?  And the sun was\n            shining and everything was nice.\n            Then the first thing that happens\n            is I see you and I thought this is\n            going to be one terrific day so you\n            better live it up, boy, 'cause\n            tomorrow maybe you'll be nothing.\n\n<b>                         JUDY\n</b>            I'm sorry I treated you mean today.\n            You shouldn't believe what I say\n            when I'm with the kids.  Nobody\n            acts sincere.\n\n<b>                         JIM\n</b>            Why'd you get mixed up with them?\n            You don't have to prove anything.\n\n<b>                         JUDY\n</b>            If you knew me you wouldn't say that.\n\n<b>                         JIM\n</b>            I don't think you trust anybody, do\n            you?\n\n<b>                         JUDY\n</b>            Why?\n\n<b>                         JIM\n</b>            I'm getting that way, too.\n\n<b>                         JUDY\n</b>                   (looks at him)\n            Have you ever gone with anyone who--\n\n<b>                         JIM\n</b>            Sure.  Lots of times.\n\n<b>                         JUDY\n</b>            So have I.  But I've never been in\n            love.  Isn't that awful?\n\n<b>                         JIM\n</b>                   (smiling)\n            Awful?  No.  It's just lonely.\n            It's the loneliest time.\n\nShe looks up.  He kisses her forehead.\n\n<b>                         JUDY\n</b>            Why did you do that?\n\n<b>                         JIM\n</b>            I felt like it.\n\n<b>                         JUDY\n</b>            Your lips are soft when you kiss.\n\nJUDY rises.\n\n<b>                         JIM\n</b>            Where you going?\n\n<b>                         JUDY\n</b>            I don't know, but we can't stay here.\n\n<b>                         JIM\n</b>            Where can we go?  I can't go back\n            into that zoo.\n\n<b>                         JUDY\n</b>            I'm never going back.\n\n<b>                         JIM\n</b>            Listen!  I know a place!  PLATO\n            showed me before.  An old deserted\n            mansion near the planetarium\n                   (rises)\n            Would you go with me?\n\nJUDY hesitates.\n\n<b>                         JIM\n</b>            You can trust me, Judy.\n\n<b>                         JUDY\n</b>            I feel as if I'm walking under water.\n\nThey start out.\n\n<b>                                            DISSOLVE TO:\n</b>\nInside bathroom.  JIM's house.  The water is running in the\nsink and JIM's father is fixing a stomach settler.  Gradually\nhe grows aware of a heavy pounding which insinuates itself\nabove the splash of water.  The FATHER pauses, then turns\noff the tap.  The pounding continues.  JIM'S MOTHER appears\nat the bathroom door.  She is seen in the mirror tying her\nrobe.\n\n<b>                         MOTHER\n</b>            Frank?  I'm frightened.\n\n<b>                         FATHER\n</b>            What's that pounding?\n\n<b>                         MOTHER\n</b>            I don't know.  First I thought it\n            was Jim but--\n\n<b>                         FATHER\n</b>            He's home.  I heard the car.\n\n<b>                         MOTHER\n</b>            Are you going down there?\n\n<b>                         FATHER\n</b>            Look--just relax, will you?\n\nThe pounding ceases.\n\n<b>                         FATHER\n</b>            See?  It stopped.\n\n<b>                         MOTHER\n</b>            I still think you should go down.\n\nHe goes out of the bathroom, into the hall.\n\nFoyer.  JIM's house as the FATHER comes down the stairs,\nturning on the light as he comes.  He reaches the door and\npauses.  The MOTHER stops midway down the stairs.\n\n<b>                         FATHER\n</b>                   (through the door)\n            Who's there?\n                   (silence)\n            Anyone there?\n\n<b>                         MOTHER\n</b>                   (low; at balustrade)\n            Open it.\n\nThe FATHER opens the door and looks up sharply.\n\nClose shot.  Door.  FATHER's head in f.g. as he stares at it.\nNailed to the door by its outstretched wings, its head\nhanging in an attitude of crucifixion, is the freshly killed\ncarcass of a chicken.  Low whistles are heard from outside.\nThe FATHER, frightened, looks out into the night.\n\nFull shot.  Front lawn and street.  Shooting over the\nFATHER's head.  The whistling continues.\n<b>                         FATHER\n</b>                   (hoarsely)\n            Who's out there?\n\n<b>                         VOICE\n</b>            Where's your son?\n\n<b>                         FATHER\n</b>            What?\n\n<b>                         ANOTHER VOICE\n</b>            Where's your baby boy gone to,\n            Daddy?  We want him.\n\nSuddenly the FATHER slams the door and rushes past us into\nthe house.\n\nFull shot.  Foyer as the FATHER rushes to the bottom of the\nstairs.\n\n<b>                         FATHER\n</b>            Look in his room!\n\nThe MOTHER disappears.\n\n<b>                         FATHER\n</b>            Jim!  Jim!\n\nThe FATHER dashes into the living room, then into the hall\nagain and down through the kitchen door.\n\nBack yard as the FATHER comes out.  He closes the door\nquietly and calls in a low voice:\n\n<b>                         FATHER\n</b>            Son?\n\nHe stares around the yard, then hurries to the garage.\nJIM's car is missing.  He looks up suddenly.\n\nReverse shot.  JUDY'S FATHER seen across the alley wall.  He\nis standing in his own back yard.\n\n<b>                         JUDY'S FATHER\n</b>            Is anything wrong?  I'm your neighbor.\n\nMed. shot.  JIM'S FATHER.  He smiles feebly.\n\n<b>                         FATHER\n</b>            Oh, no, thanks.  I just wanted to--\n            to be sure my garage was closed.\n\nJIM'S FATHER closes his garage door and walks back toward\nhis house.\n\n<b>                         MOTHER (O.S.)\n</b>            Is he there?\n\n<b>                         FATHER\n</b>            No, honey.  No, he's not here.\n\nHe starts for the house again after a quick look in the\ndirection of JUDY'S FATHER.\n\nFull shot.  JUDY's back yard.  JUDY'S FATHER watches MR.\nSTARK disappear, then...\n\n<b>                         JUDY'S FATHER\n</b>                   (softly)\n            Judy?\n\nThe alley by JIM's house.  PLATO drives up on scooter.  He\nchecks the garage, sees JIM's car is gone, is about to take\noff in confusion, hears door slam in JIM's back yard, shuts\noff engine, fixes tie, combs hair, goes in the fence gate to\nJIM's back yard.\n\nFull shot.  JIM's back yard.  JIM'S FATHER is coming toward\nhim.  JIM'S FATHER and PLATO simultaneously say:\n\n<b>                         FATHER\n</b>            What are you doing?\n\n<b>                         PLATO\n</b>            Where's Jim?\n\n<b>                         FATHER\n</b>            I don't know.  Do you--do you know\n            where he is?\n\n<b>                         PLATO\n</b>            No.  No, I don't.\n\nCloseup.  PLATO remembers about the mansion--then almost to\nhimself:\n\n<b>                         PLATO\n</b>            I know where--\n\nBack to full shot.  FATHER and PLATO.\n\n<b>                         PLATO\n</b>            Hope I didn't bother you.  Goodnight.\n\nHe runs to scooter.\n\n<b>                         FATHER\n</b>            Hey, come back here.  Who are you?\n\n<b>                                            DISSOLVE TO:\n</b>\nSplit screen montage.  It begins with a telephone ringing\nalone in the corner of the screen.  As camera moves back we\nsee that the phone is in an office at Juvenile Hall.  RAY is\nstanding by, trying to make sense out of the incoming reports.\n\nThe other part of the screen lights up and becomes:\n\nBedroom of PLATO'S MOTHER where the NEGRO WOMAN is speaking\nhysterically into the phone.\n\nBedroom of JUDY's parents.  The FATHER is on the phone.\nBEAU has awakened and is crying.  His MOTHER tries to divert\nhim.\n\nJIM's bedroom.  JIM'S FATHER sits disconsolately on the bed,\nthe phone in his hand.  He is talking earnestly.\n\nDuring this the sound of the telephone ringing has increased\nto become the sound of many and this has been submerged in a\ndeep rising riot of sirens whose wail mounts higher and\nhigher until:\n\n<b>                                            DISSOLVE TO:\n</b>\nFull shot.  Planetarium.  Moonlight.  A lone siren wails in\ndistance.  Aside from this, all is very still.  Camera pans\npast the dome and settles on an isolated mansion set high on\na hill nearby.  Stone balustrades drop down to sunken\ngardens where the grass has gone to seed around a waterless\nfountain.\n\nCloser shot.  Mansion.  Night.  A Mediterranean villa with a\nlarge domed solarium which is connected to the main building\nby a low enclosed arcade.  A crash and the falling of\nsplintered glass is heard.\n\nLong shot.  Promenade.  Shooting through pillars of the main\nentrance portico, down the long promenade outside arcade.\nTwo figures, seen in the distance, are disappearing through\na window.  Camera tracks down promenade until it reaches a\nbroken window through which JIM is just disappearing.  When\nhe gets inside, he reaches back and takes his leather jacket\nwhich has been spread on the sill to protect them from\nsplinters, shakes it out and puts it on.  Running footsteps\nare heard approaching.  JIM looks out nervously.  PLATO\nbursts in, out of breath.\n\n<b>                         PLATO\n</b>            Jim!\n\n<b>                         JIM\n</b>            Who's that!\n\n<b>                         PLATO\n</b>            It's me!\n\n<b>                         JIM\n</b>            How'd you find me?  What's happening?\n\n<b>                         PLATO\n</b>            They're looking for you!--\n\n<b>                         JIM\n</b>            Yeah?\n\n<b>                         PLATO\n</b>            Everybody!  Crunch and Goon and\n            everybody!  I think they're going\n            to kill you.\n\n<b>                         JIM\n</b>            We know.\n\n<b>                         PLATO\n</b>            They think you told the police on\n            them.  They--who's in there?\n\n<b>                         JIM\n</b>            Judy.\n\n<b>                         PLATO\n</b>            Help me in!\n\nJIM gives PLATO a hand over the windowsill.\n\nInside arcade.  JIM and JUDY are seen in an entering shaft\nof moonlight.  PLATO hits the floor and disappears into\ndarkness.\n\n<b>                         JIM\n</b>            Hey where'd you go?\n\n<b>                         PLATO\n</b>            I'm here.  Shut up.\n\n<b>                         JIM\n</b>            Come out come out wherever you are!\n\n<b>                         PLATO\n</b>            Shut up.  Are you nuts?\n\n<b>                         JIM\n</b>            No.  I'm scared.\n\nA match flares and lights a candle on an antique Spanish\ncandelabra.  PLATO is revealed bending over it.  He lights\nthe other candles through the following:\n\n<b>                         PLATO\n</b>            We're safe here.  I hope.\n                   (holds up candelabra)\n            What do you think?\n\n<b>                         JIM\n</b>                   (gazing around)\n            Wow!  Well now-there-then!\n\nHis wonderment is justified.  The floor of the arcade is\nmarble and there are marble benches and neo-Roman busts\nlining the walls.\n\n<b>                         PLATO\n</b>            Isn't it crazy?\n\n<b>                         JIM\n</b>            Wowee ow wow!  Let's take it for\n            the summer.\n\n<b>                         JUDY\n</b>            Oh, Jim!\n\n<b>                         JIM\n</b>            No--come on.  Should we rent or are\n            we in a buying mood, dear?\n\n<b>                         JUDY\n</b>                   (laughing)\n            You decide, darling.  Remember our\n            budget.\n\n<b>                         PLATO\n</b>            Don't give it a thought.  Only\n            three million dollars a month!\n\n<b>                         JUDY\n</b>            Oh, we can manage that!  I'll\n            scrimp and save and work my fingers\n            to the bone...\n\n<b>                         JIM\n</b>            Why don't we just rent it for the\n            season?\n\n<b>                         JUDY\n</b>            You see, we've just--oh, you tell\n            him, darling.  I'm so embarrassed I\n            could die!\n\n<b>                         JIM\n</b>            Well--we're newlyweds.\n\n<b>                         JUDY\n</b>            There's just one thing.  What about--\n\n<b>                         PLATO\n</b>            Children?  Well, we really don't\n            encourage them.  They're so noisy\n            and troublesome, don't you agree?\n\n<b>                         JUDY\n</b>            Yes.  And so terribly annoying when\n            they cry.  I just don't know what\n            to do when they cry, do you dear?\n\n<b>                         JIM\n</b>            Of course.  Drown them like puppies.\n\n<b>                         JUDY\n</b>            See, we're very modern.\n\n<b>                         PLATO\n</b>            Shall I show you the nursery?  It's\n            far away from the rest of the house.\n            If you have children--Oh I hate the\n            word!--or if you decide to adopt\n            one--they can carry on and you'll\n            never even notice.  In fact, if you\n            lock them in you never have to see\n            them again, much less talk to them.\n\n<b>                         JUDY\n</b>            Talk to them!  Heavens!\n\n<b>                         JIM\n</b>            Nobody talks to children!  They\n            just tell them one thing and mean\n            another.\n\n<b>                         PLATO\n</b>            It's wonderful that you understand\n            so well--and so young too!  You\n            know the most wonderful feature\n            about the nursery?\n\n<b>                         JIM\n</b>            What?\n\n<b>                         PLATO\n</b>            There's only one key.\n\n<b>                         JIM\n</b>            We'll take it!\n\n<b>                         PLATO\n</b>            Come on!\n\nPLATO leads them away from us down the arcade, the candelabra\ncasting wild shadows on the walls.  They are laughing as\nthey disappear through the glass doors at the end and their\nlaughter echoes stonily.\n\n<b>                                            DISSOLVE TO:\n</b>\nMed. shot.  A street and an alley.  Night seen through the\nwindshield of a police car.  Its radio is on low.  Two\nofficers are in the front seat.  One of them drinks coffee\nfrom a container.  Suddenly MOOSE's heap moves past on the\nstreet ahead.  In it are MOOSE, GOON and CRUNCH.\n\nFull shot.  The street as MOOSE's heap continues up the\nempty street.  The police car slides out of the alley where\nit has been concealed, and follows at a distance.  Its\nheadlights are off.\n\nClose shot.  CRUNCH, GOON and MOOSE (Process).  They are in\nthe front seat of MOOSE's heap.\n\n<b>                         MOOSE\n</b>            What time is it?\n\n<b>                         CRUNCH\n</b>            Hang loose.  We got all night.\n\n<b>                         MOOSE\n</b>            That maid saw us.  She could\n            identify us too.\n\n<b>                         CRUNCH\n</b>            You still want to go home, Moose?\n\n<b>                         MOOSE\n</b>            No.\n\n<b>                         CRUNCH\n</b>            Then shut your mouth before your\n            guts run out!\n\n<b>                         GOON\n</b>            What guts?\n\n<b>                                            DISSOLVE TO:\n</b>\nInside glass solarium.  A swimming pool lies at the center.\nThere is no water in it.  Framing the pool is a flagstone\nwalk with marble benches spotted here and there.  The great\nglass room had once been planted thickly with tropical\nfoliage.\n\nBut now what palms and lianas remain are withered and dead\nwith lack of care.  At the edge of the pool, near the deep\nend, a blanket has been spread and a candelabra burns upon\nit.  In its mysterious light our three kids are revealed:\nJIM, bouncing precariously at the end of the diving board;\nJUDY on the blanket nearby; PLATO on the pool's bottom.  All\nthree are laughing hysterically when suddenly JIM starts to\nlose his balance.\n\n<b>                         JIM\n</b>                   (yelling)\n            Quick!  Fill the pool!\n\nJIM falls in.  PLATO rushes to him.\n\n<b>                         JIM\n</b>            Let's see how long we can stay under.\n\n<b>                         PLATO\n</b>            Man, you're schizoid!\n\n<b>                         JIM\n</b>                   (in another outburst\n                   of laughing)\n            I'm what?  What?\n\n<b>                         JUDY\n</b>            You can't talk underwater!\n\n<b>                         JIM\n</b>                   (gargling)\n            I bet you hear everything I say!\n\n<b>                         PLATO\n</b>                   (gargling)\n            Isn't he schizoid?\n\n<b>                         JIM\n</b>                   (gargling)\n            Hey!  How 'bout that!\n\nThey laugh again.  JIM swings up the ladder and goes to JUDY.\nPLATO follows.\n\n<b>                         PLATO\n</b>            Haven't you noticed your personality\n            splitting?\n\n<b>                         JIM\n</b>            Not lately.\n\nThey all sit on the blanket.\n\n<b>                         JIM\n</b>            How do you know so much about this\n            junk, Plato?\n\n<b>                         PLATO\n</b>            I had to go to a head-shrinker.  I\n            only went twice though.  My mother\n            said it cost too much, so she went\n            to Hawaii instead.\n\nJIM lies back with his head in JUDY's lap.  She strokes his\nhair and smiles at him.  PLATO looks away.\n\n<b>                         JIM\n</b>            No.  Seriously.  What's your trouble?\n\nPLATO hesitates a moment, then leans back, cuddling between\nthe two of them.\n\n<b>                         PLATO\n</b>            I don't know but whatever it is,\n            it's gone now.  I mean I'm happy\n            now.  Here.\n\nJIM puts his arm under PLATO's chin.\n\n<b>                         PLATO\n</b>            I came here before.\n\n<b>                         JIM\n</b>            When was that?\n\n<b>                         PLATO\n</b>            When I was here?  When I ran away.\n            I used to run away a lot but they\n            always took me back.\n\n<b>                         JIM\n</b>            Who?\n\n<b>                         PLATO\n</b>            Mom and Dad.  I used to be in my\n            crib and I'd listen to them fight.\n\n<b>                         JIM\n</b>            You remember that far back?  Boy, I\n            can't even remember yesterday.\n\n<b>                         JUDY\n</b>            Plato, where's your father now?\n\n<b>                         PLATO\n</b>            He's dead.  He was a hero in the\n            China Sea.\n<b>                         JIM\n</b>            You told me he's a big wheel in New\n            York!\n\n<b>                         PLATO\n</b>            I did?  Well, he might as well be\n            dead.  What's the difference?\n\n<b>                         JUDY\n</b>            It's all right.\n\n<b>                         JIM\n</b>            Sure.\n\nPLATO closes his eyes.  JUDY hums a lullaby as she strokes\nJIM's lips with a finger.  He snaps at it.  Then he kisses\nher hand, looks at her palm.  They whisper.\n\n<b>                         JIM\n</b>                   (continuing)\n            You have a long life-line.\n\nShe takes his palm and examines it.\n\n<b>                         JUDY\n</b>            So have you.\n\nShe kisses it, holds her cheek against it.\n\n<b>                         JIM\n</b>            Ever been in a place like this before?\n\n<b>                         JUDY\n</b>            Not exactly.  It's certainly huge.\n\n<b>                         JIM\n</b>            How many rooms do you think there are?\n\n<b>                         JUDY\n</b>            I don't know.\n\n<b>                         JIM\n</b>            Should we explore?\n\nShe looks at PLATO.  JIM shrugs--tests to see if the boy is\nawake, but there is no reaction.\n\nCarefully, they crawl to their feet.  JIM supporting PLATO's\nhead with his hands as they do so.  JIM takes the other\nblanket and covers PLATO with it.  JUDY kneels on the other\nside and tucks it in.  They look at each other across him\nand smile.  Then suddenly JUDY bends down and kisses PLATO's\ncheek very softly.  JUDY and JIM rise.\nJIM takes a candle from the candelabra and leads JUDY along\nthe edge of the pool to the glass doors beyond.  Silence\nexcept for their footfalls on the flagstone.  In the\ndistance we see the doors open and the couple pass through.\nWhen they close again, a sob comes from PLATO.\n\nHigh angle closeup.  PLATO lying as they left him, but his\neyes are open and he is crying.  Camera booms up as PLATO\nthrows off the blanket and looks after them.  Camera booms\nhigher until he is revealed as a small and lonely figure\nsitting by himself.  The pool echoes his weeping.\n\n<b>                                            DISSOLVE TO:\n</b>\nInside library.  Mansion.  Night.  The door opens slowly and\nJIM appears with the candle.  JUDY lingers at the door.  The\nflickering light reveals a formerly lavish room, paneled in\noak.  There is a tapestry couch, empty bookcases, some dim\nportraits, a leather table and several chairs around a great\nstone fireplace.\n\n<b>                         JIM\n</b>            Hey!  Will you look at this room!\n                   (looks behind him)\n            Judy?\n\nShe comes forward.  JIM drips wax on the table-top and\nsticks the candle on it.  His hand shakes.  JUDY sits on the\ncouch.\n\n<b>                         JIM\n</b>                   (continuing)\n            Want to read any books?  Take your\n            pick!\n                   (sits beside her)\n            Isn't this the craziest?\n\n<b>                         JUDY\n</b>            Hi.\n\n<b>                         JIM\n</b>            Hi.\n\nHe takes her hand.  She looks at him and smiles.\n\n<b>                         JIM\n</b>                   (continuing)\n            What?\n\n<b>                         JUDY\n</b>            Your hand's all wet and it's shaky.\n                   (kisses it)\n            You're so funny.\n\n<b>                         JIM\n</b>            Why?\n\n<b>                         JUDY\n</b>            I don't know--you just are.\n            Leaving a light for Plato.  That\n            was nice.\n\n<b>                         JIM\n</b>            Maybe he's scared of the dark.\n\n<b>                         JUDY\n</b>            Are you?\n\nJIM snuffs out the candle.  They are left in moonlight.  A\npause.\n\n<b>                         JIM\n</b>                   (singing)\n            Here we are--\n            out of cigarettes--\n            Junior's in the nurs'ry--\n            See how late it gets--\n\n<b>                         JUDY\n</b>            You don't need to do that.\n\n<b>                         JIM\n</b>            There's something I should tell\n            you, Judy.\n\n<b>                         JUDY\n</b>            I know already.  We don't have to\n            pretend now.\n\n<b>                         JIM\n</b>                   (laughing)\n            What a relief!\n\nHe leans back, relaxed at last.  She snuggles close to him.\n\n<b>                         JUDY\n</b>            Is this what it's like to love\n            somebody?\n\n<b>                         JIM\n</b>            You disappointed?\n\n<b>                         JUDY\n</b>                   (mussing her hair)\n            Funny Jimmy.  You're so clean and\n            you--this is silly.\n\n<b>                         JIM\n</b>            What?\n\n<b>                         JUDY\n</b>            You smell like baby powder.\n\n<b>                         JIM\n</b>            So do you.\n\n<b>                         JUDY\n</b>            I never felt so clean before.\n\n<b>                         JIM\n</b>            It's not going to be lonely, Judy.\n            Not for you and not for me.\n\n<b>                         JUDY\n</b>            I love somebody.  All the time I've\n            been looking for someone to love me\n            and now--I love somebody.  And it's\n            so easy.  Why is it easy now?\n\n<b>                         JIM\n</b>            It is for me too.\n\n<b>                         JUDY\n</b>            I love you, Jim.  I really mean it.\n\nShe kisses his lips gently and looks into his face.  He\nreturns the kiss.  Their arms go around each other.\n\n<b>                         JIM\n</b>            I mean it too.\n\nHe kisses her again--\n\nFull shot.  Road near Planetarium.  MOOSE's heap crawls up\nand turns left.  A moment later, the police car appears and\ndoes likewise--still holding its distance.\n\nFull shot.  The mansion as MOOSE's heap moves past on the\nroad below.  Suddenly it stops.\n\nInside MOOSE's heap.  CRUNCH looks off, curious.\n\n<b>                         GOON\n</b>            What you stopping for?\n\n<b>                         CRUNCH\n</b>            You scam a car up there?\n\n<b>                         MOTHER\n</b>            So what?\n\n<b>                         CRUNCH\n</b>            Nobody's lived in that hunk of junk\n            for five-six years.\n\nHe switches on the spotlight.  It illuminates JIM's heap.\n\n<b>                         CRUNCH\n</b>            Well, what do you know!  I feel a\n            kick coming on!\n\nHe turns off all the lights and gets out.  The others follow.\n\nMed. shot.  Police car.  It has halted.  One of the officers\ngets out and draws his gun.  The other makes radio contact\nin a low voice:\n\n<b>                         OFFICER\n</b>            This is Unit 17.  Unit 17.\n\n<b>                         RADIO\n</b>            Come in, Unit 17.\n\n<b>                         OFFICER\n</b>            We just zeroed three kids in a heap.\n            Crest Drive and Observatory.  Looks\n            like house-breaking.  Send us some\n            help.  They may be armed.  Over.\n\nClose shot.  PLATO asleep on the blanket.  Only a single\ncandle burns in the candelabra.  The same low whistles heard\nearlier come from all around him and rise in volume.\nSuddenly his eyes open.  He doesn't move, but he has come\nsuddenly awake.\n\nLow shot.  PLATO lying in f.g.  Next to his face are a pair\nof booted feet.  He looks up.  Camera pans up to show CRUNCH.\nHe is smiling.  He holds a tire chain in his hand which he\nswings.\n\n<b>                         CRUNCH\n</b>            Good morning.\n\nFull shot.  The swimming pool.  GOON and MOOSE are behind\nCRUNCH.  They too are armed with tire chains.  They all\nlaugh.  PLATO rolls away from them and runs toward the deep\nend of the pool.\n\n<b>                         CRUNCH\n</b>            Moose!  Take the steps!  Goon!  The\n            other side.\n\nThe boys run to their assigned places.  PLATO sees no exit.\nHe flings himself down the ladder and into the pool.  He\nfeints this way and that, the boys responding as if they\nwere fencing.  CRUNCH swings down the ladder and his boots\nmake a loud report as they hit the pool.  MOOSE advances\ndown the steps at the shallow end.  GOON climbs onto the\npool bottom at the opposite side.  The feinting continues,\nwordlessly, as the circle closes around PLATO.  The only\nsounds are the stamping of their boots as they try to\ndistract him from side to side, and the animalistic grunts\nthey make to scare him.  Suddenly PLATO sees an opening and\nplunges past MOOSE, pushing him over, and stumbles up the\nsteps.\n\n<b>                         CRUNCH\n</b>            Come on!  Let's make it!\n\nThey stream out of the pool after PLATO.  He reaches the\nglass doors first, streaks though, and bangs them shut\nbehind him.\n\nTraveling shot.  Arcade.  PLATO's face is visible only when\nthe moonlight strikes him through the passing windows.  The\nsound of running steps behind him.\n\nFull shot.  Main room.  A pattern of moonlight on the bare\nfloor as PLATO dashes in and through it.  He falls over a\npiece of furniture and comes scurrying in to camera, wheels\naround on hands and knees to face the door.  The boys plunge\ninto the moonlit square and stop.  PLATO tries not to\nbreathe.  A match is struck.  CRUNCH looks around, but can\nsee nothing.  That match goes out.  The boys start up the\nstairs, whispering.  Immediately, PLATO crawls forward,\nunder the piano.  He hears a murmur of voices from behind\nthe oak door of the library--next to the piano.  He moves to\nit stealthily.\n\nClose shot, PLATO at door listening through it, on hands and\nknees.  His confusion mounts.  He shakes his head to clear\nit.  Then, suddenly he rises and tries the knob.  The door\nis locked.  He beats on it.\n\n<b>                         PLATO\n</b>            Save me!\n\nThe boys run across the room.  As they hit the moonlit\nsquare.  PLATO spins and fires.  Somebody drops and starts\nmoaning.  JIM opens the door.\n\n<b>                         PLATO\n</b>                   (shrieks)\n            What you run out on me for!  What\n            you leave me alone for?\n\n<b>                         JIM\n</b>            Plato!\n\nThere is a rush of boys coming forward.\n\n<b>                         PLATO\n</b>                   (with hate)\n            I don't want you for my father!\n\n<b>                         JIM\n</b>            Your father!\n\nPLATO fires at JIM.  JIM leaps at PLATO with a cry and\nknocks him down.\n\n<b>                         JIM\n</b>                   (in rage)\n            You crazy nut!  You crazy, crazy nut!\n\n<b>                         PLATO\n</b>                   (screaming)\n            Get away from me!\n\nHe rolls away from JIM and runs to the main door.\n\n<b>                         JUDY\n</b>            Jim!\n\nMain door, from inside.  PLATO falls upon it, fumbles with\nthe bolt and swings the door wide.  He steps out into the\nwaning moonlight and we see him running down the lawn.  JIM\nrushes into the doorway and stops short.\n\nFull shot.  Mansion.  The OFFICERS are moving away from us\ntoward it.  PLATO runs wildly toward them.\n\n<b>                         OFFICER\n</b>                   (sharply)\n            Halt!\n\nPLATO stops, confused.\n\n<b>                         OFFICER\n</b>                   (continuing)\n            Come here.\n\nJIM runs out on the promenade and starts over the balustrade.\n\n<b>                         JIM\n</b>            Plato!\n\nClose shot.  PLATO.  His face is working desperately in\ngrowing panic.\n\n<b>                         OFFICER (O.S.)\n</b>            Come here, son.\n\n<b>                         PLATO\n</b>            No!\n\n<b>                         JIM (O.S.)\n</b>            Plato!\n\n<b>                         OFFICER (O.S.)\n</b>            Just walk over here quietly now--\n            and there won't be any trouble.\n\nPLATO runs out.\n\nClose shot.  JIM as he screams.\n\n<b>                         JIM\n</b>            Plato!\n\nFull shot.  Main doorway as JUDY rushes out, followed by\nGOON and MOOSE.  They all stop dead at the balustrade.\n\n<b>                         JUDY\n</b>            Jim!  Watch out!\n\nReverse shot.  Lawn.  JIM seen in f.g.  PLATO bolting toward\nthe woods in the direction of the planetarium.  The officers\nhave both hit the ground in the distance.  They fire again.\nJIM hesitates a moment, then rushes after PLATO.  The\nofficers fire again.\n\nMoving shot.  JIM as he runs after PLATO.\n\nMed. shot.  OFFICERS as they rise to their feet.\n\n<b>                         FIRST OFFICER\n</b>            Take the house!  I'll head him off.\n\nFull shot.  Front of mansion.  JUDY flies down the stairs\nand rushes past camera.\n\n<b>                         OFFICER (O.S.)\n</b>            Halt!  Halt!\n\nProwl car.  Another part of town (Process).  RAY is driving.\nJIM's father is beside him.  The mother is in the back seat.\n\n<b>                         RADIO\n</b>            --located at Summit Drive--the\n            Planetarium.\n<b>                         RAY\n</b>                   (snapping on mike)\n            The planetarium?  One kid inside--\n            five housebreaking in area.  Will\n            proceed.\n                   (turning to JIM's parents)\n            There are some kids in trouble--\n            you'll have to go with me.\n\n<b>                         FATHER\n</b>            Perfectly all right.\n\nEdge of woods as JIM hurtles in from the open ground beyond.\nHe stumbles against a tree and sinks down.\n\n<b>                         JIM\n</b>                   (yelling)\n            Plato!\n\nTraveling shot in the woods as PLATO rushes through the\nmoonlit trees, sobbing.\n\n<b>                         JIM (O.S.)\n</b>                   (distant)\n            Plato!\n\nMed. shot.  JIM at the base of a tree.  He is whimpering,\nshaking his head.  JUDY crashes through the brush and drops\nbeside him.\n\n<b>                         JUDY\n</b>            Did he hit you?\n\nShe is on the verge of hysteria.\n\n<b>                         JIM\n</b>            No!\n\n<b>                         JUDY\n</b>            We have to go back!\n\n<b>                         JIM\n</b>            No!  I got to find him.\n\nHe starts to rise.\n\n<b>                         JUDY\n</b>            After he tried to shoot you?\n\n<b>                         JIM\n</b>            He didn't mean it--we shouldn't\n            have left him.  He needed us.\n\n<b>                         JUDY\n</b>            He needed you, maybe.  So do I.\n\nThere is a sound of distant gunfire.  Both kids freeze.\n\n<b>                         JIM\n</b>            He needs you too.  Come on.\n\nJUDY, breaking into a run, follows after him through the brush.\n\n<b>                         JUDY\n</b>            You should have heard him talk\n            about you tonight.  Like you were\n            the hero in the China Seas.\n\n<b>                         JIM\n</b>            Sure.  He was trying to make us his\n            family.\n\n<b>                         JUDY\n</b>            They're killing him!\n\nJIM runs ahead blindly and disappears in the trees.  JUDY\nrushes after him a few steps, then stops.\n\nJUDY and JIM running.\n\nPLATO running.\n\nThe planetarium.  Moonlight.  Shooting from the bridle path\nand panning to the building.  PLATO reels in and goes to the\nfront door.\n\nMed. shot.  Door to planetarium.  PLATO clutches the handle.\nThe door is locked.  He whimpers once in frustration.\n\nMed. shot.  Policeman running up same path PLATO has followed.\n\nPLATO at door to planetarium.  He smashes the glass with his\ngun and dives through.\n\nInside planetarium as PLATO lands.  He is cut and bleeding.\n\n<b>                         OFFICER (O.S.)\n</b>            Come out of there.\n\nPLATO wheels and skitters backward across the floor of the\nobservatory on his hands and knees until he comes to the\ndoor of the planetarium theater.\n\nReverse shot.  Main entrance.  Seen from inside.  The\nOFFICER in b.g., PLATO in f.g.  The OFFICER appears in the\nentrance, then moves quickly to one side to be less of a\ntarget.  He reaches in to unlatch the door.\n\n<b>                         OFFICER\n</b>            You're making it tough on yourself,\n            kid.  Come out quietly now.  You\n            didn't kill anybody yet.\n\nPLATO fires at him, then opens the door of the planetarium\ntheater and runs inside.  The door swings shut behind him.\n\nOutside planetarium.  The OFFICER is hugging the outside\nwall.  Another siren wails and a spotlight catches the\nOFFICER who runs out into the light.\n\n<b>                         OFFICER\n</b>                   (running)\n            Need a little help here!\n\nFull shot.  Parking lot as the CHIEF's car wheels to a stop.\nIt is followed by a civilian car and a cab.\n\nCHIEF's car.\n\n<b>                         CHIEF\n</b>            We heard firing.  He get anybody?\n            You alone?\n\n<b>                         OFFICER\n</b>            We got a cookaboo inside.  He\n            wounded some kid earlier.\n\n<b>                         CHIEF\n</b>            How'd he get in?\n\n<b>                         OFFICER\n</b>            Smashed the front door.\n\n<b>                         CHIEF\n</b>            Any other entrance?\n\n<b>                         OFFICER\n</b>                   (leaving)\n            Down in back.\n\nMed. shot.  Bushes bordering planetarium as JIM climbs\nthrough them and stops short, staring in amazement.  JUDY is\nin b.g.\n\nFull shot.  Parking lot.  JIM seen in f.g. hiding in the\nscreen of leaves.  Beyond we see the full activity--the\ncrowd, the cars, searchlights playing on the planetarium\nentrance, police moving in under direction of the CHIEF.\n\n<b>                         CHIEF\n</b>                   (loud on speaker)\n            Silence.  Please maintain silence.\n            Keep back and stay off the\n            pavements.  Keep back and stay off\n            the pavements.  There will be\n            emergency vehicles coming through.\n            This warning is for your own\n            protection.\n\nRAY's prowl car come in.  JIM's parents climb out, curious.\nRAY hurries to consult with an officer who briefs him, then\nhurries to the chief's car.\n\nParking lot.  Several patrol cars now line the parking lot.\nThe NEGRO WOMAN in her nightgown and overcoat pushes forward\nfrom a cab and accosts an OFFICER.\n\n<b>                         NEGRO WOMAN\n</b>            What's going on?\n\n<b>                         OFFICER\n</b>            I don't know, lady.  Some kid's in\n            trouble.  Stand back, please.\n\n<b>                         NEGRO WOMAN\n</b>            I got to know.  My boy run off\n            tonight.  He had a gun with him, too.\n\nMed. shot.  CHIEF's car as RAY hurries in.\n\n<b>                         CHIEF\n</b>            Hello, Ray--Know anything about this?\n\n<b>                         RAY\n</b>            As much as you do--Loan me your\n            mike, will you?\n\n<b>                         CHIEF\n</b>                   (handing it to him)\n            Help yourself.\n\n<b>                         RAY\n</b>                   (into mike)\n            I am addressing the boy in the\n            planetarium.  I am speaking to the\n            boy inside.  This is Ray Framek\n            from the Juvenile Division--\n\nClose-up JIM as he reacts to RAY's name.  He rises and looks\noff.\n\n<b>                         RAY (O.S.)\n</b>                   (over speaker)\n            You are now surrounded.  You are\n            surrounded by many armed police.\n            Whoever you are, drop your weapon\n            and come outside.\n\nMed. shot.  JIM'S FATHER standing by RAY's car, gazing off\nwith interest.  His wife comes out and stands beside him,\nlooks at him questioningly.\n\n<b>                         RAY (O.S.)\n</b>                   (over speaker)\n            Come outside.  Clasp your hands\n            over your head and come outside\n            quietly--\n\nThe FATHER's gaze has traveled over the scene.  Suddenly he\nsees his son followed by JUDY, run into the planetarium.\n\n<b>                         MOTHER\n</b>            Frank!\n\n<b>                         FATHER\n</b>            Stay here.\n                   (goes over to RAY)\n            That was my son!\n\n<b>                         RAY\n</b>            You sure?\n\n<b>                         FATHER\n</b>            I think I know my son.\n\nThe FATHER moves behind the crowd, camera trucking with him,\nuntil he reaches the bushes at the edge of the parking lot\nand stops, gathering himself.  Meanwhile RAY's voice\ncontinues over:\n\n<b>                         RAY (O.S.)\n</b>                   (over speaker)\n            Jim Stark!  I'm addressing Jim\n            Stark.  Nobody will harm you or\n            your friends if you follow these\n            instructions.  We are here to\n            protect you.  Drop your guns and\n            come outside.  Nobody will hurt you\n            if you do as I say--\n\nThe FATHER starts forward along the bushes as if stalking\ngame.  Each step is carefully placed and quiet, but his\nheart tugs him along like a kite dragging an anchor.\n\n<b>                         CHIEF\n</b>            Officers!  Another boy and girl\n            just ran into the planetarium.  We\n            do not know if they are armed.\n            Hold your positions until further\n            instruction.\n\nInside planetarium as JIM comes dashing in, spins around,\nstaring.  JUDY follows.  A siren is heard outside growing\nshrill.\n\n<b>                         CHIEF (O.S.)\n</b>                   (over speaker)\n            Ambulance.  Ambulance is coming\n            through.  Clear a passage.  Will\n            you people make way there?\n\nFloodlights strike the door and illuminate the lobby dimly.\n\n<b>                         JIM\n</b>                   (softly)\n            Plato?\n\nSilence.  JIM moves cautiously to the door of the planetarium\ntheater.  JUDY hangs back.  Another siren is heard\napproaching.  More floodlights strike the door.\n\n<b>                         JIM\n</b>                   (continuing - calling softly)\n            Plato?  Plato, you in there?\n                   (silence)\n            Hey, I'm going to open the door now.\n            You'll be able to see me and you\n            can shoot me if you want, but just\n            remember one thing, Plato--You're\n            my friend.  That means a lot to me.\n\nJIM opens the door slowly.\n\nInside theater.  Darkness except for the splash of light\nfrom the door where JIM stands in silhouette.  He lets the\ndoor close.  Blackness.\n\n<b>                         JIM\n</b>            Plato?\n\n<b>                         PLATO\n</b>            I'm here.\n\n<b>                         JIM\n</b>            Boy, I'm blind as a bat!  You got a\n            match?  I'm going to break my neck\n            in here.  Where are you?\n\n<b>                         PLATO\n</b>            I've got a gun.\n\n<b>                         JIM\n</b>            I know.  Light a match, will you?\n\nPLATO obeys.\n\n<b>                         JIM\n</b>            That's swell.  How are you?\n\n<b>                         PLATO\n</b>            I'm fine.\n\nAnother siren is heard outside.  JIM has reached the\nlecturer's desk and, just as the match goes out, he throws a\nswitch.  The stars appear on the dome and the projector\nstarts its slow revolution.\n\n<b>                         PLATO\n</b>            You think the end of the world will\n            come at nighttime, Jim?\n\n<b>                         JIM\n</b>            No.  At dawn.\n\n<b>                         PLATO\n</b>            Why?\n\n<b>                         JIM\n</b>            I just have a feeling.  Where are you?\n\n<b>                         PLATO\n</b>            Here.\n\n<b>                         JIM\n</b>            Well, stop hiding and stand up.  I\n            can't talk to you if I don't see you.\n\nJIM waits.  Nothing happens.\n\n<b>                         JIM\n</b>            Hey, look at the stars, Plato.\n            Stand up and look at the stars.\n\nPlato rises from behind a row, then JIM continues:\n\n<b>                         JIM\n</b>            That's fine.\n\nJIM approaches slowly.\n\n<b>                         JIM\n</b>            I'm not going to hurt you.\n<b>                         PLATO\n</b>            Why did you run out on me?\n\n<b>                         JIM\n</b>            We didn't run out.  We were coming\n            right back.\n\n<b>                         PLATO\n</b>            You sure?\n\n<b>                         JIM\n</b>            Sure I'm sure.  Judy's waiting.\n            You ready to come out now?\n\nA siren is heard.\n\n<b>                         PLATO\n</b>            No.\n\n<b>                         JIM\n</b>            I promise nothing'll happen if you\n            do.\n                   (silence)\n            You want my jacket?  It's warm.\n\nJIM takes off his jacket and holds it out to PLATO.\n\n<b>                         PLATO\n</b>            Can I keep it?\n\n<b>                         JIM\n</b>            What do you think?\n\nJIM gives him the jacket--PLATO puts it on.\n\n<b>                         JIM\n</b>            You want to give me your gun now,\n            Plato?\n\n<b>                         PLATO\n</b>            My gun?\n\n<b>                         JIM\n</b>            In your pocket.  Give it to me.\n\n<b>                         PLATO\n</b>            I need it.\n\n<b>                         JIM\n</b>            You trust me, don't you?  Just give\n            it to me for a second.\n\nPLATO hands him the gun.  JIM removes the cartridges and\nputs them in his pocket.\n\n<b>                         PLATO\n</b>            You promised to give it back.\n\n<b>                         JIM\n</b>            Friends never break promises, do\n            they?\n                   (gives him back the gun)\n            Okay.  Here.  Now listen.  There\n            are a lot of people outside and\n            they all want you to be safe.  You\n            understand that?  They said I could\n            come in and bring you out.\n\n<b>                         PLATO\n</b>            Why?\n\n<b>                         JIM\n</b>            They like you.  Okay?\n\n<b>                         PLATO\n</b>            Come on!\n\nJIM opens the door for PLATO, then follows him out.  JUDY\njoins them.\n\n<b>                         JUDY\n</b>            Hi, Plato!\n\n<b>                         PLATO\n</b>            Hi.\n\nObservatory as JIM, JUDY and PLATO come to the entrance.\nPLATO sees an OFFICER.\n\n<b>                         PLATO\n</b>            Who's that?\n\n<b>                         JIM\n</b>            Just a guard.\n\n<b>                         PLATO\n</b>            I shot at one of them.\n\n<b>                         JIM\n</b>            But you didn't hurt anybody.\n\nOutside observatory as PLATO and JIM come forward into the\nearly dawn.  PLATO stops and looks off, scared.\n\nSlow pan shot.  The crowd.  It has grown enormously.\nSilence.  There are armed officers everywhere--all waiting,\nalert.\n\nMed. shot.  NEGRO WOMAN.  Her eyes are moist.  Her lips move\nin silent prayer.\n\nMed. shot.  JIM's parents.  The FATHER looking on anxiously.\nThe MOTHER is crying against the car.\n\nMed. shot.  JIM and PLATO.\n\n<b>                         PLATO\n</b>            Those aren't my friends.  Make them\n            go away.\n\n<b>                         JIM\n</b>                   (tense; calling past camera)\n            Ray!  Will you tell these guys to\n            move back?\n\nSuddenly PLATO bolts.  JIM wheels after him.\n\n<b>                         JIM\n</b>                   (yelling)\n            Plato!  Don't be a fool!\n\nFull shot.  Planetarium as PLATO dashes to the stairway\nleading to the balcony.\n\nJIM'S FATHER and MOTHER.  Their faces reflect panic as they\nsee PLATO running in JIM's coat.\n\n<b>                         MOTHER\n</b>            It's Jim!\n\nFull shot.  Balcony.  Shooting down the stairs as PLATO\nrushes up.  JIM closes behind him.  Camera pans with PLATO\nas he climbs the ladder to the ledge of the small dome.  JIM\nstops at the foot of the ladder.\n\n<b>                         JIM\n</b>            Plato!\n\n<b>                         PLATO\n</b>            Keep away from me!  I don't believe\n            you anymore!\n\nHe raises the gun as if to shoot JIM.  An OFFICER drops to\none knee and fires a shot at PLATO.\n\nFull shot.  Small dome.  PLATO drops like a stone to JIM's\nfeet.\n\nClose-up.  JIM.\n\n<b>                         JIM\n</b>                   (screaming--wildly)\n            But I've got the bullets!  The gun\n            was empty!\n\nClose shot.  NEGRO WOMAN as she screams, a handkerchief in\nher mouth.\n\nClose shot.  JUDY.  She sobs once and runs up steps.\n\nMed. shot.  JIM staring down at PLATO.\n\n<b>                         JIM\n</b>            Plato?\n                   (crouches over PLATO)\n            Plato.  Hey, Jerkpot!\n\nThere is nothing.  He rises and faces the crowd, shaking his\nhead in wonder and reproach.\n\n<b>                         JIM\n</b>                   (quiet)\n            What did you have to do that for?\n\nFull shot, the roof.  Parents and Officers.  The NEGRO WOMAN\nis hysterical.  RAY shoves past her, followed by JIM'S\nFATHER and MOTHER.  They rush toward camera.\n\nAmbulance crew.  They spring into action, arrive with\nstretcher.\n\nThe balcony.  JIM is at PLATO's side.  A couple of OFFICERS\nrush forward to take JIM.  The FATHER comes in and pushes\nthem aside.\n\n<b>                         FATHER\n</b>            Let him alone!  He's mine!  I'll\n            take care of him!\n\nRAY, who has witnessed this, motions to the officers.\n\n<b>                         RAY\n</b>            It's all right!  It's all right!\n\nThe FATHER stares down at JIM for a moment.  Then he kneels\nbeside his son, puts his coat over JIM's shoulders.  He\nspeaks very gently.\n\n<b>                         FATHER\n</b>            For a minute...that jacket...I\n            thought...\n                   (breaks off, then)\n            You couldn't help it, son.\n                   (reaches out, gently,\n                   but firmly)\n            You did everything a man could do.\n\nHe takes JIM by the elbow and starts to bring him to his\nfeet.  The boy suddenly resists, and remains kneeling.\n\n<b>                         FATHER\n</b>            Stand up, Jim.  I'll stand up with\n            you.  Let me try to be as strong as\n            you want me to be.\n\nA faint hope appears in the boy's face.  He no longer\nresists as the FATHER helps him to rise.  But he still keeps\nhis back to him.  The ambulance attendants start putting\nPLATO on a stretcher.  JIM moves, as if to stop them, but\nthe FATHER still holds his shoulders.\n\n<b>                         JIM\n</b>            He depended on me.\n\n<b>                         FATHER\n</b>            And you can depend on me, son.\n            Trust me.  Whatever comes we'll\n            face it together, I swear.\n\nJIM feels, for the first time, the love and security he has\nalways wanted.  He clutches at his FATHER, crying unashamedly.\nThe FATHER's arms envelop him.  PLATO, through his death,\nhas helped these two find each other.\n\nClose shot.  JUDY and RAY watching.\n\nLow angle.  NEGRO WOMAN as she bends over PLATO's body.\n\n<b>                         NEGRO WOMAN\n</b>                   (as they lift PLATO\n                   onto litter)\n            This poor baby got nobody.  Just\n            nobody.\n\nAs he is carried past her, she follows.\n\nBalcony stairs.  From below as JIM, supported by his FATHER,\ncomes down.  RAY is behind them.  They pause for a silent\nmeeting with the MOTHER at foot of the stairs.  She kisses\nJIM and starts wiping his tears away, but he is weeping\nsoundlessly and it does no good.\n\nJIM looks back up at the dome.  The ambulance attendants are\nbearing PLATO's litter down the last few stairs, followed by\nthe NEGRO WOMAN.\n\nGroup.  The ambulance attendants come down the last few\nstairs followed by the NEGRO WOMAN.  JIM steps forward\nsuddenly and adjusts the blanket covering PLATO.  JUDY comes\nto JIM's side.  The litter passes camera and we hold on two\nshot of JIM and JUDY, seen against the lightening sky.\n\n<b>                         JIM\n</b>                   (to JUDY, half to himself)\n            He was always cold.\n\nJUDY moves to JIM and touches his arm lightly.  He looks\ndown at her.\n\nMed. shot.  The group.  JIM's arm is around JUDY as he leads\nher, firmly, towards his MOTHER and FATHER.  His voice is\nwarm, brimming with the new found pride he takes in his\nparents as he introduces JUDY to them.\n\n<b>                         JIM\n</b>            Mom--Dad--this is my friend.  Her\n            name is Judy.\n\nThe parents nods warmly and smile at her.  She smiles shyly\nin response, happy at being accepted.  There is a warmth\nemanating from the tight little group.  Changes have\nhappened to them.  Old things have been shed and a new start\nhas been made.  Camera booms--pulls back high to:\n\nHigh general shot.  Planetarium, JIM and JUDY, FATHER and\nMOTHER threading their way through the crowd as the camera\ncontinues to pull back.\n\n<b>                                            FADE OUT.\n</b>\n                          The end.\n\n</pre>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Rebel Without A Cause</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Stewart Stern\" title=\"Scripts by Stewart Stern\">Stewart Stern</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Rebel Without A Cause Script.html#comments\" title=\"Rebel Without A Cause comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:14:14.165892"}