{"title": "Robin Hood: Prince of Thieves", "film_link": "/Movie Scripts/Robin Hood: Prince of Thieves Script.html", "script_link": "/scripts/Robin-Hood-Prince-of-Thieves.html", "info_raw": "\n\nRobin Hood: Prince of Thieves Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (7.53 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Pen Densham  John Watson\nGenres  Action  Adventure  Drama\nScript Date : July 1990\n\nRead \"Robin Hood: Prince of Thieves\" Script\n\n\n", "script": "\n           PRINCE OF THIEVES\n                          Story by\n                         Pen Densham\n\n                        Screenplay by\n                         John Watson\n                              &\n                         Pen Densham\n\n\n\n\n                                        FIRST DRAFT\nTrilogy Entertainment Group\nin association with:                    July 10, 1990\nWARNER BROS. INC.                       © 1990\n4000 Warner Boulevard                   WARNER BROS. INC.\nBurbank, California 91522               All Rights Reserved\n\n                      PRINCE OF THIEVES\n\nFADE IN:\n\nSUNSET\nThe glowing orb ripples like a blood-red eye.\n\nBLACK, ROBED FIGURE\nA face of the ages. Dark, wrinkled skin. Wizened,\nalmond eyes. He howls at the sun. His voice ECHOES\nacross the sky. The Moslem call to prayer.\nHundreds of feet below his tower, a mud-walled city of\nminarets and mosques. A human ants' nest. Scurrying to\ntheir devotions.\n\nEXT. TWELFTH-CENTURY ARAB CITY - ESTABLISHING SHOT\n\nINT. DUNGEONS - SUNSET\nPervasive blackness. Moans of men in pain. Dripping\nwater. Rats. Filth. The nadir of human degradation.\nBedraggled white men, POWs from the Crusades, caged\ntogether with Arab cutthroats. Jailers wrench two\ncrusaders from their cell. ROBIN OF LOCKSLEY and PETER\nDUBOIS. Their appearance reeks of long imprisonment, but\nremnants of their noble heritage still glimmer in their\nfaces. Peter is so frail he can barely walk.\n\nINT. TORTURE CHAMBER - SUNSET\n\nA furnace. Torture instruments glow red hot. Chained\nvictims. A massive INTERROGATOR scrutinizes the two\nwhite men. Indicates a rat-faced lowlife, who points at\nPeter, jabbering in Arabic.\n                         INTERROGATOR\n           He says you stole his bread.\n                         PETER\n           It is a lie. I caught him\n           stealing ours.\nThe lowlife jabbers some more.    The Interrogator debates.\n                         INTERROGATOR\n           Cut off the infidel's hand.\nThe jailers haul Peter to the chopping block.\n                                            (CONTINUED)\n\n                                                      2.\nCONTINUED:\n                       ROBIN\n         No!... I took the bread.\n                       PETER\n         That's not true.\n                       ROBIN\n         They're not interested in truth.\n         You are too weak, Peter. You\n         would not live through it.\nThe Interrogator stares into Robin's eyes.\n                       INTERROGATOR\n         Sacrifice for the weaker? How\n         noble... As you wish... Cut off\n         this one's hand as well!... But\n         first...\nHe indicates an Arab prisoner, who is dragged forward.\nHis struggling hand is laid on the executioner's block.\n                       INTERROGATOR\n         Show them the courage of Allah.\nThe prisoner's face braces for the pain. A red-hot\nscimitar flashes down. The hand flips into a basket.\nTwitching.\nRobin is next. His composure fails. He flops to his\nknees, crying. The Interrogator laughs. The jailers\nunlash the thongs on Robin's hand. They stretch it out,\nforcing it down. Robin goes limp, sobbing. Peter\ncatches his eye... Robin winks.\nThe scimitar. Drawn from the coals. Spitting flame.\nArcs down. Robin is suddenly galvanized.\n                       ROBIN\n         And this is English courage.\nHe hurls his holders aside. Swings upward, driving his\nfast into the executioner's throat. Grabs the sword.\nSlash. His thongs melt like butter. A jailer leaps at\nhim. Steaming, the scimitar slices into the man's chest.\nDespite his bindings, Peter wrestles the Interrogator.\nKnife pressed to his throat, Peter is forced against the\nfurnace. At the last second, he flips the man into the\nfire. Screaming.\n                       PETER\n         That's for five years of hell.\n                                             (CONTINUED)\n\n                                                        3.\nCONTINUED:\nA jailer aims a scalding blade at Robin's back.\n                         VOICE (O.S.)\n         Behind you!\nWarned, Robin ducks away.    Slams the jailer's head into\nthe wall.\nPeter frees himself, but they are still outnumbered.\nWhile fighting, Robin acknowledges the man who shouted\nthe warning. An imposing, shaven-headed SARACEN.\nHeavily-muscled arms and chest, covered in tattoos. Even\nhis bald head is ornamented.\n                       ROBIN\n         You speak English?\n                       SARACEN\n         The king's own. Set me free.\n                         PETER\n         No, Robin.\n                       SARACEN\n         For pity's sake. Mine is a\n         sentence of death.\nRobin sidesteps, propelling a guard into a pit.\n                       PETER\n         Don't trust him.\nTwo more guards attack, yelling fury.    Robin eyes the\ncurved scimitar.\n                       ROBIN\n         What I would give for an English\n         sword. This is a pruning hook.\nA guard swings at him with a giant axe.    Robin slashes...\nshears the axe handle in two.\n                        ROBIN\n         Hmm!   Not bad.\nHe runs the man through. Peter loses his sword. His\nopponent moves in for the kill... Peter grabs tongs from\nthe fire and smolders his opponent with a backhand.\nCommotion outside.    RAISED VOICES and RUNNING FEET.\n                       SARACEN\n         Free me and I will show you a way\n         out.\n                                            (CONTINUED)\n\n                                                       4.\nCONTINUED:\n                       ROBIN\n         Why should we trust you?\n                       SARACEN\n         If you don't, you are dead men.\n                       ROBIN\n         He makes a point.\nThe door bursts open.    More guards rush in.\n                         ROBIN\n         A good point.\nHe slashes the man free.\n\n                         PETER\n         Robin!\n                       ROBIN\n         Whatever blood is in his veins, he\n         does not deserve to die here.\n                         SARACEN\n         This way!\nHe beckons them to the back.     A hidden door leads into a\ntunnel.\n\nINT. SEWERS - NIGHT\nThey wade through foul water up to their waists. The\nSaracen leads... A snake lashes out for his face. Robin\nlops off its head.\n\n                       SARACEN\n         You are fast, my friend.\n                       ROBIN\n         Five years I've waited for the\n         smell of free air. That makes a\n         man fast.\nGuards drop down from above, carrying torches.    Blocking\nthe way.\n                       SARACEN\n         You will need to be yet faster.\nA narrow opening to their left... they splash through.\nHalf running, half crawling in the dank water. Fire\narrows land around them. The orange smoke is choking.\n                                             (CONTINUED)\n\n                                                     5.\nCONTINUED:\n                        SARACEN\n         Poison air.   Hold your breath.\nFlames illuminate the walls, alive with a loathsome mass\nof crawling slime. Peter falls. A pursuer descends on\nhim, thrusting a blazing torch at his face. The Saracen\nintercepts the blow. Grabs the man's neck, SNAPPING it\nwith one mighty twist.\n                       PETER\n                (coughing)\n         Thanks. I misjudged you.\n                       SARACEN\n         Save your breath.\n\nGasping for air, they find the tunnel veers steeply down-\nward. A slippery, granite tube. Losing purchase, they\nslide headlong. Sharp, rusted spikes jut out from the\nwalls ahead.\nRobin grabs at the walls to break the fall. No use.\nThey're picking up speed. He turns his sword crossways,\nbracing it against the sides of the tunnel, as a brake.\nSparks fly. The sword cuts into Robin's chest... but it\nworks.\n                       SARACEN\n         Allah be praised.\n                       ROBIN\n         Amen, brother.\nA bloodcurdling scream. A pursuing guard tumbles down\nthe sewer chute. The three men press themselves against\nthe wall. The man hurtles by... is impaled on the\nspikes.\nA draft of fresh air from the roof of the tunnel. Using\nthe spiked guard as a ladder, Robin climbs. Removes a\ngrating.\n\nEXT. ARAB STREET - NIGHT\nRobin's head appears... ducks back down, as a squad of\nmounted soldiers thunders right over him... he reappears.\nAll clear. They're outside the prison wall. Robin helps\nPeter up.\n                       ROBIN\n         God willing, we may now be safe.\n                                            (CONTINUED)\n\n                                                     6.\nCONTINUED:\nSwoosh. An arrow pierces through Peter's chest -- fired\nfrom the prison wall. He reels... Robin leads him under\nthe wall for protection. Shouts of alarm. Soldiers\napproaching.\n                         ROBIN\n         Come, Peter.    We must hurry.\nRaising his sword, Peter faces the oncoming soldiers.\n                         PETER\n         It is mortal.    Leave me.\n                       ROBIN\n         Hold on to my shoulder.\n\nPeter shakes him off.\n                       PETER\n         My mother... my little sister.\n         Tell them I love them. Tell them\n         I died a free Englishman.\nRobin looks despairingly to the Saracen.\n                       SARACEN\n         His wound is by the heart.    We\n         cannot save him.\nRobin knows it's true. Peter pulls an insignia ring from\na hidden pouch in his clothes. Thrusts it into Robin's\nhand.\n                       PETER\n         Take this to my sister. Swear you\n         will protect her for me... Swear\n         it, Robin!\n                       ROBIN\n                (reluctantly)\n         I swear it.\nSummoning hidden resources of strength, Peter charges at\nthe oncoming soldiers, brandishing his sword.\n                         PETER\n         For England.\nHe fells the first Arab.   The Saracen pulls Robin away.\n                       SARACEN\n         Come now! Do not fail your friend.\n         Make his sacrifice an act of honor.\nThey vanish into the night. Fighting like a man pos-\nsessed, Peter is swallowed in a sea of enemy soldiers.\n\n                                                         7.\nDESERTED ALLEY - LATER\nRobin and the Saracen catch their breath.\n                          ROBIN\n            Farewell, friend. God speed you\n            on your way.\n                          SARACEN\n            Our way is together. With the\n            speed of Allah.\nHe grins.    This strange man has a sense of humor.\n                          ROBIN\n            I go to England.\n\n                          SARACEN\n            Then I go to England.\n                           ROBIN\n            England?   Why?\n                          SARACEN\n            You saved my life. I must stay\n            with you until I save yours.\n                          ROBIN\n            Go your own way. I relieve you of\n            your obligation.\n                          SARACEN\n            Only Allah can do that.\n                          ROBIN\n            And if I don't want you?\n                          SARACEN\n            You have no choice... unless you\n            think you can kill me.\nHe grins broadly.      Offers his hand.\n                          SARACEN\n            My name is Aslan.\nResigned, Robin takes the proferred hand.\n                          ROBIN\n            Robin of Locksley. You know a\n            short route to England, Aslan?\n                                               CUT TO:\n\n                                                      8.\nEXT. LOCKSLEY CASTLE (NOTTINGHAMSHIRE, ENGLAND)\nEerie shapes. Weaving. White light on water. The moon\nreflected in the moat of a small castle. Towers shrouded\nin night mist. Smoke curls from a chimney.\nSUPERIMPOSE:   LOCKSLEY CASTLE, NOTTINGHAMSHIRE, ENGLAND\n\nINT. LOCKSLEY CASTLE - NIGHT\nFIRE CRACKLES in an open hearth. Hams and a half sheep\nhang, smoking. An old DOG SNORES at the fireside. A\nbone clunks on the floor, waking him.\n                       VOICE (O.S.)\n         Enough of that din, Remus.    I\n         can't think.\nLicking the bone gratefully, the dog looks in the direc-\ntion of the voice... Grey. Proud. Distinguished. LORD\nLOCKSLEY.\nSeated at a table, wine goblet in hand, he pores   over a\nwonderful illustrated Bible. Reading to himself    for\nsolace and strength. Empty chairs surround the    vast\ntable. A deep sense of loneliness. He glances     at a\nportrait over the fireplace... Robin.\nThe dog jumps. Hackles rise. O.S. SHOUTS. Locksley\nunsheathes a dagger. Obscures it in the folds of the\nBible. The door bursts open. A peasant, ragged,\ndesperate, KENNETH.\n                        KENNETH\n         My Lord!   Help me.\nHe's bleeding from a face wound. Another man grabs him\nfrom behind. Locksley's craggy-faced retainer, DUNCAN.\nOlder than his master, but still strong, he holds Kenneth\nback.\n                       DUNCAN\n         You must wait... I am sorry you\n         were disturbed, Master.\n                       KENNETH\n                (high anxiety)\n         My Lord, please!\n                       LOCKSLEY\n         It is alright, Duncan.\n                (to Kenneth)\n         You are Kenneth of Cowfall?\nThe peasant falls to his knees.\n                                           (CONTINUED)\n\n                                                           9.\nCONTINUED:\n                       KENNETH\n         They've taken my Gwen.    My\n         daughter.\n                       LOCKSLEY\n         Who has taken her?\n                       KENNETH\n         Men on horses. In masks.\n                (touches his wound)\n         We tried to stop them. My son is\n         dead.\n\nEXT. LOCKSLEY CASTLE - NIGHT\n\nSteam pours from the nostrils of a black charger. Lord\nLocksley mounts, in armor. Duncan attempts to detain\nhim.\n                       DUNCAN\n         You cannot go alone, Master.      Let\n         me ride for help.\n                       LOCKSLEY\n         That may be too late. Kenneth,\n         lead the way.\nHe kicks his horse into motion.\n                         DUNCAN\n         Master, stay!    There is an evil\n         moon tonight.\n                       LOCKSLEY\n         Good will overcome, Duncan.      Trust\n         in that.\nDuncan looks up.    Crosses himself.    Dark clouds race\nacross the moon.\n                                              CUT TO:\n\nEXT. WOODED TRAIL\nKenneth checks the ground.    Locksley waits.\n                       KENNETH\n         They came this way, my Lord.\n                         LOCKSLEY\n         Onward then.    What is this place?\n                                              (CONTINUED)\n\n                                                    10.\nCONTINUED:\n                       KENNETH\n         Nearby the Gregor Caves.\nLocksley reacts -- a hint of fear. They move on...\nAhead, the hillside glows, rimmed in eerie light.\nStrange primitive CHANTS, wafted on the wind. Locksley\nties his nervous horse to a tree.\nParting undergrowth, Kenneth creeps forward. Cries out.\nHe's face to face with the maggot-eaten skull of a goat.\nBeyond it, a gruesome host of half-skinned human skulls,\nall arranged on stakes. Some male, others with rotting\nfemale tresses, staring eyelessly into the night.\nKenneth turns to run... A hand grabs him.\n\n                       LOCKSLEY\n         Steady, man. They are to dissuade\n         the faint of heart. Think of\n         Gwen.\nFrom the crest of the rise, they peer down into the\ncraggy valley. A cave opening, ablaze with flames leers\nat them like the mouth of hell. Before the cave, a\ncircle of stones. A miniature Stonehenge.\nA medieval orgy. Men and women in masks and loose\nrobes. Dancing. Drinking. Reveling. Pure carnality.\nLord Locksley and Kenneth watch in horror. Faces ashen.\n                       KENNETH\n         Druids.\n                       LOCKSLEY\n         I trusted we were rid of such evil\n         a century ago.\n\nAn unearthly SCREECH. A creature leaps into the circle\nof stones. Grotesque gargoyle head, horns, fur-covered\narms and legs. A living Hieronymous Bosch DEMON. Its\nclawed hands slash across a reveler's back, drawing\nblood in vicious streaks. The creature tastes the blood.\nThe reveler is ecstatic.\n                       KENNETH\n                (petrified)\n         Is it the devil?\n                       LOCKSLEY\n         If it is, I have some Christian\n         steel that will test his hide.\nHe draws his sword. A crucifix sculpted into the hilt.\nA girl is dragged from the cave. Kenneth buries his\nhead.\n                                          (CONTINUED)\n\n                                                      11.\nCONTINUED:\n                       LOCKSLEY\n         Gwen?\nKenneth nods.\nThe Demon shrieks, dervishing around GWEN, who  is\ncarried onto the central plinth stone. A pagan   altar,\nthe shape of an elephant's head with its trunk  raised. A\nmasked figure stands at the head of the altar.   The high\npriest of the dark rite.\nThe girl's body shudders as blood-red liquid is forced\ndown her throat. The Demon's voice is husky and hideous.\n                       DEMON\n         Come, my virgin flower.\nHypnotized by the creature's voice and snake-like move-\nments, Gwen stretches herself out. A single beam of\nsunlight slices through the mist, like a laser. The\nfirst light of the rising sun, it strikes directly on the\naltar, tracking down towards the girl's heart. The\nDemon's raised talons close in on the white flesh of her\nneck. Gwen's eyes are open wide, in a trance. The crowd\nof revelers encircle the plinth. Awed anticipation...\nA warrior's yell!\nSword raised, Locksley THUNDERS in on his CHARGER. The\nterrified crowd parts. The Demon screams like a banshee.\n                        DEMON\n         Kill him!   Kill him!\nThe followers throw themselves at   Locksley. He beats\nthem off. The high priest issues    orders to armed guards,\nwho run to intercept. One aims a    spear. Locksley hacks\nthe shaft in half. Cuts men down    left and right.\nReaches the altar stone.\n                        LOCKSLEY\n         Gwen!   Up, girl, up!\nGwen shakes off her trance. The Demon launches itself at\nLocksley. Talons rip flesh from his face. With all his\nstrength, Locksley hurls the creature down.\n                       LOCKSLEY\n         In the name of God!\nHis broadsword swings in a mighty arc. Slices across the\ngargoyle's skull. Clean through half the face...\nImpossibly, the demon rolls back to its feet.\n                                            (CONTINUED)\n\n                                                    12.\nCONTINUED:\nThe head is an elaborate mask -- beneath are the yellow\nskin, white hair, and burning red eyes of an albino\ncrone. Screaming vitriol, the hag is unharmed.\nMomentarily stunned, Locksley regains his senses, hauls\nthe girl onto his charger. The guards close in.\nLocksley spurs his horse. Rides for an opening.\nThe masked high priest stands resolutely in his path.\nBrandishing a burning branch. The horse is freaked.\nRears. Locksley and the girl are thrown.\nUnarmed, Locksley charges the man. Slams him into the\ncave wall. The mask falls. Locksley gasps in\nrecognition.\n\n\n                        LOCKSLEY\n         Nottingham!\nThe SHERIFF OF NOTTINGHAM. Powerful build, black beard,\ncruel intensity in every feature.\n                       NOTTINGHAM\n         You are an unwelcome surprise,\n         Locksley.\n                       LOCKSLEY\n         The King shall hear of this,\n         Nottingham.\n                        NOTTINGHAM\n         I think not.\nLocksley is surrounded. One by one the men reveal their\nfaces. Locksley backs up in shock, recognizing them.\n\n                        LOCKSELY\n         God help us.\n                       NOTTINGHAM\n         One day all England will worship\n         with us.\n                        LOCKSLEY\n         Never.\nThe crone spits venom in his face.\n                       DEMON\n         I am Mortianna. You will die with\n         my name on your lips.\nLocksley's agonized cry fills the valley. On the hill-\nside, Kenneth averts his eyes. Turns to run. Five\nmasked figures block his way.\n\n                                                         13.\nEXT. ENGLISH SHORE - DAY\nA twelfth century French sailboat at anchor.    A cross on\nits sail.\nA longboat rows to shore. Robin stands in the prow, in\na pilgrim's hooded robe. He gazes at the approaching\nland. Unable to wait, he leaps into the surf and wades\nto the beach. He kneels, pressing his hands and face\ninto the soil.\n                         ROBIN\n         Home.    Thank you, Lord.\nAslan steps from the boat, sniffing the air. The French\nsailors keep their distance from him. Robin takes his\nhand.\n\n                       ROBIN\n         My friend, you have escorted me\n         home. I beg you to free yourself\n         of your vow. Return with the\n         boat. I know how heavy your\n         heart must be, this far from your\n         family and native land...\n                       ASLAN (SARACEN)\n         Because I love them so dearly,\n         I cannot dishonor them.\nA sailor creeps up behind Aslan, club in hand.\n                       ROBIN\n         I thought you'd say that.\nHe nods to the sailor, who swings the club down. The\nSaracen sidesteps, grabs the man's arm and flips him\ninto the surf. He turns a cold stare on Robin.\n\n                       ASLAN\n         No man controls my destiny.\n         Especially not one who attacks\n         downwind and stinks of garlic.\nRobin laughs.    The Saracen remains intense.\n                       ASLAN\n         If our positions were reversed,\n         I would have done the same.\n         Only I would have succeeded.\nHe smiles broadly.    Robin claps him on the shoulder.\n                       ROBIN\n         Come, Aslan. By nightfall we will\n         celebrate your honor when we dine\n         with my father.\n\n                                                    14.\nEXT./INT. PEASANT'S COTTAGE - DAY\nCRASH! An armored foot splinters the door of a farmer's\nhovel. Children scream and run. A soldier clubs at\nthem, laughing.\nOutside. More soldiers. Some on horses, others on foot,\nwith leashed hounds. Pillaging. Vandalizing.\nSearching.\nGUY GISBORNE: An impressive figure on horseback.\nStrikingly handsome -- except that one of his ears is\nmissing. We recognize his face from the Druid ceremony.\nHe coldly addresses a pregnant woman with a child in her\narms, FANNY.\n                       GISBORNE\n         You owe the sheriff three bushels\n         of flax.\n                       FANNY\n         You starve us. First the drought,\n         now you take what food we have\n         left.\n                       GISBORNE\n         For starving people, you look\n         fat enough.\n                       SOLDIER\n                (emerging from\n                 the hut)\n         He's not here, sir. None but the\n         woman and children.\n                       GISBORNE\n                (to Fanny)\n         Where is your mate? The man\n         they call Little.\n                       FANNY\n         He died last winter.\n                       GISBORNE\n         Is that so? We hear he     is very\n         much alive. Hiding out     in the\n         forest. He probably ran     away\n         to escape your scolding    tongue.\nThe soldiers join in his laughter. Incensed, Fanny\npounds her fist on his legs. Gisborne kicks her down.\n                         FANNY\n         Norman swine!\nA BOY of 12 springs from nowhere, thrusting a hay fork at\nGisborne's throat.\n                                           (CONTINUED)\n\n                                                        15.\nCONTINUED:\n                       FANNY\n         No, Wulf! Don't! 'Twill only\n         make it worse.\nWulf backs off.   Nostrils flaring with repressed hate.\n                        GISBORNE\n         Seize him!\nWhile two soldiers grab the Boy, others examine his\nhiding place. A secret thatched door, built into the\nside of a haystack... a bow and quiver... and a deer\ncarcass. Gisborne dismounts.\n                       GISBORNE\n         This is Lord Nottingham's deer.\n         Is this how you repay the Sheriff\n         for his protection?\n                       WULF (BOY)\n         Like a wolf protects sheep.\n                        FANNY\n         I killed it.   We needed the meat.\n                       GISBORNE\n         Poachers hang. Either he dies or\n         you die.\n                       WULF\n         My mother lies to protect me.\n                        FANNY\n         No, Wulf!\nGisborne drags the boy to the carcass.\n\n                       GISBORNE\n         You have deprived us of a hunt,\n         boy.\nHe cups his hand in the deer's blood.    Smears it on\nWulf's face.\n                       GISBORNE\n         The hounds know the scent well.\nHe tosses his bloody glove to the dogs. They tear at\neach other in their effort to rip at the glove.\n                       GISBORNE\n         Run, boy. Like a deer. Give us\n         some pleasure before you die.\n                                            (CONTINUED)\n\n                                                       16.\nCONTINUED:\nTo the accompaniment of the HOUNDS' savage HOWLS and\nthe horrified screams of his family, Wulf runs.\n                         GISBORNE\n         Unleash them!\n\nEXT. COUNTRY ROAD - DUSK\nNearing home, Robin is buoyant.     The Saracen, brooding,\nwalks two paces behind him.\n                       ROBIN\n         Why must you walk in back of me?\n\n                       ASLAN\n         In your land am I not the infidel?\n         The unbeliever, the instrument of\n         evil?\n                       ROBIN\n         Our races have fought for a\n         hundred years to prove that point.\n                       ASLAN\n         Then I trust it is safer to appear\n         as your slave than as your equal.\n                       ROBIN\n         For an 'infidel' you have uncommon\n         clarity of thinking. Yet you\n         refuse to tell me about your home\n         and family.\n                       ASLAN\n         Those are my burdens.\n\n                       ROBIN\n         You speak my language. You have\n         the diplomacy and honor code of\n         a nobleman. I ask again, why\n         were you to be executed?\nThe Saracen maintains a moody silence.\n                       ROBIN\n         So, I must continue with my\n         guesswork. You are highborn?\n         Probably... You fell from favor...\n         Clearly... Why? You broke the\n         law? You were a rival for power?\n         ... A woman?\n                                             (CONTINUED)\n\n                                                        17.\nCONTINUED:\nThe Saracen reacts, almost imperceptibly.\n                          ROBIN\n            By the Lord, that's it!\nAslan is silent, but Robin knows he's right.\n                          ROBIN\n            They say there are Arab women of\n            such beauty that they can possess\n            a man's mind, that he would be\n            willing to die for them. Is\n            that not so?\nIgnoring him, the Saracen stops.      Examines the darkening\nsky.\n                          ASLAN\n            It is close to sunset.\n                          ROBIN\n            Your people must marry women\n            chosen for them by others, right?\nNo reply.    Aslan unfolds a prayer rug.\n                          ROBIN\n            Who is she? The Mullah's daughter?\n            ... Another man's wife?... That's\n            it!\n                          ASLAN\n            Endless clouds. Is there no sun\n            in your cursed country?\n                          ROBIN\n            You dog! You painted old dog!\n            What is her name?\n                          ASLAN\n            Which way is East?\n                         ROBIN\n            Her name?\n                         ASLAN\n            East?\n                         ROBIN\n            Her name?\n                         ASLAN\n            East?!!!\nRobin folds his arms.    A standoff.\n                                              (CONTINUED)\n\n                                                       18.\nCONTINUED:\n                       ASLAN\n         Damn you!... Jasmina.\n                         ROBIN\n         Ah, Jasmina!    Is she beautiful?\n                       ASLAN\n         Which way is East?\n                         ROBIN\n         That way.\nAslan throws his rug on the ground.    Kneels.\n                         ASLAN\n         Are you sure?\n                       ROBIN\n         I would know blindfolded. I'm\n         five miles from home... Was she\n         worth it?\n                       ASLAN\n         Worth dying for.\nRobin stands smiling over him as Aslan begins his\nprayers... BAYING of HUNTING DOGS... In the distance, the\nboy Wulf runs toward them, ducks behind a tree and clubs\nthe leading dog with a branch. The other hounds close\nin... panting with exhaustion, Wulf swings into the\nbranches. A hound savages his leg.\nThe soldiers surround the tree. The boy clambers\nprecariously onto the highest branch... Robin surrep-\ntitiously steals a crossbow from one of the soldiers'\nhorses.\n\n                       GISBORNE\n         You're not playing by    the rules,\n         boy. Deer don't climb     trees...\n         Perhaps he thinks he's    a game\n         bird. Shall we teach     him to fly?\n         Cut it down!\nThe soldiers hack at the trunk.    The tree quivers.\n                       ROBIN\n         Hold!... I am curious as to what\n         manner of creature is so fearsome\n         that it takes six men to attack\n         it.\nShrouded in his pilgrim's hooded cloak, he approaches\nthem.\n                                             (CONTINUED)\n\n                                                      19.\nCONTINUED:\n                       GISBORNE\n         Stand back, stranger. This is no\n         affair of yours.\n                       ROBIN\n         Have we treed the devil himself?\n         Let me see... Ah ha! A small boy.\n         A truly dangerous animal.\n                       GISBORNE\n         I advise you to move on, pilgrim.\n         This is the Sheriff's land.\n                       ROBIN\n         Wrong. This is my land, and my\n         tree. Therefore, whatever is in\n         it also belongs to me.\n                       GISBORNE\n         I grow dangerously tired of your\n         wit... Chop it down!\n                       ROBIN\n         The man who strikes that tree\n         dies.\nHe glances nervously at Aslan, who's still at his\nprayers. The men stop in mid-swing. More surprised\nthan scared. Gisborne gestures to the largest of them.\n                       GISBORNE\n         Chop down the hooded fool.\n                       ROBIN\n                (backing up)\n         Perhaps we could discuss this.\n\nThe soldier raises his sword. Robin lifts his cape...\nthe crossbow. Shoots from the hip. The bolt thuds\nthrough the man's armor. He's dead before he lands.\n                       GISBORNE\n         Kill him!\n                        ROBIN\n         Aslan!   It's time to redeem that\n         vow.\n                       GISBORNE\n         Set the dogs on him!\n                                             (CONTINUED)\n\n                                                        20.\nCONTINUED:\nAslan ignores him, lost in his   prayers. Robin lifts the\nother arm -- a second concealed   crossbow. WHUMPF! The\nbolt flips the dog handler into   the vicious pack. Dead\nor not, he soon will be. Robin    unsheathes his sword.\n                          ROBIN\n            Aslan, get off your damn knees!\n            I have four of them cornered.\nThe Saracen remains head down. Or did we see him steal\na glance? Gisborne signals his men to attack. A wave of\nflashing steel.\n                          ROBIN\n            I hope there's enough of me to\n            satisfy you all.\nBacked up to a tree, he grabs a branch and kicks out.\nTwo men fly back. He lunges at a third. His sword\nstrikes flesh. Robin sidesteps and hurls the fourth\nonto a sharp tree stump.\nGisborne thrusts. Robin reacts too slowly.       Blood flows\nfrom his arm. His sword falls.\n                         ROBIN\n            Aslan!!\nGisborne is on him, sword pressed to his back.      Robin\nfreezes.\n                          GISBORNE\n            Well, hooded stranger, allow me\n            to know your name before I run you\n            through.\n\nA moment of silence... Like lightning, Robin spins,\nkicks out Gisborne's legs. Slams one foot on the man's\nsword arm, the other on his throat. Throws back his\npilgrim's hood.\n                          GISBORNE\n            Robin of Locksley!\n                          ROBIN\n            On your knees, Gisborne.   Pray.\nHe obeys.    Robin raises his sword.\n                          GISBORNE\n            Please, Locksley! No!\nRobin drives the point into Gisborne's rear.      The man\nleaps.\n                                               (CONTINUED)\n\n                                                       21.\nCONTINUED:\n                       ROBIN\n         Now get off my land. And tell your\n         cousin the Sheriff what happens to\n         his scum when they pick on my\n         people.\nGisborne takes off, colliding with Aslan as he folds his\nrug. Reacts in shock at the sight of the strange Arab.\nKeeps running.\n                       ROBIN\n                (to Aslan,\n                 furious)\n         You worthless savage! You travel\n         ten thousand miles to save my life,\n         then leave me to be butchered.\n                       ASLAN\n         I will fulfill my vow when I\n         choose.\n                       ROBIN\n         Which does not include prayer\n         times, meal times, or any time\n         I'm outnumbered six to one!!\n                       ASLAN\n         You whine like a mule.   You are\n         still alive.\n                       ROBIN\n         Barely.\nAslan examines Robin's wound.   Dismissive.\n                       ASLAN\n         A flesh wound. Why did you let\n         their leader go?\n                       ROBIN\n         After six years of the stench of\n         death, I have no stomach for\n         needless blood on my hands.\nWulf climbs cautiously from the tree.\n                       ROBIN\n         Have no fear, boy.\nThe boy nervously eyes Robin and the Saracen, fingering\na crucifix around his neck. Runs off into the woods.\n                       ASLAN\n                (laughing)\n         The conquering hero returns.\n                                              (CONTINUED)\n\n                                                          22.\nCONTINUED:\n                        ROBIN\n         Ha!   It was you he was scared of.\nAslan's humor is infectious.     Robin's anger relents.\n                       ROBIN\n         Come, my strange friend. Beyond\n         that hill lies the prettiest\n         little castle in all Christendom.\n         Warm hearths, hot food, real beds.\n                       ASLAN\n         With feather pillows?\n                       ROBIN\n         With feather pillows. Warm and\n         soft like Jasmina's embrace.\n\nEXT. LOCKSLEY CASTLE - NIGHT\nRuins. The moon hovers ominously over the once-proud\ncastle. Burned to the ground. Gutted and deserted.\nTowers demolished. Moat drained. Robin stares, struck\ndumb with horror.\nThe dark courtyard.   Heartsick, Robin stumbles over\ndebris.\n                         ROBIN\n         Father!    Hello!\nHis VOICE ECHOES around the fallen battlements. Aslan\nplaces a hand on his shoulder and points... Suspended\nhigh on a tower wall is a decaying human corpse.\n\n\nCLOSE - MEDALLION\nround the corpse's neck.   The Locksley crest.\n                        ROBIN\n         Noooooo!\nA paroxysm of rage and grief. He smashes furniture.\nSlams his fists relentlessly into the wall. Pained,\nAslan looks on.\n                       ROBIN\n         I should have been here.\nSpent, he leans against the wall. In the silence, they\nhear an eerie TAPPING. Robin draws his sword... A\nhunched, old man emerges, walking with the aid of a staff\n... Duncan.\n                                           (CONTINUED)\n\n                                                        23.\nCONTINUED:\n                       ROBIN\n                (shaking him)\n         Damn you, Duncan. Why didn't you\n         cut him down?\n                       DUNCAN\n         Master Robin, is it you? A\n         miracle. I thought God had\n         abandoned us.\n                       ROBIN\n         You left my father to hang like\n         a common thief, carrion for the\n         crows.\n\n                       ASLAN\n         Easy... Look at him.\nDuncan steps into the moonlight.    His face crudely-\nscarred.\n                       ROBIN\n         What has happened?\n                       DUNCAN\n         They say they captured him\n         worshipping with the Druids. He\n         signed a confession before the\n         Bishop of Hereford.\n                       ROBIN\n         Did they have witnesses?\n                       DUNCAN\n         Just one. Kenneth of Cowfall.\n         The Bishop decreed all the Locksley\n         lands forfeit.\n                       ROBIN\n         Did you believe the charges?\n                       DUNCAN\n         Not even when they took my eyes.\n                       ROBIN\n         Who did this to you, Duncan?\n                       DUNCAN\n         Guy of Gisborne. With the sheriff\n         looking on.\nRobin holds the old retainer to his chest.    Stares into\nthe night in silent rage.\n\n                                                         24.\nEXT. NOTTINGHAM CASTLE - NIGHT\nMarked contrast.   A forbidding fortress.   Cliff-like\nbattlements.\n\nINT. NOTTINGHAM CASTLE - NIGHT\nFace like thunder, Guy of Gisborne strides up curving,\nstone steps. A long corridor leads to a guarded oak\ndoor.\n                       SENTRY\n         Sir Guy. His Lordship is not to\n         be disturbed.\n                        GISBORNE\n         Away, fool.\nHe shoves the Sentry aside.\n\nEXT. CASTLE BATTLEMENTS - NIGHT\nTorches illuminate Nottingham's face. Chilling cruelty\nin Manson-like eyes. Seated, his manicured hand dis-\ntractedly strokes a semi-naked girl. She sits at his\nfeet like a frightened dog. When Gisborne enters, she\ncovers up.\n                       NOTTINGHAM\n         Who bade you cover up?\nHe smashes his fist into his chair.   She timidly\nuncovers.\n                       NOTTINGHAM\n         Cousin, I trust you justify your\n         intrusion with news of profound\n         value.\nHis attention is riveted on a dark niche in the corner of\nthe courtyard. UNEARTHLY SOUNDS emanate from the black-\nness.\n                       GISBORNE\n         I met a hooded man today. He bade\n         me warn you not to harm his\n         people.\n                        NOTTINGHAM\n         His name?\n                       GISBORNE\n         Robin of Locksley.\n                                            (CONTINUED)\n\n                                                     25.\nCONTINUED:\n                      NOTTINGHAM\n         Ha! The prodigal son returns. He\n         is a whelp. This girl could best\n         him.\n                       GISBORNE\n         This whelp bested five of my men\n         in the blink of an eye.\n                       NOTTINGHAM\n         Your men were probably drunk.   Yet\n         you survived, cousin?\nHeavy scorn. The sheriff pats Gisborne's hand like a\nchild's. The voice from the darkness becomes a loud\nCHANT. A wrinkled, monkey-like figure dances INTO VIEW,\nwearing a necklace of human fingers. You might think\nshe was a hundred years old, if not for her incredible\nagility. MORTIANNA.\n                       GISBORNE\n                (stunned)\n         You brought her here?\n                       NOTTINGHAM\n         Quiet!\nThe crone's fingers dart into a bag. Emerge with a\nwrithing, SQUEALING mass... a PIGLET. A knife flashes.\nBlood spurts into an ornate, sacred platter.\nThe girl flinches in horror. Mortianna shakes the con-\ntents of a pouch across the bloody dish. Carved bone\ndice -- Runes.\nShe rattles the platter. The rune symbols dance in\ntrails of blood. Eyes vacant, mouth frothing, she hisses\nout her incoherent visions. Nottingham follows her every\nmove. A connoisseur.\n                       NOTTINGHAM\n         What do you see?\n                       MORTIANNA\n         Change the seat of power.\n                       NOTTINGHAM\n         London?\n                       MORTIANNA\n         Change it.\n                       NOTTINGHAM\n         Move the capitol to Nottingham?\n         Excellent. How?\n                                            (CONTINUED)\n\n                                                           26.\nCONTINUED:\n                       MORTIANNA\n         Ally with royal blood.\n                       NOTTINGHAM\n         Put someone on the throne and rule\n         through him? Who?\n                       MORTIANNA\n         That is not revealed.\nThe idea takes shape in Nottingham's mind.      Mounting\nintensity.\n                       NOTTINGHAM\n         Ally with royal blood. What else\n         do you see?\n                         MORTIANNA\n         Armies.\n                         NOTTINGHAM\n         Whose?\n                      MORTIANNA\n         Yours. Men and weaponry in great\n         numgers.\n                         NOTTINGHAM\n         And victory?\n                       MORTIANNA\n         Much blood will be spilled.\n                         NOTTINGHAM\n         Whose?\n\n\nCLOSE SHOT\nA dice splashes blood. Lands -- a death's head symbol.\nMortianna hammers the platter. The dice spins and lands\nagain. Again the grinning skull.\n\nBACK TO SCENE\nThe tray smashes to the ground.      The hag runs at\nGisborne.\n                       MORTIANNA\n         Who have you seen?!\nShe shakes him.    Screams spittle in his face.\n                                              (CONTINUED)\n\n                                                         27.\nCONTINUED:\n                       GISBORNE\n                (freaked)\n         No one. I have seen no one.\n                          MORTIANNA\n         You lie!     A man... A painted man.\n                       NOTTINGHAM\n         What is wrong?\n                       MORTIANNA\n         I have seen my death.\nShe whimpers.   Spins, as if fearing invisible intruders.\n\n                       MORTIANNA\n         The painted man. He haunts my\n         dreams.\n                       GISBORNE\n         Locksley has a companion. A dark-\n         skinned foreigner. He had the\n         marked skin of Islam.\nMortianna trembles like an epileptic.    Eyes wide with\nterror.\n                          MORTIANNA\n         Kill them!     Kill them!\nShe throws herself at Nottingham for protection.    He\ncaresses her. Gisborne is thunderstruck.\n                       NOTTINGHAM\n         Cousin. Prove to Locksley that\n         your survival was his last mistake.\n\n                       MORTIANNA\n                (frantic)\n         And the painted man! Kill him.\n                       NOTTINGHAM\n         Kill them both.\nHe continues to stroke her.    Her trembling subsides.\n                       NOTTINGHAM\n         You have done well, Mortianna.\n         Exceedingly well. No one shall\n         harm you, I swear it.\nMortianna reaches out bloodied fingers towards the young\ngirl, who shrinks away. Nottingham gently takes the\ngirl's hand.\n                                            (CONTINUED)\n\n                                                     28.\nCONTINUED:\nDraws it to his mouth, as if to kiss it... and bites down\nviciously, drawing blood. The girl screams.\n                       NOTTINGHAM\n         Now, my child, Mortianna's kisses\n         will seem soft, like an angel's.\n                (to Mortianna)\n         Take her. You have earned her.\nMortianna grabs the terrified girl's wrist.   Drags her\naway.\n                       GISBORNE\n         It is madness bringing the hag\n         here.\n\n                       NOTTINGHAM\n         Fear not for my sanity, Guy. For\n         in madness, there is great power.\n\nEXT. LOCKSLEY CASTLE - DAWN\nRed shards of sunlight slice through mist-shrouded trees.\nRobin hammers a crude cross over a hillside grave.\nHeads bowed, Duncan and Aslan stand at his side.\n                       ROBIN\n         Our last words in this world were\n         spoken in anger. He called the\n         Crusades a foolish quest, said it\n         was vanity to force other men to\n         our religion. He was right.\n                (looks to Aslan,\n                 then back to the\n                 grave)\n         Please forgive me, Father.\n                       DUNCAN\n         He loved you till the end, young\n         master. He never gave up hope of\n         your return.\n                       ROBIN\n         I failed him. I should have been\n         here at his side.\n                       DUNCAN\n         You must leave, head north to\n         safety. Gisborne will surely seek\n         revenge.\n                       ROBIN\n         Leave me.\n                                          (CONTINUED)\n\n                                                     29.\nCONTINUED:\n                       DUNCAN\n         I know what you're thinking. But\n         one man can achieve nothing\n         against so many. You would need\n         an army.\n                         ROBIN\n         Leave me.\n                         ASLAN\n         Come, friend.\nHe leads the old man away.\n                                           CUT TO:\n\n\nGRAVE SIDE - LATER\nPouring rain. Robin stands drenched at the grave side.\nAslan watches from the shelter of trees. Duncan heats a\nstale chunk of bread over the ashes of a small fire.\n                       DUNCAN\n         He still stands vigil?\n                         ASLAN\n         Like a rock.\nDuncan offers half the bread to the Saracen.\n                       DUNCAN\n         A curse on the Saracens! Were it\n         not for their ungodly ways, he\n         would never have left. This would\n         never have happened.\n\n                       ASLAN\n         It surprises me that one who\n         curses others so readily has lived\n         so long.\n                       DUNCAN\n         I do not recognize the style of\n         your voice, friend. Are you\n         Irish? A Cornishman?\n                         ASLAN\n         Er... no.\n                       DUNCAN\n         What manner of name is Aslan then?\n                       ASLAN\n         A fine Saracen name.\n                                           (CONTINUED)\n\n                                                      30.\nCONTINUED:\n                         DUNCAN\n         Lord, no!\nHe chokes in shock.   Spitting bread.\n                       ASLAN\n         Lord, yes. But eat in peace. I\n         take no offense.\n                (glances at Robin)\n         By the prophet! What is the man\n         doing?\nRobin raises his dagger over his wrist.   Aslan runs to\nhim.\n\n                         ASLAN\n         Wait!\nToo late. Robin slashes the dagger across his palm.\nRain and blood mingle. Streaming onto the grave.\n                       ROBIN\n         I swear by my own blood. I will\n         not rest until I have restored my\n         father's name.\n                (a whisper)\n         ... Or until I am dead.\n\nEXT. FOREST PATH - DAY\nOoze sucks at feet.   The three men stomp through mud and\nrain.\n                       ROBIN\n         We make a fine army, do we not,\n         Duncan? A blind man, an Arab, and\n         a fool.\n                       ASLAN\n         A fine, wet army. I have never\n         witnessed a storm of such duration.\n         When does summer come to this\n         land?\n                       ROBIN\n         This is summer.\n                       ASLAN\n         Then Allah truly is great.\n                         ROBIN\n         Why, pray?\n                                           (CONTINUED)\n\n                                                         31.\nCONTINUED:\n                         ASLAN\n           No food, no shelter,   and weather\n           that would curse the   end of the\n           earth. We  will all   quickly be\n           dead, and I shall be   rid of my\n           vow.\nThey approach a stone wall, surrounding a thatched\nmansion.\n                         ROBIN\n           You despair too soon, Aslan. We\n           shall find food and shelter here\n           among friends.\n\n                         ASLAN\n           What is this place?\n                         ROBIN\n           Peter's home. It is nearly seven\n           years since we left here together.\n\nEXT. DUBOIS MANSION - DAY\nRobin pounds on the door.    A hatch opens.     An OLD WOMAN's\nface.\n                         OLD WOMAN\n           No beggars!\nThe hatch slams shut.    Robin pounds again.\n                         ROBIN\n           Open up!\n\nA pause.   The hatch slides back.\n                         ROBIN\n           Tell the mistress of the house\n           that Robin of Locksley is at her\n           door.\n                         OLD WOMAN\n           Her ladyship is not at home.\nShe slams the hatch again.    Robin jams in his hand.\n                         ROBIN\n           Aagh!\nHe shouts through the hatch, over his bruised fingers.\n                                                (CONTINUED)\n\n                                                           32.\nCONTINUED:\n                          ROBIN\n            Is the child Marian at home?\n                          OLD WOMAN\n            Maybe she is. Maybe she isn't.\n            Remove that hand.\nRobin refuses. She waits imperiously behind the locked\ndoor. Robin reluctantly withdraws his hand. Instantly\nthe hatch slams.\n                          ASLAN\n            The hospitality here is as warm as\n            the weather.\n\nThey wait, shivering... The door opens a crack.\n                          OLD WOMAN\n            Leave your weapons.\nThe three start forward.       Her bony finger points at\nRobin.\n                            OLD WOMAN\n            Just you.\n\nINT. DUBOIS MANSION - DAY\nThe hall. Deer heads.        Boar heads.   Portraits of\nancestors.\n                            OLD WOMAN\n            Wait here.\nHe waits.    CREAKING FOOTSTEPS on the balcony.\n\n                            GIRL\n            Who are you?\nDim lighting.    Robin cannot make out who it is.\n                          ROBIN\n            I am Robin of Locksley.\n                             GIRL\n            You lie.     Robin is dead.\n                          ROBIN\n            I may meet my maker soon from lack\n            of sustenance. But for now I am\n            real enough.\n                                                (CONTINUED)\n\n                                                        33.\nCONTINUED:\n                       GIRL\n         Step into the light.    Turn around.\n                       ROBIN\n         By heaven, am I to dance next?\n         Who are you?\n                       GIRL\n         I am the maid Marian.\n                       ROBIN\n         Then show yourself, child.     For we\n         knew each other well.\n                       GIRL\n         With the king away, these are\n         lawless times. There are outlaws\n         villainous enough to kidnap and\n         ransom a relative of his.\n                       ROBIN\n         You know I am not one of them.\n         Besides, I am sworn to protect\n         you.\n                       GIRL\n                (laughs)\n         Protect me? Robin of Locksley was\n         nothing but a spoiled bully.\n                       ROBIN\n         Allow that years of war and prison\n         may change a man. Step forward,\n         Marian, so I may see how you have\n         changed.\n\nShe moves into the light... Fat.     Rotten teeth.   Ugly as\nsin.\n                       ROBIN\n         Er... the years have been kind.\n                       GIRL\n         Thank you. Now remove yourself\n         from this household.\nA figure steps behind Robin.    Sticks a sword in his back.\n                       GIRL\n                (turning away)\n         As you can see, we are already\n         well protected.\n                         ROBIN\n         Wait, Marian!    ...ouch!\n                                             (CONTINUED)\n\n                                                         34.\nCONTINUED:\nThe sword is jabbed into his back. Robins faces the man\n-- clad in back, with a metal fighting mask.\n                        ROBIN\n          You are truly courageous against\n          an unarmed man.\nThe figure gestures towards the door. Robin sidesteps.\nSlams an elbow. The sword drops. Slides across the\nfloor. Robin moves for it, but the man intercepts,\ndrawing a dagger.\nRobin darts to the wall. Rips off an antlered deer head.\nDefends himself as the attacker slashes at the horns.\n\n\nOUTSIDE\nThe SOUND of the fight indoors.   Aslan hurls himself at\nthe door. It doesn't give.\n\nINSIDE\nChunks of horn fly. Robin parries and thrusts.     The\nhorns get shorter. Robin retreats.\nLeft with just the nubs, Robin hurls the deer head at\nthe mask. Gaining advantage, he charges. Grabs the\ndagger hand, smashes it into the wall. The knife drops.\nRobin wrenches off the mask.\nLong hair tumbles down... a beautiful YOUNG WOMAN.\nThe front door CAVES IN. Aslan stumbles through... just\nin time to see the woman's knee fly up into Robin's\ncrotch. Robin folds. The battle is over. The young\nwoman stands over Robin.\n                        YOUNG WOMAN\n          As she was saying, we have\n          no need of your protection.\nRobin croaks through clenched teeth.\n                       ROBIN\n          Marian.\n                                             CUT TO:\n\nINT. KITCHEN\nLiquid tumbles into a goblet.   The three men at a table\nin the kitchen.\n                                             (CONTINUED)\n\n                                                     35.\nCONTINUED:\nThe fat girl, SARAH, who pretended to be Marian, serves.\nFlashes a lusty smile at Aslan, who glances at Robin --\n\"Help!\" Marian arrives. In a gown. Stunning. An\nimpish grin.\n                       MARIAN\n         I trust Lord Locksley has\n         recovered from his indisposition.\nAslan laughs.   Robin glares.\n\nEXT. DUBOIS MANSION - DAY\nRock-strewn hills. Grazing sheep. Sun peeking through\nclouds. Robin and Marian walk. Anger and anguish in\nher voice.\n                       MARIAN\n         Why would he wish me to be\n         protected by the boy who burned\n         my hair when I was a child?\n                       ROBIN\n         We were together five terrible\n         years in a Saracen prison.\n                       MARIAN\n         How do I know you didn't abandon\n         him there to save your own skin.\nRobin hands her Peter's ring.   She is shocked.\n                       ROBIN\n         Marian, I'm sorry.\n\n                       MARIAN\n         I will forward your condolences\n         to my mother.\nShe turns her back.   He searches for a way to reach her.\n                       ROBIN\n         On my return, I found my father\n         dead. The Sheriff denounced him\n         as a Druid and took our lands.\n                       MARIAN\n         The people fear the Druids so much\n         they'd believe anything.\n         Nottingham would have me burned at\n         the stake as a witch if he thought\n         he could possess my property.\n                                            (CONTINUED)\n\n                                                      36.\nCONTINUED:\n                       ROBIN\n         Why do you not join your mother\n         in London? You would be safer\n         there.\n                       MARIAN\n         I will not retreat.     Besides, I\n         have no interest in    life at court.\n         Gossip-mongering and    currying\n         favor. Here I am my     own person.\n                       ROBIN\n         The you must allow me to be your\n         guardian.\n\n                       MARIAN\n         I do not need a guardian.\nShe turns to face him.   Streaming tears.\n                       MARIAN\n         My brother is dead. You cannot\n         take his place.\nRobin grabs and holds her.\n                       ROBIN\n         Marian, I don't want to replace\n         him.\n                       MARIAN\n         What do you want?\nTheir eyes meet... a sudden intimacy between them. Robin\nmoves closer. Marian begins to respond, then pulls away.\n\n                       MARIAN\n         This is wrong.\nShe runs back to the house. Robin stares after her.\nAslan appears in the doorway with Duncan.\n                       ASLAN\n         Robin! The old man hears horses.\n         Approaching fast.\nHe runs to a bluff... a column of soldiers snakes up the\nhillside.\n                       ASLAN\n         Twenty or more. In battle armor.\n                       MARIAN\n         Soldiers coming here?     Is this\n         your protection?\n                                             (CONTINUED)\n\n                                                      37.\nCONTINUED:\n                       ROBIN\n         I killed some of the Sheriff's\n         men. I fear I have placed you in\n         danger.\n                       MARIAN\n         I can take care of myself. There\n         are horses in the stable. Go!\nAslan runs into the stables.\n                       ROBIN\n         I'm not leaving.\nMarian ices him with a glare. Aslan reappears, with two\nbareback horses. Soldiers appear on the crest, led by\nGisborne... With a mischievous grin, Marian runs to the\nsoldiers.\n                        MARIAN\n         Stop them!   They're stealing my\n         horses!\n                       ROBIN\n         Damn the girl! Aslan, can you\n         ride?\nIn answer, Aslan grins. Leaps onto a horse. With a\nsingle swift move he hoists Duncan up behind him and digs\nin his heels. The mare leaps forward, and over the\nestate wall.\n                        ROBIN\n         He can ride.\nHe heads his horse at the wall. It stumbles. Barely\nclears it. Stones fly. Robin struggles to hold on.\nMarian stands directly in Gisborne's path.\n                       GISBORNE\n         You have been sheltering outlaws,\n         Lady Marian.\n                       MARIAN\n         They're thieves, you imbecile.\n         Bring back my horses, or the\n         Sheriff will know of your\n         cowardice.\nGisborne knows she is lying.\n                                             (CONTINUED)\n\n                                                        38.\nCONTINUED:\n                       GISBORNE\n         You're lucky he didn't steal your\n         virtue too.\n                (to his men)\n         A crown to the man who brings me\n         Locksley's head.\nHe leads the pursuit.   A SOLDIER hangs back.   Grabs\nMarian's hair.\n                       SOLDIER\n         A kiss for me, Saxon bitch.\n                        MARIAN\n         Kiss this!\n\nShe unsheathes the dagger from under her skirt.    Jabs\nthe blade into his wrist.\n                       MARIAN\n         Try me again, if you want to\n         leave a hand behind.\nShocked and pained, the man gallops away. Marian looks\ndown at her dagger hand. It shakes violently.\n                                           CUT TO:\nEXT. STREAM\nWater erupts under hooves. Aslan fords a stream. Duncan\nhangs on for dear life. Robin strives to keep up. Half\na mile behind Gisborne splits up his men.\nTrying for a short cut, Robin finds himself at the\nsteepest part of the river gorge. His horse balks at the\ndrop. Robin flails at his mount with hands and feet. It\nbacks away.\n                       ROBIN\n         Damn you, animal!\nAslan shouts from the far bank.\n                       ASLAN\n         Treat it like a woman.\nRobin continues to hit his horse and hurl abuse. Closing\nin, the soldiers unfurl their crossbows. A flight of\nBOLTS WHISTLES ominously close to Robin. He must jump or\ndie.\n                       ASLAN\n         Have you never had a woman?\n         Gently, man. Soothe it!\n                                           (CONTINUED)\n\n                                                         39.\nCONTINUED:\n                       ROBIN\n         Of course I've had a woman!\n         Come on, pretty one.\nHe pats the horse soothingly.    The animal edges forward.\n                        ASLAN\n         Softly.   With your knees.\n                        ROBIN\n         I know!   I know!\nThe soldiers reload.   Robin urges the horse at the steep\ndrop.\n\n                         ROBIN\n         Easy, easy.\nAnother wave of crossbow bolts. Robin launches the\nfrightened animal into space. Hooves flail... touch\ndown. Scramble up the other bank. Robin\nenthusiastically pats the horse's neck.\n                         ROBIN\n         I love you!\nThe first two pursuers misjudge their leaps.     Their\nmounts land sprawling in the riverbed.\n                       GISBORNE\n                (yelling)\n         Robin of the Hood! Son of the\n         devil worshipper.\n                       ROBIN\n         What is your pleasure, Gisborne?\n\n                       GISBORNE\n         It was I who strung your father's\n         corpse to the castle gate. My\n         pleasure will be in doing the same\n         to you.\n                       ROBIN\n         You survived one meeting.    Our next\n         will be your last.\n                       GISBORNE\n         Your father died a coward, cursing\n         your name and squealing like a\n         stuck pig.\n                         ROBIN\n         That's a lie!\n                                            (CONTINUED)\n\n                                                     40.\nCONTINUED:\nIncensed, he is losing his judgement.\n                          ASLAN\n                   (shouts)\n            Come, Robin! He is trying to\n            anger you into a trap.\nA shaft pierces the flank of Robin's horse. It rears in\nfright. Robin clings on. Six soldiers, the men Gisborne\nsplit off, are climbing the embankment towards him.\nRobin regains control. Rides right at them. Scatters\nthem, and takes off again. Gisborne yells at his men to\nfollow.\n\nRobin and Aslan ride flat out. Open land turns to scrub.\nSeeing no followers, Robin pulls up and dismounts.\n                          ROBIN\n            We have lost them. I'll lame this\n            mare if I ask her to go any farther.\nHe gently extracts the shaft from his horse. Aslan opens\nhis pouch. Pulls out two shiny clear pebbles and a square\nleather hide. Rolls the pebbles into the tube and holds\nit to his eye. A primitive telescope.\nRobin watches, curious.\n\nSCOPE POV\nThrough the scope we see the movement on the hill behind\nthem.\n\n\nBACK TO SCENE\n                          ASLAN\n            Here they come. Look.\nRobin puts the device to his eye...\n\nSCOPE POV\nThe soldiers are close!\n\nBACK TO SCENE\nHe reacts in shock. Prepares to defend himself.    Then\nrealizes they are still in the distance.\n                                            (CONTINUED)\n\n                                                      41.\nCONTINUED:\n                       ROBIN\n         Is this Arab magic?\n                         ASLAN\n         No.    Arab science.\nHe replaces the tube in his pouch.\n                       ASLAN\n         How did your uneducated\n         kind ever take Jerusalem?\n                        ROBIN\n         God knows!\n\nAslan laughs.   Robin points towards an endless expanse of\ntrees.\n                       ROBIN\n         We can lose them in the forest.\n                       DUNCAN\n         Sherwood is haunted, Master.\n                       ROBIN\n         Either we take our chances\n         with the ghosts, or become\n         ghosts ourselves.\nHe remounts. They race into the trees. Gisborne's men\nthunder up,... slowing as they enter the forest. Peering\naround them in trepidation, they slowly rein in. Robin\nlooks back.\n                       ROBIN\n         They're not following.\n\nGisborne curses his men, urging them on.\n                       GISBORNE\n         Come on, damn you! There are\n         only three of them.\n                       SOLDIER\n         It's not the men we fear, sir.\nEerie HOWLING and RATTLING of bones.    Aslan draws his\nsword.\n                       DUNCAN\n         Banshees. They say they fly in\n         your mouth and suck you dry of\n         blood before you can scream.\nHe wraps his scarf over his mouth.\n                                            (CONTINUED)\n\n                                                       42.\nCONTINUED:\n                         ROBIN\n         Be quiet!    Listen.\nWIND GUSTS the trees in angry waves. Emits deathly\nSHRIEKS. The HORSES WHINNEY. Unnerved, Aslan smites\naround him with his scimitar. Wheels at the sounds,\nstriking only air.\n                       ASLAN\n         Allah protect us from the evil\n         spirits.\nDuncan clings to his back.   Robin points.\n                        ROBIN\n         Behind you!\nAslan slashes out, futilely.\n                         ROBIN\n         No, there!    And there!\nAslan flails.   Robin cracks up.\n                       ASLAN\n         Cease your mad laughing.     I can\n         feel them.\nRobin reaches into the branches. Pulls out a string of\nhollowed wooden tubes -- WINDCHIMES. Dozens of such\nstrings on all the trees. He blows over the hollow end.\nA low chilling MOAN.\n                       ROBIN\n         Here are your ghosts, Duncan. A\n         child's toy put to good use. You\n         scare easily, my painted Saladin.\nHis laughter is broken by a piercing YELL. A red-\njacketed figure swings down out of a tree on a rope.\nCatapults him to the ground.\nThe bushes are instantly alive. Shaggy, wild-eyed men,\narmed with cudgels, scythes and hayforks. Twelfth-\ncentury Hell's Angels. The red-jacketed young turk, WILL\nSCARLET, leaps around Robin.\n                       WILL SCARLET\n                (singing)\n         Ring around the rosie!\n                        ROBIN\n         Aslan!\nAslan makes no move to intervene.\n                                              (CONTINUED)\n\n                                                       43.\nCONTINUED:\nThe woodsmen eye the bizarre stranger, keeping their\ndistance from him. Will kicks at Robin, who tries to\ngrab him. Will skips out of range. Robin falls.\n                       WILL SCARLET\n         Atishoo, Atishoo. We all fall\n         down. Beg for mercy, rich man.\n                       ROBIN\n         I beg of no man. Which of you\n         scum has guts enough to face\n         me man to man?\n                       VOICE (O.S.)\n         Yeah, bollocks, mate.\n\nRobin looks up... I mean up! A towering figure. Seven\nfeet of grinning, muscled brute. The giant extends a\nvice that passes for a hand. Hauls Robin to his feet.\nHis eyes twinkle with merriment. His whole body shakes\nwhen he laughs, which is often.\n                       JOHN LITTLE\n         What are ya, m'old cock?\n                       ROBIN\n         Er... Robin...\nHe pauses, checking the faces of the angry peasants.\n                        ROBIN\n         ...Hood.   Robin Hood.   Who are\n         you?\n                        JOHN LITTLE\n         John Little.   Bestman o' the\n         woods.\n                        ROBIN\n         Bestman?   You lead this rabble?\n                       WILL SCARLET\n         We waste time. Tax him.\n                        ROBIN\n         Tax?   For what?\n                       WILL SCARLET\n         For passage through Sherwood.\n                       ROBIN\n         I will pay no tax. Besides, I\n         have nothing but my cloak and\n         my sword.\n                                            (CONTINUED)\n\n                                                       44.\nCONTINUED:\n                       WILL SCARLET\n         A man who travels with two servants\n         and claims he's without money, is\n         either a fool or a liar.\nGrabbing Robin, Little shakes him like a doll. Something\nCLINKS. Robin's father's medallion. Laughing heartily,\nLittle rips it from Robin's neck and tosses it to Scarlet.\n                       WILL SCARLET\n         And this one is a liar.\n                (he bites the metal)\n         Ahah! Gold!\nThe men cheer.   John snatches the medallion back from\nWill.\n                       ROBIN\n         That is sacred to me.\n                       JOHN LITTLE\n         Sacred to us too, mush. This\n         here'll feed us for a bloomin'\n         month.\nRobin draws his sword.\n                       ROBIN\n         You will have to fight me for it.\n                       JOHN LITTLE\n         I'd love to, mate.\nHe grins hugely.   A boy pushes his way through the throng.\n                         WULF\n         Wait, father!    I know him.\n                       ROBIN\n         This man is your father? Tell him\n         how I saved your hide from the\n         Sheriff's soldiers. That deserves\n         some gratitude, I believe.\nHe reaches for the medallion.    John pulls it away.\n                       JOHN LITTLE\n         Naw ya don't, laddie.\n                       WILL SCARLET\n         You must be Robin of Locksley.\n         The blackguard who abandoned us to\n         Nottingham's plundering.\n                                            (CONTINUED)\n\n                                                     45.\nCONTINUED:\n                       WULF\n         Be careful, Father. He fights\n         like a demon. He walloped six o'\n         Sheriff's men?\n                        JOHN LITTLE\n         Is that so?\nAnother grin. Licking his lips in anticipation, he\nlunges for Robin's wrist. Wrenches the sword free.\nBends it into a pretzel.\n                        ROBIN\n         Aslan!\n\nAslan shrugs. Robin swings a fist into the giant's gut.\nJohn doesn't flinch. Hoists Robin off the ground with\none arm. Cannonballs the other fist into Robin's\nstomach. Robin folds.\n                       WILL SCARLET\n         Oh dear! The little rich boy is\n         lost for words. Thanks for the\n         taxes, Locksley.\n                       JOHN LITTLE\n         And for the laughs.\nThe woodsmen find this hysterical. They disappear into\nthe tree. Will administers one final kick before\nleaving. Robin staggers to his feet. Glares furiously\nat Aslan.\n                       ROBIN\n         Son of an Arab whore! Once again\n         your assistance was invaluable.\n\n                       ASLAN\n         You seemed more in danger of losing\n         your pride than your life.\n                       DUNCAN\n         I recognized some of the voices.\n         Many were from your father's farms.\n                       ASLAN\n         Your avenging army, my friend.\n                        ROBIN\n         That rabble?\n                       ASLAN\n         All they need is a leader.\n                                           (CONTINUED)\n\n                                                     46.\nCONTINUED:\n                       ROBIN\n         They have a leader.   A very large\n         one.\n                       ASLAN\n         Defeat him and they will follow\n         you.\n                       ROBIN\n         Allah has taken your brains.\n                       DUNCAN\n         I hear the voice of a spoiled\n         child, Master Robin. I suggest\n         you cease your brave talk of\n         revenge and flee to the north.\n                       ROBIN\n         You, too? You expect me to\n         fight that behemoth?\n                       DUNCAN\n         Your father would expect you to\n         act like a man.\n                                           CUT TO:\nEXT. FOREST CLEARING - DAY\nA large tree trunk spans a swift-flowing river. The\nragged band of woodsmen approach the makeshift bridge.\nStop in their tracks. Robin stands on the bridge,\nbrandishing a long wooden staff.\n                       ROBIN\n         This is my bridge. No one crosses\n         without paying tax.\n                       JOHN LITTLE\n         Just bugger off, mate, huh?\n                       ROBIN\n         If you wish to cross, it will\n         cost you a gold medallion.\n                       JOHN LITTLE\n         Ain't I hurt you a bloody nuff\n         for one day?\n                       WILL SCARLET\n         If he's in a hurry to end his\n         mortal misery, help him.\n                                           (CONTINUED)\n\n                                                      47.\nCONTINUED:\n                       ROBIN\n         You don't have the courage to\n         face me again, John Little? Or\n         should I call you 'Little John'?\nJohn grabs a hefty, gnarled staff.   Strides to the\nbridge.\n                       JOHN LITTLE\n         Alright, m'old cock. You wanna\n         nuther good wallopin'?\nHis confidence melting, Robin glances back at Duncan\nand Aslan, who grins like a fan at a boxing match. John\nstorms at Robin. Staffs thrash. Driven back, Robin\nconnects a blow on John's foot.\nThe giant is off-balance. Robin follows up. Lands a\ncouple to the ribs. John responds with heavy swings,\nwhich Robin blocks deftly. Back and forth, blow for\nblow, all blocked. John chuckles with every swing.\nEnjoying the time of his life.\nTheir staffs lock. It's strength against strength.\nRobin is no match. With one mighty thrust, John\nhurtles him into the stream. The woodsmen cheer loudly.\nAslan watches impassively.\nRobin scrambles back onto the bridge.   John waits,\ngrinning.\n                       JOHN LITTLE\n         Lil' wet behind the ears, mate?\n                       WILL SCARLET\n         Don't fool with him. Get him!\n\nJohn charges. Robin fends him off, gets in some shots\nof his own. John swings in a giant arc. Robin ducks.\nJohn loses balance and falls to his knees. Robin allows\nhim time to right himself.\nJohn comes at him again, pummeling. Wood splinters from\nthe impact. Brute force versus agility. Agility is\nbeginning to prevail, when Robin's staff splits in two.\n                       JOHN LITTLE\n         Swimmin' time again, ol' chum.\nThe coup de grace. Lands heavily. Robin teeters.\nFalls. Disappears under the foaming water... does not\nre-emerge. John waits. The spectators rush to the bank.\nNo sign.\n                                            (CONTINUED)\n\n                                                      48.\nCONTINUED:\n                       JOHN LITTLE\n         Bloomin' shame. 'E were a brave\n         'un.\nSuddenly Robin arcs up out of the water. His hands clamp\nonto John's ankles. Robin heaves with all his might.\nJohn topples headfirst into the water. Surfaces in panic.\n                        JOHN LITTLE\n         Help!   Cain't bloody swim.\nHe submerges again.   Robin pulls his head above water.\n                         ROBIN\n         Do you yield?\n\nThe terrified giant sputters. Goes under again, flailing\nwith arms and legs. Robin holds his head just above the\nsurface.\n                         ROBIN\n         Do you yield?\n                         JOHN LITTLE\n         Yes!\n                        ROBIN\n         Good.   Now put your feet down.\nJohn struggles, then his feet hit bottom... The water\nonly reaches his chest.\n                       JOHN LITTLE\n         I'll be buggered.\n                       ROBIN\n         Pay me the tax.\nA tense pause while all wait for Little's reaction.\n                       JOHN LITTLE\n         Robin Hood, ya got balls o' solid\n         rock.\nHe hands Robin back the medallion. Chuckling loudly, he\nswoops Robin up in his arms and carries him to the bank.\n\nEXT. SHERWOOD FOREST - NIGHT\nA BONFIRE CRACKLES. The woodsmen drink, eat, argue, and\nfight. A rabble. John passes Robin a jug.\n                        LITTLE JOHN\n         Mead.   Made it m'self.\n                                           (CONTINUED)\n\n                                                         49.\nCONTINUED:\n                          ROBIN\n                   (drinks)\n            A fine brew, Little John.\nHe spits black objects from his mouth.      Dead bees.   John\ngrins.\n                          LITTLE JOHN\n            Real honey.\nHe takes the jug back. Sneezes royally, spewing all over\nthe brew. Oblivious, he hands the contaminated jug to\nAslan.\n                          ASLAN\n            With regrets, I decline.\n                          LITTLE JOHN\n            An Englishman's mead not bleedin'\n            good enough for ya?\n                          ASLAN\n            On the contrary. I thank you,\n            but my faith prevents me from\n            partaking in such enjoyments.\n                          LITTLE JOHN\n            Your bloody loss, mate.\nHe swigs.    Passes the jug on to Duncan, who drinks\nheartily.    Wulf cautiously approaches Robin.\n                          LITTLE JOHN\n            What is it, boy? Speak up!\n                          WULF\n            I wanna thankee, Lord Locksley.\n            I owes ya m'life.\n                          ROBIN\n            You owe me nothing, Wulf. I am\n            glad I chanced by in time to help.\n                          LITTLE JOHN\n            C'mon, lad, drink! 'Twill put\n            hair on your bloomin' chest.\nWulf tries the brew. The impact is instant.       He turns\ngreen and runs. His father cracks up.\n                          ROBIN\n            Tell me about your men, John.\nJohn points to a short fellow with the build of a tree\ntrunk.\n                                           (CONTINUED)\n\n                                                      50.\nCONTINUED:\n                       LITTLE JOHN\n         This stumpy one 'ere's David o'\n         Doncaster. We calls 'im Bull.\n                       ROBIN\n         How do you come by the name, Bull?\n                       BULL\n         'Cuz o' my size, Sire.\n                       ROBIN\n         Because you are short?\n                        BULL\n         Nay.   'Cuz I be so long.\n\nProudly, he starts to pull down his pants.\n                         ROBIN\n         No, Bull.    Save it for the ladies.\nDrunken laughter.    Robin turns to the next man at the\nfireside.\n                       ROBIN\n         Your name, friend?\nThe man's bald pate blushes scarlet as he tries to\nrespond, but he stutters too badly to get out a\ncomprehensible word.\n                       LITTLE JOHN\n         That be Hal Brownwell, but the\n         lads call i'm Hal Hiccup.\nThe others make hiccup and belching sounds, and crack up\nat Hal's embarrassment. Hal strikes out angrily at his\ntormentors.\n                       ROBIN\n         Hold! Hal, you have the face and\n         hands of a farmer. I wager you\n         are a strong and honest man, and\n         I'd be glad to have you at my side\n         in a fight. The next man who makes\n         light of you will have to answer\n         to me.\nThere is murmuring around the group, but no one elects\nto try it.\n                       ROBIN\n         How is it there are so many of\n         you in hiding?\n                                             (CONTINUED)\n\n                                                      51.\nCONTINUED:\n                       LITTLE JOHN\n         We're outlaws. Got prices on our\n         'eads, every man jack. Blasted\n         Sheriff says we owes 'im taxes.\n                       ROBIN\n         How do you fare?\n                       LITTLE JOHN\n         We get by, I reckon.\n                       ROBIN\n         While the Sheriff steals your\n         land and your families starve?\n\n                       LITTLE JOHN\n         What in bloody blazes'd ya have\n         us do?\n                       ROBIN\n         Your ghosts will only keep his\n         men at bay so long, my friend.\n         Soon the Sheriff will hunt you\n         down and hang you. You must\n         fight back.\n                       LITTLE JOHN\n         We show as much as a toe outside\n         the forest, they'll slaughter us\n         like bleedin' sheep.\n                       ROBIN\n         We must organize. Win by guile.\n                      LITTLE JOHN\n         'We'? Ya lookin' to join us,\n         matie?\n                        ROBIN\n         No.   To lead you.\n                       WILL SCARLET\n         Ha! I would never be led by the\n         son of a Druid.\n                       ROBIN\n         There are many here who knew my\n         father to be a kind and generous\n         man. I doubt that in their hearts\n         they believe him capable of such a\n         horror.\nMurmurs of agreement from around the fire.    Robin turns\nto Will.\n                                             (CONTINUED)\n                                                       52.\n\nCONTINUED:\n                       ROBIN\n         What is your name, friend?\n                       WILL SCARLET\n         Count me not a friend, Locksley.\n                       LITTLE JOHN\n         Stuff a flippin' cork in it, Will.\n         The man's our guest.\nWill gets up.   Angrily pushes his way out of the group.\n                       LITTLE JOHN\n         That there's Will Scarlet. Pay 'im\n         no 'eed. 'E's full o' piss and wind.\n\n                       ROBIN\n         He is right to distrust me. I am\n         a rich man's son. I have done no\n         honest labor. But today I am as\n         poor as any of you. Nottingham\n         has stolen all that I own. And\n         when I killed Gisborne's men, I,\n         too, became an outlaw.\n                       LITTLE JOHN\n         Ya're full o'bloody wind an' all,\n         mate. This 'ere load o' rubbish\n         agin the Sheriff's bloomin' army?\n         Ya must be bloody jokin'.\n                        ROBIN\n         We can win.   And I believe we will.\n                       LITTLE JOHN\n         Ya're a daft bugger, Robin Hood,\n         but ya're a brave 'un, I'll give\n         ya that. Drink up, laddie, cuz\n         tomorrow ya mayn't be so lucky!\n         Tomorrow I shall best ya an' crack\n         that blasted noble head in two.\nLaughing loudly, he throws back his head for a long\ndraught of mead.\n\nEXT. WOODSMEN'S CAMP - SUNRISE\nA steady trickle of RAIN drips from leaves onto the nose\nof the sleeping Saracen. He wakes, cursing. All around\nhim the woodsmen lie on the forest floor, covered with\nrags and hides coughing and sneezing. A sorry mess.\nRobin sits, brooding.\n                                            (CONTINUED)\n\n                                                       53.\nCONTINUED:\n                       ASLAN\n                (gloomily)\n         I have led you wrong. This is no\n         army. These men live like dogs.\n                         ROBIN\n         English dogs.    They can learn.\n                        ASLAN\n         Learn what?   To build kennels?\nHe sullenly stalks away. Robin shakes his head. Aslan\nis right. He rouses Duncan, who is asleep at his side.\nThe old man groans awake, holding his head. Seriously\nhung-over.\n\n                       ROBIN\n         Too much mead, old friend.    What\n         day is it?\n                       DUNCAN\n         Sunday, I believe.\n                       ROBIN\n         Good. Do they still give alms\n         to the poor at the mass?\n                       DUNCAN\n         They do. These days the need for\n         mercy is greater than ever.\n                       ROBIN\n         Then I must ask you a favor.\nEXT. ROAD TO NOTTINGHAM - DAY\n\nDuncan walks alone, with the aid of his staff. Body\nstooped, clothes ragged, a pathetic figure. Ahead is\nthe main gate to the walled city of Nottingham.\nFresh horse manure. A man's hand reaches into it and\nspreads it over his clothes. And his face -- Robin,\ndressed as Duncan.\n\nEXT. CITY GATE - DAY\nRobin taps his way through the crowd. Past the piercing\nstare of the armored GUARD at the gate.\n                         GUARD\n         Hey, you!\nRobin keeps going.   A hand clasps his shoulder.    Spins\nhim 'round.\n                                              (CONTINUED)\n\n                                                     54.\nCONTINUED:\n                       GUARD\n         Do I know you?\nRobin gazes into space, trying to look blind.   The Guard\nsniffs his soiled hand.\n                       GUARD\n         My God, you stink!\n                       ROBIN\n         Pardon my blindness, sir.    I'm\n         always falling down.\n                        GUARD\n         Yeech!   Get away from me.\n\nHe launches a kick in Robin's rear. Robin hobbles away,\nhiding a smile. The Guard tries to wipe off his hand on\nthe wall.\n\nINT. NOTTINGHAM CATHEDRAL - DAY\nJesus hangs from the cross. A magnificent stained glass\nwindow. In the ornate pulpit, the BISHOP OF HEREFORD,\nbedecked in ermine.\n                       BISHOP\n         We beseech thy blessing, Lord, on\n         all your people, but most\n         especially on our noble Lord\n         Nottingham. Grant him the wisdom\n         to guide and protect our glorious\n         city.\nNottingham and Gisborne sit piously among the congrega-\ntion of nobles and wealthy merchants.\n                       BISHOP\n         Grant him also the strength to\n         bring to justice the lawless men\n         who threaten its safety. Help\n         him to stamp out the curse of the\n         dread Druids who would seize from\n         us our children, even as wolves\n         steal the lambs from their mothers.\nThe rear of the church. Standing crushed together, the\npoor and afflicted. Old and young. Starving children.\nAmong them, Robin.\nThe sermon ends. As the nobles file out, the poor are\ngalvanized. Begging hands reach out.\n                                            (CONTINUED)\n\n                                                    55.\nCONTINUED:\n                        VARIOUS\n         1.   Alms!\n         2.   Have mercy, milady.\n         3.   Pity, fine sir.\n         4.   For my baby.\n         5.   Etc.\nThe rich drop a few mites, sparking a mad scramble.\nChurch officials roughly keep order. Marian passes some\ncoins to the mother of a small child. A hand grabs her\nwrist.\n                       ROBIN\n         Alms for a blind man. For one\n         who cannot see your beauty.\n\n                       MARIAN\n                (recognizing him)\n         This is dangerous.\n                       ROBIN\n         So you care for my safety?\n                       MARIAN\n         No, for mine. I do not wish\n         to be seen with an outlaw.\n                       ROBIN\n         Under the Sheriff's law, that's\n         a badge of pride.\n                       MARIAN\n         He's put a price on your head.\n                       ROBIN\n         How much?\n\n                       MARIAN\n         A hundred gold pieces.\n                       ROBIN\n         Is that all? I have not annoyed\n         him enough. Soon he will offer\n         ten thousand.\n                       MARIAN\n         For ten thousand I would turn you\n         in myself.\n                (glances back at\n                 the Sheriff)\n         Nottingham is mounting an army.\n                       ROBIN\n         How do you know?\n                                           (CONTINUED)\n\n                                                     56.\nCONTINUED:\n                       MARIAN\n         He has rounded up every blacksmith\n         in the county. He has them holed\n         up in the castle making swords and\n         armor.\n                       ROBIN\n         What is he planning?\n                       MARIAN\n         I don't know, but there's no limit\n         to the man's ambitions.\n                (as Sheriff heads\n                 towards them)\n         Go!\n\n                       ROBIN\n         If you need me, I will be with\n         the woodsmen. Send for me as\n         'Robin Hood.'\n                        MARIAN\n         Robin!   Do something for me.\n                        ROBIN\n         What?\n                        MARIAN\n         Take a bath.\n                       ROBIN\n         Care to join me?\nWith a grin, he slips into the crowd as Nottingham\narrives.\n\n                       NOTTINGHAM\n         You shine like the sun, my lady.\nHe raises her hand, as he did the girl's in the castle.\nKisses it.\n                       NOTTINGHAM\n         You have been meeting with young\n         Robin of Locksley.\n                (as she tries to\n                 hide her shock)\n         My cousin tells me the knave\n         deprived you of some horses.\n                       MARIAN\n                (recovering)\n         Yes. A most disagreeable\n         experience.\n                                            (CONTINUED)\n\n                                                     57.\nCONTINUED:\n                       NOTTINGHAM\n         I deeply regret it, and I promise\n         you he will be brought to justice.\n         For subjecting you to such\n         treatment, I will hang him from\n         the walls with his own entrails.\nThat gleam of insanity.   Robin watches from a distance.\n                       MARIAN\n         I would like to see that, my lord.\nThe Sheriff places his hand possessively on her shoulder.\n                       NOTTINGHAM\n         My dear, a woman of your refinement\n         is not safe living alone. If you\n         would consent to bring your\n         household within the city walls,\n         I could give your needs my most\n         personal attention.\n                       MARIAN\n         I thank you, Lord Nottingham, from\n         the heart, but for now I prefer to\n         stay in my family's ancestral home.\n         My cousin, King Richard, will be\n         deeply moved to hear of your\n         concern for my welfare.\n                       NOTTINGHAM\n         Alas, the King has many enemies\n         both abroad and at home. I fear\n         for his safe return.\n                       MARIAN\n         Fear not, my dear Sheriff. He will\n         return. When he does, he will\n         wish to reward his faithful subjects.\nThe Sheriff smiles sourly and takes his leave. Marian\ndeflates with relief. The Sheriff walks alone towards\na side door.\n                       BEGGAR\n                (Robin)\n         Alms, my lord.\nNottingham makes to shove the man aside. With a swift\nmove, the beggar grabs the Sheriff in a headlock.\nSlides Nottingham's own dagger to his throat and drags\nhim out of sight.\n                                           (CONTINUED)\n\n                                                      58.\nCONTINUED:\n                       ROBIN\n         A hundred crowns, Sheriff?   You\n         insult me.\nNottingham starts to struggle.   Robin draws blood.\n                       ROBIN\n         Remember young Robin of Locksley,\n         Sheriff? Meet Robin Hood. Your\n         nemesis. Your avenging angel.\n                       NOTTINGHAM\n         If you kill me, you will hang.\n                       ROBIN\n         If I kill you, I will hang happy.\n                       NOTTINGHAM\n         What do you want?\n                       ROBIN\n         I want to give you a chance. A\n         chance you do not deserve. A\n         chance to right your wrongs.\n                       NOTTINGHAM\n         I'm listening.\n                       ROBIN\n         From this day forward you will\n         cease to tax my people. You will\n         renounce the charges against my\n         father, and you will return his\n         lands to me.\n                         NOTTINGHAM\n         Why should I?\n                       ROBIN\n         Because for every harm you do,\n         I swear by God I shall visit on\n         you threefold in return.\n                         NOTTINGHAM\n         Empty words.\n                       ROBIN\n         I am here with a blade at your\n         throat. As long as I live, you\n         will always know that I could be\n         here again.\nA YELL from across the church. Gisborne has spotted them.\nRobin digs the knife a little deeper.\n                                            (CONTINUED)\n\n                                                     59.\nCONTINUED:\n                         ROBIN\n         Your answer?\n                         NOTTINGHAM\n         Never, fool.\n                       ROBIN\n         Then it will begin..\nGisborne yells orders.   Robin hurls Nottingham against\nthe wall.\n\nEXT. NOTTINGHAM CATHEDRAL - DAY\n\nRobin runs to the courtyard and leaps on the Sheriff's\nhorse, which is held by a stunned groom. He rides\nthrough the busy marketplace. A crossbowman tracks\nhim. A sure shot.\nMarian spots the danger. She fakes being tripped and\nstumbles into the bowman. His bolt flies harmlessly\ninto the air.\n                       MARIAN\n                (innocently)\n         Please excuse my clumsiness.\nRobin charges for the city gate. As he passes, he kicks\nthe guard who hasseled him into the wall.\n\nEXT. WOODSMEN'S CAMP - DAY\nMen gather around as Robin dismounts, admiring the horse.\n\n                       ROBIN\n         A personal loan from the Sheriff.\n                       ASLAN\n                (furious)\n         You should not have left without\n         me, Englishman.\n                       ROBIN\n         How so? You have not raised a\n         finger to protect me.\n                       ASLAN\n         Before I had a choice.\n                       ROBIN\n         It was my choice to do this alone.\n                                            (CONTINUED)\n\n                                                       60.\nCONTINUED:\n                       ASLAN\n         A foolish risk. If you had been\n         killed, I would be cursed for\n         eternity for failing to fulfil\n         my pledge.\n                       ROBIN\n         Aslan, if I didn't know better,\n         I would swear you were worried\n         about me.\n\nEXT. NOTTINGHAM CATHEDRAL\nThe Sheriff maniacally spits out orders to Gisborne.\n\n                       NOTTINGHAM\n         Starve them out. Slaughter their\n         livestock. I want to see Locksley's\n         own people fighting each other to\n         bring him to us.\n                       GISBORNE\n         I swear he will not live to see\n         the next full moon.\n\nEXT. HAMLET - DAY\nA SQUEALING HOG is loaded onto a wagon. SOLDIERS round\nup the livestock. An old FARMER protests.\n                       FARMER\n         Go' bless ya, sir. Leave us the\n         sow. She's with young 'uns. The\n         next litter'll feed us through\n         the winter.\n                       SOLDIER\n         You've heard of Robin Hood?\n                       FARMER\n         Yes, sir.\nThe Soldier brutally kicks the old man to the ground.\n                       SOLDIER\n         Then pray he is brought to us\n         before winter.\n\nEXT. WOODSMEN'S CAMP - DAY\nA trail of refugees. Women and children carry their\nbelongings into camp.\n                                          (CONTINUED)\n\n                                                      61.\nCONTINUED:\nWulf runs to greet his mother and siblings.    A contingent\nof woodsmen confronts Robin.\n                       WILL SCARLET\n         You brought this misery on us,\n         Locksley. We can barely feed\n         ourselves.\n                       LITTLE JOHN\n         Sheriff hasn't left us a bloody\n         pot to piss in.\n                       ROBIN\n         Then we shall take from him and\n         his rich friends.\n\nThis provokes a barrage of protests.   The men are angry.\n                       WILL SCARLET\n         Brave talk, Locksley. I say we\n         take the rich boy in.\nMurmurs of general agreement.\n                       ROBIN\n         Will, do you think the Sheriff will\n         give everything back after I am\n         gone?\n                       WILL SCARLET\n         He will give us the reward, and\n         our pardons.\n                       ROBIN\n         Alright, Will. You can take me\n         in on one condition. You must\n         fight me. You may use the Sheriff's\n         horse and arm yourself as you\n         please. I will fight on foot.\n         Unarmed.\n                       WILL SCARLET\n         Unarmed?\n                       ROBIN\n         If you lose, you will accept me\n         as your leader. If you win, you\n         may take me in. Dead or alive.\n                       WILL SCARLET\n         Dead, Locksley.\n                                           CUT TO:\n\n                                                      62.\nEXT. WOODSMEN'S CAMP - DAY (LATER)\nHands tighten a girth. Will confidently jokes with his\ncronies. Woodsmen form a primitive circle of spectators.\nLittle John and his wife, Fanny, keep to themselves,\nwhile Wulf openly talks with Robin, Aslan and Duncan.\nRobin is stripped to the waist, his muscled skin ravaged\nwith scars.\n                       ASLAN\n         This man has true purpose.    He\n         means to kill you.\n                       DUNCAN\n         And you have given him the means.\n                       WULF\n         Will is ruthless, Robin.    Guard\n         your back.\n                       ROBIN\n         I am grateful for your concern,\n         friends, but I have to prove to\n         them it is possible to overcome\n         unequal odds.\n                (shouts)\n         I am ready, Will.\nWill bends, as if checking the horse's legs. Secretly\ngrabs a handful of sand. Swings into the saddle and digs\nin his heels.\nClosing in, Will flings the sand in Robin's eyes. Robin\nclutches his hands to his face, blinded. Will spins\nback to the attack.\nHis sword slashes. Reacting to the sound, Robin rolls\naside. The men cheer like a big fight crowd.\n\nRobin's POV is blurred. Ducking the blade, he grabs\nWill's arm. A blow glances off his shoulder.\nRobin falls to his knees, still blinded. Will rides\nright at him, to trample him. Robin scrambles away.\nWill wheels his horse. A flashing hoof grazes Robin's\nchest.\nRobin leaps to his feet and yells at the top of his\nlungs. Panicked, the HORSE rears, WHINNYING wildly.\nWill struggles to stay in the saddle. Loses his sword.\nRobin seizes the moment and runs to a water trough.\nDouses his face. Yells at Will.\n                                             (CONTINUED)\n\n                                                     63.\nCONTINUED:\n                       ROBIN\n         Come on, you little piss pot.\n         Do your worst!\nWill grabs a spear from a bystander. Robin stands his\nground. Will lunges, Robin sidesteps.\n                       ROBIN\n         The horse is smarter than you are,\n         Will.\nSome of the men laugh. Will is incensed. Robin ducks\nand weaves, easily evading Will's repeated charges.\nRobin ducks right under the horse's belly.\n\n                        ROBIN\n         Here, Will!   You aim like a girl,\n         Will!\nWill stabs wildly, more and more frustrated. Laughter\nspreads, as Robin plays hide and seek around the horse's\nlegs. Grabbing the end of the spear, he clowns a tug\nof war.\nEnraged, Will strains and tries to kick Robin away.\nSuddenly, Robin lets go. Unbalanced, Will flies back-\nwards off his mount.\nRobin snatches the spear and raises it over his fallen\nadversary. The crowd falls silent. Robin strikes. The\npoint quivers in the ground below Will's crotch. Will\nwriggles in terror. Impaled, his pants rip open.\n                       ROBIN\n         Thank the Lord you are not endowed\n         like Bull.\n\nThe crowd is convulsed with laughter. Robin catches his\nbreath. Does not see Will, who grabs a heavy staff and\nruns at him. A strong hand grasps Will's arm as he is\nabout to strike.\n                       LITTLE JOHN\n         Bollocks, Will. Jus' bugger off,\n         eh?\nOverpowered, Will relents.   With a defiant glance, he\nskulks away.\n                       LITTLE JOHN\n         Ya got us by the short and curlies,\n         Robin Hood. Now let's hear what ya\n         got to bleedin' say.\n                                           (CONTINUED)\n\n                                                         64.\nCONTINUED:\nRobin scans the faces.     He has their attention.\n                          ROBIN\n            Nottingham has taken from us\n            everything we own. Now we are\n            going to start taking from him.\n                          LITTLE JOHN\n            'Ow in bloody blazes are we gonna\n            do that?\n                          ROBIN\n            We are going to tax him.\n                                                DISSOLVE TO:\n\nEXT. FOREST ROAD - DAY\nAutumn. The forest is a mosaic of green, gold, orange,\nand red. A giant eye in a circle of glass. Aslan, his\ntelescope raised.\n                          ASLAN\n            Here they come.\n                          ROBIN\n            How many?\n                           ASLAN\n            Two wagons.   Twenty escort.\n                           ROBIN\n            Twenty?   They usually have five.\nHe grabs the telescope.\n\nSCOPE POV\nA phalanx of   mounted soldiers, a cart loaded with\nbarrels, and   a tax wagon. The wagon is an armored box on\nwheels, with   crossbow slits in the side. Guy of Gisborne\ncommands the   escort.\nBACK TO SCENE\n                          ROBIN\n            This is no ordinary convoy.\nBull calls up from below, where a ragged group of woods-\nmen lies nervously in ambush.\n                          BULL\n            'ow many?\n                                                (CONTINUED)\n\n                                                    65.\nCONTINUED:\n                       ROBIN\n         Er, about ten.\n                (then, to Aslan)\n         Why scare them? They can't count\n         anyway.\n                       ASLAN\n         And they call me the barbarian.\n                         ROBIN\n         Let's go.\nTogether they run down the hill, keeping low.\nGisborne eyes the forest. The beer cart is steered by a\nfat red-faced FRIAR, raucously singing hymns and quaffing\nfrom a jug, which he repeatedly dips into one of the\nbarrels.\nARROWS WHISTLE in. The Friar yells and drops his jug. A\nsoldier is hit. At the forest edge, four woodsmen reload\ntheir longbows. Dressed in green, their faces\ncamouflaged.\nThe mounted soldiers charge them. The  woodsmen run into\nthe trees. As the horsemen close in,  the runners leap\ninto a trench. Lift up matted screens  of brush and\ngrass. It's as if they disappeared.   The soldiers slash\nwildly at the thick screens.\nMore arrows fly. More soldiers fall. The others spin\nin confusion, trying to discern the enemy. More woods-\nmen break from cover. Run down a narrow path. Gisborne\nurges his men to pursue. They ride in single file,\nbeating their way through the tangled branches.\n\nThe runners dive into the trees, as other men haul on\nropes, raising a giant screen in the soldiers' path. The\nhorses swerve, on the edge of a twenty-foot drop to the\nriver gorge. Momentum  carries many of them over the\ncliff.\nBACK ON ROADWAY\nRobin and Aslan swing down from the trees onto the tax\nwagon. Kick down the two drivers and take the reins,\nsteering the wagon off the road. The archers inside are\nunable to fire at them.\nLittle John leaps onto the beer cart, sending the Friar\nhurtling back among the barrels. The Friar slams his\nhead and drops unconscious. John whips the horse,\ndriving the cart after Robin. Another camouflage screen\nis lifted into place, covering their route.\n                                           (CONTINUED)\n\n                                                         66.\nCONTINUED:\nGisborne races back to the road... the wagons are gone.\nHe rides frantically back and forth. Searching and\ncursing.\nEXT. FOREST CLEARING - DAY\nRobin climbs onto the tax wagon's roof.     Angry shouts\nfrom inside.\n                       ROBIN\n         Surrender your weapons. I give\n         you my word you shall go free.\nIn answer, a swordblade jabs up through the roof, near\nhis feet.\n\n                       ROBIN\n         Ah, I feared as much.\nHe signals to Aslan, who steers the tax wagon into the\nriver. Water floods in through the slits. Inside,\npanic. Drowning rats.\nThe bowmen scramble out. What they see stops them dead.\nBoth banks are men in green, longbows aimed directly at\nthem.\n                                               CUT TO:\nCOUNTRYSIDE\nSparks. An axe pounds into the lock of a strongbox. The\nlock snaps. Little John pries open the lid. Reacts in\nastonishment. The trunk is filled to the brim with\nglittering gold coins. The woodsmen press around.\nCheers of celebration.\n\n                       LITTLE JOHN\n                (awestruck)\n         I'll be buggered.\n                       ROBIN\n         This treasure had a purpose.     We\n         must find out what.\nHe turns at the sound of a brawl from the Friar's cart.\nThe Friar is at the bottom of a struggling heap of bodies.\n                        ROBIN\n         Get off him.   He's a man of the\n         cloth.\nRobin drags the men off. The Friar clambers to his feet.\nAround him are strewn battered and winded woodsmen.\n                                               (CONTINUED)\n\n                                                      67.\nCONTINUED:\n                       FRIAR\n         The Lord's blessing on you, kind\n         sir. These sinners were attempting\n         to steal these libations destined\n         for the monks of St. Catherine's.\nHe indicates his cargo of barrels.\n                       ROBIN\n         It appears to me, Reverend Friar,\n         that many of the libations have\n         found their way into your own\n         esteemed person.\nIgnoring him, the Friar mounts the cart.\n\n                       FRIAR\n         A thousand pardons, sir, but duty\n         beckons. I must hasten on.\n                       ROBIN\n                (grabbing the bridle)\n         A moment, my reverend friend. You\n         travel with poor company when you\n         travel with Nottingham's soldiers.\n                         BULL\n         Aye, tax him.\nThis sparks a chorus of comments.\n                       ROBIN\n         My men are thirsty and have much\n         to celebrate.\n                       FRIAR\n         Lord bless me, sir, are these your\n         men? I had mistook them for\n         common thieves. Kindly step\n         aside.\n                       ROBIN\n         Surely the Lord has the charity to\n         spare a few barrels to good\n         Christian men.\nThe Friar relents, loosening his grip on the reins.\n                       FRIAR\n         Well, sir, if you wish them to\n         share in the good Lord's brew...\nCasually reaching under the seat, he pulls out a club.\nSmites Robin with it.\n                                            (CONTINUED)\n\n                                                     68.\nCONTINUED:\n                       FRIAR\n         ... you must best me for it.\nRobin staggers. The Friar whips up the horse. Dazed,\nRobin grabs for the fat man's leg. Gets a holy sandal\nfull in the face.\n                         FRIAR\n         Giddyup, nag!\nThe Friar's horse, as obese as his driver, slowly raises\nhis head from the grass and ambles forward. Robin runs\nafter them and dives at the Friar, toppling him from the\ncart.\n\n                       ROBIN\n         You leave when I say.\nScrambling to his feet, the Friar glances skyward.\n                       FRIAR\n         Protect me, Lord.\nHe sweeps his foot, knocking Robin's legs out from under\nhim. Hurls his full body weight on top of him. Whooomf!\n                         FRIAR\n         Yield!\nHe bounces on Robin's stomach. Robin can barely breathe.\nThe woodsmen are enjoying the spectacle.\n                       FRIAR\n         Confess that Friar Tuck is a\n         better, holier, and braver man\n         than thou art, knave.\n\n                        ROBIN\n         Never!   Whoomf!\n                         FRIAR\n         Yield, I say!    Yield to Friar\n         Tuck.\nDesperate, Robin bites the Friar's leg. Tuck howls.\nRobin extricates himself, grabs for a weapon. Smashes\nthe Friar's head with his drinking jug.\n                       ROBIN\n         Yield yourself!\nHe dives onto the Friar and hammers his head into the\nground.\n                                           (CONTINUED)\n\n                                                         69.\nCONTINUED:\n                       ROBIN\n         Yield to Robin Hood.\nTuck holds up a hand in surrender.    Robin eases off.\n                       FRIAR\n                (feeling his head)\n         Thank you, Lord, for teaching me\n         humility.\n                       ROBIN\n         Well, Friar Tuck. We have need\n         of an honest man of God, to\n         minister to these men and their\n         families. What do you say?\n\nThe Friar struggles to his feet. He reviews the motley\nfaces of his potential flock. His eyes light on the\ngrinning Saracen.\n                       FRIAR\n         I'd rather roast in hell.\nHe punches Robin in the gut.\n                                              CUT TO:\n\nFRIAR TUCK\nstrapped into the traces, pulls the beer cart. Sweating\nprofusely, grunting with strain. His horse contentedly\nfollows.\n                       ROBIN\n         Giddyup, Friar.\n\nHe flicks the reins, steering the cart into camp. Women\nand children rush to greet their men. Jeer the roped\nsoldier-prisoners. The Friar checks out his flock. A\nwoman curtsies, another crosses herself, children touch\nhis robe in wonder.\n                       ROBIN\n         What do you say now, Tuck?    Here\n         are the meek of the earth.\nTuck surveys the hopeful, hungry faces. The little\nhamlet of half-built huts. He folds his hands in a\nmoment of prayer.\n                       FRIAR\n         The Lord moves in mysterious\n         ways. I accept.\n                                              (CONTINUED)\n\n                                                      70.\nCONTINUED:\n                       ROBIN\n         You will not regret it.\n                       FRIAR\n         Aye, but you may.\n                                            CUT TO:\nEXT. WOODSMEN'S CAMP\nA blazing fire. Deer carcasses roast. Tuck's barrels\nsupply the refreshment. Robin and Aslan pass out coins\nto each family.\n                       ROBIN\n         Buy yourself a new son, Stephen.\n                       FARMER\n         Thankee, Robin.\nLittle John and Bull approach. John indicates the two\nprisoners roped to a nearby tree.\n                       LITTLE JOHN\n         Cain't get a bleedin' squeak outa\n         'em, Rob.\n                       BULL\n         They'd be spittin' it out good\n         if they'd knowed anythin'.\n                       LITTLE JOHN\n         Reckon the Cap'n knows summat, Rob,\n         but stubborn ol' cocker 'e is.\n                       ASLAN\n         Perhaps it is time for some\n         heathen persuasion.\n                                            CUT TO:\nCAPTAIN OF SOLDIERS\nstares up at Robin defiantly.\n                       CAPTAIN\n         Spare your breath. I know nothing.\n                       ROBIN\n                (reasonable)\n         I believe you. But this Arab here,\n         he's got it into his barbarian\n         brain that you know a whole lot\n         more than nothing.\n                       (MORE)\n                                         (CONTINUED)\n\n                                                      71.\nCONTINUED:\n                       ROBIN (CONT'D)\n         And when he gets like this,\n         he's very hard to reason with.\nWith a hair-raising war cry, Aslan   leaps INTO VIEW.\nStripped to the waist, brandishing   his scimitar. The\nCaptain tries to back away. Robin    tries to restrain\nAslan, is hurled aside. Snarling,    drooling at the mouth,\nAslan explores the Captain's body   with his hands. A\nbutcher checking meat.\n                       ROBIN\n         I strongly advise you to talk.\n         He hasn't eaten in weeks.\n\n                       CAPTAIN\n                (rising terror)\n         What does he want?\n                       ROBIN\n         You.\n                       CAPTAIN\n         For Godsakes, get him off me!\n                       ROBIN\n                (very deliberately)\n         No, Aslan... not this one, Aslan.\n         ... How about this other one?...\n         Fatter, yes... more meat.\nThe other soldier, who definitely  has more flesh on the\nbone, is struck dumb with horror,  as Aslan turns his\nattention to him. With one swing   of his sword, Aslan\nslices through the man's ropes.   Drags him to his feet.\nLittle John runs over.\n\n                       LITTLE JOHN\n                (urgent)\n         No, Robin, no! They be God-fearin'\n         men.\n                       ROBIN\n         I cannot stop him, John. Besides,\n         if they will not tell what they\n         know, then they must pay the price.\n                       LITTLE JOHN\n         Kill 'em aye, but not like this.\n         'Tain't Christian.\nBlood-curdling SCREAMS from behind the wagon where Aslan\nhas dragged his victim. The Captain's face pales. Then\nsilence.\n                                           (CONTINUED)\n\n                                                     72.\nCONTINUED:\nThe demented Arab slowly reappears. Blood drips from his\nlips. He munches the flesh from a long bone, on the end\nof which is the soldier's glove... the man's arm.\nTurning to Robin, Aslan shouts in Arabic and gesticulates\nwildly at the Captain.\n                       CAPTAIN\n         What does he say?\n                       ROBIN\n         Well, roughly, he says that he\n         doesn't care for the way your\n         friend tastes, and he wants you.\n                       CAPTAIN\n         No, God, no! I'll talk. Just\n         keep him away. Keep him away!\n\nBEHIND WAGON\nBull holds the other prisoner, muffling the man's mouth\nand trying to suppress his own laughter. Beside them\nlies a large chunk of venison. The man is unharmed,\nexcept that he's missing a glove.\n\nINT. WOODSMAN'S HUT - NIGHT\nThe walls shake with Little John's laughter.\n                       LITTLE JOHN\n         Sure changed the color of 'is\n         britches, didn't 'e?\n                       ROBIN\n         Thanks to our cannibal friend.\nAslan repeats his wildman act, munching on a chunk of\nvenison.\n                       LITTLE JOHN\n         Gonna laugh my bloody balls off.\n                       BULL\n         Why'd the Sheriff be sendin' gold\n         north o' the border?\n                       ROBIN\n         To hire mercenaries. The Celts\n         are savage tribesmen, trained\n         to kill from birth.\n                                            (CONTINUED)\n\n                                                     73.\nCONTINUED:\n                       LITTLE JOHN\n         Aye, the Romans built a bleedin'\n         great wall to keep 'em out.\n                       BULL\n         What does 'e want wi 'em?\n                       ROBIN\n         Since he also has every Smith\n         in the country working in his\n         castle, we can assume he is\n         planning a little war.\n                       LITTLE JOHN\n         Agin' who?\n\n                       ASLAN\n         England.\n\nINT. CASTLE ARMORY - NIGHT\nSparks. Smoke. Sweat. The Sheriff inspects his weapon\nfactory. His eyes glint with the reflections of the\nsmithy's fires.\nA DOOR CRASHES open behind him. FOOTSTEPS. Paying no\nheed, he draws a sword from a furnace. It's blade white-\nhot.\n                       GISBORNE\n         We were ambushed. In Sherwood\n         Forest.\nNottingham tests the sword against an anvil.\n\n                       NOTTINGHAM\n         Spanish steel, cousin. So much\n         stronger than our native blades.\n         Any losses?\n                       GISBORNE\n         All the men are gone.\n                       NOTTINGHAM\n         Yet again you are the sole\n         survivor, cousin? Interesting.\n         And the gold?\n                       GISBORNE\n         Well, it er... disappeared.\n                                            (CONTINUED)\n\n                                                       74.\nCONTINUED:\nThe Sheriff looks at Gisborne for the first time.\n                       NOTTINGHAM\n         Robin Hood?\n                       GISBORNE\n         They were woodsmen, dressed in\n         green.\n                       NOTTINGHAM\n         Robin Hood.\nHe places a hand reassuringly on his cousin's shoulder.\n                       NOTTINGHAM\n         Cousin, we must be strong. We\n         cannot allow this outlaw to make\n         fools of us.\nWithout warning, he drives the blade into Gisborne's\nbelly.\n                       NOTTINGHAM\n         And I cannot allow a lieutenant\n         to fail me.\n                (turning to the\n                 horrified smithy)\n         It is indeed fine steel.\n\nEXT. VILLAGE - DAY\nA small procession. Tuck drives his cart, Bull the tax\nwagon. Both vehicles laden with supplies. Wulf and Hal\npass out flour, chickens, blankets, clothing to the\nvillagers. Their weapons are prominently displayed.\nTuck swigs from a jar, passes it to an old villager.\n                       FRIAR\n         God bless you, sir.\n                       VILLAGER\n         An' Go' bless Robin 'Ood, friar.\n         They says as 'ow none o' the\n         Sheriff's cronies dare go within\n         miles o' Sherwood for fear o'\n         havin' their pockets pinched.\n                       FRIAR\n         Ah, the good Lord giveth and the\n         good Lord taketh away.\n                       OLD WOMAN\n         Unless Robin Hood takes it first!\n                                            (CONTINUED)\n\n                                                     75.\nCONTINUED:\nLaughter. The procession passes two of the Sheriff's\nmounted soldiers. They glumly watch as Tuck raises his\njug in greeting.\n                       FRIAR\n         Good morrow, brothers.\n\nEXT. FOREST POOL - DAY\nWater, sparkling with sunlight. Bursts, as Robin dives\nin naked. He luxuriates in the cool water... HOOFBEATS.\nHe attempts to hide... too late. Four horses emerge from\nthe trees. Bull and Hal, with Marian and her servant\nSarah sandwiched between them. Bull has a black eye.\nMarian jumps down.\n                       MARIAN\n                (to Robin)\n         How dare you!\n                       ROBIN\n         Good morning, Lady Marian.\nIn response, she starts pelting him with stones.\n                       MARIAN\n         You send men to drag me from my\n         home in the middle of the night,\n         like some slave girl? Is this\n         the way the famous Robin Hood\n         treats a lady?\n                       ROBIN\n         Ah well... er, let me finish this\n         bath you wished me to take. Then\n         I'll explain.\n                       MARIAN\n         I demand an explanation right now!\n                       ROBIN\n         If you will be patient, I could\n         spare your propriety by...\n                       MARIAN\n         I will decide when my propriety\n         is compromised.\n                         ROBIN\n         As you wish.\n                                            (CONTINUED)\n\n                                                     76.\nCONTINUED:\nHe wades bare-ass naked out of the water towards her.\nShe casts a contemptuous look over his muscled body,\nglistening with water.\n                       MARIAN\n         How dare you expose yourself to\n         me?!\nShe slugs him. Robin stumbles backwards into the water.\nBull grins, gesturing to Sarah and pointing to his own\nblack eye.\n                       BULL\n         The big 'un did the same to me.\n\n\nEXT. WOODSMEN'S CAMP - DAY\nAn arrow flies into a bull's-eye, crudely marked on a\ntree. Little John lowers his crossbow, delighted at\nhis shot.\n                       LITTLE JOHN\n                (to Wulf)\n         Right m'lad. Let's see how close\n         you can git to that bugger.\nWulf takes aim. His arrow slices clear through his\nfather's arrow, splitting it in two. Little John slaps\nWulf on the back and beckons everyone over.\n                       LITTLE JOHN\n         Take a gander at this 'un, mates.\n         Never seen nuthin' like it in\n         my bloomin' life.\n\nRobin leads Marian through the camp... the beginnings of\na village -- women doing laundry, kids playing, men prac-\nticing archery and swordplay, others working on defenses,\ncamouflaging a giant pit. Marian is impressed, but not\nabout to admit it.\n                       MARIAN\n         This better be damned important.\nRobin leads her into a hut. Inside is a trove of cap-\ntured loot -- purses, jewelry, weaponry, fancy coats\nand... the treasure chest. At Robin's nod, Bull throws\nback the lid. Marian is speechless.\n                       ROBIN\n         Nottingham robs the poor. We\n         rob Nottingham and give back to\n         the poor.\n                                            (CONTINUED)\n\n                                                       77.\nCONTINUED:\n                        MARIAN\n          Do you think he's going to let\n          you get away with all this? The\n          man is without mercy. He will\n          annihilate you.\n                        ROBIN\n          Somebody has to take a stand.\n                        MARIAN\n          You're taking a stand with the\n          lives of these people. These\n          young ones.\nA beat. She checks the faces. Her eyes meet Robin's.\nIs there a hint of concern for him also?\n                        MARIAN\n          What do you want from me?\n                        ROBIN\n          Nottingham was sending this gold\n          to buy reinforcements from the\n          Celtic tribesmen. We need to\n          warn King Richard.\n                        MARIAN\n          Nottingham would not dare\n          challenge the King.\n                        ROBIN\n          The King is not in England to\n          be challenged, is he? While he\n          is away, he may lose his country.\n                 (Marian masks her\n                  concern)\n          You are Richard's cousin. You\n          can get word to him. He would\n          believe you.\n                        MARIAN\n          Now you want me to participate\n          in your folly?\nA little girl approaches, holding a bouquet of wild\nflowers. Touched, Marian kneels to accept the offering.\n                                             CUT TO:\n\nBOUQUET\nprotrudes from Marian's saddle. She is mounted, ready\nto go. Sarah giggles as she takes her leave of Bull.\n                                             (CONTINUED)\n\n                                                       78.\nCONTINUED:\n                       ROBIN\n                (to Marian)\n         I am sending Duncan with you.\n         Give him some warm food and a\n         real bed. I grow tired of his\n         bellyaching.\n                       DUNCAN\n         Hah! I have endured more hardship\n         in my lifetime than any man here.\nRobin laughs and speaks to Marian in a stage whisper.\n                       ROBIN\n         Don't tell him I told you, but\n         he may be useful to you. There\n         is no one to whom I would rather\n         entrust your safety.\n                       MARIAN\n         Duncan, you are most welcome.\nTaking the lead rein from Duncan's horse, she rides away.\n                       ROBIN\n                (calls after her)\n         Will you send word to the King?\n                       MARIAN\n         I'll think about it.\n\nINT. DUBOIS MANSION - DAY\nA globule of red liquid.    A signet ring.   Marian seals\na letter.\n\n\nINT. BISHOP'S CASTLE - DAY\nThe letter is held in the pudgy, jeweled fingers of the\nBishop of Hereford. A lavish office.\n                       MARIAN\n         It is a personal matter, my Lord,\n         but one of vital importance.\n                       BISHOP\n         I understand, my dear lady.\n         This is my most trusted emissary.\nHe hands the letter to a solemn courier.\n                                             (CONTINUED)\n\n                                                      79.\nCONTINUED:\n                       MARIAN\n         You will travel to France\n         immediately. You must give this\n         directly into the hands of the\n         King, and him alone.\nThe courier bows in acknowledgement.    Marian indicates\nSarah.\n                       MARIAN\n         My lady-in-waiting will accompany\n         you.\nSurprised, the courier glances at the Bishop.\n\n                       BISHOP\n         My dear, I could not vouch for\n         her safety. The journey is fraught\n         with danger.\n                       MARIAN\n         I appreciate your concern, my\n         Lord, but Sarah is an accomplished\n         rider. I must insist that she\n         goes along.\n                       BISHOP\n                (a beat)\n         As you wish.\n\nEXT. WOODSMEN'S CAMP - DAY\nAn informal council of war.   Robin uses a stick in the\ndirt.\n\n                       ROBIN\n         We have to be ready to move camp\n         at any time. The only way we can\n         be attacked is from the Nottingham\n         Road. We hide lookouts in the\n         trees, here and here. If they\n         see soldiers, they shoot warning\n         arrows. Whistles by day, fire\n         by night.\nWulf runs up to Little John in panic.\n                        WULF\n         Father!   Come quick.   Mother's\n         dying.\n\n                                                       80.\nINT. WOODSMEN'S HUT - DAY\nFanny Little writhes in agony.    John rushes in.   Tuck\nlooks up from Fanny's side.\n                       FRIAR\n         The child comes early.\nFanny screams.   John kneels beside her, taking her head.\n                         LITTLE JOHN\n         Hush, m'lass.    Ya'll be fine.\n                       FANNY\n         'S not like t'others, John.    Oh\n         God, it pains me so.\n\n                       LITTLE JOHN\n                (angrily, to Tuck)\n         Ya're sittin' thar like a fat\n         sow. Help her, man, help her!\n                       FRIAR\n         I am doing all I can.\nAslan appears in the doorway, with Robin. Whips back the\nblanket. Fanny's chest is covered with black squirming\ncreatures.\n                       ASLAN\n         By Allah, leeches!\nHe starts to pull the parasites off.    Tuck jumps at him.\n                       FRIAR\n         Get away from her!\nAslan pushes him away, continuing his work.\n\n                       ASLAN\n         Blood is like air. If she loses\n         blood, she and the child will die.\nJohn is paralyzed with confusion.    Tuck appeals to Robin.\n                       FRIAR\n         He lies. He is the devil's seed,\n         sent to lead us astray.\n                       ASLAN\n         Fool, both the Bible and the Koran\n         instruct us to preserve life.\nTuck raises an arm to strike Aslan. Robin blocks the\nblow. Aslan gently touches the mother's stomach.\n                                             (CONTINUED)\n\n                                                       81.\nCONTINUED:\n                       ASLAN\n                (soothing)\n         Your baby has not turned. It\n         cannot be born without help.\n                       FRIAR\n         What do you know, you damned\n         savage?\n                       ASLAN\n                (to John)\n         If you will allow me, I can help\n         her. It will not be without\n         danger.\n\n                       FRIAR\n         Do not listen to him!   He will\n         kill her.\n                       ASLAN\n         If you do not listen to me, she\n         will certainly die. And the\n         child, too.\nFanny cries out.   John looks to Robin, pleading for\nadvice.\n                       ROBIN\n         The good Friar has done all he\n         can. I suggest you let the Arab\n         try.\n                (as John is\n                 undecided)\n         If I am wrong, and they die, then\n         you may take my life.\n\nJohn's eyes meet his wife's.   She nods.\n                        LITTLE JOHN\n         So be it.\n                       FRIAR\n         Then it will be on your head.\n         I have warned you.\nHe storms out.   All business, Aslan speaks to Wulf.\n                       ASLAN\n         Bring me a needle, thread, water,\n         a skinning knife, and burning\n         ashes.\nWulf runs to obey. John looks horrified. Robin eases\nhim outside, then returns to Aslan's side. They\nwhisper.\n                                          (CONTINUED)\n\n                                                         82.\nCONTINUED:\n                        ROBIN\n          What are you going to do?\n                        ASLAN\n          The child must be taken out by\n          the knife.\n                          ROBIN\n          The knife?\n                        ASLAN\n          I have seen it many times with\n          horses.\n                       ROBIN\n          Horses? By the Lord, what are\n          her chances?\n                        ASLAN\n          After wasting so much blood...\n          not good.\n                        ROBIN\n          Now you tell me!\nWulf runs back in.     Aslan holds up a piece of wood.\n                        ASLAN\n                 (to Fanny)\n          Are you ready?... Bite down on\n          this... Robin, hold her steady.\nHe lifts the red-hot knife from the ashes.\n\nOUTSIDE\n\nLittle John paces. Wulf comes out of the hut.      Families\nhover and wait. From inside, MUFFLED GROANS.\n                        FRIAR\n          I tell you, the barbarian is\n          killing her.\nJohn moves to the hut.     Wulf restrains him.\n\nINSIDE\nThe mother heaves, then drops.\n                          ROBIN\n          Is she gone?\n                                             (CONTINUED)\n\n                                                       83.\nCONTINUED:\nAslan ignores him, keeps working over Fanny's body.\nRobin cannot watch... a WAIL! Aslan mutters something\nin awed Arabic.\n                       ROBIN\n         What did you say?\nAslan holds up a bloody struggling infant.\n                        ASLAN\n         It is a boy.\nThe mother revives.   Aslan places the child on her\nbreast.\n\n                       ASLAN\n         Your son, my lady... Robin, hold\n         her skin together while I sew her\n         up.\nHe picks up the needle and thread.   Robin's eyes turn to\nthe woman's abdomen... He faints.\n                                             CUT TO:\n\nLITTLE JOHN\nmarches among the cheering families, holding his newborn\nchild high for all to see. Tuck sits miserably to one\nside. Bloody and  exhausted, Aslan appears at the hut\ndoor. Tuck jumps  to his feet, drawing his knife.\nHeads turn. Tense silence. Robin appears, unsteadily,\nbehind Aslan. Watches, ready to intervene. Tuck stares\nat Aslan. Raises his blade... and slices down across\nhis own wrist.\n                       FRIAR\n         This day God has taught me a fine\n         lesson.\nHe hands Aslan the knife and extends his bloodied wrist.\n                       FRIAR\n         I would be honored.\nAslan slices his own wrist. The two wrists clasp\ntogether in the universal sign of brotherhood. Everyone\ncheers.\n                       FRIAR\n         You are a good man, my barbarian\n         friend.\n                       (MORE)\n                                             (CONTINUED)\n\n                                                       84.\nCONTINUED:\n                       FRIAR (CONT'D)\n         We shall open a barrel together\n         and I shall do my damndest to\n         save your heathen soul.\n                       ASLAN\n         Alas, I am not permitted...\n                       FRIAR\n         Our God made this brew, brother.\n         I merely combined the ingredients.\n         Do you dare to insult his works?\n\nEXT. COUNTRY ROAD - DAY\n\nHooves fly along a track. Sarah and the courier.    The\ncourier reins in, Sarah draws alongside.\n                       SARAH\n         What is wrong?\n                       COURIER\n         My horse seems to be favoring\n         a foreleg.\nSarah leans down to look and the courier cudgels her\nacross the neck. She falls from the saddle, unconscious.\n\nINT. DUBOIS MANSION - MARIAN'S CHAMBER - NIGHT\nFlickering candlelight. Marian is alone, reading. A\nsudden gust extinguishes her candle. HAMMERING and\nSHOUTING from a distant part of the house. Unnerved,\nshe calls out.\n\n                          MARIAN\n         Who is there?     Duncan!\n\nINT. DUBOIS MANSION - KITCHEN - NIGHT\nMarian enters stealthily. A candle in one hand, a\ndrawn dagger in the other. Something leaps at her!...\nA cat, looking for scraps on the kitchen table. She\nshoos him down.\n                       MARIAN\n         Off, Nicodemus. Go find mice.\nShe sighs with relief... is grabbed from behind.   A\nmasked SOLDIER.\n                                           (CONTINUED)\n\n                                                        85.\nCONTINUED:\n                       SOLDIER\n         We meet again.\nHe reveals a large scar on his wrist -- removes his\nmask -- the man who attacked her earlier. He prods\nher with his sword.\n                       SOLDIER\n         Drop your blade.\n                       MARIAN\n         You are still overmatched, soldier.\nShe drops the sword. He hurls her against the table.\nLays his blade against her chest.\n\n                       SOLDIER\n         You owe me favors, wench. Bare\n         your breasts... or I will do it\n         for you.\nResignedly, she raises a hand to loosen the string on her\ndress. With the other hand she reaches behind her, grabs\na pepper bowl. Flips the contents into his face.\nScreaming, he grabs his  face. She reaches for her\ndagger. He slashes with   his sword. She backs to the\nfireplace, grabs a spit  of roasted chickens... drives\nthe point clean through  his chest.\nHe stares in shock at his own blood pouring from the\ncooked fowls pinned to his breast... FOOTSTEPS... masked\nsoldiers converge from both sides of the house, dragging\nthe servants. Duncan  is shoved through the door.\n                       DUNCAN\n         I am sorry, my lady.    There were\n         too many.\nShe stares at the invaders with studied calm.\n                       MARIAN\n         Is there something you need,\n         gentlemen? I remember no masked\n         ball on my calendar.\n                                              CUT TO:\n\nAERIAL SHOT\nFLYING LOW OVER treetops, OVER an expanse of green,\nintersected by brown roads and tracks. We are LOOKING\nAT a detailed scale model of Sherwood Forest in...\n\n                                                      86.\nINT. CASTLE CHAMBER - NIGHT\nThe Sheriff and SIX BARONS are gathered around the model.\nThese are the men who revealed their faces to Lord\nLocksley in the Druid ceremony. Nottingham toys with\na white rat on his arm.\n                       REDHEAD BARON\n         Forget about Locksley. He is no\n         threat.\n                       NOTTINGHAM\n         How can we control all England if\n         we cannot control our own county?\n         The people are turning him into\n         a hero.\n\n                       GREYBEARD BARON\n         It is impossible to attack him\n         in the forest. We have tried\n         everything. He is cunning.\n                         NOTTINGHAM\n         Then we   will be more cunning. I\n         must be   rid of him. We may not\n         be able   to intercept his next\n         warning   to the King.\nSounds of COMMOTION outside. The door swings open.\nFramed in the doorway is a colossus in black armor.\nHis helmet is the head of a dragon. He slowly raises the\nvisor. Deep tribal scars on his cheeks. Implacable\nferocity in his eyes.\n                       CELTIC CHIEFTAIN\n         I want the heads of the men who\n         stole my gold.\n\n                       NOTTINGHAM\n         Welcome, sir. We were discussing\n         how to rid ourselves of those very\n         men. The outlaws who band with\n         Robin Hood.\n                       REDHEAD BARON\n         My Lord Nottingham, I must protest.\n         It is a mistake to ally ourselves\n         with foreigners.\n                       GREYBEARD BARON\n         What can these Celts do that we\n         cannot?\n                                             (CONTINUED)\n\n                                                     87.\nCONTINUED:\nThe Chieftain strides across to the fire. Grabs a\nburning log. The Baron backs away in fear. The log\nspits sparks as the Chieftain raises it above his head...\nand drives it into his own palm. He stares unblinking\nat the Baron, holding the log to his hand for a full\nthree seconds.\nAn awed silence. Nottingham grins, delighted with the\ndemonstration. He deposits his white rat onto the model.\n                       NOTTINGHAM\n         This rat Hood has hidden out in\n         the forest.  He resists all our\n         assaults with traps and devices,\n         while he robs us blind. We must\n         bring him out and destroy him.\nThe rat has scurried into the shelter of the model trees.\nThe Chieftain watches impassively, then calmly touches\nthe log to the model. The trees ignite... the RAT\nSQUEALS in terror and runs. The Chieftain cuts off its\nescape, setting fire to more trees... again... and\nagain. The Sheriff watches the flames, fascinated.\n                                            DISSOLVE TO:\n\nEXT. WOODSMEN'S CAMP - NIGHT\nThe campfire. Aslan shrieks a war cry.   Dervishes 'round\nthe fire, swigging from a jug. Equally  drunk, the Friar\nfollows, howling, mimicking him. Robin  and the others\nwatch in amusement. Tuck scoops another  jug and hands it\nto Aslan.\n                       FRIAR\n         Come, you son of Saladin. A toast\n         to all of Jehovah's children. The\n         saved and the damned.\n                       ASLAN\n         This must be a truly evil potion,\n         to make the soul feel this good.\nHe downs the entire jug in one long draught.   Refills it.\n                       ASLAN\n         Come, holy man. A toast to all\n         of Allah's children. The true\n         believers and the fat infidels.\nTuck laughs and drinks. Aslan sways and topples at the\nFriar's feet. Heaves up all over the holy sandals. Tuck\nlooks at Robin.\n                                            (CONTINUED)\n\n                                                      88.\nCONTINUED:\n                       FRIAR\n         How can these Arabs hold Jerusalem\n         when they can't even hold their\n         brew?\n                                            DISSOLVE TO:\n\nEXT. FOREST LANE - DAWN\nA masked soldier gallops along.    Hurls a bundle to the\nground.\n\nEXT. WOODSMEN'S CAMP - DAWN\n\nThe Friar and the Saracen lie head to head on the dewey\ngrass. Tuck  snores. Robin shakes Aslan, who grabs for\nhis weapon.  The hangover hits him like a mallet. He\nclutches his temples.\n                       ROBIN\n         The dancing demon! Good morning.\n                       ASLAN\n                (wincing)\n         If it was Jehovah who created this\n         brew, he is truly wise. He built\n         the punishment into the crime.\nAn ARROW WHISTLES into a tree.    Robin reacts.\n                       ROBIN\n         They need help.\n\n\nEXT. FOREST LANE - DAY\nBull and Hal are crouched in the roadway, over a body.\nRobin runs up with Aslan. He kneels beside them. The\nbody is Duncan. Robin clasps a dead hand... Silence.\nFighting his emotions.\n                       BULL\n         A bloke wearin' a mask o' the\n         Druids rode by. Tossed 'im down.\n                       ROBIN\n         Are you sure it was a Druid mask?\n                (as Bull nods)\n         Damn them to hell! They must have\n         Marian. Do you know where they\n         meet?\n                                            (CONTINUED)\n\n                                                     89.\nCONTINUED:\n                       BULL\n         The Gregor Caves, I 'eard tell.\n                       ASLAN\n         We will go there.\n                       ROBIN\n         No! You stay here, dammit!    I\n         will go alone.\n                       ASLAN\n         You forget yourself.   I am not\n         your servant.\n                       ROBIN\n         Then be my friend. There are\n         women and children here in greater\n         need of your courage.\n                       ASLAN\n                (considers)\n         Take my eyes, then.\nHe hands Robin his telescope.\n                                           CUT TO:\n\nEXT. CAVES\nSQUAWKING ominously, CROWS burst from the trees. Robin\nrides up the path to the caves that his father took.\nChecks the ground. Horse tracks. He dismounts, moves\ncautiously forward.\n\n\nPOV THROUGH SCOPE - CIRCLE OF STONES\nNo one visible. Debris. Smoke rises from ashes.\nRemnants of a recent ceremony.\n\nBACK TO SCENE\nRobin climbs silently down the rocks into the stone\ncircle. There is blood on the sacrificial altar.\nThrough the opening of the cave, he spies a woman's form,\nlying face down.\n                       ROBIN\n                (under his breath)\n         Marian!\n                                           (CONTINUED)\n\n                                                       90.\nCONTINUED:\nHe runs forward. Turns the body over. Skin chalk-white\nfrom loss of blood... Sarah! A shadow falls across\nRobin. Before he can react, a cudgel stuns him into\nblackness.\n\nINT. CAVE - DAY\nRobin's eyes  -- he wakes. Squints around him, the dark\nsmoke-filled  recesses of the caves. The walls weave.\nEerie WATERY  sounds, like the CRIES of drowning men.\nHe tries to  stand.\n                       VOICE (O.S.)\n         Robin!... Robin!\n\nA figure in a flowing white robe. Angelic. Floating\ntowards him... Marian. He tries to speak her name.\nReaches out his hand.\n                       MARIAN\n         Death is not to be feared,\n         Robin. Embrace it.\nHer LAUGH ECHOES around the cave, as if hundreds of lost\nsouls are laughing with her. Robin crawls away, cover-\ning his ears. Marian lifts his face to hers.\n                        MARIAN\n         Drink this.\nWeakly, Robin tries to push away the cup.   Her hand\ngrips his chin, forcing his mouth open.\n                        MARIAN\n         Drink.\n\nThe liquid trickles over his lips. He tries to focus.\nHer features are BLURRED, her voice hypnotic.\n                       MARIAN\n         Look at me. Listen to me. You\n         belong to me. Your soul is mine.\n         You will obey my every word. Do\n         you understand?\nHer face is inches from his. He tries to pull away, his\nsubconscious sounding alarms.\n                        ROBIN\n         Why, Marian?\n                                            (CONTINUED)\n\n                                                       91.\nCONTINUED:\n                       MARIAN\n         Because you love me. Say it.\n         You love me.\n                (as Robin struggles)\n         Say it!\n                       ROBIN\n                (sinking)\n         I love you.\n                       MARIAN\n         Kiss me.\nHe gives himself to her. Their lips meet... something\nchanges in his vision. Her eyes glow red. Her face\nstarts to shrivel -- He is kissing the wrinkled lips of\nMortianna.\nHe pulls away... strong arms grab him. He shakes his\nhead, trying to make sense. Through his BLURRED vision,\nwe see he is surrounded by masked men.\n                       ROBIN\n                (slurred)\n         Where is Marian?\n                       MORTIANNA\n         She is with friends.\n                (cackles)\n         Your resistence is strong, but\n         useless. Sign this.\n                (as quill is forced\n                 into his hand)\n         You are a Druid like your father.\n         You consort with the devil. Your\n         confession will be witnessed by\n         the Bishop of Hereford.\nA guard forces Robin's hand across the page... then\ncries out, clutching his back... An arrow lodged be-\ntween his shoulders.\nIn the cave mouth are Wulf, bow in hand, Bull kneeling\nbeside Sarah's corpse, and Aslan.\n                       MORTIANNA\n                (horror)\n         The painted man!\nAslan's war CRY RICHOCHETS off the cave walls. A    curved\nscimitar in one hand, a straight English sword in   the\nother, his arms are lethal windmills. The masked    guards\nare cut down left and right. Mortianna retreats,    scurry-\ning into the depths of the cave.\n                                          (CONTINUED)\n\n                                                     92.\nCONTINUED:\nBull joins the fray, charging like his namesake, howling\nin rage, flailing at heads with his quarterstaff. Wulf\nstays in the mouth, picking off men with deadly accuracy.\nA furious melee. Bull and Aslan mow down the enemy like\nhay, battling far superior odds. Soon they are the only\ntwo left standing. Bull peers cautiously into the dark-\nness. Behind him, one of his victims crawls back to his\nfeet... and lunges.\n                          ASLAN\n         Behind you!\nToo late. A sword is driven through Bull's gut. Aslan\ngrabs the attacker by the neck and pile-drives him into\nthe cave wall. The man's SKULL CRACKS against the rocks.\nAslan runs to Robin's side, as Wulf hurries to Bull's.\nRobin is slumped against a rock.\n                       ROBIN\n                (groggy)\n         Marian?\nAslan runs to the back of the cave, searching. Wulf is\ncrouched beside Bull, who murmurs his dying words.\n                       BULL\n         Ya be sure Sarah gits a Christian\n         burial. Promise me, boy.\n                          WULF\n         I promise.\nAslan stumbles at the edge of a deep crevasse. Far be-\nlow he sees Mortianna, clambering down the steep rock.\nFor a second their eyes meet. She hisses -- venom,\nhatred, fear -- then is gone.\n\nEXT. GREGOR CAVES - DAY\nAslan carries Robin outside. Robin is staggering,\nglassy-eyed, mumbling incoherently. His arm blocks\nthe light from his eyes.\n                       ASLAN\n         They have poisoned you. There\n         are herbs that can alter a man's\n         brain. I know of only one cure.\nHe drops to one knee, slams Robin violently across the\nother. Slaps him on the back and forces his fingers\ndown his throat.\n                                            (CONTINUED)\n\n                                                    93.\nCONTINUED:\n                       ASLAN\n         It worked for me this very\n         morning.\n                (as Robin heaves)\n         You will thank me for this later.\n\nEXT. COUNTRY LANE - DAY\nDistant THUNDER. Three horses. First Wulf's, leading\nanother with the bodies of Bull and Sarah draped across\nits back. Aslan rides the third, with Robin propped up\nin front of him.\n                       ROBIN\n         You have fulfilled your vow.   Now\n         you can leave.\n                       ASLAN\n         Your gratitude warms my heart.\n                       ROBIN\n         You ignored my request.\n                       ASLAN\n         It is fortunate that I did.\n                       ROBIN\n         Because of you, another good man\n         is dead.\n                       ASLAN\n         He urged me to bring him. He was\n         a brave man and I grieve for him.\n         Praise be to Allah that I do not\n         grieve for you also. Or for my\n         broken vow.\n                       ROBIN\n         To hell with your damn vow.\n                       ASLAN\n         I am glad you are feeling\n         better.\nAhead of them, Wulf shouts and reins in. He points into\nthe distance. A huge cloud of smoke is darkening the\nsky.\n                        ROBIN\n         The forest!   Ride!\n\n                                                       94.\nEXT. SHERWOOD FOREST - DAY\nFire.   Blazing rampant.\nAlong a hillside are hundreds of crossbowmen with fire\narrows. At a shouted order, another wave of flaming\narrows ignites the trees.\nBehind the crossbowmen are two figures on horseback.\nOne is the Sheriff, in full armor. The other is the\nblack-clad Celtic chieftain. He sits as still as a rock.\n\nEXT. WOODSMEN'S CAMP - DAY\nChaos. Acrid black smoke pours across the clearing.\nDisarray. COUGHING, SCREAMING, confusion. Little John\nvainly attempts to instill calm.\n                        LITTLE JOHN\n          Ya'll be jus' fine. Lil' smoke\n          ain't gonna kill ya.\nScared and injured woodsmen careen out of the trees.\nFull retreat.\n                        WILL SCARLET\n                 (running up)\n          It's burning for miles, John.\n          It's hotter than hades, and them\n          damn screens ain't worth nothing.\nTwo woodsmen, blinded and choking, stumble into one of\ntheir own camouflaged pits. Hideous screams as they're\nimpaled on hidden stakes. John tries to gather the able-\nbodied men to his side.\n                        LITTLE JOHN\n          'Ere, lads... Over 'ere! We must\n          make a stand.\nMost of them keep on running.\n                        LITTLE JOHN\n          Damn y'all! Ya're no more use\n          than a load o' wet farts.\n                        WILL SCARLET\n          Where's that damn Locksley?   I'll\n          swear he betrayed us.\n                        LITTLE JOHN\n          Bollocks, Will. Quit yer bloody\n          bellyachin'.\nHal runs to join them, stuttering.\n                                            (CONTINUED)\n\n                                                    95.\nCONTINUED:\n                         HAL\n         C... cccc...\n                      LITTLE JOHN\n         C... ccc? What the bloody hell\n         ya sayin'? Cows?... Cowards?...\n                         HAL\n         Cccc... elts!\n                        WILL SCARLET\n         Celts?   Where?\n                       HAL\n                (pointing behind\n                 him)\n         Gggg... God help us.\n\nEXT. HILLSIDE - DAY\nCelts, arrayed behind their Chieftain. An awesome sight.\nClad in hides and skins, painted arms and faces, head-\npieces the faces of wild animals. Standing in eerie\nsilence. A loud CLAP of THUNDER. Nottingham rides up\nto the Chieftain.\n                       NOTTINGHAM\n         I want prisoners.\nThe Chieftain does not turn his head.\n                       CHIEFTAIN\n         We came to fight.\n                       NOTTINGHAM\n         Nevertheless, I need prisoners.\nWith only a short flick of his head, the Chieftain spits.\nNottingham waves his arm, signalling his own foot sol-\ndiers to advance. The Chieftain raises his sword.\nInstantly a tumultuous chilling roar from his warriors.\nThey charge forward.\n\nEXT. SHERWOOD FOREST - DAY\nThe bloodcurdling cry fills the sky. Amidst the smoke\nand chaos, Little John's small band is gathered at the\nedge of the clearing.\n                       WILL SCARLET\n         What are we gonna do, John?\n                                           (CONTINUED)\n\n                                                      96.\nCONTINUED:\n                       LITTLE JOHN\n         Stop 'ere and flippin' well fight\n         'em, that's what. Whadya say,\n         lads?\nHalf-hearted support from about a dozen men, including\nTack.\n                       LITTLE JOHN\n         Nay, reveren'. Ya best be goin'\n         wi' the wenches.\n                       FRIAR\n         This holy man believes in doing\n         God's work with his hands.\n\nHe snatches a quarterstaff.    John slaps him on the back.\nThe men are encouraged.\n                       LITTLE JOHN\n         Let's give 'em a bloody good\n         wallopin' an' all, lads.\n\nEXT. FOREST ROAD - DAY\nAslan reins in. In the valley below, the forest is\nablaze. The Sheriff's armed hordes swarm over the em-\nbattled woodsmen.\n                       ROBIN\n         Wulf, stay here. I need your\n         horse.\nHe climbs onto Wulf's horse, steers it right at the heart\nof the enemy... Aslan blocks his way, grabbing his reins.\n\n                       ROBIN\n         What are you doing?    Out of my\n         way!\n                       ASLAN\n         I saved your life. I will not\n         let you give it away for no\n         purpose.\n                       ROBIN\n         Out of my way, damn you!\n                       ASLAN\n         Does the witch still have\n         possession of your senses? If\n         we meet up with the survivors we\n         may yet give them some help. And\n         do some damage to the enemy.\n                                          (CONTINUED)\n\n                                                      97.\nCONTINUED:\nRobin debates.   Relents.   They urge their horses into\na gallop.\n\nEXT. SHERWOOD FOREST - DAY\nThe Sheriff's men stomp through the burning forest.\nFrom the other side of the flaming trees, Little John's\nmen pick off shots with their longbows. They retreat,\nturn and fire again.\nThey back into a clearing... The Celtic mercenaries\ncharge at them across the open ground. The woodsmen\ndrop their bows. Hand-to-hand combat. Woodsmen are\nbeing decimated.\n\nLittle John storms and shouts, cutting down the enemy,\ninspiring his men. The Scotsmen are awed by this giant.\nTuck is confronted by a wild-eyed Celt.\n                       FRIAR\n         Surely you would not harm a man\n         of the cloth?\nThe man swings, Tuck sidesteps.\n                        FRIAR\n         You would?   Then to hellfire with\n         you.\nHe pummels the man to the ground with his staff.\nThe woodsmen are broken into two groups. One group,\nincluding Will, is surrounded and surrenders. The others\nfight on.\n\nBleeding from several wounds, Little John is surrounded\nby four Celts. He spins, challenging them, spitting out\nexpletives. Defiant to the last... suddenly his\nattackers are hurled aside. Robin rides right through\nthem, slashing with his sword.\n                       LITTLE JOHN\n         'Bout bleedin' time, mush.\nTuck is driven to the ground... his assailant is deliver-\ning the lethal blow, when Aslan cuts him down. Tuck\nglances heavenwards.\n                       FRIAR\n         Thank you, Lord.\n                (an afterthought)\n         And thank you, Allah.\n                                            (CONTINUED)\n\n                                                      98.\nCONTINUED:\nAslan is a   wild man. Steering his horse with just legs\nand knees,   he strikes out with both swords to left and\nright. The    momentum is turning. Wulf appears at the\nedge of the   clearing. Starts picking off stragglers.\nHis father   spots him.\n                       LITTLE JOHN\n         Git the bleedin' 'ell outa there,\n         ya li'l bugger.\nDistracted, he doesn't see a Celt swing at his back...\nbut Wulf's arrow pierces the man's adam's apple. He\nfreezes in mid-air, before toppling at John's feet.\nWhen John turns back, Wulf is being dragged away by\nthree of the Sherrif's men. He attempts to pursue, but\nis intercepted by two more Celts... and struck down.\nAslan charges between the two Celts. Slashes down\nwith both swords. Both men topple to the ground\nsimultaneously.\nSuddenly all is quiet.    The smoking clearing is a mass\nof fallen bodies. Only    four men seem to be alive.\nRobin, Aslan, Tuck, who   is slouched against a tree\ngasping for breath, and   Hal, who kneels clutching his\nwounded shoulder.\nRobin dismounts and runs to Little John. Overwhelmed\nand exhausted, he slumps over the giant's unmoving form.\n                       LITTLE JOHN\n         Don't 'ee start bleedin'\n         blubberin', or ya'll make me\n         bloody vomit.\n\nRobin manages a relieved smile. Aslan strides over.\nAll around them lie slain Celts and woodsmen.\n                       ASLAN\n         It was a fiendish mind that\n         planned this campaign.\n\nEXT. SHERWOOD FOREST - DUSK\nA shovel breaks dirt. Beyond exhaustion, Robin digs a\ngrave. The clearing is transformed into a cemetery.\nTuck blesses the bodies of Bull and Sarah. Aslan drags\na Celt's corpse into a grave. Throws the man's armor\nand weapons into a growing pile.\n                                            (CONTINUED)\n\n                                                       99.\nCONTINUED:\n                       ROBIN\n         You were an honor to your\n         countrymen today, Aslan. You\n         fought better than twenty\n         English knights.\n                       ASLAN\n         This war is the God of Abraham\n         against the forces of evil.\n                       ROBIN\n         Well, the war is over.\nHe stares across the desolate clearing.\n\n                       ROBIN\n         There is too much blood on my\n         hands.\n\nINT. CASTLE DUNGEONS - NIGHT\nA heavy key turns in a lock. Bolts drawn back. Fol-\nlowed by guards, Nottingham enters the torture chamber\nwhere the captured woodsmen are chained, among them\nWulf and Will Scarlet. Putrid ankle-deep water on the\nfloor, walls encrusted with dried blood and grime.\nNottingham walks up to the FIRST MAN. Wry smile.\n                       NOTTINGHAM\n                (wry smile)\n         Would you prefer pain or death?\n                        FIRST WOODSMAN\n         Death.\n\nDignity masking his terror.    Nottingham appears to\nconsider.\n                        NOTTINGHAM\n         Torture him.\nThe man is dragged away by guards.    The next PRISONER --\n                        NOTTINGHAM\n         And you?   Pain or death?\n                       SECOND WOODSMAN (PRISONER)\n                (pure terror)\n         ... Er... pain.\n                       NOTTINGHAM\n         Torture him... you see, it makes\n         no difference.\n                       (MORE)\n                                            (CONTINUED)\n\n                                                     100.\nCONTINUED:\n                       NOTTINGHAM (CONT'D)\n         You will all be tortured. You will\n         all tell me all you know about\n         Robin Hood, and then you will all\n         be hanged. Then we will catch your\n         beloved Robin Hood and do the same\n         to him.\n                       WILL SCARLET\n         I will kill him for you.\n                          WULF\n         Will, no!\nNottingham strides up to Will, drawing his sword.\n\n                       NOTTINGHAM\n         Why would I need you?\n                       WILL SCARLET\n         All your attempts to kill him\n         have failed. Your army failed.\n         Your Celtic mercenaries failed.\nNottingham places his sword point against Will's throat.\n                       NOTTINGHAM\n         And you can succeed?\n                       WILL SCARLET\n         I am one of his men. He would\n         never suspect me.\n                       WULF\n         He knows you always hated him,\n         traitor.\n\n                       WILL SCARLET\n         He is a trusting fool. He will\n         believe me. If he doesn't, he\n         will kill me and you have lost\n         nothing.\nNottingham slides his blade between Will's teeth.\n                       NOTTINGHAM\n         If you fail, I will personally\n         cut out your lying tongue.\nHe withdraws the blade.    Will tries to smile.\n                       WILL SCARLET\n         And if I succeed?\n                                            (CONTINUED)\n\n                                                      101.\nCONTINUED:\n                       NOTTINGHAM\n         His friends will..\n                (to a guard)\n         ... torture him!\nHe turns back to Will.   A smile of mock apology.\n                       NOTTINGHAM\n         It will look better.\n\nEXT. SHERWOOD FOREST - NIGHT\nA winter's night. Bitterly    cold.  Sad figures huddled\naround a small fire. Fanny    tends to John's wounds, their\nlittle ones asleep by their   feet.  John drinks and passes\nthe jug to Tuck, who numbly   shakes his head. Too\ndepressed even to drink.\nAslan folds his prayer rug and walks over to Robin, who\nsits alone, staring vacantly into the darkness.\n                       ROBIN\n         My pride brought us to this.\n                       ASLAN\n         No, friend. It was you who gave\n         these men pride.\n                       ROBIN\n         I gave them nothing but false\n         hope. Tomorrow we will disperse.\n         These people can move south and\n         start over. You must go home and\n         win your Jasmina.\n\n                         ASLAN\n         And you?\n                       ROBIN\n         I am no longer your responsibility.\n                       ASLAN\n         That is for me to decide.\n                       ROBIN\n                (raging)\n         Damn you, Arab. I want you out of\n         my life. Can't you understand\n         that? Go home. Go back to your\n         own kind.\nAslan stares at him, then turns away. Not the time for\nargument. Robin fingers his father's medallion... rips\nit from his neck.\n                                          (CONTINUED)\n\n                                                      102.\nCONTINUED:\n                       ROBIN\n         Damn you, too, Father.   You reared\n         a coward and a fool.\nHe hurls the medallion... it catches on a low-hanging\nbranch.\n                                            CUT TO:\n\nNOVEMBER MOON\nWatery, full. The FOCUS SHIFTS TO the medallion,\ndangling in its center... the last thing Robin sees\nbefore his eyes close into troubled sleep. The white\nmoon against the black sky...\n                                            DISSOLVE TO:\n\nITS NEGATIVE IMAGE\n-- a black circle against a white sky. An executioner.\nThe round medallion has become a noose.\nIn the noose appears Wulf's face. The executioner hauls\non the rope and Wulf's features contort in the agony of\ndeath. Another noose, another face... Duncan. Another\n-- Bull. Another -- Marian.\n                       MARIAN\n         Kiss me, Robin.\nThe noose tightens on her neck. As she dies, her face\nshrivels into the cackling features of Mortianna.\n\nNext, Robin's father.   He stares accusingly right AT us.\n                       LOCKSLEY\n         Why have you betrayed me?   Why?\nBefore he pulls the rope, the executioner peels back his\nhood... It is Robin. Gloating, he hauls on the rope.\nHis laughter blends with that of Mortianna in a hideous\ncacophony.\n                                            DISSOLVE TO:\n\nROBIN'S FACE\nDISTORTED in water. The LAUGHTER BECOMES the sound of\na RUNNING RIVER. Robin is washing, trying to drive away\nthe horror.\n                                            (CONTINUED)\n\n                                                         103.\nCONTINUED:\nThe first streaks of light fight their way through a\nthick, morning mist. Out of the mist steps a figure,\nat first indecipherable. Aware of his presence,\nRobin looks up.\n                         ROBIN\n         Will!    I thought you were taken.\n                         WILL SCARLET\n         I was.\n                       ROBIN\n         How did you escape?\n                       WILL SCARLET\n         I promised to kill you.\n                         ROBIN\n         And will you?\nBefore Will can answer, Little John runs up.     Grabs\nWill's throat.\n                       LITTLE JOHN\n         I'll wring yer scrawny neck, Will\n         Scarlet. I'd be doin' yer a\n         bloody favor an' all.\nQuickly, others arrive. Aslan, Tuck, Hal, Fanny, with\nkids clinging to her skirts.\n                       FANNY\n         Afore ya kill 'im, John, ask 'im\n         if Wulf be still alive.\nWill is choking, unable to speak. John loosens his hold\njust enough for Will to splutter out...\n                         WILL SCARLET\n         Y... e...\n                       LITTLE JOHN\n         Git us a rope, Hal, and we'll put\n         the bleedin' weasel outa 'is\n         misery.\n                         ROBIN\n         John, wait.    Let us hear what he\n         has to say.\n                       LITTLE JOHN\n         No bugger 'scapes the Sheriff,\n         'nless 'e's linin' 'is bloomin'\n         pockets.\n                                              (CONTINUED)\n\n                                                     104.\nCONTINUED:\n                       ROBIN\n         A traitor sneaks in and out under\n         cover of darkness. Will walked in\n         and announced himself.\n                         LITTLE JOHN\n                  (dismissive)\n         Aye.    'E always did 'ave balls o'\n         brass.\n                       HAL\n         Let's sss... string 'im up.\n                       ROBIN\n         Let him speak.\n\nJohn reluctantly moves his hold from Will's neck to his\nshoulders.\n                       LITTLE JOHN\n         Search 'im, Hal. 'E'll 'ave a\n         bloody blade on 'im somewheres.\nWill eyes the accusing faces. Hal searches, lifts Will's\nshirt. His whole skin is lacerated with deep gashes and\nfresh burns.\n                         LITTLE JOHN\n         Bugger me.\nHe steps back.    Ready to listen.\n                       WILL SCARLET\n         I bring a message from Nottingham.\n         Our men are to be hung in the\n         square on Saturday. At high noon.\n\n                       FANNY\n         What about my boy?\n                         WILL SCARLET\n         The boy, too.    Ten men in all.\nFanny drops her head on John's shoulder.\n                         WILL SCARLET\n         Their   deaths are a warning.\n         Anyone   who associates with the\n         outlaw   Hood is to suffer the same\n         fate.    Man, woman, or child. Even\n         anyone   who so much as utters his\n         name.\n                                            (CONTINUED)\n\n                                                       105.\nCONTINUED:\n                       FRIAR\n         Robin Hood! Robin Hood! Robin\n         Hood!\n                (chuckles)\n         May as well be hung for a sheep as\n         a lamb.\n                       WILL SCARLET\n         The hangings are to be part of the\n         celebration for the Sheriff's\n         marriage.\n                       LITTLE JOHN\n         Marriage, eh? What lucky wench\n         gits to play with the Sheriff's\n         codpiece?\nWill turns his gaze directly on Robin.\n                        WILL SCARLET\n         Lady Marian.\n                       FRIAR\n         He takes a bride of royal blood?\n                       LITTLE JOHN\n         Aye, and then with King Richard\n         gone, he takes the bloody throne.\nEveryone reacts with shock.     Only Robin appears unsur-\nprised.\n                       ROBIN\n         You were to use this news to get\n         close to me, and then kill me?\n         Right, Will?\n\n                       WILL SCARLET\n                (sly grin)\n         Not straightway, of course.\n                       ROBIN\n         What is your intention, Will?\n                       WILL SCARLET\n         That depends on you, Locksley.\n                        ROBIN\n         How so?\n                       WILL SCARLET\n         I've never trusted you, that's no\n         secret. What I wanna know is, are\n         you gonna finish what you started?\n                                             (CONTINUED)\n\n                                                       106.\nCONTINUED:\nRobin is on the spot.    All eyes on him.   Will presses his\npoint.\n                       WILL SCARLET\n         Will ya stay and keep us fightin'\n         till every man jack of us is dead?\n         Or will you run like the spoiled\n         little rich boy I always took you\n         for?\n                       ROBIN\n         You present quite a choice.    What\n         would you have me do, Will?\n                       WILL SCARLET\n         If you run, I will kill you.\n                       ROBIN\n         And if I stay, will you all stay\n         with me?\nRobin checks the other faces.\n                       ASLAN\n         To the end, friend.\n                       FRIAR\n         If my heathen brother stays, I\n         stay.\n                       HAL\n         Mmmm... meee... tttt...\nHe can't get it out.    Little John covers Hal's mouth.\n                       LITTLE JOHN\n         'E's in. We're all bloody in.\n         Daft buggers.\n                       ROBIN\n         There's your answer, Will.    We\n         finish it.\n\nEXT. NOTTINGHAM TOWN SQUARE - DUSK\nTen gallows, silhouetted against the setting sun. The\nblack-armored Celt tests a gallows, springing the hatch.\nA heavy sack dangles from the rope. Grim-faced peasants\nwatch. Among  them -- Fanny Little.\n\n                                                        107.\nINT. DUNGEON - DUSK\nThe sound of the gallows ECHOES inside the damp, stone\nwalls. Wulf and the other woodsmen are chained to rings\nin the floor. Wulf lifts his eyes to a chink of light\nhigh in the wall. The purple sky is turning black. He\nfingers his wooden crucifix.\n                         WULF\n           If it be your biddin' that this be\n           my last night o' life, Lord, gimme\n           the pluck to die proud. An' look\n           'ee kindly on my folks an' the\n           young 'uns.\nThe light in the cell melts to total darkness.\n\n                                             DISSOLVE TO:\n\nBRANCHES\nSunlight glistens on frost-laden branches.      A COCK ROBIN\nCHIRPS.\n\nEXT. SHERWOOD FOREST - DAWN\nIn the troubled human realm, Tuck says his morning\nprayer.\n                         FRIAR\n           Lord, grant us the courage to\n           endure, and if you're as smart as\n           I believe you are, grant us\n           victory... and the victuals to\n           celebrate it with.\n\nAslan is crushing charcoal into a mixture of yellow\npowder, which is turning black. Tuck approaches.\n                         FRIAR\n           Will you pray with me, son of\n           Allah?\n                         ASLAN\n           I have prayed for you, often, my\n           brother. But, let us put prayer\n           aside and help our gods in a more\n           practical manner. I must reveal\n           to you the mysteries of the black\n           powder.\nTuck takes a bowl of the powder close to the fire to\nexamine it. Aslan snatches it back... Before Tuck can\nreact, Robin walks up.\n                                             (CONTINUED)\n\n                                                    108.\nCONTINUED:\n                         ROBIN\n         Will it work?\nAslan throws a handful of powder into the firel A fire-\nball rips ten feet in the air... Tuck falls on his ass\nin terror.\n                       ROBIN\n                (impressed)\n         You are truly a wizard.\n                       ASLAN\n         There is no such thing. But if\n         there was...\n                (chuckles)\n         ... I would surely be one.\nRobin reaches out and shakes Aslan's hand. A moment of\nbonding. He moves on to the others, clasping each man's\nhand as he speaks.\n                       ROBIN\n         We have no armored knights, no\n         glorious banners. But I am\n         honored to be going to battle in\n         this company. Today we fight not\n         just for the lives of our friends,\n         but to save all England.\nA moment of tension before Will takes the proferred hand.\n                       ROBIN\n         We may be only six men, but...\n                         FANNY\n         Seven!\n\nShe strides towards them from the trees.\n                       LITTLE JOHN\n         What in blazes ya doin', woman?\n         Where's the little 'uns?\n                       FANNY\n         Them's safe, wi' my mother.\n                (pushes past Little\n                 John)\n         Robin, I been to town an' seen the\n         scaffold and the guard towers.\n                       LITTLE JOHN\n         Ya gone bleedin' cracked, girl?\n                                           (CONTINUED)\n\n                                                      109.\nCONTINUED:\n                       FANNY\n         You go an' birth eight babies and\n         then you can come an' tell me\n         'bout hurtin', ya big ox. I ain't\n         gonna sit aroun' an' let one o'\n         'em die, neither.\n                       LITTLE JOHN\n         Ya should be bloody well mindin'\n         the other seven. Tell 'er, Rob.\nRobin starts to draw a diagram on the ground with a\nstick.\n                       ROBIN\n         Fanny, show me the exact location\n         of the scaffold.\nLittle John double-takes.\n\nEXT. NOTTINGHAM - DAY\nThe gallows. Swathed in a pink glow. A brilliant,\nwintry morning. Breath billows from the mouths of the\nsentries.\n\nINT. NOTTINGHAM CASTLE - CORRIDOR - DAY\nBoots clack confidently down a stone corridor. The\nSheriff decked in wedding finery. He enters...\n\nINT. CASTLE CHAMBER - DAY\n\n... Mortianna's apothecary. Dark, smoke-filled. Foul\nthings in jars. Animals in cages, waiting to meet\nunspeakable ends. Marian is strapped in a chair, flanked\nby two armed guards.\n                       NOTTINGHAM\n         How is my bride?\nMarian smiles as he leans toward her... and spits in his\nface.\n                       NOTTINGHAM\n         Ah... You are overwhelmed with\n         happiness.\nHe slowly wipes off the spittle... and slaps her hard.\n                                            (CONTINUED)\n\n                                                     110.\nCONTINUED:\n                       MARIAN\n                (calm, uncowed)\n         I will never marry you.\nMortianna emerges from a dark corner, bearing the goblet\nshe used at the Druid ceremony.\n                       MORTIANNA\n         Hold her!\nMarian struggles against her bonds.\n                       MARIAN\n         Get away from me, you disgusting\n         hag. I will not... augh!\n\nThe guards viciously restrain her, forcing her mouth\nopen. Mortianna pours the blood-red liquid down her\nthroat. Marian fights, gagging and choking... until the\ndrug takes its effect. She slumps forward. Nottingham\nwatches with amusement.\n                       NOTTINGHAM\n                (to Mortianna)\n         When we are married, thirty of the\n         northern barons will pledge me\n         their support as king. As you\n         predicted.\nMortianna squats on the floor besides a platter of blood.\nClasps the dice-like runes.\n                       NOTTINGHAM\n         What do you see in the portents?\nMortianna rocks on her heels, clutching her taloned hands\nto her sides. She chants, fingering the bloody stones.\n                       MORTIANNA\n         The union. The blood of the lion\n         and the house of Nottingham. New\n         faith. New power. New souls.\nShe stares at Nottingham, her red eyes demented.\n                       MORTIANNA\n         If there is no union, there will\n         be darkness, despair, death.\n         Ours!\n                       NOTTINGHAM\n         Di not give me riddles, woman. We\n         are to be married within hours.\n         How can we be in danger?\n                                            (CONTINUED)\n\n                                                     111.\nCONTINUED:\n                       MORTIANNA\n         The blood does not lie.\n                       NOTTINGHAM\n                (shouting)\n         Tell me how it will result.\n                       MORTIANNA\n         I have told you what I know.\n                       NOTTINGHAM\n         Confound you, crone. Without my\n         protection, the people would hunt\n         you down, rip out your black heart\n         and burn it.\n\nMortianna runs at him.   Points her bony finger at his\nheart.\n                       MORTIANNA\n         Without me, you are nothing. You\n         are straw, a fleabite, a speck.\n                (as Nottingham\n                 laughs)\n         Laugh, fool. I birthed you from\n         this body. I stole a babe in this\n         very castle, and killed it so that\n         you might rise in its place. You\n         are my son.\n                (Nottingham is\n                 too shocked to\n                 react)\n         Together we are strong. Now is\n         not the time to doubt. Now is the\n         time to believe, to be bold. The\n         bold will prevail.\n\n\nEXT. CITY GATE - DAY\nMasses stream in. They give wide berth to a Celtic war-\nrior in a boar's head helmet. Soldiers prod and harness\nthe passing peasants. Tuck drives a cartload of barrels.\nA GUARD stops him.\n                       GUARD\n         What you got there, Father?\n                       FRIAR\n         The Lord's finest brew for the\n         good Nottingham's fighting men.\n         It has a mighty kick.\n                                           (CONTINUED)\n\n                                                      112.\nCONTINUED:\n                       GUARD\n                (smiling)\n         I'll warrant. Pass.\n\nEXT. DUNGEON GATE - DAY\nWulf blinks at the sunlight as the prisoners are led out.\nHolds his head high. Soldiers hurl abuse, the people are\ntoo cowed to show support. Fanny glances at her son,\ncrosses herself and scurries into the castle, unnoticed.\nOn horseback, encircled by guards, the Sheriff and his\nbaron cronies watch the outlaws progress with cruel\namusement. A  yell attracts Nottingham. Will is being\nshoved back by guards.\n                      WILL SCARLET\n         Sheriff! My Lord Sheriff! I have\n         word for you! Of Robin Hood!\nNottingham shouts to one of his mounted guards, who rides\nover, grabs Will by the collar, and drags him to his\nside.\n                       NOTTINGHAM\n         Ah, the turncoat. Did you succeed?\n                       WILL SCARLET\n         I found his lair, but alas he still\n         lives.\nThe Sheriff strikes down with his armored hand.    Will\ncrumples.\n                       NOTTINGHAM\n         Stretch his neck with the others.\nHands yank Will to his feet. Dazed, he tries to speak.\nDisinterested, Nottingham turns away, until he catches...\n                       WILL SCARLET\n         ...He... He... is here!\n                       NOTTINGHAM\n         Locksley, here? Where ?\nWill struggles to get free of his holders.\n                       WILL SCARLET\n         Call off your dogs.\n                       NOTTINGHAM\n         Release him!... Now, where is he?\n                                             (CONTINUED)\n\n                                                       113.\nCONTINUED:\n                       WILL SCARLET\n         I want your word, in front of\n         these witnesses. If I tell you,\n         I will go free.\n                       NOTTINGHAM\n                (scoffs)\n         We will find him.\n                       WILL SCARLET\n         He is concealed. He is going to\n         free the prisoners and stop the\n         wedding.\nNottingham's jaw tightens.   Eyes the prisoners, the\nscaffold.\n                       NOTTINGHAM\n         Put Hood in my hands, you go free.\n                       WILL SCARLET\n         With the reward. Ten thousand\n         crowns.\n                       NOTTINGHAM\n         Damn your worthless hide!    Just\n         tell me where he is.\n                       WILL SCARLET\n         The reward!\nThe parade of prisoners reaches them. Seeing Will, Wulf\ncharges at him, screaming in blind rage. Soldiers grab\nWulf. Throw him down, kicking and beating. Voices in\nthe crowd plead to let him be. Someone tries to\nintervene, gets hurled down.\n\n                       NOTTINGHAM\n                (to Will)\n         You'll get your reward. Where\n         is he?\n                                             CUT TO:\n\nEXT. SCAFFOLD\nTuck urges his ancient nag towards the scaffold with his\ncargo of barrels. The crowd parts unwillingly.\n                       FRIAR\n         Out of the way. Make way for\n         the Lord's business.\n                                             (CONTINUED)\n\n                                                      114.\nCONTINUED:\nAcross the square, Will points urgently in Tuck's\ndirection.\n\nEXT. CITY WALL - DAY\nA massive oak stands near the southern wall. A large\nfigure climbs to its uppermost branches. Little John.\nHe scrambles from the tree, starts to climb the wall\nitself. He slips frequently.\n\nEXT. CITY SQUARE - DAY\nThe prisoners are led to the scaffold, where the hooded\nexecutioner waits, along with the Chieftain. Wulf\nstaggers, from his beating.\nNottingham's men encircle Tuck's cart.    He watches them\nnervously.\n\nEXT. CITY PARAPET - DAY\nFanny lowers a knotted rope over the battlement. Far\nbelow, John clings to the outer wall. Above him it's\nsheer, without footholds. The rope doesn't reach his\nfingertips. He stretches, loses balance. Falls...\ndesperately grabbing at the rope. He swings, clinging\nby one arm, his body smashing into the wall.\n\nEXT. CITY SQUARE - DAY\nWill leads the Sheriff to Tuck's cart.\n\n                       NOTTINGHAM\n         Step down, friar.\n                       FRIAR\n         As you wish, sire. Is there\n         something amiss?\n                       NOTTINGHAM\n         This man claims you have outlaws\n         concealed in these barrels. Among\n         them the cursed Robin Hood.\nTuck glares at Will with unconcealed hatred.\n                       FRIAR\n         This man will rot in hell as a\n         knave and a liar. These are\n         libations for the celebration\n         of your lordship's nuptials.\n                                            (CONTINUED)\n\n                                                      115.\nCONTINUED:\n                       NOTTINGHAM\n         Break one open!\n                       FRIAR\n                (nervous)\n         Why waste fine vintage, my lord?\nA cask is shattered... wine torrents out.\n                       WILL SCARLET\n         Try another. There are many\n         barrels, only a few outlaws.\nA drum roll. The Sheriff's attention turns to the\nscaffold, where the first victim is escorted up the\nsteps -- Wulf.\nTense, Tuck pulls a tinder box from his robes, strikes\na flame.\n\nEXT. CITY PARAPET - DAY\nJohn strains, heaving his giant frame up the rope. He\nnears the top, just as a SENTRY approaches. Fanny blocks\nthe man's view.\n                       SENTRY\n         What is your business, woman?\n                       FANNY\n         Ain't doin' no 'arm, m'dear.\n         Likes a good 'angin', I do. Luvly\n         view up 'ere, ain't it?\nShe gestures below. The Sentry looks, then turns back to\nher... notices the rope. With all her might, Fanny rams\nhis head into the stone battlement. Twice. Three times.\nHe slumps unconscious.\n\nEXT. CITY SQUARE - DAY\nWulf crosses himself as the executioner steers him to the\nnoose. A hush falls... except for a rotund old woman who\nis barging to the front. And a WOUNDED SOLDIER, his head\nbandaged, who eases her path, striking out with his tree-\nbranch crutch.\n                       WOUNDED SOLDIER\n         Give room for a fightin' man and\n         his ma. Step aside, or I'll make\n         ya. I wanna see the bastards walk\n         on air.\n\n                                                       116.\nEXT. CITY PARAPET - DAY\nJohn struggles over the battlement.   Collapses.\n                       FANNY\n         'Bout time, ya gurt lug.\nShe wrenches the longbow from his back, fumbles for an\narrow.\n                       FANNY\n         We be too late.\n\nEXT. CITY SQUARE - DAY\nThe scaffold is impregnable. Celts and their Chieftain\nguard the platform itself. The Sherriff's men surround\nthe base.\nThe executioner encircles Wulf's neck with the noose.\nSPARKS! Tuck ignites a fuse-cord leading to one of the\nbarrels.\nA hand tightens the noose... Another grasps an arrow.\nThe executioner's eyes glint through the slits.\nNottingham intently watches Wulf.\nThe Chieftain stands, impassive.\nFingers close on a bowstring... the fuse-cord burns.\nWulf steps to the trap, ready to plunge.   His eyes close.\nAn arrow flies... slices through the executioner's eye\nslit.\nThe executioner falls. Little John celebrates... but\nthe Chieftain leaps forward... releases the trap.\nWulf's body plunges.   The rope snaps tight.\nLittle John yells.   Fanny screams.\nA figure leaps onto the platform... the wounded soldier\nthrows aside his crutch... Robin!\nWulf dangles, strangling.   His hands wrench at the\nchoking cord.\n                                           (CONTINUED)\n\n                                                      117.\nCONTINUED:\nThe burning fuse-cord reaches the barrel. Tuck hurls the\nsmoking barrel thundering towards the Sheriff... Spotting\nit, Nottingham urges his horse over his own men in his\neffort to escape.\nThe Chieftain smites at Robin... his blow is blocked...\nby the Celt with the boar's head.\nKAABOOM! The GUNPOWDER in the barrel EXPLODES. Spewing\nsmoke and wood. SCREAMS of panic. Soldiers fly. Mass\nconfusion.\nAmidst the smoke... Robin's sword slashes through Wulf's\nrope. He hauls him onto the platform.\n\nAnother figure on the platform... the old woman. Slashes\nthe ropes of the other prisoners. Whips off her wig...\nIt's Hal. He passes out weapons from a bundle under his\narm.\n                       HAL\n         Here... By God... Let's fight 'em!\n                      WOODSMAN\n         Hal! What happened to your\n         stutter?\n                       HAL\n         It's gg... ggg... g..oh crap!\nA guard attacks, Hal fells him.\n                       HAL\n         Take that, ya mug.\nNo stutter this time!    The woodsmen join battle with the\nguards.\nThe Chieftain cudgels his Celt attacker across the head.\nThe boar's head helmet tumbles... revealing Aslan.\n                        CHIEFTAIN\n         Impostor!   You dishonor the clan.\nAslan retreats, fending off the Chieftain's shattering\nblows.\n\nFROM PARAPET\nJohn and Fanny peer down as the smoke clears. They watch\nWulf struggle to his feet. A Celt sneaks up behind him.\n                         LITTLE JOHN\n         Fight fair...\n                                            (CONTINUED)\n\n                                                        118.\nCONTINUED:\nHe aims.   Grits his teeth... picks off the Celt with a\nshaft.\n                         LITTLE JOHN\n           ...Or don't fight at all.\n\nON SCENE\nRobin leaps and swings from gallows to gallows, kicking\nout, slashing down. Sends two Celts hurtling down the\ntrap hole.\nWill battles the Sheriff. A reprise of his own fight\nwith Robin, the roles reversed. The Sheriff, armed and\nmounted, flails at Will, who, unarmed, dodges in and\naround the horse's legs.\nAslan and the Chieftain are locked in mortal combat.\nAslan stumbles back and falls. The Chieftain swipes at\nhis head. Aslan rolls aside. The sword smashes wood.\nTuck surrounded, rolls another smoking BARREL... It\nEXPLODES.\nThe Greybeard Baron spots Little John and Fanny on the\nparapet.\n                          GREYBEARD BARON\n           Up there!   No mercy, shoot them!\nCrossbowmen on the opposite parapet fire.      Bolts ricochet\nall around Little John and Fanny.\n\nON SCAFFOLD\n\nWulf guards the steps, beating back all comers.\n\nON SCENE\nAslan evades the charging Chieftain. Drop-kicks a\nsoldier, takes his sword, and whirls back at the\nChieftain. His blows have no effect on the Scot's black\narmor.\nThe Sheriff rears his horse... hooves flail.. knocking\nWill to his knees. The Sheriff lunges... Desperate, Will\ngrasps the sword, ignoring the pain... a tug of war.\nBlood pours from Will's hands, where the blade cuts in.\nHe suddenly lets go... Nottingham topples from his\nhorse. Will leaps on him.\n                                               (CONTINUED)\n\n                                                       119.\nCONTINUED:\n                       WILL SCARLET\n         Pain or death, you butcher?\nThe Sheriff's men drag Will off before he can choke him.\nRaging, Nottingham climbs to his feet. Will is held by\nfour men.\n                       NOTTINGHAM\n         Here's another message to Robin\n         Hood, written in your blood.\nHe drives his sword repeatedly, insanely, into Will's\nbelly.\n                       WILL SCARLET\n         It's over, fool. You can kill my\n         body, but you cannot kill our\n         spirit.\nHe finally drops... Nottingham heads for the castle.\nRobin attempts to follow. He swings from the noose,\nusing the rope to vault over the surrounding soldiers.\nAs he lands, he is waylaid by one of the barons and his\nmen.\n                        REDHEAD BARON\n         It's Hood!   Get him!\nThe Chieftain knocks Aslan down.   Aslan loses his sword.\n                        CHIEFTAIN\n         I am iron.   I am rock. I am your\n         death.\nAslan spots one of John's arrows protruding from a dead\nCelt's back. Scrambles over and tears it out.\n                       ASLAN\n         You talk too much!\nHe leaps... rams the arrow through the Chieftain's\nmouthpiece... out the back of his neck. The Chieftain\ngrabs his helmet, trying to rip it off. He topples,\nhis life's blood gushing from both sides of his neck.\nAslan plants a foot on the slain warrior.\n                       ASLAN\n         Englishmen! I am not one of you,\n         yet I fight for you. Against a\n         tyrant. Join me now. Join Robin\n         Hood.\nThe onlookers are inspired. Grabbing weapons from fallen\nsoldiers, many join the fray.\n                                          (CONTINUED)\n\n                                                      120.\nCONTINUED:\nNottingham runs through the castle gate.   Angry peasants\npursue.\n                       NOTTINGHAM\n         Lower the portcullis! Now!\nA guard winds down the giant gate.   Nottingham hurls him\naside.\n                       NOTTINGHAM\n         Too slow, fool!\nHe hacks at the ropes. The gate slices down like a\nguillotine, pinning soldiers and peasants alike.\n\nFighting his way towards the gate, Robin sees   with dismay\nthat the portcullis is closed. Weakening, he    staves off\nthe redhead baron's vicious assault. Suddenly    peasants\nare swarming over his attacker. The baron is    dragged off\nand trampled down.\n                        ROBIN\n         Friends!   We must raise the gate.\n\nEXT. CASTLE PARAPET - DAY\nCrossbow bolts fly. Little John ducks and weaves, while\nspinning and firing at the men advancing at him from both\nsides.\n                       LITTLE JOHN\n         Come on, ya ckicken-'earted buggers.\n         Ya milksops, ya bleedin' pansies.\nHe can't shoot fast enough. As they descend on him, he\nleaps from the battlements onto a soldier's back. Grabs\nhis sword.\n                       LITTLE JOHN\n         Excuse me, m 'old cock. Ya mind\n         if I borrow this?\nHe's backed up against a battlement, outnumbered five to\none.\n\nEXT. CASTLE GATE - DAY\nRobin and the others try in vain to lift the portcullis.\nINT. CASTLE - MAIN CORRIDOR - DAY\nThe Sheriff marches through, issuing orders.\n                                           (CONTINUED)\n\n                                                        121.\nCONTINUED:\n                       NOTTINGHAM\n         Seal the entrance. Guard it with\n         your lives. ... Bring the bishop\n         to my chapel.\n\nINT. CASTLE CHAMBER - DAY\nSurrounded by flickering candles, Marian sits before a\nmirror. In a white wedding gown. Her eyes faraway,\nlifeless, in deep trance. Mortianna sensuously combs\nthe bride's hair with her taloned fingers. The\nSheriff's face appears in the reflection.\n                        NOTTINGHAM\n         Come!   It is time for the union.\nThe guards roughly haul Marian to her feet.    She is\noblivious.\n\nINT. CASTLE CHAPEL - DAY\nOnce, Christian, now blasphemously transformed   to the\npractice of black magic. The crucifix on the    altar is\nupside down. Marian stands before it, between    the\nSheriff and Mortianna. The Bishop is dragged    in.\nFrightened. The BATTLE SOUNDS ECHO.\n                       BISHOP\n         They are rebelling. We must\n         escape.\n                       NOTTINGHAM\n         Marry us. When I am declared king,\n         that rabble will not dare go against\n         us.\n                       BISHOP\n         Is is madness to delay.\nMortianna screams and slashes her talons across the\nBishop's outstretched hands. Blood flows.\n                       MORTIANNA\n         Face them, or face me.\n\nEXT. CASTLE GATE - DAY\nRobin leaps onto Tuck's cart.\n                       ROBIN\n         Light all the barrels, Tuck.\n                                             (CONTINUED)\n\n                                                    122.\nCONTINUED:\nRobin snaps the reins, steering the rumbling cart across\nthe yard. Bouncing in the back, Tuck lights barrels.\nFUSES smoke and CRACKLE.\n                       ROBIN\n         Jump!\nTuck jumps. Robin steers the wagon at the gate. At the\nlast second, he slashes the reins and leaps onto the\nhorse's back... The BARRELS EXPLODE! The portcullis is\nblown to kingdom come.\nOut of the smoke, Robin rides the old nag like a charger.\nLeads his cheering, ragged fighters through the open gate.\n\n\nINT. CASTLE KITCHENS - DAY\nFanny is chased into the kitchens by a vengeful soldier.\nHe grabs her and pushes her into the open cooking fire.\nDesperate, she grabs a poker and smashes him over the\nhead. The servants stare in shock... A chef comes at\nFanny with a knife.\n\nEXT. CASTLE FORECOURT - DAY\nHal and the others battle against huge odds. More\npeasants join them, daring to take on the Sheriff's hated\nmen. Aslan's a whirlwind,  striking out in all\ndirections. Each blow for  a cause.\n                       ASLAN\n         For Allah!... For Jehovah!\n         For brotherhood!... For\n         justice!\n\n\nINT. CASTLE HALLWAYS - DAY\nA door SLAMS back. Robin bursts through. Alone, against\nthree attackers. He swings a soldier around. Holds him\nas a shield, using the man's own sword against his\ncompanions. In seconds, all three are down and Robin is\noff and running.\nDown corridors, searching. Soldiers and armed servants\nconverge to block his way. Robin strikes, vaults, flings\nstatues. Up the stairs... topples a suit of armor down\non his pursuers.\n                       ROBIN\n                (grabbing a servant)\n         Where is she? Where is Lady\n         Marian?\n                                          (CONTINUED)\n\n                                                    123.\nCONTINUED:\nThe man refuses to speak. Robin looks up the corridor,\nsees six men guarding the private chapel's arched door-\nway.\n                        ROBIN\n         Ah!   There is my answer.\nHe hurls the man aside... The armed guards charge him.\n\nINT. DUNGEONS - DAY\nCarrying a flaming torch, Tuck runs down the dark passage-\nways. Before him, an awesome sight... dozens of pitiful\nmen in cages. Suddenly he is confronted by the jailer.\nA cruel behemoth of a man, carrying a spiked club.\n                       FRIAR\n                (pious)\n         My son, there is a holy war being\n         waged outside. Release all these\n         wretches and God shall surely find\n         you a place in heaven.\n                       JAILER\n         I'd rather go to hell!\nWHAM! Tuck takes the lethal cudgel full in the chest.\nFlies back.\n\nINT. CASTLE CHAPEL - DAY\nSweating, fearful, the Bishop rushes through the service.\n                       BISHOP\n         ...your bodies to be bound in\n         immortal wedlock. Do you, Marian\n         Dubois, take...\nThe chapel DOORS SHATTER inward.\nRobin backs in, bloodied, fencing with four remaining\nsoldiers. He smashes one by swinging the heavy door into\nhim, hurtles a pew at another. He springs off another\npew, taking down a third.\n                        ROBIN\n         Marian, run!   It's me, Robin.\n         Run!\nMarian remains immobile. Mortianna moves to her side.\nRobin is struck in the thigh. Like a vulture, the\nSheriff waits. Tiring, blood pouring from his leg, Robin\nprepares to fight him.\n                                          (CONTINUED)\n\n                                                         124.\nCONTINUED:\n                       ROBIN\n         I warned you, I would find you no\n         matter what.\n                       NOTTINGHAM\n         No companions? No army? You rush\n         to your death for the sake of a\n         woman. Lust has turned you into a\n         fool... Recognize this, Locksley?\nHe raises his sword to reveal its handle. A crucifix\nsculpted into the hilt... Robin's father's sword.\n                       NOTTINGHAM\n         Appropriate I should use it to\n         kill you with, don't you think?\nHe lunges. A savage, accomplished swordsman, with fire\nin his eyes. Exhausted, Robin is driven back, parrying\ndesperately.\n\nINT. DUNGEONS - DAY\nTuck picks himself up from the floor.    The jailer is\namazed.\n                       FRIAR\n         The Lord helps those who help\n         themselves.\nGrinning, he pulls open his robes, revealing chest armor\n... and a miniature powder keg. He holds it to his\nflaming torch and tosses it to the jailer... Stupified,\nthe man catches the smoking bomb.\n\n                       FRIAR\n         Give my regards to the devil.\nThe KEG ERUPTS, blowing the jailer through a wall.\n\nEXT. PARAPET - DAY\nJohn is in deep trouble, but undaunted.\n                       LITTLE JOHN\n         Ya gutless bloody sissies.\nSomeone attacks his assailants from the rear.    The tide\nturns.\n                      LITTLE JOHN\n         Wulf! I told ya to keep outa the\n         fightin'.\n                                         (CONTINUED)\n\n                                                      125.\nCONTINUED:\n                       WULF\n         Sorry, Father. Couldn't help\n         myself.\n                       LITTLE JOHN\n         Well, ya'll get a bloody good\n         wallopin' if we get 'ome... For\n         now, let's see how well I taught\n         ya.\nWulf sends an attacker plummeting off the parapet.\n\nEXT. CASTLE FORECOURT - DAY\n\nA crossbow bolt strikes Hal between his shoulder blades.\nHe falls. The Sheriff's soldiers are regaining the\nadvantage. The peasants are giving up, dropping their\nweapons.\n                        HAL\n         No!   Fight on. Fight!\nHe sees a familiar pair of holy sandals marching towards\nhim. Tuck leading a barefoot army. Dozens of ragged\nprisoners, armed with chains and torture implements.\n                       FRIAR\n         Sinners, beware! God's avengers\n         are at hand.\nDying, Hal manages a weak smile.\n                       HAL\n         Go' bless ya, Tuck.\n\nTuck flails a chain at a Celt.\n                       FRIAR\n         Repent, heathen!\nThe man spins to strike back... freezes... grinning...\nAslan!\n\nINT. CASTLE - KITCHENS - DAY\nThe chef raises his knife.    Fanny appeals to the whole\nroom.\n                       FANNY\n         Listen! Outside, your countrymen\n         rise against the Sheriff.\n                       (MORE)\n                                         (CONTINUED)\n\n                                                      126.\nCONTINUED:\n                       FANNY (CONT'D)\n         Is there one man or woman here\n         who does not hate him? Who has\n         not suffered at his hand?\n                (to the chef)\n         Turn that on the Sheriff and his\n         bullies.\nA deadly pause. A woman cook dumps the giant wedding\ncake right over the chef. Suddenly it's havoc. Flying\nfood and cutlery.\n\nEXT. CITY SQUARE - DAY\n\nA full-scale riot. The populace has turned. Into the\nfray comes Fanny Little, leading a rabble of servants\nand kitchen staff, fighting with pots, pans, brooms,\nknives, hooks, and bedpans.\n\nINT. CASTLE - CHAPEL - DAY\nNottingham slashes maniacally.   Robin is cornered,\nweakening.\n                       NOTTINGHAM\n         You should have stayed away,\n         Locksley. Fools like you never\n         learn.\nA blow slices Robin's arm. His sword flies from his\ngrasp. Nottingham gloats. Two of his men scramble back\nto their feet. Robin is beat... a war cry! Aslan,\nfollowed by Tuck.\n\n                         ASLAN\n         Ali akbar!\n                         FRIAR\n         Amen!\n                       MORTIANNA\n                (seeing Aslan)\n         Agh... the painted one!\nNottingham glances over... a split-second opportunity!...\nRobin lashes out. Kicks the Sheriff in the gut, chops\ndown his sword hand. His father's sword clatters to the\nfloor.\nWhirling swords in each hand, Aslan attacks the other\nmen. Robin pile-drives Nottingham into the wall.\n                                            (CONTINUED)\n\n                                                        127.\nCONTINUED:\nThe Bishop makes his escape.    Tuck blocks his path.\n                      FRIAR\n         So! You sold your soul to the\n         devil?\n                       BISHOP\n         No, I swear it, in God's name.\n                       FRIAR\n         Blasphemer! You accuse innocent\n         men of Druid worship while you\n         practice the black arts yourself.\nThe Bishop surreptitiously draws a dagger from his robes.\n\nA taloned hand grips a spear... Mortianna creeps up on\nAslan.\n                       ROBIN\n                (glimpsing her)\n         Watch out!\nAslan spins... too late. Screeching, Mortianna drives\nthe spear into Aslan's side. He cries out and slides to\nthe floor.\nNottingham uses Robin's distraction to regain his sword.\nBack on the defensive, Robin tries to evade the blows.\nMortianna drags Marian out onto a balcony. Robin cannot\npursue. In acute pain, Aslan struggles to his feet.\nGrasping the spear where it enters his side, he pulls with\nall his strength.\nThe Bishop, concealed dagger in hand, approaches Tuck.\n\n                       BISHOP\n                (innocently)\n         I am sure you would not strike a\n         man of the cloth.\n                        FRIAR\n         Think again!\nWithout an eyeblink's pause, Tuck punches the Bishop so\nhard, he flies back THROUGH a stained-glass WINDOW.\n\nEXT. CASTLE - BALCONY - DAY\nMortianna hauls Marian against the battlements. Peers\ndown at the battle. She spins in shock at Aslan's voice.\n                                            (CONTINUED)\n\n                                                     128.\nCONTINUED:\n                          ASLAN\n            What you fear is not below.\nHe charges at her with the bloody spear. She screams\nhideously as he thrusts it right through her chest.\nHer madness is superhuman. With strength beyond all\nreason, she crawls up the spear's shaft, forcing it\nfurther through her body in her effort to get at him.\nClutching, screeching, hissing.\nHer talons groping at his face, Aslan strains to the\nlast ounce of his will and heaves her over the battle-\nments. With an ear-splitting shriek, she plummets to\nthe ground.\n\n\nINT. CASTLE CHAPEL - DAY\nSword raised, Nottingham has Robin backed against the\naltar.\n                          NOTTINGHAM\n            What can your puny God do for\n            you now?\nThe blade comes whirring down... clang! It's blocked.\nRobin has the altar's crucifix in his hand.\nHe swings it again, slamming Nottingham across the\ntemple.  The Sheriff hits the floor. Robin grabs his\nfather's sword. Raises it two-fisted. Nottingham tries\nto squirm away.\n                          ROBIN\n            This is for my father.\n\nHe drives the sword down, like a stake, right through\nNottingham's heart. The man shudders, and is still.\nRobin stands over him. Drained. Tuck rushes outside.\nKneels at Aslan's side. Robin spots Marian swaying on\nthe edge of the steep parapet.\n\nEXT. CASTLE BALCONY - DAY\nRobin grabs Marian, pulling her back. Carefully lifts\nher face. Her lifeless eyes suddenly flash. She lashes\nout. A spitfire.\n                           MARIAN\n            Let me go!   Who are you?\n                                            (CONTINUED)\n\n                                                    129.\nCONTINUED:\n                       ROBIN\n                (restraining her)\n         I'm your sworn protector.   Any\n         way I see fit.\n\nEXT. CITY SQUARE - DAY\nRobin emerges from the castle. Draped over his shoulder,\nMarian is kicking and beating at him. He reaches the\nfountain in the center of the square and tosses her into\nthe freezing water.\nShe leaps to her feet, yelling. Slips and tumbles back.\nWater streams from her bridal gown. A crowd gathers,\nenjoying the show.\n                        MARIAN\n         Robin?   Oh God, is that you?\nShe stumbles out of the fountain... and storms at him,\npounding her fists on his chest.\n                       MARIAN\n         How dare you?!\nRobin grins at the crowd.\n                       ROBIN\n         I think she's feeling better.\nMarian looks about her... the chaotic aftermath of\nbattle. Reality gradually sinks in. She folds against\nRobin's chest.\nLittle John arrives, his huge arms enfolding Wulf and\nFanny.\n                       LITTLE JOHN\n         We done it, mate. We clobbered\n         the buggers.\n                         FANNY\n         Are you 'urt?\n                         ROBIN\n         It will mend.\nHe spots a group kneeling beside the fallen body of\nAslan. His smile fades. He runs over. Cradles Aslan's\nhead.\n                       ROBIN\n         Aslan, my friend.\n                                           (CONTINUED)\n\n                                                     130.\nCONTINUED:\n                       ASLAN\n         I'm going home the easy way,\n         Robin.\n                       FRIAR\n                (shaking Aslan)\n         You die on me, you son of satan,\n         and I swear I'll bury you as a\n         Christian in St. Catherine's\n         Cathedral with a thousand monks\n         chanting prayers for your\n         miserable soul. You hear me?\n                       ASLAN\n                (weakly)\n         I have no strength, Brother Tuck.\n                       FRIAR\n                (kicking him)\n         A fine friend you are! By the\n         grace of Allah and Jehovah we\n         have won the day, and you want to\n         give up the ghost. I'll pickle\n         your remains in mead, lay you\n         in your grave with a pig for a\n         companion, and mark it with a\n         cross as big as this castle.\n                        ASLAN\n         Please!   It hurts when I laugh.\n                      FRIAR\n         See. There's life in the heathen\n         dog yet.\n                       ROBIN\n                (laughs)\n         Here, Tuck. Look after him.    You\n         deserve each other.\nRobin stands, Marian joins him. Around them cheering\ngrows, till the whole crowd is in unison.\n                        CROWD\n         Robin Hood!   Robin Hood!\n                                            DISSOLVE TO:\n\nINT. CATHEDRAL - DAY\nA VOICE ECHOES from the vaulted roof.   A wedding is in\nprogress.\n                                            (CONTINUED)\n\n                                                        131.\nCONTINUED:\n                       FRIAR (O.S.)\n         By the power vested in me by\n         God's holy church, I now\n         pronounce you husband and wife.\nTuck is performing the ceremony before the happy couple.\n                       FRIAR\n         You may kiss the bride.\nThe husband draws back the bride's veil.    Robin and\nMarian. They kiss... long.\n                      FRIAR\n               (whispers)\n         Hurry. We waste good celebration\n         time.\nThey break   the embrace, turn to the congregation and\nstart down   the aisle. They pause at the front pew,\nwhere KING   RICHARD and members of his court are sitting.\nRobin bows,   Marian curtsies.\n                       KING RICHARD\n         May I kiss the bride?\n                       ROBIN\n         Who would dare refuse his king's\n         request?\n                       KING RICHARD\n                (kissing Marian's\n                 cheek)\n         You look radiant, cousin.\n                       ROBIN\n         We are deeply honored by Your\n         Majesty's presence.\n                       KING RICHARD\n         It is I who am honored, Lord\n         Locksley. Thanks to you I still\n         have a throne.\nThey continue down the aisle, past the smiling congre-\ngation. Waiting by the door is Aslan. He and Robin\nembrace.\n                       ASLAN\n                (whispers)\n         My friend, a word of advice...\n         Ride her better than your horse.\nRobin laughs.\n\n                                                      132.\nEXT. NOTTINGHAM CATHEDRAL - DAY\nWEDDING BELLS PEAL. Robin and Marian step out into the\nsunlight. The crowd cheers. At a signal from Little\nJohn, the ex-outlaws shoot flaming arrows into the sky...\nFIREWORKS...\n\n                                          FADE OUT.\n\n\n\n\n                        THE END\n\n\n\n\n\nRobin Hood: Prince of Thieves\nWriters :   Pen Densham  John Watson\nGenres :   Action  Adventure  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:33:57.137967"}