{"title": "Ronin", "film_link": "/Movie Scripts/Ronin Script.html", "script_link": "/scripts/Ronin.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Ronin Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Ronin Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/6-stars.gif\"/> (6.22 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=J.D. Zeik\" title=\"Scripts by J.D. Zeik\">J.D. Zeik</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Script Date</b> : May 1997<br/>\n<br/>\n<a href=\"/scripts/Ronin.html\">Read \"Ronin\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n\t<title>\"Ronin\", early, by J.D. Zeik</title>\n\n\n\n   <pre>\n\n\n\n\n\n\n\n\n\n\n<b>                                RONIN \n</b>\n                      an original screenplay by\n\n                              J.D. Zeik\n\n\n\n\n\n\n                                             DRAFT: May 20, 1997\n\n\n\n\n\n\n\n     A BLOOD RED SCREEN - A JAPANESE DRUM starts to play, softly,\n     but tinged with a desperate edge, growing louder, joined by\n     other DRUMS as a BLACK LEGEND scrolls up: In feudal Japan,\n     the warrior class of Samurai were sworn to protect their\n     liege lords with their lives.  Those Samurai whose liege was\n     killed suffered a great shame, and they were forced to wander\n     the land, looking for work as hired swords or bandits.  These\n     masterless warriors were no longer referred to as Samurai,\n     they were known by another name: Such men were called Ronin.\n     The words hang on the screen and we hold for a BEAT, and then\n     the DRUMS are cut off by - A SILENCED GUN SHOT: Thwpfft...\n\n<b>     FADE IN ON:\n</b>\n<b>     INT. A MEDIEVAL CATHEDRAL - NIGHT\n</b>\n     It's dark, and so it takes us a minute to realize we're\n     MOVING UP STONE SPIRALING STAIRS, up up up in what we now see\n     is a medieval cathedral.  And as we continue MOVING UP\n     something TRICKLES DOWN INTO FRAME - BLOOD.  Running thin,\n     then thicker, as we CONTINUE TO MOVE UP the stairs and find -\n     A BODY, sprawled awkwardly across the stones, arms and legs\n     akimbo, not so much Christ-like as victim-like.  In one hand\n     the Body holds a GUN he never had a chance to use.  In the\n     other - A DARK SHAPE, we can't quite tell what it is.\n     FOOTSTEPS sound from above and - THE KILLER walks into frame,\n     silenced pistol dangling at his side.  We don't know him, and\n     it's going to be a while before we see him again, but mark\n     his face because we'll see him again.  The Killer now picks\n     up the dark shape in the Body's hand, and we see it's - A\n     BRIEFCASE.  The Killer cuffs the Briefcase to his wrist and\n     turns to - TWO MEN standing behind him: subordinates.  The\n     Killer shows them the Briefcase.\n\n<b>                          KILLER\n</b>               God loves me.\n\n     THE BODY suddenly twitches -- this guy is not quite dead.\n     The Killer raises his silenced pistol.\n\n<b>                          KILLER\n</b>                   (to his victim)\n               But I don't think he's too fond of you...\n\n<b>     SLAM CUT TO:\n</b>\n<b>     EXT. A BACK STREET - PARIS - NIGHT\n</b>\n     A PHONE RINGS, replacing the sound of the silenced gun shot\n     we expected to hear.\n\n     Rain-slicked cobblestones gleam in a twinkling of\n     streetlight.\n\n<b>     EXT. A PHONE BOOTH AT THE END OF THE STREET\n</b>\n     The source of the ringing.  We start to PUSH SLOWLY IN one the\n     phone booth, and as we do we hear the VOICE of an UGLY\n<b>     AMERICAN.\n</b>\n<b>                          UGLY AMERICAN (V.O.)\n</b>               What is this?\n\n<b>     CUT TO:\n</b>\n<b>     INT. A DRIVE BAR IN PARIS - NIGHT\n</b>\n     A SOCCER MATCH is in progress on a TV which sits above the\n     bar in this smokey, dim dive.\n\n<b>                          UGLY AMERICAN (O.S.)\n</b>               This is not football...\n\n     And now we're PULLING BACK DOWN THE LENGTH OF THE BAR.  We\n     see THREE MEN sitting seperately at the bar, paying no\n     attention to each other.  One of these men watches the game\n     with real interest.  The Ugly American talks on from off\n     screen.\n\n<b>                          UGLY AMERICAN (O.S.)\n</b>                   (continuing)\n               ...Football is three hundred pound guys,\n               they run way too fucking fast, they got\n               helmets made of kevlar they use to spear\n               the quarterback into the next life.\n\n<b>     SLAM CUT TO:\n</b>\n<b>     EXT. THE STREET OUTSIDE\n</b>\n     The phone is still ringing, louder now, and we're MOVING\n     TOWARDS it while looking THROUGH AN UNSEEN PAIR OF EYES, and\n     even as we drink this in we're back in -\n\n<b>     INT. THE BAR\n</b>\n     AT THE END OF THE BAR - LARRY, the Ugly American.  He's got\n     an obvious attitude, all of it bad.  But there's something\n     about the guy -- he's not all bluster, and he has the look of\n     a seasoned tough guy who knows how to get rough and tumble.\n     He's big, and yeah he's got a gut, but the rest of him looks\n     solid.\n\n<b>                          LARRY\n</b>                   (talking to the air)\n               You wanna know what football is?  It's\n               hitting the other guy dirty and then\n               spitting in his face when he's down.\n               Football is all things American, and\n               American is A-Number-One the absolute\n               fucking best there is.  That's what\n               football is...\n                   (he points to the TV)\n               ...And that's not football.\n\n     The one man at the bar who's been watching the gam turns\n     slowly and gives Larry a long look.  This is VINCENT: French,\n     hard boiled and solid.  Charming when he wants to be, which\n     isn't all that often.  He gives Larry a long look and then\n     speaks -\n\n<b>                          VINCENT\n</b>                   (to Larry in perfect English)\n               Football -- American football -- is a\n               game for faggots.\n\n     A BEAT.  The other two men at the bar, who seem like tough\n     customers themselves, pretend not to watch too closely, but\n     they're interested: what's Larry going to say?  For a moment\n     it seems as if he's pissed, but then suddenly a smile breaks\n     out on his face and he laughs heartily at Vincent's remark.\n     Vincent joins in, as do the others.  In particular - THE\n     BARTENDER looks relieved -- he's tough enough to toss a bar\n     drunk, but these guys are in a different league.  The\n     Bartender laughs with the others, happy to have avoided a\n     confrontation as we go back to -\n\n<b>     EXT. THE STREET OUTSIDE\n</b>\n     We're almost ON TOP OF the phone booth, the phone is still\n     ringing as a HAND reaches INTO FRAME and snatches the phone\n     from its cradle.\n\n<b>                          A WOMAN'S VOICE (V.O.)\n</b>                   (a touch Irish accent)\n               Yes?\n\n     ANOTHER ANGLE - And we see a woman named DEIRDRE on the\n     phone: striking, dark-haired, Irish.  She carries herself\n     with the same professional edge as the men inside the bar.\n     Deirdre listens for a moment to the voice on the other end,\n     and before she speaks she sense something - A SILHOUETTE\n     stands in the shadows of the bar, watching Deirdre.  She\n     gives this silhouette a measure glance before speaking, her\n     hand creeping ever so slightly towards her coat.\n\n<b>                          DEIRDRE\n</b>               Can I help you?\n\n     The silhouette steps into a POOL OF LIGHT.  This is SAM.\n     Tough, lean, enigmatic.  Somebody you might trust, but whom\n     you'd never cross.  Sam returns her look before he speaks.\n\n<b>                          SAM\n</b>               No...\n\n     Sam moves towards the bar, and Deirdre returns to her phone\n     conversation.\n\n<b>                          DEIRDRE\n</b>               I'm here...\n                   (a beat, responding to a\n                    question)\n               No, it was nothing.\n\n<b>     INT. THE BAR - A MINUTE LATER\n</b>\n     Sam enters and by now the men inside have all come together\n     at the bar, talking casually, recognizing they're somehow all\n     here for a reason.  With Larry and Vincent we see - GREGOR, a\n     man from Eastern Europe.  His accent is hard to pin down,\n     but he most definitely has one.  Gregor has the air of an ex-\n     spook, and that's exactly what he is.  Lastly we see SWEDE --\n     blonde, muscular, and somehow blank in the face.  No, he's\n     not stupid -- he's a sociopath.  Now - Sam looks at the\n     group, which grows quiet as he enters.  Finally, Sam speaks.\n\n<b>                          SAM\n</b>               Sorry I'm late...\n\n<b>                          VINCENT\n</b>                   (a challenge)\n               What makes you think we're here to meet\n               you?\n\n<b>                          SAM\n</b>                   (meeting Vincent's gaze)\n               Who else would you be?\n\n     Vincent turns towards the others, including them in an\n     expansive gesture.\n\n<b>                          VINCENT\n</b>               Perhaps the police?\n\n<b>                          SAM\n</b>               I know cops -- and you're no cop.\n\n     Vincent smiles at Sam's answer, satisfied, and makes room for\n     Sam to join them.  Vincent takes a pack of cigarettes, shakes\n     them so that one sticks out, and offers it to Sam.\n\n<b>                          VINCENT\n</b>               Cigarette?\n\n<b>                          SAM\n</b>               No thanks.\n\n     Vincent looks a little disappointed at this as we go -\n\n<b>     EXT. BACK OUTSIDE - SAME TIME\n</b>\n     THE PAY PHONE makes a sharp noise as it's cracked back into\n     the cradle.  Deirdre stands at the phone booth, lost in\n     thought.  Then, without warning - Deirdre spins around,\n     pulling TWO GUNS from inside her coat.  The move is fast,\n     performed with the grace of a professional killer, as Deridre\n     scans the horizon, but nobody seems to be watching.  Deirdre\n     pockets her guns and steps into the shadows of the street,\n     the better to watch -\n\n     THE BAR - And as Deirdre watches the bar we watch her.\n     PULLING BACK from Deirdre, UP INTO THE AIR and then MOVING\n<b>     THROUGH TO -\n</b>\n<b>     INT. A CHEAP APARTMENT - SAME TIME\n</b>\n     LOOKING THROUGH A WINDOW, donw onto the street below.  Barely\n     visible we can see Deirdre.  And staring at Deirdre - THE\n     WATCHER.  Somebody we're going to see periodically through\n     the movie.  Right now he's only a SILHOUETTE with a well-\n     defined PAIR OF HANDS.  And in those hands - A KNIFE.  As the\n     Watcher watches he slowly cleans his nail with the knife,\n     methodically, perfectly.  And he watches.  First Deirdre, and\n     then turning his attention to THE BAR.  He's especially\n     interested in the bar.\n\n<b>     A TIME CUT TO:\n</b>\n<b>     INT. THE BAR - LATER\n</b>\n     The BARTENDER is wiping out a last glass.  When this is\n     finished he looks up at -\n\n<b>     A TABLE IN THE BACK -\n</b>\n     Where our five guys have relocated.  Now the Bartender and\n     Vincent exchange a look, and then the Bartender takes out a\n     set of keys and tosses them - THROUGH THE AIR and they SMWACK\n     into Vincent's hand.  The Bartender and Vincent speak in\n     rapid-fire French, and then the Bartender is gone.  Sam turns\n     to Vincent.\n\n<b>                          SAM\n</b>               He trusts you to lock up?\n\n<b>                          VINCENT\n</b>               Let's just say he knows who I am.\n\n     Vincent takes out his pack of cigarettes and offer them\n     around the table -- again, nobody takes on.  Vincent seems\n     really disappointed by this.\n\n<b>                          LARRY\n</b>               Anybody wanna tell me what we're waiting\n               for?\n\n<b>                          VINCENT\n</b>                   (lighting his cigarette)\n               The question isn't what we're waiting\n               for... it's who.\n\n<b>                          LARRY\n</b>               And who the fuck is that?\n\n<b>                          GREGOR\n</b>               Whoever hired us.\n\n<b>                          SAM\n</b>               I got this gig through a contractor.\n               And he most definitely didn't know who\n               was doing the hiring, only that they\n               were paying a lot of money...\n\n     There's a kind of general look around the table -- a nod or\n     grunt of acknowledgement, indicating that all of these men\n     were hired the same way.\n\n<b>                          SAM\n</b>                   (continuing his thought)\n               So none of us knows who's paying the\n               freight, this is just some anonymous job.\n               For all we know, we're working for\n               different people.\n\n<b>                          GREGOR\n</b>               Now that is an interesting proposition.\n\n<b>                          SWEDE\n</b>               How so?\n\n<b>                          GREGOR\n</b>               Because if there's more than one party\n               involved, if we really are working for\n               different people, then perhaps some of us\n               are on different sides.\n                   (with great meaning)\n               Your orders might be different from mine.\n\n<b>                          LARRY\n</b>               What're you talking about, man?  I don't\n               understand.\n\n<b>                          SWEDE\n</b>                   (quietly, but loud enough to be\n                    heard)\n               What a surprise...\n\n<b>                          LARRY\n</b>               I got a surprise for you, blondie...\n\n<b>                          GREGOR\n</b>                   (sharply, as if he's used to\n                    giving orders)\n               Why don't both of you shut up?\n\n<b>                          LARRY &amp; SWEDE\n</b>                   (to Gregor at the same time)\n               Fuck you!\n\n<b>                          SAM\n</b>               Knock it off!\n\n     There is a BEAT.  Gregor, Swede and Larry look at Sam, who\n     glares them all down.  Lastly, Sam turns and looks at\n     Vincent.  The two men nod at one another, acknowledging a\n     kind of mutual respect.\n\n<b>                          SAM\n</b>               The point remains: we could be working\n               for different people.  There's a chance\n               for one of us...\n                   (looks around the table)\n               Maybe more than one of us -- has been\n               paid to cross the others.  I don't know\n               about you guys, but I like to know who\n               I'm working for.  It can help prevent a\n               great deal of...\n                   (finding the right word)\n               ...unpleasantness.\n\n<b>                          LARRY\n</b>                   (patting the gun inside his\n                    cheap suit)\n               Anybody tries to unpleasant me I'll put\n               two between his eyes -- one to do the job\n               and the other to make sure it takes.\n\n     From OFF SCREEN we hear a new sound: LAUGHTER.  ANOTHER ANGLE -\n\n     Deirdre has entered the bar, and she's amused by this last\n     exchange.\n\n<b>                          DEIRDRE\n</b>               It's good to see you've all got such\n               faith in our little undertaking.\n\n<b>                          LARRY\n</b>               Who the fuck are you?\n\n<b>                          DEIRDRE\n</b>                   (staring at Larry)\n               The name is Deirdre, and I'm running this\n               show.\n\n<b>                          GREGOR\n</b>               Who are you?  IRA?\n\n<b>                          DEIRDRE\n</b>                   (with a brittle laugh)\n               Not likely.  Once, yeah, I was -- but\n               there wasn't an inch of profit in it, and\n               I'm a cash oriented girl, if you take my\n               meaning.  I'm a hired gun, same as the\n               rest of you, and that's all any of us\n               needs to know about the other.\n\n     Deirdre hands out several thick envelopes.  Larry and Swede\n     open theirs and stare at the wads of Franc Notes stuffed\n     inside.  Even Gregor cracks his envelope and peaks at his\n     money.  But neither Vincent nor Sam takes a look.\n\n<b>                          DEIRDRE\n</b>               From here on in you want something you\n               pay cash for it: no credit cards, no bank\n               accounts are in place: ten percent up\n               front, the rest when the job is done.\n                   (a quick beat, then she looks\n                    at Gregor)\n               You.  What do you do and what should we\n               call you?\n\n<b>                          GREGOR\n</b>               These days they they call me Gregor -- and\n               I'm a tech.  I do electronic work,\n               surveillance, computer runs.\n\n     Deirdre turns to Sam.\n\n<b>                          SAM\n</b>               Sam.  I'm a weapons guy.\n\n<b>                          DEIRDRE\n</b>               You were a soldier, were you?\n\n<b>                          SAM\n</b>               Once.\n\n     Deirdre gives Sam a look -- and he returns it.  Finally,\n     Deirdre turns to Larry.\n\n<b>                          LARRY\n</b>               I drive -- and my name is Larry.  Larry\n               from the States.\n\n<b>                          DEIRDRE\n</b>                   (she turns to Vincent)\n               And who are you?\n\n<b>                          VINCENT\n</b>               I'm Vincent.  And I coordinate.\n\n<b>                          SAM\n</b>                   (sharply)\n               Coordinate what?\n\n<b>                          VINCENT\n</b>               Things.  This is my country, you know.\n\n     The two men exchange another look.  A pecking order is\n     developing among the group: Vincent and Sam are both natural\n     leaders, and now they're feeling one another out.\n\n<b>                          DEIRDRE\n</b>                   (to Vincent)\n               Coordinate all you want, but make sure\n               whatever you do gets cleared through me.\n                   (Vincent doesn't respond for a\n                    moment)\n               Are we in sync on this, Vincent?\n\n<b>                          VINCENT\n</b>               Of course.\n\n     Deirdre waits a BEAT, letting Vincent know what she isn't any\n     more intimidated by him than he is by her.  Finally, she\n     turns to Swede.\n\n<b>                          SWEDE\n</b>               They call me Swede.\n\n<b>                          LARRY\n</b>               Who's they?\n\n<b>                          SWEDE\n</b>               Everybody.\n\n<b>                          VINCENT\n</b>               And what is it you do?\n\n<b>                          SWEDE\n</b>               Me?\n                   (with a smile)\n               I kill.\n\n<b>     CUT TO:\n</b>\n<b>     INT. A WAREHOUSE - DAY\n</b>\n     A PAPER TARGET, in the shape of a human being, dances in\n     place as it is riddles with GUNSHOTS, each shot hitting the\n     target in the belly, each shot fired by - Larry, whose been\n     shooting a sleek automatic pistol from which he's just\n     discharged an entire clip.  The gun is empty, Larry turns to\n     Sam, who stands next in line.\n\n<b>                          SAM\n</b>                   (looking at the target)\n               You shoot alright.\n\n<b>                          LARRY\n</b>               Gets the job done.\n\n<b>                          SAM\n</b>               All in the stomach, though.  Your man\n               might live.\n\n<b>                          LARRY\n</b>               Not for long.\n\n<b>                          SAM\n</b>               Long enough to shoot back.\n\n<b>                          LARRY\n</b>               Is that right?\n\n<b>                          SAM\n</b>               It's been known to happen.\n\n<b>                          LARRY\n</b>                   (a challenge)\n               Why don't you go do better, then...\n\n     Without a word, Sam pops a new clip into the gun and SHOOTS\n     THE LIGHTS out of several other human targets, hitting each\n     target in a different place.  One he clips between the eyes,\n     the next in the heart, one in the groin, and then the last\n     target - He SPLITS DOWN THE MIDDLE, firing shot after shot\n     from the head to the groin until the target is sheared in\n     half.  Larry is impressed in spite of himself.\n\n<b>                          LARRY\n</b>               Yeah, well...  My way works too.\n\n<b>                          SAM\n</b>               My way is better.\n\n<b>     IN A CORNER OF THE WAREHOUSE -\n</b>\n     Gregor has set up a table loaded with computers and\n     electronic whizmos.  Right now Gregor is holding a\n     particularly high-tech type CELL PHONE in his hands, looking\n     at it almost lovingly.\n\n<b>                          DEIRDRE (O.S.)\n</b>               Is it alright?\n\n     ANOTHER ANGLE - Deirdre sits nearby, looking at the cell\n     phone.\n\n<b>                          GREGOR\n</b>               It's quite satifactory.\n\n<b>                          DEIRDRE\n</b>               Good, because it cost enough.  There's\n               cheaper phones by far than that one, man:\n               you better fucking use it.\n\n<b>                          GREGOR\n</b>                   (almost caressing the phone)\n               I intend to.  This phone is wired like no\n               other: it's got an encryption chip and\n               instant sat-a-link recognition, it can\n               talk to any computer in any language and\n               make it understand.  With my custom\n               hardware and this phone I can trace the\n               target's cell phone signature and follow\n               him anywhere he goes...\n\n<b>                          DEIRDRE\n</b>               You sure about this?\n\n<b>                          GREGOR\n</b>               I'd stake my reputation.\n\n<b>                          DEIRDRE\n</b>               But would you stake your life, that's the\n               question...\n\n<b>                          GREGOR\n</b>               In this business, your life and your\n               reputation are more often than not one\n               and the same.\n\n     From off screen we hear MUNCHING.  It's - Larry inhaling a\n     sandwich.  A malicious look comes over Swede's face, who's\n     cleaning a pistol and sitting near Larry.\n\n<b>                          SWEDE\n</b>               You should watch what you eat.\n\n<b>                          LARRY\n</b>               Who the fuck died and appointed you food\n               czar?\n\n<b>                          SWEDE\n</b>               I'm just worried about your health,\n               Larry.  You could stand to shed a few\n               pounds.\n\n<b>                          LARRY\n</b>                   (sensitive about his weight)\n               And you could stand to get a little\n               smarter, ain't that right you dumb blonde\n               fuck?\n\n<b>                          SWEDE\n</b>                   (sensitive about the dumb\n                    blonde thing)\n               Who you calling dumb, dickless?\n\n     Both men eyeball one another, and then suddenly Larry reaches\n     for his piece, and as soon as he does this Swede does the\n     same thing, but before they can do anything - DEIRDRE'S GUN\n     swings INTO FRAME, smashing Swede in the face and dropping\n     him to the floor.  Larry's mouth drops open in surprise, but\n     it's too late: Deirdre kicks him in the stomach and then\n     rabbit punches him in the back of the neck, driving him to\n     the ground.\n\n<b>                          DEIRDRE\n</b>                   (standing above them)\n               Next one of you fuckers plays this game\n               I'm going to do for you myself.  I won't\n               say it again: we don't have time for this\n               shit!  There's a clock running on this\n               job, gentlemen, and I mean to be on\n               schedule.\n\n     A TENSE MOMENT as Deirdre stares down at these tough guys --\n     letting them know who's in charge.  A SOUND from OFF SCREEN\n     interrupts this moment: a DOOR opening, as we see - Vincent,\n     who stands in the door, wearing his coat and hat.\n\n     He's been out somewhere, and he looks first at the squabbling\n     men, and then at - Deirdre.  She gives Vincent a little nod --\n     a silent command that makes Vincent turn to Sam.\n\n<b>                          VINCENT\n</b>               Let's go for a ride.\n\n     Vincent and Sam start off, moving towards the door, while Swede\n     and larry slowly pick themselves up off the ground.\n\n<b>                          SAM\n</b>               Where to?\n\n<b>                          VINCENT\n</b>               To see a man about a thing.\n\n<b>                          SAM\n</b>               I can do that.\n\n<b>     EXT. THE WAREHOUSE - SUNSET\n</b>\n     A DESOLATE URBAN LANDSCAPE - Sam and Vincent walking away\n     from the warehouse, which is housed in what looks to be the\n     toughest neighborhood in the city, filled with CHEAP CONCRETE\n     PUBLIC HOUSING and INDUSTRIAL BUILDINGS.\n\n     THE SETTING SUN throws a red glow on the street, giving the\n     raw concrete buildings a blood-colored tint, as Sam and\n     Vincent approach a FIAT, a car neither too old nor too new.\n     Before they can reach the car, the two men are intercepted by\n     FOUR TOUGHS, young guys in their early twenties.  The LEADER\n     of the Toughs apporaches Vincent.\n\n<b>                          LEADER\n</b>                   (subtitled French)\n               Who gave you permission to park here?\n\n<b>                          SAM\n</b>                   (to Vincent)\n               What's he saying?\n\n<b>                          VINCENT\n</b>               Pretty much what you'd expect.\n\n<b>                          SAM\n</b>                   (with a sigh)\n               That's what I thought.\n\n<b>                          LEADER\n</b>                   (in French)\n               There's a charge for parking on our\n               block.\n\n     The other Toughs add lib a few tough guy remarks (in French,\n     of course).\n\n<b>                          VINCENT\n</b>                   (to Sam)\n               He says this is their block.\n\n<b>                          SAM\n</b>               As in, they own it?\n\n<b>                          VINCENT\n</b>               Something like that...\n\n<b>                          SAM\n</b>               And I suppose he's saying that we oughta\n               give them something for using it, huh?\n\n<b>                          VINCENT\n</b>               I didn't know that you spoke French.\n\n<b>                          SAM\n</b>               I don't.  But the language he's speaking\n               is universal.\n\n     ANGLE ON THE LEADER - Who's smirking at Vincent and Sam.\n     Sam's words make a great deal of sense: the Leader is\n     speaking the universal language of \"give me some money or\n     I'll kick your ass.\"\n\n<b>                          SAM (O.S.)\n</b>               I guess we oughta give them something...\n\n     CUT BACK TO: Vincent and Sam.\n\n<b>                          VINCENT\n</b>               If you think we should.\n\n     Vincent backfists the Leader in the nose -- hitting him so\n     hard that the Leader skitters back on unsteady feet and then\n     sits down on his ass.  This blow hurt, but the real damage is\n     to the Leader's pride.  Now - One of the Toughs rushes at\n     Sam, only to have Sam perform what looks like a jujitsu throw\n     which savagely jerks the Tough off his feet and flattens him.\n\n<b>                          SAM\n</b>                   (as if it were an accident)\n               Oh man, I am sorry about that...\n                   (he sticks his hand out)\n               Let me give you a hand.\n\n     Sam reaches down as if to help the Tough, who ignores the\n     hand and totters to his feet.  As soon as he's up he turns\n     and runs away, followed by the other Toughs.  Now only the\n     leader is left behind.  He looks for a second at Vincent and\n     Sam, and then turns and runs after his friends.  Vincent\n     calls after him in French, but whatever he says isn't\n     translated.  Vincent turns to unlock the car.\n\n<b>                          SAM\n</b>               What'd you say to him?\n\n<b>                          VINCENT\n</b>               I asked if we could give him anything\n               else.\n\n     By now the two men are in the car, which starts up and drives\n     off, as it does we -\n\n<b>     CUT TO:\n</b>\n<b>     INT. THE FIAT - SAME TIME\n</b>\n<b>                          VINCENT\n</b>               That was a nice move you did on our young\n               friend.  Judo?\n\n<b>                          SAM\n</b>               Jujitsu.\n\n<b>                          VINCENT\n</b>               Same thing, isn't it?\n\n<b>                          SAM\n</b>               Not at all.  Similar, but not the same.\n\n<b>                          VINCENT\n</b>               What's the difference?\n\n<b>                          SAM\n</b>               One's a lot more painful than the other.\n\n     Vincent laughs, and Sam looks out the window at the city of\n     Paris as we MOVE THROUGH to the outside world of -\n\n<b>     EXT. PARIS DRIVING MONTAGE - TWILIGHT\n</b>\n     A SERIES OF QUICK CUTS of the car driving through Paris at\n     night.  We don't see familiar sights like the Eiffel Tower or\n     the Arc de Triomph, but instead - We travel through the LEFT\n     BANK, down a series of Mazy Alleys which twist and turn,\n     filled with bistros, bars and falafel joints.  NEON SIGNS\n     line the streets for as far as the eye can see.  Near the end\n     of this trip we hear the SOUND OF A MATCH FLARING, followed\n     by -\n\n<b>                          SAM (V.O.)\n</b>               Could I get one of those?\n\n<b>     INT. THE CAR - STILL DRIVING - SAME TIME\n</b>\n     Vincent is driving and smoking a cigarette.  He tosses his\n     pack to Sam, but he seems a little surprised at Sam's\n     request.\n\n<b>                          VINCENT\n</b>               Help yourself.\n                   (quick beat)\n               Since when do you smoke?\n\n<b>                          SAM\n</b>                   (lighting up)\n               I have, I don't know, maybe a cigarette a\n               week.\n\n<b>                          VINCENT\n</b>               A cigarette?  As in one?\n                   (exasperated, almost to\n                    himself)\n               One cigarette a week, who smokes like\n               that?\n\n<b>                          SAM\n</b>               I do.\n\n<b>                          VINCENT\n</b>               Christ, I smoke a pack-and-a-half a day,\n               and I tell myself I could be worse.\n                   (takes a satisfying drag)\n               It's just so damned pleasurable.\n\n<b>                          SAM\n</b>                   (blowing a smoke ring with\n                    great skill)\n               It has it's moments.\n                   (stubs out cigarette)\n               Course, you get cancer and die, that's\n               the down side.\n\n<b>                          VINCENT\n</b>                   (with a sigh)\n               There is that.\n\n     Vincent stamps his cigarette out, looking vaguely unhappy\n     that Sam has spoiled his smoke.\n\n<b>                          SAM\n</b>               So, Vincent: why bring me along for the\n               ride?  Job like this calls for a warm\n               body, somebody who can stand around and\n               look threatening.  A tough guy.\n\n<b>                          VINCENT\n</b>               Like Larry or Swede.\n\n<b>                          SAM\n</b>               Exactly.  Why not bring them?\n\n<b>                          VINCENT\n</b>               Let's just say I thought the\n               conversational possibilities were\n               limited.  Of course, I might have brought\n               Gregor, but he didn't seem like the right\n               candidate -- for this.\n\n<b>                          SAM\n</b>               Watch that one, he's an ex-spook for\n               sure, maybe Stasi, maybe KGB.  He's\n               smart, Gregor is.\n\n<b>                          VINCENT\n</b>               So is the woman.\n\n<b>                          SAM\n</b>               Deirdre?  Smart, yeah, and seriously\n               goddamned dangerous.\n\n<b>                          VINCENT\n</b>               I wonder if she truly left the IRA.\n\n<b>                          SAM\n</b>               I've wondered that myself.  None of this\n               answers my question, though...\n                   (suddenly direct)\n               Why bring me?\n\n<b>                          VINCENT\n</b>               I wanted to see who you were.\n\n<b>                          SAM\n</b>               Who am I?\n\n     Vincent, driving all the while, gives Sam a sideways glance\n     before speaking.\n\n<b>                          VINCENT\n</b>               You were once some kind of special\n               forces.  Airborne Ranger, maybe a Navy\n               SEAL.  After that you rode shotgun for\n               the CIA in some place like El Salvador or\n               Afghanistan, a real mercenary.\n                   (beat)\n               Only now -- now you're like the rest of\n               us, it's a very competitive market since\n               the end of the cold war.  There's a lot\n               of hired guns out here, and not nearly\n               enough work to go around.\n\n<b>                          SAM\n</b>               That's right: there's not hardly enough\n               work these days, nothing that pays the\n               big money, anyhow.  Then along comes this\n               job, paying so much goddamned money I\n               couldn't afford not to take it.  Somebody's\n               paying through the nose for this.\n\n<b>                          VINCENT\n</b>               They certainly are.  Whatever it is we're\n               going to steal, it must be quite\n               something.\n\n<b>                          SAM\n</b>               Whatever it is it must be goddamned\n               priceless.\n\n     And on that thought we -\n\n<b>     CUT TO:\n</b>\n<b>     EXT. A SIDE STREET - NIGHT\n</b>\n     The Fiat pulls up to the curb and Vincent and Sam get out.\n     Vincent leads Sam around a corner and they come to -\n\n     AN EXQUISITE PARK, a small, perfectly manicured place -- a\n     kind of mini-Luxembourg Gardens in the middle of nowhere.\n     When Sam sees the park, he draws an involuntary breath.\n\n<b>                          VINCENT\n</b>               Lovely, isn't it?\n\n<b>                          SAM\n</b>               They'd have to keep something like this\n               under lock and key in New York, and it\n               would still get fucked up.\n\n     The two men enter the park, which is, indeed, open to the\n     public.  Inside, sitting on a bench in the back, almost\n     invisible from the street, we see - FRANCOIS, a stubble-faced\n     tough with a stained shirt and bad teeth.  Vincent and Sam\n     draw near.  This next conversation between Francois and\n     Vincent is in FRENCH WITH ENGLISH SUBTITLES.\n\n<b>                          FRANCOIS\n</b>               That's good right where you are, Vincent.\n\n     Vincent signals for Sam to stop.  Both Vincent and Sam are\n     still several feet away from Francois.\n\n<b>                          VINCENT\n</b>               Do you have it?\n\n<b>                          FRANCOIS\n</b>               Not so fast.\n                   (nods slightly to Sam)\n               Who's that?\n\n<b>                          VINCENT\n</b>               He's company.\n\n<b>                          FRANCOIS\n</b>                   (as if he recognizes Sam)\n               Bad company...\n\n<b>                          VINCENT\n</b>               What do you mean?\n\n<b>                          FRANCOIS\n</b>               He's a cop, Vincent, he's French and he's\n               a cop and you better shoot him in the\n               fucking head right now!\n\n     Sam hasn't said a word -- he doesn't seem to understand\n     what's been said, but he has noted the urgency with which\n     Francois spoke.  Now - We HOLD FOR A BEAT.  Neither Vincent\n     nor Francois pulls out a piece to shoot Sam.  Instead they\n     wait to see if Sam will respond in any way to what Francois\n     said.  The conversation now switches to ENGLISH, which (it\n     turns out) Francois speaks fairly well.\n\n<b>                          SAM\n</b>                   (to Vincent)\n               What's going on?\n\n<b>                          VINCENT\n</b>               I just wanted to see something.\n\n<b>                          SAM\n</b>                   (that edge creeping into his\n                    voice)\n               See what?\n\n     Vincent isn't going to answer, but the overbearing Francois\n     chimes in.\n\n<b>                          FRANCOIS\n</b>               He wanted to see how you reacted when I\n               said that you were a cop.\n\n<b>                          SAM\n</b>                   (he can't believe this)\n               You told him I was a cop?\n\n<b>                          FRANCOIS\n</b>               He asked me to say it.\n\n<b>                          SAM\n</b>                   (looking at Vincent, truly\n                    pissed)\n               He asked you to?\n\n<b>                          VINCENT\n</b>               I needed to know.\n\n<b>                          SAM\n</b>               You need to know a lot of shit, Vincent.\n\n<b>                          FRANCOIS\n</b>                   (to Vincent, in subtitled\n                    French)\n               Are you ready?\n\n     Francois's French words give Sam pause -- he's wondering\n     what's being said, as - Vincent moves towards Francois,\n     leaving Sam several steps away.  The conversation is again in\n<b>     SUBTITLED FRENCH.\n</b>\n<b>                          VINCENT\n</b>                   (taking out an envelope)\n               Here's yours.\n\n<b>                          FRANCOIS\n</b>               There's been a slight problem.\n\n<b>                          VINCENT\n</b>                   (immediately tensing)\n               What's that?\n\n     Francois gives the slightest of nods, indicating that Vincent\n     should look towards a place perhaps thirty yards away -\n     A COPSE OF TREES, where we see a SNIPER pointed a telescopic\n     rifle at Vincent.\n\n<b>                          FRANCOIS\n</b>                   (still in subtitled French)\n               If you say a word in English, Vincent, my\n               friend with the high powered sporting\n               rifle will shoot you in the throat.\n               Sorry to screw you over like this, but\n               the information you want might get me\n               killed if I give it to you, and that's a\n               price I'm not willing to pay.\n\n<b>                          VINCENT\n</b>                   (in French)\n               I take it you still want the money...\n\n<b>                          FRANCOIS\n</b>                   (in English, with a grin)\n               Of course.\n\n     SAM'S POV: Looking at Vincent and Francois.\n\n     The men are talking, and from here we can't really hear them\n     speak.  All Sam can see is an earnest Vincent listening to\n     Francois talk, almost as if Francois is giving Vincent\n     instructions.  Now - Vincent reaches into his pocket,\n     reaching for the envelope of cash he's carrying.  As he hands\n     the money to Francois, Vincent uses his free hand to pull out\n     his gun while - Sam already has his gun out -- somehow he\n     figured out what was going on -- and now Francois looks on in\n     stunned disbelief as -\n\n     Sam fires a single shot, hitting Francois in the shoulder,\n     driving him away from - Vincent, who now squeezes off several\n     rapid fire shots at the sniper, while - Francois, bleeding\n     but still very much alive, now has his piece free just as -\n     The Sniper, his gun firing wildly into the air, falls to the\n     ground, shot dead by Vincent, and now - Francois is drawing a\n     bead on Vincent when - Sam hits Francois with a fusillade of\n     bullets in the chest and now - A SINGLE SPENT BULLED CASING\n     flies through the air in SLOW MOTION and lands on the ground,\n     spinning around until it comes to a halt and - A HEAVY\n     SILENCE FALLS, as the last echo of the last gunshot finally\n     dies.  Vincent and Sam look at one another, see that they're\n     still alive, and then look back at - The two men they've\n     shot.  Francois isn't quite dead.  Blood bubbles from his\n     lips as Vincent leans over him.  Again, they speak in\n<b>     SUBTITLED FRENCH\n</b>\n<b>                          VINCENT\n</b>               Where's my information?\n\n<b>                          FRANCOIS\n</b>                   (with a grim smile, pointing to\n                    his head)\n               In here...\n\n<b>                          VINCENT\n</b>               Then you better find it in your heart to\n               tell me, Francois, because while your\n               death is inevitable, it still isn't\n               decided how painful it's going to be.\n\n     A LONG ANGLE - Vincent whispers in Francois's ear, whose grin\n     blanches as he realizes Vincent means to hurt him.  Francois\n     whispers something back and then - BANG.  Vincent shoots\n     Francois in the head, killing him instantly.  Then Vincent\n     bends down and retrieves the envelope of money which Francois\n     had tucked inside his shirt.  As Vincent does this, Sam comes\n     up from behind.\n\n<b>                          SAM\n</b>               Now would be a good time to get the fuck\n               out of here.\n\n<b>     INT. THE FIAT - LATER/NIGHT\n</b>\n     The two men drive in silence for a moment.  Vincent lights a\n     cigarette and offers one to Sam, who refuses.  Finally, Sam\n     speaks.\n\n<b>                          SAM\n</b>               You know, what you pulled back there,\n               that was bullshit.\n\n<b>                          VINCENT\n</b>               I needed to see if you were a cop.\n                   (defensively)\n               I'm a popular man with the police, Sam,\n               and whenever they try to catch me they\n               always do it with an inside guy -- some\n               man on some job who seems more\n               trustworthy than all the others put\n               together.  And that's the guy you have to\n               watch out for.\n                   (beat)\n               I hate cops...\n\n<b>                          SAM\n</b>                   (insulted that Vincent would\n                    even consider it)\n               Well I ain't a cop.\n\n     A BEAT, the two men driving in silence.\n\n<b>                          VINCENT\n</b>               How did you know?\n\n<b>                          SAM\n</b>               Know what?\n\n<b>                          VINCENT\n</b>               That there was a gun pointed at me.\n\n<b>                          SAM\n</b>               I saw you look off when Francois nodded\n               his head.  I figured he wasn't pointing\n               out a particularly rare shrub, and the\n               rest was easy.\n\n<b>                          VINCENT\n</b>               But how did you know I would have the\n               presence of mind to pull my weapon\n               when I did?\n\n<b>                          SAM\n</b>                   (as if it's obvious)\n               Because that's what I would have done...\n\n<b>     CUT TO:\n</b>\n<b>     EXT. AN APARTMENT HOUSE - A LITTLE LATER/NIGHT\n</b>\n     Vincent's Fiat is parked at the curb in front of this\n     apartment house.  Vincent and Sam exit the car and move\n     towards the house -- a silence hanging between them.  Right\n     before they go into the house, Vincent takes out the envelope\n     full of cash that was supposed to have been for Francois.  He\n     thinks for a moment and then hands the whole envelope to Sam.\n\n<b>                          VINCENT\n</b>               You saved my life back there in the park.\n               I know this doesn't begin to make it\n               right between us...\n\n     Vincent's voice trails off -- he doesn't know what to say.\n     Sam takes the money out of the envelope -- half he keeps for\n     himself, the other he gives to Vincent.\n\n<b>                          SAM\n</b>               What I did back in the park I did because\n               we're working together -- we're on the\n               same team.\n                   (holding up the money)\n               This is business -- this is work.  We did\n               it together, we share the spoils, even\n               split.\n\n     Sam opens the door to the house, but Vincent has one last\n     thing to say to him.\n\n<b>                          VINCENT\n</b>               I owe you a heavy debt.\n\n     Sam almost smiles cynically at this: debts of honor don't\n     seem to be something he believes in.\n\n<b>                          SAM\n</b>               Whatever you say.\n\n     They enter the house and the door closes behind them.  A\n     second later we hear -\n\n<b>                          DEIRDRE (V.O.)\n</b>               What'd you do with the money?\n\n<b>     INT. THE HOUSE - A LITTLE LATER\n</b>\n     Vincent and Sam sit with Deirdre in a room, alone.  They've\n     told her about the park, and she seems a little pissed about\n     all of this.\n\n<b>                          VINCENT\n</b>               We kept it...\n\n<b>                          DEIRDRE\n</b>                   (a little annoyed)\n               Is that right?\n\n<b>                          SAM\n</b>               Hazard pay...\n\n<b>                          DEIRDRE\n</b>                   (with an exhalation of disgust)\n               The two of you were supposed to go to a\n               simple meet and come back with a simple\n               piece of information, and instead you\n               went to fucking war...\n\n<b>                          SAM\n</b>               We weren't real thrilled about it\n               either...\n\n     Deirdre shakes her head in disgust and rises.  We FOLLOW HER\n<b>     INTO -\n</b>\n<b>     AN ADJOINING ROOM -\n</b>\n     Where Larry, Swede and Gregor are waiting.  They look up\n     expectantly at Deirdre, who crosses through the room without\n     stopping -- she's really pissed about this turn of events.\n\n<b>                          LARRY\n</b>               So what's the deal?\n\n<b>                          DEIRDRE\n</b>                   (barely stopping, very\n                    snappish)\n               The deal?  The deal is we leave for Nice\n               at first light.\n\n     And she exits, leaving these three men behind along with Sam\n     and Vincent, who have entered from the other room.  larry\n     looks at the two of them.\n\n<b>                          LARRY\n</b>               What'd you guys do?\n\n<b>     EXT. OUTSIDE THE HOUSE - LATER THAT NIGHT\n</b>\n     A CAR sits, cloaked in shadows.  Inside sits our friend, the\n     WATCHER.  Once again we see the Watcher's knife -- once again\n     he manicures his nails with it, almost delicately, as he\n     watches the House.  It's dark -- a single light glows behind\n     a window on the third floor.  Sam's room.\n\n<b>     INT. SAM'S ROOM - SAME TIME\n</b>\n     Sam has pushed all the furniture aside to make enough room to\n     do a martial arts form.  Right now he's frozen, one leg\n     extended in a kick, balancing on the other leg.  Now - A\n     KNOCK at his door -- seconds later, it opens.  Deirdre stands\n     there, watching as Sam holds his position for a BEAT more,\n     and then retracts his leg.\n\n<b>                          DEIRDRE\n</b>               I feel as if I've wandered onto the set\n               of Enter The Dragon.  Could you teach me\n               to do that?\n\n<b>                          SAM\n</b>               I didn't think to see you again tonight.\n               You were pretty pissed.\n\n<b>                          DEIRDRE\n</b>               I still am.\n\n<b>                          SAM\n</b>               Is that right?\n\n<b>                          DEIRDRE\n</b>               That's right.\n\n     Deirdre spings at Sam, throwing martial arts combinations at\n     him: punch followed by kick, elbow strike followed by palm\n     thrust.  Sam parries her blows as she drives him across the\n     floor until he's got his back to the wall.  Their movements\n     are controlled, but powerful, and there's something almost\n     flirtatious about the whole thing.  Now -\n\n     Deirdre throws one last punch which Sam ducks.  He slips\n     behind her and suddenly they square off in earnest.  The\n     previous martial arts stuff was a kind of choreographed\n     exercise, but now - They spar for real -- they never hit one\n     another, but they come awfully close, hands and feet whizzing\n     through the air, throwing rapid-fire combinations and\n     techniques.  They're not angry, but they're not kidding,\n     either.  Finally - Deirdre feints a punch that distracts\n     Sam's attention from - The KICK she throws right behind her\n     punch, and she smiles as - WHUMP!  Sam wasn't distracted at\n     all -- he drops to the ground beneath her kick and catches\n     her standing leg with a sweep which takes her to the ground\n     and now - She's trapped beneath him.  The two of them are\n     breathing hard from the exertion, their faces close to one\n     another, shining with sweat and excitement and - We've gone\n     from flirting to an almost primal seduction, and with their\n     faces only inches apart Deirdre leans in to kiss Sam, and\n     he's about to meet her half way when he pulls back.\n\n<b>                          SAM\n</b>               Part of me says I should just look at\n               this as a perk.  You know, a bonus.  But\n               then I remember you're you -- Deirdre\n               who used to belong to the IRA -- and it\n               occurs to me that deceit and subterfuge\n               come very naturally to you.\n\n<b>                          DEIRDRE\n</b>                   (kissing him very lightly)\n               Nobody's saying they don't.\n\n<b>                          SAM\n</b>                   (returning the kiss, just as\n                    lightly)\n               And when I consider that, I have to\n               wonder if you don't have some ulterior\n               motive for being here, with me, right\n               now.\n\n<b>                          DEIRDRE\n</b>               I probably do.\n                   (pulling him close)\n               But for the time being, I'm willing to\n               forget about it...\n\n     They finally kiss, slowly and then building in intensity, and\n     as they start to make love the\n\n     CAMERA MOVES UP - THROUGH THE BUILDING, floor by floor, until\n     we've reached -\n\n<b>     EXT. A ROOFTOP GARDEN - MEANWHILE\n</b>\n     Deirdre and Sam are not the only ones indulging in\n     extracurricular activities.  Up here in this rooftop garden\n     we find Swede and Gregor talking in hushed tones.\n\n<b>                          GREGOR\n</b>               I would imagine that the great\n               satisfaction in all of this will be\n               killing the American.\n\n<b>                          SWEDE\n</b>                   (we know this isn't true)\n               I hadn't thought about it.  Understand\n               me, Gregor -- I take no pleasure in\n               killing.  It doesn't bother me one bit,\n               but I don't get off on it.\n\n<b>                          GREGOR\n</b>               A means to an end, is that it?\n\n<b>                          SWEDE\n</b>               That's it.\n\n<b>                          GREGOR\n</b>                   (he rises to leave)\n               Then I guess we're set.\n\n<b>                          SWEDE\n</b>               There is one other thing...\n\n<b>                          GREGOR\n</b>               What's that?\n\n     Suddenly Swede pulls Gregor down to the rooftop with a harsh\n     THUD.  Within seconds he has his gun pressed to Gregor's\n     head.\n\n<b>                          GREGOR\n</b>               What are you doing?\n\n<b>                          SWEDE\n</b>               Don't cross me...\n\n<b>                          GREGOR\n</b>               Nobody's going to do that!\n\n<b>                          SWEDE\n</b>               Really?\n\n<b>                          GREGOR\n</b>                   (truly frightened)\n               I need you, Swede, I can't do this\n               without you!\n\n<b>                          SWEDE\n</b>                   (beat, then he puts his gun\n                    away)\n               I just wanted to make sure you knew who\n               you were dealing with.\n\n<b>                          GREGOR\n</b>               I do, I do...\n\n     Swede is now on his feet, walking away, back into the\n     apartment house.\n\n<b>                          SWEDE\n</b>                   (this is almost to himself)\n               Just remember it, then.\n\n     And he's gone.  And as soon as he is, we notice something\n     strange about Gregor: he's not the least bit scared -- he\n     laughs a little low laugh as we - \n\n<b>     DISSOLVE TO:\n</b>\n<b>     EXT. THE HOUSE - DAWN\n</b>\n     GRAY LIGHT seeps in from the horizon, while inside in -\n\n<b>     INT. SAM'S ROOM - SAME TIME\n</b>\n     Deirdre is pulling her dress over her head.  Sam seems to be\n     sleeping in his bed as she moves like a cat towards the door\n     when -\n\n     Sam's HAND reaches out, gently yet firmly, and takes her by\n     the arm.\n\n<b>                          SAM (O.S.)\n</b>               No goodbye?\n\n     ANOTHER ANGLE - Sam is somehow sitting up, wide awake --\n     looking at Deirdre with a penetrating glance.\n\n<b>                          DEIRDRE\n</b>               Look, Sam, don't take it the wrong way\n               when I tell you we won't be doing this\n               again.\n\n<b>                          SAM\n</b>               You don't have to explain yourself to me,\n               Deirdre.\n\n<b>                          DEIRDRE\n</b>                   (almost surprised by this)\n               I know I don't have to, Sam, it's just\n               that, for once, I want to.  when I was a -\n                   (almost with a sneer)\n               Patriot, it was a given I'd sleep with\n               any man it was deemed necessary for me to\n               sleep with.  You know: any man who needed\n               setting up.  Sometimes so we might\n               blackmail him, sometimes so he could be\n               killed.\n                   (a quick beat)\n               Sometimes so I could kill him myself.\n               IRA isn't exactly an enlightened feminist\n               organization, Sam.  To most of the men I\n               with I was always the girl.  \"Send the girl\n               to do it.\"  \"Tell The girl to take care of\n               it.\"  \"Have the girl fuck him.\"\n                   (a quick beat)\n               But I look at you and I get this feeling\n               you take me for what I am: no more, no\n               less.\n\n<b>                          SAM\n</b>               You're a hired gun, Deirdre -- just like\n               me.\n\n<b>                          DEIRDRE\n</b>               Exactly.  And last night I wanted to be\n               with someone who was just like me.\n\n     Somewhere in all of this Deirdre has sat back down on the\n     bed, and somehow now she's only inches away from Sam.\n     They're lips brush and -\n\n     A MUTED PHONE RINGS in a nearby room, breaking the moment.  A\n     QUICK BEAT, then -\n\n<b>                          DEIRDRE\n</b>               I better be getting that.\n\n<b>                          SAM\n</b>               Duty calls?\n\n<b>                          DEIRDRE\n</b>                   (with a trace of a sigh)\n               Just business.\n\n     Deirdre gives Sam a light kiss on the lips and then she opens\n     his door.  The muted phone is a little louder now.  Deirdre\n     closes Sam's door as she exits, but - Sam reaches out a hand\n     and catches the door right before it snaps shut.  He watches\n     THROUGH THE DOOR CRACK as - Deirdre cross the hall and\n     opens the door to her room, and now the phone rings loudly\n     until the door shuts, muting the sound once again, shutting\n     Sam out.  The phone stops ringing as Deirdre answers and as\n     this happens Sam shuts his door and as the door closes we go\n     to - BLACK.  Just for a second.  And then - BLINDING SUN hits\n     us in the eyes as we find ourselves above -\n\n<b>     EXT. NICE - DAY\n</b>\n     A DAZZLING OVERHEAD MOVING SHOT, establishing that we've\n     changed locales, moved to a place filled with sun and blue\n     water and reflective surfaces: the Cote d'Azure.  We start to\n<b>     MOVE DOWN TOWARDS -\n</b>\n<b>     EXT. A PRIVATE BEACH - NICE - MEANWHILE\n</b>\n     A TOPLESS GRANDMA reclines on a beach chair, soaking up rays,\n     sipping a drinnk just delivered by a young stud of a WAITER.\n     Nearby -\n\n<b>     AT A ROUND TABLE -\n</b>\n     A nice distance from anyone who might try to listen in, we\n     find our group: Deirdre, Sam, Vincent, Gregor, Swede, and\n     Larry.  Food and drink surround them.  Larry is, of couse,\n     still eating.\n\n<b>                          DEIRDRE\n</b>               Now then, let's run through it one more\n               time, shall we?\n                   (to Gregor)\n               What's your job?\n\n<b>                          GREGOR\n</b>               I use my cell phone to get computer\n               access to the telecommunications\n               satellite used by our target.  I trace\n               his cell phone signature and use it to\n               pin point his location as he moves\n               through Nice, relaying that information\n               to you.\n\n<b>                          DEIRDRE\n</b>                   (to Larry)\n               Next.\n\n<b>                          LARRY\n</b>                   (a sigh, he's done this too\n                    many times)\n               You call me with the target's route, I\n               follow along until we've reached the\n               attack point and then I run his squag ass\n               off the road.\n\n<b>                          DEIRDRE\n</b>                   (to Swede)\n               Which leads us to...\n\n<b>                          SWEDE\n</b>               I ride with fat-boy...\n\n<b>                          LARRY\n</b>                   (under his breath)\n               Eat shit and die slowly...\n\n<b>                          SWEDE\n</b>               After we stop the target car I get out\n               and use the heavy artillery to kill the\n               driver and his bodyguard.\n\n<b>                          LARRY\n</b>               I blast the lead car into oblivion...\n\n<b>                          VINCENT\n</b>                   (picking up)\n               While Sam and I take out the back two\n               cars...\n\n<b>                          DEIRDRE\n</b>               Leaving...\n\n<b>                          SWEDE\n</b>                   (picking it up)\n               ...Leaving me to step in, drop the target\n               in the back seat, and get the package...\n\n<b>                          DEIRDRE\n</b>                   (with a quick look at Sam)\n               While...\n\n<b>                          SAM\n</b>                   (returning her look)\n               ...While I back him up, making sure to\n               get the package if something goes wrong\n               and somebody takes Swede down.\n\n     Nobody else seems to notice this look between them, but we\n     should -- if only to note that there's something about the\n     way Deirdre queries Sam about his role, and something about\n     the way Sam answers her without overly reacting -- they're\n     not flirting, but there's a kind of acknowledgment of the\n     history they now have between them.  But -- nobody else\n     notices, and Swede's line follows Sam's without breaking the\n     flow of the dialogue.\n\n<b>                          SWEDE\n</b>               Nobody's taking me anywhere...\n\n<b>                          DEIRDRE\n</b>               And then...\n\n<b>                          LARRY\n</b>               Then Swede and I split with the package\n               and meet you back at the rendezvous.\n\n<b>                          DEIRDRE\n</b>               And then...\n\n<b>                          VINCENT\n</b>               And then Sam, you and I clean up\n               whatever's left to be cleaned.\n\n<b>                          DEIRDRE\n</b>               Very good.  Now all we have to do is live\n               long enough to get paid.\n\n<b>     EXT. A POSH HOTEL - LATER - NIGHT\n</b>\n     A ROW OF ROOMS, each one with a light behind a shade.  Even\n     as we watch the light in each room goes off: one two three\n     four five six lights -- one for each member of the team.  The\n     night before the big event nobody breaks curfew.\n\n<b>     ACROSS THE STREET -\n</b>\n<b>     A BAR -\n</b>\n     Through the bar window we see the Watcher's silhouette.  A\n     match flares as the Watcher lights a cigarette, REVEALING his\n     face for the first time: weathered, sharp, treacherous.  THE\n     MATCH goes out, and the Watcher's face FADES TO BLACK, and so\n     do we.\n\n<b>     FADE IN ON:\n</b>\n<b>     EXT. THE HILLS OF NICE - MORNING\n</b>\n<b>     A PRIVATE ESTATE IN THE HILLS -\n</b>\n     A CARAVAN OF BLACK ARMOR PLATED CARS, all idling, ready to\n     pull out, filled with muscular men in suits with bluges under\n     their jackets, all of them waiting for - THE TARGET.  Except\n     we've seem him before and he wasn't called the Target: he was\n     the Killer from the first scene of the film: the gunman in\n     the cathedral who made off with -  THE BRIEFCASE.  Which the\n     briefcase is still handcuffed to his side.  Now the Target\n     gets into his car, a BLACK MERCEDES, and as soon as he's in\n     the caravan pulls out and - The Target takes out his cell\n     phone, punches in a number and starts to talk, and as he does\n     we - PULL BACK, INTO THE AIR, leaving the Caravan behind as\n     we MOVE TOWARDS THE WATER and -\n\n     THE PROMENADE DES ANGLAIS, the long roadway that runs the\n     length of the town adjacent to the beach.  It's a special\n     place, a huge road for cars, along with a promenade for\n     tourists.  Here we come upon -\n\n<b>     AN OUTDOOR CAFE -\n</b>\n     Where we find Deirdre, a laptop in front of her, wearing a\n     HEADSET.  And, lest we think she looks out of place, we get\n     a look at -\n\n<b>     THE REST OF THE CAFE -\n</b>\n     Where many of the other PATRONS are typing away on laptops,\n     or chattering like crazy on their cell phone.  She types a\n     sentence on her keyboard, and as she types she says it out\n     loud.\n\n<b>                          DEIRDRE\n</b>               Alright, Gregor, I'm...\n\n<b>     CUT TO:\n</b>\n<b>     INT. A CRAMPED COMPTUER CONTROL ROOM - SAME TIME\n</b>\n<b>                          GREGOR\n</b>                   (finishing her sentence)\n               Ready when you are...\n\n     Gregor is sitting behind a console, looking at Deirdre's\n     message, which we can read on his laptop.  Gregor also has a\n     much bigger COMPUTER with him as well, and on this screen we\n     see - A COMPUTER GRAPHIC MAP OF NICE.  This is a map of\n     incredible detail, a high-tech graphic rendering of Nice.\n     Now - THE MAP starts to shift, randomly moving about the city\n     as it searches for the proper signal.  The computer isolates\n     an entire district of the city, enlarges a part of the\n     district, and then locates and enlarges a single street.  Now\n     - On screen a FLASHING CURSOR appears on the map, the TARGET.\n     The Cursor starts to move down one of the streets of Nice and\n     as we follow the Curson it TURNS INTO - THE TARGET CAR,\n     driving home the point that Gregor is now locked onto the\n     Target.  THE JAPANESE DRUMS we heard in the opening sequence\n     start to play again -- softly, ominously, and we're on -\n\n<b>     EXT. A SIDE STREET\n</b>\n     Where VINCENT'S FIAT is parked at a curb, Sam and Vincent\n     sitting inside.\n\n<b>     INT. THE FIAT\n</b>\n     Vincent sits behind the wheel, while Sam sits next to him,\n     loading a small arsenal of weapons.\n\n     The DRUMS grow, a little louder now, a little more urgent.\n\n<b>     EXT. ANOTHER STREET\n</b>\n     A VOLVO idles, waiting for something, Larry behind the wheel\n     of this car, and sitting next to him Swede.  The DRUMS\n     continue to play, and their volume is still low, but they're\n     jarring, setting our nerves on edge.\n\n<b>     INT. THE VOLVO\n</b>\n<b>                          LARRY\n</b>               Where is this broad?\n\n<b>                          SWEDE\n</b>               You should learn a little patience.\n\n<b>                          LARRY\n</b>               Is that right?\n\n<b>                          SWEDE\n</b>               It's consider a virtue in some corners\n               of the world.\n\n<b>                          LARRY\n</b>               Not in mine.\n\n     THE CAR PHONE rings, and Swede pushes a button.  Deirdre's\n     Voice is heard on the speaker phone.\n\n<b>                          DEIRDRE (V.O.)\n</b>               Hello gentlemen, are we ready?\n\n<b>     EXT. THE CAFE\n</b>\n     Deirdre looks at her laptop and relays Gregor's instructions.\n     She speaks over her headset as if she's conducting ordinary\n     business -- as if she's giving someone traffic directs\n     over the phone.  The JAPANESE DRUMS continue, quiet and yet\n     intense.\n\n<b>                          DEIRDRE\n</b>               You want to take a left, then, so that\n               you're going west.\n\n     During this next sequence, the DRUMS will continue to play,\n     building with the action as we do -\n\n<b>     THE CHASE MONTAGE: A SERIES OF CUTS AS -\n</b>\n     The Volvo takes a flying left turn -\n\n     Gregor watches the Target on his computer as it moves towards\n     the Promenade des Anglais, typing the results on his\n     keyboard as - The Volvo careens down a steep hill, hits a\n     bump, and flies through the air a good fifteen feet, even as -\n     The Fiat follows close behind and hits the same bump, does\n     the same flight through the air and lands with a thud -\n\n     THE CARAVAN of cars -\n\n<b>     THE TARGET CAR -\n</b>\n     THE TARGET, still talking away on his cell phone - THE\n     COMPUTER MAP tracking the Target's movements, as the Map\n     shifts and moves as it keeps pace with the target, and now -\n\n     The Promenade des Anglais is right ahead and the DRUMS build\n     to a crescendo as -\n\n     The Volvo SMASHES into the Target Car and they grind\n     together, as -\n\n     CARS 3 &amp; 4 in the Caravan are cut off by Vincent's Fiat,\n     which forces them to slam to a halt, as -\n\n     Larry runs the Target Car to a halt and the JAPANESE DRUMS\n     stop.\n\n     Larry and Swede hop out of the Volvo, and Swede brandishes a\n     MONSTER of a MACHINE GUN, with which he opens fire, a blast\n     of huge guage shells spitting a trail of fire, smashing\n     against THE WINDSHIELD of the Target Car, which is bullet-\n     proof.  The windshield doesn't break right away -- but the\n     heavy blast of firepower causes the windsield to buckle.\n\n     Sam and Vincent are now out of the Fiat, guns drawn, blazing\n     away at BODYGUARDS, and Christ, there's an army of them,\n     pouring out of Cars 3 &amp; 4.  These guys are armed and returning\n     fire as -\n\n     Larry gets out of the driver's seat of the Volvo, and he's\n     got some kind of sumbitch weapons himself, a ROCKET LAUNCHER,\n     which he points and fires - And now we TRACK THE MISSLE as\n     it scorches the air, traveling towards -\n\n     The LEAD CAR of the caravan which has only now realized\n     what's going on behind it, and as frantic Bodyguards drive\n     back towards the carnage - The Missle IMPACTS, blowing the\n     Car sideways.\n\n     Meanwhile - Sam and Vincent are taking out the Other\n     Bodyguards, and these guys are warriors -- they moves as a\n     team, each man with a gun in both hands, using a weapon until\n     it's out of bullets and then discarding it in favor of a new\n     one.\n\n     And even as this is going on - Deirdre has joined the fray,\n     firing both of her pistols, taking Sam's place at Vincent's\n     side so that Sam can run towards -\n\n     The Target Car, where the Target is seated in the backseat,\n     pulling out his own piece, ready to fight to the death\n     himself as -\n\n     Swede continues blasting away at the windshield with his\n     monster gun, and now - The Windshield has started to crack\n     and splinter, and abruptly, it shatters, instantly bursting a\n     bright red as Swede's bullets tear up the body of the Driver.\n\n     Now Sam has reaches the Target Car, just as the Target, who\n     is armed and, as we know, not exactly helpless, steps out of\n     the car and sights in on Swede and - ZING!  Sam fires,\n     winging the Target, knocking the gun out of his hand and\n     still the Target won't give up without a struggle, he hits\n     Swede with the Briefcase.\n\n<b>                          THE TARGET\n</b>               Fuck you!\n\n<b>                          SWEDE\n</b>               Not today.\n\n     BANG.  Swede puts one shot between the Target's eyes, ending\n     his life.  Now - Swede takes out a DAI-SHO, the smaller of the\n     two traditional Japanese Samurai swords.  With one slashing\n     blow he hacks off the Target's HAND AT THE WRIST and grabs\n     the briefcase.  The SEVERED HAND is still caught in the\n     handcuffs, so that it is carried along for the ride.  Now -\n     DISTANT SIRENS sound from OFF SCREEN as Swede moves back\n     towards Larry and the Volvo, and as he goes he raises the\n     briefcase (with its severed hand) in a kind of mock salute to\n     Sam, who starts to move back towards Deirdre and Vincent, who\n     have taken care of the remaining Bodyguards, and now the\n     SIRENS are growing closer as we - START TO MOVE IN SLOW\n     MOTION as Swede approaches the Volvo and - Deirdre and Vincent\n     are already at Vincent's Fiat, waiting for Sam, and so they\n     don't notice that - A VAN has been parked nearby this entire\n     time, and now the van's side door slides open, and unseen by\n     any of the others - Gregor steps out of the Van, a gun at his\n     side, and a predatory look on his face as - Swede reaches Larry\n     and the Volvo just as - Sam has reaches the Fiat, and now he looks\n     back and sees - Gregor, crossing the street, and now - Sam\n     screams a warning to Larry, but it's way too late because -\n     Swede shoots Larry in the neck, hitting him above the\n     protective covering of his bullet proof vest.  Now we're\n     MOVING IN REAL TIME as - Larry manages to get his backup\n     piece drawn, a snub-nosed .38, and he fires all six shots\n     into - Swede, hitting him in the stomach -- it's the same way\n     Larry shot the target in the warehouse.  Swede is sent flying\n     backwards, where he crashes to the pavement.  For a second we\n     think he's dead, but then he gets up, in pain but alive, just\n     as Sam predicted.  Swede claws at his shirt to reveal that he\n     too wears a bullet proof vest.  By now - Larry has rolled out\n     of the Volvo, crawling away but too weak to go far, and now -\n     Swede has Larry in his sights, he's going to kill him.\n\n<b>                          SWEDE\n</b>               I don't particularly like killing, tubby,\n               but I want you to know that this one I'm\n               going to enjoy.\n\n<b>                          LARRY\n</b>                   (sees something over Swede's\n                    shoulder)\n               I don't think so.\n\n     Swede turns to follow Larry's gaze, and as he does - Gregor\n     walks INTO FRAME and puts his gun right beneath Swede's chin.\n     Before Swede can even compute this, Gregor pulls the trigger,\n     firing straight up into Swede's brain.  Then, without even\n     looking at Larry, who is lying helpless on the ground -\n     Gregor takes the briefcase and gets into the Volvo, driving\n     off just as - Sam arrives, kneeling down by Larry.  The SIRENS\n     get louder.\n\n<b>                          LARRY\n</b>                   (in shock)\n               He just...I don't believe that son-of-\n               a...\n\n     Vincent's Fiat comes peeling to a halt in front of them,\n     Vincent and Deirdre inside it as Sam manages to get Larry\n     into the back seat.  Sam doesn't get in the car yet as Larry\n     says -\n\n<b>                          LARRY\n</b>                   (still having trouble believing\n                    it)\n               We've been crossed...\n\n     The SIRENS reach a crescendo as a group of GENDARMES arrive,\n     charging with automatic weapons drawn.  Between the French\n     cops and our heroes lies the shot up wreck of the Target Car,\n     and now - Sam takes out a GRENADE, pulls the pin, and rolls\n     it across the ground, beneath the Mercedes, which the cops\n     have just reached.  Seconds later - The Car EXPLODES, cutting\n     off the cops, and as this happens, Vincents puts the pedal to\n     the floor and gets the fuck out of Dodge.  We start to SLOWLY\n     PULL BACK on the remains of this battle: the dead bodies, the\n     shot up cars, the broken glass, and that flaming, smoking\n     hulk of a Mercedes in the middle of the street.\n\n<b>     DISSOLVE TO:\n</b>\n<b>     EXT. THE OLD CITY/NICE - SUNSET\n</b>\n     The FIREBALL of the car turns into a BLOOD RED SUN as it sets\n     in the Western sky, tinting the stone buildings of the Old\n     City a coppery red.\n\n     We're MOVING THROUGH the Old City, through the twists and\n     turns of what an American would call back alleys but that\n     pass for streets in this place.  It is quiet almost deserted,\n     then - A TESTOSTERONE CRAZED PLAYBOY whips his sports car\n     through one of these streets, engine whining, as we - MOVE\n     DOWN yet another side street, and this sucker really is a\n     back alley, you couldn't get a car down here if you tried.\n     Finally, we come to - A RAT TRAP OF AN OLD BUILDING, and we\n     PUSH TIGHT on this building as we hear -\n\n<b>                          LARRY (V.O.)\n</b>               What is this?\n\n<b>     INT. A BACK APARTMENT - SAME TIME\n</b>\n     A SYRINGE is plunged into Larry's arm.  Sam is tending to\n     Larry's wound.  Sam seems to know what he's doing, as Larry\n     is also hooked up to a bottle of plasma hanging on a make-\n     shift stand.\n\n<b>                          SAM\n</b>                   (answering Larry's question)\n               It's a cocktail.  Mostly demerol, cut\n               with a little crank because we might need\n               you awake in the real near future.\n\n<b>                          LARRY\n</b>               Fine with fucking me, we got work to do.\n               I don't care what it takes, we are\n               getting our property back and putting it\n               into the hands of the people who are\n               gonna pay us a great deal of money when\n               we do.  I don't know about the rest of you\n               guys, but I'm not the kind of guy\n               to just sit back and take it in the ass.\n                   (a quick beat)\n               I don't mean that in, like, a literal\n               way...\n\n<b>                          DEIRDRE\n</b>               Of course.\n\n<b>                          VINCENT\n</b>               Finding this package is a thing easier\n               said than done.  We don't even know what\n               it is.\n                   (he looks at Deirdre, and\n                    suddenly he's deadly earnest)\n               What did we steal?\n\n<b>                          DEIRDRE\n</b>                   (suddenly defensive)\n               I don't know.\n\n<b>                          VINCENT\n</b>               When this whole thing started you made it\n               clear: you're running the show.  And I\n               don't believe you'd be running this show\n               if you didn't know what was going on.\n\n<b>                          DEIRDRE\n</b>               Well I don't!\n\n<b>                          VINCENT\n</b>               And I don't believe you...\n\n     Vincent's gun is out in the blink of an eye, at Deirdre's\n     head, but she's as fast as he is and her gun is drawn as\n     well, jammed into his stomach.\n\n<b>                          DEIRDRE\n</b>                   (suddenly feral) \n               You go shoot me if you want, Vincent, but\n               you'll be dead before I hit the ground.\n\n<b>                          VINCENT\n</b>                   (matching her intensity)\n               I don't want you dead, woman, I want the\n               the truth!\n\n<b>                          SAM (O.S.)\n</b>                   (with a dead cool in his voice)\n               Both of you...\n\n     ANOTHER ANGLE - Sam has the two of them covered with his gun -\n     an interesting moment, because he can shoot either Deirdre or\n     Vincent, but not both at the same time.  The question is:\n     whose side is he on?\n\n<b>                          SAM\n</b>                   (continuing without missing a\n                    beat)\n               ...put your guns down and chill out.\n\n     A BEAT.  And then Vincent and Deirdre lower their weapons,\n     followed by Sam.\n\n<b>                          SAM\n</b>               Like it or now, we're on the same side:\n               we're here and the package isn't.\n                   (looks at Deirdre)\n               You're not the boss any more, you're our\n               partner.  So tell us what you know, so we\n               can figure a way out of this mess.\n\n     Sam's look isn't romantic, but it implies a level of trust\n     based upon their physical intimacy.\n\n<b>                          SAM\n</b>               Now, what did we steal?\n\n<b>                          DEIRDRE\n</b>                   (she hates to admit this)\n               I don't know...\n                   (defensively, off Vincent's\n                    look)\n               Well I don't!  It's a goddamned mystery\n               to me just like it is to you.\n                   (quick beat, then reluctantly\n                    continuing)\n               But I do know who we're working for.  My\n               people, and the Russian mob.\n\n<b>                          LARRY\n</b>               Your people?  Who the fuck is your\n               people?\n\n<b>                          VINCENT\n</b>               Who do you think, Larry?  The IRA.\n\n<b>                          DEIRDRE\n</b>               And you believed me?\n                   (passionately)\n               But it wasn't my people who did it.\n\n<b>                          LARRY\n</b>               How do we know that?\n\n<b>                          SAM\n</b>               Because if they had she'd be gone along\n               with the package, instead of sitting here\n               with us.\n\n<b>                          DEIRDRE\n</b>               Exactly.  Gregor, he was the Russian's\n               man.  It was my people came up with the\n               idea for this run, but the Russians who\n               had the capital to finance it.  Gregor,\n               he was their insurance, and I was ours.\n               Everybody else was supposed to be\n               neutral.  Gregor must've got to Swede...\n\n<b>                          LARRY\n</b>               I never did trust that blonde fuck...\n\n<b>                          DEIRDRE\n</b>               That's why you were riding with him.\n\n<b>                          VINCENT\n</b>               The question still remains: what do we do\n               now?\n\n<b>                          SAM\n</b>                   (he figures something out)\n               Gregor's cell phone...\n\n<b>                          LARRY\n</b>                   (to himself)\n               What are you gonna do, call him up and\n               ask him to give us back our shit?\n\n<b>                          SAM\n</b>                   (ignoring Larry, to Deirdre)\n               Did he bring that with him?\n\n<b>                          DEIRDRE\n</b>               I bought it for him -- all the stuff he\n               was using, it was in his contract.  Cost\n               a nice penny, too, especially that\n               goddamned phone: Gregor had expensive\n               tastes.\n\n<b>                          SAM\n</b>               Check this out.\n                   (he's thinking on his feet)\n               Gregor's a spook, or he was one until\n               recently.  When he was a spy he lived the\n               life -- you know, a prince in some\n               Eastern Bloc country where nobody had\n               shit and Gregor had everything.  Then the\n               wall goes down.  No more Cold War.  And\n               Gregor is out of a job.  No apartment, no\n               special stores with Western food and\n               video tapes.  I would bet dollars against\n               shit that Gregor liked that phone and he\n               doesn't want to give it up.  And I\n               wouldn't be surprised if he's arrogant\n               enough to think...\n\n<b>                          DEIRDRE\n</b>                   (finishing his sentence)\n               That we're too stupid to trace his calls.\n\n     Deirdre and Sam share the slightest of conspiratorial smiles\n     as they realize they're both thinking the same thought: they\n     might still win this one.\n\n<b>     EXT. AIX EN PROVENCE - TWILIGHT\n</b>\n     We're on perhaps the MOST BEAUTIFUL STREET in all of France:\n     the Cours Mirabeau in the town of Aix.\n\n     Outdoor cafes line the sides of the street, while a canopy of\n     interlocking trees covers everything.  Now we're - MOVING,\n     DOWN THE STREET, towards a CAFE, where a DAPPER GENT sits,\n     sipping a mineral water.  The Gent has a SATCHEL at his feet.\n     Now - A JEEP pulls up to a nearby corner and idles in\n     neutral.  The Dapper Gent throws some bills on the table and\n     gets up, crossing to - The Jeep.  A door opens, and the\n     Dapper Gent, carrying his satchel, gets into the jeep, which\n     drives off as we -\n\n<b>     CUT TO:\n</b>\n<b>     INT. JEEP - SAME TIME\n</b>\n     Gregor and the Dapper Gent drive in silence for minute, down\n     the length of the Cours Mirabeau.\n\n<b>                          GREGOR\n</b>                   (breaking the silence)\n               It's a beautiful street, no?\n\n     The Dapper Gent also has an accent, a much thicker one than\n     Gregor's; it's an accent that places the Gent as a resident\n     of what used to be called the Soviet Union.\n\n<b>                          DAPPER GENT\n</b>                   (he can't wait any longer)\n               Do you have it?\n\n<b>                          GREGOR\n</b>               Always in a rush, you are.  All these\n               years I've known you, you could never\n               wait for anything.\n\n<b>                          DAPPER GENT\n</b>               This is important.\n\n<b>                          GREGOR\n</b>               Do you really think so?\n\n<b>                          DAPPER GENT\n</b>               You know it is.\n\n     Gregor, still driving, takes out a SILENCED PISTOL, and the\n     Dapper Gent reaches for his own piece.\n\n<b>                          GREGOR\n</b>               Relax!\n\n     The Dapper Gent loweres his hand, leaving his gun in his coat.\n     Gregor pulls the van to a curb.\n\n<b>                          GREGOR\n</b>               Look over there.\n\n<b>     GREGOR &amp; THE GENT'S POV: THROUGH THE WINDSHIELD - A GROUP OF\n</b>     CHILDREN are playing.\n\n<b>                          GREGOR (O.S.)\n</b>               Do you see that one?  The girl in the\n               light blue dress?\n\n     We find one particular LITTLE GIRL, around eight, holding the\n     end of a jump rope, wearing a light blue dress.  She's\n     breathtakingly beautiful, and now - Gregor raises his\n     silenced pistol, as if to shoot her.\n\n<b>                          DAPPER GENT\n</b>               What are you doing, have you lost your\n               mind?!?\n\n     Gregor pulls the trigger, as he does so the Dapper Gent jogs\n     his arm, and we hear the soft thwpfft of the silenced shot\n     just as the shot goes off - Missing its mark, harmlessly\n     shooting into a tree, causing a SINGLE LEAF to float to the\n     ground behind the playing children.  Nobody notices a thing.\n     BEAT.  The Dapper Gent is visibly shaken, because there is no\n     doubt that Gregor would have killed the Girl if the Gent\n     hadn't ruined his aim.\n\n<b>                          DAPPER GENT\n</b>               Why did you do that?\n\n<b>                          GREGOR\n</b>               To make a point.  I don't know her, and I\n               was ready to splatter her brains all over\n               the sidewalk.\n                   (giving the Gent a look)\n               I don't particularly like you, so imagine\n               what I'll do if you try anything...\n\n     Gregor leaves his gun dangling in the air a moment longer than\n     necessary and then starts the jeep as we -\n\n<b>     CUT TO:\n</b>\n<b>     EXT. A COUNTRY ROAD OUTSIDE OF AIX - NIGHT\n</b>\n     A FULL MOON casts a silver light over a field of wild grass.\n     A soft wind blows, and the grass moves gently from side to\n     side.  Now - Gregor's JEEP glides down this road as we MOVE\n<b>     THROUGH TO -\n</b>\n<b>     INT. THE JEEP - SAME TIME\n</b>\n<b>                          DAPPER GENT\n</b>                   (squirming)\n               Enough!  We've been driving for an hour,\n               where is my package?\n\n     Gregor smiles -- he's been waiting for this.  He pulls the\n     jeep over and looks at the Dapper Gent.\n\n<b>                          GREGOR\n</b>               It's under your seat.\n\n<b>                          DAPPER GENT\n</b>                   (incredulous)\n               What?\n\n<b>                          GREGOR\n</b>               As my American friend Larry would say:\n               are you fucking deaf?  It's under your\n               seat.\n\n     The Dapper Gent looks down, and sure enough, the edge of the\n     Briefcase sticks out beneath the seat.\n\n<b>                          DAPPER GENT\n</b>               I can't believe you'd do that, Gregor.  I\n               thought I trained you better than that.\n\n     With a laugh the Dapper Gent hands his satchel to Gregor,\n     whose eyes literally dance with the prospect of his reward.\n     He can't help himself, he opens the satchel and there it is -\n     COLD HARD CASH in large bills, enough for Gregor to live like\n     a prince for quite some time.  Gregor sucks in an involuntary\n     breath and then looks back up to see - The Dapper Gent hasn't\n     reached for the Briefcase.  Instead he's taken out his gun,\n     and it's only inches from Gregor's head.\n\n<b>                          DAPPER GENT\n</b>               I've never particularly liked you either,\n               Gregor.\n\n     The Dapper Gent yanks out the Briefcase, and as he does -\n\n     THE SEVERED HAND comes whipping out along with it, still\n     attached by the handcuff chain.  The Hand flies up in the\n     Dapper Gent's face, and we notice that the Hand is starting\n     to rot -- it's bloated and swelling and horrific and it\n     scares the shit out of the Dapper Gent, who drops his gun and\n     fumbles with the Briefcase as - THWPFFT...we hear the sound\n     of another silenced shot as we -\n\n<b>     SMASH CUT TO:\n</b>\n<b>     EXT. OUTSIDE THE JEEP - SAME TIME\n</b>\n     A DARK STAIN splashes against the passenger side window of\n     the jeep.  Seconds later - The door swings open, and the\n     Dapper Gent's body plunks out onto the ground.  A moment\n     later, something wet and viscous plops down on the face of\n     the Gent as the jeep drives off.  Now - We HOLD FOR A BEAT on\n     the Dapper Gent's dead body, which lies in the silver\n     moonlight, blood running out from beneath him, while the\n     Severed Hand palms the Gent's face, fingers splayed out\n     around his head.  Now - We HEAR the sound of PHONE TONES.\n     And not just any phone...\n\n<b>     INT. THE JEEP - SAME TIME\n</b>\n     Gregor finishes punching a number into his CELL PHONE.  We\n     hear a single ring on the other end of the phone before it is\n     picked up.\n\n<b>                          PHONE VOICE (V.O.)\n</b>                   (in Russian, English subtitles)\n               Is it done?\n\n<b>                          GREGOR\n</b>                   (in English)\n               It's done.\n\n     BEAT.  The Phone Voice doesn't respond for a moment -- whoever\n     this is they didn't expect to hear from Gregor.  The Voice\n     switches to English.\n\n<b>                          PHONE VOICE (V.O.)\n</b>               Gregor, is that you?\n\n<b>                          GREGOR\n</b>                   (with a low chuckle)\n               Much to your disappointment, no doubt.\n\n<b>                          PHONE VOICE (V.O.)\n</b>               It was a mistake, it shouldn't have\n               happened.\n\n<b>                          GREGOR\n</b>                   (suddenly cold, furious)\n               I'm in the middle of saving you people a\n               great deal of money -- the least you\n               could do is have the decency to pay me!\n\n<b>     BEAT.\n</b>\n<b>                          PHONE VOICE (V.O.)\n</b>               So what do we do?\n\n<b>                          GREGOR\n</b>               What I do is none of your concern.  What\n               you should do is wait for my next phone\n               call.  I'm going to find a place where I\n               can tilt the field in my favor.  When I'm\n               ready, I'll call you and tell you what I\n               want you to do.\n\n     The Phone Voice says something unintelligible in Russian, cut\n     off by Gregor as he angrily snaps off his cell phone and we -\n\n<b>     CUT TO:\n</b>\n<b>     INT. THE CHEAP APARTMENT - DAWN\n</b>\n     Larry snores on the couch, while Deirdre sleeps in a sleeping\n     bag on the floor.  Vincent sits in a ratty easy chair, feet\n     propped on an overturned crate, dozing lightly.  Suddenly -\n     Vincent's eyes open, warily, as if something has changed in\n     the room.  He looks around - No Sam.  Vincent gets up, takes\n     out his gun, and silently gets to his feet.  He moves down a\n     long hall and - No Sam.  Now, like a cat, Vincent moves into -\n\n     THE BATHROOM: pitch black.  He moves in, swipes the string of\n     the overhead light and - nothing.  Nobody's here.  The only\n     place left is the front door, and now Vincent approaches.  He\n     opens the door, gun still at ready, and moves out into -\n\n<b>     INT. THE LANDING OUTSIDE - SAME TIME\n</b>\n     This is a small building.  There is no other apartment on\n     the floor.  At the far end of the landing, there is a small\n     ladder which leads up to -\n\n     THE ROOF.  And the door which leads to the roof is flapping\n     in a light wind.\n\n<b>     EXT. THE ROOF - SAME TIME\n</b>\n     Vincent bursts onto the roof, gun straight out, finger on the\n     trigger, only to find - Sam is there, his gun pointed at\n     Vincent.  A BEAT, then both men give little laughs and put\n     their weapons away, like Samurai so trained in combat that\n     they know when it's safe to relax.\n\n<b>                          SAM\n</b>               What's going on?\n\n<b>                          VINCENT\n</b>               You weren't around when I woke up, I\n               thought maybe something had happened.\n                   (off Sam's look)\n               This has been one very fucked up job,\n               Sam, and I'm not taking any more chances\n               on anybody...\n                   (a quick beat)\n               Including you...\n\n     In answer Sam takes out Vincent's pack of cigarettes and\n     tosses them back to him.  Vincent looks almost delighted at\n     this.\n\n<b>                          SAM\n</b>               I came up here to sneak a smoke.\n\n<b>                          VINCENT\n</b>               You were smoking?\n\n<b>                          SAM\n</b>               I hope you don't mind I took your pack.\n               It was on the table.\n\n<b>                          VINCENT\n</b>                   (very sincere, offering the\n                    pack)\n               Please, help yourself.  Smoke as many\n               you'd like.\n\n     Sam considers for a minute, and then takes one.  Vincent does\n     so as well, and he searches for his lighter, which he can't\n     seem to find, because - Sam has it, and he lights their\n     cigarettes, and then hands the lighter back to Vincent.\n\n<b>                          SAM\n</b>                   (a shrug of the shoulders)\n               I borrowed that, too...\n\n<b>                          VINCENT\n</b>                   (puffing contentedly)\n               Of course...whenever you feel like it\n               just help yourself.\n\n<b>                          SAM\n</b>               I have a feeling I'm about to start\n               buying my own.\n\n     BEAT.  The two men smoke in silence, looking out at -\n\n<b>     THE CURVED SHORELINE OF NICE -\n</b>\n     Which glitters with thousands of lights from the apartment\n     buildings, and a thousand more from the cars that travel on\n     the road that leads into town: the Promenade des Anglais.\n\n<b>                          VINCENT (O.S.)\n</b>               That was a bad bit of business, today.\n\n     BACK ON Sam and Vincent.\n\n<b>                          SAM\n</b>               It was at that.\n\n<b>                          VINCENT\n</b>               A lot of people died.\n\n<b>                          SAM\n</b>               I've seen a lot of people die before.\n\n<b>                          VINCENT\n</b>               I haven't.  Not like that.  How do you\n               get used to it?\n\n<b>                          SAM\n</b>               You don't.  You just learn to live with\n               it.\n\n<b>                          VINCENT\n</b>               I won't lie -- there have been times when\n               I had to do it, times when the only way\n               to get out alive was to see that the\n               other man didn't.\n\n<b>                          SAM\n</b>               We live in a singular world, my friend.\n\n<b>                          VINCENT\n</b>               I never really thought I was part of the\n               world you move in, Sam, to tell you the\n               truth.\n                   (off his look)\n               I'm a hood, a thief.  Big time in a small\n               time king of way.  To the local police\n               I'm a prize, to the local hoods I'm a\n               legend.  But to a guy like you I'm just\n               another two bit hired gun.\n\n<b>                          SAM\n</b>               You might be a hired gun, Vincent, but I\n               got a feeling you cost more than two\n               bits.\n\n     This conversation might have gone further, but it is\n     interrupted when Deirdre pokes her head up onto the roof.\n\n<b>                          DEIRDRE\n</b>               Christ, I was starting to think that the\n               two of you had thrown it in and walked\n               away.\n                   (to Vincent)\n               There's someone on the phone downstairs\n               asking for you, and my somewhat limited\n               French leads me to believe that he might\n               have something to tell us about Gregor.\n\n<b>     EXT. THE HIGHWAY - LATER - NIGHT\n</b>\n     A car we haven't seen before, a CITROEN, hums up the French\n     highway in the night, along on the road.  It's a postcard\n     moment, but only for a moment.\n\n<b>                          LARRY (V.O.)\n</b>               I'm telling you...\n\n<b>     INT. THE CITROEN - SAME TIME\n</b>\n<b>                          LARRY\n</b>                   (continuing)\n               That I could be dead and I'd drive better\n               than you.\n\n     Deirdre is driving, and Larry -- much to his chagrin -- is in\n     the passenger seat, watching her every move.\n\n<b>                          DEIRDRE\n</b>                   (very curt)\n               Oh shut up...\n\n<b>     IN THE BACK SEAT -\n</b>\n     Sam and Vincent have a MAP spread out.  Vincent is tracing\n     Gregor's route so far, and we follow his RED MAGIC MARKER as\n     it traces a line up the highway.\n\n<b>                          VINCENT\n</b>               He's going north.\n                   (circles something on map)\n               That's Aix en Provence, where he used the\n               phone.\n\n     Sam runs his finger along the length of the highway on the\n     map.  Destination: Paris.\n\n<b>                          SAM\n</b>                   (making up his mind)\n               He's going back.\n\n<b>                          VINCENT\n</b>               Not necessarily.  He could go off road at\n               any number of places.  He might not even\n               be in the country anymore.\n\n<b>                          SAM\n</b>               It's Paris.  The route's too indirect for\n               anything else.  A guy like Gregor, he\n               doesn't waste time on this road unless he\n               has to be on it in the first place.\n               Otherwise, he'd be out of the country by\n               now.  He's going to Paris.\n                   (beat)\n               Now I just hope we can find him before he\n               gets there.\n\n<b>                          DEIRDRE\n</b>               If somebody else doesn't find him first.\n\n<b>     EXT. THE TOWN OF ORANGE - DAY\n</b>\n     Orange, pronounced \"Au-Ronge\", is a mid-sized town of fifty\n     thousand souls.  It is small, charming, quaint, and it has\n     one particular thing that no other town in France can claim -\n\n     AN ANCIENT ROMAN THEATER that has been painstakingly\n     restored.  We see this Roman Theater from the outside, as we\n     MOVE THROUGH the streets of the town, to the TOWN SQUARE.\n     It's packed -- every seat in every outdoor cafe is filled\n     with a tourist having breakfast.  This normally quiet place\n     explodes one month out of the year, when an internationally\n     famous music festival is held in the Roman Theater.  We come\n     upon -\n\n     A TABLE OF AMERICAN TOURISTS: a Family.  Dad is angry at Mom.\n\n<b>                          DAD\n</b>               Opera?  This is an opera festival?\n\n<b>                          MOM\n</b>               I told you that, Henry.\n\n<b>                          DAD\n</b>               I thought you meant Phantom of the Opera.\n               You know, Andrew Lloyd Weber, Cats, that\n               kind of thing.\n\n     Mom and Dad continue their discussion, but we've left them\n     behind, MOVING THROUGH the seats and cafes until we get to a\n     cafe on the outskirts of the Town Square.  Here, in the most\n     removed table in the entire Square, we find Gregor sitting in\n     the shadow of the trellis.  Unless you're on top of him you\n     can't see him, but he can see everything perfectly.  His cell\n     phone sits on the table in front of him -- he picks it up and\n     starts to punch in a number.\n\n<b>     CUT TO:\n</b>\n<b>     EXT. A REST STOP ON THE HIGHWAY - MEANWHILE\n</b>\n     THE CITROEN is parked among a number of other cars.  Sam is\n     sleeping in the back seat, while Vincent is seen on an\n     outdoor pay phone at the other end of the parking lot.\n     Deirdre and Larry sit at a nearby picnic table, eating French\n     fast food, which we get a good look at as we - PAN THE LENGTH\n     OF THE TABLE, which is covered with pasta, grilled sausages\n     with dijon mustard, really good fried potatoes.\n\n     In fact, everything that's on this table is so far beyond the\n     imagination of your average American truck driver that Larry\n     can't contain himself.  He's stuffing himself, washing\n     everything down with the wine which is also sold at these\n     road-side rest stops.  Deirdre drinks coffee.\n\n<b>                          LARRY\n</b>                   (mouth full)\n               This...this is incredible. Is the rest\n               of Europe like this?\n\n<b>                          DEIRDRE\n</b>                   (with a laugh)\n               Some places, not all.  Italy, for\n               instance, they're serious about their\n               food.  But try bloody Britain, anywhere\n               in the U.K., you don't get much fancier\n               than a deep-fried bar egg.  Food's not\n               our thing, you see.\n\n<b>                          LARRY\n</b>               What is?\n\n<b>                          DEIRDRE\n</b>                   (everybody knows this)\n               Best beer in the world known to man or\n               God.\n\n<b>                          LARRY\n</b>                   (with a snort)\n               Best beer in the world?  Budweiser for\n               me, thanks.\n\n<b>                          DEIRDRE\n</b>                   (with unconcealed scorn)\n               Budweiser?  You talk to me of beer and\n               you've the unbridled gall to mention\n               Budweiser in the same sentence?  That's\n               not beer!  Christ, it's not even a poor\n               excuse for rabbit piss.\n\n<b>                          LARRY\n</b>               Oh yeah?  Whatta you drink, then?\n\n<b>                          DEIRDRE\n</b>               I drink what every civilized man, woman\n               and child in the world drinks: Guinness.\n\n<b>                          VINCENT (O.S.)\n</b>               I hate to interrupt a conversation of\n               such cultural depth...\n\n     CUT AWAY TO REVEAL: Vincent -\n\n     Who has finished his phone call and returned to join them.\n\n<b>                          VINCENT\n</b>               ...but we've got to get back on the road.\n\n     Vincent raps lightly on the car window next to Sam's head --\n     Sam's eyes shoot open: a light sleeper.  All eyes are on\n     Vincent, who waits for a BEAT before he reveals his news.\n\n<b>                          VINCENT\n</b>               We've got him.\n\n<b>                          LARRY\n</b>               I'm driving.\n\n<b>     EXT. THE TOWN SQUARE - A LITTLE LATER - DAY\n</b>\n     Gregor is seated where we saw him last -- at the little table\n     in the corner cafe.  He's been here for hours, observing the\n     Town Square, and now, he finally sees what he's been looking\n     for - TWO MEN, definitely not tourists here for the music,\n     have entered the Square -- everything about these guys\n     screams GUNMEN.  Now, as Gregor watches - A PUNKED-OUT TEEN\n     comes up to the men and hands them a small envelope.  The\n     Gunmen look around the Square, trying to see where Gregor is,\n     but he's too far back in the shadows.  The Gunmen ask the\n     Teen a question, to which the Teen can only shrug his\n     shoulders.  Now - The Teen walks away, leaving the Gunmen to\n     open the envelope and look at its contents, which are quickly\n     read.  From OFF SCREEN we hear the sound of Gregor punching\n     in a number on his cell phone.  Simultaneously, the Gunmen\n     finish reading the instructions Gregor has sent them, and\n     turn around to face - A PAY PHONE.  The phone rings, and one\n     of the Gunmen goes to pick it up.\n\n<b>     EXT. ANOTHER STREET - MEANWHILE\n</b>\n     The Citroen pulls into town and slows to a crawl, cruising\n     the streets, looking for Gregor.\n\n<b>     INT. THE CITROEN - SAME TIME\n</b>\n     Vincent stares out of the window and sees something that\n     causes him to swear under his breath in French.  It's -\n\n     The Gunmen walking down the street.\n\n<b>                          VINCENT\n</b>               I know those men.\n\n     Sam frowns: he also seems to recognize at least one of the\n     gunmen.  None of the others in the car notice Sam's reaction,\n     but we do.  The Gunmen are heading straight for -\n\n<b>     EXT. THE ANCIENT ROMAN THEATER - MEANWHILE\n</b>\n     THE MID-AFTERNOON SUN shines down on the open air Roman\n     Theater.  The theater itself is almost two thousand year\n     old.  A semi-circle of seats surrounds a huge Stage Wall, a\n     massive structure which is one of the best preserved of its\n     kind in the world.  THE GUNMEN enter at the bottom of the\n     theater, holding ticket stubs.  They are with a Tour Group\n     led by an ANCIENT GEEZER who speaks in rapid-fire French.  As\n     the tour moves off to see the Stage Wall, the Gunmen hang\n     back and then separate from the crowd.\n\n<b>     EXT. OUTSIDE THE THEATER - SAME TIME\n</b>\n     THE CITROEN sits at a curb.  Larry sits behind the wheel of\n     the car, the getaway driver with the motor running.  Vincent\n     and Deirdre are already walking towards the Theater.  Sam\n     stays behind for a second to say something to Larry.\n\n<b>                          SAM\n</b>               Whatever you hear, whatever happens, when\n               your partners come back out, you make\n               sure you're here with the motor running.\n\n     And on that note Sam follows after Vincent and Deirdre.\n     Larry doesn't notice it, but - THE WATCHER has found them.\n     He's a block or so away, wearing a two-day stubble of beard\n     and hugging the shadows of back alley.  Cradled in one hand,\n     barely visible but ominously present: his knife, which for\n     one moment catches a glint of sun that hits our eyes as we -\n\n<b>     CUT TO:\n</b>\n<b>     EXT. INSIDE THE ROMAN THEATER - MEANWHILE\n</b>\n     The Gunmen have reached a point about midway up the coliseum-\n     like staircase.  Behind them we can see the Tour Group,\n     standing on the stage, being lectured to by the Ancient\n     Geezer.  In front of them the Gunmen find -\n\n     AN EXIT which leads to an interior hall.  Inside the exit\n     it's dark, while a bright sun falls down on the Gunmen.  They\n     look into the dark, unable to see a thing, while a voice\n     come at them from out of the dark.\n\n<b>                          GREGOR (V.O.)\n</b>               Thank you, gentleman, that will do\n               nicely.\n\n<b>     IN THE HALL -\n</b>\n     ON GREGOR.  It's dark in here.  There are no lights, no\n     torches.  From the dark in here, he can look out and see -\n     THE GUNMEN, who make plain targets, backlit as they are by\n     the sun.  Now we CUT BACK AND FORTH between these two ANGLES,\n     and it becomes clear that Gregor has chosen wisely -- he can\n     see his quarry, but they can't see him.\n\n<b>                          GREGOR\n</b>               Edvard, is that you?\n\n     EDVARD, the more dangerous looking of the two Gunmen\n     responds.\n\n<b>                          EDVARD\n</b>               Yes, Gregor, they sent me.\n\n<b>                          GREGOR\n</b>               I'm touched, really, that they'd send\n               someone of your caliber.  It's nice to\n               know that they didn't make the mistake of\n               underestimating me twice.\n\n<b>                          EDVARD\n</b>               That was a mistake, trying to kill you.\n               Mikhi did it without consulting me, I'd\n               have never allowed it.\n\n<b>                          GREGOR\n</b>               I'm sure.  But I'm sorry to say that it's\n               too late for trust: we have a serious\n               problem.\n\n<b>                               EDVARD\n</b>               We'll double your price.\n\n<b>                          GREGOR\n</b>                   (now that's interesting)\n               Really?  Do you have the money with you?\n\n<b>                          EDVARD\n</b>               Do you have the material?\n\n<b>                          GREGOR\n</b>               You first, Edvard.\n\n<b>                          EDVARD\n</b>               Perhaps we could both go at the same\n               time...\n\n<b>                          GREGOR\n</b>                   (a short laugh)\n               I think not.\n                   (with a flourish)\n               After you...\n\n     A GUN COMES INTO FRAME, trigger cocked, the barrel placed to\n     Gregor's temple.\n\n<b>                          SAM (O.S.)\n</b>               After you, asshole.\n\n     Gregor stiffens, as we PULL BACK ON Sam, who has snuck up on\n     Gregor and gotten the drop on him.\n\n<b>                          SAM\n</b>               You might have been one mean technical\n               spook, Gregor, but you wouldn't have\n               lasted a week in the field.\n\n     CUT TO THE GUNMEN'S POV: Looking into the Tunnel - It's dark,\n     they can't see a thing, but they've heard Sam's voice and\n     they know something's wrong.\n\n<b>                          EDVARD\n</b>               Gregor, are you alright?\n\n<b>                          DEIRDRE (O.S.)\n</b>               Gregor's fine...\n\n     CUT AWAY TO REVEAL: Deirdre -\n\n     She's snuck up on the Gunmen, weapon drawn.\n\n<b>                          DEIDRE\n</b>                   (continuing)\n               ...but I think you're in a bit of\n               trouble.\n\n     The Gunmen reach for their pieces and as they do -\n\n<b>                          VINCENT (O.S.)\n</b>               Don't even think it.\n\n     CUT AWAY TO REVEAL: Vincent - And his piece is also out --\n     the Gunmen are trapped, and they know it.  Now we notice that\n     - The Ancient Geezer and his Tour Group are coming towards\n     us.  Meanwhile, back in -\n\n<b>     THE TUNNEL -\n</b>\n     Sam is grilling Gregor furiously, his gun still to Gregor's\n     head.\n\n<b>                          SAM\n</b>               Don't talk to me unless you tell me what\n               I want to hear, understand?!?  You have\n               no choice in this, don't think about\n               winning, think about staying alive.  I\n               want the item, and if you don't give it\n               to me, I'm gonna kill you.\n\n<b>                          GREGOR\n</b>                   (a panicky hiss)\n               I don't have it with me...\n\n<b>                          SAM\n</b>               Bullshit!\n\n<b>                          GREGOR\n</b>               I swear...\n\n<b>                          SAM\n</b>               Then where is it?\n\n<b>                          GREGOR\n</b>               I sent it to myself in Paris.\n\n<b>                          SAM\n</b>               Sent it where?\n\n<b>                          GREGOR\n</b>               A post office box.\n\n     Suddenly Gregor runs forward, towards the exit.  Sam runs\n     after him, tackling him just as they reach - THE OUTSIDE,\n     where the two men roll into plain sight of - The Gunmen, who\n     are still covered by Vincent and Deirdre.  Now we notice -\n     That the Ancient Geezer and his Tour Group are really close,\n     no more than ten yards away, as - Sam has Gregor pinned face\n     first on the ancient stone of the theater.  He looks up at\n     the others, and that's when it happens - Edvard looks at Sam\n     and recognizes him.\n\n<b>                          EDVARD\n</b>                   (stunned, announcing to the\n                    group)\n               Do you know who he is?  He's with\n               Interpol, the Internation Police.  He's\n               a cop.\n\n<b>     A SLOW MOTION BEAT.\n</b>\n     Vincent and Deirdre don't know what to make of this, their\n     heads turn to look at Sam, and in this instant - The Tour\n     Group walks into their midst and - The 2nd Gunman reaches for\n     his piece and - Sam FIRES his gun at the 2nd Gunman, and with\n     the sharp report of the pistol we move back to REAL TIME, as -\n     The Crowd panics, screaming, and now Edvard is reaching for\n     his weapon, as - Sam shoots again, killing the 2nd Gunman,\n     and now - The Crowd is still screaming and running as -\n     Gregor shoves through the crowd into the exit, as -\n\n     Deirdre pushes through the crowd, and now she's made it into\n     the tunnel.  Now we go -\n\n<b>     OUTSIDE THE THEATER -\n</b>\n     Where Larry has heard the shot -- his piece is drawn, but\n     he's been ordered to stay in the car.  In frustration he\n     slams on the steering wheel, as we see that - Behind Larry,\n     the Watcher is slowly closing in, knife poised to strike as\n     we go back -\n\n<b>     INTO THE THEATER -\n</b>\n     Edvard tries to get to the exit, but there are too many\n     Tourists in his way, and he proceeds to shoot several of\n     them, including the Dad we saw earlier.  Seconds later,\n     Edvard has vanished into the tunnels, and now - Vincent and\n     Sam meet in the middle of the crowd.  There is time for a\n     QUICK BEAT, while Vincent glares at Sam.\n\n<b>                          VINCENT\n</b>               You're a cop...you're a fucking cop...I\n               should kill you.\n\n<b>                          SAM\n</b>               But you can't.\n\n     And now Sam runs into the tunnel, after the others, leaving\n     Vincent for a fraction of a second to sigh, and then follow\n     Sam into -\n\n<b>     THE TUNNELS -\n</b>\n     It's like being in the tunnels and ramps of a sporting arena.\n     Except that everything here is made of stone and the only\n     light comes from the sun which streams in through the exit\n     openings which are spaced far enough apart that they provide\n     just barely enough light for us to see.  Now we do a SERIES\n     OF QUICK CUTS - Sam running, followed by - Vincent, while -\n     Edvard takes a wrong turn down a dark hall and comes to a\n     dead end.  He turns around, looking for a way out as - Gregor\n     sees the final exit ahead of him as we go -\n\n     OUT IN THE STREET - Larry is still behind the wheel of the\n     Citroen, anxiously looking at the exit, not realizing that -\n     The Watches is almost on him, and now we're back -\n\n<b>     IN THE TUNNELS -\n</b>\n     Deirdre comes running around a corner, and now she's almost\n     reached the exit as -\n\n<b>     OUT IN THE STREET -\n</b>\n     Gregor hits the street running.  He doesn't notice the\n     Citroen parked ahead, because he's never seen it before, but\n     as he runs by -\n\n     The car door swings open and Gregor runs straight into it.\n     He smashes into the door and falls to the ground, injured.\n     Strong Hands reach out of the car and pull him in.  It's the\n     Watcher, and let's give him a name now because he needs one:\n     SEAMUS REILLY.  Seated in the front seat is - A very dead\n     Larry.  Seamus has cut his throat from ear to ear.\n\n<b>                          SEAMUS\n</b>                   (to Gregor, with an Irish\n                    accent)\n               If you want to live you'll do exactly as\n               I tell you.\n\n     THROUGH THE BACK WINDOW - Deirdre appears, exiting the\n     theater and running towards the Citroen as we go back to -\n\n<b>     INT. THE TUNNELS - SAME TIME\n</b>\n     Vincent, gun drawn, moves warily down one of the tunnels.\n     Outside we can hear the dim sound of an approaching siren.\n     Vincent turns a corner and - A GUN jams itself into his face.\n     It's Edvard.\n\n<b>                          EDVARD\n</b>               Where do I know you from?\n\n<b>                          VINCENT\n</b>               Vienna.\n\n<b>                          EDVARD\n</b>               Of course...I remember.  I quite liked\n               you, I'm sorry to have to do this.\n\n     Edvard's finger tightens around the trigger, when -\n\n<b>                          SAM (O.S.)\n</b>               Hey...\n\n     Edvard is startled by the sound of Sam's voice.  Even as he\n     squeezes off the shot, Edvard turns to look at Sam, and as he\n     does so, Vincent strikes out at the gun, sending the shot\n     awry, causing it to - RICOCHET wildly, whining around the\n     room, until it - Rips through Sam's side, a nasty wound but\n     not fatal, as - Edvard tries to fire another shot but it's\n     too late, because - Vincent fires a single shot to the head\n     that kills Edvard.\n\n<b>     EXT. OUTSIDE THE THEATER - MEANWHILE\n</b>\n     Deirdre has reached the Citroen.  She looks in and sees\n     Seamus and Gregor.  Lastly she looks at the dead Larry.  She\n     sighs in disgust, but otherwise doesn't react as if\n     surprised.\n\n<b>                          DEIRDRE\n</b>               Cold cocking the poor son-of-a-bitch\n               would have sufficed, Seamus, don't you\n               think?\n\n<b>     SCANT SECOND LATER -\n</b>\n     Larry's body hits the street as the Citroen drives off,\n     Deirdre behind the wheel just as - Sam and Vincent run out of\n     the theater, with Vincent helping a wounded Sam who bleeds\n     from the wound in his side.  They arrive at the street only\n     to see - Larry, lying dead in the street, even as the Citroen\n     speeds away from them, turning the corner before they can\n     even think to raise their guns.\n\n<b>                          VINCENT\n</b>               That double-crossing bitch.\n\n     Sam isn't even capable of saying that much -- he just stares\n     after the departed Citroen with a look on his face unlike any\n     we've seen in the film: \"how the hell did that happen?\"  But\n     there's no time to ponder this because they've been joined by\n     - A COP.  He's a local guy, he directs traffic and busts\n     drunks in the town square -- and he's scared shitless,\n     holding his gun in both hands, trying not to tremble, as he\n     stares back at - TWO GUNS, Sam's and Vincent's, and they're\n     both pointed at the Cop.  LONG BEAT.  In the way off distance,\n     another siren can just be heard.  Sam and Vincent glare at\n     the Cop, who strains with all his might to control himself,\n     but he can't because Sam and Vincent are death waiting to be\n     served.  The cop knows he has three seconds to make up his\n     mind.  Two.  One.  The Cop puts his gun on the ground and\n     steps back, raising his hands in the air.  Now - Sam and\n     Vincent stumble into the street, and are instantly almost hit\n     by - A CAR speeding around the corner, its Driver oblivious\n     to what's going on.  The car screeches to a halt, and the\n     Driver curses loudly in French.  And then the next thing the\n     Driver knows - A Gun is in his face.  The door is yanked open\n     and the Driver is yanked out, as we -\n\n<b>     CUT TO:\n</b>\n<b>     EXT. A BACK ROAD - LATER/EARLY EVENING\n</b>\n     The town of Orange is just visible below us as the\n     commandeered Car drives up into the hills.  Vincent is behind\n     the wheel, while the wounded Sam sits in the passenger seat.\n     Gritting his teeth, Sam peels back his shirt to get a look at\n     - THE WOUND, and it's small but bad -- the ricochet ripped a\n     small raw hole in Sam's side.  The wound bleeds, but\n     moderately so -- no major organs or arteries have been hit.\n\n<b>                          VINCENT\n</b>               That makes twice now you've saved my\n               life.\n\n<b>                          SAM\n</b>               I didn't save your life back there.\n               Risked it, maybe -- but I didn't save\n               shit.\n\n<b>                          VINCENT\n</b>               You see it your way, I'll see it mine.\n               You need a doctor.\n\n<b>                          SAM\n</b>                   (hopeful)\n               You know one around here?  Somebody you\n               trust?\n\n<b>                          VINCENT\n</b>               No...I thought I'd take you to the\n               hospital.\n\n<b>                          SAM\n</b>                   (sharply)\n               No hospitals.  I'll fix this myself if I\n               have to.\n\n<b>                          VINCENT\n</b>                   (he can't believe this)\n               Fix it yourself?\n                   (a thought comes to him)\n               Why are we even doing this?  There's no\n               need to run, Christ...\n                   (he can't disguise his disgust)\n               You're a cop.\n\n<b>                          SAM\n</b>               Not exactly.\n\n<b>                          VINCENT\n</b>               You're with Interpol -- you're a cop.\n\n<b>                          SAM\n</b>               If I was a cop, a real cop, I'd have\n               busted you a long time ago.  This isn't\n               about you, it's about the job I have to\n               do.\n\n<b>                          VINCENT\n</b>               And what job is that?\n\n<b>                          SAM\n</b>               My job, Vincent, a job you don't need to\n               know about.  I can't go to the local cops\n               -- they'd never be able to get close\n               enough at this point.  It's me or nobody,\n               and I've been on this job too goddamned\n               long not to finish.\n\n     BEAT.  Sam takes out his own pack of cigarettes, offers one\n     to Vincent and takes another for himself.  They smoke for a\n     second, before Vincent speaks.\n\n<b>                          VINCENT\n</b>               It looks to me like we're all that's left\n               of our group.\n\n<b>                          SAM\n</b>               We?  There is no we in my world now,\n               Vincent, just me.\n\n<b>                          VINCENT\n</b>               I'm going with you.\n\n<b>                          SAM\n</b>               This doesn't involve you, don't you\n               understand?  I can't even guarantee you\n               any money out of all this.\n\n<b>                          VINCENT\n</b>               It isn't about money for me, not\n               anymore.\n\n<b>                          SAM\n</b>               You don't have to do this.\n\n<b>                          VINCENT\n</b>                   (with great finality)\n               Yes I do.\n\n     Sam gives Vincent a look and shakes his head in disbelief --\n     Vincent's loyalty and sense of honor is something he's never\n     seen before, and Sam can only smoke in silence and consider\n     this as we -\n\n<b>     CUT TO:\n</b>\n<b>     INT. A CHEAP BACK ROOM - NIGHT\n</b>\n     A PEEPHOLE slides open, and we look through it into -\n\n<b>     INT. AN ADJOINING ROOM\n</b>\n     where Gregor sits, bound and gagged in a chair, his eyes wide\n     with fright.  Now - The Peephole snicks shut, and Deirdre\n     turns to face Seamus Reilly.\n\n<b>                          DEIRDRE\n</b>               When we're done with this, I want to do\n               for that one myself.\n\n<b>                          SEAMUS\n</b>               Now there's the Deirdre I know.\n\n<b>                          DEIRDRE\n</b>               And what's that supposed to mean, Seamus\n               Reilly?\n\n<b>                          SEAMUS\n</b>               It means I was worried that all the time\n               you spent away from the fold might have\n               affected you.  You've been living the\n               life of the hired gun -- the well paid\n               hired gun, I might note.  There's no\n               glory to it, but there are those that\n               like it.\n\n<b>                          DEIRDRE\n</b>               So you thought that maybe I'd grown too\n               attached to this charade I've been\n               playing, is that it?\n\n<b>                          SEAMUS\n</b>               It's been known to happen.\n\n<b>                          DEIRDRE\n</b>               Not to me, you know that.\n\n<b>                          SEAMUS\n</b>                   (goading her)\n               I thought I did.\n\n     Seamus's taunt works: Deirdre whips out her gun and puts it\n     to his head.\n\n<b>                          DEIRDRE\n</b>               I guess you don't know me, then, if you\n               think I won't kill you for an insult like\n               that!\n\n     Seamus glares at Deirdre for a moment, and she glares back at\n     him until he starts to laugh.\n\n<b>                          SEAMUS\n</b>               Just testing, lass.  Forgive me, but I\n               had to do it.\n\n     Deirdre glares a moment more and then puts away her gun.\n\n<b>                          DEIRDRE\n</b>               Remember what we agreed on, Seamus: when\n               we get home, I don't play \"the girl\"\n               again.\n\n     Deirdre gives Seamus a look to make sure this last point is\n     clear and we -\n\n<b>     CUT TO:\n</b>\n<b>     EXT. A FARMHOUSE - THE COUNTRY - NIGHT\n</b>\n     The Stolen Car parks behind a BARN, and Sam and Vincent get\n     out.  Waiting for them is a friend of Vincent's - JEAN-\n     PIERRE, a Frenchman in his forties, hearty, burly, friendly.\n\n<b>                          VINCENT\n</b>               Hello, Jean-Pierre.\n\n<b>                          JEAN-PIERRE\n</b>               Hello, my friend.\n                   (with a look at Sam)\n               He doesn't look French to me, Vincent.\n\n<b>                          SAM\n</b>               American.\n\n<b>                          JEAN-PIERRE\n</b>               Well, Vincent's American friend, shall we\n               see what we can do for you?\n\n<b>     INT. THE FARMHOUSE KITCHEN - LATER/NIGHT\n</b>\n     SURGICAL IMPLEMENTS - Are laid out on a clean cloth.\n     Scalpel, forceps, a clamp, a sponge, medical thread and\n     needles.  We PULL BACK TO REVEAL: Sam, stretched out on the\n     kitchen table.  Around him we see - Vincent and Jean-Pierre,\n     who are wearing rubber gloves and examining Sam's wound.\n     Jean-Pierre holds a mirror up so that Sam can see what's\n     going on.  Sam, with his medical training, is treating\n     himself.\n\n<b>                          VINCENT\n</b>                   (to Sam)\n               It's right there, beneath the surface.  I\n               can just make it out.\n\n     Sam is in terrible pain, but necessity dictates that he focus\n     on what's going on so that he can talk Vincent through this\n     next procedure.\n\n<b>                          JEAN-PIERRE\n</b>               Are you sure you won't have a drink?\n\n<b>                          SAM\n</b>                   (sharply)\n               No booze...Pain's in the mind, and the\n               mind I can control.\n                   (quick beat)\n               Alright, let's do it.\n\n     During this next sequence, we CUT BACK AND FORTH between\n     Sam's reactions to the surgery, and the mirror itself where\n     he's watching.\n\n<b>                          SAM\n</b>               Douse the wound with alcohol.\n\n     Vincent pours a healthy splash of rubbing alcohol onto the\n     wound and - Sam grits his teeth as the pain explodes up his\n     central nervous system.\n\n<b>                          SAM\n</b>                   (to Jean-Pierre)\n               Take that sponge and wipe away as much of\n               the blood as you can, keep it clean so I\n               can see.\n\n     Jean-Pierre does as Sam says, wiping away the blood that\n     keeps filling the wound.  Throughout the procedure Jean-\n     Pierre will do this; every time the sponge is saturated he\n     squeezes the excess blood into - A BUCKET which sits on the\n     floor, slowly filling up with drippings from the sponge.\n\n<b>                          SAM\n</b>                   (to Vincent)\n               Take the clamp...\n\n     Vincent picks up the clamp.\n\n<b>                          SAM\n</b>               Peel back the skin and attach the clamp.\n\n     Vincent attaches the clamp to Sam's wound.  It takes perhaps\n     fifteen seconds, and everyone of those seconds is agonizing\n     for Sam.  He sweats, he grits his teeth, he grunts the\n     smallest of grunts.  But he doesn't move.  Finally Vincent is\n     done.\n\n<b>                          VINCENT\n</b>               Alright, it's done.\n\n<b>                          SAM\n</b>               You see the bullet?\n\n<b>                          VINCENT\n</b>               Clearly.\n\n<b>                          SAM\n</b>               Good.  Now take the forceps, and\n               remember, Vincent, what we're doing here\n               is routine.  I've done stuff like this at\n               least twenty times in the field.  There\n               are no vital organs where you're working,\n               no major muscles or arteries -- you can't\n               kill me.  Just make sure you've got the\n               bullet before you try to pull it out.\n\n     Vincent probes the wound with the forceps.  This takes\n     probably thirty seconds, and it hurts even more then when the\n     clamp was attached.\n\n     Several times - Vincent seems to have the bullet in his\n     grasp, but it slips, and each time it slips - Sam makes the\n     smallest of noises, as if to indicate the level of the pain.\n     Finally - The forceps firmly grasp the bullet, and with a\n     single tug, Vincent extracts it.\n\n<b>                          VINCENT\n</b>                   (holding the bullet aloft)\n               A souvenir...\n\n     He tosses the bullet through the air, and we FOLLOW IT IN\n     SLOW MOTION as it lands in - A SAUCER, which sits on the\n     kitchen counter.  We're back in REAL TIME, as the bullet\n     rolls around the plate for a second before coming to a halt.\n     Now - Sam breathes the hugest of sighs, and his face relaxes.\n     Instantly, Vincent puts a lighted cigarette in Sam's mouth,\n     and he drags deeply on it.\n\n<b>                          SAM\n</b>                   (to Vincent)\n               You think you can stitch me up on you\n               own?\n\n<b>                          JEAN-PIERRE\n</b>               Don't worry, we'll take care of it.\n\n<b>                          SAM\n</b>               Then if you don't mind...\n                   (he hands the cigarette back to\n                    Vincent)\n               I'm gonna pass out.\n\n     And that's exactly what he does.\n\n<b>     A TIME CUT TO:\n</b>\n<b>     INT. FARMHOUSE LIVING ROOM - LATER THAT NIGHT\n</b>\n     Vincent and Jean-Pierre sit on easy chairs.  An open bottle\n     of wine sits between them, a FIRE burns in the fireplace, and\n     they smoke in a contented silence for a moment.  When they\n     speak, it is in FRENCH, with ENGLISH SUBTITLES.\n\n<b>                          JEAN-PIERRE\n</b>               He's tough, your American friend.\n\n<b>                          VINCENT\n</b>               Yes, Sam's tough alright.\n\n<b>                          JEAN-PIERRE\n</b>               And you respect him.\n\n<b>                          VINCENT\n</b>               Of course.  Don't you?\n\n<b>                          JEAN-PIERRE\n</b>               I've never seen a man who could have\n               taken what he just went through.\n                   (beat)\n               He's a cop?\n\n<b>                          VINCENT\n</b>                   (beat, trying to find a way to\n                    say it)\n               Not exactly.\n\n<b>                          JEAN-PIERRE\n</b>               Not exactly?  But close enough, eh?\n                   (beat)\n               So he saved your life, then?\n\n<b>                          VINCENT\n</b>               How did you know?\n\n<b>                          JEAN-PIERRE\n</b>               If he hadn't you'd have put a bullet in\n               his head a long time ago.\n\n     Both men stare back into the fireplace and we HOLD FOR A BEAT\n     before we -\n\n<b>     DISSOLVE TO:\n</b>\n<b>     INT. THE FARM - KITCHEN - DAWN\n</b>\n     Sam is awake.  Pale from the loss of blood, he moves softly\n     around the kitchen, searching professionally for something,\n     giving the moment a slightly dangerous feel because he seems\n     so intent on what he's doing and then he finds it - THE\n<b>     COFFEE.\n</b>\n<b>     TEN MINUTES LATER -\n</b>\n     A stream of Hot Coffee migles with a stream of Steamed Milk.\n\n<b>     EXT. THE FARMHOUSE PORCH - SUNRISE\n</b>\n     A STEAMING CUT OF COFFEE sits in Sam's hands as he lights a\n     cigarette to go with the coffee.  He sits on an ancient\n     chair, smoking in silence, looking out at - THE WOODS around\n     the house, and this place is postcard-beautiful, the French\n     Farmhouse you see only in pictures.  But Sam's mind is\n     elsewhere, he's staring into space, lost in thought.\n\n<b>                          JEAN-PIERRE (O.S.)\n</b>               You're feeling better?\n\n     ANOTHER ANGLE - Jean-Pierre stands in the open front door of\n     the farmhouse, with a cup of coffee.  Now, Jean-Pierre moves\n     out to join Sam, sitting down on another chair opposite him.\n\n<b>                          SAM\n</b>                   (responding to the question)\n               Some, thanks.  Enough to move on, for\n               now.\n\n<b>                          JEAN-PIERRE\n</b>                   (pointing at Sam's wounded\n                    side)\n               You should really let a doctor look at\n               that.\n\n<b>                          SAM\n</b>               Soon.\n\n<b>                          JEAN-PIERRE\n</b>               But first you have something to take care\n               of?\n\n<b>                          SAM\n</b>               Yeah.\n\n<b>                          JEAN-PIERRE\n</b>               Something important?  A thing that cannot\n               wait?\n\n<b>                          SAM\n</b>               It gets done now or not at all.  Another\n               couple of days and the parties concerned are\n               gone where I can't get them.\n\n<b>                          JEAN-PIERRE\n</b>               Forgive my intrusion into your affairs,\n               but I am the one who connected Vincent to\n               this job, his agent, if you will.  He is\n               one of my oldest friends and I owe him a\n               great debt, much like the debt I suspect\n               he owes you.\n\n<b>     A QUICK CUT TO:\n</b>\n<b>     INSIDE THE FARMHOUSE\n</b>\n     Where Vincent has just poured himself a cup of coffee and lit\n     a very satisfying cigarette when he hears the voices from\n     outside.\n\n<b>                          SAM (O.S.)\n</b>               Vincent doesn't owe me a thing.\n\n     Vincent looks up when he hears his name and he moves towards\n     the sound of the voices.\n\n<b>                          JEAN-PIERRE (O.S.)\n</b>               He sees this differently, as you well\n               know.\n\n<b>                          SAM (O.S.)\n</b>               I didn't expect that he would.\n\n<b>     BACK ON THE PORCH -\n</b>\n<b>                          JEAN-PIERRE\n</b>               You suffered through an agonizing pain\n               last night, pain you could have avoided\n               by declaring yourself an agent of the\n               law.\n\n<b>                          SAM\n</b>               Vincent told you that I'm a cop?\n\n<b>                          JEAN-PIERRE\n</b>               Not a word.  But no ordinary criminal\n               would have the extensive military and\n               medical expertise you do.  And so I place\n               the pieces of the puzzle together in a\n               way that makes sense to me.  You work for\n               some government agency and you carry a\n               gun, and in my world, that makes you a\n               cop.\n\n     And now Jean-Pierre produces a LONG BARRELED REVOLVER which\n     he places loosely in his lap -- a gesture which seems to say,\n     \"you'd better explain things to my satifaction or we're\n     gonna have a problem.\"  Sam notices the weapon, but he\n     doesn't react overtly.\n\n<b>                          SAM\n</b>               So this is what, a test?\n\n<b>                          JEAN-PIERRE\n</b>               Call it a reckoning of character.\n\n     BEAT.  Sam looks at the Revolver again.\n\n<b>                          SAM\n</b>               If I was healthy, I could take that away\n               from you.\n\n<b>                          JEAN-PIERRE\n</b>               Perhaps.  But you are not healthy, and if\n               you try I'll kill you.\n\n     QUICK CUT TO: Vincent - Who stands inside the house, out of\n     sight, but not out of ear shot.  He's listening to\n     everything, and we notice that Vincent has taken out his\n     own gun.\n\n     BACK ON Jean-Pierre and Sam.  By now Jean-Pierre has raised\n     the pistol.  He doesn't point it at Sam, but his finger cocks\n     the hammer.\n\n<b>                          SAM\n</b>               So what is it you want to know?\n\n<b>                          JEAN-PIERRE\n</b>               I suppose I want to know how a man like\n               you is created.\n\n<b>                          SAM\n</b>               Created?\n\n<b>                          JEAN-PIERRE\n</b>               Perhaps forged is a better word.  Like\n               steel.  Like a sword.  You're a modern\n               Samurai.  I've spent my life around\n               extraordinary men -- men like Vincent.\n               But I've never seen anyone like you.\n                   (beat)\n               I'm afraid Vincent will die if he goes\n               with you.\n\n<b>                          SAM\n</b>               Vincent's life is his own burden; he'll\n               have to carry it for himself.  And I'm\n               not any kind of Samurai.\n\n<b>                          JEAN-PIERRE\n</b>               You seem one to me.\n\n<b>                          SAM\n</b>               A Samurai has honor, a Samurai live by\n               the code of Bushido, the way of the\n               warrior.  I'm just a killer for hire.\n                   (beat)\n               The world isn't about honor, anymore.\n               It's about survival.\n\n     LONG BEAT.  Something in Sam's speech touches Jean-Pierre.\n     He relaxes his finger on the hammer.\n\n<b>                          JEAN-PIERRE\n</b>               Survival.  I suppose that's as good a\n               cause as any.\n\n     BACK ON Vincent - Who relaxes his grip on his gun. BACK ON\n     Sam and Jean-Pierre - And we're PULLING BACK, AWAY from the\n     Farmhouse, which glows in the morning sun as we -\n\n<b>     DISSOLVE TO:\n</b>\n<b>     EXT. A PARIS STREET - DAY\n</b>\n     A BLACK COMPACT CAR sits in front of a Parisian Post Office.\n     Inside the car, behind the wheel, we see Deirdre.  Now,\n     coming out of the Post Office, we see - Gregor and Seamus\n     Reilly.  Seamus has a coat slung over his arm, hiding the gun\n     which he keeps pressed to Gregor's side.  There's no sign of\n     the Briefcase as Seamus and Gregor get into -\n\n<b>     INT. THE CAR - SAM TIME\n</b>\n     THUNK!  The door slams shut.  Gregor and Seamus are in the\n     back seat.  Almost instantly Seamus angrily snaps a pair of\n     handcuffs on Gregor.  Immediately, Deirdre pulls out.\n\n<b>                          DEIRDRE\n</b>               Where's the case?\n\n<b>                          GREGOR\n</b>                   (nervous)\n               There's a problem...\n\n<b>                          SEAMUS\n</b>                   (jumping all over him)\n               Problem my ass!  I think you're lying to\n               me, and if you are you're a dead man!\n\n<b>                          DEIRDRE\n</b>               Would somebody tell me what fucking well\n               happened in there?\n\n<b>                          SEAMUS\n</b>                   (disgusted)\n               Nothing.\n\n<b>                          GREGOR\n</b>                   (eager to explain)\n               The package didn't come.  I'm sure it\n               will tomorrow.\n\n     Suddenly Seamus seems to lose it.  He grabs Gregor and slams\n     a gun against his head.\n\n<b>                          SEAMUS\n</b>                   (he's almost foaming at the\n                    mouth)\n               If you're lying to me you poor excuse for\n               a human being, I'm gonna blow your brains\n               all over this car.\n\n<b>                          GREGOR\n</b>                   (beyond desperate)\n               I swear, it has to come here!  It has\n               to...\n\n     BEAT.  For one tension-filled moment, we think Seamus is\n     going to splash Gregor's brains all over the place.  But then\n     he smiles, puts his weapon away, and pats Gregor gently on\n     the face.\n\n<b>                          SEAMUS\n</b>               Ease up, man...I'm just checking to make\n               sure you're on the level.\n\n     Gregor is beyond speech -- he can only whimper.\n\n<b>                          SEAMUS\n</b>               And it seems to me I saw a sign in there\n               that says they got a late afternoon\n               delivery.  Why don't we come back later\n               today and do this all over again, huh?\n\n     Seamus smiles a smile that is more than a little bit\n     sadistic.  Neither Gregor nor Deirdre smiles in return as we -\n\n<b>     CUT TO:\n</b>\n<b>     EXT. ANOTHER STREET - PARIS - DAY\n</b>\n     THE EIFFEL TOWER fills our eyes.  And then we PULL BACK TO\n     REVEAL that it's a tacky, flyblown poster on a dingy street.\n     And now we're -\n\n     MOVING DOWN the Street, until we come to a store whose sign\n     advertises in English - HONG KONG MOVIES.  The windows of the\n     store are filled with posters.  We MOVE THROUGH TO\n\n<b>     INT. THE STORE - SAME TIME\n</b>\n     TONY SIMON, an expatriate black American, runs this place and\n     lives above it.  His shelves are lined with action films made\n     in the Far East.  Tony knows everything there is to know\n     about the films he sells -- but he also knows quite a bit\n     about what's going on in the Parisian Underworld.  he's a\n     professional information broker.  Right now he's talking to a\n     CUSTOMER in perfect French, with English Subtitles.\n\n<b>                          TONY\n</b>               Hey, man, they're both great movies.  One\n               is more of a character study, the other\n               is more of a straight action thing, but\n               they're great movies, and he's an amazing\n               fucking filmmaker.\n\n     Tony looks up and sees something that catches his attention.\n\n<b>                          TONY\n</b>               Excuse me...\n\n     Vincent and Sam have entered the store.  Sam's ability to be\n     back on his feet in such a short time is amazing -- but we\n     can see that he's not the same guy he was at the start of the\n     film.  what he does from here on in he does by sheer force of\n     will.  Now - Tony moves to join them, and the conversation\n     immediately turns to English.\n\n<b>                          TONY\n</b>                   (to Vincent)\n               My man, how you doing?\n\n<b>                          VINCENT\n</b>               I'm alright.  And you?\n\n<b>                          TONY\n</b>               Doing well.\n                   (with a look at Sam)\n               This is?\n\n<b>                          VINCENT\n</b>               A friend.  I was telling him about how\n               you always have the latest tapes.\n\n<b>                          TONY\n</b>               Why don't we step into my office...\n\n     Tony's office, it turns out, is the area behind the COUNTER.\n     Tony raises a section of the counter that allows him to get\n     to the other side, and then he closes it behind him.\n\n<b>                          TONY\n</b>               So what can I do for you?\n\n     Vincent checks out the store before he starts speaking.  The\n     place is empty except for - The single Customer Tony was just\n     talking to.  The Customer is still considering the two films\n     Tony was showing him.\n\n<b>                          VINCENT\n</b>               I was wondering if you had any movies\n               that were particularly new.\n\n<b>                          TONY\n</b>               Matter of face there's this flick I've\n               been hearing about.  I haven't seen it,\n               but from what I hear it's pretty cool.\n\n<b>                          SAM\n</b>               What's the story?\n\n<b>                          TONY\n</b>               It's an international thing.  Several\n               different peoples involved, criminals\n               from all over the world, experts brought\n               together to do a job.  But maybe the most\n               interesting thing about it is that\n               preeminent in the plot we find the\n               Russian Mob and the IRA in bed together.\n               An unlikely group of partners.\n\n<b>                          VINCENT\n</b>               Do you have the tape?\n\n<b>                          TONY\n</b>               I might know where you could get a copy.\n\n     The Customer approaches the counter.  He has both tapes with\n     him.\n\n<b>                          TONY\n</b>                   (to Vincent and Sam)\n               Let me do some business with my boy here,\n               and I'll meet you across the street in\n               five.  I gotta make homes here feel like\n               he's getting a good deal while I give him\n               the pleasure of overpaying me for a\n               couple of second generation pirates.\n\n<b>     EXT. THE STREET OUTSIDE - A FEW MINUTES LATER\n</b>\n     The Customer exits, smiling and carrying his tapes -- what a\n     great fucking deal he just got!  A few seconds later, Tony\n     comes out and locks up the store front.  He crosses the\n     street towards -\n\n<b>     INT. A FALAFEL JOINT - A FEW MINUTES AFTER THAT\n</b>\n     A HUGE FALAFEL drips lettuce and tahini sauce from its end.\n     We PULL BACK ON - Tony, who's just taken a bite out of the\n     falafel.  He sits at a table in the back with Vincent and\n     Sam.\n\n<b>                          TONY\n</b>                   (his mouth full)\n               What I've heard so far, it's all a lot of\n               talk.  I wasn't so sure what to make of\n               it at first, cause, like I said, the\n               Irish and the Russians are an unlikely\n               mix.\n\n<b>                          VINCENT\n</b>               You said you might know where we can get\n               a copy of this tape?\n\n<b>                          TONY\n</b>               All depends on whether you want the\n               Russian or the Gaelic language version.\n\n<b>                          SAM\n</b>                   (instantly)\n               Gaelic.\n\n<b>                          TONY\n</b>               You sure?\n\n<b>                          SAM\n</b>               I'm sure.\n\n<b>                          VINCENT\n</b>                   (to Tony)\n               Can you get it?\n\n<b>                          TONY\n</b>               The Russian would be easier.\n\n<b>                          SAM\n</b>               Why's that?\n\n<b>                          TONY\n</b>               Cause the Russian production company\n               would be easier to find.\n\n<b>                          SAM\n</b>               It's the Irish tape we want.\n\n<b>                          TONY\n</b>                   (with a sigh)\n               Gonna be tough.\n\n     Tony scribbles something on a piece of paper.\n\n<b>                          TONY\n</b>               Last I heard there was a film rep for the\n               Irish players staying at this address,\n               name of Seamus Reilly.\n\n<b>                          SAM\n</b>                   (repeating it, he knows this\n                    name)\n               Seamus Reilly.\n\n<b>                          VINCENT\n</b>                   (to Sam)\n               You know him?\n\n<b>                          SAM\n</b>               I know of him.\n\n<b>                          TONY\n</b>               Seamus Reilly, boy's a serious Irish\n               Auteur -- a real firebrand.  Thinks his\n               more moderate filmmaking brethren have\n               turned to making movies for peace-loving\n               pussies, if you see what I'm saying.\n\n<b>                          VINCENT\n</b>               I get the picture.\n\n     Sam reaches for the piece of paper, but Vincent puts his hand\n     on top of it.\n\n<b>                          VINCENT\n</b>               Tony and I have to talk some business,\n               first.\n\n<b>                          TONY\n</b>               I gotta try and overcharge him, he has to\n               moan about the price, we settle somewhere\n               in the middle.\n\n<b>                          VINCENT\n</b>               It's a matter of respect.\n                   (to Sam)\n               Why don't you wait outside, this won't\n               take long.\n\n     Sam smiles slightly and rises from the table, moving towards\n     the exit.  Behind him in rapid-fire French, Tony and Vincent\n     are now discussing the price of the information.  They are\n     both loud and abusive, and obviously they're enjoying\n     themselves immensely.\n\n<b>     EXT. THE FALAFEL SHOP - A LITTLE LATER - DAY\n</b>\n     Vincent exits the shop and gets into -\n\n<b>     INT. THE PEUGEOT\n</b>\n     Where Sam sits in the passenger seat as Vincent slides behind\n     the wheel.  Vincent tosses Sam a piece of paper.\n\n<b>                          SAM\n</b>               The Irish representative?\n\n<b>                          VINCENT\n</b>               Yes.\n\n     Vincent gives Sam another piece of paper.\n\n<b>                          SAM\n</b>               What's this?\n\n<b>                          VINCENT\n</b>               The address of the Russian production\n               company.  Just in case we need to find\n               them.\n\n<b>                          SAM\n</b>               Thorough man.\n\n     Vincent starts the car and we -\n\n<b>     CUT TO:\n</b>\n<b>     EXT. A PARIS STREET - LATER - AFTERNOON\n</b>\n     The Peugeot sits, parked at a cub, a discreet distance from -\n     AN APARTMENT HOUSE: 35 Rue de Glacon.  We PUSH IN on the -\n\n<b>     INT. THE PEUGEOT - LATE AFTERNOON\n</b>\n     A PIECE OF PAPER scarwled with the same address: 35 de\n     Glacon.  We PULL BACK TO REVEAL -\n\n     Sam, holding this paper and looking out at the apartment\n     complex.\n\n<b>                          SAM\n</b>               You sure your friend got the right place?\n\n<b>                          VINCENT\n</b>               If Tony says this is it, then it's it.\n\n     BEAT.  Vincent wants to know something important.\n\n<b>                          VINCENT\n</b>               Tell me, Sam: why do you do this?\n\n<b>                          SAM\n</b>               Do what?\n\n<b>                          VINCENT\n</b>               Continue when it would be so much easier\n               to give it up.\n\n<b>                          SAM\n</b>               It's my job.\n\n<b>                          VINCENT\n</b>               Then quit.\n                   (beat)\n               You don't work for Interpol, Sam.\n\n<b>                          SAM\n</b>               Sure I do.  You heard him, you heard the\n               guy -- that's what he said, what Edvard\n               said.\n\n<b>                          VINCENT\n</b>               It's a cover, then.  A cover within a\n               cover, a feint within a feint.\n                   (quick beat)\n               You work for the CIA, it's the only\n               possible answer.\n\n     LONG BEAT.  Sam considers what to say, and then decides he\n     owes Vincent the truth.\n\n<b>                          SAM\n</b>               I'm a field agent -- last of an already\n               extinct breed.  I do dark ops.\n\n<b>                          VINCENT\n</b>               Dark ops?\n\n<b>                          SAM\n</b>               Dark operations.  Wet work.  Kidnaping.\n               Assassination.\n\n<b>                          VINCENT\n</b>               Very ugly.\n\n<b>                          SAM\n</b>               It is at that.\n\n<b>                          VINCENT\n</b>               Not very zen of you, huh?  Not so much\n               the modern Samurai after all.\n\n<b>                          SAM\n</b>               I never made that claim.\n\n<b>                          VINCENT\n</b>               I know.  Jean-Pierre did.\n\n<b>                          SAM\n</b>               You were behind the door?\n\n<b>                          VINCENT\n</b>               I was waiting to see what would happen.\n               I didn't want to kill him if I didn't\n               have to.\n\n<b>                          SAM\n</b>               You would have done that?\n\n<b>                          VINCENT\n</b>               I would have tried not to.  But yes, if\n               it would have kept him from shooting you,\n               I would have.\n\n<b>                          SAM\n</b>                   (almost to himself)\n               How could you have done that?\n\n<b>                          VINCENT\n</b>               Because I owe you.\n                   (he sees something)\n               Look at that...\n\n     THEIR POV: Through the Windsheild - Deirdre exits the\n     apartment building.\n\n<b>                          SAM (O.S.)\n</b>                   (quietly exultant)\n               All things come to those who wait.\n\n     Now Deirdre is followed by Seamus and Gregor.\n\n<b>                          VINCENT (O.S.)\n</b>                   (really surprised by this)\n               He's not dead.\n\n     BACK ON Sam and Vincent.\n\n<b>                          SAM\n</b>                   (figuring it out)\n               They don't have the package.\n\n<b>                          VINCENT\n</b>               You think?\n\n<b>                          SAM\n</b>               You said it yourself: Gregor's not dead.\n               If they had the package, they'd have\n               killed him.\n\n     Vincent and Sam exchange a look -- now they both figure it\n     out.\n\n<b>                          VINCENT &amp; SAM\n</b>                   (simultaneously)\n               They're going to get it.\n\n<b>     CUT TO:\n</b>\n<b>     INT. THE POST OFFICE - LATE AFTERNOON\n</b>\n     A HAND signs a receipt, and we PULL BACK TO REVEAL Gregor at\n     a counter, signing for his package, which slides across the\n     counter.  It's the Briefcase, although it's been wrapped in\n     BROWN PAPER for its journey through the French Postal System.\n     Now we see that - Seamus is still right beside Gregor; is, in\n     face, almost on top of him, with a hand in his coat pocket\n     which lets us know where his gun is.  Now - The two men start\n     to move towards the exit as we -\n\n<b>     CUT TO:\n</b>\n<b>     EXT. THE STREET OUTSIDE - A MINUTE LATER/LATE AFTERNOON\n</b>\n     The Black Compact Car idles at a nearby curb, with Deirdre\n     behind the wheel.  She's staring so intently at the front of\n     the post office, that she's surprised when a SHADOW falls\n     across her.  She looks up to see - Sam, standing next to the\n     car.  Deirdre starts to reach for her weapon, but Sam cuts\n     her off with a word.\n\n<b>                          SAM\n</b>               Don't do it...\n\n     Something in his voice conveys enough of a threat that she\n     backs off.  Now she and Sam exchange a long look.\n\n<b>                          DEIRDRE\n</b>               Well, if it isn't Mr. Interpol himself.\n                   (she really sounds betrayed)\n               I can't believe I misjudged you like I\n               did.\n\n<b>                          SAM\n</b>               Oh please..you're on some sort of holy\n               mission?\n\n<b>                          DEIRDRE\n</b>               I'm a patriate.\n\n<b>                          SAM\n</b>               Don't even think that I'm buying that.\n\n<b>                          DEIRDRE\n</b>               Where do you get off saying word one?\n               All the time pretending to be one of us,\n               it's the same thing we were doing, Seamus\n               and myself.  And here you are so high and\n               mighty, like you're so different from the\n               rest of us.\n\n<b>                          SAM\n</b>               I didn't say I was.\n\n<b>                          DEIRDRE\n</b>                   (she sees something)\n               Bloody fucking hell...\n\n     CUT AWAY TO: Gregor and Seamus are leaving the post office.\n     By now, Seamus has taken the package away from Gregor.\n     Unseen by these two men - Vincent is approaching from the\n     side, on an intercept course, his hand inside a bag which he\n     carries with him.  Now - Deirdre turns and shoots Sam a look.\n     He's still watching her keenly, and we can see that she's\n     aching to reach for her piece, but she can't because Sam is\n     still on her like a hawk.\n\n<b>                          SAM\n</b>               Don't even think it.\n\n     He pulls back the folds of his suit jacket, revealing his\n     gun, putting his hand comfortably on the pistol grip.\n\n<b>                          SAM\n</b>               I'd kill you before you had it halfway\n               out.\n\n     Vincent is closing on Gregor and Seamus, another ten seconds\n     and he'll have them.\n\n     Now - Deirdre looks back at Sam, then back at the situation\n     developing in front of her, and then suddenly - She slams the\n     car into gear and drives off, tires squealing while - Sam\n     pulls his piece, sighting down the barrel and - He can't do\n     it, can't shoot Deirdre.  Now - The sound of the car alerts\n     Seamus, who turns in time to see - Vincent, who is raising\n     the bag wrapped around his hand as - The car flies directly\n     at - Vincent, who if forced to jump out of the way even as he\n     pulls the trigger of the gun hidden within the bag.  The end\n     of the bag explodes in a burst of fire, but the shots are off\n     the mark - Missing Seamus and Gregor as - Vincent rolls out\n     of the way, just in time, while - Deirdre brakes the car to a\n     screaming halt, as Seamus pushes Gregor in ahead of him and\n     then gets in.  Seconds later, the car pulls out, even as -\n     Sam drives up in the Peugeot to Vincent, who picks himself up\n     off the ground and leaps into the car.  The last thing we\n     hear is the sound of Sam's Voice as the Peugeot drives off.\n\n<b>                          SAM (V.O.)\n</b>               Put your seatbelt on.\n\n<b>     CUT TO:\n</b>\n<b>     INT./EXT. - CAR CHASE MONTAGE\n</b>\n     During this SEQUENCE, we'll JUMP CUT BETWEEN the two cars and\n     the streets they travel through.  Now - The Black Compact Car\n     flies down a small street, followed closely by - The Peugeot,\n     where Sam is driving as Vincent tries to steady his gun to\n     get a clear shot at the other Car.\n\n<b>     INSIDE THE PEUGEOT -\n</b>\n<b>                          VINCENT\n</b>               What the fuck happened?\n\n<b>                          SAM\n</b>               I don't know...\n\n<b>                          VINCENT\n</b>               You don't know?  Bullshit, you had her,\n               there was no way out.\n\n<b>     IN THE COMPACT CAR -\n</b>\n     Where Deirdre is driving for dear life, while Seamus is\n     freaking out.\n\n<b>                          SEAMUS\n</b>               What in bloody hell is going on?\n\n<b>                          DEIRDRE\n</b>               They're part of the team.  One of them's\n               the guy I told you about.\n\n<b>                          SEAMUS\n</b>               From Interpol?\n\n<b>                          DEIRDRE\n</b>               That's him.\n\n<b>     IN THE PEUGEOT -\n</b>\n<b>                          VINCENT\n</b>               Why didn't you kill her?\n\n<b>     IN THE COMPACT -\n</b>\n<b>                          SEAMUS\n</b>               Why didn't you kill him?\n\n<b>     OUT IN THE STREET -\n</b>\n     The two cars SLAM through the traffic, heading for a HIGHWAY\n     RAMP which appears now perhaps two blocks away.\n\n<b>     IN THE PEUGEOT -\n</b>\n<b>                          VINCENT\n</b>                   (figuring it out)\n               You slept with her!\n\n<b>     IN THE COMPACT -\n</b>\n<b>                          SEAMUS\n</b>               How is it these fellahs managed to get\n               the drop on us?\n\n<b>                          DEIRDRE\n</b>               I told you: they're good...\n\n<b>     OUT IN THE STREET -\n</b>\n     THE TWO CARS have reached the highway ramp, and as first one,\n     and then the other pulls onto the highway, we PULL BACK AND\n<b>     UP TO REVEAL:\n</b>\n<b>     THE PERIFERIQUE -\n</b>\n     The massive and confusing highway system which encircles the\n     city of Paris.  Right away we notice that this entrance ramp\n     leads to a traffic circle, filled with various off ramps\n     which lead to no less than four different sections of the\n     Periferique.\n\n<b>     IN THE PEUGEOT -\n</b>\n<b>                          VINCENT\n</b>                   (slamming the dashboard in\n                    disgust)\n               You slept with her!\n\n<b>     IN THE COMPACT -\n</b>\n<b>                          SEAMUS\n</b>                   (lecturing Deridre)\n               You should have kill him when you had\n               the chance.  But no...\n\n<b>     IN THE PEUGEOT -\n</b>\n<b>                          VINCENT\n</b>               You put everything on the line because\n               you...\n\n<b>     IN THE COMPACT\n</b>\n<b>                          SEAMUS\n</b>                   (as if finishing Vincent's\n                    sentence)\n               You slept with the fucker!!\n\n<b>     ON THE PERIFERIQUE -\n</b>\n     THE PEUGEOT cruising on an upper part of the traffic circle,\n     while down below them - THE COMPACT turns towards one of the\n     roadways.\n\n<b>                     VINCENT (O.S.)\n</b>          Fuck...\n\n<b>     IN THE PEUGEOT -\n</b>\n<b>                          VINCENT\n</b>               Left left left!!!\n\n     Sam looks up and sees - Three possible ramps: one to the\n     right, one to the center, and one to the - Left.  At the last\n     second he takes the left turn as we go back to -\n\n<b>     IN THE COMPACT CAR -\n</b>\n     Where Seamus has turned from lecturing Deirdre to threatening\n     Gregor.  Seamus holds the package in one hand and his gun in\n     the other.\n\n<b>                          SEAMUS\n</b>                   (waving the package)\n               This better be the real thing or you're a\n               dead man!\n\n<b>                          GREGOR\n</b>               It is, I'm telling you it is!!\n\n<b>                          SEAMUS\n</b>               You've told me a lot of things, boyo...\n\n     ZING-SHATTER!  A BULLET blows a hole in their back windshield\n     as - The Peugeot is catching up, and Vincent is leaning out\n     of his window, firing away.  Now - Seamus turns to Deirdre.\n\n<b>                          SEAMUS\n</b>               Lose them!\n\n<b>                          DEIRDRE\n</b>               You lose them!\n\n     Deirdre swings the wheel wildly, and the Compact takes a\n     screaming turn, followed by - The Peugeot, and now they're\n     both speeding towards another junction, where several other\n     roadways of the Periferique run together.  Now we see that -\n     Seamus is returning Vincent's fire, even as - The Junction\n     approaches, and now - Seamus screams at Deirdre.\n\n<b>                          SEAMUS\n</b>               To the right!!!\n\n     Deirdre swerves to the right only to discover that she's now\n     on an -\n\n     EXIT RAMP, going against heavy traffic.  Now -\n\n     Deirdre swerves her car around, side-swiping several cars,\n     but avoiding a major crash while - The Peugeot follows along,\n     and now -\n\n     One of the cars that Deirdre side-swiped careens wildly down\n     the ramp, crashing into - The Peugeot, which grinds to a halt\n     as Vincent and Sam bounce forward in their seats, restrained\n     by their seatbelts.  The car has stalled, and Sam has to\n     start her up again and slam it into gear before following\n     after - The Compact, which now has a lead of perhaps fifty\n     yards -- but at least it's possible for the Peugeot to follow\n     after the Compact, because it's the only car on the highway\n     ahead of them that's GOING THE WRONG WAY, and now we - PULL\n     BACK, LOOKING DOWN FROM ABOVE, and the two cars are flying\n     through the rush-hour traffic, going the wrong way, and now -\n     The Peugeot is gaining ground as Sam turns to Vincent.\n\n<b>                          SAM\n</b>               Give me a cigarette.\n\n<b>                          VINCENT\n</b>               Right now?\n\n<b>                          SAM\n</b>               Gimme a goddamn cigarette!!!!\n\n<b>                          VINCENT\n</b>                   (fumbling with a cigarette)\n               Why are you driving?\n                   (rapid fire)\n               You're not French, you don't live here,\n               you don't know these roads.  Why are you\n               driving?\n\n     He puts the cigarette in Sam's mouth and as he does - The\n     Peugeot weaves in and out of the traffic, gaining ground on\n     the Compact, and now - SCREEEEECCHHH!!!!  About fifteen cars\n     pile up, crashing into one another, and yet somehow - The\n     Compact Car emerges from the pile up unscathed, and Seamus\n     breathes a hugh sigh of relief.\n\n<b>                          SEAMUS\n</b>               About time!\n\n<b>                          DEIRDRE\n</b>                   (glancing in her mirror) \n               Not yet...\n\n     The Peugeot has also managed to avoid the pile-up, and it's\n     back on their tail.\n\n<b>                          SEAMUS\n</b>                   (practically tearing his hair)\n               Good Christ!  Can't you lose these\n               jokers?\n\n<b>                          DEIRDRE\n</b>                   (through clenched teeth)\n               They're good!\n\n     And now the Peugeot SLAMS into the side of the Compact Car,\n     and as it does - Seamus opens fire with his gun, even as -\n     Vincent unloads the better part of a clip as - Glass shatters\n     in both cars, and now Deirdre looks up to see -\n\n     A FORK IN THE ROAD, and the left side of the fork is closed\n     off, blocked by - A SERIOUS CONCRETE BARRICADE, and the\n     Compact Car is headed right for it, and now -\n\n     Sam has the Peugeot pinned right to the side of the Compact\n     Car, metal against metal, a scream of steel as the Barricade\n     rushes straight at them and at the last second - Deirdre\n     slams on the brakes as -\n\n     Seamus fires one last shot that - blows out the window in\n     front of Sam's eyes, causing Sam to - Jerk the wheel of the\n     Peugeot wildly, spinning out of control onto the exit ramp as\n     Gregor reaches over and unbuckles Seamus's seatbelt right as -\n     The Compact Car slams into the Barricade and CRASHES, and\n     we're in SLOW MOTION as -\n\n     Deirdre is driven forward by the force of the impact, but\n     there's a driver's side air bag, and it explodes, cushioning\n     her, even as -\n\n     Seamus is hurled form the car, crashing through the\n     windshield and flying through the air as -\n\n     The Compact Car flips over and over and over while -\n\n     Gregor, who is wearing his seatbelt, hangs on for dear life\n     to the Briefcase, which he grabbed back from Seamus before\n     the crash, and now -\n\n     Seamus hits the ground with a terrible thud, his face\n     sliced to ribbons by the windshield, but somehow still alive\n     as -\n\n     Sam tries to control the Peugeot, which is in a spin on the\n     exit ramp as -\n\n     Gregor kicks open the back door and slides out of the Car,\n     carrying the Briefcase with him, as -\n\n     Deirdre struggles to free herself from the wreck, which is\n     now - On fire, and now -\n\n     Sam has managed to stop the Peugeot, but it's too late to go\n     back, because -\n\n     A VERITABLE FLEET OF COP CARS is now closing on the accident,\n     and it's too late to turn around, and even as -\n\n     Deirdre manages to pull herself out of the wreck, it -\n     EXPLODES into a ball of fire, and the blast wave of fire -\n     Hits Seamus, knocking him down, covering him for a second,\n     even as - Deirdre hurls herself through the flames and comes\n     out - Rolling away with Seamus, who is now not only cut to\n     pieces, but his face is covered with some hideous burns.\n\n     Now Deirdre pulls Seamus over the side of the embankment,\n     right before the cops arrive, and the two of them roll/fall\n     almost thirty down a steep incline, even as -\n\n     Sam catches a quick glimpse of -\n\n     Gregor, scurrying away from the highway, carrying the\n     Briefcase, and now Sam has to gun his car and get gone,\n     because the Cops have reached -\n\n     The Wreck, which is quickly burning itself out, and as the\n     Cops look into the debris they see that -\n\n     THERE'S NOBODY LEFT.  Everybody's gone.\n\n<b>     FADE OUT.\n</b>\n<b>                          VINCENT (V.O.)\n</b>               We don't have much time.\n\n<b>     FADE IN ON:\n</b>\n<b>     INT. VINCENT'S APARTMENT - NIGHT\n</b>\n     A FRONT DOOR, guarded by about five heavy locks, opens and\n     Vincent and Sam enter.  Sam looks around and surveys the\n     apartment.\n\n<b>                          SAM\n</b>               Nice place.\n\n     ANOTHER ANGLE - And we see the rest of the apartment: there's\n     practically nothing here.  A table with a couple of chairs, a\n     fridge.  An open door leads to a bedroom with a small, spare\n     bed and a nightstand with a cheap lamp.\n\n<b>                          VINCENT\n</b>                   (by way of explaining)\n               I'm not here very much.\n\n<b>                          SAM\n</b>               Business keeps you on the road?\n\n<b>                          VINCENT\n</b>               Something like that.\n\n     The two men crass the room towards - A METAL CABINET which is\n     tucked into a nook in the wall - VINCENT'S HAND turns a heavy-\n     duty COMBINATION LOCK and then: Click, the cabinet opens and\n     we see -- WEAPONS.  An endless cache of guns, knives,\n     explosives, surveillance devices, gun scopes -- you name it,\n     it's here.  Now Vincent's Hands reach into the cabinet and\n     start taking out weapons.  We PULL BACK ON -\n\n     Vincent, who gives the weapons to Sam.  Sam checks to make\n     sure the weapons are loaded and/or ready for use, and then\n     piles them, one on top of the other.\n\n<b>                          SAM\n</b>               I know I don't need to say this to you,\n               but I need to say it to you.\n                   (beat)\n               This is my job, I have to do it.\n\n<b>                          VINCENT\n</b>               So I do it.\n\n<b>                          SAM\n</b>               No you don't, and you know it.\n\n<b>                          VINCENT\n</b>               If our positions were reversed, would you\n               leave me?\n\n<b>                          SAM\n</b>                   (he says this too quickly)\n               In a minute.\n\n<b>                          VINCENT\n</b>               I think not.\n\n     BEAT.  Sam can't say anything, because he knows that what\n     Vincent is saying is true.\n\n<b>                          VINCENT\n</b>                   (considering the weapons)\n               Do we need anything else?\n\n<b>                          SAM\n</b>               Yeah.  We need out fucking heads examined.\n\n     Vincent thinks about this for a seoncd -- and then burst out\n     laughing as we -\n\n<b>     CUT TO:\n</b>\n<b>     INT. ANOTHER CAR - MEANWHILE/NIGHT\n</b>\n     Deirdre once behind the wheel.  The passenger seat next to\n     her is empty, but as she drives we can see her eyes as they\n     flick from the road in front of her, to the rearview mirror,\n     which reveals -\n\n     A glimpse of the HIDEOUS FACE of Seamus Reilly.  Crashing\n     through the windshield and the blast of fire have forever\n     changed the way he looks: his face is now a mass of oozing\n     wounds and burn tissue.  In his eyes we see the light of a\n     sick, twisted man who's gone over the edge.\n\n<b>                          DEIRDRE\n</b>               You better be careful, Seamus, before\n               something happens a plastic surgeon can't\n               fix.\n\n<b>                          SEAMUS\n</b>                   (a hideous laugh)\n               Plastic fucking surgeon?\n                   (indicates his face)\n               You think I'm going to fix this, Deirdre\n               lass?  It's the mark of the patriot, and\n               I'll wear it like a badge.  As for those\n               who done it to me, I'll take my pound of\n               flesh before this is all over.\n\n<b>                          DEIRDRE\n</b>               You're thinking with your gun, Seamus,\n               and not your head...\n\n<b>                          SEAMUS\n</b>                   (losing it)\n               Shut up!!!\n                   (he puts a gun to her head)\n               Shut up and drive!  I'm your superior\n               officer and you will do as I goddamn well\n               say, is that understood?!?\n\n     BEAT.  Deirdre bristles at Seamus's words but says nothing.\n\n<b>                          SEAMUS\n</b>               Do I need to repeat myself?\n\n<b>                          DEIRDRE\n</b>               No, Seamus.  I heard you the first time.\n\n<b>     EXT. OUTSIDE THE CAR - SAME TIME\n</b>\n     THE CAR zooms off into the night and as it does -\n\n     A LIGHT RAIN starts to fall and we -\n\n<b>     DISSOLVE TO:\n</b>\n<b>     EXT. A CHATEAU OUTSIDE OF PARIS - NIGHT\n</b>\n     THE SAME RAIN falls, more of a steady mist than a rain.  The\n     mist GLEAMS electrically in the THOUSAND WATT LIGHTS which\n     shine from - THE CHATEAU.  Hundreds of years old, it sits far\n     back from its own MAIN GATE.  In front of the Chateau - ARMED\n     MEN.  Lots of them.  Whatever this place is, it's not one\n     that invites company.  Now we're - MOVING TOWARDS the\n     Chateau, and as we MOVE we get a glimpse of the surrounding\n     environment: ancient statues, sitting benches in private\n     gardens, small pools of fish -- you name it, this place has\n     it.  We hear VOICES, and they're talking in - RUSSIAN.\n     Heavy, thick Russian, punctuated with words like \"Da!\" and\n     \"Nyet!\" -- making it clear that we've reached the address of\n     the Russian Production Company.  BEHIND THE CHATEAU - MORE\n     GARDENS, more everything.  It's well-patrolled, but there\n     aren't quite as many guards back here as there are out front,\n     because bordering the chateau is a natural fotress -\n\n<b>     A WOODS -\n</b>\n     A forest, really.  Filled with ancient trees, almost mythic\n     in appearance, and for all the light of the chateau this\n     place is darkness visible -- light comes here and dies.  And\n     in this woods, looking out, we find - Vincent and Sam.\n     Heavily armed, they've just humped God knows how many miles\n     through the woods to get here.  Both men exhausted from the\n     walk -- Sam from his wound, Vincent from his smoking habit.\n     They collapse and Vincent takes out his cigarettes.  Even\n     though they're screened from the chateau back here, Sam\n     reaches over and takes the cigarettes out of Vincent's hands.\n\n<b>                          SAM\n</b>               Not here.  They might see it.\n\n<b>                          VINCENT\n</b>               If I'm going to die for the CIA, I'm\n               going to go out smoking.\n                   (takes the cigarettes back and\n                    lights one)\n               Besides, there's half a forest between us\n               and them, they can't see a goddamned\n               thing.\n\n     Vincent offers one to Sam, who declines with a shake of\n     his head.\n\n<b>                          SAM\n</b>               Time to quit.\n\n<b>                          VINCENT\n</b>               Just like that?\n\n<b>                          SAM\n</b>               Not just like that... Just before I turn\n               around and it's six months from now and\n               the first thing I do when I wake up in\n               the morning is light a cigarette.\n\n<b>                          VINCENT\n</b>                   (obviously he does this)\n               What of it?\n                   (almost to himself)\n               Samurai pain in the ass.\n\n<b>                          SAM\n</b>                   (he hates this)\n               Would you stop with that...\n\n<b>                          VINCENT\n</b>               Why?  You've got more force of will than\n               anyone I've ever seen.  You handle a gun\n               like it's a part of you, you perform\n               surgery on yourself without anesthesia...\n                   (quick beat)\n               And most amazing of all, you quit\n               smoking, just like that.\n\n<b>                          SAM\n</b>                   (qith a cynical laugh)\n               The mark of a true Samurai.\n                   (seriously)\n               What I do for the Company, Vincent, is no\n               different than what you do.  We're both\n               hired guns, and this is a job -- like any\n               other job.\n\n<b>                          VINCENT\n</b>               Why then, Sam, don't you act like this is\n               a job like any other?  Surely, if you are\n               a hired gun, you realize that some times\n               you just have to walk away without\n               getting what you came for.\n\n<b>                          SAM\n</b>               Because I don't walk away.\n\n<b>                          VINCENT\n</b>               Why not?\n\n<b>                          SAM\n</b>               It's the one thing I've got left to hold\n               onto.\n                   (beat)\n               Jean-Pierre is one of your closest\n               friends, is he not?\n\n<b>                          VINCENT\n</b>               Closest and oldest.\n\n<b>                          SAM\n</b>               And yet you would have killed him to save\n               my life.\n                   (quick beat)\n               You have a sense of honor, Vincent, that\n               I can't even remember anymore.  I don't\n               know that I ever even had it to begin\n               with.  All I know to do, Vincent, is to\n               finish my job.\n\n<b>                          VINCENT\n</b>               And when you finish?  What then?  This\n               package, whatever it is, do you give it\n               to the CIA?  Do you really think they\n               deserve it?\n\n<b>                          SAM\n</b>               That's a good question.\n\n<b>                          VINCENT\n</b>               Do you have a good answer?\n\n<b>                          SAM\n</b>                   (he's really just considering\n                    this)\n               No, I don't.\n\n<b>     INT. THE CHATEAU - MEANWHILE\n</b>\n     ARMED RUSSIAN MOBSTERS everywhere -- a convention of the goon\n     squad.\n\n     MOVING THROUGH the Chateau itself, and from in here we see\n     the side of France we haven't yet seen in this film: culture.\n     Each room could be a museum, as we move through -\n\n     A GALLERY, filled with paintings by Renaissance Masters -\n\n     A PARLOR, with antique furniture, the youngest piece of which\n     is two hundred years old -\n\n     A BALLROOM, empty and barren, but lit by the dazzling light\n     of an exquisite chandelier -\n\n     A KITCHEN, where a cigarette smoking CHEF is putting the\n     finishing touches on what is perhaps the most amazing meal\n     you've ever seen.  Now - A SERVANT takes the tray and carries\n     it out to -\n\n     A DINING ROOM, and the table is set for a formal dinner for\n     twenty, with crystal and china at every place setting, and\n     yet the table is occupied by only one man -\n\n     MIKHAEL RACHEV, Russian Gangster Supreme, called Mikhi.  Now -\n\n     The Servant sets the food down in front of Mikhi, and as this\n     chief hood starts to eat a lonely and solitary dinner we PULL\n     BACK, MOVING DOWN the length of the way-too-long table.\n\n<b>     EXT. THE CHATEAU WALLS - NIGHT\n</b>\n     A TAXI pulls up to the Main Gate and Gregor gets out.\n     Attached to his wrist, by that same handcuff: the Briefcase.\n     Gregor is admitted by a Guard as we -\n\n<b>     CUT TO:\n</b>\n<b>     INT. THE DINING ROOM/CHATEAU - A LITTLE LATER\n</b>\n     Mikhi the Gangster is eating his dinner as Gregor is ushered\n     into the room.  THREE THUGS hang back behind Gregor, watching\n     to see what Mikhi wants.  Now -\n\n     Mikhi waves the Thugs out of the room, leaving Gregor alone\n     with the gangster.  Mikhi takes a last few bites of dinner as\n     he motions for Gregor to sit.\n\n<b>                          MIKHI\n</b>                   (in Russian, English subtitles)\n               Sit, sit...\n                   (offering a cigarette)\n               Would you like one?\n\n<b>                          GREGOR\n</b>                   (in English)\n               No, Mikhi, I wouldn't.\n                   (letting that sink in for a\n                    minute)\n               Since I won't speak your language, and\n               you can't speak mine, English will do\n               nicely.\n\n<b>                          MIKHI\n</b>                   (makes no never mind to him)\n               Whatever you wish...\n                   (lights his own cigarette)\n               This has all been a terrible mistake,\n               Gregor.  I wanted to play straight with\n               you, but Edvard insisted we try and kill\n               you.\n\n<b>                          GREGOR\n</b>               Edvard said the same thing about you\n               before he died.\n\n<b>                          MIKHI\n</b>               I'm shocked, shocked to think that you'd\n               believe him.\n\n<b>                          GREGOR\n</b>                   (suddenly sharp)\n               Enough!\n\n     Gregor raises the Briefcase which is still attached to his\n     wrist via the handcuff.  Gregor rests the Briefcase on the\n     table.\n\n<b>                          MIKHI\n</b>               Ahh...\n\n     The moment of truth.  Before this scene can develop any\n     further, a VOICE comes from Off Screen, and as the Voice\n     speaks, Gregor blanches.\n\n<b>                          SEAMUS (O.S.)\n</b>               The moment of truth, is it?\n\n     ANOTHER ANGLE - Deirdre and Seamus have entered the room.\n     And we notice something unusual: nobody is alarmed (except\n     for Gregor, that is).  It's as if they were expected.\n\n<b>                          GREGOR\n</b>               What is he doing here?\n\n     As Seamus speaks he walks through the room, examining the\n     valuable china and crystal, all the while moving inexorably\n     closer to Gregor.  His face is, if anything, even more\n     horrific than it was a short while ago, as his formerly fresh\n     wounds have started to scab over.\n\n<b>                          SEAMUS\n</b>               What am I doing here?  Why, I'm here to\n               see my partners, Gregor, the boys in the\n               Russian Mafia.  See, your bosses had\n               hoped to screw me by hiring you to pull\n               your thieving double cross.  But they\n               only just found out that what's in the\n               briefcase is completely useless without\n               me.  I can't fight them, and they can't\n               kill me -- that means we're gonna have to\n               do business together.\n\n<b>                          GREGOR\n</b>               But you hate each other!\n\n<b>                          SEAMUS\n</b>               What's a little hate between business\n               partners?\n\n<b>     EXT. THE WOODS - MEANWHILE\n</b>\n     Vincent's CIGARETTE is stubbed into a rock and the two men\n     rise with a slow purpose.  They exchange a look and then Sam\n     steps forward, leading the way\n\n<b>                          SAM\n</b>               I'm on point, Vincent.\n\n<b>     A WIDE ANGLE - THE BACK LAWN OF THE CHATEAU -\n</b>\n     Pure Kurosawa.  The JAPANESE DRUM we've heard before starts\n     to play again as -\n\n     THE LONG SHADOWS of Sam and Vincent come out of the woods and\n     into the brilliant light of the back lawn.  For one minute\n     they stand still, and among the many weapons that Sam carries\n     is a long automatic rifle, strung over his back, and in the\n     SILHOUETTE for one minute it looks like a Samurai sword.  Now\n     the two men start to move across the lawn, hugging the\n     shadows of the various statues and hedges, trying to keep\n     from being discovered for as long as possible.\n\n<b>     BACK IN THE DINING ROOM -\n</b>\n<b>                          GREGOR\n</b>                   (to Seamus)\n               So, you've got it all figured, do you?\n\n<b>                          SEAMUS\n</b>               Figured enough to know there's an odd man\n               out and I'm looking at him.\n\n<b>                          GREGOR\n</b>               I think not.\n                   (holds up the Briefcase)\n               I have, of course, taken the precaution\n               of wiring the briefcase to explode five\n               seconds after it opens.  Unless, of\n               course, I deactivate it before it goes\n               off.\n\n<b>                          DEIRDRE\n</b>                   (under her breath)\n               That fucking figures...\n\n<b>                          GREGOR\n</b>               Should any of you decide to rush me, I'll\n               kill myself and whoever happens to be\n               near me at the time.\n\n<b>                          MIKHI\n</b>               And more importantly --\n\n<b>                          GREGOR\n</b>               I'll destroy whatever's in the case.\n\n     BEAT.  Nobody moves.  Nobody speaks.  Until finally -\n\n<b>                          SEAMUS\n</b>               It looks, Gentlemen, as if we're gonna\n               have to sit down to table and work out an\n               agreement.\n\n     Before this entirely too-weird scenario can play itself we go\n     back to -\n\n<b>     THE BACK LAWN OF THE CHATEAU -\n</b>\n     Sam and Vincent are closer to the Chateau, moving in stealth,\n     avoiding any entanglements and then Sam turns a corner and\n     comes face to face with - A GUARD, and his gun is aimed at\n     Sam's head: Sam's a dead man as we go -\n\n<b>     BACK TO THE DINING ROOM\n</b>\n     AUTOMATIC WEAPONS FIRE splits the night, and everyone in the\n     room looks at one another, before Mikhi speaks.\n\n<b>                          MIKHI\n</b>               What was that?\n\n<b>     BACK OUTSIDE THE CHATEAU -\n</b>\n     The Guard who had Sam in his sights falls down, dead, shot by\n     - Vincent, whose smoking weapon is cradled in his arms.\n     Vincent smiles at Sam.\n\n<b>                          VINCENT\n</b>               That's one less I owe you...\n\n     Sam smiles, but it's no time to get satisfied.  their\n     presence revealed, there's no point in moving quietly.  Sam\n     draws his weapons and as he and Vincent charge across the\n     lawn towards the Chateau while -\n\n<b>     BACK IN THE DINING ROOM -\n</b>\n     MORE GUNSHOTS from outside -- not a war, but enough to cause\n     serious alarm.  Deirdre, ever the soldier, draws her two\n     automatic pistols.\n\n<b>                          DEIRDRE\n</b>                   (to Seamus and Mikhi)\n               You two stay here and watch our mutual\n               interest.\n\n     She nods at Gregor and his Briefcase, indicating what this\n     mutual interest is.  Then she turns and bolts the room, and\n     as she does we're -\n\n<b>     BACK OUTSIDE THE CHATEAU -\n</b>\n     Sam and Vincent are running along, hugging the ground and\n     whatever darkness they can find, while blind weapons fire\n     rips into the ground around them, Russian thugs not even sure\n     what they're shooting at, but shooting all the same as Sam\n     and Vincent hurtle towards -\n\n<b>     A BACK ENTRANCE TO THE CHATEAU -\n</b>\n     Some kind of kitchen storage area, and as Sam and Vincent\n     burst in from outside - FIVE RUSSIAN HOODS come flying in\n     from an interior entrance, and this is it, Sam and Vincent\n     are outnumbered, outgunned, they're going to die and then -\n     They take out the entire room - Sam holds an automatic pistol\n     in his left hand, and a submachine gun in his right, and when\n     he fires, he does so in short controlled bursts, firing only\n     when he has the target in his sights, while - Vincent fights\n     with a kind of sheer force, a shotgun in one hand, an Uzi in\n     the other, he fires at anything and everything that moves,\n     and he hits almost all of it - And suddenly the room is\n     quiet.  Everybody's dead except for Sam and Vincent.  They\n     drop their spent weapons and take out fresh ones even as they\n     move towards - THE DOOR - It leads to two passages, each one\n     leading to a separate wing of the chateau.\n\n<b>                          SAM\n</b>               Let's work our way through the building.\n               I'll take one wing, you take the other.\n\n     Vincent and Sam split up, moving into separate WINGS of the\n     Chateau, and as they move off Sam speaks a word of warning.\n\n<b>                          SAM\n</b>               Watch your back, Vincent.\n\n     And then they're gone, and we're with -\n\n     Deirdre, who's running through the house, going from room to\n     room, and we're with her for a minute, the JAPANESE DRUM\n     starts to play again, and now it's joined by more and more\n     drums, and they continue for the test of this sequence and\n     suddenly - A HUGE BURST OF GUNFIRE is heard, dragging\n     Deirdre's attention towards -\n\n<b>     THE BALLROOM -\n</b>\n     And Sam's in the middle of a pitched battle with three\n     Gunmen.  He kills the first, and then the second, and then -\n     No third.  The Third Gunman rolls out of the way as Sam\n     fires, the Third Gunman fires back and - Their shots go wide,\n     ripping into mirrors and chandeliers, littering the floor\n     with glass.  And now we're -\n\n<b>     ON DEIRDRE -\n</b>\n     Running through the halls as we hear one last burst of\n     gunfire: somebody in the ballroom is dead.  Deirdre has\n     almost reached the ballroom when - Sam comes flying out, and\n     the two of them CRASH TOGETHER, sending the two of them\n     sprawling into - The shot-up mess that used to be the\n     Ballroom - And as they crash to the ground, Sam loses his\n     weapon in the fall, but Deirdre manages to hold onto one of\n     her two guns.  Now the two of them roll to their feet, and as\n     they do we're back in -\n\n<b>     THE DINING ROOM -\n</b>\n     Seamus the Madman is pacing the floor, his face even worse\n     than before: with each minute the mask of flesh that is now\n     his face is becoming more grotesque.  Little pustules have\n     started to form all over its surface, oozing a whitish\n     viscous liquid.  A NEW BURST OF FIGHTING SOUNDS can be heard,\n     and Seamus, who is no longer capable of thinking straight,\n     loses it.\n\n<b>                          SEAMUS\n</b>               I can't take it anymore.\n                   (to Mikhi)\n               Watch him, man, I'm going out and finish\n               what needs finishing!\n\n     And Seamus is gone, and so are we -- back to -\n\n<b>     THE BALLROOM -\n</b>\n     Where Deirdre has her two guns pointed at Sam and - Does nothing.\n<b>     BEAT.\n</b>\n<b>                          SAM\n</b>               Go on, them...\n\n     But Deirdre can't do it.  There's something between these\n     two, and now - Sam looks around and sees Deirdre's other\n     pistol lying on a broken chair, and now he -\n\n     Kicks out with his foot and hits the chair leg, causing it to\n     function as a lever, sending the gun - THROUGH THE AIR in a\n     graceful SLOW-MO arc until it - THWACKS into Sam's Hand.  Now\n     he's armed and he looks back at - Deirdre.  Her FINGER\n     tightens on the trigger, she's almost ready to shoot -- if\n     Sam raises his piece, he's a dead man.\n\n<b>                          DEIRDRE\n</b>               Let it go, Sam, walk away.\n\n     In response Sam stares at Deirdre for a BEAT and then he\n     smiles an enigmatic smile and - He steps sideways, into a\n     nearby corridor, vanishing.\n\n<b>                          DEIRDRE\n</b>               God damn it!\n\n     She runs after him but she's too late -- The corridor outside\n     is empty.  Now we're back in -\n\n<b>     THE DINING ROOM -\n</b>\n     With Gregor and Mikhi, and the tension is unbearable, because\n     they can hear the sounds of the fighting as it starts and\n     then stops, but they don't have the least idea of what's\n     going on.  Still, Mikhi won't let Gregor leave without giving\n     up the Briefcase.  Mikhi has a gun on Gregor, who in turn\n     holds the Briefcase close, ready to open it and set off the 5\n     Second Timer that will blow it up.\n\n<b>                          GREGOR\n</b>                   (a feral hiss)\n               We'll die if we stay here!\n\n<b>                          MIKHI\n</b>                   (threatening with the gun)\n               You'll die if you leave here.\n\n     Gregor sits back down, fairly close to Mikhi.  Then, in a\n     manner so deft that Mikhi never even notices, Gregor extracts\n     a wickedly thin stiletto blade from the leather lining of the\n     Briefcase.  Before Mikhi can even react, Gregor stabs his arm\n     forward in a savage arc - JAMMING THE BLADE into Mikhi's\n     throat.  Mikhi drops his gun and reaches for the blade,\n     already gagging on the blood spray which shoots from the\n     slashed artery.  Within seconds - Mikhi falls to the ground,\n     jerking viciously in his death throes as - Gregor picks up\n     the pistol and runs to leave the room, and as he does we move\n     to - \n\n<b>     THE GALLERY -\n</b>\n     Filled with Paintings and Sculptures, nothing less than 200\n     years old.  This place is a maze, what with it's walls of\n     paintings that jut out here and there, the various corridors\n     which lead from room to room, and the sculptures which block\n     sight lines.  Now we find - Vincent, pressed against a wall, a\n     gun in each hand, while - FIVE RUSSIAN MAFIA GUYS are hunting\n     him down.  We do a SERIES OF QUICK CUTS as the Five Guys split\n     up and look for Vincent, all the while speaking in low Russian\n     voices.  Suddenly one of the Guys turns a corner and sees -\n     Nothing.  No Vincent.  Now he turns back and - A FIST CRASHES\n     through a painting which hangs on a makeshift wall.  It's\n     Vincent.  His hand wraps around Mafia Guy's neck, pinning him\n     in place.  Seconds later - Two quick shots rip through the\n     painting, hitting Mafia Guy in the head.  Now - The other men\n     are alerted by the shots, they come running and - Vincent steps\n     out firing -\n\n     And now it's a bullet-fest, as he gets the drop on them,\n     using the maze of the Gallery to his fullest advantage,\n     gunning them down - First one - Then two - Three, and then -\n     No four.  Vincent turns, surprised that his man wasn't where\n     he expected him to be when - A SHOT RINGS OUT, hitting\n     Vincent, a flesh wound that disarms him.  The Last Guy has\n     the drop on Vincent.  Now - The Last Guy smiles a nasty\n     little smile at Vincent and - A PISTOL spits fire and - A\n     BULLET bursts out of the Last Guy's chest.  It's Sam.  Now\n     Sam and Vincent exchange a look: Sam has, once again, saved\n     Vincent's life.\n\n<b>                          VINCENT\n</b>               You have to stop doing that!\n\n<b>                          SAM\n</b>               I'll work on it...\n\n     The two men don't have time for any more words, they move\n     from the Gallery and find themselves in -\n\n<b>     THE DINING ROOM -\n</b>\n     Where they find nothing but the bloody remains of Mikhi the\n     Gangster.  Sam and Vincent are surveying the room when a\n     VOICE comes from BEHIND them -\n\n<b>                          SEAMUS (O.S.)\n</b>               Turn around real slow, and try hard not\n               to breathe when you do it.\n\n     ANOTHER ANGLE - Seamus Reilly has come in behind them, and\n     he's got his gun pointed straight at Sam's heart.  If Seamus\n     is enraged at discovering Gregor's absence, he's overjoyed to\n     find Sam in his place.\n\n<b>                          SEAMUS\n</b>               It's you...\n                   (touches his face)\n               You're the one did this to my face, are\n               you?\n\n<b>                          SAM\n</b>               That's me.\n\n<b>                          SEAMUS\n</b>               Have a nice afterlife.\n\n     Seamus pulls the trigger and his BULLET spins out towards\n     Sam, ready to blow a hole through him except that - Vincent\n     leaps forward and takes the bullet -- it rips into his side,\n     a huge splash of red against his white shirt.  He falls to\n     the ground, horribly wounded, but he's given Sam enough time,\n     and now - Sam and Seamus open fire on one another - BULLETS\n     RIPPING into the table, chewing up the china and crystal,\n     taking glass shattering bites out of the CHANDELIER above the\n     table, turning the Dining Room from a primo Louis XIV\n     showpiece into shit as the two men move about and then\n     suddenly - They're face to face, each with a gun to the other\n     - Mexican Standoff.  Suddenly, from Off Screen -\n\n<b>                          DEIRDRE (O.S.)\n</b>               Seamus!\n\n     ANOTHER ANGLE - Deirdre has appeared, her gun leveled at the\n     two men.\n\n<b>                          SEAMUS\n</b>               Deirdre, do for him, woman, put a fucking\n               bullet in his head!\n\n     Deirdre hesitates, uncertain.\n\n<b>                          SEAMUS\n</b>               Do it, for Christ's sake, do it so we can\n               find that stinking Gregor, he's got the\n               bloody package!  For God's sake, you're a\n               soldier...\n\n     These last words sink into Deirdre: she is a soldier.  Her\n     gun swivels towards Sam.\n\n<b>                          SEAMUS\n</b>                   (sensing he's getting to\n                    her)\n               You're one of us...You been born and bred\n               with your own people, you can't go\n               against your nature.  C'mon, girl, I'm\n               you're people.\n\n     Deirdre makes up her mind.\n\n<b>                          DEIRDRE\n</b>               I'm no girl, Seamus...\n\n     She fires a shot - Blowing Seamus off his feet and through a\n     huge PLATE GLASS WINDOW.\n\n<b>                          DEIRDRE\n</b>               And you ain't nobody's people.\n\n     She moves with Sam to Vincent, who is seriously wounded --\n     perhaps life-threateningly so.\n\n<b>                          SAM\n</b>                   (to Deirdre)\n               Let's get him out of here...\n\n<b>                          VINCENT\n</b>               Finish the job...\n\n<b>                          SAM\n</b>               And now...\n\n<b>                          VINCENT\n</b>                   (a commanding whisper)\n               Finish it!\n\n     Sam considers, but before he can make up his mind, Deirdre\n     sees something through the wreck of the Dining Room Window -\n\n     OUT ON THE BACK LAWN - We've already seen that it's bordered\n     on one side by the woods, for the first time we notice - A\n     LAKE, which laps against a PRIVATE DOCK, where a row boat is\n     tethered.  Now - BENEATH A VERY FULL MOON, the stark figure\n     of Gregor makes its way toward the Dock.\n\n<b>                          DEIRDRE\n</b>                   (calling out)\n               Sam...\n\n     Sam turns at the sound of her voice and sees Gregor making\n     his escape.  Sam looks back at Vincent, who is almost passed\n     out from blood loss.\n\n<b>                          VINCENT\n</b>               I'm really sick of you saving my life.  Go\n               out and get the bastard.\n\n     Same makes up his mind, and as Vincent passes out, Sam runs\n     out after Deirdre and towards -\n\n<b>     THE PRIVATE DOCK -\n</b>\n     And as the two of them run we MOVE WITH THEM.\n\n<b>                          DEIRDRE\n</b>               He's got the briefcase rigged to explode\n               five seconds after anybody other than\n               himself tries to open it.\n\n     And now they reach the Dock and they find - Nothing -- no\n     Gregor.  And the Boat is still there.  Before Sam can\n     restrain her - Deirdre stps out towards the Boat.\n\n<b>                          SAM\n</b>               Deirdre, wait up --\n\n     But it's too late: Gregor steps out from behind -\n\n     A BOATHOUSE, and before Deirdre can even figure out what\n     happened, Gregor has her in an arm lock, a gun to her head.\n     His free hand sticks out and we see the Briefcase, which is\n     still handcuffed to his wrist.\n\n<b>                          GREGOR\n</b>               You might have made a good field agent\n               you arrogant American prick, but you're\n               not smart enough to go up against me.\n\n     Gregor and Deirdre are poised at the edge of the lake.  This\n     Private Dock is made completely of stone, and the drop to the\n     water is nearly five feet.  Sam has reached a position where\n     there is no right answer.  Still, he points his gun at\n     Gregor, who in turn shields himself with Deirdre's body.\n\n<b>                          GREGOR\n</b>               Go ahead, shoot... Shoot and kill the\n               bitch, I don't care.\n                   (beat)\n               And yet you don't shoot.  Interesting.\n               Put down your weapon and walk away.\n\n<b>                          DEIRDRE\n</b>               Don't do it, Sam!\n\n<b>                          GREGOR\n</b>               Shut up!\n\n<b>                          DEIRDRE\n</b>               He'll kill me anway, Sam, shoot though\n               me and kill this fucker.\n\n<b>                          SEAMUS (O.S.)\n</b>                   (a horrible croak)\n               If you don't, I will...\n\n     ANOTHER ANGLE - Seamus is somehow still barely alive -- he's\n     not long for this world, but the will for revenge has driven\n     him this far.\n\n<b>                          SEAMUS\n</b>                   (to Sam, in a cold pale rage)\n               Shoot that traitorous bitch and I'll let\n               you live.\n\n     THE TOP OF SEAMUS'S HEAD explodes, finishing him off once and\n     for all, killed by -\n\n     Vincent, who has staggered out to make this one necessary\n     shot.  But he can go no further, and he collapses in his own\n     blood, near death, just as - Gregor takes a step towards the\n     boat and - Sam makes up his mind and shoots - THE BULLET\n<b>     FLIES ACROSS THE SCREEN -\n</b>\n     IMPACT - The Briefcase bursts, shot open by Sam and now we're\n     in SLOW MOTION as -\n\n     Gregor relaxes his grip on Deirdre as he struggles to close\n     the case and - Deirdre takes the opportunity to dive the\n     other, into the lake, while -\n\n     BABOOM!  The case EXPLODES, a flash of phosphorescent white\n     light that incinerates Gregor and the case and whatever was\n     inside it with an explosion that knocks Sam to the ground and\n     when the light clears - Gregor and the case are gone, while -\n     THE EXPLOSION ECHOES out over the lake, booming again and\n     again until finally there is - SILENCE.  Sam looks out over\n     the lake for any sign of Deirdre - But there is none.  And\n     then, after we've held for a BEAT longer than it should be\n     possible for her to have survived - her head splits the\n     surface and she emerges, coughing.  Sam reaches down to help\n     her out.\n\n<b>                          SAM\n</b>               Are you alright?\n\n<b>                          DEIRDRE\n</b>               Alright?  It's bloody fucking freezing in\n               here!\n\n     Sam pulls Deirdre out of the water and then the two of them\n     immediately turn and move towards Vincent, and as they do we\n     start to PULL BACK on them, and now the SOUNDS of SIRENS can\n     be heard, one, then two more, and then a symphony of noise.\n     And we're STILL PULLING BACK ON -\n\n     THE CHATEAU - Or what's left of it, because it's started to\n     burn, and quickly the flames start to rise into the night,\n     like something out of medieval times as we -\n\n<b>     DISSOLVE TO:\n</b>\n<b>     INT. A HOSPITAL WAITING AREA - NIGHT\n</b>\n     Sam waits outside a hospital room, inside of which we get a\n     glimpse of - A DOCTOR tending to a heavily bandaged and\n     sedated Vincent.  As Sam waits - TWO GENDARMES and a\n     PLAINCLOTHES DETECTIVE approach.  The Detective looks at Sam\n     for a BEAT, and then goes to push past him.  Sam blocks his\n     way.\n\n<b>                          DETECTIVE\n</b>               I need to speak with that man.\n\n<b>                          SAM\n</b>               I'm sorry, I can't allow that.\n\n     Sam reaches into his coat, and for a moment everybody thinks\n     he's going for his gun, but instead he comes out with - A\n     PIECE OF PAPER.  He hands it to the Detective.\n\n<b>                          SAM\n</b>               Call that number and ask them what you\n               should do.\n\n     The Detective eyeballs the number suspiciously.\n\n<b>     FIVE MINUTES LATER -\n</b>\n     The Detective hangs up a nearby wall phone and then looks\n     over at Sam in disgust.  Without another word, the Detective\n     signals to the two Gendarmes, and all three men exit.  Now -\n\n     The DOCTOR, a beautiful French Woman, comes up and speaks to\n     him in FRENCH -- and the amazing thing is that Sam speaks\n     back.  Everything in SUBTITLED.\n\n<b>                          DOCTOR\n</b>               You can see your friend, now.\n\n<b>                          SAM\n</b>               Thank you very much.\n\n<b>                          DOCTOR\n</b>               The field dressing you put on saved his\n               life.\n                   (giving him a look)\n               Where di you learn to do that?\n\n<b>                          SAM\n</b>               Here and there, I guess.\n\n     The Doctor isn't entirely satisfied with this answer, but\n     it's the only one she's going to get, because Sam moves past\n     into -\n\n<b>     INT. VINCENT'S ROOM\n</b>\n     He's barely alive -- but alive nonetheless.  And he's heard\n     Sam speak in French to the Doctor.\n\n<b>                          VINCENT\n</b>               You son-of-a-bitch...\n\n<b>                          SAM\n</b>               What?\n\n<b>                          VINCENT\n</b>               You speak French.\n\n<b>                          SAM\n</b>               What of it?\n\n<b>                          VINCENT\n</b>                   (in mock exasperation)\n               Nothing...\n\n     He lies back on his pillow, pissed and yet amused.\n\n<b>                          VINCENT\n</b>                   (repeating the Doctor's words\n                    in English)\n               \"Your field dressing saved his life.\"\n               That's three I owe you.\n\n<b>                          SAM\n</b>               You don't owe me a goddamned thing,\n               Vincent, and you know it.  You stepped in\n               front of a bullet for me.\n                   (very seriously, he now\n                    believes this)\n               I owe you a heavy debt.\n\n<b>                          VINCENT\n</b>                   (relishing this)\n               I know.\n\n<b>                          SAM\n</b>                   (rising to leave)\n               You better get some sleep, alright?\n\n<b>                          VINCENT\n</b>               Tell me something first.\n                   (a quick beat)\n               The package: what was it?\n\n<b>                          SAM\n</b>               I don't know.  Nobody knows, except a\n               bunch of people who are too dead to tell\n               us.  There's probably a couple of guys\n               back at the Company who know, but I don't\n               think they plan to tell me anytime soon.\n\n<b>                          VINCENT\n</b>               What happened to it?\n<b>     \n</b><b>                          SAM\n</b>               Gone.  Destroyed.\n\n<b>                          VINCENT\n</b>                   (sighs, then a beat)\n               I guess that's for the best.\n\n     Sam turns for the door but Vincent has one last thing to say.\n\n<b>                          VINCENT\n</b>               Sam, when Gregor had Deirdre by the lake,\n               you could have killed the two of them\n               with one shot.  You could have had the\n               package, finished the job.  But you\n               didn't, you sacrificed the job to save\n               her life.  Why?\n\n     Same has to think about this for a second, and his answer\n     reveals just how full circle he's come.\n\n<b>                          SAM\n</b>               It's what you would have done.\n\n     And on that note Sam exits the room, leaving a bemused\n     Vincent behind.\n\n<b>     EXT. THE BANK OF THE RIVER SEINE - EARLY MORNING\n</b>\n     A WISPY FOG atmospherically rises off the river -- not too\n     thick, not too thin.\n\n     A TITLE: One month later...\n\n     We're MOVING along the cobble-stone walk next to the river as\n     a VOICE cuts through the fog.\n\n<b>                          VINCENT (V.O.)\n</b>               Would you just smoke already...\n\n     A RIVERSIDE CAFE - Where Sam, Vincent and Deirdre are having\n     morning coffee.  A mostly-healed Vincent is smoking a\n     cigarette, trying to get Sam to light up.\n\n<b>                          SAM\n</b>               I told you, I quit.\n\n<b>                          VINCENT\n</b>               Just to keep me company, Sam -- I hate\n               smoking alone.\n                   (turning to Deirdre)\n               How about you?  I thought all you IRA\n               types smoked.\n\n<b>                          DEIRDRE\n</b>               Only the stupid ones.  Cigarettes kill\n               more patriots than bullets.\n                   (a quick beat)\n               Besides, I'm not IRA no more.\n\n<b>                          VINCENT\n</b>               So where do you go from here?\n\n<b>                          DEIRDRE\n</b>               I don't know.  I was thinking...Maybe the\n               three of us might partner up -- guns for\n               hire, that sort of thing.\n\n<b>                          VINCENT\n</b>               I'm up for that...\n\n     The two of them turn to Sam, but he shakes his head.\n\n<b>                          SAM\n</b>               Not me.  You work too often with the same\n               people and you become friends -- clouds\n               your judgement.\n\n<b>                          DEIRDRE\n</b>               Come off it, Sam -- if we weren't friends\n               already we wouldn't be here now, would\n               we?\n\n<b>                          VINCENT\n</b>               She's got a point.\n                   (playing a trump card)\n               Besides, I know of a job that's\n               available.\n\n     Sam can't help it -- he's interested.\n\n<b>                          SAM\n</b>               How much does it pay?\n\n<b>     SLAM CUT TO:\n</b>\n<b>     EXT. OUT ON THE RIVER SEINE - MEANWHILE\n</b>\n     SILENCE AND FOG.  A RIVER FERRY does a slow ghostly glide\n     down the river, and in seconds it approaches -\n\n     THE RIVERSIDE CAFE, which appears through the mist, looked at\n     by --\n\n     A SLEEK PAIR OF SUN GLASSES attached to a young PUNK in a\n     leather coat, and the Punk is looking at - Sam, Vincent, and\n     especially: Deirdre.  Sam looks up and shouts a warning as -\n     The Punk pulls a shotgun from beneath his leather coat, pumps\n     the gun and screams out at Deirdre with an Irish accent -\n\n<b>                          PUNK\n</b>               This is for Seamus!\n\n     BOOM!  The Punk pulls the trigger, a blast of fire as - Sam's\n     gun is already out, TWO QUICK SHOTS squeezed off and - The\n     Punk is capped twice in the head, dead, sailing away on the\n     Ferry which never stops as -\n\n     THE CAFE goes wild, CUSTOMERS running, screaming, WAITERS\n     dropping their trays.  But - Sam doesn't run, and neither\n     does Vincent.  Sam stands, stunned by what he sees - Deirdre\n     lies on the ground, hit full on in the chest: she's dead.  A\n     BEAT OF PURE SILENCE - Broken by SIRENS in the distance, but\n     quickly growing closer.  Now - Vincent looks at Deirdre's\n     corpse, then at Sam, who is unable to move.  For maybe the\n     first time in his professional career, Sam is staggered by\n     the loss of a life.  Vincent gently takes Sam's arm.\n\n<b>                          VINCENT\n</b>                   (soft yet urgent)\n               We have to go, Sam, we can't be here.\n\n     Sam looks at Vincent, and for a moment Sam struggles to find\n     something to say, but he can't find a goddamned thing.  The\n     SIRENS are getting louder -\n\n<b>                          VINCENT\n</b>                   (a little louder, bordering\n                    desperation)\n               Let's go!!\n\n     Vincent literally drags Sam away and now the SIRENS have\n     arrived, followed quickly by - THE GENDARMES, who come\n     running into the Cafe but - It's empty except for Deirdre's\n     body.  Now -\n\n<b>     THE STREET ABOVE THE RIVER -\n</b>\n     Sam and Vincent are running through patchy fog, Vincent\n     leading the way, and now -\n\n     We're CLOSER ON Vincent as he runs and runs and runs until he\n     feels he's far enough away from the scene of the crime to\n     relax.  He collapses against a stone wall, chest heaving,\n     shaking out two cigarettes, one for himself and one for Sam.\n\n<b>                          VINCENT\n</b>                   (thrusting the cigarettes out to\n                    Sam)\n               Doctor's orders...\n\n     But Sam isn't there to take the cigarette -- Vincent looks\n     around, trying to see what happened to his friend, but the\n     fog has covered any sign of Sam.  Vincent stands there,\n     stunned, alone, the cigarettes in an outstretched hand that\n     slowly falls back to Vincent's side as he realizes that Sam\n     has left him on purpose.  Then - Vincent lights both\n     cigarettes at the saem time and throws one of them over the\n     stone wall - THE GLOWING CIGARETTE arcs through the air until\n     it lands in the river where it extinguishes with a hiss.\n\n<b>                          VINCENT (O.S.)\n</b>               Goodbye, Sam...\n\n<b>     BACK AT THE CAFE -\n</b>\n     The Gendarmes have secured the scene (there isn't much to\n     secure since everyone has run away).  A majority of cops\n     surround Deirdre's dead body, but - One GENDARME wanders\n     around the cafe, looking about, and then he sees something -\n\n<b>     ON THE STREET ABOVE -\n</b>\n     A SHAPE IN THE FOG.  The wind blows and the fog clears for a\n     second, and we see that it's - Sam.  Getting one last look at\n     Deirdre.  Quickly - The Gendarme points Sam out but as he\n     does the wind continues to blow and - THE FOG swallows Sam.\n     Seconds later the fog clears again, and when it does - Sam is\n     gone.\n\n<b>     FADE OUT.\n</b>\n\n\n\n\n\n\n\n   </pre>\n\n\n\n<b></b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Ronin</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=J.D. Zeik\" title=\"Scripts by J.D. Zeik\">J.D. Zeik</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Ronin Script.html#comments\" title=\"Ronin comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:15:02.718379"}