{"title": "Roughshod", "film_link": "/Movie Scripts/Roughshod Script.html", "script_link": "/scripts/Roughshod.html", "info_raw": "\n\nRoughshod Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Hugo Butler  Geoffrey Homes  Peter Viertel\nGenres  Western\nMovie Release Date : May 1949\n\nRead \"Roughshod\" Script\n\n\n", "script": "\n\n\n\n\n                                        ROUGHSHOD\n\n\n\n                                       Written by\n\n                               Hugo Butler & Geoffrey Homes\n\n\n\n                                         Story by\n\n                                      Peter Viertel\n\n                \n\n               EXT. DESERT - DAWN\n\n               FULL SHOT. The sun, spinning up from behind the dark rim of \n               eastern hills, is bleaching the cloudless, morning sky. This \n               is volcanic country, barren, desolate, forbidding. There is \n               no sign of life, no sound. Then on a distant hill, a man \n               appears, to be followed by two others. They walk steadily \n               forward.\n\n                                                                   DISSOLVE\n\n               EXT. NARROW CANYON - DAWN\n\n               MED. SHOT. A dry watercourse threads its way through the cut \n               in the treeless hills. The sun is not high enough as yet to \n               drive night from the canyon. A man appears around a bend; \n               another and still another. They are McCall, Peters and Lednov, \n               clad in prison clothes, hatless, their heads closely cropped. \n               As Lednov's face comes into a closeup,\n\n                                                                   DISSOLVE\n\n               EXT. HILL - DAWN\n\n               LONG SHOT - DOWN ANGLE. A narrow valley lies below. Through \n               it runs a cottonwood-bordered stream. Smoke curls up out of \n               the trees. Horses graze in a small meadow near the creek. \n               From O.O. comes the SOUND of heavy boots crunching across \n               the dry, eroded earth. The three men file past camera to \n               stop in the immediate F.g. and look down into the valley. \n               They exchange glances and start down.\n\n                                                                   DISSOLVE\n\n               EXT. FORSTER CAMP - DAWN\n\n               MED. SHOT - ANGLED THROUGH willows. A bearded man, Cal \n               Forster, and two young fellows in their late teens squat \n               beside a campfire eating breakfast. O.s. there is the SOUND \n               of movement. Lednov moves cautiously into the scene. He has \n               a revolver in his hand.\n\n               Forster turns toward camera and fear comes into his \n               expression. Lednov fires. Forster crumples near the fire. \n               The two boys jump to their feet and reach for rifles. Lednov \n               fires again and again. McCall and Peters come into the scene, \n               both firing revolvers.\n\n                                                                   DISSOLVE\n\n               EXT. FORSTER CAMP - DAWN\n\n               MED SHOT - ANGLED ACROSS campfire. On the fire smoulders the \n               prison clothes the convicts had worn. Smoke spirals up. In \n               the B.B. Lednov, Peters and McCall, now wearing the clothes \n               of the three Forsters, saddle the horses. CAMERA PANS AROUND \n               and ANGLES DOWN. The bodies of Forster and his sons, now \n               clad in underwear are sprawled by the fire. Forster's arm \n               lies close to the smouldering clothing.\n\n                                                                   DISSOLVE\n\n               EXT. CREEK - DAWN\n\n               MED. LONG SHOT. Smoke climbs above the trees. Into the \n               clearing ride the three convicts, to cross it and move \n               westward. They disappear over the hill. A dust cloud marks \n               their passage. CAMERA HOLDS ON the scene and over the shot \n               comes the MAIN TITLE CARD:\n\n                                        ROUGHSHOD\n\n               EXT. DESERT ROAD - DAY\n\n               LONG SHOT. A buckboard drawn by two horses comes along the \n               road. Graham, a middle-aged rancher, is driving. As the horses \n               trot forward and dust rises above the road, the NEXT TITLE \n               CARD is shown.\n\n                                                                   DISSOLVE\n\n               EXT. CREEK - DAY\n\n               LONG SHOT - DOWN ANGLE. Graham's buckboard moves down the \n               road toward the clearing, as the TITLE CARDS follow and \n               change. When the buckboard reaches the creek, the LAST TITLE \n               CARD is ended.\n\n               EXT. MEADOW - DAY\n\n               MED. SHOT. Graham drives the horses through the creek and \n               into the meadow. Through the trees the Forster camp can be \n               seen. Graham glances over, then suddenly pulls on the reins. \n               As the horses stop, he twists the reins around the whip stock, \n               grabs his rifle from under the seat, leaps out and hurries \n               forward toward the camp.\n\n               EXT. FORSTER CAMP - DAY\n\n               MED. SHOT. Graham hurries through the trees to stop in horror \n               near the dead men. Then very slowly he moves forward to the \n               smouldering fire. Stooping he lifts Forster's arm away from \n               the fire, then picks up one of the prison coats and looks at \n               it.\n\n                                                                   DISSOLVE\n\n               EXT. DESERT ROAD - DAY\n\n               MED. LONG SHOT. The surrounding hills are covered with scrub \n               pinon pine and mesquite. Graham's buckboard, moving slowly \n               up a hill, passes camera, which PANS WITH it. In the bed, \n               covered by a tarp, are the three bodies. The narrow, one-way \n               road climbs easily up the gentle hill. Beyond, a dust cloud \n               rises. As Graham's buckboard nears the crest, a surrey appears \n               and starts down. Graham pulls his team into the bank, trying \n               to make room for the surrey.\n\n               MED. SHOT\n\n               There are four women in the two-seated surrey, which is \n               heavily loaded with trunks, hatboxes, etc. Mary Wells, the \n               loveliest of the four, is driving. She is more poised, more \n               self-assured than the others. Her clothes, though a trifle \n               showy, are attractive. She wears a large spectacular hat. \n               Helen Carter, showier, harder and more cynical, sits beside \n               her. In the seat behind are Marcia Paine, placid, younger \n               looking than her years, and Elaine Ross, a striking blonde \n               with a pale haunted face. Elaine is obviously ill. Mary is \n               riding the brake and holding the team back.\n\n               ANOTHER ANGLE\n\n               SHOOTING PAST Graham.\n\n                                     GRAHAM\n                              (annoyed)\n                         What in thunderation --\n                              (calling)\n                         Wait a minute -- stop --\n\n               He jerks on the reins and tries to make room for the surrey. \n               A steep bank is on camera left. On camera right, the road \n               drops off into a gulley. As the surrey comes up Mary reins \n               the team in. The women all look frightened. Graham, trying \n               to force his team to pull the vehicle up the bank, is too \n               occupied to recognize the women at once. Having made just \n               enough room for the surrey, he turns and looks at the women.\n\n                                     GRAHAM\n                         All right --\n                              (then surprised)\n                         What are you girls doin' way out \n                         here?\n\n               Mary looks ahead at the narrow road and the canyon to her \n               left.\n\n                                     MARY\n                         Until you came along we were going \n                         to Sonora.\n\n                                     GRAHAM\n                         What do you know about that. Did you \n                         sell your place?\n\n                                     MARY\n                              (dryly)\n                         Not exactly. They decided gambling \n                         and dancing were bad for people.\n                              (pointing)\n                         Can I make it?\n\n                                     GRAHAM\n                         Depends on how good you drive.\n\n                                     HELEN\n                         She's a little out of practice.\n\n               Graham jumps over the wheel.\n\n               MED. CLOSE ON SURREY\n\n               Graham reaches the surrey.\n\n                                     GRAHAM\n                              (cheerfully)\n                         Slide over.\n\n                                     HELEN\n                              (getting up)\n                         I'm slidin' all the way over.\n\n               She climbs out. Marcia looks at the narrow space ahead.\n\n                                     MARCIA\n                              (rising)\n                         So am I. Come on Elaine.\n\n               Elaine leans back against the cushions and shakes her head.\n\n                                     ELAINE\n                              (flat)\n                         What's the difference if we fall in \n                         the canyon.\n\n                                     MARCIA\n                         Don't talk like that.\n\n               Helen is out on the road now. Mary has moved over and Graham \n               picks up the reins. Marcia gives up and jumps out.\n\n                                     GRAHAM\n                         Nothin' to it --\n\n               He releases the brake.\n\n                                     GRAHAM\n                         -- once you know how. Trouble is, \n                         never was a woman knew how to handle \n                         a team. Shouldn't let 'em loose on \n                         the roads. No disrespect meant, Miss \n                         Wells.\n\n               Mary isn't listening. She is looking at the road. Elaine \n               closes her eyes. Helen and Marcia scurry back out of the \n               way.\n\n                                     GRAHAM\n                         Get up.\n\n               Adroitly he drives the surrey past.\n\n               ANOTHER ANGLE\n\n               featuring buckboard. Helen and Marcia start along the road \n               past the buckboard. Helen stops and looks at its cargo in \n               horror. She grabs Marcia's arm. The girls look at each other \n               and hurry after the surrey which has stopped below the \n               buckboard.\n\n               MED. SHOT\n\n               on surrey. Graham jumps out.\n\n                                     GRAHAM\n                         There you are. Now take it easy and \n                         you'll be all right.\n\n                                     MARY\n                         Thank you, Mr. Graham.\n\n               Helen and Marcia hurry up. Marcia motions back.\n\n                                     MARCIA\n                              (aghast)\n                         There's -- dead men -- in your wagon!\n\n                                     GRAHAM\n                         That's right. You had me so busy I \n                         forgot --\n                              (worried)\n                         Come to think of it you better turn \n                         around and drive right back to Aspen.\n\n               The women exchange glances. Elaine is sitting up, her eyes \n               open.\n\n                                     GRAHAM\n                         They were murdered. I found the bodies \n                         on Alder Crick, northeast of here. \n                         Like I said if I was you, I'd go \n                         back, because the men who killed \n                         them might be on this road.\n\n                                     ELAINE\n                              (bitterly)\n                         Back to what?\n\n                                     GRAHAM\n                         Why, back to Aspen, where you came \n                         from.\n\n               As Mary speaks, Helen pushes Marcia into the surrey and climbs \n               up beside Mary.\n\n                                     MARY\n                         Aspen doesn't want us Mr. Graham. \n                         They threw us out.\n\n                                     GRAHAM\n                              (distressed)\n                         They shouldn't have done that.\n\n                                     MARY\n                         We tried to point that out. But there \n                         were some pretty nosey citizens who \n                         wouldn't listen to reason. They said \n                         Aspen had outgrown us. It's all right \n                         to play poker in your own home but \n                         not in a saloon.\n\n                                     GRAHAM\n                              (sadly)\n                         I knew something would happen when \n                         they started puttin' up fences and \n                         passin' laws.\n\n               Mary unwraps the reins from the whipstock.\n\n                                     MARY\n                         Goodbye and thanks.\n\n                                     GRAHAM\n                         I don't like to see you go.\n\n               Mary releases the brake and the surrey starts rolling forward.\n\n                                     GRAHAM\n                         But that's the way it is. The live \n                         ones go out and the dead ones come \n                         in.\n\n               The surrey starts down the hill. Graham looks after it, then \n               turns to go back to the buckboard, CAMERA PANNING WITH him.\n\n                                                                   DISSOLVE\n\n               EXT. ASPEN - DAY - (MATTE SHOT)\n\n               The town lies in a lush green valley. It is surrounded by \n               meadowland and shaded by cottonwoods, alders and aspen. In \n               the F.g. Graham's buckboard moves fast down hill.\n\n                                                               DISSOLVE OUT\n\n               EXT. ASPEN STREET - DAY DISSOLVE IN\n\n               FULL SHOT. In the F.g. a smallish crowd, mostly men and \n               children idle in the street in front of Mary Wells' Gambling \n               and Dance Hall. The wooden sidewalk is cluttered with those \n               articles belonging to the women that were too bulky to get \n               into the surrey. Several women stand on the porch supervising \n               the locking up of the place and the removal of the sign of \n               Mary Wells' name on it. Graham's buckboard rounds a corner \n               at a fast trot. He slows the team to let the people get out \n               of the way.\n\n               MED. SHOT ON BUCKBOARD\n\n               The team has slowed to a walk. The people give their attention \n               to the buckboard. A boy clambers up over the tailboard, sees \n               the cargo and jumps off with a frightened yell. The crowd \n               turns from the dance hall and follows the buckboard leaving \n               the women and their pious male assistants on the porch.\n\n               EXT. SHERIFF'S OFFICE - DAY\n\n               MED. FULL SHOT - ANGLED to include blacksmith shop across \n               the street. Far down the street comes Graham's buckboard \n               followed by the small crowd. The sheriff's office is a one-\n               story wooden structure. Next to it is the general store. In \n               front of the blacksmith shop stands a wagon with one wheel \n               off. In the corral alongside are eleven blooded mares. Clay \n               Phillips, his brother Steve and the blacksmith are inside \n               the shop. Clay's saddle horse is tethered to the hitching \n               rail beside two harnessed work horses.\n\n               INT. BLACKSMITH SHOP - DAY\n\n               ANGLED to include sheriff's office. The blacksmith, Sam Ellis, \n               an elderly bent man in a leather apron stands at the forge \n               in which he is heating the rim from the big wheel which lies \n               on the table nearby. Clay, a long-legged wrangler in clean \n               but faded work clothes stands near the forge pumping the \n               bellows and watching his brother, a freckled kid of sixteen \n               trying to roll a cigarette. Steve has progressed to the most \n               difficult step, that of licking and sealing the paper. Clay \n               reaches over and takes it from him. He puts the skinny \n               cylinder in his mouth and Steve lights it for him. The first \n               third of the cigarette burns with one quick flare.\n\n                                     STEVE\n                         How does she draw?\n\n                                     CLAY\n                         A little hot.\n\n               Sam lifts the rim to the wheel.\n\n                                     SAM\n                         You want to get out of here before \n                         noon, maybe you should lend me a \n                         hand.\n\n               Clay, the cigarette dangling from his lips, moves over to \n               the table, picks up a hammer and helps Sam hammer the rim on \n               the wheel. Steve stands watching.\n\n                                     CLAY\n                         Rate you're goin', we'll be here \n                         until winter.\n\n               Together they lift the wheel and plunge it into the tub of \n               water. Steam rises to fill the blackened shed.\n\n                                     SAM\n                              (amiably grumbling)\n                         Account of you, I miss out on the \n                         only excitement Aspen's had for \n                         months.\n\n                                     CLAY\n                         You're too old to watch such goin's \n                         on.\n\n                                     STEVE\n                         And I'm too young.\n\n               Clay and Sam spin the wheel in the tub.\n\n                                     CLAY\n                         That's right.\n\n                                     STEVE\n                         I don't see no sense to makin' people \n                         leave town if they don't want to \n                         leave.\n\n                                     SAM\n                         I don't either -- when people are \n                         that good-lookin'. Maybe that's why -- \n                         they were too good-lookin'.\n                              (philosophically)\n                         But there'll be others along to take \n                         their place after a while when this \n                         quiets down. And everything will be \n                         fine until some busybody starts \n                         stirring up trouble.\n\n                                     CLAY\n                              (mildly)\n                         Don't you ever run down?\n\n                                     SAM\n                              (to Steve)\n                         Some people just have to run other \n                         people's lives. Now take Clay. You \n                         want to amble up the street and see \n                         the fun and what does he say?\n\n                                     CLAY\n                              (good-natured)\n                         You stick to your blacksmithin' and \n                         let me take care of Steve.\n\n               From O.s. comes the SOUND of the approaching buckboard and \n               crowd. Steve hears the noise and moves to the front of the \n               shed.\n\n               EXT. SHERIFF'S OFFICE - DAY\n\n               MED. FULL SHOT - Steve's angle. Graham pulls his buckboard \n               up, jumps out and hurries into the sheriff's office. Some \n               kids run up to stand on the porch chattering excitedly. \n               Members of the crowd straggle up.\n\n               INT. BLACKSMITH SHOP - DAY\n\n               ANGLED PAST Steve. Clay comes up to stand beside Steve. Sam \n               joins them. Steve looks up at Clay hopefully.\n\n                                     CLAY\n                         We'll both take a look. Anything's \n                         better than listenin' to Sam.\n                              (to Sam)\n                         Don't forget to shoe the mule.\n\n               Clay and Steve exit. Sam looks after them, shrugs disgustedly \n               and goes back to the wheel.\n\n               EXT. SHERIFF'S OFFICE - DAY\n\n               MED. SHOT - featuring buckboard. The crowd around the wagon \n               stands in shocked silence looking at the bodies under the \n               tarp. Clay and steve come up, glance in the buckboard and \n               then at each other. Clay speaks to a man near him.\n\n                                     CLAY\n                         Who are they?\n\n                                     MAN\n                         Don't know. Graham brought 'em in.\n\n               The sheriff calls from O.s.\n\n                                     GARDNER'S VOICE\n                         Clay, come up here a minute.\n\n               ANOTHER ANGLE FEATURING PORCH\n\n               Sheriff Gardner, who has seen Clay through the window, comes \n               out of his office on to the porch followed by Jeb Graham and \n               a young deputy. In his hand Gardner holds the burned prison \n               jacket. Clay goes up the steps to the porch. Steve follows \n               to the foot of the steps to stand watching. The crowd around \n               the wagon gives its attention to the men on the porch.\n\n               MED. SHOT\n\n               Gardner is neatly dressed with his star hidden under his \n               coat. His deputy wears jeans, shirt, and leather jacket.\n\n                                     CLAY\n                         Hello Graham -- Joe -- Mr. Gardner.\n\n                                     GARDNER\n                         Graham's got something to tell you \n                         might interest you.\n\n                                     GRAHAM\n                              (motioning toward \n                              wagon)\n                         Cal Forster and his sons. Somebody \n                         killed 'em.\n\n               He pauses to let that sink in.\n\n                                     GRAHAM\n                         You know that cottonwood grove on \n                         Alder Crick? They must have been \n                         eatin' breakfast the way it looked, \n                         sittin' by the fire eatin' breakfast \n                         and when I got there nothin' but \n                         them lyin' dead in their underdrawers. \n                         No horses or guns or grub.\n\n                                     CLAY\n                              (shocked)\n                         Forster never did anyone any harm.\n                              (puzzled)\n                         But what's that got to do with me? I \n                         came into town from the south.\n\n               Gardner holds out the burned jacket.\n\n                                     GARDNER\n                         This was smoulderin' on the fire.\n\n               Clay moves over to glance down at the jacket.\n\n                                     CLAY\n                         I still don't see.\n\n               From his pocket, Gardner takes several communications, thumbs \n               through them and passes one over. It is a telegram, of the \n               period.\n\n                                     GARDNER\n                         I got it day before yesterday.\n\n               Clay reads it.\n\n               INSERT TELEGRAM OF THE PERIOD:\n\n               SHERIFF GARDNER: ASPEN, NEV. \n               BE ADVISED OF ESCAPE OF LEDNOV, PETERS AND McCALL CONVICTED \n               MURDERERS SERVING LIFE TERMS. \n               BELIEVED HEADED FOR CALIFORNIA.\n\n               L.B. GROVE, WARDEN STATE PENITENTIARY NORTON, NEV.\n\n               BACK TO SCENE. Clay hands the telegram back.\n\n                                     GARDNER\n                         Now are you interested?\n\n               Clay nods.\n\n                                     GARDNER\n                         You should be. Maybe Lednov heard \n                         about that Sonora ranch of yours.\n\n                                     CLAY\n                         Maybe he did.\n\n                                     GARDNER\n                         We're going to look for him. Want to \n                         come along?\n\n                                     CLAY\n                         I've got eleven horses to get over \n                         the mountains before snow catches me \n                         and covers the feed.\n\n                                     GARDNER\n                              (dryly)\n                         And that's more important than finding \n                         Lednov?\n\n                                     CLAY\n                         Like you said, maybe he knows where \n                         my ranch is. If he does, he'll be \n                         waiting on the porch.\n\n               He turns toward the steps.\n\n                                     GARDNER\n                              (with irony)\n                         I'll drop the sheriff in Sonora a \n                         line to sort of look around for him.\n\n               Clay speaks over his shoulder as he goes down.\n\n                                     CLAY\n                         Thanks.\n\n               ANOTHER ANGLE\n\n               As Clay starts away, Steve follows him. Clay doesn't cross \n               to the blacksmith shop. He goes along the sidewalk toward \n               the general store. Steve hurries to catch up with him.\n\n               EXT. STREET - DAY\n\n               MOVING SHOT. Clay, deep in thought, seems unaware of his \n               brother at his side.\n\n                                     STEVE\n                         Who's Lednov?\n\n                                     CLAY\n                         A man I used to know.\n\n               They walk in silence to the General store and Clay goes up \n               the steps and across the porch. Steve follows close behind.\n\n               FULL SHOT\n\n               The store is a typical general store of the period, selling \n               everything from buggies to baby clothes. In one corner is \n               the postoffice. The storekeeper, Hayes, is unpacking a case \n               of canned goods, stacking the cans on the shelf. Clay, \n               followed by Steve, enters. Hayes glances over.\n\n               MED. SHOT\n\n               Clay crosses to the shelf where the rifle and shotgun shells \n               are kept and takes down a half dozen boxes of 30 30 \n               cartridges.\n\n                                     HAYES\n                         Forget somethin', Clay?\n\n                                     CLAY\n                         Shells. How much for six boxes?\n\n                                     HAYES\n                         Six times six bits. But wait until I \n                         finish this.\n\n               Besides Clay, Steve is inspecting a rack of guns.\n\n                                     STEVE\n                         You might tell a fellow things, \n                         'specially if the fellow's your \n                         brother, seems to me.\n\n                                     CLAY\n                         Like what?\n\n               Steve picks up a rifle, puts it to his shoulder and squints \n               along the barrel.\n\n                                     STEVE\n                         Like why you're buyin' a whole slew \n                         of 30 30 shells all of a sudden.\n\n                                     CLAY\n                         I don't want to run short.\n\n                                     STEVE\n                         You never said this Lednov's name \n                         before, that I can remember.\n\n                                     CLAY\n                         No call to. That jail looked pretty \n                         solid to me.\n                              (pointing to rifle)\n                         How's she feel?\n\n                                     STEVE\n                         Nice.\n\n               He pulls the hammer back and snaps the trigger. Hayes comes \n               across and takes the gun from him.\n\n                                     HAYES\n                         You know bettern' to do that, Steve. \n                         Unless you're figurin' on buyin' it.\n\n                                     CLAY\n                         One he's got, more his size.\n\n                                     STEVE\n                         But it's leaded up and anyway a 22's \n                         no good for real huntin'. You shoot \n                         a man with a 22 and where are you?\n\n                                     CLAY\n                         The thing to do is stick to rabbits.\n\n               He hands Hayes some money for the shells. Hayes crosses to \n               another part of the store to get change. Clay and Steve, who \n               has picked up the rifle again, move over to the counter.\n\n               ANOTHER ANGLE\n\n                                     STEVE\n                         What was he in jail for?\n\n                                     CLAY\n                         You sure worry that bone. He killed \n                         a fellow.\n\n                                     STEVE\n                         In a fight?\n\n                                     CLAY\n                         The other fellow wasn't even lookin'.\n\n                                     STEVE\n                         This is an awful nice gun.\n                              (sighting it)\n                         Certainly come in handy when there's \n                         men around who shoot people that \n                         aren't lookin'.\n\n               Clay grins. Hayes comes up with the change. Clay takes out \n               some bills and gives them to the storekeeper.\n\n                                     CLAY\n                              (points to rifle)\n                         I may as well buy it for him. \n                         Otherwise he'll be crying all the \n                         way over the hill.\n\n               Steve's expression shows his gratitude and delight. He covers \n               up with banter.\n\n                                     STEVE\n                         You must be plenty worried about \n                         Lednov sneakin' up on us.\n                              (hopefully)\n                         Think he will?\n\n                                     CLAY\n                         Yes.\n\n                                     STEVE\n                         At the ranch maybe?\n\n                                     CLAY\n                         Maybe at the ranch. Maybe sooner \n                         than that.\n\n                                     STEVE\n                              (annoyed)\n                         Do you have to be so close-mouthed? \n                         I'm your brother. And I'm ridin' \n                         with you. Remember?\n\n                                     CLAY\n                              (smiling)\n                         All right. I'll tell you.\n\n               He puts one of the boxes of shells on the end of the counter.\n\n               MED. CLOSE - DOWN ANGLE\n\n                                     CLAY\n                         Let's say this is the penitentiary.\n\n               He reaches down into one of the barrels in front of the \n               counter. The barrels are filled with beans, nails, dried \n               apples, hardtack, etc. Clay takes a handful of beans and \n               makes a trail ending in a little pile.\n\n                                     CLAY\n                         Here's Alder Crick.\n\n               He puts another box of shells on the other side of the \n               counter.\n\n                                     CLAY\n                         And here we are in Aspen.\n\n               He runs a trail of beans away from \"Aspen\" toward the end of \n               the counter. He runs another trail from \"Alder Crick\" to \n               cross the Aspen trail. He puts another box of shells on the \n               far end of the counter.\n\n                                     CLAY\n                         That's Sonora.\n\n               He reaches down without looking and brings up a hardtack.\n\n                                     CLAY\n                         motioning) Lednov gets out of jail \n                         and comes along here to Alder Crick. \n                         Then goes along here toward the Sonora \n                         road.\n\n               Clay drops the hardtack back from where the bean trails cross.\n\n                                     CLAY\n                         That's Lednov!\n                              (tracing)\n                         We come along here.\n\n                                     STEVE\n                              (pointing)\n                         And meet him there.\n\n                                     CLAY\n                         Unless the sheriff gets too close \n                         and he holes up.\n\n               He holds out his hand and Hayes hands him his change.\n\n                                     CLAY\n                         So let's go.\n\n               Steve tucks his gun under his arm. As he passes the counter, \n               he picks up the hardtack and starts eating it.\n\n               EXT. GENERAL STORE\n\n               MED. SHOT - ANGLED TOWARD Sheriff's office. Up the street \n               men are gathering around the sheriff's office. Some are \n               mounted. Some are tightening their cinches. Clay and Steve \n               come out of the store to look up the street. Steve munches \n               the hardtack.\n\n                                     STEVE\n                              (motioning)\n                         Sure a lot of guys lookin' for Lednov.\n\n                                     CLAY\n                         Yeah -- and Lednov's only lookin' \n                         for one man. Me.\n\n                                     STEVE\n                         Why?\n\n                                     CLAY\n                         He doesn't like me. What you eatin'?\n\n                                     STEVE\n                         Lednov.\n\n               He glances at the remaining piece of hardtack and then pitches \n               it away.\n\n                                     STEVE\n                         I don't like him.\n\n               Clay laughs. As they start up the street, the sheriff mounts \n               his horse and, followed by his men, rides forward.\n\n                                                                   DISSOLVE\n\n               EXT. DESERT ROAD - DAY\n\n               CLOSE SHOT. A woman's hat lies on the rocky earth. It is a \n               big, elaborate affair. O.s. there is the SOUND of hoofbeats, \n               the SQUEAL of a wagon brake and the JANGLE of harness. CAMERA \n               PULLS BACK and ANGLE WIDENS to reveal Clay's wagon coming \n               down a very steep hill. Steve is driving, holding tightly to \n               the reins and riding the brake. Seeing the hat, he yells to \n               Clay.\n\n                                     STEVE\n                         Another one, Clay.\n\n               Clay rides over and, swinging down, picks it up.\n\n               MED. SHOT\n\n               ANGLED DOWN hill. The road twists tortuously down. Near the \n               bottom it swings sharply at right angles into a dry wash. \n               The banks shut out further view of the road. Near where the \n               road turns a trunk lies at the side. It has broken open and \n               some of the contents are spilled out in the dust. Clay rides \n               to it, reins in his horse and looks down. Steve, with \n               difficulty, pulls the mules to a stop alongside.\n\n               ANOTHER ANGLE\n\n               featuring trunk and wagon. Clay swings out of his saddle, \n               starts tossing the clothes back in the trunk. Steve jumps \n               down.\n\n                                     STEVE\n                         They sure must have been travelin'. \n                         This keeps up we can start a store.\n\n                                     CLAY\n                         Things get tough next winter, you'll \n                         have somethin' to wear.\n\n               Steve holds up a petticoat close to his body and grins.\n\n                                     STEVE\n                         I'd look good doin' the ploughin' in \n                         this.\n\n               Clay takes it from him, puts it in the trunk and shuts the \n               lid. Steve helps him hoist the trunk into the wagon bed. \n               Steve gets back in the seat. Just as Clay is about to mount, \n               he stops and picks up a small folding daguerrotype case \n               delicately ornamented. He lifts his eyebrow, tucks the case \n               into his pocket, then mounts and starts ahead around the \n               bend.\n\n               MED. LONG SHOT\n\n               Clay's ANGLE. Ahead, off the road in the wash is the surrey \n               that passed Graham's buckboard at the fork. Clay spurs his \n               horse forward.\n\n               MED. SHOT\n\n               on surrey. The back wheel is broken and the bed of the surrey \n               rests on the ground. The horses have been taken from the \n               traces and stand dejectedly in the hot sun. A blanket is \n               spread in the scant shade thrown by the surrey. On it lies \n               Elaine and, sitting beside her, is Marcia. A damp cloth is \n               spread across Elaine's forehead. A water bag hangs from the \n               surrey. Elaine's head is pillowed on a dainty satin cushion. \n               Helen and Mary have risen at Clay's approach and now stand \n               by the road.\n\n               ANOTHER ANGLE\n\n               Clay gallops forward to pull up near the surrey. In the b.g. \n               Steve drives the wagon around the bend. Clay dismounts.\n\n               MED. GROUP SHOT\n\n               Clay drops his reins and hurries up.\n\n                                     CLAY\n                         Anybody hurt?\n\n                                     MARY\n                         No. We came down the hill a little \n                         fast and...\n                              (rueful)\n                         ...the wheel broke.\n                              (hopefully)\n                         Can you fix it for us?\n\n               Clay bends over Elaine.\n\n                                     CLAY\n                         What's the matter with her?\n\n                                     MARY\n                              (dryly)\n                         Too much excitement. How about the \n                         surrey. Can you fix it?\n\n               Clay turns from Elaine and gives his attention to the surrey.\n\n               ANOTHER ANGLE\n\n               on rear of surrey. In the B.g. Steve pulls the wagon to a \n               stop, jumps off, and comes running over.\n\n                                     STEVE\n                         Jimininy. You sure were lucky, just \n                         bustin' a wheel.\n\n               Helen moves toward Clay. She miles without humor.\n\n                                     HELEN\n                              (rubbing thigh)\n                         You think that'sall we busted -- You \n                         should see...\n\n               Clay stops her with a look, goes around, and kicks the \n               unbroken back wheel. The spokes rattle.\n\n                                     CLAY\n                         This must have been in the family a \n                         long time.\n\n                                     MARY\n                              (dryly)\n                         It was a gift from the citizens of \n                         Aspen. I'm Mary Wells.\n\n               She looks at him to see if the name registers.\n\n                                     MARY\n                         And this is Helen Carter.\n\n                                     CLAY\n                         I'm Clay Phillips.\n                              (motioning)\n                         My brother Steve.\n\n               Steve tugs at his battered hat.\n\n                                     STEVE\n                              (shy)\n                         Pleased to meet you, ma'am.\n                              (brightly)\n                         We found your trunk. Were you doin' \n                         the driven'?\n\n                                     MARY\n                         I was at first. Then I was hanging \n                         on.\n                              (to Clay)\n                         Are you going far?\n\n                                     CLAY\n                         Yes, ma'am.\n\n                                     MARY\n                         As far as -- Sonora?\n\n                                     CLAY\n                         Just about.\n\n               Mary and Helen exchange glances.\n\n                                     MARY\n                         We're going to Sonora, too, so that \n                         solves everything.\n\n               Clay takes the makings from his pocket, starts to roll a \n               cigarette.\n\n                                     MARY\n                         We can ride in your wagon.\n\n               Steve looks at Clay hopefully. He likes the prospect of having \n               these lovely women along.\n\n                                     MARY\n                         We wouldn't think of asking you to \n                         take us for nothing.\n\n               Clay finishes the cigarette, starts to put the makings back. \n               Mary holds out her hand. Clay gives her the makings. Mary \n               speaks as she casually rolls a cigarette.\n\n                                     MARY\n                         There's only four of us.\n\n               Clay motions to the remuda that grazes in the b.g.\n\n                                     CLAY\n                         I've got eleven horses.\n\n                                     STEVE\n                              (proudly)\n                         Morgan blood. The beat in Nevada. \n                         Clay and me have a place on the \n                         Toulomne River. We're going to raise \n                         horses like these.\n\n               Mary has finished rolling her cigarette. She passes the bag \n               to Helen, who starts rolling one.\n\n                                     MARY\n                         They won't be riding in the wagon.\n\n                                     CLAY\n                              (dryly)\n                         Did you ever try taking a bunch of \n                         horses over Sonora Pass? It's quite \n                         a job.\n\n                                     MARY\n                         You can't leave us here.\n\n                                     CLAY\n                         Course I can't. I'll give you a lift \n                         to the first ranch.\n\n               Helen has finished her cigarette. She passes the makings to \n               Steve. He hesitates, looks at his brother and, when he sees \n               Clay is occupied with Mary, starts rolling one.\n\n                                     MARY\n                         What good is it going to do us to go \n                         to some ranch?\n\n                                     CLAY\n                              (amiably)\n                         You can stay here if you like.\n\n                                     MARY\n                         We have to get to Sonora. There are \n                         jobs waiting for us there. We'll pay \n                         you for your trouble.\n\n                                     CLAY\n                         I'm not running a stage line, ma'am, \n                         and I can't take a chance on losing \n                         the horses.\n\n               Steve finishes his cigarette. Again he hesitates, then not \n               wanting to seem young in front of these women he takes a \n               bold step and lights it. Clay reaches over and takes it from \n               him. Mary watches the byplay.\n\n                                     CLAY\n                         When you're old enough to smoke, \n                         I'll tell you.\n                              (kind)\n                         Get the horses started on ahead, \n                         will you, Steve?\n\n               Steve, embarrassed and hurt, turns quickly away. Helen looks \n               after the boy.\n\n                                     HELEN\n                         Afraid it will stop him growin'?\n\n                                     CLAY\n                              (turning)\n                         Let's get your stuff in the wagon. \n                         Like I said, I'll take you to the \n                         first ranch. I wish I could carry \n                         you all the way, but I can't. It's a \n                         tough trip and women would be in the \n                         way.\n\n                                     MARY\n                              (dryly)\n                         Our kind of women?\n\n                                     CLAY\n                              (ignores that)\n                         You'll have to drive -- except down \n                         hill.\n\n               He lifts some things out of the surrey and carries them toward \n               the wagon.\n\n                                     HELEN\n                         Maybe you're going about this all \n                         wrong. Why not try telling him we'll \n                         do the cookin' and mendin' and washin' \n                         for him. That usually works.\n                              (then shocked at the \n                              thought)\n                         Yeah, but suppose he took us up on \n                         it. Where would we be?\n\n                                     MARY\n                         Maybe in Sonora.\n\n               She starts around the surrey. Helen follows.\n\n               Clay bends over Elaine.\n\n                                     CLAY\n                         What's the matter with her?\n\n                                     MARY\n                              (dryly)\n                         Too much excitement. Or maybe it's \n                         just the heat. How about the surrey. \n                         Can you fix it?\n\n               As Clay turns from Elaine, Marcia joins the other two, their \n               attention on Clay and the surrey. Left alone, Elaine is \n               suddenly alert and no longer sick. She glances around, then \n               unobserved slides out from under the shade of the surrey.\n\n               ANOTHER ANGLE\n\n               on rear of surrey. In the B.g. Steve pulls the wagon to a \n               stop, jumps off, and comes running over. Elaine stands for a \n               moment, searching the ground with her eyes.\n\n                                     STEVE\n                         Jiminy. You sure were lucky, just \n                         bustin' a wheel.\n\n               Helen moves toward Clay. She smiles without humor. With this \n               new diversion, Elaine, still unnoticed, starts away -- back \n               toward where they dropped the trunk.\n\n                                     HELEN\n                              (rubbing thigh)\n                         You think that's all we busted -- \n                         You should see...\n\n                                     MARY\n                              (sees Elaine)\n                         Now where's she goin'? --\n\n                                     ELAINE\n                              (half-turns without \n                              stopping)\n                         I -- lost something.\n\n                                     CLAY\n                         It wouldn't happen to be this...\n\n               Elaine stops now and turns as Clay takes the folding \n               daguerrotype case from his pocket. Elaine, her eyes wide and \n               frightened, starts back as Mary takes the case from Clay and \n               opens it.\n\n                                     MARY\n                         Who's the old folks?\n\n                                     ELAINE\n                              (frantic)\n                         Give it to me!\n\n               She jerks the case from Mary's hands, snaps it shut, and \n               stands staring at Mary with a strange mixture of fright, \n               anger and hysteria. Mary glances around as if to say what-\n               did-I-do? To cover the embarrassed silence, Clay kicks the \n               unbroken back wheel. The spokes rattle.\n\n                                     CLAY\n                         This must have been in the family a \n                         long time.\n\n               Elaine glances at him as though he had insulted her, turns \n               and starts toward the blanket again.\n\n                                     MARY\n                              (dryly)\n                         It was a gift from the citizens of \n                         Aspen. I'm Mary Wells.\n\n               She looks at him to see if the name registers. At the surrey \n               side, Elaine is abruptly weak again. She leans against it \n               for support. Mareia moves to her as she slides back down on \n               the blanket, clutching the case.\n\n                                     MARY\n                         And this is Helen Carter.\n\n                                     CLAY\n                         I'm Clay Phillips.\n                              (motioning)\n                         My brother Steve.\n\n               Steve tugs at his battered hat.\n\n                                     STEVE\n                              (shy)\n                         Pleased to meet you, ma'am.\n                              (brightly)\n                         We found your trunk. Were you doin' \n                         the drivin'?\n\n               ANOTHER ANGLE\n\n               Mary and Helen come around the end of the surrey to where \n               Elaine lies. Mary bends beside the sick girl and lifts the \n               cloth from the girl's forehead.\n\n                                     MARY\n                         Come on, Honeybunch. We're changing \n                         trains.\n\n               The sick girl sits up. She looks around her dully.\n\n                                     MARY\n                         A nice, kind wrangler is letting us \n                         ride in his wagon...\n\n               Assisted by Mary, Elaine gets to her feet. Mary puts her arm \n               around her.\n\n                                     MARY\n                         ...as far as the first ranch. From \n                         then on --\n\n               Elaine stops. She looks fearfully up at Helen.\n\n                                     ELAINE\n                         What ranch?\n\n                                     MARY\n                         What's the difference?\n\n               She tries to lead the girl toward the wagon.\n\n                                     ELAINE\n                              (fierce)\n                         Ask him what ranch --\n\n                                     MARY\n                         There's plenty of time for that.\n                              (sharp)\n                         Come on, now. You've got to lie down \n                         out of this sun. Stop worrying. I'll \n                         find out what ranch after a while.\n\n               She pulls the girl with her toward the wagon.\n\n               MED. SHOT\n\n               on wagon. Clay, in the wagon bed, is stowing his gear in the \n               back. Mary, supporting Elaine, reaches the wagon. Seeing the \n               girls, Clay reaches down and gently lifts Elaine up. Mary \n               climbs in beside him.\n\n               MED. CLOSE\n\n               wagon bed. Clay has unrolled a bedroll under the seat where \n               there is a little shade.\n\n                                     CLAY\n                              (kind)\n                         Stretch out under the seat, Miss.\n\n                                     ELAINE\n                              (desperate)\n                         Which ranch?\n\n                                     CLAY\n                         How's that?\n\n                                     MARY\n                         She's worried about where you're \n                         taking us.\n\n               As she speaks, Mary helps the girl down under the seat, then \n               rises to face Clay.\n\n                                     MARY\n                              (dryly)\n                         So am I.\n\n                                     CLAY\n                         It's a nice place owned by an old \n                         couple named Wyatt.\n\n               CLOSE SHOT\n\n               Elaine as she hears the name. She is shocked.\n\n                                     CLAY'S VOICE\n                         They'll take you in until you can \n                         make other arrangements.\n\n               TWO SHOT\n\n               Clay and Mary. Clay vaults out of the wagon, CAMERA ANGLE \n               WIDENS, he looks up.\n\n                                     CLAY\n                         So both of you stop worrying.\n\n               He turns away and hurries back to the surrey.\n\n                                                                   DISSOLVE\n\n               EXT. DESERT ROAD - DAY\n\n               FULL SHOT. Dust rises over the road as the cavalcade moves \n               forward. Clay, rifle across his lap, rides in front. The \n               wagon, with Mary driving and Helen beside her on the seat, \n               follows. The two horses that pulled the surrey are tied to \n               the tail gate. Then comes the remuda with Steve bringing up \n               the rear.\n\n               CLOSE SHOT\n\n               Marcia and Elaine. PROCESS. Marcia sits in the bed of the \n               wagon looking back. Elaine lies under the seat.\n\n               CLOSE SHOT\n\n               Steve. Steve proudly carries his new rifle across his lap. \n               He whistles happily as he scans the desert country hopefully \n               for the enemy.\n\n               EXT. CAMP SITE - LATE AFTERNOON\n\n               FULL SHOT. Long shadows of the hills lie on the grassy meadow \n               along the stream that is bordered by cottonwoods and willows. \n               A knoll overlooks the camp site. The caravan can be seen as \n               it halts in the lush grass a few yards from the stream. The \n               girls sit lifelessly on the wagon; they seem too tired to \n               dismount. Then, finally, Marcia helps Elaine to climb stiffly \n               down. With the exception of Mary they all let themselves \n               down in the grass. Mary walks to the head of the team and \n               starts fumbling with the harness. Steve comes into the scene, \n               dismounts quickly and pulls the saddle off his horse. The \n               remuda has fanned out, the horses moving toward the water. \n               Steve crosses to Mary and takes over the job of unbuckling \n               the harness. Mary smiles gratefully and rubs her hand across \n               her face.\n\n                                     CLAY'S VOICE\n                         Steve, see the horses don't drink \n                         too much --\n\n               Steve straightens, looks towards the horses and moves off. \n               He speaks to Mary over his shoulder.\n\n                                     STEVE\n                         Leave that unharnessing for me, Ma'am.\n\n               Mary smiles after him, then moves across the grass, CAMERA \n               DOLLYING AHEAD of her. She sinks to her knees in the patch \n               of sand by the stream and leans down and puts her face under \n               the water. Then, sitting up, she wipes the water and dust \n               from her face with a handkerchief. Clay rides up from behind, \n               dismounts, scoops up some water from the river in the brim \n               of his hat and drinks it. For a second he watches Mary.\n\n                                     CLAY\n                         There's a place down a ways, where \n                         you and the girls can wash some of \n                         that dust off.\n\n               Mary's manner is business-like. She and the girls are along \n               for the ride. She wants no favors -- wants to do her part.\n\n                                     MARY\n                         Thanks. And isn't there something we \n                         can do about supper -- or making the \n                         beds?\n\n                                     CLAY\n                              (half-smile)\n                         Steve and me, we use a saddle for a \n                         pillow and roll up in a tarp.\n\n                                     MARY\n                              (curt)\n                         But you eat, don't you?\n\n                                     CLAY\n                         Mostly, we open a can of beans and \n                         boil some coffee.\n\n                                     MARY\n                         Where do you keep the can opener?\n\n                                     CLAY\n                         In the grub box.\n                              (softening)\n                         Toward morning the dew gets kind of \n                         heavy so maybe you better fix up a \n                         bed under the wagon. Spread some \n                         bunch grass under the tarp and the \n                         ground won't be so hard.\n\n               He turns and leads his horse back to the wagon, stands there \n               unsaddling it. Mary rises.\n\n                                     MARY\n                         Marcia -- all of you. Come on.\n\n               She starts downstream.\n\n               MED. SHOT\n\n               ANGLED PAST wagon. Clay tosses the saddle into the wagon \n               bed, slaps his mare on the rump. She trots off. Climbing up \n               on the wheel, he gets the grub box under the seat and lifts \n               it down. Steve comes from out of scene and starts unharnessing \n               the team.\n\n                                     STEVE\n                              (trying to be casual)\n                         Where'd they go?\n\n                                     CLAY\n                         Swimming.\n\n               Clay comes past him, carrying the grub box. He puts it down \n               near where some stones make a crude firebox.\n\n                                     STEVE\n                         It's sort of nice having company \n                         along. Not so lonesome.\n\n               Clay squats by the stones and starts building a fire.\n\n                                     CLAY\n                         When you get the team watered, rustle \n                         up some wood.\n\n               He fans the small flame with his hat. Steve leads the mules \n               down toward the stream.\n\n               MED. SHOT\n\n               ANGLED PAST Clay. In the B.g. Steve stands by the stream, \n               letting the team drink. O.s. the women can be heard laughing \n               and splashing. Steve gives all his attention to what is going \n               on downstream. Clay puts wood on the fire, opens the grub \n               box. He sees Steve, takes the coffee pot out of the box and \n               heads for the stream.\n\n               MED. LONG SHOT\n\n               ANGLED PAST Steve downstream. Behind the willows the girls \n               are bathing. However they are too far away to be seen clearly \n               and the willows make a fairly effective screen. Clay walks \n               upstream and fills the coffee pot, then comes back to stand \n               for a moment beside Steve. Steve, who hadn't seen Clay until \n               now, suddenly gets very busy giving all his attention to the \n               mules.\n\n                                     STEVE\n                              (to mules)\n                         You boys have had enough.\n\n               He jerks them from the water and leads them away. Clay frowns \n               after him, then goes back to the wagon.\n\n               MED. SHOT\n\n               on wagon and fire. As Clay passes the wagon, he reaches into \n               the bed and gets a couple of strips of scrap iron. These he \n               carries to the fire. He puts the iron strips across the blaze, \n               sets the coffee pot on, feeds the fire with some more wood, \n               then going back to the wagon, he takes his rifle out, throws \n               a shell into the chamber and starts off up the knoll.\n\n                                                                   DISSOLVE\n\n               EXT. KNOLL - NIGHT\n\n               MED. SHOT. It is a moonlight night. Clay squats on his heels, \n               smoking. The rifle lies across his knees. Below can be seen \n               the campfire, and the shadowy forms of the girls as with \n               Steve's help they make up a bed under the wagon and cook the \n               evening meal. Clay suddenly reacts as O.s. a horse whinnies. \n               Standing he looks off into the darkness.\n\n               LONG SHOT\n\n               ANGLED PAST Clay. In the moonlight the trail stretches back \n               over rolling hills. Faintly can be heard the SOUND of \n               hoofbeats. Below, where the remuda grazes, a horse whinnies \n               again. Clay moves down toward the camp.\n\n               MED. SHOT\n\n               the camp. As Clay approaches. Steve squats by the fire. He \n               has spread out a tarp in the circle of firelight and Mary is \n               setting the tin plates, cups, etc., out. Elaine, a blanket \n               around her, sits near the fire. She looks tired and ill. \n               Marcia and Helen are struggling with bed-making under the \n               wagon.\n\n                                     HELEN'S VOICE\n                         And I'm the girl who used to complain \n                         to my mother about helping with the \n                         wash.\n\n               Steve and Mary look up as Clay strides up. Clay starts kicking \n               dirt over the fire.\n\n                                     CLAY\n                         Get your rifle.\n\n               Steve jumps up and hurries to the wagon. Clay continues \n               kicking dirt over the fire.\n\n               EXT. CAMP - NIGHT - (MOONLIGHT)\n\n               LONG SHOT - ANGLES PAST horseman. The horseman, who has been \n               approaching from the east, tops a rise and looks off at the \n               camp. He is a shadowy figure in the palo dark. For a moment, \n               as the fire still blazes, figures are visible in the camp. \n               Then the fire goes out. The horseman dismounts, pulling his \n               rifle from his scabbard. Moving to his horse's head he puts \n               a hand on the animal's nostrils. He looks toward the camp \n               for a moment then starts cautiously along the road.\n\n               EXT. ROAD - NIGHT - (MOONLIGHT)\n\n               MED. SHOT - ANGLED THROUGH willows PAST Clay and Steve. The \n               brothers have taken up a post overlooking the road. The \n               horseman walks cautiously toward them. He stops, listening. \n               Then he drops his reins and comes forward stealthily. The \n               horse stands.\n\n               MED. CLOSE SHOT\n\n               Clay and Steve. Steve, finger on trigger gives Clay a \n               questioning glance. Clay shakes his head.\n\n                                     CLAY\n                              (calling)\n                         Hold it.\n\n               ANOTHER ANGLE\n\n               on road. The man, now seen clearly for the first time, stops. \n               He is Jim Clayton, a man in his twenties, chunky, round-faced, \n               stolid and not too imaginative. He wears the well-worn jeans \n               and blue shirt of the farmer. Clay and Steve come out of the \n               willows toward him. Both have their rifles ready.\n\n                                     CLAY\n                         Drop your gun.\n\n               Clayton hesitates, then lets his rifle butt drop to the road.\n\n                                     CLAYTON\n                              (mildly)\n                         Drop yours. I'm gunshy.\n\n                                     CLAY\n                         Then don't come sneakin' around a \n                         man's camp.\n\n                                     CLAYTON\n                         A fellow sees a fire go out all of a \n                         sudden, he don't take chances. My \n                         name's Clayton and I'm looking for \n                         someone.\n\n               Clay and Steve lower their rifles.\n\n                                     CLAYTON\n                         I found their surrey --\n\n                                     CLAY\n                         So did I. They were in it.\n\n                                     CLAYTON\n                         She's a friend -- took off this \n                         morning sort of sudden while I wasn't \n                         around.\n\n               Clay moves closer and extends his hand. They shake.\n\n                                     CLAY\n                              (very cordial)\n                         I'm glad you came along.\n                              (introducing)\n                         My brother, Steve. I'm Phillips.\n\n               Steve shakes Jim's hand.\n\n                                     CLAY\n                         I gave the girls a lift. Didn't know \n                         what else to do with them. Get your \n                         horse and come on.\n\n               Clayton turns back toward his horse. Clay and Steve wait for \n               him.\n\n               EXT. CAMP - NIGHT - (MOONLIGHT)\n\n               MED. SHOT - ANGLED BACK ALONG the trail. Mary and Helen, \n               tense and worried, stand at the edge of the camp, looking \n               off. Marcia is with Elaine under the wagon. From o.s. comes \n               the SOUND of men's voices. Clay, Steve and Clayton, leading \n               his horse, come into view.\n\n               CLOSE SHOT ON WAGON\n\n               Marcia kneeling on the tarp by Elaine, is staring ahead. \n               Suddenly her face lights up. She springs to her feet.\n\n               MARCIA'S ANGLE\n\n               Clay, Steve and Jim are now close to Mary.\n\n                                     CLAY\n                              (genial)\n                         Here's a man says he's looking for \n                         you girls.\n\n                                     CLAYTON\n                         Hello, Miss Wells.\n\n               Hearing his voice, Marcia runs toward them.\n\n               GROUP SHOT\n\n               Marcia throws herself into Jim's arms.\n\n                                     MARCIA\n                         Jim.\n\n               MED. CLOSE\n\n               Clayton kisses her.\n\n                                     CLAYTON\n                         I was roundin' up some stock. That's \n                         why I didn't come sooner.\n\n               Marcia hugs him. In the B.g. Clay goes over to the fire, \n               kicks the dirt off the embers and piles on wood. The fire \n               flares up.\n\n                                     CLAYTON\n                         What do you mean running off without \n                         a word.\n\n               TWO SHOT\n\n               Mary and Helen.\n\n                                     MARCIA'S VOICE\n                         I didn't know who to tell, it all \n                         happened so sudden, those people \n                         comin' and throwin' us out on the \n                         street.\n\n                                     JIM'S VOICE\n                         Don't you think about it, darlin'. \n                         Don't you think about anythin' but \n                         us.\n\n                                     HELEN\n                              (quietly)\n                         Looks like we lose a good piano \n                         player.\n\n               CAMERA ANGLE WIDENS as Marcia and Jim come forward. The fire \n               now burns briskly. Clay rejoins the group.\n\n                                     MARCIA\n                              (happily)\n                         Jim came after me, Mary.\n\n                                     MARY\n                              (dryly)\n                         I see he did.\n\n                                     HELEN\n                         With a milk pail in one hand and a \n                         marriage license in the other.\n\n                                     MARY\n                              (sharp)\n                         Why didn't you say you wanted to get \n                         married back in Aspen. I told the \n                         man in Sonora there were four of us. \n                         If only three show up, he might call \n                         the whole deal off. We've got to \n                         stick together. Like we've always \n                         done.\n\n                                     MARCIA\n                         I've got a chance to get married.\n\n                                     MARY\n                              (quickly)\n                         That's what I'm gettin' at. It never \n                         works. Don't forget we were thrown \n                         out of Aspen.\n\n                                     MARCIA\n                         Jim doesn't care, do you, Jim?\n\n               Mary speaks before Jim can answer.\n\n                                     MARY\n                         But Jim isn't the only one you're \n                         marrying. He has folks and friends. \n                         What are they going to say? And how're \n                         they going to feel? I tell you, it \n                         won't work.\n\n               The joy goes out of Marcia's expression. She looks up at \n               Jim, her eyes begging him to tell her it will work. Jim, a \n               naturally shy man, loses his tongue momentarily. Clay jumps \n               into the breach.\n\n                                     CLAY\n                         Of course it'll work. You can get \n                         another girl to fill out the act.\n\n                                     MARY\n                              (ignoring him)\n                         And look at it this way. How about \n                         Jim -- it puts him in a sort of tough \n                         spot.\n\n                                     JIM\n                         I know what I'm doing. My folks got \n                         nothin' to do with it --\n\n                                     MARY\n                         You've talked this over with them?\n\n                                     JIM\n                         They know about Marcia.\n\n                                     MARY\n                              (quickly)\n                         And they don't like the idea!\n\n                                     CLAY\n                         Suppose they don't. This is his \n                         problem. He's over twenty-one. He \n                         wants to marry Marcia and Marcia \n                         wants to marry him so let 'em alone.\n\n               Mary turns on Clay.\n\n               TWO SHOT\n\n               Clay and Mary. The others in the b.g.\n\n                                     MARY\n                         If you were in his shoes would you \n                         take one of us home?\n\n                                     CLAY\n                         I'm not in his shoes, so leave me \n                         out of it.\n\n               CAMERA ANGLE WIDENS as he turns back to the fire, embarrassed \n               by the spot he's in, and throws wood on it, Mary watching \n               him. Steve comes over to Mary.\n\n                                     STEVE\n                              (friendly)\n                         I would!\n\n               Clay swings around and comes back.\n\n                                     CLAY\n                              (hurriedly; smiles)\n                         Steve maybe you better get some wood \n                         for the fire.\n\n                                     MARY\n                         Would you, Mr. Phillips?\n\n                                     CLAY\n                              (to Steve)\n                         Go on, there's a good boy.\n\n               Clay gives Steve a gentle push. Steve exits.\n\n                                     MARY\n                              (bitter)\n                         Don't you want him to hear your \n                         answer? Well, I know what it is. For \n                         the other fellow it's all right -- \n                         but not you. All you want is to get \n                         rid of one of us.\n\n                                     JIM\n                         Wait a minute.\n\n               Jim, his arm around Marcia, moves closer. Helen is in the \n               B.g., watching.\n\n                                     JIM\n                         No need of you two arguin' about \n                         this. We know what we want to do, \n                         and nothin' either of you says makes \n                         any difference. We want to go home -- \n                         tonight.\n                              (to Clay)\n                         Will you sell me one of your horses?\n\n                                     CLAY\n                         I'm sorry. I can't do that. I went a \n                         long way to get those horses.\n\n                                     JIM\n                         All right, we'll ride double. Come \n                         on, Marcia.\n\n               Taking her arm he leads her to where the horse stands at the \n               edge of the camp.\n\n               ANOTHER ANGLE\n\n               featuring Marcia and Jim. In the B.g. Mary comes after them.\n\n                                     MARY\n                         No need to do that, Marcia.\n\n               Jim and Marcia turn.\n\n                                     MARY\n                         We've got two horses and they're \n                         four of us. So half of one of 'em is \n                         yours.\n                              (smiling)\n                         The other half's a wedding present.\n\n               Marcia comes over to hug Mary. As Marcia and Jim leave, Mary \n               moves to Clay.\n\n                                     MARY\n                         Big-hearted fella. Can't see young \n                         love thwarted -- especially if it \n                         makes one less girl to worry about. \n                         That's all you really want, isn't \n                         it.\n\n                                                                   DISSOLVE\n\n               EXT. CAMP SITE - NIGHT\n\n               MED. SHOT. Mary stands in the moonlight by the wagon, looking \n               out across the meadow. Below, near the creek, the horses \n               graze. There is the soft jangle of a bell as the bell mare \n               moves her head. Clay comes walking up from the creek, rifle \n               in hand. He passes without noticing Mary. Mary turns.\n\n               REVERSE SHOT\n\n               Mary in close F.g. The campfire burns low. Steve lies on his \n               stomach close to it. Clay stops beside him to glance down, \n               then moves on to sit on a rock above the fire. Mary starts \n               toward the fire.\n\n               MED. CLOSE\n\n               Steve. Open in front of him is a copy of Leslie's Weekly, a \n               woman's journal: pictures of baby basinettes, whale-bone \n               corsets, fancy oil lamps, etc. Mary comes into scene to stand \n               above him, looking down. Steve glances up and smiles.\n\n                                     MARY\n                         Is that your kind of reading, Steve?\n\n                                     STEVE\n                         I can't read, Ma'am. I just look at \n                         the pictures.\n\n               MED. SHOT\n\n               ANGLED DOWN PAST Clay.\n\n                                     MARY\n                         You can't read?\n\n               She glances up where Clay sits.\n\n                                     MARY\n                         Your brother's always looked after \n                         you, hasn't he?\n\n                                     STEVE\n                         Since I can remember, Ma'am.\n\n                                     MARY\n                         But he just never troubled to have \n                         you get any schooling?\n\n               CLOSE SHOT\n\n               Clay. He listens, perturbed.\n\n               MED. SHOT\n\n               Mary and Steve.\n\n                                     STEVE\n                         It wasn't Clay's fault. We've been \n                         moving around most all the time -- \n                         mebbe when we get the ranch and stay \n                         in one place I can learn my letters \n                         then --\n\n                                     MARY\n                         Don't you even know your letters?\n\n               CLOSE SHOT\n\n               Clay. He winces at!\n\n                                     STEVE'S VOICE\n                         No, Ma'am.\n\n               MED. SHOT\n\n               Mary, Steve and Clay. Behind them, Clay rises and comes down \n               nearer the fire.\n\n                                     MARY\n                         Would you like to learn them?\n\n                                     STEVE\n                         I sure would.\n\n                                     MARY\n                         Maybe I could start you out.\n\n                                     STEVE\n                         That'd be swell.\n                              (shyly)\n                         You know, you're an awful lot \n                         different than I thought you'd be.\n\n               She gives him a quick look of inquiry.\n\n                                     STEVE\n                         You're so nice.\n\n                                     MARY\n                         Did someone say I wasn't nice?\n\n                                     STEVE\n                         Oh no. Nobody said nothing to me. \n                         Only I got the idea that -- well \n                         Clay and me used to be walking through \n                         town and there was your place and \n                         through the window I could see you \n                         dancing, but Clay always took me \n                         over to the other side of the street.\n\n                                     CLAY\n                              (interrupting)\n                         Time to go to bed, Steve.\n\n               Steve looks up, then rises reluctantly.\n\n                                     STEVE\n                         Good night, Miss Wells.\n\n                                     MARY\n                         Good night, Steve.\n\n               Steve exits. Mary looks after him, then up at Clay.\n\n                                     MARY\n                              (soft)\n                         There's a nice boy.\n\n                                     CLAY\n                         Yeah.\n\n                                     MARY\n                              (sharp)\n                         That why you always took him on the \n                         other side of the street?\n\n               Clay kicks loose embers into the fire.\n\n                                     MARY\n                              (sharper)\n                         Maybe I don't make the grade in some \n                         ways, but I know enough to teach a \n                         kid his letters.\n\n               Clay turns from the fire to stand above her.\n\n                                     CLAY\n                              (quiet)\n                         He doesn't know his letters, no -- \n                         but he knows the names of animals... \n                         he knows what roots to eat when you're \n                         clear out of food... He knows the \n                         difference between a possum and a \n                         coon just by lookin' at the tracks... \n                         more than most trappers know... and \n                         he can tell whether she'll rain or \n                         shine tomorrow by smelling the air \n                         tonight. There's a lot of things he \n                         doesn't know, I hope he'll never \n                         learn.\n\n               He pauses, looking down.\n\n                                     MARY\n                         Like what?\n\n                                     CLAY\n                              (turning away)\n                         Like sticking his nose into other \n                         people's business.\n\n               Clay moves out of the circle of firelight to stop and pick \n               up his rifle, tarp and blanket, then climbs the knoll. Mary \n               stares into the fire, then rising she starts toward the wagon.\n\n               EXT. KNOLL - NIGHT - MOONLIGHT\n\n               MED. SHOT. Clay reaches the top of the knoll and stands \n               looking off. Below him the campfire burns low. Mary reaches \n               the wagon.\n\n               EXT. WAGON - MOONLIGHT - NIGHT\n\n               MED. SHOT ANGLED PAST Mary TOWARD Clay. Mary stops, looking \n               up. A match flares as Clay lights a cigarette. O.s. there is \n               the SOUND of the bell mare's bell, the SOUND of horses moving \n               restlessly. Mary turns, looks under the wagon.\n\n               MED. CLOSE DOWN ANGLE\n\n               Elaine is gone. Helen is asleep. Mary drops to her knees on \n               the tarp and shakes Helen in wakefulness.\n\n                                     MARY\n                         Where's Elaine?\n\n               Helen sits up and looks over at Elaine's side of the bed.\n\n                                     HELEN\n                         She was here a while ago.\n\n               Mary straightens, moves down past the wagon, CAMERA PANNING \n               WITH her. She calls softly.\n\n                                     MARY\n                              (softly)\n                         Elaine!\n\n               MED. CLOSE\n\n               Clay. He looks down toward the wagon as Mary calls Elaine's \n               name again, this time louder.\n\n                                     MARY'S VOICE\n                         Elaine.\n                              (then)\n                         Clay -- Elaine's gone.\n\n               Clay frowns, pitches his cigarette away and starts down toward \n               the wagon.\n\n               MED. CLOSE\n\n               Steve. He is sitting up, pulling on his boots. From under \n               the bedclothes he takes his rifle and starts toward the wagon.\n\n               MED. SHOT\n\n               wagon. Clay stands with Mary at the wagon as Steve comes up. \n               Helen is sitting up in bed, a comforter pulled around her.\n\n                                     HELEN\n                         She can't have gone far. I wasn't \n                         asleep long.\n\n                                     CLAY\n                         What would she run off for?\n\n                                     MARY\n                              (excited)\n                         Because she's sick.\n\n               She starts away into the darkness.\n\n                                     CLAY\n                              (sharp)\n                         Stay here. One woman wanderin' off's \n                         enough.\n\n               Mary turns back.\n\n                                     STEVE\n                         Don't you worry, Miss Wells. We'll \n                         find her.\n\n               Clay picks up his saddle and bridle.\n\n                                     CLAY\n                              (to Mary)\n                         Build the fire up and stick close to \n                         it. Come on, Steve.\n\n               He starts down toward the meadow. Steve follows. Helen \n               scrambles out from under the wagon.\n\n               EXT. CREEK - NIGHT - MOONLIGHT\n\n               Clay stops by the creek. Behind him the fire smoulders near \n               the wagon. Mary's shadowy figure can be seen climbing the \n               knoll where Clay's bedroll is. Helen is near the fire.\n\n                                     CLAY\n                              (annoyed)\n                         Look around. She can't have gone \n                         far.\n\n               Steve nods and splashes across the creek to follow the road \n               leading west. Clay starts toward the meadow where the horses \n               graze.\n\n               EXT. ROAD - NIGHT - (MOONLIGHT)\n\n               MED. SHOT. Steve moves slowly along the road away from camp. \n               He is scanning the dust for Elaine's footprints.\n\n               EXT. KNOLL - NIGHT - (MOONLIGHT)\n\n               LONG SHOT - ANGLED PAST Mary. Mary stands on the knoll looking \n               off. Far below, in the meadow, Clay saddles his horse.\n\n                                     MARY\n                              (calling)\n                         Elaine -- Elaine -- Elaine.\n\n               EXT. MEADOW - NIGHT - MOONLIGHT\n\n               MED. SHOT. Clay swings into the saddle, and rides east. O.s. \n               Mary calls:\n\n                                     MARY'S VOICE\n                         Elaine -- Elaine.\n\n               As the call echoes across the hills.\n\n                                                                   DISSOLVE\n\n               EXT. DESERT - NIGHT - (MOONLIGHT)\n\n               MED. SHOT. This is rough country, the rocky hills covered \n               sparsely with scrub pinon pine and brush. Steve stands on a \n               rise. He looks around for a moment, then turning starts back \n               down the slope. Suddenly he stops and listens, as from O.s. \n               comes the SOUND of distant sobbing.\n\n               CLOSE SHOT\n\n               Steve. He listens, trying to locate the sound then he hurries \n               down into a dry wash.\n\n               EXT. WASH\n\n               Steve crashes through the brush into the wash, to stop beside \n               Elaine who sits with her head buried in her arms, sobbing.\n\n               MED. CLOSE\n\n               Steve and Elaine. Steve drops on his knees beside her. Elaine \n               doesn't look up. Steve shakes her.\n\n                                     STEVE\n                         Ma'am -- you shouldn't have run off \n                         like that. Why I was just about to \n                         give up lookin'. Come on, now.\n\n               Elaine doesn't move.\n\n                                     STEVE\n                         You can't stay here. There's snakes \n                         and it's cold and you'll just get \n                         sicker.\n\n                                     ELAINE\n                         I don't care.\n\n                                     STEVE\n                         Suppose that Lednov was to have found \n                         you, instead of me. Why you wouldn't \n                         have had a chance.\n\n                                     ELAINE\n                              (sharp)\n                         I said I didn't care.\n\n                                     STEVE\n                         What's botherin' you, anyway?\n\n               He pulls her up.\n\n                                     STEVE\n                         Runnin' off and worryin' people. \n                         Makin' it tougher on Clay than it is \n                         already.\n\n                                     ELAINE\n                              (hysterical)\n                         Don't ask me because I won't tell \n                         you! I won't tell anybody! Go away!\n\n                                     STEVE\n                         Don't act so -- crazy.\n\n                                     ELAINE\n                              (dully)\n                         I'm sorry. Let's go.\n\n                                     STEVE\n                              (relieved)\n                         That's a good girl.\n\n               CAMERA ANGLE WIDENS as he tucks her arm in the crook of his \n               own and starts up the other side of the wash.\n\n               ANOTHER ANGLE\n\n               Steve, holding Elaine's arm, scrambles up the bank and through \n               the brush.\n\n                                     STEVE\n                         That's it. Watch out where you're \n                         steppin' --\n\n               He stops and looks off. Faintly O.s. is heard the SOUND of \n               hoofbeats.\n\n                                     STEVE\n                         That oughta be --\n                              (then sharp)\n                         Down.\n\n               He shoves the girl down.\n\n               LONG SHOT\n\n               their ANGLE. Over a hill comes a horseman to be followed by \n               another and then a third.\n\n               CLOSE SHOT\n\n               Steve and Elaine.\n\n                                     STEVE\n                         Lednov --\n\n               Excitedly he swings the rifle to his shoulder and fires.\n\n               EXT. DESERT - NIGHT - MOONLIGHT\n\n               FULL SHOT - Clay reins his horse in and turns to look off in \n               the direction from which the shot came. Faintly o.s. another \n               shot echoes across the hills, then another and another. Clay \n               spurs his horse and gallops off.\n\n               EXT. HILLTOP - NIGHT - MOONLIGHT\n\n               Clay gallops up the hill to rein his horse in suddenly.\n\n               MED. LONG SHOT\n\n               his ANGLE. Riding toward him are several horsemen. The horses \n               move at a walk. One carries a double burden. Steve walks \n               along behind. Clay spurs his horse and rides down toward \n               them.\n\n               ANOTHER ANGLE\n\n               Clay, in the B.g., comes down the hill. The horsemen, seven \n               of them, with Sheriff Gardner in the lead, followed by a \n               deputy, carrying Elaine in front of him, file past camera. \n               Steve, hands in his pockets, walks dejectedly in the dust \n               cloud kicked up by the horses.\n\n               MED. SHOT\n\n               featuring Clay and Gardner. Clay reins in his horse beside \n               Gardner, who also stops. The others rein in. Steve stops a \n               short distance away.\n\n                                     GARDNER\n                         Want to take her off our hands?\n\n               Clay rides closer. The deputy rides forward and lifts Elaine \n               into his arms. Clay settles her in front of him.\n\n                                     CLAY\n                         Who shot who?\n\n                                     GARDNER\n                         Nobody. The light was bad.\n\n               There are two rifles in his saddle holster. He pulls Steve's \n               out, hands it over.\n\n                                     GARDNER\n                         Steve's!\n\n               Clay shoves it in his saddle holster.\n\n                                     GARDNER\n                         What's she doin' runnin' around the \n                         country at night.\n\n                                     CLAY\n                         I wouldn't know. Did you ask her?\n\n                                     GARDNER\n                         All I can get out of her is she don't \n                         care about livin'.\n\n                                     CLAY\n                         Look of things, she doesn't.\n\n                                     GARDNER\n                         Yeah. Keep a closer eye on her --\n                              (motioning to Steve)\n                         And him. Shootin' going on, we'll \n                         never find Lednov.\n\n               He wheels his horse and rides off, followed by the others \n               Clay watches him go. Reluctantly Steve moves slowly up to \n               stand near Clay.\n\n                                     STEVE\n                         There was only three of them at first. \n                         I guess I lost my head.\n\n                                     CLAY\n                              (dryly)\n                         How'd you happen to miss?\n\n                                     STEVE\n                         They were quite a ways off and the \n                         wind was blowin'. I didn't have them \n                         to aim.\n\n                                     CLAY\n                         Good thing you didn't.\n\n               He reins his horse around.\n\n                                     STEVE\n                         Clay --\n\n               Clay looks back.\n\n                                     STEVE\n                         A man can't help gettin' excited \n                         once in a while.\n\n                                     CLAY\n                         That's right, Steve.\n\n                                     STEVE\n                         Can I have my gun back?\n\n                                     CLAY\n                         Sure. You'll find it under the wagon \n                         seat. Like I said before, a twenty-\n                         two's more your size.\n\n                                                                   FADE OUT\n\n               EXT. TRAIL - DAY FADE IN\n\n               EXTREME LONG SHOT. West are the Sierras and clouds are piled \n               in untidy heaps on the range. The dusty trail runs through \n               rolling country. Pinon pine and brush clothe the slopes. The \n               wagon and horses are the moving center of a white cloud of \n               dust.\n\n               FULL SHOT\n\n               Clay's party. Clay rides in the lead. The wagon follows and \n               Steve is riding beside the wagon. Behind is the remuda, and \n               the horses are straying off the road in search of grass.\n\n               MED. SHOT\n\n               wagon - (MOVING). Featuring Steve and Mary. Elaine lies under \n               the seat and Helen sits beside her. Steve is reciting the \n               alphabet to a simple melody usually sung by children of six \n               or seven.\n\n                                     STEVE\n                              (stumbles embarrassedly)\n                         Gee, I can't.\n\n                                     MARY\n                         Why not? You went farther than that \n                         last time.\n\n                                     STEVE\n                         I'm too old for it, Miss Wells... \n                         That's for little kids.\n\n                                     MARY\n                         Don't be silly... Nobody's too old \n                         to learn.\n\n                                     STEVE\n                              (resolutely)\n                         Okay. A-B-C -- D-E-F -- G-H-I --\n\n               CLOSE SHOT\n\n               Clay. He turns in his saddle where he rides ahead of the \n               team. He notices Steve riding at Mary's side and reins in \n               his horse.\n\n                                     CLAY\n                              (mildly)\n                         Oh, Steve!\n\n               MED. SHOT\n\n               Steve and Mary. Steve stops his letters. looks off. The wagon \n               moves up to Clay and stops.\n\n                                     CLAY\n                         Get back to the horses. They're \n                         straggling.\n\n                                     MARY\n                         He's learning his letters.\n\n                                     CLAY\n                         Yeah. While the horses wander all \n                         over the country.\n\n               Steve hesitates hoping he'll change his mind.\n\n                                     CLAY\n                              (sternly)\n                         Do like I said.\n\n               Steve wheels his horse and rides back. Mary looks over at \n               Clay.\n\n                                     MARY\n                              (dryly)\n                         Learnin' to read has nothing to do \n                         with the right or the wrong side of \n                         the street.\n\n                                     CLAY\n                              (motioning)\n                         Are the horses stragglin' or aren't \n                         they?\n\n                                     MARY\n                              (after a backward \n                              glance)\n                         They're stragglin'.\n\n                                     CLAY\n                         His letters will keep.\n\n               He wheels his horse and rides after Steve.\n\n               ANOTHER ANGLE\n\n               Steve is driving the horses back into the road. Clay rides \n               up to help him. The horses fall in behind the wagon. Steve \n               takes up his position in the rear. Clay rides over beside \n               him.\n\n               MED. SHOT\n\n               CLAY AND STEVE. (MOVING)\n\n                                     CLAY\n                         Steve -- I want you to learn to read. \n                         I meant to teach you but I never \n                         seemed to find time. I figured when \n                         we got settled on the ranch we'd get \n                         around to it.\n\n               They ride in silence for a moment.\n\n                                     CLAY\n                         It's all right with me if she teaches \n                         you, but I don't want you forgettin' \n                         your job.\n\n                                     STEVE\n                              (flat)\n                         I won't again.\n\n               ANOTHER ANGLE\n\n               One of the horses strays out of line and Clay rides out and \n               gets the animal back in the road. Then he returns to Steve.\n\n               TWO SHOT - (MOVING)\n\n                                     CLAY\n                         This isn't like other trips we've \n                         taken. For one thing, we've got a \n                         wagonload of women. For another \n                         there's a guy wanderin' around hopin' \n                         to put a bullet in my back.\n\n               Steve looks over at his brother and finds a wry grin.\n\n                                     STEVE\n                         Okeh, I was wrong. But you can't \n                         expect a fellow who never saw Lednov \n                         and never heard his name until a \n                         while ago to do too much worryin'. \n                         You've been sorta close mouthed about \n                         him.\n\n                                     CLAY\n                         I guess I have. You were pretty little \n                         when they locked him up. I don't \n                         suppose you even remember that time \n                         I was gone two months.\n\n                                     STEVE\n                         Sure I remember. You went to Mexico \n                         lookin' for cattle.\n\n                                     CLAY\n                              (nods; then, after a \n                              moment)\n                         You remember Jeff Rawson? -- We used \n                         to go fishing and hunting with him \n                         when you were so high.\n\n                                     STEVE\n                              (offended)\n                         Sure I do. Went off down to Mexico \n                         or something...\n\n                                     CLAY\n                         That's what I told you then. Only he \n                         didn't. Lednov killed him.\n\n                                     STEVE\n                         Oh... that's the time you went away.\n\n                                     CLAY\n                              (nods)\n                         I caught up with Lednov in Nogales. \n                         He didn't like the idea of comin' \n                         back across the border but he came. \n                         I turned him over to the sheriff and -- \n                         that's the story.\n\n                                     STEVE\n                              (looking off)\n                         Maybe you shoulda killed him.\n\n                                     CLAY\n                         Maybe I should. But I was never much \n                         on killin'. Anyway, he moved too \n                         quick and I just got him through the \n                         shoulder.\n                              (glances off)\n                         Looks pretty peaceful up ahead.\n\n                                     STEVE\n                         Yeah, it does.\n\n                                     CLAY\n                         But you never can tell. Why don't \n                         you get that new rifle out of the \n                         wagon?\n\n               Steve smiles warmly at him.\n\n                                     CLAY\n                         And while you're there you might as \n                         well find out what comes after K.\n\n                                                                   DISSOLVE\n\n               EXTREME LONG SHOT\n\n               Cavalcade. It moves through dry barren hills. Far off, the \n               Sierras rise against the sky Thunder heads are piled in untidy \n               heaps on the range.\n\n                                                               DISSOLVE OUT\n\n               EFFECT SHOT DISSOLVE IN\n\n               sky. Dark rain clouds blown by a high wind. SOUND of thunder.\n\n               FULL SHOT\n\n               rain -- the caravan. Clay leads it through a rain that has \n               filled the ruts in the trail, soaked the horses to glistening \n               black -- and obscures all view of the country through which \n               they are passing. SOUND of rain falling is loud. Clay and \n               Steve both wear slickers, gleaming from their shoulders to \n               the rumps of their horses. Mary, a tarp around her shoulders, \n               drives. Elaine and Helen huddle under a tarpaulin in the \n               wagon bed.\n\n               MED. CLOSE SHOT\n\n               rain -- DOWN ANGLE -- wagon moving. Elaine sits up and, in \n               her delirium, throws off the tarp. Helen tries to pull her \n               down.\n\n                                     HELEN\n                              (crying out)\n                         Elaine -- stop it --\n\n               CLOSE SHOT\n\n               rain -- Clay. He wheels his horse at the SOUND of Helen's \n               voice and rides back through the rain toward the wagon.\n\n               MED. CLOSE SHOT\n\n               rain -- wagon. Mary pulls on the reins and the mules stop. \n               Twisting them around the whip-stock, she swings back into \n               the wagon bed. She looks up at Clay.\n\n                                     MARY\n                         She should be in bed where it's dry.\n\n               In her anxiety, her tone is accusing. Clay drops the reins, \n               climbs into the wagon and bends down beside Elaine. He puts \n               his hand on her forehead.\n\n               MED. CLOSE\n\n               rain - DOWN ANGLE - featuring Clay and Mary.\n\n                                     CLAY\n                              (dryly)\n                         Yes, Ma'am, she should...\n\n               He starts fixing the tarp so it gives more protection to the \n               sick girl.\n\n                                     CLAY\n                         But the nearest shelter's the Wyatt \n                         ranch and that's maybe five hours \n                         away.\n\n                                     MARY\n                         Can we get a doctor at that ranch?\n\n                                     CLAY\n                              (straightening)\n                         No, Ma'am, we can't. We can get a \n                         roof and a fire and maybe Mrs. Wyatt \n                         knows something about taking care of \n                         sick people.\n\n               ANOTHER ANGLE\n\n               rain. Clay vaults out of the wagon and mounts his horse. \n               Mary rises and climbs back into the seat. She lashes the \n               mules with the reins. The wagon jolts forward.\n\n               MED. CLOSE SHOT\n\n               rain - ANGLED ACROSS seat - (MOVING). Clay rides alongside. \n               Then, without a word, he strips off his slicker, tosses it \n               on the seat and rides off. Mary looks after him, then at the \n               slicker. She hesitates, not wanting to take favors from him. \n               Then she pulls the slicker around her. Taking the whip, she \n               hits the mules. CAMERA ANGLE WIDENS and CAMERA HOLDS. The \n               team breaks into a trot. The cavalcade moves away from camera \n               through drenching rain.\n\n                                                                   DISSOLVE\n\n               EXT. WYATT RANCH - DAY\n\n               LONG SHOT - ANGLED THROUGH gate in barbed wire fence. The \n               ranch is nestled in a valley at the base of the Sierras. \n               Green meadowland surrounds the farm buildings which consist \n               of a cabin, barn and sheds, all in good repair and white-\n               washed, as are the corral fences and the picket fence around \n               the house, which stands in a clump of trees. The wind has \n               pushed the clouds back over the hills, but far off there is \n               still thunder. The gate in front f.g. is of barbed wire. It \n               is closed. On the fence post a board is tacked. Neatly \n               lettered on the board is the name:\n\n                                         ED WYATT\n\n               From o.s. comes the SOUND of horses moving restlessly and \n               the creaking of saddle leather, as a man swings out of the \n               saddle. Footsteps approach. A man's head and shoulders, back \n               to camera, comes into scene. He unloops the strand of bailing \n               wire and lets the gate fall open, then turns and we see his \n               face. He is Lednov. His cheek and jowls have a dark growth \n               of beard. He wears a black leather jacket and a wrangler's \n               grey hat. The clothes Forster was wearing. As he moves back \n               to his horse, CAMERA PULLS BACK and PANS AROUND.\n\n               His companions, McCall and Peters, also wear black leather \n               jackets, sombre, dusty pants and hats. They are mounted on \n               matched roans. The horses are winded, lathered and dirty. It \n               is obvious they have ridden hard. Lednov strides forward and \n               as he reaches for the reins the horse shies away. Brutally \n               he jerks on the reins. The horse rears. He snatches his hat \n               from his head and whacks the horse across the nose. McCall \n               rides over and grabs the reins. Lednov scrambles into the \n               saddle.\n\n               MED. SHOT\n\n               ANGLED TOWARD gate. Lednov rides forward through the gate. \n               His horse is limping badly. The others follow. They do not \n               stop to put the gate back up.\n\n                                                                   DISSOLVE\n\n               EXT. TRAIL - DAY\n\n               LONG SHOT. Clay's cavalcade moves forward along the trail. \n               There are cloud patches overhead and faintly in the back \n               country thunder rumbles. The mules pull the jolting wagons \n               forward in a slow trot. Clay rides ahead. Steve and the remuda \n               follow.\n\n                                                                   DISSOLVE\n\n               EXT. WYATT RANCH - DAY\n\n               FULL SHOT. Lednov, McCall and Peters ride into the yard and \n               up to the horses' trough. The horses plunge their muzzles \n               deep into the trough. As the men dismount, Wyatt, a sinewy \n               little man, hurries from the direction of the barn.\n\n               MED. SHOT\n\n               at horse trough. Wyatt, smiling his pleasure, comes up as \n               the three men dismount.\n\n                                     WYATT\n                              (happily)\n                         My name's Wyatt. Certainly glad you \n                         boys dropped in.\n\n               He extends his hand to Lednov. Lednov ignores it. The three \n               men are looking around them. Two work horses, fat and elderly, \n               amble across the corral to nuzzle the roans through the fence.\n\n                                     LEDNOV\n                         Those the only horses you got?\n\n               Wyatt is a little taken aback by Lednov's manner.\n\n                                     WYATT\n                         Why, yes. They're all I need...\n\n                                     LEDNOV\n                         Mine's gone lame. Take a look at \n                         him.\n\n               Wyatt frowns up at Lednov, angered by the order.\n\n                                     LEDNOV\n                         Go on, we haven't got all day.\n\n               McCall and Peters move closer to Wyatt, who glances around \n               worriedly. Realizing he better do as he's told, he goes to \n               the roan and rubs his ears.\n\n                                     WYATT\n                         Whoa, boy. Let's have a look.\n\n               Bending, he lifts the horse's hoof. Lednov, McCall and Peters \n               watch him. He drops the hoof, straightens.\n\n                                     WYATT\n                         He dropped a shoe. You shouldn't be \n                         ridin' him.\n\n                                     LEDNOV\n                         Put on another one.\n\n                                     WYATT\n                         That won't help the stone bruise. \n                         You ain't been around horses much, \n                         looks like.\n\n                                     LEDNOV\n                         Will you quit gabbin' and do what \n                         you're told.\n\n               Wyatt hesitates. Lednov steps toward him.\n\n                                     WYATT\n                              (frightened, bewildered)\n                         All right, but it won't do much good.\n\n               He picks up the roan's reins and starts leading him into the \n               corral. Lednov, with a jerk of his thumb, indicates that \n               McCall is to go with him. McCall follows. Lednov and Peters \n               turn toward the house.\n\n               ANOTHER ANGLE\n\n               As Lednov and Peters start for the house, Mrs. Wyatt, a woman \n               of about fifty, small, plump, browned from the sun and hard \n               from work, comes out on the porch. She has taken off her \n               apron and holds it in her hand. She smiles at the two men.\n\n               MED. SHOT\n\n               ANGLED PAST Mrs. Wyatt. She starts down the steps as Lednov \n               and Peters come up.\n\n                                     MRS. WYATT\n                         I was up to my elbows in flour when \n                         you boys rode up, that's why I din't \n                         come out sooner. I hope Ed asked you \n                         to stay the night?\n\n                                     LEDNOV\n                         All we want's supper.\n\n               At his tone, the welcoming smile leaves her face. She looks \n               from one to the other. Lednov pushes past her up the steps \n               and into the house. Mrs. Wyatt follows him with her glance. \n               McCall motions.\n\n                                     MCCALL\n                         We're in a hurry.\n\n                                                                   DISSOLVE\n\n               EXT. TRAIL\n\n               LONG SHOT. In the f.g. the cavalcade moves along the trail. \n               Now the Sierras back of the Wyatt ranch are much closer. The \n               sun has set but it is still light.\n\n                                                                   DISSOLVE\n\n               EXT. RANCH HOUSE - DAY\n\n               MED. SHOT. Peters sprawls on the ground, smoking. He looks \n               up as Wyatt and McCall cross from the direction of the barn.\n\n                                     PETERS\n                         Take care of that horse?\n\n                                     WYATT\n                              (gruffly)\n                         Yeah. The best I could.\n\n               Wyatt goes on past and hurries up the steps.\n\n               INT. RANCH HOUSE\n\n               ANGLED PAST Wyatt. This is the main room of the house -- a \n               living room and kitchen combined: wood-stove against one \n               wall, a sink with a pump against another, a fireplace, some \n               simple furniture and, hanging from one of the rough walls, a \n               concertina. Through an open doorway can be seen the Wyatt's \n               bedroom. Another door, closed, leads into the second bedroom. \n               The house has a warm, well-scrubbed look. Wyatt enters.\n\n               Mrs. Wyatt, stoking the stove, turns. She glances nervously \n               in the direction of the bedroom. Wyatt shifts his glance to \n               the fireplace -- there is no gun hanging from the hooks above \n               the mantel. Lednov appears in the doorway of the bedroom.\n\n                                     WYATT\n                         What are you doin' --\n\n                                     LEDNOV\n                         Lookin' around.\n\n               He crosses to the fireplace. He is carrying Wyatt's rifle, \n               gun belt and six gun.\n\n                                     LEDNOV\n                         These all the shells you got?\n\n               Wyatt has had as much of this as he can stand. He starts \n               angrily across the room.\n\n                                     WYATT\n                         Put my guns down and get out of here --\n\n                                     MRS. WYATT\n                         Ed -- no, Ed.\n\n               She crosses to him and stands in his way. Wyatt pushes past \n               her and grabs for the guns. Lednov gives him a swipe with \n               the back of his hand, knocking him away easily.\n\n                                     LEDNOV\n                         Your old woman's got sense -- you \n                         listen to her.\n\n               Mrs. Wyatt helps Ed to his feet. She puts an arm around him.\n\n                                     LEDNOV\n                         I asked you -- these all the shells \n                         you got?\n\n                                     MRS. WYATT\n                              (quickly)\n                         They's a box in the cupboard over \n                         the sink.\n\n               Lednov crosses to the cupboard and opens it. Finding the box \n               of shells, he slips it in his pocket.\n\n                                     LEDNOV\n                              (to Ed)\n                         Get on about your chores.\n                              (to Mrs. Wyatt)\n                         And hurry that grub up.\n\n               Wyatt and his wife look at each other. Then meekly they obey.\n\n                                                               DISSOLVE OUT\n\n               EXT. HILLTOP - NIGHT DISSOLVE IN\n\n               MED. SHOT. Here the trail starts down into the valley. From \n               o.s. comes the SOUND of the cavalcade approaching. Clay rides \n               into the scene and stops on the hilltop to glance ahead.\n\n               LONG SHOT\n\n               Clay's ANGLE. A light can be seen ahead in the valley.\n\n               REVERSE ANGLE\n\n               Clay turns and rides back toward the wagon. The mules have \n               slowed to a walk in the climb up the hill.\n\n               MED. CLOSE SHOT\n\n               on wagon - (MOVING). Clay rides up alongside. Mary is hunched \n               forward on the seat.\n\n                                     CLAY\n                         Only a little ways now -- maybe a \n                         mile.\n\n               He glances down into the wagon bed where Helen is sitting by \n               Elaine.\n\n                                     CLAY\n                         How's she makin' out?\n\n                                     HELEN\n                              (dryly)\n                         If she feels worse than I do, she's \n                         dyin'.\n\n               Clay rides back toward the rear.\n\n                                     CLAY\n                              (calling)\n                         Steve --\n\n                                     STEVE'S VOICE\n                         Yo --\n\n               MED. FULL SHOT\n\n               The wagon reaches the crest of the hill. Mary hits the mules \n               with the reins. The mules break into a trot. Behind, the \n               remuda comes into view. Clay sits his horse by the side of \n               the trail and watches.\n\n               EXT. FARM HOUSE - NIGHT\n\n               MED. SHOT. Mrs. Wyatt stands by the stove, watching the three \n               men at the table. Wyatt sits in a chair by the stove.\n\n                                     MCCALL\n                         I'll have some more of that coffee.\n\n               Lednov pushes his chair back and rises.\n\n                                     LEDNOV\n                         We got to get movin'.\n\n                                     MCCALL\n                         What for?\n\n                                     LEDNOV\n                         Because there's a man I want to see.\n\n                                     MCCALL\n                         He can wait. Let's stay here until \n                         morning.\n\n               Wyatt and his wife exchange frightened glances. That's the \n               last thing they want.\n\n                                     LEDNOV\n                              (rising)\n                         I said let's go.\n\n                                     MCCALL\n                              (protesting)\n                         One night more won't matter. Your \n                         friend'll be there. Anyway I don't \n                         think so much of the idea of prowling \n                         around his ranch. He knows you're \n                         out so he ain't going to sit still \n                         for it.\n\n                                     LEDNOV\n                              (fierce)\n                         I said I had a guy to see and I'm \n                         going to see him.\n\n               With the fingers of his right hand he automatically rubs his \n               shoulder just above the heart.\n\n                                     LEDNOV\n                         He gave me something once so I \n                         wouldn't forget.\n\n                                     PETERS\n                              (rising)\n                         He says go, we go.\n\n               Grudgingly, McCall gives in. They exit. Wyatt stares after \n               them raging at his impotence.\n\n                                     WYATT\n                         If they'd only left me a gun, I'd \n                         fix 'em.\n\n                                     MRS. WYATT\n                         Hush, Ed. Hush. They might come back.\n\n               EXT. CORRAL - NIGHT\n\n               MED. FULL SHOT. The three men mount their horse, dig their \n               spurs in and ride away. As they ride toward the gate, Wyatt \n               comes out on the steps.\n\n               EXT. TRAIL - NIGHT\n\n               LONG SHOT. Here the trail passes through a narrow draw, then \n               climbs a small rise which overlooks the gate. Clay's caravan \n               jogs along the trail.\n\n               EXT. HILLTOP - NIGHT\n\n               LONG SHOT - DOWN ANGLE. The caravan climbs toward camera. \n               CAMERA PANS AROUND to SHOOT DOWN TOWARD the Wyatt ranch. \n               Through the gate ride Lednov, McCall and Peters. They stop \n               for a moment then turn right and trot along the fence line. \n               As they disappear, the SOUND of the caravan's approach is \n               heard o.s.\n\n                                                                   DISSOLVE\n\n               EXT. WYATT RANCH - NIGHT - (MOONLIGHT)\n\n               MED. FULL SHOT. Clay gallops into the yard and swings out of \n               the saddle. The farmhouse is dark.\n\n               INT. FARMHOUSE - NIGHT\n\n               ANGLED THROUGH window, PAST Wyatt. Clay opens the gate and \n               hurries up the steps and across the porch.\n\n               EXT. PORCH - NIGHT\n\n               MED. SHOT. Clay raps on the door.\n\n                                     CLAY\n                         Mr. Wyatt.\n\n                                     WYATT'S VOICE\n                         Who is it?\n\n                                     CLAY\n                         Clay Phillips.\n\n               The door opens. Wyatt comes out. He pumps Clay's hand.\n\n                                     WYATT\n                              (calling)\n                         You can light the lamp.\n                              (to Clay)\n                         I'm sure glad it's you. We were afraid \n                         those killers might come back.\n\n                                     CLAY\n                         Three men on matched roans?\n\n               In the kitchen a match flares as Mrs. Wyatt lights the lamp.\n\n                                     WYATT\n                         Yeah, how did you know?\n\n                                     CLAY\n                         The whole state's lookin' for 'em.\n                              (dryly)\n                         And they're lookin' for me.\n\n               Mrs. Wyatt comes out to stand in the doorway. She shakes \n               Clay's hand.\n\n                                     MRS. WYATT\n                         You don't know how good it is to see \n                         you.\n\n                                     CLAY\n                         Maybe you won't feel that way after \n                         I tell you what I stopped in for.\n\n               He turns and motions off.\n\n               LONG SHOT\n\n               ANOTHER ANGLE. Clay, Wyatt and Mrs. Wyatt in f.g. The wagon \n               is coming toward the yard followed by the remuda.\n\n                                     CLAY\n                         I picked up some women on the road.\n\n               THREE SHOT\n\n               Clay, Mrs. Wyatt and Wyatt. O.s. the wagon and horses can he \n               heard.\n\n                                     MRS. WYATT\n                         Tell them to come on in.\n\n                                     CLAY\n                         But I'm going to have to leave 'em \n                         here. They're --- well they're not \n                         the sort of people you're used to.\n\n                                     MRS. WYATT\n                              (a reprimand)\n                         It doesn't matter who they are.\n\n                                     CLAY\n                              (lamely)\n                         And one of 'em is sick.\n\n                                     MRS. WYATT\n                         Why didn't you say so. Go right out \n                         and get her. Ed. build the fire up.\n\n               She turns back into the kitchen. Clay looks after her, then \n               hurries down the steps. Wyatt follows his wife inside.\n\n               INT. KITCHEN - NIGHT\n\n               Wyatt goes to the stove and starts stoking the fire. Mrs. \n               Wyatt takes the lamp from the wall bracket and goes into the \n               bedroom.\n\n               INT. BEDROOM - NIGHT\n\n               FULL SHOT. It is a pleasant room with a large, handmade, \n               double bed, white flour sack curtains at wide windows. Mrs. \n               Wyatt puts the lamp on the dresser. Going to the bed she \n               pulls back the covers, feels the sheets.\n\n                                     MRS. WYATT\n                              (calling)\n                         Wrap a stove lid in dish towels and \n                         bring it in here. This bed's like \n                         ice.\n\n               MED. SHOT\n\n               Turning from the bed, she crosses to the dresser. Beside the \n               dresser is a camel-back trunk. She starts to open a dresser \n               drawer, pauses and looks down at the trunk. Moving to the \n               trunk, she hesitates. Then making up her mind, she bends \n               down and throws open the trunk.\n\n               MED. CLOSE SHOT\n\n               DOWN ANGLE. A girl's clothing is neatly packed in the trunk. \n               A framed picture is face down on top of the clothing. Mrs. \n               Wyatt kneels by the trunk, pushes the dresses aside and finds \n               a nightgown. CAMERA ANGLE WIDENS as she rises and shakes it \n               out. It is frilly, dainty, very feminino; obviously the \n               nightdress of a young girl. She closes the trunk, turns and \n               as she goes to the bed, Wyatt comes through the door carrying \n               the towel-wrapped stove lid. She lays the nightgown on the \n               bed, takes the stove lid and puts it between the sheets. \n               Wyatt is staring down at the garment.\n\n                                     WYATT\n                              (cold)\n                         Put it back.\n\n               They face each other. Wyatt reaches out and takes the \n               nightgown.\n\n                                     MRS. WYATT\n                         Someone might as well get some good \n                         out of it. Wyatt crosses to the trunk.\n\n                                     MRS. WYATT\n                         It isn't as if she was dead.\n\n               Wyatt opens the trunk, puts the nightgown in and closes the \n               lid.\n\n                                     WYATT\n                              (cold)\n                         It stays there, understand!\n\n               The slamming of a door o.s. interrupts them. They turn and \n               start for the door.\n\n                                     MRS. WYATT\n                              (calling)\n                         Right in here, Mr. Phillips.\n\n               She follows Wyatt to the doorway, CAMERA DOLLYING WITH her. \n               She stops in the doorway.\n\n               INT. KITCHEN - NIGHT\n\n               ANGLED PAST Mrs. Wyatt. Clay, carrying Elaine, bundled in \n               blankets, comes forward. Wyatt has stopped just inside the \n               kitchen. Mary and Helen follow Clay through the door.\n\n                                     MRS. WYATT\n                         The bed's all ready and warm --\n\n               She stops, staring at the girl.\n\n               MED. CLOSE SHOT\n\n               The Wyatts in the doorway. They recognize the girl. Wyatt's \n               expression hardens. Clay, carrying Elaine, pushes between \n               them into the bedroom.\n\n               INT. BEDROOM - NIGHT\n\n               MED. SHOT. Clay carries the girl to the bed and gently puts \n               her down. Her eyes are closed. Slowly the Wyatts enter the \n               room to stand close together staring at the girl on the bed. \n               Clay suddenly realizes that something is wrong. He glances \n               up. Elaine opens her eyes and looks up at her mother and \n               father.\n\n                                     MRS. WYATT\n                              (softly to Wyatt)\n                         Go out and make some coffee.\n\n               Wyatt doesn't move.\n\n                                     MRS. WYATT\n                         Go on. You too, Mr Phillips.\n\n               As Clay waits, Wyatt moves through the door unable to argue \n               back.\n\n               INT. KITCHEN - NIGHT\n\n               FULL SHOT. Mary and Helen stand close to the steve, looking \n               anxiously toward the bedroom door as Clay and Wyatt come \n               out. Clay closes the door. Wyatt, dazed by the shock of seeing \n               his daughter again, stands momentarily staring at the closed \n               door. Then very slowly he turns and looks at Helen and Mary.\n\n               MED. SHOT\n\n               his ANGLE. Mary and Helen, seeing the two men's expressions, \n               look from one to the other, puzzled.\n\n                                     MARY\n                         Is she very sick?\n\n                                     WYATT\n                              (cold, flat)\n                         Get 'em out of here. I won't have \n                         'em in this house.\n\n               He crosses to the kitchen door, exits, slamming the door \n               behind him.\n\n                                     MARY\n                              (softly)\n                         So that was why she tried to run \n                         away.\n\n                                     CLAY\n                              (sharp)\n                         Didn't you know she had a father and \n                         mother out here?\n\n                                     MARY\n                              (hurt and angry)\n                         I didn't know anything about her \n                         except she wanted a job because some \n                         man had left her stranded. I couldn't \n                         leave her in the street. Let's go.\n\n                                     CLAY\n                         Hold on.\n\n                                     MARY\n                         We can't stay here!\n\n                                     CLAY\n                         It's a long walk back to Aspen.\n\n               Turning from them, he exits. Mary and Helen look at each \n               other. Then Helen grins wryly and goes over to the cupboard.\n\n                                     HELEN\n                         I don't know about you. But I'm not \n                         being thrown out on an empty stomach.\n\n               EXT. CORRAL - NIGHT\n\n               MED. SHOT. Wyatt in the f.g. stands by the horse trough. His \n               face is set, his expression hard, unyielding. Clay comes \n               across the yard past the wagon. Wyatt doesn't look at him as \n               Clay comes up.\n\n               TWO SHOT\n\n               Clay and Wyatt. Clay takes the makings from his pocket, rolls \n               a cigarette, lights it.\n\n                                     CLAY\n                         I'm sorry about this, Mr. Wyatt. I \n                         didn't know who she was.\n\n                                     WYATT\n                              (quiet)\n                         All right, you didn't know.\n\n                                     CLAY\n                         I can't take her with me.\n\n                                     WYATT\n                         Nobody asked you to.\n\n               O.s. Steve whistles the tune of the A B C song as he comes \n               out of the barn.\n\n                                     WYATT\n                         Just get those two out of here.\n\n               ANOTHER ANGLE\n\n               Steve approaches from the barn.\n\n                                     CLAY\n                         You're not bein' quite fair.\n\n                                     WYATT\n                         What's there to be fair about?\n\n               TWO SHOT\n\n               Clay and Wyatt. Clay takes the making from his pocket, rolls \n               a cigarette, lights it.\n\n                                     CLAY\n                         I'm sorry about this, Mr. Wyatt. I \n                         didn't know you had a daughter.\n\n                                     WYATT\n                              (quiet)\n                         All right, you didn't know.\n\n                                     CLAY\n                         I can't take her with me.\n\n                                     WYATT\n                         Nobody asked you to.\n\n               O.s. Steve whistles the tune of the A B C song as he comes \n               out of the barn.\n\n                                     WYATT\n                         Just get these two out of here.\n\n               ANOTHER ANGLE\n\n               Steve approaches from the barn.\n\n                                     CLAY\n                         You're not bein' quite fair.\n\n                                     WYATT\n                         What's there to be fair about?\n\n               Steve comes up.\n\n                                     STEVE\n                         Hello, Mr. Wyatt.\n\n               He starts whistling again as he continues toward the wagon.\n\n               MED. SHOT\n\n               wagon. Steve picks up a couple of valises and some blankets \n               and heads for the house, still whistling. In the b.g. can be \n               heard the mutter of voices as Clay and Wyatt talk.\n\n               INT. KITCHEN - NIGHT\n\n               Helen is sitting at the table, eating a piece of bread and \n               drinking coffee. Mary stands at the window. Steve is heard \n               coming up the steps and across the porch. He pushes the door \n               open and enters.\n\n                                     STEVE\n                              (cheerfully)\n                         Where do I put your things?\n\n               Mary turns from the window.\n\n                                     MARY\n                         Back in the wagon.\n\n               Steve stands with his arms full, looking at Mary.\n\n                                     STEVE\n                         Aren't we stayin'?\n\n                                     MARY\n                         No. We're not stayin' --\n\n               She crosses to him and smiles wryly.\n\n                                     MARY\n                         Everything's all mixed up, so don't \n                         ask questions.\n\n               Steve hesitates.\n\n                                     MARY\n                              (soft)\n                         Go on, Steve.\n\n               Steve exits.\n\n               EXT. PORCH - NIGHT\n\n               MED. CLOSE. Steve stops on the porch. He is puzzled, worried. \n               He glances back then over toward the fence where Wyatt and \n               Clay are talking. He shrugs and starts off toward the wagon.\n\n               INT. KITCHEN - NIGHT\n\n               MED. SHOT. Mary crosses to the stove.\n\n                                     HELEN\n                         Sit down and eat, why don't you?\n\n               Mary lifts the stove lid and puts a stick in the firebox.\n\n                                     HELEN\n                         It isn't like this was the first \n                         place we were ever thrown out of.\n\n                                     MARY\n                         That's not what's worryin' me. Why \n                         didn't she tell us? Maybe we could \n                         have done somethin' -- gone somewhere \n                         else -- puttin' a poor sick kid \n                         through this --\n\n                                     HELEN\n                         Quit worryin' about Elaine.\n\n               She motions to the bedroom door.\n\n                                     HELEN\n                         She's home, isn't she? So worry about \n                         us. We want to get to Sonora.\n\n               Footsteps across the porch. The two girls look toward the \n               door.\n\n               ANOTHER ANGLE - NIGHT\n\n               SHOOTING PAST Mary. The door slowly opens. Wyatt enters. He \n               crosses to the bedroom door, CAMERA PANNING WITH him. It is \n               as though he doesn't see the two women. He stands in front \n               of the door, staring at it. Then his hand moves to the knob. \n               Slowly he turns the knob and opens the door. The two girls \n               watch him as he hesitates on the threshold. Then he enters \n               and closes the door softly. Helen looks over at Mary and \n               smiles.\n\n               INT. BEDROOM - NIGHT\n\n               MED. SHOT as Wyatt stops, looking at Elaine, resting back \n               against the pillow, seeming very young in the nightgown. For \n               a moment it is difficult to know what is in Wyatt's mind. \n               Then he sees the twin tintypes. CAMERA MOVES TOWARD Wyatt's \n               face as tears come to his eyes.\n\n               INT. KITCHEN - NIGHT\n\n               MED. SHOT as footsteps cross the porch and the screen door \n               creaks open. Clay enters the kitchen, carrying the girls' \n               suitcases and some blankets. He nods to the girls, then goes \n               to the door leading to the other bedroom. There he stops.\n\n                                     CLAY\n                         This will be your room until Mr. \n                         Wyatt finds time to take you to the \n                         nearest stage station.\n\n               As he carries their belongings in:\n\n                                                               DISSOLVE OUT\n\n               INT. MARY'S AND HELEN'S BEDROOM - NIGHT DISSOLVE IN\n\n               The room is lighted only by the moonlight. Mary and Helen \n               are in the big four poster bed, close to the window. Clay's \n               footsteps are heard on the porch. The kitchen door closes \n               softly. There is the rattle of a stove lid being lifted.\n\n                                     HELEN\n                              (whispering)\n                         That sounds like him.\n\n               Mary slides out of bed and slips into a robe.\n\n                                     HELEN\n                         This time don't talk about cooking!\n\n               INT. KITCHEN - NIGHT\n\n               Clay turns from the stove to the cupboard over the sink and \n               takes down a coffee cup. The door into Elaine's bedroom is \n               closed. The door into Mary's bedroom opens and Mary enters \n               the kitchen. He turns back to the stove and fills his cup as \n               Mary comes up.\n\n                                     CLAY\n                         Coffee?\n\n                                     MARY\n                         No, thanks.\n                              (indicating Elaine's \n                              bedroom)\n                         I hope we won't be a burden to them.\n\n                                     CLAY\n                         I hope so, too.\n\n               He picks up his coffee and goes out on the porch. Mary \n               hesitates, then follows.\n\n               EXT. PORCH - NIGHT\n\n               ANGLED PAST Clay. Mary comes out. Clay sits on the bench by \n               the door, drinking his coffee.\n\n                                     CLAY\n                              (quiet)\n                         If you're figuring on asking me to \n                         take you, it's no use.\n\n               Mary crosses to stand above him.\n\n                                     MARY\n                         A time like this people ought to be \n                         alone. Having us around is going to \n                         make it sort of hard on 'em.\n\n               Mary sighs, sits beside him. From the pocket of her robe she \n               takes tobacco, rolls a cigarette and lights it. She passes \n               the tobacco to Clay. He rolls one.\n\n                                     CLAY\n                              (on the defensive)\n                         I'm sorry, but that's how it's got \n                         to be.\n\n                                     MARY\n                         I suppose it is.\n\n                                     CLAY\n                         And it's not only because the trip's \n                         a tough one --\n\n               Mary strikes a match and holds the flame to his cigarette.\n\n                                     MARY\n                              (softly)\n                         You don't have to explain. Did I \n                         tell you how grateful I am for what \n                         you've done?\n\n                                     CLAY\n                         I couldn't leave you sitting by the \n                         road.\n\n                                     MARY\n                         You could have treated us like they \n                         did in Aspen. No. You wouldn't do a \n                         thing like that -- it isn't in you \n                         to be mean or cruel.\n\n               Mary rises to move to the edge of the porch.\n\n               MED. CLOSE\n\n               Mary in f.g.\n\n                                     MARY\n                              (softly)\n                         No man who brings up a kid like you've \n                         brought up Steve could ever be cruel \n                         to people.\n\n               Turning, she leans against the post that supports the porch.\n\n                                     MARY\n                         I hope you get everything you want \n                         out of life --\n\n                                     CLAY\n                              (wary)\n                         Thanks.\n\n                                     MARY\n                         You've earned it -- the horse ranch \n                         on the Toulomoe -- the girl in the \n                         spotted gingham.\n\n                                     CLAY\n                         The who?\n\n                                     MARY\n                         You should know. She's in your dream.\n\n               Clay puts his cup down, looks up. She is very lovely standing \n               in the moonlight, her body arched back, the robe open a \n               little.\n\n                                     MARY\n                         Ever since you've looked after Steve \n                         you've had the dream -- a ranch on \n                         the river -- good grass, good water, \n                         barn corral and house --- that part \n                         you've shared with Steve. The girl \n                         in gingham you plan sneakin' in when \n                         he isn't looking.\n                              (she pauses)\n\n                                     CLAY\n                              (enigmatic)\n                         Go on. Tell me more about her.\n\n                                     MARY\n                         She wears this gingham dress -- cooks \n                         popovers -- makes jam in season -- \n                         makes her own soap from pig fat and \n                         wood ashes and has cheeks the color \n                         of red apples.\n\n                                     CLAY\n                              (dryly)\n                         I'll make the soap myself.\n\n                                     MARY\n                         But the rest is right.\n\n                                     CLAY\n                         Will she be dark or fair?\n\n                                     MARY\n                         Blonde as a new mop. And beautiful \n                         as the girl on a feed store calendar.\n\n               Straightening, she crosses the porch to pause momentarily \n               close to Clay.\n\n                                     MARY\n                              (softly)\n                         I hope you find her -- because, like \n                         I said, you've earned your dream. \n                         Goodnight.\n\n               She enters the house. Clay looks after her, smiling faintly. \n               He knows she is up to something but not what.\n\n               INT. SECOND BEDROOM - NIGHT\n\n               MED. SHOT. Save for the moonlight coming through the window, \n               the room is dark. Mary enters softly, throws off her robe \n               and slips into bed beside Helen.\n\n               MED. CLOSE\n\n               on bed. Moonlight falls across the bed. Mary pulls the covers \n               up. Helen turns her head.\n\n                                     HELEN\n                         Did you make it interesting?\n\n               Mary snuggles down on the pillow.\n\n                                     MARY\n                         I tried my best, but these things \n                         take time.\n\n                                     HELEN\n                         And we're running out of that.\n\n                                     MARY\n                         There's still tomorrow morning.\n\n                                                                   DISSOLVE\n\n               INT. KITCHEN - MORNING\n\n               MED. LONG SHOT - ANGLED THROUGH window PAST Mary. The early \n               morning sun fills the yard. Steve is in the corral harnessing \n               the mules. Clay and Wyatt are taking Mary's and Helen's trunks \n               out of the wagon.\n\n                                     HELEN'S VOICE\n                         Those trunks look like ours.\n\n               Mary, who was in profile, turns.\n\n                                     MARY\n                         They are.\n\n               ANOTHER ANGLE\n\n               Helen is seated at the table. Mary stands with her back to \n               the window near the sink.\n\n                                     HELEN\n                         How long do you think we'll have to \n                         stay here?\n\n                                     MARY\n                         Until Pa gets around to driving us \n                         to Minden.\n\n                                     HELEN\n                         We don't want to go there.\n\n                                     MARY\n                         No we don't. But that's where we're \n                         going. From Minden we take a stage \n                         to Reno, then another one over to \n                         Auburn and another one to Placerville. \n                         Then it's a day's trip to Sonora.\n\n                                     HELEN\n                         Clay could save us an awful lot of \n                         time.\n\n                                     MARY\n                         He certainly could. About a month.\n\n                                     HELEN\n                         What are you waiting for? Do \n                         something.\n\n               Mary comes over to stand by the table. Her expression is \n               thoughtful.\n\n                                     HELEN\n                              (sharp)\n                         You're not giving up?\n\n                                     MARY\n                         How many ways can a man say no.\n\n               Helen rises. Her manner is determined.\n\n                                     HELEN\n                              (crosses to door)\n                         Maybe I better start working on him.\n\n                                     MARY\n                         You'd think he'd do it for Elaine's \n                         sake, at least...\n\n               CLOSE SHOT\n\n               as she stops, apparently inspired by Mary's last remark. She \n               looks out into the yard where Clay is working on the wagon.\n\n               ANOTHER ANGLE\n\n               SHOOTING TOWARD Elaine's bedroom door. Helen crosses to Mary.\n\n                                     HELEN\n                              (sweetly)\n                         If you can't bring him around, nobody \n                         can.\n\n               She puts her arm around Mary's shoulder.\n\n                                     HELEN\n                         Go on. Have another try at him.\n\n                                     MARY\n                         What's the use.\n\n                                     HELEN\n                              (cajoling)\n                         Please. Maybe he'll take a good look \n                         at you and stop thinking so much \n                         about his horses.\n\n               As she speaks she edges Mary to the door leading outside.\n\n                                     HELEN\n                         A man has only so many no's in him.\n\n               Mary smiles at her, shrugs and exits. Helen looks after her. \n               Mary's footsteps are heard going down the steps. Then Helen \n               swings around and going to Elaine's door, opens it.\n\n               INT. ELAINE'S BEDROOM\n\n               MED. SHOT. Elaine is sitting up in bed. There is a small \n               table by the bed and on it is a breakfast tray. Mrs. Wyatt \n               sits by the bed. Elaine looks happy for the first time. Mrs. \n               Wyatt is holding a cup to her lips. Helen enters and closes \n               the door.\n\n                                     HELEN\n                         Look at you, sitting up already.\n\n               Crossing to the bed she takes the cup from Mrs. Wyatt.\n\n                                     HELEN\n                         Let me do this while you get some \n                         breakfast.\n\n                                     MRS. WYATT\n                         But I like to do it.\n\n                                     HELEN\n                         You're worn out.\n\n               As she pushes Mrs. Wyatt toward the door.\n\n                                     HELEN\n                         Now don't argue. You've got two able-\n                         bodied girls to help you so take \n                         advantage of it. And don't let me \n                         catch you touching the dishes.\n\n               She closes the door behind Mrs. Wyatt and comes back, sits \n               on the edge of the bed and holds the cup to Elaine's lips.\n\n                                     HELEN\n                         Well -- it's going to be good for \n                         all of us -- having a nice long rest \n                         here. After all -- Sonora will still \n                         be there next month. Maybe we can \n                         rehearse a new number -- try it out \n                         on your folks.\n\n               Elaine tries not to show her panic at this suggestion.\n\n                                     ELAINE\n                         Helen -- why don't you and Mary go \n                         on with Clay?\n\n                                     HELEN\n                         He won't take us.\n                              (then, hurt)\n                         Don't you want us around?\n\n                                     ELAINE\n                         Of course I do -- but it'd be better \n                         for you -- and the house is kind of \n                         small --\n\n                                     HELEN\n                         If you're worried about Mary and me \n                         talkin' too much, don't. No matter \n                         how many questions your old man asks. \n                         We know how to keep our mouths shut.\n\n                                     ELAINE\n                         It isn't that --\n\n                                     HELEN\n                         Don't talk -- eat -- we want to get \n                         you well quick as we can so we can \n                         all get out of here.\n\n                                     ELAINE\n                         But I want to stay.\n\n                                     HELEN\n                         Drink this and stop being silly. Why \n                         would anyone want to live in this \n                         place. You might as well be dead and \n                         buried. Nothing to do but look at \n                         mountains. In a week you'd be talking \n                         to yourself.\n                              (then, brightly)\n                         Maybe that's what got you started in \n                         the first place.\n\n               Elaine pushes the cup away, sits up straighter.\n\n                                     ELAINE\n                              (distraught)\n                         I'm not going anywhere. I'm staying \n                         here where I belong.\n\n                                     HELEN\n                         Not if I know Mary. When she rides \n                         into Sonora, you'll be with her. And \n                         mighty glad to be there after this. \n                         I don't see how you stood it as long \n                         as you did.\n\n                                     ELAINE\n                              (sobbing)\n                         Stop it -- stop it.\n\n                                     HELEN\n                              (contrite)\n                         Darling -- now I've got you all upset.\n\n               Elaine buries her head in the pillow.\n\n                                     ELAINE\n                         Go away -- please.\n\n                                     HELEN\n                         That's right -- you go back to sleep. \n                         Tomorrow when you feel better things \n                         will look a whole lot different. \n                         Don't you worry about anything -- \n                         Mary's going to talk things over \n                         with your folks --\n\n               Elaine sits up and grabs Helen's arm.\n\n                                     ELAINE\n                              (fiercely)\n                         She mustn't -- don't you let her --\n\n                                     HELEN\n                         There, there. Don't you upset yourself --\n\n                                     ELAINE\n                              (wildly)\n                         If she says anything to them I'll \n                         kill her.\n\n               The door opens and Mrs. Wyatt enters. She hurries over to \n               the bed, pushes Helen aside, and takes the sobbing girl in \n               her arms.\n\n                                     ELAINE\n                              (sobbing)\n                         I don't want to leave you, ever.\n\n               Mrs. Wyatt flares at Helen.\n\n                                     MRS. WYATT\n                         What did you do to her?\n\n                                     HELEN\n                         Nothing. The poor child's worried \n                         about Mary --\n\n               Turning, she goes to the door.\n\n                                     HELEN\n                         I won't let her say anything --\n\n               She exits.\n\n               INT. KITCHEN\n\n               MED. SHOT. Leaving the door open, Helen enters the kitchen. \n               She glances back at the bedroom, half smiling, then crosses \n               to the window and looks out.\n\n               EXT. YARD\n\n               ANGLED past Helen THROUGH window. Clay is crossing the yard \n               toward the house.\n\n               INT. KITCHEN\n\n               MED. SHOT. Helen turns from the window and walks hurriedly \n               to the second bedroom door. Clay's footsteps cross the porch. \n               Helen enters the bedroom and closes the door as Clay comes \n               in. Clay looks around, then seeing the open bedroom door, \n               crosses to it.\n\n               INT. ELAINE'S BEDROOM\n\n               ANGLED PAST Clay in doorway. Mrs. Wyatt is holding the sobbing \n               girl in her arms. She looks over at Clay.\n\n                                     CLAY\n                         Well, I'm off --\n\n               Then realizing that something is wrong he steps into the \n               bedroom.\n\n               MED. SHOT\n\n                                     CLAY\n                              (puzzled)\n                         What's the matter?\n\n               Hearing his voice, Elaine lifts her head from her mother's \n               shoulder.\n\n                                     ELAINE\n                         Don't let them stay here, Mr. \n                         Phillips. They'll spoil everything.\n\n               Clay looks from one to the other, frowning. Elaine tries to \n               get out of bed. Her mother holds her.\n\n                                     ELAINE\n                              (wildly)\n                         Take them with you -- Mary's going \n                         to talk to dad -- she's going to \n                         keep talking and talking to me until \n                         maybe I won't want to stay here --\n\n                                     MRS. WYATT\n                         Please take them.\n\n                                     CLAY\n                         I can't --\n\n                                     ELAINE\n                         You've got to -- don't you understand -- \n                         they want me with them and they'll \n                         fix it so I have to go --\n\n                                     CLAY\n                              (sharp)\n                         No they won't.\n\n               Turning, he exits. Mrs. Wyatt holds Elaine close.\n\n               EXT. PORCH\n\n               MED. SHOT. Helen stands on the porch in the sunlight. She \n               glances back. Clay, his expression hard and angry comes out. \n               He doesn't look at Helen but stalks down the steps toward \n               the wagon.\n\n               MED. SHOT ON WAGON\n\n                                     STEVE\n                         What comes after Z?\n\n                                     MARY\n                         That's the end of the line.\n\n                                     STEVE\n                              (happily)\n                         Then I know my alphabet.\n\n                                     MARY\n                         From A to Z. All you have to do now \n                         is figure out what they mean put \n                         together in words.\n\n               ANOTHER ANGLE\n\n               Clay comes toward the wagon. Helen stands on the porch.\n\n                                     STEVE\n                         And that's tough, isn't it?\n\n                                     MARY\n                         Without someone to teach you, it's \n                         tough.\n\n               Clay appears behind her. Mary turns and smiles.\n\n                                     MARY\n                         He knows his alphabet.\n\n                                     CLAY\n                         That's fine.\n\n                                     STEVE\n                         I'll bet I'd be reading in a week if --\n\n               He catches Clay's glance and his face falls.\n\n                                     MARY\n                         Maybe Clay will take up where I left \n                         off.\n\n               Steve gets some courage. He comes over to his brother and \n               faces him.\n\n                                     STEVE\n                         I don't think it's fair --\n\n               He pauses; Clay waits.\n\n                                     STEVE\n                         Leaving them here when we could just \n                         as well take them. We got plenty of \n                         room in the wagon. And -- and -- \n                         they cook and drive the mules. They \n                         don't bother anybody.\n\n                                     CLAY\n                         Finished, son?\n\n                                     STEVE\n                              (weakly)\n                         There's only two of them now.\n\n               Clay moves past them toward the corral. Mary looks after \n               him, then turning, motions to Helen. Helen starts toward the \n               wagon.\n\n               ANOTHER ANGLE\n\n               Clay's horse stands saddled at the fence. He vaults into the \n               saddle, turns the horse.\n\n                                     CLAY\n                         I'll round up the horses. Throw that \n                         junk in the wagon.\n\n               He rides off. Steve, delighted, runs to start loading the \n               girls' things. Helen hurries into the scene.\n\n               MED. CLOSE\n\n               Mary and Helen. Mary smiles at Helen.\n\n                                     MARY\n                              (happily)\n                         You were right -- a man has only so \n                         many no's in him. But he had me \n                         worried -- that last one sounded so \n                         final.\n\n               Helen nods, looking at Mary as though in admiration.\n\n                                                                   DISSOLVE\n\n               EXT. WYATT RANCH\n\n               LONG SHOT - the wagon, followed by the remuda and with Clay \n               riding ahead moves slowly up the canyon back of the ranch.\n\n                                                                   FADE OUT\n\n               EXT. FOREST TRAIL - DAY FADE IN\n\n               LONG SHOT - ANGLED WEST. The forest is fairly open, yellow \n               pine, lodgepole and fir. To the West can be seen the bald \n               red granite domes of the higher range. O.s. there is the \n               SOUND of the cavalcade approaching. CAMERA PANS AROUND and \n               ANGLES PAST. Toward camera, comes the cavalcade, climbing \n               slowly. Far in the distance and down can be seen the waste \n               of desert and the barren hills of Nevada. Clay, a rifle across \n               his legs, is riding on one side of the wagon. Steve rides \n               beside Mary, who is driving. The remuda trails behind. Helen, \n               lying in the wagon bed, cannot be seen.\n\n               MED. TRUCKING SHOT\n\n               ANGLED PAST Steve. Steve has a copy of Leslie's Weekly open \n               on the pommel. Helen lies full length in the wagon bed, \n               occupying herself by giving herself a manicure with an orange \n               stick.\n\n                                     STEVE\n                         It's a lot tougher than I figured. \n                         Knowin' my letters is one thing. But \n                         makin' sense out of words is harder'n \n                         trackin' weasel after rain.\n\n               Clay glances over at his brother. Mary sees him watching. \n               Their eyes meet. She smiles. He doesn't return the smile.\n\n                                     STEVE\n                         -- and even if I do learn to read, \n                         what use'll it be? I'm goin' to live \n                         on a ranch!\n\n                                     MARY\n                         There's plenty of use for reading -- \n                         you'll see.\n\n               He sighs and scowls down at the page. He puts his finger on \n               a word and starts to spell it out.\n\n                                     STEVE\n                         U-n-i-c-o-r-n-... What in heck's \n                         that?\n\n                                     MARY\n                         Unicorn -- a kind of animal --\n\n                                     STEVE\n                         What do they look like?\n\n                                     MARY\n                         Hmmm... sort of like a horse -- with \n                         a horn in the center of its forehead.\n\n                                     STEVE\n                         Horses with horns! Huh! Do we have \n                         'em in Nevada?\n\n                                     MARY\n                         No.\n\n                                     STEVE\n                         How about California?\n\n                                     MARY\n                         Would they be good to eat?\n\n                                     MARY\n                              (not too sure)\n                         Kind of tough, I guess... But you're \n                         not liable to hunt them -- I don't \n                         think there's any alive now, anyways -- \n                         and I'm not sure but I don't think \n                         there ever were...\n\n                                     STEVE\n                         Then if they wasn't alive, how can \n                         they be an animal?...\n\n               Mary starts to protest -- Steve goes on.\n\n                                     STEVE\n                         An' if you can't hunt 'em and even \n                         if you could they'd be tough, what's \n                         the use of knowin' how to spell them?\n\n                                     MARY\n                         You don't read to fill your stomach... \n                         Poetry, for instance. All the poems \n                         in the world wouldn't fill you half \n                         as much as a bowl of eatmeal -- but \n                         they make you feel good.\n\n                                     STEVE\n                              (stubbornly)\n                         I feel good anyways.\n\n               REVERSE SHOT\n\n               ANGLED PAST Clay.\n\n                                     CLAY\n                         Don't go arguing with your teacher.\n\n                                     STEVE\n                         I'm not, but there's some of it I \n                         don't see any sense to.\n\n                                     CLAY\n                         There's a lot of things I don't see \n                         any sense to. But make up your mind. \n                         Learn to read or --\n                              (motioning)\n                         -- go back and watch the horses.\n\n               He touches his horse with his spurs and rides on ahead.\n\n               MED. CLOSE\n\n               ANGLED PAST Mary. Steve in the b.g. Mary looks after Clay, \n               puzzled, wondering. Then she looks over at Steve.\n\n                                     MARY\n                         Well, Steve?\n\n                                     STEVE\n                              (grinning)\n                         Now I know what a unicorn is, what \n                         do we do next?\n\n               EXT. FOREST TRAIL\n\n               Here the forest has thinned out. The trail climbs a rise, \n               then drops down. Clay jogs along the trail, his rifle across \n               his knees. As he reaches the edge of the forest at the crest \n               of the rise, he suddenly pulls his horse to a stop, swings \n               around and rides back into the trees. Throwing the reins \n               over the horse's head, he swings out of the saddle and moves \n               cautiously to the crest of the hill.\n\n               LONG SHOT\n\n               Clay's ANGLE. The trail leads down through open country to a \n               big meadow ringed with lodgepole pine, and across the meadow \n               to start climbing toward another, higher range of hills. \n               Three horsemen on roans, Lednov, Peters and McCall, are \n               crossing the meadow slowly.\n\n               MED. SHOT\n\n               DOWN ANGLE. Lednov, Peters and McCall as they ride across \n               the meadow.\n\n               CLOSE SHOT\n\n               Clay, as he peers down. He cocks his rifle. The voices of \n               Mary and Steve and the SOUND of the approaching wagon can be \n               heard o.s. Clay turns his head.\n\n               FULL SHOT\n\n               the cavalcade. Mary and Helen are in the seat of the wagon. \n               Steve rides alongside.\n\n               MED. CLOSE SHOT\n\n               Clay. He lowers his rifle, waves at them to stop and be quiet, \n               rises and hurries down the hill, CAMERA PANNING WITH him.\n\n               EXT. MEADOW\n\n               MED. SHOT of Lednov as he pulls in his limping horse, steps, \n               looking back over his shoulder as though he sensed an \n               unfamiliar presence. The other two watch him, frowning. Then \n               he shrugs and glances down at the bad leg of his mount.\n\n                                     LEDNOV\n                         We'll camp on up ahead away. That \n                         leg ain't good...\n\n               As they start away, moving slowly toward the trees in the \n               distance...\n\n               MED. FULL SHOT\n\n               Clay motions to Mary to stop as he hurries toward the wagon. \n               Mary reins in the mules.\n\n                                     CLAY\n                         We're staying here until dark.\n                              (motioning)\n                         Pull over to the woods.\n                              (to Steve)\n                         You put hobbles on the horses -- all \n                         of 'em. Get goin'.\n\n                                                               DISSOLVE OUT\n\n               EXT. HILLTOP - DUSK DISSOLVE IN\n\n               LONG SHOT. Clay, in close foreground, stands, leaning on his \n               rifle. The sun has set and the valley below is in shadow. \n               There is the silence of dusk. No wind stirs the trees. There \n               is some light outlining the high mountains -- treeless crags \n               and domes and spires. Clay turns.\n\n               REVERSE SHOT\n\n               Down the hill in the forest, is the wagon. Beyond it the \n               horses stand. Steve is stretched out on his stomach studying \n               his magazine. Helen is sitting on a tarp playing solitaire. \n               Clay starts down the hill toward the camp.\n\n               MED. SHOT - UP ANGLE\n\n               Clay walks through the trees. As he comes around a big yellow \n               pine, he stops suddenly and looks down.\n\n               MED. CLOSE\n\n               ANGLED DOWN PAST Clay. Mary lies on the carpet of pine \n               needles, her head pillowed on her arms, her dress pulled \n               taut across her chest. She is looking up through the trees \n               at the fading sky.\n\n               ANOTHER ANGLE\n\n               Clay stares down at Mary. She does not look at him. She is \n               aware of his presence, but she doesn't show it. In the soft \n               light of dusk she is very lovely. Clay is conscious of her \n               lovliness. He would like to drop down beside her.\n\n               CLOSE SHOT\n\n               Mary. She turns her face to look at him. CAMERA ANGLE WIDENS. \n               Clay stands above her, looking down. For a moment their eyes \n               meet. Clay starts away. CAMERA HOLDS ON Mary.\n\n                                     MARY\n                         Where you goin'? Over to the other \n                         side of the street?\n\n               MED. SHOT\n\n               ANGLED PAST Mary, who rises slowly. Clay looks back, \n               hesitates, then crosses to where the horses are tethered and \n               starts saddling his mare. Mary moves down toward him through \n               the trees.\n\n               ANOTHER ANGLE\n\n               Clay tightens the cinch. Mary moves up to stand beside him.\n\n                                     MARY\n                         Are we leaving?\n\n                                     CLAY\n                         It's too light yet.\n\n               He swings into the saddle, pulls the rifle out of the scabbard \n               and lays it across the pommel.\n\n                                     CLAY\n                         Better go on back and get some more \n                         sleep. You'll need it later on.\n\n                                     MARY\n                              (soberly)\n                         You're not going out to look for \n                         them?\n\n                                     CLAY\n                         No, I'm not. All I want 'em to do is \n                         keep ahead of us -- a long way ahead. \n                         So I'm riding up the line aways to \n                         pick us out a new trail.\n\n               He touches the mare with his spurs and trots down the hill. \n               He disappears around a bend in the trail.\n\n               ANOTHER ANGLE\n\n               Mary, in the f.g., is staring after Clay. Helen is watching \n               her. Steve has risen and walks up behind her. He smiles at \n               her.\n\n                                     STEVE\n                         Nobody's gonna catch him sleeping. \n                         Don't worry about him.\n\n                                     MARY\n                              (turning)\n                         Oh, I wasn't worrying.\n                              (flustered)\n                         I saw him saddling up and thought he \n                         was ready to leave.\n\n               She starts down toward the wagon, Steve walking beside her \n               and CAMERA TRUCKING WITH them THROUGH the forest.\n\n                                     STEVE\n                              (softly)\n                         You were worryin'.\n\n               Mary glances over.\n\n                                     STEVE\n                         Sometimes not knowin' how to read \n                         has its points. You can't read books \n                         so you look at people and figure 'em \n                         out.\n\n                                     MARY\n                         And you've got me all figured out?\n\n                                     STEVE\n                         Sure.\n\n               They have passed Helen, playing solitaire on the canvas, and \n               have reached the place where the grub box stands. Steve \n               spreads a tarp for her.\n\n                                     STEVE\n                         I'll fix us somethin' to eat.\n\n               Mary sits down. Steve opens the grub box and takes out some \n               plates, tinned food and hardtack.\n\n                                     STEVE\n                         Like when you were standin' there \n                         looking after Clay. I knew right off \n                         what you were thinking. Because I've \n                         been watching you.\n\n                                     MARY\n                         You were supposed to be reading words.\n\n                                     STEVE\n                         I was doin' both. Here.\n\n               He hands her a plate of food, takes another and goes over to \n               Helen.\n\n               ANOTHER ANGLE\n\n               Helen looks up from her card game, takes the plate with a \n               smile.\n\n                                     HELEN\n                         Thanks, Steve.\n\n               He grins at her, turns and comes back to Mary who is watching \n               him.\n\n                                     MARY\n                         Better not let Clay catch you waitin' \n                         on us.\n\n               Steve sits on the edge of the grub box and picks up his plate.\n\n                                     STEVE\n                         Don't pay any attention to him. That's \n                         his way and I've found he's sure \n                         easy to get along with. I don't \n                         recollect him havin' hit me more'n a \n                         couple of times and I guess I had it \n                         comin'.\n\n                                     MARY\n                         But you're his brother.\n\n                                     STEVE\n                         He'll treat his wife just as good. \n                         Maybe better. Ever see him use a \n                         bull snake on the mules like other \n                         wranglers?\n\n               Mary shakes her head.\n\n                                     STEVE\n                         Yes sir, Clay's nice to be around.\n                              (the clincher)\n                         He don't chew much and when he does \n                         he spits outside.\n\n                                     HELEN\n                              (dryly)\n                         You make him sound wonderful... Go \n                         on. Tell Mary more about him.\n\n               Steve looks over at her, embarrassed, a little hurt by her \n               tone. He rises, takes Mary's empty plate and his own and \n               goes over to the little spring to wash them. Mary looks \n               sharply at Helen. Helen shrugs. Mary rises and follows Steve \n               over to the spring.\n\n               MED. CLOSE ON SPRING\n\n               Steve kneels by the little pool, washing the plates in the \n               run off. Mary stops above him.\n\n                                     MARY\n                         She was only teasin'.\n\n                                     STEVE\n                              (offhand)\n                         Oh, sure.\n\n                                     MARY\n                         Let me do that.\n\n               She kneels beside him. Steve looks over at her.\n\n                                     STEVE\n                         I like to do things for you. Didn't \n                         you know?\n\n               She looks down at the water bubbling up into the little moss \n               lined pool.\n\n                                     MARY\n                              (softly)\n                         I know now.\n\n                                                                   DISSOLVE\n\n               EXT. TRAIL - NIGHT\n\n               CLOSE SHOT - DOWN ANGLE. O.s. there is the SOUND of the \n               cavalcade moving. A wheel passes camera, then another. CAMERA \n               PULLS BACK to reveal the wagon passing in the moonlit \n               darkness. Mary is driving.\n\n               ANOTHER ANGLE\n\n               Clay rides into the shot, his rifle ready. The wagon follows. \n               Then the remuda with Steve bringing up the rear. Steve also \n               holds his rifle ready. Both men are wary, watchful, \n               apprehensive.\n\n                                                                   DISSOLVE\n\n               EXT. FOREST - NIGHT\n\n               FULL SHOT - DOWN ANGLE. SHOOTING DOWN THROUGH the leaves of \n               a quaking aspen. The cavalcade moves on along the trail.\n\n                                                                   DISSOLVE\n\n               EXT. ROCKY HILLSIDE - DAWN\n\n               FULL SHOT. The east is grey with the approaching dawn. The \n               terrain is treeless, forbidding. Granite crags rise all \n               around. The trail leads up through a canyon then narrows \n               along the edge of a cliff. The cavalcade toils forward. Clay, \n               in the lead, stops and waits for the wagon to come abreast.\n\n               MED. SHOT\n\n               As the wagon comes abreast, Clay dismounts, loops the reins \n               over the tail gate, then swings up into the seat, motioning \n               for Mary to move over. He takes the reins, puts his rifle \n               down in front of him.\n\n               MED. CLOSE - MOVING (PROCESS)\n\n               Clay and Mary. Helen is sleeping in the bed of the wagon.\n\n                                     MARY\n                         Don't you trust me?\n\n                                     CLAY\n                         Not on this trail, I don't. I've \n                         been over it before. Anyway, you \n                         ought to be pretty sleepy. Why don't \n                         you climb in back.\n\n               Mary glances ahead.\n\n                                     MARY\n                         I like to see where I'm going.\n\n               She picks up the rifle and holds it across her knees.\n\n                                     CLAY\n                              (dryly)\n                         Did you ever care where you were \n                         goin' or where you'd been?\n\n               Mary glances over at him wonderingly.\n\n                                     MARY\n                         Maybe not! But I want to get there \n                         in one piece.\n\n               They ride along in silence for a moment. The trail is rough. \n               The jolting wagon throws them together. Their shoulders touch.\n\n                                     MARY\n                              (softly)\n                         Why did you change your mind about \n                         bringing us along?\n\n                                     CLAY\n                         Why do you think?\n\n                                     MARY\n                              (soberly)\n                         I don't know. I thought I did. Now \n                         I'm not sure. I thought it had \n                         something to do with me.\n\n                                     CLAY\n                         Oh, it did. It had a great deal to \n                         do with you.\n\n               Mary studies him, trying to figure out what he means.\n\n                                     MARY\n                         Just how do you mean that?\n\n               Clay is busy with driving down the rough road. He speaks \n               without looking at her.\n\n                                     CLAY\n                         You know so much about me -- figure \n                         it out.\n\n                                     MARY\n                         So that's it --\n                              (he glances over)\n                         You think I was making fun of your \n                         girl in gingham.\n\n               CLOSE SHOT\n\n               Helen. She lies in the bed of the wagon, looking up.\n\n                                     MARY'S VOICE\n                         I wasn't. And I wasn't making fun of \n                         you or your dream.\n\n               She waits for an answer, but getting none, continues.\n\n                                     MARY'S VOICE\n                         Of course, maybe I was trying to get \n                         you to do something you didn't want \n                         to do.\n\n               MED. CLOSE SHOT - MOVING (PROCESS)\n\n               Clay and Mary. Clay busies himself with the brake and the \n               reins.\n\n                                     CLAY\n                         You wouldn't do a thing like that, \n                         would you?\n\n                                     MARY\n                              (softly)\n                         Yes. But -- that was the other night. \n                         Now -- I don't think I would.\n\n               MED. LONG SHOT - ANGLED AHEAD\n\n               Clay and Mary in f.g. The trail now goes down a slope to a \n               river, which boils out of a narrow canyon, then follows the \n               river through the canyon. Clay hands the reins to Mary, takes \n               his rifle.\n\n                                     CLAY\n                         That's the West Walker. Take it easy \n                         now.\n\n               MED. SHOT\n\n               Clay swings down. The wagon moves past him. He frees his \n               horse, swings into the saddle and gallops down toward the \n               canyon.\n\n               CLOSE SHOT\n\n               Mary. She looks after him.\n\n               FULL SHOT\n\n               The wagon moves down toward the river. Clay disappears into \n               the canyon. Steve and the remuda follow the wagon.\n\n               EXT. CANYON TRAIL\n\n               ANGLED TOWARD mouth of canyon. Clay rides along the trail, \n               his rifle at the ready. Now he moves warily, keeping a sharp \n               lookout. The canyon is dark, sinister.\n\n               REVERSE SHOT\n\n               The cavalcade enters the canyon.\n\n               ANOTHER ANGLE - SHOOTING DOWN\n\n               Clay rides toward camera. The trail curves around a cliff.\n\n               MED. SHOT\n\n               Clay. He rides around the bend in the trail. He hears \n               something. He reins the horse in. Some pebbles rattle down \n               the cliff. He looks up.\n\n               FROM CLAY'S ANGLE\n\n               The muzzle of a rifle is visible. Clay starts to bring his \n               gun up.\n\n                                     FOWLER'S VOICE\n                         Hold it!\n\n               DOWN ANGLE\n\n               Clay lets his rifle rest across his knees. He looks up. \n               Fowler, a well-set-up young man in jeans, blue shirt and \n               worn jacket and wearing a battered hat, moves into scene.\n\n               CLOSE SHOT\n\n               Clay. He is wary, puzzled as to the man's identity. For all \n               he knows it may be one of Lednov's men.\n\n               MED. SHOT\n\n               Clay and Fowler.\n\n                                     FOWLER\n                         What are you doin' on this trail?\n\n                                     CLAY\n                         Followin' it. Any reason I shouldn't?\n\n               MED. LONG SHOT\n\n               SHOOTING PAST Fowler. Into view comes the wagon and the \n               remuda. Fowler lowers his rifle. He slides down the cliff to \n               stand beside Clay.\n\n               MED. CLOSE\n\n               Clay and Fowler.\n\n                                     FOWLER\n                         My name's Fowler. I'm camped up a \n                         ways.\n\n               He extends his hand. Clay shakes it.\n\n                                     CLAY\n                         Clay Phillips of Aspen. Been havin' \n                         trouble?\n\n                                     FOWLER\n                         Nope. But I don't want any.\n\n                                     CLAY\n                         Neither do we. That's why we took \n                         this trail instead of the main road, \n                         and drove all night.\n\n                                     FOWLER\n                         You're welcome to use my camp.\n\n               He motions ahead, starts walking. Clay rides beside him.\n\n                                                                   DISSOLVE\n\n               EXT. MEADOW\n\n               FULL SHOT. The river is beyond the meadow. In the pine forest \n               at the edge of the meadow is Fowler's camp. The cavalcade is \n               driving up to the camp. There are two horses tethered in the \n               meadow.\n\n               EXT. FOWLER'S CAMP\n\n               MED. FULL SHOT. A tarp is stretched over the camp. There is \n               a crude stone fireplace, a rough table and two benches. \n               Shelves are nailed between the trees. In a small lean-to \n               there is a bunk with Fowler's bedroll on it. Fowler stands \n               watching Mary and Holen as they get out of the wagon. The \n               horses sproad out across the meadow. Steve and Clay dismount. \n               Both unsaddle. Helen, Mary and Fowler exchange glances. Then \n               the two women walk toward the camp, which is behind a screen \n               of trees.\n\n               MED. CLOSE ON CAMP\n\n               Helen and Mary enter the camp.\n\n                                     MARY\n                         We might as well start a fire.\n\n                                     HELEN\n                         Go ahead.\n                              (nodding off)\n                         Get in training for the pioneer life. \n                         I'm finding the nearest body of water \n                         and climbing into it.\n\n               She goes off and across the meadow. Mary looks after her, \n               shrugs and going to the fireplace, takes moss and twigs from \n               the pile and puts them in. Clay, carrying saddle bags and \n               canteens, enters.\n\n                                     MARY\n                         Got a light?\n\n               He puts them down, goes over to the fireplace and kneels to \n               light the moss. Mary has stepped back.\n\n               CLOSE SHOT - LOW\n\n               As he lights the fire, the lower portion of Mary's body comes \n               into the shot. Clay becomes aware of her closeness. He rises \n               slowly. CAMERA ANGLES UP. Mary is standing facing him, almost \n               touching him. They stare at each other without speaking. \n               Both suddenly move togother. They kiss. There is a SOUND \n               over shot and they step apart, looking off.\n\n               ANOTHER ANGLE\n\n               Steve has come into scene and is looking at them. He smiles \n               with pleasure and surprise.\n\n                                     STEVE\n                              (innocently)\n                         Want the wagon unloaded, Clay?\n\n                                     CLAY\n                              (upset)\n                         Just the grub box and bed rolls.\n\n               Steve nods, smiles at both of them and goes out of scene. \n               Clay and Mary face each other. Suddenly Clay swings around \n               and goes out of shot after his brother.\n\n               CLOSE SHOT - MARY\n\n               She looks after him, clearly in love, disappointed that they \n               were interrupted. Then she turns to the fire.\n\n               MED. CLOSE SHOT\n\n               Clay and Steve. CAMERA MOVES AHEAD of them as they walk toward \n               the wagon. Steve has begun to whistle blithely. Clay looks \n               sideways at him. Steve whistles even louder. They stop at \n               the wagon. CAMERA HOLDS. Steve climbs inside and hands down \n               the grub box.\n\n                                     STEVE\n                         I -- I think it'll be swell.\n\n               Clay puts the grub box on the ground. Steve tosses out the \n               bed rolls, then jumps out. He grins up at Clay.\n\n               MED. CLOSE\n\n               Clay, embarrassed, puts his hand on the boy's shoulder.\n\n                                     CLAY\n                         When you get older you'll understand \n                         things better. Like women and men. \n                         Just because a man kisses a woman, \n                         doesn't always mean -- well, he can \n                         kiss her and not want to -- have her \n                         around all the time.\n\n               Steve watches him, puzzled. His exuberance has gone.\n\n                                     CLAY\n                         We got a lot to do, you and I. Gettin' \n                         that ranch started and everything. \n                         We've been getting along fine, all \n                         these years. For a while I want to \n                         keep it the way it is.\n\n               Abruptly Clay turns and indicates the grub box. Steve watches \n               him.\n\n                                     CLAY\n                         Take that in and help her get \n                         breakfast, will you?\n\n               Steve nods and carries the grub box out of the scene. Clay \n               stares after him. Then he picks up the bed roll and moves \n               around the wagon.\n\n               ANOTHER ANGLE\n\n               Clay in the f.g. In front of Clay stretches the meadow with \n               the river beyond. The horses are grazing in the meadow. Fowler \n               can be seen hurrying toward the aspens and alders that screen \n               the river.\n\n               EXT. RIVER BANK\n\n               MED. SHOT. Here the river moves quietly down. The bank is \n               sandy. Alders and aspens screen it from the meadow. Helen \n               sits on the sand taking off her shoes and stockings. Her \n               toilet box is beside her. Something on the bank catches her \n               attention, she rises and climbs the bank. Some branches of \n               aspen cover an object. She pulls the branches away, revealing \n               a crud, miner's cradle or rocker.\n\n               MED. CLOSE\n\n               Helen stares down at the cradle. She doesn't know what it \n               is.\n\n                                     FOWLER'S VOICE\n                              (sharp)\n                         What are you doing down here?\n\n               Helen, startled, turns.\n\n               ANOTHER ANGLE\n\n               Fowler and Helen. They stare at each other.\n\n                                     FOWLER\n                              (curt)\n                         You got no business snoopin' around --\n\n                                     HELEN\n                              (hard)\n                         Me snoopin'? I came down here to \n                         take a bath.\n\n               She glances from Fowler to the cradle.\n\n                                     HELEN\n                         That something I shouldn't see?\n\n                                     FOWLER\n                              (flustered)\n                         No. But it's mine and I didn't want \n                         anyone foolin' with it.\n\n               Hurriedly he covers it with branches again. Helen watches \n               him, curious, interested.\n\n                                     HELEN\n                         What is it?\n\n                                     FOWLER\n                         Just a thing I was workin' on.\n\n                                     HELEN\n                         The way you act, it must be something \n                         pretty secret.\n\n               When Fowler doesn't explain she moves on down the bank and \n               sits on the sand.\n\n                                     FOWLER\n                         Go on. Take your bath. I'll beat it.\n\n                                     HELEN\n                         You wouldn't have a smoke on you, \n                         would you?\n\n               Fowler comes over and sits down beside her. He takes [a] \n               sack of tobacco and papers from his pocket. She reaches for \n               them. He watches her wide-eyed as she rolls a cigarette. He \n               holds a match for her.\n\n                                     HELEN\n                         Thanks.\n\n               She turns to the toilet case on the sand beside her, takes \n               out a comb. He glances at the box, then reaches over and \n               from it takes her powder box. He sniffs it. Without \n               irritation, as though borrowing a toy from a child, Helen \n               takes the powder box from him.\n\n                                     FOWLER\n                         That sure smells good.\n\n                                     HELEN\n                         I like it.\n\n                                     FOWLER\n                         Up here in the hills, a man gets a \n                         hankering to smell powder.\n\n                                     HELEN\n                         Then why stay in the hills.\n\n               She looks at him then up the bank where the cradle is.\n\n                                     HELEN\n                         That why?\n\n               Fowler hesitates. Helen hands him back the powder box as \n               matter-of-factly as she took it. He accepts it gratefully, \n               again putting it to his nose. Now he looks up at her, \n               regarding her calculatingly for a moment or two. Their eyes \n               meet.\n\n                                     FOWLER\n                         I guess you can keep a secret. That's \n                         a gold rocker. I'm doin' a little \n                         placer mining in a place nobody ever \n                         thought to look for gold before.\n\n               He reaches to his throat and lifts over his head a braided \n               loop of rawhide. Attached to the loop is a small, plump, \n               soft-leather poke. Still holding the powder box, he passes \n               her the poke. She starts to work with the thong.\n\n                                     FOWLER\n                         Look at her -- see her shine. One \n                         week's work.\n\n               Helen still struggles with the thong. He takes the poke, \n               pulls it open, pouring grains of gold into his palm. Helen \n               looks at the shining heap in his hand. Then she takes the \n               poke and pours some of the grains in her own palm. She looks \n               down at it. Her expression is calculating. She looks up at \n               Fowler and then the hard look goes away. She gives him a \n               soft smile.\n\n                                                                   DISSOLVE\n\n               EXT. MEADOW\n\n               CLOSE SHOT - DOWN ANGLE. Mary is asleep in the shade of a \n               pine. She lies on a tarp using a folded blanket for a pillow. \n               It is very quiet. She stirs, opens her eyes. Her expression \n               changes. A soft smile plays around her lips as CAMERA ANGLE \n               WIDENS and we see Clay sitting near her, leaning against the \n               bole of a pine. He isn't looking at her. Mary watches him \n               for a moment.\n\n                                     MARY\n                              (softly)\n                         Roll me a cigarette, Clay.\n\n               Clay looks over at her. Then rising he moves closer, squats \n               and rolls a cigarette. He holds it out. She licks it, then \n               puts it in her mouth. Clay lights a match, holds it out. She \n               catches his hand and holds the flame to her cigarette.\n\n                                     MARY\n                         Thanks.\n\n               She still holds his hand. They look at each other.\n\n                                     MARY\n                         Why didn't you wake me?\n\n               Clay doesn't answer.\n\n                                     MARY\n                         You should have. I don't like leaving \n                         things unfinished.\n\n                                     CLAY\n                              (quiet)\n                         Maybe it's better that way.\n\n                                     MARY\n                              (intense)\n                         You don't mean that Clay.\n\n               She holds his hand, smiling up. Clay hesitates, then desire \n               for her is more than he can bear, so he takes her in his \n               arms. They kiss, holding the kiss for a long while.\n\n               ANOTHER ANGLE\n\n               They break. She lies looking up. He half lies, half sits \n               beside her.\n\n                                     MARY\n                              (a whisper)\n                         Tell me, darling.\n\n                                     CLAY\n                         What?\n\n                                     MARY\n                         What does a man usually tell a girl?\n\n               For answer, Clay kisses her again -- hard, ruthlessly. His \n               hands crush her shoulders. Mary holds the kiss for a moment, \n               then draws back, waiting for him to say the words she wants \n               to hear. His hands pull her toward him. Mary wants the kiss -- \n               but she also wants a declaration of love. She makes one last \n               try to get it.\n\n                                     MARY\n                         Tell me -- please --\n\n               Clay's grip on her shoulders tightens. She searches his face \n               with a glance -- stares into his eyes -- then pushes him \n               away and sits up.\n\n               CLOSE SHOT\n\n               Mary. She is hurt by his silence.\n\n                                     MARY\n                         All right you don't love me. So let \n                         it go at that.\n\n               CAMERA ANGLE WIDENS. Clay's expression hardens. He drops his \n               hands from her shoulders.\n\n                                     CLAY\n                         What did you expect? Speeches I don't \n                         mean?\n\n                                     MARY\n                         I don't expect anything. A minute \n                         ago I hadn't cuite waked up.\n\n               She stands. He rises to face her.\n\n                                     MARY\n                         I'm awake now. Go on. Say what you \n                         want to say. I'll listen.\n\n                                     CLAY\n                         If it's pretty speeches you want, \n                         you won't be hearing them. Even when \n                         I mean 'em, they don't come easy.\n\n                                     MARY\n                         Save 'em for the girl in gingham. \n                         Just tell me I'm not good enough for \n                         you. Go on. Say a woman like me can't \n                         change.\n\n                                     CLAY\n                         All right -- it's said!\n\n                                     MARY\n                         Then let's get started. The sooner I \n                         get to Sonora, the better I'll like \n                         it.\n\n               Turning she starts down toward camp.\n\n               MED. LONG SHOT\n\n               ANGLED PAST Clay. Below is the camp. Beyond the camp, through \n               the trees, stands the wagon and Steve is hitching up the \n               mules. Clay hesitates, then follows.\n\n               CLOSE TRUCKING SHOT\n\n               Mary. Tears form in her eyes. She blinks them away, composing \n               herself with an effort.\n\n               EXT. CAMP\n\n               MED. SHOT - Helen and Fowler in f.g. Helen sits at one side \n               of the table, Fowler on the other. Helen holds the soft \n               leather poke. In the b.g. Mary approaches. Behind her comes \n               Clay.\n\n                                     HELEN\n                         You're sure there's more where this \n                         came from?\n\n                                     FOWLER\n                         Plenty more.\n                              (motioning)\n                         And somewhere up there's the lode, \n                         the rock rotten with it.\n\n               Helen pours the gold out in her palm as Mary comes up. Mary \n               stands looking down.\n\n                                     HELEN\n                         Pretty, isn't it? And all you have \n                         to do is shovel sand into a thing \n                         and the river does the work.\n\n               ANOTHER ANGLE\n\n               Clay enters the scene and goes over to pick up his saddle \n               bags.\n\n                                     MARY\n                              (quiet)\n                         Give it back to him. We're leavin'.\n\n                                     HELEN\n                         Maybe you are. I'm not.\n\n               She reaches over and pats Fowler's hand.\n\n                                     HELEN\n                         I'm stayin' here with Jed.\n\n               Mary looks from Helen to Fowler.\n\n                                     FOWLER\n                              (shyly)\n                         I figure we'll get along just fine.\n\n                                     HELEN\n                         Well cheer, why don't you? No more \n                         responsibilities, Mary. Marcia -- \n                         Elaine -- me -- all taken care of. \n                         Down there feeding horses and raising \n                         kids, you won't have a thing to worry \n                         about.\n\n               Mary stands looking down at Helen. Lovingly Helen pours the \n               gold back in the poke.\n\n                                     MARY\n                         I'm not raising horses or kids for \n                         anybody. I'm opening the slickest \n                         gambling house in California with a \n                         crystal chandelier, the biggest you \n                         ever saw --\n\n               Clay, saddle bags in hand, straightens. Mary directs the \n               rest of the speech at him.\n\n                                     MARY\n                         -- Gaslights and a dance floor and a \n                         big bar. Cash registers with bells \n                         and a couple of boys with armbands \n                         just to keep 'em ringing. What do \n                         you think of that?\n\n                                     HELEN\n                         Sounds fine. Only that isn't how \n                         it's going to be.\n\n               Helen juggles the poke in her hand.\n\n                                     HELEN\n                         I'm sure of this. But not of you.\n                              (shakes head)\n                         You won't open any joint. I've been \n                         watching you change. You're mad now \n                         and you think you can change back. \n                         But you can't. You'll end up making \n                         beds in a boarding house.\n\n                                     MARY\n                              (furious)\n                         That's it then.\n\n                                     FOWLER\n                              (the master)\n                         That's it. She's staying with me -- \n                         for keeps.\n\n               ANOTHER ANGLE\n\n               Steve has entered the camp and is standing looking at them \n               open-mouthed. Mary moves over to Fowler and holds out her \n               hand.\n\n                                     MARY\n                         If there were more men like you, \n                         there wouldn't be so many of us.\n\n                                     FOWLER\n                         Thanks.\n\n                                     MARY\n                         It's nice to meet a man who doesn't \n                         want to own a woman from the day she \n                         was born. I never had the luck. The \n                         only kind I've run into were tramps \n                         or dirty-minded hypocrites.\n\n               Clay moves up beside Mary.\n\n               MED. CLOSE\n\n               Clay, Mary and Fowler.\n\n                                     CLAY\n                              (to Fowler)\n                         She's aimin' at me, but her aim's \n                         bad.\n                              (to Mary)\n                         Want to know why I changed my mind \n                         about bringing you? Because I talked \n                         to Elaine -- because I was afraid to \n                         leave you with decent people, that's \n                         why. And you'll open your joint all \n                         right. You wouldn't fit anywhere \n                         else.\n\n               He moves on past her, motions to Steve.\n\n                                     CLAY\n                         Let's round up the horses.\n\n               Steve hesitates.\n\n                                     CLAY\n                              (sharp)\n                         Come on -- we don't want to keep the \n                         people in Sonora waiting.\n\n               He stalks away, followed by Steve. Mary turns and looks after \n               him.\n\n               CLOSE SHOT\n\n               Mary. She wants to break windows.\n\n               MED. CLOSE SHOT\n\n               Mary, Fowler and Helen. Helen is staring at Mary. She crosses \n               to her and puts her arm around her shoulders.\n\n                                     HELEN\n                         Mary, Honey. I talked too much, like \n                         always -- he thinks you told Elaine \n                         the things I told her.\n\n                                     MARY\n                              (furious)\n                         I don't care what he thinks.\n\n               Mary throws her arm off and moves after Clay and Steve. Helen \n               looks at Fowler and shrugs.\n\n               MED. SHOT\n\n               the wagon. As Mary hurries up to stand by the tail gate, \n               Clay and Steve, now mounted, spur their horses and start \n               across the meadow.\n\n               CLOSE SHOT\n\n               Mary. She stares after them, raging. Then she glances at the \n               wagon.\n\n               ANOTHER ANGLE\n\n               Mary in f.g. The mulos stand in their traces, waiting. Mary \n               makes up her mind what to do. Climbing into the bed, she \n               heaves out pack saddles, bed rolls, ropes, etc. Clay and \n               Stove can be seen in b.g. riding down toward where the horses \n               graze.\n\n               MED. SHOT\n\n               ANGLED TOWARD camp. Into the scene come pack saddles, bed \n               rolls. Helen and Fowler, in b.g., walk toward the wagon.\n\n               MED. CLOSE SHOT\n\n               wagon. Mary straightens, looks off, then climbs into the \n               seat and picks up the reins and the whip. She lashes the \n               mules with the whip. CAMERA ANGLE WIDENS. The mules jump and \n               gallop off. Fowler and Helen come into the scene.\n\n               ANOTHER ANGLE\n\n               the wagon, pulled by the galloping mules, is disappearing in \n               a cloud of dust.\n\n               MED. SHOT\n\n               the meadow. Clay and Steve have almost reached the horses. \n               Steve turns.\n\n                                     STEVE\n                         Clay -- look!\n\n               Clay swings around.\n\n               LONG SHOT\n\n               their ANGLE. Mary drives the wagon around a bend in the trail.\n\n               MED. CLOSE SHOT\n\n               ON Clay. He glances after Mary, then reins his horse around \n               and gallops after her, CAMERA PANNING WITH him.\n\n               EXT. TRAIL\n\n               MOVING SHOT. Mary drives the wagon along the trail. Ahead \n               beyond the river, the mountains rise. The river is running \n               bank full. The trail leads down to a rocky, dangerous bank. \n               Mary pulls the mules in at the bank.\n\n               CLOSE SHOT\n\n               Mary. She looks toward the river. She is frightened, about \n               to abandon the whole foolish enterprise. She glances back.\n\n               LONG SHOT\n\n               FROM Mary's ANGLE. Clay gallops around a bend in the trail.\n\n               CLOSE SHOT\n\n               Mary. She looks in Clay's direction, then turns and stares \n               at the river.\n\n               MED. SHOT\n\n               ANGLED PAST Mary. She makes up her mind to go through with \n               it and lashes the mules with the whip. CAMERA ANGLE WIDENS. \n               The mules balk when they reach the river. Mary lashes them \n               again. They jump forward into the torrent.\n\n               REVERSE SHOT\n\n               Clay gallops toward the river. Steve comes around the bend \n               in the trail.\n\n               MED. FULL SHOT\n\n               the river. The mules flounder, start swimming. The current \n               catches the wagon. It starts drifting downstream. Mary whips \n               the mules. They swim, the current pulls them. Then the wagon \n               goes over. Mary is thrown into the water. The mules kick \n               themselves free and swim to the other bank. Mary goes under, \n               comes up and starts swimming desperately. Clay rides into \n               the SHOT. His mare hesitates at the bank. Clay spurs her and \n               she plunges in. Mary's belongings can be seen floating down \n               the river.\n\n               ANOTHER ANGLE\n\n               Clay swims his horse toward Mary who is floundering in the \n               stream.\n\n               CLOSE SHOT\n\n               Mary. The current sweeps her against a rock. Stunned -- she \n               goes under.\n\n               MED. SHOT\n\n               Clay swims his horse to her, reaches down and lifts her up \n               in front of him.\n\n               ANOTHER ANGLE\n\n               Clay's horse, with the double burden, fights her way out of \n               the stream and scrambles up the bank to stop on level ground.\n\n               MED. CLOSE\n\n               Clay and Mary. Clay, his expression anxious, stares down at \n               the stunned Mary. He swings out of the saddle, holding her \n               tenderly to him. The brush with death has made him realize \n               how much she means to him. Gently, he puts her down on the \n               sand, stoops beside her.\n\n               ANOTHER ANGLE\n\n               Clay and Mary in f.g. Steve swims his horse across and rides \n               up the bank to dismount near them.\n\n                                     CLAY\n                         Mary --\n\n               MED. CLOSE - DOWN ANGLE\n\n               Mary opens her eyes and sits up\n\n                                     CLAY\n                              (anxiously)\n                         Are you all right?\n\n               Mary is humiliated, bedraggled and wet, still angry and \n               fighting back tears.\n\n                                     MARY\n                              (sharp)\n                         No, I'm not all right. I'm soaked \n                         and I hit myself against that rock.\n\n                                     CLAY\n                              (nettlod at her tone)\n                         I suppose that's my fault.\n\n               Mary gets to her feet. CAMERA ANGLE WIDENS. Steve stands in \n               the b.g. She looks out at the river.\n\n                                     MARY\n                              (wailing)\n                         All my clothes --\n\n                                     CLAY\n                         That's right -- worry about your \n                         clothes --\n\n               ANOTHER ANGLE\n\n               to include wagon in river. Clay, suddenly furious, points to \n               the wagon.\n\n                                     CLAY\n                         What about my wagon. Of all the crazy \n                         fool things to do. You lose a man's \n                         wagon because you're stupid and then \n                         yell about your clothes.\n\n               This is the last straw. Mary turns her back, digs into her \n               stocking and pulls out some bills. She hands them to him.\n\n                                     MARY\n                         For the wagon.\n\n               Clay looks at Mary, then down at the money.\n\n                                     MARY\n                         Go on, take it. Then you can't spend \n                         the rest of the trip expecting to \n                         get paid.\n\n                                     CLAY\n                              (furious)\n                         There won't be any rest of the trip. \n                         Over the hill is a stage road and \n                         when we hit it you get dumped into \n                         the first stage that comes along. So \n                         keep your money. You'll need it for \n                         the fare. I'm fed up with you. I was \n                         fed up with you before we started.\n\n               He turns and sees Steve standing scowling at him. He takes \n               the rest of his anger out on Steve.\n\n                                     CLAY\n                         Don't just stand there. Go on back \n                         and get the packs on the horses. \n                         We've lost all the time we're going \n                         to because of a woman.\n\n               Clay strides over to his horse and swings into the saddle. \n               Steve stands looking at Mary.\n\n                                     CLAY\n                         Come on. Didn't you hear me?\n\n               As he plunges his horse into the stream:\n\n                                                                   DISSOLVE\n\n               EXT. RIVER\n\n               FULL SHOT - the lower ford. Where the main road crosses the \n               river, it flows gently, with sand banks on either side. Three \n               horsemen appear around a bend in the trail and ride down to \n               the riverbank. They are Lednov, McCall and Peters. Lednov's \n               horse is limping badly. They ride into the river.\n\n               REVERSE ANGLE\n\n               The horses swim to shore and flounder up the bank, Lednov's \n               horse last. As the horse starts up the bank Lednov sees \n               something o.s. and reins the horse in.\n\n               MED. SHOT\n\n               FROM Lednov's ANGLE. A piece of clothing floats down the \n               river. Lednov rides down the bank into the water. He reaches \n               down awkwardly and gets the piece of clothing, then turns \n               and rides back up the bank.\n\n               ANOTHER ANGLE\n\n               The two others have turned and are watching him. He rides up \n               to them, holding out one of Mary's undergarments.\n\n                                     MCCALL\n                         We got company. Female company.\n\n                                     LEDNOV\n                              (looking at the garment)\n                         Yeah, we sure have.\n\n               He turns to scan the river.\n\n               ANGLED PAST THEM - AT RIVER\n\n               Mary's trunk comes floating by. The three men look at each \n               other, then Lednov turns his horse and starts up the bank of \n               the river. The others follow.\n\n                                                                   DISSOLVE\n\n               EXT. PEAKS OF THE SIERRA NEVADA MOUNTAINS\n\n               EXTREME LONG SHOT. The long pine-covered approaches, and the \n               glistening summit; the early snow covering the rocks with a \n               thin layer of white. CAMERA PANS DOWN FROM the heights of \n               the mountains, TO the narrow trail that winds among the trees. \n               Clay passes, and behind him the pack-horses and the romuda. \n               Following the remuda comes Mary. She is dressed in a pair of \n               Steve's pants and wears one of his shirts under her own coat.\n\n               MED. SHOT\n\n               Mary, as she swings with the movement of the horse. She is \n               tired. She wears no makeup. But she looks as unaffectedly \n               beautiful as we have ever seen her.\n\n               MED. FULL SHOT\n\n               the trail. It turns steeply, doubling back, and new Clay is \n               directly above her. He looks down at her, but she disregards \n               his glance. We feel that he might speak, but her cold \n               restraint prevents him. The wind whistles through the trees. \n               The slow plodding noise of the horses becomes more distant.\n\n                                                                   DISSOLVE\n\n               EXT. UPPER FORD - NIGHT - MOONLIGHT\n\n               MED. FULL SHOT. Lednov, McCall and Peters ride slowly through \n               the brush to where the trail enters the river. Downstream, \n               wedged in the rocks is the wagon. The three men look at the \n               wagon, then turn to look back along the trail.\n\n               LONG SHOT\n\n               their ANGLE. Fowler's campfire flickers through the trees.\n\n               MED. CLOSE\n\n               the three men. They look at each other. Lednov motions in \n               the direction of Fowler's camp. They start back along the \n               trail.\n\n               EXT. MEADOW - NIGHT\n\n               FULL SHOT. The three men ride along the trail toward the \n               camp. Through the trees the campfire flickers.\n\n               EXT. FOWLER'S CAMP - NIGHT\n\n               MED. SHOT. Fowler is putting the supper dishes up on the \n               shelves beside the fireplace. The camp is cleaner than it \n               was earlier in the day. It is evident that he has gone to \n               great pains to make his visitor comfortable.\n\n               A mirror has been tacked up on a tree, and under it is a \n               wash basin. Fowler's rifle and shotgun are in a rack near \n               the fireplace. Helen's trunk stands open near the lean-to. \n               Helen, wearing a robe, takes some clothing from it, closes \n               the trunk.\n\n                                     HELEN\n                         You can put this out of the way, \n                         Jed. It's empty.\n\n               Fowler turns and smiles. Helen pushes through the curtains \n               into the lean-to. Fowler puts the last of the dishes on the \n               shelf, crosses to the trunk and moves it over to the side of \n               the lean-to. Turning to go back to the fireplace, he stops.\n\n               ANOTHER ANGLE\n\n               Fowler in the f.g. Lednov, rifle in hand, stands just inside \n               the camp on the meadow side.\n\n                                     FOWLER\n                              (turning slowly)\n                         What do you want?\n\n               Lednov moves slowly forward to stand near the table. He looks \n               around him. Fowler starts slowly toward the fireplace.\n\n                                     LEDNOV\n                         I saw your fire and dropped by to \n                         say hello.\n\n                                     FOWLER\n                         Well, say it.\n\n               Trying to be casual, Fowler moves closer to where the guns \n               are racked.\n\n                                     LEDNOV\n                         What's the matter -- restless?\n\n                                     FOWLER\n                         Yes, people make me restless.\n\n                                     LEDNOV\n                         Even women?\n\n                                     FOWLER\n                         There aren't any women here.\n\n                                     LEDNOV\n                         I suppose that's your wagon in the \n                         river.\n\n                                     FOWLER\n                         Some people who went by this way \n                         lost it.\n                              (nervously)\n                         Two men and some women. They packed \n                         their stuff on horses and went on.\n\n                                     LEDNOV\n                         And you're all alone.\n\n                                     FOWLER\n                         Yeah.\n\n               He has edged closer to the gun rack. Lednov seems unaware \n               that he is near the guns. His interest is centered on the \n               lean-to. He moves to the entrance, stands with his hand on \n               the canvas.\n\n                                     LEDNOV\n                         Suppose I take a look.\n\n                                     FOWLER\n                         Go ahead.\n\n               Lednov pulls back the flap. His back is to Fowler, who starts \n               quickly for the tree, only to stop as McCall comes out from \n               behind it.\n\n                                     MCCALL\n                         Looking for something?\n\n               Fowler drops his hands to his side. Lednov turns, grins at \n               Fowler, and enters the lean-to.\n\n               INT. LEAN-TO - NIGHT\n\n               The shelter is dark. Lednov strikes a match and looks around. \n               The place is empty. There is a bunk, made up. On the left \n               hand wall a curtain of gunny sacks covers the clothes hanging \n               there. The match burns down to Lednov's fingers. There is a \n               SOUND of a scuffle outside a blow, and a groan. Lednov drops \n               the match and hurries out.\n\n               EXT. CAMP - NIGHT\n\n               Lednov comes out of the lean-to. Fowler is sprawled by the \n               table. McCall stands over him, rifle raised.\n\n                                     LEDNOV\n                         Hold it, Mac.\n\n               EXT. BACK OF LEAN-TO - NIGHT\n\n               MED. CLOSE SHOT. Helen stands flattened against a tree.\n\n                                     LEDNOV'S VOICE\n                         Get up.\n\n               Cautiously Helen starts moving away.\n\n               EXT. CAMP - NIGHT\n\n               MED. SHOT. Fowler pulls himself to his feet. Mac stands near \n               him.\n\n                                     LEDNOV\n                         Come on. Where'd the women go?\n\n               Fowler sinks on a bench, his head in his hands. Lednov moves \n               closer.\n\n                                     LEDNOV\n                         When I ask questions, I like to hear \n                         answers.\n\n                                     FOWLER\n                         They went on like I told you.\n\n               EXT. FOREST - MOONLIGHT\n\n               MED. SHOT. Helen cautiously moves away from the camp.\n\n                                     LEDNOV'S VOICE\n                         How long ago?\n\n                                     FOWLER\n                         Five, six hours.\n\n               A twig snaps underfoot. Helen freezes.\n\n               EXT. CAMP - NIGHT\n\n               MED. SHOT. Lednov is staring off in the direction of Helen. \n               McCall moves to the edge of the lean-to, looking off.\n\n               EXT. FOREST - NIGHT\n\n               MED. CLOSE SHOT. Helen starts forward again, more cautiously \n               than ever. She reaches a tree, turns to look back.\n\n               ANOTHER ANGLE\n\n               Helen, back to camera, is in immediate f.g. Through the trees \n               can be seen the camp and the flickering fire. She turns, and \n               then fright comes into her expression.\n\n               REVERSE SHOT\n\n               Peters stands in front of her. As he reaches out for her, \n               she tries to get away. He grabs her, wrapping his arms around \n               her.\n\n               EXT. CAMP - NIGHT\n\n               MED. SHOT. From o.s. comes the SOUND of Helen and Peters \n               struggling. Fowler, hearing the SOUND, gets to his feet. \n               Lednov and McCall turn on him.\n\n                                     LEDNOV\n                         Sit down.\n                              (calling)\n                         All right, Peters, come on over here.\n\n               EXT. FOREST - NIGHT\n\n               MED. SHOT. Peters, carrying the struggling Helen, heads for \n               the camp.\n\n               EXT. CAMP - NIGHT\n\n               ANOTHER ANGLE. Fowler makes a futile dive for Lednov. McCall \n               swings his rifle. Fowler goes down. In the b.g. Peters drags \n               the struggling Helen around the lean-to into the camp.\n\n                                     LEDNOV\n                              (to Fowler)\n                         So you were all alone.\n\n               He moves forward to meet Helen and Peters. Lednov reaches \n               out for Helen. Peters pulls her away.\n\n                                     PETERS\n                              (sharp)\n                         You keep your hands off.\n\n               McCall has taken his attention from Fowler and gives it to \n               Helen. Unnoticed now, Fowler is struggling back to \n               consciousness. He tries to pull himself up. McCall turns \n               back and kicks him again.\n\n                                     HELEN\n                              (yelling)\n                         Let him alone!\n\n               She rakes Peters' face with her fingernails, tries to fight \n               free. Lednov reaches out and grabs her arm. Peters knocks \n               his arm down. Free for the moment, Helen launches an attack \n               on McCall, who is getting ready to boot Fowler again. She is \n               on him like a cat, swarming all over him. He defends himself. \n               Helen is yelling furiously as she fights McCall.\n\n                                     HELEN\n                         Kick a guy, would you! You scum! You \n                         won't do any kickin' when they come \n                         back.\n\n               Lednov has reached her now. He wraps his arms around her and \n               pulls her away from McCall. Helen tries to fight him.\n\n                                     HELEN\n                         You dirty murderers... killin' people \n                         when they're sleepin'...\n\n               Lednov pinions her arms.\n\n                                     LEDNOV\n                         How do you know who we are?\n\n                                     HELEN\n                         Everybody knows --\n\n                                     LEDNOV\n                              (excited)\n                         Who brought you here?\n\n               Helen doesn't answer. Lednov starts twisting her arms.\n\n                                     LEDNOV\n                         You said somebody was comin' back -- \n                         who's comin' back?\n\n                                     HELEN\n                              (moaning)\n                         Stop it --\n\n               As the pain increases she blurts out Clay's name.\n\n                                     HELEN\n                         Clay Phillips.\n\n                                     LEDNOV\n                         Where is he?\n\n                                     HELEN\n                         Up the trail.\n\n               In a fury, Lednov crushes her arm.\n\n                                     LEDNOV\n                         How far up the trail?\n\n                                     HELEN\n                              (moaning)\n                         I don't know -- I don't know.\n\n               He hurls her from him. She goes back against the table. Fowler \n               is trying to struggle to his feet. In blind rage, Lednov \n               raises his gun and fires. Fowler crumples. Helen looks down, \n               too horrified and terrified to scream. Lednov looks at her, \n               then almost casually he shoots her. McCall and Peters stand \n               watching as though frozen.\n\n                                     PETERS\n                              (huskily)\n                         You didn't have to do that.\n\n                                     LEDNOV\n                              (deadly)\n                         Why not? She might have got to Clay \n                         Phillips before I did.\n\n               AS HE TURNS,\n\n                                                                   FADE OUT\n\n               EXT. OPEN RIDGE FADE IN\n\n               MED. FULL SHOT - ANGLES east. Behind the ridge rises the \n               range through which the pass to Nevada cuts its way. The \n               trail which has dipped down into a canyon comes up to follow \n               the ridge a ways and then drops down again. Lednov, McCall \n               and Peters ride along the trail. Lednov, in the lead, stops \n               suddenly and looks off.\n\n               EXTREME LONG SHOT\n\n               DOWN ANGLE from Lednov's point of view. Far below is a meadow \n               and crossing it is a wagon road. This is the road from \n               Yosemite to Sonora. The road comes down the hill to the south \n               and, as the forest is open at this point, anything approaching \n               along the road can be seen for some distance. It crosses the \n               meadow and continues into the northwest. In the meadow is a \n               snake-rail corral. Clay's pack train comes out of the woods \n               above the meadow and starts down.\n\n               MED. SHOT\n\n               McCall, Lednov and Peters. Lednov motions to his men and \n               they hurriedly ride forward into the shelter of some trees.\n\n               MED. SHOT\n\n               the pack train. Mary, half asleep, slumps forward. Her horse \n               has stopped. Steve rides up alongside and looks over at her, \n               anxiously.\n\n                                     STEVE\n                         Are you all right?\n\n               Mary starts into wakefulness. She smiles at Steve.\n\n                                     MARY\n                         For the last ten miles I've been \n                         trying to figure out how to sleep \n                         sitting up. I'm getting to the point \n                         where I don't think there's any place \n                         named Sonora.\n\n                                     STEVE\n                         It's a long ways yet.\n                              (arrogantly, to Clay)\n                         I figure we ought to camp. She's \n                         tired.\n\n                                     CLAY\n                         So am I and so are the horses.\n\n               He rides on ahead. Steve looks after him, annoyed, then \n               follows with Mary.\n\n               EXT. MEADOW\n\n               Clay leads the pack train out into the clearing and toward \n               the road. A small creek threads its way through the meadow. \n               Clay rides up to the creek and swings out of the saddle. He \n               is taking the saddle off as the others ride up.\n\n                                     CLAY\n                              (to Steve)\n                         Take the packs off. And run the horses \n                         into the corral.\n\n               He throws the saddle down, takes his rifle out of the \n               scabbard. Steve doesn't move.\n\n                                     CLAY\n                         I said take the packs off.\n\n               He starts off past Mary, glances up.\n\n               MED. CLOSE SHOT\n\n               Mary leans wearily forward on the pommel, too tired to \n               dismount.\n\n                                     CLAY\n                              (gruffly)\n                         I figure we'll make better time, \n                         letting the horses rest for a spell.\n\n               Mary looks down at him. She is hoping he will reach up and \n               lift her down.\n\n                                     CLAY\n                         So grab yourself some sleep while \n                         you have the chance.\n\n                                     MARY\n                         If you want to go on, I can make it \n                         all right.\n\n                                     CLAY\n                         Like I said, I was thinkin' of the \n                         horses.\n\n               He turns a way abruptly and goes toward the road. Mary looks \n               after him, disappointed. Steve comes over and helps her down.\n\n               MED. SHOT\n\n               Steve and Mary. Steve spreads a tarp on the grass.\n\n                                     STEVE\n                         You stretch out. I'll fix something \n                         to eat.\n\n                                     MARY\n                              (sitting)\n                         Thanks, Steve.\n\n               Steve goes back and starts unpacking the horses. Mary looks \n               off in Clay's direction, then stretches out and pillows her \n               head on her arm. Now the sun is coming up and driving the \n               darkness out of the meadow. In the distance Clay can be seen \n               climbing up on a rise.\n\n               MED. CLOSE SHOT\n\n               Clay. He climbs up on an eminence and looks back toward the \n               hills.\n\n               LONG SHOT\n\n               his ANGLE. The open ridge. There is no sign of Lednov.\n\n               ANGLED PAST CLAY\n\n               INTO the meadow. Steve has unpacked the horses. They graze \n               inside the crude corral. Steve is collecting wood for a fire. \n               Clay hurries down toward him.\n\n               MED. SHOT\n\n               Steve squats beside the pile of needles, twigs and pine cones. \n               He strikes a match and sets the needles aflame. Clay hurries \n               into the scene and roughly kicks the fire out. Steve rises.\n\n                                     CLAY\n                              (angrily)\n                         If you want 'em to find us, why don't \n                         you go up on the hill and wave your \n                         shirt or fire your rifle.\n\n               Steve is ashamed of his thoughtlessness and for a moment is \n               apologetic.\n\n                                     STEVE\n                         I didn't stop to think, Clay.\n\n                                     CLAY\n                              (short)\n                         You better start.\n\n               Clay turns and goes over to where the packs lie. He kneels \n               beside the pack, rummages in them for hardtack and tinned \n               food. Steve looks after him.\n\n               CLOSE SHOT\n\n               Steve. He is hurt and angry. Knowing he was in the wrong \n               about the fire doesn't help matters. He'd like to go off in \n               the woods and cry, but that's out of the question. Instead \n               he follows Clay and stands above him.\n\n               MED. CLOSE SHOT\n\n                                     STEVE\n                         Maybe you and me better split up \n                         when we hit Sonora.\n\n               Clay speaks without looking up.\n\n                                     CLAY\n                              (mildly)\n                         All right, I hurt your feelings. But \n                         you know better than to go lightin' \n                         fires.\n\n                                     STEVE\n                         That ain't why. I just figure it's \n                         about time to start runnin' my own \n                         life.\n\n               Clay spreads the food on a tarp, sits down and starts eating \n               a hardtack.\n\n                                     CLAY\n                         Maybe you're not hungry, but I am.\n\n               Steve stares down at him angrier, more hurt than ever.\n\n                                     CLAY\n                         Come on. We got a couple hours to \n                         eat and get some sleep.\n\n                                     STEVE\n                         I'll eat when I'm good and ready.\n\n                                     CLAY\n                         Kind of feeling your oats this \n                         morning. I haven't laid a hand on \n                         you for quite a while, but that \n                         doesn't mean you're too old.\n\n                                     STEVE\n                         What makes you think you're so \n                         almighty? Telling people what to do \n                         and how to act when you don't even \n                         know how yourself.\n\n               [As this scene continues, there is heard, faintly o.s. the \n               SOUND of little bells, the kind that teamsters put on the \n               hames of their horses. Over the hill, in the direction of \n               Yosemite, a stage is approaching. It is coming slowly uphill. \n               Soon it will be visible on the rise about a mile south of \n               the meadow.]\n\n               ANOTHER ANGLE\n\n               SHOOTING TOWARD Steve and Clay PAST Mary. She is asleep.\n\n                                     STEVE\n                         You ain't even man enough to own up \n                         when you're wrong.\n\n               Clay rises and stands facing Steve.\n\n                                     STEVE\n                         Go on, hit me.\n\n                                     CLAY\n                         Sit down and eat. Till I say the \n                         word, you're doing what you're told.\n\n                                     STEVE\n                         You oughta say you're sorry -- that's \n                         what you oughta do.\n\n                                     CLAY\n                         You keep your nose out of my life, \n                         young fella.\n\n                                     STEVE\n                         Maybe I haven't lived as long as you \n                         have, but I know a sight more about \n                         people and I wouldn't talk to a mule \n                         like you talked to her and, if I \n                         did, I'd say how sorry I was. I'd be \n                         man enough to do that.\n\n               Steve's voice rises during this speech. In f.g. Mary stirs \n               and opens her eyes. Then she sits up.\n\n                                     CLAY\n                         I said keep your nose out of my life. \n                         No kid is going to tell me how to \n                         run it.\n\n                                     STEVE\n                         You think you're so slmighty -- smart -- \n                         Who are you to sit up there and say \n                         nobody's good enough for you, like \n                         you said yesterday -- just because a \n                         man kisses a woman --\n\n               Mary has risen. She is listening to Steve. She is also \n               listening to the bells.\n\n               LONG SHOT\n\n               her ANGLE. Over the rise comes the stage. It is still a long \n               way off.\n\n                                     STEVE'S VOICE\n                         -- doesn't mean he wants to marry \n                         her.\n\n               ANOTHER ANGLE\n\n               to include all three. The brothers still don't see Mary.\n\n                                     STEVE\n                         Well, if you didn't mean it, why did \n                         you kiss her?\n\n               Clay is ashamed but won't show it. He puts his hand on Steve's \n               shoulder and pushes him.\n\n                                     CLAY\n                         Shut up and eat.\n\n               Steve swings for his chin. Clay ducks the blow, grabs Steve's \n               wrist. Steve swings with his left, hitting Clay ineffectually. \n               Clay pins Steve's arms to his side.\n\n                                     MARY\n                              (sharply)\n                         Stop it -- both of you.\n\n               She walks toward them as Clay releases Steve and steps back. \n               Steve puts his hands up, making ready for another round.\n\n                                     MARY\n                         I won't have you fighting over me.\n\n                                     CLAY\n                              (to Steve)\n                         I'm sorry.\n\n                                     STEVE\n                         You don't know what it is to be sorry.\n\n                                     MARY\n                              (sharp)\n                         Steve --\n\n               Steve turns abruptly and moves away. He is on the verge of \n               tears.\n\n                                     MARY\n                              (to Clay)\n                         Mind sortin' out my things -- I'm \n                         leaving.\n\n               She motions off. Clay is suddenly aware of the approaching \n               stage. He looks in that direction.\n\n               LONG SHOT\n\n               FROM his ANGLE. The stage drives along the road.\n\n                                     MARY\n                         Maybe it isn't going to Sonora, but \n                         it's going somewhere, which is all \n                         right with me.\n\n                                     CLAY\n                         It's going to Sonora.\n\n                                     MARY\n                         Fine -- maybe I'll see you there \n                         sometime.\n\n               She turns and starts going through the kyacks, looking for \n               her things. Clay frowns down at her.\n\n                                     MARY\n                         Because as you said, that's where I \n                         belong.\n\n               Mary's attention is on the kyacks. From where Clay stands \n               near her he can see the trail leading down through open \n               country toward the meadow.\n\n                                     CLAY\n                         I said a lot of things -- some of \n                         'em --\n\n               Something o.s. catches his attention, then he pauses to look \n               off.\n\n               EXT. TRAIL\n\n               LONG SHOT - his ANGLE. Up on the ridge there is the flash of \n               sun on metal.\n\n               EXT. RIDGE\n\n               MED. SHOT. Lednov, McCall and Peters ride through the trees.\n\n               CLOSE SHOT\n\n               Clay. He looks up anxiously, then turns. CAMERA ANGLE WIDENS \n               to include Mary and she straightens and faces him, her back \n               to the trail.\n\n                                     MARY\n                         Some of 'em you didn't mean but most \n                         of 'em you did. I don't blame you \n                         because I understand your way of \n                         thinking and why you think that way. \n                         You want your women on pedestals. \n                         But they have to be born on 'em -- \n                         they can fall off but they can't \n                         climb back up.\n\n                                     CLAY\n                              (sharply)\n                         I can't help how I think. You're \n                         trained a certain way when you're a \n                         kid and you can't change.\n\n               He bends down and picks up her things.\n\n                                     CLAY\n                         If you're gonna catch this stage, \n                         come on.\n\n               ANOTHER ANGLE\n\n               The stage has speeded up and is coming fast down the road. \n               Mary looks up at Clay hurt and shocked by his sudden \n               sharpness. She had hoped he wouldn't let her go.\n\n                                     MARY\n                         I can't change either. Not unless \n                         somebody wants me enough to give me \n                         a hand.\n\n                                     CLAY\n                         Hurry up.\n\n               He starts off, Mary following.\n\n               MED. CLOSE TRUCKING SHOT\n\n               Mary makes one last attempt to get him to change his mind.\n\n                                     MARY\n                              (softly)\n                         I'm fool enough to believe that one \n                         of these days somebody will. Somebody \n                         who wants me as I am will maybe walk \n                         into the place where I'm working and \n                         take me out of there.\n\n                                     CLAY\n                         Maybe they will.\n\n               He waves for the stage to stop.\n\n               ANGLED PAST STAGE\n\n               The driver sees Clay waving and pulls the horses in. The \n               stage moves down to the edge of the meadow.\n\n               MED. SHOT\n\n               The stage. It is a small one, a double-seated buckboard with \n               one woman passenger and the driver an elderly man. On the \n               side of the vehicle is painted: \"Yosemite-Sonora Stage Line\". \n               The woman, middle-aged and rather drab, looks at Mary \n               curiously.\n\n                                     CLAY\n                         Mind giving a lady a lift into town?\n\n                                     DRIVER\n                              (to Mary)\n                         Climb right in.\n\n               He jumps out of the stage and follows Clay, carrying Mary's \n               belongings, around back of the stage. Mary gets into the \n               stage beside the woman who moves over for her.\n\n               ANOTHER ANGLE\n\n               on back of stage. The driver opens the boot and Clay hands \n               him Mary's belongings. He starts stowing them in the boot.\n\n                                     CLAY\n                         Will you be seeing the sheriff?\n\n                                     DRIVER\n                         Depot's right next to his office.\n\n               Clay starts scribbling a note. In the b.g. Steve has moved \n               up beside the stage. He stands looking up at Mary.\n\n               MED. CLOSE\n\n               featuring Mary and Steve.\n\n                                     STEVE\n                              (shyly)\n                         Goodbye, ma'am.\n\n               Mary reaches down and takes his hand.\n\n                                     MARY\n                              (quietly)\n                         Goodbye, Steve. Don't fight with him \n                         any more.\n\n               Steve's expression hardens. He glances toward the back of \n               the stage, then at Mary.\n\n                                     MARY\n                         It's not his fault, just you remember \n                         that. It's mine. Don't ask me why \n                         because you couldn't understand now. \n                         Some day you will.\n\n               Clay and the driver come around the stage. Steve steps back. \n               The driver climbs into the seat. Clay and Mary look at each \n               other.\n\n                                     MARY\n                         Goodbye. Thanks for the lift.\n\n                                     CLAY\n                         Goodbye, Mary.\n\n                                     MARY\n                         By the way, if you ever go past the \n                         Wyatt ranch, have another talk with \n                         Elaine.\n\n               Before Clay can speak, the driver snaps his whip and the \n               stage jerks away down the road. Mary doesn't look back. Clay, \n               in f.g., looks after it. Dust rises. It disappears around a \n               bend in the road. Clay turns and starts across the meadow. \n               Steve looks after Clay, hesitates, then follows.\n\n               MED. CLOSE\n\n               as Clay reaches the spot where the kyacks and saddles are \n               thrown. Steve comes up to him.\n\n                                     STEVE\n                         You know what she asked me?\n\n                                     CLAY\n                         I don't care what she asked you.\n\n                                     STEVE\n                         She told me not to fight with you \n                         anymore. She said it wasn't your \n                         fault, but -- I figure different...\n\n               Clay is looking off, hardly listening.\n\n                                     STEVE\n                         It is so your fault and... and I \n                         guess maybe when we hit the ranch... \n                         you andme better...\n\n                                     CLAY\n                              (sharply)\n                         You want to split up? --\n\n               Clay's eyes are narrow, peering toward:\n\n               EXT. ROCKY HILLSIDE - DAY\n\n               LONG SHOT (Clay's ANGLE) of the shadowed slope. Something \n               moves, indistinct, and then the sun catches a gun barrel as \n               it disappears.\n\n               MED. CLOSE\n\n               Clay and Steve as Clay turns sharply.\n\n                                     CLAY\n                         -- Why wait? Go on, saddle up now \n                         and beat it.\n\n               Steve looks over toward the horses, stalling.\n\n                                     STEVE\n                         Half of them are mine.\n\n                                     CLAY\n                              (hard)\n                         You'll get your share. Go on. I don't \n                         want you around.\n\n               Turning, he crosses to where Steve's horse stands. CAMERA \n               ANGLE WIDENS. He loads the horse back, throws a blanket and \n               saddle on and cinches up the saddle. Steve watches, angry \n               and hurt. Clay steps back.\n\n                                     CLAY\n                         There you are.\n\n               MED. CLOSE\n\n               the two brothers. They stare at each other. Steve is on the \n               verge of tears. Hurriedly, he swings into the saddle.\n\n               MED. SHOT\n\n               He glances down to Clay and digs his spurs in and gallops \n               after the stage. Clay's stern expression leaves his face. He \n               looks after the boy, smiles softly and then starts carrying \n               the pack-saddle into the shelter of the forest.\n\n               EXT. ROAD\n\n               MED. SHOT. Steve rides along the road. He pulls his horse \n               in, then glances back.\n\n               EXT. MEADOW\n\n               LONG SHOT - Steve's ANGLE. Clay is carrying the belongings \n               into the shelter of the forest. CAMERA PANS OVER and UP. \n               Momentarily a horseman is seen riding into an open space.\n\n               CLOSE SHOT\n\n               Steve as he stares. Then understanding his brother's actions, \n               he jerks the reins and swings the horse around and rides \n               back toward the meadow.\n\n               EXT. MEADOW\n\n               MED. SHOT - Steve gallops across the meadow to the corral, \n               swings off and starts unsaddling. Clay is inside the forest \n               lighting the fire.\n\n               MED. CLOSE\n\n               Clay. He looks over toward Steve, then rises and hurries \n               toward him.\n\n               MED. CLOSE\n\n               Clay and Steve. Steve takes down the bars and puts the horse \n               in the corral. Clay comes up to him as he's putting the bars \n               back up.\n\n                                     CLAY\n                         What did you come back for?\n\n                                     STEVE\n                         Like I told you, half those horses \n                         are mine. I'm makin' sure they get \n                         to the ranch safe. So let's quit \n                         arguing and do whatever you figure \n                         on doin'.\n\n               The two brothers stare at each other.\n\n                                     CLAY\n                              (softly)\n                         Is that the only reason you came \n                         back?\n\n                                     STEVE\n                              (gruff)\n                         Sure. What other reason would there \n                         be?\n\n                                     CLAY\n                              (smiling)\n                         I just wondered. Let's go.\n\n               EXT. MEADOW\n\n               LONG SHOT - DOWN ANGLE. Above the pines smoke rises. The \n               horses graze inside the corral. In the shadowy forest by the \n               creek, Clay's camp can be seen. A tarp has been stretched \n               over the camp. Lednov moves into the right hand side of the \n               frame and looks down.\n\n               REVERSE SHOT\n\n               Lednov stands on a rocky hill looking down in the meadow. \n               Behind him are McCall and Peters. They are screened from the \n               meadow by the rocks. Lednov turns and starts off through the \n               rocks to circle above the camp. The two men follow. All are \n               on foot.\n\n               EXT. ROCK\n\n               LONG SHOT SHOOTING PAST Clay and along his rifle. Clay, hidden \n               behind a wall of rock, is watching the trail where it comes \n               down into the meadow. Something moves on the rocky hill above \n               and to his left. He looks up, waiting. The movement stops. \n               Clay glances around.\n\n               ANOTHER ANGLE\n\n               Below Clay, Steve lies in a cut in the rocks, watching the \n               camp. Clay motions toward the hill. Steve nods.\n\n               EXT. ROCK\n\n               PAN SHOT - FROM Clay's ANGLE. CAMERA, SHOOTING THROUGH the \n               rifle sights, SEARCHES the forest and meadow. As a flight of \n               birds suddenly rises above a section of the forest, the CAMERA \n               HOLDS.\n\n               EXT. ROCKY HILLTOP\n\n               MED. SHOT. Lednov, McCall and Peters have stopped, halted by \n               the sudden flight of the birds.\n\n               ANOTHER ANGLE\n\n               Below is the camp. Lednov motions.\n\n                                     LEDNOV\n                              (to Peters)\n                         Go on down and have a look.\n\n                                     PETERS\n                              (scoffing)\n                         And get my head blown off! Not me.\n\n               Lednov looks at McCall. From his pocket, McCall takes a coin.\n\n                                     MCCALL\n                         Call it.\n\n                                     PETERS\n                         Heads.\n\n               McCall flips the coin, shows it to Peters. Peters shrugs and \n               starts moving cautiously down toward the camp.\n\n               MED. CLOSE\n\n               Lednov and McCall.\n\n                                     LEDNOV\n                         And you! Get going.\n\n               McCall moves off to circle around in back of where Clay and \n               Steve wait. Lednov watches him go then, moving to the shelter \n               of the rocks, waits.\n\n               ANOTHER ANGLE\n\n               His position commands the meadow, where the horses are \n               corralled, and the camp.\n\n               EXT. ROCK\n\n               LONG SHOT - Clay's ANGLE. The forest is silent. Then, \n               momentarily, Peters is in the open. Clay brings his rifle \n               up, trying to get him in the sights. Wheeler disappears.\n\n               EXT. PETERS' POSITION\n\n               MED. SHOT. Stealthily, Peters makes his way down toward the \n               camp.\n\n               LONG SHOT\n\n               ANGLED PAST Peters. Peters, sheltered by a tree trunk, raises \n               his rifle, then his eye catches a movement. He fires.\n\n               EXT. ROCK\n\n               LONG SHOT - PAST Clay. Clay has Peters in his sights. He \n               fires.\n\n               MED. CLOSE\n\n               Peters. Peters is stretched on the needle-covered earth, \n               dead.\n\n               EXT. ROCK\n\n               MED. CLOSE - Clay. Clay throws the empty cartridge out and \n               another in. O.s. there is a SHOT. A bullet hits near him. \n               Clay looks off in the direction where Lednov is waiting on \n               the hill west of the camp. Another SHOT is heard. A bullet \n               smacks into the rock close to Clay. It comes from McCall's \n               position southwest of the camp. Clay ducks.\n\n               EXT. LEDNOV'S POSITION\n\n               LONG SHOT - Lednov's ANGLE. Lednov is trying to get Clay in \n               his sights. He fires as Clay is seen momentarily.\n\n               EXT. MCCALL'S POSITION\n\n               LONG SHOT - McCall's ANGLE. McCall fires at Clay.\n\n               EXT. ROCK\n\n               Clay and Steve crawl down and away from Lednov and McCall's \n               positions. Steve grins at Clay. He is enjoying this.\n\n                                     CLAY\n                              (quietly)\n                         Stick here.\n\n               Moving cautiously he starts in McCall's direction.\n\n               EXT. MCCALL'S POSITION\n\n               MED. LONG SHOT. McCall, rifle ready looks down toward the \n               base of the log where Steve now waits. A twig snaps below. \n               He sights the rifle, waiting.\n\n               EXT. CLAY'S POSITION\n\n               MED. CLOSE. Clay stands still. The forest is silent again.\n\n               EXT. LEDNOV'S POSITION\n\n               MED. LONG SHOT. Lednov, sheltered by a tree, has his rifle \n               trained on Clay's position.\n\n               EXT. CLAY'S POSITION\n\n               MOVING SHOT. Clay, walking cautiously, climbs toward McCall's \n               position. Ahead is an open area. Stooping, Clay picks up a \n               rock and draws back his arm to throw it.\n\n               EXT. MCCALL'S POSITION\n\n               MED. LONG SHOT - ANGLED TOWARD open area below. The stone \n               thrown by Clay, crashes in the brush across the open area. \n               McCall fires.\n\n               EXT. CLAY'S POSITION\n\n               UP ANGLE PAST Clay. The flash of sunlight on McCall's rifle \n               attracts Clay's attention. He fires. From behind him, Steve \n               fires. Clay runs across the open area. Steve fires again.\n\n               EXT. MCCALL'S POSITION\n\n               MED. SHOT. McCall tries to struggle to his feet. Failing, he \n               brings his rifle up. Clay in b.g. runs to the shelter of a \n               tree. McCall fires. Clay's rifle barrel emerges from behind \n               tree. McCall tries to drag himself to safety. Clay fires. \n               McCall goes down on his face. From Lednov's position comes \n               the SOUND of a shot.\n\n               LONG PAN SHOT\n\n               Clay's ANGLE. CAMERA SEARCHES Lednov's position for some \n               movement. There is none.\n\n               EXT. LEDNOV'S POSITION\n\n               DOWN ANGLE PAST Lednov. Below in the corral the horses are \n               hunched together. Lednov looks down, then raising his rifle, \n               he brings one of the horses into the beads of the sights. It \n               is the bell mare.\n\n                                     LEDNOV\n                              (calling)\n                         Come on out, Phillips.\n\n               His voice echoes again and again. Clay's answer is a shot. \n               It cuts the branches above Lednov's head.\n\n               CLOSE SHOT\n\n               Lednov. He ducks lower, steadies his rifle.\n\n                                     LEDNOV\n                              (his voice echoing)\n                         Those horses down there -- they don't \n                         amount to much to me. Look at the \n                         one with the bell.\n\n               LONG SHOT\n\n               ANGLED THROUGH sights. The sights center on the bell mare.\n\n               MED. CLOSE SHOT\n\n               Steve. He is standing recklessly trying to find Lednov in \n               the rocks above.\n\n               MED. CLOSE SHOT\n\n               Clay. He stares down at the horses. A shot is heard.\n\n               EXT. CORRAL\n\n               MED. SHOT. The bell mare rears as the bullet strikes the \n               bell. The horses mill around the corral.\n\n               EXT. LEDNOV'S POSITION\n\n               MED. CLOSE SHOT.\n\n                                     LEDNOV\n                              (calling; echoing)\n                         Next time I won't miss.\n\n               CLOSE SHOT\n\n               Clay. He starts forward, face set with rage.\n\n                                     LEDNOV'S VOICE\n                              (echoing)\n                         Watch the one with the white face.\n\n               Recklessly Clay raises his rifle and fires three shots at \n               Lednov's position.\n\n               EXT. ROCKS\n\n               MED. FULL SHOT as Clay fires, Steve starts running down. He \n               crosses the creek.\n\n               EXT. LEDNOV'S POSITION\n\n               LONG SHOT - DOWN. Lednov sees Steve running. He swings his \n               rifle away from the horses and tries to get the boy in his \n               sights. Clay fires again. A bullet smacks into the tree. \n               Lednov flinches. Then again he tries to center on Steve.\n\n               EXT. MEADOW\n\n               MED. SHOT. Steve runs, bending low, toward the rail fence. A \n               bullet kicks up dirt near him.\n\n               EXT. LEDNOV'S POSITION\n\n               LONG SHOT - DOWN. Steve has almost reached the fence. Lednov \n               fires. Steve stumbles and goes down.\n\n               MED. CLOSE\n\n               Steve. He lies still a moment, then painfully he crawls to \n               the rails and with a great effort tries to tear the rails \n               down. Lednov fires. The bullet whistles past. Steve pulls \n               the fence down, crawls away from the opening. The horses, \n               milling around the corral break through. Steve lies still, \n               face down.\n\n               FULL SHOT\n\n               The meadow, ANGLED PAST Clay. The horses scatter across the \n               meadow.\n\n               MED. SHOT\n\n               Clay, now the hunter, moves toward Lednov's position. Lednov \n               fires. Clay runs and jumps into the creek. Sheltered by the \n               bank he makes his way up the creek.\n\n               MED. CLOSE\n\n               Lednov. He waits, his rifle ready. O.s. a twig snaps. \n               Cautiously he looks ahead. There is silence.\n\n               MED. SHOT\n\n               his ANGLE. A light wind runs through the great trees. Shafts \n               of light filter through the trees, making patterns on the \n               forest floor. The light is dim, deceptive. Lednov, rifle \n               ready, searches for some sign of Clay. Then from another \n               direction comes the SOUND of movement. Lednov swings his \n               rifle in that direction, waits. The SOUND has stopped.\n\n                                     CLAY'S VOICE\n                         I'm here Lednov.\n\n               His voice echoes across the hills. Lednov sights along his \n               rifle at the direction from which the SOUND of Clay's voice \n               came. Momentarily Clay is seen as he runs from one tree to \n               another. Lednov fires.\n\n               MED. CLOSE\n\n               Clay. Clay cautiously edges around the base of a tree. He \n               picks up a stick, stops.\n\n                                     CLAY\n                         Come on out.\n\n               His voice can be heard echoing across the hills. He tosses \n               the stick. Lednov fires at the SOUND of the falling stick.\n\n                                     LEDNOV'S VOICE\n                         Come and get me.\n\n               As his voice echoes across the hills Clay quickly moves into \n               the open and fires.\n\n               ANOTHER ANGLE\n\n               Lednov crumples forward as his echoing voice fades out. Clay \n               moves over to him to stand looking down.\n\n                                                                   DISSOLVE\n\n               EXT. MEADOW\n\n               MED. SHOT. Steve sits propped up against the fence rail. His \n               shirt is off and his shoulder is crudely bandaged. Clay, who \n               has been putting the bandage on, stands and takes a sack of \n               tobacco from his pocket.\n\n                                     CLAY\n                              (rolling cigarette)\n                         How's that?\n\n                                     STEVE\n                         Kind of sore.\n\n                                     CLAY\n                         You'll live.\n\n                                     STEVE\n                              (shyly)\n                         Guess maybe I'm old enough to hold \n                         my own in a fight, huh?\n\n                                     CLAY\n                         Yeah -- but don't make a habit of \n                         it.\n\n                                     STEVE\n                         So -- maybe I'm old enough to tell \n                         you how to run your life?\n\n                                     CLAY\n                              (stares down at him, \n                              then)\n                         I guess so -- but don't make a habit \n                         of it.\n\n                                     STEVE\n                         Well, then, I know it takes three -- \n                         four weeks for you to come round to \n                         admit when you're wrong... But by \n                         that time she's liable to be in \n                         China...\n\n               Clay looks at him for a moment, not angry, but not admitting \n               he's wrong yet.\n\n                                                               DISSOLVE OUT\n\n               EXT. SONORA - NIGHT (STOCK)\n\n               EXT. SONORA STREET - NIGHT\n\n               FULL SHOT - featuring hotel and doctor's office. The sheriff's \n               posse, the bodies of Lednov, McCall and Wheeler slung across \n               the backs of horses, and Clay's remuda, trot down the street. \n               People come out of the hotel to watch the cavalcade pass. \n               Clay and Steve are not with the posse. Clay's horse is \n               tethered in front of the doctor's office which is next door \n               to the hotel.\n\n               EXT. DOCTOR'S OFFICE\n\n               MED. SHOT - ANGLED THROUGH window. Clay, back to camera, is \n               holding a kerosine lamp. The doctor, a lanky, middle-aged \n               man, is working over Steve, who is stretched out on a table.\n\n               INT. DOCTOR'S OFFICE\n\n               MED. SHOT. Shelves filled with bottles line the room, for \n               the doctor is also the druggist. There is a glass cabinet in \n               which are the doctor's instruments. The room is cluttered. \n               The lamp, held by Clay, throws a circle of pale light down \n               on Steve. The doctor is working on Steve's shoulder and arm.\n\n               MED. CLOSE - UP ANGLE\n\n               featuring Clay. Clay suddenly averts his glance and winces \n               as the doctor probes the wound in Steve's arm. Steve groans. \n               The lamp wavers.\n\n                                     DOCTOR\n                              (sharply)\n                         Hold her steady. I'm not hurting \n                         him.\n\n                                     STEVE\n                         Maybe you're not, but I'll sure be \n                         glad when you stop pokin' me.\n\n               Footsteps are HEARD approaching. Clay tries to steady his \n               shaking hand. He is focusing his attention on a far wall. A \n               woman's hand comes in the scene and takes the lamp from him. \n               He reacts. CAMERA PULLS BACK to reveal Mary, who has moved \n               in beside him.\n\n               CLOSE SHOT\n\n               Steve. He smiles up at Mary.\n\n               MED. CLOSE SHOT\n\n               ANGLES PAST doctor.\n\n                                     MARY\n                         Is it very bad?\n\n                                     DOCTOR\n                              (grumbling)\n                         Course not. A scratch.\n\n               He suddenly realizes that a strange woman is in the room and \n               reacts.\n\n                                     DOCTOR\n                         What are you doin' here?\n\n                                     MARY\n                         Holding the lamp.\n\n                                     DOCTOR\n                         Then hold it a little lower.\n\n               Mary lowers the lamp.\n\n               CLOSE SHOT\n\n               Clay and Mary. UP ANGLE PAST lamp.\n\n                                     CLAY\n                         Thanks for taking over.\n\n                                     MARY\n                              (softly)\n                         Thanks for loading me on the stage. \n                         I know now why you did it.\n\n                                     CLAY\n                         Like I said, women get in the way \n                         sometimes.\n\n                                     STEVE'S VOICE\n                         He tried to get rid of me, too, Miss \n                         Wells.\n\n                                     DOCTOR\n                         Keep still, will you.\n\n               He straightens into the shot. CAMERA PULLS BACK TO MED. SHOT. \n               Steve is now bandaged.\n\n                                     DOCTOR\n                         Put him over there on the cot. \n                         Goodnight... He'll be all right.\n\n               As Clay lifts Steve to the cot the doctor exits. Mary watches \n               Clay cover Steve. Then she goes to the door leading to the \n               street, stops with her hand on the knob.\n\n                                     MARY\n                         Goodnight.\n\n                                     STEVE\n                         Goodnight, Miss Wells.\n\n                                     MARY\n                              (looking back)\n                         If you need me, I'll be --\n\n               Clay straightens and turns.\n\n                                     CLAY\n                         Where you going?\n\n                                     MARY\n                         To the other side of the street.\n\n               She opens the door and starts out.\n\n               EXT. PORCH - DOCTOR'S OFFICE\n\n               MED. SHOT. Mary starts to close the door behind her. Clay \n               forces it open. Clay comes out. Mary starts toward the steps.\n\n                                     CLAY\n                         Mary.\n\n               Mary stops at the edge of the porch. Clay comes up beside \n               her.\n\n               CLOSE SHOT\n\n               Mary waits, looking up at him.\n\n                                     CLAY\n                         That job you were talkin' about, did \n                         you get it yet?\n\n                                     MARY\n                         Why?\n\n                                     CLAY\n                              (haltingly)\n                         Because... well, you said you wanted \n                         a man to think enough of you to walk \n                         in the place you were working and \n                         take you out of there... tonight I \n                         was sort of tied up with Steve... \n                         but tomorrow I figured on doing just \n                         that.\n\n                                     MARY\n                              (softly)\n                         I haven't got the job yet.\n\n               They look at each other.\n\n                                     MARY\n                         But if you want to wait until tomorrow --\n\n               For answer, Clay takes her in his arms.\n\n               INT. DOCTOR'S OFFICE\n\n               ANGLED PAST Steve on cot. In the b.g. through the open \n               doorway, Clay and Mary kiss. Steve watches a moment, then \n               turns his head toward camera. He smiles and closes his eyes.\n\n               EXT. PORCH\n\n               TWO SHOT - Mary and Clay. They break from the kiss. Clay \n               looks down at Mary.\n\n                                     CLAY\n                              (softly)\n                         Is there any place in town a man \n                         could buy some gingham?\n\n                                                                   FADE OUT\n\n\n\n                                         THE END\n\n\n\n\n\n\nRoughshod\nWriters :   Hugo Butler  Geoffrey Homes  Peter Viertel\nGenres :   Western\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:34:23.732026"}