{"title": "Ruins, The", "film_link": "/Movie Scripts/Ruins, The Script.html", "script_link": "/scripts/Ruins,-The.html", "info_raw": "\n\nRuins, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (5.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Scott Smith\nGenres  Horror  Thriller\nMovie Release Date : April 2008\n\nRead \"Ruins, The\" Script\n\n\n", "script": "\n\n\n \n                                    THE RUINS\n\n          \n                                    Written by\n\n                                   Scott Smith\n\n          \n\n          \n\n          \n\n          \n\n          FADE IN ON:\n\n          EXT. CANCUN HOTEL - SWIMMING POOL - DAY\n\n          The hotel is six stories high, a wall of glass and stucco.\n          Beach chairs are arrayed around the pool's edge; sunbathers\n          lie sprawled across them. A short boardwalk leads toward the\n          Gulf of Mexico: the white sand, the blue water.\n          Four young Americans are encamped near the pool's edge;\n          they're all in their early twenties. AMY lies face down on a\n          chaise, eyes shut, a cooler beside her. She's petite, with\n          short blond hair, her skin pinkly sunburned.\n          ERIC sits in the chair beside her, studying the Cliff Notes\n          for The Canterbury Tales. He's leanly muscular, with dark\n          curly hair. Other Cliff Notes lie scattered beneath his\n          chair: Antigone, A Separate Peace, Hea rt of Darkness, 1984.\n\n          JEFF and STACY sit on the far side of the cooler; they're\n          playing gin. Stacy, too, is petite, with short hair, though\n          hers,. is dark. She's wearing a pale blue bikini, and has a\n          beer bottle in her hand. She looks a little bored.\n          Jeff is tall, scrawny. Like Eric, he has a pair of swim\n          trunks on, and is deeply tanned. He's very focused, frowning\n          down at his cards.\n\n          STACY\n          We should play War. It's more fun.\n          Jeff takes a card from his hand, lays it down on the table.\n\n          JEFF\n          That's not even a game.\n\n          STACY\n          Sure it is. I'll teach you.\n          She starts-to fold her hand,'but Jeff shakes his head.\n\n          JEFF\n          I know how to play. I mean it's\n          just chance--there's no skill\n          involved.\n\n          Stacy frowns down at her hand, silenced. She picks a card\n          from the deck, immediately discards it. Jeff snatches it up,\n          lays down one of his own. Stacy stares at it in dismay.\n\n          STACY\n          But I keep losing.\n\n          \n\n          \n\n          \n\n          \n\n          2.\n\n          JEFF\n          'Cause you're not concentrating.\n\n          STACY\n          I wouldn't have to concentrate if\n          we played War.\n\n          JEFF\n          Exactly. So where's the fun?\n\n          STACY\n          I'd win sometimes. It's not fun if\n          we both can't win.\n\n          JEFF\n          But it's not winning if it's just\n          chance.\n\n          STACY\n          Of course it is. If we flipped a\n          coin, and I called heads, and it--\n\n          ERIC\n          Fuck..;this.. shit.\n\n          Eric throws the Canterbury Tales to the ground. Then he\n          rises, steps to the cooler, pulls out a beer, carries it back\n          to his chair. Stacy watches as he takes a long swallow.\n\n          STACY\n          Maybe you should just be honest,\n          sweetie.\n\n          Eric doesn't even glance at her. He sips his beer again.\n\n          STACY (cont'd)\n          You could say: look, I don't know\n          anything about these either, so now\n          we're gonna read them together and\n          sort of teach each other as we go.\n          (turning to Jeff)\n          Wouldn't you have loved that? To\n          have a teacher who--\n\n          Amy speaks without opening her eyes, cutting Stacy off:\n\n          AMY\n          Why would they hire you if you\n          haven't read the books?\n\n          ERIC\n          I said I had.\n\n          \n\n          \n\n          \n\n          \n\n          3.\n\n          JEFF\n          So maybe you should..\n\n          ERIC\n          (appalled by the idea)\n          The Canterbury Tales? You ever\n          look at that shit?\n\n          JEFF\n          I've read it.\n\n          ERIC\n          Fuck off. It's not even English.\n          Jeff watches Stacy take another card; she examines it, sets\n          it on the discard pile. Then, RECITING:\n\n          JEFF\n          This world nys but a thurghfare ful\n          of wo, and we been pilgrymes,\n          passing to and fro. Deeth is an\n          ende of every worldly soore.\n\n          Eric and Stacy stare at Jeff in astonishment. Amy doesn't\n          react. Jeff glances toward her.\n\n          JEFF (cont'd)\n          Sunscreen, Amy.\n\n          AMY\n          I'm fine. I've got a base.\n\n          JEFF\n          You're burning. I can see it.\n          She finally opens her eyes, lifts her head, peers at her\n          shoulders. She presses at the pink skin.\n\n          ANY\n          I'm just flushed. It's too hot.\n          Stacy leans forward, picks a second card off the deck. Jeff\n          is focused on Amy; he doesn't notice.\n\n          JEFF\n          You're hot because you're burning.\n\n          AMY\n          It's only been--\n          Stacy interrupts, speaking in a slightly SINGSONG fashion:\n\n          \n\n          \n\n          \n\n          \n\n          4.\n\n          STACY\n          So there was this king, who lived\n          in a castle.\n          Amy turns, gives her a pained look.\n\n          AMY\n          Please don't.\n\n          ERIC\n          But what he really wanted was a\n          beach house.\n\n          AMY\n          Stop it. Both of you. Right now.\n          They ignore her, ping-ponging quickly back and forth:\n\n          STACY\n          So he decided to move.\n\n          ERIC\n          But the Queen didn't want to.\n\n          STACY\n          So he left by himself.\n\n          ERIC\n          But he got lonely.\n          Amy covers her ears with her hands, blocking out their\n          voices, but then inmiediately reaches to feel for her\n          earrings: one of them is missing.\n\n          AMY\n          Shit.\n\n          STACY\n          So he bought a dog.\n\n          ERIC\n          But it had fleas.\n\n          AMY\n          I lost my earring.\n\n          STACY\n          So he gave it a bath.\n\n          ERIC\n          But the dog caught. cold.\n          Amy sits up, glancing about. Stacy and Eric keep going:\n\n          \n\n          \n\n          \n\n          \n\n          5.\n\n          STACY\n          So he gave it some medicine.\n\n          ERIC\n          But it was the wrong kind.\n\n          STACY\n          So the dog died.\n          Amy rises, steps toward the pool. Jeff lays down his cards,\n          joins her beside the water. They both peer into it.\n\n          EXT. CANCUN HOTEL - BOARDWALK - DAY\n\n          A young man is approaching down the boardwalk from the beach,\n          carrying fins, a mask, a snorkel. He's in his early\n          twenties: blond, crew-cut, very tall. His name is MATHIAS.\n          As he nears the pool, he stops, staring.\n\n          MATHIAS'S POV - THE POOL\n          Eric and Stacy have risen to join Jeff and Amy; they're all\n          peering into the water. Amy holds her remaining earring out\n          to Eric and Stacy, showing them what it looks like.\n\n          BACK TO SCENE - MATHIAS\n          He stands there, hesitating. Then he starts forward.\n\n          MATHIAS'S POV - THROUGH THE MASK - UNDERWATER - DAY\n          We glide just above the pool's pale blue bottom. A silver\n          earring comes into view. Mathias's hand reaches for it.\n\n          EXT. CANCUN HOTEL - POOL - DAY\n\n          The two couples have spread out around the pool's edge,\n          searching for the earring. Mathias surfaces in front of Amy.\n          He holds out his hand, with the earring-in it; she stares,\n          startled, then crouches to take it.\n\n          AMY\n          Thank you so much.\n          .Mathias nods. He starts to turn, as if to swim off, but Jeff\n          stops him:\n\n          \n\n          \n\n          \n\n          \n\n          6.\n\n          JEFF\n          Wait. . .want a beer?\n          He waves toward their chairs, the cooler beside them.\n\n          EXT. CANCUN HOTEL - POOL - LATER\n\n          Mathias and the two couples sit together, with their beers.\n          Amy's skin has turned deep red; Stacy is behind her, applying\n          lotion to her shoulders. Eric is talking to Mathias:\n\n          ERIC\n          We went sailing yesterday. Out\n          toward Cozumel? And there were\n          these seven foot fish, these huge--\n\n          JEFF\n          Nurse sharks.\n\n          ERIC\n          (he nods)\n          Like thirty of them. A whole, you\n          know, flock.\n\n          JEFF\n          School.\n\n          ERIC\n          The water was, I don't know, ten\n          feet deep? And they were lying on\n          the bottom, just waiting for\n          somebody to come swimming by--\n\n          JEFF\n          They're not dangerous.\n          Eric turns, stares at Jeff.\n\n          ERIC\n          You said they're sharks.\n\n          JEFF\n          But they're not dangerous. They\n          eat lobsters. Sea urchins. That\n          sort of thing.\n          Eric considers this, frowning. Then he takes a sip of beer.\n          He shrugs, turns back toward Mathias.\n\n          ERIC\n          I wouldn't be snorkeling on my own.'\n          That's all I'm saying.\n\n          \n\n          \n\n          \n\n          \n\n          7.\n          When Mathias speaks, it's with a SLIGHT GERMAN ACCENT:\n\n          MATHIAS\n          I wasn't on my own. I was with my\n          brother.\n          Jeff glances around the pool.\n\n          JEFF\n          He's here?\n          Mathias shakes his head.\n\n          MATHIAS\n          He met a girl. They went away.\n\n          JEFF\n          To?\n\n          MATHIAS\n          It's a complicated story.\n          They watch him, waiting for more, but nothing comes. Finally:\n\n          ERIC\n          You should hang with us, then. If\n          you're on your own.\n          (he glances at the others)\n          Right?\n          Everyone nods, smiling. Eric reaches into the cooler, pulls\n          out another beer, holds it toward Mathias.\n\n          EXT. CANCUN BEACH - NIGHT\n\n          There's a DJ, a dozen beer kegs. A few young men and women\n          are dancing beside a bonfire, but most of the crowd is\n          scattered in small groups across the sand, TALKING, drinking,\n          the firelight flickering off their faces.\n          Stacy, Amy, Eric, Jeff and Mathias are sitting together; they\n          all have cups of beer. Stacy is between Eric's legs, leaning\n          against his chest. Amy, Jeff and Mathias sit cross-legged.\n          Everyone but Jeff and Mathias is a little drunk, and you can\n          hear it in their voices. Amy drains her cup, stands up, very\n          unsteadily. She holds out her hand to Jeff.\n\n          AMY\n          Dance.\n          Eric smiles, as if the idea of Jeff dancing were absurd.\n\n          \n\n          \n\n          \n\n          \n\n          8.\n\n          ERIC\n          Jeff doesn't dance, Amy--he has no\n          rhythm. Of all his many gifts,\n          rhythm is not one.\n\n          AMY\n          That's not true. He played the\n          trombone in high school. He won a\n          prize.\n          Eric seems startled by this, amused.\n\n          ERIC\n          Seriously?\n          Amy nods. She drains her beer, tosses the cup aside.\n\n          AMY\n          Jeff's won prizes for everything.\n          His Mom has a whole room built just\n          for them. Trophies and ribbons and\n          plaques. He's a very accomplished\n          young man.\n          (she holds out her hand-to\n\n          ERIC)\n          You?\n\n          ERIC\n          (he shakes his head)\n          I don't dance on sand.\n          Stacy makes a SNORTING sound.\n\n          STACY\n          Or grass. Or cement. Or carpet.\n\n          ERIC\n          I dance on teak.\n\n          AMY\n          Teak?\n\n          ERIC\n          It's a type of wood. Very rare.\n          Find me a teak floor and I'll be a\n          dancing fool.\n          Amy shifts toward Mathias, holds out her hand. He stares at\n          it, then glances at Jeff. Before he can speak, Stacy pushes\n          herself to her feet; she's almost as wobbly as Amy.\n\n          STACY\n          I'll dance.\n\n          \n\n          \n\n          \n\n          \n\n          9.\n          They lurch off across the sand toward the bonfire. The boys\n          watch them go. A beat, then Jeff glances at his watch.\n\n          JEFF\n          I'm gonna head back.\n          Eric gives him a look of disappointment,\n\n          ERIC\n          You're kidding.\n          Jeff seems STARTLED by this:\n\n          JEFF\n          What?\n\n          ERIC\n          How long is med school? Four\n          years?\n          Jeff nods.\n          ERIC (cont'd)\n          And then you got, whaddya call it,\n          residency?\n          Another nod. Eric turns toward Mathias.\n          ERIC (cont'd)\n          He's gonna be grinding away all\n          that time. Sleepless. Fucking\n          miserable. And know what? He's\n          gonna look back on this night, us\n          right here, and he's gonna say to\n          himself, shit, I wish I'd--\n\n          JEFF\n          Gone to bed earlier.\n          Eric stares at him; this wasn't the direction he was heading.\n          JEFF (cont'd)\n          If I'm gonna be so short on sleep,\n          I should get as.much as I can now,\n          don't you think?\n          He stands up, brushes the sand from his shorts. Eric shrugs,\n          lifts his cup toward him.\n\n          ERIC\n          All work and no play--\n\n          \n\n          \n\n          \n\n          \n\n          10.\n\n          JEFF\n          Makes a man healthy, wealthy, and\n          wise.\n          With that, Jeff nods good night to them, then starts off\n          toward the hotel. Eric and Mathias turn back toward the\n          bonfire. They sit in silence, watching the girls dance.\n          After a moment, Amy staggers away from the other dancers,\n          toward a group of young men, drinking together in the\n          shadows. She reaches down, pulls one of them to his feet,\n          starts to drag him back toward the bonfire.\n          The young man is tall, with long blond hair. He LAUGHS,\n          tries to free himself, but Amy is insistent; she keeps\n          pulling at him, and finally he surrenders. They begin to\n          dance. Stacy is dancing on her own, eyes shut, oblivious.\n          Mathias glances toward Eric. Eric shrugs.\n\n          ERIC\n          Amy drifts sometimes, when she\n          drinks.\n\n          MATHIAS\n          Drifts?\n\n          ERIC\n          Like a boat--she bumps into other\n          boats.\n          They continue to watch. Amy and her partner's dancing is\n          becoming steadily more intimate, the gap between their bodies\n          narrowing, then disappearing altogether. Finally, Eric\n          pushes himself to his feet.'\n          ERIC (cont'd)\n          Come on. Let's save everyone some\n          grief.\n          He starts. forward, followed by Mathias. They join Stacy and\n          Amy, and Eric subtly interrupts Amy's pas de deux. The blond-\n          haired young man disengages, drifts back toward his friends.\n\n          EXT. CANCUN BEACH - DAWN\n\n          It's quiet, the sun just breaking the horizon; the beach is\n          nearly empty. A handful of hotel employees are tidying up\n          after the bonfire: carrying off the empty kegs, raking clean\n          the rubbish-strewn sand. Gulls hover overhead, CAWING.\n\n          \n\n          \n\n          \n\n          \n\n          11.\n          Jeff appears, running along the beach, his T-shirt soaked\n          with sweat. He stops as he nears us, stands for a moment\n          just above the line of surf, catching his breath, watching\n          the sun rise. Then he turns, starts toward the hotel.\n\n          EXT. CANCUN HOTEL - TERRACE - DAWN\n\n          A breakfast buffet: trays of pancakes, eggs, fresh fruit.\n          There are a dozen tables beneath brightly colored umbrellas.\n          Mathias is the only diner at this hour; he's dressed in jeans\n          and a T-shirt. He studies a piece of paper as he eats.\n\n          JEFF (O.S.)\n          You're up early.\n          Mathias lifts his head: Jeff is standing there in his sweaty\n          shirt, smiling down at him.\n\n          MATHIAS\n          I have to catch a bus.\n\n          JEFF\n          To?\n          Mathias slides the sheet of paper toward him. Jeff bends to\n          look. There's a paragraph in German scrawled above a hand-\n          drawn map, with four place names: Cancun, Valladolid,\n          Tizimin, Coba. A large X has been drawn to the west of Coba.\n\n          MATHIAS\n          The girl my brother met was on her\n          way to this place, to work.\n          (he waves at the map)\n          It's a dig--an archaeological dig.\n          And he went with her. He left the\n          map, saying I could come, too, if I\n          got bored on my own.\n          A beat; he watches Jeff examine the map. Then:\n          MATHIAS (cont'd)\n          Our flight leaves the day after\n          tomorrow. I can wait and hope he\n          returns in time.. Or I can go get\n          him. It's a question of trusting\n          him to do the right thing.\n\n          JEFF\n          And you don't?\n\n          \n\n          \n\n          \n\n          \n\n          12.\n\n          MATHIAS\n          Henrich doesn't think things\n          through. He runs at them. He's...\n          (he searches, shakes his\n\n          HEAD)\n          There's a word in English, but I\n          can't remember it.\n\n          JEFF\n          impetuous?\n\n          MATHIAS\n          (he nods)\n          So I have to be--\n\n          JEFF\n          Responsible.\n\n          MATHIAS\n          All our lives, the same story.\n          Jeff.slides the map back toward him.\n\n          JEFF\n          It's what? One of those pyramids?\n\n          MATHIAS\n          (he shakes his head)\n          An old mining camp.\n\n          JEFF\n          De oro? 0 plata?\n          Mathias just stares at him.\n          JEFF (cont'd)\n          You don't speak Spanish?\n          Mathias shakes his head.\n          JEFF (cont'd)\n          So how will you find this place?\n\n          MATHIAS\n           (he smiles, shrugs)\n          Follow the m ap.\n          Jeff frowns down at the map for a long beat. It seems as if\n          he's going to question the feasibility of this, but. then he\n          disengages instead, wiping at the sweat on his face.\n\n          JEFF\n          Well, good luck.\n\n          \n\n          \n\n          \n\n          \n\n          13.\n          Mathias nods his thanks, and Jeff turns, starts away from the\n          table. WE MOVE with him, across the terrace, into the:\n\n          INT. CANCUN HOTEL - RESTAURANT\n\n          It's completely empty at this hour, and eerily silent.\n          Chairs are stacked on the tables. As Jeff enters, a waiter\n          moves past ham, carrying a pitcher of orange juice. Jeff\n          stops, turns to watch through the window beside the door.\n\n          JEFF'S POV - THROUGH THE WINDOW\n          The waiter refills Mathias's glass. Mathias smiles, nods.\n\n          BACK TO SCENE\n          Jeff hesitates, wavering. Then he pushes open the door\n          again, steps outside. We watch--\n\n          THROUGH THE WINDOW\n          --as he approaches Mathias. There's the sound of someone\n          RETCHING, COUGHING. This carries over into:\n\n          INT. CANCUN HOTEL - JEFF AND AMY'S BATHROOM - DAY\n\n          A rack with towels on it, a sink, a tub. Amy is crouched\n          over the toilet, in underwear and a T-shirt, VOMITING. Her\n          skin is bright red. Jeff is standing in the tub, freshly\n          showered, drying himself, watching. her. His running clothes\n          hang from a hook beside the door.\n\n          JEFF\n          You okay?\n          Amy doesn't answer. She COUGHS, spits.\n          JEFF (cont'd)\n          You don't have to come, you know.\n\n          AMY\n          I'm fine.\n\n          JEFF\n          You don't look fine.\n\n          AMY\n          Thank you. That's very helpful.\n\n          \n\n          \n\n          \n\n          \n\n          14.\n          She pushes herself to her feet, flushes the toilet, steps to\n          the sink, squeezes some toothpaste onto a toothbrush.\n\n          JEFF\n          We'll be back by nightfall. You\n          can just--\n          Amy is raising the brush to her mouth, but she stops, gives\n          Jeff a look in the mirror.\n\n          AMY\n          You don't want me to come?\n\n          JEFF\n          That's not what I'm saying.\n\n          AMY\n          So what're you saying?\n\n          JEFF\n          You're hungover, under slept,\n\n          SUNBURNED--\n\n          AMY\n          I'm not sunburned.\n          Jeff stares at her, the deep red of her face. Then he\n          shrugs, steps out of the tub, the towel around his waist.\n\n          JEFF\n          .All right. My mistake.\n          Amy bends over the sink, starts to brush her teeth.\n\n          INT. CANCUN HOTEL - JEFF AND AMY'S BEDROOM - DAY\n\n          A king-sized bed, a bureau, two night tables, a mini-fridge.\n          Jeff emerges from-the bathroom, steps toward the bureau,\n          starts to dress: boxers, jeans, T-shirt.\n          A beat, then Amy shuffles out of the bathroom. She sits on\n          the edge of the bed, starts to pull on a pair of shorts.\n\n          JEFF\n          Pants.\n          Amy stops, the shorts around her ankles.\n\n          AMY\n          I'll get too sweaty.\n\n          \n\n          \n\n          \n\n          \n\n          15.\n          Jeff pulls a pair of khakis from the bureau, tosses them onto\n          the bed beside her.\n\n          JEFF\n          There's gonna be mosquitoes.\n          He picks up a knapsack, steps to the mini-fridge, opens its\n          door. Amy stares down at the khakis for a beat, then drops\n          back onto the bed. She lies there, looking up at the\n          ceiling, her shorts still caught around her ankles.\n\n          AMY\n          We don't even know this guy.\n          Jeff slides two bottles of iced tea into the knapsack.\n          There's a plastic shopping bag beside the fridge, and he\n          starts to dig through it.\n\n          JEFF\n          And?\n\n          AMY\n          I just don't see why we have to go\n          with him.\n\n          JEFF\n          If you and I were traveling\n          together, somewhere you didn't\n          speak the language, and I'd\n          vanished somehow, wouldn't you want\n          someone to help find me?\n\n          AMY\n          Why would you vanish?\n          Jeff turns, looks at her: this isn't the point.\n\n          JEFF\n          Aren't you getting bored?\n          Honestly. The beach, the pool, the\n          beach, the pool. This'll be fun.\n          An adventure.\n          Jeff pulls two protein bars from the bag, a box of raisins, a\n          plastic bag full of grapes; he drops them into the knapsack.\n          JEFF (cont'd)\n          You said you wanted to go;hiking,\n          didn't you? See the ruins.\n          Amy is silent, unmoving, clearly not swayed.\n\n          \n\n          \n\n          \n\n          \n\n          16.\n          JEFF (cont'd)\n          Stay here, then. Seriously.\n          There's no--\n\n          AMY\n          Why do you keep saying that?\n\n          JEFF\n\n          BECAUSE--\n\n          AMY\n          It's like you'd rather I didn't--\n          A KNOCKING at the door, and she falls silent. Jeff rises,\n          zipping shut the knapsack. He steps to the door, opens it.\n          Stacy and Eric are in the hall.\n\n          ERIC\n          Ready?\n          The both answer at the same time:\n\n          JEFF AMY\n          Amy's having second thoughts. Jeff doesn't want me to go.\n          Stacy and Eric are silent; neither wants to get involved in\n          this. A beat, then Jeff SIGHS, glances at his watch.\n\n          JEFF\n          Now or never, Any. .We're gonna\n          miss the bus.\n          Amy gives a loud GROAN, sits up, reaches for her khakis.\n\n          INT. TOUR BUS - DAY\n\n          Only half the seats are occupied: tourists with their packs\n          and cameras-and hats. Little TVs hang from the ceiling.\n          We MOVE slowly down the aisle, passing Jeff and Amy first.\n          Amy is sound asleep, a camera hanging from her neck, a Panama\n          hat in her lap. Jeff is beside her, bent low over a tour\n          book, comparing its much more detailed map with the one\n          Mathias's brother left behind.\n          Next come Eric and Stacy, hunched together in their seats,\n          watching a Mexican soap opera on the little TV above them.\n          Stacy mimics the actors' exaggerated gestures, GIGGLING.\n          Eric has the Cliff Notes for Hamlet in his lap, unopened.\n          Finally, there's Mathias. The seat beside him is empty.\n          He's staring out the window, his expression perfectly blank.\n\n          \n\n          \n\n          \n\n          \n\n          17.\n\n          EXT. COBA - DAY\n\n          The town is very small: a dirt road lined with one- and two-\n          story buildings, some with thatched roofs. There's a gravel\n          turnaround, with a bus idling in it. Its door CREAKS open.\n          A dozen tourists emerge from the bus, blinking in the\n          sunlight. Jeff, Amy, Stacy, Eric, and Mathias are among\n          them. The boys have the knapsacks; the girls are wearing\n          matching hats. Amy rubs at her face, stretching, waking up.-\n          There's a souvenir stand at the town's entrance, with\n          brightly colored blankets hanging from its walls. The\n          tourists start toward it, leaving Jeff and the others beside.\n          the idling bus. They peer about, getting their bearings.\n\n          ERIC\n          Now what?\n          Mathias has his brother's note. He holds it out, pointing,\n          and they gather around him to look.\n\n          MATHIAS\n          We take a cab. To here.\n          WE SEE the map: there's a line drawn from Cancun to Coba,\n          where another, shorter line moves westward. Mathias's finger\n          moves along this shorter line, toward the X on the map.\n\n          ERIC\n          How far?\n\n          MATHIAS\n          Eighteen kilometers.\n\n          STACY\n          How many miles is that?\n          They all glance at Jeff. He shrugs.\n\n          JEFF\n          Eleven. A little more.\n\n          MATHIAS\n          Then there'll be a path. Which we\n          hike--four kilometers.\n          The others look to Jeff again. He slings his pack.\n\n          JEFF\n          Two and a half miles.\n\n          \n\n          \n\n          \n\n          \n\n          18.\n          The tourists are vanishing into the town. The bus's door\n          SQUEAKS shut.\n\n          ANY\n          I don't see any cabs.\n          The bus eases into motion, CRUNCHING across the gravel,\n          pulling out onto the road. Behind it, a yellow pickup truck\n          is revealed. \"TAXI\" is hand-painted in black on its side.\n          They start toward the truck. Its DRIVER is Mayan: short and\n          heavy-set, with thick glasses. His eyes are shut; he's\n          dozing behind the wheel. The truck's engine.is running, the\n          windows shut tight against the heat.\n          Jeff TAPS the window, and there's a burst of movement from\n          the truck's rear, as a dog springs up, BARKING and GROWLING.\n          They all leap back, the girls SHRIEKING.\n          The dog is a mutt--small, but muscular. He's attached to a\n          cinder block by a short chain, which he throws himself\n          against, slobbering, snapping at the air.\n          They all stare at the dog; the girls LAUGH nervously,\n          clutching each other. The driver has roused himself; he\n          leans forward, rolls down his window, stares out at them.\n\n          JEFF\n          Hola.\n          The man gives him a somber nod; the dog keeps BARKING. Jeff\n          takes the map from Mathias, then steps warily forward.\n          JEFF (cont'd)\n          Habla ingles usted?\n          The man half-nods, half-shrugs.\n          JEFF (cont'd)\n          How much to drive us to here?\n          He offers the map to the driver, who reaches to take it. The\n          man frowns at it. Then, in HEAVILY ACCENTED ENGLISH:\n\n          DRIVER\n          Why you go this place?\n          Jeff struggles for a simple way to explain their mission. in\n          the back of the truck, the dog continues its frantic BARRING.\n\n          JEFF\n          There are these ruins. This old\n          mining camp?\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n\n          19.\n          JEFF (cont'd)\n          (he points toward Mathias)\n          And his brother---\n\n          DRIVER\n          Fifteen dollar, I take you ruins.\n\n          JEFF\n          To here?\n          Jeff points at the map. The driver shakes his head.\n\n          DRIVER\n          This place no good.\n          He holds the map back out toward Jeff. Jeff takes it, gives\n          the man a puzzled look.\n\n          JEFF\n          No good?\n\n          DRIVER\n          No good you go. Fifteen dollar I\n          take you good place. You like, I\n          promise.\n          Jeff glances toward the others, as if for help. They all\n          just stand there, watching. The dog won't stop BARRING.\n          DRIVER (cont'd)\n          I take you pyramid. Huy grande.\n          Everyone happy.\n          He smiles at Jeff; his teeth are large and thick-looking,. and\n          black along the gums. Jeff pulls out his wallet. He removes\n          a ten and a five, then points at the map.\n\n          JEFF\n          How about we pay you fifteen\n          dollars to go here?\n          He holds the money out. The man doesn't even look at it.\n\n          DRIVER\n          I tell you no good. Still you go?\n          His smile has disappeared; he seems angry suddenly, as if\n          Jeff has somehow insulted him. Jeff hesitates, glancing\n          toward the others again. Then, in a CONCILIATORY TONE:\n\n          JEFF\n          We're looking for his brother.\n          (he points toward Mathias)\n          Su hermano?\n\n          \n\n          \n\n          \n\n          \n\n          20.\n          The driver wrenches the door open, making Jeff and the others\n          flinch. He climbs out, still with that angry expression on\n          his face, then leans into the back of the truck, grabs the\n          dog's chain, unhooks it from the cinder block.\n          He lifts the dog from the truck by the chain. Even dangling\n          by its neck, the mutt continues to SNARL and snap at Jeff and\n          the others. They back away, and the man tosses the dog into\n          the truck's cab, pushing the door shut. The dog throws its\n          body against the window, slobbering and BARKING.\n          The man turns toward Jeff, wiping his hands on his pants.\n          Jeff tries again:\n          JEFF (cont'd)\n          I'm sure your ruins are better than\n          these. It's just that we--\n          The driver cuts him off, holding out his hand, with that same\n          air of enraged disgust.\n\n          DRIVER\n          El dinero.\n          Jeff gives him the money. Then the driver SLAPS the side of\n          the truck, gestures for them to climb into the back.\n\n          EXT. YUCATAN ROAD - FROM HIGH ABOVE - DAY\n\n          Below us, the yellow truck travels along a single-lane road.\n          Jeff and the others are in its rear. There are fields on\n          either side of the road, bordered by thick jungle.\n          The truck reaches a fork in the road, bears left, angling\n          toward the wall of jungle, into which it vanishes, the\n          overhanging foliage blocking it from sight.\n\n          EXT. YUCATAN ROAD - IN THE JUNGLE - DAY\n\n          The road is dirt, heavily rutted. There's a small clearing\n          beside it, with a path opening off it. The trees grow over\n          the path, forming a shady tunnel. WE HEAR birds calling, a\n          steady throb of insect life, but otherwise all is silent.\n          A beat, then there's the sound of the TRUCK approaching,\n          along with the dog's BARKING and GROWLING. The pickup\n          appears, moving slowly, bouncing and swaying across the ruts.\n          The truck pulls into the little clearing, stops. Jeff and\n          the others clamber out over its tailgate.\n\n          \n\n          \n\n          \n\n          \n\n          21.\n          The dog is still lunging at them from behind the truck's rear\n          window. Jeff gives the driver a wave.\n\n          JEFF\n          Gracias, senor!\n          The driver doesn't even look at him; he just pulls out onto\n          the road, heading back in the direction from which they came.\n          There are mosquitoes; Stacy starts to slap at herself. Jeff\n          unslings his pack, pulls out a can of insect repellent.\n          JEFF (cont'd)\n          Here.\n          He begins to spray her, then Eric. Amy is peering off after\n          the truck. They can still hear the dog's BARKING, but very\n          faintly now. Jeff finishes with Eric, starts in on Mathias.\n\n          AMY\n          How do we get back?\n          She points back down the road, toward the vanished truck.\n          Jeff pauses in his spraying, considers for a moment. Then:\n\n          JEFF\n          The guidebook said you can always\n          flag down a passing bus. So I--\n\n          AMY\n          There aren't going to be any buses\n          on that road.\n          Jeff nods; this seems obvious. He resumes spraying Mathias.\n          Eric and Stacy stand there, watching.\n          AMY (cont'd)\n          A bus couldn't even fit.\n\n          JEFF\n          It also said you can hitch--\n\n          AMY\n          See any cars pass, Jeff?\n          Jeff doesn't answer. He steps toward her, starts to spray\n          her, too. She holds out her arms.\n          AMY (cont'd)\n          The whole time we were driving, you\n          see even one?\n\n          STACY\n          Eric has his phone. Can't we just\n          call someone?\n\n          \n\n          \n\n          \n\n          \n\n          22.\n\n          AMY\n          He's not gonna get a signal. Not\n          way out here.\n          They all turn to watch as Eric reaches into. his pack, pulls\n          out his cell phone, flips it open. He stares at it for a\n          beat, then shakes his head, snaps it shut. Jeff finishes\n          spraying Amy, starts in on himself.\n\n          JEFF\n          They must-have a way to get\n          supplies in.\n\n          AMY\n          Who?\n\n          JEFF\n          The archaeologists. They must have\n          a truck. Or access to a truck.\n          When we find Mathias's brother, we\n          can just ask them to take us all\n          back to Coba.\n          (turning to Mathias)\n          Right?\n          Mathias seems startled by the question.\n\n          MATHIAS\n          I guess ...I mean, I--\n          He shrugs; he has no idea. Amy is still focused on Jeff:\n\n          AMY\n          We're stranded, aren't we? That's,\n          like, a twenty mile walk we're\n          gonna have to do. Through the\n          jungle.\n\n          JEFF\n          Eleven.\n\n          AMY\n          What?\n          Jeff finishes with the insect repellent, crouches to slide\n          the can back into his pack.\n\n          JEFF\n          It's eleven miles.\n\n          AMY\n          There's no way that was eleven\n          miles.\n\n          \n\n          \n\n          \n\n          \n\n          23.\n          Jeff rises, slings his pack. He gives Amy a tired look.\n\n          JEFF\n          Let's just find this place, okay?\n          Then we can figure out how to get\n          back.\n          Amy is silent. Jeff turns to the others.\n          JEFF (cont'd)\n          Ready?\n          Mathias and Eric nod, and the boys start down the path. Amy\n          stands there, watching them go. Stacy steps toward her.'\n\n          STACY\n          Just go with it, honey. You'll\n          see--it'll all work out.\n          She hooks arms with her, pulls her into motion.\n\n          EXT. JUNGLE TRAIL - MOVING - DAY\n\n          They hike in single file: first Jeff, then Eric, Mathias,\n          Stacy, and Amy. The path is six feet wide, hard-packed dirt.\n          All around and above is the jungle: big-leafed plants, vines\n          and creepers, immense trees.\n          The path moves in snakelike curves; we can't see-very far in\n          either direction. They're all sweating, their shirts\n          clinging to their bodies. The bugs continue to harass them.\n\n          STACY\n          So-there was this girl who bought\n          a piano.\n          Amy gives a loud MOAN.\n\n          ERIC\n          But she didn't know how to play.\n\n          STACY\n          So she signed up for lessons.\n\n          ERIC\n          But she couldn't afford them.\n          Stacy reaches, taps Mathias's shoulder.\n\n          STACY\n          You can play, too. If you want.\n\n          \n\n          \n\n          \n\n          \n\n          24.\n          Mathias glances back at her.\n          STACY (cont'd)\n          It's easy. Someone says So, then\n          you say But. It's like catch, only\n          without a ball.\n          (to Eric)\n          So she got a job in a factory.\n\n          ERIC\n          But was fired for being late.\n          Amy takes off her hat, wipes the sweat from her face.\n\n          AMY\n          It's annoying.\n\n          STACY\n          So she became a prostitute.\n\n          AMY\n          It's tedious and boring. And once\n          they start, it's impossible to get\n          them to stop.\n\n          ERIC\n          But she fell in love with her first\n          client.\n          Amy puts her hat back on. She looks hot, sweaty, tired.\n\n          AMY\n          How much farther?\n          Mathias peers down at his brother's note. Stacy and Eric\n          continue with their game.\n\n          MATHIAS STACY\n          We cross a stream. Then So she asked him to marry\n          there'll be a path, branching her.\n          off to our left. If we see a\n          village, we've gone too far.\n          AMY (cont'd) ERIC\n          A village? But he was already married.\n\n          MATHIAS STACY\n          A Mayan village. So she begged him to get a\n           divorce.\n          AMY (cont'd) ERIC\n          Will they have air But he was in love with his\n          conditioning? wife.\n\n          \n\n          \n\n          \n\n          \n\n          25.\n          Mathias shrugs, returns the note to his pocket.\n\n          MATHIAS STACY\n          It just says there's a So she decided to kill her.\n          village.\n          AMY (cont'd)\n          I think we should go see it.\n\n          STACY\n          Me, too.\n\n          AMY\n          I think we should---\n          Jeff stops suddenly, pointing.\n\n          JEFF\n          The stream.\n          Thirty feet in front of them, the trail dips toward a small\n          stream, studded with boulders. It resumes on the far bank,\n          rising gradually uphill in a long straightaway. The stream\n          is slow moving, the water dark brown. Eric SNIFFS the air.\n\n          ERIC\n          Fucking smells.\n\n          JEFF\n          They must use it as a latrine.\n\n          ERIC\n          Who?\n\n          JEFF\n          The village. The Mayans.\n          They start toward it, gingerly, the girls covering their\n          noses. Jeff crosses the stream, hopping from boulder to\n          boulder, and the others follow. Stacy almost falls in; she\n          only catches her balance at the final instant, YELPING.\n          Jeff is already starting up the trail, searching for the\n          turnoff. There's no sign of it; the dense foliage extends\n          unbroken as far as the eye can see. He turns to Mathias.\n          JEFF (cont'd)\n          How far past the stream?.\n\n          MATHIAS\n          Right after, it says.\n\n          \n\n          \n\n          \n\n          \n\n          26.\n          They stand there in a loose group, staring at the trees.\n          Eric pulls a bottle of water from his pack, takes a swallow,\n          then passes it to Stacy. Amy lifts her arm, points.\n\n          AMY\n          Look.\n          Up the trail, sixty feet away, stand two small Mayan boys;\n          they seem to have materialized out of the air. They're ten\n          years old, shirtless, scrawny, dark-haired. one of them is\n          holding a bicycle by its handlebars; it doesn't have a seat.\n          AMY (cont'd)\n          Maybe they can guide us.\n          Stacy smiles toward the boys; she waves, CALLS OUT:\n\n          STACY\n\n          HOLAL\n          The boys just stand there, staring at them, silent, their\n          expressions wary, even frightened. One of them leans to\n          whisper something to the other, who nods.\n\n          ERIC\n          Why don't we--\n          He stops, noticing Mathias. The German is staring toward the\n          edge of the trail, where a large bush sits. one of its\n          fronds is very slowly dropping toward them, pulling itself\n          free of the soil.\n          Mathias steps forward, tugs at a second frond, which slips\n          easily from the dirt. He tosses it aside, reaches for\n          another frond: this, too, slips free. Someone has pushed\n          them into the earth, arranging them to look like a bush.\n          Mathias pulls a fourth frond free, then a fifth, and an\n          opening is revealed in the brush, a narrow path winding its\n          way off through the trees. They stand there a beat, staring\n           at it. Then there's a SQUEAKING SOUND, and they all turn.\n\n          AMY'S POV - UP THE TRAIL\n          one of the boys is hurriedly pedaling off, bent low over the\n          bicycle's handlebars. His companion remains behind, staring\n          toward us with a look of obvious anxiety.\n\n          BACK TO SCENE\n          Amy turns to Jeff; so do the others.\n\n          \n\n          \n\n          \n\n          \n\n          27.\n\n          AMY\n          Why was it covered?\n          Jeff lifts his hands: how should he know?\n\n          STACY\n          Maybe it's not the right path.\n          NO one speaks. They keep staring from the boy to the newly\n          revealed path, trying to make sense of it. WE can still HEAR\n          the squeaking of the bicycle, growing steadily fainter.\n\n          JEFF\n          It's on the map.\n\n          AMY\n          It's a hand-drawn map, Jeff.\n\n          STACY\n          And it was hidden. Why would it be\n          hidden?\n          Jeff steps forward, shields his eyes, tries to peer into the\n          dimness of the narrow path. Then he glances back toward the\n          little boy, who continues to stand there, watching them.\n\n          JEFF\n          Maybe the archaeologists don't want\n          people to find the mine.\n\n          AMY\n          Because?\n          Jeff has to think. Finally:\n\n          JEFF\n          Maybe they've dug up something\n          valuable. Emeralds or something.\n          Or silver. Whatever they were\n          mining in the first place. And\n          they don't want anyone to come rob\n          them. So they've asked the Mayans\n          to help keep people away.\n          He falls into silence, staring at the boy. No one appears\n          very convinced by his theory, not even Jeff. He shrugs.\n          JEFF (cont'd)\n          How much farther is it?\n          Mathias takes the map from his pocket again, glances at it.\n\n          \n\n          \n\n          \n\n          \n\n          28.\n\n          MATHIAS\n          Not far.\n\n          JEFF\n          Be silly to stop now, don't you\n          think?\n          No one answers; no one moves.\n\n          ANY\n          This just feels weird, Jeff.\n          Jeff SIGHS, fighting to suppress his impatience with her.\n\n          JEFF\n          So we what? Turn around? Walk all\n          the way back to Coba?\n          Silence. They all turn to stare back down the trail, then\n          toward the Mayan boy, who's still watching them. Stacy SLAPS\n          a mosquito, leaving a bloody smear on her bare arm. Jeff\n          lifts his hand, gestures at the path.leading into the trees.\n          JEFF (cont'd)\n          Come on. We're almost there.\n          The others glance at one another, waiting for someone to\n          argue; no one does. Finally, Mathias steps forward, slipping\n          through the narrow opening. Eric follows him, and then, with\n          just the slightest hesitation, so do Amy and Stacy.\n          Jeff throws one last glance toward the boy--who's still\n          standing there, sixty feet away, watching with his anxious\n          expression--and then he, too, vanishes into the trees.\n\n          EXT. NARROW PATH - MOVING - DAY\n\n          They make their way along the winding path, one after\n          another, all of them sweating, slapping at the mosquitoes.\n\n          ERIC\n          Maybe the ruins are sacred. You\n          know? And they don't want people\n          digging them up.\n          He glances about, off into the trees, a little spooked.\n          ERIC (cont'd)\n          We could be walking through some\n          sort of ancient graveyard right\n          now. And they've--\n\n          \n\n          \n\n          \n\n          \n\n          29.\n\n          JEFF\n          It's a mine. An old mining camp.\n\n          ERIC\n          So?\n\n          JEFF\n          There's nothing sacred about it.\n          Eric considers this as they walk. The others are also quiet:\n          too hot to speak. The sunlight falls through the trees in\n          thin, shifting columns, hazed with mosquitoes.\n\n          ERIC\n          Maybe it leads to a marijuana\n          field, then. Maybe the village is\n          growing pot, and that boy rode off\n          to get them, and they're gonna come\n          with guns and--\n\n          AMY\n          Eric.\n\n          ERIC\n          What?\n\n          AMY\n          Shut up, okay?\n          Eric falls silent. They follow the path as it curves first\n          right, then left, moving gradually uphill all the while, and\n          suddenly there's sunlight in front of them, bright and\n          intense: a clearing. They hesitate at its edge, staring.\n\n          EXT. CLEARING/BASE OF THE HILL - DAY\n\n          The clearing is twenty yards wide, and extends in either\n          direction as far as the eye can see, finally curving out of\n          sight. Its soil is a deep black, flecked with white, like\n          frost rime. It's completely free of vegetation.\n          The path resumes on the far side of the clearing, winding its\n          way up asmall hill. The hill is rocky, oddly treeless, and\n          covered with a vinelike growth--a vivid green, with hand-\n          shaped leaves and tiny red flowers.\n          Jeff and the others step warily out onto the cleared ground,\n          peering about, squinting in the sudden sunlight. They stare\n          up at the flower-covered-hill.\n\n          \n\n          \n\n          \n\n          \n\n          30.\n          There are hints of ruins among the thick foliage: giant\n          boulders with faint carvings etched onto their surfaces, the\n          crumbling remains of a fallen pillar, everything half-buried\n          beneath the vine.\n\n          STACY\n          It's beautiful.\n\n          AMY\n          So beautiful.\n\n          STACY\n          And the mosquitoes are gone. You\n          realize that? They've stopped\n          biting.\n          She smiles at the others, delighted by this development. Amy\n          removes the cap from her camera, starts to take pictures.\n\n          AMY'S POV - THROUGH THE VIEWFINDER\n          WE HEAR a click as she takes each photo, and the image\n          freezes for an instant.\n          There's the hillside, covered in its vine, its red flowers:\n          CLICK. There's Eric pulling the water bottle from his pack:\n          CLICK. There's Stacy smiling at us, waving: CLICK. There's\n          Mathias shading his eyes, peering up the hill.\n\n          AMY (O.S.}\n          Smile, Mathias.\n\n          MATHIAS\n          Is that a tent?\n          He points.\n\n          BACK TO SCENE\n          Amy lowers her camera, turns to look.\n\n          AMY'S POV - UP THE HILL\n          An orange square of fabric is just visible, at the very top\n          of the hill, billowing, sail-like, in the breeze. From this\n          distance, with the rise of the hill partly blocking the view,\n          its hard to tell what it is.\n\n          \n\n          \n\n          \n\n          \n\n          31.\n\n          BACK TO SCENE\n          They all stand there, peering up the hill. Faintly, but\n          growing steadily louder, a THUDDING noise comes from the\n          jungle. The five of them turn, heads cocked, listening.\n\n          JEFF\n          A horse.\n          It's true: HOOFBEATS are approaching at a gallop.\n          Instinctively, Jeff and the others back a handful of steps\n          toward the hill. A long. beat, then a horseman bursts into\n          the clearing, rearing to a halt. Amy lifts her camera.\n\n          AMY'S POV - THROUGH THE VIEWFINDER\n          A bald Mayan man is on the horse; he's broad-shouldered,\n          short, in his early forties, dressed in a white shirt and\n          pants. The horse rears a second time, and the image FREEZES\n          for an instant, with a CLICK, as Amy snaps another picture.\n\n          BACK TO SCENE\n          The bald man SHOUTS at them in UNSUBTITLED MAYAN. His horse\n          is lathered, SNORTING, rolling its eyes. It rears yet again,\n          and the man half-falls, half-jumps to-the ground. Jeff and\n          the others back a few more steps into the clearing.\n\n          AMY'S POV - THROUGH THE VIEWFINDER\n          The bald man is still holding the reins; the horse is backing\n          away from him, jerking its head, trying to break free,\n          pulling him, step-by-step, back toward the trail. CLICK.\n\n          BACK TO SCENE\n          The man can't gain control of the horse. Finally, he drops\n          the reins, and the horse gallops into the jungle, CRASHING\n          through the trees, its hoofbeats gradually diminishing.\n          The man turns toward them, starts YELLING in MAYAN again,\n          pointing back down the trail. Sweat shines on his forehead.\n          There's a gun on his belt, a black pistol in a brown holster.\n          Stacy is clutching Eric's arm, looking frightened.\n\n          STACY\n          What's he saying?\n\n          \n\n          \n\n          \n\n          \n\n          32.\n\n          ERIC\n          Maybe he wants money? A toll or\n          something?\n          The Mayan continues SHOUTING, waving his arm. Jeff reaches\n          into his pocket, pulls out his wallet, removes a twenty.\n\n          JEFF\n          Dinero?\n          The man ignores the proffered bill, makes a shooing motion,\n          waving them from the clearing. Mathias turns toward the\n          hill, cups his hands around his mouth, SHOUTS:\n\n          MATHIAS\n\n          HENRICHI\n          There's no response, just the orange fabric gently billowing.\n\n          JEFF\n          Why don't you hike up, see if you\n          can find him? We'll try to sort\n          this out.\n          Mathias nods, starts across the clearing. The bald man\n          SHOUTS at him in Mayan, and then, when Mathias doesn't stop,\n          pulls his pistol from its holster, FIRES into the sky.\n          Everyone flinches, half-ducking. Stacy SCREAMS. Mathias\n          goes still. The man waves at him, YELLING in Mayan, and\n          Mathias comes back, his hands raised, to join the others.\n          HOOFBEATS are approaching from the jungle again. They come\n          closer and closer, and suddenly two more horsemen burst into\n          the clearing. They're younger than the bald mans in their\n          twenties, dark-haired, muscular. One has a mustache.\n          Their mounts are white-eyed, SNORTING, rearing, just like the\n          bald man's. The two men jump to the ground, dropping their\n          reins, and the horses immediately turn and gallop back into\n          the jungle. Amy lifts her camera again.\n\n          AMY'S POV - THROUGH THE VIEWFINDER\n          The young men have bows slung across their chest, and quivers\n          of thin, fragile-looking arrows. They question the bald man\n          in MAYAN, very rapidly. He's still aiming his pistol at\n          Mathias. A CLICK, and the image freezes for an instant.\n\n          \n\n          \n\n          \n\n          \n\n          33.\n\n          BACK TO SCENE\n          As they continue to interrogate the bald man in MAYAN, the\n          young men unsling their bows, each of them nocking an arrow.\n          Reflexively, Jeff and the others retreat another handful of\n          steps into the clearing. Mathias still has his hands raised.\n\n          ERIC\n          What the fuck?\n\n          JEFF\n          Quiet.\n\n          ERIC\n\n          THEY'RE--\n\n          JEFF\n          Wait. Wait and see.\n          Amy is a bit farther into the clearing than Jeff and the\n          others. She keeps swinging her camera from them to the\n          Mayans, trying to capture the whole scene in one shot. She's\n          too close, though,-and she retreats another handful of steps.\n\n          AMY'S POV - THROUGH THE VIEWFINDER\n          Still backing up toward the hill; all of them but Stacy and\n          Eric are in the frame now. The bald Mayan is still answering\n          the young men's questions. He turns toward us suddenly,\n          points his pistol directly at us,.starts to SHOUT.\n\n          BACK TO SCENE\n          Jeff and the others turn, too, staring at Amy in surprise.\n          She's nearly at the far edge of the clearing, peering through\n          her camera; she retreats another step. The young Mayans\n          raise their bows, drawing them; the bald man keeps YELLING.\n\n          JEFF\n\n          AMY--\n          She takes another step; she's right up against the vines.\n\n          AMY'S POV - THROUGH THE VIEWFINDER\n          Stacy is in the frame now. We retreat one more step, and so\n          is Eric, and the Mayans with their raised weapons, the bald\n          man still SHOUTING: everything FREEZES on the CLICK.\n\n          \n\n          \n\n          \n\n          \n\n          34.\n\n          BACK TO SCENE\n          Amy lowers her camera. The Mayan with the mustache turns to\n          the other two, points toward her feet, SPEARING URGENTLY.\n          The bald Mayan slowly lowers his pistol, looking dismayed.\n          Amy glances down.\n\n          AMY'S POV - HER FEET\n          She's stepped out of the clearing, into the flowering vine.\n\n          BACK TO SCENE\n          Both of the younger Mayans are speaking now, their voices\n          RISING. The bald Mayan is shaking his head, protesting, but\n          they talk right over him. Amy steps clear of the vine,\n          starts back toward Jeff, and the younger Mayans draw their\n          bows taut again, aiming at her chest. She freezes.\n\n          AMY\n\n          JEFF---\n          Jeff lifts his hand, without looking, his eyes on the Mayans.\n\n          JEFF\n          Don't move.\n          The bald man continues to frown and shake his head. He\n          points to Amy, then the others; he waves toward the jungle.\n          But the young men are implacable--they keep arguing,\n          gesturing--and finally the bald man gives in, falls SILENT.\n          A beat, then the bald man raises his pistol, aims it at\n          Jeff's chest. He makes a shooing motion with his other hand,\n          but now it's toward Amy, and the hill beyond her.\n          He begins to SHOUT; the other men do, too. Then the bald man\n          FIRES a bullet into the dirt at Jeff's feet. Everyone jumps,\n          starts to retreat. The men with the bows are swinging them\n          back and forth, herding them toward the hill.\n          When Jeff and the others reach Amy, the bald man points\n          toward the trail, waves them up it. He watches--his\n          expression looking stricken, close to tears--as the five of\n          them obediently begin to climb the vine-covered hill.\n\n          EXT. HILLSIDE - DAY\n\n          Midway up the hill, they pause to catch their breath.\n\n          \n\n          \n\n          \n\n          \n\n          35.\n\n          JEFF\n          Check your phone, Eric.\n          Eric pulls out his phone, flips it open, stares at it.\n\n          ERIC\n          Nothing..\n          He snaps it shut. They stand there: sweating, scared\n          looking. Mathias cups his hands to his mouth again, SHOUTS:\n\n          MATHIAS\n          Henrich...I\n          They all peer up the hill, waiting for a response.\n\n          ERIC'S POV -- UP THE HILL\n          It is a tent: bright orange, looking a bit worse for wear.\n          The vine is growing up its aluminum poles as if on a trellis.\n          .The tent faces away from us; its doorway is hidden. There's\n          no sign or sound of any people.\n\n          BACK TO SCENE\n          Eric turns, glances back down the hill, shielding his eyes.\n\n          ERIC\n          There's another one.\n          He points toward the clearing below them.\n\n          ERIC'S POV THE CLEARING\n          A fourth man has arrived, on a bicycle. He's dressed in\n          white, like the others, with a straw hat on his head. A\n          beat, then two more Mayans appear, also on bicycles. They\n          all have bows slung over their shoulders.\n          The bald man addresses these newcomers. He waves in either\n          direction, and the other men start off along the clearing,\n          two one way, three the other, leaving him alone at the base\n          of the hill.\n          A beat, then a little boy appears from the jungle--the one\n          who'd watched them discover the camouflaged path. He and the\n          bald man stand there, peering up at us.\n\n          \n\n          \n\n          \n\n          \n\n          36.\n\n          BACK TO SCENE\n          Eric turns to the others, EXCITED:\n\n          ERIC\n          Let's run back down. Quick. While\n          there's just him and the kid. We\n          can rush them.\n\n          STACY\n          He's got a gun, Eric.\n          This silences Eric--silences all of them. Mathias turns,\n          SHOUTS toward the tent again.\n\n          MATHIAS\n          Henrich...1\n          There's no answer. They wait another beat, then Jeff waves\n          them back into motion.\n\n          EXT. HILLTOP - DAY\n\n          The hill is flat on top, forming a wide plateau. Beyond the\n          orange tent is a small clearing of rocky ground. A blue tent\n          sits on the far side of the clearing, looking just as\n          weathered as the orange one, the vine growing up its poles.\n          The five of them pause, peering about. Jeff CALLS OUT:\n\n          JEFF\n          Hello...?\n          SILENCE. The vine covers everything but the trail and the\n          clearing. We glimpse more rubble beneath its greenery: time-\n          worn stelae, a low stone wall.\n          In some places the vine folds back upon itself, forming waist-\n          high mounds, tangled knoll-like profusions of green. And\n          everywhere, hanging off it, are those bright red flowers.\n          Mathias moves toward the orange tent, and Jeff follows him.\n          They UNZIP its flap, stoop to peer inside.\n\n          JEFF'S POV - INSIDE-THE ORANGE TENT\n          The vine has taken root in here, too, growing on some things,\n          leaving others untouched. There are three sleeping bags\n          unrolled on the floor. An oil lamp. Two backpacks. A roll\n          of duct tape. A bottle of tequila. A metal canteen.\n\n          \n\n          \n\n          \n\n          \n\n          37.\n\n          BACK TO SCENE\n          Jeff and Mathias ZIP the flap back shut. Eric, Stacy and Amy\n          are fifteen feet away, watching.\n\n          ERIC\n          What's inside?\n\n          JEFF\n          Nothing. Some camping supplies.\n          Mathias starts across the clearing toward the blue tent,\n          followed by Jeff and the others. He UNZIPS its flap, sticks\n          his head inside. Jeff leans to look, too.\n\n          JEFF'S POV - INSIDE THE BLUE TENT\n          The same thing: sleeping bags, backpacks, camping supplies.\n          The vine is growing on some things, but not on.others.\n\n          BACK TO SCENE\n          Ten yards beyond the tent, there's a hole cut into the dirt.\n          Stacy, Amy, and Eric have gathered at its edge; Jeff and\n          Mathias join them. The hole is rectangular--ten feet by six\n          feet--and very deep; we can't see its bottom.\n          A windlass has been constructed beside the hole, a horizontal\n          barrel with a hand crank welded to its base. Rope is coiled\n          around the barrel. From there, it passes over a small wheel,\n          which hangs from a sawhorse straddling the hole's mouth.\n          Then it drops straight into the earth.\n\n          AMY\n          The mine?\n          Jeff nods. A draft is rising from the hole, and it lifts off\n          Amy's hat. She tries to catch it, but fumbles: the hat\n          falls away from her. They all watch it vanish into the dark.\n          Eric pulls out his phone, flips it open, almost\n          absentmindedly: a nervous gesture. There's still no signal.\n          He closes it, turns to survey the clearing, the empty tents.\n\n          ERIC\n          Now what?\n          Jeff shrugs, waves past the shaft. The clearing ends just a\n          few yards from them;\n\n          \n\n          \n\n          \n\n          \n\n          38.\n          then the vines resume, and in the midst of the vines is the\n          path. It winds its way to the edge of the hilltop, vanishes\n          over it.\n\n          JEFF\n          Keep going, I guess.\n          Saying this, he slings his pack onto his shoulder. Then he\n          starts forward, the others falling in behind him.\n\n          EXT. HILLSIDE - DAY\n\n          They pick their way down the trail. It's much steeper on\n          this side; there are short stretches where they have to drop\n          onto their rear ends and slide, one after another. It's\n          after one of these that Jeff suddenly stops, staring.\n\n          JEFF'S POV - THE BOTTOM OF THE HILL\n          It looks as if the jungle has been chopped down all the way\n          around the base of the hill, isolating it in a ring of barren\n          soil. One of the Mayans has made his way along this cleared\n          ground to the base of the trail. He's staring up at them.\n\n          ERIC (O.S.)\n          Fuck.\n          The man slides his bow off his shoulder, nocks an arrow. He\n          shakes his head at them, CALLS OUT in MAYAN, waves them away.\n\n          BACK TO SCENE\n          The five of them stand there, staring down at the man.\n\n          STACY\n          What do we do?\n          Jeff shrugs, starts forward again.\n\n          JEFF\n          We'll see.\n          The others hesitate, and then, one after another, resume\n          their downward march.\n\n          EXT. BASE OF THE HILL - DAY\n\n          As they approach the clearing, the Mayan man YELLS what\n          sounds like someone's name.\n\n          \n\n          \n\n          \n\n          \n\n          39.\n          A beat, then another bowman comes jogging into view. Jeff\n          and the others stop at the bottom of the trail. They stand\n          there, staring.\n          The vine has invaded the clearing here. Ten feet in front of\n          the path is one of those odd, knoll-like growths, knee-high,\n          thick with flowers. The two Mayans are another twenty feet\n          beyond it, in the center of the clearing, bows drawn.\n\n          AMY\n          So.\n          Her skin is slick with sweat, and she's winded from the hike\n          down. A third Mayan comes jogging toward them. He stops\n          beside the other two, draws his bow.\n\n          ERIC\n          We should rush them. All at once.\n\n          STACY\n          Shut Up, Eric.\n\n          ERIC\n          Or go make shields. If we had some\n          shields, we could--\n          He falls silent as another Mayan comes running toward them.\n          along the clearing. This one is bearded, heavier than the\n          others. And he's carrying a rifle.\n\n          ANY\n          Oh my god.\n          Jeff is staring at the little isolated island of vines, ten\n          feet in front of them--peering intently at it.\n\n          STACY\n          Let's go back up.\n          Jeff takes a step forward into the clearing--slowly, warily.\n          STACY (cont'd)\n          I wanna go back.\n          Jeff takes another step, edging toward the mound, his eyes on\n          the Mayans, their raised weapons. They just watch him.\n\n          ANY\n\n          JEFF--\n          He ignores her, takes a third step, then a forth, which\n          brings him to the mound of vines. He crouches, reaches into\n          the tendrils, parting them. He grasps a stalk, tugs, pulls\n          it free. WE SEE a tennis shoe, a sock, a man's shin.\n\n          \n\n          \n\n          \n\n          \n\n          40.\n          Jeff turns, stares at Mathias, who steps forward, crouches\n          beside him, starts to pull at the vines, gently at first,\n          then more aggressively, tearing them, the plant's sap shining\n          on his skin, a low MOAN rising from his chest.\n          Another shoe is revealed, another leg, a pair of jeans, a\n          belt buckle, a black T-shirt. And then, finally: a young\n          man's face, the flesh oddly eaten away, so that his cheekbone\n          is visible, the white socket of his left eye.\n          AMY (cont'd)\n          Oh, no. Oh, Jesus.\n          Jeff holds up his hand, silencing her. The Mayans stand\n          there, in the center of the clearing, watching. Mathias has\n          begun to rock slightly, that MOANING coming and going. Jeff\n          touches his shoulder, WHISPERS:\n\n          JEFF\n          Easy. All right? Easy and slow.\n          We'll stand up and we'll walk away.\n          We'll walk back up the hill.\n          The young man's T-shirt is stiff with dried blood. There are.\n          three slender arrows impaled in his chest.\n\n          MATHIAS\n          It's my brother.\n\n          JEFF\n          I know.\n\n          MATHIAS\n          They killed him.\n          Jeff nods, his hand still on Mathias's.shoulder; he squeezes.\n\n          JEFF\n          Shh. Not here. Up the hill, okay?\n          Mathias is struggling to control his breathing; the MOANS\n          keep coming. Finally, he manages a nod, and they both stand\n          up. Stacy and Amy are holding hands, looking stricken.\n          Stacy has started to CRY. Eric has his arm around her.\n          The Mayans keep their weapons raised. They watch in silence\n          as Jeff and the others turn to start back up the hill.\n\n          EXT. HILLTOP - DAY\n\n          Jeff and Mathias are at the top of the trail, staring down\n          toward the clearing.\n\n          \n\n          \n\n          \n\n          \n\n          41.\n\n          JEFF'S POV - THE BOTTOM OF THE BILL\n          More Mayans are appearing from the jungle. They're all\n          armed. The bald man sends them out along the clearing, some\n          in one direction, some 'the other.\n\n          BACK TO SCENE\n          Jeff and Mathias stand there, grim-faced, watching. Mathias\n          lifts his hands, stares at them. They've turned a deep, raw-\n          meat red, as if scarred. He flexes his fingers, wincing.\n\n          EXT. HILLTOP - THE CLEARING - DAY\n\n          Amy, Stacy, and Eric sit in the clearing, beside the shaft,\n          passing a bottle of water among themselves. Eric is\n          struggling to calm the girls:\n\n          ERIC\n          We can sneak past once the sun...-'\n          sets, I bet. You know? Just reep\n          by them in the dark?\n          Stacy and Amy hardly seem to hear him; they look dazed,\n          distraught. Eric passes the bottle to Stacy. A beat, then:\n          ERIC (cont'd)\n          And then there's the girl.\n\n          AMY\n          The girl?\n\n           ERIC\n          The one his brother met. What\n          happened to her?\n          Amy and Stacy are silent. Stacy lifts the water bottle to\n          her lips, but immediately lowers it, and starts to CRY again.\n          Amy takes her hand. Eric watches them, silent. Then:\n          ERIC (cont'd)\n          And the archaeologists. You think--\n          Stacy's crying deepens toward a SOB. Amy gives Eric a look.\n\n          AMY\n          Stop it, Eric.\n\n          ERIC\n          What?\n\n          \n\n          \n\n          \n\n          \n\n          42.\n\n          AMY\n          Just stop, okay? Stop talking.\n          Stacy struggles to collect herself, breathing deep. She\n          wipes at her face. Amy keeps stroking her hand.\n          Jeff and Mathias are approaching across the hilltop. Mathias\n          holding his burned-looking hands out in front of him. He\n          9 a nd Jeff crouch beside the others.\n\n          ERIC\n          What happened?\n          Jeff takes the bottle from Stacy. He pours a tiny bit of\n          water on Mathias's hands.\n\n          JEFF\n          There's something in the plants.\n          The sap--it burned his skin.\n          Mathias rubs at his hands with his shirt, grimacing. Amy\n          reaches to take the water back from Jeff. She starts to lift\n          the bottle to her mouth, but..Teff leans forward, grabs it.\n          JEFF (cont'd)\n          Don't. We need to save it.\n\n          AMY\n          But I'm thirsty.\n\n          JEFF\n          We all are.\n\n          AMY\n          So let's drink.\n          Jeff shakes his head, capping the bottle.\n\n          JEFF\n          We don't have that much. We need\n          to ration it.\n          (he glances up at the sky)\n          We'll have to figure out a way to\n          catch the rain.\n          Everyone but Amy peers up at the sky: it's a perfect,\n          cloudless blue. Amy remains focused on Jeff.\n\n          AMY\n          I'm hungover. I'm sunburned. I\n          lost my hat. I need some water.\n\n          \n\n          \n\n          \n\n          \n\n          43.\n\n          JEFF\n\n          AMY--\n\n          AMY\n          Why do you get to decide?\n          Jeff stares at her, considering this. Then he shrugs.\n\n          JEFF\n          Fine. Let's vote.\n          (he glances at the others)\n          But first you should understand\n          that each of us is gonna need half\n          a gallon of water a day, at a\n          minimum, to survive here. That's\n          two and a half gallons total, every\n          day. And right now, until it\n          rains, we don't have it. Okay?\n          Not even one day's worth.\n          (a beat)\n          Now who wants to give Amy more\n          water?\n          A long moment of silence. No one can meet Amy's eyes.\n          Finally, VERY QUIETLY:\n\n          STACY\n          Maybe we should just wait, honey.\n\n          ANY\n          Till?\n          Everyone looks toward Jeff.\n\n          JEFF\n          Another hour or so. Then we'll all\n          have a sip. Okay?\n          Amy can see that she has no choice. She gives a grudging\n          nod, and Jeff slides the bottle into his knapsack.\n          JEFF (cont'd)\n          We have to get organized. Now.\n          While we're still fresh. We'll\n          have to stay out of the sun, spend\n          as much time as possible in the\n          tents. We'll have to--\n\n          STACY\n          Can't we sneak away when it gets\n          dark? Eric said we--\n\n          \n\n          \n\n          \n\n          \n\n          44.\n          Jeff shakes his head, cutting her off. He waves across the\n          hilltop, toward where he and Mathias had been standing.\n\n          JEFF\n          They keep coming. More and more of\n          them. They're all armed, and the\n          bald one sends them out along the\n          clearing. They're surrounding us.\n          Amy, Stacy and Eric struggle to absorb this. Finally:\n\n          ERIC\n          Why don't they just kill us?\n\n          JEFF\n          It's got something to do with the\n          hill, I think. Once you step on\n          it, you're not allowed off.\n          Something like that. They won't\n          step on it themselves, but now that\n          we're here, they won't let us\n          leave. So we have to figure out a\n          way to survive till someone comes\n          and finds-us.\n\n          AMY\n          Who?\n          Jeff lifts one hand, palm-up, half a shrug.\n\n          JEFF\n          People'll start to worry when we\n          don't return home. Right? And\n\n          THEY'LL--\n\n          AMY\n          We're not supposed to leave till\n          Friday.\n          Jeff nods.\n          AMY (cont'd)\n          And they'll have to come searching.\n          Again, he nods.\n          AMY (cont'd)\n          So you're talking--what, a week?\n\n          .JEFF\n          Something like that.\n          Amy looks appalled; her voice JUMPS:\n\n          \n\n          \n\n          \n\n          \n\n          45.\n\n          AMY\n          We can't live here for a week,\n          Jeff.\n\n          JEFF\n          If we try to leave, they'll shoot\n          us. That's the one thing we know\n          for certain.\n          An electronic CHIRPING comes from the shaft: it sounds like\n          a cell phone ringing. Mathias turns his head, listening. No\n          one else notices it.\n\n          AMY\n          But what will we eat? How will we--\n          The RINGING comes again, silencing her. She glances toward\n          the shaft, not quite believing what she's hearing. It comes\n          a THIRD TIME, and they all stand up, step to the hole, peer\n          into its darkness. The RINGING comes yet again.\n\n          STACY\n          A cell phone.\n\n          AMY\n          It can't be--\n\n          JEFF\n          That's a cell phone, Amy.\n          Definitely.\n\n          .AMY\n          But there's no signal out here.\n          Eric can't get a signal.\n          Reflexively, Eric pulls out his phone, checks again:\n          nothing. There's another RING.\n\n          JEFF\n          It could be a different network.\n          Something local.\n\n          AMY\n          Way down in that hole? How could\n          it pick it up?\n          Still another RING.\n\n          ERIC\n          What else can it be?\n\n          \n\n          \n\n          \n\n          \n\n          46.\n          The RINGING falls SILENT. They all stand there, staring into\n          the hole. A long beat, then it RESUMES. Eric CLAPS his\n          hands, ecstatic. The others are starting to smile, too.\n          Mathias moves to the windlass. He unrolls some of the rope,\n          starts to wrap it around his chest. Jeff watches him.\n          Another RING.\n          The vine has taken root on the windlass:- the sawhorse, the\n          barrel, the rope. Jeff steps forward, begins to yank it off,\n          careful not to get the sap on his hands. He turns to Amy.\n\n          JEFF\n          There's a lamp in the orange tent.\n          See if you can find some matches,\n          too.\n          Amy hurries off toward the orange tent, vanishing inside.\n          There's a final RING, and then SILENCE again. Mathias is\n          knotting the rope tightly around his chest.\n          Amy returns, carrying an oil lamp, a box of matches.\n          Everyone watches as Jeff crouches to light the lamp. Then he\n          rises, turns toward Mathias, looks at him closely.\n          JEFF (cont'd)\n          You sure?\n          Mathias nods, takes the lamp, steps to the edge of the hole.\n          Jeff and Eric move to the windlass; they position themselves\n          at the hand crank, leaning into it, so the rope goes taut.\n          Mathias girds himself, steps out over the hole. He dangles\n          there for a moment, hanging beneath the sawhorse, the\n          windlass GROANING on its mount. Then Jeff and Eric begin to\n          reverse the crank, letting the rope slowly spool out.\n          Stacy and Amy stand beside the shaft, peering into it,\n          watching as Mathias begins his descent--ten feet, twenty\n          feet, thirty feet down, and still only darkness beneath him,\n          with no sign of the shaft's bottom.\n          The windlass CREAKS as it turns; Jeff and Eric strain against\n          it, sweating, muscles taut. Amy has turned from the shaft,\n          is watching: the rope as it slowly unspools from the barrel.\n\n          AMY\n          Jeff.\n          He turns to look, and she points at the rope, where it comes\n          off the windlass and angles up toward the little wheel\n          hanging from the sawhorse.\n\n          \n\n          \n\n          \n\n          \n\n          47.\n          AMY (cont'd)\n          The sap...\n          They'd cleared off most of the vine from the rope, but not\n          all of it. Some of these remaining tendrils have been\n          crushed as the windlass slowly unspools. Their sap is\n          darkening the rope in spots, eating into it.\n          AMY (cont'd)\n          I think it's--\n          Jeff immediately turns back to the crank, his voice URGENT:\n\n          JEFF\n          Pull him up !\n          Eric hasn't grasped what's happening. He hesitates.\n          JEFF (cont'd)\n\n          NOWT\n          Amy jumps forward to help, all three of them pushing at the\n          crank, getting in each other's way, the windlass CREAKING as\n          it begins to turn again, slowly reclaiming the rope. Stacy\n          remains beside the shaft, peering anxiously into it.\n\n          STACY'S POV - THE SHAFT\n          Mathias is twenty-five feet beneath us, just beginning to\n          bump his way upward, swaying back and forth. He stares up at\n          us, CONFUSED:\n\n          MATHIAS\n          What is it?\n          The rope beneath the sawhorse is being visibly eaten away,\n          its hemp unraveling.\n\n          BACK TO SCENE\n          Stacy turns toward the others, pointing, terrified.\n\n          STACY\n\n          IT'S--\n          The rope SWAPS. Jeff, Eric and Amy fall forward, the\n          windlass spinning wildly behind them, free'of its weight. A\n          long beat, then there's a distant, hollow-sounding THUMP,\n          followed instantly by the POP of the lamp shattering.\n          Stacy leans to peer into the shaft, her hand over her mouth.\n\n          \n\n          \n\n          \n\n          \n\n          48.\n\n          STACY'S POV - THE SHAFT\n          Darkness. Silence.\n\n           STACY (O.S.)\n          Mathias...?\n          Her voice ECHOES back at us. There's no response.\n\n          BACK TO SCENE\n          Jeff, Eric, and Amy join Stacy at the edge of the shaft, all\n          of them staring down into the darkness, looking horrified.\n\n          ERIC\n          Oh, Jesus. Oh, fuck.\n\n          AMY\n          Is he--\n          There's a GROAN from below, very faint, almost inaudible.\n\n          JEFF\n          He's moaning.\n          They listen for a beat, but there's only silence.\n          JEFF (cont'd)\n          I heard him moan.\n          The others don't seem so certain; Jeff turns to the girls.\n          JEFF (cont'd)\n          One of you will have to go.\n\n          AMY\n          Go?\n          Jeff nods, waving into the shaft.\n\n          JEFF\n          Down. We'll clear the vine off the\n          rope. And you can--\n\n          AMY\n          Why can't you? Or Eric?\n\n          JEFF\n          We have to work the crank. You\n          won't be strong enough.\n\n          \n\n          \n\n          \n\n          \n\n          49.\n          Amy and Stacy stare at each other; it's obvious neither of\n          them wants to go. Stacy is the one who finally gives in.\n\n          STACY\n          I can do it.\n\n          AMY\n\n          (RELIEVED)\n          You sure?\n          Stacy nods, but she doesn't look sure. She's hugging\n          herself; it seems as if she might start trembling. Before\n          anyone can speak, that GROANING comes from the shaft again,\n          louder this time, unmistakable. Jeff cups his hands, SHOUTS:\n\n          JEFF\n          Mathias...?\n          More SILENCE. Jeff turns to the girls.\n          JEFF (cont'd)\n          See if you can find a knife. And\n          another lamp.'\n          He waves them toward the tents; then he and Eric begin to\n          unspool the rope from the windlass, laying it out across the\n          clearing in long, looping circles.\n\n          EXT. CLEARING/BASE OF THE HILL - DAY\n\n          The Mayans keep coming: women now, too, bearing bundles on\n          their backs. They're setting up a campsite along the edge of\n          the jungle. The bald man stands in their midst, his hands on\n          his hips, staring silently up the hillside.\n\n          CU - OIL LAMP\n          The SCRATCH of a match being lit: Amy's hand comes into\n          frame, lifts the lamp's glass chimney, fires the wick.\n\n          JEFF (0.S.)\n          Just help him into the sling. Then\n          we'll pull him up.\n          The chimney is carefully replaced, as WE PULL BACK TO REVEAL:\n\n          EXT. HILLTOP - THE CLEARING - DAY\n\n          Amy is crouched, adjusting the lamp's flame. Jeff and Eric\n          have mended the rope.\n\n          \n\n          \n\n          \n\n          \n\n          50.\n          WE SEE the excised lengths of spoiled hemp, and the ragged-\n          looking knots on the rope itself, which has been spooled once\n          more around the windlass.\n          They've fashioned a sling at the rope's end. Jeff and Eric\n          are helping Stacy into it, pulling it over her head,\n          adjusting it under her armpits.\n\n          JEFF\n          Once we get him out, we'll drop the\n          rope back down and pull you up,\n          too.\n          Amy offers Stacy the lamp. Stacy is scared, yet struggling\n          not to show it. Her hands are trembling, and the lamp\n          rattles as she takes it. The boys are stepping toward the\n          windlass; Eric stops, glances back at her.\n\n          ERIC\n          You okay?\n          Stacy nods, but without much conviction. Eric steps toward\n          her, gives her a tight hug. He holds her eyes for a moment,\n          kisses her. Then he joins Jeff at the hand crank. They lean\n          against it, and the rope goes taut.\n          Stacy steps out into the open air over the shaft, the lamp in\n          her right hand. With her left hand, she lunges, grabs at the\n          sawhorse, clings tightly to it. Jeff glances toward her from\n          the hand crank.\n\n          JEFF\n          Ready?\n          She nods, but doesn't relinquish her grip on the sawhorse.\n          JEFF (cont'd)\n          You have to let go, Stacy.\n          For a moment, it doesn't seem like she'll be able to, but\n          then--with a visible act of will--she does, and they slowly.\n          begin to let the rope out, dropping her into the shaft.\n\n          ON STACY - IN THE SLING\n          She grips the sling with one hand, the lamp with the other.\n          Wooden supports have been hammered into the walls of the\n          shaft, buttressing the dirt. The vine clings to them, its\n          leaves and flowers paler than on the hillside above.\n          Stacy begins to swing, pendulum-like, as she descends. She\n          tries unsuccessfully to steady herself, then glances up.\n\n          \n\n          \n\n          \n\n          \n\n          51.\n\n          STACY'S POV - ABOVE HER\n          We're steadily dropping: thirty feet down, then forty. Amy\n          is at the edge of the shaft, peering in at us. She waves.\n\n          BACK TO SCENE\n          Stacy smiles up at her. She starts to wave back, but is too\n          scared to let go of the sling. She glances down.\n\n          STACY'S POV - BENEATH HER\n          The light is swaying back and forth with Stacy, and it causes\n          the shadows beneath us to jump and lurch. There's still no\n          sign of the bottom; the windlass continues to CREAK.\n          A beat, and then, very faintly, Mathias's dim shape starts to\n          emerge: his white tennis shoes, his pale blue T-shirt. The\n          lamp picks up bits of broken glass around his body.\n\n          BACK TO SCENE\n          Stacy lifts the lamp, peering downward, struggling to see\n          more clearly, and the sling suddenly jerks to a halt, making\n          her SQUAWK. She looks up.\n\n          STACY'S POV - ABOVE HER\n          The CREAKING has stopped. We're swinging slowly back and\n          forth. WE SEE Amy peering down toward us: a long way up,\n          almost seventy feet. A beat, then Jeff appears, too.\n\n          JEFF\n          Stacy?\n          His voice has an ECHO to it.\n\n          BACK TO SCENE - STACY\n          Her face is slick with sweat; it shines-in the lamp light.\n\n          STACY\n          What?\n\n          JEFF (O.S.).\n          It's the end of the rope.\n\n          \n\n          \n\n          \n\n          \n\n          52.\n\n          STACY\n          I'm not at the bottom.\n\n          JEFF (O.S.)\n          Can you see him?\n          Stacy looks down again, holding up the lamp, peering toward\n          Mathias's motionless body. She lifts her head.\n\n          STACY\n          A little.\n\n          JEFF (O.S.)\n          Is he conscious?\n\n          STACY\n          I can't tell. I don't think so.\n\n          JEFF (O.S.)\n          How far are you above him?\n          Stacy glances down once more, trying to quess,the distance.\n\n          STACY\n          Fifteen feet?\n          (a beat)\n          He's just lying there.\n          She lifts her head again, peers upward.\n\n          STACY'S POV - ABOVE HER\n          The top of the shaft is empty. Very faintly, WE HEAR Jeff\n          and the others talking, just their voices, not their words.\n\n          STACY (O.S.)\n          Jeff ... ?\n          Jeff's head reappears.\n\n          JEFF\n          We have to figure out a way to\n          lengthen the rope. We're gonna\n          pull you up.\n          He pulls his head away.\n\n          BACK TO SCENE - STACY\n          She's staring upward.\n\n          \n\n          \n\n          \n\n          \n\n          53.\n\n          STACY\n          Wait!\n          The rope has almost stopped its swaying.\n\n          EXT. HILLTOP - THE CLEARING\n\n          Jeff steps back to the hole, peers into it. So does Amy.\n          Eric waits by the windlass. The rope is completely played\n          out. Stacy SHOUTS, her voice ECHOING slightly:\n\n          STACY (O.S.)\n          I want to stay with him.\n\n          JEFF\n          You can't. We have to--\n\n          STACY (O.S.)\n          I'll jump.\n          Jeff glances at the others. Eric shakes his head. Jeff\n          CALLS down to her:.\n\n          JEFF\n          We might not be able to make it\n          longer. You'll be trapped.\n\n          STACY (O.S.)\n          What about him? We can't just\n          leave him.\n\n          JEFF\n          We'll pull you up. Then we'll see.\n          He starts toward the windlass again.\n\n          ON STACY - IN THE SLING\n          The rope jerks, and she begins to rise. She kicks her legs,\n          lifts her left arm over head, wrenches it free of the sling,\n          so that only her right arm remains hooked. She switches the\n          lamp from her right hand to her left, then slips completely\n          free of,the sling, the lamp fluttering out as she drops.\n\n          THE BOTTOM OF THE SHAFT\n          Almost totally dark, just a faint fall of light from above.\n          Mathias is a dim shape on the floor of the shaft. Stacy\n          lands beside him--heavily, awkwardly--the glass from his\n          shattered lamp CRUNCHING beneath her.\n\n          \n\n          \n\n          \n\n          \n\n          54.\n          She loses her balance, pitches forward, onto his body.\n          MATHIAS makes a terrible SHRIEKING sound, pure pain, flailing\n          his arms. Stacy struggles to right herself.\n\n          STACY\n          I'm sorry. Oh, God. I'm so sorry.\n          She pulls herself into a crouch, staring down at him through\n          the dimness, his SHRIEK fading to a steady MOANING.\n\n          EXT. HILLTOP - THE CLEARING\n\n          Jeff, Amy, and Eric have rushed to the shaft; they're peering\n          into it. There's only darkness beneath them. Eric SHOUTS:\n\n          ERIC\n          Stacy...?\n          Stacy's voice rises toward them, sounding. very FAR AWAY:\n\n          STACY (O.S.)\n          I didn't want him to be alone.\n\n          JEFF\n          What happened to the lamp?\n\n          STACY (O.S.)\n          It blew out.\n          Jeff turns from the shaft, picks up the box of matches. He\n          yanks off his shirt, ties the box inside it, then steps back\n          to the edge of the hole. He CALLS down to Stacy:\n\n          JEFF\n          I'm dropping the matches. Okay?\n\n          STACY (O.S.)\n          Okay.\n          Jeff holds the knotted bundle over the shaft, lets it go. It\n          falls into the darkness. A long beat, and then, very softly,\n          WE HEAR the thump as it lands.\n          STACY (O.S.) (cont'd)\n          Got it.\n          The three of them stare into the hole, waiting for the light.\n\n          \n\n          \n\n          \n\n          \n\n          55.\n\n          THE BOTTOM OF THE SHAFT\n          There's the RASP of a match, its flickering flame, then the\n          stronger illumination of the lamp as Stacy lights its wick.\n          Mathias lies on his back before her, silent now, motionless,\n          his eyes shut. Stacy bends toward him, WHISPERS:\n\n          STACY\n          Mathias...?\n          He doesn't respond; it's hard to tell if he's conscious.\n          Stacy lifts the lamp, peers about the shaft. The vine has\n          taken root even at this depth, its flowers and leaves pale to\n          the point of translucence.\n          Beyond Mathias, there's an opening in the dirt wall, another\n          shaft cutting perpendicularly into the earth. Its roof is\n          supported by a stone archway, intricately carved. Stacy\n          rises, as if to investigate, but then winces, nearly falls.\n          She peers down at her right leg. A large piece of glass is\n          imbedded there, just beneath her knee. it's the size of a\n          playing card, gently concave,'dark with her blood. She\n          reaches and, grimacing, pulls it from her body.\n\n          EXT. HILLTOP - THE CLEARING\n\n          Jeff is at the windlass, hurriedly cranking the rope back up.\n          Eric and Amy stand watching.\n\n          JEFF\n          We need fifteen feet. Twenty to be\n          safe.\n          No one speaks. The windlass turns with that steady CREAKING,\n          but it's higher-pitched now, with no weight on the rope.\n          JEFF (cont'd)\n          Come on. Think. How can we--\n\n          ERIC\n          The clothes? From the backpacks?\n          We could knot them together?\n\n          JEFF\n          Would they hold?\n          Eric frowns, uncertain. Jeff finishes with the rope, stands\n          there, catching his breath. Stacy's,voice rises toward them\n          from the shaft:\n\n          \n\n          \n\n          \n\n          \n\n          56.\n\n          STACY (O.S.)\n          I cut my knee.\n          Eric hurries to the shaft, followed by Jeff and Amy. They\n          peer over its edge, toward Stacy, so far beneath them, in her\n          flickering circle of lamp light.\n\n          ERIC\n          Bad?\n\n          STACY\n          My shoe's full of blood.\n\n          JEFF\n          Put pressure on it. Use my shirt.\n          They all stare down at her, waiting.\n\n          TOE BOTTOM OF THE SHAFT\n          Stacy is crouched beside Mathias, pressing Jeff's T-shirt to\n          her wound. Her khakis and tennis shoe are dark with blood;\n          there's a lot of it. She isn't watching Mathias; he startles\n          her when he opens his eyes and speaks:\n\n          MATHIAS\n          My...legs...\n          His voice is faint and RASPY; we can hear his pain in it.\n          Stacy leans toward him, tries to smile reassuringly.\n\n          STACY\n          Hey...\n\n          MATHIAS\n          Can't... move ...my...legs...\n          Stacy turns to look: his legs are lying at an odd angle, as\n          if he were a doll that had been carelessly tossed there.\n\n          EXT. HILLTOP - THE CLEARING\n\n          Jeff, Eric and Amy, still watching; Jeff turns to the others.\n\n          JEFF\n          What about the tents? We could\n          take one down, cut the nylon into\n          strips.\n          Eric and Amy glance toward the tents, debating.\n\n          \n\n          \n\n          \n\n          \n\n          57.\n\n          ERIC\n          Would it be strong enough?\n\n          JEFF\n          we can braid them--three strips for\n          each section. Then knot the\n          sections together, for strength.\n          Before either of them can respond, Stacy's voice emerges from\n          the shaft, sounding SCARED:\n\n          STACY (O.S.)\n          I think he broke his back.\n          They fall silent, staring down at her.\n          STACY (O.S.) (cont'd)\n          He can't move his legs. And it\n          smells.\n\n          JEFF\n          Smells?\n\n          STACY (O.S.)\n          Like he lost his bowels. His\n          bladder.\n\n          AMY\n          (very quietly)\n          Oh no. Please no.\n          Jeff turns to her.\n\n          JEFF\n          How can we make a backboard?\n          Amy starts to shake her head, looking horrified.\n\n          AMY\n          No, Jeff. No way. We can't move\n          him.\n\n          JEFF\n          One of the frames from the\n          backpacks? And the tent poles.\n          There's tape in the orange tent.\n          He doesn't wait for a response; he leans over the shaft,\n\n          SHOUTS:\n          JEFF (cont'd)\n          We have to builda backboard,\n          Stacy. It might take a while.\n\n          \n\n          \n\n          \n\n          \n\n          58.\n          There's a long hesitation, as if Stacy is searching for some\n          alternative. Then, still sounding FRIGHTENED and FARAWAY:\n\n          STACY (O.S.)\n          Okay.\n          Amy is shaking her head, growing FRANTIC:\n\n          AMY\n          We'll make it worse. Well jostle\n          him, and he'll--\n          Jeff turns toward her, with a hint of EXASPERATION:\n\n          JEFF\n          We can't just leave him down there.\n          You know that, don't you?\n          She starts to back away, toward the edge of the clearing.\n\n          AMY\n          we have to tell them.\n\n          JEFF\n          Who?\n\n          AMY\n          The Mayans. We have to tell them\n          what's happened.\n          Jeff gives her an incredulous look. She keeps retreating;\n          she's almost at the path.\n          AMY (cont'd)\n          They can send for help.\n\n          JEFF\n          They're not gonna---\n\n          AMY\n          We have to may. We have to--\n          She spins, starts off at a run, vanishing down the trail.\n          Jeff calls after her, SHOUTING:\n\n          JEFF\n          Amy!\n          But she's gone. Jeff turns to Eric.\n          JEFF (cont'd)\n          Stay here.\n\n          \n\n          \n\n          \n\n          \n\n          59.\n          And then he, too, is running.\n\n          EXT. CLEARING/BASE OF THE HILL - DAY\n\n          The Mayans have established their campsite on the edge of the\n          jungle. Two women are beside a campfire, plucking a pair of\n          chickens. WE SEE other campsites in the distance, other\n          campfires, hugging the jungle's margin, surrounding the hill.\n          Three men sit in the center of the clearing, facing the\n          hillside, their bows in their laps. They rise suddenly,\n          peering up the trail. The women pause in their labor, also\n          staring. The campsite goes QUIET.\n\n          THE MAYANS' POV - UP THE HILL\n          Amy is sprinting toward us down the trail. Jeff is ten yards\n          behind her, also running.\n\n          BACK TO SCENE\n          The three Mayans nock arrows. Two other men step forward to\n          join them. One has a bow; the other is the bald Mayan, with\n          the pistol. He unholsters it, and--as Amy reaches the bottom\n          of the trail--raises it, aiming at her chest.\n          Amy stops just short of the clearing: sweating, breathless,\n          scared-looking. She lifts her hands, palms-up, beseeching.\n\n          AMY\n          Help us. Please. Someone's been\n          hurt. He--\n          Jeff comes to a halt, five feet behind her.\n\n          JEFF\n          They can't understand you.\n          She turns, her voice quickened with PANIC:\n\n          AMY\n          Say it in Spanish. Tell them he--\n\n          JEFF\n          They don't speak Spanish.\n\n          AMY\n          Try it. You have to try.\n\n          \n\n          \n\n          \n\n          \n\n          60.\n          She spins back toward the Mayans, takes a step into the\n          clearing. The bald man SHOUTS at her, a single short\n          sentence in MAYAN. Amy holds out her hands to him.\n          AMY (cont'd)\n          Espanol? Habla Espanol?\n          Jeff steps forward, grabs her elbow.\n\n          JEFF\n          They killed Henrich. Why would-\n          Amy tries to tug free, but he won't let her. She starts to\n          SHOUT at the Mayans:\n\n          AMY\n          Help usi We need help!\n          The Mayans just stare at her, their weapons raised, their\n          faces expressionless. one of them is much younger than the\n          others, almost a boy. He says something in MAYAN to the bald\n          man, and the bald man shakes his head.\n          Amy begins to CRY. Jeff pulls at her elbow.\n\n          JEFF\n          We have to get back.\n          Amy turns toward him, her face smeared with tears.\n\n          AMY\n          I didn't want to come. I told you\n          we shouldn't. I said--\n          Jeff tightens his grip on her arm, gives her a little shake,\n          as if to wake her up.\n\n          JEFF\n          Listen to me. Mathias needs our\n          help. Right now. He--\n\n          AMY\n          We shouldn't even be here. Why did\n          you say we'd come?\n          (she wipes at her tears)\n          You have to do something.\n          (rising toward a shout)\n          You have to! It's your fault.\n          It's all your--\n          Jeff shakes her again, more roughly, his voice like a slap:\n\n          \n\n          \n\n          \n\n          \n\n          61.\n\n          JEFF\n          YD-q stepped onto the hill.\n          Amy stares at him, startled into silence.\n          JEFF (cont'd)\n          They wouldn't have forced us up it\n          if you hadn't.\n          He holds her eyes, making sure she understands. Then:\n          JEFF (cont'd)\n          Now let's go, okay?\n          He starts to pull her back toward the trail. She allows\n          herself to be led; she's begun to CRY again:\n\n          AMY\n          I didn't know. I just--\n          She's growing increasingly upset, almost SOBBING. She tries\n          to turn back toward the Mayans again, but Jeff won't let her.\n          AMY (cont'd)\n          They have to help us.\n\n          JEFF\n          They're not going to.\n\n          AMY\n          They have to.\n          She wrenches herself free, stumbles, falls into the vines\n          beside the trail. Jeff reaches for her, but she kicks away\n          from him, grabbing at the vines, scrambling to her feet.\n          As she rises, she yanks up a tendril, a clot of earth hanging\n          from its roots. She SCREAMS, spinning toward the clearing---\n          AMY (cont'd)\n\n          WHY WON'T YOU FUCKING HELP US?\n          --and throws the tendril at the Mayans. They scramble\n          backward, with surprising panic, SHOUTING. The youngest of\n          them is too slow: the length of vine hits him in the leg.\n          He stares down at the tendril in shock.\n          The others back hurriedly away from him. Two of them\n          continue to point their weapons at Amy, but the bald man and\n          one of the other bowmen are aiming at the young Mayan now.\n          There's SHOUTING from the tree line. The entire campsite is\n          on its feet; a woman begins to SCREAM.\n\n          \n\n          \n\n          \n\n          \n\n          62.\n          She's in her,forties, short and stout, and she starts forward\n          into the clearing, arms stretched toward the young Mayan.\n          Two of the other women grab her, hold her back.\n          The bald Mayan starts to ADDRESS the young man, pointing up\n          the hillside. The short woman keeps SCREAMING, flailing,\n          trying to break free. The young Mayan looks at her, then at\n          the bald man. He speaks in MAYAN, a brief burst of words.\n          The bald man shakes his head, points up the hill again, his\n          pistol aimed at the young man's chest. The short woman is\n          WAILING, eyes shut. The young Mayan takes a step toward her,\n          CALLING what seems to be her name.\n          The bald man SHOUTS at him, but the young Mayan ignores him,\n          takes a second step, then a third. The bowmen are all aiming\n          at him now, and suddenly, everyone seems to be YELLING.\n          The young Mayan takes a fifth step, holding out his arms\n          toward the WAILING woman, CALLING to her. The bald man\n          FIRES, shooting him in the head. At the same instant, the\n          bowmen let their arrows fly, the shafts THUMPING into the\n          young man's chest, burying themselves to the fletches.\n          The clearing goes still; the only sound is the woman's steady\n          WAILING. Then the bald man swings his pistol toward Amy and\n          Jeffs he SHOUTS in MAYAN at them. The other Mayans nock\n          fresh arrows, draw their bows.\n          Jeff takes a step backward, half-raising his hands. Amy just\n          stands there, her eyes on the young Mayan's motionless body.\n\n          JEFF\n\n          AMY...\n          (no reaction)\n\n          AY.\n          She turns, finally. She looks horrified, stupefied; her\n          hands are burned a deep red from the vine's sap. Jeff waves\n          her up the hill. She stares at him for another beat, and\n          then, without a word, starts to climb the trail.\n          Jeff hesitates, watching the Mayans: the bloodied corpse,\n          the raised weapons, the KEENING woman. Then he, too, turns\n          and hurries off up the trail.\n\n          EXT. HILLTOP - THE CLEARING - DAY\n\n          Amy, Jeff, and Eric have taken down the blue tent; its\n          contents lie tumbled in a pile in the little clearing. All\n          three of them look sun struck, sweat-stained, worn out.\n\n          \n\n          \n\n          \n\n          \n\n          63.\n          Eric is using a knife to cut long strips from the blue nylon.\n          Amy is braiding three of the strips together. Jeff has one\n          of the backpack frames, the roll of duct tape, and some of\n          the poles from the tent; he's making a backboard.\n\n          ERIC\n          Maybe we could use it as a weapon,\n          you know? Wrap it around some\n          stones or something. And throw\n          them, like grenades. I mean, if\n          they're that scared of it--\n          Jeff tears off a piece of tape with his teeth.\n\n          JEFF\n          They have guns, Eric. And bows.\n          What do you think they'll do if we\n          start throwing the vine at them?\n          Eric is silenced by this. He cuts another long strip of\n          nylon, passes it to Amy. But he can't seem to stop himself\n          from talking:\n\n          ERIC.\n          So you figure it's, what? Sacred\n          or something? Like, you touch it\n          and you have to die?\n          Amy begins to cry suddenly--a SOB, quickly suppressed. Jeff\n          and Eric both turn to look at her. The vine's sap has\n          scarred her hands and arms almost to the elbows. She wipes\n          her eyes, takes a deep breath, shakes her head.\n\n          AMY\n          I'm okay.\n          But she doesn't look it. Jeff removes his hat, holds it out.\n          Amy just stares at it; he nods for her to take it.\n\n          JEFF\n          Come on. You're burning.\n          She reaches for the hat, puts it on, then wipes at her eyes\n          again. Jeff leans forward, touches her.\n          JEFF (cont'd)\n          We're gonna get through this. All\n          right? We'll pull them up. And\n          then ...I don't know--we'll figure\n          things out. it has to rain at some\n          point. And maybe we can snare some\n          birds. Or--\n\n          \n\n          \n\n          \n\n          \n\n          64.\n          The electronic RINGING sounds once more from the bottom of\n          the shaft. They all turn to stare.\n\n          THE BOTTOM OF THE SHAFT\n          The oil lamp has begun to smoke, adding a haze to the light.\n          Stacy is beside Mathias, holding his hand. She's still\n          pressing Jeff's shirt to her wound. The RING sounds again.\n          Mathias turns his head, peers toward the shaft cut into the\n          dirt wall to his left: that's where it's coming from. Stacy\n          reaches to pick up the lamp, rises to her feet. Another\n          RING. Jeff SHOUTS down from above:\n\n          JEFF (O.S.)\n          Stacy...?\n          Stacy ignores him; she limps around Mathias, starts toward\n          the opening. She hesitates at the mouth of the shaft,\n          lifting her lamp to see better. There's another RING.\n\n          -STACY'S POV -- INTO THE SHAFT\n          The lamp's light doesn't penetrate very far, but WE can SEE\n          that the vine has taken root here with great avidity: it\n          grows thickly on the walls, floor and roof. There's a steady\n          draft coming toward us, and the plant shifts in it, RUSTLING.\n\n          BACK TO SCENE\n          Stacy stands there, looking scared. There's another RING.\n\n          JEFF (O.S.)\n          Can you see it?\n          Stacy lifts her head, SHOUTS:\n\n          STACY\n          No.\n          She keeps peering into the shadows, not moving. The ringing\n          falls SILENT. Stacy turns, hobbles back toward Mathias, and\n          the light shudders, dims for a moment. She squints at it:\n          the oil is nearly gone. She SHOUTS up to the others:\n          STACY (cont'd)\n          The lamp's almost out of oil.\n\n          JEFF (O.S.)\n          Then blow it out.\n\n          \n\n          \n\n          \n\n          \n\n          65.\n          Stacy seems terrified by this.\n\n          STACY\n          Blow it out?\n\n          JEFF (0.5.)\n          We'll need it when we come down.\n          To get him on the backboard.\n          Stacy drops into a crouch beside Mathias, sets the lamp down\n          before her, stares at it. She clearly doesn't want to blow\n          it out. Mathias watches her, silent.\n          JEFF (O.S.) (cont'd)\n          All right?\n          Stacy leans forward, lifts the lamp's glass chimney, blows\n          out the flame, dropping the shaft into darkness.\n\n          EXT. HILLTOP - THE CLEARING - DUSK\n\n          The.sun is just touching the horizon, the sky turning red.\n          Th ey've tied the braids of nylon onto the rope, attached the\n          finished backboard to them. It rests beside the shaft,\n          padded with one-of the archaeologist's sleeping bags.\n          Jeff and Eric remove their belts, drop them onto the\n          backboard. They step to the windlass, lean against its hand\n          crank, the rope going taut. Amy stands by the shaft,\n          gathering her courage. Then she reaches for the backboard.\n\n          THE BOTTOM OF THE SHAFT\n          Mathias and Stacy are two dim shapes in the darkness. The\n          windlass begins its CREAKING. A long beat, and then:\n\n          AMY (O.S.)\n          Stacy?\n\n          STACY\n          What?\n\n          AMY -(0.5.)\n          Light the lamp!\n          Stacy shifts; once again, there's the RASP of a match, then\n          the stronger illumination of the lamp as she lights its wick.\n          Mathias's eyes are shut; there's a deep RAGGEDNESS to his\n          breathing. Stacy looks upward.\n\n          \n\n          \n\n          \n\n          \n\n          66.\n\n          STACY'S POV - ABOVE HER\n          The backboard is dropping toward us. Above it, the light is\n          already fading from the sky.\n\n          BACK TO SCENE\n          Stacy rises to her feet, lifting the lamp.\n\n          ON AMY - CROUCHING ON THE BACKBOARD\n          She's dropping slowly down the shaft, clenching the nylon\n          braids, her eyes tightly shut: terrified. The backboard\n          sways, pendulum-like, as it descends, almost touching the\n          vine-covered walls.\n\n          THE BOTTOM OF THE SHAFT\n          When the backboard comes within reach, Stacy grabs it,\n          pulling it to the-right, so that it will come to rest at\n          Mathias's side. But then, with three feet still to go, it\n          jerks to a halt, almost toppling Amy from her perch.\n          A beat, and Jeff's voice comes toward them from above:\n\n          JEFF (O.S.)\n          Have you reached them?\n\n          AMY\n          Almost. A few more feet.\n\n          JEFF (O.S.}\n          How many?\n          Amy leans, peers down at Mathias's broken body.\n\n          AMY\n          I don't know. Three?\n\n          JEFF (O.S.}\n          we're out of rope.\n          (a beat)\n          Can you still do it?\n          Amy looks at Stacy; neither speaks. Finally, QUIETLY:\n\n          STACY\n          We'll have to send it back up, I\n          guess.\n\n          \n\n          \n\n          \n\n          \n\n          67.\n          Amy doesn't answer. She shifts her weight, and the backboard\n          starts to swing. Stacy reaches to steady it.\n          STACY (cont'd)\n          Blow out the lamp. Wait here in\n          the dark.\n          Amy is silent, staring down at Mathias's still form; it's\n          obvious she doesn't want to do this.\n          STACY (cont'd)\n          Or we could try to lift him, maybe.\n          More silence. Stacy persists:\n          STACY (cont'd)\n          One of us at his shoulders. The\n          other his feet.\n\n          AMY\n          If he twists--\n\n          STACY\n          It's only a few feet.\n          /\"- Once more, Amy is silent. Stacy lifts the lamp, examining\n          it, the diminishing pool of oil.\n          STACY (cont'.d)\n          We have to decide. The light's not\n          going to last.\n          Jeff's voice comes toward them from above again:\n\n          JEFF (O.S.)\n          Amy...?\n          They both look up; the sky has grown too dark to see him.\n          Amy hesitates one beat more, then YELLS:\n\n          AMY\n          We're gonna try itt\n          She climbs off the backboard, crouches beside Mathias. Stacy\n          sets down the lamp.\n          AMY (cont'd)\n          Mathias...?\n          She touches his shoulder, and he opens his eyes, stares at\n          her. He looks haggard, ashen.\n\n          10111..\n\n          \n\n          \n\n          \n\n          \n\n          68.\n          AMY (cont'd)\n          We're going to lift you, okay?\n          We're going to hoist you up and\n          out.\n          Mathias stares from her to the backboard to Stacy. He shuts\n          his eyes. Amy stands up, drags the belts off the backboard,\n          drops them next to the lamp. She positions herself behind\n          Mathias's head; Stacy hobbles to his feet, limping.\n          AMY (cont'd)\n          His hips.\n          Stacy hesitates, looking doubtful.\n\n          STACY\n          You sure?\n\n          AMY\n          If you lift from his feet, he'll\n          bend at the waist.\n\n          STACY\n          But if I lift at his hips, won't he\n          arch his back?\n          They both stare down at Mathis, imagining these two different\n          scenarios. Amy glances toward the lamp, its dwindling oil.\n\n          AMY\n          His knees.\n          Stacy crouches by Mathias's knees, a little off balance,\n          favoring her wounded leg. Amy bends, sliding her hands under\n          his shoulders. Mathias GROANS, and Stacy starts to pull\n          away, but Amy shakes her head.\n          AMY (cont'd)\n          Quickly. On three.\n          They count together:\n\n          STACY AND AMY\n          One ... two.-,.three.\n          They lift, and Mathias immediately starts to SCREAM. His\n          body sags at the waist; he begins to thrash his arms. Stacy\n          starts to set him down, but Amy shakes her head, SHOUTS:\n\n          AMY\n          No!\n\n          \n\n          \n\n          \n\n          \n\n          69.\n          Stacy's wounded leg is hindering her; she can't keep up with\n          Amy. Mathias's shoulders are level with the backboard, but\n          his knees are still a good foot beneath it. He keeps\n          SCREAMING. The bend at his waist increases.\n          AMY (cont'd)\n          Lift I\n          Stacy tries to hoist him higher, lunging, his torso twisting,\n          his SCREAMS going LOUDER. His right arm, hits the backboard,\n          sends it swinging. The girls toss him toward it.\n\n          EXT. HILLTOP - THE CLEARING - NIGHT\n\n          The sun has set. There's a half moon, giving us just enough\n          light to dimly see Eric and Jeff peering into the shaft.\n          Mathias's SCREAMS echo up toward them.\n\n          THE BOTTOM OF THE SHAFT - NIGHT\n          Mathias has fallen silent. He lies on the backboard, eyes\n          clenched, sweat beading his forehead.\n          Stacy is trying not to cry. She watches Amy buckle the two\n          belts together, then drape them over Mathias's chest, knot\n          them tight. Amy strips off her own belt, gestures for Stacy\n          to do the same. She buckles these together, too.\n\n          STACY\n          I have to pee.\n          She limps toward the wall, lowers her pants, gingerly\n          crouches. She stares toward the other shaft as she pees:\n          its stone archway, the shifting shadows, the vine rustling\n          softly in the steady draught.\n          Amy binds Mathias at his thighs. She WHISPERS to him:\n\n          AMY\n          You okay?\n          She waits, but he doesn't respond. His eyes remain shut.\n          Stacy rises, buttoning her pants, limps back toward Amy.\n          She's on the edge of tears, is working hard to fight them\n          off. Amy lifts her head, SHOUTS up to Jeff:\n          AMY (cont'd)\n          Pull him up!\n\n          \n\n          \n\n          \n\n          \n\n          70.\n          A moment's pause, then the windlass begins to CREAK once\n          more. The backboard slowly rises, swaying gently. They\n          watch it climb away from them. Amy holds out her-hand.\n          ANY (cont'd)\n          Here.\n          Stacy just stares at her, not understanding. Amy nods at the\n          lamp: the oil is gone.\n          AMY (cont'd)\n          It's gonna go out.\n          And it's true: as Stacy reaches for Amy's hand, the light\n          suddenly flickers, dims, drops them into darkness.\n\n          EXT. CLEARING/BASE OF THE HILL - NIGHT\n\n          The Mayans are settling into sleep at their campsite. Three\n          of the men remain on guard duty in the clearing, facing the\n          hillside, their backs to the fire. The young Mayan's corpse\n          still lies in the dirt, fifteen feet in front of them. The\n          firelight throws shadows across his bloodied body.\n\n          EXT. HILLTOP - THE CLEARING - NIGHT'\n\n          The windlass CREAKS loudly as Eric and Jeff work to wind in\n          the rope. Stacy has already been pulled up from the hole.\n          She's sitting beside Mathias, who's lying on the backboard,\n          on the edge of the clearing, by the orange tent.\n          Amy emerges from the shaft, dangling beneath the sawhorse.\n          Jeff holds the rope taut while Eric steps to the hole, pulls\n          Amy toward him. Stacy watches from beside the backboard.\n          Mathias's eyes are shut, his breathing ROUGH with phlegm.\n          No one speaks. Once Amy is free of the sling, they all move\n          to the backboard. Eric takes Stacy's-hand; Jeff crouches,\n          starts to undo the belts.\n\n          ERIC\n          Shouldn't we carry him into the\n          tent first?\n          Jeff pulls free the first belt, shifts to the second one.\n\n          JEFF\n          We can't.\n\n          ERIC\n          Because?\n\n          \n\n          \n\n          \n\n          \n\n          71.\n\n          JEFF\n          He's gonna keep leaking urine.\n\n          AMY\n          But we can't just leave him out in\n          the open.\n\n          JEFF\n          We'll rig a shelter. With what's\n          left of the blue tent.\n          Jeff pulls the second belt free. Mathias's eyes remain shut.\n          JEFF (cont'd)\n          One of us should stay on watch\n          while the others sleep. Two hour\n          shifts.\n          He reaches for his knapsack, unzips it. He pulls out a liter\n          bottle of water.\n          JEFF (cont'd)\n          .Once it's light, we'll figure out\n          how much water we have, and how to\n          ration it. Food, too. For now, I\n          think we should each just take a\n          single swig.\n          He uncaps the bottle, hands it to Amy. He watches her drink\n          from it. When she's done, she passes it to Stacy.\n          JEFF (cont'd)\n          Eric and I'll build the shelter,.\n          then I'll take the first shift.\n          You two should try to sleep.\n          Stacy takes her single sip, passes the bottle to Eric.\n\n          INT. ORANGE TENT - NIGHT\n\n          Stacy and Amy have pushed the camping supplies into a pile\n          along the tent's rear wall. Stacy pulls off her pants, bends\n          to examine her wound in the darkness. Amy is beside her,\n          lying on her side. A beat of silence. Then, WHISPERING:\n\n          STACY\n          Amy?\n          what?\n\n          \n\n          \n\n          \n\n          \n\n          72.\n\n          STACY\n          We shouldn't have lifted him,\n          should we?\n          Amy reaches, pats Stacy's hand.\n\n          AMY\n          Shh.\n\n          STACY\n          He's never gonna walk again.. He's--\n\n          AMY\n          Don't, Stacy. Don't talk. It'll\n          only make things worse.\n          Stacy falls silent.\n          AMY (cont'd)\n          Just go to sleep, okay? Let's try\n          to go to sleep.\n          Stacy lies down next to Amy, in her-underwear and T-shirt.\n          They huddle close together in the darkness.\n\n          EXT. HILLTOP - THE CLEARING - NIGHT\n\n          Eric is building a tiny lean-to for Mathias, using the duct\n          tape, the leftover nylon and poles from the blue tent. Jeff\n          crouches over the backboard. He starts to cut Mathias's\n          jeans off him with the knife. Mathias's eyes remain shut.\n\n          ERIC\n          What're you doing?\n\n          JEFF\n          We have to keep him clean.\n          He slices the jeans, from ankle to hip, first one leg, then\n          the other, struggling not to jostle Mathias's body.\n          JEFF (cont'd)\n          That's how it'll happen, I think.\n          if it does.\n\n          ERIC\n          If what does?\n          Jeff slides the soiled strips of-denim out from under\n          Mathias's body, tosses them aside. He LOWERS his voice:.\n\n          \n\n          \n\n          \n\n          \n\n          73.\n\n          JEFF\n          If he dies here. infection. Blood\n          poisoning--something like that.\n          Eric seems startled by this.\n\n          ERIC\n          You think he's gonna die?\n\n          JEFF\n          (he shrugs)\n          His back is broken. Who knows what\n          else.\n          Eric is silent, motionless, the tape in his hand. Mathias's\n          BREATHING seems to be getting steadily worse. Jeff bends to\n          cut off his boxers, first one leg, then the other. He tosses\n          the soiled fabric aside.\n          JEFF (cont'd)\n          We should go back down in the\n          morning.\n\n          ERIC\n          Down?\n\n          JEFF\n          Into the shaft. Try to find the\n          phone again.\n\n          ERIC\n          There's no oil for the lamp.\n          Jeff waves toward the orange tent.\n\n          JEFF\n          There's tequila. We could pour it\n          on some of the clothes, tie them\n          around one of these poles, make a\n          torch.\n          A sleeping bag is lying in the clearing among the strips of\n          nylon and aluminum poles. Jeff steps over to pick it up.\n          JEFF (cont'd)\n          Without the phone, he's dead. If\n          we have to wait for someone to come\n          searching...\n          He shakes his head. Then he leans forward and carefully\n          drapes the sleeping bag across Mathias's broken body.\n\n          \n\n          \n\n          \n\n          \n\n          74.\n\n          INT. ORANGE TENT - DAWN\n\n          The orange nylon is just starting to glow with the sun's\n          arrival. Stacy and Eric lie beneath one of the sleeping\n          bags, Eric's head on her shoulder. Jeff lies curled on his\n          side, a few feet away, still shirtless.\n          Jeff's eyes open. He sits up, stares about, then reaches for\n          one of the backpacks. He quietly digs through it till he\n          finds a T-shirt. He sniffs at it, then pulls it on.\n\n          EXT. HILLTOP - THE CLEARING - DAWN\n\n          Mathias lies on his backboard, eyes shut, his breathing still\n          sounding THICK WITH PHLEGM. Amy sits beside him, hunched\n          into herself, half drowsing. She lifts her head as Jeff\n          emerges from the tent, stares at him.\n\n          JEFF\n          How is he?\n\n           AMY\n          The same.\n\n          JEFF\n          And you?\n\n          AMY\n          (she shrugs)\n          Tired. Thirsty. Hungry.\n\n          JEFF\n          Once the others are up, we'll have\n          some water.\n          His face is stubbled, sweat-stained. He looks ragged; they\n          both do. He steps to the opposite side of the clearing,\n          unzips, begins to urinate, with his back to Amy.\n\n          JEFF'S POV - ACROSS THE HILLTOP\n          The vine covers everything, tangled and matted, with those\n          odd, knoll-like growths scattered among it. The nearest-is\n          thirty feet away. its leaves are swaying slightly in a faint\n          breeze, and WE SEE a flash of yellowish white beneath them.\n\n          \n\n          \n\n          \n\n          \n\n          75.\n\n          BACK TO SCENE\n          Jeff finishes, shakes, zips, then steps out into the vine,\n          wading toward the tiny mound. Amy remains beside the\n          backboard; she watches him crouch, part the tendrils, stare.\n\n          ANY\n          What is it?\n          Jeff gestures for her to approach. When she reaches him, he\n          leans forward, pulls aside the vines. WE SEE a man's skull,\n          a loose tumble of bones. Amy INHALES sharply, recoiling.\n\n          JEFF\n          Bodies. All of them.\n          He waves across the hilltop, at the other mounds: there are\n          more than a dozen. Amy takes them in. The light is gaining\n          strength, the green leaves seeming to shine in it, the red\n          flowers to glow. Jeff's face assumes a puzzled expression.\n          JEFF (cont'd)\n          Where are the birds?\n\n          AMY\n          Birds?\n\n          JEFF\n          it's dawn--there should be birds.\n          They both stare off across the hillside: so quiet, so still.\n\n          INT. ORANGE TENT - DAY\n\n          Stacy opens her eyes. She lies there, struggling to orient\n          herself, with Eric on her shoulder. She starts to roll onto\n          her side, then stops, looking confused.\n          She reaches under the sleeping bag, toward her leg, her\n          confusion changing to alarm. She site up, jarring Eric\n          awake, and throws back the sleeping bag.\n\n          ERIC\n\n          (BEFUDDLED)\n          What...?\n          The vine has grown dramatically during the night, reaching\n          out from the pile of supplies at the rear of the tent to\n          spread across Stacy's right leg, almost to her waist. She\n          sits up, tries to push it off her.\n\n          \n\n          \n\n          \n\n          \n\n          76.\n\n          STACY\n          Oh my god...\n          The vine is clinging to her; she has to tear it, the sap\n          shining slickly on her hands, visibly beginning to burn the\n          skin. She yanks at the tendrils, tossing them aside.\n          STACY (cont'd)\n          Help me.\n          Eric sits up, still only half-awake. He just stares.\n          STACY (cont'd).\n          It's inside me...\n          It's true: one of the tendrils has pushed its way into the\n          wound on her leg, widening it, thrusting itself a full three\n          inches into her body, like a thick finger.\n          STACY (cont.'d)\n          Oh, Jesus--it's fucking inside me.\n          She tries to pull the tendril out, but she's too panicky, too\n          quick, and the vine breaks, leaving a piece of itself snagged\n          under her skin. Stacy starts to SCREAM:\n          STACY (cont'd)\n          Get the knifes\n          Eric is too shocked to stir. He's staring down at her leg,\n          at the bulge beneath her skin: it looks as if it's moving.\n\n          EXT. HILLTOP - THE CLEARING - DAY\n\n          Stacy's SCREAMING continues. Jeff and Amy are on their feet,\n          hurrying across the clearing. Mathias has opened his eyes.\n\n          STACY (O.S.)\n          Get the knife!\n          Jeff bends, scoops up the knife, starts toward the tent. He\n          waves toward Mathias.\n\n          JEFF\n          Stay with him.\n          Then he ducks in through the tent's flap.\n\n          \n\n          \n\n          \n\n          \n\n          77.\n\n          INT. ORANGE TENT - DAY\n\n          Eric is beside Stacy, trying to calm her; she's started to\n          CRY. Her hands and wrists have turned a dark red, and the\n          tendril is inside her leg, just to the left of her shin,\n          running parallel to it. Jeff steps. toward them.\n\n          JEFF\n          What is it?\n\n          ERIC\n          The vine. It's inside her.\n          Stacy points to her wound, SOBBING now:\n\n          STACY\n          Cut it out. You gotta cut it out.\n\n          JEFF\n          The blade's dirty. We should--\n          Stacy starts shaking her head, FRANTIC:\n\n          STACY\n          It's moving! Can't you see?\n          Jeff stares at the bulge, hesitating. Then it moves,\n          unquestionably: contracting and expanding, like a worm.\n          Stacy SHRIEKS:\n          STACY (cont'd)\n          Jeff!\n          Be gives in, crouching over her leg.\n\n          JEFF\n          It's gonna hurt.\n\n          STACY\n          Please. Hurry.\n          He leans forward, slices into the skin above the bulge.\n          Stacy CRIES OUT, starts to jerk away, but Jeff presses down\n          on her leg, holding her still. He reaches into her wound\n          with his finger, digs out the piece of vine, tosses it aside.\n\n          JEFF\n          Get me a shirt or something.\n          He gestures toward the backpacks, and Eric unzips one of\n          them, starts to dig through it.\n\n          \n\n          \n\n          \n\n          \n\n          78.\n          He pulls out a T-shirt, hands it to Jeff. Jeff wads it up,\n          uses it to put pressure on the incision, staunching the flow\n          of blood.\n\n          EXT. HILLTOP - THE CLEARING - DAY\n\n          Amy is crouched by the backboard, watching the tent, trying\n          to grasp what's happening. Mathias startles her by speaking:\n\n          MATHIAS\n          Something's... wrong...\n          His voice is thick-sounding, very faint. Amy tries to soothe\n          him; she puts her hand on his shoulder.\n\n          AMY\n          It's okay. It's just--\n\n          MATHIAS\n          my-legs...\n\n          AMY\n          I know. You're hurt. But we're.,\n          gonna get you--\n\n          MATHIAS\n          Show ...me...\n          He's struggling to rise, straining upward. Amy tries to stop\n          him, pressing down on his shoulder.\n\n          AMY\n          Shh.\n          But he fights her; he won't be quieted:\n\n          MATHIAS.\n          Show-me...\n          So she leans, lifts the sleeping bag off him. His lower legs\n          are completely covered by the flowering vine, from the knees\n          down. Amy and Mathias both stare in surprise. Then Amy\n          reaches, starts to yank the tendrils free.\n\n          INT. ORANGE TENT - DAY\n\n          Jeff is leaning forward, pressing the balled-up T-shirt\n          against Stacy's wound, the blood darkening the fabric. Stacy\n          is lying there, her eyes shut, fists clenched.\n\n          STACY\n          I can still feel it.\n\n          \n\n          \n\n          \n\n          \n\n          79.\n          Jeff shakes his head.\n\n          JEFF\n          I got it out.\n\n          STACY\n          I can feel it moving.\n\n          JEFF\n          That's just your body. Your muscle\n          twitching.\n\n          STACY\n\n          BUTÂ\u0080\u0094\n\n          ERIC\n          It's on our clothes.\n          Stacy and Jeff both glance at him. There's a faint, almost\n          fungus-like green growing on his shirt, an infantile version\n          of the vine covering the hillside all around them. It's on\n          all of them: their shirts, their pants, their shoes.\n          Before any of them can respond to this development, Amy\n          starts to CALL from the clearing, sounding SCARED:\n\n          AMY (O.S.)\n          Jeff...?\n          They all turn toward the flap. Mathias begins to SCREAM.\n          Amy's voice JUMPS in volume:\n           AMY (O.S.) (cont'd)\n          of .I\n          Jeff rises, moves toward the flap.\n\n          EXT. HILLTOP - THE CLEARING - DAY\n\n          Amy is crouched over Mathias, frantically yanking the vines\n          off him. Mathias is struggling impotently to sit up. He\n          continues to SCREAM, staring down at his legs.\n          Jeff emerges-from the tent, hurries to help Amy, both of them\n          tearing at the vine, a flash of white appearing beneath the\n          green, shiny and bright: bones. Mathias's legs have been\n          stripped completely clean of flesh from the knee down.\n          As they keep pulling the tendrils free, blood starts to drip\n          from Mathias's knees, slowly at first, but then suddenly\n          spurting, spraying them: their chests, their faces. Amy\n          jerks backward, GAGGING, RETCHING.\n\n          \n\n          \n\n          \n\n          \n\n          80.\n          She jumps up, takes three steps into the center of the\n          clearing, and VOMITS, her hands on her knees. She wipes at\n          the blood on her face, COUGHS, spits, then bends again,\n          another long ribbon of puke slipping free of her.\n          Mathias continues to SCREAM and thrash. Jeff reaches for the\n          belts, lying in the dirt beside the backboard. He quickly\n          ties first one then another around Mathias's legs, twisting\n          them into tourniquets, cutting off the flow of blood.\n          Stacy and Eric stoop out through the tent's flap: they stand\n          there staring, struggling to grasp what's happened. Stacy is\n          in her underwear and T-shirt, blood still seeping down her\n          leg. Amy turns to face them.\n          Mathias is WEEPING now, his eyes shut. The hemorrhaging has\n          stopped; blood lies in puddles across the backboard. Jeff is\n          covered with it. And then there are the bones: so white, so\n          wet-looking, from the knees down, nothing but bone.\n          Suddenly, Stacy starts to SCREAM, pointing past Amy, at the\n          dirt beyond her. They all turn to look.\n          The vine is in motion, a long tendril slipping into the\n          clearing, moving snakelike toward the puddle of vomit at\n          Amy's feet. Amy backs quickly away.\n          A second tendril emerges from the low wall of green around\n          the clearing, then a third. They move rapidly, as if racing\n          each other; both of them slipping alongside the first into\n          the little pool of vomit.\n          The tendrils absorb the puke, draining it, until all that's\n          left is a damp shadow on the rocky soil. Then they withdraw\n          back across the clearing, silently retreating into the larger\n          mass of green. Stacy keeps SCREAMING.\n\n          EXT. CLEARING/BASE OF THE HILL - DAY\n\n          Faintly, from up the hill, WE HEAR Stacy's screams. The\n          Mayans are finishing their morning meal. They eat in\n          silence, showing no reaction to the sound. In the clearing,\n          the young Mayan's corpse is buried beneath a thick growth of\n          vine.\n\n          EXT.. HILLTOP - THE CLEARING - DAY\n\n          The four of them are sitting by the orange tent. Jeff and\n          Amy are still spattered and smeared with Mathias's blood;\n          Stacy is still in her underwear.\n\n          \n\n          \n\n          \n\n          \n\n          81.\n          e.-\n          Jeff is inventorying their food and water. The others watch\n          as he puts the perishables in a separate pile: two bananas,\n          a plastic bag ofgrapes going brown, an orange, a soggy tuna\n          fish sandwich.\n\n          JEFF\n          They must've dug it up.\n\n          ANY\n          Who?\n          He arranges the rest of the food in a second pile: a bag of\n          pretzels, a can of nuts, two protein bars, a box of raisins.\n\n          JEFF\n          The miners.\n          He puts the liquids in a third pile: three bottles of water,\n          two of iced tea, a can of Coke. That's all there is.\n          JEFF (cont'd)\n          And then the Mayans cleared the\n          jungle around the hill, I guess.\n          To keep it quarantined. That's why\n          they won't let us leave, don't you\n          think? They're afraid we'll spread\n          it?\n          The others are silent. Jeff reaches for the tuna fish\n          sandwich. He carefully unwraps it.\n          JEFF (cont'd)\n          Or else...I don't know. Maybe it's\n          something religious? And we're\n          some sort of sacrifice?\n          He glances at the others, but once again no one responds.\n          They all look dazed: knocked back into themselves. Jeff\n          picks up the knife, wipes it on his jeans.\n          JEFF (cont'd)\n          They must've done the same thing\n          with the archaeologists. And\n          Henrich. Trapped them here. Like\n          us.\n          He cuts the sandwich into four equal sections.\n          JEFF (cont'd)\n          And then somehow it killed them\n          off. All of them. one by one.\n          This is too much for Eric; he.leaps up, looking panicky.\n\n          \n\n          \n\n          \n\n          \n\n          82.\n\n          J011\n\n          ERIC\n          We have to find the phone. We have\n          to go back down and--\n          Jeff makes a calming motion.\n\n          JEFF\n          We'll eat first. Drink some water.\n          We have to stay calm. Not rush at\n          things.\n          He holds out one of the tiny squares of sandwich. Eric\n          hesitates, then accepts it, dropping back into a crouch.\n          Jeff hands Amy her square.\n\n          AMY\n          What about Mathias?\n          She nods toward him, and they all turn to look. From his\n          knees down, Mathias's legs are nothing but bone, tendon, and\n          ropy clots of blackened blood. His face looks gray. His\n          eyes are shut, and his breathing sounds terribly RAGGED.\n\n          JEFF\n          He wouldn't be able to stomach it.\n          Jeff offers Stacy her ration. She takes it, but almost\n          absentmindedly. She seems distracted; she keeps prodding at\n          her wound with her fingertip.\n          JEFF (cont'd)\n          Stop it, Stacy.\n\n          STACY\n          It's still in there. I can feel\n          it.\n          She keeps probing. Jeff shakes his head, a little it' ATIENT:\n\n          JEFF\n          I told you. I got it out.\n          Jeff pops his square of sandwich into his mouth; Eric and Amy\n          eat theirs, too. Stacy's ration remains in her hand; she\n          seems to have forgotten it. She's sunburned, sweat-stained,\n          glassy-eyed. Eric leans toward her, looking worried.\n\n          ERIC\n          Eat, Stacy. You have to eat.\n          She places the tiny sandwich into her mouth, chews, swallows,\n          staring at her wound the whole time. Then:\n\n          \n\n          \n\n          \n\n          \n\n          83.\n\n          STACY\n          See? How puffy it is?\n\n          ERIC\n          That's just swelling. It's\n          natural.\n          (he turns toward Jeff)\n          Right?\n\n          JEFF\n          (he nods)\n          It's what happens when you get\n          hurt.\n          Jeff picks up one of the water bottles, twists off its-cap.\n          He offers the bottle to Stacy.\n          JEFF (cont'd)\n          one swallow apiece.\n          The bottle makes its way around their little circle. When it\n          returns to Jeff, he takes his sip, caps the bottle. Eric is\n          watching Stacy, her anxious probing; he looks increasingly\n          distressed by it. He jumps up again.\n\n          ERIC\n          The phone. Let's find the phone.\n          Jeff doesn't move. Stacy's bloodied khakis. are lying in the\n          dirt beside him, and he reaches for them, starts to cut off\n          their legs with the knife, just above the knee.\n\n          JEFF\n          We need to take care of Mathias,\n          first. He won't last much longer\n          like that.\n          Amy looks appalled; she makes a shushing motion.\n\n          ANY\n          Shh.\n          They all glance toward Mathias again. He lies there, eyes\n          shut, breathing in and out with that fluid-filled RASP. He\n          seems to be unconscious, but Jeff still LOWERS his voice:\n\n          JEFF\n          We have to cut them off.\n\n          ERIC\n          Cut what off?\n\n          \n\n          \n\n          \n\n          \n\n          84.\n\n          JEFF\n          His legs.\n          He's finished with Stacy's khakis; they've been transformed\n          into a pair of shorts. He tosses them toward her. Eric and\n          Amy are staring at him, shocked into silence. Then:\n\n          ERIC\n          You're joking.\n\n          JEFF\n          He'll die if we don't.\n\n          AMY\n          Without anaesthesia?\n\n          JEFF\n          There won't be any pain. He has no\n          feeling beneath his waist.\n\n          ERIC\n          He'll lose too much blood.\n\n          JEFF\n          The tourniquets are already in\n          place. We'll cut below them.\n\n          ERIC\n          With what?\n          Jeff holds up the knife. Eric SCOFFS at the idea:\n          ERIC (cont'd)\n          That wouldn't do a thing. You'd\n          need a bone saw.\n\n          JEFF\n          We could break the bones. Then\n          cut.\n          Amy is shaking her head; she looks mortified.\n\n          AMY\n          No, Jeff. No way.\n\n          ERIC\n          What about infection? Cutting into\n          him with a dirty knife?\n\n          JEFF\n          We'll sterilize it. Build a fire.\n          Heat the blade in the flames.\n          It'll cauterize as it cuts.\n\n          \n\n          \n\n          \n\n          \n\n          85.\n\n          A \n\n          AMY\n          You'll kill him.\n\n          JEFF\n          Or save him. One or the other. We\n          can't just--\n\n          STACY\n          Cut me first. Right here.\n          Stacy has stood up, pulled on the shorts Jeff has fashioned\n          for her. She's bent over, pointing at a spot on her leg, a\n          few inches below the last incision.\n          STACY (cent'd)\n          Sterilize the knife and--\n          Eric steps toward her, tries to soothe her.\n\n          ERIC\n          There's nothing there, Stacy. It's\n\n          JUST--\n          She hardly seems to hear him. She's frightened, growing a\n          little wild with it. Her voice comes FAST AND HIGH:\n\n          STACY\n          It's moving. I can feel it moving.\n\n          ERIC\n          You're imagining it. You're\n          scared, and you--\n\n          STACY\n          I gotta get out of here. I gotta\n          get to a hospital. I gotta--\n          Eric takes her hand, squeezing it. Stacy blinks at him,\n          close to tears.\n\n          ERIC\n          You have to calm down. Can you do\n          that? Can you try to calm down?\n          Stacy pulls free of him, drops into a crouch, hugging her\n          knees to her chest, her eyes shut.\n\n          STACY\n          See if there's a signal.\n\n          ERIC\n          A what?\n\n          \n\n          \n\n          \n\n          \n\n          86.\n\n          STACY\n          Your phone. Check your phone.\n          Eric doesn't move: he knows there's no point.\n          STACY (cont'd)\n          Check it.\n          Eric SIGHS, steps to his pack, crouches to remove his phone.\n          He flips it open, holds it out to Stacy. She stares down at\n          it: there's no signal. Eric drops it back into his pack.\n          Then he turns to Jeff.\n\n          ERIC\n          We go back down. We find the other\n          phone. We call for help. That's\n          how we get out of here. That's how\n          we save him.\n\n          JEFF\n          It'11 take too long.\n\n          ERIC\n          One call, Jeff. They'll be here by\n          sundown.\n\n          JEFF\n          And Mathias will already be dying.\n          You understand? There's no flesh\n          covering his bones. They're--\n          Mathias's voice interrupts him, from the backboard. Very\n          HOARSE, barely audible:\n\n          MATHIAS\n          Do...it...\n          They all turn, stare toward him. His eyes are open.\n          MATHIAS (cont'd)\n          Please...\n          (a beat)\n          Cut... them... off...\n          He slowly, painfully, extends his left hand toward them, a\n          beseeching gesture.\n\n          CU - SMALL PILE OF CLOTHES\n          A pair of shorts, a woman's blouse, two black socks.\n\n          \n\n          \n\n          \n\n          \n\n          87.\n\n          JEFF (O.S.)\n          I'll have to break the bones first.\n          An amber liquid is being poured onto the clothes, very\n          slowly. WE PULL BACK TO REVEAL:\n\n          EXT. HILLTOP - THE CLEARING - DAY\n\n          Eric is crouched, dribbling the tequila onto the clothes,\n          pausing to let it soak in, saturating the fabric. Jeff is\n          kneeling by the backboard, talking to Mathias.\n\n          JEFF\n          With the stone. Then I'll use the\n          knife to cut.\n          A large stone sits beside the pile of clothes, shaped like an\n          ax head. There's the knife, too, and the metal canteen from\n          the orange tent.\n          JEFF (cont'd)\n          We'll heat the canteen, and\n          cauterize the wounds with it. To\n          stop the bleeding.\n          Eric strikes a match: the clothes catch instantly, burning\n          with a low blue flame. He sets the knife in the fire, then\n          the stone, and splashes more tequila on them. The girls\n          stand in the center of the clearing, watching.\n          JEFF (cont'd)\n          You shouldn't be able to feel a\n          thing. But you can bite this if\n          you want. Just in case.\n          He holds up one of the belts. Mathias hesitates, then opens\n          his mouth, and Jeff sets it carefully inside. Mathias clamps\n          down, gripping it between his teeth. Jeff glances at Eric.\n          JEFF (cont'd)\n          Ready?\n          Eric nods.- The stone is making a cracking sound in the fire,\n          glowing a.deep red. Jeff turns back to Mathias.\n          JEFF (cont'd)\n          You?\n          Mathias also nods, shutting his eyes. There's a small towel\n          in the dirt beside Jeff, and he. picks it up, wrapping it\n          around his hand. He looks over his shoulder at the girls.\n          They both seem terrified, shaky with it.\n\n          \n\n          \n\n          \n\n          \n\n          88.\n          JEFF (cont'd)\n          You should wait in the tent.\n          Amy starts to shake her head, but then Stacy is in motion,\n          grabbing her hand, pulling her across the clearing, and she\n          lets herself be led.\n          Jeff watches them vanish through the flap, then reaches\n          toward the fire with his towel-swathed hand. He scoops up\n          the stone, raises it over his head, SLAMS it down with all\n          his strength against the exposed bones of Mathias's left leg.\n          Mathias bucks, GROANING; his eyes jump open. Jeff drops the\n          stone back into the fire,. snatches out the knife. Mathias is\n          trying to rise onto his elbow, straining to see what's\n          happening.\n          JEFF (cont'd)\n          Hold him.\n          Eric sets the canteen into the flames, sloshes some tequila\n          on it, then shifts.to the backboard. He presses down on\n          Mathias''s shoulders. Mathias is WHIMPERING, twisting his\n          head back and forth, gripping the belt tightly in his teeth.\n          Jeff starts to saw with the knife, chopping and cutting the\n          splintered bones. Bloody marrow spills wetly out, and then\n          Mathias's.lower leg comes free of his body, the foot and\n          ankle and shin bones completely separate now.\n          Jeff lifts the bones away, drops them into the dirt beside\n          the backboard. Then he turns, uses the towel to pluck the\n          canteen out of the fire: it, too, is glowing red.\n          He presses the canteen flat against Mathias's stump, the\n          flesh SIZZLING and SPITTING. Mathias bucks even more\n          forcefully; he spits out the belt, CRIES OUT:\n\n          MATHIAS\n          Stop...stop...\n          Jeff ignores him, dropping the canteen back into the fire,\n          lifting out the stone. Eric looks increasingly mortified; he\n          seems close to tears.\n\n          ERIC\n\n          JEFF--\n\n          JEFF\n          Reep him still.\n          He turns, SMASHES the stone into Mathias's right leg.\n          Mathias begins to SCREAM, bucking against Eric's grip.\n\n          \n\n          \n\n          \n\n          \n\n          89.\n\n          INT. ORANGE TENT - DAY\n\n          Mathias's SCREAMS fill the tent. Amy and Stacy are sitting\n          together, clutching each other; Stacy is CRYING. Amy is\n          staring toward the flap with a look of horror.\n\n          EXT. HILLTOP - THE CLEARING - DAY\n\n          Jeff saws and chops at the shattered bones with the knife.\n          Mathias continues'to SCREAM. Eric is using all his weight to\n          hold him still, his head averted, his eyes clenched shut.\n          Jeff lifts the severed bones.away from the backboard, drops\n          them at his side. Then he scoops up the canteen again. As\n          he presses it to Mathias's stump, Mathias finally passes out,\n          his body going slack, his screams falling SILENT.\n          For a long beat, there's just the SPITTING, SNAPPING sound of\n          Mathias's flesh being seared. Then Eric pulls back into a\n          crouch, shaking his head, looking utterly depleted.\n\n          ERIC\n          Oh, Jesus. Jesus Christ.\n          Amy emerges from the tent, then Stacy. They stand staring.\n\n          AMY\n          He felt it, didn't he? The whole\n          thing.\n          Jeff lifts the canteen away.\n\n          JEFF\n          He couldn't have.\n\n          AMY\n          He was screaming. Be was telling\n          you to stop.\n\n          JEPF\n          It was just seeing it. Looking\n          down, and--\n          Amy is shaking her head, staring at Mathias with that\n          appalled expression: his slack face, his burned stumps.\n\n          AMY\n          This is bad, Jeff. So bad.\n          Jeff leans to loosen first one tourniquet, then the other.\n\n          \n\n          \n\n          \n\n          \n\n          90.\n\n          JEFF\n          We've bought him some time. He\n          wouldn't have--\n\n          AMY\n          You cut off his legs! You--\n          Stacy SCREAMS, pointing toward Mathias's amputated limbs.\n          They're lying in the dirt at the base of the backboard, the\n          bloodstained bones held together with a few remaining cords\n          of flesh. A vine has come snaking into the clearing: it's\n          wrapping itself around one of the feet.\n          As the tendril begins to drag. the bones away, a.second one\n          slithers forward and lays claim to the other foot.\n          Eric grabs the knife, jumps up, steps on the first tendril,\n          bends to slash at it with the blade. He swoops toward the\n          second one. Even as he does so, though, a third tendril\n          slithers into the clearing, then a fourth.\n          Stacy SCREAMS again, short and loud, and backs toward the\n          tent; Eric bends and slashes, bends and slashes, and the'vine\n          keeps coming, from all directions, reaching for the bones.\n\n          JEFF\n          Leave it.\n          Eric ignores him, cutting and stomping and tearing at the\n          tendrils, faster and faster, but still too slow, the vine\n          fighting back, wrapping itself around his legs.\n          JEFF (cont'd)\n          Eric.\n          He steps toward him, grabs his arm, pulls him away. They\n          stand side by side, watching as the vine pulls the severed\n          limbs into itself, the white of the bones vanishing into the\n          larger mass of green. Stacy has begun to CRY again.\n          There's a beat of stillness, and then, once more, echoing up\n          toward them from the shaft, comes that faint electronic\n          RINGING of the cell phone.\n\n          CU - THE WINDLASS\n          Spinning, the rope spooling quickly off the barrel.\n\n          JEFF (O.S.)\n          I don't know how long it'11 burn--\n\n          WE PULL BACK TO REVEAL:\n\n          \n\n          \n\n          \n\n          \n\n          91.\n\n          EXT. HILLTOP - THE CLEARING - DAY\n\n          Eric is pulling the rope off the windlass, laying it out in a\n          long zigzag across the clearing. Jeff is crouched by the\n          shaft, making a torch. The girls stand over him, watching.\n\n          JEFF\n          So you'll have to be quick.\n          He has one of the aluminum poles from the blue tent. He's\n          wrapped duct tape around its bottom for a grip, tied some of\n          the archaeologists' clothes around the top. He's dribbling\n          tequila on the knot of fabric, saturating it.\n          JEFF (cont'd)\n          Wait to light it till you're both\n          down there. Then--\n\n          STACY\n          Who?\n          Jeff looks up at her, startled by the question. Eric is\n          moving along the length of rope, bent low, checking its hemp\n          for signs of weakness.\n\n          JEFF\n          Who what?\n\n          STACY\n          Who's going?\n\n          JEFF\n          You and Amy.\n          They all look bad, but Stacy looks the worst: her wounded\n          leg,, -her greasy hair, a panicky edge to every gesture. She\n          shakes her head, with vehemence.\n\n          STACY\n          No, Jeff. No way. Not me.\n          Jeff caps the tequila bottle, gives Stacy a tired look.\n\n          JEFF\n          We've already been through this.\n          Eric and I need to work the winch.\n          You're not strong enough.\n          Eric has reached the end of the rope; he stands up, wiping\n          his hands on his pants.\n\n          \n\n          \n\n          \n\n          \n\n          92.\n\n          ERIC\n          It's clear.\n          He moves to the windlass, starts to wind the rope back onto\n          the barrel. They've tied a sling on the rope's end again.\n          Stacy is pressing her right hand against the bottom of her\n          rib cage: massaging, probing\n\n          STACY\n          Why can't Amy go on her own?\n\n          JEFF\n          The torch won't last that long. We\n          need you both there, searching.\n          Stacy starts shaking her head again, TERRIFIED:\n\n          STACY\n          I'm not going. I can't.\n\n          JEFF\n          You don't have a choice, Stacy.\n          Amy can see where this is headed; she tries to divert it.\n\n          AMY\n          It's okay. I'll go alone.\n          Jeff ignores this. He rises to his feet, still focused on\n          Stacy. WE can HEAR his growing anger in his voice:\n\n          JEFF\n          if we don't find the phone, Mathias\n          will die. Understand?\n          Stacy is silent, hugging herself, staring at the ground.\n          Eric has finished winding the rope onto the windlass. He\n          tries to intervene:\n\n          ERIC\n\n          JEFF--\n          Jeff ignores him, his gaze on Stacy.\n\n          JEFF\n          So that's what you're saying. Just\n          to be clear. That you're not\n          willing to help him live.\n\n          ERIC\n          Come on, man. She's too scared.\n\n          \n\n          \n\n          \n\n          \n\n          93.\n\n          JEFF\n          I don't give a fuck. I'm scared,\n          too. We all are.\n\n          ERIC\n          it was inside her.\n\n          JEFF\n          And we got it out. Now she needs\n          to stop being such a fucking baby,\n          stop being so selfish, and--\n          Eric is stepping toward him suddenly, right up against him,\n          forcing him back a step.\n\n          ERIC\n          ,hut Up. Okay?\n          He's bigger than Jeff, stronger, and this is suddenly very\n          palpable. Their faces are three inches apart. A tense beat,\n          and then, more QUIETLY:\n          ERIC (cont'd)\n          You're being too hard.\n          Jeff gives him a look of incredulity, almost disgust.\n\n          JEFF\n          Hard?\n\n          ERIC\n          Just leave her be.\n          Jeff turns away from him, from all three of them. He stares\n          off across the hill for a beat, then shakes his head.\n\n          JEFF\n          I'm the only one thinking. I'm\n          carrying the whole fucking load.\n\n          ERIC\n          So stop. Lay it down.\n          Jeff turns back to him, gives him a look of pure contempt; WE\n          can HEAR his fury rising again as he speaks:\n\n          JEFF\n          This isn't just going to work out\n          on its own, Eric. You know?\n          Magically?\n\n          ERIC\n          I'm not saying--\n\n          \n\n          \n\n          \n\n          \n\n          94.\n\n          JEFF\n          We could end up dead here. All of\n          us. Is that what you want?\n\n          ERIC\n          Of course not.\n\n          JEFF\n          Then get the fuck out of my way,\n          and start helping me.\n          He holds Eric's eyes long enough to confirm that Eric isn't\n          going to protest, then he glances past him at Stacy.\n          JEFF (cont'd)\n          You going or not?\n          Stacy-is still staring at the ground, her hand probing at her\n          chest. It's clear she doesn't want to go, but Jeff has\n          shamed her into silence. Amy reaches, touches her arm.\n\n          AMY\n          .'-11 be right there. Okay? We'll\n          be together the whole time.\n          A long beat, then Stacy manages a nod. It's enough for Jeff;\n          he pushes past Eric, moving toward the windlass.\n\n          JEFF\n          Get in the sling, Amy.\n          Amy turns, reaching for the sling.\n\n          EXT. BOTTOM OF THE SHAFT - DAY\n\n          A faint fall of light from above. There's the CREAKING of\n          the windlass: Amy is dropping slowly toward us. When her\n          feet touch the bottom of the shaft, she scrambles out of the\n          sling. Then she lifts her head, SHOUTS:\n\n          AMY\n          Pull it up!\n          The CREAKING resumes. She stands there in the dimness,\n          watching the sling rise away from her. She has the makeshift\n          torch in one hand, the box of matches in the other.\n\n          \n\n          \n\n          \n\n          \n\n          95.\n\n          EXT. HILLTOP - THE CLEARING\n\n          Eric is helping Stacy into the sling, pulling it over her\n          head; Stacy's hands are shaking badly. Eric hugs her, trying\n          to calm her. Jeff waits beside the hand crank.\n\n          THE BOTTOM OF THE SHAFT\n          Amy is in a crouch. She keeps glancing toward the stone arch\n          cut into the shaft's wall, and the passageway beyond it: the\n          vine dangles from.the low ceiling, like streamers at a party.\n          The CREAKING resumes, and Amy looks up.\n\n          AMY'S POV - ABOVE HER\n          Stacy is dropping slowly toward us.\n\n          BACK TO SCENE\n          Amy glances toward the arch again. A slight draft blows\n          steadily from it, and the vine shifts and trembles in it. A\n          beat, then the RINGING starts up once more. It's coming from\n          within the shadowed passageway.\n          Amy opens the box of matches, plucks one out. She's too\n          jumpy, though; her hands are-trembling so much that she\n          shakes the match out as soon as it's lit.\n          There's a second RING. Stacy has nearly reached us.\n          Amy digs another match from the box. Stacy's feet touch the\n          bottom of the shaft; she yanks off the sling. There's a\n          third RING.\n\n          STACY\n          Hurry.\n          Amy strikes the match, holds it to the knot of clothing at\n          the end of the aluminum pole. The alcohol catches with a\n          FLUTTERING sound, a cloud of pale blue fire materializing\n          around the torch. Amy lifts it, and they start into:\n\n          THE UNDERGROUND PASSAGE\n          Stacy is in front, with Amy right behind her. The torch\n          shudders weakly in the steady draft; the shaft's ceiling is\n          low enough that they have to crouch as they move forward.\n          There's a fourth RING, drawing them deeper down the passage.\n\n          \n\n          \n\n          \n\n          \n\n          96.\n          The tendrils hanging from the ceiling brush against them.\n          The vine is growing on the floor, too--knee-deep--and from\n          the walls on either side. Amy is moving cautiously,\n          squinting into the darkness, and Stacy starts to pull ahead.\n\n          AMY\n          Wait...\n          She pauses, lifting the torch, but Stacy keeps going. Amy\n          peers at the vine hanging from the wall. There's a fifth\n          RING, echoing eerily, and the flowers move in exact unison\n          with the sound, their stamens vibrating, like so many\n          miniature tuning forks: the plant is making the noise.\n          AMY (cont'd)\n          Stacy...\n          The shaft dead-ends at a blank wall, which is just\n          materializing out of the darkness, fifteen feet in front of\n          them. There's a sixth RING. Stacy points at the wall,\n          quickening her pace.\n\n          STACY\n          It's right here. I can--\n          Amy jumps forward, reaching for her.\n\n          AMY\n\n          DON'T--\n          But there's another RING, and Stacy keeps going: she's\n          nearly at the wall.\n\n          STACY\n\n          IT'S--\n          Stop!\n          Amy grabs her arm, hard, jerks her back a step, pulling her\n          close, the torchlight flickering over them. She WHISPERS:\n          AMY (cont'd)\n          There's no phone.\n\n          STACY\n          What?\n          A seventh RING sounds, seeming to come from beneath the vines\n          on the floor of the shaft, directly in front of them. Stacy\n          tries to pull free, to bend and reach toward the sound.\n\n          \n\n          \n\n          \n\n          \n\n          97.\n          STACY (cont'd)\n          I can--\n          Amy jerks her back again, WHISPERS straight into her ear:\n\n          ANY\n          It's the vine. The flowers.\n          They're making the noise.\n\n          STACY\n          No. It's--\n          She pulls free, steps forward, and her foot seems to punch\n          straight through the shaft's floor. She SCREAMS, losing her\n          balances Amy throws down the torch, lunges for her. The\n          torch flutters, pales, but remains lit.\n          The vines growing across the floor fall away, revealing an\n          opening, another shaft, dropping into the earth. Stacy is\n          slowly sliding into it, scrambling to stop herself.\n          Amy grabs Stacy arm. Stacy is dangling, from the waist down,\n          over the hole's edge. There are vines in the hole, too, and.\n          they begin to coil around her legs, pulling at her, dragging\n          her downward.\n          Stacy SCREAMS again, kicking to free herself, scrambling\n          upward, monkey-like, while Amy pulls at her, and finally they\n          manage to drag her to safety.\n          A beat, then Amy retrieves the torch, holds it out over the\n          hole. The bottom is twenty feet down, almost lost in shadow.\n          Dimly, WE SEE a woman, lying curled against the wall--she has\n          long dark hair.\n          STACY (cont'd)\n          Oh my God.\n          The woman stirs, her body rolling, as if to turn and look at\n          us, and WE SEE her face: she's a corpse. The vine has\n          invaded her flesh--it's in her eye sockets, the hollow of her\n          mouth, writhing and churning. Stacy and Amy SCREAM.\n          There's a WHISTLING sound, like a whip, and a tendril lashes\n          out from the shaft's wall, wraps itself around the torch's\n          handle, yanks it from Amy's grip. The torch falls into the\n          hole, still burning. When it hits bottom, a mass of vine\n          surges across it, smothering its flame.\n          It's very dark after this: Amy and Stacy are barely\n          discernible. A beat of silence, then an odd, high-pitched\n          CACKLING rises all around them; it sounds like laughter--\n          eerie, childlike, full of echoes.\n\n          \n\n          \n\n          \n\n          \n\n          98.\n          As it steadily increases in volume, that WHISTLING comes once\n          more: the vines SMACK at them from the floor, the ceiling,\n          the walls, coiling around their bodies, pulling them toward\n          the open shaft.\n          They both SCREAM again, scrambling backward, while the vine\n          keeps coming, more and more of it, grabbing at their arms,\n          their legs, their necks. They stumble over each other,\n          falling onto their hands and knees.amid the.tendrils.\n          The vine catches at them, tries to hold them down. It's not\n          strong enough, though; they yank it off, and thrash their\n          way, foot by foot, back toward the sling, the vine lashing at\n          them, grabbing, tearing, sap leaking onto their skin. The\n          laughter grows still louder, the whole shaft ECHOING with it.\n          Amy reaches the sling first, with Stacy right behind her.\n          Even here, the vine continues to attack them, whipping and\n          HISSING and LAUGHING. Amy holds the sling toward Stacy.\n\n          AMY\n          You.\n          But Stacy is too hysterical: she just stands there, SOBBING,\n          SCREAMING. Jeff's voice comes toward them from above,\n\n          SHOUTING:\n\n          JEFF (0.S.)\n          Amoy...?\n          Amy pulls the sling over her own head. YELLS:\n\n          AMY\n          Pull us up!\n\n          JEFF (O.S.)\n          Did you find it?\n\n          AMY\n\n          NMI\n          She reaches out, grabs Stacy, wrapping her arms and legs\n          around her. Stacy returns the embrace, both of them\n          clutching at each other, as the windlass finally begins to\n          CREAK, lifting the two of them into the air.\n\n          ON AMY AND STACY - IN THE SLING\n          The vines hanging from the shaft's walls whip at the girls as\n          they rise, coiling around their bodies, pulling at them, that\n          strange LAUGHTER growing ever louder, seeming to buffet their\n          bodies. Stacy and Amy grip each other with all their\n          strength, eyes shut tight. Stacy SCREAMS.\n\n          \n\n          \n\n          \n\n          \n\n          99.\n\n          EXT. CLEARING/BASE OP. THE HILL - DAY\n\n          The SCREAM comes faintly toward us. The Mayans are arrayed\n          about their campsite, all of them motionless, silent, staring\n          up the hill with their impassive expressions.\n\n          EXT. HILLTOP - THE CLEARING - DUSK\n\n          The weather has shifted; a wind has risen. The sun is\n          setting, a red smudge behind a dark gray wall of clouds.\n          Mathias lies.on his backboard, unconscious, his breathing\n          coming in that ragged RASP, a thread of brown liquid leaking\n          from the corner of his mouth. Amy is crouched beside him;\n          she leans forward, wipes away the liquid.\n          Stacy sits in the clearing behind her, leaning against Eric.\n          They're both slick with sweat, but Stacy keeps shivering, as\n          if cold. Eric's arms are around her, and her eyes are shut.\n          Jeff is peeling the orange. Like Amy, he's still spattered\n          and stained with Mathias's blood. The vine has continued to\n          grow on everyone's clothes, weblike, eating away at the\n          fabric. Jeff reaches, tugs free a strand of it, and a six-\n          inch tear appears in his T-shirt.\n          Stacy opens her eyes; she leans forward, peers down at the\n          wounds on her leg, her right hand moving to her chest,\n          probing at her rib cage. She turns to Eric:\n\n          STACY\n          Check your phone.\n          Eric pushes himself to his feet, steps toward his pack. He\n          pulls out his phone, flips it open. He shakes his head.\n          STACY (cont'd)\n          Let me see.\n          Eric carries the phone to her, then stands over her while she\n          opens it, stares down at it. She shuts it, opens it again.\n          Then again, and again, and suddenly she's CRYING, bent into\n          herself. Eric drops to a crouch, rests his hand on her knee.\n\n          ERIC\n          Shh.\n          But her crying increases; she begins to SOB. Jeff is bent'\n          over the orange, dividing it into four equal piles--its peel,\n          too--concentrating. He lifts his head, stares. Amy stands\n          up, hurries over., kneels in front of Stacy, takes her hand.\n\n          \n\n          \n\n          \n\n          \n\n          100.\n\n          AMY\n          It's okay, sweetie. You're okay.\n          Stacy keeps WEEPING, uncontrollably, shaking her head.\n\n          STACY\n          I wanner go home. I wanna leave...\n\n          ERIC\n          Shh...\n          She's WAILING, rocking back and forth; she can't seem to\n          stop. Amy struggles to calm her.\n\n          AMY\n          Stacy...\n          Stacy keeps WAILING, rocking, eyes shut. Amy leans in close.\n          AMY (cont'd)\n          Let's play the game...can you do\n          that? Huh? Can you give me a\n          \"So\"?\n          Stacy continues to CRY.\n          AMY (cont'd)\n          Come on. Just try. Can you try?\n          (a beat)\n          So there was this girl who wanted\n          to be a pilot.\n          Stacy's tears keep coming. Amy looks at Eric, gives him a\n          nod,'prodding him into speech. He hesitates, then:\n\n          ERIC\n          But she was scared of heights.\n\n          AMY\n          So she became a lifeguard instead.\n          (she squeezes Stacy's\n\n          HAND)\n          Come on. Your turn.\n          More SOBS. Amy glances across the clearing at Jeff, wanting\n          him to join in, too. It seems as if he might refuse, but\n          then her look hardens, and he relents.\n\n          JEFF\n          But she couldn't swim.\n\n          \n\n          \n\n          \n\n          \n\n          101.\n\n          AMY\n          So she wore a life vest.\n          (she squeezes Stacy's hand\n\n          AGAIN)\n          Come on. Now you.\n          A beat, then Stacy takes a deep, ragged breath. She wipes at\n          her face, struggles for words.\n\n          STACY\n          But everyone...\n          She trails off, CRYING again. Amy nods, encouraging her.\n\n          AMY\n          Yeah...? Everyone what?\n\n          STACY\n          They laughed at her.\n\n          AMY\n          Good. That's good. So she--\n          Very suddenly, it starts to rain--a dozen large, heavy drops.\n          They all glance skyward.\n\n          JEFF\n\n          SHITÂ\u0080¢\n          He springs to his feet. And then: a downpour, a deluge, as\n          if a trap door has swung open in the clouds. The rain falls\n          in a loud, drumming rush, turning the clearing to mud.\n          Eric jumps up, too. He and Jeff start digging through the\n          backpacks from the. blue tent, searching for something--\n          anything--in which to catch the water. They find a small\n          plastic bag, a nylon toiletry kit, a Frisbee. Jeff sets\n          these in a row on the ground, open to the rain.\n          Eric rushes to the orange tent, vanishes inside. Amy tilts\n          back her head, tries to catch the rain in her open mouth.\n          Stacy just sits there, hugging herself, shivering, still half-\n          crying. They're all drenched, back-spattered with mud.\n          And then, as abruptly as it had begun, the rain starts to\n          slacken. Eric reemerges from the orange tent, carrying a\n          thermos, a plastic cup. He sets them next to the other\n          containers, but it's pointless; the rain is already stopping.\n          They all stare at these meager receptacles: they've managed\n          to catch less than half an inch of muddy-looking water. Jeff.\n          GROANS; he's FURIOUS with himself:\n\n          \n\n          \n\n          \n\n          \n\n          102.\n          JEFF (cont'd)\n          We should've been ready. We\n\n          SHOULD'VE-\n          He kicks the Frisbee across the clearing. Amy jumps up.\n\n          AMY\n\n          JEFFT\n          She steps forward, as if to guard the other containers.\n\n          JEFF\n          It doesn't fucking matter.\n\n          AMY\n          There was water in it.\n          He spins toward her, turning his fury with himself on her:\n\n          JEFF\n          How much, Amy? Two and a half\n          gallons? 'Cause that's what we\n          need. For today--just to make it\n          through today. And then tomorrow\n          the same all over again. And for\n          how long? Another week before our\n          parents start searching? And then\n          what? How long till they track us\n          to Coba? Or to this fucking hill?\n          How long will it take, Amy?\n\n          AMY\n          You said--\n\n          JEFF\n          It's not gonna happen. We're not\n          gonna make it.\n          The others stare at him in astonishment, too 'stunned to\n          speak. He gives them all a look of disgust:\n          JEFF (cont'd)\n          And you're fucking playing games.\n          (mimicking Amy's voice)\n          So there were these people trapped\n          in the jungle.\n\n          AMY\n          Don't, Jeff.\n\n          JEFF\n          But they didn't have any water.\n\n          \n\n          \n\n          \n\n          \n\n          103.\n          Amy looks as if she might start crying.\n\n          AMY\n          Please, don't.\n\n          JEFF\n          So they're gonna die of thirst.\n          Amy covers her ears with her hands.\n\n          AMY\n          Shut up!\n\n          JEFF\n          But this fucking vine might kill\n          them first.\n\n          AMY\n\n          (SHOUTING)\n\n          STOP IT!\n          Jeff paces away, struggling to regain control of himself. A\n          long beat, and then, very QUIETLY:\n\n          JEFF\n          I'm sorry ...I'm sorry.\n          He steps back toward the dismembered orange, crouches over\n          it. The fruit and peels are muddy now, spoiled looking. He\n          waves for the others to approach.\n          JEFF (cont'd)\n          Come on. We need to eat.\n          No one moves. They're all staring at him with their shocked\n          expressions. He can't seem to meet their eyes. He gestures\n          at the orange again.\n          JEFF (cont'd)\n          The peel, too. Everything.\n          Abeat, then the others step forward to claim their portions:\n          first Eric, then Stacy, then Amy. They eat without speaking.\n          Finally, almost AS IF TALKING TO HIMSELF:\n          JEFF (cont'd)\n          It'll rain again. It has to. And\n          we'll figure out a way to catch it.\n          (he nods to himself)\n          We'll be fine. We'll ration the\n          -food. And then, you know, we'll\n          just...we'll tough it out..\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n\n          104.\n          JEFF (cont'd)\n          People have survived for weeks with\n          nothing. Just water, a little bit\n          of water. So why not us?\n          No one responds. They continue to eat: the fruit, the\n          peels. Their torn clothes cling wetly to them. Jeff uncaps\n          the water bottle, offers it to Amy. She drinks, passes it\n          on. It moves around the circle, back to Jeff.\n\n          ERIC\n          What about the vine?\n          Jeff takes his sip, caps the bottle. He's reclaiming\n          himself, his voice strengthening, his confidence returning.\n\n          JEFF\n          I don't think it can hurt us. Not\n          directly. if it could, it already\n          would've, wouldn't it? Why would\n          it wait?\n          The others are silent, considering this. Then:\n          JEFF (cont'd)\n          It's not strong enough to overpower\n          us. And it--\n          Mathias GASPS suddenly, his entire body spasming for a\n          moment, before the watery RASP of his breathing resumes. He\n          doesn't regain consciousness; his eyes remain shut. Everyone\n          watches him for a beat: he, also, is spattered with mud.\n\n          AMY\n          He's gonna die, isn't he? if\n          there's no phone, then there's no--\n\n          STACY\n          Me, too.\n          They all turn to look at her. She's massaging that spot on\n          her rib cage again, digging into it with her fingers.\n          STACY (cont'd)\n          It's eating me. Just like him.\n          And her.\n          She waves toward the shaft. Jeff gives her a weary look.\n\n          JEFF\n          Don't, Stacy. Don't start.\n          She jumps up, begins to pace, agitated.\n\n          \n\n          \n\n          \n\n          \n\n          105.\n\n          STACY\n          It's inside me. In my leg. My\n          chest. I can feel it. Right here..\n          She stops pacing, lifts her shirt. She points to the base of\n          her rib cage.\n          STACY (cont'd)\n          See?\n          Jeff stares; there's nothing there. He shakes his head. The\n          knife is lying in the mud beside him, and Stacy steps\n          forward, snatches it up. Jeff reaches to stop her, but he's\n          too slow. She stands before him, hefting it. in her hand.\n\n          JEFF\n          Put it down.\n\n          STACY\n          I'll show you.\n          She lifts her.shirt again, pressing at her rib cage with her\n          .fingertips. Jeff stands up, holds out his hand.\n\n          JEFF\n          Give it to me. Right now.\n          Amy and Eric stand, too.\n\n          ERIC\n\n          STACY--\n          But she's already cutting: a four inch slit along the base\n          of her rib cage. Amy SCREAMS. A horizontal line of blood\n          crests the wound, sweeps down across Stacy's stomach, soaking\n          into the waistband of her shorts. She watches it, frowning.\n\n          STACY\n          I thought it would just come\n          tumbling out.\n          She probes at the cut with the point of the knife, prying it\n          farther open, the bleeding increasing. Jeff reaches, grabs\n          the knife from her. He looks furious:\n\n          JEFF .\n          Sit down.\n\n          STACY\n          It's hiding. It's right--\n          She pokes her finger into the wound, digging. Jeff slaps her\n          hand away. He YELLS:\n\n          \n\n          \n\n          \n\n          \n\n          106.\n\n          JEFF\n          a il hï¿½ f down i\n          He shoves her down, onto her back, then picks up the towel\n          he'd used to hold the heated stone. He balls it up, presses\n          it to Stacy's wound. Eric retrieves the bottle of tequila\n          from the mud, uncaps it. He crouches beside Stacy.\n\n          ERIC\n          Don't yell. she's just scared.\n\n          SHE'S--\n\n          JEFF\n          what're you doing?\n          He's lifting the bottle toward Stacy's mouth, but he\n          hesitates now, turning toward Jeff.\n\n          ERIC\n          Just a sip. To calm her.\n\n          JEFF\n          It'll dehydrate-her.\n\n          ERIC\n          A sip, Jeff.\n          He starts to lift the bottle again. Jeff shoves it aside.\n\n          JEFF\n          I said Q.\n\n          STACY\n          Leave him alone.\n          She tries to sit up, but Jeff pushes her back down, hard.\n\n          JEFF\n          You realize how stupid you're\n          being? Sticking that dirty knife\n\n          INTO--\n\n          STACY\n          It's growing.\n\n          JEFF\n          of ina's.inside you. You're\n          imagining it, and you just--\n\n          STACY\n          I'm gonna end up like her. That\n          girl. I'm gonna--\n\n          \n\n          \n\n          \n\n          \n\n          107.\n          r -\n\n          JEFF\n          Get infected. Understand? You're\n          gonna get yourself killed.\n\n          STACY\n          You're not listening.\n\n          JEFF\n\n          BECAUSE--\n\n          STACY\n          (shouting, very loud)\n\n          YOU'RE NOT LISTENING!\n          A beat of startled silence, and then her voice comes again,\n          from across the hilltop, sounding exactly like her, only\n          slightly fuzzed, a rasping quality just beneath the words:\n\n          STACY'S VOICE\n\n          YOU'RE NOT LISTENING!\n          They all turn to look, but there's nothing there, just the\n          vine, its green leaves, its bright red flowers. Stacy's\n          voice comes once more, from the.opposite direction now:\n          STACY'S VOICE (cont'd)\n\n          YOU'RE NOT LISTENING!\n\n          ERIC\n          What the--\n          Stacy's voice keeps coming, switching locations, seeming to\n          float across the hilltop; they turn, tracking it.\n\n          STACY'S VOICE\n\n          YOU'RE NOT LISTENING...! YOU'RE\n\n          NOT LISTENING...! YOU'RE NOT\n\n          LISTENING...!\n          Amy steps toward Jeff, looking frightened.\n\n          AMY\n          The Mayans.\n\n          JEFF\n          (shaking his head)\n          No--it's the vine. It's mimicking\n          her.\n          Stacy has started to CRY; she covers her ears with her hands.\n\n          STACY\n          Make it stop.\n\n          \n\n          \n\n          \n\n          \n\n          108.\n\n          STACY'S VOICE\n\n          YOU'RE NOT LISTENING...! YOU'RE\n\n          NOT LISTENING...! YOU'RE NOT\n\n          LISTENING...!\n\n          STACY\n          Please. Make it stop.\n\n          STACY'S VOICE\n\n          YOU'RE NOT LISTENING...! YOU'RE\n\n          NOT LISTENING...! YOU'RE NOT\n\n          LISTENING...!\n          Stacy tries to sit up, but Jeff pushes her back down. Se's\n          still crouched over her, pressing the towel to her wound;\n          it's completely soaked through with blood now. Stacy YELLS:\n\n          STACY\n          Shut up...!\n          Stacy's voice continues, but now that high-pitched LAUGHTER\n          is coming, too, a chorus of it, growing in volume:\n\n          STACY'S VOICE\n\n          YOU'RE NOT LISTENING...! YOU'RE\n\n          NOT LISTENING...! YOU'RE NOT\n\n          LISTENING...!\n          Stacy's weeping has deepened to SOBS. She keeps YELLING:\n\n          STACY\n          Shut up...! Shut up...!\n          The LAUGHTER grows steadily LOUDER, obscuring Stacy's voice:\n          WE SEE the flowers trembling, visibly vibrating as they\n          sculpt the sound...\n\n          EXT. CLEARING/BASE OF THE HILL - DUSK\n\n          The light is fading fast. One of the Mayan women is cleaning\n          a pot with a handful of leaves. Three of the men sit facing\n          the hillside, their bows in their laps. The others are\n          bedding down beneath the trees.\n          The LAUGHTER echoes down the hill, eerie and ghoulish, yet\n          the Mayans betray no reaction to it, as if it were no more\n          worthy of note to them than the steady RASPING of the locusts\n          in the jungle at their backs.\n\n          \n\n          \n\n          \n\n          \n\n          109.\n\n          INT. ORANGE TENT - NIGHT\n\n          Jeff, Stacy and Amy lie side-by-side in the darkness. The\n          liquid RATTLE of Mathias's breathing comes from the clearing,\n          sounding as if someone were sawing at a tin can.\n          Jeff and Stacy are asleep; Amy is stirring restlessly,\n          shifting first onto one side, then the other. Finally, she\n          rises, moves toward the flap, slips quietly through it.\n\n          EXT. HILLTOP - THE CLEARING - NIGHT\n\n          The moon is out, dropping its faint light upon us. Mathias\n          is on his backboard beneath the little lean-to, more audible\n          than visible, with his PHLEGM-CLOTTED breathing. Eric is\n          beside him. He looks up as Amy emerges from the tent.\n\n          ANY\n          Now is he?\n          Eric shrugs, waves toward the backboard: it seems clear\n          enough. Amy stares-for a moment, then sits beside him.\n          AMY (cont'd)\n          You can go lie down if you want.\n          Eric lifts his hand, pushes a button on his watch, makes it\n          glow. He squints at it.\n\n          ERIC\n          I still have forty minutes.\n\n          AMY\n          I don't mind. I can't sleep.\n          Eric checks his watch again, its glow briefly illuminating\n          his face. He gestures toward the tent.\n\n          ERIC\n          Is Stacy?\n\n          AMY\n          They both are.\n          There's a slight breeze, and the tent makes a FLAPPING SOUND\n          in it. They both turn to stare at it. Then:\n          AMY (cont'd)\n          Do you think it's inside her?\n\n          \n\n          \n\n          \n\n          \n\n          110.\n\n          ERIC\n          (he shakes his head)\n          Jeff cut it out. I saw him.\n\n          AMY\n          But she says she can feel it.\n          Moving. Shifting about.\n          Eric waves this aside.\n\n          ERIC\n          You know how Stacy is. She's just\n          scared. She gets things in her\n          head, and---\n          Mathias makes a RETCHING sound--loud, wet, painful--and they\n          both turn,â\u0080¢peering at his gaunt form through the darkness.\n          He falls QUIET; his eyes don't open. A beat, then:\n          ERIC (cont'd)\n          I've been sitting here, you know,\n          making all these deals in my head\n          with God. You ever do that?\n          Amy just stares at him. He has his arms wrapped around his\n          knees, hugging them to his chest.\n          ERIC (cont'd)\n          Like I say, okay, you can fire me\n          on the first day teaching if that's\n          what you want--just let us make it\n          home. But that doesn't mean shit,\n          'cause I don't even really want the\n          job, and He has to know that,\n          doesn't He? So I say, all right,\n          Stacy can leave me, you know, or\n          even, I don't know, I'll give up a\n          finger, okay? Or two fingers. Or\n          fuck it, take a hand, take my left\n          hand, but let us just get home, all\n          of us.\n          (a beat)\n          And then I look at him--\n          (he nods toward Mathias)\n          --and I can't help it, I'm, like,\n          take him if you need to, take\n          Mathias, and let the rest of us go.\n          That's fucking horrible, isn't it?\n          And once I've said it, I feel like\n          I can't take it back, you know?\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n          ERIC (cont'd)\n          Like the words have gone up into\n          the sky and God's sort of thinking\n          about them now, making his choice,\n          and if Mathias dies and we don't,\n          it'll be.like I killed him, won't\n          it? Like I--\n          Amy starts to CRY; she covers her mouth with her hand. Eric\n          stares at her in surprise.\n          ERIC (cont'd)\n          What? What is it?\n          Amy shakes her head. She struggles to stop, but she can't.\n\n          AMY\n          I'm sorry ...I'm so sorry...\n          (a beat)\n          It's my fault.\n\n          ERIC\n          what is?\n\n          AMY\n          If I hadn't stepped onto the hill--\n          Her crying INCREASES. Eric leans, touches her hand.\n\n          ERIC\n          That's stupid, Amy. That's--\n\n          AMY\n          Jeff said it. He said--\n          Eric reaches, puts his arm around her, trying to quiet her.\n\n          ERIC\n          He didn't mean it. There's no way.\n          He was just--\n\n          AMY\n          We might not have...\n\n          ERIC\n          Shh. Don't.\n          She rests her head on his shoulder, WEEPING, her body shaking\n          with it, while he pats her, stroking her hair.\n\n          \n\n          \n\n          \n\n          \n\n          112.\n\n          INT. ORANGE TENT - NIGHT\n\n          Stacy and Jeff, eyes shut, sleeping. Very SOFTLY, there\n          comes a faint PANTING, rhythmic, furtive sounding. Stacy's\n          eyes open; she lies there, listening.\n          There's a MOAN, and the PANTING QUICKENS. Stacy rises to a\n          sitting position. She listens for another beat, then leans,\n          prods at Jeff. He awakes with a jerk, blinking up at her.\n\n          JEFF\n          Wh--?\n          Stacy holds her finger to her lips, silencing him.. From\n          outside, there's another MOAN. Jeff sits up, listening. The\n          PANTING is BUILDING toward a climax. Jeff leans toward the\n          pile of supplies at the tent's rear, squinting at the tangle\n          of vine growing across it. He points, WHISPERING:\n          JEFF (cont'd)\n          It's the--\n          But Stacy is already pushing herself to her feet. She moves\n          quickly to the tent's flap, UNZIPS it, crouches out into:\n\n          EXT. HILLTOP - THE CLEARING - NIGHT\n\n          Mathias's breathing continues its RAGGED course. Amy is\n          still leaning into Eric, her head on his shoulder. He has\n          his arm around her. He looks up, blinking, as Stacy emerges\n          from the tent into the moonlight.\n\n          . STACY\n          What the fuck, Eric?\n          Amy lifts her head, wipes at her face; Eric drops his arm\n          from her shoulder. They both stare at Stacy, startled by her\n          anger. Jeff appears behind her, stepping through the flap.\n\n          ERIC\n          What?\n\n          STACY\n          We heard you.\n\n          ERIC\n          Heard me what?\n\n          STACY\n          Fucking her.\n\n          \n\n          \n\n          \n\n          \n\n          113.\n          Eric looks from Stacy to Jeff, completely perplexed.\n\n          ERIC\n          What're you talking about?\n\n          JEFF\n          The vine. it made it sound as if\n          you two--\n          Stacy turns toward him, SNORTING, shaking her head.\n\n          STACY\n          You're so blind.\n\n          JEFF\n          I could hear it. At the back of\n          the tent. It was--\n\n          STACY\n          It doesn't make things up. It\n          mimics things. Things it's heard.\n\n          JEFF\n          Then it's heard someone having sex\n          at some point.\n          Slowly, quietly, a tendril has begun to slither forward\n          through the darkness, creeping in beneath the lean-to,\n          snaking toward Mathias, toward his head. Jeff and the others\n          are all too focused on one another to notice.\n\n          STACY\n          That was Ay, Jeff. Moaning.\n\n          AMY\n          What?\n          Jeff reaches, touches Stacy's arm, struggling to calm her,\n          but she flinches from him.\n\n          JEFF\n          it's doing this on purpose.' Can't\n          you see? It thinks you're the\n          weakest--because you're hurt. So\n          it's trying to upset you. Trying\n\n          TO--\n\n          STACY\n          You're not upset? He had his arm\n          around her. He--\n          Amy leans forward, hands out, BESEECHING:\n\n          \n\n          \n\n          \n\n          \n\n          114.\n\n          AMY\n          Nothing happened, Stacy. I was\n          crying. And Eric--\n\n          STACY\n          We he-ar you.\n          The vine starts to push its way in between Mathias's lips,\n          into his mouth. Mathias makes a GAGGING sound, but doesn't\n          regain consciousness: once more, no one notices.\n\n          JEFF\n          We heard the vine. It--\n\n          STACY\n          You're such a fool, Jeff. You\n          think she's never cheated on you?\n          Perfect little angelic Amy?\n\n          AMY\n          Stacy.\n\n          STACY\n          I could tell you secrets. I could\n          open your eyes.\n\n          AMY\n          Shi i up. Right now.\n          A second tendril has slithered under the lean-to. It covers\n          Mathias's nose, drawing itself tight. The steady rasping of\n          his breathing is CUT OFF. Yet again, no one notices.\n\n          STACY\n          Spring break? Senior year?\n\n          AMY\n          You bitch. You stupid cunt.\n          Stacy spins on her, VENOMOUS:\n\n          STACY\n          Fuck you. Slut.\n          (back to Jeff)\n          Twice, Jeff. Two different guys.\n          And one of them--\n          Jeff grabs her arm, grips it, silencing hers\n\n          JEFF\n          Enough, Stacy. Stoll.\n\n          \n\n          \n\n          \n\n          \n\n          115.\n          Stacy falls SILENT; she seems as astonished by what she's\n          said as everyone else.\n          JEFF (cont'd)\n          Where do you think you are? Huh?\n          Why would you even care--at this\n          point, if they were out here\n          fucking? We're trapped. We don't\n          have any food. Or water. And\n\n          MATHIAS--\n          He turns, stares: sees. He darts forward, starts to yank\n          away the tendrils. They resist him, writhing, clinging to\n          Mathias's face. Eric and Amy both jump up. Stacy has\n          started to CRY, shaking her head, MORTIFIED:\n\n          STACY\n          Oh, god...oh please no...\n          Jeff bends close to Mathias's face, listening; he checks\n          Mathias's neck for a pulse. A beat, then he turns toward the\n          others, shakes his head. Stacy begins to SOB:\n          STACY (cont'd)\n          I'm sorry...I'm so sorry...\n          Eric reaches, takes her into his arms, hugging her.\n\n          EXT. CLEARING/BASE OF THE HILL -- FROM UP THE HILL - DAWN\n\n          The hillside falls away from us, the narrow trail winding\n          down its face to the clearing and the wall of jungle beyond.\n          The sun is just rising, and the vine seems to shimmer in it.\n          Three of the Mayan encampments are visible from here: one\n          directly beneath us, one to the left, another to the right.\n          Thin ribbons of smoke rise from their campfires.\n\n          EXT. HILLTOP - TOP OF THE TRAIL - DAY\n\n          Jeff stands there, staring down toward the jungle. Eric and\n          Stacy are sitting together in the clearing behind him,\n          holding hands; Stacy is still CRYING softly. Amy approaches\n          across the hilltop, stops beside Jeff.\n\n          JEFF\n          They must've salted the soil.\n          That's the only way I can think.\n          He turns, glances at Amy. She has no idea what he's talking\n          about. He waves down toward the Mayans.\n\n          \n\n          \n\n          \n\n          \n\n          116.\n          JEFF (cont'd)\n          To keep the ground clear. It grows\n          so quickly...\n          He gestures at their clothes, upon which that green webbing\n          of vine continues to spread, eating away at the fabric.\n          JEFF (cont'd)\n          It's old, too--has to be. Really\n          old. Because the birds, the\n          insects... somehow they've evolved.\n          They've learned not to land here.\n          (he peers about them, at\n          the vine-covered hill)\n          And the horses. Remember? How\n          frightened they were? They knew,\n          too.\n          They stand in silence for a beat, staring down the hill\n          toward the Mayans. Then Amy reaches, touches Jeff's arm.\n\n          AMY\n          It didn't happen.\n          Jeff turns, stares at her. she waves back toward the tent.\n          AMY (cont'd)\n          Eric and I, we were just---\n\n          JEFF\n          I know.\n\n          AMY\n          And what she said. About spring\n          break. I--\n          Jeff reaches, presses his finger to her lips.\n\n          JEFF\n          Shh.\n          Amy falls silent, watching him. He lowers his finger.\n          JEFF (cont'd)\n          Have you made it up with her?\n          Amy half-nods, half-shrugs.\n          JEFF (cont'd)\n          Good.\n\n          AMY\n          But I want to tell you--\n\n          \n\n          \n\n          \n\n          \n\n          117.\n          He presses his finger to her lips again, stopping her. He\n          waits a beat, and then:\n\n          JEFF\n          I wish it mattered.\n          Amy gives him a confused look. Jeff throws out his hand,.\n          gesturing at the hilltop, the vine, their tattered clothes.\n          JEFF (cont'd)\n          Look at us.\n          (a beat)\n          Would it matter to you?\n          Amy hesitates, considering. Then she shakes her head. And\n          with that, Jeff turns, starts back toward the orange tent.\n          WE HEAR a zipping sound, which carries over into:\n\n          EXT. HILLTOP - THE CLEARING - DAY\n\n          Jeff is crouched beside the backboard, UNZIPPING the sleeping\n          bag. Eric tosses the flimsy lean-to aside, exposing\n          Mathias's corpse-to the sun. Amy and Stacy stand watching.\n\n          JEFF\n          Head first?\n          Eric considers this, staring down at Mathias's body.\n          Mathias's face is burned red from the vine's sap; his legs\n          are two blackened stumps. Eric shrugs.\n\n          ERIC\n          I guess.\n\n          JEFF\n          You'll have to lift him.\n          Eric hesitates; he seems reluctant to touch the corpse.\n          Finally, he girds himself, straddles the backboard, grabs\n          Mathias under his armpits, lifting him. Jeff leans forward,\n          starts to pull the sleeping bag over Mathias's head.\n          The corpse seems intent upon resisting them; its arms keep\n          getting tangled, catching and snagging. Jeff and Eric have\n          to wrestle with it, both of them PANTING, sweating, before\n          they manage to shove it into the bag.\n          Jeff ZIPS the bag shut, and they stand over it, catching\n          their breath, wiping the perspiration from their faces.\n\n          ERIC\n          Should we say something?\n\n          \n\n          \n\n          \n\n          \n\n          118.\n          Jeff gives him a blank stare.\n          ERIC (cont'd)\n          Like, you know ...a prayer?\n          Jeff frowns down at the bag, searching for words. Before he\n          can find them, Stacy speaks:\n\n          STACY\n          Where's the knife?\n          They all turn. Her hand is under her tattered shirt,\n          pressing at her lower back. Jeff SIGHS:\n\n          JEFF\n\n          STACY--\n          She lifts her shirt, twisting to show him. it looks as if a\n          large starfish has been implanted just beneath her skin.\n          It's moving, too, inching slowly but visibly downward. They\n          all stare in astonishment.\n          Amy GASPS, points at Stacy's leg. Stacy bends to see:\n          there's more vine here, a snakelike lump winding its way\n          upward from the top of her shin to her inner thigh.\n\n          CU - FIRE\n          Another small pile of clothes, burning with that blue,\n          alcohol-fueled flame.\n\n          AMY (O.S.)\n          Can I give her some?\n          The knife is placed in the fire, and WE PULL BACK TO REVEAL:\n\n          EXT. HILLTOP - THE CLEARING - DAY\n\n          Amy holds up the bottle of tequila. Jeff is crouching over\n          the fire, heating the knife's blade. Be glances toward her,\n          nods. Stacy is sitting down, staring at the bulge in her leg\n          with a dazed expression. Eric is beside her.\n          Amy offers the bottle to Stacy;-they all watch as she takes a\n          long swallow. Then she hands the bottle back to Amy, and\n          Jeff pulls the knife from the fire, carries it toward her.\n          He gestures to Eric and Amy.\n\n          JEFF\n          Hold her hands.\n\n          \n\n          \n\n          \n\n          \n\n          119.\n          They each take one of her hands. Jeff crouches over her leg.\n          JEFF (cont'd)\n          You might want to shut your eyes.\n          Stacy shakes her head.\n\n          STACY\n          I want to see.\n          Jeff hesitates; for a moment it seems-as if he might argue.\n          But then, very quickly, he leans forward and draws the knife\n          in one smooth movement up and around Stacy's leg. Stacy\n          MOANS, her body tensing, but she doesn't cry out.\n          The incision reveals the vine, a foot long, its leaves and\n          flowers clotted with Stacy's blood, which is oozing from the\n          wound. Jeff reaches in, pries the tendril from her flesh.\n          Stacy MOANS again, arching backward, as the vine emerges:\n          writhing and twisting. The blood comes more thickly now,\n          pumping from the wound, running down her leg.\n          Jeff drops the tendril into the dirt, steps on it, grinding\n          it into stillness. Stacy is breathing HARD, almost\n          hyperventilating. She's shut her eyes.\n\n          JEFF\n          Should I stop?\n          Stacy shakes her head, vehemently. Jeff glances at the\n          others. Eric shakes his head, too. Amy's eyes, like\n          Stacy's, are tightly shut.\n          JEFF (cont'd)\n          You'll have to roll over.\n          Stacy lets go of the others' hands, rolls onto her stomach.\n          She hitches up her shirt, revealing the small of her back,\n          the starfish-shaped bulge. Jeff crouches at her side.\n          JEFF (cont'd)\n          Ready?\n          She nods, and he leans, makes five quick incisions, in the\n          shape of an asterisk, directly above the bulge. Stacy's body\n          goes rigid, and Eric takes her hand again. Once more, we can\n          see the tendril through the incision: dark with her blood.\n          Jeff reaches in and slowly pulls the vine from her body.\n          There's an astonishing amount of it; he has to drop the knife\n          and use both hands to drag the slimy mass free.\n\n          \n\n          \n\n          \n\n          \n\n          120.\n          As the plant emerges from her body--thrashing, coiling and\n          uncoiling, covered in half-clotted blood, like a newborn--\n          Stacy starts to SCREAM.\n\n          EXT. CLEARING/BASE OF THE HILL - DAY\n\n          The Mayans at their campsite: three of them on guard duty,\n          the others napping in the shade beneath the trees. Stacy's\n          SCREAMING echoes down the hill toward us.\n\n          EXT. HILLTOP - THE CLEARING - DAY\n\n          They've pulled a shirt from one of the backpacks, torn it\n          into strips, and used these to bandage Stacy's wounds, tying\n          them around her leg and torso. She's lying on her side, eyes\n          shut, her head in Eric's lap. He's stroking her hair.\n          Jeff is counting the grapes into four separate piles. Amy\n          sits watching him. When he finishes, he gestures for her to\n          take a pile. Then he scoops Stacy and Eric's rations up,\n          carries them over.\n\n          JEFF\n          Can you eat?\n          Stacy sits up, wincing; her bandages are soaked through with\n          blood. She takes the grapes from him; Eric does, too. They-\n          all begin to eat, in silence. When they're done, Jeff passes\n          the water bottle around their circle. Then:\n          JEFF (cont'd)\n          We should try to rest, I guess.\n          (he waves toward the tent)\n          Get out of the sun. We're losing\n          moisture out--\n\n          STACY\n          There's more of it.\n          She leans forward, probes at her right thigh, prodding the\n          skin. The others watch her; there's no bulge visible, no\n          sign of the vine-at all. Eric gives her a pained look.\n\n          ERIC\n          There's nothing there, Stacy.\n\n          STACY\n          It's under the muscle. Down by the\n          bone.\n\n          \n\n          \n\n          \n\n          \n\n          121.\n          She keeps pushing at her leg. She glances from Eric to Amy\n          to Jeff. No one says anything.\n          STACY (cont'd)\n          Cut me and see. Right here.\n          She uses her finger to draw a line up her thigh.\n\n          JEFF\n          You're losing too much blood. And\n          if any of these get infected---\n\n          STACY\n          My calf, too.\n          she lifts her right leg, turning it to show the others. Jeff\n          bends to look. Again, there's no visible sign of the vine.\n          He shakes his head.\n\n          JEFF\n          No more cutting. Not unless---\n          The knife is in the dirt beside him, and Stacy leans forward,\n          tries to grab it. Jeff is too quick for her, though: he\n          snatches it up, tucks it into his belt. Stacy is becoming\n          more and more upset. She holds out her hands, BEGGING:\n\n          STACY\n          Please, Jeff.\n\n          ERIC\n          You can't. You can't keep--\n          Stacy is starting to CRY; her mouth is trembling.\n\n          STACY\n          It's everywhere.\n          She's prodding at her body: her legs, her chest and stomach.\n          Amy scoots toward her, grasps her hand.\n\n          ANY\n\n          STACY--\n          Stacy yanks her hand free, clutches her scalp, WEEPING:\n\n          STACY\n          It's in my head! I can feel it in\n          my head!\n          Amy takes Stacy in her arms, hugging her tight..\n\n          \n\n          \n\n          \n\n          \n\n          122.\n\n          AMY\n          Shh.\n          Stacy SOBS into Amy's shoulder, her body jumping. Amy\n          strokes her. Eric steps across the clearing, picks up the\n          bottle of tequila. He glances at Jeff, and Jeff nods.\n          AMY (cont'd)\n          You're scared, honey. You're just\n          scared. You know?\n          Stacy nods; she's still CRYING, but it's growing quieter.\n          Eric crouches beside her, holds out the bottle of tequila.\n          Stacy just stares at it. Amy encourages her:\n          AMY (cont'd)\n          It'll help.\n          Stacy accepts the bottle, takes a long swallow. Then\n          another. The others watch her in silence. Finally:\n          AMY (cont'd)\n          Can you rest some? In the tent?\n          Stacy is silent. She wipes the tears from her face.\n\n          STACY\n          That girl--\n          (she waves at the shaft)\n          I keep seeing her. When I shut my\n          eyes.\n\n          AMY\n\n          (NODDING)\n          I know...I know.\n          (she stands up, holds out\n          her hand)\n          Let's just lie down for a bit.\n          Okay?\n          Stacy hesitates, staring up at Amy. Then she reaches, grasps\n          her hand. Amy pulls her to her feet, helps her hobble across\n          the clearing to the tent. Jeff and Eric sit-there, watching\n          in silence as they vanish through the flap.\n\n          INT. ORANGE TENT - DAY\n\n          Sunlight filters through the orange nylon; all four of them\n          lie sleeping in a row, sweating. The vine has shredded their\n          clothes to tatters; they look like castaways. The tent's\n          flap hangs open, billowing gently in a slight breeze.\n\n          \n\n          \n\n          \n\n          \n\n          123.\n          Stacy open her eyes. She lies there, staring up toward the\n          orange nylon above her. The blood on her bandages has dried\n          to a dark red, bordering on black. She sits up, stares about\n          the tent. Eric is on one side of her, then Amy, then Jeff.\n          Jeff is on his back, the knife still tucked into his belt.\n          Stacy rises quietly, steps over Amy, crouches above him,\n          staring down at the knife. She reaches, tries to slip it\n          free, but then jerks back when Jeff shifts in his sleep.\n          She hesitates, watching him. She seems as if she's about to\n          try again, but then the tent flap billows in the breeze,\n          drawing her gaze. A beat, and she rises, steps carefully\n          over Jeff, ducks outside into the clearing.\n\n          EXT. HILLTOP - THE CLEARING - DAY\n\n          Stacy stands just beyond the tent's.flap. All is still,\n          quiet.- She moves to Eric's pack, crouches over it, pulls out\n          his phone. She flips it open, stares down at its screen:\n          there's still no signal. She drops it back into the pack.\n          She turns-to examine the clearing, her eyes falling upon the\n          two backpacks from the blue tent. Their pockets are zippered\n          open: Jeff and Eric's hurried pillaging during the downpour\n          has scattered their contents across the dirt.\n          Stacy rises, steps toward this tangled mound. She starts to\n          dig through it, casually at first, but then with growing\n          intensity, throwing T-shirts and jeans and shorts aside,\n          probing deeply into the pile.\n          Suddenly she goes still. Staring. Amid the sodden mass of\n          clothing sits a knife in a small scabbard.\n          As Stacy crouches there, the vines start to RUSTLE, a\n          rippling motion passing across them, as. if a wind were\n          sweeping the hillside. Stacy watches with a look of horror:\n          it looks like the pelt of some giant animal, shaking itself.\n          When it finally stops, she bends, reaching for the knife.\n\n          INT. ORANGE TENT - DAY\n\n          Jeff, Eric, and Amy, still sleeping. The tent's flap\n          continues to billow in the breeze. Very faintly, from the\n          clearing, WE HEAR a moan. Then the sound of WHIMPERING.\n          Eric opens his eyes, listening. An instant later, very\n          abruptly, there comes a sharp, rending SCREAM of pure pain.\n          Eric jumps up, starts for the flap; Jeff is right behind him.\n\n          \n\n          \n\n          \n\n          \n\n          124.\n\n          EXT. HILLTOP - THE CLEARING - DAY\n\n          Eric emerges from the tent, then Jeff, then Amy. They stand\n          there, staring, too horrified to move.\n\n          AMY\n          Oh my God.\n          Stacy is on the far side of the clearing. She's pulled off\n          her shirt, her shorts, and has cut much of the skin from her\n          body. She doesn't notice them. She's bent over, slicing\n          into her left thigh, peeling the skin back from the muscle.\n\n          ERIC\n\n          STACY--\n          She turns, blood-streaked, wild-eyed, the knife in her hand;\n          her skin is hanging from her in shreds. We can see her leg\n          muscles, her abdominals, a glint of bone at her left elbow.\n          Jeff starts forward, holding out his hand, very STERN:\n\n          JEFF\n          Give it. Now.\n          Eric follows him. Amy stays by the tent; she's begun to CRY.\n\n          AMY\n          Please, honey. Just--\n          Stacy shakes her head; she's CRYING, too, her whole body\n          shaking. Her hair is matted with blood; she looks terrified.\n\n          STACY\n          I have to get it out. It's--\n          Jeff darts forward, tries to grab the knife from her, and she\n          slashes at him, SHOUTING:\n          STACY (coat'd)\n          Leave me alonel\n          The blade slices into his palm. Jeff jumps back, cradling\n          his hand at his chest.\n          STACY (cont'd)\n          I have to--\n          Eric steps toward her, from behind, reaching around her body\n          for the knife, and she spins, reflexively, trying to fend him\n          off. But the knife is in her hand, and it punches into his\n          chest, just to the right of his sternum, sticking there.\n\n          \n\n          \n\n          \n\n          \n\n          125.\n          Eric looks at the knife in surprise. It's twitching back and\n          forth with the beating of his heart. He starts to reach for\n          it, but then his legs give out. He collapses, dropping to\n          the dirt, which has grown muddy with Stacy's blood.\n          Amy SCREAMS.\n          Stacy's CRYING deepens; she takes a step toward Eric, but\n          then her own body fails her. She falls to her knees in the\n          bloody puddle, reaching toward him.\n          STACY (cont'd)\n          Oh, no...no...no... I'm--\n          Eric is on his back; he struggles up onto one elbow. He\n          tries to speak, but only a GAGGING sound emerges, blood\n          frothing at his mouth. It's pumping thickly from his wound,\n          too, saturating his shirt.\n          STACY (cont'd)\n          I didn't...\n          Eric drops back again. He struggles RAGGEDLY for breath.\n          Jeff lowers himself to his knees beside him, hesitating\n          impotently over him, uncertain what to do. Stacy is SOBBING,\n          shaking her head. There's blood everywhere.\n          STACY (cont'd)\n          Kill me...\n          Jeff turns, stares at her. Amy steps forward, crouches\n          beside her. She takes Stacy's hand.\n\n          ANY\n          Shh.\n\n          STACY\n          Please. Just--\n\n          ANY\n          Shh.\n\n          STACY\n          It hurts. It hurts so much.\n          Eric tries to rise again. The blood surges from his wound\n          when he moves. Jeff presses him back down.\n\n          JEFF\n          Easy. Try to--\n          Stacy clutches at Amy, begging, her voice HOARSE with pain:\n\n          \n\n          \n\n          \n\n          \n\n          126.\n\n          STACY\n          Kill me. I can't\n          She stops in mid-sentence, staring. Jeff and Amy follow her\n          gaze. A half dozen tendrils are snaking into the clearing,\n          reaching toward Eric's body.\n          Jeff jumps to his feet. The tendrils begin to wrap\n          themselves around Eric's limbs, and Jeff bends to tear them\n          away. More and more keep coming, though. Eric has started\n          to convulse, GAGGING, his head cocked back.\n          Jeff keeps yanking the tendrils away, but there are far too\n          many of them; they coil around Eric's legs, pulling at him.\n          The blood has stopped pumping from his wound; his body has\n          gone still.\n\n          AMY\n          Jeff I\n          She points toward the tent. Jeff turns to see.\n\n          JEFF'S POV - ACROSS THE CLEARING\n          The sleeping bag in which they'd enshrouded Mathias is\n          moving: he's thrashing about within it, struggling to sit\n          up. And he's SHOUTING, too, his voice MUFFLED by the bag:\n\n          MATHIAS'S VOICE\n\n          HENRICH...! HENRICH...!\n          He seems to be tearing at the bag with his arms.\n\n          BACK TO SCENE\n          Jeff hesitates just for an instant, staring in astonishment,\n          then he's sprinting across the clearing. He bends, struggles\n          for the zipper.\n\n          JEFF\n          It's okay. I'm right here. I'm--\n          He UNZIPS the bag, and an immense tangle of vine cascades out\n          onto the dirt. Its flowers are a pale pink; they're opening\n          and closing, still calling, louder now:\n\n          MATHIAS' S VOICE\n\n          HENRICH...! HENRICH...!\n          The thick clot of tendrils writhes spasmodically, coiling and\n          uncoiling.\n\n          \n\n          \n\n          \n\n          \n\n          127.\n          Entwined within it are Mathias's bones, already stripped\n          clean of flesh. The vine falls SILENT. A beat, then it\n          starts to laugh, a low mocking CHUCKLE.\n          On the opposite side of the little clearing, Stacy begins to\n          SCREAM, shaking her head, SOBBING.\n\n          STACY\n\n          KILL ME...! KILL ME...!\n          Jeff stands there, perfectly still. Amy is holding Stacy,\n          struggling unsuccessfully to quiet her:\n\n          AMY\n          Shh. Shh.\n          The vine's laughter grows steadily. LOUDER, punctuated by\n          Stacy's SHOUTS:\n\n          STACY\n\n          KILL ME...! KILL ME...:\n          Amy turns, stares at Jeff. Blood is running off Stacy's body\n          in strings. The vine has dragged Eric to the edge of the\n          clearing; only his head and torso are still visible. Jeff\n          strides toward him.\n          STACY (cont'd)\n\n          KILL ME...! KILL ME...!\n          Jeff bends, yanks the knife from Eric's chest. Then he\n          starts across the clearing toward Stacy.\n\n          EXT. CLEARING/BASE OF THE HILL - DAY\n\n          The Mayans in their campsite. They're all staring up the\n          hill, listening. Stacy's voice ECHOES toward us:\n\n          STACY (O.S.)\n\n          KILL ME...! KILL ME...I KILL--\n          And then, abruptly, it goes SILENT.\n\n          EXT. HILLTOP - THE CLEARING - DAY\n\n          Amy sits beside Stacy, who lies on her back in the puddle of\n          blood, arms thrown out, the knife stuck hilt-deep in her\n          chest. Eric's body is barely visible at the edge of the\n          clearing; the vine RUSTLES softly as it consumes him.\n\n          \n\n          \n\n          \n\n          \n\n          128.\n          Jeff is pulling their remaining supplies from his knapsack:\n          the bananas, the raisins, the pretzels, the protein bars, the\n          nuts, the water, iced tea, and Coke. He has a bloody strip\n          of fabric tied around the wound on his hand.\n          Amy watches as he arranges the food in front of her. She's\n          CRYING silently, tears running down her dirt-smeared cheeks.\n          Jeff peels one of the bananas: it's dark brown, far too\n          ripe. He holds it out to her. She just stares at it.\n\n          JEFF\n          Come on. You'll need the energy.\n          He reaches for her hand, puts the banana in it. She holds\n          the fruit, but makes no move to eat. Finally, VERY QUIETLY:\n\n          AMY\n          I still think we should wait.\n          Jeff SIGHS: it's clear they've already been through this.\n\n          JEFF\n          You'll only get weaker.\n\n          AMY\n          They'll come looking. You said\n\n          THEY'LL--\n\n          JEFF\n          Nobody's coming.\n\n          AMY\n          Our parents--\n\n          JEFF\n          All they'll find are our bones.\n          Amy is silent, staring down at the banana.\n          JEFF (cont'd)\n          We don't have time for this, Amy.\n          You'll need as much daylight as\n          possible.\n          He waves upward, toward the sun, which has passed its peak,\n          begun its slow slide westward. Amy squints toward it for a\n          beat, and then, almost despite herself, lifts the banana to\n          her mouth. She bites, chews, swallows, still mutely crying.\n          Jeff peels the second banana; he hands it to her as soon as\n          she finishes the first. Be watches her eat,.silent. He's\n          tearing open the bag of pretzels when another tendril snakes\n          into the clearing.\n\n          \n\n          \n\n          \n\n          \n\n          129.\n          They both watch it, neither of them moving. It's joined by a\n          second tendril, then a third, a fourth;.the vines coil around\n          Stacy's body, begin to drag it from the clearing. Amy's\n          CRYING grows more forceful, her body shaking.\n          JEFF (cont'd)\n          Shh.\n          Jeff reaches, strokes her. The vine pulls Stacy's body into\n          itself, burying it. Amy watches, struggling to control.\n          herself. Her voice emerges as little more than a WHISPER:\n\n          AMY\n          I don't want to. I don't...\n          She shakes her head, wipes at her face: the tears, the snot,\n          the sweat, the dirt. Her clothes are falling off her body,\n          eaten to shreds. Jeff's, too.\n          AMY (cont'd)\n          Why can't we both?\n          Jeff hesitates a.beat. Then, clearly not believing it:\n\n          JEFF\n          We might.\n          He hands her the pretzels; she takes them, watching his face.\n\n          AMY\n          How?\n\n          JEFF\n          It'll take them a moment to react.\n          If I can make it to the trees...\n          He trails off, shrugs. Amy keeps staring at him; she doesn't\n          believe this either. He SIGHS again, holds up his hand,\n          pulls the bandage from his wound: it's three inches long, a\n          deep gash into his palm.\n          JEFF (cont'd)\n          How long till it's inside me?\n          Amy is silent. He flexes his hand, and the wound opens,\n          mouthlike, blood oozing thickly from it.\n          JEFF (cont'd)\n          It already is, probably. I'll be\n          just like Stacy soon.\n          He turns, glances toward the spot where her body has\n          disappeared. Amy looks, too.\n\n          \n\n          \n\n          \n\n          \n\n          130.\n          JEFF (cont'd)\n          Then what? You, all alone on this\n          hill... you know how that would end,\n          don't you?\n          Once more, Amy is silent. He waves for her to keep eating,\n          and she starts in on the pretzels, mechanically. He opens\n          the can of Coke, hands it to her; she takes a long sip.\n          JEFF (cont'd)\n          Once you're in the jungle, you drop\n          and hide.\n          Another tendril slithers forward. It slips into the immense\n          puddle of blood beside Jeff and Amy, begins to drink it.\n          JEFF (cont'd)\n          They'll never find you--it's too\n          thick in there. Just burrow down,\n          and they'll run right past.\n          Jeff opens the can of nuts, sets it in front of Amy. Then he\n          gets up, crouches over the puddle of blood. He cups. his\n          hands, dips them into the puddle. He steps toward Amy,\n          smears the blood across her T-shirt. Amy keeps eating.\n          JEFF (cont'd)\n          It's sudden movements that'll get\n          you caught. So take your time.\n          You step, then listen. Then\n          another step, and listen again.\n          He moves back to the puddle, which the lone tendril continues'\n          to drain. He cups his hands, scoops up more blood, smears it\n          on her tattered khakis. Amy has finished the pretzels; she\n          reaches for the nuts, looking numb..\n          JEFF (cont'd)\n          East, always east--keep the sun at\n          your back.\n          He scoops up more blood from the puddle.\n          JEFF (cont'd)'\n          Arms.\n          Amy holds out her arms, and he smears the blood on them.\n          JEFF (cont'd)\n          You'll hear me yell. I'll yell\n          your name.\n\n          \n\n          \n\n          \n\n          \n\n          131.\n          He returns yet again to the puddle, then stands over her, the\n          blood cupped in his hands, dripping.\n          JEFF (cont'd)\n          And you can't hesitate.\n          Understand? Not for an instant.\n          Amy nods, and he uncups his hands over her head. She shuts\n          her eyes as the blood runs into her hair, down her forehead,\n          her neck, her face.\n\n          EXT. CLEARING/BASE OF THE HILL - DAY\n\n          Three of the Mayan men, as usual, sit in the clearing, bows\n          in their laps, facing the hill. The others are sheltering\n          from the sun in the line of shade along the jungle's margin,\n          some sleeping, some talking quietly together.\n          One of the men in the clearing suddenly rises to his feet,\n          nocking an arrow. The other two also rise. The Mayans along\n          the clearing fall silent, staring up the hill.\n\n          THE MAYANS' POV - UP THE HILL\n          Jeff is approaching down the trail, carrying Amy, pieta-like,\n          in his arms. Her body is limp, apparently lifeless, and\n          dripping with blood.\n\n          BACK TO SCENE\n          The bald Mayan emerges from the tree line, followed by yet\n          another man with a bow. They join the other three Mayans in\n          the center of the clearing. They all watch as Jeff reaches\n          the base of the trail, where he carefully lays Amy down.\n          Jeff crouches over Amy, laying her arms across her chest,\n          pushing the hair from her face. He bends, kisses her blood-\n          smeared forehead. Then he glances up at the Mayans.\n\n          JEFF\n          You don't even know her name.\n          The Mayans just stare at him. He rises to his feet, pulling\n          the knife from his belt: it's darkly stained with. blood.\n          JEFF (cont'd)\n          You should. You should know who\n          you're killing.\n\n          \n\n          \n\n          \n\n          \n\n          132.\n          He steps out into the clearing. The bald Mayan pulls his\n          pistol from its holster, raises it, aiming at Jeff's chest.\n          The others draw their bows. Jeff smiles, taps his sternum.\n          JEFF (cont'd)\n          Jeff. Understand? My name's Jeff.\n          He edges along the clearing's margin, keeping close to the\n          vines, moving away from Amy's body. The Mayans follow him,\n          weapons raised. After a handful of steps, he stops again,\n          turns toward them.\n          JEFF (cont'd)\n          Can you say it? Huh?\n          Again, the Mayans just stare. He SLAPS at his chest.\n          JEFF (cont'd)\n          Jeff.\n          A beat, then he suddenly YELLS, waving the knife at the men.\n          JEFF (cont'd)\n\n          SAY MY FUCKING NAME!\n          Silence. The Mayans stand there with their weapons raised,\n          waiting to see what he might do. A beat, then he starts\n          walking once more, along the clearing's edge, away from Amy.\n          Another ten yards and he stops again, waves up the hill.\n          JEFF (cont'd)\n          There's Stacy, too. And Eric.\n          Mathias. And Henrich. You've\n          killed them all.\n          He steps toward them. The bald man raises his hand, holds it\n          up, palm out, next to his pistol. Jeff smiles at him again.\n          JEFF (cont'd)\n          But not everyone.\n          He LAUGHS, a little wildly, and shakes his head.\n          JEFF (cont'd)\n          Look at you, you stupid fucks. You\n          have no idea what I'm saying, do\n          you?\n          He takes another step into the clearing. The bald man COCKS\n          his pistol, loudly. Several of the other Mayans have emerged\n          from the jungle; they stand there watching.\n\n          \n\n          \n\n          \n\n          \n\n          133.\n          JEFF (cont'd)\n          One of us is gonna survive. You\n          should know that name, too. You\n          fuckers. You bastards.\n          He takes yet another step forward. The bald man speaks a\n          string of words IN MAYAN, with an edge of warning. More\n          Mayans emerge from-the jungle, shielding their eyes against\n          the sun, staring. No one is looking in Amy's direction.\n          JEFF (cont'd)\n          It's not Jeff.\n          He shakes his head, his voice dropping, almost to a WHISPER:\n          JEFF .(cont'd)\n          It's not me.\n          He takes another step. And then, still QUIETLY:\n          JEFF (cont'd)\n          It's Amy. You hear?\n          He takes a deep breath, gathering himself. Then he YELLS--\n          JEFF (cont'd)\n\n          AMY;\n          --and starts to run, straight at the Mayans. He only manages\n          three steps before the bald man FIRES his pistol, and the\n          others let their arrows fly.\n          The bullet hits Jeff in the chest, just beneath his throat.\n          One of the arrows misses; the other three strike his stomach,\n          his left arm, his right thigh. Before he even hits the\n          ground, there's a SHOUT from the Mayans along the treeline.\n          The bald man turns. Amy is on her feet, sprinting for the\n          jungle. The bald man raises. his pistol, FIRES, but the shot\n          is too hurried; it goes wide. The others are still\n          scrambling for fresh arrows as she vanishes into the trees.\n          The bowmen sprint after her, disappearing into the jungle,\n          leaving the bald man alone in the clearing with Jeff. The\n          Mayan women stand motionless along the treeline, staring.\n          after Amy: they look mortified, grief-stricken.\n          Jeff is bleeding heavily from his wounds, struggling to crawl\n          forward, his breath frothing pinkly at his lips. A half\n          dozen tendrils slither into the clearing. They coil around\n          his legs, start to drag him back toward the hill. Jeff\n          fights them, kicking, MOANING, bleeding.\n\n          \n\n          \n\n          \n\n          \n\n          134.\n          The bald man watches. He, too, looks grief-stricken. He\n          steps forward, aims at Jeff's head. As he FIRES, WE:\n\n          CUT TO A BLACK SCREEN\n          WE HEAR footsteps, moving quickly down a tiled floor.\n\n          DOCTOR (O.S.)\n          (a slight Spanish accent)\n          She flagged down a tour bus, just\n          west of Coba--\n          The voice CARRIES OVER into:\n\n          INT. HOSPITAL CORRIDOR - MOVING - NIGHT\n\n          A Mexican DOCTOR, in his late fifties, balding, a little\n          stooped, his white jacket buttoned over a shirt and tie, is\n          hurrying down the corridor, accompanied by TERESA, a dark-\n          haired woman in beige slacks, a blue blouse.\n          Teresa has- a leather briefcase, a Blackberry on her belt.\n          She's holding Amy's passport,. which she examines as they\n          walk. It's smeared with dried blood.\n\n          DOCTOR\n          --and collapsed before the driver\n          even managed to open the door.\n          The corridor is brightly lit, very clean. Rooms open off it\n          on either side, and we glimpse the still.forms of sleeping\n          patients as we pass, IVs hanging from metal stands beside\n          their beds. It's very quiet.\n          DOCTOR (cont'd)\n          She revived briefly, just after\n          they brought her in. She was in\n          bad shape--severely dehydrated,\n          traumatized, in shock. And\n          terribly frightened. It was\n          impossible to make any sense of\n          what she was saying. She was\n          sobbing, hysterical. We had to\n          sedate her.\n          The doctor has a manila folder under his arm; he opens it,\n          pulls out a piece of paper: a color printout of a digital\n          photo. He hands it to Teresa.\n          DOCTOR (cont'd)\n          Her clothes were torn; she was\n          covered in blood. But not her own.\n\n          \n\n          \n\n          \n\n          \n\n          135.\n          Teresa stares down at the photo: it shows Amy on a gurney,\n          unconscious, blood-smeared, corpse-like.\n\n          TERESA\n          Now do you know?\n\n          DOCTOR\n          She has no wounds.\n          A uniformed policeman sits on a chair outside one of the\n          rooms at the end of the corridor, reading a newspaper. He\n          rises as they approach. Teresa hands the printout back to\n          the doctor; she keeps the passport.\n\n          TERESA\n          That's it? That's all you have?\n\n          DOCTOR\n          I'm afraid so.\n          Be nods to the policeman, and leads Teresa into:\n\n          INT. HOSPITAL ROOM - NIGHT\n\n          A bed, a night stand, a curtained window. Amy lies with a\n          sheet pulled to her chin, unconscious, an IV dripping into\n          her arm. They've cleaned the blood off her.\n          A NURSE sits in a chair beside the bed. She's in her early\n          twenties, with long dark hair tied in a bun. She stands up,\n          stepping back from the bed, as the doctor and Teresa enter.\n          The doctor addresses her in SUBTITLED SPANISH:\n\n          DOCTOR\n          Has she stirred?\n          The nurse shakes her head. The doctor moves to the bed. He\n          takes Amy's wrist, feeling for her-pulse. Amy's eyes open at\n          his touch. She stares at him, her arm hanging limply in his\n          grasp. He smiles down at her.\n\n          DOCTOR (cont'd)\n          There you are...\n          Teresa steps forward, and Amy's gaze shifts to her.\n\n          DOCTOR (cont'd)\n          My name is Dr. Hernandez...\n\n          Amy's eyes return to the doctor;. they fall on his face, then\n          drift down to his chest. The doctor gestures toward Teresa:\n\n          \n\n          \n\n          136.\n\n          DOCTOR (cont'd)\n          And this is Ms. Bern, from the U.S.\n          Consulate.\n          Amy is staring at his white coat, her expression going slack,\n          almost catatonic, all the life draining from it.\n\n          DOCTOR (cont'd)\n          we were hoping you might be able to\n          shed a little light on what you've\n          been through...\n\n          Amy is silent, still staring with that dead look in her eyes\n          at the doctor's coat: a faint green web of vine has taken\n          root there, spreading across the white fabric. WE HOLD on it\n          for a beat, and then:\n\n\n\n          THE END\n\n\n\n\n\n\nRuins, The\nWriters :   Scott Smith\nGenres :   Horror  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:34:24.721577"}