{"title": "Runaway Bride", "film_link": "/Movie Scripts/Runaway Bride Script.html", "script_link": "/scripts/Runaway-Bride.html", "info_raw": "\n\nRunaway Bride Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Josann McGibbon  Sara Parriott\nGenres  Comedy  Romance\nScript Date :  1999\n\nRead \"Runaway Bride\" Script\n\n\n", "script": "\n\n\n  R U N A W A Y   B R I D E\n\n  Screenplay by Sarah Parriott & Josann McGibbon\n\n  --------------------------------------------------------------\n\n  FADE IN\n\n  EXT. AN IMPOSSIBLE EXPANSE OF MARYLAND FARMLAND - DAY\n\n  The wind rustles the endless field of corn, blows over the\n  freshly mown meadow of soybeans, and magically sways a copse of\n  trees.\n\n  It's a Fall after-noon. A SUDDEN POUNDING OF GALLOPING HOOVES\n  breaks the peace and... A HORSE and RIDER burst between the rows\n  of corn into the meadow.  They are running for their lives.\n\n  CLOSE ON:\n\n  The rider is a bride -- a beautiful woman dressed in a\n  disheveled wedding gown, it's train tattered and flying like a\n  knight's banner out behind her. This is MAGGIE CARPENTER.\n\n  The horse is frothing and wild-eyed, like the bride, who turns\n  to look behind her in terror.  The horse's labored breathing\n  mingles with Maggie's panicked gasps.\n\n  We see a WEDDING BOUQUET fly into a ditch as the horse thunders\n  on.  Maggie clings to the reins.  She looks as though she is\n  running from the devil himself.\n\n  FADE TO BLACK\n\n  EXT. IKE'S APARTMENT BUILDING - DAY\n\n  Establishing.\n\n                CUT TO:\n\n  EXT. IKE'S APARTMENT BUILDING - DAY - ESTABLISHING SHOT\n\n  EXT. NEW YORK STREET - DAY\n\n          IKE (V.O.)\n    Hey, Fisher, pick up.  I have some\n    column ideas I want to bounce off you.\n    Not there?  Okay.  Listen I'm thinking\n    of writing about those mind-numbing\n    informercials that are always on.\n\n  Ike walks out of his apartment building talking on cell phone.\n\n          IKE (cont'd)\n    What do you think?  Good idea, right?\n    Boring, down to death, pointless -- It\n    sucks.\n\n  Ike yells at a CONSTRUCTION WORKER.\n\n          IKE (cont'd)\n    If you guys are here any longer,\n    they're gonna make you sign a lease.\n\n          CONSTRUCTION WORKER\n    Your column should be so funny.\n\n  Ike turns and walks down the street, talking into cell phone.\n\n          IKE\n    Okay, I was also thinking I might write\n    about...\n\n  He spots a RICH LADY with tons of diamonds getting out of a\n  Limousine, talking to a CHAUFFEUR.  He goes up to her.\n\n          IKE (cont'd)\n    Excuse me.  I was thinking of doing an\n    article on limousines.  What would you\n    say to people who never had a chance to\n    drive in a limo?\n\n  They walk up to her DOORMAN.\n\n          LADY\n    I'm sorry, I don't know any people like\n    that.\n\n  Ike walks off.  They stare at him as he goes.\n\n  EXT. ANOTHER NEW YORK STREET - DAY\n\n  Ike's talking on the phone to his friend's machine again.\n\n          IKE\n      (into phone)\n    Fisher?  Come on -- I know you're\n    sitting there laughing at me.  Pick up.\n    I want to run an idea past you.\n\n  Ike continues walking now in the full panic of writer's block.\n  He pleads into his friend's answering machine as he walks.\n\n          IKE (cont'd)\n      (into phone)\n    I just could use someone to toss it\n    back and forth with for a few minutes,\n    get the juice flowing, help me.  I have\n    an hour and twenty-seven minutes and\n    fifty-two seconds.  Hello?\n\n  He walks away from the t-shirt table towards the bar.  The\n  Vendor calls out to him.\n\n          T-SHIRT VENDOR\n    Hey, Ike, when are you going to put me\n    in an article?\n\n          IKE\n    When your t-shirts stop shrinking.\n\n  Ike enters the bar.  The Woman drops the shirt she was holding\n  and walks off with her children.  The T-shirt Vendor goes back\n  to selling his shirts.\n\n  INT. NEW YORK BAR - LATE DAY\n\n  Ike sits at the bar speaking to an attractive Woman nearby, a\n  MAN puts is USA Today on the bar and addresses the BARTENDER.\n\n              MAN\n    I see photos of a lot of dead writers\n    on these walls.  Got any living ones?\n    I have a story to tell that could win\n    one of them a Pulitzer.\n      (then, with enthusiasm)\n    Picture this, if you will.  A small\n    town in Maryland, a sleepy little\n    village, within that a hardware store...\n\n  The Man continues speaking as Ike and the woman continue their\n  conversation.\n\n          WOMAN\n    So what's in store for us in tomorrow's\n    column?\n\n          IKE\n    I don't know yet.  I'm kind of a last-\n    minute man.  Ideas don't flow until an\n    hour or two before deadline.\n\n  The Woman gets up and begins throwing darts.\n\n          WOMAN\n      (interrupting)\n    This is very interesting.  You get your\n    ideas for your column from life.  You\n    start up a conversation with a woman in\n    a bar, attack her choice of reading\n    material, try and get a rise out of her\n    while you contemplate whether or not\n    she's worth hitting on.\n\n          IKE\n    No, I can't hit on you until I get an\n    idea.\n\n  She starts throwing darts.\n\n          WOMAN\n    That's flattering.\n\n          IKE\n    No, you don't understand.\n\n  The Woman goes to her bar stool, gathering her bag and leaves a\n  tip for the Bartender.\n\n          WOMAN\n    I think I do understand.  So my not\n    responding to your baiting me will\n    inspire one of those potential bitter\n    diatribes you love to write about women\n    and all the things we do to drive men\n    crazy?\n\n          IKE\n      (taken aback)\n    I don't write bitter diatribes about\n    women... very often.\n\n  She whacks him with a newspaper, then shakes his hand.\n\n          WOMAN\n    Only when the ideas aren't flowing,\n    huh?  Well, it was very nice to meet\n    you, one-minute man.\n\n  The Woman leaves the bar.\n\n          IKE\n      (as she exits)\n    That's last minute man.\n      (then, louder)\n    And it's the quality that counts.\n\n          BARTENDER\n    You know, for a good looking man, you\n    strike out a lot.\n\n          MAN\n    I've seen much worse.\n\n  The phone rings.  Te Bartender answers it as Ike sits back on\n  his bar stool.  Ike grabs the woman's magazine that she left on\n  the bar and starts glancing at it.  The Man at the bar has heard\n  the whole thing.\n\n          MAN (cont'd)\n    I said, I've seen much worse.\n\n  Ike looks at the Man with reservation.  The Man is George\n  Swilling.\n\n          IKE\n    Excuse me?\n\n          MAN\n    The brush-off.\n\n  Ike gets up and moves to the dart board.  He removes the darts.\n\n          MAN (cont'd)\n    I've witnessed far more treacherous and\n    nefarious exits than that.  At least\n    she castigated you in private.\n\n          IKE\n    Not as private as I thought.\n\n  Ike turns slightly, giving the man his back.\n\n          IKE (cont'd)\n    Kevin, you've got some napkins?\n\n          BARTENDER\n    Writing or wiping?\n\n          IKE\n    Give me a pen.\n\n  The Bartender gives him cocktail napkins and a pen.  Ike starts\n  making notes.  Ike looks up from his writing.  The Man gets up\n  and starts throwing darts.\n\n          MAN\n      (throwing darts hard)\n    Ah, come on.  They deserve it.  They\n    love you, they hate you, they're hot,\n    they're cold, they're high, they're\n    low...\n\n          IKE\n    ... They're up, they're down.  It's\n    really fun making this list with you,\n    but I've got a column to go write.\n\n          BARTENDER\n    Ike.\n\n          MAN\n      (undeterred)\n    But you don't have a really superb idea!\n    Well, there's a girl from my hometown\n    you could write about.\n\n  Ike moves to the Bartender and pays him.\n\n          BARTENDER\n      (to Man)\n    Excuse me, we don't need any new ideas.\n\n          MAN\n    She likes to dump grooms right at the\n    altar.  They call her \"The Runaway\n    Bride\".\n\n  Both Ike and Bartender turn and stare.\n\n          MAN\n    She performed the travesty seven or\n    eight times.  Right at the altar she\n    turns around and runs like hell.\n    Bolts.\n\n  Ike turns and heads for the door.  The Man calls after him,\n  getting up from his stool without stopping his enthusiastic\n  story.\n\n          MAN (cont'd)\n    Adios.  Plows down the aisle, knocking\n    old ladies out of her way like the\n    running of the bulls at Pamplona.  And\n    guess what?\n\n          IKE\n    I give up.\n\n          MAN\n    She has the next victim all lined up.\n    She's twirling another body on the\n    spit.\n\n  Ike stops in his tracks.  He turns back around in spite of\n  himself.\n\n          MAN\n      (beginning his story)\n    Imagine if you will, a small town in\n    Maryland...\n\n              CUT TO:\n\n  INT. IKE'S APARTMENT - DUSK\n\n  Ike sits at his computer, cassette player with Miles Davis PLAYS\n  next to him as he types away reading his handiwork to himself.\n\n          IKE\n      (reading)\n    \"Today is a day of profound\n    introspection, I have been accused\n    of using this column to direct bitter\n    diatribes at the opposite sex!  This\n    uncomfortable accusation has plunged me\n    into at least fifteen minutes of\n    serious reflection, from which I have\n    emerged with the conclusion that, yes\n    -- I traffic in female stereotypes.\"\n\n  EXT. USA TODAY OFFICE - DAY\n\n  FISHER walks through the main office reading the paper.\n\n          FISHER\n    \"But how can one blame me when every\n    time I step out my front door I meet\n    fresh proof that the female archetypes\n    are alive and well?  Te mother, the\n    virgin, the whore, the crone; they're\n    elbowing you in the subway, stealing\n    your cabs, and overwhelming you with\n    perfume in elevators.\"\n\n  INT. USA TODAY OFFICE - CONTINUOUS\n\n  Elaine at her desk reads aloud to herself.\n\n          ELAINE\n    \"But perhaps, in fairness to the fairer\n    sex, I do need to broaden my horizon\n    and add some new goddesses to the\n    pantheon: I would like to nominate for\n    deity...\"\n\n  Fisher hands a file to Elaine.\n\n          FISHER\n    \"... The cheerleader, the coed, and the\n    man-eater, the last of which concerns me\n    most today.\"\n\n  Fisher leaves and we hold a USA Today sign.\n\n              CUT TO:\n\n  INT. NEW YORK BAR - DAY\n\n  The Man comes out of the men's room reading the USA Today,\n  Kevin, the Bartender, stands on the bar reading the same\n  article.\n\n          MAN\n      (reads)\n    \"To be fair, the man-eater isn't\n    exactly new.  In Ancient Greece, this\n    fearsome female was known as Erinys,\n    the devouring death goddess.  In India,\n    she is Kali, who likes to devour her\n    boyfriend Shiva's entrails while her\n    yoni devour his -- dot dot dot, never\n    mind.  In Indonesia, the bloody-jawed\n    man-eater is called Ragma...\"\n\n  Te Man sits at the bar near to the Bartender.\n\n          BARTENDER\n    You noticed these are all countries\n    without cable.\n      (then, continues\n       reading)\n    \"... And in Hale, Maryland where she\n    helps run the family hardware store.\n    She is known as Miss Maggie Carpenter\n    ...\"\n      (mispronounces)\n    \".... AKA, the Runaway Bride.\"\n\n              CUT TO:\n\n  EXT. USA TODAY LOADING DOCK - DAY\n\n  WORKERS read the above article.\n\n  INT./EXT. BEAUTY PARLOR / HALE, MARYLAND - DAY\n\n  PEGGY and MRS. PRESSMAN exit the parlor and stroll down the\n  street. (lowers her paper and reads.)\n\n          PEGGY (cont'd)\n    \"... And in Hale, Maryland where she\n    helps run the family hardware store.\"\n      (to the Women)\n    We have to go to Maggie.  Cindy, mind\n    the shop.\n      (exits salon;\n       continues reading)\n    \"... She is known as Miss Maggie\n    Carpenter, AKA, the Runaway Bride.\"\n\n          MRS. PRESSMAN\n    Holy moly.\n\n  The older one, Mrs. Pressman, listens with a pained expression\n  as the younger one, Peggy, continues to read the column aloud.\n  Neither one can believe what they're reading.\n\n          PEGGY\n      (reads)\n    \"What is unusual about Miss Carpenter\n    is that she likes to dress her men up\n    as grooms before she devours them.  She\n    has already disemboweled six in a row\n    by leaving them at the altar.\"... I\n    can't ready anymore.\n\n          MRS. PRESSMAN\n      (takes paper from\n       her, reads)\n    \"And her ritual feast continues as she\n    prepares to make a sacrifice out of the\n    seventh fiance.  So all bets are on and\n    we hope that this boomerang bride isn't\n    honeymooning with Las Vegas odds makers\n    because many predict that this girl is\n    out of there before the race... before\n    the rice hits the ground\"\n      (then)\n    Holy moly.\n\n  Peggy and Mrs. Pressman step into a hardware store.\n\n  INT. HARDWARE STORE - CONTINUOUS\n\n  Peggy and Mrs. Pressman enter, worried.\n\n          MRS. PRESSMAN\n    You tell Maggie.\n\n          PEGGY\n    No, you tell her.\n\n          MRS. PRESSMAN\n    No, no.  You're her best friend.\n\n          PEGGY\n    No.\n\n          MRS. PRESSMAN\n      (holding her\n       newspaper)\n    You know, it's just possible that she\n    hasn't read this yet.\n\n          PEGGY\n    Yeah.\n\n          MRS. PRESSMAN\n    Maybe she hasn't read the paper...\n\n  On the counter, they see a copy of USA Today opened to the\n  article about Maggie.\n\n          MRS. PRESSMAN (cont'd)\n    ... Or not!\n\n  We follow MAGGIE down the back stairs inside The Hale Hardware\n  Store, the prettiest, most welcoming shop of its kind anywhere\n  in small town USA.  Somehow the place ha taken on the spirit of\n  the owner's daughter; both stop and shop-girl radiate brightness,\n  charm, and possibility.  Maggie comes down steps with a faucet\n  handle and goes to an elderly customer, MR. PAXTON.\n\n          MAGGIE\n      (bright)\n    Here we go!  One antique hot water\n    handle with the \"HOT\" still on it,\n    guaranteed to fit any American Standard\n    cast iron tub with a four-inch center\n    made between 1924 and 1938.  In other\n    words, I think you're out of the\n    doghouse with Mrs. Paxton.\n\n          MR. PAXTON\n      (amazed)\n    Hallelujah.\n\n          MAGGIE\n    Alright, Mr. Paxton, I'll put it on\n    your account.\n\n  Maggie rounds the bend, another customer, EARL, stands by the\n  paint machine.\n\n          EARL\n    Maggie.\n\n          MAGGIE\n      (walking past customer)\n    You don't need an air conditioner, Earl,\n    you just need an attic fan -- There's\n    more in the back.\n\n  Maggie steps behind the front counter of the store and takes the\n  account book out.  Her voice trails off as she sees the dour\n  expression on the faces of her friends.\n\n          MAGGIE (cont'd)\n    What?\n\n  Peggy nervously mentions the newspaper.\n\n          PEGGY\n      (delicate)\n    So -- Mag -- you've seen this, huh?\n\n          MAGGIE\n      (serious)\n    Yes, I've seen it.  And I have to say\n    it's the rudest and most offensive...\n    joke anybody's ever played on me!\n\n  To their amazement, Maggie starts smiling.\n\n          MAGGIE (cont'd)\n    You guys!  How long did this take you?\n\n  Maggie stays amused.\n\n          MAGGIE (cont'd)\n    Where'd you get this done?\n      (laughing)\n    You creeps!  I should disinvite you!\n    And why did you say seven times?  This\n    is four.\n\n          PEGGY\n    Uh, Maggie, you told us to bachelorette\n    jokes, so we didn't...\n\n  Maggie looks at the stricken face of her friends.\n\n          MRS. PRESSMAN\n    Holy moly.\n\n  Peggy looks like she is going to cry with sympathy for Maggie.\n  Maggie is starting to feel uncomfortable.  She looks down,\n  dubiously, at the paper.\n\n          MAGGIE\n    Um, you know, now would be a good\n    moment to tell me this is fake.\n      (no response)\n    It won't be funny if you drag it out.\n    Okay?\n      (no response)\n    Okay, well... I mean, I can find out...\n    Real newspapers smear.  Phoney papers\n    don't.\n\n  She picks up the paper and brushes it against her apron, leaving\n  an INK SMEAR!!\n\n  She nearly kneels over.\n\n          MAGGIE (cont'd)\n      (sitting)\n    Bag.\n\n  Peggy and Mrs. Pressman immediately spring to her side.  They\n  give her a bag to breathe in.\n\n          MRS. PRESSMAN\n    Bag.\n\n              CUT TO:\n\n  INT. MAGGIE'S WORKOUT ROOM/GYM - NIGHT\n\n  We see Maggie kickboxing in anger.  The radio is on.  She\n  suddenly stops, yanks Ike's article off the wall, leaves her\n  workout area and goes to her desk.\n\n  ANGLE ON DESK AREA:\n\n  She turns off the radio and begins to type her letter.\n\n          MAGGIE (V.O.)\n      \"Dear Editor...\"\n\n  EXT. MANHATTAN - DAY - ESTABLISHING SHOT\n\n  As Maggie's VOICE-OVER continues to read her letter, we take in\n  a Manhattan busy day.  It is big, loud, and anonymous.\n\n          MAGGIE (V.O.; cont'd)\n    \"Greeting from the sticks!  Perhaps you\n    believe that a rural education is\n    focused mainly on hog calling and\n    tractor maintenance rather than reading.\n    Why else would you print a piece of\n    fiction about me and call it fact?\"\n\n  Te CAMERA FINDS Ike, striding across a busy street, dodging\n  taxies.  A WOMAN smacks him with a newspaper.  He passes a WOMAN\n  TRAFFIC OFFICER, then a hot dog stand.  He greets and passes a\n  FALAFEL VENDOR.  THE CAMERA PANS to a USA Today Truck.\n\n          MAGGIE (V.O.; cont'd)\n    \"I suppose Mr. Graham was too busy\n    thinking us slanderous statements about\n    how I dump men for kicks to bother with\n    something silly like accuracy in\n    reporting.  Which is understandable,\n    because with a \"man-eater\" like me on\n    the loose, who has time to check facts?\"\n\n  EXT. USA TODAY LOADING DOCKS - CONTINUOUS\n\n  He passes regular GUYS who cheer him.\n\n          MAGGIE (V.O.; cont'd)\n    \"Still, we cannibalistic queens can get\n    pretty cranky when we see things in\n    print that hurt our feelings, like that\n    we deliberately abandon fiances with\n    malice aforethought.\"\n\n  INT. USA TODAY LOADING DOCKS - CONTINUOUS\n\n  He enters the newspaper building, going to Ellie's office.\n\n  INT. USA TODAY OFFICE - CONTINUOUS\n\n  He walks through the crowded city room.  His arrival attracts a\n  lot of attention from his CO-WORKERS.  Ike seems a little\n  surprised, but he's pleased.\n\n          MAGGIE (V.O.; cont'd)\n    \"That's why I was surprised to find Mr.\n    Graham's editor was a woman. Call me a\n    sentimental fool, but I sort of hoped\n    we man-eater could stick together.\"\n\n  Ike works his way down the hall to the editor's office.  CHUFFA\n  Ike greets various workers.  He steps up to the editor's\n  secretary, ELAINE.  She doesn't smile.\n\n          IKE\n      (to Elaine)\n    I'll put in a good word for you.\n\n          ELAINE\n    No, no, don't mention my name in there.\n\n          IKE\n    Why?\n\n  A buzz.\n\n          ELAINE\n    You can go in now.\n\n  Ike goes into Ellie's office.  Elaine picks up her phone.\n\n              CUT TO:\n\n  INT. ELLIE'S OFFICE - CONTINUOUS\n\n  ELLIE is that editor.  Stylish and successful looking, she's\n  about Ike's age.  Ellie sits behind a big desk with a scowl on\n  her pretty face.  Her casual-looking husband, Fisher, sits\n  nonchalantly on the arm of the couch.  Ike enters as Ellie reads\n  Maggie's letter.\n\n          ELLIE\n      (reading letter)\n    \"Anyway, I'm just dropping you big city\n    folk this little note to say that I have\n    thought of a ritual sacrifice that would\n    satisfy my current appetite: Ike\n    Graham's column on a platter.  Yours\n    truly, Maggie Carpenter.  P.S. -- I\n    have inclosed a list of the gross\n    factual misrepresentations in your\n    article.  There are fifteen.\"\n\n  Ike sits as Ellie puts the letter down and takes off her glasses.\n\n          IKE\n      (chuckles as he sits)\n    Fully.  I like her.  She has wit.\n\n          ELLIE\n    I left four messages.  You don't return\n    my calls.\n\n          IKE\n    So?  I never returned your calls, even\n    when we were married.  And what's\n    Fisher doing here anyway?\n\n  Fisher gets and places a photo of the cat on a bookshelf on his\n  way to the other side of the room.\n\n          FISHER\n    Ellie asked me to come down to offer\n    moral support.\n\n          IKE\n    Since when does Ellie need moral supp--\n\n          ELLIE\n    -- It's for you, Ike.\n\n          IKE\n    What?\n\n          ELLIE\n    Journalism lesson number one.  If you\n    fabricate your facts, you get fired.\n\n  Ellie pushes USA Today lawyer's letter across the desk for him\n  to read.  Ike picks it up and skims the letter.  His face is as\n  impassive as stone.\n\n          IKE\n    Lesson number two.  Never work for your\n    former spouse.\n\n          ELLIE\n    That's not nothing to do with it.  You\n    cooked this story up and you know it.\n\n          IKE\n    I didn't cook up a story.  I had a\n    source.\n\n          ELLIE\n    Someone reliable, I'm sure.  A booze-\n    hound in a bar?\n\n          FISHER\n    In vino veritas.\n\n          IKE\n    Don't knock drunk guys in bars.  Drunk\n    guys in bars are good.  It means\n    they're not driving.\n\n  Ike gets up and stands near Ellie, making his point.\n\n          IKE (cont'd)\n    Besides, I'm a columnist.  This is what\n    columnists are supposed to do.  This is\n    what you like.  We push, we stretch, we\n    go out on a limo.  That's what makes me\n    good!\n\n          ELLIE\n    No, that's what makes you unemployed.\n\n          IKE\n    I merely write the stuff.  You're the\n    one that serves it up.\n\n  Ike puts down the letter and puts his glasses back into his\n  pocket.\n\n          ELLIE\n    Not anymore.  I have to draw the line.\n      (pushing a piece\n       of paper)\n    She sent us this list.  Our lawyers say\n    it's actionable.\n\n  Ellie hands Ike Maggie's list.\n\n          IKE\n      (scoffs)\n    Lawyers.\n      (glances at list)\n    I don't know, Ellie -- Firing me is\n    going to be very tough on you.  It's\n    going to be hard to get over.  There\n    will be therapy bills for you.\n\n          ELLIE\n      (shrugs)\n    I already made an appointment for later\n    today.\n\n          IKE\n      (putting the list\n       down, standing)\n    See?  You want custody of my job? ...\n    Why not just consider my wrist slapped\n    and call me when you feel I've served\n    my time?\n\n          ELLIE\n    I'm sorry, Ike.  This is permanent.\n\n  Fisher winces and looks away.  Ike and Ellie look at each other\n  for a sober moment.\n\n          ELLIE (V.O.; cont'd)\n    If you go quietly, I'll get you\n    severance pay.\n\n  Ellie fidgets with her toy rake, then Ike heads for the door.\n  He laughs a little at the painful truth of her words and walks\n  out.  Ellie collapses back in her chair.  Fisher goes to her and\n  rubs her shoulders.\n\n  EXT. USA TODAY LOADING DOCK - DAY\n\n  Ike rides sadly on the back of a forklift, gets off and walks\n  out.\n\n  EXT. HALE RESIDENTIAL STREET - ANOTHER MORNING\n\n  ANGLE ON MAGGIE'S HOUSE:\n\n  A train goes by.  A modest clapboard house with a porch.  Two\n  entrances.  A PAPERBOY tosses a paper onto the lawn in front of\n  the house.  The front door opens and Maggie appears fresh out of\n  bed, wearing only a jacket and panties.  Heedless of being seen\n  this way, she scampers out to the sidewalk to pick up her\n  delivered paper:  USA Today.  She tears off the plastic bag and\n  rips into it, looking for her letter.  She finds it.  A smile on\n  her face, then she scampers back into the house.\n\n  INT. MAGGIE'S HOUSE - THAT MOMENT\n\n  Maggie skips back into her house which she shares with Father\n  and Grandma.  A cozy and eclectic place creatively furnished on\n  a shoe-string.  She rushes into:  KITCHEN WHERE BOB KELLY,\n  fiance #4, is packing cans into a backpack.  Bob, 38, has a\n  pleasant face and a body that is almost shockingly buff.  He's\n  wearing a T-shirt that reads: \"Mountaineers Do It Against the\n  Wall.\", Maggie dances over, waving the paper and singing.\n\n          MAGGIE\n    She canned him, she canned him...\n\n  Bob test the weight of the backpack adding dehydrate food.\n\n          BOB\n    Come here, Mag, and try this on.\n\n  Maggie puts the paper on the kitchen counter and starts to read\n  aloud, paying no mind to Bob, who is sticking her arms through\n  the straps of the backpack.\n\n          MAGGIE\n    Listen: \"Dear Ms. Carpenter, I\n    apologize to you for this unfortunate\n    matter.  Ike Graham's column will no\n    longer be appearing in this paper.\n    Best of luck in you upcoming marriage!\"\n\n  Bob continues to hold up the weight of the backpack as he straps\n  it onto Maggie's shoulders.\n\n          BOB\n    That-a-girl!  You sacked him.\n      (checking pack)\n    This is the weight of the pack you're\n    going to have to carry in the Himalayas.\n    Tell me if it's too heavy.\n\n  Bob lets go and Maggie FALLS BACKWARD, disappearing behind the\n  counter, and hitting the floor, with a THUD.  Bob looks down at\n  her.  Maggie's voice rises from the floor behind the counter.\n\n          MAGGIE (o.s.)\n    It's a little... It's a little heavy...\n    Help me, baby.\n\n  Bob has no answer.  He reaches a hand down.  He yelps as Maggie\n  pulls him down on top of her, out of frame.  We HEAR them giggle\n  and kiss.\n\n  INT. USA TODAY LOADING DOCK - ANOTHER DAY\n\n  Fisher uses the dock for a photo shoot featuring men and women\n  in evening and formal wear from Escada for G.Q.  Fisher is not\n  actually shooting the camera, but rather supervising it.\n  Fisher claps his hands and calls the models to attention.  Then\n  he goes onto the stage and sets the models in their positions.\n\n          FISHER (cont'd)\n    Remember, we are putting the \"fun\" back\n    into formal.\n      (to Ike)\n    I just say that for the agency guys.  I\n    don't even know what that means.  Now\n    follow me.\n\n  INT. USA TODAY OBSERVATION ROOM - DAY\n\n  Elevator doors open.  Ike and Fisher exit and walk towards the\n  coffee table.\n\n          FISHER\n    Ike, I really liked the Runaway Bride\n    piece, and since I do freelance stuff\n    for G.Q., I'm in a different position\n    now...\n\n          IKE\n    What are you trying to say to me, Fish?\n\n  They stop walking.\n\n          FISHER\n    Vindication.  How would you like to get\n    some?  A chance to prove that, though\n    your facts weren't entirely straight,\n    your theory was correct.\n\n          IKE\n      (hiding his hope)\n    The real story on Miss Carpenter.\n\n          FISHER\n    All the gory details.\n\n  They start walking again.\n\n          IKE\n      (excited)\n    The anatomy of the black widow spider\n    of Maryland.\n\n          FISHER\n    It wouldn't be a bad way to get you\n    back into writing feature pieces\n    again.\n\n          IKE\n      (enthusiastically)\n    This is good.  It is a good story,\n    Fish.\n\n  They stop at the coffee table and grab something to eat.\n\n          FISHER\n      (nods)\n    If she runs, then it's a cover story.\n    All true.  All accurate.\n\n          IKE\n      (confesses)\n    Okay, you were right.  I hated my\n    column, but I can do this assignment.\n\n          FISHER\n    Then you've got it.  If you leave\n    tomorrow for the hinterlands, you'll\n    have plenty of time before her next\n    wedding trot.\n\n          IKE\n    \"Paid vindication\"  That's what I call\n    justice.\n\n          FISHER\n    Justice, yes.  Paid, I don't know.\n    They like the idea, but my hands are\n    tied with budget restraints.\n\n          IKE\n    But I'll get my normal fee, right?\n\n  He walks away.\n\n          IKE\n    You want me to do it on spec?!\n\n  He follows him.\n\n              CUT TO:\n\n  EXT. MARYLAND HIGHWAY - DAY\n\n  We see Ike driving down the highway.  The car sputters a little\n  as he and Fisher continue their conversation in voice-over. (If\n  needed by the editor.)\n\n          FISHER (V.O.)\n    Don't say \"spec\" like it's a dirty word.\n    Nobody ever paid Shakespeare to write a\n    play!  Plato never got a book advance...\n\n          IKE (V.O.)\n    Oh yeah!  I happen to know from\n    reliable sources that Nietzche got\n    expenses and a rental car.\n\n  We hear Fisher laugh.\n\n          IKE (V.O.; cont'd)\n    I'm going to make this work, Fish.  I'm\n    going to do it!\n\n  Ike's car drives into Hale, passing a billboard reading,\n  \"Welcome to Hale.\"\n\n              CUT TO:\n\n  EXT. HALE STREET - DAY\n\n  Ike drives down picturesque Main Street.  He passes Hale\n  Hardware.  Sign says: \"At Curl.  Be back soon.\"\n\n  EXT. ATLANTIC HOTEL - DAY\n\n  A BARBERSHOP QUARTET is singing in front of the only hotel in\n  town.  Ike pulls up and goes inside.\n\n  INT. LOBBY/ATLANTIC HOTEL - DAY\n\n  Ike has checked into the Atlantic Hotel.  The clerk, LEE, hands\n  him his key.  Ike asks about room service and the restaurant.\n  An OLDER WOMAN asks him if he plays bridge as he goes up the\n  stairs to his room.\n\n  EXT. HALE MAIN STREET - DAY\n\n  Ike exits his hotel as the Barber Shop Quartet finishes singing\n  \"Camptown Races.\"\n\n  He now walks down the charming main artery of the town, looking\n  exactly like what he is:  a cynical New York out of his element\n  on sunny Main Street, USA.  KIDS ride by on bikes, streaming\n  balloons behind them.  A balloon hits Ike on the face.  As he\n  crosses the street, he mutters into his tape recorder:\n\n          IKE\n    I think I'm in Maryberry.\n\n  Flags hang on all the storefronts and the place sparkles with\n  wholesome attitudes as PEOPLE greet each other familiarly.  Ike\n  comes to beauty parlor called \"Curl Up and Dye\".  The place is\n  doing business and crowded with WOMEN.\n\n  INT. BEAUTY PARLOR - DAY\n\n  Cindy, the manicurist, does Mrs. Pressman's nails.  Maggie sits\n  on the floor next to Peggy's salon chair, fixing the base of a\n  barber chair.  She tightens a screw and looks up, satisfied.\n  Cindy's dog is on the floor near Maggie.\n\n          MAGGIE\n    Cindy, you better 86 Sprout.  He seems\n    to be enjoying the petroleum\n    distillates.\n\n  Cindy rolls over in her chair, picks up her dog and rolls back\n  to her station.\n\n          CINDY\n    That's it.  Back to obedience school.\n\n          MAGGIE\n      (to Peggy)\n    Okay -- have a seat... gently,\n    carefully.\n\n  Peggy sits in the chair.  Maggie spins her around and around.\n\n          PEGGY\n      (delighted as\n       she spins)\n    You're a goddess!\n\n          MAGGIE\n    I didn't even need to change this\n    gasket, just put in a little hydraulic\n    fluid.\n\n          PEGGY\n    Stop it.  When you talk like that, I\n    get turned on and it frightens me.\n\n  JUST THEN.  Ike enters the salon, taking off his sunglasses.\n  Peggy hops off the chair.\n\n          IKE\n    Hello.  I'm looking for Maggie\n    Carpenter.  There was a sign at the\n    hardware store across the street...\n\n          PEGGY\n    Are you a reporter?\n\n  It's a little early in the game for Ike to be thrown off guard.\n\n          IKE\n      (shocked)\n    What?\n\n          PEGGY\n      (eyeing his loafers)\n    It's been our experience that anyone\n    with some sort of gewgaw on his loafers\n    ends up being another big city reporter\n    wanting to interview Maggie.\n\n          IKE\n    About her upcoming wedding and all.\n\n          PEGGY\n    No, about her getting that asshole from\n    New York fired.\n\n  Ike smiles down at his loafers and shrugs.\n\n          IKE\n    I am just such a reporter.  And you are?\n\n          PEGGY\n    Peggy Phleming.  Not the ice skater.\n\n  Peggy steps aside.  Ike moves toward Cindy and Mrs. Pressman.\n\n          IKE\n    And who are these lovely ladies?\n\n  Te ladies shake his hand and introduce themselves.\n\n          CINDY\n    Cindy.  Maggie's unmarried cousin.\n\n          MRS. PRESSMAN\n    Mrs. Pressman.  No relation.\n\n          PEGGY\n    And you are?\n\n          IKE\n      (turning toward her)\n    Looking for Maggie.\n\n          PEGGY\n    Yep.  Maggie -- Someone to see you.\n\n  Maggie looks over from her sitting position on the floor.  She\n  gives Ike the once-over, focusing on the shoes.\n\n          MAGGIE\n      (yelling to Peggy)\n    Reporter?\n\n          PEGGY\n    Yup!\n\n  Ike crouches to see Maggie on the floor just as she rises to her\n  feet.  Ike straightens up.  For a moment, he is thrown by her\n  beauty and intelligent eyes.\n\n          MAGGIE\n    I hope you have a different angle.\n    It's pretty much all been covered.\n\n          IKE\n    Originality is my speciality.\n\n          MAGGIE\n    Excellent.\n\n          PEGGY\n    Hold on -- Nobody interviews Maggie in\n    here unless they're getting haircut.\n\n          MAGGIE\n    She's the boss.\n\n          IKE\n    Sorry, no.  I just got one.\n\n          MRS. PRESSMAN\n      (to Ike)\n    Excuse me, sir.  I have an actual fact\n    for you.\n\n          IKE\n      (steps to Mrs. Pressman)\n    Yes, Mrs. Pressman.\n\n          MRS. PRESSMAN\n    It's her fourth time to the altar, you\n    know.  Not seven like they said.\n\n          IKE\n    I know.  Tell me something.  Do you\n    think she's going to make it all the\n    way this time?\n\n  During the Ike/Mrs. Pressman exchange, Maggie looks at Ike.\n  There's something familiar about him.  She looks over at Peggy\n  and beckons her to a copy of Ike's column affixed to a mirror.\n  A goatee and horns, have been scrawled on Ike's byline picture.\n  He's been \"devilized\".  Peggy coughs as she recognizes Ike in\n  the newspaper clipping.\n\n          MAGGIE\n    She swallowed her gun.\n\n  Mrs. Pressman continues her story to Ike.\n\n          MRS. PRESSMAN\n    I'm not sure.  Mr. Schullian runs the\n    newsstand, he's our local bookie, you\n    know, he's giving eight to one odds she\n    won't.  He says she's so famous now,\n    maybe Vegas will give odds on her.  I'm\n    going to wait to hear what the pros say.\n\n          IKE\n    Good fact.  Well, you let me know.\n\n          MRS. PRESSMAN\n    Oh, I will.\n\n  ANGLE ON:\n\n  Maggie indicates column to Peggy.  She looks over at the part of\n  the shop used to wash and dye hair.  There's a sink, stool and a\n  cabinet affixed to the wall above sink, which holds various\n  shampoos and hair dyes.  Maggie gets an idea.  Maggie and Peggy\n  step forward toward Ike.\n\n          MAGGIE\n    Well, instead of a haircut, how about\n    a wash?  You know, get all that city\n    grit out of it.\n\n          IKE\n    You'll answer my questions?\n\n  Maggie nods affirmatively.\n\n          IKE (cont'd)\n      (removing his jacket)\n    Fine.  You wash, I'll ask the\n    questions.\n\n          PEGGY\n    Great.\n\n  Ike hands Peggy his jacket.  A mystified Peggy leads Ike to the\n  sink.  While she does this...\n\n          MAGGIE\n    Have a seat.  Peggy, why don't you give\n    him the special treatment that\n    strengthens the follicles.\n\n  Ike sits in the chair near the sink.  Maggie shakes out a smock\n  and puts it around Ike.\n\n          MAGGIE (cont'd)\n    So, what do you want to know?\n\n  Ike leans and rests his head on the sink.  Peggy bends over him\n  and wets his hair.  She grabs various hair coloring products.\n\n          IKE\n    Getting nervous?\n\n          MAGGIE\n    Nervous?  Not at all!  No.  I've never\n    been more certain in my life.  Except\n    -- I am having all kinds of weird\n    dreams.\n\n  Ike pulls the cloth down from over his face.\n\n          IKE\n    Weird dreams?  You're going to tell me\n    about them?\n\n          MAGGIE\n    Yes.\n\n          PEGGY\n      (calming)\n    Let's just put this back here for the\n    aromatherapy.\n\n  Peggy recovers his face, then continues to fuss with the hair\n  coloring products.  Maggie helps.\n\n  INT. BEAUTY PARLOR - LATER\n\n  Ike sits with a towel over his head as Peggy blow-dries the back\n  of his head.  His back is to the mirror, his body faces Maggie.\n  Cindy does her own nails as Mrs. Pressman scratches off lottery\n  tickets.  The dog, Sprout, sits in is basket.\n\n          MAGGIE\n    In another one...\n\n  PETE, wearing a hat, comes in the front door of the salon.\n\n          PEGGY\n    Hey, Pete, I'll be right with you.\n\n  Ike peeks out from under his towel as Maggie continues.\n\n          MAGGIE\n    I'm inside the church.  Everyone I know\n    is there, only they're not really them.\n    They're like Frankenstein monsters, but\n    without the bolts coming out of their\n    necks.  It's all very \"Night of the\n    Living Dead\".  And here's the creepiest\n    part -- I look down at my dress and\n    it's red.  I mean, I have no idea what\n    it means.  Red's not my color!\n\n  Ike listens intently and stares steadily into her eyes.  Peggy\n  removes the towel.  His hair is divided into equal parts and\n  dyed orange and red.\n\n          MAGGIE (cont'd)\n    So what do you think?\n\n  Ike stares back at her, the tickle of suspicion creeping up his\n  spine.\n\n          IKE\n    I think you'd look good in red.\n\n          PEGGY\n    No, she's talking about your hair.\n\n  Maggie swivels his chair so that Ike faces the mirror.  Ike\n  looks at his brightly colored hair.\n\n          MAGGIE\n    You're all ready for football season,\n    Mr. Graham.\n\n  Ike stares at his hair in total confusion.  With icy calm, Ike\n  rises from his chair and primps the end of his hair as if giving\n  it the finishing touches.  Then he sees his defaced newspaper\n  clipping and all becomes clear.  He picks up the article and\n  shows it to everyone.  Ike does a slow burn.\n\n          IKE\n    Yes, I think I nailed the personality\n    profile of the women of Hale.\n\n  Ike turns and puts the clipping up on the mirror.\n\n          IKE (cont'd)\n      (to Peggy)\n    My jacket, please.\n\n  Peggy hands him his jacket.\n\n          IKE (cont'd)\n      (sarcastically)\n    Thank you.\n\n  Ike moves toward the door.  He spots Pete.\n\n          IKE (cont'd)\n      (putting on jacket;\n       to Pete)\n    Excuse me, Pete, do you know a place\n    that sells shampoo... Strong shampoo?\n\n      PETE\n    Doc's Pharmacy.  Third and Elm.  Tell\n    him Pete sent you.  Want my hat?\n\n          IKE\n    No thanks.\n\n  Ike smiles at Maggie and exits.\n\n          MAGGIE\n      (to Peggy)\n    He seems crabby.\n\n              CUT TO:\n\n  EXT. MAIN STREET - DAY\n\n  In front of beauty salon, Maggie follows Ike out.\n\n          MAGGIE\n    If you're looking for Elm Street, it's\n    that way.\n\n  She puts on her sunglasses.\n\n          IKE\n    Thank you.\n\n  He walks the other way.\n\n          MAGGIE\n    If you came down here in the pursuit of\n    happiness, you might as well go back.\n    Because you can't make me feel bad.\n\n  She stops walking and turns to Ike.\n\n          IKE\n    I'm not here to make you feel bad.  I'm\n    here for vindication.  In my heart...\n\n          MAGGIE\n    You have one?\n\n  Ike walks back to Maggie.\n\n          IKE\n    I feel I'm right about you.  You got me\n    fired, lady.  You destroyed my\n    reputation and you screwed up my hair.\n    You chew men up, spit them out and\n    loved it.  And I'm down here to satisfy\n    myself on that point.\n\n  PASSERSBY stare at Ike's hair and giggle.\n\n          MAGGIE\n    Did something happen to make you care\n    about reality?\n\n          IKE\n    Yes.  Conviction.  Conviction that I'm\n    onto the truth.  You're going to do the\n    same thing to \"poor bastard number four\"\n    that you did to the last three.  You're\n    going to run again.  And I'm not\n    leaving until you do.\n\n          MAGGIE\n    You're going to be very disappointed.\n\n          IKE\n    We'll see.\n\n          MAGGIE\n    I'd love to stay and chat, but I've got\n    to get back to work.  I still have my\n    job.\n\n  He stares at her for a beat, stung by her words.\n\n          MAGGIE\n    I have nothing to hide, Mr. Graham.\n    Talk to whoever you want.  You might\n    actually stumble upon a fact or two.\n\n  Maggie walks away.  Ike walks a few steps and stops at a KID on\n  a bike.\n\n          IKE\n    Hey, kid, I'll give you ten bucks for\n    your hat.\n\n  Kid agrees.  Ike puts the hat on and starts to cross the street.\n  An OLD WOMAN walks by and hits him with a newspaper.  Ike is\n  stunned.\n\n  EXT. MAGGIE'S HOUSE - DUSK\n\n  Maggie pulls into the driveway in her truck.  She's in a fine\n  mood as she walks right in the house.\n\n  INT. MAGGIE'S HOUSE - DUSK\n\n  Bob, Walter, and Maggie's GRANDMOTHER JULIA sit in the living\n  room.  Grandma is sewing one of Maggie's wedding veils.  Walter\n  drinks wine, Ike wears a hat.\n\n          WALTER\n    You know, when I only see one dog, I\n    know I've had too much to drink.\n\n  Te family dog, Skipper, sits near a ceramic dog table.  Maggie\n  smiles as she walks in the front door and puts down her tool box\n  and bag.\n\n          MAGGIE\n    You'll never guess who came crawling\n    into town with his tail between his\n    legs.\n\n          IKE (o.s.)\n    Who?\n\n  Maggie enters the parlor to see Ike smiling evilly from his seat\n  on the couch.\n\n          IKE (cont'd)\n      (innocently)\n    Hello, Maggie.  I just came by to\n    apologize to your family.\n      (looks to Walter)\n    When I'm wrong, I'm wrong.  I pushed a\n    story.  I made a mistake.\n\n          WALTER\n    In other words -- he's only human.  An\n    he brought us a bottle of wine.\n\n  Raises the bottle to Maggie.\n\n          IKE\n    They made me put my hat back on.\n\n          WALTER\n    Oh, yeah.  Scared the hell out of\n    Skipper.\n\n          MAGGIE\n    You've got to be kidding me.\n\n  Maggie stares at them both.\n\n          BOB\n      (enjoying the moment)\n    No, no, you should have seen Skipper.\n      (then, imitates\n       growling)\n    It wasn't that funny.\n\n  Maggie gives him a look that says, \"You are not absolved.\"  She\n  smiles stiffly, looking back at Ike.  She then sits on the arm\n  of Bob's chair and puts her arm on his shoulder.\n\n          MAGGIE\n    So, the forces of good and evil have\n    already met.\n\n  Maggie takes the wine bottle from the table next to Walter.  She\n  snaps a look to Bob, who follows her.\n\n          BOB\n    I'll help you take into the kitchen.\n\n          GRANDMA JULIA\n    Check on the crabs, Bob.\n\n  We overhear them murmuring in annoyed tones about the wedding\n  plans as they exit... Walter puts down his drink.\n\n          IKE\n    Gee, I hope they don't have a fight out\n    there.  You don't think they'll call it\n    off...?\n\n          WALTER\n    Well, wedding cake freezes.  This we\n    know.\n\n          IKE\n    You know, your daughter seems...\n\n  Ike notices that he's been sewn to the veil.\n\n          GRANDMA JULIA\n    Sorry.\n\n          IKE\n    That's okay, Grandma.\n\n  Grandma cuts the thread and separates the veil from Ike's sleeve.\n\n          IKE (cont'd)\n      (continuing his thought)\n    ... Like such a lovely girl.\n\n  Walter points to a portrait painting on the wall.\n\n          WALTER\n    Like her mother.\n\n          IKE\n      (seeing the portrait)\n    Ah, beautiful.\n      (gets up to admire\n       the portrait)\n    I just can't see her leaving multiple\n    grooms in the dust like that.\n\n          GRANDMA JULIA\n    Oh, yes, you can.  She's has 'em all on\n    tape.\n\n          IKE\n    She has a tape?\n\n          WALTER\n      (good-natured)\n    Yeah.  Lee at the hotel videos wedding.\n    I mean Maggie didn't know she was going\n    to make the hundred-yard dash.\n\n  Walter gestures to a pile of video cassettes on the bookcase.\n  Ike checks on the tapes.\n\n          IKE\n    Dad's fishing trip, Grandma's knee\n    operation, Grandma's birthday...\n\n          WALTER\n    Gotta tell you this about my daughter.\n    My daughter makes real good time, even\n    in a long dress and heels.  Maggie may\n    not be Hale's longest running joke, but\n    she certainly is the fastest.\n\n  Walter cracks up.\n\n          GRANDMA JULIA\n      (sarcastically)\n    Ha ha.\n\n  CLOSE ON:  A tape.  It reads: \"Maggie I, II, III.\"  Ike's\n  interest is more than piqued.  Ike picks it up.  They get up and\n  go to the dining room.\n\n              DISSOLVE TO:\n\n  INT. DINNING ROOM/MAGGIE'S HOUSE - NIGHT\n\n  The family dog, Skipper, steals food from the table.  Walter\n  scolds him.  Walter whacks his crab with his hammer and Ike\n  copies him.\n\n          WALTER (cont'd)\n    Emma and I were only blessed with one\n    child, not for lacking of trying.\n\n          MAGGIE\n    This is good, Dad, don't leave anything\n    out.\n\n  Ike's hammer flies out of his hand.  He goes to pick it up.\n\n          WALTER\n    So I've come to see it as a bonus,\n    really, that we've been able to plan,\n    and pay for, so many weddings.\n\n          MAGGIE\n    Not this one.  This one's on me.\n\n  Walter reacts.\n\n          IKE\n    That's fair.\n\n          MAGGIE\n    Despite what you think, I don't do it\n    on purpose.  And I have no intention of\n    doing it again.\n\n          BOB\n    That's right, Maggie.  Just keep your\n    eye on the ball.\n\n  Ike raises his eyebrows in question.  Bob explains.\n\n          BOB (cont'd)\n    Sports psychology.  It was my major in\n    college.\n\n          IKE\n    Ahh.\n\n          BOB\n      (false modesty)\n    I'm the town's unofficial fitness\n    trainer.  Big advocate of the mind and\n    body combining for success.  You could\n    say or you can quote me, I'm a glass\n    half full king of guy.\n\n          MAGGIE\n      (boasting)\n    Bob's the head of the P.E. department\n    at the high school.  And he coaches the\n    football team.  And he's climbed\n    Everest.\n\n  To Maggie's satisfaction, Ike shoots Bob a look of begrudging\n  respect.  Nobody who's been up Everest is a total clown.\n\n          IKE\n      (impressed)\n    Everest.  Is that right?\n\n          MAGGIE\n    Twice...\n\n          IKE\n    Really?\n\n          MAGGIE\n      (sticking it to Ike)\n    Without oxygen...\n\n          BOB\n    My girl likes to brag about me.\n\n  Bob and Maggie kiss Ike two little love-birds.\n\n          BOB (cont'd)\n    I'm taking her trekking on Annapurna on\n    our honeymoon.\n\n  Ike is highly amused.\n\n          IKE\n    How romantic.\n\n          MAGGIE\n      (sharply)\n    We think so.\n\n          IKE\n    Nothing like sharing your nuptial bed\n    with two Sherpas and a yak.\n\n  Walter cracks up, Maggie shoots Ike a look.  He smiles back.\n\n              CUT TO:\n\n  INT. IKE'S HOTEL ROOM/INT. FISHER AND ELLIE'S BEDROOM (NYC)\n\n  INTERCUT TELEPHONE CONVERSATION\n\n  Fisher and Ellie are exercising.  Fisher is on a cycle machine.\n  Ellie does yoga stretches.  Ike sits back on the couch, puts on\n  his glasses and watches a video taped wedding playing on the TV\n  screen.  Superimposed titles read \"Brian Norris wedding.\"\n\n          IKE\n      (to Fisher; into phone)\n    You won't believe what I'm looking at,\n    Fisher.  A videotape of all three train\n    wrecks.\n\n  THE TV - CLOSE\n\n  Two flower girls and Peggy enter a crowded church where the\n  groom, Brian, and his best man wait at the altar.\n\n  Now we see Maggie come down the aisle, then walk past the altar.\n  We see Maggie move away another aisle and out of the church.\n  SHOCKED WEDDING GUESTS rise in horror, as she runs from this\n  first wedding.  She drags the train boy up the second aisle as\n  she leaves.  Ike hangs up.  He gets up to pick up the remote and\n  then sits back down to watch.\n\n  The tape fast-forwards to the next wedding.  Now Ike is looking\n  at a much more relaxed, hipper, backyard wedding.  It says,\n  \"Gill Chavez Wedding\".  He hits the fast-forward button\n  (sometimes slowing down).\n\n  ON TV:\n\n  We see the Carpenter's backyard.  It is Gill and Maggie's\n  wedding day.  The yard is crowded with a MIXTURE of Hells\n  Angels-types, Deadheads and townspeople.  The \"altar\" is a band\n  platform against the back fence.\n\n  Gill is waiting on the platform with a rock combo playing\n  Grateful Dead-type music.  He makes an introductory speech.\n\n  Maggie steps out onto the back porch.  She's beautiful in a\n  hippie-type wedding ensemble.  She walks with her father to a\n  trampoline.  We can see her tattoo.  She jumps on the trampoline,\n  then dives into the crowd.  They watch her and body surf her\n  over their heads to the back fence.\n\n  As she hits the stage, she looks at Peggy and Gill, then decides\n  to go.  She jumps off the stage and runs up to a passing GUY on\n  a dirt bike.  She jumps on and turns and waves as she rides\n  away.  During the video, Ike scribbles: \"Gill Chavez\".  Maggie\n  goes off on dirt bike.  The tape fast-forwards to the last of\n  Maggie's fiascoes.\n\n  ON IKE'STV\n\n  He now sees the third wedding.  It's outdoors, in a tree lined\n  area, MUSICIANS plays.  Ike laughs as he discovers that Maggie\n  approaches the altar on horseback, in a simple white dress,\n  wearing a crown of flowers.  The Maid Marian look.  Ike slows the\n  tape.\n\n  ON TV:  IT SAYS, \"GEORGE SWILLING WEDDING\".\n\n  As Maggie rides down the aisle, suddenly the horse whinnies!\n\n  Maggie has kicked it in the shins.  It rears and bolts,\n  galloping off with the bride.  Ike FREEZE FRAMES the tape on an\n  image of Maggie, hair blowing.  Although she is panic-stricken,\n  her soul seems to shine through in tat single frame.  As Ike\n  stares at her, the smirk fades from his face.  He just looks at\n  her, allowing himself to see her expression, her eyes.  He can't\n  help it.\n\n  She gets to him.  Ike gets a restless look on his face.  He\n  stares closely.  The groom is George from the bar.\n\n          IKE\n    Kamikaze!\n\n              CUT TO:\n\n  EXT. TE TROUT BAKERY - THE NEXT DAY\n\n  Establishing.  High angle wide shot of a bakery in Hale.  Ike\n  exits a neighboring shop and walks down the block.  He pauses in\n  front of the bakery to take a look at Maggie's truck.  As he\n  does, a middle-aged Black WOMAN walks by and whacks him with a\n  newspaper.  Ike is stunned as she walks off.  He turns to a MAN\n  sitting on a bench.\n\n          IKE\n    Did you see that?\n\n              CUT TO:\n\n  INT. THE TROUT BAKERY - CONTINUOUS\n\n  CLOSE ON a group of plastic grooms and brides on a counter top.\n\n  MRS. TROUT is behind the counter helping Maggie with a selection\n  of grooms for her wedding cake.  The groom figures are spread out\n  on the counter.  All sizes and colors, some attached to brides,\n  some solo, some tuxes, some in dinner jackets.\n\n          MRS. TROUT\n    This one's very popular, but oh, you've\n    used this one before... Brian.  But I\n    like the white dinner jacket.\n\n          MAGGIE\n    No, he's no good.  Too blond.\n\n          MRS. TROUT\n      (picks up another)\n    We'll go with total traditional.\n\n          MAGGIE\n    Too dark.\n\n  Then, Ike comes up behind her as she discards another groom.\n\n          IKE\n    But he's got the Bobster's eyes.\n\n  Maggie cringes at the sound of Ike's voice.\n\n          IKE (cont'd)\n    No -- the Bobster's eyes are closer set.\n\n  She ignores him and continues her search.\n\n          IKE (cont'd)\n      (to Mrs. Trout)\n    Could I have two coffees, please?  And\n    what is that wonderful smell?\n      (seeing the\n       cinnamon rolls)\n    I'll have two of those delicious\n    looking cinnamon rolls.\n\n          MRS. TROUT\n    Sure.\n      (picking up a\n       miniature bride)\n    Here, Maggie.  I think this makes the\n    best you.\n\n  Mrs. Trout steps away to get his order.  Ike moves to the other\n  side of Maggie and picks up the bride and groom figure.\n\n          IKE\n    Let's see... Excuse me, isn't that cute?\n    Ahh...\n\n  He makes the bride figure repeatedly knock the groom figure in\n  the head and run away screaming.\n\n          IKE (cont'd)\n    Bam, bam, bam, bam, bam!  Oh, help me!\n    Help me!  Yup!  That's her all right.\n\n  Mrs. Trout just about bursts a gut laughing.  Maggie takes the\n  bride from Ike coldly.\n\n          MRS. TROUT\n    You must be that Mr. Graham fellow.\n\n  Ike turns and goes to her.\n\n          IKE\n    Yes, I am.  And who are you?\n\n          MRS. TROUT\n    Betty Trout.  Five dollars.\n\n          IKE\n      (as he pays)\n    Oh, Betty.  I take it you're going to\n    be making the wedding cake and they say\n    you're throwing --\n\n          MRS. TROUT\n      (interrupting)\n    -- The luau for Maggie.\n\n  She starts picking lint off his sleeve and buttons his cuff.\n\n          MAGGIE\n      (all smiles for\n       Mrs. Trout)\n    Grandma made me the cutest outfit.  I\n    can't wait to show it to you.\n\n          IKE\n      (cynical delight)\n    A pre-wedding luau?\n\n          MRS. TROUT\n    Yes.  My husband and I love luaus.\n    It'll be fun.\n\n  Mrs. Trout turns and grabs Ike's bag containing two coffees.\n\n          IKE\n    Fun?  Fun isn't the word.\n\n  Mrs. Trout beams.  Maggie understands his answer a little better.\n  Mrs. Trout hands Ike his items and he pays.\n\n          MRS. TROUT\n    If you're still in town, you should\n    stop by.\n\n          MAGGIE\n    No, I'm sure he doesn't.\n\n          IKE\n      (to Mrs. Trout)\n    Actually, I would love to come.\n      (taps her service bell)\n    Thank you.  Thank you so much.\n\n  Maggie steps over, carrying her bride and groom figure choices.\n\n          MAGGIE\n      (exasperated)\n    Is that what you're going to do now?\n    Follow me around everywhere I go?\n\n  Ike smiles at Maggie enigmatically as he picks up his order and\n  heads for the door.\n\n          IKE\n    No.\n\n  He starts to leave with his bag.  Mrs. Trout stops him.\n\n          MRS. TROUT\n      (handing him the\n       other bag)\n    Your two cinnamon rolls.\n\n          IKE\n    Bye, Betty.  Thanks.\n\n  He leaves.\n\n          MAGGIE\n    He's not a nice person.\n\n  Maggie hands Mrs. Trout her bride and broom figures.  Maggie\n  looks at Mrs. Trout, suddenly nervous.  She dashes out.  Mrs.\n  Trout imitates Ike bamming the bride and groom, laughing.\n\n              CUT TO:\n\n  EXT. HIGH SCHOOL FOOTBALL FIELD - DAY\n\n  Various High School SPORTS TEAMS practice.  Maggie strides across\n  the football field, a scowl on her face.  A few HIGH SCHOOL\n  FOOTBALL PLAYERS job past Maggie, doing laps.  A boy, KENDALL,\n  calls out to her affectionately as she passes.  One of them,\n  DENNIS, slows his pace to run alongside Maggie.\n\n          DENNIS\n      (playful)\n    Maggie, don't marry Coach!  Marry me.\n    I love you.\n\n          MAGGIE\n    You're jail bait, Dennis.  Go away.\n    Run your laps.  Go. Go.\n\n  Dennis runs on as Maggie continues toward her goal: Bob and Ike,\n  standing together on the other side of the field.\n\n  ANGLE ON BOB AND IKE\n\n  They're both standing on the blocking sled.  Wave after wave of\n  VARSITY FOOTBALL PLAYERS ram into the sled and drive it across\n  the field with both Ike and Bob on top of it.  Ike is munching on\n  one of the cinnamon rolls as Bob pushes the KIDS.\n\n          BOB\n    Drive!  Drive!  From your hips, get low,\n    get low, get low.  Next!\n\n  Ike smiles broadly atop of the sled as he sees Maggie\n  approaching, looking mighty peeved.  He nudges Bob and points to\n  Maggie.  Bob lights up at the sight of her.\n\n          BOB (cont'd)\n    Good job, gentlemen... Special teams.\n\n  The football players move away from the sled.  Bob moves to\n  Maggie, leaves Ike alone.\n\n          BOB (cont'd)\n      (to Maggie)\n    Hey, honey!\n\n  Bob kisses and embraces Maggie.  She doesn't see Ike immediately,\n  then:\n\n          MAGGIE\n      (indicating Ike)\n    What is he up to now?\n\n          BOB\n    Ike just came by to check out the team.\n\n          IKE\n    And talk about you.\n\n  Ike grins and shows Maggie the notes in his pocket.\n\n          MAGGIE\n    Bob -- are you making friends with this\n    man?\n\n          BOB\n    I'm just bragging about how great you\n    are.  I'm the luckiest man alive.\n\n  Bob grabs Maggie around the waist and smooches her adoringly.\n  Maggie scowls at Ike.  He nods, all charm.\n\n          IKE\n    Well -- I've got to get moving -- lot\n    of work to do today!  I'll see you two\n    love-birds later.\n\n  Ike leaves.  Bob calls after him.\n\n          BOB\n    See you at the wedding.\n\n          IKE\n    You bet ya, Coach.\n\n  Maggie is aghast.  She stares at Bob.  Ike joins in behind a line\n  of peppy cheerleaders.\n\n          MAGGIE\n    At the wedding?  You invite him?  Bob,\n    don't you realize he's writing another\n    article about me?\n\n          BOB\n    Sure I do.  But the bet defense is a\n    good offense, right?  You're not going\n    to let your opponent throw you off\n    your game.\n\n          MAGGIE\n    You don't understand this guy.\n\n          BOB\n    Let him come to the wedding.  You're\n    not running, right?  Say it. \"I'm\n    not...\"\n\n          MAGGIE\n      (irritably)\n    I'm not running.\n\n          BOB\n    So if you're not running and Ike Graham\n    is there to see it, then any article he\n    writes has got to have a happy ending,\n    right?  All we're doing is turning\n    lemon into lemonade.\n\n          MAGGIE\n    I've got news for you.  No amount of\n    sugar and water is going to turn like\n    Graham into something you want to take\n    on a picnic.\n\n  Bob gives Maggie a big hug.\n\n          BOB\n    Where's that homemade sunshine?\n\n  Bob blows his whistle, then puts Maggie on the football sled.\n\n          BOB (cont'd)\n    I want you boys to take my princess on\n    the ride of her life... Honey, tell 'em\n    where you parked your car.\n\n  Maggie screams as the boys push her down the football field.\n\n  INT. CONFESSIONAL BOOTH/CHURCH - DAY\n\n  Maggie kneels, hands folded reverently.  The booth's grate opens\n  before her.\n\n          MAGGIE\n    Bless me, Father, for I have sinned.\n    My last confession was... ahh...\n\n  She tries to recall.\n\n          MAGGIE (cont'd)\n    ... Anyway, I have sort of a technical\n    question here.  I've been having -- bad\n    thoughts.  I mean, really bad thoughts\n    ...\n\n          PRIEST\n    Of an impure nature?\n\n          MAGGIE\n    No -- like -- I'm having a problem with\n    that whole turn-the-other-cheek concept.\n    I want revenge.  I want to destroy this\n    guy's life, career, everything. On the\n    sin scale, how big is that?  I mean,\n    can I \"Hail Mary\" my way out of it?\n\n          PRIEST\n    Child, any sin in one's heart is...\n\n          MAGGIE\n      (impatient)\n    The name's Maggie.  It wasn't this side\n    of ten years ago that you had your\n    tongue down my throat.  So don't call\n    me \"child\", Brian.  It annoys me.\n\n          PRIEST/    BRIAN\n    Now don't get upset.\n\n  Brian closes the confessional window and exits\n\n          MAGGIE\n      (still inside\n       the booth)\n    Brian, open up.  Don't ignore me.\n\n  Brian leans into her confessional.  She steps out to join him.\n\n          BRIAN\n    You're not even Catholic, Maggie -- you\n    really shouldn't come to confession.\n\n  He's a nice looking and gentle man.  They regard each other for a\n  beat.\n\n          MAGGIE\n    I'm sorry.  I'm just so stressed out\n    about that slime-ball reporter being in\n    town.  I jus had to come warn you he\n    might show up here and start asking you\n    all kinds of ridiculous questions.\n\n  Brian moves away.  Maggie follows and sits in a nearby pew.\n\n          BRIAN\n    Actually, he only asked me one\n    ridiculous question.  The rest weren't\n    so bad.\n\n          MAGGIE\n      (sliding along\n       the pew)\n    What?  You talked to him!  Did you tell\n    him we dated before you were a priest?\n\n          BRIAN\n    Yes, yes, I'm sure I only did you good,\n    Maggie.\n\n          MAGGIE\n    What did he ask?\n\n  A woman, MRS. MURPHY, rushes in.\n\n          MRS. MURPHY\n    Father, am I too late?\n\n          BRIAN\n    No, no.\n\n          MRS. MURPHY\n    It won't take long.  Jus two venials.\n\n  The woman goes into the confessional booth to wait.\n\n          BRIAN\n    Only respectful things.  What did we\n    have in common back then... What kind\n    of music did you like... Did you ruin\n    my life when you left me standing at\n    the altar...\n\n          MAGGIE\n    And what did you say?\n\n          BRIAN\n    How could I be angry at you when\n    clearly what has happened to me is as\n    God intended?\n\n          MAGGIE\n      (relieved)\n    Good one!  Thanks.\n\n          BRIAN\n    It happens to be how I feel.\n\n  Brian sits next to Maggie.\n\n          MAGGIE\n    God... Of course.  I'm sorry -- I mean,\n    I'm...\n      (sighs)\n    Brian -- I've got to go.  The man's a\n    lunatic, but I know exactly where he's\n    going next.\n\n          BRIAN\n    God bless you, Maggie.\n\n  She turns to rush out, then stops herself.\n\n          MAGGIE\n    Oh, wait, my purse.\n\n  She moves to the confessional, knocks, then speaks to Mrs. Murphy.\n\n          MAGGIE (cont'd)\n    Excuse me, sorry, forgot my purse.\n    Good luck.\n\n  Maggie closes the booth curtain and turns to Brian.\n\n          MAGGIE (cont'd)\n    Wait -- what was the ridiculous\n    question he asked?\n\n  Brian smiles mischievously.\n\n          BRIAN\n    He wanted to know how you used to like\n    your eggs.\n\n          MAGGIE\n    Weird.  Like after all those years you\n    would remem--\n\n  She starts to go, then stops in her tracks as she hears:\n\n          BRIAN\n      (interrupting)\n    -- Scrambled, with salt, pepper and\n    dill.  Same as me.\n\n  Maggie  looks at Brian.  Suddenly, she remembers too.\n\n          MAGGIE\n      (tenderly)\n    I'm really sorry that I hurt you, Brian.\n\n          BRIAN\n    I'm happy here, where I'm supposed to\n    be.  But if you ever become a Catholic,\n    may I ask you a favor, Maggie?\n\n          MAGGIE\n    Of course.\n\n          BRIAN\n    Could your confess to Father Patrick\n    from now on?\n\n          MAGGIE\n    Of course.\n\n  And she scampers out.  Brian goes back into the confessional.\n\n  EXT. GILL'S GARAGE - DAY\n\n  Maggie drives up to an old brick firehouse that is now an auto\n  garage.  The faded sign reads: \"Gill's Garage\".\n\n  INT. GILL'S GARAGE - DAY\n\n  Maggie rushes inside and looks around.  No one is in sight.\n  Several cars, including a yellow jeep-like car up on a hydraulic\n  lift, are in the funky garage.\n\n          MAGGIE\n    Gill?  Lydia?  Gill?\n\n  A CRASH, coming from the nearby back room, we hear loud muttering\n  in Spanish, then out stumbles GILL CHAVEZ, 34, wearing a grease-\n  stained Grateful Dead tie-dyed T-shirt.  He grins triumphantly,\n  worshipfully cradling a CASSETTE TAPE in his hands.\n\n          GILL\n    Hey -- I found it!\n\n  Maggie regards her former fiance with patient warmth.\n\n          MAGGIE\n    Found what?\n\n  Gill looks up and gives Maggie a fond, hazy smile.\n\n          GILL\n    Mags!  Hey, look -- The tape from the\n    Radio City Music Hall concert --\n    Remember that night I as trying to get\n    Jerry to let me sit in on \"Ripple\"?\n\n  He pulls out the cassette from its case.  It's broken.  The tape\n  is dangling from the cassette.\n\n          GILL (cont'd)\n      (disappointed)\n    Oh, I'll play it for you.\n\n  Gill picks up an electric GUITAR and starts to play.\n\n          MAGGIE\n      (shouts over the music)\n    Listen, Gill -- There's this reporter\n    who's ben making my life a living hell\n    ... If he comes by here, don't talk to\n    him.  And whatever yo do....\n      (crosses to Gill)\n    ... Don't show him that picture of me\n    at the concert in San Francisco --\n\n  Suddenly, a loud CHUCKLING emanates from the car overhead.\n\n          MAGGIE (cont'd)\n    What was that?\n\n  Maggie stops Gill from playing.  She shoots her ex an angry glare\n  and moves a lever on the shop wall.  With a HUM, the car descends.\n\n          GILL\n    We went to San Francisco twice.\n    Remember one time we had a flat tire...\n    Which picture?\n\n  As the hydraulic lift slows, the car is lowered, revealing Ike\n  sitting in the driver's seat.  He has been enjoying the\n  photograph he's holding.\n\n          IKE\n      (feigning shock)\n    Imagine!  Maggie Carpenter topless in a\n    public arena.\n      (checks photo again)\n    And I see there was a chill in the air.\n\n  Maggie swipes for the photo, but Ike is faster at pulling it away.\n\n          MAGGIE\n    Give me that!\n\n          IKE\n    But the most interesting thing here is\n    that I don't see the rose tattoo that\n    I've heard about on your back.\n\n  Gill takes off his guitar and sets it down.\n\n          GILL\n    Ike bet me fifty bucks you don't still\n    have it, Mags.  I said \"You're on, man!\n    Maggie loved that thing!\"  And I could\n    really use fifty bucks.\n\n  Maggie is conspicuously silent.\n\n          GILL (cont'd)\n      (looking worried)\n    Mags?\n\n          MAGGIE\n    I'm not gonna show you guys anything.\n    I am a soon-to-be-married woman.  Now\n    give me that photograph.\n\n  Maggie seethes.\n\n          IKE\n    Sure, I would love to give this to you.\n    Just give us one quick gander at that\n    rose, and, I'll gladly hand it over.\n\n  She tries to grab the photo again.  Ike pulls it away.\n\n          MAGGIE\n    Fine.  Here.\n\n  Maggie quickly turns around and pulls down the back of her shirt,\n  revealing the top of her back and a pristine expanse of skin.  No\n  tattoo.\n\n          MAGGIE (cont'd)\n      (turning back around)\n    Satisfied?\n\n          IKE\n    Completely.\n\n  Gill is still trying to grasp the meaning of this.\n\n          GILL\n    Maggie?  You got it removed?\n\n          IKE\n    Gill, I'll go ya double or nothing if\n    was a stick-on.\n\n          GILL\n      (dismayed)\n    Maggie?\n\n          MAGGIE\n      (admitting)\n    I'm really, really afraid of needles...\n    It doesn't make me a bad person.\n\n  Ike laughs.  Maggie looks at him with rage.  Gill dramatically\n  pulls down the front of his t-shirt.\n\n          GILL\n    Look.\n\n  There it is on Gill's chest: the rose tattoo.  Maggie sighs,\n  pained.  Gill shows it to Ike.  Ike looks at the tattoo.  He\n  shakes his head at Maggie.\n\n          IKE\n      (sincerely)\n    Look, look, man.  I think the man is\n    heartbroken.\n\n          MAGGIE\n    He is not!\n\n  Maggie moves the lever on the wall again, sending Ike back up to\n  the ceiling in the car.  She grabs the photo from Ike and exits.\n\n          GILL\n    I think I am.\n\n  Gill grabs his guitar and sits.\n\n          GILL (cont'd)\n    Hey, Ike, what would Jerry do?\n\n  The hydraulic lift stops moving.  Ike leans out.\n\n          IKE\n    Jerry.  He'd play.  He'd play... Jerry\n    would play his heart out.\n\n  Ike sings and taps along in tempo on the side of the car as Gill\n  sings and plays \"Ripple\".\n\n              CUT TO:\n\n  EXT. HOTEL PORCH - NEXT DAY, SATURDAY MORNING\n\n  As Maggie drives into town with Peggy, they see Ike on porch with\n  SHERIFF, POLICE CHIEF and MAIL    MAN, all playing instruments as\n  a blues band.  Ike is not bad on slide guitar.  They all like\n  Ike.\n\n  Maggie \"CHUFFAS\" with Peggy and moves on.\n\n  EXT. SOFTBALL FIELD - LATER THAT DAY\n\n  CLOSE ON:\n\n  The slow, loopy pitch of a softball.  A bat connects.\n\n  NEW ANGLE:\n\n  A big wholesome man, CORY, runs for first base.  He just beats\n  out the throw.  Bob, acting as umpire, yells, \"Safe!\"  Happy,\n  Cory turns to the stands and waves.\n\n  ANGLE ON:\n\n  Maggie and Peggy, cheering loudly.  Peggy tries to whoop harder\n  than Maggie, but that would be tough.  From firs base, Cory waves\n  back to them.  The two women sit back down and Maggie takes back\n  up with their conversation.  Maggie is still al steamed up.\n\n          MAGGIE\n    Okay, he's on base.  Can we talk about\n    my life now?  -- Ike's going to turn\n    that tattoo stuff into a big deal --\n    that I was never serious about Gill,\n    blah blah.  He's totally out to get me.\n\n          PEGGY\n    For what reason?  Some personal\n    satisfaction?\n\n          MAGGIE\n    That's what he says, but if he thinks\n    that I don't realize he's writing\n    another article, then he's an idiot.\n\n          PEGGY\n    It's probably because you got him fired.\n\n          MAGGIE\n      (sarcastic)\n    Ya think?\n\n          PEGGY\n    Not that he doesn't deserve to get\n    fired... Look!  Cory's going for\n    second!... Sneaky!\n\n  ANGLE ON:\n\n  Cory as he runs for second base and with a slide beats the throw\n  for the force out.  The women jump and cheer -- Maggie, again,\n  the most boisterous.\n\n  ANGLE ON:\n\n  Dennis recognizes Ike as he walks up.  Dennis tells Ike that he\n  is going to marry Maggie some day and shows Ike where Maggie is\n  sitting.\n\n  ANGLE ON:\n\n  Maggie spots Ike as they sit back down.  She groans.\n\n          MAGGIE\n    There he is.  Snoop Doggy-Dogg.\n\n          PEGGY\n    Where?\n\n          MAGGIE\n    Over there.  Ten o'clock.  He's talking\n    to our little Dennis.  Dennis will turn\n    into one of those \"sources say\" things.\n\n          PEGGY\n    He looks better with that stuff out of\n    his hair.  He's an attractive man.\n\n  Ike finds Maggie in the crowd and leaves Dennis.\n\n          MAGGIE\n    I'd say you've been in the sun too long.\n    You handle him, okay?  I could use five\n    minutes off from that creep.\n\n  Before Peggy can protest, Maggie climbs down off the bleachers\n  and goes and stands near the dugout near the rest of Cory's team.\n\n          PEGGY\n    Okay, that's fine.  I can do that.\n\n  Ike comes up to Peggy.\n\n          IKE\n    Hello, Peggy Phleming, \"not the ice-skater\".\n\n  Ike indicates the seat next to Peggy.\n\n          PEGGY\n      (protesting weakly)\n    That's Maggie's seat...\n\n  Ike sits down comfortably.\n\n          IKE\n    ... And this is Maggie's beer.\n\n  He starts drinking it.  ON THE FIELD, Cory is getting ready to\n  steal third.\n\n          IKE (cont'd)\n    That your  husband out there?  Cory\n    Phleming, a local radio announcer.\n\n          PEGGY\n    Have you listened to his morning show,\n    \"Wake up with ballplayer\"?\n\n          IKE\n    Not yet.  I had a phlemless morning.  I\n    hear he's a pretty good ballplayer.\n\n          PEGGY\n    This game is pretty important to him.\n    He made all-stars in high school, you\n    know.\n\n          IKE\n    That must have made you proud.\n\n  Peggy takes a small sip off her soda.\n\n          PEGGY\n    He was going with Maggie back then.\n      (quickly)\n    He was never one of her... I mean, they\n    were never going to get... They just\n    dated for a while.\n\n  Cory dives in for third and makes it.  The crowd goes wild.\n  Peggy yells and jumps in.\n\n          PEGGY (cont'd)\n    Good job, honey!\n\n  But Maggie's whoop sails out above it all.  Cory waves.  But not\n  at Peggy.  He directs his delight at Maggie, who jumps up and\n  down by the dugout.\n\n  Ike looks between Cory, Maggie and finally, Peggy.  Peggy jerks\n  her waving hand back down to her side and sits down.  Ike\n  pretends not to have noticed.  The two watch as Maggie and Cory\n  smile at each other.\n\n          IKE\n    It's nice that they're still friends.\n\n          PEGGY\n      (looking at Maggie\n       and Cory)\n    Oh, sure.  That was a long time ago.\n    See, she's not a man-hater at all.\n    She's very supportive of men...\n\n  Next BATTER hits one to deep left field and it lands in the grave\n  yard.  Cory scores, greeted by Maggie.  Ike and Peggy watch as\n  Cory and Maggie belly-bump and high-five each other in\n  celebration of Cory's play.  No looks at Peggy.  Ike keeps an\n  empathetic silence, seeing that Peggy is truly hurt.\n\n          PEGGY (cont'd)\n    I'll be back in a second.\n\n  Suddenly, Peggy stands, pushes past him and runs down the steps.\n  Maggie looks up just in time to catch Peggy's exit.  Ike pulls\n  his tape recorder out of his pocket and starts speaking into it.\n\n  Maggie shoots Ike an accusing look, walks up to him in the\n  bleachers and sits next to him.\n\n          MAGGIE\n    You've been here for three minutes.\n    What did you do to her?\n\n          IKE\n    You can turn that finger around.\n\n  Ike does an on-the-button imitation of Maggie jumping excitedly\n  at Cory.  Now Maggie sees what he's getting at.\n\n          MAGGIE\n      (defensive)\n    You misinterpret everything.  We've all\n    been friends our whole lives.  But\n    that's the types of relationship you\n    wouldn't understand.\n\n          IKE\n    Obviously, I'm not the only one who\n    doesn't understand it.  The USS Maggie\n    leaves quite a wake... Excuse me.\n\n  Ike walks away.  Alone, Maggie tries to seem enthused.\n\n          MAGGIE\n    See, I cheer good.  What is he, a cheer\n    critic?\n\n  EXT./INT. STREET/BAR - LATER - DUSK\n\n  Sitting in front of Inn Hale Bar, we see the BARTENDER\n  pantomiming holding the reins of a wildly galloping horse.  We've\n  seen something like this before.  Maggie's wild ride away from\n  her last wedding.  Ike laughs with Bartender just as Maggie\n  drives by the bar and sees this.\n\n          MAGGIE\n      (to herself)\n    This guy never stops.\n\n  INT. ATLANTIC HOTEL - NIGHT\n\n  Maggie walks up to the front desk of the hotel, where Lee is\n  sleeping with his feet up.  She knocks his feet off the counter.\n\n          MAGGIE\n    Lee, hey, wake up.  Give me the key to\n    the reporter's room.  I want to snoop\n    around.\n\n          LEE\n      (handing her the key)\n    Okay.  Second floor.\n\n          MAGGIE\n    Thanks.\n\n          LEE\n    Don't take anything big.\n\n  Maggie moves up the stairs towards Ike's room.\n\n  INT. ATLANTIC HOTEL - HALLWAY - MOMENTS LATER\n\n  Maggie walks towards Ike's room, checks that no one sees her and\n  enters.\n\n  INT. IKE'S HOTEL ROOM - CONTINUOUS\n\n  Maggie lets herself in the modest room and turns on the lights\n  on.  She spots on audio cassette on the desk near the door.  She\n  holds the cassette up to the light to read the hand-written\n  label.  It says \"Miles Davis\" on it.  She pockets the tape.  She\n  walks to the living room.\n\n  MAGGIE'S POV:\n\n  Ike has placed post-its on a framed picture, using the frame as a\n  bulletin board.  Post-it notes lay out the information he has\n  gathered under headings and subheadings.  Parents \"Mother\"\n  deceased, subheaded by \"Walter\" and there is one for \"Brian\",\n  \"Gill\", and \"Bob\".  Maggie smiles and shakes her head.  She rips\n  one post-it down and reads it to herself.\n\n          MAGGIE\n      (reads)\n    \"How does she get all these guys to\n    propose?  She's not that beautiful.\"\n      (snorts)\n    Bite me, paper boy.\n\n  She begins ripping many of other post-it off the picture frame.\n\n          MAGGIE (cont'd)\n      (as she takes post-its)\n    Rude...\n\n  She's ripping them down, fast and furious, then shoves them in\n  her shoulder bag.\n\n  INT. ATLANTIC HOTEL HALLWAY - CONTINUING\n\n  Ike comes down hallway as Harvey puts his shoes out to be shined.\n\n  BACK INSIDE THE ROOM\n\n  Maggie, looking around, discovers the wedding video on the\n  coffee table and grabs that, too.\n\n          MAGGIE (cont'd)\n    Thief!\n\n  THE SOUND OF A KEY IN THE DOOR makes Maggie jump.  She flees to\n  the bathroom, and shuts and locks the door.  Just as Ike enters,\n  he sniffs and looks around the room, instantly knowing something\n  is up.  He sees all his notes gone and a glimpse of Maggie as she\n  closes the bathroom door.  Ike is steaming.  A BUMP sounds from\n  the bathroom.  He goes over to the door and tries the handle.\n  It's locked.  He starts to pound on the door.\n\n          IKE\n    All right, I know you're in there...\n    You steal my research... You're messing\n    with the first amendment now.  Open up.\n    Open up.  You got no place to go.\n\n  INT. IKE'S HOTEL BATHROOM - CONTINUING\n\n  Ike's wrong.  Maggie is already trying to open the first\n  bathroom window.  It's stuck.  She climbs over the bathtub,\n  opens that window and starts to climb out.\n\n          IKE\n    I want to have a very serious discussion\n    with you as to why you're such a pain in\n    the ass.\n\n  We HEAR Ike slamming his body against the bathroom door.\n\n  As Ike breaks in, he runs to the window and yells after her.\n\n  EXT. IKE'S HOTEL WINDOW - CONTINUOUS\n\n          IKE (cont'd)\n    That's breaking and entering.  I'll call\n    the sheriff.\n\n          MAGGIE\n    You do that.  And remind him he's\n    bringing the wine to the luau.  Thanks.\n\n  She disappears around the ledge of the building and runs off.\n  Ike's neighbor, Harvey, sits reading near his window.\n\n              CUT TO:\n\n  EXT. MAGGIE'S HOUSE - NIGHT\n\n  Establishing.\n\n  INT. MAGGIE'S HOUSE - NIGHT\n\n  CLOSE ON:  A CASSETTE PLAYER.  We see the familiar handwritten\n  label: \"Miles Davis.\"  \"Kind of Blue\" plays as Maggie listens in\n  a chair, looking shell-shocked, surrounded by the post-its she\n  stole from Ike's room.  We see as she reads them: \"Father, two-\n  fisted drinker,\" \"Peggy, best friend, but Peggy doesn't totally\n  trust Maggie,\" \"Bob\" -- doesn't love him.  Overwhelmed, she\n  finishes reading the last note, leans back, puts her feet up on\n  the table, deep in the mood of the melancholy music.\n\n  The CAMERA MOVES on the last note on the floor next to her chair.\n  It reads: \"SHOWS NO REMORSE\".\n\n  FADE TO BLACK.\n\n  FADE IN:\n\n  EXT. MAIN STREET/BEAUTY PARLOR - NEXT DAY\n\n  It's early morning.  Mrs. Pressman hands Peggy a cup of coffee\n  to go.  Peggy walks to the beauty parlor, unlocks the front door\n  and goes in.\n\n  INT. BEAUTY PARLOR - DAY\n\n  Peggy enters and starts about her opening duties.  She turns on\n  the lights and turns and sees her friend, Maggie.\n\n          MAGGIE\n    Do you think I flirt with Cory?\n\n  Peggy stops in her track.  Maggie is sitting curled up in a salon\n  chair.  She looks like she hasn't slept.\n\n          PEGGY\n    Good morning to you, too.  You look good.\n\n          MAGGIE\n    Thank you.  Do you think I flirt with\n    Cory?\n\n          PEGGY\n    Yes.\n\n  Maggie looks miserable.\n\n          MAGGIE\n    I don't mean it.\n\n  Peggy moves to the salon mirror near Maggie with her cup of\n  coffee.\n\n          PEGGY\n    I know.  I think sometimes you just\n    sort of spaz-out with random excess\n    flirtation energy and it just lands on\n    anything male that moves.\n\n          MAGGIE\n    On anything male that moves?  As\n    opposed to anything male that doesn't\n    move?\n\n  Peggy pours her coffee out of its Styrofoam cup into a ceramic mug.\n\n          PEGGY\n    Like certain kinds of coral.\n\n  Peggy sits in the salon chair next to Maggie.\n\n          MAGGIE\n    I'm going to kill myself.\n\n          PEGGY\n    Why?\n\n          MAGGIE\n    Because you think I'm all like... \"Hey\n    man, check me out\".\n\n          PEGGY\n      (friendly)\n    No, I don't think you're like, \"I'm\n    charming and mysterious in a way that\n    even I don't understand and something\n    about me is crying out for protection\n    from a big man like you\".  Very hard\n    to compete with.  Especially to us\n    married women who have lost our mystery.\n\n          MAGGIE\n    But you haven't lost your mystery!\n    You're very mysterious!\n\n          PEGGY\n    No.  I'm weird.  Weird and mysterious\n    are two different things.\n\n          MAGGIE\n    But I'm weird.\n\n          PEGGY\n    No.  You're quirky.  Quirky and weird\n    are two different things.\n\n          MAGGIE\n    Peggy, there's distinct possibility\n    that I might be profoundly and\n    irreversibly screwed up.  Despite that,\n    I love you and I can promise that I\n    will no longer flirt with Cory, and I\n    beg your forgiveness.\n\n  Maggie looks ready to cry.\n\n          PEGGY\n    I'm not worried about you and Cory or\n    Cory and me or even that you're\n    irreversibly screwed up.  But, Maggie,\n    you've been like this since we were\n    kids.  And I think now that you are\n    aware of it and that it hurts people's\n    feelings, maybe it's time to move on\n    with your life and commit to someone of\n    your own, like Bob, if he's the one.\n\n          MAGGIE\n    I think you're right.\n      (then)\n    Is there anything I can do to make it\n    up to you?\n\n          PEGGY\n    Something that brings warmth to my heart.\n      (pause)\n    Duckbill platypus.\n\n          MAGGIE\n    It's only funny at Camp Birchwood at\n    three in the morning at a tick hunt.\n    It's not anymore.\n\n  Maggie makes her funny face.  Peggy doesn't laugh.\n\n          PEGGY\n    You're right.  It's not funny now.\n    Maybe we both grew up.\n\n          MAGGIE\n    Thanks.  Will you fix my hair?\n\n              CUT TO:\n\n  EXT. MAGGIE'S HOUSE - LATER THAT MORNING\n\n  Maggie exits her house, gets on her bike and rides off towards\n  town.\n\n  INT. IKE'S HOTEL ROOM - LATER THAT MORNING\n\n  Ike is still in bed.  He slowly blinks awake, stretches, and is\n  about to  throw off the covers when Maggie's voice breaks the\n  silence.\n\n          MAGGIE\n    Freeze.  Hold on to those covers -- I\n    didn't come here to see Ike Junior.\n\n  Maggie smiles cheerfully at Ike from the foot of the bed.  He\n  narrows his eyes at her.\n\n          IKE\n    I take it the desk clerk is one of your\n    many admirers.\n\n          MAGGIE\n      (deadpan)\n    How do I do it?  I'm not that beautiful.\n\n  Ike notices Maggie is holding two coffees.\n\n          IKE\n    Coffee.  Now.\n\n  Maggie hands it to him.\n\n          MAGGIE\n    You're welcome.  Your notes made\n    interesting bedtime reading -- if you\n    like trashy fiction.  Your observations\n    are distorted, ungrounded an incomplete.\n    You must be very proud.\n\n          IKE\n    I'm not a boastful man.  What's your\n    point?\n\n  Ike puts a shirt on as Maggie speaks.\n\n          MAGGIE\n    My point is that one again, you're\n    getting it all wrong.  That won't\n    improve your reputation any, and it's\n    not very flattering to me either.  So,\n    I'm going to give you a chance to write\n    the truth.\n\n          IKE\n    Really.\n\n  Maggie turns away from him as he dresses.\n\n          MAGGIE\n    I've decided to cooperate and let you\n    interview me.\n      (beat)\n    For a thousand bucks.\n\n  Ike clears his throat as he stands putting his pants on.\n\n          MAGGIE (cont'd)\n    I want a big wedding and a killer dress\n    and for a grand I will answer all your\n    questions and let you follow me around.\n\n  Ike takes his coffee with him as he picks up his glasses, puts\n  them on and crosses to the window.\n\n          IKE\n    My magazine doesn't pay because for\n    stories.  It's not what you call ethical.\n\n          MAGGIE\n    Oh, but making up the facts as you go\n    along is ethical?  Actually, I meant\n    you.  You probably got severance or\n    expenses or both.  I'll take your check.\n    No credit cards.\n\n          IKE\n      (to Maggie)\n    You've seen the post-its.  I've already\n    got more juicy material than I need.\n    Why should I pay you dollar one?\n\n          MAGGIE\n    Because I think you're writing on spec\n    and with a first person interview, you\n    might actually sell that thing.\n\n  Ike knows she's right.\n\n          IKE\n    Too much.\n\n          MAGGIE\n    Seven-fifty.\n\n          IKE\n    Five hundred.\n\n          MAGGIE\n    Six-fifty.\n\n          IKE\n    Done.\n\n  Scowling, he writes out the check and hands it to her.  Maggie\n  looks at it and smile sweetly.\n\n              CUT TO:\n\n  EXT. MAGGIE'S HOUSE - DAY\n\n  Ike jogs alongside of Maggie on her bike.  Maggie parks her bike\n  and they go inside her door to the house.\n\n  INT. MAGGIE'S FOYER AND STAIRS - DAY\n\n  Maggie leads Ike upstairs to her workroom.\n\n          MAGGIE\n    Pardon the mess.  I haven't cleaned\n    since the fifth grade.\n\n  INT. MAGGIE'S WORKROOM - LATER\n\n  Insert on a cappuccino machine.  We PULL BACK and see Maggie and\n  Ike standing at her work table.  An automatic cappuccino maker\n  stands on the table.  Its base is made from a used paint mixing\n  machine.  It looks very shiny and futuristic.  Maggie's logo\n  \"MAG\" is on the side.  The machine shakes as it steams the\n  cappuccino.  Ike notices another homemade machine on the table.\n\n          IKE (cont'd)\n    What's this over here?\n\n          MAGGIE\n    It's a birthday present for my cousin.\n    Put your finger in.\n\n          IKE\n    Cindy the manicurist.\n\n  He puts his finger in the wrong hole of the machine.\n\n          MAGGIE\n    No, the other one.\n\n  He puts his finger in the correct hole.  She turns it on.  The\n  brushes rotate.\n\n          IKE\n      (laughing)\n    This is wonderful.  You reconfigure all\n    these industrial parts and you do\n    something amazing with it.\n\n  He looks around and spots some gadgets and lamps on another table.\n  He walks to them.\n\n          IKE (cont'd)\n    Amazing.  Found industrial stuff.\n    Willow lamp... Rasta lamp...\n\n  He picks up one of the many logos on the counter.  Each boasts a\n  \"MAG\" logo.\n\n          IKE (cont'd)\n    Is this your preferred logo?\n\n          MAGGIE\n    I think so.\n\n          IKE\n    I like it.  This whole thing is pretty\n    incredible.\n      (studying a lamp)\n    I think you could probably sell this\n    lamp idea in New York.\n\n          MAGGIE\n    Maybe someday.\n\n          IKE\n    You afraid to try?\n\n          MAGGIE\n      (stares at him)\n    No, I'm not afraid.  Just... Maybe\n    someday.\n\n          IKE\n    Well, I'm impressed.  Absolutely\n    incredible.\n      (sitting)\n    I didn't expect pink and lacy, but this\n    isn't exactly a woman's room.\n\n          MAGGIE\n    What an incredible chauvinistic\n    observation.\n\n  INT. MAGGIE'S LIVING ROOM - A BIT LATER THAT DAY\n\n  Maggie's showing Ike engagement rings.\n\n          MAGGIE\n    That's Brian's.  He took me ut canoeing\n    on the lake and gave me the ring in a\n    velvet box.\n\n  Ike snores.  Maggie hits him.\n\n          MAGGIE (cont'd)\n      (defensive)\n    It was classic.\n\n  Maggie hands Ike another ring.  This one is in the shape of a\n  Grateful Dead rose.\n\n          MAGGIE (cont'd)\n    Gill.  Of course.  He proposed at the\n    tie-dye t-shirt stand at a Dead concert.\n    It was very sweet until he hallucinated\n    that the drum set was a blood-sucking\n    space alien.\n\n          IKE\n    Always a mood killer.\n\n          MAGGIE\n    Still sweet.\n\n  Maggie hands Ike a third ring.  It's in the shape of a butterfly\n  and studded with multi-color gems.\n\n          MAGGIE (cont'd)\n    George.  He proposed at a butterfly\n    farm in St. Thomas.  The ring was\n    inside a cocoon.\n\n          IKE\n      (grimacing)\n    It's a little \"Silence of the Lambs\"\n    for me.  I can't believe you waited for\n    the wedding to run.\n\n          MAGGIE\n    He's an entomologist!  I thought it was\n    very unique.\n\n  Now Maggie shows Ike the ring on her hand.  It's a gold \"#1\" with\n  a diamond set into the number.\n\n          MAGGIE (cont'd)\n    And here we are at Bob.  He proposed\n    during the seventh inning stretch...\n\n  Ike touches her hand to examine the ring more closely.  Her\n  surprise at his touch shows on her face as she finishes her\n  sentence.\n\n          MAGGIE (cont'd)\n    ... At an Oriole's game.\n\n  She takes her hand down.  Ike steps away.\n\n          IKE\n    Wait.  Don't tell me.  The scoreboard\n    lit up with \"Mary me, Maggie.\"\n\n  Ike picks up his cup of cappuccino and moves behind the couch.\n\n          MAGGIE\n    It was one of the most wonderful\n    moments of my life.  Cal Ripken even\n    applauded.\n\n          IKE\n      (stopping)\n    Highly suspect.\n\n          MAGGIE\n    What do you mean?  It was incredibly\n    romantic!\n\n          IKE\n    Maybe it's just me, but -- if you got\n    to dress it up, it doesn't ring true.\n\n  Ike moves back to the couch.\n\n          IKE (cont'd)\n    I think the most anybody can honestly\n    say is, \"Look...\"\n      (sits on the arm\n       of the couch)\n    \"I guarantee that we'll have tough\n    times.  I guarantee that at some point\n    one or both of us will want to get out\n    of this thing.  But I also guarantee\n    that if I don't ask you to be  mine,\n    I'll regret it for the rest of my life.\n    Because I know in my heart -- you're\n    the only one for me\"\n\n  Maggie stares at Ike for a beat.  His words have taken a little\n  bit of her breath away.  She covers.\n\n          MAGGIE\n    I like it.\n\n  She moves from the fireplace to a chair and sits.\n\n          MAGGIE (cont'd)\n    I'd like it better on a scoreboard.\n      (lightly)\n    Is that how you proposed when you asked\n    your wife to marry you?\n\n\n  Ike is taken aback.\n\n          MAGGIE (cont'd)\n    Don't look so surprised, you've got\n    divorce written all over you.\n\n          IKE\n    I'm a work in progress.\n\n          MAGGIE\n    So?  Is that what you said to her?\n\n          IKE\n    No.  I think I said something eloquent\n    like, \"So, uh -- maybe we should, ya\n    know.  What do you think?\"\n\n          MAGGIE\n    Now that's romantic.  A proposal like\n    that and you didn't find eternal bliss?\n    What went wrong?\n\n  Ike takes a swallow of cappuccino.\n\n          IKE\n    I don't know.\n\n          MAGGIE\n    You don't know.\n\n          IKE\n    No.\n\n          MAGGIE\n    Maybe you should ask her some time.\n    Ever thought of that?\n\n  Ike is restless.  He stands up.\n\n          IKE\n    Call me crazy, but I believe that check\n    I gave you entitles me to ask the\n    questions for a while.\n\n  Ike puts down his cup of coffee, gets his tape recorder and sits\n  close to Maggie.\n\n          MAGGIE\n    Fair enough.\n      (thinks a beat)\n    Actually...\n\n  Maggie move to TV.  She picks up Ike's stolen post-it notes and\n  her wedding video on top of the TV, and goes to the front door.\n\n          MAGGIE (cont'd)\n    I'll just need one more day to make sure\n    your check clears.\n\n          IKE\n    Ow!\n\n              DISSOLVE TO:\n\n  EXT. HALE STREET - THE NEXT DAY\n\n  Ike and Maggie drive in Maggie's truck.  They pull up in front of\n  a Bridal Shop.\n\n  A spectacular dress fills the small window.  It's beautiful,\n  romantic, sexy.  Maggie and Ike can be seen in the reflection.\n\n          MAGGIE\n    Even with everything that's happened\n    I've still never been married and I\n    still deserve a beautiful dress.\n\n          IKE\n    Agreed.\n\n  Maggie gives Ike a smile that lights up the sky.  They go inside.\n\n  INT. BRIDAL SHOP - DAY\n\n  The place is fairly large and prosperous, probably the place to\n  go in the Tri-County area.  A little FLOWER GIRL, 10, is being\n  fitted on the pedestal in the middle of the room.  A saleswoman,\n  POLLY, has taken the flower girl under her wing.  They are both\n  under the expert eyes of a stern looking woman, MRS. WHITTENMEYER,\n  the shop owner.  Also, the girl's MOTHER is there watching.\n\n      POLLY\n      (to the mother)\n    She'll be the prettiest little flower\n    girl in your daughter's wedding.\n\n          MAGGIE\n    Mr. Whittenmeyer.  Hi, Polly!\n\n  The flower girl sees Maggie and runs and hides behind Polly.\n\n          POLLY\n    Hi, Maggie.  You'll have to excuse her,\n    Maggie.  Some of the children are\n    afraid of you since you dragged that\n    little boy up the aisle.\n\n          MAGGIE\n    I didn't drag.\n      (then to the girl)\n    He tripped on his shoelaces.\n\n  Mrs. Whittenmeyer comes forward to greet Maggie.\n\n          MRS. WHITTENMEYER\n    You've come for your dress.  Good!\n    I'll get it from the back.\n\n  Maggie leads her to the front window.\n\n          MAGGIE\n      (happily)\n    Actually, I would like to get this dress.\n\n  She points to the dress.  She smiles back to Mrs. Whittenmeyer,\n  expecting her to share her joy.  Mrs. Whittenmeyer darkens.\n\n          MRS. WHITTENMEYER\n      (to Polly)\n    Polly, take Leslie into change.\n      (then, to Maggie)\n    But the one you have on hold is lovely.\n\n          MAGGIE\n      (pleasantly)\n    Yes.  But I've changed my mind.\n\n          MRS. WHITTENMEYER\n    It's one thousand dollars.\n\n  Maggie is keenly aware of Ike listening in.\n\n          MAGGIE\n    I have one thousand dollars.\n\n          MRS. WHITTENMEYER\n      (firmly)\n    The other one is only three hundred\n    dollars.\n\n  Maggie lowers her voice, hoping to lessen the humiliation of the\n  moment.\n\n          MAGGIE\n    Is this dress for sale?\n\n          MRS. WHITTENMEYER\n    It just seems like an awful lot of\n    money to spend on one of your dresses,\n    Maggie... You only wear them for about\n    ten minutes.\n\n  Ike watches with regret as Maggie's child-like enthusiasm\n  drains away, her happy mood crushed by the tactless assault of\n  the shop owner.  He's starting to see that it's no always easy\n  being Maggie. There's a tremor in her voice.\n\n          MAGGIE\n    Yeah, that's a good point.\n      (then, sitting)\n    The other dress is nice.\n\n  Ike calls out to Mrs. Whittenmeyer.\n\n          IKE\n    Mrs. Whittenmeyer.  May I talk to you\n    for a second?\n\n  She walks over to him.\n\n          IKE (cont'd)\n    I don't know much about this kind of\n    thing.  I'm from out of town.  You're a\n    salesperson, right?  You're here to\n    sell wedding dresses.\n\n          MRS. WHITTENMEYER\n      (huffy)\n    Yes.  I've been here for thirty years.\n\n          IKE\n    Perfect.  Because Miss Carpenter is\n    here to buy one.  But not just any one.\n    She wants that one.\n\n          MRS. WHITTENMEYER\n    It's a thousand dollars!\n\n  Ike goes over and takes the mannequin out of the window.  Mrs.\n  Whittenmeyer catches the wig as he puts the mannequin under his\n  arm.\n\n          IKE (cont'd)\n    Look, Aunt Bea, we're buying this\n    beautiful dress and anything else she\n    wants or I'm coming back here with a\n    squirt gun filled with India ink.\n\n  Mrs. Whittenmeyer wilts under Ike's fierce gaze.  She turns to\n  Maggie.\n\n          MRS. WHITTENMEYER\n    Will he really do that?\n\n  Maggie gives her a look.\n\n          MR. WHITTENMEYER (cont'd)\n      (to Maggie)\n    Well, why don't you pick out some\n    accessories while I get this ready,\n    dear.  Polly, will you come help me,\n    please?\n\n  Polly comes to help carry the mannequin away.\n\n  ANGLE ON POLLY AND MRS. WHITTENMEYER:\n\n          POLLY\n      (whispering to Mrs. Whittenmeyer)\n    It's a thousand dollars.\n\n          MRS. WHITTENMEYER\n    Shhhh!  The man has ink!\n\n  Maggie looks gratefully at Ike.\n\n          IKE\n    Tough to spend money in this town.\n\n  TIME CUT: A FEW MINUTES LATER:\n\n  Ike sits as he hears Maggie's voice behind him.\n\n          MAGGIE (o.s.)\n    What do you think?\n\n  Ike turns around.  Maggie is standing on the pedestal, wearing\n  the dress and looking unbelievably gorgeous.  She is overwhelming\n  to behold and Ike has to struggle to keep his face under control.\n\n          IKE\n      (stammering)\n    You look... uh... You look fine.\n\n          MAGGIE\n    Fine.  The newspaper's upside down.\n    That's better than fine.\n\n          IKE\n    Bob will be very happy.\n\n  She glows.  Then the moment between them is broken as she\n  suddenly remembers something and grabs the veil off her head.\n\n          MAGGIE\n    Bob!  I almost forgot!  I have to meet\n    Bob!\n\n  INT. DINER - DAY\n\n  This is a great place -- a major hub of social life in Hale.  The\n  food is greasy and good, Mrs. Pressman is the waitress, and the\n  CROWD the essence of what is wonderful about a small town.  Bob,\n  Maggie and Ike sit on the counter.  Mrs. Pressman CHUFFS about\n  the luau, then moves around the corner.\n\n          BOB\n    Mrs. Pressman, I think we're ready to\n    order.\n\n          MRS. PRESSMAN\n    We're out the special because\n    somebody...\n      (indicates COOK with head)\n    ... didn't order enough sausage.\n\n          BOB\n    Let me have the garden omelette.  Egg\n    whites only.\n\n  Ike looks at Maggie.  He'd bet a thousand bucks on what she'd say\n  next.\n\n          MAGGIE\n    I'll have the same.\n\n          IKE\n      (clears his throat)\n    Of course.\n\n          MAGGIE\n    What was that?  I can't order  my eggs\n    without sarcasm?\n\n          BOB\n    Neutral corners you two.  You're on the\n    same team now.  Any more fighting and\n    it's fifteen minutes in the penalty box.\n      (gently, to Ike)\n    Maggie's the nicest person you'll ever\n    meet.  But she's always focusing out\n    there.  She's got to start focusing\n    more in here.\n      (taps his chest)\n    That's why she's had some -- whatever\n    you want to call it -- problems in the\n    past.\n      (to Maggie)\n    That's what we're working on -- focus.\n    Right, Maggie?  Focus on Maggie.  Focus\n    on Bob.\n\n  As Bob has been talking, Ike has been watching Maggie's face.\n  The joy seems to have drained out of her.\n\n          MAGGIE\n      (quietly)\n    Right.\n\n          BOB\n      (to Ike)\n    I lead Maggie through a visualization\n    exercise.  All the sports shrinks use\n    this head stuff.  Visualize the end\n    zone, if you catch my drift.\n\n  Bob takes out a notepad and hands it to Maggie.\n\n          BOB (cont'd)\n    Here's today's mantra: \"It's an open\n    field to Big Bob.\"\n\n          IKE\n    Tell me.  When you get to the altar,\n    will you spike the bouquet?\n\n          MAGGIE\n    You know, there's no...\n\n  Before Maggie can finish, Ike intercepts her.\n\n          IKE\n    Well, I'm off.  A reporter's work is\n    never done.\n      (heading to the door)\n    Mrs. Pressman, thank you.\n\n          MRS. PRESSMAN\n    Tootaloo.\n\n  INT. ATLANTIC HOTEL - MOMENTS LATER\n\n          GRANDMA JULIA (V.O.)\n    I'd like to explain about the weddings.\n    There are reasons why they didn't come\n    off.  Three weddings, no \"I do's\".  You\n    can't believe how much cake we were\n    left with.  I should weigh three\n    hundred pounds.  I don't think her\n    father minded spending so much money on\n    booze that nobody drank.\n\n  We hear Grandma as through the hotel doors, we see Maggie exit\n  the diner.  She gets a bag from inside the cab of her truck and\n  comes inside the hotel where she finds Ike talking to Grandma,\n  who is having tea with her friend, NETTA.\n\n          MAGGIE\n    Ike... Hi, Grandma.\n\n          IKE\n    Gram here was going to give me the\n    skinny on why you run from marital\n    bliss.\n\n          GRANDMA JULIA\n    Right, cover your ears, Netta.  It's\n    not that she's afraid of the wedding,\n    she's afraid of the wedding night.\n    Innocent girls are terrified of \"the\n    one-eyed snake\".\n      (getting into it)\n    Why, when I was a virgin bride, I took\n    a knitting needle with me into the bed...\n\n  Ike winces.\n\n          MAGGIE\n    Actually, Grandma, I charmed the one-\n    eyed snake awhile ago.\n\n          GRANDMA JULIA\n    Oh, yeah, I forgot.  I'll tell you one\n    thing, your grandpa didn't forget that\n    wedding night.\n      (no Netta)\n    You can take your hands off your ears,\n    Netta.  Your tea's getting cold.\n\n          MAGGIE\n    Can you excuse us a minute?\n      (then to Ike)\n    May I have a word with you, please?\n\n  Maggie moves toward door.\n\n          IKE\n    Bye, Netta... Bye, Grandam.\n\n  He steps over to Maggie in the doorway.\n\n          MAGGIE\n    I found this and didn't know if it was\n    something interesting.\n\n  Maggie hands Ike a 30-year-old LP: Miles Davis' \"Kind of Blue.\"\n\n          IKE\n      (excited)\n    Oh, my God -- It's Miles Davis.  This\n    is \"King of Blue\"!  This is the\n    original recording.  Hard to find in\n    good condition.  Where did you find\n    this?\n\n          MAGGIE\n      (casual)\n    It was in the attic.  It was jus\n    sitting there gathering dust.\n\n          IKE\n    It's valuable.  Hang onto it.\n\n          MAGGIE\n    No.  You take it.\n\n  She steps outside, leaving Ike with the record.\n\n          IKE\n    Hmmm... Figuring out what kind of music\n    I like and then finding me a rare album.\n    You're not trying to soften me up, are\n    you?\n\n          MAGGIE\n    No -- I'm cleaning an attic.  I\n    wouldn't attempt the impossible.\n\n  She turns and walks back to the diner where Mrs. Pressman is\n  outside watering plants.  Ike looks after Maggie and then back\n  down at the record in his hand.  Somehow it makes him sad.\n\n              CUT TO:\n\n  INT. IKE'S CAR - LATER THAT DAY\n\n  Ike drives through Hale gobbling french fries from the fast food\n  bag in his lap.  Ike passes THE INN HALE BAR, same dump of a\n  tavern he talked to bartender at.\n\n  ANGLE ON: MAGGIE'S CAR parked a few cars down.  He pulls over\n  and parks.  He gets out and speaks into his tape recorder.\n\n  INT./EXT. THE INN HALE BAR -- DAY\n\n  Ike approaches the window of the bar.  There's a DRUNK MAN and a\n  DOG sitting outside.  Inside, we see two figures from the back,\n  arms around each other.  One is definitely Maggie.  The other is\n  definitely not Bob.\n\n          MAGGIE\n      (coaxing)\n    C'mon.  Let's go.\n\n  As Maggie helps the man get up,  we see that it's Walter, Maggie's\n  father -- dead drunk.\n\n          WALTER\n      (belligerently)\n    I haven't had any fun since you got\n    your driver's license...\n\n  They stumble and lurch, exiting the bar toward Maggie's car.\n\n          MAGGIE\n    I'm not exactly having fun, either...\n    Steady.\n\n          WALTER\n      (to Dog)\n    Good boy, Port Hole.\n\n          MAGGIE\n    His name is Skipper, Dad... Steady.\n\n          WALTER\n    I changed it.\n      (then to Drunk)\n    See you later, Mr. Travis.\n      (then to Maggie)\n    That guy has a problem... Maggie, you\n    can run everyone's life but your own.\n\n\n  Maggie's having trouble keeping him steady as she opens the car\n  door.  Ike is there in a flash to help her pull Walter into the\n  car.\n\n          WALTER (cont'd)\n    Good daughters let their fathers pass\n    out.\n\n  Walter passes out on the front seat.\n\n          MAGGIE\n      (without difficulty)\n\n    Ike... Please don't write anything\n    about this --\n\n          IKE\n    No.  Forget about it.  Don't even think\n    about it.\n\n  Maggie looks at him with real gratitude.  She swings the car\n  door shut.\n\n          MAGGIE\n    Watch your leg, Dad.\n      (then to Ike)\n    I'm so tired of this.\n\n          IKE\n    Why don't you let him sleep it off in\n    the trunk. I'll take you for a ride.\n    Then we'll come back for him.\n      (to Drunk on bench)\n    Keep an eye on him.\n\n      DRUNK MAN\n    I'm too loaded.\n\n          IKE\n    I was talking to the dog.\n      (turning to Maggie)\n    All right?\n\n  Maggie thinks about this for a moment.  She takes a deep breath.\n\n          MAGGIE\n    Okay... I'll just grab my jacket.\n\n              CUT TO:\n\n  EXT. ROAD - LATE DUSK TO NIGHT\n\n  Establishing of Ike's car driving.\n\n  INT. IKE'S CAR - LATE DUSK TO NIGHT\n\n  Maggie and Ike ride along.\n\n          IKE\n    My dad managed a business and two\n    mistresses.  He wanted me to be a\n    novelist.  More?\n\n  Maggie nods,\n\n          IKE (cont'd)\n    My mother wanted me to become a\n    musician.  0 for two.  But at least\n    I'm a journalist and we all know\n    journalism is literature in a hurry.\n\n  EXT. IKE'S CAR - COUNTRY ROAD - NIGHT\n\n  Ike and Maggie stare forward.  Both seem in melancholy moods.\n  They're beginning to sense they're in trouble here.  Suddenly,\n  the car falters and jerks.  It shows to a stop on the shoulder of\n  the road.  The car backfires and smokes.\n\n  EXT. IKE'S CAR - COUNTRY ROAD -  NIGHT\n\n  Ike and Maggie sit in the steaming car for a moment.\n\n          MAGGIE\n    Your filter's clogged.  This takes\n    unleaded.\n\n          IKE\n    Can you fix it?\n\n          MAGGIE\n    First I have to find some tools.  I\n    need a half and a nine-six-tenth.\n\n          IKE\n      (removing his glasses)\n    Of what?\n\n          MAGGIE\n      (in amazement)\n    Wrenches.  My dad's gonna love that one.\n\n  Maggie slams the food closed.\n\n          IKE\n    Kind of isolated.\n\n          MAGGIE\n    Yeah.  It's kind of nice.\n\n  An uncomfortable silent pause.  Ike breaks the moment.\n\n          IKE\n    There's one thing we New Yorkers know\n    how to do is hail a cab.  If there's no\n    cab, we walk.\n\n  Ike stares off down the road.  Maggie indicates a building in\n  the distance, then turns off the car lights.\n\n          MAGGIE\n    I can get some tools over there.... and\n    save the battery... There's one thing\n    we country girls know how to do is cut\n    across a field.  It's quicker.\n\n  Maggie points diagonally across the field to where a gas station\n  sign glows and the lights from the outer house twinkle.\n\n  He smiles and follows her into the field.\n\n          MAGGIE (cont'd)\n    Be careful of snakes.\n\n          IKE\n    Snakes?  Are you serious?  I don't like\n    snakes.  I've never even seen a snake.\n\n  He steps carefully into the field, then hops gingerly toward Maggie.\n\n  MOMENTS LATER\n\n  Maggie leads Ike through a cornfield.\n\n          MAGGIE\n    Do you think there's only one right\n    person for everybody?\n\n  Ike chooses his words carefully.\n\n          IKE\n    No.  But I think attraction is too\n    often mistaken for rightness.\n    Attraction is very misleading.  And if\n    it's mutual, it's well, terribly\n    distracting.\n\n          MAGGIE\n    Yes it is.  And it doesn't mean\n    anything.\n\n  Ike nods as they come to a wooden fence.  She puts her hand on\n  his shoulder.  Ike puts his hands around her waits to give her a\n  boost over the top.  We see the flicker of misunderstanding cross\n  Maggie's face at the initial contact.  Neither of them moves --\n  forward or back, but the electricity is obvious.\n\n  ANGLE ON:  Ike.  His conflicted feelings are apparent.  With\n  difficulty, Maggie straightens up and they both quickly remove\n  their hands.\n\n          MAGGIE (cont'd)\n      (lightly)\n    I suddenly forgot how to climb a fence.\n\n  They look at each other for a moment, then:\n\n          MAGGIE AND IKE\n      (breaking the\n       moment jokingly)\n    \"Tools\".\n\n  She climbs over the fence on her own and Ike follows.  They see\n  an old guy, LIONEL, whittling on a porch.\n\n          MAGGIE (cont'd)\n    Lionel, can I borrow some tools?\n\n          IKE\n    Yeah, we need a half and nine-\n    sixteenths.\n\n          LIONEL\n    Gonna bust out of another wedding?\n\n          IKE\n    You're sure well known around here.\n\n  EXT. FISHER AND ELLIE'S BUILDING - THE NEXT DAY\n\n  Establishing shot.\n\n  INT. FISHER AND ELLIE'S KITCHEN (NYC) - DAY\n\n  INT. IKE'S HOTEL ROOM - DAY\n\n  INTERCUT BETWEEN TWO LOCATIONS:\n\n  Ike sits on his bed, on the phone, working and eating his\n  breakfast.  He's watching Maggie's wedding tape again.  Fisher\n  is cooking an elaborate breakfast.  Ellie rushes around getting\n  ready for work.  He is on the phone to Ike.\n\n          FISHER\n      (into phone)\n    Yes, well, my theory was that she may\n    be running because she gets attention...\n    Negative attention is attention.\n    Like when women whack you on the street\n    because of your column, that's negative\n    attention.\n\n          IKE (V.O.)\n    This is about her negative attention,\n    not mine.  Did you get the\n    reimbursement for the dress yet?\n\n          FISHER\n      (into phone)\n    No, I'm paying for the dress.  Do you\n    think she's still gonna run?\n\n          IKE (V.O.)\n    I don't know.\n\n  Ellie enters the kitchen, hears the question and shakes her head\n  to herself.  If only these boys would give it up.\n\n  INT. IKE'S HOTEL ROOM - CONTINUOUS\n\n  He is finding it very hard to gloat.  Fisher is annoying him.\n\n          IKE\n      (into phone)\n    Look -- I'll be in there later today.\n    I'll come by and tell you all about it.\n\n          FISHER (V.O.)\n    You're coming here?\n\n          IKE\n      (into phone)\n    Yeah.\n\n          FISHER (V.O.)\n    Then come for dinner.\n\n          IKE\n      (into phone)\n    Okay, we'll order out.\n\n          FISHER (V.O.)\n    Order out like a Philistine, when you\n    got the Galloping Gourmet here?...\n\n  Ike hangs up and watches more of the George Swilling wedding\n  video.\n\n  INT. NEW YORK BAR - DAY\n\n  The bar from the opening scene.  GEORGE SWILLING, the same man\n  Ike talked to before, is sitting on a stool, nursing his drink.\n  He looks better.  Ike enters.  George looks up and recognizes\n  Ike, who takes the bar stool next to him.\n\n          IKE\n    Get this man a Kamikaze.\n\n          GEORGE\n    Splendid dissection of Maggie Carpenter,\n    very professional job.\n\n  Ike sits and leans over to George.\n\n          IKE\n      (whispers)\n    You could have told me you were fiance\n    number three.\n\n          GEORGE\n    And end up in the papers?  I've been\n    humiliated enough already to last a\n    lifetime, thank you.  I'm sorry she got\n    you canned.\n\n          IKE\n    Thanks.\n\n          GEORGE\n    She's a cacophony of contradictions.\n\n          IKE\n    Well, I'm writing another article on\n    the cacophony.\n\n          GEORGE\n    Ah, can't stay away from her, can you?\n    Like a moth to a flame.\n\n          IKE\n    Guess you'd know about that.  You're an\n    entomologist, right?  How's business?\n\n          GEORGE\n      (taking a sip\n       of his drink)\n    Not bad.  I was traveling around\n    studying the reproductive and migratory\n    patterns of locusts when Maggie met me.\n\n          IKE\n      (sarcastic)\n    Neuter a locust, feed the world.\n\n      GORGE\n    Not the world.  Just Africa and China.\n\n  Ike wipes the smirk off his face.  Like Maggie's other men, this\n  guy has a worthy accomplishment under his belt.\n\n          GEORGE (cont'd)\n    You know Maggie was the only girl I\n    ever met who would hold my tarantula.\n    On the first date.\n\n          IKE (cont'd)\n    So, tell me, George, why do you think\n    she ran?\n\n          GEORGE\n    Same as you said.  What did you call\n    her?  A \"man-eater\", \"a devouring death\n    goddess.\"\n\n          IKE\n    I don't think that's why she ran.\n\n          GEORGE\n    Why do YOU think she ran?\n\n  Ike sips his drink before answering.\n\n          IKE\n    I don't know.  I'm working on it.  I\n    was on the wrong track.\n\n          GEORGE\n    And you defending her?\n\n          IKE\n    No.  I call it like I see it.  I'm a\n    journalist.  I'm a truth teller.\n\n          GEORGE\n    Unbelievable, she got to you.\n\n          IKE\n    Oh, please!\n\n      GORGE\n    Join the club.\n      (passing him\n       his drink)\n    Here, you need this more than me.\n\n  George heads out.\n\n          IKE\n      (protecting, taking\n       his tape recorder\n       out of his pocket)\n    I'm writing an article, I'm getting\n    paid to do this, it's going to be a\n    cover story, it's going to be published\n    ... The facts will be read someday.\n\n  As George pauses in the doorway, Ike holds up his tape recorder.\n\n          IKE (cont'd)\n    What kind of eggs did she like?\n\n          GEORGE\n    Poached, just like me.\n\n  George exits.\n\n              CUT TO:\n\n  EXT. NEW YORK STREET/FISHER AND ELLIE'S BUILDING - DAY\n\n  Ike walks down a street toward Ellie and Fisher.\n\n              CUT TO:\n\n  INT. FISHER AND ELLIE'S APARTMENT (NYC) - NIGHT\n\n  Ellie is on the phone as Fisher enters with beer.  Ike sits at\n  the piano.\n\n          FISHER\n      (sarcastically)\n    Overpriced nice apartment and Chinese\n    takeout.  That's New York living.\n\n          ELLIE\n      (into phone)\n    ... Just call me when you have it.\n      (hangs up, then to Fisher)\n    Ike, how is the story coming?  Is she a\n    man-eater?\n\n          FISHER\n    Or a vegetarian?\n\n          ELLIE\n    Or does she pick \"NGB'S\" -- \"Nice Guys,\n    But...\"  Nice guys, but I'm cheap.\n    Nice guys, but he lives with his mom...\n    Nice guys, but he just out of prison.\n\n          IKE\n    No... They're interesting guys.  Each\n    one of these guys has something going\n    for him.  I mean, one's been up Everest.\n    Another's become a priest.  One's a\n    pretty good guitar player.  And this\n    guy today tried to end world hunger, if\n    you can believe that...\n\n          FISHER\n    Whoa, Ike.  Getting a complex, buddy?\n\n          ELLIE\n    Fisher, let him talk.\n\n          IKE\n      (sits)\n    But one of those guys -- not one of\n    them -- knew her at all.  Each one was\n    convinced that she was perfect for them,\n    but they didn't see her.  And she never\n    showed up so they couldn't see her.\n    It's a very symbolic thing happening.\n    She becomes what she thinks they wanted\n    to be.\n\n  Fisher doesn't like the sound of this.  He glances at Ellie, who\n  is looking very interested.\n\n          FISHER\n      (in shock)\n    Ike is turning sensitive and I can't\n    bear to watch.  I'm going to make a\n    fresh pot of tea.\n\n  The phone rings as Fisher exits.  Ike goes to the piano as Ellie\n  picks up the phone.\n\n          ELLIE\n      (into phone)\n    Yeah... Oh, Jay... Okay... Bye.\n      (hangs up, then yells to Fisher)\n    Fisher, don't forget the fortune\n    cookies.\n\n  She joins Ike at the piano.  Ike gets serious.\n\n          IKE\n    Is that what I did to you?  Is that\n    what happened?  Did I just not see\n    you?\n\n          ELLIE\n    No.  No, you didn't.\n\n  He hugs her.\n\n          IKE\n      (heartfelt)\n    Well -- I'm sorry, I'm really sorry,\n    Ellie.\n\n          ELLIE\n    I'm sorry, too.\n      (beat)\n    Wow.  That only took us between years\n    to say.\n\n  Ellie blinks back sentimental tears.\n\n              CUT TO:\n\n  EXT. TROUT'S BARN - THE NEXT NIGHT\n\n  We hear Hawaiian music.  We see a truck with GUESTS drive up and\n  HULA DANCERS through barn slats.\n\n  INT. TROUT'S BARN - NIGHT\n\n  It's a small barn that's been converted into a luau with a bar.\n  A BAND plays for two hula dancers.  The Trouts had decorated it\n  as a little slice of Hawaii.  There are tiki lights, numerous\n  rented plastic palm trees and fiberglass copies of Hawaiian\n  statuary.  Strings of colored lights crisscross the ceiling.\n  It looks like a Hawaiian high school gym on prom night.\n\n  Maggie's family, Mrs. Trout and people we've already met, and\n  more, are here, milling around wit tropical drinks garnished\n  with umbrellas.  Plastic leis abound and most people have\n  managed to find their old Hawaiian shirts.\n\n  As we come in, the hula dancers finish their applause and Mrs.\n  Trout announces.  Hula dancers stop.\n\n          LOU TROUT\n    Welcome to our annual country luau.  As\n    you know, Betty and I got married on\n    the rim of the crater, Diamond Head.\n\n          MRS. TROUT\n      (grabbing the\n       microphone)\n    This year, we're dedicating our first\n    dance to the soon-to-be newlyweds, the\n    King and Queen of Hawaii, Maggie and\n    Bob.\n\n  The couple enters.  Bob is a goody bronzed god in his King\n  Kamahamela outfit.  Maggie is spectacular in her authentic\n  looking Hawaiian Princess get-up.  But her face reflects none\n  of the festivities around her.  Every now and then, she looks up\n  and glances around for Ike, hating herself for it.\n\n          MRS. TROUT (cont'd)\n    King and Queen, dance.\n\n  Maggie and Bob start to dance as the Quarter sings \"Aloha Oe.\"\n\n          MRS. TROUT (cont'd)\n    Everybody dance.\n\n  Everybody dances.\n\n              TIMES OUT:\n\n  Maggie and Bob pose for pictures with some of the guests.\n\n          MRS. TROUT\n    Pictures of the King and Queen.\n\n  Dennis poses with Maggie.  Cory poses with Bob.  Mrs. Trout runs\n  out of film and goes to get more, leaving Peggy and Maggie alone.\n  Peggy whispers to Maggie.\n\n          PEGGY\n    Lighten up, wahine.\n\n          MAGGIE\n    Lighten up, what?\n\n          PEGGY\n    This party is for you and Bob.  Get\n    your mind off the reporter.\n\n          MAGGIE\n    I haven't seen him in twenty-four hours.\n    It just gives me the creeps a little bit.\n    I'd feel better if I knew where he was.\n\n          PEGGY\n      (nods to door)\n    Would it?\n\n  ANGLE ON:  Ike just entering the party.  At least he tried.\n  He's got a tropical sheet wrapped around his pants and shirt.\n  He walks to the bar and is greeted warmly by Lee.  Maggie gets\n  very flustered.\n\n          PEGGY (cont'd)\n    What are you doing?\n\n          MAGGIE\n      (after a beat)\n    I'm going to go dance with Bob.\n    Because he's the man.\n      (referring to her headdress)\n    I like those grapes.\n\n  Maggie dances affectionately with Bob as Mr. Trout, tending\n  bar, greets Ike.\n\n          LOU TROUT\n    Hey, Mr. Graham, welcome to our luau.\n    What can I get you?\n\n          IKE\n    You got something without a toy in it?\n\n            TIME CUT:\n\n  A LITTLE LATER - CLOSE ON\n\n  A pair of expressive pantomime \"A Little Grass Shack\".\n\n  PULL BACK TO REVEAL:\n\n  Mrs. Trout is on stage, introducing hula contestants.  Grandma\n  judges the Hawaiian dancing.  The party is at full tilt -- a\n  little wild, a little goofy.  Some guests (Bob, Cindy, Cory, Lee\n  and Ted) do the limbo.  Walter, Mrs. Pressman doesn't turn as\n  she hears him.\n\n          IKE\n    Aloha.  That's a very fetching\n    headdress you're wearing.\n\n  Ike leans into Maggie, enjoying the smell of her hair.  She\n  notices, but acts casual.\n\n          MAGGIE\n    Where did you disappear to?\n\n          IKE\n    Missed me bad, huh?\n\n              TIME CUT:\n\n  All the guests start banding their pineapple cups.  Walter rises\n  unsteadily, lifting his pineapple.\n\n          MRS. TROUT\n    Attention.  Listen to Walter.  Listen\n    close, he slurs.\n      (then)\n    Shut up, wahines!\n\n          WALTER\n    In the tradition that has grown through\n    the years, it is now Toast Time!  First\n    up, our host, \"A Honey of a Beekeeper\",\n    Lou Trout..\n\n  Lou Trout stands with his glass raised.\n\n          LOUT TROUT\n    May the groom's heart be filled with\n    hopes and the bride's feet be filled\n    with lead!\n\n  There are shouts of \"Hear hear!\"  Walter roars.\n\n          MRS. TROUT\n    May the pitter-patter of little feet\n    not be Maggie's.\n\n          MRS. PRESSMAN\n    May the gifts be returned!\n\n          TED\n    May the back of the dress be as pretty\n    as the front!\n\n  The laughter swells and swells, led by Walter.\n\n  ANGLE ON:\n\n  Ike watches as Maggie takes the heat, raising her glass along\n  with the others.  Bob raises his glass like the good sport he is.\n  Ike can't believe it.\n\n          WALTER\n    You know the old saying, \"You're not\n    losing a daughter...\"  Well, I'd like to!\n\n  Walter gets a bit laugh.  He goes again.\n\n          WALTER (cont'd)\n    Maggie may not be Hale's longest\n    running joke...\n      (under her breath)\n\n  Maggie finishes the punchline along with his father.\n\n          WALTER AND     MAGGIE\n    -- But she's certainly the fastest.\n\n  Uproarious laughter.  Maggie looks terribly pained.  Ike's had\n  enough.  He pushes himself to his feet.  Walter is thrilled.  He\n  shushes the CROWD.\n\n          WALTER (cont'd)\n    Oh, look, Mr. Graham, how about a toast?\n\n          IKE\n    I don't know, give me a minute.\n      (to Maggie)\n    Are you all right with this?\n\n          MAGGIE\n    Excuse me?\n\n          IKE\n    Are you all right with this?  You think\n    this is funny?\n\n          MAGGIE\n    Yes.\n\n          IKE\n    I don't and I don't think you should...\n\n          BOB\n    It's a joke.  They're kidding.\n\n          WALTER AND CROWD\n      (yell)\n    Come on and give us a toast.\n\n          IKE\n    You want me to make a toast?  Okay...\n    I'll give you a toast.  To Maggie's\n    family and friends.  May you find\n    yourselves the bull's eye of an easy\n    target.  May you be publicly flogged\n    for all of your bad choices and may\n    your noses to rubbed in all of your\n    mistakes...\n\n  Ike watches their reaction.  The silence is deafening.  All the\n  guests stare at Maggie.  Mortified, she holds back tears.\n\n          MRS. TROUT\n    That was funny.\n      (a pause)\n    But enough toasts, let's hula.  Let's\n    start the music up.\n\n  She gets everyone up to hula.  Band plays fast tune.  Maggie\n  walks through the CROWD down the steps and outside.  Ike\n  follows, but Peggy grabs a coat for her.  Bob watches her go as\n  Cory approaches.\n\n          CORY\n    Hey, Bob.  I got twenty dollars bet on--\n\n          BOB\n    Not now.\n\n  Bob rushes after Maggie.\n\n          PEGGY\n      (calling after her)\n    Maggie.  Maggie.\n      (to Ike,  handing him a jacket)\n    Here.  She may need this.  It's not\n    really Hawaii.\n\n  Ike exits.  Then, Bob comes over.\n\n          BOB\n    Where'd Maggie go?\n\n          PEGGY\n    Oh, she just went to get me something\n    from the car.\n\n  Cory comes over with Dennis to Bob and Peggy.  BOB/PEGGY/CORY/\n  DENNIS CHUFFA:  About Bart Starr and football.  (Which keeps Bob\n  from going outside to follow Maggie).  Bob thinks about it.\n\n  EXT. TROUT'S BARN - NIGHT\n\n  Ike runs after Maggie.  He grabs her arm and turns her to him.\n\n          IKE\n    I'm the only goddamn person in there\n    pulling for you.\n\n          MAGGIE\n    You humiliated me!\n\n          IKE\n    No, Maggie, I defended you.\n    Humiliating you is what everyone else\n    is doing.  It's the theme of this party.\n\n          MAGGIE\n    I had it under control.  Now they feel\n    sorry for me.\n\n          IKE\n    Well, they should.  Because they're\n    about to watch you hang yourself again.\n\n  Maggie has no response.\n\n          IKE (cont'd)\n    -- Tell me something, do you really\n    care about Mount Everest?\n\n          MAGGIE\n    It's fun!  It's high.\n\n          IKE\n    Or the sexual habits of locusts?\n\n          MAGGIE\n    That was very interesting research\n    George was doing!\n\n          IKE\n    What kind of Dead Head gets a temporary\n    tattoo?\n\n          MAGGIE\n    I already explained about that.\n\n          IKE\n    And where you ever really going to run\n    the leper colony in Molokai?\n\n          MAGGIE\n      (wincing)\n    Brian told you that?\n\n          IKE\n    Or maybe you just wanted to wear the\n    headdress.\n\n          MAGGIE\n    Every one of those times I was being\n    supportive.  Something you won't\n    understand.\n\n          IKE\n    Supportive?  You weren't being\n    supportive.  You were being scared.\n    Just like now.  You are the most lost\n    woman I have ever laid eyes on.\n\n          MAGGIE\n    Lost!\n\n          IKE\n    That's right.  You're so lost you don't\n    even know how you like your eggs.\n\n          MAGGIE\n    What!?\n\n          IKE\n    With the priest, you liked them\n    scrambled.  With the Dead Head, fried.\n    With the bug guy, poached.  Now it's\n    egg whites only, thank you very much.\n\n          MAGGIE\n    That's called changing your mind.\n\n          IKE\n    No, that's called not having a mind of\n    your own.  What are you doing, Maggie?\n    You really want to let that man drag\n    you up Annapuma on your honeymoon?  You\n    don't want to climb Annapuma.\n\n          MAGGIE\n    Yes I do!\n\n          IKE\n    No you don't.  You want a man who will\n    lead you down the beach with his head\n    over your eyes just so you can discover\n    the feel of the sand under your feet.\n    You want a guy who will take you into a\n    cave with a thousand candles just to\n    read you a poem.  You want a man to\n    wake you up at dawn because he's\n    burning to talk to you and he can't\n    wait another minute to find out what\n    you'll say.  Am I right?\n\n  He's laid her flat.  Maggie can't speak.\n\n          IKE (cont'd)\n    Am I right?\n\n  She fights back angry tears.\n\n          MAGGIE\n    Stop.  Stop it!  I'm getting married on\n    Sunday, and you're just trying to make\n    me run!  Why?  Because you're a cynical,\n    exploitative, mean-hearted creep who\n    wouldn't know real love if it bit him\n    in the armpit!  And all you do is tear\n    other people down and-and-and laugh at\n    them, and criticize what they do,\n    because you're too afraid to do\n    anything yourself!  I read your column.\n    You never wrote one about you.  I'm not\n    the only one who's lost and you know it!\n    Am I right?  Well?  Am I right?\n\n  ANGLE ON:  Bob comes outside.\n\n          BOB\n    Mag.  Help me out here.  Green Bay.\n    Right guard.\n\n  Both Maggie and Ike are breathing hard.  Bob comes up to Maggie\n  and gives Ike a very hard look as he puts his arm around his\n  fiancee.\n\n          BOB (cont'd)\n    You know... Blocked Bart Starr, crewcut\n    ... Are you okay?\n\n  Maggie adjusts her face as best she can.\n\n          MAGGIE\n    Yes.\n\n          BOB\n    Let me take you back inside, okay?\n\n  She lets him lead her away.\n\n          MAGGIE\n    Jerry Kramer.\n\n  Ike looks at her drooped shoulder and he shakes his head and\n  walks to his car.\n\n  EXT. HALE METHODIST CHURCH - THE NEXT DAY\n\n  Peggy and Cindy arrive for the rehearsal.  They leave Cindy's\n  dog in Peggy's car and walk to the church.\n\n          CINDY\n    Tell me, why does Maggie need another\n    wedding rehearsal and two days before\n    the wedding?  She's already done this.\n\n          PEGGY\n    Bob is making her visualize the\n    ceremony.\n\n              CUT TO:\n\n  INT. HALE METHODIST CHURCH - NIGHT\n\n  They are in the church proper now.  Peggy waits in a pew as Bob\n  leads Maggie and Ike up the back steps of the church.\n\n          BOB\n      (to Maggie)\n    Okay, we're ready.  Want me to have Ike\n    leave now?\n\n  Maggie turns on Ike with \"cheerful\" hostility.\n\n          MAGGIE\n    No.  No -- Actually, let's make Ike the\n    pastor.\n\n          IKE\n    I'd rather not.\n\n          MAGGIE\n      (sarcastically)\n    Come on, it'll give you a great view.\n    It's perfect.\n      (seeing Peggy)\n    Hey.\n\n  Maggie smiles at Bob.  Ike sighs and goes with it.  Bob pulls Ike\n  to the head of the aisle and places him.  Peggy follows Maggie\n  into the foyer to get ready.  Cindy sits with Ted at the organ.\n\n          BOB\n    Team effort, Pastor Ike... Cindy, ready?\n      (after no response)\n    Cindy, come on.\n\n  Cindy leaves to join the girls in the foyer.\n\n  INT. CHURCH FOYER - THAT MOMENT\n\n  Once in the privacy of the foyer, Peggy and Maggie talk.\n\n          PEGGY\n    He's going to be the pastor?\n\n          MAGGIE\n    Yep.  I want him to be front and center\n    and to watch everything.\n\n          PEGGY\n    What happened at the luau?\n\n          MAGGIE\n      (flustered)\n    ... I don't even want to talk about\n    the luau.\n      (then seeing a hanging rope)\n    What's this?\n\n          PEGGY\n    It's for the bell.\n\n  Cindy joins them.\n\n          CINDY\n    Bob's in a hurry.\n\n          PEGGY\n    Don't be nervous, Maggie.  Let us\n    visualize.  Remember what Bob said?\n    \"Be the ball.\"\n\n          CINDY\n    \"Sink the putt.\"\n\n          PEGGY\n    \"Make the shot.\"\n\n          CINDY\n    \"Nothing but net.\"\n\n          PEGGY\n    \"Never say die.\"\n\n  Maggie puts her hands up.\n\n          MAGGIE\n    Go!\n\n  Peggy and Cindy exit.  Maggie pulls the bell rope and sways back\n  and forth as she rings the bell.\n\n  INT. CHAPEL - THAT MOMENT\n\n  It is Maggie's turn to enter.  They all turn expectantly.  Too\n  much time passes.  Ted plays the organ, then stops.  Maggie\n  swings back and forth in the foyer doorway.\n\n          BOB\n    Honey, are you okay?\n\n  Maggie stops ringing the bell and pulls herself together.  She\n  walks into the aisle looking a little shaky.  She takes a few\n  tremulous steps slowly with her eyes closed, peeking\n  occasionally with one eye.\n\n          IKE\n      (taking off his jacket)\n    At this pace, it could be an evening\n    wedding.\n\n          BOB\n    Hold it!  Hold it!  I think we're\n    taking this too fast.\n\n  He begins to pace.\n\n          BOB (cont'd)\n    We need to limber you up a little.\n    You're tensing.\n      (thinks a moment;\n       to Ike, moving him\n       to groom's spot)\n    You stand here and be me so she knows\n    how far she'll have to go.\n      (then to Maggie)\n    I'm going to walk with you.\n\n  Bob goes to Maggie and walks behind her.\n\n          BOB (cont'd)\n    Visualize!  Visualize!  It's game time.\n\n  ANGLE ON:\n\n  Maggie walking.\n\n          BOB (cont'd)\n    You are the football.  You're spiraling\n    through the air towards the hands of\n    the groom.\n\n  She proceeds down the aisle.  Bob behind her.\n\n          MAGGIE\n      (eyes down)\n    Yes, I'm spiraling through the air.\n\n  ANGLE ON:\n\n  Maggie raises her eyes and sees Ike in front of her as groom.\n  Ike and Maggie lock gazes.  If they had to, they couldn't look\n  away.  All the things unspoken are now communicated -- the love,\n  the longing.\n\n          MAGGIE (cont'd)\n    I streak towards the goal line.\n\n  Maggie's pace quickens.\n\n          MAGGIE (cont'd)\n    And I land on the goal line.\n\n  ANGLE ON:\n\n  Bob beams to see Maggie's eager arrival at Ike's side.  He\n  switches off the music and proceeds like a proud coach to be the\n  pastor.\n\n          BOB\n    Okay, I'm the pastor.  Dearly beloved,\n    blah, blah, blah.  So on and so forth.\n    Ra ta ta ta.  Yabada dabada.  I now\n    pronounce you man and wife.  Kiss the\n    bride, badum dum.\n      (then moving toward Ted)\n    We have the crescendo that leads to us\n    right back down the aisle and out the...\n\n  Ike kisses Maggie.  It is a world class, Olympic kiss.  It is a\n  kiss that changes everything and can never be taken back.  It is\n  a kiss you only get once in your life.\n\n  NEW ANGLE:\n\n  Bob's smile dies.  Cindy's mouth drops open as the kiss goes on\n  and on.  Peggy loses control and screams.\n\n          BOB (cont'd)\n    Maggie!!!!?\n\n  Like a bucket of water thrown on two dogs, Ike and Maggie are\n  startled out of their kiss.  They pull apart and smile at each\n  other.\n\n  ANGLE ON:  Bob.\n\n          BOB (cont'd)\n      (furious)\n    If you were imagining me, you did great.\n      (to Ike)\n    What the hell were you doing?\n\n          IKE\n      (eyes on Maggie)\n    I'm sorry, Bob.  She kissed me back.\n\n          MAGGIE\n      (dazed but happy)\n    I kissed him back.\n\n          BOB\n    Yeah, I caught that.  Want to tell me\n    how long this has been going on?\n\n  Maggie looks at Ike, wondrous, confused.\n\n          MAGGIE\n    About a minute...?\n\n          IKE\n    A little longer for me.\n\n          MAGGIE\n    Really?\n\n          BOB\n    What do you expect me to say to this?\n\n          IKE\n    How about -- \"I hope you'll be very\n    happy together\"?\n\n  Bob hauls back and punches Ike in the face.  Ike drops.\n\n          BOB\n    I hope you'll be very happy together.\n\n  Bob storms down the aisle and out of the church.\n\n          MAGGIE\n      (to Peggy)\n    Take care of him.\n\n  Maggie leaves.\n\n              CUT TO:\n\n  EXT. CHURCH - THAT MOMENT\n\n  Bob is halfway down the walk.  Maggie appears at the church door\n  and calls after him.\n\n          MAGGIE\n    Bob, I'm sorry!\n      (half to herself)\n    At least I backed out before the\n    wedding.  That's progress!\n\n  He keeps marching.  Now Peggy appears next to Maggie.  Maggie\n  calls again.\n\n          MAGGIE (cont'd)\n    Some woman is going to make you a lot\n    happier than I ever could...\n\n  The words are barely out of her mouth when Cindy comes out the\n  door, racing after Bob at a full sprint.\n\n          MAGGIE (cont'd)\n    See?\n\n          PEGGY\n    Well, Maggie -- in the words of Mrs.\n    Pressman: \"Holy moly\".  Call me later.\n\n  Peggy goes to her car.  Cindy joins her as Bob speeds off in his\n  car.  Now Ike takes Peggy's place next to Maggie.  Maggie turns\n  to face Ike.  They are both beet red, stammering and unable to\n  look at each other, trying to act normal.\n\n          MAGGIE\n    Okay.  So... what, uh... What just\n    happened?  Just now?  Jus then?  In\n    there?\n\n          IKE\n    I don't know.  I, uh -- I frankly don't\n    even want to talk about it.\n\n          MAGGIE\n    Me, either.\n\n  Ike GRABS Maggie and BOOM -- they are all over each other,\n  kissing frantically, tongues, hands, hair, elbow, you name it.\n  Blathering fools.\n\n          IKE\n      (blathering)\n    I love you.  I love you.\n\n          MAGGIE\n      (blathering)\n    I love you, too.\n\n  They come up for air.\n\n          IKE\n    Wait.  We have to talk.  We have to do\n    some talking now.  Pull up a railing.\n\n  Maggie sits on the railing, then Ike backs up and sits on the\n  opposite railing.\n\n          IKE (cont'd)\n    You have to go down an aisle and say \"I\n    do\".  You have to get married.\n\n          MAGGIE\n    To who?  Are you asking me?\n\n          IKE\n    Me?\n\n  Ike backs up to opposite railing and sits facing Maggie.\n\n          MAGGIE\n    Yes, you!\n\n          IKE\n      (thinks)\n    Well, you do have the dress.\n\n          MAGGIE\n    And the church.\n\n          IKE\n    And the wedding date.  There's the two\n    of us.\n      (beat)\n    So, you think... maybe... You have to\n    go down the aisle with somebody you\n    love and who love you back.\n\n          MAGGIE\n    I'm okay with that.\n\n          IKE\n    So am I.\n\n          MAGGIE\n    So, we'll...\n\n  They both nod and sit there smiling, sort of. The organist, Ted,\n  closes the church door.\n\n      TED\n    Good night.\n\n  Ike pulls his tape recorder out of his pocket and quietly speaks\n  into it.\n\n          IKE\n    I'm getting married.\n\n  WIDE SHOT:\n\n  They smile at each other and remain sitting.  Then, silence.\n\n              CUT TO:\n\n  EXT. STREET/HALE/ATLANTIC HOTEL - THAT NIGHT\n\n  Ike drives up and parks in front of the hotel as he talks on his\n  cell phone.\n\n  INTERCUT WITH:\n\n  INT. FISHER AND ELLIE'S BEDROOM (NYC) - NIGHT\n\n  Ellie's on the phone.  Fisher sits nearby.\n\n          ELLIE\n    Ike's going to get married.\n\n  Fisher throws himself onto the carpet and rolls himself\n  helpless with laughter.\n\n          ELLIE (cont'd)\n      (without turning to him)\n    Fisher, if you pee on that Persian,\n    I'll kill you.\n\n              CUT TO:\n\n  INT. BEAUTY SALON - NIGHT DAY\n\n  Maggie talks to Peggy, Cindy and Grandma Julia.  Grandma Julia\n  sits under a hair dryer.  Sprout, the dog, sits in his basket.\n\n          CINDY\n    I love his eyes.  I just believe\n    they're listening to you.\n\n          PEGGY\n    His hair... any color.\n\n          GRANDMA JULIA\n    I like his tight butt.\n\n  Peggy laughs.\n\n          MAGGIE\n    Grandma!\n\n          PEGGY\n      (to Cindy)\n    See, this is a mature relationship.\n    She's really found it.\n\n              CUT TO:\n\n  LOVE MONTAGE SHOTS:\n\n  EXT. OCEAN - DAY\n\n  Ike and Maggie fishing.\n\n  INT. MAGGIE'S WORKSHOP/HOME - DAY\n\n  They play ping-pong.  They laugh, enjoying the moment.\n\n  INT. MAGGIE'S HOUSE - DAY\n\n  Ike and Maggie have fun playing cards.  The game is slapjack.\n\n  EXT. FIELD - DAY\n\n  Maggie and Ike horseback riding.  They sit on their horses\n  amongst trees, \"nuzzling\".  Ike reads as he pushes Maggie in a\n  tire swing.\n\n  INT. MAGGIE'S ROOM - DAY\n\n  Ike and Maggie open and close a Hoberman ball by holding its\n  opposite ends in their teeth.  Grandma looks in.\n\n  INT. MAGGIE'S LIVING ROOM - NIGHT\n\n  There is a fire in the fireplace.  Maggie and Ike sit as Ike\n  shows Maggie some passages from his favorite books.  He's\n  reading something from Yeats at the moment.  They seem happy.\n\n  EXT. CHURCH - THE DAY OF THE WEDDING\n\n  It is a media circus including FOUR REPORTERS, Midday with\n  Meredith and the T-shirt Vendor.  Plus three other people the\n  reporters are interviewing, a GERMAN LADY, BUTCH KENAN, a\n  farmer and Grandma Julia.  Reporter DINA NAPOLI walks down the\n  church steps.\n\n          DINA NAPOLI (OF WBAL)\n    Wedding bells are ringing for the\n    fourth time today in Hale, Maryland.\n    Maggie Carpenter, \"Always a Bride --\n    Never a Bridesmaid\", will be attempting\n    to complete her fourth wedding ceremony.\n    We'll come back on the air when the\n    results are in.  Back to you, Jessica.\n\n  Meredith, the low-end public access TV reporter, films himself\n  pointing a cheap video camera himself.\n\n          MEREDITH\n    The turnout for this morning's wedding\n    is usually reserved for royalty or\n    Hollywood stars, but Maggie Carpenter\n    is Hale, Maryland's special star and\n    the citizens of Hale are out in full\n    force today.\n\n  The NY T-shirt Vendor pitches his wares.\n\n          T-SHIRT VENDOR\n    I got \"Bye-bye Birdie\".  \"What part of\n    'I do' don't you understand?\"... Get\n    your \"Runaway Bride\" T-shirts here...\n\n  Reporter JULIE MURPHY stands near Grandma Julia and Mrs.\n  Pressman.\n\n          JULIE MURPHY (Channel 6)\n    The bride's been here for almost an\n    hour, but being around in the beginning\n    was never her problem.  We'll be here,\n    showing you the full wedding ceremony,\n    we hope.\n\n  Reporter JACKI and TIFFANY stand at the edge of the CROWD\n  reporting.\n\n          JACKI/REPORTER #3 (WBOC TV16)\n    Will she or won't she?  That is on the\n    minds of these several hundreds folks,\n    who are standing here this morning.\n    Not to mention on the mind of Groom\n    Number #4, ex-USA Today columnist, Ike\n    Graham, who is missing in action.\n\n  EXT. WINDOW OF CHURCH/INT. SUNDAY SCHOOL ROOM - DAY\n\n  INSERT window of church.  Peggy peers out the window at the\n  carnival scene.  Cindy sits with Maggie as she leans forward,\n  doubled over on a child's chair.  Peggy moves from the window to\n  sit with them.\n\n          MAGGIE\n      (moves to window)\n    He's not coming.  Watch.  He's not\n    coming.\n\n          PEGGY\n    No, no.  I saw eight geese flying in a\n    \"V\".\n\n          MAGGIE\n    You and your lucky geese.  You always\n    see geese.\n\n          PEGGY\n    Not eight...\n\n          CINDY\n    And in a \"V\".\n\n          MAGGIE\n    Eight is good... \"V\" could be Victory.\n\n  They ad lib various words starting with the letter \"V\".  Maggie\n  is nervous.\n\n          CINDY\n    Rub your ears.\n\n          PEGGY\n    Yes, rubbing your ears is very soothing.\n    Cory does that to me when I\n    hyperventilate.\n\n  Maggie rubs her ears.\n\n          CINDY\n    We do it to our dog.\n\n          MAGGIE\n    It's hurting.\n\n          CINDY\n    We'll rub.\n\n  After they rub Maggie's ears a bit:\n\n          PEGGY\n    He's here!  He's here!\n\n  They all squeeze and peer out window.  They scream in excitement.\n  Cindy rushes to Maggie's wedding dress.\n\n          CINDY\n    I'll get the dress.\n\n          MAGGIE\n    He's here!... He's here!\n\n          PEGGY\n    Now's the time for calm... If you don't\n    calm down, you won't get your dress on...\n      (reassuringly)\n    He's the one... He's the one.\n\n  Peggy moves to help Cindy with the dress.  Maggie stands alone at\n  the window a moment.  She picks up a toy horse.\n\n          MAGGIE\n    This is not a good sign.\n\n  Maggie goes over to Peggy and Cindy, and starts to get into her\n  bridal gown.  They continue to ad lib words standing with the\n  letter \"V\".\n\n          CINDY\n    We have to hurry.  The Sunday School\n    kids will be here soon.\n\n              CUT TO:\n\n  INT. IKE'S CAR - DAY\n\n  Ike pulls up slowly.  GUESTS peer through the his car window and\n  wave.  Ike rubs his headache.\n\n          JULIE MURPHY\n    Well, the groom just pulled up.  There\n    was talk of a \"now show\", but he is\n    here.\n\n          DINA NAPOLI\n    Ike Graham is here!\n\n  IKE'SPOV:\n\n  He moves as he takes it all in:  a FAMILY eats a fast food picnic\n  on a neighbor's lawn, invited GUESTS flock by in their party\n  best, and local NEWS TEAMS block the way.  The STATE SENATOR is\n  making a speech welcoming the press to Maryland.  A large GROUP\n  of reporters head up the church's stairs, hauling their\n  equipment.  They enter the flood of PEOPLE streaming inside the\n  church.  Ike snaps.\n\n  EXT. IKE'S CAR - CONTINUING\n\n  Ike stops the car where it is and jumps out, slamming the door in\n  anger.  The REPORTERS swarm around him as he gets out of the car.\n  They continue to pound him with questions as he walks to church\n  steps.  An OLDER LADY smacks him on the shoulder with a\n  newspaper.  He turns in astonishment and continues up the\n  steps.  He charges up the stairs and grabs Lee.\n\n          IKE\n    Shoot ours so she has one with an\n    ending.\n\n  Mrs. Pressman stands, shooting Ike with her video camera.\n\n          IKE (cont'd)\n      (pleading)\n    Mrs. Pressman, please.\n\n          MRS. PRESSMAN\n    It's okay.  There's no microphone.\n    You're no fun.\n\n          IKE\n    No, I'm not.\n\n  Ike retreats into the church.  Lee comes up to him again with his\n  video camera:  CHUFFA about Scorsese.\n\n  INT. CHURCH - CONTINUING\n\n  As Fisher and Ellie sign the guest book, a LOCAL LADY stares at\n  Ellie.  Ellie stares back at her until she leaves.  Ike walks\n  away from Lee and turns smack into Ellie and Fisher.  Ike puts\n  his arms around them and gives them a big hug.\n\n          IKE\n    Friends.  Thank you.  Thank you.\n\n  Over Ellie's shoulder, Ike sees Fisher's grinning face.\n\n          IKE (cont'd)\n    We are friends, aren't we, Fisher?\n\n          FISHER\n      (grinning)\n    Of course we are.  Of course.\n\n          IKE\n    Then you'll be my best man.\n\n          FISHER\n    Well, I'm good, I don't know if I'm\n    best.\n\n          IKE\n    Go talk to the pastor and he'll tell\n    you what to do.  And someone will tell\n    me what to do.\n\n          ELLIE\n    You always looked great in that suit...\n    And Ike?\n      (emotional)\n    I'm happy for you, honey.\n\n  Ellie whispers in his ear.\n\n          ELLIE (cont'd)\n    I'll have a car around the back to\n    whisk you out of here if she runs.\n\n  Ellie kisses him on the cheek and walks away.\n\n  ANGLE ON:\n\n  Bob comes up to Ike.  He looks like he's going to punch Ike, then\n  abruptly holds out a rose boutonniere.\n\n          BOB\n    You look awful.\n\n          IKE\n      (sarcastically)\n    Thank you.\n\n  Bob hands the flower to Ike.  Ike is shaking.  Bob catches this\n  and looks up to Ike.  It is a moment of clean honesty between the\n  men.\n\n          BOB\n    Ike.  Need help?\n\n  He takes the boutonniere and puts it on Ike's lapel.\n\n          BOB (cont'd)\n    I'm glad it's you.\n\n          IKE\n    Really?\n\n          BOB\n    I didn't want to find out I wasn't for\n    her in the fourth quarter.\n\n          IKE\n    Got any last minute advice?\n\n          BOB\n      (motioning to their eyes)\n    Maintain eye contact.\n\n  Bob turns and leaves, going down a side staircase.\n\n          IKE\n      (to himself)\n    Eye contact.  Eye contact.\n\n  Out of the corner of his eye, Ike sees a pictures of Christ on the\n  wall.  He leans into the picture and whispers.\n\n          IKE (cont'd)\n    Cover me.\n\n  He walks into the chapel.\n\n  INT. CHAPEL - CONTINUING\n\n  Ike steps up and stands next to Fisher.\n\n          FISHER\n      (to Ike)\n    I have no idea what I'm doing.\n\n          IKE\n    Your job is... the ring.\n      (to Fisher)\n    Do you have the ring?!\n\n          FISHER\n    I just found out I'm best man!  I'm\n    lucky I have a suit... What's wrong?\n\n  Ike gives the ring to Fisher.  The Pastor approaches Ike.  Ike\n  turns away and look out over the guests.\n\n  IKE'SPOV:  There are most of the TOWNSPEOPLE we've come to\n  know, plus some NEW YORKERS for Ike, with little ponytails.\n  Armani wire rims, Donna Karan bodysuits.  There's a lot of\n  smirking, checking out the hicks, forming their stories for\n  cocktail hour.  Elaine is in back all dressed in black, mourning\n  Ike.  Mrs. Trout approaches Ike.\n\n          MRS. TROUT\n    You should thank Lou and I for the\n    wedding car -- a '63 Buick.\n\n          IKE\n    Thank you.\n\n          MRS. TROUT\n    Oh, come on.  You're practically family.\n\n  Mrs. Trout starts picking lint off Fisher's jacket.\n\n          FISHER\n    Hello.  I'm Fisher.\n\n          MRS. TROUT\n    This doesn't want to come out.\n\n          FISHER\n    You just pull a hair from my neck.\n\n          IKE\n    Mrs. Trout, go back to your seat!\n\n  INT. CHURCH FOYER - DAY\n\n  Peggy joins Maggie, who is blowing bubblegum and swaying in\n  front of an oscillating fan.  Grandma and Walter come in.\n  Grandma gives her a kiss on the cheek.\n\n          GRANDMA JULIA\n    Good luck, Maggie.\n\n          MAGGIE\n    Thank you, Grandma.\n\n  Grandma leaves.  Walter steps up.\n\n          WALTER\n      (quietly to Maggie)\n    I'm really rooting for this one.\n\n          MAGGIE\n    Thank you, Dad.\n\n  Peggy turns off the fan.  Cindy takes the bag from Maggie.\n\n          CINDY\n    Spit.\n\n  Maggie spits her bubblegum into the bag.  Peggy hands Maggie her\n  bouquet.\n\n          PEGGY\n    Let's go.\n\n          MAGGIE\n    No sauntering down the aisle.  Just\n    make time.  Let's just get there.\n\n  Cindy and Peggy nod and leave.  The door closes.\n\n  INT. CHAPEL - CONTINUING\n\n  Both extends his hand to Elaine.\n\n          ELAINE\n    Hi, I'm Elaine from New York.\n\n          BOB\n    Hello.  I'm Bob, Maggie's fourth\n    attempt.\n\n          ELAINE\n    I'm sorry.\n\n          BOB\n    That's okay.  There's a lid for every\n    pot.  Besides, I'm comfortable with Ike.\n    I mean, Jack Dempsey lost his\n    heavyweight title to a New Yorker.\n\n            ELAINE\n    I know.  Gene Tunney.\n\n  The organ begins to play.  The organist is Ted.  Grandma, Walter,\n  Mrs. Pressman and the Trouts watch.  Mrs. Trout picks lint off of\n  her husband's jacket.\n\n  ANGLE ON:\n\n  Cindy and Peggy enter with the confident air of people who have\n  done this before.  They make it to the head of the aisle all too\n  quickly.  Peggy gives Ike a wink and an encouraging smile.\n\n  INT. CHURCH FOYER - CONTINUING\n\n  The door opens and Dennis sticks his head in.\n\n          DENNIS\n    They're ready, Maggie.\n\n          MAGGIE\n    Just a second.\n\n  Dennis closes the door behind him as he goes back into the\n  chapel.  Maggie has a moment alone.  She looks at back door as\n  possible escape route, then changes her mind.  She signals the\n  start of the wedding by knocking on the door.\n\n  INT. CHAPEL - CONTINUOUS\n\n  Immediately, Cory and Dennis open the doors for her entrance.\n  All the guests stand as Maggie enter the chapel smiling.\n\n  MAGGIE'S POV:\n\n  The aisle stretches before her into infinity.  Faces goggle at\n  her from every direction.  The tiny figure of Ike stands like a\n  beacon a long way off.\n\n  NEW ANGLE:\n\n  She plunges forward with a sped-up hesitation step.\n\n  ANGLE ON:\n\n  Ike rocks imperceptibly, urging her on.  Peggy and Cindy make\n  little \"come on\" motions.  It seems to be working.  Maggie\n  approaches rapidly.  The CROWD has turned from skepticism to\n  looks and noises of encouragement.\n\n  ANGLE ON: MAGGIE\n\n  But then her feet gradually begin to slow.\n\n  ANGLE ON:\n\n  Fisher gives a little \"darn, so close\" look.\n\n  ANGLE ON:\n\n  But Ike is too busy maintaining eye contact.  His eyes urge\n  Maggie closer -- loving her, willing her on.\n\n  CLOSE ON:\n\n  Maggie stops her walk, gives Ike a teasing smile, and then\n  resumes with her walk toward him.  His face.  Her face.  His\n  face.  Her face.\n\n  CLOSE ON:\n\n  Her foot inches forward.  The other follows.\n\n  NEW ANGLE:\n\n  A sigh now rises from the GUESTS as Maggie closes in on Ike.  He\n  smiles at her.  She smiles at him.  She is almost there... She's\n  there, smiling at Ike.  The Pastor gestures to the guests to sit\n  down.  They do.\n\n  ANGLE ON:\n\n  Ike sneezes.  She looks down and imagines she sees the carpet\n  splitting apart.  And she bolts like a bat out of hell!  In a\n  flurry of white, she is halfway down the aisle before Ike knows\n  what hits him.\n\n  ANGLE ON:\n\n  Ike stands there dazed.  For a second.  Then she springs into\n  action, charging after her.\n\n          IKE\n      (yelling out)\n    Block the doors!\n\n  Like a general, he points to Dennis and Cory in the back and\n  sends them into action.  The doors shut in Maggie's face.  But\n  she's a wild animal cornered.   She moves to the side.  The\n  TOWNSPEOPLE stand so Ike can hurry through the pew.  Ike climbs\n  on the pews towards her as GUEST crowd the aisle, blocking his\n  path.  Like a gazelle, she leaps to the side aisle and scampers\n  down and away.  Fisher gets on his cell phone.  Ike charges from\n  one of the full pews, crosses the aisle and leaps across the pews\n  near the staircase to cut her off.  He grabs her veil and it\n  comes off in his hands.  Maggie disappears down the steps of the\n  church basement.  Ike fumble with the veil and jumps over the\n  railing, landing on Dennis' toe.  He follows down the stairs\n  after her.  Mrs. Pressman and Walter exchange bet money.\n\n              CUT TO:\n\n  INT. CHURCH BASEMENT - CONTINUING\n\n  Maggie comes down steps and enters the church children's Sunday\n  school class.  A lot of KIDS And TEACHERS are doing religious\n  arts and crafts.  As Maggie runs through:\n\n          MAGGIE\n    There's a man coming down those steps\n    with lots of candy in his pockets.  If\n    you tickle him, he'll give candy.\n\n  She gives her bouquet to a little GIRL as she goes by.  Ike comes\n  down stairs.\n\n          IKE\n    Maggie!\n\n  The KIDS mob him, grabbing his pockets.  Ike fights his way\n  through KIDS.\n\n  ANGLE ON:\n\n  Maggie as she's in the church kitchen and hops on counter and\n  heads out the window.  The window is wide enough.\n\n  ANGLE ON:\n\n  Ike as he gets to the window, but Maggie is out in driveway.\n\n  EXT. CHURCH DRIVEWAY - CONTINUING\n\n  Maggie flies toward a FedEx truck at next house just leaving.\n\n  ANOTHER ANGLE:\n\n  She gathers her dress and jumps in as Ike yells from window,\n  then, quickly climbs out onto the lawn as the truck starts to\n  pull away.\n\n          IKE\n    Maggie!\n\n  Maggie looks back once, tearful and regretful, and disappears\n  inside the truck.  The truck races off.\n\n  The PHOTOGRAPHERS turn their cameras on Ike, en masse.  He is\n  enveloped by a barrage of bright lights.\n\n  Ellie and Fisher, who have also stepped outside on chapel front\n  steps, are looking around as Ike turns around the corner and\n  past the church.\n\n          ELLIE\n    Look, he's running after her.\n\n          FISHER\n    Look, he's in pretty good shape.\n\n          ELLIE\n    Poor Ike.\n\n  They look after the FedEx truck and watch Ike chasing the truck\n  down the road away from the church.\n\n          IKE\n      (running; yells)\n    Maggie!\n\n          ELLIE\n    Where do you think she's going?\n\n          FISHER\n    Wherever it is, she'll be there by ten-\n    thirty tomorrow.\n\n  Cindy, Cory, Peggy and Meredith also rush out of the church and\n  comment on Maggie's runaway.  Further down the road, Ike still\n  chases the truck, yelling:\n\n          IKE\n    Maggie!\n\n  As the truck rounds the bend in the road and disappears, Ike\n  stops and stares alone after the disappearing truck.  A swarm of\n  REPORTERS catch up to him, flashing pictures and asking\n  questions.  Another camera flashes and we cut to:\n\n  A NEWSPAPER PHOTO\n\n  Of Ike's stunned face on the cover of the USA Today.  The caption\n  reads: \"Hit and Run:  Runaway Bride Strikes again\".  And we see\n  headlines in other papers.\n\n  \"MAGGIE'S MAD DASH\"\n  \"HARDWARE HONEY GOES NUTS AND BOLTS\"\n  \"JOURNALIST WRITTEN OFF\"\n  \"BRIDE TAKES HIKE...NOT IKE\"\n  \"BRIDE TAKE RIDE\"\n  \"MAGGIE SAYS I DON'T\"\n\n  NEWSPAPER MONTAGE:\n\n  INT. NEW YORK BAR - DAY\n\n  Kevin, the bartender, reads Jay's column, in the USA Today\n  entitled \"Maggie's Mad Dash\".\n\n              CUT TO:\n\n  EXT. USA TODAY LOADING DOCK - DAY\n\n  Various newspaper WORKERS also read Jay's column in the USA\n  Today entitled \"Maggie Mad Dash\" and \"Hardware Honey Goes Nuts\n  and Bolts\" in another newspaper.\n\n  FADE IN\n\n  EXT. MAIN STREET/HALE - NIGHT (1-5 MONTHS LATER)\n\n  It's a night like any other in Hale -- the regular order of\n  things has been restored on its quaint streets.  Quartet sings\n  in front of the hotel.  LEE AND CORY CHUFFA:  About where Peggy\n  is.\n\n  INT. HARDWARE STORE - NIGHT\n\n  Maggie is sitting, end of a long day.  Peggy sticks her head in\n  entrance door.\n\n          PEGGY\n    You okay?  I'm closing.\n\n          MAGGIE\n    I'm just finishing up, too.\n\n          PEGGY\n    Want to go to Butch's for a drink or\n    something?\n\n          MAGGIE\n      (interrupting)\n    No, I'm just going to head home.\n\n          PEGGY\n    Okay.\n\n  Peggy starts to go, then moves close to Maggie.\n\n          PEGGY (cont'd)\n      (stepping closer\n       and making a \"V\"\n       with her fingers)\n    You know, I was just thinking about\n    that geese thing.  I think the \"V\" was\n    half of a \"W\".  A \"W\" for...\n\n          MAGGIE\n    What are you talking about?\n\n          PEGGY\n    Wedding.  Wedding.\n      (holding Maggie's face)\n    You just have to get the rest of your\n    ducks in a row.\n\n          MAGGIE\n    Thank you.  You still think that he\n    was....\n\n          PEGGY\n    Quick.  Very quick.\n\n  Peggy exits.  Maggie stares, losing herself in thought.  Then a\n  VOICE startles her.\n\n          VOICE\n      (whispers)\n    Marry me, Maggie.\n\n  Maggie jumps and turns to see:  DENNIS -- the kid from the high\n  school football team, popping up from a low position near the\n  counter.\n\n          MAGGIE\n      (softly)\n    Hi, Dennis.\n\n          DENNIS\n    I am going to propose, you know.  I\n    mean, the right way.  Soon as I turn\n    eighteen.\n\n          MAGGIE\n    You're sweet, Dennis.  But you've got\n    to go.  I'm closing up.  Here's a candy\n    bar and one for your brother.\n\n  Dennis takes the candy and starts to go.\n\n          DENNIS\n    I'm not giving up.   A person shouldn't\n    give up.\n\n  Dennis exits.  Maggie is alone.  She turns out the lamp she\n  designed, then on again.  She turns off the other lamp on the\n  counter and exits.  We hold on Maggie's designed lamp.\n\n              CUT TO:\n\n  INT. IKE'S HALLWAY AND APARTMENT - NIGHT\n\n  Ike walks up to his door, carrying his mail and a bag of\n  carryout.  He opens the door and walks into his apartment.  He\n  pets Italics, who sits on his sofa bed.  Without taking off his\n  coat, he goes to his keyboard and plays music as he CHUFFAS to\n  his cat about marriage and divorce.\n\n              CUT TO:\n\n  INT. MAGGIE'S HOUSE - DAY\n\n  Dad and Grandma Julia are there.  Grandma is making lunch.\n  Walter is juggling oranges.  There's glass of beer on the\n  kitchen counter.\n\n          WALTER\n    That's Maggie.  Home for lunch.\n\n          GRANDMA JULIA\n    She's been doing this since the last\n    wedding.  I don't think it's good.\n\n  Maggie walks in and kisses Grandma on the cheek.\n\n          MAGGIE\n    Hey.  Grandma, what's for lunch?\n\n          GRANDMA JULIA\n    Turkey and cheese.\n\n          WALTER\n    Honey, your grandmother and I were\n    thinking about opening a wedding gift\n    museum.\n\n  Walter laughs.\n\n          MAGGIE\n    STOP!\n\n  Walter looks at his daughter in surprise.  He's never heard a\n  tone like this in her voice before.\n\n          WALTER\n    What?\n\n          MAGGIE\n      (quiet fury)\n    Just stop it.  Don't say another word\n    like that.\n\n          WALTER\n      (putting down the oranges)\n    Maggie, it's just a joke...\n\n          MAGGIE\n    No.  It's my life.\n\n          WALTER\n    A harmless joke.\n\n          MAGGIE\n    No, it's humiliating and you've been\n    doing it since I was a kid.  I don't\n    like it.  Stop.  You may not like\n    having a daughter with problems.  But\n    guess what?  I don't like having a\n    father who's drunk all the time.  I'll\n    eat in my room.\n\n  Maggie takes a plate and exits.\n\n          GRANDMA JULIA\n    That needed to be said.  You know --\n    you're always making jokes about her,\n    so they won't make jokes about your\n    drinking.\n\n  Walter reacts.\n\n              CUT TO:\n\n  INT. IKE'S APARTMENT - DAY\n\n  Ike goes out on his terrace.  He bounces a basketball.  It\n  doesn't bounce.  He sits on the steps of the patio an stares.\n\n              CUT TO:\n\n  INT. MAGGIE'S WORKROOM/GYM - DAY\n\n  Maggie is kickboxing.\n\n              CUT TO:\n\n  INT. MAGGIE'S WORKROOM/GYM - ANOTHER DAY\n\n  Maggie is a bit melancholy as she works on her lamps.\n\n              CUT TO:\n\n  INT. IKE'S APARTMENT - ANOTHER DAY\n\n  Ike quietly sits in bed writing and staring into space thinking.\n  His cat sits on the windowsill.\n\n              CUT TO:\n\n  INT. MAGGIE'S WORKROOM/GYM - NIGHT\n\n  Maggie jumps rope barefooted late at night.\n\n          MAGGIE\n    I need a plan... A plan to life... What\n    would Bruce Lee do?  He'd kick some\n    ass...\n\n              CUT TO:\n\n  INT. MAGGIE'S KITCHEN - DAY\n\n  Maggie in front of plates full of all sorts of types of eggs --\n  scrambled, poached, sunny-side up, Benedict, soft boiled, etc\n  -- sits on the kitchen counter.  She ties them all.\n\n  EXT. NEW YORK STREET - DAY\n\n  Establishing shot.  Two MEN try to fix the engine of a taxi\n  outside the restaurant.\n\n              CUT TO:\n\n  EXT. NEW YORK STREET - DUSK\n\n  Eke walks by the T-shirt Vendor, goes into a subway station.\n\n  EXT. ANOTHER STREET - DUSK\n\n  Ike crosses a busy street where a MAN is being arrested.  Ike is\n  passing the upscale \"Millennium Hardware Store\".  He glances at\n  the window, looks away, stops and looks again.  The window\n  display is made up of an assortment of Maggie's lamps.  Logo\n  \"MAG\" is on them.  He smiles and walks on.\n\n  EXT. CENTRAL PARK RESERVOIR - DUSK\n\n  Ike stares out at water as he walks.\n\n  EXT. IKE'S APARTMENT BUILDING - NIGHT\n\n  Ike walks along sidewalk, crosses street, enters his building.\n\n  INT. IKE'S APARTMENT - NIGHT\n\n  Ike opens the door to his apartment and flicks on the lights.  He\n  crosses to hang his coat in the closet.  In the closet mirror, he\n  sees and is stunned to find:  MAGGIE, sitting on the couch\n  holding Italics, the cat.\n\n          MAGGIE\n    Hello, Ike.\n\n  He closes the closet and crosses to his desk.\n\n          IKE\n    Don't tell me.  My doorman is one of\n    your many admires... I knew I should\n    have given him a better Christmas gift.\n\n  Maggie smiles tenuously.  She's more than a little terrified.\n\n          MAGGIE\n    I've been making friends with your cat.\n      (then)\n    Is it okay that I'm here?\n\n          IKE\n    I don't have much choice in the matter\n    now, do I?  But I can't speak for\n    Italics.\n      (to Cat)\n    Traitor!\n\n  He moves to the kitchen.\n\n          MAGGIE\n    I don't blame you for being mad...\n\n  Ike looks at her.  Apparently the word \"mad\" is an understatement.\n\n          MAGGIE (cont'd)\n    ... Or... furious.\n\n  Ike looks at her again.\n\n          MAGGIE (cont'd)\n    ... Irate?  Livid?  How's that?\n\n  He starts putting cat food in a bowl.  The cat leaves Maggie's\n  side and starts to east.\n\n          IKE\n    Livid is good.  So what is it, Maggie?\n    You here on business?  I saw your lamps.\n    They're terrific.\n\n          MAGGIE\n    It's something I've always wanted to do.\n\n  Ike leaves the kitchen, turns on the balcony lights and re-enters\n  the living room from the balcony.\n\n          IKE\n    You actually could make breaking and\n    entering into a new career.\n      (after opening\n       the glass doors)\n    So, what are you doing here?\n\n          MAGGIE\n    I wanted to talk to you about why I run\n    or ride away from things.\n\n  Ike moves away from her and sits on the steps near the balcony\n  window, listening.\n\n          IKE\n      (after sitting)\n    Does it matter?\n\n          MAGGIE\n    I think so... When I was walking down\n    the aisle?  I was  walking toward\n    somebody who didn't have any idea who I\n    really was.  And it was only half the\n    other person's fault, because I had\n    done everything to convince him that I\n    was exactly what he wanted.  So it was\n    good that I didn't go through with it\n    because it would have been a lie, but\n    you -- you knew the real me.\n\n          IKE\n    Yes, I did.\n\n          MAGGIE\n    I didn't.  And you being the one at the\n    end of the aisle didn't just fix that.\n\n  Ike takes this in.  She's reaching him -- but then the defenses\n  go back up.  He turns to her.\n\n          IKE\n    No, I couldn't fix anything...\n      (as he gets up)\n    But I still ended up chasing a truck.\n\n  Ike moves out to the balcony.  After a moment, Maggie follows him.\n\n  EXT. BALCONY/IKE'SAPARTMENT - NIGHT\n\n  The balcony overlooks Central Park.  The twinkling lights of the\n  city stretch out across the beautiful night.  Ike looks out at\n  the view with his back to Maggie as she speaks.\n\n          MAGGIE\n    I understand why you bring up the truck.\n    Let me explain something.  The fact is,\n    you've seen me at my worst, most\n    embarrassing, deviously plotting,\n    potentially but not certifiably,\n    psychotic state.  And if you liked me\n    then, I mean, now... I can't imagine...\n      (crosses to him)\n    Benedict.\n\n  Ike has no response.\n\n          MAGGIE (cont'd)\n    I love eggs Benedict.  I hate all the\n    other kinds.\n\n  She hesitates.\n\n          MAGGIE (cont'd)\n    ... I hate big weddings with everybody\n    staring.  I would like to get married\n    on a weekday while everybody is at work.\n    If I ride off into the sunset, I want\n    my own horse.\n\n          IKE\n    Should I be writing this down?\n\n  She returns to the balcony and hands him the box.\n\n          IKE (cont'd)\n    What's this?\n\n          MAGGIE\n    These are for you.\n\n  He opens it.  It's her running shoes.\n\n          IKE\n    Used?\n\n          MAGGIE\n    They're mine.  I'm turning in my\n    running shoes to you.\n\n          IKE\n    This is getting serious.\n\n  Now she is glowing at him, shining with the full force of her.\n\n          MAGGIE\n    And one more thing.  I know it's hard\n    to believe there could be more.  Um...\n\n  Maggie glances around and spots a DECK CHAIR, which she turns so\n  it is facing the city lights.  Then she softly says:\n\n          MAGGIE (cont'd)\n    If you could have a seat, please.\n\n  Ike sits.  Maggie takes the box from him and puts it aide.  And\n  then she gets down on one knee.\n\n          IKE\n      (laughing)\n    Oh my God.  No.\n\n  Maggie smiles up at him.  Ike tips his head back and covers his\n  eyes with his hand.\n\n          MAGGIE\n    No, no -- don't hide your face, this\n    only happens once in a lifetime.  It's\n    definitely a first to me, and you're\n    not going to want to miss it.\n\n  He smiles as he looks at Maggie.\n\n          MAGGIE (cont'd)\n    I love you, Homer Eisenhower Graham.\n    Will you marry me?\n\n  Ike swallows, overwhelmed, overjoyed, and scared shitless.\n\n          IKE\n    Maggie, I gotta think about this a\n    little bit.\n\n  Maggie hops cheerfully back to her feet.\n\n          MAGGIE\n      (cheerful)\n    Good.\n\n  She gets off her knees and stands.\n\n          MAGGIE (cont'd)\n    I was hoping you'd say that.\n\n          IKE\n      (laughing)\n    You were not.\n\n          MAGGIE\n    I was, because if you said \"yes\" right\n    away, I wouldn't get to say this next\n    part.  And I've been practicing it.\n      (pulling up a chair\n       and sitting)\n    Ready?\n\n          IKE\n    I'm listening.\n\n          MAGGIE\n      (tenderly)\n    \"I guarantee that we'll have tough\n    times.  I guarantee  that at some point\n    one or both oof us will want to get out.\n    But I also guarantee that if I don't\n    ask you to be mine, I'll regret it for\n    the rest of my life. Because I know in\n    my heart -- you're the only one for me\".\n\n  Ike takes her hands affectionately.\n\n          IKE\n    Pretty good speech, Maggie.\n\n          MAGGIE\n    I borrowed it from this guy I know.\n    So?\n\n  Ike looks into Maggie's shining face and pauses.  He gets up and\n  motions with his hand for her to stay seated.  He goes inside and\n  turns on some music.  The cat is sitting by the radio.  He\n  returns to the balcony and takes Maggie's hand.\n\n          IKE\n    Dance with me.\n\n  They start to dance a slow dance.\n\n              DISSOLVE TO:\n\n  EXT. LARGE GREEN FIELD - DAY\n\n  We see a hill and on top of it is a Pastor marrying Maggie and\n  Ike, in beautiful wedding attire.  We see Maggie walk down a\n  leaf-lined aisle to a waiting Ike.  They kiss as we hear the vows\n  and hear them each say \"I do\".  They kiss a twirling, whirling\n  kiss, a circular kiss.  We hear the applause of about twenty\n  people.  Slowly, we see the twenty people come over the crest of\n  the hill.  They are all Maggie's family and friends, plus the\n  old grooms.  They are all paired in twos, like a love Noah's ark.\n  We see others get the news.\n\n  INT. CHURCH - DAY\n\n  Priest Brian hears about Maggie's wedding.\n\n  INT. BAKERY - DAY\n\n  Mrs. Trout hears about Maggie's wedding.\n\n  INT. NEW YORK BAR - DAY\n\n  George, Groom #3, hears about Maggie's wedding.\n\n  INT. ELLIE'S OFFICE OR APARTMENT - DAY\n\n  Ellie and Fisher hear about Maggie's wedding.\n\n  EXT. FIELD - DAY\n\n  ANOTHER ANGLE:\n\n  Maggie and Ike finally break the kiss.  Ike takes her hand and\n  walks her to two horses.  Ike and Maggie, on the two horses, ride\n  off happily in their wedding clothes.  As the group cheers,\n  Maggie throws bouquet.  We see it float in the air.\n\n              FADE TO BLACK.\n\n      THE END\n\n  --------------------------------------------------------------\n\n\n\n\nRunaway Bride\nWriters :   Josann McGibbon  Sara Parriott\nGenres :   Comedy  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:34:25.612779"}