{"title": "Rush Hour", "film_link": "/Movie Scripts/Rush Hour Script.html", "script_link": "/scripts/Rush-Hour.html", "info_raw": "\n\nRush Hour Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (5.50 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Ross LaManna  Jim Kouf\nGenres  Action  Comedy  Crime\n\nRead \"Rush Hour\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>\n<b>/*\n</b>Break-out-of-frames script\nBy Website Abstraction (http://wsabstract.com)\nOver 400+ free scripts here!\nAbove notice MUST stay entact for use\n<b>*/\n</b>\nif (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nRush Hour\n\n\n\n\t\t\t\tRUSH HOUR\n\n\t\t\tOriginal Screenplay\n\n\t\t\t\t  by\n\n\t\t\t\tRoss LaManna\nFADE IN:\n\nEXT.  LOS ANGELES - DAY\n\nThe whole dysfunctional megalopolis, beige and blurry in the\nsummer smog. If this is the American Dream, do me a favor and\nwake me up.\n\nEXT.  LAX - DAY\n\nThe traffic loop outside the terminals is gridlocked -- mostly\nwith stretch limousines.\n\nINT.  LAX - (INCLUDE NEWS REPORT MONTAGE) - DAY\n\nInside, the airport is done up with festive posters, streamers\nand banners: Welcome - Pacific Partners Summit\n\nA planeload of cheerful CHINESE DELEGATES come into the\ncrowded terminal. Some sport red T-shirts with a picture of\nMao wearing Mickey Mouse ears.\n\nThey get onto the people mover, passing by a TV REPORTER:\n\n\t\t\t\tREPORTER\n\t\t\t(to TV CAMERA)\n\t\tEager to mend its tarnished image,\n\t\tLos Angeles has really put out the\n\t\twelcome mat for tomorrow's summit.\n\t\tThe city promises quite a party as\n\t\tleaders from Japan, China, South\n\t\tKorea, Australia, the U.S. and\n\t\tothers begin talks for the largest\n\t\tfree-trade treaty in history.\n\nThe SCENE changes to TAPE of DELEGATES from other countries\narriving.\n\nThen, we see massive SECURITY PREPARATIONS all around the city.\n\n\t\t\t\tREPORTER (VO)\n\t\t\t(continuing)\n\t\tThe one sour note is North Korea,\n\t\tthe only Pacific Rim country not\n\t\tparticipating. There are rumors of\n\t\tsecret meetings with North Korean\n\t\trepresentatives, but U.S. officials\n\t\tinsist the North must first hold\n\t\tdemocratic elections, and halt its\n\t\tnuclear weapons program -- as they\n\t\tclaimed to have done back in 1995.\n\nWe CUT TO a heated debate in the UN SECURITY COUNCIL.\n\nThen ARTILLERY FIRE over the Korean DMZ.\n\nThe SCENE returns to LAX.\n\n\t\t\t\tREPORTER (VO)\n\t\t\t(continuing)\n\t\tTensions remain high since last\n\t\tyear's skirmishes between North Korea\n\t\tand the U.S. So any chance of the\n\t\tcommunist North joining the Pacific\n\t\tPartners seems highly unlikely.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT.  FREMONT PLACE - DAY\n\nAn exclusive, walled-off section of Hancock Park. There's only\none route in and out, past a manned guardhouse on Wilshire.\n\nEXT.  NORTH KOREAN CONSULATE - DAY\n\nA Colonial-style mansion, surrounded by an imposing, wrought-\niron fence. There is a bronze plaque, in English and Korean,\nnext to the entranceway:\n     \n\t\t\t\tConsulate\n\t\t\t\t of the\n\t\tDemocratic People's Republic of Korea\n\nThe driveway gate opens and a long, black Mercedes with tinted\nwindows and diplomatic license plates glides out.\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nAn alert North Korean CORPORAL watches the perimeter MONITORS.\nHe pushes a switch to close the gate behind the Mercedes.\n\nEXT.  UTILITY POLE - OLYMPIC BLVD - DAY\n\nFrom atop a pole outside the south wall, a man with binoculars\noverlooks the private streets of Fremont Place.\n\nHIS POV - THROUGH BINOCULARS\n\nas the Mercedes cruises through the quiet neighborhood.\n\nBACK TO SCENE\n\nThe man, PAUL JAVAL, is thirtyish, nervous; with short, sandy\nhair. He takes the binoculars away from his face and we see\nhis eyes -- they're a strange, unnaturally light gray.\n\nJaval takes an ORANGE PILL from an unlabeled prescription\nbottle and pops it into his mouth. He climbs down the pole to\na van with a phone company logo on it.\n\n\n\nEXT.  WILSHIRE BLVD - DAY\n\nThe Mercedes comes out of the Fremont Place gate, and turns\ninto the heavy morning traffic.\n\nINT.  MERCEDES - (MOVING SHOT) - DAY\n\nIt is extremely quiet, due to inch-thick glass on the windows\nand 4,000 pounds of armor plating on the car's chassis.\n\nThe DRIVER is a North Korean Army Major. On the seat beside\nhim is an AMD-74, a 5.45x39mm-caliber machine gun.\n\nA HAND from the back seat darts between the front seats and\nturns on the RADIO to a ROCK station. The Driver turns it off.\n\nNEW ANGLE\n\nThe hand belongs to 10-year-old SAM KE HAN. Sam sits back and\nsighs to his sister, JOY (15). Between them sits a middle-aged\nScandinavian GOVERNESS.\n\n\t\t\t\tSAM\n\t\tI can't stand it -- half an hour to\n\t\tget to the stupid school every\n\t\tmorning... with no music...\n\t\t\t(Korean; subtitled)\n\t\t[Just our damn Nanny...]\n\nEXT.  CRENSHAW BLVD - DAY\n\nJaval's van, also with tinted windows, turns onto Crenshaw. It\nfollows the Mercedes, several cars behind it.\n\nINT.  JAVAL'S VAN - (MOVING SHOT) - DAY\n\nJaval, wired, drums on the steering wheel while driving. He\nglances at some expertly constructed, radio-control REMOTE\nUNITS sitting on the seat next to him.\n\nEXT.  SANTA MONICA FREEWAY - DAY\n\nTraffic is moving at about 35 MPH. The Mercedes merges onto\nthe freeway, heading west. Javal's van follows.\n\nThe thumping of a RAP SONG rattles the other drivers' fillings\nas a LOWRIDER with its stereo turned up to \"11\" cruises by.\n\nINT.  MERCEDES - (MOVING SHOT) - DAY\n\nEven 500 watts of bass cannot penetrate the armored silence.\nThe Driver scans the road, wary but sensing no danger. He puts\non his blinker to take the 405 South exit.\n\n\n\nEXT.  SANTA MONICA FREEWAY - DAY\n\nThe van follows, now directly behind the Mercedes, in a\nprocession of vehicles going up the long, curved overpass\narcing 100 feet above the 10, toward the 405.\n\nINT.  JAVAL'S VAN - (MOVING SHOT) - DAY\n\nAs they approach the crest of the overpass, Javal flips a\nswitch on his radio-control unit...\n\nCLOSE - ROAD SURFACE OF OVERPASS\n\nSix small SEMICIRCLES, exact replicas of the stay-alert bumps\non the white lines of the overpass, EXPLODE. They spew hundreds\nof sharp, triangular nails across the roadway. Immediately,\nscores of tires on passing cars BLOW OUT...\n\nWIDER\n\nCausing, 50 yards ahead of the Mercedes and van, the most\nhellacious, gut-wrenching, piss-your-pants, chain-reaction\nPILE-UP you can imagine.\n\nDozens of drivers LOSE CONTROL of their vehicles... sideswipe\ntheir neighbors... grind against the guard rails. Some\nfishtail into 180's, smashing headlong into the traffic still\ncoming onto the overpass.\n\nBrakes squeal, people scream, metal crumples, airbags deploy,\nglass shatters.\n\nAnd then it gets really nasty...\n\nA Honda gets jammed under a truck hauling cinder blocks. The\ntruck JACKKNIFES, tipping over like a drunken giant.\n\nIt SMASHES through the concrete wall and guard rail...\n\nAlong with several cars and their SCREAMING OCCUPANTS, swept\nover the edge by the truck like discarded soda cans.\n\nThey plummet through space, CRASHING onto the freeway below.\n\nINT.  MERCEDES - (MOVING SHOT) - DAY\n\nSam, Joy, and the Governess brace themselves as the Driver\nslams on the brakes. He barely avoids hitting anything.\n\n\t\t\t\tDRIVER\n\t\t\t(Korean)\n\t\t[Stay in the car.]\n\n\n\nEXT.  FREEWAY OVERPASS - DAY\n\nA nightmare scene of smoke, twisted wrecks, dazed victims. The\nMercedes and van sit motionless in the backed-up traffic.\n\nINT./EXT.  JAVAL'S VAN & ROADWAY - DAY\n\nJaval slides open a TRAP DOOR on the floor of the van. He\nslips a wheeled, mechanic's repair platform through it.\n\nANGLE WITH JAVAL\n\nas, unnoticed amid the chaos, he lies on the platform and\nrolls under the Mercedes.\n\nThe undercarriage of the Mercedes is armored with steel. Javal\nstops at a patch of perforations -- an air exchange vent. He\nattaches a slim DEVICE over the vent, flips a switch on it,\nthen rolls back toward the van.\n\nINT.  MERCEDES - DAY\n\nOblivious to Javal's actions below them, everyone watches as\npolice and news helicopters circle above. Then, some CHP\nmotorcycles straddle the lanes and zoom by.\n\nINT.  JAVAL'S VAN - DAY\n\nSweating, Javal sits back in the driver's seat and checks\nanother radio unit. Working.\n\nEXT.  FREEWAY OVERPASS - DAY\n\nThe CHP has cleared a path through the devastation, and\ntraffic trickles through. As the Mercedes and the van pass by,\nJaval looks proudly at the misery he's wrought. He follows the\nMercedes onto the 405 south.\n\nINT.  JAVAL'S VAN - (MOVING SHOT) - DAY\n\nJaval drives behind the Mercedes, with one hand on the radio\nunit. The Mercedes signals to take the Venice exit.\n\nJaval fingers the radio unit, itching to use it...\n\nBut he PASSES by the Mercedes as it gets off the freeway.\n\nINSERT ANGLE - UNDER THE MERCEDES\n\nJaval's device is armed, and waiting...\n\n\t\t\t\t\t\t\tFADE TO:\n\n\n\nEXT.  SIERRA BONITA AVENUE - CARSON'S HOUSE - NIGHT\n\nA pretty street in the Miracle Mile, lined with neat, single-\nfamily homes. Timed SPRINKLER systems water some of the yards.\n\nEvery house on the block except the one we're in front of has\na \"For Sale\" sign on the lawn. From the weathered looks of the\nsigns, they've been there for quite a while.\n\nINT.  CARSON'S HOUSE - BEDROOM - NIGHT\n\nIt's a hot night. The ceiling fan above the bed spins slowly.\n\nPETE CARSON tosses restlessly in bed, the sheets half-covering\nhim. Next to him his wife, MIRANDA KNOLL, snores contentedly.\n\nCarson is in his late thirties, outdoorsy, with a tight,\nmuscular build. Emotionally he's tightly-wound as well.\n\nMiranda is 35, raven-haired, sensible, pretty. She believes\nabove all else that one should never raise one's voice.\n\nCarson groans... he's DREAMING...\n\n\t\t\t\t\t\t\tCUT TO:\n\nEXT.  BEVERLY DRIVE - (CARSON'S DREAM) - DAY\n\nQuick, SILENT IMAGES: A street cordoned off with police tape.\nCops, SWAT teams, FBI surround BEVERLY THRIFT, a bank.\n\nCarson, younger, hair shorter, sits in an FBI COMMAND TRUCK\nacross from the bank. Covering the mouthpiece of the phone in\nhis hand, he's arguing with the OTHER AGENTS in the truck.\n\nSuddenly, a huge, fiery EXPLOSION blows out the front of the\nbank building. Horrified, Carson runs toward it...\n\n\t\t\t\t\t\t\tCUT TO:\n\nINT.  CARSON'S HOUSE - BEDROOM AND HALLWAY - NIGHT\n\nCarson is snapped awake by a CAR ALARM going off outside.\n\n\t\t\t\tCARSON\n\t\tSon of a bitch!\n\nHe bolts out of bed, wearing nothing but a pair of striped\nbikini briefs. Miranda rolls over, sleepy, unconcerned...\n\n\t\t\t\tMIRANDA\n\t\tPete... please... we have to be up\n\t\tearly tomorrow. Call the police.\n\n\n\n\t\t\t\tCARSON\n\t\tYeah, right.\n\nHe races down the hall -- right past the house alarm keypad,\nits LCD reading \"ARMED.\"\n\nHe grabs an aluminum baseball bat from the umbrella stand.\nForgetting to disarm the house alarm, he yanks the front door\nopen. The house alarm begins SHRIEKING.\n\n\t\t\t\tCARSON\n\t\t\t(continuing)\n\t\tShit!\n\nMIRANDA\n\npulls the pillows over her head and sighs.\n\n\t\t\t\tMIRANDA\n\t\tNot again...\n\nEXT.  CARSON'S HOUSE - NIGHT\n\nCarson comes around to the driveway, which is illuminated by\nthe streetlight --\n\nWhere two 20-ish ASSHOLES are sitting in his 1965 Mustang\nconvertible, their presence courtesy of a huge cut they've\nmade in the otherwise-perfect ragtop.\n\nCar-theft tools in a leather case between them, they're prying\nthe ignition switch out of the dashboard.\n\nAsshole #1 spots Carson. He gets out of the car, wielding a\ncrowbar. His partner keeps working.\n\nNEW ANGLE\n\nAsshole #1 lunges viciously, swiping at Carson with the\ncrowbar, taking a piece out of his side. Carson starts\nBLEEDING profusely, but he's too pissed to notice.\n\nCarson uses his bat to take the offensive. They go at each\nother like combatants in a swordfight, the CLANKING of metal\nechoing through the neighborhood along with the screaming\nhouse and car ALARMS, and frantic neighborhood DOGS.\n\nSurprised at Carson's fury and strength, Asshole #1 backs onto\nthe lawn, oblivious to the running SPRINKLERS.\n\nAs he backs away, his shoe catches on one of the sprinkler\nheads. It breaks off, and a huge GEYSER of water sprays out.\n\nCarson holds his bat in both hands and jams the front of it\ninto Asshole #1's breadbasket. He doubles over.\n\nCarson grabs Asshole #1's arm, and pulls it quickly against\nhis raised knee. There is a SNAP and a loud howl as the arm\nbreaks, and Carson tosses him aside.\n\nSeeing this, Asshole #2 gives up on the car. He takes off\ntoward the street. Carson runs to head him off, but he's a lot\nfaster in his Air Jordans than Carson is in his bare feet.\n\nWIDER\n\nCarson grabs the metal lid from a garbage can at the curb and\nFLINGS it like a huge Frisbee. It sails across the street --\n\nAnd NAILS Asshole #2's head. He kisses the pavement, stunned.\n\nCarson runs up and grabs him, but he pulls out a long, sharp\nscrewdriver and jabs at Carson with it.\n\nThen, blue flashing lights appear from around the corner: A\nWESTEC Chevy Blazer. Two uniformed GUARDS get out, and fumble\nwith their sidearms.\n\n\t\t\t\tWESTEC GUARD\n\t\tEverybody... chill! Bikini boy! On\n\t\tthe ground!\n\nAsshole #2 is still trying to gouge Carson with the\nscrewdriver. Carson glares at the dopey Guards.\n\n\t\t\t\tCARSON\n\t\tAsshole was trying to boost my car!\n\nANGLE ACROSS STREET\n\nCarson's fiftyish, black, next-door NEIGHBOR, wearing pajamas\nand a robe, comes out of his house. Carson sees him.\n\n\t\t\t\tCARSON\n\t\tMike -- call 911!\n\n\t\t\t\tNEIGHBOR\n\t\tBeen trying...\n\t\t\t(has a cordless phone)\n\t\tIt's busy.\n\t\t\t(to Guards; re Carson)\n\t\tHe's the good guy, you schumcks.\n\nThe Guards seem to get it. Without warning, one takes out a\nTASER and ZAPS Asshole #2. Carson lets go just in time.\n\nCLOSER\n\nHolding his bleeding side, Carson walks back to his house. He\nnotices the \"Neighborhood Watch\" sign has graffiti spray-\npainted on it. He touches it -- the paint is still wet. His\nNeighbor shrugs -- whatta ya gonna do?\n\nThe PAPER GUY drives by... and tosses Carson's newspaper right\nunder the gushing SPRINKLER.\n\n\t\t\t\tCARSON\n\t\tI hate this fuckin' town.\n\nEXT.  NORTH KOREAN CONSULATE - ESTABLISHING - DAY\n\nINT.  NORTH KOREAN CONSULATE - UPSTAIRS BATHROOM - DAY\n\nJoy is standing on the toilet, blowing cigarette smoke into\nthe exhaust fan. Someone KNOCKS on the door. She flicks the\ncigarette into the toilet, puts a ZIPPO LIGHTER in her pocket.\n\nINT.  NORTH KOREAN CONSULATE - HALLWAY - DAY\n\nJoy opens the bathroom door. Sam is standing there, grinning.\n\n\t\t\t\tJOY\n\t\tThere are six bathrooms in this\n\t\thouse, Sam.\n\n\t\t\t\tSAM\n\t\t\t(fanning the air)\n\t\tBut only one with a smoking section.\n\nShe quickly closes the door behind her. Sam laughs.\n\nINT.  NORTH KOREAN CONSULATE - DINING ROOM - DAY\n\nSam and Joy sit at the table. AMBASSADOR HAN and MRS. HAN are\nhaving breakfast: radish soup, kimchi and grilled fish.\n\nAmbassador Han reads through the morning's faxed communiquÈs.\nHe's 43, rarely smiles, and hates living in the U.S. He's\ndressed in an impeccably-tailored, Valentino two-piece suit.\n\nMrs. Han is slender, soft-spoken, but as iron-willed as her\nhusband. She, however, is quick to smile. She's wearing a\nsummery dress with a white sweater over her shoulders.\n\nAmbassador Han pulls the front of Sam's shirt to reveal the\n\"Nirvana\" logo on his T-shirt.\n\n\t\t\t\tAMBASSADOR HAN\n\t\t\t(Korean)\n\t\t[Go change.]\n\nAmbassador Han's X-ray stare turns to Joy.\n\n\t\t\t\tAMBASSADOR HAN\n\t\t\t(continuing)\n\t\t[You smell like a fireplace.]\n\nA BUTLER appears with a phone. He WHISPERS to Mrs. Han.\n\n\t\t\t\tMRS. HAN\n\t\tIt's the Governess...\n\t\t\t(into phone)\n\t\tHello, Hilda...\n\nCUTAWAY - CLOSE ON GOVERNESS\n\nas she speaks into a cellular phone. She's extremely nervous.\nWe cannot see her surroundings.\n\n\t\t\t\tGOVERNESS\n\t\t\t(thru phone)\n\t\tMrs. Han... I am very sick today...\n\nINT.  NORTH KOREAN CONSULATE - DINING ROOM - DAY\n\n\t\t\t\tMRS. HAN\n\t\t\t(into phone)\n\t\tWe will see you next week...\n\t\t\t(hangs up; smiles to kids)\n\t\tIt appears I'll be taking you to\n\t\tschool.\n\nINT.  JAVAL'S VAN - DAY\n\nIn the back of his van, Javal pats the Governess' hand.\n\n\t\t\t\tJAVAL\n\t\tVery good. You may go now...\n\nHe speaks with a slight accent, French, perhaps. He pops an\norange pill, then unlatches the rear doors of the van. With a\nquick glance back at him, she goes to open the doors.\n\nJaval grabs a plastic tarp and throws it over the Governess'\nupper body. He puts his arm across her neck, flicks open a\ngravity knife and PLUNGES it through the tarp, into her chest.\n\nHe drops her on the floor of the van and fastidiously wipes a\nsmall smudge of blood from his hand with a handkerchief.\n\nINT.  CARSON'S HOUSE - BATHROOM AND BEDROOM - DAY\n\nCarson steps out of the shower. He looks exhausted. Toweling\noff, he goes into the bedroom, where Miranda is riding an\nexercise bike, listening to music on headphones and reading\nthe sprinkler-soaked newspaper, all while watching the TV.\n\nANGLE ON TV\n\nA perky blonde traffic reporter, BOBBI MARCHFELDER, talks to\nus from a local NEWS COPTER.\n\n\n\n\t\t\t\tBOBBI\n\t\t\t(on TV)\n\t\t...Good morning, Summit Day! It's\n\t\tgonna be the Super Bowl, the 4th of\n\t\tJuly, the Olympics and Woodstock all\n\t\trolled into one! All over town\n\t\tthere'll be parades, concerts,\n\t\trallies, festivals... So get out\n\t\tthere everyone, but plan your drive-\n\t\ttime accordingly! This is Bobbi\n\t\tMarchfelder, your Eye in the Sky...\n\nWe CUT TO the White House lawn, where the PRESIDENT is about\nto board a helicopter.\n\n\t\t\t\tMORNING ANCHOR (VO)\n\t\t\t(on TV)\n\t\tThe President is on his way...\n\n\t\t\t\tPRESIDENT\n\t\t\t(on TV)\n\t\t...It's an honor hosting my fellow\n\t\tleaders in Los Angeles, the capitol\n\t\tcity of the Pacific Rim...\n\nWe CUT BACK to the studio and the MORNING ANCHOR.\n\n\t\t\t\tMORNING ANCHOR\n\t\t\t(on TV)\n\t\tWe'll see the menu for Mayor\n\t\tSimpson's Brentwood barbecue, right\n\t\tafter this...\n\nWe CUT TO a MUSICAL MONTAGE of preparations for the events\naround town.\n\nBACK TO SCENE\n\nAs the MUSIC swells, Carson turns the TV off.\n\n\t\t\t\tMIRANDA\n\t\tI was watching that.\n\n\t\t\t\tCARSON\n\t\tIf I hear one more Beach Boys song,\n\t\tI'll shoot myself.\n\nMiranda points at the headphones -- she can't hear him.\n\n\t\t\t\tCARSON\n\t\t\t(continuing; while smiling)\n\t\tI said, if we were having sex once in\n\t\ta while, you wouldn't need to ride\n\t\tthat fucking bike every morning.\n\n\n\n\t\t\t\tMIRANDA\n\t\t\t(hasn't heard a thing)\n\t\tBe right with you...\n\nAs Carson dresses, we get a LOOK at their bedroom -- Miranda's\nnightstand has two neat stacks of periodicals on it, with Los\nAngeles magazine and Psychology Today on the top of them.\n\nCarson's nightstand is overflowing with books and magazines\nabout other cities and states: Wonderland Washington;\nMagnificent Oregon; Welcome to North Carolina.\"\n\nINT./EXT.  CARSON'S HOUSE - PATIO & KITCHEN - DAY\n\nMiranda, dressed in a conservative skirt, jacket, black shoes,\nis out on the patio. Her breakfast -- a bowl of fruit and\nwheat germ -- sits on the patio table while she waters some\nsickly-looking ROSE BUSHES in a planter.\n\nCarson, dressed in shirt and tie, looking beat, fries a steak\nand three eggs in butter. He comes outside with his breakfast\nand a magazine article: \"American Expatriates in New Zealand.\"\n\n\t\t\t\tMIRANDA\n\t\t\t(looks him over)\n\t\tHave you gotten any sleep lately?\n\n\t\t\t\tCARSON\n\t\t\t(ignores the question)\n\t\tShop's gonna tow the car in --\n\t\tgoddamn ignition's trashed.\n\n\t\t\t\tMIRANDA\n\t\tTake mine. I'll ride in with Diane.\n\nCarson watches as she carefully picks the dead leaves off the\nrose bushes.\n\n\t\t\t\tCARSON\n\t\tYou ask me, those suckers are a lost\n\t\tcause.\n\nShe continues, then glances at the article Carson is reading.\n\n\t\t\t\tMIRANDA\n\t\tIt's not for you.\n\n\t\t\t\tCARSON\n\t\tYou mean it's not for you.\n\n\t\t\t\tMIRANDA\n\t\tI don't chase car thieves in my\n\t\tunderwear. C'mon, you'd die of\n\t\tboredom if we ever sold this house\n\t\tand moved.\n\n\n\n\t\t\t\tCARSON\n\t\tI'd die of shock, from finding\n\t\tanyone dumb enough to buy the place.\n\t\tEven for what it's worth now.\n\n\t\t\t\tMIRANDA\n\t\tLots of people bought at the top of\n\t\tthe market...\n\n\t\t\t\tCARSON\n\t\tThat sure cheers me right up.\n\n\t\t\t\tMIRANDA\n\t\tI don't know why we even talk about\n\t\tit. The city's not the problem. So\n\t\twe move. It wouldn't matter. What's\n\t\tthat saying: \"Wherever you go, there\n\t\tyou are.\"\n\nCarson just looks at her. Reaching for the salt, he winces\nfrom the cut in his side.\n\n\t\t\t\tMIRANDA\n\t\t\t(continuing)\n\t\tI hope you're current on your\n\t\ttetanus booster. Was it worth it?\n\n\t\t\t\tCARSON\n\t\tOne cut... two assholes in the\n\t\thospital... Yep.\n\nCarson glances at his watch and gets up.\n\n\t\t\t\tCARSON\n\t\t\t(continuing)\n\t\tWell, another day of baby-sitting my\n\t\tfavorite bunch of people...\n\nHe grabs a Bianchi shoulder holster with a Sig-Sauer P-229,\n9mm pistol, straps it on, then pulls on a blue windbreaker.\nEmblazoned on the back are large yellow letters: FBI.\n\n\t\t\t\tMIRANDA\n\t\tAsk for a transfer.\n\n\t\t\t\tCARSON\n\t\tThey're not gonna transfer me. You\n\t\tknow damn well why I was bumped down\n\t\tto guard duty...\n\t\t\t(as he's leaving)\n\t\tMy outstanding people skills.\n\nMiranda tries to return to tending her roses. But instead, she\nsadly watches him go.\n\n\n\nEXT.  CARSON'S HOUSE - DAY\n\nA look of sorrow crosses Carson's face as he watches some\nYOUNG KIDS laugh and shove, getting onto a school bus.\n\nHe then glances at his wounded Mustang, parked in the street.\nHe spots something on the windshield: A pink parking ticket.\n\nThe parking sign above the graffiti-stained Neighborhood Watch\nsign reads: Street Cleaning - Friday 8-10 AM.\n\n\t\t\t\tCARSON\n\t\tI hate this fuckin' town.\n\nCarson CHIRPS open Miranda's car: a red Volvo 960.\n\nAs he pulls away, we SEE a bumper sticker on the car: a circle\nand slash through cartoon weapons on one side, cartoon teddy\nbears on the other, and \"Arms Are For Hugging\" in between.\n\nEXT.  NORTH KOREAN CONSULATE - DAY\n\nThe Driver backs the Mercedes out of the garage behind the\nConsulate. We notice there is ANOTHER MERCEDES parked inside.\n\nMrs. Han, Sam and Joy come outside. They hear some heartfelt\nSWEARING:\n\n\t\t\t\tANGRY VOICE (OS)\n\t\tGoddamn Limey overpriced piece a\n\t\tshit...\n\nTHEIR POV\n\nIn the driveway across the street, a man in a business suit\nhas his head under the hood of a brand-new Jaguar convertible.\nThe JAG OWNER's 15-year-old, blonde daughter, LISA, sits in\nthe car with her schoolbooks in her lap.\n\nJOY\n\nturns to Mrs. Han:\n\n\t\t\t\tJOY\n\t\tCan we give Lisa a ride?\n\nINT./EXT.  MERCEDES - DAY\n\nIt pulls into the driveway across the street. The Jag Owner is\nstill SWEARING mightily. Lisa climbs into the Mercedes.\n\n\t\t\t\tLISA\n\t\tHey, Joy... Sam...\n\nJoy rolls the window up and the SOUND of cursing disappears.\n\n\n\n\t\t\t\tLISA\n\t\t\t(continuing)\n\t\tExcellent -- I can't hear him!\n\n\t\t\t\tSAM\n\t\t\t(raps on window)\n\t\tThe glass is an inch thick.\n\t\t\t(points to doors, roof)\n\t\tArmor-plated. Bulletproof. Bomb-\n\t\tproof.\n\n\t\t\t\tLISA\n\t\tPerfect car for L.A.\n\t\t\t(looks back at her Dad)\n\t\tStarts, too.\n\nEXT.  CRENSHAW BLVD - DAY\n\nAs the Mercedes travels its usual route down Crenshaw, Javal's\nvan begins following it.\n\nINSERT ANGLE - UNDER THE MERCEDES\n\nwhere Javal's DEVICE is attached, still waiting...\n\nEXT.  NORTH KOREAN CONSULATE - DAY\n\nA dark-green government Dodge pulls up and parks behind one\njust like it on a paved area near the Consulate gate.\n\nDAVE JUAREZ, (chubby, 40, Mexican-American, a desk jockey) gets\nout of the Dodge and hangs an FBI shield over his top pocket.\n\nHe glances over at North Korean Security Chief COLONEL LEE,\n(45), who has paused inside the gate to regard Dave, and the\noutside world, with profound contempt.\n\nDave, attachÈ case in one hand and notebook computer in the\nother, walks to a 10-by-15 detached guardhouse on the far\ncorner of the property, just outside the high fence.\n\nINT.  FBI GUARDHOUSE - NORTH KOREAN CONSULATE - DAY\n\nInside are two desks and four chairs, a console of\ncommunication equipment, a microwave and a Mr. Coffee.\n\nDave enters. Two FBI agents, finishing their shift, gather\ntheir belongings: ROBBINS (late 20's; male; thinning hair) and\nSABATINI, (early 30's; cute; dark, bobbed hair; female).\n\nThey wear blue FBI blazers and have standard-FBI-issue 10mm\nHeckler & Koch MP-5 machine pistols in oversized shoulder\nrigs. Dave is in civilian clothes, and is not armed.\n\n\n\n\t\t\t\tROBBINS\n\t\tYo, Dave the Computer Man! Actually\n\t\tescaped the office!\n\n\t\t\t\tDAVE\n\t\tI'm doin' field upgrades. Gives 'em\n\t\ta chance to hose out my cage.\n\nHe glances through the window at Colonel Lee.\n\n\t\t\t\tDAVE\n\t\t\t(continuing)\n\t\tWho's the fuckin' gargoyle?\n\n\t\t\t\tROBBINS\n\t\tTheir Chief of Security, Colonel Lee.\n\nSabatini makes the jerk-off sign with her hand.\n\n\t\t\t\tSABATINI\n\t\t\"Chuckles,\" as we're inclined to\n\t\tcall him.\n\t\t\t(yawns; flops in a chair)\n\t\tFriggin' graveyard shift...\n\n\t\t\t\tROBBINS\n\t\tLove to know what dope made it the\n\t\tBureau's job to give full-time\n\t\tprotection to foreign consulates.\n\t\t\t(offers coffee to Dave)\n\t\tCup a mud?\n\n\t\t\t\tDAVE\n\t\tNot if you made it. Why don't you\n\t\tget Sabatini to brew the java? She's\n\t\tthe alleged chick.\n\n\t\t\t\tSABATINI\n\t\tBlow me.\n\n\t\t\t\tDAVE\n\t\tWhere's Carson?\n\n\t\t\t\tSABATINI\n\t\tOn his way. Some creeps tried to rip\n\t\toff his Mustang last night.\n\t\t\t(beat; solemnly)\n\t\tThey cut the ragtop.\n\n\t\t\t\tDAVE\n\t\tMotherfuckers...\n\nDave takes three PCMCIA computer cards from his attachÈ case.\n\n\n\n\t\t\t\tDAVE\n\t\t\t(continuing)\n\t\tLatest and greatest. Wireless\n\t\tnetwork link-ups.\n\n\t\t\t\tSABATINI\n\t\tWhoa, slow down, I'm gonna pee.\n\n\t\t\t\tROBBINS\n\t\tMe, too.\n\n\t\t\t\tDAVE\n\t\tIngrates.\n\nEXT.  CRENSHAW BLVD - DAY\n\nThe van drives in the lane alongside the Mercedes.\n\nINT.  JAVAL'S VAN - (MOVING SHOT) - DAY\n\nHUMMING, Javal drives with one hand, while tapping with his\nother on the top of the radio-controlled remote box.\n\nEXT.  CRENSHAW BLVD - DAY\n\nAs they approach the light at Washington Blvd, just turning\nyellow, Javal's van gets in front of the Mercedes.\n\nTheir lanes stop for the red light. A FRUIT VENDOR holding a\nbag of oranges walks from car to car.\n\nJaval slips the van into neutral and lets it roll back until\nhis rear bumper taps gently against the Mercedes' front bumper.\n\nINT.  MERCEDES - INCLUDE POV THROUGH REAR VIEW MIRROR - DAY\n\nThe Driver hits the HORN. The van doesn't move. The Driver\nglances in the rear-view:\n\nThere's a Jeep Cherokee tight on his tail, and the BLACK LADY\nin it is busy dealing with a carpool full of 8-year-old KIDS.\n\nThe Driver looks at Mrs. Han, who's peering out the side\nwindow, fascinated by the African-American-themed storefronts.\nThey're all festooned with Summit-related banners, and SHOP\nOWNERS are preparing for a community sidewalk bazaar.\n\nSam, bored, stuffs several pieces of GUM into his mouth.\n\nINT.  JAVAL'S VAN - SAME\n\nJaval flips the switch on his radio-controlled remote.\n\n\n\nINSERT\n\nUnder the Mercedes, the device Javal planted there begins to\nemit thick, white CS TEAR GAS.\n\nINT.  MERCEDES - DAY\n\nThe GAS pours in through the ventilation system. Everyone\ninside starts coughing and choking uncontrollably. The Driver\ngrabs his AMD-74 machine gun and pops the door locks.\n\nEXT.  CRENSHAW BLVD - DAY\n\nThe Driver, Mrs. Han, Joy, Sam and Lisa pile out of the car.\n\nJittering with excitement, fear and speed, Javal hops out of\nhis van, holding a Benelli M-1, a semi-automatic shotgun.\n\nHe SHOOTS the Driver in the chest. The BLAST from the shotgun\nmuzzle, however, is unlike anything we've ever seen before: it\nis blindingly BRIGHT, even in broad daylight, belching a huge\ncluster of glowing, white-hot magnesium.\n\nThe Driver flies back against the Mercedes, EMPTYING his\nmachine gun into the air. The wound in his chest is full of\nBURNING magnesium shrapnel.\n\nWIDER\n\nThe other drivers in the intersection see this and go\ncompletely nuts. Some duck for cover under their dashboards.\nOthers peel away. A few COLLIDE with oncoming traffic.\n\nThe Carpool Lady in the Cherokee pushes the kids down on the\nfloor. The Fruit Vendor hides by rolling under a car.\n\nSam and Joy are incapacitated by tear-gas coughing fits. Mrs.\nHan stumbles toward them, trying to get them to run away.\nJaval PUNCHES her, knocking her down.\n\nHe turns to Lisa, surprised to see her. Sweating, he points\nthe shotgun at her... almost pulls the trigger... then notices\nMrs. Han's expression of horror and thinks the better of it.\n\nHe spots a MOTORIST in a Ford Escort, peering cautiously over\nhis dashboard to get a look at the action.\n\nJaval SHOOTS the Motorist through the windshield with another\nbright, searing blast of magnesium. The Motorist and the\nentire front of his car burst into FLAMES.\n\nMrs. Han is on her knees, sobbing. Javal grabs her by the arm\nand pulls her to the back of the van. He opens the doors.\n\n\n\n\t\t\t\tJAVAL\n\t\tYou see that I'm serious in my\n\t\tintention, yes?\n\t\t\t(she nods)\n\t\tIf you cooperate, you and your\n\t\tchildren will be home for dinner\n\t\ttonight.\n\nHe tightens his grip on her. She nods again, then looks at the\nkids. Javal shoves her, Sam, Joy and Lisa into the van.\n\nINT.  JAVAL'S VAN - DAY\n\nHe grabs three pairs of handcuffs off a C-shaped bar welded on\nboth ends to the inside of the van. He handcuffs one of Mrs.\nHan's arms, passes the chain through the bar, then handcuffs\nthe other. He does the same with Sam; then handcuffs one of\nJoy's arms, passes the chain through and attaches the other\nhandcuff to Lisa.\n\nJaval hops in his seat and drives away on Washington.\n\nEXT.  CRENSHAW BLVD - DAY\n\nSeveral people, including the Carpool Lady, rush over to the\nDriver, who lies DEAD and SMOLDERING on the ground.\n\nHis hand is halfway inside his bloody pants pocket, holding a\nsmall plastic card with the Consulate's phone number on it.\n\nEXT.  NORTH KOREAN CONSULATE - DAY\n\nColonel Lee and a North Korean Army OFFICER come running out.\nANOTHER OFFICER starts up a car in the back of the house.\n\nINT.  FBI GUARDHOUSE - NORTH KOREAN CONSULATE - DAY\n\nRobbins and Sabatini see the commotion and go to investigate.\nDave follows.\n\nEXT.  NORTH KOREAN CONSULATE - DAY\n\nAmbassador Han runs out. He has a stricken look on his face.\n\n\t\t\t\tCOLONEL LEE\n\t\t\t(Korean; to Ambassador Han)\n\t\t[You must stay here.]\n\nAmbassador Han nods. The FBI agents run up. To them:\n\n\t\t\t\tAMBASSADOR HAN\n\t\tSomeone took my family!\n\nThe agents look at each other -- holy shit! Colonel Lee's car\nSCREECHES to a stop. Sabatini stands in front of it.\n\n\n\n\t\t\t\tSABATINI\n\t\tYou got no jurisdiction outside\n\t\tthis property!\n\nColonel Lee shoves a big, ugly Tokorev 7.62x25mm-caliber\npistol in her face as he's opening the car door.\n\n\t\t\t\tSABATINI\n\t\t\t(continuing)\n\t\tShit!\n\t\t\t(to Ambassador Han)\n\t\tYank his fuckin' leash!\n\n\t\t\t\tAMBASSADOR HAN\n\t\tMy men are going!\n\nColonel Lee jumps into the car and it screeches away, almost\nrunning Sabatini over.\n\n\t\t\t\tAMBASSADOR HAN\n\t\t\t(continuing; to Sabatini)\n\t\tIt's a white telephone van, driving\n\t\twest on Washington Boulevard.\n\nThe agents rush back to their guardhouse. Dave's government\nDodge is blocking theirs.\n\n\t\t\t\tROBBINS\n\t\tKeys!\n\nDave tosses them to Robbins. Sabatini shoves Dave into the\nback seat. He looks at her, dumbfounded.\n\n\t\t\t\tSABATINI\n\t\tYou're ridin' shotgun.\n\nINT.  DAVE'S DODGE - (MOVING SHOT) - DAY\n\nDave is thrown against the back of the seat by the ACCELERATION.\n\n\t\t\t\tROBBINS\n\t\tCherry?\n\n\t\t\t\tDAVE\n\t\tUnder the seat.\n\nSabatini grabs the red flashing light, puts it on the dashboard.\n\n\t\t\t\tROBBINS\n\t\tSiren?\n\n\t\t\t\tDAVE\n\t\tI don't know! I'm never in a fuckin'\n\t\thurry..!\n\n\n\nEXT.  FREMONT PLACE - DAY\n\nJust as they race out of Fremont Place past the guard gate,\nCarson, in Miranda's Volvo, comes in on the other side.\n\nINT.  CARSON'S VOLVO - (MOVING SHOT) - DAY\n\nCarson sees the agents in the Dodge and floors the Volvo. He\nfishtails, making a U-turn.\n\nHe straddles the lanes on Wilshire to pull up next to them.\nAll the cars in front of them swerve to clear out of the way.\n\nHe rolls down his window. Sabatini shouts over to him:\n\n\t\t\t\tSABATINI\n\t\tSomeone snatched Han's family! White\n\t\tphone van, westbound on Washington!\n\nCarson looks like he's been punched in the stomach.\n\n\t\t\t\tCARSON\n\t\tGive me a secure radio!\n\nSabatini takes a small two-way MOTOROLA RADIO out of her\npocket and throws it through her window to Carson. Dropping it\nin his lap, he punches the gas. Robbins floors Dave's piece-of-\nshit Dodge, trying to keep up.\n\nEXT.  FEDERAL BUILDING, WESTWOOD - ESTABLISHING - DAY\n\nINT.  FEDERAL BUILDING - STATE DEPARTMENT OFFICES - DAY\n\nDiplomatic Liaison EARL WALTHER is using the reflection in his\noffice window to adjust his necktie. Walther is 30, good-\nlooking, black; a GS lifer working his way up the ranks by\nvirtue of his quiet competence.\n\nA CO-WORKER sticks his head into the office, then shields his\neyes from the sight of Walther's sharp new suit.\n\n\t\t\t\tCO-WORKER\n\t\tSomeone's been to Nordstroms, big\n\t\ttime.\n\n\t\t\t\tWALTHER\n\t\tClothes make the man.\n\n\t\t\t\tCO-WORKER\n\t\tBut does the man make enough for the\n\t\tclothes?\n\n\t\t\t\tWALTHER\n\t\t\t(smiles)\n\t\tThe man makes payments on his Visa.\n\nWalther's SECRETARY rushes in.\n\n\n\n\t\t\t\tSECRETARY\n\t\tMr. Walther... priority line!\n\n\t\t\t\tWALTHER\n\t\t\t(into phone)\n\t\tThis is Diplomatic Liaison Earl\n\t\tWalther... What's the nature of your\n\t\temer --\n\t\t\t(grimaces)\n\t\tAw, Jesus... not today...\n\t\t\t(beat)\n\t\tI'll inform channels and get a copter\n\t\tin the air. For God's sake, keep it\n\t\tquiet. Do what you can, but don't\n\t\tendanger civilians or the family!\n\nINT.  CARSON'S VOLVO - (MOVING SHOT) - DAY\n\nCarson drives with one hand, while holding the radio.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tYou bet -- nice and easy.\n\nReal easy, until he narrowly MISSES a bunch of cars when\nSCREECHING around a corner.\n\nINT.  FEDERAL BUILDING - STATE DEPARTMENT OFFICES - DAY\n\nWalther presses the intercom button on the phone.\n\n\t\t\t\tWALTHER\n\t\t\t(into phone)\n\t\tGet the Secretary of State on the\n\t\thorn.\n\t\t\t(listens)\n\t\tI know he left already. I'm familiar\n\t\twith the concept of time zones. Find\n\t\this ass.\n\nINT.  CARSON'S VOLVO - (MOVING SHOT) - DAY\n\nCarson turns the frequency on his two-way.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tRobbins, Sabatini... Chopper's on\n\t\tits way.\n\nEXT.  WASHINGTON BLVD - DAY\n\nDriving skillfully, Carson edges past the North Koreans.\n\n\n\nINT.  CARSON'S VOLVO - (MOVING SHOT) - DAY\n\nAnd then, Carson can't believe it: he spots Javal's van, a\ncouple blocks ahead, driving at normal speed.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tCheck it out! Ahead, on the right!\n\n\t\t\t\tSABATINI (VO)\n\t\t\t(thru radio)\n\t\tThink it's them?\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tYeah... but it seems too easy... I'll\n\t\tmove up; he won't suspect a civilian\n\t\tcar. Stay back, then get on his ass\n\t\twhen I signal. We'll box him in.\n\nHe looks over at Colonel Lee, whose car is pacing his.\n\n\t\t\t\tCARSON\n\t\t\t(continuing; into radio)\n\t\tIf the Mod Squad gets in your way,\n\t\tdon't be shy about getting 'em out.\n\n\t\t\t\tSABATINI (VO)\n\t\t\t(thru radio)\n\t\tCopy that one.\n\nINT.  COLONEL LEE'S CAR - (MOVING SHOT) - DAY\n\nGlaring, Colonel Lee looks over at the FBI cars as they pass.\n\nINT.  DAVE'S DODGE - (MOVING SHOT) - DAY\n\nSabatini pulls out her machine pistol, and tosses the two-way\nto Dave. He looks scared, and carsick.\n\n\t\t\t\tSABATINI\n\t\tDon't puke... I hate when guys puke!\n\nEXT.  WASHINGTON BLVD - DAY\n\nCarson tries to approach Javal without drawing his attention.\n\nINT.  JAVAL'S VAN - (MOVING SHOT) - DAY\n\nHe still drives at the same speed as the surrounding traffic.\n\nHIS POV\n\nAs Carson nonchalantly passes, Javal NOTICES the government-\nissue two-way radio sitting on the seat of Carson's Volvo.\n\n\n\nJAVAL\n\ngrins... it's show-time. He STOMPS on the gas.\n\nINT.  CARSON'S VOLVO - (MOVING SHOT) - DAY\n\nPissed that he's been made, Carson speeds up.\n\nINT.  JAVAL'S VAN - (MOVING SHOT) - DAY\n\nDriving fast, Javal makes a hard right. As the van leans with\nthe turn, something rolls out from under a sheet of canvas on\nthe floor -- the Governess' BODY, bloodied and grotesque under\nthe plastic tarp it's wrapped in.\n\nJoy starts SCREAMING, as does everyone else when they see it.\n\nJaval pulls out a Beretta Centurion 9mm pistol and FIRES a\ndeafening round through the roof of the van.\n\n\t\t\t\tJAVAL\n\t\tI need to concentrate!\n\nEXT.  WASHINGTON BLVD - DAY\n\nDuring a lull in traffic, a WELL-DRESSED WOMAN jaywalks across\nthe street. An LAPD black-and-white changes lanes and puts on\nits flashing lights. As two COPS write her a ticket...\n\nAround the corner TWO MEN make a quick exchange of money and a\nvial of crack.\n\nNEW ANGLE\n\nThe Cops do notice Javal speeding by, with Carson's Volvo, the\nFBI Dodge and Colonel Lee's car in hot pursuit. They shove the\nticket in the Well-Dressed Woman's hand and hop in their car.\n\nEXT.  LA CIENEGA BLVD / SIDE STREETS - DAY\n\nJaval turns onto the side streets -- rows of run-down\napartment buildings. He takes a circuitous route, gaining a\none-block lead on Carson and the others.\n\nThen, he makes a sudden turn into a one-way alley.\n\nINT.  JAVAL'S VAN - (MOVING SHOT) - DAY\n\nJaval hits a remote garage door opener. Ahead, rickety doors\non one of a line of detached garages facing the alley OPEN up.\n\nAcross from the garage, parked parallel against the back of an\nempty building, we notice a duplicate van. It's facing the\nsame direction as Javal is driving.\n\nJaval slams on the brakes, stopping just past the garage, and\nthen quickly backs up into the garage.\n\nINT.  ALLEYWAY GARAGE / JAVAL'S VAN - DAY\n\nAs he pulls in, we catch GLIMPSES of the van slipping backwards\ninto a FIBERGLASS SUPERSTRUCTURE that fits tightly around the\nrear two-thirds of it. As the van comes to a stop, several snap-\nbuckles on the edge of the superstructure spring closed.\n\nJaval reaches out the van window and pulls on a rope hanging\nfrom the ceiling of the garage. The rope releases the door\nfrom the opening mechanism, so it immediately falls CLOSED.\n\nThen, Javal turns several switches on another of his neatly-\nconstructed remotes:\n\nINT.  DUPLICATE VAN - SERIES OF SHOTS - DAY\n\nSteel straps are holding the steering wheel rigid.\n\nA set of relays, triggered remotely, start the engine;\n\nEngage the transmission;\n\nAnd supply fuel to the carburetor.\n\nEXT.  ALLEYWAYS\n\nThe duplicate van takes off down the alley. Just as it gets up\nto speed, Carson and the others round the corner into the alley\nbehind it. As far as they know, they're still chasing Javal.\n\nThe alley is several blocks long, running parallel to the main\nroad, separated at each block by perpendicular streets. The\nduplicate van races along, scraping against parked cars and\nthe rear walls of buildings...\n\nINT.  CARSON'S VOLVO - (MOVING SHOT) - DAY\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tHe's gonna wrap it around something!\n\nEXT.  ALLEYWAYS - DAY\n\nIndeed, as the duplicate van crosses a street, cars swerve to\navoid hitting it. It continues into the next alley.\n\nUp ahead, a garbage truck lumbers into the far end of the\nalley, its metal lift-rods extended to pick up a dumpster.\n\n\t\t\t\tCARSON (OS)\n\t\tOh, shit...\n\nThe duplicate van CRASHES into the garbage truck and EXPLODES.\n\n\n\nNEW ANGLE\n\nCarson, horrified, jumps out of his car. Robbins and Sabatini\nrun up. They have to hold Carson away from the burning van.\nDave hurries to the back of a building and gets sick.\n\nColonel Lee, wide-eyed with anger, gets in Carson's face.\n\n\t\t\t\tCOLONEL LEE\n\t\tYou should not have interfered!\n\nCarson shoves Colonel Lee out of his way, hard.\n\n\t\t\t\tCARSON\n\t\tI'm in no mood...\n\nColonel Lee comes back, ready for a fight. Carson is happy to\noblige, but Robbins grabs Carson's arm.\n\n\t\t\t\tROBBINS\n\t\tForget about him!\n\nBy now, ONLOOKERS have begun to gather, as LAPD black-and\nwhites and helicopters converge on the area.\n\nEXT.  ALLEYWAY GARAGE - DAY\n\nA block away, the garage door opens, and we hear something\neerie and unexpected: a scratchy, music-box kids' SONG, coming\nfrom a loudspeaker.\n\nJaval's van pulls out and we see its TRANSFORMATION: The\nsuperstructure surrounding the body of the van makes it look\nlike a graffiti-covered, unlicensed ice cream vendor.\n\nEXT.  ALLEYWAYS - DAY\n\nThe entrance of the alley is blocked by a black-and-white. So,\naccompanied by the SONG, Javal drives along the one-way alley\nin his camouflaged van, passing unnoticed by the authorities.\n\nAnguished, Carson is staring at the BURNING duplicate van...\n\n\t\t\t\t\t\t\tCUT TO:\n\nEXT.  BEVERLY DRIVE - (FLASHBACK) - DAY\n\nBeverly Thrift EXPLODES and BURNS...\n\n\t\t\t\t\t\t\tCUT TO:\n\nEXT.  ALLEYWAYS - DAY\n\nCarson tries to shake the memory away. He looks around, sensing\nthat something isn't right, then turns to the other agents.\n\n\n\n\t\t\t\tCARSON\n\t\tLet's get back to the Consulate.\n\nOff their perplexed looks, we\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT.  BACHELOR APARTMENT - DAY\n\nOne room, bathroom and kitchenette. A laptop computer and\nperipherals are on a table, along with some cell phones, a\ntoolbox, and some jumbles of electronic circuitry.\n\nIn the main room, there are three large Lazy-Boy easy chairs,\nside by side, facing a 27-inch TV on a stand. A cloth covers\ntwo OBJECTS sitting atop the TV.\n\nThe door opens. Mrs. Han, Joy, Sam, and Lisa walk in, rigid\nwith fear. Javal, Beretta 9mm in hand, comes in behind them\nand closes the door. Javal strips off his sweat-soaked shirt\nand wipes his face with it. Mrs. Han realizes he's wired to\nthe moon... and it terrifies her.\n\n\t\t\t\tJAVAL\n\t\tDoes anyone need to use the rest\n\t\troom? This will be your last\n\t\topportunity for a few hours.\n\t\t\t(no takers)\n\t\tVery well. Mrs. Han, Sam, Joy,\n\t\tplease sit here.\n\t\t\t(indicates the Lazy Boys;\n\t\t\tthen turns to Lisa)\n\t\tAnd you... what is your name?\n\n\t\t\t\tLISA\n\t\t\t(after a beat)\n\t\tLisa...\n\nStill holding the Beretta, he grabs a polo shirt from the\ncloset and pulls it on. As the family sits in the chairs:\n\n\t\t\t\tJAVAL\n\t\tNo, Mrs. Han, this one. Thank you.\n\nHe takes a pair of handcuffs out of his pants pocket. He tries\nto handcuff Lisa, hands behind her back, but she resists.\n\n\t\t\t\tJAVAL\n\t\t\t(continuing; sotto)\n\t\tYou afford me some additional\n\t\tbargaining power. But not much.\n\nShe wilts. Javal cuffs her to the handles of the refrigerator.\nHe puts a strip of duct tape from his tool box across her mouth.\n\nHe uncovers one of the items atop the TV: An electronic box with\nthree pairs of oversized, LED VU meters on the front of it.\n\nWe NOTICE neat lines of wires running from each of the chairs\nup into it. Javal flips one of a row of switches on it; a\ngreen light and the meters come to life.\n\n\t\t\t\tJAVAL\n\t\t\t(continuing)\n\t\tThere. No taping your mouths, no\n\t\trestraints. Please remain still\n\t\twhile I explain. The meters on the\n\t\tleft indicate sound pressure --\n\t\tDecibels. There are microphones on\n\t\tyour chair backs. If you raise your\n\t\tvoices above certain level, putting\n\t\tyour meter in the red zone for more\n\t\tthan one sustained second, the\n\t\tcircuit will be closed.\n\t\t\t(beat)\n\t\tThe right meters indicate motion.\n\t\tThere are pressure sensors inside the\n\t\tarmrests and seats. The sensors don't\n\t\tlike to get wet, so I hope you were\n\t\thonest about not needing to use the\n\t\tloo. If you make any excess\n\t\tmovements, or try to leave your\n\t\tchair, the circuit will be closed.\n\n\t\t\t\tMRS. HAN\n\t\tI don't understand...\n\nShe looks at her sound meter, which jumped close to the red.\n\n\t\t\t\tMRS. HAN\n\t\t\t(continuing; softly)\n\t\tWhat happens if the circuit closes?\n\n\t\t\t\tJAVAL\n\t\tKaboom...\n\nHe uncovers the other item atop the TV -- a one-pound brick of\nC-4 high explosive with the detonation mechanism jammed into\nit. Mrs. Han gasps and begins to PANIC.\n\n\t\t\t\tJAVAL\n\t\t\t(continuing)\n\t\tEasy... deep breath...\n\t\t\t(to the kids)\n\t\tDo each of you understand?\n\nThey nod. Tears roll down Joy's face.\n\n\t\t\t\tJAVAL\n\t\t\t(continuing)\n\t\tKeep your wits, and all will be fine.\n\nHe flips another switch and the green light turns yellow. He\nthen turns on the TV. COVERAGE of the Summit is everywhere.\n\n\t\t\t\tCOMMENTATOR #1\n\t\t\t(on TV)\n\t\t...Not since the '84 Olympics has the\n\t\twhole city had an such an opportunity --\n\nJaval turns the channel to a SOAP, and MUTES it. He starts\npacing, and glances at his watch. It's 9:15 AM.\n\nINT.  GOVERNMENT HELICOPTER - (AERIAL SHOT) - DAY\n\nEarl Walther looks through the window as his copter lands on\nthe lawn behind the North Korean Consulate.\n\nEXT.  NORTH KOREAN CONSULATE - DAY\n\nAs the copter lands, Carson comes out to meet Walther.\n\n\t\t\t\tWALTHER\n\t\tCarson?\n\t\t\t(Carson nods)\n\t\tWalther. Who told the Ambassador?\n\n\t\t\t\tCARSON\n\t\tHis Security Chief.\n\t\t\t(beat)\n\t\tThere was a civilian with them --\n\t\tfifteen-year-old girl from across\n\t\tthe street. We're trying to reach\n\t\tthe parents.\n\n\t\t\t\tWALTHER\n\t\tGoddamn it...\n\t\t\t(sotto)\n\t\tLook, Mrs. Han was the North Korean\n\t\tPremier's niece! We're hearing\n\t\trumors they're gonna make a major\n\t\tissue out of what happened here...\n\nINT.  NORTH KOREAN CONSULATE - HALLWAY - DAY\n\nCarson and Walther come into the house. We hear only the\nTICKING of the grandfather clock in the foyer.\n\nColonel Lee and his Officers stand by the stairs; Robbins,\nSabatini and Dave stand together near the front door.\n\n\t\t\t\tCARSON\n\t\tI'm not so sure what happened here.\n\t\tSomething smells. Asshole was acting\n\t\tlike he wanted us to spot him...\n\n\n\n\t\t\t\tWALTHER\n\t\tWhat the hell are you talking about?\n\n\t\t\t\tAMBASSADOR HAN (OS)\n\t\tMr. Walther?\n\nAmbassador Han comes down the stairs, his face tight with\nrepressed emotion.\n\n\t\t\t\tWALTHER\n\t\tAmbassador Han... my deepest --\n\n\t\t\t\tAMBASSADOR HAN\n\t\t-- I have no wish for condolences.\n\t\tJust answers.\n\n\t\t\t\tWALTHER\n\t\tAs soon as we have any to give...\n\nSuddenly, the Butler sprints across the foyer. He shoves the\ncordless phone into Ambassador Han's hands.\n\nAmbassador Han listens to the phone, then takes in a sharp\nbreath and sits on the steps.\n\n\t\t\t\tAMBASSADOR HAN\n\t\t\t(into phone)\n\t\tYoon..?!\n\n\t\t\t\tCARSON\n\t\t\t(to FBI agents)\n\t\tStart a trace!\n\nCarson is elated. Robbins, Sabatini and Dave rush out. Walther\npulls out a cell phone and hits a speed-dial key.\n\n\t\t\t\tWALTHER\n\t\t\t(into phone)\n\t\tMr. Secretary... they're alive!\n\n\t\t\t\tCOLONEL LEE\n\t\t\t(to Carson; incensed)\n\t\tYou are tapping our phones?!\n\n\t\t\t\tCARSON\n\t\t\t(while crossing to\n\t\t\tAmbassador Han)\n\t\tYeah, you didn't know. And I'm Meryl\n\t\tStreep.\n\nINT.  BACHELOR APARTMENT - DAY\n\nJaval is holding his cell phone next to Mrs. Han's face.\n\n\n\n\t\t\t\tMRS. HAN\n\t\t\t(into phone)\n\t\tWe are not hurt. But this man is\n\t\tvery serious --\n\nHe pulls the phone from her, takes a breath to compose himself.\n\n\t\t\t\tJAVAL\n\t\t\t(into phone)\n\t\tI want you to remember the feeling\n\t\tyou had when you thought your family\n\t\twas dead, and use it to inform the\n\t\tchoices you're about to make.\n\nINT.  NORTH KOREAN CONSULATE - HALLWAY - DAY\n\n\t\t\t\tCARSON\n\t\tSay you want to talk to the kids...\n\n\t\t\t\tAMBASSADOR HAN\n\t\t\t(into phone)\n\t\tI need to know my children are all\n\t\tright.\n\n\t\t\t\tJAVAL (VO)\n\t\t\t(thru phone)\n\t\tBe in front of a television in two\n\t\tminutes. Tune it to channel four.\n\t\tYou'll get the picture.\n\nJaval hangs up. Stunned, Ambassador Han stands up.\n\n\t\t\t\tAMBASSADOR HAN\n\t\tThere is a television in my office.\n\nAs Carson, Ambassador Han, Colonel Lee and Walther hurry to\nthe office in the back of the house, Carson's radio crackles:\n\n\t\t\t\tROBBINS (VO)\n\t\t\t(thru radio)\n\t\tWe're screwed on the trace -- he's\n\t\ton a cell phone.\n\nINT.  FBI GUARDHOUSE - NORTH KOREAN CONSULATE - DAY\n\nDave and Robbins watch Sabatini work the comm console.\n\n\t\t\t\tDAVE\n\t\tPlay the tape back. I might be able\n\t\tto pull the electronic serial number\n\t\tout of the subcarrier.\n\n\t\t\t\tCARSON (VO)\n\t\t\t(thru radio)\n\t\tAsk Dave if he knows how to find the\n\t\tphone's serial number.\n\n\t\t\t\tROBBINS\n\t\t\t(smiles; into radio)\n\t\tHey, great idea...\n\nINT.  NORTH KOREAN CONSULATE - AMBASSADOR HAN'S OFFICE - DAY\n\nAmbassador Han turns on the TV to channel 4.\n\nANGLE ON TV\n\nIt's the same medical SOAP that's on at the apartment -- a\nDOCTOR and NURSE are screwing in a deserted operating room.\n\nINT.  BACHELOR APARTMENT - DAY\n\nJaval is standing in the kitchenette, pointing a DIGITAL STILL\nCAMERA at the family. It FLASHES as he takes a picture.\n\nCLOSER\n\nThere is a cable running from Javal's computer to his cell\nphone. He hooks another cable to the digital camera, and an\nIMAGE appears on the screen of his laptop. He clicks on \"SEND.\"\n\nINT.  NORTH KOREAN CONSULATE - AMBASSADOR HAN'S OFFICE - DAY\n\nEveryone stares expectantly at the TV. They turn as the fax\nmachine on the credenza RINGS. An IMAGE begins to emerge from\nthe machine: the picture from Javal's digital camera.\n\nCLOSE ON FAXED PICTURE\n\nIt shows the Han family sitting in their booby-trapped chairs\nin front of the TV. The explosives and the electronics are\nclearly visible atop the set, as is the program on the TV.\n\n\t\t\t\tCARSON (OS)\n\t\tOh, Jesus, those're explosives!\n\t\t\t(beat)\n\t\tLook at the TV -- this was just\n\t\ttaken.\n\nBACK TO SCENE\n\nA second page on the fax begins to come through. As it does,\nthe telephone RINGS. Carson and Colonel Lee both go for the\nextension near the sofa; Carson grabs it first. Ambassador Han\npicks up the phone on his desk.\n\n\n\n\t\t\t\tJAVAL (VO)\n\t\t\t(thru phone)\n\t\tThere must surely be several people\n\t\tin the room; you may put me on the\n\t\tspeakerbox if you wish.\n\nAmbassador Han clicks on the SPEAKERBOX. Carson and the others\nlook at the second faxed page: a list of instructions.\n\n\t\t\t\tJAVAL (VO)\n\t\t\t(continuing; thru\n\t\t\tspeakerbox)\n\t\tI am not a terrorist. Your\n\t\tcountries' political posturing means\n\t\tnothing to me. So do not waste time\n\t\ttrying to negotiate.\n\t\t\t(beat)\n\t\tThe Federal Reserve Bank of Los\n\t\tAngeles can furnish ten million\n\t\tdollars U.S. by 2:00 PM. The\n\t\trequired denominations are in the\n\t\tinstructions, as is the method of\n\t\tpackaging. Be in your car at 3:00\n\t\tPM, and drive north on Highland\n\t\tAvenue. I will call with where to\n\t\tleave the money, which you will do\n\t\tat 3:30. If I am unmolested, I will\n\t\tcall again at 4:00 with the family's\n\t\tlocation and the method for removing\n\t\tthem from their... predicament.\n\t\tCould you please refer to page one?\n\t\t\t(they look at the photo)\n\t\tAny deviation from these instructions\n\t\tand my device will fulfill its\n\t\tfunction at exactly 5:00 PM.\n\nCLICK. Ambassador Han looks around, feeling totally helpless.\nCarson says nothing, trying not to show how uneasy he feels.\n\n\t\t\t\tAMBASSADOR HAN\n\t\t\t(to Walther)\n\t\tP'yÚngyang must approve the ransom...\n\n\t\t\t\tWALTHER\n\t\tOf course. The FBI's top Hostage\n\t\tNegotiator is on the way --\n\n\t\t\t\tCARSON\n\t\t-- Goddamn Negotiator's the last\n\t\tthing we need! This asshole sound\n\t\tlike he was interested in bargaining?\n\nWalther glares at Carson, then continues to Ambassador Han:\n\n\n\t\t\t\tWALTHER\n\t\tWe have people who are experts in\n\t\tthese situations. We really feel it\n\t\twould be best if you let them\n\t\tcoordinate everything...\n\nNumb, Ambassador Han nods.\n\n\t\t\t\tWALTHER\n\t\t\t(continuing; to Carson)\n\t\tLet's get on it...\n\nINT.  FBI GUARDHOUSE - NORTH KOREAN CONSULATE - DAY\n\nRobbins, Sabatini and Dave look up as Carson and Walther enter.\n\n\t\t\t\tCARSON\n\t\t...You're gonna just pay up, count\n\t\ton his good nature to return the\n\t\tfamily?!\n\n\t\t\t\tWALTHER\n\t\tIt's the President's intention to\n\t\tkeep this quiet, move forward with\n\t\tthe Summit, and work with the North\n\t\tKoreans. Jesus, you've already\n\t\tembarrassed the shit out of us over\n\t\tthe phone surveillance --\n\n\t\t\t\tCARSON\n\t\t-- They know their phones are tapped!\n\t\tThey tap our fucking phones!\n\n\t\t\t\tWALTHER\n\t\tThat's not the point! The point is\n\t\tnot acknowledging it!\n\t\t\t(beat)\n\t\tWe got an international incident\n\t\tbrewing, with a country we were\n\t\tpractically at war with last year!\n\t\tOur best Negotiator is gonna run\n\t\tpoint. If you got a problem, you can\n\t\ttake the goddamn rest of the day off.\n\n\t\t\t\tCARSON\n\t\tThis Consulate is my responsibility.\n\n\t\t\t\tWALTHER\n\t\tNot any more.\n\nCarson is stunned. (OS), we hear a CHOPPER approaching.\n\n\n\n\t\t\t\tWALTHER\n\t\t\t(continuing)\n\t\tThat's the Negotiator. You do the\n\t\tbriefing.\n\nCarson shoots a disgusted look at the others, then leaves.\n\n\t\t\t\t\t\t\tCUT TO:\n\nINT.  NORTH KOREAN CONSULATE - AMBASSADOR HAN'S OFFICE - DAY\n\nCarson turns off the Beach Boys SONG on the TV behind him.\n\nHolding Javal's faxes, he's facing Ambassador Han, Colonel Lee\nand the Hostage Negotiator (whom we don't yet see.)\n\n\t\t\t\tCARSON\n\t\t...Our worst enemy'll be the city.\n\t\tThere are events gearing up all\n\t\taround town, and a dozen world\n\t\tleaders arriving. Add the Friday\n\t\trush hour and usual L.A. bad\n\t\tbehavior and it'll be a nightmare\n\t\tout there by 3 PM. It all works to\n\t\tthe advantage of the kidnapper,\n\t\thinders our pursuit efforts...\n\t\t\t(frowns)\n\t\tYou don't agree?\n\nWIDER\n\n\nThe Negotiator stands and takes the faxes from Carson.\n\n\nIt's Miranda, his wife. Her FBI shield-holder is folded over\nthe breast pocket of her jacket.\n\n\t\t\t\tMIRANDA\n\t\tI'm wondering whether to believe him\n\t\twhen he says he's strictly motivated\n\t\tby money.\n\n\t\t\t\tCARSON\n\t\t\t(grabs faxes back)\n\t\tYou see one word of Peoples'-\n\t\tLiberation, Holy-Jihad, Revolutionary\n\t\twhatever-it-is-we're-pissed-off-about-\n\t\tthis-week bullshit in this entire\n\t\tletter?\n\n\t\t\t\tMIRANDA\n\t\tI still want to check the MO against\n\t\tknown politicals, terrorists --\n\n\n\n\t\t\t\tCARSON\n\t\t-- Already doing it. We're\n\t\tcoordinating with the Secret\n\t\tService, the NSA and the CIA.\n\n\t\t\t\tMIRANDA\n\t\tHave someone talk to the LAPD, give\n\t\tthem a cover story for the media\n\t\tabout the crash on La Cienega.\n\nWalther comes in and looks at Carson.\n\n\t\t\t\tWALTHER\n\t\tWhy didn't you tell me Doctor Knoll\n\t\tis your wife?!\n\nThis surprises Ambassador Han and Colonel Lee.\n\n\t\t\t\tCARSON\n\t\t\t(while looking at Miranda)\n\t\tIf she'd changed her name when we\n\t\tgot married, I wouldn't have to.\n\n\t\t\t\tMIRANDA\n\t\t\t(to Carson)\n\t\tI'm so enjoying this opportunity to\n\t\tfinally work together...\n\n\t\t\t\tWALTHER\n\t\tJesus, forget I asked.\n\t\t\t(beat)\n\t\tThe cash will be here in an hour.\n\t\t\t(to Miranda)\n\t\tAny thoughts on the kidnapper's\n\t\tthoughts?\n\n\t\t\t\tMIRANDA\n\t\tEverything indicates he's working\n\t\talone. And his concerns do seem to\n\t\tbe solely about the money... so I\n\t\tagree that he's only using the\n\t\tSummit and the tension with North\n\t\tKorea to create extreme motivation\n\t\tto pay the ransom.\n\n\t\t\t\tCOLONEL LEE\n\t\tI will bring the money to him.\n\n\t\t\t\tCARSON\n\t\tMy ass.\n\n\t\t\t\tCOLONEL LEE\n\t\tThe hostages are citizens of the\n\t\tPeople's Republic of Korea --\n\n\t\t\t\tCARSON\n\t\t-- Hey, do I go to the torture\n\t\tchambers in your prisons, tell you\n\t\thow to do your job?\n\n\t\t\t\tWALTHER\n\t\tAll right, you're outta here! Is\n\t\tthis the same insubordinate crap you\n\t\tpulled at Beverly Thrift?\n\nCarson glares coldly at Walther.\n\n\t\t\t\tCARSON\n\t\tI'll coordinate the drop.\n\n\t\t\t\tAMBASSADOR HAN\n\t\tPerhaps that is better. Inspector\n\t\tCarson knows the terrain --\n\n\t\t\t\tCOLONEL LEE\n\t\t-- Then he can come with me.\n\nWalther looks at Miranda. She nods her assent.\n\n\t\t\t\tWALTHER\n\t\t\t(firm; to Carson)\n\t\tIt's settled.\n\n\t\t\t\tCARSON\n\t\tIt sucks.\n\n\t\t\t\tMIRANDA\n\t\tBut it means we can get on with it.\n\nThe Americans leave the room.\n\nINT.  NORTH KOREAN CONSULATE - HALLWAY - DAY\n\nStill fuming, Carson walks ahead. Miranda pulls Walther aside.\n\n\t\t\t\tMIRANDA\n\t\t\t(sotto)\n\t\tGet one thing straight, Mr. Walther.\n\t\tIf the Bureau had listened to Pete,\n\t\tBeverly Thrift never would've\n\t\thappened.\n\nINT.  BACHELOR APARTMENT - DAY\n\nHands shaking with nerve- and speed-induced jitters, Javal\nturns two switches on the unit atop the TV. Two LED readouts\nlight up: one shows the current time -- 2:30 PM -- the other\nis fixed at 5:00 PM. Below, the TV is still on.\n\nJaval flips the channels, stopping at a rerun of \"Lifestyles\nof the Rich and Famous.\" He suppresses a gleeful giggle.\n\n\t\t\t\tJAVAL\n\t\tThat's more like it...\n\nHe checks the contents of his prescription bottle. Two pills.\nHe takes one, stuffs the bottle in his pocket, and leaves.\n\nEXT.  PíY³NGYANG, NORTH KOREA - DAY\n\nSUPER: PíyÚngyang. Capitol of North Korea.\n\nPoster city for the charms of Communism: dreary, crumbling,\ngray, stifling, hopeless.\n\nINT.  WORKERS' PARADISE HALL - CONFERENCE CHAMBER - DAY\n\nIn the main government offices, a meeting of ten overly-\ndecorated MILITARY MEN and their SUPPORT STAFFS.\n\nSour GENERAL KAI (50's) is ARGUING heatedly in KOREAN with an\naged MODERATE GENERAL. The weak-willed PREMIER OF NORTH KOREA\nsits up front and listens passively.\n\nAn ARMY MAJOR sitting behind General Kai stands and slips out\nthe door.\n\nEXT.  WORKERS' PARADISE HALL - ROOFTOP - DAY\n\nCrouched behind an air-conditioning unit, the Major, an\nAmerican Operative, speaks in UNACCENTED ENGLISH into a small\nUPLINK DEVICE, disguised to look like a palmtop computer.\n\n\t\t\t\tOPERATIVE\n\t\t\t(into uplink device)\n\t\t...They've got the Premier agreeing\n\t\tto the hard-line position --\n\nHe hears footsteps approaching (OS).\n\n\t\t\t\tOPERATIVE\n\t\t\t(continuing; sotto)\n\t\tMore to follow...\n\nHe angles skyward a tiny dish-shaped antenna on the Device. On\nits screen it says COMPRESSING... SCRAMBLING... UPLINKING...\n\nAfter it's finished, the Operative snaps it closed and puts it\ninto a false bottom in his attachÈ case. He disappears just\nbefore a GUARD rounds the corner.\n\nEXT.  STREETS OF LOS ANGELES - VARIOUS ANGLES - DAY\n\n\"Welcome Pacific Partners\" banners hang everywhere.\n\nWORKERS and CATERERS prepare for the various parties and\nevents around town. COPS and PRIVATE SECURITY do their best to\nkeep traffic moving, but it's already getting congested.\n\nINT.  FBI GUARDHOUSE - NORTH KOREAN CONSULATE - DAY\n\nDave stares at his computer, looking through a DATABASE of\nkidnappers and their modus operandi. He rubs his eyes.\n\n\t\t\t\tDAVE\n\t\tI wanted to be home by now, take the\n\t\tkids to the rally in Boyle Heights.\n\n\t\t\t\tSABATINI\n\t\tWe got a cabin in Big Bear. By now,\n\t\tL.A. was supposed to be a brown\n\t\tblotch in the rear-view mirror.\n\nShe's helping Walther stack packs of THOUSAND-DOLLAR-BILLS\ninto a series of small plastic bags, tying each one off when\nit's the size of a brick. They then put the individual bags\ninto two larger bags.\n\nRobbins rubber-bands a matchbook-sized HOMING TRANSMITTER in\nbetween two packs of cash. He then hollows out a dime-sized\nspace inside a different pack of money with a razor knife.\n\nHe puts a tiny, SECOND homing transmitter in the space. Carson\nchecks some hand-held receivers. Miranda crosses to him.\n\n\t\t\t\tMIRANDA\n\t\tHe'll expect a homing device --\n\n\t\t\t\tCARSON\n\t\t-- I expect him to expect it. He'll\n\t\tcheck the cash with an RF detector...\n\t\t\t(re larger transmitter)\n\t\tMeaning he'll find this one.\n\t\t\t(re smaller transmitter)\n\t\tThis only has a quarter-mile range,\n\t\tbut on a frequency too low to detect.\n\t\t\t(turns off receiver)\n\t\tAnd I doubt the asshole will have an\n\t\tX-ray machine or a metal detector.\n\n\t\t\t\tMIRANDA\n\t\tWhy must you always refer generically\n\t\tto criminals as \"assholes?\"\n\n\t\t\t\tCARSON\n\t\tGosh, you're right. It could\n\t\tundermine their self-esteem and spoil\n\t\ttheir chances for rehabilitation.\n\n\t\n\t\t\t\tMIRANDA\n\t\tYou been reading my magazines in the\n\t\tbathroom again?\n\nShe returns to listening to an AUDIO TAPE:\n\n\t\t\t\tJAVAL (VO)\n\t\t\t(thru recorder)\n\t\t\"And my device will fulfill its\n\t\tfunction at exactly 5:00 PM...\"\n\n\t\t\t\tMIRANDA\n\t\tHe's really exhibiting pressured\n\t\tspeech... big effort here to sound\n\t\tcalm. Same with his vocabulary... if\n\t\the were in control, he wouldn't feel\n\t\tsuch a need to sound that way.\n\n\t\t\t\tCARSON\n\t\tJust tell me if we can use it.\n\n\t\t\t\tMIRANDA\n\t\tIf we needle him he could get sloppy\n\t\tand give us an opening, but I'm not\n\t\tgoing to risk it. This is the worst\n\t\tkind of perpetrator: anything makes\n\t\thim deviate from his carefully-\n\t\tscripted plan, he could become\n\t\textremely volatile.\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nDuring this, Colonel Lee stands in a window on the top floor,\npointing a LASER EAVESDROPPING UNIT at the FBI guardhouse.\n\n\t\t\t\tMIRANDA (VO)\n\t\t\t(thru headphones)\n\t\tDo we have back-up if the bleeper\n\t\tfails?\n\n\t\t\t\tCARSON (VO)\n\t\t\t(thru headphones)\n\t\tNothing but physical surveillance.\n\nINT.  FBI GUARDHOUSE - NORTH KOREAN CONSULATE - DAY\n\n\t\t\t\tMIRANDA\n\t\tIt's real important we don't lose\n\t\thim. He didn't go through all the\n\t\ttrouble of designing that bomb not\n\t\tto use it.\n\nCarson looks at her as the thought of it hits him.\n\n\n\n\t\t\t\tCARSON\n\t\tWell, it ain't gonna happen.\n\t\t\t(beat; sotto)\n\t\tNot again...\n\nEXT.  WHITE HOUSE, WASHINGTON, DC - ESTABLISHING - DAY\n\nINT.  WHITE HOUSE - CONFERENCE ROOM - DAY\n\nThe National Security Council: VICE PRESIDENT, SECRETARIES OF\nDEFENSE, STATE, CHIEFS of the FBI, CIA and NSA -- sit\nnervously around a table, facing a video conferencing setup.\nThe President, in Air Force One, APPEARS on it.\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tWhat the hell is the big crisis?\n\n\t\t\t\tSECRETARY OF STATE\n\t\tWe just received a missive from the\n\t\tNorth Korean attachÈ. They say the\n\t\tkidnapping is a U.S. plot to provoke\n\t\tand humiliate them during the Summit.\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tBullshit. They're just ticked because\n\t\twe don't want the Chinese dragging\n\t\ttheir asses into the treaty talks.\n\nThe SENIOR INTELLIGENCE OFFICER refers to his notes.\n\n\t\t\t\tINTELLIGENCE OFFICER\n\t\tWe have a covert operative in place.\n\t\tHe reports the hard-liners and\n\t\tmoderates in the High Command are\n\t\targuing about how to respond, should\n\t\tthe Premier's niece and her children\n\t\tshould be killed.\n\n\t\t\t\tPRESIDENT\n\t\t\t(scowls; thru video link)\n\t\tRespond?! Christ. What about the\n\t\tdamn Premier?\n\n\t\t\t\tSECRETARY OF STATE\n\t\tHe's weak. He has to look tough to\n\t\tsave face, keep control of hard-\n\t\tliners... otherwise he risks a coup.\n\n\t\t\t\tCIA CHIEF\n\t\tWhich is a real possibility. Most of\n\t\tthose old-fart Generals don't want to\n\t\t\t\t-more-\n\n\t\t\t\tCIA CHIEF (Cont'd)\n\t\tbe part of the Summit any more than\n\t\twe want them to. They're mad as hell\n\t\the even talked to the Chinese.\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tI don't want to deal with this right\n\t\tnow! Get our diplomats on it. Tell\n\t\tthe North we'll pay the ransom for\n\t\t'em... Placate 'em! And make damn\n\t\tsure we get that family back in one\n\t\tpiece. Who's in charge in L.A.?\n\n\t\t\t\tFBI CHIEF\n\t\tThe Bureau, Sir. We have a crack\n\t\tteam in place.\n\n\t\t\t\tSECRETARY OF STATE\n\t\tThere's a Diplomatic Liaison from\n\t\tState, too.\n\n\t\t\t\tCIA CHIEF\n\t\t\t(to FBI Chief)\n\t\tWhat about your man stationed at the\n\t\tConsulate...\n\t\t\t(refers to notes)\n\t\tCarson? He was demoted from the FBI\n\t\tHostage Program, couple years back.\n\t\tAnd this did happen on his watch...\n\n\t\t\t\tFBI CHIEF\n\t\t\t(irritated)\n\t\tThere's no way he could've prevented\n\t\tthis abduction! Besides, I've got one\n\t\tof my top Negotiators in charge --\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\t-- Whatever. I want a total news\n\t\tblackout and I want this over with,\n\t\tquickly! Without giving those Commie\n\t\tlittle bastards any excuse to shit\n\t\tall over my Summit!\n\nEXT.  NORTH KOREAN CONSULATE - DAY\n\nInside, the grandfather clock in the foyer CHIMES THREE TIMES.\n\nColonel Lee, carrying an AMD-74 machine gun, goes to get in the\ndriver's side of the second armored Mercedes, but Carson is\nalready there. Grumbling, he crosses to the passenger's side.\n\nCarson drives off just a moment before Colonel Lee is\ncompletely in the car.\n\n\n\nEXT.  HIGHLAND AVENUE - DAY\n\nThe Mercedes crosses Melrose, going into Hollywood. The town\nis all done up with posters and banners.\n\nRobbins and Walther follow a block behind the Mercedes in an\nunmarked car; Sabatini and Dave drive ahead in Dave's Dodge.\n\nINT.  NORTH KOREAN CONSULATE - AMBASSADOR HAN'S OFFICE - DAY\n\nMiranda, Ambassador Han, and Lisa's father (the cussing Jag\nOwner) wait by the phone. Miranda smiles reassuringly at the\ntwo nervous fathers. The phone RINGS; she picks it up.\n\n\t\t\t\tMIRANDA\n\t\t\t(into phone)\n\t\tYes, please go ahead...\n\n\t\t\t\tJAVAL (VO)\n\t\t\t(long beat; thru phone)\n\t\tAh... this must be one of those\n\t\tprofessionals --\n\n\t\t\t\tMIRANDA\n\t\t\t(into phone)\n\t\t-- I'm only here to see that\n\t\teveryone gets what they want --\n\n\t\t\t\tJAVAL (VO)\n\t\t\t(thru phone)\n\t\t-- I've got my shotgun in little\n\t\tLisa's mouth, and I will pull the\n\t\ttrigger in five seconds unless you\n\t\tput the Ambassador on the phone.\n\nMiranda hands the phone to Ambassador Han.\n\nINT.  MERCEDES - (MOVING SHOT) - DAY\n\nFrom the two-way radio in Carson's pocket:\n\n\t\t\t\tMIRANDA (VO)\n\t\t\t(thru radio)\n\t\tThe drop is at the DeMille barn,\n\t\tacross from the Hollywood Bowl.\n\t\tYou're to leave the money in the\n\t\tcenter of the parking lot.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tShit... no way we can set up a stake-\n\t\tout in...\n\t\t\t\t-more-\n\n\t\t\t\tCARSON (Cont'd)\n\t\t\t(checks watch)\n\t\tFour minutes. Call the Park Rangers\n\t\tat the Bowl. Have them clear the\n\t\tarea of civilians.\n\n\t\t\t\tMIRANDA (VO)\n\t\t\t(thru radio)\n\t\tRemember, Pete... we're dealing with\n\t\ta customer with a lot of rage.\n\n\t\t\t\tCARSON\n\t\t\t(to himself)\n\t\tMust've bought a house same time we\n\t\tdid.\n\nEXT.  HIGHLAND AVENUE - VARIOUS ANGLES - DAY\n\nRobbins and Walther are inching along in traffic on Highland\nnear Hollywood Blvd.\n\nElsewhere, we see unmarked police and government cars cruising\naround, dropping off disguised FOOT-SURVEILLANCE OFFICERS, etc.\n\nA BIKER CLUB\n\nof twenty aging, weekend-warriors, all on custom Harleys, turn\nfrom the Boulevard onto Highland.\n\nEXT.  DEMILLE BARN - DAY\n\nCarson drives the Mercedes into the entrance of the Hollywood\nMuseum Park. Carson stops in front of a yellow barn with a\nsign atop it: \"Jesse Lasky Famous Players.\"\n\nINT./EXT.  JAVAL'S VAN - DAY\n\nStill disguised as an ice-cream truck, the van is parked\nacross Highland by the entrance to the Hollywood Bowl, where a\nSummit-related concert is being readied.\n\nJaval watches the Mercedes, and takes his last pill. He's flying.\n\nINT.  MERCEDES - DAY\n\nColonel Lee grabs the two large plastic bags full of money\nfrom the back seat, opens his door, and drops them onto the\npavement. Carson looks around.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tThere's about a hundred ways he can\n\t\tscurry off like a cockroach from\n\t\there... So spread out.\n\nColonel Lee checks their BEEPING homing receiver. Carson hangs\na left onto Highland, going back the way he came.\n\nINT.  DAVE'S DODGE - (MOVING SHOT) - DAY\n\nDave holds their homing receiver. Sabatini, behind the wheel,\nsmacks his arm and points ahead:\n\nEXT.  DEMILLE BARN - DAY\n\nJaval's van drives into the parking lot, and stops right above\nthe bags of money.\n\n\t\t\t\tDAVE\n\t\t\t(into radio)\n\t\tOur boy's in a fuckin' ice cream\n\t\ttruck!\n\nEXT.  ODIN STREET - DAY\n\nSabatini and Dave watch Javal's van through the trees.\n\nINT.  JAVAL'S VAN - DAY\n\nJaval, sweating and shaking, quickly runs a metal-detector\nwand over each of the individual bags of money. One of them\nmakes the speaker in the wand handle WHINE.\n\nINT.  DAVE'S DODGE - INCLUDE POV OF DEMILLE BARN - DAY\n\nThe van pulls away.\n\nDave glances at the homing receiver. The signal isn't moving.\nHe looks up...\n\nTwo of the small bags of money are sitting on the pavement.\n\n\t\t\t\tDAVE\n\t\tSon of a bitch!\n\t\t\t(into radio)\n\t\tHe found the bleepers -- both of\n\t\tthem!\n\nINT.  MERCEDES - (MOVING SHOT) - DAY\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tFuck! Okay, stay back. It's not like\n\t\the'll be hard to see in that truck.\n\t\tWhich way's he heading?\n\n\t\t\t\tDAVE (VO)\n\t\t\t(thru radio)\n\t\tToward the freeway.\n\nCarson hangs a U-turn.\n\n\n\nEXT.  HIGHLAND AVENUE - DAY\n\nAt the complex intersection where Highland ends at the 101,\nJaval bears to the right, toward the South on-ramp.\n\nSabatini and Dave follow a few cars behind as he gets on it.\n\nSuddenly, he scoots over to the shoulder and slams the van\ninto REVERSE. He backs off the on-ramp, past a row of angry\ndrivers, passing by Sabatini and Dave.\n\nPeeling in reverse onto Highland, Javal stomps on the brakes.\nThe snap buckles holding the ice-cream-truck superstructure\naround his van BREAK APART, and the whole thing slides off...\nblocking Sabatini's way.\n\nJaval drives forward again, this time getting onto the 101\nNorth on-ramp.\n\nINT.  NORTH KOREAN CONSULATE - AMBASSADOR HAN'S OFFICE - DAY\n\nMiranda looks at Ambassador Han and Lisa's father while\nanxiously clutching her two-way radio.\n\n\t\t\t\tMIRANDA\n\t\t\t(into radio)\n\t\tWhat happened?\n\n\t\t\t\tCARSON (VO)\n\t\t\t(thru radio)\n\t\tWe're made! Gotta grab him!\n\n\t\t\t\tMIRANDA\n\t\t\t(beat; into radio)\n\t\tAll right... Carefully...\n\nINT.  MERCEDES - (MOVING SHOT) - DAY\n\nCarson follows Javal onto the freeway. Colonel Lee grabs his\nAMD-74 machine gun.\n\n\t\t\t\tCARSON\n\t\tWatch it! We need him alive!\n\nEXT.  HOLLYWOOD FREEWAY - DAY\n\nColonel Lee leans out and SHOOTS Javal's rear tires out.\n\nThe van drives erratically, held in its lane by bumping\nagainst the cars around it.\n\nCarson pulls up closer...\n\nSuddenly, the rear doors of the van burst open...\n\nAnd Javal flies out, riding a motorcycle. He's got the money\nstuffed into two big, chaps-sized SADDLEBAGS slung over the\nback of the machine.\n\nHe straddles the lanes, going against traffic, riding like a\nmaniac back the way he came.\n\nCarson watches him in the rear-view... and speeds up, driving\naway from him.\n\n\t\t\t\tCOLONEL LEE\n\t\tTurn around!\n\nBut Carson hugs the shoulder, moving through the heavy\ntraffic, until he spots what he was looking for:\n\nThe Biker Club, riding in formation up ahead.\n\nCarson cuts in front of them and slams on the brakes. He jumps\nout and grabs one of the Biker's machines by the handlebars,\nwrestling it to a stop. While pulling its BURLY OWNER off it:\n\n\t\t\t\tCARSON\n\t\tFBI. Call our office, they'll take\n\t\tcare of you.\n\nMeanwhile, the other BIKERS have come to help their friend.\nThey pull guns, knives, chains...\n\nThey're stopped by Sabatini, who appears holding her MP-5\nmachine pistol. The Biker yells at Carson as he drives way:\n\n\t\t\t\tBIKER\n\t\tI'm a taxpayer! I'm a goddamn\n\t\tdentist!\n\nCOLONEL LEE\n\ngets in the driver's seat of the Mercedes and turns it around.\n\nJAVAL\n\ncontinues down the freeway on his bike, straddling lanes,\ndriving the wrong way, retracing his route back to Highland,\nleaving CAR HORNS, CURSING, and COLLISIONS in his wake.\n\nWIDER\n\nWhen everyone thinks they've seen it all, here comes another\nmad biker -- Carson -- riding against traffic in pursuit.\n\n\n\nEXT.  HIGHLAND AVENUE - DAY\n\nJaval rides against traffic down the Cahuenga on-ramp, then\njumps the divider, runs the light crossing Highland, and gets\ninto the southbound lanes.\n\nHe just misses a BUS, nearly wiping out.\n\n\t\t\t\tCARSON\n\t\tJust don't kill yourself, you piece\n\t\tof shit...\n\nCarson fishes out his two-way.\n\n\t\t\t\tCARSON\n\t\t\t(continuing; into radio)\n\t\tHelicopter or two would be nice!\n\nINT.  NORTH KOREAN CONSULATE - AMBASSADOR HAN'S OFFICE - DAY\n\nListening to the two-way, Miranda tries to follow the action.\n\n\t\t\t\tMIRANDA\n\t\t\t(into radio)\n\t\tLove to be in the loop on this...\n\nEXT.  HIGHLAND AVENUE - DAY\n\nSpeeding up, Carson precariously cuts in between traffic.\n\n\t\t\t\tCARSON\n\t\t\t(to himself)\n\t\tNot just now, dear...\n\nSeeing Carson approaching on his right, Javal pulls his Benelli\nshotgun from one of the saddlebags. He rests the barrel on his\narm and FIRES a blinding-white load of magnesium at Carson.\n\nCarson grabs the brake handles to slow down, and the BLAST\ncrosses just in front of him. A few BURNING pieces pepper the\nfront fender of the bike, but the bulk HITS the concrete art-\ndeco statue in the entrance to the Hollywood Bowl. The statue\nshatters into a million FLAMING fragments.\n\n\t\t\t\tCARSON\n\t\t\t(continuing; grumbling)\n\t\tI coulda had a ranch... maybe some\n\t\thorses... but no, we moved to L.A.\n\nJAVAL\n\nspeeds up. A car passing on the right BUMPS him. Javal grabs\nfor the handlebar to stabilize himself, DROPPING the shotgun.\n\nA HELICOPTER appears, and flies just above him.\n\nThen, spotting some police cars ahead, he quickly hangs a\nright, ducking onto Alta Loma Terrace.\n\nEXT.  ALTA LOMA TERRACE - DAY\n\nCarson stops at the entrance to the winding, hillside\nneighborhood, accessible only by footpaths. The area is\ncovered by thick foliage, hiding Javal from the helicopter.\n\nCarson revs down so he can listen for Javal's machine. He\nHEARS it up above and takes off, up a steep flight of stairs.\n\nNEW ANGLE\n\nJaval has reached the summit, only to find he's boxed in. He\ncan either turn around, or take the neighborhood's unique,\noutdoor elevator, housed in a free-standing, three-story\nconcrete tower.\n\nHe jumps off his bike. Carrying the saddlebags, he runs into\nthe elevator -- but it needs a key to operate.\n\nJaval comes back out, panicking.  He HEARS Carson coming up\nthe hill. He spots a GARDENER watering nearby with a hose.\n\nANGLE WITH CARSON\n\nas he reaches the summit. He sees Javal's motorcycle,\nabandoned, lying on its side...\n\nAnd then he sees the Gardener, sprawled on the ground, a\nBULLET HOLE in the center of his forehead.\n\nCarson turns off his motorcycle and pulls out his Sig 9mm. He\nmoves slowly toward the elevator tower and looks inside.\n\nHIS POV\n\nThe casement window in the back of the tower is broken. One end\nof the gardener's hose is tied to a grate, and the hose is\nhanging through the broken window.\n\nCarson looks out the window as Javal climbs down the outside of\nthe tower on the hose to High Tower Drive, the street below.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tHe's on foot, at the base of the\n\t\televator tower!\n\nBut just as Carson is about to climb down the hose...\n\n\n\nEXT.  HIGH TOWER DRIVE - DAY\n\nJaval spots a COLLEGE GIRL backing a tiny Geo out of her\ngarage. He rips her out of the car, jumps in and tears away.\n\nEXT.  ALTA LOMA TERRACE - DAY\n\nCarson jumps back on his motorcycle and starts it up.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tGoddammit! He's in a blue Geo!\n\nEXT.  HIGHLAND AVENUE - DAY\n\nIn the Geo, Javal drives out onto Highland. He muscles his way\nthrough traffic, then cuts across to Franklin.\n\nBehind him, Robbins and Walther drive along the divider lane.\n\nOn the bike, Carson emerges from Alta Loma, joining Sabatini\nand Dave in Dave's Dodge and Colonel Lee in the Mercedes as\nthey all try to catch up to Javal.\n\nThe helicopter flies ahead, then disappears past the hill\nbelow Franklin.\n\nEXT.  VINE STREET - DAY\n\nJaval hangs a hard right off of Franklin onto Vine, putting\nhim on top of a hill that drops down to Sunset.\n\nCarson and Colonel Lee close in on the Geo.\n\nSuddenly, the helicopter RISES UP from the bottom of the hill.\nIt's less than fifty feet in front of Javal, at eye level.\n\nJaval FIRES at the copter with his Beretta.\n\nColonel Lee indiscriminately FIRES his machine gun at the Geo.\n\nCarson SHOUTS at Colonel Lee, furious at his carelessness!\n\nINT.  PURSUIT COPTER - (AERIAL SHOT) - DAY\n\nColonel Lee's BULLETS trace across the cockpit of the\nhelicopter; one hits the PILOT in the neck. Clutching it with\none hand, the Pilot loses control of the copter.\n\nEXT.  VINE STREET - DAY\n\nEveryone on the road scatters to get out of the copter's way.\nIt appears as though it's going to crash onto the street, then\nit gains altitude, GYRATING wildly just above the Geo.\n\nJaval tries to move away, but one of its landing runners\nSMASHES through the top of the windshield, WEDGING itself\nagainst the inside of the Geo's roof.\n\nSnared, the little Geo is LIFTED off the ground -- instantly\ntoo high for a terrified Javal to escape from it.\n\nINT.  PURSUIT COPTER - (AERIAL SHOT) - DAY\n\nThe wounded Pilot, barely conscious, searches for safe area to\nset down -- but there are cars and people everywhere.\n\nThe Pilot wrestles his stick; his copter is almost impossible\nto control with the car hanging from it. He's fading...\n\nEXT.  VINE STREET - DAY\n\nThe copter and Geo lurch over and past the round Capitol\nRecords building, KNOCKING the spindle off the top of it.\n\nThe impact further destabilizes the copter's flight. It's\nheading right toward the 20-story Sunset Vine Tower, at the\nbottom of the hill.\n\nINT.  JAVAL'S GEO - (AERIAL SHOT) - DAY\n\nJaval, trapped inside, looks through the windshield as the\nglass and steel side of the tower looms closer. He SCREAMS.\n\nEXT.  SUNSET VINE TOWER - DAY\n\nThe copter and the Geo CRASH into the side of the Tower, 12\nfloors up. Glass blows out in all directions; the rotor\nshatters; office furnishings are blown through the hole like\nbackwash.\n\nThe Geo hangs passenger's side down from the runner.\n\nCLOSER\n\nFrom the series of jerking, slipping MOVEMENTS, it is clear\nthe copter is not going to stay where it is for long.\n\nThe Geo's passenger side door pops open. Javal, panting with\nfear, jimmies his foot against the dashboard and holds the\nsteering wheel to keep from falling out.\n\nANGLE ON VEHICLES BELOW\n\nIn the clog of traffic, cars swerve away, rapidly reverse...\nanything to get away from the area below the impact.\n\n\n\nJAVAL\n\nreacts to another SLIP. The big saddlebags of money on the\nseat start to slide toward the open door.\n\nHe gingerly reaches over to grab them... the copter SHIFTS\nagain... he loses his grip...\n\nAnd, clutching the saddlebags, he TOPPLES out of the car.\n\nWe stay with him as he FALLS 12 stories, SCREAMING...\n\nThen LANDING on top of a parking meter. It RIPS though his\nchest and he hits the sidewalk with a wet THUD.\n\nEXT.  VINE AND SUNSET - DAY\n\nCarson rushes across the street to Javal's body. The teetering\ncopter and Geo are right above it.\n\nGrimacing, Carson tries to lift Javal's body up off the\nparking meter, but it's messy, slippery work...\n\nUnable to move the body, Carson quickly searches its pockets.\nAll he finds is the now-empty prescription bottle.\n\nAbove, the copter GROANS... it's about to come loose...\n\nCarson pulls out his Sig 9mm and FIRES several times at\nJaval's right wrist, then TEARS the HAND off the body.\n\nWith a loud WRENCHING of metal, the copter and Geo break away\nfrom the building.\n\nCarson grabs the saddlebags and runs like hell across the\nstreet, diving for cover behind a car.\n\nBEHIND CARSON\n\nthe copter and Geo crash to the sidewalk and EXPLODE.\n\nNEW ANGLE\n\nSooty, covered in Javal's blood, Carson crosses to the others.\nHe throws Walther the saddlebags and Sabatini the severed hand.\n\n\t\t\t\tCARSON\n\t\tFingerprint it.\n\t\t\t(to Walther)\n\t\tHe's not gonna tell us where to find\n\t\tthe hostages...\n\t\t\t\t-more-\n\n\t\t\t\tCARSON (Cont'd)\n\t\t\t(looks at watch)\n\t\tMeaning we got exactly 80 minutes to\n\t\tfigure it out for ourselves.\n\n\t\t\t\tWALTHER\n\t\tFigure it out?! With what?!\n\n\t\t\t\tCARSON\n\t\t\t(ignores him; into radio)\n\t\tMiranda! We need a copter, pronto!\n\t\t\t(to Robbins)\n\t\tGet back to his van. There were no\n\t\tplates, but check the VIN, look it\n\t\tover, then meet us at the Consulate.\n\nRobbins is still trying to process what just happened.\n\n\t\t\t\tCARSON\n\t\t\t(continuing)\n\t\tGo!\n\n\t\t\t\t\t\t\tCUT TO:\n\nINT.  NORTH KOREAN CONSULATE - AMBASSADOR HAN'S OFFICE - DAY\n\nThe clock reads 3:50 PM. Carson, Miranda, Robbins, Sabatini,\nAmbassador Han and Colonel Lee are all TALKING at once.\n\n\t\t\t\tCARSON\n\t\t\t(to Walther)\n\t\t...Scrounge us some bodies: National\n\t\tGuard, State Troopers, CHPs, local\n\t\tPD's, meter maids --\n\n\t\t\t\tWALTHER\n\t\t-- They're gonna search the whole\n\t\tcity in a goddamn hour..?!\n\n\t\t\t\tCARSON\n\t\tLook, I don't need you to tell me\n\t\thow fucked we are!\n\n\t\t\t\tWALTHER\n\t\tFuck you!! Every time you're on a\n\t\tcase something explodes!\n\nCarson looks like he's going to explode. Before he can reply:\n\n\t\t\t\tMIRANDA\n\t\tStop! The clock's running! Arguing\n\t\tis a luxury we can't afford!\n\t\t\t\t-more-\n\n\t\t\t\tMIRANDA (Cont'd)\n\t\t\t(looks at Carson)\n\t\tWhat's done is done. There'll be\n\t\tplenty of time to point fingers\n\t\tlater.\n\nCarson would love to get into it, but he lets it slide. He\nlooks Sabatini, wandering aimlessly with Javal's severed hand.\n\n\t\t\t\tSABATINI\n\t\tI need some fuckin' ink!!\n\nCarson grabs one of the expensive pens from Ambassador Han's\ndesk, SNAPS it in half, and hands it to her.\n\nIn the b.g. she stands at the credenza, inks the hand's fingers\nand thumb and rolls them onto a piece of letterhead paper.\n\n\t\t\t\tAMBASSADOR HAN\n\t\tThis is impossible! How can you even\n\t\tbegin to find them?\n\nGood question. All eyes go to Miranda.\n\n\t\t\t\tMIRANDA\n\t\tWell, the normal procedure is to\n\t\tnegotiate with the perpetrator...\n\nHer head is spinning. She looks at Carson.\n\n\t\t\t\tCARSON\n\t\tLet's take stock. We've got a picture\n\t\tof where he hid the family, and\n\t\trecordings of his calls --\n\n\t\t\t\tMIRANDA\n\t\t-- That's right! We can send them to\n\t\tour experts for analysis...\n\n\t\t\t\tCARSON\n\t\t\t(to Ambassador Han)\n\t\tSame with his fingerprints. But that\n\t\tmeans we need high-quality image and\n\t\tdata transmission. We can piss away\n\t\tten minutes coptering this shit to\n\t\tour offices in Westwood, or we can\n\t\tuse your surveillance equipment.\n\n\t\t\t\tCOLONEL LEE\n\t\tThere is no surveillance equipment.\n\t\tThis is a diplomatic facility --\n\n\t\t\t\tCARSON\n\t\t-- You want to play games, fine.\n\nHe turns to go. Ambassador Han turns to Colonel Lee.\n\n\n\n\t\t\t\tAMBASSADOR HAN\n\t\tTake them upstairs.\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nIn the converted attic, several North Korean ESPIONAGE AGENTS\nmonitor military and police frequencies, downlinks from remote\nwiretaps and surveillance units; short-wave, cellular, etc.\nTheir equipment, being of Chinese and Iranian manufacture, is\nhardly cutting-edge technology.\n\nColonel Lee and Ambassador Han enter. The Espionage Agents are\nsurprised when Carson, Miranda, Walther and Sabatini follow.\nWalther looks around, amazed. Carson grabs a pair of headphones.\n\n\t\t\t\tCARSON\n\t\tSouth Korean Consulate's just down\n\t\tthe street -- want to take a listen?\n\nColonel Lee pulls the phones away from him.\n\nCarson takes the page with the fingerprints from Sabatini. The\nEspionage Agents back away from her and Javal's hand.\n\n\t\t\t\tCARSON\n\t\t\t(continuing; re hand)\n\t\tShitcan that thing, will you?!\n\nShe looks around. Then, shrugging, she tosses it into a\nwastepaper basket.\n\n\t\t\t\tCARSON\n\t\t\t(continuing; to Colonel Lee)\n\t\tGot a digital scanner?\n\n\t\t\t\tCOLONEL LEE\n\t\tAnalog.\n\n\t\t\t\tCARSON\n\t\t\t(looks equipment over)\n\t\tYou might want to drop a few bucks at\n\t\tRadio Shack and get with the decade.\n\t\t\t(into radio)\n\t\tDave -- get in here. Bring your\n\t\tcomputer, a city map, and the tapes\n\t\tof the ransom calls.\n\n\t\t\t\tDAVE (VO)\n\t\t\t(thru radio)\n\t\tOn my way...\n\nHe's also HEARD, faintly, through the laser eavesdropping unit\nby the window. Carson notices, but doesn't comment.\n\n\n\n\t\t\t\tMIRANDA\n\t\t\t(to Colonel Lee)\n\t\tColonel, you saw the perp. Describe\n\t\thim to the Ambassador, see if it's\n\t\tanyone he knows.\n\nColonel Lee begrudgingly obliges. Carson dials a phone.\n\n\t\t\t\tCARSON\n\t\t\t(into phone)\n\t\tThis is Carson in L.A. There's a set\n\t\tof prints coming over. Narrow the\n\t\tsearch criteria: Male, thirties,\n\t\tCaucasian... French, Belgian, Swiss,\n\t\tmaybe Canadian. Try kidnappers and\n\t\tbombers first. We need an answer in\n\t\tfifteen minutes.\n\nEXT.  HOOVER BUILDING, WASHINGTON, DC - DAY\n\nFBI headquarters, with the Washington Monument in the b.g.\n\nINT.  HOOVER BUILDING - FINGERPRINT LAB - DAY\n\nA TECHNICIAN, wearing thick glasses, sits in front of a high-\nresolution computer monitor.\n\n\t\t\t\tFINGERPRINT TECH\n\t\t\t(into phone)\n\t\tThat yellow air out there finally\n\t\trot your brain?! It's impossible!\n\n\t\t\t\tCARSON (VO)\n\t\t\t(thru phone)\n\t\tDazzle me.\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nCarson clicks off the phone, then, as he dials another number:\n\n\t\t\t\tCARSON\n\t\t\t(to Walther)\n\t\tWe got one of the best sound guys\n\t\tright here in town...\n\t\t\t(into phone)\n\t\tNewman in Audio Analysis...\n\n\t\t\t\tDAVE (OS)\n\t\tNewman's gone.\n\nWIDER\n\nDave comes into the room.\n\n\n\n\t\t\t\tDAVE\n\t\tHe quit, couple weeks ago. Opened a\n\t\tbed and breakfast in Wyoming.\n\nCarson looks at Miranda and hangs up the phone.\n\n\t\t\t\tDAVE\n\t\t\t(continuing; looks around)\n\t\tDamn... they get HBO? I'd sure like\n\t\tto see the fight tonight.\n\n\t\t\t\tCARSON\n\t\tGet those tapes transferred to a\n\t\tsound guy. We need ambient and\n\t\tbackground analysis, the whole\n\t\tenchilada.\n\n\t\t\t\tDAVE\n\t\tEnchilada -- you saying that because\n\t\tI'm Mexican?\n\n\t\t\t\tCARSON\n\t\tNo... 'cause you're fat.\n\n\t\t\t\tMIRANDA\n\t\t\t(picks up Javal's fax)\n\t\tPhoto enhancement... Isn't there\n\t\tsome amazing tech with the LAPD --\n\n\t\t\t\tDAVE\n\t\t-- Bronsky. Transferred to Seattle\n\t\tPD a month ago.\n\n\t\t\t\tCARSON\n\t\tJesus H. Christ...\n\n\t\t\t\tSABATINI\n\t\tI'd send it to Langley. Let the CIA\n\t\tearn their keep.\n\n\t\t\t\tCARSON\n\t\tDo it.\n\nCarson tosses Javal's bloody, unlabeled prescription bottle to\nMiranda. She looks it over, runs her finger inside, tastes the\ndust on her fingertip.\n\n\t\t\t\tMIRANDA\n\t\tGiven his behavior, this orange\n\t\tresidue... I'd say Desoxyn, 25 mg.\n\t\tAmphetamines.\n\n\t\t\t\tCARSON\n\t\tAny significance?\n\n\n\n\t\t\t\tMIRANDA\n\t\tIt's consistent with the lone wolf\n\t\tscenario: A handful of these is pure\n\t\tbravery-in-a-bottle, 'til the\n\t\tpsychosis and paranoia kick in.\n\t\t\t(beat)\n\t\tWe could check pharmacy records, on\n\t\tthe remote chance he got them\n\t\tlegally... if we had a couple of\n\t\tweeks, that is.\n\n\t\t\t\tCARSON\n\t\t\t(to Sabatini)\n\t\tGet the Bureau on it.\n\n\t\t\t\tMIRANDA\n\t\tForget it. It's a waste of manpower.\n\n\t\t\t\tCARSON\n\t\tLook, goddammit, you start skipping\n\t\tno-chance-in-hell leads, we can all\n\t\tquit and go to the beach right now.\n\nSabatini looks at them -- which will it be? Miranda frowns and\nnods her okay, then spreads the L.A. map out on the table.\n\n\t\t\t\tCARSON\n\t\t\t(continuing)\n\t\tHe grabbed the family at 8:30. The\n\t\tlast certain visual we had was just\n\t\tbefore his van went into the alley\n\t\ton La Cienega at 8:42. He called the\n\t\tConsulate at 9:30.\n\n\t\t\t\tMIRANDA\n\t\tThat gives him about fifty minutes\n\t\tto get to his location, move and\n\t\tsecure the hostages, and activate\n\t\this time bomb.\n\n\t\t\t\tCARSON\n\t\tHe probably waited a while to pad\n\t\tthe time -- he wanted us know the\n\t\tfamily was still alive...\n\t\t\t(sotto; re Koreans)\n\t\t...So these crazy bastards wouldn't\n\t\tthrow a premature shit hemorrhage,\n\t\tbut he didn't want to call too soon,\n\t\teither. I say they're within 15 to\n\t\t20 minutes, via surface streets, of\n\t\twhere we last saw them.\n\nHe draws a circle on the city map: Beverly Hills to downtown,\nHollywood to Inglewood.\n\n\n\n\t\t\t\tMIRANDA\n\t\tThe most densely-populated part of\n\t\tthe L.A. basin. This narrows it down\n\t\tto about 200,000 dwellings.\n\nA beat while this sinks in.\n\n\t\t\t\tMIRANDA\n\t\t\t(continuing)\n\t\tHe was traveling west --\n\n\t\t\t\tCARSON\n\t\t-- Bet he doubled back.\n\n\t\t\t\tMIRANDA\n\t\tC'mon, that's total conjecture --\n\n\t\t\t\tSABATINI\n\t\t\t(re Carson)\n\t\t-- I'd trust his instincts when\n\t\tdealing with maniacs. He is deeply\n\t\tdisturbed.\n\n\t\t\t\tMIRANDA\n\t\tYou're telling me?\n\nINT.  WHITE HOUSE - CONFERENCE ROOM - DAY\n\nEveryone is smoking. Their tension has increased tenfold since\nwe last saw them. The President, SEEN through the video setup,\nis pacing on Air Force One.\n\n\t\t\t\tSECRETARY OF STATE\n\t\t...North Koreans have gone ballistic,\n\t\taccusing us of botching the ransom\n\t\tdrop on purpose.\n\n\t\t\t\tSECRETARY OF DEFENSE\n\t\tThey're still harping on that\n\t\t\"American plot\" nonsense.\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tMeaning?\n\n\t\t\t\tSECRETARY OF DEFENSE\n\t\tThey say the death of the Premier's\n\t\tniece and her family would justify\n\t\timmediate retaliation.\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tAre they out of their fuckin' minds?!\n\t\tWhat kind of retaliation?\n\nEveryone in the room looks at one another.\n\n\n\n\t\t\t\tCIA CHIEF\n\t\tThey're threatening to pull a Saddam\n\t\tHussein: remember the Scuds he lobbed\n\t\tat Jerusalem during Desert Storm?\n\t\t\t(beat)\n\t\tThey're talking about firing a\n\t\tmissile into Los Angeles --\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\t-- A goddamn WHAT??\n\n\t\t\t\tINTELLIGENCE OFFICER\n\t\tBest guess is an AS-15, medium-range\n\t\tcruise -- their version of our\n\t\tTomahawk, launched from offshore.\n\n\t\t\t\tSECRETARY OF DEFENSE\n\t\tThe AS-15 is gyro-guided. It will\n\t\tfind the city, but it's not too\n\t\taccurate beyond that.\n\n\t\t\t\tVICE PRESIDENT\n\t\tStill, for their purposes it's\n\t\tperfect: Hit somewhere in L.A., take\n\t\tout a city block or two...\n\n\t\t\t\tSECRETARY OF STATE\n\t\tTo the eyes of the world it's a\n\t\tmeasured response -- like what Reagan\n\t\tdid to Qaddafi. But actually striking\n\t\tat an American city would be a huge\n\t\tpsychological victory for them.\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tI don't believe I'm hearing this!\n\t\t\t(beat)\n\t\tSo if we know it's coming, we can\n\t\tknock it out of the fuckin' sky!\n\n\t\t\t\tSECRETARY OF DEFENSE\n\t\tThese weapons fly subsonically, below\n\t\tradar... we don't have the defenses\n\t\tin place... If we'd had the time to\n\t\tdeploy a string of Patriot anti-\n\t\tmissile batteries across the coast --\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\t-- You're saying we got all this\n\t\tlousy hardware and can't stop one\n\t\tgoddamn missile??\n\nEveryone's silence answers his question.\n\n\n\n\t\t\t\tPRESIDENT\n\t\t\t(continuing; thru video\n\t\t\tlink)\n\t\tI want an immediate search for all\n\t\tships within range.\n\n\t\t\t\tFBI CHIEF\n\t\tWe better inform the other leaders,\n\t\tstall on the Summit --\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tThere's no reason to panic yet --\n\t\tthey can't launch until after the\n\t\tfamily's confirmed dead!\n\n\t\t\t\tCIA CHIEF\n\t\tAfraid that's not the case...\n\nThe Intelligence Officer illustrates his explanation with\nFOOTAGE and DIAGRAMS on a nearby COMPUTER SCREEN:\n\n\t\t\t\tINTELLIGENCE OFFICER\n\t\tThe North Korean Premier holds what\n\t\twe call a \"Brinksman Switch.\" He's\n\t\table to destroy a missile in flight,\n\t\tright up to the moment before it\n\t\tachieves its target.\n\n\t\t\t\tCIA CHIEF\n\t\tOur Op says they've timed their\n\t\tretaliation to hit right after 5:00.\n\n\t\t\t\tFBI CHIEF\n\t\tAnd if the family turns up okay,\n\t\tthey'll just make it self-destruct.\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tShit! I really don't need this today!\n\n\t\t\t\tVICE PRESIDENT\n\t\tWe're forgetting one thing here: the\n\t\tfamily. Intelligence is sure the\n\t\tNorth will abort their attack if Mrs.\n\t\tHan and her kids are safely returned?\n\n\t\t\t\tCIA CHIEF\n\t\tAbsolutely. Their whole game depends\n\t\ton claiming a legitimate provocation.\n\n\t\t\t\tSECRETARY OF DEFENSE\n\t\tStill, we should let them know there'd\n\t\tbe a response... if it comes to it.\n\n\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tI'd like to turn 'em into a\n\t\tradioactive parking lot.\n\n\t\t\t\tSECRETARY OF STATE\n\t\tThat's the problem: we can't. We're\n\t\tthe last superpower. Our hands are\n\t\ttied by politics, alliances, goddamn\n\t\tstacks of treaties... most we could\n\t\tdo is give 'em a \"measured response\"\n\t\tback again, or everyone starts\n\t\tcrying that we're the bullies.\n\n\t\t\t\tSECRETARY OF DEFENSE\n\t\tDamn, I miss the Cold War. Russians\n\t\twouldn't have dreamt of pulling a\n\t\tstunt like this.\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tBelieve me, the North drops one in\n\t\tmy fuckin' city, I'm dropping ten in\n\t\ttheirs. Get some bombers in the air.\n\t\tAnd don't tell me any more bad news!\n\nEXT.  HOLLYWOOD FREEWAY - DAY\n\nRobbins stands by Javal's van, on the shoulder of the freeway.\n\n\t\t\t\tROBBINS\n\t\t\t(into radio)\n\t\t...Phone company decal's a fake. DMV\n\t\tsays the van was purchased a week ago\n\t\tfrom a private party in Santa Monica.\n\t\tI called 'em; they said the guy paid\n\t\tcash, and he fits our boy's\n\t\tdescription. Signed the name \"Douglas\n\t\tMcArthur\" to the Transfer of Title.\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tCute.\n\t\t\t(to Miranda)\n\t\tHe signed the name of the Allied\n\t\tCommander during the Korean War.\n\t\tMaybe he was a political.\n\n\t\t\t\tMIRANDA\n\t\tNo. The phony ice cream truck, the\n\t\tbooby-trapped chairs... he could've\n\t\t\t\t-more-\n\n\t\t\t\tMIRANDA (Cont'd)\n\t\tdone it without half that stuff. But\n\t\tthis was going to be the score of a\n\t\tlifetime... he was showing off.\n\n\t\t\t\tCARSON\n\t\t\t(to Dave)\n\t\tWho's got those kinds of skills:\n\t\tElectronics, vehicle customizing,\n\t\tcomputers, explosives?\n\n\t\t\t\tDAVE\n\t\tMilitary. Cop, maybe. Shit, your\n\t\taverage high-school student if\n\t\tthey're so inclined. My guess is our\n\t\tperp used off-the-shelf equipment\n\t\tfor everything except the C-4, and\n\t\tthat's only slightly harder to get\n\t\tthan crack or heroin, if you know\n\t\twho to ask.\n\nEXT.  PARKER CENTER - DOWNTOWN LOS ANGELES - DAY\n\nLAPD headquarters.\n\nINT.  PARKER CENTER - VARIOUS ANGLES - DAY\n\nEveryone who can be spared, even moth-eaten SUPPORT PERSONNEL,\nhustle through the maze of hallways and get into waiting cars.\n\nEXT.  STREETS OF LOS ANGELES - VARIOUS ANGLES - DAY\n\nFrom up here, it looks like the city is one big block party.\nAccordingly, traffic is heavy and unpleasant.\n\n\t\t\t\tBOBBI (VO)\n\t\tPlease, L.A., I know we're about to\n\t\thave quite a party out there, but\n\t\tdon't forget the Golden Rule on the\n\t\troadways... News time is 3:59...\n\nINT.  NEWS COPTER - (AERIAL SHOT) - DAY\n\nBobbi looks into the TV camera, dripping with sincerity.\n\n\t\t\t\tBOBBI\n\t\tThis is Bobbi Marchfelder, your Eye\n\t\tin the Sky... back to you, Brent...\n\nThe red light on the camera goes off. Bobbi turns to the Pilot.\n\n\n\n\t\t\t\tBOBBI\n\t\t\t(continuing; furious)\n\t\tHey, dickhead... I was backlit that\n\t\tentire segment!\n\t\t\t(as if to a child)\n\t\tKeep... the sun... to my left!!\n\nThe Cameraman and the Pilot sigh at each other.\n\n\t\t\t\tBOBBI\n\t\t\t(continuing)\n\t\tWhat's new on the kidnapping rumor?\n\n\t\t\t\tCAMERAMAN\n\t\tNada. Total news blackout.\n\n\t\t\t\tBOBBI\n\t\tGo back over the hill.\n\n\t\t\t\tNEWS PILOT\n\t\tWe got the valley traffic report in\n\t\tfifteen --\n\n\t\t\t\tBOBBI\n\t\t-- \"Stalled vehicle! One lane closed!\n\t\tSig alert..!\" I'll improvise!\n\nShe takes an industrial-sized bottle of Mylanta out of her\npurse. It's fitted with a water-bottle DRINKING SPOUT. She\ntakes a huge swig and grimaces.\n\n\t\t\t\tBOBBI\n\t\t\t(continuing; to Cameraman)\n\t\tWhat are you lookin' at? I was the\n\t\tmorning anchor in Houston! And I'm\n\t\tone break away from getting out of\n\t\tthis stupid fuckin' whirlybird!\n\nINT.  BACHELOR APARTMENT - LOS ANGELES - DAY\n\nThe Han family sits in their booby-trapped chairs. Joy\ncarefully turns to her mother.\n\n\t\t\t\tJOY\n\t\tWhy us?\n\n\t\t\t\tMRS. HAN\n\t\tYou heard him -- for money.\n\n\t\t\t\tJOY\n\t\tWhat if something goes wrong?\n\n\t\t\t\tMRS. HAN\n\t\t\t(firmly)\n\t\tIt won't.\n\n\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nCarson grabs his FBI blazer off the back of a chair.\n\n\t\t\t\tCARSON\n\t\tI'm going to the kidnapping site.\n\n\t\t\t\tMIRANDA\n\t\tI want to talk to the witnesses.\n\nColonel Lee also heads for the door. Carson looks at him.\n\n\t\t\t\tCARSON\n\t\tGreat, we'll hire a bus.\n\nThey leave. Dave, meanwhile, paces, phone in hand.\n\n\t\t\t\tDAVE\n\t\t\t(into phone)\n\t\t...I know it's privileged\n\t\tinformation, goddammit! Lemme talk\n\t\tto a supervisor... You are a\n\t\tsupervisor... Lemme talk to your\n\t\tgoddamn supervisor... I told you,\n\t\tI'm with the FBI...\n\t\t\t(to Sabatini)\n\t\tCellular company says he was using a\n\t\tphone with a cloned number.\n\n\t\t\t\tSABATINI\n\t\tBig surprise. Have 'em send a list of\n\t\tthe numbers called on the account.\n\n\t\t\t\tDAVE\n\t\tThat's what I'm trying to get.\n\t\tThey're saying I need a subpoena.\n\t\t\t(into phone)\n\t\tDon't put me on hold... Don't...\n\t\t\t(pulls phone from his ear)\n\t\tI'm listening to Michael fuckin'\n\t\tBolton!\n\n\t\t\t\tSABATINI\n\t\tWalther! Get on the horn to Justice\n\t\tand deal with this!\n\nEXT.  PACIFIC OCEAN - ANGLE ON FISHING TRAWLER - DAY\n\nSUPER: Pacific Ocean. 500 miles west-northwest of Los Angeles.\n\nWe FIND a nondescript commercial fishing vessel. Up top, some\nAsian \"FISHERMEN\" crank in and stow their nets.\n\n\n\nINT./EXT.  FISHING TRAWLER - DAY\n\nComing closer, we see it's actually a disguised North Korean\nSPY VESSEL. Several MEN, working under hanging tarps, secure\na 20-foot-long missile launching track to the bow.\n\nTwo MISSILE EXPERTS install a green, cone-shaped WARHEAD of\nhigh explosives onto the nose of a 23-foot-long, short-winged\nCRUISE MISSILE. They wait for the CAPTAIN's orders...\n\nEXT.  HOLLYWOOD FREEWAY - DAY\n\nRobbins is in Javal's van, examining the innards of the remote-\ncontrol boxes. He picks up his radio.\n\n\t\t\t\tROBBINS\n\t\t\t(into radio)\n\t\tA lot of the components are made by\n\t\tthe same manufacturer -- a car\n\t\tsecurity company.\n\n\t\t\t\tCARSON (VO)\n\t\t\t(thru radio)\n\t\tJump a copter to the Consulate. See\n\t\tif the manufacturer sells to the\n\t\tpublic. Find out what shops use their\n\t\tstuff; put people on the phones with\n\t\ta description of the perp.\n\nEXT.  CRENSHAW BLVD - DAY\n\nAt the kidnapping site, the intersection is blocked off with\nyellow police tape. Several LAPD cruisers are parked nearby.\nSome COPS are interviewing the Carpool Lady.\n\nDespite this, the neighborhood's bazaar -- a sidewalk sale\nwith MUSIC, food vendors, etc. -- has half-heartedly begun.\n\nThe government helicopter HOVERS and Carson helps Miranda climb\ndown a long chain ladder. Colonel Lee follows impatiently.\n\nNEW ANGLE\n\nCarson uncovers the bodies of the Driver and the Motorist,\nlying on the sidewalk. He grimaces. Colonel Lee does not.\nMiranda wants to look, but Carson drops the cover. She picks\nit up, then turns away in horror.\n\nA young BLACK COP crosses to them. He's holding a plastic bag\nwith a spent shotgun shell in it.\n\n\t\t\t\tYOUNG COP\n\t\tInspector! Look at this...\n\t\t\t(reads from shell)\n\t\t\"Dragon's Breath..?\"\n\n\n\n\t\t\t\tCARSON\n\t\tTwelve-gauge shell filled with\n\t\tmagnesium and ignition powder. Shit's\n\t\tworse than napalm -- Geneva\n\t\tConvention outlawed it for warfare.\n\n\t\t\t\tMIRANDA\n\t\tThen how did he get it?\n\n\t\t\t\tCARSON\n\t\tEasy -- you can buy 'em mail order.\n\t\t\t(looks around)\n\t\tWhere's the Consulate's car?\n\n\t\t\t\tYOUNG COP\n\t\t\t(beat)\n\t\tUh... apparently it was stolen...\n\n\t\t\t\tCOLONEL LEE\n\t\tStolen!? What is it with you\n\t\tpeople --\n\n\t\t\t\tYOUNG COP\n\t\t\t(angry)\n\t\t-- What's this \"you people\" shit?\n\n\t\t\t\tCARSON\n\t\t\t(to Colonel Lee)\n\t\tShut up!\n\n\t\t\t\tMIRANDA\n\t\t\t(aside; to Young Cop)\n\t\tHe means all of us \"you people.\"\n\n\t\t\t\tCARSON\n\t\t\t(to Young Cop)\n\t\tFind it! How many bulletproof\n\t\tMercedes could be cruising around\n\t\tCrenshaw?\n\n\t\t\t\tYOUNG COP\n\t\tYou'd be surprised...\n\n\t\t\t\tCARSON\n\t\tI hate this fuckin' town.\n\nINT./EXT.  FISHING TRAWLER - PACIFIC OCEAN - DAY\n\nThe North Korean COMMUNICATIONS OFFICER puts down his\nheadphones and hurries on deck to the Captain. It's time.\n\nSuddenly, a BEARDED CREWMAN crosses to the Captain. He calmly\nSHOOTS him and the FIRST MATE.\n\nThe rest of the Crew is shocked. Holding his pistol on the\nCrew, the Bearded Crewman nods at the Missile Experts.\nSaluting, they remove the green warhead from the missile.\n\nTwo OTHER CONSPIRATORS, carrying a metal locker, appear from\nbelow deck. The Crew murmurs nervously as they remove from the\nlocker a red warhead and attach it to the missile.\n\nFinishing, one of the Experts pushes the firing trigger and\nthe missile WHOOSHES from its launching pad.\n\nEXT.  NORTH KOREAN CONSULATE - DAY\n\nThe government helicopter touches down behind the Consulate.\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nAmbassador Han, Walther and Sabatini are looking at a series\nof high-definition faxes spread out on a table.\n\nCarson, Miranda and Colonel Lee hurry back in. Disgusted,\nCarson throws his jacket on a chair.\n\n\t\t\t\tCARSON\n\t\tWasted trip: Witnesses say he was\n\t\tworking alone, and he was a vicious\n\t\tson of a bitch. Old news.\n\n\t\t\t\tCOLONEL LEE\n\t\t\t(to Ambassador Han)\n\t\tAnd our car was stolen.\n\n\t\t\t\tAMBASSADOR HAN\n\t\tI felt safer when I was the\n\t\tAmbassador to Libya.\n\n\t\t\t\tSABATINI\n\t\tImage enhancements came back.\n\nPOV OF PICTURES\n\nThe CIA technicians have enlarged and enhanced every part of\nthe fax deemed significant, in individual blowups.\n\nBACK TO SCENE\n\nColonel Lee is standing right beside Carson, leaning over to\nlook at the pictures. Carson looks at him, irritated.\n\n\t\t\t\tCARSON\n\t\tWe going steady?\n\n\n\n\t\t\t\tSABATINI\n\t\tThe sun position tells us the\n\t\twindows are facing northeast.\n\t\t\t(beat)\n\t\tHere's the best -- look at the glass\n\t\ton the prints hanging in the\n\t\tbackground. There's a reflection of\n\t\ta reflection, out on the street: the\n\t\tcorner of a billboard.\n\n\t\t\t\tCARSON\n\t\tLooks like the wheel of a car.\n\n\t\t\t\tMIRANDA\n\t\tWe talked about these billboards,\n\t\twhen we were car shopping! Four-\n\t\tdoor... they make a wagon, too.\n\t\t\t(beat)\n\t\tSomething Japanese... God, what was\n\t\tit? Toyota... Mazda... Honda... You\n\t\tthought it had no character.\n\n\t\t\t\tCARSON\n\t\tI thought that about all of them.\n\t\tC'mon, think, dammit!!\n\n\t\t\t\tMIRANDA\n\t\tYou think!! You were there, too!\n\nThey're stumped, and bitterly frustrated. To Sabatini:\n\n\t\t\t\tCARSON\n\t\tCall the outdoor advertising\n\t\tcompanies. Get the location of all\n\t\tthe billboards for Japanese cars\n\t\twithin our search parameters.\n\nMeanwhile, Dave and Robbins are calling car alarm shops:\n\n\t\t\t\tDAVE\n\t\t\t(into phone)\n\t\t...Peerless Auto Security. We need\n\t\tto know whether you've sold a large\n\t\tquantity of these components to any\n\t\tone customer, or whether you'd had\n\t\tany stolen recently...\n\nEXT.  PíY³NGYANG, NORTH KOREA - ESTABLISHING - DAY\n\nINT.  WORKERS' PARADISE HALL - GENERAL KAI'S OFFICE - DAY\n\nGeneral Kai stands in hushed conversation with the Army Major\nOperative and another trusted AIDE. The PHONE buzzes; the\nothers leave the room before General Kai picks it up.\n\n\n\nINT.  WORKERS' PARADISE HALL - OPERATIVE'S OFFICE - DAY\n\nBehind closed doors, the Operative LISTENS to the phone call\nwith an EAVESDROPPING RECEIVER. What he hears stuns him.\n\n\t\t\t\t\t\t\tCUT TO:\n\nEXT.  WORKERS' PARADISE HALL - ROOFTOP - DAY\n\nThe Operative is in his hiding spot with his uplink device.\n\n\t\t\t\tOPERATIVE\n\t\t\t(urgently; into device)\n\t\t...Missile heading to L.A. has a\n\t\tKipchak Warhead! Repeat: missile is\n\t\tKipchak equipped! It was switched by\n\t\torder of --\n\nA GUNSHOT rings out (OS), and the Operative's chest EXPLODES\nin blood. He pitches forward... but presses the \"transmit\"\nbutton on the uplink device before dying.\n\nOn screen it says UPLINKING... (without scrambling)... then\nanother GUNSHOT destroys it.\n\nAngry, General Kai steps INTO FRAME and kicks the Operative\nover with his foot.\n\nINT.  BACHELOR APARTMENT - LOS ANGELES - DAY\n\nMrs. Han and Joy sit motionless. Sam, on the other hand, is\ntrying not to squirm. Mrs. Han looks at him, angry.\n\n\t\t\t\tMRS. HAN\n\t\tHe asked you if you had to go...\n\nThe family becomes aware of a shrill SOUND, (OS), distant at\nfirst, but growing increasingly louder... The sound-level\nmeters all begin to creep upward...\n\nEXT.  APARTMENT BUILDING - CLOSE - DAY\n\nA team of GARDENERS has arrived on the property for their\nweekly mow, blow, and go. They have lawnmowers, edgers, blowers\n-- it's as NOISY as an aircraft carrier during takeoffs.\n\nINT.  BACHELOR APARTMENT - DAY\n\nThe SOUND is getting louder, and louder...\n\n\t\t\t\tJOY\n\t\tOh, my God...\n\nThe meters are hovering just below the red...\n\n\n\nSAM\n\npivots his head and looks at the tiny microphone, no bigger\nthan a pencil eraser, attached neatly to the headrest.\n\nHe begins chewing his wad of GUM... leans in toward the\nmicrophone, his head obscuring what he's doing...\n\nHe moves back and we see he's SEALED the front of the mic with\na small piece of the gum.\n\nAnd his meter drops to zero.\n\nWIDER\n\nSam tilts his head forward and bends his wrist upward so he\ncan get the rest of the gum out of his mouth. Then, while\nkeeping pressure on the armrest with his elbow, he moves his\nhand over to Mrs. Han. They can't quite reach each other...\n\nHe FLICKS the piece of gum and she catches it.\n\nMeanwhile, the NOISE increases. The two meters peak into the\nred... the yellow WARNING LIGHT begins to flash...\n\nMrs. Han quickly puts the gum in her mouth, bites it in half,\nand cautiously passes the remainder over to Joy.\n\nJoy puts the gum in her mouth. She tries to push it over her\nmic, but her hair is in the way. She shakes her head; some\nhair strands remain, but she covers the mic just as the\nGardeners' noise reaches a CRESCENDO...\n\nAll three sound meters sit pinned to zero. The yellow light\nstops flashing.\n\nSam, sweating, looks at his mother and sister... and starts\nlaughing. They join him: a celebration for a small victory.\n\nINT.  WHITE HOUSE - CONFERENCE ROOM - DUSK\n\nThe clock on the wall reads 7:13, eastern time. The President,\nstill on Air Force One, APPEARS on the VIDEO LINK. Cut the\ntension in the room with a knife? You'd need a chainsaw.\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tSo what the hell does \"Kipchak\" mean?\n\n\t\t\t\tINTELLIGENCE OFFICER\n\t\tUh, it's a code name... for weapons\n\t\tusing the Yersinia Pestis bacillus...\n\nHe really doesn't want to be the one telling the President\nabout this.\n\n\n\n\t\t\t\tINTELLIGENCE OFFICER\n\t\t\t(continuing)\n\t\tKipchaks were Asian nomads. In 1347\n\t\tthey attacked a Genoese fort, and\n\t\tcatapulted infected corpses over the\n\t\twalls. The Genoese who survived\n\t\tcarried the disease back to Europe...\n\t\tand it killed half the population.\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tGet to the goddamn point, Major.\n\nThe Intelligence Officer looks at the CIA Chief.\n\n\t\t\t\tCIA CHIEF\n\t\tSeems the missile is armed with a\n\t\twarhead carrying the Pneumonic\n\t\tPlague.\n\nThe President goes nuts.\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tThe Black Plague?! Every time I talk\n\t\tto you fuckin' guys it gets worse!\n\t\tWhat happened to this \"limited\n\t\tretaliation\" shit?\n\n\t\t\t\tSECRETARY OF STATE\n\t\tThe North Koreans insist the missile\n\t\tcarries a conventional payload. They\n\t\tsay we're trying to trick them into\n\t\taborting the attack.\n\n\t\t\t\tSECRETARY OF DEFENSE\n\t\tEspecially since the uplink from our\n\t\tOp in P'yÚngyang was unencrypted.\n\n\t\t\t\tCIA CHIEF\n\t\tWe think one of the Hard-liners\n\t\tswitched the warhead without the\n\t\tPremier's knowledge. But he's not\n\t\tabout to take our word for it, and\n\t\the's too weak to risk the\n\t\thumiliation of backing down.\n\n\t\t\t\tPRESIDENT\n\t\t\t(incredulous; thru video\n\t\t\tlink)\n\t\tThey use a biological weapon on\n\t\tAmerican soil, they have to know\n\t\twe'll respond!\n\n\n\n\t\t\t\tSECRETARY OF STATE\n\t\tMaybe they don't think we got the\n\t\tguts. Maybe they want a war, 'cause\n\t\tthey think they can whip us, like\n\t\twhat happened in 'Nam. Look who\n\t\twe're dealing with: a teetering,\n\t\toutlaw regime, and inside it, some\n\t\twild-ass renegades working their\n\t\tscrewy agenda!\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tWhat the hell are we doing in L.A.?\n\n\t\t\t\tSECRETARY OF DEFENSE\n\t\tWe've deployed Marines from Pendleton\n\t\tand Twenty-Nine Palms, Army from Ft.\n\t\tIrwin, put 'em in protective suits,\n\t\tbut it's 40 minutes before they're on\n\t\tthe ground.\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tAll right. Assuming the worst...\n\t\tWhat'll happen?\n\nThe Intelligence Officer demonstrates with another of his\nCOMPUTER GRAPHICS.\n\n\t\t\t\tINTELLIGENCE OFFICER\n\t\tThe warhead vents the plague\n\t\tbacteria above the target area,\n\t\tinfecting about 50,000 people. First\n\t\tsymptoms are vomiting, lymph nodes\n\t\tbecome swollen; temperature rises to\n\t\t105\u0083. Victims turn deep purple from\n\t\tlung hemorrhaging, usually die the\n\t\tsame day.\n\t\t\t(beat)\n\t\tThere are treatments -- streptomycin\n\t\tand tetracyclines -- but we'd be\n\t\toverwhelmed by the numbers and its\n\t\textreme contagiousness.\n\n\t\t\t\tCIA CHIEF\n\t\tWe could have 500,000 infected in a\n\t\tweek, who knows how many after that.\n\nLong beat as everyone tries to contemplate the unthinkable.\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tI'm gonna toast those fuckers! Have\n\t\tthe Summit leaders been warned?\n\n\n\n\t\t\t\tFBI CHIEF\n\t\tYes, sir... no one's landing in L.A.\n\t\t'til we give the all-clear.\n\n\t\t\t\tPRESIDENT\n\t\t\t(thru video link)\n\t\tAnd you're sure it's safe if we can\n\t\tget 'em to destroy the missile in\n\t\tflight?\n\n\t\t\t\tINTELLIGENCE OFFICER\n\t\tThe bacteria can't survive the heat\n\t\tof an explosion.\n\n\t\t\t\tCIA CHIEF\n\t\tI suggest none of this go any\n\t\tfurther -- not even to the agents\n\t\tworking to find the family. Word\n\t\tleaks out to a city of 12 million\n\t\tpeople there's rocket full of the\n\t\tPlague coming at 'em, you'll create\n\t\ta panic of biblical proportions.\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nEveryone is painfully on edge. Ambassador Han paces. The FBI\nagents are on a phone or a radio, working leads.\n\nColonel Lee mutters something to Ambassador Han in Korean.\n\n\t\t\t\tCARSON\n\t\tSay what?\n\n\t\t\t\tCOLONEL LEE\n\t\tPerhaps someone will decide it is\n\t\tfoolish to incur the wrath of North\n\t\tKorea.\n\n\t\t\t\tCARSON\n\t\t\t(crosses to Colonel Lee)\n\t\tYeah, the U.S. is behind the whole\n\t\tthing. And we're knocking our heads,\n\t\ttrying to find your people, just for\n\t\tshow.\n\n\t\t\t\tWALTHER\n\t\tCarson...\n\n\t\t\t\tCARSON\n\t\tLet's grab a few beers, kick back\n\t\t'til five o'clock rolls by. Then\n\t\tmaybe we can have a war over it. I\n\t\tthink that's a great idea, seeing as\n\t\thow you fuckers have needed your\n\t\tclocks cleaned for fifty years now!\n\n\n\n\t\t\t\tCOLONEL LEE\n\t\t\t(gets up)\n\t\tWhy wait until five?\n\nAmbassador Han and Walther keep Carson and Colonel Lee from\ngoing at each other.\n\n\t\t\t\tMIRANDA\n\t\tPete!\n\t\t\t(sotto)\n\t\tChrist, you're self-indulgent!\n\t\tThere's nothing but anger and\n\t\tcynicism left inside you, so they're\n\t\tall you can express any more. No\n\t\twonder everyone in the Bureau thinks\n\t\tyou're such a nutcase!\n\n\t\t\t\tCARSON\n\t\tHey, I'm not the only one with a rep\n\t\taround the office... \"Dr. Knoll-It-\n\t\tAll.\"\n\n\t\t\t\tMIRANDA\n\t\t\t(hurt)\n\t\tYou've been dying to tell me that...\n\nShe walks away. Carson immediately regrets saying it.\n\n\t\t\t\tCARSON\n\t\tMiranda...\n\t\t\t(to himself)\n\t\tShit.\n\nEXT.  STREETS OF LOS ANGELES - VARIOUS ANGLES - DAY\n\nLAPD cruisers squeeze through the crowded streets, fanning out\nthrough the various parties around town. COPS walk through the\ncrowds with copies of the picture Javal faxed, and photos of\nthe Han family and Lisa.\n\nEXT.  SKY OVER PACIFIC OCEAN - DAY\n\nThe red-tipped cruise missile, flying at 550 MPH, 400 feet\nabove the water, streaks toward its distant target.\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nRobbins is still working the phone.\n\n\t\t\t\tROBBINS\n\t\t\t(into phone)\n\t\t...Yeah, Peerless Auto Security...\n\t\tfine... get your manager...\n\nHe puts the receiver down, hits the speakerbox button and the\nmute button. He crosses to Dave's desk to grab some papers.\n\nWe can hear the CONVERSATION at the alarm shop:\n\n\t\t\t\tINSTALLER #1 (VO)\n\t\t\t(thru speakerbox; muffled)\n\t\tTell Jerry, pick up line one!\n\nINT.  AUTO SECURITY SHOP - DAY\n\nA group of young INSTALLERS horse around as they outfit luxury\ncars with security systems, high-end audio components, etc.\n\n\t\t\t\tINSTALLER #2\n\t\tJerry's outta here!\n\n\t\t\t\tINSTALLER #1\n\t\tSome cop's asking if we sold a bunch\n\t\tof Peerless parts.\n\n\t\t\t\tINSTALLER #2\n\t\tTalk to Javal!\n\n\t\t\t\tINSTALLER #1\n\t\tJaval's off today.\n\n\t\t\t\tINSTALLER #3\n\t\tDude's off a lot.\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\n\t\t\t\tINSTALLER #4 (VO)\n\t\t\t(thru speakerbox)\n\t\tHe's used to it -- fuckin' Frenchies\n\t\tget the whole summer off.\n\n\t\t\t\tINSTALLER #2 (VO)\n\t\t\t(thru speakerbox)\n\t\tMan's Canadian, dickweeds!\n\n\t\t\t\tINSTALLER #1 (VO)\n\t\t\t(thru speakerbox)\n\t\tYou're gonna have to call back on\n\t\tMonday...\n\nCarson rushes over to the phone. To the others in the room:\n\n\t\t\t\tCARSON\n\t\tEveryone shut up!\n\t\t\t(into phone)\n\t\tGuy on vacation, the Canadian --\n\n\t\t\t\tINSTALLER #1 (VO)\n\t\t\t(thru speakerbox)\n\t\t-- Yeah, Javal...\n\n\n\n\t\t\t\tCARSON\n\t\t\t(into phone)\n\t\tSix foot, sandy hair, spooky eyes?\n\n\t\t\t\tINSTALLER #1 (VO)\n\t\t\t(thru speakerbox; laughs)\n\t\tZombie Eyes! You know the man?\n\nCarson and Miranda look at each other. Bingo!\n\n\t\t\t\tCARSON\n\t\t\t(into phone)\n\t\tI need a full name, address,\n\t\tanything you got!\n\n\t\t\t\tINSTALLER #1 (VO)\n\t\t\t(thru speakerbox)\n\t\tPaul Javal... hang on, we'll look it\n\t\tup... This an immigration thing?\n\t\tShit, he's our best installer.\n\nNEW ANGLE\n\nOne of the Korean Espionage Agents answers a RINGING phone on\nColonel Lee's desk, listens, then hits the hold button.\n\n\t\t\t\tESPIONAGE AGENT\n\t\tInspector Carson, extension 666...\n\n\t\t\t\tCARSON\n\t\tThat's appropriate...\n\t\t\t(to Dave)\n\t\tIn 30 seconds you're gonna give me\n\t\tPaul Javal's shoe size.\n\nCarson hurries over, grabs the phone. We SEE him punch the\nbutton for x666.\n\n\t\t\t\tCARSON\n\t\t\t(continuing; into phone)\n\t\tCarson...\n\nEXT.  FEDERAL BUILDING, WESTWOOD - ESTABLISHING - DAY\n\n\t\t\t\tEDWARDS (VO)\n\t\tEdwards, Sound Lab...\n\nINT.  FBI SOUND LAB - DAY\n\nEDWARDS, headphones around his neck, sits in front of a wall\nof audio analysis equipment.\n\n\t\t\t\tCARSON (VO)\n\t\t\t(thru phone)\n\t\tWhatta you got?\n\n\n\n\t\t\t\tEDWARDS\n\t\t\t(into phone)\n\t\tAmbient background sound is normal\n\t\tcity stuff, but there's a distinct\n\t\techo pattern. Your people are in or\n\t\tnear a high-rise that's at least\n\t\teight floors tall. And there are\n\t\tother high-rises nearby.\n\n\t\t\t\tCARSON (VO)\n\t\t\t(thru phone)\n\t\tHow high up are they?\n\n\t\t\t\tEDWARDS\n\t\t\t(into phone)\n\t\tNo way to extrapolate that from the\n\t\tsample you gave us.\n\t\t\t(refers to notes)\n\t\tOne more thing: There's an emergency\n\t\tsiren approaching at 17 seconds into\n\t\tthe second call, passing the location\n\t\tat 33.5 seconds.\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nCarson hangs up the phone.\n\n\t\t\t\tCARSON\n\t\tOkay -- high-rises in our search\n\t\tarea. Eight stories or higher.\n\n\t\t\t\tMIRANDA\n\t\tDowntown, Century City, Westwood\n\t\tcorridor, Museum Row, Mid-\n\t\tWilshire... North of Sunset Strip\n\t\tthere's a few...\n\n\t\t\t\tCARSON\n\t\tSabatini! What about that billboard?\n\n\t\t\t\tSABATINI\n\t\tNothing yet! Everyone's left their\n\t\tgoddamn offices already!\n\n\t\t\t\tCARSON\n\t\t\t(to Robbins)\n\t\tLAPD will have a record of all\n\t\temergency vehicles running Code 3 at\n\t\t9:32 AM. Get their starting point\n\t\tand their destination.\n\n\t\t\t\tMIRANDA\n\t\tAnd have them narrow their foot-\n\t\tsearches to areas around high-rises.\n\n\n\n\t\t\t\tCARSON\n\t\t\t(to Dave)\n\t\tWhere's that fuckin' address?!\n\n\t\t\t\tDAVE\n\t\tI'm still holdin'!\n\nMeanwhile, we hear the high-pitched whine as Dave's MODEM\nconnects with another computer. Dave's fingers fly across the\nkeyboard, and in a moment, a PICTURE of Javal appears: hair\nlonger, bearded... but the eyes are unmistakable.\n\n\t\t\t\tDAVE\n\t\t\t(continuing)\n\t\tHe's on our hit parade. Interpol\n\t\tpassed us his records when he\n\t\tentered the country.\n\t\t\t(reads)\n\t\tFrench by birth... looks like a total\n\t\tscumbag.\n\n\t\t\t\tSABATINI\n\t\tIsn't that redundant?\n\n\t\t\t\tDAVE\n\t\t\t(reads from computer)\n\t\tRaised in Quebec. Moved to Europe;\n\t\tserved some short stretches, petty\n\t\tshit... arrested for kidnapping, no\n\t\tconviction. Did four years in France\n\t\tfor blowing bank vaults. Moved to\n\t\tU.S. last year. Clean since then.\n\n\t\t\t\tCARSON\n\t\tGet his Driver's License number;\n\t\tSocial; bank accounts; charge cards;\n\t\tclub memberships... find out what\n\t\tmovies he rented.  Get whoever's\n\t\tclosest to the Auto Shop to get in\n\t\tthere, interview everybody.\n\n\t\t\t\tMIRANDA\n\t\tThis sure was a ballsy move for a\n\t\tcar-alarm installer.\n\n\t\t\t\tCARSON\n\t\tHey, he watched the news... Everyone\n\t\tknows the U.S. will do anything to\n\t\tavoid trouble with a mad-dog country.\n\nThey turn, noticing that Ambassador Han has overheard.\n\n\t\t\t\tMIRANDA\n\t\tAmbassador --\n\n\n\n\t\t\t\tCARSON\n\t\t-- Quit apologizing for me!\n\n\t\t\t\tMIRANDA\n\t\tQuit giving me reasons to!\n\n\t\t\t\tAMBASSADOR HAN\n\t\t\t(to Carson)\n\t\tOn occasion, my wife has been known\n\t\tto kick my ankle under the table.\n\nMiranda gives Carson a \"your turn to be gracious\" look.\n\n\t\t\t\tCARSON\n\t\tSounds like her aim's a little low.\n\nNot exactly what Miranda was hoping for. Dave hands Carson a\npiece of paper.\n\n\t\t\t\tDAVE\n\t\tAddress, according to the Auto Shop.\n\n\t\t\t\tCARSON\n\t\t\t(looks at paper)\n\t\tApartment 1060! He's in a high-rise!\n\t\tSabatini -- you're with us.\n\t\t\t(off Robbins' disappointed\n\t\t\tlook)\n\t\tShe's got the field experience.\n\nCarson and Miranda grab their jackets, then she stops.\n\n\t\t\t\tMIRANDA\n\t\tThere still could be accomplices.\n\t\tIf there are, they'll hear us in\n\t\tthe helicopter.\n\nCarson looks again at the address...\n\n\t\t\t\tCARSON\n\t\tThere's a TV station a couple blocks\n\t\taway. We'll land on their pad.\n\t\t\t(to Robbins)\n\t\tK-EYE. Clear it with 'em. Have a\n\t\tSWAT team assemble, but tell 'em to\n\t\thang back unless we need 'em.\n\nEXT.  OSAKA, JAPAN - ESTABLISHING - DAY\n\nSUPER: Osaka. Western Japan.\n\nINT.  OSAKA APARTMENT - DAY\n\nIn the tiny bedroom of a wheelchair-bound JAPANESE TEENAGER,\ncomputers and HAM RADIO equipment are stacked everywhere.\n\nHe turns on a tape recorder. We hear a faint, crackling VOICE:\n\n\n\n\t\t\t\tOPERATIVE'S VOICE (VO)\n\t\t\t(on recorder)\n\t\t...Missile heading to L.A. has a\n\t\tKipchak Warhead! Repeat: missile is\n\t\tKipchak equipped!\n\nThe Teenager rolls to a computer running CompuServe. He clicks\nthe CHAT icon, types: \"Anyone up on their spy terminology?\"\n\nINT.  BACHELOR APARTMENT - LOS ANGELES - DAY\n\nWith the gardeners gone, and their sound sensors disabled,\nMrs. Han, Joy and Sam are SHOUTING for help.\n\nThey listen for a response; it is completely quiet.\n\nEXT.  K-EYE STUDIOS - LANDING PAD - LOS ANGELES - DAY\n\nJust as the government helicopter lands, Bobbi's news copter\nlands right next to it.\n\nBobbi intercepts Carson, Sabatini, Miranda and Colonel Lee on\nthe pad. Her Cameraman follows, ENG camera on his shoulder,\nvideotaping everything.\n\n\t\t\t\tCARSON\n\t\tOh, great, the media...\n\t\t\t(realizing)\n\t\tIt's the goddamn traffic girl!\n\n\t\t\t\tMIRANDA\n\t\tTraffic person.\n\n\t\t\t\tBOBBI\n\t\tWhere are you going?\n\n\t\t\t\tCARSON\n\t\tWe can't get into that right now...\n\n\t\t\t\tBOBBI\n\t\tHey, you expect to use my station's\n\t\tfacilities and not even tell us --\n\nCarson grabs the ENG camera, pops the videotape out of it and\ncrushes the tape.\n\n\t\t\t\tMIRANDA\n\t\t\t(to Bobbi)\n\t\tSorry...\n\n\n\n\t\t\t\tBOBBI\n\t\t\t(looks Miranda over)\n\t\tWhat the fuck are you, the Barbie\n\t\tCorporate Ass-Lick model?\n\nMiranda is utterly aghast. She reaches under Carson's jacket\nand takes the handcuffs off his shoulder rig. She grabs Bobbi\nby the arm and gets her in a half-Nelson.\n\n\t\t\t\tMIRANDA\n\t\tGuess what, Sister... you're about\n\t\tto spend the next five years in a\n\t\tpenitentiary for interfering with a\n\t\tfederal investigation.\n\nThe STATION MANAGER comes running out of the building.\n\n\t\t\t\tSTATION MANAGER\n\t\tBobbi! I promised we'd respect their\n\t\tnews blackout!\n\n\t\t\t\tBOBBI\n\t\t\t(to herself)\n\t\tFigures... you dickless wonder.\n\nBobbi wriggles out of Miranda's grasp. Carson looks at his\nwife, who's still fuming, and smiles to himself.\n\nThe Station Manager hands Carson the keys to his Lexus.\n\n\t\t\t\tSTATION MANAGER\n\t\tI get an exclusive later, right?\n\n\t\t\t\tCARSON\n\t\tThis works out, I'll play the\n\t\tfuckin' banjo for you.\n\nEXT.  SKY OVER PACIFIC OCEAN - DAY\n\nThe cruise missile makes a slight course adjustment.\n\nEXT.  STREETS OF LOS ANGELES - VARIOUS ANGLES - DAY\n\nPeople begin to arrive at the events. BOOSTERS pass out food,\nwine and beer... and crank up the Beach Boys TUNES.\n\nMeanwhile, law enforcement cars move into the areas with high\nrises -- Century City, Westwood, downtown, etc.\n\nEXT.  U.S. AIR BASE - VARIOUS ANGLES - DAY\n\nA sign on the control tower reads: U.S. Air Force, Okinawa.\n\nFlight Crews direct a squadron of planes out onto the flight\nline: F-16 fighter bombers, along with F-15 fighter escorts.\n\nThey begin to TAKE OFF...\n\n\n\nEXT.  FOUNTAIN AVENUE - DAY\n\nThe Lexus is stuck in a dense knot of traffic.\n\nCarson gets out and walks across the hoods of the stopped\nvehicles around him -- to much COMPLAINING by their owners --\nuntil he finds the reason for the jam-up:\n\nAlong the shoulder of the road, a long line of equipment\ntrailers and motor homes, cables, lights, rent-a-cops and\ngawkers. A MOVIE SHOOT. Carson groans.\n\nHe hurries back to the Lexus. Miranda rolls her window down.\n\n\t\t\t\tCARSON\n\t\tWe're hoofing it.\n\nMiranda and Colonel Lee immediately get out of the car and run\noff, leaving Sabatini to contend with it.\n\n\t\t\t\tSABATINI\n\t\t\t(pissed)\n\t\t'She's got the field experience'...\n\t\tTo park the fuckin' car!\n\nEXT.  MIMOSA APARTMENTS - DAY\n\nA boxy, ten-story complex built in the sixties.\n\nINT.  MIMOSA APARTMENTS - DAY\n\nCarson, (FBI jacket folded over his arm) Miranda, and Colonel\nLee rush into the lobby.\n\nCarson is about to show the CONCIERGE behind the desk his i.d,\nbut the Concierge is nervous and sweating. Carson pulls out\nhis Sig 9mm, approaches the door behind the desk, which is\najar... He pushes it open...\n\nAnd finds himself staring at the muzzles of three M-16 rifles.\n\nThree SWAT TEAM members are standing there in full body armor.\n\n\t\t\t\tCARSON\n\t\t\t(pulls out his i.d.)\n\t\tWhoa... FBI..!\n\nThey lower their weapons.\n\n\t\t\t\tCARSON\n\t\t\t(continuing)\n\t\tHow the hell you get here so fast?\n\n\n\n\t\t\t\tSWAT TEAM #1\n\t\tThey're shootin' a cop movie down\n\t\tthe street. We're workin' as extras.\n\n\t\t\t\tCARSON\n\t\tTerrific. Who else is here?\n\n\t\t\t\tSWAT TEAM #1\n\t\tThree officers on the roof, next\n\t\tbuilding over, and two in the tenth-\n\t\tfloor hallway.\n\n\t\t\t\tCARSON\n\t\tTell 'em to be cool. We're going up.\n\t\t\t(to Concierge)\n\t\tGive me your master key.\n\nEXT.  ADJACENT APARTMENTS - DAY\n\nThe SWAT team SHARPSHOOTERS crouch on the roof.\n\n\t\t\t\tSWAT TEAM #1\n\t\t\t(thru radio)\n\t\tFeds going up -- Anglo male and\n\t\tfemale; Asian male.\n\nINT.  MIMOSA APARTMENTS - UNDERGROUND PARKING LOT - DAY\n\nSabatini drives the Lexus in and parks it in the fire lane.\n\nINT.  MIMOSA APARTMENTS - HALLWAY - DAY\n\nThe fire door opens next to an elevator with the number \"10\"\non it, and Carson, Miranda and Colonel Lee come out.\n\nCarson and Miranda creep quietly along the hallway, toward\napartment 1060. Carson listens at the door, hears nothing.\n\nHe moves to the next door down, apartment 1058, and quietly\nunlocks the door.\n\nINT.  MIMOSA APARTMENTS - #1058 - DAY\n\nThe shades are drawn, and the apartment is dark.\n\nAs Carson and Miranda cut through the apartment, they realize\nthere's a WOMAN lying in the bed. She's naked, and she's not\nalone. Someone is under the sheets. ANOTHER WOMAN.\n\nThe first Woman opens her eyes, sees the intruders, and grabs\nfor a Colt Gold Cup .45 auto in the dresser drawer.\n\n\t\t\t\tWOMAN\n\t\tWhat the fuck..!\n\nHer friend sits up. Miranda holds her finger to her lips and\nshows them her FBI shield.\n\n\t\t\t\tMIRANDA\n\t\tSorry...\n\nCarson cranks open their window and steps out onto the foot-\nwide, ornamental balcony.\n\n\t\t\t\tCARSON\n\t\t\t(to Miranda)\n\t\tWait here.\n\nShe begins to protest. He shoots her a look that silences her.\n\nEXT.  MIMOSA APARTMENTS - DAY\n\nThe SWAT sharpshooters watch from the next building over as\nCarson, ten floors up, peers through the slit in between the\ncurtains into the window of Javal's apartment.\n\nHe swings his legs over onto Javal's ornamental balcony... the\nbolts holding the rail onto the wall are loose and rusty...\nthe balcony SLIPS a little...\n\nHe leans on the crank-operated window until it SNAPS open.\n\nINT.  MIMOSA APARTMENTS - JAVAL'S APARTMENT - DAY\n\nCarson steps inside. He looks around the bedroom -- it's\nempty. No furnishings, the closet shelves are bare, even the\npictures on the walls are gone, leaving only their outline.\n\nCarson cautiously goes into the living room --\n\nIt's also empty. All that remains are a few cardboard boxes,\nand three flower pots in macramÈ ceiling hangers by the living\nroom window. Some dead leaves lie on the floor beneath them.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tI'm in. It's empty, but sit tight\n\t\twhile I look around.\n\nCarson cautiously approaches the cardboard boxes.\n\nINT.  MIMOSA APARTMENTS - #1058 - DAY\n\nThe clock on the bedstand reads 4:25. Miranda smiles\nuncomfortably at the two naked women together in bed.\n\n\t\t\t\tMIRANDA\n\t\tI like what you've done with the\n\t\tplace...\n\n\n\nINT.  MIMOSA APARTMENTS - HALLWAY - DAY\n\nThe elevator DINGS. Sabatini comes out, H&K MP-5 in hand.\n\nSWAT Team #2, standing on the far side of the hallway with\nColonel Lee, sees her machine pistol and takes aim.\n\n\t\t\t\tCOLONEL LEE\n\t\tWait!\n\nColonel Lee walks over to Sabatini.\n\n\t\t\t\tSABATINI\n\t\tWhere's Carson?\n\n\t\t\t\tCOLONEL LEE\n\t\tInside.\n\nSabatini starts down the hall. Colonel Lee stays where he is.\n\nINT.  MIMOSA APARTMENTS - JAVAL'S APARTMENT - DAY\n\nCarson cautiously peers in the moving boxes. They're empty.\n\nHe crosses to the front door, looks it over, unlocks the\ndeadbolt. He turns the knob, the button POPS open...\n\nHe stops, noticing a HAIRLINE SEAM in the doorjamb where a\npiece was cut, then neatly replaced.\n\nThen, he's startled as he hears a strange, mechanical whining\nNOISE coming from the kitchen.\n\nHe goes to investigate -- it's an almost-dead, avocado-green\nrefrigerator straining to start its compressor. He looks for\nbooby-traps, opens it, and looks inside. Empty.\n\nLooking down, he notices he's got a dead leaf stuck to the\nbottom of his shoe.\n\nGlancing in the living room, he sees the dead leaves on the\nfloor below the three hanging plants. He looks at the plants:\ntwo are dead. The one in the middle is not. It's plastic.\n\nWe HEAR the jiggle of the front doorknob.\n\n\t\t\t\tCARSON\n\t\tNO! --\n\nToo late... The front door opens....\n\nCarson crouches behind the big, heavy refrigerator door...\n\nAs the middle flower pot EXPLODES. It's a shrapnel bomb: it\nspews thousands of tiny carpet tacks 360 degrees around room.\n\nSabatini is HIT full on -- she falls backwards into the hall.\n\n\n\nINT.  MIMOSA APARTMENTS - #1058 - DAY\n\nMiranda and the women in the darkened bedroom SCREAM as the\ntacks tear hundreds of HOLES through sections of the wall.\n\nTiny shafts of LIGHT appear in the wall, except where it is\ncovered by furniture (keeping them from being shredded.)\n\nINT.  MIMOSA APARTMENTS - HALLWAY - DAY\n\nSWAT Team #2 and Colonel Lee come running, as does Miranda.\n\nCarson is kneeling next to Sabatini. She looks up at him and\ntries to say something, but a only long, mournful, final\nBREATH escapes her. Agonized, Carson looks around...\n\nAnd sees Colonel Lee. He lunges for him.\n\n\t\t\t\tCARSON\n\t\tI said keep everyone back!!\n\nHe punches Colonel Lee in the jaw. Colonel Lee slams against\nthe wall, then comes back at Carson, hitting him in the throat.\n\n\t\t\t\tMIRANDA\n\t\tStop it!\n\nMiranda and SWAT Team #2 pull them apart.\n\n\t\t\t\tCARSON\n\t\t\t(to Colonel Lee)\n\t\tGet out of my sight.\n\nHe kneels next to Sabatini, and closes her eyes.\n\nINT.  NEWS COPTER - (AERIAL SHOT) - DAY\n\nIt's in between reports. The Cameraman listens to the Grateful\nDead on a BOOM BOX. Bobbi answers her ringing CELL PHONE.\n\n\t\t\t\tBOBBI\n\t\t\t(into phone)\n\t\tMarchfelder.\n\n\t\t\t\tSTATION MANAGER (VO)\n\t\t\t(thru phone)\n\t\tYou dated the Mayor, right?\n\n\t\t\t\tBOBBI\n\t\t\t(sighs; into phone)\n\t\tYou need a traffic ticket fixed?\n\n\n\n\t\t\t\tSTATION MANAGER (VO)\n\t\t\t(excited; thru phone)\n\t\tTry to confirm something for us.\n\t\tThere's an incredible buzz on the\n\t\tInternet -- someone picked up a\n\t\tclassified message on a U.S.\n\t\tIntelligence frequency. We think\n\t\tit's authentic!\n\nEXT.  STREETS OF LOS ANGELES - VARIOUS ANGLES - DAY\n\nThe streets of Hollywood are even more congested than before,\nas the festivities really start rockin'.\n\nINT.  GOVERNMENT HELICOPTER - (AERIAL SHOT) - DAY\n\nCarson and Miranda sit together in the back and Colonel Lee\nsits next to the Pilot as they fly back to the Consulate.\n\nMiranda looks at Carson, who's trying real hard not to let\nSabatini's death slow him down.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tWhat's the status?\n\n\t\t\t\tROBBINS (VO)\n\t\t\t(thru radio)\n\t\tWilshire and West PD Divisions had\n\t\tseven vehicles running with sirens at\n\t\t9:32. They're getting the routes from\n\t\tthe officers now.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tHurry it the hell up.\n\nHe glances over at Miranda. After a beat:\n\n\t\t\t\tCARSON\n\t\t\t(continuing)\n\t\tI should've known she'd come up.\n\n\t\t\t\tMIRANDA\n\t\tPete --\n\n\t\t\t\tCARSON\n\t\t-- \"Should've.\" Shit, there's a\n\t\tfamiliar word.\n\t\t\t(long beat)\n\t\tThat day... I was there soon enough.\n\t\tWe should've rushed 'em, before they\n\t\tcould finish setting up...\n\n\n\n\t\t\t\tMIRANDA\n\t\tThe Bureau never would've let you.\n\t\tThey want it by the book: talk them\n\t\tout.\n\nCarson looks out the window, not hearing a word she says...\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT./EXT.  BEVERLY THRIFT - (FLASHBACK) - DAY\n\nCarson is in the FBI command truck, talking on the phone to:\n\nA BANK ROBBER, barricaded inside the bank. Phone in hand, he\nholds a shotgun on a dozen hostages: BANK EMPLOYEES and\nCUSTOMERS -- including a couple of YOUNG KIDS. One is holding\na soccer-sized, rainbow-colored rubber ball.\n\nThe OTHER BANK ROBBER wires up a series of explosive charges.\n\nBoth Robbers rush inside the vault, and pull the door closed\nto protect themselves...\n\nThe front of the building, where the hostages are, EXPLODES.\n\nCarson runs to the bank. He spots the kid's ball, rolling in\nthe street... BURNING. He turns away, horrified, devastated...\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT.  GOVERNMENT HELICOPTER - (AERIAL SHOT) - DAY\n\n\t\t\t\tCARSON\n\t\tTwelve bodies -- only the hostages.\n\n\t\t\t\tMIRANDA\n\t\tYou were a greenhorn. It wasn't your\n\t\tdecision. You can't keep living as\n\t\tsuch a raw nerve, never sleeping --\n\n\t\t\t\tCARSON\n\t\t-- Those kids were ten years old!\n\t\t\t(sotto)\n\t\tSame age as the Han boy...\n\nHe turns away. She takes his hand.\n\nINT.  BACHELOR APARTMENT - DAY\n\nThe family continues to call for HELP. As they do, we\n\n\t\t\t\t\t\t\tCUT TO:\n\n\n\nINT.  HALLWAY JUST OUTSIDE APARTMENT - DAY\n\nTheir CRIES echo faintly through a deserted tangle of ladders,\nconstruction equipment, sheets of drywall, etc.\n\nA warning sign taped to the wall near the elevator reads:\n     \n\t\tThis Floor Has Been Temporarily Vacated\n\t\tFor Minor Earthquake Retrofitting.\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nThe mood is glum. Carson looks at Robbins, Dave and Walther,\nthen at the empty chair where Sabatini had been sitting.\n\n\t\t\t\tCARSON\n\t\tC'mon! Who's pulling Javal's bank\n\t\trecords? What about cross-referencing\n\t\tpossible aliases? We got 33 minutes!\n\nHearing Beach Boys MUSIC on the TV's and radios on the\nsurveillance console, Carson angrily punches them all off.\n\nSuddenly, Miranda looks at him:\n\n\t\t\t\tMIRANDA\n\t\tCamry! The billboard! Toyota Camry!\n\t\t\t(reaches for phone)\n\t\tWhere are the numbers for the\n\t\toutdoor ad companies?\n\n\t\t\t\tROBBINS\n\t\tParker Center's making those calls.\n\nINT.  NEWS COPTER - (AERIAL SHOT) - DAY\n\nBobbi and the News Cameraman are arguing bitterly:\n\n\t\t\t\tBOBBI\n\t\tTurn the fuckin' camera on! DO IT!!\n\n\t\t\t\tCAMERAMAN\n\t\tMaybe it's true... probably is true.\n\t\tThat's why they got a news blackout!\n\n\t\t\t\tBOBBI\n\t\tI'll rip your miserable eyeballs\n\t\tout! NEWS IS OUR FUCKIN' JOB!!\n\nHe sighs and turns the CAMERA on.\n\nINT.  BACHELOR APARTMENT - INCLUDE ANGLE ON TV - DAY\n\nThe Han family listens to Bobbi, amazed, horrified...\n\n\n\n\t\t\t\tBOBBI\n\t\t\t(on TV)\n\t\t...A warning was radioed to U.S.\n\t\tIntelligence that a biological weapon,\n\t\tallegedly containing the deadly\n\t\tPneumonic Plague, is approaching Los\n\t\tAngeles. While unconfirmed, the\n\t\tPresident and other leaders are all\n\t\tlate in arriving...\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nThe TV's are off -- so they see none of Bobbi's report.\n\nCarson crosses to Dave. He's at his computer, looking at a\nlong column of telephone numbers.\n\n\t\t\t\tDAVE\n\t\tFinally got the call list from\n\t\tJaval's phone. Most aren't his;\n\t\tthey're from the legit user who\n\t\tdidn't know his number was cloned.\n\n\t\t\t\tCARSON\n\t\tGo to the bottom of the list, work\n\t\tback through the last 12 hours.\n\nDave jumps to the bottom, points at a number.\n\n\t\t\t\tDAVE\n\t\tHere's the call to the Consulate --\n\t\t965-5000.\n\t\t\t(while scrolling)\n\t\tThe rest are dupes... all from the\n\t\tother guy...\n\n\t\t\t\tCARSON\n\t\tWait... go back... the one at seven\n\t\tthis morning...\n\nDave highlights a number: 213-965-5666.\n\nWIDER\n\nCarson glances over at the telephone on Colonel Lee's desk.\n\n(FLASHBACK) - CLOSE ON PHONE\n\nfrom when Carson took a call there, pushing the mute button.\n\n(FLASHBACK) - EXTREME CLOSE UP\n\non the label showing the phone's extension number: \"x666.\"\n\n\n\nBACK TO SCENE\n\nAcross the room, Colonel Lee is watching Carson intently.\n\nCarson turns to look at him. They make eye contact.\n\nTime stands still.\n\nRealization.\n\nFeeling like he's moving in SLOW MOTION, Carson reaches for\nthe Sig 9mm in his shoulder holster.\n\nColonel Lee grabs the AMD-74 machine gun on the desk.\n\n\t\t\t\tCARSON\n\t\tGet down!\n\nColonel Lee STRAFES the room and backs toward the door.\n\nThe BULLETS trace a line across the room. One of the North\nKorean Espionage Agents is HIT. He slams against the console.\n\nCarson tackles Ambassador Han and shoves him onto the floor,\nwhile popping off several ROUNDS in Colonel Lee's direction.\n\nRobbins also dives for cover, pushing Walther down first.\nRobbins takes a BULLET in the shoulder.\n\nMiranda is HIT. The impact tumbles her over the desk.\n\n\t\t\t\tCARSON\n\t\t\t(continuing)\n\t\tMIRANDA!\n\nColonel Lee, still FIRING, slips out the door.\n\nGunsmoke hangs in the air as Carson scrambles to Miranda.\nSeveral PHONES have begun ringing. No one notices them.\n\nDave never moved -- he sits hunched over, clutching his\nnotebook computer, muttering the HAIL MARY.\n\nCarson rolls Miranda over. She's got a large, scorched bullet\nhole in the front of her blouse. Carson tears her blouse open.\nShe's wearing a kelvar vest under it, and the slug is\nmushroomed against the vest.\n\nShe awakens, GASPS and starts swinging her fists at him.\nCarson is overwhelmed with relief.\n\nThen he notices Robbins, bleeding profusely, propped against\nthe wall next to Walther. Walther is dead -- shot in the head.\n\nOS, we hear several SPURTS of machine gun fire, and a car\nENGINE roaring to life. Miranda looks at Carson...\n\n\t\t\t\tMIRANDA\n\t\tGo..!\n\nEXT.  WILSHIRE BLVD - DAY\n\nThe city's reaction to Bobbi's announcement is immediate and\nsevere. It makes the panic during the '92 riots look like a\ndrive in the country.\n\nEXT.  NORTH KOREAN CONSULATE - DAY\n\nCarson bursts through the door just as the second armored\nMercedes CRASHES through the wrought-iron entry gates. Carson\nfires several SHOTS, which ping harmlessly off the Mercedes.\n\nCarson sprints for a car. Miranda's Volvo is the closest one.\n\nINT.  CARSON'S VOLVO - DAY\n\nAs Carson is starting it, the passenger door opens and\nAmbassador Han gets in.\n\n\t\t\t\tCARSON\n\t\tGet the fuck out of here!\n\nAmbassador Han responds by putting on his seat belt. Carson\nsighs and tears out of the driveway.\n\nEXT.  FREMONT PLACE - DAY\n\nColonel Lee crashes through the Fremont Place guard gate, then\nhangs a right on Wilshire. He drives the center turn lane,\nzooming past the snarl of cars.\n\nEXT.  NORTH KOREAN CONSULATE - DAY\n\nIn the back of the Consulate, Miranda, sore as hell, climbs\ninto the government copter. It WHINES to life and TAKES OFF.\n\nINT.  CARSON'S VOLVO - (MOVING SHOT) - DAY\n\nCarson looks around at the chaos around them.\n\n\t\t\t\tCARSON\n\t\tShit, it's like a Godzilla movie out\n\t\there!\n\nThen he HEARS, on a nearby car's FM RADIO:\n\n\n\n\t\t\t\tFM NEWSCASTER (VO)\n\t\t\t(thru car radio)\n\t\t...These words, which have terrified\n\t\tthe city:\n\n\t\t\t\tRECORDING OF BOBBI (VO)\n\t\t\t(thru car radio)\n\t\t...A biological weapon, allegedly\n\t\tcontaining the deadly Pneumonic\n\t\tPlague, is approaching Los Angeles...\n\nStunned, Carson looks over at Ambassador Han, who buries his\nface in his hands.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tMiranda..!\n\n\t\t\t\tMIRANDA (VO)\n\t\t\t(thru radio)\n\t\tI heard. I'm in the copter.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tI want you to get out of here...\n\nINT.  GOVERNMENT HELICOPTER - (AERIAL SHOT) - DAY\n\nMiranda is flying just behind Carson's Volvo. The TRAFFIC is\nbeyond nightmarish. She smiles at his concern for her.\n\n\t\t\t\tMIRANDA\n\t\t\t(into radio)\n\t\tShut up and keep your eyes on the\n\t\troad. That's my goddamn car.\n\t\t\t(beat; into radio)\n\t\tDave? You staying on top of the\n\t\tresearch?\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nSweating, Dave is watching the ACTION outside on a TV while\nhurriedly bandaging Robbins' shoulder with some torn cloth. He\ngrabs for the two-way and we realize he's panicking.\n\n\t\t\t\tDAVE\n\t\t\t(into radio)\n\t\tI can't... My kids...\n\n\t\t\t\tMIRANDA (VO)\n\t\t\t(thru radio; calmly)\n\t\tListen: the best way to help them is\n\t\tto stay at your computer. If any\n\t\tinformation comes in, holler. Okay?\n\nHe squeezes his eyes shut... After a long beat:\n\n\n\n\t\t\t\tDAVE\n\t\t\t(into radio)\n\t\tOkay...\n\nEXT.  SKY OVER LOS ANGELES - (AERIAL SHOT) - DAY\n\nSeveral large military helicopters approach -- troop\ncontingents from Pendleton and Ft. Irwin.\n\nThe big CH-54 dual-rotor copters set down and offload MARINES\nand ARMY INFANTRY.\n\nOthers, like Apache Gunship combat copters and Hueys, begin to\nfollow the pursuit. They join the police and TV copters, and\nit looks like the Ride of the Valkyries.\n\nEXT.  STREETS OF LOS ANGELES - VARIOUS ANGLES - DAY\n\nPeople flee from the festivities in droves. Seeing the\nhelicopters and TROOPS in bio suits only fuels the hysteria.\n\nWe hear news REPORTS coming from car radios, boom boxes, TV's.\nReporters chatter urgently in English, Spanish, Japanese,\nKorean, Farsi, their voices mixing with the shouts of\npedestrians, the rumbling and horn-blowing of the traffic...\n\nEveryone, everywhere is getting into their cars in a mad dash\nto get out of town or rendezvous with loved ones.\n\nThis is the mother of all rush hours.\n\nEXT.  WESTERN AVENUE - DAY\n\nColonel Lee's car turns right onto Western Avenue. He's in the\nheart of Koreatown -- hardly any of the signs are in English.\n\nHe swerves through the panicked drivers jamming the roads --\nin the center lane, or into the oncoming traffic. The cars he\nHITS crumple against the Mercedes without slowing it down.\n\nCarson's Volvo follows, squeezing through traffic in its wake.\n\nINT.  NEWS COPTER - (AERIAL SHOT) DAY\n\nBobbi is salivating with excitement (and antacid.) She snaps\noff her mic and yells at her Cameraman:\n\n\t\t\t\tBOBBI\n\t\tDon't lose the Benz, moron... pull\n\t\tback... show the other copters around\n\t\tus... this is fuckin' great...\n\nINT.  CARSON'S VOLVO - (MOVING SHOT) - DAY\n\nAmbassador Han looks glumly at the chaos in the streets.\n\n\n\n\t\t\t\tCARSON\n\t\t...The Colonel hired Javal, made it\n\t\tlook like he was working alone. Then\n\t\the made sure Javal got killed, so\n\t\twe'd never find your family -- and\n\t\tthey'd have an excuse to drop their\n\t\tbomb. But what's in it for 'em?\n\n\t\t\t\tAMBASSADOR HAN\n\t\tThere are men in my government whose\n\t\tpower depends on North Korea staying\n\t\tas it is: Socialist, repressive,\n\t\tisolated from the world. They'll\n\t\tresort to anything, even war, to\n\t\tkeep it that way. They have the\n\t\tHitler Syndrome: if their country\n\t\tcannot exist the way they want it,\n\t\tthey would rather see it destroyed.\n\nEXT.  WESTERN AVENUE - DAY\n\nColonel Lee gets stuck in a line of cars trying to get onto\nthe 10 East. Above, a swarm of HELICOPTERS circle him.\n\nINT.  APACHE HELICOPTER - (AERIAL SHOT) - DAY\n\nMarine MAJOR VREELAND and his PILOT sit in the lead\nhelicopter, an Apache Gunship.\n\nINT.  CARSON'S VOLVO - (MOVING SHOT) - DAY\n\nCarson leans on the HORN and tries to push through traffic.\n\n\t\t\t\tVREELAND (VO)\n\t\t\t(thru radio)\n\t\tFBI, this is Major Vreeland.\n\t\tDiscontinue your pursuit, we're\n\t\tgonna box his ears from up here.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tNegative -- his car's armored! And we\n\t\tneed the bastard alive!!\n\n\t\t\t\tVREELAND (VO)\n\t\t\t(thru radio)\n\t\tWe've got the situation in hand.\n\nINT.  COLONEL LEE'S MERCEDES - DAY\n\nColonel Lee sees the Apache helicopter approach. He leans into\nthe back seat, knocking the top off a long, plastic crate.\n\n\n\nINT.  APACHE HELICOPTER - (AERIAL SHOT) - DAY\n\nThe SUNROOF on the Mercedes slides open. Colonel Lee's upper\nbody pokes through the sunroof. He's holding a manportable\nS.A.M. -- a 3-foot-long, fiberglass rocket launcher.\n\nVreeland tries to bring his machine guns to bear on Colonel\nLee, but there's no time...\n\n\t\t\t\tVREELAND\n\t\t\t(to Pilot)\n\t\tShit! Pull back!\n\nEXT.  COLONEL LEE'S MERCEDES - DAY\n\nColonel Lee depresses the trigger on the launcher and a\nrolling-pin-sized rocket is EXPELLED.\n\nEXT.  SKY ABOVE WESTERN AVENUE - DAY\n\nThe rocket SLAMS into a police helicopter just in front of the\nApache, creating a huge FIREBALL, turning the copter into two\ntons of red-hot shrapnel.\n\nINT.  CARSON'S VOLVO - DAY\n\nCarson and Ambassador Han watch with horror.\n\nINT.  NEWS COPTER - (AERIAL SHOT) - DAY\n\nA hundred yards away, they're BUFFETED by the explosion.\n\n\t\t\t\tBOBBI\n\t\t\t(to TV camera)\n\t\tJesus fuckin' God!!!\n\t\t\t(beat; smiles)\n\t\tUh, I think we're gonna set down\n\t\tnow. Back to you, Brent.\n\nEXT.  WESTERN AVENUE - VARIOUS ANGLES - DAY\n\nThe burning hull of the police copter CRASHES into a mini-\nmall, causing a FIRE and EXPLOSION.\n\nHot metal and debris PINGS and POPS as it rains over the\nneighborhood, sending cars and pedestrians rushing for cover.\n\nEXT.  HELICOPTERS - DAY\n\nVreeland's Apache and the remaining helicopters scramble away.\n\n\t\t\t\tVREELAND\n\t\t\t(into radio)\n\t\tOut of the air, or retreat 7,000\n\t\tmeters from target vehicle!\n\nThe copters set down in parking lots, rooftops, wherever.\nArmed troops climb out to keep PANICKED MOBS from swarming\nthem in an attempt to leave the city.\n\nINT.  BACHELOR APARTMENT - INCLUDE ANGLE ON TV - DAY\n\nThe Han family watches the TV, amazed, as Colonel Lee ducks\nback down into the Mercedes and closes the sunroof.\n\n\t\t\t\tJOY\n\t\tI always hated that guy...\n\nEXT.  SANTA MONICA FREEWAY - DAY\n\nOther drivers, not knowing whether Colonel Lee's rocket is the\nbiological missile, scatter away from him. Colonel Lee\nsqueezes onto the freeway on-ramp.\n\nINT.  CARSON'S VOLVO - (MOVING SHOT) - DAY\n\nPieces of burning DEBRIS are still landing nearby. Carson\nlooks at Ambassador Han:\n\n\t\t\t\tCARSON\n\t\tOne of yours?\n\t\t\t(Han nods)\n\t\tWhat the hell do you need heat-\n\t\tseeking rockets for in L.A.?\n\n\t\t\t\tAMBASSADOR HAN\n\t\tThere could be another riot...\n\n\t\t\t\tCARSON\n\t\t\t(shakes his head)\n\t\tAnd they call me Mr. Overkill.\n\t\t\t(into radio)\n\t\tDave, what do you know about...\n\nHe looks at Han.\n\n\t\t\t\tAMBASSADOR HAN\n\t\tStrela-2...\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tStrela-2 anti-aircraft rockets?\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nDave, calmer but still sweating, taps at his computer. A\nschematic of Colonel Lee's rocket launcher appears on it.\n\n\n\n\t\t\t\tDAVE\n\t\t\t(into radio)\n\t\tI'm with ya... Strela-2. Perenosniy\n\t\tzenitniy raketniy kompleks. Russian\n\t\tfactory index 9K-32-M2 --\n\n\t\t\t\tCARSON (VO)\n\t\t\t(thru radio)\n\t\t-- Skip the goddamn trivia! I need\n\t\trange, guidance, arming method,\n\t\tanything we can work with...\n\n\t\t\t\tMIRANDA (VO)\n\t\t\t(thru radio)\n\t\t-- You don't \"work with\" rockets,\n\t\tPeter!\n\nINT.  POLICE CRUISER - (MOVING SHOT) - DAY\n\nMiranda has hitched a ride in a black-and-white.\n\n\t\t\t\tMIRANDA\n\t\t\t(into radio)\n\t\tStay back. LAPD's putting up a\n\t\troadblock.\n\nEXT.  SANTA MONICA FREEWAY - DAY\n\nSeveral police cars clear a path for two huge, yellow DWP\nBULLDOZERS borrowed from a construction cite.\n\nThey rumble up onto the eastbound freeway, turn, and then\nstop, side by side, facing oncoming traffic. They lower their\nhuge front shovels to create a roadblock.\n\nINT.  NEWS COPTER - CLOSE - DAY\n\nBobbi sits impatiently, microphone in hand...\n\nWIDER\n\nThe copter has landed behind an AM-PM Minimart/gas station.\n\nBobbi, her Pilot and her Cameraman turn when they hear a\nKNOCKING on the windshield of their copter...\n\nOblivious to the panic on the streets, a raggedy HOMELESS GUY\nstands with a spray bottle, wanting to wash the windows on the\ncopter. Bobbi gulps some Mylanta and waves him away:\n\n\t\t\t\tBOBBI\n\t\tSave it for someone who gives a\n\t\tshit!\n\n\n\nEXT.  STREETS OF LOS ANGELES - VARIOUS ANGLES - DAY\n\nAll of the celebration locales are trampled, abandoned messes.\nSo much for \"Fun Fun Fun\" and L.A. putting on its best.\n\nMOBS make panicked runs on the stock in grocery, drug and\nhardware stores. Violence breaks out in the aisles and parking\nlots.\n\nPEOPLE in their homes work feverishly to seal their doors and\nwindows against the plague with tape, towels, plastic.\n\nINT.  COLONEL LEE'S MERCEDES - (MOVING SHOT) - DAY\n\nColonel Lee screeches to a stop 500 feet from the bulldozers,\nangling the Mercedes so the driver's door is facing them.\n\nEXT.  SANTA MONICA FREEWAY - DAY\n\nThe windows on the Mercedes glide open....\n\nCarson hurries to catch up to it...\n\nColonel Lee FIRES a rocket at the bulldozers through the\ndriver's side window. The BACKBLAST from the launcher vents\nthrough the passenger's side.\n\nThe ROCKET impacts the bulldozer on the left; the EXPLOSION\nactually FLIPS the huge machine head over tail into the air.\n\nThe bulldozer lands upside down on the lane divider, crushing\na portion of it.\n\nColonel Lee rolls up his windows and drives around the burning\nwreckage.\n\nThe other drivers really give him wide berth now...\n\nEXT.  HARBOR FREEWAY - DAY\n\nApproaching downtown, Colonel Lee turns onto the 110 north.\n\nINT.  CARSON'S VOLVO - (MOVING SHOT) - DAY\n\nTraffic moves aside for Colonel Lee's notorious Mercedes.\nCarson catches up to it.\n\n\t\t\t\tDAVE (VO)\n\t\t\t(thru radio)\n\t\t...The Strela-2 needs 45 meters to\n\t\tarm, so stay tight on his ass.\n\nCarson SLAMS his Volvo into the Mercedes. Ambassador Han\nbraces himself on the dashboard. Carson looks over at him.\n\n\n\n\t\t\t\tCARSON\n\t\tThat Kraut-mobile have any weaknesses\n\t\tyou'd like to tell me about?\n\n\t\t\t\tAMBASSADOR HAN\n\t\tI don't think so -- they said it was\n\t\tsolid as a rock.\n\n\t\t\t\tCARSON\n\t\t\t(looks at his crumpled car)\n\t\tNo shit...\n\nAs Carson moves forward, Colonel Lee's window opens enough to\nallow the barrel of his AMD-74 machine gun to poke through.\n\nCarson shoves Ambassador Han's head down and ducks. Colonel\nLee STRAFES the Volvo.\n\nCarson looks up just in time to see...\n\nA pickup truck, ahead, stalled on the shoulder.\n\nCarson slams on the brakes, but it's too late... The Volvo\nCRASHES headfirst into the back of the truck.\n\nThe Volvo's AIRBAGS deploy, stopping Carson and Ambassador Han\nfrom plowing into the dashboard. After a beat:\n\n\t\t\t\tAMBASSADOR HAN\n\t\t\t(dazed)\n\t\tI can't believe I'm still alive...\n\n\t\t\t\tCARSON\n\t\tThis were a Hyundai you wouldn't be.\n\nAmbassador Han looks at Carson, wondering if he's putting him\non. The car is a twisted mess. Carson can't get the door open.\n\nEXT.  HARBOR FREEWAY - DAY\n\nA red and white LAFD paramedic's ambulance puts on its SIREN\nand hurries to the Volvo. Two PARAMEDICS jump out.\n\n\t\t\t\tCARSON\n\t\tGet me out of here...\n\nThey pry his door open with a crowbar. Carson climbs onto the\nroof of his car. Grimacing from pain, he looks around.\n\n\t\t\t\tCARSON\n\t\t\t(continuing; into radio)\n\t\tAnybody see him?\n\n\t\t\t\tMIRANDA (VO)\n\t\t\t(thru radio)\n\t\tStill heading north on the 110.\n\nThe Paramedics pry the passenger door open and help Ambassador\nHan out. Carson looks at the ambulance. He's getting an idea...\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tDave... You're sure those rockets\n\t\tare heat-seeking?\n\n\t\t\t\tDAVE (VO)\n\t\t\t(thru radio)\n\t\tClassic IR, reflective optical\n\t\tsystem. How come?\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tJust keep working your leads...\n\nCarson climbs into the back of the ambulance.\n\nINT.  AMBULANCE - DAY\n\nCarson rummages through the supplies, finds what he's looking\nfor, and (BELOW FRAME) starts stuffing them into a canvas bag.\n\nEXT.  SANTA MONICA FREEWAY - DAY\n\nCarson climbs onto the roof of the ambulance.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tThis is Carson. I need a copter.\n\nEXT.  HELICOPTERS - (VARIOUS ANGLES) - DAY\n\nEveryone in the grounded helicopters -- LAPD, National Guard,\nMarines, media -- react to Carson's request as if he's crazy.\n\n\t\t\t\tCARSON (VO)\n\t\t\t(thru radio)\n\t\tSomething small and nimble.\n\t\tAnybody... come in low, from the\n\t\tsouth... I'm on an ambulance by the\n\t\t9th Street exit.\n\n\t\t\t\tMIRANDA (VO)\n\t\t\t(thru radio)\n\t\tAre you out of your mind?\n\nINT.  NEWS COPTER - DAY\n\nBobbi is standing next to her copter in the back of the\nminimart, listening to this exchange on a POLICE SCANNER. Her\nCameraman is eating a microwave burrito. Bobbi jumps in, grabs\nthe ENG camera, and yells at her Pilot:\n\n\n\n\t\t\t\tBOBBI\n\t\tGet this fuckin' thing in the air!\n\t\t\t(to Cameraman)\n\t\tOut! Not enough room for four.\n\n\t\t\t\tCAMERAMAN\n\t\t\t(as they TAKE OFF)\n\t\tWhat am I supposed to do when the\n\t\tplague comes, hold my breath?\n\nINT.  POLICE CRUISER - (MOVING SHOT) - DAY\n\nThey rapidly cut through the traffic.\n\n\t\t\t\tMIRANDA\n\t\t\t(into radio)\n\t\tSwitch to a secure channel.\n\t\t\t(flips a switch)\n\t\tWhat on earth are you thinking?\n\n\t\t\t\tCARSON (VO)\n\t\t\t(thru radio)\n\t\tI'll make him open the sunroof.\n\t\tSomeone can shoot tear gas or a\n\t\tpercussion grenade inside.\n\n\t\t\t\tMIRANDA\n\t\t\t(into radio)\n\t\tPete, you haven't gone... suicidal or\n\t\tanything on me, have you?\n\n\t\t\t\tCARSON (VO)\n\t\t\t(thru radio)\n\t\tNo way. I couldn't stand making so\n\t\tmany people happy.\n\nEXT.  HARBOR FREEWAY - DAY\n\nCarson waves his arms as he sees a helicopter approaching.\n\nThe glare from the sun masks the copter's markings. It HOVERS\nabove him. With the canvas bag slung over his shoulder, Carson\njumps up onto the runner, then climbs up inside the cockpit.\n\nINT.  NEWS COPTER - (AERIAL SHOT) - DAY\n\nCarson closes the door, then sees Bobbi.\n\n\t\t\t\tCARSON\n\t\tYou?! I wanted a police copter!\n\n\t\t\t\tPILOT\n\t\tJust tell me what to do. I flew two\n\t\ttours in 'Nam.\n\n\n\n\t\t\t\tBOBBI\n\t\tAnd he doesn't go unless I go!\n\n\t\t\t\tCARSON\n\t\tWrong-o...\n\n\t\t\t\t\t\t\tCUT TO:\n\nEXT.  NEWS COPTER - (AERIAL SHOT) - DAY\n\nThe door opens and Bobbi comes TUMBLING out of it!\n\nWIDER\n\nThey're hovering above the roof of a high-rise hotel downtown.\nBobbi lands with a huge SPLASH in the rooftop swimming pool.\n\nBOBBI\n\nsurfaces, sputtering and screaming:\n\n\t\t\t\tBOBBI\n\t\tI'm a respected electronic\n\t\tjournalist, you fuckin' prick!!\n\nCarson replies by tossing her industrial-sized bottle of\nMylanta out after her.\n\nEXT.  SKY ABOVE OCEAN - FOLLOW CRUISE MISSILE - DAY\n\nIn the distance, there is smog on the horizon.\n\nINT.  NEWS COPTER - (AERIAL SHOT) - DAY\n\nThey follow the 110 north. Ahead, Carson sees the Mercedes\ncutting across lanes.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tGot 'im -- looks like he's headed\n\t\tfor the 101.\n\nINT.  NEWS COPTER - (AERIAL SHOT) - DAY\n\nCarson has the Pilot hover just above and behind the Mercedes.\nIt comes to a stop and the sunroof opens up.\n\nCarson lashes himself to the copter's center post with a piece\nof the seat harness, then slides the door open.\n\nHe reaches into the canvas bag and takes out a road flare. He\nbreaks the flare open, IGNITING it.\n\n\n\n\t\t\t\tCARSON\n\t\t\t(to Pilot)\n\t\tPull hard to the left, on my\n\t\tsignal...\n\nHe braces himself on door jamb...\n\nBelow, Colonel Lee's head pokes up from the sunroof.\n\nEXT.  COLONEL LEE'S MERCEDES - DAY\n\nColonel Lee calmly aims the rocket launcher and FIRES.\n\nINT.  NEWS COPTER - (AERIAL SHOT) - DAY\n\nCarson tosses the lit flare, hard, away from the helicopter.\n\n\t\t\t\tCARSON\n\t\tNow!\n\nThe Pilot swings the helicopter in the other direction, and\nthe rocket FOLLOWS the flare, streaking past the helicopter.\n\nA few seconds later, the rocket EXPLODES in midair behind them.\n\nINT.  POLICE CRUISER - (MOVING SHOT) - DAY\n\nMiranda sees what Carson is doing.\n\n\t\t\t\tMIRANDA\n\t\tYou fucking lunatic!!\n\nINT.  NEWS COPTER - (AERIAL SHOT) - DAY\n\nThe News Pilot looks over at Carson.\n\n\t\t\t\tPILOT\n\t\tHope you got more flares than he's\n\t\tgot rockets.\n\nEXT.  HARBOR FREEWAY - DAY\n\nMiranda and the L.A. Cop, both holding small tear gas pistols,\nsplit up. Crouching behind the cars on the freeway, they sneak\nup on the stopped Mercedes.\n\nINT.  NEWS COPTER - (AERIAL SHOT) - DAY\n\nCarson takes another flare out of the canvas bag. He breaks\nthe top off... and it doesn't ignite.\n\nBelow, Colonel Lee loads another rocket into the launcher...\n\n\n\nEXT.  HARBOR FREEWAY - DAY\n\nMiranda is climbing the metal stairs leading to a graffiti-\ncovered freeway sign.\n\nINT.  NEWS COPTER - (AERIAL SHOT) - DAY\n\nCarson fumbles to pull another flare out of the canvas bag.\n\nEXT.  HARBOR FREEWAY - DAY\n\nAvoiding coils of razor-sharp concertina wire around the sign,\nMiranda FIRES a tear gas canister at the Mercedes' sunroof.\n\nIt misses, bouncing off the windshield, filling the area with\nwhite smoke. Colonel Lee keeps his eye on the copter...\n\nINT.  NEWS COPTER - (AERIAL SHOT) - DAY\n\nCarson gets the new flare lit and throws it away from the\ncopter just as Colonel Lee FIRES another rocket.\n\nThe rocket EXPLODES a few dozen yards away. Shrapnel PEPPERS\nthe copter, DAMAGING the rear rotor.\n\nStruggling to maintain control, the Pilot heads for the Sixth\nStreet on-ramp, below the freeway, out of the line of fire.\n\nEXT.  HARBOR FREEWAY - DAY\n\nColonel Lee spots Miranda, up on the freeway sign, loading\nanother tear gas canister. He STRAFES the sign.\n\nShe flattens; the BULLETS tear through the sign above her.\n\nThe L.A. Cop rushes the Mercedes. Colonel Lee FIRES at him,\nhitting him across the legs.\n\nColonel Lee ducks back into the Mercedes and drives away.\n\nVARIOUS ANGLES\n\nAs Miranda comes down from the sign...\n\nCarson climbs up the embankment from Sixth Street to the 101...\n\nThe downed L.A. Cop waves as a pair of ambulances drive up,\nlights flashing and sirens WAILING.\n\nCarson runs alongside one of the ambulances, pulling the\ndriver's door open before it's stopped.\n\nThe Paramedic is the one who helped him and Ambassador Han out\nof the Volvo. Carson yanks him out of his ambulance.\n\n\n\n\t\t\t\tMIRANDA\n\t\tSorry...\n\nINT.  AMBULANCE - (MOVING SHOT) - DAY\n\nCarson jumps in. Miranda climbs in the passenger's side. As he\npeels away, Miranda smacks Carson on the head.\n\n\t\t\t\tMIRANDA\n\t\tYou're completely deranged! Playing\n\t\tchicken with rockets!\n\n\t\t\t\tCARSON\n\t\tWell, what the hell were you doing\n\t\tout there?\n\n\t\t\t\tAMBASSADOR HAN (OS)\n\t\tWhat are both of you doing?\n\nCarson turns, surprised and annoyed to see Ambassador Han, his\narm bandaged, lying in the cot in the back.\n\n\t\t\t\tCARSON\n\t\tOh, for Christ's sake... Hold on!\n\nLights and SIRENS going, they rush into the 110/101 interchange.\n\nAhead, Colonel Lee's Mercedes is driving through the cars that\nare parting like the Red Sea for him.\n\n\t\t\t\tMIRANDA\n\t\tEven if we can pry him out with...\n\t\t\t(looks at her watch)\n\t\tTwelve minutes to go, I doubt he'll\n\t\tbe very cooperative.\n\n\t\t\t\tCARSON\n\t\tI'll just use my outstanding people\n\t\tskills.\n\nCarson glances up at the sign showing the upcoming exit:\nGlendale Blvd - Echo Park. A thought is forming...\n\n\t\t\t\tCARSON\n\t\t\t(continuing; to Ambassador\n\t\t\tHan)\n\t\tThat car's like a rock, right?\n\nEXT.  HOLLYWOOD FREEWAY - DAY\n\nCarson suddenly cuts to the left. When they reach the Glendale\nBlvd exit, he SLAMS the ambulance into the side of the\nMercedes, forcing it onto the freeway off-ramp.\n\n\n\nINT.  COLONEL LEE'S MERCEDES - (MOVING SHOT) - DAY\n\nCarson pushes the Mercedes across Bellevue Avenue, toward the\npark surrounding Echo Lake. Colonel Lee STRAFES the ambulance.\n\nEXT.  GLENDALE BLVD - DAY\n\nCarson keeps BUMPING the Mercedes as they reach Glendale Blvd,\nrunning right alongside the lake.\n\nWith a hard shove, Carson sends the Mercedes SKIDDING off the\nroad, through the small guardrail, and INTO the lake.\n\nCarson slams on the brakes, fishtailing the ambulance into the\ngrass surrounding the lake. Sig 9mm in hand, he hops out.\n\nThe Mercedes is so heavy that it's already half-submerged.\n\nINT./EXT.  COLONEL LEE'S MERCEDES - DAY\n\nWATER pours in from the floorboards, the air vents...\n\nColonel Lee climbs out through the sunroof and FIRES at Carson\nwith his AMD-74.\n\nEXT.  ECHO LAKE - DAY\n\nCarson ducks behind the ambulance, takes careful aim...\n\nAnd SHOOTS Colonel Lee, WINGING him in the shoulder. Colonel\nLee's machine gun goes flying, and he tumbles into the water.\n\nMeanwhile, Cops, Army, Marines, etc. arrive via helicopter and\ncar. Major Vreeland is among them. The news media, ENG cameras\nbouncing on their shoulders, run alongside them.\n\nCLOSER\n\nCarson races over to grab Colonel Lee, who is slogging out of\nthe lake. There is a glint of bright steel... and Colonel Lee\nSLASHES at Carson with a knife.\n\nCarson moves aside... but the knife SLICES across his upper\narm. Carson falls backwards.\n\nColonel Lee, on hands and knees, tries to crawl away. Suddenly,\nsomeone KICKS him in face, flipping him over.\n\nIt's Miranda. Colonel Lee's knife goes flying.\n\nCarson, bleeding, piles onto Colonel Lee. Vreeland assists.\nColonel Lee fights like mad to break free...\n\nUntil Miranda JAMS her heel into his groin. He cries out.\n\n\n\n\t\t\t\tMIRANDA\n\t\tEver hear of \"fuck-me\" pumps?\n\t\tWell, these are fuck you pumps!\n\t\t\t(pushes harder)\n\t\tWhere's the family?\n\nSurprised at his wife's new negotiating technique, Carson\nshoots a look at Vreeland. Vreeland grimaces.\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nDave sits in front of his computer, phone receiver resting on\nhis shoulder, riveted by the ACTION on the TV.\n\n\t\t\t\tDAVE\n\t\tHoly shit -- Knoll-It-All's turned\n\t\tinto Dirty Harriet!\n\nHe turns as his MODEM squawks and another download comes in.\n\n\t\t\t\tDAVE\n\t\t\t(continuing; into phone)\n\t\tYou're sure there were no accounts in\n\t\tthe other names I gave you?\n\nEXT.  ECHO LAKE - DAY\n\nWhile Miranda continues to apply encouragement to Colonel\nLee's gonads, Ambassador Han limps over. He yells some ORDERS\nat Colonel Lee. After a moment, Colonel Lee sags.\n\n\t\t\t\tAMBASSADOR HAN\n\t\tLet him up.\n\nCarson's not so sure, but they're completely surrounded by\nmilitary and law enforcement personnel. He releases his grasp.\nMiranda removes her heel.\n\nThen, with lightning reflexes, Colonel Lee grabs Vreeland's\nRock Island Arsenal Colt .45 Auto from its snap-holster.\n\n\t\t\t\tCOLONEL LEE\n\t\tVictory!\n\nCarson dives back onto him. But he twists his arm around and\nPULLS the trigger -- with the muzzle underneath his own chin.\n\nCarson, Miranda and Ambassador Han are SPRAYED with his blood.\n\nWIDER\n\nDumbfounded everybody looks at each other...\n\nCarson, dogged, kneels next to Colonel Lee's body and searches\nthrough his pockets, looking for something, anything.\n\n\n\nEXT.  SKY ABOVE OCEAN - FOLLOW CRUISE MISSILE - DAY\n\nAhead, in the distance, the coastline comes into view.\n\nINT.  BACHELOR APARTMENT - DAY\n\nThe family stares at the TV. Mrs. Han purses her lips...\nfighting it... a tear rolls down her face. The time: 4:51.\n\nEXT.  ECHO LAKE - DAY\n\nCarson reaches for his two-way radio.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tDave...\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nDave is looking at the TV, paying no attention to his\ncomputer.\n\nINCLUDE COMPUTER\n\nas some bank records are being downloaded: faxed IMAGES of\nprocessed checks SCROLL down the screen.\n\n\t\t\t\tCARSON (VO)\n\t\t\t(thru radio)\n\t\tAnything else come through?\n\n\t\t\t\tDAVE\n\t\t\t(numb; into radio)\n\t\tTake a hint. We're screwed.\n\n\t\t\t\tCARSON (VO)\n\t\t\t(thru radio)\n\t\tNot yet...\n\nShaking his head, Dave glances at his computer...\n\nCLOSER\n\nJust in time to glimpse the words \"First & Last + Deposit\" on\none of the checks as it scrolls off the screen.\n\nDAVE\n\nfumbles to scroll back to the check.\n\n\t\t\t\tDAVE\n\t\t\t(into radio)\n\t\tWait! One of Javal's alias accounts:\n\t\tcheck for an apartment rental!\n\n\n\n\t\t\t\tCARSON (VO)\n\t\t\t(thru radio)\n\t\tYou're shittin'... Where?!\n\n\t\t\t\t\t\t\tCUT TO:\n\nEXT.  BACHELOR APARTMENT - ANGLE ON WINDOW - DAY\n\nThrough the sheer curtains over the window we can SEE the Han\nfamily sitting in their booby-trapped chairs.\n\n\t\t\t\tDAVE (VO)\n\t\tPark La Brea!\n\nWe PULL BACK... they're way up in a high-rise building... The\nCAMERA continues to PULL BACK, farther and farther...\n\n...REVEALING 4,222 apartment units, on 168 acres. The building\nin which the apartment is located is one of 18 identical, 13-\nstory towers standing side-by-side in a series of hexagons.\n\nEXT.  ECHO LAKE - DAY\n\nVreeland's Apache helicopter LIFTS OFF.\n\nINT.  APACHE HELICOPTER - (AERIAL SHOT) - DAY\n\nMiranda looks at Carson, then checks her watch. 4:52.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\t...Have the Manager evacuate the\n\t\tcomplex. Find out which unit the\n\t\tfamily's in, but don't let anyone go\n\t\tin 'til we get there.\n\nINT.  NORTH KOREAN CONSULATE - SURVEILLANCE ROOM - DAY\n\nDave, re-energized, is juggling the phone and the radio.\n\n\t\t\t\tDAVE\n\t\t\t(into radio)\n\t\tPrivate security's going around with\n\t\tPA's, and they set off the fire alarm.\n\t\t\t(into phone)\n\t\tWell, try callin' him again!\n\t\t\t(into radio)\n\t\tManager's gone, and the Assistant\n\t\tcan't find the key to get to the\n\t\trental manifest.\n\t\t\t(into phone)\n\t\tThen kick the fuckin' door down!\n\n\n\nINT.  PARK LA BREA OFFICE - DAY\n\nThe dense Assistant Manager, MILTON, stands in the outer\noffice, staring at the inner office's closed door.\n\n\t\t\t\tMILTON\n\t\t\t(into phone)\n\t\tI'll try him in his car again...\n\nDuring this, outside:\n\n\t\t\t\tWESTEC GUARDS (OS)\n\t\t\t(thru car-mounted PA)\n\t\tTenants -- leave your apartments at\n\t\tonce... Take the stairs...\n\nINT.  APACHE HELICOPTER - (AERIAL SHOT) - DAY\n\nCarson sticks the radio in his pocket and looks at Miranda.\n\n\t\t\t\tCARSON\n\t\t\"Fuck-you\" pumps??\n\nINT.  BACHELOR APARTMENT - DAY\n\nThe hostages can hear the WHOOPING fire alarms and the (OS)\nANNOUNCEMENT. Joy looks at Mrs. Han, hopeful.\n\n\t\t\t\tJOY\n\t\tThey must know we're here...\n\n\t\t\t\tALL\n\t\tHelp!\n\nNo answer.\n\nEXT.  PARK LA BREA - DAY\n\nPolice cars, military vehicles, fire trucks, etc. converge on\nthe complex from all directions.\n\nSeveral helicopters circle the complex. One has a PA in it:\n\n\t\t\t\tVOICE THRU PA\n\t\tHan family. Show us your location...\n\nINT.  BACHELOR APARTMENT - DAY\n\nThe family listens, frustrated, as the HELICOPTERS circle (OS).\n\nJoy carefully slides her arm along the arm rest, then tries to\ncoax something out of her pocket -- her Zippo lighter.\n\n\t\t\t\tJOY\n\t\tMother... Sam...\n\nThey look over at her as she lights it. After a beat, Mrs. Han\nunderstands... She hesitates, then:\n\n\t\t\t\tMRS. HAN\n\t\tDo it.\n\nJoy drops the lighter to the floor, then swats it with her\nfoot to Mrs. Han. She does the same, passing it to Sam, who's\nsitting closest to the window.\n\nWith one eye on the VU movement meter, Sam kicks the lighter,\nsliding it across the carpet toward the curtains.\n\nINT.  PARK LA BREA OFFICE - DAY\n\nSeveral COPS and MARINES burst into the office. Milton, the\nAssistant Manager, cowers as they SHOOT the lock off the door\nto the inner office and rush in.\n\n\t\t\t\tMILTON\n\t\tIt's a brown binder... Says \"Rental\n\t\tManifest.\" You can't miss it...\n\nThey literally tear the office apart.\n\nINT.  BACHELOR APARTMENT - DAY\n\nThe FIRE is consuming the curtains. Thick, toxic SMOKE begins\nto fill the tiny apartment, and everyone starts coughing.\n\nINT.  APACHE HELICOPTER - (AERIAL SHOT) - DAY\n\nThey circle, overwhelmed by the sheer number of apartments.\n\n\t\t\t\tCARSON\n\t\t\t(into radio)\n\t\tApartment number would be real\n\t\thelpful, gang...\n\nMiranda points to a wisp of SMOKE above one of the towers.\n\n\t\t\t\tMIRANDA\n\t\tThere!\n\nThey come around, and spot the FIRE in the apartment's window.\nIt is nine stories up, four stories below the top floor.\n\nEXT.  SKY ABOVE OCEAN - FOLLOW CRUISE MISSILE - DAY\n\nThe coast looms closer.\n\nEXT.  PARK LA BREA - INCLUDE APACHE HELICOPTER - DAY\n\nThe Apache hovers parallel to the apartment, 20 feet away.\nCarson feeds out a steel cable from a winch...\n\nThen throws a spring-loaded grappling hook onto the thick,\niron balcony railing.\n\nHanging onto a webbed rescue harness, Carson slides quickly\nacross the line, onto the balcony. Using the butt of his Sig\n9mm, he BREAKS a hole in the glass on the locked sliding glass\ndoor. He reaches through and unlatches it.\n\nINT.  BACHELOR APARTMENT - DAY\n\nThe FLAMES have engulfed both sets of curtains and have begun\nto creep across the floor and the ceiling.\n\nCarson glances over at the electronics on the TV: 4:55 PM.\n\nThe family is coughing from the smoke, trying not to panic.\n\nIn the kitchen, Lisa can't cough through the tape on her\nmouth. She's freaking out.\n\nSeeing this, Carson runs over to her and pulls the tape off.\nShe starts SCREAMING, so he grabs her face.\n\n\t\t\t\tCARSON\n\t\tOkay... work with me here!\n\nHe grabs one of the refrigerator handles and pulls, but it\nwon't come loose. Lisa cries out in frustration.\n\n\t\t\t\tLISA\n\t\tHurry, please hurry...\n\nCarson spots Javal's toolbox. In it, he finds a socket set\nhandle, which he levers in between the refrigerator handle and\nthe door. He rips one handle loose, then the other.\n\nCarson turns his attention to the booby-trapped chairs.\n\nLisa sits on the floor, frantically pulling her handcuffed\nhands around her feet so they're in front of her, then runs\nfor the front door. Just as she reaches it:\n\n\t\t\t\tCARSON\n\t\tDON'T!\n\nHe grabs her before she opens the door. There's a small\nmagnetic sensor at the top of the door jamb.\n\n\t\t\t\tCARSON\n\t\t\t(continuing)\n\t\tWe have to go out the window.\n\n\t\t\t\tMRS. HAN\n\t\tCan't you disarm the bomb?\n\n\n\n\t\t\t\tCARSON\n\t\tToo risky. Let's concentrate on\n\t\tgetting you out of here.\n\nHe looks at the meters on the electronic units.\n\n\t\t\t\tCARSON\n\t\t\t(continuing)\n\t\tSound detectors?\n\n\t\t\t\tMRS. HAN\n\t\tSam covered them with chewing gum.\n\n\t\t\t\tSAM\n\t\tHigh-tech problem, low-tech solution.\n\nCarson looks at Sam, impressed, then peers under the chairs.\n\n\t\t\t\tCARSON\n\t\tPressure sensors. Use 'em in\n\t\tconvertibles: Bad guy sits on your\n\t\tseat, he sets the alarm off. These\n\t\tare rigged backwards -- get up, you\n\t\tset 'em off.\n\n\t\t\t\tSAM\n\t\tYou a bomb expert?\n\n\t\t\t\tCARSON\n\t\tNope. But I've had some car alarms\n\t\tin my day.\n\t\t\t(to himself)\n\t\tFor all the goddamn good they do...\n\nCarson looks around, thinking. He spots the roll of duct tape\non the table, grabs it and unrolls a long piece.\n\n\t\t\t\tCARSON\n\t\t\t(continuing; to Mrs. Han)\n\t\tSlide your arm forward... Watch the\n\t\tmeter... Keep the pressure on the\n\t\tarmrest with your elbow...\n\nHe wraps the armrest with tape, cinching it tight.\n\n\t\t\t\tCARSON\n\t\t\t(continuing)\n\t\tIt'll squeeze the sensor, duplicate\n\t\tthe weight of your arm... Okay...\n\t\tpick it up.\n\nThey look at each other, scared... After a beat, she does.\n\nThe meter JIGGLES... but stays in the black! Everyone sighs\nwith relief. Carson repeats the process on her other armrest.\n\n\n\n\t\t\t\tCARSON\n\t\t\t(continuing; to Sam)\n\t\tLow-tech solution...\n\t\t\t(to Mrs. Han)\n\t\tLean back... Carefully.\n\nCarson feels for the sensor in the seat, finding it buried\nunder Mrs. Han's thighs. He runs a long piece of tape around\nthe seat and wraps it tightly.\n\nHe tries to lift Mrs. Han, but the meter moves to the red.\n\n\t\t\t\tMIRANDA (VO)\n\t\t\t(thru radio in his pocket)\n\t\tHow's it going in there?\n\n\t\t\t\tCARSON\n\t\t\t(to himself)\n\t\tNag, nag, nag...\n\nHe wraps another piece of tape around the seat, and tries\nagain to lift her. This time it works!\n\nEXT.  SKY ABOVE OCEAN - FOLLOW CRUISE MISSILE - DAY\n\nThe missile has almost reached land.\n\nEXT.  U.S. FIGHTER BOMBERS - SKY OVER SEA OF JAPAN - DAY\n\nTraveling toward the Korean DMZ.\n\nINT./EXT.  BACHELOR APARTMENT - INCLUDE APACHE HELICOPTER -\nDAY\n\nTime: 4:58. The Apache helicopter HOVERING outside is making\nan incredible racket.\n\nCarson is helping Joy get free of her chair. As she stands,\nthe pieces of her hair stuck to the gum over the microphone\nhead begin to PULL the gum away!\n\nMrs. Han sees the meter heading for the red, and the yellow\nwarning light flashing... She grabs Carson's arm.\n\nCarson quickly covers the mic... The meter drops to zero.\n\nWIDER\n\nThe FIRE is spreading across the carpet and walls. Carson is\nhurrying everyone out onto the small balcony. He helps Lisa\ninto the rescue harness. She's terrified.\n\n\t\t\t\tCARSON\n\t\tYou'll be over in five seconds...\n\nShe nods. Miranda pulls her across the cable and send the\nharness back. Carson turns next to Sam, but he stands back so\nhis sister can go.\n\nANGLE ON BOMB\n\nOne minute... fifty-nine seconds...\n\nCARSON\n\nsends Sam across... the harness comes back... he straps Mrs.\nHan into it...\n\n\t\t\t\tCARSON\n\t\tTell 'em I'm gonna release the hook\n\t\tand ride down on the line.\n\nHe pushes her across. As soon as she's there, he gestures to\nthe Apache Pilot to move closer so he can release the hook.\n\nANGLE ON BOMB\n\nThirty seconds... twenty-nine...\n\nTHE HARNESS\n\nslides back across to him; Carson grabs it with one hand and\ntries to undo the hook buckle with the other...\n\nBut the cable is crooked, and the buckle is JAMMED -- if he\ncan't release it, he's stuck there! Carson tries to free the\nhook, but it's dug in between the concrete and the railing.\n\nFifteen seconds to go...\n\nCarson looks over at the helicopter and waves them away.\n\n\t\t\t\tCARSON\n\t\t\t(shouts)\n\t\tRelease the cable from your side!\n\t\tGet out of here!\n\n\t\t\t\tMIRANDA\n\t\t\t(shouts back)\n\t\tCome over the railing! Grab onto the\n\t\tharness!\n\nINT.  APACHE HELICOPTER - (AERIAL SHOT) - DAY\n\nMiranda turns to the Pilot.\n\n\t\t\t\tMIRANDA\n\t\tTear the hook loose!\n\n\n\n\t\t\t\tPILOT\n\t\tIt'll pop the winch buckle!\n\n\t\t\t\tMIRANDA\n\t\tTry it anyway!\n\nINT./EXT.  BACHELOR APARTMENT - INCLUDE APACHE HELICOPTER -\nDAY\n\nFive seconds to go...\n\nThe Apache helicopter backs away from the high-rise...\n\nThe cable pulls taut...\n\nCarson wraps the webbing of the harness around his wrist...\n\nThe Apache STRAINS against the resistance of the cable...\n\nThe entire railing around the balcony BREAKS away, with Carson\nHANGING on the harness next to it...\n\nThe helicopter turns and flies away...\n\nEXT.  PARK LA BREA - DAY\n\nThe bomb EXPLODES, blasting a huge hole in the tower.\n\nAll the windows in the nearby towers and apartments IMPLODE.\n\nCARSON\n\nis engulfed in the FIREBALL... We can't tell if he's alive.\n\nINT./EXT.  APACHE HELICOPTER - (AERIAL SHOT) - DAY\n\nThe force of the blast HITS them like a tidal wave. The Pilot\nfights to keep control while looking for a place to set down.\n\nBELOW\n\nHuge chunks of debris, glass, furniture, etc. rain down.\n\nCarson and the section of railing underneath the helicopter\nswing like a pendulum from the force of the blast.\n\nGroggy, he loosens his grasp on the harness, and jumps clear\nas the helicopter lands.\n\nMiranda leaps out of the Apache and runs to him...\n\nWIDER\n\nDust and debris from the explosion hang in the air;\nhelicopters crisscross the scene.\n\nEveryone turns their eyes skyward, looking for the missile...\n\n\n\nINT.  WORKERS' PARADISE HALL - P'YÚNGYANG - (INCLUDE TV) -\nDAY\n\nThe Premier and the High Command are watching the action at\nPark LaBrea on CNN Live...\n\n...As Ambassador Han embraces his family.\n\nFurious, General Kai gets up and leaves the conference room.\n\nThe others look at the Premier. After a beat, he crosses to a\nPANEL OF ELECTRONICS and SLAPS a large red button on it...\n\nEXT.  SKY ABOVE SANTA MONICA - DAY\n\nThe cruise missile EXPLODES, completely obliterating it.\n\nEXT.  U.S. FIGHTER BOMBERS - SKY OVER SEA OF JAPAN - DAY\n\nThe lead jet cuts away, turning around. The others follow.\n\nEXT.  PARK LA BREA - DAY\n\nThe Han family crosses to Carson, blackened and bloody,\nsitting on the curb next to Miranda. Ambassador Han shakes\nhis hand. Mrs. Han and Miranda cry. Joy and Sam grin at him.\nAfter a beat, Carson gathers the kids up in his arms. It is a\nprofound catharsis for him...\n\nEXT.  WORKERS' PARADISE HALL - P'YÚNGYANG - DAY\n\nGeneral Kai is getting into his car. He look up as an ARMY\nOFFICER approaches... and SHOOTS him! The Officer pushes his\nbody into the passenger's seat, gets in, and drives off.\n\n\t\t\t\t\t\t\tFADE THRU TO:\n\nDARKNESS\n\nand the sound of RUNNING WATER.\n\nEXT.  PASTORAL SCENE - DAY\n\nA beautiful ranch house and horse barn, sitting on a meadow\nbeside a brook, overlooking an unspoiled pine forest.\n\nINT.  CARSON'S HOUSE - BEDROOM - NIGHT\n\nThe pastoral scene is a COMMERCIAL on the TV.\n\nCarson, wrapped in a towel, holds the phone and paces.\n\n\t\t\t\tCARSON\n\t\t\t(into phone)\n\t\t...I'll call you next week.\n\nCarson hangs up, and CLICKS off the TV as he leaves the room.\nThe sound of RUNNING WATER continues (OS)...\n\nEXT.  CARSON'S HOUSE - PATIO - NIGHT\n\nMiranda, wearing a bathrobe, is WATERING her sickly roses.\nCarson comes outside.\n\n\t\t\t\tMIRANDA\n\t\tWho was that on the phone?\n\n\t\t\t\tCARSON\n\t\tThe Bureau.\n\t\t\t(beat)\n\t\tThey want me back on the hostage\n\t\tteam.\n\n\t\t\t\tMIRANDA\n\t\tWhat did you say?\n\n\t\t\t\tCARSON\n\t\tTold 'em I'd sleep on it...\n\nMiranda smiles, then looks at him, surprised, as he crouches\ndown and helps her turn the soil around the rose bushes. They\nwork in silence. Then, tentatively, she leans over and kisses\nhim. Soon they're in each other's arms, holding tight...\n\nINT.  CARSON'S HOUSE - BEDROOM - NIGHT\n\nStill entwined, Carson and Miranda stumble in. While kissing:\n\n\t\t\t\tMIRANDA\n\t\tWorking with you today was\n\t\tcertainly... interesting, Inspector.\n\n\t\t\t\tCARSON\n\t\tIt's my outstanding people skills.\n\nHe slips her out of her robe and they fall onto the bed. It is\na tender, romantic moment...\n\nUntil, (OS), a CAR ALARM goes off. Miranda bolts up.\n\n\t\t\t\tMIRANDA\n\t\tI hate this fucking town...\n\nCarson ignores the ALARM -- and Miranda's comment. He pushes\nher back onto the bed and turns off the bedside lamp.\n\nAll of the books and magazines about other places to live\nspill from his nightstand, onto the floor...\n\n\t\t\t\t\t\t\tFADE OUT.\n\n\n\n\n\n\nRush Hour\nWriters :   Ross LaManna  Jim Kouf\nGenres :   Action  Comedy  Crime\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:34:27.270687"}