{"title": "Rushmore", "film_link": "/Movie Scripts/Rushmore Script.html", "script_link": "/scripts/Rushmore.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Rushmore Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Rushmore Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (9.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Wes Anderson\" title=\"Scripts by Wes Anderson\">Wes Anderson</a><br/>  <a href=\"/writer.php?w=Owen Wilson\" title=\"Scripts by Owen Wilson\">Owen Wilson</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/>  <a href=\"/genre/Romance\" title=\"Romance Scripts\">Romance</a><br/><br/>\n<b>Script Date</b> : May 1997<br/>\n<br/>\n<a href=\"/scripts/Rushmore.html\">Read \"Rushmore\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\r\n\r\n(c)1997 Wes Anderson and Owen Wilson, Touchstone Pictures\n<br/>\n<br/><b>R U S H M O R E\n<br/></b>\n<br/>anderson/wilson\n<br/>\n<br/>12.may.97\n<br/>\n<br/><b>INT. CLASSROOM DAY\n<br/></b>\n<br/>A private day school. Twenty 10th grade boys are sitting in desks in geometry class. They are dressed in school uniform, light blue shirts and khakis. The boys look dazed and sleepy.\n<br/>\n<br/>The teacher, MR. ADAMS, is at the front of the room, finishing a complicated equation on the chalkboard.\n<br/>\n<br/><b>MR. ADAMS\n<br/></b>\n<br/>Except when the value of the x coordinate is less than or equal to the value of the -- Yes, Isaac?\n<br/>\n<br/>A boy named ISAAC has raised his hand\n<br/>\n<br/><b>ISAAC\n<br/></b>\n<br/>What about that problem?\n<br/>\n<br/>Isaac points to a startling and intricate arrangement of huge numbers and strange symbols filling up a forgotten corner of the chalkboard. The heading above it says Extra Credit.\n<br/>\n<br/><b>MR. ADAMS\n<br/></b>\n<br/>Oh, I really just put that up there as a joke. That's probably the hardest geometry problem in the world.\n<br/>\n<br/><b>ISAAC\n<br/></b>\n<br/>How much extra credit is it worth?\n<br/>\n<br/><b>MR. ADAMS\n<br/></b>\n<br/>Well, I've never seen anyone get it right before, including my mentor, Dr. Leaky at MIT. So I guess if anyone here can do it,\n<br/>\n<br/>(pause)\n<br/>\n<br/>I'd see to it that none of you ever have to open another math book again for the rest of your lives.\n<br/>\n<br/>There is some quite murmuring. The name Fischer is repeated over and over. The boys begin to look to a student in the back row.\n<br/>\n<br/>Unlike his classmates, he wears the Rushmore school blazer with insignia on the breast pocket and a Rushmore rep tie knotted tightly. His hair is smartly parted and swept back. He is extremely skinny and pale. He is MAX FISCHER.\n<br/>\n<br/>Max has a cup of coffee on his desk and he is reading the Wall Street Journal.\n<br/>\n<br/><b>MR. ADAMS\n<br/></b>\n<br/>Max ? You want to try it ?\n<br/>\n<br/>Max looks up.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'm sorry. Did someone say my name?\n<br/>\n<br/>Everyone laughs. Max smiles slightly. He buttons his blazer and straightens his tie. He picks up his cup of coffee and takes a sip. He goes to the chalkboard and sets to work.\n<br/>\n<br/>The boys watch with nervous anticipation. Mr. Adams compares Max's progress with e notes in his book. Max's equations quickly fills up most of the chalkboard. He finishes it with a flourish, throws his piece of chalk in the trash, and turns to face the\n<br/>\n<br/>class.\n<br/>\n<br/>Everyone looks to Mr. Adams. Mr. Adams raises an eyebrow. He nods.\n<br/>\n<br/>The classroom erupts into wild, ecstatic applause. Everyone surrounds Max, cheering, as he walks calmly back to his desk. They hoist him into the air.\n<br/>\n<br/><b>CUT TO:\n<br/></b>\n<br/>Max with his eyes closed, smiling serenely, listening to the applause. He mutters:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Gentlemen, gentlemen, please.\n<br/>\n<br/>A little hand grabs Max's arm and shakes him. Max opens his eyes. The person shaking him is his chapel partner, DIRK CALLOWAY, a fourth grader with neatly white hair. Max looks around.\n<br/>\n<br/>They are in chapel, surrounded by rows of boys in school uniforms. Dirk puts his finger to his lips.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Shh.\n<br/>\n<br/>Max rubs his eyes and sits up in the pew. The applause dies down and Max looks to the pulpit as the guest chapel speaker, HERMAN BLUME, steps up to the microphone.\n<br/>\n<br/>Mr. Blume is a tough looking guy about fifty years old in a black suit. He begins his chapel speech.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>You guys have it real easy. I never had it like this where I grew up. But I send my kids here. Because, the fact is, whether you deserve it or not: you go to one of the best schools in the country.\n<br/>\n<br/>Max's eyes light's up.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Rushmore. You lucked out.\n<br/>\n<br/>Max leans forward to the railing and begins to listen intently.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Now, for some of you it doesn't matter. You were born rich, and you're going to stay rich. But here's my advice to the rest of you: take dead aim on the rich boys. Get them in the crosshairs. And take them down.\n<br/>\n<br/>Some of the students and faculty begin to look at each other with puzzled expressions. Max is nodding and taking notes on the flypage of a hymnal.\n<br/>\n<br/><b>INSERT HYMNAL:\n<br/></b>\n<br/>Rushmore -- best school in country.\n<br/>\n<br/>rich kids -- bad?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Just remember: they can buy anything. But they can't buy backbone. Don't let them forget that. Thank you.\n<br/>\n<br/>Mr. Blume leaves the podium. Max leaps to his feet and leads the applause. The organ starts and everyone stands up.\n<br/>\n<br/><b>EXT. QUADRANGLE DAY\n<br/></b>\n<br/>Mr. Blume and the headmaster, DR. GUGGENHEIM, come out of the chapel among the throng of students.\n<br/>\n<br/>Dr. Guggenheim wears a wool coat and smokes a pipe. He is very dashing with silver hair and a warmly patronizing manner. He walks with his hands clasped behind his back.\n<br/>\n<br/>Two Jack Russell terriers follow quickly at his heels.\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>Are you free for graduation, Herman? Maybe you could give us an encore. (whistles to the dogs) Nicholas! Copernicus!\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(lighting a cigarette)\n<br/>\n<br/>I don't give a shit. I paid for the whole damn natatorium. The least these little pricks can do is hear me out.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Mr. Blume.\n<br/>\n<br/>Max has appeared beside them. Dirk tags along behind him.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>My name's Max Fischer. I just wanted to tell you, I strongly agree with your views concerning Rushmore.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>You don't say. Tell me something. How long have you gone here?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Ten years.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Then you've been living in a dreamworld for ten years.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I know it, sir.\n<br/>\n<br/>Max smiles broadly. They each notice that their haircuts are identical, neatly parted on the side.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Your speech was excellent. Except I disagree with your ideas about rich kids. Because. After all, we don't choose who our fathers are. But that's really my only criticism.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(hesitates)\n<br/>\n<br/>Thank you.\n<br/>\n<br/>Mr. Blume looks at Dirk staring up at him. Dirk says softly:\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Hello.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>This is my chapel partner, Dirk Calloway.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(shakes Dirk's hand)\n<br/>\n<br/>Nice to meet you, Dirk.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Thank you for coming today, sir.\n<br/>\n<br/>Max shakes Mr. Blume's hand. Mr. Blume smiles. But Max doesn't go. He just stands there. Searching for the words.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I really. I think it is. You're right about Rushmore. Look around. It truly is a great school.\n<br/>\n<br/>Mr. Blume nods. A little uneasy.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Anyway, nice to have met you.\n<br/>\n<br/>Max goes. Mr. Blume and Dr. Guggenheim watch him walk away with Dirk.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>What's his name again?\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>Max Fischer.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>He's a sharp little guy.\n<br/>\n<br/>Dr. Guggenheim looks across the lawn at Max and his chapel partner. He says wistfully:\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>He's one of the worst students we've got.\n<br/>\n<br/><b>INSERT COVER OF THE RUSHMORE YEARBOOK:\n<br/></b>\n<br/>It is called the Rushmore Yankee. The masthead says Max is editor-in-chief. There is a photograph of him laughing, surrounded by his staff.\n<br/>\n<br/>We cut to a series of pictures of:\n<br/>\n<br/>The French Club, Debate Team, lacrosse, golf, drama, Astronomy Society, Glee Club, student council, Model United Nations, Stamp &amp; Coin Club, Gun Club, Bombardment Society, calligraphy, fencing kung fu, beekeeping, and J.V. water polo.\n<br/>\n<br/>Max is president or captain of virtually every one of these.\n<br/>\n<br/>Other photographs show Max pole-vaulting, dancing at the Christmas ball, and giving a thumbs up from the cockpit of a Piper Club.\n<br/>\n<br/><b>TITLE:\n<br/></b>\n<br/>September\n<br/>\n<br/><b>INT. DR. GUGGENHEIM'S OFFICE DAY\n<br/></b>\n<br/>A paneled room with wooden floors, an old electric fan in the windowsill, and paintings of ducks and geese on the walls. Dr. Guggenheim is seated at his little oak desk. Max sits across from him and in an antique leather armchair.\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>We're putting you on what we call sudden death academic probation.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>And what does that entail ?\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>It entails that if you fail another class, you are going to be asked to leave Rushmore.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I see.\n<br/>\n<br/>(raises an eyebrow)\n<br/>\n<br/>In other words, I'll be expelled.\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>Right.\n<br/>\n<br/>Silence.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Dr. Guggenheim. I don't want to tell you how to do your job. But the fact is no matter how hard I try, I still might flunk another class. And if that means I have to stay on for a post-graduate year, then so be it. But if --\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>We don't offer a postgraduate year.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Well. We don't offer it yet.\n<br/>\n<br/>(pause)\n<br/>\n<br/>And what about the fact that I'm probably dyslexic?\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>You're not dyslexic.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Well, I'm a terrible speller.\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>Just bring up the grades.\n<br/>\n<br/>Max sighs. He looks out the window and says quietly:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Do you remember how I got into this school?\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>Yeah, I do. You wrote a play.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>That's right. A little one act. And my mother read it and felt I should go to Rushmore. And you read it, and you gave me a scholarship, didn't you ?\n<br/>\n<br/>Dr. Guggenheim nods.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Do you regret it?\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>No, I don't regret it. But I still might have to expel you.\n<br/>\n<br/>Max nods. He smiles sadly and whispers:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Couldn't we just let me float by? For old times' sake?\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>(grimly)\n<br/>\n<br/>Can't do it, Max.\n<br/>\n<br/><b>EXT. QUADRANGLE. DAY\n<br/></b>\n<br/>Max and Dirk come out the door into the cold. They head across the grass.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>They want to kick me out, Dirk.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>(concerned)\n<br/>\n<br/>Oh, no. Not again. What are you going to do?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>The only thing I can do. Try and pull some strings with the administration, I guess.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>Maybe you ought to get a tutor.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I don't have time for a goddamn tutor. You know my schedule.\n<br/>\n<br/><b>INSERT SIGN WRITTEN IN CALLIGRAPHY:\n<br/></b>\n<br/><b>BACKGAMMON CLUB.\n<br/></b>\n<br/>Founder: Max Fischer.\n<br/>\n<br/><b>INT. LIBRARY DAY\n<br/></b>\n<br/>A long table in the Rushmore library. Max is reading a library copy of a book about Jacques Cousteau. He is also playing backgammon with a freshman named ALEX.\n<br/>\n<br/><b>ALEX\n<br/></b>\n<br/>Did you hear they're teaching Japanese next year?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>That's the rumor.\n<br/>\n<br/><b>ALEX\n<br/></b>\n<br/>And they're canceling Latin.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What? I tried to get Latin canceled for five years. \"It's a dead language,\" I'd always say.\n<br/>\n<br/><b>ALEX\n<br/></b>\n<br/>Well, I guess they finally heard you.\n<br/>\n<br/>Max shakes his head as this sinks in.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>At least I saved Dirk from the horror.\n<br/>\n<br/>Max turns the page of his book. There is a little note written in the margin in pencil with an arrow pointing to the text. Max frowns. He turns the book sideways to read it.\n<br/>\n<br/><b>INSERT FRAGMENT OF NOTE IN BOOK:\n<br/></b>\n<br/>which reminds me of a quote from Henry James: Try to be one of the people whom nothing is lost.\n<br/>\n<br/>Max's frown disappears. A change comes over his face. His eyes glaze over dreamily. He looks to Alex.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Who's Henry James?\n<br/>\n<br/><b>ALEX\n<br/></b>\n<br/>I don't know.\n<br/>\n<br/>Max looks back at the book. He studies the quote. He gets up and goes to the check-out counter. He shows the book to the LIBRARIAN.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What does this mean?\n<br/>\n<br/>The librarian reads the Henry James quote.\n<br/>\n<br/><b>LIBRARIAN\n<br/></b>\n<br/>It means try to be worldly.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You mean like smart.\n<br/>\n<br/><b>LIBRARIAN\n<br/></b>\n<br/>More or less. Yeah.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'd like to see a list of all the people who've checked out this book in the past year.\n<br/>\n<br/>The librarian goes through the cards in a little wooden box.\n<br/>\n<br/><b>INSERT SCRAP OF PAPER:\n<br/></b>\n<br/>Miss. Cross, 1st grade, room 121\n<br/>\n<br/><b>INT. HALLWAY. DAY\n<br/></b>\n<br/>Max walks down a hallway in the lower school. He is carrying the little scrap of paper, checking room numbers as he walks.\n<br/>\n<br/>He looks in some of the rooms. He sees kids sitting at tables with scissors and paste. Kids watching a movie on science. Kids curled up on mats during naptime.\n<br/>\n<br/>And then he sees room 121. He goes up to the door and looks through the window.\n<br/>\n<br/>A class of first graders is sitting Indian-style in a little circle on the floor. The teacher is in a tiny little kids' chair, reading aloud from Kidnapped. She is twenty-eight. She wears a cardigan sweater and her hair pulled back like a ballet dancer. She is MISS CROSS.\n<br/>\n<br/>Max's eyes are glued to the glass. He cracks open the door an inch to listen to her voice.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I have seen wicked men and fools, a great many of both; and I believe they both get paid in the end.\n<br/>\n<br/>(darkly:)\n<br/>\n<br/>But the fools first.\n<br/>\n<br/>She looks up mysteriously. She turns the page and continues:\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Chapter fifteen. The Lad with the Silver Button.\n<br/>\n<br/><b>INT. BLUME INTERNATIONAL CONCRETE. DAY\n<br/></b>\n<br/>Mr. Blume has a gigantic office with paintings of battle scenes and Viking ships, a coat of armor and a statue of a discus thrower. The concrete plant is outside the window.\n<br/>\n<br/>A portrait of the Blume family hangs on the wall behind Mr. Blume's desk. His wife and twin sons are all fair-skinned redheads. Mr. Blume is dark and sullen. He is smoking a cigarette in the painting.\n<br/>\n<br/>Mr. Blume sits at his desk with a silver military issue. 45 automatic disassembled in front of him. He is cleaning it and drinking a Bloody Mary. His SECRETARY buzzes him on the speakerphone. Mr. Blume pushes a button on it.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Yeah?\n<br/>\n<br/><b>SECRETARY\n<br/></b>\n<br/>Mrs. Blume wants you to pick up the twins from school at --\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Tell them to take the fucking bus.\n<br/>\n<br/><b>SECRETARY\n<br/></b>\n<br/><b>OK.\n<br/></b>\n<br/><b>INT. CAR. DAY\n<br/></b>\n<br/>Max is sitting in a parked Jaguar with Dirk's mother, MRS. CALLOWAY. She is beautiful. She is dressed in tennis clothes and wears a terrycloth visor.\n<br/>\n<br/>Max is wearing a fluorescent orange crossing guard's belt with a badge at the shoulder that says Patrol Chief. He hands Mrs. Calloway his phone number.\n<br/>\n<br/><b>MRS. CALLOWAY\n<br/></b>\n<br/>Thank you, Max. I told Mr. Calloway the other day how fortunate we are to have someone like you looking out for Dirk.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>My pleasure. I'm just trying to impart some of the experiences I've accrued to help Dirk. There he is now. Nice talking with you, Mrs. Calloway.\n<br/>\n<br/>They shake hands. Max gets out of the car and puts his hand on Dirk's shoulder.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>How'd the math test go?\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>What math test?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I thought you had a math test today.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>No. Did you turn in your paper on the Berlin Airlift ?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Yeah, I got an extension.\n<br/>\n<br/>Dirk gets in the car and drives off. A seventh grader named BOBBY goes over to Max.\n<br/>\n<br/><b>BOBBY\n<br/></b>\n<br/>How'd it go?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I shook hands with her.\n<br/>\n<br/><b>BOBBY\n<br/></b>\n<br/>Big deal.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>And I gave her my phone number.\n<br/>\n<br/><b>BOBBY\n<br/></b>\n<br/>Buchan said he'd have already banged her by now.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>He said that?\n<br/>\n<br/>Max looks across he yard at MAGNUS BUCHAN, the burly foreign exchange student from Scotland. He is seventeen. He has a straw in his mouth and he shoots a little blowdart at a little kid's neck.\n<br/>\n<br/>Half of Buchan's ear was blown-off in a hunting accident.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>That's a really crude thing to say. That's Dirk's mother.\n<br/>\n<br/><b>BOBBY\n<br/></b>\n<br/>But I thought that's why you picked Dirk as your chapel partner.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(looks at Bobby, pause)\n<br/>\n<br/>What are you, a lawyer? All I'm saying is that gorilla is a guest at our school for the year, so respect our women the say way we would in his jerkwater country.\n<br/>\n<br/>Mr. Blume pulls up in a brand new black Bentley.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Mr. Blume!\n<br/>\n<br/>Max goes over to Mr. Blume's car.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>It's Max Fischer.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(weary)\n<br/>\n<br/>Hi, Max.\n<br/>\n<br/>They shake hands through the open car window.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>How's the concrete business?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Oh, I don't know. By the time you hit 45 you're been fucked over so many times you don't really care anymore.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'm sorry to hear that.\n<br/>\n<br/>Mr. Blume sighs deeply. He stares out the windshield.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>What's the secret, Max?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>The secret?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Yeah. You look like you've got it all figured out.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>I don't know. I think you just gotta find something you love to do, then do it for the rest of your life.\n<br/>\n<br/>(shrugs)\n<br/>\n<br/>For me, it's going to Rushmore.\n<br/>\n<br/>Max looks very serious. Mr. Blume smiles and nods.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Hey, Ronny. Hey, Donny.\n<br/>\n<br/>Mr. Blume's red-headed twins RONNY and DONNY come over to the car. They're Max's age but much more thick and solid.\n<br/>\n<br/><b>RONNY\n<br/></b>\n<br/>Shotgun.\n<br/>\n<br/>Donny gets in the front seat anyway. Ronny hollers:\n<br/>\n<br/><b>RONNY\n<br/></b>\n<br/>I said shotgun, Donny!\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Get in the back, Ronny.\n<br/>\n<br/><b>RONNY\n<br/></b>\n<br/>I said, \"Shotgun.\" Get in the back, Donny.\n<br/>\n<br/>Donny punches three different buttons on the dash that crank up the AC full blast. Mr. Blume's hair dances in the cold burst of air. He shuts off the AC.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>See you tomorrow, Mr. Blume.\n<br/>\n<br/>(looks off)\n<br/>\n<br/>Mrs. Reynolds!\n<br/>\n<br/>Max goes over to shake hands with somebody else's parents. Mr. Blume looks at Max fondly.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Did you invite that kid to your party?\n<br/>\n<br/><b>DONNY\n<br/></b>\n<br/>(shocked)\n<br/>\n<br/>Max Fischer?\n<br/>\n<br/><b>RONNY\n<br/></b>\n<br/>Come on, Dad. There's gonna be girls there.\n<br/>\n<br/><b>DONNY\n<br/></b>\n<br/>I'd rather die. Pull your head out of your ass.\n<br/>\n<br/>Mr. Blume turns Donny quickly like he is going to attack him. Donny cowers grinning in the backseat with his fists up. Ronny pipes in:\n<br/>\n<br/><b>RONNY\n<br/></b>\n<br/>Remember what Mom said. Hugs not hits.\n<br/>\n<br/><b>INT. AUDITORIUM. DAY\n<br/></b>\n<br/>The school auditorium. The stage is bare except for two folding chairs. A tall senior plays FRANK. He is wearing a stocking cap and sunglasses. A fat kid plays WILLIE.\n<br/>\n<br/><b>FRANK\n<br/></b>\n<br/>Wait a second. What time did the old lady place the 911 call?\n<br/>\n<br/><b>WILLIE\n<br/></b>\n<br/>Ten-fifteen.\n<br/>\n<br/><b>FRANK\n<br/></b>\n<br/>(snaps his fingers)\n<br/>\n<br/>That's it.\n<br/>\n<br/>Frank jumps out of his seat.\n<br/>\n<br/><b>FRANK\n<br/></b>\n<br/>Meet me on the corner in ten minutes.\n<br/>\n<br/><b>WILLIE\n<br/></b>\n<br/>Where are you going?\n<br/>\n<br/><b>FRANK\n<br/></b>\n<br/>I'll tell you in the squad car.\n<br/>\n<br/>He heads towards the wings, then stops.\n<br/>\n<br/><b>FRANK\n<br/></b>\n<br/>Oh, and, Willie. You were wrong about Enrique Sanchez. He died in his sleep.\n<br/>\n<br/>He exits.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Excellent!\n<br/>\n<br/>Willie looks into the darkness beyond the stage. Max emerges and quickly climbs the steps onto the stage. He is followed by Dirk who is holding a script.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Excellent. Irving?\n<br/>\n<br/>The stage manager is a wavy-haired sophomore named IRVING. He comes out from the backstage. Max pulls some money out of his pocket and hands it to him.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Get some rootbeers for anybody who wants one. I don't want one. OK. Next scene. (looks at Dirk's script) Frank, you enter stage right with a bag of cocaine.\n<br/>\n<br/><b>INT. BARBERSHOP. DAY\n<br/></b>\n<br/>A small, clean barbershop. MR. FISCHER is a white-haired man of sixty-five in a white a white barber's shirt. He has finished giving a buzzcut to a twelve year-old boy named GORDON.\n<br/>\n<br/><b>GORDON\n<br/></b>\n<br/>May I see the back, please?\n<br/>\n<br/>Mr. Fischer holds up a hand mirror so Gordon can see the back. Gordon nods. Max comes in rolling a Japanese ten-speed at his side.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>Hey, Max. How was your day?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Hm. I'd say\n<br/>\n<br/>(thinks for a second)\n<br/>\n<br/>98% good, 2% not so good. I need a signature on this geometry test, by the way.\n<br/>\n<br/>Max leaves his test on the counter and rolls his bike into the back room. Gordon gives Mr. Fischer ten dollars.\n<br/>\n<br/><b>GORDON\n<br/></b>\n<br/>Thank you very much.\n<br/>\n<br/>Gordon goes out the door. Mr. Fischer looks at the geometry test. Max comes out of the back room drinking a glass of chocolate milk with a straw.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>Hm.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I know.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/><b>A 37.\n<br/></b>\n<br/><b>MAX\n<br/></b>\n<br/>Pathetic. Just pathetic.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>Well. It could have been worse. You were right more than a third of the time.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(exploding)\n<br/>\n<br/>Come on, Dad! That stinks! I can do better than that!\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>Of course, you can.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>For once, will you please try not to look on the bright side?\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>Sit down and let me give you a trim.\n<br/>\n<br/>Max sighs deeply. He sits down. Mr. Fischer signs the geometry test. He puts a pale blue smoke over Max and gives him a haircut.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Do you think I'm stupid?\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>No! You're just not very good at math.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>But I'm failing English and History, too.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>Well. Maybe you'd be better off at a school where there's not so much emphasis on academics.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What, like barber college?\n<br/>\n<br/>Mr. Fischer is stricken. Max says quietly:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>No, I love Rushmore. I don't want to go someplace second rate. Besides, it would ruin my chances of getting into Oxford.\n<br/>\n<br/>Silence. Mr. Fischer looks very sad.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>I wish I knew how to help you. But I just don't. I'm sorry, Max.\n<br/>\n<br/>Max looks at his dad. Mr. Fischer looks down at the floor.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>You want to see the back?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>No, thanks. You know how I like it.\n<br/>\n<br/><b>INT. THE FISCHER'S HOUSE. NIGHT\n<br/></b>\n<br/>An Archie Bunker-type house. Max and Mr. Fischer sit on the sofa in front of the TV having TV dinners.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You think I'm spending too much of my time starting up clubs and putting on plays?\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>I don't know. It's possible.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I should probably be trying harder to score chicks. That's the only thing anybody really cares about. (sighs deeply) But it's not my forte, unfortunately.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>It'll happen, Max. It's just. You're like one of those clipper ship captains. You're married to the sea.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Yes, that's true.\n<br/>\n<br/>(pause)\n<br/>\n<br/>But I've been out to sea for a long time.\n<br/>\n<br/><b>EXT. SOCCER FIELD. DAY\n<br/></b>\n<br/>Miss Cross is sitting on the bleachers watching her class play Capture-the-Flag. She opens a book. It is 20,000 Leagues under the Sea. She puts a cigarette in her mouth and searches in her pocket for a lighter.\n<br/>\n<br/>A lit match appears in front of her. Max is holding it. He is wearing a maroon beret, Miss Cross looks at him curiously.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Hello.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Hi.\n<br/>\n<br/>Miss Cross lights her cigarette on Max's match.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I like your hat.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Thank you. You're a teacher here, aren't you?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Uh-huh.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What subject do you teach?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Well, I teach first grade, so I do all the subjects. Except music.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>And this is your first year at Rushmore, I take it.\n<br/>\n<br/>Miss Cross nods.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I see. How long have you been a smoker, if you don't mind me asking?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>(surprised)\n<br/>\n<br/>Hm. Let's see. How old are you?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Fifteen.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Since I was your age.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(shocked)\n<br/>\n<br/>You're kidding.\n<br/>\n<br/>Miss Cross shakes her head. Max can't believe this.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You should quit.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>You're right.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(going back to his book)\n<br/>\n<br/>And I should mind my own business.\n<br/>\n<br/>Miss Cross laughs. Max looks back up.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Where'd you go to school, by the way?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Harvard.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Really? That's a coincidence. My top schools where I want to apply to are Oxford and The Sorbonne. But my safety is Harvard.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>(smiles)\n<br/>\n<br/>That's very ambitious.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Thank you.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>What are you going to major in?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Well. I haven't decided for sure. But probably a double major in Mathematics and Pre-Med. What was your major?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Latin-American studies.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Ah, that's interesting. Did you hear they're not going to teach Latin here anymore?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>This was more like Central America.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>Sure. Central America and whatnot. But moving on: they're gonna cancel Latin. They've got to make room for Japanese.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Really? That's too bad. All the Romance Languages come from Latin.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>They do, don't they?\n<br/>\n<br/>(pause)\n<br/>\n<br/>Like French, probably.\n<br/>\n<br/>She nods. She smiles.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Nihilo sanctum estne?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>That's Latin, isn't it?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Yeah.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What does it mean?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Is nothing sacred?\n<br/>\n<br/>Long pause. Looking right at her.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Sic transit gloria. Glory fades. I'm Max Fischer.\n<br/>\n<br/>Max slides down the bench and puts out his hand.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Hi.\n<br/>\n<br/>They shake hands.\n<br/>\n<br/><b>INT. LUNCHROOM. DAY\n<br/></b>\n<br/>A crowd of MIDDLE SCHOOLERS has gathered around Max. He is holding a clipboard. One of the kids finishes signing a piece of paper on it.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Good. Now you.\n<br/>\n<br/>(points to the next kid)\n<br/>\n<br/>Sign here.\n<br/>\n<br/>The kid signs.\n<br/>\n<br/><b>INSERT PIECE OF PAPER:\n<br/></b>\n<br/>A long list of signatures. Many of them are written in little kid's handwriting. Some are neater. Across the top, it says PETITION. This is written in calligraphy.\n<br/>\n<br/><b>CUT TO:\n<br/></b>\n<br/>The administration conference room. TEN TEACHERS sit in chairs around a long table. Max stands before them finishing a speech. The petition is tacked-up on the wall behind him.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>In summation, I have only one question: is Latin dead? Nisilum sacnus (pause, looks at his notecards) estne? Only you can say. Thank you for your time.\n<br/>\n<br/>Applause.\n<br/>\n<br/><b>INSERT ANNOUCEMENT:\n<br/></b>\n<br/>Thanks to part of the efforts of 10th class member Max Fischer, Latin will now be a required course for grades 7 through\n<br/>\n<br/><b>INT. HALLWAY. DAY\n<br/></b>\n<br/>Max and a bunch of other kids are reading this announcement on the bulletin board. Max is smiling serenely. The others are cursing and looking at Max with angry faces. Magnus Buchan is one of them. He has a strong Scottish accent.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>Bugger off, Fischer. Ya bleedin' little bollocks.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Is that Latin?\n<br/>\n<br/>Not bad, Buchan. Maybe you'll place out of your first year.\n<br/>\n<br/><b>INT. GYM. DAY\n<br/></b>\n<br/>Mr. Blume's son Ronny is in a wrestling mach. He has his opponent in a chokehold and is slowly strangling him. Mr. Blume looks on distastefully from the stands. Max is at his side.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>What does your dad do, Max?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(frankly)\n<br/>\n<br/>He's a neurosurgeon. Over at St. Joseph's. Personally, I could never see myself cutting open somebody's brain. But he seems to enjoy it.\n<br/>\n<br/>Max shrugs. Mr. Blume nods.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You were in Vietnam, if I'm not mistaken, weren't you?\n<br/>\n<br/>Mr. Blume nods. Max thinks for a minute.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Were you in the shit?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Yeah. I was in the shit.\n<br/>\n<br/>They look back out at the wrestling match. Ronny is crushing his opponent's face into the mat with his fist. Mr. Blume shakes his head.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Tell me something, Max. What do you think of Ronny and Donny?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(automatically)\n<br/>\n<br/>I like them.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(surprised)\n<br/>\n<br/>Really?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Sure.\n<br/>\n<br/>Ronny flips his opponent on the mat and flattens him with his body. Donny screams encouragement.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>No. You're right. They're good kids.\n<br/>\n<br/>Max nods solemnly.\n<br/>\n<br/><b>WRESTLER\n<br/></b>\n<br/>See you Sunday, Mr. Blume.\n<br/>\n<br/>A stocky Wrestler with an ice pack on his arm walks by on his way to the showers. Mr. Blume nods to him without looking up.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What's Sunday?\n<br/>\n<br/>Mr. Blume looks to Max. Silence.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>The twins are having a birthday party. And I'd love it if -\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Oh, that's right. Yeah. I'm not going to be able to make it to that one.\n<br/>\n<br/>Max smiles very sincerely. Silence.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Come work for me.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(stiffens)\n<br/>\n<br/>What do you mean?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>I mean, I could use somebody like you. I could -\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I may not be rich, Mr. Blume. And my father may only be a doctor. But we manage.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(hesitates)\n<br/>\n<br/>I didn't mean it like that. I just -\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>No, thank you. I mean, I appreciate the offer. But I've got everything I need right here at Rushmore. Besides, it wouldn't be fair.\n<br/>\n<br/><b>REFEREE\n<br/></b>\n<br/>110s!\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Excuse me, Mr. Blume. Nice talking with you.\n<br/>\n<br/>Max pulls off his blazer. He is wearing wrestling tights underneath. Mr. Blume looks surprised.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>You're on the team?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(shrugs)\n<br/>\n<br/>I'm an alternate.\n<br/>\n<br/>Max heads out to the mat, pulling on his headgear. Mr. Blume calls after him:\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>What wouldn't be fair, Max?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(smiles crookedly)\n<br/>\n<br/>We'd make way too much money working on the same team.\n<br/>\n<br/>Mr. Blume smiles faintly. He watches as Max begins his match. Max is outclassed and quickly gets pinned.\n<br/>\n<br/><b>INT. HALLWAY - DAY\n<br/></b>\n<br/>Miss Cross is shepherding her class into her classroom. They are singing a song as they walk down the corridor. Across the hall, a fourth-grade teacher, Mrs. Guggenheim, comes out of her classroom. She is a handsome woman in her late sixties with black and silver hair.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Hello, Mrs. Guggenheim.\n<br/>\n<br/><b>MRS GUGGENHEIM\n<br/></b>\n<br/>Hi, Rosemary. Did you find a place?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Well, I'm just staying over at Edward's parents' house for now. They're out of town.\n<br/>\n<br/><b>MRS GUGGENEHIM\n<br/></b>\n<br/>Oh. That's good.\n<br/>\n<br/>(pause)\n<br/>\n<br/>Edward was one of my students, you know.\n<br/>\n<br/>Miss Cross smiles and nods. Silence. Miss Cross points to a photograph in a collage on a wall.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I think I met that boy yesterday.\n<br/>\n<br/>Mrs. Guggenheim looks at the picture.\n<br/>\n<br/><b>INSERT PHOTOGRAPH:\n<br/></b>\n<br/>It is black and white of Max in fifth grade singing a show tune. His arms are opened wide and he has a top hat in one hand and cane in the other.\n<br/>\n<br/><b>MRS GUGGENHEIM\n<br/></b>\n<br/>(frowns)\n<br/>\n<br/>That's Max Fischer. How'd you get mixed up with him?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>He introduced himself to me. I liked him, actually.\n<br/>\n<br/><b>MRS GUGGENHEIM\n<br/></b>\n<br/>(resigned)\n<br/>\n<br/>Yeah, I know. So do I.\n<br/>\n<br/><b>EXT. COUNTRY CLUB - DAY\n<br/></b>\n<br/>Ronny and Donny set upon a pile of birthday presents at a table by the pool. They are surrounded by kids in swimsuits.\n<br/>\n<br/>Mr. Blume sits alone at the next table drinking a whiskey in front of the demolished birthday cake. He has a tattoo on his shoulder that says Semper Fi. There is a bucket of golf balls in front of him and he absently tosses them into the pool one at a time.\n<br/>\n<br/>He looks over at Mrs. Blume. She has red hair just like the twins. She is flirting with a pretty boy Tennis Pro. She looks back to Mr. Blume coldly.\n<br/>\n<br/>Mr. Blume gets up and walks around the pool. He pauses to shake hands with a Big Man drinking a glass of Scotch. The big man gives Mr. Blume a sudden shove toward the pool, but hangs on to him so he doesn't fall in. The big man laughs.\n<br/>\n<br/>Mr. Blume climbs up the ladder to the high dive. He sets down his cocktail. He slips and falls and bangs his knee hard on the edge of the board. He gets up quickly. There is a bad cut on his knee and he is bleeding. He looks out at the birthday party down below.\n<br/>\n<br/>People begin to notice him up there.\n<br/>\n<br/>He sprints down the board, bounces once as high as he can, and sails out long through the air. He tucks into a cannon ball. He nails the water with a huge splash.\n<br/>\n<br/>Mrs. Blume gets up with a bitter look on her face and heads for the ladies' room.\n<br/>\n<br/>Kids gather at the edge of the pool to look down at Mr. Blume playing dead at the bottom with golf balls all around him. A little boy in a Speedo underwear swims to examine Mr. Blume. Their eyes meet. The boy turns and swims away.\n<br/>\n<br/><b>INT. CLASSROOM - DAY\n<br/></b>\n<br/>Miss Cross' classroom. The walls are lined with fish tanks that glow blue and make bubbling sounds. There are maps and pictures everywhere. A model of a 747 hangs from the ceiling. A record player plays the Vienna Boys' Choir at a low volume.\n<br/>\n<br/>There is only one Kid in the room. He is taking a test. Miss Cross sits at her desk grading papers.\n<br/>\n<br/>Max cracks open the door.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Miss Cross?\n<br/>\n<br/>Miss Cross and the kid look back at Max. Miss Cross holds her finger to her lips and gets up. As she walks past the kid, she puts her hand on the top of his head. She goes to Max at the door. She whispers:\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>He's taking a make-up test.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>These guys have tests?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Of course.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I thought they just did coloring and stuff.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Oh, no. They're good readers.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'm Max Fischer. We met the other day.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I know who you are. How are you?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Fine, thank you.\n<br/>\n<br/>Max just stands there.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>You want to help me feed the fish?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Yes, please.\n<br/>\n<br/>Max follows her from tank to tank as she shakes out fish food. They continue to whisper to each other:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I thought I would just let you know, as per our conversation the other day -\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Latin?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Right. The Romance Languages. I gave a little speech -\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I heard about this.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You did?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Uh-huh. I understand you made a very convincing argument.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I thought you'd be pleased to hear they're going to continue the Latin program.\n<br/>\n<br/>She looks at Max. She sets down the fish food and shakes his hand.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I'm very impressed.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Thank you very much.\n<br/>\n<br/>Max picks up the can of fish food and shakes some into one of the aquariums.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You need an assistant?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>(smiles)\n<br/>\n<br/>Do we get to have assistants around here?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I doubt it. I'm on scholarship, though. Academic scholarship. So sometimes, I get to do odd jobs.\n<br/>\n<br/>(pause)\n<br/>\n<br/>How did you decide to teach at Rushmore?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>My husband went here.\n<br/>\n<br/>Max drops the can of fish food into the tank. He quickly fishes it out.\n<br/>\n<br/>He picks some little bits of fish food out of the water and throws them away. Pause.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I didn't know you were married.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Well, he's dead now. So I'm not actually married.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>When did he die?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Last year.\n<br/>\n<br/>Max nods. Silence.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>My mother's dead.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Oh. I'm sorry to hear that.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>She died when I was seven. (raising an eyebrow)\n<br/>\n<br/>So we both have dead people in our families.\n<br/>\n<br/>They look at each other for a minute.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Now what's going on in here?\n<br/>\n<br/>Max kneels down and looks into one of the fish tanks. There are a hundred little seahorses swimming around in it.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Those were just born.\n<br/>\n<br/>A look of wonder comes across Max's face. He stares into the blue water.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You really love fish, don't you?\n<br/>\n<br/>Miss Cross nods. Max puts his fingers to the glass.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>How much do these cost?\n<br/>\n<br/><b>INT. BLUME INTERNATIONAL CONCRETE - DAY\n<br/></b>\n<br/>Mr. Blume's office. HE is talking on the telephone. Max sits in a chair across from him.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>I don't want any alloys. I want steel.\n<br/>\n<br/>(pause)\n<br/>\n<br/>I don't give a rat's ass if he did. (pause) Steel, Harry.\n<br/>\n<br/>He hangs up.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>You change your mind? You want the job?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>No. But I've got an idea. And need some money.\n<br/>\n<br/>Mr. Blume's secretary buzzes him on the speakerphone.\n<br/>\n<br/><b>SECRETARY\n<br/></b>\n<br/>Mr. Blume, they're ready for you in Hydraulics.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Come with me. Let's hear your idea.\n<br/>\n<br/><b>INT. FACTORY - DAY\n<br/></b>\n<br/>Max, Mr. Blume, and a big foreman named Ernie race across the factory in a souped-up golf cart. They're squeezed together with Max in the middle.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Rushmore deserves an aquarium. A first class aquarium where scientists can lecture, and students can study marine life in their natural -\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>I don't know. What do you think, Ernie?\n<br/>\n<br/><b>ERNIE\n<br/></b>\n<br/>(skeptical)\n<br/>\n<br/>An aquarium?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>A huge aquarium. An entire building.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>What kind of fish?\n<br/>\n<br/><b>INT. FACTORY - DAY\n<br/></b>\n<br/>Mr. Blume and Max, wearing hard hats, stand on a scaffolding overlooking a huge cat of bubbling concrete.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(shouting)\n<br/>\n<br/>Electric eels. Barracudas. Stingrays. Hammerheads. Piranhas.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Piranhas?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>That's right. Piranhas. I talked to a man in South America.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Really. So you might have piranhas.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>We will have piranhas.\n<br/>\n<br/><b>INT. MR BLUME'S OFFICE - DAY\n<br/></b>\n<br/>Back in Mr. Blume's office. They're seated as before. Max is still wearing his hard hat.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>What does Guggenheim say?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Nothing. I felt I should go to you first.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Why?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Because at this moment I feel our best strategy is to keep a low profile. The more preparation I can do, the stronger our case will be when we go to the administration.\n<br/>\n<br/>Long pause.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>How much do you want?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>$35.000 for the initial plans.\n<br/>\n<br/>Max holds Mr. Blume's gaze. Mr. Blume picks up a pen.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>I'll give you $2500.\n<br/>\n<br/>Max nods. Mr. Blume writes out a check, tears it off, and hands it to Max. Max sticks it in his pocket like it is a five-dollar bill.\n<br/>\n<br/><b>RESEARCH MONTAGE:\n<br/></b>\n<br/>All of the following events occur during school hours.\n<br/>\n<br/>Max strides across the quadrangle with a determined expression. He's got an armload of books on marine life.\n<br/>\n<br/>Max watches a Jacques Cousteau film on 16mm in an empty classroom. Dirk runs the projector.\n<br/>\n<br/>Max visits a marine research facility and talks with a Scientist. Max holds up a fish at the edge of a pool. A killer whale jumps out of the water and takes it in its teeth.\n<br/>\n<br/>Max flies over Rushmore in a chopper with Mr. Blume. He shouts out details of the landscape and Mr. Blume nods enthusiastically. They are both eating sandwiches.\n<br/>\n<br/>They set down on the soccer field. Kids come running out to meet them. Max waves to them as he jumps out of the chopper. He looks back to Mr. Blume and gives him a thumbs-up. Mr. Blume smiles and waves as the chopper takes off.\n<br/>\n<br/>Max walks with a young Architect among the trees between the gym and the baseball diamond. They look at some blueprints. Max pulls up third base and slides it over a few feet.\n<br/>\n<br/>Max points to some beautiful fish in an aquarium in a pet shop. The pet shop Owner reaches in with a little net.\n<br/>\n<br/>Max pokes his head into Miss Cross's classroom. He holds up two plastic baggies full of water with tropical fish swimming around inside them.\n<br/>\n<br/>Kids gather all around them as they put the new fish into the aquariums. Max smiles mysteriously.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You need any help grading papers or anything?\n<br/>\n<br/><b>INSERT BOOK REPORT:\n<br/></b>\n<br/>The title is 'Young Ben Franklin'. Miss Cross writes Magnificent! Keep up the good work! And draws two stars across the top of the page with a red pen.\n<br/>\n<br/><b>INT. MISS CROSS'S CLASSROOM - DAY\n<br/></b>\n<br/>Max is staring at Miss Cross in a strange from a desk opposite hers in the empty classroom. She looks up at him. He continues to stare at her as if she were a statue.\n<br/>\n<br/>Miss Cross rubs her eyes and sighs. She sets down her red pen. She looks back at Max. He is still staring at her.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Max?\n<br/>\n<br/>Max looks quickly down to his papers.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Uh-huh?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Can I ask you something?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Sure.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Has it ever crossed your mind that you're way too young for me?\n<br/>\n<br/>Max looks up. Miss Cross smiles faintly. Silence.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>It's crossed by mind that you might consider that a possibility, yes.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Not to mention that you're a student -\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>And you're a teacher. And never the twain shall meet. I know, I'm not trying to pressure you into anything, Miss Cross. I'm surprised you brought it up so bluntly.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I just want to make sure -\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>We've become friends, haven't we?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Yes.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Good. That's all that matters to me.\n<br/>\n<br/>Max thinks for a second, then presses on:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>And the truth is neither one of us has the slightest idea where this relationships is going. We can't predict the future.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>We don't have a relationship, Max.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>But we're friends.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Yes. And that's all we're going to be.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>That's what I meant by relationship. You want me to grab a dictionary?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I just want to make sure we understand each other.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I understand. You're not attracted to me. C'est la vie. I'm a big boy.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Max. You're fifteen. Attraction doesn't enter into it.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>If you say so. All I'm getting at is I've never met anyone like you. Take that for whatever it's worth.\n<br/>\n<br/>She thinks about this for a minute.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I think I can safely say I've never met anyone like you, either.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You haven't, have you?\n<br/>\n<br/>Miss Cross shakes her head. Max says quietly:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You want to shake hands?\n<br/>\n<br/>She puts out her hand and they shake hands across the desk. But they don't let go. They just look at each other.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'm glad we had this conversation.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Me too.\n<br/>\n<br/>They finally let go of each other's hands. Miss Cross looks away. She's not exactly sure what they just decided.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>By the way. Are you free? Thursday night?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Free for what?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Dinner.\n<br/>\n<br/>She looks at Max strangely.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>We're getting a group together after the play.\n<br/>\n<br/><b>INSERT PLAYBILL:\n<br/></b>\n<br/><b>SERPICO\n<br/></b>\n<br/>A new play by Max Fischer.\n<br/>\n<br/><b>INT. AUDITORIUM - NIGHT\n<br/></b>\n<br/>A very realistic set for a New York tenement apartment.\n<br/>\n<br/>Four men sit at a table. Three wear dark suits: O'Reilly, Burnum and Fields. One has long hair, a beard, leather pants and a big silver crucifix around his neck. This is Frank Serpico. They are all played by high schoolers.\n<br/>\n<br/><b>FRANK\n<br/></b>\n<br/>I can't wear a wire! They're feeling me up every day!\n<br/>\n<br/><b>O'REILLY\n<br/></b>\n<br/>Come on, Frank. You'll have complete protection.\n<br/>\n<br/><b>FRANK\n<br/></b>\n<br/>(walking off)\n<br/>\n<br/>I've heard that one before. I got to go put a dime in the meter.\n<br/>\n<br/><b>BURNUM\n<br/></b>\n<br/>Look, Officer Serpico. If you agree to testify in open court -\n<br/>\n<br/>Frank wheels around and knocks the clipboard out of O'Reilly's hands. He grabs O'Reilly by both arms. Fields instinctively draws his firearm.\n<br/>\n<br/><b>FRANK\n<br/></b>\n<br/>Promise me one thing, O'Reilly. You're going to follow this all the way. To the end (snaps) Of the line, (snaps) where I got to be.\n<br/>\n<br/><b>O'REILLY\n<br/></b>\n<br/>(looking Frank right in the eye)\n<br/>\n<br/>So help me, God.\n<br/>\n<br/>The audience is deeply engrossed. A row of small kids are sitting on the floor very front.\n<br/>\n<br/>Max watches from the wings. He looks out at the audience.\n<br/>\n<br/>He sees Mr. Blume smiling proudly in the third row.\n<br/>\n<br/>He sees Miss Cross sitting next to a big, curly-haired Medical Student in surgical scrubs. She leans close to him and whispers something in his ear. He smiles and nods and whispers something back.\n<br/>\n<br/>Max stares at them blankly as a shoot-out erupts onstage.\n<br/>\n<br/><b>INT. BACKSTAGE - NIGHT\n<br/></b>\n<br/>Frank comes offstage with a bandage of his cheek and a cane in his hand. Max is waiting for him backstage. Max has on a headset and carries a clipboard. He is extremely keyed-up.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What happened to the cannoli line?\n<br/>\n<br/>Max follows Frank as Frank walks quietly toward the dressing room.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You're supposed to say, \"Forget about it, Sanchez -\"\n<br/>\n<br/><b>FRANK\n<br/></b>\n<br/>(very angry)\n<br/>\n<br/>I made a mistake, all right? It doesn't make any difference, anyway.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Hey, I'm letting it go. But don't tell me it doesn't matter. Every line matters.\n<br/>\n<br/><b>FRANK\n<br/></b>\n<br/>(yelling)\n<br/>\n<br/>Get off my back!\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Don't fuck with my play!\n<br/>\n<br/>Frank turns around and punches Max in the nose. Max takes a swing and misses and they wrestle as people try to break it up.\n<br/>\n<br/><b>INT. AUDITORIUM - NIGHT\n<br/></b>\n<br/>The whole cast is onstage bowing as the audience applauds. Some of the actors motion to the wings.\n<br/>\n<br/>Max walks out on the stage. He has a bloody Kleenex in each nostril. He waves to the audience. The applause roars.\n<br/>\n<br/><b>INT. BACKSTAGE - NIGHT\n<br/></b>\n<br/>The crowded dressing rooms. Actors are taking off their make- up. Max is drinking a champagne cocktail and talking with his father and an elderly Woman.\n<br/>\n<br/><b>WOMAN\n<br/></b>\n<br/>I thought the acting tonight was excellent.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>It was better in rehearsals.\n<br/>\n<br/>(to his father)\n<br/>\n<br/>I'll catch up with you later, Dad. I've got a dinner to go to.\n<br/>\n<br/><b>MR FISCHER\n<br/></b>\n<br/>(interested)\n<br/>\n<br/>Oh, yeah?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>Yeah. Cast and crew only.\n<br/>\n<br/>Mr. Fischer feels left out but tries not to show it.\n<br/>\n<br/><b>MR FISCHER\n<br/></b>\n<br/>OK. Well, have a good time.\n<br/>\n<br/>Miss Cross walks over to Max through the crowd. Her friend the medical student follows behind her. Max's expression is polite but inscrutable.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>That was great, Max.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'm so glad you could come.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I want you to meet a friend of mine. John Coats. Max Fischer.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(not looking at him)\n<br/>\n<br/>Who's this guy?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>John.\n<br/>\n<br/>Max looks at John. John smiles. Pause.\n<br/>\n<br/><b>JOHN\n<br/></b>\n<br/>I really liked your play, man. It was really cool.\n<br/>\n<br/>Max nods. He drinks a long sip of his champagne cocktail.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>What happened to your nose?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I got punched in the face.\n<br/>\n<br/>(to John)\n<br/>\n<br/>What's your excuse?\n<br/>\n<br/>Mr. Blume comes over to them.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Am I going to get to meet your dad tonight, Max?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Nah. The old man's on call tonight. Mr. Blume, I'd like you to meet Miss Cross, and I didn't catch this young gentleman's name.\n<br/>\n<br/><b>INT. RESTAURANT - NIGHT\n<br/></b>\n<br/>A fancy restaurant. Max is having dinner with Mr. Blume, Miss Cross and John. Max is drunk.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I like your nurse's uniform, guy.\n<br/>\n<br/><b>JOHN\n<br/></b>\n<br/>They're OR scrubs.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>OR they?\n<br/>\n<br/>Mr. Blume laughs suddenly and wine goes up his nose. Max glances to him slyly, then looks back at John.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Well, they're totally inappropriate for the occasion.\n<br/>\n<br/><b>JOHN\n<br/></b>\n<br/>Well, I didn't know we were going to dinner.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>That's because you weren't invited.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Take it easy, Max.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>(angry)\n<br/>\n<br/>You're the one who ordered him a Scotch and soda.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What's wrong with that? I can write a hit play. Why can't I have a drink when I want to unwind a little? So tell me, Curly. How do you know Miss Cross?\n<br/>\n<br/><b>JOHN\n<br/></b>\n<br/>We went to Harvard together.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(shrugs)\n<br/>\n<br/>And I wrote a hit play. And directed it. So I'm not sweating it, either.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(signaling the waiter)\n<br/>\n<br/>I'm going to get the check.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What do you think you're doing?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>I'm getting the -\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>No, you're not.\n<br/>\n<br/>The Waiter comes over. Max intercepts him:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I just wanted to thank you again for accommodating us. We only expected to be a party of three, but somebody invited himself along. I apologize.\n<br/>\n<br/><b>WAITER\n<br/></b>\n<br/>That's perfectly all right.\n<br/>\n<br/>The waiter walks away. Miss Cross frowns.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>You're being rude, Max.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>No I'm not. I'm just trying to figure out why you brought this gentleman to my play. And my dinner, which was invitation only.\n<br/>\n<br/>John reaches in front of Max for the butter. Max grabs his spoon and swats John on the back of the hand.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Would you like me to pass you the butter?\n<br/>\n<br/>Max hands John the butter.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>What's wrong with you?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(raising his voice)\n<br/>\n<br/>What's wrong with YOU?\n<br/>\n<br/>Max is making a scene. People all over the restaurant are watching. Max stares at Miss Cross.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You hurt my feelings. This night was important to me.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>How did I hurt your feelings?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I wrote a hit play!\n<br/>\n<br/>(pause)\n<br/>\n<br/>And I'm in love with you.\n<br/>\n<br/>John looks to Miss Cross. She doesn't know what to say. Max looks drunk and dejected.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>How do you like that, Curly?\n<br/>\n<br/><b>EXT. PLAYGROUND - DAY\n<br/></b>\n<br/>Miss Cross and her pupils are out on the playground painting pictures. Each kid has an easel.\n<br/>\n<br/>Miss Cross sees Mr. Blume standing under a tree at the edge of the playground. He is wearing sunglasses and smoking a cigarette. He moves slightly behind the tree. She stares at him.\n<br/>\n<br/>He waves. She waves back. He comes over.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Hi.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Were you hiding over there?\n<br/>\n<br/>Mr. Blume shrugs. He points at one of the paintings.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>What's that?\n<br/>\n<br/>The artist looks up at Mr. Blume. He is a small boy with jet- black curly hair and piercing eyes.\n<br/>\n<br/><b>ARTIST\n<br/></b>\n<br/>(makes a swimming gesture)\n<br/>\n<br/>It's a little swimming snake.\n<br/>\n<br/>Mr. Blume nods.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>What can I do for you, Mr. Blume?\n<br/>\n<br/>Mr. Blume turns to Miss Cross and takes off his sunglasses. Silence.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Max wants to see you.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>What for?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>To apologize, I guess.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>He sent you here?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Yeah.\n<br/>\n<br/>She frowns and studies Mr. Blume for a minute.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Are you his messenger?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>No. He's my friend.\n<br/>\n<br/>(pause)\n<br/>\n<br/>You were right. I shouldn't have let him drink.\n<br/>\n<br/>Miss Cross nods. Silence.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I don't think I should see Max anymore.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>He's not going to like the sound of that.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I know. But I think I let him get too attached.\n<br/>\n<br/>Mr. Blume nods. Miss Cross looks uncertain.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Don't you think?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(shrugs)\n<br/>\n<br/>I don't know. You did your best.\n<br/>\n<br/>Miss Cross smiles sadly to Mr. Blume. He puts his hands in his pockets.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Tell him I'm sorry.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/><b>OK.\n<br/></b>\n<br/>They look at each other for a long minute. Miss Cross tucks a strand of hair behind her ear. Mr. Blume says quietly:\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>What's your first name?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Rosemary. What's yours?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Herman.\n<br/>\n<br/>Silence.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Oh, yeah. He wrote you a letter.\n<br/>\n<br/>He hands her a letter in a sealed envelope. She takes it.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Thanks.\n<br/>\n<br/>They stand there in silence for another minute.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>OK. So long, Rosemary.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>(smiles)\n<br/>\n<br/>Bye, Herman.\n<br/>\n<br/>Mr. Blume starts to go. He stops He looks back to Miss Cross.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Should we meet somewhere?\n<br/>\n<br/>She hesitates.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>To talk about Max.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Yeah. I don't know.\n<br/>\n<br/>(pause)\n<br/>\n<br/>Maybe.\n<br/>\n<br/>Mr. Blume nods. He turns away and walks off. She watches him go. She looks at the envelope.\n<br/>\n<br/><b>INSERT LETTER WRITTEN IN CALLIGRAPHY ON CRISP STATIONERY:\n<br/></b>\n<br/>Max reads in voice-over.\n<br/>\n<br/>Dear Miss Cross,\n<br/>\n<br/>I would like to take this opportunity to formally apologize for the events of the night of the twenty-third. I am not accustomed to drinking alcohol. Please do me the service of coming to the unveiling of a new venture I have undertaken. I hope you will attend, if possible. I remain, your friend,\n<br/>\n<br/>Max Fischer.\n<br/>\n<br/><b>EXT. VACANT LOT - DAY\n<br/></b>\n<br/>A crowd of fifty Kids in uniform has gathered around the vacant lot beside the baseball field. Max stands with his architect, smiling for the yearbook photographer. They are holding a banner that says 'Cousteau-Blume Marine Observatory Fund-raiser'. Max has on a hard hat. There are two pick-up trucks and a porta-can at the back of the vacant lot.\n<br/>\n<br/>Max digs into the ground with a gold shovel. The shovel has a ribbon around it. Flashbulbs go off. Everyone claps. Max waves Dirk over.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Did you see her?\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>She's not here.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Well, see if she's in her classroom.\n<br/>\n<br/>The Contractor walks over to Max.\n<br/>\n<br/><b>CONTRACTOR\n<br/></b>\n<br/>Should we go ahead and take care of this tree?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Let's wait a few minutes.\n<br/>\n<br/>Coach Beck goes over to Max. He is six four and wears a John Newcombe mustache and an Adidas warm-up. He is frowning.\n<br/>\n<br/><b>COACH BECK\n<br/></b>\n<br/>What's going on here, Maxie?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Coach Beck. Good to see you. This is where they're building the new aquarium. I'm in charge of the committee, if you can believe it.\n<br/>\n<br/><b>COACH BECK\n<br/></b>\n<br/>This is the baseball diamond.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I believe it's being relocated a few feet over.\n<br/>\n<br/><b>COACH BECK\n<br/></b>\n<br/>(frowns)\n<br/>\n<br/>I should've been informed about that.\n<br/>\n<br/>Coach Beck walks off. Max answers some questions for the School Reporters.\n<br/>\n<br/><b>REPORTER\n<br/></b>\n<br/>Is it true the aquarium will have piranhas?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(smiles)\n<br/>\n<br/>Where'd you hear that?\n<br/>\n<br/><b>REPORTER\n<br/></b>\n<br/>My source indicated that it was a possibility.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Yes, it's true. Excuse me, George.\n<br/>\n<br/>Dirk has returned.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What's the story?\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>(a little wary)\n<br/>\n<br/>She has a substitute teacher today.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Why?\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>She probably got sick.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(looks away)\n<br/>\n<br/>You know she's not sick. Give me the phone.\n<br/>\n<br/>Max dials on a cellular phone.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Hi, Janet. It's Max Fischer.\n<br/>\n<br/>Is Mr. Blume there?\n<br/>\n<br/>(pause)\n<br/>\n<br/>Well, where is he?\n<br/>\n<br/>(pause)\n<br/>\n<br/>Goddammit, he's supposed to be here.\n<br/>\n<br/>Let me know if you find him, please.\n<br/>\n<br/>Max hangs up. He looks off and says in a steely voice:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'm going anyway.\n<br/>\n<br/>Max goes over to the contractor.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Chop it down, Mr. Chandler! We've got an aquarium to build.\n<br/>\n<br/>Max talks to another reporter.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I don't give a shit about barracudas. But fuck it. I'm building it anyway.\n<br/>\n<br/>The sound of power saws fills the air as Dr. Guggenheim appears at the edge of the lot with Coach Beck and a Security Guard with a walkie-talkie. DR Guggenheim screams:\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>Max!\n<br/>\n<br/>DR. Guggenheim sees the chopped-down trees and mangles baseball field as he strides on to the lot.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Nice to see you, Dr. Gugg-\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>Max!\n<br/>\n<br/>(seizing Max by the arm)\n<br/>\n<br/>What do you think you're doing?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>We're having a fund-raiser for-\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>Shut those damn things off!\n<br/>\n<br/>They turn off the power saws.\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>Tell me this isn't happening.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Dr. Guggenheim, I'd rather not have this conversation in front of the crew.\n<br/>\n<br/><b>EXT. QUADRANGLE - DAY\n<br/></b>\n<br/>Dirk waits nervously on the steps in front of DR. Guggenheim's office. He holds a hamster in his hands.\n<br/>\n<br/>He gets up and goes to the windows. He looks inside.\n<br/>\n<br/>Max is sitting in a little chair in the middle of the room with his hard hat on. DR. Guggenheim and several other faculty members sit around him. DR. Guggenheim is screaming at him across his desk. Max is crying.\n<br/>\n<br/>Dirk looks scared.\n<br/>\n<br/><b>INT. HALLWAY - DAY\n<br/></b>\n<br/>Max kneels on the floor in the hallway, emptying out his locker. Papers and trash are scattered all around him. There is a trashcan beside him. He is throwing away his books, one at a time.\n<br/>\n<br/>Mr. Blume opens the door at the end of the hallway. Max looks up at him. Silence. Max looks up back to his locker and starts throwing his books in the trash again.\n<br/>\n<br/>Mr. Blume walks over to Max. He looks very sad. He kneels down beside Max. He starts helping him pick up the trash off the floor and put it in the trashcan.\n<br/>\n<br/><b>TITLE:\n<br/></b>\n<br/>October.\n<br/>\n<br/><b>INT. GROVER CLEVELAND HIGH SCHOOL - DAY\n<br/></b>\n<br/>Grover Cleveland is a public high school with two thousand five hundred students.\n<br/>\n<br/>Max sits in a front row of a math classroom. He is dressed in his Rushmore uniform, with coat and tie, but his clothes are wrinkled and his head has been shaved like a marine's. His eyes have dark circles around them. He has a little stack of index cards in his hand.\n<br/>\n<br/>The teacher, Mrs. Whitney, stands at the front of the room. She is about fifty with a horn-rimmed glasses and a slight English accent. She has a bemused expression on her face.\n<br/>\n<br/><b>MRS WHITNEY\n<br/></b>\n<br/>We have a new student with us today. His name's Max Fischer and he's actually asked to say a few words to the class. Max? You want to take it away?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(standing up)\n<br/>\n<br/>Sure. Thanks very much. I just wanted to introduce myself.\n<br/>\n<br/>Max looks quickly at his notecards.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'm Max Fischer. I'm a former student of Rushmore Academy, which I recently got expelled from.\n<br/>\n<br/>Max flips to the next notecard.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>This is my first time in a public school. And I know you probably think I was born with a silverspoon in my mouth. But I'm no elitist. I think you've got some great facilities, and I'm really looking forward to making the best of it over here at Grover Cleveland.\n<br/>\n<br/>Max sighs deeply. He rubs his eyes. His Classmates have no idea what to make of him. However, one Asian girl in the back row is smiling faintly. She has short-cropped hair. The spine of one of her book covers says Margaret Yang.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>One footnote: I noticed you don't have a fencing team. I'm going to start one up. Let me know if you'd like to join. Thanks.\n<br/>\n<br/><b>INT. GROVER CLEVELAND HIGH SCHOOL - DAY\n<br/></b>\n<br/>The wide halls of Grover Cleveland High School are lined with orange lockers. A banner stretched down the wall says 'Murder the Mustangs'. A bustling throng of high schoolers rush to class.\n<br/>\n<br/>Max walks slowly, alone, down the middle of the hall. A blonde cheerleader-type Girl asks him:\n<br/>\n<br/><b>GIRL\n<br/></b>\n<br/>Why are you so dressed up?\n<br/>\n<br/>Max looks down at his clothes. Max looks back to the girl.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Are you insane?\n<br/>\n<br/>The girl walks off. Margaret Yang catches up to Max.\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Max?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Yes?\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Hi. I'm Margaret Yang. I'm in Mrs. Whitney's class. I just wanted to tell you I liked your speech. I don't think I've ever heard of anyone asking to give a speech in class before.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>How unfortunate.\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>The silver spoon remark might rub some people the wrong way. But I think I know how you meant it.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Glad to hear it. Goodbye, Miss Chang.\n<br/>\n<br/>Max ducks into the men's room. Margaret walks quietly away.\n<br/>\n<br/><b>INT. GYMNASIUM - DAY\n<br/></b>\n<br/>A tiny figure dressed all in white stands alone at the far end of the huge gymnasium with a fencing oil. He lunges, parries, and thrusts.\n<br/>\n<br/>The basketball team suddenly floods dribbling into the gymnasium, throwing passes and taking free throws. Max stops fencing as they take over the room. He watches them in silence. He shakes his head. He walks off the court.\n<br/>\n<br/><b>INT. HALLWAY - DAY\n<br/></b>\n<br/>Max puts a quarter in a pay phone. He is still wearing his fencing costume.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Janet. Max Fischer. Is he in?\n<br/>\n<br/><b>EXT. RUSHMORE - DAY\n<br/></b>\n<br/>Mr. Blume answers on his cellular phone as he gets out of his car and walks across the lawn at Rushmore.\n<br/>\n<br/>We intercut the two of them.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Hey, Max. How's it going over there?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Terrible. Tell me something. When you talk to Miss Cross the other\n<br/>\n<br/>day, did you get the feeling-\n<br/>\n<br/>The hall monitor Mr. Holstead comes down the hall toward Max. He is a big, sturdy man about fifty years old. He wears a striped tie and his sleeves rolled up.\n<br/>\n<br/><b>MR HOLSTEAD\n<br/></b>\n<br/>(loudly)\n<br/>\n<br/>Do you have a telephone pass?\n<br/>\n<br/>Max holds up his hand for Mr. Holstead to wait a minute. He covers his ear so he can hear Mr. Blume.\n<br/>\n<br/>Mr. Blume is looking in the windows of different classrooms. Kids look out at him curiously.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>I got to tell you, Max. I don't know what you see in her. I don't think she's right for you.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What's that supposed to mean?\n<br/>\n<br/>Mr. Blume sees Miss Cross inside teaching her class. He stares at her in a glance. He whispers:\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Well, she's not that beautiful. She's not that interesting. I mean, sure, there's something about her. But I see you with someone-\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Look, Mr. Blume. Your comments are valuable, but let's get to the point. Will she see me again? Yes or no?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>No.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'm going to go see her. Hang on.\n<br/>\n<br/>Max looks to Mr. Holstead.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'm talking on the telephone.\n<br/>\n<br/>Mr. Holstead reaches over and hangs up the phone.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Come on, man. That's rude.\n<br/>\n<br/><b>INT. GROVER CLEVELAND HIGH SCHOOL - DAY\n<br/></b>\n<br/>Mrs. Whitney watches from her classroom window at:\n<br/>\n<br/>Max opens a red metal door on to the empty concrete courtyard. He looks left and right. He sneaks across the courtyard to the bike racks, quickly unlocks his bike, and rides away.\n<br/>\n<br/><b>EXT. RUSHMORE - DAY\n<br/></b>\n<br/>Max rides full speed through the gates on to the Rushmore campus. He flips one leg off his bike and glides in toward the bike racks standing on one pedal.\n<br/>\n<br/>Max locks up his bike and walks across the lawn.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>You better beat it, laddie.\n<br/>\n<br/>Max looks up at Magnus Buchan sitting in a tree smoking a cigarette, hacking at a branch with a pocketknife.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I hope you fall out of that tree and get stick in the ass, Buchan.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>You know, I've watched you, Fischer. Showboat, always talking, picking a kid like Dirk cause his mother's a great piece and then getting nowhere. Like everything you do. Big show. No results.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>And what do you call getting a hand job from Mrs. Calloway in her Jaguar?\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>A bloody lie.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You think I got kicked out for just the aquarium? Nah. That ain't it. It was the hand job. And I'll tell you another thing. It was worth it. So eat your heard out, mick. I got business to attend to.\n<br/>\n<br/><b>EXT. PARKING LOT - DAY\n<br/></b>\n<br/>Miss Cross comes out the door of the lower school with a basket of books and papers. She stops in front of her wagon and digs in her bag for the keys.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Or do you want me to go?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>(looks around, sighs)\n<br/>\n<br/>You can talk to me.\n<br/>\n<br/>Miss Cross goes over to him. She stops a few feet away and they stand there in silence.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'm sorry I embarrassed you at dinner.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>That's OK.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>No, it's not. And please apologize to what's his name for me.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I will. Are you OK?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'm fine. But I miss Rushmore. I miss the seasons. And watching the leaves change.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>But it's only three blocks away.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I know. I miss seeing you.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>I miss you, too.\n<br/>\n<br/>Max looks off into the trees. A squirrel leaps from one branch to another. Max smiles and shakes his head. A crashing noise is heard from the roof of the planetarium. Someone ducks for cover, but Max and Miss Cross don't see him.\n<br/>\n<br/>Max reaches into his backpack and says mysteriously:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>By the way, what time does the library close? I got an overdue book to turn in.\n<br/>\n<br/>Max takes out the Jacques Cousteau library book and hands it to Miss Cross. She looks at it and starts to say something but she stops. She opens the book and looks at it in silence.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>That's your handwriting, isn't it?\n<br/>\n<br/>Max shows her the Henry James quote. Miss Cross nods.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Not bad. Except it's probably bad form for a teacher to write in a library book.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>It wasn't a library book when I wrote in it.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What do you mean?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I gave this book to Rushmore.\n<br/>\n<br/>Max looks puzzled. Miss Cross shows him a little card inside the front cover of the book.\n<br/>\n<br/><b>INSERT LIBRARY BOOK:\n<br/></b>\n<br/>In Memory of EDWARD APPLEBY\n<br/>\n<br/>Class of '87\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>My husband gave me this book in the seventh grade. And he went to Rushmore. So when he died I put it in the library here.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>So that's who that is. Edward Appleby.\n<br/>\n<br/>(looks to Miss Cross)\n<br/>\n<br/>You already knew him in the seventh grade?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I knew him all my life.\n<br/>\n<br/>(looks to Max)\n<br/>\n<br/>You remind me of him, you know?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I do? How?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Well. Weren't you in the Rushmore Beekeepers?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(frowns)\n<br/>\n<br/>Yeah. I was President of them.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>He founded that club.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>I get your meaning. I founded a few clubs myself in my day.\n<br/>\n<br/>An acorn falls on Max's head. He looks up. There is no one there, but a scurrying sound is heard. Max frowns.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What was that? A squirrel?\n<br/>\n<br/>Mr. Blume is crouched just out of view on the roof. He looks back over his shoulder and sees a small, white-haired, Indian GROUNDSKEEPER looking at him. The groundskeeper is holding a rake. Mr. Blume rises slowly. He whispers:\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Is this the natatorium?\n<br/>\n<br/>The groundskeeper frowns and shakes his head.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Do you think we can be friends again, Miss Cross? In a strictly platonic way?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Of course, I do. Do you think you can make a go of it and settle down at Grover Cleveland?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Yeah. But I need a tutor.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I'll be your tutor.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(looking into her eyes)\n<br/>\n<br/>You will?\n<br/>\n<br/>Miss Cross smiles and nods.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Thank you.\n<br/>\n<br/>(pause)\n<br/>\n<br/>What are you doing tomorrow?\n<br/>\n<br/><b>CUT TO:\n<br/></b>\n<br/>Mr. Blume sitting at the desk in his office. Max yells at him over the speakerphone:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>She's taking me to a field trip!\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(hesitates)\n<br/>\n<br/>Great! You need anybody to chaperone?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You'd take time out of your business to do that?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Business schmizness.\n<br/>\n<br/><b>OCTOBER MONTAGE:\n<br/></b>\n<br/>Max and Miss Cross ride in the backseat of a van full of first graders. Max is telling a story and everyone is laughing. Mr. Blume is up front quietly driving the van. One of the first graders sits in the passenger seat staring at him. They go through the front gates of the zoo.\n<br/>\n<br/>Miss Cross stands at the front of her classroom drawing a complicated geometric proof on the chalkboard. Max sits alone across from her nodding earnestly and taking notes.\n<br/>\n<br/>Max and Miss Cross play doubles against Mr. Blume and Dirk on the court in the Blume's backyard. Max coaches Miss Cross on her backhand. Mr. Blume watches her from across the net. Mrs. Blume watches all of them from an upstairs window.\n<br/>\n<br/>The Grover Cleveland Science Fair. Max sits proudly in front of his project. It is a paper mache tidal wave looming over a little coastal village with screaming peasants.\n<br/>\n<br/>Margaret Yang is across the aisle being photographed with a trophy for Best of Show. Her project is called Light, Color, Sound and Magnetism. She is staring at Max, but he doesn't notice her.\n<br/>\n<br/>Mrs. Whitney hands Max a geometry test. It has a C+ on it. Max looks quickly to Mrs. Whitney, surprised. She smiles and shakes his hand.\n<br/>\n<br/>A huge banner for the Grover Cleveland Owls is stretched across the endzone of the football field. Max, dressed in a shiny blue and grey jumpsuit, bursts through the banner and onto the field doing cartwheels and flips. The football teams scrambles out behind him.\n<br/>\n<br/>Max points out to different parts of the crows and yells football cheers. Dirk is sitting in between Mr. Blume and Miss Cross in the stands. Mr. Blume stares at Miss Cross. Miss Cross looks back and Mr. Blume and smiles. Dirk says significantly:\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Where's Mrs. Blume tonight, Mr. Blume?\n<br/>\n<br/>And your sons Ronny and Donny?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>I haven't the slightest idea, Dirk.\n<br/>\n<br/><b>INT. GROVER CLEVELAND HIGH SCHOOL. DAY\n<br/></b>\n<br/>Max burst through a doorway followed by a little ENTOURAGE of underclassmen that includes a sophomore named WOODY. Woody has long hair and a Led-Zepplin shirt. He is carrying a clipboard.\n<br/>\n<br/>They go down the hallway and quickly pass Margaret Yang. She is very nicely dressed in a grey turtleneck.\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Hi, Max.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Hi.\n<br/>\n<br/>Max keeps walking.\n<br/>\n<br/>He stops. He turns back to Margaret Yang. He looks her up and down. She is slightly uneasy. Max looks to Woody. Woody shrugs. Max looks back to Margaret.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What was your name again?\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Margaret Yang.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Are you free seventh period?\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Well, I'm supposed to have guitar lessons.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>Classical?\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Rock.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You can get out of it.\n<br/>\n<br/>(to Woody)\n<br/>\n<br/>put Margaret down for 3:30 in the auditorium, Woody.\n<br/>\n<br/>Max turns away and walks briskly down the hall with his entourage. He calls back to Margaret:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>And bring a headshot.\n<br/>\n<br/><b>EXT. MISS CROSS' HOUSE. DAY\n<br/></b>\n<br/>A nice two story house with a wide lawn and lots of trees. Mr. Blume knocks on the front door and waits nervously. He looks around the yard with his hands in his pockets.\n<br/>\n<br/>The door opens. Miss Cross is holding a plate of sliced carrots. She looks at Mr. Blume curiously and smiles.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Hi, Herman.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>How are you, Rosemary?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Fine, thanks. I just got home and I'm having a little snack.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Having some carrots.\n<br/>\n<br/>Miss Cross nods. Mr. Blume looks up at the house.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Nice house.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Yeah, This isn't mine. I'm' just kind of housesitting.\n<br/>\n<br/>(pause)\n<br/>\n<br/>Were you in the neighborhood?\n<br/>\n<br/>Mr. Blume nods. There is an awkward silence.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Didn't Max have anything planned for us today? A trip to the museum or something?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Did he? I thought he was rehearsing this evening.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Oh. That's right. His new play. He's going to be in this one, isn't he?\n<br/>\n<br/>Miss Cross nods. Mr. Blume shakes his head.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>He's really making a go of it over at Grover Cleveland.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I think he's on track. It's nice, isn't it?\n<br/>\n<br/>Mr. Blume nods. Silence.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>You want a carrot?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Yeah. I'll have one of those.\n<br/>\n<br/>Mr. Blume takes one of the carrots and has a bite of it. Miss Cross watches him chewing. She smiles slightly.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Well. Max had said something about us all going to the horseraces, so I'm sure I'll see you soon.\n<br/>\n<br/>Miss Cross nods. Mr. Blume takes another bite of his carrot and throws the rest of it into the yard. Miss Cross laughs. Mr. Blume smiles and shrugs. He starts to go.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Or we could go for a walk, if you want.\n<br/>\n<br/>Mr. Blume stops and turns around quickly.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Sure.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>It's nice out, don't you think?\n<br/>\n<br/>Kind of brisk.\n<br/>\n<br/>Mr. Blume nods.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Let me get a sweater. I'll be right back.\n<br/>\n<br/>She goes inside. Mr. Blume stands alone on the doorstep. He rubs his hands together to warm-up.\n<br/>\n<br/><b>INT. MUSEUM. DAY\n<br/></b>\n<br/>A class of Rushmore FOURTH GRADERS file past a big painting of a ship caught in a storm and disappear into the next room. One of them immediately comes back and looks around the corner. It is Dirk. He has seen something:\n<br/>\n<br/>Miss Cross and Mr. Blume are sitting on a bench in front of a Rembrandt. They are holding hands.\n<br/>\n<br/>Dirk narrows his eyes.\n<br/>\n<br/><b>EXT. RUSHMORE. DAY\n<br/></b>\n<br/>Mr. Blume is parked at the curb, staring off into space. Ronny and Donny jump into the car and slam the doors.\n<br/>\n<br/><b>RONNY\n<br/></b>\n<br/>Let's go.\n<br/>\n<br/>Mr. Blume automatically puts the car in gear. He slams on the brakes. Dirk is standing in front of the car, blocking them. He stares at Mr. Blume. Mr. Blume rolls down his window.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Dirk?\n<br/>\n<br/>Dirk does not budge. Mr. Blume gets out of the car and leaves it idling. He closes the door.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Dirk? What's wrong?\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>I know about you and the teacher.\n<br/>\n<br/>Silence. Mr. Blume looks very worried.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Does Max know?\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>No. And I don't want him to know. I just want it to stop. Right now.\n<br/>\n<br/>They stare at each other.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>You're a married man, Blume. And you're supposed to be his friend.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Look, Dirk. I am his friend -\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Yeah. And with friends like you, who needs friends?\n<br/>\n<br/>Dirk turns and walks off. Mr. Blume looks puzzled.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Jesus Christ.\n<br/>\n<br/>Mr. Blume sighs. He turns around and tries to open the car door. Ronny and Donny have locked him out of the car. He can see them inside laughing. He says fiercely:\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Unlock it!\n<br/>\n<br/><b>CUT TO:\n<br/></b>\n<br/>Dirk walking across the lawn with a hard look on his face. He walks past Magnus Buchan. Magnus is throwing Chinese throwing stars at a tree trunk.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>Little Calloway\n<br/>\n<br/>Dirk stops and looks to Magnus.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>You're standing up for the wrong bloke. Fischer ain't your mate.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>(angry)\n<br/>\n<br/>What are you talking about, Buchan?\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>(shrugs)\n<br/>\n<br/>He thinks your mum's good for a bonk. That's why he picked you as his chapel partner.\n<br/>\n<br/>Dirk looks deeply wounded. But he doesn't want to believe it:\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Who sold you that crock?\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>He told me himself. He says she gave him a hand job in the backseat of her bloody Jaguar.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Max would never say that.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>(smiles)\n<br/>\n<br/>Yeah. You're probably right. After all, the son of a brain doctor doesn't need to impress anybody.\n<br/>\n<br/>Buchan laughs wickedly and fires off another throwing star.\n<br/>\n<br/><b>INT. GROVE CLEVELAND HIGH SCHOOL. NIGHT\n<br/></b>\n<br/>The school auditorium . Max is onstage dressed as a South Central lowrider called Little Juan. He is opposite a senior named 40 OUNCE and Margaret Yang, who plays Blue Eyes. While they are rehearsing the scene a MESSENGER comes in with an envelope for Max.\n<br/>\n<br/><b>LITTLE JUAN\n<br/></b>\n<br/>The killing has got to stop, esse. It's getting too loco. No more gats.\n<br/>\n<br/><b>40 OUNCE\n<br/></b>\n<br/>Nigger, you're the crazy one. Motherfuckers be wanting to kill you. Are you talking about getting rid of your gun?\n<br/>\n<br/><b>LITTLE JUAN\n<br/></b>\n<br/>It's time, homey.\n<br/>\n<br/><b>BLUE EYES\n<br/></b>\n<br/>Kiss me, Little Juan.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(suddenly out of character)\n<br/>\n<br/>Then he kisses her and we're out. OK.\n<br/>\n<br/>(pointing to the messenger)\n<br/>\n<br/>Is that for me?\n<br/>\n<br/>The messenger gives Max the envelope. Max opens it.\n<br/>\n<br/><b>INSERT LETTER:\n<br/></b>\n<br/>Written neatly in blue crayon on paper torn from a spiral notebook. Dirk reads in VOICEOVER dripping with sarcasm.\n<br/>\n<br/>Dear Max,\n<br/>\n<br/>I'm sorry to say that I have secretly found out that Mr. Blume is having an affair with Miss Cross. My first suspicions came when I saw them frenching at the museum, and then I knew for sure when they went skinny dipping in Mr. Blume's swimming pool, giving each other hand jobs while you were taking a nap on the front porch. Why am I telling you this now? Because you're such a good friend. Take care, pal.\n<br/>\n<br/>Fondly,\n<br/>\n<br/>Dirk Calloway\n<br/>\n<br/><b>EXT. MISS CROSS' HOUSE. NIGHT\n<br/></b>\n<br/>Mr. Blume puts on his jacket as he walks down the front path from Miss Cross' house. He gets in his Bentley and starts the engine. He looks in the rearview mirror and sees the glowing red tip of a cigarette. He wheels around fast.\n<br/>\n<br/>Max is sitting in the backseat smoking a cigarette.\n<br/>\n<br/><b>BLUME\n<br/></b>\n<br/>Max!\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>How was she, Herman?\n<br/>\n<br/><b>BLUME\n<br/></b>\n<br/>Jesus Christ!\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Was she good? I bet she was. Although I wouldn't know cause I never screwed her.\n<br/>\n<br/>Blume flicks on the lights. Max has tears all over his face.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(with bitter contempt)\n<br/>\n<br/>Going skinny-dipping while I took a nap. Are you comfortable, Max? I'll just be out nude getting hand jobs from the woman you love.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(frowns)\n<br/>\n<br/>We never went skipping dipping.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Sure, you didn't. And next you're going to tell me you didn't just walk out of her house at two o'clock in the morning.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>I'm in love with her.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Well, I was in love with her first. And all that crap about, I don't think she's that great, I don't think she's right for you, Max. That was all bullshit, wasn't it?\n<br/>\n<br/>Silence.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Do you think she's in love with you?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>I don't know.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Well, I guarantee you she's not.\n<br/>\n<br/>And she never will be.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Look, Max -\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I saved Latin!\n<br/>\n<br/>Max glares at Mr. Blume. He shakes his head.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What'd you ever do?\n<br/>\n<br/><b>INT. CLASSROOM. DAY\n<br/></b>\n<br/>Miss Cross' class. A little boy named BENJAMIN reads his story in front of the class. Miss Cross sits in a chair at the back. Max appears in the doorway.\n<br/>\n<br/><b>BENJAMIN\n<br/></b>\n<br/>On the planet I'm from the sun only comes out once a year. That is -\n<br/>\n<br/>Max coughs loudly. Miss Cross turns around. Max motions to her. She holds up her index finger for him to wait.\n<br/>\n<br/><b>BENJAMIN\n<br/></b>\n<br/>That is why my skin is the color of a cloud, said the old -\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(loudly)\n<br/>\n<br/>I just came by to thank you for wrecking my life.\n<br/>\n<br/>Max slams the door.\n<br/>\n<br/>Max stands alone smoking a cigarette in front of a pile of leaves. A LAWN CREW is raking in the background.\n<br/>\n<br/>Max strikes a match, throws it on the leaves, and watches sadly as the leaves burn and smoke rises black into the crisp autumn air. He takes off his Rushmore blazer and throws it on the fire. He looks up at the sky and says quietly:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Sic transit gloria, Mr. Blume.\n<br/>\n<br/>Sic transit gloria.\n<br/>\n<br/><b>EXT. PARK. DAY\n<br/></b>\n<br/>A cold day. Dry leaves fall from the trees in the park.\n<br/>\n<br/>Mr. Blume comes down the path to Max sitting alone on a bench. Max is dressed in blue jeans, a plaid shirt, a ski cap, and huge down parka. Mrs. Blume is wearing a topcoat and gloves. Max stands up to shake hands with her.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Thank you for meeting me.\n<br/>\n<br/><b>MRS. BLUME\n<br/></b>\n<br/>(coldly)\n<br/>\n<br/>You're welcome.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Would you like a sandwich?\n<br/>\n<br/>Silence. Mrs. Blume looks around the park.\n<br/>\n<br/><b>MRS. BLUME\n<br/></b>\n<br/>All right.\n<br/>\n<br/>She sits down. Max takes two sandwiches out of his backpack.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I have tuna fish and I have peanut butter and jelly. I'm sorry it's not something more exotic.\n<br/>\n<br/><b>MRS. BLUME\n<br/></b>\n<br/>I'll take the tuna fish.\n<br/>\n<br/>Max gives her the tuna fish sandwich.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Milk or apple juice?\n<br/>\n<br/>Max holds out the two drinks. Mrs. Blume just stares at him.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You want me to cut to the chase?\n<br/>\n<br/>Silence. Max puts down his sandwich and gathers his thoughts.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>OK. As you know, Mr. Blume and I used to be friends.\n<br/>\n<br/><b>MRS. BLUME\n<br/></b>\n<br/>I have no idea what the relationship is between you and Herman. Honestly, I find it very bizarre.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(taken aback)\n<br/>\n<br/>What do you mean to imply?\n<br/>\n<br/><b>MRS. BLUME\n<br/></b>\n<br/>I'm not implying anything. You make a very strange couple. It's too bad Herman doesn't have that kind of affection for his own children.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Well, I'm sure he does.\n<br/>\n<br/><b>MRS. BLUME\n<br/></b>\n<br/>No, he doesn't.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I know you don't really mean that.\n<br/>\n<br/><b>MRS. BLUME\n<br/></b>\n<br/>(angry)\n<br/>\n<br/>Of course, I do.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>From his perspective it's -\n<br/>\n<br/><b>MRS. BLUME\n<br/></b>\n<br/>Why did you call me?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>That's what I'm trying to tell you.\n<br/>\n<br/><b>MRS. BLUME\n<br/></b>\n<br/>(icily)\n<br/>\n<br/>Please. Get to the point.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Gladly. Your husband's fucking a schoolteacher, pardon my French. I thought you should know.\n<br/>\n<br/>Silence.\n<br/>\n<br/><b>MRS. BLUME\n<br/></b>\n<br/>Why are you telling me this? Are you trying to hurt Mr. Blume? Or are you trying to hurt me?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I have no reason to want to hurt you.\n<br/>\n<br/><b>MRS. BLUME\n<br/></b>\n<br/>Then you're trying to hurt Herman.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>That's correct.\n<br/>\n<br/><b>INT. THE BILBY-FLICKENGER HOTEL. NIGHT\n<br/></b>\n<br/>The vast lobby of the Bilby-Flickenger. Mr. Blume is leaning against the counter at the front desk. His luggage fills up two carts behind him. A faint smile plays across his lips as he stares off into space. The CONCIERGE is checking him in.\n<br/>\n<br/><b>CONCIERGE\n<br/></b>\n<br/>And how long will you be staying with us, Mr. Blume?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Indefinitely. I'm getting a divorce.\n<br/>\n<br/><b>CONCIERGE\n<br/></b>\n<br/>(typing away)\n<br/>\n<br/>Very good, sir.\n<br/>\n<br/>Mr. Blume yells to the BELLMAN.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Yo!\n<br/>\n<br/>The bellman looks up. Mr. Blume waves. The bellman waves back. The concierge gives Mr. Blume his room key.\n<br/>\n<br/><b>CONCIERGE\n<br/></b>\n<br/>Here you are Mr. Blume. Charles will show you to your room.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Wonderful. Where's the pool, by the way? I might want to take a dip before dinner.\n<br/>\n<br/><b>CONCIERGE\n<br/></b>\n<br/>It's on the roof, sir.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Terrific!\n<br/>\n<br/>Mr. Blume gets on the elevator with the bellman. The bellman looks at him and smiles.\n<br/>\n<br/><b>BELLMAN\n<br/></b>\n<br/>You certainly seem happy today, sir.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>You bet your little ass I am, shorty. I lost my family. But I gained a woman I love.\n<br/>\n<br/><b>BELLMAN\n<br/></b>\n<br/>Not a bad tradeoff.\n<br/>\n<br/><b>INT. HOTEL ROOM. DAY\n<br/></b>\n<br/>The living room of Mr. Blume's suite. Mr. Blume is dressed in a bathrobe with the Bilbly-Flickenger stitched on the pocket. He sits at his table having breakfast and reading the newspaper. There is a little basket in front of him with a jar of hone in it. A note attached to the jar says, \"Enjoy your stay.\"\n<br/>\n<br/>A little bug flies around Mr. Blume's head. He swats it away and keeps reading.\n<br/>\n<br/>Two more bugs come buzzing around him. Mr. Blume looks up and frowns. They're bees. Mr. Blume slaps at his neck and jumps to his feet as he gets stung.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Shit!\n<br/>\n<br/>Bees are circling all over the room. Mr. Blume looks around frantically. He sees something at the bottom of the front door. It is a little plastic tube with bees crawling out of it and taking off.\n<br/>\n<br/><b>INT. BASEMENT. DAY\n<br/></b>\n<br/>Max comes out of the freight elevator wearing a red room service jacket with the Bilby-Flickenger stitched on the pocket. He has a wooden box with Rushmore Beekeepers stenciled on it. Max throws the jacket in a laundry cart and goes out the back door.\n<br/>\n<br/><b>EXT. GROVER CLEVELAND HIGH SCHOOL. DAY\n<br/></b>\n<br/>Mr. Blume gets out of his car in the driveway at Grover Cleveland. He opens the trunk and takes out a set of steel cable cutters. He goes over to the bike racks and cuts the lock off Max's ten-speed.\n<br/>\n<br/>Mr. Blume lays the bicycle on the ground in front of his car and runs over it. Then he throws the car in reverse and goes over it again. He picks up the destroyed bicycle and takes it back to the bike racks and wraps the lock back around it.\n<br/>\n<br/>The small Indian groundskeeper we saw earlier on the roof is driving by in a Volkswagen Beetle. He frowns at Mr. Blume. Mr. Blume hurries back to his car.\n<br/>\n<br/><b>EXT. BLUME INTERNATIONAL CONCRETE. DAY\n<br/></b>\n<br/>The front gates of the concrete plant. Max rides up on an old grandmothers' bicycle with fenders and a handlebar basket. He's got a black duffel bag strapped to his back.\n<br/>\n<br/>Max waves to the SECURITY GUARD. The guard waves back:\n<br/>\n<br/>Max rides onto the lot and pulls over next to Mr. Blume's Bentley. He leans his bike against the car door. He unzips his duffel bag and slides underneath the car.\n<br/>\n<br/><b>EXT. RUSHMORE. DAY\n<br/></b>\n<br/>Mr. Blume pulls into the driveway to pick-up the twins from school. There is a lot of traffic and kids are running around everywhere. Mr. Blume taps the brakes. Nothing happens. He flies toward the back of a parked station wagon.\n<br/>\n<br/>He jerks the steering wheel and bounces up onto the sidewalk. The car pops through a wooden fence and rolls across the grass into the quadrangle.\n<br/>\n<br/>The Indian groundskeeper is raking leaves as the car goes past him. He watches as it crunches over some bushes and scrapes against a stone wall. It rolls to a stop in the middle of the quad.\n<br/>\n<br/>Mr. Blume gets out of the car and looks at the damage. He looks over at the white-haired Indian groundskeeper.\n<br/>\n<br/>The groundskeeper goes back to raking.\n<br/>\n<br/><b>EXT. PARKING LOT. DAY\n<br/></b>\n<br/>Kids watch from classrooms up and down the hall as Max is escorted away in handcuffs by the POLICE. Max has a hardened expression on his face.\n<br/>\n<br/><b>INT. POLICE STATION. DAY\n<br/></b>\n<br/>The county lock-up. Mr. Fischer watches through bulletproof glass as Max walks down a long, lonely corridor.\n<br/>\n<br/>The door buzzes open. Max comes into the waiting room.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Thanks for bailing me out, Dad. Can you drop me off at Rushmore? I got to go settle a score.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>(hesitates)\n<br/>\n<br/>You think that's wise, Max?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(angry)\n<br/>\n<br/>Dad. Please. Stay out of it.\n<br/>\n<br/><b>EXT. RUSHMORE. DAY\n<br/></b>\n<br/>Max walks into the quadrangle with cold expression on his face. It is Halloween and there is a jack-o-lantern on the steps. Lots of kids are dressed in costumes.\n<br/>\n<br/>Suddenly, Max is being pelted with rocks. He looks around frantically and sees Dirk and a longhaired kid named TOMMY STALLINGS as they set upon him.\n<br/>\n<br/>Dirk is dressed as a sorcerer. Tommy has on a karate outfit with a black belt. Max runs for cover behind some bushes.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What are you doing? Are you crazy?\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>You're trespassing! This is private property!\n<br/>\n<br/>More rocks sail past Max. A pinecone hits him on the head.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Wait a minute! Stop!\n<br/>\n<br/>Max raises his hands in the air. Dirk motions for Tommy to hold his fire. Max slowly stands up.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Let's have a truce for a second. I want to talk.\n<br/>\n<br/>They meet out in the open. Tommy follows with a rock in each hand. Silence.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What's this all about?\n<br/>\n<br/>Dirk stares at Max or along minute.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Did you say my mother gave you a hand job?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(shocked)\n<br/>\n<br/>What?\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>(steely)\n<br/>\n<br/>Did you say it?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Who told you that goddamn lie?\n<br/>\n<br/>Silence.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Never mind. I know who said it. And I'm going to stick a knife in his heart. And I'm going to send him back to Ireland in a bodybag.\n<br/>\n<br/><b>TOMMY\n<br/></b>\n<br/>He's from Scotland.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Well, tell that stupid mick he just made my list of things to do today. I'm going to pop a cap in his ass.\n<br/>\n<br/><b>INT. TEAROOM. DAY\n<br/></b>\n<br/>A little salon with Persian rugs. There is a fire in the fireplace and a harpsichord plays softly on the radio. Dr. Guggenheim is sitting at a little table having tea with Max.\n<br/>\n<br/>Dr. Guggenheim has several bottles of prescription medicine in front of him and a blanket wrapped around him like a shawl. He stares at Max stonily. There is a manila envelope on the table in between them.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Did you receive the package?\n<br/>\n<br/>Dr. Guggenheim motions to the envelope. Max nods.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Good. I just wanted to inform you about what's going on.\n<br/>\n<br/>Dr. Guggenheim stares at Max with contempt.\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>I never took you for an informer, Max.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(frowns)\n<br/>\n<br/>What's that suppose to mean?\n<br/>\n<br/>Silence. Max reaches out to take the envelope. Dr. Guggenheim slams his hand on it and leans across the table at Max.\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>(fiercely)\n<br/>\n<br/>She resigned this morning.\n<br/>\n<br/>Before I even got your little snapshots. So your latest attempt at sabotage has backfired.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>But she's one of the best teachers you've got.\n<br/>\n<br/>(yelling)\n<br/>\n<br/>How could you let her resign?\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>Why are you trying to get her fired?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You stupid old fool! I'm trying to win her back!\n<br/>\n<br/>Dr. Guggenheim starts coughing and turning red. He knocks the envelope off the table and the pictures spill out all over the floor.\n<br/>\n<br/><b>INSERT PHOTOGRAPHS ON THE FLOOR:\n<br/></b>\n<br/>They're of Mr. Blume and Miss Cross kissing in the window of a Chinese restaurant.\n<br/>\n<br/><b>INT. MISS CROSS' CLASSROOM. DAY\n<br/></b>\n<br/>A crew of MOVERS is rolling one of Miss Cross' aquarium out of the classroom on a dolly as Max comes to the door. Miss Cross is on the other side of the classroom taking down a map from the wall. Her books and papers are stacked in boxes.\n<br/>\n<br/>Max watches her in silence for a minute before saying:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Miss Cross?\n<br/>\n<br/>She turns around to look at Max. Silence.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Hi, Max.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You need any help?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>No. I have it.\n<br/>\n<br/>She pricks her finger and holds it to her mouth.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Dammit.\n<br/>\n<br/>Max starts to go in the room to help her.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Here. Let me see.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>No. Please, don't come in here. Look. I'm sorry I hurt you. I'm sorry I love your friend instead of you. But just. Please, Max.\n<br/>\n<br/>Miss Cross has tears in her eyes. Max goes slowly toward her.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You honestly believe you love Blume instead of me?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Yes.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You'll forgive me if I won't take your word for that.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Stop. If you don't stop with that ping-pong talk, I'm going to lose it. Do you understand me?\n<br/>\n<br/>Max takes Miss Cross' hand and kisses it. She pulls her and away. Max tries to embrace her. They struggle and Miss Cross overpowers Max. She holds his arms behind his back.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Let me go!\n<br/>\n<br/>Max struggles some more. Miss Cross pushes him hard across the room. Max smashes into some chairs and knocks over a desk. He yells at her:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I got kicked out because of you!\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>You got kicked out because -\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Rushmore was my life. Now you are!\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>That's bullshit!\n<br/>\n<br/>Silence.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>What do you really think is going to happen between us? You think we're going to have sex?\n<br/>\n<br/>Max looks shocked.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>That's kind of a cheap way to put it, don't you think?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>Not if you've never fucked before, it isn't.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(stunned)\n<br/>\n<br/>Oh, my God.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>How would you put it to your friends? Do you want to finger me? Or maybe I could give you a hand job in the back of a Jaguar. Would that put an end to all of this?\n<br/>\n<br/>Miss Cross moves towards Max with her hand outstretched. Max retreats backwards, banging into desks and chairs. Miss Cross stops.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Please. Get out of my room.\n<br/>\n<br/>Max walks out of the room and stands in the doorway.\n<br/>\n<br/>Miss Cross turns away and goes back to taking down her maps from the wall. Max watches her for a minute.\n<br/>\n<br/>Max leaves.\n<br/>\n<br/><b>EXT. QUADRANLGE. DAY\n<br/></b>\n<br/>Max comes out the door of the lower school in a daze. Magnus Buchan is sitting on a bench eating some candy. He is wearing the uniform of the Green Beret. He sees Max and laughs.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>Fischer, ya spotty fucker!\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Hello, Magnus.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>Got any hand jobs lately?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>No, I haven't.\n<br/>\n<br/>Dirk appears with some of his friends.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>Hey, Dirk! Look who's here. Your stepfather! Waitin' for your mum so he can get a piece.\n<br/>\n<br/>Dirk is very embarrassed. He frowns and looks at the ground. Max stares at Magnus with bitter contempt.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Your mind is as warped as your ear, Buchan.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>(standing up)\n<br/>\n<br/>Don't get nasty, brother.\n<br/>\n<br/>Max breaks into a sprint straight at Magnus.\n<br/>\n<br/>Magnus draws back and nails Max in the cheek. Max goes down but gets right back up. They throw a flurry of punches at each other's faces. Some kids come running over to watch.\n<br/>\n<br/>Max tackles Magnus around the legs. Magnus throws a hard punch straight down at the top of Max's head. Max goes limp and collapses to the ground.\n<br/>\n<br/><b>CUT TO:\n<br/></b>\n<br/>Max's eyes opening. He is lying his back in a pile of leaves. A bunch of little kids have circled around him.\n<br/>\n<br/>Max's nose bleeds profusely. One of his eyes is swollen shut. He's got several smaller cuts all over his face. His shirt is torn more or less in half. He looks up at Dirk standing over him. He lifts up his hand to Dirk.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>We got him, Dirk. We got him.\n<br/>\n<br/>But Dirk does not take Max's hand. He turns away.\n<br/>\n<br/><b>EXT. CEMENTARY. DAY\n<br/></b>\n<br/>Mr. Blume spots Max sitting Indian-style at the foot of his mother's grave on a cold grey day. The simple epitaph reads: Eloise Fischer, beloved wife of Bert and mother of Max. Written below it says: the paths of glory lead but to the grave. Mr. Blume approaches warily.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Max?\n<br/>\n<br/>Max looks up. There is quite a sadness about him and his voice has lost all feeling of possibility.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Hi, Mr. Blume.\n<br/>\n<br/>Mr. Blume stands there in silence.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>You wanted to meet?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>When?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Right now. You said you wanted to meet to put an end to this nonsense.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Oh. Yeah. I was going to try and have that oak tree fall on you.\n<br/>\n<br/>Max jerks him thumb over his shoulder. Mr. Blume looks at a massive oak tree hanging precariously by the roots.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>That big one? That would have really pancaked me.\n<br/>\n<br/>(pause)\n<br/>\n<br/>What stopped you?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(shrugs)\n<br/>\n<br/>What's the use? She loves you.\n<br/>\n<br/>Max gets up. They look at each other in silence.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>So long Mr. Blume.\n<br/>\n<br/>Max starts to walk away. Mr. Blume calls after him.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>She's my Rushmore, Max.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(without stopping)\n<br/>\n<br/>Yeah, I know. She was mine, too.\n<br/>\n<br/>Max leaves the cemetery. Mr. Blume stands alone. He goes over to the tree and taps it. It comes crashing down.\n<br/>\n<br/><b>TITLE:\n<br/></b>\n<br/>November.\n<br/>\n<br/><b>THANKSGIVING MONTAGE:\n<br/></b>\n<br/>Max walks down the street with his lunch in a brown paper bag. He goes into the barbershop. He nods hello to his father and puts on a white barber's jacket. He has a blank, hollow expression on his face.\n<br/>\n<br/>Max gives an old man a haircut while the old man reads the paper. Max gives another old man a shave. Man combs another old man's hair and holds up a mirror so he can see the back.\n<br/>\n<br/>Dirk rides past the barbershop on his little French three-speed. He circles back and looks at Max take the trash out to the dumpster. Max doesn't see him. Dirk pedals away.\n<br/>\n<br/>Margaret knocks on the front door of the Fischers' house. Mr. Fischer opens the door. He and Margaret talk for a minute. Mr. Fischer shakes his sadly. Margaret nods.\n<br/>\n<br/>Mr. Fischer closes the door as Margaret walks out to the sidewalk. She looks back at the house. Max is sitting on the window, staring off into space. Margaret hesitates. She goes across the yard to the window.\n<br/>\n<br/>She taps on the glass. Max looks out to her. She waves to him. Max closes the curtains.\n<br/>\n<br/>Margaret turns away sadly and walks off down the sidewalk.\n<br/>\n<br/>Max and Mr. Fischer sit in front of the TV having TV Thanksgiving dinners as they watch a football game. Mr. Fischer looks at Max. Max stares at the television set.\n<br/>\n<br/><b>TITLE:\n<br/></b>\n<br/>December.\n<br/>\n<br/><b>INT. BARBERSHOP. EVENING\n<br/></b>\n<br/>There is a wreath on the door and some blinking lights are strung-up. The last customer of the day comes out and walks away through the snow. Mr. Fischer is putting on his sweater while Max washes some combs and scissors in the sink.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>It's been nice having your company here at the shop, Max.\n<br/>\n<br/>Max nods.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>Have you put anymore thought into giving school another shot?\n<br/>\n<br/>Max shakes his head. Mr. Fischer puts on a hunting cap with earflaps and a down parka. He zips it up. Pause.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>Max, I like being a barber. I'm good at it and I enjoy it. But I always thought you'd try a different line of work.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Like what?\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>I don't know. You talked about being a diplomat. Or a senator.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Pipe dreams Dad. Nothing but pipe dreams. I'm a barber's son.\n<br/>\n<br/>Max turns on the radio and goes back into washing the combs and scissors. Mr. Fischer sighs. He puts on his gloves. He goes out the door.\n<br/>\n<br/>Max flips the sign on the door from open to closed. He takes off his barber's jacket and hangs it on the coatrack. He goes into the back room.\n<br/>\n<br/>He comes back into the room carrying a broom. He stops.\n<br/>\n<br/>Dirk is sitting in one of the barber's chairs across the room. Silence. Max starts sweeping the floor.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(not looking at him)\n<br/>\n<br/>Hello, Dirk.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Hi, Max.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What can I do for you?\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>I thought I might get a haircut.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>We're closed.\n<br/>\n<br/>Dirk nods. Max keeps sweeping.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Well, I just wanted to tell you I'm sorry I threw rocks at you the other day.\n<br/>\n<br/>(getting up)\n<br/>\n<br/>But I guess I'll go now.\n<br/>\n<br/>Dirk sets a little gift-wrapped present on the counter.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Merry Christmas.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Max stops sweeping and looks over at Dirk.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What in the hell is that?\n<br/>\n<br/>Dirk shrugs. Max goes over to the counter and picks up the present. He unwraps it. It is a Swiss Army Knife with an inscription on it.\n<br/>\n<br/><b>INSERT SWISS ARMY KNIFE:\n<br/></b>\n<br/>Max Fischer\n<br/>\n<br/>Rushmore Yankee\n<br/>\n<br/><b>1985-1997\n<br/></b>\n<br/>Max looks at the knife for a minute. He says wearily:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>OK. Sit down.\n<br/>\n<br/>Dirk sits back down in the barber's chair. Max puts his white jacket back on and starts giving Dirk a haircut. There is just a sound of scissors snipping for a minute.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Have you heard the news?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I doubt it. I don't really follow the news anymore.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Dr. Guggenheim had a stroke.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'll send him a box of candy.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Maybe you ought to go visit him.\n<br/>\n<br/>Max stops snipping. Pause.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>No, thanks.\n<br/>\n<br/>Max starts snipping again.\n<br/>\n<br/><b>EXT. BARBERSHOP. EVENING\n<br/></b>\n<br/>Dirk comes out of the barbershop in a terrible haircut. He waves to Max and rides off in his three-speed.\n<br/>\n<br/><b>INT. BARBERSHOP. EVENING\n<br/></b>\n<br/>Max waves back to Dirk. He reaches into the cooler and takes out a bottle of Schlitz. He pops it open with the bottle opener on the Swiss Army Knife. He drinks a sip and looks out into the lightly falling snow. He says quietly to himself:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I always thought I'd be the one to give him a stroke.\n<br/>\n<br/><b>INT. HOSPITAL ROOM. NIGHT\n<br/></b>\n<br/>Dr. Guggenheim is in his hospital bed with his eyes half-shut and a bunch of plastic tubes sticking out of him. Mrs. Guggenheim sits in a chair at the foot of the bed reading a biography on Churchill. She looks exhausted.\n<br/>\n<br/>Max appears in the open doorway. He has a bouquet of violets in his hand. He knocks.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Mrs. Guggenheim?\n<br/>\n<br/>Mrs. Guggenheim looks up. Her face brightens and she goes to greet Max.\n<br/>\n<br/><b>MRS. GUGGENHEIM\n<br/></b>\n<br/>Hello, Max. How are you?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(desolate)\n<br/>\n<br/>Fine, thanks.\n<br/>\n<br/>Max starts to shake hands, but Mrs. Guggenheim hugs him and kisses him on the cheek. Max is caught a little offguard by this. There is lipstick on his cheek.\n<br/>\n<br/><b>MRS. GUGGENHEIM\n<br/></b>\n<br/>These are glorious. Let me put them in some water. Sit down.\n<br/>\n<br/>She takes the flowers and points to a chair beside the bed. Max sits down and stares at Dr. Guggenheim while Mrs. Guggenheim puts the violets in a vase.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Should I say hello to Dr. Guggenheim? Or can he not hear anything?\n<br/>\n<br/><b>MRS. GUGGENHEIM\n<br/></b>\n<br/>Oh, no. He can hear you.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/><b>OK.\n<br/></b>\n<br/>(sadly)\n<br/>\n<br/>Hello, old timer. It's Max Fischer. I was just thing about you the other day. And Rushmore. And I -\n<br/>\n<br/>Dr. Guggenheim's eyes suddenly open. Max is taken aback. Dr. Guggenheim looks at Max suspiciously and whispers:\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>What do you want?\n<br/>\n<br/>Mrs. Guggenheim looks up quickly. Max hesitates.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I just came to pay my respects.\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>(frowns)\n<br/>\n<br/>No, you didn't. You don't respect anybody.\n<br/>\n<br/>Dr. Guggenheim tries to spit at Max, but his mouth is too dry. Mrs. Guggenheim comes over to him.\n<br/>\n<br/><b>MRS. GUGGENHEIM\n<br/></b>\n<br/>Nelson?\n<br/>\n<br/>Dr. Guggenheim mutters deliriously.\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>Dammit. Goddammit.\n<br/>\n<br/>Mrs. Guggenheim takes Dr. Guggenheim's hand and holds it. He calms down. His eyes close and he relaxes. Silence.\n<br/>\n<br/>Mrs. Guggenheim looks to Max.\n<br/>\n<br/><b>MRS. GUGGENHEIM\n<br/></b>\n<br/>That's the first thing he's said in ten days.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You think he recognized me?\n<br/>\n<br/><b>MRS. GUGGENHEIM\n<br/></b>\n<br/>I'm not sure.\n<br/>\n<br/><b>CUT TO:\n<br/></b>\n<br/>Dirk hidden in the bushes across the street from the hospital. He checks his watch. He raises his binoculars to his eyes and looks on mysteriously as:\n<br/>\n<br/>Mr. Blume pulls into the parking lot in his Bentley.\n<br/>\n<br/><b>INSERT NOTEBOOK:\n<br/></b>\n<br/>5:25 Fischer arrives via old woman's bicycle.\n<br/>\n<br/>5:47 Blume arrives via black Bentley.\n<br/>\n<br/><b>INT. ELEVATOR. NIGHT\n<br/></b>\n<br/>Max rides down in the elevator with a NURSE and a wheezing OLD WOMAN in a wheelchair. The doors open in the lobby and Max waits while the nurse wheels out the old woman.\n<br/>\n<br/>Then he sees Mr. Blume in front of him, waiting for the elevator. He has a bouquet of carnations in one hand and a diet Coke in the other. He has a black eye under his sunglasses. He is very disheveled.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Hey, amigo.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You look horrible.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>You don't look too great yourself. Good to see you.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You here to see Guggenheim?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Yeah. Your partner told me he was under the weather.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(frowns)\n<br/>\n<br/>What partner?\n<br/>\n<br/>Silence. Mr. Blume shrugs.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>OK. If you want to play it that way. You getting off?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'll ride up with you.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(getting on)\n<br/>\n<br/>Suit yourself.\n<br/>\n<br/>Mr. Blume presses the button for the 14th floor. The doors close and they go up. Mr. Blume takes out the little airline bottle of vodka and pours some into his diet Coke. He swirls it around and drinks a sip.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Who gave you the shiner?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Honestly? I don't actually know. It was either Ronny or Donny. But I can't tell the difference anymore.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Well, he really clocked you.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Yeah? Well, kids don't like their parents to get divorced.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I don't blame them.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Me, either.\n<br/>\n<br/>Silence.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>How is she?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>I wouldn't know.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Why not?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Because I haven't seen her in six weeks.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(frowns)\n<br/>\n<br/>What happened?\n<br/>\n<br/>Mr. Blume shrugs.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>She left you?\n<br/>\n<br/>Mr. Blume nods.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>How come? I thought she loved you.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>So did I. I guess maybe I am too old for her after all.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(sadly)\n<br/>\n<br/>Maybe so. Maybe so.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>She's still in love with the dead guy, anyway.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You mean Edward Appleby.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Oh, yeah. She's fucked up.\n<br/>\n<br/>Mr. Blume lights a new cigarette. Max points to Mr. Blume's first cigarette, balanced on the handrail.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You've already got one going, Mr. Blume.\n<br/>\n<br/>Mr. Blume picks up his first cigarette and puts it in the opposite corner of his mouth from the second. He smiles at Max through the smoke. They get off to the 14th floor and the doors open.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Adios, amigo.\n<br/>\n<br/>Max waves good-bye. But Mr. Blume does not get off the elevator. He bends over and puts his hands on his knees and takes a series of deep breaths. The door starts to close. He reaches out and holds them open. Max looks concerned.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Are you OK?\n<br/>\n<br/>Mr. Blume looks up at Max. He laughs and shakes his head.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>I'm kind of lonely these days.\n<br/>\n<br/>Mr. Blume sighs. He gets off the elevator. The doors close behind him as Max watches him walk down the hall.\n<br/>\n<br/><b>CUT TO DIRK'S BINOCULARS:\n<br/></b>\n<br/>Max comes out of the hospital and stands quietly in the cold for a minute. He gets on his mother's old bicycle. He rides off down the street.\n<br/>\n<br/><b>EXT. THE FISCHERS' HOUSE. DAY\n<br/></b>\n<br/>Max opens the Fischer's garage door. His smashed-up ten-speed hangs from a peg on the wall. He takes is down and carries it out off the garage.\n<br/>\n<br/><b>INT. MISS CROSS' HOUSE. NIGHT\n<br/></b>\n<br/>Miss Cross is sitting up in her bed reading Treasure Island and listening to the radio. She is wearing pale blue pajamas. There is a knock on her windowpane. She looks up.\n<br/>\n<br/>She hears someone trying to open the window. She gets up and pulls open the blinds. Max is outside on the roof wearing his parka and ski cap in the falling snow. He waves.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Max!\n<br/>\n<br/>Miss Cross opens the window.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>What are you doing here?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(dazed)\n<br/>\n<br/>I don't know. Jesus. They came at me out of no where. It was -\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>What?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>So sudden. I just -\n<br/>\n<br/>(pause)\n<br/>\n<br/>I'm sorry. Can I use your phone? I just got hit by a car.\n<br/>\n<br/>Max points down at his destroyed ten-speed in the street under a street lamp. Parts are scattered all around it.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Oh, my God. Are you OK?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(disoriented)\n<br/>\n<br/>What?\n<br/>\n<br/>Miss Cross notices a little cut over Max's eye. She lifts up the front of Max's ski cap. There is blood all over his forehead. She looks shocked.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Come inside.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(climbing in)\n<br/>\n<br/>Thank you.\n<br/>\n<br/>Max goes to Miss Cross' bed. He lies down and stares at the ceiling.\n<br/>\n<br/>Miss Cross goes into the bathroom. She puts on a white bathrobe and gets some cotton balls and hydrogen peroxide out of the medicine cabinet.\n<br/>\n<br/>Max looks around the room.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>So this is where it all happens?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>(from the bathroom)\n<br/>\n<br/>All what happens?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I wouldn't know.\n<br/>\n<br/>Miss Cross comes back into the bedroom.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Why'd you dump Blume?\n<br/>\n<br/>Miss Cross stops. Pause.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>That's none of your business.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I know it's not. But I'm a little confused right now. I mean. I thought you dumped me for Blume. Then I hear -\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I never dumped you because we were never going out.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>But it doesn't make any sense. I -\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Well, I am confused, too. But why don't we just deal with getting you -\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Because it would help me if you would talk to me for a minute. And tell me what happened.\n<br/>\n<br/>Silence.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/><b>OK.\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>Well. A. He's a married man.\n<br/>\n<br/>And B. He hates himself.\n<br/>\n<br/>I mean. He smashed your bicycle, didn't he?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>My previous bicycle. Yes.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Well, what kind of person does something like that?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I don't know.\n<br/>\n<br/>(pause)\n<br/>\n<br/>War does funny things to men.\n<br/>\n<br/>Silence. Miss Cross sits down in a rocking chair beside the bed. She opens the bottle of hydrogen peroxide.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>He thinks you dumped him because of Edward Appleby.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>What does that mean?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I don't know. I mean. You live in this room.\n<br/>\n<br/>Max looks around the room. There are trophies and ribbons, a chemistry set, a poster from the Olympics, three large fish tanks, a picture of Jacques Cousteau, and some model planes in dogfights hanging from the ceiling.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>With all his stuff. It's kind of --\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I was married to him.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>I know you were.\n<br/>\n<br/>Silence.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Although I will say Edward has more spark and character and imagination in one fingernail than Herman Blume has in his entire body.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>One dead fingernail.\n<br/>\n<br/>Miss Cross fixes Max with a hard stare.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Right. One dead fingernail.\n<br/>\n<br/>Silence.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>How'd he die?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>He drowned.\n<br/>\n<br/>(pause)\n<br/>\n<br/>How'd your mother die?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>She got cancer.\n<br/>\n<br/>Miss Cross nods. She sighs.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Lie still for a minute, OK?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/><b>OK.\n<br/></b>\n<br/>Miss Cross pushes Max's hair back with her hand. She looks at him for a minute. She touches the blood on his forehead with a cotton ball. She stops.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Is this fake blood?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>Yes, it is.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>You know, you and Herman deserve each other. You're little children. Let me show you to the door.\n<br/>\n<br/>Max gets up and goes over to the window. He climbs out onto the roof. He looks back to Miss Cross.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>That wasn't a very satisfying conversation.\n<br/>\n<br/>Miss Cross shrugs. Silence.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>All right. Goodbye, Miss Cross.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Goodbye, Max.\n<br/>\n<br/>Max disappears into the darkness.\n<br/>\n<br/><b>EXT. FROZEN POND. DAY\n<br/></b>\n<br/>A few ICE SKATERS race around and do figure-8's on the little frozen pond at the edge of town. Dirk is sitting on his tackle box, fishing from a hole in the ice. He stomps his feet, and even with his mittens on he has to blow into his hands to keep warm.\n<br/>\n<br/>Max sits with his bare hands resting on the ice.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>People hate me.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>That's not true.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Guggenheim tried to spit on me.\n<br/>\n<br/>Poor old guy couldn't even spit.\n<br/>\n<br/>And Blume and Cross?\n<br/>\n<br/>(shakes his head)\n<br/>\n<br/>They can't stand me.\n<br/>\n<br/>I ruined their whole relationship.\n<br/>\n<br/>Dirk looks down at Max's red hands.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>You should put your mittens on.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(absently)\n<br/>\n<br/>Oh. They're already numb. I'm surprised you don't spit on me, Dirk.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>You're my friend, Max.\n<br/>\n<br/>Tear's starts streaming down Max's face. Dirk looks worried.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'm sorry about what I said about your mother giving me a hand job. I just --\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>I know, Max. Listen. I'm sorry I didn't take your hand when Buchan kicked your ass.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>I got a few licks in. At the very least, he'll think twice about spreading that kind of garbage.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>You should stand up.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'm awfully comfortable.\n<br/>\n<br/>Silence. One of the skaters begins to circle around Max and Dirk closer and closer. She suddenly scratches to a halt right in front of them.\n<br/>\n<br/>The skater is a girl in white skates and grey tights and a short camel's hair coat. She has a scarf over the lower half of her face. She says to Max:\n<br/>\n<br/><b>SKATER\n<br/></b>\n<br/>Is this your handwriting?\n<br/>\n<br/>She holds out a little piece of paper torn out from a spiral notebook. Max stands up and takes it. There is a note written on it in blue crayon.\n<br/>\n<br/><b>INSERT PIECE OF PAPER:\n<br/></b>\n<br/>Please come to the frozen pond at 3:30 PM this afternoon. Thank you very much.\n<br/>\n<br/>Max looks to Dirk. Dirk is putting a new worm on his hook.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>No. But it looks familiar.\n<br/>\n<br/>Max gives the piece of paper back to the girl. She lowers her scarf and we see she is Margaret Yang.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Do you know Dirk Calloway?\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>I don't think so.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Dirk, this is Margaret Yang.\n<br/>\n<br/>Dirk nods. Margaret waves to him. Silence.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I heard about your science fair project on Action 13 the other day. They said the Navy was going to buy it from you.\n<br/>\n<br/>Margaret is polite but cold.\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Not anymore.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Why not?\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Because it was fake.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>What do you mean?\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>(sighs)\n<br/>\n<br/>I faked all the results.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Why?\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Because it didn't work. I thought it would but it didn't.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(in disbelief)\n<br/>\n<br/>You mean it was all bullshit?\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Not all of it. Just the parts I didn't get right.\n<br/>\n<br/>Max stares at her. It is as if he is seeing her for the first time. He says quietly:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>That's exactly the way I would have handled that situation.\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Well. It's nothing to be proud of.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>But it's true.\n<br/>\n<br/>Max is completely hypnotized by her.\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>You were a real jerk to me.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>I know. I'm sorry, Margaret.\n<br/>\n<br/>Silence.\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Well. Anyway. Nice to see you.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Yeah. Nice to see you, too.\n<br/>\n<br/>Margaret starts skating slowly away backwards. Max waves to her. She spins and skates off full-speed. Max watches her go. Silence.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You set me up.\n<br/>\n<br/>Dirk nods. Max says wistfully:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Not bad, not bad. The child has become the father of the man.\n<br/>\n<br/>Max looks out across the frozen pond. He pulls off his ski cap and feels the cold air against his cheeks. Snowflakes catch in his eyelashes.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>We might have to get some hockey skates, Dirk.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>I already got you some.\n<br/>\n<br/>Dirk reaches into his backpack and takes out a pair of skates. He hands them to Max. Max looks at them for a minute. He nods slowly. Something begins to change in his face. He says with quiet intensity:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Do me a favor, will you?\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Sure. What?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>Pack up your goddamn tackle box.\n<br/>\n<br/>Dirk smiles. Max grabs Dirk's fig pole and starts walking. Dirk calls after him:\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>You sure you don't want to stay here and feel sorry for yourself?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'll take a rain check.\n<br/>\n<br/>Dirk grabs his tackle box and follows Max briskly off the ice.\n<br/>\n<br/><b>EXT. BARBERSHOP. DAY\n<br/></b>\n<br/>Mr. Blume stands on the sidewalk in front of the barbershop. He stares off into the distance. He has his hands in his pockets and his hair is blowing in the wind.\n<br/>\n<br/>Mr. Fischer is inside reading the sports page.\n<br/>\n<br/>A cab pulls up and splashes water on Mr. Blume, but he does not appear to notice. Max gets out of the cab. He is dressed in a beautiful green velvet suit and bow tie. He smiles.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Thanks for meeting me, Mr. Blume.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>What can I do for you?\n<br/>\n<br/>Max hands Mr. Blume a little white cardboard box. Mr. Blume frowns.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>What's this?\n<br/>\n<br/>Max shrugs. Mr. Blume starts to open the box. Max flinches away like the box is going to explode. Mr. Blume stops. Max smiles and motions for Mr. Blume to go ahead. Mr. Blume opens the box. There are two little pins inside.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>That's the Perfect Attendance awards and the Punctuality Award. I got those at Rushmore. I thought you could choose which one you like more, and you could wear that one and I could wear the other.\n<br/>\n<br/>Mr. Blume's face softens. He nods slowly. He studies the pins and says quietly:\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>I'll take punctuality.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/><b>OK.\n<br/></b>\n<br/>They put their pins in their lapels.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Thank you.\n<br/>\n<br/>Max nods. He smiles.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Come on. Let's go inside.\n<br/>\n<br/>Max motions to the barbershop. Mr. Blume looks confused.\n<br/>\n<br/><b>INT. BARBERSHOP. DAY\n<br/></b>\n<br/>Mr. Blume follows Max into the barbershop. Mr. Fischer looks up from his newspaper.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>Well, looks what the cat dragged in.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Sorry, I'm late. I want you to meet somebody.\n<br/>\n<br/>(looks to Mr. Blume)\n<br/>\n<br/>Mr. Blume, this is my father, Bert Fischer.\n<br/>\n<br/>Silence. Mr. Blume nods slowly.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Nice to meet you, Mr. Fischer.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>(smiles)\n<br/>\n<br/>Mr. Fischer's my father's name. Call me Bert.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>OK, Bert.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>Max tells me you could use a haircut.\n<br/>\n<br/>Mr. Blume hesitates.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>Let's have a look at you.\n<br/>\n<br/>Mr. Blume sits down in one of the barber's chairs and looks in the mirror. Max and Mr. Fischer stand on either side of him. Mr. Blume looks terrible. He sighs deeply.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>I don't know, Bert.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>Don't worry. We might have to throw in a shave, too. Max? Why don't you get Mr. Blume a cup of coffee?\n<br/>\n<br/><b>EXT. BARBERSHOP. DAY\n<br/></b>\n<br/>Max and Mr. Blume come out of the barbershop and walk quickly down the sidewalk. Mr. Blume's hair is crisply cut and neatly combed, but his clothes still look very disheveled.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>How much are you worth, by the way?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>I don't know.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Over ten million?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Yeah. I guess so.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Good, good.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Why?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Cause we're going to need all of it.\n<br/>\n<br/><b>DECEMBER MONTAGE:\n<br/></b>\n<br/>Christmas decorations are evident throughout the following scenes.\n<br/>\n<br/>Max and Mr. Blume watch a Jacques Cousteau film on 16mm in Mr. Blume's office. Ernie runs the projector.\n<br/>\n<br/>Max and Mr. Blume visit a marine research facility. Mr. Blume holds up a fish at the edge of a pool. A killer whale jumps out of the water and takes it in its teeth.\n<br/>\n<br/>Max and Mr. Blume sprint down the street and through the park in warm-up suits. They hurdle bushes and dodge traffic. They run into an empty football stadium and race up the bleachers.\n<br/>\n<br/>Max's young architect shows Max and Mr. Blume a miniature baseball diamond field. The architect slides over the diamond an inch and puts model of a building labeled The Cousteau-Blume Marine Observatory in its place.\n<br/>\n<br/>Max and Dirk skate around on the frozen pond during complicated tricks and jumps.\n<br/>\n<br/><b>EXT. VACANT LOT. DAY\n<br/></b>\n<br/>A large crowd of Rushmore student, parents and faculty has gathered around the vacant lot beside the baseball field. A huge banner says The Cousteau-Blume Marine Observatory. There is a huge bulldozer and a cement truck at the back of the lot.\n<br/>\n<br/>Max and Mr. Blume shake hands for the yearbook photographer. Mr. Blume is holding a gold shovel with a ribbon around it.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>She's not coming, is she?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(pause)\n<br/>\n<br/>It doesn't look good.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Ah, shit, man. What the hell am I doing here?\n<br/>\n<br/>Mr. Blume throws down his shovel and starts to walk off. Max yells at him:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Dammit, Blume! How the hell did you ever get so rich? You're a quitter!\n<br/>\n<br/>Mr. Blume looks at Max in shock.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>This cost me eight million dollars!\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(hesitates)\n<br/>\n<br/>And that's all you're prepared to spend?\n<br/>\n<br/>Silence.\n<br/>\n<br/><b>EXT. THE FISCHER'S HOUSE. DAY\n<br/></b>\n<br/>Max carries as old leather typewriter case in the backyard. He sets it down on a picnic table. The case has an inscription on it in gold letters.\n<br/>\n<br/><b>INSERT TYPEWRITER CASE:\n<br/></b>\n<br/>Bravo, Max! Love, Mom.\n<br/>\n<br/>Max unzips the case. There is an old portable manual typewriter inside. Max rolls a piece of paper into it and starts typing furiously. He pauses to drink a sip of hot chocolate. He starts typing again.\n<br/>\n<br/><b>TITLE:\n<br/></b>\n<br/>January.\n<br/>\n<br/><b>EXT. WEBSTER SMALLEY SCHOOL FOR GIRLS. DAY\n<br/></b>\n<br/>Webster Smalley is Rushmore's sister school. The doors to the lower school burst open and twenty-five first-grade girls in plaid jumpers run yelling onto the playground.\n<br/>\n<br/>Miss Cross comes out of the building after the girls. She sees Max coming down the hill in his green suit.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>I like your suit.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Thanks.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Is that velvet?\n<br/>\n<br/>Max nods. Miss Cross feels his lapel. It has a Perfect Attendance Award pin in it.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Sorry you couldn't make it to our little groundbreaking the other day. It's kind of a shame, since he's building it for you.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Well, you know, I never asked anybody to build me an aquarium. I'm not sure how that rumor got started.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Hm. Me, neither. You think Edward Appleby would've built you one?\n<br/>\n<br/>Miss Cross thinks for a minute. She sounds surprised at her on response.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Yeah. He probably would've. If he had the money.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(smiles)\n<br/>\n<br/>That's what I thought. Blume's got a little more spark and vitality than you expected, doesn't he?\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>But the aquarium was your idea.\n<br/>\n<br/>Max smiles and shrugs his shoulder.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Well, I gave it to my friend.\n<br/>\n<br/>Max turns and starts walking away. He looks back over his shoulder and says:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>By the way, I still haven't fucked anybody yet. But I guess that's just the way it goes.\n<br/>\n<br/>Miss Cross smiles sadly.\n<br/>\n<br/><b>INSERT TEACHER' MAILBOXES:\n<br/></b>\n<br/>A cabinet of little slots where teachers get their mail and memos. Someone puts a little envelope into the slot marked Rosemary Cross.\n<br/>\n<br/><b>INT. WAREHOUSE. DAY\n<br/></b>\n<br/>Max stands at the counter in a huge construction supply warehouse. A SALESMAN says:\n<br/>\n<br/><b>SALESMAN\n<br/></b>\n<br/>Fifteen sticks?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Yes, please. And make the order out to Ready Demolition, Tuscon.\n<br/>\n<br/>Max holds up a driver's license. The salesman looks at it and writes something on a clipboard. Max walks out of the warehouse with several large boxes over his shoulder. The boxes say DYNAMITE on them in large red letters.\n<br/>\n<br/><b>EXT. STREET. DAY\n<br/></b>\n<br/>Dirk comes out of a hiding place in the bushes as Max walks over with the dynamite. Dirk is holding a pellet gun.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Make sure these don't get wet.\n<br/>\n<br/>Max hands Dirk the boxes and takes the pellet gun.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'll see you at 3:15.\n<br/>\n<br/>Max starts walking away down the sidewalk.\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Where you going?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>9without stopping)\n<br/>\n<br/>Rushmore. I got one last piece of unfinished business I got to attend to.\n<br/>\n<br/><b>EXT. RUSHMORE. DAY\n<br/></b>\n<br/>Max pumps his pellet gun shot about twenty times. He raises the stock to his shoulder as Magnus Buchan walks onto the quadrangle. He draws a bead on him and follows him in his sight as he passes be. He fires.\n<br/>\n<br/>Magnus screams and grabs his only good ear. He spins around and sees Max cocking a pellet gun.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>Fischer! Ya fuck!\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Hello, Magnus. I'd have shot you in the other ear, but it got blown off a long time ago.\n<br/>\n<br/>Magnus starts to come at Max. Max points his weapon at him.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Not so fast.\n<br/>\n<br/>Magnus stops.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I owed you that one. Now we're even.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>(smiles crookedly)\n<br/>\n<br/>Not for long, kemosabe.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(shrugs)\n<br/>\n<br/>We'll see.\n<br/>\n<br/>Silence. Max holds Magnus at gunpoint.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I got a proposition for you.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>Shove it up your mother's arse, ya little prick.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I've got to hand it to you, Magnus. You've got a way with words. You want to be in a play?\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>(puzzled)\n<br/>\n<br/>Don't piss with me, Fischer.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'm not pissing with you.\n<br/>\n<br/>(reaching in his backpack)\n<br/>\n<br/>I brought you a script.\n<br/>\n<br/>Max hands Magnus a script with a red cover.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>What's all this shite?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Nothing. I just think you're right for the part.\n<br/>\n<br/>Magnus stares at Max. He says quietly:\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>I always wanted to be in one of those frickin' plays of yours.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I know you did, mate.\n<br/>\n<br/>Magnus looks at the script.\n<br/>\n<br/><b>INSERT COVER OF PLAY:\n<br/></b>\n<br/><b>HEAVEN AND HELL\n<br/></b>\n<br/>a new play by Max Fischer\n<br/>\n<br/>revised draft\n<br/>\n<br/>Dramatists Guild registered\n<br/>\n<br/><b>INT. GROVER CLEVELAND HIGH SCHOOL. NIGHT\n<br/></b>\n<br/>The school auditorium.\n<br/>\n<br/>We see many familiar faces in the audience: Mr. Fischer, Dr. Guggenheim in his wheelchair, Mrs. Guggenheim, Mrs. Calloway, Mrs. Whitney, the Indian groundskeeper, the yearbook photographer, Coach Beck, Ernie, Mr. Holstead, Mr. Adams, the police who arrested Max, some old men from the barbershop. They are all dressed nicely in evening clothes.\n<br/>\n<br/>Miss Cross' friend John, whom Max humiliated at dinner after the Serpico play, is seated in the third row. He is dressed in a coat and tie.\n<br/>\n<br/>An USHER directs Miss cross to her seat. She is surprised to see that it is right nest to Mr. Blume's. She reluctantly sits down beside him. Mr. Blume sees her.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Hi, Herman.\n<br/>\n<br/>Mr. Blume nods. He pulls his ticket out of his inside pocket and checks the seat number. He looks to Miss Cross. Miss Cross smiles.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Looks like Max pulled a fast one on us.\n<br/>\n<br/>Mr. Blume nods.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>How's your aquarium coming along?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Not too bad. It should be finished in October.\n<br/>\n<br/>Miss Cross nods.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>I just made a deal with a guy in Singapore for half a dozen electric eels.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>That sounds good.\n<br/>\n<br/>The lights go down. A spotlight appears and Max walks onstage in a tuxedo. He goes to a microphone in the middle of the stage.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I don't usually do this, but this play means a lot to me, and I wanted to make a dedication. So I'll just say that this play is dedicated to the memory of my mother, Eloise Fischer. And to Edward Appleby. A friend of a friend.\n<br/>\n<br/>Neither Mr. Fischer nor Miss Cross were expecting this announcement, and they are moved by it.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Also you'll find a pair of safety glasses and some earplugs underneath your seats. Please feel free to use them. Thank you very much.\n<br/>\n<br/>Max exits the stage and the audience applauds. There is a moment of rustling and whispering in the dark theater.\n<br/>\n<br/>The curtain opens on:\n<br/>\n<br/>Vietnam. Napalm smolders in the sky above the jungle.\n<br/>\n<br/>Dirk runs onstage dressed in a Green Beret uniform and sunglasses. He has an M-16. He yells to Max as Max shimmies down out of a palm tree:\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>Let's rock, Esposito!\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Lock and load, Surf Boy!\n<br/>\n<br/>There is an explosion and Max and Dirk run through the smoke. Suddenly the stage is swarmed by VC regulars. Everyone starts shooting at once.\n<br/>\n<br/>Bursts of gunfire light-up the audience's faces and smoke floats over their heads as we hear the sounds of jets flying over, bombs exploding, choppers taking off, and a SOLDIER'S voice screaming into his radio:\n<br/>\n<br/><b>SOLDIER\n<br/></b>\n<br/>Mayday! Mayday! Seven niner Almighty! Adjust your coordinates!\n<br/>\n<br/>Some members of the audience put on their safety glasses and earplugs. Woody stands nervously in the wings with a fire extinguisher.\n<br/>\n<br/>One of the extras accidentally clubs Max in the temple with the butt of his rifle. Max's eyes close. He crumples to the floor. The fighting stops. The audience begins to murmur.\n<br/>\n<br/>Max opens his eyes. He sees the frightened soldiers looking down at him.\n<br/>\n<br/>He grabs his M-16 and opens fire. The battle resumes.\n<br/>\n<br/><b>INSERT SIGN WRITTEN IN CALLIGRAPHY:\n<br/></b>\n<br/>Intermission.\n<br/>\n<br/>The sign is leaning on an easel in front of the curtain. Little roses and tulips are painted around its edges.\n<br/>\n<br/><b>INT. DRESSING ROOM. NIGHT\n<br/></b>\n<br/>Actors run around frantically backstage. Max has a band-aid on his forehead. He is touching-up a gory makeup effect over Dirk's eye. He turns to Woody.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>How much time we got, Wood?\n<br/>\n<br/><b>WODDY\n<br/></b>\n<br/>(checks his watch)\n<br/>\n<br/>Two minutes.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Bring me some more ketchup.\n<br/>\n<br/>(points to the band-aid on his head)\n<br/>\n<br/>And make this look real.\n<br/>\n<br/><b>EXT. AUDITORIUM. NIGHT\n<br/></b>\n<br/>The lobby of the auditorium is buzzing with people talking about the play and having drinks.\n<br/>\n<br/>Mr. Blume is standing alone outside, smoking a cigarette. It is snowing softly. Miss Cross comes out with a cup of coffee in each hand. Mr. Blume turns around and looks at her.\n<br/>\n<br/>She goes over to him and hands him one of the coffees.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(sadly)\n<br/>\n<br/>Thank you.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Hold this one, too, Herman.\n<br/>\n<br/>He holds both coffees while Miss Cross pours some little containers of cream into then and stirs them with a plastic straw. She takes back her cup of coffee.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>So what do you think of Max's latest opus?\n<br/>\n<br/>Mr. Blume gives a thumbs up and stares out into the snow.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Let's just hope it's got a happy ending.\n<br/>\n<br/>Miss Cross smiles. She smoothes her hand across Mr. Blume's hair. He looks into her eyes. She links arms wit him gently and they drink their coffees together.\n<br/>\n<br/><b>INT. AUDITORIUM. NIGHT\n<br/></b>\n<br/>Max and Magnus Buchan, with a three-day beard and a cigar, stand together among the fallen bodies and smoldering trees.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I want you to have something, Sarge.\n<br/>\n<br/>Max hands Magnus Mr. Blume's silver .45 automatic.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I won't be needing this anymore.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>Semper fi, Esposito. Semper fi.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Sic transit gloria, sir.\n<br/>\n<br/>Max looks out to Mr. Blume. Mr. Blume looks back at him.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Say a prayer for Surf Boy. Wherever he is.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>Good luck, soldier.\n<br/>\n<br/>Magnus salutes Max and walks off. We hear his voice as he goes into the wings:\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>Tag 'em and bag 'em, cherries! We're moving out! Let's DD!\n<br/>\n<br/>Max throws down his rifle into a foxhole and begins to cry quietly. Someone moves slowly toward him out of the settling smoke. Max wheels around and whips out his Swiss Army knife.\n<br/>\n<br/>But then he sees it is Margaret Yang as a Vietnamese villager. She has been through hell.\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Hello, Esposito.\n<br/>\n<br/>Max drops his knife and it stabs into the floor. He puts out his hand. Margaret takes it. He pulls her in and hugs her.\n<br/>\n<br/>Miss Cross smiles sadly.\n<br/>\n<br/>Max looks into Margaret Yang's eyes.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Will you marry me, Le-Chahn?\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>(instantly)\n<br/>\n<br/>You bet I will.\n<br/>\n<br/>Wagner's Flight of the Walkyries begins to play loudly from behind the stage as Max kisses Margaret and the curtain drops to wild applause.\n<br/>\n<br/>Mrs. Guggenheim looks on in amazement as Dr. Guggenheim stands up out of his wheelchair and leads the ovation. The rest of the audience quickly follows suit.\n<br/>\n<br/>The Indian groundskeeper is laughing hysterically.\n<br/>\n<br/><b>INT. GYMNASIUM. NIGHT\n<br/></b>\n<br/>The gymnasium has been filled with palm trees and decorated like an Army barracks. Flares burn in circles around the tables. A banner at the entrance says The Heaven and Hell Cotillion.\n<br/>\n<br/>Dirk and a couple of his CLASSMATES are looking at some vintage Playboy centerfolds taped-up on the wall as part of the Army barracks motif.\n<br/>\n<br/>Miss Cross and John are talking at the punchbowl.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Max sent you an invitation?\n<br/>\n<br/><b>JOHN\n<br/></b>\n<br/>Yeah. And he told me to wear a tie.\n<br/>\n<br/>Max and Margaret are drinking ginger ales and chatting with Mr. Fischer and MR. and MRS. YANG.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Thank you, Mrs. Yang. I actually wrote a different version of the play two years ago. But I couldn't get it done over at Rushmore.\n<br/>\n<br/><b>MRS. YANG\n<br/></b>\n<br/>Why? Too political?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>No. A kid got his finger blown off during rehearsals.\n<br/>\n<br/>Max sees Mr. Blume and Miss Cross approaching.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Miss Cross, this is my father Bert Fischer. He's a barber.\n<br/>\n<br/>(to Mr. Fischer)\n<br/>\n<br/>This is my friend Rosemary Cross.\n<br/>\n<br/>Mr. Fischer smiles as they shake hands.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>Hi, Rosemary.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Nice to finally meet you, Bert.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>And, of course, you know Mr. Blume. I also want everyone to meet Mr. and Mrs. Yang. And this is Margaret.\n<br/>\n<br/>Miss Cross and Margaret smile at each other.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Hello, Margaret.\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Hello, Miss Cross.\n<br/>\n<br/>The Indian groundskeeper is talking with Coach Beck and Mr. Blume's foreman, Ernie.\n<br/>\n<br/><b>COACH BECK\n<br/></b>\n<br/>I'm surprised they let him build a real campfire onstage. That's a safety hazard.\n<br/>\n<br/><b>ERNIE\n<br/></b>\n<br/>Well, last year he tried to raise piranhas.\n<br/>\n<br/><b>COACH BECK\n<br/></b>\n<br/>What'd you think of the play, Mr. Littlejeans?\n<br/>\n<br/><b>GROUNDSKEEPER\n<br/></b>\n<br/>Best play all year, man.\n<br/>\n<br/>Mr. Blume, Magnus Buchan, and the Rushmore yearbook photographer are having a conversation.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>Well, Fischer stepped on half of my bleedin' lines.\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Really? I didn't notice.\n<br/>\n<br/><b>PHOTOGRAPHER\n<br/></b>\n<br/>Are Ronny and Donny having a good time at military school?\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>(instantly)\n<br/>\n<br/>They love it.\n<br/>\n<br/><b>MAGNUS\n<br/></b>\n<br/>Lucky bastards.\n<br/>\n<br/>Mr. Fischer is talking with John.\n<br/>\n<br/><b>JOHN\n<br/></b>\n<br/>I understand you're a neurosurgeon.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>No. I'm a barber. But a lot of people make that mistake.\n<br/>\n<br/>Mr. Fischer laughs.\n<br/>\n<br/>Dirk and Dr. Guggenheim watch Max laughing and dancing with Margaret Yang. Max points to Dr. Guggenheim. Dr. Guggenheim smiles and points back to him. He says in a hoarse whisper:\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>Who's the Chinaman with Fisher?\n<br/>\n<br/><b>DIRK\n<br/></b>\n<br/>That's Margaret Yang. She's actually Korean.\n<br/>\n<br/><b>DR. GUGGENHEIM\n<br/></b>\n<br/>(pleasantly surprised)\n<br/>\n<br/>I know the Koreans. They're good people.\n<br/>\n<br/>Max and Margaret are talking as they dance:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>You were incredible tonight, Margaret. You were that poor girl.\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Thank you. I loved it when you grabbed onto the bottom of the chopper as it was taking off.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>That was totally improvised.\n<br/>\n<br/>Margaret nods. They look at each other smiling.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Can I ask you a question?\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Of course.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Can you do an Australian accent?\n<br/>\n<br/>Margaret looks puzzled. Max smiles.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>I'm working on something that's set in the outback.\n<br/>\n<br/>Mr. Fischer is sitting at a table having a glass of champagne with Max's math teacher, Mrs. Whitney. She has a slight English accent. Mr. Fischer wears a sky blue blazer.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>That's a beautiful dress, by the way.\n<br/>\n<br/><b>MRS. WHITNEY\n<br/></b>\n<br/>Why, thank you, Bert. That sportscoat is rather smashing in its own right.\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>I know it's a little loud. But I feel like celebrating.\n<br/>\n<br/><b>MRS. WHITNEY\n<br/></b>\n<br/>Would you care to dance?\n<br/>\n<br/><b>MR. FISCHER\n<br/></b>\n<br/>(surprised)\n<br/>\n<br/>I'd love to.\n<br/>\n<br/>Mr. Blume brings Miss Cross a glass of champagne as Max and Margaret dance by.\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Hello, Mr. Blume!\n<br/>\n<br/><b>MR. BLUME\n<br/></b>\n<br/>Hi, Margaret!\n<br/>\n<br/>(to Max)\n<br/>\n<br/>May I cut in? I haven't had a change to cut a rug with your new girlfriend yet.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(embarrassed)\n<br/>\n<br/>New girlfriend.\n<br/>\n<br/><b>MARGARET\n<br/></b>\n<br/>Yes, I am. And find your own partner, Mr. Blume. No offense, but I'm spoken for.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>No, it's OK. He's my friend.\n<br/>\n<br/>Margaret and Mr. Blume dance off together. Max and Miss Cross are left alone.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Well, you pulled it off.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(shrugs)\n<br/>\n<br/>It went OK. At least nobody got hurt.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>Except for you.\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>(smiles sadly)\n<br/>\n<br/>Nah. I didn't get hurt that bad.\n<br/>\n<br/>Max looks to Miss Cross. Miss Cross sips her champagne. She looks back at Max for a minute. She smiles. Mr. Fischer calls out to them as he dances by with Mrs. Whitney:\n<br/>\n<br/><b>MR. FISHCER\n<br/></b>\n<br/>Come on, you two! Shake a leg!\n<br/>\n<br/>They wave to Mr. Fischer. Miss Cross looks to Max.\n<br/>\n<br/><b>MISS CROSS\n<br/></b>\n<br/>You want to dance?\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Certainly. But let's see if we can get the DJ to play something with a lithe ---\n<br/>\n<br/>Max snaps his fingers. He turns to the DJ and yells:\n<br/>\n<br/><b>MAX\n<br/></b>\n<br/>Rueben!\n<br/>\n<br/>The DJ looks to Max. Max makes a little gesture that seems to say, This is the one. The DJ nods.\n<br/>\n<br/>The music cuts off in the middle of the song. Everyone stops dancing. They look around wondering what's going on.\n<br/>\n<br/>A new song starts up. It is the saddest song of the night.\n<br/>\n<br/>Max looks to Miss Cross. Miss Cross puts out her hand. Max takes it and walks with her onto the dance floor, into the crowd, as everyone slowly begins to dance. <br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Rushmore</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Wes Anderson\" title=\"Scripts by Wes Anderson\">Wes Anderson</a>  <a href=\"/writer.php?w=Owen Wilson\" title=\"Scripts by Owen Wilson\">Owen Wilson</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a>  <a href=\"/genre/Romance\" title=\"Romance Scripts\">Romance</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Rushmore Script.html#comments\" title=\"Rushmore comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:15:11.138563"}