{"title": "Saw", "film_link": "/Movie Scripts/Saw Script.html", "script_link": "/scripts/Saw.html", "info_raw": "\n\nSaw Script\n\n\n\n\nIMSDb opinion  Pretty intense, I liked it.\nIMSDb rating   (8 out of 10)\nAverage user rating   (9.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  James Wan  Leigh Whannell\nGenres  Crime  Horror  Mystery  Thriller\nMovie Release Date : October 2004\n\nRead \"Saw\" Script\n\n\n", "script": "\n\n\n                                             SAW\n\n                                          Written by\n\n                                  James Wan & Leigh Whannell\n\n\n \n               Darkness.\n\n               The soft sound of moving water can be heard in the background. \n               From the top of the screen a tiny, floating light moves its way \n               downwards across the screen. As it passes, we see just under \n               the water part of a young man\u0092s face. His eyes are closed. The \n               light disappears, and across the darkness appears the title S \n               A W. The title fades away.\n \n               The tiny light appears again, this time floating down at the \n               end of a tub of water, just near someone\u0092s bare foot. The camera \n               cuts again to the face of the young man underwater. This is ADAM. \n               Suddenly, his eyes fly open and he comes to life, opening his \n               mouth and gasping for air. As he wakes up and struggles within \n               the bathtub, we see his foot catch on a drain plug, unplugging \n               it. The water starts to drain, and we see go with the water the \n               tiny light, which we can also see has some kind of key attached \n               to it. The room itself is pitch black, but we can still just \n               barely make him out in the dark. Adam lifts himself out of the \n               tub and falls onto the floor, coughing and gasping from the shock. \n               He manages to get to his feet, but as he moves forward he realizes \n               that his ankle is chained to something. He feels his way over \n               to a pipe in the corner, reaching down and pulling at his chain \n               that is attached to it. He cries out, his voice frantic, frightened, \n               and a bit hysterical.\n \n                                     ADAM\n                         Help! Someone help me! (He stops when \n                         he hears a loud dragging sound somewhere \n                         in the room. He looks out into the darkness \n                         and calls out.) Is someone there? Hey! \n                         (He turns back to the corner to which \n                         he is chained, says in a slightly softer \n                         but still panicked voice) Shit, I\u0092m \n                         probably dead.\n \n               Suddenly, from out within the darkness comes a man\u0092s low, raspy \n               voice. It startles Adam. The voice, we will soon learn, belongs \n               to LAWRENCE.\n \n                                     LAWRENCE\n                         You\u0092re not dead.\n\n               Adam quickly turns in the direction of the voice. Holding his \n               arms out for balance, he tries to look across the room to whoever \n               is speaking, but still cannot see a thing.\n \n                                     ADAM\n                         Who\u0092s that? Who\u0092s that?!\n\n                                     LAWRENCE\n                         (his voice strangely a bit on the calm \n                         side, and almost irritated with Adam\u0092s \n                         reaction to the situation. This shall \n                         be his tone for many scenes to come.) \n                         There\u0092s no point in yelling, I already \n                         tried it.\n \n                                     ADAM\n                         Turn on the lights!\n\n                                     LAWRENCE\n                         Would if I could.\n\n                                     ADAM\n                         What the fuck is going on? Where am \n                         I? (He turns into his corner, touching \n                         the wall.)\n \n                                     LAWRENCE\n                         I don\u0092t know yet.\n\n                                     ADAM\n                         (smelling something; in disgust) What \n                         is that smell?\n \n                                     LAWRENCE\n                         Shh! Hang on a second, I think I found \n                         something.\n \n               With a loud click and an even louder buzzing sound, the very \n               bright fluorescent lights come to life, lighting up in rows, \n               starting from Lawrence\u0092s end and moving towards Adam. As they \n               come on, Adam is nearly blinded by the sudden change from pitch \n               black to bright white and squints in pain, holding up his arms \n               to cover his face. In the light we now see that he is in his \n               mid-twenties, with short brown hair, wearing a dark blue striped \n               shirt over a white tee shirt and jeans, looking like a drowned \n               rat from the tub. It takes him a moment but his eyes finally \n               start to adjust, and he looks around the room. He and we see \n               Lawrence, who also winces from the glare of the lights, standing \n               by the light switch and the door. He is on the opposite end of \n               the room, also chained to a pipe in the corner by his foot. He \n               wears a blue button-down dress shirt, now soaked with sweat stains. \n               He is middle aged, mid to late forties, with pale blonde hair \n               and even paler skin. Dark circles are under his eyes. Both men \n               are barefoot.\n \n               Lawrence\u0092s eyes adjust to the light and he sees across the room. \n               Then, his gaze starts towards the center of the room, as does \n               Adam\u0092s, who steps forward as much as he can, a look of horror \n               on his face. We see lying face down the body of a man who has \n               blown his brains out, lying in a pool of blood, clad in only \n               boxer shorts and a tee shirt. In his left hand is a gun, in his \n               right hand is a micro cassette recorder. A gunshot and a scream \n               are heard as the camera moves up and in a fast 360° angle above \n               and circling the man, ending in a full overhead view of him.\n \n               \n               The shot cuts to Adam, who reels in shock and disgust.\n\n                                     ADAM\n                         Holy shit!\n\n               He turns towards the tub and leans over, gagging and coughing. \n               Lawrence in the meantime hops forward the best he can, studying \n               the body with a look of fear and concern. Adam stops coughing \n               and turns back around, takes another look at the body and around \n               the room. He looks down at his chain then starts to completely \n               freak out, grabbing and pulling at his chain.\n \n                                     ADAM\n                         (screaming) HELP!!! (He falls back onto \n                         his bottom on the floor as he yanks \n                         at the chain as hard as he can.) HELP!!! \n                         Help!\n \n               Lawrence just stands and watches him with an almost embarrassed, \n               appalled look at his behaviour. It seems that Lawrence, despite \n               being in the situation he\u0092s in, is above that kind of uncontrolled \n               reaction. He speaks a bit coldly.\n \n                                     LAWRENCE\n                         No one can hear you.\n\n               Adam stops pulling at the chain, stands up and looks to Lawrence, \n               his breathing fast and heavy. His voice is not yelling anymore \n               but still just as hysterical.\n \n                                     ADAM\n                         What the fuck is this?\n\n                                     LAWRENCE\n                         Calm down, just calm down. (He knows \n                         that to remain calm is to remain in \n                         control, something he must be no matter \n                         what the situation.) Are you hurt?\n \n                         \n               Adam looks down at himself, shrugging slightly.\n\n                                     ADAM\n                         I don\u0092t know...yeah!\n\n               Lawrence moves over to the pipe in the corner, leaning against \n               it for support.\n \n                                     LAWRENCE\n                         (calmly) What\u0092s your name?\n\n                                     ADAM\n                         (sarcastic) My name is Very Fucking \n                         Confused! (demanding) What\u0092s your name? \n                         What\u0092s going on here?\n \n                                     LAWRENCE\n                         (internal eye roll; he\u0092s getting more \n                         and more aggravated with Adam\u0092s behaviour) \n                         My name is Lawrence Gordon, I\u0092m a doctor. \n                         I just woke up here, just like you. \n                         (He reaches up, wipes his face with \n                         his sleeve)\n \n               Adam kneels back down facing the pipe, pulling at his chains \n               once more, but not with his prior panic. He winces at the metal \n               biting into his skin.\n \n                                     ADAM\n                         (in pain) Ah!\n\n               Lawrence looks at Adam with a look that seems to say I\u0092m stuck \n               in here with THIS guy? He then glances down at the body.\n \n                                     LAWRENCE\n                         Recognize him?\n\n               Adam continues to pull at his chains, does not and will not look \n               at the body, just shakes his head.\n \n                                     ADAM\n                         (sharply) No.\n\n                                     LAWRENCE\n                         (trying to get SOMETHING out of this \n                         kid) Well, do you have any idea how \n                         you got here?\n \n                                     ADAM\n                         No.\n\n                                     LAWRENCE\n                         What\u0092s the last thing you remember?\n \n                         \n                                     ADAM\n                         Nothing. (he sits back onto the floor, \n                         stops pulling at his chains for a moment.) \n                         I went to bed in my shithole apartment, \n                         and woke up in an actual shithole. (He \n                         raises his left leg slightly, starts \n                         trying to pull his foot out of the iron \n                         cuff. He glances to Lawrence, who has \n                         moved over to the wall to his left, \n                         bent over slightly and resting a hand \n                         against a pipe.) So what about you, \n                         huh?\n \n                                     LAWRENCE\n                         (He shrugs slightly, shaking his head.) \n                         Well there\u0092s...there\u0092s not much to tell, \n                         really. (Across the room, Adam gives \n                         up with the chain for the time being \n                         but remains sitting on the floor.) I \n                         was on my way home from work and uh, \n                         I don\u0092t remember anything else.\n \n               Adam just sits there, glancing over to the body and then focusing \n               on it much more. The initial panic has worn off for now, replaced \n               simply with fear and shock. His voice is a bit softer.\n \n                                     ADAM\n                         First dead body I\u0092ve ever seen. Look \n                         different in real life. They don\u0092t move.\n \n                         \n               Lawrence slowly lowers himself into a sitting position against \n               the wall. He pokes slightly at the iron cuff around his foot.\n \n               \n                                     LAWRENCE\n                         From the looks of these chains, someone \n                         didn\u0092t want us to go very far either.\n \n                         \n               Suddenly, Adam leaps up, lifting up his shirt and exposing his \n               abdomen. His panic is back, but not at full force like before. \n               He studies himself then glances to Lawrence.\n \n                                     ADAM\n                         Can you see any scars?\n\n                                     LAWRENCE\n                         (looking at him strangely) What?\n\n                                     ADAM\n                         Huh? This is what they do man, (he gestures \n                         to his stomach, where there are in fact \n                         no scars.) They kidnap you and drug \n                         you and before you know it, you\u0092re in \n                         a bathtub and your kidneys are on eBay. \n                         (A ridiculous theory to us and to Lawrence, \n                         but Adam states it with conviction.)\n \n                         \n                                     LAWRENCE\n                         (a scoffing tone in his voice) No one \n                         has taken your kidneys.\n \n                                     ADAM\n                         (disbelief) How can you tell from way \n                         over there?\n \n                                     LAWRENCE\n                         (matter of fact) Because you\u0092d either \n                         be in terrible agony, or you\u0092d be dead \n                         by now. Trust me.\n \n                                     ADAM\n                         What are you, a surgeon? (He lowers \n                         his shirt and turns and bends down to \n                         prod at the chain around the pipe again.)\n \n                         \n                                     LAWRENCE\n                         Yeah. (He sighs. He\u0092s getting tired \n                         of Adam already. He speaks sharply.) \n                         So, you gonna tell me your name, or \n                         what?\n \n               Adam stands back up, turns to Lawrence, his voice once again \n               calm.\n \n                                     ADAM\n                         Adam.\n\n                                     LAWRENCE\n                         (getting to his feet, his voice a bit \n                         calmer) Well Adam, what we need to do \n                         (he leans with one hand outstretched \n                         against the pipe to his right. Adam \n                         watches him, scared but calm) is start \n                         thinking about why we\u0092re here. Whoever \n                         brought us there could\u0092ve killed us \n                         by now. But they didn\u0092t. They must want \n                         something from us. (He looks up and \n                         around the room) Question is what. (He \n                         sees something up on the wall, moves \n                         forwards a bit towards it. We see that \n                         it is a brand new clock on the wall, \n                         ticking away. It reads currently at \n                         10:22.) That clock.\n \n                                     ADAM\n                         What about it?\n\n                                     LAWRENCE\n                         It\u0092s brand new. (squints, studying it)\n \n                         \n                                     ADAM\n                         (not getting what he\u0092s implying) So?\n \n                         \n                                     LAWRENCE\n                         (sighs; it\u0092s quite simple, why can\u0092t \n                         Adam see it?) So, someone obviously \n                         wanted us to know the time. (Adam looks \n                         a bit confused still, mulls over that \n                         information. Lawrence thinks for a moment.) \n                         Wait, I think I may be able to reach \n                         that door.\n \n               Lawrence moves over as far as the chain will allow him to the \n               giant, wooden sliding door, pushing against it as hard as he \n               can. In the meantime, we see Adam thinking. He pauses, then reaches \n               down and starts going through his pockets. There is nothing in \n               the front two, but in his back left pocket he pulls out a plastic \n               baggie with a white envelope in it. He unfolds the baggie; the \n               envelope says ADAM. He stares at it in his hands, wondering what \n               it is.\n \n               Lawrence continues struggling with the door, quickly glances \n               over his shoulder to see what Adam is doing. He sees Adam holding \n               the baggie. Adam reaches into the envelope, pulls out a micro \n               cassette tape. A close up shows the words Play Me written on \n               the tape label. Adam holds it in his hand, studying it. Lawrence \n               turns away from the door, looking over and trying to see what \n               Adam has in his hand.\n \n                                     LAWRENCE\n                         What is that? (Adam doesn\u0092t answer, \n                         continues looking at the tape. Lawrence\u0092s \n                         voice grows impatient.) Excuse me.\n \n                         \n                                     ADAM\n                         (glances up briefly at Lawrence, then \n                         back down at the tape. His voice sounds \n                         slightly surprised.) It\u0092s a tape.\n \n                         \n                                     LAWRENCE\n                         Where did you find it?\n\n                                     ADAM\n                         It was in my pocket.\n\n               Lawrence thinks about that briefly then starts digging through \n               his own pockets, finds within them a white envelope with LAWRENCE \n               written across it in the same black lettering as Adam\u0092s.\n \n                                     ADAM\n                         (regarding his tape) It says Play me.\n \n                         \n               Lawrence tears into his envelope, empties the contents into the \n               palm of his hand. First, he holds up a similar tape to Adam\u0092s. \n               It also says Play Me. Then he holds up a single bullet, studying \n               it, not sure what it\u0092s there for yet. Then, he holds up a tiny \n               key. He bends over, gets down on the floor and starts to try \n               to unlock his chains with the key. It doesn\u0092t seem to be working.\n \n               \n                                     LAWRENCE\n                         (frustrated, mumbling to himself and \n                         to the key) Come on, come on, come on....\n \n                         \n                                     ADAM\n                         (seeing that it doesn\u0092t seem to be working \n                         on Lawrence\u0092s lock) Throw it over here.\n \n                         \n               Lawrence gives him a slightly mistrustful look, but then holds \n               up the key and throws it. Adam misses the key at first as it \n               hit\u0092s the floor in front of the dirty toilet near his corner.\n \n               \n                                     ADAM\n                         Fuck. (He leans over and picks up the \n                         key, then bends down and tries the key \n                         on the lock on his ankle, which doesn\u0092t \n                         work. He tries the lock on the chains \n                         around the pipe. It isn\u0092t working there \n                         either.)\n \n                                     LAWRENCE\n                         (watching him) No?\n\n               Adam gives up, drops the key onto the floor frustratedly, shaking \n               his head. That\u0092s when he looks over to the body again, and the \n               shot closes up on the hand holding the tape recorder. A small \n               loop handle juts out of the hand\u0092s grip. Adam stands up, then \n               bends down and picks up the tape on the floor, looking at it. \n               He puts it back down then stretches himself flat out on the floor, \n               trying to reach. Unfortunately, there is still a good three to \n               four feet between him and the body.\n \n                                     LAWRENCE\n                         Use your shirt.\n\n                                     ADAM\n                         (gets back up to his knees) What?\n\n                                     LAWRENCE\n                         Your shirt.\n\n               Adam looks down at himself, then takes off the long sleeved blue \n               shirt. He lays back down, holding the shirt by the ends of each \n               sleeve, and throws it, trying to catch it on the tape recorder. \n               It misses. He tries a second time; same result.\n \n                                     LAWRENCE\n                         Come on...\n\n               Adam tries again; it misses. It is just barely reaching. He pulls \n               the shirt back, gets back up on his knees, aggravated.\n \n                                     ADAM\n                         It won\u0092t work.\n\n                                     LAWRENCE\n                         (trying to get him to not give up yet) \n                         Well, look around, there must be something \n                         else you can use.\n \n                                     ADAM\n                         (stands, ready to give up, skeptical) \n                         There\u0092s nothing.\n \n                                     LAWRENCE\n                         (insistent) Well there must be something!\n \n                         \n               Adam looks around his area, then into the bathtub. He sees something, \n               bends over, takes out the tub plug, which is attached to a long \n               cord. He ties the cord around the sleeve of his shirt. He kneels \n               down, holding out the shirt, aiming.\n \n                                     LAWRENCE\n                         Come on, you can do it.\n\n               Adam throws it, attempting to get the plug through the loop at \n               the end of the tape recorder. He misses.\n \n                                     LAWRENCE\n                         Come on, come on, again.\n\n               He tries again and misses. On the third try, however, he gets \n               the plug right through the loop. Lawrence smiles in relief. Adam \n               very slowly pulls it back, dragging the tape recorder along the \n               floor towards him. He picks it up, getting rid of the plug and \n               dropping it and the shirt on the floor. He picks up the tape, \n               pops it in and presses play, holding the tape recorder out a \n               bit so that they can both hear, but keeping his head tilted so \n               he can hear better. A chilling deep, raspy, sinister male voice \n               The Jigsaw Killer comes from the tape. As it speaks, Adam\u0092s expression \n               is fearful, but the thought How does he know? can be detected.\n \n               \n                                     JIGSAW\n                         (on tape) Rise and shine, Adam. You\u0092re \n                         probably wondering where you are. I\u0092ll \n                         tell you where you might be. You might \n                         be in the room that you die in. Up until \n                         now, you simply sat in the shadows, \n                         watching others live out their lives. \n                         But what do voyeurs see when they look \n                         into the mirror? Now, I see you as a \n                         strange mix of someone angry and yet \n                         apathetic. But mostly just pathetic. \n                         So are you going to watch yourself die \n                         today, Adam? Or do something about it? \n                         (end)\n \n               Adam looks frightened but not sure of the entire meaning of the \n               message.\n \n                                     ADAM\n                         I don\u0092t get it. (He presses the stop \n                         button on the tape.)\n \n                                     LAWRENCE\n                         (eagerly, gestures.) Throw me the player.\n \n                         \n                                     ADAM\n                         (pauses, thinks) No, you throw me your \n                         tape.\n \n                                     LAWRENCE\n                         (a heavy sigh. He looks at Adam as a \n                         slow-minded fool who simply doesn\u0092t \n                         understand the full capacity of the \n                         situation that they\u0092re in, and speaks \n                         to him as such.) Look, we\u0092re going to \n                         have to work together if we want to \n                         get out of here. Now just throw it to \n                         me.\n \n                                     ADAM\n                         (picks up on the tone, speaks defensively) \n                         I\u0092m not going to risk breaking it! You \n                         throw me your tape!\n \n               Lawrence pauses, looking at Adam as though he\u0092d like to smack \n               him, then holds up and tosses the tape. It hits the floor behind \n               Adam, who kneels down and picks it up, pops it in, presses play. \n               It\u0092s the same chilling voice as on Adam\u0092s tape. As the tape plays, \n               Adam stares at Lawrence, and Lawrence at the tape recorder.\n \n               \n                                     JIGSAW\n                         (on tape) Dr. Gordon, this is your wake \n                         up call. Every day of your working life, \n                         you have given people the news that \n                         they are going to die soon. Now you \n                         will be the cause of death. Your aim \n                         in this game is to kill Adam. (Adam \n                         glances down at the tape recorder wide-eyed, \n                         then back up at Lawrence) You have until \n                         six on the clock to do it. There\u0092 sa \n                         man in the room with you. When there\u0092s \n                         that much poison in your blood (another \n                         view of the body from Lawrence\u0092s POV), \n                         the only thing left to do is shoot yourself. \n                         (Jigsaw coughs) There are ways to win \n                         this hidden all around you. Just remember: \n                         X marks the spot for the treasure. If \n                         you do not kill Adam by 6:00, then Alison \n                         and Diana will die, Dr. Gordon. And \n                         I\u0092ll leave you in this room to rot. \n                         Let the game begin. (end)\n \n               The looks on each man\u0092s face clearly say Oh Shit. The tape ends. \n               Lawrence stands up.\n \n                                     LAWRENCE\n                         (firmly) Give me that. Now. (Adam tosses \n                         him the tape. He catches it, rewinds, \n                         plays back. Adam stands up from his \n                         spot on the floor.)\n \n                                     JIGSAW\n                         (on tape)...then Alison and Diana will \n                         die, Dr. Gordon. And I\u0092ll leave you \n                         in this room to rot.\n \n                                     ADAM\n                         (thinking, trying to figure this out) \n                         Any idea who that is?\n \n                                     JIGSAW\n                         (on tape) Let the game begin.\n\n                                     ADAM\n                         He knows us.\n\n                                     LAWRENCE\n                         Wait a minute. (rewinds more)\n\n                                     ADAM\n                         (false hope) What do you think? Probably \n                         a joke, right?\n \n                                     LAWRENCE\n                         Shh, shh! (presses play)\n\n                                     JIGSAW\n                         (on tape) Let the game begin.\n\n                                     LAWRENCE\n                         (softly) Listen...\n\n                                     JIGSAW\n                         (on tape, in a VERY hushed tone after \n                         a brief silence)...Follow your heart.\n \n                         \n               Lawrence stops the tape.\n\n                                     ADAM\n                         What the hell does Follow your heart \n                         mean?\n \n               Lawrence is looking around, on the walls and everywhere else \n               in the bathroom for a heart. He spots a small one drawn in brown \n               on the toilet next to Adam and points.\n \n                                     LAWRENCE\n                         There! Right next to you, on the toilet.\n \n                         \n               Adam looks, sees the toilet. Slowly, he bends down, resting his \n               hands on the seat, looking down into the bowl of liquid shit, \n               not really sure what he\u0092s looking for.\n \n                                     LAWRENCE\n                         (impatient, gesturing) Come on, come \n                         on.\n \n               Adam glances up at Lawrence with a look of You\u0092ve got to be kidding \n               me, but Lawrence watches him expectantly. Adam sighs, then reaches \n               in with his right hand, fishing around in the mess.\n \n                                     ADAM\n                         Oh man...(he gasps, making gagging sounds, \n                         his face turned away from the bowl. \n                         He coughs, fishes around for another \n                         brief moment, then quickly pulls back, \n                         trying to shake some of the shit off \n                         of his hand, spitting.\n \n                                     LAWRENCE\n                         (expectantly) Anything?\n\n                                     ADAM\n                         (disgusted) No solids.\n\n                                     LAWRENCE\n                         Take off the lid. (He points to the \n                         lid. Adam looks to it, slowly stands \n                         up, reaches for it. Lawrence has no \n                         patience.) Come on!\n \n               Adam takes off the lid, places it down on the toilet seat. The \n               water is clearer inside, and he reaches in and pulls out something \n               wrapped up in a black garbage bag. He holds it up for Lawrence \n               to see, turns to him.\n \n                                     ADAM\n                         I really wish I had checked in there \n                         first.\n \n                                     LAWRENCE\n                         Huh. (he smiles slightly) What is it?\n \n                         \n               Adam tears into the bag, reaches in and pulls out two hacksaws. \n               He drops the bag on the floor, bends down and takes up his chain, \n               holding one of the hacksaws and beginning to saw at the chain \n               with it. Lawrence watches him for a moment.\n \n                                     LAWRENCE\n                         Hey! (Adam turns and looks. Lawrence \n                         speaks in an irritated voice) Mind passing \n                         me the other one?\n \n               Adam reaches over and picks up the other hacksaw, then carefully \n               throws it across the room. It hits the pipe to Lawrence\u0092s left. \n               Lawrence reaches down and picks it up, then sits down on the \n               floor. Quick shot back to Adam, who, while Lawrence is preoccupied \n               with picking up the hacksaw, quickly picks up the garbage bag \n               and tosses it into the bathtub. Both men start to saw away at \n               their chains furiously, but neither are making any progress. \n               Suddenly, Adam\u0092s saw snaps in the middle, and his temper flares.\n \n               \n                                     ADAM\n                         (enraged) Fuck! Fuck! (He reacts violently, \n                         hitting the broken saw twice against \n                         the iron pipe then turns and hums it \n                         across the room, right into a mirror. \n                         A small piece of the mirror breaks off \n                         and flies to the floor.)\n \n               Lawrence glances over at what Adam has done, then goes back to \n               sawing for another moment. Adam sits back down, breathing heavily, \n               leaning against the pipe in his corner. Finally, Lawrence gives \n               up, turning and sitting with his back against the pipe, also \n               breathing heavily for a moment. He sits there, when a look of \n               realization comes across his face. He holds up the saw, looking \n               at it, understanding. He lowers it to the floor, shaking his \n               head slightly.\n \n                                     LAWRENCE\n                         (everything is becoming more clear now) \n                         He doesn\u0092t want us to cut through our \n                         chains. He wants us to cut through our \n                         feet. (Adam looks up at him, eyebrows \n                         raised.) I think I may know who\u0092s done \n                         this to us.\n \n                                     ADAM\n                         What did you say? (he stands up; is \n                         Lawrence hiding something from him?)\n \n                         \n                                     LAWRENCE\n                         It\u0092s not someone I know personally. \n                         It\u0092s...just someone I know of.\n \n                                     ADAM\n                         (getting slightly frantic again) Jesus \n                         Christ! Tell me, who is it?!\n \n               The camera closes up on Lawrence\u0092s face. To the right of it, \n               the screen is fading into a flashback of a crime scene. As Lawrence \n               speaks, his face fades and the flashback scene grows clearer, \n               until it is only the crime scene, with three detectives walking \n               down a flight of stairs.\n \n                                     LAWRENCE\n                         The last I heard...the police still \n                         hadn\u0092t caught him.\n \n               \n               We now see the three figures descending through a trap door down \n               a flight of stairs. The lighting is a bright lime green that \n               is strangely dark at the same time. The trio enters a small, \n               cell like room with a low ceiling. They are TAPP, SING, and KERRY. \n               Tapp is a tall black man in his late forties-early fifties. Sing \n               is an Asian man in his mid to late thirties, and Kerry is a Caucasian \n               woman in her mid to late thirties with long, curly brown hair \n               that is tied back in a ponytail. All are well dressed, Sing and \n               Tapp in suits, the woman in a jacket and dress slacks. They are \n               the detectives working on this case.\n \n               As they move into the room, Sing sees something that brings a \n               look of shock to his face, shining a flashlight on it. We cannot \n               see it yet.\n \n                                     LAWRENCE\n                         (VO) And the only reason I know that \n                         is because I was a suspect.\n \n               Tapp comes into the room last, ducking slightly from his height, \n               and comes up alongside Sing, looking at the same thing.\n \n                                     LAWRENCE\n                         (VO) I\u0092ll start from the beginning.\n \n                         \n                                     KERRY\n                         This one\u0092s not fresh anymore. At least \n                         three weeks out. (Detective Tapp squints \n                         as he peers in and studies the body) \n                         Victim\u0092s a 46-year old male. (Quick \n                         flash of a crime scene photo, a closeup \n                         of behind the man\u0092s head and upper back. \n                         There are deep cuts all over. The camera \n                         cuts upwards to the detectives.) Died \n                         of massive blood loss. Mostly through \n                         the femoral artery. (The camera pans \n                         around to Detective Tapp, who moves \n                         around the side fo the cage to get a \n                         better look inside, shining his flashlight \n                         in.) He started at the back of the cage \n                         and tunneled his way through the razor \n                         wire so fast it\u0092s amazing he got as \n                         far as he did. Cut himself so deep, \n                         we found traces of stomach acid on the \n                         floor. (Another more gruesome crime \n                         scene photo shot of the body from the \n                         side; we can see the razor wire digging \n                         in under his arm. Also, a close-up shot \n                         of some of his wounds; long, deep cuts.) \n                         We also found this. (She holds up an \n                         evidence baggie with a micro cassette \n                         tape recorder, just like the one Adam \n                         and Lawrence found in their cell. She \n                         presses the play button, and Tapp and \n                         Sing listen. It\u0092s the same chilling \n                         voice from Adam and Lawrence\u0092s tapes.)\n \n                         \n                                     JIGSAW\n                         (on tape) Hello Paul. You are a perfectly \n                         healthy, sane, middle-class male. Yet \n                         last month, you ran a straight razor \n                         across your wrists. Did you cut yourself \n                         because you truly wanted to die, or \n                         did you just want some attention? Tonight, \n                         you\u0092ll show me. The irony is that if \n                         you want to die, you just have to stay \n                         where you are. But if you want to live, \n                         you\u0092ll have to cut yourself again. (Flashback \n                         shot of Paul waking up in the cage, \n                         looking around, scared and confused. \n                         The shots go back and forth between \n                         the detectives and the Paul flashback, \n                         with him grabbing and shaking the razor \n                         wire, screaming. His screams sound distant \n                         under Jigsaw\u0092s voice.) Find the path \n                         through the razor wire to the door. \n                         But hurry. At 3:00 that door will lock \n                         and then this room becomes your tomb. \n                         How much blood will you shed to stay \n                         alive, Paul? (end)\n \n                                     KERRY\n                         (stopping the tape) The door was on \n                         a timer. It was unlocked until 3:00. \n                         Then it slammed shut. He was given two \n                         hours.\n \n               Cut back to Detective Tapp, who notices something and shines \n               his light on it. We see a strange wound on Paul\u0092s body, a piece \n               of flesh carved out into the shape of a jigsaw piece.\n \n                                     TAPP\n                         Jigsaw piece. (Sing looks in as well, \n                         see it. There is a quick flash of crime \n                         scene photos showing a close up of the \n                         wound. Tapp sighs.) I think we\u0092re gonna \n                         be here for a while, Sing. (Sing looks \n                         to him. We get another quick crime scene \n                         shot of Paul.)\n \n                                     LAWRENCE\n                         (VO) The newspapers started calling \n                         him the Jigsaw Killer.\n \n               Cut back to Lawrence in the bathroom. For his next two spoken \n               lines, the shot switches back and forth between him and the detectives \n               in the razor wire room.\n \n                                     LAWRENCE\n                         Actually, technically speaking, he\u0092s \n                         not really a murderer. He never killed \n                         anyone.\n \n               Sing, wearing gloves, gets in the cage and examines Paul\u0092s body \n               a bit. A flash of another crime scene photo of the wound with \n               a ruler held up to it is shown. More gruesome crime scene photos \n               of that and other wounds are flashed across the screen.\n \n                                     LAWRENCE\n                         (VO) He finds ways for his victims to \n                         kill themselves.\n \n               Cut to Sing kneeled down over a charred corpse, completely blackened, \n               at another crime scene. We hear Jigsaw\u0092s voice from a tape recorder \n               play over the scene as the detectives look around, and over the \n               flashback shots.\n \n                                     JIGSAW\n                         (VO, on tape) Hello Mark. If you\u0092re \n                         so sick, then why do I have so many \n                         photos of you up and about? (there is \n                         a quick montage of a camera snapping \n                         several black and white shots of Mark \n                         up and about, looking around and getting \n                         into a car.) Let\u0092s put your so-called \n                         illness to the test. (Flashback image \n                         of Mark waking up. He is a younger man \n                         in his mid to late twenties, with dark \n                         brown hair. He is completely nude, smeared \n                         in some kind of Vaseline-like ointment. \n                         In front of him is a small, square glass \n                         plate held up by some chains. On the \n                         plate is a micro cassette player, a \n                         lit votive candle, and a box of matches. \n                         He gets up, looking around confusedly \n                         and scared.) Right now, there is a slow-acting \n                         poison in your veins. The antidote is \n                         in the safe. (Black and white crime \n                         scene shot of the safe, then a shot \n                         of Mark standing over it, screaming, \n                         his screams distant under Jigsaw\u0092s voice, \n                         as with Paul.) The combination to the \n                         safe (quick montage of several black \n                         and white crime-scene photos of numbers \n                         written all over the walls) is written \n                         on the wall. Hurry up and program it \n                         in. But watch your step (Mark\u0092s bare \n                         foot steps on the broken glass scattered \n                         all across the floor). And by the way, \n                         that\u0092s a flammable substance smeared \n                         on your body (shot of Mark looking at \n                         the ointment on his hand, up his arm, \n                         everywhere), so I would be careful with \n                         that candle, if I were you...\n \n                                     MARK\n                         (huddled over the safe; screams, but \n                         it is still distant sounding) Help!!!!!\n \n                         \n                                     JIGSAW\n                         (VO ct\u0092d)....or all the people you\u0092ve \n                         burned with your act (Mark starts to \n                         turn the lock on the safe) just might \n                         have their revenge.\n \n               We see Mark desperately going around the room, holding the candle, \n               looking at the walls, trying to find a combination. The camera \n               goes back and forth a few times in a sped-up shot to him doing \n               this and turning a the lock on the safe, trying to program the \n               combination into the safe. He moves in a circle, clockwise to \n               us. When he gets to facing right in front of us, the flame from \n               the candle flares up and engulfs the shot, flaring into a close-up \n               crime scene photo of Mark\u0092s charred face.\n \n               The shot moves back to the trio of detectives, with Sing holding \n               the tape recorder.\n \n                                     KERRY\n                         I found something else. Well, two things, \n                         actually. (She moves past them and we \n                         go with her over to a wall where there \n                         is a small hole cut, about an inch or \n                         two in diameter. The light from the \n                         outside shines in.) There was someone \n                         standing outside here watching through \n                         this peephole. Looks like our friend \n                         Jigsaw likes to book himself front row \n                         seats to his own sick little games. \n                         He was there at the last one as well. \n                         (She walks over to Sing and Tapp) Only \n                         this time, he left us his penlight. \n                         (She holds up the penlight in an evidence \n                         baggie, clicking it twice then handing \n                         it to Tapp.)\n \n                                     TAPP\n                         (taking the baggie, studying it) Get \n                         a rush on the prints. (He hands it back \n                         to her.)\n \n                                     KERRY\n                         (taking the baggie, moving out of the \n                         room) Copy that.\n \n                                     CUT TO\n                         Hospital room. Lawrence in his white \n                         doctor\u0091s coat along with three blue-scrub \n                         clad medical students. A nurse in white \n                         stands off to the side. Lawrence is \n                         going over the patient\u0092s charts. He \n                         goes over to the x-ray display, pushing \n                         the light on to view two x-rays of someone\u0092s \n                         skull. He points to it with his pen \n                         as he speaks.\n \n                                     LAWRENCE\n                         Okay. This patient has an inoperable \n                         frontal lobe tumor extending across \n                         the midline. Started as colon cancer. \n                         (He turns back to the three young medical \n                         students. One of them, a pretty Asian \n                         girl named CARLA, smiles at Lawrence \n                         as he speaks, seems particularly infatuated \n                         with him.) The patient has come in for \n                         a standard checkup by which we are able \n                         to monitor the rate at which his condition \n                         is declining.\n \n               In the doorway, an orderly pushing a cart of cleaning supplies \n               is passing by and stops when he sees Lawrence and the medical \n               students in the room, listening to what Lawrence is saying. This \n               is Zep. He\u0092s a man in his early to late forties dressed in orderly \n               whites with short brown hair and large blue eyes that show a \n               kindness that the others in the room seem to be lacking. Kindness, \n               and something else below the surface. He glances down at John \n               sleeping, then up at Lawrence.\n \n                                     LAWRENCE\n                         The patient had...\n\n                                     ZEP\n                         (cutting him off) His name is John, \n                         Dr. Gordon. (He looks down at the patient, \n                         who we see is a man in his late forties-early \n                         fifties, hairless except for a small \n                         white goatee. His head is to the side \n                         and he is sleeping. On the tray table \n                         in front of him is a notebook and some \n                         colored pencils. As Zep looks at him \n                         and speaks of him, there is caring in \n                         his voice, something Dr. Gordon has \n                         yet to display regarding this patient.) \n                         He\u0092s a very interesting person.\n \n               Lawrence looks almost slightly embarrassed, not for himself but \n               maybe for Zep. A condescending, smug smile plays across his face \n               and he nods. His tone matches his look.\n \n                                     LAWRENCE\n                         Thank you for that information, Zep. \n                         (he looks to the students, who all share \n                         his smug smile) As you can see, our \n                         orderlies form very special bonds with \n                         the patients. (Zep just stares at Lawrence, \n                         his expression mostly blank but with \n                         pure loathing just underneath the surface. \n                         The look seems to say Fuck you, Dr. \n                         Gordon. He stares at him for a moment, \n                         then turns away, and continues down \n                         the hall with his cart.) Continuing \n                         on, the patient....\n \n               But he is cut off by a voice on the intercom.\n\n                                     INTERCOM\n                         Dr. Gordon, Dr. Lawrence Gordon, please \n                         page the operator.\n \n                                     LAWRENCE\n                         (a smug but annoyed smirk) Obviously \n                         someone doesn\u0092t want me to tell you \n                         what the patient has. Excuse me. (He \n                         steps around the students, leaves the \n                         room. The three students watch after \n                         him with great admiration.)\n \n               Cut to Lawrence\u0092s office at the hospital . Inside, Tapp is leaning \n               against Dr. Gordon\u0092s chair, studying the various framed degrees \n               on the wall. Sing is sitting in one of the two chairs across \n               from the desk, twisted around in his seat to look at a couple \n               of small picture frames on the bookshelf behind him. Lawrence \n               opens the door and enters, and the two detectives turn to look \n               at him. He removes his white coat and hangs it on a rack by the \n               door. Tapp speaks first, his tone is friendly, but searching.\n \n               \n                                     TAPP\n                         Dr. Gordon, I\u0092m Detective Tapp, this \n                         is Detective Sing, City Homicide. (he \n                         gestures to the degrees on the wall.) \n                         Very impressive.\n \n               Lawrence smiles, pretending to care about what they think, truly \n               just wanting to get this over with so as to not waste any more \n               of his time. As he speaks, he walks over to the chair behind \n               his desk.\n \n                                     LAWRENCE\n                         Oh. Thank you, I do my best. (He sits \n                         in his chair. Tapp takes the seat next \n                         to Sing across from him. Sing studies \n                         him silently, chewing gum.)\n \n                                     TAPP\n                         Sorry to interrupt you while you\u0092re \n                         working.\n \n                                     LAWRENCE\n                         That\u0092s fine. Now, how can I help you \n                         gentlemen?\n \n               Tapp\u0092s tone turns a bit more serious, but still amiable enough.\n \n               \n                                     TAPP\n                         Are you able to tell us where you were \n                         between the hours of 11:00 p.m. and \n                         1:00 a.m. last night, Doctor?\n \n                                     LAWRENCE\n                         (his tone just barely masking his concern) \n                         Why is it that you\u0092re interested?\n \n                         \n                                     TAPP\n                         We\u0092d like to ask you a few questions \n                         about it. For your sake, I think it\u0092s \n                         best if we do it down at the station. \n                         Would you like to follow us there?\n \n                         \n                                     LAWRENCE\n                         (Shaking his head, this is unbelievable) \n                         No, I\u0092m afraid that\u0092s...that\u0092s quite \n                         out of the question. I can\u0092t just leave, \n                         I have work to do. Plus, my wife has \n                         the car today, so...\n \n                                     SING\n                         (amiable but hinting that he knows something) \n                         Oh, that\u0092s okay, you can ride with us. \n                         Doc.\n \n                                     LAWRENCE\n                         (chuckles uncomfortably) I\u0092m sorry, \n                         you\u0092ll have to tell me again. What is \n                         this all about?\n \n               Tapp produces the penlight from his pocket, holds it up for Dr. \n               Gordon.\n \n                                     TAPP\n                         Is this yours, Doctor?\n\n               He puts the penlight down on the desk. Lawrence picks it up, \n               a brief oh shit look flashing across his face only to be quickly \n               covered up. He looks at the pen strangely. The two detectives \n               carefully study his reaction. Lawrence looks back up at them.\n \n               \n               Cut to the Police Station. In an interrogation room, Lawrence \n               paces back and forth nervously, now wearing his suit jacket. \n               His lawyer sits at the table, taking notes.\n \n                                     LAWYER\n                         So you have no idea how your penlight \n                         showed up at the murder scene?\n \n                                     LAWRENCE\n                         Of course not!\n\n                                     LAWYER\n                         I have to ask. What were you doing last \n                         night.\n \n                                     LAWRENCE\n                         (a slight hesitation, a bit of guilt \n                         in his voice. As much as he would allow.) \n                         I was seeing someone.\n \n                                     LAWYER\n                         (a slight pause) Who? (Lawrence doesn\u0092t \n                         answer, just continues his pacing. The \n                         lawyer gets frustrated, noisily puts \n                         down his pen.) Look, if you can\u0092t be \n                         honest with me...\n \n                                     LAWRENCE\n                         (His tone quick, almost blurting) I \n                         was visiting someone. It wasn\u0092t a patient. \n                         Alright? (He sighs, shakes his head. \n                         He\u0092s fucked, either way.) What am I \n                         gonna do?\n \n                                     LAWYER\n                         Well, as your lawyer and your friend, \n                         my advice to you is to bite the bullet \n                         and give them your alibi now. Because \n                         no one is going to believe you later.\n \n                         \n               Cut back to the Bathroom. Lawrence, still sitting against the \n               wall, throws down his hacksaw next to him, resting his hand against \n               his knee.\n \n                                     LAWRENCE\n                         (sighs) That was five months ago. He \n                         tried to set me up for murder.\n \n               Cut back to the Interrogation room, some time Later. Lawrence \n               is sitting alone at the table. Sing comes through the door, shuts \n               it behind him.\n \n                                     SING\n                         Okay. We checked your alibi. It holds \n                         up. (His voice indicates that he still \n                         believes there\u0092s more to it; he does \n                         not and will not trust Lawrence.)\n \n                         \n                                     LAWRENCE\n                         Good! Can I go home now?\n\n                                     SING\n                         (continuing) We have one of the victims \n                         who managed to escape. (As he speaks, \n                         we see a young woman with brown hair \n                         in a ponytail wearing a visitors pass \n                         being led carefully into the room next \n                         to them and sat at a table. This is \n                         AMANDA. Lawrence and Sing can see her \n                         clearly; she cannot see them.) Want \n                         to know if you wouldn\u0092t mind sticking \n                         around and listening to her testimony? \n                         Maybe it\u0092ll trigger something. (Tapp \n                         and an unidentified bald black man in \n                         a suit enter the room. The man guides \n                         Amanda into her chair, stands behind \n                         her against the wall. Tapp sits in a \n                         chair to her left.)\n \n                                     LAWRENCE\n                         (doesn\u0092t really care) I\u0092d like to help, \n                         really, but...\n \n                                     SING\n                         (cutting him off quickly, won\u0092t let \n                         him out of this that easily) Well, we\u0092d \n                         really appreciate it. She\u0092s the only \n                         one who made it.\n \n                                     LAWRENCE\n                         (quietly, giving in.) Okay.\n\n               Camera moves into the Interrogation room with Amanda, Tapp, and \n               the unidentified man. As Tapp speaks, the camera slowly moves \n               closer over his shoulder and towards Amanda. As we get closer \n               to her, we see long, strange, scar-like markings along each side \n               of her mouth. She is shaken, her eyes distant, never looking \n               anyone, including Tapp, in the eye. It is clear that her mind \n               is still lost somewhere within her nightmare.\n \n                                     TAPP\n                         (speaking slowly, gently) Amanda...in \n                         your own time, tell me the first thing \n                         you remember.\n \n               We move closer and closer to Amanda, then suddenly the camera \n               spins round quickly and snaps into an alternate view of her, \n               her flashback. The room she is in has the same lime-green lighting \n               as Paul\u0092s cell. Amanda sits in a chair wearing a strange iron \n               contraption around her head, a bear-trap like device covering \n               her mouth. We can see her eyes, surrounded with black eyeliner, \n               as they slowly open, groggy, just waking up.\n \n                                     AMANDA\n                         (VO) I woke up. All I could taste was \n                         blood. (The camera moves back quickly, \n                         and we see her tied to the chair, her \n                         wrists bound to the arms of the chair. \n                         She pulls against her bonds, moaning \n                         loudly, trying to speak or cry out but \n                         cannot.) And metal.\n \n               She continues to struggle against her bonds some more. The camera \n               circles around her, and we get a better view of the strange device \n               on her head, and the padlock and timer on the back of it. A long \n               wire hangs down from the timer and below the screen.\n \n               The view switches to the side of her and we see next to her an \n               old television set, which suddenly switches on, startling her. \n               After a brief moment of static, the frightening image of a demented \n               clown-like doll its face white with red spirals on its cheeks, \n               its red eyes leering at Amanda from the screen. She stares at \n               it, her moans a bit softer to match her fear and utter confusion. \n               The doll speaks, the jaw moving; it is the voice of Jigsaw.\n \n               \n                                     JIGSAW\n                         (from the TV) Hello Amanda. You don\u0092t \n                         know me, but I know you. I want to play \n                         a game. Here\u0092s what happens if you lose. \n                         (The video moves next to the doll, to \n                         a device like the one she\u0092s wearing \n                         attached to a mannequin head. As he \n                         continues, explaining what it is, her \n                         breathing grows faster and heavier, \n                         and her moans pick up more.) The device \n                         you\u0092re wearing is hooked into your upper \n                         and lower jaws. When the timer at the \n                         back goes off, your mouth will be permanently \n                         ripped open. Think of it like a reverse \n                         bear trap. Here, I\u0092ll show you.\n \n               The video pans back to a view of the doll and the device. The \n               doll\u0092s head moves and looks down at the device, and the camera \n               zooms in on it. A timer ticks away. A few seconds later, SNAP! \n               The device springs and the fake head is crushed and explodes. \n               Amanda shrieks, her eyes widening. The video switches back to \n               a close up of the doll.\n \n                                     JIGSAW\n                         (from the TV) There is only one key \n                         to open the device. It\u0092s in the stomach \n                         of your dead cellmate. Look around, \n                         Amanda. Know that I\u0092m not lying. You \n                         better hurry up. Live or die. Make your \n                         choice.\n \n               The video goes to white and gray static, then switches off. Amanda \n               begins to struggle like a madwoman against her bonds and the \n               chair. The camera swings around her, circling, making her movements \n               fast and jerky. Amanda manages to pull one arm free, then the \n               other and stands up quickly. That\u0092s when the cord in the back \n               of the device is pulled out, and the timer starts. She freezes, \n               her eyes widening. We see a close-up of the timer, and it begins \n               its sixty second countdown. She reaches behind her head, pulling \n               at the lock and the timer, trying to pull it off, but it is stuck \n               there. She starts freaking out, pulling at it as much as she \n               can, the camera movements once again fast and jerky around her.\n \n               \n               The camera spins back to Amanda sitting still in her chair in \n               the interrogation room, sniffling. We see a brief shot of Lawrence, \n               who watches and listens to her with grim amazement. Back to Amanda.\n \n               \n                                     AMANDA\n                         And then I saw the body.\n\n               We switch back into Amanda\u0092s cell. Over her shoulder, we see \n               near the corner the body of a man lying on the floor on his back. \n               Amanda cautiously approaches it, the timer still ticking away, \n               her hands still at the device. She kneels down cautiously next \n               to him. She reaches down and with a shaking hand lifts up his \n               shirt, revealing a large, black question mark drawn on his abdomen. \n               She sobs harder, hunched over him.\n \n               Quick cut to the interrogation room, Amanda in the center of \n               the shot.\n \n                                     AMANDA\n                         There was a knife.\n\n               Back to the cell. Amanda, still leaning over, picks up a small \n               knife next to the body. She slowly brings it up in both of her \n               shaking hands, clutching it. She looks closer at it. A quick \n               shot of the timer shows it to be at 25 seconds now, almost halfway. \n               The camera moves to a shot of the man\u0092s face, when...\n \n               HE OPENS HIS EYES AND STARTS TO WAKE UP. He moans, unable to \n               speak or move. His eyes slowly, groggily look around a bit. He \n               cannot even open his mouth; someone has very heavily drugged \n               him. He sees Amanda over him with a knife and his eyes widen; \n               he tries to moan at her to stop, to not do what she\u0092s about to \n               do, but she turns the knife upside down in both hands and quickly \n               stabs down. He moans in agony in the background as she stabs \n               down again, and again, and again. Blood splashes on her hands.\n \n               \n               A quick shot back of Lawrence as he listens, his mouth open slightly, \n               eyes wide, staring at her. Cut back to Amanda in the cell as \n               she stabs down a few more times. Then back again to the table \n               in Lawrence\u0092s interrogation room. Sing throws down an evidence \n               baggie with a used syringe in it.\n \n                                     SING\n                         (VO as camera pans up to Lawrence) He\u0092d \n                         been injected with an opiate overdose. \n                         He couldn\u0092t move or feel much of anything.\n \n                         \n                                     LAWRENCE\n                         You mean....he was alive?\n\n                                     SING\n                         (staring, nods slightly) Was.\n\n               Back to Amanda\u0092s Interrogation room, her head still hung, still \n               sniffling. A view of Tapp as he asks\n \n                                     TAPP\n                         What happened after you took it off?\n \n                         \n               Cut back to the cell, her bloody hands sifting through intestines \n               for a key. Cut back to interrogation room Amanda, then cut back \n               again to her holding up a liver or some other organ. Back to \n               interrogation room Amanda, the horror on her face growing, then \n               back to the cell.\n \n               Amanda\u0092 s hand pulls a small key from inside the organ she\u0092s \n               holding. She reaches around the back of her head, quickly trying \n               to unlock the padlock. The timer ticks away, faster and faster. \n               She gets it, pulls off the padlock and opens the device in the \n               back, ripping it away from her head and throwing it down as it \n               snaps open. She lets out the most terrible, agonized, heart-wrenching \n               scream, sobbing loudly, her hands held out in front of her, rocking \n               back and forth.\n \n               Suddenly from another corner of the room, a light comes on, revealing \n               the puppet from the video in the corner. Amanda sees it, staring \n               at it wide eyed, her sobs softening for a moment as she stares \n               at it. Slowly, it wheels towards her on a tricycle. She can only \n               stare and cry, not sure what to do or expect. It stops, leering \n               at her, then speaks.\n \n                                     JIGSAW\n                         Congratulations. You are still alive. \n                         Most people are so ungrateful to be \n                         alive. But not you. Not anymore.\n \n               Cut back into a close up of Amanda in the interrogation room, \n               her head still shaking a bit, almost like a series of slight \n               spasms. She continues to sniffle, her eyes far off. Cut to Tapp.\n \n               \n                                     TAPP\n                         You are, in fact, a drug addict. Isn\u0092t \n                         that right, Mandy? (she nods, but doesn\u0092t \n                         look up.) Do you think that is why he \n                         picked you? (She lets out a sob, briefly \n                         nodding once.) Are you grateful, Mandy?\n \n                         \n               She finally raises her head, looking into his eyes for the first \n               time.\n \n                                     AMANDA\n                         (softly) He...helped me.\n\n               As she starts sniffling and breathing more heavily, Tapp looks \n               over his shoulder into Lawrence\u0092s room, right in his direction. \n               He may not see him, but he knows he\u0092s there. The camera then \n               cuts back to Amanda, who starts sobbing more heavily again. Slowly, \n               the camera moves down into and under the table, fading back into \n               an overhead view of the bathroom where Lawrence and Adam are.\n \n               \n               Adam sits in his corner, staring down at the floor as he has \n               been listening to Lawrence\u0092s story. He looks up across to Lawrence.\n \n               \n                                     ADAM\n                         (softly) Are you sure it\u0092s him?\n\n                                     LAWRENCE\n                         (nods slightly) Yeah, I\u0092m sure.\n\n                                     ADAM\n                         (becoming a little hysterical again. \n                         He speaks accusingly) How do I know \n                         you\u0092re telling the truth? You can be \n                         the one who put me in this room! (he \n                         gesticulates as he speaks, pointing \n                         to Lawrence and himself.)\n \n                                     LAWRENCE\n                         (internal eye roll, speaks slowly, as \n                         to a simpleton) I\u0092m in exactly the same \n                         situation you\u0092re in.\n \n                                     ADAM\n                         Wrong. (he stands up, kicking his chained \n                         foot out. Shouts.) Wrong! You\u0092ve got \n                         one thing I don\u0092t: Information! (He \n                         hovers as close as he can in a threatening \n                         pose, pointing) You know who did this! \n                         (He picks up a glass shard that fell \n                         when he broke the mirror, holds it up \n                         threateningly to Lawrence) Now you either \n                         tell me what is really going on (Lawrence \n                         rolls his eyes, turns his head over \n                         to his left, away from Adam) or I\u0092ll \n                         cut you with this, you hear me? I\u0092ll \n                         cut- (But he stops short as he sees \n                         something in the glass. He flips it \n                         over, studying it, flips it back. He \n                         looks over to the mirror on the wall, \n                         studying it, thinking.)\n \n               Lawrence notices that Adam\u0092s ranting has ended, glances over \n               at him.\n \n                                     LAWRENCE\n                         What?\n\n                                     ADAM\n                         (looks over at Lawrence, then back at \n                         the mirror.) It\u0092s a two-way mirror.\n \n                         \n               Adam drops the shard down on the floor carefully, then reaches \n               over to the corner behind him, leaning down and picking up a \n               loose padlock. He lifts it up and throws it as hard as he can \n               against the mirror, shattering most of the glass. Lawrence briefly \n               startles at the sound and force of the glass shattering. Adam \n               reaches back down, finds another piece of debris and throws that \n               at the mirror with just as much force. The rest of the glass \n               breaks away, and a camera with a red light can bee seen behind \n               a clear glass. Lawrence stands up to get a better look at it. \n               We movie in closer to the camera, getting a better look at it \n               as well.\n \n               Suddenly there is a flash of static and we find ourselves looking \n               at a fuzzy, black and white surveillance video of Lawrence and \n               Adam in the bathroom, staring right at us into the camera. The \n               shot pulls back a bit and we see that the video is on a silver \n               surveillance monitor. A partial view of other recording-type \n               equipment can be seen on either side of the monitor. A man\u0092s \n               voice speaks, though it doesn\u0092t sound quite the same as on the \n               Jigsaw tapes. As he speaks, a hand wearing a black leather glove \n               raises up slightly and waves its fingers at the screen.\n \n                                     MAN\n                         (OS, Taunting) I can see you...\n\n                                     ADAM\n                         (from on video) So that\u0092s what this \n                         is. Reality TV.\n \n                                     MAN\n                         (OS. Still taunting, sounds as though \n                         on a power trip) Don\u0092t look at me. I \n                         can\u0092t help you.\n \n               The shot transitions from the video view of Adam back into regular \n               view in the bathroom. Adam stands in a threatening pose to the \n               camera, speaks angrily, loudly to it, his voice dripping with \n               sarcasm.\n \n                                     ADAM\n                         Can you hear me in there? Huh? I\u0092m having \n                         a blast. (he bends down and picks up \n                         another piece of debris from the floor) \n                         This is the most fun I\u0092ve had without \n                         lubricant. (Hums the piece of debris \n                         at the window. It makes a thwacking \n                         sound, but doesn\u0092t break. Not even a \n                         crack.) Make sure you\u0092re getting everything. \n                         (Bends down, throws picks up and throws \n                         another piece of debris. It hits, but \n                         no breakage. Leans down for another \n                         piece.)\n \n                                     LAWRENCE\n                         (Scoffing tone as he watches Adam trying \n                         to break the glass) That\u0092s not going \n                         to do anything.\n \n                                     ADAM\n                         (pauses, looks to Lawrence) You just \n                         want to leave it running on us? (the \n                         shot switches to surveillance view)\n \n                         \n                                     LAWRENCE\n                         (very matter-of-fact) Well, you won\u0092t \n                         stop it. (shot switches to regular view) \n                         That\u0092s why we can\u0092t cut through these \n                         chains. It\u0092s why you won\u0092t break that \n                         glass. (he gestures to the pipe then \n                         the glass) Every possible angle has \n                         been pre-thought out by him. (He appears \n                         deep in thought, starting to understand \n                         the set-up more so, figuring out the \n                         way this guy thinks. Almost admiring \n                         him. The situation may be bad, but it\u0092s \n                         a brilliant design.)\n \n                                     ADAM\n                         You sound like you admire this prick.\n \n                         \n                                     LAWRENCE\n                         (explaining) To overcome something, \n                         you have to understand what a perfect \n                         engine it is. That\u0092s how you fight disease. \n                         (He looks up at the ceiling, at the \n                         walls, around the room) Now the tape \n                         told us to find an X. That X has to \n                         be somewhere in this room. (determined) \n                         Help me find it.\n \n               Adam does not help him look. He simply cannot believe Lawrence\u0092s \n               calm demeanor in this situation anymore. It seems that he is \n               almost becoming as sick of Lawrence\u0092s attitude as Lawrence is \n               of his. He speaks a with a bit of a hyper tone again, accusingly.\n \n               \n                                     ADAM\n                         How can you be the calm Doctor Guy when \n                         your wife and kid are out there. (Shot \n                         of Lawrence looking around the room) \n                         He\u0092s got them, too. (Shot of the clock; \n                         it\u0092s now 12:05.) He could be doing anything \n                         to them right now. Are you thinking \n                         about that?\n \n                                     LAWRENCE\n                         (Suddenly looks right at him, snaps \n                         angrily) I AM thinking about that. (Adam \n                         backs off a bit. Lawrence pauses a moment, \n                         his voice changes to calm but sad.) \n                         I\u0092ve been the last thing I said to my \n                         daughter.\n \n               Lawrence turns away from Adam, placing his hand on the pipe behind \n               him, and the shot moves up into blackness, then up at the foot \n               of a little girl\u0092s bed in a darkened bedroom. The little girl \n               is Diana. She\u0092s about 5 or 6 years old, with long, wavy light \n               brown hair. She lays tucked in with her eyes closed, her favourite \n               teddy bear wrapped in her left arm. The camera moves up and over \n               her a bit, moving in closer to her. Chimes can be heard tinkling \n               very faintly against a soft breeze. As the shot pauses just above \n               her, her eyes suddenly open, blinking away sleepiness. She sits \n               up, pulling away the covers, still holding her teddy bear. She \n               remains sitting in her bed, staring over into the dark corner \n               to her right. The chimes jingle away. We move in closer to her \n               face; something has her spooked. A clock ticking is suddenly \n               heard as the image fades from Diana getting out of bed into a \n               strange, mechanical-looking clock on the living room wall of \n               the Gordon Household.\n \n               The shot lowers and we see the nicely furnished living room of \n               the Gordon home. The walls are a dark, crimson red, the furniture \n               in tones of red and brown. It definitely is the living room of \n               a well-off family. Not too cold, but not as warm and homey as \n               it could be. Diana slowly makes her way across the living room \n               towards her parents bedroom, moving almost dream-like, her teddy \n               bear hanging limply from her right hand. She moves to the frosted \n               glass double doors of her parents room, opening them both into \n               the bedroom, where we see her mother, Alison, laying on her side, \n               fast asleep. Alison is in her early to mid thirties with long \n               blond hair going just past her shoulders and very pretty despite \n               her sleepiness and messy hair in this scene. Diana moves into \n               the room, standing next to the bed, saying nothing, just watching \n               her mother sleeping. Alison\u0092s eyes slowly open; the feeling of \n               being watched plus the instincts of a mother have awoken her. \n               She reaches over and turns on the light, looking upon her daughter \n               with concern.\n \n                                     ALISON\n                         Diana, Honey, are you okay? (she pushes \n                         back the covers and gets up, crouching \n                         down in front of her daughter. Looking \n                         up at her, she places her hands on her \n                         daughter\u0092s arms.) Diana, Honey, can \n                         you hear me?\n \n                                     DIANA\n                         (very softly, but showing almost no \n                         fear) Mommy?\n \n               Alison reaches up and touches Diana\u0092s hair, bringing her hand \n               down in a soft caress on Diana\u0092s cheek.\n \n                                     ALISON\n                         Oh, what is it, sweet pea?\n\n                                     DIANA\n                         (very calmly) There\u0092s a man in my room.\n \n                         \n                                     ALISON\n                         (sighing, but not rudely. This is not \n                         the first time this has happened) Oh \n                         Honey, are you sure he\u0092s not just hiding \n                         in your imagination?\n \n                                     DIANA\n                         He talked to me.\n\n                                     ALISON\n                         (sighs) Okay, I\u0092ll come and check your \n                         room. (She smiles a small, assuring \n                         smile)\n \n                                     DIANA\n                         I want Daddy. He\u0092ll get the scary man.\n \n                         \n                                     ALISON\n                         (her smile fading a bit) Alright, if \n                         you want. Come on.\n \n               She stands and leads Diana out of the room. Cut to Lawrence\u0092s \n               office. Lawrence sits hunched slightly over his laptop computer, \n               focused on some paper he\u0092s writing. Diana and Alison appear in \n               the doorway to his left. He doesn\u0092t even look up, just keeps \n               typing. Alison\u0092s tone when she speaks indicates that she knows \n               he\u0092ll probably say no, or put it off on her.\n \n                                     ALISON\n                         Larry, sorry to bother you, but your \n                         daughter had a bad dream again.\n \n                                     LAWRENCE\n                         (his eyes never leaving the screen; \n                         raises his finger to pause them) Just \n                         a minute.\n \n                                     ALISON\n                         She wants you to check her room.\n\n                                     LAWRENCE\n                         (keeps typing, never looks up) Mmm hmm, \n                         mmm hmm, just gotta finish this paragraph.\n \n                         \n               Alison waits a moment, then turns to Diana.\n\n                                     ALISON\n                         (softly) You know what sweetie? I\u0092ll \n                         go check with you.\n \n               They turn, slowly start to walk away as Lawrence quickly finishes \n               typing, then closes the laptop.\n \n                                     LAWRENCE\n                         Nope! I\u0092m done. (he smiles, turning \n                         to look at them.)\n \n               Cut to Diana\u0092s room. Lawrence reaches over and turns on the lamp \n               on Diana\u0092s side table. Diana lies in bed, slightly propped up \n               against her pillows and stuffed animals. Lawrence sits on the \n               side of her bed.\n \n                                     LAWRENCE\n                         (very reassuringly) See? (he pulls the \n                         covers up over her, up to her chest.) \n                         There\u0092s no one in your room. There\u0092s \n                         no such thing as the bad man. Now can \n                         you go to sleep?\n \n                                     DIANA\n                         I\u0092m still scared.\n\n                                     LAWRENCE\n                         You are? Give me your tootsie. (He pulls \n                         back the covers and she pulls out her \n                         foot. He takes it in his hand.) Oh, \n                         what a big tootsie. (He turns to her, \n                         raising his eyebrows up) Remember this \n                         one? (He counts on her toes as he says \n                         the following) This little piggy went \n                         to market, this little piggy stayed \n                         home, this little piggy had roast beef, \n                         this little piggy had none, and this \n                         little piggy went \u0091Weeee!\u0092 (he tickles \n                         up her leg to her tummy and she giggles) \n                         all the way home!\n \n               Just then, Lawrence\u0092s beeper goes off. He leans back, takes it \n               out and looks at it.\n \n                                     DIANA\n                         I hate that thing.\n\n                                     LAWRENCE\n                         Well I have to go to work, sweetheart. \n                         You know what Daddy\u0092s job is like. Now, \n                         come on. (he re-tucks her in, she smiles \n                         at him.) Let\u0092s see. Try and get some \n                         sleep now, okay? (He gives her a kiss, \n                         smiles, stands up and goes to the door.)\n \n                         \n                                     DIANA\n                         You\u0092re not going to leave us, are you, \n                         Daddy?\n \n                                     LAWRENCE\n                         (suddenly concerned) What? (He stops \n                         at the door, turns, goes back over to \n                         her bed, sits down next to her and leans \n                         over. This was the last thing he\u0092d expected \n                         her to say) What are you talking about? \n                         You mean, leave you and Mommy? (She \n                         nods; he reaches up and gently brushes \n                         her hair away from her face.) No, no \n                         sweetheart, I would never do that. Who \n                         gave you that idea?\n \n                                     DIANA\n                         No one.\n\n                                     LAWRENCE\n                         Well it\u0092s not true, okay?\n\n                                     DIANA\n                         (very softly) Okay.\n\n                                     LAWRENCE\n                         How much do I love you?\n\n               He moves his face closer to her and together they say\n\n                                     LAWRENCE & DIANA\n                         Love you very much\n\n                                     LAWRENCE\n                         That\u0092s right, that\u0092s right! (He gives \n                         her a kiss, pulls back.) Good night, \n                         sweetie.\n \n                                     DIANA\n                         Good night, Daddy.\n\n               Lawrence gets up and goes to the door, flipping the lights off. \n               He pauses before he steps out.\n \n                                     LAWRENCE\n                         Tomorrow, I\u0092ll read you your favourite \n                         story.\n \n                                     DIANA\n                         (with a small smile) Okay.\n\n                                     LAWRENCE\n                         Okay. (he goes out.)\n\n               Quick cut to the Entrance Hall of the Gordon Residence. Lawrence \n               walks towards the door, Alison behind him. Alison\u0092s voice starts \n               to cut over the scene. Her tone is very pissed off.\n \n                                     ALISON\n                         I don\u0092t know how much longer I can do \n                         this, Larry.\n \n                                     LAWRENCE\n                         (sounds as though he has no idea what \n                         she means) What, what are you talking \n                         about?\n \n                                     ALISON\n                         (pissed, in disbelief) How can you walk \n                         through life pretending that you\u0092re \n                         happy?\n \n                                     LAWRENCE\n                         I am happy.\n\n                                     ALISON\n                         (confrontational) That is complete bullshit. \n                         (cut to a shot of Diana, laying on her \n                         side in her darkened room, clutching \n                         her teddy bear to her chest. Her eyes \n                         are open, she can hear everything. We \n                         stay with her for the rest of Alison\u0092s \n                         line, her voice now off a bit in the \n                         distance but still very audible) I\u0092d \n                         rather you break down and tell me that \n                         you hated me. At least there\u0092d be some \n                         passion in it.\n \n                                     LAWRENCE\n                         Would you like to see her? (He reaches \n                         into his pocket and takes out his wallet, \n                         throws it across the room to Adam, who \n                         is sitting with his back against the \n                         wall, facing Lawrence. Adam picks up \n                         the wallet and opens it. He sees two \n                         pictures of Diana, side by side. The \n                         one on the left is Diana hugging a dog. \n                         The one on the right is a smiling portrait \n                         outside somewhere.\n \n                                     ADAM\n                         She\u0092s beautiful.\n\n                                     LAWRENCE\n                         Thank you.\n\n                                     ADAM\n                         (sighs, then looks up at Lawrence) You \n                         gonna have any more kids?\n \n                                     LAWRENCE\n                         (a bit wearily, but not snobby) We\u0092ve \n                         talked about it, but uh, with our schedules, \n                         it\u0092s difficult enough to concentrate \n                         on one. (The tone of his voice indicates \n                         that maybe he\u0092s starting to realize \n                         that he should\u0092ve spent more time and \n                         attention to his daughter.)\n \n                                     ADAM\n                         (referring to the wallet) So where\u0092s \n                         the lucky wife? (a small smile)\n \n                                     LAWRENCE\n                         There\u0092s another picture behind the one \n                         you\u0092re looking at. (Adam reaches behind \n                         the photo on the right and pulls another \n                         photograph out. Lawrence smiles slightly \n                         as he speaks) It\u0092s my favourite one \n                         because we\u0092re all in it together. Someone, \n                         usually me, has to hold the camera, \n                         which means I\u0092m always missing from \n                         the photos.\n \n               Cut to Adam, looking at the picture he pulled out. His face is \n               blank, but you can sense great disturbance behind it. Cut to \n               a shot of the photo he is holding. It is not the one Lawrence \n               described, but a Polaroid of Alison and Diana bound and gagged, \n               and the message Regards with a jigsaw piece drawn next to it. \n               He turns the photo over, and there is a message. As he reads \n               it, Jigsaw reads it aloud in a voiceover.\n \n                                     JIGSAW\n                         (VO) X Marks the spot. Sometimes you \n                         see more with your eyes shut.\n \n               Adam does his best to hide what he has seen, looks up to Lawrence.\n \n               \n                                     ADAM\n                         It\u0092s uh, it\u0092s not here.\n\n                                     LAWRENCE\n                         (a slight disturbance from his momentary \n                         nostalgic bliss) What?\n \n                                     ADAM\n                         Uh, this photo you\u0092re talking about...it\u0092s \n                         not here.\n \n                                     LAWRENCE\n                         (slightly surprised, reaching out his \n                         hand for Adam to toss the wallet.) Really? \n                         Are you sure?\n \n                                     ADAM\n                         Yeah. (Tucking the picture in his right \n                         hand, he shifts slightly by lifting \n                         himself a bit with his right hand, sneakily \n                         putting the photograph down and tossing \n                         the wallet with his left hand. Lawrence \n                         picks up the wallet and starts looking \n                         for it, creasing his brow in concern, \n                         while Adam backs up against his wall, \n                         holding the photograph out of Lawrence\u0092s \n                         sight against a pipe he rests his arm \n                         on as he looks at the photograph.)\n \n                         \n                                     LAWRENCE\n                         (disbelief, shaking his head) He...he \n                         must\u0092ve taken it. I...\n \n               Alison\u0092s voice over is heard as he says this and continues to \n               look through the wallet, and we hear Alison\u0092s voiceover from \n               the scene in the main hall.\n \n                                     ALISON\n                         (VO) How can you walk through life pretending \n                         that you\u0092re happy?\n \n               CUT TO the Main Hall of the Gordon Residence, back to the earlier \n               flashback of Lawrence and Alison. This time, we stay with them.\n \n               \n                                     LAWRENCE\n                         I am happy. (He walks over to a chair, \n                         leaning over it as he puts something \n                         down, gets his briefcase ready to go \n                         to work. Alison stands a few feet behind \n                         him, trying her best to get him to react, \n                         to stop the bullshit and end the masquerade.)\n \n                         \n                                     ALISON\n                         (pissed) That is complete bullshit. \n                         I\u0092d rather you break down and tell me \n                         that you hated me. At least there\u0092d \n                         be some passion in it.\n \n                                     LAWRENCE\n                         (tired of this, brushing it off as not \n                         that important, like there really is \n                         nothing wrong) We can talk about this \n                         alter, okay? (He leans in to kiss her, \n                         but she shakes her head. He pauses there.)\n \n                         \n                                     ALISON\n                         (firmly) Just leave.\n\n               He looks at her for a moment, searching, then slowly turns away \n               and heads out the door.\n \n                                     VOICE\n                         Goodnight, little girl. (camera pans \n                         up closer into the closet, and we a \n                         widened blue eye and part of a face \n                         (yet unidentifiable) watching her.)\n \n                         \n               The closet doors burst open and Diana screams. Cut back to the \n               main hall where Alison stands alone, her head lowered slightly. \n               As soon as she hears the scream she turns and bolts towards her \n               daughter\u0092s room.\n \n                                     ALISON\n                         Diana!?\n\n               Alison gets to just outside the door to her bedroom.\n\n                                     ALISON\n                         Diana! (opens the door and flips on \n                         the light, gasps when she sees a figure \n                         covered by a blanket looming over Diana\u0092s \n                         bed. The figure suddenly grabs Diana \n                         and she screams, struggling against \n                         him. Alison goes for them.\n \n               Quick cut to NOW, in Alison and Lawrence\u0092s bedroom. Waistline \n               shot of a figure wearing a black coat, black leather gloves and \n               blue jeans, holding a stethoscope. A gun is tucked into his belt \n               and Diana\u0092s teddy bear tucked under his arm. He saunters over \n               to the gagged and bound Diana and Alison, on the floor and tied \n               to a corner end of the bed. Alison, her eyes streaming tears, \n               struggles and pulls against her bonds to try to get at him but \n               fails. Diana keeps crying Mommy! over and over again and sobbing.\n \n               \n               The figure crouches down beside Diana, dropping the teddy bear \n               behind her, his face still unseen. He takes the stethoscope and \n               holds the end to Diana\u0092s chest. The sound of a loud, steady heartbeat \n               is heard. Alison screams at him through her gag.\n \n                                     ALISON\n                         Don\u0092t do that! Leave her! Get away from \n                         her!\n \n               He pulls away the stethoscope and the heartbeat halts. He reaches \n               with his right hand and pulls from his belt the gun. Diana\u0092s \n               screams become more desperate, Alison\u0092s more frantic, more angry. \n               He puts the stethoscope back against Diana\u0092s chest and moves \n               the gun up and down in front of her, then bringing it up to her \n               mother\u0092s head. We hear the heartbeat again, doubled in speed.\n \n               \n                                     ALISON\n                         (through her gag) Keep your motherfucking \n                         hands off of my daughter!\n \n               He pulls away the gun and the stethoscope, tucking the gun back \n               into his belt. He reaches down behind Diana and picks up the \n               teddy bear. As he does, we catch a brief glimpse of the lower \n               half of his face, but not enough for a clear identification yet. \n               He holds the teddy bear out in front of Diana for a moment then \n               tucks it in front of her. He pats her on the head and stands \n               up, moving over to the window. He parts the curtains slightly \n               and leans forward a bit, and we see his face more clearly. It \n               is Zep, the orderly from the hospital.\n \n               Cut to static, and then a surveillance video view of the exterior \n               of the Gordon home, of the window where Zep is standing. The \n               camera zooms in on him and we hear a raspy, male voice speaking.\n \n               \n                                     VOICE\n                         (VO as we view shot of Zep) Who are \n                         you little man...I see you...(cut to \n                         a television screen with the video of \n                         Zep in the window. Fade back and to \n                         the right as we get a view of someone\u0092s \n                         apartment. Plastered on the walls are \n                         various photographs, which we can barely \n                         make out, and a desk in the corner with \n                         some recording equipment. As we move \n                         further right and hit the window we \n                         see Detective Tapp, leaning over the \n                         camera shooting the Gordon\u0092s window, \n                         adjusting the view. Something about \n                         him seems just not right. We cut back \n                         to his view from the camera.) Does Dr. \n                         Gordon know you\u0092re at home with his \n                         wife? I know you know something. (his \n                         voice goes up a bit louder) What are \n                         you doing in there? Waiting for the \n                         doctor? I\u0092m waiting for the doctor, \n                         too. Hmm.\n \n               Cut to a view over Tapp\u0092s couch of the television with Zep on \n               video on the screen. Tapp walks over and sits down in front of \n               the television, his back to us.\n \n                                     TAPP\n                         I never should have let you go...\n\n               Camera pans up to a wall of articles, all about the Jigsaw killings. \n               It moves quickly and zooms in on each headline we see. Jigsaw \n               hunt brings D.A. before Judge, Missing Man discovered at Bizarre \n               Crime Scene screaming is heard then a quick flashback shot of \n               Paul in his cage, first struggling against the wire then hanging \n               dead in his cage Killer \u0091Preaching\u0092 Says Top Cop, Psychopath \n               Teaches Sick Life Lessons, quick shot of Mark going around looking \n               for the code on the walls, with the sound of his screaming over \n               the shot, Escape, Victim Survives Maniac\u0092s Game quick flashback \n               footage of Amanda in the interrogation room, then fighting with \n               her mask, and a shot of Lawrence watching and listening to her \n               testimony, Doctor Questioned in Case flash of shots of Lawrence \n               being questioned by the Tapp and Sing and then his Lawyer. It \n               ends on the flashback shot of Tapp looking back at Lawrence through \n               the two-way glass after Amanda tells her story, and the shot \n               slides into a shot of a car pulling up alongside a building.\n \n               \n                                     TAPP\n                         (VO, fading, hushed against soundtrack) \n                         I never should\u0092ve let you go...\n \n               The car pulls up alongside a building, with Lawrence in the passenger \n               seat, and Tapp driving. Lawrence\u0092s awkwardness, Tapp\u0092s distrust, \n               and general uncomfortable tension can be easily detected between \n               them.\n \n                                     LAWRENCE\n                         (Pretending like he\u0092s trying to be helpful, \n                         really just glad to be out of Tapp\u0092s \n                         company) Here we are. That was uh, quite \n                         an amazing story that poor woman told. \n                         (Tapp just nods, says nothing. Lawrence \n                         smiles very uncomfortably, gets out \n                         of the car.)\n \n                                     LAWRENCE\n                         (leaning down and looking back into \n                         the car window.) Look, I\u0092m sorry I can\u0092t \n                         be of more help to your investigation.\n \n                         \n                                     TAPP\n                         (nods very slightly) You know, we arrested \n                         a dentist last week who like to play \n                         with kids a bit too much. He lived two \n                         blocks from here. The sewer lines run \n                         under this neighborhood too, Doctor. \n                         (hint hint)\n \n               Lawrence stands straight up, walks away. Tapp wait\u0092s a moment, \n               then drives off.\n \n               BAM into static and then the video from Amanda\u0092s cell. We are \n               not at Tapp\u0092s desk in the police station, watching him obsessively \n               watch the video, staring at the screen, remote control in hand. \n               As he watches, the camera circles around behind the television \n               to give us a better view of our obsessed detective.\n \n                                     JIGSAW\n                         (from the video) Hello Amanda. You don\u0092t \n                         know me, but I know you. I want to play \n                         a game. Here\u0092s what happens if you lose. \n                         There\u0092s a timer at the back of the device \n                         you\u0092re wearing. When the timer goes \n                         off, your mouth will be permanently \n                         ripped open.\n \n               In the background of the station we hear a couple of detectives \n               talking, then Sing walks in behind Tapp, over to his own desk. \n               He turns, watching Tapp watch the screen. Tapp stops and rewinds \n               the tape.\n \n                                     SING\n                         (to the other detectives leaving) I\u0092ll \n                         catch you guys down there. (he reaches \n                         over and gets something off of his desk)\n \n                         \n                                     JIGSAW\n                         (from video) Think of it like a reverse \n                         bear trap.\n \n               Tapp fast forwards a bit, hits play.\n\n                                     JIGSAW\n                         (from video) I\u0092ll show you...\n\n               Tapp watches closely the demonstration of the timer then the \n               device going off and exploding. Sing watches too, not paying \n               as close attention. As soon as it explodes, Sing speaks. The \n               look on his face and the tone of his voice indicates his growing \n               concern for his partner\u0092s obsession over this case.\n \n                                     SING\n                         Hey Tapp?\n\n               Tapp doesn\u0092t look up, resembles Lawrence in the earlier scene \n               when Alison and Diana came to him to check her room while he \n               was working on his paper.\n \n                                     TAPP\n                         Mmm?\n\n                                     SING\n                         We\u0092re gonna go down to the Grill, go \n                         get a beer. You wanna come?\n \n                                     TAPP\n                         I don\u0092t think so. Thanks anyway.\n\n                                     SING\n                         (Figured he might answer as such) You \n                         know I always ask. (He puts on his jacket)\n \n                         \n                                     JIGSAW\n                         (on video) There is only one key...\n \n                         \n                                     SING\n                         I\u0092ll leave you to have fun up here. \n                         (He puts his hands on his hips, watching \n                         some more of the video.)\n \n                                     JIGSAW\n                         (on video) It\u0092s in the stomach of your \n                         dead cellmate.\n \n                                     SING\n                         (still trying to reach him, break him \n                         from his obsession groove) Hey Tapp? \n                         I don\u0092t mean for this to be disrespectful...(pause) \n                         Maybe you should find yourself a girlfriend.\n \n                         \n               Sing chuckles, hits Tapp playfully on the arm, tapp laughs a \n               bit too, but doesn\u0092t look up. Sing remains grinning a bit. But \n               then Tapp continues and rewinds the video a bit.\n \n                                     JIGSAW\n                         (on video) It\u0092s in the stomach of your \n                         dead cellmate.\n \n               Tapp fast forwards.\n\n                                     JIGSAW\n                         (on video) Look around, Amanda. Know \n                         that I\u0092m not lying. (Sing steps off \n                         to the right) You better hurry up. (Tapp \n                         rewinds again, suddenly pauses)\n \n                                     TAPP\n                         Wait wait wait, Sing!\n\n               Sing stops, turns.\n\n                                     TAPP\n                         Get back here!\n\n                                     SING\n                         What?\n\n                                     TAPP\n                         Mmm! (he gestures franticly for him \n                         to come over.)\n \n                                     SING\n                         (sighs then comes over) What?\n\n               Tapp rewinds one second then pauses, holds pencil to the screen \n               to a grafittied wall on the video.\n \n                                     TAPP\n                         Remember 118th Street?\n\n                                     SING\n                         (looks at the screen, thinks a minute) \n                         Ah...K2K. That gang\u0092s territory was \n                         only about four blocks.\n \n                                     TAPP\n                         Now listen to this.\n\n               They listen with the volume up high. Over the static, the sound \n               of a fire alarm can just barely be heard in the background. They \n               look at each other. Tapp hits stop.\n \n                                     TAPP\n                         (looking up at Sing) We gotta check \n                         the records from all the fire emergencies \n                         that occurred there in the last two \n                         weeks. Go, right now! Mmm!\n \n               Sing turns and quickly walks off.\n\n                                     CUT TO\n                         Close up of a map, with Sing speaking \n                         in a voiceover. As he speaks, there\u0092s \n                         a brief shot of the two of them sitting \n                         over the map, then quick shots of a \n                         few black and white photographs of a \n                         warehouse, including a close up of a \n                         street sign Stygian St.\n \n                                     SING\n                         (VO) On the night of Tuesday, the 17th, \n                         we got a fire alarm going off in the \n                         rear wing of 213 Stygian Street. It\u0092s \n                         an old listing. Used to be a mannequin \n                         factory. (cut back to view of the two \n                         detectives) You think we have enough \n                         for a warrant, though?\n \n                                     TAPP\n                         Who said anything about a warrant? (He \n                         grins, gets up and grabs his jacket.)\n \n                         \n                                     SING\n                         (are you serious?) Right now?\n\n                                     TAPP\n                         Why not?\n\n                                     SING\n                         Yeah, why not? (He grabs his gun, snaps \n                         a cartridge into it, grabsup his coat, \n                         and quickly follows Tapp.\n \n               Brief shot of K2K graffiti on the video and then loud static, \n               which snaps into an exterior nighttime view of an old warehouse \n               building and a car speeding by. Our view is from inside the car \n               as it pulls up alongside the building. A police radio can be \n               heard in the background. So can the sound of a gun being loaded \n               and cocked.\n \n                                     TAPP\n                         (VO) At least we\u0092ll have the cover of \n                         darkness.\n \n                                     SING\n                         (VO) Yeah, well, so will anybody else.\n \n                         \n               A shot of inside the factory, various clutter and tables piled \n               up on one another. No signs of life...yet. A bang from the outside \n               of the door is heard. A couple more bangs and a shot of the giant, \n               sliding wooden door as it slides open, and Sing steps in, holding \n               out his shotgun, ready for anything waiting for them. Cut up \n               to a staircase, lit by eerie green light, the same as from Paul\u0091s \n               razor wire room, as the detectives make their way up cautiously, \n               Tapp in front, Sing covering behind them. They come up another \n               level, one that has been recently used we see as Tapp points \n               over to a desk with a computer, a radio, and some other miscellaneous \n               items. Then, right next to the desk, we see the K2K graffiti \n               from the video.\n \n                                     TAPP\n                         I got you...\n\n               They continue on, moving into a room separated with a chain link \n               fence. There is a slightly raised platform, going along part \n               of the wall, with a few steps leading up on either side. Tapp \n               goes up the steps. On the raised area are some tables covered \n               in heavy red cloth. Tapp points to one, reaches down, and pulls \n               back the covering. He reveals a small diorama of the bathroom \n               scene where Adam and Lawrence dolls, complete with the body, \n               dolls representing each of them.\n \n                                     TAPP\n                         What the hell is this?.......(his voice \n                         almost a whisper) Oh shit...\n \n               They move onto the next table, and Tapp pulls back the cloth \n               covering that one, revealing the leering Puppet from Amanda\u0092s \n               video. Tapp stares at it wide-eyed. Next to the puppet is a strange, \n               boar-like mask with long dark hair. The camera pans back so we \n               have the view of another large object covered in red cloth that \n               Tapp and Sing had passed by. Tapp leans in closer to look at \n               the puppet, when suddenly the still-covered form starts to move \n               and muffled moaning sounds are heard. It startles the detectives.\n \n               \n                                     SING\n                         Oh fuck!\n\n               They both go over and stand on either side of it, taking one \n               end of the red cloth whipping it off. Underneath is a man tied \n               to a chair with duct tape over his mouth, held in place by a \n               manacle around his neck. A contraption on the chair holds two \n               power drills about six inches from either side of his head, pointed \n               directly at his temples. His eyes wide, he moans through his \n               tape at the detectives.\n \n               Suddenly, a door is heard clanging open on the other side of \n               the building, and the detectives spin to face the sound, guns \n               ready.\n \n                                     TAPP\n                         (looks to Sing, says softly) Wait Sing!\n \n                         \n                                     SING\n                         (trying to keep his voice low but coming \n                         off a bit loudly) What?\n \n                                     TAPP\n                         (eager) Let\u0092s see what he\u0092s gonna do.\n \n                         \n                                     SING\n                         Why? We\u0092ve fucking got him.\n\n               Tapp however, having studied this guy for so long, wants to get \n               a good look at him before he\u0092s captured, see him in his element.\n \n               \n                                     TAPP\n                         We don\u0092t know what he looks like. Let\u0092s \n                         see what he\u0092s gonna do.\n \n                                     SING\n                         (rather loudly, again) No fucking way!\n \n                         \n               As the two argue, the man in the chair continues to protest his \n               position.\n \n                                     TAPP\n                         Sing, Sing! (he moves in front of the \n                         man a bit, holding up his hand to try \n                         to halt Sing, trying to convince him \n                         to go along with him.)\n \n                                     SING\n                         (isn\u0092t buying into it) Fuck that. I\u0092m \n                         gonna take him.\n \n                                     TAPP\n                         Sing!\n\n                                     SING\n                         What the fuck? Shit!\n\n                                     TAPP\n                         Wait Sing, listen.\n\n               Whoever it is is moving closer, so they quickly cover up the \n               man and the other things they uncovered. The man in the chair \n               protests loudly through his gag and struggles as much as he can \n               in his chair. Sing and Tapp go and hide behind a tarp covering \n               the entryway to another room while a figure in a black robe lined \n               in red comes up on the elevator. The elevator stops, and the \n               figure moves forward, slowly and carefully. He goes up the steps \n               to the man in the chair. The figure\u0092s hood is up; we do not see \n               his face. As he walks, he seems like he might be having a somewhat \n               difficult time with it.\n \n               He reaches and uncovers the man, who begs in muffled tones through \n               the gag. When the figure speaks, we instantly know it is Jigsaw; \n               it is the unmistakable voice from the tapes and the video.\n \n               \n                                     JIGSAW\n                         Awake already, Jeff? I need more powerful \n                         tranquilizers next time. (Jeff continues \n                         his cries, sheds a few tears. Jigsaw \n                         reaches over and touches his shoulder) \n                         Don\u0092t cry. I\u0092ve given your life a purpose. \n                         You\u0092re a test subject for something \n                         greater than yourself.\n \n               That\u0092s when Sing cocks the shotgun and the two detectives move \n               out of their hiding spot, aiming their weapons at Jigsaw.\n \n                                     SING\n                         Freeze! Police!\n\n                                     TAPP\n                         Hold it right there! Don\u0092t move!\n\n                                     SING\n                         Put your fucking hands in the air!\n \n                         \n               Jigsaw slowly raises his hands, starts to turn to face them but \n               then quickly steps down hard on a red button on the floor, and \n               the drill trap on Jeff\u0092s chair comes to life. He remains with \n               his back mostly to them, hands still raised.\n \n                                     JIGSAW\n                         Now you\u0092ll make a choice. (Sing runs \n                         up the steps to try to where Jigsaw \n                         is, gun aimed at him. Tapp remains where \n                         he stands.) In 20 seconds, the life \n                         of this man will be ended.\n \n                                     TAPP\n                         Shut up and get down here!\n\n                                     SING\n                         (keeping his gun steadily aimed) What \n                         did you do? Turn it off!\n \n               Jeff in the meantime is struggling in his seat as the drills \n               come closer.\n \n                                     TAPP\n                         Sing, stop that thing! I\u0092m taking this \n                         bastard down. (Sing tosses Tapp the \n                         shotgun.) Move!\n \n                                     SING\n                         (to Jigsaw) How do you turn it off?!\n \n                         \n                                     TAPP\n                         Tell him how to stop it!\n\n               Jigsaw backs up a bit towards the stairs.\n\n                                     JIGSAW\n                         One key will unlock it.\n\n                                     SING\n                         (frantic) Where is it?!\n\n                                     JIGSAW\n                         It\u0092s in the box.\n\n                                     SING\n                         Box! (He sees a box on the side of the \n                         chair and opens it. Inside he pulls \n                         out a ring of at least 30 keys, and \n                         goes over to behind Jeff to try to unlock \n                         the device. He tries a couple of keys, \n                         none working.) Fuck! Which key, which \n                         key?!\n \n                                     TAPP\n                         Tell him which key it is!\n\n                                     JIGSAW\n                         (now facing Tapp, moving closer to him. \n                         His back is to us, we still don\u0092t see \n                         his face.) Time is running out.\n \n                                     TAPP\n                         Shut up and get down here right now, \n                         asshole!\n \n               Jigsaw slowly moves down towards him more.\n\n                                     JIGSAW\n                         What\u0092s more important to you Officer, \n                         arresting me or the life of another \n                         human being?\n \n               Sing keeps trying various keys. Tapp goes up Jigsaw and grabs \n               him, pushing him down to his knees. Jigsaw keeps his arms slightly \n               raised.\n \n                                     TAPP\n                         Get down on your knees!\n\n                                     SING\n                         Jesus! Tapp! Tapp!\n\n                                     TAPP\n                         (gun aimed at the back of Jigsaw\u0092s head) \n                         Hands behind your head! (Jigsaw obliges) \n                         Sick bastard.\n \n                                     JIGSAW\n                         Yes, I am sick, Officer.\n\n                                     SING\n                         (still trying various keys, none working. \n                         He\u0092s in a full-fledged panic. Jeff closes \n                         his eyes, crying, as the drills are \n                         only 2 inches away) Tapp! It\u0092s like, \n                         there\u0092s a hundred keys in here!\n \n                                     JIGSAW\n                         Sick from the disease eating away at \n                         me inside. Sick of people who don\u0092t \n                         appreciate their blessings. Sick of \n                         those who scoff at the suffering of \n                         others.\n \n               Sing finally whips out his gun and shoots each drill, breaking \n               and stopping them. Tapp glances up at him, briefly distracted \n               by the gunfire.\n \n                                     JIGSAW\n                         (as he pops a blade out of a wristband \n                         hidden up his right sleeve) Sick of \n                         it all! (He lashes upwards, slashing \n                         Tapp\u0092s throat)\n \n                                     SING\n                         (seeing the throat slash) Tapp!!! (runs \n                         down from Jeff towards them. Tapp clutches \n                         his throat, completely surprised, gurgling.)\n \n                         \n               Jigsaw RUNS, fast as he can, out of the room. Sing takes a couple \n               of shots at him and misses. He stops when he reaches Tapp, who \n               is slumped against the fence/wall and bends down next to him.\n \n               \n                                     SING\n                         (desperate, a trace of despair) No, \n                         no! Tapp! Shit!\n \n               Tapp gurgles at him, hands him the shotgun.\n\n                                     SING\n                         (standing, touching Tapp on the shoulder \n                         then head) I\u0092ll be back, okay? I\u0092ll \n                         be back.\n \n               Tapp just kind of nods, gurgling and holding his throat. Sing \n               spins around and then starts chasing Jigsaw through the warehouse, \n               out of the room and down a flight of stairs. He moves down a \n               long, misty corridor, gun up, moving quickly but still cautiously. \n               He takes a right, goes down another flight of stairs then takes \n               another right, stopping and looking down a short flight of stairs. \n               Quick cut to Tapp starting to try to get up, holding his throat. \n               He drags himself along the floor.\n \n               Back to Sing, who cocks his shotgun, then moves down the stairs \n               very cautiously. He takes a left around the corner, finds himself \n               facing down another corridor, where he sees Jigsaw trying to \n               get away. He takes aim.\n \n                                     SING\n                         (shouting) Freeze or I\u0092ll shoot!\n\n               Jigsaw continues moving, so Sing fires. He hits, and Jigsaw goes \n               down. Sing pauses, waiting to see if he gets back up. Jigsaw \n               doesn\u0092t move, so Sing cocks the gun again and starts to slowly \n               move forward towards him. Cut to a shot of Tapp as he struggles \n               to his feet and starts towards the stairs to follow Sing.\n \n               Back to Sing, moving further down the hall. He gets about halfway \n               down it when we see a shot of his feet just at a trip-wire. Over \n               it are some cobwebs hanging down. He reaches to part them, and \n               steps forward into the wire. As he steps we see a shot of a shotgun \n               with wire slowly pulling down on the trigger. Sing looks up, \n               and the trigger of that gun and six other shotguns pointing down \n               directly at him fire. Sing is hit, blood splattering against \n               him and the wall. We see only from his shoulders down. He spasms \n               for a moment, then falls forward to his knees. Cut to Tapp, who \n               is making strange vowel sounds, moving down the flight of stairs \n               just before the hallway where Sing now is.\n \n               On his knees, Sing remains upright for a moment, spasming more. \n               We go to a shot of Jigsaw on the floor. Jigsaw starts moving \n               and gets himself up to his feet, and starts hobbling further \n               down the hall. Sing\u0092s body finally falls forward onto the floor, \n               spasming still. Tapp continues down the stairs, falling against \n               the wall a couple of times. We see Jigsaw as he gets to the end \n               of the hall and starts sliding a large door open.\n \n               At that moment, Tapp reaches the bottom of the stairs and turns \n               into the hallway, collapsing back into a sitting position on \n               the stairs. Jigsaw hobbles through the door and starts to go \n               left. Tapp sits up a bit and looks down the hall, where he sees \n               Sing, who has stopped spasming. His eyes widening, Tapp removes \n               the hand from his throat and reaches forward towards Sing, his \n               mouth opening and moving but no sound other than some gasping \n               coming out. The shot fades to a slow-paced black and white, and \n               then snaps into a few crime scene photos of Sing\u0092s body, including \n               a nice gory one of the top of his head, part of which is now \n               missing.\n \n               At the last photoflash, we cut back to a shot of Tapp presently, \n               sitting on his couch. The shot shows a good view of the scar \n               across his neck.\n \n                                     TAPP\n                         (weak, desperate) Had you...had you \n                         on your knees. (He sits forward, getting \n                         some things off the coffee table) You\u0092re \n                         running. You\u0092re running...(He gets up \n                         and goes over to the desk in the corner \n                         with the audio recording device and \n                         dozens of photos pinned to the wall, \n                         takes a seat) You\u0092re running scared \n                         because we had you. I\u0092m going to close \n                         this case. Ram close it. (He picks up \n                         a small framed photograph, which we \n                         can\u0092t see, but likely, it\u0092s of Sing.) \n                         Right, Sing? Right? We\u0092re gonna close \n                         it, Sing.\n \n                                     LAWRENCE\n                         X Marks the spot...(He stands, touching \n                         the pipe and looking up and around a \n                         bit.) X marks the spot...we need to \n                         search this room again. (He turns and \n                         looks over at Adam.) What are you doing \n                         over there?\n \n               Cut back into regular view in the bathroom, with a shot of Adam \n               sitting on the tub, holding the photograph of Alison and Diana \n               just beneath the edge of the inside of the tub, looking down \n               at it. He ignores Lawrence, flipping the photo over.\n \n                                     LAWRENCE\n                         (irritated) Excuse me?\n\n                                     ADAM\n                         (glancing up; calm irritation) Just \n                         because I\u0092m stuck in this room with \n                         you doesn\u0092t mean I have to report to \n                         you every ten seconds.\n \n                                     LAWRENCE\n                         (sighs) I really don\u0092t see the point \n                         in us not helping one another.\n \n                                     ADAM\n                         well what do you want me to do? I\u0092m \n                         on a leash.\n \n                                     LAWRENCE\n                         That\u0092s exactly why we need to talk. \n                         We need to think!\n \n                                     ADAM\n                         I am thinking!\n\n                                     LAWRENCE\n                         (snapping at him) Well then don\u0092t keep \n                         me in the dark about what you\u0092re thinking!\n \n                         \n               There is a pause as something about that statement strikes Adam.\n \n               \n                                     ADAM\n                         Turn off the lights.\n\n                                     LAWRENCE\n                         What?\n\n                                     ADAM\n                         (letting the photo fall into the tub \n                         as he stands) Turn them off now, please!\n \n                         \n                                     LAWRENCE\n                         (doesn\u0092t get it) Why?\n\n                                     ADAM\n                         (impatiently) Just turn them off for \n                         a second!\n \n               Lawrence stares at him oddly but moves backwards, reaching over \n               and flipping off the lights. Adam looks around. Lawrence looks \n               around too, but he sees nothing. He doesn\u0092t seem to think this \n               is going to help any. Then we see on the wall next to him a glow \n               in the dark X painted on the tiles. He doesn\u0092t see it and shrugs, \n               but Adam spots it.\n \n                                     ADAM\n                         Jesus, behind you!\n\n                                     LAWRENCE\n                         (turns and sees it, is surprised) How \n                         come we didn\u0092t see that before?\n \n                                     ADAM\n                         The lights in here hadn\u0092t charged it. \n                         It must be glow in the dark paint or \n                         something.\n \n               Lawrence turns and flips the lights back on, both of them wincing \n               slightly at the sudden transition from dark to bright white, \n               though not as much as before. Lawrence leans over and picks up \n               his hacksaw, going over to the tiles where the X is and starts \n               hitting the tiles with the handle of the hacksaw. He breaks through, \n               reaching into a small cavity in the wall and pulling out a small \n               brown box with a hinged lid. He can\u0092t believe it. He looks to \n               Adam, a small grin on his face. He places it on the floor and \n               sits down behind it.\n \n                                     ADAM\n                         (excitedly) Open it!\n\n                                     LAWRENCE\n                         (turns it around so we and Adam can \n                         see the small lock on it.) It\u0092s locked. \n                         (He pauses, thinking, then realizes \n                         something) The key, the one from my \n                         envelope. Where is it?\n \n               Adam looks around him, then leans down, looking on the floor \n               for the key.\n \n                                     ADAM\n                         (soft, hushed tone as he looks) Where \n                         the fuck...Here. (He finds it, picks \n                         it up and tosses it over.)\n \n               Lawrence picks up the key, tries it on the lock. It works. He \n               takes the lock off, opens the box. He holds up a cell phone, \n               smiling in relief.\n \n                                     ADAM\n                         (big smile) Cell phone. The most beautiful \n                         invention on this planet!\n \n               Lawrence takes out and holds up one of two cigarettes. Adam lets \n               out a joyful laugh.\n \n                                     ADAM\n                         Make that second most beautiful invention! \n                         (He reaches out his hand for Lawrence \n                         to toss it.) Give me that.\n \n                                     LAWRENCE\n                         Are you joking? You\u0092re gonna put something \n                         we found in this room in your mouth?\n \n                         \n                                     ADAM\n                         (pause, then) Yes, I\u0092m willing to risk \n                         it! Give me that sweet cancer. (Lawrence \n                         ignores his request, tosses out the \n                         other cigarette and a lighter. He finds \n                         lastly a small folded up note with the \n                         words Shh, Doctor, written on it.) I \n                         don\u0092t care, I really don\u0092t. Give me \n                         one of those.\n \n               Jigsaw\u0092s voiceover reads what\u0092s written on the note as Lawrence \n               opens the paper and reads it, keeping it low in the box where \n               Adam can\u0092t see it.\n \n                                     JIGSAW\n                         (VO) The cigarettes are harmless, I \n                         promise. Smoking is only poisonous when \n                         it ends in bloodshed. Think about this \n                         - you don\u0092t need a gun to kill Adam.\n \n                         \n                                     ADAM\n                         (growing impatient) May I please have \n                         a cigarette?\n \n                                     LAWRENCE\n                         (ignoring his plea) I\u0092m trying the police. \n                         (He flips open and dials on the cell \n                         phone, but a weird beeping noise indicating \n                         the call can\u0092t go through comes from \n                         the phone. He dials again, same result.) \n                         Shit. (Pause, thinks.) This was meant \n                         to receive calls, not make them. (A \n                         moment; he realizes something.) Wait \n                         a minute...this has happened before.\n \n                         \n               Cut back to an overhead descending view inside a parking garage.\n \n               \n                                     LAWRENCE\n                         (VO) Last night, after I finished at \n                         the hospital. (fade into another closer \n                         shot of the cars, and Lawrence walking \n                         down the corridor, carrying his briefcase.) \n                         I was walking back to my car. (He stops \n                         a moment) I thought I was alone, but \n                         I\u0092m sure someone else was there. (He \n                         squints, bringing his hand up over his \n                         eyes. There is a flash from the side. \n                         He looks up, startled, looking in the \n                         direction in which he thinks it came \n                         from, but sees nothing. He looks around \n                         him for another moment, then continues \n                         forward to his car.)\n \n               Cut to a shot within a circular overhead mirror of Lawrence\u0092s \n               car pulling up to an abandoned security gate station. He gets \n               out of the car, shutting the door and going over to a phone on \n               the wall to dial security to let him out. When he dials, though, \n               it gives him a busy signal. As it beeps, we cut to another shot \n               of his car in the mirror. The back door on the passenger side \n               starts to slowly open. Back to Lawrence, who hangs up the phone, \n               aggravated, and reaches into his pocket for his cell phone. He \n               opens it and dials. Back in the mirror, we see something get \n               out of the car on its hands and knees. It is in a red robe and \n               has a strangely shaped head with long, tangly dark hair. Lawrence \n               finishes dialing, holds the phone to his ear but receives the \n               same beeping tone as the phone in the bathroom, indicating that \n               he cannot make outgoing calls. Perplexed, he holds up the phone, \n               trying to get a better signal. Alongside the car, the thing moves \n               even closer now. It gets up slowly. We see that it is wearing \n               the strange boar mask previously seen in the flashback of Jigsaw\u0092s \n               workshop. It suddenly rushes upon him as he\u0092s distracted with \n               his phone and grabs him.\n \n               Cut back to Lawrence sitting on the floor in the bathroom, still \n               holding the phone.\n \n                                     LAWRENCE\n                         (His eyes distant, off in his memory) \n                         That...thing. It was waiting for me. \n                         (He exhales sharply, then looks back \n                         up at Adam. Adam is just standing there, \n                         staring at him. Something seems a bit...off. \n                         With a suspicious tone, Lawrence addresses \n                         him.) How did you know to turn off the \n                         lights?\n \n                                     ADAM\n                         Who cares? It worked.\n\n                                     LAWRENCE\n                         Yeah, but how did you know?\n\n                                     ADAM\n                         (a slight pause) Instinct. (His tone \n                         is far from believable.)\n \n                                     LAWRENCE\n                         (doesn\u0092t believe a word of it) Instinct?\n \n                         \n                                     ADAM\n                         Yeah.\n\n                                     LAWRENCE\n                         You know what? (he looks down, then \n                         back up at Adam.) You\u0092re a terrible \n                         liar.\n \n                                     ADAM\n                         (quiet offense) You say that like you \n                         know me.\n \n                                     LAWRENCE\n                         (speaks calmly, but anger lies underneath \n                         the surface) What else aren\u0092t you telling \n                         me?\n \n                                     ADAM\n                         (cocky and sarcastic) Well, um, let\u0092s \n                         see. On my sixth birthday, my best friend \n                         at that time, Scott Tibbs, stabbed me \n                         with a rusty nail. I didn\u0092t tell you \n                         about that. I didn\u0092t\u0092 tell you that \n                         my last girlfriend, (Lawrence lowers \n                         his head into his hands. Un-FUCKING-believable) \n                         who was a feminist vegan punk, broke \n                         up with me because she thought I was \n                         too angry. Uh, I haven\u0092t told you that \n                         one of my toenails is slightly...\n \n                         \n                                     LAWRENCE\n                         (snaps at him, fed up) Just stop it. \n                         You knew to turn off these lights.\n \n                         \n                                     ADAM\n                         (turning away from Lawrence) What-ever.\n \n                         \n                                     LAWRENCE\n                         (stands up, frustrated.) I\u0092m dealing \n                         with a juvenile.\n \n                                     ADAM\n                         (has had it, looks right at him) You \n                         wanna know?\n \n                                     LAWRENCE\n                         (exasperated) Yeah!\n\n               Adam leans down and reaches into the bathtub, pulls out and holds \n               up the picture of Alison and Diana.\n \n                                     ADAM\n                         (with a somewhat aggressive attitude) \n                         Here it is. (He throws it towards Lawrence, \n                         who looks down at it, then back up at \n                         Adam before getting down on the floor \n                         and pulling it towards him with the \n                         hinged box. He picks it up, sitting \n                         up as he looks upon it with shock. )\n \n                         \n                                     LAWRENCE\n                         (very softly, shakily) Oh God...(he \n                         turns it over, then back. Adam casts \n                         his eyes downwards, still standing but \n                         cooling off, feeling bad for Lawrence) \n                         W...where did you get this?\n \n                                     ADAM\n                         (softly) It was in your wallet, behind \n                         the photo of your daughter.\n \n                                     LAWRENCE\n                         W...why didn\u0092t you show me this before?\n \n                         \n                                     ADAM\n                         I couldn\u0092t. (Lawrence begins to shakily \n                         sob, touching the photo.) I\u0092m sorry. \n                         (Adam goes over and sits against a pipe \n                         in his corner, lowering his head and \n                         upper body forward, holding his head \n                         in his hands.)\n \n               Lawrence sniffles, shaking, then looks right to the surveillance \n               camera behind the glass and screams.\n \n                                     LAWRENCE\n                         What are you doing to them you bastard?! \n                         (He goes back to huddling over the photograph, \n                         sniffling and crying for a moment. Then, \n                         he sits up, trying to pull himself together) \n                         Okay...okay..(he looks around a bit) \n                         Okay, I\u0092ve got to think now...(He looks \n                         down, sees the note again in the box.)\n \n                         \n                                     JIGSAW\n                         (VO) Think about this...you don\u0092t need \n                         a gun to kill Adam. When there\u0092s that \n                         much poison in your blood (a slow shot \n                         moving to the pool of blood from the \n                         body in front of Lawrence), the only \n                         thing left to do is shoot yourself.\n \n                         \n               Lawrence looks at the body, then down. He\u0092s getting an idea. \n               He takes a cigarette, glances over at Adam, who still has his \n               head down in his hands. He dips the end of the cigarette in the \n               blood, then puts it back in the box. He starts to get up. Adam \n               looks up, sees him standing.\n \n                                     ADAM\n                         What are you doing?\n\n               Lawrence goes to the light, looks at the camera, suddenly flips \n               off the lights. We see a shot of Zep startling when the lights \n               go out on the monitor, then we go back to the darkened bathroom.\n \n               \n                                     ADAM\n                         Hey! What the hell are you doing?\n\n                                     LAWRENCE\n                         (whispering so the surveillance camera \n                         will not pick him up) Adam, listen to \n                         me. I want you to play along with me \n                         on this.\n \n               Zep leans in, trying to hear what\u0092s being said, but the static \n               of the video is too loud. He tries to adjust the sound, but to \n               no avail. Shot goes back into the bathroom, where Lawrence is \n               finishing saying something to Adam.\n \n                                     LAWRENCE\n                         You got that? (he turns the lights back \n                         on, both of them again wincing at the \n                         bright light. Lawrence glances at the \n                         surveillance camera, then looks to Adam.\n \n                         \n                                     LAWRENCE\n                         (trying to be nonchalant) So you uh, \n                         still want that cigarette?\n \n                                     ADAM\n                         Um...yeah, sure.\n\n               Lawrence makes a show of reaching into the box where the poisoned \n               cigarette is, but takes the other un-dipped one instead. He throws \n               it to Adam, who reaches down and picks it up from where it lands. \n               Lawrence throws the lighter as well. Adam puts the cigarette \n               between his lips and reaches down, picking up the lighter. He \n               glances over at Lawrence, who watches him intently. Adam just \n               shrugs then lights up. He takes a long drag, then exhales in \n               a sigh of relief and with a smile. He takes another drag then \n               suddenly freezes, his head jerking and a strange gurgling sound \n               coming from his throat. His head jerks more then the rest of \n               his body, his eyes widening. His hand drops the cigarette and \n               goes to his throat as he turns, still jerky and making a strange, \n               almost squeaky choking sound in his throat. The sound grows louder \n               as he falls to his knees, then back a bit, his left arm held \n               out in front of him dramatically. He falls backwards onto the \n               floor, twitching some more, still choking. He lets out a long \n               cough, suddenly stops jerking, and closes his eyes. The death \n               in its entirety is very, very fake.\n \n                                     LAWRENCE\n                         (watches Adam, then turns to the surveillance \n                         camera, speaks with angry finality) \n                         There! I\u0092ve done it! I\u0092ve killed him \n                         with the poison, just like you wanted. \n                         (shouting) Now where\u0092s my family?! Where \n                         are they?!\n \n               Suddenly, we go to a shot of Adam lying there and a loud, electrical \n               buzzing sound is heard as his body jerks to life and he cries \n               out. He spasms and jerks around as he is electrocuted, and Lawrence \n               looks upon him in shock. Finally, the electrocution stops, and \n               Adam sits up slightly, gasping, eyes wide.\n \n                                     ADAM\n                         (he shrieks in pain and shock) Jesus \n                         Christ!!\n \n               Lawrence\u0092s reaction is not one of concern; he simply can\u0092t believe \n               that Adam just screwed up the plan.\n \n                                     LAWRENCE\n                         (disbelief) What?\n\n                                     ADAM\n                         (wide eyed) I just got electrocuted!\n \n                         \n                                     LAWRENCE\n                         What? (he rolls his eyes. Unbelievable. \n                         He speaks in a hushed tone.) That was \n                         our way out!\n \n               Adam looks at him in shock, cannot believe Lawrence would think \n               he\u0092d make something like that up.\n \n                                     ADAM\n                         (yelling at him) Did you hear what I \n                         said? (he desperately grabs at the manacle \n                         around his ankle, pulling at it and \n                         shrieking) Get this thing off me! Get \n                         it off!\n \n                                     LAWRENCE\n                         (pissed off) Stop acting!\n\n                                     ADAM\n                         (stops pulling at the manacle and chains; \n                         now he\u0092s pissed at Lawrence for his \n                         disbelief) You think I would make that \n                         up just to mess up your stupid fucking \n                         charade?\n \n                                     LAWRENCE\n                         (gives up on Adam, frustrated once more) \n                         All right, that\u0092s it! (He leans over \n                         and picks up his saw, sits down and \n                         starts trying to saw through his chains \n                         again, grunting. Adam, in the meantime, \n                         just sits back against the wall, breathing \n                         heavily, looking dazed. Lawrence continues \n                         to franticly saw, but it doesn\u0092t work. \n                         He gets pissed off and throws the blade \n                         down.) Ah, Damn it!!\n \n               Back to Adam, still looking dazed. Suddenly, a look of realization \n               dawns upon his face. The electrocution has jogged his memory.\n \n               \n                                     ADAM\n                         (wide-eyed) I remember everything now. \n                         (Lawrence glances over at him.) I remember \n                         how I got here.\n \n               Flashback to Adam walking up the stairs in his apartment building, \n               a camera around his neck, smoking a cigarette and listening to \n               music on his headphones. He walks with an uncaring, slow swagger. \n               He gets to the top of the stairs and walks down a red-lit hallway \n               to his apartment. He goes inside, closing the door behind him \n               then moving into the kitchen area, throwing his keys onto the \n               table and opening the fridge. The entire apartment is very rundown, \n               decrepit, dingy and old; truly a shithole apartment as Adam described \n               it earlier. There is graffiti on the door and walls, the wallpaper \n               is fading and peeling, the refrigerator is dirty.\n \n               Adam opens the fridge and looks inside for a moment. He sighs, \n               then closes the door. He heads over to his darkroom, closing \n               the door behind him. The lighting is dark red. He puts the camera \n               down on the table, taking the strap off from around his neck, \n               takes off his headphones and cd player, presses stop and puts \n               them down off to the side. He sighs tiredly and goes over to \n               a tray where a photo is developing and picks it up with his fingers, \n               ganging it with a closepin on a hanging line with other photos. \n               It is a picture of a man wearing sunglasses. The man is in fact \n               Lawrence. To the left of that one is a shot of Lawrence in the \n               parking garage with his hand over his eyes.\n \n               The camera cuts to a shot of the newest photo through a peephole \n               in the darkroom door as the camera fades out and back, viewing \n               the grafittied door of the darkroom before the shot fades to \n               black, industrial music playing over the shot.\n \n               Cut to Adam sleeping in the now pitch-black darkroom, his head \n               down on the table. He wakes up abruptly, as though he hadn\u0092t \n               meant to fall asleep. He looks around, confused, wondering why \n               all the lights out. He gives a Great, another problem type of \n               sigh. He stands and yawns, reaching over for the lightswitch. \n               He moves it up and down a few times, but nothing happens. Another \n               aggravated sigh. He reaches down and finds a flashlight on the \n               counter, presses the on button but it doesn\u0092t work. Pissed, he \n               shakes it hard, trying to get it to come on, but that doesn\u0092t \n               work. He looks at it, scoffs.\n \n                                     ADAM\n                         Great.\n\n               Suddenly, he hears something move outside the door, somewhere \n               in his apartment. On alert, he listens. He looks down and picks \n               up his camera, slinging it around his neck and holding it out \n               in front of him. He opens the creaky door into his also pitch-black \n               apartment. He takes a few steps forward, speaks nervously, but \n               trying to be brave.\n \n                                     ADAM\n                         Is someone there? (he takes a picture, \n                         the flash lighting up the area in front \n                         of him.) I can hear you. (He takes another \n                         picture, the flash lighting up a living \n                         room area. Nothing yet. He moves forward \n                         more, into the kitchen entryway, snapping \n                         away for light.)\n \n               Suddenly, from behind him, an EVIL DOLL LAUGH is heard. He startles, \n               spinning around.\n \n                                     ADAM\n                         (his voice alarmed but confused at the \n                         same time) What the...? (He snaps a \n                         picture in its direction and sees the \n                         Puppet from Jigsaw\u0092s workshop and video \n                         sitting in an armchair, continuing its \n                         evil laugh.) Christ! (He reaches down \n                         and finds a baseball bat on the floor, \n                         and starts hitting the doll as hard \n                         as he can until the laugh starts to \n                         fade and then just dies out. ) What \n                         the...\n \n               He hears the sound of movement again, coming from just behind \n               him in a closet. He goes on alert again, holding up the baseball \n               bat and the camera.\n \n                                     ADAM\n                         Who is that?! Who\u0092s in there?! (he moves \n                         towards the door, shaking but trying \n                         to be a tough guy) Come on out! I\u0092ll \n                         kill you, you motherfucker! (He opens \n                         the door, holds the camera and takes \n                         a picture. As soon as the flash goes \n                         off we see the red-robed pig thing that \n                         originally grabbed Lawrence quickly \n                         move forward and grab Adam.)\n \n               Suddenly, the cell phone rings. Lawrence looks down at it in \n               slight surprise. Adam snaps out of his daze to look at it as \n               well. Lawrence glances over at Adam and then carefully reaches \n               down, picks it up and answers it. The scene will cut back and \n               forth to Diana and Alison in the room and Lawrence on the phone \n               for the duration of the conversation.\n \n                                     LAWRENCE\n                         (not sure what to expect) Who is this?\n \n                         \n                                     DIANA\n                         (on the phone, sobbing) Daddy?\n\n                                     LAWRENCE\n                         Diana? (he stands)\n\n                                     DIANA\n                         Daddy, is that you? (cut to a shot of \n                         her being held by Zep, the phone to \n                         her ear.)\n \n                                     LAWRENCE\n                         (getting sniffly) Yeah baby, it\u0092s me. \n                         I\u0092m here. (Adam watches him intently)\n \n                         \n                                     DIANA\n                         (sobbing) I\u0092m scared, Daddy.\n\n                                     LAWRENCE\n                         (trying his best to reassure her) Don\u0092t \n                         worry honey, everything\u0092s going to be \n                         okay. Where\u0092s Mommy?\n \n                                     DIANA\n                         She\u0092s here with me.\n\n                                     LAWRENCE\n                         (Staying as calm and collected as he \n                         can for his daughter) Let me talk to \n                         her sweetie, okay? Put Mommy on.\n \n                                     DIANA\n                         The bad man from my room is here. He \n                         has us tied up and he has a gun.\n \n                                     LAWRENCE\n                         W...what man?\n\n                                     DIANA\n                         Please come home Daddy! (Zep kisses \n                         her on the top of her head and takes \n                         the phone away to give to Alison.)\n \n                         \n                                     LAWRENCE\n                         Hello? Hello? Diana?\n\n               Zep pushes some of Alison\u0092s hair behind her ear with the barrel \n               of the gun.\n \n                                     LAWRENCE\n                         (desperate) Diana! Diana!\n\n               Zep puts the phone up to Alison\u0092s ear.\n\n                                     ALISON\n                         Larry?\n\n                                     LAWRENCE\n                         Ally? Is that you? (We see a shot of \n                         Alison giving a threatening look through \n                         her tears to Zep.)\n \n                                     ALISON\n                         Is Adam there?\n\n                                     LAWRENCE\n                         (surprised, looks to Adam, who continues \n                         to watch him worriedly) How do you know? \n                         Ally, what is going on?\n \n                                     ALISON\n                         (through her sobs, trying to calm them \n                         and get this message to him) Don\u0092t believe \n                         Adam\u0092s lies. He knows you. He knew all \n                         about you before today. (Zep quickly \n                         takes the phone away, hangs up. Cut \n                         back to the bathroom, Lawrence on the \n                         phone.)\n \n                                     LAWRENCE\n                         (a dial tone is heard from the other \n                         end hanging up. Lawrence is desperate) \n                         Hello? Ally? Ally? (No answer, just \n                         the dial tone. He stands up.) Hello? \n                         (He looks to the surveillance camera, \n                         screaming) God damn you! If you so much \n                         as lay a finger on them, I\u0092ll kill you! \n                         You hear me? You son of a bitch! I\u0092ll \n                         kill you! (He sits down, leaning forward \n                         over the floor, crying a bit. He slams \n                         his fist fiercely against the floor.)\n \n                         \n                                     ADAM\n                         (quietly, as though cautiously approaching \n                         a dangerous animal) Are they okay?\n \n                         \n                                     LAWRENCE\n                         (sits up. His voice is calmer, but rage \n                         is clearly underneath the surface) My \n                         wife, she uh, she mentioned your name.\n \n                         \n                                     ADAM\n                         (a brief Oh shit look appears in his \n                         eyes, but he acts surprised) What did \n                         she say?\n \n                                     LAWRENCE\n                         (not looking at him yet. Speaks very \n                         firmly, trying to suppress his rage.) \n                         She told me...not to believe you.\n \n                         \n                                     ADAM\n                         (cannot even look at Lawrence.) Believe \n                         me about what? (There is no doubt he\u0092s \n                         hiding something)\n \n                                     LAWRENCE\n                         (Finally turns to look at him, the look \n                         of 1000 deaths) She told me you knew \n                         me. (He stands, looming menacingly, \n                         the look stronger on his face) Who are \n                         you?\n \n                                     ADAM\n                         (still trying to cover up and losing, \n                         still not making eye contact) You know \n                         who I am.\n \n                                     LAWRENCE\n                         (snaps, shouting at him) Stop the lies! \n                         You\u0092re a liar! I need to know the truth!\n \n                         \n                                     ADAM\n                         (His tone changes, he\u0092s had it with \n                         hiding, had it with Lawrence) I\u0092m a \n                         liar? (Finally, he looks up, right at \n                         Lawrence. His voice is firm and accusing.) \n                         What did you do last night, Lawrence? \n                         Work at a hospital? Saving sick children? \n                         You told me that after you left your \n                         house last night, you went to work at \n                         a hospital.\n \n                                     LAWRENCE\n                         (defensively) That\u0092s because it\u0092s the \n                         truth.\n \n                                     ADAM\n                         (almost deadly) No it\u0092s not. Your wife \n                         is right, Larry. (Lawrence is now the \n                         one wearing the Oh shit look.) You don\u0092t \n                         recall getting your picture taken in \n                         that parking lot?\n \n               Brief flashback shot of Lawrence in the parking garage, pausing \n               and covering his eyes for a moment when the camera flashed. We \n               see a shot of Adam holding the camera and taking the shot from \n               around a corner, ducking back behind the column. Lawrence looks \n               up at the flash, startled.\n \n               Cut back to the bathroom. Adam stands up, his stance and body \n               language accusing of Lawrence. He speaks fiercely, disgusted \n               with Lawrence\u0092s two-faced bullshit.\n \n                                     ADAM\n                         I can prove that you didn\u0092t go anywhere \n                         near a hospital last night. (He leans \n                         over and pulls out the garbage bag from \n                         the tub. Lawrence stands, staring at \n                         him in near disbelief. He has been caught. \n                         Adam takes a handful of photos from \n                         the baggie he\u0092d kept hidden inside the \n                         garbage bag, holds them up and throws \n                         them down, scattering them.) It\u0092s not \n                         the first time I\u0092ve done it either, \n                         Larry. (Lawrence leans over to look \n                         at the photos on the floor in front \n                         of him with complete and utter disbelief, \n                         picking one up and looking down at it) \n                         I\u0092ve been taking pictures of you for \n                         a few days now. (Shots of some of Adam\u0092s \n                         pictures. Lawrence going into a building, \n                         Lawrence at an outdoor café eating lunch.)\n \n                         \n                                     LAWRENCE\n                         (still holding the photograph) But...why?\n \n                         \n                                     ADAM\n                         You wanna know what I do? I get paid \n                         to take pictures of rich guys like you \n                         who go to seedy, out-of-the-way motels \n                         to fuck their secretaries. (we start \n                         seeing more shots Adam took while following \n                         Lawrence) Last night I went to your \n                         house. (Flashback of Adam holding his \n                         camera, then cut to several photographs \n                         of Lawrence leaving his house, glancing \n                         over his shoulder and moving down the \n                         sidewalk) I watched you leave. I followed \n                         you (Lawrence in the parking garage, \n                         photographs of the exterior of the Hotel \n                         Barfly. Lawrence inside the hotel, knocking \n                         on the door to one of the rooms while \n                         Adam hides around the corner with his \n                         camera) all the way to that shitbag \n                         hotel. (Photographs of Lawrence standing \n                         outside then going into the room.)\n \n                         \n                                     LAWRENCE\n                         (calm with rage just beneath the surface) \n                         You\u0092ve uh, had these with you the whole \n                         time?\n \n                                     ADAM\n                         I found them, in there (points to the \n                         toilet; quick flashback of Adam pulling \n                         the bag out of the top of the toilet, \n                         then Adam opening the bag and seeing \n                         the hacksaws and a glimpse of something \n                         else in the bag.) with the hacksaws. \n                         (Flashback of Adam tossing the bag into \n                         the bathtub while Lawrence isn\u0092t looking.) \n                         I don\u0092t know how they got there.\n \n                                     LAWRENCE\n                         (angry) Yeah, right. You\u0092re so full \n                         of it! (He angrily crumples up and throws \n                         the photo he was holding at Adam)\n \n                         \n                                     ADAM\n                         (scoffing tone) Aww, face it, Larry, \n                         we\u0092re both bulls hitters. But my camera \n                         isn\u0092t. It doesn\u0092t know how to lie. It \n                         only shows you what\u0092s put right in front \n                         of it. Just out of curiosity, what did \n                         you do in that motel room? You got out \n                         of there pretty fast.\n \n               Cut to a flashback, the hotel room. Carla, the pretty Asian girl \n               from the hospital, is inside the room, now in a black lacy top \n               and a gray/blue skirt, waiting for him. She opens the door, taking \n               a step back as he enters. He looks unsure of the whole situation, \n               a changed attitude this evening from all the others. He shuts \n               the door behind him, and Carla smiles at him. Lawrence\u0092s tone \n               when he speaks is unhappy. Not enraged, just somewhat disapproving.\n \n               \n                                     LAWRENCE\n                         Why did you um, deem it necessary to \n                         page me when you knew I was at home?\n \n                         \n                                     CARLA\n                         I didn\u0092t know if you were going to make \n                         it. (turns, goes and sits on the bed.)\n \n                         \n                                     LAWRENCE\n                         (sounding very business-like) But I \n                         gave you a precise time at which to \n                         page me. (He puts the briefcase on a \n                         chair by the door then goes over and \n                         sits down next to her on the bed.) You \n                         can\u0092t do that.\n \n                                     CARLA\n                         It\u0092s not like I know the rules for this \n                         sort of stuff. (She starts unbuttoning \n                         her shirt. Lawrence holds out his hand \n                         and stops her. She looks up at him, \n                         concerned.) What\u0092s wrong, Dr. Gordon?\n \n                         \n                                     LAWRENCE\n                         (a sigh in his voice) Look, it was wrong \n                         for me to makes you come here.\n \n                                     CARLA\n                         (confused, hurt) But I thought we-\n \n                         \n                                     LAWRENCE\n                         -Please. (very softly) I\u0092m sorry. (He \n                         stands and heads over to the door. Carla \n                         remains sitting on the bed. She sniffles \n                         slightly but doesn\u0092t cry.)\n \n               Suddenly, the hotel room phone rings. Carla and Lawrence both \n               look at it, unsure, startled. Carla looks to Lawrence.\n \n                                     LAWRENCE\n                         You tell anyone you were here?\n\n                                     CARLA\n                         No. (She stands, goes over to the phone \n                         and answers it.) Hello? (She listens, \n                         turns to Lawrence) It\u0092s for you. (She \n                         holds out the phone.)\n \n                                     LAWRENCE\n                         For me? (He walks over, takes the phone.) \n                         Hello?\n \n               The voice on the other end is male, slightly raspy. It is unidentifiable; \n               it could be either Tapp or Zep, or someone else. It is very accusing.\n \n               \n                                     VOICE\n                         I know what you\u0092re doing...Doctor.\n \n                         \n                                     LAWRENCE\n                         I- (but the other person hangs up, and \n                         a dial tone is heard)\n \n               Lawrence hangs up the phone, turns and moves to the door. Carla \n               moves with him, watching, waiting for him to say who it was.\n \n               \n                                     LAWRENCE\n                         (nervous) I have to go.\n\n                                     CARLA\n                         What happened?\n\n                                     LAWRENCE\n                         I\u0092ve got to go. (He picks up his briefcase \n                         from the chair, and heads out the door.\n \n                         \n               Cut to the underground parking lot, the same shot as where Adam \n               took Lawrence\u0092s picture. He walks along, pauses to wince and \n               cover his eyes, then the flash. He looks up startled.\n \n               The shot cuts back to Lawrence leaning forward against the wall \n               in his corner, hand against a pipe. He slowly looks up at Adam, \n               thinking of something.\n \n                                     LAWRENCE\n                         Who was it?\n\n                                     ADAM\n                         Who was what?\n\n                                     LAWRENCE\n                         The person who paid you to follow me, \n                         who was it?\n \n                                     ADAM\n                         (internal shrug) He calls himself Bob \n                         and he gives me the money up front. \n                         Two hundred bucks a night. If I\u0092d have \n                         known I was gonna end up here, I would\u0092ve \n                         asked for a hell of a lot more.\n \n                                     LAWRENCE\n                         (pissy) What does that mean? Does that \n                         mean you saw what happened to me?\n \n                         \n                                     ADAM\n                         (internal eye roll; speaks as though \n                         he\u0092s been over this 100 times before) \n                         What I saw was you get into your car. \n                         That\u0092s it. I didn\u0092t ask your name. I \n                         didn\u0092t know who you were. I don\u0092t know \n                         how I got here, I don\u0092t know how you \n                         got here. I just took the shots (As \n                         he speaks, a quick flashback of Adam \n                         taking a picture, going up apartment \n                         stairs, then in the darkroom) and went \n                         straight home to develop the. Next thing \n                         I know I\u0092m chained to a pipe in some \n                         prehistoric bathroom, staring at the \n                         guy I\u0092ve been taking shots of all night.\n \n                         \n                                     LAWRENCE\n                         (seeing a major break in this mystery) \n                         Clearly, whoever paid you to take the \n                         pictures of me is the one who put is \n                         in here.\n \n                                     ADAM\n                         (they don\u0092t know that for sure) Maybe.\n \n                         \n                                     LAWRENCE\n                         Maybe? What do you mean maybe? Of course \n                         it is! What did he look like?\n \n                                     ADAM\n                         (internal shrug) I don\u0092t know, he was \n                         just a guy. (Shot of inside Adam\u0092s apartment \n                         and an unidentifiable figure towards \n                         the back of the room, the image darkened \n                         so we can\u0092t make him out. The figure \n                         slowly takes a step towards us/Adam)\n \n                         \n                                     LAWRENCE\n                         Was he tall, was he skinny, obese, what?\n \n                         \n                                     ADAM\n                         I don\u0092t take notes about his appearance. \n                         (Shot inside apartment, the figure moves \n                         closer)\n \n                                     LAWRENCE\n                         (aggravated, how can he not remember \n                         anything?) You must remember something \n                         about him.\n \n                                     ADAM\n                         I can\u0092t. (Shot of inside the apartment, \n                         the figure moves closer)\n \n                                     LAWRENCE\n                         You\u0092re telling me you don\u0092t remember \n                         a thing about the guy?\n \n                                     ADAM\n                         I told you, I- (inside apartment, the \n                         figure moves closer, just about close \n                         enough for identification)\n \n                                     LAWRENCE\n                         (enraged, throwing his hands up) Oh \n                         for fuck\u0092s sake! I give up!\n \n                                     ADAM\n                         (gives up his playing dumb tone, gives \n                         in due to irritation with Lawrence) \n                         He\u0092s a tall black guy, he\u0092s got a scar \n                         around his neck, okay? (Shot of inside \n                         the apartment, the figure moves into \n                         a viewable light; It is Tapp.)\n \n               Lawrence is leaning against the wall facing away from Adam. At \n               hearing Adam\u0092s description, he slowly moves back, turns around \n               to face Adam.\n \n                                     LAWRENCE\n                         Tapp! (shot of inside Adam\u0092s apartment, \n                         Tapp handing us/Adam money. Adam\u0092s/our \n                         hand reaches out and takes it quickly. \n                         Then, back to Lawrence) Detective Tapp!\n \n                         \n                                     ADAM\n                         Whoa, the guy who paid me to take these \n                         photos was not a cop.\n \n                                     LAWRENCE\n                         No, no, he was discharged from the police \n                         force. (Shot of Tapp at his desk with \n                         the Amanda video, looking at notes.) \n                         He broke down after his partner was \n                         killed (Tapp and Sing sitting next to \n                         each other in Lawrence\u0092s office), but \n                         that didn\u0092t stop him from harassing \n                         me. (Lawrence sitting in the car next \n                         to Tapp) The guy became obsessed. (Tapp \n                         in his current apartment adjusting the \n                         camera in the window, then a shot of \n                         him leaning over a notebook, going over \n                         notes.) He\u0092s convinced himself that \n                         I must have somehow been involved with \n                         the murders. He\u0092s...he\u0092s crazy. (Tapp \n                         at the corner desk in his apartment, \n                         giving a crazy-sounding Heh heh heh \n                         laugh. The shot cuts back to Lawrence, \n                         who points accusingly at Adam.) And \n                         you helped him. (disgusted) You took \n                         money from him to invade my privacy. \n                         How could you do that?\n \n                                     ADAM\n                         (bite me tone) Call it my need to eat.\n \n                         \n                                     LAWRENCE\n                         (sarcastic) Right, right. You know what \n                         Adam? You\u0092re not a victim of this game, \n                         you\u0092re a part of it. (Points accusingly \n                         at him as he says this.)\n \n                                     ADAM\n                         Oh really? Obviously this cop thinks \n                         you\u0092re the one behind it all.\n \n                                     LAWRENCE\n                         (Facing into the corner of his cell, \n                         turning around slightly, internal eye \n                         roll.) I told you, he\u0092s not a cop. He\u0092s \n                         a bottom feeder, just like you. (A slight \n                         sneer from Lawrence at Adam. Lawrence \n                         turns back into his corner)\n \n                                     ADAM\n                         (getting REALLY pissed at Lawrence\u0092s \n                         attitude towards him) What are you more \n                         pissed off about? The fact that I took \n                         some shots of you or the fact that I \n                         took some shots of you while you were \n                         cheating on your wife?\n \n               Lawrence spins out of his corner, screaming in rage.\n\n                                     LAWRENCE\n                         I did not cheat on her!!!\n\n                                     ADAM\n                         What do you care what I think anyway? \n                         I don\u0092t give a crap if you covered yourself \n                         in peanut butter and had a 15-hooker \n                         gang bang!\n \n               A pause, then Lawrence collapses onto the floor. He\u0092s lost the \n               last of any strength, level headedness or control he had before.\n \n               \n                                     LAWRENCE\n                         (weakly) How did I get here? (Adam sits \n                         down on the pipe in his corner, leaning \n                         forward a bit.) I had...I had everything \n                         in order. (he lays down on his side, \n                         facing Adam, who watches him with sympathy) \n                         My whole life was in perfect order. \n                         (He holds up and looks at the picture \n                         of Alison and Diana gagged.)\n \n               Cut to the Gordons\u0092 Bedroom. Zep puts Alison\u0092s gag back on her, \n               then leaves the room. Alison moves her head around to loosen \n               the gag then spits it out. She tries to fight her sobs as she \n               speaks softly to Diana.\n \n                                     ALISON\n                         Sweetheart, are you okay? (Diana shakes \n                         her head no) Mommy just needs you to \n                         be really, really, really strong right \n                         now. I\u0092m not gonna let anybody hurt \n                         you. You got that? (Diana nods) Okay, \n                         that\u0092s my good girl. (She starts crying \n                         as her hands work behind her to loosen \n                         the rope around them.)\n \n               Cut back to Adam in the bathroom, looking up slightly from his \n               position. He glances back down at the photographs on the floor, \n               notices something odd about one of them. He furrows his brow \n               and gets down on his hands and knees, reaching over and picking \n               it up, leaning back and looking at it, studying it. Camera cuts \n               to a shot of Lawrence through the black and white surveillance \n               camera, sitting on the floor. Adam\u0092s next line is a voice over \n               over this shot.\n \n                                     ADAM\n                         Hey, was there someone else at your \n                         house last night besides your wife and \n                         daughter?\n \n                                     LAWRENCE\n                         (on camera) No.\n\n                                     ADAM\n                         (still on camera) Well, there\u0092s someone \n                         here. (He tosses the photo to Lawrence, \n                         whosits up, picks it up and looks at \n                         it. After a moment, the shot cuts back \n                         to a regular view of them, in the room.)\n \n                         \n                                     LAWRENCE\n                         (realization) I know him. (We see the \n                         photo as well. It is a shot looking \n                         up into Lawrence\u0092s window, with Zep \n                         standing there, looking out, completely \n                         unaware of his picture being taken.) \n                         Zep! (Cut to a shot of Zep listening. \n                         The shot goes back and forth between \n                         him as his eyes widen while Lawrence \n                         makes his threats.) His name is Zep. \n                         He\u0092s an orderly at my hospital. (his \n                         voice becomes a growl, furious) Zep. \n                         You perverted little psychopath. I\u0092m \n                         gonna take great pleasure in seeing \n                         you pay for this! You bastard fuck!\n \n                         \n               Suddenly the shot cuts to Adam, who looks up at the clock with \n               a very worried look. He points up to it.\n \n                                     ADAM\n                         Look. (Lawrence momentarily breaks from \n                         his Zep rage, looks up. The clock reads \n                         at 6:00.) We\u0092re out of time.\n \n                                     DIANA\n                         (crying) Mommy help me!\n\n               Alison continues to untie her. Cut to Zep, getting up from his \n               chair, turning to go into the bedroom. Alison hears him moving \n               near, sees his form through the frosted glass doors. She quickly \n               replaces Diana\u0092s gag and then her own, and resumes her position \n               with her hands behind her back just as the doors open and Zep \n               steps into the room. He looks down at them, raises his eyebrows \n               slightly. He seems to have gotten himself together, ready to \n               just do what has to be done. He takes the gun from his belt and \n               leans down next to Alison. He looks at her with wide eyes, shakes \n               his head sadly. He speaks calmly.\n \n                                     ZEP\n                         Dr. Gordon\u0092s time is up. Now I\u0092ve gotta \n                         do what I\u0092ve gotta do, and...I\u0092m afraid \n                         it has to be you that tells him he failed. \n                         (He undoes her gag, holds the phone \n                         to her head and his gun in front of \n                         her chest.)\n \n               Quick cut to the bathroom, where Lawrence is still looking at \n               the slightly crumpled picture of Zep in the window. The phone \n               rings, startling them both. Lawrence quickly answers it.\n \n                                     LAWRENCE\n                         (speaking quickly, the growling voice) \n                         Is that you Zep, you bastard!? (Adam \n                         gets up from his corner, moves forward \n                         slightly) I know its you, you son of \n                         a bitch!\n \n                                     ALISON\n                         Larry?\n\n                                     LAWRENCE\n                         (his eyes widen, his fierce tone replaced \n                         with worry) Ally?\n \n               Cut into the bedroom.\n\n                                     ALISON\n                         (looking right at Zep, firmly) You failed.\n \n                         \n               Quickly, she grabs Zep\u0092s gun and pushes him hard over to her \n               left. He is taken by surprise and goes down easily.\n \n                                     LAWRENCE\n                         (who can only hear the sound of a struggle) \n                         Hello? Hello?\n \n               Alison rips the gun right from his hand, quickly backs up an \n               stands. She keeps the gun aimed right at Zep. He sits up slightly, \n               trying to slowly get up, but she keeps the gun fiercely aimed \n               at him, keeping him there. His eyes are wide, likely his one \n               thought right now is Fuck.\n \n                                     ALISON\n                         Don\u0092t move, stay on the ground. Give \n                         me the phone. Give it to me! (He sits \n                         up a bit, carefully slides it to her. \n                         He is watching her, looking for an opportunity \n                         to overcome her once again. She picks \n                         the phone up, still keeping her eyes \n                         and her gun at him.) Larry?\n \n                                     LAWRENCE\n                         Ally! Honey, are you all right?\n\n                                     ALISON\n                         No! No we\u0092re not...(Zep starts to move \n                         up a bit more, his right hand out, leaning \n                         against the edge of the bed. Ally threatens \n                         him more fiercely with the gun.) Get \n                         down! Larry, where are you?\n \n                                     LAWRENCE\n                         (unsure himself) I don\u0092t know. I\u0092m being \n                         held captive in a room somewhere.\n \n                         \n                                     ALISON\n                         (disbelief; she sniffles a bit) What? \n                         What are you talking about?\n \n                                     LAWRENCE\n                         (starting to cry) I\u0092m so sorry, Ally.\n \n                         \n                                     ALISON\n                         (desperate) Honey, we need you here. \n                         (Zep slowly readies himself to move \n                         forward, wide eyes still staring at \n                         Alison.)\n \n                                     LAWRENCE\n                         (crying, apologizing) I\u0092m sorry for \n                         everything. It\u0092s my fault. Please forgive \n                         me. I\u0092ve always been happy with you.\n \n                         \n                                     DIANA\n                         (cries out) Mommy!\n\n               Alison turns to look at Diana when she calls her, and Zep seizes \n               the moment. He leaps up and grabs the gun from her hand, and \n               they start struggling with it. Diana starts screaming. Lawrence, \n               on his end, hears the screaming and sounds of a struggle. In \n               wrestling for the gun a shot is let off, and Diana continues \n               to scream.\n \n                                     LAWRENCE\n                         (panicked) Ally!\n\n               Cut to a shot of static on Tapp\u0092s TV set, then Tapp waking up \n               to the sound of gunfire. He quickly looks over to the window.\n \n               \n               Back to Zep and Alison, who are still fighting for the gun. Zep \n               manages to spin her around and into a leaning forward position, \n               but she still holds on tight. Another shot goes off. Cut to a \n               shot of Tapp, who hears it, then looks at the TV. He sees the \n               flash from the window on the television. He picks up his handgun \n               and loads it quickly, gets up and heads out. Back in the apartment, \n               we see Diana cowering, still tied, holding her teddy bear. Zep \n               gets behind Diana, tries to grab her but she keeps her arms and \n               the gun upwards. Another shot is fired off.\n \n                                     LAWRENCE\n                         (screams) Ally! (Adam watches him with \n                         wide eyes.)\n \n               The shot cuts back into the bedroom.\n\n                                     DIANA\n                         Mommy, help me!\n\n               The struggle moves over and into the dresser. Zep gets the gun \n               in his right hand and wraps his left arm around Alison, who quickly \n               pulls open and takes out of the top drawer a pair of scissors. \n               She spins around and with a scream stabs Zep in his left leg. \n               He screams in pain and goes down, falling onto his side, clutching \n               his leg by a wooden column, moaning in pain. Alison quickly goes \n               over and finishes untying Diana. Cut to the Main Hall of the \n               residence, where we see Tapp enter and move down the hall with \n               his gun ready. He moves cautiously but quickly. He sees Zep on \n               the floor squirming around and aims at him, screaming.\n \n                                     TAPP\n                         Freeze!\n\n               Zep turns and sees him, fires a shot in his direction but doesn\u0092t \n               hit. Tapp fires back and skims the top of Zep\u0092s head. Zep clutches \n               the surface wound, fires back. Cut back to Lawrence on the phone, \n               hearing only his daughter screaming and gunshots. He sobs, collapsing \n               forward onto the floor, crying out Oh no. Adam watches him, can \n               only imagine what he\u0092s hearing.\n \n               Back to the bedroom, Tapp stands next to another wooden column \n               and fires at Zep again, missing. Alison finishes untying Diana \n               and the book from the room. Zep fires at Tapp again and misses. \n               Tapp fires back, but his gun jams. Zep sees Alison and Diana \n               run from the room, and his attention goes to them once more.\n \n               \n                                     TAPP\n                         (trying to fix his gun) What the fuck?\n \n                         \n               Zep gets up off the floor more, but just then Tapp gives up on \n               his gun and charges at Zep, screaming. He tackles Zep, knocking \n               him flat on his back. Zep pushes his way up but Tapp grabs him \n               from behind, pulling him towards him. Cut back to Lawrence, still \n               on the floor, sobbing with the phone clutched in his hand.\n \n               \n               Back to Tapp and Zep, who get up to their feet. Zep grabs a vase \n               on the floor and turns, smashing it over Tapp\u0092s head. The blow \n               stuns Tapp and sends him down. Zep kneels down and picks up his \n               gun, then gets back up and starts hobbling after Alison and Diana. \n               He reaches the living room, but they are no where to be seen.\n \n               \n                                     ZEP\n                         Mrs. Gordon? (drops old cartridge out \n                         of his gun, pops in a new one) Diana?! \n                         (His breathing is fast, desperate. He \n                         clutches the wound on his leg.) I\u0092m \n                         gonna kill your husband now, Mrs. Gordon. \n                         (He stands up a bit straighter and hobbles \n                         over to the computer station, taking \n                         keys from the desk and then hobbling \n                         down the hall and out the door. We see \n                         Tapp groaning, starting to get up. Zep \n                         glances over and sees Tapp get to his \n                         feet, but quickly hobbles to the doorway \n                         and out the door. Tapp starts to follow, \n                         just a we bit dazed from the hit. He \n                         empties his gun cartridge and replaces \n                         it, then runs towards the door, screaming.\n \n                         \n               Back to Lawrence crying on the floor of the bathroom. He\u0092s just \n               a complete wreck, making low moaning sounds. Suddenly, there \n               is a loud buzzing sound his body is jerked up and he is flung \n               onto his back as he is electrocuted. Adam\u0092s eyes widen and he \n               starts to panic.\n \n                                     ADAM\n                         Lawrence! (A bit of foamy spittle comes \n                         out of Lawrence\u0092s mouth as the electrocution \n                         continues, and then a moment later stops. \n                         Adam watches, frightened, unsure. Lawrence \n                         is out.) Lawrence, get up!\n \n                                     CUT TO\n                         Car Chase! Zep is in the lead, with \n                         Tapp in hot pursuit behind him. They \n                         race through the streets as fast as \n                         they can.\n \n               Cut back to the bathroom. Adam looks around him, not sure what \n               to do, panicking. Lawrence can\u0092t be dead, he can\u0092t be alone in \n               here. He can\u0092t handle this alone. He needs his calm, collected \n               Doctor, no matter how badly Lawrence has treated him.\n \n                                     ADAM\n                         (crying out, close to tears) Lawrence! \n                         Get up! I need you! (He leans down and \n                         finds a piece of debris on the floor, \n                         throws it at Lawrence. It doesn\u0092t hit \n                         him. He leans down, picks up another, \n                         throws it. This one bounces onto the \n                         floor but ricochets and hits Lawrence, \n                         who begins to stir. A moment, and Lawrence \n                         starts to move more, reaching for his \n                         head and sitting up. Adam cries out \n                         in relief.) Oh, thank God! I thought \n                         you were dead!\n \n                                     LAWRENCE\n                         (sits up, dazed and confused) He...he \n                         electrocuted me...\n \n                                     ADAM\n                         I told you! The same thing happened \n                         to me, see? I wasn\u0092t lying, see?\n \n               Lawrence leans over and grabs his chain, the source of the electrocution. \n               Suddenly, he snaps.\n \n                                     LAWRENCE\n                         (screaming) FUCK THIS SHIT!!\n\n               Back in the bathroom, Lawrence continues to grunt and struggle \n               with his chain. Suddenly the phone rings and he turns. He quickly \n               moves to get it, but it is out of reach. He lays flat on the \n               floor, just a foot away from it, trying desperately to grab it.\n \n               \n               In the hallway, Tapp enters, keeping his gun aimed out in front \n               of him. He looks down the hallway, sees nothing. Cut to Zep climbing \n               down a ladder into another level, grunting in pain. Tapp hears \n               him and follows the sound down the hall.\n \n               In the bathroom, the phone keeps ringing. Lawrence grabs the \n               hinged box, turns it upside down and tries to catch the phone \n               with it. He cannot reach, and starts to cry loudly again. He \n               tosses the box away, crying/screaming as he tries to reach the \n               box with his arms. Adam watches with a terrified look, not knowing \n               what to do.\n \n               Zep reaches the bottom of the ladder, leaning against it, moaning \n               from the pain of his leg. He hears Tapp above him, hobbles off \n               further down the hallway. Tapp climbs down the ladder, moving \n               in the same direction as Zep. As Tapp can move faster than Zep, \n               he rounds the corner and catches Zep hobbling down the hallway. \n               Zep turns and sees him, firing a few shots but missing. Tapp \n               ducks behind a large stone column jutting out of the wall. He \n               leans out and fires at Zep. Zep falls back slightly but remains \n               standing. If he got hit, it isn\u0092t clear where. Zep then turns \n               and quickly hobbles further down the hall.\n \n               Cut back to Lawrence still crying and trying to get the phone \n               as it keeps ringing.\n \n                                     LAWRENCE\n                         No!!!! (He lowers his head and cries \n                         loudly.)\n \n                                     ADAM\n                         (Frightened but trying to stay calm \n                         for Lawrence.) Lawrence, calm down. \n                         There must be a way out of this! (It \n                         seems to be a complete role reversal \n                         for the two of them from the beginning, \n                         where Adam was the one freaking out \n                         and Lawrence was calm. Here, Adam is \n                         terrified but still calmer than Lawrence, \n                         who has just lost it.)\n \n                                     LAWRENCE\n                         (screaming) I can\u0092t be calm! My family \n                         needs me! No, God! (He cries and screams, \n                         still can\u0092t get the phone. He quickly \n                         turns and sits up, grabbing the chain \n                         and pulling it as he lets out a terrible \n                         scream of rage. Adam\u0092s hands are up \n                         clutching his head, trying to keep his \n                         cool but having a very hard time.)\n \n                         \n                                     ADAM\n                         (Loudly trying to speak over Lawrence\u0092s \n                         continued loud, primal screams.) Lawrence, \n                         I have a family too! I don\u0092t see them, \n                         that\u0092s my mistake. It\u0092s a mistake I\u0092d \n                         like to fix!\n \n               Cut to Zep hobbling down the hall. Tapp is there running after \n               him. Zep turns a corner, and Tapp runs to try to keep up.\n \n                                     TAPP\n                         I\u0092m gonna kill you you sick asshole!\n \n                         \n               Back in the bathroom, Lawrence continues to freak out as he mentally \n               breaks down, clutching the chain and screaming more.\n \n                                     ADAM\n                         (desperate, losing his attempted calm \n                         stance) Lawrence, stop it!\n \n               Lawrence sits up, stops pulling at his chain but continues screaming. \n               He starts to unbutton his blue button-down shirt. That is too \n               slow, however, so he starts to rip it open.\n \n                                     ADAM\n                         (sobs in his voice) Lawrence, please \n                         calm down! There\u0092s a way out of here, \n                         there\u0092s a way out!\n \n               Lawrence gets his shirt off, down to a plain white tee shirt \n               underneath. He starts to wrap one end around his manacled foot \n               and ties it off. Adam realizes what he is preparing to do, completely \n               loses it and freaks out, screaming.\n \n                                     ADAM\n                         Lawrence! No! Oh my God! What are you \n                         doing?!\n \n               Lawrence holds the other end of the shirt in his mouth, biting \n               it for a brace. The look in his eyes is one of complete madness \n               and desperation. He takes up the hacksaw in his right hand, puts \n               it against his ankle and starts to saw into his foot while Adam \n               begins to scream in complete horror. Lawrence screams through \n               the cloth between his teeth. The blood squirts up onto Lawrence\u0092s \n               shirt and neck. Adam collapses to the floor in his corner, screaming \n               and wincing.\n \n               Back to Zep rounding another corner in the hallway. He moves \n               into an old break room and Tapp runs in after him, finally catching \n               up. Tapp tackles him, tripping him backwards and causing Zep \n               to hit his head against and old mini-refrigerator. Tapp grabs \n               him and brings him up, throwing him hard against the stone wall. \n               Zep falls down to his side. Tapp grabs him up and throws him \n               forward against a cage wall.\n \n               Back to Lawrence, still sawing away, blood on his face, neck \n               and shirt.\n \n               Back to Tapp pummeling Zep from behind in the back. A look of \n               twisted glee is upon Tapp\u0092s face as he hits Zep. Zep falls to \n               the floor, gun beside him. He looks like he just wants to curl \n               up and die. Tapp goes down for the gun but Zep reacts, grabbing \n               it. Tapp grabs his hand, and Zep pushes himself up into a standing \n               position, the wall in front of him, Tapp pushing up behind him, \n               trying to take the gun.\n \n               Back in the bathroom, Adam is on his hands and knees, screaming \n               and crying as he begs Lawrence to stop. Lawrence does stop, sits \n               up and tosses the saw of to the side. Adam collapses forward \n               a bit.\n \n               Back to Zep and Tapp, who continue struggling from the gun. Zep \n               squeezes his way down, groaning as he suddenly drops down between \n               Tapp and the wall, his gun aimed up at Tapp. He pulls the trigger \n               and the shot hits Tapp in the chest, a loud surprise to the former \n               detective.\n \n               Back in the bathroom, Lawrence crawls along the floor, moaning. \n               He finds and picks up the single bullet from his envelope, looks \n               at it. Adam watches him in terror.\n \n                                     ADAM\n                         (screaming/crying) What are you doing?! \n                         (Lawrence crawls on farther, towards \n                         the body.)\n \n               Cut back to a close up of the bloody hole in Tapp\u0092s chest. Tapp \n               remains standing a moment, in shock, gasping, then falls down \n               backwards onto the floor. Zep is still on his knees, holding \n               the gun up at a diagonal. Tapp\u0092s eyes flutter, then finally close. \n               Zep turns and gets up, limping in pain out of the room and down \n               another hall.\n \n               Back in the bathroom, Lawrence reaches the body. He takes the \n               gun, opens the chamber.\n \n                                     ADAM\n                         What are you...(He suddenly realizes \n                         Lawrence\u0092s intentions. His eyes go wide, \n                         and he starts to cry out and beg.)\n \n                         \n                                     ADAM\n                         Oh my God! Oh my God! Lawrence don\u0092t! \n                         (Lawrence puts the bullet in, then closes \n                         the chamber) No! Lawrence, please, I\u0092m \n                         begging you! (Lawrence aims the gun \n                         at Adam) Lawrence, it\u0092s not me who did \n                         this to you!\n \n                                     LAWRENCE\n                         (looking like Death, his voice hoarse) \n                         You have to die.\n \n                                     ADAM\n                         (His hands up in front of him defensively, \n                         moving side to side to try to throw \n                         off Lawrence\u0092s aim) No, I want to live!\n \n                         \n                                     LAWRENCE\n                         (moving the gun along with Adam\u0092s movements) \n                         I\u0092m sorry...\n \n                                     ADAM\n                         I want to live!\n\n                                     LAWRENCE\n                         My family...(he aims and pulls the trigger, \n                         hitting Adam in the upper chest area. \n                         Adam falls down forward onto the floor, \n                         his screams stop.)\n \n               Lawrence collapses, sobbing. Then he sits up a bit, turning to \n               the surveillance camera and screaming.\n \n                                     LAWRENCE\n                         I\u0092ve done it! Now show them to me! (he \n                         continues to cry, dropping the gun next \n                         to him, collapsing back down with his \n                         forehead to the floor.)\n \n               Cut to the Gordon\u0092s neighbors\u0092 living room. Alison paces back \n               and forth, holding a cell phone to her ear. Two neighbors sit \n               off to the side on a couch with Diana.\n \n                                     NEIGHBOR\n                         (OS, on phone) Thank you very much, \n                         Officer.\n \n                                     ALISON\n                         (on cell phone) Larry?\n\n                                     NEIGHBOR\n                         (hanging up the phone and going over \n                         to Alison) Did you get through to him?\n \n                         \n                                     ALISON\n                         There\u0092s still no answer.\n\n                                     NEIGHBOR\n                         (reassuringly) It\u0092s all right. I\u0092ve \n                         called the police. Everything\u0092s okay.\n \n                         \n               Alison goes and sits on the couch. Diana comes up to her, and \n               Alison embraces her daughter.\n \n               Cut back to the bathroom, with a shot of the sliding door. The \n               sound of a lock being undone and a bang is heard. Lawrence pushes \n               himself up into a kneeling position, a look of shock on his face. \n               The door slides open and there stands Zep, green mist behind \n               him in the hallway. Lawrence turns and sees him. Zep\u0092s eyes dart \n               around the room, seeming to say What the fuck happened in here? \n               He sees Lawrence on the floor, and an eager look comes into his \n               eyes. He walks in, and Lawrence starts to yell at him.\n \n                                     LAWRENCE\n                         You bastard! I\u0092ll fucking kill you! \n                         (Lawrence grabs Zep\u0092s leg as he passes \n                         but is too weak and Zep pulls away, \n                         looking down at him, moving over to \n                         the other side of the body) I\u0092ll fucking \n                         kill you! You fucking bastard! (Lawrence \n                         quickly cralws forwarrd and takes up \n                         the gun, pulling the trigger several \n                         times, but there are no more bullets. \n                         It just clicks.) I\u0092ll fucking kill you! \n                         You fucking bastard! I\u0092ll fucking kill \n                         you! I\u0092ll fucking kill you!\n \n               Zep goes over to Adam, pushing his side with his foot a couple \n               of times, but to no reaction. He then looks to Lawrence and aims \n               his gun at him, shaking his head.\n \n                                     ZEP\n                         You\u0092re too late.\n\n                                     LAWRENCE\n                         (weakly) Why?\n\n                                     ZEP\n                         It\u0092s the rules.\n\n               Zep is about to pull the trigger when suddenly Adam comes to \n               and grabs his ankle, pulling him down. The back of Zep\u0092s head \n               hits the floor hard. Adam pulls him towards him, struggles to \n               get the gun from Zep\u0092s hand, screaming. The gun goes off once \n               off to the side. Adam moves Zep\u0092s arm back and forth, and it \n               goes off again. Finally, Adam slams Zep\u0092s arm down and gets the \n               gun away from him, tossing it away. He slugs Zep hard across \n               the face, stunning him. Lawrence starts crawling towards them. \n               Screaming like a madman, Adam sits up and grabs the toilet seat \n               lid from the toilet, and slams it down onto Zep\u0092s head as hard \n               as he can. He repeats this seven times before the lid snaps in \n               half. Lawrence reaches the two and reaches up for Adam\u0092s arm \n               as Adam brings the broken lid down again. Lawrence grabs his \n               arm and Adam drops the lid, falling forward a bit and clutching \n               his shoulder wound with his free hand, crying hard. Lawrence \n               moves in, touching his head to Adam\u0092s.\n \n                                     LAWRENCE\n                         (his voice very weak and shaky) You\u0092re \n                         going to be all right. (Adam stops sobbing \n                         for a moment) You\u0092re just wounded in \n                         the shoulder. I have to go and get help.\n \n                         \n                                     ADAM\n                         (grasping Lawrence\u0092s shirt, begging.) \n                         Don\u0092t leave me! No!\n \n               Lawrence nods, pulling away from him and starts to crawl off. \n               Adam reaches for him as he turns himself around and away.\n \n                                     ADAM\n                         No!! (he keeps crying) No! No! (Lawrence \n                         crawls towards the door.) Lawrence! \n                         Lawrence!\n \n                                     LAWRENCE\n                         (he pauses, turns to look back at Adam) \n                         Don\u0092t...Don\u0092t worry, I\u0092ll bring someone \n                         back, I promise. (He continues crawling \n                         on, out the door while Adam watches \n                         him pathetically, still crying and reaching \n                         out for him.)\n \n               Lawrence makes it out the door, and starts dragging himself down \n               the hall. Adam is now alone in the room with two corpses. Adam \n               looks to the door one more time then turns to Zep\u0092s body. He \n               pulls himself on top of him, wincing at his shoulder pain.\n \n               \n                                     ADAM\n                         (thinking) Key...key...\n\n               He starts going through Zep\u0092s pockets, patting him down. He finds \n               Zep\u0092s wallet, opens it and feels through it; there\u0092 s nothing \n               of value to him right now. He tosses it down. He continues feeling \n               for something, suddenly feels something in Zerp\u0092s coat pocket. \n               His eyes widen as he reaches in, wincing from the pain in his \n               shoulder. He pulls out a tape recorder. He stares at it, his \n               eyes and mouth starting to widen. He glances down at Zep, then \n               at the tape recorder. Sitting up a bit more, he presses play. \n               It is Jigsaw\u0092s voice.\n \n                                     JIGSAW\n                         (VO) Hello Mr. Hindle. Or as they called \n                         you around the hospital: (shot of Zep \n                         in the hospital with his cleaning cart, \n                         stopping at John\u0092s room) Zep. I want \n                         you to make a choice. (Shot of the closet \n                         doors in Diana\u0092s room flying open, Diana \n                         screaming, Alison coming in and seeing \n                         him looming over her. Shot of him tying \n                         and gagging Alison and Diana. Shot of \n                         the photo of Diana and Alison tied and \n                         gagged.) There\u0092s a slow-acting poison \n                         coursing through your system (shot of \n                         Zep watching the monitor, holding his \n                         hand to his mouth. He actually looks \n                         rather ill) which only I have the antidote \n                         for. Will you murder and mother and \n                         her child (Zep rocking aback and forth, \n                         getting ready to kill Alison and Diana) \n                         to save yourself? (Shot of Zep next \n                         to Alison, saying Dr. Gordon\u0092s time \n                         is up; holds the phone to her ear. Shot \n                         of Zep in the living room, screaming \n                         Mrs. Gordon! Shot of Zep on the floor \n                         firing up at Tapp.) Listen carefully, \n                         if you will. There are rules. (Lawrence \n                         on the floor looking up at Zep, asks \n                         Why? to which Zep says It\u0092s the rules.)\n \n                         \n                                     JOHN\n                         The key to that chain is in the bathtub.\n \n                         \n                                     FLASHBACK MONTAGE\n                         \n               Zep\u0092s voiceover of He\u0092s a very interesting person, with a shot \n               of John in his hospital bed with Dr. Gordon and the med students. \n               His name is John. Shot of Lawrence pointing at the chart, He \n               has an inoperable frontal lobe tumor. Close up shot of John in \n               his bed, eyes flickering open slightly.\n \n               Shot of Tapp in the workshop, holding a gun to John\u0092s head. Sick \n               from the disease eating away at me inside. Shot of the detectives \n               at Paul\u0092s cage, shot of the jigsaw puzzle piece wound on Paul, \n               Kerry saying Sounds like our friend Jigsaw.\n \n                                     JOHN\u0092S VOICE\n                         Sick of people who don\u0092t appreciate \n                         their blessings. Shot of Lawrence with \n                         Diana, checking his beeper, on his computer \n                         ignoring Diana and Alison, trying to \n                         kiss Alison as she pulls away.\n \n               Frontal shot of John in his robe in the workshop with the detectives, \n               his arms raised, his face clearly visible. Cut to Kerry at the \n               peephole in Mark\u0092s room, saying Looks like he likes to book himself \n               a front row seat to his own sick little games, with overlapping \n               footage of John on the floor in the bathroom, eyes open slightly, \n               then a shot of the pig creature crawling out of Lawrence\u0092s car.\n \n               \n                                     JOHN\n                         (VO) Hello Mark, Paul, Amanda, Zep, \n                         Adam, Dr. Gordon. (As he says each name, \n                         the following image of them appears: \n                         A shot of Mark screaming with the safe, \n                         Paul in his cage while still alive, \n                         Amanda in her mask in the chair, Zep \n                         watching on the monitor, Adam holding \n                         the tape recorder to his ear, Lawrence \n                         holding the tape recorder to his ear. \n                         Then, a shot of the Puppet on the video \n                         as he says) I want to play a game.\n \n                         \n               Back to the shot of Adam staring at him, shocked. Suddenly, Adam \n               looks down, grabs Zep\u0092s gun and aims for John. But before he \n               can pull the trigger John holds out the remote for the electricity \n               and starts to electrocute Adam, who starts jerking around and \n               drops the gun. As he spasms, a very, very fast montage of images \n               from the entire film from beginning to the end, starting with \n               a shot of Adam being electrocuted after his fake death, then \n               Lawrence, then going back to the beginning, all the way up and \n               ending with Adam stretched out on top of Zep, spasming still \n               from the electrocution. Suddenly the electricity stops and he \n               gasps, raspy loud breathing. John turns away, starts towards \n               the door. Adam can only watch after him.\n \n                                     JOHN\n                         (VO) Most people are so ungrateful to \n                         be alive. (John turns off the lights \n                         at the door, only the green lighting \n                         from the hallway illuminating him and \n                         then Adam just barely. John moves out \n                         the door, slowly.) But not you. (Adam \n                         reaches out for him and screams. John \n                         turns around and takes the door handle, \n                         starting to slide it shut.) Not anymore.\n \n                         \n               Adam SCREAMS as loud as he can in terror and despair as John \n               pauses for a moment with the door halfway shut, and says\n \n                                     JOHN\n                         GAME OVER.\n\n               John slams the door shut the rest of the way, and we are left \n               in darkness with the sound of Adam screaming No! Don\u0092t!!! over \n               and over and crying. The screams fade out, and is replaced by \n               the ending titles and instrumental music.\n \n               THE END\n\n               \n               \n\n\n\n\nSaw\nWriters :   James Wan  Leigh Whannell\nGenres :   Crime  Horror  Mystery  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:34:36.996844"}