{"title": "Seventh Seal, The", "film_link": "/Movie Scripts/Seventh Seal, The Script.html", "script_link": "/scripts/Seventh-Seal,-The.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Seventh Seal, The Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Seventh Seal, The Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Ingmar Bergman\" title=\"Scripts by Ingmar Bergman\">Ingmar Bergman</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/><br/>\n<br/>\n<a href=\"/scripts/Seventh-Seal,-The.html\">Read \"Seventh Seal, The\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>The Seventh Seal\n<b> \n</b>The night had brought little relief from the heat, and at dawn a hot gust of\nwind blows across the colorless sea. The KNIGHT, Antonius Block, lies\nprostrate on some spruce branches spread over the fine sand. His eyes are \nwide-open and bloodshot from lack of sleep. \n\nNearby his squire JONS is snoring loudly. He has fallen asleep where he \ncollapsed, at the edge of the forest among the wind-gnarled fir trees. His \nopen mouth gapes towards the dawn, and unearthly sounds come from his throat.\nAt the sudden gust of wind, the horses stir, stretching their parched muzzles \ntowards the sea. They are as thin and worn as their masters.\n\nThe KNIGHT has risen and waded into the shallow water, where he rinses his \nsunburned face and blistered lips. JONS rolls over to face the forest and the \ndarkness. He moans in his sleep and vigorously scratches the stubbled hair on \nhis head. A scar stretches diagonally across his scalp, as white as lightning \nagainst the grime. \n\nThe KNIGHT returns to the beach and falls on his knees. With his eyes closed \nand brow furrowed, he says his morning prayers. His hands are clenched \ntogether and his lips form the words silently. His face is sad and bitter. He \nopens his eyes and stares directly into the morning sun which wallows up from \nthe misty sea like some bloated, dying fish. The sky is gray and immobile, a \ndome of lead. A cloud hangs mute and dark over the western horizon. High up, \nbarely visible, a seagull floats on motionless wings. Its cry is weird and \nrestless. The KNIGHT'S large gray horse lifts its head and whinnies. Antonius \nBlock turns around.\n\nBehind him stands a man in black. His face is very pale and he keeps his \nhands hidden in the wide folds of his cloak. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tWho are you? \n\n<b>\t\t\t\tDEATH \n</b>\t\tI am Death.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tHave you come for me?\n\n<b>\t\t\t\tDEATH \n</b>\t\tI have been walking by your side for a long \n\t\ttime. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tThat I know. \n\n<b>\t\t\t\tDEATH \n</b>\t\tAre you prepared?\n\n<b>\t\t\t\tKNIGHT\n</b>\t\tMy body is frightened, but I am not. \n\n<b>\t\t\t\tDEATH \n</b>\t\tWell, there is no shame in that.\n\nThe KNIGHT has risen to his feet. He shivers. DEATH opens his cloak to place \nit around the KNIGHT'S shoulders. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tWait a moment.\n\n<b>\t\t\t\tDEATH \n</b>\t\tThat's what they all say. I grant no reprieves. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tYou play chess, don't you?\n\nA gleam of interest kindles in DEATH'S eyes. \n\n<b>\t\t\t\tDEATH \n</b>\t\tHow did you know that?\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI have seen it in paintings and heard it sung \n\t\tin ballads.\n\n<b>\t\t\t\tDEATH \n</b>\t\tYes, in fact I'm quite a good chess player. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tBut you can't be better than I am.\n\nThe KNIGHT rummages in the big black bag which he keeps beside him and takes \nout a small chessboard. He places it carefully on the ground and begins \nsetting up the pieces.\n\n<b>\t\t\t\tDEATH \n</b>\t\tWhy do you want to play chess with me? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI have my reasons. \n\n<b>\t\t\t\tDEATH \n</b>\t\tThat is your privilege.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tThe condition is that I may live as long as I \n\t\thold out against you. If I win, you will \n\t\trelease me. Is it agreed? \n\nThe KNIGHT holds out his two fists to DEATH, who smiles at him suddenly. \nDEATH points to one of the KNIGHT'S hands; it contains a black pawn. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tYou drew black!\n\n<b>\t\t\t\tDEATH \n</b>\t\tVery appropriate. Don't you think so?\n\nThe KNIGHT and DEATH bend over the chessboard. After a moment of hesitation, \nAntonius Block opens with his king's pawn. DEATH moves, also using his king's \npawn.\n<b> \n</b>\n\nThe morning breeze has died down. The restless movement of the sea has \nceased, the water is silent. The sun rises from the haze and its glow \nwhitens. The sea gull floats under the dark cloud, frozen in space. The day \nis already scorchingly hot.\n\nThe squire JONS is awakened by a kick in the rear. Opening his eyes, he \ngrunts like a pig and yawns broadly. He scrambles to his feet, saddles his \nhorse and picks up the heavy pack.\n\nThe KNIGHT slowly rides away from the sea, into the forest near the beach and \nup towards the road. He pretends not to hear the morning prayers of his \nsquire. JONS soon overtakes him.\n\n<b>\t\t\t\tJONS \n</b>\t\t\t(sings)\n\t \tBetween a strumpet's legs to lie \n\t\tIs the life for which I sigh.\n\nHe stops and looks at his master, but the KNIGHT hasn't heard JON'S song, or \nhe pretends that he hasn't. To give further vent to his irritation, JONS \nsings even louder. \n\n<b>\t\t\t\tJONS \n</b>\t\t\t(sings)\n\t\tUp above is God Almighty \n\t\tSo very far away, \n\t\tBut your brother the Devil \n\t\tYou will meet on every level.\n\nJONS finally gets the KNIGHT'S attention. He stops singing. The KNIGHT, his \nhorse, JONS'S own horse and JONS himself know all the songs by heart. The \nlong, dusty journey from the Holy Land hasn't made them any cleaner. They \nride across a mossy heath which stretches towards the horizon. Beyond it, the \nsea lies shimmering in the white glitter of the sun.\n\n<b>\t\t\t\tJONS \n</b>\t\tIn F\u0089rjestad everyone was talking about evil \n\t\tomens and other horrible things. Two horses had \n\t\teaten each other in the night, and, in the \n\t\tchurchyard, graves had been opened and the \n\t\tremains of corpses scattered all over the \n\t\tplace. Yesterday afternoon there were as many \n\t\tas four suns in the heavens.\n<b> \n</b>The KNIGHT doesn't answer. Close by, a scrawny dog is whining, crawling \ntowards its master, who is sleeping in a sitting position in the blazing hot \nsun. A black cloud of flies clusters around his head and shoulders. The \nmiserable-looking dog whines incessantly as it lies flat on its stomach, \nwagging its tail.\n\nJONS dismounts and approaches the sleeping man. JONS addresses him politely. \nWhen he doesn't receive an answer, he walks up to the man in order to shake \nhim awake. He bends over the sleeping man's shoulder, but quickly pulls back \nhis hand. The man falls backward on the heath, his face turned towards JONS. \nIt is a corpse, staring at JONS with empty eye sockets and white teeth. \n\nJONS remounts and overtakes his master. He takes a drink from his waterskin \nand hands the bag to the knight. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tWell, did he show you the way? \n\n<b>\t\t\t\tJONS \n</b>\t\tNot exactly.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tWhat did he say? \n\n<b>\t\t\t\tJONS \n</b>\t\tNothing.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tWas he a mute?\n\n<b>\t\t\t\tJONS \n</b>\t\tNo, sir, I wouldn't say that. As a matter of \n\t\tfact, he was quite eloquent. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tOh?\n\n<b>\t\t\t\tJONS \n</b>\t\tHe was eloquent, all right. The trouble is that \n\t\twhat he had to say was most depressing.\n\t\t\t(sings)\n\t\tOne moment you're bright and lively, \n\t\tThe next you're crawling with worms. \n\t\tFate is a terrible villain \n\t\tAnd you, my friend, its poor victim. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tMust you sing? \n\n<b>\t\t\t\tJONS \n</b>\t\tNo.\n\nThe KNIGHT hands his squire a piece of bread, which keeps him quiet for a \nwhile. The sun burns down on them cruelly, and beads of perspiration trickle \ndown their faces. There is a cloud of dust around the horses' hooves. They \nride past an inlet and along verdant groves. In the shade of some large trees \nstands a bulging wagon covered with a mottled canvas. A horse whinnies nearby \nand is answered by the KNIGHT'S horse. The two travelers do not stop to rest \nunder the shade of the trees but continue riding until they disappear at the \nbend of the road.\n<b> \n</b>\n\nIn his sleep, JOF the juggler hears the neighing of his horse and the answer \nfrom a distance. He tries to go on sleeping, but it is stifling inside the \nwagon. The rays of the sun filtering through the canvas cast streaks of light \nacross the face of JOF'S wife, MIA, and their one-year-old son, MIKAEL, who \nare sleeping deeply and peacefully. Near them, JONAS SKAT, an older man, \nsnores loudly. \n\nJOF crawls out of the wagon. There is still a spot of shade under the big \ntrees. He takes a drink of water, gargles, stretches and talks to his scrawny \nold horse. \n\n<b>\t\t\t\tJOF \n</b>\t\tGood morning. Have you had breakfast? I can't \n\t\teat grass, worse luck. Can't you teach me how? \n\t\tWe're a little hard up. People aren't very \n\t\tinterested in juggling in this part of the \n\t\tcountry.\n\nHe has picked up the juggling balls and slowly begins to toss them. Then he \nstands on his head and cackles like a hen. Suddenly he stops and sits down \nwith a look of utter astonishment on his face. The wind causes the trees to \nsway slightly. The leaves stir and there is a soft murmur. The flowers and \nthe grass bend gracefully, and somewhere a bird raises its voice in a long \nwarble.\n\nJOF'S face breaks into a smile and his eyes fill with tears. With a dazed \nexpression he sits flat on his behind while the grass rustles softly, and \nbees and butterflies hum around his head. The unseen bird continues to sing.\n\nSuddenly the breeze stops blowing, the bird stops singing, JOF'S smile fades, \nthe flowers and grass wilt in the heat. The old horse is still walking around \ngrazing and swishing its tail to ward off the flies. \n\nJOF comes to life. He rushes into the wagon and shakes MIA awake.\n\n<b>\t\t\t\tJOF \n</b>\t\tMia, wake up. Wake up! Mia, I've just seen \n\t\tsomething. I've got to tell you about it!\n\n<b>\t\t\t\tMIA \n</b>\t\t\t(sits up, terrified)\n\t\tWhat is it? What's happened? \n\n<b>\t\t\t\tJOF \n</b>\t\tListen, I've had a vision. No, it wasn't a \n\t\tvision. It was real, absolutely real.\n\n<b>\t\t\t\tMIA \n</b>\t\tOh, so you've had a vision again!\n\nMIA's voice is filled with gentle irony. JOF shakes his head and grabs her by \nthe shoulders. \n\n<b>\t\t\t\tJOF \n</b>\t\tBut I did see her! \n\n<b>\t\t\t\tMIA \n</b>\t\tWhom did you see? \n\n<b>\t\t\t\tJOF \n</b>\t\tThe Virgin Mary.\n\nMIA can't help being impressed by her husband's fervor. She lowers her voice.\n\n<b>\t\t\t\tMIA \n</b>\t\tDid you really see her?\n\n<b>\t\t\t\tJOF \n</b>\t\tShe was so close to me that I could have \n\t\ttouched her. She had a golden crown on her head \n\t\tand wore a blue gown with flowers of gold. She \n\t\twas barefoot and had small brown hands with \n\t\twhich she was holding the Child and teaching \n\t\tHim to walk. And then she saw me watching her \n\t\tand she smiled at me. My eyes filled with tears \n\t\tand when I wiped them away, she had disappeared. \n\t\tAnd everything became so still in the sky and \n\t\ton the earth. Can you understand ... \n\n<b>\t\t\t\tMIA \n</b>\t\tWhat an imagination you have.\n\n<b>\t\t\t\tJOF \n</b>\t\tYou don't believe me! But it was real, I tell \n\t\tyou, not the kind of reality you see every day, \n\t\tbut a different kind. \n\n<b>\t\t\t\tMIA\n</b>\t\tPerhaps it was the kind of reality you told us \n\t\tabout when you saw the Devil painting our wagon \n\t\twheels red, using his tail as a brush.\n\n<b>\t\t\t\tJOF \n</b>\t\t\t(embarrassed)\n\t\tWhy must you keep bringing that up? \n\n<b>\t\t\t\tMIA\n</b>\t\tAnd then you discovered that you had red paint \n\t\tunder your nails.\n\n<b>\t\t\t\tJOF \n</b>\t\tWell, perhaps that time I made it up. \n\t\t\t(eagerly)  \n\t\tI did it just so that you would believe in my \n\t\tother visions. The real ones. The ones that I \n\t\tdidn't make up. \n\n<b>\t\t\t\tMIA \n</b>\t\t\t(severely)\n\t\tYou have to keep your visions under control.\n\t\tOtherwise people will think that you're a \n\t\thalf-wit, which you're not. At least not yet -- \n\t\tas far as I know. But, come to think of it, I'm \n\t\tnot so sure about that.\n\n<b>\t\t\t\tJOF \n</b>\t\t\t(angry)\n\t\tI didn't ask to have visions. I can't help it \n\t\tif voices speak to me, if the Holy Virgin \n\t\tappears before me and angels and devils like my \n\t\tcompany.\n\n<b>\t\t\t\tSKAT \n</b>\t\t\t(sits up)\n\t\tHaven't I told you once and for all that I need \n\t\tmy morning's sleep! I have asked you politely, \n\t\tpleaded with you, but nothing works. So now I'm \n\t\ttelling you to shut up!\n\nHis eyes are popping with rage. He turns over and continues snoring where he \nleft off. MIA and JOF decide that it would be wisest to leave the wagon. They \nsit down on a crate. MIA has MIKAEL on her knees. He is naked and squirms \nvigorously. JOF sits close to his wife. Slumped over, he still looks dazed \nand astonished. A dry, hot wind blows from the sea.\n\n<b>\t\t\t\tMIA \n</b>\t\tIf we would only get some rain. Everything is \n\t\tburned to cinders. We won't have anything to \n\t\teat this winter. \n\n<b>\t\t\t\tJOF \n</b>\t\t\t(yawning)\n\t\tWe'll get by.\n\nHe says this smilingly, with a casual air. He stretches and laughs \ncontentedly.\n\n<b>\t\t\t\tMIA \n</b>\t\tI want Mikael to have a better life than ours. \n\n<b>\t\t\t\tJOF \n</b>\t\tMikael will grow up to be a great acrobat -- or \n\t\ta juggler who can do the one impossible trick. \n\n<b>\t\t\t\tMIA \n</b>\t\tWhat's that?\n\n<b>\t\t\t\tJOF \n</b>\t\tTo make one of the balls stand absolutely still\n\t\tin the air. \n\n<b>\t\t\t\tMIA \n</b>\t\tBut that's impossible.\n\n<b>\t\t\t\tJOF \n</b>\t\tImpossible for us -- but not for him. \n\n<b>\t\t\t\tMIA \n</b>\t\tYou're dreaming again.\n\nShe yawns. The sun, has made her a bit drowsy and she lies down on the grass.\nJOF does likewise and puts one arm around his wife's shoulders.\n\n<b>\t\t\t\tJOF \n</b>\t\tI've composed a song. I made it up during the \n\t\tnight when I couldn't sleep. Do you want to \n\t\thear it? \n\n<b>\t\t\t\tMIA \n</b>\t\tSing it. I'm very curious.\n<b> \n</b><b>\t\t\t\tJOF \n</b>\t\tI have to sit up first.\n\nHe sits with his legs crossed, makes a dramatic gesture with his arms and \nsings in a loud voice. \n\n<b>\t\t\t\tJOF \n</b>\t\t\t(sings)\n\t\tOn a lily branch a dove is perched \n\t\tAgainst the summer sky, \n\t\tShe sings a wondrous song of Christ \n\t\tAnd there's great joy on high.\n\nHe interrupts his singing in order to be complimented by his wife.\n\n<b>\t\t\t\tJOF \n</b>\t\tMia! Are you asleep? \n\n<b>\t\t\t\tMIA \n</b>\t\tIt's a lovely song. \n\n<b>\t\t\t\tJOF \n</b>\t\tI haven't finished yet.\n<b> \n</b><b>\t\t\t\tMIA \n</b>\t\tI heard it, but I think I'll sleep a little \n\t\tlonger. You can sing the rest to me afterwards. \n\n<b>\t\t\t\tJOF \n</b>\t\tAll you do is sleep.\n\nJOF is a bit offended and glances over at his son, MIKAEL, but he is also \nsleeping soundly in the high grass. JONAS SKAT comes out from the wagon. He \nyawns; he is very tired and in a bad humor. In his hands he holds a crudely \nmade death mask.\n\n<b>\t\t\t\tSKAT \n</b>\t\tIs this supposed to be a mask for an actor? If \n\t\tthe priests didn't pay us so well, I'd say no \n\t\tthank you. \n\n<b>\t\t\t\tJOF \n</b>\t\tAre you going to play Death?\n<b> \n</b><b>\t\t\t\tSKAT \n</b>\t\tJust think, scaring decent folk out of their \n\t\twits with this kind of nonsense.\n\n<b>\t\t\t\tJOF \n</b>\t\tWhen are we supposed to do this play?\n\n<b>\t\t\t\tSKAT \n</b>\t\tAt the saints' feast in Elsinore. We're going \n\t\tto perform right on the church steps, believe \n\t\tit or not.\n<b> \n</b><b>\t\t\t\tJOF \n</b>\t\tWouldn't it be better to play something bawdy? \n\t\tPeople like it better, and, besides, it's more \n\t\tfun.\n\n<b>\t\t\t\tSKAT \n</b>\t\tIdiot. There's a rumor going around that \n\t\tthere's a terrible pestilence in the land, and \n\t\tnow the priests are prophesying sudden death \n\t\tand all sorts of spiritual agonies. \n\nMIA is awake now and lies contentedly on her back, sucking on a blade of \ngrass and looking smilingly at her husband.\n<b> \n</b><b>\t\t\t\tJOF \n</b>\t\tAnd what part am I to play?\n\n<b>\t\t\t\tSKAT \n</b>\t\tYou're such a damn fool, so you're going to be \n\t\tthe Soul of Man.\n\n<b>\t\t\t\tJOF \n</b>\t\tThat's a bad part, of course.\n\n<b>\t\t\t\tSKAT \n</b>\t\tWho makes the decisions around here? Who is the\n\t\tdirector of this company anyhow?\n\nSKAT, grinning, holds the mask in front of his face and recites dramatically.\n\n<b>\t\t\t\tSKAT \n</b>\t\tBear this in mind, you fool. Your life hangs by \n\t\ta thread. Your time is short. \n\t\t\t(in his usual voice) \n\t\tAre the women going to like me in this getup? \n\t\tWill I make a hit? No! I feel as if I were dead \n\t\talready.\n\nHe stumbles into the wagon muttering furiously. JOF sits, leaning forward. \nMIA lies beside him on the grass. \n\n<b>\t\t\t\tMIA \n</b>\t\tJof!\n<b> \n</b><b>\t\t\t\tJOF \n</b>\t\tWhat is it?\n<b> \n</b><b>\t\t\t\tMIA \n</b>\t\tSit still. Don't move. \n\n<b>\t\t\t\tJOF \n</b>\t\tWhat do you mean? \n\n<b>\t\t\t\tMIA \n</b>\t\tDon't say anything. \n\n<b>\t\t\t\tJOF \n</b>\t\tI'm as silent as a grave. \n\n<b>\t\t\t\tMIA \n</b>\t\tShh! I love you.\n<b> \n</b>\n\nWaves of heat envelop the gray stone church in a strange white mist. The \nKNIGHT dismounts and enters. After tying up the horses, JONS slowly follows \nhim in. When he comes onto the church porch he stops in surprise. To the \nright of the entrance there is a large fresco on the wall, not quite \nfinished. Perched on a crude scaffolding is a PAINTER wearing a red cap and \npaint-stained clothes. He has one brush in his mouth, while with another in \nhis hand he outlines a small, terrified human face amidst a sea of other \nfaces.\n\n<b>\t\t\t\tJONS \n</b>\t\tWhat is this supposed to represent? \n\n<b>\t\t\t\tPAINTER \n</b>\t\tThe Dance of Death. \n\n<b>\t\t\t\tJONS \n</b>\t\tAnd that one is Death?\n<b> \n</b><b>\t\t\t\tPAINTER \n</b>\t\tYes, he dances off with all of them.\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tWhy do you paint such nonsense?\n\n<b>\t\t\t\tPAINTER \n</b>\t\tI thought it would serve to remind people that \n\t\tthey must die.\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tWell, it's not going to make them feel any \n\t\thappier. \n\n<b>\t\t\t\tPAINTER \n</b>\t\tWhy should one always make people happy? It \n\t\tmight not be a bad idea to scare them a little \n\t\tonce in a while.\n\n<b>\t\t\t\tJONS \n</b>\t\tThen they'll close their eyes and refuse to \n\t\tlook at your painting.\n<b> \n</b><b>\t\t\t\tPAINTER \n</b>\t\tOh, they'll look. A skull is almost more \n\t\tinteresting than a naked woman.\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tIf you do scare them ... \n\n<b>\t\t\t\tPAINTER \n</b>\t\tThey'll think. \n\n<b>\t\t\t\tJONS \n</b>\t\tAnd if they think ...\n<b> \n</b><b>\t\t\t\tPAINTER \n</b>\t\tThey'll become still more scared.\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tAnd then they'll run right into the arms of the \n\t\tpriests. \n\n<b>\t\t\t\tPAINTER \n</b>\t\tThat's not my business.\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tYou're only painting your Dance of Death. \n\n<b>\t\t\t\tPAINTER \n</b>\t\tI'm only painting things as they are. Everyone \n\t\telse can do as he likes.\n\n<b>\t\t\t\tJONS \n</b>\t\tJust think how some people will curse you. \n\n<b>\t\t\t\tPAINTER \n</b>\t\tMaybe. But then I'll paint something amusing \n\t\tfor them to look at. I have to make a living \n\t\t-- at least until the plague takes me.\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tThe plague. That sounds horrible.\n\n<b>\t\t\t\tPAINTER \n</b>\t\tYou should see the boils on a diseased man's \n\t\tthroat. You should see how his body shrivels up \n\t\tso that his legs look like knotted strings -- \n\t\tlike the man I've painted over there.\n\nThe PAINTER points with his brush. JONS sees a small human form writhing in \nthe grass, its eyes turned upwards in a frenzied look of horror and pain. \n\n<b>\t\t\t\tJONS \n</b>\t\tThat looks terrible.\n\n<b>\t\t\t\tPAINTER \n</b>\t\tIt certainly does. He tries to rip out the \n\t\tboil, he bites his hands, tears his veins open \n\t\twith his fingernails and his screams can be \n\t\theard everywhere. Does that scare you?\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tScare? Me? You don't know me. What are the \n\t\thorrors you've painted over there?\n\n<b>\t\t\t\tPAINTER \n</b>\t\tThe remarkable thing is that the poor creatures\n\t\tthink the pestilence is the Lord's punishment. \n\t\tMobs of people who call themselves Slaves of \n\t\tSin are swarming over the country, flagellating \n\t\tthemselves and others, all for the glory of God.\n\n<b>\t\t\t\tJONS \n</b>\t\tDo they really whip themselves?\n\n<b>\t\t\t\tPAINTER \n</b>\t\tYes, it's a terrible sight. I crawl into a \n\t\tditch and hide when they pass by.\n\n<b>\t\t\t\tJONS \n</b>\t\tDo you have any brandy? I've been drinking \n\t\twater all day and it's made me as thirsty as a \n\t\tcamel in the desert. \n\n<b>\t\t\t\tPAINTER \n</b>\t\tI think I frightened you after all.\n\nJONS sits down with the PAINTER, who produces a jug of brandy.\n\n\n\nThe KNIGHT is kneeling before a small altar. It is dark and quiet around him.\nThe air is cool and musty. Pictures of saints look down on him with stony \neyes. Christ's face is turned upwards, His mouth open as if in a cry of \nanguish. On the ceiling beam there is a representation of a hideous devil \nspying on a miserable human being. The KNIGHT hears a sound from the \nconfession booth and approaches it. The face of DEATH appears behind the \ngrille for an instant, but the KNIGHT doesn't see him. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI want to talk to you as openly as I can, but \n\t\tmy heart is empty.\n\nDEATH doesn't answer.\n<b> \n</b><b>\t\t\t\tKNIGHT \n</b>\t\tThe emptiness is a mirror turned towards my \n\t\town face. I see myself in it, and I am filled \n\t\twith fear and disgust. \n\nDEATH doesn't answer.\n<b> \n</b><b>\t\t\t\tKNIGHT \n</b>\t\tThrough my indifference to my fellow men, I \n\t\thave isolated myself from their company. Now I \n\t\tlive in a world of phantoms. I am imprisoned in \n\t\tmy dreams and fantasies. \n\n<b>\t\t\t\tDEATH \n</b>\t\tAnd yet you don't want to die. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tYes, I do.\n<b> \n</b><b>\t\t\t\tDEATH \n</b>\t\tWhat are you waiting for? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI want knowledge. \n\n<b>\t\t\t\tDEATH \n</b>\t\tYou want guarantees?\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tCall it whatever you like. Is it so cruelly \n\t\tinconceivable to grasp God with the senses? Why \n\t\tshould He hide himself in a mist of half-spoken \n\t\tpromises and unseen miracles? \n\nDEATH doesn't answer.\n<b> \n</b><b>\t\t\t\tKNIGHT \n</b>\t\tHow can we have faith in those who believe when \n\t\twe can't have faith in ourselves? What is going \n\t\tto happen to those of us who want to believe \n\t\tbut aren't able to? And what is to become of \n\t\tthose who neither want to nor are capable of \n\t\tbelieving?\n\nThe KNIGHT stops and waits for a reply, but no one speaks or answers him. \nThere is complete silence. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tWhy can't I kill God within me? Why does He \n\t\tlive on in this painful and humiliating way \n\t\teven though I curse Him and want to tear Him \n\t\tout of my heart? Why, in spite of everything, \n\t\tis He a baffling reality that I can't shake \n\t\toff? Do you hear me? \n\n<b>\t\t\t\tDEATH \n</b>\t\tYes, I hear you.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI want knowledge, not faith, not suppositions, \n\t\tbut knowledge. I want God to stretch out His \n\t\thand towards me, reveal Himself and speak to \n\t\tme. \n\n<b>\t\t\t\tDEATH \n</b>\t\tBut He remains silent.\n<b> \n</b><b>\t\t\t\tKNIGHT\n</b>\t\tI call out to Him in the dark but no one seems \n\t\tto be there.\n<b> \n</b><b>\t\t\t\tDEATH \n</b>\t\tPerhaps no one is there.\n<b> \n</b><b>\t\t\t\tKNIGHT \n</b>\t\tThen life is an outrageous horror. No one can \n\t\tlive in the face of death, knowing that all is \n\t\tnothingness. \n\n<b>\t\t\t\tDEATH \n</b>\t\tMost people never reflect about either death or \n\t\tthe futility of life.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tBut one day they will have to stand at that \n\t\tlast moment of life and look towards the \n\t\tdarkness. \n\n<b>\t\t\t\tDEATH \n</b>\t\tWhen that day comes ...\n<b> \n</b><b>\t\t\t\tKNIGHT \n</b>\t\tIn our fear, we make an image, and that image \n\t\twe call God.\n<b> \n</b><b>\t\t\t\tDEATH \n</b>\t\tYou are worrying ...\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tDeath visited me this morning. We are playing \n\t\tchess together. This reprieve gives me the \n\t\tchance to arrange an urgent matter.\n\n<b>\t\t\t\tDEATH \n</b>\t\tWhat matter is that?\n<b> \n</b><b>\t\t\t\tKNIGHT \n</b>\t\tMy life has been a futile pursuit, a wandering, \n\t\ta great deal of talk without meaning. I feel no \n\t\tbitterness or self-reproach because the lives \n\t\tof most people are very much like this. But I \n\t\twill use my reprieve for one meaningful deed. \n\n<b>\t\t\t\tDEATH \n</b>\t\tIs that why you are playing chess with Death? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tHe is a clever opponent, but up to now I \n\t\thaven't lost a single man.\n\n<b>\t\t\t\tDEATH \n</b>\t\tHow will you outwit Death in your game? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI use a combination of the bishop and the \n\t\tknight which he hasn't yet discovered. In the \n\t\tnext move I'll shatter one of his flanks.\n\n<b>\t\t\t\tDEATH \n</b>\t\tI'll remember that.\n\nDEATH shows his face at the grill of the confession booth for a moment but \ndisappears instantly.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tYou've tricked and cheated me! But we'll meet \n\t\tagain, and I'll find a way.\n\n<b>\t\t\t\tDEATH \n</b>\t\t\t(invisible)\n\t\tWe'll meet at the inn, and there we'll continue \n\t\tplaying.\n\nThe KNIGHT raises his hand and looks at it in the sunlight which comes \nthrough the tiny window. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tThis is my hand. I can move it, feel the blood \n\t\tpulsing through it. The sun is still high in \n\t\tthe sky and I, Antonius Block, am playing \n\t\tchess with Death. \n\nHe makes a fist of his hand and lifts it to his temple.\n\n\n\nMeanwhile, JONS and the PAINTER have got drunk and are talking animatedly \ntogether.\n\n<b>\t\t\t\tJONS \n</b>\t\tMe and my master have been abroad and have just \n\t\tcome home. Do you understand, you little \n\t\tpictor? \n\n<b>\t\t\t\tPAINTER \n</b>\t\tThe Crusade.\n\n<b>\t\t\t\tJONS \n</b>\t\t\t(drunk)\n\t\tPrecisely. For ten years we sat in the Holy \n\t\tLand and let snakes bite us, flies sting us, \n\t\twild animals eat us, heathens butcher us, the \n\t\twine poison us, the women give us lice, the \n\t\tlice devour us, the fevers rot us, all for the \n\t\tGlory of God. Our crusade was such madness that \n\t\tonly a real idealist could have thought it up. \n\t\tBut what you said about the plague was \n\t\thorrible. \n\n<b>\t\t\t\tPAINTER \n</b>\t\tIt's worse than that.\n\n<b>\t\t\t\tJONS \n</b>\t\tAh, me. No matter which way you turn, you have \n\t\tyour rump behind you. That's the truth.\n\n<b>\t\t\t\tPAINTER \n</b>\t\tThe rump behind you, the rump behind you \n\t\tthere's a profound truth.\n\nJONS paints a small figure which is supposed to represent himself.\n\n<b>\t\t\t\tJONS \n</b>\t\tThis is squire J\u0088ns. He grins at Death, mocks \n\t\tthe Lord, laughs at himself and leers at the \n\t\tgirls. His world is a J\u0088nsworld, believable \n\t\tonly to himself, ridiculous to all including \n\t\thimself, meaningless to Heaven and of no \n\t\tinterest to Hell. \n\nThe KNIGHT walks by, calls to his squire and goes out into the bright \nsunshine. JONS manages to set himself down from the scaffolding.\n\nOutside the church, four soldiers and a monk are in the process of putting a \nwoman in the stocks. Her face is pale and child-like, her head has been \nshaved, and her knuckles are bloody and broken. Her eyes are wide open, yet \nshe doesn't appear to be fully conscious. \n\nJONS and the KNIGHT stop and watch in silence. The soldiers are working \nquickly and skillfully, but they seem frightened and dejected. The monk \nmumbles from a small book. One of the soldiers picks up a wooden bucket and \nwith his hand begins to smear a bloody paste on the wall of the church and \naround the woman. JONS holds his nose.\n\n<b>\t\t\t\tJONS \n</b>\t\tThat soup of yours has a hell of a stink. What \n\t\tis it good for?\n\n<b>\t\t\t\tSOLDIER \n</b>\t\tShe has had carnal intercourse with the Evil \n\t\tOne. \n\nHe whispers this with a horrified face and continues to splash the sticky \nmess on the wall. \n\n<b>\t\t\t\tJONS \n</b>\t\tAnd now she's in the stocks.\n\n<b>\t\t\t\tSOLDIER \n</b>\t\tShe will be burned tomorrow morning at the \n\t\tparish boundary. But we have to keep the Devil \n\t\taway from the rest of us.\n\n<b>\t\t\t\tJONS \n</b>\t\t\t(holding his nose)\n\t\tAnd you do that with this stinking mess?\n\n<b>\t\t\t\tSOLDIER \n</b>\t\tIt's the best remedy: blood mixed with the bile \n\t\tof a big black dog. The Devil can't stand the \n\t\tsmell. \n\n<b>\t\t\t\tJONS \n</b>\t\tNeither can I.\n<b> \n</b>JONS walks over towards the horses. The KNIGHT stands for a few, moments \nlooking at the young girl. She is almost a child. Slowly she turns her eyes \ntowards him. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tHave you seen the Devil?\n\nThe MONK stops reading and raises his head. \n\n<b>\t\t\t\tMONK \n</b>\t\tYou must not talk to her. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tCan that be so dangerous?\n\n<b>\t\t\t\tMONK \n</b>\t\tI don't know, but she is believed to have \n\t\tcaused the pestilence with which we are \n\t\taffected. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI understand.\n\nHe nods resignedly and walks away. The young woman starts to moan as though \nshe were having a horrible nightmare. The sound of her cries follows the two \nriders for a considerable distance down the road.\n<b> \n</b>\n\nThe sun stands high in the sky, like a red ball of fire. The waterskin is \nempty and JONS looks for a well where he can fill it.\n\nThey approach a group of peasant cottages at the edge of the forest. JONS \nties up the horses, slings the skin over his shoulder and walks along the \npath towards the nearest cottage. As always, his movements are light and \nalmost soundless. The door to the cottage is open. He stops outside, but when \nno one appears he enters. It is very dark inside and his foot touches a soft \nobject. He looks down. Beside the whitewashed fireplace, a woman is lying \nwith her face to the ground.\n\nAt the sound of approaching steps, JONS quickly hides behind the door. A man \ncomes down a ladder from the loft. He is broad and thick-set. His eyes are \nblack and his face is pale and puffy. His clothes are well cut but dirty and \nin rags. He carries a cloth sack. Looking around, he goes into the inner \nroom, bends over the bed, tucks something into the bag, slinks along the \nwalls, looking on the shelves, finds something else which he tucks in his \nbag.\n\nSlowly he re-enters the outer room, bends over the dead woman and carefully \nslips a ring from her finger. At that moment a young woman comes through the \ndoor. She stops and stares at the stranger.\n\n<b>\t\t\t\tRAVEL \n</b>\t\tWhy do you look so surprised? I steal from the \n\t\tdead. These days it's quite a lucrative \n\t\tenterprise. \n\nThe GIRL makes a movement as if to run away. \n\n<b>\t\t\t\tRAVEL \n</b>\t\tYou're thinking of running to the village and \n\t\ttelling. That wouldn't serve any purpose. Each \n\t\tof us has to save his own skin. It's as simple \n\t\tas that. \n\n<b>\t\t\t\tGIRL \n</b>\t\tDon't touch me.\n\n<b>\t\t\t\tRAVAL \n</b>\t\tDon't try to scream. There's no one around to \n\t\thear you, neither God nor man.\n\nSlowly he closes the door behind the GIRL. The stuffy room is now in almost \ntotal darkness. But JONS becomes clearly visible.\n\n<b>\t\t\t\tJONS \n</b>\t\tI recognize you, although it's a long time \n\t\tsince we met. Your name is Raval, from the \n\t\ttheological college at Roskilde. You are Dr. \n\t\tMirabilis, Coelestis et Diabilis. \n\nRAVAL smiles uneasily and looks around. \n\n<b>\t\t\t\tJONS \n</b>\t\tAm I not right?\n\nThe GIRL stands immobile.\n\n<b>\t\t\t\tJONS \n</b>\t\tYou were the one who, ten years ago, convinced \n\t\tmy master of the necessity to join a better-\n\t\tclass crusade to the Holy Land.\n\nRAVAL looks around.\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tYou look uncomfortable. Do you have a stomach-\n\t\tache? \n\nRAVAL smiles anxiously.\n\n<b>\t\t\t\tJONS \n</b>\t\tWhen I see you, I suddenly understand the \n\t\tmeaning of these ten years, which previously \n\t\tseemed to me such a waste. Our life was too \n\t\tgood and we were too satisfied with ourselves. \n\t\tThe Lord wanted to punish us for our \n\t\tcomplacency. That is why He sent you to spew \n\t\tout your holy venom and poison the knight.\n\n<b>\t\t\t\tRAVEL \n</b>\t\tI acted in good faith.\n\n<b>\t\t\t\tJONS \n</b>\t\tBut now you know better, don't you? Because \n\t\tnow you have turned into a thief. A more \n\t\tfitting and rewarding occupation for \n\t\tscoundrels. Isn't that so?\n\nWith a quick movement he knocks the knife out of RAVAL'S hand, gives him a \nkick so that he falls on the floor and is about to finish him off. Suddenly \nthe GIRL screams. JONS stops and makes a gesture of generosity with his hand.\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tBy all means. I'm not bloodthirsty. \n\nHe bends over RAVAL. \n\n<b>\t\t\t\tRAVEL \n</b>\t\tDon't beat me.\n\n<b>\t\t\t\tJONS \n</b>\t\tI don't have the heart to touch you, Doctor. \n\t\tBut remember this: the next time we meet, I'll \n\t\tbrand your face the way one does with thieves. \n\t\t\t(he rises)\n\t\tWhat I really came for is to get my waterskin \n\t\tfilled.\n\n<b>\t\t\t\tGIRL \n</b>\t\tWe have a deep well with cool, fresh water. \n\t\tCome, I'll show you.\n\nThey walk out of the house. RAVAL lies still for a few moments, then he rises \nslowly and looks around. When no one is in sight, he takes his bag and steals \naway. JONS quenches his thirst and fills his bag with water. The GIRL helps \nhim.\n\n<b>\t\t\t\tJONS \n</b>\t\tJ\u0088ns is my name. I am a pleasant and talkative \n\t\tyoung man who has never had anything but kind \n\t\tthoughts and has only done beautiful and noble \n\t\tdeeds. I'm kindest of all to young women. With \n\t\tthem, there is no limit to my kindness. \n\nHe embraces her and tries to kiss her, but she holds herself back. Almost \nimmediately he loses interest, hoists the waterbag on his shoulder and pats \nthe GIRL on the cheek.\n\n<b>\t\t\t\tJONS \n</b>\t\tGoodbye, my girl. I could very well have raped \n\t\tyou, but between you and me, I'm tired of that \n\t\tkind of love. It runs a little dry in the end.\n\nHe laughs kindly and walks away from her. When he has walked a short distance \nhe turns; the GIRL is still there.\n\n<b>\t\t\t\tJONS \n</b>\t\tNow that I think of it, I will need a \n\t\thousekeeper. Can you prepare good food? \n\t\t\t(the GIRL nods)\n\t\tAs far as I know, I'm still a married man, but\n\t\tI have high hopes that my wife is dead by now.\n\t\tThat's why I need a housekeeper. \n\t\t\t(the GIRL doesn't \n\t\t\tanswer but gets up)\n\t\tThe devil with it! Come along and don't stand \n\t\tthere staring. I've saved your life, so you owe \n\t\tme a great deal.\n\nShe begins walking towards him, her head bent. He doesn't wait for her but \nwalks towards the KNIGHT, who patiently awaits his squire.\n<b> \n</b>\n\nThe Embarrassment Inn lies in the eastern section of the province. The plague \nhas not yet reached this area on its way along the coast.\n\nThe actors have placed their wagon under a tree in the yard of the inn. \nDressed in colorful costumes, they perform a farce.\n\nThe spectators watch the performance, commenting on it noisily. There are\nmerchants with fat, beer-sweaty faces, apprentices and journeymen, farmhands \nand milkmaids. A whole flock of children perch in the trees around the wagon.\n<b> \n</b>The KNIGHT and his squire have sat down in the shadow of a wall. They drink \nbeer and doze in the midday heat. The GIRL from the deserted village sleeps \nat JONS'S side. SKAT beats the drums, JOF blows the flute, MIA performs a gay \nand lively dance. They perspire under the hot white sun. When they have \nfinished SKAT comes forward and bows.\n\n<b>\t\t\t\tSKAT \n</b>\t\tNoble ladies and gentlemen, I thank you for \n\t\tyour interest. Please remain standing for a\n\t\tlittle longer, or sit on the ground, because \n\t\twe are now going to perform a tragedia about \n\t\tan unfaithful wife, her jealous husband, and \n\t\tthe handsome lover -- that's me.\n\nMIA and JOF have quickly changed costumes and again step out on the stage. \nThey bow, to the public. \n\n<b>\t\t\t\tSKAT \n</b>\t\tHere is the husband. Here is the wife. If \n\t\tyou'll shut up over there, you'll see something \n\t\tsplendid. As I said, I play the lover and I \n\t\thaven't entered yet. That's why I'm going to \n\t\thide behind the curtain for the time being. \n\t\t\t(he wipes the sweat \n\t\t\tfrom his forehead)\n\t\tIt's damned hot. I think we'll have a \n\t\tthunderstorm.\n\nHe places his leg in front of JOF as if to trip him, raises MIA's skirt, \nmakes a face as if he could see all the wonders of the world underneath it, \nand disappears behind the gaudily patched curtains.\n\nSKAT is very handsome, now that he can see himself in the reflection of a tin \nwashbowl. His hair is tightly curled, his eyebrows are beautifully bushy, \nglittering earrings vie for equal attention with his teeth, and his cheeks \nare flushed rose red.\n<b> \n</b>He sits out in back on the tailboard of the wagon, dangling his legs and \nwhistling to himself.\n<b> \n</b>In the meantime JOF and MIA play their tragedy; it is not, however, received \nwith great acclaim. SKAT suddenly discovers that someone is watching him as \nhe gazes contentedly into the tin bowl. A woman stands there, stately in both \nheight and volume.\n<b> \n</b>SKAT frowns, toys with his small dagger and occasionally throws a roguish but \nfiery glance at the beautiful visitor. She suddenly discovers that one of her \nshoes doesn't quite fit. She leans down to fix it and in doing so allows her \ngenerous bosom to burst out of its prison -- no more than honor and chastity \nallow, but still enough so that the actor with his experienced eye \nimmediately sees that there are ample rewards to be had here.\n\nNow she comes a little closer, kneels down and opens a bundle containing \nseveral dainty morsels and a skin filled with red wine. JONAS SKAT manages \nnot to fall off the wagon in his excitement. Standing on the steps of the \nwagon, he supports himself against a nearby tree, crosses his legs and bows.\n<b> \n</b>The woman quietly bites into a chicken leg dripping with fat. At this moment \nthe actor is stricken by a radiant glance full of lustful appetites.\n\nWhen he sees this look, SKAT makes an instantaneous decision, jumps down from \nthe wagon and kneels in front of the blushing damsel.\n\nShe becomes weak and faint from his nearness, looks at him with a glassy \nglance and breathes heavily. SKAT doesn't neglect to press kisses on her \nsmall, chubby hands. The sun shines brightly and small birds make noises in \nthe bushes.\n\nNow she is forced to sit back; her legs seem unwilling to support her any \nlonger. Bewildered, she singles out another chicken leg from the large sack \nof food and holds it up in front of SKAT with an appealing and triumphant \nexpression, as if it were her maidenhood being offered as a prize.\n\nSKAT hesitates momentarily, but he is still the strategist. He lets the \nchicken leg fall to the grass, and murmurs in the woman's rosy ear.\n\nHis words seem to please her. She puts her arms around the actor's neck and \npulls him to her with such fierceness that both of them lose their balance \nand tumble down on the soft grass. The small birds take to their wings with \nfrightened shrieks.\n\n\n\nJOF stands in the hot sun with a flickering lantern in his hand. MIA pretends \nto be asleep on a bench which has been pulled forward on the stage. \n\n<b>\t\t\t\tJOF \n</b>\t\tNight and moonlight now prevail \n\t\tHere sleeps my wife so frail ... \n\n<b>\t\t\t\tVOICE FROM THE PUBLIC\n</b>\t\tDoes she snore?\n\n<b>\t\t\t\tJOF \n</b>\t\tMay I point out that this is a tragedy, and in \n\t\ttragedies one doesn't snore.\n\n<b>\t\t\t\tVOICE FROM THE PUBLIC\n</b>\t\tI think she should snore anyhow. \n\nThis opinion causes mirth in the audience. JOF becomes slightly confused and \ngoes out of character, but MIA keeps her head and begins snoring. \n\n<b>\t\t\t\tJOF \n</b>\t\tNight and moonlight now prevail.\n\t\tThere snores -- I mean sleeps -- my wife so frail. \n\t\tJealous I am, as never before, \n\t\tI hide myself behind this door. \n\t\tFaithful is she \n\t\tTo her lover -- not me. \n\t\tHe soon comes a-stealing \n\t\tTo awaken her lusty feeling. \n\t\tI shall now kill him dead \n\t\tFor cuckolding me in my bed. \n\t\tThere he comes in the moonlight, \n\t\tHis white legs shining bright. \n\t\tQuiet as a mouse, here I'll lie, \n\t\tTell him not that he's about to die.\n\nJOF hides himself. MIA immediately ends her snoring and sits up, looking to \nthe left. \n\n<b>\t\t\t\tMIA \n</b>\t\tLook, there he comes in the night \n\t\tMy lover, my heart's delight.\n\nShe becomes silent and looks wide-eyed in front of her. The mood in the yard \nin front of the inn has, up to now, been rather lighthearted despite the \nheat.\n<b> \n</b>Now a rapid change occurs. People who had been laughing and chattering fall \nsilent. Their faces seem to pale under their sunbrowned skins, the children \nstop their games and stand with gaping mouths and frightened eyes.\n<b> \n</b>JOF steps out in front of the curtain. His painted face bears an expression \nof horror. MIA has risen with MIKAEL in her arms. Some of the women in the \nyard have fallen on their knees, others hide their faces, many begin to \nmutter half-forgotten prayers.\n\nAll have turned their faces towards the white road. Now a shrill song is \nheard. It is frenzied, almost a scream. A crucified Christ sways above the \nhilltop.\n\nThe cross-bearers soon come into sight. They are Dominican monks, their hoods \npulled down over their faces. More and more of them follow, carrying litters \nwith heavy coffins or clutching holy relics, their hands stretched out \nspasmodically. The dust wells up around their black hoods; the censers sway \nand emit a thick, ashen smoke which smells of rancid herbs.\n\nAfter the line of monks comes another procession. It is a column of men, \nboys, old men, women, girls, children. All of them have steel-edged scourges \nin their hands with which they whip themselves and each other, howling \necstatically. They twist in pain; their eyes bulge wildly; their lips are \ngnawed to shreds and dripping with foam. They have been seized by madness. \nThey bite their own hands and arms, whip each other in violent, almost \nrhythmic outbursts. Throughout it all the shrill song howls from their \nbursting throats. Many sway and fall, lift themselves up again, support each\nother and help each other to intensify the scourging.\n\nNow the procession pauses at the crossroads in front of the inn. The monks \nfall on their knees, hiding their faces with clenched hands, arms pressed \ntightly together. Their song never stops. The Christ figure on its timbered \ncross is raised above the heads of the crowd. It is not Christ triumphant, \nbut the suffering Jesus with the sores, the blood, the hammered nails and the \nface in convulsive pain. The Son of God, nailed on the wood of the cross, \nsuffering scorn and shame.\n<b> \n</b>The penitents have now sunk down in the dirt of the road. They collapse where \nthey stood like slaughtered cattle. Their screams rise with the song of the \nmonks, through misty clouds of incense, towards the white fire of the sun.\n<b> \n</b>A large square monk rises from his knees and reveals his face, which is red-\nbrown from the sun. His eyes glitter; his voice is thick with impotent scorn.\n\n<b>\t\t\t\tMONK\n</b>\t\tGod has sentenced us to punishment. We shall \n\t\tall perish in the black death. You, standing \n\t\tthere like gaping cattle, you who sit there in \n\t\tyour glutted complacency, do you know that this \n\t\tmay be your last hour? Death stands right \n\t\tbehind you. I can see how his crown gleams in \n\t\tthe sun. His scythe flashes as he raises it \n\t\tabove your heads. Which one of you shall he \n\t\tstrike first? You there, who stand staring like \n\t\ta goat, will your mouth be twisted into the \n\t\tlast unfinished gasp before nightfall? And you, \n\t\twoman, who bloom with life and self-\n\t\tsatisfaction, will you pale and become \n\t\textinguished before the morning dawns? You back\n\t\tthere, with your swollen nose and stupid grin, \n\t\tdo you have another year left to dirty the \n\t\tearth with your refuse? Do you know, you \n\t\tinsensible fools, that you shall die today or \n\t\ttomorrow, or the next day, because all of you \n\t\thave been sentenced? Do you hear what I say? Do \n\t\tyou hear the word? You have been sentenced, \n\t\tsentenced! \n\nThe MONK falls silent, looking around with a bitter face and a cold, scornful\nglance. Now, he clenches his hands, straddles the ground and turns his face\nupwards. \n\n<b>\t\t\t\tMONK\n</b>\t\tLord have mercy on us in our humiliation! Don't \n\t\tturn your face from us in loathing and \n\t\tcontempt, but be merciful to us for the sake of \n\t\tyour son, Jesus Christ. \n\nHe makes the sign of the cross over the crowd and then begins a new song in a\nstrong voice. The monks rise and join in the song. As if driven by some \nsuperhuman force, the penitents begin to whip themselves again, still wailing \nand moaning.\n\nThe procession continues. New members have joined the rear of the column; \nothers who were unable to go on lie weeping in the dust of the road. JONS the \nsquire drinks his beer.\n\n<b>\t\t\t\tJONS \n</b>\t\tThis damned ranting about doom. Is that food \n\t\tfor the minds of modern people? Do they really \n\t\texpect us to take them seriously?\n\nThe KNIGHT grins tiredly.\n\n<b>\t\t\t\tJONS \n</b>\t\tYes, now you grin at me, my lord. But allow me \n\t\tto point out that I've either read, heard or \n\t\texperienced most of the tales which we people \n\t\ttell each other. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\t\t(yawns) \n\t\tYes, yes.\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tEven the ghost stories about God the Father, \n\t\tthe angels, Jesus Christ and the Holy Ghost --\n\t\tall these I've accepted without too much \n\t\temotion.\n\nHe leans down over the GIRL as she crouches at his feet and pats her on the \nhead. The KNIGHT drinks his beer silently.\n\n<b>\t\t\t\tJONS \n</b>\t\t\t(contentedly)\n\t\tMy little stomach is my world, my head is my \n\t\teternity, and my hands, two wonderful suns. My \n\t\tlegs are time's damned pendulums, and my dirty \n\t\tfeet are two splendid starting points for my \n\t\tphilosophy. Everything is worth precisely as \n\t\tmuch as a belch, the only difference being that \n\t\ta belch is more satisfying.\n\nThe beer mug is empty. Sighing, JONS gets to his feet. The GIRL follows him \nlike a shadow.\n\nIn the yard he meets a large man with a sooty face and a dark expression. He \nstops JONS with a roar. \n\n<b>\t\t\t\tJONS \n</b>\t\tWhat are you screaming about?\n\n<b>\t\t\t\tPLOG \n</b>\t\tI am Plog, the smith, and you are the squire \n\t\tJ\u0088ns. \n\n<b>\t\t\t\tJONS \n</b>\t\tThat's possible.\n\n<b>\t\t\t\tPLOG \n</b>\t\tHave you seen my wife?\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tNo, I haven't. But if I had seen her and she \n\t\tlooked like you, I'd quickly forget that I'd \n\t\tseen her. \n\n<b>\t\t\t\tPLOG\n</b>\t\tWell, in that case you haven't seen her. \n\n<b>\t\t\t\tJONS \n</b>\t\tMaybe she's run off. \n\n<b>\t\t\t\tPLOG \n</b>\t\tDo you know anything?\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tI know quite a lot, but not about your wife. Go \n\t\tto the inn. Maybe they can help you.\n\nThe smith sighs sadly and goes inside.\n\nThe inn is very small and full of people eating and drinking to forget their \nnewly aroused fears of eternity. In the open fireplace a roasting pig turns\non an iron spit. The sun shines outside the casement window, its sharp rays\npiercing the darkness of the room, which is thick with fumes and\nperspiration.\n<b> \n</b><b>\t\t\t\tMERCHANT\n</b>\t\tYes, it's true! The plague is spreading along \n\t\tthe west coast. People are dying like flies. \n\t\tUsually business would be good at this time of \n\t\tyear, but, damn it, I've still got my whole \n\t\tstock unsold.\n\n<b>\t\t\t\tWOMAN \n</b>\t\tThey speak of the judgment day. And all these \n\t\tomens are terrible. Worms, chopped-off hands \n\t\tand other monstrosities began pouring out of \n\t\tan old woman, and down in the village another \n\t\twoman gave birth to a calf's head. \n\n<b>\t\t\t\tOLD MAN \n</b>\t\tThe day of judgment. Imagine.\n\n<b>\t\t\t\tFARMER\n</b>\t\tIt hasn't rained here for a month. We'll surely \n\t\tlose our crops.\n\n<b>\t\t\t\tMERCHANT\n</b>\t\tAnd people are acting crazy, I'd say. They flee \n\t\tthe country and carry the plague with them \n\t\twherever they go. \n\n<b>\t\t\t\tOLD MAN \n</b>\t\tThe day of judgment. Just think, just think! \n\n<b>\t\t\t\tFARMER \n</b>\t\tIf it's as they say, I suppose a person should \n\t\tlook after his house and try to enjoy life as \n\t\tlong as he can. \n\n<b>\t\t\t\tWOMAN \n</b>\t\tBut there have been other things too, such \n\t\tthings that can't even be spoken of. \n\t\t\t(whispers)\n\t\tThings that mustn't be named -- but the priests \n\t\tsay that the woman carries it between her legs \n\t\tand that's why she must cleanse herself. \n\n<b>\t\t\t\tOLD MAN \n</b>\t\tJudgment day. And the Riders of the Apocalypse \n\t\tstand at the bend in the village road. I \n\t\timagine they'll come on judgment night, at \n\t\tsundown.\n\n<b>\t\t\t\tWOMAN \n</b>\t\tThere are many who have purged themselves with\n\t \tfire and died from it, but the priests say that \n\t\tit's better to die pure than to live for hell.\n<b> \n</b><b>\t\t\t\tMERCHANT \n</b>\t\tThis is the end, yes, it is. No one says it out\n\t\tloud, but all of us know that it's the end. And \n\t\tpeople are going mad from fear.\n\n<b>\t\t\t\tFARMER\n</b>\t\tSo you're afraid too. \n\n<b>\t\t\t\tMERCHANT\n</b>\t\tOf course I'm afraid.\n\n<b>\t\t\t\tOLD MAN \n</b>\t\tThe judgment day becomes night, and the angels \n\t\tdescend and the graves open. It will be \n\t\tterrible to see. \n\nThey whisper in low tones and sit close to each other.\n\n\n\nPLOG, the smith, shoves his way into a place next to JOF, who is still \ndressed in his costume. Opposite him sits RAVAL, leaning slightly forward, \nhis face perspiring heavily. RAVAL rolls an armlet out on the table. \n\n<b>\t\t\t\tRAVAL \n</b>\t\tDo you want this armlet? You can have it \n\t\tcheap. \n\n<b>\t\t\t\tJOF \n</b>\t\tI can't afford it. \n\n<b>\t\t\t\tRAVAL \n</b>\t\tIt's real silver.\n\n<b>\t\t\t\tJOF \n</b>\t\tIt's nice. But it's surely too expensive for \n\t\tme. \n\n<b>\t\t\t\tPLOG \n</b>\t\tExcuse me, but has anyone here seen my wife? \n\n<b>\t\t\t\tJOF \n</b>\t\tHas she disappeared? \n\n<b>\t\t\t\tPLOG \n</b>\t\tThey say she's run away. \n\n<b>\t\t\t\tJOF \n</b>\t\tHas she deserted you? \n\n<b>\t\t\t\tPLOG \n</b>\t\tWith an actor.\n\n<b>\t\t\t\tJOF \n</b>\t\tAn actor! If she's got such bad taste, then I \n\t\tthink you should let her go.\n\n<b>\t\t\t\tPLOG \n</b>\t\tYou're right. My first thought, of course, was \n\t\tto kill her.\n\n<b>\t\t\t\tJOF \n</b>\t\tOh. But to murder her, that's a terrible thing \n\t\tto do. \n\n<b>\t\t\t\tPLOG \n</b>\t\tI'm also going to kill the actor. \n\n<b>\t\t\t\tJOF \n</b>\t\tThe actor?\n\n<b>\t\t\t\tPLOG \n</b>\t\tOf course, the one she eloped with. \n\n<b>\t\t\t\tJOF \n</b>\t\tWhat has he done to deserve that? \n\n<b>\t\t\t\tPLOG \n</b>\t\tAre you stupid?\n<b> \n</b><b>\t\t\t\tJOF \n</b>\t\tThe actor! Now I understand. There are too many \n\t\tof them, so even if he hasn't done anything in \n\t\tparticular you ought to kill him merely because \n\t\the's an actor. \n\n<b>\t\t\t\tPLOG \n</b>\t\tYou see, my wife has always been interested in \n\t\tthe tricks of the theatre.\n\n<b>\t\t\t\tJOF \n</b>\t\tAnd that turned out to be her misfortune. \n\n<b>\t\t\t\tPLOG \n</b>\t\tHer misfortune, but not mine, because a person \n\t\twho's born unfortunate can hardly suffer from \n\t\tany further misfortune. Isn't that true?\n\nNow RAVAL enters the discussion. He is slightly drunk and his voice is shrill \nand evil.\n<b> \n</b><b>\t\t\t\tRAVAL \n</b>\t\tListen, you! You sit there and lie to the \n\t\tsmith. \n\n<b>\t\t\t\tJOF \n</b>\t\tI! A liar!\n<b> \n</b><b>\t\t\t\tRAVAL \n</b>\t\tYou're an actor too and it's probably your \n\t\tpartner who's run off with Plog's old lady. \n\n<b>\t\t\t\tPLOG \n</b>\t\tAre you an actor too?\n\n<b>\t\t\t\tJOF \n</b>\t\tAn actor! Me! I wouldn't quite call myself that! \n\n<b>\t\t\t\tRAVAL \n</b>\t\tWe ought to kill you; it's only logical. \n\n<b>\t\t\t\tJOF \n</b>\t\t\t(laughs)\n\t\tYou're really funny.\n\n<b>\t\t\t\tRAVAL \n</b>\t\tHow strange -- you've turned pale. Have you \n\t\tanything on your conscience?\n\n<b>\t\t\t\tJOF \n</b>\t\tYou're funny. Don't you think he's funny? \n\t\t\t(to Plog)\n\t\tOh, you don't.\n\n<b>\t\t\t\tRAVAL \n</b>\t\tMaybe we should mark you up a little with a \n\t\tknife, like they do petty scoundrels of your \n\t\tkind.\n\nPLOG bangs his hands down on the table so that the dishes jump. He gets up.\n<b> \n</b><b>\t\t\t\tPLOG \n</b>\t\t\t(shouting)\n\t\tWhat have you done with my wife? \n\nThe room becomes silent. JOF looks around, but there is no exit, no way to \nescape. He puts his hands on the table. Suddenly a knife flashes through the \nair and sinks into the table top between his fingers.\n\nJOF snatches away his hands and raises his head. He looks half surprised, as \nif the truth had just become apparent to him.\n<b> \n</b><b>\t\t\t\tJOF \n</b>\t\tDo you want to hurt me? Why? Have I provoked \n\t\tsomeone, or got in the way? I'll leave right \n\t\tnow and never come back.\n\nJOF looks from one face to another, but no one seems ready to help him or \ncome to his defense.\n<b> \n</b><b> \t\t\t\tRAVAL \n</b>\t\tGet up so everyone can hear you. Talk louder. \n\nTrembling, JOF rises. He opens his mouth as if to say something, but not a \nword comes out.\n<b> \n</b><b>\t\t\t\tRAVAL \n</b>\t\tStand on your head so that we can see how good \n\t\tan actor you are.\n\nJOF gets up on the table and stands on his head. A hand pushes him forward so\nthat he collapses on the floor. PLOG rises, pulls him to his feet with one \nhand. \n\n<b>\t\t\t\tPLOG \n</b>\t\t\t(shouts) \n\t\tWhat have you done with my wife? \n\nPLOG beats him so furiously that JOF flies across the table. RAVAL leans over\nhim.\n<b> \n</b><b>\t\t\t\tRAVAL \n</b>\t\tDon't lie there moaning. Get up and dance. \n\n<b>\t\t\t\tJOF \n</b>\t\tI don't want to. I can't.\n\n<b>\t\t\t\tRAVEL \n</b>\t\tShow us how you imitate a bear. \n\n<b>\t\t\t\tJOF \n</b>\t\tI can't play a bear.\n\n<b>\t\t\t\tRAVAL \n</b>\t\tLet's see if you can't after all.\n\nRAVAL prods JOF lightly with the knife point. JOF gets up with cold sweat on \nhis cheeks and forehead, frightened half to death. He begins to jump and hop \non top of the tables, swinging his arms and legs and making grotesque faces.\nSome laugh, but most of the people sit silently. JOF gasps as if his lungs \nwere about to burst. He sinks to his knees, and someone pours beer over him. \n\n<b>\t\t\t\tRAVEL \n</b>\t\tUp again! Be a good bear.\n\n<b>\t\t\t\tJOF \n</b>\t\tI haven't done any harm. I haven't got the \n\t\tstrength to play a bear any more.\n\nAt that moment the door opens and JONS enters. JOF sees his chance and steals\nout. RAVAL intends to follow him, but suddenly stops. JONS and RAVAL look at \neach other. \n\n<b>\t\t\t\tJONS \n</b>\t\tDo you remember what I was going to do to you \n\t\tif we met again?\n\nRAVAL steps back without speaking. \n\n<b>\t\t\t\tJONS \n</b>\t\tI'm a man who keeps his word.\n\nJONS raises his knife and cuts RAVAL from forehead to cheek. RAVAL staggers \ntowards the wall.\n<b> \n</b>\n\nThe hot day has become night. Singing and howling can be heard from the inn. \nIn a hollow near the forest, the light still lingers. Hidden in the grass and\nthe shrubbery, nightingales sing and their voices echo through the stillness.\n<b> \n</b>The players' wagon stands in a small ravine, and not far away the horse \ngrazes on the dry grass. MIA has sat down in front of the wagon with her son \nin her arms. They play together and laugh happily.\n\nNow, a soft gleam of light strokes the hilltops, a last reflection from the \nred clouds over the sea.\n\nNot far from the wagon, the KNIGHT sits crouched over his chess game. He \nlifts his head.\n\nThe evening light moves across the heavy wagon wheels, across the woman and \nthe child. The KNIGHT gets up.\n\nMIA sees him and smiles. She holds up her struggling son, as if to amuse the \n<b>KNIGHT. \n</b>\n<b>\t\t\t\tKNIGHT \n</b>\t\tWhat's his name? \n\n<b>\t\t\t\tMIA \n</b>\t\tMikael.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tHow old is he? \n\n<b>\t\t\t\tMIA \n</b>\t\tOh, he'll soon be two. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tHe's big for his age.\n\n<b>\t\t\t\tMIA \n</b>\t\tDo you think so? Yes, I guess he's rather big. \n\nShe puts the child down on the ground and half rises to shake out her red \nskirt. When she sits down again, the KNIGHT steps closer.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tYou played some kind of show this afternoon. \n\n<b>\t\t\t\tMIA \n</b>\t\tDid you think it was bad?\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tYou are more beautiful now without your face \n\t\tpainted, and this gown is more becoming.\n\n<b>\t\t\t\tMIA \n</b>\t\tYou see, Jonas Skat has run off and left us, \n\t\tso we're in real trouble now.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tIs that your husband?\n\n<b>\t\t\t\tMIA \n</b>\t\t\t(laughs)\n\t\tJonas! The other man is my husband. His name is \n\t\tJof.\n<b> \n</b><b>\t\t\t\tKNIGHT \n</b>\t\tOh, that one.\n\n<b>\t\t\t\tMIA \n</b>\t\tAnd now there's only him and me. We'll have to \n\t\tstart doing tricks again and that's more \n\t\ttrouble than it's worth. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tDo you do tricks also?\n\n<b>\t\t\t\tMIA \n</b>\t\tWe certainly do. And Jof is a very skillful \n\t\tjuggler.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tIs Mikael going to be an acrobat? \n\n<b>\t\t\t\tMIA \n</b>\t\tJof wants him to be. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tBut you don't.\n\n<b>\t\t\t\tMIA \n</b>\t\tI don't know.\n\t\t\t(smiling)\n\t\tPerhaps he'll become a knight. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tLet me assure you, that's no pleasure either. \n\n<b>\t\t\t\tMIA \n</b>\t\tNo, you don't look so happy. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tNo.\n\n<b>\t\t\t\tMIA \n</b>\t\tAre you tired? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tYes. \n\n<b>\t\t\t\tMIA \n</b>\t\tWhy?\n<b> \n</b><b>\t\t\t\tKNIGHT \n</b>\t\tI have dull company. \n\n<b>\t\t\t\tMIA \n</b>\t\tDo you mean your squire? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tNo, not him.\n\n<b>\t\t\t\tMIA \n</b>\t\tWho do you mean, then? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tMyself. \n\n<b>\t\t\t\tMIA \n</b>\t\tI understand. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tDo you, really?\n<b> \n</b><b>\t\t\t\tMIA \n</b>\t\tYes, I understand rather well. I have often \n\t\twondered why people torture themselves as often \n\t\tas they can. Isn't that so?\n\nShe nods energetically and the KNIGHT smiles seriously. Now the shrieks and \nthe noise from the inn become louder. Black figures flicker across the grass \nmound. Someone collapses, gets up and runs. It is JOF. MIA stretches out her \narms and receives him. He holds his hands in front of his face, moaning like \na child, and his body sways. He kneels. MIA holds him close to her and \nsprinkles him with small, anxious questions: What have you done? How are you?\nWhat is it? Does it hurt? What can I do? Have they been cruel to you? She \nruns for a rag, which she dips in water, and carefully bathes her husband's\ndirty, bloody face.\n<b> \n</b>Eventually a rather sorrowful visage emerges. Blood runs from a bruise on his \nforehead and his nose, and a tooth has been loosened, but otherwise JOF seems \nunhurt. \n\n<b>\t\t\t\tJOF \n</b>\t\tOuch, it hurts.\n\n<b>\t\t\t\tMIA\n</b>\t\tWhy did you have to go there? And of course you \n\t\tdrank.\n\nMIA's anxiety has been replaced by a mild anger. She pats him a little harder \nthan necessary. \n\n<b>\t\t\t\tJOF \n</b>\t\tOuch! I didn't drink anything.\n\n<b>\t\t\t\tMIA\n</b>\t\tThen I suppose you were boasting about the \n\t\tangels and devils you consort with. People \n\t\tdon't like someone who has too many ideas and \n\t\tfantasies.\n\n<b>\t\t\t\tJOF \n</b>\t\tI swear to you that I didn't say a word about \n\t\tangels. \n\n<b>\t\t\t\tMIA\n</b>\t\tYou were, of course, busy singing and dancing. \n\t\tYou can never stop being an actor. People also \n\t\tbecome angry at that, and you know it.\n\nJOF doesn't answer but searches for the armlet. He holds it up in front of \nMIA with an injured expression. \n\n<b>\t\t\t\tJOF \n</b>\t\tLook what I bought for you. \n\n<b>\t\t\t\tMIA \n</b>\t\tYou couldn't afford it. \n\n<b>\t\t\t\tJOF \n</b>\t\t\t(angry)\n\t\tBut I got it anyhow.\n\nThe armlet glitters faintly in the twilight. MIA now pulls it across her \nwrist. They look at it in silence, and their faces soften. They look at each \nother, touch each other's hands. JOF puts his head against MIA'S shoulder and \nsighs.\n\n<b>\t\t\t\tJOF \n</b>\t\tOh, how they beat me.\n\n<b>\t\t\t\tMIA \n</b>\t\tWhy didn't you beat them back?\n\n<b>\t\t\t\tJOF \n</b>\t\tI only become frightened and angry. I never get \n\t\ta chance to hit back. I can get angry, you know \n\t\tthat. I roared like a lion.\n\n<b>\t\t\t\tMIA\n</b>\t\tWere they frightened? \n\n<b>\t\t\t\tJOF \n</b>\t\tNo, they just laughed.\n\nTheir son MIKAEL crawls over to them. JOF lies down on the ground and pulls \nhis son on top of him. MIA gets down on her hands and knees and playfully \nsniffs at MIKAEL.\n\n<b>\t\t\t\tMIA \n</b>\t\tDo you notice how good he smells?\n\n<b>\t\t\t\tJOF \n</b>\t\tAnd he is so compact to hold. You're a sturdy \n\t\tone. A real acrobat's body.\n\nHe lifts MIKAEL up and holds him by the legs. MIA looks up suddenly, \nremembering the knight's presence. \n\n<b>\t\t\t\tMIA \n</b>\t\tYes, this is my husband, Jof. \n\n<b>\t\t\t\tJOF \n</b>\t\tGood evening. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tGood evening.\n<b> \n</b>JOF becomes a little embarrassed and rises. All three of them look at one \nanother silently.\n<b> \n</b><b>\t\t\t\tKNIGHT \n</b>\t\tI have just told your wife that you have a \n\t\tsplendid son. He'll bring great joy to you. \n\n<b>\t\t\t\tJOF \n</b>\t\tYes, he's fine.\n<b>     \n</b>They become silent again.\n<b> \n</b><b>\t\t\t\tJOF \n</b>\t\tHave we nothing to offer the knight, Mia? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tThank you, I don't want anything.\n\n<b>\t\t\t\tMIA \n</b>\t\t\t(housewifely)\n\t\tI picked a basket of wild strawberries this \n\t\tafternoon. And we have a drop of milk fresh \n\t\tfrom a cow ... \n\n<b>\t\t\t\tJOF \n</b>\t\t... that we were allowed to milk. So, if you \n\t\twould like to partake of this humble fare, it \n\t\twould be a great honor. \n\n<b>\t\t\t\tMIA \n</b>\t\tPlease be seated and I'll bring the food. \n\nThey sit down. MIA disappears with MIKAEL. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tWhere are you going next? \n\n<b>\t\t\t\tJOF \n</b>\t\tUp to the saints' feast at Elsinore. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI wouldn't advise you to go there. \n\n<b>\t\t\t\tJOF \n</b>\t\tWhy not, if I may ask?\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tThe plague has spread in that direction, \n\t\tfollowing the coast line south. It's said that \n\t\tpeople are dying by the tens of thousands.\n\n<b>\t\t\t\tJOF \n</b>\t\tReally! Well, sometimes life is a little hard. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tMay I suggest ... \n\t\t\t(JOF looks at him, surprised)\n \t\t... that you follow me through the forest \n\t\ttonight and stay at my home if you like. Or go \n\t\talong the east coast. You'll probably be safer \n\t\tthere.\n\nMIA has returned with a bowl of wild strawberries and the milk, places it \nbetween them and gives each of them a spoon.\n\n<b>\t\t\t\tJOF \n</b>\t\tI wish you good appetite. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI humbly thank you.\n\n<b>\t\t\t\tMIA \n</b>\t\tThese are wild strawberries from the forest. I \n\t\thave never seen such large ones. They grow up \n\t\tthere on the hillside. Notice how they smell!\n\nShe points with a spoon and smiles. The KNIGHT nods, as if he were pondering \nsome profound thought. JOF eats heartily.\n\n<b>\t\t\t\tJOF \n</b>\t\tYour suggestion is good, but I must think it \n\t\tover. \n\n<b>\t\t\t\tMIA \n</b>\t\tIt might be wise to have company going through \n\t\tthe forest. It's said to be full of trolls and \n\t\tghosts and bandits. That's what I've heard.\n\n<b>\t\t\t\tJOF \n</b>\t\t\t(staunchly)\n\t\tYes, I'd say that it's not a bad idea, but I \n\t\thave to think about it. Now that Skat has left, \n\t\tI am responsible for the troupe. After all, I \n\t\thave become director of the whole company.\n\n<b>\t\t\t\tMIA \n</b>\t\t\t(mimics) \n\t\tAfter all, I have become director of the whole \n\t\tcompany.\n\nJONS comes walking slowly down the hill, closely followed by the GIRL. MIA \npoints with her spoon. \n\n<b>\t\t\t\tMIA \n</b>\t\tDo you want some strawberries?\n\n<b>\t\t\t\tJOF \n</b>\t\tThis man saved my life. Sit down, my friend, \n\t\tand let us be together.\n\n<b>\t\t\t\tMIA \n</b>\t\t\t(stretches herself) \n\t\tOh, how nice this is. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tFor a short while.\n<b> \n</b><b>\t\t\t\tMIA \n</b>\t\tNearly always. One day is like another. There \n\t\tis nothing strange about that. The summer, of \n\t\tcourse, is better than the winter, because in \n\t\tsummer you don't have to be cold. But spring is \n\t\tbest of all.\n\n<b>\t\t\t\tJOF \n</b>\t\tI have written a poem about the spring. Perhaps \n\t\tyou'd like to hear it. I'll run and get my lyre. \n\nHe sprints towards the wagon.\n<b> \n</b><b> \t\t\t\tMIA \n</b>\t\tNot now, Jof. Our guests may not be amused by \n\t\tyour songs.\n\n<b>\t\t\t\tJONS \n</b>\t\t\t(politely) \n\t\tBy all means. I write little songs myself. For \n\t\texample, I know a very funny song about a \n\t\twanton fish which I doubt that you've heard yet. \n\nThe KNIGHT looks at him.\n\n<b>\t\t\t\tJONS \n</b>\t\tYou'll not get to hear it either. There are \n\t\tpersons here who don't appreciate my art and I \n\t\tdon't want to upset anyone. I'm a sensitive \n\t\tsoul.\n\nJOF has come out with his lyre, sits on a small, gaudy box and plucks at the \ninstrument, humming quietly, searching for his melody. JONS yawns and lies \ndown. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tPeople are troubled by so much.\n\n<b>\t\t\t\tMIA \n</b>\t\tIt's always better when one is two. Have you no \n\t\tone of your own?\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tYes, I think I had someone. \n\n<b>\t\t\t\tMIA \n</b>\t\tAnd what is she doing now? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI don't know.\n\n<b>\t\t\t\tMIA \n</b>\t\tYou look so solemn. Was she your beloved? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tWe were newly married and we played together. \n\t\tWe laughed a great deal. I wrote songs to her \n\t\teyes, to her nose, to her beautiful little \n\t\tears. We went hunting together and at night we \n\t\tdanced. The house was full of life ... \n\n<b>\t\t\t\tMIA \n</b>\t\tDo you want some more strawberries?\n\n<b>\t\t\t\tKNIGHT \n</b>\t\t\t(shakes his head)\n\t\tFaith is a torment, did you know that? It is \n\t\tlike loving someone who is out there in the \n\t\tdarkness but never appears, no matter how \n\t\tloudly you call. \n\n<b>\t\t\t\tMIA \n</b>\t\tI don't understand what you mean.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tEverything I've said seems meaningless and \n\t\tunreal while I sit here with you and your \n\t\thusband. How unimportant it all becomes \n\t\tsuddenly.\n\nHe takes the bowl of milk in his hand and drinks deeply from it several \ntimes. Then he carefully puts it down and looks up, smiling.\n\n<b>\t\t\t\tMIA \n</b>\t\tNow you don't look so solemn.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI shall remember this moment. The silence, the \n\t\ttwilight, the bowls of strawberries and milk,\n\t\tyour faces in the evening light. Mikael \n\t\tsleeping, Jof with his lyre. I'll try to \n\t\tremember what we have talked about. I'll carry \n\t\tthis memory between my hands as carefully as \n\t\tif it were a bowl filled to the brim with fresh \n\t\tmilk. \n\nHe turns his face away and looks out towards the sea and the colorless gray \nsky. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tAnd it will be an adequate sign -- it will be \n\t\tenough for me.\n\nHe rises, nods to the others and walks down towards the forest. JOF continues \nto play on his lyre. MIA stretches out on the grass.\n\nThe KNIGHT picks up his chess game and carries it towards the beach. It is \nquiet and deserted; the sea is still. \n\n<b>\t\t\t\tDEATH \n</b>\t\tI have been waiting for you.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tPardon me. I was detained for a few moments. \n\t\tBecause I revealed my tactics to you, I'm in \n\t\tretreat. It's your move.\n\n<b>\t\t\t\tDEATH \n</b>\t\tWhy do you look so satisfied? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tThat's my secret.\n<b> \n</b><b>\t\t\t\tDEATH \n</b>\t\tOf course. Now I take your knight. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tYou did the right thing. \n\n<b>\t\t\t\tDEATH \n</b>\t\tHave you tricked me?\n<b> \n</b><b>\t\t\t\tKNIGHT \n</b>\t\tOf course. You fell right in the trap. Check! \n\n<b>\t\t\t\tDEATH \n</b>\t\tWhat are you laughing at?\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tDon't worry about my laughter; save your king \n\t\tinstead.\n\n<b>\t\t\t\tDEATH \n</b>\t\tYou're rather arrogant. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tOur game amuses me.\n\n<b>\t\t\t\tDEATH \n</b>\t\tIt's your move. Hurry up. I'm a little pressed \n\t\tfor time.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI understand that you've a lot to do, but you \n\t\tcan't get out of our game. It takes time.\n\nDEATH is about to answer him but stops and leans over the board. The KNIGHT \nsmiles.\n\n<b>\t\t\t\tDEATH \n</b>\t\tAre you going to escort the juggler and his \n\t\twife through the forest? Those whose names are \n\t\tJof and Mia and who have a small son? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tWhy do you ask? \n\n<b>\t\t\t\tDEATH \n</b>\t\tOh, no reason at all.\n<b> \n</b>The KNIGHT suddenly stops smiling. DEATH looks at him scornfully.\n<b> \n</b>\n\nImmediately after sundown, the little company gathers in the yard of the inn.\nThere is the KNIGHT, JONS and the GIRL, JOF and MIA in their wagon. Their \nson, MIKAEL, is already asleep. JONAS SKAT is still missing. \n\nJONS goes into the inn to get provisions for the night journey and to have a \nlast mug of beer. The inn is now empty and quiet except for a few farmhands \nand maidens who are eating their evening meal in a corner. At one of the \nsmall windows sits a lonely, hunched-over fellow, with a jug of brandy in his \nhands. His expression is very sad. Once in a while he is shaken by a gigantic \nsob. It is PLOG, the smith, who sits there and whimpers. \n\n<b>\t\t\t\tJONS \n</b>\t\tGod in heaven, isn't this Plog, the smith? \n\n<b>\t\t\t\tPLOG \n</b>\t\tGood evening.\n\n<b>\t\t\t\tJONS \n</b>\t\tAre you sitting here sniveling in loneliness? \n\n<b>\t\t\t\tPLOG \n</b>\t\tYes, yes, look at the smith. He moans like a \n\t\trabbit. \n\n<b>\t\t\t\tJONS \n</b>\t\tIf I were in your boots, I'd be happy to get \n\t\trid of a wife in such an easy way.\n\nJONS pats the smith on the back, quenches his thirst with beer, and sits down \nby his side. \n\n<b>\t\t\t\tPLOG \n</b>\t\tAre you married?\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tI! A hundred times and more. I can't keep count \n\t\tof all my wives any longer. But it's often that \n\t\tway when you're a traveling man.\n\n<b>\t\t\t\tPLOG \n</b>\t\tI can assure you that one wife is worse than a \n\t\thundred, or else I've had worse luck than any \n\t\tpoor wretch in this miserable world, which \n\t\tisn't impossible.\n\n<b>\t\t\t\tJONS \n</b>\t\tYes, it's hell with women and hell without \n\t\tthem. So, however you look at it, it's still \n\t\tbest to kill them off while it's most amusing.\n<b> \n</b><b>\t\t\t\tPLOG \n</b>\t\tWomen's nagging, the shrieking of children and \n\t\twet diapers, sharp nails and sharp words, blows \n\t\tand pokes, and the devil's aunt for a \n\t\tmother-in-law. And then, when one wants to \n\t\tsleep after a long day, there's a new song -- \n\t\ttears, whining and moans loud enough to wake \n\t\tthe dead. \n\nJONS nods delightedly. He has drunk deeply and talks with an old woman's \nvoice. \n\n<b>\t\t\t\tJONS \n</b>\t\tWhy don't you kiss me good night?\n\n<b>\t\t\t\tPLOG \n</b>\t\t\t(in the same way)\n\t\tWhy don't you sing a song for me? \n\n<b>\t\t\t\tJONS \n</b>\t\tWhy don't you love me the way you did when we \n\t\tfirst met?\n\n<b>\t\t\t\tPLOG \n</b>\t\tWhy don't you look at my new slip? \n\n<b>\t\t\t\tJONS \n</b>\t\tYou only turn your back and snore. \n\n<b>\t\t\t\tPLOG \n</b>\t\tOh hell!\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tOh hell. And now she's gone. Rejoice!\n<b> \n</b><b>\t\t\t\tPLOG \n</b>\t\t\t(furious) \n\t\tI'll snip their noses with pliers, I'll bash in \n\t\ttheir chests with a small hammer, I'll tap \n\t\ttheir heads ever so lightly with a sledge.\n\nPLOG begins to cry loudly and his whole body sways in an enormous attack of \nsorrow. JONS looks at him with interest.\n\n<b>\t\t\t\tJONS\n</b>\t\tLook how he howls again. \n\n<b>\t\t\t\tPLOG \n</b>\t\tMaybe I love her.\n\n<b>\t\t\t\tJONS \n</b>\t\tSo, maybe you love her! Then, you poor \n\t\tmisguided ham shank, I'll tell you that love is \n\t\tanother word for lust, plus lust, plus lust \n\t\tand a damn lot of cheating, falseness, lies and \n\t\tall kinds of other fooling around. \n\n<b>\t\t\t\tPLOG\n</b>\t\tYes, but it hurts anyway.\n\n<b>\t\t\t\tJONS \n</b>\t\tOf course. Love is the blackest of all plagues, \n\t\tand if one could die of it, there would be \n\t\tsome pleasure in love. But you almost always \n\t\tget over it. \n\n<b>\t\t\t\tPLOG\n</b>\t\tNo, no, not me.\n\n<b>\t\t\t\tJONS \n</b>\t\tYes, you too. There are only a couple of poor \n\t\twretches who die of love once in a while. Love \n\t\tis as contagious as a cold in the nose. It eats \n\t\taway at your strength, your independence, your \n\t\tmorale, if you have any. If everything is \n\t\timperfect in this imperfect world, love is most \n\t\tperfect in its perfect imperfection.\n\n<b>\t\t\t\tPLOG \n</b>\t\tYou're happy, you with your oily words, and, \n\t\tbesides, you believe your own drivel.\n\n<b>\t\t\t\tJONS \n</b>\t\tBelieve! Who said that I believed it? But I \n\t\tlove to give good advice. If you ask me for \n\t\tadvice you'll get two pieces for the price of \n\t\tone, because after all I really am an educated \n\t\tman.\n\nJONS gets up from the table and strokes his face with his hands. PLOG becomes \nvery unhappy and grabs his belt. \n\n<b>\t\t\t\tPLOG \n</b>\t\tListen, J\u0088ns. May I go with you through the \n\t\tforest? I'm so lonely and don't want to go home \n\t\tbecause everyone will laugh at me.\n\n<b>\t\t\t\tJONS \n</b>\t\tOnly if you don't whimper all the time, because \n\t\tin that case we'll all have to avoid you.\n\nPLOG gets up and embraces JONS. Slightly drunk, the two new friends walk \ntowards the door.\n<b> \n</b>When they come out in the yard, JOF immediately catches sight of them, \nbecomes angry and yells a warning to JONS.\n<b> \n</b><b>\t\t\t\tJOF \n</b>\t\tJ\u0088ns! Watch out. That one wants to fight all \n\t\tthe time. He's not quite sane.\n\n<b>\t\t\t\tJONS \n</b>\t\tYes, but now he's just sniveling.\n\nPLOG steps up to JOF, who blanches with fear. PLOG offers his hand.\n\n<b>\t\t\t\tPLOG \n</b>\t\tI'm really sorry if I hurt you. But I have \n\t\tsuch a hell of a temper, you know. Shake hands.\n\nJOF gingerly proffers a frightened hand and gets it thoroughly shaken and \nsqueezed. While JOF tries to straighten out his fingers, PLOG is seized by \ngreat good will and opens his arms.\n\n<b>\t\t\t\tPLOG \n</b>\t\tCome in my arms, little brother.\n\n<b>\t\t\t\tJOF \n</b>\t\tThank you, thank you, perhaps later. But now \n\t\twe're really in a hurry.\n\nJOF climbs up on the wagon seat quickly and clucks at the horse.\n<b> \n</b>\n\nThe small company is on its way towards the forest and the night.\n\nIt is dark in the forest.\n<b> \n</b>First comes the KNIGHT on his large horse. Then JOF and MIA follow, sitting \nclose to each other in the juggler's wagon. MIA holds her son in her arms. \nJONS follows them with his heavily laden horse. He has the smith in tow. The \nGIRL sits on top of the load on the horse's back, hunched over as if asleep.\n\nThe footsteps, the horses' heavy tramp on the soft path, the human breathing \n-- yet it is quiet.\n<b> \n</b>Then the moon sails out of the clouds. The forest suddenly becomes alive with \nthe night's unreality. The dazzling light pours through the thick foliage of \nthe beech trees, a moving, quivering world of light and shadow.\n\nThe wanderers stop. Their eyes are dark with anxiety and foreboding. Their \nfaces are pale and unreal in the floating light. It is very quiet.\n\n<b>\t\t\t\tPLOG\n</b>\t\tNow the moon has come out of the clouds. \n\n<b>\t\t\t\tJONS \n</b>\t\tThat's good. Now we can see the road better. \n\n<b>\t\t\t\tMIA \n</b>\t\tI don't like the moon tonight. \n\n<b>\t\t\t\tJOF \n</b>\t\tThe trees stand so still.\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tThat's because there's no wind. \n\n<b>\t\t\t\tPLOG \n</b>\t\tI guess he means that they stand very still. \n\n<b>\t\t\t\tJOF \n</b>\t\tIt's completely quiet.\n\n<b>\t\t\t\tJONS \n</b>\t\tIf one could hear a fox at least. \n\n<b>\t\t\t\tJOF \n</b>\t\tOr an owl.\n\n<b>\t\t\t\tJONS \n</b>\t\tOr a human voice besides one's own.\n\n<b>\t\t\t\tGIRL\n</b>\t\tThey say it's dangerous to remain standing in \n\t\tmoonlight.\n\nSuddenly, out of the silence and the dim light falling across the forest \nroad, a ghostlike cart emerges. It is the WITCH being taken to the place \nwhere she will be burned. Next to her eight soldiers shuffle along tiredly, \ncarrying their lances on their backs. The girl sits in the cart, bound with \niron chains around her throat and arms. She stares fixedly into the \nmoonlight.\n<b> \n</b>A black figure sits next to her, a monk with his hood pulled down over his \nhead. \n\n<b>\t\t\t\tJONS \n</b>\t\tWhere are you going? \n\n<b>\t\t\t\tSOLDIER\n</b>\t\tTo the place of execution.\n\n<b>\t\t\t\tJONS \n</b>\t\tYes, now I can see. It's the girl who has done \n\t\tit with the Black One. The witch?\n\nThe SOLDIER nods sourly. Hesitantly, the travelers follow. The KNIGHT guides \nhis horse over to the side of the cart. The WITCH seems to be half-conscious, \nbut her eyes are wide open.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI see that they have hurt your hands.\n\nThe WITCH'S pale, childish face turns towards the KNIGHT and she shakes her \nhead. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI have a potion that will stop your pain.\n\nShe shakes her head again.\n<b> \n</b><b>\t\t\t\tJONS \n</b>\t\tWhy do you burn her at this time of night? \n\t\tPeople have so few diversions these days.\n<b> \n</b><b>\t\t\t\tSOLDIER \n</b>\t\tSaints preserve us, be quiet! It's said that \n\t\tshe brings the Devil with her wherever she \n\t\tgoes. \n\n<b>\t\t\t\tJONS \n</b>\t\tYou are eight brave men, then.\n\n<b>\t\t\t\tSOLDIER \n</b>\t\tWell, we've been paid. And this is a volunteer \n\t\tjob. \n\nThe SOLDIER speaks in whispers while glancing anxiously at the WITCH.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\t\t(to the WITCH)\n\t\tWhat's your name? \n\n<b>\t\t\t\tTYAN\n</b>\t\tMy name is Tyan, my lord. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tHow old are you? \n\n<b>\t\t\t\tTYAN\n</b>\t\tFourteen, my lord.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tAnd is it true that you have been in league \n\t\twith the Devil?\n\nTYAN nods quietly and looks away. Now they arrive at the parish border. At \nthe foot of the nearby hills lies a crossroads. The pyre has already been \nstacked in the center of the forest clearing. The travelers remain there, \nhesitant and curious.\n<b> \n</b>The soldiers have tied up the cart horse and bring out two long wooden beams.\nThey nail rungs across the beams so that it looks like a ladder. TYAN will be \nbound to this like an eelskin stretched out to dry.\n\nThe sound of the hammering echoes through the forest. The KNIGHT has \ndismounted and walks closer to the cart. Again he tries to catch TYAN'S eyes, \ntouches her very lightly as if to waken her. Slowly she turns her face \ntowards him.\n<b> \n</b><b>\t\t\t\tKNIGHT \n</b>\t\tThey say that you have been in league with the \n\t\tDevil.\n\n<b>\t\t\t\tTYAN\n</b>\t\tWhy do you ask?\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tNot out of curiosity, but for very personal \n\t\treasons. I too want to meet him. \n\n<b>\t\t\t\tTYAN \n</b>\t\tWhy?\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI want to ask him about God. He, if anyone, \n\t\tmust know.\n\n<b>\t\t\t\tTYAN \n</b>\t\tYou can see him anytime. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tHow?\n\n<b>\t\t\t\tTYAN \n</b>\t\tYou must do as I tell you.\n\nThe KNIGHT grips the wooden rail of the cart so tightly that his knuckles \nwhiten. TYAN leans forward and joins her gaze with his. \n\n<b>\t\t\t\tTYAN \n</b>\t\tLook into my eyes.\n\nThe KNIGHT meets her gaze. They stare at each other for a long time.\n\n<b>\t\t\t\tTYAN \n</b>\t\tWhat do you see? Do you see him?\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI see fear in your eyes, an empty, numb fear. \n\t\tBut nothing else.\n\nHe falls silent. The soldiers work at the stakes; their hammering echoes in \nthe forest. \n\n<b>\t\t\t\tTYAN \n</b>\t\tNo one, nothing, no one? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\t\t(shakes his head)\n\t\tNo.\n\n<b>\t\t\t\tTYAN\n</b>\t\tCan't you see him behind your back? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\t\t(looks around) \n\t\tNo, there is no one there. \n\n<b>\t\t\t\tTYAN \n</b>\t\tBut he is with me everywhere. I only have to \n\t\tstretch out my hand and I can feel his hand. He \n\t\tis with me now too. The fire won't hurt me. He \n\t\twill protect me from everything evil.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tHas he told you this? \n\n<b>\t\t\t\tTYAN \n</b>\t\tI know it.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tHas he said it?\n\n<b>\t\t\t\tTYAN \n</b>\t\tI know it, I know it. You must see him \n\t\tsomewhere, you must. The priests had no \n\t\tdifficulty seeing him, nor did the soldiers. \n\t\tThey are so afraid of him that they don't even \n\t\tdare touch me.\n\nThe sounds of the hammers stops. The soldiers stand like black shadows rooted \nin the moss. They fumble with the chains and pull at the neck iron. TYAN \nmoans weakly, as if she were far away.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tWhy have you crushed her hands? \n\n<b>\t\t\t\tSOLDIER\n</b>\t\t\t(surly) \n\t\tWe didn't do it. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tWho did? \n\n<b>\t\t\t\tSOLDIER\n</b>\t\tAsk the monk.\n\nThe soldiers pull the iron and the chains. TYAN'S shaven head sways, gleaming \nin the moonlight. Her blackened mouth opens as if to scream, but no sound \nemerges. They take her down from the cart and lead her towards the ladder and \nthe stake. The KNIGHT turns to the MONK, who remains seated in the cart. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tWhat have you done with the child? \n\nDEATH turns around and looks at him. \n\n<b>\t\t\t\tDEATH \n</b>\t\tDon't you ever stop asking questions? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tNo, I'll never stop.\n\nThe soldiers chain TYAN to the rungs of the ladder. She submits resignedly, \nmoans weakly like an animal and tries to ease her body into position.\n<b> \n</b>When they have fastened her, they walk over to light the pyre. The KNIGHT \nsteps up and leans over her. \n\n<b>\t\t\t\tJONS \n</b>\t\tFor a moment I thought of killing the soldiers, \n\t\tbut it would do no good. She's nearly dead \n\t\talready. \n\nOne of the soldiers approaches. Thick smoke wells down from the pyre and \nsweeps over the quiet shadows near the crossroads and the hill.\n\n<b>\t\t\t\tSOLDIER\n</b>\t\tI've told you to be careful. Don't go too close \n\t\tto her.\n\nThe KNIGHT doesn't heed this warning. He cups his hand, fills it with water \nfrom the skin and gives it to TYAN. Then he gives her a potion.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tTake this and it will stop the pain.\n\nSmoke billows down over them and they begin to cough. The soldiers step \nforward and raise the ladder against a nearby fir tree. TYAN hangs there \nmotionlessly, her eyes wide open.\n\nThe KNIGHT straightens up and stands immobile. JONS is behind him, his voice \nnearly choked with rage. \n\n<b>\t\t\t\tJONS \n</b>\t\tWhat does she see? Can you tell me? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\t\t(shakes his head) \n\t\tShe feels no more pain. \n\n<b>\t\t\t\tJONS \n</b>\t\tYou don't answer my question. Who watches over \n\t\tthat child? Is it the angels, or God, or the \n\t\tDevil, or only the emptiness? Emptiness, my \n\t\tlord!\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tThis cannot be.\n\n<b>\t\t\t\tJONS \n</b>\t\tLook at her eyes, my lord. Her poor brain has \n\t\tjust made a discovery. Emptiness under the \n\t\tmoon. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tNo.\n\n<b>\t\t\t\tJONS \n</b>\t\tWe stand powerless, our arms hanging at our \n\t\tsides, because we see what she sees, and our \n\t\tterror and hers are the same. \n\t\t\t(an outburst) \n\t\tThat poor little child. I can't stand it, I \n\t\tcan't stand it ...\n\nHis voice sticks in his throat and he suddenly walks away. The KNIGHT mounts\nhis horse. The travelers depart from the crossroads. TYAN finally closes her \neyes.\n<b> \n</b>\n\nThe forest is now very dark. The road winds between the trees. The wagon \nsqueaks and rattles over stones and roots. A bird suddenly shrieks.\n<b> \n</b>JOF lifts his head and wakes up. He has been asleep with his arms around \nMIA's shoulders. The KNIGHT is sharply silhouetted against the tree trunks.\n\nHis silence makes him seem almost unreal. JONS and PLOG are slightly drunk \nand support each other. Suddenly PLOG has to sit down. He puts his hands over \nhis face and howls piteously. \n\n<b>\t\t\t\tPLOG \n</b>\t\tOh, now it came over me again! \n\n<b>\t\t\t\tJONS \n</b>\t\tDon't scream. What came over you?\n\n<b>\t\t\t\tPLOG \n</b>\t\tMy wife, damn it. She is so beautiful. She is \n\t\tso beautiful that she can't be described \n\t\twithout the accompaniment of a lyre.\n\n<b>\t\t\t\tJONS \n</b>\t\tNow it starts again.\n\n<b>\t\t\t\tPLOG \n</b>\t\tHer smile is like brandy. Her eyes like \n\t\tblackberries ...\n\nPLOG searches for beautiful words. He gestures gropingly with his large \nhands.\n\n<b>\t\t\t\tJONS \n</b>\t\t\t(sighs) \n\t\tGet up, you tear-drenched pig. We'll lose the \n\t\tothers.\n\n<b>\t\t\t\tPLOG \n</b>\t\tYes, of course, of course. Her nose is like a \n\t\tlittle pink potato; her behind is like a juicy \n\t\tpear -- yes, the whole woman is like a \n\t\tstrawberry patch. I can see her in front of me, \n\t\twith arms like wonderful cucumbers.\n\n<b>\t\t\t\tJONS \n</b>\t\tSaints almighty, stop! You're a very bad poet, \n\t\tdespite the fact that you're drunk. And your \n\t\tvegetable garden bores me.\n\nThey walk across an open meadow. Here it is a little brighter and the moon \nshimmers behind a thin sky. Suddenly PLOG points a large finger towards the \nedge of the forest. \n\n<b>\t\t\t\tPLOG \n</b>\t\tLook there.\n\n<b>\t\t\t\tJONS \n</b>\t\tDo you see something? \n\n<b>\t\t\t\tPLOG \n</b>\t\tThere, over there! \n\n<b>\t\t\t\tJONS \n</b>\t\tI don't see anything.\n\n<b>\t\t\t\tPLOG \n</b>\t\tHang on to something, my friends. The hour is \n\t\tnear! Who is that at the edge of the forest if \n\t\tnot my own dearly beloved, with actor attached?\n\nThe two lovers discover PLOG and it's too late. They cannot retreat. SKAT \nimmediately takes to his heels. PLOG chases him, swinging his sledge and \nbellowing like a wild boar.\n\nFor a few confusing moments the two rivals stumble among the stones and \nbushes in the gray gloom of the forest. The duel begins to look senseless, \nbecause both of them are equally frightened.\n\nThe travelers silently observe this confused performance. LISA screams once \nin a while, more out of duty than out of impulse.\n\n<b>\t\t\t\tSKAT \n</b>\t\t\t(panting) \n\t\tYou miserable stubbleheaded bastard of seven \n\t\tscurvy bitches, if I were in your lousy rags I \n\t\twould be stricken with such eternal shame about \n\t\tmy breath, my voice, my arms and legs -- in \n\t\tshort, about my whole body -- that I would \n\t\timmediately rid nature of my own embarrassing \n\t\tself. \n\n<b>\t\t\t\tPLOG \n</b>\t\t\t(angry) \n\t\tWatch out, you perfumed slob, that I don't fart \n\t\ton you and immediately blow you down to the \n\t\tactor's own red-hot hell, where you can sit and \n\t\trecite monologues to each other until the dust \n\t\tcomes out of the Devil's ears. \n\nThen LISA throws herself around her husband's neck. \n\n<b>\t\t\t\tLISA \n</b>\t\tForgive me, dear little husband, I'll never do \n\t\tit again. I am so sorry and you can't imagine \n\t\thow terribly that man over there betrayed me. \n\n<b>\t\t\t\tPLOG \n</b>\t\tI'll kill him anyway.\n\n<b>\t\t\t\tLISA \n</b>\t\tYes, do that, just kill him. He isn't even a \n\t\thuman being.\n\n<b>\t\t\t\tJONS \n</b>\t\tHell, he's an actor.\n\n<b>\t\t\t\tLISA \n</b>\t\tHe is only a false beard, false teeth, false \n\t\tsmiles, rehearsed lines, and he's as empty as a \n\t\tjug. Just kill him. \n\nLISA sobs with excitement and sorrow. PLOG looks around, a little confused. \nSKAT uses this opportunity. He pulls out a dagger and places the point \nagainst his breast.\n\n<b>\t\t\t\tSKAT \n</b>\t\tShe's right. Just kill me. If you thought that \n\t\tI was going to apologize for being what I am, \n\t\tyou are mistaken. \n\n<b>\t\t\t\tLISA \n</b>\t\tLook how sickening he is. How he makes a fool \n\t\tof himself, how he puts on an act. Dear Plog, \n\t\tkill him. \n\n<b>\t\t\t\tSKAT \n</b>\t\tMy friends, you have only to push, and my \n\t\tunreality will soon be transformed into a new, \n\t\tsolid reality. An absolutely tangible corpse.\n\n<b>\t\t\t\tLISA \n</b>\t\tDo something then. Kill him.\n\n<b>\t\t\t\tPLOG \n</b>\t\t\t(embarrassed) \n\t\tHe has to fight me, otherwise I can't kill him.\n\n<b>\t\t\t\tSKAT \n</b>\t\tYour life's thread now hangs by a very ragged \n\t\tshred. Idiot, your day is short.\n\n<b>\t\t\t\tPLOG \n</b>\t\tYou'll have to irritate me a little more to get \n\t\tme as angry as before.\n\nSKAT looks at the travelers with a pained expression and then lifts his eyes \ntowards the night sky. \n\n<b>\t\t\t\tSKAT \n</b>\t\tI forgive all of you. Pray for me sometimes. \n\nSKAT sinks the dagger into his breast and slowly falls to the ground. The \ntravelers stand confused. PLOG rushes forward and begins to pull at SKAT'S hands. \n\n<b>\t\t\t\tPLOG \n</b>\t\tOh dear, dear, I didn't mean it that way! Look, \n\t\tthere's no life left in him. I was beginning to \n\t\tlike him, and in my opinion Lisa was much too \n\t\tspiteful. \n\nJOF leans over his colleague.\n\n<b>\t\t\t\tJOF \n</b>\t\tHe's dead, totally, enormously dead. In fact, \n\t\tI've never seen such a dead actor.\n\n<b>\t\t\t\tLISA \n</b>\t\tCome on, let's go. This is nothing to mourn \n\t\tover. He has only himself to blame.\n\n<b>\t\t\t\tPLOG \n</b>\t\tAnd I have to be married to her. \n\n<b>\t\t\t\tJONS \n</b>\t\tWe must go on.\n\nSKAT lies in the grass and keeps the dagger pressed tightly to his breast. \nThe travelers depart and soon they have disappeared into the dark forest on \nthe other side of the meadow. When SKAT is sure that no one can see him, he \nsits up and lifts the dagger from his breast. It is a stage dagger with a \nblade that pushes into the handle. SKAT laughs to himself.\n\n<b>\t\t\t\tSKAT \n</b>\t\tNow that was a good scene. I'm really a good \n\t\tactor. After all, why shouldn't I be a little \n\t\tpleased with myself? But where shall I go? I'll \n\t\twait until it becomes light and then I'll find \n\t\tthe easiest way out of the forest. I'll climb \n\t\tup a tree for the time being so that no bears, \n\t\twolves or ghosts can get at me.\n\nHe soon finds a likely tree and climbs up into its thick foliage. He sits \ndown as comfortably as possible and reaches for his food pouch.\n\n<b>\t\t\t\tSKAT \n</b>\t\t\t(yawns) \n\t\tTomorrow I'll find Jof and Mia and then we'll \n\t\tgo to the saints' feast in Elsinore. We'll make \n\t\tlots of money there. \n\t\t\t(yawns)\n\t\tNow, I'll sing a little song to myself: \n\t\t\t(sings) \n\t\tI am a little bird \n\t\tWho sings whate'er he will, \n\t\tAnd when I am in danger \n\t\tI fling out a pissing trill \n\t\tAs in the carnal thrill.\n\t\t\t(speaks)\n\t\tIt's boring to be alone in the forest tonight. \n\t\t\t(sings) \n\t\tThe terrible night doesn't frighten me ... \n\nHe interrupts himself and listens. The sound of industrious sawing is heard \nthrough the silence.\n\n<b>\t\t\t\tSKAT \n</b>\t\tWorkmen in the forest. Oh, well! \n\t\t\t(sings)\n\t\tThe terrible night doesn't frighten me ... \n\t\t\t(speaks)\n\t\tHey, what the devil ... it's my tree they're \n\t\tcutting down.\n\nHe peers through the foliage. Below him stands a dark figure diligently \nsawing away at the base of the tree. SKAT becomes frightened and angry.\n<b> \n</b><b>\t\t\t\tSKAT \n</b>\t\tHey, you! Do you hear me, you tricky bastard? \n\t\tWhat are you doing with my tree?\n\nThe sawing continues without a pause. SKAT becomes more frightened.\n\n<b>\t\t\t\tSKAT \n</b>\t\tCan't you at least answer me? Politeness costs \n\t\tso little. Who are you?\n\nDEATH straightens his back and squints up at him. SKAT cries out in terror.\n\n<b>\t\t\t\tDEATH \n</b>\t\tI'm sawing down your tree because your time is\n\t\tup.\n<b>  \n</b><b>\t\t\t\tSKAT\n</b>\t\tIt won't do. I haven't got time.\n\n<b>\t\t\t\tDEATH \n</b>\t\tSo you haven't got time. \n\n<b>\t\t\t\tSKAT \n</b>\t\tNo, I have my performance. \n\n<b>\t\t\t\tDEATH \n</b>\t\tThen it's canceled because of death. \n\n<b>\t\t\t\tSKAT \n</b>\t\tMy contract.\n<b> \n</b><b>\t\t\t\tDEATH \n</b>\t\tYour contract is terminated. \n\n<b>\t\t\t\tSKAT \n</b>\t\tMy children, my family. \n\n<b>\t\t\t\tDEATH \n</b>\t\tShame on you, Skat! \n\n<b>\t\t\t\tSKAT \n</b>\t\tYes, I'm ashamed.\n\nDEATH begins to saw again. The tree creaks. \n\n<b>\t\t\t\tSKAT \n</b>\t\tIsn't there any way to get off? Aren't there \n\t\tany special rules for actors?\n\n<b>\t\t\t\tDEATH \n</b>\t\tNo, not in this case. \n\n<b>\t\t\t\tSKAT \n</b>\t\tNo loopholes, no exceptions? \n\nDEATH saws.\n\n<b>\t\t\t\tSKAT\n</b>\t\tPerhaps you'll take a bribe. \n\nDEATH saws.\n<b> \n</b><b>\t\t\t\tSKAT\n</b>\t\tHelp!\n\nDEATH saws.\n\n<b>\t\t\t\tSKAT \n</b>\t\tHelp! Help!\n\nThe tree falls. The forest becomes silent again.\n<b> \n</b>\n\nNight and then dawn.\n\nThe travelers have come to a sort of clearing and have collapsed on the moss.\nThey lie quietly and listen to their own breathing, their heartbeats, and the \nwind in the tree tops. Here the forest is wild and impenetrable. Huge \nboulders stick up out of the ground like the heads of black giants. A fallen \ntree lies like a mighty barrier between light and shadow.\n\nMIA, JOF and their child have sat down apart from the others. They look at \nthe light of the moon, which is no longer full and dead but mysterious and \nunstable. The KNIGHT sits bent over his chess game. LISA cries quietly behind \nPLOG'S back. JONS lies on the ground and looks up at the heavens.\n\n<b>\t\t\t\tJONS \n</b>\t\tSoon dawn will come, but the heat continues to \n\t\thang over us like a smothering blanket.\n\n<b>\t\t\t\tLISA \n</b>\t\tI'm so frightened.\n\n<b>\t\t\t\tPLOG \n</b>\t\tWe feel that something is going to happen to \n\t\tus, but we don't know what.\n\n<b>\t\t\t\tJONS \n</b>\t\tMaybe it's the day of judgment. \n\n<b>\t\t\t\tPLOG \n</b>\t\tThe day of judgment ...\n\nNow, something moves behind the fallen tree. There is a rustling sound and a \nmoaning cry that seems to come from a wounded animal. Everyone listens\nintently, all faces turned towards the sound. A voice comes out of the\ndarkness. \n\n<b>\t\t\t\tRAVAL \n</b>\t\tDo you have some water?\n\nRAVAL'S perspiring face soon becomes visible. He disappears in the darkness, \nbut his voice is heard again. \n\n<b>\t\t\t\tRAVAL \n</b>\t\tCan't you give me a little water? \n\t\t\t(pause) \n\t\tI have the plague.\n\n<b>\t\t\t\tJONS \n</b>\t\tDon't come here. If you do I'll slit your \n\t\tthroat. Keep to the other side of the tree. \n\n<b>\t\t\t\tRAVEL \n</b>\t\tI'm afraid of death.\n\nNo one answers. There is complete silence. RAVAL gasps heavily for air. The \ndry leaves rustle with his movements. \n\n<b>\t\t\t\tRAVEL \n</b>\t\tI don't want to die! I don't want to!\n<b> \n</b>No one answers. RAVAL'S face appears suddenly at the base of the tree. His \neyes bulge wildly and his mouth is ringed with foam.\n\n<b>\t\t\t\tRAVAL \n</b>\t\tCan't you have pity on me? Help me! At least \n\t\ttalk to me.\n\nNo one answers. The trees sigh. RAVAL begins to cry. \n\n<b>\t\t\t\tRAVAL \n</b>\t\tI am going to die. I. I. I! What will happen to \n\t\tme! Can no one console me? Haven't you any \n\t\tcompassion? Can't you see that I ...\n\nHis words are choked off by a gurgling sound. He disappears in the darkness \nbehind the fallen tree. It becomes quiet for a few moments.\n\n<b>\t\t\t\tRAVAL \n</b>\t\t\t(whispers) \n\t\tCan't anyone ... only a little water. \n\nSuddenly the GIRL gets up with a quick movement, snatches JONS'S water bag \nand runs a few steps. JONS grabs her and holds her fast.\n\n<b>\t\t\t\tJONS \n</b>\t\tIt's no use. It's no use. I know that it's no \n\t\tuse. It's meaningless. It's totally \n\t\tmeaningless. I tell you that it's meaningless. \n\t\tCan't you hear that I'm consoling you? \n\n<b>\t\t\t\tRAVEL \n</b>\t\tHelp me, help me!\n\nNo one answers, no one moves. RAVAL'S sobs are dry and convulsive, like a \nfrightened child's. His sudden scream is cut off in the middle. Then it \nbecomes quiet.\n<b> \n</b>The GIRL sinks down and hides her face in her hands. JONS places his hand on \nher shoulder.\n<b> \n</b>\n<b>16\n</b>The KNIGHT is no longer alone. DEATH has come to him and he raises his hand.\n\n<b>\t\t\t\tDEATH \n</b>\t\tShall we play our game to the end? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tYour move!\n\nDEATH raises his hand and strikes the KNIGHT'S queen. Antonius Block looks at \n<b>DEATH. \n</b>\n<b>\t\t\t\tDEATH \n</b>\t\tNow I take your queen. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tI didn't notice that.\n\nThe KNIGHT leans over the game. The moonlight moves over the chess pieces, \nwhich seem to have a life of their own.\n\nJOF has dozed off for a few moments, but suddenly he wakens. Then he sees the \nKNIGHT and DEATH together. He becomes very frightened and awakens MIA. \n\n<b>\t\t\t\tJOF \n</b>\t\tMia!\n<b> \n</b><b>\t\t\t\tMIA \n</b>\t\tYes, what is it?\n<b> \n</b><b>\t\t\t\tJOF \n</b>\t\tI see something terrible. Something I almost \n\t\tcan't talk about.\n\n<b>\t\t\t\tMIA \n</b>\t\tWhat do you see?\n\n<b>\t\t\t\tJOF \n</b>\t\tThe knight is sitting over there playing chess. \n\n<b>\t\t\t\tMIA \n</b>\t\tYes, I can see that too and I don't think it's \n\t\tso terrible. \n\n<b>\t\t\t\tJOF \n</b>\t\tBut do you see who he's playing with? \n\n<b>\t\t\t\tMIA \n</b>\t\tHe is alone. You mustn't frighten me this way.\n<b> \n</b><b>\t\t\t\tJOF \n</b>\t\tNo, no, he isn't alone. \n\n<b>\t\t\t\tMIA \n</b>\t\tWho is it, then?\n<b> \n</b><b>\t\t\t\tJOF \n</b>\t\tDeath. He is sitting there playing chess with \n\t\tDeath himself.\n\n<b>\t\t\t\tMIA \n</b>\t\tYou mustn't say that. \n\n<b>\t\t\t\tJOF \n</b>\t\tWe must try to escape. \n\n<b>\t\t\t\tMIA \n</b>\t\tOne can't do that.\n\n<b>\t\t\t\tJOF \n</b>\t\tWe must try. They are so occupied with their \n\t\tgame that if we move very quietly, they won't \n\t\tnotice us. \n\nJOF gets up carefully and disappears into the darkness behind the trees. MIA \nremains standing, as if paralyzed by fear. She stares fixedly at the KNIGHT \nand the chess game. She holds her son in her arms. Now JOF returns.\n\n<b>\t\t\t\tJOF \n</b>\t\tI have harnessed the horse. The wagon is \n\t\tstanding near the big tree. You go first and \n\t\tI'll follow you with the packs. See that Mikael \n\t\tdoesn't wake up.\n\nMIA does what JOF has told her. At the same moment, the KNIGHT looks up from\nhis game. \n\n<b>\t\t\t\tDEATH \n</b>\t\tIt is your move, Antonius Block.\n\nThe KNIGHT remains silent. He sees MIA go through the moonlight towards the\nwagon. JOF bends down to pick up the pack and follows at a distance. \n\n<b>\t\t\t\tDEATH \n</b>\t\tHave you lost interest in our game?\n<b> \n</b>The KNIGHT'S eyes become alarmed. DEATH looks at him intently.\n\n<b>\t\t\t\tKNIGHT\n</b>\t\tLost interest? On the contrary.\n\n<b>\t\t\t\tDEATH \n</b>\t\tYou seem anxious. Are you hiding anything? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tNothing escapes you -- or does it? \n\n<b>\t\t\t\tDEATH \n</b>\t\tNothing escapes me. No one escapes from me. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tIt's true that I'm worried.\n\nHe pretends to be clumsy and knocks the chess pieces over with the hem of his \ncoat. He looks up at DEATH. \n\n<b>\t\t\t\tKNIGHT\n</b>\t\tI've forgotten how the pieces stood.\n\n<b>\t\t\t\tDEATH \n</b>\t\t\t(laughs contentedly) \n\t\tBut I have not forgotten. You can't get away \n\t\tthat easily.\n<b> \n</b>DEATH leans over the board and rearranges the pieces. The KNIGHT looks past \nhim towards the road. MIA has just climbed up on the wagon. JOF takes the \nhorse by the bridle and leads it down the road. DEATH notices nothing; he is \ncompletely occupied with reconstructing the game.\n\n<b>\t\t\t\tDEATH \n</b>\t\tNow I see something interesting. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tWhat do you see?\n\n<b>\t\t\t\tDEATH \n</b>\t\tYou are mated on the next move, Antonius Block. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tThat's true.\n\n<b>\t\t\t\tDEATH \n</b>\t\tDid you enjoy your reprieve? \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tYes, I did.\n\n<b>\t\t\t\tDEATH \n</b>\t\tI'm happy to hear that. Now I'll be leaving you. \n\t\tWhen we meet again, you and your companions' \n\t\ttime will be up.\n\n<b>\t\t\t\tKNIGHT \n</b>\t\tAnd you will divulge your secrets. \n\n<b>\t\t\t\tDEATH \n</b>\t\tI have no secrets. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tSo you know nothing. \n\n<b>\t\t\t\tDEATH \n</b>\t\tI have nothing to tell.\n\nThe KNIGHT wants to answer, but DEATH is already gone.\n\nA murmur is heard in the tree tops. Dawn comes, a flickering light without \nlife, making the forest seem threatening and evil. JOF drives over the \ntwisting road. MIA sits beside him. \n\n<b>\t\t\t\tMIA\n</b>\t\tWhat a strange light.\n\n<b>\t\t\t\tJOF \n</b>\t\tI guess it's the thunderstorm which comes with \n\t\tdawn. \n\n<b>\t\t\t\tMIA \n</b>\t\tNo, it's something else. Something terrible. Do \n\t\tyou hear the roar in the forest? \n\n<b>\t\t\t\tJOF \n</b>\t\tIt's probably rain.\n\n<b>\t\t\t\tMIA \n</b>\t\tNo, it isn't rain. He has seen us and he's \n\t\tfollowing us. He has overtaken us; he's coming \n\t\ttowards us. \n\n<b>\t\t\t\tJOF \n</b>\t\tNot yet, Mia. In any case, not yet. \n\n<b>\t\t\t\tMIA \n</b>\t\tI'm so afraid. I'm so afraid.\n\nThe wagon rattles over roots and stones; it sways and creaks. Now the horse \nstops with his ears flat against his head. The forest sighs and stirs \nponderously. \n\n<b>\t\t\t\tJOF \n</b>\t\tGet into the wagon, Mia. Crawl in quickly. \n\t\tWe'll lie down, Mia, with Mikael between us.\n\nThey crawl into the wagon and crouch around the sleeping child.\n\n<b>\t\t\t\tJOF \n</b>\t\tIt is the Angel of Death that's passing over \n\t\tus, Mia. It's the Angel of Death. The Angel of \n\t\tDeath, and he's very big.\n\n<b>\t\t\t\tMIA \n</b>\t\tDo you feel how cold it is? I'm freezing. I'm \n\t\tterribly cold.\n\nShe shivers as if she had a fever. They pull the blankets over them and lie \nclosely together. The wagon canvas flutters and beats in the wind. The roar \noutside is like a giant bellowing.\n<b> \n</b>\n\nThe castle is silhouetted like a black boulder against the heavy dawn. Now\nthe storm moves there, throwing itself powerfully against walls and\nabutments.  The sky darkens; it is almost like night.\n\nAntonius Block has brought his companions with him to the castle. But it\nseems deserted. They walk from room to room. There is only emptiness and\nquiet echoes. Outside, the rain is heard roaring noisily.\n\nSuddenly the KNIGHT stands face to face with his wife. They look at each\nother quietly.\n\n<b>\t\t\t\tKARIN\n</b>\t\tI heard from people who came from the crusade \n\t\tthat you were on your way home. I've been \n\t\twaiting for you here. All the others have fled \n\t\tfrom the plague. \n\nThe KNIGHT is silent. He looks at her. \n\n<b>\t\t\t\tKARIN \n</b>\t\tDon't you recognize me any more? \n\nThe KNIGHT nods, silent. \n\n<b>\t\t\t\tKARIN \n</b>\t\tYou also have changed.\n\nShe walks closer and looks searchingly into his face. The smile lingers in \nher eyes and she touches his hand lightly.\n\n<b>\t\t\t\tKARIN \n</b>\t\tNow I can see that it's you. Somewhere in your \n\t\teyes, somewhere in your face, but hidden and \n\t\tfrightened, is that boy who went away so many \n\t\tyears ago. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tIt's over now and I'm a little tired. \n\n<b>\t\t\t\tKARIN \n</b>\t\tI see that you're tired. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tOver there stand my friends.\n\n<b>\t\t\t\tKARIN \n</b>\t\tAsk them in. They will break the fast with us. \n\nThey all sit down at the table in the room, which is lit by torches on the \nwalls. Silently they eat the hard bread and the salt-darkened meat. KARIN \nsits at the head of the table and reads aloud from a thick book. \n\n<b>\t\t\t\tKARIN \n</b>\t\t\"And when the Lamb broke the seventh seal, \n\t\tthere was silence in heaven for about the space \n\t\tof half an hour. And I saw the seven angels \n\t\twhich stood before God; and to them were given \n\t\tseven trumpets. And another ...\" \n\nThree mighty knocks sound on the large portal. KARIN interrupts her reading \nand looks up from the book. JONS rises quickly and goes to open the door.\n\n<b> \t\t\t\tKARIN \n</b>\t\t\"The first angel sounded, and there followed \n\t\thail and fire mingled with blood, and they were \n\t\tcast upon the earth; and the third part of the \n\t\ttrees was burnt up and all the green grass was \n\t\tburnt up.\"\n\nNow the rain becomes quiet. There is suddenly an immense, frightening silence \nin the large, murky room where the burning torches throw uneasy shadows over \nthe ceiling and the walls. Everyone listens tensely to the stillness.\n\n<b> \t\t\t\tKARIN \n</b>\t\t\"And the second angel sounded, and as it were a \n\t\tgreat mountain burning with fire was cast into \n\t\tthe sea; and a third part of the sea became \n\t\tblood ...\"\n\nSteps are heard on the stairs. JONS returns and sits down silently at his \nplace but does not continue to eat. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tWas someone there? \n\n<b>\t\t\t\tJONS \n</b>\t\tNo, my lord. I saw no one.\n\nKARIN lifts her head for a moment but once again leans over the large book.\n\n<b>\t\t\t\tKARIN \n</b>\t\t\"And the third angel sounded, and there fell a \n\t\tgreat star from heaven, burning as it were a \n\t\ttorch, and it fell upon the third part of the \n\t\trivers and upon the fountains of waters; and \n\t\tthe name of the star is called Wormwood ...\" \n\nThey all lift their heads, and when they see who is coming towards them\nthrough the twilight of the large room, they rise from the table and stand \nclose together. \n\n<b>\t\t\t\tKNIGHT \n</b>\t\tGood morning, noble lord.\n\n<b>\t\t\t\tKARIN \n</b>\t\tI am Karin, the knight's wife, and welcome you \n\t\tcourteously to my house.\n\n<b>\t\t\t\tPLOG \n</b>\t\tI am a smith by profession and rather good at \n\t\tmy trade, if I say so myself. My wife Lisa -- \n\t\tcurtsy for the great lord, Lisa. She's a little \n\t\tdifficult to handle once in a while and we had\n\t\ta little spat, so to speak, but no worse than \n\t\tmost people.\n\nThe KNIGHT hides his face in his hands.\n\n<b>\t\t\t\tKNIGHT\n</b>\t\tFrom our darkness, we call out to Thee, Lord. \n\t\tHave mercy on us because we are small and \n\t\tfrightened and ignorant. \n\n<b>\t\t\t\tJONS \n</b>\t\t\t(bitterly) \n\t\tIn the darkness where You are supposed to be, \n\t\twhere all of us probably are.... In the \n\t\tdarkness You will find no one to listen to Your \n\t\tcries or be touched by Your sufferings. Wash \n\t\tYour tears and mirror Yourself in Your \n\t\tindifference.\n\n<b>\t\t\t\tKNIGHT\n</b> \t\tGod, You who are somewhere, who must be \n\t\tsomewhere, have mercy upon us.\n\n<b>\t\t\t\tJONS \n</b>\t\tI could have given you an herb to purge you of \n\t\tyour worries about eternity. Now it seems to be \n\t\ttoo late. But in any case, feel the immense \n\t\ttriumph of this last minute when you can still \n\t\troll your eyes and move your toes. \n\n<b>\t\t\t\tKARIN \n</b>\t\tQuiet, quiet.\n\n<b>\t\t\t\tJONS \n</b>\t\tI shall be silent, but under protest. \n\n<b>\t\t\t\tGIRL \n</b>\t\t\t(on her knees)\n\t\tIt is the end.\n<b> \n</b>\n\nJOF and MIA sit close together and listen to the rain tapping lightly on the \nwagon canvas, a sound which diminishes until finally there are only single \ndrops. \n\nThey crawl out of their hiding place. The wagon stands on a height above a \nslope, protected by an enormous tree. They look across ridges, forests, the \nwide plains, and the sea, which glistens in the sunlight breaking through the \nclouds.\n<b> \n</b>JOF stretches his arms and legs. MIA dries the wagon seat and sits down next\nto her husband. MIKAEL crawls between JOF'S knees.\n\nA lone bird tests its voice after the storm. The trees and bushes drip. From \nthe sea comes a strong and fragrant wind.\n\nJOF points to the dark, retreating sky where summer lightning glitters like \nsilver needles over the horizon. \n\n<b>\t\t\t\tJOF \n</b>\t\tI see them, Mia! I see them! Over there against \n\t\tthe dark, stormy sky. They are all there. The \n\t\tsmith and Lisa and the knight and Raval and \n\t\tJ\u0088ns and Skat. And Death, the severe master, \n\t\tinvites them to dance. He tells them to hold \n\t\teach other's hands and then they must tread the \n\t\tdance in a long row. And first goes the master \n\t\twith his scythe and hourglass, but Skat dangles \n\t\tat the end with his lyre. They dance away from \n\t\tthe dawn and it's a solemn dance towards the \n\t\tdark lands, while the rain washes their faces \n\t\tand cleans the salt of the tears from their \n\t\tcheeks. \n\nHe is silent. He lowers his hand. His son, MIKAEL, has listened to his words.\nNow, he crawls up to MIA and sits down in her lap. \n\n<b>\t\t\t\tMIA \n</b>\t\t\t(smiling) \n\t\tYou with your visions and dreams.\n<b> \n</b>\n\n\n\n\n\n\nScreenplay by Ingmar Bergman \n<b> \n</b>\n\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Seventh Seal, The</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Ingmar Bergman\" title=\"Scripts by Ingmar Bergman\">Ingmar Bergman</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Seventh Seal, The Script.html#comments\" title=\"Seventh Seal, The comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:15:35.415390"}