{"title": "Sexual Life", "film_link": "/Movie Scripts/Sexual Life Script.html", "script_link": "/scripts/Sexual-Life.html", "info_raw": "\n\nSexual Life Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Ken Kwapis\nGenres  Comedy  Drama\nMovie Release Date : March 2005\n\nRead \"Sexual Life\" Script\n\n\n", "script": "\n\n\n\n                                     SEXUAL LIFE\n\n                                     Written by\n \n                                     Ken Kwapis\n\n   \n\n                                                                   Draft: 08/03\n\n                                \n               FADE IN:\n\n               EXT. CITY SKYLINE - DAY\n\n\n               From an AERIAL VIEW we see the outline of a city.  Any city will \n               do.  Mirrored high rises.  Sprawling apartment complexes.  A \n               lot of people live here...whoever they are.\n \n               As we move closer we discover that this is not a real city at \n               all, but a scale model of one.\n \n               Everything is in miniature -- the buildings, parks, and freeways. \n                GLIDING over this tabletop metropolis, we find that none of \n               the buildings have roofs, allowing us to peak inside.\n \n                                     VARIOUS CLOSE ANGLES\n               We FLOAT through miniature coffee shops, offices, and bedrooms, \n               where toy figures are arranged in tableau of everyday life\n \n               \n               A man dines alone.  A woman walks her dog.  Two kiss on the street. \n                One waits for a bus.\n \n               Over this we HEAR Marianne Faithful's smoky-voiced cover of the \n               standard \"When We're Alone\"\n \n               Just picture a penthouse Way up in the sky, With hinges on chimney \n               For stars to go by, A sweet slice of heaven For just you and \n               I, When we're alone.\n \n               From all of society We'll stay aloof, And live in propriety There \n               on the roof, Two heavenly hermits We'll be in true, When we're \n               alone.\n \n               As the song ends we find a miniature girl who lies on a miniature \n               bed.\n \n                                     CUT TO:\n\n               INT. LORNA'S APARTMENT BEDROOM - DAY\n\n\n               A cramped one-room studio.  Asleep on a futon is a slender girl \n               of nineteen -- LORNA.  Her blood red toenails give the place \n               its only color. An alarm clock rings it's twelve noon.  Lorna \n               uses her foot to turn it off.\n \n                                     LORNA\n               Terri.  Why did you let me sleep so late?\n\n               Lorna looks over to an empty pull-out sofa, its only occupant \n               a skinny kitten.\n \n               LORNA (CONT'D) (cont'd)\n\n               Terri?\n\n               (to the cat)\n\n               She must already be at work, huh?\n\n               The cat meows -- very non-committal.\n\n                                     CUT TO:\n\n               INT. LORNA'S KITCHEN - DAY\n\n\n               Still in her T-shirt and panties, Lorna opens a can of cat food \n               as the kitten looks on.\n \n                                     LORNA\n               She probably forgot what day it is, right Arthur?  Some friend \n               she turned out to be.  Not like you.  You remember what day it \n               is, don't you?\n \n               (off the cat's blank stare)\n\n               I'm not giving you any food until you tell me.\n\n               Arthur the cat responds with a pitiful meow.  Lorna smiles and \n               sets down the food.\n \n               LORNA (CONT'D) (cont'd)\n\n               That's right.  I knew you'd remember.\n\n                                     CUT TO\n                                     OMITTED\n\n               EXT. STREET - DAY\n\n\n               Lorna, dressed casually, walks to the bus stop.  Reading the \n               crossword puzzle in the paper, she doesn't see the curb and trips, \n               spilling her purse.  \n \n               Embarrassed, she gathers her things, then takes a seat next to \n               a Latino Woman.  Lorna smiles and resumes work on the puzzle. \n                \n \n               Stumped by a clue, she turns to the Woman.\n\n                                     LORNA\n               Hmm.  Simon and Garfunkel hit.  Eight letters.  Any thoughts?\n \n               \n               The Woman shrugs and looks off.\n\n               Suddenly, Lorna's phone rings.  She reaches into her purse but \n               it's not there.  Then, she spots it...in the street.  But the \n               moment she goes to get it, a truck roars past and smashes it \n               to smithereens.\n \n               LORNA (CONT'D) (cont'd)\n\n               Oh my god.\n\n               But as she scoops up the pieces in her hand a smile creeps across \n               her face.\n \n               LORNA (CONT'D) (cont'd)\n\n               No, this is right.  This is exactly right.\n\n                                     CUT TO\n\n               INT. COFFEE SHOP - DAY\n\n\n               A few notches up from a greasy spoon.  Lorna sits at the counter, \n               stirring her coffee.  A WAITRESS approaches.\n \n                                     LORNA\n               Excuse me, whatever happened to that sign, the one that used \n               to hang next to the pies?\n \n               The Waitress looks over her shoulder.\n\n                                     WAITRESS\n               What sign?\n\n                                     LORNA\n               The one that said, \"Today is the first day of the rest of your \n               life.\"\n \n                                     WAITRESS\n               That thing?  We got rid of it.\n\n                                     LORNA\n               Oh.\n\n                                     WAITRESS\n               Have you decided?\n\n               Before Lorna can speak, we hear--\n\n                                     WOMAN\n               She'll have the steak and egg special.\n\n               Lorna turns as TERRI, her roommate, joins her at the counter. \n                A little older than Lorna, Terri is cute but a little dangerous.\n \n               \n                                     TERRI\n               Look at her, she needs protein.  Lots of protein.\n\n                                     LORNA\n               (to the Waitress)\n\n               White toast.  Dry.\n\n               The Waitress leaves.\n\n                                     LORNA\n               Working early today, huh?\n\n                                     TERRI\n               No, I had something important to do...\n\n               Terri opens her bag and pulls out a small, gift-wrapped box.\n \n               \n                                     TERRI\n               ...Miss nineteen.\n\n                                     LORNA\n               I knew you'd remember.\n\n               Terri gives Lorna a kiss on the lips.\n\n                                     TERRI\n               Of course I remembered.  Go on, open it.\n\n                                     LORNA\n               No, no.  I wasn't born until ten minutes before midnight.  And \n               that's when I'll open it.\n \n                                     TERRI\n               You better like it.  I don't want to tell what I had to do to \n               pay for it.\n \n                                     LORNA\n               Ooh.  It must be good.\n\n                                     TERRI\n               So what's the plan, Stan?  Something special today?  Other than \n               splurging on toast.\n \n                                     LORNA\n               Yes.  There is something.\n\n                                     TERRI\n               Good.  Count me in.\n\n                                     LORNA\n               No.  Something big.  Something I've been thinking about for a \n               long time.\n \n               Terri sighs -- she knows exactly where this is going.\n\n                                     LORNA\n               I can't do this forever, Terri.  Look...\n\n               Lorna points to the corner of her eye.\n\n                                     LORNA\n               Crow's feet!  I'm nineteen!  Crow's feet!  I know I keep talking \n               about it, but this time I'm going to do it.  In fact, I did it. \n                This is my last day.\n \n                                     TERRI\n               Okay...\n\n                                     LORNA\n               I called them.  I told them I was out.\n\n                                     TERRI\n               You did not.\n\n                                     LORNA\n               Uh-huh.  I have one more appointment.  Then, I'm...free.\n\n                                     TERRI\n               Give me your cell phone.  I'm calling them back right now.\n\n               Lorna smiles and pours the shattered remnants of her phone on \n               the counter.\n \n                                     LORNA\n               A bus ran over it.  Isn't that perfect?  It's a perfect sign.\n \n               \n               Terri pops a cigarette in her mouth as the Waitress delivers \n               the toast.\n \n                                     WAITRESS\n               (to Terri)\n\n               Can't do that here, Miss.\n\n                                     TERRI\n               I know, I know.  I'm not going to light the damn thing.\n\n               (beat)\n\n               Fuck me.\n\n                                     LORNA\n               Look, I'm good for next month's rent.\n\n               This takes Terri by surprise.\n\n                                     TERRI\n               What, you're leaving too?\n\n                                     LORNA\n               Maybe.  Get out of town for a while.  I really feel good about \n               this.\n \n               (beat)\n\n               I appreciate everything you've done for me this year, Terri.\n \n               \n                                     TERRI\n               I wish you'd talked to me first.\n\n                                     LORNA\n               I didn't because...I knew you'd try to talk me out of it.\n\n                                     TERRI\n               That's because I'm looking out for you.  It's because there is \n               so much opportunity here.\n \n               (beat)\n\n               And it's because I'm your friend.\n\n               Lorna fiddles with her toast.\n\n                                     LORNA\n               I know.\n\n               (beat)\n\n               Listen, I'm late.\n\n               Lorna leaves some change on the counter, picks up her gift and \n               gives Terri a hug.\n \n                                     LORNA\n               Thanks.\n\n                                     TERRI\n               Well...Happy Birthday.\n\n               As Lorna goes, the Waitress reappears.\n\n                                     WAITRESS\n               Your friend comin' back?\n\n                                     TERRI\n               Hard to say.\n\n                                     CUT TO\n\n               INT. TODD'S APARTMENT - DAY\n\n\n               Someone is flipping through a stack of wedding photos.  Festive \n               shots of various couples.  At the altar.  Cutting the cake.  \n               Posing with relatives.\n \n                                     CUT TO\n               We're in --\n\n               A living room, Lorna sits on the couch browsing the wedding photos. \n                She has a quizzical look, as if the photos were of some incomprehensible \n               alien culture. The apartment is cluttered but not dirty.  The \n               decor suggests an occupant of modest means and bohemian taste.\n \n               \n               The occupant is TODD, who ENTERS counting a wad of money.  Late \n               twenties.  Unshaven.  By turns, cocky and nervous.\n \n               He sets the money in front of Lorna.\n\n                                     TODD\n               Seventy-five, right?  For the half-hour.\n\n                                     LORNA\n               Not including tip.\n\n               She smiles.  Todd paces uneasily.\n\n                                     TODD\n               And, typically, the size of the tip is...\n\n                                     LORNA\n               Depends on how generous you feel.\n\n                                     TODD\n               Of course.\n\n                                     LORNA\n               Is...this your first appointment?\n\n                                     TODD\n               No.  I've done this before.\n\n               Lorna thinks otherwise.  She pats the seat next to her.\n\n                                     LORNA\n               Come over here, you're making me nervous.\n\n               He plops down next to her.\n\n                                     LORNA\n               So, how much extra do you feel like spending?\n\n                                     TODD\n               I don't know.  Another fifty dollars?\n\n                                     LORNA\n               Uh-huh.\n\n               She thumbs through the wedding photos.\n\n                                     LORNA\n               So, this is what you do.  Weddings.\n\n                                     TODD\n               It pays the rent.\n\n                                     LORNA\n               These are good.  You're really a good photographer.\n\n                                     TODD\n               Well, somebody thinks so.  I get a lot of work.\n\n                                     LORNA\n               And you can only spend another fifty on me?\n\n               Todd walked right into that one.\n\n               LORNA (CONT'D) (cont'd)\n\n               Maybe you'll feel more generous once you get to know me.\n\n               Lorna smiles.  Her face has an open, unguarded beauty.\n\n                                     TODD\n               You have a great smile, do you know that?\n\n                                     LORNA\n               Yeah, I've heard.\n\n                                     TODD\n               And I like your name.  Lorna.  Like the cookie.\n\n                                     LORNA\n               Gee, I've never hear that one before.\n\n               She laughs at him.  But it's not unkind.\n\n               LORNA (CONT'D) (cont'd)\n\n               I have a friend who makes photos.  She's had some stuff in magazines. \n                Really dirty stuff, though.  Worse than dirty.  Sick, really. \n                You probably wouldn't like it.\n \n                                     TODD\n               Hey, I'm not afraid of sick images.  In fact, it's what I aspire \n               to do, create pictures that are edgy, that really assault you, \n               that reach out and slap you in the face.\n \n               Lorna considers this.\n\n                                     LORNA\n               Why?\n\n                                     TODD\n               Well...I don't know.  Shake people out of their...complacency. \n                Your friend would understand.  What's her work like?\n \n                                     LORNA\n               She photographs people pissing on each other.\n\n                                     TODD\n               Uh-huh.\n\n                                     LORNA\n               Yeah...disgusting.\n\n                                     TODD\n               Maybe that's the point.\n\n                                     LORNA\n               But who would want to look at that?  I mean, bathrooms have doors \n               for a reason.\n \n                                     TODD\n               What do you like?\n\n                                     LORNA\n               I like things that make me happy.  Like this.\n\n               Lorna holds up a photo of a beautiful, smiling bride.\n\n                                     LORNA\n               I bet she's going to have a very happy life.\n\n               She lingers over the photo.\n\n                                     LORNA\n               I don't think I'm the marrying kind, though.\n\n                                     TODD\n               Me, neither.  Marriage, it's so...medieval.  Sometimes when I'm \n               doing a wedding I look at the bride and groom and think, \"What \n               a couple of lemmings.\"\n \n                                     LORNA\n               I'm not sure people can be true, that's all.\n\n                                     TODD\n               Right.  That, too.\n\n               Lorna puts down the photos.\n\n                                     LORNA\n               Well...Now that we've gotten to know each better, maybe we should \n               get started.\n \n                                     CUT TO\n\n               INT. TODD'S BATHROOM - DAY\n\n\n               Alone, Lorna prepares.  She tears open a condom wrapper, stares \n               into the mirror and runs her lines.\n \n                                     LORNA\n               Oh, you really have a big cock...My, you really have a big cock...God, \n               what a big cock you have.\n \n                                     CUT TO\n\n               INT. TODD'S BEDROOM - DAY\n\n\n               Lorna and Todd are having sex.  She's on top, her movements slow \n               and hypnotic.  Occasionally, Lorna offers a moan, some are more \n               convincing than others.\n \n               NOTE: Throughout the scene, our ANGLES generally exclude Todd \n               from view.  We may HEAR him, but our focus is on --\n \n                                     LORNA\n               As she goes about her work, Lorna wears a vaguely puzzled expressions. \n                In fact, puzzles are on her mind.\n \n                                     LORNA\n               Forty-two across...Simon & Garfunkel hit...eight letters...begins \n               with 'I'...I...I'm A Loser...Did they sing that?...Susie used \n               to play Mom's Simon & Garfunkel records all the time...I scratched \n               one once and she pulled my hair...I haven't spoken to her for \n               almost a year...Her little kid must be walking by now...Maybe \n               I should give Susie a call...Nah, fuck that!  She's perfectly \n               capable of calling me...I mean, I'm listed...I'm...I am a rock...that's \n               it!...I Am A Rock, that's the answer...I am a--\n \n               Suddenly, Lorna remembers the job at hand.\n\n                                     LORNA\n               (flatly)\n\n               God, you really have a big cock.\n\n               Like Pavlov's proverbial dog, Todd MOANS and the whole thing \n               is quickly over.\n \n               Lorna gives Todd a look -- it's an astonishing impersonation \n               of tenderness.\n \n                                     LORNA\n               Wow.  That was something.\n\n                                     TODD\n               Yeah...was it?\n\n                                     LORNA\n               Let me tell you...that was something.\n\n                                     TODD\n               Really.\n\n                                     LORNA\n               Cut the modesty.  You really know what you're doing.\n\n                                     CUT TO\n\n               INT. TODD'S KITCHEN - DAY\n\n\n               Lorna, dressed, is dialing the kitchen phone.  From the kitchen \n               window she can see a school playground across the way.  It's \n               recess.  Girls in uniforms perform a jump rope cadence.\n \n                                     LORNA\n               (into phone)\n\n               Hey, it's Lorna...I'm clocking out for the last time...No, I'm \n               not done for the day, I'm done...Wait, I don't think you heard \n               me...Well, just give it to one of the other girls.  Give it to \n               Terri...I don't care if he's an important client, I told you \n               I'm...Well, you'll just have to cancel it, won't you?...I don't \n               care what it pays, it's not my fuckin'--\n \n               She turns to find Todd in the doorway, listening.\n\n                                     LORNA\n               (into phone)\n\n               Hold on...\n\n               (to Todd)\n\n               What?\n\n                                     TODD\n               Nothing.  Are you alright?\n\n                                     LORNA\n               I'm fine.  The cab fare will be another twenty.\n\n                                     TODD\n               You never said anything about cab fare.\n\n                                     LORNA\n               Of course I did.  Are you calling me a liar?\n\n                                     TODD\n               No.  I swear, you didn't say a word about it.\n\n               Lorna slowly brings the phone to her ear.\n\n                                     LORNA\n               (into phone)\n\n               Alright.  Where is it?\n\n                                     CUT TO\n\n               INT. TODD'S CAR - MOVING - DAY\n\n\n               Todd is at the wheel of his vintage Buick.  Lorna sits on the \n               passenger side.  She looks off, distracted.  On the seat between \n               them is the gift from Terri, still unopened.\n \n                                     TODD\n               You haven't told me where we're going yet.\n\n                                     LORNA\n               Make a right at the light.\n\n               He does.\n\n                                     TODD\n               Can I ask you a question?\n\n               (without a beat)\n\n               No, forget it...it's stupid.\n\n                                     LORNA\n               Go on, ask.\n\n                                     TODD\n               Well, after we...after we did it, you didn't really mean what \n               you said, did you?  About me being so good.\n \n               Lorna looks at him like he's the biggest fool in the world.  \n               This is not lost on him.\n \n                                     TODD\n               (back-peddling)\n\n               I'm only asking because I'm fascinated by this whole scene you're \n               in.  So, don't worry about sparing my feelings or anything.  \n               I'm just curious.\n \n                                     LORNA\n               Pull over.\n\n                                     TODD\n               What?\n\n                                     LORNA\n               Pull over here.\n\n               He does.  Up the block is a high-rise, luxury hotel.  Limos and \n               cabs line the driveway.  Uniformed doormen guard the entrance.\n \n               \n                                     LORNA\n               You see that hotel?  In one of those rooms, there's a man waiting...he's \n               waiting for me.  I don't know what his name is or what he looks \n               like.  He may have bad skin.  He may be really ugly.  But no \n               matter how he looks, or how bad he smells, or whether he makes \n               weird wheezing sounds when he comes, I tell him the same thing...the \n               same thing I told you.\n \n                                     TODD\n               Right...Well, that's what I thought.  I mean, a guy would have \n               to be pretty lame to think that...\n \n               Todd knows better than to even finish.\n\n                                     LORNA\n               To think what?\n\n                                     TODD\n               Nothing.\n\n               Quite out of the blue, she leans over and kisses him on the cheek.\n \n               \n                                     LORNA\n               It's Todd, right.\n\n                                     TODD\n               Yeah.\n\n                                     LORNA\n               Well, Todd, you're alright.\n\n               (beat)\n\n               And that I don't say that to everyone.\n\n               She opens the door, starts out--\n\n                                     TODD\n               If I wanted to see you again--\n\n                                     LORNA\n               No. You can't.  You can't see me again.\n\n               (beat)\n\n               But thanks for asking.\n\n                                     OMITTED\n\n               INT. TODD'S CAR - DAY\n\n\n               Lorna closes the door and starts for the hotel.  Todd drives \n               past, watching her recede in the rear-view mirror.\n \n               The moment she disappears, Todd looks down and sees the gift \n               box from Terri -- Lorna left it on the seat.\n \n               Without missing a beat, Todd slams on the brakes, jumps out and \n               races back to where he left her.  Looking everywhere--\n \n                                     TODD\n               Lorna!  Lorna!\n\n               But Lorna is gone.\n\n                                     CUT TO\n                                     OMITTED\n                                     CUT TO\n\n               INT. PHOTOGRAPHY STUDIO - DAY\n\n\n               A business that specializes in sentimental portraits -- weddings, \n               graduations, anniversaries...even beloved pets.\n \n               A photo shoot in progress.  Todd and his colleague PHIL -- mid-30s, \n               are doing an engagement portrait.  \n \n               The couple -- very straight and suburban -- are just of out Todd \n               and Phil's earshot.\n \n                                     PHIL\n               (to the couple)\n\n               Beautiful, just beautiful.\n\n               (to Todd)\n\n               You used a rubber, I hope.\n\n                                     TODD\n               Of course.\n\n                                     PHIL\n               And how much did this afternoon delight set you back?\n\n                                     TODD\n               Oh.  About a buck and a quarter.\n\n               (to the couple)\n\n               We just need to reload.\n\n               As they do--\n\n                                     PHIL\n               Since when do you have a hundred and twenty-five dollars to throw \n               away?\n \n                                     TODD\n               I'm sure you spend just as much on porn rentals.\n\n                                     PHIL\n               There's no comparison.  Here, I'll do the math for you.\n\n               Phil pulls a calculator out of his camera bag.\n\n               PHIL (CONT'D) (cont'd)\n\n               (punching in numbers)\n\n               A video rents for $2.65.  That's a two-day rental.  That means \n               you can get off at least a couple times before it's due.  $125 \n               divided by $2.65 equals approximately 47.  47 X 2 = 94.  I can \n               get off ninety-four times for the same amount you paid to get \n               off once.  Now tell me who gets the better deal.\n \n                                     TODD\n               You're right.  I can't argue with that.\n\n                                     PHIL\n               Anyway, I stopped watching porno.\n\n                                     TODD\n               You did?  Why?\n\n                                     PHIL\n               They kinda depress me.\n\n               (beat)\n\n               When I want to get off now, you know what I use?\n\n                                     TODD\n               What?\n\n               Phil taps his forehead.\n\n                                     PHIL\n               My imagination.\n\n               (to the couple)\n\n               Okay, folks.  It's magic time.\n\n                                     LATER.\n               The couple is gone.  Phil and Todd wrap some equipment.\n\n               Phil (cont'd)\n\n               What I don't understand is, aren't you getting enough action \n               from that Sarah?\n \n                                     TODD\n               What's Sarah got to do with it?\n\n                                     PHIL\n               You're seeing her, aren't you?\n\n                                     TODD\n               Sarah...that's a whole different situation.\n\n                                     PHIL\n               But you're doing it with her, right?\n\n                                     TODD\n               I like Sarah a lot.  And I don't want to blow it by pushing too \n               hard.\n \n               Phil stares.\n\n                                     PHIL\n               You mean, you haven't...\n\n                                     TODD\n               Technically?  No.\n\n                                     PHIL\n               She won't put out?\n\n                                     TODD\n               No, no, no.  You don't get it.  You can't equate the two.  What \n               I did with Lorna--\n \n                                     PHIL\n               Lorna?\n\n                                     TODD\n               That's her name.  Lorna.  I mean, that's the name she gave me. \n                What I did with her...that was like going to some exotic place. \n                For a visit.    Haven't you ever wondered what that kind of \n               person is like?  What that world is like?  I was just...doing \n               research.  The lower depths...\n \n               (beat)\n\n               You think I'm full of shit, don't you?\n\n                                     PHIL\n               I didn't say anything.\n\n                                     CUT TO:\n                                     OMITTED\n                                     CUT TO\n\n               EXT. MOVIE THEATER - NIGHT\n\n\n               A revival house in a college neighborhood.  The ticket seller \n               hangs a \"Sold Out\" sign in the box office window, just as Todd \n               and SARAH come running down the sidewalk.\n \n                                     SARAH\n               Shit!  Sold out!\n\n               Sarah, at twenty-five, is cute, brainy, articulate, and hopelessly \n               insecure.\n \n               They lean against the wall and catch their breath.\n\n                                     SARAH\n               I am so sorry.\n\n                                     TODD\n               That's alright.  I hear it's really overrated.  And long.\n\n                                     SARAH\n               I could just kill him!  This is not the first time he's done \n               this, either.\n \n                                     TODD\n               Done what?\n\n                                     SARAH\n               Cooked up some phony emergency, right as I'm getting on the elevator.\n \n               \n                                     TODD\n               He's your boss.  Being an asshole is part of the job description.\n \n               \n                                     SARAH\n               We're talking about the most self-centered man I have ever met. \n                God forbid I should have a life, right?\n \n               (beat)\n\n               But I'm not going to let him do it.\n\n                                     TODD\n               Do what?\n\n                                     SARAH\n               Ruin my evening.  Our evening.\n\n               (without a beat)\n\n               You know, he also thinks he's God's gift to women.  I'm surprised \n               he hasn't been sued by now...Okay, okay.  Stop me.\n \n               He takes her by the shoulders.\n\n                                     TODD\n               Sarah.  Take a breath.\n\n                                     SARAH\n               Okay.  I'm taking a breath.\n\n               And she does.\n\n                                     TODD\n               Now, take another one.\n\n                                     SARAH\n               I like you.  Have I told you that?\n\n                                     TODD\n               Not today.\n\n                                     SARAH\n               You know what I want to do?  I want to go shopping.\n\n                                     TODD\n               Shopping?  For what?\n\n                                     SARAH\n               For a house.\n\n                                     TODD\n               (completely thrown)\n\n               Just what I was thinking.\n\n                                     CUT TO\n\n               INT. TODD'S CAR - MOVING - NIGHT\n\n\n               Todd drives Sarah through a neighborhood full of beautifully-maintained \n               old homes.  She is a kid in a candy store--\n \n                                     SARAH\n               Look at the detail on that one.  Wow.  Every one of these is \n               a gem.  Makes the stuff I work on look pretty shabby by comparison.\n \n               \n               She shifts to get a better look.  In doing so, her foot hits \n               an object on the floor.\n \n                                     SARAH\n               What's this?\n\n               She lifts up Lorna's birthday gift -- still unwrapped.Todd reacts \n               -- he forgot to get rid of it -- and Sarah reacts to Todd.\n \n               \n                                     SARAH\n               Obviously, not for me.\n\n                                     TODD\n               Something...somebody left in front the studio.  I just picked \n               it up.\n \n               Sarah nods -- she seems to buy it -- and promptly opens the box.\n \n               \n                                     TODD\n               What are you doing?\n\n                                     SARAH\n               Maybe we can find out whose it is.\n\n               Inside is a silver bracelet, and a hand-written note.\n\n                                     SARAH\n               (reading)\n\n               \"Lorna.  Remember, I'm in your corner.  Love, Terri.\"  Pretty \n               cool bracelet.  You just found this.\n \n                                     TODD\n               Stupid of me...I should've left it.\n\n                                     SARAH\n               Lorna.  That's a name you don't hear very much.  Lorna.  Like \n               the cookie.\n \n               (off Todd's look)\n\n               What?  You've never had a Lorna Doone?\n\n                                     TODD\n               No.\n\n                                     SARAH\n               Terri and Lorna.  Sisters, maybe?  Lovers, more like it.  Or...witches. \n                And this bracelet is some sort of talisman.\n \n                                     TODD\n               You have a perverse mind.\n\n               (beat)\n\n               ...which I like, by the way.\n\n                                     SARAH\n               Or...perhaps Terri killed Lorna, and this \"gift\" provides her \n               with an alibi.\n \n                                     TODD\n               Maybe you should put it back.\n\n                                     SARAH\n               What, aren't you a little curious?\n\n               Todd pulls over and stops.\n\n                                     TODD\n               Sarah...I don't know how to put this.  This is our fourth night \n               out, and I feel a lot of pressure...for this to work.\n \n                                     SARAH\n               I want it to work, too.\n\n               (off his look)\n\n               Oh.  Is this about sex?\n\n                                     TODD\n               Don't you think we're being a little...methodical about the whole \n               thing?  Maybe we should just...\n \n                                     SARAH\n               What?  Get it over with?\n\n                                     TODD\n               Not exactly.\n\n                                     SARAH\n               Don't you think it's better to be sure of each other first?  \n               To have a little bit of trust?\n \n               Sarah absently fingers the bracelet that's not hers.\n\n                                     TODD\n               You can trust me.\n\n                                     SARAH\n               I know, I know.\n\n               (beat)\n\n               But you're not sleeping with anyone else, right?\n\n                                     TODD\n               Of course not.\n\n                                     SARAH\n               It's not such a strange thing to ask.  Sometimes relationships...overlap. \n                I just need to feel--\n \n                                     TODD\n               I told you.  I'm not.\n\n               Beat.\n\n                                     SARAH\n               You haven't asked me if I'm seeing anyone.\n\n                                     TODD\n               Is that bad?\n\n                                     SARAH\n               It's silly, I know, but it makes me feel like you couldn't imagine \n               anyone being interested in me.\n \n                                     TODD\n               What?  You should be flattered I don't ask.  I respect you enough \n               to assume you'd tell me if you're involved with someone.\n \n               Sarah considers this.\n\n                                     SARAH\n               Hmm.  Ask me, anyway.\n\n                                     TODD\n               Are you serious?\n\n               (off her look)\n\n               Alright.  Are you seeing anyone?\n\n                                     SARAH\n               Absolutely not.\n\n               Todd takes the bracelet, puts it on the dash, then leans to kiss \n               Sarah.\n \n                                     SARAH\n               I do want to make love tonight.\n\n                                     TODD\n               I'm just worried that all this talk is going to kill the spontaneity--\n \n               \n               She presses her finger to his lips--\n\n                                     SARAH\n               I think spontaneity is overrated.\n\n                                     CUT TO\n\n               INT. SARAH'S APARTMENT BEDROOM - NIGHT\n\n\n               Todd and Sarah are making out in her bedroom.  To expedite matters, \n               they're also trying to undress.  It's not very practical.  Todd \n               can't quite kick off his shoes.  Sarah can't quite get her blouse \n               unbuttoned.\n \n               Finally--\n\n                                     SARAH\n               Todd, the light.\n\n               He switches it off.  They sit side by side and undress down to \n               their underwear.   They look at each other.\n \n                                     SARAH\n               Wait.  Don't say anything.\n\n                                     TODD\n               Okay.\n\n               Beat.\n\n                                     SARAH\n               What were you going to say?\n\n                                     TODD\n               I wasn't going to say anything.\n\n                                     SARAH\n               Oh.\n\n                                     TODD\n               You look beautiful--\n\n                                     SARAH\n               No, don't say that.  Let's get under the covers.\n\n               They climb into bed and move into each other's arms.\n\n                                     SARAH\n               Let's go slowly.\n\n               They kiss, caress, shedding their inhibitions. Then--\n\n                                     SARAH\n               Oh.  Oww!\n\n                                     TODD\n               What happened?\n\n                                     SARAH\n               Dammit...my foot.  I've got one of those...what's the word?\n \n               \n                                     TODD\n               A bunion\n\n                                     SARAH\n               Not a bunion.  A spasm.\n\n                                     TODD\n               Oh, a foot spasm.  Here let me--\n\n               He throws back the covers and massages her foot.\n\n                                     SARAH\n               Oww!  No, stop!  It hurts!  I hate this!\n\n                                     TODD\n               What can we do?\n\n                                     SARAH\n               Nothing, it's fine, it's fine.  Lemme just walk it off.\n\n               She gets out of bed and hobbles into--\n\n\n               INT. SARAH'S HALLWAY - NIGHT\n\n\n               Dressed in bra and panties, Sarah hops up and down the hall, \n               desperate to relieve her pain.\n \n               Todd appears in the doorway and watches her mad little dance.\n \n               \n               His thoughts--\n\n                                     TODD\n               She has a better-looking body than I imagined...Breasts are definitely \n               bigger than I thought.  You can just never tell with breasts, \n               can you?...I don't know what to make of this foot problem...Maybe \n               she gets a spasm every time she has sex...I've heard of people \n               with problems like that...People who can't have sex without laughing, \n               or burping...Oh, God, what if she's one of them...\n \n               Sarah looks up from her hopping.\n\n                                     SARAH\n               I am so embarrassed.  Trust me, this doesn't happen all the time.\n \n               \n                                     TODD\n               The thought never crossed my mind.\n\n                                     CUT TO\n\n               INT. SARAH'S BEDROOM - NIGHT\n\n\n               Sarah and Todd, back under the covers, making love.  Todd is \n               on top, moving slowly.  Sarah bites her lip and closes her eyes.\n \n               \n               Todd looks at her and wonders --\n\n                                     TODD\n               She won't look at me.  Why won't she look at me?..I'll bet she's \n               preoccupied with her foot.  She's praying she won't get another \n               spasm, another foot freak-out...She's being awfully quiet, too...Why \n               is she so quiet?...Maybe she needs to concentrate...Some women \n               need to concentrate...I read that in a magazine at the grocery \n               store...That blonde check-out girl who works there is really \n               cute...I love the way she says, \"Paper or plastic?\"...\n \n               Todd lets out an excited gasp.  Sarah opens her eyes with alarm.\n \n               \n                                     SARAH\n               Todd!  Shhh...\n\n               Todd stops.  Everything stops.\n\n                                     TODD\n               What's the matter?\n\n                                     SARAH\n               These walls, they're paper-thin.  This building is so poorly \n               built.  Everyone can hear you.\n \n               Todd rolls off of her.\n\n                                     TODD\n               Is that why you're so quiet?\n\n                                     SARAH\n               Yes, the walls are...What are you saying?\n\n                                     TODD\n               It's hard for me to tell if you're enjoying this.\n\n                                     SARAH\n               Of course, I am.  I'm sorry if I'm not vocal enough for you.\n \n               \n                                     TODD\n               That's not what I...Sarah, I just want to make sure I'm doing \n               something right here.\n \n                                     SARAH\n               There's no right or wrong way to do this.\n\n                                     TODD\n               I know.  I just want to make sure I'm...you know, in the ballpark.\n \n               \n               Sarah stares at him.\n\n                                     SARAH\n               Todd, I don't expect you to do everything right the first time...Sorry, \n               that didn't come out the way I meant it...\n \n               They roll away from each other and stare at the ceiling.  We \n               hear a distant siren -- a fire engine, maybe.  Somewhere there's \n               a five-alarm fire blazing.  Not here.\n \n                                     TODD\n               You didn't like it.\n\n                                     SARAH\n               No, I didn't say that.  I was just...Let's be still for a while. \n                Alright?\n \n                                     FADE OUT:\n                                     FADE IN:\n\n               INT. SARAH'S BEDROOM - LATER - NIGHT\n\n\n               Sarah and Todd haven't moved.  It's not clear how much time has \n               elapsed.\n \n                                     SARAH\n               Everyone expects fireworks the first time you do it.  But that's \n               just a myth.\n \n                                     TODD\n               A myth.  You're right.\n\n                                     SARAH\n               Let's not be too hard on ourselves.\n\n                                     TODD\n               I agree.\n\n                                     SARAH\n               Our expectations were a little high, that's all.\n\n               Todd nods his agreement.\n\n                                     TODD\n               And at the end of the day, sex is only one part of the picture.\n \n               \n                                     SARAH\n               True.  What do you mean?\n\n                                     TODD\n               I know this couple. They had nothing in common but good sex. \n                They went at it like a pair of rabbits.  And guess how long \n               it lasted?  A month.  They were hot for each other...but there \n               was nothing else.\n \n                                     SARAH\n               Right.\n\n               (beat)\n\n               There's got to be something else.\n\n               And they stare at the ceiling.\n\n                                     FADE OUT:\n                                     FADE IN:\n\n               INT. SARAH'S BEDROOM - STILL LATER - NIGHT\n\n\n               They still haven't moved, but unbeknownst to Sarah, Todd has \n               fallen asleep.\n \n               She looks at him.  She caresses his face.  Then, her hand slides \n               down under the sheets.  She tries to arouse him, but after a \n               while she stops.  He's very much asleep.\n \n               Sarah lies back.  She slides her hand between her legs and begins \n               to touch herself.\n \n               Quietly.\n\n                                     FADE OUT:\n                                     FADE IN:\n\n               EXT. STREET - DAY\n\n\n               Early morning.  The air is cool and crisp as Sarah, wearing sweats \n               and a T-shirt, jogs through the neighborhood.\n \n               She turns down a side street, heading for--\n\n\n               EXT. SARAH'S GRANDPARENTS HOUSE - DAY\n\n\n               A nondescript house with a faded American flag hanging off the \n               front porch.  Sarah climbs the steps where an elderly man -- \n               her GRANDFATHER, sits with the morning paper in his lap, unread.\n \n               \n               Sarah gives him a kiss.\n\n                                     SARAH\n               Morning, Pappy.  How's she doing today?\n\n                                     GRANDFATHER\n               Don't pay her any mind, Sarah.  The things she says, they get \n               stranger by the day.\n \n               Sarah pays him no mind and heads into the house.\n\n                                     CUT TO\n\n               EXT. BACK PORCH - DAY\n\n\n               Sarah and her GRANDMOTHER sit on the back porch, which offers \n               a splendid view of...other people's back porches.\n \n               Sarah's Grandmother has a sense of mischief that's quite at odds \n               with her deteriorating frame.\n \n               The two drink coffee.\n\n                                     GRANDMOTHER\n               They keep telling me I'm doing fine, that I'm even improving. \n                Why do they have to lie?  At my age?  What are they trying to \n               protect me from?\n \n                                     SARAH\n               Maybe they know something you don't.\n\n                                     GRANDMOTHER\n               Like hell.\n\n               She pulls out a pack of American Spirit cigarettes and lights \n               one.  Sarah reacts.\n \n                                     SARAH\n               Nan.\n\n                                     GRANDMOTHER\n               What?  One in the morning with coffee.  One at night with cocktails. \n                Where was I?\n \n               (beat)\n\n               Oh, yes.  My story is coming to an end, Sarah--\n\n                                     SARAH\n               Oh, please.\n\n                                     GRANDMOTHER\n               Your story, that's the one I want to hear.\n\n                                     SARAH\n               I wish I had a story to tell.\n\n                                     GRANDMOTHER\n               Hmm.  The last time there was talk of an admirer.\n\n                                     SARAH\n               All you want is dirt, Nan.  Admit it.\n\n                                     GRANDMOTHER\n               The world is made of dirt, Sarah.  So, please, dish.  No detail \n               is too small.\n \n                                     SARAH\n               I...I'm sleeping with two different men.\n\n                                     GRANDMOTHER\n               Hmm.  Continue.\n\n                                     SARAH\n               One of them is a good man.  He's good for me.\n\n                                     GRANDMOTHER\n               Like vitamins.\n\n                                     SARAH\n               Sort of.  The other one, he can be a complete ass.  A total jerk.\n \n               \n                                     GRANDMOTHER\n               In other words...he excites you.\n\n                                     SARAH\n               He does.  And I hate it.  I hate him.  And, on top of that, I \n               can't have him.\n \n                                     GRANDMOTHER\n               Can you see your Pappy?\n\n               Sarah looks back over her shoulder.  She catches a glimpse of \n               her Grandfather.  He's still on the front porch.\n \n                                     SARAH\n               He hasn't moved.\n\n                                     GRANDMOTHER\n               Good.  Keep an eye on him.\n\n                                     SARAH\n               Why?\n\n                                     GRANDMOTHER\n               Because I'm going to tell you something he shouldn't hear.  Something \n               no one knows.  Once, I had two lovers.  One was your grandfather. \n                He had prospects, then.  He had a car and we drove everywhere \n               and people would look at us and say, \"Now, there goes a couple.\" \n                He never pushed me.  He told me he respected my virginity.  \n               And I liked that.\n \n               They hear a loud creak.\n\n                                     SARAH\n               Don't worry.  He's not moving.\n\n                                     GRANDMOTHER\n               The other man -- he was a boy, really -- he had no prospects. \n                And he had no car.  And he had no respect...for anything.  He \n               certainly had no respect for my virginity.  And I liked that, \n               too.\n \n               She takes a long, luxurious drag.\n\n                                     GRANDMOTHER\n               But I had to make a choice.  I chose your grandfather.  The day \n               before the wedding, I went to let the other boy down.  Met him \n               by a river where we used to swim.  Well, one thing led to another, \n               and when I returned home that night, I'd left my virginity back \n               in the tall grass by that river.\n \n               Sarah sits on the edge of her chair.\n\n                                     GRANDMOTHER\n               But I did bring something back.  A bite mark.  That sonuvabitch \n               left on my neck, the size of a peach pit.\n \n                                     SARAH\n               Did Pappy see it?\n\n                                     GRANDMOTHER\n               He did and he didn't.  On the wedding night -- in this house \n               -- I managed to squeak by.  It was dark.  We were shy.  He took \n               me in his arms and said, \"I'm glad you waited for me.\"  In other \n               words, I lost my virginity twice in the same week.\n \n               They both laugh.\n\n                                     SARAH\n               No small feat.\n\n                                     GRANDMOTHER\n               It's an accomplishment.  But the next morning, your Pappy saw \n               it.  He demanded an explanation.  And, Sarah, do you know how \n               I got out of that pickle?\n \n                                     SARAH\n               You lied.\n\n                                     GRANDMOTHER\n               Damn right.  I said, \"What, you don't remember giving me this?\" \n               He said, \"No.\"  And I said, \"Well, you were so fired up last \n               night, it's a wonder you can remember anything.\"\n \n               (beat)\n\n               And the beast was tamed.\n\n               Sarah considers the story.\n\n                                     SARAH\n               And you've never been tempted to...\n\n                                     GRANDMOTHER\n               What?  Come clean with your Pappy?  Why should I tell him?  He \n               had nothing to do with it.\n \n                                     SARAH\n               Right.\n\n                                     GRANDMOTHER\n               It's mine.  Not his.\n\n                                     SARAH\n               I wonder what became of that boy.\n\n                                     GRANDMOTHER\n               Never saw him again.  I don't regret a thing, if that's what \n               you're wondering.\n \n                                     SARAH\n               I was, in fact.\n\n                                     GRANDMOTHER\n               Look what I have.  I have you.\n\n               (beat)\n\n               And you know what else?  I have the tall grass by that river. \n                And those clouds.  From where I was laying the clouds looked \n               really beautiful that day.\n \n                                     CUT TO\n\n               INT. THE MODEL CITY/OFFICE - DAY\n\n\n               The same model we saw at the start of our story.  We glide toward \n               a miniature suburban development.  Row upon row of houses, each \n               no different than the next.\n \n               Over this --\n\n                                     SARAH\n               I don't believe it.  You're actually asking my opinion.  You \n               really want to know what I think?\n \n               We TILT UP to reveal that we're in--\n\n               The well-appointed office of the well-heeled JOSH, an architect \n               in his early 40s.  Josh studies the model like a boy with a train \n               set.  Sarah stands beside him.\n \n                                     JOSH\n               To tell you the truth, no.  I just wanted to hear your voice. \n                You've barely said \"boo\" to me all morning.\n \n                                     SARAH\n               (shrugs)\n\n               Boo.\n\n                                     JOSH\n               Alright, what do you think of it?\n\n                                     SARAH\n               You'd have to pay me to live in that neighborhood.\n\n               (off his look)\n\n               Hey, what do I know?  I'm just the assistant.\n\n                                     JOSH\n               What are they going to think?  That's all that matters.\n\n                                     SARAH\n               To paraphrase you, this is going to give them a major hard-on. \n                Not the women, of course.\n \n                                     JOSH\n               You haven't met these women.\n\n               Sarah laughs, catches herself and stops.\n\n                                     CUT TO\n\n               INT. OFFICE CORRIDOR - DAY\n\n\n               Sarah and Josh move down a hall toward the elevators.  Josh is \n               in micro-management mode --\n \n                                     JOSH\n               The champagne order?\n\n                                     SARAH\n               Done.  Dom Perignon.  Fifteen cases.\n\n                                     JOSH\n               Invitations?\n\n                                     SARAH\n               A messenger is meeting us at the site with the proofs.\n\n                                     JOSH\n               Good.\n\n               He reaches behind her and pats her butt.\n\n                                     SARAH\n               Stop it.\n\n                                     JOSH\n               I can't.\n\n                                     SARAH\n               Have you never heard of the phrase \"impulse control\"?\n\n               They reach the elevators.\n\n                                     JOSH\n               I love it when you're full of contempt.\n\n               She just glares.\n\n                                     SARAH\n               People are starting to notice, Josh.  I work very hard to act \n               completely indifferent toward you.  The least you could do is \n               to keep your hands to yourself.\n \n                                     JOSH\n               I've got a better idea.\n\n                                     SARAH\n               What?\n\n                                     JOSH\n               Why don't I distribute a memo, informing everyone that you and \n               I are not sleeping together?\n \n                                     SARAH\n               Josh, just for the sake of variety, could you take me seriously \n               for a moment?\n \n                                     JOSH\n               Alright, alright.  I have another idea.\n\n                                     SARAH\n               Please, don't...\n\n                                     JOSH\n               Let's just end it.\n\n               Beat.\n\n                                     SARAH\n               Yes.  I think we should.\n\n               Josh didn't expect this.  The elevator arrives.  He steps aboard \n               and holds the door for her.\n \n                                     JOSH\n               Coming?\n\n                                     SARAH\n               I'm going to take the stairs.\n\n               Josh shrugs and lets the doors close.\n\n               A beat.  Sarah considers the stairs, then hits the down button \n               again.\n \n                                     CUT TO\n\n               EXT. OFFICE BUILDING - DAY\n\n\n               Sarah and Todd eat lunch on a bench in a busy promenade.  Deli \n               sandwiches in wax paper rest on their laps.\n \n                                     SARAH\n               I can't put my finger on it...I just don't feel it's happening \n               with us.\n \n                                     TODD\n               You don't want it work out, that's what you're saying.\n\n                                     SARAH\n               I do.  I mean, I did.  It's no one's fault.  It's chemistry.\n \n               \n               Beat.\n\n                                     TODD\n               You want your pickle?\n\n                                     SARAH\n               Do you want your pickle?!\n\n                                     TODD\n               You know what the problem is?  The first night we went out, we \n               should've just fucked.  Right away.  Without thinking.  Two dumb \n               bunnies.  Without any history,  any baggage.  A pair of blank \n               slates.  Fucking.  It could've been perfectly meaningless.  You \n               want chemistry?  The less you think, the better the chemistry. \n                Less talk, more action.\n \n                                     SARAH\n               I'm sorry.  It's just not happening for me.\n\n                                     TODD\n               The least you can do is give me your goddam pickle.\n\n               They look away from each other.  Todd eats in silence.  The pickle \n               sits between them.\n \n                                     CUT TO\n\n               EXT. SUBURBAN DEVELOPMENT - DAY\n\n\n               Josh's model come to life.  A fallow stretch of land lined with \n               unfinished houses, some more skeletal than others.\n \n               At one site we find two parked cars.  A gold Lincoln Navigator \n               and an old BMW convertible.\n \n                                     CUT TO\n\n               INT. HOUSE - DAY\n\n\n               A house-in-progress.  The walls are in place, but little else. \n                Stray two-by-fours, saw horses, electrical cable.  And...no \n               roof.\n \n               In an upstairs room -- what will soon be the master bedroom, \n               Josh confers with a construction supervisor.  Nearby, Sarah talks \n               on her cell phone.\n \n                                     SARAH\n               (into phone)\n\n               I don't care if it costs the same, if it's not Dom Perignon tell \n               them we don't want it, alright?...Good.  Anybody else call?  \n               Nobody, huh...Okay.\n \n               As she hangs up the construction supervisor exits.  Sarah and \n               Josh are alone.\n \n                                     SARAH\n               Guess I'll be heading back...\n\n                                     JOSH\n               Wait.\n\n               (beat)\n\n               About the other day...Are you having any second thoughts?\n\n                                     SARAH\n               (shrugs)\n\n               No.  None.\n\n                                     JOSH\n               You're angry I called it quits, aren't you?  You can admit it.\n \n               \n                                     SARAH\n               No.  In fact, I want to thank you.\n\n                                     JOSH\n               For what?\n\n                                     SARAH\n               For sparing me from the most unhealthy relationship I've ever \n               had in my life.  For that, I thank you.\n \n               Josh raises his hands in surrender.\n\n                                     JOSH\n               Touché.\n\n                                     SARAH\n               Are you having seconds thoughts?\n\n                                     JOSH\n               No.  I say, let's make a clean break.  Let's just walk away from \n               it.\n \n               Sarah smiles.  She extends her hand.\n\n                                     JOSH\n               What are you doing?\n\n                                     SARAH\n               Let's seal the deal.  Shake.\n\n               It's a little awkward, but they do.\n\n                                     JOSH\n               Alright.  Now that we've put that behind us, there's one problem \n               left.\n \n                                     SARAH\n               What?\n\n                                     JOSH\n               Where do we put the bed?\n\n               Josh gestures to the empty room.  Sarah smiles -- it's a familiar \n               game.\n \n                                     SARAH\n               Oh, the bed.  Let's put it against this wall.  Away from the \n               morning sun.\n \n                                     JOSH\n               Wrong.  It's got to go here.  So you can see the hallway.\n\n               They head out.\n\n               As Josh and Sarah leave the house, they \"decorate\" several rooms.\n \n               \n\n               INT. ANOTHER BEDROOM -- DAY\n\n\n                                     SARAH\n               Not enough height for bunk beds.\n\n                                     JOSH\n               Why do you assume there will be two children?\n\n                                     SARAH\n               There has to be.  They need to keep each other company.\n\n\n               INT. THE KITCHEN -- DAY\n\n\n                                     SARAH\n               Definitely not enough space for two people to cook.\n\n                                     JOSH\n               I prefer to eat out.\n\n\n               INT. THE LIVING ROOM -- DAY\n\n\n               They size up the space, enjoying their play.  Sara walks around \n               imaginary furniture.\n \n                                     SARAH\n               Oh, no.  I wouldn't put the ottoman there.\n\n                                     JOSH\n               Where would you put it?\n\n                                     SARAH\n               It needs to go over...\n\n               She waves her hand, accidentally brushing against Josh's chest. \n                She lets her hand linger...\n \n                                     SARAH\n               Hmmm.\n\n                                     JOSH\n               What?\n\n               ...and linger.  They both know what's happening.\n\n                                     SARAH\n               We have another problem.\n\n                                     JOSH\n               And that would be...?\n\n                                     SARAH\n               What do we do with the elephant in the room?\n\n                                     JOSH\n               You're very clever.\n\n               She rubs his chest.\n\n                                     SARAH\n               We shouldn't be rude to an elephant.\n\n               She lets her hand drop to his crotch.\n\n                                     SARAH\n               They can get very annoyed...if you ignore them.\n\n               She pulls Josh to her and kisses him.  Josh fairly attacks her, \n               his hands all over her body.\n \n               After a few lustful beats, he lifts her and she wraps her legs \n               around him.\n \n                                     SARAH\n               Josh.  The door.\n\n               It's an absurd request -- the room is completely exposed, but \n               Josh carries her to the front door and kicks it closed.\n \n               --as the door slams, obscuring our view.\n\n                                     ON JOSH AND SARAH\n               With Sarah's back against the door, Josh enters her.\n\n                                     CLOSE ON SARAH\n               She looks up.  With no roof above them, she has a brilliant view \n               of...the clouds.  They float past as she thinks--\n \n               SARAH (V.O.) (cont'd)\n\n               ...Let's not put a roof on this house today...let's leave the \n               walls unfinished...it's okay not to know where the sofa goes...The \n               colors?  We can choose them another day...I like it the way it \n               is... undone... undecided...a work in progress...\n \n               She moans -- there's nothing quiet about her at all.\n\n               Fade out.\n\n                                     FADE IN:\n\n               INT. THE LIVING ROOM - LATER - DAY\n\n\n               Josh and Sarah have finished.  He tucks in his shirt.  She puts \n               on a shoe.\n \n                                     JOSH\n               I have to tell you, that was the best \"break-up\" sex I've ever \n               had.\n \n               Sarah considers this.  Nods.\n\n                                     SARAH\n               It was, wasn't it?\n\n               (beat)\n\n               Closure is important.\n\n               jOSH\n\n               Now you can move on.  You can meet someone who...\n\n               sarah\n\n               What?  Someone who's not a prick like you.\n\n               Josh reacts -- slightly offended.\n\n               joSH\n\n               No.  Someone who's...free.\n\n               sarah\n\n               Oh.  Right.\n\n               (beat)\n\n               As if that would have made any difference in this...what is this \n               thing called again?  A relationship?\n \n               She's fishing -- she hates herself for it.\n\n               sarah (cont'd)\n\n               It wouldn't have made any difference, right?\n\n               jOSH\n\n               I'm surprised you have to ask.\n\n               sarah\n\n               I'm not asking.\n\n               He'll answer, anyway.\n\n               joSH\n\n               If my hands weren't tied...it might have made all the difference.\n \n               \n               Beat.\n\n               sarah\n\n               I said I wasn't asking.  And that's the worst answer you could've \n               given.\n \n               cUT TO\n\n\n               EXT. HOUSE - DAY\n\n\n               Josh and Sarah get into their respective cars -- her BMW, his \n               Navigator.\n \n               Josh looks at himself in the rear-view mirror.  He reacts--\n \n               \n               JoSH\n\n               What the hell is this?\n\n               Sarah looks over.\n\n               joSH (cont'd)\n\n               You bit me on the neck!  I've got a goddam hickey!\n\n               Sure enough, there is a bright red mark on his neck.\n\n               Sarah comes over.  She reacts with shock, embarrassment, then...laughter.\n \n               \n               joSH (cont'd)\n\n               What's so goddam funny?  You did this on purpose, didn't you?\n \n               \n               sarah\n\n               I did not.  I was just...I didn't mean to...I was caught up in \n               the moment.\n \n               And she laughs again.\n\n               jOSH\n\n               What the hell are we going to do about this?\n\n               sARAH\n\n               Josh, you are a big boy.  You can take care of this on your own.\n \n               \n               Josh glares at her, starts his engine, and leaves her in the \n               dust.\n \n               cUT TO:\n\n\n               INT. TODD'S APARTMENT - DAY\n\n\n               Todd is on the kitchen phone.  Lorna's bracelet sits on the counter.\n \n               \n                                     TODD\n               (into phone)\n\n               No, no, no.  You don't understand.  I don't want an appointment, \n               I just need to get in touch with her...She left a package here \n               by mistake, a gift...No, I'd rather give it to her myself...Lorna, \n               but I assume none of you use your real names...What?  But she \n               was working last week?...And you don't have a forwarding number? \n                ...Look, it's really important that I get this back to her, \n               so--\n \n               The line goes dead.\n\n                                     TODD\n               Dammit.\n\n               He dials again.  Then, a knock at the door.  Todd reacts -- he's \n               not expecting anyone.\n \n               He opens the door and finds--\n\n                                     SARAH\n               Still dressed in the clothes she wore earlier.  She holds a small \n               paper bag.\n \n                                     TODD\n               Sarah...\n\n                                     SARAH\n               I brought you something.\n\n               She hands him the bag.  He looks inside.\n\n                                     TODD\n               Pickles.  Huh.\n\n               (beat)\n\n               What's in your hair?\n\n               She touches her hair.\n\n                                     SARAH\n               Oh.  Sawdust.  Lots of sawdust at the job site.\n\n               (beat)\n\n               Can I come in?\n\n               Todd puts the bag of pickles on the kitchen counter.  He sees \n               Lorna's bracelet...and slides it into a trash can.\n \n                                     CUT TO\n\n               INT. PHARMACY - NIGHT\n\n\n               Josh, still sporting his hickey, approaches the humorless teenage \n               GIRL behind the counter.\n \n                                     GIRL\n               Need some help?\n\n                                     JOSH\n               Yes, I have a problem.  I need some...something to cover up a...Hell, \n               just take a look.\n \n               Josh shows the Girl his hickey.\n\n                                     GIRL\n               Yeah.  You're fucked.\n\n                                     JOSH\n               I can do without the attitude, thank-you.\n\n                                     GIRL\n               Try concealer.  Aisle three.\n\n                                     JOSH\n               (impatient)\n\n               But what do I do with it?\n\n                                     GIRL\n               Just put it on.  And call your lawyer.\n\n               She smiles.\n\n                                     CUT TO\n\n               EXT. JOSH'S HOUSE - NIGHT\n\n\n               In the driveway of his fashionable home are two parked cars. \n                Josh's Mercedes S430 and his wife's Lexus RX300.\n \n               In the Mercedes, Josh finishes applying the concealer to his \n               neck.  He checks himself in the mirror -- the hickey is completely \n               gone.\n \n               His hands, however, have concealer all over them.\n\n                                     CUT TO\n\n               INT. JOSH'S BATHROOM - NIGHT\n\n\n               Josh washes his hands in the master bathroom.  He double-checks \n               his neck in the mirror.  From the adjoining bedroom, we hear \n               -- but do not see -- his wife GWEN.\n \n                                     GWEN\n               Unbelievable.\n\n                                     JOSH\n               What?\n\n                                     GWEN\n               I'm reading a stupid article in a stupid magazine.\n\n                                     JOSH\n               If it's stupid, why read it?\n\n                                     GWEN\n               (ignores this)\n\n               The whole issue is devoted to famous couples who are breaking \n               up.  Listen to this...Remember the blonde doctor on that show \n               you hate?\n \n                                     JOSH\n               Yeah.  She's a bore.\n\n                                     GWEN\n               She's breaking up with her husband of twenty years.  Said a friend, \n               \"Her show's in syndication, she's thin, she's rich and she wants \n               to play.\" Josh dries his hands.\n \n                                     JOSH\n               Some poor tree gave its life so we could know that.\n\n                                     GWEN\n               It's comforting, reading about these broken marriages.\n\n               Josh opens the door into the--\n\n\n               INT. JOSH'S BEDROOM - NIGHT\n\n\n               Gwen sits under the covers with her magazine.  In her late 30s, \n               she is a refined, patrician beauty.  As Josh undresses for bed--\n \n               \n                                     JOSH\n               Why?\n\n                                     GWEN\n               It's not enough for our marriage to succeed.  Everyone else's \n               must fail.\n \n                                     JOSH\n               Is this going to be one of those nights?\n\n                                     GWEN\n               What?\n\n                                     JOSH\n               One of those nights we talk.\n\n                                     GWEN\n               No.  There's no need to talk, because there's no problem.\n\n               He gets into bed next to her.\n\n                                     JOSH\n               I've been under a lot of stress.\n\n                                     GWEN\n               You don't have to apologize.  There's nothing wrong with the \n               slump we're going through.  In fact, it's a good thing.\n \n                                     JOSH\n               How's that?\n\n               He turns off the side light.  We can't see them -- the room is \n               completely dark.\n \n                                     GWEN\n               Too much passion can ruin a marriage.  Look at Eric and Sylvia. \n                At the beginning, you couldn't pry them apart.  They were joined \n               at the genitals.  And, then...total burn-out.  A marriage cannot \n               sustain that kind of intensity.  It's good for people to grow \n               bored with each other.  That way, they can meet and fall in love \n               again.\n \n               She snuggles up to him, strokes his back.\n\n                                     GWEN\n               In case you hadn't noticed...I'm trying to seduce you.\n\n                                     JOSH\n               I can feel that.\n\n                                     GWEN\n               You're welcome to reciprocate.\n\n               Josh turns on the light and sits up.\n\n                                     JOSH\n               I can't.\n\n                                     GWEN\n               It's alright.\n\n                                     JOSH\n               To seduce...to be seduced, there needs to be an element of surprise. \n                I know all your moves.  You know mine.  How can there be any \n               surprise?\n \n               Gwen sits up, throws back the sheet.\n\n                                     GWEN\n               Rub my feet.\n\n               He does.\n\n                                     GWEN\n               I think we should have an affair.\n\n                                     JOSH\n               What?\n\n                                     GWEN\n               With each other.\n\n                                     JOSH\n               That makes no sense.\n\n                                     GWEN\n               You pick me up at a bar...\n\n                                     JOSH\n               And, what?  Pretend I don't know you?\n\n                                     GWEN\n               (ignores him)\n\n               Or we could meet at a hotel.  I'll register under my maiden name. \n                Just like THE GRADUATE.\n \n                                     JOSH\n               THE GRADUATE is about a married woman having an affair with a \n               college boy.\n \n                                     GWEN\n               When I met you, you were a college boy.\n\n                                     JOSH\n               Gwen, THE GRADUATE is a story about a very unhappy woman who \n               has an affair out of wedlock.  As I recall, it turns out rather \n               badly for her.\n \n                                     GWEN\n               Alright.  Bad example.\n\n               (rethe foot rub)\n\n               You can stop.\n\n                                     JOSH\n               Actors pretend.  That's what they do.  I'm not an actor.  And \n               I love you the way you are.\n \n                                     GWEN\n               I love you, too.\n\n               And he turns out the light again.\n\n                                     JOSH\n               Pretending to be strangers is not going to solve the problem.\n \n               \n               Beat.\n\n                                     GWEN\n               Who said there was a problem?\n\n                                     CUT TO\n\n               INT. OFFICE BUILDING - NIGHT\n\n\n               A cocktail party at Josh's firm.  Josh is the center of attention, \n               greeting investors, fielding compliments.  Gwen stands beside \n               him, drinking champagne -- Dom Perignon, after all.\n \n                                     JOSH'S POV\n               Through the crowd he spots Sarah, entering with her date -- Todd.\n \n               \n                                     GWEN\n               Your lovely assistant is here.\n\n               (reTodd)\n\n               You didn't tell me she had a new boyfriend.\n\n                                     JOSH\n               I don't ask her about her personal life.\n\n               Sarah and Todd arrive.\n\n                                     SARAH\n               Hey, you two.  Todd, this is my boss Josh, and his wife Gwen.\n \n               \n               Todd and Josh shake hands.\n\n                                     TODD\n               Sarah's told me a lot about you.\n\n               Josh is not sure how to take that.\n\n                                     GWEN\n               Sarah, you look great.  You've been keeping my boy on his best \n               behavior?\n \n                                     SARAH\n               It's a dirty job, but somebody's got to do it.\n\n                                     GWEN\n               I know he asks to go above and beyond the call of duty.\n\n                                     SARAH\n               He can be tough.\n\n                                     JOSH\n               But fair.\n\n                                     GWEN\n               Josh, I'm trying to thank Sarah for all the extra attention she \n               gives you.\n \n                                     SARAH\n               You're welcome.\n\n                                     GWEN\n               We should really have you over for dinner, Sarah.  It's been \n               too long.  You can bring...\n \n                                     TODD\n               Todd.\n\n                                     GWEN\n               Sorry.  I'm hopeless when it comes to names.\n\n                                     JOSH\n               Especially after two glasses of champagne.\n\n                                     GWEN\n               Hey, I'm still working on the first, thank you.\n\n               (to Todd)\n\n               So, are you two living together?\n\n                                     TODD\n               Living together?  No.\n\n               Sarah and Todd both laugh.\n\n                                     SARAH\n               We've only known each other a few weeks.\n\n               Josh reacts -- he knew nothing of this.\n\n                                     GWEN\n               You two seem to fit.  It only took me a few days to know with \n               Josh.  In fact, I knew after the first date.\n \n                                     SARAH\n               You knew what?\n\n                                     GWEN\n               That he was the one for me.\n\n                                     JOSH\n               (to Sarah)\n\n               She loves to embarrass me.\n\n                                     SARAH\n               (to Gwen)\n\n               Don't stop.  I want to hear about this first date.\n\n                                     GWEN\n               Well, it was the cheapest date I've ever been on.\n\n                                     JOSH\n               I was broke.\n\n                                     GWEN\n               Do you know the Chinese place on Third?  That little hole-in-the-wall?\n \n               \n                                     TODD\n               I know it.  Used to be a cool dive.  Now it's ultra-hip and overpriced.\n \n               \n               This news gives Gwen pause.\n\n                                     GWEN\n               Really?  I think our first dinner cost a grand total of ten dollars.\n \n               \n                                     JOSH\n               Gwen loves to dissect our first date.\n\n                                     GWEN\n               It was a momentous night.  Babe, we should really go back there.\n \n               \n               Josh gestures to the bar.\n\n                                     JOSH\n               Gwen, why don't you continue your stroll down memory lane while \n               I drink?  Todd, you up for it?\n \n                                     TODD\n               Sure.\n\n               They move away toward--\n\n\n               INT. OFFICE BUILDING - THE BAR - NIGHT\n\n\n               As Josh and Todd sidle up--.\n\n                                     JOSH\n               (to bartender)\n\n               Gin.  Straight up.  Olives.\n\n               (Todd)\n\n               What are you having?\n\n                                     TODD\n               I'm fine, thanks.\n\n                                     JOSH\n               So...Sarah's an attractive girl.\n\n                                     TODD\n               Very.\n\n                                     JOSH\n               You two serious?\n\n                                     TODD\n               (shrugs)\n\n               Hard to say.\n\n                                     JOSH\n               She wants to play the field, right?\n\n                                     TODD\n               No, that's not it.\n\n                                     JOSH\n               I see.  You want to fuck around.\n\n               Todd reacts.\n\n                                     JOSH\n               C'mon, we're guys.  I know the drill.\n\n               Todd considers his audience, then decides to open up--\n\n                                     TODD\n               We dated a few times, and to be honest, I was on the fence about \n               Sarah.  I liked her, but I didn't think we were in a good groove. \n                Then, a couple weeks ago, her grandmother died.  Things changed.\n \n               \n                                     JOSH\n               I didn't know.\n\n               (beat)\n\n               She didn't say a thing about it.\n\n                                     TODD\n               It wasn't unexpected, but Sarah took it really hard.  So where \n               did that leave me?  I was ambivalent about things, right?  But \n               then my ambivalence had to take a back seat.  I had to be there \n               for her.  Completely.  And, ready or not, our relationship became...a \n               real relationship.\n \n               Josh simply listens.\n\n                                     TODD\n               You know, I wasn't ready to be that involved with anybody.  I \n               don't know...Death has a funny way of making you get outside \n               yourself.\n \n               Josh looks past Todd--\n\n                                     JOSH'S POV\n               Gwen is still chatting with Sarah.  Gwen makes eye contact with \n               Josh and sends him a warm smile.\n \n                                     CUT TO\n\n               INT. JOSH'S CAR - MOVING - NIGHT\n\n\n               Josh and Gwen drive home in silence.  Gwen notices something \n               out the window.\n \n                                     GWEN\n               You missed the on-ramp.\n\n                                     JOSH\n               I know.\n\n                                     GWEN\n               Why?\n\n                                     JOSH\n               Somewhere we need to go first.\n\n                                     CUT TO\n\n               EXT. CHINESE RESTAURANT - NIGHT\n\n\n               The Mercedes pulls up to the \"Happiness Chinese Restaurant.\" \n                Josh and Gwen get out and take in the sight--\n \n                                     GWEN\n               We don't have to do this tonight.\n\n                                     JOSH\n               Yes, we do.\n\n               She peers in the window.\n\n                                     GWEN\n               We can't go in here.  Everything's different.\n\n               He opens the door for her.\n\n                                     JOSH\n               That's okay.  We're different, too.\n\n                                     CUT TO\n\n               INT. CHINESE RESTAURANT - NIGHT\n\n\n               Upscale lighting.  Modern, non-Chinese decor.  Anything but a \n               hole-in-the-wall.\n \n               Josh and Gwen are in a booth--\n\n                                     GWEN\n               Sarah's a very interesting girl.  Did you know she's training \n               for the marathon?\n \n                                     JOSH\n               I don't want to talk about Sarah.\n\n                                     GWEN\n               What do you want to talk about, then?\n\n                                     JOSH\n               I want to talk about me...\n\n               A beat.\n\n                                     JOSH\n               ...and what a fool I've been.\n\n               Gwen is not prepared for this.\n\n                                     JOSH\n               I thought if we came here tonight we could...start again.\n\n                                     GWEN\n               (flustered)\n\n               But I thought you were over this place.  And, look...There's \n               nothing left.  Not one remnant of our first date...anywhere.\n \n               \n               Josh sees a plate of fortune cookies on the next table -- somebody \n               left without eating them.\n \n                                     JOSH\n               (brightens)\n\n               The fortune cookies haven't changed.\n\n               He brings over the plate.\n\n                                     GWEN\n               You're supposed to wait--\n\n                                     JOSH\n               I can't wait.  I have to know.\n\n               He opens the first.\n\n                                     JOSH\n               (reading)\n\n               \"You are on the verge of success\"...in bed.\n\n               Gwen laughs, opens one herself.\n\n                                     GWEN\n               (reading)\n\n               \"You will have a change of plans\"...in bed.\n\n               Josh reacts, opens a third.\n\n                                     JOSH\n               (reading)\n\n               \"You are very creative\"...in bed.\n\n                                     GWEN\n               Hmm.  That's what I've heard.\n\n                                     JOSH\n               The last cookie.  Go ahead.\n\n                                     GWEN\n               No.  You open it.\n\n               He slowly cracks in open.\n\n                                     JOSH\n               It's blank.\n\n               (checks both sides)\n\n               I got a blank.\n\n                                     GWEN\n               Blank...in bed.  That's disappointing.\n\n                                     JOSH\n               No, it's perfect.  Blank...no problems, no history, nothing...in \n               bed.\n \n               He takes her hand.\n\n                                     CUT TO\n\n               EXT. CHINESE RESTAURANT - NIGHT\n\n\n               Josh and Gwen approach their car.  It's late.  Behind them, the \n               restaurant is closing.\n \n                                     JOSH\n               By the way, I didn't get your name.\n\n                                     GWEN\n               What?\n\n               (off his smile)\n\n               Oh, my name.\n\n               She glances across the street.  A shop window sign reads, \"Bail \n               Bonds.\"\n \n                                     GWEN\n               My name is Gail.  Gail Bonds.\n\n                                     JOSH\n               Well, Gail, I'm not usually this forward on a first date, may \n               I take you to my car and ravish you?\n \n                                     GWEN\n               Hmm.  On one condition.\n\n                                     JOSH\n               What's that?\n\n                                     GWEN\n               That you tell me your name.\n\n                                     JOSH\n               Oh, I thought everyone knew my name.  I'm Bill Gates.  Billionaire.\n \n               \n               She laughs.\n\n\n               INT. JOSH'S CAR -- NIGHT\n\n\n               They get into the back seat and begin to kiss.\n\n                                     GWEN\n               Is it true what they say, Bill, about billionaires?  That all \n               the wealth is just a way to compensate...for size?\n \n                                     JOSH\n               People are jealous.\n\n                                     GWEN\n               I can imagine.  It must be so lonely at the top.\n\n               He reaches between her knees.\n\n                                     GWEN\n               What are you doing?\n\n                                     JOSH\n               What do you think I'm doing?\n\n               (beat)\n\n               The fortune cookie said you're on the verge of success...in bed.\n \n               \n                                     GWEN\n               We're not in a bed.\n\n                                     JOSH\n               You shouldn't read fortune cookies too literally.\n\n               Josh swings Gwen onto his lap.  They go at each other like...a \n               couple of college kids.\n \n                                     CLOSE ON JOSH\n               As he makes love to his wife, he thinks--\n\n                                     JOSH\n               ...Can anyone see us?...Is anyone looking?...Why should it bother \n               you?  You're alone...with your wife...That's the way it's supposed \n               to be...You know every inch of her...every smell...every sigh...every \n               freckle...the shape of her ass...the mole under her nipple...the \n               whole history of her body...And, you know that if you really \n               concentrate, you can succeed...in imagining...she's someone you \n               don't know...\n \n               He puts his mind to it--\n\n                                     FADE OUT:\n                                     FADE IN:\n\n               INT. GWEN'S HOUSE - DAY\n\n\n               Gwen and her mother JOANNE are in the living room looking at \n               samples of fabric.  At sixty, Joanne is robust and shrewd.\n \n               \n                                     GWEN\n               Color.  That's the problem with this room, it needs color.  Think \n               of...the vibrant colors of Haiti.\n \n                                     JOANNE\n               Personally, Haiti does nothing for me.  When your father and \n               I were there -- this was before you were born, I almost died \n               from a piece of lettuce, and I wouldn't want anything to remind \n               me of that trip.\n \n               (beat)\n\n               Anyway, quit changing the subject.\n\n               Gwen puts down the swatches.\n\n                                     GWEN\n               Alright.  I didn't say anything.\n\n                                     JOANNE\n               Because you're not sure?\n\n                                     GWEN\n               No, I'm sure.  I'm sure he's sleeping with her.\n\n               (beat)\n\n               And I may have to kill him.\n\n                                     JOANNE\n               Hmm.\n\n                                     GWEN\n               What?  You think I should just forget about it?\n\n                                     JOANNE\n               Yes, I do.\n\n                                     GWEN\n               Mother, don't you think honesty is essential in a marriage?\n \n               \n                                     JOANNE\n               It depends.  It can be quite detrimental.\n\n               Gwen begins to pace in exasperation.\n\n                                     JOANNE\n               Alright.  Confront him.  You know where it will get you.  Your \n               whole marriage will unravel, and you'll have nothing.  All the \n               things you take for granted -- month-long vacations in St. Lucia \n               -- they'll disappear.  You'll be a divorced woman in her late \n               30s.  Lonely.\n \n                                     GWEN\n               Why did I invite you over?  You make me feel like shit.\n\n                                     JOANNE\n               That's my job.\n\n               The phone rings.\n\n                                     GWEN\n               The machine can get it.\n\n                                     JOANNE\n               I don't monitor calls.  It makes me feel like I'm hiding in my \n               own home.\n \n               BEEP.  From the answering machine--\n\n                                     VOICE\n               Gwen, this is David Warren.  Hopefully, a welcome voice from \n               your past.  My show's on hiatus and I'm in town for the weekend. \n                I'd love to catch up.  Are you free for coffee...or something?\n \n               \n                                     JOANNE\n               Pick up the phone.\n\n               Gwen just stares at the machine.\n\n                                     VOICE\n               I have no idea what you're up to...I hope life is treating you \n               well.  I heard through a friend of a friend of a friend that \n               you're still married.  Congratulations.  If you want, give me \n               a call.  I'm crashing at my sister's.  The number is -- hold \n               on-- the number is 235-4511.  Hope to hear from you.\n \n                                     CLICK.\n                                     GWEN\n               Wow.\n\n                                     JOANNE\n               How long has it been?\n\n                                     GWEN\n               College.\n\n                                     JOANNE\n               Have you ever seen his show?  It's absolutely dreadful.  I never \n               miss it.\n \n                                     GWEN\n               If Josh isn't home, I'll watch it.\n\n                                     JOANNE\n               Hmm.  It's Kismet, then.\n\n                                     GWEN\n               What?\n\n                                     JOANNE\n               A brief liaison with an old flame.  The perfect way to deal with \n               your anger.\n \n                                     GWEN\n               You're insane.  You're an insane mother.\n\n                                     JOANNE\n               It'll be good for your self-esteem.\n\n                                     GWEN\n               Did it occur to you that maybe he just wants to have coffee?\n \n               \n               Joanne crosses to the answering machine.  Rewinds the tape.  \n               Hits play.\n \n                                     DAVID'S VOICE\n               ...on hiatus and I'm in town for the weekend.  Are you free for \n               coffee...or something?\n \n               She hits stop.\n\n                                     JOANNE\n               \"Coffee...or something.\"  He's flirting, admit it.  Coffee...or \n               something.\n \n                                     GWEN\n               He's stammering.  He's nervous.  He's calling out of the blue!\n \n               \n               Joanne gathers her purse.\n\n                                     JOANNE\n               You're wrong.  I'm right, and I'm going.  But take a tip from \n               someone who's been there.  Opportunity is knocking, Gwen.  You \n               have a chance to level the playing field.\n \n               (beat)\n\n               You have a chance to do something good for your marriage.\n\n               Joanne exits.\n\n                                     CUT TO\n\n               INT. GWEN'S BATHROOM - DAY\n\n\n               Morning.  Gwen, fresh from the shower, studies her face in the \n               mirror as Josh -- unseen, in the bedroom -- dresses for work.\n \n               \n                                     JOSH\n               You're right.  We could use some more color in the living room.\n \n               \n               (beat)\n\n               Gwen?\n\n                                     GWEN\n               Yes?\n\n                                     JOSH\n               I said you're right.\n\n                                     GWEN\n               About what?\n\n                                     JOSH\n               About more color in the living room.\n\n                                     GWEN\n               Oh.  I'm glad you think so.\n\n               She leans closer to inspect a new wrinkle.\n\n                                     CUT TO\n\n               INT. HOTEL LOBBY - DAY\n\n\n               An upscale hotel.  Gwen, in a sheer blouse and a slim leather \n               skirt, fills out the registration card at the front desk.  The \n               DESK CLERK looks up from his computer.\n \n                                     DESK CLERK\n               And how many nights will you be staying with us?\n\n                                     GWEN\n               One.\n\n                                     DESK CLERK\n               We do have a two-night minimum.\n\n                                     GWEN\n               Then...two.\n\n               She hands him the card.\n\n                                     GWEN\n               I'd like to pay in cash.\n\n                                     DESK CLERK\n               That won't be a problem.  We just need a credit card imprint \n               for your incidentals...\n \n               Gwen reacts.  The Desk Clerk puts her at ease.\n\n                                     DESK CLERK\n               ...which we tear up when you check out.\n\n               Gwen smiles.\n\n                                     DESK CLERK\n               Will you be needing more than one key?\n\n                                     GWEN\n               Two, please.\n\n                                     CUT TO\n\n               INT. HOTEL RESTAURANT - DAY\n\n\n               Gwen and DAVID lunch in the hotel's elegant dining room.  David \n               is quite the draw, turning heads across the room.  And, it's \n               no wonder.  He has real magnetism.\n \n                                     DAVID WARREN\n               I'm still reeling.  It was the most humbling experience of my \n               life.  Getting raked over the coals by a bunch of sixteen-year \n               old drama students!  At my own alma mater!\n \n                                     GWEN\n               I'm surprised they weren't all over you.\n\n                                     DAVID WARREN\n               They were, with knives drawn.\n\n                                     GWEN\n               What did they say?\n\n                                     DAVID WARREN\n               Basically, why am I working on a piece of shit like MALIBU NIGHTS \n               when I should be doing Shakespeare or Chekhov?\n \n               (beat)\n\n               It was brutal.\n\n               A WAITER delivers a bottle of champagne to David.\n\n                                     WAITER\n               Compliments from the table in the corner.\n\n               The Waiter gestures.  David and Gwen turn.  In the corner three \n               middle-aged women are smiling.\n \n               David mouths a gracious \"thank you\" their way.\n\n                                     GWEN\n               See?  Those women are happy you're not doing Shakespeare.\n\n               Beat.\n\n                                     DAVID WARREN\n               Gwen.  You look great.  You haven't changed a bit.\n\n                                     GWEN\n               I don't think I'm MALIBU NIGHTS material.\n\n                                     DAVID WARREN\n               Those women!  Walking boob jobs.  They're appalling.\n\n                                     GWEN\n               You look like you enjoy kissing them.\n\n                                     DAVID WARREN\n               It's very simple.  I close my eyes and imagine I'm kissing someone \n               else.\n \n                                     GWEN\n               Hmm.  Someone else in particular?\n\n                                     DAVID WARREN\n               Yes.\n\n                                     GWEN\n               If she's as tan as you, I don't want to hear about it.\n\n               David reaches for his wallet.\n\n                                     DAVID WARREN\n               Here, take a look...\n\n               He hands her a photo.  In it, we see David standing with a distinguished \n               man in his mid-40s.  With them is a smiling boy, about eleven.\n \n               \n               Gwen is nonplussed.\n\n                                     DAVID WARREN\n               What's wrong with this picture, huh?\n\n               She smiles.\n\n                                     GWEN\n               Well...Let's start with the man, upper left.\n\n                                     DAVID WARREN\n               Andy.  My partner.  And the best thing that's ever happened to \n               me.\n \n                                     GWEN\n               Okay.  And the boy?\n\n                                     DAVID WARREN\n               Eric.  He's Andy's son from a marriage that -- needless to say \n               -- didn't work.  Andy came out when Eric was just five.  Great \n               kid.\n \n                                     GWEN\n               And when did you...?\n\n                                     DAVID WARREN\n               Come out?  About fifteen years ago.\n\n               (off Gwen's look)\n\n               Is this too much information?\n\n                                     GWEN\n               No.  But fifteen years ago...That was right after--\n\n                                     DAVID WARREN\n               You and me.\n\n                                     GWEN\n               Was I the last woman?\n\n               David nods.\n\n                                     GWEN\n               Was I that bad?\n\n               David laughs.\n\n                                     DAVID WARREN\n               No, you were fantastic.  I was completely confused.\n\n               Gwen quickly gulps down some champagne.\n\n                                     DAVID WARREN\n               What's the matter?\n\n                                     GWEN\n               Nothing.  I'm very happy for you.  And, I have to confess, I'm \n               relieved.\n \n                                     DAVID WARREN\n               Why?\n\n               Beat.\n\n                                     GWEN\n               Oh -- what the hell -- we're friends, right?\n\n                                     DAVID WARREN\n               I'm listening.\n\n                                     GWEN\n               I had this ridiculous idea that you wanted to get together to \n               have a...\n \n                                     DAVID WARREN\n               Oh.\n\n                                     GWEN\n               You know...for old time's sake.\n\n                                     DAVID WARREN\n               Uh-huh.\n\n                                     GWEN\n               And, frankly, I wasn't looking forward to turning you down.  \n               Which I would have, of course.  Had you...asked.  Which you're \n               not, because you're...you're...\n \n                                     DAVID WARREN\n               Married.\n\n                                     GWEN\n               Right.\n\n                                     DAVID WARREN\n               Happily.\n\n                                     GWEN\n               Right.\n\n               She slides her empty glass toward him.\n\n                                     GWEN\n               Would you pour me a little more, David?\n\n                                     CUT TO\n\n               INT. HOTEL LOBBY -DAY\n\n\n               Gwen leans against the front desk.  Tipsy.  The Desk Clerk approaches.\n \n               \n                                     DESK CLERK\n               Can I help you, ma'am?\n\n               Gwen looks lost.\n\n                                     DESK CLERK\n               Are you okay?\n\n                                     GWEN\n               I'd like to check out.\n\n                                     DESK CLERK\n               Was there a problem?\n\n                                     GWEN\n               Yes.  I was stood up...by the past.\n\n               Beat.\n\n                                     DESK CLERK\n               I'm sorry.  We won't charge you for the room.\n\n                                     GWEN\n               No, you don't understand.\n\n                                     DESK CLERK\n               Yes.  I do.\n\n               (beat)\n\n               More than you might think.\n\n               Gwen stares at him.\n\n                                     DESK CLERK\n               Shall I close out the account?\n\n                                     GWEN\n               No.  I need the room after all.\n\n               (beat)\n\n               Will you show me the way there?\n\n               The Desk Clerk looks at her with no apparent interest.\n\n                                     DESK CLERK\n               You're in luck.  I was just about to take my break.\n\n                                     CUT TO\n\n               INT. ELEVATOR - DAY\n\n\n               The Desk Clerk and Gwen ride in the elevator.  Silently.  There \n               is no discernible connection between them.\n \n                                     CUT TO\n\n               INT. HOTEL HALLWAY - DAY\n\n\n               The Desk Clerk leads Gwen to the room.  It couldn't look more \n               business-like.\n \n                                     CUT TO\n\n               INT. HOTEL ROOM - DAY\n\n\n               They enter.  He locks the door.  She surveys the room.\n\n                                     DESK CLERK\n               Something from the mini-bar?\n\n                                     GWEN\n               No.\n\n                                     DESK CLERK\n               How's the air conditioning?\n\n                                     GWEN\n               Fine.\n\n                                     DESK CLERK\n               Shall I pull down the covers?\n\n                                     GWEN\n               I suppose.\n\n                                     DESK CLERK\n               Do you want to know my name?\n\n                                     GWEN\n               No.\n\n               He takes her in his arms.\n\n                                     DESK CLERK\n               You're shaking.\n\n                                     GWEN\n               I'll be fine.\n\n               (beat)\n\n               This could get you in trouble.  You could lose your job, right?\n \n               \n                                     DESK CLERK\n               I don't care.\n\n                                     GWEN\n               You don't even know me.\n\n                                     DESK CLERK\n               You're right.\n\n                                     GWEN\n               We have nothing in common.\n\n               Beat.\n\n                                     DESK CLERK\n               That's where you're wrong.\n\n               He begins to unbutton her blouse.  Without touching.  Without \n               affection.  After a beat, she begins to unbutton his shirt.\n \n               \n                                     CUT TO\n\n               INT. HOTEL HALLWAY - DAY\n\n\n               A little later.  A maid vacuums the carpet as the Desk Clerk \n               emerges, followed by Gwen.  They cross to the elevator, as business-like \n               as before.\n \n                                     DESK CLERK\n               (to the Maid)\n\n               Buenas tardes, señora.\n\n                                     CUT TO\n\n               INT. ELEVATOR - CONTINUOUS\n\n\n               Gwen and the Desk Clerk board the elevator.  He presses \"L\" for \n               lobby.  She presses \"P\" for parking.\n \n                                     GWEN\n               Thank you for taking care of the room.\n\n                                     DESK CLERK\n               Your welcome.\n\n               And they ride in silence.\n\n               In Gwen's mind--\n\n                                     GWEN\n               ...And now the score is tied...Oh my God, what will I tell my \n               mother?  I did it with a desk clerk.  Hardly the affair to remember...Of \n               course, she will disapprove.  \"Is English even his first language? \n                This is your idea of a liaison?  Your idea of leveling the playing \n               field?  You don't even know the boy's name--\" \n \n               Gwen touches the Desk Clerk's arm.\n\n                                     GWEN\n               What's your name?\n\n                                     DESK CLERK\n               David.\n\n                                     GWEN\n               What?  You're kidding me.\n\n               Gwen laughs -- she can't help it.\n\n                                     DAVID\n               No.  What's so funny?\n\n                                     GWEN\n               Nothing, it's just--\n\n               She laughs even harder.  The elevator door opens.  David gets \n               out and looks at her oddly.\n \n                                     GWEN\n               Sorry, I just...I didn't think you'd be named David.\n\n\n               INT. HOTEL LOBBY - DAY\n\n\n               The door closes on Gwen, leaving David in the lobby.  A bit befuddled.\n \n               \n\n               INT. HOTEL FRONT DESK - DAY\n\n\n               David resumes his post.  DESK CLERK #2 works beside him.  He \n               leans to David--\n \n                                     DESK CLERK #2\n               There's a woman waiting to see you.  She's been here for half \n               an hour.\n \n               He points to a lobby chair, where we find ROSALIE -- 22, spunky, \n               mercurial.  In short...trouble.\n \n               She and David made eye contact.  She springs up and advances \n               toward him.\n \n                                     DAVID\n               Why are you here?\n\n                                     ROSALIE\n               You weren't going to return my calls.\n\n                                     DAVID\n               Don't you have more important things to do?  Picking flowers, \n               honeymoon reservations...\n \n                                     ROSALIE\n               Is there somewhere we can talk?\n\n               The desk phone rings.  David picks it up.\n\n                                     DAVID\n               (into phone)\n\n               Front desk, David speaking...No, sir.  Tap water is very drinkable \n               in this city...Of course, sir.  We'll send up some bottled water \n               right away.\n \n               He hangs up.\n\n                                     ROSALIE\n               Is there somewhere we can talk?\n\n                                     DAVID\n               What's wrong with here?\n\n                                     ROSALIE\n               Privately.\n\n                                     DAVID\n               But here, I won't be tempted to raise my voice or do something \n               rash.  That's the first lesson of hotel management.  Never lose \n               your cool, no matter how annoying the guest is.  Not that I plan \n               to go into hotel management.  I don't have ambitions in that \n               direction.  Or any direction, if I recall you correctly.\n \n               The desk phone rings again.  Exasperated, David grabs it.\n\n                                     DAVID\n               (into phone)\n\n               Front desk, David speaking...Yes, ma'am, the restaurant has a \n               smoking section...Well, I didn't make the policy...If it's any \n               consolation, the smokers are seated in a little corner of the \n               patio, and they feel very bad about themselves.\n \n               He hangs up.  And gives Rosalie a very deliberate look.\n\n                                     DAVID\n               Rosie, you'd better leave.  Before I get myself fired.\n\n               She starts to protest.  Thinks better of it, and exits.\n\n                                     CUT TO\n\n               INT. EMPLOYEE BREAK ROOM - DAY\n\n\n               David hangs his uniform shirt in his locker.  He gathers his \n               personal things.  A jacket, a knapsack, and...a violin case.\n \n               \n               The HOTEL MANAGER approaches.\n\n                                     HOTEL MANAGER\n               Yo, fiddler on the roof.\n\n               David reacts -- this is the last person he wants to deal with.\n \n               \n                                     HOTEL MANAGER\n               (regards the violin)\n\n               Wish I could play an instrument.  Chicks really dig that stuff. \n                Tried the guitar in high school.  What can I say?  No discipline.\n \n               \n                                     DAVID\n               Discipline.  Always a struggle.\n\n                                     HOTEL MANAGER\n               I hear you.  For instance, it takes a certain discipline to know \n               that when you're working at the hotel, when you're on the clock...\n \n               \n               (shrugs)\n\n               ...you shouldn't fuck the guests.\n\n               David was not expecting this.\n\n               HOTEL MANAGER (cont'd)\n\n               You want to bring your girlfriend here on your day off?  That's \n               a different story.  I'll even give you the corporate rate on \n               a room.\n \n               (beat)\n\n               Just don't do it while you're on the clock.  You hear me?\n\n                                     DAVID\n               It won't happen again.\n\n                                     HOTEL MANAGER\n               Good.\n\n               David marches away.\n\n                                     CUT TO\n\n               INT. MUSIC CONSERVATORY - DAY\n\n\n               In a sun-lit practice room, a string quartet rehearses.  Four \n               men -- David included, perform an energetic movement from a Beethoven \n               quartet.\n \n               NOTE: Throughout the film, we've heard this string quartet as \n               underscore.  Now...we meet the soundtrack.\n \n               David plays with emotion and a physicality we haven't seen in \n               him -- truly, this is where he lives.\n \n                                     CUT TO\n\n               INT. CONSERVATORY HALLWAY - DAY\n\n\n               After the rehearsal.  Violin at his side, David trudges through \n               the exit.  Music emanates from every room.  He turns a corner, \n               runs smack into--\n \n                                     ROSALIE.\n               She's been waiting.\n\n                                     DAVID\n               Jesus!\n\n               She simply picks up where they left off--\n\n                                     ROSALIE\n               I want you to be there on Sunday.\n\n                                     DAVID\n               No.\n\n                                     ROSALIE\n               You told me we'd always be friends.\n\n                                     DAVID\n               I lied.\n\n                                     ROSALIE\n               You're an important part of my life, David.  There's so much \n               history between us.  I don't want to trash it simply because--\n \n               \n                                     DAVID\n               Because what?  Because you're getting married?\n\n               Beat.\n\n                                     DAVID\n               Rosie, I want you to be happy.  I do.  And someday, we'll be \n               friends.  Someday, we'll all go out to dinner.  The four of us.\n \n               \n                                     ROSALIE\n               The four of us?\n\n                                     DAVID\n               Sure.  Me, you, Jerry, and whatever pale imitation of you I can \n               dig up to be my date.\n \n                                     ROSALIE\n               Stop it.\n\n               But he's on a roll--\n\n                                     DAVID\n               And the check will come and Jerry will pick up the tab and I'll \n               protest, but not too much.  Then, you'll give me a kiss on the \n               cheek, and some dim memory will stir in me, but not for too long. \n                And we'll say, \"It was great to see you.\"  And it will be great \n               to see you...\n \n               (beat)\n\n               ...then.  But, until then....good-bye.\n\n               David exits, leaving Rosalie alone in the cacophonous hall.\n \n               \n                                     CUT TO\n\n               INT. APARTMENT - DAY\n\n\n               A clean, modern apartment that Rosalie shares with JERRY -- late \n               20s, upstanding, sturdy good looks.\n \n               Rosalie and Jerry sit in the living room, meeting with their \n               WEDDING PLANNER -- a highly efficient woman in her mid-50s.\n \n               \n                                     WEDDING PLANNER\n               We've  got a few more things to cover.  The photos.  There's \n               a courtyard behind the church.  It's a popular backdrop.  Our \n               photographer says the light is gorgeous.  We need twenty minutes \n               before the ceremony for singles.\n \n               (beat)\n\n               Oh.  Jerry, your father's press secretary insists on sending \n               someone from the papers.  I told him you want to keep this as \n               private as possible, but...What could I do?\n \n                                     JERRY\n               I know.  It is an election year.\n\n                                     WEDDING PLANNER\n               Exactly what he said.\n\n                                     ROSALIE\n               It's okay.\n\n                                     WEDDING PLANNER\n               Right.  The guest list.  We have a few more no-show's.\n\n               She consults a list.\n\n                                     WEDDING PLANNER\n               Mr. and Mrs. Bennett send their regrets.  Also, Ms. Rothman will \n               no be attending.\n \n                                     ROSALIE\n               Oh.  David Freeman.  He's not coming.\n\n               Jerry reacts.\n\n                                     JERRY\n               He's not?\n\n                                     ROSALIE\n               No.  He's not.\n\n                                     JERRY\n               After all that shit you put me through, now he's not even coming.\n \n               \n               The Wedding Planner smiles politely.\n\n                                     WEDDING PLANNER\n               So, if there are any last-minute--\n\n                                     JERRY\n               (ignores her)\n\n               I guess that means you've been talking with him.\n\n                                     ROSALIE\n               Yes, I talked to him.  And I...\n\n               (to Wedding Planner)\n\n               Would you excuse us for a minute?\n\n                                     WEDDING PLANNER\n               Take your time.\n\n               Rosalie gets up and leads Jerry into--\n\n\n               INT. APARTMENT KITCHEN -- DAY\n\n\n               Once they are out of earshot--\n\n                                     ROSALIE\n               I talked to David.  And...I uninvited him.\n\n                                     JERRY\n               What?\n\n                                     ROSALIE\n               I told him it wasn't right.  I told him he shouldn't be at our \n               wedding.\n \n                                     JERRY\n               When did you decide this?\n\n                                     ROSALIE\n               I don't know...I just realized I don't want our wedding to be \n               about where I've been.  I want it to be about where you and I \n               are going.\n \n                                     JERRY\n               What did he say?\n\n                                     ROSALIE\n               Jerry...\n\n                                     JERRY\n               I want to know.\n\n                                     ROSALIE\n               He was disappointed--\n\n                                     JERRY\n               Of course he was.  He's still in love with you.\n\n                                     ROSALIE\n               But he understands.  I drew the line, honey.\n\n                                     JERRY\n               Thank-you.\n\n                                     ROSALIE\n               I did it for us.\n\n               Rosalie gives him a kiss.\n\n                                     CUT TO\n\n               INT. DAVID'S APARTMENT - NIGHT\n\n\n               Amidst a clutter of unpaid bills, take-out cartons, and laundry, \n               David practices the violin.  He plays a Bach Partita -- not for \n               the easily intimidated.\n \n               The phone rings.  He lets it ring a while before picking up.\n \n               \n                                     DAVID\n               (into phone)\n\n               What do you want, Rose?\n\n                                     ROSALIE\n               Were you sleeping?\n\n                                     DAVID\n               Yes.  I was.\n\n                                     ROSALIE\n               Liar.  You're practicing.  I can hear you.\n\n               He moves to the window.\n\n                                     DAVID'S POV\n               Rosalie -- on her cell -- waves to him from the sidewalk, three \n               stories below.\n \n                                     ROSALIE\n               It's so sad.  Why do you always play sad songs?\n\n                                     DAVID\n               I don't write 'em, Rose.\n\n               (beat)\n\n               Is our conversation over now?\n\n                                     ROSALIE\n               Please let me in.\n\n                                     DAVID\n               No.\n\n               She laughs mischievously.\n\n                                     ROSALIE\n               You don't trust me?\n\n                                     DAVID\n               No.\n\n               (beat)\n\n               Stay there.  I'll be right...Wait a minute.  This is insane. \n                I'm not coming down.  Go home, Rose.  I mean it.\n \n                                     ROSALIE\n               I'm going to wait here for one minute.  Sixty seconds.\n\n                                     DAVID\n               You do that.\n\n                                     ROSALIE\n               Then, I'm gone.  You won't see me again.\n\n               She hangs up.  He hangs up.\n\n                                     DAVID'S POV\n               Rosalie sits on the front steps.  Stubborn.\n\n                                     DAVID\n               (to himself)\n\n               Be my guest.  Sit there all night.\n\n               David turns from the window.  He accidentally knocks his metronome \n               to the floor, setting it off.  Click...click...click...\n \n               David shuts it off, goes to the door.\n\n               His hand on the knob--\n\n                                     DAVID\n               If I go down those stairs...it will only lead to one place...right \n               back here...the two of us...a short, brilliant moment...one more \n               to add to the gallery...then, empty-handed again, with nothing \n               to show for it but an emotional hangover...I'm not going to open \n               this door... Discipline... Like the man said, don't fuck the \n               guests...\n \n                                     CUT TO\n\n               EXT. DAVID'S APARTMENT - NIGHT\n\n\n               Rosalie is on the front steps.  She smiles as she hears the door \n               open -- it's David.\n \n               He joins her.\n\n                                     DAVID\n               I've got nothing to say to you.\n\n                                     ROSALIE\n               Fine.  I'll talk...\n\n               A beat.\n\n                                     ROSALIE\n               The reason I won't just leave you alone is not because I'm \"confused.\" \n                My feelings are perfectly clear.  I know you find it incomprehensible \n               that I can love Jerry and love you.  And that one love has nothing \n               to do with the other.  But it's true.\n \n                                     DAVID\n               Rose...\n\n                                     ROSALIE\n               What?\n\n                                     DAVID\n               This is bullshit.  I can't spell it out any more plainly.  It's \n               impossible!\n \n                                     ROSALIE\n               Why?\n\n                                     DAVID\n               Because I can't be this close to you...and not want to touch \n               you.\n \n                                     ROSALIE\n               That's it?\n\n                                     DAVID\n               That's...it.\n\n               And he does touch her.  He puts his hand on her leg.\n\n                                     DAVID\n               And if I can't do that, I don't want to be your friend.  Not \n               now.  Not ever.\n \n                                     ROSALIE\n               Don't be so mean.\n\n               David flashes an angry look.  Then, he pulls Rosalie close to \n               him.\n \n                                     DAVID\n               The bottom line is...If I'm with you, I have to touch you, to \n               kiss you.  That doesn't work for friends, does it?\n \n               She doesn't answer -- she lets him stroke her leg.\n\n                                     DAVID\n               When I'm not with you -- this is more than you need to know...If \n               I touch myself, I can only think about one person. You.  No one \n               else.  Just you.\n \n               (beat)\n\n               Friends...that's bullshit.\n\n                                     ROSALIE\n               What do we do?\n\n                                     DAVID\n               What do you mean \"we\"?  This is your problem.\n\n               (beat)\n\n               My only problem is how to get you out of my mind.  How to erase \n               you...Delete every bit of you...\n \n               (presses an imaginary key)\n\n               Into the ether...\n\n                                     ROSALIE\n               Stop...\n\n               She kisses him.  He engulfs her in his arms.\n\n                                     DAVID\n               You have to say good-bye.\n\n                                     ROSALIE\n               I don't know how...\n\n                                     CUT TO\n\n               INT. DAVID'S BEDROOM - NIGHT\n\n\n               David and Rosalie have sex on the single bed in his spartan room. \n                She's on top of him -- they face each other.\n \n               The lovemaking is both fierce and tender -- longing and leaving, \n               rolled into one.\n \n               As Rosalie grows more aroused, she begins to cry.  Tears quietly \n               stream down her cheeks.\n \n               David reacts--\n\n                                     DAVID\n               Should we stop?\n\n               Rosalie is too choked up to answer -- she shakes her head \"no.\" \n                And they continue -- tears and sex.\n \n                                     CUT TO\n\n               INT. DAVID'S BEDROOM - LATER - NIGHT\n\n\n               David sits in bed alone, while Rosalie showers in the adjoining \n               bathroom.\n \n                                     ROSALIE\n               David, will you hand me my shampoo?  It's in my purse.\n\n               David opens Rosalie's purse and finds a travel-size bottle of \n               shampoo.\n \n               He just shakes his head.\n\n                                     CUT TO\n\n               INT. ROSALIE'S CAR - MOVING - NIGHT\n\n\n               Rosalie drives home.  Checks herself in the mirror -- her hair \n               is still damp.  She rolls down the window to \"blow dry\" it.\n \n               \n               She turns on the radio, finds a rock-and-roll station.  Noisy, \n               mindless, perfect.\n \n               In her mind--\n\n                                     ROSALIE\n               Hail Mary, full of Grace, blessed be the  fruit of thy womb Jesus...Holy \n               Mary, Mother of God, pray for us sinners, now and at the hour \n               of our death, Amen...Hail Mary, full of Grace, blessed be the \n               fruit of...\n \n                                     CUT TO\n\n               INT. ROSALIE'S APARTMENT - NIGHT\n\n\n               After midnight.  Rosalie slips inside the door.  No sign of Jerry. \n                She removes her shoes and tiptoes into--\n \n\n               INT. ROSALIE'S BEDROOM - NIGHT\n\n\n               The television is on -- the sound is muted.  An infomercial is \n               playing.  Jerry is sleeping.\n \n                                     ON ROSALIE\n               She nudges him.  He doesn't stir.  Rosalie sits at the foot of \n               the bed.  She grabs the remote and \"un-mutes\" the sound.\n \n\n               INT. ROSALIE'S BEDROOM - ON TV - NIGHT\n\n\n               A physical fitness EXPERT is talking.\n\n                                     EXPERT\n               ...And the change is not just physical.  You'll be amazed how \n               quickly your whole outlook will--\n \n\n               INT. ROSALIE'S BEDROOM - NIGHT\n\n\n               She flicks off the TV.\n\n               Rosalie undresses and climbs into bed.  She starts to kiss Jerry. \n                Slowly, he wakes.\n \n                                     JERRY\n               Hey...\n\n                                     ROSALIE\n               Hey...\n\n                                     JERRY\n               What time is it?\n\n                                     ROSALIE\n               Late.\n\n               He looks at the time.\n\n                                     JERRY\n               It is late.  What happened?\n\n                                     ROSALIE\n               Oh.  The girls.  Wedding talk.  We could've gone on all night.\n \n               \n               She rubs his chest.\n\n                                     ROSALIE\n               Jerry...\n\n                                     JERRY\n               What?\n\n                                     ROSALIE\n               We need to make love now.\n\n                                     JERRY\n               Okay...why now?\n\n                                     ROSALIE\n               I can't explain it.  We just need to make love now.\n\n               He nods.  He kisses her neck, her breasts.\n\n               Suddenly she stops him, taking his face in her hands.\n\n                                     JERRY\n               What's the matter?\n\n                                     ROSALIE\n               I just need to fix this moment in my mind.\n\n               A long beat.  She studies his face.\n\n                                     ROSALIE\n               I love you.  Totally.  Completely.  I don't want to spend another \n               minute of my life without you.\n \n               (off his reaction)\n\n               You don't have to say anything.\n\n               She climbs on top of him.\n\n                                     JERRY\n               You're forgetting something.\n\n                                     ROSALIE\n               No, I'm not.\n\n               He laughs uncomfortably.\n\n                                     JERRY\n               Don't you think...\n\n                                     ROSALIE\n               No, I don't.  Let's not use it tonight.\n\n               (beat)\n\n               I'm ready.\n\n               A beat.\n\n                                     JERRY\n               If you're ready, so am I.\n\n               She straddles him, rocking back and forth.  With grim determination.\n \n               \n                                     ROSALIE\n               Jerry?\n\n                                     JERRY\n               What?\n\n                                     ROSALIE\n               Talk to me...\n\n                                     FADE OUT:\n                                     FADE IN:\n                                     OMITTED\n\n               INT. PHOTOGRAPHY STUDIO - DAY\n\n\n               Jerry and Rosalie -- dressed informally -- pose for a publicity \n               photo.\n \n               The photographer is Todd.\n\n               Each click of his camera brings a blinding FLASH.\n\n               todd\n\n               Very good...you both look great...perfect shot for the paper.\n \n               \n               rOSALIE\n\n               (to Jerry, sotto voce)\n\n               I didn't mean to put pressure on you.\n\n               jeRRY\n\n               Babe, you're making too much out of this.\n\n               (beat)\n\n               It's not like I didn't enjoy making love.\n\n                                     FLASH!\n               rOSALIE\n\n               I know.\n\n               (beat)\n\n               But I also know you would've enjoyed it more if I hadn't...\n \n               \n               jeRRY\n\n               Raised the stakes?\n\n               roSALIE\n\n               I wasn't going to put it that way.\n\n               (beat)\n\n               But it's true.\n\n               jeRRY\n\n               Maybe it is.  But, please don't read too much into it.\n\n                                     FLASH...FLASH!\n               rOSALIE\n\n               I won't.  I promise.\n\n               cUT TO:\n\n\n               INT. CHURCH - NIGHT\n\n\n               High ceiling.  Stained glass windows.  Dark mahogany pews.\n\n               At the altar, Jerry and Rosalie confer with their PRIEST -- late \n               60s, doctrinaire.  They're rehearsing.\n \n                                     PRIEST\n               A lot of young couples prefer \"husband and wife\" to the traditional \n               \"man and wife.\"  Personally, I don't feel the phrase \"man and \n               wife\" gives the woman a diminutive status.  But I leave the choice \n               in your hands.  Do you have a--\n \n                                     ROSALIE\n               Husband and wife.  Definitely.\n\n               Jerry simply nods.\n\n                                     PRIEST\n               Good.\n\n               (to Jerry)\n\n               After the blessing, I'll instruct you to kiss the bride.  Keep \n               it simple.  No slobbering.\n \n                                     ROSALIE\n               That could be tough.  For him.\n\n               The Priest feigns amusement.\n\n                                     PRIEST\n               Remember, this is God's house.  And there will be prominent people \n               here as well.  Not to mention the press.  So, let's keep things \n               on the up-and-up.\n \n               JerRY\n\n               Right.\n\n                                     CUT TO:\n\n               INT. TOBACCO SHOP - DAY\n\n\n               Jerry accompanies his FATHER -- late 50s, on a cigar-buying expedition. \n                Tobacco enthusiasts relax in leather chairs.  Wafts of smoke \n               hang in the air -- expensive smoke.\n \n               Jerry's Father finds a brand he likes.\n\n                                     FATHER\n               Here we are.  Bahia Gold.  Two hundred a box.\n\n                                     JERRY\n               You don't have to do this, Dad.\n\n                                     FATHER\n               If I can't come to the bachelor party, I want to be there in \n               spirit.\n \n               (beat)\n\n               The boys will like these.  Classic.\n\n                                     JERRY\n               Thank-you.\n\n                                     FATHER\n               I remember my bachelor night.  Frankly, I wish I didn't.  Not \n               a night I'm particularly proud of...I'll leave it at that.\n \n               \n                                     JERRY\n               Why are you sharing this?\n\n                                     FATHER\n               Reminiscing.  That's all.\n\n                                     JERRY\n               Or warning me.\n\n                                     FATHER\n               Nonsense.  I know you.  You won't make an ass out of yourself.\n \n               \n               (beat)\n\n               Oh...A little something from your mother and me.\n\n               He reaches into his pocket, hands Jerry a key.\n\n                                     JERRY\n               What's this?\n\n                                     FATHER\n               It's a key.\n\n               (smiles)\n\n               There's a new housing development, just west of here.  I've been \n               giving the developer a lot of breaks, and...now he's giving me \n               one in return.  I'm almost embarrassed to say how little this \n               cost me.\n \n                                     JERRY\n               I can't accept this.\n\n                                     FATHER\n               Yes, you can.\n\n               (beat)\n\n               C'mon.  Make your old man happy.\n\n               Jerry says nothing.\n\n                                     FATHER\n               Uh-huh.  I get it.  This is Rosalie's domain.  She should have \n               a say in where you two settle down.  But don't worry, you won't \n               be forcing her hand.  Know why?  Because she's going to love \n               it.\n \n               Jerry just nods.\n\n                                     FATHER\n               Let's ring these babies up.\n\n                                     CUT TO\n\n               INT. TOWNHOUSE - NIGHT\n\n\n               Bachelor party in progress.  In the living room, a dozen guys \n               smoke Cuban-rolled cigars, drink shots of Tequila, and watch \n               a Stripper perform.\n \n               The least boisterous of the group is Jerry, who watches the action \n               with a drunken glow.\n \n               The party's host, Jerry's BEST FRIEND, enters and summons Jerry \n               into--\n \n\n               INT. TOWNHOUSE FOYER -- NIGHT\n\n\n               The Best Friend aims Jerry toward the stairs.\n\n                                     BEST FRIEND\n               Alright, my man.  You ready?\n\n                                     JERRY\n               Do I have a choice?\n\n                                     BEST FRIEND\n               No.\n\n                                     JERRY\n               Then, I'm ready.\n\n                                     BEST FRIEND\n               The guys pitched in for this...\n\n               He pats Jerry on the back.\n\n                                     BEST FRIEND\n               So go up there and get our money's worth.\n\n               Jerry starts up--\n\n                                     CUT TO\n\n               INT. TOWNHOUSE HALLWAY - NIGHT\n\n\n               Jerry approaches the bedroom door with a fateful air.  He touches \n               the door knob.\n \n               In his mind--\n\n                                     JERRY\n               Why am I stopping?...There's a hot girl waiting on the other \n               side of the door...Why worry?  Everyone cuts you slack for this \n               kind of thing...This is supposed to happen...It's a tradition, \n               a time-honored ritual...Losing your tooth, losing your virginity, \n               losing the championship...If I walk through this door, what am \n               I losing?  Nothing...My father was here, and his father was here, \n               and his father's father was here, hand on the door...What am \n               I waiting for...\n \n               He pushes it open.\n\n                                     CUT TO\n\n               INT. TOWNHOUSE BEDROOM - NIGHT\n\n\n               Jerry enters.  The room is dark, except for a shaft of moonlight \n               that silhouettes a girl on the bed.\n \n               Her foot dangles off the side, the toenails painted blood red. \n                Jerry turns on a lamp to meet --\n \n                                     LORNA\n               Sitting on the bed in a tank-top and a short skirt.  As fetching \n               as ever.\n \n                                     LORNA\n               You must be the groom.\n\n               Jerry laughs.\n\n                                     LORNA\n               The guys were right.  You're a looker.\n\n                                     JERRY\n               Did they also tell you I don't usually do this kind of thing.\n \n               \n               She pulls off the tank-top, revealing a black brassiere.\n\n                                     LORNA\n               All the better.  I like challenges.\n\n               She crosses to face him.\n\n                                     LORNA\n               Getting married tomorrow, huh?\n\n                                     JERRY\n               Yes, I am.\n\n                                     LORNA\n               Love, honor, and obey.  That's the drill, isn't it?\n\n                                     JERRY\n               Yes.  Tomorrow, I take the vows.\n\n               Without much ceremony, she starts massaging his crotch.\n\n                                     LORNA\n               Tomorrow...So, technically, this doesn't count.\n\n                                     JERRY\n               How's that?\n\n                                     LORNA\n               You can't break a vow you haven't taken, can you?\n\n                                     JERRY\n               You sound like my lawyer.\n\n               Lorna kneels down before him.  She unzips his pants.\n\n                                     LORNA\n               I've done my share of lawyers.  They spend most of the hour negotiating \n               the tip.\n \n               (beat)\n\n               That's a joke.\n\n                                     JERRY\n               I got it.\n\n               She pulls down his pants, looks up at him.\n\n                                     LORNA\n               Something bothering you?\n\n                                     JERRY\n               I don't know if I should be doing this.\n\n               She starts to stroke him.\n\n                                     LORNA\n               Want my philosophy?  If we don't make mistakes now and then, \n               how are we ever going to learn from them?\n \n                                     JERRY\n               Now you sound like my priest.\n\n                                     LORNA\n               I've done a few of them, too.\n\n                                     JERRY\n               Priests?\n\n                                     LORNA\n               Lousy tippers.  They spend most of the hour feeling bad about \n               what they're doing.  But they do it anyway.  Then, they shortchange \n               you on the tip.  One of them absolved me once, before he left. \n                That's something, I guess.\n \n                                     JERRY\n               Who are the best tippers?\n\n                                     LORNA\n               The guys who can least afford it.  Guys with families.\n\n                                     JERRY\n               And the worst?\n\n                                     LORNA\n               Hands-down.  Politicians.\n\n               Jerry reacts.\n\n                                     JERRY\n               Politicians?\n\n                                     LORNA\n               Sure.  Both parties.  I don't discriminate.  Besides, a penis \n               doesn't know from politics.  A penis is the most politically \n               incorrect part of the body.  It has a simple agenda.\n \n               (rehis erection)\n\n               He knows what he wants.\n\n               And she proceeds to give him a blow-job.  Jerry guides her with \n               his hands.  He tries to relax.  He tries...\n \n               But he can't.  He yanks her away from him.\n\n                                     JERRY\n               Stop it.  I can't do it.\n\n                                     LORNA\n               Don't worry about it.\n\n                                     JERRY\n               I can't...I'm sorry.\n\n               Lorna instinctively puts a little distance between herself and \n               Jerry.\n \n                                     LORNA\n               Hey, it's no sweat.  I get paid either way.\n\n                                     JERRY\n               No, you don't understand.  I can't fucking go through with it!\n \n               \n               (off Lorna's non-reaction)\n\n               I can't get married!\n\n               All at once, his face fills with rage.  Jerry swings his fist \n               into the wall, punching a hole in it.\n \n                                     JERRY\n               Jesus!\n\n               Adrenaline pumping, he doesn't even notice the blood on his hand.\n \n               \n                                     ON LORNA\n               She shakes her head --  she's completely nonplussed.\n\n                                     LORNA\n               That was smart.   Now, you're bleeding.  Here...\n\n               She takes him by the arm into--\n\n\n               INT. TOWNHOUSE BATHROOM -- NIGHT\n\n\n               She runs cold water over his hand -- it's really banged up.  \n               Then, she wraps a towel around it.\n \n                                     LORNA\n               Better?\n\n                                     JERRY\n               Yeah...\n\n                                     LORNA\n               Do you love her?\n\n                                     JERRY\n               I don't know.\n\n                                     LORNA\n               C'mon.  Let's sit down.\n\n               They return to--\n\n\n               INT. TOWNHOUSE BEDROOM -- NIGHT\n\n\n               Lorna and Jerry sit on the floor, their backs resting against \n               the bed.\n \n               Now the mood is intimate.\n\n                                     JERRY\n               She wants to have a baby.  That's the way it's supposed to be, \n               right?\n \n                                     LORNA\n               I wouldn't know.\n\n                                     JERRY\n               My parents approve of her.  Her parents approve of me.  Everybody \n               approves...\n \n                                     LORNA\n               What's wrong with a little approval?\n\n               Jerry gives her a hard look.\n\n                                     JERRY\n               That's my whole life.  My whole goddam carrot-and-stick-life. \n                Ever since I can remember, I've been chasing after this person \n               or that person's approval.  Playing one role, then another.  \n               Then another!  The good student.  The good son.  The industrious \n               boy.  Good grades.  High ambitions.  Pats on the back.  Handshakes \n               from people who matter!  The good boyfriend, getting on his knees \n               and proposing to the good girlfriend.  The dutiful bachelor, \n               receiving the traditional blow-job from a...\n \n               Jerry stops himself.\n\n                                     LORNA\n               (lets him off the hook)\n\n               Professional.\n\n                                     JERRY\n               I've lost count of all the roles, there's so many of them.\n\n               (beat)\n\n               I have no idea who I'm playing now.\n\n                                     LORNA\n               Huh.\n\n               A beat.\n\n                                     LORNA\n               I don't see what the big deal is.  I play roles all the time.\n \n               \n                                     JERRY\n               And you want to do that your entire life?  You can't...you...\n \n               \n               (beat)\n\n               I don't even know your name.\n\n                                     LORNA\n               Lorna.  And I'll do whatever the hell I want.\n\n                                     JERRY\n               Well, I can't live somebody else's version of my life anymore. \n                Do you understand?\n \n                                     LORNA\n               Sure.  I do.\n\n               She gets up and crosses to the window.  Lifts it up.\n\n                                     LORNA\n               Here's your chance.\n\n                                     JERRY\n               What?\n\n                                     LORNA\n               It's not too far a drop to the lawn.  You have gas in your car? \n                Then, go.  It's the first day of the rest of your life...Go. \n                I promise you, this opportunity will not come around twice.\n \n               \n               (beat)\n\n               Go.\n\n               Jerry stands.  He looks out the window--\n\n                                     HIS POV\n               The suburbs at night.  Cozy, warm-lit.\n\n                                     JERRY\n               I'm going to do it.\n\n               He smiles at Lorna.  Then, he climbs out the window.\n\n                                     LORNA'S POV\n               She watches him hit the ground, hobble across the lawn, and get \n               into his car.  And he's gone.\n \n\n               INT. TOWNHOUSE BEDROOM -- NIGHT\n\n\n                                     LORNA\n               See?  Easy.\n\n               She sits on the bed, takes in the room.  It seems ordinary and \n               strange, all at once.\n \n               Lorna spots the bloody towel -- Jerry left it on the floor.  \n               She folds it neatly, concealing the blood.\n \n                                     CUT TO\n                                     OMITTED\n\n               INT. COFFEE SHOP - NIGHT\n\n\n               Later.  The wee hours.  The only person at the counter is Lorna. \n                She pours cream in her coffee, watches it swirl.  Clouds.\n \n               \n               Something else catches her eye.\n\n                                     LORNA'S POV\n               Behind the counter lies a crumpled newspaper.\n\n                                     LORNA\n               (to Waitress)\n\n               Mind if I have that?\n\n                                     WAITRESS\n               It's yesterday's.  Morning paper should be here any minute.\n \n               \n                                     LORNA\n               I just want the crossword puzzle.\n\n               The Waitress puts the paper in front of her.  It falls open to \n               the Metro section, where Lorna sees a photo of Jerry and Rosalie \n               -- the one Todd shot.\n \n               The accompanying headline\"Deputy Mayor's Son to Wed Tomorrow.\"\n \n               \n                                     LORNA\n               Oh my...\n\n               The Waitress cranes her neck to see.\n\n                                     WAITRESS\n               There's a catch, alright.\n\n                                     CUT TO\n\n               INT. LORNA'S APARTMENT - DAY\n\n\n               Morning.  Terri -- still under the covers -- studies the torn \n               clipping from the paper.  Lorna brushes her teeth.\n \n                                     TERRI\n               Hello...It's the oldest condition known to man.  Cold feet.\n \n               \n                                     LORNA\n               You're wrong.  I'm telling you he's two states away by now.\n \n               \n               (beat)\n\n               He made a clean break.  I know it.\n\n               Terri shakes her head.\n\n                                     TERRI\n               If you're wrong, you're paying for drinks tonight.\n\n                                     CUT TO\n\n               EXT. STREET - DAY\n\n\n               Lorna and Terri walk briskly down the sidewalk.  They round a \n               corner to see--\n \n\n               EXT. CATHEDRAL -- DAY\n\n\n               A magnificent Catholic church. A white limousine -- decorated \n               with streamers -- sits in front, surrounded by expensive cars.\n \n               \n                                     TERRI\n               Well, what do you know...\n\n               Lorna can't believe it -- she almost feels betrayed.\n\n                                     TERRI\n               Told you we should've dressed up.\n\n                                     LORNA\n               C'mon...we're going inside.\n\n                                     TERRI\n               What for?  Wait...\n\n               But Lorna is bounding toward the cathedral.\n\n                                     CUT TO\n\n               INT. CATHEDRAL VESTIBULE - DAY\n\n\n               Lorna and Terri enter.  The vestibule looks empty.  Suddenly, \n               they are startled by a FLASH.\n \n               They turn to find a photographer checking a bulb -- it's Todd.\n \n               \n                                     TERRI\n               Lorna, we shouldn't be here.\n\n               Hearing her name Todd looks up.  Then, he gathers his gear and \n               starts inside.\n \n               But Lorna intercepts him.\n\n                                     LORNA\n               Excuse me, could you tell me who's getting married in...\n\n               (beat)\n\n               Hey, I know you.  The wedding guy.\n\n                                     TODD\n               I'm sorry. Have we met?\n\n                                     LORNA\n               Yeah.  You don't remember me?\n\n                                     TODD\n               You must be thinking of somebody else.\n\n               Lorna reacts.  Stops herself.\n\n                                     LORNA\n               Right.  I must be thinking of someone else.  Sorry.\n\n                                     TODD\n               Excuse me...\n\n               And he disappears into the church.\n\n                                     TERRI\n               What was that all about?\n\n                                     LORNA\n               Nothing.\n\n                                     TERRI\n               Nothing, my ass.\n\n                                     LORNA\n               Alright, alright.  I slipped.\n\n                                     TERRI\n               Slipped?  You broke the cardinal rule of the trade.\n\n               (pedantic)\n\n               Never acknowledge a client in public.\n\n                                     LORNA\n               What is this?  Hooking For Dummies?  C'mon...\n\n               Lorna grabs Terri by the wrist and slips into--\n\n\n               INT. CATHEDERAL -- DAY\n\n\n               They take a seat in the last pew.\n\n                                     LORNA'S POV\n               The front pews are packed, all eyes focussed on the wedding party \n               at the altar.  Jerry and Rosalie face the priest, who blesses \n               the ring.\n \n                                     PRIEST\n               The wedding ring is a powerful symbol.  It is a circle, with \n               no beginning and no end.  It is also the circle that encloses \n               your love for each other--\n \n                                     TERRI\n               I'll bet that dress is Vera Wang.\n\n                                     LORNA\n               Shhh...\n\n               Jerry and Rosalie turn to face each other.\n\n                                     PRIEST\n               Do you, Rosalie, take this man, to have and to hold, in sickness \n               and in health, till death do you part?\n \n                                     ROSALIE\n               I do.\n\n                                     PRIEST\n               And do you, Jerry, take this woman, to have and to hold, in sickness \n               and in health, till death do you part?\n \n               A beat.\n\n               Lorna studies Jerry's face for any sign, any hint of his real \n               feelings.\n \n                                     JERRY\n               I do.\n\n                                     PRIEST\n               Then, by the power invested in me by Christ, Our Lord, I now \n               pronounce you husband and wife.\n \n               (to Jerry)\n\n               You may kiss the bride.\n\n               They kiss.  Lorna leans forward.  She's moved, despite herself.\n \n               \n               Terri looks over.\n\n                                     TERRI\n               You're crying, I can't believe it.\n\n                                     LORNA\n               No, I'm not.\n\n               (beat)\n\n               Weddings make me cry.\n\n               The congregation applauds.  Jerry shakes hands with the best \n               man -- his Father.  He gives his son an approving pat on the \n               back.\n \n               Suddenly, a SECURITY GUARD appears in Lorna's face.\n\n                                     SECURITY GUARD\n               Ladies, this event is strictly for invited guests.\n\n                                     TERRI\n               We're with the groom's party.\n\n                                     SECURITY GUARD\n               Ma'am...Let's not do this.  You're not with the groom.\n\n               Terri points to Lorna.\n\n                                     TERRI\n               She had his cock in her mouth last night.  Doesn't that count?\n \n               \n               Lorna bursts out laughing.  Laughing through her tears.  The \n               Guard is not amused.\n \n                                     CUT TO\n\n               EXT. CATHEDERAL - DAY\n\n\n               Lorna and Terri race down the church steps, giggling like school \n               girls.\n \n\n               EXT. STREET - DAY\n\n\n               They turn a corner, lean against a wall.  Catching her breath, \n               Terri lights a cigarette.\n \n                                     LORNA\n               I don't know why he came back.\n\n               (beat)\n\n               It wasn't love.\n\n                                     TERRI\n               Guess you'll never know for sure.\n\n               They start down the sidewalk--\n\n                                     TERRI\n               Remember the guy I told you about -- the writer?\n\n                                     LORNA\n               Yeah.  He said he wanted to immortalize you.  What a line.\n\n                                     TERRI\n               He's been steady work.  Every Tuesday for the past month.  Well, \n               get this.  Yesterday, he called and asked me out.\n \n                                     LORNA\n               On a date?\n\n                                     TERRI\n               Yeah.  A date.\n\n                                     LORNA\n               A non-paying date.\n\n                                     TERRI\n               No money will be exchanged.  You want to hear the weird part? \n                I said yes.\n \n                                     LORNA\n               You're right.  That is weird.\n\n                                     TERRI\n               You gotta keep an open mind, Lorna.\n\n               (beat)\n\n               You never know with people.\n\n               They wait at the crosswalk.  Lorna idly glances at the window \n               of a brownstone apartment.\n \n                                     WHAT LORNA SEES\n               A Man finishing a cigarette.  He catches Lorna looking his way. \n                A Woman comes up behind the Man and casually embraces him.  \n               The Man gives Lorna a last look before pulling the curtains closed.\n \n               \n               The light has changed.  Terri starts walking.\n\n                                     TERRI\n               C'mon, what are you waiting for?\n\n                                     ON LORNA\n               She lingers at the curb for a moment, pondering her next move.\n \n               \n               FADE OUT:\n               THE END\n\n\n\n\n\nSexual Life\nWriters :   Ken Kwapis\nGenres :   Comedy  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:34:53.210308"}