{"title": "Shivers", "film_link": "/Movie Scripts/Shivers Script.html", "script_link": "/scripts/Shivers.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Shivers Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Shivers.jpg\" title=\"Shivers Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=David Cronenberg\" title=\"Scripts by David Cronenberg\">David Cronenberg</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/><br/>\n<b>Movie Release Date</b> : July 1976<br/>\n<br/>\n<a href=\"/scripts/Shivers.html\">Read \"Shivers\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n<b>                                        \"SHIVERS\"\n</b>\n                                      Screenplay by\n\n                                     David Cronenberg\n\n<b>                                      SHOOTING DRAFT\n</b>\n<b>                                           1975\n</b>\n<b>                \n</b>\n<b>               EXT. STARLINER TOWERS APARTMENT COMPLEX -- MORNING\n</b>\n               Starliner Towers is seen in LS through the windshield of a \n               moving car. The car approaches the complex and stops near \n               the main doors of the West Tower.\n\n               Out of the car climb Kresimir and Benda Sviben, a gawky newly \n               wed young couple. Kresimir elaborately opens the door for \n               Benda, his new wife, and they walk with hands intertwined up \n               the steps of the West Tower.\n\n<b>               INT. LOBBY -- MORNING\n</b>\n               As the Svibens approach the main doors, the doorman leaps up \n               from his chair beside the intercom switchboard and opens the \n               door for them. The doorman, like most security guards, does \n               not look capable of handling a serious crisis. He is about \n               fifty, of average height but slightly built, wears thick \n               glasses and seems almost embarrassed by the revolver on his \n               hip.\n\n<b>                                     DOORMAN\n</b>                         Morning, folks. Can I help you?\n\n<b>                                     KRESIMIR\n</b>                         Yes, please. I... er, we... are \n                         looking for the rental agent here. \n                         We have an appointment.\n\n<b>                                     DOORMAN\n</b>                         OK, I'll just give him a little buzz \n                         and he'll come out and show you the \n                         way in.\n\n               The doorman presses a button on the intercom board. As he \n               turns back to the Svibens, he catches his holster on the \n               board.\n\n<b>                                     DOORMAN\n</b>                              (freeing holster)\n                         Darned thing.\n\n<b>                                     BENDA\n</b>                         Do you ever use that?\n\n<b>                                     DOORMAN\n</b>                         This? No, never even had it out of \n                         the holster. A rival company has \n                         'em, so we gotta have 'em. Just an \n                         advertising gimmick.\n\n<b>               INT. ANNABELLE'S APARTMENT -- MORNING\n</b>\n               Dr. Emil Hobbes, a huge, florid, bearded man, is strangling \n               Annabelle Horsefield. Despite the difference in their sizes -- \n               Annabelle is tall and slender, about seventeen -- Hobbes is \n               not having an easy time of it. Hobbes is wearing overlarge \n               blue jeans and a red plaid shirt; Annabelle is in a private \n               girls' school outfit -- white blouse, dark blue tie, blue \n               knee socks, pleated gray skirt.\n\n               Annabelle fights back fiercely; Hobbes has tears in his eyes. \n               The struggle takes them all over her apartment, which, \n               although sparsely furnished, presents enough objects in their \n               way to cause a lot of crashing around. At one point Annabelle \n               breaks loose and Hobbes has to chase her.\n\n               Annabelle slips and Hobbes manages to pin her to the ground, \n               where he has the advantage of leverage. He strangles her \n               quickly and with tremendous, crazy energy. Blood oozes from \n               her mouth. Hobbes places his hand over her mouth as though \n               trying to prevent her from speaking, or to prevent something \n               from leaving her body.\n\n               He reaches over to his leather doctor's bag, which has spilled \n               some of its contents on to the floor, finds a surgical clamp, \n               and clamps Annabelle's lips together. He then picks up her \n               body, carries it over to the dining-room table and sweeps \n               the few cups and bottles on it off on to the floor. He then \n               places her body with great tenderness on the table and begins \n               to undress it.\n\n<b>               INT. LOBBY -- MORNING\n</b>\n               The doorman leaves the Svibens to open the door for the \n               Spergazzis, an elderly Italian couple who both use aluminum, \n               four-pronged canes to help them walk. The Svibens watch the \n               old couple as they enter and then glance at each other \n               significantly -- 'We'll be together when we're as old as \n               they are.'\n\n               Mr. Spergazzi tips his hat to the doorman, who opens the \n               inner door for him.\n\n               As the Spergazzis make their way shakily toward the elevators, \n               Mr. Merrick, the rental agent, appears from around a corner. \n               He is slick, mustachioed, and wears a wide paisley tie. He \n               extends his hand for a handshake even though he is still \n               fifty feet from the inner doors. The doorman keeps the door \n               open for him.\n\n<b>                                     DOORMAN\n</b>                         Here's Mr. Merrick. He'll take you \n                         on in.\n\n<b>                                     MERRICK\n</b>                              (ingratiatingly)\n                         Welcome to Starliner Towers. And you \n                         are...?\n\n<b>                                     KRESIMIR\n</b>                         Kresimir and Benda Sviben.\n\n<b>                                     MERRICK\n</b>                         Eh? Oh yes, of course. Mr. and Mrs. \n                         Sweden. Come right this way. Sorry \n                         to keep you waiting. Now, are we \n                         talking about one or two bedrooms? I \n                         assume we're not talking about \n                         bachelors, eh? Ha, ha. Now, I have \n                         several floor plans all laid out for \n                         you, and all you have to do is take \n                         your choice and we'll trot right on \n                         up there and take a look at 'em...\n\n               The three disappear around a corner.\n\n               The doorman pulls a Harlequin Nurse Romance out of his jacket \n               and sits down to continue reading it.\n\n<b>               INT. ANNABELLE'S APARTMENT -- MORNING\n</b>\n               Hobbes ties a green surgical mask over his mouth and nose, \n               snaps on rubber gloves.\n\n               He turns to Annabelle's corpse on the dining-room table, \n               legs hanging over the edge, now naked -- the private girls' \n               school clothes in a heap on the floor. Hobbes takes a scalpel \n               from the top of the radiator where he has laid out his \n               surgical instruments. He feels Annabelle's stomach until he \n               has found what he wants, then cuts her open with one smooth, \n               confident stroke of the scalpel.\n\n               He then quickly douses the inside of her abdomen with some \n               clear fluid in a squeeze bottle, lights a wooden match, and \n               drops it into her abdominal cavity. The corpse bursts into \n               flame.\n\n               Hobbes steps back to watch. Tears spring into his eyes. He \n               picks up another scalpel and perfunctorily sticks it into \n               his neck. Blood spurts into his mask and soaks through to \n               the other side. Hobbes sinks to his knees before the blazing \n               corpse and struggles to draw the scalpel through the tendons \n               of his neck.\n\n<b>               INT. RENTAL OFFICE -- MORNING\n</b>\n               Merrick and the Svibens sit across from each other at a long \n               table strewn with floor plans and maps. The river which \n               surrounds the complex can be seen through the glass walls of \n               the office. Merrick taps one plan with his finger and slides \n               it over to Benda.\n\n<b>                                     MERRICK\n</b>                         Now you take a look at that one, \n                         Brenda, and tell me if it doesn't \n                         suit you down to the ground. That \n                         one has the big view, the panoramic \n                         view...\n\n<b>               INT. TUDOR'S APARTMENT -- MORNING\n</b>\n               In his bathroom, Nicholas Tudor is cleaning his teeth with \n               microscopic attention to detail using an elaborate compressed-\n               water device called a water-pick. Tudor is thirty-nine, not \n               happy with his work as an insurance appraiser, and has \n               recently adopted a general air of terse, sullen desperation \n               as his primary mood.\n\n               His wife, Janine, calls to him from the kitchen, where she \n               is just putting the finishing touches on breakfast.\n\n<b>                                     JANINE (V.O.)\n</b>                         Breakfast is just about ready, Nick.\n\n               Tudor pointedly doesn't answer, but continues with the water-\n               pick until he is completely satisfied. He carefully packs \n               the machine away, then leaves the bathroom.\n\n               In the dining room, Janine is putting breakfast on the table. \n               Tudor sits down without a word and begins to eat. Janine \n               returns to the kitchen and comes back with a cup of coffee \n               in each hand. She puts one cup in front of Tudor, sits down, \n               starts to drink the other one. After a pause, she speaks.\n\n<b>                                     JANINE\n</b>                         Can I call you at the office?\n\n<b>                                     TUDOR\n</b>                         What do you want to call me at the \n                         office for?\n\n<b>                                     JANINE\n</b>                         I don't know. I just thought I might \n                         want to call you. I don't know.\n\n<b>                                     TUDOR\n</b>                         I won't be at the office except to \n                         sign in.\n                              (he eats heartily, \n                              not looking directly \n                              at Janine)\n                         I've got a lot of claims to check \n                         out. All over the place. Garages and \n                         more garages.\n                              (noticing Janine's \n                              silence, he finally \n                              looks up)\n                         I'll come home right after work.\n\n               Janine continues to toy with the food in her plate. She shrugs \n               once, as if to say, 'Big deal, so what?' Tudor ignores her \n               and finishes breakfast.\n\n<b>               INT. A HALLWAY -- MORNING\n</b>\n               Tudor leaves his apartment, closing the door behind him (we \n               see the number clearly).\n\n               He walks down the hallway on automatic pilot, obviously \n               preoccupied, turning the corner leading to the elevators \n               without perceiving what he is seeing.\n\n               At the elevators he hesitates for a moment, then presses the \n               UP button. When the door opens, he steps in.\n\n<b>               INT. ELEVATOR -- MORNING\n</b>\n               In the elevator are Merrick, the rental agent, and the \n               Svibens.\n\n<b>                                     MERRICK\n</b>                         We're going up.\n\n<b>                                     TUDOR\n</b>                         Oh. Well, I'll go along for the ride.\n\n<b>                                     MERRICK\n</b>                              (after a pause, to \n                              the Svibens, \n                              indicating the \n                              elevator)\n                         Wood-grain paneling, strong, silent, \n                         fireproof, fast, cushioned ride. \n                         Everything you could want in an \n                         elevator.\n\n               Nobody says another word until the doors spring open and \n               Merrick, after a wink at Tudor, hustles the Svibens out of \n               the elevator.\n\n               As the doors close, Merrick's voice floats back to Tudor.\n\n<b>                                     MERRICK (V.O.)\n</b>                         Notice how the entranceways to all \n                         the apartments are recessed and \n                         individually lit... Nope, it's down \n                         that way, Brenda. That's it... \n                         Recessed and individually lit...\n\n               Once the door has closed, Tudor presses the button for the \n               top floor. As the elevator ascends, he takes out his wallet \n               and removes a key from a zippered compartment.\n\n<b>               INT. HALLWAY -- MORNING\n</b>\n               Tudor fits the key into the lock of Annabelle's apartment. \n               He knocks gently and then opens the door. After a pause he \n               steps in and closes the door behind him, not wanting to be \n               seen by anyone who might know him.\n\n<b>               INT. ANNABELLE'S APARTMENT -- MORNING\n</b>\n               As soon as he is inside the apartment, Tudor knows that \n               something is seriously wrong. Smoke hangs in the air and the \n               smell of burned flesh attacks Tudor's nostrils. He is on his \n               way to the bedroom when he sees Hobbes's foot around the \n               corner of the dining room.\n\n               Tudor approaches the dining room with his hand over his nose \n               and mouth.\n\n               Annabelle's corpse is still smoking where it lies on the \n               dining-room table. Hobbes's body is twisted into the fetal \n               position at the foot of the table, one hand still clutching \n               the scalpel stuck in its neck, the floor beneath it bright \n               with blood.\n\n               Tudor winces as though stuck with a pin. Blinking rapidly, \n               he edges around the room until his angle of vision is such \n               that he can see the head of the corpse on the table. It is \n               definitely Annabelle, eyes still staring, surgical clip still \n               attached to her lips, purple bruises on her neck.\n\n               Tudor turns, his body contracting around the pit of his \n               stomach. After a moment he manages to straighten up and \n               stagger from the apartment, having at least enough presence \n               of mind to take his attaché case, which he left by the door, \n               and to close the door behind him.\n\n<b>               INT. ANNABELLE'S APARTMENT -- AFTERNOON\n</b>\n               Dr. Roger St. Luc, tall, thin, dark, not bad-looking, stands \n               over the table staring at the corpse of Annabelle. As he \n               watches, two ambulance men throw a sheet over her and begin \n               to lift her down on to a stretcher on the floor. The voice \n               of the superintendent of the building drifts over to him \n               from the other end of the apartment.\n\n<b>                                     SUPER (V.O.)\n</b>                         Like I said to the police officer, \n                         he paid the rent, Dr. Hobbes did. \n                         And he came around and chatted a lot \n                         with everyone here, the staff, I \n                         mean. Nice guy. Not a high and mighty \n                         type. But it was her name on the \n                         residency list and the buzzer board: \n                         Annabelle... what was it again?... \n                         Annabelle Horsefield. She never \n                         complained about anything, not to \n                         me, anyway.\n\n               The super, a small, unshaven, harassed little man with a lot \n               of energy, is talking to a large beefy detective who writes \n               everything down in a notebook.\n\n<b>                                     DETECTIVE\n</b>                              (pointing to \n                              Annabelle's corpse, \n                              which is just being \n                              carried out the door)\n                         And that was her. Annabelle Horse... \n                         field.\n\n<b>                                     SUPER\n</b>                         Far as I know, yeah, that was her.\n\n               The detective now turns to St. Luc, who is crouched on the \n               floor examining the chalk outline around where Hobbes's body \n               had lain.\n\n<b>                                     DETECTIVE\n</b>                         Is that the man who called you up \n                         here?\n\n<b>                                     SUPER\n</b>                         Yeah, that's Dr. St. Luc. He's the \n                         head of our little medical clinic \n                         here.\n\n<b>                                     DETECTIVE\n</b>                         Medical clinic?\n\n<b>                                     SUPER\n</b>                         Yeah. This is an island, you know? \n                         Takes too long to get into the city. \n                         We gotta have everything right here \n                         or somebody complains.\n\n<b>                                     DETECTIVE\n</b>                         Well, let's go talk to your doctor.\n\n               The detective walks over to St. Luc and the super follows. \n               St. Luc rises to meet him. He is wearing very informal summer \n               clothes, a bit rumpled.\n\n<b>                                     DETECTIVE\n</b>                         Dr. St. Luc? Detective-Sergeant \n                         Heller. I'd like to ask you a few \n                         questions.\n\n<b>                                     ST. LUC\n</b>                              (obviously a bit dazed \n                              by what he has been \n                              seeing)\n                         Sure.\n\n<b>                                     DETECTIVE\n</b>                         You're the one who found the bodies?\n\n<b>                                     ST. LUC\n</b>                         Yes.\n\n<b>                                     DETECTIVE\n</b>                         Did you touch anything? Move anything \n                         before we got here?\n\n<b>                                     ST. LUC\n</b>                         No, nothing.\n\n<b>                                     DETECTIVE\n</b>                         You knew these people?\n\n<b>                                     ST. LUC\n</b>                         I knew the man, Emil Hobbes, a doctor \n                         and a professor at university. I saw \n                         the girl around the building but I \n                         didn't know her. She never came to \n                         the clinic.\n\n<b>                                     DETECTIVE\n</b>                         So you just came up to visit this \n                         Hobbes and you found them like that?\n\n<b>                                     ST. LUC\n</b>                         Oh, no. I haven't seen Dr. Hobbes \n                         since I was in medical school. He \n                         taught me... he was my prof in urology \n                         and... I think he conducted a few \n                         seminars in psychopharmacology. That \n                         was it. I had no idea he'd ever set \n                         foot in Starliner Towers until today.\n\n<b>                                     DETECTIVE\n</b>                         I see. Then what brought you up here?\n\n               St. Luc begins to pace about as he talks.\n\n<b>                                     ST. LUC\n</b>                         It was very strange. He called me at \n                         six this morning. Hobbes called me. \n                         I thought I was dreaming. I haven't \n                         heard that voice for so long. He \n                         told me who it was, then he said \n                         something like, 'Meet me at apartment \n                         1208 at noon. I want you to go out \n                         for lunch with me. It's time you \n                         furthered your education.' Then he \n                         laughed and hung up. I went back to \n                         sleep. He called me again at eight \n                         to remind me to come.\n\n<b>                                     DETECTIVE\n</b>                         How did he sound this time? Was he \n                         nervous? Depressed?\n\n<b>                                     ST. LUC\n</b>                         He sounded fine.\n\n               The telephone rings. The super, who has been fiddling with a \n               window with a cracked pane of glass, grabs the phone \n               instinctively without looking at the detective, who probably \n               would have answered it himself.\n\n<b>                                     SUPER\n</b>                              (pause)\n                         Who? No, that's not me. You got the \n                         wrong guy. Just a sec.\n                              (looks up at St. Luc \n                              and holds out the \n                              phone to him)\n                         It's for you. Somebody wants to know \n                         how come you didn't show up for lunch.\n\n               The detective looks suspiciously at St. Luc, who simply looks \n               dazed.\n\n<b>               INT. ROLLO LINSKY'S LABORATORY -- AFTERNOON\n</b>\n               Next to a shallow porcelain tray full of immense and grotesque \n               marine worm specimens lies a large parcel wrapped in brown \n               paper. Rollo's plump fingers eagerly open the package to \n               reveal a large variety of delicatessen sandwiches and \n               accessories.\n\n               Rollo offers some to St. Luc while stuffing one in his own \n               mouth. There are Cokes and old coffees everywhere, plus \n               mustard, relish, and ketchup dispensers of all kinds. Rollo \n               and St. Luc sit around Rollo's desk, a very sleek metal \n               affair.\n\n               Rollo's lab itself is a combination of modern office and \n               biology room in a museum of natural history. Specimens of \n               all kinds, in bottles and cases, mounted on glass and wood, \n               floating in preservative baths, are everywhere. There are \n               also a few cages of living insects, moldy aquaria and lab \n               cultures in various stages of neglect.\n\n               There are also clippings from magazines and newspapers \n               sporting furious underlinings and circlings in red ink which \n               are stuck to walls, doors, bookshelves.\n\n               Despite the potential for chaos, however, there is an \n               underlying order which reflects Rollo's own real discipline, \n               which is not always immediately apparent. And the microscopes \n               and glass slides, the stainless-steel gynecological table \n               complete with stirrups, metal drug and instrument cabinet, \n               etc., are spotless and in good shape.\n\n               Rollo is rotund, soft-faced, and a manic-depressive. In his \n               manic phase he is a joker and an elbow-nudger, and his general \n               style, even when discussing medical matters in medical jargon, \n               is broad North-American Jewish. In his depressive phase, he \n               becomes a sullen kid who has an oddly sinister aspect to his \n               character.\n\n               Rollo detaches himself from his baby beef in order to comment \n               on the food that, not so secretly, he loves best of all.\n\n<b>                                     ROLLO\n</b>                         Not exactly the kind of lunch Hobbes \n                         would have laid on you, Rog, but \n                         it's all I got, and...\n                              (places hand on heart, \n                              leans over \n                              confidentially)\n                         ...all I got I share with you. Go \n                         ahead. Take all you want.\n\n<b>                                     ST. LUC\n</b>                         You touch my spleen, Rollo.\n                              (they giggle at an \n                              old medical-school \n                              reference)\n                         And here all the time I was thinking -- \n                         if I ever bothered to think about \n                         the good old days -- well, at least \n                         there's Rollo. He's in VD and he's \n                         happy.\n\n<b>                                     ROLLO\n</b>                         I'm still a VD man under the skin, \n                         Rog. You know me. I'm a down-to-earth \n                         kinda guy, right?\n\n<b>                                     ST. LUC\n</b>                         Well, at least you still talk the \n                         same.\n\n<b>                                     ROLLO\n</b>                         So who changes?\n\n<b>                                     ST. LUC\n</b>                         But you gave up your private practice. \n                         Suddenly you're into pure research \n                         and you... you're what, a \n                         parasitologist?\n\n<b>                                     ROLLO\n</b>                         That was my father's idea... private \n                         practice. He wanted to set me up -- \n                         I couldn't say no. But he's dead \n                         now. And me, I'm still a snoop, I \n                         gotta do research. Look at that \n                         beautiful stuff...\n                              (gestures everywhere)\n                         ...lookit it!\n\n               He jams a final piece of sandwich into his mouth and jumps \n               to his feet, smiling broadly.\n\n<b>                                     ROLLO\n</b>                              (with great enthusiasm, \n                              indicating the entire \n                              lab)\n                         This is the 'Satyr's Tongue'!\n\n               He pulls a book off a shelf with a bookmark in it. He opens \n               the book at the marked page and hands it to St. Luc. As St. \n               Luc looks at the picture of a satyr with his tongue hanging \n               out and reads the brief note on how medieval alchemists \n               thought the ground-up tongue of the satyr could cure any \n               disease, Rollo continues to talk.\n\n<b>                                     ROLLO\n</b>                         The note includes a warning against \n                         swallowing the tongue whole, but we \n                         don't see the rest of this caution. \n                         'Satyr's Tongue' was Hobbes's code \n                         name for our project. What we were \n                         trying to do was to find an \n                         alternative to organ transplants.\n\n               As Rollo speaks, he walks all over the place, picking up and \n               discarding various charts, specimens, bottled and diseased \n               human organs, etc.\n\n               As he moves around, we catch glimpses of Letrasetted signs \n               that Rollo has tacked up: 'Sex is the invention of a clever \n               venereal disease -- Hobbes'; 'Dr. Hobbes's prescription: \n               starve a fever, feed an obsession'; 'The road of excess leads \n               to knowledge'; plus several pictures of satyrs with their \n               tongues sticking out, being cut off by alchemists, etc.\n\n<b>                                     ROLLO\n</b>                         I know. You're bored already. \n                         Transplants are yesterday's kishkas, \n                         right?\n\n<b>                                     ST. LUC\n</b>                              (shaking his head in \n                              protest)\n                         Did I say anything?\n\n<b>                                     ROLLO\n</b>                              (excited, waving \n                              specimens of parasites \n                              and diseased organs \n                              around)\n                         Look. You got men, you got parasites \n                         that live in, on, and around men. \n                         Now. Why not breed a parasite that \n                         does something useful? Eh? Why not \n                         breed a parasite capable of taking \n                         over the function of any one of a \n                         bunch of human organs? Why not, for \n                         example, a parasite living in the \n                         human abdominal cavity that plugs \n                         into the circulatory system and \n                         filters the blood like a kidney? If \n                         it takes a little blood for itself, \n                         so what? Be generous! You can afford \n                         it.\n\n               He is now in full flight. He leans over St. Luc and begins \n               to demonstrate what he says by drawing things on St. Luc's \n               stomach with his fingers. St. Luc can't hide his amusement.\n\n<b>                                     ROLLO\n</b>                         You put the bug into the body of a \n                         man with a diseased kidney, the bug \n                         attacks the bad kidney, dissolves \n                         it, it's assimilated by the body, \n                         and now you got a perfectly good \n                         parasite where you used to have a \n                         rotten kidney. I know what you're \n                         gonna say. You're gonna say it's \n                         crazy.\n\n<b>                                     ST. LUC\n</b>                              (laughing)\n                         It's crazy.\n\n               Rollo throws himself back into his chair and grabs a pickle.\n\n<b>                                     ROLLO\n</b>                         Right. It's crazy. But here's the \n                         beauty part. Ready?\n                              (leans forward for \n                              emphasis)\n                         Who cares?\n\n<b>                                     ST. LUC\n</b>                         I don't get it.\n\n<b>                                     ROLLO\n</b>                         You know and I know that Hobbes was \n                         a lousy teacher, eh? Lousy. Dry, \n                         academic, afraid of women, lousy. \n                         But he was always a genius at one \n                         thing -- getting grants. Could he \n                         get grants for crazy projects?\n\n               St. Luc is about to say something, but Rollo answers his own \n               rhetorical question with a flip of the hand, effectively \n               silencing St. Luc.\n\n<b>                                     ROLLO\n</b>                         You know who pays the rent here? Eh? \n                         The Northern Hemisphere Organ \n                         Transplant Society. And that's for \n                         something that's supposed to put \n                         them outta business. And they're not \n                         the only ones. We got grant money \n                         coming out of our ears.\n\n               He leaps up again and pulls a sheaf of reprints from medical \n               journals like the Journal of Venereal Disease, etc. He shoves \n               them under St. Luc's nose, then grabs a jar with a \n               disintegrating octopus-like creature in it and a sandwich at \n               the same time. He smacks down the sandwich in front of St. \n               Luc by mistake, then retrieves it and substitutes the jar \n               with the specimen.\n\n               St. Luc sifts through the papers and glances at the specimen.\n\n               As St. Luc looks at the papers, Rollo breathes heavily down \n               his neck and points out things of interest.\n\n<b>                                     ROLLO\n</b>                         See? There? You take a little of \n                         this... that's a very rare venereal \n                         disease you get in the nomadic Crinua \n                         people, Northeast Asia and Japan.\n                              (points to a sexy \n                              picture of a Japanese \n                              lady in heat)\n                         Oo. That one's got it bad. They call \n                         it Batinh. That means 'kiss' or \n                         'caress.' When you get it it makes \n                         your lips itchy, ya wanta kiss \n                         everything. I even had it once. I \n                         always get everything at least once \n                         so I know what the patient's talking \n                         about.\n                              (he laughs but he's \n                              serious)\n                         And there... you take a little of \n                         that... that's beautiful, isn't it? \n                         That's Flexipes, the world's only \n                         cephalopod parasite.\n                              (indicating the jar)\n                         That's him right there. Not a very \n                         good specimen. Related to squids and \n                         octopuses. See? He lives in the guts \n                         of whales and big dolphins.\n                              (wiggles a finger at \n                              the specimen)\n                         Ya like 'em big 'n hot 'n wet, don't \n                         ya? Yeah.\n\n               He walks away from the desk. His manner is now more subdued \n               and reflective. It seems as though everything he says provokes \n               a dozen unspoken thoughts. His depressive phase is beginning.\n\n<b>                                     ROLLO\n</b>                         We don't do it all here, we send out \n                         to have tricky stuff done... the \n                         cell fusion, enucleation, chromosomal \n                         fission, all that fancy close work.\n\n               Rollo sighs heavily. St. Luc gently shoves all the papers \n               aside.\n\n<b>                                     ST. LUC\n</b>                         Rollo, how come Hobbes killed himself?\n\n               Rollo toys with the gynecological examination table, sliding \n               the stirrups in and out on their adjustment bars.\n\n<b>                                     ROLLO\n</b>                              (shrugging)\n                         Funny in the head. High suicide rate \n                         in the medical profession. Too much \n                         body, alla time bodies, bodies.\n\n               He now gets close to St. Luc, putting an arm around his \n               shoulder.\n\n<b>                                     ROLLO\n</b>                         Rog, I gotta talk serious to you. \n                         Really. Listen. Ya listening? OK. I \n                         want you to come into this with me. \n                         To tell the honest-to-God truth, I'm \n                         lonely.\n                              (begins to pace around \n                              again)\n                         All Hobbes ever did was run around \n                         getting money and phone me in the \n                         middle of the night. He wanted you \n                         in anyway. That's why we were gonna \n                         get together, the three of us. We \n                         would have enough to keep us going \n                         for at least five years, even with \n                         inflation.\n\n<b>                                     ST. LUC\n</b>                              (a bit uncomfortable \n                              being put on the \n                              spot)\n                         Rollo, you know me. Once a GP, always \n                         a GP.\n\n<b>                                     ROLLO\n</b>                              (almost angrily)\n                         You want to help sick people for the \n                         rest of your life? God forbid I should \n                         talk you out of it.\n\n<b>                                     ST. LUC\n</b>                         You oughta be careful yourself. Might \n                         end up cutting your throat.\n\n<b>                                     ROLLO\n</b>                         It was women did it to Hobbes. \n                         Couldn't handle them. That girl, \n                         that Annabelle -- talk about crazy \n                         projects.\n\n<b>                                     ST. LUC\n</b>                         Who was she?\n\n<b>                                     ROLLO\n</b>                              (reluctant to talk)\n                         Aw, he met her when he was lecturing \n                         at some private girls' school. They \n                         caught him examining her little tits \n                         for breast cancer in the faculty \n                         lounge. She was twelve. Don't ask. \n                         It was craziness, believe me.\n                              (indicating the \n                              gynecological table)\n                         They used to come here sometimes.\n                              (shakes his head)\n                         Don't ask.\n\n               He starts to run down like a spring-wound toy at the end of \n               its run. He glances at a picture of Annabelle stuck in a \n               corner, which St. Luc just notices for the first time.\n\n<b>                                     ROLLO\n</b>                         I'll never really understand how he \n                         could do what he did to her.\n\n               St. Luc looks at his watch and gets up out of his chair for \n               the first time.\n\n<b>                                     ST. LUC\n</b>                         Well, Rollo Linsky... I gotta go \n                         open up the store. It's been great \n                         to see you again.\n\n               He moves toward the door. Rollo trails after him, head down, \n               obviously dejected.\n\n<b>                                     ROLLO\n</b>                         Yeah, sure.\n\n               They shake hands. St. Luc has to open the door himself -- \n               Rollo is really preoccupied. Finally he looks St. Luc in the \n               eye.\n\n<b>                                     ROLLO\n</b>                         But you'll think about what I said \n                         about working together, huh?\n\n<b>                                     ST. LUC\n</b>                         OK. I'll think about it.\n\n               Rollo manages a smile. St. Luc leaves, closing the door behind \n               him.\n\n<b>               INT. TUDOR'S APARTMENT -- MORNING\n</b>\n               In his bathroom, Nick Tudor cleans his teeth with the water-\n               pick as usual. The sounds of Janine bustling about with \n               breakfast filter into the bathroom. Tudor hums tunelessly.\n\n               Suddenly, he doubles over in a soundless spasm of pain. The \n               water-pick writhes in the sink, shooting water on to the \n               mirror and over the floor.\n\n               After a moment he straightens up and begins to press around \n               the area of his navel, obviously looking for lumps which it \n               seems -- from his expression -- he has already found and is \n               overly familiar with.\n\n               The water-pick continues to rattle around in the sink. Janine \n               pokes her head around the corner to investigate. Tudor tries \n               to cover up, grabs the water-pick, and begins to work on his \n               teeth again, hiding the occasional twinge that hits him.\n\n<b>                                     JANINE\n</b>                         You say something?\n\n<b>                                     TUDOR\n</b>                         Nope. Damned thing wriggled out of \n                         my hands. That's all.\n\n               Janine waits for Tudor to say something else. He ignores \n               her.\n\n<b>                                     JANINE\n</b>                              (after a pause)\n                         You sure you're OK, Nick?\n\n               Tudor continues to ignore her. Janine sighs in a very obvious \n               way and disappears. Tudor waits for a second, turns off the \n               water-pick, then checks out his stomach again.\n\n<b>               INT. WOMEN'S SAUNA -- AFTERNOON\n</b>\n               Janine sits in the middle of a bench, towel around her head \n               and middle. Next to her sits Betts, who is in her early \n               forties, attractive in a tough kind of way, and wears her \n               hair short for efficiency's sake. In her relationship with \n               Janine she plays the role of tough, worldly older sister. \n               She has the poise and confidence of a woman who has created \n               her own success and position in life, a marked contrast to \n               the neurotic vivacity of Janine, who is ten years her junior \n               and has never known independence.\n\n               They are both watched by the only other occupant of the sauna, \n               Benda Sviben, now a full-fledged resident of Starliner Towers. \n               She is huddled in a corner, very shy and looking particularly \n               thin, mousy, and ineffectual in the presence of the other \n               two full-bodied women.\n\n               Betts is in the middle of giving Janine advice about Tudor's \n               disease.\n\n<b>                                     BETTS\n</b>                         ...probably nothing at all. It's \n                         probably just a bunch of, I don't \n                         know, fatty cysts. You can have them \n                         removed in a doctor's office. Has \n                         Nick seen a doctor?\n\n<b>                                     JANINE\n</b>                         He hates doctors. Doctors and lawyers. \n                         He never goes to doctors.\n\n<b>                                     BETTS\n</b>                         Well, look. How's this? You go on \n                         down to the clinic and tell that \n                         nice Dr. St. Luc...\n                              (pauses to work it \n                              out)\n                         ...you tell him that Nick's ill, \n                         he's got these lumps, and he can't \n                         get out of bed. Tell him to come \n                         when you're sure Nick'll be home. \n                         And don't tell Nick anything. Let \n                         the two of them fight it out.\n\n<b>                                     JANINE\n</b>                              (not displeased with \n                              the idea)\n                         He'll be really mad.\n\n<b>                                     BETTS\n</b>                              (with a conspiratorial \n                              smile)\n                         So? You'll find out what's wrong and \n                         then you'll be able to relax a little \n                         bit. Let him be the uptight one for \n                         a change.\n\n               She stretches out full length on the bench, her toes bumping \n               Benda's thigh. Betts notices Benda for the first time.\n\n<b>                                     BETTS\n</b>                              (to Benda)\n                         Oops, sorry. Hi. Haven't seen you \n                         here before, have I?\n\n               Benda draws her towel around her, wide-eyed, completely \n               intimidated by Betts. She manages a nervous smile.\n\n<b>               INT. TUDOR'S OFFICE -- AFTERNOON\n</b>\n               Tudor's secretary, a lumpy and motherly lady named Mrs. \n               Wheatley -- she has a nameplate on her desk -- is shuffling \n               some papers when the telephone rings.\n\n               Her small cubicle of an office is appended to Tudor's only \n               slightly larger office in a huge downtown office building. \n               The door leading to Tudor's office is closed.\n\n<b>                                     MRS. WHEATLEY\n</b>                         Ashen &amp; Gaunt, Insurance Appraisals. \n                         Mr. Tudor? One moment, please. I'll \n                         buzz him.\n\n               She places the caller on 'hold' and presses the inter-office \n               buzzer. She directs her attention for a moment to the papers \n               on her desk. When, after a pause, she notices that Tudor \n               hasn't answered the phone, she releases the caller from 'hold' \n               and picks up the receiver.\n\n<b>                                     MRS. WHEATLEY\n</b>                         I'm sorry to keep you waiting. I'll \n                         put you on 'hold' again and see if I \n                         can find Mr. Tudor.\n\n               Mrs. Wheatley pushes the 'hold' button and gets out of her \n               chair. She knocks gently on the door.\n\n<b>                                     MRS. WHEATLEY\n</b>                         Nicholas? There's a call for you.\n\n               Perplexed by Tudor's failure to respond, Mrs. Wheatley \n               gingerly opens the door.\n\n<b>                                     MRS. WHEATLEY\n</b>                         Nicholas? It's that man whose \n                         Lamborghini caught fire on St. \n                         Catherine Street and burned to the \n                         ground. He's very angry...\n\n               She catches a glimpse of Tudor rolling around on the floor \n               behind his desk, his swivel chair tipped over on to its side.\n\n<b>                                     MRS. WHEATLEY\n</b>                         Nicholas! What happened?\n\n               She rushes over to Tudor and helps him to his feet. Tudor is \n               breathing heavily and has to support himself by leaning on \n               the desk while Mrs. Wheatley straightens up the chair for \n               him.\n\n               Tudor collapses into the chair, mumbling and rolling his \n               head from side to side. Mrs. Wheatley pulls a Kleenex from \n               her sleeve and dabs away a small trickle of blood coming \n               from one corner of Tudor's mouth.\n\n<b>                                     MRS. WHEATLEY\n</b>                         We're going to get you to a hospital. \n                         That's what we're going to do.\n\n<b>                                     TUDOR\n</b>                              (beginning to come \n                              around)\n                         No, no. I'll be all right. I'm all \n                         right.\n\n               Mrs. Wheatley shows Tudor the spot of blood on her Kleenex.\n\n<b>                                     MRS. WHEATLEY\n</b>                         Do you see this? This is blood. It \n                         came from your insides. That means \n                         it's serious. Probably an ulcer. You \n                         executives are all the same.\n\n               Tudor shoves her hand away and sits straight at his desk, \n               still pretty wobbly.\n\n<b>                                     MRS. WHEATLEY\n</b>                              (smoothing the hair \n                              back from Tudor's \n                              forehead in a very \n                              motherly fashion)\n                         Now, Nicholas, it doesn't cost \n                         anything to be sure everything's all \n                         right. I think you should definitely \n                         go to the emergency ward and...\n\n<b>                                     TUDOR\n</b>                              (abruptly, swiveling \n                              away from Mrs. \n                              Wheatley's hand)\n                         Call me a cab, will you please, Mona? \n                         I'm going home for the day.\n\n<b>                                     MRS. WHEATLEY\n</b>                         Nicholas, I think...\n\n<b>                                     TUDOR\n</b>                         I don't care what you think. Please \n                         call me a cab. Now.\n\n               Mrs. Wheatley steps away from the desk, obviously hurt by \n               Tudor's brusqueness.\n\n<b>                                     MRS. WHEATLEY\n</b>                              (mollifyingly)\n                         All right, Nicholas. All right.\n\n               She leaves, closing the door behind her.\n\n               Tudor sighs, taking a deep breath. He is suddenly hit by \n               another twinge of pain. He clutches his stomach. Blood \n               trickles out of the corner of his mouth. After a pause, he \n               licks the blood off his lips with the tip of his tongue.\n\n<b>               INT. CLINIC RECEPTION AT STARLINER TOWERS -- AFTERNOON\n</b>\n               The Starliner Towers Medical Clinic is small but complete. \n               Dr. St. Luc and his nurse, Forsythe, are backed up by a \n               secretary-receptionist who sits behind a desk surrounded by \n               filing cabinets at the end of the hallway which serves as \n               reception area. There are chairs lined up against one wall, \n               flanked by coffee tables piled high with the traditional two-\n               year-old magazines.\n\n               Three or four people sit waiting to see St. Luc, among them \n               the aging but sprightly Mr. Parkins and Janine Tudor. Parkins, \n               who considers himself something of a ladies' man, is talking \n               to Janine when St. Luc appears and looks at the list of \n               patients who have signed in.\n\n<b>                                     PARKINS\n</b>                         ...and this Kriedler seems to think \n                         that mega-vitamin therapy may be the \n                         answer to the question of aging. \n                         That's not to suggest that the aging \n                         process is in any way reversible -- \n                         I don't think for a minute that it \n                         is -- but it may be stoppable, and \n                         that's where mega-vitamins come in...\n\n               St. Luc gestures to Janine to follow him into his office. \n               Janine gets up, excusing herself to Mr. Parkins.\n\n<b>                                     JANINE\n</b>                         Excuse me, Brad. Gotta go.\n\n               She follows St. Luc into his office. He closes the door behind \n               her.\n\n<b>               INT. TAXICAB -- AFTERNOON\n</b>\n               The cab carrying Tudor pulls up at the main doors of the \n               Towers. Tudor, still a bit unsteady, signs a chit for the \n               driver and gets out of the car.\n\n<b>               INT. LOBBY -- AFTERNOON\n</b>\n               The doorman opens both doors for Tudor as he enters the \n               building.\n\n<b>                                     DOORMAN\n</b>                         Afternoon, Mr. Tudor.\n\n<b>               INT. ST. LUC'S OFFICE -- AFTERNOON\n</b>\n               Janine sits opposite St. Luc, who has a file open before him \n               on his desk.\n\n<b>                                     ST. LUC\n</b>                         Well, there's certainly nothing here \n                         in this check-up I did for your \n                         husband's company last year. Blood \n                         pressure a touch high, cholesterol \n                         count nice and low...\n                              (looking Janine in \n                              the eye)\n                         I just can't see cancer developing \n                         that fast, Janine, not the way you've \n                         described it. Could be swollen glands \n                         or something, I don't know.\n\n<b>                                     JANINE\n</b>                              (a bit relieved but \n                              still tense)\n                         You'll come up and take a look at \n                         him?\n\n<b>                                     ST. LUC\n</b>                              (standing up)\n                         If he can't make it down here... \n                         sure. That's what I'm here for. But \n                         it won't be until, oh...\n                              (checking his watch)\n                         ...9.30, say 10.00. OK? Not too late?\n\n               Janine smiles and shakes her head. Just gotta have time to \n               put the clinic to bed for the night and grab some supper.\n\n<b>                                     JANINE\n</b>                         That's great, Doctor. Thanks.\n\n               Janine gets up, opens the door to the reception area, and \n               leaves, closing the door behind her.\n\n               St. Luc keeps staring at Tudor's file, shifts something from \n               one side of the folder to the other. Something bothers him.\n\n               The door to one of the examination rooms opens and Forsythe \n               pops her head around the corner.\n\n<b>                                     FORSYTHE\n</b>                         Mrs. Ementhal's ready and waiting, \n                         Doctor.\n\n<b>                                     ST. LUC\n</b>                         Mm? OK. Be with you in a sec.\n\n               Forsythe disappears. St. Luc studies Tudor's file.\n\n<b>               INT. TUDOR'S APARTMENT -- LATE AFTERNOON\n</b>\n               Tudor enters his apartment and throws his jacket and attaché \n               case on to a chair. He loosens his tie and makes himself a \n               drink, then sits down on the sofa and switches on the TV \n               set.\n\n               After only a short moment of relative calm, Tudor suddenly \n               contracts into the fetal position, spilling his drink on to \n               the floor. He rolls on to the floor, eyes staring out of his \n               head, mouth opening and closing like that of a fish out of \n               water, tendons in his neck bulging with tension.\n\n               He soon manages to struggle to his feet, the primary spasm \n               of pain apparently over. He keeps both hands clamped over \n               his mouth as though in a vain attempt to forestall a bout of \n               vomiting and stumbles into the bathroom.\n\n               Once in the bathroom, Tudor throws himself over the side of \n               the bathtub, knees on the bath mat, head well down into the \n               tub itself.\n\n               He gags and vomits into the tub and collapses, exhausted, on \n               the floor, mouth bloody. In the tub, a trail of blood-streaked \n               slime leads into the drain.\n\n<b>               INT. RECEPTION AREA -- LATE AFTERNOON\n</b>\n               Forsythe comes out to the reception area from an examination \n               room, checks out the patient list, and beckons to Mr. Parkins.\n\n<b>                                     FORSYTHE\n</b>                         I'm ready for you now, Brad.\n\n               Parkins gets up and follows Forsythe into one of the \n               examination rooms.\n\n<b>               INT. EXAMINATION ROOM -- LATE AFTERNOON\n</b>\n               Once inside the examination room, Forsythe closes the door \n               and hands Parkins a hospital tunic.\n\n<b>                                     FORSYTHE\n</b>                         Now, you just take off all your \n                         clothes, put this on, and hop up on \n                         to the table over there, OK? Doctor'll \n                         be in to see you in a few minutes.\n\n<b>                                     PARKINS\n</b>                              (as Forsythe begins \n                              to leave)\n                         You don't have to go. I'm not shy.\n\n<b>                                     FORSYTHE\n</b>                         Don't be a tease, Brad. I'm still \n                         working, you know.\n\n               Forsythe leaves. Parkins chuckles to himself -- 'still life \n               in the old boy yet' kind of feeling -- and begins to undress.\n\n<b>               INT. TUDOR'S LIVING ROOM -- NIGHT\n</b>\n               Tudor staggers into the living room from the bathroom, wiping \n               his mouth with a facecloth. He sits down on a chair facing \n               the sliding glass door which leads to the apartment's balcony.\n\n               He breathes heavily, gasping for air. His expression is a \n               dazed one and he mumbles incoherently. After a moment's rest \n               he rises, opens the glass door, and steps out on to the \n               balcony.\n\n<b>               EXT. TUDOR'S BALCONY -- NIGHT\n</b>\n               Tudor hangs on to the railing of the narrow concrete balcony, \n               gulping down the air, scanning the lights of the tower \n               opposite.\n\n               Suddenly the muscles of his neck go tense again, his mouth \n               seems to gape open at the extreme limits imposed by muscle \n               and jawbone, his hands fly up to his mouth in an attempt to \n               keep down whatever is about to come up.\n\n               Hanging over the railing of the balcony like an ocean traveler \n               in a rough sea, Tudor finally gives up the struggle and hangs \n               on for dear life as he retches, gags, moans, and finally \n               vomits.\n\n<b>               EXT. GROUNDS BELOW TUDOR'S BALCONY -- NIGHT\n</b>\n               Two elderly women, Vi and Olive, are taking a leisurely \n               evening stroll at the base of Tudor's tower. They both hold \n               small transparent umbrellas over their heads and walk gingerly \n               along the path bordering the lawn.\n\n               Suddenly the liquid, fleshy thwack of the parasite vomited \n               by Tudor from high above hitting one of the umbrellas is \n               heard. A large splotch of blood spatters the first lady's \n               umbrella just off center, as though it has been hit by a \n               heavy, blood-soaked sponge. The force of the blow almost \n               twists the umbrella from the first lady's frail hand, and \n               she gives a little cry of surprise.\n\n               Her companion extends a hand to help the first lady keep her \n               balance, then gives a slightly more startled cry when she \n               sees the blood.\n\n               The first lady examines her umbrella as well, but does not \n               react with such surprise.\n\n<b>                                     FIRST LADY\n</b>                              (examining the bloodied \n                              umbrella)\n                         Aw. Poor birdie. They're always \n                         crashing into tall buildings. It's \n                         such a shame, such a shame. The \n                         windows fool them, you know.\n\n               The creature, the second parasite to emerge from Tudor's \n               body, lies in the grass, away from the bright cones of light \n               thrown by the tower's lawn lamps. We can barely make out its \n               bloody, twitching form.\n\n               Beyond the parasite is a basement window through which is \n               visible a large laundry room complete with washers and dryers. \n               The window has been propped open a couple of inches by a bar \n               of laundry soap.\n\n               The first lady makes a move to find the injured creature, \n               but her companion tightens her grip on the old lady's arm.\n\n<b>                                     COMPANION\n</b>                         Come along, Olive.\n\n<b>                                     FIRST LADY\n</b>                         Oh, Vi! Maybe the poor thing's just \n                         been hurt. Maybe we should look for \n                         him!\n\n<b>                                     COMPANION\n</b>                              (pulling Olive along)\n                         Don't be silly, dear. It's in heaven \n                         now, whatever it is. Won't help at \n                         all for you to get into a fuss and \n                         muddle over it. Now come along and \n                         let's finish up our little evening \n                         stroll and get you tucked up in bed \n                         in front of the color TV.\n\n               The two women walk off down the path, Vi's voice fading away \n               in the shadows.\n\n<b>                                     COMPANION\n</b>                         You know what a restless night you \n                         have if you don't get your two hours \n                         of color TV, dear, so let's bustle \n                         along and get our walk over with, \n                         shall we...?\n\n<b>               INT. ST. LUC'S EXAMINATION ROOM -- NIGHT\n</b>\n               St. Luc is examining Mr. Parkins. Parkins sits on the \n               examination table with the hospital tunic on.\n\n               St. Luc presses gently around Parkins' abdomen in the area \n               of the navel.\n\n<b>                                     PARKINS\n</b>                         Ow! Better take it easy. There's a \n                         lot of pressure in there!\n\n               St. Luc stops pressing and takes up his stethoscope. He begins \n               to percuss the old man's abdomen.\n\n<b>                                     PARKINS\n</b>                         Want me to breathe deeply?\n\n<b>                                     ST. LUC\n</b>                         Just breathe normally.\n\n               St. Luc finishes percussing, removes the stethoscope from \n               his ears, and stands back thoughtfully.\n\n<b>                                     PARKINS\n</b>                              (confidentially)\n                         Good shape for an old man, eh?\n\n<b>                                     ST. LUC\n</b>                              (after a pause)\n                         Mr. Parkins, what makes you think \n                         you caught these lumps of yours from \n                         a young lady?\n\n<b>                                     PARKINS\n</b>                         She had a couple just like them. \n                         Right here near her belly button. \n                         You could push 'em around. I thought \n                         they were kinda sexy, myself.\n\n<b>                                     ST. LUC\n</b>                         Didn't she ever have these lumps \n                         looked at by a doctor?\n\n<b>                                     PARKINS\n</b>                              (shrugs)\n                         Didn't seem worried about them.\n\n<b>                                     ST. LUC\n</b>                         Was this girl from Starliner Towers?\n\n<b>                                     PARKINS\n</b>                         Yep. She lived in 1208. But we usually \n                         went to my place. Bigger liquor \n                         cabinet, bigger bed.\n                              (chuckles, then gets \n                              serious)\n                         She was gone when I got back from my \n                         last Florida trip. Too bad. Had a \n                         beautiful tan.\n                              (smiles again)\n                         Must have gone home to mother.\n\n<b>                                     ST. LUC\n</b>                         Was her name Annabelle Horsefield?\n\n<b>                                     PARKINS\n</b>                         That's the one.\n\n               St. Luc sits down at the counter beneath the medicine cabinet \n               and begins to write in Parkins' file.\n\n<b>                                     ST. LUC\n</b>                         OK, you can get dressed now, Mr. \n                         Parkins.\n\n               The old man begins to put his shirt and tie back on.\n\n<b>                                     ST. LUC\n</b>                              (handing Parkins a \n                              slip of paper)\n                         I'm going to send you to the hospital \n                         to have a few X-rays taken. I want \n                         to find out exactly what you're hiding \n                         in there, OK? Give them this. The \n                         address is right there under \n                         Radiology.\n\n<b>                                     PARKINS\n</b>                         Gonna cut me open?\n\n<b>                                     ST. LUC\n</b>                         Well, let's wait for the X-rays.\n\n<b>                                     PARKINS\n</b>                         Used to know a doctor who said he \n                         got to know his patients better than \n                         their wives did.\n                              (chuckles)\n                         Cutting a man open sure does expose \n                         more of him than pulling down his \n                         pants, gotta admit that.\n\n               St. Luc smiles politely, his mind obviously elsewhere.\n\n<b>               INT. LAUNDRY ROOM -- NIGHT\n</b>\n               A bar of laundry soap props open the window of the laundry \n               room. The presence of the wounded parasite is indicated only \n               by the glistening slime trail which streaks the section of \n               wall immediately below the window.\n\n               The hand of an old woman, puckered and wrinkled from many \n               hours submerged in hot soapy water, reaches up, and yanks \n               the bar of soap out of the jaws of the window. The window \n               swing shut. The woman's hand slides the bolt home, locking \n               the window from the inside.\n\n               The old woman is short, dumpy, puffy-faced, in her late \n               sixties. Her hair is carelessly tied in a bun on top of her \n               head.\n\n               She sniffles, shakes her head, turns away from the window, \n               and walks across the room to the long bank of washers and \n               dryers. As she walks she has to thread her way among the \n               dozen or so shopping bags full of dirty laundry -- against \n               apartment regulations, she takes in outsiders' laundry -- \n               which she has brought down the elevator with her.\n\n               She flips open the top of the first washer and begins to dig \n               clothes out of the nearest shopping bag.\n\n               From above and behind the washer, we watch her fill the \n               machine and reach into the front of her dress, which is black \n               and frayed. After feeling around for a few seconds, she pulls \n               out a plastic bag filled with white granulated detergent. \n               She dumps some of this into the washer, finds the appropriate \n               coins in the pocket of her dress, and starts the machine.\n\n               She watches it for a second to make sure it's working \n               properly, then puts the plastic bag back where she found it. \n               She picks up the bag she has almost emptied and shuffles in \n               her ragged slippers to the next washer. She stops in front \n               of it and puts down the bag.\n\n               The old woman notices a slimy streak near the open hole of \n               the washer. She grimaces, grabs a sock from the bag and cleans \n               off the top of the washer with it. She tosses the sock into \n               the washer and leans over the hole, trying to see inside.\n\n               The parasite which has been lurking in the washer suddenly \n               springs from the opening on to the old woman's face, suckering \n               on to her flesh with its stubby tentacles. She shrieks and \n               grabs at the creature with both hands, trying to pull it \n               off.\n\n               She stumbles back from the washer and begins to trip over \n               various shopping bags. Finally she goes down amidst her \n               laundry, thrashing and spilling clothes out everywhere.\n\n<b>               INT. STARLINER TOWERS GROCERY STORE -- NIGHT\n</b>\n               In the grocery store built into the base of one of the towers, \n               Janine flips through some magazines, finally buying a Vogue.\n\n               She stops to look at several shelves of various kinds of \n               food, picking up this and that, but somehow the thought of \n               cooking or even eating repulses her, and she leaves without \n               buying anything but the magazine.\n\n<b>               INT. HALLWAY -- NIGHT\n</b>\n               Janine walks along a hallway, stops at a door, knocks gently, \n               and then opens the door and walks in, obviously very familiar \n               with the occupant.\n\n<b>               INT. BETTS' APARTMENT -- NIGHT\n</b>\n               Janine enters Betts' apartment. Betts is sitting cross-legged \n               in leotards on the broadloom, a number of very large black-\n               and-white photographs spread out in front of her. As she \n               speaks to Janine, she arranges and rearranges them.\n\n               Other equipment and graphics of various kinds stuck on walls, \n               hidden in corners and lying on chairs and tables suggest \n               that Betts is in advertising and commercial graphics.\n\n               Janine stands halfway in the door.\n\n<b>                                     JANINE\n</b>                         Hi.\n\n<b>                                     BETTS\n</b>                         Hi. Want a drink?\n\n<b>                                     JANINE\n</b>                         No thanks. Just wanted to tell you \n                         that Dr. St. Luc is coming up to see \n                         Nick at ten or so.\n\n<b>                                     BETTS\n</b>                         Was he nice to you?\n\n               Janine nods.\n\n<b>                                     BETTS\n</b>                         Good. Well...\n                              (takes a sip from a \n                              glass on the floor \n                              next to her)\n                         I've ordered in some vrai cuisine \n                         française from Jean-Phillipe at the \n                         Côte d'Azur restaurant. Escargots in \n                         garlic butter... the works. They \n                         have lovely strong delivery boys who \n                         fight their way through sleet and \n                         hail and the gloom of night just to \n                         bring me my coq au vin. And after \n                         Dr. St. Luc has told you that there's \n                         nothing wrong with Nick that a \n                         vacation won't cure, and if Nick \n                         falls asleep early again, you just \n                         come on back here for company and a \n                         late supper. You hear me?\n\n               Janine nods.\n\n<b>                                     BETTS\n</b>                         Now, I mean it. I always order enough \n                         for two and I'll just get fat and \n                         lonely if you don't show up.\n\n               Janine wiggles her fingers goodbye and leaves.\n\n<b>               INT. HALLWAY -- NIGHT\n</b>\n               Janine walks down the hallway to her apartment, her Vogue \n               rolled up under her arm. She opens the door to her apartment -- \n               it's not locked -- and goes in.\n\n               A moment after she's gone and closed the door, two children \n               about ten years old appear around a corner, giggling and \n               jostling each other. They approach Tudor's apartment.\n\n<b>                                     GIRL\n</b>                         C'mon, let's smoke one of the \n                         cigarettes right now. Your father'll \n                         never miss it.\n\n<b>                                     BOY\n</b>                         I can't, dummy. He'll see that the \n                         pack's been opened. You're such a \n                         dumbhead.\n\n<b>                                     GIRL\n</b>                         OK, then. I'm gonna go back to the \n                         store and buy my own pack and smoke \n                         'em all myself.\n\n<b>                                     BOY\n</b>                         Buy 'em with what, dumbhead?\n\n<b>                                     GIRL\n</b>                              (flipping open a milk \n                              box)\n                         With some milk jugs I just happened \n                         to pick up on the way home.\n\n               The first box she tries is empty. She advances to the next \n               and the next, finally finding one that has a jug in it. She \n               takes it and advances to Tudor's box, jug swinging, companion \n               trailing after her in admiration. She stops at Tudor's milk \n               box and flicks the door open.\n\n               She looks inside, just about to reach for the jug that nestles \n               back in the shadows. Ugh! What's that?\n\n               The boy takes a look. Inside the box a third parasite can \n               just be seen clinging to a three-quart white plastic milk \n               jug. The jug is smeared with blood. The box's inside door is \n               ajar. The TV set can be heard from inside the apartment.\n\n<b>                                     BOY\n</b>                         I dunno. Guess the milk went bad.\n                              (shrugs)\n                         It's still worth money.\n\n               The girl hesitates for a second. Suddenly the parasite \n               twitches around to the front of the jug. The girl, startled, \n               slams the box door shut.\n\n<b>                                     GIRL\n</b>                         Jesus!\n\n<b>                                     BOY\n</b>                         Let's get outta here before somebody \n                         hears us!\n\n               The children run off down the hallway together. After a few \n               seconds, the box door is nudged open again from the inside.\n\n<b>               INT. TUDOR'S APARTMENT -- NIGHT\n</b>\n               Janine sits down in front of the TV set. After a moment or \n               two she gets up, turns the set off, and flops back down on \n               the sofa with her Vogue.\n\n               She doesn't notice a trail of bloody slime leading from the \n               bedroom to the inside door of the milk box.\n\n               In the bedroom, a hand reaches down and pulls back a bedsheet \n               to reveal a naked abdomen. It is Tudor's abdomen, and he \n               reaches out with trembling fingers to touch a lump the size \n               of a chicken egg stretching the skin to one side of his navel.\n\n               Tudor watches the lump in the muted light of his bedroom. He \n               gradually extends his hand toward the lump, which disappears \n               the instant it's touched.\n\n<b>                                     TUDOR\n</b>                              (delirious, voice \n                              strained, whispering)\n                         Come here, boy. Here, boy, here.\n\n               He taps and scratches the skin near his navel, as though \n               trying to lure a cat into attacking his fingers.\n\n               He is propped up in bed, sweating profusely, half-dressed. \n               He looks weak and drained, but still manages to smile with \n               maniacal intensity, his eyes wide and bright.\n\n<b>                                     TUDOR\n</b>                         Come on, fella. Thataboy. You and \n                         me, we're gonna be friends, aren't \n                         we?\n\n               We can now see that the sheets are twisted, the pillows half \n               off the bed. Tudor begins drumming on his abdomen.\n\n               Gradually, cautiously, the lump under Tudor's skin returns. \n               He tries to seize the lump with his fingers and it shrinks \n               back, almost disappearing into his abdominal cavity again.\n\n               Tudor seems disappointed.\n\n<b>                                     TUDOR\n</b>                         No, no, no. Don't run away, boy. I'm \n                         not going to hurt you. Not going to \n                         hurt you. We're going to be friends. \n                         Friends.\n\n               The lump returns again. Gently, Tudor begins stroking it. \n               The lump seems to respond by pulsing slightly, the rhythm \n               strangely masturbatory.\n\n<b>                                     TUDOR\n</b>                              (soothingly)\n                         Attaboy.\n                              (closing his eyes in \n                              bliss and smiling \n                              again)\n                         Attaboy.\n\n               In the living room, Janine suddenly realizes that if the TV \n               set was on, Nick must be home.\n\n               She gets to her feet and walks to the bedroom.\n\n               Inside the bedroom, we see the door open. Light floods the \n               room as Janine enters. Janine sees Tudor sprawled out on the \n               bed.\n\n<b>                                     JANINE\n</b>                         Nick? I didn't know you were home. \n                         What's wrong? What are you doing? \n                         You're almost falling out of bed. \n                         How are you feeling?\n\n               Tudor twists around to see who has spoken, eyes wide but now \n               unsmiling. With the same motion, he pulls the covers over \n               his abdomen to hide the lumps from Janine.\n\n               Janine stands at the bedroom door for an instant, then \n               approaches the bedside. She moves as though her hands were \n               tied at her sides, as though she is quite consciously holding \n               herself together.\n\n<b>                                     JANINE\n</b>                              (tenderly, but with \n                              caution, as though \n                              expecting a blow)\n                         Nick, does your stomach hurt? Can I \n                         see those bumps on your tummy, can \n<b>                         I?\n</b>\n               She reaches out to pull back the covers again, but he rolls \n               away from her.\n\n<b>                                     TUDOR\n</b>                         Go away. Leave me alone.\n\n               Janine straightens up. Her hands come up to her face and \n               tears well up in her eyes.\n\n<b>                                     JANINE\n</b>                              (frustrated)\n                         Oh, why won't you let me help you?\n\n               She turns and walks angrily out of the room, slamming the \n               door behind her.\n\n               Tudor rolls over slowly on to his back, eyes wide and shining, \n               smiling again.\n\n<b>                                     TUDOR\n</b>                              (murmuring)\n                         Attaboy, attaboy.\n\n<b>               INT. EXAMINATION ROOM -- NIGHT\n</b>\n               St. Luc is examining a very pretty young girl who sits on \n               the examination table in a hospital tunic.\n\n<b>                                     ST. LUC\n</b>                         OK, Dotty. Everything else seems to \n                         be fine. Now if it gives you any \n                         trouble at all, any sharp pain, any \n                         unusual discharge, you come and see \n                         me right away. They can be tricky \n                         sometimes.\n\n               Dotty nods. OK, you can get dressed. We're all through.\n\n               The girl starts to get dressed. St. Luc scribbles something \n               in her file and then takes it with him into the adjoining \n               office, closing the door behind him.\n\n<b>               INT. ST. LUC'S OFFICE -- NIGHT\n</b>\n               St. Luc sits at his desk and opens Parkins' file. Forsythe, \n               about twenty-three, earthy and humorous, comes in with an \n               armful of papers and records, which she throws in groups on \n               to St. Luc's desk.\n\n<b>                                     FORSYTHE\n</b>                              (distributing papers)\n                         OK, Roger. Here's the stuff you \n                         wanted. Files on Horsefield, Tudor, \n                         Swinburne, and Velakofsky. Papers \n                         published by Hobbes, Linsky, and \n                         Lefebvre in a couple of issues of \n                         the Bulletin of the Canadian Medical \n                         Association and also the Journal of \n                         the American Medical Association. \n                         And, as an added extra, a couple of \n                         odds and ends from the files I helped \n                         compile before your time here, Doctor. \n                         I thought they might interest you.\n\n<b>                                     ST. LUC\n</b>                         That's great, Forsythe, great. Thanks.\n\n<b>                                     FORSYTHE\n</b>                         Do I get a kiss?\n\n               St. Luc is absorbed in his papers and doesn't respond. \n               Forsythe prods his shoulder. He looks up at her.\n\n<b>                                     FORSYTHE\n</b>                         Kiss, kiss?\n\n<b>                                     ST. LUC\n</b>                         Uh, OK. Sure.\n\n               They kiss, St. Luc making sure that it doesn't get too heavy.\n\n<b>                                     FORSYTHE\n</b>                         Another kiss?\n\n<b>                                     ST. LUC\n</b>                         C'mon, Forsythe. Are there any more \n                         on the list?\n\n<b>                                     FORSYTHE\n</b>                         No. Dotty's the last.\n\n               The telephone rings. St. Luc picks it up.\n\n<b>                                     ST. LUC\n</b>                         Yes?\n\n<b>                                     ROLLO (V.O.)\n</b>                         That you, Rog?\n\n<b>                                     ST. LUC\n</b>                              (not recognizing the \n                              voice)\n                         Yes?\n\n<b>                                     ROLLO (V.O.)\n</b>                         It's me, Rollo Linsky. Remember me?\n\n<b>                                     ST. LUC\n</b>                         Rollo! How'sa boy? I was just thinking \n                         about you.\n\n               Realizing that the conversation is likely to be a long one, \n               Forsythe gets off the desk and walks over to a metal locker \n               in the corner, which she opens.\n\n               Inside are her street clothes. She begins to take off her \n               nurse's uniform in full view of St. Luc, not being obvious \n               about the distraction she's providing, but not taking pains \n               to hurry dressing or be modest either.\n\n               In the scene that follows we cut among three basic things: \n               Rollo in his lab, talking and eating; St. Luc in his office, \n               watching Forsythe get undressed and then dressed; and Hobbes's \n               notes and scribblings, which do not necessarily have to be \n               on the screen long enough to be completely read. Hobbes's \n               notes are there more to convince the viewer that they exist \n               and to provide flavor than to transfer information.\n\n<b>                                     ST. LUC\n</b>                         Been glancing at some of your \n                         publications on your work with Hobbes.\n\n<b>               INT. ROLLO'S LAB -- NIGHT\n</b>\n               In his lab, Rollo sits at the gynecological table abandoned \n               by Hobbes. Rollo is using it as an auxiliary desk.\n\n               On the table are several opened waxed-paper packages of beef \n               knishes and accessories. There are also several old cardboard \n               shoeboxes, some still tied with string, some opened and \n               overflowing with papers of all kinds: Hobbes's private notes.\n\n<b>                                     ROLLO\n</b>                              (eating a knish)\n                         Yeah, well, I'm flattered, but you \n                         won't find any real meat in them.\n\n<b>                                     ST. LUC (V.O.)\n</b>                         No? How come?\n\n<b>                                     ROLLO\n</b>                              (shuffling papers)\n                         Listen, Rog. I knew Hobbes was funny, \n                         you know? I told you that. But I \n                         didn't really know just how funny he \n                         was. See... when he kicked off, they \n                         sent all the personal secret stuff \n                         they found to his mother -- she's \n                         still alive but just barely -- and \n                         she sent everything she thought was \n                         medical to me here at the lab. I'm \n                         Hobbes's partner, right?\n                              (laughs sardonically)\n                         Anyway, I've been going through his \n                         papers, and what they add up to is \n                         this: Hobbes was shafting us all, \n                         me, the university, the foundations \n                         and the councils, the private labs, \n                         everybody. We never really knew what \n                         it was we were working on. Hobbes \n                         gave us each a few crumbs, but he \n                         was the only one who knew what the \n                         whole loaf would look like.\n\n<b>               INT. ST. LUC'S OFFICE -- NIGHT\n</b>\n               St. Luc watches as Forsythe rolls her stockings down. He \n               shuffles through Hobbes's publications.\n\n<b>                                     ST. LUC\n</b>                         OK, I bite. What does it look like?\n\n<b>               INT. ROLLO'S LAB -- NIGHT\n</b>\n<b>                                     ROLLO\n</b>                         It looks like -- and I quote -- 'a \n                         disease to save man from his mind.'\n\n<b>                                     ST. LUC (V.O.)\n</b>                         I don't get it.\n\n<b>                                     ROLLO\n</b>                         Lemme clarify for you.\n\n               Rollo pauses to wash down some knish with a can of Coca-Cola.\n\n<b>               INT. ST. LUC'S OFFICE -- NIGHT\n</b>\n               Forsythe catches St. Luc watching her dress and smiles. St. \n               Luc swivels back to his files.\n\n<b>               INT. ROLLO'S LAB -- NIGHT\n</b>\n               Rollo searches through Hobbes's notes to find the relevant \n               quotes. As he does so, he drops a few crumbs of knish on the \n               page and his plump fingers brush the crumbs away, smearing \n               some meat over the words.\n\n<b>                                     ROLLO\n</b>                         Hobbes thought that man is an animal \n                         that thinks too much, an animal that \n                         has lost touch with his instinct, \n                         his 'primal self'... in other words, \n                         too much brain and not enough guts. \n                         And what he came up with to help our \n                         guts along was a human parasite that \n                         is... lemme find it here... 'a \n                         combination of aphrodisiac and \n                         venereal disease, a modern version \n                         of the satyr's tongue.'\n\n               Rollo pauses and flips to a new note with the heading \n               ANNABELLE underlined in red: 'She is becoming a new creature \n               before my eyes. It is like living at the Dawn of Creation. I \n               am euphoric, I am in ecstasy.'\n\n<b>                                     ROLLO\n</b>                         But the important thing for you is \n                         this: Hobbes used Annabelle as a \n                         guinea pig. He implanted her with \n                         the thing. I figure that once the \n                         parasites took, Annabelle went \n                         berserk. I dunno what she did, but \n                         Hobbes wasn't ready for it. He had \n                         to kill her. And he wasn't trying to \n                         burn her, he was burning them, all \n                         of them.\n\n<b>               INT. ST. LUC'S OFFICE -- NIGHT\n</b>\n               St. Luc watches Forsythe, who is halfway through getting her \n               street clothes on. He toys with the Velakofsky file, which \n               contains abdominal X-rays showing dark, blurred masses inside \n               the abdominal cavity.\n\n<b>                                     ST. LUC\n</b>                         He didn't make it.\n\n<b>                                     ROLLO (V.O.)\n</b>                         Huh?\n\n<b>                                     ST. LUC\n</b>                         Maybe Hobbes didn't know it, but \n                         Annabelle was a pretty popular girl \n                         around Starliner Towers. I've got \n                         three men here, maybe four, who're \n                         hosting large, free-moving, apparently \n                         pathogenic, abdominal growths that \n                         nobody I've tried can identify. You \n                         were next on my list.\n\n<b>               INT. ROLLO'S LAB -- NIGHT\n</b>\n<b>                                     ROLLO\n</b>                         I'd kinda like to come over there \n                         and have a look at one of these guys.\n\n<b>                                     ST. LUC (V.O.)\n</b>                         I've got a date with one of them at \n                         ten. Can you make it?\n\n<b>                                     ROLLO\n</b>                         Yeah.\n                              (pause)\n                         Ah, I don't want to panic you or \n                         anything, but, I mean, the way Hobbes \n                         designed them, they're supposed to \n                         get out of hand real quick, so you \n                         don't have much time to think about \n                         what's happening to you. Once they \n                         decide to start pumping all those \n                         dynamite juices into the old blood \n                         stream... I dunno. But if you see \n                         some people doing kind of compulsive, \n                         maybe even bizarre sexual things...\n\n<b>                                     ST. LUC (V.O.)\n</b>                              (laughing: he doesn't \n                              take this aspect too \n                              seriously)\n                         Yeah? What do I do then?\n\n<b>                                     ROLLO\n</b>                         I dunno. Try tranquilizers. Once you \n                         can get at them, there's a lotta \n                         stuff you can use. I'll bring a \n                         bagful. It's just the standard \n                         tropical kit. But the trick is to \n                         get at them.\n\n<b>               INT. ST. LUC'S OFFICE -- NIGHT\n</b>\n               Forsythe has finished dressing and is waiting for St. Luc to \n               get off the phone.\n\n<b>                                     ST. LUC\n</b>                         OK. It's apartment 1009, South Tower, \n                         Starliner Towers. May as well go \n                         there directly.\n\n<b>                                     ROLLO (V.O.)\n</b>                         OK, Rog. See you at ten.\n\n               St. Luc hangs up.\n\n<b>                                     FORSYTHE\n</b>                         Roger? If you're going to be staying \n                         here anyway, why don't you come up \n                         to my place for a late supper?\n\n<b>                                     ST. LUC\n</b>                         Meeting Rollo at Tudor's. Might take \n                         a while.\n\n<b>                                     FORSYTHE\n</b>                              (innocently)\n                         Doesn't matter to me how late it is. \n                         I can keep it warm.\n\n               St. Luc pushes his papers aside for a moment and stretches \n               in his swivel chair.\n\n<b>                                     FORSYTHE\n</b>                         Anything wrong?\n\n<b>                                     ST. LUC\n</b>                         No. I don't think so.\n\n<b>                                     FORSYTHE\n</b>                         Well? Supper at my place?\n\n<b>                                     ST. LUC\n</b>                         OK. But late.\n\n<b>                                     FORSYTHE\n</b>                              (happy because she \n                              knows she can get \n                              him to stay overnight)\n                         Great! Go back to your files. Bye.\n\n               She leaves, closing the door behind her. St. Luc swivels \n               thoughtfully in his chair for a second or two, then turns \n               back to his files.\n\n<b>               INT. RECEPTION AREA -- NIGHT\n</b>\n               Forsythe walks through the darkened and deserted reception \n               area to the elevators. Through the main doors we see a \n               delivery van parked in the main driveway.\n\n<b>               INT. MAIN DOORS -- NIGHT\n</b>\n               A young man aged about twenty-five -- Kurt, the delivery \n               boy, dark, intense, bearded, his manner as stiff and formal \n               as the tuxedo that he wears -- rolls a restaurant serving \n               cart toward the main doors. He has obviously just come from \n               the van outside, which is emblazoned with the words \n               'Restaurant Côte d'Azur'.\n\n               The doorman smiles and opens the door for Kurt, obviously \n               familiar with the restaurant. Kurt takes great care as he \n               lifts the cart slightly so that it clears the doormats. On \n               the cart's two levels is an elaborate array of silver serving \n               vessels and utensils.\n\n<b>               INT. HALLWAY -- NIGHT\n</b>\n               Elevator doors slide open and Kurt steps out, pushing his \n               cart. He walks down the hallway looking for Betts's apartment. \n               After he has passed a few doors he approaches one which is \n               slightly ajar.\n\n               As Kurt approaches, the door opens wider to reveal the old \n               woman from the laundry room. She is no longer wearing her \n               dumpy laundry clothes, however, but is dressed in a \n               translucent nightgown and wears a grotesque amount of make-\n               up. She is careful to keep half her face hidden behind the \n               door.\n\n               Kurt notices her but chooses to ignore her. He is just \n               approaching her when she calls to him.\n\n<b>                                     OLD WOMAN\n</b>                         I'm hungry!\n\n               Kurt keeps on moving. He is now just passing her door. The \n               old woman edges out from behind the door a bit more.\n\n<b>                                     OLD WOMAN\n</b>                         I'm hungry!\n\n               Kurt can't resist turning to look at her, although he keeps \n               moving. When he looks her in the eye, she eases out slightly \n               from behind the door to reveal that half her face has been \n               horribly burned by the laundry-room parasite, the eye melted \n               shut, the nostril drooping.\n\n               Kurt is so stunned that he slows. The old woman speaks softly.\n\n<b>                                     OLD WOMAN\n</b>                         Hungry for love. Hungry for love.\n\n               She suddenly reaches out and grabs Kurt by his tux with both \n               hands and, with tremendous energy, jerks him back into her \n               apartment and slams the door closed with a vicious kick.\n\n               Kurt's cart remains out in the hallway, the food steaming.\n\n<b>               INT. BETTS' APARTMENT -- NIGHT\n</b>\n               In her dining room, Betts mixes herself a drink and checks \n               her watch. She takes a sip, then goes into the bathroom and \n               bends over the bathtub, having balanced her drink on the \n               edge of the tub.\n\n               From inside the drain of the tub we see Betts place the plug \n               in the plughole.\n\n               Betts turns on the water, adjusting the proportion of hot to \n               cold until she gets it exactly the way she wants it, then \n               gets undressed.\n\n               She wraps a thick and colorful towel around her and goes out \n               to the living room with her drink in hand. In the living \n               room, she arranges her photos in a new order, props them up \n               against the sofa, changes them around again.\n\n               Back in the bathroom, Betts checks the temperature of the \n               water by swishing her hand around in it. The water drums \n               heavily on the floor of the tub. Betts puts her drink on the \n               edge of the tub and turns the water off.\n\n               She now drops her towel on to the bathmat and steps into the \n               tub. She reaches over the edge of the tub to straighten her \n               sandals on the bathmat, then picks up her drink and stretches \n               back. She takes a big slug of her drink. Her toes curl in \n               pleasure.\n\n               The drain plug begins to jerk and twitch, as though something \n               were trying to push it out from inside the drain.\n\n               Betts sinks down in the water until her hair, short as it \n               is, begins to float a bit.\n\n               The drain plug begins to jerk more and more violently until \n               it is pushed right out of its plug hole. The water begins to \n               run out of the drain, but only in a slight trickle -- the \n               drain pipe is blocked by a soft, spongy body.\n\n               Betts rolls her head back and forth across the back of the \n               tub, smiling, relaxed, enjoying the sensation.\n\n               One of the parasite's stubby tentacles slowly appears, probing \n               out of the drain hole. Then another appears, then another.\n\n               Betts puts down her drink on the tub's edge and reaches for \n               the soap and washcloth. Her eyes are half-closed and a smile \n               still flickers about her lips. The sound of water suddenly \n               rushing out of the drain in volume rouses Betts out of her \n               reverie.\n\n               She sits up and looks down toward the plug end of the tub. \n               The parasite is crawling toward her up the middle of the \n               tub, almost touching her legs, which are pressed together \n               against one side of the tub. The water is becoming pink with \n               the blood that diffuses through it.\n\n               Betts' mouth opens slowly and her eyes are wide. Her reactions \n               are obviously being confused by the drinks she has recently \n               had.\n\n               Under the water, now very shallow, the parasite's tentacles \n               touch Betts's thighs.\n\n               Betts tries to scream but can't. The parasite suckers its \n               way between Betts' thighs. She screams a silent scream in \n               the tub, her mouth wide open, her head rolling from side to \n               side. The only sounds are the thrashing of her legs in the \n               water and the gurgle of the drain.\n\n               With a spasm that shakes her whole body, Betts throws her \n               arms wide and knocks her glass off the edge of the tub and \n               on to the tiles of the bathroom floor. The glass shatters. \n               After a moment or two of further silent struggle, Betts arches \n               her back, then falls into a semi-conscious stupor, slumping \n               motionless in the tub.\n\n<b>               INT. TUDOR'S APARTMENT -- NIGHT\n</b>\n               Nicholas Tudor lies flat on his back in bed on top of the \n               covers. The physical state of his face, ghastly and \n               cadaverous, is in sharp contrast to his expression, which is \n               ecstatic, beatific, Madonna-like.\n\n               Tudor's hands rest on his abdomen in a posture often \n               associated with pregnant women. Between his hands, in the \n               area around the navel, three lumps shift beneath the skin, \n               changing positions and pulsing rhythmically.\n\n               As they move, Tudor makes little delirious crooning sounds, \n               a parody of a lullaby.\n\n               In the living room, Janine sits on the couch agitatedly \n               flipping through her Vogue, now wearing large, fashionable \n               glasses with thick, tinted prescription lenses. She can't \n               seem to get into doing anything until St. Luc comes.\n\n               She gets up and turns the TV on again, deliberately turning \n               up the volume to an uncomfortable level.\n\n<b>               INT. HALLWAY -- NIGHT\n</b>\n               An old man and his wife, the Spergazzis, are taking their \n               late-night constitutional through the halls of the South \n               Tower.\n\n               Their arms are linked and they both walk with the aid of \n               canes, the ultra-modern aluminum kind with four rubber-tipped \n               prongs at the end.\n\n<b>                                     MR. SPERGAZZI\n</b>                         Lovely, lovely evening. Very quiet, \n                         eh?\n\n               Mrs. Spergazzi nods and smiles, patting Mr. Spergazzi's hand. \n               They round a corner which leads them down the stretch of \n               hall which passes by Tudor's door.\n\n               As they approach Tudor's door they notice a plastic milk jug \n               lying in the hall just below the open milk-chute door.\n\n               Mrs. Spergazzi detaches herself from her husband and bends \n               down with difficulty to pick up the jug.\n\n<b>                                     MRS. SPERGAZZI\n</b>                         Eh, the children in this apartment, \n                         they're such little thieves. You \n                         have to put a lock on everything.\n\n               She puts the jug back in the milk chute. She notices the \n               blood smeared on it just a second before the parasite in the \n               chute fastens itself to her wrist with its suckers.\n\n               She stares at her wrist in astonishment. She is wearing the \n               parasite like some monstrous, spongy, oozing wristwatch. She \n               tries to shake the thing off. It can't be dislodged. She \n               turns in disbelief to her husband and then screams at the \n               top of her lungs.\n\n               Mr. Spergazzi lifts his cane and tries to strike the thing \n               with the cane's prongs. The force of his blow throws him off \n               balance and he falls, dragging his wife down with him.\n\n               Mrs. Spergazzi moans in pain and terror. Her husband manages \n               to get to his knees and begins to smash at the thing with \n               his cane. White burning fluid begins to squirt everywhere. \n               Mrs Spergazzi's forearm begins to smoke, bubble, and dissolve. \n               She becomes hysterical.\n\n               Mr. Spergazzi continues to smash away at the thing, now with \n               some success.\n\n<b>               INT. FORSYTHE'S APARTMENT -- NIGHT\n</b>\n               In the kitchen, a thick paperbound book called Guide to \n               Gourmet Cooking lies open and face down on the kitchen counter \n               next to the sink. There are a couple of pots and pans heating \n               on the stove.\n\n               Forsythe picks up the book, then opens one of the pots to \n               check something. She is obviously taking a lot of care with \n               St. Luc's late supper. She puts the lid back on the pot, \n               reads a bit more, then checks the time on an electric clock \n               on the counter.\n\n               She opens the oven door, then takes a bone-handled carving \n               fork from a carving set and begins to prod at a roast in a \n               ceramic roasting dish.\n\n               Someone knocks on the door. Forsythe leaves her oven and \n               goes to answer it, carving fork in hand.\n\n               She opens the door. Kresimir Sviben stands in the hallway, \n               eyes wide, insane smile on his face. He looks at Forsythe as \n               though she were a piece of steak.\n\n<b>                                     FORSYTHE\n</b>                         Yes?\n\n               Kresimir doesn't answer. He begins to drool, his mouth working \n               as though in anticipation of a meal. Forsythe gets a little \n               nervous.\n\n<b>                                     FORSYTHE\n</b>                         Can I... can I help you?\n\n               Kresimir approaches. He is visibly shaking.\n\n<b>                                     KRESIMIR\n</b>                              (speaking with \n                              difficulty)\n                         Yes... you can... help me.\n\n               Without warning, he lunges for Forsythe, who vainly tries to \n               slam the door in his face. Kresimir pushes his way past the \n               door and grabs Forsythe by the back of the head, trying to \n               kiss her and drooling.\n\n               Forsythe breaks away and runs toward the bathroom, intending \n               to lock herself in. Kresimir throws himself at her legs, \n               managing to grab one of her feet. She doesn't fall, but holds \n               on to a cabinet and tries to pull free.\n\n               Kresimir begins to climb up her body. Forsythe, terrified \n               and gasping for breath, plunges the long, curved prongs of \n               the carving fork into Kresimir's shoulder. He screams with \n               pain and loosens his grip on Forsythe long enough for her to \n               pull away, leaving her apron and part of her dress in \n               Kresimir's hands.\n\n               She runs for the door and is gone.\n\n               Kresimir, still on his knees, holds the apron and the piece \n               of dress to his face, breathing in Forsythe's fragrance. He \n               begins to shuffle toward the door on his knees, kissing the \n               clothes in his hands, mumbling and moaning.\n\n<b>                                     KRESIMIR\n</b>                         Oh, my darling, I worship, I worship \n                         at the shrine of your body, your \n                         body, your body, oh, your body...\n\n<b>               INT. BETTS'S BATHROOM -- NIGHT\n</b>\n               Betts lies slumped in her bathtub, her hair matted and damp, \n               her eyes open and staring. Her mouth begins to work in a \n               very sensual way, and she begins to drool slightly.\n\n               The tub is completely empty now except for the scum of blood \n               and soap. The smashed glass is scattered all over the floor \n               near the base of the tub.\n\n               Zombie-like, Betts rises from the tub and steps out on to \n               the floor, her feet missing the bathmat. The crunch and snap \n               of her bare feet on the broken glass are heightened abnormally \n               by the tiled echo chamber of the bathroom.\n\n               The steps Betts takes toward the medicine cabinet leave bloody \n               prints on the floor.\n\n               Betts takes out various bottles and plastic cases and tubes \n               from the medicine cabinet and begins to apply make-up to her \n               face with mechanical precision.\n\n<b>               INT. ST. LUC'S OFFICE -- NIGHT\n</b>\n               St. Luc is reading a section of one of Hobbes's medical papers \n               in preparation for examining Tudor later on. The section we \n               see says: '...thus the theoretical organism we are now \n               considering would exhibit what I choose to call \"compressed \n               evolution.\" This in effect means that each generation of the \n               said organism would be better adapted to inhabit and to \n               control the behavior of its host...'\n\n               Suddenly Forsythe bursts in, out of breath, semi-hysterical, \n               tearful.\n\n               St. Luc rises from his chair and Forsythe throws herself on \n               him, sobbing.\n\n<b>                                     ST. LUC\n</b>                         Forsythe, Forsythe! What's wrong? \n                         What's happened?\n\n<b>                                     FORSYTHE\n</b>                         A man... I think I recognized him... \n                         a man who lives here. He just...\n                              (breaking down)\n                         ...he just attacked me for no reason \n                         at all. I just opened the door... I \n                         was making supper for you, and he \n                         grabbed me, he tried to kiss me...\n\n               St. Luc hugs Forsythe for a moment, then holds her away from \n               him so that he can get some information out of her.\n\n<b>                                     ST. LUC\n</b>                         Where is he now? Do you know?\n\n<b>                                     FORSYTHE\n</b>                         I think I... I think I killed him. I \n                         stabbed him with something and he \n                         fell.\n\n<b>                                     ST. LUC\n</b>                         Will you be OK now? I've got to go \n                         to your place to see if he's still \n                         there. I've got to see if it's... if \n                         it's what we both think it is.\n\n<b>                                     FORSYTHE\n</b>                         Oh, no! You're not leaving me here \n                         all alone. I'm going with you.\n\n               St. Luc hesitates for a second, then grabs his black leather \n               doctor's bag.\n\n<b>                                     ST. LUC\n</b>                         OK, c'mon.\n\n               They leave.\n\n<b>               INT. ELEVATOR -- NIGHT\n</b>\n               Inside a descending elevator, a middle-aged woman and her \n               teen-aged daughter flip through a magazine together. The \n               elevator sinks toward the ground floor of the South Tower, \n               then slows and stops. They both look up at the floor numbers. \n               It's not their floor.\n\n               The doors slide open. Nobody seems to be waiting. The mother \n               pushes the CLOSE DOOR button, a bit impatiently. A hand \n               holding a crêpe oozing red jam and sugar reaches around into \n               the elevator.\n\n               The two women cringe, suddenly afraid. Kurt, the delivery \n               boy, steps around and into the elevator, smiling broadly, \n               eyes wide and glistening. He drools slightly. The doors slide \n               closed. Kurt offers one crêpe to each woman.\n\n<b>               INT. MAIN DOORS -- NIGHT\n</b>\n               The doorman sits beside the intercom board reading another \n               Harlequin Nurse Romance when he happens to glance up and \n               notice the elevator flashers which indicate a stuck elevator.\n\n               He sighs, shakes his head -- always something going wrong -- \n               stuffs the pocketbook into his jacket, and gets up, taking \n               out a huge ring of keys from his pocket as he does so.\n\n               He walks over to the metal control panel sunk into the wall \n               between the elevators and opens it with one of the keys on \n               the ring. Then, checking to make sure which elevator is the \n               stuck one, he plays with a switch which manually overrides \n               the floor selector and brings the elevator down.\n\n               The doorman watches as the numbers show that the elevator is \n               finally coming down. He stands by, waiting to see who or \n               what has caused the elevator to stay at one floor for so \n               long, jingling his keys, trying to look stern and \n               authoritarian.\n\n               The doors spring open. Kurt stands at the back of the \n               elevator, one arm around the young girl, who hugs him tightly. \n               The girl is finishing the last bit of one of the crêpes, \n               sucking her fingers deliciously.\n\n               The mother sits slumped in the opposite corner, her coat \n               open, her dress torn, bruises on her face. She struggles to \n               her feet. Kurt and the girl are ignoring her.\n\n               The doorman is nonplussed. He hesitates, then makes a move \n               toward the elevator, intending to help the woman to her feet.\n\n<b>                                     DOORMAN\n</b>                         Here, here. What is this all about? \n                         What's the matter with you? What are \n                         you doing in there?\n\n               The woman suddenly lunges at the doorman and tries to pull \n               him down. Kurt detaches himself from the girl and joins her. \n               They giggle and drool all over the doorman as they pull him \n               down and pin him to the floor.\n\n               The daughter, still licking her fingers, slowly approaches \n               the doorman.\n\n<b>                                     DOORMAN\n</b>                         Hey, that's enough, enough of this \n                         nonsense! What is this?\n                              (Etc.)\n\n               The daughter kneels at the doorman's feet, then crawls over \n               him, her mouth working, drooling. She lowers her lips over \n               his, Kurt making it impossible for the doorman to move his \n               head out of the way.\n\n<b>               INT. HALLWAY -- NIGHT\n</b>\n               Forsythe and St. Luc are hurrying to Forsythe's apartment to \n               see if Kresimir is still there. As they round a corner, they \n               see the Spergazzis coming toward them, the old lady hobbling \n               and hysterical, the old man helping her walk as best he can, \n               trying to maintain some kind of calm.\n\n               When Spergazzi sees St. Luc, he lifts his four-pronged cane \n               and waves it around to get attention.\n\n<b>                                     MR. SPERGAZZI\n</b>                         Hey, Doctor, Doctor! Please. Help \n                         us!\n\n               St. Luc and Forsythe rush over and help to support the \n               slumping Mrs. Spergazzi.\n\n<b>                                     ST. LUC\n</b>                         What happened?\n\n<b>                                     MR. SPERGAZZI\n</b>                              (tipping his hat as \n                              he introduces himself \n                              even in the midst of \n                              chaos)\n                         Please pardon me. I am Niccolo \n                         Spergazzi. I am a resident here. I \n                         don't know... we were walking in the \n                         hallway and... Cabiria... my wife... \n                         she was attacked by this thing... \n                         here, on her arm.\n\n               Spergazzi shows St. Luc his wife's forearm, which has been \n               badly burned by the parasite's animal-tissue solvent. As \n               soon as St. Luc starts prodding her arm, Mrs. Spergazzi starts \n               to wail in Italian. Spergazzi tries to soothe her as St. Luc \n               examines her carefully.\n\n<b>                                     MR. SPERGAZZI\n</b>                         It's all right, cara mia. What's one \n                         more scar to an old lady, eh? You'll \n                         be OK.\n\n               The old lady wails even more.\n\n<b>                                     ST. LUC\n</b>                         Where is this thing that attacked \n                         your wife?\n\n<b>                                     MR. SPERGAZZI\n</b>                         I hit it. I hit it with my cane. \n                         Then I carry it on the cane and I \n                         throw it down to the incinerator, \n                         down to the garbage.\n\n               St. Luc hands his bag to Forsythe.\n\n<b>                                     ST. LUC\n</b>                              (to Spergazzi)\n                         This is Nurse Forsythe. She's a nurse, \n                         you understand me?\n\n               Spergazzi nods. St. Luc turns to Forsythe.\n\n<b>                                     ST. LUC\n</b>                         Go back to their apartment with them \n                         and treat her for second-degree burns. \n                         It'll have to do for now.\n                              (to Spergazzi)\n                         What's your number? The number of \n                         your apartment?\n\n<b>                                     MR. SPERGAZZI\n</b>                         We live in 703.\n\n<b>                                     ST. LUC\n</b>                              (to Forsythe)\n                         OK. I'll meet you back there. Don't \n                         leave until I get there. Lock the \n                         door and don't open it except for \n                         me. OK?\n\n<b>                                     FORSYTHE\n</b>                         But where are you going?\n\n<b>                                     ST. LUC\n</b>                              (walking away)\n                         Down to the incinerator.\n\n<b>               INT. TUDOR'S APARTMENT -- NIGHT\n</b>\n               Janine dozes fitfully on the couch, her glasses fallen on to \n               the carpet, her Vogue crumpled underneath her. Tudor's voice \n               calls to her from the bedroom. It has an eerie, wailing tone \n               to it.\n\n<b>                                     TUDOR\n</b>                         Janine. Janine. Come here. Come into \n                         the bedroom, Janine.\n\n               Tudor keeps calling until Janine wakes up with a start and \n               jumps to her feet, still half asleep. She rubs her eyes and \n               walks to the bedroom.\n\n               Janine opens the bedroom door. From her point of view we see \n               a dark, blurry figure sitting on the edge of the bed.\n\n<b>                                     JANINE\n</b>                         Nick? Are you up? I can't see a thing, \n                         I took my contacts out.\n\n               Tudor speaks from the bed without moving.\n\n<b>                                     TUDOR\n</b>                         Hello, darling. I feel wonderful. \n                         Come and sit beside me, beside me on \n                         the bed.\n\n               Janine hesitates for a second, then walks to the bed and \n               sits down. She can now see that Tudor, although pale and \n               sickly, is smiling ecstatically. He puts an arm around Janine, \n               who reacts stiffly.\n\n<b>                                     TUDOR\n</b>                         Do you want to make love? You're \n                         absolutely beautiful, those eyes, \n                         that expression. You're absolutely \n                         the most sexy thing alive. Do you \n                         want to make love?\n\n<b>                                     JANINE\n</b>                              (slightly repulsed)\n                         Nick, you're so strange...\n\n               Tudor begins to unbutton his shirt with one hand, his other \n               still gripping Janine tightly.\n\n<b>                                     TUDOR\n</b>                         You will make love to me, won't you, \n                         Janine? Won't you make love to me? \n                         You start it. Won't you? I think \n                         I've forgotten how to start.\n\n<b>                                     JANINE\n</b>                              (now in tears)\n                         Oh, Nick, Nick... I can't take this.\n\n<b>                                     TUDOR\n</b>                         Please, Janine. Please, \n                         pleasepleaseplease, Janine Janine \n                         JanineJanineJanine...\n\n               Janine hesitantly helps Tudor remove his shirt and begins to \n               caress him in a perfunctory way, tears in her eyes. Her \n               caresses make Tudor moan with pleasure.\n\n<b>                                     TUDOR\n</b>                         Love me. Oh, Janine, you're so \n                         beautiful. You're my wife. Mmm. You're \n                         my wife.\n\n               Janine's hand sweeps across Tudor's abdomen. She pulls her \n               hand away, startled, obviously having just felt a few of \n               Tudor's lumps.\n\n               She looks up at Tudor's face with a mixture of horror and \n               wonder in her eyes. Tudor is confused; he doesn't want the \n               caresses to stop.\n\n<b>                                     TUDOR\n</b>                              (pleading)\n                         You're my wife, Janine. Please make \n                         love to me.\n\n<b>               INT. SPERGAZZI APARTMENT -- NIGHT\n</b>\n               The Spergazzi apartment is very heavily decorated in the \n               Mediterranean European Catholic style, featuring lots of \n               plastic and plaster Madonnas, calendars with Christ exposing \n               his bleeding heart, etc.\n\n               Mrs. Spergazzi lies on an overstuffed couch with her wrist \n               held up for Forsythe to bandage after she coats it with a \n               healing gel. Mrs. Spergazzi wears a suffering-martyr \n               expression. Mr. Spergazzi leans over the back of the couch \n               patting his wife's other hand solicitously.\n\n<b>               INT. INCINERATOR ROOM -- NIGHT\n</b>\n               The steel door at the top of a concrete flight of stairs \n               swings open and St. Luc appears. He quickly negotiates the \n               steps and opens the steel door at the bottom which leads to \n               the incinerator room.\n\n               Once inside, St. Luc grabs the poker hanging from an iron \n               hook sunk into the wall of the incinerator, slides open the \n               bolt on the door and opens it.\n\n               He begins to probe around inside the incinerator oven but \n               can't really see very much. He looks around and notices the \n               superintendent's flashlight stuck up on top of a heating \n               pipe. St. Luc takes down the flashlight, switches it on, and \n               continues his search for the dead parasite.\n\n<b>               INT. TUDOR'S APARTMENT -- NIGHT\n</b>\n               Tudor lies on top of Janine on their bed. Over his shoulder, \n               Janine's face is visible, eyes wide open and full of tears. \n               She tries to push Tudor away, but he resists.\n\n<b>                                     JANINE\n</b>                              (frantically)\n                         No, no. Nick, please. Stop. Let's \n                         stop. I... I want to put my contacts \n                         in... I can't see anything...\n\n               Tudor pulls her back to him, and finally she is forced to \n               batter him away with her fists and slip off the edge of the \n               bed. Tudor glares after her.\n\n<b>                                     TUDOR\n</b>                              (in a mechanical whine)\n                         Make love to me, make love to me, \n                         love, love to me...\n\n<b>                                     JANINE\n</b>                              (trying to buy time)\n                         I want to be able to see us, Nick. \n                         I... I'm going to go into the bathroom \n                         now and put in my contacts, OK? Is \n                         that OK?\n                              (pleading with him to \n                              believe her)\n                         I want to be able to see us when we \n                         make love, OK?\n\n               Tudor's eyes are staring right out of his head and his mouth \n               is wide open. He gasps for breath. He stares at Janine for a \n               second, then buries his face in the blankets, twisting them \n               in his hands and moaning.\n\n               Janine bursts into tears and turns away from the bed, heading \n               for the bathroom.\n\n               In the bathroom, Janine starts to shake, on the verge of \n               hysteria. Distractedly, she goes through the motions of \n               putting her contact lenses in: opens the medicine-cabinet \n               door, takes out the lens container, takes out the bottles of \n               wetting and soaking solutions, opens the lens container. \n               Suddenly, Tudor wails terribly, like a hound, from the \n               bedroom.\n\n<b>                                     TUDOR\n</b>                              (heart-rending wail)\n                         Ooooooooooooooooo!\n\n               Janine turns to the door, turns back to the lenses, dumps \n               both lenses out into her hand, begins to squirt solution on \n               them. She has decided to try to ignore Tudor.\n\n<b>                                     TUDOR\n</b>                              (wailing)\n                         Janine, Janine, Janinnnnnneeee!\n\n               Janine can no longer pretend that she doesn't hear him. \n               Closing her hand around the two lenses, she runs out of the \n               bathroom.\n\n               Tudor lies outstretched on the bed in the darkness. His lips \n               move silently, spasmically, as though in sleep, twitching in \n               an abnormal, insect fashion. There is a swelling in his \n               throat, almost as though he has developed a goiter, which \n               swells and contracts rhythmically.\n\n               Janine appears in the doorway.\n\n<b>                                     JANINE\n</b>                              (a strangled half-\n                              whisper)\n                         I'm here, Nick. Janine is here.\n\n               After a pause, she walks into the room.\n\n               She climbs on to the bed and settles down. She puts her face \n               very close to Tudor's. For the moment, his face is \n               expressionless, but his neck is swollen just under the jaw.\n\n               Janine sighs deeply, trying not to panic. Her eyes narrow \n               suddenly -- she hasn't got her lenses in and her gaze is \n               myopic -- as she notices something odd.\n\n               There is a bit of black something, a thread, in the corner \n               of Tudor's mouth. Janine moves closer to it. The black thing, \n               like the tip of an insect's leg, twitches.\n\n               Janine reaches out to brush the thing off Tudor's lip. As \n               her fingers brush by, the leg twitches back inside Tudor's \n               mouth.\n\n               Janine jerks back in horror, her hands, balled into fists, \n               cover her own mouth as though to protect it from whatever \n               occupies Tudor's mouth.\n\n               Gradually the thread reappears. Tudor's lips part slightly \n               to allow the emergence of the dark, viscous tentacle to which \n               the thread -- a hook used to hang on inside the body -- is \n               attached. The tentacle of the blood parasite probes its way \n               from between Tudor's lips.\n\n               Janine is paralyzed with horror.\n\n               The tentacle is now touching Tudor's chin, his cheek, the \n               tip of his nose.\n\n               Janine's fists tighten even more. A glassy snap breaks the \n               silence. Janine lowers her hands dumbly and opens them. In \n               the right one, the one that held the contact lenses, are \n               incised two bloody circles where her fingers pressed the \n               lenses into her flesh until they snapped. The segmented lens \n               fragments glint in the tiny pools of blood.\n\n               She tries to control the hysteria welling up inside her. She \n               eases herself carefully over the side of the bed as the first \n               stubby tentacle is joined by another and another. She moves \n               a fraction of an inch at a time, almost hypnotized by the \n               movement of the tentacles.\n\n               The hooks of the tentacles are now set into Tudor's chin and \n               cheeks, and the tentacles draw taut as something attempts to \n               draw itself out of his body. His throat bulges, his cheeks \n               swell as the tentacles contract. His lips are gradually forced \n               apart as the quivering, moist shape emerges. His mouth is \n               opened to jaw-breaking width as the creature slowly exposes \n               itself to the dim light of the bedroom.\n\n               Janine's eyes are wide with terror. She utters a gurgling \n               cry and runs, stumbling, from the bedroom. She dashes through \n               the living room and reaches the door to the hallway, \n               whimpering in terror as she fumbles at the lock and the \n               doorknob, finally managing to swing the door open.\n\n<b>               INT. HALLWAY -- NIGHT\n</b>\n               Janine runs down a hallway that leads to Betts's apartment, \n               sobbing and stumbling. She gets to Betts's door and opens it \n               without hesitation.\n\n<b>               INT. BETTS' APARTMENT -- NIGHT\n</b>\n               Janine enters Betts' apartment. She looks around for Betts.\n\n<b>                                     JANINE\n</b>                         Betts? Betts? It's me.\n\n               She catches sight of Betts standing out on the balcony, \n               looking across at the North Tower's lights. Betts turns \n               slowly. She is wearing immaculate but very extreme make-up. \n               Janine is slightly taken aback -- it's not Betts' style.\n\n               Betts smiles and opens her arms to Janine.\n\n<b>               INT. ROLLO'S LAB -- NIGHT\n</b>\n               Rollo puts his jacket on, picks up his doctor's bag and a \n               manila envelope jammed solid with Hobbes's notes, and leaves \n               his lab, turning off the lights and locking the door behind \n               him.\n\n<b>               EXT. STREET IN FRONT OF ROLLO'S LAB -- NIGHT\n</b>\n               Rollo gets into his car, which is parked in a now empty \n               parking lot adjacent to the building in which his lab is \n               situated. His car is large and American and ostentatious, a \n               gold Cadillac Eldorado with options or equivalent.\n\n               The car pulls out of the lot and on to the street.\n\n<b>               INT. HALLWAY -- NIGHT\n</b>\n               The doorman, drooling and twitching, locks the exit doors at \n               the end of one hallway. In one hand he holds an enormous \n               pair of cable cutters.\n\n<b>               INT. INCINERATOR ROOM -- NIGHT\n</b>\n               St. Luc continues to poke around inside the incinerator with \n               the poker. Finally his flashlight beam reveals the tattered \n               corpse of Spergazzi's parasite.\n\n               Deftly manipulating the hook on the poker's tip, St. Luc \n               manages to pull the parasite out into the light. Garbage \n               comes rattling down the chute. When St. Luc flashes his light \n               into the oven, we see that the garbage consists of Betts' \n               French food, half-eaten, silver servers and all, the snails \n               being especially prominent. Insane giggles echo down the \n               chute, followed by the slam of the chute door somewhere \n               several floors above.\n\n               St. Luc holds the thing up to the naked light bulb above the \n               incinerator. The light seems to go right through the parasite, \n               illuminating the twisted vascular system, reproductive organs, \n               etc.\n\n               As St. Luc examines the creature, which is still impaled on \n               the hook of the poker, the door to the incinerator room opens \n               behind him. A large, hairy, muscular man enters the room and \n               approaches the oblivious St. Luc.\n\n               The man slips his arms up under St. Luc's arms and kisses \n               him passionately on the neck. As soon as St. Luc realizes \n               what's happening, he smashes the man in the chest with his \n               elbow and pulls free.\n\n               The man grabs St. Luc again, trying to kiss him on the mouth. \n               They struggle. St. Luc is thrown to the concrete floor. The \n               man tries to pin him down. St. Luc, on the verge of being \n               overpowered, smashes the man in the chest with the poker, \n               parasite still hooked into its tip.\n\n               The man stands up unsteadily. St. Luc cracks him on the ankle \n               with the poker and he comes crashing down. The parasite corpse \n               is flung across the room, where it smacks wetly into the \n               wall and slides to the floor.\n\n               St. Luc leaps to his feet and begins kicking the man in the \n               head. After a furious moment or two, he suddenly stops, drops \n               the poker, and stares at the body in horrified disbelief.\n\n               St. Luc slowly backs away from the man's body, which is very \n               still and quietly oozes blood on to the damp concrete floor. \n               He bumps into the edge of the door left open by the man. The \n               collision seems to startle him out of his daze somewhat, and \n               he turns, himself scratched and bleeding, and staggers up \n               the basement steps.\n\n<b>               INT. SPERGAZZI'S APARTMENT -- NIGHT\n</b>\n               Forsythe waits impatiently for St. Luc. Mr. Spergazzi is \n               watching a variety show on TV and Mrs. Spergazzi is making \n               ravioli in the kitchen, more or less recovered from her \n               encounter with the parasite.\n\n               Suddenly a piercing scream is heard from down the hall. Mr. \n               Spergazzi, hard of hearing, doesn't notice. The scream is \n               followed by bangs, crashes, and insane laughter and giggling.\n\n               Mrs. Spergazzi comes out of the kitchen. She has heard the \n               noises. She and Forsythe look at each other for a moment, \n               then Forsythe goes to the door and slides the chain lock \n               into place. She then goes to the telephone to call the police.\n\n<b>                                     FORSYTHE\n</b>                              (into receiver)\n                         Hello? Hello?\n\n               She dials a few times, and clicks the receiver button. \n               Nothing. The phone is dead. She puts the receiver back on \n               the hook. Mrs. Spergazzi knows that something is very wrong. \n               She wrings her hands and begins to wail in Italian.\n\n<b>               INT. HALLWAY -- NIGHT\n</b>\n               In the hallway outside the Spergazzi apartment, a group of \n               giggling, drooling residents stand around a door.\n\n               One of these residents is the superintendent, who is opening \n               the door with one of his set of master keys. The residents, \n               some of them women, giggle in anticipation. Once the door \n               has been opened, they all rush in, drooling and moaning.\n\n               From inside the apartment we hear several muffled voices, at \n               first angry and indignant, then pleading and terrified. \n               Screams and crashes follow.\n\n<b>               INT. SPERGAZZI APARTMENT -- NIGHT\n</b>\n               Mrs. Spergazzi is getting hysterical; Mr. Spergazzi is trying \n               to calm her down by getting her to sit in front of the TV \n               set with him. But each time he pushes her down, she pops up \n               and begins wailing and moaning again.\n\n               Forsythe paces back and forth, checks her watch, paces some \n               more. Finally, after a particularly noisy outburst by Mrs. \n               Spergazzi, Forsythe picks up the doctor's bag, unchains the \n               door, and leaves.\n\n               Spergazzi hears the door slam and looks up.\n\n<b>                                     MR. SPERGAZZI\n</b>                         Miss! Nurse! Come back! Cabiria, she \n                         needs something...!\n\n               He lapses back into Italian, trying vainly to calm his wife \n               down.\n\n<b>               INT. BETTS' APARTMENT -- NIGHT\n</b>\n               Betts and Janine are on the sofa, Janine with her head in \n               Betts's lap, Betts rocking Janine like a child.\n\n<b>                                     JANINE\n</b>                              (sobbing)\n                         Oh, Betts, Betts, everything is so \n                         hideous. Everything dies and rots \n                         and disappears. I'm going to die, \n                         and you're going to die, and Nick...\n\n               She breaks down.\n\n               Betts is drowsy-eyed and smiling. She strokes Janine's hair.\n\n<b>                                     BETTS\n</b>                         There, there, there. It all gets \n                         sorted out in the genes and \n                         chromosomes. It's not for us to think \n                         about at all. It's not our problem \n                         at all, 'Nine. We're just here to \n                         exist and to have a good time. Exist \n                         and have a good time.\n                              (pause)\n                         Do I feel good, 'Nine? Do I feel \n                         good to you?\n\n               Janine's eyes are red and she still sobs a bit as she speaks, \n               but she is obviously feeling a bit soothed.\n\n<b>                                     JANINE\n</b>                         Oh, you feel very good, Betts. You \n                         have such a cosy body. I'm jealous, \n                         I'm so skinny.\n\n<b>                                     BETTS\n</b>                              (casually, as though \n                              it were the most \n                              ordinary request in \n                              the world)\n                         Make love to me, 'Nine? I want you \n                         to make love to me. Please, please \n                         make love to me.\n\n               Janine twists around and looks up at Betts. There is something \n               in Betts' tone -- quite apart from what she is saying -- \n               that disturbs her, something that reminds her of her husband.\n\n<b>                                     JANINE\n</b>                         Betts! You can't really be saying \n                         that! You just can't!\n\n               Betts smiles drowsily. She bends over Janine, turning her \n               head in her hands until they face each other. Betts lowers \n               her face toward Janine. Janine is wide-eyed, almost hypnotized \n               by Betts's strength, smile, and confidence.\n\n<b>                                     BETTS\n</b>                         Let's not talk any more, 'Nine, shall \n                         we? Let's kiss and make up. Let's \n                         kiss... kiss and make up, shall we? \n                         'Nine?\n\n               Janine resists only slightly as Betts places her lips on \n               Janine's. After a pause, Betts suddenly opens her mouth wide \n               and presses her lips savagely against Janine's.\n\n               She holds Janine's head firmly as they kiss. Janine struggles \n               for a moment, then opens her mouth as well.\n\n               Her eyes are closed in passion, then suddenly open wide in \n               terror as Betts's throat swells like a goiter as a parasite \n               rushes up her throat toward Janine's open mouth. The parasite \n               begins to force its way into Janine's mouth and down her \n               throat. Janine gags and tries to pull away, but too late.\n\n<b>               INT. INCINERATOR ROOM -- NIGHT\n</b>\n               Forsythe runs down the steps which lead to the incinerator \n               and pulls open the steel door at the bottom. She begins to \n               look around for St. Luc.\n\n<b>                                     FORSYTHE\n</b>                         Roger? Roger, are you here?\n\n               She suddenly stumbles across the body of the man St. Luc has \n               killed. She actually has to break her fall with her hands, \n               which slip in the man's blood. Horrified, she gets up and \n               backs away.\n\n               The sounds of people moaning and laughing are coming from \n               everywhere. Forsythe finds herself up against a large door. \n               She tugs on the handle and it opens.\n\n<b>               INT. MAIN DOORS -- NIGHT\n</b>\n               St. Luc has made his way to the main doors and stands talking \n               to the rental agent, Merrick, who is leaning against the \n               intercom board with the doorman's pocketbook romance in one \n               hand.\n\n               The agent looks perfectly normal, though he keeps wiping his \n               mouth unobtrusively with the back of his hand.\n\n<b>                                     MERRICK\n</b>                         ...haven't seen anything that looks \n                         like trouble at all. Just filling in \n                         for Walter... the doorman. But if \n                         you want me to call the police, I \n                         will.\n\n               St. Luc is cautious but he seems to believe Merrick. He \n               presses the button which buzzes the Spergazzi apartment. \n               Nobody answers. A middle-aged man walks in. Worried, St. Luc \n               buzzes again.\n\n<b>                                     MAN\n</b>                         Apartment 307? Visiting my sister.\n\n               Merrick smiles and opens the door for the man, who goes in \n               and takes the stairway up, preferring to walk.\n\n               The intercom squawks and Spergazzi answers the buzzer.\n\n<b>                                     MR. SPERGAZZI\n</b>                         Yes? Who is there?\n\n<b>                                     ST. LUC\n</b>                         It's Dr. St. Luc, Mr Spergazzi. Let \n                         me speak to the nurse, please.\n\n<b>                                     MR. SPERGAZZI (V.O.)\n</b>                         Oh, but the nurse, she went away. I \n                         think she must go to look for you.\n\n               St. Luc curses under his breath and makes a move toward the \n               door. Merrick smiles and pulls it open for him. St. Luc \n               disappears down the stairs leading to the incinerator.\n\n               As the stairway doors close, the elevators slide open and a \n               young couple come out heading for the main doors, dressed to \n               go out to a late party.\n\n               Before they reach the doors, Merrick slips through them and \n               meets the couple in the lobby. He smiles broadly as he \n               approaches them.\n\n<b>                                     MERRICK\n</b>                         Evening, Mr. Wolf, Miss Lewis. I \n                         wonder if I could talk to you for a \n                         second in my office?\n\n<b>                                     MISS LEWIS\n</b>                         Why don't you do something about all \n                         that noise? We like parties, but \n                         this is ridiculous.\n\n<b>                                     MERRICK\n</b>                         Well, there may be a connection. \n                         See, it's about your locker. 'Fraid \n                         somebody busted into it tonight.\n\n<b>                                     MISS LEWIS AND MR WOLF\n</b>                              (together)\n                         Oh, no! What a drag!\n\n<b>                                     MERRICK\n</b>                         'Fraid so. I've got a few of the \n                         things they threw around in my office \n                         and if you could identify it...\n\n               The couple turn, grumbling, and walk toward Merrick's office. \n               Merrick follows, wiping his mouth with the back of his hand.\n\n<b>               INT. RENTAL OFFICE -- NIGHT\n</b>\n               The young couple enter the rental office, Merrick following \n               close behind. Once they are all in, Merrick closes the door. \n               He rests against the door and drools copiously, then giggles.\n\n               The young couple turn to look at him. Suddenly, three more \n               residents, two women and a man, all of them half naked, jump \n               down on them from the tops of large filing cabinets. The \n               residents begin to kiss and paw the couple. Merrick wipes \n               his mouth with the back of his hand and then throws himself \n               on top of the writhing mass.\n\n<b>               INT. GARAGE -- NIGHT\n</b>\n               Finding herself in the underground garage, Forsythe decides \n               to get in her car and drive out. She finds her car -- a Datsun \n               or Toyota -- gets in, throws the doctor's bag in the back, \n               and drives up the ramp leading to the sliding garage doors.\n\n               The car rolls over the cable which normally activates the \n               doors, but nothing happens. Forsythe puts the car in reverse \n               and backs over the cable, but still nothing happens. She \n               sits with the car idling, trying to figure out what to do \n               next.\n\n               Suddenly the driver's door of her car is yanked open and the \n               doorman, slavering and drooling, throws himself at her.\n\n               The doorman forces her down across the front seats of the \n               car and begins to kiss her on the neck and rip her clothes \n               to shreds. He gradually forces himself between her legs.\n\n<b>               INT. INCINERATOR ROOM -- NIGHT\n</b>\n               St. Luc bounds down the incinerator room stairs looking for \n               Forsythe. He sees immediately that she is not there, but \n               also notices handprints in blood on the door leading to the \n               garage.\n\n               He opens the garage door. Forsythe's screams come echoing \n               through the garage.\n\n<b>               INT. GARAGE -- NIGHT\n</b>\n               St. Luc races through the garage, trying to find Forsythe. \n               He finally sees her car in the middle of the exit ramp and \n               runs over to it.\n\n               The doorman is still on top of Forsythe in the front seat of \n               the car. St. Luc pulls the doorman's gun out of its holster \n               and begins smashing away at the doorman with it.\n\n               The doorman pounds St. Luc in the temple with his fist and \n               lifts himself partially off Forsythe, half turning toward \n               St. Luc, who is staggered by the blow.\n\n               The doorman's face is covered with blood and drool. Repulsed \n               and terrified, St. Luc fires the gun into the doorman's upper \n               body three times, heedless of the possibility that he might \n               hit Forsythe. The doorman slumps over Forsythe.\n\n               St. Luc grips the gun and staggers over to the car. He pulls \n               the doorman off Forsythe, who is completely soaked with blood. \n               She has obviously had an externally rough time, but there is \n               nothing to suggest that she has been infected by the doorman.\n\n               St. Luc shoves her over into the passenger's seat, where she \n               slumps, dazed. He doesn't have to start the car -- it's never \n               been turned off. He slams the shift lever into reverse and \n               backs up, peeling rubber, to the base of the ramp. He puts \n               it into first and begins to accelerate, foot to the floor, \n               toward the garage door.\n\n               Another car full of residents suddenly careens in front of \n               the door and screeches to a halt, blocking St. Luc, who in \n               swerving to avoid them smashes his fender into a concrete \n               post. He picks up the gun from the console between the seats \n               and, opening the car door, empties the gun at the residents, \n               who are emerging from their car.\n\n               One of the residents falls back into the car, blocking the \n               other two.\n\n               St. Luc drags Forsythe out of the car, throws her over his \n               shoulder, and carries her down the ramp toward the door \n               leading to the incinerator.\n\n<b>               INT. HALLWAYS -- NIGHT\n</b>\n               St. Luc half drags, half carries Forsythe along hallways \n               whose doors are wide open. From the apartments issues the \n               entire catalogue of suggestive sexual sounds -- giggles, \n               moans, groans, cries, whispers, shrieks.\n\n               We catch glimpses of people of all kinds and ages locked \n               together on floors, chairs, etc. St. Luc finds an open exit \n               door and plunges through it, taking Forsythe with him.\n\n<b>               INT. GYM -- NIGHT\n</b>\n               The door to the gym opens and St. Luc looks in cautiously. \n               The gym is quite tiny and is deserted. St. Luc pulls Forsythe \n               in and closes the door. He lays Forsythe down on a gym mat \n               and then barricades the door with a box horse and a weight-\n               lifting table.\n\n               He kneels beside Forsythe, who seems to be only just regaining \n               consciousness. St. Luc strokes her face, pushes strands of \n               hair matted with blood out of her eyes.\n\n<b>                                     ST. LUC\n</b>                              (more to himself than \n                              Forsythe)\n                         Rollo'll be here soon. Rollo'll be \n                         here soon.\n\n<b>               EXT. DRIVEWAY -- NIGHT\n</b>\n               Rollo's car pulls up to the main doors and parks in a \n               blatantly illegal space. He flips up a card on the dash which \n               says 'M.D. ON CALL,' then gets out of the car.\n\n               He walks up the steps and through the main doors, which are \n               wide open. Nobody is in sight.\n\n<b>               INT. HALLWAY -- NIGHT\n</b>\n               Rollo walks along the hallway, bag in hand, envelope under \n               arm. He stops in front of Tudor's door, checks the number \n               against the number written in his notebook, then knocks on \n               the door.\n\n               Nobody answers. He knocks once more, then looks around \n               shiftily before turning the knob and walking right in.\n\n<b>               INT. TUDOR'S APARTMENT -- NIGHT\n</b>\n               Rollo enters and closes the door behind him, deliberately \n               slamming it. He walks into the center of the living room and \n               bellows.\n\n<b>                                     ROLLO\n</b>                         Hello, good evening, is anybody here? \n                         Dr. St. Luc? It's Dr. Linsky here to \n                         see you for consultation.\n\n               Still no answer. Rollo is puzzled. He snoops around the \n               apartment until he finds the bedroom with its door half \n               closed. He pushes gently on the door and opens it gradually.\n\n<b>                                     ROLLO\n</b>                         It's Dr. Linsky. Anybody home?\n\n               Rollo can now see the figure of Tudor lying in bed in the \n               dim light of the bedroom. Rollo enters the bedroom.\n\n<b>                                     ROLLO\n</b>                         Is that Mr. Nicholas Tudor? It's Dr. \n                         Linsky. I'm meeting Dr. St. Luc here. \n                         He must be a little bit late.\n\n               Tudor does not answer, does not move. He lies stiffly on the \n               bed on his back, mouth insanely agape, eyes shut, covers \n               half on the floor.\n\n<b>                                     ROLLO\n</b>                         Is anyone here? Nicholas Tudor? Is \n                         that you? Tudor? Mind if I have a \n                         look at you?\n\n               He stands at the edge of the bed, peering at Tudor, looking \n               for signs of consciousness. After a pause, he kneels on the \n               bed and slowly draws back the covers.\n\n<b>                                     ROLLO\n</b>                         Just a peek, OK? A little peek won't \n                         hurt.\n\n               Tudor's abdomen is gradually exposed as the covers are drawn \n               back. Crouched in the shadows is one of the freshly emerged \n               blood parasites, which sits poised for only a fraction of a \n               second before it springs at Rollo's face with great energy.\n\n               As the thing hits Rollo's face it locks on to his head by \n               entangling its stubby tentacles in his hair and attaching \n               its suckers to his cheeks and chin.\n\n               Rollo tries to stand, then staggers and falls. The thing \n               tries to force its way into Rollo's mouth, cutting his lips \n               in the process. They bleed furiously. When Rollo manages to \n               pull a sucker away, a piece of his flesh comes with it.\n\n               As he writhes on the carpeted floor, two more parasites appear \n               crawling toward him from under the bed, covered with dust \n               from the floor. They clamber on to him and fasten on to his \n               face, suckering on to his ears, his throat, forehead, eyelids. \n               One of them begins to ooze corrosive fluid on to his face. \n               Rollo screams in pain.\n\n               He manages to roll to his feet. He staggers out of the \n               darkness of the bedroom into the living room, one arm \n               extended, groping like a blind man, the three parasites still \n               locked on to his face. They try to pull his lips apart, but \n               he keeps his teeth firmly clenched to keep them from forcing \n               their way into the depths of his body.\n\n               He takes a few unbalanced steps toward the kitchen. With a \n               sudden spasm of pain, he hurls himself sideways into the \n               kitchen and almost falls again, grabbing at the last moment \n               on to the sink.\n\n               His hands touch a large pair of pliers, a screwdriver, and a \n               hammer on the counter by the sink, left there by Tudor weeks \n               ago. Rollo seizes the pliers and begins to pull the parasites \n               from his face with their steel jaws. The parasites, swollen \n               with Tudor's blood, burst and spurt as the pliers tear them \n               apart.\n\n               In the bedroom, Tudor's eyes snap open. His head rises from \n               the pillow.\n\n               He swings his legs over the side of the bed and, ashen and \n               gaunt, shakes his head slowly as though waking from a dream. \n               He begins to mumble.\n\n<b>                                     TUDOR\n</b>                         No, no, no, no. Mustn't, mustn't. \n                         You mustn't kill them, no, no, no.\n\n               Then, as though listening to himself and suddenly \n               understanding what he is saying, he rises to his feet shakily \n               and walks to the kitchen. He stops at the kitchen door.\n\n               Rollo has torn the parasites from his face and is pounding \n               away at them in the kitchen sink. The parasites wriggle and \n               curl in their own blood in the sink as he smashes away at \n               them with the pliers.\n\n               Tudor staggers toward Rollo.\n\n<b>                                     TUDOR\n</b>                         No, no. You mustn't kill them. That's \n                         my blood you're spilling! My blood! \n                         Let them come home, let them come \n                         home, home, home inside me. Don't \n                         kill them...!\n\n               He starts to paw Rollo, feebly trying to prevent him from \n               further mutilating the parasites. He reaches over St. Luc's \n               shoulder and grabs a large chunk of one of the parasites.\n\n<b>                                     TUDOR\n</b>                              (whining pitifully)\n                         At least save me one! For God's sake! \n                         At least save me one. One, one, one, \n                         one...\n\n               Rollo turns as Tudor begins to shove the piece of flesh back \n               down his throat.\n\n               As Rollo turns we see that bits of tentacles and suckers are \n               still attached to his cheeks, throat, forehead. His face is \n               melting and smoking in areas where it has been burned by the \n               corrosive fluid on one side. He stares in rage at Tudor.\n\n               With a scream, Rollo strikes Tudor with the pliers. Tudor \n               falls, hitting his head on various chairs and protruding \n               corners as he goes down, the chunk of parasite still in his \n               mouth as he finally comes to rest, twitching, on the floor. \n               Rollo drops the pliers on the floor.\n\n               He stares at Tudor in shock. His face is reflected in a copper \n               frying pan hanging over the stove. Noticing the reflection, \n               Rollo leans over to get close to his own horrible image. He \n               gingerly touches his face, inspecting the damage, shivering \n               and moaning.\n\n               Still shaking, he turns to leave.\n\n               Without warning, Tudor leaps up at Rollo with insane energy \n               and bowls him over, pliers in hand. Sitting on Rollo's chest, \n               Tudor smashes away at Rollo's face and head with the pliers, \n               the piece of dead parasite in his mouth dropping on to Rollo's \n               face as he drools.\n\n<b>               INT. GYM -- NIGHT\n</b>\n               Forsythe finally opens her eyes. She smiles at St. Luc, who \n               hovers anxiously over her as she lies on the gym mat.\n\n<b>                                     ST. LUC\n</b>                         Can you walk? I couldn't find anything \n                         wrong with you.\n\n               Forsythe nods and manages to sit up with St. Luc's help. \n               Once she seems able to stay propped up without St. Luc's \n               help, he gets up and begins to move the barricade away from \n               the door.\n\n<b>                                     ST. LUC\n</b>                         Rollo and the police should be here \n                         by now. It's just a question of \n                         avoiding infected residents until we \n                         find them.\n\n               St. Luc comes back to Forsythe and kneels beside her.\n\n<b>                                     ST.LUC\n</b>                         OK? Ready to go?\n\n               Forsythe puts her arm around St. Luc's neck as though wanting \n               support. Instead, she draws him down toward her and begins \n               to babble in a strange, casual, dreamy way.\n\n<b>                                     FORSYTHE\n</b>                         Sometimes I have a recurrent dream. \n                         Have I ever told you about it, \n                         darling? I guess you could call it a \n                         Freudian dream, because in this dream \n                         I find myself making love to Sigmund \n                         Freud. But I'm having trouble because \n                         he's old and dying, and he smells \n                         bad and I find him repulsive. And \n                         then he tells me that everything is \n                         erotic, everything is sexual, you \n                         know what I mean? He has a very thick \n                         accent, but I can understand him \n                         perfectly. He tells me that even old \n                         flesh is erotic flesh, that disease \n                         is the love of two alien kinds of \n                         creatures for each other, that dying \n                         is an act of eroticism, that even \n                         chemicals combine out of sexual frenzy \n                         and longing. That breathing is sexual, \n                         that talking is sexual, that just to \n                         physically exist is sexual... And I \n                         believe him, and we make love \n                         beautifully...\n\n               While she talks, Forsythe gradually slips her arms around \n               St. Luc's neck and brings her lips closer and closer to his.\n\n               St. Luc, mesmerized by the hypnotic drone of her words, is \n               about to kiss her. Suddenly her mouth snaps open wide with \n               mechanical precision, her head tilts back, her eyes flick \n               closed.\n\n               St. Luc stares at her in horror as her throat begins to swell.\n\n               In the depths of Forsythe's mouth two parasite tentacles \n               probe about, seeking a firm hold for their suckers so that \n               they can pull the parasite's body out of her narrow esophagus.\n\n               St. Luc hesitates only for an instant, then rips a strip \n               from her blouse, balls it up, and shoves it into her mouth. \n               Holding her while she struggles to remove it, he rips off a \n               second strip and ties it around her head to keep the gag in. \n               St. Luc rises, throws Forsythe over his shoulder and begins \n               to step toward the door of the gym.\n\n               Dangling over St. Luc's shoulder, Forsythe struggles, moans, \n               and howls as best she can. St. Luc manages to pin her hands \n               to her sides so that she can't pull the gag out.\n\n               Before St. Luc reaches the door, a handsome middle-aged woman \n               peeks in around the corner.\n\n<b>                                     WOMAN\n</b>                              (crooning in reply to \n                              Forsythe's howl)\n                         Hellooooo? Oooooo? Is there anyone \n                         here who's all alooooooooone?\n\n               St. Luc rushes at the woman, knocking her over. She rolls on \n               the floor, hugging herself and crooning.\n\n               Once out the door, St. Luc makes for the nearest exit.\n\n<b>               INT. STAIRWELL -- NIGHT\n</b>\n               As St. Luc begins to ascend the stairs, we can see tiny black \n               hooks tearing through Forsythe's gag. Blood begins to soak \n               through from the inside.\n\n               A group of residents suddenly appear at the next landing \n               above St. Luc and, noticing them, begin to walk down the \n               steps, moaning and crooning and making vaguely sexual gestures \n               toward the pair.\n\n               Blood is now pouring from Forsythe's mouth and tentacles are \n               groping for leverage at her cheeks and chin.\n\n               St. Luc decides to attempt to shoulder his way up the stairs, \n               certain that Rollo and the police must be at the main doors.\n\n               As he hits the residents on the stairs, they try to kiss \n               him, caress him, pull his clothes off. They finally manage \n               to drag Forsythe from his shoulders, almost unbalancing him \n               as they do so. St. Luc tries to prop her up on her feet, but \n               she's completely limp. St. Luc holds Forsythe against the \n               stairway wall as residents mill all about them. He looks at \n               her in sudden hopelessness.\n\n<b>                                     ST. LUC\n</b>                              (shouting)\n                         Forsythe! Forsythe!\n\n               The parasite is now half out of her mouth, hanging through \n               the slit it has torn in her gag.\n\n               St. Luc lets go of Forsythe and she sinks to the floor. The \n               residents are swarming all over them. St. Luc abandons \n               Forsythe and begins to fight his way up the stairs.\n\n               He runs higher and higher, up flight after flight of stairs, \n               until he is free of the slow-moving residents. He leans back \n               against a wall, panting.\n\n               Crooning and moaning echo up to him from below. He leans \n               over the railing and looks down.\n\n               In the stairwell several flights below, Forsythe lies \n               surrounded by milling residents, legs spread as though about \n               to give birth. A resident leans over and pulls the parasite \n               from her mouth, then swallows it whole with gusto. Other \n               residents touch her, stroke her, caress her, as though \n               offering her a strange kind of comfort.\n\n               St. Luc reels with disgust and disbelief. He turns and runs.\n\n<b>               INT. SWIMMING POOL -- NIGHT\n</b>\n               Between the two towers lies the swimming pool. St. Luc manages \n               to reach the door leading from the South Tower into the pool. \n               He hangs on to the door of the pool itself for a moment in \n               near exhaustion, then opens it and enters.\n\n               The pool is dim and tranquil. Two women are swimming in the \n               deep end as though nothing were at all abnormal.\n\n               St. Luc watches them for a moment, enjoying the apparent \n               normalcy of the scene. Then he staggers forward, calling out \n               to the swimmers.\n\n<b>                                     ST. LUC\n</b>                         Have you seen the police? I'm Dr. \n                         St. Luc. Have you seen the police? \n                         Have they come?\n\n               The swimmers both flick playfully beneath the water's surface. \n               St. Luc approaches the water's edge, waiting for them to \n               surface. The water ripples and bubbles near his feet. A \n               sinking feeling comes over him. He watches in horrible \n               fascination. He begins to shiver.\n\n               The ripples and bubbles spread and intensify. After a pause, \n               Janine surfaces, smiling radiantly. A few seconds later, \n               Betts surfaces near her, the very picture of benign, watery \n               calm. Betts gestures to St. Luc to join them in the pool.\n\n               St. Luc shakes his head slowly, backing away from the pool.\n\n               He turns to leave the room. As he turns, Mr. Spergazzi appears \n               out of the shadows behind him. Using his four-pronged aluminum \n               cane, he pushes St. Luc backwards into the pool, chuckling \n               playfully.\n\n               Spergazzi looks around for approval as St. Luc begins to \n               thrash about wildly.\n\n               Betts swims up beside St. Luc, grabs him, and holds him under.\n\n<b>                                     BETTS\n</b>                              (to Janine)\n                         A kiss!\n                              (laughter echoes in \n                              the pool room)\n                         Give him a kiss. Give him a kiss.\n\n<b>                                     VARIOUS RESIDENTS\n</b>                              (voices echoing in \n                              unison)\n                         A kiss, a kiss, a kiss!\n\n               Betts allows St. Luc to rise to the surface as a laughing \n               Janine splashes over to him and fastens her mouth to his.\n\n               As they kiss, Janine's hands hold St. Luc's head fiercely. \n               Betts assists her by pinning St. Luc's arms behind him. \n               Janine's throat ripples and swells, her cheeks billow as a \n               parasite swarms upwards from deep within her body. St. Luc's \n               cheeks now swell as the parasite enters his mouth. His eyes \n               jolt open in terror and he manages to pull away slightly, \n               revealing the tentacles joining her mouth to his like \n               grappling irons.\n\n               St. Luc twists out of Betts' grasp. He and Janine, still \n               locked together, sink beneath the surface.\n\n               Dozens of residents pour into the pool room and join Spergazzi \n               and the others at the poolside. Among these are faces already \n               familiar to us: Kurt, Kresimir and Benda, the old laundry-\n               room woman, etc.\n\n               The new spectators clap, laugh, croon, and moan as though \n               witnessing a wild group baptism. Some of them throw themselves \n               into the water, pulling others in with them.\n\n               Deep under the water's surface, St. Luc still struggles to \n               free himself from Janine. Residents now splash into the depths \n               all around them.\n\n               St. Luc's cheeks bulge wide and blood dribbles from his nose \n               and mouth. His throat swells monstrously. Janine releases \n               him just in time for us to see the end of a tentacle slip \n               back into his mouth. He exhales heavily as parasite enzymes \n               pump furiously through his body. The water boils with his \n               exhaled breath.\n\n               Janine and St. Luc drift apart, now completely calm, as \n               residents splash and swim, kick and embrace.\n\n<b>               INT. STARLINER TOWERS UNDERGROUND GARAGE -- NIGHT\n</b>\n               The vast and dimly lit garage is full of silent cars. \n               Somewhere an engine starts up, then another and another, \n               until the whole garage is full of fumes and the revving of \n               engines.\n\n               As we prowl amongst the cars we find many of the residents \n               we already know, now dressed to the teeth in their seductive \n               best.\n\n               Mr. Spergazzi and his wife stand and watch the spectacle, \n               canes in hand, with great dignity. With them stand others \n               who are too old or too young to go into the night looking \n               for new hosts for their parasites, content to remain \n               incubators for the time being.\n\n               The residents are full of bubbly anticipation in their cars. \n               Kresimir leans out of his car and shouts to no one in \n               particular.\n\n<b>                                     KRESIMIR\n</b>                              (shouting)\n                         Nobody should be alone! Nobody should \n                         be alone tonight!\n\n               The rest of the residents pick up the cry and chant together.\n\n<b>                                     RESIDENTS\n</b>                              (together)\n                         Nobody alone! Nobody alone!\n\n               The night watchman stands near the garage doors. Smiling \n               broadly, he stamps on the cable which activates the sliding \n               doors.\n\n<b>               EXT. STARLINER TOWERS -- NIGHT\n</b>\n               The garage doors slide open. One car surges up the ramp ahead \n               of all the others, stopping at the top.\n\n               The driver of this first car is St. Luc, sleek and exuberant, \n               a raised collar and a scarf hiding most of his scars. He \n               glances into his rear-view mirror.\n\n               In the rear-view mirror, St. Luc sees all the other cars \n               lining up behind him, lights blazing.\n\n               St. Luc smiles, then steps on the accelerator. His car shoots \n               out into the street.\n\n               As St. Luc's car turns on to the street, car after car follows \n               him. We rise higher and higher above the Starliner Towers \n               apartment complex until the cars are a small stream of lights \n               far below, bleeding into the main body of the neon-lit \n               metropolis.\n\n<b>                                         THE END\n</b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Shivers.jpg\"/>\n</td><td><h1>Shivers</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=David Cronenberg\" title=\"Scripts by David Cronenberg\">David Cronenberg</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Shivers Script.html#comments\" title=\"Shivers comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:16:22.724297"}