{"title": "Silver Bullet", "film_link": "/Movie Scripts/Silver Bullet Script.html", "script_link": "/scripts/Silver-Bullet.html", "info_raw": "\n\nSilver Bullet Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Stephen King\nGenres  Horror\n\nRead \"Silver Bullet\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nSILVER BULLET by Stephen King Based on his story \"Cycle of the Werewolf\"\n\n\n\nFADE IN:\n\n\nEXT.  THE FULL MOON, CLOSE  NIGHT\n\nIt nearly fills the screen, swimming mysteriously in the\nwarm late summer air.\n\nSOUND: Crickets.\n\nTHE CAMERA PANS SLOWLY DOWN TO:\n\n\nEXT.  TRAIN TRACKS IN THE COUNTRY  NIGHT - AND MOONLIGHT\n\nCREDITS BEGIN.\n\nA rail-rider comes chugging along the tracks. Aboard is\nARNIE WESTRUM, a big man in a strappy T-shirt and chino\npants. He is drinking beer.\n\n\t\tARNIE (sings)\n\tMy beer is Rheingold the dry beer...\n\tThink of Rheingold whenever you buy beer...\n\nHe drains the rest of his own bottle of Rheingold and tosses\nit to one side. Up ahead we see a switching point.\n\nARNIE throws the rail-rider into neutral, opens the toolbox\non the back, and brings out a big five-cell flashlight. He\nshines it on the switch.\n\nHe gets a crowbar from the toolbox, plus a big wrench, a\npair of pliers, a hammer, and a pair of work gloves. He also\ngets another bottle of beer and sticks it into his back\npocket.\n\nARNIE jumps down and approaches the switch.\n\nCREDITS CONTINUE.\n\n\nEXT. ARNIE, AT THE SWITCHING POINT  NIGHT\n\nHe drops his tools, pulls on his work gloves, and trains the\nlight on the switch for a moment. During this:\n\n\t\tARNIE (sings)\n\tIt's not bitter, not sweet, it's a real\n\tfrosty treat, won't you try, won't you\n\tbuy Rheingold beer...\n\nHe tries the switch. No go. It's frozen.\n\n\t\tARNIE\n\tStuck tighter'n dogshit in a deep freeze!\n\nHe takes the bottle of beer from his back pocket and fishes\na churchkey from one of the front ones. He pops the cap and\ndrinks deeply. He burps. Then he screws the half-empty\nbottle of beer into the cinders so it won't fall over. Then\nhe picks up his crowbar.\n\nCREDITS CONTINUE.\n\n\nEXT.  THE RAIL-RIDER  NIGHT\n\nThere's a SOUND of bushes shaking. Something comes out -\nsomething huge. It leaps limberly onto the rail-rider. It is\na werewolf with greenish-yellow eyes. Tatters of clothes\nstill hang from it.\n\nWhat kind of monster, exactly? It is humanoid as well as\nwolfish... and when we learn who it is in its human form, we\nshould be able to spot the resemblance at once...and kick\nourselves for not knowing earlier.\n\nIt crouches there, huge and bushy and fanged and deadly, on\nthe whole rail-rider.\n\nCREDITS CONCLUDE.\n\n\nEXT.  ARNIE  NIGHT\n\nHe's working the crowbar into the junction point just as\nhard as he can. Swearing at it under his breath. Suddenly,\nboth the tracks and the switch move.\n\n\t\tARNIE\n\tHot damn! Now... a little oil...\n\nHe turns back toward the rail-rider.\n\n\nEXT.  ARNIE, ARRIVING AT THE RAIL-RIDER  NIGHT\n\n\t\tARNIE\n\tIt's not bitter, not sweet... it's\n\ta big fuckin' treat...\n\nA NOISE - bushes rattling; cinders clinking and rattling.\nARNIE looks around.\n\n\nEXT.  THE RAILS AND THE SWITCHING POINT, ARNIE'S POV  NIGHT\n\nNothing there. His bottle of beer stands by the litter of\nhis tools.\n\n\nEXT.  ARNIE, AT THE RAIL-RIDER  NIGHT\n\nHe's rooting around in the toolbox, back to the switching\npoint.\n\n\nEXT.  ARNIE'S BOTTLE OF BEER, CU  NIGHT\n\nA hairy hand/paw closes around it - we see huge curved claws\non that hand.\n\n\nEXT.  THE WEREWOLF'S FACE, CU  NIGHT\n\nGlaring green-yellow eyes; a savage, beastial face which is\nstill half human. That's all we see. The rest is in shadow.\nIt opens its mouth and upends the bottle of beer. Foamy\nRheingold begins gurgling down the werewolf's throat.\n\n\nEXT.  ARNIE AT THE RAIL-RIDER  NIGHT\n\nHe comes up with an old-fashioned oilcan, the kind with the\nlong spout. He starts back to the switching point, waving\nthe can.\n\n\t\tARNIE (sings)\n\tMy beer is Rheingold the dry beer...\n\tThink of Rheingold whenever you fry beer...\n\nHe arrives, looks down... and stops singing. His eyes widen.\n\n\nEXT.  THE CINDERS BY THE TRACK, ARNIE'S POV  NIGHT\n\nWe can see the hole where ARNIE put his beer, but it is of\ncourse empty. Beside it are two huge prints in the cinders,\nhalf wolf, half human.\n\n\nEXT.  ARNIE  NIGHT\n\nHe's beginning to be afraid. Beginning to look around to see\nwhat might be out here with him. Beginning to realize he is\nin extremely deep shit.\n\nSOUND: A SHATTERING, SNARLING ROAR\n\n\nEXT.  THE WEREWOLF  NIGHT\n\nIt rises up on its hind legs, eyes glaring an ugly yellow\ngreen. Its snout wrinkles back, revealing those teeth.\n\n\nEXT.  ARNIE  NIGHT\n\nHe's craning back to look at the thing, his face a grue of\nhorror.\n\n\t\tARNIE\n\tOh n-\n\nA huge clawed hand/paw comes sweeping down. ARNIE's head is\ngranted an immediate Reno-style divorce from the rest of his\nbody.\n\n\nEXT.  THE RAIL-RIDER  NIGHT\n\nSOUND of the beast approaching. A hairy arm and taloned hand\nreaches into the toolbox bolted to the back and rummages.\nThe hand is dripping blood.\n\nIt comes up with a bottle of Rheingold.\n\nThe WEREWOLF begins to sing. It is a bizarre funny-horrible\ngrunting, the words hellishly recognizable.\n\n\t\tWEREWOLF (gutteral; subhuman)\n\tMy beer is Rheingold the dry beer...\n\nNo bottle opener for this thing; it brings the neck of the\nbottle down sharply on the edge of the toolbox. Beer foams\nout.\n\n\nEXT.  THE WEREWOLF'S FACE, IN DEEP SHADOW  NIGHT\n\nHe/It rams the jagged neck of the bottle deep into its mouth\nand drinks. Foam drizzles down its pelt. It's grinning.\n\n\t\tWEREWOLF (snarling voice)\n\tThink of Rheingold whenever you buy beer...\n\n\nEXT.  THE WEREWOLF, CU  NIGHT\n\nThe bottle is empty. There are CRUNCHING SOUNDS as it begins\nto eat the bottle.\n\nBlood begins to run out of its mouth; its face wrinkles in\npain and fury. It spits out broken, bloody jags of glass.\n\nLooks up. It HOWLS.\n\n\nEXT.  TARKER'S MILLS  NIGHT - MOONLIGHT\n\nWe're looking at Main Street of a small country town - might\nbe New England, might be mid-South. Might be 1984, might be\n1981. This is Tarker's Mills, and in places like this, time\nmoves more slowly. Cars - not too many - move back and\nforth. No one is in a hurry.\n\nWe see the Methodist church (and the parsonage next door);\nAndy's Sporting Goods; Owen's Pub, with its Narragansett\nneon sign. We see a barber shop with a striped pole; we see\nthe Holy Family Catholic Church and the rectory next door.\nWe see the Gem Theater, which is showing a revival of Sophia\nLoren in \"Two Women.\"\nIt's Our Town, U.S.A.\n\n\t\tJANE (voice-over)\n\tThis place is Tarker's Mills, where I\n\tgrew up... and this is how it was when I\n\twas fourteen - a place where people cared\n\tabout each other as much as they cared\n\tabout themselves. This is how my town\n\tlooked as, all unknowing, it approached the\n\trim of the nightmare. The killing had begun.\n\nSOUND: The HOWL of the WEREWOLF - distant, a bit dreamy.\n\n\nEXT./INT.  TARKER'S MILLS MONTAGE  NIGHT\n\na.) VIRGIL CUTTS, owner of Virgil's Texaco, is filling up a\ncar. We hear the HOWl... and VIRGIL looks up uneasily.\nb.) In the barber shop, BILLY McCLAREN, the barber, is just\ntaking the apron off the Methodist minister, REV. O'BANION.\nThey both look around.\nc.) Folks are coming out of the Gem Theater. They pause at\nthe sound of that HOWL and look toward the edge of town.\n\n\nEXT.  THE SETTING MOON, CU  NIGHT\n\nAs JANE speaks, we see the moon sink below the horizon.\n\n\t\tJANE (v-o)\n\tThe killing had begun, but at first no\n\tone knew it. Arnie Westrum was a chronic\n\tdrunk, and what happened seemed like an\n\taccident.\n\n\nEXT.  THE RAIL-RIDER AND ARNIE'S HEADLESS BODY  NIGHT\n\nSlowly the view improves, grows lighter, as we TIME-LAPSE TO\nDAWN.\n\nSOUND: A train is approaching. We hear its horn.\n\nCAMERA MOVES IN. Here is a shattered Rheingold bottle. There\nis a litter of ARNIE'S tools. And here, on the cheek of\nARNIE'S severed head, a few ants are checking things out.\n\nSOUND: The train's horn, MUCH CLOSER.\n\n\t\tJANE (v-o)\n\tThe county coroner concluded that Arnie\n\tpassed out on the tracks. There wasn't\n\tenough evidence to conclude anything else.\n\nAnd suddenly the train comes smashing into the frame, horn\nblaring. The rail-rider goes flying. ARNIE'S body disappears\nunderneath. We see something flopping and moving under\nthere. It could be a bundle of rags. Could be... but isn't.\n\n\n\t\t\t\tDISSOLVE TO:\n\n\nEXT.  TARKER'S MILLS TOWN COMMON  DAY\n\nThe common is more or less in the center of town, either\nsurrounded by Main Street commerce or backed by it. THE\nCAMERA MOVES SLOWLY IN on a big tent that's been erected on\nthe Common - looks like a revival meeting tent, almost, but\nthe banner draped over the entrance reads: SUPPORT THE\nTARKER'S MILLS MEDCU DRIVE!\n\nBehind or to the side, on the grass, picnic tables have been\nset out end-to-end. Women are putting salads and home-baked\nbreads on these - just about the whole town is going to sit\ndown to a meal when the meeting's over. Further off, men are\ntending barbecues, roasting corn, etc.\n\n\t\tJOE HALLER (amplified voice)\n\tI'd like to give you Father Lester Lowe,\n\tof Holy Family Catholic Church!\n\nEnthusiastic applause greets this.\n\n\nINT.  THE CROWD  DAY\n\nMost of the town is here, seated on folding chairs. We're\nlooking particularly at three people - NAN COSLAW, her\nhusband BOB, and their fourteen-year-old daughter, JANE. It\nis JANE - a slightly older JANE - who we have heard\nspeaking. She is now a bit bored with the meeting, which has\nbeen going on for some time. As the APPLAUSE CONTINUES, she\nleans toward her mother.\n\n\t\tJANE\n\tI'm going out for a while, 'kay?\n\n\t\tNAN\n\tAll right. Stay close. And make sure your\n\tbrother's all right.\n\nAs JANE gets up, the applause starts to fade a bit.\n\nNOTE: JANE is wearing a silver crucifix, and will continue\nto wear it through the whole movie.\n\n\nINT.  THE PODIUM  DAY\n\nTo one side is a big black-and-white photograph on an easel.\nIt shows a van which has been customized into an emergency\nmedical unit.\n\nBehind the podium are four chairs. REV. TOM O'BANION sits in\none of them. ANDY FAIRTON sits in another, red-faced and\nbeaming. JOE HALLER, the town constable, is just returning\nto his; LESTER LOWE is just approaching the mike as the\napplause dies. LOWE'S face shines with love and goodwill.\n\n\t\tLOWE\n\tFor the last ten years...\n\nNo amplification. He taps the mike.\n\n\nINT.  JANE\n\nShe is making her way down the row to the aisle (the people\nshould be seated in folding chairs). She passes a GIRL of\nabout her own age who has overheard NAN'S parting shot.\n\n\t\tGIRL (mocking)\n\t\"Make sure your brother's all right.\"\n\n\t\tJANE (low)\n\tMarty's a booger.\n\nShe reaches the aisle and starts out.\n\n\nINT.  THE PODIUM, FEATURING FATHER LOWE\n\nHe taps the mike again.\n\n\nINT.  THE CROWD, FEATURING BOB AND NAN COSLAW\n\n\t\tBOB (good-natured)\n\tJust pretend you're in your own church\n\taskin' for money, father! It'll work fine!\n\nGood-natured laughter greets this.\n\n\nINT.  LOWE AT THE PODIUM\n\nA bit flustered, he taps the mike and is rewarded by a BRIEF\nSCREAM OF FEEDBACK.\n\n\t\tLOWE\n\tFor the last ten years, I have had a\n\tdream. A dream of a time when modern\n\tmedical care would come to this small\n\tcommunity, which sometimes seems so far\n\tfrom Durham, with her lifesaving\n\thospitals. I hope that this meeting, at\n\twhich I see so many of my friends\n\tgathered, will be the start of making my\n\tdream come true.\n\nSOUND: Enthusiastic applause.\n\n\nEXT.  A SNAKE IN THE GRASS, CU\n\nIt's a blacksnake... harmless, but big. It goes wriggling\nthrough the grass toward a stream. In the b.g. - SOUND OF\nAPPLAUSE.\n\n\t\tMARTY (voice)\n\tHoly...! Brady, are you sure they're\n\tnot poisonous?\n\n\t\tBRADY (voice)\n\tLittle old blacksnake? Hell, no!\n\nHands - the rather grimy hands of a boy bent on mischief -\ngrab the blacksnake.\n\n\nEXT.  MARTY AND BRADY, CU\n\nBRADY holds the snake up. Both boys gaze at it with\nrespectful wonder.\n\nNOTE: MARTY is wearing a silver St. Cristopher's medallion,\nand will through the whole movie.\n\n\t\tMARTY\n\tLemme hold him!\n\nBRADY hands it over. As MARTY looks at the snake, BRADY\nsees:\n\n\nEXT.  JANE, COMING OUT OF THE TENT  DAY\n\n\t\tJANE (v-o)\n\tI was almost fifteen that summer. My\n\tbrother Marty was eleven. Marty and his\n\tfriend Brady Kincaid were the crosses I\n\thad to bear. Brady was actually the worse\n\tof the two, but I was rarely disposed to\n\tsee that. Not when my younger brother was\n\tso constantly thrown in my face by my\n\tparents.\n\n\t\tLOWE (v-o from the tent)\n\t$32,000 is a lot of money. But when you\n\tthink of the lives this unit might save, it\n\tseems very inexpensive indeed.\n\nApplause greets this.\n\n\nEXT.  MARTY AND BRADY\n\nAgain we are fairly tight on the boys - we see them from\nwaist or chest height. BRADY snatches back the snake.\n\n\t\tBRADY\n\tI got an idea.\n\n\t\tMARTY\n\tWhat?\n\nBRADY looks toward JANE. MARTY follows his gaze. His eyes\nwiden.\n\n\t\tMARTY\n\tYou wouldn't.\n\nBRADY grins. MARTY assesses the grin.\n\n\t\tMARTY\n\tYou would.\n\n\nINT.  THE PODIUM, WITH LOWE\n\n\t\tLOWE\n\tAn endeavor like this seems to me to be\n\tthe very definition of community - all\n\tof us pulling together as one, farmers\n\tand merchants... Protestants and Catholics...\n\n\nEXT.  JANE\n\nShe is walking slowly toward the picnic area, and is passing\nunder a tree. There's more applause from the tent.\n\n\t\tBRADY (teasing voice)\n\tJane... Jane...\n\nShe looks up. The blacksnake dangles down toward her, almost\ntouching her upturned face.\n\nJANE shrieks and bolts. She gets a little way, trips over\nher own feet and falls down hard. She's wearing what was a\nnice jumper and nylons. Now the jumper is torn and the hose\nshredded at the knees.\n\n\nEXT.  THE TREE, WITH BRADY\n\nHe's lying over a limb with the snake in his hand, laughing\nwildly.\n\n\nEXT.  JANE\n\nShe gets up, looks at her clothes, her bloody knees. She's\nnear tears.\n\n\nEXT.  MARTY, AT ONE SIDE OF THE TREE, FAIRLY TIGHT\n\nThe shot's from the chest up. He looks sorry he was a part\nof this little stunt, as he ought to be.\n\n\t\tMARTY\n\tIt was just a blacksnake, Jane-\n\n\nEXT.  JANE\n\nShe looks around at him in a fury of embarrassment and\nsomething very close to hate.\n\n\t\tJANE\n\tLook at my knees! Look at my dress!\n\tI hate you!\n\n\nEXT.  BRADY, UP IN THE TREE\n\n\t\tBRADY\n\tDid wittle Janie make wee-wee in her\n\tteddies?\n\n\nEXT.  MARTY\n\n\t\tMARTY\n\tStop it, Brady.\n\n\nEXT.  BRADY, UP IN THE TREE\n\nHe throws the snake.\n\n\nEXT.  JANE\n\nShe dodges the snake with a little scream. She's beginning\nto cry, but she flips BRADY the bird just the same.\n\n\nEXT.  BRADY, IN THE TREE\n\n\t\tBRADY\n\tOoooh, naughty!\n\n\nEXT.  MARTY\n\nHe moves toward JANE - there is something queerly unnatural\nin this movement, and in a moment we'll understand, but for\nthe time being we must be puzzled.\n\n\t\tMARTY\n\tJane, I'm sorry. It was just a joke. We\n\tdidn't mean-\n\nHe's reached her. JANE is sobbing now, hysterical.\n\n\t\tJANE\n\tOh, no! You never mean to! I hate you,\n\tyou booger!\n\nShe runs away.\n\n\nEXT.  THE TREE, WITH BRADY\n\nHe swings down and comes over to MARTY.\n\n\t\tBRADY (with satisfaction)\n\tReally got her goat that time.\n\n\nEXT.  MARTY\n\nHe's in a wheelchair, looking glumly after JANE.\n\n\t\tMARTY\n\tOh, shut up, Brady. You're warped.\n\n\nEXT.  NEAR THE BANDSTAND, FEATURING JANE  DAY\n\nShe's walking slowly along, still crying a little. Now she\nsteps behind some bushes, looks around, hikes up the skirt\nof her jumper, and wriggles out of the wrecked panty hose.\n\n\t\tSTELLA RANDOLPH (voice)\n\tWait! Don't go!\n\nStartled, JANE looks around, instinctively yanking her dress\ndown. No one in sight.\n\n\t\tMAN (voice; rough)\n\tJust leave me alone!\n\nNow she looks toward:\n\n\nEXT.  THE BANDSTAND, JANE'S POV\n\nA man who looks like he might be a traveling salesman who\nhas just stepped whole and breathing from a dirty joke about\nthe farmer's daughter comes striding down from the\nbandstand.\n\nSTELLA RANDOLPH, a plump but sweetly pretty girl, comes to\nthe stairs but does not descend them. She is also crying -\nbut these are real tears, folks. STELLA is a human Niagara\nFalls.\n\n\t\tSTELLA (calls)\n\tPlease! You have to help me!\n\n\nEXT.  THE GAY DECEIVER\n\n\t\tDECEIVER (keeps walking)\n\tIt's your oven, but it ain't my bun\n\tyou're baking in there. Sorry, babe.\n\nB.g. SOUNDS: More applause.\n\n\nEXT.  JANE\n\nWe can hear STELLA sobbing as JANE walks slowly toward the\nbandstand with her panty hose still balled up in one hand.\nJANE looks suddenly aware that she's not the only one in\nthis sad world who has troubles. She reaches the foot of the\nstairs going up to the bandstand and tosses the hose\nabsently in a litter can.\n\nJANE mounts the steps timidly.\n\n\t\tJANE\n\tStella? Is that you?\n\n\nEXT.  ON THE BANDSTAND\n\nSTELLA has retreated to one of the benches, where she is\nbawling into a handful of Kleenex. Pudgy and twenty-two, she\nis both funny and terribly sad. She looks around at the\nsound of JANE's voice.\n\n\t\tSTELLA (alarmed)\n\tWho - ?\n\n\t\tJANE (approaching closer)\n\tIt's Jane, Stella. Jane Coslaw.\n\nSTELLA sees it is, and turns away from her, still weeping.\nJANE stands, uncertain what to do next. After a moment she\napproaches closer and touches STELLA'S turned back timidly.\n\n\t\tJANE (tenderly)\n\tWhat's wrong?\n\n\t\tSTELLA (weeping)\n\tHe's going away. I know he is.\n\n\t\tJANE\n\tWho's going away?\n\nSTELLA turns to her, weeping still and distracted.\n\n\t\tSTELLA\n\tWhat am I going to tell my mother? If\n\the won't marry me, what am I going to\n\ttell my mother?\n\n\t\tJANE (bewildered)\n\tStella, I don't know what-\n\n\t\tSTELLA\n\tOh, leave me alone! Just leave me\n\talone, you stupid thing!\n\nSTELLA lumbers across the bandstand and down the steps. JANE\nstares after her, bewildered and perhaps even a little\nfrightened.\n\n\nINT.  THE PODIUM, WITH REV. O'BANION\n\n\t\tO'BANION\n\tLet us pray.\n\n\nINT.  THE TOWN HALL GATHERING\n\nMost of them bow their heads.\n\n\nINT.  REV. O'BANION, AT THE PODIUM\n\n\t\tO'BANION\n\tMay the Grace of God shine upon those\n\tgathered here... and lift them up... and\n\tgrant success to the endeavor to which\n\tthey have so openheartedly declared their\n\tsupport. Amen.\n\n\nINT.  THE GATHERING\n\nThey raise their heads. Some echo the \"Amen.\" Others cross\nthemselves.\n\n\nEXT.  THE PICNIC AREA\n\nPeople are coming out and getting ready to chow-down.\n\n\nEXT.  THE COSLAW STATION WAGON  DAY\n\nTraveling along a country road. Headed home.\n\n\nINT.  THE STATION WAGON  DAY\n\nBOB and NAN COSLAW are sitting up front. MARTY and JANE are\nin the backseat. JANE is as far from MARTY as she can get.\nShe's still mad as hell. Band-Aids crisscross her knees.\n\nMARTY'S wheelchair is collapsed in the cargo area of the\nwagon.\n\nNAN turns around to look at the kids - and it's really JANE\nshe's mad at.\n\n\t\tNAN\n\tI want you two to bury the hatchet.\n\tYou're being very silly, Jane.\n\n\t\tJANE (hot)\n\tDid you see my knees?\n\n\t\tMARTY\n\tJane, I-\n\n\t\tNAN\n\tI think you're being mean as well as\n\tsilly. Your brother has never had a\n\tscraped knee in his whole life.\n\nWell, here it is - the chief source of JANE'S animus against\nher brother and the source of most of the tension in the\nCOSLAW family.\n\nMARTY winces and turns away a little, embarrassed - this\nalways happens. He doesn't like it, but he doesn't know how\nto make his parents - his mother in particular - quit it.\n\n\t\tJANE\n\tYou always take his side because he's a\n\tcripple! Well, it's not my fault that he's\n\ta cripple!\n\n\t\tMARTY\n\tCome on, Jane- it was Brady's idea. I\n\tcouldn't stop him.\n\n\t\tJANE\n\tBrady's a booger and so are you!\n\n\t\tNAN\n\tJane Coslaw!\n\n\t\tBOB (roars)\n\tStop it or I'll throw the whole bunch of\n\tyou out!\n\nIn this traditional family unit, BOB is the Voice of\nAuthority. They all heed, although the atmosphere remains\nthundery.\n\n\nINT.  THE STATION WAGON  DAY\n\nTrain tracks run near the road.\n\n\nINT.  THE STATION WAGON, ENSEMBLE  DAY\n\n\t\tBOB (points)\n\tThat's where poor old Arnie Westrum\n\tpitched his last drunk.\n\nHe crosses himself and they all look toward:\n\n\nEXT.  THE GS&WM RAILROAD TRACKS (STATION WAGON'S POV)\n\n\nINT.  THE CAR  DAY\n\n\t\tBOB\n\tThey had to pick up what was left of\n\thim in a peach basket.\n\n\t\tJANE\n\tOh, Daddy! Gross!\n\n\t\tMARTY\n\tDid he really get his head cut off, Dad?\n\tThat's what Brady said.\n\n\t\tJANE\n\tIf you don't stop it I'm going to vomit.\n\tI mean it.\n\n\t\tNAN (no sympathy)\n\tYou're not going to vomit, Jane. And I\n\tthink we've all had quite enough of this\n\thorror-movie talk.\n\n\nINT.  MARTY, CLOSER  DAY\n\nCraning back to look at the spot where ARNIE bit the dust.\nHis face is thoughtful, solemn.\n\n\n\t\t\t\tDISSOLVE TO:\n\n\nEXT.  THE COSLAW HOUSE  NIGHT\n\nJANE is lying in bed, her face to the wall. Dim light falls\non her unhappy face as the door is opened.\n\n\t\tMARTY (v-o)\n\tJaney?... Are you awake?\n\nJANE says nothing.\n\n\nINT.  THE DOOR TO JANE'S BEDROOM, WITH MARTY  NIGHT\n\nHe is in his \"house wheelchair\" - not the Silver Bullet (he\nwas in the Bullet during the Common scene, but we didn't get\na very good look at it). He has some stuff on his lap. A\nbox, for sure.\n\n\t\tMARTY\n\tCan I come in?\n\n\nINT.  JANE\n\nHer eyes are open but she says nothing. Just looks at the\nwall.\n\n\nINT.  MARTY\n\nHe rolls across to her bed and puts something on her night\ntable. SOUND of change and a rattle of paper. She rolls over\nand sees he's put about three bucks on the table. Plus a can\nof mixed nuts.\n\n\t\tJANE\n\tWhat's the money for?\n\n\t\tMARTY\n\tA new pair of panty hose. Is it enough?\n\n\t\tJANE\n\tI don't want your money. You're a booger.\n\n\t\tMARTY\n\tIt was Brady's idea, Jane. Honest to God.\n\tPlease take the money. I want to make up.\n\nShe looks at him and sees he's sincere - honestly contrite.\nShe softens. There's hope for these two kids yet, maybe.\n\n\t\tJANE\n\tI can get a pair of L'Eggs down at the\n\tpharmacy for a dollar forty-nine. Here.\n\nShe pushes the rest back to him, then looks at the can. She\npicks it up, curious.\n\n\t\tMARTY\n\tThat's for you, too. Uncle Al gave it\n\tto me-\n\n\t\tJANE (scorn)\n\tThat drunk!\n\n\t\tMARTY\n\t-but I want you to have it.\n\nHe gives her a warm, melting smile. When your little brother\nis being good to you it's time to watch out - but JANE has\nbeen lulled. She starts to open it, then looks questioningly\nat him.\n\n\t\tMARTY\n\tYeah, go ahead.\n\nShe opens it. A long paper snake - the kind with a spring\ninside it - leaps out. She shrieks.\n\n\t\tJANE\n\tYou booger!\n\nMARTY backs up the wheelchair so he's out of her reach.\n\n\t\tMARTY (grinning)\n\tIt really is for your birthday, though -\n\ttry it on Brady. He'll wet his pants.\n\n\t\tJANE\n\tGo to hell!\n\n\nINT.  MARTY, BY THE DOOR\n\n\t\tMARTY (smiling)\n\tI love you, Janey.\n\n\nINT.  JANE, IN BED\n\nShe tries to be angry with him... and cannot (this is a\nresponse, we'll find, that both MARTY and his UNCLE AL\nevoke). She smiles at him a little.\n\n\nINT.  MARTY\n\nHe reverses his wheelchair, also smiling a little, and\nleaves.\n\n\nEXT.  TARKER'S MILLS, UNDER THE MOON  NIGHT\n\nWe're looking down at a brave little nestle of lights.\n\nSOUND: A HOWL.\n\n\nEXT.  A HOUSE SOME DISTANCE OUT IN THE COUNTRY\n\nThere's one light on upstairs and another downstairs... also\ndownstairs is the bluish flicker of TV light.\n\nAn ivy trellis climbs one side of the house.\n\nSOUNDS: Canned laughter; TV dialogue.\n\n\nINT.  THE LIVING ROOM OF THE RANDOLPH HOUSE\n\nSTELLA'S MOTHER, asleep in front of the TV.\n\n\nINT.  A PRETTY CHINA DISH, CU\n\nA whole bunch of capsules are dumped into it.\n\nTHE CAMERA DRAWS BACK to show us STELLA, sitting by her\nvanity mirror. The rest of the room is reflected in the\nmirror, including the window - we are upstairs.\n\n[NOTE: It would be nice to see that fat moon floating in the\nwindow!]\n\nThere's a framed picture of STELLA's ex-boyfriend on the\nvanity beside the dish of pills. STELLA sets down the empty\nprescription bottle the pills came from beside this picture.\nWe can clearly read the word \"Nembutol\" on it. There is also\na large glass of water on the vanity table.\n\nSTELLA turns the picture facedown. She might be crying but\nprobably she's not. She takes about five of the pills,\nstarts to lift them to her mouth-\n\nA HOWL outside... closer.\n\nSTELLA looks around for a moment, then takes the pills with\nsome water. She pauses, looking at herself.\n\n\t\tSTELLA\n\tSuicides go to hell. Especially if\n\tthey're pregnant. And I don't even care.\n\nShe takes another five pills. And another five.\n\nSOUNDS: Rattling foliage.\n\n\nEXT.  THE IVY TRELLIS  NIGHT\n\nClaw-hands are seizing it and climbing. SOUNDS of hoarse,\nguttural breathing.\n\n\nINT.  STELLA AT THE VANITY TABLE\n\nShe takes another handful of pills... and the window behind\nher shatters inward. There is a bellowing roar as the\nwerewolf throws itself through.\n\n\nINT.  THE LIVING ROOM, WITH MOTHER\n\nShe sits up, startled awake.\n\nFrom upstairs: ANOTHER SHATTERING ROAR... FOLLOWED BY A\nSCREAM.\n\n\nINT.  STELLA'S ROOM, WITH STELLA\n\nShe runs... and a huge claw-hand rips through the back of\nher nightgown.\n\n\nINT.  THE LIVING ROOM, WITH MOTHER\n\n\t\tMOTHER\n\tOh my dear God... Stella!\n\nShe runs for the doorway and the hall. From upstairs comes a\nconfusion of SOUNDS: roars, breaking furniture, shattering\nglass.\n\n\nINT.  STELLA'S BED, CU\n\nOne of those deadly claw-hands sweeps down the bed, ripping\nthrough the sheets... the mattress... the spring itself.\n\nHairy, muddy feet with protruding talons leap onto it.\n\n\nEXT.  STELLA'S WINDOW, EXTREME UP-ANGLE\n\nThe werewolf leaps out - it's graceful, savage, animal.\n\nSOUND: A TRIUMPHANT HOWL.\n\n\nINT.  THE UPSTAIRS HALL, WITH MOTHER\n\nShe's found an ancient pistol somewhere and is lugging it\ngamely along.\n\n\t\tMOTHER\n\tStella!...Stella!\n\nShe reaches the closed door of STELLA's room, vacillates\nthere for a moment... and then pushes it open and goes in.\n\nA long beat of silence as we hold on the door.\n\nMOTHER SHRIEKS.\n\n\nINT.  MOTHER'S FACE, ECU\n\nShe shrieks again.\n\n\nINT.  STELLA'S ROOM, WIDE\n\nIt's a total shambles; blood is splattered everywhere; the\nmirror is broken, the picture of DAN the gay deceiver is\nbroken; the bed is torn in two. There are big, muddy\nwolfprints on the remnants of the bed.\n\nSTELLA lies propped in the corner with Nembutols all around\nher. Suicide may have been what she planned, but it sure\nisn't what happened.\n\nMOTHER SHRIEKS.\n\n\nEXT.  TARKER'S MILLS MONTAGE  MORNING\n\na.) MR. PELTZER puts out his paper rack - just the\n\"Press-Herald\" this morning. He looks shocked and grim. The\nscare headline: BRUTAL MURDER ROCKS WESTERN MAINE. We can\nsee STELLA'S photograph.\nb.) Through the window of Robertson's Luncheonette, we see\nthe proprietor, BOBBY ROBERTSON, talking earnestly with a\nbunch of men. Among them: MILT STURMFULLER, ALFIE KNOPFLER,\nVIRGIL CUTTS, BILLY McCLAREN, and ELMER ZINNEMAN, a farmer\nwe'll meet later.\nc.) At Andy's Sporting Goods, ANDY FAIRTON is putting a big\nhand-lettered sign in the window. It reads: REMINGTON\nSHOTGUNS SINGLE ACTION DOUBLE ACTION PUMP PROTECT YOURSELF\nAND YOUR FAMILY!\nd.) At the Methodist parsonage, a '53 Dodge pulls slowly out\nand MOTHER RANDOLPH gets out, weeping. As she approaches the\nparsonage door, LESTER LOWE comes out and embraces her.\n\n\nEXT.  A SMALL BRICK BUILDING ON MAIN STREET\n\nThe sign reads: TARKER'S MILLS TOWN OFFICE.\n\n\nINT.  A HALLWAY, FEATURING A DOOR WITH A PEBBLED-GLASS PANEL\n\nNeatly lettered on the panel: TARKER'S MILLS CONSTABULARY.\nAnd below this: JOSEPH HALLER.\n\n\t\tJOE HALLER (voice)\n\tOkay...yes...Oh, fuck off!\n\n\nINT.  THE CONSTABLE'S OFFICE, WITH HALLER AND PETE SYLVESTER\n\nHALLER slams the phone down with an angry bang. He looks\nlike a guy who has been up all night. PETE, his pudgy\ndeputy, looks like a high school athlete who has suddenly\nfound himself batting in the World Series.\n\n\t\tPETE\n\tWhat'd they say, Joe?\n\n\t\tHALLER\n\tThey said they'd be here by noon.\n\n\t\tPETE (nervous)\n\tMaybe it wasn't such a good idea telling\n\tthat Smokey Bear from the Detective\n\tDivision to fuck off, Joe.\n\n\t\tHALLER (morosely)\n\tI waited until he hung up. Jesus, what a\n\tmess. I wish I'd stayed in the army. Let's\n\tgo on out there.\n\nHe gets slowly up.\n\n\nEXT.  TARKER'S MILLS CONSOLIDATED SCHOOL  AFTERNOON\n\nIt's a comfortable red-brick building on a side street. Ivy\nclimbs up the sides. Two or three rows of bikes stand along\none side of the building.\n\nSOUND: The bell rings.\n\nA beat or two, then the doors bang wide and a billion kids\nspill out. It's the end of the first day of school, and they\nare excited. They range from Grade 1 to Grade 8. Most kids\nbook it for home as fast as they can, getting on their bikes\nand riding or just running.\n\nEveryone has a pink report card.\n\n\nEXT.  A BUNCH OF KIDS, WITH BRADY KINCAID AND TAMMY\nSTURMFULLER\n\nBRADY and TAMMY are riding bikes. Now there is the SOUND of\na gasoline engine, and MARTY catches up. He's got the Silver\nBullet's motor running for the first time in the movie.\nLater on it will sound extremely powerful, like a racing\ncar, but now it just sounds like a big lawnmower engine with\na muffler on it. It's pretty cool, though - a bright\nmetallic silver with flame decals on the motor housing.\nLooks sort of like something Big Daddy Roth might have\nthought up. On the back is a license plate which says SILVER\nBULLET.\n\n\t\tBRADY\n\tLook out! Look out! It's Madman Marty and\n\tthe Silver Bullet!\n\nTAMMY laughs.\n\n\t\tBRADY\n\tYou glad to be back in jail, Marty?\n\n\t\tMARTY\n\tSure - I like school.\n\n\t\tTAMMY\n\tYou booger.\n\n\t\tMARTY\n\tThat's what my sister says, too. Pretty\n\tsoon I'm going to start checking the\n\tmirror to see if I'm turning green.\n\n\t\tBRADY\n\tI gotta split - see ya, Marty... Tammy.\n\n\nEXT.  THE CORNER OF MAIN AND WALNUT, A WIDER SHOT  AFTERNOON\n\nTAMMY and MARTY watch as BRADY zooms off toward home on his\nbike.\nMARTY pushes in a hand clutch and moves a small lever. He\nbumps down over the curb and they cross the street side by\nside, TAMMY on her bike, MARTY in his wheelchair.\n\n\nEXT.  MARTY AND TAMMY FROM THE FAR CURB, REVERSE\n\nHe pops up over the curbing with a bounce. He shoves in the\nlittle hand clutch and revs the engine. Va-room!\n\n\t\tMARTY\n\tNot bad, huh? My Uncle Al took off the\n\tregular muffler and put on a Cherry Bomb.\n\n\t\tTAMMY\n\tWhat's that?\n\n\t\tMARTY\n\tGlasspack. He said he'd come over sometime\n\tthis summer and we'd soup up the engine...\n\tbut now I dunno. He's getting a divorce and\n\the's in the doghouse with my mother.\n\n\t\tTAMMY\n\tFor getting a divorce?\n\n\t\tMARTY\n\tWell... it is his third.\n\n\nEXT.  A STREET ON THE OUTSKIRTS OF TOWN, WITH MARTY AND\nTAMMY\n\nThe other kids are gone; they are alone. The sidewalk has\nended and they roll slowly along the dirt verge of the road.\nThey look toward:\n\n\nEXT.  THE RANDOLPH HOUSE, MARTY AND TAMMY'S POV\n\nThe driveway is blocked off with a sawhorse bearing the\nstenciled words POLICE INVESTIGATION. The yard is filled\nwith cop cars - HALLER'S constable car, plus a number of\nstate police vehicles. Uniformed men come and go.\n\nWe can see a large black wreath on the door.\n\n\nEXT.  MARTY AND TAMMY\n\n\t\tTAMMY\n\tThanks for coming with me, Marty- I was\n\tscared to go past her house by myself.\n\n\t\tMARTY (matter-of-fact)\n\tYeah... it is a little scary.\n\n\t\tTAMMY\n\tI mean, I saw her. All the time.\n\nTAMMY stops her bike. She's on the verge of tears.\n\n\t\tTAMMY\n\tI used to see her every day, and she never\n\tknew what was going to happen to her, and\n\tneither did I! I mean I know how stupid\n\tthat sounds, but...\n\n\t\tMARTY\n\tHey, take it easy. I know how you feel.\n\nHe gets the Silver Bullet moving again, and she has to pedal\nalong to catch up.\n\n\nEXT.  THE STURMFULLER DRIVEWAY, WITH MARTY AND TAMMY\n\nThey stop at the end.\n\n\t\tTAMMY\n\tThere's something else scary.\n\n\t\tMARTY\n\tWhat?\n\n\t\tTAMMY (points)\n\tThat.\n\n\nEXT.  OLD GREENHOUSE, MARTY AND TAMMY'S POV\n\nIt stands a bit behind the house itself. A creepy place.\nMany of the glass panes are broken; some of these - not many\n- have been blocked with cardboard. The inside is a jungle\nof plants that have run to riot. In the f.g. is a\nmucky-looking garden patch where nothing much is growing.\n\n\nEXT.  MARTY AND TAMMY\n\nShe is quite deeply troubled.\n\n\t\tTAMMY\n\tI've been hearing noises in there.\n\n\t\tMARTY\n\tWhat kind of noises?\n\n\t\tTAMMY\n\tRattling. Rustling.\n\n\t\tMARTY\n\tRats...\n\n\t\tTAMMY\n\tAnd my dad says it's kids. But it's not\n\trats and it's not kids. It's-\n\n\nEXT.  THE STURMFULLER HOUSE, WITH MILT\n\nOh my suds and body, here is the Great American Alcoholic\nfor sure - the rural version. MILT is wearing a suit of\npee-stained thermal underwear. He's wearing a baseball cap\nwith the word \"Caterpillar\" on the front and has a bottle of\nbeer in one hand (I'm pretty sure that his beer is Rheingold\nthe dry beer). With his other hand he is busily scratching\nhis crotch.\n\n\t\tMILT\n\tTammy, you get on in here and do some\n\tdishes!\n\n\nEXT.  THE GREENHOUSE\n\nSinister...spooky.\n\n\t\tTAMMY (voice)\n\tI've got to go.\n\n\nEXT.  MARTY AND TAMMY\n\n\t\tMARTY\n\tI'd go out and take a look myself, but I\n\tthink the Bullet'd get stuck in the garden.\n\tIt looks sorta greasy.\n\nShe smiles at him, bends over, and kisses him on the mouth.\nMARTY is stunned... but happy.\n\n\t\tTAMMY\n\tYou would, wouldn't you?\n\n\t\tMARTY (Joe Cool)\n\tSure. No sweat.\n\n\t\tTAMMY\n\tWell, it's probably nothing. I'm just spooked\n\tsince... you know.\n\n\t\tMARTY\n\tYeah... but if you hear any more noises,\n\ttell your father. Okay?\n\n\t\tTAMMY\n\tOkay. Have you got enough gas to get home,\n\tMarty?\n\n\t\tMARTY (Startled)\n\tJeez!\n\n\nEXT.  THE WHEELCHAIR \"DASHBOARD,\" MARTY'S POV\n\nThere's a gas gauge here, and the needle is almost on \"E.\"\n\n\nEXT.  MARTY AND TAMMY\n\n\t\tMARTY\n\tI'm always doing this! I gotta go, Tammy.\n\n\t\tMILT (voice)\n\tTAMMY!\n\n\t\tTAMMY (calls)\n\tComing Daddy! (To MARTY) Bye... thanks\n\tagain for coming home with me.\n\nShe waves and goes biking down the driveway as MARTY motors\nback onto the street and turns toward town.\n\n\nEXT.  TAMMY\n\nShe brings her bike to a stop by her father.\n\n\t\tMILT\n\t'Bout time. Why you want to hang around\n\tthat cripple?\n\n\t\tTAMMY\n\tI like him.\n\n\t\tMILT\n\tGoddamn cripples always end up on welfare.\n\tOught to electrocute all of 'em. Balance\n\tthe fucking budget.\n\nHaving delivered this pearl of wisdom, MILT goes inside, now\nscratching his ass. TAMMY pauses a moment and looks toward\nTHE CAMERA, her face troubled and scared.\n\n\nEXT.  THE DESERTED GREENHOUSE, TAMMY'S VIEW\n\n\n\t\t\tDISSOLVES TO:\n\n\nEXT.  MARTY\n\nHe's buzzing along toward downtown, which is still some\ndistance away - but at least he's made it back to the\nsidewalk again.\n\n\t\tMARTY (prayerfully)\n\tCome on, baby-\n\nHe looks down at:\n\n\nEXT.  THE WHEELCHAIR GAS GAUGE, MARTY'S POV\n\nNow the needle is lying all the way over on \"E.\"\n\n\nEXT.  VIRGIL'S TEXACO  LATE AFTERNOON\n\nMARTY pulls in. The wheelchair motor starts to pop and lug\nand misfire. The chair makes it to the first pump on the\nisland closest to the street and then stalls as VIRGIL CUTTS\ncomes over.\n\n\t\tVIRGIL\n\tWell, Marty! I see you lucked out again!\n\n\t\tMARTY\n\tYep. Would you fill it up, please, Mr. Cutts?\n\n\t\tVIRGIL\n\tWant me to check the oil?\n\n\t\tMARTY\n\tSure!\n\n\t\tVIRGIL\n\tWipe the windshield an check the driver's\n\tbullshit level?\n\nMARTY laughs; VIRGIL starts carefully pumping gas into the\nSilver Bullet's small tank.\n\n\nEXT.  THE COSLAW HOUSE  NIGHT\n\nOverhead is the moon, three days past the full.\n\n\t\tUNCLE AL (voice)\n\tI'll see your Carlton Fiske and raise you\n\ta George Brett... a Dave Kingman... and a\n\tRod Carew.\n\n\nINT.  THE KITCHEN DOORWAY, WITH NAN COSLAW  NIGHT\n\nShe's wiping her hands with a dishtowel and looks like she\njust bit into a lemon.\n\n\nINT.  THE DEN, WITH UNCLE AL AND MARTY  NIGHT\n\nUNCLE AL is the family's sheep of a darker color. He's\nthirty, good-looking, raffish. He's also drunk. He's got\nboth whiskey and beer. An ashtray beside him overflows with\nbutts.\n\nHe and MARTY are playing draw poker for MARTY'S baseball\ncards. Each has a pile in front of him.\n\nMARTY really loves UNCLE AL... his eyes just glow when he\nlooks at him.\n\n\t\tMARTY\n\tOkay, okay. I call.\n\nHe tosses in three baseball cards.\n\n\t\tUNCLE AL\n\tWait a minute, wait a minute!\n\nHe grabs one of MARTY'S cards, looks at it, and tosses it\nback.\n\n\t\tUNCLE AL\n\tRalph Houk! You can't bet a manager!\n\tStone the crows!\n\n\t\tMARTY\n\tOkay, okay. Dwight Evans.\n\n\t\tUNCLE AL\n\tPiss on him. Piss on all the Red Sox.\n\nHe swallows whiskey and chases it with beer.\n\n\nINT.  THE DEN, A WIDER ANGLE\n\nNAN comes briskly over. She's seen and heard enough. She\nfavors UNCLE AL with a glare and then looks protectively at\nMARTY.\n\n\t\tNAN\n\tCome on, Marty- bedtime.\n\nShe starts to wheel him away.\n\n\t\tMARTY\n\tMom-!\n\n\t\tUNCLE AL\n\tLet the boy finish the game, Nan.\n\nHe means it, drunk or not. She reluctantly rolls MARTY back\nto the table.\n\n\t\tNAN\n\tMake it quick.\n\nUNCLE AL lays down his hand.\n\n\t\tUNCLE AL\n\tThree kings.\n\n\t\tMARTY (delighted)\n\tI got a straight to the queen!\n\n\t\tUNCLE AL\n\tBullshit luck!\n\n\t\tNAN (outraged)\n\tThat's enough!\n\n\t\tMARTY (as his mother wheels him away)\n\tAww, Mom-!\n\n\nINT.  THE STAIRWELL OF THE COSLAW HOME\n\nMARTY is sitting in a stair chair that rises slowly to the\nsecond floor. He looks dejected and glum.\n\nSOUND of NAN hectoring her brother AL. I don't think we can\nmake out all of what's going on, but we've all known women\nlike NAN and I think we can fill in the blanks. \"Christian\nhousehold... you come here drunk and expect... can't even\nbother to call ahead...\" Etc., etc.\n\nA wheelchair stands on the second-floor landing. This one is\nno Silver Bullet, only the more humble sort that moves by\narm power. When the stair chair clicks to a stop, MARTY\nhoists himself from it into the wheelchair and rolls down\nthe hall toward the bathroom.\n\nBelow, NAN'S rant is still going on.\n\n\nINT.  THE DEN, WITH NAN AND UNCLE AL  NIGHT\n\nUNCLE AL is clearing up in a kind of drunken stupor- and I\nmean he is really drunk. He's smoking one cigarette; another\nis smoldering away in the heaping ashtray. He drops a pile\nof baseball cards on the floor and bonks his head on the\ntable bending down to pick them up.\n\n\t\tNAN\n\tI don't want you drinking around Marty.\n\tThat's too much. If you can't stop it,\n\tyou better stay away.\n\nAL straightens up. There is a sort of command force in this\nman, and here he is partly able to rise above his abysmal\ndrunkenness so we can see it.\n\n\t\tUNCLE AL\n\tI come here because Marty needs a friend.\n\n\t\tNAN\n\tYes... you've always been that to him.\n\tBut if you can't leave your booze in\n\twhatever dump you call home, you better\n\tjust stay away.\n\nShe leaves the room, almost crying. UNCLE AL looks after\nher, and then his attention is drawn to the smoldering\nashtray. He pours beer over the mess, putting out the fire\nbut creating something that looks even worse. He begins\ndrunkenly picking up again.\n\n\t\tUNCLE AL (to himself)\n\tAnother wonderful time at Sister Nan's\n\thouse! Heeyyy!\n\n\nINT.  THE UPSTAIRS COSLAW BATHROOM\n\nMARTY, now in pj's, is brushing his teeth.\n\nJANE comes in- she's wearing a nightie.\n\n\t\tMARTY\n\tMom was really mad at him this time,\n\twasn't she?\n\n\t\tJANE\n\tWhat do you expect, when he comes in\n\tsmelling like a brewery and looking like\n\tan unmade bed?\n\n\t\tMARTY\n\tStop it!\n\nHe lunges at her, but JANE steps back easily. MARTY\noverbalances and falls out of the wheelchair. His toothbrush\nclatters across the tile.\n\n\t\tBOB COSLAW (sleepy voice)\n\tHey! That you, Marty?\n\n\t\tJANE\n\tHe's okay, Dad!\n\nShe looks around swiftly, then bends down.\n\n\nINT.  MARTY AND JANE, A MUCH CLOSER SHOT\n\nOne of MARTY'S cheeks is pressed against the floor. His eyes\nare shut. He's weeping.\n\n\t\tJANE (low)\n\tMarty, are you all right?\n\n\t\tMARTY\n\tYes. Go away.\n\n\t\tJANE\n\tLet me help you up.\n\n\t\tNAN (voice)\n\tMarty?\n\nSOUND of her climbing the stairs.\n\nJANE throws a quick look back over her shoulder and then\nhelps MARTY up in his chair. He helps by pulling on the sink\ncounter. JANE has time to give MARTY one quick look- \"Please\ndon't tell on me,\" it says.\n\nNAN comes in.\n\n\t\tNAN\n\tJane, have you been teasing your\n\tbrother again?\n\n\t\tMARTY\n\tShe wasn't, Mom- I dropped my toothbrush\n\tand fell over when I tried to get it. Jane\n\thelped pick me up.\n\nHe bats his eyes at her.\n\n\t\tMARTY (syrupy voice)\n\tJane's wunnnderful.\n\nJANE picks up his toothbrush.\n\n\t\tJANE (hands it to him)\n\tHere. Brush them good, Marty. Some of that\n\tshit in your head might leak down into your\n\tmouth and poison you.\n\n\t\tNAN\n\tJane Coslaw!\n\nBut JANE stalks off. MARTY is grinning. It was a good\nput-down.\n\n\nEXT.  THE STURMFULLER HOUSE  NIGHT\n\nWe can see the moon in the sky beyond the ruined greenhouse.\n\nTHE CAMERA MOVES SLOWLY TOWARD the greenhouse. We begin to\npick up SOUNDS: RATTLING...RUSTLING...and low animal GRUNTS.\n\n\nINT.  TAMMY'S BEDROOM  NIGHT\n\nShe's deeply asleep.\n\n\nINT.  THE LIVING ROOM  NIGHT\n\n\"Big-time Wrestling\" on the TV. SOUND of a refrigerator door\nclosing. MILT STURMFULLER comes into the living room from\nthe kitchen. He's wearing his long johns with the designer\npee stains and has a quart bottle of Rheingold the dry beer\nin each hand. He sits down, looking at the TV.\n\n\t\tMILT (drunk)\n\tGive him the airplane! Wring his neck!\n\n\nEXT.  THE GREENHOUSE  NIGHT\n\nMore noises. There is a beat of silence, and then something-\none of those earthen plant pots, I think- falls over and\nSHATTERS.\n\n\nINT.  THE LIVING ROOM, WITH MILT\n\nHe looks up briefly- he's heard something- but the crowd on\nthe TV is loud and the match is reaching its climax.\n\n\t\tMILT (all eyes again)\n\tGive him the sleeper, you fuckin bugwit!\n\n\nEXT.  THE GREENHOUSE, CLOSER\n\nA LOW SNARL. Plants shake and shiver. Another crash, LOUDER.\n\n\nINT.  MILT, IN THE LIVING ROOM\n\nLooks toward the window. He gets up, goes over, and looks\nout.\n\n\nEXT.  THE GREENHOUSE, MEDIUM-LONG (MILT'S POV)\n\nSOUND of another crash. Plants move.\n\n\nINT.  THE HALL, WITH MILT\n\nHe takes a shotgun from the wall, breaks it, and looks\ninside.\n\n\t\tMILT\n\tLet's see if you want to come back and\n\tbreak my pots all to shit after I put\n\tsome rock salt in your asses!\n\n\nINT.  THE STURMFULLER GREENHOUSE  NIGHT\n\nThe door at the end SCREECHES OPEN and MILT, still holding\nthe shotgun at port arms, comes cautiously in. This place is\nreally overgrown.\n\nMILT advances slowly into the jungle of plants, and the\ndirector will shoot it as he likes to build the suspense.\nI'm sure that plants brush his face, and a bug or two- maybe\neven a big plump spider- will land on him.\n\nHe hears a SCUTTERING SOUND and whirls.\n\n\t\tMILT (shouts)\n\tWho's there?\n\n\nINT.  GREENHOUSE FLOOR, MILT'S POV  NIGHT\n\nA mouse goes running across the warped boards (which have\npulled apart from each other, showing deep cracks between).\n\n\nINT.  MILT  NIGHT\n\nHe relaxes and starts forward again. We keep expecting it to\nhappen, but it keeps not happening.\n\nThen, as MILT is starting back toward the door, two big,\nhairy arms come up through the floor- bursting through two\nof those cracks and shoving the splintered boards upward-\nand grab MILT'S legs at the knees.\n\nSOUNDS: BESTIAL ROARS.\n\nMILT screams and triggers off the shotgun- unfortunately, it\nis pointing straight up. Glass showers down on him. He is\npulled down into the shattered hole- now we can see him only\nfrom the knees up.\n\n\nINT.  TAMMY STURMFULLER'S BEDROOM\n\nShe sits up in bed.\n\nSOUNDS of ROARS and MILT SCREAMING from the greenhouse.\n\nMRS. STURMFULLER, in a nightgown with her hair done up in\nrollers, comes into Tammy's room.\n\n\t\tMRS. STURMFULLER\n\tTammy, where's your father?\n\nSOUND: Another SCREAM from the greenhouse.\n\n\nINT.  THE GREENHOUSE, WITH MILT\n\nHe's now waist deep in the hole in the floor, surrounded by\nbroken, splintered boards.\n\nSOUNDS: RIPPING FLESH, CRUNCHING BONES. MILT SHRIEKS.\n\nHe is abruptly jerked downward again. He is being eaten from\nthe feet up. As he's jerked down, one of the leaning,\nsplintered boards rams into his chest. MILT collapses over\nit like an old Roman collapsing on his sword.\n\nA hairy arm reaches up and grabs his neck. MILT is jerked\nall the way into the hole, board and all.\n\n\nEXT.  THE GREENHOUSE, FROM TAMMY'S BEDROOM WINDOW\n\nSOUNDS of SNARLS, GROWLS, GRUNTS.\n\n\nINT.  TAMMY AND MRS. STURMFULLER\n\nThey are hugging each other, terrified, by the window.\n\n\nEXT.  THE STURMFULLER PLACE, MEDIUM-LONG  DAY\n\nThe police cars are now here. There's also a meat wagon. As\nwe watch, a number of cops- JOE HALLER and PETE SYLVESTER\nare among them- approach the wagon. Many are carrying canvas\nbags.\n\n\nEXT.  THE STURMFULLER YARD, FEATURING PETE SYLVESTER\n\nHe drops the blood stained bag he's carrying, runs to the\nbushes, and noisily blows his groceries.\n\n\nEXT.  TARKER'S MILLS MONTAGE #3  DUSK\n\na.) On Oak Street, MRS. THAYER is hurrying toward home,\nobviously spooked. She keeps looking behind herself and\nnearly flies up the steps to her house. Then there is the\nendless business of fumbling with her keys. Finally she\nlurches inside and slams the door.\nb.) On Main Street, at the Holy Family rectory, FATHER\nO'BANION is closing the shutters...and locking them.\nc.) On a residential street, a kid is playing with some\nplastic trucks outside of a picket fence. Except for him,\nthe street is deserted. His mother comes out and hauls him\nin.\nd.) ANDY FAIRTON, in the sporting-goods store, checks an\nautomatic pistol and then holsters it on his hip. He has a\npugnacious, unpleasant look.\ne.) BILLY McCLAREN turns the sign on the door of his barber\nshop from OPEN to CLOSED, looks out warily at the street (to\nmake sure there are no psycho killers out there for trims, I\nguess), then leaves and locks the door behind him. THE\nCAMERA FOLLOWS him down a couple of store fronts to Owen's,\nwhere he also goes in.\nf.) The paper rack in front of Peltzer's Drug/ The\n\"Press-Herald\" headline is a sixteen-pointer: MANIAC CLAIMS\nSECOND VICTIM.\n\n\nEXT.  MARTY AND BRADY KINCAID  MAGIC HOUR\n\nThey're flying kites on the common. Some distance in the\nb.g. is the bandstand. MARTY is of course flying his kite as\nhe sits in the Silver Bullet. The boys are having a blast.\n\nTHE CAMERA SLOWLY MOVES AWAY from the boys, centers on\nOwen's Pub across the street, and ZOOMS IN.\n\nIn the window is a poster. It reads: $10,000 REWARD FOR\nINFORMATION LEADING TO THE CAPTURE OF THE MAN (OR ANIMAL)\nWHO KILLED STELLA RANDOLPH AND MILTON STURMFULLER. And, at\nthe bottom: TARKER'S MILLS CITIZENS' COMMITTEE.\n\nAlong comes ANDY FAIRTON. He goes into the pub.\n\n\nINT.  OWEN'S PUB\n\nAt a f.g. table: VIRGIL CUTTS, BOBBY ROBERTSON, ELMER\nZINNEMAN, and his brother PORTER ZINNEMAN. Behind them, at\nthe bar, we see PETE SYLVESTER having a beer with BILLY\nMcCLAREN. As we look around the bar, we will also see FATHER\nLESTER LOWE, sitting at an unobtrusive corner table, nursing\na beer and listening closely to the conversation.\n\n\t\tELMER (to VIRGIL)\n\tDon't tell me an animal can't rip a man\n\tup the way Milt Sturmfuller was ripped up!\n\n\t\tVIRGIL\n\tBut the woman's bed was ripped right down\n\tthe middle, Elmer- it's take a chainsaw to\n\tdo something like that!\n\n\t\tPORTER\n\tDamn straight!\n\n\t\tELMER\n\tShut up, Porter. (To VIRGIL) What about the\n\ttracks?\n\nANDY FAIRTON has joined the group. He sits down uninvited.\n\n\t\tVIRGIL\n\tThat could be something to throw off the\n\tcops. And it ain't animals that try to\n\tconfues the law; it's people do that.\n\n\t\tANDY FAIRTON\n\tLaw around here don't need much confusing.\n\nPETE looks around at this. Being the deputy constable and\nineffectual by nature, he's pretty sensitive.\n\n\t\tANDY (deep disgust)\n\tJoe Haller couldn't find his own ass if\n\tsomeone rammed it full of radium and gave\n\thim a Geiger counter.\n\n\t\tPETE SYLVESTER (comes over)\n\tCould be I know a fella who's still PO'd\n\tover getting fined two hundred bucks for\n\tthat little fender bender out on the Ridge\n\tRoad last year.\n\n\t\tANDY\n\tCould be I know a fat old fella who ought to\n\ttake care of his mouth before someone comes\n\talong and turns it inside out. I pay Joe\n\tHaller's salary to keep the people in this\n\ttown safe, and he ain't doing it.\n\n\nINT.  BILLY McCLAREN, AT THE BAR\n\nHe's looking toward the table where the Fairton group sits.\n\n\t\tBILLY (mildly)\n\tLast town report said you was in arrears\n\tyour taxes, Andy. Guess you must have paid\n\tup, huh?\n\n\nINT.  THE FAIRTON TABLE\n\n\t\tANDY\n\tWhat are you, trying to be smart?\n\nOWEN KNOPFLER comes over.\n\n\t\tOWEN\n\tYou guys turn down the thermostat or I'm\n\tgonna turn you all out. Now who's drinking?\n\n\t\tANDY (sulks)\n\tBring me a Schlitz.\n\n\nEXT.  A TREE, WITH BRADY'S SMILE-KITE STUCK IN IT  DUSK\n\nSOUND of panting.\n\nMARTY comes into the frame, pulling himself up by the arms.\nHis arms are very strong, although his legs trail limply\nbehind him (like the tail of a kite). He sits on a branch,\nuntangles the kite and the string, and looks down.\n\n\t\tMARTY (calls)\n\tHere it comes!\n\n\nEXT.  THE FOOT OF THE TREE, WITH BRADY\n\n\t\tBRADY\n\tDrop it!\n\nAs the kite flutters down, JANE comes biking up.\n\n\t\tJANE\n\tMarty Coslaw, you get down out of\n\tthat tree!\n\n\nEXT.  MARTY, IN THE TREE\n\nHe descends, then hangs from the lowest branch.\n\n\t\tMARTY\n\tPush the Bullet over, Jane, okay?\n\n\nEXT.  MARTY AND JANE\n\n\t\tJANE (makes no immediate move to do so)\n\tSupper was an hour ago, Dumbo.\n\n\t\tMARTY (hanging)\n\tOh, Jeez! I forgot! Is she mad?\n\n\t\tJANE\n\tThey both are. At me, for not getting you\n\tsooner. I ought to let you fall.\n\nBut she pushes the chair over and MARTY drops into it. He\npushes the starter and the Silver Bullet fires up.\n\n\nEXT.  BRADY, FLYING HIS KITE ON THE COMMON  DUSK\n\n\t\tMARTY (voice)\n\tHey, Brady! You coming?\n\n\t\tBRADY (looking into the sky)\n\tIn a while!\n\nBRADY could give a shit if MARTY'S in trouble. He just waves\nvaguely. He's into the kite-flying experience, as the folks\nin Marin County might say.\n\n\nEXT.  MARTY AND JANE\n\nHe's looking toward the common, frowning and uncertain.\n\n\t\tJANE\n\tCome on, Marty.\n\nShe starts biking away. MARTY starts after her, pauses, and\nlooks at:\n\n\nEXT.  BRADY, ON THE COMMON  DUSK\n\nCAMERA PANS SLOWLY UP to the yellow smile-kite in the\nbluish-purple sky.\n\n\nINT.  OWEN'S PUB  LATE DUSK\n\nThe former patrons are still here, with the exceptions of\nLOWE, BILLY McCLAREN, and BOBBY ROBERTSON. Many others have\nappeared; this is Happy Hour. Among them we see MR.\nASPINALL, the principal, and PELTZER, the druggist. A\nbarmaid, NORMA, circulates with drinks and beers.\n\nSpeaking of beer, ANDY FAIRTON has gotten through a fair\namount of Schlitz. It hasn't mellowed him, however; he's\nmore belligerent than ever.\n\n\t\tANDY (holding forth)\n\tThis whole investigation has been as\n\tefficient as a Polish fire drill! It-\n\n\t\tPETE (bravely)\n\tI've heard enough out of you, Andy. If\n\tyou don't shut your mouth, I'm going to\n\tshut it for you.\n\n\nINT.  THE DOOR OF OWEN'S PLACE\n\nIt opens and a man in a business suit- HERB KINCAID- comes\nin. He is carrying a briefcase and he looks worried.\n\n\nINT.  THE GROUP AT THE FAIRTON TABLE\n\n\t\tANDY (astounded)\n\tWhat did you say?\n\n\nINT.  THE BAR, WITH OWEN KNOPFLER\n\n\t\tOWEN\n\tJesus wept.\n\nHe reaches under the bar and comes out with a baseball bat.\nBurned into the side of the bat, so it reads vertically\ntoward the handle, is the word \"peacemaker.\" OWEN hurries\naround the bar with it.\n\n\nINT.  THE FAIRTON GROUP\n\nPETE is standing in front of ANDY, fists balled up, fat face\ntrembling with determination.\n\n\t\tPETE\n\tYou heard what I said, motormouth.\n\nANDY gets up, infuriated. There's apparently going to be a\nbrawl. Behind them, HERB KINCAID has approached the table.\nHERB hasn't even noticed what's going on; he's got problems\nof his own.\n\n\nINT.  HERB KINCAID\n\nHe clears his throat. This is a mild, timid man- he doesn't\nlike to speak in public, particularly not in a bar, but the\nimperatives of the situation demand it right now.\n\n\t\tHERB (quite loudly)\n\tHas anyone in here seen my son Brady?\n\n\nINT.  THE PUB, A NEW ANGLE\n\nEveryone looks at HERB. Conversation stops. ANDY and PETE\nfreeze with their fists balled up, like little kids playing\nstatues tag. OWEN is caught a little distance from ANDY and\nPETE, with the \"peacemaker\" still in his hands.\n\n\nEXT.  THE TOWN COMMON, LONG\n\nNow it is almost completely dark, and a large reddish summer\nmoon is rising over the horizon.\n\nSOUND: A LONG, WAVERING WOLF HOWL... LOUD.\n\n\nINT.  OWEN'S PUB\n\nAll conversation has stopped. All have turned toward the\ndoor and the windows; all hear the HOWL. Deep fright\noverlies each face.\n\nNORMA drops her tray. Glasses and bottles shatter.\n\n\nINT.  THE MAIN CORRIDOR OF THE TOWN HALL\n\nJOE HALLER comes out of the constable's office in a hurry,\nletting the door bang the wall. He's buckling on his gun\nbelt.\n\n\nEXT.  THE BANDSTAND\n\nBRADY'S kite, torn in a couple of places, flutters on the\nsteps leading up to the bandstand. The yellow smile face\ngrins eerily in the darkness. It is streaked with blood.\n\n\nINT.  OWEN'S PUB\n\n\t\tHERB\n\tBrady!\n\nHe breaks for the door. ANDY FAIRTON grabs him.\n\n\t\tHERB\n\tGet out of my way!\n\nHe pushes ANDY aside. HERB is out the door, chased by PETE\nand several of the others.\n\n\nEXT.  THE BANDSTAND  NIGHT\n\n\t\tJOE HALLER (low voice)\n\tHail Mary, full of grace, the Lord is with\n\tthee. Blessed art thou among women...\n\nHe comes out of the shadows, his drawn gun dangling by his\nside. This man has had an extremely bad shock. The legs of\nhis uniform pants are splashed with blood. He makes it down\ntwo steps and then sits heavily by the remains of BRADY'S\nsmiling, bloody kite. He looks straight ahead. He looks at\nnothing.\n\n\t\tHALLER (low)\n\t...and blessed is the fruit of Thy womb.\n\tJesus. Holy Mary, Mother of God, pray for\n\tus sinners now...now...\n\nHe looks at the kite, then looks away. He puts a hand over\nhis face and starts to cry.\n\n\nEXT.  THE COMMON, LOOKING BACK TOWARD MAIN STREET  NIGHT\n\nA number of men - not all that were in Owen's but quite a\nfew of them - are running toward the bandstand. HERB KINCAID\nis in the lead, screaming his son's name over and over.\n\nSOUND: A LONG HOWL, now at some distance.\n\n\nEXT.  THE BANDSTAND, WITH HALLER AND KINCAID\n\nAs HERB KINCAID approaches.\n\n\t\tHALLER\n\tStay off the bandstand, Herb.\n\n\t\tHERB\n\tIs it my boy? Is it Brady?\n\n\t\tHALLER\n\tDon't go up-\n\n\t\tHERB (lunges past him)\n\tBrady! Brady!\n\nDisappears into the dark. HALLER looks down at his lap.\n\n\t\tHERB\n\tBr-(CUTS OFF)\n\nThe other men arrive, PETE in the lead. HALLER doesn't look\nup.\n\n\t\tPETE\n\tJoe, is it-\n\n\t\tHALLER (not looking up)\n\tShhh.\n\n\t\tPETE\n\tIs it the Kicaid b-\n\n\t\tHALLER (not looking up)\n\tShhh, I said.\n\nThe men look uneasily at HALLER, at each other. ANDY FAIRTON\nshoves forward.\n\n\t\tANDY\n\tWhat the fuck is going on h-\n\nSOUND: HERB SCREAMS. A pause. HERB screams again. The men\nflinch back. HALLER doesn't look up. Now, from the darkness\non the bandstand, HERB begins to LAUGH. The men shrink back\nfurther, looking more uneasy than ever.\n\n\t\tHERB (voice; laughing)\n\tWe'll bury his shoes.\n\nNow HALLER gets up and joins the other men.\n\n\t\tHERB (voice; laughing)\n\tThat's what we'll have to do; we'll bury\n\this shoes. Maybe in a couple of Roi-Tan\n\tcigar boxes.\n\n\nEXT.  THE BANDSTAND, MEN'S POV  NIGHT\n\nHERB KINCAID appears. He is laughing. He is smeared with his\nson's blood. In each hand he holds one of his son's shoes.\n\n\t\tHERB\n\tWe'll bury his shoes because his feet are\n\tstill in them and they're the only part of\n\thim that makes sense anymore.\n\nHERB laughs harder.\n\n\t\tHERB\n\tIt's gonna be the cheapest funeral this\n\ttown ever saw!\n\nHERB SCREAMS LAUGHTER. THE CAMERA DOLLIES IN TO CLOSE ON\nBRADY'S KITE.\n\n\nEXT.  THE MOON, CU\n\nSOUND: HERB SCREAMING.\n\n\n\t\t\t\tDISSOLVE TO:\n\n\nEXT.  HOLY FAMILY CHURCH  DAY\n\nSOUND: An organ is playing that sweet old hymn, \"Bringing In\nThe Sheaves.\"\n\nThere are lots of cars parked in front of the church, but\nthere's a space left just big enough for UNCLE AL'S MG.\nMARTY'S Silver Bullet is strapped to the back.\n\n\t\tJANE (v-o)\n\tMy mother and father- my mother in\n\tparticular- did not much care for Uncle\n\tAl...\n\n\nINT.  HOLY FAMILY CHURCH  DAY\n\nMARTY'S chair is at the back of the church. Most of the\nmourners are crying. MRS. BOWIE is playing the organ.\nBRADY'S coffin is on a bier at the front - closed of course.\nThere are lots of flowers.\n\n\t\tJANE (v-o continues)\n\t...but when it came to such unpleasant\n\tduties as taking Marty to the funeral\n\tof his best friend...\n\n\nINT.  UNCLE AL, MARTY, TAMMY, AND MRS. STURMFULLER IN A PEW\n\nAs we look at them, from left to right: UNCLE AL, MARTY,\nTAMMY, MRS. STURMFULLER.\n\nUNCLE AL unobtrusively takes a small silver flask from his\nhip pocket. Engraved on it in Old English letters is the\nword \"rotgut.\" He spins the cap and takes a quick knock. He\npauses and glances at MARTY, who looks deeply stunned.\n\n\t\tJANE (v-o continues)\n\t...they didn't at all mind drafting him.\n\tAs to the sort of comfort Uncle Al may\n\thave been able to offer him...\n\nUNCLE AL hands the flask to MARTY. MARTY looks at him\nquestioningly for a moment, and then drinks. MARTY looks at\nTAMMY, who looks frankly terrible. Her mother is looking\naway. MARTY nudges her. She looks around at him. He offers\nher the flask. Her eyes widen.\n\n\t\tJANE (v-o continues)\n\t...I now believe that was best kept between\n\tthe two of them...\n\nAfter a brief moment's consideration, TAMMY takes the flask\nand has a deep swallow. She hands the flask back to MARTY,\nwho hands it quickly back to UNCLE AL as TAMMY coughs. Her\nmother looks at her... then at MARTY and UNCLE AL. UNCLE AL\nsmiles sympathetically, hiding the flask with one hand, as\nif to say, \"Isn't it a terrible thing?\" MRS. STURMFULLER\nlooks distractedly back toward the service.\n\n\t\tJANE (v-o concludes)\n\t...or among the three of them.\n\nUNCLE AL pockets the flask just as the organ stops playing.\n\n\nINT.  THE PODIUM, WITH FATHER LOWE\n\n\t\tLOWE\n\tMr. and Mrs. Kincaid have asked that there\n\tbe no mass said here this afternoon. There\n\twill be a requiem mass for Brady Kincaid\n\tthis Sunday. They did ask me to say a word\n\tof comfort to you, if I could.\n\nHe looks out at them.\n\n\nINT.  THE CONGREGATION\n\nThey look back at LOWE, hoping for some help in\nunderstanding this awful thing.\n\n\nINT.  LOWE, ABOVE THE COFFIN\n\n\t\tLOWE\n\tIf there is any word of comfort I can give\n\tyou, it's just this: the face of the beast\n\talways becomes known; the time of the beast\n\talways passes.\n\nHe is struggling with this, trying dreadfully hard.\n\n\t\tLOWE\n\tIf there are times when we feel alone and\n\tafraid, only small creatures in the dark,\n\tthen these are the times when we must turn\n\tto one another for our comfort and our hope.\n\tTo our neighbors. To our community. To our\n\tlove for each other. I alone cannot ease\n\tthe pain for Herb and Naomi Kincaid, nor can\n\tI ease your pain, nor you ease mine. But if\n\tI believe anything it's this: we can comfort\n\teach other. We can heal each other. We can\n\tgo on together.\n\n\nINT.  THE CONGREGATION, WITH MARTY AND TAMMY\n\nThe kids are crying. MARTY puts an arm around TAMMY and she\nputs her head on his shoulder.\n\n\nINT.  FATHER LOWE\n\n\t\tLOWE\n\tThe Bible tells us not to fear the terror\n\tthat creepeth by night or that which flieth\n\tby noonday, and yet we do... we do. Because\n\tthere is much we don't know, and we feel\n\tvery small. But we must not be alone. We must\n\tnot allow ourselves to be alone, for there is\n\tthe wide gate to the hell of terror. Turn to\n\teach other. Join hands in your sorrow and try\n\tto remember that the face of the beast always\n\tbecomes known. (Pause) The time of the beast\n\talways passes. (Pause) Let us pray.\n\n\nEXT.  THE MOURNERS, WITH MARTY\n\nMARTY and TAMMY look at each other miserably. TAMMY begins\nto cry- for her father as much as for BRADY, one would\nthink- and she and MARTY embrace.\n\n\nEXT.  UNCLE AL, CU\n\nHe looks at the kids with deep sympathy and deep love.\n\n\nEXT.  A COUNTRY ROAD  AFTERNOON\n\nUNCLE AL'S sports car passes THE CAMERA. He's taking MARTY\nhome.\n\n\nINT.  THE CAR, WITH MARTY AND UNCLE AL\n\n\t\tUNCLE AL\n\tYou all right, Marty?\n\n\t\tMARTY\n\tYeah.\n\n\t\tUNCLE AL\n\tThere's a saying- so-and-so was better than\n\ta poke in the eye with a sharp stick. You\n\tever hear that one?\n\n\t\tMARTY\n\tNo.\n\n\t\tUNCLE AL\n\tWell, I'm not sure that was. Christ! They\n\tbetter get the guy.\n\n\t\tMARTY\n\tUncle Al, what if it's not a guy?\n\n\t\tUNCLE AL\n\tHuh?\n\n\t\tMARTY\n\tWhat if it's some kind of monster?\n\n\t\tUNCLE AL (laughs)\n\tJesus, Marty! Come off it!\n\n\nEXT.  UNCLE AL'S CAR, ON MAIN STREET\n\nIt cruises past Owen's Pub. There are cars parked out front,\nbut there are also lots of pickup trucks.\n\n\nINT.  THE CAR, WITH MARTY AND UNCLE AL\n\n\t\tMARTY\n\tWhat's going on at Owen's, Uncle Al?\n\n\t\tUNCLE AL\n\tA bunch of men getting ready to pretend\n\tthey're Clint Eastwood... Marty, didn't\n\tanybody ever tell you that the only monsters\n\tare in comic books and drive-in movies?\n\n\nEXT.  THE COSLAW HOUSE  LATE AFTERNOON\n\nUNCLE AL'S car turns in and parks.\n\n\nINT.  THE CAR, WITH MARTY AND UNCLE AL\n\n\t\tMARTY\n\tTammy said she'd been hearing noises in\n\tthat greenhouse. Growling noises, like a\n\tbig animal. Her father was killed that night.\n\nUNCLE AL looks at him doubtfully for a moment, as if almost\nbelieving. Then he shakes his head.\n\n\t\tUNCLE AL\n\tMarty, you have to get this idea out of\n\tyour head. Psychotics are more active\n\twhen the moon is full, and this guy is a\n\tpsycho. He's going to turn out to be as\n\thuman as you or me. (Pause) In a manner of\n\tspeaking. Now let's get you inside.\n\nHe opens his door and gets out.\n\n\nINT.  MARTY, CLOSER\n\nHe would like to believe UNCLE AL... but he doesn't.\n\n\nINT.  OWEN'S PUB  LATE AFTERNOON\n\n\t\tANDY FAIRTON\n\tOkay, you all know what group you're in and\n\twhat area you'll be covering, right?\n\n\t\tPORTER ZINNEMAN\n\tDamn straight!\n\n\t\tELMER ZINNEMAN\n\tShut up, Porter.\n\nThe men are all dressed in hunting clothes-\nred-and-black-checked shirts, orange caps, etc. They all\nhave guns. Among their number are a few women as well,\nlooking tough and determined. We see almost everyone we've\nmet up to this point. LOWE is there, looking deeply\ntroubled.\n\nANDY FAIRTON is standing on the bar. These are his\nvigilantes; he has organized them. ANDY radiates male macho\nfootball-coach confidence. He's mesmerized the crowd: they\nreally believe they are going to go out and Shoot One for\nthe Gipper.\n\n\t\tANDY\n\tGroups one through four are in the woods\n\tnorth of the Sturmfuller place. Five and\n\tsix west of Carson Creek.\n\nThe door at the back opens; HALLER and PETE come in. JOE\nHALLER is in extremely bad shape. He hasn't come back much\nfrom the murder of BRADY. I believe he is having some sort\nof spiritual crisis, and while it is not our purpose to\nexplore what it might be- this is, after all, a horror movie\nand not a John Cassavetes film- we can see that it has\nseriously weakened his authority.\n\n\t\tANDY (continuing)\n\tMoonrise at 8:52 p.m.\n\nSome nervous laughter greets this. Meanwhile, HALLER and\nPETE are working their way to the front, where they end up\nnext to a grim-faced HERB KINCAID.\n\n\t\tANDY (continuing)\n\tIf he comes out to stroll in the moonlight\n\ttonight, we're going to get the sorry sucker.\n\n\nINT.  THE VIGILANTES, WITH ELMER AND PORTER\n\n\t\tPORTER (happily)\n\tDamn straight!\n\n\t\tELMER\n\tShut up, Porter.\n\n\nINT.  ANDY FAIRTON\n\n\t\tANDY\n\tJust remember, it's the psycho we want, not\n\teach other. So look before you-\n\n\nINT.  THE CROWD, FEATURING HALLER\n\n\t\tHALLER\n\tI want all of you folks to go home!\n\nA disgruntled murmur meets this. HALLER moves forward a bit,\nand turns to face them.\n\n\t\tHALLER\n\tI can't remember deputizing a single one\n\tof you!\n\n\nINT.  ANDY FAIRTON\n\n\t\tANDY\n\tThat's right, Joe- the only deputy you got is\n\tthat fat shitbag beside you, and neither one\n\tof you has done a damn thing about solving\n\tthis case.\n\nThere is a mutter of agreement.\n\n\nINT.  A SLIGHTLY WIDER SHOT, FEATURING ANDY AND HALLER\n\nANDY hops off the bar to face HALLER directly. In the b.g.\nwe see HERB KINCAID (KINCAID, by the way, should be wearing\na black armband- he's come directly from his son's funeral).\n\n\t\tHALLER (without much force)\n\tWe'll catch him.\n\n\t\tANDY\n\tYou couldn't catch a cold.\n\nHALLER looks at him for a moment, then turns to look at the\ncrowd. They look rather like a lynch mob; on their faces we\nsee an uneasy mix of shame and eager determination. HALLER\nspeaks with a kind of haggard, fading desperation.\n\n\t\tHALLER\n\tThe law has a name for what you men are\n\tplanning. It's private justice, and private\n\tjustice is about a step and a half away\n\tfrom lynch mobs and hang ropes. I'm no\n\tJ. Edgar Hoover, but I am the law in Tarker's\n\tMills, and I want you men to go home.\n\nThey shuffle their feet uneasily; many look down. He is\ngetting to them.\n\n\t\tANDY\n\tDon't let this guy scare you! What's he done\n\tsince this thing started but hang his face out?\n\nIt's not working. Many of the men look disgusted with both\nANDY and themselves.\n\n\t\tANDY (louder)\n\tHe ain't got so much as a fingerprint!\n\n\t\tOWEN KNOPFLER\n\tAh, shut up, Andy.\n\n\t\tANDY\n\tDon't tell me to-\n\nHERB KINCAID steps forward.\n\n\t\tHERB\n\tYes. Correct. Shut up.\n\nANDY, surprised and bewildered, does. HERB turns and looks\ngrimly at JOE HALLER, who can barely meet his gaze.\n\n\t\tHERB (quietly)\n\tI just came from my boy's funeral.\n\n\t\tHALLER\n\tHerb...I know how upset- how grief-stricken\n\tyou must be...but-\n\n\t\tHERB (quietly)\n\tHe was torn apart.\n\nUtter silence in OWEN'S place now. The others are staring,\nrapt.\n\n\t\tHALLER\n\tYes. Yes, but-\n\n\t\tHERB (still quiet)\n\tUpset, you say. Grief-stricken, you say.\n\tConstable, you don't know what those words\n\tmean. My son was torn to pieces. To pieces!\n\nHERB turns to the others in the pub. Tears stream down his\nface.\n\n\t\tHERB\n\tMy son was torn to pieces!\n\t\t(turning back to HALLER)\n\tYou come in here and talk to these men\n\tabout private justice. You dare to do that.\n\tConstable Haller, why don't you go out to\n\tHarmony Hill and dig up what's left of Brady\n\tand explain to him about private justice.\n\tWould you want to do that?\n\nHALLER makes no reply. He looks down at his feet.\n\n\t\tHERB\n\tNo. I thought not.\n\t\t(to the others)\n\tYou folks stay here if you want. I wouldn't\n\task anyone to do anything that runs counter\n\tto his conscience. As for me... I'm going out\n\tand hunt up a little private justice.\n\nANDY FAIRTON has swelled up again. He grins poisonously at\nthe slumped HALLER. He pushes off after HERB KINCAID. Other\nmen start to follow.\n\n\nEXT.  OWEN'S PUB\n\nMen are streaming out, getting into station wagons and\npickup trucks. Engines roar into life. They begin backing\nout even as more men come out of the pub. We even hear some\nhigh-spirited yells; they are on their way and their blood\nis up.\n\n\nINT.  OWEN'S PUB\n\nLESTER LOWE, looking more distressed than ever, pushes his\nway through the men toward the door, and THE CAMERA FOLLOWS.\nHe grabs BILLY McCLAREN.\n\n\t\tLOWE\n\tBilly... Billy, this is a bad idea. Joe can...\n\n\t\tBILLY (not looking at LOWE)\n\tJoe's had his chance, Father. Leave me be.\n\nHe pushes outside. LOWE looks around wildly; his face says\nhe can't believe this is happening. He grabs PORTER\nZINNEMAN, then, as PORTER shoves by him, at a couple of\nothers with mounting desperation.\n\nHALLER makes his way to LOWE through the thinning crowd and\ndraws him aside.\n\n\t\tHALLER\n\tLet them go.\n\n\t\tLOWE\n\tBut-\n\n\t\tHALLER\n\tThis is that spirit of community you were\n\ttalking about. Grand, ain't it? Maybe they'll\n\tshoot a hitchhiker or something and Andy can\n\tmount the head and raffle it off. To benefit\n\tthe Medcu van, of course.\n\nHALLER laughs.\n\n\t\tLOWE\n\tBut can't we do anything?\n\nOWEN KNOPFLER hurries past them; he has a rifle over one\nshoulder in a sling. In his left hand he carries the\npeacemaker bat.\n\n\t\tHALLER\n\tSure. We can pray to Christ that none of them\n\tget killed.\n\n\nEXT.  OUTSIDE OWEN'S\n\nMore cars and trucks pull away. There's a big old Ford\n\"woody\" wagon still there, with ANDY FAIRTON standing\nimpatiently by the driver's side door. BILLY McCLAREN and\nBOBBY ROBERTSON are with him, and a big, solid-looking woman\nnamed MAGGIE ANDREWS.\n\nOWEN comes out and crosses to the woody.\n\n\t\tANDY\n\tWell, it's about frigging time! They'll\n\thave his hide tacked to somebody's barn\n\tdoor before we get out there!\n\nThey pile into the car, ANDY behind the wheel. He throws it\ninto gear and backs out onto Main Street.\n\n\nEXT.  MAIN STREET, A NEW ANGLE\n\nWe see a parade of cars and pickup trucks headed out of\ntown.\n\n\nEXT.  FATHER LESTER LOWE\n\nHe's standing on the curb and watching them leave town in\nprocession, some honking their horns, others yelling\ncheerfully. The expression on his face is dark and brooding.\n\n\nEXT.  THE FULL MOON, CU  NIGHT\n\n\nEXT.  ELMER AND PORTER ZINNEMAN  NIGHT\n\nELMER is lying on his belly, stuck halfway under a\nbarbed-wire fence. The seat of his pants is badly snagged.\nThe brothers are on the verge of a wooded area. We can see\nground mist creeping around the bottoms of the trees.\n\n\t\tELMER\n\tHelp me Porter, goddammit!\n\nPORTER grabs ELMER'S right arm and pulls. There's a RIPPING\nSOUND. ELMER screams.\n\n\t\tELMER\n\tDon't pull me! You want to rip the right\n\tcheek of my ass right off?\n\n\t\tPORTER\n\tWell, Elmer, there are folks that'd say\n\tyou've been half-assed most of your-\n\n\t\tELMER\n\tAre you going to unhook me or be a wise guy?\n\nPORTER begins to pick the barbed wire out of ELMER'S pants.\n\n\nEXT.  IN THE WOODS, WITH REV. O'BANION AND VIRGIL CUTTS\nNIGHT\n\nO'BANION looks rather amusing in his hunting gear- like that\npriest from \"The Exorcist\" on safari.\n\nSOUND: A HOWL, FAIRLY LOUD\n\n\t\tVIRGIL\n\tJesus, that was close. Uh, pardon me, Rev'runt.\n\n\t\tO'BANION\n\tCome on. Be careful.\n\nThey move slowly ahead, O'BANION still a bit in the lead.\nTHE CAMERA FOLLOWS as the reverend pushes into some\nknee-high brush.\n\nSOUND: A RUSTY METALLIC CLANG, followed by a FLESHY CHOMP.\n\nO'BANION begins to scream and struggle.\n\n\t\tVIRGIL\n\tRev'runt! What is it?\n\n\t\tO'BANION (screaming)\n\tMy foot! My foot!\n\nVIRGIL lunges to him and looks down.\n\n\nEXT.  O'BANION'S FOOT, VIRGIL'S POV\n\nA medium-sized trap- something in which one might reasonably\ncatch a wild cat or a coydog, let us say- has its rusty\nteeth sunk deeply into the reverend's ankle.\n\n\nEXT.  O'BANION AND VIRGIL\n\n\t\tO'BANION (SCREAMING)\n\tGet it off me! Get it off me!\n\n\t\tVIRGIL (flustered)\n\tSure...okay...\n\nHe kneels down.\n\n\nEXT.  VIRGIL\n\nHe muscles the trap open, a little at a time.\n\n\nEXT.  O'BANION\n\nRelaxing.\n\nSOUND: THE WOLF HOWLING CLOSE.\n\n\nEXT.  VIRGIL\n\nStartled and unnerved by the HOWL, the trap slips out of his\nhands and snaps shut on O'BANION'S mangled ankle again.\n\n\nEXT.  REVEREND O'BANION\n\nHe screams.\n\n\nEXT.  THE MOON, CU\n\nIt slides behind a cloud.\n\nSOUND: THE WOLF HOWLING.\n\n\nEXT.  ANDY FAIRTON'S GROUP\n\nANDY, BILLY McCLAREN, BOBBY ROBERTSON, OWEN KNOPFLER, and\nMAGGIE ANDREWS have been joined by two other men- MR.\nASPINALL and EDGAR ROUNDS.\n\nThey have drawn close together, listening as the HOWL FADES.\nWe can tell by their uneasy faces that some of the joy has\ngone out of the evening.\n\nThey are standing on one side of a ravine. The bottom is\nfilled with a still ground mist. A few bushes poke out of\nit. There are woods on the far side.\n\n\t\tANDY (pointing across)\n\tIt came from over there.\n\n\t\tBOBBY ROBERTSON\n\tAs far as I could tell, it could have come\n\tfrom anywhere.\n\n\t\tANDY\n\tWe'll spread out in a skirmish line. If the\n\tbastard tries to go around us, we'll hear him.\n\n\t\tBOBBY\n\tI dunno-\n\n\t\tMAGGIE\n\tI think Bobby Robertson here's making lemonade\n\tin his pants. That lemonade got ice cubes in\n\tit, Bobby?\n\nANDY FAIRTON and EDGAR ROUNDS laugh. ASPINALL and BILLY\nMcCLAREN smile a little.\n\n\t\tOWEN (quietly)\n\tLet off him, Maggie. I'm scared, too.\n\n\t\tBOBBY (stoutly)\n\tI ain't scared! Let's go!\n\n\t\tANDY\n\tOkay. Spread out on me. Five feet apart.\n\n\nEXT.  ANDY'S GROUP, FROM THE BOTTOM OF THE RAVINE\n\nReading from right to left: OWEN KNOPFLER (his gun is still\nover his shoulder; it is the peacemaker baseball bat he is\nholding), BOBBY ROBERTSON, ASPINALL, ANDY FAIRTON, BILLY\nMcCLAREN, EDGAR ROUNDS and MAGGIE ANDREWS.\n\nThey come slowly down toward THE CAMERA, alert and ready for\nanything- at least, they think so.\n\n\nEXT.  ANDY'S GROUP, ANGLE SHOT\n\nThey reach the bottom of the ravine and begin to make their\nway across it. The mist is waist to chest deep. They push\ntoward the other side. Now they are about halfway.\n\nSOUND: A STEADY, LOW GROWLING, CLOSE.\n\nThey all stop, scared.\n\n\t\tBILLY McCLAREN\n\tWhere's it coming from? Other side?\n\n\t\tBOBBY\n\tNo- it's behind us. I told you you couldn't\n\ttrust-\n\n\t\tASPINALL\n\tIt isn't on either side.\n\n\t\tANDY\n\tWhat are you-\n\nASPINALL is looking around, his eyes widening with fear.\n\n\t\tASPINALL\n\tIt's under the fog. It's right in with us.\n\nThe GROWLING STOPS. There's a beat of silence. Then:\n\nSOUND: SNARLING...AND A RIPPING CHOMP as dinner is served.\n\nSOUND: A SCREAM.\n\n\nEXT.  EDGAR ROUNDS, CLOSE\n\nHe's the one screaming, and if he reminds us of O'BANION,\nthat's okay, because ROUNDS has also been caught in a trap.\nHe tries to run, stumbles, falls into the ground fog. He\ngoes on screaming. We can see his back for a moment, and\nthen it disappears.\n\nSOUNDS OF CRUNCHING AND SCREAMING.\n\nROUNDS SHRIEKS. His hand and arm come up like the hand of a\ndrowning man. Then it's gone. ROUNDS is gone.\n\n\nEXT.  THE SKIRMISH LINE\n\nThey stand there, chest deep in mist, a conspicuous hole in\nthe ranks where EDGAR was.\n\n\nEXT.  BOBBY ROBERTSON, CU\n\n\t\tBOBBY (moaning)\n\tI can't move. Christ Jesus, I can't move!\n\n\nEXT.  THE SKIRMISH LINE IN THE RAVINE, A NEW ANGLE\n\nThe GROWLING STARTS AGAIN. THE CAMERA PANS SLOWLY UP THE\nLINE. The mist swirls, hiding whatever's beneath.\n\n\nEXT.  ASPINALL, CU\n\n\t\tASPINALL (low)\n\tI think we better start backing up, Andy.\n\tReal slow. Real-\n\nThe LOW GROWL rises to a snarl. And from below the mist,\nsnarling and bestial but understandable, mocking ASPINALL'S\nvoice:\n\n\t\tWEREWOLF (voice)\n\t\"Real slow! Real slow! Real slow!\"\n\nSOUND: CHOMP!\n\nASPINALL SHRIEKS and tries to run. He falls into the mist.\nThere is another CHOMP. When he flounders up, half his face\nis gone.\n\n\t\tWEREWOLF (voice)\n\t\"Real slow! Real slow!\"\n\nA hairy arm rises from the mist and yanks ASPINALL down.\n\n\nEXT.  ANDY'S GROUP\n\nThey panic and break for it- MAGGIE, BILLY, and ANDY for one\nside, BOBBY and OWEN for the other.\n\n\nEXT.  OWEN, WEREWOLF'S POV\n\nTHE CAMERA IS RUSHING THROUGH THE GROUND MIST- this is like\nbeing in an airplane that's skimming the top of a cloud.\n\n\t\tWEREWOLF (voice; laughing)\n\t\"Real slow! Real slow! Real slow!\"\n\n\nEXT.  OWEN KNOPFLER\n\nHe's hit, as an unlucky swimmer might be hit by a shark. He\nwhirls around, raising the peacemaker bat.\n\n\t\tOWEN\n\tCome on, then! You want to rock and roll\n\twith me?\n\n\nEXT.  THE GROUND MIST, OWEN'S POV\n\nFor a moment there's nothing- and then the werewolf rises\nout of it, eyes glaring green, muzzle and pelt slimed with\ngore.\n\n\t\tWEREWOLF\n\t\"REEEEEL SLOW!\"\n\n\nEXT.  MAGGIE AND ANDY\n\n\t\tMAGGIE (shrieking)\n\tLook at it! Holy God, Andy, look at that thing!\n\n\t\tANDY (groaning with fear)\n\tI don't want to look at it.\n\nHe runs, while MAGGIE stares, mesmerized, at:\n\n\nEXT.  OWEN AND THE WEREWOLF\n\nThe WEREWOLF closes in on OWEN, who belts it a good one with\nthe peacemaker. The WEREWOLF swipes at him. OWEN ducks and\nslams it again. The WEREWOLF roars with anger.\n\n\t\tOWEN\n\tCome on, come on! You want to do the bop?\n\tI'll bop you, motherfucker! Come on!\n\nThe WEREWOLF dives under the ground mist.\n\nUncertain, OWEN begins to back up, holding the bat in his\nhands. OWEN is jerked down into the mist. He SCREAMS. The\npeacemaker rises out of the ground mist and comes down.\nBonk! The WEREWOLF roars in pain. CHOMPING SOUND. OWEN\nshrieks.\n\n\t\tOWEN (voice)\n\tCome on, you bastard!\n\nThe peacemaker rises out of the mist again. The hands\nholding it are bloody. Blood runs down the bat. It descends.\nBonk! The WEREWOLF roars again. There is a GURGLING SCREAM\nfrom OWEN... and then a curious SPLINTERING SOUND as the\nWEREWOLF sinks its fangs into the bat.\n\n\nEXT.  THE RAVINE\n\nTHE CAMERA MOVES ABOVE as the WEREWOLF moves below, escaping\ndown the draw.\n\nPause. SOUND, IN THE B.G.- low but slowly getting louder: a\ncongregation singing \"Bringing In the Sheaves\" to the\naccompaniment of a pipe organ.\n\n\t\tWEREWOLF (sing-songy voice)\n\tBringing in the sheaves... bringing in the\n\tsheaves... we shall come rejoicing... bringing\n\tin the sheaves...\n\nTHE WEREWOLF FADES OUT; human voices singing the same hymn\noverwhelm it and we\n\n\t\t\t\tDISSOLVE TO:\n\n\nINT.  HOLY FAMILY CATHOLIC CHURCH, PULPIT POV  MORNING\n\nIt's an almost exact reprise of #167. Most of the mourners\nare crying; MRS. BOWIE playing the organ; MARTY'S chair\nparked at the back. We can see UNCLE AL, MARTY, TAMMY, and\nMRS. STURMFULLER, exactly as they were at BRADY KINCAID'S\nfuneral; in fact, this seems to be an instant reply of that\nevent. One difference: we can't see BRADY'S coffin. It's\nbelow us. The hymn ends.\n\n\nINT.  FATHER LOWE, IN THE PULPIT\n\n\t\tLOWE\n\tMr. and Mrs. Kincaid have asked that there\n\tbe no mass said here this afternoon. They\n\tdid ask me to say a word of comfort to you\n\tif I could.\n\n\nINT.  THE CONGREGATION, FEATURING HERB KINCAID\n\nHe sits in the first pew. In his grief he looks dead.\n\n\t\tHERB\n\tThere is no comfort, Father. Only private\n\tjustice.\n\n\nINT.  LOWE, AT THE PULPIT\n\nHe's thrown off his stride. Beginning to sweat. He's like an\nactor trying to remember his lines.\n\n\t\tLOWE\n\tUh, if there's any word of comfort I can\n\tgive you, it's just this: the face of the\n\tbeast always becomes known; the time-\n\nHe looks down. His eyes widen in fear.\n\n\nINT.  THE COFFINS, LOWE'S POV\n\nYes, that's coffins- plural. Where BRADY'S coffin was\nformerly, there are now six coffins, smothered with flowers.\n\n\nINT.  LOWE, IN THE PULPIT\n\nHe is badly scared now; sweat is dripping off him.\n\n\t\tLOWE\n\tThe time... the time of the beast always\n\tpasses. There are answers... ways... ways\n\tto... to cope... if we turn to each other...\n\n\t\tHERB (bestial voice)\n\tFather-\n\nLOWE looks toward:\n\n\nINT.  FIRST ROW PEW, WITH HERB KINCAID, LOWE'S POV\n\nHe's looking down at something in his hands. Now he looks up\nand we see his face has become bestial. His eyes are green.\nAs we look at him, the transformation cotinues. He's turning\ninto a werewolf.\n\n\t\tHERB (snarling)\n\tIt tore out his heart.\n\nAnd sure enough, HERB KINCAID holds BRADY'S dripping heart\nup in what were hands but which are now rapidly becoming\npaws.\n\n\nINT.  LESTER LOWE, AT THE PULPIT\n\nHe staggers back, in terror.\n\n\t\tLOWE (shrieks)\n\tNo!\n\n\nINT.  THE CONGREGATION, LOWE'S POV\n\nMRS. BOWIE begins bringing in a few more sheaves on the\nchurch organ, and the congregation begins to sing.\n\n\t\tCONGREGATION\n\tSowing in the morning/sowing seeds of\n\tkindness/sowing in the noontide/and the\n\tdewy eve...\n\nWe pan their faces, stopping on JOE HALLER. Now something is\nhappening to JOE'S face. It is bulging, changing. He looks\nup from his hymnal and his eyes glare green. The pupils are\nsplit. He grins, showing big teeth.\n\nThey are all changing. Among the things we see are:\n\nPETE SYLVESTER, who is a church deacon, rushing down the\naisle, changing, snarling. He grabs ANDY FAIRTON and the two\nof them grapple in the aisle.\n\nA YOUNG WOMAN with a baby in her arms turns back the blanket\ncovering the baby's face and we see it's a wolfling; already\nthe YOUNG WOMAN'S own hands are turning into claws.\n\nTAMMY STURMFULLER changing; PELTZER the druggist changing;\nthe ZINNEMAN BROTHERS changing.\n\nAt the organ, MRS. BOWIE is now a werewolf clad in tatters\nof a silk bombazine dress; she/it is still wearing a veiled\nhat on her head, and she is beating the shit out of the\norgan keys with her clawed hands. She sounds like Jerry Lee\nLewis after swallowing about a dozen bennies. And now the\ntune changes from the remnants of \"Bringing In The Sheaves.\"\nIt changes into the Rheingold jingle.\n\n\t\tCONGREGATION (snarling chorus)\n\tMy beer is Rheingold the dry beer...\n\tThink of Rheingold whenever you buy beer...\n\n\nINT.  LOWE\n\nFATHER LOWE goes stumbling backward, dropping his hymnal.\nThe man is in an extremity of terror.\n\n\t\tREV. LOWE\n\tNo! No! No!\n\n\nINT.  THE CONGREGATION, LOWE'S POV\n\nSome are tearing their hymnals apart and throwing them at\neach other. One guy- BILLY McCLAREN, maybe- wings one of\nthem through a stained-glass window. Some of the werewolves-\nfor they are all werewolves now- fight or make love in the\naisles. The rest sway back and forth, grinning ferociously,\nsinging.\n\n\t\tCONGREGATION (snarling it out)\n\tIt's not bitter, not sweet, it's a real\n\tfrosty treat...\n\n\nINT.  LOWE\n\nHe looks toward:\n\n\nINT.  THE MRS. BOWIE WEREWOLF, AT THE ORGAN\n\nShe grins ferociously up at him, playing the Rheingold\njingle on the pipe organ with her claws. Now blood begins to\nbubble up between the keys.\n\n\t\tMRS. STURMFULLER AND ALL\n\tWon't you try, won't you buy...\n\n\nINT.  THE ENTIRE CONGREGATION\n\nThe church is a wild shambles of lurching, fighting, singing\nwerewolves. It's like a New Year's Eve party in hell.\n\n\t\tCONGREGATION (big finish)\n\t...Rheiinngold beer!\n\nSuddenly a clawed hand burts up through one of the coffins.\nAnd ANDY FAIRTON, who now looks as wolflike as any of them,\nbites the hand's claw off.\n\n\nINT.  REV. LOWE, ON THE PODIUM\n\nHe's seen all he can stand. He whirls for the back, where\nthere is a small door. He pulls it open... and a BRADY\nKINCAID werewolf, half torn apart but still somehow alive (a\nzombie werewolf, if you can dig it- George Romero would like\nit, I think) leaps out and seizes LOWE.\n\nBRADY buries his muzzle in LOWE'S NECK.\n\n\nINT.  LESTER LOWE, ECU\n\nHe sits up into THE CAMERA and SCREAMS. Sweat is running\ndown his face. He stares at us for a moment, his eyes buggy\nand crazed... and then he closes them. There is an\nexpression of huge relief on his face as he does so.\n\n\t\tLOWE (praying)\n\tLet it end, dear Lord. Let it end. Please\n\tlet it end.\n\n\nEXT.  MAIN STREET  DAY\n\nAn old sedan cruises slowly down the street. ANNE and TAMMY\nSTURMFULLER are in the front seat. It's piled high with\npossessions and is towing a jackleg trailer with more stuff\nin it.\n\n\nEXT.  HALLER AND PETE\n\n\t\tHALLER (indifferently)\n\tAnne Sturmfuller and her little girl.\n\n\t\tPETE\n\tYeah... but what are they doing?\n\n\t\tHALLER\n\tPutting on my Sherlock Holmes deerstalker\n\tcap, I deduce that they are leaving.\n\n\nEXT.  THE STURMFULLER CAR, THE COPS' POV  DAY\n\nThey are headed out of town all right, but the thing which\nperhaps strikes us the most forcibly is how empty this place\nis now. Main Street looks like a ghost town.\n\n\nEXT. JOE HALLER AND PETE SYLVESTER, ON THE SIDEWALK\n\n\t\tHALLER\n\tShe's not the only one. Lot of people\n\tleaving town. And I guess if we want a\n\tbeer, we'll have to drink it at home.\n\nHe nods toward:\n\n\nEXT.  OWEN'S PUB, LONG (PETE AND HALLER'S POV)\n\nA CLOSED sign hangs in the door; above it is a big black\nwreath.\n\n\nEXT.  HALLER AND PETE\n\n\t\tPETE\n\tJoe, what's wrong with you? I ain't\n\tnever seen you like this.\n\n\t\tHALLER (thoughtful)\n\tI lost my guts.\n\n\t\tPETE (startled)\n\tBullshit.\n\n\t\tHALLER\n\tIt was the Kincaid boy. I looked at him...\n\tand I felt it happen. It was no big deal.\n\tNo worse than pissing down your own leg.\n\tYou ever do that? Maybe when you were\n\treal scared?\n\nPETE, distressed, does not respond.\n\n\t\tHALLER\n\tOne minute I had me some guts- as much as\n\tthe next man, anyhow- and then, poof. Gone.\n\nPETE'S looking at him in a kind of terror.\n\n\t\tPETE\n\tJoe... you are going to feel better than\n\tthis. This... this feeling of yours...\n\tit's gonna pass...\n\n\t\tJOE\n\tIs it?\n\nHe walks away, back toward the Municipal Building (the sign\nout front reminds folks to SUPPORT THE MEDCU VAN!) while\nPETE looks after him, very deeply troubled.\n\n\nEXT.  A FAIRGROUND  DAY\n\nIt's deserted. Rides stand still. The midway is deserted.\n\nTHE CAMERA PANS slowly to a sign which reads TARKER'S MILLS\nFAIRGROUNDS GALA FAIR OCTOBER 1 FIREWORKS AT DUSK 10c ON\nEVERY DOLLAR GOES TO THE MEDCU VAN FUND!\n\nA cheerful enough sign, except for the strip of paper glued\ndiagonally across it: FIREWORKS CANCELED.\n\t\tMARTY (voice)\n\tIt's not fair.\n\n\nINT.  THE COSLAW FAMILY STATION WAGON  DAY\n\nIt's parked across the road from the sign.\n\n\t\tJANE (voice)\n\tLook out, world! Marty the Great didn't\n\tget something he wanted!\n\nThey are distributed just as they were when they arrived at\nthis same fairgrounds earlier. All of them have ice cream\ncones; they are coming home from a family outing.\n\n\t\tNAN COSLAW\n\tStop it, Jane.\n\n\t\tJANE\n\tWell, I don't see why everybody just about\n\tbreaks down and cries whenever he-\n\n\t\tBOB\n\tStop it, your mother said.\n\nThey've just paused for a quick look at the sign; now BOB\npulls out onto the road again and heads toward home.\n\n\nINT.  MARTY AND JANE IN THE BACKSEAT\n\nJANE sticks her tongue out at him. MARTY looks away.\n\n\nEXT.  ANGLE ON THE COSLAW GARAGE  DAY\n\nUNCLE AL'S sports car is parked in the driveway. We hear the\nCLANG of a wrench on the cement inside.\n\n\nINT.  THE GARAGE  DAY\n\nUNCLE AL and MARTY are working on the engine of the Silver\nBullet. UNCLE AL has a six-pack of beer that he's working\nthrough. He and MARTY sit on the floor. As they talk, UNCLE\nAL unscrews the last bolt holding the Bullet's carburetor\nand pulls it off.\n\n\t\tMARTY\n\tIt isn't enough that the monster killed all\n\tthose people- that he killed Brady. Now he's\n\tgot them to cancel the fair.\n\n\t\tUNCLE AL\n\tAnd the fireworks. Hand me that box, Marty.\n\nMARTY hands him a medium-sized carton with the words \"Speed\nShop\" printed on it.\n\n\t\tMARTY\n\tYeah, okay, the fireworks. Jane thinks that's\n\tall I'm mad about, but it's not. Them doing\n\tthat is just a... a...\n\n\t\tUNCLE AL\n\tIt's just an outward symbol of everything\n\tthat's inwardly wrong in this town. Not\n\tbad, huh? I read Sherwood Anderson in\n\tcollege. I can jive that shit all day.\n\n\t\tMARTY\n\tWell... I like it that you always know how\n\tto say things, Uncle Al.\n\n\t\tUNCLE AL\n\tI'll give you the telephone numbers of my\n\tex-wives, dear boy- they'll be interested\n\tto hear that.\n\n\t\tMARTY\n\tDon't call me dear boy.\n\n\t\tUNCLE AL\n\tBut you are, you know- you are my dear boy.\n\nHe gives MARTY a kiss and smiles at him. MARTY smiles back.\n\n\t\tUNCLE AL\n\tLook at this.\n\nHe pulls out a brand-new carburetor- it's a chrome-plated\nfour-barrel.\n\n\t\tUNCLE AL (gleeful)\n\tThis is gonna turn your wheelchair into\n\ta fucking F-14, Marty-\n\nHe looks around quickly, guiltily.\n\n\t\tUNCLE AL\n\tYour mom's not around, is she?\n\n\t\tMARTY\n\tShe and dad are out back lighting the\n\tbarbecue. Jane's walking around like she's\n\tKing Shit of Turd Mountain. Like always.\n\n\t\tUNCLE AL\n\tUh-huh. Only in her case I guess it would be\n\tQueen Shit of Turd Mountain. Hand me that\n\tadjustable.\n\nMARTY does. UNCLE AL slides the carb onto the gasket and\nstarts attaching bolts.\n\n\t\tUNCLE AL\n\tThe guy killed your best friend, drove your\n\tgirl out of town, and stole the second-best\n\tholiday in the year. Have I got it right?\n\n\t\tMARTY (glum)\n\tYou got it right, Uncle Al.\n\n\t\tUNCLE AL\n\tYeah, Winesburg, Ohio, was never like that...\n\tbut I got something that just might cheer\n\tyou up.\n\n\t\tMARTY\n\tWhat?\n\n\t\tUNCLE AL\n\tWait, dear boy. Just wait. Hand me those pliars.\n\n\nEXT.  UNCLE AL, AT THE SIDE OF THE COSLAW HOUSE  DAY\n\nHe peeks into the backyard.\n\n\nEXT.  THE BACK YARD, UNCLE AL'S POV\n\nBOB and NAN are fussing over the barbecue. JANE is hitting a\nbadminton birdie.\n\n\nEXT.  THE ROAD IN FRONT OF COSLAWS', WITH MARTY\n\nMARTY is sitting in the Silver Bullet.\n\nUNCLE AL comes hurrying back from his look-see.\n\n\t\tUNCLE AL\n\tAll is cool, Marty-boy. Go for it.\n\nMARTY pushes the starter. The engine starts at once, but the\ntone is entirely different. Before, MARTY'S wheelchair was a\npoppety-popping pussycat. Now the engine rumbles like a\nhood's street rod idling at a traffic light.\n\nMARTY looks startled.\n\n\t\tUNCLE AL (grinning)\n\tGun it.\n\nMARTY guns it. The engine roars.\n\n\t\tUNCLE AL\n\tJesus! Not too much!\n\n\t\tMARTY (awed)\n\tWow.\n\n\t\tUNCLE AL\n\tYou got a pilot's license, Marty?\n\n\t\tMARTY\n\tDo I need one?\n\n\t\tUNCLE AL\n\tWe're gonna find out. Take it down the\n\troad a ways and back. Be careful.\n\nMARTY puts the Bullet in gear and pulls away.\n\n\nEXT.  MARTY, IN THE SILVER BULLET\n\nCAMERA TRACKS HIM up the road. He goes slowly at first, but\nhe lets it out a little after a while. He's really moving\nalong- thirty, maybe forty miles an hour. The wind blows the\nhair off his forehead. He begins to grin. He's enjoying\nthis.\n\n\nEXT.  UNCLE AL, WATCHING\n\nHe drinks some beer. He's grinning, happy for MARTY.\n\n\nEXT.  MARTY, IN THE SILVER BULLET\n\nHe slows down, turns, stops. He revs the engine. VROOM!\nVRROOM!\n\n\nEXT.  THE SILVER BULLET'S MOTOR, CU\n\nA lot of changes back here. It looks almost like a motorcyle\nengine now. That chromed-silver carb predominates.\n\nSOUND: VAROOOOOOOM!\n\n\nEXT.  MARTY, CU\n\nGrinning. Looking at:\n\n\nEXT.  THE COSLAW HOUSE, MARTY'S POV\n\nIt's about a quarter of a mile away.\n\n\nEXT. MARTY, IN THE SILVER BULLET\n\nHe winds the engine up and pops the clutch. The Silver\nBullet doesn't so much accelerate as blast off. It tilts\nback on its wheels. MARTY swivels into a position like that\nof an astronaut on lift-off. The Silver Bullet looks like a\nmotorcycle popping a wheelie. MARTY has a great big grin on\nhis face.\n\n\nEXT.  THE SILVER BULLET, MEDIUM-LONG\n\nRoaring down the highway at fifty or better, blue smoke\njetting from the exhaust. MARTY is plastered back in the\nseat with the footrest pointing up at an angle. He's\nlaughing like a lunatic.\n\n\nEXT.  UNCLE AL, PEEKING THROUGH HIS FINGERS\n\n\t\tUNCLE AL (to himself)\n\tThe kid's dead meat. What have I done?\n\t\t(shouts)\n\tPut a rock in it, Marty!\n\n\nEXT.  MARTY IN THE BULLET\n\nHe uses the hand brakes. SOUND of braking and squealing\nrubber.\n\n\nEXT.  MARTY AND UNCLE AL\n\nThe Silver Bullet comes to a screeching, sluing stop near\nUNCLE AL. Blue smoke drifts up from the wheels. MARTY guns\nthe engine once and then lets it idle.\n\n\t\tUNCLE AL\n\tYou gave me a heart attack, Marty. I'm\n\tdying. I hope you're happy, because you\n\tare looking at a dying man.\n\n\t\tMARTY\n\tIt really goes fast. Thanks, Uncle Al.\n\n\t\tUNCLE AL\n\tIt goes fast, all right- and if your mother\n\tfinds out just how fast, Marty, I will have\n\ta new job. Singing soprano with the Vienna\n\tBoys' Choir.\n\n\t\tMARTY\n\tI don't get you.\n\n\t\tUNCLE AL\n\tI know you don't. But I want this to be our\n\tsecret. You get that, don't you?\n\n\t\tMARTY\n\tSure.\n\n\t\tUNCLE AL\n\tGood.\n\n\nEXT.  THE NIGHT SKY, WITH THE MOON\n\nThe last bit of daylight is just filtering away.\n\n\nEXT.  THE COSLAW BACKYARD\n\nThe barbecue is over. BOB and JANE are putting lawn chairs\non the back porch. MARTY, NAN, and UNCLE AL are all in the\nf.g.\n\n\t\tUNCLE AL\n\tI've got to go, Nan- I had a wonderful time.\n\nHe kisses her cheek affectionately, and she smiles at him.\n\n\t\tNAN\n\tSo have I, actually... I wish it could always\n\tbe like this.\n\n\t\tUNCLE AL\n\tSee me around to my car, Marty, and make sure\n\tI stay out of trouble at least that long.\n\n\t\tMARTY\n\tOkay.\n\nHe and UNCLE AL go around to the driveway. NAN looks at them\nwith troubled love.\n\n\nEXT.  THE COSLAW DRIVEWAY, WITH MARTY AND UNCLE AL\n\n\t\tUNCLE AL\n\tNow I said I had something for you, as\n\tI believe you will recall.\n\n\t\tMARTY\n\tYeah! What is it?\n\nAL unlocks the trunk of his car and brings out a paper\nshopping bag. He places the bag in MARTY'S lap. MARTY opens\nthe bag, but it's really too dark to see inside. He reaches\nin and brings out a handful of assorted fireworks- crackers,\nRoman candles, twizzers, smoke bombs, etc.\n\nAn expression of sublime delight fills MARTY'S face as he\ninventories these goodies.\n\n\t\tUNCLE AL\n\tYou're gonna have the Fourth of July in\n\tOctober, Marty. Just don't blow your head\n\toff. (Pause) And remember that it isn't\n\tjust the fireworks. It's because no crazy\n\tshithead should be able to stop the good\n\tguys, if you can dig that.\n\n\t\tMARTY (respectfully)\n\tI can dig it- thank you, Uncle Al! Thank you!\n\n\t\tUNCLE AL\n\tStay near the house, for Christ's sake-\n\tsomeone's killing people. I have to be out of\n\tmy mind to be doing this, you know.\n\n\t\tMARTY\n\tYeah, I know. It's great!\n\n\t\tUNCLE AL\n\tOne of the reasons I love you, Marty, is that\n\tyou're almost as crazy as I am. Please don't\n\tset off anything that goes bang tonight, okay?\n\tJust bright colors. Can you tell the difference?\n\n\t\tMARTY\n\tYeah... sure.\n\n\t\tUNCLE AL\n\tSave this one for last.\n\nHe brings out a short rocket with stubby vanes on the end. A\nfat fuse sticks out behind the head.\n\n\t\tMARTY\n\tWhat is it?\n\n\t\tUNCLE AL\n\tA tracer. You'll like it.\n\n\t\tMARTY\n\tThanks a million, Uncle Al!\n\n\t\tUNCLE AL\n\tYou're welcome a million, Marty. Stick 'em\n\tin the bushes for now.\n\nMARTY motors over to the side of the garage, where there's a\nline of bushes, and conceals the bag in them. UNCLE AL gets\nin his car and starts it up. MARTY comes back.\n\n\t\tUNCLE AL (grinning)\n\tHave a good time, dear boy! And watch out\n\tfor the werewolves!\n\nHe leaves. MARTY sits in his wheelchair, waving.\n\n\nEXT.  THE REAR OF THE COSLAW HOUSE  NIGHT\n\nThere's a downspout outside one of the upstairs windows. Now\nthe window goes up and MARTY leans out. He grasps the\ndownspout and begins working his way down. This should not\nbe too hard for us to believe; we've already seen how strong\nMARTY'S arms are.\n\nHis legs dangle limply, but he's doing just fine. When he\nreaches the bottom of the drainpipe, they simply crumple\nunder him and he uses his arms to pull himself over to the\nback porch.\n\nMARTY hoists himself over the porch rail. Here, under a\ntarp, is the Silver Bullet. MARTY pushes the tarp aside and\ngets in. He uses his hands on the wheels to get over the\nporch ramp and rolls silently down it. At the bottom he\nlooks up at:\n\n\nEXT.  AN UPSTAIRS WINDOW, MARTY'S POV  NIGHT\n\nStill a light on up there.\n\n\nEXT.  MARTY, IN THE BULLET\n\n\t\tMARTY (whispers)\n\tShit!\n\nThinks a bit, then starts to hand-roll the Bullet toward:\n\n\nEXT.  THE PATH BETWEEN THE HOUSE AND THE GARAGE\n\nMARTY comes slowly up the path. We hear soft grunts of\nexertion; he's still hand-turning the wheels for the sake of\nsilence, and it's hard work. He stops at the line of bushes\nand gets the bag of fireworks. He puts it on his lap and\nstarts moving again.\n\n\nEXT.  THE COSLAW DRIVEWAY, FROM THE ROAD\n\nThe driveway has a slight downslant, and MARTY coasts easily\nout to the road. He turns right and begins to roll slowly\nalong the verge of the highway, still using his hands. We\ncan see that the light is still on upstairs. MARTY turns\nback once to verify this himself, then keeps on going. He's\nnot going to be deprived of his treat.\n\n\nEXT.  MARTY\n\nHe decides he's far enough away to be safe. He pushes the\nstarter button. The engine cranks, coughs, and cranks some\nmore. MARTY frowns, and pulls out a wire- a rudimentary\nchoke, I suppose. He pushes the starter button again. It\ncranks, but doesn't start.\n\nMARTY pushes in the wire, looking concerned now, and tries\nagain. This time, after the engine has cranked over a few\ntimes, it starts.\n\n\t\tMARTY (softly)\n\tAll right!\n\nHe puts it in gear and starts off.\n\n\nEXT.  THE ROAD, WITH MARTY, EXTREMELY LONG\n\nWhat we see is a tiny boy in a tiny wheelchair moving along\na dark, empty ribbon of road under a vast dome of stars.\n\nDISTANT SOUND: The Bullet's engine.\n\n\nEXT.  A ROADSIDE TURNOUT  NIGHT\n\nSOUND: Fast-rushing water.\n\nThe turnout is packed dirt. There's a grove of trees with\npicnic tables spotted among them at the back. The sign in\nthe extreme f.g. reads ROADSIDE REST AREA at the top; AUGER\nFALLS in the middle; TOWNSHIP OF TARKER'S MILLS at the\nbottom.\n\nSOUND: The Silver Bullet approaching.\n\nMARTY turns in and rolls to the back of the rest area. He\nstops by one of the picnic tables and dumps the bag of\nfireworks out onto the picnic table and takes his time\nselecting the first- he's like a wine fancier with a whole\ncellar of rare bottles to choose from. At last he chooses a\ntwizzer. He takes matches from the pocket of his pajama top\nand lights the fuse.\n\nWhen it starts to fizz, MARTY tosses it high into the air.\n\n\t\tMARTY (soft)\n\tHere's one for the good guys!\n\n\nEXT.  THE TWIZZER\n\nIt flies in an arc over the drop.\n\n\nEXT.  THE TWIZZER, FROM THE BOTTOM OF THE CUT\n\nTHE CAMERA TRACKS ITS FALL onto some rocks at the edge of\nthe waterfall's catch pool.\n\nSOUND: Growling.\n\n\nEXT.  THE CREEK, WITH THE WEREWOLF\n\nIt has been drinking from the creek. It looks more than half\nhuman now- we would be able to recognize it for sure, but\nits face is in shadow.\n\nIt turns from the creek and gets up on its hind legs.\n\n\nEXT.  THE TWIZZER, ON THE ROCKS\n\nIt's guttering out. A hand-paw touches it and draws back\nquickly.\n\nSOUND: Hurt, angry growl.\n\n\nEXT.  MARTY, IN THE REST AREA\n\nHe's getting ready to light one of the fountains. He pauses\nand looks toward the cut. He's heard something- but the\nwaterfall muffles it. He lights the fountain's fuse, sets it\non the ground, and rolls the Bullet back a few feet.\n\nThe fountain bursts into a shower of light.\n\n\t\tMARTY (delighted)\n\tAll right!\n\n\nEXT.  THE SLOPE OF THE CUT, MEDIUM LONG\n\nThe waterfall is in the b.g.\n\nThe WEREWOLF is climbing the rocky slope.\n\n\nEXT.  THE FOUNTAIN, CU\n\nIt goes out.\n\n\nEXT.  MARTY\n\nHe rolls over to the picnic table and gets a Roman candle.\nHe plants the stick in the ground and lights the fuse. The\nRoman candle shoots into the sky.\n\n\nEXT.  THE ROMAN CANDLE\n\nBursts into colored light.\n\n\nEXT.  THE WEREWOLF, NEAR THE TOP OF THE CUT, MEDIUM LONG\n\nIt GROWLS... and shakes its fists at the fading light in the\nsky.\n\n\nEXT.  MARTY\n\nHe's holding another fountain in one hand and his matches in\nthe other. He's looking toward the cut and the waterfall.\n\n\t\tMARTY\n\tIs someone there?\n\n\nEXT.  THE WEREWOLF, NEAR THE TOP OF THE CUT\n\nIt freezes, GROWLING FAINTLY.\n\n\nEXT.  MARTY\n\nWith a little shrug, he lights the fuse on the fountain and\nsets it on the ground, as before.\n\n\nEXT.  THE BACK OF THE GROVE, AT THE TOP OF THE CUT\n\nClaw-hands settle over the top.\n\n\nEXT.  THE FOUNTAIN, CU\n\nIt throws off fiery swirls of sparks, then begins to die\ndown.\n\n\nEXT.  MARTY\n\nHe's checking out the stuff on the table for his next choice\nwhen he hears a clear SOUND: A SNAPPING, SPLINTERING BRANCH.\n\n\nEXT.  THE GROVE, WITH THE WEREWOLF\n\nIt's run into a low-hanging branch. Instead of pushing it\naside or ducking under it, it simply rips it off the tree.\nAlthough the branch is pretty big, the WEREWOLF does this as\neasily as a hungry man might rip a drumstick off a\nThanksgiving turkey. It throws the branch aside and\nadvances, hunched over on two legs.\n\n\nEXT.  MARTY\n\n\t\tMARTY (terrified)\n\tWho's there?\n\n\nEXT.  THE GROVE AT THE BACK OF THE REST AREA, MARTY'S POV\n\nThe grove is a darkened shadowland.\n\n\nEXT.  MARTY\n\nHe punches the Bullet's starter. The motor cranks and\ncranks. No go, though. MARTY pulls out the choke wire,\nalternating terrified stares at the grove of trees with\nterrified stares at his rudimentary dashboard.\n\n\nEXT.  THE GROVE, MARTY'S POV\n\nHere it comes, out of the shadows, closing in.\n\n\nEXT.  MARTY\n\nWorking that starter for all it's worth... but the motor\nonly cranks. Still no start.\n\n\nEXT.  CLAWED, FURRY FEET\n\n\nEXT.  MARTY\n\nHe gives up on the motor. He looks toward the picnic table\nwhere the fireworks are. He grabs up the tracer. He gets the\nmatches out of the breast pocket of his p.j.'s and promptly\ndrops them in his lap. He scrabbles for them.\n\n\nEXT.  THE WEREWOLF, MARTY'S POV\n\nWe can't see its face in the dark, but it's closer... much\ncloser.\n\n\nEXT.  MARTY\n\nHe tries to hold the tracer and strike a match at the same\ntime.\nHe can't; to do that he'd need at least one more hand. He\nputs the tube of the tracer between his teeth and tries\nagain.\n\n\nEXT.  THE MATCHBOOK AND MARTY'S HANDS\n\nHe strikes the match... too hard! It bends, the neck broken.\n\n\t\tMARTY (voice; moaning)\n\tOh, please...\n\n\nEXT.  WEREWOLF CLAWS, OPENING AND CLOSING\n\n\nEXT.  MARTY\n\nHe is in an extremity of terror.\n\n\nEXT.  THE MATCHBOOK AND MARTY'S HANDS, CU\n\nHe pulls a fresh match from the book and strikes it. It\nlights.\n\n\nEXT.  THE WEREWOLF\n\nIt recoils- we still can't see its face except for a vague\nshadow.\n\n(NOTE: I keep emphasizing the shadowed face, because this is\nnot a full-moon period. I've been going on the assumption\nthat the guy kind of works his way up to full wolfiness,\ntoothiness, hairiness, etc., starting with a partial change\nat about the second quarter. It's a process like the tide\ncoming in. Thus, if we saw MARTY'S attacker clearly at this\npoint, I think we would recognize him.)\n\n\nEXT.  MARTY, IN THE SILVER BULLET\n\nHe takes the tracer from his mouth and applies the match to\nthe fuse. It splutters alight.\n\n\nEXT.  MARTY AND THE WEREWOLF, A WIDER SHOT\n\nThe WEREWOLF is less than twenty feet away. The tracer\nflares alight and shoots out of MARTY'S hand, leaving a\npink-orange trail of smoke behind it. The missile flies at\nthe WEREWOLF's head.\n\n\nEXT.  THE WEREWOLF\n\nThe tracer strikes it in the face, and we see a flash of\nfire. The WEREWOLF screams and blunders away.\n\n\nEXT.  MARTY, IN THE SILVER BULLET\n\nHe punches the starter again. The motor cranks.\n\n\nEXT.  THE MOTOR OF THE SILVER BULLET\n\nThe motor coughs and fires; a big blue flame jumps from the\nfancy carb... and the engine starts to run.\n\n\nEXT.  THE WEREWOLF\n\nIt's staggering away, ROARING and HOWLING. The tube of the\ntracer is sticking out of its face- from its left eye, in\nfact- like an Indian's arrow. The WEREWOLF smashes branches\nout of its way.\n\n\nEXT.  MARTY IN THE SILVER BULLET\n\nHe wheels the Bullet around and heads for the road, gasping\nand weeping with fear.\n\n\nEXT.  THE WEREWOLF, IN THE GROVE\n\nIt's blundering through the trees. It pulls the tube from\nits face with an ANIMAL SCREAM and drops it.\n\n\nEXT.  THE TRACER, CU\n\nIt lies smoldering on the ground. The end is slick with\nblood.\n\n\nEXT.  THE ROAD, WITH MARTY\n\nThe Bullet is really wheeling. MARTY is panting, out of\nbreath, still deeply frightened.\n\n\nEXT.  THE WOODS, WITH THE WEREWOLF\n\nWe see it blundering along, holding its face; blood bubbles\nthrough its fingers.\n\n\t\tWEREWOLF (snarling voice)\n\tBastard Marty! Bastard Marty! Kill you!\n\tReeeal slow!\n\n\nEXT.  COSLAW DRIVEWAY, WITH MARTY\n\nHe powers up it, and along the path to the back. Perhaps he\nhas enough speed to cut the engine and coast.\n\n\nINT.  MARTY'S BEDROOM\n\nHis bed is by the window. His hands appear on the\nwindowsill, and MARTY pulls himself in. He falls over onto\nhis bed and lies there, spent and exhausted and trembling.\n\n\nEXT.  THE COSLAW HOUSE, VERY EARLY MORNING\n\nSOUND: RINGING TELEPHONE (FILTER)\n\n\nINT.  THE COSLAW LIVING ROOM, WITH MARTY\n\nHe's sitting in the \"house\" wheelchair in the living room,\nholding the phone tensely to his ear as the RINGING SOUND\ngoes on.\n\nA CLICK as the phone is picked up.\n\n\t\tUNCLE AL (muzzy voice)\n\t'Lo? Go away.\n\n\t\tMARTY\n\tIt's a werewolf! I saw it! Last night-\n\n\nINT.  UNCLE AL'S BEDROOM\n\nNot a really spiffy place- the decor is Early American\nAlcoholic. There's a mostly unclad lady asleep on one side\nof the bed. UNCLE AL is sitting on the other in his\nskivvies, phone to his ear. There are a lot of bottles and\nheaped ashtrays around, and UNCLE AL has a big old hangover.\n\n\t\tUNCLE AL\n\tYou dreamed it, Marty.\n\n\t\tMARTY (voice)\n\tNo! I went out late last night- and-\n\n\t\tUNCLE AL\n\tThere are no such things as werewolves.\n\tPlease, dear boy, have some pity.\n\nHe hangs up and falls back into bed.\n\n\t\tGIRL (muzzy voice)\n\tWhowuzzit?\n\n\t\tUNCLE AL\n\tObscene phone caller. Go back to sleep.\n\n\nEXT.  THE BACK PORCH, WITH MARTY\n\nHe's sitting on the Silver Bullet, just looking at the yard.\nJANE comes out.\n\n\t\tJANE\n\tMarty? You okay? You've just been sitting\n\there all morning.\n\n\t\tMARTY\n\tWhere's Mom?\n\n\t\tJANE\n\tWent shopping. Why?\n\n\t\tMARTY\n\tJane, I have to talk to you.\n\n\t\tJANE (mistrustfully)\n\tAbout what?\n\nMARTY looks at her earnestly.\n\n\t\tMARTY\n\tI need you to help me. Uncle Al won't\n\tbelieve me, and if you won't help me, I...\n\tI...\n\nMARTY has to stop. He's almost crying.\n\n\t\tJANE (concerned)\n\tMarty, what is it?\n\n\nEXT.  MAIN STREET, MEDIUM LONG, WITH JANE\n\nJANE is pushing a supermarket shopping cart with a lot of\nbeer and soda bottles in it. On the side is a sign reading\nMEDCU BOTTLE AND CAN DRIVE- plus an outline drawing of the\nMedcu unit.\n\n\t\tJANE (voice-over)\n\tHe told me something that was clearly\n\tunbelievable... and yet, somehow I\n\tbelieved most of it. And I understood\n\tone thing with total clarity: Marty\n\thimself believed it all.\n\nShe turns into a yard and pulls her cart up the walk to the\ndoor. She mounts the steps and rings the bell.\n\n\nEXT.  THE PORCH, WITH JANE, A CLOSER SHOT\n\nA sheer curtain at one side of the door is pulled aside and\na fearful face- that of MRS. THAYER- looks out. Then we hear\nbolts being pulled and locks- at least three of them- being\nunlocked. The lady is taking no chances.\n\n\t\tMRS. THAYER\n\tJane?\n\n\t\tJANE (politely)\n\tI'm collecting returnable bottles and\n\tcans for the Medcu Drive, Missus Thayer-\n\tI just wondered if you had any.\n\nHer husband comes up the hall.\n\n\t\tMR. THAYER\n\tWho is it?\n\n\t\tMRS. THAYER\n\tJane Coslaw.\n\n\nEXT.  JANE\n\nWhat we see mostly are her eyes- bright, inquiring.\n\n\t\tJANE\n\tHi, Mr. Thayer.\n\n\nINT.  LON THAYER, ECU\n\nWhat we see mostly are his brown eyes.\n\n\t\tMR. THAYER\n\tHello, Jane.\n\n\nEXT.  THE PORCH, WITH JANE AND MRS. THAYER\n\n\t\tMRS. THAYER\n\tBring your cart around to the back, Jane-\n\twe'll look in the garage.\n\n\t\tJANE\n\tThank you.\n\nShe starts down the steps and we\n\n\n\t\t\tDISSOLVE TO:\n\n\nEXT.  JANE, ON MAIN STREET  DAY\n\nAmazing how deserted Tarker's Mills looks. JANE is pushing\nher cart. Even more bottles in it now.\n\n\t\tJANE (voice-over)\n\tUncle Al hadn't believed him, but Uncle Al\n\twas thirty-five that summer and I was\n\tfourteen... at fourteen you can still believe\n\tthe unbelievable, although even then that\n\tability is growing rusty, is preparing to\n\tsqueal to a stop.\n\nShe is passing the Holy Family rectory. LESTER LOWE is out\nfront, digging in his flower garden. He is shirtless, back\nto JANE and to us; his black shirt with the turned-around\ncollar hangs informally on a bush.\n\n\t\tJANE (calls)\n\tHi, Father Lowe!\n\n\t\tLOWE (without turning)\n\tTop of the morning to you, Jane Coslaw!\n\n\t\tJANE\n\tI'm going to bring in a monster load\n\tof bottles in an hour or so!\n\n\t\tLOWE (still digging)\n\tThat's great, Jane... I'll be waiting.\n\n\nEXT.  JANE, FARTHER DOWN MAIN STREET\n\nShe stops at Robertson's Luncheonette, leaves her cart\noutside, and goes in. THE CAMERA FLOATS TO THE WINDOW; we\nsee JANE explaining about the bottle campaign to BOBBY while\na few men seated at the counter listen.\n\n\nINT.  JANE, ECU\n\nWide eyes, mostly.\n\n\nINT.  BOBBY ROBERTSON, ECU\n\nMostly eyes.\n\n\nINT.  ROBERTSON'S, FEATURING JANE\n\nAs she turns away, her eyes sweep the men at the counter.\n\n\nINT.  THE MEN, JANE'S POV\n\nSome of them- PELTZER, VIRGIL CUTTS- are familiar. Others\nare not. THE CAMERA PANS THEIR FACES CLOSELY, FEATURING\nTHEIR EYES.\n\n\nEXT.  OUTSIDE ROBERTSON'S, WITH JANE\n\nShe grabs the handle of the cart again and proceeds down\nMain Street. She goes into the barber shop.\n\n\t\tJANE (v-o)\n\tMarty had seen where the tracer had\n\tstruck home, he said, and I went out\n\tthat day doing more than just looking\n\tfor returnable cans and bottles- I was\n\tlooking for a man- or woman- with only\n\tone eye.\n\n\nINT.  THE BARBER SHOP  DAY\n\nAs JANE enters, BILLY McCLAREN is giving one man a trim.\nAnother man is tipped back with his face wrapped in a towel.\nTwo or three other townies are waiting on tonsorial\nbeautification, reading magazines. None, of course, has only\none eye. JANE checks them all out carefully.\n\n\t\tBILLY\n\tI know what you're after, Jane, and you're\n\tout of luck. Little Toby Whittislaw was in\n\tyesterday, and I gave 'em all to him.\n\n\t\tJANE\n\tOh... okay.\n\nBut her eyes have fixed on the towel over the face of the\nman in the other barber chair. She walks over to him.\n\n\nINT.  JANE AND THE TOWELED MAN, CLOSER ON\n\n\t\tJANE\n\tThat you, Mr. Fairton?\n\n\t\tANDY FAIRTON (muffled)\n\tNo- it's Ronald McDonald. I came in for\n\ta shave and a burger.\n\nThe men laugh. JANE smiles politely. And pulls the hot towel\naway from his eyes. His two eyes.\n\n\t\tJANE (sweetly)\n\tGot any bottles, Mr. Fairton?\n\n\t\tANDY\n\tNo!\n\n\t\tJANE (just as sweet)\n\tOh... okay.\n\nShe puts the towel back and THE CAMERA FOLLOWS as she\nreturns to the door.\n\n\t\tJANE\n\t'Bye, Mr. McClaren.\n\n\t\tBILLY (amused)\n\t'Bye, Jane.\n\n\t\tANDY (muffled)\n\tJesus!\n\nJANE goes out.\n\n\nEXT.  JANE, AT THE RECTORY\n\nShe pushes the shopping cart up to the gate, opens it, and\ngoes up the walk to the foot of LOWE'S porch steps. She\nleaves it there and climbs to the porch.\n\n\nEXT.  JANE, ON THE PORCH\n\nThe screen door is shut, the inner wooden door open.\n\n\nINT.  THE RECTORY HALLWAY, JANE'S POV\n\nDark and empty. SOUNDS in the kitchen. EATING SOUNDS, maybe-\nor maybe we can't tell.\n\n\nEXT.  JANE, ON THE PORCH\n\nShe knocks on the screen door.\n\n\t\tJANE\n\tFather Lowe! I'm ready to turn in my\n\tbottles and cans!\n\n\nINT.  THE KITCHEN\n\nLOWE is standing by the refrigerator door. He's holding a\nraw leg of lamb and tearing at it with his teeth. Lamb blood\nsmears his face and runs down his arms. He is as human as\nyou or me (in a manner of speaking, as UNCLE AL would say),\nbut when JANE speaks, his head snaps up and his eye flares-\nhis one eye. The other is covered by a patch.\n\n\t\tJANE (voice)\n\tFather?\n\n\t\tLOWE\n\tTake your cart around to the garage\n\tand unload, Jane! Then bring me your\n\ttally sheet!\n\n\nEXT.  JANE, ON THE PORCH\n\n\t\tJANE\n\tOkay!\n\n\nEXT.  JANE, A WIDER SHOT\n\nShe goes down the steps and starts to push the cart around\nthe house.\n\n\nINT.  THE KITCHEN, WITH LOWE\n\nHe crosses to the window over the kitchen sink, the bloody\nchunk of meat still in his hands, and looks out.\n\n\nEXT.  JANE, LOWE'S POV\n\nShe pushes the cart along a path toward a combination garage\nand utility shed at the back.\n\n\nINT.  THE KITCHEN, WITH LOWE\n\nStill watching JANE, he begins to gnaw ravenously at the\nmeat again.\n\n\nEXT.  JANE, AT THE SHED-GARAGE\n\nShe opens the door and slowly pushes her cart inside.\n\n\nINT.  THE UTILITY SHED-GARAGE, WITH JANE\n\nThis is a creepy little place, now filled with bottles and\ncans that have been crammed in helter-skelter, every which\nway. JANE obviously doesn't like it. She begins to unload\nher cart rapidly, mumbling numbers to herself.\n\nSOUND: SQUEAKING.\n\nJANE looks down.\n\n\nINT.  THE UTILITY SHED-GARAGE FLOOR, JANE'S POV\n\nA good-sized mouse comes out from between a pile of stacked\nbottles and runs across JANE'S shoe.\n\n\nINT.  JANE\n\nShe utters a litle scream and shrinks back against the wall,\nbumping it quite hard. Hard enough to knock something off an\noverhead shelf. It falls into the bottles, SHATTERING\nseveral. JANE screams again- not terribly loud- and then\nslowly bends toward the object and picks it up.\n\nJANE holds it, both puzzled and scared.\n\n\nEXT.  THE BACK DOOR OF THE RECTORY\n\nJANE approaches it, holding a piece of paper in her hand-\nher tally sheet. She knocks. Waits. There is no answer. She\nknocks again. Waits. No answer. She tries the door. It\nopens.\n\n\t\tJANE\n\tFather Lowe?\n\nNo answer. After a moment of interior debate, JANE enters\nthe kitchen.\n\n\nINT.  JANE, IN THE RECTORY KITCHEN\n\nShe looks around. No one here. But there is a bloody spot on\nthe counter- LOWE must have set his grisly luncheon down\nhere for a moment. She walks slowly across the kitchen and\ninto the dark hall.\n\n\t\tJANE\n\tFather Lowe?... I've got my tally sheet...\n\nFarther into the hall. A hand drops onto her shoulder.\n\n\t\tLOWE (voice)\n\tVery good, Jane!\n\nShe jumps, and so do we. She turns around and looks up at:\n\n\nINT.  FATHER LOWE, ECU\n\nFeaturing his eyes- his eye, rather. The left is covered\nwith a black eye-patch.\n\n\t\tLOWE (grins)\n\tGood, Jane. Very... very good.\n\nHe holds his hand out, and JANE puts the tally sheet in it\nlike one in a dream. She can't take her eyes off that black\npatch, which tells her everything.\n\n\nINT.  THE HALLWAY, WITH JANE AND LOWE\n\n\t\tLOWE (concerned)\n\tJane! You're trembling!\n\n\t\tJANE\n\tI... I don't feel so well, I guess\n\tmaybe I got too much sun.\n\n\t\tLOWE\n\tWould you like to come in the parlor and\n\tlie down for a bit? Or have a cold drink?\n\tI have some soda-\n\n\t\tJANE\n\tNo! (softer) That is, I have to get home\n\tand help my mom with lunch.\n\n\t\tLOWE\n\tI'll give you a ride!\n\nJANE is retreating down the hall toward the front door.\n\n\t\tJANE\n\tNo- she... she was going to meet me at the\n\tmarket. I'll be fine.\n\n\nINT.  LOWE, CU\n\nHow much does he know? How much has he guessed? Hard to tell\nfrom his face, which now seems sinister, with its eye-patch.\n\n\t\tLOWE\n\tGive my best to your brother, Jane.\n\n\nINT.  JANE, AT THE PORCH END OF THE HALLWAY\n\n\t\tJANE\n\tI will.\n\nShe bolts.\n\n\nINT.  LOWE, IN THE HALLWAY\n\nCAMERA HOLDS ON HIM, standing silent and enigmatic.\n\n\t\tLOWE (soft)\n\tReal slow.\n\n\nEXT.  THE COSLAW BACKYARD, WITH MARTY\n\nHis eyes are wide. He's leaning forward in his wheelchair.\n\n\t\tMARTY (almost moaning)\n\tOh, Jeez! What did you do then?\n\n\nEXT.  JANE AND MARTY\n\nShe's changed into shorts and a blouse.\n\n\t\tJANE\n\tI ran faster than I ever ran in my life-\n\twhat do you think, dummox? By the time I\n\tgot back here, I really thought I was\n\tgoing to faint. (Pause) What are we going\n\tto do, Marty? If we tried to tell anybody-\n\tgrown-ups, I mean- they'd laugh. What are\n\twe going to do?\n\n\t\tMARTY (thoughtfully)\n\tI think I know.\n\n\nINT.  A SHEET OF RULED SCHOOL NOTEBOOK PAPER, CU\n\nA hand- MARTY'S- comes into the frame and prints: I KNOW WHO\nYOU ARE, AND I KNOW WHAT YOU ARE.\n\n\nINT.  MARTY'S ROOM, WITH MARTY\n\nHe's sitting at his desk, a pool of light from the lamp\nfocused on the sheet of paper before him. He thinks a\nmoment, then begins to write again.\n\n\nINT.  THE NOTEBOOK PAD, CU\n\nHe is adding: WHY DON'T YOU KILL YOURSELF?\n\n\nINT.  MARTY, AT HIS DESK\n\nHe studies this for a second, and seems satisfied. He opens\na drawer, brings out an envelope, and folds his letter into\nit.\n\n\nEXT.  JANE, ON MAIN STREET\n\nShe has the letter in her hand. She approaches the mailbox,\nopens the mailbox door, and then glances at the envelope\nagain.\n\n\nEXT.  THE ENVELOPE, JANE'S POV\n\nAddressed in pencil, it says: FATHER LESTER LOWE/HOLY FAMILY\nRECTORY; 149 MAIN STREET/TARKER'S MILLS, MAINE.\n\n\nEXT.  JANE, AT THE MAILBOX\n\nShe drops the letter in with the air of a girl lighting the\nfuse on a packet of high explosives. She turns away toward\nhome.\n\n\nINT.  THE RECTORY LIVING ROOM, WITH LESTER LOWE\n\nHe's standing at the window and looking out. The torn-open\nenvelope is on an end table beside him. He's holding the\nlined sheet of paper in his hand. An expression of bitter\nhate twists his features, and he slowly crumples the paper\nin his fist.\n\n\nEXT.  JANE, AT THE MAIN STREET MAILBOX\n\nShe drops in another letter and walks away.\n\n\t\tJANE (v-o)\n\tI mailed another letter for Marty the\n\tnext day... a third the day after that.\n\tThen, on Saturday...\n\n\nEXT.  THE TARKER'S MILLS COMMON, LONG\n\nParked at the curb is UNCLE AL'S sports car.\n\n\t\tJANE (v-o)\n\t...we told Uncle Al what we'd been up to.\n\t(Pause) His reaction was less than serene.\n\n\nEXT.  UNCLE AL, JANE, AND MARTY, ON THE COMMON\n\n\t\tUNCLE AL\n\tHoly-jumped-up-baldheaded-Jesus-CHRIST!\n\n\t\tJANE\n\tUncle Al-\n\n\t\tUNCLE AL (to JANE)\n\tFrom him I'd expect it. I sometimes think\n\this common sense got paralyzed along with\n\this legs. But you, Jane! You! Little\n\tPolly Practical!\n\n\t\tJANE (quiet)\n\tYou don't understand.\n\n\t\tUNCLE AL (wildly)\n\tOh, I understand plenty! I understand that\n\tmy niece and nephew are sending the local\n\tCatholic priest little love notes suggesting\n\tthat he gargle with a broken light bulb or\n\teat a rat-poison omelet!\n\n\t\tMARTY\n\tIt came for me! I shot it in the eye! Now he's\n\twearing an eye-patch!\n\n\t\tUNCLE AL\n\tI called Peltzer on my way over here,\n\tMarty! Father Lowe came into the drugstore\n\ttwo days ago for a bottle of otic solution.\n\tThat's a fancy way of saying eyewash. He's\n\tgot a corneal inflammation.\n\n\t\tMARTY\n\tWas it a prescription?\n\n\t\tUNCLE AL\n\tWhat the hell does that matter?\n\n\t\tMARTY\n\tIt wasn't- I'll bet you it wasn't. Because\n\tto get a prescription he'd have to see a\n\tdoctor.\n\n\t\tUNCLE AL\n\tMarty, Marty, you should hear yourself!\n\n\t\tMARTY\n\tWell... was it a prescription?\n\n\t\tUNCLE AL\n\tI don't know. But I know you didn't see\n\tany werewolf the other night, Marty. You\n\thad a dream, that's all. An extremely\n\trealistic nightmare brought on by what's\n\tbeen happening in this town.\n\n\t\tMARTY\n\tWhat about the baseball bat Jane saw in\n\this shed? You know who used to have a\n\tbaseball bat like that? Mr. Knopfler! He\n\twas so proud of it he used to carry it in\n\tthe Fourth of July parade! Jane said it\n\tlooked like the Green Giant used it for\n\ta toothpick!\n\n\t\tUNCLE AL\n\tYou want to know what I think?\n\n\t\tMARTY\n\tNo- we just got you out here so we could\n\tadmire your pretty face.\n\n\t\tUNCLE AL\n\tWatch it, dear boy. I think it was a\n\thallucination. Probably a broomstick, or\n\tsomething.\n\n\t\tJANE (indignant)\n\tIt was not! You want me to show you! Come\n\ton! I'm not afraid! I'll show you right now!\n\n\t\tUNCLE AL\n\tNo thank you, Jane. I'm a little old for\n\tpalying the Hardy Boys Meet the Catholic\n\tWerewolf.\n\nJANE stamps her foot, furious with UNCLE AL.\n\n\t\tMARTY\n\tNever mind, Jane. He'll have gotten rid of\n\tit by now anyway.\n\n\nEXT.  OUTSIDE OF ROBERTSON'S LUNCHEONETTE\n\nThe Silver Bullet stands outside. The door opens and UNCLE\nAL, JANE, and MARTY come out. UNCLE AL is carrying MARTY\npiggyback. MARTY has an ice cream cone. JANE is holding two.\n\nUNCLE AL squats, depositing MARTY in the Bullet. MARTY\nstarts the engine as JANE hands UNCLE AL his ice cream cone.\nThe three of them start up the street and THE CAMERA TRACKS\nTHEM.\n\n\t\tJANE\n\tIf Father Lowe is an innocent little lamb,\n\twhy hasn't he picked up the telephone and\n\tcalled Constable Haller to tell him Marty's\n\tsending poison-pen letters?\n\n\t\tUNCLE AL\n\tI don't accept the idea that he knows who his\n\tletter writer is, Jane. Because I don't accept\n\tthe idea that there was a big bad wolf who saw\n\tMarty in his wheelchair.\n\n\t\tJANE\n\tWhy hasn't he picked up the phone and told\n\tConstable Haller that someone is sending\n\thim poison-pen letters?\n\nUNCLE AL stops. He hasn't thought of this. He looks toward:\n\n\nEXT.  THE CATHOLIC RECTORY, LONG - UNCLE AL'S POV\n\nLESTER LOWE is mowing the lawn, eye-patch and all.\n\n\nEXT.  MAIN STREET, WITH UNCLE AL, MARTY, AND JANE\n\n\t\tUNCLE AL (a bit perplexed)\n\tWell... he probably did. I mean, he could\n\tmake a complaint without taking an ad out\n\tin the paper, couldn't he?\n\n\t\tMARTY\n\tI'll bet you a quarter that eyewash stuff\n\twas nonprescription. And I'll bet you\n\tanother quarter he hasn't said anything\n\tto Mr. Haller.\n\n\t\tUNCLE AL\n\tMarty, do you see your suspect?\n\n\nEXT.  THE RECTORY LAWN, WITH LESTER LOWE\n\nKeeps on moving. MR. ASPINALL drives by and waves. LOWE\nwaves back.\n\n\nEXT.  MAIN STREET, WITH UNCLE AL, MARTY, AND JANE\n\n\t\tMARTY (grim)\n\tYes, I see him.\n\n\t\tUNCLE AL\n\tDo you really think that a man who took\n\ta rocket in the eye three nights ago\n\tcould be out mowing his lawn? He'd either\n\tbe in the hospital... or dead.\n\n\t\tMARTY\n\tI didn't shoot him when he was a man. I shot\n\thim when he was-\n\n\t\tUNCLE AL\n\tWhen he was a werewolf. Yes. Right. Jesus.\n\tJane, you don't really believe this madness,\n\tdo you?\n\n\t\tJANE\n\tI don't know exactly what I believe. But I\n\tknow that what I saw was a baseball bat and\n\tnot a broomstick. I know there was something\n\tstrange about the way the house smelled that\n\tday. It smelled like an animal's den. And I\n\tbelieve in Marty. I mean- there are times\n\twhen he makes me so mad I could kill him, but\n\tI still believe in him. (Pause) You used to\n\tbelieve in him, too, Uncle Al.\n\nUNCLE AL looks momentarily ashamed of himself. Then he\nthrows his hands up in disgust.\n\n\t\tUNCLE AL\n\tKids!\n\nHe walks ahead of them. MARTY bats his eyes sweetly at JANE.\n\nShe walks on, miffed. MARTY gooses the Silver Bullet to\ncatch up.\n\n\nEXT.  A FIELD ON THE OUTSKIRTS OF TOWN  DAY\n\nIt's midafternoon. A bunch of kids are playing baseball. In\nthe extreme f.g. we see one small boy- MARTY- sitting back\nto us in his wheelchair, watching.\n\n\nEXT.  AN OLD COUPE\n\nIt draws slowly along a tree-lined lane and stops. LESTER\nLOWE is behind the wheel.\n\nSOUNDS OF THE BASEBALL GAME CONTINUE.\n\n\nEXT.  THE BASEBALL FIELD, AND MARTY, LOWE'S POV\n\nTHE CAMERA MOVES SLOWLY IN ON MARTY'S BACK.\n\n\nEXT.  LESTER LOWE\n\n\t\tLOWE (quietly)\n\tLittle bastard.\n\n\nEXT.  A FLY BALL\n\n\nEXT.  THE FIELD, A WIDER SHOT\n\nThe field team heads in. Kids start streaming back toward\ntown.\n\n\nEXT.  MARTY\n\nThe OUTFIELDER who caught the fly trots past, and glances\nhis way.\n\n\t\tOUTFIELDER\n\tYou comin' down to Robertson's for a\n\tsoda, Marty?\n\n\t\tMARTY\n\tNo- I guess I'll go home.\n\nI think that here we are seeing a rare moment of depression\nin MARTY- they can run and play ball. He can't.\n\n\t\tOUTFIELDER\n\tOkay- seeya!\n\n\t\tMARTY\n\tYeah... seeya.\n\nHe fires up the Bullet and starts away alone.\n\n\nEXT.  LOWE'S COUPE\n\nHe starts it up.\n\n\nEXT.  MARTY, LOWE'S POV\n\nHe bumps up a grassy slope to a tarred road. The last of the\nother kids are headed back the other way. MARTY is alone.\n\n\nEXT.  LOWE'S COUPE\n\nIt turns out of the lane where it was parked and onto the\nroad.\n\n\nEXT.  MARTY'S WHEELCHAIR, LOWE'S POV\n\nMARTY'S back is to us. The wheelchair draws rapidly closer\nto THE CAMERA as LOWE bears down on it.\n\n\nINT.  LOWE, BEHIND THE COUPE'S WHEEL\n\nHe leans over the wheel, grinning sadistically.\n\n\t\tLOWE (whispers)\n\tBastard.\n\n\nEXT.  MARTY, IN THE SILVER BULLET\n\nHe's daydreaming his way along- maybe, inside his head, he's\nplaying center field for the Dodgers.\n\nSOUND: Winding roar of a car engine. MARTY turns around.\n\n\nEXT.  LOWE'S COUPE, MARTY'S POV, ROARING AT THE CAMERA\n\n\nEXT.  MARTY AND LOWE'S COUPE\n\nMARTY opens the throttle wide and the Bullet swerves across\nthe road. The coupe's bumper actually clips it on the way\nby, jolting MARTY and almost overturning the Bullet.\n\nLOWE'S coupe veers over the embankment and partway down into\nthe ditch.\n\n\nINT.  LOWE, BEHIND THE WHEEL OF THE COUPE\n\n\t\tLOWE\n\tOh, you bastard!\n\nHe floors the engine.\n\n\nEXT.  THE COUPE'S REAR WHEELS\n\nSpinning helplessly in the dirt.\n\n\nEXT.  MARTY, IN THE SILVER BULLET\n\nHe speeds past the coupe, and thumbs his nose.\n\n\nINT.  LOWE, IN THE COUPE\n\nHe's in a teeth-grinding fury. He jams the gear-shift lever\ninto reverse and floors the gas pedal again.\n\n\nEXT.  THE COUPE\n\nIt roars backward in a cloud of ditch dust and bounces onto\nthe road. Then it screams out after the rapidly disappearing\nSilver Bullet.\n\n\nEXT.  THE SILVER BULLET, WITH MARTY\n\nHe hears the GROWLING SOUND of LESTER LOWE'S coupe. He looks\nbehind.\n\n\nEXT.  THE COUPE\n\nRoars toward THE CAMERA.\n\n\nEXT.  MARTY, IN THE SILVER BULLET\n\nHe twists the throttle and the Silver Bullet responds.\n\n\nEXT.  CHASE MONTAGE\n\nThe director will shoot it as he likes- the basis is simple:\nLOWE is chasing MARTY's hopped-up wheelchair along a country\nroad at speeds approaching fifty MPH. MARTY should have a\ncouple of near misses, and perhaps we could actually have\nhim pass one car. At one point we should have a REVERSE\nANGLE on LESTER LOWE'S coupe, featuring two bumper stickers:\nATTEND AND SUPPORT YOUR LOCAL CHURCH and HONK IF YOU LOVE\nJESUS!\n\nAs the chase goes on it becomes apparent that LOWE is\ngaining. MARTY looks increasingly desperate. And now he\nlooks down at:\n\n\nEXT.  THE SILVER BULLET'S GAS GAUGE, MARTY'S POV\n\nThe needle is all the way over on \"E.\"\n\n\nEXT.  MARTY\n\nHe groans. SOUND of the coupe's engine GROWS LOUDER.\n\n\nEXT.  THE COUPE AND THE SILVER BULLET\n\nLOWE charges, rapidly closing the distance. MARTY swerves\nfrom one side of the road to the other, escaping LOWE for\nthe moment but almost overturning in the process.\n\nThey are now running beside a river- the Auger River, in\nfact.\n\n\nEXT.  THE BULLET'S GAS GAUGE\n\nNow the needle is actually past \"E.\"\n\n\nEXT.  MARTY\n\n\t\tMARTY\n\tCome on, baby... come on...\n\nHis face registers hope as he sees:\n\n\nEXT.  ROADSIDE SIGN, MARTY'S POV\n\nAUGER RIVER COVERED BRIDGE 2000 FEET AHEAD AUTOMOBILES\nPROHIBITED!\n\n\nEXT.  MARTY, IN THE BULLET\n\nHe twists the throttle as far as it will turn- he's going\nfor broke. The coupe chases him- and now the Silver Bullet's\nmotor COUGHS.\n\n\nEXT.  THE BRIDGE, MARTY'S POV\n\nIt's pretty ramshackle. A big orange sign beside it reads:\nBRIDGE UNSAFE! TRUCKS AND AUTOS ABSOLUTELY PROHIBITED!\n\n\nEXT.  THE SILVER BULLET\n\nMARTY brakes, hits the shoulder of the road, and somehow\nmakes the turn. We see him holding on for dear life as the\nSilver Bullet bounces and jounces down the dirt road to the\nmouth of the covered bridge.\n\n\nEXT.  LOWE'S COUPE\n\nIt overshoots the right turn MARTY just took, screeches to a\nhalt, backs up, and turns onto the lane.\n\n\nEXT.  THE SILVER BULLET\n\nIt bounces up the incline to the bridge, MOTOR COUGHING AND\nSPLUTTERING.\n\n\nEXT.  THE COUPE\n\nIt comes to a sliding, dirt-digging stop.\n\n\nINT.  LOWE, BEHIND THE WHEEL\n\nHis face is so full of frustrated hate that it has become\nthe face of a gargoyle.\n\n\nEXT.  THE SIGN PROHIBITING MOTOR TRAFFIC, LOWE'S POV\n\n\nEXT./INT.  THE COVERED BRIDGE, WITH THE BULLET\n\nIt's dim and spooky in here. Cracks between the boards of\nthe side walls allow dusty fingers of daylight to shine\nthrough. More light rays up from the cracks in the floor.\nThe floorboards are warped and uneven; MARTY'S wheelchair\nsways drunkenly from side to side. The total inside passage\nis about seventy feet.\n\nAbout halfway across, the Silver Bullet coughs its last\ncough and splutters its last splutter. It rolls along\nsilently, going on its dying momentum.\n\n\nEXT.  THE FAR END OF THE BRIDGE, MARTY'S POV\n\nDrawing closer. We hear the SOUNDS of boards rumbling under\nthe Silver Bullet's tires and the Auger River beneath.\n\n\nEXT.  MARTY, REVERSE\n\nRolling ever more slowly, the Silver Bullet approaches THE\nCAMERA... and stops. MARTY is covered with sweat. His hair\nis in a wild tangle. He's panting. He looks at:\n\n\nEXT.  THE LANE LEADING AWAY FROM THE BRIDGE, MARTY'S POV\n\nThis is an extremely rustic lane. Pretty, but hardly the\nsort of place in which one would want to find oneself when\none has a part-time werewolf and a full-time homicidal\nmaniac close behind.\n\n\nEXT.  MARTY, AT THE MOUTH OF THE BRIDGE\n\n\t\tLOWE (soft voice)\n\tMarty...\n\nMARTY'S head whips around.\n\n\nEXT.  THE FAR END OF THE BRIDGE, MARTY'S POV\n\nWe see a brilliant square of light. In it stands LOWE'S\nsilhouette. The silhouette begins to move. SOUND of\nfootfalls on the loose floorboards of the covered bridge.\n\n\nINT.  LOWE'S SHOES\n\nSensible black Oxfords.\n\n\t\tLOWE\n\tI'm very sorry about this. I don't know if\n\tyou believe that or not, but it's true. I\n\twould never willingly hurt a child. You\n\tshould have left me alone, Marty.\n\nSOUND of footfalls resumes.\n\n\nEXT.  MARTY\n\nHe's nearly paralyzed with terror- even if he wasn't, he\nwouldn't get far in a powerless Silver Bullet.\n\n\nINT.  LOWE, IN THE SHADOWS\n\n\t\tLOWE (soft; soothing)\n\tI can't kill myself, Marty. You see, our\n\treligion teaches that suicide is the\n\tgreatest sin a man or a woman can commit.\n\tStella Randolph was going to commit suicide;\n\tif she had done so, she would be burning in\n\thell right now. By killing her I took her\n\tphysical life but saved her life eternal.\n\tYou see, Marty? You see how all things serve\n\tthe will and the mind of God? You see, you\n\tmeddling little shit!\n\nHe begins to walk forward again.\n\n\nEXT.  LOWE, MARTY'S POV\n\nHe's halfway across the bridge now, walking slowly, not\nhurrying.\n\n\t\tLOWE\n\tYou're going to have a terrible accident,\n\tMarty. You're going to fall into the river.\n\nSOUND: TRACTOR ENGINE. LOWE stops, alert to possible danger.\n\n\nEXT.  MARTY\n\nTRACTOR SOUND IS LOUDER.\n\nMARTY'S face fills with hope. He looks from LOWE toward:\n\n\nEXT.  THE LANE, MARTY'S POV\n\nTHE TRACTOR SOUND gets louder still, and here comes ELMER\nZINNEMAN on a John Deere. The tractor is hauling a manure\nspreader which is mostly empty.\n\n\nEXT.  MARTY\n\n\t\tMARTY (waving madly)\n\tMr. Zinneman! Mr. Zinneman!\n\n\nINT.  THE COVERED BRIDGE, WITH LOWE\n\nHe draws back a little, and his face is sharp with animal\ncunning- inside his head he's running a four-minute mile.\nStay and try to bluff it out, or beat it?\n\n\nEXT.  ELMER AND MARTY\n\nELMER draws the tractor up close to MARTY and swings it\naround. MARTY looks back at:\n\n\nINT.  THE COVERED BRIDGE, MARTY'S POV\n\nEmpty.\n\nSOUND OF A CAR STARTING, FAINT.\n\n\nEXT.  MARTY AND ELMER\n\nMARTY looks back at ELMER.\n\n\t\tMARTY\n\tI ran out of gas.\n\n\t\tELMER\n\tSpooky in there, ennit?\n\n\t\tMARTY (with feeling)\n\tIt sure is!\n\nHe looks back once more toward:\n\n\nEXT./INT.  THE COVERED BRIDGE, MARTY'S POV\n\nBrooding, shadowy. CAMERA HOLDS AND WE\n\n\n\t\t\tDISSOLVE TO:\n\n\nEXT.  THE COSLAW BACKYARD  DAY\n\nMARTY is talking to UNCLE AL. JANE is behind them, knocking\ncroquet balls through the wickets on the back lawn.\n\nMARTY is looking at his Uncle anxiously as JANE strolls\nover.\n\n\t\tUNCLE AL\n\tWell... it's a lot easier to swallow\n\twithout the hair and the foaming jaws.\n\tAlso, I checked on the otic solution.\n\tIt was counter brand. No prescription\n\tneeded.\n\n\t\tMARTY\n\tI told you!\n\n\t\tUNCLE AL\n\tShut up, dear boy- no gloating allowed.\n\n\t\tJANE (sits down)\n\tDid you talk to the constable?\n\n\t\tUNCLE AL\n\tAfter Marty called me with his latest\n\tThrilling Tale of Wonder, I did. (Pause)\n\tHe's had no poison-pen complaints lodged\n\tat all.\n\n\t\tMARTY\n\tI told you!\n\n\t\tJANE\n\tShut up, Marty.\n\n\t\tUNCLE AL (reluctantly)\n\tThere's something else.\n\n\tMARTY\t\t\t\t\tJANE\nWhat is it?\t\t\t\t\tWhat other thing?\n\n\t\tUNCLE AL\n\tI probably shouldn't tell you- you're\n\tboth hysterical on the subject. I'm\n\tstarting to feel like a guy handing\n\tout free Arthur Murray coupons to\n\tvictims of the dancing sickness.\n\n\t\tMARTY\n\tUncle Al, if you don't tell me-\n\nHe makes strangling gestures.\n\n\t\tUNCLE AL (reluctant)\n\tI went out to that rest area.\n\n\t\tMARTY (triumph)\n\tYou found the tracer?\n\n\t\tUNCLE AL\n\tNo... but I found some blood, smeared on\n\ta tree trunk in that grove.\n\n\t\tMARTY\n\tThere! You see!\n\n\t\tUNCLE AL\n\tIt could have been anything, Marty.\n\n\t\tMARTY\n\tWhat about Father Lowe chasing me in his\n\tcar and trying to run me down? You don't\n\tthink that was a dream, do you?\n\n\t\tUNCLE AL\n\tNo.\n\nUNCLE AL comes over to JANE'S side of the Silver Bullet. He\nlooks down at:\n\n\nEXT.  THE FRAME OF THE BULLET\n\nThere's a scrape and a dent where LOWE'S coupe dented it.\nThere is also a fleck of paint.\n\n\nEXT.  UNCLE AL AND JANE, CU\n\n\t\tUNCLE AL\n\tLowe's car-?\n\n\t\tJANE\n\tBlue. This blue.\n\n\t\tUNCLE AL\n\tJesus.\n\n\nEXT.  THE NIGHT SKY, WITH THE MOON\n\nThree-quarters full.\n\nTHE CAMERA PANS DOWN to the Tarker's Mills town hall. UNCLE\nAL'S sports car is parked out front.\n\n\nINT.  THE CONSTABLE'S OFFICE, WITH HALLER AND UNCLE AL\n\nHALLER is behind his desk, rocked back in his chair, hands\nlaced together behind his head. He's looking at UNCLE AL.\nThere's a silence that draws out for quite some time. In it,\nUNCLE AL becomes steadily more uncomfortable.\n\n\t\tHALLER\n\tThat's just about the craziest damn story\n\tI've ever heard, Al.\n\n\t\tUNCLE AL\n\tI know. I could have edited out all of the\n\tcompletely crazy stuff, but I thought you\n\tdeserved to hear it with the bark on.\n\n\t\tHALLER\n\tI appreciate that. Now, the next question:\n\tDo you believe any of this? You do, don't you?\n\n\t\tUNCLE AL\n\tLet's just say I believe Lester Lowe should\n\tbe checked out.\n\nHALLER rises.\n\n\t\tHALLER\n\tThat can be arranged.\n\nThey shake hands.\n\n\nEXT.  THE RECTORY  NIGHT\n\nA Chevrolet with TARKER'S MILLS CONSTABLE painted on the\nside in gold leaf pulls up. JOE HALLER gets out, and as he\ndoes there's a business of pulling his pants legs down over\nhis boots- nice stitched cowboy boots, not black cop's\nshoes. We want the audience to notice these boots, remember\nthem- probably HALLER should wear them all through the\npicture. He goes up the walk.\n\nHALLER rings the doorbell.\n\nNo one comes. HALLER rings the bell again. Waits. No one\ncomes. He leans down and looks through a side window.\n\n\nINT.  THE RECTORY HALL AND SITTING ROOM, HALLER'S POV\n\nNo one there.\n\n\nEXT.  HALLER\n\nHe goes down the steps, stands on the path for a moment, and\nthen goes over to the shed-garage. He opens the door and\nlooks in.\n\n\nEXT./INT.  THE GARAGE, HALLER'S POV\n\nLOWE'S coupe is in there. There's just room for it amid the\nshadowy piles of bottles and cans.\n\n\nINT.  THE GARAGE, WITH HALLER\n\nHe goes around to the front of LOWE'S coupe and squats down.\nIn the b.g.: a heaped mountain of aluminum beer and soda\ncans.\n\nHALLER feels in his breast pocket and brings out a Zippo. He\nlights it and looks at:\n\n\nINT.  THE COUPE, CU\n\nOne of the turn-signal lamps is broken. There's a scratch in\nthe paint and a dent in the bumper. HALLER'S fingers come\ninto the frame and touch the scratch. They stop, and THE\nCAMERA ZOOMS IN to a small streak of silvery paint. As MARTY\nhas a scrape of blue car paint on his wheelchair, so does\nLOWE have a scrape of silver wheelchair paint on his car.\n\n\nINT.  HALLER\n\nHis eyes widen.\n\nSOUND: SHATTERING ROAR and the CLINK AND TUMBLE of about\nnine thousand cans as LOWE erupts from under the aluminum\nscrap heap behind HALLER. He is a mixture of man and\nwerewolf, and quite clearly a beastial version of LOWE. In\none hand he holds the remains of OWEN KNOPFLER'S peacemaker.\n\nHALLER starts to turn; LOWE strikes him with the bat. CAMERA\nCLOSES IN ON LOWE as the bat rises and falls... rises and\nfalls. We can't see HALLER, and that is probably a mercy,\nbut we can hear the THUD of the bat as it strikes again and\nagain and again.\n\n\nEXT.  THE REST AREA AT AUGER FALLS, WITH MARTY, AL, JANE\nDAY\n\nUNCLE AL has taken the Coslaw family station wagon today.\nThe three of them are sitting in the grove of trees.\n\n\t\tMARTY\n\tMr. Haller said he'd check him out, and\n\tguess what? No one sees him again!\n\n\t\tUNCLE AL\n\tAnd what do you suggest I do about it,\n\tdear boy?\n\nMARTY slips off his St. Christopher's medallion and hands it\nto UNCLE AL.\n\n\t\tMARTY\n\tI want you to turn this into a silver\n\tbullet.\n\n\t\tUNCLE AL\n\tYou're not going to let it go, are you?\n\n\t\tMARTY\n\tI saw what I saw.\n\n\t\tUNCLE AL\n\tMarty, the moon wasn't even full!\n\n\t\tJANE (quietly)\n\tIn the made-up stories, the guy who's the\n\twerewolf only changes when the moon is full.\n\tBut maybe he's really that way almost all\n\tthe time, only as the moon gets fuller...\n\n\t\tMARTY (finishes)\n\t...the guy gets wolfier.\n\n\t\tJANE (hands AL her crucifix)\n\tHere. Take mine, too.\n\n\t\tMARTY\n\tJane... you don't have to do that.\n\n\t\tJANE\n\tDon't tell me what I have to do and what I\n\tdon't, booger-brains.\n\n\t\tMARTY\n\tWill you marry me, Jane?\n\n\t\tUNCLE AL\n\tWould you kids mind telling me how this guy\n\tLowe became a werewolf to begin with?\n\n\t\tJANE\n\tI don't know. Maybe he doesn't know, either.\n\n\t\tMARTY\n\tNo one knows how cancer begins, either- or\n\texactly what it is- but people still\n\tbelieve in it.\n\n\t\tUNCLE AL\n\tThe kid is eleven years old and already\n\the sounds like a Jesuit. A French Jesuit.\n\n\t\tMARTY\n\tI think he's going to come for me. Not\n\tjust because I know who he is, but\n\tbecause I hurt him. Only I don't think\n\the'll try again as Lowe.\n\n\t\tUNCLE AL\n\tDear boy, you have gone right out of\n\tyour mind.\n\n\t\tMARTY\n\tWill you do it?\n\nUNCLE AL only looks at him, confused and unsure.\n\n\nEXT.  A COUNTRY ROAD, WITH THE COSLAW STATION WAGON  DAY\n\nUNCLE AL is taking the kids home- THE CAMERA TRACKS the\nwagon for a moment, and then we are looking up the short\nlane and into a gravel pit.\n\nTHE CAMERA ZOOMS IN, FAST, on the sandy rear wall. We can\nsee one cowboy boot sticking out of a wall of sand. It's\nbloody and chewed.\n\n\nEXT.  THE COSLAW DRIVEWAY  DAY\n\nThe wagon pulls in.\n\n\nINT.  THE CAR, WITH MARTY, JANE, AND UNCLE AL\n\n\t\tMARTY\n\tPlease, Uncle Al.\n\n\t\tJANE\n\tWill you?\n\nThe St. Cristopher's medal and the crucifix are hanging from\nthe rearview on a fine silver chain. UNCLE AL takes down the\nmedal and looks at it.\n\n\t\tUNCLE AL\n\tAll right. I give up. Yes.\n\n  MARTY\t\t\t\t\t\t\tJANE\nAll right! Thanks!\t\t\t\tThank you, Uncle Al!\n\n\t\tUNCLE AL\n\tIf either of you ever tells anyone I even\n\tbought a piece of this story, werewolves\n\twill be the least of your problems.\n\n\nEXT./INT.  SILVER BULLET MONTAGE\n\na.) UNCLE AL pulls up to a city store front with a sign\nreading MAC'S GUNS AND AMMO. He takes out the St.\nCristopher's medal, looks at it, and shakes his head, as if\nstill ruing his own credulity and stupidity. He goes inside.\n\n\t\tJANE (voice-over)\n\tUncle Al's friend Mac was more than a\n\tgunsmith; he was, Uncle Al said, an\n\told-world craftsman, a sort of wizard\n\tof weapons.\n\nb.) In the gun shop interior, we see UNCLE AL talking to\nMAC, who really should look like an elderly white wizard- a\nkind of Gandalf figure. In the b.g. window we see a paper\nskeleton and paper jack-o'-lanterns: our first clue that All\nHallow's Eve is nearing. UNCLE AL is speaking animatedly,\nusing his hands a lot; we don't know exactly what the tale\nis, but it must be a whopper. In the course of it, he hands\nthe medal and the crucifix to MAC, who tents the silver\nchains over his fingers and looks at them.\n\n\t\tJANE (v-o continues)\n\tGod knows what sort of story my uncle\n\ttold him, but I think that for men who\n\thave been married as often as Uncle Al,\n\tinvention on short notice becomes\n\tsomething of a specialty.\n\nc.) In his workroom, we see MAC spilling boron over the\nmedal and looking closely at the stain.\n\n\t\tJANE (v-o continues)\n\tThe gunsmith confirmed the high-grade\n\tsilver content of my crucifix and Marty's\n\tmedallion...\n\nd.) In a dim shot which makes MAC look more like a sorcerer\nthan ever, we see him light an acetylene torch and begin\nmelting the medal and the crucifix in the crucible. THE\nCAMERA MOVES SLOWLY IN as JANE'S contribution and MARTY'S\nmelt together; they are becoming on and indissoluble.\n\n\t\tJANE (v-o continues)\n\t...melted them down...\n\ne.) We see MAC pouring molten silver into a bullet mold.\n\n\t\tJANE (v-o concludes)\n\t...and molded them into a silver bullet.\n\n\nINT.  MAC'S GUN SHOP, WITH MAC AND UNCLE AL  DAY\n\nMAC comes out of the back with a small inlaid wooden box. He\nputs it down on the glass counter top.\n\n\t\tMAC\n\tHere it is.\n\n\nINT.  THE BOX, CU\n\nMAC'S hands open it, disclosing a single bullet resting on\ndark velvet plush. It is a .22 short round, and it gleams a\npure silver. It would be great to hype this bullet\noptically- not much, just a little- to make it look\nabsolutely magical. Almost holy.\n\n\nINT.  MAC AND UNCLE AL\n\nUNCLE AL picks up the bullet almost reverently, holds it to\nthe light.\n\n\t\tMAC\n\tNicest piece of work I ever did, I think.\n\tIt's got a low-grain load so it won't\n\ttumble. Should be pretty accurate.\n\n\t\tUNCLE AL\n\tIt's just a gag, that's all. What would\n\tyou shoot a silver .22 bullet at, anyway?\n\n\t\tMAC (joking)\n\tHow about a werewolf? (Pause) Happy\n\tHalloween, Al.\n\n\nEXT.  THE FULL MOON, CLOSE  NIGHT\n\nIt nearly fills the screen, swimming mysteriously in the\nwarm summer air.\n\n\t\tJANE (voice-over)\n\tBy the time Marty's silver bullet was done,\n\tit was Halloween... and the full moon had\n\tcome around again. Earlier that afternoon,\n\tmy grandfather, who had been dying of cancer\n\tfor over seven years, finally finished the job.\n\nTHE CAMERA PANS DOWN to the COSLAW house. There's a carved\njack in the window and a corsage of Indian corn on the door.\nUNCLE AL'S MG is in the driveway. The COSLAW station wagon\nis just backing out. UNCLE AL and JANE stand in the doorway;\nMARTY is slightly behind them in the Silver Bullet.\n\nNAN leans out of the car. She's wearing black, and she has\nobviously been crying.\n\n\t\tNAN\n\tRemember, Al... we'll be at the Ritz-Carlton\n\tin Boston tomorrow night! Or at the funeral\n\tparlor. It's Stickney and-\n\n\t\tUNCLE AL\n\t-and Babcock, I remember. Now go on!\n\nThe station wagon backs farther and NAN leans out again.\n\n\t\tNAN\n\tAnd don't open the door for any trick or\n\ttreaters even if they come!\n\n\t\tUNCLE AL\n\tWe won't!\n\nThe station wagon backs out into the road and NAN pops out\nagain.\n\n\t\tNAN\n\tYou kids go to bed on time! You've got\n\tschool tomorrow!\n\n\t\tUNCLE AL\n\tIf you keep doing that, you're going to\n\tbump your head, sissy. Give my love to Mama-\n\ttell her I'll see her Thursday.\n\n\t\tNAN\n\tI will- be good, kids.\n\n  MARTY\t\t\t\t\t\t\tJANE\n'Bye, mom! Bye, dad!\t\t\t\tWe will! 'Bye!\n\nThe station wagon accelerates away.\n\n\t\tUNCLE AL\n\tCan I tell you kids something?\n\n\t\tJANE\n\tSure, Uncle Al.\n\n\t\tUNCLE AL\n\tWhen me and sissy were kids, we were\n\tjust like you two.\n\n\t\tMARTY\n\tYeah? Really?\n\n\t\tUNCLE AL\n\tYeah. Really. The bitch of it is, we still\n\tare. Learn from your elders, dearies.\n\nHe ushers them inside and closes the door.\n\n\nINT.  THE STATION WAGON, WITH BOB AND NAN\n\n\t\tBOB\n\tI can't believe that you'd agree to leave\n\tthe kids with him. A year ago I would have\n\tlaughed at the idea. You used to almost\n\tbreathe fire when Al came in the house.\n\n\t\tNAN\n\tHe's changed. Just this summer. Or\n\tsomething's changed him. Marty, maybe.\n\tAnd the drinking- I think it's almost\n\tstopped. Whatever it is, it's wonderful.\n\tAnd they'll be safe with him. I'm sure\n\tof it.\n\n\t\tBOB\n\tI know they'll be safe with him... but will\n\the get them both into bed by nine-thirty?\n\n\t\tNAN (firmly)\n\tIf I told him to, he will.\n\n\nINT.  THE WALL CLOCK IN THE COSLAW LIVING ROOM  NIGHT\n\nIt reads 1:00.\n\nSOUND: The National Anthem.\n\n\nINT.  THE TV, CU\n\nThe anthem finishes up. We go to a station ID card.\n\n\t\tANNOUNCER'S VOICE\n\tThis concludes WDML's broadcast day.\n\nThe TV goes to snow.\n\n\nINT.  JANE ON THE COUCH\n\nShe's mostly asleep in one corner.\n\n\nINT.  MARTY, IN THE SILVER BULLET\n\nHe's also dozing.\n\n\nINT.  UNCLE AL, IN BOB'S EASY CHAIR IN FRONT OF THE TV\n\nHe is also dozing. There are three or four empty beer cans\nin front of him, and a cigarette with a long ash is\nsmoldering between his fingers. There's a .22 pistol in his\nlap.\n\n\nEXT.  THE COSLAW HOUSE, FROM ONE SIDE\n\nThe WEREWOLF breaks from the woods and runs across the side\nyard to a line of high bushes that runs along the side of\nthe house (this is the opposite side from MARTY'S bedroom).\n\n\nEXT.  IN THE BUSHES, WITH THE WEREWOLF\n\nThere is a space in here between the house and the bushes-\nit's like an animal's run. The WEREWOLF creeps along this,\nits one eye flaring.\n\nDIM SOUND OF TV SNOW.\n\n\nINT.  THE LIVING ROOM, WITH MARTY, JANE, AND UNCLE AL\n\nUNCLE AL jumps up and cries out as the cigarette burns up to\nhis fingers. The .22 falls onto the rug.\n\nMARTY and JANE also wake up, startled.\n\n\nEXT.  IN THE BUSHES, WITH THE WEREWOLF\n\nIt recoils, eyes gleaming. Foam begins to drip from its\njaws. It creeps slowly along toward a window. TV SNOW SOUNDS\nGROW LOUDER.\n\n\nINT.  THE LIVING ROOM, WITH AL, JANE, MARTY\n\nUNCLE AL is shaking his burned hand; he picks the cigarette\nout of his lap and puts it out.\n\n\t\tJANE (sleepy)\n\tYou'll burn yourself up sometime doing\n\tthat, Uncle Al.\n\n\t\tUNCLE AL\n\tI suppose so. You kids ought to go up to bed.\n\n\t\tMARTY\n\tBut Uncle Al! You said-\n\n\t\tUNCLE AL\n\tI know what I said, Marty- but it's ten\n\tpast one. He's not coming.\n\n\t\tJANE\n\tThe moon's not down yet...\n\n\t\tUNCLE AL\n\tDamn near. Now I'll sit up with this\n\tstupid gun in my lap because I promised,\n\tbut you two are going to bed. Go on,\n\tnow, scoot.\n\nJANE gets up and starts toward the stairs.\n\n\t\tMARTY\n\tWhat if I say no?\n\n\t\tUNCLE AL\n\tThen I'd have to kick your ass, dear boy.\n\t(more kindly) Go on, now.\n\nMARTY begins to roll the Silver Bullet toward the stairs,\nwhere the stair chair awaits. JANE is waiting for him at the\nliving-room doorway. MARTY sees the gun on the floor and\nstops.\n\n\t\tMARTY\n\tIf that'd gone off, it would have been the\n\tend of our silver bullet.\n\n\nINT.  UNCLE AL\n\nHe prickles a bit at the unstated criticism. He bends down\nand picks up the pistol. He opens the cylinder. Five\nchambers are empty; in one there's a bright silver circle.\n\n\nINT.  UNCLE AL\n\nHe pushes the cylinder plunger, dropping the silver bullet\ninto his hand.\n\n\t\tUNCLE AL\n\tSee, dear boy? Totally unimpaired.\n\nBehind him, the WEREWOLF'S head appears in the window, its\ngreen eye flaring.\n\n\nINT.  BY THE LIVING ROOM DOORWAY, WITH MARTY AND JANE\n\nMARTY, looking toward UNCLE AL, sees nothing. JANE is\nlooking toward the window and she SCREAMS.\n\n\t\tJANE (shrieking)\n\tIt's him! It's the werewolf! I see him!\n\tIT'S THE WEREWOLF!\n\nShe's pointing at the window.\n\n\nINT.  UNCLE AL\n\nHe jumps up and looks around at the window- at this point AL\nhas the .22 with its cylinder open in one hand and the\nsilver bullet loosely held in the other.\n\nNothing in the window but darkness. UNCLE AL turns back to\nthe kids.\n\n\t\tUNCLE AL (sharply)\n\tYou see it, Marty!\n\n\nINT.  MARTY\n\n\t\tMARTY (shakes his head)\n\tI was looking at you...\n\n\nINT.  UNCLE AL\n\nHis shoulders slump a little with relief- now that the scare\nis over, his relief is tempered with irritation. They're\njust a couple of hysterical kids after all, and JANE is\nactually worse than MARTY. Polly Practical indeed!\n\n\t\tUNCLE AL\n\tA very familiar feeling is beginning to\n\tcreep over me.\n\n\nINT.  MARTY AND JANE, BY THE DOORWAY\n\nJANE is crying.\n\n\t\tMARTY\n\tWhat's that, Uncle Al?\n\n\nINT.  UNCLE AL\n\n\t\tUNCLE AL\n\tI feel like a horse's ass.\n\n\nINT.  MARTY AND JANE, BY THE DOORWAY\n\n\t\tJANE (weeping)\n\tI saw it, Uncle Al! I did!\n\nMARTY rolls a little closer to her and attempts to put a\ncomforting arm around her shoulder.\n\n\t\tJANE\n\tDon't you touch me, snotbrains!\n\n\t\tMARTY\n\tJane-\n\n\nINT.  UNCLE AL\n\n\t\tUNCLE AL\n\tWould you kids go to bed? My head's\n\tstarting to ache.\n\n\nEXT.  THE SIDE OF THE HOUSE, ECU\n\nWe see a clawed, hairy hand reach into the frame and close\naround a thick wire.\n\n\t\tWEREWOLF (voice)\n\tReeeal slow...\n\nIt yanks.\n\n\nINT.  THE LIVING ROOM, WIDE\n\nThe lights go out.\n\nJANE SHRIEKS.\n\n\t\tMARTY\n\tIt's here! It's outside!\n\n\nINT.  UNCLE AL\n\n\t\tUNCLE AL\n\tJane, it's just a power fai-\n\nHe's starting toward her. At that moment most of the wall-\nnot just the window it was looking through before but the\nwhole wall- crashes inward as the WEREWOLF bulls its way\nthrough, roaring.\n\nUNCLE AL whirls, raising the pistol automatically to fire-\nbut the cylinder is rolled out and all the chambers are\nempty. He has time to register surprise before the WEREWOLF\nsmashes him aside.\n\n\nINT.  UNCLE AL, A NEW ANGLE\n\nHe goes flying backward. The pistol goes one way, the silver\nbullet another.\n\n\nINT.  THE GUN\n\nIt spins into a living-room corner.\n\n\nINT.  THE SILVER BULLET, SLOW MOTION\n\nWe see it rise in the air, turning over and over. It comes\ndown, hits the floor, and rolls.\n\n\nINT.  THE HALLWAY FLOOR, WITH THE BULLET, SLOW MOTION\n\nIn the extreme f.g. is a heating vent. The bullet is rolling\ntoward it.\n\n\nINT.  MARTY AND JANE\n\n\t\tMARTY\n\tGet the gun!\n\nHe uses his hands to propel the ungainly Silver Bullet into\nthe hall.\n\n\nINT.  THE BULLET (THE REAL BULLET) AND MARTY, SLOW MOTION\n\nThe silver bullet rolls slowly toward the heating vent. In\nthe b.g. we see a frantic MARTY in his wheelchair.\n\nHe heaves himself out of it and falls full-length, grabbing.\n\nHis fingers touch the bullet, but that's all. It falls in\nthe heating vent.\n\n\nINT.  THE WEREWOLF, CU\n\nIt's roaring, furious, its one eye flaring.\n\n\nINT.  THE LIVING ROOM, WIDE\n\nUNCLE AL lies senseless against one wall, the front of his\nshirt bloody. JANE runs into the corner and grabs the\npistol.\n\nThe WEREWOLF picks up the easy chair and throws it through\nthe hole it made coming in. It picks up an end table and\nhurls it through the TV. Then it sees JANE and starts toward\nher.\n\n\nINT.  JANE, COWERING IN THE CORNER\n\n\nINT.  THE WEREWOLF, CU\n\nComes toward her.\n\n\nINT.  JANE IN THE CORNER\n\nShe makes as if to run one way.\n\n\nINT.  JANE AND THE WEREWOLF\n\nIt's only a couple of feet from her now, but again, it is\ntoying with her- it's making this reeeal slow.\n\n\nINT.  THE FIREPLACE TOOLS, CU\n\nA bloodstained hand grabs a poker.\n\n\nINT.  THE WEREWOLF AND JANE\n\nAs it tenses down to leap at her, UNCLE AL leaps at it and\nstrikes it across the back. It turns, ROARING.\n\nUNCLE AL hits it between the legs.\n\nIt BELLOWS and grabs the poker. It bends it and tosses it\naside. The glaring, savage expression on its face says that\nnow it will bend UNCLE AL and toss him aside.\n\n\nINT.  JANE\n\nShe breaks out of the corner and runs across the room toward\nthe door. Most of the way there she trips and falls.\n\n\nINT.  THE WEREWOLF, CU\n\nIts head whips around.\n\n\nINT.  MARTY, IN THE HALL\n\nHe's lying full-length. He's got the heater vent's grille\noff. One arm is down inside.\n\n\t\tMARTY (scream)\n\tJaney! The gun! THE GUN!\n\n\nINT.  JANE\n\nShe tosses it awkwardly.\n\n\nINT.  THE GUN, SLOW MOTION\n\nIt slides down the hall floor to MARTY like some strange,\nawkward shuffleboard disc, its cylinder still open.\n\n\nINT.  THE WEREWOLF\n\n\t\tWEREWOLF (snarls)\n\tMaa-aaa-rty...\n\nIt begins walking slowly across the living room, smashing\nthings out of its way.\n\n\nINT.  MARTY, IN THE HALL\n\nThe gun slides into his hand. Now he reaches into the\nheating duct again...\n\n\nINT.  IN THE HEATING DUCT, ECU\n\nThere's an elbow bend just below MARTY'S twisting, grasping\nfingers- the silver bullet lies here. It's less than half an\ninch out of reach.\n\n\nINT.  THE WEREWOLF, CU\n\n\t\tWEREWOLF (foaming)\n\tMaaa-aaa-rty...\n\n\nINT.  JANE, ON THE FLOOR\n\n\t\tJANE (sobbing)\n\tDon't you hurt him! Don't you hurt my brother!\n\nShe bites one of the WEREWOLF'S hairy ankles as it passes.\n\n\nINT.  JANE AND THE WEREWOLF\n\nIt roars with pain and kicks her aside. Then it looks back\ninto the hall. It is grinning. I believe it is thinking this\nis going to be better than a Thanksgiving dinner you don't\nhave to pay for.\n\n\t\tWEREWOLF\n\tReeeal slow, Maa-aaarty-\n\n\nINT.  MARTY, CU\n\nHe's reaching desperately into the duct and staring at the\napproaching WEREWOLF.\n\n\nINT.  IN THE HEATING DUCT, ECU\n\nMARTY'S fingers brush the bullet once... again... seize it.\n\n\nINT.  MARTY, IN THE HALL\n\nHe rolls over on his back and sticks the silver bullet\nblindly into one chamber of the cylinder and slams the\ncylinder closed.\n\n\nINT.  THE WEREWOLF, CU\n\n\t\tWEREWOLF\n\tBastard Marty!\n\n\nINT.  MARTY\n\nHe points the gun and pulls the trigger. There's only a\nclick. An expression of dismay on his face.\n\n\nINT.  THE WEREWOLF, CU\n\n\t\tWEREWOLF\n\tKill you...\n\n\nINT.  MARTY\n\nHe drags himself so he's half propped against the hall wall.\nHe pulls the trigger again. Click! Dismay becomes fear.\n\n\nINT.  THE WEREWOLF\n\nIt's reached the Silver Bullet. It smashes it aside. The\nBullet hits the wall.\n\n\nINT.  MARTY\n\nHolding the gun in both hands now, he pulls the trigger a\nthird time. Click!\n\nThe WEREWOLF'S shadow falls over him.\n\n\nINT.  WEREWOLF, ECU\n\n\t\tWEREWOLF\n\tBastard Marty!\n\nIt bends down, reaching.\n\n\nINT.  MARTY, ECU\n\nCraning back as if to drive himself into the wall, he pulls\nthe trigger again.\n\n\nINT.  THE BARREL OF THE .22 MAXI-CLOSE\n\nThe bullet flies from the barrel, gleaming silver.\n\n\nINT.  THE WEREWOLF\n\nThe silver bullet strikes him in his one remaining eye. He\nflies backward, hands clapped to his gushing face... and\ncrashes into MARTY'S Silver Bullet wheelchair. It sits\nthere, roaring... and then it begins to change.\n\n\nINT.  THE LIVING ROOM, WITH JANE\n\nShe lies there, sobbing.\n\n\t\tUNCLE AL (voice)\n\tYou okay, Janey?\n\n\nINT.  UNCLE AL AND JANE\n\nUNCLE AL is bloody and staggering but on his feet. He helps\nJANE up.\n\n\t\tJANE\n\tI'm all right... but Marty! Ma-\n\nSOUND: SHATTERING ROAR.\n\n\nINT.  THE WEREWOLF, ECU\n\nIts hands drop from its face. It is now blind in both eyes;\nit is half WEREWOLF and half LOWE.\n\nIt BELLOWS again, convulses... and dies.\n\n\nINT.  MARTY, ON THE FLOOR\n\n\t\tMARTY (calls)\n\tI'm all right. He's dead.\n\n\nINT.  UNCLE AL AND JANE\n\nHere's a creature that is mostly FATHER LOWE collapsed in\nthe remains of MARTY'S wheelchair; beyond it, MARTY is lying\non the floor. UNCLE AL goes by the corpse. JANE starts by...\nand LOWE sits bolt upright for a moment, grasping blindly at\nher.\n\nShe shrieks and darts aside. LOWE falls back, now really\ndead. I think. Until the sequel.\n\n\nINT.  THE HALL, WITH UNCLE AL, JANE, AND MARTY\n\nUNCLE AL puts a comforting arm around JANE, who is sobbing\nagain- hell, I'd be sobbing after that last one, myself- and\ndraws her down beside himself and MARTY.\n\n\t\tUNCLE AL (to MARTY)\n\tThere. I told you there weren't any such\n\tthings as werewolves.\n\nThey smile at each other with love.\n\n\t\tJANE (nervous)\n\tAre you sure it's dead? Or him? Or\n\twhatever it is?\n\n\t\tUNCLE AL\n\tIf it isn't now, it will be after I pound\n\tone of your mother's silver candlesticks\n\tthrough its heart.\n\n\t\tJANE (grimaces)\n\tOh Uncle Al, no!\n\n\t\tUNCLE AL (grim)\n\tOh yes, Janey. When I believe something, I\n\tbelieve it all the way.\n\nHe gets up and leaves.\n\n\t\tJANE\n\tAre you all right, Marty?\n\n\t\tMARTY\n\tAll except my legs... I don't think I can walk.\n\n\t\tJANE\n\tYou're a real booger, you know it?\n\n\t\tMARTY (smiles)\n\tI love you, Jane.\n\n\nEXT.  TARKER'S MILLS, LONG  NIGHT\n\nQuiet. Sleeping.\n\n\t\tJANE (voice-over)\n\tIt wasn't always easy for me to answer\n\tthat... but I could answer it that night,\n\tand I find I can say it now that the\n\tterrible events of that fall have receded\n\tto memories which seem little more than\n\tdreams in my mind.\n\n\nINT.  THE HALLWAY, WITH MARTY AND JANE\n\n\t\tJANE (hugging him)\n\tI love you, Marty.\n\n\nEXT.  TARKER'S MILLS, LONG\n\n\t\tJANE (voice-over; no more than a whisper)\n\tI love you, Marty... good night.\n\nTHE CAMERA PANS UP to the full moon.\n\n\t\t\t\t\tFADE OUT.\n\n\n\n\n\n\nSilver Bullet\nWriters :   Stephen King\nGenres :   Horror\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:35:42.384567"}