{"title": "Sister Act", "film_link": "/Movie Scripts/Sister Act Script.html", "script_link": "/scripts/Sister-Act.html", "info_raw": "\n\nSister Act Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (5.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Paul Rudnick\nGenres  Comedy  Crime  Musical\nScript Date : July 1991\nMovie Release Date : May 1992\n\nRead \"Sister Act\" Script\n\n\n", "script": "\n\n\n\n                               SISTER ACT\n\n\n\n                               Written by\n\n                              Paul Rudnick\n\n\n\n\n\n                                                 July 19, 1991 \n\n     Page 1.\n\n     SISTER ACT\n\n     FADE IN:\n\n     INT. ST. ANNE'S ACADEMY - AKRON, OHIO - CLASSROOM\n     We are in a parochial school classroom, in the late \n     Sixties.  The children all wear uniforms and sit at little \n     desks.  SISTER IMMACULATA stands at the front of the room; \n     she is a middle-aged nun, very severe.  The children are \n     all terrified of her.\n\n                               SISTER IMMACULATA\n               Who can name all the Apostles?  Yes?\n\n     ANGLE ON CHRISTINE CARTER\n\n     A thirteen-year-old girl sitting at a desk.  She raises \n     her hand.\n\n                               SISTER IMMACULATA\n               Christine?\n\n                               CHRISTINE\n               Sister, may I be excused?\n\n                               SISTER IMMACULATA\n               Christine...\n\n                               CHRISTINE\n               It's an emergency.  Real bad.\n\n     Sister Immaculata nods, pursing her lips.  Christine \n     stands and heads for the door.\n\n     \n                                                          CUT TO:\n\n     INT. GIRLS ROOM\n\n     Christine is now in the deserted St. Anne's girls room. \n     She is standing on tiptoes, looking in the mirror.  She has \n     taken her hair out of its neat barrettes; she is combing it \n     out.  She applies lipstick.\n\n     Christine reaches into her schoolbag; she pulls out a \n     stack of glittery bracelets and slips them on.  She \n     unbuttons the top few buttons of her stiff white blouse.  \n     She sprays herself with dime store cologne.\n\n                                                          CUT TO:\n\n     EXT. HALLWAY\n\n     Christine opens the girls' room door; she looks both ways.  \n     No one is around; she saunters down the hall.\n\n     Page 2.\n\n     ANGLE ON A DOOR MARKED BROOM CLOSET\n     Christine opens this door.  She looks into the closet. \n     There is a very nervous thirteen-year-old BOY waiting for \n     her inside.\n\n                               CHRISTINE\n               Hi, Jimmy.\n\n     Christine slips inside the closet and closes the door \n     behind her.\n\n     ANGLE ON SISTER IMMACULATA\n\n     Striding down the hall, with a bloodthirsty look in her \n     eye, and a nasty-looking wooden ruler in her hand.  She \n     flings open the broom closet door,\n\n     ANGLE ON CHRISTINE AND JIMMY\n\n     in the broom closet.  Jimmy's face is covered with \n     lipstick.  Christine's hair is awry.  The couple has \n     clearly been making out.\n\n                               SISTER IMMACULATA\n                             (outraged)\n               Miss Christine Carter!  Again!  Don't \n               you know what happens to girls like you?  \n               Don't you know what they become?\n\n     INT. CHRISTY'S APARTMENT - ANGLE ON A LARGE, TATTERED \n     POSTER-NIGHT (TODAY)\n\n     Taped over a crack on a wall.  The poster shows a \n     glittering CHRISTY VAN CARTIER:  singing star of a fifth-\n     rate Vegas lounge.  Christy wears tight spangles and a \n     major wig on the poster.  She has clearly lived up, or \n     down, to all of Sister Immaculata's expectations.\n\n     The CAMERA PANS through the dark bedroom in which the \n     poster hangs; a neon sign flashes outside the window, \n     casting a red and blue haze over the premises.  A dressing \n     room table is cluttered with dozens of bottles of nail \n     polish and makeup, and garish clothing and flashy jewelry \n     are scattered everywhere.\n\n     We hear the movement of BED SPRINGS as someone sits up in \n     the dark.\n\n                               CHRISTY'S VOICE\n               Come on, Vince -- hold me a minute.\n\n                               VINCE'S VOICE\n               I'd love to. babe -- but I've got to go.  \n               It was great.  Like usual.\n\n                               CHRISTY'S VOICE\n               It was twenty minutes.  Like usual.\n\n     Page 3.\n\n                               VINCE'S VOICE\n               The best.\n\n     VINCE LAROCCA stands at the mirror, adjusting his clothing \n     and checking his hair.  Vince is a powerful, charismatic \n     man who rules an organized crime empire with personal \n     magnetism and threat.  Vince's hold over Christy is \n     obvious, if unfortunate; he can seem expansive and generous \n     one minute, ruthless and dangerous the next.\n\n                               VINCE\n                             (half to Christy, half \n                             to the mirror)\n               You are something else.\n\n     Christy turns on a lamp and lights a cigarette.\n\n                               CHRISTY\n               Come on -- stay.  Just a little.  We can \n               talk, I'll get a pizza.  Pizza in bed, \n               we'll have fun.  And you still haven't \n               told me what happened.  What did she say?\n\n                               VINCE\n               What did who say?\n\n                               CHRISTY\n               Who?  The other woman.  Your wife.\n\n     Vince turns to face Christy, turning on the charm.\n\n                               VINCE\n               You are so damn sexy.\n\n                               CHRISTY\n               Vince...\n\n                               VINCE\n               How did I get so lucky?  What is it now, \n               five years we've been together?  Who do I \n               thank?\n\n                               CHRISTY\n                             (not buying it)\n               Today was the deadline, Vince.\n\n     Vince sits on the bed.  He takes Christy's hand, and \n     kisses it.\n\n                               VINCE\n               I want us to be together.  Like people.  \n               Honest, decent people.  In the eyes of \n               God.  Babe, today... I went to \n               confession.\n\n                               CHRISTY\n               You did what?\n\n     Page 4.\n\n                               VINCE\n               For the first time in I don't know how \n               long.  I wanted everything done right. \n               Open and above board.  I told Father \n               Antonelli I was in love.  I told him it \n               was a special love, for all the ages.\n\n                               CHRISTY\n                             (starting to fall for \n                             it)\n               You said that?  And what did he say?  \n               Did he say you could leave her?  Did he \n               say we'd be happy?\n\n                               VINCE\n                             (looking deep into her \n                             eyes)\n               He said that if I got a divorce I'd burn \n               in Hell.  For all eternity.\n\n     Vince kisses Christy's hands again and drops turns away \n     and starts putting on his shoes.\n\n                               CHRISTY\n               What?\n                             (outraged)\n\n                               VINCE\n               You want me to go against a priest?  Get \n               excommunicated?  You think I'm nuts?\n\n                               CHRISTY\n               You bastard!\n\n                               VINCE\n                             (trying to calm her)\n               We can still see each other.  Just like \n               always.  It's a different kind of sin. \n               Smaller.\n\n                               CHRISTY\n               You pig!\n\n     Vince backs off, and starts searching for his jacket.\n\n                               VINCE\n               Babe, it's not me!  I love you!  It's \n               God!\n\n                               CHRISTY\n               You lying sleazeball!  The best years of \n               my life!  What am I, garbage?  Am I lint?\n\n     Vince ducks as Christy throws an ashtray at him, and it \n     smashes against the wall.\n\n                               VINCE\n               You're upset.  I understand.  I should \n               go.  I hate to.\n\n     Page 5.\n\n     A CLOCK-RADIO hits the wall beside Vince's head.\n\n                               CHRISTY\n               Get out of here!  And never come back!\n\n     A LAMP hits the wall, as Vince dodges it.  He makes a \n     phone gesture with his hand.\n\n                               VINCE\n               I'll call.\n\n     Vince kisses two fingers, and blows the kiss to Christy. \n     He leaves.\n\n     Christy is left standing on the bed, holding a \n     particularly garish stuffed animal she was about to hurl.  \n     With Vince gone she slumps to the bed, cradling the stuffed \n     animal. She is caught between tears and rage.\n\n                                                          CUT TO:\n\n     EXT. LAS VEGAS - NIGHT\n\n     ANGLE on various neon Vegas landmarks -- the Golden \n     Nugget, Caesar's Palace, Bally's, etc.  Scrunched in \n     between two larger hotels and casinos is the MOONLIGHT \n     HOTEL AND CASINO.  The Moonlight isn't all that small, it's \n     just seen better days.\n\n     INT. LOUNGE - NIGHT\n\n     A spotlight hits a solitary figure on a small stage.  The \n     man is caped and dramatic, but not especially talented; an \n     Elvis impersonator who's just a shade off in voice, looks \n     and style.\n\n                               ELVIS\n               Good evening, ladies and gentlemen.  Are \n               you lonesome tonight?  Welcome to the \n               Moonlight Hotel and Casino's incredible \n               Platinum Oldies Spectacular.\n\n     Backstage, there's still a look of resolve in Christy's \n     eye as she waits to go on with MICHELLE and TINA, her back-\n     up singers.\n\n                               MICHELLE\n               But you can't quit.  What'll happen to \n               us?\n                             (to Tina)\n               Tell her she can't quit.\n\n                               TINA\n               I told her.  She stuck pantyhose in my \n               mouth.\n\n     Onstage, Elvis glances into the wings to be sure the \n     Ronelles are ready.\n\n     Page 6.\n\n                               ELVIS\n               Please welcome our own girl group \n               extraordinaire, our beehives of beauty --\n               the fabulous Ronelles!\n\n     Elvis disappears.  The spotlight hits Christy, who wears a \n     high beehive wig and a sequinned, early Supremes-style \n     gown.  Michelle and Tina wear matching gowns and wigs.  The \n     band begins a doo-wop vamp.\n\n                               CHRISTY\n               Oh, girls.\n\n                               RONELLES\n               Yes, Betty?\n\n                               CHRISTY\n               This prom is a real drag.\n\n                               RONELLES\n               Oh-huh.\n\n                               CHRISTY\n               Oh my!\n                             (gasping)\n\n                               RONELLES\n               What is it, Betty?\n\n                               CHRISTY\n               Look at that.  Get a gander.\n\n                               RONELLES\n               Oh my!\n                             (sighing)\n\n                               CHRISTY\n               He's so dreamy.  He's like... a Greek \n               god.  He's the cutest guy here.    He's \n               boss.  He's fab.  He's...\n\n                               RONELLES\n               Yes, Betty?\n\n                               CHRISTY\n                             (singing)\n               HE'S SO FINE.\n\n                               RONELLES\n               D00-LANG, DOO-LANG, D00-LANG.\n\n                               CHRISTY\n               WISH HE WAS MINE.  THAT HANDSOME BOY \n               OVER THERE, THE ONE WITH THE WAVY HAIR.\n\n     As they sing, their moves and gestures are carefully \n     choreographed in vintage girl group style.\n\n     Page 7.\n\n     A lot of talent and hard work has clearly gone into the \n     number.  While Christy does her best, her singing voice is \n     not on a par with those of the other Ronelles.\n\n     The lounge itself is practically empty, except for a few \n     drunken Shriners and a couple of college kids.  POLICE \n     LIEUTENANT EDDIE MULCAHY sits at a ringside table with his \n     eyes locked on Christy.  An easygoing charmer, Eddie gives \n     her a wink, but she responds with an up-yours look and a \n     turn to the other half of the room as the song continues.\n\n     INT. DRESSING ROOM - LATER\n\n     A small, cramped room with cracked plaster walls and a \n     sputtering fan for ventilation.  Christy has her own \n     dressing table and mirror, and the Ronelles share a table a \n     few feet away.  Clothing and costumes hang on nails or are \n     draped over chairs as the girls change into street wear.\n\n                               CHRISTY\n               Screw this dump.  It's a roach motel \n               with sequins.  Every guy I meet is either \n               married, a cop, or a lush from Des \n               Moines.\n\n                               MICHELLE\n               But what about us?\n\n                               TINA\n               You taught us the act.  The songs, all \n               the moves.\n\n                               CHRISTY\n               And where did it get me?  I'm stuck in \n               this rathole!  You're holding me back, \n               just like Vince!  I should be headlining!\n\n     A pock-faced weasel of a man named JOEY opens the door and \n     leans into the room.\n\n                               CHRISTY\n               What do you want?  This is a private \n               area!  Get lost!\n\n                               JOEY\n               You ain't got nothin' I ain't seen.\n\n                               CHRISTY\n               Then stop trying to memorize it.  Hit \n               the road.\n\n     Joey takes a step into the room and sets a box on the \n     chair near Christy.\n\n                               JOEY\n               From Vince.\n\n     Page 8.\n\n                               CHRISTY\n               His ashes?\n\n                               JOEY\n               With love.\n\n     Joey leaves.  Michelle and Tina hover around the box, very \n     excited.  They pick it up, trying to tempt Christy.\n\n                               MICHELLE\n               From Vince! With love!\n\n                               TINA\n               Michelle and Tina can't restrain \n               themselves: they open the box.  Inside is \n               a rather gaudy fur coat.  Michelle and \n               Tina are impressed.\n\n                               MICHELLE\n               It's a fur!\n\n                               TINA\n               It's new!\n\n                               CHRISTY\n               It's a bribe.  Five years of my \n               goddamned life!\n\n                               MICHELLE\n               So you earned it!\n\n                               TINA\n               Vince owns the casino!  Cash in\n\n                               CHRISTY\n               I should throw this in his facet\n\n     There's a KNOCK on the door, and Tina opens it.  \n     Lieutenant Eddie Mulcahy enters.  Christy is not pleased.\n\n                               CHRISTY\n               Oh, Jesus.  What is going on here?\n                             (to heaven)\n               Why me?  Whose dog did I kill?\n\n                               MICHELLE\n               Hi, Lieutenant.\n\n                               TINA\n               Hello, Eddie.\n\n     Eddie picks up the coat.\n\n                               EDDIE\n               From Vince?  What a guy.  Doo-lang, doo-\n               lang.\n\n                               CHRISTY\n               At least he's not a cop.  At least he \n               can afford a decent gift.\n\n                               EDDIE\n               I used to buy.you,..stuff.  On your \n               birthday .  When we were seeing each \n               other.\n\n                               CHRISTY\n               Yeah, like what?  Quilted coat hangers, \n               that your mother picked out?  Lottery \n               tickets?  A travel iron?\n\n                               EDDIE\n               So I don't shop.\n\n                               CHRISTY\n               'Cause you're always out, arresting \n               people.  Making trouble.  I don't know \n               why I went out with you in the first \n               place, it was embarrassing!  I couldn't \n               hold my head up, I used to tell people \n               you were a security guard!\n\n                               EDDIE\n               Oh, yeah? Well, how do you think I felt?  \n               You were singing in bowling alleys back \n               then.  I told people you were a hooker!\n\n                               MICHELLE\n               Calm down, you two.  It's always like \n               this.\n\n                               EDDIE\n               Yeah, well, now, she goes out with a' \n               better class of people.  Vince Laflocca.\n\n                               CHRISTY\n               He's a businessman.\n\n                               EDDIE\n               A what? When are you qonna wake up?\n\n                               CHRISTY\n               When are you gonna get off my case?  \n               Have you got a search warrant?  What do \n               you want -- cheap thrills?\n\n                               EDDIE\n               Information, baby.  I thought maybe \n               somebody around here might have a \n               conscience.\n\n                               CHRISTY\n               Think again!  And get out of here.\n\n     Page 10.\n\n                               EDDIE\n               I'm going.  My regards to Vince,   And \n               the Mrs.\n\n     Christy hurls a jar of cold cream at Eddie's head.  He \n     ducks, and the jar hits the door.\n\n                               EDDIE\n               Ladies.\n\n     Eddie leaves.  Christy is standing, absolutely furious.\n\n                               CHRISTY\n               That's it!  I'm not taking it from him, \n               and I'm not taking it from Vince!  From \n               now on, it's all about me!  And if I \n               can't spend it, drink it, or sleep with \n               it -- it's gone.  Like Sister Immaculata \n               used to say, \"Life is short, and then you \n               fry.\"  So long, girls -- see you in \n               church!\n\n     Christy grabs the mink and heads out the door.\n\n     INT. VINCE'S OFFICE - NIGHT\n\n     ERNIE SCHMIDT sits across the enormous mahogany desk from \n     Vince.  The young man's throat is dry; he's sweating \n     bullets.  The presence of Joey the weasel and WILLY, a \n     brutal thug, increases Ernie's tension.\n\n                               VINCE\n               Ernie Schmidt.  How long you been with \n               us, Ernie Schmidt?\n\n                               ERNIE\n               Three years, Mr. LaRocca.  One behind \n               the bar, two as croupier.\n\n     Vince gestures to the lush office and its furnishings.\n\n                               VINCE\n               Ernie, you know what's important to me?  \n               What counts?  It's not all this.  This is \n               '-- what?  Frosting.  Loyalty.  That's me, \n               Ernie.  That's home.\n\n     Vince gestures to Joey, who takes out a revolver and \n     points it at Ernie's head.\n\n                               VINCE\n               You ain't been loyal, Ernie.  What did \n               you tell the cops?\n\n     Ernie's eyes open wide with denial as the gun comes closer \n     to his temple.\n\n     Page 11.\n\n     INT. HOTEL LOBBY\n\n     Holding the coat, Christy waits by the elevator.  It \n     arrives; she gets in.\n\n     INT. VINCE'S OFFICE\n\n     The interrogation continues.\n\n                               ERNIE\n               I didn't tell the cops anything. I \n               swear.\n\n                               VINCE\n               Joey?\n\n     Joey slams Ernie on the side of the head with the gun.\n\n     INT. CORRIDOR\n\n     Christy steps out of the elevator and faces a maze of \n     office cubicles with half-wall partitions.  The floor is \n     deserted and dark as she makes her way through the \n     cubicles.\n\n     INT. VINCE'S OFFICE\n\n     Vince is standing over Ernie, holding his head up by the \n     hair.\n\n                               VINCE\n               Who else, Ernie?  Who else was in on it?\n\n                               ERNIE\n                             (moaning)\n               No one...\n\n                               VINCE\n                             (dropping Ernie's head \n                             in disgust)\n               Why am I wasting my time?\n\n     INT. EXECUTIVE CORRIDOR\n\n     Beyond the cubicles, Christy strides down a lush corridor \n     to an executive suite.  She tries the knob, but finds the \n     door locked.  Pulling a key from her purse, she unlocks the \n     door to the suite and enters a large outer office with a \n     reception area and doors to several inner offices.  She \n     tosses the key onto the receptionist's desk.\n\n                               CHRISTY\n               Won't need that anymore.  Ta-ta.\n\n     Crossing to Vince's office, Christy squares her shoulders \n     and narrows her eyes with anger as she reaches for the \n     doorknob.  She pauses for a second, and then doubles her \n     resolve.\n\n     Page 12.\n\n     INT. VINCE'S OFFICE\n\n                               VINCE\n               Do it.\n                             (to Joey)\n\n     ANGLE on the door to the office, which opens.  Christy \n     appears, with the mink coat in her arms.\n\n                               CHRISTY\n               Stuff this up your...\n\n     A GUNSHOT is heard, 0.S.  Christy's eyes widen, and her \n     jaw drops, at what she has just witnessed.\n\n     ANGLE on the office.  Ernie is slumped in the chair, dead. \n     Joey stands over him, holding the revolver.  Joey, Willy \n     and Vince stare at Christy.\n\n                               VINCE\n               Babe.\n                             (icy calm)\n\n     Christy tries to speak; she can't.\n\n                               VINCE\n               Christy.  Is there a problem?  With the \n               coat?\n\n     Christy glances around the room; she doesn't move.  She \n     quickly sizes up the situation.  She tries to appear \n     matter-of-fact. unaffected by what she's just seen.\n\n                               CHRISTY\n               No... it's fine. \n\n                               VINCE\n               Yes?\n\n                               CHRISTY\n               Thanks.  A lot.\n\n                               VINCE\n               Is that why you came up here, Christy? \n               To thank me?\n\n                               CHRISTY\n               Sure.\n\n                               VINCE\n               And to say you're sorry.  About this \n               afternoon.  And the things you said. \n               Forgotten.  Completely.  Do you \n               understand?  Forgotten.\n\n                               CHRISTY\n                             (catching the subtext)\n               Right.  Yeah.  Forgotten.\n\n     Page 13.\n\n     Vince crosses the room, to Christy.  He takes her hands in \n     his, and kisses them.\n\n                               VINCE\n               That's my girl.  My girl in mink.  Will \n               you be home?  Soon?\n\n     Christy kisses Vince, quickly.\n\n                               CHRISTY\n               Right.  I'll be... at the apartment.  \n               Call me.  Thanks.  Again.\n\n     Christy reaches for the doorknob, without looking at the \n     door.  She fumbles a bit.  She finds the door.\n\n                               CHRISTY\n               Mink.  Wow.\n\n     Christy walks backwards, out the door.  She turns; she is \n     gone.\n\n                               JOEY\n               Vince -- is she... okay?\n\n                               VINCE\n               Maybe.\n                             (considering this)\n\n                               WILLY\n               I mean, won't she talk? She seemed kind \n               of upset.\n\n                               VINCE\n               She did.\n                             (making a decision)\n               Bring her back.  Now.  For a talk.\n\n                               JOEY \n               And if she runs? \n\n                               VINCE\n                             (icy)\n               Take care of it.\n\n     With guns drawn, Willy and Joey run after Christy.\n\n     INT. RECEPTION AREA\n\n     Christy, clearly terrified, is walking quickly away from \n     Vince's office.  She passes through a glass door which \n     leads to the cubicle area.\n\n     LONG SHOT of the cubicle area, which resembles a darkened \n     maze.  Christy hears Joey approaching; she runs into the \n     cubicle area.\n\n                               JOEY\n               Christy?  He only wants to talk to you!\n\n     Page 14.\n\n     ANGLE on Christy, crouched behind a half-wall.  She is \n     clutching the coat.\n\n                               WILLY\n               Christy?\n\n     There is a stuffed toy, a \"Garfield the Cat,\" attached to \n     the wall near Christy, with suction cups.  Christy tries to \n     pull the cat's feet off the wall, very quietly.\n\n                               JOEY\n               Christy?\n\n     Christy finally just yanks the cat off the wall.  She \n     hurls it as high and as far as she can, to the opposite end \n     of the room.\n\n     ANGLE on the flying stuffed cat.\n\n     Joey sees the blur of the cat; he SHOOTS it, and the cat \n     explodes.\n\n                               JOEY\n               Come on, Christy!  There's no place to \n               go!\n\n     Christy steadies herself against a Xerox machine.  She \n     accidentally activates the machine, which lights up and \n     starts HUMMING.\n\n     ANGLE on Willy, as he hears the Xerox machine.  He quickly \n     moves toward the SOUND.\n\n     Willy reaches the Xerox machine; the area is deserted.  He \n     starts moving quickly down the aisle   A chair, the kind on \n     casters, comes rolling out of one of the cubicle doorways; \n     the chair hits Willy and he falls.\n\n     Christy runs out of the cubicle; Willy is on the floor, \n     struggling to get up.  As Christy sprints away, Willy \n     SHOOTS at her.  He misses, but a glass partition SHATTERS.\n\n     Christy runs for an open elevator, but it has been \n     summoned from another floor and the doors are beginning to \n     close. She runs even faster.  A BULLET whistles past her \n     ear and hits the back wall of the elevator.  She reaches \n     for the doors a moment too late, and the elevator is gone.\n\n     Christy scrambles to the door beside the elevator and runs \n     into a stairwell as two more BULLETS bite pieces out of the \n     door.\n\n     INT. STAIRWELL\n\n     Taking the stairs three at a time, Christy is flying, \n     still clutching the mink.  The thugs are gaining on her.  A \n     BULLET hits metal and RICOCHETS off several walls and \n     steps.\n\n     Page 15.\n\n     At the next landing, Christy opens the door and ducks into \n     a corridor.\n\n     INT. CORRIDOR\n\n     Exhausted but powered by adrenaline, Christy sprints past \n     doors to the end of the hall, still with the mink.  Joey \n     appears from the stairwell just as Christy ducks into a \n     supply room.\n\n     INT. SUPPLY ROOM\n\n     Christy shoves a cleaning cart aside and wades through a \n     pile of dirty linen.  Joey opens the door just as Christy \n     dives head first into the laundry chute.\n\n     INT. LAUNDRY CHUTE\n\n     Christy, lying atop the mink, flies through the chute like \n     a subway train through a tunnel.\n\n     INT. BASEMENT\n\n     The chute spits Christy out like a bullet into a huge bin \n     of dirty linen.  Two workers glance around as they load \n     large washing machines with laundry.  Christy climbs out of \n     the bin and dashes for a door.  Working in a hotel, the \n     workers have seen everything.\n\n     INT. LAUNDRY CHUTE\n\n     Joey flies through the chute.\n\n     INT. BASEMENT\n\n     Joey suddenly flies into the bin.  He climbs out with his \n     gun in sight.\n\n                               JOEY\n               Which way?\n\n     The workers point to the door, and Joey rushes across the \n     room.  One of the workers is now wearing the mink coat.\n\n     EXT. STREET - NIGHT\n\n     Joey comes out of the hotel and finds an empty street.  He \n     looks in every direction, but the nearby streets have \n     swallowed Christy into safety for the moment.\n\n     EXT. POLICE STATION - NIGHT\n\n     The central offices of the Las Vegas Police Department.\n\n     INT. MULCAHY'S OFFICE\n\n     Eddie's office is a glassed-in area set in the middle of \n     the station's main floor.\n\n     Page 16.\n\n     Christy is huddled in a chair, surrounded by Eddie and two \n     other detectives, CLARKSON and TATE.\n\n                               CHRISTY\n               Right between the eyes!  Down and out! \n               The guy was gone!  I... I couldn't \n               believe it!\n\n                               EDDIE\n               You couldn't believe it?  Vince the \n               Prince?\n\n                               CHRISTY\n               I never said he was an altar boy, okay?  \n               But he sent his goons after me!  They \n               tried to kill me!  I'm not kidding!\n\n                               CLARKSON\n               Tough break.  Whoa.\n\n                               EDDIE\n               What did you expect?  Vince is as dirty \n               as they come.  We've been finding bodies \n               around here for years.\n\n                               CHRISTY\n               I don't know anything about bodies!  I \n               mean, he didn't bring it home.  He was \n               good to me... sometimes.  He was sweet. \n               He took care of me.  Who am I supposed to \n               go out with?  He owns a casino.  He let \n               me sing.\n\n                               EDDIE\n               He didn't do you a favor.\n\n                               CHRISTY\n               Screw you!\n\n                               TATE\n               Come on, she'll sing great.  When she \n               sings for us.\n\n                               CHRISTY\n               Sing -- like testify?  Are you nuts?  I \n               just want you to protect me!  You're \n               cops!\n\n                               TATE\n               Busy cops.  We don't have time to be \n               bodyguards for anyone who comes in here \n               with some cockamamie story.  Mink coats \n               and laundry chutes.\n\n                               CLARKSON\n               Unless, of course, you're willing to \n               testify.\n\n     Page 17.\n\n                               CHRISTY\n               What is this, some squeeze play?  Can't \n               you just protect me without any strings?\n\n     The three detectives move in closer now and really apply \n     the pressure.\n\n                               EDDIE\n               We could put you into our witness \n               protection program.\n\n                               TATE\n               A hiding place. \n\n                               CLARKSON\n               A new identity.\n\n                               EDDIE\n               But you'd have to agree to testify.  The \n               whole nine yards.\n\n                               CHRISTY\n               And if I don't?\n\n                               EDDIE\n               Then-you run.\n\n                               TATE\n               You wait.\n\n                               CLARKSON\n               You listen for the footsteps.\n\n                               EDDIE\n               Then one day they find you.\n\n                               TATE\n               They open a window.\n\n                               CLARKSON\n               It's ten flights up.\n\n                               TATE\n               Ten flights down.\n\n                               CHRISTY\n               Ten flights?\n\n                               EDDIE\n               You'd lose.  You'd die.  All over the \n               sidewalk.  And into the street.\n\n                               CHRISTY\n               All right!  I get the picture!  I'll do \n               it!  I'll testify!\n\n                               EDDIE\n                             (to Tate) \n               Get a stenographer.\n\n     Page 18.\n\n     Tate leaves.  Christy looks to Eddie for a bargain now.\n\n                               CHRISTY\n               Okay, here's what I want.  I know about \n               this stuff.  A five-star hotel.  With \n               room service.\n\n                               EDDIE\n               Maybe Hawaii.\n\n                               CLARKSON\n               Diamond Head.\n\n                               CHRISTY\n               Yeah.  And I'll need a new look.  Like a \n               disguise.\n\n                               EDDIE\n               Maybe Armani.\n\n                               CLARKSON\n               No -- Calvin Klein.\n\n                               CHRISTY\n               For sportswear.  And a limo.  And my \n               hair -- up?\n\n                               CLARKSON\n               It could work.\n\n                               EDDIE\n               Jesus, what do you think this is --\n               Wheel of Fortune?  Let me spell it out \n               for you.  You have to hide like you don't \n               even exist.  You have to get so far \n               hidden away that you never see sunlight.\n\n                               CHRISTY\n                             (confused)\n               Okay -- no limo.\n\n                               EDDIE\n               No nothing.\n\n                               CHRISTY\n               What're you gonna do, put me in a bag \n               and bury me?\n\n                               EDDIE\n               I'm gonna put you in the last place on \n               Earth that Vince would ever look for you.\n\n     Eddie smiles.  Christy doesn't like the sound of this at \n     all a\n\n     Page 19.\n\n     INT. STAINED CLASS WINDOW - DAY\n\n     Jesus delivers the Sermon on the Mount in vibrant red, \n     blue and green stained glass.  An ORGAN plays a hymn -- \n     badly.  Notes are missed, skipped over and mutilated.\n\n     PAN DOWN to a procession of nuns who march into a chapel \n     at the ancient St. Katherine's Convent.  The organ isn't \n     getting any better, and we see it is being played by SISTER \n     ALMA, a seventy-year-old nun with arthritis and a hearing \n     aid.  Apparently the hearing aid is malfunctioning, because \n     Sister Alma doesn't seem to realize how badly she's \n     playing.\n\n     As the last nun in the procession enters the chapel, she \n     closes the door behind her.  Across the lobby, the front \n     door opens and Eddie enters with a very reluctant Christy.\n\n                               CHRISTY\n                             (to Eddie)\n               I hate you.  I totally hate you.\n\n                               EDDIE\n               Safest place in the world.  You think \n               Vince would look for you here?\n\n     As Christy looks around the lobby, various religious \n     artifacts loom at her; we see them from her terrified P0V. \n     ANGLE on a crucifix, casting an ominous shadow, a stack of \n     hymnals, and a large, framed Sunday School-style portrait \n     of St. Katherine.  Christy shudders.\n\n                               CHRISTY\n               Nuns, Eddie.  There are nuns here. \n               Everywhere.  It's crawling with 'em.\n\n                               EDDIE\n               It's a convent.  All you have to do is \n               shut up, behave yourself, and get along.\n\n                               CHRISTY\n               With nuns?  With rulers?  No way.  I'm \n               gonna go back, work things out with \n               Vince.\n\n     Christy turns to head back to the entrance, but Eddie \n     catches her arm.\n\n                               EDDIE\n               Vince has put out a contract on you.  A \n               hundred grand.  You've seen him in \n               action.\n\n     Christy searches his eyes for a lie, but realizes he's \n     telling the truth.\n\n                               CHRISTY\n               But... but Vince loves me.  How could \n               he... I mean, five years...\n\n     Page 20.\n\n                               EDDIE\n               And one bullet.  That's all it's gonna \n               take.\n\n                               CHRISTY\n                             (suddenly scared)\n               But Vince has contacts all over the \n               place!  This is San Francisco!  They'll \n               be looking for me!\n\n                               EDDIE\n               Everywhere but this little hole-in-the-\n               wall convent.  Nobody knows you're here \n               but me.  We're trying to get a quick \n               court date.  A month, maybe two, tops. \n               I'll spring you as soon as I can.\n\n                               CHRISTY\n                             (panicking)\n               I can't stay here!  I'll crack up! \n               Eddie, what am I gonna do?\n\n                               EDDIE\n               Pray.\n                             (smiling)\n\n     From inside the chapel, the CHOIR begins to sing a hymn --\n     horribly.  The voices don't blend, and individual notes are \n     real migraine material.  Christy looks aghast.  Eddie urges \n     her into a corridor, and she follows.\n\n     INT. MOTHER SUPERIOR'S OFFICE\n\n     The office is bare and austere.  MOTHER SUPERIOR sits at \n     her desk with her hands folded.  Like all the nuns at the \n     convent, she wears the traditional full-length habit and \n     wimple.\n\n     Mother Superior is in total command of all she surveys, \n     and she seldom raises her voice or her blood pressure as \n     she rules.  Control is her passion; within the walls of the \n     convent, she has created a world she can trust because it's \n     a world she controls.\n\n               But Mother Superior is not in control at \n               this particular moment.  BISHOP GEORGE \n               O'HARA stands before her with a majestic \n               presence and some bad news.\n\n                               MOTHER SUPERIOR\n               Absolutely not.  I am very sorry, but \n               no.\n\n                               O'HARA\n               We can save this young woman's life, and \n               imprison a parasite -- all in one \n               gesture.\n\n     Page 21.\n\n                               MOTHER SUPERIOR\n               But she's been exposed to the underside \n               of life.  She is the underside of life.\n\n                               O'HARA\n               And therefore an ideal prospect for \n               rehabilitation.\n\n                               MOTHER SUPERIOR\n               We're a small convent, Bishop.  Surely \n               there are... more appropriate shelters.\n\n                               O'HARA\n               Your small convent is in danger of \n               closing, Reverend Mother.  The Las Vegas \n               Police Department has offered to make a \n               generous financial donation.\n\n                               MOTHER SUPERIOR\n               But, Bishop...\n\n                               O'HARA\n               St. Katherine's is a Benedictine Order. \n               You have taken a Vow of Hospitality.  To \n               all in need.\n\n                               MOTHER SUPERIOR\n               I lied.\n\n                               O'HARA\n               I know.\n                             (smiling)\n\n     Mother Superior's jaw locks.  She realizes she is stuck \n     with the situation and will have to control it as best she \n     can.  There is a KNOCK at the door, and Eddie and Christy \n     enter.\n\n                               O'HARA\n               Welcome, Lieutenant.  Everything is in \n               order.\n\n                               EDDIE\n               Aces.  Bishop -- maybe a cup of coffee, \n               down at the corner?\n\n     The thought of being left alone with Mother Superior \n     panics Christy, like a child left in the principal's \n     office.\n\n                               CHRISTY\n               Hey, you're not leaving me alone...\n\n                               O'HARA\n                             (reassuringly)\n               You're never alone in this house, my \n               child.\n\n     Eddie touches her gently on the arm.\n\n     Page 22.\n\n                               EDDIE\n               One month, two tops.  Behave yourself.\n\n                               MOTHER SUPERIOR\n               Bishop...\n                             (a last-ditch attempt)\n\n                               O'HARA\n                             (opening the door to \n                             leave)\n               Lieutenant?\n\n                                                          CUT TO:\n\n     EXT. THE CONVENT - A FEW SECONDS LATER\n\n     Eddie and Bishop 0'Hara are leaving, by the convent's \n     front door.  As they exit, they hear the CHOIR, singing \n     horribly. They both wince at the sound, and then chuckle.\n\n     INT. MOTHER SUPERIOR'S OFFICE\n\n     Christy is pacing, outraged at her new situation.\n\n                               CHRISTY\n               A convent?  They put me in a convent? \n               What's the problem?  Wasn't there any \n               more room in Hell?\n\n                               MOTHER SUPERIOR\n                             (very calm)\n               What is your full name?  Your Christian \n               name?\n\n                               CHRISTY\n               Mother Theresa.  Gandhi.  Don't you \n               understand?  This is all a mistake.  I'm \n               the good guy.  I'm the witness.  And I'm \n               being punished!\n\n                               MOTHER SUPERIOR\n               Your name?\n\n                               CHRISTY\n               Christy.  Christy Van Cartier.\n\n                               MOTHER SUPERIOR\n               Enough joking.\n\n                               CHRISTY\n               That's my real name!  Currently I'm a  \n               singer.  Sort of.\n\n                               MOTHER SUPERIOR\n               Very well.\n\n                               CHRISTY\n               Oh my God.  This isn't happening, tell \n               me this isn't happening.  It's a \n               nightmare, I'm back at St. Anne's!\n\n     Page 23.\n\n                               MOTHER SUPERIOR\n               St. Anne's?\n\n                               CHRISTY\n               Parochial school.  Akron.  St. \n               Android's.\n\n                               MOTHER SUPERIOR\n               You were unhappy?\n\n                               CHRISTY\n               I was expelled!  When I was fifteen?\n\n                               MOTHER SUPERIOR\n               The reason?\n\n                               CHRISTY\n               Beats me!  What do you think?  Smoking! \n               Heavy petting, without a chaperone. Heavy \n               petting, with the chaperone.  And wearing \n               a black bra, under my uniform.  The demon \n               bra.\n\n                               MOTHER SUPERIOR\n               I see.\n\n                               CHRISTY\n               You see?  You see?  I have to get out of \n               here   I have to make a phone call.  \n               Don't you get  it?  I'm in a convent!  \n               You're a nun!\n\n                               MOTHER SUPERIOR\n                             (very stern)\n               Sit down.\n\n                               CHRISTY\n               What?\n\n     Mother Superior rises.  She is an extremely imposing \n     woman. \n\n                               MOTHER SUPERIOR\n               Sit.\n\n     Christy sits in a wooden chair across from Mother \n     Superior.\n\n                               MOTHER SUPERIOR\n               Miss Van Cartier. \n\n                               CHRISTY\n               What?\n                             (belligerent)\n\n                               MOTHER SUPERIOR\n               Your cigarette -- out.\n\n     Christy inspects her cigarette.\n\n     Page 24.\n\n                               MOTHER SUPERIOR\n                             (ruefully)\n               It has come to pass.\n\n                               CHRISTY\n               What?\n\n                               MOTHER SUPERIOR\n               I joined this convent some thirty years \n               ago.  At that time, the world knew some \n               measure of peace.  And hope.  Our order \n               was a beacon of hospitality, to families, \n               to children, to a neighborhood filled \n               with promise.  And, as the years have \n               passed, I have watched that promise \n               destroyed.  Drugs.  Gangs.\n                             (staring at Christy's \n                             outfit) Spandex.  And. \n                             so I have made this \n                             convent an oasis, a \n                             retreat from horror. \n                             And now that horror has \n                             invaded these sacred \n                             walls.\n\n                               CHRISTY\n               Are you talking about me?\n\n                               MOTHER SUPERIOR\n               And all those like you.\n\n                               CHRISTY\n               You mean black people?\n\n                               MOTHER SUPERIOR\n               Absolutely not.  I mean the wicked.  The \n               heedless.  And their Las Vegas \n               concubines.\n\n                               CHRISTY\n                             (very suspicious) \n                             What's a concubine?\n\n                               MOTHER SUPERIOR\n               Check your driver's license.\n\n     Christy stands, facing off with Mother Superior.\n\n                               CHRISTY\n               Fine.  Got it.  Look, the way I see it, \n               I'm stuck here, right?  I mean, I'm here \n               or I'm target practice.  So here's the \n               deal -- I don't bug you, you don't bug \n               me.  I'll catch up on some sleep, watch \n               some tube, lay back and lay low.  So just \n               get me a key and show me to my room, and \n               do not disturb.  Capisce?\n\n                               MOTHER SUPERIOR\n                             (suspiciously \n                             gracious)\n               Of course.  But it's almost lunch.\n\n     Page 25.\n\n                               CHRISTY\n               Cool.  Is there a menu?  Or buffet?\n\n                               MOTHER SUPERIOR\n               Before we do, you might like to freshen \n               up.  And you'll certainly want to change\n\n                               CHRISTY\n                             (sniffing her clothes, \n                             the same outfit she's \n                             had on since the night \n                             at Vince's office)\n               Deal.\n\n     INT. CONVENT CHANGING ROOM\n\n     A small room, with a sewing machine, some bolts of fabric, \n     and several wooden cabinets.  There is a wooden screen in a \n     corner, marking a changing area.  Christy is behind the \n     screen; we hear her, but do not see her,  Mother Superior \n     stands beside the screen, catching the various items of \n     clothing which Christy tosses to her.\n\n                               CHRISTY (O.S.)\n               How about a robe?  One of those big \n               terry cloth jobs, with like embroidery on \n               the pocket.  \"Guest of St. Katherine's\"\n\n                               MOTHER SUPERIOR\n               Would you like that?\n\n     Mother Superior takes Christy's skirt and blouse, and \n     tosses them down a chute marked \"INCINERATOR.\"\n\n                               CHRISTY (O.S.)\n               You should hand-wash that blouse, and \n               send somebody out for some things.  I \n               look good in reds, purples, hot pink --\n               and shoes.  Five-inch heels.  Fuck-me \n               pumps.  Oh, man -- sorry.   'Scuse my \n               mouth.\n\n     Mother Superior carries Christy's lacy bra at the end of a \n     ruler; it goes down the incinerator.\n\n                               MOTHER SUPERIOR\n               Excused.  Open the cabinet to your left. \n               You will find appropriate attire.\n\n                               CHRISTY (O.S.)\n               Can do.\n\n     INT. CHAPEL\n\n     A group of nuns are praying, their heads bowed.  They hear \n     a muffled SCREAM, from elsewhere in the convent. They look \n     up, puzzled.\n\n     Page 26.\n\n     INT. CONVENT CHANGING ROOM\n\n     Christy is standing before a full-length mirror, staring \n     at herself, in complete shock.  She now wears a habit and \n     wimple.  Mother Superior is doing final adjustments on the \n     wimple.\n\n                               CHRISTY\n                             (almost unable to \n                             speak)\n               No!  No!  I can't do this!\n\n                               MOTHER SUPERIOR\n               Normally dressed, you are a sore thumb, \n               and you endanger us all.  While you are \n               here, you will conduct yourself as a nun.  \n               Only I shall know who, and what, you \n               truly are.  You will not disrupt the \n               convent.  You will not influence the \n               Sisters with your colorful street talk. \n               You will draw no attention to yourself in \n               any way.\n\n                               CHRISTY\n                             (furious, in \n                             disbelief)\n               But look at rites  Look at this!  I'm a \n               nun!  I'm invisible!  I'm a penguin!\n\n                               MOTHER SUPERIOR\n               As of now, and until you leave, you are \n               Sister Mary Clarence.\n\n                               CHRISTY\n                             (outraged)\n               Mary Clarence?  Like a guy?  Like a dumb \n               guy?\n\n     INT. CONVENT HALLWAY - A MINUTE LATER\n\n     Mother Superior is striding down the hall.  Christy is \n     beside her, trying to get the hang of her new outfit.\n\n                               MOTHER SUPERIOR\n               The Mary is in deference to the Holy \n               Mother, the Clarence in honor of Saint \n               Clarence Loyola.  There are three vows \n               that every nun must accept.  The vow of \n               poverty...\n\n                               CHRISTY\n                             (pulling out her \n                             pockets)\n               No problem.\n\n                               MOTHER SUPERIOR\n               The vow of obedience.\n\n                               CHRISTY\n               Like to who?\n\n     Page 27.\n\n                               MOTHER SUPERIOR\n               And the vow of chastity.\n\n                               CHRISTY\n               I'm outta here.\n\n     Christy starts to leave; Mother Superior grabs her by the \n     wimple\n\n     INT. CONVENT DINING HALL\n\n     A large, whitewashed gothic room, with oak beams and a \n     crude iron chandelier.  There is a long, central wooden \n     table, with rough wooden benches.\n\n     The convent's population is standing around the table in \n     silence.  There are about thirty nuns in all.\n\n     Mother Superior moves to the head of the table, with \n     Christy following her.  She motions for Christy to stand at \n     her right.\n\n                               MOTHER SUPERIOR\n               Good afternoon, Sisters.  I apologize \n               for my tardiness.  I would like you to \n               welcome a new member of our order, Sister \n               Mary Clarence.\n\n     ANGLE on SISTER MARY ROBERT, the nun standing beside \n     Christy.  Sister Mary Robert is naive and mouse- like, but \n     very sweet.  She has only been at the convent a few years; \n     she wears the simpler habit of a novice.  She sneaks a look \n     at Christy.  Her eyes widen, and then she resumes staring \n     at her hands.\n\n                               MOTHER SUPERIOR\n               Mary Clarence comes to us from a \n               somewhat more progressive convent.  She \n               is eager for a more disciplined life, and \n               will make every effort to conform to our \n               ways.\n\n     Everyone sits, including Christy.  SISTER MARY PATRICK, a \n     nun seated at the middle of the table, waves her hand. Mary \n     Patrick is extremely cheerful, a truly upbeat person.\n\n                               MOTHER SUPERIOR\n               Yes, Mary Patrick?\n\n                               MARY PATRICK\n               Reverend Mother, on behalf of the \n               sisters, I'd like to welcome Mary \n               Clarence to St. Katherine's.\n\n     ANGLE on Christy, looking thoroughly disgusted. \n\n     Page 28.\n\n                               MARY PATRICK\n               As part of our welcome, I've had a \n               little thought, just for fun.  Could we \n               have our new friend offer today's \n               blessing?\n\n     ANGLE on the nuns, watching Christy.\n\n                               MOTHER SUPERIOR\n                             (reluctantly)\n               Very well.  Mary Clarence, rise please.\n\n     Christy stands up slowly, aghast.\n\n                               CHRISTY\n               A blessing?  Like, for lunch?\n\n     ANGLE on Mary Patrick, beaming.  She and the other nuns \n     bow their heads.\n\n                               CHRISTY\n                             (trying to recall a \n                             blessing)\n               For what we are about to receive...\n\n     So far, so good.  Mother Superior has one eye open.\n\n                               CHRISTY\n               may the Lord... prepare us and... watch \n               us and... walk through the valley and be \n               our shepherd and... to the republic for \n               which it stands... God bless us every \n               one, hallowed be thy name.  Hallelujah.  \n               Ave Maria. Boyardee.  Amen.\n\n     ANGLE on the nuns, staring at Christy. Mother Superior \n     rises, very quickly.\n\n                               MOTHER SUPERIOR\n               Sisters, for the rest of the day we \n               shall declare a Vow of Silence.\n\n                               CHRISTY\n               A what?\n\n                               MOTHER SUPERIOR\n               Surely you are familiar with this \n               practice, Mary Clarence.  Only when our \n               lips are silent, can our prayers truly be \n               heard.\n\n                               CHRISTY\n               Silence?  No talking?  All day?\n\n                               MOTHER SUPERIOR\n               Until sundown.\n\n     Page 29.\n\n                               CHRISTY\n                             (mouthing the words. \n                             without speaking aloud)\n               Oh my God.\n\n     Christy reaches for a piece of bread.\n\n                               MOTHER SUPERIOR\n               And Mary Clarence?\n\n     Christy looks up.\n\n                               MOTHER SUPERIOR\n               As a new member of our order, I think \n               you might also enjoy a ritual fast.\n\n                               CHRISTY\n                             (mouthing the words)\n               A what?\n\n                               MOTHER SUPERIOR\n               A fast.  To remind us of the poor, of \n               those who must endure without enough to \n               eat.\n\n                               CHRISTY\n                             (mouthing)\n               No food?\n\n                               MOTHER SUPERIOR\n                             (taking away Christy's \n                             plate)\n               No food.  Not until sundown.\n\n     ANGLE on Christy, clutching her fork, hungrily watching \n     the other nuns eat.\n\n     EXT. POLICE STATION - DAY\n\n     Vince leaves the police station with his henchmen, Joey \n     and Willy, and LARRY NARREN, an attorney.  Vince is \n     steaming as they walk through the parking lot.\n\n                               VINCE\n               They grilled me for six hours in there. \n               And my hotshot lawyer -- where the hell \n               were you?\n\n                               LARRY\n               It takes time, Vince.  Slow and steady. \n               We've been through this before.\n\n     Vince reaches his car.  As Joey opens the door for him, \n     another car drives by, and stops.  Eddie is driving; he \n     leans out the window.\n\n                               EDDIE\n               So long, Vince.  See you soon.\n\n     Page 30.\n\n     Vince lurches toward Eddie; Larry restrains him.  Eddie \n     drives off, chuckling.\n\n                               VINCE\n               He's so damn cocky.  This is different.\n\n                               JOEY\n               It's a bluff, Vince.\n\n                               VINCE\n               You know so much.  They've got Christy, \n               and we've got to find her.  Get her 8x10, \n               from in front of the lounge.  Fax it to \n               every contact we got.\n\n     Larry covers his ears with both hands.\n\n                               LARRY\n               I can't hear this.  I'm an attorney, \n               Vince, and you're just an honest casino \n               owner.  Object of a witch hunt. Innocent \n               victim.\n\n                               VINCE\n               Keep the message vague, but let 'em \n               know.  The price has gone up.  Christy \n               Van Cartier -- a quarter of a million.  \n               Dead or nearby.\n\n     Vince looks grim and vindictive, as he gets into the car.\n\n     EXT. CONVENT VEGETABLE GARDEN - DAY\n\n     The vegetable patch is located behind the convent, on a \n     patch of land surrounded by high walls.  Various sections \n     have been partitioned with string and then furrowed.\n\n     Several nuns are working in the patch, weeding and raking. \n     They wear large, ungainly straw hats over their wimples.\n\n     Christy has been given a hoe and a straw hat.  She is \n     hacking at the dirt, with great disinterest.  She picks up \n     a carrot from the vegetable patch; she looks around to see \n     if anyone is watching.  She starts to gnaw on the carrot.  \n     She becomes aware that someone is watching her.  She looks \n     up.\n\n     Sister Mary Robert is watching Christy eat the carrot, \n     breaking her fast.  Christy drops the carrot on the ground, \n     as if it burned her.  Mary Robert resumes hoeing in the \n     next furrow over.\n\n     Christy stares at Mary Robert, narrowing her eyes.  \n     Christy looks around; all the other nuns are busy at their \n     tasks.  Christy decides that she will try and make Sister \n     Mary  Robert talk.  She picks up the carrot and tosses it \n     at Mary Robert.  Mary Robert jumps.  She waggles a finger \n     at Christy, scolding her.  Mary Robert resumes hoeing.\n\n     Page 31.\n\n     Christy is now determined.  She takes her hoe, and tiptoes \n     nearer to Mary Robert.  Very gently, she uses the handle of \n     the floe to lift Mary Robert's skirt, and gooses her.\n\n     Mary Robert vips, very loudly.  All the other nuns turn \n     and stare at Mary Robert, scolding her.  Christy waggles \n     her finger at Mary Robert, scolding her.\n\n     Christy, giggling to herself, resumes hoeing.  She sees \n     Mother Superior, standing at the end of the furrow.  Mother \n     Superior looks extremely grim; she has not missed anything.\n\n     EXT. SUNSET - THAT NIGHT\n\n     LONG SHOT of the sun going down, ending the nuns' Vow of \n     Silence.\n\n     We hear Christy SCREAM, O.S.\n\n     INT. CONVENT HALLWAY - THAT NIGHT\n\n     This hallway is marked by a series of heavy wooden doors \n     with tiny, grilled windows.  These are the cells where the \n     nuns sleep.  Nuns are entering their cells and closing \n     their doors for the night.\n\n     Mother Superior glides down the hall, followed by a dusty, \n     bedraggled Christy.  Christy is devouring a slice of brown \n     bread.\n\n                               CHRISTY\n               Is this all the food I get?\n\n                               MOTHER SUPERIOR\n               Yes.  Until breakfast.\n\n                               CHRISTY\n               That's tomorrow!  Don't you have any \n               snacks?  Machines?\n\n     They stop by a door.\n\n                               MOTHER SUPERIOR\n               This shall be your cell, Mary Clarence.\n\n                               CHRISTY\n               My what?\n\n                               MOTHER SUPERIOR\n               Your cell.  Your room.\n\n     INT. CHRISTY'S CELL\n\n     The door swings open, and Mother Superior and Christy \n     enter.  The room is tiny, with bare plaster walls.  There \n     is a narrow wooden bed, with a thin muslin-covered \n     mattress.  There is a small nightstand and a wooden stool.\n\n     Page 32.\n\n                               CHRISTY\n                             (looking around)\n               You were right the first time.  Is this \n               like, solitary?  The cooler?  Where's the \n               furniture?\n\n                               MOTHER SUPERIOR\n               Our lives are simple.  We have little \n               need for material possessions.\n\n                               CHRISTY\n               Right, sure thing.  But what about, \n               like, appliances?  Like a little color \n               portable?  Boom box?\n\n                               MOTHER SUPERIOR\n               Useless distractions.\n\n                               CHRISTY\n                             (sinking to the bed)\n               It's like the Stone Age.  The room time \n               forgot.  What about a phone?\n\n                               MOTHER SUPERIOR\n               And whom would you call?\n\n                               CHRISTY\n               Oh, I don't know... Satan?\n\n                               MOTHER SUPERIOR\n                             (not amused) \n               Your cell is more than adequate.\n\n                               CHRISTY\n               Right.  So what do we do now?  Ping-\n               Pong?  Row over to the monastery?\n\n                               MOTHER SUPERIOR\n               It is nine p.m.  Pleasant dreams.\n\n                               CHRISTY\n               Wait.  No.  You're kidding.  Lights out? \n               At nine?  My day's just starting.\n\n                               MOTHER SUPERIOR\n                I'm sure.  If I were you, I would use \n               this time, to think about my life.  And \n               its direction.  Or lack thereof.\n\n                               CHRISTY\n                             (indignant)\n               What's wrong with my life?\n\n                               MOTHER SUPERIOR\n               From all I've heard, just about \n               everything.  Your singing career seems \n               all but nonexistent, and your married \n               lover wants you dead.\n                             (MORE)\n\n     Page 33\n\n                               MOTHER SUPERIOR (CONT'D)\n               If you're fooling anyone, it's only \n               yourself.  God has brought you here. Take \n               the hint.\n\n     Mother Superior leaves.\n\n     After the door shuts, Christy stands and looks out the one \n     small window in her cell.  She leans her head against the \n     wall.  She is trying not to think about what Mother \n     Superior has said.  Still, the mess her life has become \n     overwhelms her.  She fights back tears.\n\n     EXT. CONVENT - DAY\n\n     The sun is just barely rising, as the convent BELL tolls.\n\n     INT. CHRISTY'S CELL\n\n     Christy is fast asleep.  There is a RAPPING at the door.\n\n                               MARY ROBERT (0.S.)\n               Sister Mary Clarence!\n\n     EXT. CONVENT HALLWAY\n\n     All the nuns are proceeding, in their simple robes and \n     nightshirts, down the hallway.\n\n     Christy's door opens; she is still in her nightshirt, and \n     her hair is a mess.\n\n                               CHRISTY\n               What?\n\n     Mary Robert, in her nightshirt, stands outside.\n\n                               MARY ROBERT\n               Come on, we're late.\n\n                               CHRISTY\n               What?  What time is it?\n\n                               MARY ROBERT\n               It's after five.  We have to bathe.\n\n                               CHRISTY\n                             (groaning)\n               Five a.m.?\n\n     INT. HALLWAY OUTSIDE BATHING ROOM - A FEW MINUTES LATER\n\n     Christy is standing on line in the hall, along with \n     several other nuns; they are waiting to take showers.  They \n     carry soap and towels.\n\n     Page 34.\n\n                               MARY PATRICK\n                             (sincerely)\n               Isn't it a glorious morning?  Good \n               morning, Mary Clarence.  sleep well?\n\n                               CHRISTY\n               Right.\n\n                               MARY ROBERT\n               Is this like your old convent?\n\n                               MARY PATRICK\n               Which convent was that, Sister?\n\n                               CHRISTY\n               Which convent?  It was, um, the Little \n               Sisters... of the Moonlight.  In Vegas. \n               Everybody used to come to Mass.  Frank. \n               Dean.  Sammy.  Right at ringside. \n\n                               MARY LAZARUS\n               Enough jabber.\n\n     MARY LAZARUS is a much older nun; she is very no-nonsense, \n     a hard-liner.\n\n                               CHRISTY\n               What?\n\n                               MARY LAZARUS\n               Progressive convents.  Vanity.  It \n               sounds awful.  It sounds just like this \n               place.\n\n                               CHRISTY\n               Like this place?\n\n                               MARY LAZARUS\n               I like my old convent, in Vancouver. Out \n               in the woods.  It wasn't all modern, like \n               here.  No electricity.  Cold water. Bare \n               feet.  Those were nuns.  It was Hell on \n               earth, but I loved it.  This place is a \n               Hilton.\n\n     INT. BATHING ROOM\n\n     A stone room that is very medieval-looking.  One wall is \n     divided into stalls by wooden partitions.  In each stall is \n     a nun, standing beneath a crude shower head that releases a \n     thin stream of lukewarm water.  We see only the nuns' heads \n     and shoulders.\n\n     Still sleepy, Christy leans against the wall of her stall, \n     her eyes closed.  Lost in thought, she begins singing \n     softly to herself.\n\n     Page 35.\n\n                               CHRISTY\n               MY BOYFRIEND'S BACK\n               AND YOU'RE GONNA BE IN TROUBLE\n\n                               A FEW OTHER NUNS\n                             (very softly)\n               HEY-LA, HEY-LA\n\n     Christy looks up from her reverie; she looks around.  The \n     other nuns are bathing, their eyes down.  There is no sign \n     of singing.  Christy decides to try a test.\n\n                               CHRISTY\n               MY BOYFRIEND'S BACK\n               HE'S GONNA SAVE MY REPUTATION\n\n                               A FEW OF THE NUNS\n                             (still very softly)\n               HEY-LA, HEY-LA\n\n                               CHRISTY\n               IF I WERE YOU,\n               I'D TAKE A PERMANENT VACATION\n\n                               A FEW OF THE NUNS\n               HEY-LA, HEY-LA\n               MY BOYFRIEND'S BACK\n\n     The nuns giggle.\n\n                               CHRISTY\n               Where did that come from?\n\n                               MARY PATRICK\n               I haven't heard that song in ages.  The \n               Ronettes?\n\n                               MARY LAZARUS\n                             (very grouchy)\n               Shirelles.\n\n                               CHRISTY\n               You know that song?\n\n                               MARY PATRICK\n               1961?  '62?  Mary Clarence, that's when \n               many of us took final vows.  It's the \n               last secular music we recall.\n\n                               CHRISTY\n               No.\n               HEY -- HE KNOWS THAT YOU BEEN CREATING\n               NOW YOU'RE GONNA GET A BEATING\n\n                               ALL THE NUNS\n               HEY-LA, HEY LA\n\n     Page 36.\n\n                               MARY LAZARUS\n                             (cutting off the song)\n               That's enough.  We've got to get to \n               chapel.\n\n     Mary Lazarus leaves the bathing room, and the other nuns \n     resume scrubbing themselves.  Christy looks around.\n\n                               CHRISTY\n               Anybody got conditioner?\n\n     INT. CHAPEL - A FEW MINUTES LATER\n\n     Bishop O'Hara is leading the Sunday mass.  He stands in \n     the pulpit.  The choir nuns stand in a fenced-in area to \n     his left.  The remaining nuns, including Christy and Mother \n     Superior, sit in the first few pews.\n\n                               O'HARA\n               We are a small congregation this \n               morning.  Too many mornings.  Something \n               has gone terribly wrong.   Where is \n               faith?  Where is celebration?  Where is \n               everyone?  Still, rather than regret the \n               absence of our neighbors, let us rejoice \n               in the fellowship of those present.  Our \n               choirmistress, Sister Mary Lazarus, has \n               informed me that our choir, while always \n               superior, has been toiling especially \n               hard on this week's selection.  Sister?\n\n     Mary Lazarus raises her hand, and the choir begins \n     singing. They sing a traditional hymn, \"Let Thy Thoughts Be \n     Guided.\" As always, their singing is dreadful; they have no \n     tempo or pitch, and the hymn becomes an off-key drone.\n\n     As the hymn continues, the CAMERA PANS OVER the chapel. \n     Aside from the nuns, it is almost empty; only a few elderly \n     people are in attendance.\n\n     ANGLE ON CHRISTY\n\n     sitting with the other nuns.  She is clearly about to fall \n     asleep.  Then the choir hits a particularly horrendous \n     note, and Christy jerks awake.  She immediately tries to \n     assume a pious expression, tilting her head and folding her \n     hands in prayer; she looks like a somewhat demented Sunday \n     School calendar.\n\n     EXT. LAS VEGAS POLICE DEPARTMENT\n\n     Detective Clarkson gets out of his car and hurries into \n     the police station.\n\n     INT. POLICE STATION\n\n     Clarkson crosses the busy room to Eddie's glass-walled \n     office.  Along the way, he signals Detective Tate to follow \n     him.\n\n     Page 37.\n\n     INT. MULCAHY'S OFFICE\n\n     Eddie looks up from his desk as the two detectives enter.\n\n                               CLARKSON\n               There was a raid on a pawnshop in L.A. \n               this morning.  The place was fencing \n               stolen property.  They found this.\n\n     Clarkson gives Eddie a fax sheet, showing a publicity \n     photograph of Christy.\n\n                               EDDIE\n               Jesus.  Data-base hoods.  It's a \n               wonderful world.\n                             (reading the fax \n                             sheet) \n               Beloved daughter missing.  Reward of two \n               hundred and fifty thousand dollars. \n               Please find our adored angel, we miss her \n               so.  Dead or alive.\n\n                               TATE\n               Vince is getting desperate.  Where is \n               she, Eddie?  Where'd you stash her?\n\n                               EDDIE\n               Where's who?\n\n                               TATE\n               You won't even tell us?\n\n                               EDDIE\n               I wouldn't even tell the Pope.\n\n     INT. CONVENT SCHOOLROOM - AN HOUR LATER\n\n     A plain whitewashed classroom, with battered student-style \n     desks.  A group of about eight local TEENAGE GIRLS has \n     gathered.  The girls wear extremes of hair, makeup and \n     clothing; they are bored and scruffy, clearly the local bad \n     Girls.  Sister Mary Patrick is leading the class, in her \n     usual perky manner.\n\n                               MARY PATRICK\n               Good afternoon, young ladies.  And \n               welcome to our Christian Youth Group.\n\n     The Girls make grunting noises.\n\n                               MARY PATRICK\n               Hi.  I hope we'll have some fun, and \n               maybe learn a little something, too. Now, \n               today's topic is something very up-to-\n               date -- \"Teenage Promiscuity.\"  My. Now, \n               can anyone tell me -- just what is \n               promiscuity?\n\n     ANGLE on the Girls, exchanging glances and rolling their \n     eyes.\n\n     Page 38\n\n                               MARY PATRICK\n               Anyone?  Yes?\n\n     Mary Patrick points to a Girl in bicycle pants. a bustier \n     and a leather baseball cap.  Her name is Lawanda.\n\n                               LAWANDA\n               Uh, it's like, you know, doin' it.  A \n               whole lot.  Till your head falls off.\n\n                               MARY PATRICK\n                             (blushing)\n               Well, yes.  That is one way to put it.\n\n     Mother Superior enters the classroom accompanied by \n     Christy\n\n                               MOTHER SUPERIOR\n               Sister Mary Patrick?\n\n                               MARY PATRICK\n               Yes?\n\n                               MOTHER SUPERIOR\n               I need to see you, at once.  Girls, \n               please excuse Sister Mary Patrick for a \n               few moments.  Mary Clarence?\n\n                               CHRISTY\n               Yeah?\n\n                               MOTHER SUPERIOR\n               Girls, this is Sister Mary Clarence. \n               She'll be minding you until Sister Mary \n               Patrick's return.  Mary Clarence, please \n               assign a biblical passage.  Do not \n               attempt discussion.  Am I understood?\n\n                               CHRISTY\n               I got it.\n\n                               MOTHER SUPERIOR\n                             (to Mary Patrick)\n               Come, Sister.\n\n     Mother Superior and Mary Patrick leave the classroom. \n     Christy now stands at the front of the room.  She is \n     visibly uncomfortable.\n\n                               CHRISTY\n               So, hi there.  I'm... Sister Mary \n               Clarence.  And you're... young \n               Christians.  I guess I should assign you \n               this passage.  What's good?  What were \n               you talking about?\n\n                               LAWANDA\n               We were talking about the wild thing. \n               Teen promiscuity.\n\n     Page 39\n\n                               CHRISTY\n                             (after a beat)\n               Really.\n\n                               CHARLENE\n               Yeah.  Sister Mary Pat was discussing \n               it.  You know she thinks it's a sin.\n\n                               CHRISTY\n                             (trying to behave)\n               Well... yes.  Yes it is.\n\n                               LAWANDA\n                             (goading Christy)\n               How come?  Sister?\n\n                               CHRISTY\n                             (still trying to \n                             behave)\n               Well... because it's in the Bible. \"Thou \n               shalt not...\"  Thou shalt not.\n\n     The Girls all laugh and make jeering noises.\n\n                               CHRISTY\n               Excuse me -- just what are you all doing \n               here?  At Sunday School?\n\n                               LAWANDA\n               'Cause we love it so damn much.  And \n               cause we gotta come here.  Probation.\n\n                               CHRISTY\n               Probation?\n\n                               CHARLENE\n               Yeah.  We all got caught.  Shoplifting. \n               Cuttin' school.  Cuttin' up some bitch \n               with a blade.  So we gotta come here.  So \n               we'll be good, in the future.  So we'll \n               learn valuable lessons.  And I learned \n               mine.  I will be incredibly good, I will \n               never rip out nobody's nose-ring by \n               accident ever again.  Can I go now?\n\n                               CHRISTY\n                             (getting fed up)\n               Yeah, you learned a whole lot, I can \n               tell.\n\n                               LAWANDA\n               Well, what would you know about it, \n               anyway?  What do any of you nunheads know \n               about anything?  About doin' the nasty, \n               or gettin' high?\n\n                               CONCHITA\n               Leave her alone, Lawanda, she's just \n               some ol' nun!  Don't pick on no nun, it's \n               bad luck!\n\n     Page 40.\n\n                               CHRISTY\n                             (fed up)\n               Shut up!\n\n     All the Girls look up, stunned by Christy's language.\n\n                               CHRISTY\n               Okay, so maybe I'm a nun -- so, you want \n               to ask me something?  You want to listen, \n               for once in your little lives? You want \n               to pay some attention?\n\n                               CHARLENE\n               What about crack?  You a user?\n\n                               CHRISTY\n               I said I was a nun, not an asshole.\n\n     All the girls jeer at Charlene.\n\n                               KESHIA\n               Got you, Charlene!\n\n                               CONCHITA\n               Dunked by the nun!\n\n                               LAWANDA\n                             (more sincerely)\n               Well, what about the sex stuff?  What if \n               some dude is after you, and he's always \n               saying stuff, commin' on sweet and \n               mellow.  Like, oh, baby, you know you'll \n               love it.  Oh, baby, if you loved me, \n               you'd stay.\n\n                               CHRISTY\n               And you listen to that?\n\n                               LAWANDA\n               No, but... I don't know... sometimes.\n\n                               CHRISTY\n               Hey, I know, it's hard.  But do what I \n               do.\n\n                               LAWANDA\n                             (puzzled)\n               What you do?\n\n                               CHRISTY\n               Just tell him, I do love you, but I \n               can't -- I'm a nun.\n\n     The girls all laugh; they are really beginning to like \n     Christy.\n\n     Page 41.\n\n                               CHARLENE\n               But, like what if you are doin' it? What \n               about protection?  Who's responsible?\n\n                               CONCHITA\n               What about them things, you know, for \n               the guy?  Aren't they like, a mess to put \n               on?  Don't they kinda mess up the mood?\n\n                               CHRISTY\n               Deal with it, sweet thing.  It's \n               important, nowadays.  You just practice \n               at home, with a balloon and a banana.\n\n                               MOTHER SUPERIOR (0.S.)\n               Mary Clarence!\n\n     Mother Superior has returned, with Mary Patrick.  Everyone \n     has been so wrapped up in the discussion, that no one has \n     noticed their entrance.\n\n                               CHRISTY\n                             (thinking on her feet)\n               Because a banana is part of a balanced \n               breakfast.  And don't forget fiber.\n\n     INT. MOTHER SUPERIOR'S OFFICE - LATER THAT DAY\n\n     Mother Superior is seated behind her desk; she is very \n     angry.  Christy sits across from her.\n\n                               MOTHER SUPERIOR\n               A balloon and a banana!  Tell me, Mary \n               Clarence, what were you thinking?\n\n                               CHRISTY\n               Those girls were asking questions.  \n               They've got it rough.  I wish somebody \n               had talked to me about that stuff when \n               was their age.  I wish somebody would \n               talk to me about it now.\n\n                               MOTHER SUPERIOR\n               This is a convent, not a clinic.  We \n               offer moral guidance, not hardware.\n\n                               CHRISTY\n               Have you been out in those streets?  Do \n               you know what those kids are up against?  \n               You should help them!\n\n                               MOTHER SUPERIOR\n               We are nuns.  We seek solutions through \n               prayer.\n\n     Page 42.\n\n                               CHRISTY\n               Sometimes it's not enough!\n\n                               MOTHER SUPERIOR\n               You are correct.  Sometimes prayer alone \n               cannot help a situation.  Such as your \n               own, for example.  How do you feel about \n               physical labor?\n\n                               CHRISTY\n               It never solves anything.\n\n                               MOTHER SUPERIOR\n               Do your recall the words of Saint Peter, \n               in Ecciesiastes 1:27?  He spoke unto a \n               wastrel youth.  He said, \"Take up thy \n               task, and know ye the path of \n               contentment.\"\n\n                               CHRISTY\n               In English?\n\n                               MOTHER SUPERIOR\n               How to put it... ah, Of course, Mary \n               Clarence.  \"No pain, no gain.\"\n\n     Mother Superior smiles in a rather evil manner.\n\n     INT. VINCE'S OFFICE - DAY\n\n     Vince is on the telephone in his office at the Moonlight \n     Hotel and Casino.  He clearly has a new mistress or two.\n\n                               VINCE\n                             (very seductive)\n               Baby, you know I do... of course... I \n               feel it too... I'm blushing... can you \n               hold?\n\n     A second telephone RINGS, and Willy answers it.  Vince \n     meanwhile has pushed a button on his phone and is involved \n     in a second romantic call.\n\n                               VINCE\n               Soon, you gorgeous thing... tell me... \n               how lonely?\n\n                               WILLY\n               It's that call you were expecting, \n               Vince.\n\n                               VINCE\n               Can you hold?  Can you try?\n\n     Willy passes the phone to Vince. t\n\n     Page 43\n\n                               VINCE\n               Have you found out where Christy is yet?  \n               Hey, bozo, you re on my payroll! You want \n               to try making it on a cop's salary?  Find \n               her, and find her now!\n\n     Vince passes the phone back to Willy.\n\n                               VINCE\n               Raise the ante to three hundred grand.\n\n     Willy heads for the fax machine.  Vince regains his \n     composure, and picks up his own phone; he pushes a button.\n\n                               VINCE\n               Sorry, baby... you are?  Totally?  Not a \n               stitch?... Yeah, I'm naked too... \n               inside...\n\n     INT. CONVENT CRAFTS ROOM\n\n     This is a large, open room where the nuns create various \n     gift items which the convent sells to support itself.  \n     Several nuns sit at a table, diligently hand-painting \n     Christmas cards and making Christmas tree ornaments.\n\n     On the other side of the room is a large, free-standing \n     loom, which resembles a grand piano.  The loom is wooden; a \n     tapestry is half-completed.  Mary Patrick is seated at the \n     loom, which is a complicated mechanism.  Christy stands \n     beside her.\n\n                               MARY PATRICK\n               The minute I saw you. I said to myself, \n               she's a weaver.  Have you ever used a \n               loom?\n\n                               CHRISTY\n               Not in years.\n\n                               MARY PATRICK\n               Well, it all comes back, in just a \n               jiffy.  I'm working on a wall-hanging, of \n               the convent.\n\n                               CHRISTY\n               Why?\n\n                               MARY PATRICK\n               To sell, of course.  I hate to say it, \n               but we're in terrible trouble here at St. \n               Katherine's.  We need a new roof, the \n               furnace is going, and there's no money.\n\n                               CHRISTY\n               But don't you get money?  From the \n               Vatican?\n\n     Page 44.\n\n                               MARY PATRICK\n               Mary Clarence.  Goose.  We're completely \n               self-supporting.  Like all convents. Like \n               yours.\n\n                               CHRISTY\n               Oh, right.  At my old place, we used \n               to... wash cars.  Groom dogs.  So... nice \n               loom.\n\n                               MARY PATRICK\n               Isn't it lovely?  Now I'll demonstrate, \n               and then you can hop right in.\n                             (as she deftly works \n                             the loom)\n               You just draw your beater in, keep it \n               pressed against the pick, and open the \n               shed.  Then pass your shuttle, beat, and \n               open the next shed.  Shuttle. beat, beat, \n               shuttle, beat, shed.  Keep tension on the \n               warp.  Is that clear?\n\n                               CHRISTY\n                             (pretending to be \n                             fascinated)\n               Just about.  Show me again.\n\n                               MARY PATRICK\n               You betcha.\n\n     CRAFTS ROOM - AN HOUR LATER\n\n     ANGLE on the wall hanging, which has progressed \n     considerably.\n\n     ANGLE on Christy, leaning against the wall, thumbing \n     through a magazine.\n\n     ANGLE on Mary Patrick, hard at work at the loom.\n\n                               MARY PATRICK\n               Shuttle, beat, shed.  And watch your \n               heddles.\n\n                               CHRISTY\n               I love my heddles.  Show me again.\n\n     Mother Superior appears.\n\n                               MOTHER SUPERIOR\n               Mary Clarence -- how is your weaving \n               progressing?\n\n                               MARY PATRICK\n               Oh, she's doing just fine, Reverend \n               Mother -\n\n     Page 45.\n\n                               CHRISTY\n               Really catching on.\n\n                               MOTHER SUPERIOR\n               Good.  Mary Patrick, I need you in the \n               office.  Mary Clarence, carry on.\n\n     Mother Superior gestures to the loom.  Christy sits at the \n     loom, and waves as Mother Superior and Mary Patrick exit.\n\n     Christy stares at the loom; a look of horror crosses her \n     face.  She has not been paying attention to Mary Patrick's \n     instructions.  She cracks her knuckles, as if she were \n     about to play the piano.  She grabs two parts of the loom, \n     at random.  She moves these parts.\n\n     ANGLE on the loom.  As a result of Christy's movements, \n     the loom collapses, piece by piece.  The tapestry unravels, \n     the many skeins of wool snap, and the mechanical apparatus \n     disintegrates, until finally the entire loom shudders and \n     falls to the floor, as Christy watches, aghast.\n\n     INT. CORRIDOR\n\n     Mother Superior is striding down the hall; she is livid. \n     Christy trails behind her, trying to keep up.\n\n                               CHRISTY\n               I'm sorry, I'm not a weaver!\n\n                               MOTHER SUPERIOR\n               Months of work, and the loom, absolutely \n               ruined!\n\n                               CHRISTY\n               Look, this isn't my kind of thing!  I \n               wasn't cut out to make little tapestries, \n               or knit little sweaters! I don't do that!  \n               I'm a star!\n\n     Mother Superior stops dead in her tracks; she turns and \n     stares at Christy.  Then she smiles, in a rather \n     frightening manner.\n\n     MONTAGE - CHRISTY\n\n     A)on her hands and knees. scrubbing the stone floor of a \n     convent hallway.\n\n     B)crawling along between the pews in the chapel, oiling \n     every inch of wood with a bottle of polish and a rag.\n\n     C)crawling along the convent roof, cleaning out gutters \n     with a trowel.  She discovers a dead rat in one of the \n     gutters.\n\n     Page 46\n\n     D)sewing; she is repairing a hole in a habit.  The CAMERA \n     PULLS BACK.  Christy is sitting in a small stone room, \n     surrounded by piles of torn habits, linen and other \n     mending.\n\n     INT. MOTHER SUPERIOR'S OFFICE\n\n     Christy is on the phone in the darkened office.  She keeps \n     checking the door, to make sure no one is listening.\n\n                               CHRISTY\n                             (into phone)\n               Let me talk to Detective Eddie Mulcahy.  \n               It's an emergency.  Real bad.\n\n                               EDDIE'S VOICE\n               Mulcahy.\n\n     Christy cups her hand around the phone and speaks quietly \n     and frantically.  INTERCUT between Christy and Eddie.\n\n                               CHRISTY\n               Eddie, you've got to get me out of here.\n\n                               EDDIE\n               Not again.  You can't keep calling. \n               Somebody's going to catch on to where you \n               are.\n\n                               CHRISTY\n               But I'm going insane!  All these people \n               do is pray and work, work and pray!  I \n               don't get it -- when's the weekend? They \n               have gruel, Eddie, that's what they call \n               food!  Gruel -- it's like Alpo for nuns!  \n               I sleep in a cell, on a board, and I pray \n               five times a days  Do you know what I \n               pray for, Eddie, do you have any idea?  \n               Check your crotch, Eddie --anything fall \n               off yet?  Get me outta her!\n\n                               EDDIE\n               Calm down.  Look, I didn't want to tell \n               you this, but we've had some problems \n               with our protection program lately.\n\n                               CHRISTY\n               Like what?\n\n                               EDDIE\n               Keeping our witnesses alive.  We hide \n               them, but there's a leak in the \n               department, and they end up dead.\n\n                               CHRISTY\n               You son-of-a-bitch!\n\n     Page 47\n\n                               EDDIE\n               I just need a few more weeks,\n\n                               CHRISTY\n               But it's a nightmare!  Mother Superior \n               is out to get me!  She hates my guts! She \n               keeps thinking up new kinds of torture!\n\n     In the distance, Christy hears the CHOIR practicing; they \n     sound even worse than usual.\n\n                               CHRISTY\n                             (holding the phone \n                             out)\n               Do you hear that?  That choir?  Eddie, \n               in here, that's what they call music!\n\n                               EDDIE\n               Don't call again.  It's not safe.  I'll \n               be in touch.\n\n     As the line goes dead, Mother Superior enters.  Christy \n     takes her dust rag and pretends to polish the receiver. She \n     sings as she works.\n\n                               CHRISTY\n               THE HILLS ARE ALIVE WITH THE SOUND OF \n               MUSIC...\n\n     Still singing, Christy breezes out of the room.  Mother \n     Superior looks mystified.\n\n     INT. CHRISTY'S CELL - MIDNIGHT\n\n     Christy is lying flat out on her bed, in her habit, \n     utterly exhausted by the week's hard labor.  There is a \n     meek SCRATCHING at her door.\n\n                               CHRISTY\n                             (without moving)\n               Yeah?\n\n     Sister Mary Robert enters, very shyly.  She barely looks \n     up.\n\n                               CHRISTY\n               What?  What does she want now?  I did \n               the dishes.  I oiled the pews.  I dusted \n               the hymnals.  Two hundred hymnals.  Why \n               can't people share?\n\n                               MARY ROBERT\n                             (not speaking above a \n                             whisper)\n               I... I...\n\n     Page 48.\n\n                               CHRISTY\n               What?\n\n                               MARY ROBERT\n               I... I brought you something.\n\n                               CHRISTY\n               A cigarette?\n\n                               MARY ROBERT\n               An extra heel of bread.  Please take it, \n               you need your strength.  You've been \n               working so hard.\n\n     Mary Robert holds out a rather rugged crust of brown \n     bread.  Christy takes it..\n\n                               CHRISTY\n               Thanks.  So which one are you? Sister \n               Bruce?  Sister Doug?\n\n                               MARY ROBERT\n                             (until almost \n                             whispering)\n               Mary Robert.  I'm... Mary Robert.\n\n                               CHRISTY\n               Right.  Okay.  Bob.  Nice to know you.\n\n     Mary Robert nods, and resumes looking at her hands.  She \n     doesn't 1eave, but she's still tongue-tied. Christy is at a \n     loss.\n\n                               CHRISTY\n               So, Bob, how long have you been in? St. \n               K's?\n\n                               MARY ROBERT\n               Three years.  Sister.\n\n                               CHRISTY\n               Three years.  A rookie.\n\n                               MARY ROBERT\n               A novice.\n\n                               CHRISTY\n               Yeah, like a learner's permit, right? \n               When do you hit the big time?  You know, \n               when do you take the final vows?\n\n     Mary Robert bursts into tears.\n\n                               CHRISTY\n               Whoa!  Bob!  What's going on here? \n               What'd I say?\n\n     Page 49.\n\n                               MARY ROBERT\n                             (still sobbing)\n               You have to help me\n\n                               CHRISTY\n               Right, sure, but what's the problem? Are \n               they keeping you a prisoner here? Do they \n               drug you?  Did Reverend Mother like, \n               kidnap your parents?  We can call the \n               Enquirer.\n\n                               MARY ROBERT\n               No, you don't understand -- I don't want \n               to get out!  I want to get in?\n\n                               CHRISTY\n               Excuse me?\n\n                               MARY ROBERT\n               Oh. Mary Clarence, I'm so unworthy.  I \n               want to take my final vows, I would do it \n               tomorrow, but Reverend Mother won't let \n               me!\n\n                               CHRISTY\n               She won't?  Why not?\n\n                               MARY ROBERT\n               She says I should wait.  She says that \n               no one should become a nun as an escape \n               from life.  She says that I'm not \n               experienced enough to make the decision \n               yet.  In a mature manner.\n\n                               CHRISTY\n               She said that?  Reverend Mother?\n\n     Mary Robert nods, solemnly.  Suddenly, from the streets \n     outside the convent, we hear a BLAST OF hot dance MUSIC, \n     and the SOUND of laughter and carefree conversation.\n\n                               CHRISTY\n               Well, then there's only one thing to do.\n\n                               MARY ROBERT\n               What?\n\n                               CHRISTY\n               Reverend Mother says you need \n               experience, right, in life.  In order to \n               make a responsible decision.  This is \n               going to be very painful for me.  You \n               know how much I love this little room. \n               This whole convent.  Wait.\n\n     Christy stands, and goes to the crucifix hanging on the \n     wall.  She speaks to the crucifix, and listens, as if Jesus \n     is advising her.\n\n     Page 50.\n\n                               CHRISTY\n                             (to Jesus)\n               Must I do this thing, 0 Lord?  Please \n               help me.,. yes, I know... I must put my \n               selfish cares aside... I must think of \n               others... yes, she's here...\n                             (she gestures to Mary \n                             Robert)\n               He says hi... yes, I understand... let \n               thy will be done.  Amen.  You too.\n\n     Christy turns to Mary Robert, having received a holy \n     message.\n\n                               CHRISTY\n               We must do this sacred thing, Mary \n               Robert.\n\n                               MARY ROBERT\n                             (desperate)\n               Of course!  We must do it!  It's the \n               will of God!  What is it?\n\n                               CHRISTY\n                             (shutting her eyes, \n                             for the full spiritual \n                             effect)\n               We must... get you some experience.  We \n               must... leave this place.\n\n                               MARY ROBERT\n               Are you sure?\n\n     Another BLAST OF MUSIC from the street.  Christy turns to \n     the crucifix.  She gets confirmation.\n\n                               CHRISTY\n                             (to Jesus)\n               We hear you.\n\n     EXT. STREET\n\n     The outer wall of the convent.  A door swings open, and \n     Christy sticks her head out.  She looks both ways, and \n     steps outside.  She beckons to Mary Robert, who appears \n     from behind her.  Mary Robert looks very wary.  Christy \n     pulls her along.\n\n     EXT. A STREET NEARBY\n\n     Christy and Mary Robert walk along a street a few blocks \n     from the convent.\n\n                               MARY ROBERT\n                             (looking around \n                             cautiously)\n               Are you sure this is what Reverend \n               Mother had in mind?\n\n     Page 51.\n\n                               CHRISTY\n               I know it is.  It's life.  Experience.  \n               Take a deep breath.\n\n     Christy breathes deep, and then lets out a whoop.  She \n     spins, letting her habit billow around her.\n\n                               MARY ROBERT\n                             (shocked)\n               Mary Clarence!\n\n                               CHRISTY\n               Now you.\n\n     Mary Robert's eyes widen.  She points to herself -- \"Me?\" \n     Christy nods.  Mary Robert lets out a tiny little whoop, \n     and does a little, timid hop.\n\n                               CHRISTY\n               It's a start.\n\n     EXT. SOCIAL CLUB\n\n     A neighborhood hang-out, the windows bright with neon beer \n     signs.  The exterior is colorfully painted; the club all \n     but explodes with good times.  A group of teenagers lounge \n     on the steps, sipping beers and smoking.  Among the \n     teenagers are the girls from Christy's Christian Youth \n     group.  Christy and Mary Robert approach, and the group \n     falls silent.\n\n                               CHRISTY\n               How are you doing.\n\n                               LAWANDA\n                             (puzzled)\n               Hey, Sisters.  Are you going in there?\n\n                               CHRISTY\n               You know it.\n\n                               MARY ROBERT\n               We need experience.\n\n                               CHRISTY\n                             (remembering she's a \n                             nun)\n               It's part of St. Katherine's new \n               community outreach program.  How old are \n               you?  You shouldn't be smoking.  Have you \n               ever seen a diseased lung?  Hand 'em \n               over.\n\n     Lawanda reluctantly hands over her cigarettes.  Christy \n     turns to a TEENAGE BOY who's drinking beer.\n\n     Page 52.\n\n                               CHRISTY\n               And you, with the devil's brew passing \n               through your lips.\n                             (holding out her hand)\n               A mind is a terrible thing to waste.\n\n     The boy hands over the beer.  Christy and Mary Robert \n     enter the club.\n\n     INT. SOCIAL CLUB\n\n     Christy enters the club and grins.  She takes a drag on \n     the cigarette.  Mary Robert grabs the beer from Christy's \n     hand, and takes a swig.\n\n                               CHRISTY\n                             (shocked)\n               Bobs\n\n                               MARY ROBERT\n               Experience!  Right?\n\n                               CHRISTY\n               Right.\n\n     The club is alive with activity; the bar is crowded, \n     couples are making out at small tables, and the dance floor \n     is packed.  The atmosphere is a combination of hazy \n     darkness and colored lights; the club should have the \n     feeling of a hot neighborhood party, with people of all \n     ages and races.  The MUSIC percolates, and Christy starts \n     to move to it.  She and Mary Robert find a table in the \n     corner, and signal a nearby waitress.\n\n                               CHRISTY\n               A couple of bowls of chili.\n                             (holding up the beer)\n               And another round of these.\n\n     The waitress looks at the two women strangely; the club \n     has never hosted nuns before.\n\n                               MARY ROBERT\n                             (to the waitress, \n                             confidentially)\n               I have to do this.  So I can become a \n               nun.\n\n                               CHRISTY\n                             (to the waitress)\n               Initiation.  You understand.  Later on, \n               we make her wear her underwear on her \n               head.\n\n                               MARY ROBERT\n               Really?\n\n     Page 53\n\n                               CHRISTY\n                             (to the waitress)\n               And she wants to be a nun.\n\n     The waitress leaves, shaking her head.  Christy and Mary \n     Robert watch the action at the club.\n\n     Across the room, MIKE the bartender stares at the nuns, \n     especially Christy; he tries to place her.\n\n                               MARY ROBERT\n               Who are all these people?\n\n                               CHRISTY\n               This is your neighborhood.  Your turf. \n               You should get to know 'em.\n\n     From across the room, Mike the bartender continues to \n     study Christy's face.  He takes out a copy of Vince's fax \n     photo and stares at it.  He covers Christy's hair in the \n     photo with his hands, creating a wimple.  There is no \n     question in his mind; the two are the same.  Mike has a \n     dangerous look in his eyes as he takes a gun from the \n     drawer and slips it into his pocket beneath his apron.\n\n     There is a LIVE BAND on a small stage at one end of the \n     club.  They start playing a hot dance number, and the club \n     really begins to cook, as the dance floor fills.  Christy \n     and Mary Robert, both still seated, start to move with the \n     music.\n\n     A very good-looking LOCAL DUDE comes over to the nuns \n     table.  He is clearly amused at their presence.\n\n                               DUDE\n               Hey, Sisters -- how you doin'?\n\n                               CHRISTY\n                             (flirting)\n               Better now.\n\n                               DUDE\n               How come they let you out?  Out of that \n               convent place?\n\n                               CHRISTY\n               Time off.  For bad behavior.\n\n                               DUDE\n               Oww!  A nun havin' fun!  I don't believe \n               it!  It's good to have you ladies in this \n               fine establishment.  So... anybody on the \n               move?\n\n                               MARY ROBERT\n                             (standing up)\n               I am.\n\n     Page 54.\n\n                               CHRISTY\n               Bob!  What're you doing?\n\n     Mary Robert leads the Dude out onto the dance floor.\n\n                               MARY ROBERT\n               I'm getting experience.\n\n                               CHRISTY\n                             (to the Dude)\n               You watch yourself!\n\n     Christy decides she'd better keep an eye on Mary Robert; \n     she grabs another DUDE, and heads for the dance floor.\n\n     As the music percolates, Christy and Mary Robert dance;  \n     Christy is very hot, and Mary Robert picks up on her moves.  \n     The CLUB PATRONS are delighted, and cheer as the nuns start \n     to get down.\n\n                               CLUB PATRON #1\n               Do it, Sisters!\n\n                               CLUB PATRON #2\n               Sway and pray!\n\n     As the song, and the nuns' exuberant dancing, peak, the \n     Club Patrons cheer, shouting \"Hallelujah!\" and \"Amen!\"\n\n     EXT. STREET - NIGHT\n\n     Christy and Mary Robert are walking back to the convent. \n     They are both in very good spirits.\n\n                               MARY ROBERT\n               Those people are wonderful!  Why don't \n               we ever see them in church?\n\n                               CHRISTY\n               Good point.  Especially that dude you \n               were with.  I'd like to see him down \n               front.\n\n                               MARY ROBERT\n                             (giggling)\n               Mary Clarence!  You're so... different \n               from the other sisters.  Sometimes, \n               well... sometimes you sound more like a \n               layperson.\n\n                               CHRISTY\n               Honey.\n\n     As the two women laugh together, they don't notice the car \n     that begins to follow them, creeping slowly forward with \n     its headlights out.\n\n     Page 55.\n\n                               MARY ROBERT\n               I can't wait to tell Reverend Mother \n               about all my experiences.  I've learned \n               so much.\n\n                               CHRISTY\n               Well, you know, you don't have to tell \n               her everything.  I mean, nothing really \n               happened.  We just... took a walk.\n\n     The car's bright lights suddenly switch on, and the nuns \n     turn, startled.  The car hurtles toward them.  They scream, \n     and Christy grabs Mary Robert and throws her out of the \n     car's path; the two women land on a pile of garbage bags.\n\n     Struggling to her feet, Christy sees the car go into \n     reverse, and then pull forward again.  She sees a glint of \n     light reflect off a gun as the car's driver (Mike the \n     bartender) leans out the window.\n\n                               CHRISTY\n                             (to Mary Robert)\n               Run!\n\n     Christy shoves Mary Robert towards an alley.  As she does \n     so, the gun GOES OFF with a red flash.  The shot misses the \n     two women and SHATTERS a plate glass window of the store \n     behind them.\n\n     EXT. ALLEY\n\n     Running up the alley, Christy and Mary Robert hear Mike's \n     FOOTSTEPS chasing them, growing louder as he gains on them.\n\n                               MARY ROBERT\n               Mary Clarence! \n\n                               CHRISTY\n               Keep moving!\n\n     Christy grabs the ladder of a fire escape, and shoves Mary \n     Robert up the ladder ahead of her.\n\n                               CHRISTY\n               Climb!  Now!\n\n     As Christy and Mary Robert climb the fire escape, another \n     GUNSHOT ECHOES in the alley, ricocheting off the fire \n     escape.\n\n     The nuns climb higher up the building.  Mike pursues, \n     looking for a shot between the steps and the landings, but \n     not finding any openings.  He takes the steps two at a time \n     and begins to gain ground.\n\n     At the fourth floor landing, Christy's heel gets stuck in \n     the grating.  She pulls frantically at the laces.\n\n     Page 56.\n\n                               CHRISTY\n               Goddamn it!\n\n                               MARY ROBERT\n               Mary Clarence!\n\n     Mike arrives at the landing just as Christy twists her \n     toot out of the shoe, and surprises him with a lunge for \n     the gun.  Mike's hand is knocked back against the metal \n     frame of the fire escape, and the gun flies loose, RATTLING \n     down the metal steps to the landing below.  Christy shoves \n     Mary Robert into the open window of an apartment, and \n     follows her in.\n\n     INT. TENEMENT APARTMENT\n\n     Christy and Mary Robert leap into the bedroom of an \n     Hispanic couple, their arms wrapped around each other in \n     bed.  At the women's entrance, the couple looks up, stunned \n     to see two nuns in their bedroom.\n\n                               MARY ROBERT\n               Oh my Lord!\n\n                               CHRISTY\n                             (pushing Mary Robert \n                             forward)\n               Experience!\n\n     The couple continues to look stunned as the nuns race out \n     of the room.\n\n     EXT. CONVENT - NIGHT\n\n     Christy and Mary Robert run up to the side door of the \n     convent; they catch their breath.\n\n                               MARY ROBERT\n               What was all that?  Who was that man?  \n               Why would he shoot at us?\n\n                               CHRISTY\n               I don't know, some people just don't \n               like nuns.  I wish I had a ruler.\n\n                               MARY ROBERT\n               We could have been killed!  But you \n               saved me!\n                             (throwing her arms \n                             around Christy)\n               Thank you, Mary Clarence!\n\n     The door to the convent swings open.  Mother Superior is \n     waiting.\n\n                               MOTHER SUPERIOR\n               Yes -- thank you so much.\n\n     Page 57\n\n     INT.CONVENT CORRIDOR - DAY\n\n     Christy sits alone outside Mother Superior's office, \n     listening to the loud TICKING of the clock on the wall. She \n     seems small and vulnerable, like a child sent to the \n     principal's office.\n\n     The door opens and Eddie emerges from the office.\n\n                               CHRISTY\n               What'd she say?\n\n                               EDDIE\n               You blew it -- big time.  She doesn't \n               want you back.\n\n                               CHRISTY\n               Does she know people are trying to kill \n               me out there?\n\n                               EDDIE\n               She's counting on it.  She's concerned \n               for your safety, but she wants me to try \n               and find another convent that will take \n               you. Or a carnival.\n\n                               CHRISTY\n               So what am I supposed to do in the \n               meantime?\n\n                               EDDIE\n               Go in and talk to her.  It can't hurt. \n                             (urging her)\n               Go.\n\n     Reluctantly, Christy rises and approaches the door.  She \n     looks at Eddie, who motions her to go in.  She finally \n     does.\n\n     INT. MOTHER SUPERIOR'S OFFICE\n\n     Mother Superior is working on some papers at her desk as \n     Christy enters.  Christy is trying to figure out a \n     strategy.\n\n                               CHRISTY\n               So... hi there.\n\n                               MOTHER SUPERIOR\n                             (not amused and not \n                             looking up)\n               I don't believe we have anything to say \n               to each other.\n\n                               CHRISTY\n               Look... I know I shouldn't have, I'm \n               incredibly sorry about Mary Robert, I \n               wasn't thinking, I didn't know that would \n               happen!\n\n     Page 58.\n\n     Mother Superior glances up from her work.  She is \n     justifiably outraged.\n\n                               MOTHER SUPERIOR\n               Mary Robert's life was in danger! Your \n               behavior was inexcusable!\n\n                               CHRISTY\n               I know!  I'm sorry   I didn't mean for \n               it to happen!  And I was the one they \n               were shooting at!\n\n                               MOTHER SUPERIOR\n               Mary Clarence, I have given you every \n               opportunity.  To change.  To make a \n               decent life for yourself.\n\n                               CHRISTY\n               A decent life?  Excuse me?  As what?  A \n               janitor?\n\n                               MOTHER SUPERIOR\n               Clearly, you have learned nothing. And \n               you present an ongoing threat, both to \n               this convent and to yourself.\n\n                               CHRISTY\n               But you can't kick me out!  Guys want to \n               kill me!  You're a nun!  A big nun! \n               Aren't you supposed to have compassion? \n               For the wayward sheep?  I mean, I'm a \n               major sinner!  All-time great!  Hall of \n               Fame!  Aren't I, like, your dream come \n               true?  Your Olympic event?\n\n     Mother Superior stares at Christy.\n\n                               MOTHER SUPERIOR\n               Mary Clarence, perhaps you are correct.\n\n                               CHRISTY\n                             (surprised)\n               I am?\n\n                               MOTHER SUPERIOR\n               You may stay.  But I shall restrict your \n               activities to but a single task.\n\n                               CHRISTY\n                             (with great dread)\n               What?\n\n                               MOTHER SUPERIOR\n               You have, I believe, some minimal \n               background in music.  Therefore, you are \n               to join our choir.\n\n                             (MORE)\n\n     Page 59\n\n                               MOTHER SUPERIOR (CONT'D)\n               You will sing, and you will sleep,' that \n               is your schedule until you depart.  As \n               almost no one attends Mass, you will be \n               unable to cause further damage.\n\n                               CHRISTY\n               No.  No.\n\n                               MOTHER SUPERIOR\n                             (smiling)\n               You're my Olympic event.\n\n                               CHRISTY\n               Not the choir, please, anything but \n               that.  The choir -- I mean, have you \n               heard them?  I'll do anything, scrub \n               floors, toilets, you name it, but not \n               that I\n\n                               MOTHER SUPERIOR\n                             (in triumph)\n               The choir, Mary Clarence.  Go for the \n               gold.\n\n     INT. CHOIR REHEARSAL ROOM - THAT DAY\n\n     There are twelve nuns in the room, going over sheet music. \n     Mary Lazarus is the group's leader; Mary Patrick and Mary \n     Robert are also in the choir.  Christy appears at the door, \n     grimacing.\n\n                               CHRISTY\n               Is this... choir practice?\n\n                               MARY PATRICK\n               Sure is!  Come on in, and sing a spell.\n\n     Christy spots Mary Robert.\n\n                               CHRISTY\n               Mary Robert, I am so sorry about last \n               night...\n\n                               MARY ROBERT\n               Now stop that.  You didn't shoot at me.  \n               You were only trying to help, to give me \n               experience.  I tried to explain that to \n               Reverend Mother, but -- I don't know if \n               she understood.\n\n     Mary Lazarus cuts off this chitchat, thrusting a hymnal at \n     Christy.\n\n                               MARY LAZARUS\n               Soprano or alto?\n\n                               CHRISTY\n                             (very gloomy)\n               Whatever.\n\n     Page 60.\n\n     Mary Lazarus hands Christy a hymnal, and raps her baton. \n     The choir begins to sing; Christy doesn't even bother \n     trying.  She is horrified; the choir is the worst-sounding \n     group in history.  They seem to be singing in several \n     random keys, and they even have trouble with the words.  No \n     one looks up from their hymnals.  Sister Alma, the organist \n     with the hearing aid, is plodding along.\n\n     INT. BLUE COLLAR BAR - DAY\n\n     Mike the bartender is taking chairs off tables and setting \n     them on the floor as Joey and Willy enter.\n\n                               JOEY\n               We're looking for Mike.\n\n                               MIKE\n               You found him -- but we're not open yet.\n\n     Willy grabs Mike's arms and bends them behind his back.\n\n                               MIKE\n               Hey -- the till's empty!\n\n     Willy slams Mike's face into the wall, stunning him.  Joey \n     lifts Mike's groggy face and offers sympathy.\n\n                               JOEY\n               I'm sorry -- I don't know what gets into \n               him.\n\n                               MIKE\n               Who are you guys?\n\n                               JOEY\n               We're the guys from Vegas.  You had \n               Christy last night, but you let her get \n               away.  It's upsetting.\n\n     Willy hammers Mike's face into the wall again.\n\n                               MIKE\n               But you didn't tell me!\n\n                               JOEY\n               We didn't tell you what?\n\n                               MIKE\n               That she's a nun!  That chick you're \n               looking for -- she's a nun!\n\n                               WILLY\n               What?  Christy?\n\n     Page 61.\n\n                               JOEY\n               A nun?\n\n                               MIKE\n               I'm telling you!\n\n     Willy and Joey look at each other, and consider this.  \n     Then they burst out laughing.  They refuse to believe \n     Mike's story.\n\n                               WILLY\n               Gimme a hand here.\n\n     Willy and Joey pick Mike up, and hurl him over the bar. \n     Then they exit, still laughing.\n\n                               JOEY\n               A nun!\n\n     INT. CHOIR REHEARSAL ROOM - DAY\n\n     The choir continues its dreadful rendition of the hymn \n     Let Thy Thoughts He Guided.  Christy is not singing; she \n     is clearly in pain.  Mary Lazarus stops the song.  One of \n     the nuns has to nudge Sister Alma to stop her playing.\n\n                               MARY LAZARUS\n               Mary Clarence, are you with us?\n\n                               CHRISTY\n               Um, I don't really know this one...\n\n                               MARY ROBERT\n               Mary Clarence has a background in music. \n               That's what Reverend Mother said.\n\n                               MARY PATRICK\n                             (eagerly)\n               Really, Mary Clarence?  Were you a \n               choirmistress?\n\n                               CHRISTY\n               Sure.  Kind of... free-lance.\n\n                               MARY LAZARUS\n                             (circling Christy)\n               Free-lance?  Oh really?  You think I \n               don't see?  You think I took vows \n               yesterday?  I know what you're up to. You \n               and Reverend Mother.\n\n                               CHRISTY\n               What?\n\n                               MARY LAZARUS\n               You're a ringer.  She brought you in to \n               replace me.  Out with the old.\n\n     Page 62.\n\n                               CHRISTY\n               Hold on.\n\n                               MARY PATRICK\n               Mary Clarence, could you?  Mary Lazarus, \n               you're terrific, but...\n                             (to Christy)\n               Could you help us?\n\n                               ANOTHER NUN\n               Please?\n\n                               ANOTHER NUN\n               You've heard us.\n\n                               MARY LAZARUS\n               Well.\n\n     Everyone falls silent.  Mary Lazarus walks across the \n     room, eyeballing each member of the choir.\n\n                               MARY LAZARUS\n               There's a word for this -- mutiny.\n                             (to Christy)\n               So, Mary Clarence, you think you can do \n               better.  I believe I'd like to see that.\n                             (she hands Christy her \n                             pitchpipe and baton)\n               I'm out to pasture.  Dry dock.  The glue \n               factory.  Go ahead, Sister -- make 'em \n               sing.\n\n     Everyone watches Christy.\n\n                               CHRISTY\n               Well...\n                             (to Nary Lazarus)\n               With all due respect... let's have a \n               look at this.\n\n     Christy goes over to the piano.  She examines the sheet \n     music for \"Let They Thoughts He Guided.\"  She sits at the \n     piano, beside Sister Alma.  Christy picks out the hymn on \n     the piano, accompanying herself.\n\n                               CHRISTY\n               LET THY THOUGHTS BE GUIDED\n               LET THY SOUL BE HEALED\n\n     Christy's singing voice is, as usual, not very good.  She \n     stops singing.  For perhaps the first time in her life, she \n     has really heard herself.\n\n                               CHRISTY\n               Man.  I sound like you guys.\n\n     Page 63.\n\n                               MARY LAZARUS\n                             (victorious)\n               Very nice.  Sisters, have we learned our \n               lesson?  I won't hold this little episode \n               against anyone.  I'll try not to.\n\n                               CHRISTY\n                             (standing)\n               Mary Robert.\n\n     Mary Robert jumps, startled by the attention. \n\n                               MARY ROBERT\n               What?\n\n                               CHRISTY\n               Mary Robert, I've watched you.  You \n               never really sing.  You whisper. Nothing \n               comes out.\n\n                               MARY ROBERT\n               I don't want to mess anyone up...\n\n                               CHRISTY\n                             (to Sister Alma)\n               Give me a C.\n                             (because Sister Alma \n                             is hard of hearing)\n               A C!\n\n     Sister Alma plays the note.  Christy points the baton at \n     Mary Robert.  Mary Robert whispers the note.\n\n                               CHRISTY\n               Louder!  Like you're onstage.\n\n     Mary Robert sings a little louder.\n\n                               CHRISTY\n               Like people are eating, and there's \n               silverware, and you want them to hear \n               you.\n\n     Mary Robert sings louder still.\n\n                               CHRISTY\n               Think about that guy you were dancing \n               with!\n\n     Mary Robert finally lets out her full voice, which is huge \n     and glorious.  After singing a single perfect note, she \n     stops abruptly; she has scared herself.\n\n                               MARY ROBERT\n               Oh my!\n\n     Page 64.\n\n                               CHRISTY\n               You see?  We've got the voices.  They're \n               just allover the place. I've heard all of \n               you, in the shower --you're decent.  \n               Better than me.  We just need charts -- \n               harmony -- chops.\n\n                               MARY PATRICK\n                             (puzzled)\n               Chops?\n\n                               CHRISTY\n               The goods.  The sound.  The sale.  Let's \n               rearrange a few things.  Mary Patrick, \n               you re not a natural soprano, you're an \n               alto.  Get over here.  Mary Robert --with \n               the sopranos.\n\n     The two nuns trade places.\n\n                               CHRISTY\n               Sister Alma -- a C.\n\n     Sister Alma plays the note, and the nuns try to duplicate \n     it, but the results aren't much better than before. Christy \n     uses her pitchpipe; she circulates among the nuns, giving \n     each her note, urging them closer to pitch.\n\n                               CHRISTY\n               Middle section, hold that note, for dear \n               life.  Sopranos, an A.  Sister Alma?\n\n     Sister Alma hits the note.  Christy shuffles a couple of \n     more nuns to other sections, then gets a third note going \n     with the altos, using her pitchpipe.\n\n     For one moment, the nuns all realize they are singing a \n     perfect chord.  They are elated.\n\n                               MARY PATRICK\n               We did it!  We actually sang a chord!\n\n                               MARY ROBERT\n                             (thrilled and \n                             disconcerted)\n               That was exciting!\n\n                               CHRISTY\n               Yeah, for one second.  That was the \n               blend -- you've got to listen to each \n               other.  Be a group.\n\n                               MARY LAZARUS\n                             (under her breath)\n               I knew that.\n\n                               CHRISTY\n               Mary Lazarus, I get the feeling that you \n               like discipline.  Hard work.\n\n     Page 65.\n\n                               MARY LAZARUS\n               Of course.  I'm a nun.  Four Popes now.  \n               The Lord hates a loafer.\n\n                               CHRISTY\n               I hear you.  How many days a week do you \n               rehearse?\n\n                               MARY PATRICK\n               Two days.  An hour or so.\n\n                               CHRISTY\n               No way.  We're a choir, right? \n               Headliners.  The big room.  Two days a \n               week won't cut it.  Every day.\n\n                               MARY LAZARUS\n                             (impressed)\n               She's good.\n\n                               MARY ROBERT\n                             (to Christy)\n               Do you really think we could do it?  Get \n               better?\n\n                               CHRISTY\n               I don't know.  Mary Lazarus, what do you \n               think?  They're pretty raw.\n\n                               MARY LAZARUS\n               Wet behind the ears.\n\n                               CHRISTY\n               A bunch of real mama's girls.\n\n                               MARY PATRICK\n               Oh, please?  Can't we try?\n\n     Christy and Mary Lazarus look at each other, as real \n     comrades.  Christy leans on Mary Lazarus' shoulder.\n\n                               CHRISTY\n               It'll be hell.\n\n                               MARY LAZARUS\n               Tell me about it.\n\n     Christy and Mary Lazarus shake hands, firmly.  Christy \n     turns to the choir, very businesslike.\n\n                               CHRISTY\n               Ten-hut!\n\n     INT. CONVENT LAUNDRY ROOM - DAY\n\n     This is a basement utility room.     A large industrial \n     washer-dryer stands along one wall; the machine makes a \n     repetitive CHUNG-CHUNG sound\n\n     Page 66.\n\n     The choir nuns are busily doing laundry; some iron, others \n     fold sheets, others stack towels and garments on a long \n     table.  Christy is helping Mary Patrick fold a sheet.  \n     Everyone is working rhythmically, to the drone of the \n     washer-dryer.\n\n                               CHRISTY\n               That machine.\n\n                               MARY PATRICK\n               I know.  It's ancient.\n\n                               CHRISTY\n               It's a rhythm section.  The beat.\n\n     Christy starts clapping her hands to the sound of the \n     washer-dryer; gradually, the other nuns join her.\n\n                               CHRISTY\n               Mary Patrick -- do you remember the \n               Dixie Cups?\n\n                               MARY PATRICK\n               The Dixie Cups?  Oh my.  I was just a \n               girl.  Of course.\n                             (singing)\n               SPRING IS HERE\n               THE SUN WILL SHINE\n\n                               CHRISTY\n                             (stopping the beat)\n               Hold it.  Mary Patrick, you're a pretty \n               cheerful person, aren't you?\n\n                               MARY PATRICK\n               Am I?\n\n     There is a murmur from all the other nuns -- \"Oh, yes.\n\n                               MARY PATRICK\n                             (as a confession)\n               All right, I am, I know it!  All my \n               life, I've just been... upbeat. \n               Optimistic.  Perky.  I can't help it. \n               Even when I was little, I remember my \n               mother used to say, \"That child is pure \n               sunshine.  She'll either be a nun -- or a \n               stewardess.\"\n\n                               CHRISTY\n               So use it.  When we sing hymns, they're \n               usually about rejoicing, right? \n               Celebration.  Most music is.  So don't \n               hold back.  Let all that joy go right \n               into your voice.  Make me happy.  Let me \n               hear it.  Perk out.  Perk down.\n\n     Page 67.\n\n                               MARY PATRICK\n                             (with real joy)\n               SPRING IS HERE\n               THE SUN WILL SHINE\n               I'LL BE HIS\n               AND HE'LL BE MINE\n               WE'LL LOVE UNTIL\n               THE END OF TIME\n               AND WE'LL NEVER BE LONELY ANYMORE\n\n                               CHRISTY\n               Because we're\n\n                               ALL THE NUNS\n               GOING TO THE CHAPEL\n               AND WE'RE GONNA GET MARRIED\n               GOING TO THE CHAPEL\n               AND WE'RE GONNA GET MARRIED\n               GOING TO THE CHAPEL\n               AND WE'RE GONNA GET MARRIED\n\n                               MARY PATRICK\n               GOING TO THE CHAPEL OF LOVE!\n\n     The nuns have really gotten into the song, with Christy \n     encouraging them verbally.  They are sounding better and \n     better.\n\n     SISTER MARY FREDERICK, a member of the choir, steps into \n     the laundry room and lets loose with a sudden, piercing \n     whistle.  The nuns immediately stop singing, and a moment \n     later Mother Superior enters.\n\n     The room is quiet except for the sound of the washer-\n     dryer. The nuns all get very busy at their laundry tasks.\n\n                               NUNS\n                             (in unison)\n               Good morning, Reverend Mother.\n\n                               MOTHER SUPERIOR\n               Good morning, Sisters.\n\n     Mother Superior takes one more glance around, then leaves.\n\n     Now that the coast is clear, the singing begins again, \n     quietly, to the rhythm of the machine.\n\n                               NUNS\n               GOING TO THE CHAPEL...\n\n     INT. CHAPEL\n\n     Bishop O'Hara is leading the Sunday Mass.\n\n                               BISHOP O'HARA\n               Welcome this Sunday morning, 0 ye few \n               and faithful.\n\n     Page 68.\n\n     As usual, the chapel is almost empty, except for the nuns. \n     The choir is in place behind the pulpit.\n\n                               BISHOP O'HARA\n               The choir, I am told, has elected a new \n               director -- Sister Mary Clarence, who \n               will lead them in Hymn 127.\n\n     Christy nods to the Bishop, and signals to Sister Alma, \n     who begins the accompaniment.\n\n                               CHOIR\n               LET THY THOUGHTS BE GUIDED\n               LET THY SOUL BE HEALED\n\n     They sound fantastic.  Their voices blend with a heavenly \n     harmony as they sing the slow, melodic hymn.  Mother \n     Superior is startled by this new sound.\n\n     EXT. STREET\n\n     Lawanda and her friends glance at the convent with \n     curiosity as the beautiful MUSIC drifts out to the street.  \n     A few other heads turn, but with only mild reactions.\n\n     INT. CHAPEL\n\n     At the end of the first verse, Christy signals the choir \n     to stop.  There's a hush in the chapel as Christy glances \n     at the vacant pews.  Then she turns to Sister Alma and \n     nods. Sister Alma strikes a bold, stirring chord.\n\n     Several of the nuns blink.  Bishop O'Hara glances at the \n     organ with surprise.  Mother Superior sits up with a \n     stiffened back and a severe expression.\n\n     As the chord grows in force, Christy gives the choir a \n     beat.\n\n                               CHRISTY\n               One, two, three...\n\n     The choir begins a radically new version of the same hymn. \n     Christy strides up and down in front of the choir, \n     transforming the song into a rousing gospel anthem, with a \n     passionate call-and-response format.\n\n                               CHOIR\n               LET THY THOUGHTS BE GUIDED\n\n                               CHRISTY\n               What you say?\n\n                               CHOIR\n               LET THY SOUL BE HEALED\n\n     Page 69.\n\n                               CHRISTY\n               But how?\n\n                               CHOIR\n               BY A VOICE YOU HEAR FROM ON HIGH\n\n                               CHRISTY\n               I think I hear it!\n\n                               CHOIR\n               LET THY THOUGHTS BE GUIDED\n\n                               CHRISTY\n               You know, I just might!\n\n                               CHOIR\n               LET THY SOUL BE HEALED\n\n                               CHRISTY AND CHOIR \n               LET THY SPIRIT TAKE WING AND FLY!\n\n     Spontaneous reactions from everyone in the church.\n\n     EXT. STREET\n\n     The gorgeous, exciting MUSIC pours into the street.  \n     Everyone turns to look.  Windows open and people glance \n     out. The street takes on a new movement.\n\n     INT. CHAPEL\n\n     The choir really lets loose flow.\n\n                               CHRISTY AND CHOIR\n               LET THY THOUGHTS BE STRENGTHENED\n               LET THY PRAYERS BE HEARD\n               LET OUR LORD REJOICE IN YOUR PRAISE\n               LET HIS GOODNESS LIFT YOU TO A HIGHER \n               PLACE\n               AND LET LOVE AND PEACE FILL YOUR DAYS\n\n     Lawanda and her friends peer in at the back door of the \n     chapel.  Bishop O'Hara sees them, and beckons them to come \n     in.\n\n                               CHRISTY\n               Sister Alma!\n\n     Sister Alma, inspired by Christy and the choir, burns up \n     the organ with a solo.  More people from the street begin \n     to enter; tentative, curious, drawn by the music.\n\n     At the end of the solo, Christy makes a gesture to the \n     choir, and each member produces a tambourine.  The chapel \n     is full of energy, music and life.\n\n                               CHRISTY\n               Mary Robert!\n\n     Page 70.\n\n     Mary Robert sings, really letting the power of her voice \n     ring out.  She is astonishingly good.\n\n                               MARY ROBERT\n               LET THY THOUGHTS BE GUIDED\n               LET THY SOUL BE HEALED\n               BY A VOICE YOU HEAR FROM ON HIGH\n               LET THY THOUGHTS BE GUIDED\n               LET THY SOUL BE HEALED\n               LET THY SOUL TAKE WING AND FLY!\n\n     The new visitors to the church begin to clap in rhythm to \n     the music, and after a few beats, the nuns join in.  Mother \n     Superior is aghast.\n\n     The choir builds to a huge gospel finish, all keeping \n     their eyes on Christy.\n\n                               CHOIR\n               LET THY SPIRIT\n\n                               CHRISTY\n               You know what we're saying!\n\n                               CHOIR\n               LET THY SPIRIT\n\n                               CHRISTY\n               I think they hear you!\n\n                               MARY LAZARUS\n               LET THY SPIRIT\n\n                               CHRISTY AND CHOIR\n               LET THY SPIRIT TAKE WING AND FLYI\n\n     After the final note, everyone in the chapel is \n     exhilarated -- everyone except Mother Superior.  Christy \n     looks out at the congregation that has increased by a dozen \n     or more, including Lawanda and her friends.  Christy looks \n     happier than she has in years.\n\n     INT. CORRIDOR - DAY\n\n     The members of the choir are all gathered outside Mother \n     Superior's office, leaning close to the door and listening \n     to her harangue Christy.  They are surprised to find \n     themselves joined suddenly by Bishop O'Hara, and part to \n     let him through.  He leans down to the keyhole and listens.\n\n     INT. OFFICE\n\n     Mother Superior is livid.\n\n                               MOTHER SUPERIOR\n               Gospel.  A jazz solo on the organ.  What \n               next?  Jesus goes to Rio?  Good Friday-a-\n               go-go?  What were you thinking?\n\n     Page 71.\n\n                               CHRISTY\n               I was thinking Las Vegas.  Get some \n               butts in those seats.\n\n                               MOTHER SUPERIOR\n               And what next?  Popcorn?  Curtain calls?  \n               This is not a theater.  or a casino.\n\n                               CHRISTY\n                             (sincerely)\n               Exactly.  People like going to theaters \n               and casinos.  But they think church is \n               for Grandma -- we could change that. Pack \n               the joint.\n\n                               MOTHER SUPERIOR\n               Through blasphemy?  You have corrupted \n               the entire choir!\n\n                               CHRISTY\n               Hold on.  That's not fair.  I worked \n               hard with them.  They gave up their free \n               time, and they loved it.  Those women are \n               happy.  And we can get even better.  We \n               can wake this place up.\n\n                               MOTHER SUPERIOR\n               Out of the question.\n\n                               CHRISTY\n               Please let me try.  I'm begging you.\n\n                               MOTHER SUPERIOR\n               And I am refusing.  As of tomorrow, Mary \n               Lazarus will resume her leadership of\n               the choir.\n\n     Christy is crestfallen.  There is a KNOCK on the door, and \n     O'Hara enters.  The other members of the choir are in \n     behind him like sardines.\n\n                               BISHOP O'HARA\n               Reverend Mother, I just wanted to \n               congratulate you.\n\n                               MOTHER SUPERIOR\n               Oh?\n\n                               BISHOP O'HARA\n               I haven't enjoyed Mass this much in \n               years.  What a marvelous program. \n               Innovative.  Inspiring.  You are to be \n               commended.\n\n                               MOTHER SUPERIOR\n               Well... thank you.\n\n     Page 72.\n\n                               BISHOP O'HARA\n               I can't wait until next Sunday, when the \n               choir performs again.  Did you see the\n               people walk right in from the street? \n               That music, that heavenly music -- it \n               called to them.\n\n                               MOTHER SUPERIOR\n               Perhaps.\n\n                               BISHOP O'HARA\n               I must tell the Cardinal.  I.11 send him \n               a personal letter, describing your\n               efforts, your bold new fight to keep \n               your little convent alive.\n\n                               MOTHER SUPERIOR\n               Really?\n\n     Christy has just been eating this up with a spoon.\n\n                               CHRISTY\n               Excuse me, Bishop.  Reverend Mother has \n               some other ideas too.  She's too modest \n               to talk about it, but she thinks we \n               should get out of the convent and into \n               the neighborhood more.\n                             (putting her hands on \n                             Mother Superior's \n                             shoulders) \n               This woman.\n\n     Mary Patrick jumps forward.\n\n                               MARY PATRICK\n               Bless her!  There are so many problems \n               in this neighborhood that we could help \n               solve.  That's why many of us became \n               nuns.  It's marvelous, Reverend Mother.\n\n                               MOTHER SUPERIOR\n                             (confused by the turn \n                             things have taken)\n               Really...\n\n                               CHRISTY\n                             (with regard to Mother \n                             Superior)\n               You know Reverend Mother.  Hides her \n               light under a bushel.  She has plans for \n               us to move right onto the streets.  Get \n               to know people.  Work with 'em.\n\n                               BISHOP O'HARA\n                             (to Mother Superior)\n               You're a pioneer.\n\n     Page 73.\n\n                               MOTHER SUPERIOR\n               But, Bishop, surely you realize -- this \n               is a most dangerous neighborhood.\n\n                               O'HARA\n               And you'll face that danger head-on.  As \n               if I could stop you.  And you have my \n               complete support in this matter. Anything \n               you can do to revitalize this \n               neighborhood would be a blessing.\n\n                               CHRISTY\n                             (hugging Mother \n                             Superior from behind)\n               Don't you love her?\n\n     EXT. CONVENT - DAY\n\n     The nuns are out in force, painting the walls of the \n     convent, mostly with rainbows and flowers and bright, \n     shining suns.  The CAMERA PANS to Christy, who is adding \n     her own original touch to the mural, using cans of spray \n     paint.  Christy's section includes an image of a nun in a \n     miniskirt and spike heels, accompanied by neon letters that \n     read \"St. Kate!\"  People gather in the street, watching the \n     nuns' activities.  The convent begins to crackle with \n     energy and life.\n\n     A drug deal is going on in a house up the street, but the \n     DEALERS give only a curious glance to the action at the \n     convent.\n\n     INT. MOTHER SUPERIOR'S WINDOW\n\n     From the window of her office, Mother Superior watches the \n     painters and feels her control slipping away.\n\n     EXT. STREET - LATER\n\n     Christy leads the members of the choir down the middle of \n     the street.  They get lots of attention each step of the \n     way.  As each nun raps, the other nuns make rhythmic boom-\n     box noises.\n\n                               CHRISTY\n                             (rapping)\n               WE'RE THE SISTERS OF THE SACRED HEART WE \n               DO OUR BIT, NOW DO YOUR PART\n\n                               MARY ROBERT\n                             (rapping)\n               HONOR THY MOTHER AND THY FATHER TOO\n               DON'T KILL, DON'T STEAL, IT'S BAD FOR \n               YOU\n\n                               MARY PATRICK\n                             (rapping)\n               BELIEVE IN THE LORD, HIS WILL BE DONE\n               COME TO CHURCH, IT'S TONS OF FUN\n\n     Page 74.\n\n                               MARY LAZARUS\n                             (rapping)\n               DIG DOWN DEEP, GIVE ALL YOU CAN\n               TRUST ME, CHILDREN, THERE'S A HEAVENLY \n               PLAN!\n\n     The parade goes on, the crowd gathers, and a general air \n     of jubilance prevails.\n\n     INT. REHEARSAL ROOM - DAY\n\n     The rehearsal room is filled with high energy as the choir \n     is separated into several groups.  Christy has got the \n     whole thing running like a disciplined Broadway cast.\n\n     Mary Patrick leads one group in the corner as they \n     practice synchronized movements with tambourines.  Colorful \n     streamers are tied to the tambourines, and they make \n     colorful patterns in the air.\n\n     Sister Alma pounds the piano with newfound energy, as Mary \n     Robert and the sopranos reach higher and higher for notes \n     they've only dreamed of in the past.\n\n     Christy and Mary Lazarus have corralled the rest of the \n     nuns into a practice of intricate dance steps, somewhat \n     like the Temptations in skirts.  Mary Lazarus keeps the \n     beat with a yardstick.\n\n                               CHRISTY\n               Don't look at your feet, and I don't \n               want to see anybody counting.  Make it \n               look easy.  Again!\n\n                               MARY LAZARUS\n               Right, right, cross with the left, spin \n               and turn!\n\n                               CHRISTY \n               Hopeless I\n\n                               MARY LAZARUS\n               Amateurs 2\n\n                               CHRISTY\n               Babies\n\n                               MARY LAZARUS\n               Again!\n\n     EXT. CRACK HOUSE - NIGHT\n\n     One of the drug dealers stands outside the crack house as \n     a car suddenly pulls up to the curb.  He starts toward the \n     car as the DRIVER rolls down the window, but before he gets \n     there, Christy and several nuns surround the car.\n\n     Page 75.\n\n                               CHRISTY\n               We're here to pray for you, brother.\n\n                               DEALER\n               What?  Get the hell out of here.\n\n                               CHRISTY\n               We know you don't want to sell drugs.  \n               You just had an unhappy childhood, and \n               maybe a learning disability.  You just \n               need someone to pray for you.\n\n                               MARY PATRICK\n               We know you don't want to bring pain and \n               misery to your friends and neighbors. \n               We'll pray to find you some honest work.\n\n                               CHRISTY\n               And we know that, even though most \n               people would call you a leech and a \n               parasite, the lowest slug of humanity! We \n               know that deep down inside, you're \n               probably even worse.  And so you truly \n               need our prayers.\n\n                               DRIVER\n               What is this?  Outta my way!\n\n     The nuns give him room, and the Driver zips off down the \n     street.  A small crowd has begun to gather, and it is \n     growing by the moment, murmuring encouragement for the \n     nuns.  Christy turns to the Dealer, as other cars drive \n     slowly past.\n\n                               CHRISTY\n               Yes, prayer is the answer, and prayers \n               free  We're going to give free prayers to \n               everyone who drives up to this house.\n\n                               MARY ROBERT\n                             (to the Dealer)\n               We're nuns!\n\n                               MARY PATRICK\n                             (to cruising cars)\n               Free prayers right over here!  Drive up \n               and get your prayers!\n\n                               DEALER\n               You're hassling my customers!  That's \n               not legal!  I know my rights.  This is \n               restriction of trade.\n\n                               CHRISTY\n               You wanna call a cop?\n\n     Page 76.\n\n     The Dealer's eyes turn ugly as he takes a gun from his \n     pocket.  Mary Patrick steps forward.\n\n                               MARY PATRICK\n               Are you going to shoot us all, tough \n               guy?\n\n                               MARY LAZARUS\n               Is it worth it?  A lot of witnesses \n               here.\n\n                               CHRISTY\n                             (to the crowd)\n               Can I get a witness?\n\n     The Dealer glances at the surly crowd, then gives the nuns \n     a disgusted look.  He puts the gun away.\n\n                               DEALER\n               So I'll find another neighborhood to do \n               my business.  You can' t stop me.\n\n                               CHRISTY\n               If we can stop you here, they can stop \n               you there.\n\n     The Dealer turns and walks back to his house with anger. \n     The crowd APPLAUDS and CHEERS.\n\n     The picture suddenly becomes GRAINY, and we hear the voice \n     of a NEWS REPORTER.\n\n                               NEWS REPORTER (V.0.)\n               It was a truly remarkable scene, as the \n               nuns from St. Katherine's literally drove \n               the crack dealers from the neighborhood, \n               led by the feisty Sister Mary Clarence.\n\n     CAMERA PULLS BACK and we see a TV screen with an image of \n     the nuns and neighbors still celebrating.  On top of the TV \n     are several framed photographs of Vince Laflocca, his wife \n     and children.\n\n     INT. VINCE LaROCCA'S LIVING ROOM - NIGHT\n\n     CONNIE LaROCCA, Vince's wife, watches the TV NEWS STORY \n     and calls to Vince in the kitchen.\n\n                               CONNIE\n               Vinnie, get in here.  You gotta see \n               this!\n\n     Carrying a roast beef sandwich and a can of beer, Vince \n     appears from the kitchen and glances at the TV screen to \n     see a shot of the convent.  He looks at Connie and makes a \n     sour face.\n\n     Page 77.\n\n                               VINCE\n               What?  Nuns?  You got me in here to see \n               nuns?  Isn't there a ball game on or \n               something?\n\n     Vince turns away from the TV just as a closeup of Christy \n     appears on the screen.\n\n                               CONNIE\n               Look -- she's adorable!\n\n     Vince leaves the room, and we see Christy again as she \n     leads the choir.\n\n     INT. EDDIE'S APARTMENT - NIGHT\n\n     Eddie is cooking spaghetti in his efficiency apartment and \n     watching the NEWS on TV at the same time.  He pours himself \n     a glass of wine and stirs the spaghetti sauce.\n\n                               NEWS REPORTER\n               This tiny convent has experienced an \n               amazing turnaround.  The sisters have \n               revitalized and taken back their \n               neighborhood, all due to the energy and \n               talent of the convent choir, a group led \n               by this gifted young nun.  Tell us, Mary \n               Clarence1 what makes you so special?\n\n                               CHRISTY\n                             (trying to appear \n                             modest and nun-like)\n               Oh, I'm not special, Bob.  It's just \n               hard work... and prayer.\n\n     Eddie all but spits out his wine.  His eyes are wide as he \n     watches Christy being interviewed.  In one stride, he grabs \n     his hat and coat and is out the door on the run.\n\n     EXT. CONVENT - DAY\n\n     The Sunday morning bell is CHIMING as crowds of people \n     stream into the convent.  The entire neighborhood looks \n     cleaner, and the people walk with a spring in their step. \n     Three local TV stations have remote news crews on the scene \n     doing follow-ups on the story.\n\n     INT. CHAPEL HALLWAY\n\n     Last in line, Christy follows the other choir members down \n     a hallway toward the chapel.  Suddenly, a hand reaches out \n     and grabs her, and a second hand covers her mouth as she is \n     pulled into an empty cell.\n\n     INT. CELL\n\n     Shocked and terrified, Christy struggles to free herself, \n     but is suddenly relieved to see that her abductor is Eddie.\n\n     Page 78.\n\n     Eddie releases her, and she falls onto the bed.\n\n                               CHRISTY\n               Eddie!  You scared the hell out of me!\n\n                               EDDIE\n               What if I was Vince?  You'd be dead \n               right now.  What are you doing giving \n               interviews on TV?\n\n                               CHRISTY\n               It wasn't my fault!  They just showed \n               up.  It's helping the convent.\n\n                               EDDIE\n               You're supposed to be hiding out!\n\n                               CHRISTY\n               I really can't talk about it now.  The \n               place is packed.  SRO.  I've got a show \n               to do.\n\n                               EDDIE\n               Listen to yourself.  This isn't a career \n               opportunity.\n\n                               CHRISTY\n               I know that.  This isn't about me.  It's \n               about the choir.  You should hear them.\n               They're good.  Really good.  And I \n               taught them.\n\n                               EDDIE\n               Jesus, look at you   You're glowing.\n\n                               CHRISTY\n               I am?\n\n                               EDDIE\n               Yeah.  You look... great.  I mean it..\n\n                               CHRISTY\n                             (flirting)\n               Really?  Lieutenant?\n\n                               EDDIE \n               I've been worried about you.\n\n     Eddie sits on the bed beside Christy.\n\n                               CHRISTY\n               You mean -- worried about my testimony?\n\n                               EDDIE\n               No -- worried about you.  Personally.\n\n     Page 79.\n\n                               CHRISTY\n               Well..  thanks.  I've been thinking \n               about you.. - sometimes.  I mean, there \n               aren't a lot of guys around here.  I \n               mean, sometimes I feel like... a nun.\n\n                               EDDIE\n               Me too.\n\n                               CHRISTY\n               You're not... seeing anybody?\n\n                               EDDIE\n               No.  Most of the time I'm thinking about \n               you.  And now... you've really changed.\n\n                               CHRISTY\n               I have?\n\n                               EDDIE\n               You re sort of... radiant.   your eyes \n               are shining.  You're rea1ly different...\n\n     Eddie and Christy are gazing into each other's eyes; they \n     are just about to kiss.  Their lips are less than an inch \n     apart.\n\n                               EDDIE\n               You're... you're a nun.\n\n     Eddie and Christy jump apart, their intimacy has \n     frightened them both, particularly given Christy's outfit, \n     and their location.\n\n                               CHRISTY\n               We're in a convent!\n\n     Christy goes to the door.\n\n                               CHRISTY\n               I've got to go.\n\n                               EDDIE\n               Just remember - you're a target.  Don't \n               you think Vince has a T.V.?\n\n                               CHRISTY\n                             (trying to think \n                             straight)\n               I know, I know.  I'll be careful.  I'll \n               try.\n\n     Christy begins to leave, and then she turns, filled with a \n     performer's excitement.\n\n                               CHRISTY\n               Magic time!\n\n     Page 80.\n\n     Christy hurries toward the chapel, leaving Eddie to shake \n     his head and wonder.\n\n     INT. CHAPEL\n\n     Sister Alma plays the organ, and the choir hums quietly as \n     Christy addresses the congregation.  Cameras from several \n     TV stations are focussed on her from various places in the \n     chapel.\n\n                               CHRISTY\n               This Sunday's hymn is inspired by the \n               lesson of Mary Magdalene.  You know the \n               one.  Mary Magdalene was a young lady \n               with a past.  She was no stranger to sin.  \n               She was no stranger to practically \n               everybody.  Many condemned her.  The \n               whole neighborhood.  But one man refused \n               to do so.  One man said, hey now, wait a \n               minute.  Listen to the story.\n\n     Sister Alma starts playing a doo-wop vamp.  Mary Patrick \n     and Mary Robert step forward from the choir, standing \n     beside Christy the way the Ronelles used to do.\n\n                               CHRISTY\n               Hey, girls. \n\n                               MARY PATRICK AND ROBERT\n               Hail, Mary.\n\n                               CHRISTY\n               Jerusalem is a real drag.  Everybody \n               hates me.\n\n                               MARY PATRICK AND ROBERT\n               Oh-huh.\n\n                               CHRISTY\n               People throw stones.  They call me \n               names.  I mean, really.\n\n                               MARY PATRICK AND ROBERT\n               Really.\n\n                               CHRISTY\n               But -- wait.\n\n                               MARY PATRICK\n               What is it, Mary?\n\n                               CHRISTY\n               That man -- who is he?\n\n                               MARY ROBERT\n               He's a carpenter.\n\n     Page 81\n\n                               MARY PATRICK\n               He's not like other guys.\n\n                               MARY ROBERT\n               He's decent.\n\n                               MARY PATRICK\n               He's kind.\n\n                               CHRISTY\n               He's... dreamy.  He's...\n\n                               CHOIR\n               Yes, Mary?\n\n                               CHRISTY\n               HE'S SO FINE...\n\n     The full choir sings back-up while Christy, Mary Patrick \n     and Mary Robert perform intricate girl group choreography.\n\n                               CHOIR\n               DOO- LANG, DOO-LANG, DOO- LANG.\n\n                               CHRISTY/MARY ROBERT/ MARY PATRICK\n               WISH HE WAS MINE\n               THAT HANDSOME GUY OVER THERE\n               THE ONE WITH THE WAVY HAIR\n\n     Sister Alma is surrounded by several STREET KIDS who play \n     guitar, bass and drums to accompany the organ and choir.\n\n     Lawanda and her friends sit in a pew, moving joyously to \n     the music.\n\n     Eddie stands in the back of the chapel, watching a Christy \n     he has never seen before.  Christy is now glowing with \n     happiness and confidence.\n\n     As the song continues, we see the chapel is packed to the \n     rafters.  A tin bucket is passed around as a collection \n     plate, and it overflows with money.\n\n     EXT. CONVENT\n\n     Church services are over, and happy people stream out of \n     the convent, but they don't hurry home.  Standing in \n     groups, they talk pleasantly and make plans for the day. \n     There is a real sense of neighborhood up and down the \n     block.\n\n     Eddie comes down the steps, glances back at the convent, \n     smiles to himself, then crosses the street to his car.\n\n     Page 82.\n\n     INT. CHAPEL\n\n     Christy and the choir stare at the collection plate that \n     is filled with money.\n\n                               CHRISTY\n               Jackpot!  Two buckets\n\n                               MARY PATRICK\n               This is so exhilarating!  All week long, \n               I can't wait till Sunday, when we sing.\n\n                               MARY ROBERT\n               I'd rather sing than do anything!\n\n                               MARY PATRICK\n               It's better than ice cream.\n\n                               MARY ROBERT\n               It's better than springtime.\n\n                               CHRISTY\n               It's better than sex!\n\n     Everyone looks at Christy with astonishment.\n\n                               CHRISTY\n                             (catching herself)\n               I imagine.\n\n     Everyone's attention suddenly turns to Bishop O'Hara as he \n     approaches.\n\n                               O'HARA\n               Better and better, Sisters, you are \n               truly an inspiration.  And I bear \n               gladsome tidings.\n\n     The choir gathers around O'Hara with curiosity.\n\n                               O'HARA\n               I've kept the Cardinal informed of your \n               progress in the neighborhood.  He has \n               been most impressed.  And he has invited \n               you to attend a special evening Mass at \n               St. Matthew's Cathedral on Sunday night1 \n               to sing for the Council of Cardinals.\n\n     The choir reacts with an excited buzz:  \"The Council of \n     Cardinals!\", \"What shall we sing?\", etc.\n\n     Mother Superior appears, from the center aisle.\n\n                               MOTHER SUPERIOR\n               That is indeed glorious news, Bishop. We \n               will be honored to appear.\n                             (MORE)\n\n     Page 83.\n\n                               MOTHER SUPERIOR (CONT'D)\n               And on such an occasion, I feel a \n               completely traditional program will be \n               best.\n\n                               CHRISTY\n               What do you mean?\n\n                               MOTHER SUPERIOR\n               The council of Cardinals is perhaps the \n               most esteemed body in the entire Catholic \n               church.  They command the utmost respect.  \n               Your more... secular entertainment would \n               be wholly out of place.\n\n                               MARY PATRICK\n               But, Reverend Mother -- everyone loves \n               our new style.\n\n                               MARY ROBERT\n               It's brought people back to the church.\n\n                               CHRISTY\n               Isn't that why we were asked to sing for \n               those Cardinals?\n\n                               MOTHER SUPERIOR\n               I believe this can be settled by a \n               simple vote.\n\n                               CHRISTY\n               A vote?\n\n                               MOTHER SUPERIOR\n               Of course.  Mary Clarence, a convent is \n               not a totalitarian state.  Most major \n               decisions are made by the membership as a \n               whole.  A membership that, I am certain, \n               will vote in a rational and pious manner.  \n               All those in favor of allowing Mary \n               Clarence to select a program?\n\n     All the nuns look at one another.  Then, slowly, one by \n     one, they all raise their hands.\n\n     Mother Superior is pure steel at this moment; her \n     expression betrays no emotion.  Christy, on the other hand, \n     is quite confused.\n\n                               CHRISTY\n               But... wait a minute...\n\n                               MOTHER SUPERIOR\n               The majority has spoken.\n\n     Page 84.\n\n                               BISHOP O'HARA\n               Reverend Mother, as always, you are a \n               true leader.  Gracious and understanding.\n\n                               MARY ROBERT\n               It will be wonderful, Reverend Mother. \n               You'll see.\n\n                               MARY LAZARUS\n                             (gesturing to Christy)\n               She's a pro.\n\n                               CHRISTY\n               What?\n\n                               MOTHER SUPERIOR\n               I am certain the presentation will be a \n               great success.  Congratulations, Mary \n               Clarence.  And congratulations to you \n               all.\n\n     The nuns cheer, and cluster around Christy, chattering \n     about the upcoming concert, as Mother Superior strides off.\n\n     INT. MOTHER SUPERIOR'S OFFICE - DAY\n\n     Seated at her desk, Mother Superior glances up as Christy \n     enters.\n\n                               CHRISTY\n               You sent for me?\n\n                               MOTHER SUPERIOR\n               You have a phone call.\n\n     Mother Superior continues with her paperwork as Christy \n     picks up the phone.\n\n                               CHRISTY\n               Hello?\n\n                               EDDIE'S VOICE\n               Good news, kid.  I pulled a few strings \n               the judge has agreed to move the trial\n               up.  We'll be in court in a couple of \n               days.\n\n     With mixed emotions, Christy speaks softly.\n\n                               CHRISTY\n               That soon?\n\n     Mother Superior is a very interested eavesdropper.\n\n                               EDDIE'S VOICE\n               Forty-eight hours -- and you'll be a \n               free woman.\n\n     Page 85.\n\n                               CHRISTY\n               Great.  That's good to hear.\n\n                               EDDIE'S VOICE\n               Hey, don't thank me or anything.\n\n                               CHRISTY\n               Right, right -- thanks.\n\n     Christy hangs up the phone.  She looks at Mother Superior.\n\n                               CHRISTY\n               Hey -- your prayers have been answered.  \n               I'm leaving.  In just a couple of days.\n\n                               MOTHER SUPERIOR\n               Really.  Well, that makes two of us.\n\n                               CHRISTY\n               What?\n\n                               MOTHER SUPERIOR\n               I have submitted my resignation to \n               Bishop O'Hara.  Privately.  I have asked \n               to be relocated as soon as possible.\n\n                               CHRISTY\n               But -- why?\n\n                               MOTHER SUPERIOR\n               I must go where I can be of use.\n\n                               CHRISTY\n               But -- there's so much more to do right \n               here.  And look, if it's about me, I \n               mean, I'm gone.\n\n                               MOTHER SUPERIOR\n               Indeed.  After how long?  A few weeks?  \n               I have been here thirty years.  And yet, \n               it would seem, I know nothing.\n\n                               CHRISTY\n               But everything that's happening is good!  \n               You can be a part of it!\n\n                               MOTHER SUPERIOR\n               A part of what?  Mary Clarence, it is \n               one thing to rabble rouse, to sweep into \n               town and declare a holiday.  You have \n               raised the Sisters' expectations, you \n               have excited and confused them.  They \n               imagine this neighborhood to be some sort \n               of delightful ongoing block party.\n\n                             (MORE)\n\n     Page 86.\n\n                               MOTHER SUPERIOR (CONT'D)\n               You and I know that life is not so \n               simple.  There will be disappointments.  \n               Rude shocks.  And you will have vanished.  \n               How... fortunate.\n\n                               CHRISTY\n               Okay, so I just got things started.  But \n               you could build on that.  You could keep \n               it going.\n\n                               MOTHER SUPERIOR\n               I am sorry, Mary Clarence.  I seem to \n               have misplaced my tambourine.  Good day, \n               Mary Clarence.\n\n                               CHRISTY\n               But...\n\n                               MOTHER SUPERIOR\n               Good day.\n\n     Christy, frustrated, leaves the room.  Mother Superior \n     looks up, she is truly torn, a proud woman unsure of her \n     choices.\n\n     EXT. CONVENT - NIGHT\n\n     The moon casts shafts of silver light down to the \n     courtyard of the convent.  Most of the lights in the \n     neighborhood are out at this late hour.\n\n                               CHRISTY'S VOICE\n                             (whispering)\n               Come on... I've got a surprise...\n\n     INT. CONVENT KITCHEN - NIGHT\n\n     The kitchen is dark, lit only by a flickering candle \n     carried by Christy.  Three more candles appear, carried by \n     Mary Robert, Mary Patrick and Mary Lazarus.  The door to \n     the freezer opens, and light spills out.  Christy removes \n     several pints of ice cream and distributes them to the \n     nuns.\n\n                               MARY ROBERT\n                             (delighted)\n               Ice cream!\n\n                               MARY PATRICK\n               Mary Clarence -- you shouldn't have. \n               Where did you get this?\n\n                               MARY LAZARUS\n               It's a sin.  It's a wicked indulgence. \n               Is this butter almond?\n\n     Page 87.\n\n     Christy and the nuns sit on stools, enjoying their ice \n     cream by candlelight.\n\n                               CHRISTY\n               It's contraband.  Don't ask.  But I \n               wanted to give you a treat.  A sort of... \n               thank-you gift.\n\n                               MARY ROBERT\n               A thank-you?  For what?  You're the one \n               we should be thanking.\n\n                               MARY LAZARUS\n               Is there any syrup?\n\n                               CHRISTY\n               Well... see, at my old convent, I wasn't \n               always... real popular.  I was sort of \n               selfish and... not real helpful.  Okay, \n               I'll say it -- I wasn't much of a nun. \n               But now, thanks to all of you... maybe \n               I'm shaping up.\n\n                               MARY ROBERT\n               Mary Clarence, don't be silly.  You're \n               an example to us all.  You've taught us \n               so much.  We're singing for the \n               Cardinals, and then -- who knows?  Maybe \n               the choir can travel -- to schools, and \n               nursing homes.\n\n                               MARY PATRICK\n               Maybe we can get some of the local kids \n               to sing with us.\n\n                               MARY LAZARUS\n               We could cut a demo.  Look for a label.\n\n                               CHRISTY\n                             (knowing she has to \n                             leave)\n               That's true, wouldn't that be great.  Of \n               course, we never know when things are \n               going to change.  Any one of us could be \n               transferred to another convent, tomorrow.\n\n                               MARY ROBERT\n                             (worried)\n               Are you leaving us?\n\n                               CHRISTY\n                             (sincerely)\n               Oh no.  We'll always be together.\n\n                               MARY LAZARUS\n               That's what Diana Ross said.\n\n     Page 88.\n\n     Christy and the nuns qiggle, and continue eating their ice \n     cream, in a spirit of true friendship.\n\n     Mother Superior watches this scene, hidden in the shadows \n     by the door to the kitchen.  She has begun to see Christy \n     in a new light.  She looks thoughtful, and walks off.\n\n     INT. LAS VEGAS POLICE DEPARTMENT - DAY\n\n     Tate sits at his desk in the detective room, reading the \n     sports section.  HENRY PARKER, the accountant for the \n     police department, looks stressful as he enters the room \n     and heads for Eddie's glassed-in office.  Tate glances up \n     as Parker passes his desk.\n\n                               TATE\n               You're too late.  Mulcahy just left.\n\n                               PARKER\n               I need his signature on some things. \n               They can't be processed without it.\n\n                               TATE\n               Leave 'em.  He'll sign 'em later.\n\n     Parker looks annoyed -- he doesn't like deviations from \n     procedure -- but after a moment of indecision, he sets the \n     file folder on Tate's desk and walks away.\n\n     Tate finishes the newspaper and shoves it aside.  Bored, \n     looks at his watch, then flips the file folder open and \n     glances at its contents;  routine money vouchers for \n     equipment, supplies, etc.  Tate is about to close the \n     folder and shove it aside when something catches his eye.\n\n                               TATE\n               What the hell is this...?\n\n     He examines a money voucher for a generous donation to St. \n     Katherine's Convent in San Francisco.  It only takes a \n     moment to put two and two together, and Tate scrambles for \n     his phone and dials a number.\n\n     INT. CORRIDOR\n\n     Henry Parker waits for the elevator.  When it opens, he's \n     surprised to see Eddie step out.\n\n                               PARKER\n               Tate said you were gone.\n\n                               EDDIE\n               I get all the way down to my car, and, \n               of course -- where are the keys?\n\n     Page 89.\n\n                               PARKER\n               I left the money vouchers with him.  He \n               said you'd sign them in the morning.\n\n     Eddie nods and moves on as Parker enters the elevator. \n     After a few steps, Eddie suddenly looks disturbed.  He \n     picks up his pace.  A little panicky, he begins to jog \n     toward the squad room.\n\n     INT. VINCE'S OFFICE\n\n     Vince is on the telephone.  He signals Joey and Willy, and \n     they move quickly toward him.\n\n                               VINCE\n               This is it.  Get ready to move.  No \n               mistakes.  Grab her, get her to the \n               Moonlight.  We meet there, and we take \n               care of her.\n                             (into phone)\n               We're on it.  Give me the address.\n\n     Vince begins to write down the address.\n\n     INT. SQUAD ROOM\n\n     Tate is hunched over the telephone, talking quietly with \n     his back to the rest of the room.  The voucher for St. \n     Katherine's is in his hand as Eddie moves quickly toward \n     him.\n\n                               TATE\n               St. Katherine's Convent on East Barton. \n               It's gotta be the place.\n\n     Tate hangs up the phone and BOOM!  Eddie hits him from \n     behind like a linebacker, drilling him to the floor.  Other \n     detectives look up from their desks with confusion and \n     alarm.  Eddie pins Tate to the wall and snatches the \n     voucher from his hand.\n\n                               EDDIE\n               You're the leak, you son-of-a-bitch!\n\n     Clarkson and another detective restrain Eddie before he \n     can hit Tate.\n\n                               EDDIE\n               Get him out of here!  Downstairs, in the \n               cell!  I want his ass locked up now!\n\n     Nobody dares even question Eddie at this moment, and two \n     detectives drag Tate away.  Eddie grabs Tate's phone and \n     dials long distance.\n\n                               EDDIE\n               Clarkson, get on the other line.  Call \n               Frisco Central.  Tell 'em to get two \n               squad cars outside St. Katherine's \n               convent, and stop anybody with an out-of-\n               state license plate from getting near the \n               place.\n\n     Clarkson dials quickly.  Eddie listens to Tate's telephone \n     as it RINGS and RINGS and RINGS.\n\n     INT. CONVENT - DAY\n\n     All the nuns are in the chapel as the choir rehearses a \n     hymn, along with Gina and her girlfriends.  Those who are \n     not in the choir clap their hands in rhythm.  War in the \n     background, we can hear the telephone RINGING.\n\n     EXT. HIGHWAY - DAY\n\n     Eddie's police car streaks past an entrance ramp with the \n     SIREN screaming.  It blazes through traffic, weaving in and \n     out at breakneck speeds.  A moment later, Joey and Willy \n     pull onto the highway at a fast rate.  The race is on, with \n     Eddie securely in the lead.\n\n     INT. CONVENT - DAY\n\n     In the rehearsal room, the choir members are putting on \n     their robes.  Christy and several nuns are all trying to \n     primp in front of one small mirror.\n\n                               MARY ROBERT\n               The Council of Cardinals!  I'm so \n               nervous!  What if I forget the words?\n\n                               CHRISTY\n               Right to Hell.  Just kidding. Where is \n               that bus?\n\n                               MARY PATRICK\n               It should be here any minute.\n\n                               MARY LAZARUS\n                             (with a clipboard)\n               Dress rehearsal at four, performance at \n               8:30.  Sharp.\n\n     Christy looks out the window, but sees no bus.\n\n     EXT. HIGHWAY - DAY\n\n     Eddie's police car streaks toward L.A.\n\n     Page 91.\n\n     EXT. CONVENT - DAY\n\n     The neighborhood has turned out to see the choir off.  \n     Banners hang from the fire escapes of the building across \n     the street:  \"ST. KATE'S - THE GREATEST!\", \"GOOD LUCK \n     TONIGHT!\"\n\n     A Catholic school bus pulls up to the convent and parks in \n     front.  Several nuns in choir robes come outside and hurry \n     onto the bus.  A moment later, Eddie's police car streaks \n     up to the side entrance of the convent, parking around the \n     corner from the bus.\n\n     INT. CONVENT\n\n     Eddie runs into the convent and finds Mother Superior at \n     the bottom of the stairs.\n\n                               EDDIE\n               Reverend Mother!  Quick!  Where's \n               Christy?\n\n                               MOTHER SUPERIOR\n               What's wrong?\n\n                               EDDIE\n               They know she's here!   They're on their \n               way!\n\n     Mother Superior points up the stairs.\n\n                               MOTHER SUPERIOR\n               The rehearsal room!\n\n     Mother Superior looks alarmed as Eddie takes the stairs \n     two at a time.\n\n     INT. REHEARSAL ROOM\n\n     Looking out the window, Mary Robert sees the bus.\n\n                               MARY ROBERT\n               It's here!  Let's go!\n\n     Everyone makes a final check of their appearance, and then \n     the group leaves the room to head for the bus.  Mary Robert \n     and Mary Patrick are the last to leave, except for Christy.\n\n                               MARY PATRICK\n               Hurry, Sister!\n\n                               CHRISTY\n               Get moving.  I'm right behind you.\n\n     Christy primps in the mirror one last time, then leaves \n     the room.  She is puzzled to suddenly see Eddie running \n     toward her from a side staircase.\n\n     Page 92.\n\n                               CHRISTY\n               Eddie...?\n\n     Eddie grabs her hand and pulls her toward the side \n     staircase.\n\n                               EDDIE\n               Vince knows you're here.\n\n                               CHRISTY\n                             (shocked and scared)\n               How?\n\n                               EDDIE\n               Long story.  His goons will be here any \n               minute.  We've got to get you out of here \n               '- now!\n\n     Christy and Eddie hurry down the steps to the side \n     entrance, and she almost trips on her choral robes.  Eddie \n     opens the door and starts outside, but Christy stops in her \n     tracks.\n\n                               CHRISTY\n               I can't go with you.\n\n                               EDDIE\n               What?\n\n                               CHRISTY\n               I've got a show -- at St. Matthew's \n               Cathedral.  We're singing for the \n               Cardinals.\n\n                               EDDIE\n               You're gonna be singing for St. Peter if \n               you don't get your ass out of here!\n\n     Eddie jerks her hand, and Christy follows him reluctantly \n     to the car.\n\n     INT. EDDIE'S CAR\n\n     Eddie takes off at a fast clip up the street.  As the car \n     cruises through an intersection, Christy looks back at the \n     bus with confusion and sadness.  She sees the other nuns \n     rushing back into the convent to look for her.\n\n     INT. REHEARSAL ROOM\n\n     Several members of the choir rush into the room with panic \n     in their eyes.\n\n                               MARY PATRICK\n               Mary Clarence!  Sister!\n\n                               MARY ROBERT\n               It's no use.  She just isn't here.\n\n     Page 93.\n\n                               MARY PATRICK\n               It doesn't make any sense.  She was \n               right behind me...\n\n     The HORN on the school bus blows loudly down in the \n     street.\n\n                               MARY ROBERT\n               We can't sing without her!  What should \n               we do?\n\n                               MARY PATRICK\n                             (calming herself)\n               We'll pray -- and she'll be there.\n\n     The nuns are calmed by the tone of Mary Patrick's voice. \n     They leave the room to join the others on the bus.\n\n     EXT. STREET - DAY\n\n     Eddie's police car streaks through crowded streets.\n\n     INT. EDDIE'S CAR\n\n     Christy still looks unsettled.\n\n                               CHRISTY\n               Eddie -- I've got to go back.  They \n               won't sing without me.  I'm deserting \n               them.\n\n                               EDDIE\n               I think they'd understand.\n\n                               CHRISTY\n               That's not the point!  They need me!\n\n     Eddie glances at her, impressed by the influence the \n     convent has had.\n\n                               EDDIE\n               They need you?  A bunch of nuns?  For \n               what?  Moral guidance?  Make-up tips?\n\n                               CHRISTY\n               You don't get it!  It's a big thing for \n               them, it's like... Caesar's Palace. \n               Prime-time.  They're singing for the \n               Cardinals.  It's like... \"Star Search.\" \n               If first prize was a trip to the Vatican.  \n               They've worked really hard, they deserve \n               this.\n\n                               EDDIE\n                             (goading her)\n               Nuns?\n\n     Page 94.\n\n                               CHRISTY\n               They're not nuns.  They're like.. \n               people.  With one outfit.\n\n     EXT. CONVENT - DAY\n\n     Joey and Willy park their car in front of the convent, get \n     out quickly and climb the steps to the front door.  They \n     ring the bell.\n\n                               JOEY\n               So that guy in the bar was right?  She's \n               like... some kind of nun?\n\n                               WILLY\n               Yeah, right -- when I see it.\n\n     Lawanda and her friends watch Joey and Willy pounding on \n     the convent door.\n\n                               LAWANDA\n               You dudes looking for nuns?  They all \n               went to St. Matthew's.\n\n                               JOEY\n               St, Matthew's?  Thanks.\n\n                               LAWANDA\n               Praise the Lord.\n\n     Joey and Willy run past the girls, get into their car and \n     take off.\n\n     INT. EDDIE'S CAR - DAY\n\n     Eddie glances at the dashboard and sees that the fuel \n     gauge is close to empty.  He wheels into a gas station and \n     pulls up to the tanks.  Christy starts to open the door, \n     but he stops her.\n\n                               EDDIE\n               What're you doing?\n\n                               CHRISTY\n               Even nuns have to pee.\n\n     He lets her go, then gets out to pump gas.\n\n     INT. WOMEN'S ROOM\n\n     Christy enters the bathroom; it is deserted.  She fondles \n     her rosary beads, and sinks to her knees.  This position \n     doesn't work for her; she stands.  She looks around her; \n     she glances up, toward heaven.  She decides to do things \n     simply, and speaks in a matter-of-fact tone.\n\n     Page 95.\n\n                               CHRISTY\n               Okay, it's me.  Mary Clarence.  Christy. \n               It's Chris Carter.  I need some help \n               here.  I can't believe I'm doing this. \n               Okay, look, I know I should just get back \n               in the car, and get the hell out of here.  \n               Save my skin.  I mean, it's not wrong, \n               Vince really wants to kill me. Why do you \n               make guys like Vince?  But if I don't \n               sing at St. Matthew's... Mary Robert.  \n               Mary Patrick.  It means so much to them.  \n               They're counting on me -- and I like \n               that.  Maybe Reverend Mother is right, \n               maybe I am a bad influence, maybe I'm \n               just some Vegas slut, but... can we cut a \n               deal here?  I mean, I still don't believe \n               in, like, most of the Commandments, and \n               stuff in church still gives me the \n               willies, but -- if I go back and sing, if \n               I do a good deed, will you promise I \n               won't get killed?  All I want is a sign.  \n               Lightning.  Thunder. Anything.\n\n     Suddenly, Christy hears the toilet FLUSH in the next \n     bathroom.\n\n                               CHRISTY\n                             (in disbelief)\n               No.  No.  Doesn't count...\n\n     Suddenly, Christy hears \"AVE MARIA\" coming from a radio or \n     TV outside the bathroom.  She looks up; a ray of sunlight \n     illuminates a grimy, dime-store Christmas tree ornament \n     hanging from a room deodorizer.  The ornament is a glittery \n     angel; it sparkles in the light.\n\n     Christy leaves the bathroom, still not quite sure.\n\n     EXT. GAS STATION\n\n     Christy looks through the grimy window of the gas station \n     office.  A bored Mechanic is watching a small portable TV. \n     On the TV is an episode of \"THE FLYING NUN\":  Sally Field, \n     in full habit, is soaring along.\n\n     Suddenly, Christy hears the loud ROAR of a motorcycle \n     starting up over by one of the gas pumps.  The BIKER turns \n     and looks at Christy:  he has long hair, and a beard and \n     moustache, and he looks, well, a bit like Jesus.\n\n                               CHRISTY\n               Oh my God...\n\n     Christy runs up to the Biker..\n\n                               CHRISTY\n               I'm late for church.  Can I get a lift?\n\n     Page 96.\n\n     Christy swings onto the back seat; the Biker puts his \n     Harley in gear and flies down the street.  Eddie is shocked \n     as he drops some money on the ground and jumps into his car \n     to follow.\n\n     EXT. ST. MATTHEW'S CATHEDRAL - DAY\n\n     We see a network truck parked in front of the landmark \n     cathedral.\n\n     INT. CHAPEL\n\n     There is a sense of chaos in the chapel as TECHNICIANS set \n     up television equipment, and Mother Superior leads the \n     choir as it rehearses.  Near the back of the chapel, Bishop \n     O'Hara looks concerned over the performance of the choir. A \n     CARDINAL walks up to Bishop O'Hara.\n\n                               CARDINAL\n               Is this the choir you've been speaking \n               so highly of, Bishop?\n\n                               O'HARA\n               They're just a bit nervous.  They'll be \n               fine.\n\n     The choir seems very demoralized as they finish the hymn. \n     Mary Patrick is close to tears.\n\n                               MARY PATRICK\n               We sound terrible   We need Mary \n               Clarence.\n\n                               MARY LAZARUS\n               We're losing it.\n\n                               MARY ROBERT\n               I don't understand.  Where is she?\n\n                               MOTHER SUPERIOR\n               Her whereabouts are unknown, and we must \n               proceed without her.  Pull yourselves \n               together.\n\n     Clapping his hands briskly, the FLOOR DIRECTOR suddenly \n     steps forward from behind the TV cameras and hustles the \n     choir away from the altar.\n\n                               FLOOR DIRECTOR\n               Okay, Sisters, we have to move on now. \n               That was great, just great.  Charlie, \n               throw a spot on the pulpit.  Let's get a \n               balance.\n\n     Dispirited, the choir leaves the altar and walks toward \n     the back of the church.\n\n     Page 97.\n\n     EXT. LOS ANGELES STREET\n\n     The motorcycle flies through the streets, breaking every \n     traffic law on the books.  Christy's robe flaps behind her \n     in the wind, and she has a wide smile as she rides.  As \n     passersby stare at her, she holds out two fingers and \n     blesses them.\n\n     EXT. ST. MATTHEW'S CATHEDRAL\n\n     Mary Robert stands alone in front of the cathedral, \n     wringing her hands with worry.  Suddenly, her face \n     brightens like the dawn as she sees Christy ride up.\n\n                               MARY ROBERT\n               You're here!  Thank goodness!\n\n     INT. CATHEDRAL\n\n     Christy and Mary Robert rush down a side corridor, turn a \n     corner and see two TV Technicians standing near some cables \n     with the letters of the network embroidered on the backs of \n     their jackets.  Christy rushes up to them and taps them on \n     the shoulders.\n\n                               CHRISTY\n               Excuse me -- where's the rehearsal room?\n\n     The two Technicians turn toward her, and she is horrified \n     to see they are. Joey and Willy.  Christy gasps as Willy \n     sticks a gun in her ribs.  Joey smiles at her.\n\n                               JOEY\n               The rehearsal room is right this way.\n\n     Joey opens a door that leads to an alley behind the \n     cathedral.  Mary Robert looks confused.\n\n                               MARY ROBERT\n               Wait, this isn't the way.  Who are you?\n\n                               CHRISTY\n               They're from my old convent.\n\n     Christy suddenly lifts her knee into Willy's groin, and he \n     buckles over.  She scrambles for the gun, but Joey beats \n     her to it.  Christy looks frantically at Mary Robert.\n\n                               CHRISTY\n               Run!  Take off! \n\n                               MARY ROBERT\n               Again?\n\n     Revived Willy lunges for Mary Robert and grabs her.  The \n     two men hustle the two struggling nuns out the door to the \n     alley.\n\n     Page 98.\n\n     EXT. ALLEY - DAY\n\n     Joey and Willy wrestle the two nuns to the open door of \n     their car.  They shove Christy and Mary Robert into the \n     back seat, and Willy climbs in next to them.\n\n                               WILLY\n               Go!\n\n     Joey starts the car, and it takes off with SQUEALING \n     tires.  Willy has his gun pointed at Christy, who sits \n     beside Mary Robert.\n\n                               MARY ROBERT\n               But what do they want?  Where are we \n               going?\n\n                               CHRISTY\n                             (to Joey and Willy)\n               She's got nothing to do with this.  Let \n               her go.\n\n                               JOEY\n               Yeah, right to the cops.  No way.\n\n                               CHRISTY\n               Mary Robert, don't panic.  Remember what \n               we talked about?  Experience?\n\n                               JOEY\n               What?\n\n                               CHRISTY\n                             (quickly, to Mary \n                             Robert)\n               You can handle this.\n\n     The car comes to a stop at an intersection.  Christy \n     reaches across Mary Robert and opens the car door.  She \n     shoves Mary Robert into the street.\n\n                               CHRISTY\n               Go!\n\n     Mary Robert executes a perfect somersault onto the \n     sidewalk.  She looks to heaven, crosses herself and runs \n     back to the cathedral.\n\n     Willy grabs Christy before she can escape.\n\n                               JOEY\n               She's gettin' away!\n\n                               WILLY\n               Forget her!  We got the one we need! \n               Step on it!\n\n     Joey takes off again.\n\n     Page 99.\n\n     EXT. STREET\n\n     Eddie's car is tied up in traffic, but he turns on his \n     blinker lights and peels over to the opposite lane.  Cars \n     stop to let him through.\n\n     INT. ST. MATTHEW'S CATHEDRAL - DAY\n\n     In the rehearsal room, Mary Robert has just finished \n     telling the nuns what happened to Christy.\n\n                               MARY PATRICK\n               You mean -- they kidnapped her?\n\n                               MARY ROBERT\n               Yes -- two men -- and they had guns.\n\n                               MOTHER SUPERIOR\n               She shouldn't have come back.  She knew \n               she was in danger.\n\n                               MARY PATRICK\n               But -- why would anyone kidnap a nun?\n\n                               MARY LAZARUS\n               Were they Catholics?\n\n     Mother Superior suddenly steps forward.\n\n                               MOTHER SUPERIOR\n               She isn't a nun.  Her real name is \n               Christy Van Cartier, and she is a \n               professional entertainer.  She witnessed \n               a vicious crime, and has been hiding in \n               our convent.\n\n     The nuns all react with shock and emotion.\n\n                               MARY ROBERT\n               An... entertainer?\n\n                               MARY PATRICK\n               She wasn't a nun? \n\n                               ANOTHER NUN\n               She lied to us?\n\n                               MARY ROBERT\n               But... but... she was such a wonderful \n               nun.\n\n                               MARY PATRICK\n               Look what she did with the choir.  She \n               made us sing beautifully.\n\n                               MARY LAZARUS\n               That should have tipped us.\n\n     Page 100.\n\n                               MARY ROBERT\n               Well, I don't care who she is.  We can't \n               sing without her!\n\n                               MARY PATRICK\n               She's our inspiration!\n\n                               MARY LAZARUS\n               She's the act!\n\n                               MARY ROBERT\n               Reverend Mother, I know that you and \n               Mary Clarence didn't always agree, but --\n               we've got to help her.\n\n                               MARY PATRICK\n               We've got to save her!\n\n                               MARY LAZARUS\n               We can't leave it up to the Feds!\n\n     The nuns all look to Mother Superior for an answer.\n\n                               MOTHER SUPERIOR\n               Calm down.  Think clearly.  Mary Robert, \n               do you have any idea who those men were?\n\n                               MARY ROBERT\n               She said they were from her old convent.\n\n                               MOTHER SUPERIOR\n               But... she was a showgirl.  She didn't \n               have an old convent.\n\n                               MARY PATRICK\n               She told us about one.  The Little \n               Sisters of the Moonlight.  In Las Vegas.\n\n                               MOTHER SUPERIOR\n               All right.  It's a beginning.  Las \n               Vegas, Nevada.\n\n     All the nuns hurriedly cross themselves.\n\n                               MOTHER SUPERIOR\n               Mary Lazarus, find the Bishop and tell \n               him the situation.  Everyone else --\n               follow me.\n\n     Mother Superior leads the way out the door.\n\n     EXT. STREET - NIGHT\n\n     The Driver sits at the wheel of the school bus, reading a \n     sleazy novel.  He looks up as the nuns all converge on the \n     door.\n\n     Page 101\n\n                               MOTHER SUPERIOR\n               Emergency!  Open up!\n\n     The Driver opens the door.\n\n                               MOTHER SUPERIOR\n               The San Francisco airport!  Immediately!\n\n     The nuns are all zooming past the Driver, onto the bus.\n\n                               MARY LAZARUS\n                             (to the Driver)\n               Step on it!\n\n     Mary Lazarus grabs the Driver's sleazy novel, confiscating \n     it. The Driver starts the engine.  As the bus drives off, \n     Eddie's car streaks INTO THE SCENE and parks in front of \n     the cathedral.\n\n     INT. ST. MATTHEW'S CATHEDRAL\n\n     Eddie rushes into the lobby and sees Bishop O'Hara.\n\n                               EDDIE\n               Where is she?\n\n                               O'HARA\n               There was a kidnapping.  We think Las \n               Vegas.\n\n     Eddie turns and races back toward the car.\n\n     EXT. SAN FRANCISCO AIRPORT - NIGHT\n\n     Several small planes are parked on the tarmac.\n\n     Mother Superior and the nuns are arguing with the MANAGER \n     of the airport, a grouchy guy in grease-stained overalls.\n\n                               MANAGER\n               Fifteen hundred for the run to Vegas. \n               Rock-bottom.\n\n                               MARY PATRICK\n               But we don't have fifteen hundred!\n\n                               MARY ROBERT\n               We're nuns!\n\n     The Manager starts back toward his office.\n\n                               MANAGER\n               Can't help you.  No exceptions.\n\n                               MOTHER SUPERIOR\n               Young man!\n\n     Page 102.\n\n     The voice has a powerful ring of authority to it, and the \n     Manager looks around.\n\n                               MANAGER\n               What?\n\n                               MOTHER SUPERIOR \n               We are nuns.  We pray.\n\n                               MANAGER\n               So?\n\n                               MOTHER SUPERIOR\n               We pray for good things.  Food for the \n               hungry.\n\n                               MARY PATRICK\n               Peace on Earth.\n\n                               MOTHER SUPERIOR\n               However, we can also pray for other \n               things.\n\n                               MARY PATRICK\n               Measles.\n\n                               MARY ROBERT\n               Lawsuits.\n\n                               MARY LAZARUS\n               Tax audits.\n\n     There is a pause, as the Manager stares at the nuns in \n     horror.\n\n                               MOTHER SUPERIOR\n               Come, Sisters.  Let's go to chapel.  \n               Bring your beads.\n\n     The nuns begin to leave.\n\n                               MANAGER\n               Wait!\n\n     EXT. NIGHT SKY - LATER\n\n     A plane sweeps through the desert sky, headed for Las \n     Vegas.  Through the windows of the plane, we see nuns \n     staring out at the glittering city in the distance.\n\n     INT. MOONLIGHT CASINO - NIGHT\n\n     Packed with gamblers, the room is a flurry of activity. \n     Joey works his way through the crowd, then spots Vince near \n     the money cage.\n\n                               JOEY\n               We got her.\n\n     Page 103.\n\n     Vince follows Joey out of the casino with a grim \n     expression.\n\n     INT. STORAGE ROOM\n\n     Vince and Joey enter a storage room that is cluttered with \n     boxes.  Christy is tied to a chair in the back of the room, \n     with Willy standing guard over her.\n\n     Christy sits very calmly, despite the anger she is in.  \n     She seems distinctly nun-like in her radiant serenity.\n\n                               VINCE\n                             (turning on the charm)\n               Babe.\n\n     Christy does not reply.\n\n                               VINCE\n               Babe, what happened here?  Look at you.\n\n                               CHRISTY\n               Good evening, Vincent.\n\n                               VINCE\n               What, Vincent?  This is me, doll.  I \n               know you.  What did you think you were \n               doing?  Running to the cops.  Hiding out.  \n               No, no.  You're sorry now, aren't you?\n\n                               CHRISTY\n               I am sorry for all my sins.  And yours.\n\n     Vince, Willy and Joey all look at each other, perplexed.\n\n                               WILLY\n               She's a nun, Vince.\n\n                               VINCE\n                             (kneeling by Christy)\n               I love you, Chris.  I always will.  I \n               gave you so much.  My time.  My \n               affection.  A big-time career.  And how \n               do you repay me?  What's the thanks I \n               get?  Where's the loyalty, huh?  Where's \n               the love?\n\n                               CHRISTY\n               You will be judged, Vincent.  We all \n               will.\n\n     Vince stands; the charm hasn't worked.  He's getting \n     angry.\n\n                               VINCE\n               What do you mean -- judged?  I don't get \n               judged, baby.\n                             (MORE)\n\n     Page 104.\n\n                               VINCE (CONT'D)\n               And who are you to talk?  You were \n               nothing.  You couldn't even sing.  I must \n               have been out of my mind.\n\n                               WILLY\n               She's acting weird, Vince.  Ever since \n               we picked her up.\n\n                               JOEY\n               It's spooky.  It's like she ain't even \n               afraid or nothing.\n\n     Vince grabs the front of Christy's habit and squeezes it \n     tightly around her throat.\n\n                               VINCE\n               She's afraid.  Come on, tell the boys \n               you're afraid.\n\n                               CHRISTY\n                             (calmly)\n               I feel sorry for you, Vincent.  And I \n               forgive you.\n\n     This really throws Vince, and angers him further.  He \n     glares at Christy, and then releases her.  He turns to Joey \n     and Willy.\n\n                               VINCE\n               Who gives a damn?  Waste her.\n\n     Joey and Willy look a little unsure as Vince storms out of \n     the room.\n\n     INT. PLANE\n\n     The nuns are mesmerized by the bright skyline with its \n     colorful flashes of neon.\n\n                               MARY PATRICK\n               It's so beautiful...\n\n                               MARY ROBERT\n                And what a lovely name.  Las Vegas...\n\n                               MOTHER SUPERIOR\n               And Gommorah.\n\n     The plane sets down at the Vegas airport.  Mother Superior \n     and the nuns climb out.\n\n     INT. BAR AREA\n\n     Joey and Willy find Vince near the bar.\n\n     Page 105.\n\n                               VINCE\n               It's done?\n\n                               JOEY\n               Not... totally.\n\n                               VINCE\n                             (disturbed)\n               What's the problem?\n\n                               WILLY\n               She's... she's a nun.\n\n                               VINCE\n               Are you nuts?  She's not a nun.  It's \n               Christy.  She's a babe!\n\n                               JOEY\n               But, Vince, how do you know she didn't \n               like, join up and become a nun when she \n               was in that convent?\n\n                               VINCE\n               It didn't happen.\n\n                               WILLY\n               She was real quiet and peaceful all the \n               way back in the car.\n\n                               JOEY\n               No smart-ass remarks or nothing.\n\n                               VINCE\n               I can't believe this.  Okay, I want both \n               you guys to go back there, and both of \n               you shoot her at the same time.\n\n                               JOEY\n               Yeah...\n\n                               WILLY\n               Right.  That way we'd never know which \n               bullet got to her brain and killed her \n               first.  It could always be the other guy.\n\n     They all look happy with this solution as Joey and Willy \n     leave.\n\n     INT. STOREROOM\n\n     Christy still shows no signs of fear as Joey and Willy \n     take out their guns.\n\n                               JOEY\n               Okay, we got one-two-three, and on three \n               we both shoot.  Got it?\n\n     Page 106.\n\n                               WILLY\n               Got it.\n\n     Joey points his gun at Christy's left temple, and Willy \n     points his gun at her right temple.\n\n                               JOEY\n               One... two...\n\n     Christy closes her eyes.\n\n                               JOEY\n               Three!\n\n     Neither man shoots.  They look at each other with anger. \n     Christy opens her eyes.\n\n                               JOEY\n               You didn't shoot!\n\n                               WILLY\n               Neither did you!\n\n                               JOEY\n               I figured if you were gonna, then I \n               wouldn't have to.\n\n                               WILLY\n               That's what I figured, too.\n\n     EXT. LAS VEGAS HELIPORT\n\n     The nuns leave the terminal and stand on the sidewalk out \n     front.\n\n                               MARY ROBERT\n               Las Vegas -- she's here somewhere.\n\n                               MOTHER SUPERIOR\n               But where?\n\n                               MARY PATRICK\n               Look!  There she is!\n\n     Mary Patrick is pointing to a group of billboards that \n     feature huge ads for the local hotels and casinos.  The \n     center billboard has a splashy picture of a roulette wheel, \n     the Elvis impersonator, and Christy and the Ronelles.  The \n     bottom part of the billboard shows the name of the \n     Moonlight Casino and Lounge.\n\n                               MARY ROBERT\n               The Little Sisters of the Moonlight!\n\n                               MARY PATRICK\n               But how do we get there?\n\n     Page 107.\n\n                               MOTHER SUPERIOR\n               Stand back.\n                             (she strides into the \n                             road)\n               Taxi!\n\n     INT. CASINO\n\n     Once again, Joey and Willy find Vince.\n\n                               VINCE\n               Well?\n\n                               JOEY\n               It didn't work, Vince.\n\n                               VINCE\n               You were both supposed to put your guns \n               to her head and shoot.\n\n                               WILLY\n               We both missed.\n\n                               VINCE\n               Okay, so the problem is still the nun \n               outfit, right?\n\n                               JOEY\n               Right.\n\n                               VINCE\n               So, take it off.\n\n                               WILLY\n                             (shocked)\n               Strip down a nun?  You want us to fry?\n\n                               JOEY\n               For like, twelve zillion eternities?\n\n                               VINCE\n               I'm telling you, she's not a nun!  Get \n               her out of the nun outfit, and put her in \n               some clothes.\n\n                               JOEY\n               Maybe pants.\n\n                               WILLY\n               A sweater.\n\n                               JOEY\n               And then we can ice her.  No nun, no \n               evil eye.\n\n     Joey and Willy are very confident about this solution. \n     They strut off, pleased with themselves.\n\n     Page 108.\n\n     EXT. LAS VEGAS AIRPORT - NIGHT\n     Eddie strides out of the airport; he took a later flight \n     than the nuns.  A squad car is waiting; Clarkson beckons \n     him.\n\n                               CLARKSON\n               Lieutenant!\n\n     Eddie jumps in the car.  Clarkson turns on the red bubble \n     light and the SIREN, and the car zooms off.\n\n     INT. STORAGE ROOM - NIGHT\n\n     Joey and Willy return to the storage room, looking \n     confident of their mission this time.  Christy glances up \n     at them as they enter, and Willy begins to untie her.\n\n                               WILLY\n               We got it all worked out.\n\n     He works the ropes free, and Christy rubs her wrists to \n     get circulation back again.\n\n                               JOEY\n               Okay, Christy -- strip.\n\n                               CHRISTY\n               What?\n\n                               JOEY\n               That... thing.  That nun thing.  Take it \n               off.\n\n     Christy suddenly drops to her knees and begins to pray.\n\n                               WILLY\n               What's she doing?\n\n                               JOEY\n               She's praying.\n\n                               CHRISTY\n               And God bless Joey and Willy, who are \n               only trying to do their jobs.\n                             (faking Latin)\n               Pox fibula tibia vobiscum.  Et marcus \n               domino's pizza.  Have mercy.  Amen.\n                             (she looks up at the \n                             guys)\n               I'm finished now.  Help me up.\n\n     As Joey and Willy bend down to help her up, Christy \n     suddenly grabs their neckties in each hand.  With a fierce \n     jerk, she pulls the neckties with all her might, smashing \n     Joey's head against Willy's.\n\n     Page 109.\n\n     Stunned, Joey and Willy stagger backward, holding their \n     heads.  Christy scrambles out the door while the two men \n     groan in pain.\n\n     INT. CORRIDOR\n\n     Joey and Willy burst out of the room with guns drawn.  At \n     the far end of the corridor, they spot a glimpse of black \n     clothing as Christy starts down the stairs.\n\n                               JOEY\n               There she goes!  she's taking the stairs \n               I\n\n     They run quickly after her.\n\n     INT. STAIRWAY\n\n     Christy runs down the stairs as a SHOT rings out.  Christy \n     screams and runs even faster.\n\n     INT. CASINO\n\n     A door swings open into the casino, and Christy appears, \n     looking frantic.  A MUFFLED SHOT is heard behind her, and \n     she sprints into the casino.\n\n     Seconds later, Joey and Willy appear.\n\n                               JOEY\n               Find Vince and tell him what happened. \n               I'll take this side of the room.\n\n     Willy hurries away to find Vince, and Joey starts \n     searching the crowd.\n\n     EXT. THE MOONLIGHT HOTEL AND CASINO\n\n     Three cabs ROAR up in front of the building and nuns \n     tumble out.\n\n     INT. CASINO ENTRANCE\n\n     The nuns enter the casino and stop dead in their tracks. \n     Before them is a large room filled with glitter and sin, \n     the SOUND of jackpots and crap tables.\n\n                               MOTHER SUPERIOR\n               Brace yourselves, Sisters.\n\n     In unison, the nuns all cross themselves.\n\n                               MOTHER SUPERIOR\n               Spread out and look for Mary Clarence. \n               Try to blend in.\n\n     The nuns spread to every part of the room, looking for \n     Christy.\n\n     Page 110.\n\n     INT. CASINO\n\n     A blackjack table; a game is in progress, with several \n     players.  Mary Patrick rushes up to the table.\n\n                               MARY PATRICK\n               Excuse me -- has anyone seen a nun?\n\n                               MARY ROBERT\n               A Benedictine.\n\n     The CROUPIER and the players stare at the two nuns. \n\n     INT. CASINO\n\n     Christy is making her way past a roulette table.  \n     Suddenly, she sees Joey coming toward her, making his way \n     through the crowd.  Christy grabs the arm of a SALESMAN \n     playing roulette.\n\n                               CROUPIER\n               Place your bets. \n\n                               CHRISTY\n                             (to the Salesman)\n               Red 21.\n\n                               SALESMAN\n               You sure?  How do you know?\n\n     Christy looks up to heaven.\n\n                               SALESMAN\n                             (to the Croupier)\n               Red 21.\n\n     Joey stands at the opposite side of the roulette table, \n     glaring at Christy.  The crowd around the table watches \n     Christy for a moment, then they all put their chips down on \n     Red 21.\n\n     Joey starts working his way around the table toward \n     Christy as the Croupier spins the wheel.  The ball falls \n     into a slot.\n\n                               CROUPIER\n               Black 14.\n\n     Everyone at the table turns toward Christy, outraged.  She \n     gives them a reprimanding look.\n\n                               CHRISTY\n               Did you learn something?\n\n     Christy suddenly realizes that Joey is almost at her side. \n     She shoves the Salesman against him and runs away.\n\n     Page 111.\n\n     INT. CASINO\n\n     We see two long rows of slot machines, with gamblers \n     working every machine.\n\n     Willy appears at one end of the row, scanning the area for \n     Christy.  He sees a nun crossing at the far end of the row, \n     and she moves out of sight.  Willy heads in that direction. \n     Someone hits a JACKPOT behind him, and he turns toward the \n     sound.  As he does. he sees another nun crossing at the \n     opposite end of the row of machines.  Willy turns again --\n     now he sees three nuns crossing at the opposite end.  He \n     looks confused, and doesn't know which way to turn.\n\n     EXT. PARKING LOT - NIGHT\n\n     Eddie drives up in the squad car and parks near the back \n     door.\n\n                               EDDIE\n                             (to Clarkson)\n               Close off the block, but don't move in \n               till I tell you.\n\n     Eddie jumps out of the car and hurries inside.\n\n     INT. BLACKJACK AREA\n\n     As Christy moves past a blackjack game, she suddenly sees \n     Vince moving toward her.  Turning quickly, she moves away \n     from Vince, but suddenly sees Joey coming toward her from \n     the opposite direction.  Trapped for a moment, she has \n     panic in her eyes.  Suddenly she is flanked by Mother \n     Superior and Mary Patrick.\n\n                               CHRISTY\n               What are you doing here?\n\n                               MOTHER SUPERIOR\n               Saving you.  Move!\n\n     The nuns surround Christy and head through the crowd in a \n     cluster.  Joey and Vince pursue them from different \n     directions.  Just before they catch them, Mother Superior \n     barks an order.\n\n                               MOTHER SUPERIOR\n               Break!\n\n     The nuns split up, each taking a different direction. \n     Vince and Joey look bewildered.\n\n                               VINCE\n               Get her!\n\n                               JOEY\n               Which one!\n\n     Page 112.\n\n                               VINCE\n               The nun!\n\n     Vince, Joey and Willy each pick a nun and follow her.\n\n     Vince catches up to a nun, whom we only see from the rear. \n     He grabs her shoulder.\n\n                               VINCE\n               Babe.\n\n     The nun spins around; it is Mother Superior.\n\n                               MOTHER SUPERIOR\n               Sweetheart.\n\n     Vince releases her and frantically searches the crowd \n     again.\n\n     Joey catches up with his nun, only to find it is Mary \n     Patrick.  The shell game has worked; Christy has escaped \n     for the moment.\n\n     INT. SLOT MACHINE AREA\n\n     We FIND Eddie scanning the floor and seeing nuns spread \n     out everywhere.  He talks quietly into his walkie-talkie.\n\n                               EDDIE\n               Move in.  Seal off the exits, but don't \n               come inside till I tell you.\n\n     INT. CASINO\n\n     Vince, Joey and Willy run into each other in the center of \n     the casino.\n\n                               WILLY\n               There's nuns everywhere!  Hundreds of \n               'em!\n\n     All the nuns suddenly come together, and see that the \n     exits are blocked by Vince and his hoods.  Vince spots \n     Christy in the center of the group.\n\n                               VINCE\n               There she is!\n\n                               JOEY\n               Which one?\n\n     Christy sees Vince pointing at her.\n\n                               CHRISTY\n               Quick, there's another way out of here.  \n               Follow me.\n\n     Page 113.\n\n     Christy runs toward a set of glass doors set off to one \n     side.  The other nuns follow her.\n\n                               VINCE\n               She's heading for the lounge!  Go!\n\n     Vince, Joey and Willy head for the lounge.\n\n     Across the room, Eddie sees Christy and the cluster of \n     nuns head through the glass doors.  He barks into his \n     walkie-talkie.\n\n                               EDDIE\n               Move in -- now!\n\n     INT. LOUNGE\n\n     The lounge is deserted between shows, and all the lights \n     are out.  The mobsters enter with guns drawn.\n\n                               JOEY\n               I can't see anything in here!\n\n                               VINCE\n               Willy -- hit the lights.\n\n                               WILLY\n               Where?\n\n                               VINCE\n               Find 'em!\n\n     Willy moves off to find the light switch.  There is a \n     flash of black and white fabric behind some chairs.\n\n                               JOEY\n               There!\n\n               Before he can shoot, there is another \n               flash of fabric on the opposite side of \n               the room.\n\n                               VINCE\n                             (aiming)\n               No -- there!\n\n     And a third flash of fabric near the stage.\n\n                               JOEY\n               Over there!\n\n     Willy has found the lights, and the lounge is suddenly \n     brightly lit.  The mobsters blink for a moment, then find \n     all the nuns bunched together in a corner, trying to find \n     an exit.\n\n                               VINCE\n               Freeze!  Everybody!\n\n     Page 114.\n\n     The nuns turn and face the mobsters, shielding Christy.\n\n                               VINCE\n               Joey?\n\n                               JOEY\n               Where is she?\n\n     Christy steps forward, to the front of the stage.\n\n                               CHRISTY\n               Right here.  Let the others go -- they \n               have nothing to do with this.\n\n                               VINCE\n               Joey -- do it.\n\n                               JOEY\n               But, boss -- she's still, you know, a \n               nun.\n\n                               VINCE\n               She's a broad!  Got it!  Just some \n               broad!\n\n     Mother Superior steps forward.\n\n                               MOTHER SUPERIOR\n                             (with authority)\n               I guarantee you, she is no broad.  She \n               is Sister Mary Clarence, of St. \n               Katherine's Convent.  She is a model of \n               generosity, virtue and love.  You have my \n               word, gentlemen.  She is a nun.\n\n                               WILLY\n               Hear that?  Now aren't you glad we \n               didn't shoot her?\n\n     Vince has had enough.  Facing Christy, he raises the gun \n     and points it right between Christy's eyes, only inches \n     away.  The nuns all recoil with horror.\n\n     BLAM!  The gun goes off, but Christy isn't hit.  She \n     blinks her eyes open, shocked to be alive.  Instead, it's \n     Vince who falls, crumpling to the floor, and clutching his \n     shoulder.\n\n     Across the room, Eddie holds a smoking police revolver. \n     The nuns all swarm around Christy joyously.\n\n                               MARY ROBERT\n               Mary Clarence -- you're alive!\n\n                               MARY PATRICK\n                             (smiling)\n               Christy.\n\n     Page 115.\n\n                               MARY LAZARUS\n                             (also smiling)\n               Van Cartier.\n\n                               CHRISTY\n               You know?  About me?  About everything?\n\n     Christy breaks away from the jubilant nuns. She faces \n     Mother Superior.\n\n                               CHRISTY\n               Reverend Mother -- Thank-you.\n\n                               MOTHER SUPERIOR\n               Oh?\n\n                               CHRISTY\n               You saved my life.\n\n                               MOTHER SUPERIOR\n               I'm a Christian.\n\n     Police pour into the room and gather up Joey, Willy and \n     Vince.  Eddie walks over to Christy and Mother Superior.\n\n                               EDDIE\n               Don't you have a concert to go to?\n\n                               CHRISTY\n               That depends.  Sisters, you don't know \n               this, but Reverend Mother's been making \n               all sorts of noises about resigning. \n               That's bad news.  I don't know if we \n               could sing, if we thought that was true.\n\n                               MARY ROBERT\n               Not a note.\n\n                               MARY PATRICK\n               Impossible.\n\n     Mary Lazarus coughs, and points to her throat, as if she \n     has laryngitis.  All the other nuns imitate her.\n\n                               CHRISTY\n                             (to Mother Superior)\n               Then I guess you're stuck.  Life \n               sentence.  No parole.\n\n                               MOTHER SUPERIOR\n               Very well.\n                             (she turns to Eddie)\n               I hold you responsible for all of this, \n               For introducing a lounge act into my \n               convent.  For utterly disrupting our way \n               of life.  And for placing all of us in \n               mortal danger.\n                             (sincerely, with a \n                             smile)\n               Thank-you.\n\n     Page 116.\n\n     ANGLE on Christy, watching this.  She grins.\n\n                               CHRISTY\n               Yeah, Eddie, thanks a whole bunch. \n               Thanks for sticking me in a convent.  So \n               you think, after all this, maybe I really \n               am a nun?\n\n                               EDDIE\n               I don't know.  There's only one way to \n               be absolutely sure.\n\n                               CHRISTY\n               Yeah, like what?\n\n     Eddie takes Christy in his arms, and they begin a kiss.  \n     As they do so, Vince struggles toward Christy, as two cops \n     hold him back.  He is furious.\n\n                               VINCE\n               I was good to you! You re nothing but \n               no-talent garbage! You're a two-bit \n               Tramp!\n\n                               CHRISTY\n                             (staring at Vince, \n                             seeing him for the scum \n                             that he is)\n               That used to be true, Vince.  I was with \n               you.  But something happened.  And I'm \n               different now.  Real--different.  I've \n               had, well, you might call it -- a \n               religious experience.  And I've got just \n               two words for you.  And those two words \n               are...\n\n                               MARY ROBERT\n                             (afraid Christy will \n                             curse)\n               Mary Clarence!\n\n                               CHRISTY\n                             (grinning, to Vince)\n               Bless you.\n\n     EXT. ST. MATTHEW'S CATHEDRAL\n\n     People are pouring into the cathedral.  Among them we see \n     many Cardinals in their red uniforms.\n\n     INT. ST. MATTHEW'S CATHEDRAL\n\n     The choir has gathered together in a small room off the \n     main chapel.  They are putting finishing touches on their \n     choral robes, and are waiting nervously to go on.\n\n                               MARY PATRICK\n                             (to Christy)\n               I just realized -- this is the last time \n               we'll all be together.  We're going to \n               miss you so much.\n\n     Page 117.\n\n     Christy and Mary Patrick embrace.  Mary Patrick is \n     tearful.\n\n                               CHRISTY\n               Hey -- you re supposed to be the \n               cheerful one.  Why do I suddenly feel \n               like Snow White?\n\n                               MARY LAZARUS\n                             (to Christy, with \n                             humor)\n               You re okay -- for a civilian.\n\n     Christy and Mary Lazarus embrace.\n\n                               MARY ROBERT\n               Reverend Mother?\n\n                               MOTHER SUPERIOR\n               Yes?\n\n                               MARY ROBERT\n               Since Mary Clarence came to St. \n               Katherine's, I've been shot at, kidnapped \n               by Mafia hit men, and I've tasted beer.  \n               Is that enough experience yet?  For final \n               vows?\n\n                               CHRISTY\n               I don't think so.  What about skydiving?  \n               A crank call to Billy Graham?\n\n                               MOTHER SUPERIOR\n               You have evidenced great maturity, Mary \n               Robert.  We shall have a serious \n               discussion.\n\n                               CHRISTY\n               What about me, Reverend Mother?  I think \n               you were right.  I'm just a bad \n               influence.  Sister show biz.\n\n                               MOTHER SUPERIOR\n               Perhaps not.  Perhaps we can all use... \n               a little Spandex.\n\n                               CHRISTY\n               Really?  And maybe shorter habits, and \n               women priests, and sleeping late?\n\n                               MOTHER SUPERIOR\n               Don't push it.\n\n     Christy and Mother Superior embrace.\n\n     INT. CHAPEL\n\n     The chapel is packed to the rafters.  The first few rows \n     of pews are occupied by Cardinals.  Television cameras \n     glide up and down the aisles, angling for shots of the \n     altar.\n\n     Page 118.\n\n     The Choir stands together on the altar with Christy in \n     front. Behind them stands a much larger, all-city choir. \n     Christy gives the nod to Sister Alma, and the organ vamp \n     begins.\n\n                               MARY ROBERT\n               I WAS DOWNHEARTED\n\n                               CHRISTY\n               It's true!\n\n                               MARY ROBERT\n               I WAS HELL-BOUND, \n               YES THAT'S WHAT THEY SAY\n               SATAN WAS WAITING\n\n                               CHRISTY\n               Don't you know it!\n\n                               MARY ROBERT\n               BUT THE LORD CAME TO ME\n\n                               CHRISTY\n               What did He say?\n\n                               MARY ROBERT\n               HE SAID, SING THE DEVIL AWAY!\n\n                               MARY PATRICK\n               MY SOUL WAS IN DANGER\n               I'D FALLEN FROM GRACE\n\n                               CHRISTY\n               It's true -- I know her.\n\n                               MARY PATRICK\n               DAMNATION WAS ALL I COULD SEE\n\n                               CHRISTY\n               What a shame!\n\n                               MARY PATRICK\n               BUT THEN CAME AN ANGEL\n               WHO WHISPERED THESE WORDS\n\n                               CHRISTY\n               Pay attention...\n\n                               MARY PATRICK\n               SING AND THE DEVIL WILL FLEE!\n\n                               CHRISTY\n               Were you wicked?\n\n                               CHOIR\n               SING!\n\n                               CHRISTY\n               Were you tempted?\n\n                               CHOIR\n               SING!\n               SING AND YOUR SPIRIT WILL SOAR!\n\n     Page 119.\n\n     In the front row, Mother Superior is trying to resist the \n     music.  She gives in, and starts bobbing her head to the \n     beat.  Beside her, Eddie looks very proud as his eyes meet \n     Christy's.\n\n                               CHRISTY\n               But I'm fearful!\n\n                               CHOIR\n               SING!\n\n                               CHRISTY\n               And I'm tearful!\n\n                               CHOIR\n               SING!\n\n                               CHRISTY\n               YES I'LL SING AND KNOW JOY EVERMORE\n\n                               CHRISTY/CHOIR\n               DO YOUR TROUBLES BIND YOU\n               IF YOO'RE DEEP IN WOE\n               YOU CAN BANISH GLOOM IF YOU TRY\n               FIND A SONG WITHIN YOU\n               LET IT FILL YOUR DAYS\n               JUST SING\n\n                               MARY ROBERT\n               SING!\n\n                               CHOIR\n               JUST SING!\n\n                               MARY PATRICK\n               SING!\n\n                               MARY LAZARUS\n               JUST SING!\n\n                               CHRISTY\n               Sing!\n\n                               CHRISTY/CHOIR\n               SING AND SAY DEVIL, GOODBYE!\n\n     The entire congregation is ecstatic, as the song concludes \n     with a glorious final flourish.\n\n     FADE OUT:\n\n     THE END\n\n\n\n\n\nSister Act\nWriters :   Paul Rudnick\nGenres :   Comedy  Crime  Musical\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:35:45.870147"}