{"title": "Snow White and the Huntsman", "film_link": "/Movie Scripts/Snow White and the Huntsman Script.html", "script_link": "/scripts/Snow-White-and-the-Huntsman.html", "info_raw": "\n\nSnow White and the Huntsman Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Evan Daugherty  John Lee Hancock  Hossein Amini\nGenres  Action  Adventure  Drama\nScript Date : November 2011\nMovie Release Date : June 2012\n\nRead \"Snow White and the Huntsman\" Script\n\n\n", "script": "\n\r\n\r\n\r\n \r\n                           SNOW WHITE AND THE HUNTSMAN\r\n\r\n\r\n\r\n                                   Written by\r\n\r\n                 Evan Daugherty, John Lee Hancock & Hossein Amini\r\n\r\n\r\n\r\n                                   Story by\r\n\r\n                                Evan Daugherty\r\n\r\n\r\n                         \r\n                        Inspired by the Brothers Grimm's\r\n\r\n                             \"Little Snow White\"\r\n                      \r\n\r\n                         \r\n\r\n                         \r\n\r\n                                                     November 22nd, 2011\r\n\r\n\r\n\r\n          1 EXT. GARDENS/ CASTLE - DAY. 1\r\n\r\n          From high above we see the castle gardens covered in a blanket\r\n          of snow. We hear the tread of footsteps then see a beautiful\r\n          WOMAN in a fur-lined cloak heading towards an unseen object.\r\n\r\n          ERIC (V.0.)\r\n          Once upon a time, in deep winter, a Queen\r\n          was admiring the falling snow when she saw\r\n          a rose blooming in defiance of the cold.\r\n          The rose looks miraculously red. Nearby, a RAVEN looks on. The\r\n          Queen gazes at the flower, then bends down.\r\n\r\n          ERIC (V.0.)\r\n          Reaching for it, she pricked her finger and\r\n          three drops of blood fell.\r\n          BOOM -- with the impact of an artillery shell, a DROP OF BLOOD\r\n          lands in the snow. Followed by ANOTHER. And ANOTHER.\r\n          The Queen startles, then calmly touches her stomach.\r\n\r\n          ERIC (V.0.)\r\n          And because the red seemed so alive against\r\n          the white, she thought, if only I had a\r\n          child as white as snow, lips as red as\r\n          blood, hair as black as a raven's wings and\r\n          all with the strength of that rose.\r\n          A beat, then we hear the piercing cry of a new-born baby --\r\n\r\n          2 INT. ROYAL BEDROOM - DAY. 2\r\n\r\n          We find ourselves in a crowded chamber full of MIDWIVES and\r\n          PHYSICIANS. Moving through the chaos we glimpse buckets of\r\n          water, dirty sponges, astrology charts and protection charms --\r\n          until we see a BABY GIRL in the arms of her happy mother.\r\n\r\n          ERIC (V.O.)\r\n          Soon after, a daughter was born to the\r\n          Queen and was named \"Snow White.\"\r\n          With a radiant smile, the Queen offers SNOW WHITE to her proud\r\n          father, KING MAGNUS. The baby's CRIES grow louder as the King\r\n          cradles her gently in his arms, turning towards a mirror.\r\n\r\n          ERIC V/O\r\n          And she was adored throughout the kingdom\r\n          as much for her defiant spirit as for her\r\n          beauty.\r\n\r\n          3 EXT. WOODS NEAR CASTLE - DAY. 3\r\n\r\n          A wounded MAGPIE is twitching in a puddle of water. SNOW WHITE,\r\n          aged 7 now, steps towards it hesitantly, looking concerned.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            2\r\n\r\n                         3 CONTINUED: 3\r\n\r\n          YOUNG SNOW WHITE\r\n          Pick it up, William.\r\n          Her companion, William, also 7, braces himself, reaches down,\r\n          then steps back in alarm as the bird starts flapping wildly. He\r\n          tries to cover his embarrassment by sounding knowledgeable.\r\n\r\n                         YOUNG WILLIAM\r\n          It's dying. It doesn't want to be touched.\r\n          Snow White ignores him, approaching the bird herself. She kneels\r\n          down, hesitates, then reaches out and strokes the magpie,\r\n          calming its flapping before she picks it up.\r\n          High up on a tree, ANOTHER MAGPIE looks on.\r\n\r\n          4 EXT. SEASIDE VILLAGE/ CASTLE BRIDGE - DAY 4\r\n\r\n          SNOW WHITE runs, cupping the wounded bird in her hand, William\r\n          dashing after her. The sun is out and the fields and forests are\r\n          lit up in all their glory. The children sprint through a\r\n          BEAUTIFUL SEASIDE VILLAGE -- thatched homes with flower gardens,\r\n          HAPPY FARMERS and FAIR VILLAGE MAIDENS --\r\n\r\n          YOUNG SNOW WHITE\r\n          Hurry, William! Hurry!\r\n          They run down the dunes, waves crashing, the sand gleaming in\r\n          the sunlight, until they see the BEAUTIFUL CASTLE up ahead --\r\n\r\n          5 EXT. CLOISTER GARDENS/ CASTLE - DAY 5\r\n\r\n           A single apple tree stands in the middle of the cloisters. It\r\n           stands out. Snow White and William dash past it into the castle.\r\n\r\n                         6 OMITTED 6\r\n\r\n          7 INT. ROYAL BEDROOM - DAY. 7\r\n\r\n          Snow White bursts into her parent's chamber. The King and Queen\r\n          turn from the window. Two PHYSICIANS are in attendance. Snow\r\n          White is too young and preoccupied to notice but her mother's\r\n          smile is tinged with sadness and her father looks heartbroken.\r\n\r\n          YOUNG SNOW WHITE\r\n          We found it in the woods.\r\n          The Queen takes the wounded magpie from Snow White. The King\r\n          looks on sadly as she pulls a RIBBON from Snow White's hair and\r\n          carefully binds the magpie's wing. William watches from the\r\n          doorway, noticing how frail the Queen looks.\r\n          The magpie's flapping gradually calms, its pain easing.\r\n\r\n                         QUEEN\r\n          It will heal in time.\r\n          Snow White's eyes are fixed on the little bird.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            3\r\n\r\n                         7 CONTINUED: 7\r\n\r\n                         SNOW WHITE\r\n          I'll look after it.\r\n          The King watches Snow White, hiding his sorrow behind a smile.\r\n          So does the Queen, holding back her tears.\r\n\r\n                         QUEEN\r\n          You possess a rare beauty, my love. In\r\n          here.\r\n          (She touches Snow white's heart)\r\n          Never lose it. Hold it dear. You will need\r\n          its strength to one day become Queen.\r\n\r\n          8 EXT. CLOISTER GARDEN/ CASTLE - DAY. 8\r\n\r\n          Snow White and William, with a small toy bow strapped to his\r\n          back, climb the branches of the apple tree in the cloister\r\n          gardens. William picks a DISTINCTIVE RED AND WHITE APPLE and\r\n          offers it to Snow White.\r\n          He makes a point of the offer, holding it out, nodding.\r\n          Just as she comes to take it he pulls it away and takes a\r\n          huge bite himself, grinning. Snow White shoves him off the\r\n          tree and they fall to the ground.\r\n          And now we PULL BACK to reveal the King and William's father,\r\n          DUKE HAMMOND, watching from the throne room balcony.\r\n\r\n                         KING MAGNUS\r\n          My daughter will need your son's friendship\r\n          more than ever, Duke Hammond. As will I\r\n          yours.\r\n\r\n                         DUKE HAMMOND\r\n          We are here to serve you, your Majesty.\r\n          As the King watches his daughter, ERIC'S VOICEOVER resumes:\r\n\r\n          ERIC (V.0)\r\n          The next winter was the harshest in memory\r\n          and Snow White's mother passed away.\r\n          Ba EXT. GARDENS/ CASTLE - DAY. 8a\r\n          The garden is covered in snow but there is no red rose now. King\r\n          Magnus walks with his arm around Snow white, heartbroken.\r\n          A single tear rolls down Snow White's cheek. Palace onlookers\r\n          and mourners, fixed on her face, feeling what she feels, move\r\n          aside.\r\n\r\n          ERIC (V.0)\r\n          A year went by but the King was\r\n          inconsolable. Taking advantage of his\r\n          grief, dark forces gathered on the\r\n          kingdom's borders.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            4\r\n\r\n                         9 OMITTED 9\r\n\r\n          10 EXT. FOREST/ BATTLEFIELD - DAY 10\r\n\r\n           From above we see horses movie through the forest and enter a\r\n           clearing. At the head is --\r\n          King Magnus, with Duke Hammond by his side, surrounded by a\r\n          line of the King's Army. They are frozen as they look at--\r\n          Across the battlefield - Horsemen in a line. THE RIDERS are\r\n          silhouetted on a misty plain -- a VAST SHADOW ARMY of faceless\r\n          warriors.\r\n          King Magnus and the Duke trade a look -\r\n\r\n                         DUKE HAMMOND\r\n          From what hell comes this army?\r\n\r\n                         KING MAGNUS\r\n          A hell they'll soon revisit!\r\n          King Magnus SCREAMS A BLOOD CRY, kicks his horse and rides\r\n          forward with blind courage, no longer caring what happens to\r\n          him.\r\n          The two lines of warriors race, pell-mell to the center of\r\n          the battlefield. When they meet --\r\n          Hand to hand combat at its most brutal.\r\n          King Magnus swings his great sword, and a SHADOW WARRIOR\r\n\r\n          SHATTERS LIKE GLASS.\r\n          All down the line the same is happening - Shadow Warriors\r\n          shattering, evaporating.\r\n          Strange.\r\n          DUKE HAMMOND shatters an opponent as well and as loud and\r\n          furious as the battlefield was only moments before, it is now\r\n          that quiet.\r\n          The King and the Duke watch in amazement as the rest of the\r\n          SHADOW ARMY melts away, DISSOLVING INTO THE MORNING MIST until\r\n          all that is left in the field is --\r\n\r\n          ERIC (V.0.)\r\n          The unholy army was defeated, leaving\r\n          King Magnus with the spoils of victory.\r\n          A CAGED PRISON WAGON. Odd. Not even sure how it got there.\r\n          King Magnus moves toward it, with a little trepidation. When\r\n          he's close he gets off his horse, walks closer and dares to\r\n          look inside.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            5\r\n\r\n                         10 CONTINUED: 10\r\n          Inside the cage, a WOMAN COWERS, her face hidden behind a veil.\r\n          King Magnus stares at her through the prison bars, then with a\r\n          mighty blow of his sword shatters the lock and enters.\r\n\r\n                         KING MAGNUS\r\n          You are now free. You have nothing to fear\r\n          from me.\r\n          Duke Hammond watches from outside the cage, a bit wary, as the\r\n          King kneels beside the terrified woman.\r\n\r\n                         KING MAGNUS\r\n          What is your name, my lady?\r\n          Slowly, the woman turns. For a moment the King wonders if it's\r\n          his beloved Queen behind the veil. Gently, he lifts her veil.\r\n          It's not his wife, but the most beautiful woman he's ever seen.\r\n\r\n                         RAVENNA\r\n          My name is Ravenna, sire.\r\n          The King is speechless now, gazing upon the face of an angel.\r\n\r\n          ERIC (V.0.)\r\n          So struck by her beauty was the King, that\r\n          he forgot, for the first time, his broken\r\n          heart.\r\n          His gaze is so intense that Ravenna looks down for a moment.\r\n          When she lifts her head --\r\n\r\n                         CUT TO:\r\n          10a INT. GYPSY WAGON - FLASHBACK - DAY. l0a\r\n          YOUNG RAVENNA - her face reflected in a small hand mirror.\r\n          Ravenna as a child, beautiful but poor, looks into the\r\n          mirror. Her MOTHER, a gypsy woman in tattered clothes, moves\r\n          the mirror closer.\r\n\r\n                         RAVENNA'S MOTHER\r\n          This - is all that can save you, Ravenna.\r\n          The young Ravenna looks away, distracted by SHOUTS and\r\n          COMMOTION outside.\r\n          10b EXT. GYPSY CAMP - SAME - DAY. 10b\r\n          A little boy, FINN, runs as fast as he can through the snow\r\n          toward the Gypsy Camp.\r\n          Behind him, THE KING'S RIDERS advance on the camp.\r\n\r\n          BACK INSIDE THE WAGON\r\n          Ravenna's mother tries to keep her daughter's attention --\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            6\r\n          10b CONTINUED: 10b\r\n\r\n                          RAVENNA'S MOTHER\r\n           Ravenna!\r\n\r\n          11 INT. PREPARATION CHAMBER/ CASTLE - DAY. 11\r\n\r\n\r\n          CU - RAVENNA'S FACE\r\n          Present day. Still as a statue and even more beautiful as\r\n          cheeks are powdered, eyebrows plucked and lips painted by\r\n          several sets of HANDS. Her eyes stare straight ahead,\r\n          unblinking, her mind elsewhere.\r\n          Attendants are preparing Ravenna for her wedding to the King.\r\n\r\n          SNOW WHITE (O.S.)\r\n          You're so beautiful...\r\n          Ravenna snaps to and looks into the face of Snow White,\r\n          reverential, standing a few feet away.\r\n          Ravenna's face softens as she looks at the face of Snow\r\n          White. Ravenna beckons to her with a look and then holds out\r\n          her arm - \"Come.\"\r\n          As Snow White steps forward, the handmaidens withdraw until\r\n          only one is left, weaving beautiful flowers in Ravenna's\r\n          hair.\r\n\r\n                         RAVENNA\r\n          That is kind, child. Especially when it is\r\n          said that yours is the face of true beauty\r\n          in this kingdom.\r\n          Snow White doesn't quite know how to answer this.\r\n\r\n                         RAVENNA\r\n          (A warm smile)\r\n          Would you like to be dressed up like this\r\n          and married one day?\r\n          Snow White nods.\r\n\r\n                         RAVENNA\r\n          I hope you'll invite me?\r\n\r\n          YOUNG SNOW WHITE\r\n          Of course.\r\n          Snow White smiles, enchanted by her new friend.\r\n\r\n                         RAVENNA\r\n          I know it is difficult, child. When I\r\n          was your age I, too, lost my mother.\r\n\r\n                         SNOW WHITE\r\n          You did?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           7\r\n\r\n                         CONTINUED:\r\n\r\n                         RAVENNA\r\n          Yes. A King tore me from her arms,\r\n          dressed me in lace and stole my\r\n          innocence.\r\n          Snow White's smile dies a bit; confused.\r\n\r\n                         RAVENNA\r\n          I can never take your mother's place, but\r\n          I feel that you and I are bound.\r\n          (touches her heart)\r\n          I feel it here.\r\n          Snow White mimics, touching her own heart, and smiles at\r\n          Ravenna. It should be a touching moment but something in\r\n          Snow White's face - the way her smile lights up the room -\r\n          gives Ravenna pause.\r\n\r\n          12 INT. CATHEDRAL - DAY 12\r\n\r\n          Ravenna, in a stunning dress,.walks down the center aisle. All\r\n          the NOBLES in the land are present.\r\n          Ravenna looks at them, on either side of the aisle. They are all\r\n          smiling, nodding appreciation. But they aren't really looking\r\n          at Ravenna. She follows their gaze to --\r\n          Snow White, behind, holding the folds of silk from the\r\n          wedding dress. Snow White looks up, adoringly, at Ravenna.\r\n          As the bride and groom reach the altar, KING MAGNUS turns and\r\n          smiles, the happiest man alive.\r\n\r\n          13 INT. ROYAL BEDROOM - NIGHT 13\r\n\r\n          King Magnus lies on the bed, drunk - half with wine and half\r\n          with lust. His eyes fixed on --\r\n          Ravenna, in a sheer silk nightgown standing near the fireplace,\r\n          holding a goblet. Staring a seductive hole through him.\r\n          She starts slowly toward him, never taking her eyes off him.\r\n          He licks his lips - can't wait for her to arrive.\r\n\r\n                         KING MAGNUS\r\n          (Gazing at her lustfully)\r\n          Who are you?\r\n\r\n                         RAVENNA\r\n          The bane of Kings.\r\n          When she does arrive she slowly crawls onto the bed, rolls\r\n          him on his back, straddles him and offers the goblet.\r\n\r\n                         RAVENNA\r\n          Sup, my lord.\r\n          King Magnus drains the goblet, tosses it and gropes her body.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            8\r\n\r\n                         13 CONTINUED: 13\r\n\r\n                         RAVENNA\r\n          Now you are mine.\r\n          Her eyes gleam in the firelight. Magnus tries to playfully\r\n          wrestle her off, but she grabs his hands and holds him down\r\n          firmly.\r\n\r\n                         RAVENNA\r\n          I will destroy you.\r\n\r\n                         KING MAGNUS\r\n\r\n                         (LOVING IT)\r\n          Indeed, you will.\r\n          She rips open his shirt then bends down and kisses him on the\r\n          lips. He can't believe how good she tastes.\r\n\r\n                         RAVENNA\r\n          As my people were destroyed. As my family\r\n          was destroyed. As I would have been\r\n          destroyed.\r\n          He is slightly confused by this and his face begins to show\r\n          discomfort.\r\n\r\n                         RAVENNA\r\n          But when a woman stays young forever - no\r\n          man can resist her - and the world is hers.\r\n          He suddenly STARTS TO CHOKE, his eyes widening in surprise.\r\n          As he struggles for breath...\r\n\r\n                         KING MAGNUS\r\n          What...?\r\n\r\n                         RAVENNA\r\n          First I will take your life, my lord. Then\r\n          I will take your throne.\r\n          She reaches beneath the sheets, pulls out an ORNATE DAGGER\r\n          and BRINGS IT DOWN THROUGH HIM --\r\n          13a EXT. OUTSIDE ROYAL BEDROOM 13a\r\n          Several Guards line the hallway. The door opens and Ravenna\r\n          emerges. As she moves past them...\r\n\r\n                         RAVENNA\r\n          The King has laid down his sword for the\r\n          night.\r\n          Their eyes take her, lustfully, in as she strides away and\r\n          disappears around a corner.\r\n\r\n                         CUT TO:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            9\r\n          13b INT. GYPSY WAGON - FLASHBACK - DAY. 13b\r\n          Ravenna's mother takes Ravenna's hand and holds it over a\r\n          bowl of white liquid.\r\n\r\n                         RAVENNA'S MOTHER\r\n          You must trust me, my love.\r\n          With a small blade she nicks Ravenna's wrist. Three drops of\r\n          blood fall into the white liquid - BOOM! BOOM! BOOM!\r\n          Finn, Ravenna's brother blasts through the door.\r\n\r\n                         FINN\r\n          They're coming! The King's men!\r\n\r\n                         RAVENNA\r\n          Drink!\r\n          Ravenna chokes it down.\r\n\r\n                         RAVENNA'S MOTHER\r\n          Drink! And with it the ability to steal\r\n          youth and beauty! For that is your\r\n          ultimate power and only protection.\r\n          Finn steps forward.\r\n\r\n                         FINN\r\n          I will protect my sister!\r\n          Ravenna's mother reaches out and touches her son's forehead,\r\n          closes her eyes, an incantation of sorts...\r\n\r\n                         FINN\r\n          So it shall be, Finn.\r\n\r\n                         CUT TO:\r\n\r\n          14 EXT. COURTYARD/CASTLE - PRESENT - NIGHT 14\r\n\r\n          Ravenna exits the castle and crosses the courtyard with a\r\n          lantern. A portcullis opens and DARK FIGURES emerge from the\r\n          shadows, entering the castle. Leading them is a tall pale-eyed\r\n          warrior (FINN). He looks at Ravenna devotedly.\r\n\r\n                         RAVENNA\r\n          Welcome, brother.\r\n\r\n          15 INT. CORRIDORS/ CASTLE - NIGHT. 15\r\n\r\n          We see the shadows of the invaders sweeping through the\r\n          corridors, putting the King's sleeping soldiers to the sword.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           10\r\n\r\n          16 INT. SNOW WHITE'S ROOM/ CASTLE - NIGHT 16\r\n\r\n          Snow White lies asleep when she hears a bell ringing. At first\r\n          she thinks she's dreaming, but then she hears cries of alarm.\r\n          She sits up curiously, then climbs out of bed --\r\n\r\n          17 INT. CORRIDOR OUTSIDE SNOW WHITE'S ROOM - NIGHT. 17\r\n\r\n          There's panic and chaos outside, COURTIERS and SOLDIERS running\r\n          for their lives. Snow White stares in confusion, then runs too -\r\n\r\n          18 INT. CORRIDOR OUTSIDE ROYAL BEDROOM - NIGHT. 18\r\n\r\n          Snow White rushes towards her father's chamber and sees Ravenna\r\n          at the end of the corridor. Relieved, she hurries towards her\r\n          stepmother when suddenly she notices her father's lifeless body\r\n          lying on the bed. FINN and his KNIGHTS appear beside Ravenna. It\r\n          takes a moment for the betrayal to sink in, tears of shock\r\n          welling in Snow White's eyes, before she turns and flees --\r\n\r\n          19 EXT. COURTYARD/CASTLE -- NIGHT. 19\r\n\r\n          The chaos has spread to the courtyard, DUKE HAMMOND'S KNIGHTS\r\n          struggling to hold back the invaders. Snow White hurries out,\r\n          dazed by the sight of battle, then sees William pull free of his\r\n          father's guards and run towards her --\r\n          William grabs her protectively when strong arms reach down and\r\n          lift them both onto the back of separate horses. Duke Hammond\r\n          and his personal guard are attempting to ride out of the castle\r\n          before the portcullis closes.\r\n          The Duke rides under the portcullis with William. His bodyguard\r\n          is about to follow when an ARROW FROM FINN STRIKES HIM IN THE\r\n          BACK and both he and Snow White are thrown off their horse.\r\n\r\n                         YOUNG WILLIAM\r\n          Father! The Princess!\r\n          But the portcullis is down, separating Snow White and William.\r\n          The last thing he sees is Snow White struggling in Finn's arms,\r\n          being hauled back into the castle.\r\n\r\n          20 INT. MIRROR CHAMBER - NIGHT 20\r\n\r\n          Ravenna walks from statue to painting to urn, toppling and\r\n          tearing them from the walls. Cleaning house. Ravenna's soldiers\r\n          deliver a large object, then leaving her alone. A BEAUTIFUL\r\n          MIRROR rests against the wall. Ravenna stares at it.\r\n\r\n                         RAVENNA\r\n          Mirror, mirror, on the wall\r\n          Who is the fairest of them all?\r\n          There'.s a brief silence, then the surface of the mirror ripples.\r\n          LIQUID-spills onto the floor where it reforms into the shape of\r\n          THE MIRROR MAN. His body is a veil of reflective bronze but his\r\n          face-is a distorted version of Ravenna's own.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            11\r\n\r\n                         20 CONTINUED: 20\r\n\r\n                         MIRROR MAN\r\n          it is you, my Queen! Yet another kingdom\r\n          falls to your glory! Is there no end to\r\n          your power and beauty?\r\n          Ravenna smiles, moves to the center of the room, raises her arms\r\n          and drunk with power --\r\n          SCREAMS! The scream becomes --\r\n\r\n                          CUT TO:\r\n          20a EXT. GYPSY WAGON - FLASHBACK - DAY. 20a\r\n          Young Ravenna's SCREAM as she is ripped from her mother's\r\n          arms. Finn throws himself into the mix but is backhanded to\r\n          the ground. Ravenna's mother moves forward, ready to attack.\r\n          The Guard holding Ravenna pulls a dagger and puts it to\r\n          Ravenna's throat, which stops her mother.\r\n          Ravenna is dragged away and tossed on the back of a horse --\r\n\r\n                         RAVENNA'S MOTHER\r\n          But be warned Ravenna: By fairest blood\r\n          it is done and only by fairest blood can\r\n          it be undone.\r\n          Ravenna looks back to see her mother and other gypsies put to\r\n          the sword.\r\n          Finn struggles free and chases after the King's men as they\r\n          gallop away.\r\n\r\n                         CUT TO:\r\n          20b EXT. COURTYARD - NIGHT. 20b\r\n          All the wedding guests and nobles stand, held there by guards\r\n          with swords and daggers.\r\n          Ravenna stands at the top of the stairs.\r\n\r\n                         RAVENNA\r\n          So kind of you all to stay over.\r\n\r\n                         GENERAL\r\n          What shall we do with these?\r\n          She eyes the noblemen and guests from left to right. Their\r\n          eyes beg for mercy.\r\n          There is none.\r\n\r\n                         RAVENNA\r\n          To the sword.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            12\r\n          20b CONTINUED: 20b\r\n          There are GASPS and SCREAMS as the Guards move the guests\r\n          away.\r\n          Ravenna notices Finn, off to one side, his dagger at the neck\r\n          of Snow White, who stares defiantly at Ravenna.\r\n\r\n                         RAVENNA\r\n          Finn!\r\n          Finn stops his exit with Snow White, and turns. Ravenna\r\n          stares at the little girl, not sure where she stands with\r\n          this one. And then,...\r\n\r\n                         RAVENNA\r\n          Lock her away. One never knows when royal\r\n          blood may be of value.\r\n\r\n          21 OVER A TIME-LAPSE IMAGE OFA ROTTING RED AND WHITE APPLE. WE 21\r\n\r\n           HEAR ERIC'S VOICEOVER AGAIN --\r\n\r\n           ERIC (V.0.)\r\n          The spell Ravenna's mother placed on her\r\n          gave her the ability to steal youth and\r\n          beauty, and indeed all things good, for\r\n          her own evil purposes. But for every\r\n          life there must be a death, for every\r\n          gain, loss, and under the reign of\r\n          Ravenna nature turned on itself and\r\n          people turned on each other.\r\n\r\n          21A INT. CASTLE - NORTH TOWER - NIGHT. 21A\r\n\r\n\r\n          ERIC V/O\r\n          And all this time, she kept Snow White in\r\n          a cell in the north tower.\r\n          Ravenna, in the shadows, sits perfectly still. Though it's\r\n          been years she looks the same. The object of her gaze is --\r\n          Snow White, who has changed. She is now a woman, lying in a\r\n          darkened cell. Asleep.\r\n          Around the corner, Finn secretly eyes his sister, who doesn't\r\n          notice him.\r\n          Ravenna, just outside the cell, doesn't blink, entranced by\r\n          Snow White. Strange.\r\n          Snow White opens her eyes and sees Ravenna. This is not the\r\n          first time this has happened. Their eyes locked. Then...\r\n\r\n                         SNOW WHITE\r\n          Why?...\r\n          Ravenna doesn't answer, just stands and walks away.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            12A\r\n\r\n          22 EXT. WOODS - DAY. 22\r\n\r\n          A chill wind whips through the woods. Lying sprawled on the\r\n          ground we see a man (ERIC) who looks like he's dead.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            13\r\n\r\n                         22 CONTINUED: 22\r\n          It's only as we move closer to his rugged face that we see the\r\n          empty FLAGON OF GROG by his side and realize he's drunk. His\r\n          eyes flicker, as a WOMAN'S SCREAM cuts through the woods.\r\n\r\n                         FLASH TO:\r\n\r\n          THE SPECTRE OF A WOMAN\r\n          SARA, beautiful, in pain. A patch of blood blossoms on her\r\n          dress. Her mouth is open, screaming but no sound comes out.\r\n\r\n          BACK TO SCENE - WE HEAR THE SCREAM\r\n          Eric's eyes flicker and begin to open -- then he hears it\r\n          again.\r\n\r\n          ROSE (O.S.)\r\n          Help!!!!\r\n          He rises to his feet unsteadily, his head pounding from a\r\n          hangover, then grabs two THROWING HATCHETS and slides them into\r\n          his harness on his back --\r\n\r\n          23-240MITTED 23-24\r\n\r\n          25 EXT. FOREST - DAY. 25\r\n\r\n          Eric runs past trees and ducks under branches, crashing into a\r\n          few, still drunk. As he arrives at a clearing he sees a\r\n          beautiful girl, (ROSE), fighting off a HUGE TATTOOED WARRIOR,\r\n\r\n          (BROCH).\r\n\r\n                         ERIC\r\n          Lay a hand on her and I'll take your head!\r\n          BROCH turns and sees the huntsman with his hatchet raised.\r\n\r\n                         BROCH\r\n          Ale given you courage again, huntsman?\r\n\r\n                         ERIC\r\n          Won't take much courage to split your skull\r\n          from here.\r\n\r\n                         BROCH\r\n          Aye, but first you'd have to see straight.\r\n          Broch advances with a grin, drawing his own axe. Trying to clear\r\n          his vision and steady his aim, Eric hurls the hatchet -- and\r\n          MISSES, the blade sticking in the tree above the frightened\r\n          Greta's head --\r\n          Broch is on Eric in an instant, swinging his huge battle axe.\r\n          Eric narrowly avoids the deadly blows, his natural skill and\r\n          dexterity slowed down by all the ale he's drunk.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            13A\r\n\r\n                         25 CONTINUED: 25\r\n          Rose looks on, terrified, as Broch drives Eric towards the\r\n          trees. He corners him against an oak and swings his axe -- only\r\n          for Eric to duck at the last moment --\r\n          The blade buries itself deep in the tree, stuck. We realize now\r\n          from Eric's dark smile that he lured Broch into the trap. He\r\n          draws his second hatchet, but instead of using the blade, cracks\r\n          Broch over the head with the handle, knocking him out.\r\n          Rose looks on in admiration as the huntsman goes through Broch's\r\n          pockets.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            14\r\n\r\n                         25 CONTINUED: (2) 25\r\n\r\n                         ROSE\r\n          Thank you.\r\n          Eric turns. Rose sees how handsome he is. Eric stares at her\r\n          thoughtfully then approaches and gently lifts her chin,\r\n          examining her pretty features. Rose doesn't seem to mind,\r\n          looking back with an inviting smile.\r\n\r\n                         ROSE\r\n          I don't know how to repay you?\r\n          Eric stares at her a moment, then suddenly picks her up and\r\n          tosses her over his shoulders.\r\n\r\n                         ERIC\r\n          Don't worry, somebody else will.\r\n\r\n                         26 OMITTED 26\r\n\r\n          27 EXT. VILLAGE - DAY. 27\r\n\r\n          And now we see a RICKETY PRISON WAGON full of BEAUTIFUL GIRLS,\r\n          just like Rose, staring out furiously from behind bars. Eric and\r\n          a SLAVE MERCHANT haggle over Rose who is bound and gagged,\r\n          looking just as furious as the other women.\r\n\r\n                         SLAVE MERCHANT\r\n          Her nose is on the large size and her\r\n          chin's a little weak.\r\n\r\n                         ERIC\r\n          Your eyes are dim.\r\n\r\n                         SLAVE MERCHANT\r\n          I'll give you two gold pieces.\r\n\r\n                         ERIC\r\n          After all the business we've done\r\n          together?\r\n          Rose curses behind her gag as Eric pulls her away.\r\n\r\n                         SLAVE MERCHANT\r\n          Four gold pieces and that's my final offer!\r\n          Eric doesn't even bother to turn around.\r\n\r\n                         ERIC\r\n          I'll peddle my wares elsewhere, thank\r\n          you.\r\n          The slave merchant sees his prize disappearing and calls out:\r\n\r\n                         SLAVE MERCHANT\r\n          Ten gold pieces!\r\n          Eric hesitates, but it's not from a guilty conscience, he's just\r\n          considering the price. Then he smiles, turns. They have a deal.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           14A\r\n\r\n          28 INT. PRISON TOWER/ SNOW WHITE'S CELL - DAY. 28\r\n\r\n          We get our first good look at grown Snow White as she shaves\r\n          wood for a fire. She's done this every day for years. A\r\n          regimen. Her hands work precisely as she stacks the wood and\r\n          blows on the kindling.\r\n\r\n                         29 OMITTED 29\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           15\r\n          29a OMITTED 29a\r\n\r\n          30 INT. PRISON TOWER/ SNOW WHITE'S CELL - DAY. 30\r\n\r\n          The fire is now burning and Snow White warms her hands on it.\r\n          She hears APPROACHING FOOTSTEPS. Unusual. She jumps up gets\r\n          in her bed and pretends to sleep.\r\n          A GUARD opens a cell opposite Snow White. A few seconds\r\n          later the door CLANGS SHUT.\r\n          As soon as the Guard is gone, Snow White rises, walks to her\r\n          cell door and looks down the hall to the other cell.\r\n\r\n                         SNOW WHITE\r\n          Hello?... What's your name?\r\n          Rose, sitting in a dark corner, goes to her cell bars and\r\n          looks out.\r\n\r\n                         ROSE\r\n          I am Rose.\r\n          Snow White smiles - a friendly face.\r\n\r\n          31 INT. QUEEN'S BATHING ROOM - DAY. 31\r\n\r\n          Ravenna stands, attended by MAIDS, in a black gown, open in\r\n          front. Appropriate in private but not when --\r\n          Ravenna's GENERALS and Finn stand across from her. The\r\n          Generals avert their eyes, made uncomfortable by her near\r\n          nakedness.\r\n          The General uses a pointer to make his presentation while\r\n          another holds a map.\r\n\r\n          BLACK KNIGHT GENERAL\r\n          There are scattered rebel groups on the\r\n          fringe of the dark forest, but they cause\r\n          little harm.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            16\r\n\r\n                         31 CONTINUED: 31\r\n          She dips her fingers into a bowl of DEAD SONGBIRDS, plucks\r\n          out a tiny heart and eats it as she listens, not happy.\r\n\r\n                         RAVENNA\r\n          And what of the Duke?\r\n\r\n          BLACK KNIGHT GENERAL\r\n          We have pushed his forces into the\r\n          mountains but his stronghold at Carmath \r\n          holds firm.\r\n\r\n                         RAVENNA\r\n          Lay siege to it.\r\n\r\n                         ANOTHER GENERAL\r\n          The mountains and fortress provide\r\n          impenetrable protection, my Queen.\r\n\r\n                         RAVENNA\r\n          Then lure him out! Burn every village\r\n          that supports him. Poison their wells.\r\n          If they still resist put their heads on\r\n          pikes to decorate the roads!\r\n\r\n          BLACK KNIGHT GENERAL\r\n          My Queen.\r\n          (chooses words carefully)\r\n          They have taken the fight to us. Rebels\r\n          harry our supply lines and rob our pay\r\n          wagons. \r\n\r\n                         ANOTHER GENERAL\r\n          We have just captured two of the rebel\r\n          leaders. They will be put to the sword.\r\n\r\n                         RAVENNA\r\n          I wish to interrogate them myself.\r\n          She drops her robe and walks up the steps to her bath. She\r\n          lowers herself into the white liquid. Her face disappears\r\n          beneath the viscous liquid, then she rises, like a porcelain\r\n          statue.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            17\r\n          31a INT. BATHING CHAMBER - MOMENTS LATER 31a\r\n           ECU - A small songbird, it's chest open, revealing a small\r\n           heart. Ravenna's claw plucks the tiny heart and we follow it\r\n           to her mouth.\r\n           She is dressed now and stands at a window, Finn at her side. \r\n           OUTSIDE THE WINDOW - A CROWD OF STARVING PEASANTS at the foot \r\n           of the castle, fight over the milk pouring from her bath. \r\n\r\n                         RAVENNA\r\n\r\n                         (TO HERSELF)\r\n          I won't go back.\r\n          She is lost for a moment, then...\r\n\r\n                         RAVENNA\r\n          Finn, do you remember when we were\r\n          children, begging for scraps like those\r\n          wretches?\r\n\r\n                         FINN\r\n          Yes, my Queen.\r\n\r\n                         RAVENNA\r\n          Am I not kinder?\r\n\r\n                          \r\n\r\n          32 INT. PRISON TOWER/ SNOW WHITE'S CELL - DAY. 32\r\n\r\n          Rose and Snow White converse...\r\n\r\n                         ROSE\r\n          All the girls in our village were taken.\r\n          I was trying to reach safe haven at Duke\r\n          Hammond's castle when I was caught --\r\n          Snow White bursts with hope --\r\n\r\n                         SNOW WHITE\r\n          The Duke?! He's alive?! He still fights\r\n          in my father's name?!\r\n          Rose stares at the feral girl now, realizing who she is.\r\n\r\n                         ROSE\r\n          You're the king's daughter? Princess?...\r\n          The night the evil one's reign began we\r\n          were told all in the castle were put to\r\n          the sword. How were you spared?\r\n\r\n                         SNOW WHITE\r\n          William? What about William?!\r\n          The Duke's son?! Is he alive?!\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            17A\r\n\r\n                         32 CONTINUED: 32\r\n\r\n                         ROSE\r\n          I don't know, princess.\r\n          Rose shakes her head, still gazing at Snow White, then hears\r\n          the distant cries of other female prisoners.\r\n\r\n                         ROSE\r\n          What will they do to me?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           18\r\n\r\n          33 INT. THRONE ROOM - DAY 33\r\n\r\n          Ravenna sweeps into the great hall.\r\n          The Generals and Finn snap to attention. She stops and stares\r\n          at TWO MEN, the captured insurgents.\r\n          THOMAS, a grizzled old rebel, looks badly bruised and beaten,\r\n          while his handsome son, LAIN, is unmarked. They both stare at\r\n          her defiantly.\r\n          Ravenna faces the two rebels. A SOLDIER steps forward.\r\n\r\n                         SOLDIER\r\n          My Queen, these two were captured leading\r\n          an ambush of our supply caravan.\r\n          Ravenna seems intrigued, steps forward, eyeing them.\r\n\r\n                         RAVENNA\r\n          You left your home, your family, the bosom\r\n          of my protection, to aid my enemies? Why?\r\n\r\n                         THOMAS\r\n          Because under your rule we have lost\r\n          everything. We will not stop until this\r\n          kingdom is free.\r\n\r\n                         RAVENNA\r\n          Lost everything?\r\n\r\n                         (REGARDS IAIN)\r\n          Your son?\r\n          She moves to Iain, right up to his face.\r\n\r\n                         RAVENNA\r\n          Very handsome.\r\n\r\n                         (TO THOMAS)\r\n          Obviously a debt owed to your wife.\r\n          She reaches out and touches Iain's strong jaw. He struggles\r\n          against the Guards that hold him back.\r\n\r\n                         RAVENNA\r\n          There was a time I would have lost my heart\r\n          to a face like yours -- and you would have\r\n          no doubt broken mine.\r\n          In a flash Iain grabs a Guard's dagger and rams it into\r\n          Ravenna's chest. She makes a pained face, looks down at the\r\n          dagger, then up to Iain.\r\n\r\n                         RAVENNA\r\n          You would kill your Queen?\r\n          She pulls the dagger out - there is no\"wound, no blood - and\r\n          drops it on the ground. Iain and Thomas are shocked.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            19\r\n\r\n                         33 CONTINUED: 33\r\n\r\n                         RAVENNA\r\n          (admiring; to Iain)\r\n          You have beauty. And courage. But how\r\n          strong is your heart?\r\n          She smiles, almost regrettably, then places her hand on his\r\n          chest. We hear HIS HEART START TO HAMMER -- LOUDER AND LOUDER.\r\n          He grimaces in pain as she SQUEEZES -- the hammering filling his\r\n          ears -- until his heart finally bursts and he drops dead.\r\n          Thomas falls to his knees in horror, trying to revive his son.\r\n          Finn draws his sword to behead him when Ravenna raises her hand.\r\n\r\n                         RAVENNA\r\n          No. Let him return to the Duke and speak of\r\n          the generosity of his Queen.\r\n          With that she sweeps out, followed by Finn. It's only now that\r\n          we see the lines on her face. Finn takes her by the arm as she\r\n          falters.\r\n\r\n                         FINN\r\n          Are you alright?\r\n          Ravenna pulls her arm away furiously. The General and the\r\n          others stare, alarmed.\r\n\r\n                         RAVENNA\r\n\r\n                         (TO ALL)\r\n\r\n          OUT!!!!!\r\n          They quickly exit, all save Finn, who watches, concerned, as\r\n          Ravenna leans against the wall for support. She pulls\r\n          herself together, looks at Finn.\r\n\r\n                         FINN\r\n          Magic comes at a lofty price.\r\n\r\n                         RAVENNA\r\n          And the expense grows.\r\n\r\n                         FINN\r\n          You look...\r\n\r\n                         RAVENNA\r\n          old?...\r\n\r\n                         FINN\r\n          Tired.\r\n\r\n                         RAVENNA\r\n          My powers... fade.\r\n          This is about as much as Ravenna can confess. Finn watches\r\n          as she walks up the stairs to the mirror chamber. Then he\r\n          turns and CLAPS HIS HANDS TWICE. A GUARD appears and Finn\r\n          nods.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            20\r\n          33a INT. MIRROR CHAMBER - ROYAL PALACE 33a\r\n          Ravenna walks into the room. Eyes the mirror, afraid to look\r\n          at herself.\r\n\r\n          FINN (O.S.)\r\n          I have something for what ails you.\r\n          She turns to see --\r\n          Finn, with Rose. Ravenna almost smiles.\r\n          Rose holds her gaze defiantly. Ravenna walks over, admires\r\n          her face, smiles, then takes her by the throat and --\r\n          LIFTS HER OFF HER FEET. Rose opens her mouth to scream but\r\n          instead of sound, ENERGY pours out. Ravenna opens her mouth,\r\n          DEVOURING GRETA'S YOUTH AND BEAUTY. Like a flower blooming,\r\n          her lines vanish. Like a flower wilting, Rose AGES until\r\n          she's as old as the scullery maids.\r\n\r\n          34 INT. PRISON TOWER/ SNOW WHITE'S CELL 34\r\n\r\n          Snow White hears approaching footsteps and watches as a Guard\r\n          opens Greta's cell and tosses someone in.\r\n\r\n                         SNOW WHITE\r\n          Rose?...\r\n          The Guard clangs the cell door shut and walks away.\r\n          Snow White peers through the shadows. Can't quite make her\r\n          out.\r\n\r\n                         SNOW WHITE\r\n          Rose?...\r\n\r\n                         DISSOLVE TO:\r\n\r\n          35 INT. MIRROR CHAMBER - DAY. 35\r\n\r\n          RAVENNA stares into her mirror now, rejuvenated.\r\n\r\n                         RAVENNA\r\n          Mirror, mirror, on the wall,\r\n          Who is the fairest of them all?\r\n          The bronze ripples. The Mirror Man pours out and reforms.\r\n\r\n                         MIRROR MAN\r\n          My Queen, you have defied nature and\r\n          robbed it of its fairest fruit. But on\r\n          this day there is one more beautiful than\r\n          you.\r\n\r\n                         RAVENNA\r\n          More beautiful, but --\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            20A\r\n\r\n                         35 CONTINUED: 35\r\n\r\n                         MIRROR MAN\r\n          She is the reason your powers wane.\r\n\r\n                         RAVENNA\r\n          She won't live to see tomorrow. Who is\r\n          it?! Give me her name?!\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            21\r\n\r\n                         35 CONTINUED: (2) 35\r\n\r\n                         MIRROR MAN\r\n          Snow White.\r\n          Ravenna is shocked by this, staggers a bit.\r\n\r\n                         RAVENNA\r\n          Snow White?\r\n\r\n                         (CALLS OUT)\r\n          Finn'.'.\r\n          (back to mirror)\r\n          I should have killed her as a child. She\r\n          is my undoing?\r\n\r\n                         MIRROR MAN\r\n          She is also your treasure, Queen. It was\r\n          wise to have kept her close for the\r\n          innocence and purity that can destroy can\r\n          also heal. Hold her heart in your hands\r\n          and you shall never again need to consume\r\n          youth. You shall never again weaken or\r\n          age. Immortality without cost!\r\n          Ravenna laughs, overjoyed.\r\n          Finn appears out of the shadows. All he sees is his sister\r\n          laughing, giddily into her mirror, no sign of the mirror man,\r\n          as if it exists only in her head.\r\n\r\n                         FINN\r\n          Yes, Queen?...\r\n\r\n          36-37OMITTED 36-37\r\n\r\n          38 INT. PRISON TOWER/ SNOW WHITE'S CELL - DAY. 38\r\n\r\n          Snow White paces in her cell, frantic.\r\n          Two magpies appear in the window. She looks at them and\r\n          watches as they flap their wings. Like they're trying to\r\n          tell her something. She moves toward them.\r\n          They jump back and up to the edge of the roof that is beside\r\n          the cell window, hovering there.\r\n          She is confused but notices --\r\n          A roofing nail, right where the Magpies hover.\r\n          Snow White reaches a hand out the window and touches the\r\n          loose nail. Her fingers move it back and forth as it, bit by\r\n          bit, breaks free.\r\n          She yanks hard.at the nail, almost has it when --\r\n          The Magpies flutter again and blast away, as if afraid --\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            22\r\n\r\n                         38 CONTINUED: 38\r\n          Snow White hears FOOTSTEPS down the hall.\r\n          She steadies herself, yanks once, twice and the nail comes\r\n          loose.\r\n          she jumps down, lies in her bed again just as --\r\n          Finn unlocks her door, leaving the key in the lock, and walks\r\n          into the cell. He stands there until she turns her head\r\n          slightly to him.\r\n          She doesn't move, grips the nail in her closed hand as she\r\n          tries to lure him closer with her eyes.\r\n\r\n                         FINN\r\n          Did I wake you?\r\n          Snow White shakes her head gently.\r\n\r\n                         FINN\r\n          Are you always awake when I watch you?\r\n\r\n                         SNOW WHITE\r\n\r\n                         (HOARSELY)\r\n          Yes.\r\n          She looks away.\r\n\r\n                         SNOW WHITE\r\n          You've never come in before.\r\n\r\n                         FINN\r\n          My Queen won't allow it. She wants you\r\n          all to herself.\r\n\r\n                         SNOW WHITE\r\n          I'm afraid of her.\r\n\r\n                         FINN\r\n          Not of me.\r\n\r\n                         SNOW WHITE\r\n          No.\r\n          He can't help himself, reaches out and touches her arm.\r\n\r\n                         FINN\r\n          It's alright, princess. You will never\r\n          again be locked in a cell.\r\n\r\n                         SNOW WHITE\r\n          What does she want from me?\r\n          His finger move from her hair to her cheek, stroking it\r\n          gently, and then to her chest. With his free hand he reaches\r\n          back for his dagger.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            22A\r\n\r\n                         38 CONTINUED: (2) 38\r\n\r\n                         FINN\r\n          Your beating heart.\r\n          Snow White grips the roofing nail even tighter as she looks\r\n          at him. As he leans closer, she notices his off hand - the\r\n          dagger and --\r\n          She SLASHES him across the face with the nail. Blood flies.\r\n          Finn reacts, grabs his face in pain, yells and Snow White\r\n          kicks him and runs for the door, locking it behind --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           23\r\n\r\n          39 INT. GRETA'S CELL/ TOWER STEPS - DAY. 39\r\n\r\n          Snow White hurtles down the steps to Greta's cell. She is\r\n          shocked by what she sees. Rose, now an old woman, looks to her.\r\n          Snow White fumbles with the keys. Rose holds out both her\r\n          hands. Snow White takes them, looks into her eyes.\r\n\r\n                         ROSE\r\n          Go.\r\n          Finn stumbles to the cell door, clutching his face.\r\n\r\n                         FINN\r\n\r\n          GUARDS!\r\n          Snow White tosses the keys into an empty cell and races away.\r\n\r\n          40 INT. CORRIDOR/ CASTLE - DAY. 40\r\n\r\n          Snow White runs down the steps into a corridor and sees ARMED\r\n          GUARDS appear at the other end. She hurries into another tower,\r\n          bolting the door shut behind her, and charges down the steps.\r\n\r\n          41 EXT. COURTYARD/ CASTLE - DAY. 41\r\n\r\n          SNOW WHITE BURSTS OUTSIDE -- into the light. She almost\r\n          hyperventilates at all the air, the sky. Then she runs through\r\n          the courtyard toward the portcullis.\r\n          The magpies fly right into her face then away, telling her to\r\n          follow. She does and heads straight for the small opening at\r\n          the base of the castle wall - the entrance to the SEWERS.\r\n          As the magpies rise, she slides on one hip, plunging into the\r\n          darkness below. The guards follow but can't squeeze through\r\n          the opening, running towards the Portcullis instead.\r\n\r\n          42 INT. SEWER - DAY. 42\r\n\r\n           Snow White splashes through the deep stinking sludge.\r\n\r\n          43 EXT. PORTCULLIS - DAY. 43\r\n\r\n           The old rebel, Thomas, with his son's body draped over a mule,\r\n          looks back curiously as he hears the guards yelling --\r\n\r\n          CHIEF GUARD 0/S\r\n          Open the gates! The Princess has escaped!\r\n          He stares in surprise as riders gallop out.\r\n\r\n          44 EXT. SEA - OUTSIDE CASTLE - DAY. 44\r\n\r\n          Snow White is swept out of the sewers into the sea. Seaweed\r\n          wraps itself around her limbs, pulling her deeper.into the\r\n          depths, but she kicks and fights her way back to the surface --\r\n          gasping for air.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           24\r\n\r\n          45 EXT. BEACH -- OUTSIDE CASTLE - DAY. 45\r\n\r\n          Snow White swims ashore. She looks up and sees a maze of large\r\n          rocks stretching out. She sets off in one direction when the two\r\n          MAGPIES reappear, urging her to follow them in another\r\n          direction. She scrambles after them and sees a WHITE MARE\r\n          waiting for her on the beach, lying on its side, allowing her to\r\n          climb on. The mare raises itself and is away in a flash.\r\n\r\n          46 EXT. BEACH - DAY. 46\r\n\r\n          Galloping hooves skim the surf, RIDERS pursuing Snow White.\r\n\r\n          47 EXT. DECIMATED VILLAGE - DAY. 47\r\n\r\n          Snow White rides towards the village -- only it's unrecognizable\r\n          now -- most of the cottages have been razed to the ground or\r\n          boarded up.\r\n          A group of people including children - skeletal, hungry,\r\n          desperate - see her approach and move out to greet her.\r\n          She stops her horse for a moment, gazing past tears at the\r\n          devastation and the state of villagers all around her.\r\n          At first their approach seems harmless but as they get closer\r\n          their faces reveal dangerous desperation and --\r\n          She gallops off, looking back to see the Queen's men giving\r\n          chase.\r\n\r\n          48 EXT. FIELDS AND WOODLAND BEYOND THE VILLAGE - DAY. 48\r\n\r\n          The fields and woods are even more devastated than the village.\r\n          Farmland has been burnt to cinders and trees chopped down. All\r\n          around Snow White the world is stubble and ash.\r\n\r\n          49 EXT. ENDLESS MOOR - AERIAL SHOT - DAY. 49\r\n\r\n          Snow White crests a hill, her mare rearing as she sees -- THE\r\n          DARK FOREST -- A VAST WALL OF PRIMORDIAL TREES. A mist seeps\r\n          from the forest like an evil miasma. Snow white hesitates --\r\n          then sees the riders closing in and urges her mare on --\r\n\r\n          50 EXT. MISTY BOGS/ ENTRANCE TO THE DARK FOREST - DAY. 50\r\n\r\n          Shadows everywhere. The mare charges into the misty bog then\r\n          suddenly loses her footing. She rears -- throwing Snow White\r\n          onto the safety of solid ground.\r\n          Snow White tries to grab her reins but the horse pulls away, not\r\n          wanting to endanger her life. She tries again but the horse\r\n          backs farther away from her. Slowly they're separated by the\r\n          swirling fog --\r\n          As Snow White sees the silhouettes of the riders reappear.\r\n          Reluctantly she turns and runs into the forest --\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            25\r\n\r\n                         50 CONTINUED: 50\r\n          The riders are about to follow when their horses rear and kick\r\n          in terror. One guard is thrown off and sucked down in the bog,\r\n          frightening off the others.\r\n          Despite their concern for Snow White, the MAGPIES are also too\r\n          afraid to enter the forest.\r\n\r\n          51 EXT. DARK FOREST - DAY. 51\r\n\r\n          Snow White hurtles through the trees, a ghostly fog rising up\r\n          all around her, then trips over a root, landing face first in --\r\n          A patch of LARGE MUSHROOMS that unleash CLOUDS OF POLLEN. She\r\n          coughs, trying to fan the pollen away, but it's too late. She\r\n          hurries on, but the hallucinations come thick and fast now --\r\n          The trees look almost human, hooded figures peering at her\r\n          through the haze. She sees owls without eyes. Black oil oozing\r\n          out of tree trunks. A hanging vine reaches down and touches her\r\n          like a hand and now she runs --\r\n          More terrors rage at her from the swirling mist. She stumbles\r\n          again and when she looks up vampire bats scream at her from the\r\n          trees. Huge skeletal forms crack out of the bark, descending on\r\n          her until she finally passes out.\r\n\r\n          52 EXT. AERIAL VIEW OF DARK FOREST -- DAY.(D4N) 52\r\n\r\n          From high above, we see the unconscious Snow White as mist\r\n          whirls in a circle.\r\n          52a EXT. CASTLE BEACH - NIGHT.(D4N) 52a\r\n          Vicious waves crash into rocks. Nature's anger on display.\r\n\r\n          53 INT. MIRROR CHAMBER - NIGHT. 53\r\n\r\n          From above we see Ravenna striding furiously in a circle of\r\n          her own. She is livid, a whirling dervish.\r\n          She's fairly spitting as she barks at Finn, who stands in the\r\n          middle of the room, his face bleeding.\r\n\r\n                         RAVENNA\r\n          How is it an innocent young girl makes a\r\n          fool of my brother?! Armed only with a\r\n          nail?! If she'd had a sword she'd have\r\n          taken the whole castle!\r\n          We're in front of her, behind her, on her face, on her feet --\r\n          She picks up the pace as well as the volume --\r\n\r\n                         RAVENNA\r\n          You swore to protect me! Do you not\r\n          understand what, the girl means to us?!\r\n          This is my future! This is everything.\r\n          Everything!\r\n\r\n          (MORE)â\u0080\u009e\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            25A\r\n\r\n                         53 CONTINUED: 53\r\n\r\n                          RAVENNA (CONT'D)\r\n          There is no one I can trust in this\r\n          place!! There is no loyalty! None!!!!\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            26\r\n\r\n                         53 CONTINUED: (2) 53\r\n          And then she stops on a dime, turns to him, marches right up to\r\n          Finn and --\r\n          BELTS HIM! Hard. He staggers a bit then picks himself up,\r\n          looks at her.\r\n\r\n                         FINN\r\n          She was chased into the dark forest.\r\n          She's likely already dead.\r\n          She SCREAMS and slaps him viciously.\r\n\r\n                         RAVENNA\r\n          She's no good to me there, lost. I must\r\n          have her heart! You have failed me!\r\n          Finn's had enough, he erupts at her --\r\n\r\n                         FINN\r\n          Have I not given all to you?!\r\n          She takes this, softens, unexpectedly, and almost smiles.\r\n\r\n                         RAVENNA\r\n          Have I not given you all? All.\r\n          She raises her finger and touches his face. His wound heals\r\n          instantly and his face grows calm. He nods.\r\n\r\n                         FINN\r\n          Indeed, my Queen.\r\n\r\n                         RAVENNA\r\n          Don't fail me again, Finn.\r\n\r\n                         (BEAT)\r\n          I have no powers in the Dark Forest. Bring\r\n          me someone who knows it well. Someone who\r\n          can hunt her!\r\n\r\n                         CUT TO:\r\n          53a OMITTED 53a\r\n\r\n          54 EXT. VILLAGE - DAY. 54\r\n\r\n          Finn speaks to a group of people assembled by his men.\r\n\r\n                         FINN\r\n          The Queen demands the services of someone\r\n          to navigate the Dark Forest.\r\n          The villagers stay mum, shaking their heads.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            26A\r\n\r\n                         54 CONTINUED: 54\r\n\r\n                         OLD LADY\r\n          No-one goes into the Dark Forest.\r\n\r\n                         FINN\r\n          You will be compensated.\r\n          Still no takers. An OLD-TIMER stares right at FINN, steps\r\n          forwards.\r\n\r\n                         OLD-TIMER\r\n          There's one man. A widower.\r\n\r\n                         FINN\r\n          Where might I find him.\r\n\r\n                         OLD-TIMER\r\n          In the Inn. Drinking.\r\n          THE SOUND OF SMASHING WOOD. They turn to see --\r\n          Eric flies through the Inn's wall and lands in a heap on the\r\n          ground.\r\n\r\n                         OLD-TIMER\r\n          Appears he's finished.\r\n\r\n          55 EXT. INN - SAME - DAY. 55\r\n\r\n          Eric. Drunk. He tries to focus as Broch strides through the\r\n          same hole and stands over him.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            27\r\n\r\n                         55 CONTINUED: 55\r\n\r\n                         BROCH\r\n          You owe me money from my pocket and money\r\n          for the girl!\r\n\r\n                         ERIC\r\n          I have it right here in my pocket. If\r\n          you'll just help me up.\r\n          Eric holds his hand out. Broch walks over, suspicious. When\r\n          he's close, Eric grabs his arm and kicks with both feet in\r\n          Broch's chest. Broch flies back, then strides to Eric and\r\n          kicks him in the side. Hurts.\r\n\r\n                         BROCH\r\n          I want my money!\r\n\r\n                         ERIC\r\n          Actually, I seem to have drunk it all.\r\n          You're welcome to it when it comes out\r\n          again.\r\n          Broch hauls him back up to his feet. He takes a swing but\r\n          somehow the drunken Eric dodges the blow, swinging back at\r\n          him.\r\n          Everyone has come out of the Inn to enjoy the fight.\r\n          Eric lands a body blow to Broch, who doubles over. Eric\r\n          comes in for the kill, winds up and swings -\r\n          Missing Broch but hitting a HORSE on the ass. It kicks its\r\n          legs, sending him flying. He lands in a heap and drops his\r\n          head back.\r\n          Hands lift him and --\r\n          Drop him in a horse trough. He's underwater for a few\r\n          seconds before he comes to and lifts out his head, eyes still\r\n          closed.\r\n\r\n                         ERIC\r\n\r\n                         (MUMBLING DRUNKENLY)\r\n          Perfume?\r\n          He opens his eyes to see Finn gazing down at him.\r\n\r\n                         ERIC\r\n          Royalty. That explains it.\r\n\r\n                         FINN\r\n          The Queen demands your presence.\r\n\r\n                         ERIC\r\n          Can't you see I'm having a bath?\r\n\r\n                         56 OMITTED 56\r\n\r\n                         57 MOVED TO 55 57\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            27A\r\n\r\n          58 INT. THRONE ROOM - CASTLE - DAY. 58\r\n\r\n          RAVENS perch on the ledges and LURCHERS scamper about.\r\n          Eric, still drunk, filthy, damp clothes, face bruised, enters\r\n          the room, eyes the ravens, then looks at --\r\n          Ravenna on her throne. She watches him curiously. He's more\r\n          interested in the aged scullery maids, including Rose, who are\r\n          staring at him accusingly. He has no idea who they are or what\r\n          he's done wrong. Finally he comes before the Queen, sizing her\r\n          up like a tavern beauty.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            28\r\n\r\n                         58 CONTINUED: 58\r\n\r\n                         RAVENNA\r\n          My brother tells me you are a widower, a\r\n          drunkard and one of few who has ventured\r\n          into the dark forest.\r\n          Finn looks on, standing nearby.\r\n\r\n                         RAVENNA\r\n          One of my prisoners has escaped there.\r\n\r\n                         ERIC\r\n          Then he's dead -\r\n\r\n                         RAVENNA\r\n          She.\r\n          She shoots Finn a pointed look then looks back at Eric.\r\n\r\n                         ERIC\r\n          Then she is certainly dead.\r\n\r\n                         RAVENNA\r\n          Find her. Bring her to me.\r\n          Eric holds her gaze, uneasy at the request.\r\n\r\n                         ERIC\r\n          I've been to the Dark Forest enough times\r\n          to know I'm not going back.\r\n\r\n                         RAVENNA\r\n          You will be rewarded handsomely.\r\n\r\n                         ERIC\r\n          Coin's no good to me if I'm lying dead\r\n          with crows picking at my eyes.\r\n          Ravenna steps off her throne now, approaching him.\r\n\r\n                         RAVENNA\r\n          There may be more than gold in the\r\n          offing.\r\n\r\n                         ERIC\r\n          Why is her life of such value?\r\n\r\n                         RAVENNA\r\n          That is none of your concern.\r\n\r\n                         ERIC\r\n          I'll determine what concerns me, thank\r\n          you.\r\n          She smiles, moves even closer to him.\r\n\r\n                         RAVENNA\r\n          You will do this for me, Huntsman.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            28A\r\n\r\n                         58 CONTINUED: (2) 58\r\n\r\n                         ERIC\r\n          And if I refuse?\r\n          Ravenna nods to the Guards, who pull their swords. Dying to\r\n          cut him to pieces. Eric eyes them, then looks to her and, in\r\n          complete honesty --\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            29\r\n\r\n                         58 CONTINUED: (3) 58\r\n\r\n                         ERIC\r\n          Do me the favor. I beg of you.\r\n\r\n                         RAVENNA\r\n          So you wish to be reunited with your\r\n          beloved?\r\n          Eric reacts instinctively, grabbing her by the throat. The\r\n          courtiers rise to their feet and the guards draw their\r\n          swords, but Ravenna holds up her hand.\r\n\r\n                         ERIC\r\n          My wife is none of your concern.\r\n          Something about her face, the fact that she enjoys his hand\r\n          on her throat makes Eric queasy. He releases his grip,\r\n          stares right at Ravenna.\r\n\r\n                         RAVENNA\r\n          My condolences.\r\n          Ravenna holds his gaze.\r\n\r\n                         RAVENNA\r\n          You miss her?\r\n          His eyes say, yes, he misses her horribly.\r\n\r\n                         RAVENNA\r\n          What would you give to bring her back?\r\n          Eric stares at her curiously.\r\n\r\n                         RAVENNA\r\n          You know of my powers. Bring me the girl\r\n          and I will bring back your wife.\r\n\r\n                         ERIC\r\n          Nothing will bring her back.\r\n          Ravenna moves even closer, looks him right in the eye. She\r\n          is incredibly persuasive as she says --\r\n\r\n                         RAVENNA\r\n          I can. Believe me, huntsman.\r\n          Eric's eyes say he wants to believe. Needs to believe.\r\n\r\n                         RAVENNA\r\n          A life for a life.\r\n\r\n          59 EXT. MOORS/ OUTSIDE DARK FOREST - DAY. 59\r\n\r\n          Mist drifts across the moors, the primordial trees looming up\r\n          ahead. Finn and Eric ride side by side, FOUR GUARDS following.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            30\r\n\r\n                         59 CONTINUED: 59\r\n\r\n                         FINN\r\n          You fought in the west? Against the armies\r\n          of the five kings?\r\n          Eric nods without looking at him, gazing at the forest.\r\n\r\n                         FINN\r\n          You must have seen a great deal of death?\r\n\r\n                         ERIC\r\n          Death is everywhere.\r\n\r\n                         FINN\r\n          Come now, you're being modest. There is a\r\n          difference between gutting a deer and\r\n          gutting a man. How many did you kill?\r\n\r\n                         ERIC\r\n          It's not something I counted.\r\n\r\n                         FINN\r\n          (with a smile)\r\n          Nor I. But I recall every face. There is\r\n          no greater delight than battle.\r\n          Eric finds this unseemly, but prefers not to engage.\r\n\r\n                         FINN\r\n          Come now, huntsman, what do you feel when\r\n          you watch a man die? Delight?\r\n          Invincibility?\r\n\r\n                         ERIC\r\n\r\n                         (HONESTLY)\r\n          Sorrow.\r\n          This takes Finn aback, not an answer he was expecting. After\r\n          a beat...\r\n\r\n                         FINN\r\n          And what of them? At the tip of your\r\n          sword. What do they feel? I'd enjoy\r\n          knowing.\r\n          Eric looks at him, realizing from Finn's face that it is an\r\n          honest question. -\r\n\r\n                         FINN\r\n          The.only difference between you and I is\r\n          I'-never found a wife to save my soul.\r\n\r\n                         ERIC\r\n          Too bad. You'll need one.\r\n          He stops his horse and nods.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            31\r\n\r\n                         59 CONTINUED: (2) 59\r\n          They are all stopped at the entrance to the Dark Forest fifty\r\n          meters ahead. The Guards gulp back their fears. Finn tries\r\n          to hide his own.\r\n          Even the horses sense danger and start to whinny and back up.\r\n\r\n          60 EXT. DARK FOREST - DAY. 60\r\n\r\n          Vines and roots have grown over Snow White's body, as if the\r\n          forest is trying to devour her. She opens her eyes, sees her\r\n          wrists and ankles bound and reacts in horror, struggling to free\r\n          herself of her bonds.\r\n          WE PULL UP, UP, UP until we can see the full scope of the\r\n          Dark Forest.\r\n\r\n          61 EXT. BOGS/ DARK FOREST - DAY. 61\r\n\r\n          Eric and Finn have tethered their nervous horses and stand at\r\n          the entrance to the bog.\r\n\r\n                         ERIC\r\n          Do exactly as I do.\r\n          Eric carefully places one foot after the next on grassy stepping\r\n          stones that disappear into the bog as soon as his full weight is\r\n          on them. The others catch on and follow, stepping on stones of\r\n          their own.\r\n          Once they're across the bog and onto dry land Finn takes a\r\n          step forward but Eric grabs his arm.\r\n\r\n                         ERIC\r\n          Exactly as I do.\r\n          Eric puts a cloth to his face, gesturing for Finn and his guards\r\n          to do the same and moves forward through the mushroom field -\r\n          pops of pollen misting all around them.\r\n          Eric stops, bends down, spotting faint FOOTPRINTS in the dew. He\r\n          walks faster now, Finn watching in admiration.\r\n\r\n          62-63OMITTED 62-63\r\n\r\n          64 EXT.TREES/ DARK FOREST - DAY. 64\r\n\r\n           Snow White finally shakes free of the vines, jumps up and senses\r\n           she's being followed. She looks up at the trees but all she sees\r\n           are vague shadows. The wind picks up, ghostly voices howling in\r\n          the breeze. She's rooted to the spot for a moment, then loses\r\n          her nerve and runs --\r\n          64aEXT. DARK FOREST - DAY. 64a\r\n          Eric, Finn and the Guards move through a dark copse of trees.\r\n          VOICES AND WHISPERS-call to them from the wind. Eric stops,\r\n          looks around.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            32\r\n          64a CONTINUED: 64a\r\n\r\n                         ERIC\r\n          Pay them no mind.\r\n          One of the Guards leans over a pool of water to drink when he\r\n          sees a GHOSTLY REFLECTION gazing back at him. He stares in\r\n          surprise, leaning closer. Suddenly a BARBED TAIL shoots out\r\n          of the water -- skewering him -- and drags him into the\r\n          depths.\r\n          The others turn as they hear a scream but there's no sign of\r\n          their companion now, just the bubbling water.\r\n          Only Finn looks unconcerned.\r\n          Eric stops senses something, holds up a hand.\r\n          Then darts ahead, leaving them flat-footed. Finn makes a\r\n          decision to follow and waves for his Guards to go ahead of\r\n          him.\r\n          They reluctantly follow Eric.\r\n\r\n          65 EXT. DARK FOREST - MOMENTS LATER - DAY. 65\r\n\r\n          Eric moves quickly then stops, listens - we see his hunting\r\n          skills - as he hears the noise of cracking branches in the\r\n          distance, he blasts away, moving like lightning.\r\n\r\n          66 EXT. TREES/ DARK FOREST - DAY. 66\r\n\r\n          Snow White feels like the whole forest is pursuing her. Running\r\n          out of breath, she hides in some bushes. As she stares into the\r\n          mist, she sees a sinister figure appear through the haze.\r\n          Eric stops and looks around, sensing his prey is close. Snow\r\n          White stays low, trying to quieten her breathing.\r\n          Eric studies the forest floor. He sees Snow White's footprints,\r\n          then looks up at an area of disturbed undergrowth.\r\n          Snow White peers through the bushes and sees the huntsman's\r\n          boots approaching. She looks around for something to defend\r\n          herself with when the sound of the footsteps fades. She can't\r\n          see anyone now. She looks relieved when SUDDENLY STRONG HANDS\r\n\r\n          GRAB HER BY THE FEET AND DRAG HER OUT OF THE BUSHES.\r\n          She fights to get away but he pins her with a foot, reaches\r\n          down and turns her over.\r\n          His first look at her gives him pause. Her face, her spirit,\r\n          her youth. She slaps at him - he pulls out his knife with\r\n          one hand while he pins her with the other.\r\n          Then grabs, lifts her.\r\n\r\n                         SNOW WHITE\r\n          Let me go!\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            32A\r\n\r\n                         66 CONTINUED: 66\r\n          She bites him. He grimaces and grabs her tighter and starts\r\n          trudging back.\r\n\r\n                         SNOW WHITE\r\n          She's going to kill me! The Oueen!\r\n          He ignores, keeps moving.\r\n\r\n                         ERIC\r\n          Sure she is.\r\n\r\n                         SNOW WHITE\r\n          Believe me! Her brother tried to cut out\r\n          my heart.\r\n          He stops, looks at her.\r\n\r\n                         SNOW WHITE\r\n          I swear it.\r\n          He somehow believes her. New game. Then...\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            33\r\n\r\n                         66 CONTINUED: (2) 66\r\n\r\n          FINN (O.S.)\r\n          Quick work!\r\n          Eric looks up to see Finn and his men approaching. Snow White\r\n          gasps at the sight of Finn.\r\n\r\n                         SNOW WHITE\r\n          Him! He's the one! He came at me with a\r\n          knife!\r\n          Eric holds her tight, one arm around her neck.\r\n\r\n                         FINN\r\n          Well done, huntsman. Hand her over.\r\n\r\n                         SNOW WHITE\r\n          You can't trust him!\r\n\r\n                         ERIC\r\n          What do you intend to do with her?\r\n\r\n                         FINN\r\n          Why do you care?\r\n          Finn nods and the Guards approach. Eric grips her tighter.\r\n\r\n                         ERIC\r\n\r\n                         (TO FINN)\r\n          You want her. Give me what I was\r\n          promised.\r\n\r\n                         FINN\r\n          Come now huntsman, you did your job well.\r\n          Keep your word and hand her over.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            34\r\n\r\n                         66 CONTINUED: (3) 66\r\n\r\n                         SNOW WHITE\r\n          He'll betray you -\r\n\r\n                         ERIC\r\n          Shut up! -\r\n\r\n                         SNOW WHITE\r\n          He'll kill us both -\r\n\r\n                         ERIC\r\n          I said, shut up!\r\n          He puts his knife to her throat to quiet her.\r\n\r\n                         ERIC\r\n\r\n                         (TO FINN)\r\n          I'll keep my word when the Queen keeps\r\n          hers.\r\n          Finn shakes his head and laughs.\r\n\r\n                         FINN\r\n          You are a drunk and a fool. My Queen has\r\n          many powers; she can take life or sustain\r\n          it. But she can't bring your wife back\r\n          from the dead.\r\n\r\n                         ERIC\r\n\r\n          I WANT HER BACK!\r\n          His face tells us how much Eric wanted, needed to believe.\r\n          The Guards keep inching toward Eric.\r\n          Eric, still with a knife to Snow White's throat, starts\r\n          slowly backing up.\r\n          Finn pulls his own sword and approaches.\r\n          Four against one. As they burst toward him he tosses Snow\r\n          White to the ground and in the same motion throws his knife\r\n          into the chest of one of the Guards, who crumbles.\r\n          Eric reaches behind, grabs both hatchets and faces off with\r\n          the others.\r\n          They all rush at once. Eric fights off the guards as he\r\n          raises a hatchet, throws it --\r\n          Right into Finn's chest. Just like Ravenna, no blood, no\r\n          wound. Finn pulls it out, laughs and throws it at the\r\n          huntsman who ducks as it sticks into a tree.\r\n          Snow White, terrified, races off into the forest. They\r\n          notice her exit but keep fighting.\r\n          Eric fights on three sides now - holding his own until Finn\r\n          manages to plunge a sword in his side.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            35\r\n\r\n                         66 CONTINUED: (4) 66\r\n          Eric grunts and falls back. Finn races forward to finish him\r\n          off but Eric lunges and --\r\n          Flips Finn onto his back and into a grove of mushrooms.\r\n          Eric covers his nose with his arm and looks at the other\r\n          Guards, who look from Finn, who is dazed, to Eric, who is\r\n          hurt.\r\n          Finn struggles to his knees, shakes his head, hallucinating a\r\n          bit.\r\n\r\n                         FINN\r\n          Butcher him! Find her!\r\n          The Guards, also trying to cover their noses, move forward.\r\n          Eric has a decision to make.\r\n          Bad odds. And he's injured. Eric decides in an instant,\r\n          grabs his knife out of the dead Guard, as well as his hatchet\r\n          from the tree and runs after Snow White --\r\n\r\n          67 EXT. DARK FOREST - DAY. 67\r\n\r\n          Snow White crashes through the woods.\r\n          Then a HAND grabs her shoulder--\r\n          Eric. He slaps a palm over her mouth before she can scream\r\n          and slides down a steep slope into undergrowth.\r\n          67a EXT. DARK FOREST - FINN - SAME 67a\r\n          Finn is on his feet but still hallucinating - stumbling\r\n          about. The Guards are spooked as they look all around.\r\n\r\n                         FINN\r\n          This is not finished!\r\n          The words echo through the dark forest.\r\n          67b EXT. DARK FOREST - ERIC AND SNOW WHITE - SAME 67b\r\n          Eric removes his hand from Snow White's mouth.\r\n          At once she PUNCHES HIM WITH ALL SHE'S GOT.\r\n          He steps back, licks his bloody lip. She takes another swing.\r\n          This one he manages to grab.\r\n\r\n                         SNOW WHITE\r\n          Get your hands off me.\r\n          She draws his dagger. He backs off. Eyeball to eyeball:\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            36\r\n          67b CONTINUED: 67b\r\n\r\n                         SNOW WHITE\r\n          Get away.\r\n\r\n                         ERIC\r\n          Who are you? What the hell's going on?\r\n\r\n                         SNOW WHITE\r\n          Get away from me.\r\n\r\n                         ERIC\r\n          Why does the Queen want you dead?\r\n\r\n                         SNOW WHITE\r\n          She wants us all dead. All of us-\r\n\r\n                         ERIC\r\n          Then what makes you so damn valuable?\r\n\r\n                         SNOW WHITE\r\n          You should know. You're the one hunting\r\n          me.\r\n          He backs away. Paces.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            36A\r\n          67b CONTINUED: (2) 67b\r\n\r\n                         ERIC\r\n\r\n                         (TO HIMSELF)\r\n          Never get involved in the Queen's\r\n          business and what do I do? Get involved\r\n          in the Queen's business...\r\n          Without warning, he walks off.\r\n          Leaving her alone. She follows him.\r\n\r\n                         SNOW WHITE\r\n          Where are you going?\r\n\r\n                         ERIC\r\n          Away from you, love. You're trouble.\r\n\r\n                         SNOW WHITE\r\n          I need to get to the Duke's Castle.\r\n          There's an army there. I'll be safe.\r\n\r\n                         ERIC\r\n          The Duke? I've seen sheep with more fight\r\n          in them.\r\n          Desperate, she takes a chance.\r\n\r\n                         SNOW WHITE\r\n          Take me, you'll be rewarded.\r\n          I'm valuable. Isn't that why you're here?\r\n\r\n                         SHE APPEALS:\r\n\r\n                         SNOW WHITE\r\n          You're dead if you return without me. And\r\n          I'm dead if you leave me.\r\n          He turns, exasperated with her.\r\n\r\n                         ERIC\r\n          (Then -- wearily:)\r\n          Just for argument's sake.\r\n          (Shakes his head)\r\n          How much?\r\n\r\n                         SNOW WHITE\r\n          How much is enough?\r\n          Eric \"reluctantly\" prices up the job.\r\n\r\n                         ERIC\r\n          Well,it's a long way, through the\r\n          forest, and that... that's a dangerous\r\n          road, I couldn't even consider it for\r\n          less than thirty gold pieces...\r\n\r\n                         SNOW WHITE\r\n          A hundred. Deliver me safe to the Duke. I\r\n          give you my word.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            36B\r\n          67b CONTINUED: (3) 67b\r\n          Deep quandary. Still suspicious..\r\n\r\n                         ERIC\r\n          Who are you?\r\n          She looks at him levelly.\r\n\r\n                         SNOW WHITE\r\n          Maybe that's a question you should have\r\n          asked the queen.\r\n          Stand-off.\r\n\r\n                         SNOW WHITE\r\n          Do we have a deal?\r\n\r\n                         ERIC\r\n          I don't trust you Billy Goat.\r\n\r\n                         SNOW WHITE\r\n          I've given you my word.\r\n          He spits on his hand. She puts out her hand.\r\n          He shakes it.\r\n\r\n                         ERIC\r\n          I still don't trust you.\r\n\r\n                         SNOW WHITE\r\n          I don't trust you either.\r\n          She wipes it on her skirt. Behind them, a commotion.\r\n          They run off.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            37\r\n\r\n                         67BCONTINUED: (4) 67B\r\n          67c OMITTED 67c\r\n\r\n                         68 OMITTED 68\r\n          68a EXT. DARK FOREST - DAY. 68a\r\n          Tree roots gleam with an eerie phosphorescent light. The mist\r\n          closes in. Snow White looks around the forest, unnerved by\r\n          the haunting silence and the deep shadows. Reluctantly she\r\n          focuses on Eric, trying to take her mind off the terrors\r\n          around her.\r\n          He sits on a log for a breath.\r\n\r\n                         ERIC\r\n          We'll stay the night here.\r\n\r\n                         SNOW WHITE\r\n          You haven't answered me.\r\n\r\n                         ERIC\r\n          I don't recall a question.\r\n\r\n                         SNOW WHITE\r\n          Where are we going?\r\n          He takes a stick, draws in the dirt.\r\n\r\n                         ERIC\r\n          Queen. Mountains. Dark Forest. Here.\r\n          Past. There's a village.\r\n          She takes the stick, points to a different spot in the dirt.\r\n\r\n                         SNOW WHITE\r\n          I'm going to the Duke's Castle.\r\n          He grabs the stick back.\r\n\r\n                         ERIC\r\n          You'll go where I take you.\r\n\r\n                         SNOW WHITE\r\n          You'll take me to the Duke's castle or\r\n          I'll go alone.\r\n\r\n                         (MORE)\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           37A\r\n          68a CONTINUED: 68a\r\n           SNOW WHITE (cont'd)\r\n          (beat; looks around)\r\n          As soon as you get me out of the forest.\r\n\r\n                         ERIC\r\n          You're rather demanding, and not all that\r\n          endearing, you know?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            38\r\n          68a CONTINUED: (2) 68a\r\n\r\n                         SNOW WHITE\r\n          There's a reward that awaits you. There\r\n          are noblemen there, an army.\r\n\r\n                         ERIC\r\n\r\n                         (LAUGHS)\r\n          An army? The Duke fights? He hides behind\r\n          walls. I know sheep that have more fight\r\n          in them.\r\n          (after a beat)\r\n          How much?\r\n          (off her look)\r\n          Reward? Just for argument's sake?\r\n\r\n                         SNOW WHITE\r\n          How much do you want?\r\n          Eric considers this, not sure how or if to negotiate.\r\n\r\n                         SNOW WHITE\r\n          Two hundred gold pieces. Do we have a\r\n          deal?\r\n          More, a lot more, than he was expecting.\r\n\r\n                         ERIC\r\n          I'll deliver you to safety m' lady.\r\n\r\n                         SNOW WHITE\r\n          Swear it.\r\n\r\n                         ERIC\r\n          I swear (beat). Constantly. It's one of\r\n          my better qualities.\r\n          She's not sure what to make of this, but...\r\n\r\n                         SNOW WHITE\r\n          Fine.\r\n          He moves to a spot to lie down and gathers leaves.\r\n          Snow White seeks her own spot and comes upon -- the RIB CAGE\r\n          OF A DEAD DEER, a host of BEAUTIFUL BUTTERFLIES feeding on\r\n          its bones. She is shocked. Eric notices...\r\n\r\n                         ERIC\r\n          I've seen far stranger things in here.\r\n          She sits, looks to Eric. Something's been bothering her.\r\n\r\n                         SNOW WHITE\r\n          Do you think... will they follow us?\r\n\r\n                         ERIC\r\n          They'd be foolish to. Few survive.\r\n          Good news/bad news. She looks around.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            39\r\n          68a CONTINUED: (3) 68a\r\n\r\n                         SNOW WHITE\r\n          How far have you travelled into the Dark\r\n          Forest?\r\n\r\n                         ERIC\r\n          We passed it a few miles back.\r\n          He opens his flask and takes a healthy pull.\r\n\r\n          69 EXT. DUKE HAMMOND'S STRONGHOLD - AERIAL SHOT - DAY. 69\r\n\r\n          We're moving over high mountains and valleys now, approaching\r\n          Duke Hammond's castle.\r\n\r\n          70 INT. WAR ROOM/ DUKE HAMMOND'S CASTLE - DAY. 70\r\n\r\n          Grim faced COMMANDERS look on as DUKE HAMMOND comforts a\r\n          sobbing man in the firelight. We recognise the old rebel,\r\n          THOMAS, whose son was killed by Ravenna.\r\n\r\n                         THOMAS\r\n          She killed brave Lain with only her palm\r\n          and pulled a dagger from her chest\r\n          without blood. She cannot be killed.\r\n          Duke Hammond has heard enough, turns to leave.\r\n\r\n                         THOMAS\r\n          There is more.\r\n\r\n                         (DUKE STOPS)\r\n          The princess has escaped the castle!\r\n\r\n                         DUKE HAMMOND\r\n\r\n                         (EXCITED)\r\n          Where is my son?\r\n\r\n          71 EXT. FIELD - DAY. 71\r\n\r\n          FLAMING MOSS is thrown into a puddle of oil and a MASSIVE\r\n          FIRE lights up the night.\r\n          William, rapid-fires his bow at close quarters into a line of\r\n          the Queen's supply wagons and the fight is on. A VIOLENT\r\n\r\n          CLASH OF SWORDS IN CLOSE QUARTER FIGHTING.\r\n          His COMPANIONS are as wild and hot-headed as he is, roaring\r\n          with delight as the Queen's men finally flee.\r\n\r\n          72-7 30MITTED 72-73\r\n           73a INT. WAR ROOM/ DUKE HAMMOND'S CASTLE - NIGHT. 73a\r\n          William enters.\r\n\r\n                         WILLIAM\r\n          You asked for me, father?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            40\r\n          73a CONTINUED: 73a\r\n\r\n                         DUKE HAMMOND\r\n          I have news of the Princess.\r\n          William stares in surprise --\r\n\r\n                         WILLIAM\r\n          The Princess?!!\r\n\r\n                         DUKE HAMMOND\r\n          Ravenna has kept her all these years.\r\n\r\n                         WILLIAM\r\n          She lives?!\r\n\r\n                         DUKE HAMMOND\r\n          She escaped the castle and into the dark\r\n\r\n                         FOREST -\r\n          He turns to leave --\r\n\r\n                         WILLIAM\r\n          I'm going after her!.\r\n\r\n                         DUKE HAMMOND\r\n          We don't know if she survived --\r\n          Duke Hammond grabs him by the arm.\r\n\r\n                         DUKE HAMMOND\r\n          You ventured beyond the walls tonight,\r\n          disobeying my orders. We are all that's\r\n          left, William. I cannot afford to lose\r\n          any more of my men.\r\n\r\n                         WILLIAM\r\n          Then I will go alone.\r\n\r\n                         DUKE HAMMOND\r\n          And I cannot afford to lose my only heir!\r\n          You do not know the dark forest!\r\n\r\n                         WILLIAM\r\n          Then I'll find someone who does.\r\n          William pulls away.\r\n\r\n                         WILLIAM\r\n          I will not abandon her a second time.\r\n\r\n          74 EXT. PLAINS BEYOND DUKE HAMMOND'S STRONGHOLD - DAWN. 74\r\n\r\n           William gallops away from the castle walls under the cover of\r\n           the breaking dawn.\r\n          75 MOVED TO 68a 75\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            41\r\n\r\n                         76 OMITTED 76\r\n\r\n                         77 OMITTED 77\r\n\r\n          78 EXT. STABLES/ INN/ VILLAGE - DAY 78\r\n\r\n          A motley crew of woodsmen stand side to side. Finn is eyeing\r\n          them, sizing them up, picking a crew.\r\n\r\n                         FINN\r\n          Which of you knows the dark forest?\r\n          A powerfully built Yakut tracker, ALDAN, and BROCH both nod.\r\n\r\n                         FINN\r\n          You. You. You. You.\r\n          He's selected Aldan, Broch and points to others. As we move\r\n          down the line we see --\r\n          William, hat low, trying to look tough.\r\n          Finn selects a few more.\r\n\r\n                         FINN\r\n          Load and prepare. You ride for bounty.\r\n          Into the dark forest. The rest of you.\r\n          Away !\r\n          As they disperse..\r\n          William sets his jaw, and heads off..\r\n\r\n                         CUT TO:\r\n          The men ride out of the village. Suddenly they stop.\r\n          Standing up ahead is William, blocking their path. He calls\r\n          to them.\r\n\r\n                         WILLIAM\r\n          You need a bowman?\r\n          FINN calls back.\r\n\r\n                         FINN\r\n          I have a bowman. Away.\r\n          WILLIAM stands unblinking.\r\n\r\n                         FINN\r\n          I said away, damn you!\r\n          WILLIAM doesn't move. Finn turns to the bowman.\r\n\r\n                         FINN\r\n          Kill him.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            41A\r\n\r\n                         78 CONTINUED: 78\r\n          The bowman smiles, draws his bow.\r\n          BEFORE he can loose an arrow:\r\n\r\n          THWACK! THWACK!!\r\n          Two arrows strike the bowman in the throat, lifting him off\r\n          his horse, stone dead.\r\n          FINN turns. WILLIAM lowers his bow.\r\n\r\n                         WILLIAM\r\n          I said do you need a bowman?\r\n          Finn studies William with dead eyes.\r\n\r\n          79 MOVED TO 80A 79\r\n\r\n                         80 OMITTED 80\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            42\r\n\r\n                         80 CONTINUED: 80\r\n          80aEXT. VILLAGE ROAD - DAY. 80a\r\n          In the pouring rain, a group of fierce BOUNTY HUNTERS ride on\r\n          horseback, when another rider appears, blocking their way.\r\n          It's William.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            43\r\n          80a CONTINUED: 80a\r\n\r\n                         BROCH\r\n          Clear the road.\r\n          But William doesn't budge.\r\n          One of the other mercenaries grins, then rides towards\r\n          William, drawing his sword. He raises it when William\r\n          unslings his bow and loosens two arrows at close range,\r\n          hitting him in each thigh and knocking him off his horse.\r\n          Broch draws his enormous battle axe, about to charge, when\r\n          Finn rides forward and stops him.\r\n\r\n                         FINN\r\n          Wait!\r\n          Finn sizes up William.\r\n\r\n                         FINN\r\n          You're quick with a bow.\r\n\r\n                         WILLIAM\r\n          I want to ride with you.\r\n\r\n                         FINN\r\n          Why?\r\n\r\n                         WILLIAM\r\n          You are paying well and I need the coin.\r\n\r\n                         FINN\r\n          Have you traversed the Dark Forest?\r\n\r\n                         WILLIAM\r\n          No.\r\n\r\n                         FINN\r\n          Then what use are you?\r\n\r\n                         WILLIAM\r\n          As you said, I'm quick with a bow.\r\n          He nods to the guy on the ground, groaning with arrows in his\r\n          thighs.\r\n\r\n                         WILLIAM\r\n          And unlike him, I have two good legs.\r\n          Finn considers for a moment, then smiles, nods to the guy on\r\n          the ground.\r\n\r\n                         FINN\r\n          Replace him.\r\n          William looks at Finn gratefully. Finn studies him with a\r\n          curious smile then rides on.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            44\r\n\r\n          81 EXT. AERIAL VIEW/ DARK FOREST - DAY. 81\r\n\r\n           From high above, we see the dark forest stretching out.\r\n\r\n                         82 OMITTED 82\r\n\r\n                         83 OMITTED 83\r\n           83a EXT. DARK FOREST - DAY 83a\r\n          Snow White approaches a stream, kneels, splashes her face and\r\n          brings a handful of water to her lips.\r\n\r\n                         ERIC\r\n          I wouldn't do that if I were you.\r\n          Not unless you want your bowels to rip\r\n          apart.\r\n          She turns. Eric has been snoozing on a rock, with one eye\r\n          open. She releases the water, stands and faces off with Eric,\r\n          who offers his flask of mead. She reluctantly takes a sip,\r\n          spits most of it out, hands it back.\r\n          He smells something, walks a few steps, bends down and examines\r\n          a long brown pellet shaped object on the ground.\r\n\r\n                         SNOW WHITE\r\n          What is it?\r\n\r\n                         ERIC\r\n          A fumee.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           44A\r\n          83a CONTINUED: 83a\r\n\r\n                         SNOW WHITE\r\n          A what?\r\n\r\n                         ERIC\r\n          You want me to call it by another name?\r\n          He doesn't need to. It's an animal dropping. Snow White winces\r\n          as he kneads it between his fingers and takes a long sniff.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            45\r\n          83a CONTINUED: (2) 83a\r\n          She catches the look of fear in his eyes as he gazes around the\r\n          woods.\r\n\r\n                         ERIC\r\n          Stay here.\r\n          He moves away, though the trees, tracking prey. He hears the\r\n          wind call his name...\r\n\r\n                         SARA\r\n          Eric.\r\n          He stops, looks to --\r\n          An outcropping of rocks, surrounded by dense forest. From\r\n          out behind a tree steps an apparition of SARA. She's\r\n          beautiful.\r\n\r\n                         ERIC\r\n          Sara?...\r\n\r\n          BACK TO SNOW WHITE\r\n          She hears him call out and follows his tracks.\r\n\r\n          BACK TO HUNTSMAN\r\n          Sara holds out her hand.\r\n\r\n                         ERIC\r\n          Am I dreaming?\r\n\r\n                         SARA\r\n          Touch me and see for yourself.\r\n          Eric shakes his head, looks around, tries to fight it, but...\r\n          Her face draws him back and he begins to walk toward the\r\n          rocks.\r\n\r\n                         SARA\r\n          You weren't there to save me, Eric. I\r\n          called for you but you never came.\r\n          Snow White appears behind and sees --\r\n          Eric is walking toward a dark area where several sets of\r\n          lupine eyes await.\r\n          But Eric only sees Sara and he continues to move toward her.\r\n          She opens her arms to him and steps backwards, luring him.\r\n\r\n                         SARA\r\n          Where were you, Eric? Come to me now.\r\n          Protect me now.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            46\r\n          83a CONTINUED: (3) 83a\r\n\r\n                          ERIC\r\n           Sara, I'm so sorry. Forgive me, please\r\n           forgive me. Give me peace. Sara...\r\n           He takes another step toward her and --\r\n          Buckles - THWACK!\r\n          Snow White hits him behind his knees with a piece of wood.\r\n          He hits the ground and she drags him away. He fights back and\r\n          she jumps on top of him, staring right into his face.\r\n\r\n                         SNOW WHITE\r\n          She's not real! Not real! Do you hear\r\n          me?!\r\n          He does and calms. She gets off him and he sits up, fatigued\r\n          by the experience. A low point for him.\r\n          He reaches for his flask -- pours the last single drop into\r\n          his mouth. All gone. He tosses it aside. A lost soul.\r\n          Snow White watches him with some compassion. He catches her\r\n          look, gets up and walks away.\r\n          83b EXT. DARK FOREST OPEN AREA - DAY 83b\r\n          Snow White catches up.\r\n\r\n                         SNOW WHITE\r\n          Who is she? The one you bargained for.\r\n          The one that spoke to you. Who is Sara?\r\n\r\n                         ERIC\r\n          A name you'll not mention again.\r\n          He tosses a knife to her. She's surprised but catches it.\r\n\r\n                         SNOW WHITE\r\n          What?\r\n\r\n                         ERIC\r\n          Feel its weight. One hand to the other.\r\n          She shakes her head but does so.\r\n\r\n                         ERIC\r\n          Now hold it - business end pointed at me.\r\n\r\n                         SNOW WHITE\r\n          Why are you?--\r\n          He lunges at her and she raises the blade.\r\n\r\n                         ERIC\r\n          Which is your lead foot?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           46A\r\n          83b CONTINUED: 83b\r\n\r\n                         SNOW WHITE\r\n          What do you mean?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            47\r\n          83b CONTINUED: (2) 83b\r\n          He jumps at her again and she puts her right foot forward,\r\n          knife in right hand pointed. He starts to slowly move toward\r\n          her. One step at a time.\r\n\r\n                         ERIC\r\n          Now stay back. You're too small to\r\n          attack. You have to parry; use your\r\n          opponents strength against him. Raise\r\n          your opposing forearm.\r\n          She does. He comes closer.\r\n\r\n                         ERIC\r\n          With it you block and deflect an opposing\r\n          thrust. You'll lose meat but you won't\r\n          die from it. Wait until I'm close.\r\n          He steps forward.\r\n\r\n                         ERIC\r\n          Not yet. Watch my hands, not my eyes.\r\n          He moves even closer.\r\n\r\n                         ERIC\r\n          Not yet. Not until you can feel my\r\n          breath.\r\n          He moves right up to her.\r\n\r\n                         ERIC\r\n          Now.\r\n          Their faces are inches apart.\r\n\r\n                         ERIC\r\n          This close. Drive it through me. To the\r\n          hilt. Now look in my eyes.\r\n\r\n                         (SHE DOES)\r\n          Don't pull it out 'til you see my soul.\r\n          Their eyes are still locked.\r\n\r\n                         SNOW WHITE\r\n          Why do I need to learn how to kill?\r\n          He looks at her.\r\n\r\n                         ERIC\r\n          There's a lot you need to learn lass.\r\n          Eric backs away.\r\n\r\n                         ERIC\r\n          Keep that.\r\n          She nods, now-focused on him in a way other than as an\r\n          instructor. He turns and walks away.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            48\r\n          83b CONTINUED: (3) 83b\r\n\r\n                         SNOW WHITE\r\n          Where are you going?\r\n\r\n                         ERIC\r\n          Fumee.\r\n\r\n          84C EXT. CLOISTER GARDENS/ CASTLE - DAY. 84C\r\n\r\n          A single blossom flowers on the dying apple tree. Ravenna,\r\n          looking weaker than before, stares at it quietly, as if she\r\n          were gazing at Snow White. She reaches out and crushes the\r\n          blossom in her hand, turning it into ash.\r\n          Her look is one of conviction.\r\n\r\n                         RAVENNA\r\n          Find her.\r\n\r\n          85 MOVED TO 10A 85\r\n\r\n          86 MOVED TO 13A 86\r\n\r\n          87 EXT. DARK FOREST - DAY. 87\r\n\r\n          Finn reacts as if he heard Ravenna's words. He did. They have\r\n          that kind of connection. Spooked, he continues on. The other\r\n          trackers follow, William looking tense. At the back of the\r\n          group, one of the mercenaries slows down, sensing something in\r\n          the forest.\r\n          William is still watching Finn when they hear a bloodcurdling\r\n          CRY behind them. The mercenary's horse gallops out of the trees\r\n          without its rider, a gaping wound in its side. William and the\r\n          others look shaken but Finn doesn't even turn around, riding on.\r\n          87a EXT. DARK FOREST - DAY. 87a\r\n          Eric pulls Snow White along. Beyond a bridge we see open fens\r\n          -- the bridge LEADS OUT OF THE DARK FOREST -- and birds\r\n          circling on the distant horizon.\r\n          Snow White looks relieved as she follows him down a slope.\r\n          They hurry through a sea of mist when suddenly Eric stops.\r\n\r\n                         SNOW WHITE\r\n          What is it?\r\n\r\n                         ERIC\r\n          It can't be this easy.\r\n          He quietly unsheathes a hatchet.\r\n\r\n                         SNOW WHITE\r\n          Is this the end of the Dark Forest?\r\n\r\n                         ERIC\r\n          (not paying attention)\r\n          Uh-huh.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            49\r\n          87a CONTINUED: 87a\r\n\r\n                         SNOW WHITE\r\n          How far to the Duke's castle?\r\n          He ignores, follows tracks, then stops as he sees the STONE\r\n          BRIDGE below -- LEADING OUT OF THE DARK FOREST. Snow White\r\n          stares at it too, relieved. Beyond the bridge there are open\r\n          fens.\r\n          They hurry down together and start to cross the bridge.\r\n          They're half way across WHEN SUDDENLY WE SEE THE STONES START\r\n\r\n          TO MOVE BEHIND THEM --\r\n\r\n          A PAIR OF EYES OPENS IN THE STONE, AND SLOWLY THE BRIDGE\r\n\r\n          STARTS TO RISE --\r\n          Snow White turns to see -- A HUGE CREATURE REARING UP --\r\n\r\n          TWENTY FEET TALL. IT'S NOT A BRIDGE AT ALL BUT A --\r\n\r\n                         ERIC\r\n          Troll!\r\n          Eric and Snow White are SLAMMED off the bridge and land in\r\n          the shallow creek below -- among the CARCASSES OF SLAIN\r\n          ANIMALS. The troll roars and comes after them, swinging its\r\n          giant stone fists. Eric grabs Snow White and runs --\r\n          As the troll catches up with them, Eric shoves her out of the\r\n          way and draws his hatchets.\r\n\r\n                         ERIC\r\n          Run!\r\n          Snow White turns and flees. Eric runs at the Troll. He ducks\r\n          as a mighty arm sweeps over him, darts between the troll's\r\n          legs, and hacks at its leg with his hatchets.\r\n          The Troll falters a bit then --\r\n          A swinging stone fist catches him and hurls him across the\r\n          creek.\r\n          Snow White looks back to see Eric lying stunned on the\r\n          ground, his wound bleeding again, at the troll's mercy. She\r\n          hesitates, still terrified, then runs back.\r\n          The Troll towers over the huntsman. It raises its stone hands\r\n          to crush him when --\r\n          Snow White arrives -- SCREAMING LIKE A BANSHEE!\r\n          The Troll looks around in surprise. So does Eric. A beat,\r\n          then the monster turns away from Eric, striding towards Snow\r\n\r\n                         WHITE --\r\n          She stands her ground, fighting her terror, PULLS HER KNIFE.\r\n          The TROLL looms over her, but she doesn't retreat. She raises\r\n          an arm, just as Eric instructed.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           49A\r\n          87a CONTINUED: (2) 87a\r\n          Eric stares in surprise, watching the twenty foot monster\r\n          towering over the tiny girl.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            50\r\n          87a CONTINUED: (3) 87a\r\n          Snow White stares into the troll's eyes, seeing something\r\n          almost gentle in its monstrous gaze, slowly losing her fear.\r\n          The troll stares at her too, confused, then slowly pacified,\r\n          until it finally turns and strides away.\r\n          Eric stares in disbelief. Snow White is rooted to the spot,\r\n          also confused but strangely moved by what's happened. Eric\r\n          rises to his feet painfully and heads over, taking her by the\r\n          arm.\r\n\r\n                         ERIC\r\n          I told you to run.\r\n\r\n                         SNOW WHITE\r\n          If I had you'd be dead. A \"thank you\"\r\n          would suffice.\r\n          It's clear he sees her in a different light. She stares back\r\n          at him. Eric holds her gaze, struggling a bit, then...\r\n\r\n                         ERIC\r\n          Thank you.\r\n\r\n          88 EXT. MARSHES - DAY. 88\r\n\r\n          The sun glints through the thinning trees. Eric wades through\r\n          the deep sludge, Snow White following in his steps.\r\n          Eric looks at her a moment, then suddenly turns away as he\r\n          sees her expression change --\r\n          GHOSTLY BACKLIT FIGURES EMERGE on the banks of the marsh now,\r\n          holding bows and arrows. Eric looks around for an escape route,\r\n          but everywhere he turns MORE FIGURES APPEAR.\r\n          He draws his axe when A FIGURE IN A HOODED CLOAK (ANNA) appears,\r\n          clutching her bow like a goddess.\r\n\r\n                         ANNA\r\n          They say only demons or spirits can\r\n          survive the dark forest. Which are you?\r\n          Eric, unsure, pulls his hatchet and steps in front of Snow\r\n          White protecting her.\r\n\r\n                         ERIC\r\n          Which are you?\r\n\r\n                         ANNA\r\n          Neither. Perhaps you are the Queen's\r\n          spies?\r\n\r\n                         ERIC\r\n          We're fugitives from the Queen.\r\n          Snow White steps forward into the light.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            50A\r\n\r\n                         88 CONTINUED: B8\r\n\r\n                         SNOW WHITE\r\n          We mean you no harm.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            51\r\n\r\n                         88 CONTINUED: (2) 88\r\n          Anna sees Snow White clearly now, raises her hood. Snow\r\n          White sees a deep scar running down her otherwise beautiful\r\n          face. And then a smile.\r\n\r\n          89 EXT. FENLAND VILLAGE - DAY 89\r\n\r\n          The fenland village is made up of mud huts, elevated on stilts\r\n          to protect them from flooding.\r\n\r\n                         ERIC\r\n          Where are the men?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            52\r\n\r\n                         89 CONTINUED: 89\r\n\r\n                         ANNA\r\n          Gone.\r\n          Anna paddles a boat as they approach the village. Eric and\r\n          Snow White speak quietly.\r\n\r\n          ON THE BANK\r\n          The boat stops and they get out. The women of the village\r\n          move from their hut to greet them as they walk into the\r\n          village.\r\n          More women emerge from their huts to view the newcomers, no\r\n          men in sight. They all have scarred faces.\r\n          All the women have assembled alongside the group, watching\r\n          with awe as they pass. They stare at Snow White and murmur.\r\n          They can't take their eyes off her. Some even reach out to\r\n          touch her sleeve or dress.\r\n\r\n                         SNOW WHITE\r\n          (sotto; to Eric)\r\n          Why are they looking at me like that?\r\n\r\n                         ERIC\r\n          I don't know, but keep smiling.\r\n          A beautiful LITTLE GIRL, LILY, moves away from her friends\r\n          and offers her hand. Snow White stops, looks down at the\r\n          girl, trying not to stare at her scar.\r\n          90-93a OMITTED 90-93a\r\n          93b EXT. BANKS OF THE LAKE/ FENLAND VILLAGE - DAY. 93b\r\n          Eric sits by the lake, ANNA bandaging his wounds.\r\n\r\n                         ANNA\r\n          You have travelled far Huntsman. With a\r\n          heavy burden.\r\n          Snow white is playing with Lily. They are making little dolls\r\n          from straw.\r\n\r\n                         ERIC\r\n          I've had worse jobs. And anyway, she's\r\n          not that heavy.\r\n\r\n                         ANNA\r\n          You mean... you do not know who she is?\r\n          His eyes narrow.\r\n\r\n                         ERIC\r\n          What do you mean?\r\n          He looks over.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           52aA\r\n          93b CONTINUED: 93b\r\n\r\n                         ERIC\r\n          Who is she?\r\n\r\n          ACROSS THE WAY\r\n          Snow White draws eyes upon the doll.\r\n          Snow White's eyes fill with tears.\r\n\r\n                         LILY\r\n          My father showed me how to make them. But\r\n          he's gone away.\r\n          Lily takes a stick and marks the dolls face with a scar..\r\n\r\n                         LILY\r\n          Here. She's finished.\r\n          She hands it to her.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            52A\r\n          93b CONTINUED: (2) 93b\r\n\r\n                         SNOW WHITE\r\n          She's beautiful.\r\n          Lily smiles and runs off to play. Behind her Eric appears.\r\n\r\n                         SNOW WHITE\r\n          These women... This place.. It's very\r\n          peaceful. But it makes me very sad.\r\n\r\n                         ERIC\r\n          Why didn't you tell me?\r\n          She stops. She knows.\r\n\r\n                         ERIC\r\n          Because I'd think it too fell a task?\r\n          You'd be right.\r\n          She looks at him. Shakes her head.\r\n\r\n                         SNOW WHITE\r\n          That's not why. It's because I've never\r\n          said the words.\r\n          She looks at Lily playing.\r\n\r\n                         SNOW WHITE\r\n          I'm not sure I believe it myself. I never\r\n          felt like a..\r\n          (She stops.)\r\n          Alone in a dark cell. For years. Fighting\r\n          to cling to memories. What he looked\r\n          like. Smelled like. The kind man with the\r\n          big arms and the wonderful smiles.. To\r\n          me.. he wasn't The King. He was my\r\n          father.\r\n          Eric doesn't know what to say. In time, he reaches in his\r\n          pocket.\r\n\r\n                         ERIC\r\n          Here.\r\n\r\n                         SNOW WHITE\r\n          What is it?\r\n\r\n                         ERIC\r\n          I've carried it a long time.\r\n\r\n                         SNOW WHITE\r\n          What is it made of?\r\n\r\n                         ERIC\r\n          Gristle from a stag's heart.\r\n          (off her look)\r\n\r\n                         (MORE)\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           52B\r\n          93b CONTINUED: (3) 93b\r\n\r\n                          ERIC (CONT'D)\r\n          The stag's the most timid animal in the\r\n          forest but there's a bone in it's heart\r\n          that gives it courage in it's hour of\r\n          need and makes it the bravest in of all\r\n          God's creatures. It's a protection charm.\r\n\r\n                         (HE SHRUGS)\r\n          Or so they say.\r\n          They share a look.\r\n\r\n                         SNOW WHITE\r\n          Was it hers?\r\n          It's the most honest and emotional he's been with her.\r\n\r\n                         ERIC\r\n          Take it.\r\n          She does.\r\n\r\n                         SNOW WHITE\r\n          Thank you, huntsman.\r\n          He looks at the sky.\r\n\r\n                         ERIC\r\n          It's getting dark.\r\n          He walks away.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            53\r\n          93b CONTINUED: (4) 93b\r\n\r\n                         94 OMITTED 94\r\n\r\n          95 INT. HUT - FENLAND VILLAGE - NIGHT. 95\r\n\r\n          Snow White lies in her bed. Nearby sleep Anna and Lily.\r\n\r\n                         SNOW WHITE\r\n          She's so beautiful.\r\n\r\n                         ANNA\r\n          That is not a kind thing to say in these\r\n          times. Youth one cannot alter... beauty,\r\n          however. We have sacrificed beauty to\r\n          raise our children in peace. And you,\r\n          your sacrifice will come, princess.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            53A\r\n\r\n                         95 CONTINUED: 95\r\n          Snow White looks to Anna, surprised.\r\n          a95 EXT. OUTSIDE THE HUT - SAME a95\r\n          Eric exits and pauses, looks back - through the flap can see\r\n          Snow White. He walks away.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            54\r\n          95a OMITTED 95a\r\n\r\n                         96 OMITTED 96\r\n          96a OMITTED 96a\r\n          96b INT. INSIDE THE HUT - SAME. 96b\r\n\r\n                         ANNA\r\n          You must prepare yourself, my dear. For a\r\n          time soon comes when you must deliver\r\n          that sacrifice. Will you be ready?\r\n          Anna suddenly stops. As if something has disturbed her. She\r\n          gets up and leaves.\r\n\r\n                         SNOW WHITE\r\n          What is it?\r\n\r\n                         ANNA\r\n          Sleep my dear. You must rest.\r\n          She leaves.\r\n          96c EXT. FENLAND VILLAGE. NIGHT. 96c\r\n          Eric makes his way along the perimeter, finding a path\r\n          through the trees. Suddenly he stops. Turns.\r\n          Twenty feet away. It's Anna.\r\n\r\n                         ANNA\r\n          How can you desert her now you know the\r\n          truth?\r\n\r\n                         ERIC\r\n          Aye I know the truth. And that's exactly\r\n          why she should be as far from me as\r\n          possible.\r\n\r\n                         ANNA\r\n          She's the only one that can save us. She\r\n          needs you.\r\n\r\n                         ERIC\r\n          Trust me. I'm the last thing she needs.\r\n          I'm bad luck. Everything I've ever cared\r\n          about was destroyed.\r\n\r\n                         ANNA\r\n          There's good in you Huntsman. I can see\r\n          it.\r\n\r\n                         ERIC\r\n          People have made that mistake before.\r\n          He heads off into the night.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            54A\r\n\r\n                         97 OMITTED 97\r\n          97a OMITTED 97a\r\n\r\n          98-103 OMITTED 98-103\r\n\r\n          104 INT. ANNA'S HUT - FENLAND VILLAGE - NIGHT. 104\r\n\r\n          Snow White awakens. Looks around, no Eric, puts it in her\r\n          pocket. Then smells smoke, walks outside and looks up to see --\r\n          The sky BLAZES WITH BURNING ARROWS all raining down on the\r\n          village.\r\n          104a EXT. WOODS - SAME - NIGHT. 104a\r\n           Eric, moving away from the village, spins to see the ARROWS\r\n           LIGHTING UP THE SKY BEHIND HIM. He races toward the village.\r\n          104b-107 OMITTED 104b-107\r\n\r\n          108 INT. HUT/ FENLAND VILLAGE - NIGHT. 108\r\n\r\n          Snow White re-enters the hut just as A FLAMING ARROW pierces\r\n          through the thatch and sticks next to Lily's sleeping head.\r\n          Snow White pushes Lily away from the fire and grabs the\r\n          arrow. Anna SCREAMS because -\r\n          A MERCENARY races into the hut.\r\n          On impulse Snow White backhand STABS HIM in the leg WITH THE\r\n          FLAMING ARROW and he tumbles, flames burning his clothes.\r\n          Snow White stares at him for a moment, his face, his pain.\r\n          Anna shakes her out of the moment and they all race out.\r\n\r\n                         109 OMITTED 109\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            55\r\n\r\n          109A OMITTED 109A\r\n\r\n          110 EXT. FENLAND VILLAGE - NIGHT. 110\r\n\r\n          Finn and his hunters scour the inferno on their horses.\r\n\r\n                         FINN\r\n          Run, rats, run. Find her!\r\n          William looks around the burning village in panic.\r\n\r\n                         111 OMITTED 111\r\n          llla OMITTED llla\r\n\r\n          112 EXT. ANNA'S HUT - FENLAND VILLAGE - NIGHT. 112\r\n\r\n           Snow White runs with Lily and Anna when she sees a FEARSOME\r\n           MERCENARY leap off his horse and stride towards them.\r\n\r\n                          SNOW WHITE\r\n\r\n                          (TO ANNA)\r\n           Run!\r\n          Snow White faces off with the Mercenary. She does as she's been\r\n          taught - waits for him to approach. When he's close enough to\r\n          grab her slashes at him with the knife. The huge mercenary\r\n          knocks her to the ground and advances on her.\r\n          -- when an arrow strikes him in the shoulder. He falls,\r\n          revealing a young warrior holding a bow.\r\n          It's WILLIAM. Snow White stares at him through the flames, with\r\n          a mixture of recognition and uncertainty.\r\n          It's as if for a moment everything stops as she comes\r\n\r\n          FACE TO FACE\r\n          With something from the past. Almost like a ghost. Or a\r\n          vision.. He nods to her in recognition.\r\n          She stands perfectly still.\r\n\r\n                         SUDDENLY\r\n          Anna pulls Snow White away, as they move through the smoke\r\n          and the fire.\r\n          William starts to follow, a curtain of smoke swirling around\r\n          him.\r\n\r\n          113 EXT. FENLAND VILLAGE - NIGHT. 113\r\n\r\n          Eric arrives to see the village in flames. He rushes to the\r\n          centre of the village, pulling a mercenary off his horse and\r\n          running him through with his own sword, then fighting and\r\n          killing TWO MORE MERCS as he makes his way forward.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           55aA\r\n\r\n          114 EXT. ANOTHER PART OF FENLAND VILLAGE - NIGHT. 114\r\n\r\n          Finn sits astride his horse like a demon king in the firelight.\r\n          He spots William in the distance, searching for Snow White and\r\n          rides toward him.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            55A\r\n\r\n          115 EXT. FENLAND VILLAGE - NIGHT. 115\r\n\r\n          Snow White looks back through the distant flames as she runs,\r\n          when suddenly powerful arms grab her. She flails with the knife\r\n          but it's only Eric --\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            56\r\n\r\n                         115 CONTINUED: 115\r\n\r\n                         ERIC\r\n          Come on!\r\n\r\n                         SNOW WHITE\r\n          We must help them!\r\n          Anna sees Snow White fighting off Eric and shouts --\r\n\r\n                         ANNA\r\n          You will! Go!\r\n          Eric holds her firmly, pulling her away against her will.\r\n\r\n                         116 OMITTED 116\r\n\r\n          117 EXT. ANOTHER PART OF FENLAND VILLAGE - NIGHT. 117\r\n\r\n          William jumps on his horse again, looking for Snow White through\r\n          the clouds of billowing smoke. Finn and Aldan ride up.\r\n\r\n                         FINN\r\n          Have you seen her?\r\n\r\n                         WILLIAM\r\n          No, my lord.\r\n          Finn spits fury and continues to race around, frantic.\r\n\r\n          118 EXT. MARSHES OUTSIDE FENLAND VILLAGE/ LAKE - NIGHT. 118\r\n\r\n          Eric pulls Snow White onwards, the blazing fires from the\r\n          village lighting up the marsh. He sees a lake up ahead when a\r\n          figure appears, blocking their way. It's the giant BROCH.\r\n          Grinning, he unstraps his huge axe, ready to face Eric one more\r\n          time. Eric doesn't even slow down, letting go of Snow White and\r\n          unstrapping his own hatchets. It looks as if it's going to be an\r\n          epic fight, but as Broch swings, Eric ducks and drives both\r\n          hatchets into the giant's ribs, killing him instantly.\r\n          They escape into the darkness.\r\n\r\n          118A OMITTED 118A\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            57\r\n\r\n          118B INT. STAIRWAY - NIGHT. (MOVED FROM 84A) 118B \r\n\r\n          Ravenna walks up the spiral staircase. She passes an old\r\n          woman who glances at her. She walks past a few steps, thinks\r\n          she hears a whisper, then turns on a heel.\r\n\r\n                         RAVENNA\r\n          What did you say?\r\n          Then she's right in her face --\r\n\r\n                         RAVENNA\r\n\r\n          WHAT DID YOU SAY!\r\n          The \"old woman\" just stares at her, shakes her head. There's\r\n          something in the woman's eyes that terrifies Ravenna. She\r\n          backs up, retreating, then scurries away.\r\n\r\n          118C INT.ANTE ROOM - ROYAL PALACE - NIGHT (MOVED FROM B4B). 118C\r\n\r\n           Ravenna sits alone, naked. Her spine stretches through her \r\n          taut skin. \r\n          In front of her sits the CROWN on a dark cushion, a matted\r\n          tuft of HAIR caught on the gilded edge. She stares at it,\r\n          then slowly raises her hand to a bald patch at the side of\r\n          her hair.\r\n\r\n                          \r\n\r\n                         RAVENNA\r\n\r\n          FINN!!!!!!!!!\r\n          The word echoes in the palace --\r\n\r\n          119 EXT. FENLAND VILLAGE - NIGHT 119\r\n\r\n           Finn, surrounded by smoke and fire, is beyond frustration.\r\n           He screams to the heavens in despair.\r\n\r\n                         120 OMITTED 120\r\n\r\n          121 EXT. RIVER BANK - DAY. 121\r\n\r\n          Eric and Snow White are far down river. They make their way to\r\n          the bank, drenched and exhausted. Snow White's hands shake -\r\n          distraught over the violence at the village. Eric looks at her\r\n          guiltily.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            57A\r\n\r\n                         121 CONTINUED: 121\r\n\r\n                         SNOW WHITE\r\n          Why did you come back?\r\n\r\n                         ERIC\r\n          I led them there. I am to blame.\r\n          Snow White looks at him with empathy. He's in pain, too.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            58\r\n\r\n                         121 CONTINUED: (2) 121\r\n\r\n                         ERIC\r\n          I will take you to Duke Hammond's.\r\n          Snow White slowly nods.\r\n          Eric lies back and looks up at the sun flickering through the\r\n          trees. It dances on his face and then --\r\n          A HUGE SHADOW blots out the light.\r\n          Before he can react, fists and boots lay into him. As he\r\n          protects his face, we catch glimpses of brutal figures in\r\n          battle masks. Eric kicks a couple of them away, but more of\r\n          them swarm over him, pinning him down in leg locks and choke\r\n          holds.\r\n          Snow White is treated just as roughly, powerful arms and legs\r\n          pinning her down. She bites one of her captors and he twists\r\n          her arms behind her back. A noose is slung around Eric's\r\n          ankles and he's hauled up - hanging upside down. Snow White,\r\n          also tied up, sits on the ground beside him.\r\n          A line of DWARVES stand before them and pull up their\r\n          grotesque BATTLE MASKS.\r\n          The dwarf leader, Beith glowers.\r\n\r\n                         BEITH\r\n          Well, well, well... the miscreant\r\n          huntsman.\r\n\r\n                         ERIC\r\n          Come on, Beith! Is this how you treat a\r\n          friend?\r\n          The dwarf leader, BEITH, glowers.\r\n\r\n                         BEITH\r\n          No, you horn beast, this is how I treat a\r\n          friend!\r\n          He smacks Eric with a gnarled stick.\r\n\r\n          122 MOVED TO 84C 122\r\n\r\n                         123 OMITTED 123\r\n\r\n                         124 OMITTED 124\r\n          124a EXT. WOODS - LATER - DAY. 124a\r\n          Snow White and the huntsman are still trussed up like chickens\r\n          now. The dwarves are grouped together, arguing and occasionally\r\n          throwing angry glances toward Eric. As they bicker the dwarves\r\n          slap and bite at each other - like animals.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            59\r\n          124a CONTINUED: 124a\r\n\r\n                         SNOW WHITE\r\n\r\n                         (WHISPERS)\r\n          What did you do to them?\r\n\r\n                         ERIC\r\n          I tried to collect the bounty on their\r\n          heads. A few times.\r\n\r\n                         SNOW WHITE\r\n          Is there no one you haven't wronged?\r\n          Eric nods at her. \"You.\"\r\n\r\n                         ERIC\r\n          But there's always tomorrow.\r\n\r\n                         GORT\r\n          Shut it, you hedge pig.\r\n          The Dwarf confab breaks up and they approach.\r\n\r\n                         BEITH\r\n          This is my lucky day, the puttock I loathe\r\n          most in the world lands in my lap.\r\n\r\n                         ERIC\r\n          It is your lucky day, Beith. I've got\r\n          enough gold to keep you in ale for a year.\r\n          Cut me down and I'll --\r\n          NION, Beith's right hand man and a fervent dwarf supremacist,\r\n          clips Eric around the ear.\r\n\r\n                         NION\r\n          Shut your ugly mug, huntsman. You had any\r\n          pennies they would have fallen out your\r\n          pockets by now.\r\n\r\n                         ERIC\r\n          It's hidden. Back there, in the woods. A\r\n          short distance.\r\n          They get the reference, don't like it. Nion slaps Eric again.\r\n\r\n                         NION\r\n          Pull the other one, you lying dangler.\r\n\r\n                         SNOW WHITE\r\n          Tell them the truth, huntsman.\r\n          The youngest of the dwarves, GUS, is beaming at Snow White with\r\n          his dirty teeth.\r\n\r\n                         SNOW WHITE\r\n\r\n                         (FIERCELY)\r\n          What are you looking at?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            59A\r\n          124a CONTINUED: (2) 124a\r\n\r\n                         GUS\r\n          Nothing, Miss. It's just... you been the\r\n          prettiest thing I ever did seen.\r\n          He smiles, almost sweetly, disarming her. Snow White looks at\r\n          her other captors now, noticing a blind dwarf, (MUIR), who sits\r\n          with his son (QUERT), also gazing at her.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            60\r\n          124a CONTINUED: (3) 124a\r\n\r\n                         ERIC\r\n          Just tell me what I've done wrong?\r\n\r\n                         BEITH\r\n          Tell me what you've done right first?\r\n\r\n                         ERIC\r\n          I saved this girl from the Queen. Out of\r\n          the goodness of my heart.\r\n          Snow White gives him a look. He calms her with a look of his\r\n          own.\r\n\r\n                         BEITH\r\n          Doesn't sound like you, huntsman.\r\n\r\n                         ERIC\r\n          People change.\r\n\r\n                         NION\r\n          People, not ruttish swine.\r\n          Nion gives Eric another smack around the head.\r\n\r\n                         MUIR\r\n          Quert?\r\n          Quert jumps to and helps his father as he makes his way to\r\n          Snow White. He touches her face and something happens in\r\n          him. His demeanor softens and the hint of a smile lands on\r\n          his lips. Meanwhile...\r\n\r\n                         GORT\r\n          So what's the verdict?\r\n\r\n                         COLL\r\n          Leave 'em to rot.\r\n\r\n                         DUIR\r\n          Yeah. Or skewer him and leave her to rot!\r\n\r\n                         COLL\r\n          That would work, too, but my way's\r\n          cleaner.\r\n          Note: Coll and Duir have this \"at each other but we're\r\n          comrades\" relationship. Coll also has an incessant cough.\r\n\r\n                         MUIR\r\n          No!\r\n          (a beat for emphasis)\r\n          She is destined.\r\n          They all trade looks. Muir is the spiritual leader of the\r\n          group and they dare not speak against him, even Beith.\r\n\r\n                         GORT\r\n          Destined?...\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            61\r\n          124a CONTINUED: (4) 124a\r\n\r\n                         GUS\r\n\r\n                         (SMITTEN)\r\n          She is.\r\n\r\n                         BEITH\r\n          Are you?\r\n\r\n                         SNOW WHITE\r\n          Do you hate the Queen?\r\n\r\n                         BEITH\r\n          Hate's a strong word.\r\n\r\n                         (BEAT)\r\n          But not strong enough in this case.\r\n\r\n                         SNOW WHITE\r\n          My father was King Magnus.\r\n          This carries weight with the group. Impressed.\r\n\r\n                         MUIR\r\n          No one listens to me.\r\n\r\n                         SNOW WHITE\r\n          If you accompany us to the Duke's castle\r\n          you will be paid handsomely.\r\n\r\n                         ERIC\r\n          We don't need their help.\r\n\r\n                         BEITH\r\n          You were already lost seeing that you\r\n          found us.\r\n\r\n                         GORT\r\n          How handsomely?\r\n\r\n                         SNOW WHITE\r\n          Your weight in gold. Each of you.\r\n          The dwarves trade glances, literally sizing each other up.\r\n\r\n                         ERIC\r\n          That's more than you offered me?!\r\n\r\n                         BEITH\r\n          Goodness of your heart, eh, Huntsman?\r\n\r\n                         DUIR\r\n          (whispers to Coll)\r\n          I get more than you.\r\n\r\n                         COLL\r\n          True, but because of your size you eat\r\n          and drink more, which costs more, so...\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            62\r\n          124a CONTINUED: (5) 124a\r\n\r\n                         BEITH\r\n          Alright, we'll take you, but the huntsman\r\n          can hang -\r\n\r\n                         SNOW WHITE\r\n          Both of us.\r\n          Eric looks surprised by her loyalty. So do the dwarves.\r\n          Suddenly Duir calls out:\r\n\r\n                         DUIR\r\n          Riders!\r\n          The dwarves look round to see a DOZEN SILHOUETTED HORSEMEN\r\n          appear on the crest of a DISTANT HILL.\r\n\r\n                         ERIC\r\n          Those are the Queen's men, Beith, better\r\n          decide quickly.\r\n\r\n                         BEITH\r\n          One dwarf's worth a dozen tallsters, I'll\r\n          take my time thank you --\r\n          He suddenly stops as dozens more RIDERS appear on the hill.\r\n\r\n                         ERIC\r\n          You were saying?\r\n\r\n                         BEITH\r\n          Cut him down! MOVE OUT!\r\n          Nion roughly cuts the line and the Huntsman drops to the\r\n          ground as Gus gently lifts Snow White. They all hurry down\r\n          the hill.\r\n\r\n                         125 OMITTED 125\r\n\r\n          126 EXT. ROCKY HILL/ CAVE - DAY. 126\r\n\r\n          The dwarves and their captives arrive at a rocky outcrop. Duir\r\n          and Coll pull back a large root exposing a cave entrance.\r\n\r\n                         ERIC\r\n          Ah, a short cut.\r\n          All 8 dwarf heads spin at him - pissed off. Enough with the\r\n          short jokes.\r\n          Nion raps Eric's knee with the flat of his dagger.\r\n\r\n                         ERIC\r\n          Owww!!!\r\n          Gus cuts Snow White loose.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            62A\r\n\r\n                         126 CONTINUED: 126\r\n          Nion hesitates, then reluctantly frees the huntsman. DUIR and\r\n          COLL lead the way into a cave. Gus pulls Snow White to safety\r\n          just as the enemy riders appear.\r\n\r\n          127 INT. CAVE COMPLEX - DAY. 127\r\n\r\n          From their hidden vantage point, Eric, Snow White, and the\r\n          dwarves watch the riders searching for them. Some gallop on, but\r\n          a small troop remain behind. Realizing they have no choice but\r\n          to retreat further, Duir and Coll signal and the dwarves follow\r\n          them deeper into the cave system.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            63\r\n\r\n          128 INT. CAVE - DAY. 128\r\n\r\n          A shaft of light pours through the cave roof high above, BATS\r\n          circling. The dwarves move effortlessly down the labyrinth but\r\n          Snow White and the huntsman have to squeeze through the cracks.\r\n\r\n          129 EXT. SANCTUARY - DAY. 129\r\n\r\n          Snow White and the huntsman emerge from the cave to see a\r\n          shimmering landscape of glistening moss and sunlight. It's like\r\n          a mirage. The air is filled with specks of pollen and a strange\r\n          HUMMING NOISE echoes like music. For Snow White, it's the most\r\n          beautiful sound she's ever heard. Next to her, Nion, snorts:\r\n\r\n                         NION\r\n          Blasted fairy music. Wish I had some wax to\r\n          stuff my ears.\r\n\r\n                         GORT\r\n          There's plenty of moss.\r\n          GORT scoops up a handful of moss and moulds himself some ear\r\n          plugs, sticking them in his ears. Snow White is still mesmerized\r\n          by the fairy music and the shimmering haze.\r\n\r\n                         SNOW WHITE\r\n          What is this place?\r\n          The huntsman looks just as dazzled.\r\n\r\n                         GUS\r\n          They call it Sanctuary, my lady. The\r\n          Enchanted Forest. It's the home of the\r\n          fairies.\r\n          And slowly the hazy curtain gives way to an enchanted forest --\r\n          as different to the dark forest as one could imagine --\r\n          Life grows everywhere -- LUSH GRASS, PROUD TREES COVERED IN\r\n\r\n          BUTTERFLIES, BUBBLING STREAMS, MOSS COVERED TORTOISES, FOXES AND\r\n\r\n          RABBITS SIDE BY SIDE, EXOTIC FLOWERS AND EVERYWHERE THE LIFE-\r\n\r\n                         GIVING POLLEN--\r\n          Snow White sees tiny figures flying behind the trees -- almost\r\n          too fast to spot -- the pollen following them in long trails --\r\n\r\n                         GUS\r\n          Fairies.\r\n\r\n                         GORT\r\n          Pests.\r\n          Of the other dwarves, only the blind MUIR seems to appreciate\r\n          the beauty around him, enjoying the vibrations on his face.\r\n\r\n                         BEITH\r\n          set up camp.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           64\r\n\r\n          130 EXT. STONE RUINS/ GROVE/ ENCHANTED FOREST - SUNSET. 130\r\n\r\n          HEARTY, SOULFUL SINGING. Seated among the ruins, the dwarves\r\n          sing a Celtic ballad as old as time, GUS playing the fiddle.\r\n          Coll and Duir sit away from the others, gazing out with the\r\n          thousand yard stare of hardened war veterans.\r\n\r\n                         COLL\r\n          That song takes me back to the battle of\r\n          Tylweth Gate. A small horde versus an army.\r\n          Pickaxes against swords and spears.\r\n\r\n                         DUIR\r\n          Them were the days.\r\n\r\n                         (BEAT)\r\n          What happened to your quailing cough?\r\n          Coll shakes his head, \"dunno\". The two of them smile then join\r\n          in the singing. A drunken GORT takes a swig of ale and staggers\r\n          over to GUS.\r\n\r\n                         GORT\r\n          Play louder, you whey-face, I can still\r\n          hear those harpy fairies.\r\n          He takes another swig and sings at the top of his voice, out of\r\n          tune, trying to drown out the humming of the unseen fairies.\r\n          Snow White and the huntsman look on, smiling.\r\n\r\n                         ERIC\r\n          Legend has it dwarves were created to\r\n          uncover all the riches hidden on earth. Not\r\n          just gold and precious stones, but the\r\n          beauty in people's hearts.\r\n\r\n                         SNOW WHITE\r\n          Really?\r\n\r\n                         ERIC\r\n          Ask me, they've lost the art if they ever\r\n          had it. When the Queen seized their mines\r\n          she stole their treasure but more than that\r\n          she stole their pride.\r\n          And as if to prove it, GORT and NION sing and share from a flask\r\n          of rum before they tumble to the ground-near Muir as the song\r\n          ends. Eric notices the tumble and chuckles.\r\n\r\n                         GORT\r\n          What are you pribbling at, longshanks?!\r\n\r\n                         ERIC\r\n          Nothing half-wit.\r\n\r\n                         GORT\r\n          I'm half of nothing.you canker blossom.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            64A\r\n\r\n                         130 CONTINUED: 130\r\n\r\n                         MUIR\r\n          Son?... Sing the one.\r\n          Perched on his stone, QUERT nods; sings a more CHEERFUL SONG.\r\n          Eric watches as Snow White walks over to Muir. Before she can\r\n          say anything...\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            65\r\n\r\n                         130 CONTINUED: (2) 130\r\n\r\n                         MUIR\r\n          That seat's not taken, if that's what you\r\n          were about to ask.\r\n          She sits on the log beside him. Gort and Nion eye her.\r\n\r\n                         SNOW WHITE\r\n          Thank you so much, sir.\r\n\r\n                         MUIR\r\n          It's only a log, no need to praise me.\r\n\r\n                         SNOW WHITE\r\n          No. For before. For defending me.\r\n\r\n                         MUIR\r\n          Your father was a good man. The kingdom\r\n          prospered. Our people prospered.\r\n\r\n                         SNOW WHITE\r\n          There were more of you?\r\n\r\n                         MUIR\r\n          Aye.\r\n          And that is all Muir will say on the subject. Gort fills in.\r\n\r\n                         GORT\r\n          One day the group you see before you went\r\n          down into the mine for a month long\r\n          shift. Gus was only a boy. When we came\r\n          back to the surface... nothing. The land\r\n          was black, everything, everyone... dead,\r\n          gone. We searched but...\r\n          Gort surprises himself by choking up a bit. Muir helps out.\r\n\r\n                         MUIR\r\n          That was the month your father died.\r\n\r\n                         SNOW WHITE\r\n          I'm so sorry.\r\n\r\n                         MUIR\r\n          As am I, princess. As am I.\r\n          GUS walks over to Snow White.\r\n\r\n                         GUS\r\n          I know I'm a bit spongy to look at, Miss,\r\n          but would you care to dance-with a little\r\n          'un?\r\n\r\n                         SNOW WHITE\r\n          I'd be honored.\r\n          Snow White gets up and dances with Gus as the song picks up.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            66\r\n\r\n                         130 CONTINUED: (3) 130\r\n          Nion and Gort watch her dance with Gus. Nion's not\r\n          impressed, leans in to Gort...\r\n\r\n                         NION\r\n          I don't trust her. And I don't believe\r\n          in her, no matter what Muir says.\r\n          Gort is still melancholy...\r\n\r\n                         GORT\r\n          Just you and me,... do you think there\r\n          are any of us left? Do you think perhaps\r\n          they were merely banished?\r\n\r\n                         NION\r\n          As long as the Queen's in charge we'll\r\n          never know.\r\n\r\n                         GORT\r\n          Well, maybe that's the point, isn't it?\r\n          (beat; out of the blue)\r\n          I feel funny. Queer almost.\r\n\r\n                         NION\r\n          Queer. Since when?\r\n\r\n                         GORT\r\n          How's your gout?\r\n          Nion rubs his leg.\r\n\r\n                         NION\r\n          Better.\r\n          Gort's look goes from Nion to Snow White.\r\n\r\n                         GORT\r\n          You don't think it has anything to do\r\n          with...\r\n\r\n                         NION\r\n          How much have you had to drink?!\r\n          The huntsman drains the last few drops of his rum when BEITH\r\n          approaches, sitting beside him gruffly.\r\n\r\n                         BEITH\r\n          Fleecing us of all our rum, eh huntsman?\r\n\r\n                         ERIC\r\n          What do you say, we let bygones be bygones?\r\n\r\n                         BEITH\r\n          Not yet, nut-hook. What's in it for you?\r\n          (off Eric's innocent expression)\r\n          I'm talking about the girl? Is it really\r\n          just the gold?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            67\r\n\r\n                         130 CONTINUED: (4) 130\r\n          Eric watches Snow White dancing with Gus, then shrugs.\r\n\r\n                         ERIC\r\n          I'm not sure, Beith. If I had any sense I'd\r\n          have abandoned her long ago.\r\n          Beith eyes Eric as he watches Snow White dance.\r\n\r\n                         BEITH\r\n          Muir says she's destined. Question is,\r\n          huntsman, for whom?\r\n          Gus and Snow White are still dancing.\r\n\r\n                         GUS\r\n          (As Snow White treads on his toes)\r\n          You don't mind me saying, you got two left\r\n          feet for a princess.\r\n\r\n                         SNOW WHITE\r\n          I don't mind at all, Gus. I haven't danced\r\n          in a long, long while.\r\n          She feels eyes on her - turns to see the huntsman watching her\r\n          with a slight smile. She smiles back and breaks away.\r\n\r\n                         SNOW WHITE\r\n          Do you mind, Gus?\r\n\r\n                         GUS\r\n          Not at all.\r\n          Snow White walks over to the Huntsman, holds out her hand.\r\n\r\n                         SNOW WHITE\r\n          You've taught me to fight, surely I can\r\n          teach you to dance.\r\n          Eric trades a look with Beith, who nudges him on. Eric\r\n          stands and they proceed to dance, with her teaching.\r\n\r\n                         SNOW WHITE\r\n          Palms up, head straight, look me in the\r\n          eyes. And...\r\n          The huntsman moves better than you'd imagine. His face even\r\n          softens as they both enjoy the dance.\r\n          Beith looks on with a smile.\r\n          130a OMITTED 130a\r\n\r\n          131 EXT. STONE RUINS/ GROVE/ ENCHANTED FOREST - DAWN. 131\r\n\r\n          Eric and the dwarves are asleep. Flowers have grown around them,\r\n          as if they've been asleep for months.\r\n          Cull and Duir sleep sitting up, back to back, at the ready.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            68\r\n\r\n                         131 CONTINUED: 131\r\n          Muir, also awake and smiling, sits against the log, his hand\r\n          rubbing his son's sleeping head.\r\n          Snow White sits amazed, drinking in the sights and sounds.\r\n          Animals emerge from the forest -- SQUIRRELS, BEAVERS, FOXES,\r\n          BIRDS. Slowly they make their way towards the ruins, gazing at\r\n          Snow White.\r\n\r\n          THE NIGHT SHIMMERS WITH FAIRY LIGHT AS THEY OBSERVE HER.\r\n          Snow White feels the light on her face and to her surprise, she\r\n          sees the two MAGPIES who watched over her at the castle. Two\r\n          BEAUTIFUL FAIRIES WITH THE DEER EYES slip out of the magpies'\r\n          bodies, beaming at her.\r\n          As Snow White sits up, they direct her to the woods WHERE A\r\n          DAZZLING LIGHT SHINES THROUGH A TREE. As she walks animals fall\r\n          in alongside her.\r\n          A little way away, Gus snores in his sleep. The golden light\r\n          crosses his face and he wakes up. As he opens his eyes, he\r\n          stares in wonder, then quickly wakes the other dwarves.\r\n          They all stare in amazement now, even the blind MUIR. Eric is\r\n          the last to wake up, wondering what the fuss is all about.\r\n          They rise and follow to --\r\n\r\n          AT THE TREE\r\n          She stands BENEATH THE GIANT TREE, facing a MAJESTIC WHITE HART.\r\n          The air around the mystical creature shimmers with a golden\r\n          light.\r\n\r\n                         BEITH\r\n          No one's ever seen it before.\r\n          The excited Muir grabs his son Quert by the arm.\r\n\r\n                         QUERT\r\n          The white hart bows before the princess,\r\n          father.\r\n          Sure enough, the HART lowers its head before Snow White. Muir's\r\n          face is lit up in the golden light, his blind eyes shining.\r\n\r\n                         MUIR\r\n          It's blessing her.\r\n\r\n                         ERIC\r\n          What are you talking about?\r\n\r\n                         MUIR\r\n          You have eyes, huntsman, but do not see.\r\n          You who have been with her the longest.\r\n          Eric doesn't understand.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           69\r\n\r\n                         CONTINUED:\r\n\r\n                         MUIR\r\n          She is life itself. She will heal the land.\r\n          She is the one.\r\n\r\n                         GORT\r\n          So you're saying she is destined?...\r\n          Muir can only shake his head.\r\n\r\n                         MUIR\r\n          No one listens to me.\r\n\r\n                         (BEAT)\r\n          Can't you feel it? Are you ailments not\r\n          gone? Gold or no gold, where she leads I\r\n          follow.\r\n\r\n                         GUS\r\n          Aye!\r\n          The other Dwarves trade looks. Nion, the last, shrugs.\r\n          As Snow White strokes the hart's neck, the golden light\r\n          brightens, engulfing her.\r\n\r\n          -- SUDDENLY AN ARROW FLIES THROUGH THE AIR -- AND PIERCES THE\r\n\r\n          WHITE HART'S FLANK.\r\n          The HART roars in pain and bolts. The fairies and animals\r\n          scatter in all directions now, their sanctuary violated.\r\n          Eric looks up to see ALDAN the Yakut emerging through the trees\r\n          on horseback, notching another arrow to his bow.\r\n          A FIERCE WIND rips through the sanctuary now, shadows spreading\r\n          where there was once light. Eric sees FINN appear on horseback,\r\n          looking like a demon god in the gathering darkness.\r\n          The huntsman grabs his axe. So do the dwarves, pulling on their\r\n          battle masks.\r\n          WILLIAM emerges through the trees to see ALDAN aiming his bow at\r\n          Snow White. He rides into the Yakut's horse, knocking him off\r\n          balance just as he fires --\r\n          The arrow narrowly misses Snow White, thudding into a tree. Gus\r\n          grabs her by the hand.\r\n\r\n                         GUS\r\n          Come on!\r\n          He runs with her into the forest.\r\n          Aldan turns on William furiously, drawing his curved sword, but\r\n          before he can swing the dwarves attack both men --\r\n          Eric only has eyes for Finn. They stare at each other in the\r\n          roaring wind, then Finn gallops into the forest after-Snow White\r\n          Eric RUNS in the same direction --\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            70\r\n\r\n                         CONTINUED: (2)\r\n          William fends off the furious dwarf attack then rides off in\r\n          pursuit of snow white --\r\n          Aldan sees him but is too busy defending himself against COLL\r\n          and DUIR to give chase --\r\n\r\n          132 EXT. ENCHANTED FOREST - DAY. 132\r\n\r\n          All around the forest the shadow of death is spreading. Gus\r\n          runs, dragging Snow White behind him. Galloping through the\r\n          trees, WILLIAM spots them up ahead, riding faster.\r\n\r\n          133 EXT. ANOTHER PART OF THE ENCHANTED FOREST - DAY. 133\r\n\r\n          Bow and arrow at the ready, Eric runs after Finn. All around him\r\n          the forest is darkening. He follows the sound of galloping\r\n          hooves when suddenly they stop. He stops too, notching an arrow\r\n          to his bow, peering into the gloom and listening.\r\n          There's a tense silence, then SUDDENLY HE HEARS A NOISE. He\r\n          spins around, ready to fire, when he sees it's only Finn's\r\n          riderless horse galloping past --\r\n          He realizes too late that it's a trick -- FINN EXPLODES OUT OF\r\n          THE DARKNESS, catching him a glancing blow with his sword --\r\n\r\n          134 EXT. STONE RUINS/ GROVE/ ENCHANTED FOREST - DAY. 134\r\n\r\n          Coll and Duir leap up at Aldan, trying to drag him off his\r\n          horse, but he's a ferocious fighter, driving them both back --\r\n\r\n          135 EXT. ENCHANTED FOREST - DAY. 135\r\n\r\n          William spots Snow White up ahead. She disappears into the\r\n          trees and he rides faster. She erupts from behind a branch and\r\n          pulls him off his horse. Gus races over and raises his axe --\r\n\r\n                         SNOW WHITE\r\n          Gus, no!\r\n          Gus's axe stops inches from William's eyes. Snow White\r\n          recognizes the young warrior, staring at him in surprise.\r\n\r\n                         SNOW WHITE\r\n          I saw you at the village.\r\n          William looks up at her, out of breath:\r\n\r\n                         WILLIAM\r\n          It's me. William.\r\n          Snow White stares in disbelief, tears of surprise welling in her\r\n          eyes. Gus looks even more confused, lowering his axe.\r\n          William slowly rises to his feet, gazing back at Snow White,\r\n          when THEY HEAR A TWIG SNAP --\r\n          Gus hears it too, spinning around --\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            71\r\n\r\n                         135 CONTINUED: 135\r\n          -- To see ALDAN with an arrow notched to his bow --\r\n\r\n                         GUS\r\n\r\n          PRINCESS!\r\n          Gus launches himself -- and takes the arrow meant for Snow\r\n          White. Before Aldan can load another arrow -- William fires an\r\n          arrow of his own, striking him in the chest. The Yakut topples\r\n          over, dead at last but still astride his horse.\r\n          Snow White falls to her knees in anguish, cradling the dying\r\n          Gus. He smiles weakly, holding her gaze, then whispers:\r\n\r\n                         GUS\r\n          I shan't leave you, Miss.\r\n\r\n          136 EXT. ANOTHER PART OF THE ENCHANTED FOREST - DAY. 136\r\n\r\n          Eric charges into Finn with a cry of rage. Finn deflects the\r\n          blow and hurls him back into the trees. Driven by fury, Eric\r\n          charges again, but Finn uses his anger against him, ducking\r\n          under the vicious blow and landing a brutal one of his own --\r\n          Eric crashes into another tree. His eyes are still full of\r\n          hatred but his body is weak. Finn smiles in contempt from a few\r\n          yards away.\r\n\r\n                         FINN\r\n          I captured many girls, but your wife was\r\n          special.\r\n\r\n                         ERIC\r\n          What?!\r\n\r\n                         FINN\r\n          She fought and then she begged. For her\r\n          life. Please?!!! You should know she\r\n          called for you. Your Sara.\r\n\r\n                         ERIC\r\n          How do you know her name?!\r\n          Eric is shocked, desperate.\r\n\r\n                         FINN\r\n          She told me. Just before I slit her\r\n          throat.\r\n\r\n                         -ERIC\r\n          Bastard... .-\r\n          Eric notices a fallen TREE TRUNK behind Finn -- dead branches\r\n          STICKING UP LIKE SPIKES. Finn steps toward him...\r\n\r\n                         FINN\r\n          Now you can look for her in the other world\r\n          and beg for her forgiveness.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            71A\r\n\r\n                         136 CONTINUED: 136\r\n          Finn smiles and raises his sword for the death blow -- when ERIC\r\n          LUNGES. He throws himself at Finn, his momentum carrying them\r\n          both into THE DEAD TREE'S SPIKED BRANCHES --\r\n          The branches pierce Finn's body, their tips digging into Eric's\r\n          flesh. Finn howls in agony --\r\n\r\n                         137 OMITTED 137\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            72\r\n\r\n          138 EXT. ENCHANTED FOREST - DAY. 138\r\n\r\n          Finn writhes, fighting to pull himself free of the branches but\r\n          Eric holds him down, even as the spikes dig into him, forcing\r\n          Finn's wounds to stay open - unable to heal.\r\n\r\n                         FINN\r\n           Sister -- heal me!! --\r\n\r\n                         139 OMITTED 139 \r\n\r\n          140 ENCHANTED FOREST - DAY. 140\r\n           -- the SHADOWY ENERGY swirls around Finn's wounds -- but as the\r\n           branches keep the wounds open, they cannot heal --\r\n\r\n          141 INT. THRONE ROOM - DAY. 141\r\n\r\n           Ravenna sits at her desk - she is small and alone in the \r\n           vastness of the hall.\r\n           She stares off into space, a quill in her hand - parchments laid\r\n           out before her.\r\n           Then suddenly her body convulses - the bottle of black ink \r\n           spills - dark tendrils of liquid seep across the papers and onto \r\n           the floor. \r\n\r\n                          RAVENNA\r\n           Finn ...no! \r\n           She falls to the floor - writhing. \r\n           She fights hard at first - but then begins to weaken - her \r\n           power fades as she ages. \r\n           Then she stops. \r\n\r\n                         RAVENNA\r\n          Forgive me, brother.\r\n\r\n          142 ENCHANTED FOREST - DAY. 142\r\n          Finn gasps as he feels Ravenna cut him off. Reacts in horror and\r\n          heartbreak as his wounds stop trying to heal.\r\n\r\n                         FINN\r\n          Sister...\r\n          Finn twitches for a moment, looks to Eric.\r\n\r\n                         FINN\r\n          I feel...\r\n          Then the light goes out of his eyes. He is finally dead.\r\n          Slowly, Eric pulls himself free of the branches cutting into his\r\n          flesh.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            72A\r\n\r\n          143 INT. THRONE ROOM - DAY 143\r\n\r\n           She has broken their connection. We pull away from her. \r\n           Ravenna's head is down, depleted, forlorn. Completely still. \r\n           Ink pools around her bony hands. But when she raises her head -- \r\n          We see conviction, hatred and determination.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            73\r\n\r\n                         143 CONTINUED: 143\r\n\r\n                         RAVENNA\r\n          You will pay. You will pay!!!\r\n\r\n          144 EXT. ENCHANTED FOREST - DAY. 144\r\n\r\n          Still bleeding from his wounds, Eric hurries back through the\r\n          forest until he sees Snow White and the seven dwarves gathered\r\n          around Gus's body, chanting a low prayer. Eric stares in\r\n          surprise, then notices William.\r\n\r\n                         ERIC\r\n          Who is this?\r\n          Beith is about to reply when William answers for himself.\r\n\r\n                         WILLIAM\r\n          My name is William. I am Duke Hammond's\r\n          son.\r\n\r\n                         (BEAT)\r\n          You look familiar.\r\n          Eric dodges a bit with --\r\n\r\n                         ERIC\r\n          What is the Duke's son doing riding with\r\n          the Queen's men?\r\n\r\n                         WILLIAM\r\n          I was looking for the princess.\r\n\r\n                         ERIC\r\n          Why?\r\n\r\n                         WILLIAM\r\n          To protect her.\r\n\r\n                         ERIC\r\n          The princess is well protected as you can\r\n          see.\r\n\r\n                         WILLIAM\r\n          And who are you?\r\n\r\n                         ERIC\r\n          The man who got her this far your lordship.\r\n\r\n                         WILLIAM\r\n          I'm grateful for your help but I will take\r\n          her from here.\r\n\r\n                         ERIC\r\n          You'll have to wait for your voice to break\r\n          before you give me orders -\r\n          William draws his sword in indignation and Eric draws his axe.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            74\r\n\r\n                         144 CONTINUED: 144\r\n\r\n                         ERIC\r\n          Anyone can draw steel, boy. It takes a man\r\n          to use it.\r\n          William is about to react when Snow White turns...\r\n\r\n                         SNOW WHITE\r\n          Leave him, huntsman. He's our friend.\r\n          He glares but his eyes glisten with tears. Snow White is\r\n          still bowed over Gus's body, sobbing, mourning.\r\n          The prayer chant ends. Nion spits with anger and walks away.\r\n\r\n                         NION\r\n          We need to convene.\r\n          They all follow him a few steps away, where they have\r\n          privacy.\r\n\r\n                         BEITH\r\n          What is it, Nion?\r\n\r\n                         NION\r\n          This is what happens when dwarves mix\r\n          with men. We always come out worse. We\r\n          have big hearts and we'll fight for any\r\n          cause -- but for what? For some new Queen\r\n          to call us runts and turn us out of our\r\n          homes again?\r\n\r\n                         GORT\r\n          I've nothing against the girl, but I'm\r\n          not willing to risk my life for her\r\n          either, like poor Gus.\r\n          Beith considers quietly, the other dwarves listening too.\r\n\r\n                         DUIR\r\n          (whispers to Coll)\r\n          Does this mean we're not fighting the\r\n          Queen?\r\n\r\n                         COLL\r\n\r\n                         (WHISPERS BACK)\r\n          Not sure yet.\r\n\r\n                         QUERT\r\n          What about the gold he promised us?\r\n\r\n                         NION\r\n          What use is gold if you're dangling by\r\n          your bony neck, you jackdaw?!\r\n\r\n                         BEITH\r\n          Aye, the Queen will flay us alive for\r\n          helping her!\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            75\r\n\r\n                         144 CONTINUED: (2) 144\r\n\r\n                         MUIR\r\n          The White Hart blessed the girl.\r\n          Nion shakes his head and rolls his eyes, but Beith listens.\r\n\r\n                         MUIR\r\n          Even our own legends speak of the\r\n          redeemer who will heal the land.\r\n\r\n                         GORT\r\n          That little mutton?\r\n\r\n                         MUIR\r\n          All the lions and wolves in the kingdom\r\n          have tried to defeat the Queen and\r\n          failed. Why not a mutton?\r\n          The dwarves stare at him incredulously.\r\n\r\n                         NION\r\n          Gus lost his life because of her!\r\n\r\n                         MUIR\r\n          No. He gave his life for her. As will I\r\n          if necessary. Look at us. Look at what\r\n          we've become.\r\n          They trade looks. They know where he's going with this.\r\n\r\n                         MUIR\r\n          We were once proud, now we pilfer and\r\n          drink and dream of when we didn't. I am\r\n          willing to die for a chance at becoming\r\n          the man I once was.\r\n          And that is the last word. Quert puts his arm around his\r\n          father and kisses his forehead. Beith and Gort trade a nod\r\n          and a smile.\r\n\r\n          145 EXT. STONE RUINS/ GROVE/ ENCHANTED FOREST - DAY. 145\r\n\r\n          QUERT sings a CELTIC MELODY OF LOSS as Gus is laid out on a\r\n          funeral pyre. All around him, THE BRIGHT COLORS OF THE\r\n          ENCHANTED FOREST HAVE FADED and there are no animals and\r\n          fairies to be seen. It's as if Ravenna's shadow has passed\r\n          here too. The tough, battle hardened dwarves shed tears like\r\n          children. Snow White looks heartbroken as Beith lights the\r\n          pyre. As the flames rise, a HAUNTING LAMENT carries us into\r\n          the next scene ---\r\n\r\n                         146 OMITTED 146\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            76\r\n\r\n          147 EXT. HILLS - DAY. 147\r\n\r\n          Quert's SONG CONTINUES as the group make their way across the\r\n          barren hills and into the mountains --\r\n\r\n          148 EXT. HIGHLAND HILLS - DAY. 148\r\n\r\n          William walks alongside Snow White, glancing at her tentatively.\r\n          He waits until the others are out of earshot.\r\n\r\n                         WILLIAM\r\n          I'm sorry I left you.\r\n          She looks over and sees the remorse in his eyes.\r\n\r\n                         SNOW WHITE\r\n          You didn't.\r\n\r\n                         WILLIAM\r\n          If I'd known you were alive I would have\r\n          come sooner.\r\n\r\n                         SNOW WHITE\r\n          We were children, William. You're here now.\r\n          They reach some steep rocks and Eric turns around, offering Snow\r\n          White his hand. She takes it and he helps her up the slope.\r\n          William looks on, feeling jealous.\r\n          Beith follows Duir and Coll up to the summit of the hill, then\r\n          looks at the surrounding peaks.\r\n\r\n                         BEITH\r\n          We'll rest the night at the top of this\r\n          hill.\r\n          148a INT. MIRROR CHAMBER - ROYAL PALACE - DAY. 148a\r\n          From above - Ravenna stands in the center of the room,\r\n          surrounded by ravens. She raises her arms and they take\r\n          flight, circling above her. She lowers her arms and their\r\n          swirling pattern lowers, until she is completely surrounded\r\n          by them - a tornado of ravens.\r\n          She has become them, and they her.\r\n\r\n          149 EXT. CAMP SITE/ MOUNTAINS - NIGHT. 149\r\n\r\n          A FIRE CRACKLES. The dwarves have set up camp. Coll and Duir\r\n          sit on a rocky outcrop, Coll braiding Duir's hair while Duir\r\n          sharpens his axe.\r\n\r\n                         COLL\r\n          That's not how you sharpen an axe. You\r\n          sharpen downward. Not upward..\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            76A\r\n\r\n                         149 CONTINUED: 149\r\n\r\n                         DUIR\r\n          My father taught me how to sharpen an\r\n          axe.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            77\r\n\r\n                         149 CONTINUED: (2) 149\r\n\r\n                         COLL\r\n          Well he taught you wrong.\r\n          He raises the axe, only half in jest.\r\n\r\n                         DUIR\r\n          You want to test it?\r\n          William watches Snow White warming herself by the fire, then\r\n          heads over to Eric, who is also keeping watch.\r\n\r\n                         WILLIAM\r\n          It's not my place to give you orders. I\r\n          misjudged you.\r\n          Eric looks up. He shakes William's hand.\r\n\r\n                         ERIC\r\n          And I you.\r\n          William looks over to where Snow White is.\r\n\r\n                         WILLIAM\r\n          We shared a childhood together, before she\r\n          was taken away. She hasn't changed. She has\r\n          that same light inside her. Surely you can\r\n          see it..\r\n          Eric looks at her.\r\n\r\n                         ERIC\r\n          You'd be blind not to.\r\n\r\n                         WILLIAM\r\n          If we can just get her to the castle, the\r\n          people.. The people will see it. She's\r\n          our only hope, Huntsman.\r\n\r\n                         ERIC\r\n          We'll get her to the castle. Don't worry\r\n          about that..\r\n\r\n                         WILLIAM\r\n          I've thought about her constantly. Every\r\n          time I closed my eyes. I can hardly\r\n          believe I've found her.\r\n\r\n                         ERIC -\r\n          You should tell her. She'd appreciate it.\r\n\r\n                         WILLIAM\r\n          I'm afraid to.\r\n\r\n                         ERIC\r\n          Not telling someone how you feel and living\r\n          with the regret is a lot worse.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            78\r\n\r\n                         149 CONTINUED: (3) 149\r\n\r\n                         150 OMITTED 150\r\n          150a EXT. MOUNTAINS - DAWN. 150a\r\n          Snow White sits on a rock, away from the camp, reflecting\r\n          quietly.\r\n          She stares out at the surrounding mountains and valleys when\r\n          she suddenly senses a presence behind her. She turns in alarm\r\n          -- but it's only William.\r\n          William smiles back gently and whispers...\r\n\r\n                         WILLIAM\r\n          Walk with me.\r\n          They walk into the silver birches.\r\n\r\n                         SNOW WHITE\r\n          Up here it's as if nothing's changed. The\r\n          world looks beautiful again.\r\n\r\n                         WILLIAM\r\n          It will be. When you are Queen.\r\n          Snow White turns, surprised by his words.\r\n\r\n                         WILLIAM\r\n          The people of this kingdom hate Ravenna\r\n          with their very fiber.\r\n\r\n                         SNOW WHITE\r\n          It's strange, but... I feel only sorrow\r\n          for her.\r\n          William is taken aback by this but pushes on.\r\n\r\n                         WILLIAM\r\n          Once people find out you're alive they\r\n          will rise up in your name.\r\n          Snow White stares back at him uncertainly.\r\n\r\n                         SNOW WHITE\r\n          It takes more than a name. I an not my\r\n          father, William.\r\n\r\n                         WILLIAM\r\n          You are his daughter. And rightful heir.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           78A\r\n          150a CONTINUED: 150a\r\n          He steps closer, gazing into her eyes devotedly.\r\n\r\n                         WILLIAM\r\n          If I had a choice, I would take you far\r\n          from here. And keep you safe by my side.\r\n          But I have a duty. And so do you.\r\n          They hold each other's gaze, Snow White still ridden with\r\n          doubt.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            79\r\n          150a CONTINUED: (2) 150a\r\n\r\n                         SNOW WHITE\r\n          How do I inspire? How do I lead men?\r\n\r\n                         WILLIAM\r\n          The same way you led me when we were\r\n          children. I followed you everywhere. Ran\r\n          when you called. I would have done\r\n          anything for you.\r\n          She looks touched by his words, smiling softly, trying to\r\n          make light of them.\r\n\r\n                         SNOW WHITE\r\n          That's not how I remember it.\r\n\r\n                         WILLIAM\r\n          No?\r\n\r\n                         SNOW WHITE\r\n          No...\r\n          They gaze into each other's eyes, close enough to kiss.\r\n\r\n                         SNOW WHITE\r\n          I remember we were always arguing. And\r\n          fighting. And...\r\n          She trails off, lost in his gaze. He stops, leans closer and\r\n          kisses her gently. They stay like that a moment, then William\r\n          pulls away, holding something in his hand. Snow White smiles\r\n          as she sees that it's an APPLE.\r\n          With a mischievous smile, William holds out the apple for\r\n          Snow White, just like he did when they were children.\r\n\r\n                         SNOW WHITE\r\n          I remember this trick.\r\n\r\n                         WILLIAM\r\n          (With mock innocence)\r\n          What trick?\r\n          Snow White holds his gaze, then snatches the apple from him\r\n          before he can take a bite, raising it to her lips with a\r\n           smile. As she bites --\r\n          150b OMITTED 150b\r\n          150c OMITTED 150c\r\n          150d EXT. CAMP SITE/ MOUNTAINS - DAWN. 150d.\r\n          Eric, startled,- awakens.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           80\r\n          150e EXT. MOUNTAINS - DAWN. 150e\r\n          As Snow White chews, a flicker of a smile crosses William's\r\n          face. Snow White stares curiously, then suddenly gasps,\r\n          struggling to breathe --\r\n          150f EXT. CAMP SITE/ MOUNTAINS - DAWN. 150f\r\n          Eric stands up, looks around, dwarves still asleep. He shakes\r\n          William, who wakes at the ready.\r\n          They walk into the trees and follow --\r\n\r\n          A SINGLE SET OF TRACKS.\r\n          150g EXT. MOUNTAINS - DAWN. 150g\r\n          Snow White staggers back and collapses in the snow, choking\r\n          from poison. Her eyes water and her vision blurs. The false\r\n          William kneels beside her and slowly she sees Ravenna's\r\n          features burning through, her cold blue eyes gleaming in\r\n\r\n                         TRIUMPH --\r\n          A SCREAM fills the air -- not Snow White but dozens of birds\r\n          shrieking in the sky above --\r\n\r\n          151-157 OMITTED 151-157\r\n\r\n          158 EXT. MOUNTAINS - DAY. 158\r\n\r\n          Eric and William hear the panicked bird cries and run --\r\n          158a EXT. SILVER BIRCH TREES/ MOUNTAINS - DAY. 158a\r\n          Snow White's limbs are petrified, frost spreading across her\r\n          cheeks -- but her eyes are open, taking in everything.\r\n          Ravenna leans over her, smiling.\r\n\r\n                         RAVENNA\r\n          You see, child, love always betrays us.\r\n          A sigh escapes Snow White's lips, condensing into steam.\r\n\r\n                         RAVENNA\r\n          By fairest blood it was done and only by\r\n          fairest blood can it be undone. You- were\r\n          the only one who could break the-spell\r\n          and end my life, and the only one pure\r\n          enough to save me.\r\n          She draws away, unwrapping her sacramental dagger.\r\n\r\n                         RAVENNA\r\n          You don't realize how lucky you are,\r\n          never to know what it is to grow old.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            81\r\n          158a CONTINUED: 158a\r\n          She raises the knife, about to cut out Snow White's heart -\r\n\r\n          WHEN SUDDENLY HER BODY SHATTERS INTO A FLOCK OF SHRIEKING\r\n\r\n                         RAVENS --\r\n          And now we see the HUNTSMAN STANDING THERE, AXE IN HAND, THE\r\n\r\n          RAVENS FLAPPING AROUND HIM --\r\n          William blasts with a sword at the screeching birds --\r\n          Eric goes after her now, swinging his twin hatchets. The\r\n          ravens scream and pluck at his eyes but he hacks at them\r\n          fiercely, William joining in, until the shrieking birds\r\n          finally take to the sky and vanish on the horizon.\r\n          Eric and William rush to Snow White's side now. The dwarves\r\n          arrive too, hurrying through the snow.\r\n          William cradles Snow White in his arms, trying to revive her,\r\n          but it's no use. Eric stares in dismay as he sees the poison\r\n          drain the color from her lips. He kneels down and gazes at\r\n          her. William turns to the dwarves.\r\n\r\n                         WILLIAM\r\n          What are you looking at? Help her!\r\n          The dwarves stare back at him gravely but don't respond. He's\r\n          desperate now, irrational --\r\n\r\n                         WILLIAM\r\n          You are dwarves, healers, save her!\r\n          He grabs the blind seer, MUIR, shaking him.\r\n\r\n                         WILLIAM\r\n          Do something!\r\n          Muir stares back at him with his empty eyes, tears glistening\r\n          in them.\r\n          William collapses in prayer, the light in Snow White's eyes\r\n          almost gone. Eric looks over, sees William's grief is as\r\n          great as his own, and finally stops fighting.\r\n          Snow White looks up at William as if she wants to say\r\n          something, then the light in her eyes goes out.\r\n          The dwarves are heartbroken. Eric looks dazed.\r\n          William leans down and kisses Snow White gently on the lips.\r\n          He pulls away,.hoping against hope. And then --\r\n          Nothing happens. She lies there, lifeless and white as the\r\n          falling snow.\r\n          On all the faces - realizing that she is truly gone.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            81A\r\n          158a CONTINUED: (2) 158a\r\n\r\n                         GORT\r\n          What do we do?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            82\r\n          158a CONTINUED: (3) 158a\r\n\r\n                          BEITH\r\n           What we promised.\r\n\r\n                         159 OMITTED 159\r\n\r\n          160 EXT. ROYAL CASTLE - DAY 160\r\n\r\n          A flock of ravens whips across the sky, swooping into --\r\n\r\n          161 INT. MIRROR ROOM - DAY. 161\r\n\r\n          The ravens burst into the mirror room and \"crash\" to the\r\n          ground. Their swirl becomes --\r\n          Ravenna, on all fours, looking worse for wear, surrounded by\r\n          dead ravens. The effort depleted her. She GROWLS as she\r\n          crawls toward the mirror.\r\n\r\n                         RAVENNA\r\n          What must I do?! Where is she?! Where\r\n          have they taken her?! Answer me!\r\n          The mirror just REFLECTS RAVENNA'S weary and aging face.\r\n\r\n                         RAVENNA\r\n\r\n          ANSWER ME!!!!\r\n          Nothing. Ravenna releases it all, looks up and quietly\r\n          pleads...\r\n\r\n                         RAVENNA\r\n          help me...\r\n\r\n                         MIRROR MAN\r\n\r\n                         (MOCKS HER)\r\n          \"Help me?\"...\r\n\r\n                         (BEAT)\r\n          There is nothing more pathetic than\r\n          grovelling desperation. You sicken me, my\r\n          Queen.\r\n          The mirror starts to ripple, distorting Ravenna's face into\r\n          something even more awful.\r\n          161a EXT. PLAINS NEAR CASTLE - DAY. 161a\r\n          A wide shot as the group carries Snow White toward the\r\n          castle.\r\n\r\n          162 EXT. DUKE HAMMOND'S STRONGHOLD - DAY. 162\r\n\r\n          Snow White's body is wrapped in a shroud, laid out on a\r\n          funeral board. William leads it with tears in his eyes. Eric\r\n          and the dwarves walk alongside the body, all lost in grief.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           82A\r\n          162a INT. DUKE HAMMOND'S CASTLE - DAY. 162a\r\n          Crowds move in to see and mourn the processional. Eric is\r\n          careful to lower his eyes a bit to keep from being\r\n          recognized.\r\n          162b INT. FUNERAL CHAMBER/ DUKE HAMMOND'S CASTLE - DAY. 162b\r\n          Torchlight flickers. Snow White's body is laid out on a\r\n          funeral bier, her face angelic in death.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           63\r\n\r\n          163 INT. GENERAL'S TENT - COURTYARD - NIGHT. 163\r\n\r\n          Tent flaps open. William stands before Duke Hammond and his\r\n          council of LORDS, arguing his case with fierce passion --\r\n\r\n                         WILLIAM\r\n          She died for us! For our cause! We cannot\r\n          hide behind these walls and watch this\r\n          land die with her!\r\n\r\n                         DUKE HAMMOND\r\n          Your grief clouds your judgement, my son.\r\n\r\n                         WILLIAM\r\n          My grief makes me see clearly, father.\r\n          163a INT. FUNERAL CHAMBER/ DUKE HAMMOND'S CASTLE - NIGHT. 163a\r\n          Eric steps from the shadows up to Snow White's body, flask in\r\n          hand. Drunk.\r\n\r\n                         ERIC\r\n          Here you are. Where it ends. Dressed Up\r\n          to pretty.\r\n          He takes another pull from the flask.\r\n\r\n                         ERIC\r\n          Like you're asleep; about to wake-up and\r\n          give me more grief. Am I right?\r\n          The he touches her arm. Feels the fabric of her funeral\r\n          dress. Looks at her face and breaks a bit - losing the\r\n          drunken swagger and speaking with her as if she was still\r\n          alive.\r\n\r\n                         ERIC\r\n          You deserved better.\r\n          And then he answers her...\r\n\r\n                         ERIC\r\n          She was my wife, princess. That was your\r\n          question that went unanswered. Sara was\r\n          her name. When I came back from the wars\r\n          I carried with me the stench of death and\r\n          the anger of the lost. I wasn't worth\r\n          saving. But she did so anyway. I loved\r\n          her more than anything or anyone. And\r\n          then I let her out of my sight and she\r\n          was gone and I became myself again. A\r\n          self I never cared for. Until you. You\r\n          remind me of her. Her spirit. Her\r\n          heart. And now you, too, are gone. You\r\n          both deserved better. And I'm sorry to\r\n          have failed you as well.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           83A\r\n          163a CONTINUED: 163a\r\n          Snow White lies pale and motionless on the bier. Eric reaches\r\n          down and gently brushes a strand of hair off her face.\r\n\r\n                         ERIC\r\n          You will be a Queen in heaven now...\r\n          He leans down and kisses her lips.\r\n\r\n                         ERIC\r\n          And sit among the angels.\r\n          He finally turns and leaves the chamber, tossing the flask\r\n          aside, disgusted with himself.\r\n          As we listen to his footsteps fade we hold on Snow White's\r\n          beautiful face. For a long time she stays perfectly still,\r\n\r\n                         THEN --\r\n          Her lips part ever so slightly, and she lets out an almost\r\n          inaudible whisper of breath.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            84\r\n          163a CONTINUED: (2) 163a\r\n           Snow White's eyes open, gazing up at the ceiling, her\r\n           thoughts far away. There's a strange calm about her now, a\r\n           quiet acceptance, as if she knows what she must do.\r\n\r\n          164-168 OMITTED 164-168\r\n\r\n                         169 OMITTED 169\r\n          169a OMITTED 169a\r\n\r\n           169B EXT. NEAR THE CASTLE GATES - DAY (MOVED FROM 171) 169B\r\n\r\n          Eric, carrying all his gear, eyes down, strides toward the\r\n          gate and a clean getaway.\r\n\r\n                         ERIC\r\n          Open the gate.\r\n\r\n          PERCY (O.S.)\r\n          Huntsman!\r\n          Eric stops. He's been recognized. Percy catches up to him.\r\n          They share a look and Eric sighs.\r\n\r\n                         PERCY\r\n          Yes, I recognized you.\r\n          Eric sighs.\r\n\r\n                         PERRY\r\n          We have no quarrel with you. Not anymore.\r\n          You returned the princess to us. And for\r\n          that...\r\n          He hands over a heavy sack of gold. Eric takes it, weighs it\r\n          in his hand. God does he need it, but...\r\n\r\n                         ERIC\r\n          Keep your money.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            85\r\n\r\n          169B CONTINUED: 169B\r\n          He hands it back and turns for the now open gate. He exits\r\n          the castle and as the doors begin to close --\r\n          SHOUTS OF JOY. Eric spins, wanders back to see what the\r\n          commotion is all about.\r\n\r\n                         170 OMITTED 170\r\n          170a OMITTED 170a\r\n\r\n          171 INT. GENERAL'S TENT - NIGHT. 171\r\n\r\n          The council session continues. Duke Hammond stares at\r\n          William gravely.\r\n\r\n                         DUKE HAMMOND\r\n          My duty is to protect the people who come\r\n          to me for help. I will defend them with\r\n          my last drop of blood but I will not\r\n          abandon these walls. I cannot afford to\r\n          believe in miracles.\r\n          He suddenly stops as the SHOUTS outside the tent get louder.\r\n          He goes to the flap, opens it to see --\r\n          Snow White , still dressed in her white funeral robes, stands\r\n           at the top of the stairs that leads down into the courtyard.\r\n          171a EXT. COURTYARD - DUKE HAMMOND'S CASTLE 171a\r\n          Everyone comes out of their tents and stands beneath Snow\r\n          White. Her heart pounding, she makes her way down the\r\n          stairs. All are riveted by the sight of her, as if they're\r\n          looking on an angel or a living miracle.\r\n          Eric makes his way back into the courtyard and he, too, is\r\n          stunned as he slides in next to the dwarves in the crowd.\r\n\r\n                         BEITH\r\n          It's a miracle!\r\n          Duke Hammond, embarrassed and still stunned by the sight of\r\n          her, walks up the stairs to greet her. Several Generals\r\n          follow him but stay a few steps below them. Hammond takes\r\n          her by the hands as they speak.\r\n\r\n                         DUKE HAMMOND\r\n          Your highness...\r\n          (He can't believe his eyes)\r\n          We thought you...\r\n\r\n                         SNOW WHITE\r\n          No, my lord.\r\n          William, below, stares at her in joy while his father still\r\n          looks dazed.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            86\r\n          171a CONTINUED: 171a\r\n\r\n                         DUKE HAMMOND\r\n          You must rest -\r\n\r\n                         SNOW WHITE\r\n          I have rested long enough.\r\n          Her voice is gentle but full of quiet conviction.\r\n\r\n                         SNOW WHITE\r\n          I am ready to ride by your side, my lord,\r\n          when you face the Queen in battle.\r\n          The Duke looks speechless for a moment.\r\n\r\n                         DUKE HAMMOND\r\n          There will be no battle, your highness.\r\n          The best thing you can do for your people\r\n          is stay safe behind these walls.\r\n\r\n                         SNOW WHITE\r\n          That is all I thought to do when I\r\n          escaped. But I have come to learn there\r\n          is no peace while others suffer. Have you\r\n          not learned that?\r\n\r\n                         DUKE HAMMOND\r\n          The Queen cannot be defeated. She cannot\r\n          be killed. And therefore there can be no\r\n          victory.\r\n          Snow White hesitates, her heart pounding, then replies:\r\n\r\n                         SNOW WHITE\r\n          I can vanquish her. Defeat her. I am the\r\n          only one. She told me so herself.\r\n          Duke Hammond starts to object, but Snow White's eyes and, now\r\n          her feet, lead her down the stairs to her people. When she\r\n          reaches the last step - now at their level - she speaks...\r\n\r\n                         SNOW WHITE\r\n          I have been told that I represent you,\r\n          that it is my place to inspire you. That\r\n          is wronct. I am not a Queen, not a\r\n          leader, not a warrior.\r\n          Absolute silence in the courtyard as people, lords, knights\r\n          hang on her every word.\r\n\r\n                         SNOW WHITE\r\n          You represent me, who I've become - your\r\n          hopes,: your courage, your will - inspires\r\n          me.\r\n\r\n                         (BEAT)\r\n          I have also been told my place is not to\r\n          fight but to stay here, safely behind\r\n          these walls. I will not.\r\n\r\n                         (MORE)\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           86A\r\n          171a CONTINUED: (2) 171a\r\n           SNOW WHITE (cont'd)\r\n          I hold life sacred, even more since I've\r\n          tasted freedom, but I've lost my fear of\r\n          death.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            87\r\n          171a CONTINUED: (3) 171a\r\n          Heads nod, people murmur approval. She has them in the palm\r\n          of her hand.\r\n\r\n                         SNOW WHITE\r\n          If Ravenna comes for me, I will ride to\r\n          meet her. And if she doesn't, I will ride\r\n          to meet her.\r\n          (looks back at Generals)\r\n          Alone if I must.\r\n          (back to people)\r\n          But if you would join me, I will gladly\r\n          give my life for you. For this land and\r\n          its people have lost too much.\r\n          Eric and the dwarves couldn't look prouder.\r\n          Duke Hammond stares at her for a moment, then BOWS. A beat,\r\n          then William follows, then all the Lords and Knights. His\r\n          eyes fixed on Snow White, Eric bows too. Then Beith. Then\r\n          Muir and his son, Quert. Then Coll and Duir. And finally even\r\n          Gort and Nion.\r\n          Snow White stands alone, overwhelmed by the faith of the\r\n          kneeling warriors, and the responsibility on her shoulders.\r\n          171b INT. MIRROR CHAMBER - ROYAL PALACE - NIGHT. 171b\r\n          Ravenna raises her head to look into the mirror.\r\n\r\n                         MIRROR MAN\r\n          Yes, my Queen! Yes!!!!\r\n          The Mirror Man laughs because Ravenna's face is younger, her\r\n          energy has returned and we see why when --\r\n          WE PULL BACK to reveal several CRONES, young only minutes\r\n          before, now old and lying on the floor.\r\n          Ravenna smiles, girding herself for the fight to come.\r\n\r\n                         172 OMITTED 172\r\n\r\n                         173 OMITTED 173\r\n\r\n                         174 OMITTED 174\r\n\r\n                         175 OMITTED 175\r\n\r\n                         176 OMITTED 176\r\n\r\n                         177 OMITTED 177\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           87A\r\n          177a OMITTED 177a\r\n          177b EXT. CASTLE - NIGHT. 177b\r\n          The army is amassed and ready to leave the gates. Snow White,\r\n          in full armor, sits astride a white horse, her coat of chain\r\n          mail glittering in the torchlight. She looks like an angel,\r\n          bearing her fathers standard.\r\n          Eric rides up next to her. She is happy to see him.\r\n\r\n                         ERIC\r\n          Back from the dead and instigating the\r\n          masses.\r\n\r\n                         SNOW WHITE\r\n          So the Huntsman fights for something\r\n          other than himself.\r\n\r\n                         ERIC\r\n          Only if you have need of a brutish\r\n          soldier.\r\n          She smiles, moved. He turns his horse to full back, but\r\n          before he leaves...\r\n\r\n                         ERIC\r\n          You look fetching in mail.\r\n          A bugle sounds and --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            88\r\n          177c EXT. CASTLE - NIGHT. 177c\r\n          The Duke's army pours out of the great gate, their torches\r\n          blazing in the night. From above, it looks like a river of\r\n          lava coursing through the valley. Duke Hammond roars at the\r\n          top of his. voice, urging his riders on, and now we see their\r\n          vengeful fire spreading across the plain.\r\n\r\n          178 EXT. QUEEN'S BALCONY - ROYAL PALACE - NIGHT. 178\r\n\r\n          Ravenna and the general on the balcony. All around, soldiers\r\n          and Guards scurry to look busy lest they draw her wrath\r\n          (though some can't help but notice her aging appearance.\r\n          Ravenna sweeps away a map held out to her.\r\n\r\n                         RAVENNA\r\n          I don't need a map to see you've failed\r\n          me, fool, your face is map enough!\r\n\r\n          BLACK KNIGHT GENERAL\r\n          Yes, my Queen. \r\n\r\n                         RAVENNA \r\n          Where are they now?\r\n\r\n          BLACK KNIGHT GENERAL\r\n          A half day's march away. Every hour their\r\n          numbers grow. Rebels, peasants and\r\n          deserters rally to them wherever they -\r\n\r\n                         RAVENNA\r\n          Deserters?\r\n\r\n          BLACK KNIGHT GENERAL\r\n          Yes, my Queen.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            89\r\n\r\n                         178 CONTINUED: 176\r\n          BLACK KNIGHT GENERAL (cont'd)\r\n          They say the King's standard flies again.\r\n          And now Ravenna understands -- Snow White.\r\n\r\n                         RAVENNA\r\n          Let them come. Let them break their\r\n          hearts and skulls on these castle walls\r\n          and bring my prize to me. You must not\r\n          harm her. I need her heart -- still warm\r\n          with blood.\r\n          As she strides away. To soldiers --\r\n\r\n                         RAVENNA\r\n          Victory comes!\r\n          178a EXT. PLAINS - WIDE - DAWN. 178a\r\n          Hammond's army thunders toward the castle. And then they\r\n          arrive at --\r\n\r\n          179 EXT. SAND DUNES OVERLOOKING RAVENNA'S CASTLE - DAWN. 179\r\n\r\n          Horses crest the hill. And now, all around Snow White, we see\r\n          her army -- not just Duke Hammond's men -- but REBELS --\r\n          PEASANTS -- WOMEN -- all willing to follow her.\r\n          Eric and William ride nearby. One of the Duke's commanders\r\n          arrives to brief him.\r\n\r\n                         DUKE'S COMMANDER\r\n          My lord, we only have a few hours before\r\n          the tide comes in. Not long enough to\r\n          breach the castle walls. We'll either be\r\n          completely exposed or drowned by the ocean.\r\n\r\n                         DUKE HAMMOND\r\n          Is there any other way in? Tunnels? Caves?\r\n\r\n                         DUKE'S COMMANDER\r\n          No, my lord.\r\n          Gloom descends on the gathering.\r\n\r\n                         SNOW WHITE\r\n          If we are at the portcullis when the sun\r\n          clears the horizon it will be open.\r\n          They all look at her.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            90\r\n\r\n                         179 CONTINUED: 179\r\n\r\n                         DUKE HAMMOND\r\n          But how?\r\n\r\n          180 EXT. SEA/ SEWAGE TUNNEL/ RAVENNA'S CASTLE - DAWN. 180\r\n\r\n          An unmistakable brown sludge pours out of a sewage tunnel\r\n          into the sea. It is the same sewers where Snow White escaped.\r\n          We hear the sound of splashing oars and grumbling:\r\n\r\n          FROM INSIDE THE SEWAGE TUNNEL\r\n          We look out at the faces of the dwarves, peering inside.\r\n\r\n                         NION\r\n          We're promised gold and volunteer for\r\n          manure. How low has the dwarf race sunk?\r\n\r\n                         BEITH\r\n          Hi-Ho boys. Off to work.\r\n          And they begin to crawl inside.\r\n\r\n          181 EXT. BALCONY - RAVENNA'S CASTLE - DAWN. 181\r\n\r\n          Ravenna stares out. On the distant cliffs she sees the banners\r\n          of the rebel army. A ray of sunlight pours through the clouds,\r\n          lighting up the tiny figure of Snow White.\r\n\r\n                         RAVENNA\r\n          Come to me.\r\n\r\n          182 EXT. CASTLE SEWERS - DAWN. 182\r\n\r\n          Coll and Duir wade through the sewage, their axes held up in\r\n          front of them, not a flicker of emotion on their faces.\r\n\r\n                         DUIR\r\n          Seven dwarves against an army.\r\n\r\n                         COLL\r\n          I like them odds.\r\n          Behind them, Beith covers his nose from the stench, Gort and\r\n          Nion look like they're about to be sick, and Muir and his son\r\n          bring up the rear, the brown slime almost at Quert's mouth.\r\n\r\n                         QUERT\r\n          Times like this I wish I was taller.\r\n\r\n          183 EXT. SAND DUNES OVERLOOKING RAVENNA'S CASTLE - DAWN. 183\r\n\r\n          Crashing waves break against the rocks, washing over the sand.\r\n          Duke Hammond stares at the RISING TIDE in concern.\r\n\r\n                         DUKE HAMMOND\r\n          We don't have much time.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            91\r\n\r\n                         183 CONTINUED: 183\r\n\r\n                         SNOW WHITE\r\n          Then we should ride now. They'll have the\r\n          portcullis up by the time we arrive.\r\n          Duke Hammond considers, then raises his sword. Snow white\r\n          glances at the huntsman. He breaks rank and rides closer to her.\r\n          There's a tense silence, then the Duke BRINGS DOWN HIS SWORD and\r\n          his riders charge down the dunes.\r\n\r\n          184 EXT. BALCONY - RAVENNA'S CASTLE - DAWN. 184\r\n\r\n          Ravenna stares out confidently, her eyes still fixed on Snow\r\n          White's distant banner.\r\n\r\n          185 EXT. CASTLE COURTYARD - DAWN. 185\r\n\r\n          The trap door in the courtyard rises and we see Beith's head pop\r\n          up, his expert eyes scanning the courtyard until they spot the\r\n          portcullis. Ravenna's guards hurry past without seeing him,\r\n          taking their positions on the battlements. Beith slips back down\r\n          into the sewer.\r\n\r\n                         BEITH\r\n          The gatehouse is fifty yards away to left.\r\n          Half a dozen guards and fifty armed\r\n          soldiers. Archers on either side.\r\n\r\n                         DUIR\r\n          (Pulling out a huge knife)\r\n          Give us a couple of minutes.\r\n\r\n                         COLL\r\n          Four tops.\r\n\r\n          186 EXT. BEACH - DAWN. 186\r\n\r\n          Snow White rides across the dunes. All around her, riders gallop\r\n          along the surf, waves crashing around them. Ravenna's castle\r\n          comes into the view, the portcullis still down.\r\n\r\n          187 EXT. COURTYARD/ CASTLE - DAWN. 187\r\n\r\n          Coll and Duir move stealthily through the busy courtyard, so\r\n          small and fleet they're almost invisible.\r\n\r\n          188 EXT. BALCONY/ RAVENNA'S CASTLE - DAWN. 188\r\n\r\n          Ravenna looks on as her archers take their positions and her\r\n          artillery men load missiles onto their trebuchets.\r\n\r\n          189 EXT. BEACH - DAWN. 189\r\n\r\n          Snow White suddenly sees tiny dots of firelight on the castle\r\n          walls. Eric realizes what they are and rides faster. The\r\n          pinpoints of light soar up in the air, growing larger and\r\n          brighter, until we realize they're FIERY MISSILES. Eric forces\r\n          Snow White's horse out of the way as a fireball explodes yards\r\n          from her.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            92\r\n\r\n                         189 CONTINUED: 189\r\n          Fire rains down on the Duke's army now, panic spreading in the\r\n          ranks. Snow White takes her father's banner and holds it aloft,\r\n          rallying the men and riding on.\r\n\r\n          190 EXT. GATEHOUSE - DAWN. 190\r\n\r\n          Two unsuspecting guards collapse outside the gatehouse. Before\r\n          the other guards can react, Coll and Duir are on them, moving\r\n          fast and hard, the assault over in seconds.\r\n\r\n          191 EXT. SEWER MANHOLE/ COURTYARD - DAWN. 191\r\n\r\n          Beith sees Coll and Duir signal from outside the gatehouse.\r\n\r\n                         BEITH\r\n          Come on!\r\n\r\n          192 EXT. BEACH - DAWN. 192\r\n\r\n          Waves crash over the rocks. Fireballs explode in the sand. Snow\r\n          White sees men falling all around her, tears welling in her\r\n          eyes, but she never falters. As William rides on, he sees the\r\n          castle walls through the smoke, the portcullis still down.\r\n\r\n          193 INT. GATEHOUSE -- DAWN. 193\r\n\r\n          The GUARDS in the gatehouse look over as the door splinters and\r\n          the dwarves come crashing through in their battle masks. Even\r\n          though they're outnumbered, the seven fight like demons -- until\r\n          the enemy are subdued.\r\n\r\n          194 EXT. BEACH -- DAWN. 194\r\n\r\n          On the castle walls, archers replace the trebuchets. Snow White\r\n          holds up her shield to protect herself from the sea of arrows.\r\n          Up ahead, the portcullis is still down, Duke Hammond's forces\r\n          circling back as they're trapped against the walls.\r\n\r\n                         WILLIAM\r\n          You must turn back!\r\n\r\n                         SNOW WHITE\r\n          I gave my word I would stand with them!\r\n\r\n          195 INT. GATEHOUSE -- DAWN. 195\r\n\r\n          A huge pulley controls the portcullis. Beith, Gort and Nion draw\r\n          their pickaxes while Coll and Duir tie up the guards.\r\n\r\n                         BEITH\r\n          Now let's see how this works! --\r\n          With a mighty blow of his axe, Beith shatters the chains holding\r\n          up the pulley. The counter weights go flying down and the\r\n          portcullis comes shooting up -- then suddenly stops -- JAMMED.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           93\r\n\r\n          196 EXT. BEACH -- DAWN. 196\r\n\r\n          The Duke's army are still circling the gates, stones and hot oil\r\n          pouring down on them from above. Arrows slam into Snow White's\r\n          shield but she still refuses to retreat.\r\n\r\n          197 INT. GATEHOUSE -- DAWN. 197\r\n\r\n          Beith peers down at the jammed counter-weights in frustration\r\n          when he hears a fierce cry. GORT jumps on the counter-weight,\r\n          trying to bring it down. Nion follows, yellingatthetopofhis\r\n          voice. Duir puffs up his proud chest and leapsontoo--\r\n\r\n          198 EXT. BEACH -- DAWN. 198\r\n\r\n          Snow White sees the portcullis shoot up now, the dwarves hanging\r\n          onto the counterweights for dear life. Smiling in relief, she\r\n          gallops through the open gates with Eric and William.\r\n\r\n          199 EXT. CASTLE COURTYARD -- DAWN. 199\r\n\r\n          The Duke's riders charge into the courtyard. ARCHERS fire at\r\n          them from every corner of the castle, but they raise their\r\n          shields and leap off their horses, forming a defensive wedge.\r\n\r\n          200 EXT. BALCONY/ RAVENNA'S CASTLE - DAY. 200\r\n\r\n          From her balcony above the portcullis, Ravenna watches her own\r\n          men being slaughtered; she enjoys the spectacle (Ravenna does\r\n          not care one bit about those men). Her eyes are locked on Snow\r\n          White.\r\n\r\n                         RAVENNA\r\n          Let her come to me...ALIVE!\r\n          Ravenna's soldiers are merely there to hold Snow White's army\r\n          back. She has planned the whole thing, calculated every move.\r\n\r\n          201 EXT. CASTLE COURTYARD - SAME - DAY. 201\r\n\r\n\r\n           TORTOISE FORMATION _ SNOW WHITE FIGHTS _ SNOW WHITE LOOKS UP TO\r\n\r\n          RAVENNA.\r\n\r\n           SNOW WHITE GOES THROUGH FIRE TO THE SIDE DOOR. -\r\n\r\n          202 EXT. BALCONY/ RAVENNA'S CASTLE - DAY. 202\r\n\r\n          Like a spider waiting in her web, with no concern about her\r\n          soldiers' situation, Ravenna remains calm and calculated.\r\n          Ravenna turns around and leaves the balcony to the throne\r\n          room.\r\n\r\n          203 EXT. CASTLE COURTYARD - SAME - DAY. 203\r\n\r\n          SNOW WHITE rushes into the castle. As soon as she passes the\r\n          door a dozen of Ravenna's men come outside closing the trap.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            93A\r\n\r\n                         203 CONTINUED: 203\r\n          Now Eric, William and their men have to fight the road block.\r\n          In the courtyard, Ravenna's men are losing more and more ground.\r\n          Snow White's army will win.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            94\r\n\r\n                         203 CONTINUED: (2) 203\r\n           Eric and William fight like demons, twice as fast, twice as\r\n          strong . They MUST pass.\r\n\r\n                         204 OMITTED 204\r\n\r\n                         205 OMITTED 205\r\n\r\n                         206 OMITTED 206\r\n          206a OMITTED 206a\r\n          206b OMITTED 206b\r\n\r\n          207 INT. THRONE ROOM - DAY. 207\r\n\r\n          Snow White storms into the throne room. She is breathing\r\n          heavily, a mix of fear and determination.\r\n\r\n          KNOCK... KNOCK... KNOCK\r\n          The raven claw ring, taps, resonating through the halls.\r\n          Ravenna stands at the top of the stairs, the mirror room \r\n          behind her. \r\n          Snow White approaches. \r\n\r\n                         SNOW WHITE\r\n          It ends today... I have come for YOU!\r\n\r\n                         RAVENNA \r\n\r\n                         (MOCKINGLY)\r\n          My rose has returned \r\n          (looking at Gus' small sword)\r\n          .with a thorn!\r\n          207a OMITTED 207a\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            95\r\n          207a CONTINUED: 207a\r\n\r\n                         208 OMITTED 208\r\n\r\n                         209 OMITTED 209\r\n           209a INT. THRONE ROOM - DAY. 209a\r\n           Eric, William and a dozen men rush in.\r\n           Ravenna smiles, raises her hand. \r\n\r\n                          RAVENNA\r\n           I'll show you thorns!\r\n           In a terrifying tremor, the black ceiling of the throne room \r\n           starts to shatter into millions of shards. \r\n          Snow White turns back to see William, Eric and Hammond's men - \r\n          the shards fall down like razor blades. \r\n          The men try to protect themselves. Some are caught out and \r\n          skewered to the stone floor. Ravenna looks down at them in \r\n          complete satisfaction. \r\n\r\n                          \r\n          The millions of black shards circle around Eric and his men, \r\n          completely blocking them and keeping them away from Snow\r\n          White.\r\n\r\n                         RAVENNA\r\n          Come! ... Avenge your father, who was too\r\n          weak to raise his sword.\r\n          The millions of shards assemble themselves into three seven \r\n          foot tall, razor sharp creatures. The DARK FAERIES: Ravenna's \r\n          ultimate soldiers.\r\n          Snow White looks at Eric and William - unable to help her. \r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            96\r\n          209a CONTINUED: 209a\r\n          Eric, William and the other men are completely surrounded by\r\n          these creatures; they move so fast. Eric tries to step away\r\n          from them... to no avail.\r\n          One of the creatures rises in front of William.\r\n          William tries to slash the creature.\r\n          His sword goes through and the creature reforms itself right\r\n          away. The Dark Faerie opens it's mouth and screeches.\r\n          William gets smashed aside, saved only by his shield. The \r\n          Dark Faerie grabs the soldier right behind William and sends\r\n          him crashing into the wall. \r\n          Snow White walks up the stairs, torn and powerless.\r\n          She looks at Eric one last time. \r\n          Eric looks back as he fights off a Dark Faerie with his two \r\n          shields. He knows he does not have much time left but he is\r\n          ready to make the final sacrifice.\r\n\r\n                         ERIC\r\n          (battle cry!)\r\n          Kill her!\r\n          209b INT. MIRROR CHAMBER - DAY. 209b\r\n          Snow White braces herself and promptly follows Ravenna into\r\n          the mirror room. Now Snow White is exactly where Ravenna\r\n          wants her to be.\r\n          The two women circle each other like heavyweight boxers.\r\n\r\n                         SNOW WHITE\r\n          Ten years you locked me away!\r\n          Ravenna seems to relish this. \r\n\r\n                         RAVENNA\r\n          And every day, every hour led you to this\r\n          ,moment. It burned inside you. It drove\r\n          you forward, and here you are..\r\n          Listening only to her heart, Snow White lunges towards \r\n          Ravenna and tries - strikes at her with her sword.\r\n          Ravenna steps aside and with very little effort - throws her \r\n          to the other side of the room.\r\n\r\n                         RAVENNA\r\n          That's it. Fight. Fight for your land...\r\n          for your loss and for Hope! \r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           96A\r\n          209b CONTINUED: 209b\r\n          Snow White slams and slides across the floor, she stops under\r\n          the archway at the top of the stairs. She is dazed. \r\n          Ravenna treads on her back, then grabs her hair, pulls her \r\n          head up to see William and his men being massacred. \r\n\r\n                         RAVENNA\r\n          Watch them die. You gave them hope and\r\n          they believed you. You have lead them to\r\n          their deaths. How foolish your followers.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n           97\r\n          209c INT. THRONE ROOM - SAME - DAY 209c\r\n          Eric is trying to stay alive. He rams a Faerie into a pillar.\r\n          Shredding the stone, the Faerie explodes in shards and\r\n          reforms immediately behind Eric.\r\n          Grabbing the first man in sight, the Faerie throws the poor\r\n          soldier to the other side of the room.\r\n          on the opposite side another Faerie slides faster than the\r\n          blink of an eye, grabs the man in flight extending it's\r\n          cutting limbs and claws the soldier to his death.\r\n          It is like carnage in slow motion.\r\n          209d OMITTED 209d\r\n          209e MOVED TO 209B 209e \r\n\r\n                          \r\n\r\n          210 INT. THRONE ROOM - SAME - DAY. 210\r\n\r\n          William is being overrun by a school of shards. The shards\r\n          shape up into a Faerie taking William up high. In a violent\r\n          arm blow, the Faerie projects William onto the banquet table\r\n          six feet lower. The table shatters in splinters, William\r\n          bouncing like a rag doll.\r\n          Spinning around on it's way down, the Faerie skewers a\r\n          soldier and impales another one into a pillar. The Faerie\r\n          drags him ten feet up, tearing and digging deep into the\r\n          stone column.\r\n\r\n          211 INT. MIRROR CHAMBER - DAY. 211\r\n\r\n           Enraged, Snow White jolts her body and frees herself from \r\n          Ravenna's grasp.\r\n          She swings her sword at Ravenna. She parries every attack \r\n          with her bare hands.\r\n          Snow White is breathless. One more strike... but Ravenna\r\n          blocks it again, and this time she doesn't let go.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            97A\r\n\r\n                         211 CONTINUED: 211\r\n\r\n                         RAVENNA\r\n          (face to face with Snow White)\r\n          You were never ready for this princess!\r\n          Snow White struggles to get out of her lock. Ravenna is too\r\n          strong.\r\n          Snow White's wrist is twisted. She holds her sword tight but\r\n          can't use it. Ravenna forces the twist. Her fragile bones\r\n          crack. \r\n          Snow White screams in pain.\r\n          The sword drops on the ground.\r\n\r\n                         SNOW WHITE\r\n\r\n                         (GRUNTING)\r\n          I will... defeat... you... I am the \r\n          only...\r\n\r\n                         RAVENNA\r\n          Oh... please!\r\n          Ravenna back hands Snow White, sending her crashing to the\r\n          wall. SLAM! Cuts on her face. \r\n          Ravenna looms closer, through the fire in the middle of the \r\n          room. She stands IN the fire, unaffected.\r\n          For Snow White it is a vision of pure hell. So much power, so\r\n          much hate.\r\n\r\n                         RAVENNA\r\n          I have lived many lives. Ravaged entire\r\n          kingdoms, I have been given powers you\r\n          can't fathom. You cannot defeat ME? \r\n          .you are but a child! \r\n\r\n                         (LAUGHING)\r\n          Ravenna's skin blisters and heals. Ravenna raises her arms\r\n          and black shards start to cover the walls behind her...\r\n          entombing them in darkness... the trap closes. \r\n\r\n                         RAVENNA \r\n          But you are right... it is over. \r\n          Ravenna's laughter pierces Snow White like a dagger. \r\n          She feels powerless and lost, spitting blood and exhausted. \r\n          What else can she do?\r\n          Snow White stands up, stumbles, her right arm limp, blood \r\n          dripping down her face. \r\n          She stares at Ravenna, she won't back down... she will never\r\n          back down.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            97B\r\n\r\n          212 INT. THRONE ROOM - SAME - DAY. 212\r\n\r\n          William, stumbling upon the dead bodies of his comrades, sees\r\n          the shards starting to obstruct the entry of the mirror room.\r\n          He runs towards it. Eric sees him and goes for it too.\r\n          Behind William and in front of Eric, a Dark creature shapes\r\n          up. William doesn't see it.\r\n          The Faerie claws William from behind through his armor,\r\n          stopping him still and sending him backwards against a pillar\r\n          like a stone ricochet.\r\n          The Faerie spins it's head 180 degrees and goes from turning\r\n          its back to Eric... to facing the huntsman.\r\n          Eric stops and tries to pull back.\r\n          The Faerie powers up gathering shards from another creature,\r\n          doubling in size and density.\r\n          Like a fire hose of black shards, the Dark Faerie unloads a\r\n          stream of razor blades at Eric.\r\n          Eric digs his heels in... slowly grinds and slides on the\r\n          floor, double shields up.\r\n          The shields are being shredded. One shield gives way\r\n          completely torn slicing Eric's arm.\r\n          Eric has one shield left. He kneels down... it is a matter of\r\n          seconds.\r\n\r\n          213 INT. MIRROR CHAMBER - DAY. 213\r\n\r\n          Ravenna approaches and grabs Snow White by the throat,\r\n          squeezing hard.\r\n          Snow White is chocking.\r\n\r\n                         RAVENNA\r\n          I will never stop... I will give this\r\n          wretched world the Queen it deserves...\r\n          Ravenna slams Snow White down onto the stone floor next to\r\n          the mirror altar.\r\n          Snow White stretches for her sword as Ravenna approaches. \r\n          Ravenna un-sheaths her dagger. \r\n\r\n                         RAVENNA\r\n\r\n                         (TO HERSELF)\r\n          A life .for a life.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            97C\r\n\r\n                         213 CONTINUED: 213\r\n          Snow White tries to reach her sword with her left hand, but\r\n          it is too far. She tries to drag herself a little closer... \r\n          still too far.\r\n          Ravenna straddles Snow White, raises her dagger above her\r\n          head - smiling, relishing the imminent death blow. The black\r\n          tomb has closed in around them.\r\n          Eric watches - despair wrought on his face -- as the knife \r\n          falls. \r\n\r\n                          \r\n\r\n                         RAVENNA\r\n          (in a spell incantation)\r\n          By fairest blood it is done!\r\n          Ravenna strikes... in the blink of an eye Snow White blocks\r\n          her strike, reaches for her dagger and plunges it into\r\n          Ravenna's chest, just as the huntsman taught her.\r\n          Ravenna gasps, locks eyes with Snow White. \r\n\r\n                         SNOW WHITE\r\n          (whispers to Ravenna)\r\n          By fairest blood... it is undone!\r\n          Ravenna looks down. Three drops of blood fall onto Snow\r\n          White's armor.\r\n\r\n          BOOM... BOOM... BOOM\r\n          Ravenna stares in shock and disbelief. \r\n\r\n                         RAVENNA \r\n\r\n          NO! \r\n          She pulls out the dagger, her face starts to age. \r\n          Ravenna is aging at an incredible pace. Her body gives way\r\n          and she slumps to the floor, below the mirror. \r\n          She looks at the mirror above her, gasping, reaching out, her \r\n          pale eyes looking for a friend, a miracle... but nothing. \r\n          The black shards that entombed the room start to shatter and \r\n          fall to the floor.\r\n\r\n          214 INT. THRONE ROOM - SAME - DAY. 214\r\n\r\n          William is on the ground, out of strength and has given up\r\n          the fight. A dark creature is slowly close to reaching\r\n          William's face with his sharp claws as William tries to hold\r\n          the creature's arm with his bare hands, severely bleeding.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            97CA\r\n\r\n                         214 CONTINUED: 214\r\n          The Faeries have slowed down dramatically. Eric grabs a sword\r\n          on the ground and slices the Faerie in front of him... the\r\n          Faerie shatters.\r\n          William looks at Eric, in desperation begging for help. The\r\n          two men lock eyes. A silent understanding.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            97D\r\n\r\n                         214 CONTINUED: (2) 214\r\n          Eric throws his sword and blows the other Dark Faerie in\r\n          pieces, releasing William.\r\n          A silent pact has been made at this moment between the two\r\n          men.\r\n          The remaining Dark Creature freezes. Eric and William are\r\n          barely alive.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            98\r\n\r\n          215 INT. MIRROR CHAMBER - DAY. 215\r\n\r\n          Snow White approaches Ravenna and kneels beside her, Ravenna\r\n          is weak. She ages dozens of years within seconds, her face\r\n          shows no anger, no hate, just a strange understanding.\r\n\r\n                         SNOW WHITE\r\n          Why this? Why all of this?\r\n\r\n                          \r\n          Snow White, overwhelmed by compassion, places her hand on\r\n          Ravenna's chest. Ravenna puts her own wrinkled hand on Snow\r\n          White's.\r\n          Ravenna smiles. She gently taps on Snow White's... in a \r\n          strange and affectionate motherly way.\r\n\r\n                          \r\n          Eric and William, exhausted and battered climb the steps of \r\n          the mirror chamber. It is over. \r\n          Ravenna stares up at Snow White's face in a shining halo of\r\n          light above her from the ceiling.\r\n\r\n                         RAVENNA\r\n          (whispering to Snow White)\r\n          See child,... we are bound.\r\n\r\n                         SNOW WHITE\r\n          (whispers to Ravenna calming)\r\n          It will be all right...\r\n          Ravenna whispers incomprehensible words with a peaceful smile\r\n           on her face. The clouds move in the disc of light above Snow \r\n           White. The light falls over Ravenna's face. \r\n           The light fades out of her eyes and she dies. \r\n\r\n                          \r\n\r\n          216 EXT. CLOISTER GARDENS/ CASTLE - DAY. 216\r\n\r\n           In the cloister gardens, a blossom flowers on the apple tree and\r\n           the world is born again --\r\n\r\n                         217 OMITTED 217\r\n\r\n                         218 OMITTED 218\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            98A\r\n\r\n          219 INT. MIRROR CHAMBER/ CASTLE - DAY. 219\r\n\r\n           In death, Ravenna's beautiful blue eyes are wide open, fixed on\r\n           the halo of light that surrounds Snow White's head.\r\n\r\n                          DISSOLVE TO:\r\n\r\n                         220 OMITTED 220\r\n\r\n                         221 OMITTED 221\r\n\r\n          222 INT. CATHEDRAL - DAY 222\r\n\r\n\r\n                          SNOW WHITE\r\n           Backlit in a golden hue. A crown is placed on her head.\r\n           We're in...\r\n          Packed for the coronation. Duke Hammond and Bishops surround\r\n          her. Snow White smiles and looks out at all assembled - her\r\n          subjects, her friends, the people she's come to know and love\r\n          - meeting the eyes of Rose, looking young and beautiful again\r\n          -- Anna and Lily -- the seven dwarves, who all wipe away\r\n          tears.\r\n          She sees William off to the side, smiling, looking on\r\n          adoringly. But her eyes continue through the crowd, looking\r\n\r\n                         FOR --\r\n          Eric, in the very back of the cathedral, near the door.\r\n          Their eyes meet, as if they're the only two in the room.\r\n          This lasts several moments until --\r\n\r\n                         BEITH\r\n          Hail to the Queen!\r\n          And then the huntsman smiles and leaves.\r\n\r\n                         ERIC V/0\r\n          The land was healed, and the rightful Queen\r\n          brought an age of peace and prosperity.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n            99\r\n\r\n          223 EXT. CASTLE - DAY 223\r\n\r\n          We drop down from the castle to find the huntsman, on horseback\r\n          heading toward us.\r\n\r\n          ERIC (V.0.)\r\n          As for the huntsman...\r\n          Eric goes under the village arch, back toward the forest.\r\n\r\n          ERIC (V.O.)\r\n          He returned to the forest where he\r\n          belonged.\r\n\r\n\r\n\n\n\n\nSnow White and the Huntsman\nWriters :   Evan Daugherty  John Lee Hancock  Hossein Amini\nGenres :   Action  Adventure  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:35:58.162795"}