{"title": "Soldier", "film_link": "/Movie Scripts/Soldier Script.html", "script_link": "/scripts/Soldier.html", "info_raw": "\n\nSoldier Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  David Webb Peoples\nGenres  Action  Drama  Sci-Fi\nScript Date : October 1997\nMovie Release Date : October 1998\n\nRead \"Soldier\" Script\n\n\n", "script": "\n\n\n\n                             SOLDIER\n\n\n\n\n                            Written by\n\n                        David Webb Peoples\n\n\n\n\n                                                  REVISED DRAFT\n                                                  October 2, 1997\n\n\n     INT.  HOSPITAL NURSERY - NIGHT\n\n     BABIES in bassinets, isolettes, incubators.  BABIES sleeping,\n     BABIES blinking, BABIES cooing, BABIES chirping, BABIES\n     squalling.\n\n     It's the SQUALLING BABIES, the ones with pinched faces and tiny\n     bunched fists, that seem to interest the TWO ANONYMOUS MEN in\n     Military Uniforms.  (Their anonymity is assured by the angles\n     from which they are seen; they are hands, they are feet, they are\n     the backs of heads.)\n\n     A lone NURSE watches them grimly as they make their \"selections,\"\n     marking the cribs of the most active, noisy BABIES with X's.\n\n                                                       CUT TO:\n\n     EXT.  VAN/HOSPITAL - NIGHT\n\n     ANGLE ON VAN DOORS slamming shut on a dozen squalling BABIES in\n     tiered red cribs.\n\n     ANGLE ON THE VAN pulling away from the loading dock of the large\n     hospital as a date is SUPERED over the scene...\n\n                                1992\n\n                                                       CUT TO:\n\n     INT.  CAGE/BASEMENT ROOM - DAY OR NIGHT\n\n     Vicious teeth, savage snarls, tearing flesh as three fierce\n     fighting DOGS battle a single WOLVERINE in large steel cage.\n\n     The cage is in the middle of a gloomy windowless room surrounded\n     by twenty TWO-YEAR-OLDS seated on folding chairs and dressed in\n     identical gray overalls.  As the TWO-YEAR-OLDS watch the battle,\n     amazement on their innocent faces, a date appears SUPERED over\n     the scene...\n\n                                1994\n\n     WE DISCOVER in the shadows more ANONYMOUS MEN (and WOMEN), some\n     of them in Military Uniforms, observing the children.\n\n                                                       CUT TO:\n\n     INT.  A WINDOWLESS CEMENT ROOM - DAY OR NIGHT\n\n     It's creepy:  the same children two years older, milling about a\n     bare cement room, apparently unsupervised.  They ought to look\n     cute, but somehow these joyless FOUR-YEAR-OLDS look slightly\n     sinister, all of them wearing drab uniforms and military burr-cut\n     hair.  Again a date is SUPERED over the scene --\n\n                                1996\n\n     -- just as an AGGRESSIVE FOUR-YEAR-OLD approaches a PASSIVE FOUR\n     YEAR-OLD seated on the floor and kicks him.\n\n     It's a harmless child's kick.  But then, as the DATE DISAPPEARS,\n     he kicks the PASSIVE FOUR-YEAR-OLD again.  And again.\n\n     The servo-motor in a remote video camera mounted high on the wall\n     WHINES slightly as the camera pans to the record the action.\n\n                                                       CUT TO:\n\n     INT.  WINDOWLESS \"CLASSROOM\" - DAY OR NIGHT\n\n     Puzzles.  Fingers fit shapes into holes.  The puzzles aren't fun\n     puzzles; they're obviously tests of intelligence or dexterity or\n     both.  SIX-YEAR-OLDS now, the boys perform in a grim room under\n     fluorescent lights as more ANONYMOUS MEN and WOMEN in polished\n     shoes and sharply creased military slacks cruise the aisles,\n     observing.\n\n     As a date appears SUPERED over this scene...\n\n                                1998\n\n     WE NOTICE one of the SIX-YEAR-OLDS is becoming familiar to us.\n     TODD.  We NOTICE his intense eyes as he dexterously manipulates\n     a puzzle.\n\n                                                       CUT TO:\n\n     EXT.  FIELD - DAY\n\n     Behind a cyclone fence topped with curlicues of razor wire, the\n     boys, now TEN-YEAR-OLDS, are marching in formation under the\n     supervision of a (faceless) DRILL SERGEANT.  Again a date is\n     SUPERED over the scene...\n\n                                2002\n\n                                                       CUT TO:\n\n     INT.  GYMNASIUM - DAY\n\n     Fourteen-year-old TODD is doing bench presses in shorts while all\n     around him his FOURTEEN-YEAR-OLD COMRADES work out with weights\n     in a very grim and spartan gym that resembles a sinister\n     concentration camp more than the yuppie spas of the 20th Century.\n     The date appears SUPERED over the scene...\n\n                                2006\n\n                                                       CUT TO:\n\n     EXT.  OBSTACLE COURSE/MONTAGE - DAY\n\n     The FOURTEEN-YEAR-OLDS, TODD among them, jump, roll, dive, crawl,\n     swim, and rappel through a brutal course featuring:\n\n     vertical wooden walls,\n\n     fast moving rapids,\n\n     tangles of barbed wire,\n\n     steep rock faces,\n\n     and finally a jungle of dangling chains with tiny circular\n     \"platforms\" about eight inches in diameter every ten feet.\n     FOURTEEN YEAR OLDS bloody each other with pugil sticks and padded\n     cudgels while they swing twenty feet above the ground.  One of\n     them is knocked off, plummets downward.  CRUNCH!\n\n                                                       CUT TO:\n\n     EXT.  SNOW COVERED LANDSCAPE - DAY\n\n     Long even strides, two inches of snow.  Breathing hard, the\n     SIXTEEN-YEAR-OLDS now lope through hills and woods in shorts and \n     T-shirts, their breath coming in steamy blasts as the date is\n     SUPERED over the scene...\n\n                                2008\n\n     This a brutal cross country run under a grim sky in bitter cold\n     weather, but the SIXTEEN-YEAR-OLDS are super-fit, their faces\n     hard and without expression, their eyes as cold as snake eyes.\n\n     Except for the STRAGGLER, a lone boy who's bringing up the rear, \n     obviously in trouble, gasping for air, struggling, struggling, \n     struggling to keep his feet...\n\n     ANGLE ON A HILL where ANONYMOUS OBSERVERS, all in military dress, \n     watch.\n\n     ANGLE ON THE STRAGGLER, unable to keep his feet, going down,\n     gasping.  With fearful eyes, he looks toward the hill where he\n     knows the OBSERVERS are.\n\n     ANGLE ON THE PACK, sixteen SIXTEEN-YEAR-OLDS not looking back,\n     even as a single SHOT rings out.  TODD doesn't even blink, just\n     keeps running.\n\n                                                       CUT TO:\n\n     EXT.  SHOOTING RANGE - DAY\n\n     Suddenly, out of nowhere, a scary mechanized pop-up target, a\n     MILITARY FIGURE, erupts from the long grass, weapon pointing.\n     Before the weapon can flash a laser bean, AUTOMATIC FIRE ravages\n     the target and it disappears back into the grass.  The boys,\n     EIGHTEEN-YEAR-OLDS now, are wearing combat gear and carrying\n     automatic weapons as they advance through a sloping field of tall\n     grass.\n\n     Different sophisticated TARGETS pop up urgently, sometimes close, \n     sometimes far, some MOVING rapidly on tracks.\n\n     The EIGHTEEN-YEAR-OLDS expertly mow down menacing MILITARY\n     FIGURES while holding their fire when ANIMAL TARGETS or UNARMED\n     CIVILIANS and CHILDREN appear.\n\n     The eighteen-year-old on point is RILEY, a muscular redhead.\n     TODD is right behind him as a date is SUPERED over the scene...\n\n                                 2010\n\n     Suddenly multiple TARGETS appear, charging.\n\n     BUDDA BUDDA BUDDA!  First TARGET down!\n\n     RILEY, panning for the next target, holds fire, passes over two \n     MOTHERS HOLDING CHILDREN, pans for a nearby SOLDIER TARGET.  But\n     the SOLDIER TARGET zips behind the MOTHERS HOLDING CHILDREN,\n     taking cover, weapon pointed at RILEY.\n\n     For half a second RILEY hesitates!\n\n     BUDDA BUDDA BUDDA!  TODD blazes away, mercilessly blowing away\n     the MOTHERS HOLDING CHILDREN TARGET and the SOLDIER TARGET.\n\n                          THE MAIN TITLE APPEARS\n\n     as the ROAR OF GUNS gives way to MUSIC...\n\n                                                       CUT TO:\n\n     INT.  PROCESSING ROOM - DAY\n\n     Skillful hands operate a tattoo pen, stenciling an insignia and\n     a number on the left side of RILEY'S face over the cheekbone.\n     His cheek says RILEY, L.B., his face reveals nothing as...\n\n                          OPENING CREDITS BEGIN\n\n     The next face is TODD.  The skillful hands with the tattoo pen go\n     to work on his face, marking, stenciling the skin as...\n\n                       OPENING CREDITS CONTINUE\n\n     Then the tattoo artist's bands finish with TODD and move on to\n     the next MAN, leaving TODD staring straight ahead, his cheek\n     tattooed, his face like carved stone, his eyes as unfathomable as\n     the eyes of a statue as THE OPENING CREDITS CONCLUDE.\n\n                                                       CUT TO:\n\n     EXT.  JUNGLE - DAY\n\n     Machinegun fire, SOLDIERS in cammies moving through lush tropical \n     growth.\n\n     A mortar explodes, a SOLDIER is engulfed in shrapnel.  As the\n     smoke clears, the SOLDIER screams mindlessly like a siren.  This\n     is real war, not training.\n\n     A title and date appear on the screen, saying...\n\n                       2011, THE BOLIVIAN WAR\n\n     As the title fades, we glimpse TODD advancing at a crouch through\n     smoke and enemy fire, blazing away at the unseen enemy.  Sweaty\n     and smudged, his uniform torn and stained with blood, TODD\n     reveals nothing on his stone face.  But he's clearly\n     unintimidated by the death of his screaming comrade as we...\n\n                                                       CUT TO:\n\n     EXT.  PINE WOODS - DAY\n\n     Automatic weapons CHATTER as TODD struggles through thick snowy\n     woods, half-carrying a bloody comrade barely recognizable as\n     RILEY.  Bullets spatter bark and leaves as TODD and RILEY take\n     cover behind a fallen log.  A date and title appear, SUPERED over\n     the action...\n\n                    2012, THE MONTANA \"INCIDENT\"\n\n     RILEY is nearly unconscious.  TODD glances at his own wound, a\n     savage opening in his side.  He considers the torn flesh as \n     dispassionately as a man checking a flea bite.\n\n     Bullets whiz around the wounded man as we...\n\n                                                       CUT TO:\n\n     EXT.  DESERT, VILLAGE - DAY\n\n     Sunbaked landscape, a burning village, ENEMY CORPSES sprawled\n     here and there, burned or horribly mutilated by artillery fire. \n     SUPERED over the corpses, a date and title...\n\n                    2014-2016, THE SAUDI CAMPAIGN\n\n     WE DISCOVER TODD, RILEY, and several OTHER SOLDIERS, exhausted,\n     parched, in torn and bloodied uniforms, sharing a single canteen\n     under the blazing sun.  War is hard work!\n\n                                                       CUT TO:\n\n     EXT.  LAUNCH PAD - DAY\n\n     A fury of flames, the THUNDER of ignition as huge rocket engines\n     lift a space vehicle off the launching pad and propel it skyward.\n\n     EXT.  OUTER SPACE\n\n     Profound SILENCE!  The space vehicle that the rocket propelled is\n     a weathered looking military spaceship gliding through the\n     blackness of outer space like a huge shark.  A date and title\n     appear SUPERED over the scene...\n\n                          2017, TANNHAUSER GATE\n\n     As the title fades away in the eerie silence, we...\n\n                                                       CUT TO:\n\n     EXT.  ANOTHER PLANET - NIGHT\n\n     A huge moon looms in the blackness above a barely visible\n     landscape...\n\n                    2020, THE ARGENTINE SECTOR\n\n     SIX SOLDIERS stagger through the rough terrain in pressure suits\n     and plexi helmets, breathing from tanks.\n\n     Sudden automatic fire staggers the lead SOLDIER.  His helmet is\n     pierced, air and blood erupt from the hole in his face plate.\n\n     The SERGEANT, his futuristic \"chevrons\" on his helmet, signals\n     the men to take cover, starts to return fire.  As a flare\n     illuminates the battlefield, we RECOGNIZE the sergeant through\n     his visor.  It's TODD.\n\n                                                       CUT TO:\n\n     EXT.  EXTRATERRESTRIAL CITY - DAY\n\n     Bombed out!  Buildings turned to rubble, smoking ruins, rain.  An\n     extra-terrestrial city ravaged by war to such a degree that it\n     bears an uncanny resemblance to Dresden/Earth in 1945 after the\n     fire-bombing!  The architecture, even in ruins, recalls old\n     Europe, and the streets are narrow, as in before (or after)\n     automobiles.\n\n     Bursts of AUTOMATIC FIRE, occasional MORTAR BLASTS.  A spooky\n     battle between unseen SOLDIERS is taking place in seemingly\n     deserted streets and alleyways.  And SUPERED over the gloomy\n     scene...\n\n                        THE THIRD DRESDEN MOON\n                (1.16 Earth atmos, acceptable oxygen)\n\n     CRACK!  CRACK!  CRACK!  Shots!\n\n     Suddenly a terrified MOTHER dashes along the street, a screaming\n     BABY in her arms, looking for shelter.\n\n     A CIVILIAN MAN pops out of a doorway, pulls her to safety.\n\n     REVEAL TODD, watching from the shell of a once proud building.\n\n     TODD'S POV of four ENEMY SOLDIERS running at a crouch among the\n     rubble.\n\n     ANGLE ON TODD watching them scurry into a cellar door.  TODD\n     turns and gives a hand signal.\n\n     ANGLE ON RILEY twenty yards away, hidden behind exposed\n     machinery, acknowledging the signal and, along with a THIRD\n     SOLDIER, advancing toward the cellar.\n\n     EXT.  CELLAR DOOR\n\n     TODD, RILEY, and the THIRD SOLDIER converge stealthily,\n     coordinating with hand signals.\n\n     TODD pulls the pin on a grenade, and RILEY and the THIRD SOLDIER\n     kick in the door.\n\n     TODD tosses the grenade in as RILEY fires a withering barrage of\n     automatic fire through the cellar door.\n\n     BAHWHOOM!  The grenade EXPLODES.\n\n     Then, RILEY, TODD and the THIRD SOLDIER charge in.\n\n     INT.  CELLAR\n\n     HEAVY FIRE as TODD, RILEY and the THIRD SOLDIER spray the room.\n\n     ANGLE ON TODD signaling cease fire.\n\n     Sudden silence.  Drifting smoke.  Then...GROANS.\n\n     Four ENEMY SOLDIERS are sprawled motionless, horribly\n     eviscerated.  A fifth ENEMY SOLDIER, horribly wounded, is\n     groaning.\n\n     ANGLE ON TODD surveying the scene, stone faced.\n\n     TODD'S POV of the enemy dead, and several CIVILIANS equally dead,\n     as well as the dead BODIES of several CHILDREN.\n\n     BANG!  RILEY shoots the groaning ENEMY SOLDIER.\n\n     Silence again.\n\n     CLOSE ON TODD, his stone face.  What does he see?  What does he\n     feel?  Anything?  A mystery!\n\n                                                       CUT TO:\n\n     INT.  BARRACKS - DAY\n\n     A spartan room, bare bunk-beds.  Rain POUNDS on a window that\n     looks out into a stormy sky over the godforsaken ruins of the\n     Third Dresden Moon.\n\n     TODD is sitting on a bunk, shirtless.  His new rank has been\n     tattooed on his right cheek; there's a scar under one eye and\n     another scar that distorts his lip slightly.  The names of\n     various battles have been neatly stenciled down his left arm, an\n     official record, not a decoration.  TODD is silent, staring into\n     space.  The room is full of SOLDIERS in T-shirts, fatigues,\n     sleepwear.  WORDS APPEAR SUPERED OVER THE SCENE...\n\n     The WORDS FADE AWAY, the silence continues, the rain BEATS on the\n     barracks, no one says a word, they just stare into space or watch\n     the rain beat on the windowpane.  They look like robots...used\n     robots, made individual only by their different scars.\n\n                                                       CUT TO:\n\n     EXT.  BARRACKS - DAY\n\n     Rain.  Low buildings, boarded windows, slogans painted on the war-\n     scarred walls, the makeshift barracks in one building, command\n     quarters in the next.\n\n     A lone figure, a MAN IN A PONCHO, hurries through the downpour,\n     passing the barracks, heading for the command quarters.\n\n     INT.  COMMAND QUARTERS\n\n     Entering, the MAN shakes rain off his poncho.  His name is\n     RUBRICK, he's thirty-five, a lieutenant.  He faces the two bored\n     OFFICERS lounging in the cluttered office where outdated\n     equipment is strung together by mazes of wire and the desktops\n     are heaped with printout sheets and styrofoam coffee cups.\n\n     The captain, CHURCH, has his feet on the desk.  He's fifty years\n     old, gray and fat and soft.  The other officer, SLOAN, also a\n     lieutenant, is a thirty-five year old woman, dark, moderately\n     attractive, but not particularly happy.\n\n                                   RUBRICK\n                    Colonel Mekum has his \"boys\"\n                    unpacked.  I think he wants to show\n                    them off.\n\n                                   CHURCH\n                    Hmmmmph.\n\n                                   RUBRICK\n                    They look...impressive.\n\n                                                       CUT TO:\n\n     INT.  \"STATION\" - DAY\n\n     A NEW SOLDIER fills the frame, a perfect-looking man/boy of about\n     twenty built like a linebacker, powerful looking with sculpted\n     unscarred musculature.  He looks straight ahead, unblinking, and\n     so does the one next to him, and the next one.  Twenty of them\n     are standing in line in one corner of an enormous space that was\n     once a station of some sort.  They don't seem to respond to the\n     chill or to the occasional drops of rain from the skylights\n     leaking sixty feet above them.\n\n     Wearing dripping ponchos, CHURCH, SLOAN, and RUBRICK are looking\n     the robot-like monsters over like so much meat, while a bright-\n     eyed blond colonel about thirty, named MEKUM, stands proudly by,\n     glowing with satisfaction.\n\n     The vast interior is so large that in spite of clusters of\n     stacked crates, part of a dismantled spaceship, a rusty\n     earthmover, numerous large pieces of machinery, and a whole\n     arrangement of exercise gear, the place has huge open spaces and\n     a sense of emptiness to it.\n\n     SLOAN walks close to the line of NEW SOLDIERS and studies one,\n     her eyes drifting over their muscular bodies.  She breaks the\n     long silence.\n\n                                   SLOAN\n                    Well, they're...pretty.\n\n                                   CHURCH\n                         (to Mekum)\n                    What's so hot about them?\n\n                                   MEKUM\n                         (proudly)\n                    Very much improved.  In every way.\n\n                                   RUBRICK\n                    This is Colonel Mekum from Q.  He's\n                    their commanding officer.\n\n                                   CHURCH\n                         (dubious)\n                    Improved...how?\n\n                                   MEKUM\n                    As I said, in every way.  Physically\n                    and psychologically.  More\n                    endurance, quicker responses, better\n                    hand-eye, improved technical\n                    training.  Where the First\n                    Psychology gave you ninety-eight\n                    percent obedience, this bunch gives\n                    you 99.4.\n\n                                   CHURCH\n                         (dubiously)\n                    Mmmmmm.  Weeell, you know my old\n                    daddy was in maintenance and he had\n                    a saying...\n\n     RUBRICK and SLOAN exchange an eye-rolling private glance that\n     means they've heard a lot of Daddy's sayings.\n\n                                   CHURCH\n                    ...He used to say, \"If it ain't\n                    broke, don't fix it.\"\n\n                                   MEKUM\n                         (patronizing)\n                    I...see.  I'm not sure I quite get\n                    your...point...\n\n                                   CHURCH\n                         (indicating the\n                          Veterans)\n                    Well, the soldiers we've got now,\n                    they've been through all kinds of\n                    heavy shit...and they've always got\n                    the job done.  Now these new ones,\n                    these \"hot shots\" of yours...what\n                    kind of action have they seen?  They\n                    are battle-tested, aren't they?\n\n                                   MEKUM\n                    That's up to you field guys.  H.Q.\n                    wants you to break 'em in when you\n                    do the annual security sweep in\n                    January.\n\n                                   CHURCH\n                    The sweep is just routine, not even\n                    police action.  I'd like to see some\n                    sort of...meaningful evidence...\n\n                                   MEKUM\n                    Such as?\n\n                                   CHURCH\n                    Maybe we could run some tests.  Kind\n                    of a comparison, the old and the\n                    new...\n\n     RUBRICK and SLOAN exchange a startled glance, but MEKUM doesn't\n     seem fazed as we...\n\n                                                       CUT TO:\n\n     INT.  \"STATION\" - DAY - LATER\n\n     A WEAPON FIRING!  BUDDA!  BUDDA!  BUDDA!  The automatic weapon is\n     being fired by the veteran soldier RILEY.  He's blazing away at\n     an elaborate electronic target a hundred yards away in the huge\n     space.\n\n     TODD is watching with the other VETERAN SOLDIERS.  They're seated\n     on the floor, wearing drab fatigues, directly across from the\n     twenty NEW SOLDIERS.\n\n     As TODD glances at them, the NEW SOLDIERS look back unblinkingly.\n     (The VETERANS, in spite of their impassive expressions, look very\n     human compared to the NEW SOLDIERS.  Their battle scars mark them\n     as individuals in sharp contrast to the perfectly-muscled young\n     giants across from them.)\n\n     The firing stops, and RILEY, his weapon empty, leaps to his feet\n     and salutes RUBRICK, who's been watching the demonstration with\n     the rest of the officers.\n\n                                   RILEY\n                    Sir!\n\n                                   RUBRICK\n                    Very nice, Riley.  Fall away.\n\n                                   RILEY\n                         (another salute)\n                    Sir!\n\n     As RILEY joins the VETERANS squatting motionlessly, RUBRICK\n     glances at the shredded electronic target, glances at his\n     stopwatch, then looks at Mekum.\n\n                                   RUBRICK\n                    Thirty seconds, 90 percent hits.\n\n     MEKUM smirks, picks up the weapon, disassembles it rapidly.\n                                   MEKUM\n                    Let's make it more difficult.\n\n     RUBRICK, CHURCH and SLOAN exchange glances of disbelief as MEKUM\n     scatters the disassembled parts onto the concrete floor with a\n     loud clatter.\n\n     TODD watches, unblinking, as MEKUM looks to the NEW SOLDIERS.\n\n                                   MEKUM\n                    Caine Six-Oh-Seven!\n\n     A blond Nordic giant is suddenly on his feet among the NEW\n     SOLDIERS.  There is real dignity in his salute; he's like a pro.\n\n                                   CAINE 607\n                    Sir!\n\n                                   MEKUM\n                    Assemble the weapon, load, fire on\n                    the target from various evasive\n                    positions in a thirty-second period.\n\n     OFFICERS look at each other again in disbelief.\n                                   MEKUM\n                    Starting...now!\n\n     MEKUM punches his watch as CAINE 607 gracefully begins to pick up \n     pieces of weapon, doing it rapidly, yet without apparent haste.\n\n     TODD is watching, revealing nothing.\n\n     CLACK!  KA SHACK!  CLICK!  CAINE 607 slaps the weapon together, \n     loading a magazine with a final KA SHUCK, then he dives to the\n     floor, firing a rapid burst at the electronic target which blinks \n     wildly...\n\n     OFFICERS watch, impressed.\n\n     CAINE 607 is firing from another position.\n\n     The target goes crazy.\n\n     CAINE 607 is rolling and firing at the same time.\n\n     The target goes wild.\n\n     MEKUM's watch clicks off 27 seconds...28...29...\n\n     The firing stops.\n\n     TODD stares impassively as CAINE 607 salutes.  Beside him, RILEY \n     watches also.\n\n                                   MEKUM\n                         (to Caine 607)\n                    As you were, soldier.\n\n     RUBRICK is looking at the electronic target, grudgingly\n     impressed.\n\n                                   RUBRICK\n                    Ninety-nine percent...\n\n                                   MEKUM\n                         (smug)\n                    While taking evasive action...\n\n                                   RUBRICK\n                         (amazed)\n                    That's...very good.\n\n                                                       CUT TO:\n\n     INT.  WEIGHT AREA/\"STATION\" - DAY - A LITTLE LATER\n\n     A NEW SOLDIER cleans an awesome weight with what looks like ease\n     as RUBRICK, CHURCH, and SLOAN again exchange impressed glances\n     and MEKUM watches smugly.\n\n     They're still in the giant warehouse in the gym section among all\n     sorts of ominous exercise devices.  The NEW SOLDIERS and VETERANS\n     are gathered in separate groups at attention, their faces like\n     stone.\n\n     TODD is watching the big man handle the weight easily.\n                                   MEKUM\n                    See?  Much stronger.\n\n                                   CHURCH\n                    What about endurance?\n\n                                                       CUT TO:\n\n     EXT.  RUINS - DAY\n\n     TODD is loping through sheets of rain.  The terrain around him \n     features ghostly shells of buildings, shards of a city nearly \n     invisible through the curtains of rain.\n\n     His feet slash through flooding gutters and trash filled streets \n     bordered by ruins as he runs smoothly, evenly, keeping a good\n     pace, his breath rasping rhythmically, his eyes revealing\n     nothing as we...\n\n                                                       CUT TO:\n\n     INT.  OFFICER QUARTERS - DAY\n\n     SLOAN accepts a cup of hot coffee from RUBRICK as she considers\n     the plastic \"papers\" MEKUM has spread on the cluttered desk.\n     Ponchos have been hung by the door.  MEKUM is pointing to various \n     numbers and paragraphs.\n\n     CHURCH has been staring out the window into the pouring rain.  He \n     turns to MEKUM and interrupts.\n\n                                   CHURCH\n                    Our man has been out there fifteen\n                    minutes now.  Shouldn't you send one?\n\n                                   MEKUM\n                         (smug grin, to Church)\n                    In a minute.\n                         (turning back to Sloan)\n                    Now, see this test?  This shows what\n                    they do under sleep deprivation\n                    conditions.  Forty-eight hours awake\n                    and they can...\n\n                                                       CUT TO:\n\n     EXT.  TODD RUNNING/RUINS - DAY\n\n     Rain slashes his face as TODD runs, his eyes staring vacantly\n     into the blinding storm, his legs pumping evenly, his feet\n     chopping through the thick mud in a wasteland of shelled\n     apartment buildings where rat-like CREATURES scurry out of his\n     way as we...\n\n                                                       CUT TO:\n\n     INT.  \"STATION\" - DAY\n\n     Separated by fifteen yards, the two groups of SOLDIERS, the NEW\n     and the VETERAN, sit on the cold cement floor, staring vacantly\n     into space as they await orders.  Occasionally a VETERAN will rub\n     his chin, another will scratch his nose, but nobody says\n     anything, and when their eyes accidentally meet, they look away \n     deliberately, expressionless.  Nobody flinches when a big door\n     opens and pale light streams in.\n\n     MEKUM is standing there in a poncho.\n\n                                   MEKUM\n                    Melton, Eight Five.  Forward.\n\n     MELTON, one of the husky new soldiers, climbs to his feet and\n     steps toward MEKUM, saluting.\n\n                                   MELTON\n                    Eight Five, sir.\n\n                                   MEKUM\n                    Ten miles, Melton, on the run.\n\n     MELTON's face shows no expression as MEKUM continues.\n\n                                   MEKUM (O.S.)\n                    You've got sixty minutes.  Go.\n\n                                   MELTON\n                    Sir!\n\n     MELTON heads out into the rain running smoothly and easily as\n     we...\n\n                                                       CUT TO:\n\n     EXT.  TODD/RUINS - DAY\n\n     TODD's breath comes in even rasps as his feet splash over rough\n     terrain, splash splash splash, hard work but nothing in his\n     stone face indicates he's not equal to the task.  Splash splash\n     splash!\n\n                                                       CUT TO:\n\n     INT.  OFFICER QUARTERS - DAY\n\n     In the cluttered office, RUBRICK, CHURCH, and SLOAN look up from\n     a conversation as MEKUM enters dripping wet and takes off his\n     poncho, smiling smugly.\n                                   MEKUM\n                    My man left exactly twenty minutes\n                    after yours.  Make a note of that.\n\n                                   RUBRICK\n                    What are we supposed to do with the\n                    old soldiers?\n\n                                   MEKUM\n                         (a shrug and a grin)\n                    Old soldiers never die.\n\n                                                       CUT TO:\n\n     EXT.  TODD/RUINS - DAY\n\n     Running.  Splash splash splash!  TODD makes a turn, heading back,\n     his face like stone, as we...\n\n                                                       CUT TO:\n\n     INT.  OFFICERS QUARTERS - DAY\n\n     MEKUM is filling his coffee cup as he speaks.\n\n                                   MEKUM\n                    They'll serve as a labor force.  You\n                    can use them for physical stuff...\n                    loading, unloading, repairs, power\n                    lines, that kind of thing.\n                         (a glance around the\n                          office)\n                    Even cleaning...sweeping...,uh,\n                    tidying up.\n\n                                                       CUT TO:\n\n     EXT.  TODD/RUINS - DAY\n\n     Breathing steadily, raspily, TODD lopes through the rain.\n     Something makes him glance back over his shoulder.\n\n     Thirty yards back he sees a vague shape, obscured by rain.\n\n     TODD looks ahead again, his face revealing nothing, his legs \n     maintaining the same even pace, running, running, running.\n\n     Then he looks back again.\n\n     The vague shape is taking form, a GHOSTLY RUNNER getting closer.\n\n     TODD continues at the same even place.  He doesn't look back\n     again until he feels closeness.  Then he looks.\n\n     IT'S MELTON only a few yards behind him, running effortlessly,\n     keeping a steady pace that's faster than TODD's.  The bigger man\n     moves even with TODD without even looking at him, as though TODD \n     weren't there, and then he moves ahead like a big machine,\n     inexorable.\n\n     As TODD runs, eyes straight ahead, he can see MELTON becoming\n     ghostly, disappearing in the curtains of rain ahead as we...\n\n                                                       CUT TO:\n\n     INT.  \"STATION\" - DAY\n\n     The huge doors are open to the rain as SLOAN, CHURCH, RUBRICK,\n     and MEKUM watch for signs of TODD.  Still dripping vet, the\n     muscular MELTON is standing beside MEKUM, breathing heavily but\n     not desperately.\n\n                                   MEKUM\n                    Of course, age is a factor, but the\n                    real factor is the training program,\n                    especially the psychological.  The\n                    mind controls the body after all,\n                    and we're doing wonderful things\n                    with the mind.\n\n     A shape appears in the rain a hundred yards off, moves closer,\n     takes the form of a runner running.  It's TODD, still moving at\n     the same pace, his face like stone.\n\n     TODD lopes into the big warehouse and, breathing hard but evenly, \n     comes to a halt in front of RUBRICK and salutes.\n\n                                   TODD\n                    Sir.\n\n                                   RUBRICK\n                    At ease, soldier.\n\n     CHURCH has been thinking and now he speaks to MEKUM.\n\n                                   CHURCH\n                    What's the price of all that speed?\n                    Is he tired?\n                                   MEKUM\n                    Tired?\n\n                                   CHURCH\n                    Todd here ran the pace he's been\n                    taught to run.  He's still strong.\n                    Send him up the chain, Rube.\n\n                                   RUBRICK\n                         (to Todd)\n                    Soldier!  Up the chain!\n                                   TODD\n                    Sir.\n\n     TODD salutes and lopes toward ten chains that dangle from the\n     rafters sixty feet above, grabs one, and starts up it, hand over\n     hand.\n\n     MEKUM watches TODD climb, then looks at CHURCH who is looking at\n     him expectantly.\n\n     MEKUM grins at CHURCH.\n\n     Then MEKUM looks back at TODD, not hurrying.\n\n     TODD is thirty feet up and climbing, passing the eight inch\n     circular \"platforms\" or footholds in the chain every ten feet.\n                                   MEKUM\n                         (sharply)\n                    Melton, on the double!  Up a chain!\n\n                                   MELTON\n                         (saluting)\n                    Sir!\n\n     MELTON takes a few easy strides, gracefully catches a chain mid-\n     stride, and smarts up, climbing easily and twice as fast as TODD.\n\n     CHURCH, SLOAN, and RUBRICK crane their necks as the two men\n     struggle upward toward the rafters.\n\n     Three quarters of the way up, MELTON comes even with TODD, then\n     passes him.\n     MEKUM, watching, smirks.\n\n     CHURCH is watching too, and he's still not satisfied.  His brow\n     is knit, something's bothering him.\n\n     ANGLE HIGH ABOVE, AMONG THE GIRDERS\n\n     Stonefaced, MELTON is resting an a \"platform\" on the chain, sixty\n     feet up, beneath the girders, swaying gently.\n\n     His stony gaze is on the next chain where TODD is arriving at a\n     \"platform\" on an adjacent chain...only three feet away.\n\n     Their eyes meet, TODD and MELTON alone together sixty feet up,\n     three feet apart.  Neither man blinks, neither man flinches,\n     neither man reveals anything at all...\n\n     LOW ANGLE, LOOKING UP\n\n     CHURCH considers the men high above, then to MEKUM.\n\n                                   CHURCH\n                    What about...spirit?\n\n                                   MEKUM\n                         (as in \"what's that?\")\n                    Spirit?\n                         (...a grin)\n                    Oh!  You mean \"AQ\"...\"aggressive\n                    qualities\"?\n\n                                   CHURCH\n                    Whatever the latest jargon is.\n\n                                   MEKUM\n                    Much better, much higher.  For\n                    example, where your old ones\n                    expressed ninety percent of their\n                    sexual energy in aggressive\n                    physicality, these new ones are\n                    ninety-nine percent without\n                    sexual inclination.  It's all\n                    aggression.\n\n                                   SLOAN\n                         (dryly)\n                    Real men!\n\n                                   CHURCH\n                         (sharply, to Sloan)\n                    At ease, Lieutenant.\n                         (turning to Mekum,\n                          serious)\n                    What if they fought?\n\n     A sudden silence.\n\n     SLOAN raises her eyebrows, gives RUBRICK a look.\n\n     Frowning thoughtfully, MEKUM looks up.\n                                   MEKUM\n                    You mean up there?\n\n                                   CHURCH\n                         (to Rubrick)\n                    Go ahead, Rube.  Tell Todd to take\n                    him.\n                                   MEKUM\n                    No!\n\n     They all look at MEKUM.  Is this the chink in the armor?  The new \n     soldiers can't fight?\n\n                                   CHURCH\n                    \"No\"?\n                                   MEKUM\n                    Not fair.  No contest.  Send two\n                    more of your old ones up.\n\n     Now CHURCH, RUBRICK, and SLOAN are stunned.  They exchange a\n     glance.\n\n                                   MEKUM\n                    Go ahead.\n\n     RUBRICK shrugs, turns to the VETERANS still sitting stoically in\n     a group on the cement floor.\n\n                                   RUBRICK\n                    Romero, A. -- Goines, D.L. -- up\n                    the chains.\n\n     Two of the veterans, ROMERO and GOINES, leap immediately to their\n     feet and climb rapidly.\n\n     SLOAN, CHURCH, and RUBRICK exchange a look as MEKUM smirks \n     confidently.\n\n     ANGLE ON TODD AND MELTON ABOVE.  They're still facing each other\n     across the sixty foot drop.\n\n     MELTON glances down...without losing sight of TODD.\n\n     ROMERO and GOINES are coming up the chains fast, hand over hand. \n     They're within ten feet, their impassive faces look dangerous.\n\n     Nothing shows on MELTON's machine-face, but he starts a slight\n     motion in his chain so that he spins slowly.  That way, as the \n     veterans surround him, he keeps a continual eye an all three.\n\n     TODD, his face impassive, eyes MELTON vigilantly.\n\n     ANGLE ON RUBRICK BELOW\n\n     For a long moment, RUBRICK looks up at the three men dangling\n     around the new soldier, then he shouts loudly at them.\n                                   RUBRICK\n                    Get him, men!\n\n     ANGLE ON TODD as SMASH!  TODD is hit hard in the face even as he\n     starts to swing.  WHAM!  MELTON hits him again and TODD loses his\n     grip on the chain, starts to fall, grabs at the chain, clutches,\n     slides...\n\n     ANGLE ON MELTON, CRUNCH!, hit as he swings at MELTON.  WHAM!\n     MELTON hits him again, hard.\n\n     GOINES swings against MELTON from behind, smashing at him with\n     his free hand and with both feet.\n\n     MELTON ignores the blows from behind as he grabs ROMERO by the\n     face with one hand, yanks the face close to his own, and squeezes \n     mercilessly.\n\n     ANGLE ON TODD, TWENTY FEET BELOW.  He's managed to get a foothold\n     on one of the mini-platforms.  His face horribly bloody, he looks\n     up at the action twenty feet above him and sees MELTON suddenly\n     hurl ROMERO downward.\n\n     ROMERO rockets down past TODD...\n\n     ANGLE ON THE FLOOR as SMASH!  ROMERO's body crunches against the \n     cement not far from RUBRICK, SLOAN, and CHURCH, splattering them\n     with blood.\n\n     Their eyes are wide with disbelief and horror as they look up\n     again...\n\n     ANGLE ON MELTON in the girders as he turns to face the man who's\n     been clubbing him from behind...GOINES!\n     GOINES swings his chain wide and MELTON, eyes merciless, deadly, \n     swings after him.\n\n     ANGLE ON TODD, bloody, struggling up the chain hand over hand.\n     His eyes follow MELTON above as the new soldier swings and\n     swings, trying to get a blow at GOINES.\n\n     Just then, GOINES lunges at MELTON, SMACK, SMASH, he hits him\n     hard, and WHAM!  MELTON hits him back...\n\n     ANGLE ON TODD who has climbed to a \"platform\" foothold on his\n     chain five feet above the swinging fighters.  TODD looks down\n     on MELTON's back as the big man swings close, watching, tensing,\n     then...\n\n     TODD dives off his chain and lands on MELTON's back, crooking one\n     arm around the new soldier's neck and pounding him with one free\n     hand and strangling him with the other arm.\n\n     MELTON gurgles while GOINES hits him in the face.\n\n     ANGLE ON MEKUM WATCHING BELOW.  For the first time a frown of\n     concern wrinkles his brow.\n\n     ANGLE ON MELTON AND TODD on chains just below the girders.\n     MELTON slams an elbow back into TODD's ribs hard and TODD gasps\n     for air, but...\n\n     GOINES uses the moment to slam a knee into MELTON's balls and...\n\n     MELTON gasps, then grabs GOINES by the neck with one hand, rips\n     him from the chain, and sends him plunging violently downward\n     even as...\n\n     TODD goes for face with his free hand.\n\n     SLAM!  MELTON smashes TODD in the ribs with an elbow.\n\n     TODD savagely gouges out one of MELTON's eyes.\n\n     ANGLE ON MEKUM, sixty feet below, enraged at the sight of\n     MELTON's injury.\n\n     ANGLE ON THE VETERANS watching the brutal fight with blank\n     impassive faces, RILEY among them.\n\n     ANGLE ON THE NEW SOLDIERS watching, robot-like.\n\n     ANGLE ON THE STRUGGLE OVERHEAD.  SMASH!  SMASH!  SMASH!  MELTON's\n     elbows drive back into TODD's ribs.  The breath knocked out of\n     him, TODD gasps for air, pain contorting his face.\n\n     MELTON manages to get TODD's forearm into his mouth and bites \n     furiously, drawing blood.\n\n     TODD grits his teeth in pain.\n\n     WHAM!  Another blow to the ribs from MELTON's elbow.\n\n     TODD is losing his grip.\n\n     RILEY watches below, his face a mask.\n\n     MELTON bites and elbows furiously.\n\n     TODD loses his grip and grabs at MELTON, rakes flesh as he begins\n     to fall and then...\n\n     Plunging downward, TODD grabs wildly at the chain and catches it\n     ...but he keeps falling, the chain ripping flesh from his hand\n     for twenty feet until...\n\n     He can't hold on any longer!  TODD plunges the last thirty feet\n     to the floor, landing with a terrible crunch right on top of\n     ROMERO's broken body below.\n\n     Sudden silence!\n\n     ANGLE ON THE VETERANS watching impassively as TODD lies\n     motionless, sprawled on ROMERO's body.\n\n     ANGLE ON THE NEW SOLDIERS revealing no feelings.\n\n     ANGLE ON CHURCH, SLOAN, and RUBRICK looking stunned and shaken.\n\n     It's MEKUM who breaks the silence, SCREAMING furiously at the one-\n     eyed MELTON who's still sixty feet up...\n                                   MEKUM\n                    GET DOWN HERE!  GET DOWN HERE ON THE\n                    DOUBLE, GET YOUR ASS DOWN HERE, YOU\n                    MISERABLE PISS ANT STINKING SHIT FOR\n                    BRAINS!\n\n     CHURCH, SLOAN, and RUBRICK lift their stunned faces from TODD to\n     MEKUM who's continuing to rant at MELTON as MELTON comes down the\n     chain fast...\n                                   MELTON\n                    COME ON, DOUBLE IT UP, DOWN, DOWN,\n                    DOWN, YOU MISERABLE THIRD RATE\n                    SHITHEAD INCOMPETENT CLOWN!\n\n     MELTON lets go of the chain and drops the last fifteen feet,\n     landing gracefully on his feet in front of MEKUM and salutes.\n\n                                   MELTON\n                    Sir!\n\n                                   MEKUM\n                    LOOK AT YOU, YOU BIG DUMB SHIT,\n                    YOU'VE LOST AN EYE.  WHAT THE HELL\n                    GOOD IS A GODDAMN ONE-EYED SOLDIER?\n                    DO YOU KNOW WHAT IT COST TO BREED\n                    YOU, YOU BIG MORON?  TO TRAIN YOU,\n                    FEED YOU?\n\n     As MEKUM turns, including all the NEW SOLDIERS in his continuing\n     tirade, CHURCH, SLOAN, and RUBRICK confer in low voices.\n\n                                   RUBRICK\n                    They're...fantastic!\n\n                                   CHURCH\n                         (reluctant agreement)\n                    Mmmmmmm...\n\n                                   SLOAN\n                         (worried)\n                    We could have a problem here,\n                    couldn't we?  I mean, we just lost\n                    three men...\n\n                                   CHURCH\n                    Oh, I wouldn't worry about that.\n                    \"Training accident.\"  Paperwork.\n\n                                   SLOAN\n                    What about the bodies?\n\n                                   CHURCH\n                         (turning away)\n                    Incinerator.\n\n     Turning his back on SLOAN and RUBRICK, CHURCH approaches MEKUM\n     who's still raging, indicating MELTON to the blank-faced NEW\n     SOLDIERS.\n\n                                   MEKUM\n                    WHAT GOOD IS THIS MAN NOW?  WITH ONE\n                    GOOD EYE!  HE'S GOT NO DEPTH PERCEPTION!\n                    HE'S CANNON FODDER.  ALL HE CAN DO\n                    IS WALK POINT AND TAKE THE FIRST\n                    HIT.\n\n                                   CHURCH\n                         (interrupting)\n                    They're very...impressive.\n\n                                   MEKUM\n                         (fuming)\n                    Yeah, well, the big moron shouldn't\n                    have lost an eye.\n\n     CHURCH glances at TODD's corpse dumped over ROMERO's broken body,\n     tries to assuage him.\n\n                                   CHURCH\n                    It was our best man who got his\n                    eye...  Todd, a real tough one.\n                    Survived police action in Montana,\n                    fought in the Argentine Sector, and\n                    in the Saudi Campaign to say nothing\n                    of --\n                                   MEKUM\n                    Old news!  They're nothing at all!\n                    Wait until you get these new fellas\n                    into some real action.  I guarantee\n                    you'll be awed.  I guarantee it.\n\n     The NEW SOLDIERS sit impassively, the bleeding MELTON among them,\n     staring right at the VETERANS.\n\n     Not far away three dead bodies lie motionless as we...\n\n                                                       CUT TO:\n\n     INT.  FURNACES/FURNACE ROOM - NIGHT\n\n     A rage of flame!  The mouth of a huge furnace leers with yellow\n     fury, eight feet high.\n\n     Two men, BURNERS, in asbestos fire suits and helmets, appear,\n     laboriously dragging a tattered sofa leaking stuffing.  With\n     effort they shove it into the blazing furnace where it is quickly \n     consumed.  Slowly the BURNERS turn and trudge back for another\n     load as we REVEAL A REFUSE BIN, seven feet high, looming in the \n     shadows not far from the flickering light of the furnace.  It's \n     overflowing with junk, barely distinguishable in the gloom.\n\n     The BURNERS grab blindly and haul out the next object.\n\n     It's ROMERO's dead body.  They haul it out of the bin and let it\n     flop limply to the floor where ROMERO stares sightlessly at\n     nothing.\n\n     The BURNERS stare at the body, exchange a blank look through\n     their visors, shrug and start to drag the heavy carcass toward\n     the flames.\n\n     INT.  REFUSE BIN/FURNACE ROOM/CLOSE BY\n\n     In the near darkness, the faintest flickering light reveals two\n     tangled BODIES, motionless in the confusion of refuse.  But not\n     quite motionless!  A hand opens and closes!  A bloody hand!\n     Fingers twitch.\n\n     INT.  FURNACE ROOM\n\n     ROARING FLAMES as ROMERO's body is tossed unceremoniously into the\n     fire where the flames begin to consume it.\n\n     For half a second the BURNERS watch ROMERO melt into fire, then\n     they turn their backs and head back for another load.\n\n     INT.  REFUSE BIN/FURNACE ROOM\n\n     BURNERS' hands reach in and haul out another corpse, GOINES,\n     dragging the body right over TODD's body.\n\n     As GOINES' shoe drags over TODD's face, TODD's eyes flicker\n     stupidly.\n\n     Then GOINES' corpse is pulled over the edge of the bin.\n\n     TODD blinks, fighting for consciousness.  Where is he?  He moves\n     his head...\n\n     INT.  FURNACE ROOM\n\n     The BURNERS, silhouetted by flames, feed GOINES' body to the\n     furnace.\n\n     CLOSE ON THE FLAMES as GOINES' body is consumed by raging\n     flames.\n\n     ANGLE ON THE BURNERS trudging to the bin.  They reach in blindly\n     for whatever's next.  Tugging with effort, they struggle the\n     clumsy object over the rim, and let it fall to the floor.  It's a \n     mattress!\n\n     Communicating with a look, the FIRST BURNER drags the mattress\n     toward the fire while the SECOND BURNER reaches again into the\n     bin.\n\n     The SECOND BURNER frowns through the visor, struggles with\n     something, frowns, wrestles with it.\n\n     Finally, with great effort, he pulls out a big carton that \n     immediately spills old magazines on him.\n\n     Disgusted, he pulls the partially full carton across the refuse-\n     littered floor toward the furnaces.\n\n     ANGLE ON HIS FEET, as the SECOND BURNER struggles toward the\n     fire, stepping over a trail of blood which is hardly noticeable\n     in the flickering firelight.\n\n     He passes another big corrugated bin with a sign an it.  The sign\n     says NONFLAMMABLE WASTE DISPOSAL...and the trail of blood leads\n     to that bin!\n\n                                                       CUT TO:\n\n     EXT.  OUTER SPACE - \"DAY\"\n\n     Silence!  A vast darkness with only a few tiny lights in the\n     infinite depths.\n\n     A battered rusty spaceship glides slowly and silently into view.\n     This is a GARBAGE SHIP and it looks it.  Awkward and slow and\n     totally unglamorous, it moves through space like a great clumsy\n     church made of steel as we...\n\n                                                       CUT TO:\n\n     INT.  HOLD/GARBAGE SHIP - \"DAY\"\n\n     As the massive doors on the underside of the ship open, light\n     spills in and there is a huge ROAR as tons of debris, including \n     massive pieces of machinery, huge statues, old vehicles, and \n     numerous containers, spill out through the open bays and tumble \n     downward.  The one that says \"Nonflammable Waste\" on the side\n     careens against the bulkhead with a THUNDEROUS sound, then\n     hurtles downward.\n\n     EXT.  JUNK MOUNTAINS/LANDSCAPE\n\n     As debris from the ship tumbles down onto one of several huge\n     mountains of junk that loom 800 hundred feet above a windswept\n     terrain dimly lit by four pale suns, the bays close, and the\n     rusty GARBAGE SHIP glides away.\n\n     Still the cascade of machines and other bulky junk THUNDERS down\n     the steep slopes, shattering, breaking into parts, tumbling and\n     tumbling, settling here and there, while a SCREAMING WIND, very\n     powerful, picks off the lighter pieces and carries them off like\n     snow blowing off a mountain.\n\n     The familiar-looking container somersaults halfway down the slope \n     where it bursts open, spilling a confusion of junk.\n\n     Above the container, a huge drum smashes into a hunk of machinery\n     and splits, oozing an awful looking liquid that spills down onto\n     the contents of the container, sizzling and smoking on steel,\n     eating it like acid.\n\n     Not far from a smoking piece of steel, WE FIND TODD'S foot\n     protruding from the junk heap!  It's motionless!  Acid drips and \n     hisses.\n\n     ANGLE ON TODD, sprawled \"inside\" the mountain of junk, grimacing\n     in pain as acid hits his exposed foot.  Trapped in the debris, \n     battered and bloody and weak, he struggles to rise, fights the\n     heavy objects pinning him, fights to avoid the dripping acid.  As\n     the wind SCREAMS furiously, he continues to struggle against the\n     junk that pins him as we...\n\n                                                       CUT TO:\n\n     EXT.  \"INSIDE\" AND OUTSIDE THE MOUNTAIN - DAY - A LITTLE LATER\n\n     TODD's head, caked with blood, appears from the junk like a man\n     looking out of a cave.  Wind seizes at his hair furiously.\n\n     He looks up, sees four pale suns in the sky...just as a huge\n     steel lathe comes somersaulting down from above like a loose\n     boulder, and TODD has to duck hastily to avoid certain death.\n\n     As the heavy steel tumbles down the slope below him, wind plucks\n     a twelve-foot I-beam from the slope next to him and whips it off\n     in a frenzy.\n\n     Holding on for dear life, TODD looks down at the ground four\n     hundred feet below and sees a bleak wasteland strewn with junk\n     shifting and skittering in the wind.\n\n     He notices something and reacts.\n\n     Far down on the floor there is a strange pattern of lines...and\n     moving along one of the lines are four tiny FIGURES...they could\n     be humans...but maybe not!\n\n     For a moment TODD watches them.\n\n     Then he starts to climb downward through the labyrinth of junk \n     \"inside\" the mountain, and we...\n\n                                                       CUT TO:\n\n     EXT.  LOWER ON \"JUNK MOUNTAIN\" - DAY - MINUTES LATER\n\n     Far down the slope, perhaps forty feet from the foot of the\n     massive mountain, TODD's head pokes out of the confusion of junk\n     and he looks down at the FIGURES below.\n\n     Seen more closely, the FIGURES are more distinct, but no less\n     mysterious.  Heavy outer garments like huge parkas and hoods blur \n     their individual shapes as they inch across the landscape,\n     apparently clutching one of several crisscrossing wires that\n     stretch tautly for miles across the bleak terrain like \"roads\"\n     through the wind.\n\n     TODD watches as one of the FIGURES moves off the \"road.\"  He's \n     trailing rope that attaches him to the others as he struggles\n     through the wind, walking almost on all fours like an ape.\n\n     TODD watches the FIGURE moving among bits of junk until he\n     locates something he wants, picks it up, and starts to struggle\n     back toward the others, dragging his burden after him.\n\n     TODD is watching what would seem to be some sort of scavenging\n     process by these strange unearthly FIGURES as we...\n\n                                                       CUT TO:\n\n     EXT.  FADING SUNS - DUSK - LATER\n\n     The four suns are changing color, dimming in the sky, as we...\n\n                                                       CUT TO:\n\n     EXT.  LANDSCAPE AND \"JUNK MOUNTAIN\" - DUSK\n\n     Tiny in the distance, the four FIGURES are moving together along\n     a cable, headed away from the junk mountain.\n\n     At ground level now, TODD is watching them, crouched behind a\n     massive transformer that teeters slightly in the wind in spite of\n     its great bulk.\n\n     Peeking around the sheltering transformer, he spots one of the\n     taut cables lashed to an enormous piece of junk near the foot of\n     \"his\" mountain.  The cable is twenty yards away in a \"canyon\" of\n     junk and he'll have to move across open space partially exposed\n     to the wind in order to get to it.\n\n     He starts out from behind the transformer...\n\n     WHOOOOOO!  Screaming wind lifts him and hurls him thirty feet,\n     his arms flailing.  He comes down even further from the cable, \n     struggling to keep on his feet.  Gritting his teeth, he fights\n     the wind, struggles toward the cable.\n\n     Suddenly a chunk of steel whips at him and he ducks just in time\n     as it whistles close to his head.\n\n     TODD drops to the ground and starts to crawl \"under the wind,\"\n     toward the taut cable, and we...\n\n                                                       CUT TO:\n\n     EXT.  \"STEEL HENGE\" - DUSK - LATER\n\n     Seen by TODD, the four tiny FIGURES are far ahead, disappearing\n     in the distance and the dusk.\n\n     Following them on a taut wire, TODD is passing through a barren \n     landscape punctuated by strange ruins, great shapes of steel\n     thrusting out of the ground and looming over and around him,\n     vaguely recognizable as the wreckage of a space vehicle that must\n     have crashed long ago.\n\n     The mountains of junk squat a mile behind him.  He's come a long\n     way, it's almost dark, he's weak.\n\n     He hangs onto the wire, walking with effort.\n\n     He can no longer see the creatures ahead of him on the wire.\n\n     He notices something thirty yards off the wire to the right.\n\n     Steel crosses.  Maybe a hundred of them.  A cemetery.\n\n     Just then, the wind catches TODD, yanks him, but he hangs onto\n     the wire, holding on desperately, as the wind pulls at him and\n     makes him flap like a pennant in the breeze.\n\n     Then the wind dies enough for him to get both hands on the wire\n     and get weakly to his feet.  For a moment he looks like he might \n     collapse, but he doesn't, and we...\n\n                                                       CUT TO:\n\n     EXT.  LANDSCAPE - NIGHT\n\n     At night the four suns glow darkly like night lights.\n\n     TODD is alone on the planet, punished by the savage wind,\n     struggling along the wire, shivering.\n\n     Every stop is an effort, but the eyes stare into the dark and\n     they reveal no emotion, not even when he suddenly tenses, seeing \n     something ahead.\n\n     In the distance a faint light glows.\n\n     TODD considers it as we...\n\n                                                       CUT TO:\n\n     EXT.  WINDOW/SKYLIGHT - NIGHT - MOMENTS LATER\n\n     The window is detached plexi from some kind of vehicle, embedded\n     in a low mound of \"earth\" like a skylight.  Whatever is making\n     the light comes from below in a sort of hut that slopes only\n     inches above the ground.\n\n     TODD is hanging onto the cable only ten yards from the strange\n     window.  He can see more of them glowing all around him, as well\n     as silhouetted pipes issuing smoke to the wind.\n\n     TODD drops to his belly to keep under the wind.  He crawls ten\n     yards to the window and pears through it.\n\n     TODD'S POV of a fantastic confusion of color and movement seen\n     through the thick scratched plexiglass window.  The wild blurs of\n     activity make no sense to him whatsoever, nor do the very FAINT\n     SQUEALS of sound barely audible over the deafening ROAR of the\n     wind.\n\n     (What he's seeing in the room below is a violent pillow fight\n     between eight BOYS and GIRLS ranging from four to ten years old. \n     Wearing cotton shifts dyed red, blue, or yellow they're smacking\n     each other violently with rag pillows and laughing happily in a \n     dormitory-style full of stacked bunks.)\n\n     ANGLE ON TODD, prone on the \"roof,\" mystified.  He's never seen \n     anything like it.  His grease-covered face barely reveals his \n     puzzlement when he is suddenly distracted by a change in the\n     wind.\n\n     The ROARING WIND that has dominated the environment since he first \n     arrived has diminished to a strong breeze.\n\n     TODD tries sitting up.  The breeze doesn't overpower him.  He\n     looks around.\n\n     The meaningless SHRIEKS of the pillow fight, though still muffled\n     by heavy plexiglass, are LOUDER now, but TODD's attention is on\n     the other window/skylight that glows from this strange \"roof\" and\n     on the strange sound that's coming to him, borne on the breeze...\n     a MUSICAL sound.\n\n     Struggling weakly to his feet, TODD staggers toward the next\n     window.  The MUSIC is LOUDER as he approaches -- it's waltz music \n     played on an accordion.\n\n     TODD drops to his knees and peers through the next window.\n\n     TODD'S POV through the second \"window,\" another mysterious\n     vision!  The color and movement are more subdued, but TODD is\n     just as puzzled.\n\n     What he's seeing indistinctly through the thick plexiglass is an \n     OVERHEAD VIEW of a man and a woman gliding across the floor,\n     moving as one, first this way, then that, in time to a WALTZ.  In\n     the corner, another person is making a strange movement that\n     seems to initiate the music...\n\n     ANGLE ON TODD, flat on the roof.  Now that the weak breeze has\n     given way to a deathly stillness, the mysterious (to him) MUSIC\n     is clearly audible as TODD peers through the plexiglass at the\n     warm scene below, as puzzled by the waltzing couple as by the\n     pillow fights.\n\n     Then he gets to his feet again and in the stillness makes his way\n     past a smoking chimney toward the next window.  Halfway there he \n     freezes...listening!\n\n     A strange haunting WHISTLING sound is coming from somewhere...\n\n     TODD looks around at the blackness beyond the roof windows.\n     There's nothing visible...\n\n     The mysterious sound is louder now, drowning out the music\n     ominously, drowning out everything, everything, everything.\n\n     Suddenly TODD understands, but he's too late...\n\n     ROOOOOOOOOOAAR!  It's the WIND, back with renewed fury, more\n     powerful than ever!\n\n     TODD is hurtled into the air, tossed head over heels by the wind,\n     struggling, clutching at empty air in vain, buffeted, slammed to\n     the ground, lifted again before he can flatten himself, tossed \n     violently, somersaulted helplessly...\n\n     EXT.  INSIDE A TRENCH\n\n     WHAM!  TODD is slammed face first to the ground.  For a long\n     moment he's motionless, untouched by the HOWLING WIND for reasons\n     that aren't clear.\n\n     Finally he rolls over weakly and looks up.\n\n     In the weak light he can just make out the steep earthen walls of\n     a narrow trench looming eight feet straight up, protecting him\n     from the wind howling overhead.\n\n     TODD tries to get up...but the fall has injured his leg and he\n     slumps to the floor of the three-foot-wide trench, too weak and \n     injured even to crawl.\n\n     Lying there, barely conscious, gasping for breath, he suddenly\n     sees something.\n\n     Shoes!  Less than a foot from his bloody face.\n\n     He manages to lift his head a little and look up.\n\n     Silhouetted by the light spilling from an open door in the trench\n     wall are four children...ELLEN, ten, WILL, six, TOMMY, five, and \n     JOHNNY, eight.\n\n     Barely conscious, TODD can just make out the astonishment on\n     their blurred shadowy faces as they look down at him in\n     amazement.  Then they go OUT OF FOCUS altogether as TODD slumps\n     unconscious and everything goes BLACK BLACK BLACK, and we...\n\n                                                       CUT TO:\n\n     INT.  MEETING ROOM - NIGHT\n\n     VOICES, CONFUSION.  About fifty people are jammed into the low-\n     ceilinged meeting room, all of them talking at once.  They are\n     PIONEERS, men and women of all ages and many races, a hardy,\n     weathered-looking group dressed in plain clothes of muted color.\n\n     Their faces seem to have been etched by the wind with deep lines,\n     the skin burnished, and even the younger ones have crow's feet\n     around the eyes from squinting.\n\n     As they chatter excitedly, asking each other what happened, who\n     found him, where, and so on, a sharp-faced fifty-ish woman,\n     HAWKINS, is standing behind a table in the front of the room,\n     calling for order.\n\n                                   HAWKINS\n                    Please!  Quiet, please!\n\n     Just as the hubbub finally dies down, a grizzled pioneer named\n     SLADE bellows loudly at her.\n\n                                   SLADE\n                    Just tell me one thing!  How many of\n                    them are there and are they armed?\n\n     HAWKINS stares SLADE down, refusing to speak until she has real \n     silence.  When she finally speaks, her voice is calm and\n     controlled.\n\n                                   HAWKINS\n                    There in a man...one man.  He was\n                    found in the trench by several\n                    children...\n\n     A sudden murmur dies away quickly under HAWKINS' hard stare.\n                                   HAWKINS\n                    This man was not armed.\n\n     A murmur goes through the crowded room, then a woman named ELISE\n     speaks over the hum of voices...\n\n                                   ELISE\n                    How could there only be one?  How\n                    could he get here?\n\n     HAWKINS glances toward MACE, a muscular, bearded man, about\n     thirty.\n\n                                   MACE\n                    He was unconscious.  We couldn't ask\n                    him anything.  He --\n\n     A commotion in the back room causes MACE to break off as JIMMY\n     PIG, a clean-shaven burly-looking pioneer in his thirties, pushes\n     his way in, followed by four more PIONEERS.  All five of then are \n     wearing their huge hooded parkas, strange Eskimo-type wind\n     goggles, and carrying weapons.\n\n                                   JIMMY PIG\n                    Nothin' out there.  We couldn't see\n                    nobody, couldn't see no ship, no\n                    vehicles, nothin'...plus the wind's\n                    up again real strong.\n\n     An excited hubbub.  HAWKINS is trying to restore order when SLADE\n     shouts over the commotion.\n\n                                   SLADE\n                    They're hiding, I bet.\n\n     HAWKINS ignores him as she speaks with firm authority.\n\n                                   HAWKINS\n                    Let's everybody calm down right now!\n                         (beat; silence; then)\n                    We have an injured man among us.\n                    One man.  A traveler.  Unarmed.\n                         (another pause; then)\n                    We all want to do the decent thing.\n                    The decent thing is to help him.\n                    Mace's wife, Sandra, is looking\n                    after him now.  Now, I'd like a vote\n                    of support on this course of action\n                    from all of you.\n\n     The way she says it, you know she's used to getting her way, and,\n     in fact, PIONEERS are exchanging glances and nodding when SLADE\n     shouts again.\n\n                                   SLADE\n                    You keep an eye on him, Mace!  You\n                    watch him!\n\n                                                       CUT TO:\n\n     INT.  BEDROOM - NIGHT\n\n     TODD is on his back in a bed in a tiny earth-walled bedroom.  He\n     stares stupidly at the woman bending over him.  She is SANDRA, a\n     woman of twenty-five who is attractive, but not in a glamorous\n     way.  It's a very natural beauty worn with intelligence and \n     dignity.  She's wiping away blood and grease from TODD's face.\n\n     TODD's eyes flick around the room even as he lies motionless.\n\n     He sees a window high on one wall.\n\n     He sees old-fashioned magazine pictures and bits of patterned\n     material hung here and there for decoration.\n\n     Clothing hangs from pegs on the walls.\n\n     He doesn't see the look in SANDRA's eyes as she discovers the \n     savage scar on his forehead or the sergeant's tattoo on his\n     cheek.  Eyeing these telltale marks, SANDRA pours liquid into a\n     spoon and holds it to his lips.\n\n                                   SANDRA\n                    Want to try some more of this?\n\n     TODD swallows weakly.\n\n     SANDRA smiles, stands up, moves toward the door.\n\n                                   SANDRA\n                    You rest now.  I'll give you more\n                    later.\n\n     TODD watches her exit.\n\n     He hears her VOICE in the next room...a low murmur.\n\n     He's looking around again when a NOISE makes him look back toward\n     the door.\n\n     A two-year-old is crawling into the room on hands and knees.  The\n     baby boy, NATHAN, stops just inside, seeing TODD in the bed.\n\n     NATHAN looks into TODD's eyes with childlike interest and wonder.\n     TODD meets the look with those blank soldier's eyes.\n\n     INT.  \"LIVING ROOM\"\n\n     A second tiny room next to the bedroom is the rest of the\n     Mace/Sandra/Nathan living quarters.  MACE and SANDRA are deep in \n     conversation.\n\n                                   MACE\n                    What do you mean he's survived\n                    worse?  Did he say something?\n\n                                   SANDRA\n                    No, but he's covered with old\n                    wounds, all sorts of scars.  Knife\n                    scars, bullet scars, burns.\n\n                                   MACE\n                         (worried)\n                    A soldier!\n\n                                   SANDRA\n                    There are words on his shoulder.\n                    Tannhauser Gate, the Argentine\n                    Sector, Montana, Bolivia, Shanghai\n                    2012...\n\n                                   MACE\n                    The Tannhauser Gate was a battle...\n\n     MACE and SANDRA look into each other's eyes, very worried.\n     Then...\n\n                                   SANDRA\n                    We'll have to sleep on the floor.\n\n                                   MACE\n                         (suddenly alarmed)\n                    Where's Nathan?\n\n     MACE is looking around.  He spots the open door to the bedroom, \n     hurries to it, and disappears.\n\n     SANDRA starts after him, looking worried...but before she gets to\n     the door, MACE reappears with NATHAN safely in his arms.\n\n                                   MACE\n                    If there's any danger to Nathan --\n\n                                   SANDRA\n                         (interrupting grimly)\n                    I won't permit danger to Nathan.\n\n     MACE and SANDRA lock eyes in firm understanding as we...\n\n                                                       CUT TO:\n\n     INT.  WAR SHIP - \"DAY\"\n\n     EXPLOSION!  SCREAMS!  SMOKE!  A SIREN!  We're in some kind of war\n     ship in outer space during a battle.\n\n     The interior is a lot like the interior of a submarine, cramped\n     even in the best conditions and right now the conditions are\n     awful as SOLDIERS in bulky space suits stumble through thick\n     smoke while a SIREN WHOOPS urgently and wounded SOLDIERS scream\n     in agony.\n\n     WHOOOOM!  Another EXPLOSION!  SCREAMING METAL!\n\n     Part of the bulkhead is shot away and the suction is like wind,\n     ripping SOLDIERS out of the hole into space..\n\n     We FOCUS ON a soldier in a space suit who's wedged himself behind\n     a cannon.  As we look closely at his visor, we recognize TODD\n     who's firing back at the enemy while all around him SOLDIERS are\n     screaming and dying as we...\n\n                                                       CUT TO:\n\n     INT.  BEDROOM - MORNING\n\n     SUDDEN SILENCE!  TODD blinks awake.  He looks around.\n\n     It's the same bedroom, but morning light is streaming in the high \n     window.\n\n     He can hear SOUNDS...LAUGHTER...coming from beyond the door.\n\n     INT.  OTHER ROOM\n\n     NATHAN is wobbling forward with wide eyes as MACE holds one of\n     his hands and SANDRA holds the other.  They're teaching the child\n     to walk, encouraging each step.  But when they let go, NATHAN\n     totters forward only one step before landing flat on his ass.\n     MACE and SANDRA laugh, making the whole thing a game, and NATHAN, \n     after a moment of confusion, joins in the laughter.  It's a warm \n     moment until SANDRA, sensing a presence, turns toward the\n     bedroom, suddenly serious.\n\n     MACE follows her look.\n\n     TODD is standing in the doorway, supporting himself on the door\n     frame...his soldier's eyes full of unspoken menace... one leg\n     heavily bandaged.\n\n                                   SANDRA\n                         (nervous)\n                    You must be...you must be feeling\n                    better.\n\n     TODD says nothing.  His eyes flick to NATHAN.\n\n     MACE is watching TODD sharply.\n\n                                   MACE\n                    We're teaching the boy to walk.\n\n                                   SANDRA\n                         (nervously filling silence)\n                    He's late learning.  He was sick for\n                    a long time.\n\n     TODD says nothing.  His eyes follow MACE who's gone to the corner\n     where he's seizing a heavy metal rod that might be a weapon.\n\n     TODD tenses.  Ready.  Dangerous.\n\n     As MACE turns toward him, MACE doesn't notice the danger in\n     TODD'S eyes.\n\n                                   MACE\n                    I got something for you.\n\n     He innocently approaches with the metal rod.\n\n     Super alert, TODD watches MACE hold the rod out to him.\n\n                                   MACE\n                    Here.\n\n     TODD looks mistrustful.\n\n                                   MACE\n                    Like this.\n\n     MACE demonstrates, using the rod like a cane.\n                                   MACE\n                    See?\n\n     Expressionless, watches MACE use the cane.\n\n                                   MACE\n                    Practice with it.  In a day or two\n                    maybe you'll be strong enough to go\n                    out to the garden with Sandra.\n\n     MACE never even realizes how much danger he was in.\n\n                                                       CUT TO:\n\n     INT.  OTHER ROOM - DAY - A LITTLE LATER\n\n     TODD's heavy boots come close to NATHAN, the cane clumps down,\n     just missing him.\n\n     NATHAN looks up with open-mouthed innocence and childlike wonder\n     at TODD who looms past him, walking very cautiously with the help\n     of a cane.\n\n     TODD looks down at NATHAN.  Their eyes meet for a moment.  TODD\n     is wearing one of the heavy parkas the pioneers wear.\n\n     SANDRA answers a KNOCK at the door, opens it, revealing ELLEN,\n     the ten-year-old, in the doorway.  Behind her are JOHNNY and\n     WILL, as well as several other CHILDREN of various ages.\n\n                                   ELLEN\n                    I came for Nathan.\n\n     But ELLEN's eyes are on TODD and so are the others crowding\n     behind her to peep over her shoulder.  They all want to get a\n     look at TODD, but when he looks in their direction, they retreat \n     shyly.\n\n     SANDRA is wearing a parka too.  She picks up NATHAN from where\n     he's sitting near TODD's feet and carries him to the door, giving\n     him a kiss, then handing him to ELLEN.\n\n     NATHAN starts to cry and holds his arms out to his mother as\n     ELLEN hugs him and comforts him.\n\n     TODD watches the drama as ELLEN and SANDRA comfort the child and \n     soothe his fears at being separated from his mother.\n\n     Nothing shows in TODD's eyes...but affection seems to fascinate\n     him.\n\n     As ELLEN and her cohorts hurry off with NATHAN, they sneak over-\n     the-shoulder glances at the strange monster, TODD.\n\n     Just then MACE, dressed in a heavy parka also, comes out of the \n     bedroom and heads for the door.\n\n                                   MACE\n                    Let's go.  Come on, Sergeant.\n\n     MACE is heading out the door as we...\n\n                                                       CUT TO:\n\n     EXT.  INSIDE THE TRENCH - NIGHT - MINUTES LATER\n\n     Single-file, a dozen PIONEERS move along a trench as the wind\n     SCREAMS overhead.\n\n     We DISCOVER the cane and boots of TODD among them.  The MAN in\n     front of TODD glances back at him occasionally, curious, while\n     MACE and SANDRA walk behind him.\n\n     As they pass huts, there are windows high in one sloping wall of\n     the trench.  TODD doesn't notice the distorted faces of the\n     CHILDREN peering out at him, their noses pressed against the \n     plexiglass, full of curiosity as we...\n\n                                                       CUT TO:\n\n     EXT.  A JUNCTION OF TRENCHES - DAY\n\n     Three trenches meet.  Some of the PIONEERS move off to the left,\n     some to the right.  MACE is going left, but SANDRA guides TODD\n     toward the right with her.\n\n                                   SANDRA\n                    This way...\n\n     MACE gives her a wave.  He waves at TODD too.  TODD looks\n     confused at the wave, then he salutes.\n\n     MACE is startled by that.  He sort of grins as we...\n\n                                                       CUT TO:\n\n     EXT.  GARDEN - DAY - LATER\n\n     A nasty little snake, a ten-inch VIPER, slithers through the dirt \n     among the neat rows of seedlings growing there until...\n\n     SQUASH!  One neat blow from the sharp edge of a trowel\n     decapitates the VIPER.\n\n     SANDRA flips the still wriggling thing aside and wipes her trowel \n     clean in the dirt as TODD watches with those blank snake eyes of\n     his.\n\n     They're on all fours in a garden.  The garden is simply a much\n     wider trench covered by a trellis so the light can be regulated.\n     There are already neat rows of vegetables are growing.  Behind\n     them, kneeling PIONEERS are planting new seedlings and weeding\n     around more mature plants.\n\n     SANDRA turns back to place a seedling in the dirt with only an\n     offhand glance at the dead VIPER.\n\n                                   SANDRA\n                    You have to watch out for them.\n                    They probably wouldn't kill someone\n                    your size, not if you were healthy\n                    anyway.  But they'd make you pretty\n                    sick.  Someone smaller...like me, or\n                    a child...\n\n     Her meaning clear, SANDRA continues to demonstrate to TODD how to \n     plant the seedling in the earth.\n\n                                   SANDRA\n                    In a month this one will be as big\n                    as those.\n\n     TODD follows her look to the other side of the trench where the\n     plants are already eighteen inches high.\n\n     Other PIONEERS, working on their hands and knees also, are\n     sneaking glances as TODD, among them, a middle-aged woman named\n     JUDITH and an older woman, EMMA.\n\n     SANDRA frowns one of their looks away protectively as she selects \n     another seedling from a tray and hands it to TODD.\n\n                                   SANDRA\n                    Here.  You try one.\n\n     TODD looks at it.  He doesn't exactly look scared, but he handles\n     it gingerly, seemingly intimidated by the delicate seedling.  He \n     starts to plant it carefully as we...\n\n                                                       CUT TO:\n\n     INT.  DINING COMMONS - EVENING\n\n     Jabbering VOICES, the click of utensils.  Heaping plates of food\n     are being passed the length of long tables set up in communal\n     style.  JOHNNY is kicking ELLEN under the table, WILL flips a\n     piece of food at TOMMY when his mother, ILONA, isn't looking, and\n     the outspoken SLADE is lecturing a pioneer named CHESTER.\n\n                                   SLADE\n                    You can't talk to a soldier no more\n                    than you can talk to a...a...bomb!\n                    Or a bullet!  They're trained,\n                    they're killing machines.  They got\n                    an objective and they go after that\n                    objective and nothing stops them but\n                    killing them.\n\n                                   CHESTER\n                         (a glance over his\n                          shoulder)\n                    Just one?  To kill us all?\n\n     The conversation gets the attention of JOHNNY and WILL who stop\n     food-fighting to listen to the adults talk.\n\n                                   SLADE\n                    First off, if there's one, there's\n                    more.  That's how it is, soldiers\n                    travel in bunches.  Second, they\n                    don't waste soldiers on folks\n                    like us, that's for police!  Training\n                    soldiers to kill weaklings like us\n                    is not what they call \"cost\n                    effective.\"\n\n                                   CHESTER\n                    Then who do they fight?\n\n                                   SLADE\n                    Other soldiers!  There's a saying,\n                    \"Soldiers deserve soldiers.\"\n\n     ANGLE ON ILONA noticing WILL and TOMMY listening.\n\n                                   ILONA\n                    Slade, hush up.\n\n     ANGLE ON TOMMY and WILL glancing toward the next table.\n\n     ANGLE ON THE NEXT TABLE where TODD, wedged between SANDRA and\n     MACE, is eating like a machine, looking neither right nor left as \n     people jabber all around him.\n\n     ANGLE ON JUDITH whispering to EMMA at a nearby table as she\n     watches TODD eat.\n\n                                   JUDITH\n                    You see how much he's eating?\n\n     ANGLE ON SLADE who turns now and boldly addresses TODD across the\n     gap between the tables...\n\n                                   SLADE\n                    I don't see how you can not remember\n                    how you got here, Sergeant.\n\n     There's a sudden hush in the noisy room, broken only by a few\n     urgent whispers and a cough.\n\n     TODD looks up from his food and meets SLADE'S look.\n\n     SANDRA scowls at SLADE as SLADE persists...\n\n                                   SLADE\n                    You're not a deserter, are you...\n                    Sergeant?\n\n     The silence is even more charged than before.\n\n     SANDRA looks alarmed.  Someone coughs.  The tension is\n     unbearable.\n\n                                   TODD\n                    No, sir.\n\n     A sigh of relief from everybody!  But SLADE presses on.\n\n                                   SLADE\n                    Then how come you're not with your\n                    unit?\n\n                                   JIMMY PIG\n                    Oh, come on, Slade, let the man eat.\n\n                                   SLADE\n                    It's not an unreasonable question.\n                         (to Todd)\n                    How about it, Sergeant?\n\n     ON TODD, actually struggling with the question...\n     remembering.  Suddenly he blurts...\n\n                                   TODD\n                    I was...replaced.\n\n                                   MACE\n                    Replaced?\n\n     TODD hesitates for half a second before answering.\n\n                                   TODD\n                    By a better soldier, sir.\n\n     There are looks exchanged among the PIONEERS as we...\n\n                                                       CUT TO:\n\n     EXT.  GARDEN - DAY\n\n     A little seedling is fitted into the earth gently.  TODD's strong \n     hands pat the earth around it.\n\n     TODD reaches for another seedling.  He's one of a group of ten\n     PIONEERS, all on their hands and knees, all working intently, \n     silently.  They seem to have accepted him.  Nobody stares.\n\n     TODD is carefully patting the next seedling in the ground when\n     something causes him to look up.\n\n     Five ENEMY SOLDIERS in torn and dirty uniforms are looming over\n     him, weapons pointed at him.  All around them is a desert of sand\n     stretching forever under a baking sun.\n\n     One of the soldiers kicks TODD.\n\n     ANGLE ON EMMA, JUDITH, and several other PIONEER WOMEN exchanging\n     nervous glances as they look back to where TODD's kneeling.\n\n     There are no soldiers...but somehow, he's trampled several rows\n     of seedlings.\n\n     TODD looks toward them, confused, disoriented by his \"memory.\"\n\n     The women look away quickly, frightened, and we...\n\n                                                       CUT TO:\n\n     INT.  OTHER ROOM - NIGHT\n\n     SANDRA is changing NATHAN's diaper as she chatters, her back to\n     TODD.\n\n                                   SANDRA\n                    ...And it got worse and worse.  My\n                    father hadn't had any work in three\n                    months and...also...there were other\n                    things...violence...  political\n                    feelings.  My father said he'd heard\n                    it was better in the Trinity moons.\n                    A lot of other people must have had\n                    the same idea because the ship was\n                    jammed with people...mostly\n                    families.  That's probably why it\n                    broke down...  overloaded.\n\n     Across the room, TODD, wearing a T-shirt and baggy pants is\n     sitting on a stool, his face impassive as ever.\n\n     As SANDRA talks, her back to him, TODD's eyes are on the contours\n     of her body against the shift she's wearing.  It's very...erotic.\n\n                                   SANDRA\n                    Even after they made the repairs, it\n                    barely got off the ground, it was an\n                    old converted mining transport, a\n                    piece of junk to start with.  It\n                    just...dropped.  Maybe you saw\n                    what's left of it...out there in the\n                    wind.  A lot of people died.  And we\n                    couldn't make any radio contact...\n                    So we were stuck here.  Nobody was\n                    happy about it.  A few years later,\n                    when the dumpers started coming over\n                    and dropping stuff, people tried to\n                    get their attention with explosions\n                    and fires.  But it didn't work.\n                    They must be unmanned...or they just\n                    don't care.  Maybe they think we're\n                    garbage too!\n\n     TODD'S face is as impassive as ever while his eyes caress the\n     shape of her body...and she, unaware, continues to reminisce.\n\n                                   SANDRA\n                    So there really wasn't any choice.\n                    People had to pull together and make\n                    the best of it.  We became a...\n                    community.\n\n     As SANDRA maneuvers NATHAN, TODD catches glimpses of her breasts \n     pushing against the material of the shift.  She continues, still\n     not noticing where his attention is.\n\n                                   SANDRA\n                    One good thing...nobody bothers us.\n                    Who'd want to fight over a\n                    godforsaken place like this?\n\n     A wry laugh.  She turns to put NATHAN down on the floor and\n     catches TODD's eyes just as he shifts them quickly from her\n     breasts.\n\n     For a moment it's awkward...she looks at him...then she recovers.\n\n                                   SANDRA\n                    I guess that's what you like!  The\n                    fighting, I mean.  The wars.\n                         (unsure, a question\n                          really)\n                    You must...you're a soldier...\n\n     TODD doesn't answer as we...\n\n                                                       CUT TO:\n\n     INT.  CORRIDOR (AND MEETING ROOM) - DAY\n\n     The CHILDREN are peeking around a doorway, watching something in\n     the meeting room.\n\n     HAWKINS, coming along the dirt-walled corridor, spots the\n     CHILDREN ahead.\n\n                                   HAWKINS\n                    You children are supposed to be\n                    doing lessons.\n\n     The CHILDREN barely acknowledge her as she comes even with them.\n     She looks at what they're looking at.\n\n     What they're seeing through the doorway is TODD, shirtless, doing\n     an eerie sequence of tai chi exercises.  His muscular body\n     ripples, revealing an incredible map of scar tissue that speaks\n     eloquently of the life he's led...gash marks, long zippers of \n     stitches, the puckered patches of burns.\n\n     HAWKINS watches for a long moment, her eyes worried.\n\n     In the midst of a slow graceful movement, TODD suddenly whirls\n     and delivers a lightning blow to an unseen enemy with amazing\n     speed and fury, the terrible force contained in the movement all\n     too obvious.\n\n     Even as HAWKINS and the CHILDREN gasp silently, TODD returns to\n     the graceful, almost balletic movement, even spookier now, that \n     preceded the deadly thrust.\n\n     The CHILDREN's eyes are like saucers, their jaws agape.\n\n     HAWKINS shudders...and breaks the hypnotic spell, speaking aloud\n     to the children.\n\n                                   HAWKINS\n                    Lessons.\n\n                                                       CUT TO:\n\n     EXT.  INSIDE TRENCH - NIGHT\n\n     It's dark, the wind's HOWLING just above the trench walls as TODD\n     peers into a faintly lighted window in the wall of the trench.\n\n     TODD'S POV THROUGH THE BEDROOM WINDOW reveals a tender moment\n     between MACE and SANDRA as they enter the bedroom and kiss.  A \n     flickering candle on a low table, the only light, exaggerates \n     their shadows.\n\n     ANGLE ON TODD, his face revealing no feelings as he turns away.\n\n     Light spills from other windows, some more brightly lit, as TODD \n     begins to jog along the trench, gradually picking up speed, until\n     he's running hard through intermittent pools of light in the maze\n     of dark trenches.\n\n                                                       CUT TO:\n\n     EXT.  BARREN WASTE - DAY\n\n     Stillness!  No wind!  Everything is quiet.  Bits of junk are\n     strewn across the landscape under the four suns.\n\n                                   MACE'S VOICE (O.S.)\n                    She's down now, but she'll come up\n                    again.  Always does.\n\n     EXT.  INSIDE A TRENCH\n\n     As MACE continues talking to TODD, he loads the pockets of his\n     heavy parka with miscellaneous hunks of metal.\n\n                                   MACE\n                         (continuing)\n                    That's why we're weighing down.  And\n                    that's why we're always on the wire\n                    even when the wind's down, like now.\n                    You don't get much warning.  Here,\n                    load up, you'll want the weight, I\n                    promise.\n\n     MACE hands heavy hunks of metal to TODD who's wearing a parka\n     like MACE'S.  He pockets the metal obediently.\n\n     Behind them a small crowd of PIONEERS are doing the same:  JIMMY\n     PIG, SLADE, CHESTER, RED, a woman named SALLY and several OTHERS.\n     In addition to the parkas, they wear eskimo-style eye-protectors\n     and carry canteens, tools, and coils of rope attached to various\n     parts of their outfits.\n\n     ANGLE ON MACE noticing TODD eyeing the rifle JIMMY PIG is\n     carrying.\n\n                                   MACE\n                    Oh, we're not going to shoot\n                    anything.  That's not what we mean\n                    by \"hunting.\"\n                         (then, laughing, to\n                          Jimmy Pig)\n                    Jimmy Pig, you're not going to shoot\n                    anything, are you?\n\n                                   JIMMY PIG\n                         (laughing)\n                    What could I hit?\n\n                                   MACE\n                         (to Todd)\n                    It's how we call for help.  Two\n                    shots.  There'll be someone on duty,\n                    listening in case we get off the\n                    wire and get lost or something.  We\n                    have flares too.  Come on.\n\n     Other are already climbing the ladder out of the trench to the\n     surface above as MACE urges TODD to follow.\n\n                                                       CUT TO:\n\n     EXT.  \"STEEL HENGE\" - DAY\n\n     It's very still, no wind.  The little group of PIONEERS is moving\n     along a wire that passes close to the towering ruins of the\n     wrecked spaceship.  They are tiny figures in the vast landscape.\n\n     CLOSER ON TODD AND MACE as they plod along in the line of\n     PIONEERS.  MACE indicates the wreck off to the right.\n\n                                   MACE\n                    Sandra said she told you how we\n                    wound up here.  Our parents and so\n                    on.\n                         (turning left,\n                          indicating)\n                    Over here, we call these \"catcher\n                    trenches.\"\n\n     TODD follows his look to a long open trench leading, apparently, \n     nowhere.\n\n                                   MACE\n                         (continuing)\n                    Smaller stuff that blows across the\n                    ground, it falls in these trenches,\n                    it works sort of like a filter.  We\n                    go through the trenches sometimes\n                    and get some good stuff.\n\n     As they pass close along the trench,  TODD looks in and observes\n     the trench is knee deep in muddy water with rusty machine parts\n     and assorted junk protruding.\n\n     MACE chuckles at the sight.\n\n                                   MACE\n                    We try to work 'em when they're dry.\n                    It's lousy going in there when\n                    they're flooded.  You can see...\n\n     A sudden SHOUT, \"HEYYUP!  YO!\" distracts them.\n\n     TODD looks forward, sees RED pointing to a chunk of steel a\n     hundred yards off the wire.\n\n     ANGLE ON JIMMY PIG, already fastening his safety rope and a\n     second rope to the wire, then heading off toward the piece of\n     steel, trailing the two ropes.\n\n     ANGLE ON MACE, explaining the procedure to TODD.\n\n                                   MACE\n                    Whatever looks useful, if we can get\n                    a rope to it, we'll go for it.  But\n                    you can't ever go further than your\n                    safety line because it'll come up on\n                    you with sometimes maybe ten seconds\n                    or even less.\n\n     TODD is watching JIMMY PIG as he approaches the piece of steel\n     and starts to attach his rope to it.\n\n                                   MACE\n                    Like right now.  You hear that?\n\n     TODD listens.\n\n     Nothing at first...then a very faint WHISTLING.  The sound he\n     heard that first night when he was on the settlement \"roof.\"\n\n                                   MACE\n                    It's close when you hear that.\n\n     TODD can see JIMMY PIG.  He's attached the rope to the steel and\n     he gives a signal.\n\n     As PIONEERS start to haul on the line, pulling the steel toward\n     them, MACE shouts at JIMMY PIG.\n\n                                   MACE\n                    SHE'S GONNA BLOW, JIMMY.\n\n     JIMMY waves, starts back toward them.\n\n     MACE indicates for TODD to help haul the steel and the two of\n     them are just joining in the effort when...\n\n     WHOOOOOOOOOO!  THE WIND IS SUDDEN AND FEROCIOUS!  IT STAGGERS\n     THEM!\n\n                                   MACE\n                    GRAB ON, SERGEANT!\n\n     TODD follows MACE'S example and, like the others, grabs the wire\n     and hangs on as the wind SCREAMS and tears at them.\n\n     One of the pioneers, CHESTER, shouts, points.\n\n     They all see JIMMY PIG being blown faster than he can run, his\n     legs churning desperately to keep up with his wind-propelled\n     body.  To no avail!  He's suddenly airborne, his legs still\n     churning like cartoon legs as he flaps helplessly at the end of\n     his safety tether like a kite, fifty feet in the air.\n\n     An eighty-pound steel barrel blows past, tumbling in the wind.\n     Bits of junk zip dangerously around like missiles.\n\n     ANGLE ON THE PIONEERS, crouched low on their knees against the\n     wind, clutching the wire with one hand while they pull on JIMMY\n     PIG'S safety line.  But the wind is too strong...until suddenly\n     TODD is pulling, and TODD'S strength makes the difference...\n     slowly JIMMY PIG is pulled toward them...and Pioneers exchange\n     amazed glances at TODD'S strength.\n\n     As he pulls, TODD notices what the others don't...\n\n     ANGLE ON THE RIFLE dropped by JIMMY PIG, ten yards away.\n\n     ANGLE ON JIMMY PIG as he's hauled safely in to the group of\n     PIONEERS who clap him on the back and hug him.  CHESTER is\n     laughing so hard he can barely stand up as he tries to describe\n     and mimic JIMMY'S desperate effort to outrun the force of the\n     wind...\n\n                                   CHESTER\n                         (shouting, guffawing)\n                    JIMMY...RUNNING...CAN'T...HA HA\n                    CAN'T...KEEP UP WITH HIMSELF...\n                    HA HA HA...\n\n     CHESTER breaks off, suddenly sober, staring off, and the others\n     turn to see what he's looking at.  Everybody stops laughing.\n\n     ANGLE ON TODD, carefully moving away from the wire to retrieve\n     the rifle!!!  The WIND is dropping off some, enough to stand.\n\n     ANGLE ON MACE and the other PIONEERS reacting with alarm at the\n     sight of TODD picking up the rifle.\n\n     ANGLE ON TODD as he turns, rifle in hand.\n\n     TODD'S POV of the PIONEERS staring at him, the WIND diminishing \n     further.\n\n     ANGLE ON TODD looking toward them.  Nothing shows on his face.\n\n     ANGLE ON SLADE looking sour.  Trouble!  Just what he expected.\n\n     ANGLE ON MACE, taking a deep breath, smiling as he moves toward\n     TODD, holding out his free hand for the rifle...\n\n                                   MACE\n                    Uh, thanks, Sergeant.  Thanks a\n                    lot...\n\n     But MACE breaks off, realizing that TODD'S attention is\n     elsewhere.\n\n     TODD is beyond MACE toward the landscape.\n\n     MACE (and the other PIONEERS) turn to see what TODD'S looking at.\n\n     ANGLE ON THE \"JUNK MOUNTAINS\" in the distance, several miles off, \n     where, hovering high above the junk mountains, an ancient DUMPER\n     SHIP issues a steady stream of metal and concrete debris onto the\n     junk heaps far below.  The faint THUNDER of the refuse tumbling\n     onto the steep slopes is just audible over the SOUND of the wind.\n\n     CLOSE ON TODD, as realizes how he got here.\n\n     ANGLE ON MACE, reacting to TODD'S intense interest.\n\n                                   MACE\n                    Dumpers.  They come every twenty or\n                    thirty days.\n\n     As TODD turns and looks at MACE, MACE puts out his hand again for\n     the gun.\n\n     TODD seems to notice the weapon in his hand for the first time.\n     Unhesitatingly, he hands the rifle to MACE...\n\n     As MACE casually takes the weapon, the PIONEERS breathe a sigh of\n     relief, grinning again as the tension eases.\n\n     TODD has turned his gaze back to the DUMPER SHIP, fascinated.  So \n     that's what they did to him!\n\n     Just then, JIMMY PIG claps TODD heartily on the shoulder.\n\n                                   JIMMY PIG\n                    Thanks, partner.  These no-goods\n                    woulda just let me blow away.\n\n     TODD, reacting to the smack on his shoulder, looks at JIMMY PIG\n     like what was that?  Are you hitting me?\n\n     But all the PIONEERS are gathering around TODD in such a jovial\n     manner that the puzzled soldier sort of understands this isn't an\n     attack.\n\n                                                       CUT TO:\n\n     INT.  OFFICE (OTHER WORLD) - NIGHT\n\n     A CHRISTMAS TREE!  The corny little tree with plastic needles,\n     blinking lights, and topped with a super cute angel is only a\n     foot high.  It's sitting on CHURCH's cluttered desk next to\n     framed photographs of CHURCH's wife and children.  We can hear\n     MEKUM's voice badly transmitted...\n\n                                   MEKUM (V.O.)\n                    Sorry to disturb the tranquillity of\n                    outer space on Christmas Eve, but\n                    I'm off to the Caribbean in a few\n                    hours, and I wanted to make sure\n                    you'd got the transmission on the\n                    security sweep.\n\n     Glowering at the monitor where MEKUM's badly transmitted VIDEO\n     IMAGE is quivering and distorting, CHURCH waves the print-out map\n     he's holding in his hand, a map showing hundreds of little dots \n     against a vast field, stars and moons in the vast sea of space. \n     RUBRICK and SLOAN watch as CHURCH addresses MEKUM's image \n     indignantly.\n\n                                   CHURCH\n                    We got it all right.  This is an\n                    outpost here, not the Third Army!\n                    You've got us securing thirty-four\n                    locations and erecting monitor units\n                    in one month and --\n\n                                   MEKUM\n                         (interrupting)\n                    Piece of cake, guys!  These are\n                    totally remote, totally uninhabited\n                    territories.  All you do is set\n                    down, send out a patrol purely as a\n                    formality, then have those veterans\n                    of yours put up an A-Type unmanned\n                    monitoring unit.  You should be on\n                    about number twenty-five by the time\n                    I get back from my vacation...\n\n                                   CHURCH\n                    What if we do run into people...\n                    say squatters or refugees?\n\n                                   MEKUM\n                         (a frown)\n                    Well, you sure as hell don't want to\n                    get involved in evacuating people\n                    and that sort of thing.\n                         (then, meaningfully)\n                    My advice would be to...\"avoid\n                    paperwork.\"\n\n                                   CHURCH\n                    Eliminate them, you mean.\n                                   MEKUM\n                    Well, no one's out there, but\n                    officially these are \"hostile\n                    zones.\"  Therefore you'd be within\n                    your rights to classify anyone as\n                    \"hostile,\" I think.\n                    But I repeat, you should be worried\n                    about boredom, not action.  Any\n                    other questions before I go?\n\n     CHURCH hesitates.  SLOAN and RUBRICK look at him.  Then CHURCH\n     blurts a question, his voice breaking...\n\n                                   CHURCH\n                    Down there...is it snowing?\n\n                                   MEKUM\n                         (a smirk)\n                    Not in the Caribbean.  Have a good\n                    Christmas, guys.  See you when I get\n                    back.\n\n     MEKUM'S IMAGE disappears and the video screen goes blank, leaving\n     a glum silence broken only by the DRUMMING of the rain on the\n     roof.\n\n     CHURCH moodily strolls toward his desk, and his eyes go to the \n     photographs.\n\n     His wife and children smile back at him from the pictures.\n\n     Just then SLOAN taps him, and be turns to see her handing him a\n     cup full of amber liquid.\n\n                                   SLOAN\n                    Merry Christmas, Captain.\n\n     RUBRICK is pouring another glass from a bottle of Scotch as the\n     little tree winks on and off, and we...\n\n                                                       CUT TO:\n\n     INT.  BARRACKS - NIGHT\n\n     Silence.  Darkness.  Dim shapes in the darkness, hard to\n     distinguish.\n\n     Rain BEATS on the roof monotonously, relentlessly.\n\n     The room is alive with BREATHING.\n\n     Then we hear a MUFFLED WHOOP from outside.\n\n     The darkness is tense, the BREATHING changes rhythm.\n\n     The RATTLE of the door breaks the quiet.\n\n     The door swings open, a flashlight stabs the dark.\n\n     A woman GIGGLES:  SLOAN!\n\n     The flashlight beams and wavers in the darkness, catching brief\n     glimpses of the faces of the NEW SOLDIERS.  Their eyes glitter in\n     the lurching beam, their faces are ghostly like vampires.\n\n     RUBRICK switches on a dim overhead lamp as he and SLOAN (holding\n     the flashlight) and CHURCH stagger drunkenly into the bunkhouse, \n     carrying a couple of half-empty bottles.\n\n                                   SLOAN\n                    Hi, fellas.  At ease!\n\n                                   RUBRICK\n                    Merry Christmas, everybody.\n\n     Eyes riveted on the THREE OFFICERS, the NEW SOLDIERS are\n     unresponsive to Christmas cheer.  In fact, they look almost\n     angry, like big dangerous animals, as the three OFFICERS stagger \n     stupidly down the row of bunks, every eye following them.\n\n                                   CHURCH\n                    We brought you a little Christmas\n                    tree.\n\n     CHURCH almost falls over as he places the tree on the floor\n\n     As stone faces watch him without expression, RUBRICK waves a\n     couple of bottles.\n\n                                   RUBRICK\n                    And some good cheer.\n\n     SLOAN, giggling, does a provocative bump and grind.\n\n                                   SLOAN\n                    How about some Christmas pussy,\n                    guys?  Anybody for a quick piece?\n\n     The NEW SOLDIERS don't react.  Stone faces.\n                                   RUBRICK\n                         (smirking)\n                    That's \"conduct unbecoming,\" Sloan.\n\n                                   SLOAN\n                    It's Christmas!  Haven't you heard\n                    of piece on earth?  \"Piece on\n                    earth,\" get it?\n\n                                   CHURCH\n                         (suddenly serious,\n                          sober)\n                    Christ, I wish we were on Earth.\n\n     RUBRICK sets three bottles down and indicates them to the NEW\n     SOLDIERS.\n\n                                   RUBRICK\n                    Eat, drink, and be merry, men.  For\n                    tomorrow you go on patrol in the \n                    \"hostile zone.\"\n\n     RUBRICK burps stupidly as the NEW SOLDIERS stare back at him from \n     their bunks, muscles bulging, eyes glittering, nothing but danger\n     in their stone faces as we...\n\n                                                       CUT TO:\n\n     INT.  PIONEER MEETING ROOM - NIGHT\n\n     \"JINGLE BELLS, JINGLE BELLS, JINGLE ALL THE WAY.\"  In sharp\n     contrast to the gloom of the soldier Christmas, the PIONEERS,\n     MEN, WOMEN and CHILDREN, are SINGING and celebrating.\n\n     There's a six-foot carved wooden tree festooned with makeshift \n     decorations and ringed with heaps of presents in crude wrapping.\n\n     There's an appetizing looking buffet and a punchbowl.\n\n     ANGLE ON TODD seated against a wall not far from the door.  He\n     stares uncomprehendingly at the merriment all around him.  What\n     on earth is going on?  What are they doing?\n\n     JIMMY PIG is marching around in a Santa Claus costume, doling out\n     presents to ELLEN, WILL, TOMMY, JOHNNY and OTHER CHILDREN.\n\n                                   JIMMY PIG\n                    HO HO HO!  HO HO HO!\n\n     Passing TODD, JIMMY PIG acknowledges him with a wink and a\n     special \"HO HO HO.\"\n\n     TODD'S eyes give away his confusion.  What the fuck is this?\n     JIMMY PIG in a fake beard and a fake stomach?  This is the\n     craziest shit TODD has ever encountered.\n\n     ANGLE ON NATHAN, a wrapped present in hand.  He hasn't a clue\n     what it is or what he should do with it.\n\n     Laughing, MACE and SANDRA hover over him, showing him how to pull\n     the wrapping off.  Great idea!  NATHAN likes pulling wrapping\n     off!  That's fun.  SANDRA and MACE watch joyfully as NATHAN tears\n     at the wrapping enthusiastically.\n\n     ANGLE ON TODD getting to his feet.\n\n     ANGLE ON NATHAN pulling away the last of the wrapping to expose a\n     pull toy, a METAL BIRD on crude wheels made of wire and junk.\n\n     MACE takes the toy, demonstrates pulling it.  The wings flap as\n     the wheels turn!\n\n     NATHAN reacts with delight and amazement!  Then grabs it!\n\n     A SUDDEN SCREECH...\n\n     ANGLE ON TODD looking alarmed.  He's on his way to the door, but\n     EMMA is charging at him, SHRIEKING!!!\n\n     Not sure whether this is an attack or not, TODD watches the older\n     woman scramble onto a stool next to him, still SHRIEKING giddily.\n\n     As TODD eyes her (and everybody else) warily, she gives him a\n     peck on the cheek and points over head.\n\n     TODD looks up, sees a strange cloth decoration with a sign on it\n     that says \"MISTLETOE.\"\n\n     Means nothing to TODD.  There's a burst of applause as EMMA\n     scrambles off the stool.  Somebody starts to sing \"GOD REST YE\n     MERRY GENTLEMEN.\"\n\n     A MONTAGE OF FACES:  JIMMY \"SANTA\" PIG, MACE, SANDRA, RED,\n     CHESTER, SALLY, ELLEN, HAWKINS, even SLADE, SINGING.\n\n     ANGLE ON THE DOOR.  No sign of TODD!  Gone!\n\n                                                       CUT TO:\n\n     EXT.  \"ROOF\" - NIGHT - MINUTES LATER\n\n     A low wind MOANS and mingles with strains of \"OH, HOLY NIGHT\" as\n     TODD bellies up to the \"skylight\" and peers down at the scene\n     below in the Meeting Room.\n\n     TODD'S POV THROUGH THE SKYLIGHT.  The merriment has evolved into\n     a more spiritual mood as the PIONEERS join in the solemn hymn.\n\n     But TODD spots NATHAN trying to pull his pull toy along so the\n     wings flap.  NATHAN is pretty wobbly and he goes down hard and\n     starts to cry.\n\n     Immediately SANDRA disengages from the adults and rushes to the \n     sobbing NATHAN and clutches him to her breast, soothing him...and\n     MACE joins her, hovering over his son.\n\n     ANGLE ON TODD, watching.  After a moment, TODD scrambles off the\n     roof and drops into the adjoining trench while \"OH, HOLY NIGHT\"\n     continues to blend with the soughing WIND.\n\n     EXT.  INSIDE THE TRENCH\n\n     Lit by spill from a window in the wall of the trench, TODD starts \n     doing push-ups.  One-two-three-four-five-six-fast-fast-fast-fast.\n\n                                                       CUT TO:\n\n     INT.  CORRIDOR AND MEETING ROOM/SETTLEMENT - (ANOTHER) DAY\n\n     HAWKINS is walking along the corridor outside the meeting room\n     when she hears strange SOUNDS.  She approaches the door and looks\n     in.\n\n     ELLEN and other CHILDREN (including NATHAN) are playing\n     children's games on the floor, paying no attention to the source\n     of the strange noises...JOHNNY and WILL.\n\n     JOHNNY and WILL are doing exercises, obviously inspired by TODD's \n     martial calisthenics, and including the sudden violent movements.\n\n     As the two boys make their ritual grunting noises, HAWKlNS frowns\n     a worried frown, and we...\n\n                                                       CUT TO:\n\n     EXT.  TRENCH GARDEN - DAY\n\n     The seedlings have grown to twelve-inch stalks.  SANDRA is\n     pulling some from the ground as TODD imitates her.  She shows him\n     the fat edible root.\n\n                                   SANDRA\n                    We'll eat these.\n\n     Other PIONEERS are also harvesting, with occasional glances at\n     TODD as we...\n\n                                                       CUT TO:\n\n     INT.  OTHER ROOM - DAY\n\n     Cleaning vegetables, SANDRA is separating the roots, shaking the\n     dirt off, cutting away the excess.\n\n     TODD is carefully following her example, cutting the stalks away\n     with the knife.\n\n     NATHAN is tottering across the floor an a beginner's wobbly legs.\n\n                                   SANDRA\n                    It seemed like he was never going to\n                    walk.  Then all of a sudden...he's\n                    an expert.\n\n     Whump!  NATHAN falls on his ass.\n\n                                   SANDRA\n                         (a laugh)\n                    Well, not quite an expert.\n\n     TODD watches SANDRA go to NATHAN and hug him affectionately.\n\n     Turning back to the vegetables, stone faced, TODD cuts his\n     finger.  Blood flows.  He ignores it, continues working...\n\n     But SANDRA, returning to the vegetables, notices TODD's cut\n     finger and immediately grabs a rag and takes his hand.\n\n     TODD looks startled is she takes his finger.  Then, staunching\n     the blood with the rag, she looks him in the eye, curious.\n\n                                   SANDRA\n                    Sergeant Todd...what's it\n                    like...what's it like being a\n                    soldier?\n\n     What's it like...?  TODD stares at her, trying to process the\n     question.  Seeing his difficulty SANDRA tries to help...\n\n                                   SANDRA\n                    What do you think about?\n\n     No answer, a stare.\n\n                                   SANDRA\n                    Do you think about food?  Or women?\n                    You must think about something.\n\n     TODD gulps.  His blank stare could pass for stupidity.\n\n                                   SANDRA\n                    What about feelings then?  You must\n                    have feelings.  You must feel\n                    something.\n\n     TODD wets his lips.  He seems about to answer...and yet it's\n     difficult for him.  He could kill a person easier.\n\n     On the floor NATHAN GOOS happily, oblivious.\n\n                                   TODD\n                         (at last)\n                    Fear.\n\n                                   SANDRA\n                         (startled)\n                    Fear!  You mean...you feel afraid?\n                         (as he nods)\n                    That's when you're in battle...\n                    What about other times?  Now, for\n                    example?\n\n                                   TODD\n                    Fear.\n\n                                   SANDRA\n                         (amazed)\n                    Now?\n\n                                   TODD\n                    Always.\n\n     A stunned silence.  Finally SANDRA speaks...\n\n                                   SANDRA\n                    You don't...look afraid.  You look\n                    fearless.\n\n     TODD looks at her.  This is incredibly difficult for him, like \n     physical labor.  He wets his lips and take a breath.\n\n                                   TODD\n                    Fear and...discipline.\n\n                                   SANDRA\n                         (growing horror)\n                    Oh, my God.  But there's nothing to\n                    be afraid of here.  I can't hurt\n                    you.  I wouldn't.\n\n                                   TODD\n                    Always.  It makes us...alert.\n\n     SANDRA is overwhelmed.  She reaches for him, hugs him to her\n     breast like a little baby, holding him.\n\n     But TODD is as tense in her arms as steel.  He can't relax.  He's\n     even trembling.\n\n     NATHAN, on the floor, looks up, smiles innocently.\n\n     SANDRA lets go of TODD and steps back, looking at him, her face\n     troubled, as we...\n\n                                                       CUT TO:\n\n     INT.  MEETING ROOM - DAY\n\n     ELLEN is supervising block building (babysitting) with several of\n     the younger children (OMAR, BUCKY, ANGIE and JANICE) while WILL\n     and TOMMY play their own separate games close by.  Then WILL\n     looks up and sees something disturbing.\n\n                                   WILL\n                    You're not supposed to do that\n                    anymore.\n\n     He's speaking to JOHNNY who is doing martial exercises.\n\n                                   JOHNNY\n                    So what?  I'm a soldier.\n\n                                   WILL\n                    They're gonna kick him out.\n\n     ELLEN looks up from the blocks.\n\n                                   ELLEN\n                    They can't kick him out...\n\n                                   WILL\n                    They're gonna.  My father --\n\n                                   ELLEN\n                         (interrupting strongly)\n                   My mother says when someone's sick\n                   or hurt, you have to help them.  You\n                   don't have a choice.\n\n                                   JOHNNY\n                         (getting interested)\n                   Yeah, but what if the hurt person\n                   is...evil?\n\n                                   ELLEN\n                   You still have to help them...\n                   because if you don't, you're evil!\n\n                                   WILL\n                         (importantly)\n                   My father says...uh...he says,\n                   \"Soldiers deserve soldiers.\"\n\n                                   TOM\n                   Yeah.  That's what my father said\n                   too.\n\n                                   ELLEN\n                   My father's making Sergeant Todd a\n                   scarf because he saved his life one\n                   time.  He's knitting it.\n                                   WILL\n                   That's dumb.  Your father's dumb.\n\n     WILL is smirking with satisfaction at having settled that when\n     out of nowhere ELLEN's little fist hits him hard on the nose.\n     WILL looks stunned.  Blood oozes from his nose.  He starts to\n     cry.\n\n     ELLEN looks horrified at what she's done as we...\n\n                                                       CUT TO:\n\n     INT.  OTHER ROOM - DAY\n\n     The scarf!  It's been knitted with an elaborate and colorful\n     design.\n\n                                   JIMMY PIG'S WIFE (O.S.)\n                   Jimmy knitted it himself.  He worked\n                   on it for two months.\n\n     SANDRA is examining the knitted scarf as JIMMY PIG and his WIFE\n     stand in the doorway.\n\n                                   SANDRA\n                   It's beautiful, Jimmy.  He'll love\n                   it.\n\n     JIMMY PIG looks very embarrassed.  He shrugs.\n\n                                   JIMMY PIG\n                   He saved my life out there.  I guess\n                   Mace told you.\n\n                                   SANDRA\n                         (nods)\n                   You should give it to him yourself.\n                   I think he's in the meeting room...\n                   doing...exercises.\n\n     JIMMY PIG nods, takes the knitted scarf back from SANDRA as we...\n\n                                                       CUT TO:\n\n     EXT.  ALLEY/CITY - NIGHT\n\n     Frantic CIVILIANS, mostly women and children, are illuminated by \n     FLASHES from rocket fire overhead as they scramble for cover\n     amidst heavy CROSSFIRE from automatic weapons.\n\n     A terrified LITTLE GIRL, separated from her family, seeks shelter\n     in a doorway when suddenly she's confronted by THREE SOLDIERS IN\n     RED UNIFORMS looming over her.\n\n     Looking up in abject horror, she sees a RED SOLDIER casually pan\n     his assault rifle, pointing the muzzle right at her from only a\n     foot away, unmistakably flexing to fire.\n\n     BLAM!  Suddenly the RED SOLDIER is blown backwards violently,\n     shot in the chest.\n\n     ANGLE ON TODD, visored, in a torn black uniform, firing again.\n\n     BLAM!  A SECOND RED SOLDIER goes down.\n\n     CLICK!  TODD's weapon jams.\n\n     As the LITTLE GIRL, amazed to be alive, watches open mouthed,\n     TODD swings his weapon like a club, attacking the THIRD RED\n     SOLDIER before he can aim.\n\n     Then she runs, leaving TODD savagely beating the THIRD RED\n     SOLDIER to death.\n\n     TODD is delivering a final savage blow to the prone body when a \n     movement or shadow catches the corner of his eye and he whirls \n     savagely to defend himself from behind --\n\n     INT.  MEETING ROOM - DAY\n\n     WHUMP!  JIMMY PIG is slammed up against the wall of the meeting\n     room, TODD's big hand around his neck.\n     Gurgling desperately, his eyes popping out of his head, JIMMY PIG\n     stares helplessly into TODD's merciless soldier eyes and his\n     stone face only inches away.\n\n     TODD blinks.  He sees he's got a terrified JIMMY PIG pinned to\n     the wall, his feet dangling two feet off the floor.  Slowly he\n     lowers JIMMY PIG to the floor.\n\n     All JIMMY PIG can do is squeak desperately and point to the\n     floor.\n\n                                   JIMMY PIG\n                   Scarf!  Scarf!\n\n     TODD looks down.  He sees a knit scarf lying on the floor.  He\n     doesn't understand.  He looks up.\n\n     He sees JIMMY PIG'S WIFE, HAWKINS, SLADE, and several other\n     PIONEERS standing in the doorway of the meeting room, their\n     stunned expressions indicating they just saw something\n     horrifying.\n\n     TODD stands there, isolated, bare-chested, his huge muscles\n     glistening with sweat, decorated with terrible scars and\n     mysterious tattoos, as we...\n\n                                                       CUT TO:\n\n     INT.  OTHER LIVING QUARTERS - NIGHT\n\n     EVA, Johnny's mother, is reacting, horrified.\n\n                                   EVA\n                   What....?  What... are...those?\n                   Chester!  CHESTER!\n\n     CHESTER, Johnny's father, rushes in to see what the commotion's\n     about.\n\n     ANGLE ON JOHNNY in the tin cauldron that serves as a bath tub.\n     JOHNNY'S bare chest and shoulders are covered with crude\n     imitations of TODD's tattoos.\n\n                                   JOHNNY\n                         (sullen)\n                   Those are my war marks.  From the\n                   battles I fought.\n\n     CHESTER and EVA exchange a look.\n\n                                                       CUT TO:\n\n     INT.  BEDROOM - NIGHT\n\n     MACE and SANDRA are lying awake in the bed in darkness.  For a\n     long moment they're both silent with the silence that comes in a\n     heavy moment in a conversation.  Then MACE speaks, his eyes on\n     the ceiling.\n\n                                   MACE\n                   There's going to be a meeting.\n                   People are upset about him.\n\n                                   SANDRA\n                   He's not fully recovered.\n\n                                   MACE\n                   That's what scares people.  He gets\n                   stronger every day.\n\n     They're both silent for a long moment.  MACE has something\n     weighing on his mind that he hesitates to say...but finally he\n     says it.\n\n                                   MACE\n                   I've caught him..sneaking looks at\n                   you.  At your body.\n\n                                   SANDRA\n                   I know.\n\n     A heavy silence, then...\n\n                                   SANDRA\n                   Are you afraid of him, Mace?\n\n     MACE stares at the ceiling and speaks with difficult honesty.\n\n                                   MACE\n                   Yes.\n                         (pauses, then)\n                   God knows where he's been...or what\n                   he's done.\n\n     Another pause before...\n\n                                   MACE\n                   I've never been afraid of anyone\n                   before...not this way.  I feel he\n                   could break me in half...with no\n                   real effort and no real...feeling.\n\n                                   SANDRA\n                   He told me he's afraid.\n\n                                   MACE\n                   Maybe he is.  It doesn't matter.\n\n     MACE is staring grimly at the ceiling as we...\n\n                                                       CUT TO:\n\n     INT.  WINDOWLESS CEMENT ROOM - DAY OR NIGHT (FLASHBACK)\n\n     Silent and surreal, the events of 1986 continue with the PASSIVE\n     FOUR-YEAR-OLD sitting on the floor while the AGGRESSIVE FOUR-YEAR-\n     OLD looks down at him, and other FOUR-YEAR-OLDS gather ominously.\n\n     It's only now, as he gets to his feet, suddenly trading vicious\n     blows with the AGGRESSIVE FOUR-YEAR-OLD that we realize that this\n     passive boy is FOUR-YEAR-OLD TODD.  The boys don't fight like \n     children; they don't quit or cry as the blood flows.\n\n     Highly-polished shoes, sharply creased trousers, and eyes\n     glittering from the shadows are all that is visible of the\n     faceless OBSERVERS who make no move to interrupt the violence.\n\n     FOUR-YEAR-OLD TODD, his nose pouring blood, exchanges savage\n     hurtful blows with his opponent, bloodying him viciously, as\n     we...\n\n                                                       CUT TO:\n\n     INT.  OTHER ROOM - DAY (PRESENT)\n\n     Eyes!  The adult TODD blinks away the memory, stares straight\n     ahead...\n\n     into NATHAN'S face, only six inches from his own.\n\n     They're all alone in the room.  It's very quiet.\n\n     NATHAN smiles a tentative smile, raises a hand, reaches out to\n     touch TODD'S face affectionately, curiously, testing their \n     friendship...\n     ANGLE ON TODD, his eyes.  Dangerous.  He draws his face back\n     enough to avoid being touched.\n\n     NATHAN looks unsure.  He's used to affection.  Then he\n     realizes... it must be a game!  He reaches out again...\n\n     Again TODD avoids the touch...and as he does so, something\n     catches his eye.\n\n     TODD sees a VIPER sliding across the floor toward NATHAN.\n\n     NATHAN doesn't see it; he's still trying to figure out this game.\n\n     TODD pulls off his boot and hands it to NATHAN.\n\n     NATHAN accepts it, thinks it's a gift.  He's pleased.  It's that\n     kind of game!  He gives TODD a friendly \"thanks for the boot\"\n     smile.\n\n     TODD points to the VIPER which is close to NATHAN now.\n\n     NATHAN looks at the VIPER.  He doesn't understand what he's\n     supposed to do.\n\n     TODD makes a hitting motion with his hand.\n\n     The VIPER is close to NATHAN, coiling.\n\n     NATHAN looks from the VIPER to TODD.\n\n     TODD indicates the VIPER with his eyes.  His look is intense, a \n     message in his eyes.\n\n     The VIPER is like a spring, it strikes...\n\n     TODD's hand is like a blur, almost invisible as he catches the\n     snake and flips it a couple of feet.\n\n     NATHAN stares.\n\n     The angry VIPER SPITS and HISSES and coils to strike again.\n\n     NATHAN looks at TODD.\n\n     TODD eyes the boot, then indicates the VIPER with his eyes.\n\n     NATHAN frowns; he's getting the idea.\n\n     The VIPER is about to strike again...\n\n     SQUASH!  A heavy boot comes down on the snake, crushing it.\n\n     TODD looks up to see MACE standing on the snake, reaching down\n     for NATHAN.  As MACE hugs the boy protectively to his chest, he\n     glares down at TODD with eyes blazing with fury.\n\n     TODD meets the look without blinking.  He never blinks.\n\n                                   SANDRA (O.S.)\n                   What happened?\n\n     TODD turns to see SANDRA standing in the bedroom door, her eyes\n     almost as hard as TODD's as we...\n\n                                                       CUT TO:\n\n     INT.  MEETING ROOM - NIGHT\n\n     TODD stares impassively as HAWKINS addresses him...\n\n                                   HAWKINS\n                   No one here has any animosity toward\n                   you, Sergeant.  None of us here is\n                   your enemy.\n\n     TODD is standing in front of the room full of grim-faced\n     PIONEERS, all looking at him.  It's like a court.\n\n     HAWKINS is flanked by MACE and SANDRA...\n\n                                   HAWKINS\n                   Moreover, we respect your qualities.\n                   We have no doubt that you are a\n                   very, very good soldier.\n\n     As she speaks, TODD's blank stare considers the weathered faces\n     of the PIONEERS facing him.  He sees CHESTER, EVA, RED with his\n     WIFE, JIMMY PIG and his WIFE, SLADE and MRS. SLADE, JUDITH, EMMA,\n     SALLY.  As HAWKINS continues, TODD's sharp eyes pick out details.\n     He sees JIMMY PIG opening and closing his hands nervously, he\n     sees SLADE fingering a barely noticeable rifle barrel.  CHESTER\n     has a weapon too.\n\n                                   HAWKINS (O.S.)\n                   But, because of your training, I\n                   don't think you'll ever be able to\n                   function in a group like this, a\n                   community of vulnerable people, of\n                   families, of children, where the\n                   ability to fight is not the sole\n                   purpose of existence.\n\n     The PIONEERS are nervous, ready for trouble, afraid TODD might\n     take this badly and fly off the handle.\n\n     As TODD's huge hand opens...and closes, their eyes are on it.  He \n     could pick up the table and hurl it at them, break men in half\n     with his bare hands.  His face is like stone, his eyes like\n     diamond chips as he glances toward SANDRA.\n\n     TODD sees SANDRA is moved, trying to suppress her emotions,\n     biting her lip, as HAWKINS goes on...\n\n                                   HAWKINS\n                   You're different from us, Sergeant.\n                   We don't hate you for that, but we\n                   have agreed that to try to include\n                   you would pose an intolerable risk\n                   to the community itself.\n\n                                   MACE\n                   We'll give you any tools you need,\n                   warm clothing, a good knife, boots.\n\n                                   SANDRA\n                         (emotionally)\n                   And if you're ever sick...or you get\n                   hurt...\n\n                                   MACE\n                   You're a friend, Sergeant.  It's\n                   just...\n\n     MACE doesn't finish.  TODD's eyes glance again at the PIONEERS.\n     They too seem moved, not so ready to shoot.\n\n     TODD blinks.  Once.  And we...\n\n                                                       CUT TO:\n\n     EXT.  INSIDE THE TRENCH - MORNING (WIND)\n\n     TODD is wrapped in a heavy parka, his mouth wrapped with the\n     scarf JIMMY PIG knit, his eyes covered with eye protectors as\n     MACE hands him another sack in addition to the one already over\n     his shoulder.\n\n                                   MACE\n                   If you need us...you can ask us for\n                   help.\n\n     TODD glances at the knot of PIONEERS gathered in the trench, all\n     eyes on him.  SANDRA is among then with NATHAN in her arms.  For\n     just a second TODD's eyes go to the cheerful face of NATHAN; then\n     he turns to MACE.\n\n     MACE is startled to see TODD pull the scarf from his mouth to\n     speak.  He's never spoken before unless spoken to.\n\n                                   TODD\n                   It's not true.\n                         (then, with great effort)\n                   I'm not a good soldier.\n\n     Then TODD replaces the scarf over his mouth and starts to climb\n     out of the trench into the wind as we...\n\n                                                       CUT TO:\n\n     EXT.  LANDSCAPE (AND \"STEEL HENGE\") - DAY - LATER\n\n     Four suns glare down from the sky onto the vast, windswept\n     wasteland.\n\n     TODD is a tiny dot in the vastness, traveling like a bug along\n     one of the long cables that stretches for miles and miles.  He's\n     out by the skeleton of the old ship as we...\n\n                                                       CUT TO:\n\n     EXT.  ANOTHER PLANET - DAY\n\n     A low slung armored vehicle on caterpillar treads RUMBLES over a\n     steep rocky terrain faintly backlit by a cold sun that looms \n     enormously on the horizon while giving off only a faint glow.\n\n     Hanging on to the outside of the insect-like scouting vehicle\n     (called a \"CRAWLER\") are two nasty-looking NEW SOLDIERS in space\n     suits designed for battle, their heavy rocket rifles cradled and\n     ready, their visors blank and ominous.\n\n     INT.  CRAWLER\n\n     The husky sergeant, CAINE 607, steers the vehicle and speaks into\n     a radio mike at the same time.\n\n                                   CAINE 607\n                   Crawler, Crawler to Daddy.  No\n                   hostiles!\n\n     The GUNNER beside him and the NEW SOLDIERS in the back seat stare\n     stoically out the windows as CAINE 607 replaces the mike.\n\n     INT.  COCKPIT/\"DADDY\"\n\n     RUBRICK is sitting at a console cluttered with coffee cups and\n     half-finished cheeseburgers, responding to the radio.\n\n                                   RUBRICK\n                   All right, Crawler, Crawler, we got\n                   you.  This is Daddy.  Continue per,\n                   over.\n\n     RUBRICK turns to CHURCH who's standing in the cramped cockpit,\n     staring out a window at the gloomy planet outside, watching the \n     CRAWLER creep over the terrain.\n\n                                   RUBRICK\n                   We're clear.  We can send a crew\n                   out.\n\n                                   CHURCH\n                         (bored)\n                   Sloan's already on it.\n\n                                                       CUT TO:\n\n     INT.  CREW QUARTERS/\"DADDY\" - DAY\n\n     An oval hatch door swings open and SLOAN enters.\n\n     VETERANS in coveralls, slumped or sprawled on steel-tiered bunks,\n     scramble obediently to their feet, eyes on SLOAM.\n\n                                   SLOAN\n                   Suit up, fellas.  Time to go build\n                   another play house.\n\n     As VETERANS start to pull space suits from under the bunks, SLOAN\n     turns her back on them...but hesitates before exiting as though\n     expecting something.  Sure enough, veteran RILEY speaks up.\n\n                                   RILEY\n                   Sir.\n\n                                   SLOAN\n                   Yes, Riley, what is it?\n\n     SLOAN says it even before she's turned.  She knew who it would\n     be.\n                                   RILEY\n                   We haven't been issued weapons, sir.\n\n                                   SLOAN\n                         (as to a child)\n                   You won't need weapons, Riley.\n                   You're not soldiers anymore.\n\n                                   RILEY\n                         (saluting)\n                   Yes, sir.\n\n                                   SLOAN\n                   You don't even have to salute\n                   anymore.  A simple \"Yes, sir\" will\n                   do.\n\n     RILEY swallows hard and with effort keeps his hand from saluting\n     as he speaks.\n\n                                   RILEY\n                   Y-yes...sir.\n\n     SLOAN turns her back and exits.\n\n     As the door closes, RILEY, unable to restrain himself any longer, \n     salutes hastily as we...\n\n                                                       CUT TO:\n\n     INT./EXT.  COCKPIT - DAY - LATER\n\n     Through the cockpit window in the bluish glare of a work-light,\n     VETERANS, dressed in space suits, can be seem erecting a prefab\n     hut on the harsh moonscape.\n\n     SLOAN is watching them through the window while behind her\n     RUBRICK lounges with his feet on the console and reads a current\n     magazine on a VDT.  CHURCH is partially visible in the\n     background, poring over charts in the navigator's cubicle.  It's\n     very quiet until SLOAN speaks, almost to herself.\n\n                                   SLOAN\n                   Every time it's time to send them\n                   out, Riley asks about weapons.  And\n                   every time I tell him they don't\n                   need weapons anymore, they're not\n                   soldiers anymore.\n\n                                   RUBRICK\n                         (eyes on VDT)\n                   Jesus!  It says here Macy's is going\n                   out of business.  Can you imagine\n                   that?  New York without Macy's?\n\n     Silence.  SLOAN watches the VETERANS outside through the window.\n     They're working like a team of ants in space suits, erecting the\n     hut.\n\n     CHURCH gets up noisily from the navigation cubicle and joins\n     them, shaking his head.\n\n                                   CHURCH\n                   Next one's going to be a real pain\n                   in the ass.\n\n                                   RUBRICK\n                         (reading, not interested)\n                   Yeah?  What flavor pain in the ass?\n                   Gravity pain in the ass?  Atmosphere\n                   pain in the ass?\n\n                                   CHURCH\n                   How about a \"gaseous currents\" and\n                   \"urgent convections\" pain in the ass.\n\n                                   SLOAN\n                   I think you're trying to say a \"wind\n                   pain in the ass.\"\n\n                                   RUBRICK\n                   Wind!\n\n                                                       CUT TO:\n\n     INT.  PIPE - DAY\n\n     WIND!  As the wind RAGES outside, TODD, wearing his parka,\n     crouches over a tiny fire inside a huge open-ended pipe twelve\n     feet in diameter.  He stares at the bleak, windy landscape\n     outside his shelter.  He looks primitive, like a caveman, and\n     very very alone as we...\n\n                                                       CUT TO:\n\n     EXT.  PIPE - DUSK\n\n     The fat section of pipe is twenty feet long squatting in the\n     blowing litter on the grim landscape in the shadow of the junk \n     mountains.  Somehow that inanimate pipe also looks lonely in the \n     vastness as the four suns overhead darken toward evening.\n\n                                                       CUT TO:\n\n     EXT.  STARS - NIGHT\n\n     Stars glitter behind the dimmed suns as the wind HOWLS and we...\n\n                                                       CUT TO:\n\n     INT.  PIPE - DAY\n\n     The fire is nothing but coals.  TODD sits stoically over the\n     embers, more alone than ever, chewing on a piece of dried food,\n     part of his spartan meal.\n\n     As he chews, he stares blankly at nothing until...\n\n     A single tear crawls down one cheek.\n\n     Then another.\n\n     TODD looks like a stone statue oozing tears.  He reaches up and \n     touches the strange water with his finger, then studies the\n     finger, as though a tear were the most remarkable thing he's ever \n     seen.  He cannot remember anything like this; he cannot remember\n     ever having cried.\n\n     And suddenly, without warning, he's convulsed with tears, heaving\n     with sobs, alone in the big pipe with the pitiful little fire,\n     bawling like a baby as we...\n\n                                                       CUT TO:\n\n     INT.  BEDROOM - DAY\n\n     A VIPER writhes across the floor through the patterns of light \n     streaming through the window, a sinister presence, full of menace\n     and evil designs.\n\n     The VIPER winds its way toward an object that will prove in a\n     moment to be a corner of the bad.\n\n     SMACK!  The VIPER doesn't make it!  SMACK!  Another blow from\n     MACE's heavy boot being swung by hand.\n\n     The VIPER coils and HISSES angrily, wounded and dangerous.\n\n     SMACK!  The boot again!\n\n     NATHAN wields it awkwardly, hitting bravely at the HISSING VIPER!\n\n     SMACK!  NATHAN hits again and...\n\n     MACE rolls over in the bed.\n\n     SMACK!  MACE comes awake, looks around.\n\n     MACE lunges from the bed.\n\n     SMACK!  Just as NATHAN gives the damaged VIPER another blow, MACE \n     snatches the boy in his arms and yanks him away.\n\n     SANDRA sits up in bad, looking around, alarmed.\n\n     MACE is holding NATHAN, staring down at the VIPER.\n\n     The VIPER has up the ghost, lying on the floor.\n\n     MACE hugs NATHAN to him and looks toward SANDRA.  They both look\n     at the boot.  And at the dead VIPER.\n\n     Their eyes meet and, for a long moment, they just look at each\n     other.\n\n                                                       CUT TO:\n\n     INT.  OTHER ROOM - DAY - A LITTLE LATER\n\n     MACE is wearing his parka, pulling on his eye protectors\n     hurriedly as he opens the door to the corridor.  SANDRA's voice\n     makes him stop and turn to her.\n\n                                   SANDRA\n                   Mace!  What about the vote?\n                   Everybody voted.\n\n     Mace glares at her for a moment, knowing she's right.  Then he\n     turns away and starts out defiantly.\n\n                                   MACE\n                   We voted wrong!\n\n     SANDRA looks relieved and worried at the same time and we...\n\n                                                       CUT TO:\n\n     EXT.  LANDSCAPE - DAY\n\n     This time MACE is the tiny figure struggling along the wire in\n     the wind, alone on the vast landscape under four suns.\n\n                                                       CUT TO:\n\n     EXT.  OUTER SPACE/\"DADDY\" - \"DAY\"\n\n     The military ship called \"DADDY\" (Defend And Attack Deployment\n     Entity) is a big ugly insect gliding through a black silent void.\n     On the grimy bulwark of the ship are the letters NAF followed by \n     serial numbers and the logo of the North American Forces.\n\n                                                       CUT TO:\n\n     INT.  COCKPIT - DAY\n\n     CLOSE ON space charts.  CHURCH's finger is indicating a tiny dot\n     on the chart surrounded by a vast sea of space.\n\n                                   CHURCH\n                   It's a dump.  Literally.\n\n     SLOAN and RUBRICK are looking over CHURCH's shoulder while a NEW \n     SOLDIER sits stonefaced at the control console flying the ship.\n\n                                   SLOAN\n                   No shit!  We're gonna set up a\n                   monitor on a garbage dump!  So we\n                   can monitor garbage rusting?\n\n                                   RUBRICK\n                   Will the wind affect the patrol?\n\n                                   CHURCH\n                   The Crawlers are low enough and\n                   heavy enough, they won't blow.  The\n                   men should wear armored vests and\n                   carry double weapons and ammo for\n                   the weight.  They may have to use\n                   lines too, like mountain climbers.\n\n     RUBRICK shakes his head, snorts disgustedly.\n\n                                                       CUT TO:\n\n     EXT.  OUTER SPACE/\"DADDY\" - \"DAY\"\n\n     As the grimy skin of the ugly military ship looms across our\n     vision, a tiny orb is visible off the bow in the distance, a\n     remote world, destination of \"DADDY\" as we...\n\n                                                       CUT TO:\n\n     EXT.  CABLE/LANDSCAPE - DAY\n\n     Alone, MACE is pulling himself along the cable as the wind\n     buffets him.\n\n     Ahead the cable stretches past the skeleton of the ship and the \n     \"catcher trenches\" toward the mountains of junk towering over the\n     flat landscape several miles off.\n\n     A heavy barrel blows by, then an old refrigerator tumbles past.\n\n     MACE squints into the wind.\n\n     Off to the right about a quarter mile away he can see a big piece\n     of pipe...and a trail of smoke blowing out of the pipe and \n     disappearing in the wind.\n\n     MACE struggles the cable past flooded \"catcher trenches\" as\n     we...\n\n                                                       CUT TO:\n\n     EXT.  PIPE/LANDSCAPE - DAY - MINUTES LATER\n\n     The pipe lies fifty yards off the cable to the right.  As MACE\n     pulls even with it, he can see right inside.\n\n     TODD is standing just inside the mouth of the pipe, looking\n     straight out at MACE...but the light is behind him and MACE can't\n     see TODD's face as he SHOUTS at him.\n\n                                   MACE\n                   TODD!  TODD!\n                         (pauses, then)\n                   TODD!  WE WANT YOU TO COME BACK!  WE\n                   MADE A MISTAKE!\n\n     MACE starts toward him, letting go of the wire, struggling in the \n     wind.\n\n     TODD watches him come.\n\n     MACE stumbles on, dances a few feet, recovers, struggles toward\n     TODD, SHOUTING....\n\n                                   MACE\n                   TODD!  WE'RE SORRY!  WE WERE WRONG!\n\n     Just then, a sharp gust staggers MACE, driving him several yards \n     toward a \"catcher trench.\"\n\n     He's teetering on the lip of the flooded trench, about to fall\n     in, when TODD'S strong arms grab him.\n\n     They look like a strange four-footed beast as TODD drags him\n     through the wind in an awkward \"embrace\" toward the cable.\n\n     Once MACE has the cable in his hands, he laughs and gasps...\n\n                                   MACE\n                   Damn!  Thank you, Todd.  God damn!\n                   I almost took a... a...swim there!\n\n     MACE breaks off.  Todd isn't listening; he's looking off toward\n     the horizon.\n\n     MACE follows his look.\n\n     Five miles away he can see an ugly insect-shaped spacecraft\n     descending from about ten thousand feet.\n\n                                   MACE\n                   My...God!  Someone's landing.\n\n     TODD doesn't answer.  He's staring at the descending ship with\n     soldier eyes and a stone face as we...\n\n                                                       CUT TO:\n\n     INT.  CORRIDORS/SETTLEMENT - DAY\n\n     Excitement, confusion.  PIONEERS and CHILDREN are clogging the\n     narrow, earthen corridors, shouting excitedly, hurrying outside.\n\n     SANDRA opens her door into the corridor, concerned...\n\n                                   SANDRA\n                   What's going on?\n\n                                   JUDITH\n                   Someone's landing!  Jimmy Pig\n                   spotted a ship!\n\n     SANDRA stands there stunned as excited PIONEERS mill past her,\n     jamming the corridor, and we...\n\n                                                       CUT TO:\n\n     EXT.  CABLE - DAY\n\n     TODD is on the cable with MACE, his eyes on the squat beetle-like \n     object crawling slowly toward then through the junk half a mile\n     away.\n\n                                   MACE\n                   Look at that.  It's some kind of\n                   vehicle.  A landing party.  HEY!\n\n     MACE raises his arm to wave.\n\n     Without taking his eyes off the approaching CRAWLER, TODD grabs\n     MACE's arm and pulls it down.\n\n     MACE looks at TODD, sees the grim expression on TODD's stone\n     face, and suddenly MACE is worried too.\n\n     INT.  CRAWLER\n\n     Peering through binoculars, a soldier in the front passenger\n     seat, the GUNNER, nudges the DRIVER and indicates something to\n     the right.\n\n     Two tiny FIGURES in the distance on a long cable.\n\n     The driver is the beady-eyed giant, CAINE 607.  Reacting to what\n     he see, he adjusts the vehicle to the right.\n\n     EXT.  CRAWLER/LANDSCAPE\n\n     Two ominous NEW SOLDIERS wearing plexi-goggles and bulky armor\n     under their uniforms hang on the outside of the CRAWLER in the\n     wind, their waists dangling with weapons and equipment, big\n     rocket rifles across their chests.  They're looking ahead toward\n     the long cable, as their nasty-looking vehicle grinds slowly\n     forward through the litter, an evil vision.\n\n     EXT.  LANDSCAPE\n\n     TODD and MACE are running, TODD in the lead, buffeted by wind, \n     struggling through a clutter of old machinery, diesel engines, \n     turbines, scattered haphazardly on the flat desert floor.\n\n     MACE is running too, not as well, and TODD has to reach back and\n     grab him, pull him along...\n\n                                   MACE\n                         (gasp)\n                   ...maybe...they're...\n                         (gasp)\n                   ...friendly...\n\n     INT.  CRAWLER\n\n     The GUNNER works a servomotor, aiming a cannon, as he peers\n     through a scope.\n\n     Through the scope, surrounded by digital readouts, we see two\n     tiny running FIGURES...\n\n     EXT.  CRAWLER\n\n     BALAAM!  BALAAM!  The CRAWLER cannon FIRES...\n\n     EXT.  LANDSCAPE\n\n     MACE screams, he's hurled wildly mid-stride, tossed ten yards.\n\n     TODD looks back, sees him lying on the sand, screaming in pain.\n\n     TODD turns back, sprinting, low, weaving, tossed by the wind.\n\n     WHOOOM!  Another SHOT.  If the wind hadn't hit him, TODD would\n     have been hit.\n\n     MACE is screaming.  His right leg is gone.\n\n     TODD gets him, drags him, stumbles.\n\n     WHOOM!  Another SHOT, another miss.\n\n     TODD struggles for cover, staggering in the wind with MACE on his \n     back.\n\n     INT.  CRAWLER\n\n     Through his scope, the GUNNER sees TODD and MACE dive behind a\n     big turbine.\n\n     Unhurriedly the GUNNER flicks a switch on the dash.\n\n     CAINE 607 nods approval.\n\n     The GUNNER works the servo, bringing the cannon to bear on the\n     turbine.\n\n     EXT.  TURBINES\n\n     TODD is dragging MACE along behind the cover of the turbine,\n     glancing back for what he knows will occur.\n\n     BAWHOOM!  The area where they disappeared EXPLODES, chunks of \n     steel fly.\n\n     TODD keeps pulling MACE, who looks half dead as...\n\n     BAWHOOM!  The TURBINE is hit again!\n\n     INT.  CRAWLER\n\n     Through the scope, the GUNNER aims again and watches another\n     chunk of turbine disintegrate.\n\n     The GUNNER glances at the robot-faced driver.  Their eyes meet.\n     CAINE 607 nods.  Obviously, they've killed the two men.\n\n     The GUNNER points to the cable.\n\n     CAINE 607 follows the look, nods, and alters the course of the\n     vehicle in toward the cable as he reaches for the radio mike.\n\n     EXT.  ABANDONED ENGINES/TERRAIN\n\n     TODD is crouched over MACE inside an abandoned diesel engine not\n     far from the disintegrated turbine.  He's making a tourniquet to\n     stop the bleeding from the stump of MACE's leg.  MACE looks\n     awful, pale, in shock.  He speaks weakly.\n                                   MACE\n                   Oh, shit, Todd...I'm...dead...\n                   aren't I?  I'm not going to make it.\n\n     TODD meets his look but doesn't answer.  He finishes the\n     tourniquet and turns his back on MACE to peer out through a gap\n     in the engine at the CRAWLER.\n\n     TODD sees the CRAWLER approach the cable, watches it veer left\n     and start to travel along the cable...straight toward the colony!\n\n     TODD turns and looks into MACE's face.  MACE's eyes are clouded\n     with horror.\n\n                                   MACE\n                   Why?  Why?\n\n     No answer.\n\n                                   MACE\n                   I'm not..a soldier.\n                         (then...)\n                   A...mistake?  Was it...a mistake?\n\n     TODD shakes his head no.  MACE's eyes fill with new horror.\n\n                                   MACE\n                   Oh, my God.  They won't...they\n                   won't...?  Not Sandra!  Not...\n                   not...Nathan!\n\n     TODD turns away from MACE and peers through the machinery.\n\n     He can see the CRAWLER is a hundred yards away now, traveling\n     along the cable toward the colony.\n\n     He can see the faces of the NEW SOLDIERS hanging on the outside\n     of the CRAWLER, hard faces, goggled and ominous.\n\n     When TODD turns back to MACE, he finds MACE eyeing him with pure \n     hatred.  MACE sneers weakly.\n\n                                   MACE\n                   Soldiers!  Soldiers...\n                         (gasp)\n                   ...deserve...soldiers!\n\n     His eyes roll back.  He's dead.\n\n     TODD peers out again at the NEW SOLDIERS.  They look invincible\n     as we..\n\n                                                       CUT TO:\n\n     EXT.  \"DADDY\"/LANDSCAPE - DAY\n\n     The spaceship is squatting on the barren ground a mile from the \n     junk towers like an ugly insect.\n\n     INT.  MESS/\"DADDY\"\n\n     RUBRICK sticks his head in the door of the cramped officers mess.\n\n                                   RUBRICK\n                   People.  They've spotted people!\n\n     Both CHURCH and SLOAN look up in astonishment from the card game\n     they're playing on a tiny fold-out table.\n\n                                   CHURCH\n                   \"People\"!  \"People\"?  What do you\n                   mean \"people\"?\n\n                                   RUBRICK\n                   Two civilians.  Unarmed.  They've\n                   killed both of them.  They've\n                   spotted smoke from some kind of camp\n                   and they're going to check it out.\n\n                                   SLOAN\n                   A camp!  Jesus Christ!\n\n                                   CHURCH\n                   Damn!\n                         (worried)\n                   Did they ask for assistance?\n\n                                   RUBRICK\n                   Not yet.\n\n     CHURCH frowns, considers, then frets...\n\n                                   CHURCH\n                   Like my daddy used to say,\n                   \"Nothing's ever as simple as it's\n                   supposed to be...except shit.\"\n\n                                   SLOAN\n                         (rolling her eyes)\n                   Thank you, \"Daddy.\"\n\n                                   RUBRICK\n                   Who do you think they are?\n\n                                   SLOAN\n                   The civilians?\n                         (a shrug)\n                   Squatters...refugees. I don't think\n                   we want to know, do we?\n\n                                   CHURCH\n                   Good point.\n\n                                                       CUT TO:\n\n     EXT. GARDEN TRENCH - DAY - A LITTLE LATER\n\n     HAWKINS, JIMMY PIG, RED, and other PIONEERS are peering over the\n     lip of the trench just beneath the trellis.\n\n     A half mile off they can see the CRAWLER creeping in their\n     general direction.\n\n     The garden is full of excited PIONEERS with their CHILDREN,\n     everybody trying not to trample the plants, but trampling them\n     anyway, as HAWKINS addresses them...\n\n                                   HAWKINS\n                   I'm going to go out and talk to\n                   them.  More than likely they're\n                   friendly.  If not...\n                         (indicating Jimmy Pig,\n                          others)\n                   ...those of you with weapons will be\n                   ready to defend us.  The rest of you\n                   go back.\n\n     HAWKINS turns abruptly and looks over the rim.\n\n     The CRAWLER is closer now, only a quarter mile away, angling to\n     the left along the wire.\n\n     HAWKINS starts to climb out of the trench, boosted by JIMMY PIG\n     and CHESTER.  She's waving her arms, shouting.\n\n                                   HAWKINS\n                   HERE!  OVER HERE!\n\n     SANDRA looks worried.\n\n     INT.  CRAWLER\n\n     CAINE 607 and the GUNNER both see the tiny figure waving at them\n     a quarter mile away, trying to get their attention.\n\n     As CAINE 607 adjusts their course to the left, the GUNNER's\n     servomotor WHINES as he aims, peering through the scope at the \n     helpless figure of HAWKINS.\n\n     EXT.  SETTLEMENT/LANDSCAPE\n\n     ANGLE ON HAWKINS suddenly reacting to the sight of the vicious-\n     looking CRAWLER coming straight toward her, now only five hundred \n     yards away.  They don't look too friendly!  Frightened, she's\n     lowering her arms and turning when...\n\n     BLAAAAM!  The cannon flashes, HAWKINS flies backwards!\n\n     EXT.  INSIDE GARDEN TRENCH\n\n     HAWKINS' body flies back onto the PIONEERS in the trench.  Panic \n     erupts as...\n\n     CHESTER raises his light rifle and starts FIRING over the lip of\n     the trench.\n\n     BAWHOOM!  The whole edge of the trench explodes, dirt flies, and\n     CHESTER is hurled backwards, dead.\n\n     PIONEERS are screaming and running wildly down the trenches...\n\n     JIMMY PIG bravely aims his rifle over the lip of the trench.\n\n     He sees the CRAWLER is lumbering right at him.\n\n     PING!  PING!  His shots are pitiful.  The CRAWLER keeps coming.\n\n     ANGLE ON JIMMY PIG.  No choice but to retreat.  He turns and\n     hurries down the trench after the others as we...\n\n                                                       CUT TO:\n\n     INT.  OFFICERS MESS/\"DADDY\"\n\n     CHURCH and SLOAN look up from their card game again as RUBRICK\n     sticks his head in the door to report the latest.\n\n                                   RUBRICK\n                   Report from Crawler One.  Everything\n                   under control.  No need for\n                   assistance.\n\n                                   CHURCH\n                   There's resistance?\n\n                                   RUBRICK\n                   Ineffectual.  About fifty\n                   disorganized people with almost no\n                   fire power.  Three men are going in\n                   to clean them out; one man's staying\n                   with the Crawler.\n\n                                   CHURCH\n                   Humph.  Sounds reckless, three\n                   against fifty.  The old ones, the\n                   veterans, they would have called for\n                   support...just in case.\n\n     Again RUBRICK and SLOAN exchange a glance and an eye-roll at the \n     fretting old fuddy-duddy.  Then SLOAN changes the subject\n     brightly.\n\n                                   SLOAN\n                   Speaking of Riley and his old\n                   soldiers...why don't we let them\n                   start putting up the unit?  It's\n                   gonna take forever in this wind.\n\n                                                       CUT TO:\n\n     INT.  CREW QUARTERS/\"DADDY\" - MOMENTS LATER\n\n     RILEY is standing rigidly in front of his bunk in crew quarters,\n     flanked by the rest of the VETERANS in similar positions, facing\n     SLOAN.\n\n                                   RILEY\n                   Will we be issued weapons, sir?\n\n                                   SLOAN\n                         (a sneering smile)\n                   No, Riley...no weapons.  You're not\n                   a soldier, Riley.\n\n                                                       CUT TO:\n\n     EXT.  INSIDE THE TRENCHES - DAY\n\n     The NEW SOLDIER comes straight, like some inexorable death\n     machine, lumbering awkwardly with his burden of weapons, goggled\n     and blank faced.\n\n     A PIONEER is backing away ten yards in front of him, firing\n     wildly.  POW!  POW!  POW!\n\n     The NEW SOLDIER looks at one of his armor-gloved hands, opening\n     the palm in front of his face.  His hand's been hit.  He shakes\n     it, annoyed, like it was a bee sting, then he aims at the\n     PIONEER.\n\n     WHOOOOSH!  A tongue of fire from the NEW SOLDIER's flame thrower \n     engulfs the helpless PIONEER as we...\n\n                                                       CUT TO:\n\n     INT.  MEETING ROOM - DAY\n\n     PIONEERS are crouching in the room when the door bursts open, and\n     a tongue of flame turns the room into a firestorm and we...\n\n                                                       CUT TO:\n\n     INT.  CORRIDOR - DAY\n\n     SANDRA has NATHAN screaming in her arms as she calmly herds\n     frightened CHILDREN through a corridor, JOHNNY, WILL, and ELLEN\n     among them.\n\n                                   SANDRA\n                   Keep going, children, don't panic,\n                   don't panic.\n\n     But if her demeanor doesn't reveal her fear, her eyes do.\n\n                                                       CUT TO:\n\n     EXT.  INSIDE ANOTHER TRENCH - DAY\n\n     Two Pioneers, SALLY and RED, lunge from a doorway into the trench\n     and fire a rifle and a pistol at a THIRD SOLDIER who's advancing \n     along the trench.\n\n     BANG!  BANG!  PING!  SPLAT!\n\n     SALLY and RED dive back in the doorway for cover where a pioneer\n     named SINGH is crouched, watching with alarm the THIRD SOLDIER \n     advancing unfazed.\n\n     ANGLE ON THE THIRD SOLDIER coming toward them.\n\n     ANGLE ON THE PIONEERS huddled in the doorway.\n\n                                   RED\n                   They got armored vests.  You got to\n                   aim for exposed parts like the\n                   face...\n\n                                   SINGH\n                   Here goes.\n\n     RED and SALLY watch SINGH step out directly in front of the\n     advancing THIRD SOLDIER and FIRE five shots rapidly...PING!\n     PIZG!  PING!  PING!  PING!\n\n     WHOOOOSH!  RED and SALLY see SINGH incinerated before their eyes.\n\n     Exchanging a horrified glance, they turn to retreat down the\n     interior corridor, but before they get two steps, they freeze...\n\n     A SOLDIER is in the corridor, not looking at them, but breaking\n     down a door.  They can't go that way!\n\n     Trapped, they turn to see the THIRD SOLDIER almost to the\n     doorway, his flame thrower aimed, his finger on the trigger,\n     and...\n\n     A blur!  Something lands on the THIRD SOLDIER from above the\n     trench, and the THIRD SOLDIER falls over backwards, slamming hard\n     to the floor of the trench.\n\n     But he's a super soldier, so that almost at the same time he hits\n     the ground he's already lunging upward to regain his feet and\n     fight except...\n\n     A knife blade rips across his throat, opening it wide in one\n     swift movement, and...\n\n     The THIRD SOLDIER's head sags back because not even superman can\n     fight with no neck and the last thing he sees through his plexi \n     goggles is...\n\n     TODD looming over him with a bloody knife, a face like stone, and\n     fierce soldier's eyes.\n\n     ANGLE ON THE DOORWAY, where RED, SALLY, and another PIONEER peer \n     around the corner, eyes wide with amazement at the sight of TODD \n     kneeling over his victim.\n\n     ANGLE ON TODD, slipping the utility belt off the dead THIRD\n     SOLDIER, yanking grenades and ammo from the bulky body, stuffing\n     a heavy pistol in his own waistband.\n\n     RED approaches timidly.\n\n                                   RED\n                   You want help, partner?\n\n     TODD glances up at him, and RED sees TODD'S eyes and RED backs\n     away quickly because...\n\n     TODD looks badder even than the new soldiers!\n\n     Turning back to the dead man, TODD goes for the last item...the\n     goggles.  Ripping them off he reveals...\n\n     A one-eyed soldier.  The dead man staring up at him is MELTON.\n\n     For just a moment TODD stares into the dead face, revealing\n     nothing of how he feels, as we...\n\n                                                       CUT TO:\n\n     INT.  OTHER ROOM - DAY\n\n     NATHAN is SCREAMING in terror on the floor, ignored as SANDRA and\n     CHILDREN haul the bed from the bedroom to add to the heap of\n     obstacles they've placed in front of the door already.  The\n     stove, everything is wedged against the door to the corridor.\n\n     As they heave the bed against the mountain of furniture and other \n     belongings, the door quivers, the heap of furniture shifts.\n\n     INT.  CORRIDOR\n\n     The FIRST SOLDIER, as big as an offensive tackle, shoulders the\n     door again, and it gives...\n\n     INT.  ROOM\n\n     CHILDREN SCREAM as the mountain of furniture heaves backwards,\n     and the door opens part way, revealing the FIRST SOLDIER.\n\n     SANDRA grabs NATHAN and hands him to one of the children.\n\n                                   SANDRA\n                   Into the bedroom, all of you.\n\n     SANDRA picks up a stool to defend herself.\n\n     INT.  BEDROOM\n\n     Dashing into the bedroom, the children are greeted with a\n     terrifying sight!  SMASH!  Soldier boots are kicking out the\n     little window high in the wall, SMASH, SMASH, SMASH, and the\n     window collapses, a boot sticks through the opening...\n\n     INT.  OTHER ROOM\n\n     Unhurriedly, the giant FIRST SOLDIER bulls through the furniture,\n     tossing the bed and table aside like sticks.\n\n     SANDRA smashes at him with the stool, hitting him twice, hurling\n     it in his face.\n\n     The FIRST SOLDIER shakes off the blow as if he'd been hit by a \n     feather.  But she's got his attention.  He turns his goggles at\n     her, starts to raise his weapon as...\n\n     SANDRA turns and disappears into the bedroom...\n\n     INT.  BEDROOM\n\n     As SANDRA dashes into the bedroom in blind retreat she runs smack\n     into the chest of another soldier!\n\n     Helpless and horrified, she looks right into a cruel stone face\n     and goggled eyes, and she gasps...\n\n                                   SANDRA\n                   Sergeant Todd!\n\n     TODD never takes his eyes off the door as he brushes her roughly\n     aside with one hand, while his other arm aims the heavy rocket\n     gun right at the door and...\n\n     The FIRST SOLDIER comes into the doorway with his flame thrower\n     raised to torch women and children and what he sees is TODD\n     looking right at him, aiming the rocket gun, and BAWHOOM, the\n     FIRST SOLDIER is blown clear back across the other room with a \n     shot right in the chest.\n\n     ANGLE ON SANDRA, still on the floor where he knocked her,\n     watching TODD exit the room, weapon raised, his utility belt\n     dangling bandolier style across his chest.\n\n     He looks like...one of them!  A soldier!\n\n     INT.  OTHER ROOM\n\n     Crossing the next room, TODD moves quickly to the door, flattens,\n     and peers into the corridor.\n\n     He sees the SECOND SOLDIER heading toward him.\n\n     BLAM!  BLAM!  TODD fires twice around the door and sees...\n\n     The SECOND SOLDIER staggering back, hit, a pistol from his\n     hip...\n\n     Dirt explodes around the door frame as TODD ducks back.  Quick as\n     a wink, he yanks a grenade from his utility belt, triggers it,\n     and flips it around the corner as CRACK!  a shot rips at his arm.\n\n     BAWHOOM, the grenade goes off and, bleeding from his arm, TODD\n     swings into the corridor and follows the grenade with three quick \n     rocket shots.\n\n     INT.  CORRIDOR\n\n     Keeping low, TODD charges, his weapon pointed at the fallen\n     SECOND SOLDIER.\n\n     The SECOND SOLDIER is sprawled bloodily in the corridor, the\n     walkie-talkie on his chest squawking urgently.\n                                   WALKIE-TALKIE (V.O.)\n                   Crawler One calling Double Mike.\n                   Give me an \"okay,\" Double Mike.\n\n     TODD seizes the walkie-talkie, presses the transmit button, and\n     snarls a throaty animal growl into the mike...\n\n     INT.  CRAWLER/LANDSCAPE\n\n     CAINE 607 is sitting at the wheel of the motionless vehicle\n     parked near the trench garden, radio mike in hand, when he hears\n     the low ANIMAL SNARL come across his speaker.\n\n     CAINE 607's robot face reveals nothing as he listens to ANOTHER\n     GROWL.  WIND HOWLS outside.\n\n     Then he flicks a switch on the dash and puts the mike to his\n     mouth, his face expressionless.\n\n                                   CAINE 607\n                   Crawler to Daddy, Crawler to Daddy.\n                   Come in, Daddy!\n\n                                                       CUT TO:\n\n     PORTHOLE VIEW/EXT./INT.  OFFICERS' MESS/\"DADDY\"\n\n     Seen through the thick plexi-porthole, heavily-clothed VETERANS\n     are struggling with a wall, trying to erect the pre-fab unit\n     while the wind, inaudible inside the ship, rages around them, \n     staggering them this way and that.  What we hear in the quiet\n     interior of the mess is CHURCH voicing his disbelief.\n\n                                   CHURCH (O.S.)\n                   A \"growl\"!  He heard a growl?\n\n     RUBRICK, looking uneasy, is facing CHURCH who's looking up at him\n     from a game of solitaire at the little table.  SLOAN is biting\n     her fingernails in the b.g.\n\n                                   RUBRICK\n                   Well, he didn't say the word\n                   \"growl.\"  He said a \"throat-noise,\"\n                   but I asked him to imitate it and it\n                   sounded like a growl to me.\n\n                                   CHURCH\n                   My God!  Who are we fighting here!\n\n                                   RUBRICK\n                         (nervous)\n                   I think...I think we have to assume\n                   the missing men are...down.\n\n                                   CHURCH\n                         (getting up, pacing)\n                   I knew Mekum's hotshots were green.\n                   No reinforcements, then they walk\n                   right into an enemy stronghold.\n\n                                   RUBRICK\n                   We could send reinforcements now...\n\n                                   CHURCH\n                         (sharply)\n                   Absolutely not.  Those bastards are\n                   just waiting in there for us.  No\n                   more of this fancy super-soldier\n                   shit.  We do it with the hammer...\n\n     RUBRICK and SLOAN exchange a nervous glance as CHURCH paces\n     agitatedly.\n\n                                   RUBRICK\n                   Uh, what does that mean, \"the\n                   hammer\"?\n\n                                   CHURCH\n                         (suddenly smug)\n                   My daddy always said, \"When you want\n                   to insert a nail in a piece of wood,\n                   you don't do nothing fancy or\n                   glamorous, you don't finesse or play\n                   the hero, you just pick up your damn\n                   hammer and hit that sumbitch till\n                   it's in.\"\n\n                                   SLOAN\n                         (under her breath) \n                   Christ!  Now Daddy's a carpenter!\n\n                                   RUBRICK\n                         (to Church)\n                   I...don't...quite...follow...sir.\n\n                                   CHURCH\n                         (decisive, sharp)\n                   Take the whole unit, both Crawlers,\n                   and tell 'em to pound that place\n                   with rockets, cannons, mortars,\n                   everything we got...from a safe\n                   distance.\n\n                                   RUBRICK\n                         (brightening)\n                   Raw firepower!\n\n                                   CHURCH\n                   It may not be heroic, and we may\n                   waste some ammo, but by God we'll\n                   get the job done.\n\n                                                       CUT TO:\n\n     EXT.  LANDSCAPE - DUSK\n\n     The four suns are dimming noticeably, dusk is falling.\n\n     The wind HOWLS, junk drifts and shifts.\n\n     A corpse turns over in the wind.  It's HAWKINS' BODY, ravaged by\n     the turbulent air, as we...\n\n                                                       CUT TO:\n\n     INT.  EARTHEN CORRIDOR/SETTLEMENT - NIGHT\n\n     Someone is dragging a CORPSE down the smoky, lamplit corridor as \n     little NATHAN watches SANDRA tending to the bloody wounds of a\n     PIONEER lying on the floor.  As the CORPSE is dragged past\n     NATHAN, the lifeless, vacant eyes stare right at the\n     uncomprehending little boy.\n\n     NATHAN sees the pioneer's seven year old daughter, ANGIE, sobbing\n     uncontrollably at the sight of her father's wounds.  SANDRA is\n     trying to help with the bandages and console ANGIE at the same\n     time while all round her in the hellish atmosphere people GROAN\n     and children CRY OUT.\n\n     NATHAN doesn't understand it, it's confusing.  MEN and WOMEN loom\n     past him.  He wobbles off down the corridor, toddling away from\n     the sounds of pain.\n\n     SHUK!  KA-SHUK!  Strange SOUNDS come from a doorway ahead, the\n     doorway to the meeting room.  CHAK!  KLAK!  SHIK CHIK KA CHIK!\n     The sound of metal and metal, metal parts CLICKING and SLIDING.\n\n     Alone in the corridor, NATHAN toddles innocently forward, toward\n     the SOUNDS.\n\n     INT.  MEETING ROOM\n\n     NATHAN wobbles into the meeting room doorway and stops there,\n     staring.\n\n     The burnt furniture has been heaped in one corner of the room,\n     leaving a large open space where TODD, bare-chested, a tourniquet\n     on one arm, is squatting on the floor, skillfully reassembling a\n     stripped rifle.\n\n     Surrounding him on the floor in neat piles are the rocket rifles, \n     pistols, ammo clips, utility belts, goggles, torn armor vests,\n     boots, grenades, knives, and flashlights he salvaged from the\n     dead soldiers.  TODD looks up at NATHAN and their eyes meet.\n\n     NATHAN recognizes his \"friend,\" tries a tentative little smile.\n     But TODD just stares at him, and the unformed smile fades from \n     NATHAN's face.  For a long moment they just look each other in\n     the eyes very seriously.\n\n     SANDRA enters, her dress covered with the wounded man's blood.\n     Not noticing TODD, she rushes to NATHAN, grabs him...\n\n                                   SANDRA\n                   Nathan, thank God, there you...\n\n     Suddenly seeing TODD she breaks off, stares at him.\n\n     Squatting on the floor, surrounded by weapons, TODD'S eyes meet\n     hers for a long moment...then he looks away, goes back to\n     assembling the weapons with quick sure movements, almost as if he \n     wanted to avoid her eyes.\n\n     SANDRA wets her lips to speak, hesitates, then finally blurts out\n     what she can hardly bear to ask...\n\n                                   SANDRA\n                   Did he find you?\n\n     No answer.  TODD finishes with the weapon, starts checking the\n     next one.\n\n                                   SANDRA\n                   My husband...Mace...he went out to\n                   look for you.  He...found you,\n                   didn't he?\n\n     TODD looks up at her and nods.  Their eyes lock.\n\n                                   SANDRA\n                   They...killed him...didn't they?\n\n     TODD nods, turns back to his arsenal.\n\n     SANDRA stands there, hugging NATHAN to her chest, holding her\n     tears in, her lids quivering, fighting to conquer her emotion.\n     After a long, difficult moment, she wins the battle with herself.\n     She looks numb, stunned, but she's not crying.\n\n     TODD has begun to dress.  He straps a sheath knife to one ankle,\n     pulls on boots.  Then he pulls a jersey over his muscular torso, \n     covering all the old scars, the tattooed names of battles, and\n     the tourniquet on his arm.\n\n     Staring at him with glazed eyes, SANDRA notices a blotch of blood\n     form on the jersey, leaking through the tourniquet.  She speaks \n     numbly.\n\n                                   SANDRA\n                   Your wound...it's still bleeding.\n\n     Stuffing his pockets with ammo and other items, TODD glances at\n     her with eyes that glitter dangerously.\n                                   TODD\n                   I like to bleed, sir.\n\n     SANDRA stares at him stupidly as he continues to dress, pulling\n     on a heavy armored vest.\n\n                                   SANDRA\n                   It doesn't...hurt?\n\n     TODD pulls on a second armored vast, one that already has a\n     ragged hole in it from a rocket.\n\n                                   TODD\n                   Not enough, sir.\n\n     SANDRA watches him go to the heap of charred furniture in the\n     corner and take a blackened stick from it, watches him smear\n     charcoal under his eyes.\n\n                                   SANDRA\n                   How do you know they'll come back?\n\n     TODD looks at her, a savage with blackened eyes.\n\n                                   TODD\n                   They're soldiers, sir.  Like me.\n\n                                   SANDRA\n                   What...what do they want?\n\n                                   TODD\n                   Nothing.\n\n                                   SANDRA\n                   Nothing?\n\n                                   TODD\n                   They are obeying orders, sir.  It's\n                   their duty.\n\n     For a moment SANDRA is silent, then...\n\n                                   SANDRA\n                   You know who they are, don't you?\n                   Do you know how many there'll be?\n\n     TODD crosses two utility belts across his armored chest like \n     bandoliers.\n\n                                   TODD\n                   Seventeen more, sir.\n\n                                   SANDRA\n                   Seventeen!  My God!\n                         (suddenly energized)\n                   You can't fight seventeen yourself!\n                   You have to organize the rest of us,\n                   show us what to do.  We don't have\n                   your...your skills...but we're not\n                   cowards.  We'll do what you tell us,\n                   we'll --\n\n                                   TODD\n                         (interrupting, softly)\n                   No.\n\n     His voice is soft as silk but hard as steel.  She looks into his\n     eyes.  Does she detect a hint of approval, of respect, in those\n     flat expressionless snake eyes?\n\n                                   SANDRA\n                   Why not?\n\n     TODD turns to go, laden with weapons, a flamethrower on his back,\n     a rocket rifle on his shoulder, another in one hand.\n\n                                   TODD\n                   Soldiers deserve soldiers, sir.\n\n                                   SANDRA\n                   But...one soldier against seventeen!\n\n     He looks back at her, right into her eyes this time.\n\n                                   TODD\n                   I am going to kill them all, sir.\n\n                                                       CUT TO:\n\n     INT.  CREW QUARTERS - NIGHT\n\n     The NEW SOLDIERS are putting on their heavy gear in ominous\n     silence, covering their muscular torsos with armored vests and\n     utility belts while SLOAN watches from the hatchway.\n\n                                   SLOAN\n                   Double belts, double ammo, double\n                   everything!  You've got to be heavy\n                   there or you'll blow away,\n                   fellas...and we wouldn't want that,\n                   would we?\n\n     They continue dressing obediently, their eyes the sullen eyes of \n     robots.  But CAINE 607 speaks up, at once respectful and\n     dignified...\n\n                                   CAINE 607\n                   It's dark now, sir.\n\n                                   SLOAN\n                   You're afraid of the dark, Sergeant\n                   Caine?\n\n                                   CAINE 607\n                   No, sir.  But the manual says --\n\n                                   SLOAN\n                   That's what nightscopes are for,\n                   soldier.  For the dark.\n\n                                   CAINE 607\n                   Yes, sir.  But the sixth rule is\n                   \"never give the enemy an advantage\n                   unnecessarily.\"  If they're\n                   expecting us --\n\n                                   SLOAN\n                         (erupting)\n                   Listen, Sergeant, this may come as\n                   news to you, but you're not a real\n                   hot thinker!  Your pitiful efforts\n                   at tactics have cost us three men\n                   already.  So turn it off, that\n                   little pea brain of yours!\n                         (turning to the others)\n                   That goes for all the rest of you\n                   mental giants too.  All you have to\n                   do is go boom-boom.  Understand?\n                   Boom-boom!  Kill kill!  Say it...\n                   Kill...kill...kill...\n\n     Draped in battle gear the seventeen NEW SOLDIERS obediently\n     repeat the words after her, their eyes blank and sullen...  \"Kill\n     kill kill...\"  They look like somber death machines as we...\n\n                                                       CUT TO:\n\n     EXT.  \"CONSTRUCTION\" SITE - NIGHT\n\n     In the harsh blue glare of work-lights RILEY and the crew of\n     VETERANS, dressed in heavy parkas, are struggling in the wind to\n     erect the second side of a small hut.\n\n     RILEY sees something, reacts.\n\n     He sees seventeen NEW SOLDIERS exiting the ship in the fringe of\n     the work-lights, ominous death machines in their heavy gear and \n     goggles, partly lost in shadows like some vision from hell.\n\n     RILEY stares at them, at the men who carry the weapons he used to\n     carry, his face like stone, his eyes a mystery as we...\n\n                                                       CUT TO:\n\n     INT.  CORRIDOR - NIGHT\n\n     SALLY and RED are guarding a door to the trench when a CLANKING\n     noise in the corridor behind them makes them turn and look.\n     Their jaws go slack with amazement.\n\n     Clanking toward them is TODD, so armored and laden with fighting\n     gear he looks almost like a medieval knight!  He says nothing as\n     he looms closer to then, heading for the door.  The two of then\n     shrink hastily out of his way.\n\n     EXT.  INSIDE TRENCH\n\n     Stepping into the trench, TODD hears the wind SCREAM overhead.\n     He approaches crude steps dug in the side of the trench and\n     begins to pull himself up into the wind.\n\n     As he climbs, the SCREAMING wind changes pitch radically, and by\n     the time he bellies over the lip of the trench, the wind is only\n     a breeze.\n\n     Getting to his feet and finds even the breeze is dying, replaced\n     by a terrible stillness.\n\n     As TODD looks off into the darkness, a voice calls to him from\n     the trench behind biz.\n\n                                   SANDRA (O.S.)\n                   Sergeant!  Sergeant Todd!\n\n     TODD turns back, looking down into the trench, and sees SANDRA\n     looking up at him.\n\n                                   SANDRA\n                   Sergeant...these soldiers...the ones\n                   you're going to fight...  Are these\n                   the \"better ones\"...the ones who\n                   replaced you?\n\n     TODD looks at her for a long moment, his face a mask, before he\n     nods almost imperceptibly.  Her eyes are full of tears.\n\n                                   SANDRA\n                   Sergeant Todd...I think they...I\n                   think...someone made a serious...\n                   mistake.\n\n     TODD looks into her eyes.  It is impossible to tell if he knows\n     that she cares about him and that she is blessing him.\n\n     After a moment he turns away and lumbers off into the darkness,\n     the CLANKING of his equipment the only sound in the spooky\n     stillness.\n\n                                                       CUT TO:\n\n     EXT.  JUNK/TERRAIN - NIGHT\n\n     Two CRAWLERS cut through the night fifty yards apart.  Four of\n     the NEW SOLDIERS cling to the outside of one CRAWLER, five on the \n     other, two on each CRAWLER operating spotlights that pan the\n     darkness to the sides while the headlights illuminate the\n     skeleton of the crashed ship and shadowy chunks of machinery\n     littered across the terrain ahead of them.\n\n     It is very still.  No wind.\n\n     INT.  CRAWLER ONE\n\n     A DRIVER is at the wheel, a GUNNER beside him, studying the night\n     through an infrared scope.  Behind them, two more NEW SOLDIERS\n     sit lost in shadows in the back seat, staring impassively out the \n     window at the spooky spotlights combing the eerie junkyard.\n\n     EXT.  CRAWLER ONE\n\n     The LEFT FRONT SOLDIER sits on the fender seat of CRAWLER ONE,\n     peering along the beam of his spotlight, scrutinizing the\n     sinister shapes in the darkness, when...\n\n     BLAM!  He's shot in the face, slammed back into the windshield of \n     CRAWLER ONE.\n\n     INT.  CRAWLER ONE\n\n     Vision blocked, the DRIVER is fighting for control of the vehicle\n     as the GUNNER to his right screams into the radio mike...\n\n                                   GUNNER\n                   CRAWLER ONE, WE ARE RED!  RED!  WE\n                   ARE RED!\n\n     By veering sharply, the DRIVER is able to shake off the body that\n     was blocking his vision, clearing his shattered windshield.\n\n     EXT.  JUNK TERRAIN\n\n     Seven of the NEW SOLDIERS -- the three hanging on CRAWLER ONE and\n     the four from CRAWLER TWO -- drop off into the stillness.  One\n     checks the LEFT FRONT SOLDIER's body while the others, barely\n     visible in the weak light, fan out, keeping low, taking cover in\n     the random junk strewn all around them.\n\n     ANGLE ON NEW SOLDIER ONE, a corporal, crouched behind a huge\n     piece of discarded agriculture machinery.  He yanks a flare from\n     his waist band and fires it.\n\n     The FLARE bursts overhead, exposing the ghostly terrain to a\n     bright green light.\n\n     ANGLE ON THE JUNK AND THE SKELETON SHIP: a ghostly graveyard.  No \n     wind.  Nothing moves.  No sign of TODD.\n\n     INT.  CRAWLER ONE\n\n     Maneuvering across the junk-strewn landscape, the DRIVER peers\n     through the cracked windshield at the green terrain, looking for\n     TODD as the RADIO crackles...\n\n                                   RADIO\n                   Crawler Two to Crawler One.  Do you\n                   have a sitrep?\n\n     THE GUNNER and the DRIVER exchange a glance.  The GUNNER takes\n     the mike and speaks into it.\n\n                                   GUNNER\n                   Crawler Two, we are one down,\n                   responding to sniper activity.\n\n     INT.  CRAWLER TWO\n\n     CAINE 607 is at the wheel, speaking into his mike.\n\n                                   CAINE 607\n                   Crawler One, do you require\n                   assistance?\n\n                                   RADIO\n                   That is negative.  We will eliminate\n                   the sniper and rendezvous at target.\n\n                                   CAINE 607\n                   Roger, One.  We are proceeding to\n                   target.\n\n     CAINE 607 accelerates the CRAWLER.\n\n     EXT.  JUNK TERRAIN\n\n     The flare fades and the near darkness returns.\n\n     ANGLE ON NEW SOLDIER ONE peering out into the stillness, then \n     signaling NEW SOLDIER TWO who's hiding nearby.\n\n     As the two NEW SOLDIERS step out from their sheltered positions, \n     they're joined by NEW SOLDIER THREE.  Exchanging hand signals,\n     the three of them advance, spreading out cautiously.\n\n     NEW SOLDIER THREE has moved about thirty yards away when suddenly\n     he \"disappears.\"\n\n     EXT.  INSIDE A \"CATCM TRENCH\"\n\n     SPLASH!  SOLDIER THREE has tumbled into a flooded trench.\n\n     He struggles to his feet, can't figure out where he is.  He pulls\n     a flashlight from his waist and shines it down the trench in both \n     directions.\n\n     The flashlight beam reveals a steep-walled trench knee-deep in\n     water and littered with rusting junk.\n\n     NEW SOLDIER THREE splashes along the trench, looking for a way\n     out.\n\n     His light reveals a piece of a derrick mast leaning against the \n     trench, a perfect ladder.\n\n     He's slogging toward it when he whirls suddenly and splays his\n     beam down the trench behind him.\n\n     NEW SOLDIER THREE'S POV of the flooded trench.  Junk and water.\n\n     ANGLE ON NEW SOLDIER THREE, turning back and approaching the\n     ladder.  Just as he reaches the ladder he whirls again.\n\n     Again his light illuminates the spooky trench.  Again, nothing\n     but water and junk.\n\n     Relieved, he's just about to switch off his light when...\n\n     TODD rises out of the water only five feet away like a demon.\n\n     Before NEW SOLDIER THREE can cry out, TODO lunges at him.\n     EXT.  JUNK TERRAIN\n\n     As he creeps cautiously through the gloom, NEW SOLDIER ONE\n     stiffens.  Was that a stifled CRY?  Or not?\n\n     NEW SOLDIER ONE signals NEW SOLDIER TWO and the two of them turn\n     and move cautiously toward where NEW SOLDIER THREE was.\n\n     EXT.  INSIDE THE TRENCH\n\n     TODD'S light reveals NEW SOLDIER THREE slumped in the water, his\n     head askew, neck broken, eyes vacant.  TODD is hastily rummaging\n     through the soldier's equipment, looking for something.\n\n     He finds it.\n\n     EXT.  JUNK TERRAIN\n\n     NEW SOLDIERS ONE and TWO are approaching the trench when suddenly\n     a flare bursts above them.\n\n     The NEW SOLDIERS react with amazement as the flare exposes them\n     in a brightly illuminated landscape.  Before they can take\n     cover...\n\n     BUDDA BUDDA BUDDA.  Flashes of fire from the lip of the trench.\n\n     NEW SOLDIER ONE drops dead, NEW SOLDIER TWO is down and writhing\n     on the ground, SCREAMING.\n\n     ANGLE ON CRAWLER ONE veering sharply toward the trench, \n     accelerating, FIRING ROCKETS, CANONS, MACHINE GUNS....\n\n     ANGLE ON THE OTHER NEW SOLDIERS, prone, firing toward the trench.\n\n     EXT.  INSIDE THE TRENCH\n\n     Tracers whizzing over the top of the trench illuminate TODD as he \n     races down the trench, running for his life.\n\n     EXT.  JUNK TERRAIN\n\n     Still firing, CRAWLER ONE grinds up to the lip of the trench.\n\n     ANGLE ON NEW SOLDIERS charging toward the trench behind the\n     CRAWLER.\n\n     CLOSE ON CRAWLER ONE'S HOOD where a small trap opens and a nozzle\n     pops out like a little penis and...SQUIRTS a stream of liquid!\n     The liquid stream arcs fifty yards along the trench and\n     diminishes backward like a man pissing...\n\n     INT.  INSIDE THE TRENCH\n\n     TODD looks back just before be rounds a corner in the trench,\n     sees the liquid hitting the water in the trench.\n\n     Sheltered from their view by the turn in the trench, TODD tries\n     to scale the steep wall of the trench.\n\n     WHOOOOOOOOOSH!  The surface of the water-filled trench bursts\n     into flame.  A fiery river of flammable liquid.\n\n     ANGLE ON NEW SOLDIERS reacting to something!\n\n     NEW SOLDIERS' POV of TODD, visible in the firelight as he rolls\n     over the lip of the trench fifty yards from them.\n\n     ANGLE ON THE NEW SOLDIERS firing as they move toward TODD.\n     They've got him now!\n\n     ANGLE ON TODD bellying toward a rusting turbine, disappearing\n     from view.\n\n     ANGLE ON CRAWLER ONE, separated from TODD'S hideout by the \n     trench, pouring heavy FIRE on the spot where TODD disappeared.\n\n     ANGLE ON NEW SOLDIERS communicating by hand signals as they move\n     to surround TODD.\n\n     EXT.  BEHIND THE TURBINE\n\n     As rockets and canon shells SLAM into the turbine, TODD hastily\n     attends to a nasty wound in the flesh his thigh, bandaging it\n     skillfully, quickly.\n     EXT.  JUNK TERRAIN\n\n     While CRAWLER ONE keeps TODD pinned down, NEW SOLDIERS move to \n     outflank him.\n\n     EXT.  BEHIND THE TURBINE\n\n     As TODD completes dressing his thigh, the CRAWLER stops firing.\n\n     Silence.\n\n     TODD peers out, assessing the situation.\n\n     TODD'S POV of the terrain.  Vague glimpses of NEW SOLDIERS\n     slipping from cover to cover, never exposing themselves enough\n     for a shot.\n\n     ANGLE ON TODD.  He seems to know he's in a tight spot.  He's\n     preparing to fight off an attack, laying out weapons, grenades,\n     when...he freezes.  Listens.\n\n     Behind the stillness he can hear the faint WHISTLE that precedes\n     the wind.\n\n     Hastily TODD yanks his belt off.\n\n     EXT.  TERRAIN\n\n     NEW SOLDIER FOUR sticks his head up from behind an old boiler and \n     signals NEW SOLDIER FIVE.\n\n     ANGLE ON NEW SOLDIER FIVE acknowledging from the mouth of an old \n     storage tank where he's positioned.\n\n     ANGLE ON NEW SOLDIER SIX bellying toward TODD'S position.\n\n     EXT.  BEHIND THE TURBINE\n\n     Using his belt and a carabiner as a safety line, TODD attaches\n     himself to the heavy turbine...and gathers up his weapons.  He\n     can HEAR the very low WHISTLING building ever so slightly.\n\n     EXT.  TERRAIN\n\n     The WIND SIGHS and a faint breeze stirs.  Then a tin can skitters\n     by in a puff of wind as the NEW SOLDIERS take turns moving\n     closer to TODD, flanking him from safe vantage points.\n\n     NEW SOLDIER FOUR stands to wave the next man forward when...\n\n     WHOOOOOOOOOOOOOSH!  THE WIND ERUPTS, ROARS, BELLOWS...\n\n     NEW SOLDIER FOUR is lifted into the air and carried away.\n\n     NEW SOLDIER FIVE is trying to stay on his feet, as the wind SLAMS\n     him into one piece of junk after another.\n\n     INT./EXT.  CRAWLER\n\n     As the wind HOWLS and shakes the CRAWLER, the DRIVER and the\n     GUNNER stare with amazement as NEW SOLDIER FIVE slams into their \n     windshield, neck broken, and stares at them with lifeless eyes.\n     They see NEW SOLDIERS SIX and SEVEN tumble and somersault past.\n\n     As NEW SOLDIER SIX disappears, blown off into the night, NEW\n     SOLDIER SEVEN manages to grab hold of the walking wire.\n\n     Gripping the wire for his life, he turns just in time to be \n     decapitated by a piece of aluminum housing flying through the\n     air.\n\n     EXT.  TERRAIN\n\n     NEW SOLDIER FOUR, badly battered, is down on his belly trying to\n     stay \"under the wind\" when he sees something terrible!\n\n     HIS POV of a massive lathe blowing right toward him along the\n     ground, tumbling, crashing, slamming into things.  It looms over\n     him, unavoidable, the end!\n\n     ANGLE ON NEW SOLDIER FOUR reacting to the huge lathe about to\n     crush him.\n\n     EXT.  BEHIND THE TURBINE\n\n     Held by his safety belt and protected by the turbine, TODD peers\n     out, and watches the wind destroy the footsoldiers.\n\n     TODD'S POV OF NEW SOLDIER FIVE's lifeless body being blown along\n     the ground like a leaf.\n\n     ANGLE ON TODD, reacting.  He's seen something important.\n\n     TODD'S POV of CRAWLER ONE moving again, rounding the far end of\n     the trench and, no longer separated by the trench, turning\n     toward TODD'S position.\n\n     INT.  CRAWLER ONE\n\n     As the DRIVER steers, the GUNNER peers through his scope.\n\n     GUNNER'S INFRARED POV of TODD darting behind an overturned vat.\n\n                                   GUNNER\n                   There!\n\n     The DRIVER steers toward where TODD disappeared.\n\n     EXT.  JUNK TERRAIN\n\n     Windborne junk CLATTERS against CRAWLER ONE'S armor plating,\n     debris flies through the bright swaths of the headlights, as the\n     vehicle grinds toward the overturned vat.\n\n     ANGLE ON CRAWLER ONE coming around the vat, headlights glaring.\n\n     INT.  CRAWLER ONE\n\n     The GUNNER is peering intently through his scope.\n\n     GUNNER'S POV through his scope: The infrared view with crosshairs\n     is especially spooky because of the debris blowing eerily across\n     the landscape as the gun whips back and forth, looking vainly for \n     TODD.  Suddenly the sight is yanked hard, sweeping violently\n     over to pin a moving object...\n\n     False alarm!  Just another piece of blowing junk.  No sign of\n     TODD.\n\n     EXT.  CRAWLER/JUNK TERRAIN\n\n     The CRAWLER grinds slowly past a huge overturned boiler, its\n     cannon panning right, then left, then right.\n\n     INT.  CRAWLER ONE\n\n     Peering through the scope as he sweeps the terrain, the GUNNER\n     suddenly stiffens and back-pans to find something...\n\n                                   GUNNER\n                   Tentative at One.\n\n     The DRIVER angles right, aiming for one o'clock.\n\n                                   GUNNER\n                   That's negative, no target.\n\n     The DRIVER swings the wheel back and they continue slowly through\n     the darkness.\n\n     In the back seat, two NEW SOLDIERS peer into the night with blank \n     faces.  One of them is watching a huge plastic sign cartwheel\n     past in the wind when --\n\n     -- he reacts!\n\n     -- as TODD'S face appears is only inches from his, right against\n     the plexi!\n\n     BAM!  Before the NEW SOLDIER can do more than look startled, TODD \n     shoots out the window with a pistol and shoves a live grenade\n     through the hole.\n\n                                   NEW SOLDIER\n                   RED!  RED!  RE --\n\n     BAWHOOOM!  The grenade EXPLODES and...\n\n     The DRIVER fights for control of the wheel.\n\n     The GUNNER screams and screams and screams like a machine running\n     at high speed while the two NEW SOLDIERS lie open-eyed with death\n     in the back seat.\n\n     EXT.  CRAWLER\n\n     No sign of TODD.  Disappeared again.\n\n     As the wind ROARS furiously, the damaged CRAWLER limps along.\n\n     INT.  CRAWLER ONE\n\n     The dying GUNNER is making awful noises while the DRIVER, eyes\n     glazed, his face streaming with blood, maneuvers the vehicle\n     slowly and cautiously, looking for the enemy...\n\n     But all he sees through the cracked windshield is a shadowy world\n     of wind-tossed debris.\n\n     EXT.  JUNK TERRAIN\n\n     Protected by a hunk of pipe, TODD crouches and watches the\n     CRAWLER, his eyes glittering, his weapon ready.  It's clear now\n     that the tables are turned and he is the hunter as we...\n\n                                                       CUT TO:\n\n     INT.  CORRIDORS - NIGHT\n\n     EXPLOSIONS!  SCREAMS!  BAWHOOM!  Another shell hits, beams\n     splinter, dirt walls collapse.\n\n     Eight-year old JOHNNY, alone and terrified, comes in to view\n     around a corner.  He's been separated from the others.\n\n                                   JOHNNY\n                   DAD!  DAAAAAAD!\n\n     No answer.\n\n     JOHNNY doesn't know which way to go.  The world's falling apart!\n\n     WHUMP!  The little warren of earthen corridors is shaken by\n     another BLAST.\n\n     Desperate, JOHNNY makes a left, away from the last blast and\n     hurries down a collapsing corridor past doorways that reveal\n     rooms with no ceilings where the wind HOWLS.  It's obvious the \n     shelling has been going on for a while.\n\n                                   JOHNNY\n                   DAAAAAAAD!\n\n     Just then, JIMMY PIG pops out of a doorway in front of him and\n     and rushes toward him.\n\n                                   JIMMY PIG\n                   GOTCHA!\n\n     BA-WHOOM!  Another shell collapses the corridor behind JOHNNY as\n     JIMMY PIG grabs him and hauls him toward the door he emerged\n     from, the Dining Commons.\n\n     INT.  DINING COMMONS\n\n     EMMA is ushering CHILDREN through a trap door in the floor into\n     the root cellar as JIMMY PIG ushers JOHNNY into the room.\n\n                                   JOHNNY\n                   Where's my father?  Where's my\n                   father?\n\n     JOHNNY looks around urgently.\n\n     SANDRA is bandaging TOMMY'S arm while ELLEN, NATHAN, and WILL are\n     huddling under a table in the most protected corner of the room.\n\n     JIMMY PIG and JUDITH exchange a pained look as JIMMY PIG pushes\n     JOHNNY toward SANDRA and the table.\n\n                                   JIMMY PIG\n                   Johnny, get over under that table\n                   with Miss Sandra and Ellen and the\n                   others.  Miss Judith, you better go\n                   on down the root cellar with Emma\n                   and help with the ones down there.\n\n                                   JOHNNY\n                   Where's my mother?\n\n     BAH-DOOOM!  Another fierce CONCUSSION twenty yards away shakes\n     dirt from the ceiling.  ELLEN beckons from under the table...\n\n                                   ELLEN\n                   Come on, Johnny.\n\n                                                       CUT TO:\n\n     EXT.  SETTLEMENT - NIGHT\n\n     MUZZLE FLASH!  FFFWHOOOMP!  CRAWLER TWO fires another round.\n\n     The vehicle is squatting not thirty yards from the trench garden,\n     pouring round after round into the colony, lighting the night\n     with bright-colored flowery blasts.\n\n     Crouched in the wind not far from the vehicle, the two NEW\n     SOLDIERS from the back seat have set up a mortar, and they too\n     are firing away.\n\n     INT.  CRAWLER TWO/STATlONARY\n\n     The GUNNER is looking through his scope, methodically aiming and\n     firing as CAINE 607 at the wheel watches impassively.\n\n     KA-FOOMP!  Another shot, the vehicle rocks, and, five hundred\n     yards away, fire and dirt fountain thirty feet into the air.\n\n     BEEP!  BEEP!  A light on the dash blinks on.  CAINE 607 switches\n     on a radarscope, spots a blip.\n\n     The GUNNER takes his eyes off the scope, looks at the blip.\n\n     CAINE 607 is already manipulating a spotlight, looking across the\n     GUNNER out the right window.\n\n     The spotlight stabs the darkness, finds a moving vehicle a half\n     mile of moving toward them.  It's CRAWLER ONE with its lights\n     out.\n\n     As CAINE 607 flicks off the spotlight, the GUNNER turns back to\n     the scope and resumes his deadly barrage.  CAINE 607 speaks into\n     the radio mike.\n\n                                   CAINE 607\n                   Crawler Two to Crawler One.  Come\n                   in, One.\n\n                                   RADIO\n                   One.\n\n                                   CAINE 607\n                   Two to one, take your port to our\n                   nine o'clock and commence firing.\n\n                                   RADIO\n                   Copy, Two.  Port to your nine and\n                   commence firing.\n\n     FOOOMP!  The GUNNER fires again, rocking the vehicle.\n\n     CAINE 607 looks at the SCOPE.\n\n     The blip continues on directly on its course.\n\n     CAINE 607 picks up the mike again.\n\n                                   CAINE 607\n                   Crawler Two to Crawler One.  Again;\n                   proceed to port nine...\n\n                                   RADIO\n                   Affirmative, Two.\n\n     FOOOMP!  The GUNNER fires again as CAINE 607 looks at the screen.\n\n     The blip on the screen keeps on straight, doesn't alter course!\n\n                                   CAINE 607\n                         (into the mike)\n                   Two to One.  You are still on twelve\n                   o'clock.  Correct to nine.\n                                   RADIO\n                   Roger.\n\n     But the blip continues straight, directly at them.\n\n     And suddenly CAINE realizes!  Dropping the mike he snaps at his\n     GUNNER urgently.\n\n                                   CAINE 607\n                   Gunner, hard to port, target hard to\n                   port!\n\n     As the startled GUNNER starts to obey both of them are bathed in\n     sudden, blinding white light as CRAWLER ONE suddenly switches on\n     all lights and...\n\n     KA-BLAM!  KA-BLAM!  MUZZLES FLASHES from CRAWLER ONE.\n\n     WHUMP!  WHUMP!  CRAWLER TWO shudders, taking two direct hits.\n\n     The GUNNER SCREAMS in pain.\n\n     INT.  CRAWLER ONE\n\n     TODD is at the wheel, speaking into the radio as wind whips at\n     him through the shattered windshield.\n\n                                   TODD\n                   Roger, Two.  Affirmative.\n\n     BLAM!  BLAM!  TODD fires as he drives straight ahead toward\n     CRAWLER TWO and the two NEW SOLDIERS pinned in his headlight.\n\n     EXT.  CRAWLER TWO\n\n     As shells slam into CRAWLER TWO, the two NEW SOLDIERS outside try\n     to get clear of the explosions, staggering off into the wind.\n\n     INT.  CRAWLER ONE\n\n     TODD sets his sights on one of the NEW SOLDIERS, cutting him down\n     with rocket fire, then he glances toward the SECOND NEW SOLDIER\n     on the right.\n\n     The SECOND NEW SOLDIER, ten yards ahead, stops, turns to fire.\n\n     TODD yanks the wheel, swerving toward him.\n\n     EXT.  CRAWLERS\n\n     CRAWLER ONE plows into the NEW SOLDIER, crushing him under the\n     wheels, and continuing to grind toward the crippled CRAWLER TWO.\n\n     WHAM!  CRAWLER ONE rams CRAWLER TWO and drives it sideways,\n     pushing it ten yards... twenty yards.... thirty yards...until\n     suddenly it sprawls into the mouth of the trench garden,\n     splintering the trellis and wedging itself at a sharply canted\n     angle over the garden, and we...\n\n                                                       CUT TO:\n\n     INT.  CAPTAIN'S CABIN/\"DADDY\" - NIGHT\n\n     Silence.  CHURCH is dozing fully clothed on his bunk in a tiny\n     stateroom.\n\n     BZZZZT.  BZZZZT!  A buzzer sounds and a light flashes.\n\n     CHURCH opens his eyes, sees the light flashing.\n\n     Siting up in the bunk, he grabs the receiver of a phone and puts\n     it to his ear.  As he listens, his eyes widen with\n     incredulity...then they get wider as he hears more.\n\n                                   CHURCH\n                   Whaaaaat?\n\n                                                       CUT TO:\n\n     INT.  CORRIDORS/SETTLEMENT - NIGHT\n\n     Thick smoke clogs the narrow corridors as RED winds through the\n     maze of corridors, coughing desperately.  He can hear VOICES\n     ahead.\n\n     INT.  DINING COMMONS/SETTLEMENT\n\n     RED charges into the commons, shouting excitedly.\n\n                                   RED\n                   THEY STOPPED SHOOTING!  THEY STOPPED\n                   SHOOTING!\n\n     He stops abruptly, seeing...\n\n     a blazing fire, whipped by wind from a shel hole in the ceiling, \n     consuming tables in the far half of the commons...\n\n     while JIMMY PIG, SLADE and SANDRA struggle with one end of a huge\n     beam that's fallen at an angle on top of a trap door in the floor,\n     the root cellar.\n\n     ELLEN, with NATHAN in her arms, TOMMY, WILL, JOHNNY and OTHER\n     CHILDREN hover behind her, staring at...\n\n     a six inch opening between the floor and the trap door where\n     EMMA, JUDITH and OTHER CHILDREN, unable to squeeze through the\n     six inch gap, peer out with frightened eyes, trapped.\n\n                                   RED\n                         (dampened)\n                   They stopped shooting!\n\n                                   JIMMY PIG\n                         (to Red)\n                   Give us a hand, dammit!\n\n     As RED joins the effort.  SLADE snaps at him sarcastically as he \n     strains against the heavy beam.\n\n                                   SLADE\n                   You think (grunt) that's good they\n                   stopped?  It means (grunt) they're\n                   comin' for us!  To (grunt) kill us!\n                   That's good news, you think?\n\n                                   SANDRA\n                         (looking for hope)\n                   Sergeant Todd (grunt, cough) said...\n\n                                   SLADE\n                   That he's gonna (grunt) stomp a whole\n                   army?  Couldn't if he wanted.\n\n     The smoke is getting thicker.  EMMA and JUDITH are coughing, \n     looking scared.\n\n                                   SANDRA\n                   He (grunt) knew them!  He said --\n\n                                   SLADE\n                   He's dead!  If he isn't (grunt)\n                   dead, he joined 'em.  He don't\n                   (grunt) care about us, he's a\n                   soldier.  Besides, we threw him out,\n                   remember?\n\n     SANDRA pushes at the beam with all her strength, fighting back\n     tears of despair.\n\n                                   SANDRA\n                   He's not dead!\n\n     The massive beam won't budge!  Eyes wide with terror, EMMA and\n     RUTH peer out of their trap.\n\n                                                       CUT TO:\n\n     INT.  COCKPIT/\"DADDY\" - NIGHT\n\n     CHURCH is in the cockpit now, hovering behind RUBRICK who's\n     speaking urging into the radio mike.\n\n                                   RUBRICK\n                   This is Daddy, come in, Number Two.\n                   Daddy calling Number Two...\n\n                                   CHURCH\n                   What about Number One?  Try\n                   Number...\n\n                                   RUBRICK\n                   I tried One.  I can't get either\n                   one of them.\n\n     SLOAN is pacing, looks sick to her stomach with fear.\n\n                                   SLOAN\n                   There was...some kind of...\n                   guerilla action...\n\n                                   RUBRICK\n                   Then we lost them...\n\n     Now CHURCH is pacing back and forth, panicky, ranting...\n\n                                   CHURCH\n                   You should have waked me sooner!\n                   This is bad, very bad.  I never\n                   should have let that clown Mekum\n                   test his wonder boy army on me.  \"If\n                   it ain't broke, don't fix it.\"\n                   Shit!  We don't even know what we're\n                   up against.  How many...?\n\n                                   SLOAN\n                   We couldn't get any figures on enemy\n                   troop strength.\n\n                                   RUBRICK\n                   Not even estimates...\n\n                                   CHURCH\n                   We're sitting ducks here!  There\n                   could be a couple of divisions!\n                   More!  We don't even have the\n                   weapons to arm the old soldiers.\n\n                                   RUBRICK\n                         (into the mike,\n                          desperately)\n                   Hello...  Hello, One. This is\n                   Daddy...\n\n     EXT.  ABOVE THE TRENCH GARDEN\n\n     The radio in CRAWLER TWO is still SQUAWKING urgently with\n     RUBRICK'S VOICE as the crippled vehicle lies sprawled at a\n     violent angle over the trench garden.\n\n                                   RADIO (V.O.)\n                   This is Daddy!  Come in, Crawler\n                   Two, come in...\n\n     Nearby, A VOICE is crying out in pain in the night.\n\n     Limping, TODD keeps his weapon ready as he searches out the\n     sound.\n\n     ANGLE ON THE INJURED SOLDIER, the one TODD crushed under the\n     treads of the CRAWLER.  He's screaming in pain.  Looks up.\n\n     TODD looms over the INJURED SOLDIER, weapon pointed.  Their eyes\n     meet.\n\n     In agony, the SOLDIER looks into TODD'S eyes, nods ever\n     so slightly.\n\n     BLAM!  BLAM!  TODD fires point blank.\n\n     Now the only sound is the ROARING of the WIND and the pathetic\n     sound of RUBRICK continuing his desperate RADIO BABBLE.\n\n     EXT.  INSIDE THE TRENCH GARDEN\n\n     As the RADIO CHATTERS, burning debris from the CRAWLER canted\n     over the garden illuminates the garden...and a BODY sprawled\n     there, fallen from the CRAWLER above.\n\n     BAM!  KABAM!  ROCKET FIRE!\n\n     EXT.  ABOVE THE TRENCH\n\n     TODD FIRES rockets into the damaged CRAWLER...until the RADIO\n     CHATTER stops abruptly.  RADIO killed dead.\n\n                                                       CUT TO:\n     INT.  DINING COMMONS/SETTLEMENT - NIGHT\n\n     The gap between the floor and the trap door has increased to ten\n     inches, enough for EMMA and RUTH to squeeze an INFANT through to\n     SANDRA'S reaching arms.\n\n     Soaked with sweat, gasping and coughing in the thickening smoke, \n     JIMMY PIG, SLADE and RED continue to strain at the beam...and it\n     moves.  Another inch!\n\n     The fire is raging.  The INFANT SQUALLS in SANDRA'S arms.  SLADE\n     snaps at her as he pushes on the beam.\n\n                                   SLADE\n                   Get them kids (grunt) hid somewhere!\n                   There's soldiers coming.\n\n     ELLEN and the CHILDREN look alarmed as SANDRA gathers them and\n     ushers them toward the exit, glancing back toward the trap door\n     as she's leaving.\n\n     EMMA and RUTH meet her look with frightened eyes.\n\n     Noticing SANDRA'S hesitation, JIMMY PIG reassures her...\n\n                                   JIMMY PIG\n                   Don't worry.  Couple more inches and\n                   they're out.\n\n     SANDRA and the CHILDREN exit.\n\n     And suddenly!!!  The beam slips back five inches, almost closing\n     the opening.  EMMA and JUDITH SCREAM!\n\n     JIMMY PIG, RED and SLADE look alarmed, defeated.\n\n     EXT.  ABOVE THE TRENCH GARDEN\n\n     TODD walks away from the smoking bulk of the CRAWLER canted over\n     the garden and drops into a traveling trench.\n\n     EXT.  INSIDE A PASSAGE TRENCH\n\n     Limping slightly, laden with weapons and still wearing his\n     helmet, TODD starts along the trench in the direction of the \n     settlement.\n\n     EXT.  INSIDE THE TRENCH GARDEN\n\n     In the shadows six feet below the overturned and smoldering\n     CRAWLER TWO, the BODY stirs on the floor of the garden, barely\n     visible in the flickering half light from the flames above.\n\n     It's CAINE 607.  He groans and stirs again.  He's not dead!  In\n     fact, he's rolling over, struggling to his knees.\n\n     INT.  DINING COMMONS\n\n     The frightened eyes of EMMA, RUTH and CHILDREN peer from the four\n     inch crack.\n\n     Whipped by wind from the hole in the ceiling, the fire is\n     spreading, the smoke is thick.  JIMMY PIG, SLADE and RED are\n     gasping with effort and coughing.  SLADE gasps to RED.\n\n                                   SLADE\n                   You know where Thomas keeps those\n                   two axes?  Go get the axes.\n\n     RED takes off at a run.\n\n                                   JIMMY PIG\n                         (so Emma and Ruth can't\n                          hear)\n                   We can't (cough) chop 'em out.  We\n                   don't have time.\n\n                                   SLADE\n                   Just as good (gasp) to die chopping\n                   as fighting.\n\n     INT.  CORRIDOR\n\n     RED rushes through a smoky corridor.  Wherever shells have\n     punctured the roof, the WIND whips debris about.\n\n     EXT.  INSIDE THE GARDEN TRENCH\n\n     Sitting up now, using a flashlight, CAINE 607 is examining a\n     terrible gash in his thigh that reveals tissue and tendon.  The\n     right side of his face is also badly injured, flesh torn, swollen\n     and distorted.\n\n     He pulls the first aid kit from his utility belt, opens it,\n     focuses the light on the contents.\n\n     Selects a couple of pills.  Swallows them.  Considers.  Takes two \n     more.  Pulls out a hypodermic needle, injects his leg.  Takes\n     another needle, stabs his bloody cheek.\n\n     His eyes glitter as he feels the rush from the drug.  He looks \n     dangerous again in spite of his condition.\n\n     EXT.  INSIDE THE PASSAGE TRENCH\n\n     TODD reaches the settlement, enters a half collapsed doorway.\n\n     INT.  SUPPLY ROOM\n\n     RED is urgently rummaging through crowbars, coils of rope, sledge\n     hammers.  At last he finds two axes, grabs them and exits.\n     INT.  CORRIDOR/SETTLEMENT\n\n     TODD picks his way among collapsed walls, fallen timbers.\n\n     He peers through doorways, sees CORPSES.\n\n     Moves on.  Searching.\n\n     EXT.  INSIDE THE PASSAGE TRENCH\n\n     Dragging a freshly bandaged leg, CAINE 607 makes his way along\n     the trench toward the settlement.  He's using the wall for\n     support...but he seems to be getting stronger rather than weaker.\n     His face is hideous.\n     INT.  JUNCTION OF CORRIDORS\n\n     Carrying two axes RED zips around a corner and freezes...\n\n     RED'S POV of: A SOLDIER, seen from behind, moving down a smoky\n     corridor, helmeted, heavily armed, dangerous looking,\n     unidentifiable.\n\n     ANGLE ON RED, terrified, waiting till the SOLDIER (TODD) has\n     disappeared in the smoke.  Then RED hurries on down another\n     damaged corridor, axes in hand.\n\n     INT.  OTHER DAMAGED CORRIDOR\n\n     RED scoots around another corner and... stops short...an armored\n     torso a foot in front of his face.\n\n     Looking up, RED looks right into the distorted face of CAINE 607.\n\n     Before RED can react, CAINE 607'S hand shoots out and snatches\n     one of the axes.\n\n     Astonished, RED backs up a step, and raises the other axe to\n     defend himself.\n\n     RED'S POV OF CAINE 607 looming toward him, axe in hand.\n\n     ANGLE ON RED, turning and running.\n\n     ANGLE ON CAINE 607 limping along, dragging his leg as RED\n     disappears around a corner.\n\n     CAINE 607 rounds the corner in pursuit... and see only smoke,\n     no sign of RED.\n\n     INT.  DINING COMMONS\n\n     EMMA and JUDITH peer out from under the heavy metal trap door as\n     JIMMY PIG and SLADE desperately try to move the beam using a\n     piece of metal as a lever.\n\n                                   SLADE\n                   This (grunt, cough) ain't gonna\n                   work.  Where's them axes?  He musta\n                   run into soldiers and got killed.\n\n                                   JIMMY PIG\n                   How do you know there's soldiers coming?\n\n                                   SLADE\n                   'Cause soldiers (gasp) finish what\n                   they start -- unless you stop 'em.\n                   And we're what (gasp) they started,\n                   and we didn't stop 'em!\n                         (shouts to Emma)\n                   WE'RE GONNA GET YOU OUTTA THERE\n                   SOMEHOW!  I SWEAR IT!\n\n     Just then RED bursts into the room with a single axe, shouting...\n                                   RED\n                   SOLDIERS!  SOLDIERS!\n                                   SLADE\n                         (grabbing the axe)\n                   Only one axe?\n\n                                   RED\n                   They took the other one!\n\n                                   SLADE\n                         (chopping furiously)\n                   Toldja.\n\n                                   JIMMY PIG\n                         (to Red)\n                   How many?\n\n                                   RED\n                   I... I couldn't... I couldn't...\n                   count 'em.  Four, I think.  Maybe\n                   five.\n\n                                   SLADE\n                         (chopping)\n                   More!  Trust me!\n\n                                   JIMMY PIG\n                         (grabbing the axe)\n                   Turns.\n\n     JIMMY PIG starts chopping furiously.\n\n     SLADE picks up a rifle, hands it to RED.\n\n                                   SLADE\n                   Do what you can.\n\n     As RED looks at the rifle, alarmed, SLADE \"comforts\" him.\n\n                                   SLADE\n                   They're gonna kill us anyhow.  No\n                   point in surrendering.\n                         (grabbing the axe)\n                   Turn!\n\n     JIMMY PIG gasps for air as SLADE takes over chopping again.\n\n     RED exits, worried.\n\n     INT.  THE MEETING ROOM\n\n     Huddled in a makeshift shelter of overturned furniture, with\n     NATHAN asleep on her lap, SANDRA is reciting to ELLEN, WILL,\n     TOMMY, JOHNNY, ANGIE, eight year old RAMON.\n\n                                   SANDRA\n                   \"-- sailed an a river of crystal\n                   light into a sea of dew.  Where are\n                   you going and what do you wish the\n                   old moon asked the three.  'We've\n                   come to fish for herring fish...'\"\n\n                                   TOMMY\n                   What's a \"moon?\"\n\n                                   JOHNNY\n                   I know what a moon is!  It's...\n\n                                   SANDRA\n                         (suddenly, urgently)\n                   SHHHHHHH!\n\n     SANDRA is reacting to vague movement in the shadows beyond the \n     door...and sounds.\n\n     She puts her hand over the mouth of a whimpering CHILD, hushes\n     another.\n\n     A timber falls outside the door and SANDRA sees a shadowy shape\n     enter the meeting room, looming in the darkness.\n\n     Frightened CHILDREN hold their breath, peer out fearfully.\n\n     CRACK!  SMASH!  The huge shape hurls aside the debris in his way, \n     switches on a flashlight, probes the darkness.\n\n     The light wipes the damaged room.\n\n     Suddenly, SANDRA gasps.\n\n                                   SANDRA\n                   Oh, my God!  It's... it's you!\n\n     TODD maneuvers the flashlight beam, sees the frightened CHILDREN.\n\n                                   SANDRA\n                   Are you...all right?\n\n                                   TODD\n                   We should go, sir.\n\n                                   SANDRA\n                   Go?\n\n     INT.  CORRIDOR\n\n     Peering into the smoke, RED reacts.\n\n     RED'S POV of CAINE 607, obscured by smoke, crossing the corridor \n     ahead, not seeing RED.\n\n     ANGLE ON RED, summoning all his courage, raising his rifle,\n     aiming.\n\n     BANG!\n\n     ANGLE ON CAINE 607 reacting, looking toward RED.\n\n     ANGLE ON RED scared to death, firing again!  And again!\n\n     ANGLE ON CAINE 607 wrenching a heavy door from its hinges and\n     holding it in front of him, shielding himself from RED's\n     continuous shooting, advancing.\n\n     ANGLE ON RED, firing again and again...and backing up.\n\n     ANGLE ON CAINE 607 holding the door/shield as he advances on RED.\n\n     Backing, RED trips, goes down flat on his back.\n\n     CAINE 607, only six feet away, hurls the door at him.\n\n     RED shoves the door aside, aims his gun up at CAINE 607, as the\n     huge soldier looms over him.\n\n     Before RED can pull the trigger, CAINE 607 snatches the rifle\n     barrel and yanks the weapon out of RED'S hands.\n\n     RED rolls, scrambles to his feet.\n\n     And CAINE 607 clubs him to the ground with the butt of the rifle, \n     crushes his skull with three brutal blows.\n\n     INT.  ROOM\n\n     TODD'S impassive face somehow reveals the alarm and awkwardness\n     he feels at what's happening to him.  TOMMY is seated on his \n     shoulders, he's got NATHAN in one arm and JOHNNY is nervously\n     looking up at him as he clutches at TODD'S huge free hand, and\n     now a little girl, SARAH, clutches at his combat pants as SANDRA \n     instructs her.\n\n                                   SANDRA\n                   Sarah, you hang on to Sergeant Todd.\n                   No matter what happens!\n\n     Clutching TODD's combat pants fiercely, SARAH looks up timidly at\n     the big stonefaced man as SANDRA turns to ELLEN.\n\n                                   SANDRA\n                   Ellen, go to the Commons.  Tell\n                   Jimmy Pig and Mr. Slade that\n                   Sergeant Todd says we have to leave\n                   as soon as they get everybody out of\n                   the root-cellar.  Can you do that?\n\n                                   ELLEN\n                         (scared)\n                   Uh, yes, ma'am.\n\n                                   SANDRA\n                   It's all right.  The soldiers are\n                   gone for now.  But be careful where\n                   you walk.  And if it's too smoky,\n                   just come back.\n\n                                   SARAH\n                         (on her way out)\n                   Yes, ma'am.\n\n                                   SANDRA\n                         (calling after her)\n                   Tell them to bring all the food and\n                   clothing they can carry.\n                         (turning to the\n                          children)\n                   Do you all understand that Sergeant\n                   Todd here is going to help us, and\n                   whatever he says to do you must do\n                   immediately, as if he was your\n                   father or your mother.\n\n                                   SARAH\n                         (tears)\n                   He's not my father!\n\n     ANGLE ON TODD'S stone face.  Unfamiliar territory.\n\n                                   SANDRA\n                   No... but he's our friend.  Our good\n                   friend.  Do you understand?\n\n     Frightened faces look to the awkward \"killing machine.\"\n\n     TODD looks like a statue decorated with CHILDREN.\n\n     JOHNNY is sobbing as he hangs onto TODD's giant hand obediently.\n                                   JOHNNY\n                   I want my father and my mother!  Can\n                   he find where my father is?  I want\n                   him to find my father!\n\n                                   SANDRA\n                   No.  No, he can't do that, but --\n\n     A SCREAM!  From the corridor!\n\n     SANDRA freezes.  TODD is alert, tense...and covered with\n     CHILDREN.\n\n     SANDRA turns and runs for the door as TODD starts to put the\n     CHILDREN down.  But he's awkward, slow, not his usual graceful\n     self, trying to be gentle like a clumsy man handling breakables.\n\n     INT.  CORRIDOR\n\n     Bursting into the corridor, SANDRA sees ELLEN racing toward her, \n     weaving through broken beams, SCREAMING as CAINE 607 lumbers\n     after her out of the shadows.  CAINE 607 doesn't bother to avoid \n     obstacles, shoving beams aside like twigs, dragging his bad leg.\n\n                                   SANDRA\n                   Sergeant Todd!\n\n     ELLEN dives into SANDRA's arms and SANDRA turns, only three steps\n     ahead of CAINE 607, and rushes into the meeting room.\n\n     INT.  MEETING ROOM\n\n     TODD is just putting NATHAN gently on the floor when he sees\n     CAINE 607 arrive in the doorway.  For halt a second their eyes\n     meet, then --\n\n     CAINE 607 advances on TODD.\n\n     Still encumbered by CHILDREN clutching at him, TODD sees his\n     weapons, but can't get to them.  Then it's too late!\n\n     The terrified CHILDREN watch as the giant CAINE 607 clubs TODD \n     mercilessly with the rifle butt, then hurls him backwards like a\n     rag doll.\n\n     Horrified, SANDRA sees TODD slam into a wall, slump to the floor.\n\n     Dismissing TODD, CAINE 607 turns, looms toward the CHILDREN.\n\n                                   SANDRA\n                   THEY'RE JUST CHILDREN!\n\n     CAINE 607 ignores her, heads for ELLEN, dragging his bad leg.\n\n     Spotting TODD'S weapons, SANDRA snatches a heavy rocket rifle,\n     brings it up awkwardly, points it, FIRES!\n\n     And the kick from the heavy gun sends SANDRA sprawling back, the\n     weapon trembling from her hands.\n\n     But the WHIZZING ROCKET, a near miss, gets CAINE 607's attention.\n     He turns away from ELLEN, toward SANDRA.\n\n     ANGLE ON TODD rising to his knees, blinking stupidly, trying to\n     focus as blood pours into his eyes from a gash in his forehead.\n\n     TODD'S POV, a vague, unfocused image of SANDRA, snatching a\n     bayonet from TODD'S gear on the floor and lunging courageously at \n     CAINE 607.\n\n     Vaguely, TODD sees CAINE 607 parry her thrust effortlessly and\n     grab her.  As she beats at CAINE 607 bravely with her fists, the\n     big man slams her into a wall brutally.  As she crumples, he hits\n     her again.\n\n     ANGLE ON TODD struggling to his feet, staggering as he shakes his\n     head to clear it.\n\n     His eyes go to SANDRA, slumped against the wall, bloody.\n\n     Terrified CHILDREN look up at CAINE 607 as he towers over them. \n     Suddenly...\n\n     SHTUNK!  A knife blade suddenly sticks in CAINE 607's neck.\n\n     CAINE 607 only flinches... and, as he YANKS the knife from his\n     neck by the handle, he turns to see who threw the blade...\n\n     WHAM!  TODD slams into him, tackling him, driving his big\n     shoulder deep into the new soldier's waist, slamming the big man\n     hard into a wall.\n\n     Air goes out of CAINE 607, the knife drops from his hand.\n\n     But that's it for TODD's victory.  Six-five, two-sixty, CAINE 607\n     is bigger and stronger than TODD.  His powerful arms rip TODD off\n     him like he's taking off a Band-Aid.\n\n     Terrified, wide-eyed CHILDREN watch TODD hurled back across the\n     room.\n\n     TODD scrambles to his feet, shakes his head clear.\n\n     Here comes CAINE 607, dragging his bad leg.\n\n     TODD attacks!  Combining a martial arts feint and lunge with a\n     vicious kick!\n\n     But 607 counters expertly, brushing aside the attack!\n\n     TODD lunges again employing yet another skilled move.\n\n     SMACK!  CAINE 607 outmaneuvers TODD again, punishing him\n     brutally.\n\n     WHACK!  WHAM!  SMASH!  CRUNCH!  This time TODD jolts the bigger\n     man with a terrible combination of moves, smashing him in the\n     Adam's apple, kicking him in the knee, driving an elbow into the\n     jaw.\n\n     This time it's CAINE 607 who has to back away to recover.  And\n     now he seems to re-consider TODD, revealing for the first time a \n     genuine respect.\n\n     As their eyes meet, CAINE 607 seems to be saying \"All right then,\n     you're serious, let's do it, fella.\"\n\n     TODD lunges.\n\n     SMASH!  CAINE 607 creams him.\n\n     TODD twists, slams CAINE 607 back.\n\n     BASH!  A fist to the face!\n\n     UMMMMMPH!  A knee in a groin!\n\n     SLAM!  A head against a wall!\n\n                                                       CUT TO:\n\n     VIDEO SCREEN/COCKPIT/\"DADDY\" - NIGHT\n\n     His face tanned from his Caribbean vacation, his image blurred\n     and distorted by transmission, MEKUM'S VIDEO IMAGE stares \n     incredulously from the snowy video monitor in the cockpit.\n\n                                   MEKUM/VIDEO SCREEN\n                   You can't be serious!  This is some\n                   kind of a joke...in poor taste.\n\n     As SLOAN and RUBRICK look on uneasily, an indignant CHURCH\n     addresses the image on the screen.\n\n                                   CHURCH\n                   Not only are we apparently out\n                   twenty of your fancy new soldiers,\n                   your supermen, we're out both\n                   crawlers and all the weapons...so we\n                   can't arm the old soldiers, the ones\n                   you \"improved\" on, to defend\n                   ourselves...\n\n                                   SLOAN\n                         (panicky, blurting at\n                          the screen)\n                   We've got to get out of here,\n                   Colonel Mekum!\n\n     CHURCH flashes a scowl at SLOAN as, on the screen, MEKUM erupts\n     excitedly.\n\n                                   MEKUM/VIDEO IMAGE\n                   Abort?  You want to lose twenty top\n                   soldiers to a phantom army and then\n                   abort the mission?  Do you know what\n                   that would look like on my record?\n                   Or yours?  We'd be explaining it for\n                   the next fifty years from some\n                   goddam assignment in God knows\n                   where, we'd --\n\n                                   CHURCH\n                         (interrupting sharply)\n                   Well, how's it gonna look when we\n                   lose the ship too?  How's that gonna\n                   look on the old record?  'Cause\n                   that's what's gonna happen if we\n                   don't get our ass outta here.  We\n                   can't defend ourselves with no\n                   weapons and --\n\n                                   MEKUM/VIDEO IMAGE\n                         (fighting his own panic)\n                   Hold on, hold on there, Captain!  At\n                   ease!  Let's calm down and\n                   remember...remember we're soldiers.\n\n                                   CHURCH\n                         (sarcastic)\n                   Good plan, Colonel.\n\n                                   MEKUM/VIDEO IMAGE\n                         (moving on, improvising)\n                   Now we can't just get the shit\n                   kicked out of us by an unknown\n                   guerilla army...  But maybe we\n                   could...alter...our objective...\n\n                                   CHURCH\n                   Meaning?\n\n                                   MEKUM/VIDEO IMAGE\n                   Nuke the joint...and get out!\n\n     Delighted with his own genius, MEKUM smiles triumphantly from the \n     video screen as RUBRICK, SLOAN, and CHURCH exchange stunned looks\n     and we...\n\n                                                       CUT TO:\n\n     INT.  MEETING ROOM - NIGHT\n\n     WHUMP!  TODD's bloodied head is slammed on the floor.  His eyes\n     are almost swollen shut as he looks up at CAINE 607 kneeling on\n     top of him.  Both men are bloody and exhausted their breath\n     coming in gasps, but it's CAINE 607 who's on top, beating the\n     last bit of resistance out of TODD who struggles desperately one\n     more time...before he slumps unconscious.\n\n     Horrified, NATHAN sees CAINE 607 smash the unconscious TODD with\n     the last of his strength, \"finishing him off.\"  NATHAN can't\n     stand it.\n\n     He toddles toward CAINE 607, who's still on all fours, and\n     attacks, his tiny fists raining blows on the amazed monster's\n     bloody face.\n\n     The frightened CHILDREN see CAINE 607 ignore NATHAN's ineffectual\n     blows and struggle with enormous effort to his feet.\n\n     Once standing, he looks down at NATHAN beating at his knees.  For\n     a moment he's confused.  What's this?\n\n     Then he sees the frightened CHILDREN and orients himself.  When\n     he looks down at NATHAN again, tiny NATHAN is an enemy as good as \n     dead.  One blow and...\n\n     But just then big hands close around CAINE 607's ankles, tackling\n     him.  As the giant topples, TODD lets go of the ankles and crawls\n     on top of the fallen man.\n\n     As CAINE 607 looks up into TODD's fierce face, the fight goes out\n     of his eyes.  He knows he's beaten, he knows TODD will never\n     quit.  He's helpless as TODD grips him in a terrible hold and as\n     TODD puts the pressure on, CAINE 607 whispers...\n\n                                   CAINE 607\n                   It hurts!\n\n                                   TODD\n                         (sympathetic)\n                   I know.\n\n     SNAP!  TODD breaks CAINE 607's neck and watches the life go out\n     of him.\n\n     In the sudden silence as TODD, panting, stares at his defeated\n     enemy, he hears a VOICE...her VOICE...very weak...\n\n                                   SANDRA\n                   Sergeant...\n\n     TODD turns and sees SANDRA slumped against the wall where Caine\n     607 threw her.  There's a trickle of blood coming from a nostril,\n     more blood in her hair.  Her eyes don't look right.\n\n                                   SANDRA\n                   Nathan!\n\n     TODD sees NATHAN looking at his mother with fear in his eyes. \n     Struggling to his feet, TODD picks up NATHAN and puts the boy\n     down close to his mother.\n\n     SANDRA reaches out and takes NATHAN's hand.  She holds NATHAN's\n     hand toward TODD.\n\n     TODD looks confused.\n\n     There are tears in SANDRA's eyes as she pushes NATHAN's little\n     hand into TODD's huge left paw.\n\n     TODD looks down at the joined hands, then he looks into SANDRA's \n     flooded eyes.\n\n     Does TODD understand her gesture?  His face is impassive.  Maybe\n     he doesn't.  Just then a hand touches his shoulder.\n\n     TODD turns to see JOHNNY face him, trembling but valiant, to ask\n     the question the others are fearful of asking.\n\n                                   JOHNNY\n                    S-sir...sir, are you our friend?\n                         (indicating Sandra)\n                    Sh-she said you were our friend.\n\n     TODD sees all the CHILDREN looking at him, their eyes big with\n     hope and fear as we...\n\n                                                       CUT TO:\n\n     INT.  DINING COMMONS\n\n     Blackened with soot, JIMMY PIG still has the axe in his hand as\n     SLADE manages, with a supreme effort, to hold the door of the\n     root cellar up enough to allow EMMA and JUDITH to push the FOUR\n     CHILDREN out of the cellar and then to scramble after them.\n\n     Exhausted, SLADE lets the door fall back, picks up his rifle and\n     turns toward the exit.  And freezes.  Dumbfounded.\n\n     Standing in the doorway is TODD, laden with CHILDREN, on his\n     shoulders, in his arms, surrounding him, clutching at his\n     garments.\n\n                                   SLADE\n                    You!\n\n                                   JIMMY PIG\n                    Thank God!\n\n                                                       CUT TO:\n\n     INT.  CORRIDOR/\"DADDY\" - NIGHT\n\n     CRUDE LETTERS scrawled on the metal skin of the bomb say \"LOVE\n     FROM DADDY.\"\n\n     The heavy bomb is lugged along a long narrow corridor.\n\n                                   SLOAN (O.S.)\n                    Well, Riley, you wanted a weapon,\n                    right?  Now you got one!  A real\n                    biggee!\n\n     We see that RILEY and three other VETERANS -- GREEN, CHESLEY, and \n     MOORE -- are struggling to maneuver the heavy bomb along the\n     narrow corridor and down a ladder hatch as SLOAN follows on\n     their heels and CHURCH and RUBRICK, fretting, follow her.\n\n                                   RUBRICK\n                    What good'll it do just setting it\n                    outside?  We don't know where the\n                    enemy is.\n\n                                   CHURCH\n                    Doesn't matter.  For once Mekum's on\n                    the ball.\n                    This is a very dirty bomb!  That\n                    wind will churn the radioactivity\n                    around like soap in a washing\n                    machine.  This is gonna be one clean\n                    place in a very short time...\n\n                                                       CUT TO:\n\n     INT.  BOWELS OF THE SHIP - NIGHT\n\n     THE TIMER on the bomb CLICKS into action, ticking off seconds and \n     blurring off the tenths.\n\n     ANGLE ON SLOAN, punching a code into the device as she addresses\n     the four VETERANS.\n\n                                   SLOAN\n                    Okay, fellas, take it about a\n                    hundred yards, then get back on the\n                    double...unless you wanna fry.\n\n     RILEY, his face impassive, opens a hatch, revealing the darkness\n     outside where the wind SCREAMS.\n\n     As RUBRICK and CHURCH watch, the four VETS stagger into the\n     darkness with the bomb, RUBRICK has to shout to CHURCH to be\n     heard over the wind outside.\n\n                                   RUBRICK\n                    THIRTY MINUTES IS AWFUL TIGHT!  WE\n                    HAVE TO LAUNCH AND GET CLEAR OF THE\n                    ATMOSPHERE.\n\n                                   CHURCH\n                    IT'S ENOUGH.  IF WE LEAVE MORE THAN\n                    ENOUGH, THE ENEMY MAY GET CLEAR\n                    SOMEHOW AS WELL.\n\n     As SLOAN shuts the hatch, she checks her watch.\n\n     EXT.  SPACESHIP/\"DADDY\"\n\n     Carrying the heavy bomb in a sling, RILEY, CHESLEY, MOORE, and\n     GREEN stagger past the work-lights into the darkness while the\n     wind rages around them.  Holding the sling one-handed, GREEN is \n     illuminating the ground ahead with a flashlight.\n\n     INT.  COCKPIT/\"DADDY\"\n\n     Flick!  Flick!  Flick!  Flick!  SLOAN is flicking switches as\n     RUBRICK reads off a check list and she responds to each item on\n     the list with \"Roger.\"\n\n     CHURCH is punching buttons on the control console, causing lights\n     to light up reading \"Port Power Cluster,\" \"Starboard Power\n     Cluster,\" \"Vertical Stabilizer Unit,\" and so on.\n\n     EXT.  TERRAIN\n\n     Darkness!  Buffeted by the wind, RILEY and his COMPANIONS lower\n     the bomb to the ground and release it gently.  They're just\n     turning to go back, fighting the wind, when RILEY senses\n     something.  He takes the light from GREEN and points it.\n\n     The four VETERANS axe astonished at what they see.\n\n     CRAWLER ONE, battered and motionless, is abandoned only ten yards \n     away.\n\n     The flashlight beam probes the blown out windshield, the scarred \n     chassis, pans across the back seat...and pans back urgently,\n     glimpsing tiny EYES.\n\n     The EYES disappear behind the back seat.\n\n     RILEY, CHESLEY, GREEN and MOORE exchange glances.\n\n     The light probes again, this time revealing the frightened faces\n     of CHILDREN cowering in the back seat, hiding from the wind.\n\n     Suddenly RILEY whirls.\n\n     Out of the darkness beside him, TODD looms.\n\n     RILEY looks into the face of a man he saw killed!\n\n     TODD has a CHILD in each arm and another hanging on to his leg\n     for dear life.  He's wearing the scarf Jimmy Pig gave him.\n\n     In the shadows behind TODD, JIMMY PIG, SLADE, EMMA, JUDITH and\n     more CHILDREN are watching anxiously.\n\n     RILEY's stone face comes as close to expression as it ever\n     will...astonishment!\n\n     The other VETERANS stare too, amazed.\n\n     Suddenly RILEY gives TODD a smart military salute.\n\n     ANGLE ON JIMMY PIG and SLADE exchanging a look of wonder.  What's \n     going on here?  They haven't a clue!  And we...\n\n                                                       CUT TO:\n\n     INT.  COCKPIT/\"DADDY\" - NIGHT\n\n     The countdown clock is TICKING away, showing ten minutes, as\n     CHURCH, RUBRICK, and SLOAN complete their pre-launch prep.\n                                   CHURCH\n                    Right horizontal?\n\n                                   RUBRICK\n                    Roger.  Right horizontal checks\n                    green.\n\n     CHURCH relaxes, looks up at the clock, satisfied.\n\n                                   CHURCH\n                    All right we're \"go.\"  I'm allowing\n                    us three minutes to clear the\n                    atmosphere and get out of range.\n                    That means we can wait seven more\n                    minutes.\n\n                                   SLOAN\n                    Fuck 'em!  Let's just go!\n\n                                   RUBRICK\n                    She's right!  Four more casualties\n                    aren't gonna mean anything to\n                    anybody, especially when they're\n                    already obsolete.\n\n     CHURCH considers for a moment, then shrugs.\n\n                                   CHURCH\n                    I guess they wouldn't want to get\n                    old anyway.\n                         (to Sloan)\n                    Go ahead, lock the hatch.\n                         (to Rubrick)\n                    Rube, punch up the port power\n                    cluster and --\n\n                                   SLOAN\n                         (interrupting urgently)\n                    What was that?\n\n                                   CHURCH\n                    Huh?  What was what?\n\n                                   SLOAN\n                    Sssshhhh!  Listen!\n\n     SLOAN is listening intensely.\n\n     All they hear is the HUM of the air system and miscellaneous\n     WHITE NOISE.\n\n     CHURCH and RUBRICK exchange a glance and are about to speak when\n     they all hear it...\n\n     A sound like a CHILD CRYING somewhere in the ship!\n\n     All three of them stare at each other in utter amazement.\n                                   RUBRICK\n                    It sounds...\n\n                                   SLOAN\n                    Like a kid!\n\n     Just then they hear it again, closer.\n\n     CHURCH frowns.  What the fuck?\n\n                                                       CUT TO:\n\n     INT.  BUNKS/\"DADDY\" - NIGHT - MOMENTS LATER\n\n     EMMA, JUDITH, SLADE and JIMMY PIG are settling most of the\n     CHILDREN in the cramped crew quarters, pulling off hats and\n     coats, when a COMMOTION causes them to look toward the open door\n     to the corridor in time to see...\n\n     a glimpse of RUBRICK being shoved roughly along the corridor by\n     MOORE, his loud protests clearly audible.\n\n                                   RUBRICK\n                    Are you crazy?  You can't do this,\n                    soldier!  You're going to be in\n                    trouble.\n\n     Then, as RUBRICK is pushed out of view, CHURCH appears, indignant\n     and panicky, as CHESLEY hustles him past.\n\n                                   CHURCH\n                    I'm your superior officer, don't you\n                    understand that?\n\n     ANGLE ON THE PIONEERS, exchanging glances.\n\n     INT.  CORRIDOR/\"DADDY\"\n\n     As CHESLEY shoves him along, CHURCH continues to protest...\n\n                                   CHURCH\n                    Don't you realize you're violating\n                    the chain of command?  I'm giving\n                    you a direct order to...to...to...\n\n     CHURCH breaks off, suddenly speechless at the sight ahead of him.\n\n     Here comes TODD, laden with more CHILDREN, the tattoo on his\n     cheek clearly visible.  His eyes meet CHURCH'S.\n\n                                   CHURCH\n                    S-sergeant?  S-sergeant T-todd?\n                    It...  You...!  How...?  How...?\n\n     Weak at the knees, CHURCH is still stammering as CHESLEY shoves\n     him ahead.\n\n     And then SLOAN, in the grip of GREEN, is hustled by.  She looks\n     wide-eyed at TODD and the CHILDREN.\n\n                                   SLOAN\n                    Sergeant Todd!\n\n                                                       CUT TO:\n\n     INT.  BOWELS OF THE SHIP - NIGHT - SECONDS LATER\n\n     RUBRICK, CHURCH, and SLOAN are still protesting as the VETERANS\n     hustle them down the ladder toward the main hatch.\n\n                                   RUBRICK\n                    Listen, you don't understand!  That\n                    bomb is triggered!  It's on a timer!\n\n                                   CHURCH\n                    We have to get out of here!  All of\n                    us!  You need us!  You need us to\n                    operate the ship...\n\n                                   SLOAN\n                    YOU'RE FUCKING MORONS!  CAN'T YOU\n                    DIMWITS GRASP THAT YOU'RE KILLING US\n                    ALL!  YOU'RE KILLING YOURSELVES!\n                    THERE'S ONLY A FEW MINUTES LEFT!\n\n                                   RUBRICK\n                    NO!  NO!  NO!\n\n     RUBRICK is shoved out the door into the night!\n\n     EXT.  SPACESHIP/\"DADDY\" - NIGHT\n\n     RUBRICK desperately clutches at the hatch entrance as the savage\n     wind tears at him...but he can't hold on.\n\n     As SLOAN and CHURCH are shoved out the hatch, they see RUBRICK\n     blown off into the night, screaming.\n\n                                   CHURCH\n                    DOWN!  LIE DOWN!  FLAT!\n\n     And CHURCH dives for the ground as the wind tumbles him.\n\n     SLOAN does the same thing as the hatch door slams behind them, \n     shutting them out of the ship..\n\n                                   SLOAN\n                    NO!  NO!  NO!  PLEASE!  NO!\n\n     INT.  COCKPIT/\"DADDY\" - NIGHT\n\n     The countdown clock shows four minutes and twenty seconds as it\n     CLICKS off the seconds.\n\n     Their soldier faces inscrutable, TODD and RUBRICK consider the\n     various lights winking on the control panel.\n\n     RILEY points to a row of switches and looks at TODD.  Their eyes\n     meet.  TODD considers the switches, then nods.\n\n     RILEY throws the switches.  A row of red lights goes on and the\n     ship seems to hum with life.\n\n     Still communicating wordlessly, TODD points to another switch,\n     RILEY throws it!\n\n     EXT.  SPACESHIP/\"DADDY\"\n\n     BLAST OFF!  Big engines belch fire, illuminating the bleak\n     landscape as the ship rises into the night.\n\n     Brightly lit by the ignition, SLOAN, still on her belly, sees the\n     ship taking off.\n\n                                   SLOAN\n                    OH, MY GOD!  OH, MY GOD!\n\n                                   CHURCH\n                    THERE IT IS!  I SEE IT!\n\n     The bomb is clearly visible ten yards away in the dying glow of\n     the takeoff.\n\n     CHURCH bumps madly along the ground on his belly.\n\n     EXT.  SPACESHIP/\"DADDY\"\n\n     The NAF ship \"Daddy\" climbs off into space, getting smaller and\n     smaller, the light from the takeoff diminishing.\n     EXT.  THE BOMB/TERRAIN\n\n     The countdown timer on the bomb is faintly visible in the dying\n     light.  It reads twenty seconds.\n\n                                   CHURCH (V.O.)\n                    Twenty seconds.  Hurry.\n\n     CHURCH and SLOAN are hunched desperately over the bomb in near\n     darkness, the wind tearing at them.  SLOAN tries to punch a code\n     into the keys...\n\n                                   SLOAN\n                    Oh, my God, I can't remember if it's\n                    six-seven or seven-six...\n\n                                   CHURCH\n                    Try one! Try it!\n\n     SLOAN punches the keyboard blindly.\n\n                                   SLOAN\n                    There!  I did it!  Did it stop?  Did\n                    it -- ?\n\n     BAHWHOOOOOOOOOOOOOOOOM!  Everything is dazzling, blinding light!\n\n     INT.  COCKPIT/\"DADDY\"\n\n     White light from the blast briefly floods the cockpit as TODD and \n     RILEY stare at the video monitor where MEKUM'S VIDEO IMAGE is\n     babbling frantically.\n\n                                   MEKUM/VIDEO IMAGE\n                    ...I need a report, Captain.  It's\n                    not just my ass, it's yours too!\n                    You've got to stand by me on this.\n                    I want you to come in right now...\n                    right now!  Do you understand me?\n                    Right now!\n\n     RILEY turns to TODD, looking a question at him.  TODD meets his\n     look and no words are necessary.\n\n     RILEY reaches for the control switch as MEKUM continues babbling.\n\n                                   MEKUM/VIDEO IMAGE\n                    This is important for all of us, for\n                    our careers.  There's going to be a\n                    Board of Inquiry and --\n\n     MEKUM'S IMAGE cuts out mid-babble.\n\n                                   SLADE'S VOICE (O.S.)\n                    That was the boss, huh?\n\n     TODD and RILEY turn to see SLADE in the entrance to the cockpit \n     addressing TODD and the VETERANS collectively.\n\n                                   SLADE\n                    Well then, I guess you fellas are\n                    all right.  I guess I misjudged you\n                    some.  Where I said you were \"a\n                    buncha no good killer robots,\" I\n                    mighta just overspoke myself.  As of\n                    now, till it goes otherwise, you got\n                    my sincere approval and support.\n\n     With that, SLADE turns and exits.\n\n     TODD looks at RILEY, RILEY looks at TODD.  What the fuck was\n     that?\n\n     INT.  CORRIDOR/\"DADDY\" - NIGHT\n\n     NATHAN wobbles along an empty corridor, stumbles, catches himself\n     on a wall, keeps going.\n\n     He passes a doorway, peers in, sees two SOLDIERS working at a\n     console like robots.  They don't look up.\n\n     NATHAN keeps going, toddling toward a hatchway.\n\n     INT.  COCKPIT/\"DADDY\"\n\n     Entering, NATHAN moves among the legs of big men, VETERANS.\n     NATHAN keeps going.\n\n     Then, backing against a wall, he looks up and VETERANS loom past\n     him with blank faces.  He is alone again.\n\n     NATHAN totters onward.\n\n     CLOSE ANGLE ON CHARTS, the same ones Church had on Christmas Eve, \n     showing tiny dots in a vast sea of space.\n\n     TODD and RILEY are poring over them, their eyes considering dot\n     after dot.  Finally, TODD points to a dot and looks a question at \n     RILEY.\n\n     RILEY considers the dot for a long moment...then he looks TODD in\n     the eye.\n\n                                   RILEY\n                    Cold.\n\n     TODD looks back at the dot, considers it, looks back at RILEY.\n\n                                   TODD\n                    Air?\n\n     RILEY nods a yes.\n\n     TODD is thoughtful...finally asks the next question.\n\n                                   TODD\n                    Safe?\n\n                                   RILEY\n                         (nodding yes)\n                    But very cold.\n\n     TODD considers the dot on the map again, then looks at RILEY.\n\n                                   TODD\n                    That one.\n\n                                   RILEY\n                    Aye, aye, sir.\n\n     RILEY turns toward a console, but something makes him look down\n     toward his feat.  Then he looks back at TODD.\n\n     TODD follows the look.\n\n     Tiny NATHAN is looking up at TODD who's towering over him.\n\n     TODD looks down without expression, the scarf from Jimmy Pig\n     still wrapped around his neck.\n\n     NATHAN puts his arms out to be picked up.\n\n     TODD considers the outstretched arms.\n\n     RILEY looks from TODD to NATHAN and back to TODD.  What's this?\n\n     TODD hesitates a half second more, then leans down and picks\n     NATHAN up in his arms, lifting the boy to his chest.\n\n     RILEY looks on.  Never seen anything like it.\n\n     NATHAN is close to TODD's face, looking right into it, trying a\n     little smile, a nervous one, looking for a response.\n\n     TODD hesitates, takes a breath, moves the muscles of his face.\n\n     All he can produce is an awkward grimace, the distortion of a\n     smile, almost comical.\n\n     NATHAN reads the intention successfully.  His face collapses into\n     a huge friendly grin.\n\n     TODD tries again, making a clumsy sort of rubbery wince.\n\n     RILEY watches.  Totally amazed.\n\n     TODD turns, takes NATHAN to a porthole, puts his face up to it.\n\n     NATHAN stares out at the darkness punctuated by a billion stars,\n     a sky full of hope.\n\n     As NATHAN looks out, TODD works his face again, trying for a\n     smile the way a weak man might try to lift a heavy weight.\n\n     NATHAN looks at the stars outside, TODD looks with him and\n     suddenly TODD's face relaxes into an awkward grin, almost by\n     accident.\n\n     RILEY watches the two of them for a moment, confounded by what\n     he's seeing.  Then he turns to the console and...\n\n                      THE CLOSING CREDITS ROLL.\n\n                               THE END\n\n\n\n\n\n\nSoldier\nWriters :   David Webb Peoples\nGenres :   Action  Drama  Sci-Fi\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:36:01.851485"}