{"title": "Something's Gotta Give", "film_link": "/Movie Scripts/Something's Gotta Give Script.html", "script_link": "/scripts/Something's-Gotta-Give.html", "info_raw": "\n\nSomething's Gotta Give Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Nancy Meyers\nGenres  Comedy  Romance  Drama\nScript Date : June 2002\nMovie Release Date : December 2003\n\nRead \"Something's Gotta Give\" Script\n\n\n", "script": "\n\n    \n\n\n\n\n\n             SOMETHING'S GOTTA GIVE\n\n\n\n\n\n\n\n\n\n\n                 Nancy Meyers\n                June 14, 2002\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                            1.\n\n\n\n\n\n\n\n\nOVER BLACK\n\nWe hear, Ja Rule's \"Livin' It Up\"...\n\n\n\n\n\n\n\nEXT. NEW YORK CITY - A HOT AUGUST NIGHT - MUSIC OVER\n\nMIDTOWN. A Brunette Beauty crosses in front of a stack of\ncabs, her sheer dress clinging to her remarkable body.\nA Club in THE MEATPACKING DISTRICT. A long line waits to get\nin. A couple of Gorgeous Girls show up at the velvet rope and\nare promptly\" let inside.\nSOHO. A Crowd spills out of a Bar and onto the sidewalk. A\nConfident Knock Out in jeans and a tank top laughs, drinking\na beer out of the bottle.\n\n                       HARRY (V.O.)\n\n             Ahhhh... The sweet, uncomplicated\n             satisfaction of The Younger Woman. That\n             fleeting age when everything just falls\n             right into place. It's magic time and it\n             can render any man, anywhere --\n             absolutely helpless. Some say I'm an\n             expert on The Younger Woman. Guess that's\n             'cause I've been dating them for over\n             forty years...\n\n\n\n\n\n\n\nINTO AN EMPTY FRAME COMES HARRY LANGER\n\nWhat is it about him? Could be his eyes, the turn of his\nmouth...something about this guy is just so damn appealing.\nMaybe it's just the way he wears the Young Slinky Girl on his\narm. He's confident, cool, enviable. We're in:\n\n\n\n\n\n\n\nA CHIC EATERY - DOWNTOWN\n\nThe place is full. Everybody is somebody here.\n\n                        HARRY\n\n                 (to Hostess)\n             Langer. ..\nThe Maitre'd snaps to attention at the sight of him.\n\n                       MAITRE'D\n\n             Mr. Langer, got your table waiting.\nAs Harry and his Girl wend their way around tables, we pass Other\nCouples. Young Couples. Middle-aged couples. Not talking Couples.\n\n                       HARRY (V.O.)\n\n             So what does a life of bucking the system\n             all add up to?\n\n\n\n\n                                                         2.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY (V.O.) (CONT'D)\n\n          To never settle down with the right woman\n          for a life of leftovers and Christmas\n          mornings. No his and her IRA accounts, no\n          mini van parked in the garage. I think\n          it's made me what I am today.\n              (Harry smiles to someone\n               across the room)\n          The luckiest son of a bitch on earth.\n          Look at me. I'm positively debonair. I\n          should be illegal I'm lookin' so good.\nHarry passes a table where a BEATEN SIXTY YEAR OLD dines with\nhis AGE APPROPRIATE, WELL-FED WIFE. IN SLOW MOTION, Harry and\nThe Beaten Man catch each other's glance.\n\n                    HARRY (V.O.)\n\n          It isn't as if I haven't wondered what my\n          life would be like if I was a Regular Joe\n          and came in here once a month with a dame\n          my age' for a porterhouse and a side of\nI         spinach. I've wondered...\n\n\n\n\n\n\n\n NT. CHIC EATERY - HARRY'S IMAGINATION\n\nHarry ENTERS all over again. This time he looks older,\nsomething in his walk and the boxy cut of his jacket. With\nhim is a regular looking, nothing-to-write-home-about WOMAN\n\nIN HER FIFTIES.\n\n\n                    HARRY (V.O.)\n\n          No, come on, let's be honest. ..a dame\n          really my age. . .\n\n\n\n\n\n\n\nINT. CHIC EATERY - HARRY'S IMAGINATION - TAKE TWO\n\nAgain, the identical set up. Harry ENTERS again. This time he\nlooks ten years older. The bounce to his step is gone. The\ntwinkle in his eye, long dead. On his arm is a 63 YEAR OLD\nBATTLE AX, built just like Harry. The Maitre'd reluctantly\nshows them to a shitty table.\n\n                    HARRY (V.O.)\n\n          There you have it. The story in a\n          nutshell. Not exactly debonair, am I?\n              (Harry TRIPS, his wife\n               looks disgusted)\n          Awww, man, it's down right sad. Look at\n          me. I look like I'm about to die. God\n          help me. I do not want to die.\n\n                                            SMASH CUT TO:\n\n\n\n\n\n                                                         3.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA LONG STRETCH OF PRISTINE COUNTRY ROAD - THE HAMPTONS - DAY\n\nA Silver Mercedes convertible bursts into FRAME. Harry's\nbehind the wheel, shades, smoking a cigar, livin' large. Next\nto him sits a thoroughbred of a girl. An \"IT\" Girl. Smart,\nsexy and built for fun. She has perfected flirting to an art.\nHer hand rests on Harry's neck. There's a good thirty year\nage difference between them. Her name is MARIN. She SINGS\nalong with Ja Rule, now coming from a CD.\n\n                    MARIN\n\n              ( singing)\n          To all my thugs that be livin' it\n          up, we say, what I do. To all my...\n              (stops)\n          Oh! This is it. Make a right.\n\n                    HARRY\n\n              (admiring the\n               neighborhood)\n          So baby, you're rich... .\n\n                    MARIN\n\n          Well, my mother is, sort of. Not\n          really...\n\n                    HARRY\n\n          If she lives within a mile of here, she's\n          rich.\n\n                    MARIN\n\n          I guess a hit play will buy you a house\n          in The Hamptons.\n\n                    HARRY\n\n          I'd like to meet your mother.\n\n                    MARIN\n\n          No you wouldn't. I mean, she's\n          great. She's totally brilliant, but\n          she's not your type.\n\n                    HARRY\n\n          You're overlooking one of the great\n          things about me. I don't have a type.\n\n                    MARIN\n\n              (very directly)\n          She's over thirty.\nHarry looks to Marin, feigning hurt.\n\n                    MARIN\n\n          Oh, what?! Like you don't know you\n          have a slight reputation for...\n\n\n\n\n                                                         4.\n\n\n\n\n\n\n\n\n\n\nJust then the CAR PHONE RINGS. Harry keeps looking at Marin.\n\n                    HARRY\n\n          -- For what?\nHarry waits. RINGGG!\nHe doesn't look away.\n\n                    MARIN\n\n          For never dating anyone over 30.\n          Don't look at me like that.\n\n                    HARRY\n\n          It's just not true.\n\n                    MARIN\n\n          Okay. Sorry. Over 31?\n\n                     HARRY\n\n          Oh, so you wait 'til we get out to The\n          Hamptons to let me know you're a wise\n          ass.\n               (answers phone)\n          Hold on. . .\n               (then to Marin)\n          It just so happens, my dear, that women\n          of a certain age, don't date me. You ever\n          think of it that way? No, it's always me.\n          You dames are all alike.\n               (then into phone)\n          Hey...\n\n                    MARIN\n\n              (amused, to herself)\n          Dames...\nMarin continues singing along with Ja Rule as Harry\nconfidently slips his hand onto her thigh.\n\n                    BARRY\n\n              (into phone)\n          Vh-huh.. .I'll call back Monday. Who\n          else? Monday... Monday... Say you couldn't\n          find me. Who?\n              (glances at Marin, she's\n               not listening)\n          I'll call her later. No, I have it.\nHarry hangs up, doesn't look in Marin's direction to see if'\nshe caught that. This brand of cool is about not playing that\ncard. Marin turns toward him, she has been listening. They've\nreached the end of the road, sand dunes, long lilting grass\nand the ocean stretch before them.\n\n\n\n\n                                                          5.\n\n\n\n\n\n\n\n\n\n\n\n                    MARIN\n\n              (all business)\n          Make a right, left at the second\n          fence.\nMarin turns up the CD, getting herself out of whatever just\ncame over her, looks out the window.\n\n                    HARRY\n\n          Have I mentioned how gorgeous your\n          breasts look in this sweater?\n\n                    MARIN\n\n              (blushing)\n          Yes you have actually.\n\n                     HARRY\n\n          So it would be too much to mention it\n          again. . .\nMarin laughs, softening, as Harry turns down a dirt driveway,\ndriving toward a DREAM BEACH HOUSE.\n\n                    HARRY\n\n          Wow. It's the perfect beach house.\n\n                    MARIN\n\n          I know. My mother doesn't know how\n          to do things that aren't perfect.\n\n                    HARRY\n\n          Which explains you.\nThat got her. Harry parks. She looks over at him but he's\ngrabbing some cigars for his shirt pocket, then looks up at\nher with an innocent look that suggests he did not just say\nsuch a lovely thought.\n\n                    MARIN\n\n              (trying to keep up with\n               him)\n          Yeah, okay, right...\nThey both grab their H\n                     overnight bags and step out of the car.\n\n                     ARRY\n\n          So, what are we gonna do out here,\n          just the two of us, for two whole\n          days?\nMarin sets her bag down, walks to Harry, wraps her arms\naround his neck.\n\n                    MARIN\n\n          Tell me the truth, are you at all\n          glad we waited?\n\n\n\n\n                                                            6.\n\n\n\n\n\n\n\n\n\n\n\n                       HARRY\n\n             I'm incredibly glad we're finally\n             going to do it.\n                 (she's a bit disappointed)\n             If that's the same as being glad we\n             waited, then baby doll, I'm ecstatic.\nMarin smiles then kisses him. He's one of those guys that\nlets you kiss them.\n\n                       HARRY\n\n                 (slaps her tush)\n             Let's go for a swim, how long will\n             it take you to change?\n\n                       MARIN\n\n             Two minutes.\nMarin starts UNBUTTONING HER SWEATER as she dances\nseductively toward the front door, then notices Harry's\ncigars.\n\n                         MARIN\n\n             Oh Har... No smoking in the house. My\n             Mom doesn't allow it.\n\n                       HARRY\n\n             But she allows you to strip in the\n             front yard and bring men you're\n             dating here to...\n\n                       MARIN\n\n             She doesn't know everything I do...Or\n             when I do it.. or where I do it.\nShe SLIPS OFF her sweater and DROPS IT ON HARRY'S HEAD.\n\n\n\n\n\n\n\nINT. HOUSE\n\nIt's one of those great Beach Houses. Light filled and warm\nwith spectacular views of the sandy landscape wrapping around\nthe rear of the house. Marin, now in a tight tank, tight\npants, gives Harry the grand tour as she continues to\nundress.\n\n                       MARIN\n\n                 (TAKING OFF her belt)\n             The fabulous living room, perfect for\n             entertaining an intimate group of friends\n             or that special someone.\n                 (DROPS her belt then\n                  UNBUTTONS Harry's shirt)\n             Behind me, the requisite Hampton's deck\n             complete with pool and ocean view.\n\n\n\n\n                                                           7.\n\n\n\n\n\n\n\n\n\n\n\n                    MARIN (CONT'D)\n\n              (UNBUCKLES Harry's belt)\n          Your pants, please...\n\n                    HARRY\n\n          Ladies first.\nMarin provocatively UNZIPS her pants and wriggles out of\nthem. She's now in a TINY TANK AND BIKINI PANTIES.\n\n                    MARIN\n\n          Gourmet kitchen's to your left\n          where tonight I will whip you up a\n          culinary feast of Mac and Cheese.\nMarin HEARS Harry's ZIPPER UNZIP. She turns, her EYES\nWIDENING as Harry's PANTS land on a chair. Harry is now down\nto his Boxers, an Open Shirt and a fearless smile.\n\n                    MARIN\n\n              (smiling)\n          .. O-kay, going quickly now...\n          Master bedroom is that away...\nThey arrive in a warmly decorated GUEST BEDROOM.\n\n                     M\n\n\n                     ARIN\n\n          And this as they say on 'Cribs',\n          your favorite show, is where the\n          magic happens. Do we like it? Going\n          once, going twice ...\n\n                    HARRY\n\n          Sold.\nHarry takes Marin's hand and pulls her OUT OF FRAME and ONTO\nTHE BED. She playfully rolls on top of him. His hands cup her\nass.\n\n                    MARIN\n\n          You know when I first started\n          auctioneering someone told me if I was\n          nervous to just picture everyone in the\n          audience in their underwear. This sort of\n          gives that a whole new meaning.\n\n                    HARRY\n\n          Why? You're not nervous now, are you?\n\n                    MARIN\n\n          I'm always a little nervous.\n\n                    HARRY\n\n              (removing his hands)\n          So put on your bathing suit. I brought\n          some champagne, I'll put it on ice.\n\n\n\n\n                                                         8.\n\n\n\n\n\n\n\n\n\n\n\n                    MARIN\n\n          Me like you, Harry Langer.\nShe bounces off him like a kid and disappears into the\nbathroom.\nHarry lies there alone for a second. Catches his breath. He\nsits up, feet on the floor, shoulders hunched, clears his\nthroat, bangs on his chest. He waits a sec then stands with a\nstiffness that for the first time suggests he is not a that\nyoung man.\n\n\n\n\n\n\n\nINT. LIVING ROOM\n\nNow wearing only his Boxer Shorts, Harry crosses through the\nLiving ROOM, singing 'Livin' It Up' to himself. He reaches into\nhis bag and lifts out Two Bottles of Crystal. He sees himself in\nthe mirror, sucks in his gut.\n\n\n\n\n\n\n\nINT. KITCHEN\n\nWell stocked, the best of everything. Harry opens the door to the\nfridge and just as HE DISAPPEARS BEHIND IT, the BACK DOOR OPENS\nand TWO WOMEN ENTER from a beach walk, in the middle of a lively\nconversation.\nOne of them is ERICA, Marin's Mother. The other is Erica's\nYounger Sister, ZOE.\nERICA is in her mid-fifties and is a poster girl for growing old.\nIt's actually hard to imagine 55 looking any better. And not\nbecause she looks 35, but because she makes 55 look graceful and\nright. Erica is the \"girl most likely\" who went beyond\nexpectations but didn't realize until recently that being sure of\nherself was a handicap. She doesn't try to be intimidating, she\njust is.\nHer sister, ZOE is in her forties. Zoe's the loose one. She\nwears draw string pants and a T-shirt that says, \"BOYS LIE\".\nThe Women stop mid-sentence when they notice the REFRIGERATOR\nIS WIDE OPEN. Then they SEE A PAIR OF BARE MEN'S LEGS poking\n\n                     E\n\nout from UNDER THE DOOR. They don' t move.\n\n                     RICA\n\n          Oh God. What is this?\nErica nods to Zoe, gesturing a nearby knife. Zoe grabs the knife.\nHarry pokes his head out from behind the fridge, equally confused.\n\n                    ERICA\n\n              (in control)\n          Okay, stay right where you are. We have a\n          knife.\n\n\n\n\n                                                         9.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n              (eyeing the knife)\n          Do you... live here?\n\n                    ERICA\n\n          Okay, Mister, look, I'm gonna dial\n          911 and you're not gonna move. Zoe,\n          hand me the phone.\n              (reaches out to Zoe\n               without looking at her)\n\n                    HARRY\n\n          You don't understand. I'm a friend\n          of your daughter's.\nWith that, Harry SHUTS the fridge door. The Women see he's\nnaked except for a Pair of Boxers. They both GASP. Zoe\nFUMBLES the phone over to Erica who dials quickly..\n\n                    ERICA\n\n          Yeah? I don't think so. My daughter's in\n          the city and you what, wandered in\n          here,like high on Ecstasy..?.\n              (looks at phone)\n          Shit. I dialed 8-1-1.\n              (redials)\n\n                    HARRY\n\n              (calmly starts to move)\n          Honestly, if you just...\n\n                    ERICA\n\n          Back off. She was in the Israeli\n          army. She can break you in half.\nZoe can't believe she just said that -- no truth in it\nwhatsoever.\n\n                    ERICA\n\n              (into phone)\n          Yes. I have an intruder in my\n          house. 29 Daniels Lane, Sagaponack.\n\n                    HARRY\n\n          I'm dating your daughter Marin. She\n          invited me here for the weekend.\n          She's in her room right now,\n          changing.\n\n                     ERICA\n\n              (GASPS even louder, really\n                   scared now)\n          You're dating my daughter?\n\n\n\n\n                                                        10.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n              (amused)\n          Now who would've thought that would\n          be worse news?\nWith that, Marin ENTERS, in a tiny bikini, sees Harry in his\nshorts, Zoe holding the knife and Erica frozen, holding the\nphone.\n\n                      MARIN\n\n          Oh, fuck.\n\n                    ERICA\n\n          Oh, God.\n              (into phone)\n          I'm sorry. False alarm. Yeah, no, I'm\n          sure. No, he's not a burglar\n              (with enormous difficulty)\n          He's dating my daughter.\n\n                    MARIN\n\n          Mom, I had no idea you were coming out\n          this weekend, you said you had to write.\n\n                    ERICA\n\n          I do. I thought I'd do it out here.\n\n                    MARIN\n\n          Oh, man, this is really....\n\n                      ERICA\n\n          Awkward.\n\n                    MARIN\n\n          Totally.. .but....\n              (starts laughing)\n          You gotta admit, sorta funny You thought\n          he was a burglar? In his boxer shorts?\n\n                    ERICA\n\n          Yeah, well, the world's nuts, I\n          don't know the man. . .\n\n                    MARIN\n\n              (still laughing)\n          I'm sorry, it's not really funny.\n          I'm an idiot. I should've told you\n          I was bringing someone out.\n\n                    E\n\n\n                      RICA\n\n          No, no, I should've told you we\n          were coming. Well. Anyway, here we\n          are.\n               (waves to Harry)\n          Hello. I'm the mother.\n\n\n\n\n                                                        11.\n\n\n\n\n\n\n\n\n\n\nAll three Women turn to Harry who now dangles a long Lobster\nshaped oven mitt over his \"privates\"...\n\n                    HARRY\n\n          Harry Langer. How are ya?\n\n                     MARIN\n\n          Yes. Sorry... Mom, this is my friend,\n          Harry. Harry, my Mom, Erica... my Aunt,\n          Zoe.\n               (they all shake hands)\n          Harry's sort of a new friend. I think I\n          mentioned him in an e-mail. We just,\n          totally spur of the moment thought we'd\n          get out of the city for a few days.\n\n                    ERICA AND ZOE\n\n          Of course...Right...Great...\n\n                    ERICA\n\n              (can't look at him)\n          Honey, does Harry have a robe?\n\n                     HARRY\n\n              (backing out)\n          You know what? Actually, I think I should\n          just take off. Let you gals enjoy your\n          weekend...\nMarin shoots her Mom a look. Help!\n\n                    ERICA\n\n          No, no, no. Don't be silly. Uh, look,\n          here's what we'll do. Zoe and I will\n          leave. We took a great walk on the beach,\n          we'll go into town for lunch. You two\n          stay. Harry, apologize about the near\n          arrest.\n\n                      HARRY\n\n          No, you were impressive. Very strong,\n          very... \"macho\".\n\n                    ERICA\n\n              (a little thrown)\n          I don't think I was exactly \"macho\"\n\n          ...\n\n\n                    HARRY\n\n          Trust me, if I ever catch a guy in\n          his underwear in my refrigerator I\n          hope I'm half the man you were, Mrs\n          uh...\n\n\n\n\n                                                        12.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n              (already hating him)\n          Yeah. Okay. Whatever...\nMarin watches. Dying.\n\n                    HARRY\n\n          All righty then...I'm definitely gonna\n          hit the road.\n              (salutes Erica and Zoe)\n          Ladies...sensational meeting you.\n              (then to Marin)\n          Doll, call me.\n\n                    ZOE\n\n          Hold on. Hold on. Let's not get so\n          dramatic here. What are we four\n          teenagers? We're all sophisticated\n          people. Why can't we all stay, for the\n          weekend? Your mother's got work to do\n          I've got papers to grade. You'll do your\n          thing, whatever that is and if we want to\n          hang together, we'll hang together. If we\n          don't, we don't. There's no reason why\n          any of us should give up this spectacular\n          weekend.\n\n                    MARIN\n\n          Seriously. I can handle it.\n\n                    ZOE\n\n          I can totally handle it.\n\n                    ERICA\n\n              (on the spot)\n          I mean, well, I can \"handle\" it...\nThe Women all look to Harry. He looks at Marin. She's hard to\nresist.\n\n                    HARRY\n\n          It can only go up from here.\n\n                                                   CUT TO:\n\n\n\n\n\n\n\n\nHARRY AND MARIN\n\nWalking past SHOPS on the MAIN DRAG IN EAST HAMPTON. They are\nboth licking ice cream cones. CAMERA STAYS BEHIND THEM.\n\n                     Z\n\n\n                     OE (V.O.)\n\n          He's obviously a penis substitute.\n\n\n\n\n                                                        13.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nERICA AND ZOE\n\nAre paced 20 feet behind them, carrying groceries.\n\n                    ZOE\n\n          I mean a father substitute.\n\n                    ERICA\n\n          Except he's older than her father. I\n          can't even look at them. What is she\n          doing with a guy that age?\n\n                    ZOE\n\n          Marin was how old when you guys broke up?\n\n                    ERICA\n\n          Five years ago, so. ..twenty-three.\n\n                    ZOE\n\n          Okay, so she was old enough not to\n          feel Dave was walking out on her.\n\n                    ERICA\n\n          Is that supposed to mean Dave walked out\n          on me? Why do people assume when you\n          break up after twenty years that the\n          guy's the one who wanted out? Just\n          because once we broke up he shtupped\n          everything that moved...\n\n                    ZOE\n\n          Easy cowgirl. I didn't mean it that way.\n          Just trying to figure out why such a\n          smart girl is always with the wrong guy.\n\n\n\n\n\n\n\nCLOSE ON A YOUNG FRENCH GIRL IN AN APRON\n\n\n                    YOUNG FRENCH GIRL\n\n          Mme. Barry, que je puis vous obtenir\n          aujourd'hui?\nThe Girl stands BEHIND THE CHEESE COUNTER in:\n\n\n\n\n\n\n\nTHE BAREFOOT CONTESSA\n\nA Gourmet Market in East Hampton. The clientele in here is as\nrich looking as the food. Erica stands on the other side of\nthe Cheese Counter.\n\n                    ERICA\n\n          Bonjour je veux une partie de votre\n          pate merveilleux et de votre\n          meilleur fromage absolu de chevre.\n\n\n\n\n                                                        14.\n\n\n\n\n\n\n\n\n\n\nHarry and Marin shop near by. Harry listens to Erica out of\none ear.\n\n                    HARRY\n\n          That's impressive.\n\n                    MARIN\n\n          She started French lessons after she and\n          my Dad split up. Part of her \"Keep Busy,\n          Don't Look Back\" program. She's\n          practically fluent now.\n\n                    ERICA\n\n              (turning back to Marin)\n          Marin, au cas ou nous prende un desset ou\n          devrions jefaire quelgue chose?\n\n                    MARIN\n\n              (with an impeccable\n               accent)\n          Laissons quelque chose d'achat. Et\n          ce grand gateau de chocolat?\n\n                    HARRY\n\n          Hey, not bad.. .\n\n                    MARIN\n\n              (shrugs)\n          Yeah...well. ..I am fluent. Be right\n          back.\nMarin crosses to the dessert counter. Erica turns back and\ncatches Harry checking out Marin's ass. He smiles as he licks\nhis ice cream. Erica rolls her eyes then spots another Older\nGuy with a Leggy Girl twenty-five years his junior.\n\n                    ERICA\n\n          It's an epidemic.\nThen Erica notices who's next to her at the cheese counter.\nShe sees her Sister, Zoe, reading a cheese label with her\nglasses on and next to Zoe are two sad looking Old Women in\ntheir Eighties with their arms linked. Almost woozy, Erica is\nsnapped out of it when she is handed her package.\n\n                     Y\n\n\n                     OUNG FRENCH GIRL\n\n          Merci madame.\nErica heads down the aisle, passing Harry whose back is to\nher. Just as she passes, he turns and almost bumps into her.\n\n                    ERICA\n\n              (backing off)\n          Woops. Sorry.\n\n\n\n\n                                                           15.\n\n\n\n\n\n\n\n\n\n\n\n                      HARRY\n\n          My fault.\nThey so very badly do not want to actually touch. Erica\nhesitates. Harry gestures for her to go first then walks\nalongside her.\n\n                    ERICA\n\n          So, Harry... What do you do?\n\n                    HARRY\n\n          I'm one of the owners of a record\n          company among other things...\n\n                    ERICA\n\n          Oh, really? Which record company?\n\n                    HARRY\n\n          Drive by Records.\n\n                    ERICA\n\n              (appalled at the name)\n          \"Drive By\" Records??? Is that a\n          joke? What is that?\n\n                    HARRY\n\n          It's a Hip Hop label.\n\n                    ERICA\n\n          Hip Hop? Oh, rap? Oh, right. Well.\n              (with disdain)\n          Okay. That's... \"interesting\"...\n\n                    HARRY\n\n          Let me see if I get where you're\n          headed here. . .\n\n                    ERICA\n\n          I'm sorry, but, look, you know I hate\n          rap, I mean I do. It's sort of violent\n          and crude for my taste, not to mention\n          just a tad misogynistic.\n\n                    HARRY\n\n          Hey, a lot of people see rapping as\n          poetry.\n\n                    ERICA\n\n          Yeah, but come on, how many words\n          can you rhyme with 'Bitch'?\nErica places her groceries on the check out counter.\n\n                    MARIN\n\n              (joining Harry)\n          How we doin?\n\n\n\n\n                                                        16.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          Should've left when she tried to arrest\n          me.\n\n\n\n\n\n\n\nINT. ERICA'S DINING ROOM - THAT NIGHT\n\nMarin serves plates of pasta with lobster. Zoe pours wine and\nErica tosses a salad. Harry is the only one sitting.\n\n                    MARIN\n\n          So, Mom, how's the new play? You gettin'\n          happy with it?\nMarin places a plate in front of Harry then runs her finger\nalong \"the nape of his neck. They smile at each other as she\ncontinues on. Erica notices, tries not to respond.\n\n                    ERICA\n\n          Well, the thing with me is that I'm about\n          90% hard word, 10% talent and so far the\n          talent part hasn't exactly kicked in yet.\n\n                    ZOE\n\n          Yeah, right...\n\n                    HARRY\n\n          What's your play about?\nMarin and Zoe stop what they are doing and turn to Erica.\nShe's hesitant to reveal this.\n\n                    ERICA\n\n          About? Well, I'm not exactly sure which\n          is a bit of a problem, but so far it's\n          about a divorced woman, a writer, she's\n          this high strung, over-amped,\n          controlling, know it all neurotic. . .\n              (everyone stares at her)\n          Who's incredibly cute and lovable.\n              (more stares)\n          It's a comedy.\n              (takes a seat next to Zoe)\n\n                    M\n\n          So, how did you two meet?\n\n                     ARIN\n\n          At a Wine Auction at Sotheby's. Harry was\n          the big buyer of the night.\n\n                    HARRY\n\n          I kept winking at Marin as she was\n          conducting the auction and apparently\n          every time I did that she misunderstood\n          and I ended up buying cases of\n          outrageously expensive wine.\n\n\n\n\n                                                        17.\n\n\n\n\n\n\n\n\n\n\nZoe and Marin laugh.\n\n                    ERICA\n\n          Ever been married, Harry?\n\n                    HARRY\n\n          No. No, I haven't.\n\n                    ERICA\n\n          Wow. Now why do you think that is?\n\n                    HARRY\n\n          Some people just don't fit the mold. And\n          so far...\n\n                    ERICA\n\n          Hey, if it ain't broke.\n\n                       HARRY\n\n          Exactly.\nHarry leans back, places his arm around Marin's chair. Erica\ntakes note.\n\n                    ZOE\n\n          Wait a second, aren't you like a famous\n          bachelor?\n\n                    HARRY\n\n          I wouldn't say I'm famous.\n\n                    ZOE\n\n          No, I think I read a piece on you\n          in New York Magazine.\n\n                    HARRY\n\n          I guess people find it interesting\n          that I've escaped the noose for so\n          long.\n\n                    ZOE\n\n          Yeah, wasn't the name of the article,\n          \"The Escape Artist\"?\n\n                    ERICA\n\n          Wait. I read that article. That was you?\n          You were once engaged to somebody big.\n          Who was it? Not Joan Collins.. .Wait.\n          ..Carly Simon?\n\n                    ZOE\n\n          Yeah, it was somebody cool like that.\n              (trying to remember)\n          Not Martha Stewart....\n\n\n\n\n                                                18.\n\n\n\n\n\n\n\n\n\n\n\n                    MARIN\n\n          You could just ..'ask him.\n\n                    HARRY\n\n          No, this is more fun. It's like I'm\n          not here.\n\n                    MARIN\n\n          Harry was once engaged to Diane\n          Sawyer. Okay?\n\n                    ZOE\n\n          Right. Diane Sawyer. I love her.\n\n                    ERICA\n\n              (stunned)\n          I'm impressed.\n\n                    HARRY\n\n          Yeah, women your age love that\n          about me.\nErica pauses on that one.\n\n                    HARRY\n\n              (trying to get thru this)\n          You know what I mean.\n\n                      ERICA\n\n          Yes I do.\n\n                     HARRY\n\n          It's not a bad thing to say 'women\n          your age'.\n\n                    ERICA\n\n          No...I'm sure it was a compliment.\n\n                    HARRY\n\n          It was. ..just the truth.\n\n                    ZOE\n\n              (stepping in)\n          So when was this engagement?\n\n                    HARRY\n\n          Long time ago. She was just this\n          adorable lanky girl from Kentucky\n          with the greatest pair of legs I'd\n          ever seen... Never understood her\n          ending up with a job where she\n          never showed them.\n              (munches on his lobster)\n\n\n\n\n                                      19.\n\n\n\n\n\n\n\n\n\n\n\n          ERICA\n\nYou're not serious? She's Diane\nSawyer, she goes into caves in\nAfghanistan with a shmahtah on her\nhead. Who cares about her legs?\n\n          HARRY\n\nJust anyone who's ever had the\npleasure of... You know what? I\nhate to eat and run but...\n\n          ZOE\n\nNo, wait. This is actually a very\nfascinating dynamic - what's going\non at this table...\n\n          MARIN\n\n    (warning him)\n\nZ\n\n oe teaches Women's Studies at\nColumbia. . .\n\n          HARRY\n\nOh, so this is gonna hurt.\n\n          ZOE\n\nNo, come on, listen, here's the rub\nfor women. Look at what we have\nhere with you and Erica. Harry,\nyou've been around the block a few\ntimes, right? You're what? Around\n60, never been married, which, we\nall know, if you were a woman,\nwould be a curse, you'd be an old\nmaid, a spinster, blah, blah,\nblah... Okay, so instead of pitying\nyou, they write articles about you,\ncelebrate your never marrying, it\nmakes you illusive and ungettable.\nYou're a real catch. Then, take my\ngorgeous sister here...\n\n          ERICA\n\nAny chance of you stopping here?\n\n          ZOE\n\nCome on, this is interesting. I\nmean, look at her, she's so\naccomplished, the most successful\nwoman playwright since who? Lillian\nHellman? She's over fifty,\ndivorced and still sits in night\nafter night because the available\nguys her age want\n    (to Marin)\n\n\n\n\n                                                        20.\n\n                     ZOE(cont'd)\n           --forgive me honey for saying this,\n           but they want girls that look like\n           Marin so the whole over fifty\n           dating scene is geared completely\n           towards men leaving older women out\n           and as a result that makes the\n           older women more and more\n           productive and more and more\n           interesting, which, in turn, makes\n           them even less desirable because as\n           we all know -- men, especially\n           older men, are threatened and\n           deathly afraid of interesting and\n           accomplished women. It's just so\n           clear. Single older women, as a\n           demographic, are as fucked a group\n           as can ever exist.\nErica and Harry's EYES CONNECT for a millisecond. HEAR THE\n\nSOUND OF PLATES CRASHING.\n\n\n\n\n\n\n\n\nINT. KITCHEN - MOMENTS LATER\n\nOVER, we\nErica is cleaning up the broken plates, Zoe leans down to\nhelp.\n\n                     ERICA\n\n           What are you, possessed? How could\n           you say those things?\n\n                     ZOE\n\n           It just seemed so obvious to me. The\n           injustice of it. Thank God men die\n           younger than us. It's the only break we\n           get.\n\n                     ERICA\n\n           Then you know what? Write a dissertation\n           on it, don't announce to the world that I\n           stay in night after night after night and\n           by the way, one night after night would\n           have been enough. Did you ever realize, I\n           stay \"in\" as part of my job. Why do you\n           think I married the director of my plays?\n           He was the only man I ever saw. Anyway, I\n           like staying in and I like this time in\n           my life. Why do I have to defend myself?\nM          I was married for 20 years. I'm done.\n arin ENTERS carrying more dishes.\n\n                     MARIN\n\n           What the hell was that?\n\n\n\n\n                                            21.\n\n\n\n\n\n\n\n\n\n\n\n           ZOE\n\nI'm sorry, I thought I was onto\nsomething.\n\n          ERICA\n\nHoney, what are you doing with this\nguy? He's old, he's chauvinistic...\n\n            MARIN\n\nHe's fun.\n\n          ERICA\n\nHe's fun? How is he fun? He's\nlike.. .wrong.\n\n          MARIN\n\nWrong can be fun, Mom.\n\n          ERICA\n\nNot this wrong.\n\n          MARIN\n\nCan we not do this now? He's\nactually incredibly smart and\nfascinating and if you had talked\nto him about something other than\nhis marital status you would've\nfound out how smart he is. He owns\nlike 10 different companies...\n\n          ERICA\n\nWhat does that mean he owns ten\ndifferent companies? He can't\ncommit, that's what that means. Not\nthat, God forbid, I want him to\ncommit.\n\n          MARIN\n\nYeah, that I get. Anyway, he said he\nthought you two were very spontaneous and\nnice and then said he's leaving as soon\nas the sun comes up.\n\n          ERICA\n\nWhat? His car doesn't have\nheadlights?\n\n          MARIN\n\nGood night.\n\n           ERICA\n\nWait. I have no right to get this\nnuts.\n     (hugs her)\nHe's your friend. Not mine. I love\nyou.\n\n\n\n\n                                                         22.\n\n\n\n\n\n\n\n\n\n\n\n                    MARIN\n\n              (hugs her back)\n          I love you more.\nThis is obviously a ritual between them. Erica kisses\nMarin's cheek in a flutter of kisses, then Marin\n\nEXITS.\n\n\n                    ZOE\n\n          No chance he said we were nice.\n\n                    ERICA\n\n          Please. None.\nThey HEAR MUSIC coming from Marin's bedroom.\n\n                    ZOE\n\n          What are they listening to?\n\n                    ERICA\n\n          I don't care...\n              (listens)\n          Oy. Marvin Gaye. . .\nErica turns on the garbage disposal. Zoe sings along,\n\"Let's get it on\". .., Erica shoots her a look, turns\noff the garbage disposal, doing the dishes with vigor.\n\n                    ERICA\n\n          I know she'll never see him after\n          this weekend. She can't commit\n          either.\nThen they hear Marin GIGGLING.\n\n                    ZOE\n\n          He does sound fun.\nMarin YELPS.\n\n                    ZOE\n\n          Admit it, he's got something. You\n          felt it, right?\nThen they hear Marin SCREAM.\n\n                    ERICA\n\n          Oh, this is nuts...\nErica covers her ears with her hands. Then they hear\nMarin SCREAM \"MOOOOOOMMMMMMMMMMMM!!!!\"\n\n                    ERICA\n\n          Did she say, Mom?\n\n\n\n\n                                                        23.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nINT. MARIN'S ROOM - ANGLE - THE DOOR\n\nErica and Zoe bust into the room and find Harry .on the\nfloor, leaning against the bed, a clenched fist on his chest.\nHis shirt is open, he's sweating, his complexion is grey.\nMarin stands back, freaked out, afraid to get near him.\n\n                      MARIN\n\n           We were fooling around and he said he\n           felt funny Hthen he just collapsed.\n\n                      ARRY\n\n               (out of breath)\n           It's nothing. I'm okay maybe it was\n           the lobster...\n\n                     ERICA\n\n           Does your chest hurt?\n\n                     HARRY\n\n           Like an elephant's standing on it.\n\n                     ERICA\n\n               (to Marin)\n           Call 911...tell them to send an\n           ambulance. . .\nMarin hesitates.\n\n                     ERICA\n\n           Marin! Now!\n\n\n\n\n\n\n\nHARRY'S POV - THE ROOM\n\nSpinning. When he shuts his eyes, it goes BLACK. Spinning.\nBLACK. Spinning. BLACK. He sees Marin, soft in the\nbackground, on the phone and Erica coming toward him. He\nhears Zoe:\n\n                     ZOE(O.S.)\n\n           What are you doing?\n\n                     ERICA\n\n               (coming closer)\n           Mouth to mouth...\n\nON HARRY\n\nEven in this state he gets that Erica is about to place her.\nmouth on his. His eyes WIDEN IN HORROR, he reels back. Erica\ncatches this.\n\n                     ERICA\n\n           You fucking guy...\n\n\n\n\n                                                        24.\n\n\n\n\n\n\n\n\n\n\nShe does it anyway. Her-mouth on his, her breath into his\nlungs, over and over. Harry's eyes roll back in hi-so head.\nAs. Erica pounds on his chest, we HEAR THE BLARE OF A\n\nSIREN...\n\n\n\n\n\n\n\n\nAND A LOUD CLANG\n\nAs the DOORS to SOUTHAMPTON HOSPITAL FLY OPEN. Paramedics\nWHEEL Harry through the corridors and into the ER with\ndizzying speed. Two Nurses jostle Harry OFF the gurney and\n\nONTO A BED.\n\nDR. JULIAN MERCER arrives at Harry's side. Julian is in his\nearly-thirties and has finally just graduated out of the 'you\nlook too young to be a doctor' syndrome. Julian is a man\nwhose goodness makes him sexy. He wears his hair shaggier\nthan you'd expect but then again, this is a Johns Hopkins\ngraduate who chose to live near the beach and work nights.\nThe Nurses place oxygen in Harry's nose, .;hook him up to a\nheart monitor and connect him to an IV.\n\n                    JULIAN\n\n          How we doing here?\n\n                    PARAMEDIC #1\n\n          He's had 30 minutes of chest pain,\n          nausea, shortness of breath, blood\n          pressure's 170 over 100, pulse 104,\n          respirations 18...\n\n                     JULIAN\n\n          Let's get an EKG. Mr. Langer, I'm\n          Dr. Mercer. Are you in any pain\n          right now?\nThe Nurse wheels over an EKG machine, Julian helps hook it\nup.\n\n                    HARRY\n\n          Feel some pressure in my\n          chest...it's real tight.\n\n                    JULIAN\n\n          Can you show me where the pain is?\nHarry clenches his fist over his sternum.\n\n                    JULIAN\n\n          What were you doing at the onset of\n          the pain?\n\n                    HARRY\n\n          I was uh, kissing a beautiful...\n\n\n\n\n                                                        25.\n\n\n\n\n\n\n\n\n\n\n\n                    JULIAN\n\n              (watching the monitor)\n          Where you having intercourse?\n\n                    HARRY\n\n          -- Unfortunately, no.\n\n                    JULIAN\n\n\n          S\n\n           ense of humor in tact...\n              (checks EKG)\n          Hang a nitroglycerine drip. Mr.\n          Langer the EKG shows you have a\n          blocked artery which is not\n          allowing enough oxygen to get to\n          the heart muscle.. .\n\n                    HARRY\n\n          I'm having a heart attack?\n\n                    JULIAN\n\n          We're gonna stop it. But I need to\n          know what kind of medications you\n          take?\n\n                    HARRY\n\n              (scared shitless)\n          I take uh... uh. . . Lipitor. . .\n\n                    JULIAN\n\n              (reading the EKG tape)\n          Uh-huh... .Any thing else?\n\n                    HARRY\n\n          -- and a white one for blood\n          pressure. . .\n\n                       JULIAN\n\n          procardia?\n\n                       HARRY\n\n          Yeah.\n\n                    JULIAN\n\n          What about, Viagra?\nErica, Marin and Zoe ARRIVE in the DOORWAY of the ER. Harry\neyes them...stalls.\n\n                    JULIAN\n\n          Mr. Langer? Did you take any Viagra\n          today? Mr. Langer?\n\n                    HARRY\n\n          No. No Viagra.\n\n\n\n\n                                                        26.\n\n\n\n\n\n\n\n\n\n\n\n                    JULIAN\n\n          You're positive?\n\n                    HARRY\n\n          I don't take Viagra. Don't need\n          Viagra.\nThe Women grab looks at each other, know they shouldn't be\nthere. They turn away.\n\n                    JULIAN\n\n          Great. Just needed to be sure\n          because I put nitroglycerin into\n          your-drip and if you had taken\n          Viagra, the combo would make your\n          heart leap right out of your\n          body...\n\n\n\n\n\n\n\nCLOSE - HARRY'S EYES - PANICKED\n\nAs he watches the NITROGLYCERIN make it's way DOWN THE TUBE\nand APPROACH HIS ARM. Just as the amber liquid is about to\nenter his bloodstream he YANKS the IV out of his arm. The\ndrip is knocked onto the ground. The Women shriek as the\nNurses scurry to clean up. Erica and Zoe rush out, Marin\nhangs back. Harry catches the look on her face.\n\n                    JULIAN\n\n          Let's give him an aspirin and\n          Metoprolol 5mg...\n\n                    HARRY\n\n          Sorry, had an audience...\n              (clutching his chest)\n\n                    JULIAN\n\n          It's okay. ..it was a great save.\n              (to Nurse)\n          Let's start the thrombolytic protocol.\n          \"4000 units of heparin. Mr. Langer, if\n          this works and I have every reason to\n          believe it will, it's going to reverse\n          what's going on so there will be little\n          or no damage to your heart. You with me?\n              (Harry nods. Julian places\n               his hand on Harry's)\n          Okay, here we go.\n\nTHE HALLWAY\n\nMarin paces, smoking. Erica sits. Zoe leans against the wall.\n\n                    MARIN\n\n          Oh, man, what if he doesn't make\n          it? I don't know who to contact.\n\n\n\n\n                                                           27.\n\n\n\n\n\n\n\n\n\n\n\n                    MARIN (CONT'D)\n\n          I don't know his family. I've gone\n          out to dinner with the guy three\n          times. I hardly know him.\n\n                    ERICA\n\n          He's gonna make it. Don't worry.\n\n                    M\n\n          He's like a bulldog. He'll make it.\n\n                     ARIN\n\n          This is a nightmare. I go out with\n          a guy who's so old, he takes\n          Viagra.\n\n                    ERICA\n\n          Are you nuts? You go out with a guy\n          who's so old he's having a heart\n          attack!\n\n                    ZOE\n\n          All I can say is, thank God it didn't\n          happen when he was inside you. That could\n          be life altering.\nJulian rounds the corner of the corridor. Marin rushes toward\nhim, her face begging for good news.\n\n                    JULIAN\n\n          Your Dad's gonna be okay.\n\n                    MARIN\n\n          Oh, he's not my Dad...\n\n                     JULIAN\n\n          I'm sorry.\n              (then)\n          Your Grandad's gonna be okay.\n\n                    MARIN\n\n              (throws her arms around\n               him)\n          Oh, thank you so much. But he's not my...\n          oh we're not related. He's just a friend.\n\n                    JULIAN\n\n          Sorry.\nHis sweet apologetic smile is not lost on Marin. Zoe and\nErica join them.\n\n                    JULIAN\n\n          I'm Dr. Mercer. Mr. Langer did have a\n          mild heart attack. I gave him something\n          to break up the clot in his artery and it\n          worked beautifully.\n\n\n\n\n                                                        28.\n\n\n\n\n\n\n\n\n\n\n\n                    JULIAN (CONT'D)\n\n          His EKG returned to normal almost\n          immediately which means I don't expect\n          any permanent damage. He's very lucky.\n\n                    ERICA\n\n              (shoulders sagging)\n          Thank you. . .\n\n                    JULIAN\n\n          No, whoever got him here so fast should\n          be thanked. Another half hour and I don't\n          know if this would've worked.\nMarin pats her Mom on the back.\n\n                     ERICA\n\n          Oh, man...\n              (realizing it all now)\n          This was...intense.\nErica wipes away a tear. Nothing could surprise her more.\n\n                    JULIAN\n\n          We're out of the woods. I've given him\n          something to sleep, it might make him a\n          little loopy at first but then it should\n          knock him out.\n              (to Erica)\n          You're Mrs. Langer?\n\n                    ERICA\n\n          No, no I'm just... No. I'm Erica Barry. .\n          He was having dinner at our house. I just\n          met him this afternoon.\n\n                    JULIAN\n\n          You're Erica Barry?\n\n                    ERICA\n\n          Yes.\n\n                    JULIAN\n\n          The playwright?\n\n                    ERICA\n\n          Yes...\n\n                    JULIAN\n\n          What a pleasure. I'm a huge fan.\n          Huge fan.\n\n                    ERICA\n\n          Really? Oh, thanks... This is my\n          daughter, Marin, my sister, Zoe...\n\n\n\n\n                                                        29.\n\n\n\n\n\n\n\n\n\n\nJulian says Hi to each then returns his attention fully and\ndevotedly to Erica. Takes her in.\n\n                    JULIAN\n\n          Wow.\n\n\n\n\n\n\n\nCLOSE - A JAPANESE TEA POT\n\nJulian pours steaming hot tea into 3 paper cups.\n\n\n\n\n\n\n\nMARIN - CLOSE\n\nSitting in the hospital corridor as JULIAN'S HAND ENTERS HER\nFRAME and hands her a cup of tea. She looks up at him with\nmore adorableness than most men could handle. She blows on\n\n                     M\n\nthe steam.\n\n                     ARIN\n\n          Thanks.\nCamera Pans to ZOE. Sitting next to Marin. She is also handed\na Cup of Tea. Even she softens as she looks up at Julian.\n\n                    ZOE\n\n          Thank you Doctor.\nThis is all beginning to feel a little like the Step Sisters\ntrying on the Glass Slipper. Until we get to Erica, not\npaying any attention at all as she is handed her Tea.\n\n                    ERICA\n\n          Oh. . .Hey. . .Ew. . .Hot. Thanks.\n\n                    JULIAN\n\n              (eyes on Erica)\n          You're welcome. May I join you?\n\n                    ERICA\n\n          Yeah. Sure. This is very nice of\n          you.\n\n                    JULIAN\n\n          First year of medical school you\n          learn what can keep you up all\n          night without making you nuts.\n          Green Tea beats everything plus\n          it's a great antioxidant. Cheers.\n\n                    MARIN\n\n              (turning on the charm)\n          So, urn, do you always work nights?\n\n\n\n\n                                                  30.\n\n\n\n\n\n\n\n\n\n\n\n                    JULIAN\n\n          Usually two or-three a week, gives\n          me a chance for a real life during\n          the day. . .\n              (immediately turns back to\n               Erica)\n          You know, I heard you had a place\n          in the Hamptons. I really am a very\n          big fan. I honestly think I've seen\n          every play you've ever written.\n\n                    ERICA\n\n          I think some were written before\n          your time. There are some Marin's\n          never even seen.\n\n                    JULIAN\n\n          No, I'm pretty sure I've seen them\n          all and I saw the last one twice.\nZoe nudges Erica as a Nurse enters from the ER.\n\n                    NURSE\n\n          Doctor, we've got a walk in, may\n          need stitches. . .\n\n                    JULIAN\n\n              (rises)\n          I'll check on MI. Langer...if he's\n          asleep; you all might want to get\n          some shut eye and come back in the\n          morning. Great to meet you Erica.\n          Ladies. . .\nThe Women wave and watch him exit.\nThe second he's gone:\n\n                    ERICA\n\n              (to Marin)\n          Okay, now that's a perfect a guy\n          for you. He's adorable.\n\n                    MARIN\n\n          Mother! I've never seen a man less\n          interested in me.\n\n                    ZOE\n\n          Or more interested in you.\n\n                    ERICA\n\n          Me? He's thirty years old.\n\n                    MARIN\n\n          No, he's older than that.\n\n\n\n\n                                                        31.\n\n\n\n\n\n\n\n\n\n\n\n                    ZOE\n\n          Who cares how old, he is. I mean,\n          he's not my type, he's like a\n          gorgeous wholesome doctor but, he's\n          perfect for you and hot for you,\n          which makes him really perfect.\n\n                    ERICA\n\n          Stop it. He likes my work. Not me.\n              (they just stare at her)\n          It's insane. I would never.\n              (off Zoe's look)\n          Shut. Up.\nJust then, Harry stumbles into the corridor in his Hospital\n\n                     Z\n\nGown, pretty out of it.\n\n                     OE\n\n          Yuh-oh.\n\n                    MARIN\n\n              (rises)\n          Harry....\nConfused, Harry turns around, a little lost, giving the Women\na FULL VIEW OF HIS BARE ASS. The Women muffle screams.\n\n                    MARIN\n\n          Harry! Over here!\nHe faces them.\n\n                    HARRY\n\n          Honey, I want to go home. Can you\n          call Lowell to pick me up?\n\n                    MARIN\n\n              (confused)\n          Lowell?\nHarry wobbles. Is he going to fall? Marin freezes, looks to\nher Mom for help. Erica rushes to Harry.\n\n                    ERICA\n\n          Harry, you have to get back in bed.\n\n                    HARRY\n\n          Woman. And I say that as a\n          compliment... You saved my life.\n              (kisses her hand)\n          Soft.. .\n              ( then)\n          I don't remember your name but I\n          thank you from the bottom of my...\n\n\n\n\n                                                        32.\n\n\n\n\n\n\n\n\n\n\nHe falls on Erica, totally out of it, his head on her breast,\nhis mouth open.\n\n                    ERICA\n\n              (afraid to breathe)\n          Ugh. Look at this, even\n          unconscious, he's a lech.\nThe Nurses rush out and peel Harry off Erica.\n\n                    NURSE\n\n          Mr. Langer, you shouldn't be\n          standing.\n\n                    HARRY\n\n          Got to take a whiz girls.\n\n                    NURSE\n\n          We'll take care of that for you,\n          Mr. Langer.\nHarry turns back to the Women, smiling. He likes that idea.\nLOVES that idea.\n\n                    HARRY\n\n          Okay. You take care of it for me,\n          sweetheart. I'd like to see that...\nAs he walks away, his bare ass shines like a full moon in a\ndesert sky.\n\n                    MARIN\n\n          This is the most insane night of my\n          life.\n\n                    ZOE\n\n          Yeah, but just admit that was one\n          great ass for a guy that age.\n\n\n\n\n\n\n\nCLOSE - A LARGE VASE OF YELLOW ROSES - 36 HOURS LATER\n\nA Nurse slides the Roses down the counter of her station.\n\n                    NURSE\n\n          Now what can I do you for?\nShe looks across at a neat as a pin Man in his early forties,\nPrada suit, crisp white shirt, dark tie. He's a Gershwin tune\nof a man. A throwback to a kinder world. This is. LOWELL,\nHarry's Houseman/Chef/all around Man Friday.\n\n                    LOWELL\n\n          I'm here for Mr. Harry Langer.\nJulian ENTERS the Nurse's station.\n\n\n\n\n                                                        33.\n\n\n\n\n\n\n\n\n\n\n\n                    NURSE\n\n              (to Julian)\n          Are we discharging Hurricane Harry?\n\n                    JULIAN\n\n          Yes we are. Hi, I'm Dr. Mercer.\n          Come on, I'll take you to him.\nJulian EXITS the Nurse's Station. Lowell, carrying the\nflowers, follows. He nods to TWO TALL LEGGY MINI SKIRTED\nASSISTANT TYPES, KIM and LEXI who follow. Both pack cell\n\n                     J\n\nphones, note pads, carry balloons, flowers and shopping bags.\n\n                     ULIAN\n\n          And you are. . ?\n\n                    LOWELL\n\n          Lowell St. James'. Mr. Langer's\n          houseman, chef... general valet..\n\n                    JULIAN\n\n          Well that sounds like a pretty,\n          interesting job.\n\n                    LOWELL\n\n          Fifteen years. Never a dull moment.\nThey arrive at:\n\n\n\n\n\n\n\nA PRIVATE ROOM\n\nwhere Harry lies on the bed, dressed and ready to go. He\nsquints as he reads a pamphlet at arms's distance called,\n\"Heart Attack -- Bouncing Back\".\n\n                    JULIAN\n\n          Okay, Harry, looks like we're going\n          to have to let you go.\nHarry sits up too fast, lies right back down. Lowell looks\nlike he might cry. The Girls hold back.\n\n                    HARRY\n\n          Take it easy kids, I just sat up\n          too fast. Doc, tell them. Am I in\n          good shape? How were my tests this\n          morning?\n\n                    JULIAN\n\n          He's doing extremely well.\n\n                    LOWELL\n\n              (holding back tears)\n          Can I hug him?\n\n\n\n\n                                                           34.\n\n\n\n\n\n\n\n\n\n\n\n                    JULIAN\n\n          Absolutely.\nHarry stands and indulges Lowell in a deep hug. Lowell's\nshoulders shake as he sobs.\n\n                    HARRY\n\n          Okay, Okay. Let's not get goofy. We\n          got no thin , but good news here.\n\n                    LOWELL\n\n          I must say, you do look good...\n          considering. You have a little\n          extra baggage under your eyes, but\n          I know how to fix that.\n\n                    HARRY\n\n              (to Julian)\n          See what good hands I'm in. Did you\n          meet my gorgeous assistants?\n\n                    JULIAN\n\n          Not formally.\n\n                     HARRY\n\n          Girls... .my Doctor, Julian Mercer.\n              (then)\n          Honey, did you bring the CDs?\nKim hands Harry a shopping bag full of CDs.\n\n                    HARRY\n\n              (to Julian)\n          These are for you...\n              (to the Girls)\n          The man loves Hip Hop.\n\n                    JULIAN\n\n              (checking out the bag)\n          Maybe not this much but...\n\n                    HARRY\n\n          And did you bring the other thing?\nLexi hands Harry another bag. Harry reaches in and pulls out\na small leather box, hands it to Julian.\n\n                    HARRY\n\n          This is just to thank you for your\n          brilliance the other night. I hope\n          it suits you.\n\n                    JULIAN\n\n              (opening the box)\n          Wow. This is.. .Jesus, this is the\n          most gorgeous watch I've ever seen.\n\n\n\n\n                                                        35.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          - Oh, good. It's a Piaget.\n              (to Girls)\n          He likes it.\n\n                    JULIAN\n\n          No, I love it and this is incredibly\n          generous of you but I can't accept it.\n\n                    HARRY\n\n          You save my life and you end up\n          with some CDs?\n\n                    JULIAN\n\n          No, I end up seeing you walk out of\n          here and I do get paid you know -\n\n                    MARIN (O.S.)\n\n          -- Knock, knock.\n\nT\n\n hey all turn, see Marin at the door. She waves to Harry,\nmore reserved than normal.\n\n                    JULIAN\n\n          Harry, I'll see you on the way out.\n\n                    LOWELL\n\n              (whispers)\n          We'll pull up the car.\nEveryone EXITS leaving Marin and Harry alone. Harry sits on\nthe bed. Marin joins him. Harry places his hand on her thigh.\nAll she notices is his hospital bracelet.\n\n                    HARRY\n\n          So, I'm some great date, huh?\n\n                    MARIN\n\n          Yeah... Mr. Excitement.\n\n                    HARRY\n\n          Tell me somethin', we haven't actually\n          had sex yet, have we?\n\n                    MARIN\n\n          No we haven't. You're correct on\n          that one.\n\n                    HARRY\n\n          Something to live for.\nMarin smiles, kisses Harry on the cheek.\n\n\n\n\n                                                        36.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          Down to the cheek.\n              (that's big, he digests\n               that one)\n          Come on, let's get outta here.\n\n\n\n\n\n\n\nEXT. SOUTHAMPTON HOSPITAL - DAY\n\nHarry is wheeled out in a wheelchair, Marin and a Nurse on\neither side. In the parking lot is a Town Car with Lowell and\nthe Girls standing next to it. Next to them is Erica, waiting\nby her car. She's on her cell phone. Harry spots them and\ntries to get out of the wheel chair before it stops.\n\n                    NURSE\n\n          Hold on Tarzan, we're still movin' ...\n              (she stops)\n          Okay, now slow-ly.\nTo prove her wrong, Harry rises quickly. Everyone stands by,\nready to help.\n\n                    HARRY\n\n          Look at these faces. Will you tell them\n          I'm fine.\nAs soon as Harry spots Erica, he starts to wobble.\n\n                    ERICA\n\n          Whoa! Whoa! WHOA!\nEveryone grabs for Harry as he FALLS OUT OF FRAME AND THE\n\nSCREEN GOES BLACK.\n\n\n\n\n\n\n\n\nCLOSE ON JULIAN\n\ntaking Harry's pulse as Harry lies on the ASPHALT OF THE\nHOSPITAL PARKING LOT. Lowell, the Two Assistants and Marin\nhuddle around. Erica steps back a bit.\n\n                    JULIAN\n\n          Harry, I'm sorry, but I think we jumped the\n          gun.. .can't let you travel quite yet.\n\n                    HARRY\n\n          I ain't goin' back in there.\n\n                    JULIAN\n\n          You don't have to but I can't put you in\n          a car right now and I can't leave you in\n          the parking lot. I'd like you to stay\n          nearby for a few days and let me keep an\n          eye on you 'til you get your strength\n          back.\n\n\n\n\n                                                        37.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          Doc, I'm out in the middle of the\n          Hamptons. Where do you want me to go?\nMarin turns to Erica who very clearly mouths, \"FORGET IT!\"\n\n\n\n\n\n\n\nEXT. ERICA'S HOUSE - LATER THAT DAY.\n\nThe Town Car sits in the driveway, Lexi leans on the hood,\ntalking on her cell. A Market Delivery Van pulls away as a\nDrugstore Delivery Van pulls in. A Flower Delivery KID\nholding a large bouquet, knocks at the front door.\n\nI\n\n\n\n\n\n NT. THE GUEST BEDROOM - SAME TIME\n\nHarry sits up in bed wearing silk pajamas, holding an unlit\ncigar, and is on the phone.\nZoe enters, placing the new bouquet on the already flower\nfilled dresser. Lowell lifts a LUNCH TRAY off the bed as Kim\nstands nearby on the cell phone. Marin packs her bag.\n\n                    HARRY\n\n              (into phone)\n          Just promise me you won't make a decision until\n          we talk. Thinking about it ain't promising me.\n          Okay, man, I'm seein' you Friday...\n              (hangs up, then to Lowell)\n          Lowell, what was that?\n\n                    LOWELL\n\n              (looking down at the Tray)\n          Your lunch.\n\n                    HARRY\n\n          Somebody tell you to starve me to death?\nKim hands Harry the cell phone.\n\n                     KIM\n\n          Russell.\n\n                    HARRY\n\n              (into phone)\n          Rush? No, man, you're livin' the shit.\n          I just got a clean bill of health.\nKim hands Harry a NOTE that says:\n\n\n\n\n\n\n\n          YOU HAVE TWO DINNER DATES THIS WEEK,\n\n\n          SHOULD I CANCEL AND SEND FLOWERS?\n\n\n\n\n\n                                                        38.\n\n\n\n\n\n\n\n\n\n\nHarry steals a look at Marin, then nods to Kim.\n\n\n\n\n\n\n\nINT. KITCHEN\n\nErica puts away groceries, a little on edge. Her back is to a\nMan in his fifties, who sits at the island, eating a\nsandwich. He wears sweats and a baseball cap. His natural\nexpression is -- worried. This is DAVE.\n\n                    DAVE\n\n          This is the best turkey sandwich I\n          ever had in my life. What kind of\n          mustard is this?\n\n                    ERICA\n\n              (not turning around)\n          I don't know.\n\n                    DAVE\n\n          All right, don't get pissy. It's\n          not Dijon, right?\n\n                    ERICA\n\n          Don't get pissy. ..you say that 'cause\n          this, of course, would never happen to\n          you. .1 come out here for peace and quiet\n          and suddenly I'm a character in a Kaufman\n          and Hart play.\n              (the phone RINGS)\n          And the phone does not stop.\n              (phone STOPS RINGING)\n          And it's never for me!\nLowell ENTERS with the Bed Tray.\n\n                    LOWELL\n\n          Sorry to interrupt.\n\n                    ERICA\n\n          That's fine Lowell, I'll take that.\n\n                    LOWELL\n\n          No, please, allow me.\n\n                    ERICA\n\n          No, no, I'll take it. No problem.\nErica takes the bed tray as Lowell EXITS.\n\n                    ERICA\n\n          The man does not know my name and\n          I'm doing his dishes.\nLexi ENTERS, all 5'10\" of her. Dave suddenly looks alive. She\ncarries an empty water glass.\n\n\n\n\n                                                          39.\n\n\n\n\n\n\n\n\n\n\n\n                    LEX\n\n          Hi Erica. Um...where should I put\n\n                    E\n\n          this?\n\n                     RICA\n\n          Right here. I'll take it.\n\n                    LEXI\n\n          And Harry has a headache. Do you\n          have any Tylenol?\n\n                    ERICA\n\n          Tylenol yes. ..\n              (reaches in cabinet)\n\n                     LEXI\n\n              (extends her hand to Dave)\n          Hi. I'm Lexi, Harry's second\n          assistant.\n\n                    DAVE\n\n          Hey...Dave Klein. How ya doin'?\nErica hands Lexi the Tylenol, she thanks her and EXITS.\n\n                    ERICA\n\n              (holding the water glass)\n          Where should I put this? It's an\n          empty water glass. What are the\n          choices?\n\n                    DAVE\n\n              (rises)\n          I'm gettin' outta your hair.\n\n                       ERICA\n\n          Thank you.\n\n                    DAVE\n\n          So you're not ready to show me any\n          pages? I'm not putting pressure on\n          you, I'm just asking.\n\n                    ERICA\n\n          I haven't written a word. I'm on\n          page twelve and the first eleven\n          pages stink.\n\n                      DAVE\n\n          So you have one good page.\n               (then)\n          How tall do you think that girl\n          was?\nBefore Erica can respond, Marin ENTERS.\n\n\n\n\n                                                        40.\n\n\n\n\n\n\n\n\n\n\n\n                    MARIN\n\n          Dad! I didn't know you were here.\n\n                    DAVE\n\n          I'm just on my way out, bubbee.\n\n                    MARIN\n\n          Well, I was just gonna drive into the\n          city with Zoe but if you're driving back,\n          I'd much rather go with you.\n\n                    DAVE\n\n          I have to meet someone before I go...\n\n                    ERICA\n\n              (to Marin)\n          Wait wait wait wait. You're leaving, Zoe's\n          leaving, the entourage is leaving. And I'm\n          supposed to stay here with him alone?\n\n                    MARIN\n\n          The doctor said\" he's 'sending over\n          a Nurse in the morning...\n\n                       ERICA\n\n          The morning? That's nineteen hours from\n          now...\n                 (takes a deep breath)\n          Okay, I can handle this. I'm just going\n          to get into a zen' place, play music,\n          cook, write, focus...\n\n                    DAVE\n\n          She never changes...\n\n                    ERICA\n\n              (setting him straight)\n          Yes. Maybe that's a good thing.\n\n\n\n\n\n\n\nEXT. ERICA'S HOUSE - SUNSET\n\nNo cars are out front. Quiet and peaceful. On the Soundtrack\nwe hear the French tune, I wish You Love sung in French.\n\n\n\n\n\n\n\nINT. ERICA'S KITCHEN - THE SAME TIME - MUSIC OVER\n\nErica cooks, softly singing along in French.\n\n                    HARRY (O.S.)\n\n          Smells great in here.\nSurprised, Erica turns to find Harry leaning in the doorway\nin his pajamas, robe and slippers. No one's ever had more\ngorgeous clothes to sleep in. His presence disarms her.\n\n\n\n\n                                                        41.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n          Coq au Vin...\n              (he looks confused)\n\n                    H\n\n          Chicken cooked in red wine...\n\n                     ARRY\n\n          French Food... French music...\n\n                    ERICA\n\n          Part of my play takes place in Paris so\n          I'm hoping this helps me think. I'm\n          hopin'...How you feeling?\n\n                    HARRY\n\n          Well, I walked all the way in here,\n          only bumping into two chairs and an\n          ottoman.\n\n                    ERICA\n\n          Everyone bumps into that ottoman.\nHarry appreciates the thought. Before it has time to become\nawkward, the Phone RINGS.\n\n                    HARRY\n\n          Hey, thanks for letting me...\n\n                    ERICA\n\n          Yeah, no...it's fine.\n              (answering the phone)\n          Hello. Yes, he is.\n              (hands the phone to Harry)\n\n                    HARRY\n\n              (into phone)\n          Hello. Hey sweets...\n              (Erica hates this)\n          Oh, you got the flowers? Are they\n          pretty?\nErica can't stand this. She puts on her glasses and skims her\nrecipe.\n\n                    HARRY\n\n          Hey, can I call you in a little\n          bit. What's your number doll?\n              (spots a pad and pencil)\nHarry squints, can't see what he's writing...backs his head\naway from the pad. Erica hands him her glasses.\n\n                    HARRY\n\n              (slips them on, jots down\n               the number)\n          Okay... Call you in a little.\n\n\n\n\n                                                          42.\n\n\n\n\n\n\n\n\n\n\nHarry hangs up and hands the glasses back to Erica.\n\n                    HARRY\n\n          Same prescription...\n\n                    ERICA\n\n          Look, Harry, it's not like in any stretch\n          of the imagination, I think you're all\n          that right for my daughter but I don't\n          really appreciate hearing you on the\n          phone with other women. It's like I'm an\n          accomplice to you cheating, it's...\n\n                    HARRY\n\n          Your daughter knows I see other women.\n\n                    ERICA\n\n          She does? I mean, fine, it's none\n          of my business...but...\n              (struggles to open a\n               bottle of wine)\n\n                    HARRY\n\n          She knows I'm not monogamous...We've\n          discussed it.\n\n                    ERICA\n\n          Great? And that's what? Why are you\n          proud of that?\n\n                    HARRY\n\n          Not proud. Just honest. Your daughter\n          said she likes that about me.\n              (takes the wine and opens\n               it with ease.)\n\n                    ERICA\n\n          My daughter is confused when it comes to men.\n\n                    HARRY\n\n          I don't blame her. We're confusing.\nHarry hands her the open wine bottle.\n\n\n\n\n\n\n\nEXT. BEACH PATIO\n\n\n\n\n\n\n\n\nWIDE SHOT - ALMOST NIGHT\n\nErica and Harry sit not so close together at a long table,\nunder a purple sky. Another French Tune plays. If this wasn't\nthem, this would look romantic.\n\nN\n\n othing is said. Just two people eating. Harry lifts the salt\nshaker, about to add salt to his chicken.\n\n\n\n\n                                                        43.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n          Should I just call the ambulance now?\nHarry shoots her a look and places the salt shaker back on the\ntable.\n\n\n\n\n\n\n\nEXT. HOUSE - NIGHT - OVER - LOUIS ARMSTRONG'S LA VIE EN ROSE\n\nA starry sky gives the house a storybook setting. We HEAR THE\n\nPHONE RING.\n\n\n\n\n\n\n\n\nINT. ERICA'S BEDROOM - SAME TIME - MUSIC CONTINUES\n\nErica works at a laptop at a cluttered table. The CLOCK tells us\nit's a little after ONE A.M. Annoyed by the ringing phone, she\npoints her remote at the CD Player and stops' the song. Harry\nanswers the phone in his room. A moment of quiet. Erica points her\nremote, starts the song again, starts typing again. Now the other\nline RINGS. She looks over at the phone watching one RED LIGHT\n\"BLINK, while the other line is answered.\n\n                    ERICA\n\n          What am I doing?\nShe throws a piece of paper over the phone so she can't see it.\nShe clicks on her AOL ICON and is told: AOL CANNOT CONNECT. LINE\nBUSY. She's pissed. Then, worse, she SMELLS something.\n\n\n\n\n\n\n\nINT. HARRY'S BEDROOM - SAME TIME\n\nHarry is on the phone, smoking a cigar. His pajama top is\nunbuttoned, his hair is allover the place. His bed is a mess,\nlaptop open, newspapers spilling onto the floor. Erica stands\nin the doorway. He quickly hides his cigar.\n\n                     HARRY\n\n               (into phone)\n          Can you hold a see, doll?\n               (looks to Erica)\n          Hey.\n\n                     ERICA\n\n          Okay, here's the thing. I really don't\n          want to play the part of the uptight\n          Nurse to your bad boy patient. If you\n          want to have another heart attack, go\n          ahead, it's your life but I have work to\n          do and I don't have time to make another\n          run to the hospital because you're\n          filling your already clogged arteries\n          with smoke but more importantly, I'd\n          rather not have my house smell like a\n          pool hall.\n\n\n\n\n                                                        44.\n\n\n\n\n\n\n\n\n\n\nErica holds out a partially filled water glass for Harry to\ndeposit his cigar in.\n\n                    HARRY\n\n          I have a question for you.\nShe waits. She doesn't say anything.\n\n                     ERICA\n\n          What? Do I Hhave to say what?\n\n                     ARRY\n\n          Have you always been like this or\n          do I bring this out in you?\nShe shakes the water glass, waiting for the deposit. He drops\nthe cigar in.\n\n                    HARRY\n\n          I don't think I've ever had this\n          effect on a woman before.\n\n                    ERICA\n\n              (picking up the\n               newspapers)\n          And what effect do you think you're\n          having on me?\n\n                    HARRY\n\n          I don't quite recognize it, that's how I\n          know I've never had it before.\nErica rolls her eyes as she finishes cleaning up.\n\n                    HARRY\n\n          So you don't sleep?\n\n                    ERICA\n\n          I only need about four hours a night.\n\n                    HARRY\n\n          Me too. Never slept eight hours in my\n          life.\n\n                    ERICA\n\n          Me either. I wish I could. ..but...\n              (re: curtains)\n          Want me to shut these, sun comes in\n          pretty strong in the morning.\n\n                    HARRY\n\n          Sure. . . thanks. . .\n\n                    ERICA\n\n              (drawing the drapes)\n          Who you talking to at this hour?\n\n\n\n\n                                                        45.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          A friend in L.A. It's only ten out there.\n\n                    ERICA\n\n          And that's not past her bedtime?\n\n                    HARRY\n\n          So you don't get more mellow as the hours\n          pass?\n\n                    ERICA\n\n              (heading out)\n          Good night, Harry.\n\n                    HARRY\n\n          Can I ask you one other thing?\n              (Erica turns)\n          What's with the turtlenecks? It's\n          the middle of summer.\n\n                    ERICA\n\n          Now seriously, why do you care what I\n          wear?\n\n                    HARRY\n\n          Just curious.\n\n                    ERICA\n\n          I like them. I've always liked them. I'm\n          just a turtleneck kinda gal.\n\n                    HARRY\n\n          You ever get hot?\n\n                    ERICA\n\n          No.\n\n                    HARRY\n\n          Never?\n\n                    ERICA\n\n          Not lately.\n\n\n\n\n\n\n\nINT. ERICA'S BEDROOM - NIGHT\n\nAlmost TWO. Erica is writing, her eyes go to the phone with\nthe typing paper over it. She LIFTS a corner of the paper,\ntakes a peek. The one lit line GOES OUT. Finally. \"Erica\nturns off her computer, sits for a second. No one has rattled\nher cage like this in quite some time. And no, she doesn't\nlike it. She stands, starts to undress.\n\nANGLE - THE FLOOR\n\n\n\n\n\n                                                        46.\n\n\n\n\n\n\n\n\n\n\nAs Erica's TURTLENECK lands on it. Then her BRA, then her\nPANTS then her PANTIES.\n\nERICA - NAKED - TIGHT SHOT\n\nShe crosses through the room on her way to the Bathroom. She\npasses by her partially open door, happens to look out INTO\n\nTHE HALLWAY AND SEES:\n\n\nHARRY - PLANTED RIGHT IN FRONT OF HER\n\nSeeing it all.\n\nERICA - SCREAMS\n\nand DROPS OUT OF FRAME.\n\nHARRY\n\nflustered, spins around, loses his balance, crashes into the\nwall, covers his eyes.\n\n                    HARRY\n\n          I'm sorry! Oh, God am I sorry.\n\n                    ERICA (O.S.)\n\n          What are you doing?!?\n\n                    HARRY\n\n          Trying to find the kitchen!\n\n                    ERICA (O.S.)\n\n          Back here???\n\n                    HARRY\n\n          I-I got confused..! It was dark. I didn't\n          really see anything. Just your tits and a\n          little of your-\nErica SLAMS HER DOOR. Photos on the wall shake.\n\n                    HARRY\n\n          This is gonna be murder.\n\n\n\n\n\n\n\nINT. LIVING ROOM - THE NEXT MORNING\n\nA very wide MIDDLE AGED NURSE gruffly crosses thru the room\ntoward the Front Door. Just as she opens the door, Erica\nENTERS in hat, sunglasses, turtleneck, long skirt. Pretty\nmuch no skin is showing whatsoever. She carries a few\npackages.\n\n                    NURSE\n\n          Good bye Mrs. Barry.\n\n\n\n\n                                                        47.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n          Good bye? You're leaving? That's\n          not good.\n\n                    NURSE\n\n          Been fired.\n\n                     ERICA\n\n          Fired?   You just started.\n\n                    HARRY\n\n          Not fired darlin'. Just not needed.\nErica hardly looks at You Know Who who appears to be fresh\nout of the shower, wet hair, silk robe, bare chest and legs.\n\n                    ERICA\n\n          What do you mean, not needed? Of\n          course we need her. She's gonna\n          take care of you and feed you and...\n\n                    HARRY\n\n          -- No, no, I'm actually feeling\n          pretty perky today. Making quite a\n          recovery. . .\n              (opening the screen door)\n          Sorry for the trouble Mrs.\n          Gimble... Take care, dear.\nHarry hands her a wad of bills like she's a Maitre'd. Mrs.\nGimble gives Erica a look of pity as she exits. Erica, now\nalone with Harry, self-consciously adjusts her sunglasses.\nHarry, on the other hand, slips his hand onto his bare chest,\npats it.\n\n                    HARRY\n\n          Listen, about last night.\n\n                    ERICA\n\n          Yeah. How 'bout we never talk about that?\n              (hands him some pills)\n          I was at the drugstore. Your\n          prescriptions were ready. They said take\n          these two with food and this one without.\n\n                    HARRY\n\n          Honestly, you were in silhouette.\n\n                    ERICA\n\n          I think that's talkin' about it.\n\n                    HARRY\n\n          I really didn't see all that much.\n\n\n\n\n                                                        48.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n              (heading toward her room)\n          Yip. There you go.\n\n                    HARRY\n\n          Okay. Won't mention it again but...\n\n                    ERICA\n\n              (almost out of the room)\n          Goin' to work, Harry.\n\n                    HARRY\n\n              (yells)\n          You saw my ass, you don't see me\n          acting nuts, wearing hats and\n          glasses and weird get ups...\nThe Sound of a DOOR SLAM. - Harry flinches.\n\n\n\n\n\n\n\nINT. HARRY'S BEDROOM\n\nHarry and Julian sit on the bed. Julian takes Harry's blood\npressure.\n\n                    HARRY\n\n          Yes or no. What's the deal, can I\n          go?\n\n                    JULIAN\n\n          You still getting dizzy?\n\n                    HARRY\n\n          Not as much.\n\n                    JULIAN\n\n          Out of breath?\n\n                    HARRY\n\n          Only sometimes.\n\n                    JULIAN\n\n              (listens with stethoscope)\n          How's Erica treating you?\n\n                       HARRY\n\n          Who?\n\n                     JULIAN\n\n              (nods toward Living Room)\n          Erica. . .\n\n                    HARRY\n\n          Her? Oh, she's a major piece of\n          work. The woman wears turtlenecks\n          in the middle of the summer.\n\n\n\n\n                                                      49.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY (CONT'D)\n\n          She's beyond uptight. Almost makes\n          her fun to be around.\n\n                    JULIAN\n\n          Uptight? That's funny. I haven't\n          noticed that.\n\n                    HARRY\n\n          Try livin' with her.\nJulian takes Harry's pulse.\n\n                    HARRY\n\n              (with secret glee)\n          I actually saw her naked last\n          night.\n\n                    JULIAN\n\n          That doesn't sound so uptight.\n\n                    HARRY\n\n          It was an accident. She thought I\n          was asleep, I thought her room was\n          the kitchen.\n\n                    JULIAN\n\n          You know what Freud said - there\n          are no accidents.\n\n                    HARRY\n\n          Trust me. This was an accident. Although,\n          why would she be walking around naked\n          when she knows I'm 20 feet away.\n\n                    JULIAN\n\n          Why would you think her bedroom was\n          the kitchen?\n\n                    HARRY\n\n          It was dark, it was two in the\n          morning.\n\n                    JULIAN\n\n          That could explain why she was walking\n          around naked. Deep breath...\n\n                    HARRY\n\n          You know I've never seen a woman\n          that age naked before.\n\n                    JULIAN\n\n          You're kidding?\n\n                    HARRY\n\n          Hey, we're not all doctors.\n\n\n\n\n                                                        50.\n\n\n\n\n\n\n\n\n\n\n\n                    JULIAN\n\n          Well, I think she's very beautiful\n          and she's a fantastic writer, you\n          know.\n\n                    HARRY\n\n          No, I don't know...\n\n                    JULIAN\n\n          Erica Barry? She's pretty major.\n              (writing a prescription)\n          So, you date her daughter?\n\n                     HARRY\n\n          Okay, now she's a great chick. Must take\n          after the father. Which reminds me...Doc,\n          what (about Mr. Midnight here. . ?\n                indicates his dick)\n          When can I be up and running in\n          that department?\n\n                    JULIAN\n\n          I think Mr. Midnight needs to stay\n          put for another couple of weeks.\n\n                    HARRY\n\n          But it won't kill me when I do it, right?\n\n                    JULIAN\n\n          It's exercise. It'll be good for you. And\n          just so you know, I'm told after a heart\n          attack, if you can climb a flight of\n          stairs, you can have sex.\n\n                                                  CUT TO:\n\n\n\n\n\n\n\n\nA LOW ANGLE OF A STAIRCASE\n\nWhich goes from the beach up to Erica's deck. Harry stands at\nthe bottom of the stairs in his robe, velvet slippers and\nsunglasses.' He looks up to the top of the stairs as if it's\nMt. Everest. Bravely, he climbs the first few steps. Not bad.\nAfter two more, he's out of breath. Determined, he holds onto\nthe railing and drags himself up to the next step. Happy with\nhimself, he holds on for dear life and drags himself up one\nmore...and then, he's so out of breath, he can barely move,\nyet he reaches up the railing and tries to hike himself up\none more.\n\n\n\n\n\n\n\nINT . KITCHEN - SAME TIME\n\nThe tea kettle WHISTLES as Erica and Julian stand on either\nside of her island. Erica reaches for a tea bag.\n\n\n\n\n                                                        51.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n          So, you're saying, he's not ready\n          to travel at all? Not even by\n          plane? Train?\n\n                    JULIAN\n\n          I don't think so...\n              (sees her disappointment)\n          It's been tough, huh?\n\n                    ERICA\n\n          Well, he fired the Nurse after an\n          hour, now says he doesn't need one.\n          He's a bit of a workout.. .yeah.\n\n                    JULIAN\n\n          How are you holding up?\n\n                    ERICA\n\n          Oh, fine. .I'm fine, I'm...\n\n                    JULIAN\n\n          One more fine and I won't believe you.\nThe Phone RINGS.\n\n                    ERICA\n\n          Oh, shoot, hold on...\n              (into phone)\n          Hello. Hey...Oh, hi...\n\n\n\n\n\n\n\nANGLE - JULIAN\n\nSmitten. Just something about her. Watching her.\n\n\n\n\n\n\n\nANGLE - ERICA\n\nNot noticing, pouring water for her tea.\n\n                    ERICA\n\n              (into phone)\n          No, I'm finally getting to it...\nErica sees Julian sliding a slip of paper over to her. Looks\nover at it. It's a piece of paper from his prescription pad.\nOn it is written...Have dinner with me tonight? Erica looks\nup at him. Stunned. J\n\n                     ULIAN\n\n              (heading out)\n          Pick you up around seven?\n\n                    ERICA\n\n          W-What about the patient?\n\n\n\n\n                                                          52.\n\n\n\n\n\n\n\n\n\n\n\n                    JULIAN\n\n          Like he said, he doesn't need a\n          nurse.\nWe begin to hear strains of another French song.\n\n\n\n\n\n\n\nINT. ERICA'S BEDROOM - LATE AFTERNOON - MUSIC OVER\n\nErica at her desk, typing. The Music plays from the CD\nplayer. As much as she doesn't want it to be true, this\nattention from Julian has fueled her.\n\n\n\n\n\n\n\nTHE LIVING ROOM - SAME TIME - MUSIC OVER\n\nHarry, dressed for the first time, wearing khaki's and a\nsummer shirt, strolls through the Living Room a bit cautious.\n\n                    HARRY\n\n              (yells, warning-like)\n          I'm Walking Around The house!\nERICA Laughs. Even she knows this is funny. Harry arrives at\nher open doorway, timidly pokes his head in.\n\n                    ERICA\n\n          Listen, I've decided to get over the\n          whole \"you saw me naked\" thing. So, we\n          don't have to deal with it anymore. Okay?\n\n                    HARRY\n\n          Good, 'cause I've been hiding from\n          you all day.\n\n                    ERICA\n\n          I know. You want to come in?\n\n                    HARRY\n\n          I don't want to break your rhythm\n          or anything.\n\n                    ERICA\n\n          That would be wishful thinking.\nHarry ENTERS cautiously and curiously.\n\n                    HARRY\n\n          Beautiful painting. So I'm gonna\n          venture out there and go for a\n          short walk...\n\n                    ERICA\n\n          You up to that?\n\n\n\n\n                                                        53.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          My doctor recommended it. I gotta\n          build up to stairs and stuff like\n          that. You wouldn't want to join me?\n\n                    ERICA\n\n          That means you don't want me to?\n\n                    HARRY\n\n          No, I was asking if you wanted to.\n\n                    ERICA\n\n          Oh, well, I would but...I don't\n          usually like to break once I've\n          started writing so I probably\n          shouldn't, not that a little fresh\n          air would hurt but...\n\n                    HARRY\n\n          It's just a walk Erica, not a\n          marriage proposal.\n\n                    ERICA\n\n          You know my name.\n\n                    HARRY\n\n          Erica Jane Barry. I looked you up\n          on the internet.\n\n\n\n\n\n\n\nEXT. BEACH - MOMENTS LATER - LATE .IN THE DAY\n\nErica and Harry walk by the water's edge. They are the only\ntwo people on the beach.\n\n                    HARRY\n\n          -- Did you know there are over eight\n          thousand websites that mention you?\n\n                    ERICA\n\n          That can't be possible.\n\n                    HARRY\n\n          No, it's true. I know everything\n          about you now. And not because of\n          last night, but...\n\n                    E\n\n\n                     RICA\n\n          Yeah, I understood. I actually\n          looked you up too. You grew up in\n          L.A., which I thought nobody did.\n\n\n\n\n                                                         54.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA (CONT'D)\n\n          You were the road manager for a group I\n          sorta never heard of, started your own\n          record label at 29, sold it at 45, then\n          started buying and selling boutique\n          companies then invested in a small record\n          company which you turned into the 2nd\n          largest Hip Hop label in the world.\n\n                    HARRY\n\n          It's exhausting just hearing about it.\n\n                    ERICA\n\n          I know, but the truth is, it goes\n          fast doesn't it?\n\n                    HARRY\n\n          Like the blink of an eye.\nErica bends down and picks up A FLAT WHITE STONE, then\nanother and another...\n\n                    HARRY\n\n          I noticed you have bowls of those\n          all over your house.\n\n                    ERICA\n\n          I know, I'm crazy, I just think\n          they're so beautiful...\n\n                    HARRY\n\n          But why do you only pick up the white\n          ones?\n\n                    ERICA\n\n          I don't only pick up the white ones.\n\n                    HARRY\n\n          Oh, so you really are crazy.\n\n                    ERICA\n\n          I pick up only the white ones?\n              (looks in her hand)\n          Oh, God, what does that mean? I'm\n          controlling, unadventurous, what?\n\n                    HARRY\n\n          So you're as hard on yourself as\n          you are on everyone else.\nErica is stunned that he caught on to that. Harry bends down,\npicks up a BROWN stone, places it in her palm among the white\nstones.\n\n                    HARRY\n\n          Something to remember me by.\n\n\n\n\n                                                        55.\n\n\n\n\n\n\n\n\n\n\nErica realizes she can't sum this guy up so easily or at all.\n\n                    ERICA\n\n          So can I ask you something Harry? What's\n          with all the young girls? I mean, what's\n          the story there, really?\n\n                    HARRY\n\n          I just like to travel light.\n\n                    ERICA\n\n          You just like to travel light? Oh,\n          please, what the hell does that mean?\n\n                    HARRY\n\n          Now see a thirty year old gets that.\n\n                    ERICA\n\n          You mean falls for that.\n\n                    HARRY\n\n          I mean, accepts it.\n\n                    ERICA\n\n          If that's what you want... a non\n          threatening woman, who won't get your\n          number, you get to run the show...\n\n                    HARRY\n\n          I think our relationship is growing\n          by the way. Have you noticed?\nThere he goes again. She can't believe he's cute like this.\n\n                    HARRY\n\n          I'm serious. Maybe we just needed to get\n          out of the house. Now, you may notice,\n          interestingly, we're walking back toward\n          the house and its getting a little rocky\n          again.\n\n                    ERICA\n\n          Of course it's getting a little\n          rocky, we're talking about you.\n\n                    HARRY\n\n          See, I'll accept that slight\n          hostility because I'm enjoying your\n          company so much.\n\nT\n\n hey're reached the bottom of the beach stairs. Harry looks\nup, daunted.\n\n                      ERICA\n\n          You okay?\n\n\n\n\n                                                           56.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          Yeah, but I think I'11 stay down here and\n          watch the sunset. You interested?\nErica checks her watch.\n\n                    HARRY\n\n          Big dinner date?\n\n                    ERICA\n\n          Well, yeah, as a matter of fact.\n          With your doctor.\n\n                    HARRY\n\n          Ohhhhh, my doctor, 'cause he's not\n          too young for you, huh?\n\n                    ERICA\n\n          No, he's totally too young for me.\n          But we're just having dinner. It's\n          not a date.\n\n                    HARRY\n\n          Does he know that?\n\n                    ERICA\n\n          Well, I'll tell him, but I doubt\n          that he thinks of it that way.\n\n                    HARRY\n\n          I doubt that you doubt that. Anyway, you\n          may like it. Think of it this way -- he's\n          not threatening, won't get your number,\n          you get to run the show. You might have a\n          hell of a time.\nOver, we HEAR, DING DONG.\n\n\n\n\n\n\n\nTHAT NIGHT - THE FRONT DOOR - SWINGS OPEN\n\nAnd we find Julian. Looking just as any girl would hope.\nDream Date.\n\nAND ON THE OTHER SIDE OF THE DOOR\n\nis Harry, in his robe and PJ's.\n\n                    JULIAN\n\n          Hey, look who's answering the door.\n\n                    HARRY\n\n          And look who's at the door.\n\n                    JULIAN\n\n          Brought you something.\n\n\n\n\n                                                        57.\n\n\n\n\n\n\n\n\n\n\nJulian hands him a take-out food box.\n\n                     JULIAN\n\n          A heart healthy dinner from our\n          cafeteria.\n\n                       ERICA (O.S.)\n\n          Hello...\nBoth guys turn at once. She looks beautiful, wearing a dress,\nprobably the sexiest one she owns. No turtleneck tonight.\nJulian walks to her, kisses her on the cheek.\n\n                    JULIAN\n\n          You look beautiful.\n\n                       ERICA\n\n          Thank you.\nBehind Julian's back Harry gives Erica the 'OK' sign.\n\n                    ERICA\n\n              (thrown)\n          We ready..?\n\n                    JULIAN\n\n          Let me just see how Harry's doing.\n          It'll take two seconds. Har, have a\n          seat. .\n\n\n\n\n\n\n\nANGLE - HARRY\n\nsitting, self-conscious in his new role - The Sick One.\nJulian takes his wrist, feels his pulse. Harry looks straight\nahead.\n\n\n\n\n\n\n\nWHAT HE SEES - ERICA'S LEGS\n\nas she sits right in front of him. She crosses her legs and\nher dress hikes up a little, exposing her thigh.\nJULIAN furrows his brow.\n\n                    HARRY\n\n          What? That's not the face you want\n          to see your doctor making.\n\n                     JULIAN\n\n          Your pulse is a little fast but\n          maybe you're just excited about\n          something.\nHarry LOOKS AT ERICA'S LEGS again.\n\n\n\n\n                                                         58.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n              (quickly)\n          I don't think so. I'm not excited\n          about anything.\nErica shifts, the hem of her skirt RISING even higher.\n\n                    JULIAN\n\n          There it goes again. Racing.\n\n                    HARRY\n\n          Doc... Impossible!\nErica rises, leaving Harry's eye-line.\n\n                    JULIAN\n\n          Oh, there we go, now I feel better.\n          Back to normal.\nHarry winces then rises, looks to Erica as she throws a\npashmina over her shoulders in SLOW MOTION. Harry rushes them\n\nOUT THE DOOR.\n\n\n                    HARRY\n\n          Okay, all right, good, have fun, don't\n          rush back for me and don't do anything I\n          wouldn't do.\n\n                    ERICA\n\n          Well that wouldn't leave us too\n          many options would it?\n\n                    HARRY\n\n          And do we wonder how she writes\n          that snappy repartee.\n              (whispers to Erica)\n          Let him pick up the check. It'll\n          make him feel older.\nOn Erica's shocked expression, the DOOR SLAMS.\n\n\n\n\n\n\n\nINT. LIVING ROOM - LATER THAT NIGHT - A BEN WEBSTER CD PLAYS\n\nHarry lies on the sofa. CAMERA MOVES UP Harry's body, past\nthe hospital take out carton on his stomach and finally up to\n\n                     M\n\nhis face. As the CAMERA moves we HEAR:\n\n                     ARIN (O.S.)\n\n          Hi, it's Marin, I'm not in so leave\n          a message and I'll call you back.\n\n                    HARRY\n\n          Hey, it's me...just sitting around\n          looking at your baby pictures...\n          Thinking about you...\n\n\n\n\n                                                          59.\n\n\n\n\n\n\n\n\n\n\nHe hangs up, dials another number.\n\n                    ANOTHER YOUNG WOMAN'S VOICE (O.S.)\n\n          Hi and HI, you've reached Brooke and\n          Shannon. For Brooke push one, for -\nHarry hangs up then slowly sits up, letting himself feel as\nfunky as he wants.\n\n                    HARRY\n\n          Everybody's out but old Har.. .Old, old\n          old old Har...\nHarry rises dizzily, crosses to the bookshelves. He rummages\naround, finds ERICA'S SCRAPBOOK, pulls it out, randomly opens\nit, finds a photo of Erica in the 70's, wearing a turtleneck.\nHarry smiles.\n\n\n\n\n\n\n\nINT. ERICA'S BEDROOM - MOMENTS LATER\n\nHarry wanders in with the scrapbook tucked under his arm. He\nnotices a bowl filled with white beach stones. Harry's brown\nstone sits at the top of the pile.\n\n                    HARRY\n\n              (complimented)\n          Top of the heap...\n\nCLOSE ON JULIAN\n\nStaring at Erica. He can't get enough of her. They're in a\nROMANTIC SEASIDE RESTAURANT. And Erica's blushing for the\nfirst time in twenty-five years.\n\n                    ERICA\n\n          -- So, when the land came up, I snatched it\n          and the house was built in record time and...\n              (blushing to death)\n          It's like a thousand degrees in here.\n\n                    JULIAN\n\n          You know, they say doctors fall for\n          people who need rescuing, that we have a\n          need to take care of someone.\n\n                    ERICA\n\n          Really? I never heard that one.\n              (starts fanning herself\n               with the menu)\n          Julian, how old are you, like...\n\n                    JULIAN\n\n          -- Thirty-three.\n\n\n\n\n                                              60.\n\n\n\n\n\n\n\n\n\n\n\n          ERICA\n\nThirty-three.-Okay, so, I'm twenty years\nolder than you. More than twenty years\nolder than you.\n\n          JULIAN\n\nYou look fabulous.\n\n            ERICA\n\nThank you   but you know, I'm not sure\nwhere you   were headed with that thing you\nwere just   saying, but in terms of us, you\njust want   to be friends, right?\n\n          JULIAN\n\nHonestly? No.\n\n          ERICA\n\nWell, then, what is it that you...\nwant to be?\n\n          J\n\n\n           ULIAN\n\nI think I'd embarrass you if I told\nyou.\n\n          ERICA\n\nI was embarrassed just getting\ndressed to see you.\n\n          JULIAN\n\nThis may surprise you but some\nwomen consider me quite the guy.\nI've never been married. I'm a\ndoctor. You wouldn't believe what\ncatnip that is for some women.\n\n          ERICA\n\nOh yes I would. But, you don't like\ngirls your own age?\n\n          JULIAN\n\nI do very much. But I've never met one\nI've taken to quite like this and when\nsomething happens to you that's never\nhappened to you before, don't you have to\nat least find out what it is?\n\n          ERICA\n\nI suppose but, see, I don't date\nall that much or all that well...\n\n          JULIAN\n\nOh, come on, you must beat them\naway with a stick.\n\n\n\n\n                                                          61.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n          Now you're kidding, right? No, guys\n          my age, the ones I've met...well,\n          I'm not that regular a person and\n          they really like regular.\n\n                    JULIAN\n\n          Men your age may be really stupid,\n          you ever think of that?\n              (takes her hand)\n\n                    ERICA\n\n          Yes I have. Many times.\n\n                    JULIAN\n\n              (looks from her hand to\n               her eyes)\n          There's something radically wrong with\n          the idea that no one loves you.\nOw. Right to the middle of her shoulder, then her neck.\nJulian kisses her palm, then her.\n\n                    JULIAN\n\n          I knew you'd smell good.\n\n                    ERICA\n\n          It's just...soap...\n\n                    JULIAN\n\n          How much is soap that smells like this?\n\n                    ERICA\n\n          I don't know. I got it at the market.\n\n                    JULIAN\n\n          Erica, you're incredibly sexy.\n\n                    ERICA\n\n          No, swear to God, I'm not...\n\n\n\n\n\n\n\nMEANWHILE, HARRY IS SOUND ASLEEP ON ERICA'S BED\n\nHer scrapbook open against his chest. We HEAR the SOUND OF\nACAR pulling up to the house. Harry wakes up. Oh shit.   He\nleaps out of bed, this is the fastest he's moved in days. A\nbit disoriented, he straightens the covers, looks around for\nother evidence then hightails it out of there.\n\n\n\n\n\n\n\nINT. LIVING ROOM - A MOMENT LATER\n\nErica enters, letting out a huge sigh. She's brought back to\nreality when she hears the TV in Harry's room. She heads his\nway, then changes her mind and stops.\n\n\n\n\n                                                        62.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n              (yells)\n          I'm back...\n\n                    HARRY (O.S.)\n\n          You have fun?\n\n                    ERICA\n\n          It was interesting. So... Good night.\n\n\n\n\n\n\n\nINT. HARRY'S ROOM - SAME TIME\n\nHarry's in bed, clearly disappointed that she didn't stop in.\n\n                    HARRY\n\n              (yells)\n          'Night...\n\n\n\n\n\n\n\nINT. ERICA'S BEDROOM - LATER\n\nErica, in pj's and glasses, sits at her laptop, writing. She\nhears the CHIME of someone INSTANT MESSENGERING HER. It a\nmessage from HARRYL37. It says: What R U doing?\n\nW\n\n e go BACK AND FORTH between their TWO ROOMS.\nShe answers: Writing. Hi. What R U doing?\nHe writes: Watching Joan Rivers sell jewelry.\nErica laughs when he adds: So was your date a date?\nShe types: I think so...\nHe types: I told ya. (then) You hungry?\nSurprised, she types: I just had dinner.\nHe writes: Yeah, but women never eat on dates.\n\n                    ERICA\n\n              (to herself)\n          How does he know everything!\nShe hesitates then types: Actually am a little hungry but,\nI'm in my pjs.\nHe writes: Me too. Pajama party?\nSHE stares at the screen biting her lip. HE does the same.\n\n\n\n\n                                                        63.\n\n\n\n\n\n\n\n\n\n\nErica rises, LOOKS IN THE MIRROR, checks out her boobs in her\npajamas. They look so low. She opens a drawer, rifles through it,\ntakes out a bra, takes out a better bra.\nIN HIS BATHROOM, Harry fixes his hair, tries to make more of it\nthan he has.\nErica now wearing a bra under he pajamas, checks out her boobs\nagain. Better. She adjusts the straps. Lifts them higher.\n\n\n\n\n\n\n\nINT. LIVING ROOM\n\nErica and Harry ENTER FROM OPPOSITE SIDES OF THE ROOM, both in\ntheir pajamas.\n\n                    HARRY\n\n          We are cute...\n\n                    ERICA\n\n          This is pretty unusual for me.   I'm not\n          used to having sleepovers.\n\n                       HARRY\n\n          Me either.\n\n                    ERICA\n\n          Really? With your social life?\n\n                    HARRY\n\n          My, dear, you are confusing sex with sleeping.\n          Sleeping is something I prefer to do alone.\n\n                    ERICA\n\n          Okay, good to know.\n              (heading for the kitchen)\n          So, what are you hungry for?\n\n                    HARRY\n\n              (joining her)\n          What are my choices? I mean I know you\n          think I'm not very discriminating but...\nShe looks through the fridge.\n\n                    ERICA\n\n          Oh, God, what's the difference what I\n          think. I can't imagine what you think of\n          me. Okay, so... Pasta, left over coq au\n          vin, turkey sandwich or grilled cheese.\n\n                       HARRY\n\n          Pancakes.\n\n                    ERICA\n\n          Totally what I wanted. Blueberries?\n\n\n\n\n                                                      64.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          You ever miss being married? I bet you\n          were great at it.\n\n                    ERICA\n\n          Sometimes I miss it. At night.. But not\n          that much anymore. Was one of us just\n          saying something interesting?\n\n                    HARRY\n\n          You said you can't imagine what I think\n          of you.\n\n                    ERICA\n\n          Oh, right, but you don't have to answer\n          that.\n\n                    HARRY\n\n          Okay.\n\n                    ERICA\n\n          I mean, if you had an opinion, I'd be\n          curious but...'\n\n                    HARRY\n\n          will you tell me first why you only\n          miss being married at night?\n\n                    ERICA\n\n              (cracking eggs)\n          Oh, 'cause the phone doesn't ring as much\n          at night and the \"alone\" thing happens at\n          night and sleeping by myself took some\n          getting used to. But I got the hang of\n          it. You gotta sleep in the middle of the\n          bed. It's absolutely not healthy to have\n          a side when no one has the other side.\nShe starts mixing the batter.\n\n                    HARRY\n\n          Okay, now I'm convinced what I\n          think of you is right.\n              (Erica waits. . . )\n          You are a tower of strength.\n\n                    ERICA\n\n              (shoulders sagging)\n          Ughhhhhhhhhh... .\n\n                    HARRY\n\n          Try not to rate my answer.\n\n                    ERICA\n\n          I'm sorry. It's just...I'm sorry.\n\n\n\n\n                                                        65.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          You're like a thoroughbred in a world of\n          mutts. No, you know what you are, you're\n          like a great portrait over a fireplace.\n          Words have been invented to describe\n          women like you.\n\n                    ERICA\n\n              ( fearful)\n          Such as?\n\n                     HARRY\n\n          Flinty   and...Impervious.\n\n                    ERICA\n\n          So you think I'm inhuman.\n\n                    HARRY\n\n          No. I think you're formidable.\n\n                    ERICA\n\n          But cold and distant. Like I'm\n          frozen in some painting...\n\n                    HARRY\n\n          Not at all. I think you're strength\n          defines you.\n              (sees how sensitive she\n               is)\n          But it's thrilling when your defenses are\n          down arid you're not isolated. That, I\n          believe, is your winning combo. A killer\n          combo actually.\n\n                    ERICA\n\n          ... So I can't decide if you hate me or if\n          maybe you're the only person who ever got\n          me.\n\n                    HARRY\n\n          I don't hate you.\nThe moment is broken when they HEAR the FRONT DOOR OPEN and\n\nHIGH HEELS APPROACHING.\n\n\n                    ERICA\n\n          Hello?\nMarin ARRIVES IN THE DOORWAY in a knockout of a dress holding\na bag from Zabars. She looks fresh, vibrant, sexy.\n\n                    MARIN\n\n          Room service!\n\n                    ERICA\n\n          What are you doing here at this hour?\n\n\n\n\n                                                        66.\n\n\n\n\n\n\n\n\n\n\nErica and Harry have the air of kids caught making out by one\nof their parents. Harry straightens out his pajamas, smooths\ndown his hair. Erica catches all this.\n\n                    MARIN\n\n              (enters, kisses Erica)\n\n          I\n\n            had this big photography auction\n          tonight, then I went out with a\n          bunch of people, I checked my\n          messages and got this so sad\n          message from Harry so bored out\n          here. I thought I should come out\n          and at least see how he was doing.\n              (kisses Harry on the\n               cheek)\n          Thank you for the gorgeous flowers\n          by the way. They were so huge...\nErica nods to herself. Oh, God, he sends them all flowers.\nHarry notes Erica's reaction.\n\n                    MARIN\n\n          So how are you guys?\n              (sets down the Zabar's\n               bag)\n          Oh, this is too sweet. You're making\n          pancakes? Awwww. And you're both in your\n          pj's. Now I feel I'm interrupting.\n\n                    ERICA\n\n          Don't be silly. You know I never\n          sleep and this one doesn't sleep\n          either. It's... .What's in the\n          bag?\n\n                    MARIN\n\n              (reaches into the bag)\n          A quart of matzoh ball soup for\n          Harry. I know it's not the remedy\n          for heart problems but it is low\n          cholesterol.\n\n                    ERICA\n\n              (hating to correct her)\n          But high sodium.\n\n                    MARIN\n\n          Oh, sorry. Stupid. For Mom, your\n          favorite raisin-bread. And for\n          me...\n              (reaches into the bag)\n          My favorite Vodka.\nMarin's cell phone RINGS.\n\n\n\n\n                                                          67.\n\n\n\n\n\n\n\n\n\n\n\n                    MARIN\n\n              (into phone)\n          Hello? No I'm here, babe. Made record\n          time. Everyone's still there?\nErica feeling suddenly frumpy, fixes her hair. Harry watches\nher. She catches him and shrugs. Marin flips her phone shut\nand tosses it in her purse.\n\n                    ERICA\n\n          So, Mar, now that you're here, why\n          don't you finish the pancakes and\n          I'll get back to work...\n\n                    MARIN\n\n          Mom! I just got here, hold on.\nShe pours a healthy Vodka into a glass, grabs some ice.\n\n                    MARIN\n\n          So your ex-husband stood me up\n          today. We were supposed to have\n          lunch at Barneys . He never showed\n          up. Was he always like this?\n\n                    ERICA\n\n          Honey, I don't know...\n\n                    MARIN\n\n          This is what happens after a couple\n          gets divorced, the kid inherits all\n          the problems. Not that I'm a kid.\n              (then to Harry, the flirt\n               in her coming back)\n          So how are you, how do you feel?\n          When can you go home?\nJust as harry is about to answer, Marin's cell RINGS. She\npicks it up, looks at her caller ID, throws it back in her\nbag.\n\n                     ERICA\n\n          I really am gonna do a little work.\n          . . you two catch up. . . and just\n          flip these Hin like two seconds.\n\n                     ARRY\n\n          You don't want pancakes anymore?\n\n                    ERICA\n\n          I, uh, I don't think I...I...\n              (looks at Marin so)\n          gorgeous, next to him\n          No. I don't.\n\n\n\n\n                                                        68.\n\n\n\n\n\n\n\n\n\n\nMarin watches her mother EXIT then looks to Harry, his eyes\nfollowing her Mom out the door. She's sees a look on Harry's\nface she never remotely saw when he looked at her. At first\nshe's shocked. He likes my mother??? Then a flash of\njealousy. He likes my mother!?! Then pure joy - realizing how\nperfect it is.\n\n\n\n\n\n\n\nINT. BRIDGEHAMPTON GENERAL STORE - DAY\n\nErica, back in a turtleneck, picks peaches out of a basket.\nMarin ENTERS HER FRAME, baseball cap, sunglasses, picking\ncherries.\n\n                    MARIN\n\n          I'm breaking up with Harry.\n\n                    ERICA\n\n          Why? What do you mean?\n\n                    MARIN\n\n          'Cause I met someone else.\n\n                    ERICA\n\n          In the two days you've been gone?\n\n                    MARIN\n\n          You know me, my life's crazy. I meet a\n          thousand people everyday. Also, let's\n          face it, the guy's insanely old for me.\n          I'd be nuts to keep this going.\n\n                    ERICA\n\n          True, but you know he is....\n\n                    MARIN\n\n          -- I know. He's soulful when you\n          don't expect it, right?\n\n                    ERICA\n\n          It's unnerving.\n\n                    MARIN\n\n          Now, Mom, if you could handle this,\n          I was thinking... you and Harry...\n\n                     ERICA\n\n          I can't handle it. Wouldn't want to\n          handle it.\n\n                    MARIN\n\n          But you're only saying that 'cause\n          you think he and I have had sex.\n\n                    ERICA\n\n          Yes. Lower your voice. Haven't you?\n\n\n\n\n                                                        69.\n\n\n\n\n\n\n\n\n\n\n\n                    MARIN\n\n              (whispering)\n          Never even got close. Swear to God.\n              (Erica digests this)\n          Just puttin' that out there...'cause for\n          two people who are convinced they got\n          life beat, there's was somethin' cooking\n          in the kitchen last night other than\n          pancakes.\n\n\n\n\n\n\n\nINT. ERICA'S KITCHEN\n\nErica looks out her KITCHEN WINDOW and SEES Marin and Harry\nTALKING ON THE BEACH. She leans so far to see them, she's\nabout to lose her balance. The Phone RINGS, she reaches for\nit and slips right Out Of Frame.\n\n                    ERICA (O.S.)\n\n              (into phone)\n          Hello.\n\n\n\n\n\n\n\nINT. HOSPITAL CORRIDOR\n\nJulian, in his scrubs, walks quickly down a hallway of the\n\n                     J\n\nER, on his CELL PHONE.\n\n                     ULIAN\n\n          I've waited a reasonable amount of hours\n          before calling you, even though you've\n          been on my mind since I woke up at 5:15.\n          I'm wondering when we could have dinner\n          again? I have to work the next few nights\n          and if we wait 'til next week, I know\n          you'll chicken out so how's Friday? I\n          know it's like a date night but I think\n          that's good.\n\n                    ERICA\n\n          Who is this?\nJulian stops short.\n\n                    ERICA\n\n          I'm kidding!\n\n                    JULIAN\n\n          Can you meet me at The Grill at\n          eight?\n\n                    ERICA\n\n          Okay. Yes. That's seems fine.\n\n\n\n\nI\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                          70.\n\n\n\n\n\n\n\n\n\n\n\n                    JULIAN\n\n          I look forward to, seeing you too.\nErica smiles to herself.\n\n\n\n\n\n\n\nON JULIAN - AS HE LEANS AGAINST A WALL\n\nturning off the phone and grabbing his heart\n\n NT. ERICA'S KITCHEN\n\nMarin ENTERS through the kitchen door, looking almost a\nlittle dazed.\n\n                    MARIN\n\n          Okay, he's all yours.\n\n                    ERICA\n\n          Stop that. How'd he take it?\n\n                    MARIN\n\n          He just took care of it for me; He\n          was an ace. Elegant. Said our fate\n          was to be friends. ...Oh my God.\n              (realizes something)\n          He was breaking up with me. He's a\n          genius.\n\n                    ERICA\n\n          That's impossible, he wouldn't...\n\n                    MARIN\n\n          It doesn't matter, we're done and\n          we both feel good about it.\n              (hugs her)\n          I gotta get back.\n              (as she exits)\n          Now Erica, try to think of this as\n          the smartest thing you've ever done\n          for yourself.\nMarin EXITS and the PHONE RINGS.\n\n                    ERICA\n\n              (into the phone)\n          Hello.\n\n                    HARRY\n\n          (from the beach)\n          Thought you'd like to know your\n          daughter broke up with me.\nHarry and Erica talk while looking at each other through the\nKitchen Window.\n\n\n\n\n                                                        71.\n\n\n\n\n\n\n\n\n\n\n\n                     ERICA\n\n          I heard.\n\n                    HARRY\n\n          Made up a story about meeting another\n          guy. Guess I wasn't so cute with an IV in\n          my arm.\n\n                    ERICA\n\n          No, I think she really did meet\n          someone else.\n\n                    HARRY\n\n          Hey, it's alright. Her mother\n          didn't like me anyway.\n\n                    ERICA\n\n              (smiles)\n          How 'bout I bring you out some\n          lunch and a couple of blood\n\n                    H\n\n          pressure pills?\n\n                     ARRY\n\n          You're a great woman, Erica.\n              (Erica relaxes)\n          Is this why my doctor is falling in\n          love with you?\n\nTHE BEACH - MUSIC OVER\n\nErica and Harry sit on a blanket on a cloudy day having a\npicnic lunch. Harry is telling Erica a story and she screams\nwith laughter.\n\nBROWN STONES IN THE SAND - MUSIC CONTINUES\n\nErica picks them up as.she walks with Harry by the water's\nedge. They talk non-stop.\n\nA LITTLE LATER - LIGHTNING STREAKS THE SKY\n\nOut of nowhere, a downpour. Erica and Harry gather their\npicnic things. The blanket starts to fly and Harry grabs it\nas Erica runs after a plate spinning away in the wind.\n\nINT. LIVING ROOM - MOMENTS LATER\n\nErica and Harry, wet from the rain, quickly shut all the\ndoors and windows. Lightning crackles across the sky and THE\n\nLIGHTS IN THE HOUSE GO OUT.\n\n\nA MATCH IS STRUCK\n\nand a CANDLE is lit. Then ANOTHER ONE, and ANOTHER ONE. Erica\nturns and finds Harry just looking at her. Before either of\nthem has time to think, they kiss.\n\n\n\n\n                                                        72.\n\n\n\n\n\n\n\n\n\n\n\n                       ERICA\n\n          I'm sorry.\n\n                    HARRY\n\n              (truly confused)\n          For what?\n\n                    ERICA\n\n          I just kissed you.\n\n                    HARRY\n\n          No, honey, I kissed you.\nRelieyed, Erica kisses him.\n\n                    ERICA\n\n          I know that one was me.\n\n                    HARRY\n\n          Try not to keep score.\nHe kisses her again and again.\n\n                    HARRY\n\n          Soft lips...\n\n                    ERICA\n\n          I'm so glad they still work.\nI haven't used them for kissing in so long. They've been more\nlike for wearing lipstick and whistling and...\nHe kisses her quiet. Relieved, she finally fully kisses him\nback. A big gorgeo~s kiss.\n\n                    HARRY\n\n          Well, well, now look who's got\nsomething that works...\nThey both look down at Harry. Hello, Mr. Midnight.\n\n                    ERICA\n\n          And you didn't even take Via-\n\n                     HARRY\n\n              (puts his finger on her\n               lips)\n          Kiss me before you make it go away.\n\nS\n\n he kisses him long and sweet.\n\nERICA'S BED\n\nThey're kissing on it. The rain pelts against the windows as\nthe sun goes down.\n\n\n\n\n                                                        73.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          This could be world class\n          interesting.\n              (Erica nods)\n          Having any doubts?\n\n                       ERICA\n\n                 (as they kiss)\n          Yes.\n\n                       HARRY\n\n          Me too.\n\n                    ERICA\n\n          But so far the kissing is\n          spectacular.\n              (He looks at her)\n          I'm not grading you, just\n          mentioning it. Brilliant.\nHe tries to kiss her neck but the turtleneck is in the way.\nHe pulls it down, but it's tight and it's, difficult to get\nto her.\n\n                    HARRY\n\n          Can't get past your damn\n          turtleneck. . .\nHe tries lifting the shirt from the bottom, it's awkward, he\ndoesn't want to be down there yet. He comes back up when\nErica reaches to her night table, slides opens the drawer,\ntakes out a SCISSORS and hands it to him.\n\n                    ERICA\n\n              (breathless)\n          Cut it off... Please.\nWhat a brilliant invitation. He takes the scissors and starts\ncutting from the bottom, right past her belly, up her torso,\nbetween her breasts. The turtleneck falls open from the\ncenter. When he reaches her neck, he gently tears at it and\nit easily rips apart and there she is. He takes her in.\n\n                    HARRY\n\n          You're beautiful.\nShe shakes her head, 'no' ...shuts her eyes.\n\n                    HARRY\n\n          Open your eyes so I know you can hear me.\n              (she opens her eyes)\n          Beautiful...\nThey kiss and she reaches down for his pants.\n\n\n\n\n                                                        74.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          What about birth control?\n\n                       ERICA\n\n          Menopause.\n\n                    HARRY\n\n              (thrilled)\n          Who's the lucky boy...\nHe kisses between her breasts, her stomach, heads down and\nOUT OF FRAME. Erica can't quite believe life held this twist\nfor her. Then:,\n\n                    ERICA\n\n          I think we should take your blood\n          pressure.\nHis head POPS BACK INTO FRAME. What?????\n\n                    ERICA\n\n          It's irresponsible not to.\n\nH\n\n\n ARRY -' A MINUTE LATER\n\nsprawled out on the bed. Erica straddles him and whips the\nblood pressure cuff on his arm and pumps it hard. Like a warm\nJewish Mother of a Dominatrix. He looks up at her, shaking\nhis head...\n\n                    HARRY\n\n          Nobody but you would. . .\n\n                    ERICA\n\n          Yeah...so you're lucky.\nErica grabs Harry's glasses, reads the results.\n\n                    ERICA\n\n              (ecstatic)\n          One twenty over eighty!!! Baby!\n\n\n\n\n\n\n\nTHE BLOOD PRESSURE CUFF - IN SLOW MOTION\n\nhurdles recklessly into the air.\n\nEXT. HOUSE - NIGHT - LATER\n\nThe rain is coming down in torrents.\n\nINSIDE\n\nWe are CLOSE ON ERICA'S FACE - UPSIDE DOWN, hanging off the\nside of the bed. She's sweaty, flushed, overwhelmed...\n\n\n\n\n                                                           75.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n          Oh my God, I do like sex.\nCAMERA TWIRLS AROUND and we FIND HARRY, sprawled nearby,\ncatching his breath, satisfied, stunned, scared.\n\n                    HARRY\n\n          You certainly do.\nErica arrives next to him, also out of breath.\n\n                    ERICA\n\n          Wow. So this is what you're supposed to\n          do on a rainy afternoon...\nHarry smiles. He's trying to be his debonair self but\nsomething's off. He's very aware of himself. They lie there\nquietly for a second when Erica begins to tear up. Harry\nslowly, nervously turns to her.\n\n                    ERICA\n\n          I really thought I was sorta closed for\n          business. Just never expected this.\n\n                     HARRY\n\n              (nods)\n          Nothin's ever surprised me more...\nFlattered, Erica snuggles up close. Harry puts his arm around\nher. Then, with no warning, his eyes fill with tears.\n\n                    HARRY\n\n          This is crazy. I can't remember the last\n          time I cried. I think I'm overwhelmed.\n\n                    ERICA\n\n              (crying with him)\n          Me too. That's the perfect word.\n\n                    HARRY\n\n          Baby, I had sex three days after a heart\n          attack and I didn't die!\nErica pauses. Oh. That kind of overwhelmed.\n\n                    HARRY\n\n          That's gotta be some kind of record.\nGood sport Erica gives him a double thumbs up.\n\n                    ERICA\n\n              (wiping her tears)\n          Let's not brag about this to our\n          doctor, okay?\n\n\n\n\n                                                           76.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          Honey I may not be many things but one -\n          thing I am is a gentleman.\nHarry holds her close.\n\n                    HARRY\n\n          Erica, Erica, Erica.\n              (she turns to him)\n          You know I'm not good at being\n          monogamous, right?\n\n                    ERICA\n\n          Monogamous? Please, I hardly know\n          you.\nHe looks at her wondering if she's for real. She smiles as\nshe wipes a small tear from the corner of her eye. Then he\nkisses her.\n\nLATER - THEY'RE HUDDLED UNDER THE COVERS\n\n\nC\n\n ozy. Candles light the room. It's still raining.\n\n                    HARRY\n\n          -- So there I was at nineteen, in New\n          York, by myself, and I'd never seen snow\n          before and I didn't have enough money for\n          the bus, so I had to walk. Had no idea\n          how far it was and I'm talking blizzard\n          and I'm in sneakers.\n\n                    ERICA\n\n          Awwwww,. . .\n\nLATER - THEY'RE LYING ON A CHAISE\n\nin Erica's room, making out. A Cell Phone RINGS. They both\nlook around for it. Erica reaches for it on her desk.\n\n                    ERICA\n\n              (disoriented)\n          Hello? I mean...Hello.\n              (turns phone upside down)\n          Hello.\n\n\n\n\n\n\n\nINTERCUT WITH MARIN IN A TAXI IN THE CITY - IT'S POURING\n\n\n                    MARIN\n\n          Mom, you guys okay out there?\n\n                    ERICA\n\n          We're fine. Why? What's going on?\n\n\n\n\n                                                        77.\n\n\n\n\n\n\n\n\n\n\n\n                    MARIN\n\n          What do you mean, it's like a\n          hurricane. The news said the winds\n          are like a zillion miles an hour.\n\n                    ERICA\n\n          Oh, that. Oh, no, we're fine...\n\n\n\n\n                    MARIN\n\n          Are you having sex? Tell the truth.\n          You are, aren't you.\n\n                    ERICA\n\n          Absolutely not. No. That is not\n          going on now.\n\n                    MARIN\n\n          Oh my God, you already did it. Was\n          it amazing?\n\n                    ERICA\n\n          I have to go.\n\n                    MARIN\n\n          Just tell me, was it amazing?\n\n                    ERICA\n\n          Yes and thank you for the wonderful\n          opportunity.\nMarin SCREAMMMMMMMMMMMS. Erica flips the phone shut, looks to\nHarry, embarassed.\n\n                    ERICA\n\n              (to Harry)\n          Am I interested in buying aluminum\n          siding. . .\n\n                    HARRY\n\n          Really? Marin's selling aluminum siding?\nErica buries her face in his chest.\n\nLATER\n\nHarry and Erica SIT ON STOOLS AT THE KITCHEN ISLAND, drinking\nwine and eating scrambled eggs right out of the pan. Candles\nlight the room.\n\n                    HARRY\n\n          --But why Paris?\n\n                    ERICA\n\n          I just always wanted to write a play that\n          ended there.\n\n\n\n\n                                                        78.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA (CONT'D)\n\n          People need romance like that. And if\n          someone like me doesn't write it, where\n          they gonna get it? Real life?\n\n                    HARRY\n\n              (slightly insulted)\n          Excuse me. What do you call this? Eating\n          eggs by candlelight in our robes after...\nShe kisses him, starts to say, \"I'm sorry\" when he pulls her\nback, kisses her again, then looks at her hard, perplexed.\n\nCLIMBING BACK UNDER THE COVERS\n\n\n                    HARRY\n\n          So where do you like to eat in\n          Paris?    E\n\n                     RICA\n\n          Oh, I love this place called Le Balzar,\n          it's just a little bistro on the Left\n          Bank, best roast chicken in the universe.\n\n                    HARRY\n\n          You'd be fun to go to Paris with.\n\n                     ERICA\n\n          It's a great city to stay up all\n          night in.\n              (then)\n          When's your birthday?\n\n                      HARRY\n\n          February.\n\n                    ERICA\n\n          Mine's in January. So, how 'bout if we\n          still know each other by then we go to\n          Paris for our birthdays.\n\n                     HARRY\n\n              (a beat, then)\n          Maybe. . .\n\n                    ERICA\n\n          Oh. Sorry. You just...\n              (sees the look on his\n              face) .\n          I have no idea how to do this...be\n          intimate but not...The color is draining\n          from your face. Okay, look, I'm gonna\n          pee,take one of your blood pressure pills\n          then when I get back, let's not talk\n          anymore.\n\n\n\n\n                                                          79.\n\n\n\n\n\n\n\n\n\n\nShe gets out of bed.\n\n                    HARRY\n\n          You're the funniest girl I ever had\n          sex with.\nShe has no idea how to take that. Decides to accept it.\n\n                    ERICA\n\n          That's somethin'...\n\n                       HARRY\n\n          Honey... ?\nShe turns, sees he's getting out of bed, approaching her.\n\n                    HARRY\n\n          I think I'm gonna go back to my\n          room...let you sleep.\n\n                     ERICA\n\n          Let me sleep? Oh, right...you usually\n          send the girls home. . .but I am home...\n          so...okay.\n\n                    HARRY\n\n          I'm an old dog, you' know.\n\n                    ERICA\n\n          Hey, it's perfectly. .. whatever.\n          Good night. This was..This was a\n          great night. For me...\n\n                    HARRY\n\n          Me too. At one point I even thought\n          soul mates, you know...\nErica nods. She knows.\n\nHARRY FLOPS ONTO HIS BED\n\nstares straight up at the ceiling.\n\nINT. ERICA'S ROOM - SAME TIME\n\nErica gets back in her bed. She lies there for a\nsecond,securing her armor back in place. She routinely moves\nto the middle of the bed,neatens out the covers and shuts her\neyes. Then a small KNOCK on her open door. She sees Harry in\nthe doorway.\n\n                    HARRY\n\n          I'd like to try sleeping with you.\n\n\n\n\nI\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                          80.\n\n\n\n\n\n\n\n\n\n\nErica hesitates, then moves to one side of the bed and as\nHarry climbs in next to her we:\n\n                                          FADE THRU TO:\n\n\nEXT. HOUSE - THE FOLLOWING MORNING\n\nThe place is a mess, the aftermath of the storm.\n\nHNT. ERICA'S BEDROOM - THE SAME TIME\n\n arry spoons with Erica on her side of 'the bed, his arms\nsnuggly around her. The ELECTRICITY POPS BAGK ON and the room\nis suddenly lit up and one of Erica's French CDs comes on\nfull blast.\nHarry opens his eyes. He's surprised to see he has his arm\naround her. Erica awakens just as surprised. In the light of\nday, a definite hint of embarrassment ...\n\n                    HARRY\n\n              (grabs his watch, blinks)\n          Can you see this?\n\n                    ERICA\n\n          Not really but it looks like it\n          says eleven.\n\n                    HARRY\n\n              (slips on his glasses)\n          It is eleven...\n\n                    ERICA\n\n          It can't be, that would mean we\n          slept eight hours.\n\n                    HARRY\n\n          Impossible.\nThey turn and finally look at each other. Both look wrinkled,\nmessy haired, a little wiped.\n\n                    HARRY\n\n          How ya doin' Ace?\n              (she ,elts as he lies\n               right back down)\n          Whoa Nelly...little dizzy.\n\n                    ERICA\n\n          Okay, just stay still, here's the\n          clicker. You know you have a\n          doctor's appointmQnt in an hour.\n              (getting out of bed)\n\n              (MORE )\n\n\n\n\n\n                                                        81.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA (CONT'D)\n\n          I'll make us some coffee, get you your\n          pills, whip us up some french toast, I\n          have ,the best maple syrup ever. '\n\n                    HARRY\n\n          Erica...\n              (she turns)\n          You are a woman to love.\nErica smiles, then walks away with the achey walk of a woman\nwho hasn't had sex in many a year but has more than made up\nfor it in the last 12 hours. She holds onto the wall as she\nexits the room, a little bow-legged, like she's just gotten\noff a horse. Alone in the hallway, she stops.\n\n                    ERICA\n\n          You are woman to love. What the\n          hell does that mean?\n\nAN EKG MACHINE\n\nSpits out a long tape. TILT UP to Julian at the end of the\ntape. Harry sits on an examining table in JULIAN'S OFFICE,\nbuttoning up his shirt.\n\n                    JULIAN\n\n          Okay, buddy, I'm sending you home. These\n          past few days have done wonders for you.\n\n                    HARRY\n\n          Yeah, I've been working on that stair\n          thing. I can do it by the way.\n\n                    J\n\n\n                     ULIAN\n\n          Do what?\n\n                    HARRY\n\n              (quickly)\n          Climb a flight of stairs. Several times\n          actually.\nHarry stands, tucks in his shirt, smiling proudly to himself.\n\n                    JULIAN\n\n          Way to go. How's Erica?\n\n                    HARRY\n\n              (caught)\n          Erica?\n\n                    JULIAN\n\n          I know you must know her name by\n          now.\n\n\n\n\n                                                        82.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          Yes, I do. Erica, as it turns out\n          is an amazing woman. Does whatever\n          she can to make me happy. Really.\n          Turns out she's very giving.\nJulian, suddenly riveted to these words.\n\n                    HARRY\n\n          Very giving.\n\n                    JULIAN\n\n              (looking away)\n          Yeah, well that's wonderful. I\n          think she's wonderful.\nA real moment between them. Julian decides to take the high\nroad.\n\n                    HARRY\n\n          I think she's wonderful too.\n\n                    JULIAN\n\n              (gathering his things)\n          Give her my best...\n\n                    HARRY\n\n          Julian. Thanks for everything.\nJulian shakes Harry's hand. Harry's eyes TEAR UP.\n\n                    JULIAN\n\n          You're gonna be okay.\n\n                    HARRY\n\n              (touching his tears)\n          What the...? This is the second\n          time I've done this now. I get\n          overcome or something. . .\n\n                    JULIAN\n\n          It's very common to become emotional\n          after having an episode like you've had.\n          Everything takes on a new meaning.\n\n                    HARRY\n\n              (wiping his tears)\n          So it's not crazy for a man to do\n          something entirely out of character\n          after having a heart attack?\n\n                    JULIAN\n\n              (handing him Kleenex)\n          Like crying?\n\n\n\n\n                                                        83.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          Yeah and totally changing their\n          tastes. Like suddenly really liking\n          something they never thought they\n          could like...ever...and I'm talking\n          really liking it. It's...unnerving.\n\n                    JULIAN\n\n          I think you can expect just about\n          anything right now. People have done some\n          wild things after having a heart\n          attack...selling businesses, getting\n          divorced, moving... Some people say it\n          saved their lives.\n\n                    HARRY\n\n          But most people go back to being\n          themselves, right? I'll go back to\n          being me, won't I?\n\n                    J\n\n\n                        ULIAN\n\n          We'll see.\n\n\n\n\n\n\n\nERICA - TYPING - HER PHONE RINGS\n\nShe wears a blouse with more buttons unbuttoned than ever in\nher life. She picks up the phone.\n\nHARRY DRIVES ERICA'S CAR, TOP DOWN.\n\n\n                       HARRY\n\n                 (on his cell)\n          Hi.\n\n                      ERICA\n\n          Hey.    What'd he say?\n\n                    HARRY\n\n          He said you're wonderful.\n\n                    ERICA\n\n          No, really, what'd he say...How are you?\n\n                    HARRY\n\n          He said I'm good..that I can go.\n\n                     . ERICA\n\n              (obviously conflicted)\n          Oh. So... Congratulations. That's really.\n          . . great.\n\n                    HARRY\n\n          Yeah, he said... by tomorrow for absolute\n          sure. You think you can deal with me for\n          one more night?\n\n\n\n\n                                                        84.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA CROWDED CLUB - SOUTHAMPTON - THAT NIGHT\n\nPacked with Young People. In the middle of this twentysomething\nsun burnt beach crowd, we find, Erica and Harry, the two coolest\npeople in the room, dancing with each other.\n\nA LITTLE 'LATER - THE KARAOKE ROOM\n\nHarry leads Erica through a crowd listening to a Girl singing\nBritney Spears' Oops, I Did It Again. When she finishes the\ncrowd enthusiastically applauds.\n\n                    HARRY\n\n              (big breath)\n          Okay, here goes...\n\n                    ERICA\n\n          Here goes what?\n\n                    HARRY\n\n          Here goes me singing to you...\n              (pulling a DISC out of his\n               pocket)\n          Bought my own music.\n\n                    ERICA\n\n          You knew they had karaoke?\n\n                    HARRY\n\n          Baby, it's why we're here. .\nHarry makes his way TO THE STAGE, hands them his disc. He's\nhanded a microphone. He looks right at Erica.\n\n                    HARRY\n\n          This is for you, Ace...\n              (then, under his breath)\n          wish me luck.\nThe Music begins and it is an instrumental version of one of\nErica's French Songs, \"I Wish You Love\".\n\n                    HARRY\n\n              (sings)\n          I wish you bluebirds in the spring... To\n          Give your heart a song to sing... And\n          then a kiss, but more than this... I wish\nH         you love...\n arry takes out a sheet of paper and his glasses.\n\n                    HARRY\n\n          Don't want to blow this part...\nNow Harry sings the rest of the song IN FRENCH. . .\n\n\n\n\n                                                           85.\n\n\n\n\n\n\n\n\n\n\n\n-.\n\n\n                    HARRY\n\n              (sings)\n          Et en juillet une limonade...Pour\n          vous refroidir dans quelque lefy\n          glade...\nAnd so on... Erica watches knowing something in her life has\njust that second, forever changed. And as Harry continues\nsinging, we:\n\n                                         CUT TO:\n\n\nLOWELL - THE NEXT DAY\n\nPacking the Trunk of the Town Car in front of Erica's house.\n\nINT. HARRY'S ROOM - SAME TIME\n\nHarry tosses his pills in a leather bag. .. Erica enters\ndoing the worst job she's ever done of being strong.\n\n                    ERICA\n\n              (holding some cigars)\n          Here you go, you can have these back now.\n              (Harry looks confused)\n          I confiscated them your first night\n          here...\n\n                    HARRY\n\n              (smells them)\n          Thank you darlin' ...\n\n                    ERICA\n\n          Try not to smoke them...\n              (hands him a small bag)\n          And I packed you a sandwich, just\n          in case your blood sugar got low.\n          And some of that iced-tea you like,\n          and a nonfat, low cholesterol\n          cookie. And a peach.\n\n                    HARRY\n\n          what a doll...\n              (notices)\n          Got something else?\nFrom behind her back Erica pulls out a Mason Jar filled with\nall dark beach stones with ONE WHITE STONE in the center.\n\n                    ERICA\n\n          Something to remember me by.\nHarry hugs her. Erica awkwardly throws her arms around him\nand kisses him, then kisses him better. He's moved by her.\n\n\n\n\n                                                          86.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          There is that...\n\n                    ERICA\n\n          And hey, we'll always have Paris.\n\n                    HARRY\n\n          Honey, no words can ever express my\n          gratitude for taking me in and taking care\n          of me and...\n\n                    ERICA\n\n          Hey, your heart attack could be the best\n          thing that ever happened to me.\n\n                     HARRY\n\n              (kisses her quickly, even\n               faster throws out)\n          I love ya.\n\n                    ERICA\n\n          I love you too...if that's what you said. I\n          don't know if it ends in 'ya' if it's an\n          official I love you but...\nHarry expression looks something like he's in pain. Then. . .\n\n                    HARRY\n\n          You're not like anybody.\n\n                    ERICA\n\n          Neither are you.\n\n\n\n\n\n\n\nINT. CAR - MOVING AWAY FROM THE HOUSE - DAY\n\nLowell drives, rattling on about all the people who have been\ncalling about him. Harry, in the backseat, looks back at the\nhouse, until it is finally out of view.\nHarry then looks inside the bag with the sandwich and finds an\nEnvelope from Erica, pulls it out, doesn't open it, places it back\nin the bag then takes out his cell phone and dials.\n\nINT. ERICA'S LIVING ROOM - SAME TIME - OVER, THE PHONE RINGS\n\nThe room is empty. Erica rushes in, picks up the phone.\n\n                     E\n\n\n                     RICA\n\n          I knew you'd call.\n\nMARIN - WALKING IN SOHO\n\non her cell phone, CRYING.\n\n\n\n\n                                                          87.\n\n\n\n\n\n\n\n\n\n\n\n                     MARIN\n\n           Who? It's me.\n\nINTERCUT\n\n\n                     ERICA\n\n           What's wrong?\n\n                     MARIN\n\n           I had breakfast with Dad this morning and\n           we're talking and he starts looking all\n           weir~ and then he tells me he met someone\n           three weeks ago and it's \"really\n           something and then he\n               (sobbing now)\n           He tells me he's getting married. Why am\n           I reacting this way? I'm almost thirty\n           years old...\n               (people stare at her)\n           Yes, I'm crying, leave me alone.\n\n                     ERICA\n\n           Who's he marrying?\n\n                     MARIN\n\n           I don't know. Some chick he met three\n           weeks ago. She's four years older than me\n           and she's an Ear, Nose and Throat Doctor.\n           Has he lost his mind? I have a huge\n           auction tonight... Why do I have to be\n           the one to deal with this? Can you please\n           come in? I'm rea:~y upset, my shrink'~\n           away for two weeks...I know you're\n           working but. . .please. . ?\n\nAN UPPER EAST SIDE STREET - A LITTLE LATER\n\nOne of those gorgeous tree lined streets from a Woody Allen\nmovie that makes New York seem quaint. Harry's Town Car\npulls up in front of a GORGEOUS   PRISTINE TOWNHOUSE. Harry\nsteps out in shades, holding an   unlit cigar. Lowell joins him\nas the Front Door opens and out   pours his Two Leggy\nAssistants and thumping Hip Hop   Music.\nLOWELL Good to be back?\nHARRY Let's find out.\n\nEXT. ERICA'S HOUSE - LATER\n\nCamera quickly TRACKS Erica down the front path and to her\ncar. She's on her cell.\n\n\n\n\n                                                        88.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n          Hold on, I'm losing you. Okay,    so you'll\n          let Harry know I'll be. in the    city\n          tonight and he can reach me on    my\n          cell...if he wants... Okay? Aw    shit.\n          Hello?\n\nEXT. SOTHEBY'S AUCTION HOUSE - THAT NIGHT\n\nA Crowd files in for tonight's auction.\n\nINT. BACKSTAGE DRESSING ROOM - SAME TIME\n\nA tearful Marin is changing from jeans and a T-shirt to a\nproper dress and heels. Erica leans on a table, listening.\n\n                     MARIN\n\n          -- Look, I get that he has a right to get\n          remarried, but he doesn't even know her\n          and she's like my age. You know what\n          that's like? It's like beyond creepy. And\n          I know he's not replacing me so why does\n          it feel like he is? This is crazy, right?\n          Crying like this...\n\n              (\n\n                lights a cigarette)\n\n                    ERICA\n\n          Honey, if he's replacing anyone, it's me.\n          And all the statistics say divorced men\n          almost always remarry. That's just the\n          way they're built.\n\n                    MARIN\n\n              (slipping on her dress)\n          Mom, you want to know the answer to\n          the big mystery of my life? Why I'm\n          always with the wrong guy? This is\n          why. Because the wrong guy can't do\n          this to you. You have some control\n          with the wrong guy. This thing I'm\n          feeling right now. This is my big\n          fear...that some guy could get me\n          unglued like this, like nothing's\n          connected. And this is just my\n          father! I'm just not strong enough\n          to handle this kind of drama.\n\n                    ERICA\n\n          The drama in life is what makes you\n          strong.\n\n                    MARIN\n\n          No, it's what makes you strong.\n          You've never really understood\n          this,but we're not all like you.\n\n\n\n\n                                                      89.\n\n\n\n\n\n\n\n\n\n\n\n                    MARIN (CONT'D)\n\n          I'm sorry, if I were you and my ex\n          husband, the man who I still allow to\n          direct my plays.! was getting married to\n          some 33 year old Ear, Nose and Throat\n          Babe, I'd be bonkers. And look at you.\n              (realizes)\n          You've never looked better, by the way.\n              (sinks)\n          My anti-depressant is obviously not\n          working. It should cover events like this\n          shouldn't it?\n\n                    ERICA\n\n          Since when do you take an antidepressant?\n\n                    MARIN\n\n          Ugggh, mother, do you know anyone who\n          doesn't?\n\n                       ERICA\n\n          Yes. Me.\n\n                    MARIN\n\n          I rest my case.\nA KNOCK on the door.\n\n                    VOICE FROM OUTSIDE\n\n          Marin, we're all set.\n\n                    MARIN\n\n          Mom, can you do one other really\n          big thing for me? Just say yes.\n\n                    ERICA\n\n              (taking two Turns)\n          Anything bubee.\n\n                    MARIN\n\n          Will you come out to dinner tonight\n          with me and Dad and the fiance?\n\n                    ERICA\n\n          Absolutely not. No.\n\n                    MARIN\n\n          Please. He wants me to meet her and I can\n          not go alone. I already asked him if you\n          could come and he said it was fine and\n          she said it was fine. Look, you're gonna\n          have to meet her too, so, we might as\n          well meet her together. Come on, you know\n          you can handle it.\n\n\n\n\n                                                        90.\n\n\n\n\n\n\n\n\n\n\nErica pauses, thinks M\n                     about it. She knows she can too.\n\n                      ARIN\n\n           Okay. That's it. See that look on\n           your face. That's the gene I didn't\n           get.\n\nINT. SOTHEBY' S - MOMENTS LATER\n\nMarin, now all pulled together, stands at the podium in front\nof a packed house. If' you didn't know, you'd never guess.\n\n                     MARIN\n\n           Good evening and welcome to Sotheby's and\n           this evening's sale of Impressionistic\n           and Modern Art. Bidders should know that\n           the auctioneer may open bidding on any\n           lot below the reserve by placing a bid on\n           behalf of the seller. Okay...Let's start\n           with Lot I, the Bonnard drawing. And\n           $5.000 starting with my bidders, $5000 is\n           bid, 5500, 6000, 6500 is mine, 7000\n           gentleman's bid, 7500 is here, 8000 on\n           the phone. . .\n\nON ERICA\n\nin the back of the room, watching with pride and worry. She\nslips out her cell, checks her messages. Her phone lights up\nand tells her she has \"0\" Voice Mail.\n\nA CLOCK ON THE WALL - IT'S 8:30\n\nWe are in ERICA'S EMPTY KITCHEN in The Hamptons and her phone\nis RINGING.\n\nANGLE - A CELL PHONE\n\nas A Man's HAND turns it off. We are:\n\nINT. HAMPTON'S RESTAURANT\n\nJulian sits at a table, by himself, in a coat and tie,\ntucking away his phone. The Waiter sympathetically approaches\nthe table.\n\n                     JULIAN\n\n           Guess I got stood up.\n\n                     WAITER\n\n           Would you like to order or...?\n\n\n\n\n                                                        91.\n\n\n\n\n\n\n\n\n\n\n\n                    JULIAN\n\n          Why not, I put. on the tie and\n          everything. And can you bring me\n          another. . .\n              (indicating his drink)\nJulian takes a look at the menu, then looks away.\n\nTWO DINNER PLATES ARE CARRIED THROUGH THE RESTAURANT\n\nand as the CAMERA WIDENS we realize we are:\n\nIN A CHIC CAFE IN MANHATTAN - LATER THAT NIGHT\n\nCamera takes us to Erica, Marin, Dave and DAVE'S FIANCE, KRISTEN,\na combo of a hot tie and a young professional. Everyone has menus\nand drinks. A Waiter delivers two new Martinis for Marin and\nErica. They both go right for them. Erica drinks too much too\nfast.                D\n\n                     AVE\n\n              (to Erica)\n          Thirsty?\n\n                    ERICA\n\n          I've had a big week Dave, forgot how\n          these slip right down. I'm fine. So,\n          Kristen, where'd you go to...\n              (burps)\n          --medical school? Excuse me.\n\n                    KRISTEN\n\n          University of Pennsylvania.\n\n                    ERICA\n\n          I went to school in Philadelphia\n          too.\n\n                    DAVE\n\n          Bryn Mawr girl.\n\n                     KRISTEN\n\n          That's amazing. My Mom went to Bryn\n          Mawr . . .\n\n                    MARIN\n\n          Wow. So not only are you marrying my father\n          but our mothers went to the same college.\nMarin takes out a pack of cigarettes.\n\n                    MARIN\n\n          Anyone mind?\n\n                    KRISTEN\n\n          Actually I do.\n\n\n\n\n                                      92.\n\n\n\n\n\n\n\n\n\n\n\n          MARIN\n\nOkay, I'll just..have one.\n    (lights up)\nSo, this isn't going badly so far\nis it? I mean for a totally surreal\nsituation like this.\n\n          DAVE\n\nShall we order?\n\n          KRISTEN\n\nAbsolutely.\n\n          DAVE\n\n    (peruses menu)\nErica, do I like duck?\n\n          ERICA\n\nYes. It's rabbit you hate.\n    (to Kristen)\nI'll give you a list of everything\nhe likes and dislikes.\n\n          DAVE\n\nLet's let her figure some things\nout on her own.\n\n          ERICA\n\nI didn't mean those things, Dave.\nShe did go to medical school.\n\n          MARIN\n\n    (pointing to herself and\n    Kristen)\nHey, not in front of the kids.\n\n          ERICA\n\n    (polishing off her\n     Martini)\nI will tell you this...Dave has one\ntruly great love in his life.\n\n          KRISTEN\n\nReally? What's that?\n\n             ERICA\n\nHis balls.\n\n          DAVE\n\nOkay, I forgot to mention she can't\ndrink hard liquor.\n    (to Marin)\nWhy did you order her a Martini?\n\n\n\n\n                     E\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                        93.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n          What? It's not true? The man can not\n          watch TV or read without the hand down\n          the pants-- Here's my advice after 21\n          years I say who cares, they're his\n          balls,let him enjoy 'em.\n\n                    MARIN\n\n              (chokes)\n          I think I swallowed my olive, whole.\nErica looks up and sees something that takes her breath away.\n\nA COUPLE ZIGZAGGING AROUND TABLES\n\nand headed in her direction. A sexy Young Thing followed by\nher date -- no other than Harry. Harry stops to shake\nsomeone's hand, holds his date around the waist. Suddenly,\nthe SOUND DROPS OUT of the restaurant as Harry and his Date\nwalk right by Erica's table in SLOW MOTION, not noticing her.\n\nM\n\n\n OVING IN ON ERICA\n\nas the room comes alive again. Her eyes follow Harry as he is\nseated only one table away, his back to Erica, his Date\nfacing her. Marin hasn't seen him. Erica tries her hardest to\nact normal but apparently isn't.\n\n                    MARIN\n\n          Mom, you okay?\n\n                    ERICA\n\n          Yeah, fine.\nErica looks at her menu then her eyes go right back to Harry.\nHis Date is laughing at something Harry is saying. Harry\nleans in to her, whispers something to her. She touches his\nhand.\n\n                     RICA\n\n          You know what? Maybe I need a little\n          air...\nErica rises; grabs her purse, almost bumps into a Waiter as\nshe passes Harry's table, knocks into someone's chair, a\nglass breaks. Everyone turns to her, including Harry. She now\nstands right at his table. He smiles up at her.\n\n                     HARRY\n\n          Hey.\n\n                    ERICA\n\n          Hello... Harry.\n              (to his Date)\n          Hello...\n\n\n\n\n                                                          94.\n\n\n\n\n\n\n\n\n\n\n\nEXT. RESTAURANT\n\nErica rushes out. She's a little high and her heart is\npounding. She heads down the street.\n\n                    ERICA\n\n          Oh, God, I'm so stupid...\nShe picks up her pace, starts running. Her cell phone RINGS.\n\n                    ERICA\n\n          Hello?\nIntercut Harry and Erica on their cells, a block apart.\n\n                    HARRY\n\n              (walking quickly)\n          Slow down. You want to kill me?\nShe considers it.\n\n                    ERICA\n\n          Harry, I gotta go...\n\n                    HARRY\n\n          Erica, she's just a friend.\n\n                     ERICA\n\n          Yeah, she looks like a buddy kind\n          of a girl.\nErica reaches a corner, can't get across, turns the corner.\nHarry ARRIVES NEXT TO HER.\n\n                    HARRY\n\n          Come on, it's just a dinner...\n\n                    ERICA\n\n          Look, Harry, here's the problem. I\n          really like you.\n\n                    HARRY\n\n          I really like you.\n\n                    ERICA\n\n          Yeah, but I love you like you.\n              (that stops him)\n          I do. I love you.\nHarry swoons and not in a good way.\n\n                    HARRY\n\n          I think maybe you should consider\n          that you're in love with the idea\n          of being in love.\n\n\n\n\n                                             95.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          ERICA\n\n\nD\n\n o you? Okay. Oh, God...\n    (stomps her feet)\nI'm like the dumb girl who doesn't get it.\n    (tries not to cry in front\n     of him)\nI've never been the dumb girl\nbefore. It ain't so great.\n\n          HARRY\n\nLet's just calm down. This was just\na a meal with a friend.\n\n           ERICA\n\n-- Did you know I called you seven\nhours ago?\n\n          HARRY\n\nI was gonna call you. I've been jamming\nall day, it's my first day back.\n\n          ERICA\n\nUh-huh. . .\n\n          HARRY\n\nI had these plans before I met you. But I\ndo like seeing you. I do. I'm always\nsurprised by it.\n\n          ERICA\n\nWhat was I thinking?\n\n          HARRY\n\nMaybe you weren't thinking for once and\nlook what a good time we had. Let's not\nruin something great.\n\n          ERICA\n\nHarry, I won't be good at this.\n\n           HARRY\n\nAt what?\n\n          ERICA\n\nActing like I don't care.\n\n          HARRY\n\nI have never lied to you. I have always\ntold you some version of the truth.\n\n          ERICA\n\n    (freaking on that one)\nThe truth doesn't have versions.\n\n\n\n\n                                            96.\n\n\n\n\n\n\n\n\n\n\n\n          HARRY\n\nCan you cut me a little slack? My\nlife's been turned upside down.\n\n          ERICA\n\nYeah. Mine too.\n\n          HARRY\n\nThen let's each get our bearings.\n\n          ERICA\n\nI don't want my bearings. I've had my\nbearings my whole fucking life. I felt\nsomething with you that... Oh, you don't\nwant to-\n\n          HARRY\n\nYes I do.\n    (she won't open up)\nTell me.\n\n          ERICA\n\nI felt something with you, I didn't know\nreally existed. You know what that's like\nafter a twenty year marriage? To feel\nsomething for another person that's so\noff the charts, that -\n    (Harry looks down)\nOkay, not your problem. This is why\nI'm not good in relationships. You\nknow writers are like teachers,\nthose who can - do, those who can't\n- write romantic comedies where\nTHIS does not happen in the third\nact...and it certainly does not\nhappen to a 55 year old woman. In\nthe play I'll be 36 so it won't be\nas pathetic. I'm just too old to\nfeel crushed.I've written this\nfeeling but I never really got it.\n    (realizes)\nYou know what this is?\n    (pointing to herself)\nThis is heart broken. How's that\nfor impervious?\n\n          HARRY\n\nYou're killin' me.\n\n          ERICA\n\nI just wish it had lasted more than a\nweek.\n\n          HARRY\n\nMe too.\n\n\n\n\n                                                      97.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n          That's a horrible thing to say.\n              (walks off, comes back)\n          The life I had before I met you. I\n          knew how to do that, could do that\n          forever. Now look at me...what do I\n          do with all this?\n\n                    HARRY\n\n          Can we talk tomorrow?\n\n                    ERICA\n\n          What for? I saw your friend you were\n          having dinner with, if that's what you\n          want, it's never going to work with me.\n          Look at me. I'm a middle aged woman,\n          don't let this brown hair fool you, I\n          don't have a real brown hair on my head,\n          I'm almost all grey...that would freak\n          you out, wouldn't it? And I have. high\n          cholesterol and my back hurts every\n          morning and I'm post menopausal and I\n          have osteoperosis and I'm sure arthritis\n          is just around the corner and I know\n          you've seen my vericose veins. Let's face\n          it man, that's not quite the buzz you're\n          lookin' for.\nA TAXI pulls up.\n\n                    ERICA\n\n          And you know what? Everyday, I'm\n          gettin' older. ..just like you.\nErica opens the back door of the Taxi.\n\n                      HARRY\n\n          Wait.\nErica turns.\nThis is his chance.\n\n                    HARRY\n\n          I just... the truth is... I don't\n          know how to be a boyfriend.\n\n                     ERICA\n\n          That's what you have to say after all\n          this? You don't know how to be a\n          boyfriend.\n\n                    HARRY\n\n          That's not a small thing.\nThey're both out of words.\n\n\n\n\n                                                           98.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n          Are we done?\n\n                    HARRY\n\n          I don't know.\nShe nods. He doesn't give. She ducks into the CAB and it\nPULLS AWAY. Harry stands on the street, watching her go.\n\n                    HARRY\n\n              (winces)\n          Ouch.\nHe grabs his heart.\n\n                       HARRY\n\n          Oh, God...\n\n\n\n\n\n\n\nHARRY - ON A GURNEY\n\nwheeled through the Emergency Room of Beth Israel Hospital.\nThis is not the Hamptons. This place is crawling with\npatients. Harry's delivered to a Latina Doctor in her\nthirties, DR. MARTINEZ. As he's taken off the gurney, he's\nimmediately hooked up to a heart monitor, given oxygen and an\n\nIV.\n\n\n                    NURSE\n\n          Came in by cab, 15 minutes of chest\n          pain, no nauseau, some shortness of\n          breath, was hospitalized a week ago\n          with a coronary thrombosis.\n\n                    DR. MARTINEZ\n\n          Hang a nitro drip.\n\n                    HARRY\n\n          You can't. I took Viagra.\n\n                    DR. MARTIINEZ\n\n          You have been through this before.\n          Give him 5 mgs of Metoprolol. You\n          h~ving chest pain right now?\n\n                    H\n\n\n                     ARRY\n\n          No, and the pain I was having was\n          sharp, not like before.\n\n                    . DR. MARTINEZ\n\n          That's good. Not like before is we\n          like to hear.\n              (reads EKG)\n          Give him aspirin.\n\n\n\n\n                                                        99.\n\n\n\n\n\n\n\n\n\n\n\n                      DR. MARTINEZ (CONT'D)\n\n          Based   on what I see so far, your\n          heart   is not in distress but I'm\n          gonna   do a rapid enzyme test to be\n          sure.    What were you doing at the\n          onset   of the pain?\n\n                    HARRY\n\n          Having a fight with someone. A woman. Can\n          a woman give you chest pain?\n\n                    DR. MARTINEZ\n\n          Are you kidding? Love hurts, haven't you\n          heard?\n\n                    HARRY\n\n          Yeah, but so far, I've only given pain, I\n          never got any.\n\n                    DR. MARTINEZ\n\n              (confused at how literal\n               he is)\n          All right, well you're battin' a thousand\n          here. Your enzymes look perfect, your\n          EKG is normal and the pain doesn't sound\n          like the kind of pain we worry about. I\n          think what you experienced was normal\n          chest pain associated with stress.\n\n                      HARRY\n\n          Stress?\n\n                    DR. MARTINEZ\n\n          And incase you haven't heard, that can\n          give you a heart attack. Mr. Langer, I\n          donlt know what you're up to gallivanting\n          out and about at this hour, but if you\n          were my Dad, I'd make sure you were home,\n          in bed, recuperating.\n\nINT. HARRY'S TOWNHOUSE - LATER\n\nHarry slowly climbs up the gorgeous staircase of his\nTownhouse. Exhausted, he stops half way up, sits on a step,\ntakes out his cell.\n\n                    HARRY\n\n          If you were my Dad...\nHe pulls his glasses out of his pocket, puts them on to dial.\nSomething feels odd, he takes off his glasses, looks at them,\nthey're not his -- they're Erica's. He puts them back on and\ndials.\n\n\n\n\n                                                         100.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA'S VOICE\n\n          Hi. It's Erica. I'm not here so\n          leave a message.\nHe realizes he doesn't know what to say, hangs up, then looks\nat her glasses.\n\n                    HARRY\n\n              (grabbing his chest)\n          Ouch.\n\nBLACK SCREEN\n\n\n\n\nA LIGHT POPS ON and Erica ENTERS HER BEDROOM, crying. She\nflops down on her bed, picks up her phone, grabs her glasses,\nputs them on, doesn't realize they're Harry's. She dials.\nVoice Mail tells her she has One Message. She sits up,\nexcited.             J\n\n                     ULIAN'S VOICE\n\n          Erica, Hi, it's Julian. It's about\n          8:20, I'm in the restaurant...just\n          Wondering if you're...\nErica hangs up, starts crying again. She takes off her\nglasses to wipe her eyes when she realizes she's holding\nHarry's glasses. Just the sight of them makes her burst into\ntears, the kind of tears that have been thirty years in the\nmaking.\n\nERICA'S COMPUTER KEYBOARD - NIGHT\n\nA tear lands on it. Erica, back in a turtleneck and wearing\nHarry's glasses, starts writing at a breakneck pace, all the\nwhile, tears flood her eyes.\n\nMORNING - WAVES BREAKING ON THE SHORE\n\n\nERICA\n\nwakes up. As soon as her eyes open, she bursts into tears.\nWhile in the SHOWER, the crying never stops. While she EATS\nBREAKFAST, a downpour. Running ON THE BEACH, she's wailing.\nBack at the \"COMPUTER, she's sobbing as her hands fly over\nthe keys. An actual boo hoo can be heard.\nAt NIGHT, laptop in bed, Erica writes, eating a   bagel, wearing\nHarry's glasses and a pair of wrinkled pajamas,   FRENCH MUSIC plays\nin the BG. At this point, she doesn't eVen\" pay   attention to her\ntears, just wipes and types when out of nowhere   she receives an\nINSTANT MESSAGE from HARRY.\nHe writes: Do I hear French Music?\nShocked, she sits up, tries to fix her hair.\n\n\n\n\nH\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                         101.\n\n\n\n\n\n\n\n\n\n\n\nINT. HARRY'S BEDROOM - SAME TIME\n\nHarry sits up in bed, staring at his laptop, wearing Erica's\nglasses, a pair of pajamas and a three day growth. A\nthermometer is propped in his mouth.\nHe writes: R U there?\nShe answers: Yes. Hello.\nHe writes: How are ya?\nShe writes: Great... as, she wipes her tears on her sleeve.\n e writes:How's the writing going?\nShe answers: Pouring out of me now. Go figure.\n\nE\n\nHe types: I miss y .. He stops, thinks before sending.\n rica waits on her side. Nothing, is coming over.\nThen, on his side, he receives: Actually just running out.\nTake care...\nHarry deletes the I miss y... and instead writes: U 2.\nErica slides down in her bed, wiped.\n\nINT. HARRY' S BEDROOM - SAME TIME\n\nHarry takes out his thermometer. Feels lost. Looks at the\nclock. It's 10:00 p.m.\n\nINT. LOWELL'S BEDROOM - SAME TIME\n\nLowell lies in bed in pj's, WATCHING TV, smoking. Harry\narrives at his doorway in his pajamas. Lowell puts out his\ncigarette, fans the smoke.\n\n                    HARRY\n\n          Lowell, I'm goin' out.\n\n                    LOWELL\n\n              (confused)\n          Okay. Don't forget to put some\n          clothes on.\n\n                    HARRY\n\n          I mean, I should go out, shouldn't I?\n          Since .when don't I go out? Just cause\n          some Emergency Room Doctor tells me to\n          stay in bed, doesn't mean I have to turn\n          into a monk.\n\n\n\n\n                                                       102.\n\n\n\n\n\n\n\n\n\n\n\n                    LOWELL\n\n          Is there something you'd like me to\n          do for you, Mr. Langer?\n\n                    HARRY\n\n          Well, no, just...well, what are you\n          doin'?\n\n                    LOWELL\n\n          Watching Lucy.\n\n                    HARRY\n\n          Would you hate making me something\n          to eat?\n\nCLOSE - LUCY AND ETHEL ON TV\n\n\nREVERSE - HARRY AND LOWELL\n\nlying on top of the covers in Lowell's room, both eating\nbowls of pasta, watching TV.\n\n                    HARRY\n\n          Funny women are adorable, don't you\n          think?\n\n                    LOWELL\n\n          I never really thought about it.\n\n                    HARRY\n\n          Neither had I, but think about it.\n          Funny's a unique thing in a woman. It's\n          fun to be around.\n\n                    LOWELL\n\n          There's some reason we've been\n          watching these two for 5O years.\n\n                    HARRY\n\n          Exactly. It lasts. We're not\n          sittin' here watchin' Mamie Van\n          Doren reruns.\n\n                    LOWELL\n\n          No we're not. You feeling okay?\n\n                    HARRY\n\n          I don't think I've slept one night\n          since I've been home. Every little\n          ache and pain scares the shitout of\n          me...can't get a handle on my\n          emotional life, don't know what I\n          want, don't know if what I felt was\n          because I just had a heart attack\n          or was real. Plus, I feel needy. I\n          never used that word in my life.\n\n\n\n\n                                                       103.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY (CONT'D)\n\n          Lowell, have you ever seen me like\n          this? Be honest.\n\n                    LOWELL\n\n          Nothing even close.\n\n                    HARRY\n\n          That's right, buddy, I'm a mess.\n          And I'm no good at it.\n              (realizes something)\n          Those are very nice pajamas, by the\n          way. Did they used to be mine?\n\n                    LOWELL\n\n          Yes but you gave them to me, you\n          said you never wore them.\n\n                    HARRY\n\n          I know. But why would I do that?\n          They're so elegant. Nice piping...\n\n                    LOWELL\n\n          Mr. Langer, you're always giving\n          away beautiful things.\n\n                    HARRY\n\n          Awwwww... How did I get like this?\n              (eyes fluttering shut)\n          I'm gonna shut my eyes for a few\n          minutes. Keep Lucy on...\nHarry nods off and Lowell TURNS OUT THE LIGHT.\n\nEXT. BEACH - THE HAMPTONS - MORNING - MUSIC OVER\n\nErica and Zoe are taking a walk. Erica, still crying, picks\nup a brown stone, explains its meaning to Zoe. Zoe holds the\nstone, makes an `awwww' face.Erica nods, then Zoe tosses the\nstone in the ocean, fed up with hearing about him already.\nThen, Zoe stops Erica, points to something.\n\nMARIN AND HER NEW BOYFRIEND\n\nfrolicking on the beach. He's a YOUNG HUNK in a tank top,\nshorts, highlighted hair. Erica rolls her eyes.\n\nEXT. BEACH STAIRS - DUSK\n\nMarin rushes down the stairs. Erica sits near the bottom of\nthe stairs, watching the sunset.\n\n                    MARIN\n\n          Mom, we're going into town...\nErica turns, wiping tears.\n\n\n\n\n                                      104.\n\n\n\n\n\n\n\n\n\n\n\n          MARIN\n\nAre you crying?\n    (joining her)\nI didn't know you did that.\n\n          ERICA\n\nYeah, it's my new thing. I've\ngotten abnormally great at it.\n\n          MARIN\n\n    (sitting on the step with\n    her)\nIs it Harry?\n\n          ERICA\n\nSeems I gotta learn how to do that\nlove 'em and leave 'em stuff.\n\n          MARIN\n\nFucking men. You don't care when I\nsay fuck, do you?\n\n          ERICA\n\nNot really. Sometimes. Not right\nnow.\n\n          MARIN\n\nSo now you get my theory about\nlove? You gotta self protect. It's\ntoo dangerous.\n\n          ERICA\n\nMarin, that theory... how can I put\nthis so your feelings won't get\nhurt. It's just so crazy, it makes\nme want to SCREAMMMMMMMMMMM!!!!\n\n          MARIN\n\nAnd how would you put it if you\nwanted to hurt my feelings?\n\n          ERICA\n\nListen to me... you cannot hide\nfrom love for the rest of your life\nbecause maybe it won't work out and\nmaybe you'll become unglued. That's\nnot a way to live.\n\n          MARIN\n\nSo you're telling me you're happy\nright now? This is good what\nhappened to you?\n\n\n\n\n                                                       105.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n          No. This was bad. But for the three days\n          it was good, it was electrifying.\nMarin's eyes fill up.\n\n                    ERICA\n\n          I think you must consider the possibility\n          that we are more alike than you realize.\n          I let someone in and I had the time of my\n          life.\n\n                    MARIN\n\n              (tearful)\n          I've never had the time of my life.\n\n                    ERICA\n\n          I know. And bubbee, I say this from\n          the deepest part of my heart. . ...\n          what the fuck are you waiting \"for?\n\nINT. HARRY'S HOUSE - NYC - NIGHT\n\nA PARTY is in progress. It's loud. The place is crawling with\ncharacters from the Hip Hop world. Harry winds his way down his\ncrowded STAIRCASE, Girls grabbing at him as he passes by. As hard\nas he tries, he can't quite bring to life the guy he knew how to\nbe.\n\n                    LOWELL\n\n              (as Harry passes)\n\n          H\n\n           aving fun?\n\n                       HARRY\n\n          Not quite.\nHarry makes his way down the stairs, through the crowded\nentry and OUT THE FRONT DOOR. OUTSIDE, Harry steps into the\nQUIET STREET, looks up at his house and the party inside.\n\nEXT. ROADSIDE FARM STAND - EAST HAMPTON - DAY\n\nZoe is picking corn, when she notices Julian across the way.\nHe glances up, looks right past her, obviously doesn't\nremember her, keeps on shopping. Zoe thinks for a see,\nwondering how she can get his attention when he looks right\nback at her, his face full of hope.\n\nINT. ERICA'S DINING ROOM - LATER\n\nErica sets the table for two. Zoe pokes her head in the door.\n\n                    ZOE\n\n          I got you something great at the\n          farm stand.\n\n\n\n\nJ\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                       106.\n\n\n\n\n\n\n\n\n\n\nZoe fully opens the door revealing Julian holding a bouquet\nof fresh cut flowers.\n\n                    JULIAN\n\n          These are for you to give me when\n          you apologize.\n\nINT. DINING ROOM - LATER - MUSIC OVER\n\nCandlelit. Zoe, Erica and Julian share a bottle of wine and a\nhome cooked meal. The CAMERA does a 360 around the table,\ntheir faces saying it all. The Women bask in Julian's warmth\nas he entertains them with stories. Zoe looks from Julian to\nErica, relieved to see her sister smiling again.\n\nINT. KITCHEN - LATER\n\nErica places coffee cups in the sink. Julian is next to her,\nleaning against the counter, holding a glass of wine.\n\n                    ERICA\n\n          Julian, I hope you know I'm\n          mortified by my behavior. I was\n          going to get in touch with you,\n          send you a note or something...\n\n                    JULIAN\n\n          A note? That's a little chilly.\n\n                    ERICA\n\n          I'm embarrassed. I just haven't\n          been myself lately. What can I say?\n\n                    JULIAN\n\n          Just tell me you're sorry.\n\n                    ERICA\n\n          I am sorry.\n\n                    JULIAN\n\n          Then you could kiss me.\n\n                       ERICA\n\n          Kiss you?\n ulian nods.\n\n                    ERICA\n\n          You'll forgive me if I kiss' you?\n\n                       JULIAN\n\n          Think so.\nErica hesitates then gives him a peck of a kiss.\n\n\n\n\n                                                         107.\n\n\n\n\n\n\n\n\n\n\n\n                    JULIAN\n\n          No one on earth would forgive you\n          for that kiss\n              (places his wine glass on\n               the counter)\n          May I?\nErica nods as Julian takes her in his arms and gives her a\nkiss that doesn't quit.\n\n                    JULIAN\n\n              (still holding her,\n              whispers)\n          I forgive you.\nErica very distinctly begins to hear the BEATING of her own\nheart.\n\n                                          DISSOLVE TO:\n\n\nERICA'S COMPUTER SCREEN - ANOTHER NIGHT\n\nOn it is written: The lights on the Eiffel Tower dim to black\nas the music continues to play.\nErica sits back, still wearing Harry's glasses. Finished at\nlast. She notices an empty Kleenex box on her desk. She\ntosses it in a hook shot across the room and it lands right\nin the trash can.\n\nINT. LIVING ROOM - MOMENTS LATER\n\nJulian sits on the sofa, shoes off, reading the first half of\nthe play. A fire burns in the fireplace. Erica approaches the\nback of the sofa, holding the rest of the pages.\n\n                    JULIAN\n\n          It's the best thing you've ever written.\n\n                    ERICA\n\n          It is?\n\n                    JULIAN\n\n          It's wonderful. It's sweet. It's smart.\n          It's funny.\nErica leans oyer the sofa, reading over his shoulder.\n\n                    JULIAN\n\n          How great is it that I'm not\n          intimidated by your brilliance?\nErica gives him a small kiss of appreciation.\n\n\n\n\n                                                       108.\n\n\n\n\n\n\n\n\n\n\n\n                    JULIAN\n\n          Must we go through this every time?\n          Come here...\nShe leans into him and he kisses her fully and sweetly. She\nholds onto the sofa for support.\n\n                                                   CUT TO:\n\n\nA PRETTY GIRL - WHO LOOKS A LOT LIKE MARIN\n\neating lunch in Orso's, talking non-stop.\n\n                    PRETTY GIRL\n\n          I'm totally excited about this audition.\n          It's such a great part. It's supporting\n          but she's a really funny character.\n          There's this totally hilarious scene\n          where she's dating this like chauvinist\n          older guy and just as they're about to do\n          it, the guy moans and she thinks he's\n          just really into her, right? Except he's\n          having a heart attack and she's like\n          creeped out and her mother, who basically\n          despises the guy, rushes in, gives him\n          CPR and saves his life.\n\n\n\n\n\n\n\nREVERSE ON HARRY\n\nchoking on his lunch.\n\nINT. BROADWAY THEATER - DAY\n\nAuditions are in progress. On stage, AN ACTRESS reads for the\n\n                     A\n\npart of \"The Sister\".\n\n                     CTRESS\n\n          Look, we're four sophisticated people.\n          Why can't we all stay for the weekend?\n\nON ERICA'S PROFILE\n\nin the audience. She sits in a row by herself, listening.\nHarry ENTERS HER FRAME, sitting directly behind her.\n\n                    HARRY\n\n          I need to talk to you.\nErica freezes, horrified. Turns, sees him.\n\n                    HARRY\n\n          Got a minute?\n\n\n\n\n                                                       109.\n\n\n\n\n\n\n\n\n\n\n\nBACKSTAGE\n\nErica and Harry stand in front of a BACKDROP OF THE BEACH.\n\n                      HARRY\n\n            So your play's about us?\n\n                      ERICA\n\n            No, it's about me.\n\n                      HARRY\n\n            Am I in it?\n\n                      ERICA\n\n            A guy like you is in it but he's\n            not you.\n\n                      HARRY\n\n            What happens to this guy who's\n            ..not me?\n\n                      ERICA\n\n            Haven't totally decided. He can\n            live or he can die.\n\n                      HARRY\n\n            What are you leaning towards?\n\n                      ERICA\n\n            Death.\n                (Harry reacts)\n            It's funnier.\n\n                      HARRY\n\n            He dies of a funny heart attack?\n\n                      ERICA\n\n            He's sort of a schmuck who screwed\n            around with our heroine, so it\n            won't be too sad.\n\n                      HARRY\n\n            Schmucks are people too you know. Death\n            doesn't seem a little harsh?\n\n                      ERICA\n\n            I just went where the story took\n            me. It's a work of fiction, Harry.\n            Really...just stuff I made up.\n\n                      STAGE MANAGER\n\n                (approaching)\n            Erica, we're ready to do the\n            hospital, 'Do You Take Viagra\n            scene... Should we wait for you?\n\n\n\n\n                                                       110.\n\n\n\n\n\n\n\n\n\n\nErica nods, horrified.\n\n                    HARRY\n\n          So I'm going to be the laughing stock of\n          Broadway.\n\n                    ERICA\n\n          Harry, he's not you. He's a version\n          of the truth of you. So to speak.\n\n                    STAGE MANAGER\n\n          Sorry to interrupt again but Dave wants\n          to know, when Henry says, \"I love ya\",\n          you want that to be 'Ya', not 'You',\n          right?\n\n                    ERICA\n\n          Right.\nWe now HEAR Louis Armstrong's La Vie En Rose play throughout\nthe theater. The BEACH backing is 'raised and an EIFFEL TOWER\nBACKING is lowered behind them. They both try to ignore the\nmusic, but it's impossible.\n\n                     E\n\n\n                     RICA\n\n          Well, you look really nice. You\n          feeling all right?\nAs they stand in front of the Eiffel Tower backing, FAKE SNOW\nFALLS from above...\n\n                    HARRY\n\n          You know it isn't like I wanted to stop\n          seeing you. We could've carried on a fun\n          thing for awhile. Why is it you dames\n          want all or nothing?\n\n                    ERICA\n\n          I don't know, we're just goofy when it\n          comes to love... Look, Harry, if it's all\n          right with you, I'd like to be friends\n\n                    HARRY\n\n          I'm not ready to be your friend. How's\n          that?\n\n                    ERICA\n\n          Fine. I understand.\n\n                    HARRY\n\n          Anyway, do you actually buy that horse\n          shit.. .that men and women can be friends\n          once they've had sex?\n\n\n\n\n                                            111.\n\n\n\n\n\n\n\n\n\n\n\n          ERICA\n\nI'm friends with my ex-husband, but then\nagain, we didn't just have sex.\n\n          HARRY\n\nWe didn't just have sex either.\n\n          ERICA\n\nThen what was it? Love to know.\n\n           HARRY\n\nCan I e-mail it to you when I figure it\nout?\n     (laughs)\nThis is perfect. I have given the `Can't\nWe Be friends' speech for 40 years. I\nthink I invented the 'Can't We Be\nFriends' speech. But you know what,now I\nget why they never went for it. You dames\ngot one thing right. Sometimes sex does\nchange everything. Call me crazy, but I\njust don't see us out on the town, being\npals, having dinner, 'cause I'd bet you\nanything, at some point, one of us will\nhave very unfriend like thoughts about\nthe other then pass the bread becomes\nanything but pass the bread. You get what\nI'm saying?\n\n          ERICA\n\nYou don't want to be friends.\n\n          HARRY\n\nNot \"don't\". Can't. Can't be friends.\nDoesn't work that way.\n    (tries to calm down)\nOkay, I'm moving into another phase of\nthis thing. I'm mad at you.\n    (realizes)\nIt almost feels good.\n\n          ERICA\n\nI think I'm mad at you too.\n\n          HARRY\n\nExcellent. 'Cause I don't like\nthinking about you so much and\nworrying about how you are and if I\nruined your life or...\n\n          ERICA\n\n-- You've worried about me?\n\n          HARRY\n\nYes honey, the schmuck who deserves to\ndie, worries about you.\n\n\n\n\n                                                       112.\n\n                    HARRY(cont'd)\n          Sometimes worrying about you feels like a\n          full time job.\n\n                    ERICA\n\n          Well, doll, I'm doing fine. So you don't\n          have to work that shift anymore.\nAgain, The Stage Manager...\n\n                    STAGE MANAGER\n\n          Erica, they want you to take a look at\n          the costumes for the dancing Henry's.\n          These gonna work for you?\nHarry and Erica TURN and SEE a CHORUS LINE of BALDING 60 YEAR\n\nOLD MEN IN HOSPITAL GOWNS AND SOCKS.\n\n\nEXT. THEATER - DAY\n\nHarry FLIES OUT the Stage Door, right into the street, is\nalmost hit by a motorcycle, doesn't seem to care.\n\nEXT. CENTRAL PARK - DAY\n\nHarry walks briskly through the park, still pissed, his pace\nstarting to get to him. He spots a bench with a WOMAN JOGGER\nat one end. He parks himself at the other end of the bench,\nout of breath. Tries H reason with himself.\n                     to\n\n                     ARRY\n\n          God is a woman, I know that now. No\n          man would punish me like this.\n\n                    WOMAN JOGGER\n\n          You never change, do you?\nSurprised, Harry turns, glances over at the Woman. She drinks\nfrom a water bottle then offers him an easy warm smile. She's\nadorable, mid-sixties, short grey hair.\n\n                    HARRY\n\n          Do you know me or are you just talking to\n          me as \"man\" in general, the beast women\n          love to hate.\n\n                    WOMAN JOGGER\n\n          No, no, I know you Harry.\n\n                    HARRY\n\n          Oh. Don't tell me. I dated your daughter.\n              (the Woman laughs)\n          Right? I broke her heart then she married\n          some hard working Joe on the rebound, has\n          three great kids. What is so funny?\n\n\n\n\n                                                       113.\n\n\n\n\n\n\n\n\n\n\n\n                    WOMAN JOGGER\n\n          You dated me and you broke my heart but\n          after you I met the right guy. I've been\n          married thirty-seven years, have four\n          kids, eight grandkids and a ninth on the\n          way.\nHarry now fully turns in her direction, totally clueless.\n\n                    HARRY\n\n          I dated you. .?\n              (the Woman nods)\n          Did we. ever...?\n\n                    WOMAN JOGGER\n\n          No...we did not.\nHe looks at her hard but still doesn't remember her.\n\n                    HARRY\n\n          Can you give me hint? A year? A\n          decade?\n\n                    WOMAN JOGGER\n\n          The sixties.\n              (Harry squints at her)\n          You took me to Shea Stadium.\n\n                     HARRY\n\n          To a Mets game?    I must've really\n          liked you.\n\n                    WOMAN JOGGER\n\n          You took me to see The Beatles.\n\n                    HARRY\n\n          Oh, God, I really liked you. You're\n          Sandra. ..Cook. We did. We saw The\n          Beatles together. How the hell have\n          you been? What happened to you?\n\n                    SANDRA\n\n          Well, let's see, after we stopped\n          going out, I went back to school,\n          got my doctorate in marine biology,\n          went around the world a few times,\n          met the man of my dreams at Oxford,\n          married him, we lived in London for\n          25 years. I wrote and taught, we\n          raised 3 sons and a daughter. I've\n          just finished my ninth book and now\n          I'm training for my first marathon.\n          Now, I must confess, I actually\n          remember the very last thing you\n          ever said to me.\n\n\n\n\n                                                       114.\n\n                    SANDRA(cont'd)\n          You walked me to my door, I was\n          tearful and you looked at me with\n          those puppy dog eyes and said,\n          \"Honey, I just don't know how to be\n          a boyfriend.\" Now, tell me, what\n          have you been up to since 1964?\nOVER Harry's face, we HEAR the SOUND of a SIREN BLARING.\n\nINT. HOSPITAL - DAY\n\nHarry is wheeled through the ER with the gurney. Dr. Martinez\nruns along with the gurney.\n\n                    DR. MARTINEZ\n\n          Mr. Langer... Back so soon.\n\n                    HARRY\n\n          This is it, I'm dyin', I've had 20\n          minutes of severe chest pain,\n          nausea, shortness of breath, blood\n          pressure's gotta be 170 over 100.\n              (sticks out his arm)\n          Give me the nitrate, I didn't take\n          viagra.\n              (rips open his shirt)\n          Plug me in to the EKG, I need an\n          aspirin, I'm taking 2 beta\n          blockers, blood thinner, Lipitor,\n          Procardia and if I were you, I'd be\n          pounding my chest. Ow!\n\n                    MALE NURSE\n\n          You're a doctor, huh?\n\n                    HARRY\n\n          Just a very sick man.\n\nCLOSE - THE PAPER TAPE FROM HARRY'S EKG\n\nDr. Martinez reads it.\n\n                     DR. MARTINEZ\n\n          Mr. Langer, your diagnosis although\n          fascinating, was entirely\n          incorrect.\n\n                    HARRY\n\n          That's impossible.\n\n                    DR. MARTINEZ\n\n          Your realize a severe anxiety attack can\n          masquerade as a heart attack.\n\n                    HARRY\n\n          So I'm nuts? Perfect! The one thing\n          I'm not taking pills for.\n\n\n\n\n                                                          115.\n\n\n\n\n\n\n\n\n\n\n\n                    DR. MARTINEZ\n\n          If you don't want ,to end up in here\n          every week, I suggest you do whatever it\n          takes to decompress. Try something with\n          me, okay?\n              (takes his pulse)\n          Close your eyes...now give yourself a\n          visual image of something that gives you\n          a feeling of peace and serenity.\n\n                    HARRY\n\n          I don't know. A hammock...\n\n                    DR. MATINEZ\n\n          Okay, good...what else..?\n\n                    HARRY\n\n          Palm trees...clear blue water...\nWe hear the SOUND OF LAPPING WATER, SEA GULLS. . . .\n\n                    DR. MARTINEZ\n\n          Anybody there with you?\n\n                    HARRY\n\n          Yes. Beautiful women...in thongs...\n\n                    DR. MARTINEZ\n\n          (disgusted) Okay. What else do you\n          see, feel, taste...\n\n                    HARRY\n\n          A margarita...a Cuban cigar.\n          ..miles of soft beach.. .\n\n                    DR. MARTINEZ\n\n          Keep going...you're doing great...\nAnd as Harry keeps listing things, Camera MOVES IN ON HIM as\nthe STEEL BAND gets LOUDER AND LOUDER.\n\n                                         DISSOLVE TO:\n\n\nTHE WORDS. . .\n\n\n                    SIX MONTHS LATER\n\n\nFALLING SNOW FILLS THE FRAME\n\nBoom down to see the THEATER MARQUEE of Erica's play on\nBroadway. On the Marquee are raves from critics, \"****\", and\na banner that brags, \"Sold Out!\".\n\nC\n\n\n\n\n AMERA CONTINUES DOWN to street level. Couples walk by,\nbundled up against the cold. Harry ENTERS FRAME.\n\n\n\n\n                                                       116.\n\n\n\n\n\n\n\n\n\n\nHe looks different. He has a beard and has lost some weight:\nAnd in his eyes, a calm we haven't seen before. He pauses in\nfront of the theater -- loo~s at the PUBLICITY PHOTOS. He\nSEES Henry in his boxer shorts at the refrigerator meeting\n\"Emily\" and her Sister. He sees ANOTHER PHOTO of The Dancing\nHenrys kicking up their legs like Rockettes. Then, finally, A\nPHOTO of Henry and Emily in bed, both wearing glasses. Harry\nOPENS THE DOOR TO THE THEATER, steps inside and listens,\nhearing Louis Armstrong's La Vie En Rose, then, the audience\nbreaks out in LAUGHTER. Harry smiles to himself.\n\nINT. APARTMENT BUILDING CORRIDOR - EARLY EVENING\n\nThe elevator opens. Harry steps out, looks around for an\napartment number, finds it, rings the bell and clears his\nthroat. The door quickly OPENS and we see MARIN. She looks\nrelaxed and happy to see him.\n\n                    MARIN\n\n          I couldn't believe you were calling from\n          downstairs.\n              (hugs him)\n          So great to see you.\n\n                    HARRY\n\n          You couldn't look better.\n\n                    MARIN\n\n          Thank you. Come on in.\n\n                    HARRY\n\n          No, no, I just wanted to stop by and say\n          hi and tell you I'm sorry if I ever did\n          anything to you that wasn't on the up and\n          up or...\n\n                    MARIN\n\n          What do you mean? You were great to me.\n\n                    HARRY\n\n          I was?\n\n                    MARIN\n\n          Always.\n\n                    HARRY\n\n          That's refreshing. Good. Well, I don't\n          know what you've done to yourself but you\n          look absolutely radiant.\n\n                    MARIN\n\n          I'm three months pregnant, that might\n          have something to do with it.\n\n\n\n\n                                                       117.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY,\n\n          Really? Who's ..the, lucky guy?\n\n                    MARIN\n\n          My husband, hold on, he really wants to\n          meet you.\n              (calls)\n          Danny...\nA Solid Citizen of a Guy joins Marin, loosened tie,\nglasses...\n\n                    MARIN\n\n          Harry Langer, my husband, Danny Yellin.\n\n                    DANNY\n\n              (shaking Harry's hand)\n          I've heard so much about you...\n\n                      HARRY\n\n          I bet.. .\n\n                     DANNY\n\n          Yeah, with Hthe play and all...\n\n                     ARRY\n\n          I'm famous,huh?\n\n                    MARIN\n\n          Just to us. In every interview my\n          Mom does, she always says she made\n          you up.\n\n                    HARRY\n\n          So the guy in the play, he doesn't\n          make it, does he?\n\n                    DANNY\n\n          He basically dies at the end of the\n          second act, but it's very funny.\n              (as if that's some\n              consolation)\n\n                    HARRY\n\n          Was hopin' she'd give me a\n          reprieve, but...\n\n                    MARIN\n\n          Yeah, well...\n\n                    HARRY\n\n          Yeah. Okay...Best of luck, kids...\nMarin is stumped by this little visit. Harry heads toward the\nelevator, pushes the button, then turns back.\n\n\n\n\n                                                          118.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          How is she?\n\n                     MARIN\n\n          She's. . .\n              (Harry waits)\n          Really good.     Up to her old\n          tricks.\nLearning Italian, remodeling her apartment in the city.\n\n                    HARRY\n\n          Now if I wanted to see her...how\n          would that go over?\n\n                    MARIN\n\n              (encouragingly)\n          Only one way to find out, except\n          she's out of town right now.\n\n                    HARRY\n\n          Oh yeah? Where is she?\n\n                    MARIN\n\n          Paris. She left two days ago, for\n          her birthday. But she'll be back\n          next week...\nThe Elevator arrives. Harry salutes his goodbye and steps\nINSIDE THE ELEVATOR. He turns, FACES CAMERA.\n\n                       HARRY\n\n          Paris...\n\nANOTHER ELEVATOR.OPENS\n\nAnd a clean shaven, dapper looking Harry steps off, cashmere\ncoat, gorgeous scarf. CAMERA FOLLOWS HIM out of the elevator\nand through a BEAUTIFUL LOBBY OF A HOTEL then right onto THE\nSTREET. CAMERA does a 360 and we catch glimpses of PARIS AT\nNIGHT. CAMERA SETTLES ON HARRY just as the LIGHTS OF THE\nEIFFEL TOWER POP ON, sending a flood of golden lights high\ninto the night sky directly behind him.\n\n                       HARRY\n\n          Showtirne.\n\nINT. LEFT BANK BISTRO - NIGHT\n\nErica sits alone at a table in the back of the room, drinking\na glass of wine. She looks vibrant. She glances up from her\ndrink and sees what looks like Harry making his way around\nthe tables. She leans to the side for a better look, to make\nsure it's him. It is him and he's corning right toward her.\nHer stomach sinks, her mind races... and before she can come\nup with a single thought that makes any sense -- there he is.\n\n\n\n\n                                                       119.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n              (proud of himself)\n          I knew you'd be here.\n\n                      ERICA\n\n          You did?\n\n                    HARRY\n\n          I've come a long way to see you,\n          Erica.\n\n                    ERICA\n\n          You mean we're not bumping into\n          each other..? You came here to see\n          me?\n\n                    HARRY\n\n          Yes, I did.\n              (she seems to shiver)\n          I'm aware it was a bold move, one\n          of those impulses that grabs you,'\n          but...so far, we're okay; right?\n\n                    ERICA\n\n          Well, uh, I mean, I'm just...\n\n                    HARRY\n\n          I'll take that as a 'Yes'.\nHarry takes off his coat and scarf, hangs them on a hook.\n\n                     ERICA\n\n          You want a glass of wine or\n          something?\n\n                    HARRY\n\n          I was just gonna give you a kiss\n          hello.\n\n                      ERICA\n\n          Oh, Okay.\nNeither is sure where to go. Cheek? Lips? He lands on her\nchin. .Not what he wanted, but he takes a seat across from\nher. She looks at him - utterly speechless.\n\n                    HARRY\n\n          I remember you said if we still\n          know each other we should go to\n          Paris for our birthdays, well, we\n          still know each other..\".\n\n                    ERICA\n\n          That's true, but, Harry, I haven't\n          heard from you in six months.\n\n\n\n\n                                                         120.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n          I know but I've certainly been thinking\n          about you. There's a lot I have to say.\n          First thing is... I'm not mad at you\n          anymore.\n\n                    ERICA\n\n          Good, 'cause I'm not mad at you\n          anymore either.\n\n                    HARRY\n\n          That's a relief...since I did come all\n          the way to France and everything. And...\n          Happy Birthday.\n\n                     ERICA\n\n              (afraid of everything he\n              could possibly say)\n          Thank you.\n\n                     HARRY\n\n          And congratulations on your amazing\n          success...\n\n                    ERICA\n\n          It's been quite a ride. Funny, I thought\n          maybe I'd hear from you when it opened.\n          Where've you been?\n\n                    HARRY\n\n          After I saw you in the theater that\n          afternoon, I had another \"episode...\n\n                    ERICA\n\n          Oh, I'm sorry.\n\n                    HARRY\n\n          I was actually okay, but I was sure I was\n          dying and the doctor in the ER said I needed\n          to decompress. So I did. I walked out of\n          there and changed my life, sold most of my\n          businesses, packed my bags and moved to an\n          island in the Caribbean.\n\n                    E\n\n\n                     RICA\n\n          That's where you've been all this\n          time? In the Caribbean?\n\n                    HARRY\n\n          Actually...No.\n\n\n\n\n\n\n\nEXT. CARIBBEAN BEACH - FLASHBACK\n\nHarry lies on a chaise under a palm tree, drink in hand, Hawaiian\nshirt, shades. A steel drum plays in the distance.\n\n\n\n\n                                                          121.\n\n\n\n\n\n\n\n\n\n\n\n                    ,\n\n\n                    HARRY (V.O.\n\n          I was there about ,six hours, when it\n          occurred to me that wasting away on an\n          island in the Caribbean wasn't going to\n          remotely cure what was ailing me.\nHarry sits straight up into CAMERA.\n\nBLACK SCREEN\n\nA LIGHT POPS ON and we realize we are in HARRY'S CLOSET.\n\n                    HARRY (V.O.)\n\n          So I decided to take another kind of\n          pilgrimage...into my past.\nHarry ENTERS THE CLOSET, reaches onto a top shelf ,and starts\npulling down dozens of what used be called, \"Little Black Books\".\n\n                    HARRY (V.O.)\n\n          My thought was -- if I retraced my steps\n          and visited all the women I've dated...\nHe blows dust off of the books.\n\n                                         BACK IN PARIS\n\n\n                    HARRY\n\n          -- maybe I could figure out how I\n          got so screwed up.\n\nFLASHBACK - HARRY'S PILGRIMAGE\n\nHarry STANDS at one FRONT DOOR after the NEXT, EACH ONE\n\nSLAMMING IN HIS FACE.\n\n\n                    HARRY (V.O.)\n\n          A lot of the women wouldn't see me.\nThen, we see WOMEN of various ages SLAP HIM ACROSS THE FACE.\n\n                    HARRY (V.O.)\n\n          Or speak to me.\nHarry reels backwards from one Hefty Mama.\n\n                    HARRY (V.O.)\n\n          But I was on a mission to save my\n          soul.\n\n                     ,\n\nA Woman In Her Fifties, purposively walks down a SMALL TOWN\nMAIN STREET carrying groceries.\n\n\n\n\n                                                          122.\n\n\n\n\n\n\n\n\n\n\nHarry, at her side, keeps talking at her, even though she\npicks up her pace and ignores him.\n\n                    HARRY (V.O.)\n\n          My losing streak finally ended when\n          I got one to open up to me.\nIn a HOSPITAL ROOM, an Older Woman on life support, scrawls\nout a note and shows it to Harry who sits in a chair by\nherside. A Priest stands in the background. The note says,\n\"As I remember it, you were wildly insensitive\". Harry lowers\nhis head in shame. She places another note in front of him.\nIt says, \"I forgive you.\" Relieved, he smiles. Then, one last\nnote: \"Now, scram.\"\n\n                    HARRY (V.O.)\n\n          Hearing what they had to say was no\n          picnic.\nIn an Upper West Side COFFEE SHOP, Harry pas coffee\nwith a Woman in her Mid Forties. She talks his ear off.\nHarry can' t deal with it. He looks away ~ The woman\nplaces her hand on his chin and pulls him right back to\nher and keeps talking at him.\n\n                     H\n\n\n                     ARRY (V .O.)\n\n          But I stuck it out and I listened.\n          Then I listened harder.\nHarry WALKS down THE STREET with a ANOTHER WOMAN in her\nThirties, who carries a cello.   She never shuts up.\n\n                    HARRY (V. O. )\n\n          And one of the things I realized\n          was, I was actually giving closure\n          to generations of women.\nAt the corner, the Woman hugs Harry goodbye.\n\n                    HARRY (V. O. )\n\n          Although I admit, some refused to\n          give, no matter what I did. . .\n\nCLOSE - DIANE SAWYER\n\nOn the set of GOOD MORNING AMERICA. She glances out the\nSTUDIO WINDOW and sees Harry ON THE STREET among the folks\nholding signs. He HOLDS A SIGN that says, \"DIANE, YOU WERE\nRIGHT.   I WAS ENTIRELY WRONG.   I`M SORRY.\"   She looks him\nstraight in the eye and gives 'him the finger.\n\n\n\n\n                                                       123.\n\n\n\n\n\n\n\n\n\n\n\nHARRY - FULLY DRESSED - LYING ON HIS BED - TOP SHOT\n\n\n                    HARRY (V. O. )\n\n          When you hear the same story about\n          yourself over and over, your life\n          begins to make sense and the future\n          becomes your only salvation.\n\n\n\n\n\n\n\nINT. PARIS BISTRO - THE PRESENT\n\n\n                    HARRY\n\n          It took me six months to find them\n          all. I visited 18 different states\n          but I came the furthest to see you.\nA HAND lands on his shoulder and he HEARS:\n\n                    A MAN'S VOICE\n\n          I don't believe it.\nHarry looks up and sees handsome young Julian in a beret.\nHarry looks to Erica, instantly deflated..\n\n                       HARRY\n\n          Me either.\nHarry stands. The two Men hug, then Julian squeezes in next\nto Erica. Harry slowly takes his seat across from them.\n\n                    ERICA\n\n          I should have told you he was coming, but\n          I was so engrossed in your story.\n\n                    JULIAN\n\n          What story..?\n\n                     HARRY\n\n          Oh, maybe another time. ..So...\n              (looks from Erica to\n               Julian, it all dawns on\n               him)\n          I guess I should've seen your play, then\n          I would've Jknown how this ended.\n\n                     ULIAN\n\n          Yeah, big twist, huh? So what are\n          you doing over here, man?\n\n                    HARRY\n\n          Just a uh, vacation...never been to Paris\n          in January...\n\n                     JULIAN\n\n          It's amazing to run into you. You look\n          wonderful.\n\n\n\n\n                                                          124.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n          You do.\n\n                    HARRY\n\n          Haven't been on a gurney in six months so\n          that's somethin'...\n\n                    JULIAN\n\n          Well, I've just been to every store\n          in the city, this woman is\n          impossible to buy for... But I\n          think I finally found the right\n          gift.\nHe puts what can only be a RING BOX on the table between\nErica and Harry.\n\n                    JULIAN\n\n          Happy Birthday baby.\nHe kisses her. Harry watches, dying.\n\n                    ERICA\n\n              (reaching for it)\n          I'll open it later...\nHarry rises, reaches for his coat.\n\n                    HARRY\n\n          No, no, you know what, I'll let you\n          two celebrate...\n\n                    ERICA\n\n          Harry, stay.\n\n                    HARRY\n\n          I can't really.\n\n                    JULIAN\n\n          Why? You have somewhere to go?\n\n                                           DISSOLVE TO:\n\n\nTHE WAITER POURING THE END OF A WINE BOTTLE\n\nEveryone at the table is laughing, mid-meal. Julian is doing\nthe talking as well as laughing. Harry laughs along, trying\nto be an approving part of their romance but he's totally\nfaking it.\n\nTHREE GLASSES OF BRANDY ARE SERVED - A LITTLE LATER\n\n\n                    JULIAN\n\n          -- To the forces of destiny that\n          brought us together tonight.\n\n\n\n\n                                                       125.\n\n\n\n\n\n\n\n\n\n\nErica lights a cigarette.\n\n                    JULIAN\n\n          What are you doing, you don't\n          smoke?\n\n                    ERICA\n\n          I'm in Paris, the second hand smoke\n          will kill you anyway...\n\n                    JULIAN\n\n          She's very brilliant, but the woman\n          can not hold her liquor.\nJulian puts his arm around her, pulls her close.\n\n                    ERICA\n\n          I like that about me.\n\n                    BOTH GUYS\n\n          Me too.\nThe Guys exchange looks.\n\n                    ERICA\n\n          Now, if I were writing this, this\n          is where I'd write, 'an awkward\n          moment' .\n\n                    HARRY\n\n          Honey, if you were writing this,\n          I'd be dead.\nErica laughs.\n\n                    HARRY\n\n          Never fails to amuse her.\nThe Waiter drops the check on the table. Harry takes it.\n\n                    JULIAN\n\n          No, Harry, please, let us...\n\n                    HARRY\n\n          No, no, I insist. I crashed your\n          party.\n              (to Erica)\n          At least let me buy you dinner on\n          your birthday...\n              (squints at his watch\n               shows it to Erica)\n          What time does that say?\n\n                    ERICA\n\n              (squints)\n          I have no idea...\n\n\n\n\n                                                       126.\n\n\n\n\n\n\n\n\n\n\n\n                    HARRY\n\n              (feels around)\n          Wait,' I have my. . .\n\n                    ERICA\n\n              (reaching into her purse)\n          Me too...\nThey each take out EACH OTHER'S GLASSES and put them on.\nErica points to Harry wearing her glasses and laughs.\n\n                    HARRY\n\n          You think you look so handsome in\n          mine?\n\n                     ERICA\n\n          You know how long I've been looking\n          for those?\n\n                      HARRY\n\n          Yes I do.\nHarry hands Erica her glasses. She hesitates. He snaps,\ngesturing for his to be turned over. She hands them to him.\nJulian watches all this, sobered by their chemistry.\n\n                     H\n\n\n                     ARRY\n\n              (tucking away his glasses)\n          Once again...closure.\n              (reads his watch)\n          So it's only 5 in the afternoon in\n          New York. What do they do around\n          here for fun?\n\n\n\n\n\n\n\nINT. NOISY CLUB - NIGHT\n\nCamera finds the three of them sitting at a small table. The\nplace is dark, loud, crowded and young. They're all drinking\nchampagne. The air is strained.\n\n                    BOTH GUYS\n\n              (at the same time)\n          Want to dance?\nHarry gestures for Julian to have the first dance. Julian\ntakes Erica's hand and leads her to the dance floor. Harry\nwatches them slip through the crowd. Erica turns back, Harry\nwaves. Julian takes Erica in his arms, it's clear she's\ncomfortable in his embrace. None of .this is lost on Harry\nand as he watches, the smile on his face more than fades, it\nevaporates and everything inside him begins to hurt.\n\nANGLE - THE DANCE FLOOR\n\nErica and Julian -- they're sexy together.\n\n\n\n\n                                                       127.\n\n\n\n\n\n\n\n\n\n\n\nANGLE - THE TABLE\n\nHarry is gone.\n\nEXT. STREET - PARIS - NIGHT\n\nHarry, with his collar turned up against the cold, walks past\nthe glass pyramid in front of The Louvre.\n\nEXT. PONT NEUF - PARIS - MOMENTS LATER\n\nHarry walks over the bridge, the beauty surrounding him just\nmaking it all worse. He stops, looks out at the Seine. He\nhears a classic French song in the distance, then sees a\nsmall barge, playing the music, pass beneath him. Without\nwarning, a tear falls from his eye.\n\n                    HARRY\n\n              (laughs at himself)\n          At the end of the day, I'm nothin'\n          but a sap, a stupid old sap,\n          standing on a bridge in Paris,\n          crying my eyes out.\nHe stops, looks at the mighty city surrounding him. Beauty's\nnot supposed to hurt. Another tear.\n\n                    HARRY\n\n              (almost amused)\n          Look who gets to be the girl.\nHe wipes his eyes on his coat sleeve as SNOW begins to fall.\n\n                    HARRY\n\n              (looking toward heaven)\n          Anything else... .\n\n                      ERICA'S VOICE\n\n          Harry?\nHarry turns and sees Erica standing by a Cab with its motor\nrunning, snow falling on her hair and coat.\n\n                    HARRY\n\n          Where's Julian?\n\n                    ERICA\n\n          He went back to the hotel.\n\n                      HARRY\n\n          How come?\n\n\n\n\n                                                       128.\n\n\n\n\n\n\n\n\n\n\n\n                    ERICA\n\n              (walking to him)\n          He said when he saw me with you, he\n          knew I was still in love with you.\n          What do you have to say about that?\n\n                    HARRY\n\n          If it's true, my life just got\n          made.\n\n                    ERICA\n\n          Why'd you come here, Harry?\n\n                    HARRY\n\n          Because I realized what I was feeling for\n          you, have always felt for you, was\n          something I didn't understand, like a\n          language I didn't speak...\n              (she listens...)\n          It scared me so I did what I do. I snuck\n          away. Turns out the heart attack was easy\n          to get over. You were somethin' else.\n              (she's starting to melt)\n          And when I went to see all those women, I\n          found out I was never really present for\n          any of them. And something inside me at\n          some point, had just...shut off. That's\n          when I think my heart gave out and you\n          saved me. I finally get what it's all\n          about. I'm 63 years old and I am in love\n          for the first time in my life. And that's\n          what I came here to say.\n\n                    ERICA\n\n          Okay, this is the best birthday ever.\n\n                     HARRY\n\n          I know I'm no spring chicken, I figure I\n          only got another 30-40 years in me. Tops.\n          But how 'bout we figure out a way to make\n          this work.\n\n                    ERICA\n\n          Okay.\n\n                    HARRY\n\n          Okay? Okay! I'll take it.\nThe Barge drifts back under the bridge, La Vie En Rose piping\nout of it's tinny speakers.\n\n                    HARRY\n\n          Honey, they're playing our song.\n\n\n\n\n                                                         129.\n\n\n\n\n\n\n\n\n\n\nShe comes close and he pulls her in, kissing her great. And\nas they separate, he smiles, relieved.\n\n                                                   FADE OUT:\n\n\nFADE IN:\n\n\nINT. CHIC EATERY - NYC - A HOT AUGUST NIGHT\n\nThe same restaurant from the first scene of the film - One\nYear Later. Harry ENTERS FRAME, just like he did before.\n\n                     \" HARRY\n\n           Langer, party of four.. .and a\n           half.\nThe Maitre'D snaps to attention and leads Harry, Erica,\nMarin, holding her Baby Girl, and her husband Danny through\nthe crowded restaurant. The Baby fusses and reaches out to\nHarry who takes her in his arms and proudly parades her\nthrough this swanky crowd to a round table in the center of\nthe room. Harry beams at the prize in his arms as he sits\nwith his family for a Sunday dinner.\n\n                                            FADE OUT:\n\n\n\n\n\n\n\n\n\n\nSomething's Gotta Give\nWriters :   Nancy Meyers\nGenres :   Comedy  Romance  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:36:03.637205"}