{"title": "Spartan", "film_link": "/Movie Scripts/Spartan Script.html", "script_link": "/scripts/Spartan.html", "info_raw": "\n\nSpartan Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Brian Helgeland\nGenres  Crime  Drama  Thriller\nScript Date : February 2002\n\nRead \"Spartan\" Script\n\n\n", "script": "\n                         SPARTAN\n\n\n\n\n                     a screenplay by\n\n                       David Mamet\n\n\n\n\ncopyright (c) 2002\n\nby David Mamet\n\nFADE IN:\n\nEXT. WOODED HILLSIDE. DAY.\n\nWe see the drawn face of a young woman. Camera tracks with\nher as she runs through the thick woods. She is exerting\nherself heavily as she moves up a steep hillside. She looks\nbehind her quickly, and continues.\n\nANGLE, we see a young man, and then another, running through\nthe woods, out of breath. They are dressed in filthy BDU's,\nand show several days growth of beard. The leader stops for\na moment, and looks around. The two men separate.\n\nANGLE, the  young woman, who has come to a small ledge, over\na ravine.  She stops, panting, and bends over, to attempt to\ncatch her  breath. She looks around, and looks back, her back\nto a steep  wall, a steep drop before her.\n\nANGLE, the first young man, having come up to the spot\nvacated by the young woman. In the BG we see his colleague.\nHe looks down, and sees movement in the brush below him, in\nthe ravine. He starts to descend, and then looks up.\n\nANGLE, the young woman, pulling herself up the steep\nrockface. The young man regains the ledge and looks up.\nCamera takes him around a bend in the ledge.\n\nStanding here we discover ROBERT SCOTT. He is somewhat older\nthan the two men, he is very fit, also dressed in filthy\nBDU's. He is making a note in a small notebook, which he\ncloses. Now, the two men look across the ravine at the young\nwoman, seen disappearing over a ridge.\n\n                       SCOTT\n                  (quietly)\n             ...you better catch her...\n\nThe man looks around, and begins climbing up the rockface\nbehind him, pulling himself up, hand over hand by the roots\nof trees. Several feet up, he falls on his back. He tries to\nwork himself to his knees and winces in pain. He looks to\nScott for help.\n\n                       SCOTT\n             ...your Dad's napping on the\n             sofa, your Mom's watching Let's\n             Make A Deal, and God is Dead.\n             What do you expect me to do...?\n\n                       YOUNG MAN\n                  (very weakly)\n             ...I'm tired, Sir...Sir, there's\n             no way...\n\n                                                              2.\n\n\n                      SCOTT\n            There's always a way...Don't You\n            tell me there's no way...\n\nA pause, as the man tries again to get to his feet. Scott\nlooks up at the young woman on top of the ridge and gives\nher a \"hold\" gesture. She stops, at his command. Scott nods,\nas if to himself, and then kicks the young man in the ribs.\nThe man starts, his eyes grow, and he gets to his feet.\n\n                      SCOTT\n            How 'bout that? That's called\n            'Adrenaline'. You said you Wanted\n            In.\n\nHe moves into the now-standing young man, and hits him, not\nheavily, but convincingly, several times.\n\n                      SCOTT\n            This is where you get in. The\n            mugger don't care. The shooter\n            don't care...get up...Or I will\n            beat you to death on this fucken\n            hill...Now: you better Catch her...\n\nHe motions with his head. In the BG we see the young woman\nnod, and begin running again. We see her, for a moment,\nbreast a hill, and disappear again...\n\nANGLE, on the young man, as he looks at Scott, empty, now,\nof self-pity, as if he just realized something.\n\n                      SCOTT\n                 (responding to his look.\n                 As if to say \"That's right.\")\n            There's nothing but the mission...\n\nThe young man begins to climb the rockface.\n\nHOLD on Scott for a moment.\n\nINT. TRAINING FACILITY. DAY.\n\nA large, hand-painted sign hangs on the cinderblock wall of\nthe rough building. It reads:\n\n                    These are the precincts of pain.\n                    A goddess lives here.\n                    Her name is Victory.\n\nIn front of the sign walks the young woman we saw earlier.\nShe is exhausted, she has a towel wrapped around her neck.\nCamera takes her to Scott, who is holding a cup of coffee,\nand making notes in the small notebook we saw earlier.\n\n                                                             3.\n\n\nShe stands, waiting, as she finishes his note.\n\n                         SCOTT\n            Well done.\n\n                      YOUNG WOMAN (JACKIE BLACK)\n            A signal honor to work with you,\n            sir.\n\n                      SCOTT\n            Thank you, Sergeant.\n\nHe starts away from her, and she raises her hand slightly,\nto indicate she has something more to say. He turns back to her.\n\n                      JACKIE BLACK\n            Sir: Day or Night. Black or White.\n            You reach out for me. \"Black,\n            Jaqueline A. US 24191489.\"\n\n                      SCOTT\n            I'll remember, Sergeant.\n\nShe nods, and walks off. Scott walks toward a mess tent. He\nis joined by George Blane, a very military-looking figure of\nan older man. He wears an informal fatigue outfit, mismatched\njacket and trousers, without insignia. Scott is greeted by\nhim, as they walk toward the mess tent. Scott shows the\nnotebook to Blane, and Blane refers from the notebook to\nwhat we see are a group of eighty young men, in the mess\ntent, two of them the men we saw on the hill. Blane takes\nthe notebook and walks off, as Scott enters the mess tent.\n\nANGLE HIS POV, Scott enters the tent. Several of the young\nmen react to him. He nods to them. Among them, we see the\nyoung man Scott berated on the hill, who rises and comes\nover to Scott.\n\nANGLE, on Scott, who sits, as a uniformed man brings him a\ntinfoil tray with some food on it. Scott takes out a\nstiletto from his pocket, presses a button and the blade\nemerges. He begins to use it to cut up his meat. The young\nman from the hill, Anton, stands sheepishly near Scott, till\nScott turns, acknowledging him.\n\nAnton takes a card out of his pocket, the size of a credit\ncard, old, creased cardboard: It reads, \"Rogers Rangers,\nRules for Engagement. 1782\". There is a line drawing of a\nman with a musket, and we read, on the card, beneath it,\nboldtype rules for fighting guerilla style. Written on the\ncard, in old faded ink, \"SGT. Anton, M. US. 3149584, United\nStates Special Forces.\" The young man (Anton) shows the card\nto Scott.\n\n                                                           4.\n\n\n                      SCOTT\n                 (of the card)\n            What's this then?\n\n                      ANTON\n            It was my father's, sir.\n\n                      SCOTT\n            He carry it Over There?\n\nAs they speak, we see, in an insert, the printed rules -\n\"Dated 1759\". \"Rule 4: Tell the truth about what you see and\nwhat you do - there is an army depending on us for correct\ninformation. You can lie all you please when you tell other\nfolks about the Rangers, but don't never lie to a Ranger or\nan Officer\".\n\n                        ANTON\n            Yes, sir.\n\n                      SCOTT\n            He come back?\n\n                      ANTON\n            Yes, sir. He did.\n\n                      SCOTT\n                 (nods. Pause)\n            Well, so.\n\nScott pauses again. As he looks at the young man, who is\nobviously unable to express his gratitude, and sense of\noccasion.\n\n                      SCOTT\n            You carry that card, son. It\n            might save your life.\n                 (Anton nods)\n            ...You could use it to light a\n            fire, or something...\n\nBlane's Aide calls the men to order.\n\n                      BLANE'S AIDE\n            The Candidate Cadre will fall in\n            on the White Line...\n\nThe men start to come to their feet, and leave the mess tent.\n\n                      ANTON\n            I just wanted to say, sir...That,\n            to meet you...\n\n                                                              5.\n\n\n                      SCOTT\n                 (rising, as he gives\n                 the Ranger card back\n                 to Anton)\n            You never met me. You've been up\n            for a week. You're seeing Snakes...\n\nThe exhausted men come to their feet, and into a line. They\nare happy, and joking with one another. In the BG we see\nthose who failed the course, sitting apart, file onto a bus\nwhich has just pulled up.\n\nANGLE on a young man, who looks out of the window.\n\nANGLE HIS POV. Twenty or so similarly exhausted men, with\ndufflebags, are being shuffled onto the bus.\n\nANGLE, on the young man, Anton, as he exits the tent, who\nstands next to Scott, outside the tent. Scott stands next to\nan old, but pristine Mustang Cobra. He withdraws a small\ndufflebag from the front seat, and looks up to see Anton\nstanding next to him.\n\n                       ANTON\n                 (looking after the\n                 departing, failed men)\n            ...I can't imagine how they live\n            with it...\n\nANGLE on Scott. As he thinks a very brief moment, as if\nreluctant to become philosophical, and then turns back to Anton.\n\n                      SCOTT\n            Make sure you can't imagine it,\n            cause, if you can, it's just one\n            step to doing it.\n\nAnton shakes his head, sadly, at the spectacle of the failed\nmen.\n\n                      SCOTT\n                 (pause)\n            ...they'll be back where they\n            came from by Morning, and all\n            this is just a Bad Dream.\n\n                      ANTON\n            My name is...\n\n                                                             6.\n\n\n                      SCOTT\n            Do I need to know?\n                 (pause)\n            If I want Camaraderie, I'll join\n            the Masons.\n                 (pause. Then, summing\n                 it all up:)\n            There's just the mission.\n\nBeat. Anton steps away.\n\n                      BLANE'S AIDE\n                 (as he glances down at\n                 his clipboard)\n            Congratulations on completion of\n            this evolution. I know you would\n            probably like some sleep, but I\n            do not think you'd mind sparing\n            ten minutes for Induction.\n\nThe camera pans over the smiling faces of the eight very\nproud young men.\n\nANGLE on Blane and Scott, off to the side.\n\nBeyond them, we see the bus holding the failed candidates,\nfilling up.\n\n                      BLANE\n            Thank you, Bobby.\n\n                      SCOTT\n            Not at all, Sir...\n\n                      BLANE\n            ...You going home?\n\n                      SCOTT\n            ...weather permitting, Sir...\n\n                      BLANE'S AIDE\n                 (in the distance. As\n                 camera tracks with\n                 Blane and Scott)\n            ...as I call your names:\n                 (he consults his clipboard)\n            Grossler, Anton...\n\nThese two men steps forward.\n\nANGLE, on Anton, nodding to himself at the proudest moment\nof his life.\n\nANGLE, CU Scott, looking at him.\n\n                                                                7.\n\n\nCamera takes Blane and Scott into a cinderblock building\nwhich houses a shooting range. We see various housefronts,\nand storefronts, and targets. A long table along one wall\nholds a coffee urn. Blane draws two cups of coffee.\n\nThrough the open door we see Anton and Grossler, smiling,\nentering the building. Anton comes into the room, and smiles\nat Scott.\n\nWe see Scott look away, sadly. He shares a look with Blane,\ndrains his coffee cup, crumples it, throws it away. Blane\ngestures to Scott, meaning, \"Shall we begin?\" Scott\nhesitates for a moment, and then nods.\n\nFOCUS.\n\nANGLE, on Scott, in the BG, as Blane steps forward to\naddress the two candidates.\n\n                        BLANE\n                  (over his shoulder, to\n                  an Aide)\n             ...would you bolt the door,\n             please...?\n\nScott gestures to the Aide, \"One Moment\".\n\n                        BLANE\n                  (to the candidates)\n             ...are you tired, Gentlemen?\n                  (the two young men smile)\n             This is the completion of the\n             evolution:\n                  (beat)\n             Only one of you may join the\n             unit. The first man through that\n             door will be inducted.\n\nHe gestures at a far door in the room.\n\nANGLE, on Scott, as he looks at the candidates, as they get\nthe picture.\n\nBeat.\n\n                       SCOTT\n                  (to himself, quietly)\n             ...yeah...you wanted to know the\n             'secret knowledge'...\n\nCU Scott  as he looks, interrogating the   two men, weighing\nthem, as  they look at each other. Beat.   Grossler starts to\nadvance  on Anton, in a fighting crouch.   Scott gestures to\nthe Aide  that that was what he wanted to   see.\n\n                                                              8.\n\n\nThe Aide lets Scott out of the back door.\n\nEXT. CINDERBLOCK BUILDING. DAY.\n\nScott, showered, in civilian clothes, a lumberjacket and\njeans, comes out of the building, carrying a small, yellow\nduffle-bag. He opens the trunk.\n\nHe takes the yellow bag, and puts it into the trunk which we\nnow see contains woodworking tools - old levels and planes\nand saws. He closes the trunk. We see the young woman from\nthe first sequence, now in civilian clothes, conferring with\na colleague. She nods at him, and he responds. As he starts\nto get into the car. A squad of exhausted men is marching\npast. As they come to a halt one of the men turns in the\ndirection of Scott.\n\n                      DRILL INSTRUCTOR\n                 (to that man)\n            What the hell are you looking at?\n            There ain't nobody there...\n\nEXT. CONSTRUCTION TRAILER. DUSK.\n\nA young worker in a hardhat, by a large gravel pit, at which\nwe find several earthmovers, idle. He is standing by a high\nchainlink fence topped with barbed wire.\n\nANGLE HIS POV. Some half-mile away, the Mustang, heading in\nhis direction on a rough road. The young worker opens the\nlock on the chainlink fence and swings it open.\n\nWe see a sign \"McGarrity Construction Company\" on the gate.\n\nThe young man walks back toward a construction trailer. We\nsee a red light blinking on a telephone on top of a littered\ndesk. The young worker enters the trailer hurriedly, and\nopens a cabinet which we see contains several assault rifles,\nand grenades. Another phone, its red light blinking, is\nfound in the cabinet. The young worker picks up this phone\nquickly.\n\n                      YOUNG WORKER\n                 (into phone)\n            ...Frontgate...\n\nWe see his face grow serious, as he begins to write on a pad.\n\nINT. MUSTANG. DAY.\n\nScott, driving, comes around a bend.\n\n                                                              9.\n\n\nANGLE HIS POV. The construction trailer up ahead. We see the\nyoung worker come out of the trailer, and stand in the road\ngiving a \"Stop\" signal to the car.\n\nANGLE EXT. THE CAR. We see Scott bring the Mustang to a stop,\nand get, inquisitively, out of the car. We see the young\nworker run up to him and hand him a sheet of paper. Scott\ntakes the paper and begins to read.\n\nHe looks up, to ask a question of the young worker. We see\nthe worker begin to respond, his body language saying\n\"That's all I know.\" As he starts to speak his words are\ndrowned out by the sound of a helicopter. Scott looks up.\n\nANGLE HIS POV. A helicopter, flying low.\n\nANGLE INT. THE HELICOPTER. A man in civilian clothes points\nout Scott, on the ground, to the Pilot. Through the canopy\nwe see Scott and the construction canopy down below. The\nhelicopter goes into a tight turn.\n\nANGLE Scott. Above him, the helicopter goes into its turn,\nand begins to descend in a field some fifty yards away.\n\nANGLE, the sheet of paper Scott holds. Is reads: \"All hands.\"\nOver the throbbing of the helicopter, we see Scott giving\ndirections about the car, to the young worker. Camera takes\nScott to the trunk, which he opens, and from which he\nretrieves his gym bag. He hands the keys to the young worker,\nand takes off, running, to the helicopter.\n\nANGLE, on Scott, as he is pulled up aboard, and the\nhelicopter takes off.\n\nANGLE, over the worker, watching the helicopter disappear.\n\nINT. HELICOPTER. NIGHT.\n\nScott, asleep. As the helicopter banks low over the Charles\nRiver and Harvard College. A Crewman shakes him awake.\n\nANGLE, EXT: the helicopter descends into the field of a\nfootball stadium. A black suburban is waiting.\n\nEXT. BOATHOUSE. CHARLES RIVER. NIGHT.\n\nSeen through the windshield of a car.\n\nANGLE, a black, government Suburban pulls outside the\nboathouse. We see scaffolding being erected outside the main\nentrance.\n\n                                                            10.\n\n\nScott and several types in suits get out of the Suburban,\nand proceed toward the door, over which is hung a large,\npaint-spattered drape. A sign on a stanchion reads\n\"Temporarily Closed For Repairs\".\n\nANGLE, INT. THE BOATHOUSE. The group pushes through the\ndrape, beyond which we see several men in suits, holding\nassault rifles.\n\nAn older government type, MILLER, followed by an AIDE, walks\nup to meet the group, the Aide motions to the armed guards\nthat Scott is to be admitted, that he is \"okay\". Miller\ngestures to Scott that it will just be a moment. The Aide\nhands Scott a sheaf of papers, and leads him through the\nboathouse. We see the long skiffs up on their rests, the\nCharles River beyond.\n\nANGLE on Scott. As Scott looks through the papers. Around\nhim we see communications equipment being hurriedly assembled.\n\nANGLE INSERT. The top sheet shows a color photo of a\nphenomenally lovely redheaded girl in her teens. As Scott\ntalks, he leafs through the sheets to reveal several photos\nof her and a man, obviously her father, holding her hand.\nOne is a print of a glossy magazine article.\n\n                      SCOTT\n                 (of the photo, nodding\n                 to himself, as he reads)\n            \"...Betty Coed, has hair of red\n            for Harvard...\"\n\n                      AIDE\n                 (of the top photo)\n            It's not current.\n\n                      SCOTT\n            Why not...?\n\nANGLE on them as they arrive at a small equipment room.\nThrough the door we see a young government type, Gaines, his\nsuitcoat off, his shoulder holster empty, being interrogated\nby several colleagues.\n\n                      AIDE\n            It seems she got a makeover today.\n            We're working on it.\n\nHe hands a small log book to Scott, and points to an entry.\nScott looks down the entries, and glances up, now and then,\nat the man being interrogated.\n\n                                                          11.\n\n\n                      SCOTT\n                 (reads)\n            4PM. Cut n'Curl...\n\n                      AIDE\n            Gave her a crewcut, dyed it\n            platinum blonde...\n\n                      SCOTT\n                 (glancing up at the\n                 man in the chair)\n            Met with her boyfriend at ten.\n            Then...?\n\nThe Aide shrugs, meaning, \"That's it...\"\n\n                      SCOTT\n            ...he's on Post until he turned\n            her over to the Nightwatch...?\n\n                      AIDE\n            He says he was...\n\n                      SCOTT\n            Who else you got...?\n\nMiller gestures to an associate, who comes forward, passing\nphotos to Scott, as Miller goes to look through the glass at\nthe young man being interrogated.\n\n                      AIDE\n            ...we got the boyfriend, Michael\n            Blake.\n\n                      SCOTT\n            ...where is he...?\n\nWe are shown a photo of an Ivy League preppy chap around 18.\nHe is on a sailboat.\n\n                      AIDE\n            Was not in his dorm last night,\n            we're shaking the trees...And...\n                 (Scott is passed\n                 another photo)\n            Professor Gerald Sloane, notably\n            chummy with his female students,\n            of which she was one. Weekend\n            home, Martha's Vineyard...\n\n                      SCOTT\n            ...for sure...?\n\n                                                             12.\n\n\n                      AIDE\n            Been there since Friday.\n\nWe see a photo, obviously from a school catalogue, of a\nyoungish bearded man, in front of a blackboard. We see\nMiller in the BG finish his meeting and turn to the group.\n\n                      MILLER\n            I'm light. I'm light, people...I\n            need another team on the\n            Professor, I need an overwatch\n            on the boyfriend...\n\nThe Aide hands him a sheet of paper, obviously a roster.\n\nScott, looking at the board. He puts down his head for a\nmoment, and blinks his eyes, trying to clear his head.\n\n                      MILLER\n            You just come from the Cadre.\n\n                       SCOTT\n            Yes sir.\n\n                      MILLER\n            How long since you've slept?\n\n                      SCOTT\n            Not significant.\n\n                      MILLER\n            You take a team, and Bulldog.\n            Are you up for it?\n\n                      SCOTT\n                 (absently, as he looks\n                 over the materials he\n                 has been given)\n            Sir, \"this Marine pisses av gas\n            and farts blackpowder, Sir.\"\n\n                      MILLER\n            Thank you for coming, Bobby.\n\n                      SCOTT\n            Are you kidding, sir...?\n\nAn Associate comes over and hands him a piece of paper.\nMiller shakes his head.\n\n                      MILLER\n            I don't have the bodies. Call em\n            in...call em in...\n\n                                                             13.\n\n\nANGLE on Scott. CU. As he watches the interrogation of\nGaines in the next room. The young man begins to pick up his\ncoffee cup, and we see that it shakes.\n\nANGLE on Scott, as he gestures to Miller to look through the\nglass, at the young man being interrogated, who is now seen\nto be wiping his brow, and shaking his head. The young man\ntries to take a sip of coffee, and spills it, inadvertently,\ndown his shirtfront. Scott exchanges a glance with Miller,\nand walks into the equipment room, to the interrogation.\n\nThe man being interrogated, the government type, Gaines, is\nin his early thirties. He is sweating and obviously\nfrightened. An Aide comes and stands by Scott.\n\n                      AIDE\n                 (whispering)\n            His post was Harvard Yard.\n            Harvard Yard, Northeast Corner,\n            Lowell House, across from her\n            dorm. Nightwatch relieved him\n            there, Midnight...\n\nANGLE, on Miller in the interrogation room. Miller nods to\nScott, meaning \"You know what to do.\"\n\nANGLE on Gaines, as Scott enters, the interrogators step\nback for Miller, who is obviously their superior. He motions\nthem to continue.\n\nCamera holds Scott throughout the following interchange,\nwith the suspect and questioners seen reflected in the glass\nof the door.\n\n                         INTERROGATOR\n            Once more:\n\n                      GAINES\n            She, uh. She had lunch with her\n            father.\n\n                      INTERROGATOR\n            Lunch with her father - you\n            seconded to that detail?\n\n                      GAINES\n            No, sir. I just had her.\n\n                      INTERROGATOR\n            \"...you just had her...\"\n\n                      GAINES\n            I. Uh...uh. I had her all day.\n            Tucked her in. At Ten. And she...\n\n                                                      14.\n\n\n                      INTERROGATOR\n            ...yeah, \"she had a tiff with\n            her boyfriend...\"\n\n                        GAINES\n            Yes. I...\n\n                      INTERROGATOR\n            Michael Blake -\n                 (he holds up a photo\n                 of a preppy fellow)\n\n\n                      MILLER\n            What was it about?\n\n                      GAINES\n            I think it was about her...her...\n                 (he makes gestures of haircutting)\n\n\n                      MILLER\n            Her haircut...\n                 (Gaines nods)\n            So it wasn't a serious...?\n\n                      GAINES\n            No, no.\n                 (pause)\n            No.\n                 (pause)\n            And then I,\n                 (he covers his mouth\n                 as he speaks)\n            I held the post until relieved...\n                 (he gestures at his\n                 notebook, as if to\n                 support him)\n\n\nMiller motions at Scott.\n\n                      MILLER\n            Well, then, we've got a little\n            problem.\n\n                      GAINES\n                 (shaking his head in denial)\n            I was there.\n\n                                                            15.\n\n\n                      MILLER\n                 (reading)\n            23.12 Hours, 19 May. Harvard\n            Yard, Northeast Corner, Lowell\n            House, reveals no Secret Service\n            Presence, neither this post nor\n            adjacent...\n                 (he looks through his notes)\n            ...a second tour, 23.30, reveals,\n            similarly...\n\n                      GAINES\n            I was there, Sir.\n\n                      MILLER\n                 (to Gaines)\n            Who's lying?\n                 (pause)\n            You or him?\n                 (pause. Gaines slightly\n                 averts his head.)\n\n\nANGLE on Miller, who gives an infinitesimal sign to Scott\nwho steps forward and slaps Gaines across the face.\n\n                      SCOTT\n            You son of a bitch, I've got\n            fifteen years in, and three kids,\n            and you're gonna sit there, and\n            lie away my Pension...\n\nHe makes a move toward Gaines.\n\n                      GAINES\n            I...\n\n                      SCOTT\n            ...don't you tell me you were\n            there...\n\n                      GAINES\n            I was On Post...\n\n                      SCOTT\n                 (as he moves towards\n                 Gaines seriously)\n            ...you lying swine...Don't you\n            tell me you were On Post!\n\nMiller gestures to a couple of the types who take Scott out\nof the room and sit him forcefully, in a chair...cautioning\nhim to stay still.\n\n                                                           16.\n\n\nMiller now stands by him.\n\nHOLD on Scott who uses the pause to review the documents he\nholds, the photos of the girl, of the Boyfriend, of the\nProfessor. He picks up another glossy magazine showing the\nredheaded girl - the caption reads \"America is Seeing Red\".\n\n                      INTERROGATOR\n            Shall I tell you what's gonna\n            happen to you, when we find you out?\n\n                      GAINES\n            ...I...\n                 (he gets up and walks,\n                 wearily, toward the\n                 windows, and turns)\n            I...Uh...\n\n                      INTERROGATOR\n            Were you fucking her...?\n                 (pause)\n            We're gonna find out...\n\n                      GAINES\n            No, I...um...\n\n                      INTERROGATOR\n            ...Where Is She?\n\nScott turns, to Miller, who is seen, beyond the door, in\nconference with several government types.\n\nScott leaves the room, and is seen, on the outskirts of the\nconference.\n\n                      MILLER\n            We've got until her Monday\n            Morning Class, and then it's\n            Meet the Press; and \"Where is\n            she...?\"\n                 (he shakes his head)\n            Who's got the Professor...? Where\n            is he...?\n\n                      AN AGENT\n            Martha's Vineyard.\n\n                      MILLER\n            Who's got him?\n\n                      AN AGENT\n            Jones and Shannon.\n\n                                                            17.\n\n\nThroughout this section camera holds Scott. As he looks\nthrough the file, the various photos, and notations, and\ntakes notes in as small pocket notebook, in which we also\nsee the small cardboard card of \"Rogers Rangers Rules of\nEngagement\".\n\n                      MILLER\n                 (to the group)\n            Wake him up, shake him up. He\n            don't want to talk...\n                 (he holds out his hand,\n                 and an Aide puts some\n                 papers into it)\n            Here's what we have him doing\n            with his Female Students, show\n            'em to his wife...The Photo...?\n                 (one of the agents\n                 brings in two photographs)\n            Here is the last known photo...of\n            the girl.\n\nHOLD on Scott, at the back of the group, taking notes. We\nsee him holding several newsclippings. One of them shows the\ngirl, and the headline reads \"America is Seeing Red.\"\n\nWe see the photo blown up, of the ravishingly beautiful\nyoung girl with long red hair. It features a small, red\nenamel crescent earring. The second photo shows the same\ngirl, in the same pose, but now her hair is short and\nplatinum blonde and spiky. The agent opens two boxes and\nbegins distributing the photos to the group.\n\n                      MILLER\n            The lab ran it up, based on the\n            testimony of the beauty shop. We\n            have not told Boston or Cambridge\n            PD, nor have we...\n\nAn agent comes up and hands him a sheet of paper.\n\n                      AN AGENT\n            The Professor...\n\n                      MILLER\n                 (to the associate)\n            You had him in his home...\n\n                      AN AGENT\n            Sir, we were in Error, we...\n\n                      MILLER\n            Where is he...?\n\n                                                             18.\n\n\n                      AN AGENT\n            Best guess puts him on his boat.\n            Last seen out of West Tisbury,\n            Martha's Vine...\n\n                      MILLER\n            Find him. Put the guard on him.\n            Get me an overflight.\n                 (generally)\n            I'm light, I'm light, people.\n                 (he points to an associate)\n            Shake the Trees. I'm light,\n            here...I'm 25 men light. Get 'em\n            in. Who's got the\n            Coastguard...What's the name of\n            his boat? Professor Gerald Sloane...\n\nAn Aide comes in, hurriedly.\n\n                      AIDE\n            It's the boyfriend. He's moving...\n\nMiller points at Scott, who rises.\n\n                      SCOTT\n            I've got him...\n\n                      MILLER\n                 (coming over to Scott)\n            ...I've got two days to run in.\n            Before the Press wakes up.\n\n                      SCOTT\n                 (as he responds to the\n                 inherent request in\n                 Miller's voice)\n            Whatever it takes, sir...\n\nMiller nods his appreciation.\n\nScott exits, and we HOLD on Miller giving orders to his group.\n\nEXT. HARVARD YARD. NIGHT.\n\nTwo students, walking through the yard. They acknowledge a\nuniformed security guard, who walks, with his back to us.\n\nA slight, Asian young woman, her arms full of books, walks\ntoward the camera, hurrying. She indicates something, back\nover her shoulder, and the guard, who is in front of the\ncamera, walking away, veers off in that direction.\n\n                                                             19.\n\n\nEXT. VESTIBULE, HARVARD DORM. NIGHT.\n\nA young man (MICHAEL BLAKE) is, furtively, working on\njimmying open one of a set of mailboxes. He senses something,\nand turns.\n\nANGLE HIS POV. The Security Guard (Scott) standing just\nbeyond a glass door, looking in at him. Scott enters, coming\nto camera.\n\n                      SCOTT\n            Could I see your hands, son...?\n\nThe Boy, Blake, moves his hands away from his body, to show\na screwdriver. Scott motions him away from the mailbox,\nwhich we see is in the process of being demolished. Scott\nreads the name on the mailbox.\n\n                       SCOTT\n            L. Newton.\n                 (pause)\n            You lose your mailbox key, Mr.\n            Newton...?\n                 (pause)\n\n\n                      BLAKE\n            Um.\n\n                      SCOTT\n            You a student here?\n\n                      BLAKE\n            Yes.\n\n                      SCOTT\n            Could I see some identification,\n            please...? Mr. Newton?\n                 (Scott takes out a\n                 walkie and begins to\n                 talk into it)\n            Ten-Twelve patrol, requesting...\n\n                      BLAKE\n            No, please...please...\n                 (pause)\n            Please, Oh, God.\n\nHe starts to advance on Scott, who draws a nightstick, and\nkeeps him at bay.\n\n                      SCOTT\n            Calm down, Son. It's gonna be\n            what it's gonna be...\n\n                                                          20.\n\n\n                      BLAKE\n            One minute, could I please talk\n            to you for one minute...Look\n            look look: I broke up with My\n            Girlfriend...\n\nANGLE EXT. THE VESTIBULE. The young Asian girl, now walking\nwith a male friend, pass in front of the vestibule. Beyond\nthem we see Blake and Scott, as Blake motions to the mailbox,\nand moves to the mailbox and takes out a letter.\n\nANGLE INT. THE VESTIBULE. On Scott, as he watches Blake take\na letter out of the jimmied mailbox.\n\n                       SCOTT\n                 (of the letter)\n            Laura.\n                 (he rereads the\n                 nameplate on the mailbox)\n            Laura Newton?\n                 (pause)\n            Laura Newton? Is that 'the' Laura\n            Newton...?\n\n                      BLAKE\n            We broke up. Alright? Laura\n            Newton. They know who I am.\n\n                      SCOTT\n            Who?\n\n                      BLAKE\n            The Secret Service.\n\n                      SCOTT\n            The Secret Service?\n\n                      BLAKE\n            That's right, that's right. They\n            know who I am. You...They've\n            \"cleared\" me.\n\n                      SCOTT\n                 (gesturing to the\n                 jimmied mailbox)\n            They didn't clear you for this.\n\n                      BLAKE\n            You, you hear me out, and, if\n            you want to, Then...\n                 (pause)\n            Okay? Okay???\n                 (pause)\n\n                                                             21.\n\n\n                        SCOTT\n              I have to call it in.\n\n                        BLAKE\n              Please...please. Five\n              minutes...That's all I want.\n              Please. Please...She\n              would...she...\n                   (his face brightens at\n                   the new idea)\n              Maybe she's in her room!\n\n                        SCOTT\n              You tried the bell, you called\n              her...\n\n                        BLAKE\n                   (as it dawns on him)\n              Maybe she's ill...\n\nINT. CORRIDOR, HARVARD DORM. NIGHT.\n\nBlake and Scott, as they walk up to a door. Scott knocks on\nthe door.\n\n                        SCOTT\n              ...Mzz Newton...?\n                   (pause)\n              Mz Newton...this is Campus\n              Security...\n\nHe begins to fumble with keys at his belt.\n\nANGLE INT. THE ROOM. Several agents, obviously involved in\ninvestigating the room, wearing plastic gloves, stop. One,\nsilently, unlocks the door.\n\nWe   see Scott enter the room, \"miming\" using a key, and turn\non   the light and look inside. We take him to her desk, where\nhe   finds several photos of her and her father - and a note\non   he desk, reading \"Dear Dad-Thanks for coming-signed %-)\".\n\nWe see the boy, Blake, out in the corridor, unable to see\ninto the room.\n\n                        SCOTT\n              Mz Newton...?\n                   (pause)\n\n\nANGLE, in the hall, as Scott and Blake stand there, a young\ngirl comes down the hall and stops, opposite her room.\n\n                                                             22.\n\n\n                      YOUNG GIRL\n            Hey, Mike. Sprised to see you\n            there.\n                 (smiles)\n            That was some Vicious Performance...\n\nShe smiles brightly and goes into her room. Scott looks at\nBlake.\n\nEXT. HARVARD YARD. NIGHT.\n\nBlake and Scott sitting on a bench in the deserted yard.\nScott holds the envelope and the letter, on which we see\nthis symbol %-) and begin to read: \"This is a sham. Your\nview of the world is not cockeyed, but corrupt. You cunt.\nAnd you deserve everything that is going to happen to you...\"\n\n                      BLAKE\n            ...I was just...trying to\n            retrieve the letter.\n\nANGLE, on Scott, as he looks at the letter.\n\n                      SCOTT\n            ...this is not very nice language.\n                 (pause, Blake looks away)\n            How old is this girl?\n\n                       BLAKE\n            She's...just turned 18.\n                 (Scott shakes his head,\n                 sadly. pause)\n            I was mad.\n\n                      SCOTT\n                 (of the letter:)\n            ...\"everything that's going to\n            happen to her\"...What was going\n            to happen to her?\n                 (pause)\n            You hurt her...?\n                 (pause)\n            Did y'hit her, son...?\n\n                      BLAKE\n            Hit her? No. I...\n                 (he gestures to the note)\n            I called her...I called her a\n            whore...I...\n\n                      SCOTT\n            Why...?\n\n                                                          23.\n\n\nThe boy bangs his head. Scott, as he rises, brings Blake to\nhis feet.\n\n                      SCOTT\n                 (as if realizing \"This\n                 is the question\")\n            Where is she?\n\n                      BLAKE\n                 (as if the question\n                 had not occurred to\n                 him previously)\n            She must...she must...she must\n            have gone home...\n\n                      SCOTT\n            Why...?\n\n                      BLAKE\n                 (gesturing around, quietly)\n            Because the Secret Service, isn't...\n\nAs they walk by a parked van, we cut inside the van. Where\nwe see a Secret Service type. Through the windshield we see\nScott gesture \"Do Not Intervene.\"\n\nANGLE, on Scott and Blake, as they walk down the near-\ndeserted Mass Ave.\n\n                      SCOTT\n                 (of the sign on the\n                 letter,the \"Picasso\"\n                 sign, that is %-}. He\n                 turns the sign\n                 rightside up to show\n                 it is a 'cockeyed smile')\n            What is this sign?\n\n                      BLAKE\n            It's how she signs her letters.\n                 (smiles)\n            Cause she looks at everything\n            cockeyed...Like Picasso - she\n            said they called her \"Picasso\".\n                 (pause)\n\n\n                      SCOTT\n            Who called her that...?\n\n                                                             24.\n\n\n                      BLAKE\n            You know, her, her...\n                 (remembering)\n            He saw her yesterday! Maybe\n            she's...maybe she's with him!\n\n                      SCOTT\n            Why'd you fight with her, Son...?\n\n                      BLAKE\n                 (pause)\n            She, uh, she got her hair\n            done...She cut it off. She dyed\n            it blonde. I said she looked\n            like a slut...and...\n                 (pause)\n\n\n                       SCOTT\n            Beautiful young girl like that.\n            We've all seen her pictures.\n            What'd you care how she dyed her\n            hair?\n                  (pause)\n            What'd you care...? Why's that\n            make her a slut...?\n                  (pause)\n\n\n                       BLAKE\n            She...\n                  (pause)\n            Uh...\n\n                      SCOTT\n            She seeing another fella...?\n                 (as he moves closer, confidingly)\n            ...just between us. Off-the-\n            record, son...\n\nANGLE, INT. THE VAN. We hear the conversation, and see the\ntape machine moving.\n\n                      SCOTT (V.O.)\n            ...I was young once, too.\n\n                      BLAKE (V.O.)\n            I...\n\nANGLE EXT. THE VAN. Blake and Scott.\n\n                                                          25.\n\n\n                      SCOTT\n            I know that nothing hurts worse\n            than that. She seeing another\n            guy...?\n\n                      BLAKE\n            I...\n                 (pause)\n            There's this, um...Teacher...I\n            shouldn't, I, I shouldn't tell\n            you this: She...\n\n                      SCOTT\n            She sleeping with a teacher...?\n\n                      BLAKE\n            She says she isn't. I said she\n            looked like a slut. She wants to\n            fuck old guys, she should go to\n            The Regency. Go all the Way.\n\n                      SCOTT\n            The Regency, what's that?\n\n                      BLAKE\n                 (as if everyone knows\n                 this place)\n            S'the Club, by the Fenway...it's\n            like a joke at school, it's like\n            a rumor: this or that girl, made\n            a thousand bucks, went with a\n            businessman for One Night...\n            Look: it's a Lover's Quarrel. I\n            said something I regret. I sent\n            her a note which I regret, and I\n            assure, you, Officer. If...\n                 (pause)\n            If you would...\n\nANGLE. From inside the windshield of the van we see, through\ntheir body language, that Scott is \"giving the boy a break\",\nthe boy is very thankful. Scott is admonishing him and the\nboy is contrite. Now Scott begins to walk away, and we see\nhim minutely, signal to the van, we see the driver of the\nvan pick up a phone and speak softly into it.\n\nANGLE, Scott, walking down a sidestreet. The boy in the BG,\nwe see the young Asian girl, take up a tailing position some\nhalf-block back of the boy, as a car glides to the curb. And\nScott gets in.\n\nANGLE, tight on Scott in the car, as he rubs his eyes,\nbeyond exhaustion. The car pulls away.\n\n                                                          26.\n\n\nHe gives several instructions to the young man driving, and\nthen leans back, eyes closed. He opens his eyes again, and\nwe see him mouth, insistently, \"The Regency\". The driver nods.\n\nINT. BOATHOUSE. NIGHT.\n\nAs Scott enters. The activity is more widespread than\npreviously. An agent walks him into the fray.\n\n                      AGENT\n            No morgue. No hospital. No note.\n\n                      SCOTT\n            The parents?\n\nAgent, nods, shrugs.\n\n                      AGENT\n            The mother,\n                 (makes a \"drinking\" gesture)\n            You know where she is...He's\n            holding up...\n                 (as an afterthought)\n            He was in town yesterday. To see\n            her.\n\n                      SCOTT\n                 (as he shakes his\n                 head - to clear it)\n            He was?\n\n                      AGENT\n            ...we snuck him in, and out.\n\nWe see Miller, in the BG, in a hurried conference, nod at Scott.\n\n                      MILLER\n                 (looking at a chart)\n            \"The Colophon - 36-foot sloop\".\n            Where is she...?\n\nThey walk off, an Aide talking to him.\n\n                      AIDE\n            ...the Coast Guard has a watch\n            over this area:\n                 (he points to the chart)\n            And they have scheduled the\n            Colophon first...\n\nScott and the Agent stop in front of the interrogation room,\nwhere we see the agent, Gaines, a guard over him. Gaines is\nsitting, looking as if he had been weeping. The guard\naddresses Scott and the other agent.\n\n                                                             27.\n\n\n                      GUARD\n            He copped to it.\n\n                      SCOTT\n            He copped to what?\n\n                      GUARD\n                 (of Gaines)\n            Off-post - punched out early to\n            go boffing his girlfriend.\n\nScott shakes his head as if to say \"How about that...\" The\nagent holds a photo of a very lovely Eurasian woman in a\nbusiness suit, and shows it to Scott.\n\n                      AGENT\n            Hope she was worth it...\n\n                      SCOTT\n            Uh huh.\n\nScott stands wearily, watching several large men berating\nthe seated Secret Service Agent. An agent appears with a\ntearsheet showing the ad for \"The Regency Club\". We see the\nad for exotic young companions, and the address is Boston.\nScott gives instructions to the Aide.\n\nANGLE INT. WASHROOM. Scott, having stripped off his shirt,\nis washing himself at the sink. The \"Regency\" ad, and a\ndescription of the club is pasted with water to the mirror\nbefore him. We read, in the mirror: \"REGENCY. 243 Charles\nStreet, Boston, Mass. Owners of Record...\" Et Cetera. In the\nmirror we see the Aide bring a fresh shirt and a tie to\nScott. Scott turns, as the door swings, and he sees, in the\nBG, ANTON, just entering the establishment.\n\nANGLE INT. THE BOATHOUSE. A Swat team is laying out its\nweapons and assault gear, on a long table.\n\nHOLD on Anton, who is standing, unassigned, and looking it.\n\nWe see, on an improvised bulletin board, photos of the Boy,\nBlake, the Professor, and the Girl, blown up from a\nnewspaper shot, and in various photos. As we watch an Agent\nwalks up with a box full of photos, and tacks one up on the\nboard. It is an altered shot showing the young girl with\nshort, spikey platinum hair.\n\nANGLE on Scott, dressed in a clean shirt, a tie, as he takes\na photo from the box. We see him put it next to the original,\nblonde photo, and look at both.\n\n                                                            28.\n\n\n                      AGENT\n            We ran it up from a description\n            of the colorist from the Beauty\n            Parlor...\n\n                      SCOTT\n            Gimme your coat.\n\nThe Agent takes off his suitcoat, and gives it to Scott, who\nputs it on.\n\nANGLE, on Scott, as he holds the photos, and the Regency\ndescription. He walks toward the door, through the mass of\nagents. He stops by Miller, who is on the phone, looking at\na photograph of the Professor, as a tech hooks up a video\nfeed of a house on the water, the Professor's house. A photo\nof a sailboat is tacked up. We read 'The Colophon' on its stern.\n\n                      SCOTT\n                 (to Miller)\n            I need five thousand dollars.\n\nMiller gestures \"Just a Moment\", and then waves to an Aide,\nmeaning \"Do It\".\n\n                      SCOTT\n            How long do we have? Sir?\n\n                      MILLER\n                 (shakes his head)\n            It hits the papers, and we're done.\n\n                      SCOTT\n            No...note? No...\n\nMiller shakes his head, he holds up the \"Regency\" note...\n\n                      SCOTT\n                 (nodding)\n            I've got it...\n                 (to Miller)\n            Can I have some backup?\n\nMiller, gesturing around the room, meaning \"what you see is\nwhat you get\". All the occupants of the room are engaged on\nsome task, save Anton, who sits alone on a bench. Scott\nlooks at Anton, who glances at Scott, trying to keep the\nappeal out of his glance, \"Please take me\".\n\n                      SCOTT\n                 (to Anton)\n            We're scraping the bottom of the\n            barrel here, aren't we?\n\n                                                             29.\n\n\n                        ANTON\n            Yes. Sir.\n\nScott looks at Anton and shakes his head. He is summoned to\nthe front of the room by a young woman, who is putting cash\ninto an envelope. Scott comes over to her, and we see her\nfilling out a slip of paper. She hands him the cash in the\nenvelope, and the slip of paper.\n\n                      YOUNG WOMAN\n            I need you to sign it.\n\n                      SCOTT\n            You sign it.\n                 (He scans the room\n                 again, shrugs, and\n                 motions to Anton)\n            Come on, Wallflower...\n                 (Anton rises and walks\n                 over to him)\n\n\nScott turns to Anton.\n\n                      SCOTT\n            Now: your mouth shut. Your eyes\n            open, and form on me...Here's\n            where we're going...\n\nThere is the sound of a gunshot. Scott and Anton\ninstinctively take cover against the side of the building,\ndrawing their sidearms.\n\nHOLD TIGHT on Scott. As he looks through the half-open door.\n\nWe see several of the Swat men, taking up positions, one of\nthem kicks open a door, and his partner enters. Pause. We\nhear the partner call \"clear\".\n\nANGLE, on Scott, as he re-enters the building, and proceeds,\npistol out, toward the room.\n\nANGLE HIS POV. On the floor, we see the dead Secret Service\nAgent, a pistol in his hand.\n\nWe see Miller turn to his team. An Agent kneels to the\nfallen Secret Service Agent, and prods a small hideout\npistol from his hand. Scott turns to leave, and sees Anton\nstanding next to him.\n\n                                                            30.\n\n\n                      SCOTT\n            Don't look at him. Don't look at\n            the Downed Man. He's dead...\n                 (as he turns his back\n                 on the scene)\n            Kick the fool overboard...\n\nANGLE on Anton and Scott as they leave. In the BG we see\nMiller et al. Miller giving directions.\n\n                      MILLER\n            ...who is the girl he went to\n            see? Get her in...The girl he\n            was fucking...Who's got the\n            Coastguard...\n\nTIGHT on Anton and Scott as they exit the building.\n\n                      SCOTT\n            I'd hate to be the Lucky Duck\n            who frisked him...\n                 (beat)\n\n\n                      ANTON\n            He was off-post when they\n            snatched the girl?\n\n                      SCOTT\n                 (as he looks at the\n                 fallen agent)\n            Yeah. Well, apparently, he felt\n            bad about it...\n\nEXT. REGENCY CLUB. NIGHT.\n\nA garish neon sign, beneath which we see a couple exiting,\ngetting into their limo. Scott, in his sportcoat, walks up\nto the large and threatening bouncer at the velvet rope to\nthe club. We see the bouncer bar his way, and gesture to his\nwatch, meaning \"closing up\".\n\nANGLE INS. Two one-hundred dollar bills are passed to the\nbouncer.\n\nANGLE, Anton, in a cab across the street, looking on.\n\nANGLE INT. THE REGENCY CLUB. Several well-dressed couples\nare leaving. A group of raucous, drunk businessmen types\npush past them. Scott walks up to the bar. The Bartender is\nbeginning to ring out the cash register. In the BG we see a\nmanager eye Scott, and continue to direct the closing\noperations.\n\n                                                          31.\n\n\n                      BARTENDER\n            Closing up...\n                 (he points to his watch)\n            Can't sell you booze after 3 AM.\n\n                      SCOTT\n                 (laying money on the bar)\n            No, no. I just came buy to pay\n            you that money I owe you.\n\nHe gestures to the bills on the bar. The Bartender swoops\nthem up, and gestures to the back bar, meaning \"What'll you\nhave?\" Scott points to a bottle of Bourbon, the Bartender\npours for him.\n\n                      SCOTT\n                 (as he drinks)\n            ...how about them Sox, huh...?\n\n                      BARTENDER\n            Yuh. Whaddaya gonna do...?\n\n                      SCOTT\n            \"Curse of the Bambino\".\n\n                      BARTENDER\n            ...that's right.\n                 (pause)\n\n\n                      SCOTT\n            Nice place you got here.\n\n                      BARTENDER\n            You from out of town...?\n\n                      SCOTT\n            Yeah, you know, actually, I was\n            just looking for my Daughter...\n\n                      BARTENDER\n                 (as he smiles)\n            ...that's what you're looking\n            for...?\n\n                      SCOTT\n            ...I. Uhh...\n\n                      BARTENDER\n            ...ask, because a lot of out-of-\n            town guys, come in, lookin,\n            someone else's daughter.\n\n                                                           32.\n\n\n                      SCOTT\n            No, I...Oh, no...\n\n                      BARTENDER\n                 (smiling)\n            You sure...?\n\n                      SCOTT\n            Abso, absolutely...\n\nHe brings out his case, with the photo of the platinum-\nhaired girl. The Bartender comes over and glances at it.\n\nANGLE XCU on Scott as he looks incisively at the Bartender,\nwho displays no flicker of recognition.\n\n                      SCOTT\n            ...girl like that been in\n            tonight...?\n\n                      BARTENDER\n            ...pretty girl...\n\n                      SCOTT\n            None prettier.\n\nANGLE on Scott, who looks around the club. We see him eyeing\nthe lovely young scantily clad waitresses, who return his\nlooks with disdain. The Bartender, observing him, comes back\nto him.\n\n                      SCOTT\n            Yeah...I'm looking for a girl\n            like that...\n\n                      BARTENDER\n            ...You're sure it was your\n            daughter...? B'cause, a lot of\n            guys, come in here, guys your\n            age, go home with some...some\n            rather 'younger' girl...\n\nThe Bartender smiles.\n\n                      SCOTT\n                 (as he leans forward)\n            Well, why would a, one of these\n            'younger girls'. What would they\n            want to do with me...?\n\nThe Bartender leans close and hesitates. Scott takes out\nseveral more bills and passes them to the Bartender.\n\n                                                               33.\n\n\nHe hesitates a second, as if to say   \"You wouldn't fuck me,\nwould you...?\" The Bartender signs,   \"I am your man\", the\nBartender takes the bills and leans   close and whispers to\nScott, indicating someone over in a   dark corner.\n\nIn this corner, as the lights are flicked up, we see a\nyoungish man in very expensive casual clothes, an American,\ndressed like Eurotrash, sitting talking with the man we saw\nearlier was the Manager. As Scott approaches, we see the\nManager, knowingly, drift off. Beat. The young man (ZIMMER)\nrises from the booth, and tugs himself into neatness, and\nstops, as if bemused by Scott.\n\n                      ZIMMER\n            'Howdy, Pard'.\n\n                       SCOTT\n            Hello. I wonder if you could\n            help me...\n\n                      ZIMMER\n                 (as he yawns and looks\n                 at his watch, as he\n                 pushes past Scott)\n            I love you, Baby, but the\n            season's over...\n\nZimmer starts for the front door, and Scott falls into step\nwith him.\n\n                      SCOTT\n                 (gestures at the Bartender)\n            ...my friend says that\n            you're...you're sort of a\n            'matchmaker'...\n\n                      ZIMMER\n            Izzat what he says...?\n\nCamera takes the two out of the front of   the club, where\nZimmer tips the bouncer, who his putting   on his coat,\npreparatory to going away for the night.   Zimmer begins\nwalking into a parking lot, where we see   several run-down\nemployee's cars, and his, Zimmer's prime   Mercedes. Scott\ntags along.\n\n                      BOUNCER\n                 (as he walks away, to\n                 Zimmer, of Zimmer's car)\n            I put her back in your space...\n\n                      SCOTT\n            I was looking for a girl...a\n            young girl...\n\n                                                             34.\n\n\n                      ZIMMER\n            Aren't we all.\n\n                      SCOTT\n            My, my, my, my, my, my question\n            was: why would a young girl want\n            to go out with an older man like\n            me? And, if you could \"answer\"\n            that...\n\nHe takes out money from his pocket. Zimmer begins to speak\nslightingly, dismissively to the 'hick'.\n\n                      ZIMMER\n            Look, Bub...\n\nZimmer starts to open his car door. He turns back to Scott,\nand we see, Zimmer's POV, Anton, standing behind Scott, at\nthe doorway to an alleyway. Obviously backing Scott up.\n\nANGLE CU, Zimmer reacts infinitesimally, to the sight of Anton.\n\nANGLE XCU, Scott, sees him, and slams him against the side\nof the car. Zimmer reaches through the half-open door, and\ncomes out with an automatic pistol in his hand. Scott kicks\nhim in the stomach, Zimmer tries to raise the hand with the\ngun, and Scott throws him to the ground, the pistol falls on\nthe concrete.\n\nANGLE on Scott as Anton emerges from the alley. Scott\ndirects him to drag Zimmer into the alleyway, near a\ndumpster. Anton thrusts his hand into the car and starts to\nreach for the dropped pistol.\n\n                      SCOTT\n            Don't touch the piece, don't\n            touch the piece, don't touch the\n            piece, th'out your gloves on...\n\nANGLE INT. THE SMALL ALLEYWAY. As Anton now pulls off\nZimmer's sportcoat, and begins emptying the pockets. Scott\ninterrogates Zimmer.\n\n                      ZIMMER\n            ...I think you broke my arm.\n\n                      SCOTT\n                 (as he shows the photo\n                 to Zimmer)\n            You seen this girl before...\n\n                      ZIMMER\n                 (of his arm)\n            ...I think it's broken...\n\n                                                          35.\n\n\n                      SCOTT\n            You seen her tonight...?\n\nZimmer turns away from the photo.\n\n                      ZIMMER\n            ...I think it's...\n\n                      SCOTT\n                 (to Anton)\n            Pull him up...\n\nAnton pulls Zimmer to his feet. Scott puts a lock on Zimmer\nand breaks his arm. Zimmer screams.\n\n                      SCOTT\n            Now it's broken.\n                 (of the picture)\n            What's her name...?\n                 (pause. He strikes\n                 Zimmer in the face)\n            WHAT'S HER NAME...\n                 (to Anton)\n            Break his other arm...\n\n                      ZIMMER\n            I DON'T KNOW HER NAME...\n\n                      SCOTT\n            You don't know her name, then\n            who is she...?\n\n                      ZIMMER\n            Some, some 'girl'...\n\n                      SCOTT\n            Some 'girl', some 'pal' of yours?\n            Where is she Now...?\n\nAnton, tossing Zimmer's coat, comes up with a small medicine\nvial. He holds it up to Scott. Who takes it, looks at it,\nsniffs it. Pause.\n\n                      SCOTT\n                 (to Zimmer)\n            Oh no...\n                 (pause)\n            Oh no...this isn't Rohypnol...\n                 (pause)\n            Is it...?\n                 (pause)\n            Izziz Rohypnol? Is this \"Rho\"?\n                 (pause)\n            IZZIZ A ONE-SIDED CONVERSATION...?\n                 (to Anton)\n            Whatzisname?\n\n                                                            36.\n\n\n                      ANTON\n                 (looking at his\n                 driver's license)\n            Donny Zimmer.\n\n                      SCOTT\n            Donny. Donny: where's the girl...?\n                 (pause)\n            You dose her...?\n                 (pause)\n            Where is she? Donny...?\n\nAnton tossing Zimmer's clothes comes up with an envelope.\nScott takes it, and leafs through many bills.\n\n                      SCOTT\n            ...what is this? Ten, what is it,\n            Fifteen thou...? For what...?\n\n                      ZIMMER\n            I never saw that girl...\n\n                      SCOTT\n            Oh, alright, then we've got to\n            let you go...\n\nANGLE CU, Scott.\n\n                      SCOTT\n            Where'd you take the girl,\n            Donny...?\n                 (pause. Silence. To Anton)\n            You touch his piece?\n\n                      ANTON\n            No.\n\n                      SCOTT\n            Good.\n\nScott gestures to Anton to let Zimmer go. Zimmer hesitates,\nknowing he must not move. Scott holds the photo to Zimmer's\nface.\n\n                      ZIMMER\n            THAT'S NOT THE GIRL...THAT'S NOT\n            THE GIRL!\n\n                                                             37.\n\n\n                      SCOTT\n            That's not what girl...?\n                 (pause)\n            Where'd you take her...?\n                 (Scott points to\n                 Zimmer's pistol. To Anton)\n            Put your glove on. Pick up his\n            pistol. Two knees, the other\n            elbow,\n                 (he points to the head)\n            Mozambique...\n\nANGLE XCU, Anton looking at Scott, to say \"Really\"?\n\nANGLE XCU Scott, nodding back, \"Really\".\n\n                      SCOTT\n            You bet your life.\n\nScott starts to walk away. Zimmer begins screaming.\n\n                      ZIMMER\n            Wait...Wait...Wait...\n\nEXT. NORTH END, BOSTON QUIET STREET. NIGHT.\n\nA large Mercedes is parked outside on the quiet street. A\nchauffeur reads the paper, he half turns, sleepily, at the\nsight of a man walking across the street.\n\nANGLE Scott and Anton pulling up in a Camaro.\n\nANGLE INT. THE CAMARO. Scott and Anton, as he turns off the\nmotor. He looks over at Anton, who holds a piece of paper.\n\nANGLE THEIR POV. A townhouse across the street. A large\nMercedes in the courtyard driveway. Beat. Scott and Anton\nwatch, as a door starts to open.\n\n                      SCOTT\n            ...okay, then...\n\nAnton begins to respond, when Scott gets out of the car,\nmotioning Anton toward the Mercedes.\n\nANGLE EXT. THE TOWNHOUSE. We see a middle-aged Businessman\ncoming out of a side entrance, adjusting his clothes as he\nwalks. As Scott walks nearby - we take him to a garbage pail,\nwhere he retrieves a small black bag - that is, as used to\ntransport dog shit. He walks up.\n\nANGLE, on Anton, getting out of the Camaro. Behind him,\naround the corner, we see a dark van pull up. Anton motions\nthe van to hold.\n\n                                                             38.\n\n\nANGLE, on Scott. As he walks up toward the Businessman,\nholding the black bag. He whistles once or twice for his dog,\nand then turns to see the Businessman.\n\n                      SCOTT\n            ...beautiful night...\n\n                      BUSINESSMAN\n                 (nods)\n            'Less you got hayfever...\n                 (he gestures at the\n                 flowering trees)\n\n\nScott walks up to him, and pushes him back into the vestibule.\n\nANGLE TIGHT on Scott as he flicks open his switchblade, and\nholds his knife up to the Businessman's throat and whispers.\n\n                      SCOTT\n            ...you left something back inside.\n\nBeat. The Businessman looks frantically around, beyond him\nwe see Anton taking his Chauffeur out of the car. The\nBusinessman turns to the intercom and pushes a button. We\nhear a female voice answer, after a beat, \"...yes...?\"\n\nANGLE on Anton, holding a machine pistol, behind a corner of\nthe wall.\n\n                      BUSINESSMAN\n            ...I left my case inside.\n\nThere is a beat. And the far door in the vestibule is buzzed\nopen. As it opens several men in Swat gear stream through\nthe vestibule and up the stairs. Scott hands the Businessman\nover to an Agent, who takes charge of him, and camera holds\non Scott, standing, wearily, at the bottom of the stairs.\n\nHe motions for Anton near him to hand him a cigarette. Anton\ndoes so. Scott lights up. From the top of the stairs we hear\nscreams, sounds of breaking, yells, commands being shouted.\n\nBeat. An Agent comes to the top of the stairs, looks down,\nand shakes his head. Beat. Scott turns and finds the\nhandcuffed Businessman in his field of vision.\n\n                      SCOTT\n            ...they got some young girls up\n            there...?\n\nBeat. The Businessman, terrified, is silent. Scott holds out\nthe photo of the girl in the black hair.\n\n                                                             39.\n\n\n                         SCOTT\n               You see this girl...?\n                    (pause)\n\n\nThe Businessman looks at the photo. Scott gestures at Anton,\nand passes the photo of Laura Newton to Anton. And then\nlooks as if to say \"In or Out?\" Anton hesitates a moment,\nand then strikes the Businessman.\n\n                         ANTON\n               Did you See This Girl...?\n\nANGLE on the Businessman, on the ground. Terrified. He looks\nback at Scott, as if unable to focus. Scott gives him a beat,\nnods, as if to say, \"What would you expect\", and starts up\nthe stairs.\n\nINT. WHOREHOUSE. NIGHT.\n\nScott enters the vaguely Japanese modern establishment.\nSeveral Swat figures are being stood down. They sit, sharing\na thermos of coffee. One of the Swat team nods to Scott, and\nmotions him to the direction he knows Scott wants to go.\n\nCamera takes Scott past a room where two female Agents are\nholding five young women, who are supervised, changing out\nof \"escort\" wear, and into jeans and sweatshirts,\n\"streetclothes\".\n\nANGLE on Scott, as he enters what is obviously the \"office\"\nof the Bordello. One of the techs is sitting at a bashed-in\ncomputer, he is hooking it up to another laptop. He turns to\nScott.\n\n                         TECH\n               ...she was trying to scrub the\n               thing...\n\nBeyond them we see Miller. And a very attractive European-\nlooking woman in her forties. In a room beyond two bodyguard\ntypes are handcuffed, watched over by a Swat officer.\n\nScott moves back to watch Miller interrogating the woman,\nthe Madam, who speaks with a middle-European accent.\n\n                         MADAM\n               ...an escort service. There is\n               no impropriety, and there is no...\n\n                                                            40.\n\n\n                      MILLER\n                 (calling back to one\n                 of his techs, who\n                 consults a computer)\n            ...who is she?\n\n                      TECH\n            ...Nadya Tellich, Serb. Green\n            Card, in...\n\nMiller waves the rest of the information away. Miller shows\nher the photo.\n\n                      MILLER\n            Have you seen this girl...?\n\n                      NADYA\n            We see a lot of girls. They apply.\n            For the job, as Hostesses...\n\nANGLE on Scott, who stands by the Tech, who is trying to\nreconstruct the broken computer. It prints out a file, on\nwhich we see photos of various faces. Each girl holds a\nplacard with a number on it.\n\nANGLE on Anton, who looks down.\n\nANGLE HIS POV. The wastebasket. In the BG we hear Nadya\ngoing on about the benefits of working as a Hostess. He\nmotions to Scott.\n\nScott squats to the ground, and pours out what are revealed\nto be several polaroids of beautiful young women. He uses\nhis knife to rearrange them without touching them. They are\nnow alighted and we see the numerals twelve, thirteen,\nfifteen, on placards which they hold up.\n\nANGLE on Scott, as he walks back into the interrogation room,\nholding the sheet printed out by the computer.\n\n                      NADYA\n            ...a contact for Personal\n            Services...They pay us so much\n            for each call, and...The girls\n            pay us! We are just a -\n\n                      MILLER\n            They show you proof of their age...\n\n                      NADYA\n            Of course, of course, I...you\n            think I...What do you think, I...\n\n                                                           41.\n\n\n                      SCOTT\n                 (showing her the printout)\n            Where's Number Fourteen?\n                 (pause)\n\n\n                      NADYA\n            ...I don't understand you.\n\n                      SCOTT\n            ...where's Number Fourteen?\n                 (pause)\n\n\n                      NADYA\n                 (pause)\n            I want my Lawyer...\n\nMiller takes the photos of Laura and shows the platinum-\nhaired one to Nadya.\n\n                      MILLER\n            ...is this the Girl? Is this her?\n            Was she in here?\n\n                      NADYA\n            I, wait, I no...I...I want to\n            talk to my lll...\n\n                       MILLER\n                 (of the platinum-haired\n                 girl)\n            Izzat her? It's her, isn't it.\n            She was here. Is that her...?\n\nANGLE, on Scott, as he steps away. He takes us through the\nWhorehouse. In the adjacent room we see a bank of video\nmonitors, showing people in various sexual activities. On\nthe screen for a moment comes the face of what looks like a\nvery young girl indeed, camera swerves onto the face of the\nBusinessman we saw outside the Whorehouse, he is disrobing,...\n\n                      BUSINESSMAN (ON TAPE)\n            ...come over here, you little\n            bitch...That's right, get your\n            sweet ass over here...\n\nANGLE on Scott. As he looks to the Businessman, himself, who\nis seated in a chair, presided over by several agents,\nforced to watch the video. He turns his head away.\n\n                      SCOTT\n                 (to an Agent)\n            Make him watch it.\n\n                                                             42.\n\n\nOne of the agents turns the Businessman's head brusquely back.\n\n                      BUSINESSMAN\n            I...I...listen...listen: I'm a\n            wealthy man. I am, I am not-\n            without-friends in, in the\n            Administration...\n                 (he takes out a\n                 business card and hands\n                 it to Scott)\n            ...whatever it takes to...\n\n                      SCOTT\n            This here, sir. This is a piece\n            of cardboard.\n\nScott holds the card. He shakes his head sadly. Scott nods\nto the Interrogator and Scott throws the card into the\nBusinessman's lap.\n\n                       INTERROGATOR\n                 (as the Businessman\n                 starts to look away)\n            Don't you look away, you son of\n            a bitch...\n                 (he forces him to watch\n                 the video)\n\n\nANGLE CU, on Scott, as he looks disgusted. Anton stands on\none side, looking to Scott for a cue as to how to react.\n\n                      BUSINESSMAN\n            I...I...I...\n\n                      SCOTT\n                 (stepping in)\n            \"I-I-I\" - What are you, Carmen\n            Miranda...?\n\nHe holds the photo of the platinum-haired Laura Newton.\n\n                      BUSINESSMAN\n            I...\n                 (he draws Scott close,\n                 turning from Anton to\n                 the \"good\" cop)\n            Listen to me: I cannot. Be caught\n            here. You write an amount on a\n            sheet of paper...write it on my\n            card...\n                      (MORE)\n\n                                                          43.\n\n\n                      BUSINESSMAN (CONT'D)\n                 (he takes out his\n                 business card and hands\n                 it to Scott)\n\n\n                      SCOTT\n            No, Baby. Today we got the Barter\n            System. And you best pray to God\n            you got something to trade...\n\n                      BUSINESSMAN\n            I...I...\n                 (he takes out his wallet)\n\n\n                      SCOTT\n            IT AIN'T MONEY. YOU SICK FATCAT\n            FOOL. WHERE IS THE GIRL...?\n                 (he slaps the\n                 Businessman, and Anton\n                 pulls him off)\n            LEAVE ME ALONE, I'LL GET THE\n            TRUTH OUT OF HIM...\n                 (he picks up the man's\n                 business card)\n            Come in here, try to buy me off?\n            I've got Three Daughters...\n\nAnton succeeds in pulling Scott off the Businessman. He\ndrags him around a corner. We see the terrified Businessman\nin the background, as Anton tries to reason with Scott.\n\n                      ANTON\n            ...maybe we'd...\n\nANGLE, on Scott, now appearing transformed, and easy. He\ngestures \"shusshh\" to Anton, meaning \"It is all an act\". In\nthe BG we see the Interrogator browbeating the Businessman.\n\n                      SCOTT\n                 (as he looks down at\n                 the Businessman's card,\n                 and shakes his head.\n                 He moves back toward\n                 the Businessman,\n                 terrifying him)\n            ...I thought when you wanted to\n            pet little girls, you picked on\n            your Daughter...Ain't that what\n            you rich people do...now you\n            step off the Reservation and you\n            want to buy me?\n                      (MORE)\n\n                                                          44.\n\n\n                      SCOTT (CONT'D)\n                 (he shows a photo of\n                 the platinum-haired\n                 Laura to the Businessman)\n            Where Is This Girl...\n\nThe Businessman is terrified. He looks around the room in panic.\n\nANGLE on Scott, as camera takes him to where the Female\nAgent is interrogating the Young Whore. Anton follows.\n\n                      YOUNG WHORE\n                 (looking at the photo\n                 of Laura Newton)\n            I...She was sick...she was Not\n            Very Well. She came in\n            here...and...and...\n\n                      FEMALE AGENT\n            ...who was she...?\n\n                      YOUNG WHORE\n            I dunno...some young girl. I\n            dunno...They took her, I told\n            Nadya, she shunnt be here, they\n            took her...\n\n                      FEMALE AGENT\n            Who took her?\n\n                      YOUNG WHORE\n            I think that was her.\n\n                      FEMALE AGENT\n            Was she here?\n\n                      YOUNG WHORE\n            I think that's the girl...they\n            took her. The two, two\n            men...they...\n                 (she draws the Female\n                 Agent closer, frightened)\n            ...they gave her a shot...\n\nANGLE on Scott, as he turns back to Nadya.\n\n                      NADYA\n            I am entitled to my rights, and\n            I am entitled to a phonecall to\n            my lll...\n\n                                                             45.\n\n\n                      SCOTT\n                 (brusquely)\n            Your lawyer ain't going to help\n            you...want to guess 'why'?\n                 (he looks to Miller,\n                 who nods, \"Go ahead\".\n                 he takes the photo of\n                 Laura with the red\n                 hair, sharply, from\n                 Miller and shows it to Nadya)\n            Y'understand the picture...\n\n                      NADYA\n            ...ohmigod...\n\nANGLE on Miller, as he beckons Scott. Anton starts to come\nand Miller signals him to stay behind.\n\n                      SCOTT\n            He's with me...\n\nMiller nods and the three walk out of the room.\n\nANGLE on Scott, as he and Miller retreat behind a door. Beat.\n\n                      MILLER\n                 (as it dawns on him)\n            They don't know who they've\n            got...they just snatched \"some\n            Young Girl\". When they find out,\n            they're going to have to...\n\nScott moves back to Nadya.\n\n                      SCOTT\n            She was here. She was here, where\n            is she...? WHERE IS SHE?\n                 (Scott thrusts the\n                 Laura Newton photo at her)\n            She was here -\n\n                      NADYA\n            ...I...I don't know if this is\n            the...\n\n                      SCOTT\n            She was here.\n                 (pause)\n\n                                                           46.\n\n\n                       NADYA\n                  (very softly, as she\n                  looks around, broken,\n                  for sympathy)\n             ...they'll kill me.\n\n                       SCOTT\n             Who did you call. How did they\n             know, to come get her?\n\n                       NADYA\n             I...it's just a number, I...\n\nMiller pushes a pad of paper and a pencil across to her.\n\nANGLE TIGHT on Scott. As he looks on. Beat. He nods, as if\nto say \"We're getting there\". There is the sound of a phone\nringing, and an Agent comes in, and beckons Miller, who\nwaves him away. The Agent indicates, \"No, you have to take\nthis call.\" Miller steps back from Nadya, not wanting to\nbreak the mood, and moves toward the phone. Scott moves to\nstand by the girl.\n\nANGLE on Scott as he pushes the paper toward her, again,\nforcing and willing her to put down the number.\n\n                       MILLER\n                  (softly. To phone)\n             ...hello...\n\nINT. FOOTBALL STADIUM. NIGHT.\n\nA helicopter is settling onto the playing field.\n\nANGLE. Two men getting out of a Suburban, across the field,\nrun toward the helicopter.\n\nANGLE, a powerful-looking older man in a suit, BURCH, steps\ndown from the helicopter, and an Aide greets him and leads\nhim away from the helicopter. We see the Aide indicate the\ntwo men running toward them. Burch turns.\n\nANGLE HIS POV. Miller and Scott, who join with Burch, as\nthey all move toward the stadium building.\n\nINT. STADIUM BUILDING, LUNCHROOM. NIGHT.\n\nANGLE, on an assembly of the information of the chase. On a\ntable, the photos of the Eurasian businesswoman, of Laura\nNewton, of the Regency Club. A disassembled machine pistol,\nand a cup of steaming coffee.\n\nHOLD on Scott, looking at something, off. As he picks up the\ncup of coffee. Beyond him we see Anton, asleep in his chair.\n\n                                                            47.\n\n\nANGLE INT. LUNCHROOM. Burch, Scott, and Miller are found in\nthe empty, stainless steel lunchroom, with them a clean-cut\nyoung man, STODDARD, obviously Burch's assistant.\n\n                      BURCH\n            ...where's the girl...?\n\n                      MILLER\n            Sir, we believe she was abducted,\n            from this club...\n                 (as Miller speaks he\n                 passes pertinent sheets\n                 of information to Burch)\n            That she was taken to...that she\n            was taken to a bordello...\n\n                      BURCH\n            ...here in Boston...\n\n                      MILLER\n            Yessir, and, that...that...\n\n                      BURCH\n            Come on, let's hear it:\n\n                      MILLER\n            That she may have been...that\n            she may have been delivered -\n            for sale - that she may have\n            been sent down the pipeline and\n            overseas.\n                 (pause)\n\n\n                      BURCH\n                 (pause)\n            \"...just some girl...\"\n                 (pause)\n\n\nANGLE. HOLD on Scott. Sitting quietly, as he watches the two\nother men.\n\nStoddard takes out a cigar case. Looks to Burch, who nods\nhis consent, and Stoddard takes out a black cigar, and\nlights it.\n\n                      BURCH\n            How certain are you she was the\n            girl in the whorehouse?\n\n                                                             48.\n\n\n                      MILLER\n                 (shakes his head,\n                 meaning \"not positive\")\n            ...we...\n\n                      BURCH\n            Was the girl in the whorehouse?\n                 (pause)\n            What about your other\n            leads?...the Boyfriend,\n            the...Professor...?\n\n                      MILLER\n            ...sir.\n\n                      STODDARD\n            The Professor, where's his boat?\n\n                      MILLER\n            The Coast Guard is on the...\n\n                      STODDARD\n            WHERE IS THE FUCKEN BOAT? IS SHE\n            ON THE BOAT...\n\nANGLE on Scott and Anton. As Anton comes awake to the sound\nof the shouting. Scott gestures him to keep quiet.\n\nANGLE on the two. As Anton wakes up. He picks up a sheet\nbearing the Picasso symbol, and starts to speak. Scott\nshakes his head, meaning \"be quiet\".\n\n                      SCOTT\n            ...we just go where we're sent\n            and do what we're told when we\n            get there...\n\nHe motions to be quiet - and to pay attention to the drama\nin the next room.\n\nANGLE INT. THE STEEL LUNCHROOM. As Burch and Stoddard\ninterrogate Miller.\n\n                      BURCH\n            You've got the fucken Service\n            Agent, shot himself...you're\n            you're telling me, your best bet,\n            some cocksuckers nabbed her,\n            took her, took her, they don't\n            know who she is. And they're\n            gonna sell her down the river...?\n\n                      MILLER\n            Sir...\n\n                                   49.\n\n\n          BURCH\nThe Detail Agent. Was he fucking\nher?\n\n            MILLER\nThe girl?\n\n          BURCH\nThe Secret Service Agent, was he\nfucking Laura Newton...?\n\n          MILLER\nHe was off-post, with his\ngirlfriend.\n     (pause)\n\n\n           STODDARD\n     (as he holds up the\n     \"Picasso\" letter from\n     the Boyfriend, to read\n     it. He reads:)\nThe Professor, the Boyfriend,\n\"...you behave like a slut...\",\nthis is who you like...?\n     (he holds up the\n     advertisement of the\n     Regency Club)\nAah...fuck\n     (he holds up the photo\n     of her hair)\nShe dyed her hair. What do they\ndo, her hair grows out, what do\nthey do when they realize who\nshe is...?\n     (pause)\n\n\n          SCOTT\n     (under his breath, not\n     realizing he's speaking)\nThey kill her.\n\n          BURCH\n     (reacting, as if to\n     say, \"That's the first\n     sensible thing I've heard\")\nYou're fucken A Right they kill\nher. Okay. Good.\n          (MORE)\n\n                                                          50.\n\n\n                      BURCH (CONT'D)\n            Now: Let's talk some commonsense:\n                 (pause)\n            What can you do for me?\n                 (to Miller)\n            ...who is that...?\n                 (Miller whispers to\n                 Burch. To Scott)\n            ...Get in here...\n                 (Scott comes and stands\n                 by Burch)\n\n\nScott, and then Miller, looks at Burch's clean-cut and very\nfit assistant, Stoddard. There is a pause, and then Burch\nmotions Stoddard to leave the room, which he does. Pause.\n\n                      BURCH\n                 (quietly)\n            ...what can you do for me? What\n            can you do for me - I need it\n            now - I need it before the Press\n            gets it on Monday. Cause they\n            will kill her. The jackals start\n            a feeding frenzy, and she's red.\n            Help me.\n\nMiller nods to an Aide, who comes forward, with a white\nscrap of paper. He hands it to Burch.\n\n                      MILLER\n            Sir: This is the number of a\n            public phone in Downtown Boston.\n                 (Burch nods)\n            It's a cutout, between the\n            Bordello, and the abductors. A\n            call is placed when they have a\n            package to deliver.\n\n                      BURCH\n            ...you going to stake out the\n            phone...?\n\n                       MILLER\n                 (nods)\n            We have a watch on the phone.\n            More importantly: N.S.A. reports\n            calls placed to that phone.\n            Regularly.\n\n                      BURCH\n            They can track calls to a payphone?\n\n                                                             51.\n\n\n                      MILLER\n            In this case they can.\n\n                      BURCH\n            How?\n\n                      MILLER\n            They were made from a Federal\n            Prison.\n                 (he gestures to the\n                 Aide, who shows to\n                 Burch and the camera a\n                 photo of a smiling man\n                 in his forties, in an\n                 expensive suit. Of photo:)\n            This is Eli Assani. He is a\n            Lebanese National, serving life\n            without, for kidnapping. He was\n            the head man in a white slavery\n            scheme.\n\n                      BURCH\n            And where is he?\n\n                      MILLER\n            He's in Lewisberg. We have a\n            Plan...\n                 (pause)\n            I hesitate to...\n\n                      BURCH\n            Give it to me...\n\nANGLE, on an Aide who comes in and passes a piece of paper\nto Miller, who reads it and looks up.\n\n                      MILLER\n            They've got some action on the\n            Payphone...\n\nScott and Anton start to get to their feet.\n\nEXT. COPLEY SQUARE, DOWNTOWN. NIGHT.\n\nIn the foreground we see a lonely payphone in the deserted\nsquare. It is festooned with ads for escort services. In the\ndeep background we see the lights on in a corner bank\nbuilding, and the cleaners at work.\n\nANGLE INT. THE BANK. One of the cleaners polishes the\ncounter in the bank. He wipes his brow and looks outside.\n\nANGLE HIS POV. A sedan at the curb. Beyond it, a man,\nsmoking a cigarette, stands near the payphone.\n\n                                                             52.\n\n\nThe man looks at his watch, looks around, throws away the\ncigarette, and continues to pace.\n\nANGLE, in the bank the \"Cleaner\" whispers into a lapel mike.\n\nEXT. BOSTON STREET. DAY.\n\nScott, in the backseat of a car, apparently asleep. Anton,\nsitting in the front. Listening to the faint sounds from an\nearwig.\n\nANGLE, XCU. Scott, his head tilted back, looking through\nalmost fully closed eyelids.\n\n                      SCOTT\n            ...who's walking up on us...?\n\nANGLE, Anton, as he looks around, down at Scott, and then up,\nat a man in a suit, some thirty yards away, walking towards\nthe car.\n\nAnton, as the man draws closer, looks down at Scott, as if\nto say \"How did you know\"?\n\n                      SCOTT\n                 (as he loosens his\n                 jacket, over his pistol)\n            ...who is he?\n\n                      ANTON\n            Boston. P.D.\n\nWe see Scott, relax for a moment. And then, putting Anton\nout of his misery.\n\n                      SCOTT\n            ...always a reflective surface...\n                 (then, to himself, as\n                 if reciting a litany)\n            \"...in the city, always a\n            reflection. In the Woods. Always\n            a sound...\"\n\nHOLD. On Anton, as he digests this. BEAT.\n\n                      ANTON\n            ...and in the Desert?\n\n                      SCOTT\n            You don't want to go into the\n            desert.\n\nANGLE, EXT. The Phonebooth in Copley Square. We hear the\nphone begin to ring.\n\n                                                             53.\n\n\nEXT. BOSTON STREET. DAY.\n\nScott and Anton, in the sedan. Anton listening on the\nearpiece. Anton brightens.\n\n                      ANTON\n            ...they're moving...\n\nAnton starts to put the car in gear, an Agent comes jogging\ndown the street, out of an alley, and motions Anton aside,\nand gets into the car.\n\nEXT. BOSTON HIGHWAY. NIGHT.\n\nA shot of the helicopter, flying over the highway.\n\nANGLE, the sedan speeding down the deserted highway, the\ncity in the background. The helicopter, flying away overhead.\n\nINT. SCOTT'S CAR.\n\nA Driver, Scott, and Anton. Listening to transmissions on\nthe radio. As they drive Anton leans forward, his hands on\nthe seatback of the front seat. Scott picks up one of\nAnton's hands, and turns it over.\n\n                      SCOTT\n                 (of the hand)\n            ...what is this...?\n\n                      ANTON\n                 (as he looks down, and\n                 then realizes the\n                 nature of the question)\n            ...it's a wedding ring.\n\n                      SCOTT\n            ...take it off.\n                 (pause. While Anton\n                 hesitates, not comprehending)\n            ...the ring clicks against your\n            riflestock, some sonobitch hears\n            that noise, hundred yards out,\n            and you're gonna get me killed.\n\nAnton nods, and begins to work the ring off his finger.\n\nANGLE THEIR POV. Far ahead, the speeding sedan turns off the\nhighway, onto a \"feeder\" road.\n\nAnton and Scott in the backseat. As we see Anton take out a\nmachine pistol from his \"Go\" bag, and check it. Scott looks\nat him. A chatter comes over the radio, and Scott addresses\nthe two men in the front seat.\n\n                                                             54.\n\n\n                      SCOTT\n            ...where's he going...?\n\nThe Driver hands a printout to the shotgun man, who reads.\n\n                      AGENT\n            One Five Four Nine, Alpha Sierra,\n            Mass Reg. William Barak.\n            Somerville, Mass...\n\n                      SCOTT\n            That's where he's going?\n\nThe Agent shakes his head, looks down at the paper.\n\n                      AGENT\n            Also, owner of Record, In Essex...\n\n                      SCOTT\n            Izzey going toward Essex?\n                 (Agent nods)\n            ...what sort of place is it...?\n\nThe Agent looks at the piece of paper.\n\n                      AGENT\n            It...it'd be a Beach house...\n\n                      SCOTT\n            Get me there.\n                 (to the Driver)\n            Get on the net. Call 'em off.\n            Everyone off. Just me.\n                 (of Anton)\n            Just me and him.\n\n                        DRIVER\n            ...sir...\n\n                       SCOTT\n            Nobody out there...\n                 (to Anton)\n            Just. Him.\n                 (to the Driver)\n            You indicate that you heard me.\n                 (beat. The Driver nods)\n            Put it out.\n                 (the Driver begins to\n                 speak softly, relaying\n                 his instructions on\n                 the radio. Scott turns\n                 to Anton. Softly)\n            How you doing bright eyes...?\n                 (Anton nods. Beat, as\n                 Scott looks him over)\n\n                                                            55.\n\n\n                      SCOTT\n            ...breathe through your nose.\n\nAnton looks at Scott inquisitively, not sure he has heard right.\n\n                      SCOTT\n            It stills the heartrate.\n                 (pause)\n            You got my back.\n\n                      ANTON\n            Sir, Yes, Sir.\n\n                      SCOTT\n                 (to himself)\n            ...alright, then...\n\nANGLE the Sedan, on the deserted highway. HOLD. We see\nanother car come screaming up behind it, doing one-ten, a\nred light on the roof, flashing.\n\nANGLE INT. THE SEDAN. A middle-aged man watches the other\ncar come up, and disappear around a bend, going furiously fast.\n\nEXT. ESSEX BEACH. NIGHT.\n\nThe margin of the scrubwoods, in the dunes. Scott and Anton,\nmoving quietly through the woods. Scott points to Anton,\nindicating where he should stop.\n\nANGLE, Scott's POV. A run-down beach house on a deserted\ncove. The blue light of a television flickering through the\nwindow.\n\nANGLE, Scott peering through some scrubgrass. We see he\nholds a small handful of torn-off grass before and over his\nface, to break up his outline. He turns. To Anton, who\nstands next to him, holding a sniper rifle. He points out a\nposition to Anton.\n\n                      ANTON\n            ...you want me to Come Through\n            the Door...?\n\n                      SCOTT\n                 (as he checks his\n                 weapons. He shakes his head.)\n            Don't you go through the door\n            without an Overwatch.\n\nHe takes the small handful of grass and throws it into the\nair, watching the way the wind takes it. Scott gestures to\nAnton to take up a position beside a small run-down boat shed.\n\n                                                             56.\n\n\nWe see Anton do so, then Scott moves across the dunes, to a\nsmall skiff. Which lies just across a little cove from the\nbeach house.\n\nANGLE, on Scott, as he moves down the dune, to the skiff. He\nopens his switchblade quietly, and severs the line holding\nthe skiff to the dock. He gets into the skiff, and pushes it\noff, and we see it begin to drift across the little cove\ntoward the beach house.\n\nANGLE, on Anton, kneeling, beside the old boat shed, as he\nassumes a prone position, and sights his rifle in on the\nbeach house.\n\nANGLE, HIS POV. Through the sniperscope, the house, the\ntelevision, flickering in an empty living room.\n\nINT. THE WOODS.\n\nAnton, acknowledging the command. He finds a vantage point,\nand assumes the prone position, covering the house with his\nrifle.\n\nANGLE on Scott, surveying the beach house.\n\nANGLE HIS POV. The dark beach house.\n\nANGLE on Scott, as he moves across the lawn, and to a back\ndoor. He removes his switchblade, opens it, and uses it to\njimmy the screen latch. He replaces it, and takes out a set\nof lock picks, and begins to work on the door. We faintly\nhear the sound of a television.\n\nANGLE INT. THE BEACH HOUSE. We hear the sound of the TV and\nfaintly, see a blue glow from a room or two down the hall.\n\nANGLE on Scott, entering the kitchen, where he looks down at\nthe various dirty plates and cups on the table.\n\nANGLE on Scott, coming through the door. As he moves, flat\nto the wall. Camera follows him past the doorway, beyond\nwhich we see the TV on low. Scott looks in, and finds it empty.\n\nANGLE on Scott, as we follow him into the bedroom. It is empty.\n\nHOLD on Scott, looking around.\n\nANGLE, as he comes back into the living room. He stops. We\nsee something beyond him.\n\nANGLE HIS POV. A small boat some twenty yards from the house.\nOut near the water.\n\n                                                          57.\n\n\nANGLE, on Scott, as he starts to open the rear, sliding\nglass door which will lead him out to the boat.\n\nBehind him, we see the MAN FROM THE SEDAN open the front\ndoor of the house, and begin to enter. Scott hears him, and\nturns.\n\n                      MAN FROM THE SEDAN\n                 (as he sees Scott)\n            ...what the fuck...?\n\n                       SCOTT\n            ...I heard the TV, so I came\n            in...\n                  (pause)\n\n\nThe Sedan Man is put a bit off, as the comment makes no\nsense. Scott uses the moment to advance toward the man.\n\n                      SCOTT\n            ...what the hell you got the TV\n            on for, there's nobody here...?\n                 (the man puts up his hands)\n            I don't wanna hurt you. Why would\n            I hurt you? I just wanna know\n            why the TV's on.\n\nANGLE EXT. THE BUILDING. Where we see the man, and Scott. We\nsee the scene in green, through a sniperscope.\n\nANGLE, on Anton, looking through the scope.\n\nANGLE CU Anton, as he sees something in the scope.\n\nANGLE, in the house. Scott advancing toward the man.\n\n                      SCOTT\n            ...I just wannit to know, I just\n            came to ask you that question...\n\nThe man backs up, past a half-open glass French door.\n\nANGLE, on Scott, as he advances toward the man.\n\nANGLE, ANTON'S POV. Through the sniperscope. The faint\ntraces of what might be the Picasso symbol.\n\nANGLE, on Anton, as we see him move the sniperscope and\nadjust its magnification toward the symbol. In a corner of\nthe scope, we see another man, in a dirty white shirt,\nemerge, coming up the stairs from what might be the basement\nof the beach house. We see this man take in the scene in the\nnext room, and secrete himself behind a wall.\n\n                                                             58.\n\n\nANGLE, on Anton, whose vision is blocked - Camera takes him\nto a position next to the white tool shed.\n\nScott, moving toward the Sedan Man, unaware of the man\naround the corner.\n\nANGLE through the sniperscope. We see the man in the white\nshirt ready himself behind the opening through which Scott\nwill come. We see him raise a pistol.\n\nANGLE Anton, as he realizes he is behind the curve. As the\nman in the white shirt steps into the doorway Anton fires at\nhim through the sniperscope. We see this man fall.\n\nANGLE, INT. THE HOUSE. The man in the Sedan, his hands\nraised, fetches down a small shotgun from the lintel over\nthe door, and levels it toward Scott. Who draws and fires\nseveral rounds at him.\n\nANGLE INT. THE HOUSE. As the man goes down heavily. Scott\ncomes forward to the dying man, and kicks the shotgun away.\n\nCamera takes Scott warily into the next room, where he sees\nthe man in the white shirt sprawled on the floor. Scott\nmoves past him, and down to a door leading to the basement.\nScott takes a long look down the basement stairs. We see a\nfaint light, and a shadow moving across the light.\n\nANGLE on Scott, as he takes a deep breath, and bursts down\nthe stairs, screaming.\n\nANGLE INT. The Basement. A rough, dirt-floored room. Scott\nstanding alone. We see a bare bulb hanging from the ceiling,\nswinging slightly in the breeze from an open window.\n\n                      SCOTT\n            I'm Coming Up...\n\nANGLE, Anton, inside the house, in a covering position,\nwatching out. Scott comes up the stairs.\n\n                      SCOTT\n                 (to Anton)\n            Call em in...\n\nWe see Anton take out a walkie and talk into it, Scott\nproceeds to the Sedan Man. He kneels by him.\n\n                      SCOTT\n            ...where's the girl...? You're\n            dying, pal. Even it up. WHERE IS\n            THE GIRL... WHERE IS THE GIRL...\n\n                                                             59.\n\n\nScott pulls the dying, bloody man to him, and starts to\nshake him.\n\n                      SCOTT\n            You're dying. You're dying, man.\n            Where is the girl...\n\nBeat. The man begins to shudder, violently, and then stops,\nobviously dead. Beat. Scott throws the dead man down onto\nthe floor. Beat.\n\nANGLE, on Anton, who turns to look back. He stares at the\ndead man.\n\n                      SCOTT\n            ...well, you wanted to know...\n                 (pause. Scott kicks\n                 the dead man viciously)\n\n\nAnton looks at Scott. Beat.\n\n                      SCOTT\n                 (to himself)\n            Yeah, everybody wants to know\n            the Secret Knowledge...\n\nScott sits on a chair, by an old rolltop desk. On the desk\nwe see a bunch of junk, old cigarette packets, empty. A box\nhalf-full of yellowing stationary. Scott prods the stationary\nwith his knife. We read, in an insert: \"Hanson Marine.\nEverything for the boat. Box 38 Essex, Mass.\" (and see, on\nthe envelope, an old fashioned, stylized drawing of an old\nchriscraft-like power boat).\n\nWe hear the sound of a helicopter. And Scott turns, looking\nout of the window. He then turns back, to see Anton, who is\nstanding, looking down at the man he shot. Anton, feeling\nScott's gaze, turns to look at him.\n\n                         ANTON\n            ...I...\n\n                      SCOTT\n            ...tell it to the Chaplain.\n\nScott gets up wearily, and walks toward the door out onto\nthe beach. We see a helicopter landing, and several men in\nBDU's, jumping out, and proceeding toward the house.\n\nINT. STADIUM DRESSING ROOM. DAY.\n\nBurch and his Aide. As Scott and Anton enter. Followed by\nMiller.\n\n                                                             60.\n\n\nBurch motions Miller over, and they confer, looking at Scott\nand Anton.\n\nANGLE, on Scott and Anton, as they stand by a television, an\nAgent is watching, shaking his head.\n\n                      BRUNETTE TALKING HEAD\n            ...apparently, had her hair\n            restyled, and cut today, our\n            Newsteam interviewed her stylist,\n            and has reconstructed...\n\n                      SCOTT\n            Ah, shit...\n\nANGLE. He is summoned, into the next room. By Burch et al.\n\nBurch and his Aide. As Scott comes in with Anton, followed\nby Miller. Burch takes Scott aside.\n\n                      BURCH\n                 (looking at a TV in\n                 the BG silently,\n                 showing photos of Laura\n                 as a brunette)\n            ...here's the deal:\n                 (pause. He holds up a\n                 photo of Eli Assani,\n                 the Businessman, both\n                 in a suit, and in his\n                 prison garb, with a\n                 number in front of him.\n                 His name, and\n                 \"Lewisberg Federal Penitentiary\")\n            ...this is the man.\n                 (pause, to Scott)\n            ...you're covered in blood.\n\n                      SCOTT\n            Sir, it ain't mine.\n                 (Burch looks at Anton.\n                 Scott, seeing his glance)\n            On my team, sir.\n\n                      BURCH\n            How deep is he?\n\n                      SCOTT\n                 (saying, in effect,\n                 this sums it up)\n            ...He's on the team.\n\n                                                          61.\n\n\n                      BURCH\n            Yeah, well. He may have to be a\n            little more than On the Team...\n                 (pause. After considering)\n            I've been speaking to the father.\n                 (pause)\n\n\nBurch walks a few steps away. Thinking. Scott looks at Anton,\nquestioning.\n\n                      BURCH\n                 (pause)\n            What about if we had to go \"off\n            the meter\"?\n\n                      SCOTT\n            ...With the Mission, sir.\n\nBurch thinks for a moment. And then draws Scott aside. Burch\nglances over at the television, spewing information about\nLaura Newton, and shakes his head with disgust.\n\n                      BURCH\n                 (to himself)\n            ...I'm out of time...\n\nHe turns back to Scott. And gestures him into a small room,\nand closes the door.\n\n                      BURCH\n            ...man to man.\n\n                      SCOTT\n            The door's closed, Sir.\n\n                       BURCH\n            I. Need. To Ask You. To do\n            something.\n                 (he is hard-pressed to continue)\n\n\n                      SCOTT\n            I am here to get the girl back.\n\nBurch thinks a moment, he rubs his face, and shakes his head,\nand looks up as if to say \"This is all we have, this is the\nbest we have\". Pause. He nods, as they do not move.\n\nBurch takes out a photo of a bearded middle-eastern looking\nman in a business suit, and another, in a mugshot marked\n\"Lewisberg Federal Penitentiary\".\n\n                                                          62.\n\n\n                      BURCH\n            This man...Placed a phonecall.\n            Yesterday. From the phonebank at\n            Lewisberg. To the Copley Payphone.\n                 (pause)\n            Here's the cut-off-point...\n                 (he looks meaningfully\n                 at Scott. Pause)\n            ...here it is: This man, Eli\n            Assani, is to be transported,\n            tomorrow, Wednesday, with another\n            convict. A Man on Death Row. For\n            their medical procedures...Now:\n\nEXT. COUNTRY ROAD. DAY.\n\nA Police Cruiser coming quickly down a two-lane, deserted road.\n\nANGLE INT. THE CRUISER. A road sign reads \"Just Two Miles To\n'The Owl', Rest Stop, Restaurant, Gas-Diesel\".\n\nANGLE EXT. THE OWL. Rest Stop. A run-down rural gas station,\nrestaurant. Off to the side we see the cruiser coming down\nthe road. As a roughly-dressed man runs out of the restaurant,\ncarrying a full paper bag in his hand. The Cruiser, unseen\nby the man, pulls up to the gas pump, and the Trooper starts\nto get out of the driver's seat. When gunfire erupts from\nthe restaurant. People are shooting at the fleeing man. A\nman opens the door of the restaurant and fires at the\nroughly-dressed man in a very urban leather jacket, who\nreturns fire. Glass breaks in the windows of the restaurant.\n\nThe roughly-dressed man runs to his car, an 80's Pontiac,\nparked near the pumps. The man in the doorway fires again,\nand the windshield of the Pontiac blows out and a tire\nbursts. The roughly-dressed man returns fire, and the man in\nthe doorway falls. The roughly-dressed man turns to see that\nthe Trooper is out of his Cruiser, and is about to fire at\nhim. The roughly-dressed man drops his satchel, and fires at\nthe Trooper, who falls.\n\nThe paper bag has fallen to the ground and burst, and\ncurrency is spilling out of it, and being taken on the wind.\nThe roughly-dressed man frantically begins to try to scoop\nit up and into his jacket.\n\nANGLE CU on this man, who we now see is SCOTT. He stands\naround, and moves to the fallen Trooper. He strips the keys\nfrom the Trooper's keyring, and looks up. Feeling someone\ngazing at him.\n\nANGLE HIS POV. In the car, two convicts, a Heavyset Man and\nELI ASSANI, the middle-eastern man we saw in the mugshot. He\nis holding his neck, which is bleeding copiously.\n\n                                                            63.\n\n\nWe see the back window behind him, shattered by gunfire.\n\nANGLE on Scott, who gets into the car, takes the keys he\ntook from the Trooper, and begins screaming off down the\nhighway.\n\nLOW ANGLE, showing the car taking a turn vastly too fast,\nthe car careens up on two wheels, rights itself, fishtails,\ncorrects, and disappears in the distance.\n\nANGLE INT. THE CAR. Scott driving steals a look back at\nAssani, in the back seat, whimpering.\n\n                       SCOTT\n            Shut up.\n\nThe Police Radio chatters: \"Two Twelve Sierra, come\nback...Two Twelve Sierra, come back, we have your request\nfor Code Seven...please come back with your Twenty.\"\n\n                      HEAVYSET CONVICT\n            Yeah, two twelve sierra took all\n            the 20 he's gonna take...Oh, man,\n            you left him there...\n\nANGLE on Scott driving. He looks behind him.\n\nANGLE, POV. In the rearview mirror. A dust cloud settling\nover the deserted highway.\n\nANGLE INT. THE OWL. Various techies, in the kitchen,\nmonitoring the broadcast of the microphone in the Police Car,\nAnton among them. The Trooper comes in, taking off his\nbullet-proof vest, and sits to listen, where we find Miller\nand his Agents. The 'Restaurant Owner', who we now see is\nAnton, takes off his jacket and his bullet-proof vest and\npicks a slug, fired by Scott, out of the center of the vest.\n\n                      HEAVYSET CONVICT (V.O.)\n            ...yeah. You marked him Paid in\n            Full...\n\n                      ASSANI (V.O.)\n            ...you got to pull over, you got\n            to stop...I'm bleeding.\n\nANGLE INT. THE POLICE CAR.\n\n                      HEAVYSET CONVICT\n            Yeah, he done ate from the tree\n            of knowledge, our Sierra Two Twelve.\n\n                      ASSANI\n            ...help me...\n\n                                                             64.\n\n\n                       SCOTT\n            Shut up.\n\nANGLE, EXT. COUNTRY ROAD. The car comes to a panic stop,\nfifty yards beyond a turnoff onto a dirt road. The car is\nput in gear, backs up, and takes the road.\n\nEXT. FARM ROAD. DAY.\n\nThe car comes quickly up a small farm road, we see a run-\ndown barn, and a farmhouse, washing on the line. Scott pulls\nthe car into the barn, next to an old pick-up truck. He gets\nout of the car, we hear Assani in the backseat calling to him.\n\nANGLE, Scott, as he turns to Assani, who is pressing a\nblood-soaked shirt to his neck. Calling \"Help me\".\n\nScott opens the back door of the Cruiser, and the Heavyset\nMan gets out, and offers his manacled hands for release.\nScott motions to Assani.\n\n                      SCOTT\n            ...drag him out...\n                 (the man does so. Scott\n                 motions for them to be quiet)\n            ...got some business to do...\n\nHe takes his pistol and walks toward the farmhouse.\n\nHOLD on Assani, and the other Convict, Assani is holding a\nrag to his bleeding neck.\n\n                      ASSANI\n            ...help me...\n\n                      HEAVYSET CONVICT\n            ...yeah, I heard yah...\n\nANGLE, on Scott, as he walks past a clothesline heavy with\ndrying clothes, he is seen to go into the house. We hear a\nwoman's scream, and then two shots are fired.\n\nANGLE INT. THE HOUSE. As Scott is found at a table in the\nkitchen next to which are various foodstuffs laid out.\nInside the house we see a female techie, at a table by the\nwall, various communications gear in front of her. Scott\nbegins loading up his pockets with food. The techie hands\nScott a slate on which is written, in large block letters,\n\"The helo is standing by, will assault in support when you\nhave found the girl. On your command.\" Scott gestures for\nthe slate, and writes on it, and hands it back. Scott nods,\nand walks out of the house.\n\n                                                             65.\n\n\nANGLE INSERT. The slate, on which we see Scott has written\n\"Keep Your Distance!\"\n\nANGLE, on Scott, as he walks back through the yard, pulling\nclothes off the line.\n\nANGLE INT. THE BARN. The two convicts, as Scott enters, and\nbegins changing out of his clothes, and into the clothes he\nfound on the line.\n\n                      HEAVYSET CONVICT\n            Yeah, Baby. Pass some my way...\n\n                      SCOTT\n            Sorry, my man...traveling light...\n\nHe turns to the Heavyset Man, and fires his revolver at him\ntwice. The man falls, dead. Scott turns his revolver at\nAssani, who begins to scream.\n\n                      ASSANI\n            Don't shoot me, don't shoot me,\n            I have what you want. I HAVE\n            WHAT YOU WANT. I CAN GET US OUT\n            OF THE COUNTRY TONIGHT. TONIGHT.\n            NO PASSPORT. FLY OUT.\n            TONIGHT...OH GOD, DON'T SHOOT ME!\n            I SWEAR ON MY MOTHER. LOOK AT ME:\n            AM I LYING TO YOU? A SEA PLANE.\n            TONIGHT. HELP ME. I SWEAR TO YOU.\n\n                      SCOTT\n            Why in the world would I believe\n            a lying convict like you...\n\n                      ASSANI\n            Oh, ah, ah, but you do believe\n            me...I see it...you do. I can\n            get us out. Help me. I SWEAR TO\n            YOU. HELP ME...and I will treat\n            you like a brother...I...\n\nScott advances on him.\n\n                      SCOTT\n            My brother used to beat me\n                 (he raises the cop's\n                 service revolver and\n                 cocks the hammer)\n            Nice guess, though.\n\n                         ASSANI\n            OH GOD NO!\n\n                                                          66.\n\n\nScott pulls the trigger, which falls on an empty chamber.\nAssani whimpers, as Scott goes into the Cruiser, comes out\nwith a box of shells, clears the empties from the cop's gun,\nand begins loading it.\n\n                      ASSANI\n            No, no. Listen to\n            me...listen...make one call. One\n            call - go in the house. Make One\n            Call. ONE CALL. An Aviation\n            Company. Tell...tell them...tell\n            them the word I say, and they\n            will say: THE PLANE WILL MEET\n            YOU AT...\n                 (Scott hesitates for a\n                 moment, and Assani\n                 attempts to capitalize\n                 on it)\n            Yes. Yes...\n\nINT. PICK-UP TRUCK. DAY.\n\nScott is driving. The dash is littered with empty coffeecups,\ncigarette packs. He turns.\n\nANGLE HIS POV. Assani, sitting in the shotgun seat, a map in\nhis lap, looking at him.\n\n                      SCOTT\n            You a fag my friend?\n\n                      ASSANI\n            No.\n                 (pause)\n            I am not.\n\n                      SCOTT\n            Then why the hell you looking at me?\n\n                      ASSANI\n            I was thinking...how fucking\n            surprised you're going to be.\n                 (pause)\n            Because, Baby, you just did that\n            fucken good turn, going to Make\n            You Rich, Fat, and Happy...\n\n                      SCOTT\n            ...just get me on that plane.\n\n                      ASSANI\n            Didn't they tell you...?\n\n                                                      67.\n\n\n                      SCOTT\n            All I heard's a voice on the\n            phone...\n\nAssani grins, as if to say, \"Just Wait\".\n\n                      ASSANI\n            ...you like girls...?\n\n                      SCOTT\n            Better question, where you've\n            been so long, do you like girls?\n\nScott grins, and Assani shares the moment with him.\n\n                      ASSANI\n            We have. You will have...the\n            most beautiful...\n\n                      SCOTT\n            ...most beautiful women, eh?\n\n                      ASSANI\n            Not women, Baby. Girls. You got\n            to trust me, I'm the Doctor\n            here...All young. All blonde...\n\n                      SCOTT\n            And this all takes place Where...?\n\n                      ASSANI\n            In Dubai. In Yemen...\n\n                      SCOTT\n            Well, that's a long way from\n            Tiperrary, pal...\n\n                      ASSANI\n            ...what do you have here...?\n\n                      SCOTT\n            Yeah, but I'm not cut out, to\n            live in a fucken tent.\n                 (Assani laughs)\n\n\n                      ASSANI\n            If you think you can imagine\n            luxury...I am here to tell you,\n            my friend...\n                 (he smiles broadly)\n\n                                                          68.\n\n\n                      SCOTT\n            Well, may it Just Be So...\n\n                      ASSANI\n            When we get to Maskala...\n\n                      SCOTT\n            And, now, what's Maskala...?\n\n                      ASSANI\n            ...when we get to Dubai, better...\n\n                      SCOTT\n            What's Maskala...?\n\n                      ASSANI\n            ...that's where we clean them up.\n            We ship them Rough, we make them\n            Smooth, and everybody's happy.\n\n                      SCOTT\n            Well, then, you're a\n            philosopher...huh...? How 'bout\n            making me happy tonight...\n\n                      ASSANI\n            If there's a girl, in the\n            pipeline, tonight, you shall\n            have her, what do you say to that?\n\n                      SCOTT\n            ...I say you're a stone cold\n            whoremaster...\n\nAssani joins with him in the joke, nodding his assent.\n\n                      ASSANI\n            No, no baby. Take it to the    bank.\n            The Arabs, Man. All the oil    -\n            all the money in the world.    What\n            can't they have? Booze and    Pussy.\n            How do they get it...?\n\n                      SCOTT\n            You the candy man? Is that it?\n\nAssani begins to swoon. He puts his hand to his neck, and it\ncomes away covered in blood, where it was cut by the glass\nfragment.\n\n                      SCOTT\n            Ah. Hell...\n\n                                                          69.\n\n\n                      ASSANI\n            Yeah, no. I'm bleeding bad here,\n            friend...\n\n                      SCOTT\n                 (he looks over)\n            Yeah, we just, we got to get\n            some...yeah, you need, all we\n            need, some tailoring tools.\n\nANGLE, Sedan. Holding Anton and several agents, listening to\nthe broadcast from Scott's car.\n\n                      SCOTT\n            Yeah, in my wishlist, we had a\n            drugstore, get us some morphine,\n            some...\n\nANGLE EXT. ANTON'S CAR. As it increases speed.\n\nANGLE INT. SCOTT'S CAR. As he tries to staunch the fellow.\nScott steers with one hand. And turns off the highway at an\nexit, showing two miles to a town.\n\nINT. SMALL TOWN PHARMACY. DAY.\n\nScott, dressed in the farm clothes that he took off of the\nline. Scott is buying supplies. On the counter we see\nbandages, hydrogen peroxide, etc. Behind the counter we see\na newscast, showing a picture of Laura Newton, in long\nblonde hair, and a woman is doing a talking-head about fashion.\n\n                      TV WOMAN\n            ...America's Number One Redhead,\n            \"She Sets the Style, She Brings\n            a Smile\", she's Betty co-ed, in\n            College, and she's off for what\n            her father's office says is an\n            \"extended sailing weekend\".\n                 (the screen shows a sailboat)\n            With \"person or persons\n            unknown\"...yo ho, yo Ho...she\n            \"old\" enough for that, our\n            \"Little Red Riding-Hood\", Cathy...?\n\nScott ignores the screen.\n\nANGLE EXT. THE STORE. In back, Assani is sitting in the\npickup, a woman driving another beat-up pickup pulls into\nthe lot, there is a shotgun in the rack by the rear window.\nAssani crouches lower, to prevent being seen.\n\nANGLE INT. THE STORE. As Scott is checking out. A policeman\nenters from the police car. We see it is Anton.\n\n                                                             70.\n\n\nANGLE. On Scott, as he moves to the back of the store, to\nmeet Anton. Scott looks inquisitively at him.\n\n                      ANTON\n                 (whispers)\n            ...the helo just went down...\n\n                      SCOTT\n            ...don't whisper to me, Baby, it\n            draws heat. What helo?\n\n                      ANTON\n            ...the assault helicopter. You've\n            got no backup, at the house.\n                 (beat. Scott nods)\n            You'll be in there, alone, the\n            first few minutes...\n\n                      SCOTT\n            Well, there you go, then.\n\n                      ANTON\n            You said \"Never go in without an\n            overwatch\".\n\n                      SCOTT\n            That's all fine, lad, \"But this\n            is the fleet\".\n\n                       ANTON\n            You know you deliver him in the\n            door, you know they're going to\n            waste you.\n\n                      SCOTT\n            ...gimme whatever nine mil you've\n            got...\n\nAnton takes out the magazines in the pouches on his belt.\nAnd starts to strip off the rounds.\n\n                      SCOTT\n            ...just gimme the mags...\n                 (Anton does so)\n            ...gimme your piece.\n\nAnton takes the pistol from his belt. Scott checks it, and\nputs it in the small of his back.\n\nANGLE EXT. THE STORE. Assani, in the pickup, sees through a\nsmall window in the store.\n\nANGLE on Anton and Scott. Scott is walking away from him,\nand Anton puts a hand on him, and turns him back.\n\n                                                             71.\n\n\nANGLE INT. THE STORE. Anton gestures Scott to wait a moment.\nScott waves, it is not necessary. He goes to the counter,\nand picks up the medical supplies. He starts toward the back\ndoor. He calls back, over his shoulder\n\n                      SCOTT\n            Thank you...\n\nANGLE on Anton, as we see something occur to him. He turns\nto the other officer with him, and asks a question, and we\nsee the other officer hand Anton several magazines of\nammunition.\n\nANGLE on Scott, as he is coming out of the back door.\n\nANGLE on Anton, as he follows him.\n\n                      ANTON\n                 (calling)\n            Mister...mister: you forgot your\n            change...\n\nANGLE on Scott, as he turns back. We see Anton bringing the\nammunition.\n\nANGLE on Assani, weak, holding the shotgun, as he supports\nhimself along the wall, he peers around the corner, at Anton\nand Scott.\n\n                      ANTON\n                 (sotto)\n            ...you better take care of\n            yourself, because...\n\nANGLE, on Assani, who comes around the corner, and fires the\nshotgun at Anton, who falls. Scott screams \"No\".\n\nANGLE, on Scott, who drops the packages, and turns to Assani,\nwho is jacking another round into the chamber of the shotgun.\nScott draws and fires at him several times.\n\nANGLE on Scott, who kicks away the shotgun, and turns back\nto Anton, who is crawling on his back, out of the line of\nfire...\n\n                      ANTON\n            A...I'm alright...I'm alright...\n\nANGLE, on Scott, turning to look at Anton. And, then, back\nat the obviously dead Assani.\n\nINT. SMALL TOWN HOSPITAL. DAY.\n\nIn a waiting room. Scott, who looks up, as Miller enters.\n\n                                                            72.\n\n\n                      MILLER\n            Your partner's going to be alright.\n\n                      SCOTT\n            I do not look at the downed man,\n            Sir...\n\n                      MILLER\n            Yeah, well...\n\nMiller nods, and starts to walk away.\n\n                         SCOTT\n            ...Sir...?\n\nMiller turns back, understanding Scott's request.\n\n                      MILLER\n                 (sits, acceding to\n                 Scott's request)\n            ...Air Force Assault is airborne,\n            five minutes out.\n                 (pause, Scott shakes\n                 his head sadly)\n            Standing down's a bitch.\n\n                       SCOTT\n            I stand down when the girl's\n            back, sir.\n\n                      MILLER\n            They'll get her out, if she's in\n            there...\n                 (pause, as he looks at Scott)\n            You did your part, what the fuck\n            do you want, a Citation?\n\nOut of the window we see a   medical helicopter. Its rotors\njust starting to turn. We   see two white-coated medical types,\ncarrying bags, run toward   the medical copter. An Aide comes\nin, and gestures to Miller   that the copter is ready to go.\n\n                         AIDE\n            ...sir...\n\nMiller turns to leave. Scott stands wearily.\n\n                      MILLER\n            Where are you going.\n\n                      SCOTT\n            On the dustoff.\n\n                                                             73.\n\n\n                         MILLER\n            Forget it.\n\n                      SCOTT\n            Sir...? Sir...?\n\n                      MILLER\n            There's no room.\n\n                      SCOTT\n            I'm pleading with you, sir...\n\n                      MILLER\n            Let him hear the assault on the\n            Net...\n\n                      SCOTT\n            I want to see the girl.\n\nMiller shakes his head - at the door, turns back for one\nlast word to Scott. And then he stops.\n\nANGLE. HIS POV. The television, in the next room, playing a\nnews program. Scott looks inquiringly at Miller, who is\ntransfixed by the television.\n\nANGLE the television. A \"Breaking News\" story. We see an\noverturned sailboat, and the talking head narrating: \"...the\ntragic, the stunning...the...Jim, I don't know what to\nsay...\" The woman's co-anchor, obviously very shaken, takes\nup the story, and we see live footage of an overturned\nsailboat being towed into a harbor, then inserts of \"Our\nRedhead\" Laura Newton, and, after a moment, the Professor.\n\n                      JIM (TALKING HEAD NEWSCASTER)\n            The death, just reported, the\n            death of Laura Newton. The... the...\n\nANGLE, on the TV. On two bodies being taken from the water\nby medical technicians.\n\nANGLE, the woman, as a shot of the political man we saw\nearlier in the newspaper, comes on the screen.\n\n                      TALKING HEAD WOMAN\n            ...her father, on the eve of the\n            campaign...\n                 (we switch to a video\n                 shot of this man,\n                 waving off reporters)\n            Jim, can there be any doubt...\n\n                                                            74.\n\n\n                      JIM\n            Tracey, the Secret Service, for\n            obvious reasons, their records,\n            the DNA, fingerprints... the...\n            and, she had just been in the\n            water a scant, less than four\n            hours, the...apparently the boat\n            swamped... she -\n\n                      TRACEY\n            She was sailing with...?\n\n                      JIM\n            With her professor, Professor...?\n                 (the video shows the Professor)\n\n\nANGLE, on Tracey, as she is overcome, and tries to steady\nherself.\n\nANGLE, on Miller, and the Troopers in the room. Miller looks\naway from the screen, to Scott.\n\n                      TRACEY\n            ...a Tragedy, such as this.\n\n                      JIM\n            ...particularly. Particularly,\n            Tracey, coming, right at the\n            start of his Campaign...\n\nAn insert of Laura's father, his sportcoat slung over his\nshoulder, comes onto the screen.\n\n                      TRACEY\n            Will he delay the start of the\n            Campaign?\n\nANGLE. On Scott. As he is found, standing, near the\ntelevision. Off to the side, behind him, we see Miller,\nintently, on the phone, listening.\n\n                      JIM\n            ...his grief...\n\n                      TRACEY\n            ...he was very close to his\n            daughter, wasn't he?\n\n                                                            75.\n\n\n                      JIM\n            Well, indeed, he saw her, the\n            day...that would be, the day\n            before last. He was in Boston\n            for the Strategy Meeting, and\n            saw her then...\n\n                      TRACEY\n                 (sadly)\n            ...and that would be the Last\n            time...that...\n\nANGLE. On Scott. As he is looking at the television, he\nshakes his head minutely, as if in a dialogue with himself.\nHe walks back to the interrogation room.\n\nScott sits heavily. Miller walks in and sits next to him.\n\n                      MILLER\n            Her boyfriend called her a slut.\n            She went off to prove it. Her\n            and the Professor. Coked up,\n            boat capsized...Both bodies\n            washed up naked. Coast Guard\n            dressed 'em up...full of Ecstasy...\n\n                      SCOTT\n            ...he killed her...\n\n                      MILLER\n                 (shrugs, meaning \"who knows\")\n            He was fucking her, they're\n            stoned...the boat capsized...\n\nMiller looks down at the artifacts.\n\n                      MILLER\n                 (almost to himself)\n            ...so much death.\n\n                      SCOTT\n                 (philosophically, as\n                 if summing the whole\n                 thing up)\n            ...rock crushes scissors...\n\nWe see Miller leave, as Scott turns away, and lights a\ncigarette. Miller turns back.\n\n                      MILLER\n            I'm sorry about your man.\n\n                                                           76.\n\n\n                      SCOTT\n            He isn't my man, Sir. He's a\n            trainee.\n\nBeat. Miller leaves the room. Scott hangs his head with\nweariness.\n\nINT. GOVERNMENT TRANSPORT PLANE. NIGHT.\n\nAnton, in bandages, in a bunk in the transport plane. Scott,\nasleep, in a chair near him.\n\nANGLE on Anton, as he comes awake.\n\n                      ANTON\n            ...what time is it?\n\n                      SCOTT\n            What do you care...?\n                 (pause. We see that\n                 Anton is having\n                 difficulty formulating\n                 his thoughts)\n\n\n                      ANTON\n            I fucked up.\n\n                      SCOTT\n            ...in what way was that?\n\n                      ANTON\n                 (groggily, as he tries\n                 to move, to draw closer\n                 to Scott)\n            ...but I was trying to help.\n                 (Scott reacts to\n                 Anton's pain.)\n\n\n                      SCOTT\n            What? Do you want some more Dope?\n            Whaddaya want, a Dr. Pepper...?\n\nScott takes a pill vial from Anton's jacket. Takes out a\npill, and administers it to him.\n\n                      ANTON\n            ...but I was trying to help.\n\n                                                77.\n\n\n                      SCOTT\n            ...yeah, well, that's when people\n            generally do fuck up. Wait for\n            that to kick in.\n                 (Anton starts to lay\n                 back, and then, as if\n                 he is remembering\n                 something, he draws\n                 closer to Scott again.)\n            You're gonna take that fight to\n            bed for a while. You don't got\n            to do it all now.\n\nAnton gestures Scott to draw close.\n\n                      ANTON\n                 (sotto)\n            I saw the sign.\n\nANGLE XCU on Scott as he turns away.\n\n                      SCOTT\n            ...uh huh...\n\nScott turns away.\n\n                       ANTON\n                 (drawing him back, as\n                 if saying LISTEN:)\n            I saw the sign...at the Cape. In\n            the House.\n\n                      SCOTT\n            You saw-the-sign. What sign?\n\n                      ANTON\n            ...when I dropped the guy. The\n            girl's Picasso sign...\n                 (he draws the sign in\n                 the condensation on\n                 the plane's window)\n            She was there. At the Cape. The\n            girl was there.\n\n                      SCOTT\n            The girl wasn't there. She was\n            on a boat. She fell off the boat.\n            She's dead.\n                 (pause)\n            You did what you could. You did\n            what you were trained to do.\n                 (pause)\n            You did what you could.\n\n                                                             78.\n\n\n                      ANTON\n            ...I saw the sign...\n\n                      SCOTT\n                 (turning away)\n            ...then you are Truly Blessed.\n\nINT. TRAINING FACILITY. DAY.\n\nWe see the Dojo, training room. Several exhausted young men\nin sweat stained fatigues watch a lecturer, with a knife in\nhis hand, demonstrating a manoeuvre with a trainee.\n\nBeyond, on the wall, we see the sign. \"These are the\nprecincts of pain. A Godess lives here. Her name is Victory.\"\n\nBeyond, through the open doors, we see Scott's Mustang\ndriven up to a nearby building. A young man gets out.\n\nANGLE, INT. THE BUILDING. Scott, rested, clean, shaved,\ndrinking a cup of coffee. Sitting across a desk from an\nInterrogator, who has several notes in front of him.\n\n                      INTERROGATOR\n            ...from the house, a house, a\n            holding facility, a compound?\n            called Maskala. The girls are\n            taken from Maskala, to the\n            ...Royale Hotel, in Dubai.\n                 (he closes the notes,\n                 as if completing his presentation)\n            As time passes, you may remember\n            other aspects of...well,\n                 (the Interrogator stands)\n            You've heard this speech before...\n\nHe extends his hand to Scott. Scott looks inquisitively at\nhim, then pauses, then stands.\n\nANGLE EXT. THIS BUILDING. Scott exiting, as Blane comes out\nof his office. They walk through the compound. And to the\ncamera, toward the Mustang.\n\n                      SCOTT\n            ...would be most grateful, sir,\n            to be included on the mission.\n            \"At Such Time...\"\n                 (pause)\n\n\n                      BLANE\n            ...on a mission to Dubai.\n\n                                                             79.\n\n\n                      SCOTT\n            Is it in contemplation, sir...?\n                 (pause)\n\n\nANGLE, on Blane, who looks at him to say \"you know better\nthan to ask.\"\n\n                      SCOTT\n            Yes, sir.\n                 (pause)\n            If and When, Sir...\n\n                      BLANE\n            You need a rest, Bobby.\n                 (pause. as he extends\n                 his hand)\n            Thank you, Bobby...\n\nScott puts down the small yellow duffle he carries, next to\nhis Mustang. The young man who drove it in stands by, as\nBlane and Scott shake hands. Scott looks at the training\nfacility.\n\nANGLE HIS POV. The lecturer, executing unarmed combat moves\nagainst a trainee, who holds a knife. The lecturer puts the\ntrainee on his back.\n\nScott starts to walk toward this facility. He stands outside,\nby an open double-door, next to a water cooler, and draws\nhimself a cup of water, which he drinks. As he watches the\nlesson.\n\nHe turns back, as he sees the young man who drove in the\nMustang pick up the yellow duffle, to put it into the car.\n\n                      SCOTT\n            ...please don't touch that.\n                 (Scott picks up the\n                 duffle and puts the\n                 strap over his shoulder)\n\n\nANGLE, Scott's POV, as he turns. We see the young female\nsergeant, Jackie Black, in the BG, walking across the area.\n\nScott nods at her. She nods back. Scott starts to get into\nhis car, and then turns back.\n\nANGLE. SCOTT'S POV as the trainee on the mat gets up, and\nthe lecturer gestures at the knife he has dropped on the mat.\n\n                      LECTURER\n            ...pick it up.\n\n                                                          80.\n\n\nThe trainee picks up the knife. The lecturer shakes his head.\n\n                      LECTURER\n            What are you studying here...?\n            I'm talking to you, son... What\n            are you studying?\n\n                      TRAINEE\n            Sir, this Candidate is studying\n            knife fighting.\n\nThe lecturer pauses, looking down at the ground. Beat.\n\n                      LECTURER\n            Hold your ground, son.\n\nThe Trainee goes into a knife fighting stance.\n\n                      LECTURER\n                 (pointing behind him)\n            ...you, and your friend...\n\nThe Trainee lets his attention drift for a second, in the\ndirection the Lecturer has pointed. And the Lecturer screams,\nsteps in, disarms the Trainee, throwing him to the mat. As\nthe Trainee picks himself up the Lecturer turns to the class.\n\n                      LECTURER\n            There are two ways to fight, you\n            can fight fair, or you can fight\n            to win.\n\nThe Trainee puts his hand to his head, and discovers he is\nbleeding. The Lecturer nods his permission, and the Trainee\nwalks to a water cooler, next to which Scott is standing.\nScott looks at the shamed Trainee.\n\n                      SCOTT\n            Don't you study knife fighting,\n            son. You Learn to Kill. And then,\n            f'you meet some other fellow,\n            studied knife fighting, you send\n            him to hell.\n\nANGLE, on the Lecturer, who calls another Trainee up.\n\n                        LECTURER\n            Next man:\n\nA Trainee stands.\n\n                      LECTURER\n            Now: I want to see some evil intent.\n\n                                                            81.\n\n\nThe Lecturer glances at Scott, and makes a small \"have a\ndrink\" gesture. The Lecturer nods back \"yes\". Scott walks\ntoward his car.\n\nEXT. \"CONSTRUCTION GATE\". DAY.\n\nThe man inside the \"construction booth\" raises the barrier,\nand looks at Scott, who drives through.\n\nINT. ROADSIDE TRUCKERS BAR. NIGHT.\n\nThe Lecturer (Grace) and Scott, in a booth drinking.\n\nPause.\n\n                      GRACE\n            Hey, fuck it, Huh...?\n\n                      SCOTT\n            I've always thought so.\n\nScott gestures for another round to the bartender. Who is\nserving some rough trucker types, two of whom are at the bar\nwith a couple of very attractive young women. One is a\nstunning redhead, who looks back at Scott.\n\n                      GRACE\n            How'd the puppy like it out there?\n            He piss in the punchbowl?\n\n                      SCOTT\n            He did okay.\n\n                      GRACE\n            I heard he caught poison ivy.\n\n                      SCOTT\n            He did okay. Why? You goin' out?\n\n                      GRACE\n            What?\n\n                      SCOTT\n            You recruiting?\n\n                      GRACE\n            Why would I be recruiting?\n\n                      SCOTT\n            You speak Arabic, huh...?\n\n                      GRACE\n            That's what the Arabs tell me.\n\n                                                          82.\n\n\n                      SCOTT\n            You, reason I ask: you going in\n            the Sandbox...?\n\n                      GRACE\n            Ain't you overdue for some Down\n            Time?\n\n                      SCOTT\n            I'm just saying:\n\nScott is distracted. He is watching the talking heads, on\nthe bar TV talking about Laura Newton. We see the photos of\nher in high school, with her father in some African country,\net cetera.\n\nANGLE. On Grace, watching Scott. Who shakes his head very sadly.\n\n                      GRACE\n            Yeah. You Marines are a weepy\n            bunch of motherfuckers.\n                 (Scott nods minutely\n                 in acknowledgement.\n                 And returns to watching\n                 the television)\n            ...you get a chance to bowl in\n            that tournament...?\n\nANGLE on Scott. Caught in the image of Laura Newton, on the\ntelevision.\n\n                      SCOTT\n                 (to himself)\n            ...beautiful girl...\n\nANGLE on the truckers, near the television, looking at Scott.\nOne comes over to him.\n\n                      TRUCKER\n            ...you say something, Mister...?\n\n                      SCOTT\n            No, I was looking at the\n            television.\n                 (pause)\n            I was talking to the television.\n                 (he turns to look at\n                 the girl)\n            That girl's too good-looking for\n            you anyway. What are you \"rich\"?\n            What do you, \"own\" something?\n                      (MORE)\n\n                                                           83.\n\n\n                      SCOTT (CONT'D)\n                 (pause)\n            Or are you \"funny\" or\n            something...?\n                 (pause. Hold for a\n                 beat, on the confused\n                 face of the Trucker)\n            Siddown. Lemme buy you a drink.\n\nINT. SLEAZY MOTEL ROOM. DAWN.\n\nA sound of a truck, coming down the highway.\n\nANGLE, on the doorknob of the hotel room. We see several\nquarters stacked. As the truck sound comes closer, the\nquarters start to rumble, and fall off the doorknob.\n\nANGLE, on the floor, a glass ashtray. The quarters fall into\nthe ashtray.\n\nANGLE, Scott, in bed, naked, comes awake, as the quarters\nhit the ashtray. He has a pistol in hand, and awakes with a\nstart, screaming. He surveys the motel room, taking in his\nnew surroundings. Beat. Next to him, the redhead from the\nbar, also naked, comes awake, frightened, looking at Scott.\n\nANGLE, on Scott, as he surveys the hotel room.\n\nANGLE HIS POV. On a dresser, a cheap imitation pewter bowl,\nan orange and a banana in it, on the table next to it, his\nswitchblade, open, and the remains of a peeled apple. He\nlooks at the knife, and at the girl.\n\n                      SCOTT\n            You peel the apple?\n\nShe nods, not sure how to take Scott.\n\n                      SCOTT\n                 (as he starts to come\n                 down from the\n                 adrenaline rush)\n            ...well. You should wipe off the\n            blade.\n                      (MORE)\n\n                                                            84.\n\n\n                         SCOTT (CONT'D)\n                   (pause. Scott does so,\n                   cleaning the blade on\n                   a napkin)\n            Or   else...\n                   (as if explaining the\n                   simplest and most\n                   perfect axiom of the universe)\n            Or   else, it \"rusts\"...\n                   (a pause. He smiles at\n                   her. Pause)\n            D'I   scare you...?\n                   (he closes the blade\n                   and sits on the bed,\n                   shaking his head to\n                   clear it)\n            I'm   sorry if I frightened you.\n                   (pause)\n\n\nEXT. SMALL TOWN RURAL MAIN STREET. DAY.\n\nA three-store town, a couple of pick-up trucks parked in\nfront of the country store. A large double log truck goes\nthrough the town. The girl looks for some topic of\nconversation, to bridge the awkward moment.\n\n                      GIRL\n            ...it's an odd knife.\n\n                      SCOTT\n            Yeah. I got it from a Russian\n            fellow.\n\n                      GIRL\n            Was it a gift...?\n\n                      SCOTT\n            No. As I remember, he seemed\n            rather reluctant to part with it.\n                 (pause)\n            It's just a knife.\n\nEXT. SMALL RURAL VILLAGE. MAIN STREET. DAY.\n\nA three store town. A couple of pickup trucks parked in\nfront of the country store. Scott's Mustang parked next to\nthem. A large, filled, double-length log truck speeds\nthrough the village. Scott, in his lumber jacket, is\nassembling various maintenance items on the checkout counter.\nA large paintbrush, several boxes of nails, a gallon of\npaint. The Proprietor, a good-natured fellow in his fifties,\ncomes up to the counter to check Scott out.\n\n                                                             85.\n\n\n                      PROPRIETOR\n            How you been, John...?\n\n                      SCOTT\n            ...workin hard...\n\n                      PROPRIETOR\n            ...bet you have...\n\n                      SCOTT\n            How you, Billy...?\n\nProprietor pours Scott a cup of coffee from the pot on the\nback counter. He mixes in sugar and cream. Billy nods in\nresponse to Scott's question.\n\n                      PROPRIETOR\n            ...one gallon goin to do it...?\n\n                      SCOTT\n                 (pointing at him accusingly)\n            ...you been lookin' at my house...?\n\n                      PROPRIETOR\n            Nope, just trine a sell you some\n            paint...\n                 (as he puts the cup\n                 down in front of Scott.\n                 Joking)\n            ...but, now you mention it...\n\nANGLE, On Billy, as he moves to a new customer, a farmer,\nwho comes in, and nods at Scott.\n\n                         NEW FARMER\n            ...John...\n\n                      SCOTT\n            Mr. Reese, how are you...?\n                 (Billy goes to take\n                 care of the new\n                 customer, and turns\n                 back to deal with Scott,\n                 who is waiting to ask\n                 a question)\n            That new saw blade come in?\n\n                      BILLY\n                 (as if just remembering)\n            No, John. It did not. I beg your\n            pardon. I know that's your\n            baby...I'm gone call them up and\n            get Right On That.\n\n                                                             86.\n\n\nANGLE on Scott, who sees something out the window, and moves\ntoward the front of the store.\n\n                      BILLY\n                 (as an afterthought)\n            ...'spected you back a few days\n            ago...\n\n                      SCOTT\n                 (looking out the window,\n                 absently)\n            I took the Long Way Home.\n\nANGLE Scott, who is looking, over his coffee, at something\non the street. And we see, his POV, a very city rent-a-car\nwhich is now across the street. We see a man getting out of\nthe car.\n\nEXT. GAS STATION. COUNTRY VILLAGE. DAY.\n\nWe see the back of a man, next to the rental car, which is\nnext to the Mustang. He turns, and we see that it is Anton,\nhis arm in a slig, his face creased by pellet scars.\n\nANGLE, his POV. Looking at Scott, who has just snuck up\nbehind him.\n\n                       SCOTT\n            Could I see your Right Hand,\n            please...?\n\n                      ANTON\n            There's nothing in my right hand.\n\n                      SCOTT\n            Could I see it, please...?\n\nAnton holds up his right hand. Scott relaxes, and comes\nforward. Anton gestures, meaning, \"what was that about\"?\nScott takes Anton's right hand, by the wrist, and turns it\nover. He explains:\n\n                      SCOTT\n            You put your wedding ring back on.\n\n                       ANTON\n                 (not understanding the\n                 import of the question)\n            ...yes...?\n\n                                                             87.\n\n\n                      SCOTT\n            Then I have to guess you're not\n            \"on assignment\".\n                 (pause)\n            You're in the wrong place, baby.\n                 (pause)\n            How did you find me...?\n\nAnton gestures at the \"Oilchange\" sticker on the Mustang's\nwindshield.\n\nANGLE from INT. The Car. We see the sticker reading \"Mike's\nService Station, Bradford, PA\". And beyond it, the actual\nold, tin sign of the garage, reading \"Mike's Service Station\".\n\nANGLE, on Scott and Anton.\n\n                      SCOTT\n            Well, I guess I'm not as smart\n            as I thought I was.\n                 (pause)\n\n\n                      ANTON\n            I need to talk to you.\n\nA beat. Scott shakes his head, as if in a sad comment to\nhimself. He sighs.\n\nEXT. RURAL STREET. DAY.\n\nAnton and Scott walking down the street.\n\n                      ANTON\n            I saw the sign.\n\n                      SCOTT\n            \"You saw the sign\". You were up\n            for a week, you coulda seen Jack\n            Ruby, you don't know what you\n            saw...your first-time-out.\n\n                      ANTON\n            I saw the sign.\n\n                      SCOTT\n            ...then, you tell me: you saw\n            the sign, how is it, they found\n            the girl, the DNA...why would\n            they do that...? Her father? Her\n            father would do that to her?\n\n                      ANTON\n            ...maybe he doesn't know...\n\n                                                   88.\n\n\n                      SCOTT\n            Well. You're living in a\n            fairyland of your Own Devising.\n            You're seeing snakes.\n                 (pause)\n\n\n                      ANTON\n            Who's going to Dubai...?\n                 (pause. Scott hesitates)\n            They've got a white slave ring,\n            in Dubai, with American girls\n            there - are they going in?\n                 (pause)\n            Are they sending you in...?\n                 (pause)\n            Ask them...\n                 (pause)\n\n\n                      SCOTT\n            You Got. To Leave it for your\n            Betters.\n\n                        ANTON\n            Ask them.\n\n                      SCOTT\n            Why would you want to know?\n                 (pause)\n            Listen up, Pal. THEY don't go\n            through the door. WE don't ask\n            why. That's not a COST, it's a\n            Benefit. Because we Got to Travel\n            Light. You wanna lose sleep over\n            it, get over it, or get out.\n                 (hold. pause)\n            You wanted to go Through the\n            Looking Glass. How was it? Was\n            it more fun than Miniature Golf...?\n\n                      ANTON\n            I want a favor.\n\n                      SCOTT\n            Why would I do you a favor?\n\nTwo old ladies come down the small main street.\n\n                      OLD LADY\n            Morning, John, who's your friend...?\n\n                      SCOTT\n            Fella wants to buy my car.\n\n                                                 89.\n\n\nThe old ladies walk on. Pause.\n\n                      ANTON\n            I saved your life.\n\n                      SCOTT\n            Well what were they paying you\n            for...?\n\n                      ANTON\n            Bobby, I saw the Sign...\n\n                      SCOTT\n            My name ain't Bobby.\n                 (pause)\n\n\n                      ANTON\n            I saw the sign.\n                 (he draws the Picasso\n                 sign in the dust on\n                 the window of the\n                 country store)\n            I Saw it. At the beach house.\n                 (pause)\n            I'm going back.\n\n                      SCOTT\n            Back?\n\n                      ANTON\n            To the beach house.\n\n                      SCOTT\n            They took it apart with a\n            tweezers.\n                 (Anton shakes his head)\n\n\n                      ANTON\n            She was there. The Girl was There.\n            I'm going back.\n                 (pause)\n            I want you to do something.\n\n                      SCOTT\n            What would that be?\n\n                      ANTON\n            The Secret Service Agent. Offed\n            himself.\n\n                      SCOTT\n            ...he was off boffing his girl.\n\n                                                          90.\n\n\n                      ANTON\n            He shot himself with a hide-out\n            pistol.\n\n                        SCOTT\n            Yeah?\n\n                      ANTON\n            Who frisked the sonofabitch?\n                 (pause)\n            You ask them.\n\nANGLE, on Scott, obviously off-balanced by the question. Hold.\n\nINT. GOVERNMENT OFFICE BUILDING. DAY.\n\nStoddard, smoking a black cigar, and several \"Bureau\" types\nin the office. Scott is sitting at a conference table, as is\nMiller. Beat.\n\n                      STODDARD\n            Number one, the girl's dead.\n            Number two, the hide-out gun the\n            Agent shot with's registered in\n            his 1020 for the past five years.\n            The man who tossed him has been\n            sacked. His name is none of your\n            concern. Now: what the fuck are\n            you doing here?\n\n                      SCOTT\n            Sir, I am not here to question...\n\n                      STODDARD\n            Well, then, what the fuck are\n            you doing here...?\n\n                      MILLER\n            Sir, as he said, he is here to\n            apprise you of a security leak...\n\n                        SCOTT\n            ...and...\n\nMiller gestures to him to shut up.\n\n                      MILLER\n            To call your attention to what\n            may be a problem in discipline\n            with this...\n\n                                                             91.\n\n\n                      STODDARD\n            Granted. Granted.\n                 (he stands)\n            Granted. Fine. Thank you.\n\n                      SCOTT\n            And. Sir...If I may...\n\n                      STODDARD\n            What is it?\n\n                      SCOTT\n            When the operation is staged in\n            Dubai...\n\n                      STODDARD\n            What is this...?\n\n                      MILLER\n            He...\n\n                      STODDARD\n            ...what the fuck are you talking\n            about?\n\n                      SCOTT\n            I am merely saying, when -\n\n                      STODDARD\n            Forget it. Walk away.\n\n                      SCOTT\n            I...\n\n                      STODDARD\n            Yeah...you're a pit bull. I said\n            forget it. How do we contact Anton?\n\n                      MILLER\n            ...Anton...\n\n                      STODDARD\n            Your partner...He's gone to\n            ground...\n\nScott shrugs, as if to say, \"Is that the way you want it?\"\n\n                      MILLER\n            Yes, sir...\n\n                                                             92.\n\n\n                      STODDARD\n            And, wait, wait, wait, wait,\n            what does this mean...?\n                 (of Scott)\n            When and if, any operation is\n            staged which may require your\n            talents, I give you my word...\n                 (Scott shakes his head,\n                 saying \"I don't believe\n                 a word of it\")\n            You impertinent motherfucker.\n            What the fuck is with you, you've\n            got on your \"thinkingcap\" all of\n            a sudden...?\n\nStoddard gestures to an aide to call a number.\n\n                      SCOTT\n            I'd like to finish what I started.\n\n                      STODDARD\n            And I'm telling you to Stand\n            Down. Where's the kid?\n                 (pause)\n\n\n                      SCOTT\n            Is there no operation in Dubai...?\n\nStoddard shakes his head in exasperation.\n\nThe Aide hands Stoddard the phone. Stoddard answers. Listens\nfor a moment, and then points at Scott.\n\nEXT. GRAVESIDE. DAY.\n\nA small photograph on an easel - it is an image of Gaines,\nthe dead Secret Serviceman.\n\nANGLE, a small funeral. A Marine Honor Guard in attendance.\nSmall suburban cemetery.\n\nANGLE on the Pastor.\n\n                      PASTOR\n            ...in the Service. In the Service\n            of his Country. No less than had\n            he died in Combat. George Gaines,\n            a man who gave his life to\n            service, to protecting those who...\n\nANGLE, an unmarked sedan. Scott, and a Driver. Looking on.\n\n                                                            93.\n\n\n                      DRIVER\n            ...sucker did the Dutch.\n\n                      SCOTT\n            I heard it was a training accident.\n\n                      DRIVER\n            Nope, he Ate the Gun. Didn't you\n            know?\n\n                      SCOTT\n            I've been out of town.\n\n                      DRIVER\n            Punched out early, off with the\n            girlfriend, his Principal wanders\n            off, winds up dead: hari-kari...\n\nANGLE, on Scott, as he sees something. Scott takes a book of\nmatches and starts to light a cigarette.\n\n                      DRIVER\n            ...rather you didn't smoke in here.\n\nScott gets out of the car.\n\nANGLE, on Scott, who takes out the Anton \"Rogers Rangers\"\ncard. He motions the driver to pass him a phone and Scott\nlooks at the number on the card and dials.\n\nBeyond him we see, just at the limits of the gravesite.\nHolding himself apart. A young man in a raincoat. The young\nman turns at the sound of a limo driving up.\n\nANGLE Scott, looking at the limo. Out of the limo, which\nstops near the grave, we see Burch emerge. There is a\nsusurrus among the crowd, which, visibly, straightens a bit,\nat the honor of Burch's presence. We see Burch walk to the\ngravesite, and have a word with the widow. Burch puts his\nhands on her shoulders and comforts her.\n\nANGLE, on Scott, looking at the man in the raincoat. We hear\nrifle fire, and Scott flinches.\n\nANGLE his POV. The Marine Honor Guard, rendering a salute.\nWe see a Marine bear the flag to Burch, who presents it to\nthe widow. He shakes several hands, and then moves off, back\nto the limousine. He beckons Scott over to him.\n\nANGLE, Scott and Burch, walking through the cemetery. Burch\nshakes his head. He hands Scott the program from the funeral,\nand reluctantly begins.\n\n                                                94.\n\n\n                      BURCH\n            I put myself in your hands.\n            Didn't I...?\n\n                      SCOTT\n            I do not follow you, sir.\n\n                      BURCH\n            I reached out to you.\n                 (pause)\n            I put my life into your hands. I\n            entered into a conspiracy with\n            you. To commit Murder. Because\n            it needed to be done.\n                 (pause)\n            I trusted you with my life.\n\n                      SCOTT\n            I would never betray you, sir.\n\n                      BURCH\n                 (waving his assurances away)\n            I trusted you with my life. And\n            yet you cannot trust me.\n                 (pause)\n            There are things you have not\n            been told. That's right.\n                 (pause)\n            And now you're all out-of-line,\n            \"Play me or trade me...\"\n                 (pause)\n\n\nANGLE, on the two.\n\n                      BURCH\n                 (almost as if against\n                 his better nature)\n            There is an Arab World. To\n            penetrate it makes trying to\n            join the Mafia look like a walk\n            in the park. How would you do it,\n            Scott?\n                 (pause)\n            We're dying. We're at war. And\n            we have no intelligence. How\n            Would you do it? How would you\n            infiltrate their clan structure?\n            Where is the interface?\n                 (pause)\n            It's at the whorehouse. That's\n            where they go to get frisky, and\n            that's where we listen to them.\n                      (MORE)\n\n                                                          95.\n\n\n                      BURCH (CONT'D)\n            For the few, priceless hints\n            that we get from that fucking\n            sandpile.\n                 (pause)\n            Had the girl been there, we would\n            have moved heaven and earth -\n            you know we would, and, we would\n            have got her out. She was not\n            there. She got drugged up and\n            fell off a boat, and drowned.\n            She's dead.\n                 (of the funeral)\n            That man,\n                 (Burch gestures at the\n                 photograph-on-the-\n                 easel, of George Gaines,\n                 the Secret Service man,\n                 which stands by the\n                 head of the grave)\n            That man a sworn office of the\n            Secret Service, went to get laid,\n            and she died. And you are risking\n            the lives of men and women in\n            the field, because you won't\n            take orders. How are you better\n            than him? Yes. You had best look\n            sheepish. What the fuck have you\n            got to say?\n\n                      SCOTT\n            No excuse, sir.\n\n                      BURCH\n            You're goddam right.\n                 (pause)\n            Now: where's this new kid who\n            got you all bothered. Where's\n            your partner?\n\n                      SCOTT\n            ...I'll call him off.\n\n                      BURCH\n            The fuck you will. You've got\n            nothing to say to him. He's gone\n            to the ground. Where is he...?\n\nANGLE. Over the Honor Guard, packing up, we see Scott hand a\nscrap of paper to Burch, who makes one or two more points,\nto which Scott nods, submissively. Burch walks off. Camera\nfollows the Honor Guard, down the path, toward Scott, who,\npassing, nods at them.\n\n                                                             96.\n\n\nHOLD on Scott. As he watches the widow, at the gravesite,\nbeing walked away to a limo by the pastor. He feels someone\nbehind him and turns.\n\nANGLE, SCOTT'S POV. A man in a raincoat, standing furtively,\nhalf-hidden by a tree, some distance off from the funeral,\nweeping. He holds a program for the funeral.\n\nANGLE on the man in the raincoat, the funeral beyond him. He\nis obviously distraught, a rather slight young man in his\nthirties. He looks at Scott for a moment, and then turns away.\n\nANGLE. On Scott. As he turns back to watching the end of the\nfuneral. As the gravediggers begin their work. He sighs. And\nmoves to a bench and sits. Looking at the gravediggers.\n\nDISSOLVE.\n\nEXT. DUSK. GRAVEYARD.\n\nScott, still sitting on the bench. The gravediggers,\nfinishing their work, begin to walk off, joking with one\nanother. Scott stands, and turns, about to start out of the\ncemetery. He stops for a moment.\n\nANGLE, HIS POV. The man in the raincoat, who is standing\nwhere last seen, looking at the burial. Walks toward the\nmound of earth, pauses for a moment, and then walks off.\n\nEXT. BUS STOP. DESERTED, SEMI-INDUSTRIAL AREA, ACROSS FROM\nTHE CEMETERY. DAY.\n\nThe raincoat man is standing waiting for a bus, at the bus\nstop, outside a working man's tavern.\n\nANGLE, on Scott, looking at the man, still weeping. Scott\nwalks up to the man. Each holds a copy of the program from\nthe funeral. The man looks down at the program, and then up\nto Scott.\n\n                      SCOTT\n                 (beat)\n            Terrible thing.\n                 (the man nods)\n            Did you know him?\n\nThe man nods. Beat. He turns back to Scott, looking for\nsympathy. Anguished.\n\n                      MAN\n            Did you know him...?\n                 (Scott nods. Pause. Portentiously:)\n            Where did you know him from?\n\n                                                             97.\n\n\n                      SCOTT\n                 (pause)\n            ...you know.\n\n                      MAN\n                 (pause. Nods)\n            He wasn't in the accounting\n            office. You knew that...\n\n                      SCOTT\n            Yes. I Did.\n\nThe man begins weeping heavily. Scott puts his arm around him.\n\n                      MAN\n            I didn't think, he told anyone\n            what he did. Because...because...\n                 (he looks for sympathy)\n            I...\n\n                      SCOTT\n            A few of us knew.\n                 (pause)\n\n\nThe man takes out a small photo in a leather case - we see\nit is a smiling photo of the Secret Service Agent, Gaines.\n\n                      MAN\n            And all he cared    about was doing\n            his duty...that's    all...that's\n            all... He used to    tell me...\n                 (the man is    now overcome)\n\n\n                      SCOTT\n            I'm so sorry.\n\n                      MAN\n            He was supposed to see me that\n            night...After his\n            \"shift\"...We...His wife...\n\nScott nods his understanding.\n\n                      SCOTT\n            Did she know? His wife. Did she\n            know?\n\n                      MAN\n            How could she? How could\n            she...she didn't know him...\n                 (pause)\n            Oh, the poor children...\n\n                                                          98.\n\n\nThe man begins shaking, and Scott embraces him to comfort him.\n\nANGLE, INT. THE WORKING MAN'S BAR. DAY.\n\nScott and the man, at the end of the bar. A few construction\ntypes enter. As Scott bends his head next to the man,\nspeaking low.\n\n                      MAN\n            ...he was going to come to me\n            that night...after...\n\n                      SCOTT\n            ...after his shift.\n\n                      MAN\n            ...his shift - yes...\n\nANGLE, on a Burly Man, in construction clothes, who is\nstanding next to them.\n\n                      BURLY MAN\n            ...excuse me...\n\n                      MAN\n            ...after, after he'd finished\n            driving him...\n\n                         SCOTT\n            ...him...?\n\n                      BURLY MAN\n                 (as he puts a hand on Scott)\n            I said...\n\n                      SCOTT\n                 (as he turns to the\n                 man, who is backing\n                 his way out of the bar)\n            ...driving him..? Did you say\n            \"him\"?\n                 (he reaches out to the\n                 effeminate man)\n\n\n                      BURLY MAN\n            Yeah. It's a man's world, pal -\n            but you're in the wrong bar.\n\nHe turns Scott around, and pushes Scott deeper into the room,\naway from the other man, who is now going out of the door.\nScott moves toward him and the Burly Man tries to stop him.\n\n                                                             99.\n\n\nScott strikes him several times, and starts toward the door,\nwhere, as he exits the bar, he sees the effeminate man, on\nthe bus, and pulling away.\n\nScott starts to move toward the bus. There is a hand on his\nshoulder, and a second man from the bar is whirling Scott to\nface him. Scott shakes him off and starts after the bus. The\nsecond man restrains him.\n\n                      SECOND MAN\n            ...what the fuck did you do to\n            my friend...?\n\nIn the B.G. We see the first man rise from the sidewalk, and\nmove toward Scott. Scott struggles to follow the bus, when\nthe second man assaults him. Scott is now fighting the two\nmen, who manoeuvre him toward an alley.\n\nAs Scott's back is to the alley we see a Third Man emerge\nfrom the shadows, and throw a garrotte around Scott's neck.\n\nScott headbutts this man, who hauls Scott off his feet.\nScott belts him again, and stomps on his instep. And turns\ninto him. He elbows this man as the other two men advance\ntoward him, in the alleyway. The garrotte man falls.\n\nScott kicks the garrotte man in the temple. And draws his\npistol. Beat.\n\nThe men in the mouth of the alleyway retreat.\n\nANGLE. On the street. We see them get into a van which has\njust pulled up.\n\nANGLE on Scott. Standing. Shivering. As he looks around the\nalleyway. He moves back to the fallen garrotte man.\n\nANGLE. Scott standing over the man. He sees something and\nbends down.\n\nANGLE HIS POV. In the man's backpocket is a program from the\nfuneral.\n\nANGLE, Scott standing, looking at the program. We hear the\nphone ringing. Scott puts the phone to his ear.\n\n                      SCOTT\n            ...where are you...? No. Tell me\n            later. Look: LOOK: Forget the\n            boat house. Look:\n                 (pause)\n            Yes, tell me in...tel...look:\n            tell me when...GET OUT OF THERE.\n                      (MORE)\n\n                                                            100.\n\n\n                      SCOTT (CONT'D)\n            GET OUT OF THERE RIGHT NOW. TELL\n            ME WHEN YOU SEE ME. MEET ME\n            \"WHERE...WHERE THE GUY MADE THE\n            PHONECALL\" - ONE HALF-HOUR...\n\nScott stops speaking, and looks down at something.\n\nANGLE, his POV. Across the street. We see an unmarked sedan\npull up and two men get out of the car. And begin to look\naround. One sees Scott, and motions to the other one, and\nthey both start in his direction. They stop, for a moment,\nas if confused.\n\nANGLE, their POV. The street corner, empty of Scott.\n\nEXT. BOSTON STREET. DAY.\n\nCopley Square. Scott. Coming into the square.\n\nANGLE, the open-air phone stanchion we saw in the earlier\nsequence. It is festooned, as before, with ads for escort\nservices and phone sex.\n\nANGLE, on Scott, getting, hurriedly, out of a taxi cab, on\nthe outskirts of the square.\n\nANGLE, his POV, scanning the square for Anton. Scott looks\nat his watch, and he looks up.\n\nANGLE HIS POV. The figure of Anton, walking from the far\nside of the square, toward the phone booth.\n\nANGLE, on Anton, as he looks around him, and then proceeds\ntoward the phone booth.\n\nAs Scott watches, a van pulls into the plaza, and heads\ntoward Anton. Anton sees the van, and retreats, toward the\nstreetside, where we see, the van has herded him toward\nanother car. Three men get out of the car, one slugs Anton,\nand he is whisked into the car, and the car pulls away.\n\nANGLE, on Scott, on the far side of the square, looking on,\naghast.\n\nANGLE Anton, in the backseat of the car, pointing back, as\nthe car disappears.\n\nANGLE. CU. Scott, looking at Anton's gesture, and following,\nlooking in the direction in which he was pointing.\n\nANGLE Scott's POV. The telephone kiosk. Scott walks into his\nPOV, to the kiosk. He looks down at the pile of trash on the\nshelf.\n\n                                                         101.\n\n\nHe looks up at the various pornographic ads pasted around\nthe interior. He sees that, stuck in one of them is the\n\"Rogers Rangers\" card, which Anton showed him earlier. He\npulls it out of the ad to which it is stuck. He looks down\nat it inquisitively. We read in an insert: \"Rule #11: Don't\never march home the same way.\n\nTake a different route, so you won't be ambushed.\" He then\nsees that there is something else behind the ad. He tears\nthe ad off the kiosk partition, and he is rewarded, as a\nfolded envelope falls out from behind the ad. He picks up\nthe envelope. We see that it is the old yellowed envelope\nfrom the beach house. It is printed \"Hanson Marine -\nEverything For The Boat\", and we see, on it, the drawing of\nthe old power boat. We see Scott feel the envelope, shake it,\ntear off the end, and pour something out into his hand. We\nsee his face, and then pan down to see the object in the\nenvelope was the red crescent earring seen in all photographs\nof Laura Newton.\n\nEXT. BOATHOUSE, ESSEX. DUSK.\n\nA wind is blowing from the sea. Scott turns up the collar of\nhis jacket. We see the house in the BG and Scott, walking\nalong the patio, the sea beyond him. We see him stop and\nkneel, to the piling, from which he took the matchbook. He\nsifts through the sand and gravel at the foot of the piling.\nThe wind blows up the dust, and Scott stands, it is evident\nhe has got a speck in his eye, and he tries to extract it,\nblinking, and squinting. He turns his head.\n\nANGLE, HIS POV. Beyond the property line. Beyond the hedges\nand on what is obviously the next lot, an old, ramshackle\ndwelling, the small white toolshed.\n\nANGLE, Scott, looking at the toolshed, and gauging its\nproximity to the Essex House. He begins to walk toward it.\n\nANGLE. Scott. At the small white toolshed. He stoops, and we\nsee he has picked up the shell, ejected by Anton's rifle. He\nstands, he takes out a small spotter's scope.\n\nANGLE. HIS POV. His shoulder, rubbing against the pollen-\ncovered window in the small white shed, has uncovered a bit\nof a sign.\n\nANGLE. Scott, looking at the sign in the window. He rubs the\npollen off, and we see emerge, on the inside of the window,\ndrawn in the dust, the Picasso sign %-).\n\nANGLE XCU Scott.\n\n                      SCOTT\n            ...ohmigod...\n\n                                                            102.\n\n\nINT. SLEAZY HOTEL ROOM. NIGHT\n\nScott, wearing just skivvies, is asleep on the bed, an empty\npint bottle of booze on the night stand. We hear the\ntelevision on low, showing talking heads narrating the\nfuneral of Laura Newton.\n\n\"Our Redhead, America's Sweetheart\", et cetera. We see a\nphoto of her in her signature red crescent earrings. Next to\nScott, on the night table, the envelope, holding the same\nred crescent earring.\n\nANGLE, the line of light under the door to the hallway is\noccupied by a pair of feet.\n\nANGLE. A hand, dangling off the bed toward the floor. Below\nit, on the floor, the creased 'Rogers Rangers' card, and\nseveral days worth of newspapers.\n\nANGLE XCU Scott, on the bed. Unshaven. We see his eyes come\nopen.\n\nANGLE on Scott's hand, as it snakes quietly past the Rangers\ncard, on which we read: \"Rule #15: Don't sleep past dawn -\nDawn's when the French and Indians attack\", and comes up\nwith an automatic pistol.\n\nANGLE the door, as we see the door handle move slightly.\n\nANGLE on Scott, as he jerks open the door, his pistol at his\nside.\n\nANGLE HIS POV. In the doorway beyond, we see a Bellboy,\nholding a small paper bag, looking shocked.\n\nScott shoves the Bellboy back away from the door, and\nglances, both ways, down the hall.\n\n                      SCOTT\n            What the hell are you doing?\n\n                      BELLBOY\n                 (showing the package)\n            I...I brought you...\n\n                      SCOTT\n            Why're you screwing with the\n            door...?\n\n                       BELLBOY\n            I...I...\n\nScott drags him into the room.\n\n                                                         103.\n\n\n                      SCOTT\n            Why're you screwing with the\n            door...?\n\nScott frisks him roughly. The terrified Bellboy shows a \"Do\nNot Disturb\" sign, which he holds.\n\n                      BELLBOY\n            I took the...I took the sign\n            off...\n                 (pause)\n            You had the sign on the door.\n            F'they saw me...f'they saw me,\n            knocking on a door, the sign\n            on...they'd...\n                 (Scott relaxes somewhat.\n                 The Bellboy proffers\n                 the package)\n            An, I...I figured, you needed...\n                 (he hands the package\n                 to Scott, who takes\n                 out a pint bottle of booze)\n            You told me you wanted this at\n            Ten...\n\n                      SCOTT\n            ...yeah. Thanks.\n\n                      BELLBOY\n                 (begins to calm down a bit)\n            ...I don't know why you...\n\n                      SCOTT\n            You're right, I'm wrong...I'm wrong.\n\nHe begins to look through his pockets. As the Bellboy stands,\nlooking at the television.\n\nANGLE on Scott, the television beyond him. As he goes\nthrough the pockets of his jeans. He then goes through the\npockets of his jacket, and throws various objects on the bed.\nSome coins, some scraps of paper. A book of matches, some\ncrumpled cigarettes. He hands some bills to the Bellboy.\n\n                      SCOTT\n            There you go, Pal. Hold on...\n\n                       BELLBOY\n                  (pause)\n            Sure. I just...I just wanted to\n            help.\n\n                                                            104.\n\n\nANGLE, on Scott. As he rummages through the pile on the bed.\nThe TV shows photos of Laura Newton, wearing her red\ncrescent earrings.\n\nScott picks up a cigarette and the book of matches on the bed.\n\nPart of the pile shows a tabloid paper - a photo of   Laura,\nan insert of her father weeping at the funeral, and   the\ncaption \"Goodbye, Baby\". He bends down and picks up   the\nRogers Rangers card. And looks at it. He shakes his   head. As\nwe see the Bellboy leave the room. Beat.\n\nINT. DARK, PANELLED CONFESSIONAL. NIGHT.\n\nXCU on Scott, as he thinks for a moment, then speaks.\n\n                      SCOTT\n            It's been...quite a while since\n            my last confession. That...that\n            \"transpired\". On the rear face\n            of a hill, in a mortar attack.\n                 (pause)\n            And I confessed that I was\n            frightened.\n                 (pause)\n            And I have to confess, I'm\n            frightened now.\n                 (pause. He smiles weakly)\n            'Nother \"irregular Confession\".\n\nHe raises a shotglass to his lips, and drinks. He makes a\n\"another one\" gesture. Pause.\n\n                      SCOTT\n            ...I'm about as frightened as\n            I'm comfortable being.\n                 (pause)\n            And that's why...I involved you.\n                 (pause)\n            Which, I suppose, was shameful.\n\nANGLE, as a waiter comes, with a fresh drink. We see that we\nare in a very dark, quiet, smoky, panelled bar. The waiter\nleaves, and reveals, beyond him, Jackie Black, the female\nSergeant we met at the training facility scenes. The waiter\nlooks at her, inquiring silently, if she wants anything. She\nshakes her head.\n\n                                                            105.\n\n\n                      JACKIE BLACK\n            Now: you did me the honor to\n            Call me. Now: you tell me how I\n            might help.\n                 (pause)\n            There in't nobody here, but two\n            people in Green.\n                 (pause)\n\n\nScott, looks around, he takes up a tabloid newspaper, which\nhas been resting on the seat of the booth. We see it is a\n\"funeral\" edition, concerning the death of Laura Newton.\n\nWe see the large, color photo of Laura, her red hair, and,\nin an insert, her father, at the gravesite, hiding his face.\nThe caption reads \"Goodbye, Baby\". Scott leans over, and\nwhispers to Black, his deepest secret.\n\n                      SCOTT\n                 (pointing at the paper)\n            ...this girl's alive...\n\n                      JACKIE BLACK\n            Then, you'd better go get her.\n\nEXT. SANITORIUM. DAY.\n\nScott, shaven, neat, and determined, standing at a bus stop.\nReading a newspaper. Behind him, a large iron fence.\n\nANGLE INS. The newspaper shows \"The Tragic Death of Laura\nNewton\", and photos of the accident. And a photo of a\ndistraught woman in sunglasses, being held up by two friends.\n\nANGLE on Scott. As he looks across the street. Surreptitiously.\n\nANGLE HIS POV. A plainclothes car, with two people in it,\nlooking vaguely in his direction.\n\nANGLE on the bus, as it pulls into the stop. We see various\npeople start onto the bus. At the last moment Scott, at the\nback of the line, sheers away.\n\nANGLE, INT. THE PLAINCLOTHES CAR. The bus pulling away from\nthe bus stop, the chainlink fence beyond it, and, beyond\nthat, a vaguely institutional-looking Colonial building.\n\nINT. SANITORIUM. DAY.\n\nA nurses station, Scott moving through the area, just asking\ndirections of an older woman, obviously a semi-invalid.\n\n                                                            106.\n\n\nANGLE INT. SANITORIUM. The woman is Mrs. Newton. She walks\nwith a companion, she wears sunglasses, and starts out of\nthe sanitorium. As Scott walks up, some yards behind her,\nfollowing her out onto a roofed porch. The woman moves to\nthe far end of the porch, obviously weeping. Scott enters\nthe porch, and stands for a moment. Beat.\n\n                      WOMAN (V.O.)\n            ...terrible thing, grief...\n\nScott turns to her, to see a lovely woman in her late\nfifties, sitting on a lounge chair, a robe over her legs,\nindicating the weeping woman.\n\nScott nods, and takes something from his pocket. He starts\ntoward the weeping woman, but the other woman holds him with\nher voice.\n\n                      WOMAN\n            ...you want to comfort them, but\n            you don't know how.\n                 (pause)\n            I always think it's better to\n            Leave Them Alone...\n\nScott nods his acceptance of her wisdom, and begins to start\ntoward the woman.\n\n                      SCOTT\n                 (of Mrs. Newton, and\n                 the woman, talking to her)\n            A relative?\n\n                       WOMAN\n            A psychic.\n                 (pause)\n\n\n                      SCOTT\n            Well.\n                 (pause)\n            Can we blame her...?\n                 (he gestures, meaning,\n                 we get comfort where\n                 we can find it)\n\n\n                      WOMAN\n            That's right.\n\nScott begins to move toward Mrs. Newton. The woman on the\nlounge chair sits up.\n\n                                                         107.\n\n\n                      WOMAN\n            ...who are you...?\n\n                      SCOTT\n                 (moving off)\n            United States Secret Service.\n\nThe woman moves her blanket to reveal a pistol which she holds.\n\n                      WOMAN\n            Guess again, 'cause I'm the\n            Secret Service, and you follow\n            my directions or I will shoot\n            you dead. Spread your hands to\n            your sides, please...\n                 (Scott spreads his\n                 hands to his sides)\n            Open them...\n\nHe opens his hands to show the red crescent earring. We see\nthe demeanor of the woman in back of him change, as she sees\nthe earring. She comes up to Scott, and he turns around. She\nlooks up, asking, mutely, what it means.\n\nINT. SMALL SANITORIUM ROOM. DAY.\n\n                      DONNY\n                 (sotto, unable to stop\n                 her invective)\n            ...the motherfuckers pulled the\n            Detail off of her...He was in\n            town. Her father was in town,\n            they pulled the Secret Service\n            Detail off her, to take him\n            tomcatting. He's been doing it\n            for years. That's what they do.\n            They turn the Secret Service\n            into a bunch of pimps. He took\n            her protection, she got snatched...\n\n                      SCOTT\n            He'd let her die?\n\nA female Agent knocks at the door and sticks her head in and\nDonny gestures \"rotate\".\n\n                      FEMALE AGENT\n            ...leaving the post...\n\nDonny gestures that she has heard. The Agent leaves and the\ndoor is closed.\n\n                                                         108.\n\n\n                      DONNY\n                 (meaning, \"this is my surmise\")\n            The start of a campaign: Your\n            daughter got kidnapped because\n            you were out getting laid?\n\n                      SCOTT\n            Her father would let her die...?\n\n                      DONNY\n            Who knows if he knows. His\n            'people' would let her die in a\n            heartbeat.\n\n                      SCOTT\n            ...her mother...?\n\n                      DONNY\n                 (pause. She takes up\n                 the earring and she\n                 begins to weep. She\n                 looks beseechingly at Scott)\n            I'm her mother...\n\nShe takes out a small, tattered, cheap earring box.\n\nANGLE INS. We see the empty place for holding two earrings,\nand a small arcade photo of a five-year-old Laura Newton,\nand this woman, Donny, fifteen years younger. They are\nhugging. Scott turns over the photo to read, in a childish\nscrawl, \"Donny, you can keep the box, cause I'll never take\nthem off\". Donny starts to weep.\n\n                      SCOTT\n            I need some money.\n                 (Donny looks up at him questioningly)\n            I'm going to get the girl back.\n\n                      DONNY\n            What can I do?\n\n                      SCOTT\n            I need money. I need a lot of money.\n\n                      DONNY\n                 (of Mrs. Newton)\n            I've been signing her checks for\n            years.\n\n                                                         109.\n\n\n                       SCOTT\n            Alright...\n                 (he scribbles a figure\n                 on a napkin)\n            Can you go this high, that's\n            what I need...\n\n                        DONNY\n                 (as   she looks down at\n                 the   figure on the paper)\n            ...I...I   don't...is there\n            anywhere   else you...\n\nANGLE. Both look to the side.\n\nANGLE, their POV. One of the Secret Service Agents, looking\naskance at Scott. Does a double-take. And begins to raise\nhis cuff mike to his lips to speak.\n\nANGLE, on Donny, as she sees this, and turns around.\n\nANGLE, her POV. The empty room. Scott vanished.\n\nINT. NEW YORK CITY OFFICE BUILDING. DAY.\n\nA very beautiful young woman in a business suit, in an\nelevator. The doors open and Scott, dressed in a suit, gets\nin. He turns to face the front. They ride up in silence.\n\nThe doors open on a mezzanine. There are several men at the\nend of the mezzanine. Scott starts to get out, and the girl\ntries to stop him. He shoves her roughly back into the\nelevator. Several of the men come toward Scott, and a large,\nportly businessman in his forties (AVI) calls them off.\nScott comes forward.\n\n                      AVI\n            Didn't they tell you not to come?\n\n                       SCOTT\n            Well, I guess I wasn't paying\n            attention.\n                 (pause)\n\n\n                       AVI\n            Five years ago they told me you\n            were dead.\n\n                      SCOTT\n            You want to gossip, or you want\n            to do business...?\n\nAvi motions Scott to come with him.\n\n                                                          110.\n\n\nANGLE, Avi's hitters. One starts to take out a phone - Avi\nwaves him to stop - HOLD on the hitters.\n\nANGLE, Avi and Scott, as they sit, near the edge of the\nmezzanine.\n\n                      AVI\n            Bobby; this is an American girl...?\n\n                      SCOTT\n            If that were so?\n\n                      AVI\n            If that were so, why don't your\n            people go and fetch her...?\n\nWhat if I'm speaking for them...?\n\nAvi nods, meaning \"yeah, sure\".\n\n                      AVI\n            ...they send a hitter to\n            negotiate...?\n                 (pause)\n            My question is: have you forgot\n            your catechism...?\n\n                      SCOTT\n            And what's the answer?\n\n                      AVI\n            The answer is Go Home.\n\n                      SCOTT\n            Yeah, that's a good one.\n\n                      AVI\n            ...you're at the Big Table here.\n\n                      SCOTT\n            I know where I am.\n\n                      AVI\n            Well, then, you better talk to\n            me using the Decimal System.\n\n                      SCOTT\n            Your intel. Two men. Infil, exfil,\n            hardware, and com.\n\n                      AVI\n            And com to what? I cannot give you.\n\n                                                         111.\n\n\n                      SCOTT\n            Well, you could, when you where\n            in the Boy Scouts.\n\n                      AVI\n            Yes, but I am not in the Boy\n            Scouts anymore. You heard the\n            private sector?\n\n                      SCOTT\n            Yeah.\n\n                      AVI\n            Well. That's where you found me.\n            And here's what it costs.\n\nHe writes a number on a sheet of paper.\n\n                      SCOTT\n                 (looks at the paper)\n            ...you're out of your mind.\n\n                      AVI\n            No, you're out of your fucking\n            mind, and you're out of your\n            league, and my advice to\n            you:...before some mercantile\n            soul shops you.\n                 (pause. In disgust, he\n                 picks up the paper,\n                 crosses out what we\n                 wrote, and puts in a\n                 new number)\n            ...for this job, that's what it\n            costs...\n\n                      SCOTT\n            ...that's what it costs...?\n\n                      AVI\n            That's what it costs you.\n                 (pause)\n            Go home, Bobby.\n\nEXT. PALATIAL ESTATE. DAY.\n\nWe see a woman getting into a Range Rover, in the vast\ngravel drive outside of an estate.\n\nA man comes out of the house, with a cup of coffee, hurrying\nout to kiss his wife goodbye. He does so. She drives off.\n\n                                                           112.\n\n\nHe finishes the cup of coffee, puts it down outside his door,\ncloses the door, and looks quickly at his watch, and hurries\nto his Jaguar, which he puts in gear, and it starts down the\ndrive.\n\nWe see it is the Businessman from the whorehouse.\n\nANGLE on another car, coming down the drive, which smashes\ninto the Jaguar.\n\nANGLE on Scott, who gets hurriedly out of the car. He goes\nout to the Jag, and drags the stunned man from his car, and\ntoward the house.\n\nANGLE INT. A SUMPTUOUS STUDY, PALATIAL ESTATE. DAY.\nBeautiful Greek and Roman artifacts line the walls, on\nlighted shelves. Scott drags the stunned and abraided\nBusinessman into the study. Scott throws him into a chair.\n\n                      SCOTT\n            Remember me...?\n\nANGLE Scott, as he takes out the Businessman's card, and\nlooks at it.\n\n                      SCOTT\n            ...well, I guess you do have\n            friends in High Places...I mean\n            here you are home, n'all...\n                 (he picks up now one,\n                 now another piece of\n                 exquisite statuary,\n                 and smashes it to the ground)\n            And now we're gonna see if you\n            also got all that money that you\n            spoke of.\n                 (he takes out a\n                 videotape box)\n            This here's a Short Subject, if\n            you know what I mean. Of you in\n            Carnal Congress with an Underage\n            Girl. A PROSTITUE, A MINOR, AND\n            SOMEBODY'S DAUGHTER...\n                 (he holds up another videotape)\n            There's another...you know how\n            cheap it is to make a copy...?\n\n                      BUSINESSMAN\n            ...what do you want?\n\n                      SCOTT\n            I want what you promised me...\n\n                                                         113.\n\n\n                      BUSINESSMAN\n                 (as if reluctant to\n                 impart the information)\n            ...I've, I've already made a\n            deal with...\n\n                      SCOTT\n            Yeah, but you haven't made a\n            deal with me...So, today is Your\n            Lucky Day, cause you get to Do,\n            what Most Men only Dream of: You\n            get to make Another Human Being\n            Happy.\n\nHe brings over a telephone, and gives it to the Businessman.\nScott finds himself behind a large desk.\n\nHe looks down at photos of the smiling Businessman, in\nvarious poses, with two young girls, obviously his daughters.\n\n                      SCOTT\n                 (softly)\n            You had your fun, now pay for it,\n            Jim. Get your bank on the phone.\n            We're going to transfer some money.\n\nThe Businessman pauses, then picks up the phone.\n\n                      SCOTT\n                 (to himself)\n            ...\"how about that\".\n\n                      BUSINESSMAN\n            ...do you know how much trouble\n            you're in...?\n\n                      SCOTT\n            Yes. And that's the difference\n            between you and me.\n\nEXT. WAREHOUSE DISTRICT STREET. DAY.\n\nScott, getting out of his car, rounds a corner. We see a car\ncoming down this street, rather quickly. Scott retreats into\na doorway.\n\nANGLE, HIS POV. The car blinks its lights three times.\n\nANGLE EXT. THE STREET. We see the car slow almost to a stop,\nScott emerges from his doorway. As the car's rear door is\nopened, Scott gets in.\n\n                                                 114.\n\n\nINT. WAREHOUSE OFFICE. DAY.\n\nAvi and Scott, at a small table.\n\n                       AVI\n            Maskala is a suburban villa, in\n            Dubai. The Friends of your Friend,\n                 (he gestures at a photo\n                 of Assani)\n            Operate there, if you will, a\n            \"halfway house\". For the young\n            women they have induced, coerced\n            or drugged into spending their\n            short lives. As the whores of\n            Arabian tourists. Of late the\n            girls have been, in the main,\n            from the former Sov-Bloc. Now\n            and again, a North American Girl,\n            if she is exceedingly\n            lovely,...blonde, usually\n            blonde...\n                 (he passes the photos\n                 of very beautiful young\n                 girls across the table,\n                 to Scott)\n            Will, unfortunately, find her\n            way to Dubai. They travel drugged,\n            they are -\n                 (he searches for the word)\n            - \"tidied up\", and sold. For\n            some reason, most of them are\n            sold to Yemen.\n                 (pause)\n            The girls are generally held, in\n            Dubai, until the end of the month.\n                 (he checks his watch\n                 and looks significantly\n                 at it)\n            When the Merrymakers fly in to\n            examine them. And take their\n            purchases home.\n\n                      SCOTT\n            ...and then?\n\n                       AVI\n                  (shrugs)\n            That is \"and then\".\n                  (pause)\n            This is a floor plan of the\n            building where the girls are\n            held, this is the security\n            arrangements, this is the watch\n            plan.\n                       (MORE)\n\n                                                         115.\n\n\n                      AVI (CONT'D)\n                 (he checks his watch\n                 and raises his eyebrows)\n            The girls are taken from the\n            house in Maskala, to the Royale\n            Hotel, I presume you will hit\n            them in transit...?\n\nScott opens another envelope which Avi has passed him. As he\nlooks at the documents he pours out.\n\n                      SCOTT\n                 (reads)\n            ...\"Jameson Construction\"...They\n            know we're there...?\n\n                      AVI\n            I hope not.\n                 (he shows documents to Scott)\n            The conex container for the exfil,\n            also Jameson Construction.\n                 (he gestures at the\n                 materials on the table)\n            A passport for the Young Girl...\n                 (he shrugs)\n            Between fifteen and twenty-five,\n            they all look alike.\n\n                      SCOTT\n                 (as he looks at the passport)\n            Is that your experience...?\n\n                      AVI\n            Yes. It is. Nonetheless, we tried\n            to match it to a Current Photo...\n\nANGLE, on Scott, as he looks, questioningly at Avi. Avi\ntakes a photo from his desk and passes it to Scott. It shows,\nthrough a long lens, blurry and grainy, a photo of what is\nobviously the platinum-haired Laura Newton, sitting on a bed,\nin a barred room.\n\n                      AVI\n            ...she was there twelve hours ago.\n\n                      SCOTT\n            Who took the photo?\n\n                      AVI\n                 (shrugs)\n            How would I know...?\n                 (pause)\n\n                                                          116.\n\n\n                      SCOTT\n            What does the bonus cost?\n\n                       AVI\n                 (shrugs)\n            A gesture of Friendship. But. We\n            thought: if you see some of the\n            Yemenins -\n                 (he shows Scott candid\n                 photos of several\n                 middle-aged, bearded\n                 middle-eastern looking men)\n            Any of these, in\n            particular...would you say Hello\n            to them?\n\nScott scoops up the documents, and stands.\n\n                      SCOTT\n            Who else have you done a favor\n            for, Avi?\n\nAvi shakes his head, and wags his finger, as if to say, \"No,\nin all sincerity...\"\n\n                      AVI\n            Bobby: the world runs on manners.\n\nBeat. Scott takes an envelope, and hands it to Avi, who\nopens it. He opens his mouth to speak.\n\n                      SCOTT\n            The last third on exfil, in\n            Geneva. Me and the Girl. As agreed.\n\n                      AVI\n            That's not what I was going to say.\n\n                      SCOTT\n            What were you going to say...?\n                 (pause)\n            ...the Last Third in Geneva...\n                 (he exits)\n\n\nEXT. ROOFTOP, DUBAI. DUSK.\n\nScott, on a rooftop, behind a raised elevator housing. Scott\ntakes out a pair of binoculars, and Scott leans around the\nelevator housing.\n\nANGLE HIS POV. Across the way, the window, and the ornate\nscrollwork bars, in which we, earlier, saw the photo takes\non Laura Newton.\n\n                                                            117.\n\n\nANGLE on Scott, as he comes back behind cover, and nods to\nhimself, picking up his yellow bag.\n\nANGLE EXT. DUBAI STREET. Scott, walking down the street,\nbeyond him a building with an ornate scrollwork barred gate\nover its courtyard door. In the courtyard beyond, two\nMercedes 600's.\n\nAs Scott walks past the trelliswork it begins to open. A\ndelivery truck is ushered through the gate, by an armed\nguard. Scott stops, to let the truck pass.\n\nANGLE HIS POV. As he turns his head to the side.\n\nANGLE HIS POV. Walking from one outbuilding, across the\ncourtyard, beyond the gate, accompanied by a minder, is\nLaura Newton. She is obviously drugged, disoriented, and is\nheld up by the guard. He gets into a conversation with a\nwoman, dressed as a matron, who comes out of the building\nthey have just vacated. And she stands, for an instant,\nuntended.\n\nANGLE on Scott, the gate open, as the gate guard ushers\nthrough the delivery van, and Laura Newton stands several\nyards away.\n\nANGLE XCU, Laura Newton, as she looks in his direction, and\nher eyes begin to focus, as if trying to make sense of what\nshe is seeing.\n\nANGLE, her minder, who reacts to a change in her attitude,\nand looks at her, and, then, follows the direction of her\ngaze to the gate.\n\nANGLE HIS POV. The delivery truck coming through the gate,\nas the gate closes behind it. The street beyond it, empty.\n\nANGLE INT. THE COURTYARD. As the delivery truck pulls in,\nand Laura, escorted by her guard, is taken back into the\nmain house. She turns to look back, groggily, wonderingly,\nat the street, and is pushed into the door. As she does so,\nwe see the delivery truck pull up to the spot she just\nvacated, and the delivery man gets out and opens a rear door,\non which we see scrawled, in the dirt, the \"Picasso\" symbol.\n\nANGLE EXT. DUBAI STREET CORNER. Scott turns the corner, and\ngets into a car, driven by Jones, which comes to the curb.\n\nANGLE INT. THE CAR. In the backseat, Scott, another man\nsitting next to him, SMITH, dressed as a construction worker.\nThe man starts to speak. And Scott shushes him, takes out a\nnotebook and a pencil, and begins to make notes.\n\n                                                         118.\n\n\nEXT. CAR, DUBAI. NIGHT.\n\nA deserted streetcorner. Various shuttered posh shops. Scott\nwalking across the street.\n\nANGLE CU on Scott, as he paces, as he walks.\n\n                      SCOTT\n            ...fourteen, fifteen, sixteen.\n\nThe camera takes him to the middle of the street. A right-\nhand turn, a tight corner. He looks to his left.\n\nANGLE HIS POV. Beyond him, we see, several streets off, the\nsign of the \"Royale\" hotel.\n\nScott beckons, and the man, Smith, comes out of the shadows.\nHe and Scott walk to a small passageway, at the corner.\n\nCamera takes them through the passageway, where we see Jones,\nstanding by his car, in an alley.\n\n                       SCOTT\n            It's good.\n                 (to Jones)\n            It's very good.\n                 (Jones nods his thanks)\n            The charge takes the car out...\n                 (to Smith)\n            We got the flashbangs fore and\n            aft, You hit the driver, follow\n            down the driver's side, the car\n            ain't going nowhere, the muscle\n            gets out, I cap em, I go with\n            the girl.\n                 (he points to Jones.\n                 He points to the car.\n                 Jones nods. To Smith)\n            You exfil on your own, we're on\n            to the airport.\n\nANGLE, tight on Scott, and Jones.\n\n                       SCOTT\n            At the airport. When we hit the\n            Conex. When you Seal Us In...you\n            walk away.\n\n                      JONES\n            I understand.\n\n                                                            119.\n\n\n                      SCOTT\n            I cannot have heat on it. Now: I\n            know: that you want to protect\n            the package. But: you have to\n            walk away. And que sera, sera.\n\n                      JONES\n            I won't look back.\n\nINT. WAREHOUSE ROOM. NIGHT.\n\nScott, at a desk, looking over his plans. A photo of Laura\nNewton on his desk. Beyond him Smith and Jones are cleaning\nand assembling weapons. Scott takes out his switchblade and\nbegins to hone it. Scott looks into the mechanism of the\nknife. Peers intently, turns it over and raps it on the\ntable. We see a small seed fall out. Smith turns to the\nsound, and looks inquisitively at Scott.\n\n                      SCOTT\n                 (as he picks the seed\n                 up, answering Smith's\n                 unspoken question)\n            ...it's an appleseed.\n\nSmith nods as if to say,\"If you say so\".\n\nScott reaches over to a box of Q-Tips, which sits on the\ntable along with other cleansing paraphernalia, and dips one\nin the solvent bottle, and begins to clean the interior of\nhis switchblade.\n\nANGLE XCU on Scott, as he cleans the interior of his knife.\nHis face freezes...Scott leans over, and gestures at a\ntweezers as part of Smith's cleaning kit. Smith nods \"okay\".\n\nANGLE INSERT. The interior of the knife. A small, wafer thin\nelectronic device adhering to the interior.\n\nANGLE on Scott. As he turns his back on the group. We see,\nin an insert. He holds the electronic device up for scrutiny,\nin the tweezers. He walks toward the windows of the warehouse.\n\n                      SMITH\n                 (as he cleans his\n                 firearms, generally,\n                 as if speaking of the universe)\n            \"Johnny Appleseed\", eh?\n\n                      SCOTT\n            ...yeah, I'm just a Man of Peace...\n\nWe hear a car driving up, outside the warehouse. He looks\nout of the window.\n\n                                                            120.\n\n\nANGLE, HIS POV. Just seen, the nose of a small SUV, around\nthe corner, three men, getting out of the car.\n\nANGLE INT. WAREHOUSE DAY. Scott walks into a corridor of the\nwarehouse. He looks down an industrial staircase, and sees\nthe door at the bottom begin to open, stealthily.\n\nANGLE, camera takes Scott to a small, filthy bathroom. He\nopens the door.\n\nANGLE, at the bottom of the stairs, Stoddard, with two\nhenchmen, heavily armed, look up.\n\nANGLE THEIR POV. Scott walking into the bathroom.\n\nANGLE, a floor of the warehouse. Stoddard, and his\naccomplices, coming up the stairs to the floor, which holds\nScott. There are several closed doors. One of the men\nconsults a small hand-held 'GPS' unit, and points at one of\nthe doors. The men take up position around this door.\nStoddard nods, and they open fire through the door.\n\nANGLE, INT. THE BATHROOM. The men kick down the door, to\nfind the small cubicle-like room empty. One of them looks\naround, and sees, and removes the small wafer-thin electronic\ndevice from the top of the cistern. He shows it to Stoddard,\nwho throws it down in disgust. As he, followed by his men,\nexit the room.\n\nANGLE EXT. DUBAI STREET. NIGHT. We see the small SUV parked\naround the corner from the warehouse, a black clad driver,\nsitting in the car, watching the warehouse.\n\nThe door is wrenched open, and we see Scott, the small\nyellow duffle over his shoulder, drag the driver from the\ncar, and clout him to the ground. Scott gets into the car,\nwhich begins to drive off.\n\nINT. \"MASKALA HOUSE\" (THE HOUSE WITH THE ORNATE SCROLLWORK).\nDUBAI. NIGHT.\n\nANGLE, Laura Newton, drugged, listless, sitting on the bed\nin the small room. We hear a large explosion, and Laura gets\nup, and moves toward the door of her room. She hears another\nexplosion, and shouts coming from outside her door. She is\nreaching for the handle of the door, when the door opens,\nand one of her Bodyguards opens the door, and addresses her.\n\n                      BODYGUARD\n            ...stay in your room, and...\n\nHe turns as another explosion is heard, coming from the\ninterior of the house. As he turns we hear glass breaking,\nand see Scott entering through the window behind Laura.\n\n                                                             121.\n\n\nThe Bodyguard turns, and Scott raises a silenced    pistol, and\nshoots the Bodyguard twice. The Bodyguard falls,    Scott moves\nto him, and drags him inside the room. He raises    his pistol\ngesturing \"shush\" to Laura, and moves her toward    the window.\n\n                         LAURA\n            ...who...?\n\nHe uses the rope outside   the   window to improvise a sling,\nfor Laura, and drapes it   over   her head, and under her arms.\nScott picks her up, and   holds   her for a moment. She starts\nto speak. And he answers   her   question.\n\n                      SCOTT\n            Stay by me.\n\nHe hesitates for a moment. We hear another explosion, he\nnods, as if to say \"That's what we're waiting for\", and\npasses her out of the window, and begins lowering her to the\nground.\n\nANGLE EXT. THE BUILDING. Laura, on the rope, reaching the\nground.\n\nANGLE INT. THE ROOM. Scott, as he turns to the sound of the\ndoor opening, two men come through the door, and he shoots them.\n\nANGLE EXT. THE BUILDING. Scott puts Laura into the SUV and\ngets behind the driver's seat. He puts the car in gear, and\nit begins to drive off.\n\nANGLE INT. THE CAR. Laura turns to face him.\n\n                      LAURA\n            ...they said they were going to\n            take care of me...\n\n                      SCOTT\n            I'm going to take care of you.\n            You hold on, now.\n                 (as Scott drives he\n                 reloads his weapons)\n\n\n                      LAURA\n                 (lazily)\n            Who are you?\n\n                      SCOTT\n            ...you remember, Baby, we went\n            to high school together...\n                 (pause)\n            You dropped your earring.\n\n                                                            122.\n\n\nShe shakes her head. Drugged. Trying to make sense of the\nproceedings.\n\n                      SCOTT\n            You're Picasso, right...? That's\n            who you are...\n\nHe draws the Picasso sign on the windshield, she looks at it,\nhaving trouble focusing.\n\n                      LAURA\n            ...they're going to send me to a\n            Party.\n\n                       SCOTT\n            No, Baby, you're going Home.\n                  (pause)\n            You're just taking the long way\n            home.\n\nANGLE EXT. THE CAR. Moving through the streets. The airport\njust becoming visible in the background.\n\nINT. BARE ROOM. DUBAI. NIGHT.\n\nLaura, asleep, at a small cardtable. Out of the window we\nsee an expanse of desert and scrub. Her head is down. Scott\nenters the room, he moves a chair in front of the door,\nmoves to Laura, and manhandles her to a small cot, and\ncloses the shutters to the window.\n\n                      SCOTT\n            ...I told you to stay on the bed.\n\nWe see her wake and look around, trying to place herself.\n\nANGLE on Scott, as he takes out a notebook and begins to\nmake notes in it.\n\n                      SCOTT\n            ...you're going travelling.\n\n                      LAURA\n            ...what...?\n\n                      SCOTT\n            ...we're going to take a little\n            trip.\n\nShe takes out a crumpled pack of cigarettes, and extracts\nthe last one. She takes out a match.\n\n                      SCOTT\n            ...put that away.\n\n                                                            123.\n\n\n                      LAURA\n            ...I need a smoke.\n\n                      SCOTT\n            Y'can't smoke it. American\n            tobacco. Smell. Carry. In the\n            desert air.\n\nHe looks down his list, and nods. He takes a bandana from\nhis pocket and hands it to her.\n\n                      SCOTT\n            Put that on. Over your head.\n\n                      LAURA\n            Whatsamatter, you don't like\n            Blondes...?\n\n                      SCOTT\n            Whole world likes Blondes. That's\n            why you're here. Put the bandana on.\n\n                      LAURA\n                 (as she tries to light\n                 the cigarette)\n            I need a smoke.\n                 (He takes it away from\n                 her, and crumbles it.)\n            ...gimme the fucken smoke.\n\nHe shushes her, and moves to the window.\n\nANGLE, EXT. The window. The first gleam of dawn. And, far\noff, a Muezzin is heard chanting morning prayers. Laura\nmoves toward him, unbuttoning her blouse.\n\n                      LAURA\n            I could make you give me the smoke.\n\nHe slaps her lightly in the face.\n\n                      SCOTT\n            Keep it together.\n                 (he takes a small\n                 hypodermic kit)\n            Keep it together, or I'm gonna\n            give you a shot and carry you out.\n\nShe reacts violently to the sight of the needle. Beat. Then,\nshe sits on the bed and cries self-pityingly.\n\n                      LAURA\n            Nobody Cares about me...\n\n                                                         124.\n\n\nHold. On Scott. And we take him back to a small shelf near\nthe door. He takes down what we see is an ashtray, overfull\nwith yellow-brown cigarette butts. He takes the ashtray to\nthe small table, takes out his knife, and begins shredding\nthe butts, and gathering the tobacco into a pile.\n\n                       SCOTT\n             ...that's right...\n\n                       LAURA\n             ...I'm just a whore...They\n             wouldn't even come get me...\n\n                       SCOTT\n             They sent me...\n\nScott looks at the pile of tobacco. He extracts the \"Rogers\nRangers\" card from his pocket and looks at it. We read, in\nan insert: \"Rule #13: Every night, you'll be told where to\nMeet, if Surrounded by Superior Force\".\n\nANGLE, on Scott, as he very precisely peels the card into\ntwo thin halves, and rolls one of the halves into a\ncigarette, using the reclaimed tobacco from the ashtray. He\ntakes the cigarette to Laura. As a peace offering. She takes\nit. Beat.\n\n                       LAURA\n             Did my father send you?\n\n                       SCOTT\n                  (as he lights her cigarette)\n             ...that's right.\n\n                       LAURA\n                  (derisively)\n             One man.\n\n                        SCOTT\n             One riot, one Ranger, you ever\n             hear that?\n\nANGLE, on Scott, as he hears a car outside the window. He\ndraws a pistol and moves to the window, and looks down. He\ngestures Laura to be quiet.\n\nANGLE EXT. The window. In the small, deserted street. A car\npulls up. A man gets out, and looks around. Beat. Another\nman, and a woman, and two small children come out of the low\nhouse and get into the car, which drives away.\n\n                                                           125.\n\n\n                      LAURA\n            Leonides, the King of Sparta,\n            when a neighboring state would\n            beg for Military Aid. Would send\n            One Man.\n\n                      SCOTT\n            ...well, there you go.\n\n                      LAURA\n            ...you ever hear that?\n\n                      SCOTT\n            No. I think we went to different\n            schools.\n\nHe looks at her. Beat. She hands him the cigarette. And he\ntakes a drag, and passes it back. He checks his watch.\n\n                      SCOTT\n            ...put the bandana on.\n\n                       LAURA\n                 (softly)\n            Did you hear the one about the\n            king who turned his daughter\n            into Gold?\n\n                      SCOTT\n            Yeah - I heard that one.\n\nBeat. She turns away, and cries.\n\n                      LAURA\n            ...I don't want to go home.\n\n                      SCOTT\n            I didn't ask you.\n\nEXT. DUBAI AIRPORT. DAY.\n\nA long view of the airport.\n\nANGLE, a small delivery van we saw earlier. Parked in an\nindustrial area.\n\nANGLE INT THE VAN. Laura, dozing in the passengers seat.\nScott, sitting in the driver's seat, alert, watching.\n\nANGLE HIS POV. Seen beyond the corner of an industrial\nbuilding, beyond a chainlink fence, the airport.\n\nANGLE INT. THE CAR. Laura wakes with a start, and looks around.\n\n                                                           126.\n\n\n                      LAURA\n            I don't know where we are...\n\n                      SCOTT\n            You just keep it together.\n\nANGLE Scott as he looks up to the sound of a plane.\n\nANGLE HIS POV. Directly over their heads, a small bizjet, on\nfinal, about to touch down.\n\nANGLE, the chainlink fence. Scott and Laura at the fence\nprotecting the airport. Scott moves aside the pre-cut\nsection of fence, and gestures him through.\n\nANGLE, inside the fence. Laura and Scott moving to the\nprotection of a small hangar.\n\nANGLE, beyond them, we see the bizjet come to a halt, on the\ntarmac, and turn. We see blazoned, on its side, \"Global News\".\n\nANGLE, on Scott and Laura, now inside the small hangar.\nScott moves to a small locker and extracts a set of\ncoveralls, and a cap, and takes them to Laura.\n\n                      SCOTT\n                 (of the coveralls)\n            You put this on.\n\n                      LAURA\n                 (groggily)\n            ...what...?\n\n                      SCOTT\n            You...\n\nA pause. He turns to the sound of a car.\n\nANGLE HIS POV. A car, on the tarmac. It comes to a stop by a\nprivate plane. Beyond this private plane, we see the \"Global\nNews\" bizjet, being directed to a stop.\n\nANGLE, on Scott, as he watches the tarmac.\n\nANGLE HIS POV. Stoddard and several of his men, get out of\nthe car which has stopped by the private plane. A man in\nfatigues emerges from the plane, and hands Stoddard a piece\nof paper. Stoddard begins giving this man directions.\n\nANGLE INT. THE CARGO HANGAR. Scott and Laura, who now has on\nthe mechanics coveralls.\n\n                                                         127.\n\n\nANGLE Scott, as he looks out of the hangar door. To his\nright, the plane with Stoddard and his men, to his left, the\n\"Global News\" bizjet, its hatchway staircase, just descending.\n\nANGLE on Scott, as he looks at his watch. He turns to Laura.\n\n                      SCOTT\n            A little walk-in-the-park.\n                 (he points her to the\n                 News jet)\n            See there...?\n\nANGLE EXT. THE NEWS BIZJET. Where a man in a safari jacket,\nand a woman emerge from the plane, and glare at the sun. We\nsee this man consult his watch.\n\nANGLE, on Scott and Laura, as he walks her out of the hangar,\nand towards the news bizjet. In the B.G. We see Stoddard,\nand his men, at their plane. Another car pulls up to\nStoddard, disgorging a man, who goes to conference with\nStoddard.\n\nANGLE, these two men.\n\n                      SECOND MAN\n                 (giving his report)\n            ...all of the passenger terminals,\n            and all access-points to the\n            Cargo and General Aviation...\n\n                      LAURA\n                 (groggily, as in a dream)\n            No, you know what my mistake was...?\n\n                      SCOTT\n                 (as he looks around)\n            ...what was that...?\n\nHe stops and picks up a pair of \"paddles\" from their\nposition, leaning against the nose wheel of a plane. They\nwalk on. In the BG we see Stoddard and his crew, searching.\n\n                      SCOTT\n            ...what was your mistake...?\n\n                      LAURA\n                 (from a distance, as\n                 she begins to laugh,\n                 as at a great private\n                 joke; she stops walking)\n            ...you think we bring our\n            troubles on ourselves...?\n\n                                                            128.\n\n\n                      SCOTT\n            I'm certain of it.\n\nShe starts laughing, getting hysterical.\n\n                      SCOTT\n            No, no...come on baby...come on,\n            come on girl: just walk to the\n            plane: Just Get On the\n            Plane...WALK TO THE PLANE...\n\nShe starts to break free and Scott manoeuvres her into a\nsmall hangar area. She is struggling mightily. Scott has his\nhand over her mouth.\n\nANGLE. We see their feet moving through a pool of oil on the\nconcrete floor - we see she loses her footing. We see Scott\ntighten his grip on her, and is furiously trying to calm her.\n\n                       SCOTT\n            Shussh, baby... shussh...\n            shussh... it's going to be\n            alright...\n\nWe see him work a small hypodermic kit from the pocket of\nhis jacket. We see Laura see it, and her eyes grow wide.\n\n                      SCOTT\n            This's going to make Everything\n            Allright...\n\nLaura reacts to the hypodermic, which Scott is bringing\ntoward her. And screams.\n\n                        LAURA\n            No!\n\nEXT. THE HANGAR AREA.\n\nWe see Stoddard, and his men, about to get into their Jeep,\nstop, and turn at the sound.\n\nANGLE INT. The Hangar Area. Signs all over marked in Arabic\nand English - \"Petrol - No Smoking!!\"\n\nAs Scott lunges after Laura, the door, behind her bursts\nopen, and Stoddard and an accomplice enter, placing Laura,\nin the midst of the hangar, between Stoddard and Scott. Who\nstands in front of a large tanker labelled \"Aviation Gasoline\".\n\n                                                            129.\n\n\n                      STODDARD\n            Leave her Alone.\n                 (to his men)\n            Don't shoot him, don't shoot,\n            you'll blow the thing sky high...\n\n                         SCOTT\n            Laura...\n\n                      STODDARD\n            Thank God we Found you. You know\n            me. I work for Mister Burch.\n            I've met you...\n\nANGLE on Laura, standing between the two men. She is\ncompletely confused. She looks from one to another.\n\n                      LAURA\n                 (drugged and groggy)\n            He said that he came to get me...\n                 (she shakes her head\n                 in disbelief. Then she\n                 starts to walk a step\n                 toward Scott, then\n                 turns, and proceeds\n                 toward Stoddard.)\n\n\n                      STODDARD\n            That's right, Laura...Walk away\n            from him. Walk to the Plane...He\n            can't hurt you now. Walk to the\n            plane...\n\nHe points at his bizjet, outside, on the tarmac. Laura walks,\nunsteadily, in the direction pointed, and we see a female\nattendant, in a vaguely military getup, get out of the plane,\nand begin to walk toward Laura.\n\n                         SCOTT\n                    (screams)\n            No...\n\nHe starts toward Laura. And Stoddard and his two men\ninterpose themselves between Scott and Laura, who is\napproaching the plane. Stoddard's two men approach Scott.\nOne draws a knife.\n\nANGLE on Scott, who hangs his head, wearily. He looks down\nat his empty hands.\n\nANGLE on the man with the knife, approaching him.\n\n                                                           130.\n\n\nANGLE on Scott, straightening himself, as if submitting to\nthe inevitable, as the man with the knife draws closer. He\nmakes a thrust, and covers. Scott steps toward him and spits\nat him, full in the face. The man with the knife recoils for\na moment, and Scott disarms him, throws him viciously to the\nconcrete floor, and stomps on him. Scott bends to pick up\nthe knife the man has dropped, and turns to face the other\nman. As he does so, he slips on what we see is a large pool\nof oil on the floor. He goes down heavily. And the second\nman steps into him as he falls, drawing his pistol.\n\n                      STODDARD\n            DON'T SHOOT, DON'T SHOOT, DON'T\n            SHOOT HIM IN HERE...\n\nThe man uses the pistol to cuff Scott, who is attempting to\nrise to his knees, behind the ear. Scott falls.\n\n                      STODDARD\n            Cuff 'im...\n\nThe man handcuffs Scott behind his back.\n\nANGLE on Scott shaking his head to clear it, as he now\nstruggles to his knees.\n\nANGLE, his POV. Laura Newton, walking toward the bizjet.\n\n                      STODDARD\n                 (to Scott)\n            Yes...well...\n\n                      SCOTT\n            Let the girl go home.\n                 (pause)\n\n\n                      STODDARD\n                 (to his henchmen)\n            ...wait till she lifts off, take\n            him outside and shoot him.\n\n                      SCOTT\n                 (as he speaks he moves,\n                 slightly, continuously,\n                 to get a better view\n                 of the girl)\n            ...why can't the Girl Go Home?\n\n                      STODDARD (CU)\n            Because she's dead.\n                 (pause)\n            You had to know the Secret\n            Knowledge. Didn't you?\n\n                                                         131.\n\n\n                      SCOTT\n            What is the Secret Knowledge?\n\n                      STODDARD\n            The Secret Knowledge is: There\n            Is No Secret Knowledge.\n                 (turns over his\n                 shoulder, to look at\n                 Laura, walking toward\n                 the plane)\n            You went Beyond What Was\n            Permitted. And the Gods Are Angry.\n\nANGLE. On the tarmac. Laura, walking toward the plane, the\npetroleum storage hangar behind her. We see a vaguely\nmilitary uniformed woman fall into step beside her and take\nher arm. Laura looks at her. We see Laura full face, and\njust the shoulder of the woman escorting her. Beyond them we\nhear the engine of the bizjet start up.\n\n                      LAURA\n            ...I'm so tired.\n\n                      WOMAN\n            ...I'm going to ask you to do\n            Just the One More Thing...\n\nLaura looks at her questioningly.\n\n                      WOMAN\n            I'm going to ask you, now, to\n            walk away from this plane, and\n            come with me.\n\nANGLE, to show that the stewardess, who descended from the\nbizjet (the vaguely military clad young woman we saw earlier)\nis still on station outside of the bizjet, and that the\nwoman who is walking and talking with Laura is Jackie Black,\nthe young female sergeant we met earlier. Laura looks at her\nuncomprehendingly. Laura begins shaking her head pathetically,\nand protesting, drawing away from Jackie Black.\n\n                      LAURA\n            No...leave me alone. No - I don't\n            know you...\n\nANGLE, INT. The Petroleum Hangar. Day.\n\n                                                            132.\n\n\n                      STODDARD\n                 (to his men, as he,\n                 Stoddard, casts a\n                 glance outside, and\n                 then back)\n            Alright, take him outside...\n                 (the henchman hoists\n                 Scott to his feet)\n\n\nANGLE, on Laura and Jackie Black. Standing immobile. Laura\nlooks down at something. She then looks up, her face transfixed.\n\nANGLE, on Jackie Black's hands, she holds the cheap jewelry\nbox we saw earlier, and, in it. The photo of Laura and Donny,\nand the legend: \"Donny you can keep this box, cause I will\nnever take them off.\"\n\nANGLE XCU, on Laura, as she looks at Jackie, who now moves\nLaura away from the bizjet, and towards the assemblage of\nnewspeople, who are on the tarmac, around the \"global news\" jet.\n\nANGLE, EXT. The Global News Jet. A female reporter,\ngossiping, with some of her crew, looks over in the\ndirection of Laura and Jackie, and does a double-take.\n\n                      FEMALE REPORTER\n            Oh, my God...\n\nANGLE, on Stoddard, his man, and Scott. As they leave the\nhangar. Stoddard looks around.\n\nANGLE, his POV. Inside the hangar, the fallen man, that\nScott has killed. Stoddard goes back inside, to drag this\nman away. He looks up. And, as he does so, he sees Laura,\nwalking with Jackie Black, toward the Global News Plane.\n\n                      STODDARD\n                 (yells)\n            Wait...!\n\nANGLE, on Jackie Black and Laura, walking toward the plane,\nwhere we see the crew hurriedly setting up a camera.\n\nANGLE, on Stoddard, as he draws his pistol, and fires toward\nLaura and Jackie. We see Jackie move to shield Laura, and\nthen, struck by a bullet, she goes down.\n\n                      JACKIE BLACK\n                 (to Laura)\n            Keep walking...\n\nANGLE, on Scott, in the grip of Stoddard's henchman.\n\n                                                         133.\n\n\n                      HENCHMAN\n                 (to Stoddard)\n            ...do you want me to...?\n\nIn the moment he is distracted. Scott breaks the man's grip,\nand his arm. He knees the man, and kicks him to the ground.\n\nANGLE, INT. The Global Jet. The news crew reacts to the shot.\nBeyond them we see Jackie, fallen to the tarmac, and Laura,\nis walking toward the newspeople.\n\n                      FEMALE REPORTER\n            Gimme an uplink Gimme an uplink...\n            GET IT ON THE SAT. Now Now Now...\n\nInside the jet we see various monitors, and one switches\nfrom an innocuous travelogue, to the scene at the airport,\nand the caption \"Live\". We see the shot is taken from inside\nthe plane. We see Laura stumbling toward the bizjet, and see\nthe female reporter run out of the plane, and move her to\nsafety inside the cabin.\n\n                      FEMALE REPORTER\n                 (to the unseen cameraman)\n            On her. On her, get it on the\n            girl...Get us Out of Here...\n\nThe camera shifts to the image of Laura Newton, going out\nlive. Behind her we hear the crew shooting commands, and see\nthe door to the Global jet close, as the jet begins to taxi.\n\nANGLE, INT. The Petroleum Hangar. We see Stoddard, reloading\nhis pistol. In the BG we see Scott step through his\nhandcuffs, that is, bring them in front of his body. He\ntakes a pistol from the henchman, who is writing on the\nfloor. He raises the pistol and shoots the henchman. He\nturns on Stoddard.\n\n                      SCOTT\n            The girl ain't dead, baby, you're\n            dead. You see: that's the\n            difference.\n\nHe walks toward Stoddard,who is fumbling, trying to reload\nhis pistol.\n\n                      STODDARD\n            WAIT: WAIT. The girl's home. You\n            brought her home. Now, listen to\n            me, because I am going to tell\n            you...now, you wanted to be\n            \"inside\"...I am going to take\n            you as far inside as you can go:\n            Z'at what you want...? Is that\n            what you want?\n\n                                                            134.\n\n\n                       SCOTT\n            No, I just wanted to bring the\n            girl back.\n\nHe shoots Stoddard, who falls.\n\nANGLE, INT. The Bizjet, as it taxis. Laura Newton turns her\nface to the sound of the shot.\n\nANGLE, her POV. Jackie Black, on the tarmac, Scott, kneeling\nto the fallen Stoddard, and then running out of the hangar\ntoward her.\n\nANGLE, on Scott, running, as we see he has the key he has\ntaken from Stoddard, and is releasing his handcuffs.\n\nANGLE Jackie Black, bleeding, as Scott kneels to her, and\ncradles her. Scott looks down. Black is weakening, and\nobviously expiring.\n\n                      JACKIE BLACK\n            ...is she safe?\n\n                      SCOTT\n            That's right, she's safe.\n\n                      JACKIE BLACK\n                 (weakly, almost whispering)\n            ...well, then...\n\nANGLE on Scott, cradling her. Weeping, as he smoothes her hair.\n\n                      SCOTT\n            ...that's right, Baby...\n\n\nFADE OUT.\n\n\n\n\nSPARTAN\nA Screenplay by David Mamet\nCopyright c 2002\nBy David Mamet\n\n\n\n                                             AUGUST 2002\n\n\n\n\n\nSpartan\nWriters :   Brian Helgeland\nGenres :   Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:36:07.869290"}