{"title": "Star Wars: Return of the Jedi", "film_link": "/Movie Scripts/Star Wars: Return of the Jedi Script.html", "script_link": "/scripts/Star-Wars-Return-of-the-Jedi.html", "info_raw": "\n\nStar Wars: Return of the Jedi Script\n\n\n\n\nIMSDb opinion  It's a classic.\nIMSDb rating   (8 out of 10)\nAverage user rating   (9.83 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  George Lucas  Lawrence Kasdan\nGenres  Fantasy  Sci-Fi  Action  Adventure\nScript Date : December 1981\n\nRead \"Star Wars: Return of the Jedi\" Script\n\n\n", "script": "\nRETURN \nOF THE \nJEDI\n\nby\nLawrence Kasdan\n&\nGeorge Lucas\n\nFrom The Novel\nby\nGeorge Lucas\n\nThird Draft\n\nProperty of Lucasfilm Ltd.\n\n\nCompletion Date December 1, 1981\n\n1    SPACE                                                           \n\nThe boundless heavens serve as a back-drop for the MAIN TITLE, followed \nby a ROLL-UP, which crawls into infinity.\n\nEpisode VI\nRETURN OF THE JEDI\n\nLuke Skywalker has returned to his home planet of Tatooine in an \nattempt to rescue his friend Han Solo from the clutches of theÊvile \ngangster Jabba the Hutt. Little does Luke know that the GALACTIC EMPIRE \nhas secretly begun construction on a new armored space station even \nmore powerful than the first dreaded Death Star. When completed, this \nultimate weapon will spell certain doom for the small band of Rebels \nstruggling to restore freedom to the galaxy...\n\nPAN DOWN to reveal a monstrous half-completed Death Star, its massive \nsuperstructure curling away from the completed section like the arms of \na giant octopus. Beyond, in benevolent contrast, floats the small, \ngreen moon of ENDOR.\n\nAn Imperial Star Destroyer moves overhead toward the massive armored \nspace station, followed by two zipping TIE fighters. A small Imperial \nshuttle rockets from the main bay of the ship and hustles toward the \nDeath Star.\n\n2    INT IMPERIAL SHUTTLE - COCKPIT \nThe shuttle captain makes contact with the Death Star.\n\nSHUTTLE CAPTAIN\nCommand station, this is ST 321. Code Clearance Blue. We're starting \nour approach. Deactivate the security shield.\n\nDEATH STAR CONTROLLER\t(filtered VO)\nThe security deflector shield will be deactivated when we have \nconfirmation of your code transmission. Stand by... You are clear to \nproceed.\n\nSHUTTLE CAPTAIN\nWe're starting our approach.\n\n3    INT DEATH STAR - CONTROL ROOM\n\nOperators move about among the control panels. A SHIELD OPERATOR hits \nswitches beside a large screen, on which is a display of the Death \nStar, the moon Endor, and a bright web delineating the invisible \ndeflector shield.\n\nA control officer rushes over to the shield operator.\n\nOFFICER\nInform the commander that Lord Vader's shuttle has arrived.\n\nOPERATOR\nYes, sir.\n\nThe control officer moves to a view port and watches as the Imperial \nshuttle lands in the massive docking bay. A squad of Imperial \nstormtroopers moves into formation before the craft.\n\n4    INT DEATH STAR - MAIN DOCKING BAY\n\nThe DEATH STAR COMMANDER, MOFF JERJERROD, a tall, confident technocrat, \nstrides through the assembled troops to the base of the shuttle ramp. \nThe troops snap to attention; many are uneasy about the new arrival. \nBut the Death Star commander stands arrogantly tall.\n\nThe exit hatch of the shuttle opens with a WHOOSH, revealing only \ndarkness. Then, heavy FOOTSTEPS AND MECHANICAL BREATHING. From this \nblack void appears DARTH VADER, LORD OF THE SITH. Vader looks over the \nassemblage as he walks down the ramp.\n\nJERJERROD\nLord Vader, this is an unexpected pleasure. We're honored by your \npresence.\n\nVADER\nYou may dispense with the pleasantries, Commander. I'm here to put you \nback on\nschedule.\n\nThe commander turns ashen and begins to shake.\n\nJERJERROD\nI assure you, Lord Vader, my men are working as fast as they can.\n\nVADER\nPerhaps I can find new ways to motivate them.\n\nJERJERROD\nI tell you, this station will be operational as planned.\n\nVADER\nThe Emperor does not share your optimistic appraisal of the situation.\n\nJERJERROD\nBut he asks the impossible. I need more men.\n\nVADER\nThen perhaps you can tell him when he arrives.\n\nJERJERROD\t (aghast)\nThe Emperor's coming here?\n\nVADER\nThat is correct, Commander. And he is most displeased with your \napparent lack of progress.\n\nJERJERROD\nWe shall double our efforts.\n\nVADER\nI hope so, Commander, for your sake. The Emperor is not as forgiving as \nI am.\n\n5    EXT ROAD TO JABBA'S PALACE - TATOOINE\n\nA lonely, windswept road meanders through the desolate Tatooine \nterrain. We HEAR a familiar BEEPING and a distinctive reply before \ncatching sight of ARTOO-DETOO and SEE-THREEPIO, making their way along \nthe road toward the ominous palace of Jabba the Hutt.\n\nTHREEPIO\nOf course I'm worried. And you should be, too. Lando Calrissian and \npoor Chewbacca never returned from this awful place.\n\nArtoo whistles timidly.\n\nTHREEPIO\nDon't be so sure. If I told you half the things I've heard about this \nJabba the Hutt, you'd probably short-circuit.\n\nThe two droids fearfully approach the massive gate to the palace.\n\nTHREEPIO\nArtoo, are you sure this is the right place? I better knock, I suppose.\n\n6    EXT JABBA'S PALACE - GATE \n\nThreepio looks around for some kind of signaling device, then timidly \nknocks on the iron door.\n\nTHREEPIO\t (instantly) \nThere doesn't seem to be anyone there. Let's go back and tell Master \nLuke.\n\nA small hatch in the middle of the door opens and a spidery mechanical \narm, with a large electronic eyeball on the end, pops out and inspects \nthe two droids.\n\nSTRANGE VOICE\nTee chuta hhat yudd!\n\nTHREEPIO\nGoodness gracious me!\n\n Threepio points to Artoo, then to himself.\n\n THREEPIO\n Artoo Detoowha bo Seethreepiowha ey toota odd mischka Jabba du Hutt.\n\nThe eye looks from one robot to the other, there is a laugh then the \neye zips back into the door. The hatch slams shut. Artoo beeps his \nconcern.\n\nTHREEPIO\nI don't think they're going to let us in, Artoo. We'd better go.\n\nArtoo beeps his reluctance as Threepio turns to leave. Suddenly the \nmassive door starts to rise with a horrific metallic SCREECH. The \nrobots turn back and face an endless black cavity. The droids look at \none another, afraid to enter.\n\nArtoo starts forward into the gloom. Threepio rushes after his stubby \ncompanion. The door lowers noisily behind them.\n\nTHREEPIO \nArtoo, wait. Oh, dear! Artoo. Artoo, I really don't think we should \nrush into all this.\n\nArtoo continues down the corridor, with Threepio following.\n\nTHREEPIO\nOh, Artoo!  Artoo, wait for me!\n\n7    INT JABBA'S PALACE - HALLWAY\n\nThe door slams shut with a loud crash that echoes throughout the dark \npassageway. The frightened robots are met by two giant, green GAMORREAN \nGUARDS, who fall in behind them. Threepio glances quickly back at the \ntwo lumbering brutes, then back to Artoo. One guard grunts an order. \nArtoo beeps nervously.\n\nTHREEPIO\nJust you deliver Master Luke's message and get us out of here. Oh my! \nOh! Oh, no.\n\nWalking toward them out of the darkness is BIB FORTUNA, a humanlike \nalien with long tentacles protruding from his skull.\n\nBIB\nDie Wanna Wanga!\n\nTHREEPIO\nOh, my! Die Wanna Wauaga. We -- we bring a message to your master, \nJabba the Hutt.\n\nArtoo lets out a series of quick beeps.\n\nTHREEPIO\t (cont)\n...and a gift.\n(thinks a moment, then to Artoo)\nGift, what gift?\n\nBib shakes his head negatively.\n\nBIB\nNee Jabba no badda. Me chaade su goodie.\n\nBib holds out his hand toward Artoo and the tiny droid backs up a bit, \nletting out a protesting array of squeaks. Threepio turns to the \nstrange-looking alien.\n\nTHREEPIO\nHe says that our instructions are to give it only to Jabba himself.\n\nBib thinks about this for a moment.\n\nTHREEPIO\nI'm terribly sorry. I'm afraid he's ever so stubborn about these sort \nof things.\n\nBib gestures for the droids to follow.\n\nBIB\nNudd Chaa.\n\nThe droids follow the tall, tentacled alien into the darkness, trailed \nby the two guards.\n\nTHREEPIO\nArtoo, I have a bad feeling about this.\n\n8    INT JABBA'S THRONE ROOM\n\nThe throne room is filled with the vilest, most grotesque CREATURES \never conceived in the universe. Artoo and Threepio seem very small as \nthey pause in the doorway to the dimly lit chamber. Light shafts \npartially illuminate the drunken courtiers as Bib Fortuna crosses the \nroom to the platform upon which rests the leader of this nauseating \ncrowd: JABBA THE HUTT. The monarch of the galactic underworld is a \nrepulsive blob of bloated fat with a maniacal grin. Chained to the \nhorrible creature is the beautiful alien female dancer named OOLA. At \nthe foot of the dais sits an obnoxious birdlike creature, SALACIOUS \nCRUMB. Bib whispers something in the slobbering degenerate's ear. Jabba \nlaughs horribly, at the two terrified droids before him. Threepio bows \npolitely.\n\nTHREEPIO\nGood morning.\n\nJABBA\nBo Shuda!\n\nThe robots jump forward to stand before the repulsive, loose-skinned \nvillain.\n\nTHREEPIO\nThe message, Artoo, the message.\n\nArtoo whistles, and a beam of light projects from his domed head, \ncreating a hologram of LUKE on the floor. The image grows to over ten \nfeet tall, and the young Jedi towers over the space gangsters.\n\nLUKE\nGreetings, Exalted One. Allow me to introduce myself. I am Luke \nSkywalker, Jedi Knight and friend to Captain Solo. I know that you are \npowerful, mighty Jabba, and that your anger with Solo must be equally \npowerful. I seek an audience with Your Greatness to bargain for Solo's \nlife. \n(Jabba's crowd laughs) \nWith your wisdom, I'm sure that we can work out an arrangement which \nwill be mutually beneficial and enable us to avoid any unpleasant \nconfrontation. As a token of my goodwill, I present to you a gift: \nthese two droids.\n\nThreepio is startled by this announcement.\n\nTHREEPIO\nWhat did he say?\n\nLUKE\t (cont)\n... Both are hardworking and will serve you well.\n\nTHREEPIO\nThis can't be! Artoo, you're playing the wrong message.\n\nLuke's hologram disappears.\n\nJabba laughs while Bib speaks to him in Huttese.\n\nJABBA\t (in Huttese subtitled)\nThere will be no bargain.\n\nTHREEPIO\nWe're doomed.\n\nJABBA\t (in Huttese subtitled)\nI will not give up my favorite decoration. I like Captain Solo where he \nis.\n\nJabba laughs hideously and looks toward an alcove beside the throne. \nHanging high, flat against the wall, exactly as we saw him last, is a \ncarbonized HAN SOLO.\n\nTHREEPIO\nArtoo, look! Captain Solo. And he's still frozen in carbonite.\n\n9    INT DUNGEON CORRIDOR \n\nOne of Jabba's Gamorrean guards marches Artoo and Threepio down a dank, \nshadowy passageway lined with holding cells. The cries of unspeakable \ncreatures bounce off the cold stone walls. Occasionally a repulsive arm \nor tentacle grabs through the bars at the hapless droids. Artoo beeps \npitifully.\n\nTHREEPIO\nWhat could possibly have come over Master Luke. Is it something I did? \nHe never expressed any unhappiness with my work. Oh! Oh! Hold it! Ohh!\n\nA large tentacle wraps around Threepio's neck. He manages to break \nfree, and they move on to a door at the end of the corridor.\n\n10   INT BOILER ROOM\n\nThe door slides open, revealing a room filled with steam and noisy \nmachinery. The guard motions them into the boiler room, where they are \nmet by a tall, thin humanlike robot named EV-9D9. Behind the robot can \nbe seen a torture rack pulling the legs off a screaming baby work \ndroid. A second power droid is upside down.  As smoking branding irons \nare pressed into his feet, the stubby robot lets out an agonized \nelectronic scream. Artoo and Threepio cringe as the guard grunts to EV-\n9D9.\n\nNINEDENINE\nAh, good. New acquisitions. You are a protocol droid, are you not?\n\nTHREEPIO\nI am See-Threepio, human-cy...\n\nNINEDENINE\nYes or no will do.\n\nTHREEPIO\nOh. Well, yes.\n\nNINEDENINE\nHow many languages do you speak?\n\nTHREEPIO\nI am fluent in over six million forms of communication, and can \nreadily...\n\nNINEDENINE\nSplendid! We have been without an interpreter since our master got \nangry with our last protocol droid and disintegrated him.\n\nTHREEPIO\nDisintegrated?\n\nNINEDENINE\t (to a Gamorrean guard)\nGuard! This protocol droid might be useful. Fit him with a restraining \nbolt and take him back to His Excellency's main audience chamber.\n\nThe guard shoves Threepio toward the door.\n\nTHREEPIO\t (disappearing)\nArtoo, don't leave me! Ohhh!\n\nArtoo lets out a plaintive cry as the door closes. Then he beeps \nangrily.\n\nNINEDENINE\nYou're a feisty little one, but you'll soon learn some respect. I have \nneed for you on the master's Sail Barge. And I think you'll fit in \nnicely.\n\nThe poor work droid in the background lets out another tortured \nelectronic scream.\n\n11   INT JABBA'S THRONE ROOM\n\nThe court of Jabba the Hutt is in the midst of a drunken, raucous \nparty. Sloppy, smelly monsters cheer and make rude noises as Oola and a \nfat female dancer perform in front of Jabba's throne.\n\nJabba leers at the dancers and with a lustful gleam in his eye beckons \nOola to come and sit with him. She stops dancing and backs away, \nshaking her head. Jabba gets angry and points to a spot next to him.\n\nJABBA\nDa Eitha!\n\nThe lovely alien shakes her head again and screams.\n\nOOLA\nNa Chuba negatorie Na! Na! Natoota...\n\nJabba is furious and pulls her toward him, tugging on the chain.\n\nJABBA\nBoscka!\n\nHe pushes a button and, before the dancer can flee, a trap door in the \nfloor springs open and swallows her up. As the door snaps shut, a \nmuffled growl is followed by a hideous scream. Jabba and his monstrous \nfriends laugh hysterically and several revelers hurry over to watch her \nfate through a grate.\n\nThreepio cringes and glances wistfully at the carbonite form of Han \nSolo, but is immediately distracted by a gunshot offscreen.ÊAn \nunnatural quiet sweeps the boisterous gathering. On the far side of the \nroom, the crush of debauchers moves aside to allow the approach of two \nguards followed by BOUSHH, an oddly cloaked bounty hunter, leading his \ncaptive, Han Solo's copilot, CHEWBACCA THE WOOKIEE.\n\nBib takes his place next to his disgusting master, and whispers into \nhis ear, pointing at Chewbacca and the bounty hunter. Jabba listens \nintently, then the bounty hunter bows before the gangster and speaks a \ngreeting in a strange, electronically processed tongue (Ubese).\n\nBOUSHH\t (in Ubese subtitled)\nI have come for the bounty on this Wookiee.\n\nTHREEPIO\nOh, no! Chewbacca!\n\nJABBA\t (in Huttese subtitled)\nAt last we have the mighty Chewbacca.\n\nJabba lets out a loud, long, blood-curdling laugh and turns to \nThreepio, waving him closer. The reluctant droid obeys.\n\nTHREEPIO\nOh, uh, yes, uh, I am here, Your Worshipfulness. Uh... yes!\n\nJabba continues speaking, as Threepio nervously translates. Boushh \nlistens, studying the dangerous creatures around the room. He notices \nBOBA FETT standing near the door.\n\nTHREEPIO\nOh. The illustrious Jabba bids you welcome and will gladly pay you the \nreward of twenty-five thousand.\n\nBOUSHH\t (in Ubese subtitled)\nI want fifty thousand. No less.\n\nJabba immediately flies into a rage, knocking the golden droid off the \nraised throne into a clattering heap on the floor. Boushh adjusts his \nweapon as Jabba raves in Huttese and Threepio struggles back onto the \nthrone. The disheveled droid tries to compose himself.\n\nTHREEPIO\nUh, oh... but what, what did I say?\n(to Boushh)\nUh, the mighty Jabba asks why he must pay fifty thousand.\n\nThe bounty hunter holds up a small silver ball in his hand. Threepio \nlooks at it, then looks at Jabba, then back to the bounty hunter. The \ndroid is very nervous and Jabba is getting very impatient.\n\nTHREEPIO\nBecause he's holding a thermal detonator.\n\nThe guards instantly back away, as do most of the other monsters in the \nroom. Jabba stares at the silver ball, which begins to glow in the \nbounty hunter's hand. The room has fallen into a tense hush. Jabba \nstares at the bounty hunter malevolently until a sly grin creeps across \nhis vast mouth and he begins to laugh.\n\nJABBA\t (in Huttese subtitled)\nThis bounty hunter is my kind of scum. Fearless and inventive.\n\nJabba continues.\n\nTHREEPIO\nJabba offers the sum of thirty-five. And I suggest you take it.\n\nBib and the other monsters study the bounty hunter and wait for his \nreaction. Boushh releases a switch on the thermal detonator and it goes \ndead.\n\nBOUSHH\nZeebuss.\n\nTHREEPIO\nHe agrees!\n\nThe raucous crowd of monsters erupts in a symphony of cheers and \napplause as the party returns to its full noisy pitch. Chewbacca \ngrowls. As he is led away we spot LANDO CALRISSIAN, disguised as a \nskiff guard in a partial face mask. The band starts up and dancing \ngirls take the center of the floor, to the hoots of the loudly \nappreciative creatures.\n\nBoushh leans against a column with gunfighter cool and surveys the \nscene, his gaze stopping only when it connects with a glare from across \nthe room. Boba Fett is watching him. Boushh shifts slightly, cradling \nhis weapon lovingly. Boba Fett shifts with equally ominous arrogance.\n\n12   INT DUNGEON CORRIDOR AND CELL\n\nGamorrean guards lead Chewie down the same hallway we saw before. When \na tentacle reaches out at the Wookiee, Chewie's ferocious ROAR echoes \nagainst the walls and the tentacle snaps back into its cell in terror. \nIt takes all the guards to hurl Chewie roughly into a cell, slamming \nthe door behind him. Chewie lets out a pathetic howl and bangs on the \niron door.\n\n13   EXT JABBA'S PALACE\n\nThe palace is sitting in the light of the double sunset. On the road in \nfront, a large toadlike creature flicks its tongue out for a desert \nrodent and burps in satisfaction.\n\n14   INT JABBA'S THRONE ROOM - NIGHT\n\nSilence. The room is deserted, only the awful debris of the alien \ncelebration giving mute witness to the activity here before. Several \ndrunk creatures lie unconscious around the room, snoring loudly.\n\nA shadowy figure moves stealthily among the columns at the perimeter of \nthe room and is revealed to be Boushh, the bounty hunter. He picks his \nway carefully through the snoring, drunken monsters.\n\nHan Solo, the frozen space pirate, hangs spotlighted on the wall, his \ncoffin-like case suspended by a force field. The bounty hunter \ndeactivates the force field by flipping a control switch to one side of \nthe coffin. The heavy case slowly lowers to the floor of the alcove.\n\nBoushh steps up to the case, studying Han, and then turns to the \ncontrols on the side of the coffin. He activates a series of switches \nand, after one last hesitant look at Han, slides the de-carbonization \nlever. The case begins to emit a sound as the hard shell covering the \ncontours of Han's face begins to melt away. The bounty hunter watches \nas Han's body is freed of its metallic coat and his forearms and hands, \npreviously raised in reflexive protest, drop slackly to his side. His \nface muscles relax from their mask of horror. He appears quite dead.\n\nBoushh's ugly helmet leans close to Han's face listening for the breath \nof life. Nothing. He waits. Han's eyes pop open with a start and he \nbegins coughing. The bounty hunter steadies the staggering newborn.\n\nBOUSHH\nJust relax for a moment. You're free of the carbonite.\n\nHan touches his face with his hand and moans.\n\nBOUSHH\nShhh. You have hibernation sickness.\n\nHAN\nI can't see.\n\nBOUSHH\nYour eyesight will return in time.\n\nHAN\nWhere am I?\n\nBOUSHH\nJabba's palace.\n\nHAN\nWho are you?\n\nThe bounty hunter reaches up and lifts the helmet from his head, \nrevealing the beautiful face of PRINCESS LEIA.\n\nLEIA\nSomeone who loves you.\n\nHAN\nLeia!\n\nLEIA\nI gotta get you out of here.\n\nAs Leia helps her weakened lover to stand up, the relative quiet is \npierced by an obscene HUTTESE CACKLE from the other side of the alcove.\n\nHAN\nWhat's that? I know that laugh.\n\nThe curtain on the far side of the alcove opens, revealing Jabba the \nHutt, surrounded by Bib and other aliens. He laughs again, and his \ngross cronies join in a cacophony of alien glee.\n\nHAN\nHey, Jabba. Look, Jabba, I was just on my way to pay you back, but I \ngot a little sidetracked. It's not my fault.\n\nJabba laughs.\n\nJABBA\t (in Huttese subtitled)\nIt's too late for that, Solo. You may have been a good smuggler, but \nnow you're Bantha fodder.\n\nHAN\nLook...\n\nJABBA\t (cont Huttese subtitled)\nTake him away!\n\nThe guards grab Han and start to lead him away.\n\nHAN\nJabba... I'll pay you triple! You're throwing away a fortune here. \nDon't be a fool!\n\nHan is dragged off, as Lando quickly moves forward and attempts to lead \nLeia away.\n\nJABBA\t (in Huttese subtitled)\nBring her to me.\n\nJabba chuckles as Lando and a second guard drag the beautiful young \nprincess toward him. Threepio peeks from behind a monster and quickly \nturns away in disgust.\n\nLEIA\nWe have powerful friends. You're gonna regret this...\n\nJABBA\t (in Huttese subtitled)\nI'm sure.\n\nInexorably her lovely face moves to within a few inches of Jabba's ugly \nblob of a head, and Leia turns away in disgust.\n\nLEIA\nUgh!\n\nTHREEPIO\nOhhh, I can't bear to watch.\n\n15   INT DUNGEON CELL\n\nThe heavy metal door of the dungeon whines and slowly creaks open. A \nguard throws the blinded star captain into the dark cell and the door \nslams shut behind him, leaving only a thin sliver of light from a crack \nin the door. Han is trying to collect himself when suddenly a growl is \nheard from the far side of the cell. He jumps back against the cell \ndoor and listens.\n\nHAN\nChewie? Chewie, is that you?\n\nThe shadowy figure lets out a crazy yell and races toward Han, lifting \nhim off the ground with a big hug that carries them into the light, \nrevealing Chewie.\n\nHAN\nAh! Chew--Chewie!\n\nThe giant Wookiee barks with glee.\n\nHAN\nWait. I can't see, pal. What's goin' on?\n\nChewie barks an excited blue streak.\n\nHAN\nLuke? Luke's crazy. He can't even take care of himself, much less \nrescue anybody.\n\nChewie barks a reply.\n\nHAN\nA...Jedi Knight? I--I'm out of it for a little while, everybody gets \ndelusions of grandeur.\n\nChewie growls insistently. He holds Han to his chest and pets his head.\n\nHAN\nI'm all right, pal. I'm all right.\n\n16   INT MAIN GATE AND HALL - JABBA'S PALACE\n\nNoisily, the main gate lifts to flood the blackness with blinding LIGHT \nand reveal the silhouetted figure of LUKE SKYWALKER. He is clad in a \nrobe similar to Ben's and wears neither pistol nor laser sword. Luke \nstrides purposefully into the hallway. Two giant guards move to block \nLuke's path. Luke halts.\n\nLuke raises his hand and points at the puzzled guards, who immediately \nlower their spears and fall back. The young Jedi lowers his hand and \nmoves on down the hallway.\n\nBib Fortuna appears out of the gloom. He speaks to Luke as they \napproach each other, but Luke doesn't stop and Bib must reverse his \ndirection and hurry alongside the young Jedi in order to carry on the \nconversation. Several other guards fall in behind them in the darkness.\n\nLUKE\nI must speak with Jabba.\n\nBib answers in Huttese, shaking his head in denial. Luke stops and \nstares at Bib; he raises his hand slightly.\n\nLUKE\nYou will take me to Jabba now!\n\nBib turns in hypnotic response to Luke's command, and Luke follows him \ninto the gloom.\n\nLUKE\nYou serve your master well.\n\nBib responds.\n\nLUKE\nAnd you will be rewarded.\n\n17   INT JABBA'S THRONE ROOM\n\nJabba is asleep on his throne, with Leia lying in front of him. \nSalacious sits by Jabba's tail, watching it wriggle. Leia is now \ndressed in the skimpy costume of a dancing girl; a chain runs from a \nmanacle/necklace at her throat to her new master, Jabba the Hutt. \nThreepio stands behind Jabba as Bib comes up to the gangster slug.\n\nTHREEPIO\nAt last! Master Luke's come to rescue me.\n\nBIB\nMaster.\n\nJabba awakens with a start and Bib continues, in Huttese.\n\nBIB\n...Luke Skywalker, Jedi Knight.\n\nJABBA\t (in Huttese subtitled)\nI told you not to admit him.\n\nLUKE\nI must be allowed to speak.\n\nBIB\t (in Huttese subtitled)\nHe must be allowed to speak.\n\nJabba, furious, clobbers Bib and shoves him away.\n\nJABBA\t (in Huttese subtitled)\nYou weak-minded fool! He's using an old Jedi mind trick.\n\nLuke stares hard at Jabba.\n\nLUKE\nYou will bring Captain Solo and the Wookiee to me.\n\nJABBA\t (in Huttese subtitled)\nYour mind powers will not work on me, boy.\n\nLUKE\nNevertheless, I'm taking Captain Solo and his friends. You can either \nprofit by this... or be destroyed! It's your choice. But I warn you not \nto underestimate my powers.\n\nJabba's laugh is mean and loud. Threepio attempts to warn Luke about \nthe pit.\n\nTHREEPIO\nMaster Luke, you're standing on...\n\nJABBA\t (in Huttese subtitled)\nThere will be no bargain, young Jedi. I shall enjoy watching you die.\n\nLuke reaches out, and a pistol jumps out of a guard's holster and flies \ninto Luke's hand. The bewildered guard grabs for it as Jabba raises his \nhand.\n\nJABBA\nBascka!\n\nThe floor suddenly drops away, sending Luke and the hapless guard into \nthe pit. The pistol goes off, blasting a hole in the ceiling. Jabba \nlaughs and his courtiers join in. Leia starts forward but is restrained \nby a human guard-- Lando, recognizable behind his mask. She looks at \nhim and he shakes his head \"no.\"\n\n18   INT RANCOR PIT\n\nLuke and the guard have dropped twenty-five feet from a chute into the \ndungeonlike cage. Luke gets to his feet as the guard yells hysterically \nfor help. A crowd gathers up around the edge of the pit as the door in \nthe side of the pit starts to RUMBLE open. The guard screams in panic. \nLuke looks calmly around for a means of escape.\n\nTHREEPIO\nOh, no! The Rancor!\n\nAt the side of the pit, an iron door rumbles upward and a giant, fanged \nRANCOR emerges. The guard runs to the side of the pit and tries \nfutilely to scramble to the top. The hideous beast closes in on him.\n\nThe Rancor moves past Luke, and as the guard continues to scramble, the \nRancor picks him up and pops him into its slavering jaws. A few \nscreams, and the guard is swallowed with a gulp. The audience cheers \nand laughs at the guard's fate.\n\nThe monster turns and starts for Luke. The young Jedi dashes away just \nahead of the monster's swipe at him, and picks up the long arm bone of \nan earlier victim. The monster grabs Luke and brings him up to his \nsalivating mouth. At the last moment, Luke wedges the bone in the \nmonster's mouth and is dropped to the floor. The monster bellows in \nrage and flails about, hitting the side of the pit, causing an \navalanche.\n\nThe monster crushes the bone in its jaws and sees Luke, who squeezes \ninto a crevice in the pit wall. Luke looks past the monster to the \nholding cave beyond. On the far side of the holding cave is a utility \ndoor--if only he can get to it. The Rancor spots Luke and reaches into \nthe crevice for him. Luke grabs a large rock and raises it, smashing it \ndown on the Rancor's finger.\n\n19   HOLDING TUNNEL - RANCOR PIT\n\nThe Rancor lets out a loud howl as Luke makes a run for the holding \ncave. He reaches the door and pushes a button to open it. When he \nsucceeds, he sees a heavy barred gate between him and safety. Beyond \nthe gate two guards look up from their dinner. Luke turns to see the \nmonster heading for him, and pulls with all his might on the gate. The \nguards move to the gate and start poking at the young Jedi with spears, \nlaughing.\n\nLuke crouches (against the wall) as the monster starts to reach for \nhim. Suddenly he notices a main door control panel halfway up the wall. \nAs the Rancor moves in for the kill, Luke picks up a skull from the \ncave floor and hurls it at the panel. The giant overhead door comes \ncrashing down on the beast's head, squashing it like a sledgehammer on \nan egg.\n\nA startled gasp is heard from the stunned court. There's consternation \nat this turn of events. Heads look to Jabba, who is actually turning \nred with anger. Leia cannot suppress her joy. Jabba utters harsh \ncommands to his guards and they hurry off.\n\nJABBA\t (in Huttese subtitled)\nBring me Solo and the Wookiee. They will all suffer for this outrage.\n\n21   INT RANCOR PIT\n\nThe Rancor KEEPERS have come into the cage and are examining their dead \nbeast. One of them breaks down and weeps. The other glares menacingly \nat Luke, who is unworried. Several guards rush into the holding tunnel \nand take Luke away.\n\n22   INT THRONE ROOM\n\nThe crowd of creepy courtiers parts as Han and Chewie are brought into \nthe throne room, and other guards drag Luke up the steps.\n\nLUKE\nHan!\n\nHAN\nLuke!\n\nLUKE\nAre you all right?\n\nHAN\nFine. Together again, huh?\n\nLUKE\nWouldn't miss it.\n\nHAN\nHow are we doing?\n\nLUKE\nThe same as always.\n\nHAN\nThat bad, huh? Where's Leia?\n\nLuke looks to Leia.\n\nLEIA\nI'm here.\n\nThreepio is standing behind the grotesque gangster as he strokes Leia \nlike a pet cat. Several of the guards, including Lando, bring Luke from \nthe other side of the room. Boba is standing behind Jabba.\n\nThreepio steps forward and translates for the captives.\n\nTHREEPIO\nOh, dear. His High Exaltedness, the great Jabba the Hutt, has decreed \nthat you are to be terminated immediately.\n\nHAN\nGood, I hate long waits.\n\nTHREEPIO\nYou will therefore be taken to the Dune Sea and cast into the pit of \nCarkoon, the nesting place of the all-powerful Sarlacc.\n\nHAN\t (to Luke)\nDoesn't sound so bad.\n\nTHREEPIO\nIn his belly, you will find a new definition of pain and suffering, as \nyou are slowly digested over a thousand years.\n\nHAN\nOn second thought, let's pass on that, huh?\n\nChewie barks his agreement.\n\nLUKE\nYou should have bargained, Jabba. That's the last mistake you'll ever \nmake.\n\nJabba cackles evilly at this.\n\nAs the guards drag the prisoners from the throne room, a loud cheer \nrises from the crowd. Leia and Chewie exchange concerned looks, but \nLuke Skywalker, Jedi warrior, cannot suppress a smile.\n\n23   EXT TATOOINE SEA - SKIFF\n\nJabba's huge SAIL BARGE moves above the desert surface accompanied by \ntwo smaller Skiffs. One of the skiffs glides close, revealing Luke, \nHan, and Chewie -- all in bonds -- surrounded by guards, one of whom is \nLando in disguise.\n\nHAN\nI think my eyes are getting better. Instead of a big dark blur, I see a \nbig light blur.\n\nLUKE\nThere's nothing to see. I used to live here, you know.\n\nHAN\nYou're gonna die here, you know. Convenient.\n\nLUKE\nJust stick close to Chewie and Lando. I've taken care of everything.\n\nHAN\nOh... great!\n\n24   INT BARGE OBSERVATION DECK\n\nJabba the Hutt rides like a sultan in the massive antigravity ship. His \nentire retinue is with him, drinking, eating, and having a good time. \nLeia is watching her friends in the skiff when the chain attached to \nher neck is pulled tight and Jabba tugs the scantily clad princess to \nhim.\n\nJABBA\t (in Huttese subtitled)\nSoon you will learn to appreciate me.\n\nThreepio wanders among the Sail Barge aliens, bumping into a smaller \ndroid serving drinks, spilling them all over the place. The stubby \ndroid lets out an angry series of beeps and whistles.\n\nTHREEPIO\nOh, I'm terribly sor... Artoo! What are you doing here?\n\nArtoo beeps a quick reply.\n\nTHREEPIO\nWell, I can see you're serving drinks, but this place is dangerous. \nThey're going to execute Master Luke and, if we're not careful, us too!\n\nArtoo whistles a singsong response.\n\nTHREEPIO\nHmm.  I wish I had your confidence.\n\n25   EXT SARLACC PIT \n\nThe convoy moves up over a huge sand pit. The Sail Barge stops to one \nside of the depression, as does the escort skiff. But the prisoner's \nskiff moves out directly over the center and hovers. At the bottom of \nthe deep cone of sand is a repulsive, mucous-lined hole, surrounded by \nthousands of needle-sharp teeth. This is the SARLACC. A plank is \nextended from the edge of the prisoner's skiff. Guards release Luke's \nbonds and shove him out onto the plank above the Sarlacc's mouth.\n\n26   EXT SAIL BARGE OBSERVATION DECK\n\nJabba and Leia are now by the rail, watching. Threepio leans forward \nand the slobbering villain mumbles something to him. As Threepio steps \nup to a comlink, Jabba raises his arm and the motley array of \nintergalactic pirates fall silent. Threepio's voice is amplified across \nloudspeakers.\n\nTHREEPIO\nVictims of the almighty Sarlacc: His Excellency hopes that you will die \nhonorably. But should any of you wish to beg for mercy, the great Jabba \nthe Hutt will now listen to your pleas.\n\n27   EXT SKIFF\n\nHan steps forward arrogantly and begins to speak.\n\nHAN\nThreepio, you tell that slimy piece of... worm-ridden filth he'll get \nno such pleasure from us. Right?\n\nChewie growls his agreement.\n\nLUKE\nJabba! This is your last chance. Free us or die.\n\nLando moves unobtrusively along the skiff as Luke shoots a quick look \nof conspiracy to him.\n\n28   INT SAIL BARGE OBSERVATION DECK\n\nThe assembled monsters rock with mocking laughter as Artoo zips \nunnoticed up the ramp to the upper deck. Jabba's laughter subsides as \nhe speaks into the comlink.\n\nJABBA\t (in Huttese subtitled)\nMove him into position.\n\nJabba makes a thumbs-down gesture. Leia looks worried.\n\n29   EXT BARGE - UPPER DECK\n\nArtoo appears from below and zips over to the rail facing the pit. \nBelow, in the skiff, Luke is prodded by a guard to the edge of the \nplank over the gaping Sarlacc. Luke looks up at Artoo, then gives a \njaunty salute: the signal the little droid has been waiting for. A flap \nopens in Artoo's domed head.\n\nJABBA\t (in Huttese subtitled)\nPut him in.\n\n30   EXT SKIFF - PLANK\n\nLuke is prodded and jumps off the plank to the cheers of the \nbloodthirsty spectators. But, before anyone can even perceive what is \nhappening, he spins around and grabs the end of the plank by his \nfingertips. The plank bends wildly from his weight and catapults him \nskyward. In midair he does a complete flip and drops down on the end of \nthe plank in the same spot he just vacated, but facing the skiff. He \ncasually extends an open palm and -- his lightsaber, which Artoo has \nsent arcing toward him, drops into his hand.\n\nWith samurai speed, Luke ignites it and attacks the guard who prodded \nhim off the plank, sending the hapless monster screaming overboard. The \nother guards swarm toward Luke. He wades into them, lightsaber \nflashing. Lando struggles with another guard at the back of the skiff.\n\n31   EXT SARLACC PIT\n\nA bewildered guard lands in the soft, sandy slope of the pit, and \nbegins sliding. He claws desperately as a Sarlacc tentacle grabs him \nand pulls him screaming into the viscous mouth.\n\n32   INT SAIL BARGE\n\nJabba watches this and explodes in rage. He barks commands, and the \nguards around him rush off to do his bidding. The scuzzy creatures \nwatching the action from the window are in an uproar.\n\n33   EXT SKIFF \n\nLuke knocks another guard off the skiff and into the waiting mouth of \nthe Sarlacc. He starts to untie Chewie's bonds.\n\nLUKE\nEasy, Chewie.\n\nAt that moment, the deck gunmen on the barge unleash a series of blasts \nfrom a big cannon on the upper deck. Lando is tossed from the deck of \nthe rocking skiff. He manages to grab a rope, and dangles desperately \nabove the Sarlacc pit.\n\nLANDO\nWhoa! Whoa! Help!\n\n34   EXT UPPER DECK - SAIL BARGE\n\nWith two swift strides, the dangerous Boba Fett ignites his rocket \npack, leaps into the air, and flies from the barge down to the skiff.\n\n35   EXT SKIFF\n\nBoba lands on the skiff and starts to aim his laser gun at Luke, who \nhas freed Han and Chewie from their bonds. But before Boba can fire, \nthe young Jedi spins on him, lightsaber sweeping, and hacks the bounty \nhunter's gun in half.\n\nImmediately, the skiff takes another direct hit from the barge's deck \ngun. Shards of skiff deck fly. Chewie and Han are thrown against the \nrail.\n\nHAN\nChewie, you okay? Where is he?\n\nThe Wookiee is wounded and he howls in pain.\n\nHAN\nI'm okay, pal.\n\nFor a moment, Luke is distracted, and in that moment, Boba fires a \ncable out of his armored sleeve. Instantly, Luke is wrapped in a strong \ncable, his arms pinned against his side, his sword arm free only from \nthe wrist down.  Luke bends his wrist so the lightsaber points straight \nup to reach the wire lasso and cuts through. Luke shrugs away the cable \nand stands free.\n\nAnother blast from the Barge's deck gun hits near Boba and he is \nknocked unconscious to the deck, next to where Lando is hanging.\n\nLANDO\nHan! Chewie?\n\nHAN\nLando!\n\nLuke is a little shaken but remains standing as a fusillade brackets \nhim. The second skiff, loaded with guards firing their weapons, moves \nin on Luke fast. Luke leaps toward the incoming second skiff. The young \nJedi leaps into the middle of the second skiff and begins decimating \nthe guards from their midst.\n\nChewie, wounded, tries to lift himself as he barks directions to Han, \nguiding him toward a spear which has been dropped by one of the guards. \nHan searches the deck as Chewie barks directions; finally he grabs hold \nof the spear.\n\nBoba Fett, badly shaken, rises from the deck. He looks over at the \nother skiff, where Luke is whipping a mass of guards. Boba raises his \narm, and aims his lethal appendage.\n\nChewie barks desperately at Han.\n\nHAN\nBoba Fett?! Boba Fett?! Where?\n\nThe space pirate turns around blindly, and the long spear in his hand \nwhacks squarely in the middle of Boba's rocket pack.\n\nThe impact of the swing causes the rocket pack to ignite. Boba blasts \noff, flying over the second skiff like a missile, smashing against the \nside of the huge Sail Barge and sliding away into the pit. He screams \nas his armored body makes its last flight past Lando and directly into \nthe mucous mouth of the Sarlacc. The Sarlacc burps. Chewie growls a \nweak congratulations to Han.\n\n36   INT SAIL BARGE\n\nLeia turns from the spectacle outside, leaps onto Jabba's throne, and \nthrows the chain that enslaves her over his head around his bulbous \nneck. Then she dives off the other side of the throne, pulling the \nchain violently in her grasp. Jabba's flaccid neck contracts beneath \nthe tightening chain. His huge eyes bulge from their sockets and his \nscum-coated tongue flops out. The Exalted Hutt's huge tail spasms \nthrough its death throes and then slams down into final stillness. Leia \nstruggles to free herself of her bondage.\n\n37   EXT SKIFF\n\nLuke continues to destroy the aliens on the guards' skiff, as Han \nextends his spear downward to Lando, who is still dangling precariously \nfrom a rope on the prisoner's skiff.\n\nHAN\nLando, grab it!\n\nLANDO\nLower it!\n\nHAN\nI'm trying!\n\nA major hit from the barge deck gun knocks the skiff on its side. Han \nand almost everything else on board slides overboard. The rope breaks, \nand Lando falls to the side of the Sarlacc pit. Luckily, Han's foot \ncatches on the skiff railing and he dangles above Lando and the pit. \nThe wounded Wookiee holds onto the skiff for dear life as another hit \nfrom the deck gun rocks the skiff violently.\n\nHAN\nWhoa! Whoa! Grab me, Chewie! I'm slipping.\n\nChewie grabs hold of Han's feet, holding him upside down, as Han \nextends the spear toward Lando, who is clutching to the side of the \npit.\n\nHAN\nGrab it! L--Lando. Grab!\n\nLuke finishes off the last guard on the second skiff. He sees the deck \ngun blasting away at his helpless companions. Luke leaps from the \nskiff, across a chasm of air, to the sheer metallic side of the Sail \nBarge. Barely able to get a fingerhold, he begins a painful climb up \nthe hull, when suddenly an ax smashes through a window an inch from his \nhead. With Jedi agility, Luke grasps the wrist holding the ax and yanks \nthe helpless guard through the broken window and into the deadly pit.\n\nThe injured Chewie is reaching over the rail for the dangling Han, who \nis in turn blindly reaching down toward the desperate Lando. The Baron \nhas stopped his slippage down the sandy slope of the Sarlacc pit by \nlying very still. Every time he tries to reach for Han, the loose sand \nmoves him closer to his final reward.\n\nHAN\nGrab it! Almost... You almost got it!\n\nAnother blast hits the front of the tilted skiff, causing Lando to let \ngo of the spear.\n\nLANDO\nHold it! Whoa!\n\nAgain Han extends the spear toward Lando.\n\nHAN\nGently now. All... all right. Now easy, easy. Hold me, Chewie.\n\nLando screams. One of the Sarlacc's tentacles has wrapped tightly \naround his ankle, dragging him down the side of the pit.\n\nHAN\nChewie! Chewie, give me the gun. Don't move, Lando.\n\nLANDO\nNo, wait! I thought you were blind!\n\nHAN\nIt's all right. Trust me. Don't move.\n\nLANDO\nAll right! A little higher! Just a little higher!\n\nHan adjusts his aim as Lando lowers his head, and the fuzzy-eyed pirate \nfires at the tentacle. Direct hit. The tentacle releases Lando, and \nChewie starts to pull them on board the skiff.\n\nHAN\nChewie, Pull us up! Come on! Okay... up, Chewie, up!\n\n38   EXT UPPER DECK\n\nThe deck gunners have Chewie and the desperate dangling human chain in \ntheir gun sights when something up on deck commands their attention: \nLuke, standing before them like a pirate king, ignites his lightsaber. \nThe deck gunners have barely reached for their pistols before the young \nJedi has demolished them. Immediately, Luke turns to see two more \ngunners (who have been uncovering a giant gun at the end of the barge) \nracing for him, firing their laser pistols.\n\n39   INT SAIL BARGE - OBSERVATION DECK\n\nLeia is struggling against her chains in desperation as Artoo zips \nthrough the tumult of confused monsters to the rescue; the stubby \nlittle droid extends a small laser gun and blasts the chain apart.\n\nLEIA\nCome on. We gotta get out of here quick.\n\nArtoo and Leia race for the exit, passing Threepio, who is kicking and \nscreaming as Salacious Crumb, the reptilian monkey- monster picks out \none of the golden droid's eyes.\n\nTHREEPIO\nNot my eyes! Artoo, help! Quickly, Artoo. Oh! Ohhh! You beast!\n\nArtoo zips over and zaps Salacious, sending him skyward with a scream, \ncrashing into the rafters as Artoo, Leia, and Threepio (with his eye \ndangling from a wire) hurry off.\n\n40   EXT UPPER DECK - SAIL BARGE\n\nLuke is warding off laser blasts with his lightsaber, surrounded by \nguards and fighting like a demon. Leia emerges onto the deck as Luke \nturns to face another guard.\n\nLUKE\t (to Leia)\nGet the gun! Point it at the deck!\n\nLeia turns toward the barge cannon, climbs on the platform, and swivels \nthe gun around.\n\nLUKE\nPoint it at the deck!\n\nA laser blast hits Luke's mechanical hand and he bends over in pain, \nbut manages to swing his lightsaber upward and take out the last of the \nguards. He looks at the wounded hand, which reveals the mechanism. He \nflexes the hand; it still works.\n\nNear the rail of the upper deck, Artoo and Threepio steady themselves \nas Threepio gets ready to jump. Artoo beeps wildly.\n\nTHREEPIO\nArtoo, where are we going? I couldn't possibly jump.\n\nArtoo butts the golden droid over the edge and steps off himself, \ntumbling toward the sand.\n\nLuke runs along the empty deck toward Leia and the barge gun, which she \nhas brought around to point down at the deck.\n\nLUKE\nCome on!\n\nLuke has hold on one of the rigging ropes from the mast. He gathers \nLeia in his other arm and kicks the trigger of the deck gun. The gun \nexplodes into the deck as Luke and Leia swing out toward the skiff.\n\n41   EXT SKIFF  \n\nHan leans panting against the rail as Chewie helps Lando onto the deck. \nLuke and Leia land on the skiff with flair.\n\nLUKE\nLet's go! And don't forget the droids.\n\nLANDO\nWe're on our way.\n\nThe Sail Barge is exploding in stages in the distance. Half of the huge \ncraft is on fire.\n\n42   EXT SAND DUNE\n\nThreepio's legs stick straight up from the dune where he landed. Next \nto it, Artoo's periscope is the only thing above the sand. The skiff \nfloats above them and two large electromagnets dangle down on a wire. \nWith a loud CLANG, both droids are pulled \nfrom the sand.\n\n43   EXT DUNE SEA\n\nThe little skiff skips around the burning Sail Barge, which continues \nits chain of explosions. As the skiff sails off across the desert, the \nbarge settles to the sand and disappears in one final conflagration.\n\n44   EXT DUNE SEA - LANDING AREA\n\nA ferocious sandstorm blocks our view. Then, through the ROAR, we HEAR \nTHE VOICES of our heroes. They emerge slowly from the veil of sand, \npressing on against the wind. First come Artoo and Threepio, followed \nby Leia guiding Han, then Luke and Lando come into view, each \nsupporting one side of the towering Chewbacca, who hobbles from his \nwound.\n\nSoon, they can make out some large vague shapes in the blowing sand. It \nis the Millennium Falcon and, parked beside it, Luke's trusty X-wing \nand a two-seated Y-wing. They must shout to be heard.\n\nHAN\nI don't know. All I can see is a lot of blowing sand!\n\nLEIA\nThat's all any of us can see.\n\nHAN\t (blinking)\nThen I guess I'm getting better.\n\nAs soon as the group huddles under the bulk of the Falcon, the wind \ndies down to something more describable as a severe weather condition. \nThreepio hits a switch, and the gang-plank lowers with a HUM.\n\nHAN \t(turning to Luke)\nI've got to hand it to you, kid, you were pretty good out there.\n\nLUKE\t (shrugging it off)\nI had a lot of help. Think nothing of it.\n\nHAN\nNo, I'm thinking a lot about it. That carbon freeze was the closest \nthing to dead there is. And it wasn't just sleepin'. It was a big wide \nawake nothing!\n\nLuke nods, as Chewie growls affectionately at the young Jedi warrior, \nmussing his hair like a proud uncle. And Leia warmly hugs him.\n\nLUKE \t(moving to his ship)\nI'll see you back at the fleet.\n\nHAN\nWhy don't you leave that crate and come with us?\n\nLUKE\nI have a promise I have to keep first... to an old friend.\n\nLuke and Artoo take off in their spacecraft.\n\nHAN\t\t\n(looking dubiously at Lando, obviously remembering his friend's \nbetrayal and subsequent aide)\nGuess I owe you some thanks, too, Lando.\n\nLANDO\nFigured if I left you frozen like that you'd just give me bad luck the \nrest of my life, so I might as well get you unfrozen sooner or later.\n\nLEIA\nHe means \"You're welcome.\"\n\nLANDO\nCome on, let's get off this miserable dust ball.\n\n44A  EXT SPACE ABOVE TATOOINE \n\nThe desolate yellow planet fills the screen, Luke's X-wing appears and \npeels off to the left. A moment later, the FALCON appears as a dot and \ngrows huge, to roar directly over the CAMERA.\n\n45   INT X-WING - COCKPIT\n\nLuke is at the controls, with Artoo attached behind him outside the \ncanopy. Luke speaks into his comlink to the others, in the MILLENNIUM \nFALCON.\n\nLUKE\nI'll meet you back at the fleet.\n\nLEIA\t (over comlink)\nHurry. The Alliance should be assembled by now.\n\nLUKE\nI will.\n\nHAN\t (over comlink)\nHey, Luke, thanks. Thanks for comin' after me. Now I owe you one.\n\nA message from Artoo appears on the small monitor screen in front of \nLuke. He smiles at the monitor and speaks to Artoo, as he pulls a black \nglove on to cover his wounded mechanical hand.\n\nLUKE\nThat's right, Artoo. We're going to the Dagobah system. I have a \npromise to keep... to an old friend.\n\n46   EXT SPACE - DEATH STAR AND ENDOR\n\nA Super Star Destroyer and several ships of the Imperial Fleet rest in \nspace above the half-completed Death Star and its green neighbor, \nEndor. Four squads of TIE fighters escort an Imperial shuttle toward \nthe Death Star.\n\n47   INT DEATH STAR - CORRIDOR TO DOCKING BAY\n\nLord Vader strides down the hallway, accompanied by a very nervous \nDeath Star commander.\n\n48   INT DOCKING BAY - DEATH STAR\n\nThousands of Imperial troops in tight formation fill the mammoth \ndocking bay. Vader and the officer walk to the landing platform, where \nthe shuttle is coming to rest.\n\nThe shuttle's ramp lowers and the Emperor's Royal Guards come out and \ncreate a lethal perimeter. The assembled troops move to rigid attention \nwith a momentous SNAP.\n\nThen, in the huge SILENCE which follows, the EMPEROR appears. He is a \nrather small, shriveled old man. His bent frame slowly makes its way \ndown the ramp with the aid of a gnarled cane. He wears a hooded cloak \nsimilar to the one Ben wears, except that it is black. The Emperor's \nface is shrouded and difficult to see, except for his piercing yellow \neyes. Commander Jerjerrod and Darth Vader kneel to him. The Supreme \nRuler of the galaxy beckons to the Dark Lord.\n\nEMPEROR\t (to Vader)\nRise, my friend.\n\nVader rises and falls in next to the Emperor as he slowly makes his way \nalong the rows of troops. Jerjerrod and the other commanders stay \nkneeling until the Supreme Ruler and Vader, followed by several \nImperial dignitaries, pass by; only then do they join in the \nprocession.\n\nVADER\nThe Death Star will be completed on schedule.\n\nEMPEROR\nYou have done well, Lord Vader. And now I sense you wish to continue \nyour search for young Skywalker.\n\nVADER\nYes, my Master.\n\nEMPEROR\nPatience, my friend. In time he will seek you out. And when he does, \nyou must bring him\nbefore me. He has grown strong. Only together can we turn him to the \ndark side of the\nForce.\n\nVADER\nAs you wish.\n\nEMPEROR\nEverything is proceeding as I have foreseen.\n\nHe laughs to himself as they pass along the vast line of Imperial \ntroops.\n\n49   EXT YODA'S HOUSE - DAGOBAH\n\nOnce again, Artoo finds himself waiting around in the damp environs of \nthe swamp planet, and he's none too happy about it. He beeps \ndisconsolately to himself and turns to look at Yoda's cottage. Warm \nyellow light escapes the oddly shaped windows to fight the gloom.\n\n50   INT YODA'S HOUSE\n\nThe tip of a walking stick taps hesitantly across the earthen floor of \nthe cottage. Our view travels up the stick to the small green hand that \nclutches it, and then to the familiar face of YODA, THE JEDI MASTER. \nHis manner is frail, and his voice, though cheerful, seems weaker.\n\nYODA\nHmm. That face you make. Look I so old to young eyes?\n\nLuke is sitting in a corner of the cramped space and, indeed, his look \nhas been woeful. Caught, he tries to hide it.\n\nLUKE\nNo... of course not.\n\nYODA\t (tickled, chuckles)\nI do, yes, I do!  Sick have I become. Old and weak. \n(Points a crooked finger)\nWhen nine hundred years old you reach, look as good you will not. Hmm?\n\nYoda chuckles at this, coughs, and hobbles over toward his bed.\n\nYODA\nSoon will I rest. Yes, forever sleep. Earned it, I have.\n\nYoda sits himself on his bed, with great effort.\n\nLUKE\nMaster Yoda, you can't die.\n\nYODA\nStrong am I with the Force... but not that strong! Twilight is upon me \nand soon night must fall. That is the way of things... the way of the \nForce.\n\nLUKE\nBut I need your help. I've come back to complete the training.\n\nYODA\nNo more training do you require. Already know you that which you need.\n\nYoda sighs, and lies back on his bed.\n\nLUKE\nThen I am a Jedi?\n\nYODA\t (shakes his head)\nOhhh. Not yet. One thing remains: Vader. You must confront Vader. Then, \nonly then, a Jedi will you be. And confront him you will.\n\nLuke is in agony. He is silent for a long moment, screwing up his \ncourage. Finally he is able to ask.\n\nLUKE\nMaster Yoda... is Darth Vader my father?\n\nYoda's eyes are full of weariness and compassion. An odd, sad smile \ncreases his face. He turns painfully on his side, away from Luke.\n\nYODA\nMmm... rest I need. Yes... rest.\n\nLuke watches him, each moment an eternity.\n\nLUKE\nYoda, I must know.\n\nYODA\nYour father he is.\n\nLuke reacts as if cut.\n\nYODA\nTold you, did he?\n\nLUKE\nYes.\n\nA new look of concern crosses Yoda's face.  He closes his eyes.\n\nYODA\nUnexpected this is, and unfortunate...\n\nLUKE\nUnfortunate that I know the truth?\n\nYoda opens his eyes again and studies the youth.\n\nYODA\t\t (gathering all his strength)\nNo. Unfortunate that you rushed to face him... that incomplete was your \ntraining. Not\nready for the burden were you.\n\nLUKE\nWell, I'm sorry.\n\nYODA\nRemember, a Jedi's strength flows from the Force.  But beware.  Anger, \nfear, aggression.\nThe dark side are they.  Once you start down the dark path, forever \nwill it dominate your\ndestiny.\n\nHe beckons the young Jedi closer to him.\n\nYODA\nLuke...Luke...Do not...Do not underestimate the powers of the Emperor, \nor suffer your father's fate, you will. Luke, when gone am I\n(cough),\nthe last of the Jedi will you be. Luke, the Force runs strong in your \nfamily. Pass on what you have learned, Luke... \n(with great effort)\nThere is...another...Sky...Sky...walker.\n\nHe catches his breath. A shiver runs through the ancient green \ncreature, and he dies. Luke stares at his dead master as he disappears \nin front of his eyes.\n\n51   EXT DAGOBAH SWAMP - X-WING \n\nLuke wanders back to where his ship is sitting. Artoo beeps a greeting, \nbut is ignored by his depressed master. Luke kneels down, begins to \nhelp Artoo with the ship, then stops and shakes his head dejectedly.\n\nLUKE\nI can't do it, Artoo. I can't go on alone.\n\nBEN\t (OS)\nYoda will always be with you.\n\nLuke looks up to see the shimmering image of BEN KENOBI.\n\nLUKE\nObi-Wan! Why didn't you tell me?\n\nThe ghost of Ben Kenobi approaches him through the swamp.\n\nLUKE\nYou told me Vader betrayed and murdered my father.\n\nBEN\nYou father was seduced by the dark side of the Force. He ceased to be \nAnakin Skywalker\nand became Darth Vader. When that happened, the good man who was your \nfather was destroyed. So what I have told you was true... from a \ncertain point of view.\n\nLUKE\t (turning away, derisive)\nA certain point of view!\n\nBEN\nLuke, you're going to find that many of the truths we cling to depend \ngreatly on our own\npoint of view.\n\nLuke is unresponsive. Ben studies him in silence for a moment.\n\nBEN\nI don't blame you for being angry. If I was wrong in what I did, it \ncertainly wouldn't have been for the first time. You see, what happened \nto your father was my fault.\n\nBen pauses sadly.\n\nBEN\nAnakin was a good friend.\n\nLuke turns with interest at this. As Ben speaks, Luke settles on a \nstump, mesmerized. Artoo comes over to offer his comforting presence.\n\nBEN\nWhen I first knew him, your father was already a great pilot. But I was \namazed how strongly the Force was with him. I took it upon myself to \ntrain him as a Jedi. I thought that I could instruct him just as well \nas Yoda. I was wrong. My pride has had terrible consequences for the \ngalaxy.\n\nLuke is entranced.\n\nLUKE\nThere's still good in him.\n\nBEN\nI also thought he could be turned back to the good side. It couldn't be \ndone. He is more machine now than man. Twisted and evil.\n\nLUKE\nI can't do it, Ben.\n\nBEN\nYou cannot escape your destiny.\n\nLUKE\nI tried to stop him once. I couldn't do it.\n\nBEN\nVader humbled you when first you met him, Luke... but that experience \nwas part of your training. It taught you, among other things, the value \nof patience. Had you not been so impatient to defeat Vader then, you \ncould have finished your training here with Yoda. You would have been \nprepared.\n\nLUKE\nBut I had to help my friends.\n\nBEN\t (grinning at Luke's indignation)\nAnd did you help them? It was they who had to save you. You achieved \nlittle by rushing back prematurely, I fear.\n\nLUKE\t (with sadness)\nI found out Darth Vader was my father.\n\nBEN\nTo be a Jedi, Luke, you must confront and then go beyond the dark side \n- the side your father couldn't get past. Impatience is the easiest \ndoor - for you, like your father. Only, your father was seduced by what \nhe found on the other side of the door, and you have held firm. You're \nno longer so reckless now, Luke. You are strong and patient. And now, \nyou must face Darth Vader again!\n\nLUKE\nI can't kill my own father.\n\nBEN\nThen the Emperor has already won. You were our only hope.\n\nLUKE\nYoda spoke of another.\n\nBEN\nThe other he spoke of is your twin sister.\n\nLUKE\nBut I have no sister.\n\nBEN\nHmm. To protect you both from the Emperor, you were hidden from your \nfather when you were born. The Emperor knew, as I did, if Anakin were \nto have any offspring, they would be a threat to him. That is the \nreason why your sister remains safely anonymous.\n\nLUKE\nLeia! Leia's my sister.\n\nBEN\nYour insight serves you well. Bury your feelings deep down, Luke. They \ndo you credit.\nBut they could be made to serve the Emperor.\n\nLuke looks into the distance, trying to comprehend all this.\n\nBEN\t (continuing his narrative)\nWhen your father left, he didn't know your mother was pregnant. Your \nmother and I knew he would find out eventually, but we wanted to keep \nyou both as safe as possible, for as long as possible.  So I took you \nto live with my brother Owen on Tatooine... and your mother took Leia \nto live as the daughter of Senator Organa, on Alderaan.\n\nLuke turns, and settles near Ben to hear the tale.\n\nBEN\t (attempting to give solace with his words)\nThe Organa household was high-born and politically quite powerful in \nthat system. Leia became a princess by virtue of lineage... no one knew \nshe'd been adopted, of course. But it was a title without real power, \nsince Alderaan had long been a democracy.  Even so, the family \ncontinued to be politically powerful, and Leia, following in her foster \nfather's path, became a senator as well.  That's not all she became, of \ncourse... she became the leader of her cell in the Alliance against the \ncorrupt Empire. And because she had diplomatic immunity, she was a \nvital link for getting information to the Rebel cause.  That's what she \nwas doing when her path crossed yours... for her foster parents had \nalways told her to contact me on Tatooine, if her troubles became \ndesperate.\n\nLuke is overwhelmed by the truth, and is suddenly protective of his \nsister.\n\nLUKE\nBut you can't let her get involved now, Ben. Vader will destroy her.\n\nBEN\nShe hasn't been trained in the ways of the Jedi the way you have, \nLuke... but the Force is strong with her, as it is with all of your \nfamily. There is no avoiding the battle. You must face and destroy \nVader!\n\n52   EXT SPACE - REBEL FLEET\n\nThe vast Rebel Fleet stretches as far as the eye can see. Overhead a \ndozen small Corellian battleships fly in formation. Fighters and \nbattlecruisers surround the largest of the Rebel Star Cruisers, the \nHEADQUARTERS FRIGATE.\n\n53   INT HEADQUARTERS FRIGATE - MAIN BRIEFING ROOM\n\nHundreds of Rebel commanders of all races and forms are assembled in \nthe WAR ROOM. WEDGE is among them. In the center of the room is a \nholographic model depicting the half-completed Imperial Death Star, the \nnearby Moon of Endor, and the protecting deflector shield.\n\nMON MOTHMA, the leader of the Alliance, enters the room. She is a stern \nbut beautiful woman in her fifties. Conferring with her are several \nmilitary leaders, including GENERAL MADINE and ADMIRAL ACKBAR (a \nsalmon-colored Mon Calamari). Lando moves through the crowd until he \nfinds Han and Chewie, standing next to Leia and the two droids.\n\nHan peers at Lando's new insignia on his chest, and is amused.\n\nHAN\nWell, look at you, a general, huh?\n\n LANDO\n Oh, well, someone must have told them about my little maneuver at the \nbattle of Taanab.\n\nHAN\t (sarcastic)\nWell, don't look at me, pal. I just said you were a fair pilot. I \ndidn't know they were\nlookin' for somebody to lead this crazy attack.\n\nLANDO\t (smiling)\nI'm surprised they didn't ask you to do it.\n\nHAN\nWell, who says they didn't.  But I ain't crazy. You're the respectable \none, remember?\n\nMon Mothma signals for attention, and the room falls silent.\n\nMON MOTHMA\nThe Emperor has made a critical error and the time for our attack has \ncome.\n\nThis causes a stir. Mon Mothma turns to a holographic model of the \nDeath Star, the Endor moon and the protecting deflector shield in the \ncenter of the room.\n\nMON MOTHMA\nThe data brought to us by the Bothan spies pinpoints the exact location \nof the Emperor's new battle station. We also know that the weapon \nsystems of this Death Star are not yet operational. With the Imperial \nFleet spread throughout the galaxy in a vain effort to engage us, it is \nrelatively unprotected. But most important of all, we've learned that \nthe Emperor himself is personally overseeing the final stages of the \nconstruction of this Death Star.\n\nA volley of spirited chatter erupts from the crowd. Han turns to Leia \nas Chewie barks his amazement.\n\nMON MOTHMA\t (cont)\nMany Bothans died to bring us this information. Admiral Ackbar, please.\n\nAdmiral Ackbar steps forward and points to the Death Star's force field \nand the Moon of Endor.\n\nACKBAR\nYou can see here the Death Star orbiting the forest Moon of Endor. \nAlthough the weapon\nsystems on this Death Star are not yet operational, the Death Star does \nhave a strong defense mechanism. It is protected by an energy shield, \nwhich is generated from the nearby forest Moon of Endor. The shield \nmust be deactivated if any attack is to be attempted. Once the shield \nis down, our cruisers will create a perimeter, while the fighters fly \ninto the superstructure and attempt to knock out the main reactor.\n\nThere's a concerned murmur.\n\nACKBAR\t (cont)\nGeneral Calrissian has volunteered to lead the fighter attack\n\nHan turns to Lando with a look of respect.\n\nHAN\nGood luck.\n\nLando nods his thanks.\n\nHAN\nYou're gonna need it.\n\nACKBAR\nGeneral Madine.\n\nMadine moves center stage.\n\nGENERAL MADINE\nWe have stolen a small Imperial shuttle. Disguised as a cargo ship, and \nusing a secret\nImperial code, a strike team will land on the moon and deactivate the \nshield generator.\n\nThe assembly begins to mumble among themselves.\n\nTHREEPIO\nSounds dangerous.\n\nLEIA\t (to Han)\nI wonder who they found to pull that off.\n\nGENERAL MADINE\nGeneral Solo, is your strike team assembled?\n\nLeia, startled, looks up at Han, surprise changing to admiration.\n\nHAN\nUh, my team's ready. I don't have a command crew for the shuttle.\n\nChewbacca raises his hairy paw and volunteers.  Han looks up at him.\n\nHAN\nWell, it's gonna be rough, pal. I didn't want to speak for you.\n\nChewie waves that off with a huge GROWL.\n\nHAN\t (smiles)\nThat's one.\n\nLEIA\nUh, General... count me in.\n\nVOICE\t (OS)\nI'm with you, too!\n\nThey turn in that direction and peer into the crowd as there are more \ncheers. The commanders part, and there at the back stands Luke. Han and \nLeia are surprised and delighted.\n\nLeia moves to Luke and embraces him warmly. She senses a change in him \nand looks into his eyes questioningly.\n\nLEIA\n What is it?\n\nLUKE\t (hesitant)\nAsk me again sometime.\n\nHan, Chewie, and Lando crowd around Luke as the assembly breaks up.\n\nHAN\nLuke.\n\nLUKE\nHi, Han... Chewie.\n\nArtoo beeps a singsong observation to a worried Threepio.\n\n THREEPIO\n\"Exciting\" is hardly the word I would use.\n\n54   INT HEADQUARTERS FRIGATE - MAIN DOCKING BAY\n\nThe Millennium Falcon rests beyond the stolen IMPERIAL SHUTTLE, which \nlooks anomalous among all the Rebel ships in the vast docking bay. \nChewie barks a final farewell to Lando and leads Artoo and Threepio up \nthe shuttle, crowded now with the Rebel strike team loading weapons and \nsupplies. Lando turns to face Han. Luke and Leia have said their good-\nbyes and start up the ramp.\n\nHAN\nLook. I want you to take her. I mean it. Take her. You need all the \nhelp you can get. She's\nthe fastest ship in the fleet.\n\nLANDO\nAll right, old buddy. You know, I know what she means to you. I'll take \ngood care of her.\nShe-she won't get a scratch. All right?\n\nHAN\t (looks at him warmly)\nRight. I got your promise now. Not a scratch.\n\nLANDO\nLook, would you get going, you pirate.\n\nHan and Lando pause, then exchange salutes.\n\nLANDO\nGood luck.\n\nHAN\nYou, too.\n\nHan goes up the ramp. Lando watches him go and then slowly turns away.\n\n55   INT IMPERIAL SHUTTLE - COCKPIT\n\nLuke is working on a back control panel as Han comes in and takes the \npilot's seat. Chewie, in the seat next to him, is trying to figure out \nall the Imperial controls.\n\nHAN\nYou got her warmed?\n\nLUKE\nYeah, she's comin' up.\n\nChewie growls a complaint.\n\nHAN\nNo. I don't think the Empire had Wookiees in mind when they designed \nher, Chewie.\n\nLeia comes in from the hold and takes her seat near Luke.\n\nChewie barks and hits some switches. Han's glance has stuck on \nsomething out the window: the Millennium Falcon. Leia nudges him \ngently.\n\nLEIA\nHey, are you awake?\n\nHAN\nYeah, I just got a funny feeling. Like I'm not gonna see her again.\n\nChewie, hearing this, stops his activity and looks longingly out at the \nFalcon, too. Leia puts a hand on Han's shoulder.\n\nLEIA\t (softly)\nCome on, General, let's move.\n\nHan snaps back to life.\n\nHAN\nRight. Chewie, let's see what this piece of junk can do. Ready, \neverybody?\n\nLUKE\nAll set.\n\nTHREEPIO\nHere we go again.\n\nHAN\nAll right, hang on.\n\n56   EXT SPACE - THE REBEL FLEET\n\nThe stolen Imperial shuttle leaves the main docking bay of the \nHeadquarters Frigate, lowers its wings into flight position, and zooms \noff into space.\n\n57   INT EMPEROR'S THRONE ROOM\n\nThe converted control room is dimly lit, except for a pool of light at \nthe far end. There the Emperor sits in an elaborate control chair \nbefore a large window which looks out across the half-completed Death \nStar to the giant green moon of Endor.\n\nDarth Vader, standing with other members of the Imperial council, \ncautiously approaches his master. The ruler's back is to Vader. After \nseveral tense moments, the Emperor's chair rotates around to face him.\n\nVADER\nWhat is thy bidding, my Master?\n\nEMPEROR\nSend the fleet to the far side of Endor. There it will stay until \ncalled for.\n\nVADER\nWhat of the reports of the Rebel fleet massing near Sullust?\n\nEMPEROR\nIt is of no concern. Soon the Rebellion will be crushed and young \nSkywalker will be one of us! Your work here is finished, my friend. Go \nout to the command ship and await my orders.\n\nVADER\nYes, my Master.\n\nVader bows, then turns and exits the throne room as the Emperor walks \ntoward the waiting council members.\n\n58   EXT SPACE - DEATH STAR - MOON\n\nThere is a great deal of Imperial traffic in the area as construction \nproceeds on the Death Star. Transports, TIE fighters, and a few Star \nDestroyers move about. Now the huge Super Star Destroyer announces \nitself with a low roar and soon fills the frame.\n\n59   INT STOLEN IMPERIAL SHUTTLE - COCKPIT\n\nHan looks back at Luke and Leia as Chewie flips several switches. \nThrough the viewscreen, the Death Star and the huge Super Star \nDestroyer can be seen.\n\nHAN\nIf they don't go for this, we're gonna have to get outta here pretty \nquick, Chewie.\n\nChewie growls his agreement.\n\nCONTROLLER\t (over radio)\nWe have you on our screen now. Please identify.\n\nHAN\nShuttle Tydirium requesting deactivation of the deflector shield.\n\nCONTROLLER\t (over radio)\nShuttle Tydirium, transmit the clearance code for shield passage.\n\nHAN\nTransmission commencing.\n\nLeia and Chewbacca listen tensely as the sound of a high speed \ntransmission begins.\n\nLEIA\nNow we find out if that code is worth the price we paid.\n\nHAN\nIt'll work. It'll work.\n\nChewie whines nervously. Luke stares at the Huge Super Star Destroyer \nthat looms ever larger before them.\n\nLUKE\nVader's on that ship.\n\nHAN\nNow don't get jittery, Luke. There are a lot of command ships. Keep \nyour distance though, Chewie, but don't look like you're trying to keep \nyour distance.\n\nChewie barks a question.\n\nHAN\nI don't know.  Fly casual.\n\nLUKE\nI'm endangering the mission. I shouldn't have come.\n\nHAN\nIt's your imagination, kid. Come on. Let's keep a little optimism here.\n\nChewie barks his worries as the Super Star Destroyer grows larger out \nthe window.\n\n60   INT VADER'S STAR DESTROYER - BRIDGE\n\nLord Vader stands, back to us, staring out a window at the Death Star. \nNow, some vibration felt only by him causes him to turn. After a moment \nof stillness, he walks down the row of controllers to where ADMIRAL \nPIETT is leaning over the tracking screen of the controller we've seen \nearlier. Piett straightens at Vader's approach.\n\nVADER\nWhere is that shuttle going?\n\nPIETT\t (into comlink)\nShuttle Tydirium, what is your cargo and destination?\n\nPILOT VOICE    (HAN)   (filtered)\nParts and technical crew for the forest moon.\n\nThe Bridge Commander looks to Vader for a reaction.\n\nVADER\nDo they have a code clearance?\n\nPIETT\nIt's an older code, sir, but it checks out. I was about to clear them.\n\nVader looks upward, as he senses Luke's presence.\n\nPIETT\nShall I hold them?\n\nVADER\nNo. Leave them to me. I will deal with them myself.\n\nPIETT\t (surprised)\nAs you wish, my lord.\n(to controller)\nCarry on.\n\nPiett nods at controller, who switches on his comlink.\n\n61   INT STOLEN IMPERIAL SHUTTLE - COCKPIT\n\nThe group waits tensely.\n\nHAN\nThey're not goin' for it, Chewie.\n\nCONTROLLER\t (filtered)\nShuttle Tydirium, deactivation of the shield will commence immediately. \nFollow your\npresent course.\n\nEveryone breaths a sigh of relief. Everyone but Luke, who looks \nworried. Chewie barks.\n\nHAN\nOkay! I told you it was gonna work. No problem.\n\n62   EXT SPACE - STOLEN IMPERIAL SHUTTLE - ENDOR\n\nThe stolen Imperial shuttle moves off toward the green Sanctuary Moon.\n\n63   EXT FOREST LANDING SITE - ENDOR\n\nThe stolen Imperial shuttle sits in a clearing of the moon's dark, \nprimeval forest, dwarfed by the ancient towering trees.\n\nOn an adjacent hill, the helmeted Rebel contingent makes its way up a \nsteep trail. Leia and Han are slightly ahead of Chewie and Luke. The \ntroops of the strike-team squad follow, with Artoo and Threepio \nbringing up the rear. Artoo beeps.\n\nUp ahead, Chewie and Leia reach a crest in the hill and drop suddenly \nto the ground, signaling the rest of the group to stop. Han and Luke \ncrawl up to take a look.\n\nTHREEPIO\nOh, I told you it was dangerous here.\n\nTHEIR POV. Not far below them, two IMPERIAL SCOUTS are wandering \nthrough bushes in the valley below. Their two ROCKET BIKES are parked \nnearby.\n\nLEIA\nShall we try and go around?\n\nHAN\nIt'll take time. This whole party'll be for nothing if they see us.\n\nLeia motions for the squad to stay put, then she, Han, Luke and Chewie \nstart quietly down.\n\n64   EXT FOREST CLEARING - CAMPSITE\n\nThe four friends make their way to the edge of the clearing not far \nfrom the two Imperial scouts.\n\nHAN\nChewie and I will take care of this. You stay here.\n\nLUKE\nQuietly, there might be more of them out there.\n\nHAN\t (grins)\nHey... it's me.\n\nHan and Chewie turn and start through the bushes toward the scouts. \nLuke and Leia exchange smiles.\n\nHan sneaks up behind one of the scouts, steps on a twig and the scout \nwhirls, knocking Han into a tree. The scout shouts for his companion.\n\nSCOUT #1\nGo for help! Go!\n\nThe second scout jumps on his speeder bike and takes off, but Chewie \ngets off a shot on his crossbow laser weapon, causing the scout to \ncrash into a tree. Han and Scout #1 are in a rousing fistfight.\n\nLUKE\t (sarcastic)\nGreat. Come on.\n\nLuke starts for the scuffle, followed by Leia with her laser pistol \ndrawn. As they run through the bushes, Leia stops and points to where \ntwo more scouts are sitting on their speeder bikes, with an unoccupied \nbike parked nearby.\n\nLEIA\nOver there! Two more of them!\n\nLUKE\nI see them. Wait, Leia!\n\nBut Leia doesn't hear him and races for the remaining speeder bike. She \nstarts it up and takes off as Luke jumps on the bike behind her.\n\nLUKE\t (pointing to the controls)\nQuick! Jam their comlink. Center switch!\n\nLuke and Leia speed into the dense foliage in hot pursuit, barely \navoiding two huge trees.\n\nHAN\nHey, wait! Ahhh!\n\nHe flips the remaining scout to the ground.\n\n65   EXT FOREST - THE BIKE CHASE\n\nThe two fleeing Imperial scouts have a good lead as Luke and Leia \npursue through the giant trees at 200 miles an hour, the fire from \ntheir bike's laser cannon hitting harmlessly near the moving targets.\n\nLUKE\nMove closer!\n\nLeia guns it, closing the gap, as the two scouts recklessly veer \nthrough a narrow gap in the trees. One of the bikes SCRAPES a tree, \nslowing the scout.\n\nLUKE\nGet alongside that one!\n\nLeia pulls her speeder bike up so close to the scout's bike that their \nsteering vanes SCRAPE noisily. Luke leaps from his bike to the back of \nthe scout's, grabs the Imperial warrior around the neck, and flips him \noff the bike, into a thick tree trunk. Luke gains control of the bike \nand follows Leia, who has pulled ahead. They tear off after the \nremaining scout.\n\nLUKE\nGet him!\n\nThe speeding chase passes TWO MORE IMPERIAL SCOUTS. These two swing \ninto pursuit, chasing Luke and Leia, firing away with their laser \ncannon. The two Rebels look behind them just as Luke's bike takes a \nglancing hit.\n\nLUKE\t (indicating the one ahead)\nKeep on that one! I'll take these two!\n\nWith Leia shooting ahead, Luke suddenly slams his steering vanes into \nthe braking mode. Luke's bike is a blur to the two pursuing scouts as \nthey zip by him on either side. Luke slams his bike into forward and \nstarts firing away, having switched places with his pursuers in a \nmanner of seconds. Luke's aim is good and one scout's bike is blasted \nout of control. It explodes against a tree trunk.\n\nThe scout's cohort takes one glance back at the flash and shifts into \nturbo drive, going even faster. Luke keeps on his tail.\n\nFAR AHEAD, Leia and the first scout are doing a highspeed slalom \nthrough the death-dealing trunks. Now Leia aims her bike skyward and \nrises out of sight.\n\nThe scout turns in confusion, unable to see his pursuer. Suddenly, Leia \ndives down upon him from above, cannon blasting. The scout's bike takes \na glancing hit.\n\nLeia moves in alongside him. The scout eyes her beside him, reaches \ndown, and pulls out a handgun. Before Leia can react, the scout has \nblasted her bike, sending it out of control. Leia dives off as her bike \nexplodes against a tree. The happy scout looks back at the explosion. \nBut when he turns forward again, he is on a collision course with a \ngiant fallen tree. He hits his brakes to no avail and disappears in a \nconflagration.\n\nANOTHER PART OF THE FOREST: Luke and the last remaining scout continue \ntheir weaving chase through the trees. Now Luke moves up close. The \nscout responds by slamming his bike into Luke's. A fallen tree forms a \nbridge across their path. The scout zips under. Luke goes over the top \nand crashes his bike down on the scout's. Both riders look ahead - a \nwide trunk looms directly in Luke's path, but the scout's bike beside \nhim makes it almost impossible for him to avoid it. Luke banks with all \nhis might, leaning almost horizontal over the scout's bike, and is able \nto make it by, just clipping the tree. When he straightens, he and the \nscout discover that their two bikes have locked front vanes and are \nmoving as one.\n\nAnother big tree looms in Luke's path. He reacts instinctively and \ndives off his bike. The two bikes come apart a second before Luke's \nexplodes against a tree. The scout sweeps out and circles back to find \nLuke.\n\nLuke rises from the undergrowth as the scout bears down on him and \nopens fire with his laser cannon. Luke ignites his laser sword and \nbegins deflecting the bolts. The scout's bike keeps coming and it \nappears that in a second it will cut Luke in half. At the last instant, \nLuke steps aside and chops off the bike's control vanes with one mighty \nslash. The scout's bike begins to shudder, then, pitching and rolling, \nit rises up to slam directly into a tree in a giant ball of fire.\n\n66   EXT SCOUT CAMPSITE - FOREST\n\nHan, Chewie, and the droids, along with the rest of the squad, wait \nanxiously in the clearing. Artoo's radar screen sticks out of his domed \nhead and revolves, scanning the forest. He beeps.\n\nTHREEPIO\nOh, General Solo, somebody's coming. Oh!\n\nHan, Chewie, and the rest of the squad raise their weapons.\n\nLuke steps out of the foliage to find the weapons trained on him. He's \ntoo tired to care. He plops himself down on a boulder and looks around.\n\nHAN\nLuke! Where's Leia?\n\nLUKE\t (concerned)\nWhat? She didn't come back?\n\nHAN\nI thought she was with you.\n\nLUKE\nWe got separated.\n\nLuke and Han exchange a silent, grim look. Luke gets up wearily.\n\nLUKE\nHey, we better go look for her.\n\nHan nods, and signals to a Rebel officer.\n\nHAN\nTake the squad ahead.  We'll meet at the shield generator at 0300.\n\nLUKE\nCome on, Artoo.  We'll need your scanners.\n\nLuke, Chewie, Han, and the droids move off in one direction as the \nsquad proceeds in another.\n\nTHREEPIO\nDon't worry, Master Luke.  We know what to do.\n\nThey move off into the woods.\n\nTHREEPIO\t (to Artoo)\nAnd you said it was pretty here. Ugh!\n\n67   EXT FOREST CLEARING - LEIA'S CRASH SITE\n\nA strange little furry face with huge black eyes comes slowly into \nview. The creature is an EWOK, by the name of WICKET. He seems somewhat \npuzzled, and prods Leia with a spear. The princess groans; this \nfrightens the stubby ball of fuzz and he prods her again. Leia sits up \nand stares at the three-foot-high Ewok. She tries to figure out where \nshe is and what has happened. Her clothes are torn; she's bruised and \ndisheveled.\n\nThe Ewok jumps up and grabs a four-foot-long spear, which he holds in a \ndefensive position. Leia watches him as he circles warily and begins \npoking her with the sharp point of the spear.\n\nLEIA\nCut it out!\n\nShe stands up, and the Ewok quickly backs away.\n\nLEIA\nI'm not gonna hurt you.\n\nLeia looks around at the dense forest, and at the charred remains of \nher speeder bike, then sits down, with a sigh, on a fallen log.\n\nLEIA\nWell, looks like I'm stuck here. Trouble is, I don't know where here \nis.\n\nShe puts her head in her hands to rub away some of the soreness from \nher fall. She looks over at the watchful little Ewok and pats the log \nbeside her.\n\nLEIA\nWell, maybe you can help me. Come on, sit down.\n\nWicket holds his spear up warily and growls at her like a puppy. Leia \npats the log again.\n\nLEIA\nI promise I won't hurt you. Now come here.\n\nMore growls and squeaks from the little bear creature.\n\nLEIA\nAll right. You want something to eat?\n\nShe takes a scrap of food out of her pocket and offers it to him. \nWicket takes a step backward, then cocks his head and moves cautiously \ntoward Leia, chattering in his squeaky Ewok language.\n\nLEIA\nThat's right. Come on. Hmmm?\n\nSniffing the food curiously, the Ewok comes toward Leia and sits on the \nlog beside her. She takes off her helmet, and the little creature jumps \nback, startled again. He runs along the log, pointing his spear at her \nand chattering a blue streak. Leia holds out the helmet to him.\n\nLEIA\nLook, it's a hat. It's not gonna hurt you. Look. You're a jittery \nlittle thing, aren't you?\n\nReassured, Wicket lowers his spear and climbs back on the log, coming \nto investigate the helmet. Suddenly his ears perk up and he begins to \nsniff the air. He looks around warily, whispering some Ewokese warning \nto Leia.\n\nLEIA\nWhat is it?\n\nSuddenly a laser bolt comes out of the foliage and explodes on the log \nnext to Leia. Leia and Wicket both roll backwards off the log, hiding \nbehind it. Leia holds her own laser gun ready, while Wicket disappears \nunderneath the log. Another shot, and still no sight of anyone in the \nforest. Then Leia senses something and turns to find a large IMPERIAL \nSCOUT standing over her with his weapon pointed at her head. He reaches \nout his hand for her weapon.\n\nSCOUT #l\nFreeze!  Come on, get up!\n\nShe hands the weapon over, as a second scout emerges from the foliage \nin front of the log.\n\nSCOUT #1\nGo get your ride and take her back to base.\n\nSCOUT #2\nYes, sir.\n\nThe second scout starts toward his bike, as Wicket, crouched under the \nlog, extends his spear and hits the first scout on the leg. The scout \njumps and lets out an exclamation, and looks down at Wicket, puzzled. \nLeia grabs a branch and knocks him out. She dives for his laser pistol, \nand the second scout, now on his bike, takes off. Leia fires away and \nhits the escaping bike, causing it to crash into the first scout's \nbike, which flies end over end and explodes. The forest is quiet once \nmore. Wicket pokes his fuzzy head up from behind the log and regards \nLeia withÊnew respect. He mumbles his awe. Leia hurries over, looking \naround all the time, and motions the chubby little creature into the \ndense foliage.\n\nLEIA\nCome on, let's get outta here.\n\nAs they move into the foliage, Wicket takes the lead. He shrieks and \ntugs at Leia to follow him.\n\n68   INT DEATH STAR - CORRIDOR TO EMPEROR'S TOWER\n\nDarth Vader walks down the corridor to the Emperor's Tower and private \nelevator. The Emperor's private guard steps in Vader's path.\n\nGUARD\nHalt! The Emperor does not wish to be disturbed at the moment.\n\nVADER        \n(raising his gloved hand to the two guards and choking them with the \nForce)\nThe Emperor will see me, now!\n\nGUARD\n(repeating Vader's command)\nThe Emperor will see you, now.\n\n69   INT EMPEROR'S TOWER - THRONE ROOM\n\nTwo red Imperial Guards stand watch at the elevator as the door opens \nto reveal Vader. Vader enters the eerie, foreboding throne room. It \nappears to be empty. His footsteps echo as he approaches the throne. He \nwaits, absolutely still. The Emperor sits with his back to the Dark \nLord.\n\nEMPEROR\nI told you to remain on the command ship.\n\nVADER\nA small Rebel force has penetrated the shield and landed on Endor.\n\nEMPEROR\t (no surprise)\nYes, I know.\n\nVADER\t (after a beat)\nMy son is with them.\n\nEMPEROR\t (very cool)\nAre you sure?\n\nVADER\nI have felt him, my Master.\n\nEMPEROR\nStrange, that I have not. I wonder if your feelings on this matter are \nclear, Lord\nVader.\n\nVader knows what is being asked.\n\nVADER\nThey are clear, my Master.\n\nEMPEROR\nThen you must go to the Sanctuary Moon and wait for them.\n\nVADER\t (skeptical)\nHe will come to me?\n\nEMPEROR\nI have foreseen it. His compassion for you will be his undoing. He will \ncome to you and\nthen you will bring him before me.\n\nVADER\t (bows)\nAs you wish.\n\nThe Dark Lord strides out of the throne room.\n\n70   EXT FOREST CLEARING - LEIA'S CRASH SITE\n\nHan, Luke, Chewie, and the two droids are spread out as they move \nthrough the heavy foliage near the clearing where we last saw Leia. \nLuke finds Leia's helmet, picks it up with an expression of concern.\n\nHAN\t (OS)\nLuke! Luke!\n\nLuke runs with the helmet to where Han has found the charred wreckage \nof a speeder bike in the grass.\n\nTHREEPIO\nOh, Master Luke.\n\nLUKE\nThere's two more wrecked speeders back there. And I found this.\n\nHe tosses the helmet to Han.\n\nTHREEPIO\nI'm afraid that Artoo's sensors can find no trace of Princess Leia.\n\nHAN\t (gravely)\nI hope she's alright.\n\nChewbacca growls, sniffing the air, then, with a bark, pushes off \nthrough the foliage.\n\n                              HAN\nWhat, Chewie? What? Chewie!\n\nThe others rush to keep up with the giant Wookiee. As he scoots along, \nArtoo whistles nervously.\n\n71   EXT FOREST - DENSE FOLIAGE\n\nThe group has reached a break in the undergrowth. Chewie walks up to a \ntall stake planted in the ground. There is a dead animal hanging from \nit.\n\nHAN\nHey, I don't get it.\n\nThe rest of the group joins the Wookiee around the stake.\n\nHAN\t (cont)\nNah, it's just a dead animal, Chewie.\n\nChewie can't resist. He reaches toward the meat.\n\nLUKE\nChewie, wa-wait!  Don't!\n\nToo late. The Wookiee has already pulled the animal from the stake. \nSPROOING! The group finds itself hanging upside down in an Ewok net, \nsuspended high above the clearing. Artoo lets out a wild series of \nbeeps and whistles, and Chewie howls his regret. Their bodies are a \njumble in the net. Han removes a Wookiee paw from his mouth.\n\nHAN\nNice work. Great, Chewie! Great! Always thinking with your stomach.\n\nLUKE\nWill you take it easy? Let's just figure out a way to get out of this \nthing. \n(trying to free an arm) \nHan, can you reach my lightsaber?\n\nHAN\nYeah, sure.\n\nArtoo is at the bottommost point in the net. He extends his cutting \nappendage and begins slicing at the net. Han is trying to squeeze an \narm past Threepio to get at Luke's lightsaber. The net continues to \nspin.\n\nTHREEPIO\nArtoo, I'm not sure that's such a good idea. It's a very long dro-o-\nop!!\n\nArtoo has cut through and the entire group tumbles out of the net, \ncrashing to the ground. As they regain their senses and sit up, they \nrealize they are surrounded by dozens of Ewoks, each brandishing a long \nspear.\n\nHAN\nWha--?  Hey!  Point that thing someplace else.\n\nHan pushes the spear wielded by TEEBO out of his face and a second Ewok \nwarrior comes up to argue with Teebo. The spear returns to Han's face. \nHe grabs it angrily and starts to go for his laser pistol.\n\nHAN\nHey!\n\nLUKE\nHan, don't. It'll be all right.\n\nThe Ewoks swarm through them and confiscate their weapons. Luke lets \nthem take his lightsaber. Chewie growls at the furry critters.\n\nLUKE\nChewie, give 'em your crossbow.\n\nArtoo and Threepio are just untangling themselves. Threepio gets free \nof the net and sits up, rattled.\n\nTHREEPIO\nOh, my head. Oh, my goodness!\n\nWhen the Ewoks see Threepio, they let out a gasp and chatter among \nthemselves. Threepio speaks to them in their native tongue. The Ewok \nnearest him drops his spear and prostrates himself before the droid. In \na moment, all the Ewoks have followed suit. Chewie lets out a puzzled \nbark. Han and Luke regard the bowed creatures in wonder. The Ewoks \nbegin to chant at Threepio.\n\nLUKE\nDo you understand anything they're saying?\n\nTHREEPIO\nOh, yes, Master Luke!  Remember that I am fluent in over six million \nforms of\ncommunication.\n\nHAN\nWhat are you telling them?\n\nTHREEPIO\nHello, I think... I could be mistaken. They're using a very primitive \ndialect.  But\nI do believe they think I am some sort of god.\n\nChewbacca and Artoo think that's very funny. Han and Luke exchange \n\"what next?\" looks.\n\nHAN\nWell, why don't you use your divine influence and get us out of this?\n\nTHREEPIO\nI beg your pardon, General Solo, but that just wouldn't be proper.\n\nHAN\nProper?!\n\nTHREEPIO\nIt's against my programming to impersonate a deity.\n\nHan moves toward Threepio threateningly.\n\nHAN\nWhy, you--\n\nSeveral Ewoks' spears are thrust in Han's face at the affront to their \ngod. The Ewoks move in to protect their god and Han is surrounded by a \nmenacing circle of spears, all aimed at him. He holds up his hands \nplacatingly.\n\nHAN\nMy mistake. He's an old friend of mine.\n\n72   EXT FOREST - SERIES OF SHOTS\n\nA procession of Ewoks winds through the ever-darkening forest. Their \nprisoners - Han, Luke, Chewie, and Artoo - are tied to long poles and \nwrapped in vines, cocoonlike.\n\nEach pole is carried on the shoulders of several Ewoks. Behind the \ncaptives, Threepio is carried on a litter, like a king, by the \nremaining creatures.\n\n73   EXT FOREST WALKWAY - MOON FOREST\n\nThe procession moves along a shaky, narrow, wooden walkway, high in the \ngiant trees. It stops at the end of the walkway, which drops off into \nnothingness. On the other side of the abyss is a village of mud huts \nand rickety walkways, attached to the giant trees. The lead Ewok takes \nhold of a long vine and swings across to the village square; the other \nEwoks follow suit.\n\n74   EXT EWOK VILLAGE SQUARE\n\nThe procession winds its way into the village square. Mother Ewoks \ngather their babies up and scurry into their huts at the sight of the \nnewcomers. The group stops before the largest hut.\n\nHan, Luke, Chewie, and Artoo are still bound to their poles. Han is \nplaced on a spit above what looks like a barbecue pit and the others \nare leaned against a tree nearby. Threepio's litter/throne is gently \nplaced near the pit. He watches with rapt fascination. Han, Luke, and \nChewie are less than fascinated.\n\nHAN\nI have a really bad feeling about this.\n\nChewie growls his concern.\n\nSuddenly all activity stops as LOGRAY, the tribal Medicine Man, comes \nout of the big hut. He examines the captives carefully, goes to join \nThreepio, whose throne has been placed on an elevated platform. A \nlarger, gray-haired Ewok, CHIEF CHIRPA, is examining Luke's lightsaber \nwith great curiosity.\n\nLogray speaks to Threepio and the assemblage of fuzzy Ewoks, pointing \nto the prisoners tied to the stakes. The Ewoks begin filling the pit \nunder Han with firewood.\n\nHAN\nWhat did he say?\n\nTHREEPIO\nI'm rather embarrassed, General Solo, but it appears you are to be the \nmain course at a\nbanquet in my honor.\n\nThe drums start beating, and all the furry heads turn to the large hut. \nLeia emerges, wearing an animal-skin dress. She sees what's happening \nat the same moment the prisoners see her.\n\nHAN and LUKE\nLeia!\n\nAs she moves toward them, the Ewoks block her way with raised spears.\n\nLEIA\nOh!\n\nTHREEPIO\nYour Royal Highness.\n\nArtoo and Chewie chime in with their welcome. Leia looks at the \nassembled Ewoks and sighs.\n\nLEIA\nBut these are my friends. Threepio, tell them they must be set free.\n\nThreepio talks to Chirpa and Logray, who listen and shake their heads \nnegatively. The Medicine Man gestures toward the prisoners and barks \nsome orders. Several Ewoks jump up and pile more wood on the barbecue \nwith vigor. Leia trades frantic looks with Luke and Han .\n\nHAN\nSomehow, I got the feeling that didn't help us very much.\n\nLUKE\nThreepio, tell them if they don't do as you wish, you'll become angry \nand use your magic.\n\nTHREEPIO\nBut Master Luke, what magic? I couldn't possibly --\n\nLUKE\nJust tell them.\n\nThreepio speaks to the Ewoks. The Ewoks are disturbed. Logray steps \nforward and challenges Threepio. Luke closes his eyes and begins to \nconcentrate.\n\nTHREEPIO\nYou see, Master Luke; they didn't believe me. Just...\n\nNow the litter/throne, with Threepio sitting upon it, rises from the \nground. At first Threepio doesn't notice and keeps talking.\n\nTHREEPIO\n... as I said they wouldn't. Wha-wha-what's happening! Oh! Oh, dear! \nOh!\n\nThe Ewoks fall back in terror from the floating throne. Now Threepio \nbegins to spin as though he were on a revolving stool, with Threepio \ncalling out in total panic at his situation.\n\nTHREEPIO\nPut me down! He-e-elp! Master Luke! Artoo! Somebody, somebody, help! \nMaster Luke, Artoo! Artoo, quickly! Do something, somebody! Oh! Ohhh!\n\nChief Chirpa yells orders to the cowering Ewoks. They rush up and \nrelease the bound prisoners. Luke and Han enfold Leia in a group \nembrace. Luke notices the spinning Threepio, with Artoo beeping up at \nhim, and slowly lowers the golden droid and the throne to the ground. \nLogray orders the little droid cut down. Artoo crashes to the ground. \nWhen the Ewoks set him upright, the little droid is fighting mad. Artoo \nbeeps a blue streak at the nearest Ewok, and begins pursuing him, \nfinally getting close enough to zap him with an electric charge. The \nEwok jumps two feet in the air and runs away, screaming. A small group \nof Ewoks surround the giant Wookiee, scratching their heads and \nmarveling at his height.\n\nTHREEPIO\nOh, oh, oh, oh! Thank goodness.\n\nLUKE\nThanks, Threepio.\n\nTHREEPIO\t (still shaken)\nI...I never knew I had it in me.\n\n75   INT CHIEF'S HUT - COUNCIL OF ELDERS\n\nA glowing fire dances in the center of the spartan, low-ceilinged room, \ncreating a kaleidoscope of shadows on the walls. Along one side, a \ngroup of ten Ewok elders flank Chief Chirpa, who sits on his throne. \nThe Rebels sit along the walls of the hut, with Threepio between the \ntwo groups and Wicket and Teebo off to one side.\n\nThreepio is in the midst of a long, animated speech in the Ewok's \nsqueaky native tongue. The Ewoks listen carefully and occasionally \nmurmur comments to each other. Threepio points several times at the \nRebel group and pantomimes a short history of the Galactic Civil War, \nmimicking the explosion and rocket sounds, imitating Imperial walkers. \nThroughout the long account, certain familiar names are distinguishable \nin English: Princess Leia, Artoo, Darth Vader, Death Star, Jedi, Obi-\nWan Kenobi. Artoo begins beeping excitedly at Threepio.\n\nTHREEPIO\nYes, Artoo. I was just coming to that.\n\nThreepio continues with: Millennium Falcon, Cloud City, Vader, Han \nSolo, carbonite, Sarlacc, bringing the history up to the present time.\n\nAt the end of it, the Chief, Logray, and the elders confer, then nod in \nagreement. The Chief stands and makes a pronouncement.\n\nThe drums begin to sound, and all the Ewoks stand with a great cheer \nand screeches.\n\nHAN\nWhat's going on?\n\nLEIA\nI don't know.\n\nLuke has been sharing the joy with smiling visage, but now something \npasses like a dark cloud through his consciousness. The others do not \nnotice.\n\nTHREEPIO\nWonderful! We are now a part of the tribe.\n\nSeveral of the little teddy bears run up and hug the Rebels.\n\nHAN\nJust what I always wanted.\n\nChewbacca is being enthusiastically embraced by an Ewok, while Wicket \nclings to Han's leg.\n\nHAN\t (chuckles)\nWell, short help is better than no help at all, Chewie. \n(to Wicket) \nThank you. Okay.\n\nTHREEPIO\nHe says the scouts are going to show us the quickest way to the shield \ngenerator.\n\nChewie barks. Luke has drifted to the back of the hut. Now he wanders \noutside into the moonlight. Leia notices and follows.\n\nHAN\nGood. How far is it? Ask him. We need some fresh supplies, too. And try \nand get our weapons back.\n\nHan pulls Threepio back as he keeps trying to translate.\n\nHAN\t (cont)\nAnd hurry up, will ya? I haven't got all day.\n\n76   EXT EWOK VILLAGE - NIGHT\n\nThe walkway is deserted now. The windows of the little huts glow and \nflicker from the fires inside. The sounds of the forest fill the soft \nnight air. Luke has wandered away from the Chief's hut and stands \nstaring up at the Death Star. Leia finds him like that.\n\nLEIA\nLuke, what's wrong?\n\nLuke turns and looks at her a long moment.\n\nLUKE\nLeia... do you remember your mother? Your real mother?\n\nLEIA\nJust a little bit. She died when I was very young.\n\nLUKE\nWhat do you remember?\n\nLEIA\nJust...images, really. Feelings.\n\nLUKE\nTell me.\n\nLEIA\n(a little surprised at his insistence)\nShe was very beautiful. Kind, but...sad.\n(looks up)\nWhy are you asking me all this?\n\nHe looks away.\n\nLUKE\nI have no memory of my mother. I never knew her.\n\nLEIA\nLuke, tell me. What's troubling you?\n\nLUKE\nVader is here...now, on this moon.\n\nLEIA\t (alarmed)\nHow do you know?\n\nLUKE\nI felt his presence. He's come for me. He can feel when I'm near. \nThat's why I have to go.\n(facing her)\nAs long as I stay, I'm endangering the group and our mission here.\n(beat)\nI have to face him.\n\nLeia is distraught, confused.\n\nLEIA\nWhy?\n\nLuke moves close and his manner is gentle. And very calm.\n\nLUKE\nHe's my father.\n\nLEIA\nYour father?\n\nLUKE\nThere's more. It won't be easy for you to hear it, but you must. If I \ndon't make it back, you're the only hope for the Alliance.\n\nLeia is very disturbed by this. She moves away, as if to deny it.\n\nLEIA\nLuke, don't talk that way. You have a power I--I don't understand and \ncould never have.\n\nLUKE\nYou're wrong, Leia. You have that power too. In time you'll learn to \nuse it as I have. The Force is strong in my family. My father has \nit...I have it...and...my sister has it.\n\nLeia stares into his eyes. What she sees there frightens her. But she \ndoesn't draw away. She begins to understand.\n\nLUKE\nYes. It's you Leia.\n\nLEIA\nI know. Somehow...I've always known.\n\nLUKE\nThen you know why I have to face him.\n\nLEIA\nNo! Luke, run away, far away. If he can feel your presence, then leave \nthis place. I wish I could go with you.\n\nLUKE\nNo, you don't. You've always been strong.\n\nLEIA\nBut, why must you confront him?\n\nLUKE\nBecause...there is good in him. I've felt it. He won't turn me over to \nthe Emperor. I can save him. I can turn him back to the good side. I \nhave to try.\n\nThey hold each other close and look at each other, brother and sister.\n\nLeia holds back her tears as Luke slowly lets her go and moves away. He \ndisappears onto the walkway that leads out of the village. Leia, bathed \nin moonlight, watches him go as Han comes out of the Chief's hut and \ncomes over to her. Leia is crying, her body trembling. He realizes only \nnow that she is crying.\n\nHAN\nHey, what's goin' on?\n\nLeia attempts to stifle her sobs and wipes her eyes.\n\nLEIA\nNothing. I - just want to be alone for a little while.\n\nHAN\t (angry)\nNothing?  Come on, tell me.  What's goin' on?\n\nShe looks up at him, struggling to control herself.\n\nLEIA\nI...I can't tell you.\n\nHAN\t (loses his temper)\nDid you tell Luke? Is that who you could tell?\n\nLEIA\nI...\n\nHAN\nAhhh...\n\nHe starts to walk away, exasperated, then stops and walks back to her.\n\nHAN\nI'm sorry.\n\nLEIA\nHold me.\n\nHan gathers her tightly in his protective embrace.\n\n77   EXT FOREST - IMPERIAL LANDING PLATFORM\n\nAn Imperial shuttle floats down from the Death Star and lands \ngracefully on the huge platform.\n\nNow, an Imperial walker approaches the platform from the darkness of \nthe forest. The whole outpost - platform, walkers, military - looks \nparticularly offensive in the midst of this verdant beauty.\n\n78   EXT IMPERIAL LANDING PLATFORM - LOWER DECK\n\nDarth Vader walks down the ramp of the shuttle onto the platform, into \nan elevator, and appears on a ramp on a lower level. He walks toward \nanother ramp exit and is met by two troopers and a commander with Luke, \nin binders, at their center. The young Jedi gazes at Vader with \ncomplete calm.\n\nCOMMANDER\nThis is a Rebel that surrendered to us. Although he denies it, I \nbelieve there may be more of them, and I request permission to conduct \na further search of the area.\n\nThe commander extends his hand, revealing Luke's lightsaber.\n\nCOMMANDER\nHe was armed only with this.\n\nVader looks at Luke, turns away and faces the commander, taking the \nlightsaber from the commander's hand.\n\nVADER\nGood work, Commander. Leave us. Conduct your search and bring his \ncompanions to me.\n\nCOMMANDER\nYes, my Lord.\n\nThe officer and troops withdraw. Vader and Luke are left standing alone \nin the oddly tranquil beauty of the place. The sounds of the forest \nfilter in upon them.\n\nVADER\nThe Emperor has been expecting you.\n\nLUKE\nI know, father.\n\nVADER\nSo, you have accepted the truth.\n\nLURE\nI've accepted the truth that you were once Anakin Skywalker, my father.\n\nVADER\t (turning to face him)\nThat name no longer has any meaning for me.\n\nLUKE\nIt is the name of your true self. You've only forgotten. I know there \nis good in you. The Emperor hasn't driven it from you fully. That is \nwhy you couldn't destroy me. That's why you won't bring me to your \nEmperor now.\n\nVader looks down from Luke to the lightsaber in his own black- gloved \nhand. He seems to ponder Luke's words.\n\nVADER\t (indicating lightsaber)\nI see you have constructed a new lightsaber.\n\nVader ignites the lightsaber and holds it to examine its humming, \nbrilliant blade.\n\nVADER\nYour skills are complete. Indeed, you are powerful, as the Emperor has \nforeseen.\n\nThey stand for a moment, the Vader extinguishes the lightsaber.\n\nLUKE\nCome with me.\n\nVADER\nObi-Wan once thought as you do.\n\nLuke steps close to Vader, then stops. Vader is still.\n\nVADER\nYou don't know the power of the dark side. I must obey my master.\n\nLUKE\nI will not turn...and you'll be forced to kill me.\n\nVADER\nIf that is your destiny.\n\nLUKE\nSearch your feelings, father. You can't do this. I feel the conflict \nwithin you. Let go\nof your hate.\n\nVADER\nIt is too late for me, son. The Emperor will show you the true nature \nof the Force. He is\nyour master now.\n\nVader signals to some distant stormtroopers. He and Luke stand staring \nat one another for a long moment.\n\nLUKE\nThen my father is truly dead.\n\n79   EXT ENDOR - RIDGE OVERLOOKING SHIELD GENERATOR\n\nHan, Leia, Chewbacca, the droids, Wicket, and another Ewok scout, \nPAPLOO, hide on a ridge overlooking the massive Imperial shield \ngenerator. At the base of the generator is an Imperial landing \nplatform. Leia studies the installation.\n\nLEIA\nThe main entrance to the control bunker's on the far side of that \nlanding platform. This\nisn't gonna be easy.\n\nHAN\nHey, don't worry. Chewie and me got into a lot of places more heavily \nguarded than this.\n\nWicket and Paploo are chattering away in Ewok language. They speak to \nThreepio.\n\nLEIA\nWhat's he saying?\n\nTHREEPIO\nHe says there's a secret entrance on the other side of the ridge.\n\n80   EXT SPACE - REBEL FLEET\n\nThe vast fleet hangs in space near a blue planet. A giant Rebel Star \nCruiser is up at the front, but now the Millennium Flacon roars up to a \nspot ahead of it, tiny in comparison.\n\n81   INT MILLENNIUM FALCON - COCKPIT\n\nLando is in the pilot seat. His alien copilot, NIEN NUNB, takes some \ngetting used to in the familiar environs of the Falcon's cockpit. Lando \nspeaks into his comlink.\n\nLANDO\nAdmiral, we're in position. All fighters accounted for.\n\nACKBAR \t(VO)\nProceed with the countdown. All groups assume attack coordinates.\n\nLando turns to his weird copilot.\n\nLANDO\nDon't worry, my friends are down there. They'll have that shield down \non time...\n(to himself) \nor this'll be the shortest offensive of all time.\n\nThe copilot flips some switches and grunts an alien comment.\n\nACKBAR\t (VO)\nAll craft, prepare to jump to hyperspace on my mark.\n\nLANDO\nAll right. Stand by.\n\nHe pulls a lever, and the stars outside begin to streak.\n\n82   EXT SPACE - REBEL FLEET\n\nWe are treated to an awesome sight: first the Millennium Falcon, then \nAckbar's Star Cruiser, then, in large segments, the huge fleet ROARS \nINTO HYPERSPACE. And disappears.\n\n83   EXT ENDOR - RIDGE OVERLOOKING CONTROL BUNKER\n\nHan, Leia, Chewie, the droids, and their two Ewok guides, Wicket and \nPaploo, have reunited with the Rebel strike squad. The entire group is \nspread through the thick undergrowth. Below them is the BUNKER that \nleads into the generator. Four Imperial scouts, their speeder bikes \nparked nearby, keep watch over the bunker entrance. Chewie growls an \nobservation, and Paploo chatters away to Han in Ewok language.\n\nHAN\nBack door, huh? Good idea.\n\nWicket and Paploo continue their Ewok conversation.\n\nHAN\t (cont)\nIt's only a few guards. This shouldn't be too much trouble.\n\nLEIA\nWell, it only takes one to sound the alarm.\n\nHAN\t (with self-confident grin)\nThen we'll do it real quiet-like.\n\nThreepio explains what is going on to Wicket and Paploo. The Ewoks \nchatter a moment between themselves. Then Paploo jumps up and scampers \ninto the underbrush.\n\nThreepio asks Wicket where Paploo went and is given a short reply.\n\nTHREEPIO\nOh! Oh, my. Uh, Princess Leia!\n\nLEIA\nQuiet.\n\nTHREEPIO\nI'm afraid our furry companion has gone and done something rather rash.\n\nLEIA\nOh, no.\n\n84   EXT BUNKER - ENTRANCE\n\nPaploo has slipped out of the undergrowth near where the Imperial \nscouts are lounging. He silently swings his furry ball of a body onto \none of the scout's speeder bikes and begins flipping switches at \nrandom. Suddenly, the bike's engine fires up with a tremendous ROAR. \nPaploo grins and continues flipping switches. The scouts leap up in \nsurprise.\n\n85   EXT RIDGE\n\nHan, Leia and company watch in distress. Chewie barks.\n\nHAN \t(sighs)\nThere goes our surprise attack.\n\n86   EXT BUNKER\n\nThe Imperial scouts race toward Paploo just as his speeder zooms into \nmotion. Paploo hangs on by his paws and shoots away into the forest.\n\nSCOUT\nLook! Over there! Stop him!\n\nThree of the Imperial scouts jump on their rocket bikes and speed away \nin pursuit. The fourth watches them go from his post at the door.\n\n87   EXT RIDGE\n\nHan, Leia, and Chewie exchange delighted looks.\n\nHAN\nNot bad for a little furball. There's only one left. You stay here. \nWe'll take care of this.\n\nHan and the Wookiee nod at each other and slip down toward the bunker. \nThreepio moves to stand next to Wicket and Artoo.\n\nTHREEPIO\nI have decided that we shall stay here.\n\n88   EXT FOREST\n\nPaploo sails through the trees, more lucky than in control. It's scary, \nbut he loves it. When the Imperial scouts pull within sight behind him \nand begin firing laser bolts, he decides he's had enough. As he rounds \na tree, out of their sight, Paploo grabs a vine and swings up into the \ntrees. A moment later, the scouts tear under him in pursuit of the \nstill-flying, unoccupied bike.\n\n89   EXT BUNKER\n\nHan sneaks up behind the remaining Imperial scout, taps him on the \nshoulder and lets the scout chase him behind the bunker into the arms \nof the waiting Rebel strike team. Han returns to the front, and taps \nout a pattern on the bunker door's control panel. Everyone stands out \nof sight, police-style, as the door opens. Han and Leia peek inside. No \nsign of life. The group enters the bunker silently, leaving one lookout \nbehind.\n\n90   INT DEATH STAR - EMPEROR'S THRONE ROOM\n\nThe elevator opens. Vader and Luke enter the room alone. They walk \nacross the dark space to stand before the throne, father and son side \nby side beneath the gaze of the Emperor. Vader bows to his Master.\n\nEMPEROR\nWelcome, young Skywalker. I have been expecting you.\n\nLuke peers at the hooded figure defiantly. The Emperor then looks down \nat Luke's binders.\n\nEMPEROR\nYou no longer need those.\n\nThe Emperor motions ever so slightly with his finger and Luke's binders \nfall away, clattering to the floor. Luke looks down at his own hands, \nfree now to reach out and grab the Emperor's neck. He does nothing.\n\nEMPEROR\nGuards, leave us.\n\nThe red-cloaked guards turn and disappear behind the elevator.\n\nEMPEROR\t (to Luke)\nI'm looking forward to completing your training. In time you will call \nme Master.\n\nLUKE\nYou're gravely mistaken. You won't convert me as you did my father.\n\nThe Emperor gets down from his throne and walks up very close to Luke. \nThe Emperor looks into his eyes and, for the first time, Luke can \nperceive the evil visage within the hood.\n\nEMPEROR\nOh, no, my young Jedi. You will find that it is you who are \nmistaken...about a great many things.\n\nVADER\nHis lightsaber.\n\nVader extends a gloved hand toward the Emperor, revealing Luke's \nlightsaber. The Emperor takes it.\n\nEMPEROR\nAh, yes, a Jedi's weapon. Much like your father's. By now you must know \nyour father can never be turned from the dark side. So will it be with \nyou.\n\nLUKE\nYou're wrong. Soon I'll be dead...and you with me.\n\nThe Emperor laughs.\n\nEMPEROR\nPerhaps you refer to the imminent attack of your Rebel fleet.\n\nLuke looks up sharply.\n\nEMPEROR\nYes...I assure you we are quite safe from your friends here.\n\nVader looks at Luke.\n\nLUKE\nYour overconfidence is your weakness.\n\nEMPEROR\nYour faith in your friends is yours.\n\nVADER\nIt is pointless to resist, my son.\n\nThe Emperor turns to face Luke.\n\nEMPEROR\t (angry)\nEverything that has transpired has done so according to my design. \n(indicates Endor)\nYour friends up there on the Sanctuary Moon...\n\nLuke reacts. The Emperor notes it.\n\nEMPEROR\t (cont)\n...are walking into a trap. As is your Rebel fleet! It was I who \nallowed the Alliance to know the location of the shield generator. It \nis quite safe from your pitiful little band. An entire legion of my \nbest troops awaits them.\n\nLuke's look darts from the Emperor to Vader and, finally, to the sword \nin the Emperor's hand.\n\nEMPEROR\nOh...I'm afraid the deflector shield will be quite operational when \nyour friends arrive.\n\n91   INT BUNKER - MAIN CONTROL ROOM\n\nHan, Leia, Chewie, and the Rebel strike team storm through a door and \nenter the main control room, taking all of the personnel prisoner.\n\nHAN\nAll right! Up! Move! Come on! Quickly! Quickly, Chewie.\n\nThe Rebel troops herd the generator controllers away from their panels. \nLeia glances at one of the screens on the control panel.\n\nLEIA\nHan! Hurry! The fleet will be here any moment.\n\nHAN\nCharges!  Come on, come on!\n\nOutside, Threepio watches nervously in the bushes as several more \ncontrollers and stormtroopers run into the bunker, leaving guards at \nthe door.\n\nTHREEPIO\t (to Wicket)\nOh, my! They'll be captured!\n\nWicket chatters in Ewok language, and then takes off full steam into \nthe forest.\n\nTHREEPIO\nWa-wait! Wait, come back! Artoo, stay with me.\n\nInside the bunker, Han looks up from setting charges as an Imperial \ncommander enters.\n\nCOMMANDER\nFreeze! You Rebel scum.\n\nHan and Leia spin, to find dozens of Imperial weapons trained on them \nand their cohorts. A poised force of Imperial troops surround them. \nEven more pour into the room, roughly disarming the Rebel contingent. \nHan, Leia, and Chewie exchange looks. They're helpless.\n\n92   EXT SPACE - ENDOR, DEATH STAR, REBEL FLEET\n\nThe Death Star and its Sanctuary Moon hang distant in space as the \nRebel fleet comes out of hyperspace with an awesome roar. The \nMillennium Falcon and several Rebel fighters are at the front as the \nspace armada bears down on its target.\n\n93   INT MILLENNIUM FALCON - COCKPIT\n\nLando flips switches, checks his screen, and speaks into the radio.\n\nLANDO\nAll wings report in.\n\nWEDGE\nRed Leader standing by.\n\nGRAY LEADER\nGray Leader standing by.\n\nGREEN LEADER\nGreen Leader standing by.\n\nWEDGE\nLock S-foils in attack positions.\n\n94   INT REBEL STAR CRUISER - BRIDGE\n\nFrom the bridge of the Rebel Headquarters Frigate, Admiral Ackbar \nwatches the fighters massing outside his viewscreen.\n\nACKBAR\nMay the Force be with us.\n\n95   INT MILLENNIUM FALCON - COCKPIT\n\nLando looks worriedly at his alien copilot, Nien Nunb, who points to \nthe control panel and talks to Lando.\n\nLANDO\nWe've got to be able to get some kind of a reading on that shield, up \nor down. Well, how\ncould they be jamming us if they don't know if we're coming.\n\nLando shoots a concerned look out at the approaching Death Star as the \nimplications of what he's just said sink in. He hits a switch on his \ncomlink.\n\nLANDO\nBreak off the attack! The shield is still up.\n\nRED LEADER\t (VO)\nI get no reading. Are you sure?\n\nLANDO\nPull up! All craft pull up!\n\nThe Falcon turns hard to the left. Out the window the stars and the \nDeath Star move off right.\n\n96   EXT SPACE - DEATH STAR SHIELD\n\nThe Falcon and the fighters of Red Squad veer off desperately to avoid \nthe unseen wall.\n\n97   INT REBEL STAR CRUISER - BRIDGE\n\nAlarms are screaming and lights flashing as the huge ship changes \ncourse abruptly. Other ships in the fleet shoot by outside as the \narmada tries to halt its forward momentum.\n\nACKBAR\nTake evasive action! Green Group, stick close to holding sector MV-7.\n\nA Mon Calamari controller turns away from his screen and calls out to \nAckbar, quite excited. The Admiral rushes over to the controller.\n\nCONTROLLER\nAdmiral, we have enemy ships in sector 47.\n\nOn the screen can be seen the moon, Death Star, and the massive \nImperial fleet. Ackbar moves to the comlink.\n\nACKBAR\nIt's a trap!\n\nLANDO\t (over comlink)\nFighters coming in.\n\nThere is much excitement on the bridge as the attack begins.\n\nThe Millennium Falcon and several squads of Rebel fighters head into an \narmada of TIE fighters. The sky explodes as a fierce dogfight ensues in \nand around the giant Rebel cruisers.\n\nREBEL PILOT\nThere's too many of them!\n\nLANDO\nAccelerate to attack speed! Draw their fire away from the cruisers.\n\nWEDGE\nCopy, Gold Leader.\n\nThe battle continues around the giant cruisers.\n\n98   INT DEATH STAR - EMPEROR'S THRONE ROOM\n\nThrough the round window behind the Emperor's throne can be seen the \ndistant flashes of the space battle in progress.\n\nEMPEROR\nCome, boy. See for yourself.\n\nThe Emperor is sitting in his throne, with Vader standing at his side. \nLuke moves to look through a small section of the window.\n\nEMPEROR\nFrom here you will witness the final destruction of the Alliance, and \nthe end of your insignificant Rebellion.\n\nLuke is in torment. He glances at his lightsaber sitting on the armrest \nof the throne. The Emperor watches him and smiles, touches the \nlightsaber.\n\nEMPEROR\nYou want this, don't you? The hate is swelling in you now. Take your \nJedi weapon. Use it. I am unarmed. Strike me down with it. Give in to \nyour anger. With each passing moment, you make yourself more my \nservant.\n\nVader watches Luke in his agony.\n\nLUKE\nNo!\n\nEMPEROR\nIt is unavoidable. It is your destiny. You, like your father, are now \nmine!\n\n99   EXT FOREST - GENERATOR BUNKER\n\nHan, Leia, Chewie, and the rest of the strike team are led out of the \nbunker by their captors. The surrounding area, deserted before, is now \ncrowded with two-legged Imperial walkers and hundreds of Imperial \ntroops. The situation looks hopeless.\n\nSTORMTROOPER\nAll right, move it! I said move it! Go on!\n\nFrom the undergrowth beyond the clearing comes a wild series of beeps \nand whistles. \nAnd --\n\nTHREEPIO\nHello! I say, over there! Were you looking for me?\n\nBUNKER COMMANDER\nBring those two down here!\n\nSTORMTROOPER\nLet's go!\n\nArtoo and Threepio are standing near one of the big trees. As six \nImperial stormtroopers rush over to take them captive, the two droids \nduck out of sight behind the tree.\n\nTHREEPIO\nWell, they're on their way. Artoo, are you sure this was a good idea?\n\nSTORMTROOPER\nFreeze! Don't move!\n\nTHREEPIO\nWe surrender.\n\nThe stormtroopers come around the tree and find the two droids waiting \nquietly to be taken. As the Imperial troops move to do that, however, a \nband of Ewoks drops down from above and overpowers them.\n\nTHREEPIO\nOhhh! Stand back, Artoo.\n\nIn a nearby tree, an Ewok raises a horn to his lips and sounds the EWOK \nATTACK CALL. All hell breaks loose as hundreds of Ewoks throw their \nfuzzy bodies into the fray against the assembled stormtroopers and \ntheir awesome two-legged walkers. Biker scouts dart about blasting \nEwoks, only to be crushed by a volley of rocks tossed by Ewoks from the \ntrees above.\n\nIn the confusion of the battle, Han and Leia break away and dive for \nthe cover of the bunker door as explosions erupt around them. Han goes \nto the bunker door control panel.\n\nLEIA\nThe code's changed. We need Artoo!\n\nHAN\nHere's the terminal.\n\nLEIA\t (into comlink)\nArtoo, where are you? We need you at the bunker right away.\n\nArtoo and Threepio are hiding behind a log as the battle ragesaround \nthem. Suddenly the stubby little astrodroid lets out a series of \nwhistles and shoots off across the battlefield. Threepio, panicked, \nruns after him.\n\nTHREEPIO\nGoing? What do you mean, you're going. But-- but going where, Artoo? \nNo, what! Artoo! Oh, this is no time for heroics. Come back!\n\nBiker scouts race around and over the two droids, blasting away at the \nlittle Ewoks as the furries scurry for cover.\n\nA group of Ewoks have moved a primitive catapult into position. They \nfire off a large boulder that hits one of the walkers. The walker turns \nand heads for the catapult, blasting away with both guns. The Ewoks \nabandon their weapons and flee in all directions. Just as the walker \nmoves in to stomp the catapult, Ewoks drop vines restraining two huge \nlogs that swing down and smash thewalker's head flat.\n\nA line of Ewoks hang desperately to a vine that is hooked to a walker's \nfoot. As the walker moves along, the fuzzy creatures are dragged \nbehind.\n\nTwo speeder bikes chase Ewoks through the underbrush. As the scouts \nround a tree, they are knocked off their bikes by a vinetied between \ntwo trees.\n\n100  EXT SPACE\n\nThe Falcon and other Rebel fighters are engaged in a ferocious combat \nwith Imperial TIE fighters, the battle raging around thecruisers of the \nRebel armada.\n\n101  INT MILLENNIUM FALCON - COCKPIT\nLando is in radio communication with the pilots of the other Rebel \nsquads.\n\nLANDO\nWatch yourself, Wedge! Three from above!\n\nWEDGE\nRed Three, Red Two, pull in!\n\nRED TWO\nGot it!\n\nRED THREE\nThree of them coming in, twenty degrees!\n\nWEDGE\nCut to the left! I'll take the leader! They're heading for the medical \nfrigate.\n\nLando steers the Falcon through a complete flip, as his crew fires at \nthe TIEs from the belly guns.\n\nNAVIGATOR\nPressure's steady.\n\nThe copilot Nien Nunb chatters an observation.\n\nLANDO\nOnly the fighters are attacking.  I wonder what those Star Destroyers \nare waiting for.\n\n102  EXT SPACE - IMPERIAL FLEET  \n\nThe giant Imperial Star Destroyer waits silently some distance from the \nbattle. The Emperor's huge Super Star Destroyer rests in the middle of \nthe fleet.\n\n103  INT SUPER STAR DESTROYER - BRIDGE\n\nAdmiral Piett and two fleet commanders watch the battle at the huge \nwindow of the Super Star Destroyer bridge.\n\nCOMMANDER\nWe're in attack position now, sir.\n\nPIETT\nHold here.\n\nCOMMANDER\nWe're not going to attack?\n\nPIETT\nI have my orders from the Emperor himself. He has something special \nplanned for them. We only need to keep them from escaping.\n\n104  INT EMPEROR'S TOWER - THRONE ROOM\n\nThe Emperor, Vader, and a horrified Luke watch the aerial battle \nfireworks out the window and on the viewscreens. Another Rebel ship \nexplodes against the protective shield.\n\nEMPEROR\nAs you can see, my young apprentice, your friends have failed. Now \nwitness the firepower of this fully armed and operational battle \nstation.\n(into comlink)\nFire at will, Commander.\n\nLuke, in shock, looks out across the surface of the Death Star to the \nRebel fleet beyond.\n\n105  INT DEATH STAR - CONTROL ROOM\n\nControllers pull back on several switches. Commander Jerjerrod stands \nover them.\n\nJERJERROD\nFire!\n\n106  INT DEATH STAR - BLAST CHAMBER\n\nA button is pressed, which switches on a panel of lights. A hooded \nImperial soldier reaches overhead and pulls a lever. A huge beam of \nlight emanates from a long shaft. Two stormtroopers stand to one side \nat a control panel.\n\n107  EXT DEATH STAR\n\nThe giant laser dish on the completed half of the Death Star begins to \nglow; Then a powerful beams shoots out toward the aerial battle.\n\n108  EXT SPACE - AIR BATTLE\n\nThe air is thick with giant ships. In among them, Rebel X-wings \ndogfight with Imperial TIE fighters. Now an enormous Rebel cruiser is \nhit by the Death Star beam and is blown to dust.\n\nThe Millennium Falcon roars over CAMERA, followed closely byseveral TIE \nfighters.\n\n109  INT MILLENNIUM FALCON - COCKPIT\n\nThe ship is buffeted by the tremendous explosion of the Rebel cruiser. \nLando and his copilot are stunned by the sight of the Death Star \nfirepower.\n\nLANDO\nThat blast came from the Death Star! That thing's operational! \n(into comlink)\nHome One, this is Gold Leader.\n\n110  INT REBEL STAR CRUISER - BRIDGE\n\nAckbar stands amid the confusion on the wide bridge and speaks into the \ncomlink.\n\nACKBAR\nWe saw it. All craft prepare to retreat.\n\nLANDO\nYou won't get another chance at this, Admiral.\n\nACKBAR\nWe have no choice, General Calrissian. Our cruisers can't repel \nfirepower of that magnitude.\n\nLANDO\nHan will have that shield down. We've got to give him more time.\n\n111  EXT FOREST - GENERATOR BUNKER\n\nArtoo and Threepio make it to the door, as Han and Leia provide cover \nfire.\n\nTHREEPIO\nWe're coming!\n\nHAN\nCome on! Come on!\n\nTHREEPIO\nOh, Artoo, hurry!\n\nThe little droid moves to the terminal and plugs in his computer arm. A \nlarge explosion hits near Artoo, knocking him head over heels, finally \nlanding on his feet. The stubby astrodroid's head is spinning and \nsmoldering. Suddenly there is a loud SPROOING and Han and Leia turn \naround to see Artoo with all his compartment doors open, and all of his \nappendages sticking out; water and smoke spurt out of the nozzles in \nhis body. Han rushes to the terminal, as Threepio rushes to his wounded \ncompanion.\n\nTHREEPIO\nMy goodness! Artoo, why did you have to be so brave?\n\nHAN\nWell, I suppose I could hotwire this thing.\n\nLEIA\nI'll cover you.\n\nEwoks in handmade, primitive hanggliders drop rocks onto the \nstormtroopers, divebombing their deadly adversaries.  One is hit in the \nwing with laser fire and crashes. A walker lumbers forward, shooting \nlaser blasts at frantic Ewoks running in all directions.  Two Ewoks are \nstruck down by laser blasts.  One tries to awaken his friend, then \nrealizes that he is dead.\n\n112  EXT SPACE - DEATH STAR\n\nThe Rebel fleet continues to be picked off, from one side by the Death \nStar's deadly beam, from the other by the rampaging Imperial Star \nDestroyers.\n\n113  INT MILLENNIUM FALCON - COCKPIT\n\nLando steers the Falcon wildly through an obstacle course of floating \ngiants. He's been yelling into the comlink.\n\nLANDO\t (desperately)\nYes! I said closer! Move as close as you can and engage those Star \nDestroyers at point-\nblank range.\n\nACKBAR\nAt that close range, we won't last long against those Star Destroyers.\n\nLANDO\nWe'll last longer then we will against that Death Star...and we might \njust take a few of\nthem with us.\n\nThe Rebel cruisers move very close to the Imperial Star Destroyers and \nbegin to blast away at point-blank range. Tiny fighters race across the \ngiant surfaces, against a backdrop of laser fire.\n\nThe control tower of a Star Destroyer is under attack.\n\nREBEL PILOT\nShe's gonna blow!\n\nY-WING PILOT\nI'm hit!\n\nThe damaged Y-wing plummets toward the Star Destroyer, and crashes into \nthe control tower, exploding.\n\n114  INT EMPEROR'S TOWER - THRONE ROOM\n\nOut of the window and on the view screens, the Rebel fleet is being \ndecimated in blinding explosions of light and debris. But in here there \nis no sound of battle. The Emperor turns to Luke.\n\nEMPEROR\nYour fleet has lost. And your friends on the Endor moon will not \nsurvive. There is no escape, my young apprentice. The Alliance will \ndie...as will your friends.\n\nLuke's eyes are full of rage. Vader watches him.\n\nEMPEROR\nGood. I can feel your anger. I am defenseless.  Take your weapon! \nStrike me down with all your hatred, and your journey towards the dark \nside will be complete.\n\nLuke can resist no longer. The lightsaber flies into his hand. He \nignites it in an instant and swings at the Emperor. Vader's lightsaber \nflashes into view, blocking Luke's blow before it can reach the \nEmperor. The two blades spark at contact. Luke turns to fight his \nfather.\n\n115  EXT FOREST\n\nThe battle rages on. Stormtroopers fire on Ewoks with sophisticated \nweapons while their furry little adversaries sneak up behind the \nImperial troopers and bash them over the head with large clubs.\n\nA walker marches through the undergrowth blasting Ewoks as it goes. An \nEwok warrior gives the signal, and a pile of logs is cut loose. The \nlogs tumble under the walker's feet, causing it to slip and slide until \nit finally topples over with a great crash.\n\nA scout bike races past and is lassoed with a heavy vine. The other end \nof the vine is tied to a tree, and the bike swings around in ever-\ntightening circles until it runs out of rope and\ncrashes into the trees with a huge explosion.\n\nChewie swings on a vine to the roof of one of the walkers. Two Ewoks \ncling to him. They land with a thud on the top of the lurching machine, \nthen hang on for dear life. One of the Ewoks peeks through the window.\n\nWALKER PILOT #1\nLook!\n\nPILOT #2\nGet him off of there!\n\nThe walker pilot opens the hatch to see what's going on. He is yanked \nout and tossed overboard before he can scream. The two Ewoks jump into \nthe cockpit and knock the second pilot unconscious. The Ewoks are \nthrown violently as the mighty machine careens out of control. Outside, \nChewie is almost knocked overboard; he sticks his head into the hatch \nwith a series of angry barks. The Ewoks are too busy and frightened to \nlisten to the Wookiee's complaint. Chewie slips inside the walker.\n\nChewbacca's walker moves through the forest, firing laser blasts at \nunsuspecting stormtroopers, and destroying other Imperial walkers. The \nEwoks shout and cheer as the giant machine helps turn the tide of the \nbattle in their favor.\n\n116  EXT FOREST - GENERATOR BUNKER\n\nHan works furiously at the control panel; wires spark as he attempts to \nhotwire the door. He motions to Leia, who is blasting away at some \nstormtroopers.\n\nHAN\nI think I got it. I got it!\n\nThe three wires spark as the connection is made. With a LOUD WHOOSH, a \nsecond blast door crashes down in front of the first.\n\nHan frowns and turns back to the wires again. Leia exchanges shots with \nstormtroopers in the bushes, then suddenly cries out in pain, her \nshoulder hit by a laser blast.\n\nTHREEPIO\nOh, Princess Leia, are you all right?\n\nHAN\nLet's see.\n\nLEIA\nIt's not bad.\n\nSTORMTROOPER\t (OS)\nFreeze!\n\nThey freeze.\n\nTHREEPIO\nOh, dear.\n\nSTORMTROOPER\nDon't move!\n\nLeia holds her laser gun ready, behind Han, out of view of the two \nstormtroopers moving toward them. Han and Leia's eyes lock; the moment \nseems suspended in time.\n\nHAN\nI love you.\n\nAnother shared look between them, as she smiles up at Han.\n\nLEIA\nI know.\n\nSTORMTROOPER\nHands up! Stand up!\n\nHan stands up slowly and turns, revealing the gun in Leia's hand. She \ndisposes of the stormtroopers in a flash. As Han turns back toward \nLeia, he looks up to see a giant walker approach and stand before him, \nits deadly weapons aimed right at him.\n\nHAN\t (to Leia)\nStay back.\n\nThe hatch on top of the walker opens and Chewie sticks his head out and \nbarks triumphantly.\n\nHAN\nChewie!  Get down here!  She's wounded!  No, wait....  I got an idea.\n\n117  INT EMPEROR'S TOWER - THRONE ROOM\n\nLuke and Vader are engaged in a man-to-man duel of lightsabers even \nmore vicious then the battle on Bespin. But the young Jedi has grown \nstronger in the interim, and now the advantage shifts to him. Vader is \nforced back, losing his balance, and is knocked down the stairs. Luke \nstands at the top of the stairs, ready to attack.\n\nEMPEROR (laughing)\nGood.  Use your aggressive feelings, boy!  Let the hate flow through \nyou.\n\nLuke looks momentarily toward the Emperor, then back to Vader, and \nrealizes he is using the dark side. He steps back, turns off his \nlightsaber, and relaxes, driving the hate from his being.\n\nVADER\nObi-Wan has taught you well.\n\nLUKE\nI will not fight you, father.\n\nVader walks back up the stairs to Luke.\n\nVADER\nYou are unwise to lower your defenses.\n\nVader attacks, forcing Luke on the defensive. The young Jedi leaps in \nan amazing reverse flip up to the safety of the catwalk overhead. Vader \nstands below him.\n\nLUKE\nYour thoughts betray you, father. I feel the good in you...the \nconflict.\n\nVADER\nThere is no conflict.\n\nLUKE\nYou couldn't bring yourself to kill me before, and I don't believe \nyou'll destroy me\nnow.\n\nVADER\nYou underestimate the power of the dark side. If you will not fight, \nthen you will meet\nyour destiny.\n\nVader throws the laser sword and it cuts through the supports holding \nthe catwalk, then returns to Vader's hand. Luke tumbles to the ground \nin a shower of sparks and rolls out of sight under the Emperor's \nplatform. Vader moves to find him.\n\nEMPEROR\t (laughs)\nGood.  Good.\n\n118  EXT SPACE - AIR BATTLE\n\nThe two armadas, like their sea-bound ancestors, blast away at each \nother in individual point-blank confrontations. A Star Destroyer \nexplodes. The Rebel victor limps away, its back half alive with a \nseries of minor explosions. The Rebel cruiser manages to move in next \nto a second Star Destroyer before it explodes completely, taking the \nImperial Star Destroyer with it. The Falcon and several fighters attack \none of the larger Imperial ships.\n\nLANDO\nWatch out. Squad at .06.\n\nREBEL PILOT\nI'm on it, Gold Leader.\n\nWEDGE\nGood shot, Red Two.\n\nLANDO\nNow...come on, Han, old buddy. Don't let me down.\n\n119  INT BUNKER - CONTROL ROOM\n\nControllers watch the main viewscreen on which a vague figure of an \nImperial walker pilot can be seen. There is a great deal of static and \ninterference.\n\nHAN/PILOT\t (VO)\nIt's over, Commander. The Rebels have been routed. They're fleeing into \nthe woods. We\nneed reinforcements to continue the pursuit.\n\nThe controllers cheer.\n\nCONTROL ROOM COMMANDER\nSend three squads to help. Open the back door.\n\nSECOND COMMANDER\nYes, sir.\n\n120  EXT FOREST - GENERATOR BUNKER\n\nAs the door to the bunker opens and the Imperial troops rush out, \nthey're surprised to find themselves surrounded by Rebels, their \nweapons pointed at them. Ewoks holding bows and arrows appear on the \nroof of the bunker. The Imperial troops throw down their guns\nas Han and Chewie rush inside the bunker with explosive charges.\n\n121  INT BUNKER - CONTROL ROOM\n\nHan, Chewie, and several troops rush into the control room and plant \nexplosive charges on the control panels and rush out.\n\nHAN\nThrow me another charge.\n\n122  INT EMPEROR'S TOWER - THRONE ROOM\n\nVader stalks the low-ceilinged area on the level below the throne, \nsearching for Luke in the semi-darkness, his lightsaber held ready.\n\nVADER\nYou cannot hide forever, Luke.\n\nLUKE\nI will not fight you.\n\nVADER\nGive yourself to the dark side. It is the only way you can save your \nfriends. Yes, your\nthoughts betray you. Your feelings for them are strong. Especially \nfor...\n\nVader stops and senses something. Luke shuts his eyes tightly, in \nanguish.\n\nVADER\nSister! So...you have a twin sister. Your feelings have now betrayed \nher, too. Obi-Wan\nwas wise to hide her from me. Now his failure is complete. If you will \nnot turn to the dark\nside, then perhaps she will.\n\nLUKE\nNever-r-r!\n\nLuke ignites his lightsaber and screams in anger, rushing at hisfather \nwith a frenzy we have not seen before. Sparks fly as Luke and Vader \nfight in the cramped area. Luke's hatred forces Vader to retreat out of \nthe low area and across a bridge overlooking a vast elevator shaft. \nEach stroke of Luke's sword drives his father further toward defeat.\n\nThe Dark Lord is knocked to his knees, and as he raises his sword to \nblock another onslaught, Luke slashes Vader's right hand off at the \nwrist, causing metal and electronic parts to fly from the mechanical \nstump. Vader's sword clatters uselessly away, over the\nedge of the platform and into the bottomless shaft below. Luke moves \nover Vader and holds the blade of his sword to the Dark Lord's throat. \nThe Emperor watches with uncontrollable, pleased agitation.\n\nEMPEROR\nGood! Your hate has made you powerful. Now, fulfill your destiny and \ntake your father's\nplace at my side!\n\nLuke looks at his father's mechanical hand, then to his own mechanical, \nblack-gloved hand, and realizes how much he is becoming like his \nfather. He makes the decision for which he has spent a lifetime in \npreparation. Luke steps back and hurls his lightsaber away.\n\nLUKE\nNever! I'll never turn to the dark side. You've failed, Your Highness. \nI am a Jedi,\nlike my father before me.\n\nThe Emperor's glee turns to rage.\n\nEMPEROR\nSo be it...Jedi.\n\n123  EXT FOREST - GENERATOR BUNKER\n\nHan and several of the fighters run out of the bunker and race across \nthe clearing.\n\nHAN\nMove! Move!\n\nA shock wave knocks them flat as the bunker explodes, followed by a \nspectacular display as the huge shield-generator radar dish explodes \nalong with the bunker.\n\n124  INT REBEL STAR CRUISER - BRIDGE\n\nAckbar, sitting in his control chair, speaks into the radio.\n\nACKBAR\nThe shield is down! Commence attack on theDeath Star's main reactor.\n\nLANDO\nWe're on our way. Red Group, Gold Group, all fighters follow me. \n(laughs)\nTold you they'd do it!\n\nThe Falcon, followed by several smaller Rebel fighters, heads toward \nthe unfinished superstructure of the Death Star.\n\n125  INT EMPEROR'S TOWER - THRONE ROOM\n\nLuke stands still, as the Emperor reaches the bottom of thestairs. The \nEmperor's laughter has turned to anger. He raises his arms toward Luke.\n\nEMPEROR\nIf you will not be turned, you will be destroyed.\n\nBlinding bolts of energy, evil lightning, shoot from the Emperor's \nhands at Luke. Even in his surprise, the young Jedi tries to use the \nForce to deflect them. At first he is half successful, but after a \nmoment the bolts of energy are coming with such speed and power the \nyoung Jedi shrinks before them, his knees buckling. The wounded Vader \nstruggles to his feet, and moves to stand at his master's side.\n\nEMPEROR\nYoung fool...only now, at the end, do you understand.\n\nLuke is almost unconscious beneath the continuing assault of the \nEmperor's lightning. He clutches a canister to keep from falling into \nthe bottomless shaft as the bolts tear through him.\n\nEMPEROR\nYour feeble skills are no match for the power of the dark side. You \nhave paid the price for\nyour lack of vision.\n\nLuke writhes on the floor in unbearable pain, reaching weakly up toward \nwhere Vader stands watching.\n\nLUKE\t (groans)\nFather, please. Help me.\n\nAgain Vader stands, watching Luke. He looks at his master, the Emperor, \nthen back to Luke on the floor.\n\nEMPEROR\nNow, young Skywalker...you will die.\n\nAlthough it would not have seemed possible, the outpouring of bolts \nfrom the Emperor's fingers actually increases in intensity, the sound \nscreaming through the room. Luke's body writhes in pain.\n\nVader grabs the Emperor from behind, fighting for control of the robed \nfigure despite the Dark Lord's weakened body and gravely weakened arm. \nThe Emperor struggles in his embrace, his bolt-shooting hands now \nlifted high, away from Luke. Now the white lightning arcs back to \nstrike at Vader. He stumbles with his load as the sparks rain off his \nhelmet and flow down over his black cape. He holds his evil master high \nover his head and walks to the edge of the abyss at the central core of \nthe throne room. With one final burst of his once awesome strength, \nDarth Vader hurls the Emperor's body into the bottomless shaft.\n\nThe Emperor's body spins helplessly into the void, arcing as it falls \ninto the abyss. Finally, when the body is far down the shaft, it \nexplodes, creating a rush of air through the room.Vader's cape is \nwhipped by the wind and he staggers, and collapses toward the \nbottomless hole. Luke crawls to his father's side and pulls him away \nfrom the edge of the abyss to safety. Both the young Jedi and the giant \nwarrior are too weak to move.\n\n126  EXT/INT - SPACE BATTLE - FIGHTER AND DEATH STAR\n\nRebel fighters follow the Falcon across the surface of the Death Star \nto the unfinished portion, where they dive into the superstructure of \nthe giant battle station, followed by many TIE fighters.\n\nWEDGE\nI'm going in.\n\nLANDO\nHere goes nothing.\n\nThree X-wings lead the chase through the ever-narrowing shaft, followed \nby the Falcon and four other fighters, plus TIE fighters who \ncontinually fire at the Rebels. Lights reflect off the pilot's faces as \nthey race through the dark shaft.\n\nLANDO\nNow lock onto the strongest power source. It should be the power \ngenerator.\n\nWEDGE\nForm up. And stay alert. We could run out of space real fast.\n\nThe fighters and the Falcon race through the tunnel, still pursued by \nthe TIE fighters. One of the X-wings is hit from behind and explodes.\n\nLANDO\nSplit up and head back to the surface. See if you can get a few of \nthose TIE fighters to\nfollow you.\n\nPILOT\nCopy, Gold Leader.\n\nThe Rebel ships peel off pursued by three of the TIE's, while Lando and \nWedge continue through the main tunnel. It narrows, and the Falcon \nscrapes the side dangerously. Two other TIE fighters continue to blast \naway at them.\n\nLANDO\nThat was too close.\n\nNien Nunb agrees. The battle between the Rebel and Imperial fleet rages \non. Several cruisers fire at the giant Super Star Destroyer.\n\n127  INT REBEL STAR CRUISER - BRIDGE\n\nACKBAR\nWe've got to give those fighters more time. Concentrate all fire on \nthat Super Star Destroyer.\n\nX-wings pilots head across the surface of the huge battleship.\n\n128  INT VADER'S STAR DESTROYER - BRIDGE\n\nAdmiral Piett and a commander stand at the window, looking out to the \nbattle. They look concerned.\n\nCONTROLLER\nSir, we've lost our bridge deflector shield.\n\nPIETT\nIntensify the forward batteries. I don't want anything to get through.\n\nThe commander is looking out of the window where a damaged Rebel \nfighter is out of control and heading directly toward the bridge.\n\nPIETT\nIntensify forward firepower!\n\nCOMMANDER\nIt's too late!\n\nThe Rebel pilot screams as his ship hits the Star Destroyer, causing a \nhuge explosion. The giant battle ship loses control, crashes into the \nDeath Star, and explodes.\n\n129  INT REBEL STAR CRUISER - BRIDGE\n\nThere is excitement on the bridge as the battle rages on all sides. \nThey cheer as the giant Star Destroyer blows up.\n\n130  INT DEATH STAR - MAIN DOCKING BAY\n\nChaos. For the first time, the Death Star is rocked by explosions as \nthe Rebel fleet, no longer backed against a wall, zooms over, unloading \na heavy barrage. Imperial troops run in all directions, confused and \ndesperate to escape.\n\nIn the midst of this uproar, Luke is trying to carry the enormous \ndeadweight of his father's weakening body toward an Imperial shuttle. \nFinally, Luke collapses from the strain. The explosions grow louder as \nVader draws him closer.\n\nVADER\t (a whisper)\nLuke, help me take this mask off.\n\nLURE\nBut you'll die.\n\nVADER\nNothing can stop that now. Just for once... let me look on you with my \nown eyes.\n\nSlowly, hesitantly, Luke removes the mask from his father's face. There \nbeneath the scars is an elderly man. His eyes do not focus. But the \ndying man smiles at the sight before him.\n\nANAKIN\t (very weak)\nNow...go, my son. Leave me.\n\nLUKE\nNo. You're coming with me. I can't leave you here. I've got to save \nyou.\n\nANAKIN\nYou already have, Luke. You were right about me. Tell your sister...you \nwere right.\n\nLUKE\nFather...I won't leave you.\n\nDarth Vader, Anakin Skywalker...Luke's father, dies.\n\nA huge explosion rocks the docking bay. Slowly, Luke rises and, half \ncarrying, half dragging the body of his father, stumbles toward a \nshuttle.\n\n131  EXT DEATH STAR\n\nThe Millennium Falcon leads a swerving bomb run through the immense \nsuperstructure of the half-built Death Star. The Rebel Star Cruisers \noutside continually bombard the huge station. And each direct hit is \nanswered by resonating, chain-reaction explosions within the station \nitself.\n\n132  INT MILLENNIUM FALCON - COCKPIT AND GUN PORTS\n\nLando's crew fires away at the pursuing TIE fighters as the dashing \nBaron of Bespin and his alien copilot home in on the main reactor \nshaft. It is awesome. A lone X-wing is just in front of the Falcon.\n\nWEDGE\nThere it is!\n\nLANDO\nAll right, Wedge. Go for the power regulator on the north tower.\n\nWEDGE\nCopy, Gold Leader. I'm already on my way out.\n\nThe X-wing heads for the top of the huge reactor and fires several \nproton torpedoes at the power regulator, causing a series of small \nexplosions.\n\nThe Falcon heads for the main reactor, and when it is dangerously \nclose, Lando fires the missiles, which shoot out of the Falcon with a \npowerful roar, and hit directly at the center of the main reactor.\n\nHe maneuvers the Falcon out of the winding superstructure just ahead of \nthe continuing chain of explosions.\n\n133  INT REBEL STAR CRUISER - BRIDGE\n\nAckbar and other Mon Calamari lean on the railing of the bridge, \nwatching the large screen showing the Death Star in the main briefing \nroom.\n\nACKBAR\nMove the fleet away from the Death Star.\n\n134  EXT DEATH STAR\n\nAn Imperial shuttle, with Luke alone in the cockpit, rockets out of the \nmain docking bay as that entire section of the Death Star is blown \naway.\n\nFinally, just as it looks like the Falcon will not make it, Lando \nexpertly pilots the craft out of the exploding superstructure and \nwhizzes toward the Sanctuary Moon, only a moment before the Death Star \nsupernovas into oblivion.\n\n135  INT MILLENNIUM FALCON - COCKPIT\n\nLando and Nien Nunb laugh and cheer in relief.\n\n136  EXT ENDOR FOREST\n\nHan and Leia, Chewie, the droids, the Rebel troops, and the Ewoks all \nlook to the sky as the Death Star reveals itself in a final flash of \nself-destruction. They all cheer.\n\nTHREEPIO\nThey did it!\n\nHan looks town from the sky to Leia, a look of concern on his face. \nLeia continues to look at the sky as though listening for a silent \nvoice.\n\nHAN\nI'm sure Luke wasn't on that thing when it blew.\n\nLEIA\nHe wasn't. I can feel it.\n\nHAN\nYou love him, don't you?\n\nLeia smiles, puzzled.\n\nLEIA\nYes.\n\nHAN\nAll right. I understand. Fine. When he comes back, I won't get in the \nway.\n\nShe realizes his misunderstanding.\n\nLEIA\nOh. No, it's not like that at all. He's my brother.\n\nHan is stunned by this news. She smiles, and they embrace.\n\n137  EXT ENDOR FOREST - NIGHT\n\nLuke sets a torch to the logs stacked under a funeral pyre where his \nfather's body lies, again dressed in black mask and helmet. He stands, \nwatching sadly, as the flames leap higher to consume Darth Vader -- \nAnakin Skywalker.\n\nIn the sky above, fireworks explode and Rebel fighters zoom above the \nforest.\n\n138  EXT EWOK VILLAGE SQUARE - NIGHT\n\nA huge bonfire is the centerpiece of a wild celebration. Rebels and \nEwoks rejoice in the warm glow of firelight, drums beating, singing, \ndancing, and laughing in the communal language of victory and \nliberation.\n\nLando runs in and is enthusiastically hugged by Han and Chewie. Then, \nfinally, Luke arrives and the friends rush to greet and embrace him. \nThey stand close, this hardy group, taking comfort in each other's \ntouch, together to the end.\n\nRebels and Ewoks join together in dancing and celebration. The original \ngroup of adventurers watch from the sidelines. Only Luke seems \ndistracted, alone in their midsts, his thoughts elsewhere.\n\nHe looks off to the side and sees three shimmering, smiling figures at \nthe edge of the shadows: Ben Kenobi, Yoda, and Anakin Skywalker.\n\nFADE OUT\n\nEND CREDITS OVER STAR FIELD\n\n\n\n\nStar Wars: Return of the Jedi\nWriters :   George Lucas  Lawrence Kasdan\nGenres :   Fantasy  Sci-Fi  Action  Adventure\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:36:22.143628"}