{"title": "Star Wars: The Phantom Menace", "film_link": "/Movie Scripts/Star Wars: The Phantom Menace Script.html", "script_link": "/scripts/Star-Wars-The-Phantom-Menace.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Star Wars: The Phantom Menace Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Star Wars: The Phantom Menace Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/8-stars.gif\"/> (7.56 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=George Lucas\" title=\"Scripts by George Lucas\">George Lucas</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/><br/>\n<b>Script Date</b> :  1999<br/>\n<br/>\n<a href=\"/scripts/Star-Wars-The-Phantom-Menace.html\">Read \"Star Wars: The Phantom Menace\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>Star Wars: Episode 1:The Phantom Menace\n\n\n\nTITLE CARD : A long time ago in a galaxy far, far away....\n\nA vast sea of stars serves as the backdrop for the main title, followed by\na roll up, which crawls up into infinity.\n\n<b>EPISODE 1 THE PHANTOM MENACE\n</b>\nTurmoil has engulfed the Galactic Republic. The taxation of trade routes to\noutlaying star systems is in dispute.\nHoping to resolve the matter with a blockade of deadly battleships, the\ngreedy Trade Federation has stopped all shipping to the small planet of\nNaboo.\nWhile the congress of the Republic endlessly debates this alarming chain of\nevents, the Supreme Chancellor has secretly dispatched two Jedi Knights,\nthe guardians of peace and justice in the galaxy, to settle the\nconflict.....\n\nPAN DOWN to reveal a small space cruiser heading TOWARD CAMERA at great\nspeed. PAN with the cruiser as it heads towardthe beautiful green planet of\nNaboo, which is surrounded by hundreds of Trade Federation battleships.\n\n<b>INT. REPUBLIC CRUISER - COCKPIT\n</b>\n\nIn the cockpit of the cruise, the CAPTAIN and PILOT maneuver closer to one\nof the battleships.\n\nQUI-GON : (off screen voice) Captain.\n\nThe Captain turns to an unseen figure sitting behind her.\n\nCAPTAIN : Yes, sir?\nQUI-GON : (V.O) Tell them we wish to board at once.\nCAPTAIN : Yes, sir.\n\nThe CAPTAIN looks to her view screen, where NUTE GUNRAY, a Neimoidian trade\nviceroy, waits for a reply.\n\nCAPTAIN : (cont'd) With all due respect for the Trade Federation, the\nAmbassodors for the Supreme Chancellor wish to board immediately.\nNUTE : Yes, yes, of coarse...ahhh...as you know, our blockade is perfectly\nlegal, and we'd be happy to recieve the Ambassador...Happy to.\n\nThe screen goes black. Out the cockpit window, the sinister battleship\nlooms ever closer.\n\n<b>EXT. FEDERATION BATTLESHIP - DOCKING BAY - SPACE (FX)\n</b>\nThe small space cruiser docks in the enormous main bay of the Federation\nbattleship.\n\n<b>INT. FEDERATION BATTLESHIP - DOCKING BAY - SPACE\n</b>\nA PROTOCOL DROID, TC-14, waits at the door to the docking bay. Two WORKER\nDROIDS, PK-4 and EG-9 watch.\n\nPK-4 : They must be important if the Viceroy sent one of those useless\nprotocol gearheads to greet them.\n\nThe door opens, and the Republic cruiser can be seen in the docking bay.\nTwo darkly robed figures are greeted by TC-14.\n\nTC-14 : I'm TC-14 at your service. This way, please.\n\nThey move off down the hallway.\n\nEG-9 : A Republic cruiser! That's trouble...don't you think?\nPR-4 : I'm not made to think.\n\n<b>INT. FEDERATION BATTLESHIP - CONFERENCE ROOM\n</b>\nA door slides open, and the two cloaked shapes are led PAST CAMERA into the\nformal conference room by TC-14.\n\nTC-14 : I hope you honoured sirs with the most comfortable here. My master\nwill be with you shortly.\n\nThe droid bows before OBI-WAN KENOBI and QUI- GON JINN. He backs out the\ndoor and it closes. The JEDI lower their hoods and look out a large window\nat the lush green planet of Naboo. QUI-GON sixty years old, has long white\nhair in a ponytail. He is tall and striking, with blue eyes. OBI-WAN is\ntwenty five, with very short brown hair, pale skin, and blue eyes. Several\nexotic, bird-like creatures SING in a cage near the door.\n\nOBI-WAN : I have a bad feeling about this.\nQUI-GON : I don't sense anything.\nOBI-WAN : It's not about the mission, Master, it's\nsomethging...elsewhere...elusive.\nQUI-GON : Don't center on your anxiety, Obi-Wan. Keep your concentration\nhere and now where it belongs.\nOBI-WAN : Master Yoda says I should be mindful of the future...\nQUI-GON : .....but not at the expense of the moment. Be mindful of the\nliving Force, my young Padawan.\nOBI-WAN : Yes, Master...how do you think the trade viceroy will deal with\nthe chancellor's demands?\nQUI-GON : These Federation types are cowards. The negotiations will be\nshort.\n\n<b>INT. FEDERATION BATTLESHIP - BRIDGE\n</b>\nNUTE GUNRAY and DAULTRAY DOFINE stand, stunned, before TC-14.\n\nNUTE : (shaken) What?!? What did you say?\nTC-14 : The Ambassadors are Jedi Knights, I believe.\nDOFINE : I knew it! They were sent to force a settlement, eh. Blind me,\nwe're done for!\n\n<b>INT. FEDERATION BATTLESHIP - HALLWAY\n</b>\nA hologram of NUTE , surrounded by BATTLE DROIDS, appears in the conference\nroom hallway.\n\nNUTE : They must be dead by now. Blast, what's left of them.\n\nThe hologram fades off, as a BATTLE DROID, OWO-1, cautiously opens the\ndoor. A deadly green cloud billows from the room. BATTLE DROIDS cock their\nweapons as a figure stumbles out of the smoke. It is TC-14 , carrying the\ntray of drinks.\n\nTC14 : Oh, excuse me, so sorry.\n\nThe PROTOCOL DROID passes the armed camp just as two flashing laser swords\nfly out of the deadly fog, cutting down several BATTLE DROIDS before they\ncan fire.\n\n<b>INT. FEDERATION BATTLESHIP - BRIDGE\n</b>\nThe bridge is a cocophony of alarms. NUTE and RUNE watch OWO-1 on the\nviewscreen.\n\nOWO-1 : Not sure exactly what...\n\nOWO-1 is suddenly cut in half in mid-sentence. RUNE gives NUTE a worried\nlook.\n\nNUTE : What in blazes is going on down there?\nRUNE : Have you ever encountered a Jedi Knight before, sir?\nNUTE : Well, not exactly, but I don't...(panicked) Seal off the bridge.\nRUNE : That won't be enough, sir.\n\nThe doors to the bridge SLAM shut.\n\nNUTE : I want destroyer droids up here at once!!!\nRUNE : We will not survive this.\n\n<b>INT. FEDERATION BATTLESHIP - HALLWAY - OUTSIDE BRIDGE\n</b>\nQUI-GON cuts several BATTLE DROIDS in half, creating a shower of sparks and\nmetal parts. OBI-WAN raises his hand, sending several BATTLE DROIDS\ncrashing into the wall.\n\nQUI-GON makes his way to the bridge door and begins to cut through it.\n\n<b>INT. FEDERATION BATTLESHIP - BRIDGE\n</b>\nThe CREW is very nervous as sparks start flying around the bridge door.\nQUI-GON and OBI-WAN are on the view screen.\n\nNUTE : Close the blast doors!!!\n\nThe huge, very thick blast door slams shut, followed by a second door, then\na third. There is a hissing sound as the huge doors seal shut. QUI-GON tabs\nthe door with his sword. The screen goes black as a red spot appears in the\ncenter of the blast door.\n\nRUNE : ...They're still coming through!\n\nOn the door, chunks of molten metal begin to drop away.\n\nNUTE : Impossible!! This is impossible!!\nRUNE : Where are those destroyer droids?!\n\n<b>INT. FEDERATION BATTLESHIP - HALLWAY - OUTSIDE BRIDGE\n</b>\nTen ugly destroyer WHEEL DROIDS roll down the hallway at full speed. Just\nbefore they get to the bridge area, they stop and transform into their\nbattle configuration. QUI-GON can't see them but senses their presence.\n\nQUI-GON : Destroyer droids!\nOBI-WAN : Offhand, I'd say this mission is past the negotiaion stage.\n\nThe WHEEL DROIDS, led by P-59, rush the entry area from three hallways,\nblasting away with their laser guns. They stop firing and stand in a\nsemi-circle as the smoke clears. OBI-WAN and QUI-GON are nowhere to be\nseen.\n\nP-59 : Switch to bio...There they are!\n\nThe Jedi materialize at the far end of the hallway and dash through the\ndoorway that slams shut. The WHEEL DROIDS blast away at the two JEDI with\ntheir laser swords.\n\nOBI-WAN : They have shield generators!\nQUI-GON : It's a standoff! Let's go!\n\n<b>INT. FEDERATION BATTLESHIP - BRIDGE\n</b>\nNUTE and RUNE stand on the bridge, watching the view screen as the WHEEL\nDROIDS' POV speeds to the doorway.\n\nRUNE : We have them on the run, sir...they're no match for destroyer\ndroids.\nTEY HOW : Sir, they've gone up the ventilation shaft.\n\n<b>INT. FEDERATION BATTLESHIP - MAIN BAY\n</b>\nQUI-GON and OBI-WAN appear at a large vent in a giant hanger bay. They are\ncareful not to be seen. Thousands of BATTLE DROIDS are loading onto landing\ncraft.\n\nQUI-GON : Battle droids.\nOBI-WAN : It's an invisible army.\nQUI-GON : It's an odd play for the Trade Federation. We've got to warn the\nNaboo and contact Chancellor Valorum. Let's split up. Stow aboard separate\nships and meet down on the planet.\nOBI-WAN : You were right about one thing, Master. The negotiations were\nshort.\n\n<b>INT. FEDERATION BATTLESHIP - BRIDGE\n</b>\nTEY HOW recieves a transmission.\n\nTEY HOW : Sir, a transmission from the planet.\nRUNE : It's Queen Amidala herself.\nNUTE : At last we're getting results.\n\nOn the view screen, QUEEN AMIDALA appears in her throne room. Wearing her\nelaborate headdress and robes, she sits, surrounded by the GOVERNING\nCOUNCIL and FOUR HANDMAIDENS, EIRTAE, YANE, RABE, and SACHE.\n\nNUTE : (cont'd) Again you come before me, Your highness. The Federation is\npleased.\nAMIDALA : You will not be pleased when you hear what I have to say,\nViceroy...Your trade boycott of our planet has ended.\n\nNUTE smirks at RUNE.\n\nNUTE : I was not aware of such a failure.\nAMIDALA : I have word that the Senate is finally voting on this blockade of\nyours.\nNUTE : I take it you know the outcome. I wonder why they bother to vote.\nAMIDALA : Enough of this pretense, Viceroy! I'm aware the Chancellor's\nAmbassadors are with you now, and that you have beencommanded to reach a\nsettlement.\nNUTE : I know nothing about any Ambassadors...you must be mistaken.\n\nAMIDALA, surprised at his reaction, studies him carefully.\n\nAMIDALA : Beware, Viceroy....the Federation is going too far this time.\nNUTE : Your Highness, we would never do anything without the approval of\nthe Senate. You assume too much.\nAMIDALA : We will see.\n\nThe QUEEN fades off, and the view screen goes black.\n\nRUNE : She's right, the Senate will never....\nNUTE : It's too late now.\nRUNE : Do you think she suspects an attack?\nNUTE : I don't know, but we must move quickly to disrupt all communications\ndown there.\n\n<b>INT. NABOO PALACE - THRONE ROOM\n</b>\nThe QUEEN, EIRTAE, SACHE and her Governor, SIO BIBBLE, stand before a\nhologram of SENATOR PALPATINE, a thin, kindly man.\n\nPALPATINE : ...How could that be true? I have assurances from the\nChancellor...his Ambassaodrs did arrive. It must be\nthe...get...negotiate...\n\nThe hologram of PALPATIONE sputters and fades away.\n\nAMIDALA : Senator Palpatine?!? (turns to Panaka) What's happening?\n\nCAPTAIN PANAKA turns to his SARGEANT\n\nCAPT. PANAKA : Check the transmission generators...\nBIBBLE : A malfunction?\nCAPT. PANAKA : It could be the Federation jamming us. Your Highness.\nBIBBLE : A communications disruption can only mean one thing. Invasion.\nAMIDALA : Don't jump to conclusions, Governor. The Federation would not\ndare go that far.\nCAPT. PANAKA : The Senate would revoke their trade franchise, and they'd be\nfinished.\nAMIDALA : We must continue to rely on negotiation.\nBIBBLE : Negotiation? We've lost all communications!...and where atre the\nChancellors Ambassadors? How can we negotiate? We must prepare to defend\nourselves.\nCAPT. PANAKA : This is a dangerous situation, Your Highness. Our security\nvolunteers will be no match against a battle-hardened Federation army.\nAMIDALA : I will not condone a course of action that will lead us to war.\n\n<b>EXT. SPACE LANDING CRAFT - TWILIGHT (FX)\n</b>\nSix landing craft fly in formation toward the surface of the planet Naboo.\n\n<b>EXT. NABOO SWAMP - SHALLOW LAKE - TWILIGHT\n</b>\nThree landing craft slowly descend through the cloud cover of the\nperpetually gray twilight side of the planet. One by one, the Federation\nwarships land in the eerie swamp.\nOBI-WAN's head emerges from the mud of a shallow lake. For in the\nbackground, the activities of the invasion force can be seen in the mist.\nOBI-WAN takes several deep breaths, then dissapears again under the muddy\nswamp. Troop Transports (MTT's) emerge from the landing craft.\n\n<b>EXT. NABOO EDGE OF SWAMP / GRASS PLAINS - TWILIGHT (FX)\n</b>\nThe droid invasion force moves out of the swamp and onto a grassy plain.\nOOM-9, in his tank, looks out over the vast ARMY marching across the\nrolling hills. A small hologram of RUNE and NUTE stands on the tank.\n\nRUNE : ...and there is no trace of the Jedi. They may have gotton onto one\nof your landing craft.\nOOM-9 : If they are down here, sir, we'll find them. We are moving out of\nthe swamp and are marching on the cities. We are meeting no resistance.\nNUTE : Excellent.\n\n<b>EXT. NABOO SWAMP - TWILIGHT\n</b>\nQUI-GON runs through the strange landscape, glancing back to see the\nmonstrous troop transports, emerging from the mist. Animals begin to run\npast him in a panic.\nAn odd, frog-like Gungan, JAR JAR INKS, squats holding a clam he has\nretrieved from the murky swamp. The shell pops open. JAR JAR's greta tongue\nsnaps out and grabs the clam, swallowing it in one gulp.\nJAR JAR looks up and sees QUI-GON and the other creatures running like the\nwind toward him. One of the huge MTT's bears down on the JEDI like a\ncharging locomotive. JAR JAR stands transfixed, still holding the clam\nshell in one hand.\n\nJAR JAR : Oh, noooooooooo!\n\nJAR JAR drops the shell and grabs onto QUI-GON as he passes. The JEDI is\ncaught by surprise.\n\nJAR JAR : (Cont'd) Hey, help me! Help me!!\nQUI-GON : Let go!\n\nThe machine is about tp crush them as QUI-GON drags JAR JAR behind him.\nJust as the transport is about to hit them, QUI-GON drops, and JAR JAR goes\nsplat into the mud with him. The transport races overhead.\nQUI-GON and JAR JAR pull themselves out of the mud. They stand watching the\nwar machine dissapear into the mist. JAR JAR grabs QUI-GON and hugs him.\n\nJAR JAR : Oyi, mooie-mooie! I luv yous!\n\nThe frog-like creature kisses the JEDI.\n\nQUI-GON : Are you brainless? You almost got us killed!\nJAR JAR : I spake.\nQUI-GON : The ability to speak does not make you intelligent. Now get outta\nhere!\n\nQUI-GON starts to move off, and JAR JAR follows.\n\nJAR JAR : No...no! Mesa stay...Mesa yous humble servaunt.\nQUI-GON : That wont be necessary.\nJAR JAR : Oh boot tis! Tis demunded byda guds. Tis a live debett, tis. Mesa\nculled Jaja Binkss.\n\nIn the distance, two STAPS burst out of the mist at high speed, chasing\n<b>OBI-WAN.\n</b>\nQUI-GON : I have no time for this now...\nJAR JAR : Say what?\n\nThe two STAPS barrell down on OBI-WAN.\n\nJAR JAR : (cont'd) Oh, nooooo! Weesa ganna....\n\nQUI-GON throws JAR JAR into the mud.\n\nQUI-GON : Stay down!\n\nHis head pops up.\n\nJAR JAR : ...dieeee!\n\nThe two troops fire laser bolts at OBI-WAN. QUI-GON deflects the bolts\nback, and the STAPS blow up. One-two. OBI-WAN is exhausted and tries to\ncatch his breath.\n\nOBI-WAN : Sorry, Master, the water fried my weapon.\n\nOBI-WAN pulls out his burnt laser sword handle. QUI-GON inspects it, as JAR\nJAR pulls himself out of the mud.\n\nQUI-GON : You forgot to turn your power off again, didn't you?\n\nOBI-WAN nods sheeplishly.\n\nQUI-GON : (cont'd) It won't take long to recharge, but this is a lesson I\nhope you've learned, my young Padawan.\nOBI-WAN : Yes, Master.\nJAR JAR : Yousa sav-ed my again, hey?\nOBI-WAN : What's this?\nQUI-GON : A local. Let's go, before more of those droids show up.\nJAR JAR : Mure? Mure did you spake??!?\n\nOBI-WAN and QUI-GON start to run. JAR JAR tries to keep up.\n\nJAR JAR : (cont'd) Ex-squeeze me, but da moto grande safe place would be\nOtoh Gunga. Tis where I grew up...Tis safe city.\n\nThey all stop.\n\nQUI-GON : A city! (JAR JAR nods his head) Can you take us there?\nJAR JAR : Ahhh, will...on second taut...no, not willy.\nQUI-GON : No??!\nJAR JAR : Iss embarrissing, boot... My afrai my've bean banished. My\nforgoten der Bosses would do terrible tings to my. Terrible tings if my\ngoen back dare.\n\nA PULSATING SOUND is heard in the distance.\n\nQUI-GON : You hear that?\n\nJAR JAR shakes his head yes.\n\nQUI-GON : (cont'd) That's the sound of a thousand terrible things heading\nthis way...\nOBI-WAN : When they find us, they will crush us, grind us into little\npieces, then blast us into oblivion!\nJAR JAR : Oh! Yousa point is well seen. Dis way! Hurry!\n\nJAR JAR turns and runs into the swamp.\n\n<b>EXT. NABOO SWAMP LAKE - TWILIGHT\n</b>\nQUI-GON, OBI-WAN and JAR JAR run into a murky lake and stop as JAR JAR\ntries to catch his breath. The TRANSPORTS ARE HEARD in the distance.\n\nQUI-GON : Much farther?\nJAR JAR : Wesa goen underwater, okeyday?\n\nQUI-GON and OBI-WAN pull out small capsule from their utility belts that\nturn into breathing masks.\n\nJAR JAR : (cont'd) My warning yous. Gungans no liken outlaunders. Don't\nexpict a wern welcome.\nOBI-WAN : Don't worry, this has not been our day for warm welcomes.\n\nJAR JAR jumps, does a double somersault with a twist, and dives into the\nwater.\nBreath masks on, QUI-GON and OBI-WAN wade in after him.\n\n<b>EXT. NABOO LAKE - UNDERWATER\n</b>\nQUI-GON and OBI-WAN swim behind JAR JAR, who is very much at home in the\nwater. Down they swim into murky depths. In the distance the glow of Otoh\nGunga, an underwater city made up of large bubbles, becomes more distinct.\nThey approach the strange, art nouveau habitat. JAR JAR swims magically\nthrough one of the bubble membranes, which seals behind him. OBI-WAN and\nQUI-GON follow.\n\n<b>INT. OTOH GUNGA - CITY SQUARE\n</b>\nGUNGANS in the square scatter when they see the strange JEDI. Four GUARDS\narmed with long electro-poles ride two-legged KAADUS into the square. The\nGUARDS, led by CAPTAIN TARPALS, point their lethal poles at the dripping\ntrio.\n\nJAR JAR : Heyo-dalee, Cap'n Tarpals, Mesa back!\nCAPT. TARPALS : Noah gain, Jar Jar. Yousa goen tada Bosses. Yousa in big\ndudu this time.\n\nCAPT. TARPALS gives JAR JAR a slight zap with his power pole. JAR JAR jumps\nand moves off, followed by the two JEDI.\n\nJAR JAR : How wude.\n\n<b>INT. OTOH GUNGA - HIGH TOWER BOARD ROOM\n</b>\nThe Bosses' Board Room has bubble walls, with small lighted fish swimming\naround outside like moving stars. A long circular judge's bench filled with\nGUNGAN OFFICIALS dominates the room. OBI-WAN and QUI-GON stand facing BOSS\nNASS, who sits on a bench higher than the others.\n\nBOSS NASS : Yousa cannot bees hair. Dis army of mackineeks up dare tis new\nweesong!\nQUI-GON : That droid army is about to attack the Naboo. We must warn them.\nBOSS NASS : Wesa no like da Naboo! Un dey no like uss-ens. Da Naboo tink\nday so smarty den us-ens. Day tink day brains so big.\nOBI-WAN : After those droids take control of the surface, they will come\nhere and take control of you.\nBOSS NASS : No, mesa no tink so. Mesa scant talkie witda Naboo, and no\nnutten talkie it outlaunders. Dos mackineeks no comen here! Dey not know of\nuss-en.\nOBI-WAN : You and the Naboo form a symbiont circle. What happens to noe of\nyou will affect the other. You must understand this.\nBOSS NASS : Wesa wish no nutten in yousa tings, outlaunder, and wesa no\ncare-n about da Naboo.\nQUI-GON : (waves his hand) Then speed us on our way.\nBOSS NASS : Wesa gonna speed yousaway.\nQUI-GON : We need a transport.\nBOSS NASS : Wesa give yousa una bongo. Da speedest way tooda Naboo tis goen\nthrough da core. Now go.\nQUI-GON : Thank you for your help. We go in peace.\n\nQUI-GON and OBI-WAN turn to leave.\n\nOBI-WAN : Master, whats a bongo?\nQUI-GON : A transport, I hope.\n\nThe JEDI notice JAR JAR in chains to one side, waiting to hear his verdict.\nQUI-GON stops. JAR JAR gives him a forlorn look.\n\nJAR JAR : Daza setten yous up. Goen through da planet core is bad bombin!!\nQUI-GON : Thank you, my friend.\nJAR JAR : Ahhh...any hep hair would be hot.\n\nJAR JAR's soulful look is counterpointed by a sheepish grin.\n\nOBI-WAN : We are short of time, Master.\nQUI-GON : We'll need a navigator to get us through the planet's core. This\nGungan my be of help.\n\nQUI-GON walks bact to BOSS NASS.\n\nQUI-GON : (cont'd) What is to become of Jar Jar Binks here?\nBOSS NASS : Binkss brokeen the nocombackie law. Hisen to be pune-ished.\nQUI-GON : He has been a great help to us. I hope the punishment will not be\ntoo severe.\nBOSS NASS : Pounded unto death.\nJAR JAR : (grimacing) Oooooh...Ouch!\n\nOBI-WAN looks concerned. QUI-GON is thinking.\n\nQUI-GON : We need a navigator to get us through the planet's core. I have\nsaved Jar Jar Binks' life. He owes me what you call a \"life.debt.\"\nBOSS NASS : Binks. Yousa havena liveplay with thisen hisen?\n\nJAR JAR nods and joins the JEDI. QUI-GON waves his hand.\n\nQUI-GON : Your gods demand that his life belongs to me now.\nBOSS NASS : Hisen live tis yos, outlauder. Begone wit him.\nJAR JAR : Count mesa outta dis! Better dead here, den deader in da\ncore...Yee guds, whata mesa sayin?!\n\n<b>EXT. NABOO CITY - UNDERWATER - SUB (FX)\n</b>\nA strange little submarine propels itself away from the Otoh Gunga, leaving\nthe glow of the settlement in the distance.\n\n<b>INT. SUB COCKPIT - UNDERWATER\n</b>\nOBI-WAN in the co-pilots seat, JAR JAR guides the craft.\n\nJAR JAR : Dis is nusen.\nOBI-WAN : Master, why do you keep dragging these pathetic life forms along\nwith us?...Here, take over.\nJAR JAR : Hey, ho? Where wesa goen??\nQUI-GON : You're the navigator.\nJAR JAR : Yo dreamen mesa hopen...,br QUI-GON : Just relax, the Force will\nguide us...\nJAR JAR : Ooooh, maxibig...\"da Force\"...Wellen, dat smells stinkowiff.\n\nJAR JAR veers the craft to the left and turns the lights on. The coral\nvistas are grand, fantastic, and wonderous.\n\nOBI-WAN : Why were you banished, Jar Jar?\nJAR JAR : Tis a long tale, buta small part wawdabe\nmesa...ooooh...aaaa.....clumsy.\nOBI-WAN : They banished you because you're clumsy?\n\nAs the little sub glides into the planet core, a large dark shape begins to\nfollow.\n\nJAR JAR : Mesa cause-ed mabee one or duey lettal bitty axadentes...yud-say\nboom da gasser, un crash Der Bosses heyblibber...den banished.\n\nSuddenly there is a loud CRASH, and the little craft lurches to one side.\nQUI-GON looks around and sees a huge, lumimnous OPEE SEA KILLER has hooked\nthem with its long gooey tongue.\n\nQUI-GON : Full speed ahead.\n\nInstead of full ahead, JAR JAR jams the controls into reverse. The sub\nflies into the mouth of the creature.\n\nJAR JAR : Oooops.\nOBI-WAN : Give me the controls.\n\nOBI-WAN takes over the controls and the OPEE SEA KILLER instantly releases\nthe sub from its mouth.\n\nJAR JAR : Wesa free!\n\nAs the sub zooms away they see a larger set of jaws, munching on the\nhapless KILLER. The jaws belong to the incredible SANDO AQUA MONSTER. The\nlights on the tiny sub begin to flicker as they cruise deeper into the\ngloom.\n\nQUI-GON : There's always a bigger fish.\n\n<b>INT. FEDERATION BATTLESHIP - BRIDGE\n</b>\nNUTE and RUNE stand before a hologram of DARTH SIDIOUS.\n\nNUTE : The invasion is on schedule, My Lord.\nDARTH SIDIOUS : Good. I have the Senate bogged down in procedures. By the\ntime this incident comes up for a vote, they will have no choice but to\naccept your control of the system.\nNUTE : The Queen has great faith the Senate will side with her.\nDARTH SIDIOUS : Queen Amidala is yound and naive. You will find controlling\nher will not be difficult. You have done well, Viceroy.\nNUTE : Thank you, My Lord.\n\nDARTH SIDIOUS fades away.\n\nRUNE : You didn't tell him about the missing Jedi?\nNUTE : No need to report that to him, until we have something to report.\n\n<b>INT. SUB COCKPIT - UNDERWATER\n</b>\nSparks are flying, and water is leaking into the cabin. The sound of the\npower drive drops.\n\nOBI-WAN : .....we're losing power.\n\nOBI-WAN is working with the sparking wires. JAR JAR panics.\n\nQUI-GON : Stay calm. We're not in trouble yet.\nJAR JAR : What yet? Monstairs out dare! Leak'n in here, all'n sink'n, and\nnooooo power! You nutsen! WHEN YOUSA TINK WESA IN TROUBLE?!!!?\nOBI-WAN : Power's back.\n\nThe lights flicker on, revealing an ugly COLO CLAW FISH right in front of\nthem.\n\nJAR JAR : Monstairs back!\n\nThe large COLO CLAW FISH is surprised and rears back. The sub turns around\nand speeds away.\n\nJAR JAR : (cont'd) Wesa in trouble now??\nQUI-GON : Relax.\n\nQUI-GON puts his hand on JAR JAR's shoulder. JAR JAR relaxes into a coma.\n\nOBI-WAN : You overdid it.\n\nThe COLO CLAW FISH leaps after the fleeing sub as it shoots out of the\ntunnel and into the waiting jaws of the SANDO AQUA MONSTER.\n\nOBI-WAN (cont'd) This is not good!\n\nJAR JAR regains consciousness.\nJAR JAR : Wesa dead yet?? Oie Boie!\n\nJAR JAR's eyes bulge, and he faints again. The sub narrowly avoids the\ndeadly teeth of the AQUA MONSTER. The COLO CLAW FISH chasing them isn't so\nlucky. It is munched in half by the larger predator. The little sub slips\naway.\n\nQUI-GON : Head for that outcropping.\n\n<b>EXT. THEED - MAIN ROAD INTO THEED - DAY (FX)\n</b>\nThe long columns of the DROID ARMY move down the main road leading to\nTheed, the Naboo capital.\n\n<b>EXT. THEED PLAZA - DAY (FX)\n</b>\nAs the QUEEN watches helplessly from a window in the palace, a transport\ncarrying NUTE and RUNE lands in Theed Plaza. They exit the transport.\n\nNUTE : Ah, victory!\n\n<b>INT. NABOO LAKE - UNDERWATER - SUB (FX)\n</b>\nThe little sub continue to propel itself toward the surface, which is\nbrightly lit.\n\nJAR JAR : Wesa dude it!\n\n<b>EXT. THEED - ESTUARY - DAY\n</b>\nParadise. Billowing clouds frame a romantic body of water. There is a LOUD\nRUSH OF BUBBLES, and a small sub bobs to the surface.\nThe current in the estuary begins to pull the sub backward into a fast\nmoving river. OBI-WAN switches off the two remaining bubble canopies.\nQUI-GON stands up to look around. JAR JAR lets out a sigh of relief.\n\nJAR JAR : Wesa safe now.\nQUI-GON : Get this thing started.\nJAR JAR : Dissen berry good. Hey?\nOBI-WAN : What is it?\n\nJAR JAR looks back to where they're drifting. He sees they are headed for a\nhuge waterfall.\n\nJAR JAR : What!!?? Oie boie!\n\nOBI-WAN tries to start the engine. The long props behind the sub slowly\nbegin to rotate. OBI-WAN struggles until finally, a few feet short of the\nwaterfall, the sub starts and is able to generate enough power to stop\ndrifting backward in the powerful current. The sub slowly moves forward. In\nthe background, QUI-GON takes a cable out of his belt. The engine coughs\nand dies. They start drifting backward again. JAR JAR panics.\n\nJAR JAR : (cont'd) Iyiiyi, wesa die'n here, hey!\n\nQUI-GON shoots the thin cable, and it wraps itself around a railing on the\nshore. The sub pulls the cable taut, and the little craft hangs\nprecariously over the edge of the waterfall.\n\nQUI-GON : Come on...\n\nOBI-WAN climbs out of the sub and pulls himself along the cable. QUI-GON\nstarts in after him.\n\nQUI-GON : (cont'd) Come on, Jar Jar.\nJAR JAR : No! Too scary!\nOBI-WAN : Get up here!\nJAR JAR : No a mighty no!\n\nJAR JAR looks back and sees he is hanging over the waterfall.\n\nJAR JAR : (cont'd) Oie boie...mesa comen. Mesa comen!\n\nJAR JAR starts to climb out of the sub. OBI-WAN is on shore and helps to\npull QUI-GON out of the water.\n\nOBI-WAN : That was close.\nBATTLE DROID 3B3 : (O.S) Drop your weapons!\n\nThe TWO JEDI turn around to see a BATTLE DROID standing in front of them.\nJAR JAR climbs up on shore between the JEDI.\n\nBATTLE DROID 3B3 : I said drop your weapons\n\nQUI-GON ignites his laser sword, and in a brief flash, the DROID is cut\ndown by the JEDI. A stray laser bolt hits the cable and the sub breaks\nlose, crashing down the waterfall.\nThe JEDI move on. JAR JAR reluctantly follows and looks back at the mess.\n\nJAR JAR : Whoa!!!\n\n<b>EXT. THEED - PALACE - DAY\n</b>\nThe waterfalls of Theed sparkle in the noonday sun.\n\n<b>INT. THEED - PALACE THRONE ROOM - DAY\n</b>\nQUEEN AMIDALA, SIO BIBBLE, and FIVE OF HER HANDMAIDENS (EIRTAE, YANE,\nPADME, RABE, SACHE) are surrounded by TWENTY DROIDS. CAPTAIN PANAKA and\nFOUR NABOO GUARDS are also held at gunpoint. NUTE and RUNE stand in the\nmiddle of the room.\n\nBIBBLE : ...how will you explain this invasion to the Senate?\nNUTE : The Naboo and the Federation will forge a treaty that will\nlegitimize our occupation here. I've been assured it will be ratified by\nthe Senate.\nAMIDALA : I will not co-operate.\nNUTE : Now, now, your Highness. You are not going to like what we have in\nstore for your people. In time, their suffering will persuade you to see\nour point of view. Commander. (OOM-9 steps forward) Process them.\nOOM-9 : Yes, sir! (turns to his sergeant) Take them to Camp Four.\n\nThe SERGEANT marches the GROUP out of the throne room.\n\n<b>EXT. PALACE - PLAZA - DAY\n</b>\n<b>QUEEN AMIDALA, PADME, EIRTA, YANE, RABE, SACHE, CAPTAIN PANAKA, SIO\n</b><b>BIBBLE,\n</b>and FOUR GUARDS are led out of the palace by ten BATTLE DROIDS. The plaza\nis filled with tanks and BATTLE DROIDS, which they pass on their way to the\ndetention camp. Unbeknownst to them, QUI-GON, OBI-WAN, and JAR JAR sneak\nacross on a walkway above the plaza and jump from a balcony to begin an\nattack to rescue the QUEEN.\n\nFOUR BATTLE DROIDS are instantly cut down. MORE DROIDS move forward and are\nalso cut down by the JEDIS' flashing lightsabres until there is only the\nDROID SERGEANT left. The SERGEANT starts to run but is pulled back to\nQUI-GON by the Force, until finally he is dispatched by the JEDI.\n\nJAR JAR : Yousa guys bombad!\n\nQUEEN AMIDALA and the OTHERS are amazed. JAR JAR is getting used to this.\nThey move between two buildings.\n\nQUI-GON : Your Highness, we are the Ambassadors, for the Supreme\nChancellor.\nBIBBLE : Your negotiations seem to have failed, Ambassador.\nQUI-GON : The negotiations never took place. Your Highness, we must make\ncontact with the republic.\n\nCAPTAIN PANAKA steps forward.\n\nCAPT. PANAKA : They've knocked out all our communications.\nQUI-GON : Do you have transports?\nCAPT. PANAKA : In the main hanger. This way.\n\nTHEY disappear down an alleyway as the ALARMS are sounded\n\n<b>INT. CENTRAL HANGER - HALLWAY - DAY\n</b>\nCAPTAIN PANAKA cracks open a side door to the central hanger. QUI-GON looks\nin over his shoulder. OBI-WAN, JAR JAR, and the rest of the group are\nbehind him. They see several Naboo spacecraft guarded by about FIFTY BATTLE\nDROIDS. ALARMS can be heard in the distance.\n\nCAPT. PANAKA : There are too many of them.\nQUI-GON : That won't be a problem. (to Amidala) Your Highness, under the\ncircumstances, Isuggest you come to Coruscant with us.\nAMIDALA : Thank you, Ambassador, but my place is here with my people.\nQUI-GON : They will kill you if you stay.\nBIBBLE : They wouldn't dare.\nCAPT. PANAKA : They need her to sign a treaty to make this invasion of\ntheirs legal. They can't afford to kill her.\nQUI-GON : The situation here is not what it seems. There is something else\nbehind all this, Your Highness. There is no logic in the Federation's move\nhere. My feelings tell me they will destroy you.\nBIBBLE : Please, Your Highness, reconsider. Our only hope is for the Senate\nto side with us... Senator Palpatine will need your help.\nCAPT. PANAKA : Getting past their blockade is impossible, Your Highness.\nAny attempt to escape will be dangerous.\nBIBBLE : Your Highness, I will stay here and do what I can...They will have\nto retain the Council of Governors in order to maintain control. But you\nmust leave...\n\nThe QUEEN turns to PADME and EIRTAE.\n\nAMIDALA : Either choice presents a great risk...to all of us...\nPADME : We are brave, Your Highness.\nQUI-GON : If you are to leave, Your Highness, it must be now.\nAMIDALA : Then, I will plead our case before the Senate. (to Bibble) Be\ncareful, Governor.\n\n<b>INT. CENTRAL HANGER - DAY\n</b>\nThe door opens to the main hanger. QUI-GON, OBI-WAN, JAR JAR, CAPTAIN\nPANAKA, TWO GUARDS, and THREE HANDMAIDENS (PADME, EIRTAE, RABE),\nfollowed\nby QUEEN AMIDALA, head for a sleek chrome spacecraft. SIO BIBBLE, YANE and\nSACHE stay behind. The HANDMAIDENS begin to cry.\n\nCAPT. PANAKA : We need to free those pilots.\n\nCAPTAIN PANAKA points to TWENTY GUARDS, GROUND CREW, and PILOTS held in a\ncorner by SIX BATTLE DROIDS.\n\nOBI-WAN : I'll take care of that. OBI-WAN heads toward the group of\ncaptured pilots.\n\nQUI-GON and the QUEEN, CAPTAIN PANAKA, JAR JAR, and the rest Of the GROUP\napproach the GUARDS at the ramp of the Naboo craft.\n\nGUARD DROID : Where are you going?\nQUI-GON : I'm Ambassador for the Supreme Chancellor, and I'm taking those\npeople to Coruscant.\nDROID GUARD : You're under arrest!\n\nThe DROID GUARD draws his weapon, but before any of the DROIDS can fire,\nthey are cut down. OTHER GUARDS run to their aid. OBI-WAN attacks the\nGUARDS around the PILOTS. QUI-GON stands, fighting off DROIDS as the OTHERS\nrush on board the spacecraft. OBI-WAN, the FREED PILOTS (including RIC\nOLIE), GUARDS and GROUND CREW MEMBERS rush on board the ship. The OTHER\nPILOTS and GUARDS race to SIO BIBBLR. After everyone has made it onto the\nship, QUI-GONjumps on board. ALARMS sound. MORE DROIDS rush into the hanger\nand fire as the ship takes off.\n\n<b>EXT. THEED - HANGER ENTRY - DAY (FX)\n</b>\nThe ship exits the hanger. BATTLE DROIDS standing in the hanger shoot at\nthem.\n\n<b>EXT. SPACE (FX)\n</b>\nThe sleek spacecraft speeds away from the planet of Naboo and heads for the\ndeadly Federation blockade.\n\n<b>INT. NABOO SPACECRAFT - COCKPIT\n</b>\nThe PILOT, RIC OLIE, navigates toward the massive battleship, QUI-GON and\nCAPTAIN PANAKA watch.\n\nRIC OLIE : ....our communications are still jammed.\n\n<b>INT. NABOO SPACECRAFT - DROID HOLD\n</b>\nJAR JAR is led into a low, cramped doorway by OBI-WAN.\n\nOBI-WAN : Now stay here, and keep out of trouble.\n\nOBI-WAN closes the door. JAR JAR looks around and sees a long row of five\nshort, dome-topped ASTRO DROIDS (R-2 units). The all look alike, except for\nthier paint color, and they all seem to be shut down.\n\nJAR JAR : Ello, boyos. (no response) Disa wanna longo trip...hey?\n\nJAR JAR taps a bright red R-2 UNIT on the head, and its head pops up a bit.\nHe lets out a gasp as he lifts the head.\n\nJAR JAR : (Cont'd) Tis opens?...Oooops! Many springs and things come flying\nout.\n\nJAR JAR quickly closes it again, very embarrassed.\n\nJAR JAR : (Cont'd) Yoi! Just yoken!\nRIC OLIE : Powers back! That little droid did it. He bypassed the main\npower drive. Deflector shield up, at maximum.\n\nThe lone BLUE DROID finishes his repairs and goes back into the ship. The\nNaboo spacecraft races away from the Federation battleship.\n\nRIC OLIE : There's not enough power to get us to Coruscant...the hyperdrive\nis leaking.\nQUI-GON : We'll have to land somewhere to refuel and repair the ship.\n\nQUI-GON studies a star chart on a monitor.\n\nOBI-WAN : Here, Master. Tatooine... It's small, out of the way, poor... The\nTrade Federation has no presence there.\nCAPT. PANAKA : How can you be sure?\nQUI-GON : It's controlled by the Hutts...\nCAPT. PANAKA : The Hutts??\nOBI-WAN : It's risky...but there's no alternative.\nCAPT. PANAKA : You can't take Her Royal Highness there! The Hutts are\ngangsters... If they discovered her...\nQUI-GON : ...It would be no different than if we landed on a system\ncontrolled by the Federation...except the Hutts aren't looking for her,\nwhich gives us an advantage.\n\nCPATAIN PANAKA takes a deep breath in frustration.\n\n<b>EXT. SPACE - NABOO SPACECRAFT (FX)\n</b>\nThe Naboo spacecraft races away.\n\n<b>INT. FEDERATION BATTLESHIP - CONFERENCE ROOM\n</b>\nNUTE and RUNE sit around a conference table with a hologram of DARTH\n<b>SIDIOUS.\n</b>\nNUTE : We control all the cities in the North and are searching for any\nother settlements...\nDARTH SIDIOUS : Destroy all high-ranking officials,\nViceroy...slowly...quietly. And Queen Amidala, has she signed the treaty?\nNUTE : She has disappeared, My Lord. One Naboo cruiser got pat the\nblockade.\nDARTH SIDIOUS : Viceroy, find her! I want that treaty signed.\nNUTE : My Lord, it's impossible to locate the ship. It's out of our range.\nDARTH SIDIOUS : ...not for a Sith...\n\nA second SITH LORD appears behind DARTH SIDIOUS.\n\nDARTH SIDIOUS : (Cont'd) ...Viceroy, this is my apprentice. Lord Maul. He\nwill find your lost ship.\nNUTE : Yes, My Lord. The hologram fades off.\nNUTE : (Cont'd) This is getting out of hand...now there are two of them.\nRUNE : We should not have made this bargain. What will happen when the Jedi\nbecome aware of these Sith Lords?\n\n<b>INT. NABOO SPACECRAFT - QUEENS CHAMBERS\n</b>\nQUI-GON, OBI-WAN, CAPTAIN PANAKA, and the LITTLE BLUE DROID stand before\nQUEEN AMIDALA and her THREE HANDMAIDENS, PADME, EIRTAE and RABE.\n\nCAPT. PANAKA : ...An extremely well put together little droid. Without a\ndoubt, it saved the ship, as well as our lives.\nAMIDALA : It is to be commended...what is its number?\n\nThe LITTLE BLUE DROID lets out a series of bleeps.CAPTAIN PANAKA leans over\nand scrapes some dirt off of the side of the DROID and read the number:\n\nCAPT. PANAKA : R2-D2, Your Highness.\nAMIDALA : Thank you, Artoo Detoo. You have proven to be very loyal...Padme!\n\nPADME bows before the QUEEN.\n\nAMIDALA : (Cont'd) Clean this droid up the best you can. It deserves our\ngratitude...(to Panaka) Continue, Captain.\n\nCAPTAIN PANAKA looks nervously to OBI-WAN and QUI-GON.\n\nQUI-GON : Yor Highness, we are heading for a remote planet called Tatooine.\nIt is a system far beyond the reach of the Trade Federation. There we will\nbe able to make needed repairs, then travel on to Coruscant.\nCAPTAIN PANAKA : Your Highness, Tatooine is very dangerous. It's controlled\nby an alliance of gangs called the Hutts. I do not agree with the Jedi on\nthis.\nQUI-GON : You must trust my judgement, Your Highness.\n\nAMIDALA and PADME exchange looks. PADME moves next to the DROID.\n\n<b>INT. NABOO SPACECRAFT - MAIN AREA\n</b>\nPADME sits in the Main Area, cleaning R2-D2, the brave little Astra Droid.\nJAR JAR pops out of an open door.\n\nJAR JAR : Hidoe!\n\nBoth PADME and ARTOO jump and let out a little SCREAM. The Gungan is\nembarrassed that he frightened them.\n\nJAR JAR : (Cont'd) Sorry, nomeanen to scare yousa.\nPADME : That's all right.\nJAR JAR : I scovered oily back dare. Needen it?\nPADME : Thank you. This little guy is quite a mess.\n\nJAR JAR hands PADME the oil can.\n\nJAR JAR : Mesa Ja Ja Binksss... PADME : I'm Padme, I attend Her Highness,\nYou're a Gungan, aren't you? (Jar Jar nods) How did you end up here with\nus?\nJAR JAR : Me no know...mesa day starten pitty okeyday witda brisky morning\nmunchen. Den boom....getten berry skeered, un grabbed dat Jedi, and before\nmesa knowen it...pow! Mesa here. (he shrugs)...getten berry berry skeered.\n\nARTOO BEEPS a sympathetic beep.\n\n<b>INT. ANBOO SPACECRAFT - COCKPIT\n</b>\nOBI-WAN, QUI-GON, and CAPTAIN PANAKA watch over RIC OLIE'S shoulder. A\nlarge yellow planet appears directly ahead. RIC OLIE searches his scopes.\n\nOBI-WAN : Tahyt's it. Tatooine.\nRIC OLIE : There's a settlement...a spaceport, looks like.\nQUI-GON : Land near the outskirts. We don't want to attract any attention.\n\n<b>EXT. TATOOINE - SPACE (FX)\n</b>\nThe ship heads toward the planet of Tatooine.\n\n<b>EXT. TATOOINE - DESERT - NABOO SPACECRAFT - DAY (FX)\n</b>\nThe Naboo spacecraft lands in the desert in a swirl of dust. The spaceport\nof Mos Espa is seen in the distance.\n\n<b>EXT. NABOO SPACECRAFT - MAIN AREA\n</b>\nOBI-WAN is hoisting the hyperdrive out of a floor panel. JAR JAR rushes up\nto him and falls to his knees.\n\nJAR JAR : Obi-Wan, sire, pleeese, no mesa go!\nOBI-WAN : Sorry, Qui-Gon's right. You'll make things less obvious.\n\nJAR JAR walks back to ARTOO in the hallway as QUI-GON (dressed as a farmer)\nenters the main area.\n\nOBI-WAN : (Cant'd) The Hyperdrive generator is gone. We will need a new\none.\n\nQUI-GON moves closer to OBI-WAN and speaks quietly to him.\n\nQUI-GON : Don't let them send ant transmissions. Be wary...I sense a\ndisturbance in the Force.\nOBI-WAN : I fell it also, Master.\n\nQUI-GON goes into the hallway to meet up with ARTOO and JAR JAR. They head\nto the exit ramp.\n\n<b>EXT. TATOOINE - DESERT - SPACESHIP - DAY\n</b>\nThey start their trek across the desert toward the city of Mos Espa. In the\ndistance, a strange looking caravan makes its way toward the spaceport.\n\nJAR JAR : Dis sun doen murder tada skin.\n\nFrom the spaceship, CAPTAIN PANAKA and PADME run toward them.\n\nCAPT. PANAKA : Wait!\n\nQUI-GON stops as they catch up. PADME is dresses in rough peasant's garb.\n\nCAPT. PANAKA : (Cont'd) Her Highness commands you to take her handmaiden\nwith you. She wishes for her to observe the local...\nQUI-GON : No more commands from Her Highness today, Captain. This spaceport\nis not going to be pleasant...\nCAPT. PANAKA : The Queen wishes it. She is curious about this planet.\nPADME : I've been trained in defense... I can take care of myself.\nCAPT. PANAKA : Don't make me go back and tell her you refuse.\nQUI-GON : I don't have time to argue. But this is not a good idea. Stay\nclose to me.\n\nHe gives PADME a stern look.\n\n<b>EXT. MOS ESPA - STREET - DAY\n</b>\nThe little GROUP walks down the main street of Mos Espa. They pass\ndangerous looking citizens of all types. PADME looks around in awe at this\nexotic enviroment.\n\nQUI-GON : ...moisture farms for the most part, but also a few indigenous\ntribes and scavengers. The few spaceports like this one are havens for\nthose who do not wish to be found...\nPADME : ....like us. JAR JAR is in a constant state of panic.\n\nARTOO whistles along, with perfect confidence.\n\nJAR JAR : Dissen berry berry bad. (steps in ooze)\nOoooh...icky...icky...goo.\n\n<b>EXT. MOS ESPA - JUNK DEALER PLAZA - DAY\n</b>\nThe GROUP comes to a little plaza surrounded by several junk spaceship\ndealers.\n\nQUI-GON : We'll try one of the smaller dealers.\n\nThey head for a little junk shop that has a huge pile of broken spaceships\nstacked up behind it.\n\n<b>INT. WATTO'S JUNK SHOP - DAY\n</b>\nQUI-GON, JAR JAR, PADME, and ARTOO enter the dingy junk shop and are\ngreeted by WATTO, a pudgy blue alien who flies on short little wings like a\nhummingbird.\n\nWATTO : (subtitled) Hi chuba da naga? (What do you want?)\nQUI-GON : I need parts for a J-type 327 Nubian.\nWATTO : Ah yes, ah yes. Nubian. We have lots of that. What kinda junk?\n(subtitled) Peedenkel! Naba dee unko (Boy, get in here! Now!)\nQUI-GON : My droid here has a readout of what I need.\n\nA disheveled boy, ANAKIN SKYWALKER, runs in from the junk yard. He is about\nnine years old, very dirty, and dressed in rags. WATTO raises a hand, and\nANAKIN flinches.\n\nWATTO : (subtitled) Coona tee-tocky malia? (What took you so long?)\nANAKIN : (subtitled) Mel tassa cho-passa... (I was cleaning the bin like\nyou...)\nWATTO : (subtitled) Chut-Chut! Ganda doe wallya. (Never mind! Watch the\nstore) Me dwana no bata. (I've got some selling to do here.) (to Gui-Gon)\nSoooo, let me take- a thee out back. Ni you'll find what you need.\n\nARTOO and QUI-GON follow WATTO toward the junk yard, leaving JAR JAR with\nPADME and the young boy ANAKIN. JAR JAR picks up a gizmo, trying to figure\nout its purpose. QUI-GON takes the part out of his hand and puts it back.\n\nQUI-GON : Don't touch anything.\n\nJAR JAR makes a rude face to QUI-GON's back and sticks out his long tongue.\nANAKIN sits on the counter, pretending to clean a part, staring at PADME.\nShe is the most beautiful creaure he has ever seen in his life. PADME is a\nlittle embarrassed by his stare, but she musters up an amused smile.\nFinally, he gets the courage to speak.\n\nANAKIN : Are you an angel?\nPADME : What?\nANAKIN : An angel. I've heard the deep space pilots talk about them. They\nlive on the Moons of Iego I thimk. They are the most beautiful creatures in\nthe universe. They are good and kind, and so pretty they make even the most\nhardened spice pirate cry.\n\nPADME looks at him, not knowing what to say. PADME : I've never heard of\nangels.\n\nANAKIN : You must be one...maybe you just don't know it.\nPADME : You're a funny little boy. How do you know so much?\nANAKIN : Since I was very little, three, I think. My Mom and I were sold to\nGardulla the Hutt, but she lost us, betting on the Podraces, to Watto,\nwho's a lot better master than Gardulla, I think.\nPADME : You're...a slave?\n\nANAKIN looks at PADME defiantly.\n\nANAKIN : I am a person! My name is Anakin.\nPADME : I'm sorry. I don't fully understand. (looking around)This is a\nstrange world to me.\n\nANAKIN studies her intently.\n\nANAKIN : You are a strange girl to me.\n\nJAR JAR pushes the nose on what appears to be a LITTLE DROID, and it\ninstantly comes to life, grows legs and arms, and starts marching around,\nknocking over everything. JAR JAR hold on but can't stop it.\n\nANAKIN : (Cont'd) Hit the nose!\n\nJAR JAR hits the nose, and the DROID collapses back into its original\nstate. ANAKIN and PADME laugh. ANAKIN watches PADME straighten her hair.\n\n<b>EXT. WATTO'S JUNK YARD - BEHIND SHOP - DAY\n</b>\nWATTO reads a small portable monitor he is holding. He stands before a\nhyperdrive.\n\nWATTO : ...Here it is...a T-14 hyperdrive generator!! Thee in luck, I'm the\nonly one hereabouts who has one...but thee might as well buy a new ship. It\nwould be cheaper, I think...Sying of which, how's thee going to pay for all\nthis?\nQUI-GON : I have 20,000 Republic dataries.\nWATTO : Republic credits?!? Republic credits are no good out here. I need\nsomething more real...\nQUI-GON : I don't have anything else. (raising his hand) But credits will\ndo fine.\nWATTO : No they won'ta. QUI-GON, using his mind power, waves his hand\nagain.\nQUI-GON : Credits will do fine.\nWATTO : No, they won'ta. What you think you're some kinda Jedi, waving your\nhand around like that? I'm a Toydarian. Mind tricks don'ta work on me-only\nmoney. No money, no parts! No deal! And no one else has a T-14 hyperdrive,\nI promise you that.\n\n<b>INT. WATTO'S JUNK SHOP - DAY\n</b>\nJAR JAR pulls a part out of a stack of parts to inspect it, and they all\ncome tumblimg down. He struggles to catch them, only to knock more down.\nANAKIN and PADME are oblivious.\n\nANAKIN : ...wouldn't have lasted long if I weren't so good at fixing\nthings. I'm making my own droid...\n\nQUI-GON hurries into the shop, followed by ARTOO. QUI-GON : We're leaving.\nJAR JAR follows QUI-GON. PADME gives ANAKIN a loving look.\n\nPADME : I'm glad I met you,....ah...\nANAKIN : ...Anakin.\nPADME : Anakin.\nANAKIN : Anakin Skywalker.\nPADME : Padme Naberrie.\n\nPADME turns, and ANAKIN looks sad as he watches her leave.\n\nANAKIN : I'm glad I met you too.\n\nWATTO enters the junk yard, shaking his head.\n\nWATTO : (subtitled) Ootmians! Tinka me chasa hopoe ma booty na nolia.\n(Outlanders! They think because we live so far from the center, we don't\nknow nothing.)\nANAKIN : (subtitled) La lova num botaffa. (They seemed nice to me.) WATTO :\n(subtitled) Fweepa niaga. Tolpa da bunky dunko. (Clean the racks, then you\ncan go home.)\n\nANAKIN lets out a \"yipee\" and runs out the back.\n\n<b>EXT. MOS ESPA - STREET - ALCOVE - DAY\n</b>\nQUI-GON, ARTOO, JAR JAR, and PADME have found a quiet spot between two\nbuildings. The busy street beyond is filled with dangerous looking\ncreatures. QUI-GON is talking on his com-link, while JAR JAR nervously\nwatches the street. OBI-WAN is in the main hold of the Naboo craft.\n\nQUI-GON : ...Obi-Wan, you're sure there isn't anything of value left on\nboard?\nOBI-WAN : (V.O) A few containers of supplies, the Queen's wardrobe, maybe.\nNot enough for you to barter with. Not in the ammounts you're talking\nabout.\nQUI-GON : All right. Another solution will present itself. I'll check back.\n\nQUI-GON puts his comlink away and starts out into the main street. JAR JAR\ngrabs his arm.\n\nJAR JAR : Noah gain...da beings hereabouts cawazy. Wesa be robbed un\ncrunched.\nQUI-GON : Not likely. We have nothing of value, that's our problem.\n\n<b>EXT. MOS ESPA - STREET - MARKET - DAY\n</b>\nQUI-GON, PADME, JAR JAR, and ARTOO move out into the street. JAR JAR is\nwalking behind the others. They walk by an outdoor cafe filled with a rough\ngang of aliens, one of which is especially ugly, SEBULBA, a spider-like\ncreature. JAR JAR stops for a moment in front of a stall selling dead frogs\nhanging on a wire. He looks around to see if anyone is looknig, then sticks\nout his tongue, and gets hold of one, pulling it into his mouth.\nUnfortunately, the frog is tied tightly to the wire. The vendor suddenly\nappears.\n\nVENDOR : Hey, that will be seven truguts!!\n\nJAR JAR opens his mouth in surprise, and the frog snaps away, ricochets\naround the market, and lands in Sebulba's soup, splashing him. As JAR JAR\nmoves away from the VENDOR, SEBULBA jumps up on the table and grabs the\nhapless Gungan.\n\nSEBULBA : (subtitled) Chuba!! (You!!) JAR JAR : Who, mesa?? SEBULBA :\n(subtitled) Ni chuba na?? (Is this yours??)\n\nSEBULBA holds the frog up to the Gungan threateningly. SEVERAL OTHER\nCREATURES start to gather. SEBULBA shoves JAR JAR to the ground. The Gungan\ndesperately tries to scramble to safety.\n\nJAR JAR : (to himself) Why mesa always da one??\nANAKIN : (V.O) Because you're afraid.\n\nJAR JAR turns to see ANAKNI pushing his way next to him. The boy stands up\nto SEBULBA in a very self-assured way.\n\nANAKIN : (subtitled) Chess ko, Sebulba...Coo wolpa tooney rana. (Careful,\nSebulba...This one's very connected.)\n\nSEBULBA stops his assault on JAR JAR and turns to ANAKIN.\n\nSEBULBA : (subtitled) Tooney rana nu pratta dunko, shag. (Connected?? Whada\nyou mean, slave?)\nANAKIN : (subtitled) Oh da Hutt...cha porko ootman geesa...me teesa rodda\nco pana pee choppa chawa. (As in Hutt...big time outlander, this one... I'd\nhate to see you diced before we race again.)\nSEBULBA : (subtitled) Neek me chowa, wermo, mo killee ma klounkee(Next time\nwe race, wermo, it will be the end of you!) Una noto wo shag, me wompity du\npom pom. (If you weren't a slave, I'd squash you right now.)\n\nSEBULBA turns away.\n\nANAKIN : (subtitled) Eh, chee bana do mullee ra. (Yeah, it'd be a pity if\nyou had to pay for me.)\n\nQUI-GON, PADME and ARTOO arrive.\n\nANAKIN : (Cont'd) Hi! Your buddy here was about to be turned into orange\ngoo. He picked a fight with a Dug. An especially dangerous Dug called\nSebulba.\nJAR JAR : Nosir, nosir. Mesa hate crunchen. Dat's da last ting mesa wanten.\nQUI-GON : Nevertheless, the boy is right...you were heading for trouble.\nThank you, my young friend.\n\nPADME looks at ANAKINB and smiles; he smiles back. They start walking down\nthe crowded street.\n\nJAR JAR : Mesa doen nutten!\nANAKIN : Fear attracts the fearful. He was trying to overcome his fear by\nsquashing you...be less afraid.\nPADME : And that works for you.\nANAKIN : To a point. (he smiles)\n\n<b>EXT. TATOOINE - DESERT - SPACESHIP - DAY\n</b>\nOBI-WAN stands in front of the Naboo spacecraft as the wind picks up and\nbegins to whip at his robe. CAPTAIN PANAKA exits the ship and joins him.\n\nOBI-WAN : This storm's going to slow them down.\nCAPT. PANAKA : It looks pretty bad. We'd better seal the ship.\n\nCAPTAIN PANAKA'S comlink sounds off.\n\nCAPT. PANAKA : (Cont'd) Yes? CAPT. PANAKA : We'll be right there.\n\n<b>EXT. MOS ESPA - STREET - FRUIT STAND - DAY\n</b>\nANAKIN and the GROUP stop at a fruit stand run by a jolly, but very poor,\nold lady named JIRA.\n\nANAKIN : How are you feeling today, Jira?\nJIRA : The heat's never been kind to me, you know, Annie!\nANAKIN : Guess what? I've found that cooling unit I've been searching for.\nIt's pretty beat up, but I'll have it fixed up for you in no time, I\npromise.\nJIRA : You're a fine boy, Annie.\nANAKIN : I'll take four pallies today. (to Padme) You'll like these...\n\nANAKIN reaches in his pocket and comes up with three coins. He drops one.\nQUI-GON picks it up, revealing for a moment, his lightsabre.\n\nANAKIN : (Cont'd) Whoops, I thought I had more...Make thgat three, I'm not\nhungry.\n\nThe wind picks up. SHOP OWNERS are starting to close up their shops as JIRA\ngives them their pallies.\n\nJIRA : Gracious, my bones are aching...storm's coming on, Annie. You'd\nbetter get home quick.\nANAKIN : (to QUI-GON) Do you have shelter?\nQUI-GON : We'll hed back to our ship.\nANAKIN : Is it far?\nPADME : On the outskirts.\nANAKIN : You'll never reach the outskirts in time...sandstorms are very,\nvery dangerous. Come with me. Hurry!\n\nThe GROUP follows ANAKIN as he rushes down the windy street.\n\n<b>EXT. MOS ESPA - SLAVE QUARTERS - STREET - SANDSTORM - DAY\n</b>\nThe wind is blowing hard as QUI-GON, JAR JAR, and PADME follow ANAKIN down\nthe street and into a slave hovel.\n\n<b>INT. ANAKIN'S HOVEL - MAIN ROOM - DAY\n</b>\nQUI-GON, JAR JAR, ARTOO, and PADME enter a small living space.\n\nANAKIN : Mom! Mom! I'm home.\nJAR JAR : Dissen cozy.\n\nAnakin's mother, SHMI SKYWALKER, a warm, friendly woman of forty, enters\nfrom her work area and is startled to see the room full of people.\n\nSHMI : Oh, my!! Annie, what's this?\nANAKIN : These are my friends, Mom. This is Padme, and...gee, I don't know\nany of your names.\nQUI-GON : I'm Qui-Gon Jinn, and this is Jar Jar Binks. ARTOO lets out a\nlittle beep.\nPADME : ...and our droid, Artoo-Detoo.\nANAKIN : I'm building a droid. You wanna see?\nSHMI : Anakin! Why are they here?\nANAKIN : A sandstorm, Mom. Listen.\n\nThe wind HOWLS outside.\n\nQUI-GON : Your son was kind enough to offer us shelter.\nANAKIN : Come on! Let me show you Threepio!\n\nANAKIN leads PADME into the other room. ARTOO follows, beeping all the way.\nQUI-GON takes five small capsules from his utility belt and hands them to\n<b>SHMI.\n</b>\nQUI-GON : I have enough food for a meal.\nSHMI : Oh, tank you. Thank you so much. I'm sorry if I was abrupt. I'll\nnever get used to Anakin's surprises.\nQUI-GON : He's a very special boy. SHMI looks at him as if he's discovered\na secret.\nSHMI : Yes, I know.\n\n<b>INT. ANAKIN'S HOVEL - BEDROOM - DAY\n</b>\nANAKIN shows off his ANDROID, which is lying on his workbench. There is one\neye in the head; the body, arms, and legs have no outer coverings.\n\nANAKIN : Isn't he great?! He's not finished yet.\nPADME : He's wonderful!\nANAKIN : You reall like him? He's a protocol droid...to help Mom. Watch!\n\nANAKIN pushes a switch, and the DROID sits up. Anakin rushes around, grabs\nan eye and puts it in one of the sockets.\n\nTHREEPIO : How do you do, I am See-Threepio, Human Cyborg Relations. How\nmight I serve you?\nPADME : He's perfect.\nANAKIN : When the storm is over, you can see my racer. I'm building a\nPodracer!\n\nPADME smiles at his enthusiasm. ARTOO lets out a flurry of beeps and\nwhistles.\n\nTHREEPIO : I beg your pardon....what do you mean I'm naked?\n\n<b>ARTOO BEEPS\n</b>\nTHREEPIO : (Cont'd) My parts are showing? Oh, my goodness. How\nembarrassing!\n\n<b>INT. NABOO SPACECRAFT - QUEENS CHAMBERS\n</b>\nAMIDALA, EIRTAE, RABE, and OBI-WAN watch a very bad transmission of a SIO\nBIBBLE hologram.\n\nBIBBLE : ...cut off all food supplies until you return...the death toll is\ncatastrophic...we must bow to their wishes, Your Highness...Please tell us\nwhat to do! If you can hear us, Your Highness, you must contact me...\n\nAMIDALA looks upset...almost nervous.\n\nOBI-WAN : It's a trick. Send no reply... Send no transmission of any kind.\n\n<b>INT. ANAKIN'S HOVEL - MAIN ROOM - DAY\n</b>\nQUI-GON listens to his comlink. OBI-WAN is in the cockpit.\n\nOBI-WAN : ...the Queen is upset...but absolutly no reply was sent.\nQUI-GON : It sounds like bait to establish a connection trace.\nOBI-WAN : What if it is true and the people are dying?\nQUI-GON : Either way, we're running out of time.\n\n<b>EXT. CORUSCANT - BALCONY OVERLOOKING CITY - NIGHT\n</b>\nDARTH SIDIOUS and DARTH MAUL look out over the vast city.\n\nDARTH MAUL : Tatooine is sparsely populated. If the trace was correct, I\nwill find them quickly, Master.\nDARTH SIDIOUS : Move against the Jedi first...you will then have no\ndifficulty taking the Queen back to Naboo, where she will sign the treaty.\nDARTH MAUL : At last we will reveal ourselves to the Jedi. At last we will\nhave revenge.\nDARTH SIDIOUS : You have been well trained, my young apprentice, they will\nbe no match for you. It is too late for them to stop us now. Everything is\ngoing as planned. The Republic will soon be in my command.\n\nThe hologram of DARTH MAUL fades off as DARTH SIDIOUS looks out over the\ncity. EXT. MOS ESPA - SANDSTORM - DAY\n\nThe giant sandstorm engulfs the town, including the Naboo spaceship on the\noutskirts of the city center, where Watto's ship is; and the slave\nquarters, where drifts of sand begin building up against Anakin's house.\n\n<b>INT. ANAKIN'S HOVEL - MAIN ROOM - DAY\n</b>\nQUI-GON, ANAKIN, SHMI, JAR JAR, and PADME are seated around a makeshift\ntable, having dinner as the wind howls outside.\nJAR JAR slurps his soup rather loudly. Everyone looks at him. He turns a\nlittle brighter red.\n\nSHMI : All slaves have transmitters placed inside their bodies somewhere.\nANAKIN : I've been working on a scanner to try and locate them, but no\nluck.\nSHMI : Any attempt to escape...\nANAKIN : ...and they blow you up...poof!\n\nPADME and JAR JAR are horrified.\n\nJAR JAR : How wude.\nPADME : I can't believe there is still slavery in the galaxy. The\nRepublic's anti-slavery laws...\nSHMI : The Republic doesn't exist out here...we must survive on our own.\n\nAn awkward silence. ANAKIN attempts to end the embarrassment.\n\nANAKIN : Have you ever seen a Podrace?\n\nPADME shakes her head no. She notices the concern of SHMI. JAR JAR snatches\nsome food from a bowl at the other end of the table with his tongue.\nQUI-GON gives him a dirty look.\n\nQUI-GON : They have Podracing on Malastare. Very fast, very dangerous.\nANAKIN : I'm the only human who can do it.\n\nSHMI looks askance at her son.\n\nANAKIN : (Cont'd) Mom, what? I'm not bragging. It's true. Watto says he's\nnever heard of a human doing it.\nQUI-GON : You must have Jedi reflexes if you race Pods.\n\nANAKIN smiles. JAR JAR attempts to snare another bit of food from the bowl\nwith his tongue, but QUI-GON, in a flash, grabs it between his thumb and\nforefinger. JAR JAR is startled.\n\nQUI-GON : (Cont'd) Don't do that again.\n\nJAR JAR tries to acknowledge with some silly mumbling. QUI-GON lets go of\nthe tongue, and it snaps back into JAR JAR's mouth.\n\nANAKIN : I...I was wondering...something...\nQUI-GON : What?\nANAKIN : Well, ahhh...you're a Jedi Knight, aren't you?\nQUI-GON : What makes you think that?\nANAKIN : I saw your laser sword. Only Jedi carry that kind of weapon.\n\nQUI-GON leans back and slowly smiles.\n\nQUI-GON : Perhaps I killed a Jedi and stole it from him.\nANAKIN : I don't think so... No one can kill a Jedi Knight.\nQUI-GON : I wish that were so...\nANAKIN. I had a dream I was a Jedi. I came back here and freed all the\nslaves...have you come to free us?\nQUI-GON : No, I'm afraid not...\nANAKIN : I think you have...why else would you be here?\n\nQUI-GON thinks for a moment.\n\nQUI-GON : I can see there's no fooling you...(leans forward) You mustn't\nlet anyone know about us...we're on our way to Coruscant, the central\nsystem in the Republic, on a very important mission, and it must be kept\nsecret.\nANAKIN : Coruscant...wow...how did you end up here in the outer rim?\nPADME : Our ship was damaged, and we're stranded here until we can repair\nit.\nANAKIN : I can help! I can fix anything!\nQUI-GON : I believe you can, but our first job is to aquire the parts we\nneed...\nJAR JAR : Wit no-nutten mula to trade.\nPADME : These junk dealers must have a weakness of some kind.\nSHMI : Gambling. Everything here revolves around betting on those awful\nraces.\nQUI-GON : Podracing... Greed can be a powerful ally.. if it's used\nproperly.\nANAKIN : I've built a racer! It's the fastest ever...There's a big race\ntomorrow, on Boonta Eve. You could enter my pod. It's all but finished...\nSHMI : Anakin, settle down. Watto won't let you...\nANAKIN : Watto doesn't know I've built it. (to Qui-Gon) You could make him\nthink it's your's, and you could get him to let me pilot it for you.\n\nQUI-GON looks to SHMI. She is upset.\n\nSHMI : I don't want you to race, Annie...It's awful. I die every time Watto\nmakes you do it.\n\nANAKIN : But Mom, I love it...and they need help...they're in trouble. The\nprize money would more than pay for the parts they need. JAR JAR : Wesa ina\npitty bad goo.\nGUI-GON : Your mother's right. Is there anyone friendly to the Republic who\nmight be able to help us?\n\nSHMI shakes her head no.\n\nANAKIN : We have to help them, Mom...you said that the biggest problem in\nthe universe is no one helps each other...\nSHMI : Anakin, don't...\n\nJAR JAR belches. There is silence for a moment as they eat.\n\nPADME : I'm sure Qui-Gon doesn't want to put your son in danger. We will\nfind another way...\nSHMI : No, Annie's right, there is no other way... I may not like it, but\nhe can help you...he was meant to help you.\nANAKIN : Is that a yes? That is a yes!\n\nThe storm continues to rage outside the slave hovel.\n\n<b>EXT. MOS ESPA - JUNK DEALER PLAZA - DAY\n</b>\nThe storm has passed. VENDORS and STREET PEOPLE clean up the mess and\nrebuild their food stalls. JAR JAR sits on a box in front of Watto's parts\nshop, watching all the activity with growing nervousness. ARTOO is standing\nnext to him. PADME stops QUI-GON as he is about to enter the shop.\n\nPADME : Are you sure about this? Trusting our fate to a boy we hardly know.\nThe Queen will not approve.\nQUI-GON : The Queen does not need to know.\nPADME : Well, I don't approve.\n\nQUI-GON turns and starts into the shop.\n\n<b>INT. WATTO'S JUNK SHOP - DAY\n</b>\nWATTO and ANAKIN are in the middle of an animated discussion in Huttese.\n\nWATTO : Patta go bolla!\nANKAIN : No batta!\nWATTO : Pedunky. Maa kee cheelya.\nANAKIN : Bayno, Bayno!\n\nQUI-GON walks in, and WATTO and ANAKIN join him.\n\nWATTO : The boy tells me you wanta sponser hi insa race. You can't afford\nparts. How can you do this? Not on Republic credits, I think. (he laughs)\nQUI-GON : My ship will be the entry fee.\n\nQUI-GON pulls a small object that looks like a watch out of his pocket, and\na hologram of the Naboo spacecraft appears about a foot long in front of\nWATTO. He studies it.\n\nWATTO : Not bad...not bad...a Nubian.\nQUI-GON : It's in good order, except for the parts we need.\nWATTO : ...but what would the boy ride? He smashed up my Pod in the last\nrace. It will take some time to fix it.\n\nANAKIN is embarrassed and steps forward.\n\nANAKIN : Ahhhh....it wasn't my fault really...Sebulba flashed me with his\nvent ports. I actually saved the Pod...mostly.\nWATTO : (laughing) That you did. The boy is good, no doubts there.\nQUI-GON : I have...acquired a Pod in a game of chance. \"The fastest ever\nbuilt.\"\nWATTO : I hope you didn't kill anyone I know for it. (laughs) So, you\nsupply the Pod and the entry fee; I supply the boy. We split the winnings\nfifty-fifty, I think.\nQUI-GON : Fifty-fifty!?! If it's going to be fifty-fifty, I suggest you\nfront the cash for the entry. If we win, you keep all the winnings, minus\nthe cost of the parts I need...If we lose, you keep my ship.\n\nWATTO thinks about this. ANAKIN tries not to be nervous.\n\nQUI-GON : (Cont'd) Either way, you win.\nWATTO : (subtitled) Deal! Yo bana pee ho-tah, meedee ya. (Your friend is a\nfollish one, methinks.)\n\n<b>EXT. NABOO SPACECRAFT - TATOOINE DESERT - DAY\n</b>\nOBI-WAN stands outside the Naboo spacecraft, speaking into his comlink.\nQUI-GON is on the back porch of the hovel.\n\nOBI-WAN : What if this plan fails, Master? We could be stuck here for a\nlong time.\nQUI-GON : (V.O) A ship without a power supply will not get us anywhere, and\nthere is something about this boy...\n\n<b>EXT MOS ESPA - SLAVE QUARTERS - PORCH - DAY\n</b>\nQUI-GON puts the comlink away as SHMI comes onto the porch\n\nPADME, ANAKIN, JAR JAR, and ARTOO work on the engines of the Podracer in\nthe courtyard below.\n\nQUI-GON : You should be proud of your son. He gives without any thought of\nreward.\nSHMI : He knows nothing of greed. He has...\nQUI-GON : He has special powers.\nSHMI : Yes...\nQUI-GON : He can see things before they happen. That's why he appears to\nhave such quick reflexes. It is a Jedi trait.\nSHMI : He deserves better than a slave's life.\nQUI-GON : The Force is unusally strong with him, that much is clear. Who\nwas his father?\nSHMI : There was no father, that I know of...I carried him, I gave him\nbirth...I can't explain what happened. Can you help him?\nQUI-GON : I'm afraid not. Had he been born in the Republic, we would have\nidentified him early, and he would have become Jedi, no doubt...he has the\nway. But it's too late for him now, he's too old.\n\n<b>EXT. MOS ESPA - SLAVE QUARTERS - BACK YARD - DAY\n</b>\nKITSTER (a young boy about Anakin's age), SEEK (a boy of ten), AMEE (a girl\nof six), and WALD (a Greedo Type, six years old) join ANAKIN, JAR JAR,\nARTOO, and PADME securing some wiring.\n\nANAKIN : Padme and Jar Jar, this is my friend Kitster, and seek, Amee, and\nWald.\n\nAll whistle, hoot, and speak a greeting.\n\nKITSTER : Wow, a real Astro Droid...how'd you get so lucky?\nANAKIN : This isn't the half of it. I'm entered in the Boonta Race\ntomorrow!\nKITSTER : What? With this??\nWALD : (subtitled) Annie, Jesko na joka. 9You are such a joke, Annie.)\nAMEE : You've been working on that thing for years. It's never going to\nrun.\nSEEK : Come on, let's go play ball. Keep it up, Annie, and you're gonna be\nbug squash.\n\nSEEK, WALD, and AMEE take off, laughing. JAR JAR is fiddling with one of\nthe energy binder plates.\n\nANAKIN : Hey! Jar Jar! Stay away from those energy binders...\nJAR JAR : Who, mesa?\nANAKIN : If your hand gets caught in that beam, it will go numb for hours.\n\nJAR JAR peeks at the energy plate; it makes a little electronic pop, zaps\nhim in the mouth and jumps back. JAR JAR tries to say something, but his\nmouth is numb and his words are garbled.\n\nJAR JAR : Ouch-dats muy bigo Oucho. (Gibberish)\nKITSTER : But you don't even know if this thing will run.\nANAKIN : It will.\n\nQUI-GON approaches the GROUP and gives ANAKIN a small battery. JAR JAR gets\nhis hand caught in the afterburner and tries to tell Anakin, but can't get\nwords out that make sense.\n\nQUI-GON : I think it's time we found out. Use this power charge. ANAKIN :\nYes, sir!!\n\nANAKIN jumps into the little capsule behind the two giant engines. He puts\nthe power pack back into the dashboard. EVERYONE backs away, except for JAR\nJAR who calls for help. Finally PADME frees him and the engines ignite with\na ROAR. EVERYONE cheers.\n\n<b>EXT. MOS ESPA - SLAVE QUARTERS - PORCH - DAY\n</b>\nSHMI, watching from the porch, smiles sadly.\n\n<b>EXT. SLAVE QUARTERS - BALCONY - NIGHT\n</b>\nANAKIN sits on the balcony rail of his hovel as QUI-GON tends to a cut. The\nBOY leans back to look at the vast blanket of stars in the sky.\n\nQUI-GON : Sit still, Annie. Let me clean this cut.\nANAKIN : There are so many! Do they all have a system of planets?\nQUI-GON : Most of them.\nANAKIN : Has anyone been to them all?\nQU-IG0N : (laughs) Not likely.\nANAKIN : I want to be the first one to see them all... Ouch!\n\nQUI-GON wipes a patch of blood off ANAKIN'S arm.\n\nQUI-GON : There, good as new...\n\nSHMI yells from inside the hovel.\n\nSHMI : (O.S.) Annie, bedtime!\n\nQUI-GON scrapes ANAKIN's blood onto a comlink chip.\n\nANAKIN : What are you doing?\nQUI-GON : Checking your blood for infections.\nANAKIN : I've never seen...\nSHMI : (O.S.) Annie! I'm not goiung to tell you again!\nQUI-GON : Go on, you have a big day tomorrow. (beat) Goodnight.\n\nANAKIN rolls his eyes and runs into the hovel. QUI-GON takes the blood\nstained chip and inserts it into the comlink, then calls OBI-WAN.\n\nQUI-GON : (Cont'd) Obi-Wan...\nOBI-WAN : Yes, Master.\nQUI-GON : Make an analysis of this blood sample I'm sending you.\nOBI-WAN : Wait a minute...\nQUI-GON : I need a midi-chlorian count.\nOBI-WAN : All right. I've got it.\nQUI-GON : What are your readings?\nOBI-WAN : Something must be wrong with the transmission.\nQUI-GON : Here's a signal check.\nOBI-WAN : Strange. The transmission seems to be in good order, but the\nreading's off the chart...over twenty thousand.\nQUI-GON : (almost to himself) That's it then.\nOBI-WAN : Even Master Yoda doesn't have a midi-chlorian count that high!\nQUI-GON : No Jedi has.\nOBI-WAN : What does it mean?\nQUI-GON : I'm not sure.\n\nThe JEDI KNIGHT looks up and sees SHMI in the doorway watching him.\nEmbarrassed, she goes back into the kitchen while QUI-GON ponders the\nsituation.\n\n<b>EXT. TATOOINE - DESERT MESA - NIGHT\n</b>\nThe sinister looking Sith spacecraft lands on top of a desert mesa at dus,\nscattering a herd of banthas. DARTH MAUL walks to the edge of the mesa and\nstudies the landscape with a pair of electrobinoculars. He picks out the\nlights of three different cities in the distance, then pushes buttons on\nhis electronic armband.\n\nSix football-sized PROBE DROIDS float out of the ship and head off in three\ndifferent directions toward the cities.\n\nDARTH MAUL stands on the mesa and watches them through his\nelectrobinoculars.\n\n<b>EXT. MOS ESPA - SLAVE QUARTERS - PORCH - SUNRISE\n</b>\nPadme exits the hovel.\n\n<b>EXT. MOS ESPA - SLAVE QUARTERS - BACK YARD - SUNRISE\n</b>\nAs the twin suns rise, ARTOO is busy painting the racing Pod. ANAKIN is\nasleep. PADME passes ARTOO.\n\nPADME : I hope you're about finished.\n\nARTOO whistles a positive reply. PADME sees KITSTER riding toward them on\nan EOPIE, a strange camel-lile creature. He is leading a second EOPIE\nbehind him. PADME goes over to ANAKIN. He looks very vulnerable as he\nsleeps. She watches him, then touches him on the cheek. ANAKIN wakes up,\nyawns, and looks at her, a little puzzled.\n\nANAKIN : You were in my dream...you were leading a huge army into battle.\nPADME : I hope not; I hate fighting. Your mother wants you to come in and\nclean up. We have to leave soon. ANAKIN stands up and stretches just as\nKITSTER arrives.\n\nANAKIN : Hook 'em up, Kitster. (to Padme) I won't be long. Where's Qui-Gon?\n\nPADME : He and Jar Jar left already. They're with Watto at the arena.\n\n<b>EXT. MOS ESPA - ARENA - MAIN HANGER - DAY\n</b>\nRACE CREWS mill about outside the Main Hanger.\n\n<b>INT. MOS ESPA - ARENA - MAIN HANGER - DAY\n</b>\nThe hanger is a large building with a dozen or so Podracers being readied\nfor the race. ALIEN CREWS and PILOTS rush about, making last minute fixes\non their vehicles. WATTO, QUI-GON, and JAR JAR walk through the activity.\n\nWATTO : ...I want to see your spaceship the moment the race is over.\nQUI-GON : Patienc, my blue friend. You'll have your winnings before the\nsuns set, and we'll be far away from here.\nWATTO : Not if your ship belongs to me, I think...I warn you, no funny\nbusiness.\nQUI-GON : You don't think Anakin will win?\n\nWATTO stops before an orange racer. Sitting to one side, having his\nshoulders and neck massaged by TWIN YOBANAS, is SEBULBA.\n\nWATTO : Don't get me wrongo. I have great faith in the boy. He's a credit\nto your race, but Sebulba there is going to win, I think.\nQUI-GON : Why?\nWATTO : He always wins. (laughs) I'm betting heavily on Sebulba.\nQUI-GON : I'll take that bet.\nWATTO : (suddenly stops laughing) What??!! What do you mean?\nQUI-GON : I'll wager my new racing pod against...say...the boy and his\nmother.\nWATTO : A Pod for slaves. I don't think so...well, poerhaps. Just one...the\nmother, maybe...the boy isn't for sale.\nQUI-GON : The boy is small, he can't be worth much.\n\nWATTO shakes his head.\n\nQUI-GON : (Cont'd) For the fastest Pod ever built?!\n\nWATTO shakes his head again.\n\nQUI-GON : (Cont'd) Both, or no bet.\nWATTO : No Pod's worth two slaves...not by a long shot...one slave or\nnothing.\nQUI-GON : The boy, then...\n\nWATTO pulls out a small cube from his pocket.\n\nWATTO : We'll let fate decide. Blue it's the boy, red his mother...\n\nWATTO tosses the cube down. QUI-GON lifts his hand slightly; it turns blue.\nQUI-GON smiles. WATTO is angry.\n\nWATTO : (Cont'd) You won the small toss, outlander, bou you won't win the\nrace, so...it makes little difference.\n\nANAKIN and PADME enter the hanger on one of the EOPIES, pulling an engine.\nKITSTER, on the other EOPIE, is pulling another engine. With THREEPIO\nwalking alongside, ARTOO trundles behind, pulling the Pod with SHMI sitting\non it. WATTO passes ANAKIN as he leaves.\n\nWATTO : (Cont'd) (subtitled) Bonapa keesa pateeso, o wanna meetee chobodd.\n(Better stop your friends betting, or I'll end up owning him, too.)\n\nWATTO walks off, laughing.\n\nANAKIN : What did he mean by that?\n\nQUI-GON : I'll tell you later.\n\nARTOO beeps at THREEPIO.\n\nTHREEPIO : Oh my! Space travel sounds rather perilous.\n\nARTOO emits a series of beeps.\n\nTHREEPIO : I can assure you they will never get me onto one of those\ndreadful starships!\nKITSTER : (to Anakin) This is so wizard! I'm sure you'll do it this time,\nAnnie.\nPADME : Do what?\nKITSTER : Finish the race, of course!\nPADME : You've never won a race?\nANAKIN : Well...not exactly...\nPADME : Not even finished?!\n\nANAKN looks sheepish.\n\nANAKIN : ...but Kitster's right, I will this time.\nQUI-GON : Of course you will.\n\n<b>EXT. MOS ESPA - STREET - DAY\n</b>\nOne of Darth Maul's PROBE DROIDS slowly floats down the main street of\nTatooine. It looks in shops and studies PEOPLE as it searches for OBI-WAN,\nQI-GON, or the QUEEN.\n\n<b>EXT. MOS ESPA - DESERT RACE ARENA - DAY\n</b>\nAn EXTREME HIGH WIDE ANGLE reveals a vast arena in the Tatooine desert. A\nlarge semi-circular amphitheatre that holds at least a hundred thousand\npeople dominates the landscape. Large viewing platforms loom over the\nracetrack. INT. MOS ESPA - ARENA ANNOUNCER'S BOX - DAY (FX)\n\nA two-headed ANNOUNCER describes the scene.\n\n<b>FODE/BEED : -\n</b>A: Toogi! Toogie! (Greetings) Toong mee cha kulkah du Boonta magi! tah oos\nazalus ooval Poddraces. (We have perfect weather today for the Boonta\nclassic. The most hazardous of all Podraces.)\nB : That's absolutly right. And a big turnout here, from all corners of the\nOuter Rim territories. I see the contestants are making their way out onto\nthe starting grid.\n\n<b>EXT. MOS ESPA - DESERT RACE ARENA - DAY\n</b>\nOn the left side of the tracks across from the grandstands, a line of\nPodracers emerges from the large hanger, surrounded by several CREW\nMEMBERS. Pods are pulled by a wide variety of CREATURES and are led by\naliens carrying flags. The PILOTS stand facing the royal box.\n\n<b>FODE/BEED : -\n</b>(O.S) A : La Yma beestoo (Yes, there they are!)\nB : I see Ben Quadinaros from the Tund system.\nA : ...eh Gasgano doowa newpa Ord Petrovia! (And Gasgano in thenew Ord\nPedrovia.)\nB : Two time winner, Boles Roor...\nA : Poo tula moosta, woe grane champio Sebulba du Pixelito! Splastyleeya\nbookie ookie!! (On the front line the reigning champion, Sebulba from\nPixelito. By far the favorite today.)\nB : And a late entry, Anakin Skywalker, a local boy.\nA : Wampa peedunkee unko ( I hope he has better luck this time.)\nB : I see the flaggers are moving onto the track.\n\n<b>EXT. MOS ESPA - ARENA - GRANDSTAND - DAY\n</b>\nColorful canopies shade some of the SPECTATORS. VENDORS sell barbecued\ncreature parts and colorful drinks.\n\n<b>EXT. MOS ESPA - ARENA - ROYAL BOX - DAY (FX)\n</b>\nAll the PILOTS bow from the waist as JABBA THE HUTT enters the box and\nwaves to the crowd.\n\n<b>FODE/BEED : -\n</b>A : O grandio lust, Jabba Du Hutt, amu intoe tah parena. (His honor, our\nglorious host, Jabba the Hutt has entered the arena.)\n\nThe crowd ROARS. SEVERAL OTHER SLUG-LIKE HUTTS follow, along with humans\nand aliens. Several SLAVE GIRLS on a chain are led alongside JABBA.\n\nJABBA : (subtitled) Chowbaso! Tam ka chee Boonta rulee ya, kee madda\nhodrudda du wundee. (Welcome!) Sebulba tuta Pixelito...\n\n<b>EXT. MOS ESPA - ARENA - STARTING GRID - DAY\n</b>\nSEBULBA, who is right next to ANAKIN, stands and waves to his fans. A small\npep band plays as his fans wave and cheer.\n\nKITSTER attaches the giant engins to Anakin's Pod with a long cable. SHMI\ngives ANAKIN a big hug and kiss. She looks him right in the eye.\n\nSHMI : Be safe.\nANAKIN : I will, Mom. I promise.\n\nShe leaves as ANAKIN checks the cable hitches.\n\nJABBA : ...Mawhonic tuta Hok, Teemto Pagalies tuta Moonus Mandel, Anakin\nSKywalker tuta Tatoonine....\n\nThe CROWD YELLS. ANAKIN waves to the crowd, as JABBA continues with his\nintroductions. SEBULBA moves over to one of Anakin's engines. KITSTER and\nJAR JAR unhitch the EOPIES, and KITSTER leads them away. ARTOO beeps that\neverything is OK. JAR JAR pats ANAKIN on the back.\n\nJAR JAR : Dis berry loony, Annie. May da guds be kind, mesa palo.\n\nPADME comes up and gives ANAKIN a little kiss on the cheeek. SEBULBA bangs\non a part protruding from Anakin's engine. He looks around to see if anyone\nhas noticed.\n\nPADME : You carry all our hopes.\nANAKIN : I won't let you down.\n\nPADME moves away as SEBULBA edges his way next to ANAKIN and gives him a\nsinister grin.\n\nSEBULBA : Bazda wahota, shag. Dobiella Nok. Yoka to Bantha poodoo. 9You\nwon't walk away from this one, slave scum! You're Bantha poodoo.)\nANAKIN : (subtitled) Cha skrundee da pat, sleemo. (Don't count on it,\nslime-ball.)\n\nANAKIN looks the evil SEBULBA in the eye with a cold stare. QUI-GON\napproaches, and SEBULBA backs off toward his racer.\n\nJABBA : (sutitled)...Ka bazza kundee hodrudda! (...Let the challenge\nbegin!)\n\nThe CROWD lets out a LOUD CHEER. QUI-GON helps ANAKIN into his Pod. The boy\nstraps himself into the tiny racer.\n\nQUI-GON : Are you all set, Annie? (Anakin nods) Remember, concentrate on\nthe moment. Feel. Don't think. Trust your instincts. (he smiles) May the\nForce be with you.\n\nQUI-GON steps away as ANAKIN puts on his goggles. The PILOTS flip switches,\nand powerful energy binders shoot between the engines. ANAKIN flips a\nswitch, and his engine starts. The incredible ROAR of high-powered engines\nigniting echoes throughout the arena. One driver, ODY MANDRELL, yells at a\ndroid (DUM-4) to get away from the front of his engine. The crowd is tense.\n\n<b>EXT. MOS ESPA - ARENA - STARTING GRID - DAY\n</b>\nThe giant power-house engines torque as the PILOTS gun them. The PILOTS\nflip switches, and poerful energy binders shoot between the engines. Aliens\ncarrying large flags move off the track. JAR JAR covers his eyes.\n\nJAR JAR : Mesa no watch. Dissen ganna be messy!\n<b>FODE/BEED : -\n</b>A : Ya pawa culka doe rundee! (The power couplings are being activated)\nB : Hey, it looks like they're clearing the grid.\n\n<b>EXT. MOS ESPA - ARENA - VIEWING PLATFORM - DAY\n</b>\nSHMI looks nervously to QUI-GON as he enters a veiwing platform. PADME and\nJAR JAR are already on board. The platform rises like an elevator.\n\nSHMI : Is he nervous?\nQUI-GON : He's fine.\nPADME : You Jedi are far too reckless. The Queen...\nQUI-GON : The Queen trusts my judgment, young handmaiden. You should too.\nPADME : You assume too much.\n\n<b>EXT. MOS ESPA - ARENA ANNOUNCER'S BOX - DAY (FX)\n</b>\n<b>FODE/BEED : -\n</b>B : Start your engines.\n\nThe earth-pounding ROAR of the engines revving is deafening.\n\n<b>EXT. MOS ESPA - ARENA - ROYAL BOX - DAY (FX)\n</b>\nJabba bites off the head of a frog and spits it at a gong, signaling the\nstart of the race.\n\n<b>EXT. MOS ESPA - ARENA - STARTING GRID - DAY\n</b>\nOn a bridge over the track, a great green light at the center flashes. The\nPodracers shoot forward with a high-pitches scream. ANAKIN'S engine floods\nand coughs - then dies. All the other Podracers except one swerve around\nhim and dissapear down the track. The slave boy struggles to get his racer\nstarted. The two-headed announcer reports.\n\n<b>FODE/BEED : - (O.S.)\n</b>A : An dare ovv! (And they're off!)\nB : Oh...wait. Little Skywalker has stalled.\n\nPADME and JAR JAR are very dissapointed with ANAKIN. QUI-GON puts his arm\naround a very worried SHMI to comfort her. Finally, Anakin's engines\nignite. He zooms away after the receeding pack of competitors, leaving one\nquadra-Pod racer still trying to get started. The two-headed ANNOUNCER\ndescribes the race as it progresses.\n\n<b>FODE/BEED : - (O.S.)\n</b>B : And there goes Skywalker... He'll be hard pressed to catch up with the\nleaders today.\n\n<b>EXT. MOS ESPA - RACETRACK - DAY (FX)\n</b>\nThe Podracers fly across the desert. SEBULBA is running neck and neck with\nMAWHONIC. They round the first turn in the track, side by side. SEBULBA\ndrives his Pod into his rival, forcing him into the wall of a large rock\nformation. MAWHONIC crashes in a spectacular display of fire and smoke.\nANAKIN is much faster than the back-end stragglers and passes them easily.\nOne of the drivers, GASGANO, won't let ANAKIN by. ANAKIN tries to pass him\non one side and is cut off. He then tries to pass him on the other side\nansd is cut off. As they come up on a cliff drop-off, ANAKIN backs off,\nthen guns it as GASGANO goes over the cliff. ANAJIN accelerates so fast\nthat he sails right over the top of GASGANO and speeds away.\nFour TUSKEN RAIDERS perched above the race course fire their rifles at the\nPods racing in the canyon below them. One shot ricochets off the back of\nAnakin's Pod.\n\n<b>FODE/BEED : -\n</b>B : Looks like a few Tusken Riaders have campe out on the canyon dune turn.\n\n<b>EXT. MOS ESPA - ARENA - VIEWING PLATFORM - DAY\n</b>\nJABBA THE HUTT and the crowd watch the progress of the race on small,\nhand-held view screens. JAR JAR is looking over the shoulder of a strange\nalien named FANTA.\n\nJAR JAR : Where's Skywalker?\n\nFANTA moves the view screen out of Jar Jar's view. PADME, SHMI, and QUI-GON\nwatch another screen and look worried.\nARTOO, down in the pits with KITSTER, lets out a worried sigh. The driver\nof the quadra-Pod looks worried.\n\n<b>EXT. MOS ESPA - RACETRACK - DAY (FX)\n</b>\nANAKIN is powering around corners and over hills and cliffs, passing other\nracers right and left. SEBULBA is in the lead. He is being challenged by\nanother racer, XELBREE.\nSEBULBA slows a little, and as XELBREE pulls alongside, he opens a side\nvent on the racer's engine and the exhaust starts to cut through the\nalien's engine.\nThe blast cuts along the engine until finally it EXPLODES. SEBULBA deftly\nveers away.\nANAKIN works his way through a dense mass of racers as they zoom over a\ndune sea, kicking up dust. His Pod shakes violently as he goes over a jump.\nOne of the Podracers, ODY, catches one of his engines in the sand, and the\nwhole thing EXPLODES.\n\n<b>EXT. MOS ESPA - ARENA - VIEWING PLATFORM - DAY\n</b>\nQUI-GON sits quietly, meditating. PADME and SHMI search the landscape for\nany sign of the racers. JAR JAR is still annoying FANTA for information.\nThe crowd SCREAMS. WATTO is laughing with his friends, confident in\nAnakin's defeat.\nThe quadra-Pod engines start just as the racers come around the corner. The\nDRIVER, BEN QUADINAROS, puts it in gear, and the four engines go off in all\ndirections, EXPLODING in a spectacular display. The Pod drops to the ground\nas SEBULBA enters the arena, closely followed by all the OTHER RACERS.\nKITSTER strains to see as ARTOO beeps excitedly. The announcer continues.\n\n<b>FODE/BEED : - (O.S)\n</b>B ; There goes Quadinaros' power couplings.\nA : Sebulba! Ka pa me cheespa wata! (Here comes Sebulba in record time.)\n\nQUI-GON, PADME, SHMI, and JAR JAR yell for joy as ANAKIN passes. JAR JAR is\nvery nervous and pounds on the back of his alien neighbor, FANTA. JAR JAR :\nWhat gooie-on?\nFANTA : Bug off.\n\nLap two. SEBULBA and the pack race past the main arena. The crowd stands\nand YELLS as the Podracers scream off into the distance. QUI-GON and PADME\nlook worried.\n\nJAR JAR : He musta crash-ud.\nPADME : Here he comes!\n\n<b>EXT. MOS ESPA - ARENA - PIT AREA - DAY (FX)\n</b>\nARTOO lets out an excited whistle, as KITSTER yells.\n\nTHREEPIO : He has to complete two more circuits? Oh dear!\n\n<b>EXT. MOS ESPA - RACETRACK - DAY (FX)\n</b>\nSure enough, coming around the bend is ANAKIN, quickly gaining on the pack.\nThe two-headed announcer describes the action. The crowd goes wild.\n\n<b>FODE/BEED : - (O.S.)\n</b>B : It looks like Skywalker is moving up through the field. He's in...\nA : Steeth pa nagoola! (Sixth place, not bad.)\n\nANAKIN continues to gain on the pack. Tension for SHMI and PADME is\nunbearable.\nODY stops in the pits. Droids work on his engines. DUM-4 stands in front of\nthe engine and is sucked in, causing the engine to die. DUM-4 is spit out\nthe back of the engine, very bent up. The engine lets out one final wheeze,\nthen EXPLODES in a puff of smoke.\n\n<b>FODE/BEED : - (O.S.)\n</b>A : Ody Mandrell! Coona wa wunda dunko! (Ody Mandrell into the pits for\nsome attention.)\nODY : Droids!\n\nTERTER is getting close to SEBULBA, who purposely breaks a small part off\nhis Pod, sending it into Terter's engine, causing him to veer into ANAKIN,\nand unhooks one of the main straps on Anakin's engines that links the Pod\nto his engines.\nANAKIN struggles to keep control of the little Pod. It whips about wildly.\nAs the Pod swings near the broken engine strap, ANAKIN grabs for it.\nFinally, he catches the strap and manages to unhook it to the Pod.\nSEBULBA cuts the engine of OBITOKI with his side exhaust, and the racer\ncrashes with a cloud of dust. A THIRD RACER, HABBA, flie into the cloud of\ndust and crashes into OBITOKI. ANAKIN rounds a corner and heads into the\ncloud of smoke. He hits a part of one of the engines but regains control.\n\n<b>FODE/BEED : - (O.S.)\n</b>B :At the start of the third and final lap, Sebulba is in the lead, closely\nfollowed by Skywalker...\n\nANAKIN finally catches up with SEBULBA, and runs neck and neck over the\nrough terrain. JAR JAR, QUI-GON, SHMI, and PADME all SCREAM s ANAKIN comes\nthrough the arena. The lights in the tower indicate that this is the third\nand last lap. WATTO begins to worry.\nSEBULBA uses his side exhaust port to try to cut through Anakin's engines.\nANAKIN manages to avoid having his engine disabled but is forced off\ncourse.\n\n<b>FODE/BEED : - (O.S.)\n</b>B : Skywalker is forced onto the service ramp!\nA : Oh noah!\n\nOn a tight corner, ANAKIN dives to the inside and takes the lead.\n\n<b>FODE BEED : - (O.S.)\n</b>B : Amazing... a controlled thrust and he's back on course! What a move!\n\nSEBULBA is furious. He stay's right on Anakin's tail, crowding him and\npushing him through the turns.\nSEBULBA pushes ANAKIN harder, and the young boy has a difficult time\nkeeping control. One of the parts on Anakin's engines begins to shake\nloose. ANAKIN sees it and switches over to an auxiliary system. While he is\ntrying to accomplish this maneuver, SEBULBA races past him.\nANAKIN tries to get around SEBULBA, to no avail. Every move ANAKIN makes,\nSEBULBA is able to block.\nFinally, ANAKIN fakes a move into the inside as he usually does, then tries\nto go around SEBULBA on the outside. They race sid by side down the final\nstretch of the track.\n\n<b>FODE/BEED : - (O.S.)\n</b>B : He's catching Sebulba.\nA : Inkabunga. (Incredible!)\n\nSEBULBA veers toward ANAKIN and bangs into his Pod. He crashes into ANAKIN\nover and over. The young boy struggles to maintain control as the steering\nrods on the two Pods become hooked together. SEBULBA laughs at ANAKIN.\n\n<b>FODE/BEED : - (O.S.)\n</b>B : That little human being is out of his mind.\nA : Punda tah punda! (They're neck and neck!)\nB : They're side by side!\nA : Bongo du bongu! (Shoulder to shoulder!)\n\nAs they head for the final stretch, ANAKIN fights to unlock the steering\nrods by trying to pull away from SEBULBA. The strain on the steering rod is\ntremendous. Suddenly, ANAKIN's steering arm breaks, and his Pos starts\nspinning.\nThe release of tension sends SEBULBA into an ancient statue. One engine\nEXPLODES, then the other. SEBULBA skids through the fire-balls, blackened,\nbut unhurt. He slides to a smoking stop, gets out of his racer, and throws\nwhat's left of a shifter arm on the ground. Suddenly he realizes his pants\nare on fire, and he struggles to put them out. ANAKIN flies through the\nEXPLOSION as the crowd stands, CHERRING. PADME and JAR JAR jump up and down\nwith excitment, PADME screaming for joy. ARTOO and KITSTER whistle\nhysterically. QUI-GON and SHMI smile. ANAKIN races over the finish line,\nthe winner.\n\n<b>INT. MOS ESPA - ARENA ANNOUNCERS BOX - DAY (FX)\n</b>\nThe two-headed announcer excitedly calls the finish.\n\n<b>FODE/BEED : -\n</b>B : It's Skywalker! The crowd are going nuts! Oh Ah Oh Ah (rock head in\ntandem with partner)\n\n<b>EXT. MOS ESPA - ARENA - DAY\n</b>\nAs ANAKIN stops the Podracer, KISTER turns up, and they embrace. Hundreds\nof SPECTATORS join them and put ANAKIN on their shoulders, marching off,\nCHEERING AND CHANTING. Darth Maul's PROBE DROIDS move through the crowd.\n\n<b>INT. MOS ESPA - ARENA - PRIVATE BOX - DAY\n</b>\nSeveral ALIENS leave Watto's box, laughing and counting their money. WATTO\nsees QUI-GON standing in the doorway.\n\nWATTO : You! You swindled me! You knew the boy was going to win! Somehow\nyou knew it! I lost everything.\n\nWATTO flies up to QUI-GON and puts his face right up against QUI-GON's.\nQUI-GON simply smiles.\n\nQUI-GON : Whenever you gamble, my freind, eventually you'll lose. Bring the\nparts to the main hanger. I'll come by your shop later so you can release\nthe boy.\nWATTO : You can't have him! It wasn't a fair bet!\nQUI-GON : Would you like to discuss it with the Hutts...I'm sure they can\nsettle this.\nWATTO : No, no! I want no more of your tricks! Take him!\n\nThe SITH PROBE DROID watches with great interest.\n\n<b>EXT. MOS ESPA - ARENA - MAIN HANGER - DAY\n</b>\nThe Main Hanger is almost deserted as RACERS depart.\n\n<b>INT. MOS ESPA - ARENA - MAIN HANGER - DAY\n</b>\nJAR JAR gives ANAKIN a great hug, then PADME gives him a hug, then SHMI.\n\nANAKIN : Ah, gee...enough of this...\nSHMI : It's so wonderful, Annie. You have brought hope to those who have\nnone. I'm so very proud of you...\nPADME : We owe you everything.\nANAKIN : Just feeling this good was worth it.\n\nIn the background, QUI-GON has harnessed the EOPIES to containers full of\nparts.\n\nQUI-GON : Padme. Jar Jar, let's go, we've got to get these parts back to\nthe ship.\n\nThe GROUP walks over to QUI-GON and the EOPIES.\nPADME climbs on behind QUI-GON. JAR JAR swings up onto the second EOPIE,\nonly to slwly slide off the other side. ARTOO whistles. ANAKIN and SHMI\nwave as they ride off.\n\nQUI-GON : (Cont'd) I'll return the eopies by midday.\n\n<b>EXT. TATOOINE - DESERT - NABOO SPACECRAFT - DAY\n</b>\nARTOO cruises ahead of QUI-GON and PADME, who are riding one of the EOPIES;\nJAR JAR ridses the other. They stop in front of the sleek Naboo spacecraft.\nOBI-WAN comes out of the ship and joins them.\n\nQUI-GON : Start getting this hyperdrive generator installed. I'm going\nback...some unfinished business. I won't be long.\nOBI-WAN : Why do I sense we've picked up another pathetic life form...?\nQUI-GON : It's the boy who's responsible for getting those parts.\n\nOn a hill far overlooking the Naboo spacecraft, the SITH PROBE DROID turns\nand speeds away.\n\n<b>EXT. TATOOINE - STREET - SLAVE QUARTERS - DAY\n</b>\nANAKIN and A GREEDO are rolling around on the floor, fighting. About A\nDOZEN OR SO KIDS are standing around them, yelling. Suddenly, a long shadow\nis cast over the TWO BOYS; they stop fighting and look up. QUI-GOMN is\ntowering above them. KITSTER is with them.\n\nQUI-GON : What's this?\nANAKIN : He said I cheated.\nQUI-GON : Did you?\nANAKIN : No!\nQUI-GON : Do you still think he cheated?\nGREEDO : Yes.\nQUI-GON : Well, Annie. You know the truth... You will have to tolerate his\nopinion, fighting won't change it.\n\nQUI-GON moves off down the street. Anakin follows. The GREEDO wanders over\nto WALD who has been watching the goings-on.\n\nWALD : Keep this up, Greedo, and you're gonna come to a bad end.\n\nFarther down the street QUI-GON and ANAKIN head toward Anakin's hovel.\nQUI-GON takes a handful of credits from beneath his poncho and hands them\nto the boy.\n\nQUI-GON : These are yours. We sold the Pod.\nANAKIN : (suddenly beaming) Yes!\n\n<b>INT. ANAKIN'S HOVEL - MAIN ROOM - DAY\n</b>\nSHMI is cleaning up as ANAKIN bursts through the door, followed by QUI-GON.\n\nANAKIN : Mom, he sold the Pod. Look at all the money we have!\n\nANAKIN pulls a bag of coins out of his pocket.\n\nSHMI : Oh, my goodness, That's wonderful.\nQUI-GON : And Anakin has been freed.\nANAKIN : What?!?\nQUI-GON : You're no longer a slave.\n\nANAKIN jumps for joy! SHMI is stunned.\n\nANAKIN : Did you hear that, Mom? (to Qui-Gon) Was that part of the prize,\nor what?\nQUI-GON : Let's just say Watto has learned an important lesson about\ngambling.\nSHMI : Now you can make your dreams come true, Annie. You're free! (turns\nto Qui-Gon) Will you take him with you? Is he to become a Jedi?\nQUI-GON : Our meeting was not a coincidence. Nothing happens by accident.\nYou are strong with the Force, but you may not be accepted by the Coucil.\nANAKIN : A Jedi! Mighty blasters, you mean I get to go with you in your\nstarship and everything?!\n\nQUI-GON kneels down to the boy.\n\nQUI-GON : Anakin, training to be a Jedi will not be a easy challenge. And\nif you succeed, it will be a hard life.\nANAKIN : But it's what I want. What I've always dreamed about. Can I go,\nMom?!\nQUI-GON : This path has been placed for you, Annie; the choice to take it\nis yours alone.\n\nANAKIN thinks, looks to his mother, then to QUI-GON.\n\nANAKIN : I want to go.\nQUI-GON : Then, pack your things. We haven't much time.\nANAKIN : Yipee!!\n\nANAKIN hugs his mom and starts for the other room, then stops. SHMI and\nQUI-GON give each other a knowing look. ANAKIN has realized something.\n\nANAKIN : (Cont'd) What about Mom? Is she free too? You're coming, aren't\nyou, Mom\nQUI-GON : I tried to free your mother, Annie, but Watto wouldn't have it.\nANAKIN : But the money from selling...\nQUI-GON : It's not nearly enough.\n\nSHMI comes over to her son and sits next to him. Taking both of his hands\nin hers, she draws him close.\n\nSHMI : Son, my place is here. My future is here. It is time for you to let\ngo...to let go of me. I cannot go with you.\nANAKIN : I want to stay with you. I don't want things to change.\nSHMI : You can't stop change any more than you can stop the suns from\nsetting. Listen to your feelings; Annie, you know what's right.\n\nANAKIN takes a deep breath, drops his head. QUI-GON and SHMI exchange a\nlook of concern. When ANAKIN raises up, there are tears in his eyes.\n\nANAKIN : I'm going to miss you so much, Mom...\nSHMI : I love you, Annie...now hurry.\n\nANAKIN and SHMI hug. ANAKIN runs into the other room.\n\nSHMI : (Cont'd) Thank you.\nQUI-GON : I will watch after him. You have my word. Will you be all right?\nSHMI : He was in my life for such a short time.\n\n<b>INT. ANAKIN'S HOVEL - SECOND ROOM - DAY\n</b>\nANAKIN has thrown the last of his things in a small backpack. As he leaves,\nhe stops and pushes the button that wakes his droid up. THREEPIO stares at\nhim blankly.\n\nANAKIN : Well, Threepio, I'm free...and I'm going away...in a starship...\nTHREEPIO : Master, Annie, you are my maker, and I wish you well. Although\nI'd like it better if I were a little less naked.\nANAKIN : I'm sorry I wasn't able to finish you, Threepio...give you\ncoverings and all... I'm going to miss working on you. You've been a great\npal. I'll make sure Mom doesn't sell you or anything. Bye.\n\nTHREEPIO stares at ANAKIN as he rushes out of the room.\n\nTHREEPIO : Sell me?!?\n\n<b>EXT. MOS ESPA - STREET - SLAVE QUARTERS - DAY\n</b>\nKITSTER runs up to ANAKIN as he and QUI-GON exit Anakin's hovel. SHMI\nstands in the doorway. ANAKIN pulls a handful of coins out of his pocket\nand gives them to KITSTER.\n\nKITSTER : There are so many of us who want you to stay, Annie... You're a\nhero.\nANAKIN : I... (looks to SHMI) I... have to go.\n\nQUI-GON has moved a short way down the street.\n\nKITSTER : Well.\nANAKIN : Well.\nKITSTER : Thank's for every moment you've been here. You're my best friend.\nANAKIN : I won't forget.\n\nANAKIN hugs KITSTER and runs toward QUI-GON, then stops to look back at his\nmother standing in the doorway. He turns back to QUI-GON, then turns and\nruns back to his mother.\n\nANAKIN : (starting to cry) I can't do it, Mom. I just can't.\n\nSHMI hugs ANAKIN. QUI-GON watches from the distance. She kneels down and\nlooks him in the face.\n\nSHMI : Annie, remember when you climbed the great dune in order to chase\nthe Banthas away so they wouldn't be shot... Remember how you collapses\nseveral times, exhausted thinking you couldn't do it?\n\nANAKIN shakes his head.\n\nSHMI : (Cont'd) This is one of those times when you have to do something\nyou don't think you can do. I know how strong you are, Annie. I know you\ncan do this...\nANAKIN : Will I ever see you again?\nSHMI : What does your heart tell you?\nANAKIN : I hope so...yes...I guess.\nSHMI : Then we will see each other again.\nANAKIN : I.. will become a Jedi and I will come back and free you, Mom...I\npromise.\nSHMI : No matter where you are, my love will be with you. Now be brave, and\ndon't look back... don't look back.\nANAKIN : I love you so much.\n\nSHMI hugs ANAKIN, then turns him around so he is facing QUI-GON, and off he\nmarches, like the brave little trooper that he is. He marches right past\nQUI-GON, starring right ahead, tears in his eyes, determined not to look\nback.\n\n<b>EXT. TATOOINE - DESERT MESA - DAY\n</b>\nThe PROBE DROID beeps and whistles to DARTH MAUL. The SITH LORD gets on a\nspeeder bike and follows the PROBE DROID into Mos Espa.\n\n<b>EXT MOS ESPA - STREET - FRUIT STAND - DAY\n</b>\nANAKIN and QUI-GON exit WATTO'S and stop before JIRA'S fruit stand. ANAKIN\nhands JIRA some coins.\n\nANAKIN : I've been freed, and I'm going away. Buy yourself a cooling unit\nwith this... Otherwise I'll worry about you.\n\nJIRA is astonished. She stares, not knowing what to say.\n\nJIRA : Can I give you a hug\nANAKIN : Sure.\n\nShe gives him a hug.\n\nJIRA : I'll miss you, Annie.. there isn't a kinder boy in the galaxy. You\nbe careful...\n\nANAKIN runs to join QUI-GON, who has already started down the street. As\nthey walk along together, QUI-GON notices something out of the corner of\nhis eye.\nSuddenly, without breaking his stride, he ignites his laser sword, swing\naround, and lunges forward and cuts a lurking PROBE DROID in half. QUI-GON\ninspects the sparking and fizzing DROID.\n\nANAKIN : What is it?\nQUI-GON : Probe droid. Very unusual... not like anything I've seen before.\nCome on.\n\nQUI-GON and ANAKIN start running.\n\n<b>EXT. TATOOINE - DESERT - NABOO SPACECRAFT - DAY\n</b>\nQUI-GON and ANAKIN run toward the Naboo spacecraft. ANAKIN is having a hard\ntime keeping up.\n\nANAKIN : Master Qui-Gon,sir, wait!\n\nQUI-GON turns to answer and sees a DARK-CLOAKED FIGURE bearing down on a\nspeeder bike.\n\nQUI-GON : Anakin, drop!\n\nANAKIN drops to the ground just as DARTH MAUL sweeps over him. DARTH MAUL\njumps off his speeder bike, and before he has hit the ground, the Sith Lord\nhas swund a death blow with his laser sword that is barely blocked by\n<b>QUI-GON.\n</b>ANAKIN picks himself up. The two galactic warriors, Sith and Jedi, are\nbashing each other with incredible blows. They move in a continual cloudof\ndust, smashing everything around them. This is a fierce fight. ANAKIN gets\nup, bewildered by the confrontation.\n\nQUI-GON : (Cont'd) Annie, get to the ship! Take off! Go! Go!\n\nQUI-GON struggles to fend off the relentless onslaught as ANAKIN races to\nthe ship.\n\n<b>INT. NABOO SPACECRAFT - HALLWAY\n</b>\nANAKIN runs into the main hallway of the spaceship, where PADME and CAPTAIN\nPANAKA are working.\n\nANAKIN : Qui-Gon's in trouble. He says to take off...now!!\nCAPT. PANAKA : Who are you?\nPADME : He's a friend.\n\n<b>INT. NABOO SPACECRAFT - COCKPIT\n</b>\nCAPTAIN PANAKA, ANAKIN, and PADME rush into the cockpit where OBI-WAN and\nRIC OLIE are checking the hyperdrive.\n\nCAPT. PANAKA : Qui-Gon is in trouble, he says to take off!\nPILOT : I don't see anything.\nOBI-WAN : Over there! Fly low!\n\nIn the distance is a small cloud of dust.\n\n<b>EXT. TATOOINE - DESERT - NABOO SPACECRAFT - DAY\n</b>\nQUI-GON and DARTH MAUL continue theirsword battle. Leaping over one another\nin an incredible display of acrobatics, the two warrios hear the ship fly\nover them a few feet off the ground. QUI-GON almost dissapears for a\nmoment.\nBefore DARTH MAUL knows what's happening, QUI-GON is on the spacecrat's\nramp.\n\n<b>EXT. TATOOINE - NABOO SPACECRAFT RAMP - DAY\n</b>\nThe SITH LORD immediately jumps onto the ramp after QUI-GON, but barely\nmakes it. His heels hang over the edge of a forty-foot drop. QUI-GON swings\nhis laser sword with all his might and knocks DARTH AMUL off the ramp and\nonto the desert floor. The ramp closes, and the Naboo craft rockets away,\nleaving the Sith Lord standing alone.\n\n<b>EXT. SPACE - NABOO SPACECRAFT (FX)\n</b>\nThe sleek spacecraft rockets away from the planet Tatooine.\n\n<b>INT. NABOO SPACECRAFT - HALLWAY\n</b>\nANAKIN and OBI-WAN rush into the hallway to find QUI-GON collapsed on the\nfloor opposite the entry. ARTOO is looking over him. The JEDI is breathing\nhard, wet with sweat and covered in dirt.\n\nANAKIN : Are you all right?\nQUI-GON : I think so... that was a surpirse I wont soon forget.\nOBI-WAN : What was it?\nQUI-GON : I don't know... but he was well trained in the Jedi arts. My\nguess is he was after the Queen...\nANAKIN : Do you think he'll follow us?\nQUI-GON : We'll be safe enough once we're in hyperspace, but I have no\ndoubt he knows our destination.\nANAKIN : What are we going to do about it?\n\nOBI-WAN gives ANAKIN a \"who are you?\" look. ANAKIN returns an innocent\nstare.\n\nQUI-GON : We will be patient. Anakin Skywalker, meet Obi-Wan Kenobi.\nANAKIN : Pleased to meet you. Wow! You're a Jedi too?\n\nOBI-WAN gives the boy a skeptical look.\n\n<b>INT. COCKPIT - SPACE\n</b>\nRIC OLIE pulls back on the hyperdrive. OBI-WAN, QUI-GON, and ANAKIN watch.\n\nQUI-GON : Let's hope this hyperdrive works and Watto didn't get the last\nlaugh.\n\nThe stars streak outside the cockpit window.\n\n<b>EXT. SPACE - NABOO SPACECRAFT (FX)\n</b>\nThe ship streaks into hyperspace.\n\n<b>EXT. THEED - STREET - NIGHT (FX)\n</b>\nSEVERAL FEDERATION DROIDS patrol a deserted city street. The Palace can be\nseen in the distance.\n\n<b>INT. NABOO PALACE - THRONE ROOM - THEED - NIGHT\n</b>\nNUTE sits in a strange, mechanical walking chair, which approaches SIO\nBIBBLE and SEVERAL OTHER NABOO OFFICIALS. RUNE follows a few paces behind.\nDROID GUARDS surround SIO BIBBLE and THE OTHERS as FOUR COUNCIL MEMBERS\nwatch.\n\nNUTE : When are you going to give up this pointless strike? Your Queen is\nlost, your people are starving, and you, Governor, are going to die, much\nsooner than your people, I'm afraid. Take him away!\nBIBBLE : This invasion will gain you nothing. We're a democracy. The people\nhave decided... They will not live under your tyranny.\n\nBIBBLE is taken away as OOM-9 approaches NUTE.\n\nOOM-9 : My troops are in position to begin searching the swamps for these\nrumored underwater villages... they will not stay hidden for long.\n\n<b>INT. NABOO SPACECRAFT - MAIN AREA\n</b>\nThe ship is asleep. The lights are dim as PADME walks into the main room.\nShe goes to a monitor and watches the BIBBLE plea recording. JAR JAR is\nstretched out on the floor, snoring. ARTOO is to one side, cooing as he\nrests.\nPADME appears tired. She senses someone watching her and turns around with\na start. She sees ANAKIN sitting in the corner, shivering and looking\nverydejected. She goes over to him. He looks up at her with tears in his\neyes. He is holding his arms to keep himself warm.\n\nPADME : Are you all right?\nANAKIN : It's very cold.\n\nPADME gives him her over-jacket.\n\nPADME : You're from a warm planet, Annie. Too warm for my taste. Space is\ncold.\nANAKIN : You seem sad.\nPADME : The Queen is...worried. Her people are suffering...dying. She must\nconvince the Senate to intervene, or...I'm not sure what will happen.\nANAKIN : I'm...I'm not sure what's going to happen to me. I dunno if I'll\never see you again.. (he pulls something from his pocket) I made this for\nyou. Sou you'd remember me. I carved it out of a japor snippet... It will\nbring you good fortune.\n\nANAKIN hands a wooden pendant to PADME. She inspects it, then puts it\naround her neck.\n\nPADME : It's beautiful, but I don't need this to remember you. Many things\nwill change when we reach the capital, Annie. My caring for you will always\nremain.\nANAKIN : I care for you too. Only I...miss...\n\nANAKIN is disturbed about something. Tears are in his eyes.\n\nPADME : ...You miss your mother.\n\nANAKIN looks at her, unable to speak. She hugs him.\n\n<b>EXT. SPACE - PLANET CORUSCANT (FX)\n</b>\nMOVE with the ship as it heads toward Coruscant.\n\n<b>INT. CORUSCANT - CITYSCAPE - NABOO SPACECRAFT - DAY (FX)\n</b>\nThe spacecraft dlies over the endlesscityscape of Coruscant, the capital of\nthe galaxy.\n\n<b>INT. NABOO SPACECRAFT - COCKPIT\n</b>\nANAKIN looks out the cockpit window in awe.\n\nRIC OLIE : Coruscant...the capital of the Republic...the entire planet is\none big city.\nANAKIN : Wow! It's so huge!\n\n<b>INT. NABOO SPACECRAFT - DAY (FX)\n</b>\nThe ship flies through the cityscape of Coruscant.\n\n<b>EXT. CORUSCANT - SENATE LANDING PLATFORM - DAY\n</b>\nSupreme Chancellor VALORUM, SEVERAL GUARDS, and SENATOR PALPATINE stand on\na landing platform.\nThe sleek Naboo spacecraft lands on the platform high above the street\nlevel of the galactic capital. The ramp lowers. OBI-WAN, QUI-GON, JAR JAR\nand ANAKIN descend the ramp first and bow before PALPATINE and VALORUM.\nCAPTAIN PANAKA, TWO GUARDS, QUEEN AMIDALA, then PADME, RABE, EIRTAE,\nand\nMORE GUARDS descend the ramp. QUEEN AMIDALA stops before the group.\nANAKIN and JAR JAR stand to one side, looking at the huge city. PADME\nsmiles at ANAKIN. PALPATINE bows before the Queen.\n\nPALPATINE : It is a great gift to see you alive, Your Majesty. May I\npresent Supreme Chancellor Valorum.\nVALORUM : Welcome, Your Highness. It is an honor to finally meet you in\nperson. I must relay to you how distressed everyone is over the currant\nsituation. I've called for a special session of the Senate to hear your\nposition.\nAMIDALA : I am grateful for your concern, Chancellor.\n\nPALPATINE starts to lead QUEEN AMIDALA and her RETINUE off the platform\ntoward a waiting air taxi.\n\nPALPATINE : There is a question of precedure, but I feel confident we can\novercome it...\n\nJAR JAR and ANAKIN start to follow, then stop, noticing that OBI-WAN and\nQUI-GON are staying with the SUPREME CHANCELLOR. QUEEN AMIDALA waves to the\nduo to follow her. ANAKIN looks back to QUI-GON, and he nods to go ahead.\nANAKIN and JAR JAR join the QUEEN, PALPATINE, PADME, RABE and EIRTAE in the\ntaxi. PALPATINE gives the Gungan and the boy in the back of the taxi a\nskeptical look. JAR JAR leans over to ANAKIN.\n\nJAR JAR : Da Queens- a bein grossly nice, mesa tinks. (he looks around)\nPitty hot!\n\nVALORUM and the JEDI watch the taxi move off into the city.\n\nQUI-GON : I must speak with the Jei Council immediately, Your Honor. The\nsituation has become more complicated.\n\n<b>INT. PALPATINE'S QUARTERS - ANTEROOM - DAY\n</b>\nQUEEN AMIDALA is sitting listening to PALPATINE. EIRTAE and RABE stand\nbehind the QUEEN; PADME is nowhere to be sen. ANAKIN and JAR JAR are\nwaiting in an adjoining room. They can see the Queen but cannot hear what\nis being said.\n\nJAR JAR : Dissen all pitty odd to my.\nANAKIN : Don't look at me. I don't know what's going on.\n\nCAPTAIN PANAKA enters, then goes into the room with QUEEN AMIDALA.\n\n<b>INT. PALPATINE'S QUARTERS - LIVING AREA - DAY\n</b>\nPALPATINE is pacing as CAPTAIN PANAKA enters. EIRTAE and RABE stand to one\nside.\n\nPALPATINE : ...the Republic is not what it once was. The Senate is full of\ngreedy, squabbling delegates who are only looking out for themselves and\ntheir home sytems. There is no interest in the common good...no civility,\nonly politics...its disgusting. I must be frank, Your Majesty, there is\nlittle chance the Senate will act on the invasion.\nAMIDALA : Chancellor Valorum seems to think there is hope.\nPALPATINE : If I may say so, Your Majesty, the Chancellor has little real\npower...he is mired down by baseless accusations of corruption. A\nmanufactured scandal surrounds him. The bureaucrats are in charge now.\nAMIDALA : What options do we have?\nPALPATINE : Our best choice would be to push for the election of a stronger\nSupreme Chancellor. One who will take control of the bureaucrats, enforces\nthe laws, and give us justice. You could call for a vote of no confidence\nin Chancellor Valorum.\nAMIDALA : He has been our strongest supporter. Is there any other way?\nPALPATINE : Our only other choice would to be to submit a plea to the\ncourts...\nAMIDALA : There's no time for that. The courts take even longer to decide\nthings than the Senate. Our people are dying, Senator...more and more each\nday. We must do something quickly to stop the Federation.\nPALPATINE : To be realistic, Your Highness, I'd say we're going to have to\naccept Federation control for the time being.\nAMIDALA : There is something I cannot do.\n\n<b>EXT. TEMPLE OF THE JEDI - DAY (FX)\n</b>\nA unique building with it tall spires stands out against the Coruscant\nskyline. A small transport passes by the vast temple.\n\n<b>INT. TEMPLE OF THE JEDI - COUNCIL CHAMBERS - DAY\n</b>\nQUI-GON stands in a tall stately room. Twelve JEDI sit in a semi-circle.\nOBI-WAN stands behind QUI-GON in the center of the room.\nThe Senior Jedi is MACE WINDU. To his left is an alien Jedi named\nKI-ADI-MUNDI, and to his right, the Jedi Master, YODA.\n\nQUI-GON : ...my only conclusion can be that it was a Sith Lord.\nMACE WINDU : A Sith Lord?!?\nKI-ADI : Impossible! The Sith have been extinct for a millenium.\nYODA : The very Republic is threatened, if involved the Sith are.\nMACE WINDU : I do not believe they could have returned without us knowing.\nYODA : Hard to see, the dark side is. Discover who this assassin is, we\nmust.\nKI-ADI : I sense he will reveal himself again.\nMACE WINDU : This attack was with purpose, that is clear, and I agree the\nQueen is the target.\nYODA : With this Naboo queen you must stay, Qui-Gon. Protect her.\nMACE WINDU : We will use all our resources here to unravel this mystery and\ndiscover the identity of your attacker... May the Force be with you.\nYODA : May the Force be with you.\n\nOBI-WAN turns to leave, but QUI-GON continues to face the Council.\n\nYODA : (Cont'd) Master Qui-Gon more to say have you?\nQUI-GON : With your permission, my Master. I have encountered a vergence in\nthe Force.\nYODA : A vergence, you say?\nMACE WINDU : Located around a person?\nQUI-GON : A boy... his cells have the highest concentration of\nmidi-chlorians I have seen in a life form. It is possible he was conceived\nby the midi-chlorians.\nMACE WINDU : You're referring to the prophesy of the one who will bring\nbalance to the Force...you believe it's this boy??\nQUI-GON : I don't pressume...\nYODA : But you do! Rrevealed your opinion is.\nQUI-GON : I request the boy be tested.\n\nThe JEDI all look to one another. They nod and turn back to OBI-WAN and\n<b>QUI-GON.\n</b>\nYODA : Trained as a Jedi, you request for him?\nQUI-GON : Finding him was the will of the Force...I have no doubt of that.\nThere is too much happening here...\nMACE WINDU : Bring him before us, then.\nYODA : Tested he will be.\n\nINT. QUEENS QUARTERS - CORUSCANT - DAY Anakin, tentative, walks down one of\nthe long hallways in Senator Palpatine's quarters. He stops before a dor\nthat is flanked by TWO GUARDS.\n\nGUARD : May I help you, son?\nANAKIN : I'm...I'm looking for the handmaiden, Padme.\n\nThe GUARD speaks into his comlink as ANAKIN looks around a bit nervously.\n\nGUARD : The boy is here to see Padme.\nRABE : Send him in.\n\nThe doors open, and ANAKIN enters the Queen's quarters.\nRABE greets ANAKIN as TWO OTHER HANDMAIDENS come and go into the next room.\n\nANAKIN : I'd like to speak with Padme, if I could.\nRABE : I'm sorry, Annie. Padme is not here right now.\n\nThe Queen speaks out in the next room.\n\nAMIDALA : (O.S.) Who is it?\nRABE : Anakin Skywalker, to see Padme, Your Highness.\n\nThe QUEEN moves into the doorway and studies ANAKIN. ANAKIN bows and looks\ndown, then takes a peek at her.\n\nAMIDALA : I've sent Padme on an errand.\nANAKIN : I'm going to the Jedi temple to start my training, I hope.\n\nThe QUEEN just stares at him.\n\nANAKIN : (Cont'd) I may not see her again...and... I just wanted to say\ngoodbye.\nAMIDALA : We will tell her for you. We're sure her heart goes with you.\n\nANAKIN bows again.\n\nANAKIN : Thank you, Your Highness. I'm sorry to have disturbed you.\n\nThe QUEEN dissapears behind the doorway, and ANAKIN exits.\n\n<b>EXT. CORUSCANT - GALACTIC SENATE BUILDING - DAY (FX)\n</b>\nA large, distinctive looking domed building stands out amid the cityscape\nof Coruscant.\n\n<b>INT. MAIN ROTUNDA - GALACTIC SENATE - DAY\n</b>\nThe Senate chambers are huge. Thousands of SENATORS and their AIDES sit in\nthe circular assembly area. CHANCELLOR VALORUM sits in an elevated area in\nthe center. Hindreds of AIDES and DROIDS hurry about. SENATOR PALPATINE,\nQUEEN AMIDALA, EIRTA, RABE, and CAPTAIN PANAKA sit in the Naboo\ncongressional box, which is actually a floating platform. PALPATINE leans\nover to the QUEEN.\n\nPALPATINE : If the Federation moves to defer the motion...Your Majesty,\nIbeg of you to ask for a resolution to end this congressional session.\nAMIDALA : I wish I had your confidence in this, Senator.\nPALPATINE : You must force a new election for Supreme Chancellor...I\npromise you there are many who will support us...it is our best chance...\nYour Majesty, our only, chance.\nAMIDALA : You truely believe Chancellor Valorum will not bring our motion\nto a vote?\nPALAPATINE : He is distracted...he is afraid. He will be of no help.\nVALORUM : The Chair recognizes the Senator from the sovereign system of\nNaboo.\n\nThe Naboo congressional box floats into the center.\n\nPALPATINE : Supreme Chancellor, delegates of the Senate. A tragedy has\noccured on our peaceful system of Naboo. We have become caugt in a dispute\nyou're all well aware of, which began right here with the taxation of trade\nroutes, and has now engulfed our entire planet in the oppresion of the\nTrade Federation.\n\nA second box rushes into the center of the Senate. It is filled with\nFederation trade barons led by LOTT DOD, the Senator for the Federation.\n\nLOTT DOD : This is outrageous! I object to the Senator's statements!\nVALORUM : The Chair does not recognize the Senator from the Trade\nFederation at this time. Please return to your station.\n\nLOTT DOD reluctantly moves back to his place.\n\nPALPATINE : To state our allegations, I present Queen Amidala, the recently\nelected ruler of Naboo, to speak on our behalf.\n\nQUEEN AMIDALA stands and addresses the assembly. There is some applause.\n\nAMIDALA : Honorable representatives of the Republic, distinguished\ndelegates, and Your Honor Supreme Chancellor Valorum, I come to you under\nthe gravest of circumstances. The Naboo system has been invaded by force.\nInvaded...against all the laws of the Republic by the Droid Armies of the\nTrade...\nLOTT DOD : I object! There is no proof. This is incredible. We recommend a\ncommision be sent to Naboo to assertain the truth.\nVALORUM : Overruled.\nLOTT DOD : Your Honor, you cannot allow us to be condemned without\nreasonable observation. It's against all the rules of procedure.\n\nA third box representing Malastare moves into the center of the room. AKS\nMOE, the Ambassador, addresses the convention.\n\nAKS MOE : The Congress of Malastare concurs with the honorable delegate\nfrom the Trade Federation. A commision must be appointed...that is the law.\nVALORUM : The point...\n\nVALORUM confers with several of his AIDES and VICE CHAIRMAN MAS AMEDDA.\nPALPATINE whispers something to the QUEEN.\n\nPALPATINE : Enter the bureaucrats, the true rulers of the Republic, and on\nthe payroll of the Trade Federation, I might add. This is where Chancellor\nValorum's strength will dissapear.\nVALORUM : The point is conceded...Section 523A take precedence here. Queen\nAmidala of the Naboo, will you defer your motion to allow a commission to\nexplore the validity of your accusations?\n\nQUEEN AMIDALA is angry but remains composed.\n\nAMIDALA : (angrily) I will not defer...I have come before you to resolve\nthis attack on our sovereignty now. I was not elected to watch my people\nsuffer and die while you discuss this invasion in a committee. If this body\nis not capable of action, I suggest new leadership is needed. I move for a\n\"vote of no confidence\"...in Chancellor Valorum's leadership.\nVALORUM : What?...No!\n\nThis causes a great stir in the assembly. A loud mumur cresendos into a\nroar of approval and jeers. CHANCELLOR VALORUM is stunned and stands\nspeechless. His Vice Chair, MAS AMEDDA, takes over.\n\nMAS AMEDDA : Order! We shall have order...\n\nThings settledown a little. The Federation box settles next to AMIDALA.\nPRINCE BAIL ORGANA moves his box into the arena.\n\nBAIL ORGANA : Alderaan seconds the motion for a vote of no confidence in\nChancellor Valorum.\nMAD AMEDDA : The motion has been seconded by Bail Organa of Alderaan.\n\nMAS AMEDDA turns to the confused VALORUM, and whispers something to him.\n\nBAIL ORGANA : There must be no delays. The motion is on the floor and must\nbe voted upon in this session.\nLOTT DOD : The Trade Federation moves the motion be sent to the procedures\ncommittee for study.\n\nThe assembly begins to chant. VALORUM talks to MAS AMEDDA.\n\nASSEMBLY : Vote now! Vote now! Vote now!\n\nPALPATINE stands next to AMIDALA.\n\nPALPATINE : You see, Your Majaesty, the tide is with us...Valorum will be\nvoted out, I assure you, and they will elect in a new Chancellor, a strong\nChancellor, one who will not let our tragedy continue...\nMAS AMEDDA : Thew Supreme Chancellor requests a recess. Tomorrow we will\nbegin the vote.\n\nThe Federation delegation is furious. VALORUM turns to PALPATINE.\n\nVALORUM : Palpatine, I thought you were my ally...my friend. You have\nbetrayed me! How could you do this?\n\n<b>EXT. PALACE OF THE JEDI - BALCONY - SUNSET\n</b>\nOBI-WAN and QUI-GON stand outside the palace on a balcony.\n\nOBI-WAN : The boy will not pass the Council's tests, Master, and you know\nit. He is far too old.\nQUI-GON : Anakin will become A Jedi...I promise you.\nOBI-WAN : Don't defy the Council, Master..not again.\nQUI-GON : I will do what I must.\nOBI-WAN : Master, you could be sitting on the Council by now if you would\njust follow the code. They will not go along with you this time.\nQUI-GON : You still have much to learn, my young apprentice.\n\n<b>INT. PALACE OF THE JEDI - COUNCIL CHAMBERS - SUNSET\n</b>\nANAKIN stands before the TWELVE JEDI. MACE WINDU holds a small hand-held\nviewing screen. In rapid succession, images flash across the screen.\n\nANAKIN : A ship...a cup...a speeder.\n\nMACE WINDU turns the viewing screen off and nods toward YODA.\n\nYODA : Good, good, young one. How feel you?\nANAKIN : Cold, sir.\nYODA : Afraid are you?\nANAKIN : No, sir.\nMACE WINDU : Afraid to give up your life?\nANAKIN : I don't think so.\n\nANAKIN hesitates for a moment.\n\nYODA : See through you, we can.\nMACE WINDU : Be mindful of your feelings...\nKI-ADI : YOur thoughts dwell on your mother.\nANAKIN : I miss her.\nYODA : Afraid to lose her..I think.\nANAKIN : (a little angry) What's that got to do with anything?\nYODA : Eveything. Fear is the path to the dark side... fear leads to\nanger... anger leads to hate.. hate leads to suffering.\nANAKIN : (angrily) I am not afraid!\nYODA : A Jedi must have the deepest commitment, the most serious mind. I\nsense much fear in you.\nANAKIN : (quietly) I am not afraid.\nYODA : Then continue, we will.\n\n<b>INT. PALPATINES QUARTERS - SUNSET\n</b>\nQUEEN AMIDALA is standing, staring out the window, with JAR JAR. The lights\nof the city shimmer before them. EIRTAE and SABE stand near the door. JAR\nJAR turns to face the QUEEN and sees her sadness.\n\nJAR JAR : Mesa wonder why da guds invent pain?\nAMIDALA : To motivate us, I imagine...\nJAR JAR : Yousa tinken yousa people ganna die?\nAMIDALA : I don't know.\nJAR JAR : Gungans ganna get pasted too, eh?\nAMIDALA : I hope not.\nJAR JAR : Gungans do die'n without a fight.... wesa warriors. Wesa gotta\ngrand army. Dat why you no liken us, metinks.\n\nPALPATINE and CAPTAIN PANAKA rush into the rom and bow before the QUEEN.\n\nCAPT. PANAKA : Your Highness, Senator Palpatine has been nominated to\nsucceed Valorum as Supreme Chancellor.\nPALPATINE : A surprise, to be sure, but a welcome one. I promise, Your\nMajesty, if I am elected, I will bring democracy back to the Republic. I\nwill put an end to corruption. The Trade Fedreation will lose its influence\nover the bureaucrats, and our people will be freed.\nAMIDALA : Who else can be nominated?\nCAPT. PANAKA : Bail Antilles of Alderaan and Ainlee Teem of Malastare.\nPALPATINE : I feel confident...our \"situation\" will create a strong\nsympaphy vote for us... I will be Chancellor, I promise you.\nAMIDALA : I fear by the time you have control of the bureaucrats, Senator,\nthere will be nothing left of our cities, our people, our way of life...\nPALPATINE : I understand your concern, Your Majesty; unfortunately, the\nFederation has possession of our planet. The law is in their favor.\nAMIDALA : With the Senate in transition, there is nothing more I can do\nhere...Senator, this is your arena. I feel I must return to mine. I have\ndecided to go back to Naboo. My place is with my people.\nPALPATINE : Go back!! But, Your Majesty, be realistic! You would be in\ndanger. They will force you to sign the treaty.\nAMIDALA : I will sign no treaty, Senator. My fate will be no different from\nthat of our people. Captain!\nCAPT. PANAKA : Yes, Your Highness?\nAMIDALA : Ready my ship!\nCAPT. PANAKA : Please, Your Majesty, stay here...where it's safe.\nAMIDALA : No place is safe, if the Senate doesn't condemn this invasion. It\nis clear to me now that the Republic no longer functions as a democracy. If\nyou win the election, Senator, I know you will do everything possible to\nstop the Federation. I pray you will bring sanity and compassion back to\nthe Senate.\n\nAMIDALA and her RETINUE exit the room. PALPATINE has a self-satisfied smile\non his face.\n\n<b>INT. TEMPLE OF THE JEDI - COUNCIL CHAMBERS - TWILIGHT\n</b>\nANAKIN, OBI-WAN, and QUI-GON stand before the TWELVE MEMBERS OF THE JEDI\n<b>COUNCIL.\n</b>\nYODA : ...Correct you were, Qui-Gon.\nMACE WINDU : His cells contain a high concentration of midi-chlorians.\nKI-ADI : The Force is strong with him.\nQUI-GON : He's to be trained, then.\n\nThe COUNCIL MEMBERS look to one another.\n\nMACE WINDU : No. He will not be trained.\n\nANAKIN is crestfallen; tears begin to form in his eyes.\n\nQUI-GON : No??!!\n\nOBI-WAN smiles.\n\nMACE WINDU : He is too old. There is already too much anger in him.\nQUI-GON : He is the chosen one...you must see it.\nYODA : Clouded, this boy's future is. Masked by his youth.\nQUI-GON : I will trin him, then. I take Anakin as my Padawan learner.\n\nOBI-WAN reacts with surprise. ANAKIN watches with interest.\n\nYODA : An apprentice, you have, Qui-Gon. Impossible, to take on a second.\nMACE WINDU : We forbid it.\nQUI-GON : Obi-Wan is ready...\nOBI-WAN : Iam ready to face the trials.\nYODA : Ready so early, are you? What know you of ready?\n\nANAKIN watches as QUI-GON and OBI-WAN exchange angry looks.\n\nQUI-GON : Headstrong....and he has much to learn about the living Force,\nbut he is capabe. There is little more he will learn from me.\nYODA : Our own council we will keep on who is ready. More to learn, he\nhas...\nMACE WINDU : Now is not the time for this...the Senate is voting for a new\nSpreme Chancellor. Queen Amidala is returning home, which will put pressure\non the Federation, and could widen the confrontation.\nYODA : And draw out the Queen's attacker.\nKI-ADI : Events are moving fast...too fast.\nMACE WINDU : Go with the Queen to Naboo and discover the identity of the\ndark warrior. That is the clue we need to unravel this mystery of the Sith.\n\nYODA : Young Skywalker's fate will be decided later.\nQUI-GON : I brought Anakin here; he must stay in my charge. He has nowhere\nelse to go.\nMACE WINDU : He is your ward, Qui-Gon...we will not dispute that.\nYODA : Train him not. Take him with you, but train him not!\nMACE WINDU : Protect the Queen, but do not intercede if it comes to war\nuntil we have the Senate's approval.\nYODA : May the Force be with you.\n\nOBI-WAN, QUI-GON, and ANAKIN leave.\n\n<b>EXT. CORUSCANT - SENATE LANDING PLATFORM - NIGHT\n</b>\nQUI-GON, OBI-WAN, and ANAKIN stand on the landing platform outside the\nship. ARTOO whistles a happy tune as he leans over the edge of the\nplatform, watching the traffic. Suddenly, he leans over too far and falls\noverboard. After a moment, he reappears, using his on-board jets to propel\nhimself back onto the landing platform. The wind whips at ANAKIN as he\nlistens to the JEDI.\n\nOBI-WAN : It is not disrespect, Master, it is the truth.\nQUI-GON : From your point of view....\nOBI-WAN : The boy is dangerous...they all sense it. Why can't you?\nQUI-GON : His fate is uncertain, not dangerous. The Council will decide\nAnakin's future...that should be enough for you. Now get on board!\nOBI-WAN reluctantly boards the Naboo spacecraft followed by ARTOO. QUI-GON\ngoes over to ANAKIN.\nANAKIN : Master Qui-Gon, sir, I do not wish to be a problem.\nQUI-GON : You won't be, Annie....I'm not allowed to train you, so I want\nyou to watch me and be mindful...always remember, your focus determines\nyour reality. Stay close to me and you will be safe.\nANAKIN : Master, sir...I've been wondering...what are midi-chlorians?\nQUI-GON : Midi-chlorians are a microcopic lifeform that reside within all\nliving cells and communicates with the Force.\nANAKIN : They live inside of me?\nQUI-GON : In your cells. We are symbionts with the midi-chlorians.\nANAKIN : Symbionts?\nQUI-GON : Life forms living together for mutual advantage. Without the\nmidi-chlorians, life could not exist, and we would have no knowledge of the\nForce. They continually speak to you, telling you the will of the Force.\nANAKIN : They do??\nQUI-GON : When you learn to quiet your mind, you will hear them speaking to\nyou.\nANAKIN : I don't understand.\nQUI-GON : With time and training, Annie...you will.\n\nTwo taxis pull up, and CAPTAIN PANAKA, SENATOR PALPATINE, TWENTY OR SO\nTROOPS, GUARDS, and OFFICERS walk briskly toward the ship, followed by\nQUEEN AMIDALA, PADME, EIRTAE, and finally, JAR JAR. AMIDALA and her\nHANDMAIDENS stop before the JEDI.\n\nQUI-GON : (Cont'd) Your Highness, it is our pleasure to continue to serve\nand protect you.\nAMIDALA : I welcome your help. Senator Palpatine fears the Federation means\nto destroy me.\nQUI-GON : I promise you, I will not let that happen.\n\nAMIDALA enters the ship, followed by her HANDMAIDENS. JAR JAR hugs QUI-GON\nand ANAKIN.\n\nJAR JAR : Wesa goen home!\n\nThey ALL move onto the ship. The ship takes off.\n\n<b>INT. NABOO PALACE - THRONE ROOM - THEED - NIGHT\n</b>\nNUTE and RUNE stand before a hologram of DARTH SIDIOUS.\n\nDARTH SIDIOUS : The Queen is on her way to you. I regret she is of no\nfurther use to us. When she gets there, destroy her.\nNUTE : Yes, my Lord.\nDARTH SIDIOUS : Viceroy, is the planet secure?\nNUTE : Yes, my Lord, we have taken over the last pockets of primitive life\nforms. We are in complete control of the planet now.\nDARTH SIDIOUS : Good. I will see to it that in the Senate, things stay as\nthey are. I am sending Darth Maul to join you. He will deal with the Jedi.\nNUTE : Yes, my Lord.\n\nDARTH SIDIOUS fades off.\n\nRUNE : A Sith lord here with us?!!\n\n<b>INT. SPACE - NABOO SPACECRAFT COCKPIT\n</b>\nANAKIN stands next to the PILOT, RIC OLIE, pointing to various buttons and\ngauges.\n\nANAKIN : ...and that one?\nRIC OLIE : The forward stabalizer.\nANAKIN : And those control the pitch?\nRIC OLIE : You catch on pretty quick.\n\n<b>INT. NABOO SPACECRAFT - QUEEN'S CHAMBERS\n</b>\nSABE and EIRTAE stand behind QUEEN AMIDALA as she talks with QUI-GON and\nCAPTAIN PANAKA. OBI-WAN and JAR JAR watch.\n\nCAPT. PANAKA : The moment we land the Federation will arrest you, and force\nyou to sign the treaty.\nQUI-GON : I agree...I'm not sure what you hope to accomplish by this.\nAMIDALA : I'm going to take back what's ours.\nCAPT. PANAKA : There are only twelve of us, Your Highness....we have no\narmy.\nQUI-GON : I cannot fight a war for you, Your Highness, only protect you.\nAMIDALA : Jar Jar Binks!\n\nJAR JAR looks around, puzzled.\n\nJAR JAR : Mesa, Your Highness?\nAMIDALA : Yes. I need your help.\n\n<b>INT. NABOO CRUISER COCKPIT - DAY\n</b>\nThe Naboo Cruiser heads toward the lush green planet. There is only one\nFederation battle cruiser orbiting. OBI-WAN and CAPTAIN PANAKA spot it on\nthe view screen.\n\nPANAKA : The blockade's gone.\nOBI-WAN : The war's over...No need for it now.\nRIC OLIE : I have one battleship on my scope.\nOBI-WAN : A droid control ship.\nPANAKA : They've probably spotted us.\nOBI-WAN ; We haven't much time.\n\n<b>INT. NABOO SPACECRAFT - MAIN HOLD\n</b>\nThe QUEEN, CAPTAIN PANAKA, TROOPS, and HANDMAIDENS get ready to disembark\nas the ship alnds. The elevator door slides open, and ANAKIN emerges into\nthe hold area. He see PADME and run up to her.\n\nANAKIN : Hi! Where have you been?\nPADME : Annie! What are you doing here?\nANAKIN : I'm with Qui-Gon...but...they're not going to let me be a Jedi.\nI'm too old.\nPADME : This is going to be dangerous, Annie.\nANAKIN : Is it? I can help... Where are we going?\nPADME : To war, I'm afraid. The Queen has had to make the most difficuld\ndecision of her life. She doesn't believe in fighting, Annie. We are a\npeaceful people...\nANAKIN : I want to help...I'm glad you're back.\n\nANAKIN smiles. PADME smiles back.\n\n<b>EXT. NABOO SWAMP - DAY\n</b>\nThe Naboo spacecraft has landed in the Gungan swamp. TROOPS unload the\nships in the background as OBI-WAN approaches QUI-GON.\n\nOBI-WAN : Jar Jar is on his way to the Gungan city, Master.\n\nQUI-GON's thoughts are elsewhere.\n\nQUI-GON : Good.\n\nOBI-WAN and QUI-GON stand silently for a moment.\n\nOBI-WAN : Do you think the Queen's idea will work?\nQUI-GON : The Gungans will not easily be swayed, and we cannot use our\npower to help her.\nOBI-WAN : I'm...I'm sorry for my behavior, Master. It is not my place to\ndisagree with you about the boy. I am grateful you think I am ready for the\ntrials.\n\nQUI-GON looks at him for a long moment.\n\nQUI-GON : You have been a good apprentice. You are much wiser than Iam,\nObi-Wan. I foresee you will become a great Jedi Knight.\n\n<b>EXT. NABOO SWAMP - UNDERWATER - DAY (FX)\n</b>\nJAR JAR swims down into Bubble City.\n\n<b>INT. OTOH GUNGA - CITY SQUARE\n</b>\nJAR JAR enters the main square of the bubble city. He stands, stunned, in\namazement and fear. He is nervous and shaking.\n\nJAR JAR : Ello! Where das everybody?\n\nThe plaza is empty. He notices that many of the buildings are shot up as if\nthere had been a battle of some kind.\n\n<b>EXT. NABOO SWAMP LAKE - DAY\n</b>\nJAR JAR exits the swamp lake and walks over to QUEEN AMIDALA, CAPTAIN\nPANAKA, OBI-WAN, and QUI-GON. PADME, EIRTAE, RABE, ANAKIN, and ARTOO,\n<b>FOUR\n</b>PILOTS, and EIGHT GUARDS stand in the background near the starship.\n\nJAR JAR : Dare-sa nobody dare. All gone. Some kinda fight, I tink. Sorry,\nno Gungas...no Gungas.\nCAPT. PANAKA : Do you think they have been taken to camps?\nOBI-WAN : More likely they were wiped out.\nJAR JAR : No...mesa no tink so. Gungan hiden. When in trouble, go to sacred\nplace. Mackineeks no find them dare.\nQUI-GON : Do you know where they are?\n\n<b>EXT. NABOO SWAMP - DAY\n</b>\nThe GROUP follows JAR JAR as he moves through the swamp. JAR JAR stops and\nsniffs the air. The GROUP stop behind him.\n\nJAR JAR : Dissen it.\n\nJAR JAR makes a strange chattering noise. Suddenly, out of nowhere, CAPTAIN\nTARPALS and SIX OTHER GUNGAN TROOPS riding on KAADUS emerge from the brush.\n\nJAR JAR : (Cont'd) Heyo-dalee, Captain Tarpals.\nCAPT. TARPALS : Binks!! Noah gain!\nJAR JAR : We comen to see da boss.\n\nCAPTIAN TARPALS rolls his eyes.\n\nCAPT. TARPALS : Ouch time, Binks... Ouch time for all-n youse.\n\n<b>EXT. NABOO SACRED TEMPLE RUINS - DAY\n</b>\n<b>JAR JAR, QUEEN AMIDALA, ANAKIN, ARTOO, QUI-GON, OBI-WAN, PADME, RABE,\n</b>EIRTAE, and the rest of her group are led through a clearing full of GUNGAN\nrefugees. At the far end are the ruins of a grand temple with massive\ncarved heads. BOSS NASS and several other COUNCIL MEMBERS walk out on the\ntop of a three-quarter-submerged head.\n\nBOSS NASS : Jar Jar, yousa payen dis time. Who's da uss-en others??\n\nQUEEN AMIDALA steps forward. CAPTAIN PANAKA and the JEDI stand behind her.\n\nAMIDALA : I am Queen Amidala of the Naboo...I come before you in peace.\nBOSS NASS : Naboo biggen. Yousa bringen da Mackineeks... Dya busten uss-en\nomm. Yousa all bombad. Yousa all die'n, mesa tink.\n\nCAPTAIN PANAKA and HALF A DOZEN GUARDS and PILOTS look around nervously,\nand the GUNGAN TROOPS lower their long power poles. The JEDI stay relaxed.\nANAKIN watches everything with great interest.\n\nAMIDALA : We wish to form an alliance...\n\nSuddenly, PADME steps forward.\n\nPADME : Your Honor...\n\nARTOO whistles a quiet \"uh oh.\"\n\nBOSS NASS : Whosa dis?\nPADME : I am Queen Amidala (points to Queen) This is my decoy...my\nprotection...my loyal bodyguard.\n\nANAKIN is stunned. OBI-WAN and QUI-GON give each other a knowing look.\n\nPADME : (Cont'd) ...I am sorry for my deception, but under the\ncircumstances it has become necessary to protect myself. Although we do not\nalways agree, Your Honor, our two great societies have always lived in\npeace...until now. The Trade Federation has destroyed all that we have\nworked so hard to build. You are in hiding, my people are in camps. If we\ndo not act quickly, all will be lost forever...I ask you to help us...no, I\nbeg you to help us.\n\nPADME drops to her knees and prostrates herself before BOSS NASS. There is\na gasp from CAPTAIN PANAKA, HIS TROOPS, and the HANDMAIDENS.\n\nPADME : (Cont'd) We are your humble servants...our fate is in your hands.\n\nSlowly, CAPTAIN PANAKA and his TROOPS bow down before the GUNGAN COUNCIL.\nThen the HANDMAIDENS, ANAKIN, and finally the JEDI. The GUNGANS are puzzled\nby this. BOSS NASS begins to laugh.\n\nBOSS NASS : Yousa no tinken yousa greater den da Gungans.. Mesa like dis.\nMaybe wesa bein friends.\n\n<b>INT. NABOO PALACE - THRONE ROOM - DAY\n</b>\nNUTE, RUNE, and DARTH MAUL walk with a hologram of DARTH SIDIOUS.\n\nNUTE : ...we've sent out patrols. We've already located their starship in\nthe swamp....It won't be long, My Lord.\nDARTH SIDIOUS : This is an unexpected move for her. It's too aggresive..\nLord Maul, be mindful.\nDARTH MAUL : Yes, my Master.\nDARTH SIDIOUS : Be patient... Let them make the first move.\n\n<b>EXT. NABOO EDGE OF SWAMP/ GRASS PLAINS - DAY\n</b>\nA GUNGAN SENTRY sits on top of the ancient temple heah, searching the\nlandscape with a pair of electrobinoculars. He sees something and yells\ndown to ANAKIN at the foot of the statue.\n\nGUNGAN LOOKOUT : Daza comen!\nANAKIN : All right. They're here!\n\nANAKIN yells and runs over to PADME and the JEDI, who are discussing a\nbattle plan with FIVE GUNGAN GENERALS. SABE and EIRTAE stand nearby. BOSS\nNASS puts his arm around JAR JAR.\n\nBOSS NASS : Yousa doen grand. Jar Jar bringen da Naboo together.\nJAR JAR : Oh, no, no, no...\nBOSS NASS : So, wesa maken yousa Bombad General.\nJAR JAR : General??! Oh, no..\n\nJAR JAR's eyes roll back, his tongue flops out and he faints.\nFOUR SPEEDERS pull up to the GROUP. CAPTAIN PANAKA and a DOZEN OR SO\n<b>GUARDS\n</b>and PILOT pile out and join the group.\n\nPADME : What is the situation?\nCAPT. PANAKA : Almost everyone's in camps. A few hundred police and guards\nhave formed an underground movement. I brought as many of the keaders as I\ncould. The Federation Army's also much larger than we thought, and much\nstronger. Your Highness, this is a battle I do not think we can win.\nPADME : The battle is a diversion. The Gungans must draw theDroid Army away\nfrom the cities. We can enter the city using the secret passages on the\nwaterfall side. Once we get to the main entrance, Captain Pnaka will create\na diversion, so that we can enter the palace and capture the Viceroy.\nWithout the Viceroy, they will be lost and confused.\n\nQUI-GON and OBI-WAN look on with interest.\n\nPADME : (Cont'd) What do you think, Master Jedi?\nQUI-GON : The Viceroy will be well guarded.\nCAPT. PANAKA : The difficulty's getting into the throne room. Once we're\ninside, we shouldn't have a problem.\nQUI-GON : There is a possibility with this diversion many Gungans will be\nkilled.\nBOSS NASS : Wesa ready to do are-sa part.\n\nJAR JAR smiles a very worried and sheepish grin. ANAKIN watches with\ninterest, as does ARTOO.\n\nPADME : We have a plan which should immobilize the Droid Army. We will send\nwhat pilots we have to knock out the Droid control ship which is orbiting\nthe planet. If we can get past their rayshields, we can sever communication\nand their droids will be helpless.\nQUI-GON : A well-conceived plan. However, there's great risk. The weapons\non your fighters may not penetrate the shields on the control ship.\nOBI-WAN : And there's an even bigger danger. If the Vicroy escapes, Your\nHighness, he will return with another droid army.\nPADME : That is why we must not fail to get to the Viceroy. Everything\ndepends on it.\n\n<b>INT. THEED - PALACE - THRONE ROOM - DAY\n</b>\nNUTE, RUNE, DARTH MAUL, OOM-9, and a hologram of DARTH SIDIOUS walk through\nthe throne room.\n\nDARTH SIDIOUS : ...she is more foolish than I thought.\nNUTE : We are sending all available troops to meet this army of hers\nassembling near the swamp. It appears to be made up of primitives. We do\nnot expect much resistance.\nOOM-9 : I am increasing security at all Naboo detention camps.\nDARTH MAUL : I feel there is more to this, My Master. The two Jedi may be\nusing the Queen for their own purposes.\nDARTH SIDIOUS : The Jedi cannot become involved. They can only protect the\nQueen. Even Qui-Gon Jinn will not break that conenant.... This will work to\nour advantage...\nNUTE : I have your approval to proceed then, My Lord.\nDARTH SIDIOUS : Proceed. Wipe them put...all of them. INT. NABOO SWAMP LAKE\n<b>- DAY (FX)\n</b>\nAll is peaceful. SMALL CRITTERS drink out of a large swamp lake. Suddenly\nthere is a disturbance in the middle of the lake. A rush of bubbles, then a\nGUNGAN SOLDIER riding a KAADU emerges from the water, followed by SEVERAL\nOTHERS. FROGS and OTHER LITTLE ANIMALS flee in all directions as the GUNGAN\nARMY marches through the swamp. The KAADU shake themselves off as they exit\nthe lake. When JAR JAR's KAADU shakes off, JAR JAR falls off.\nSOLDIERS on huge, lizard-like FAMBAAS with large shield generators mounted\non their backs follow the marching WARRIORS. The GUNGAN ARMY heads out of\nthe swamp and onto the rolling grassy hills.\nHUNDREDS OF GUNGAN WARRIORS march in lon lines toward the horizon.\nFederation tanks move up to a ridge and stop. In the distance they see the\nGUNGAN ARMY marching toward them. The GUNGAN GENERAL CEEL sees the tanks on\nthe ridge and orders a halt. The GUNGANS are spread out in a large line.\nJAR JAR is nervous. GENERAL CEEL signals to the shield operators.\n\nGENERAL CEEL : Energize the shields.\n\nA red ray shoots out of the generator and blasts into a large dish on the\nback of a second FAAMBA and spreads like an umbrella over the assembled\n<b>WARRIORS.\n</b>\n<b>EXT. THEED - CENTRAL PLAZA - DAY\n</b>\nPADME, followed by EIRTAE, OBI-WAN, QUI-GON, ANAKIN, and ARTOO, stealthily\nmakes her way toward the entrance to the main hanger. They are followed by\nabout TWENTY NABOO GUARDS, PILOTS, and TROOPS. They stop, and PADME uses a\nsmall red laser light to signal across the plaza to CAPTAIN PANAKA, RABE\nand TWENTY OTHER ASSORTED NABOO TROOPS. They signal back. QUI-GON leans\nover to ANAKIN.\n\nQUI-GON : Once we get inside, Annie, you find a safe placeto hide and stay\nthere.\nANAKIN : Sure.\nQUI-GON : And stay there!\n\nDROID TROOPS mill about the tank-filled plaza. At the far end of the plaza,\nSEVERAL DROIDS begin to run and fire. NABOO SOLDIERS begin to fire back at\nthe BATTLE DROIDS.\nAs the ruckus erupts at one end of the plaza, PADME and her TROOPS rush\ninto the main hanger. CAPTAIN PANAKA and HIS SOLDIERS continue to engage\nthe DROIDS outside.\n\n<b>INT. THEED - CENTRAL HANGER - DAY\n</b>\nALARMS ARE SOUNDING a PADME, the JEDI, ANAKIN, EIRTAE, and PADME's TROOPS\nrush into the hanger. BATTLE DROIDS begin firing at them as they run for\ncover. ANAKIN runs under a Naboo fighter. The JEDI deflect bolts aimed at\nPADME back onto the BATTLE DROIDS, causing them to EXPLODE.\n\n<b>INT. THEED - PALACE THRONE ROOM - DAY\n</b>\nNUTE, RUNE, and FOUR COUNCIL MEMBERS watch the plaza battle on a large view\nscreen.\n\nNUTE : I thought the battle was going to take place far from here...this is\ntoo close!\nRUNE : What is going on?\n\nDARTH MAUL enters the throne room.\n\nDARTH MAUL : I told you there was more to this...the Jedi are involved.\n\n<b>EXT. NABOO GRASS PLAINS - DAY (FX)\n</b>\nThe Federation tanks begin to fire on the GUNGANS, but they are protected\nby their energy shield. The tanks stop firing, and the GUNGANS CHEER, until\nthey see the doors to the massive transports open, and racks of BATTLE\nDROIDS are pulled out and lined up by a squad of STAPS.\nThe BATTLE DROIDS reconfigure into their standing position. The GUNGANS get\nready for an attack. OOM-9 gives the command to move forward, and THOUSANDS\nOF DROIDS march toward the GUNGANS.\nThe GUNGANS power up their weapons. The DROIDS slowly march through the\nprotective shield and start firing. The GUNGANS throw their power poles and\nfling small balls of energy with slingshots. The WARRIORS dump large balls\nof energy into mortars that heat up and fire the energy goo onto the BATTLE\nDROIDS, causing them to short out.\nThe battle rages and the GUNGANS defend their shield generators against the\nARMY OF DROIDS. OOM-9 watches from a tank on a hill overlooking the battle.\n\n<b>INT. THEED - CENTRAL HANGER - DAY\n</b>\nANAKIN hides behind one of the Naboo fighters, ducking as large bolts whiz\npast and EXPLODE near him. PADME and the TWO JEDI destroy BATTLE DROIDS\nright and left. The QUEEN'S TROOPS and EIRTAE also blast away at the\nDROIDS. PADME signals to her pilots.\n\nPADME : Get to your ships!\n\nThe PILOTS and ARTOO UNITS run for the Naboo fighter craft stacked in the\nhanger bay. ONE OF THE PILOTS jumps into a fighter right above where ANAKIN\nis hiding.\n\nFIGHTER PILOT : Better find a new hiding place, kid. I'm taking this ship.\n\nThe ship begins to levitate out of the hanger. BATTLE DROIDS fire at it as\nit falls in behind five other fighters. ARTOO whistles to ANAKIN from a\nsecond fighter not far away. ANAKIN runs and jumps into the second fighter\nto hide.\n\n<b>EXT. THEED - CENTRAL PLAZA - DAY (FX)\n</b>\nTwo Naboo starfighters exit the main hanger. A tank fires at them, hitting\none of them, which causes it to pinwheel into the ground and EXPLODE.\n\n<b>INT. THEED - CENTRAL HANGER - DAY\n</b>\nCAPTAIN PANAKA, SABE and NABOO TROOPS rush into the hanger and overwlm the\nfew remaining BATTLE DROIDS. PADME, OBI-WAN, and QUI-GON join forces with\n<b>CAPTAIN PANAKA.\n</b>\nPADME : My guess is the Viceroy is in the throne room.\n\nShe looks to QUI-GON.\n\nQUI-GON : I agree.\n\nThey start to head for the exit, on the way passing the fighter where\nANAKIN is hiding. ARTOO whistles a greeting as ANAKIN peeps out of the\ncockpit.\n\nANAKIN : Hey! Wait for me.\nQUI-GON : No, Annie, you stay there. Stay right where you are.\nANAKNI : But, I...\nQUI-GON : Stay in that cockpit.\n\nThey head for the exit. As they are about to go through the door, suddenly\neveryone scatters, revealing DARTH MAUL standing in the doorway. CAPTAIN\nPANAKA, PADME, and HER TROOPS back away. QUI-GON and OBI-WAN step forward.\n\nQUI-GON : (Cont'd) We'' handle this...\n\nThe TWO JEDI take off their capes and ignite their laser swords. DARTH MAUL\ntakes off his cape, and ignites his laser sword. Both ends of the sword\nlight up.\nAt the far end of the hanger, SIX WHEEL DROIDS roll in and transform into\ntheir battle position. ARTOO calls ANAKIN's attention to the DROIDS. The\nJEDI begin to fight the Sith Lord.\n\nANAKIN : Oh, no...\n\nThe DROIDS begin to advance and start firing on PADME and HER TROOPS.\n\nANAKIN : (Cont'd) We gotta do something, Artoo.\n\nARTOO whistles a reply. Suddenly, the ship's systems go on, and the ship\nbegins to levitate.\n\nANAKIN : (Cont'd) All right, thanks Artoo! Great idea! I'll take over.\nLet's see...\n\nANAKIN steers the ship toward the DROIDS. He pushes a button, and the ship\nbegins to shake.\n\nANAKIN : (Cont'd) Where's the trigger? Oops, wrong one.. Maybe this one....\n\nANAKIN pushes a second button, and the lasers begin to fire, wiping out\nseveral DESTROYER DROIDS. ARTOO whistles a cheer.\n\nANAKIN : (Cont'd) Yeah, all right. \"Droid blaster.\" Yeah!\n\nThe JEDI are engaged in a fierce sword fight with DARTH MAUL. They have\nmoved into the center of the hanger. While the WHEEL DROIDS are momentarily\ndistracted by ANAKIN, CAPTAIN PANAKA, PADME, and HER TROOPS exit into a\npalace hallway.\nThe WHEEL DROIDS start firing at ANAKIN. There are EXPLOSIONS all around\nhim.\n\nANAKIN : (Cont'd) Oops...shield up! Always on the right...shields always on\nthe right.\n\nANAKIN flips several switches, and the after-burner ignites.\n\nANAKIN : (Cont'd) I know we're moving. I'll shut the energy drive down.\n\nThe fighter rockets out of the hanger. ARTOO and ANAKIN hold on for dear\nlife.\n\nANAKIN : (Cont'd) Oops!! Wrong one.\n\nARTOO beeps.\n\nANAKIN : (Cont'd) I'm not doing anything!\n\nARTOO beeps.\n\nANAKIN : (Cont'd) I know...I didn't push anything.\n\nThe SITH LORD's moves are incredible. He is fighting the TWO JEDI at once,\nflipping into the air, outmaneuvering them at every turn.\n\n<b>INT. NABOO STARFIGHTER - COCKPIT - SPACE\n</b>\nThe Naboo fleet leaves the planet and heads toward the space station.\n\nRIC OLIE : Bravo Flight A, take on the fighters. Flight B, make the run on\nthe transmitter.\nBRAVO TWO : Roger, Bravo Leader.\n\nThe fleet approaches the space station. Many Federation fighters exit the\nhangers and attack.\n\nRIC OLIE : Enemy fighters straight ahead!\n\n<b>EXT. NABOO GRASS PALINS - DAY\n</b>\nJAR JAR's clumsiness works for him in the battle. He gets caught up in the\nwiring of a blasted DROID, dragging the torso around with him, the DROID's\ngun firing randomly, accidently blasting SEVERAL DROIDS in one process.\nOOM-9 decides to send in the WHEEL DROIDS and gives the signal. HUNDREDS OF\nWHEEL DROIDS roll out of the transports and head down toward the battle.\nThey slowly roll through the deflector shields, then transform themselves\nonce they get on the other side. The GUNGANS blast the WHEEL DROIDS with\nenergy balls. The DESTROYER DROIDS blast many GUNGANS.\n\n<b>INT. NABOO STARFIGHTER - COCKPIT - SPACE\n</b>\nA giant dogfight ensues. ANAKIN's fighter flies into space above Naboo.\nARTOO beeps a worried concern.\n\nANAKIN : The Autopilot is searching for what other ships?\n\nARTOO beeps and whistles.\n\nANAKIN : (Cont'd) There is no manual override, Artoo. You'll have to rewire\nit or something.\n\nARTOO chirps that he's trying.\n\nANAKIN : (cont'd) Look! There they are! That's where the autopilot is\ntaking us.\n\nANAKIN's fighter flies toward the Federation Battleship.\n\n<b>INT. THEED - CENTRAL HANGER - DAY\n</b>\nThe SITH LORD drives the JEDI out of the hanger and nto the power generator\narea next door.\n\n<b>INT. THEED - POWER GENERATOR PIT - DAY\n</b>\nThree swords are crossed in an intense display of swordmanship. The JEDI\nand the SITH LORD fight their way across the narrow bridge of the Theed\npower generator. DARTH MAUL jumps onto the bridge above them. The JEDI\nfollow, one in front of the SITH LORD and one behind. They continue their\nsword fight.\n\n<b>INT. THEED - PALACE - HALLWAY - DAY\n</b>\nPADME, CAPTAIN PANAKA, EIRTAE, SABE and THIER TROOPS are trapped in a\nhallway by BATTLE DROIDS.\n\nPADME : We don't have time for this, Captain.\nCAPT. PANAKA : Let's try the outside stairway.\n\nCAPTAIN PANAKA blasts a hole in the window, and they make their way outside\nthe building onto a ledge about six stories above a raging waterfall. SABE,\nEIRTAE and about TWENTY NABOO SOLDIERS stay in the hallway to hold off the\n<b>BATTLE DROIDS.\n</b>\n<b>EXT. THEED - PALACE - OVER WATERFALL - DAY\n</b>\nPADME, CAPTAIN PANAKA, and about TEN OTHER NABOO SOLDIERS are lined up\nalong the edge. They have pulled small attachments out of their pistols and\nfire at a ledge about four stories above them. Thin cables shoot out of the\npistols and are embedded into the ledge. PADME, CAPTAIN PANAKA, and the\nOTHERS begin to climb up the wall.\n\n<b>EXT . NABOO GRASS PLAINS DAY\n</b>\nThe GUNGAN ARMY is no match for the DESTROYER DROIDS. JAR JAR tries to run\nfrom the BATTLE DROIDS.\n\nGENERAL CEEL : Retreat! Retreat!\n\nThe GUNGANS begin to turn and run, on foot, on their kaadu, and in wagons.\nJAR JAR attempts to escape on a wagon of energy balls but only manages to\nunhitch the back gate, causing all of the energy balls to roll out of the\nwagon and down the hill. JAR JAR scrambles to avoid being hit by one of the\nballs. FOUR DESTROYER DROIDS aren't so lucky. They get blasted by the\nenergy balls.\nThe GUNGANS renew their attack on the DROID ARMY. JAR JAR's bumbling\ndestroys several more DESTROYER DROIDS.\n\n<b>INT. NABOO STARFIGHTER - COCKPIT -SPACE\n</b>\nANAKIN finds himself in the middle of the space battle. A ship explodes\nbehind him (over his left shoulder).\n\nANAKIN : Whoo, boy! This is tense!\n\nHe looks forward to see enemy ships approaching head on.\n\nANAKN : (Cont'd) : Oops! Artoo, get us off Autopilot!\n\nARTOO screams a reply.\n\nANAKIN : (Cont'd) I've got control?\n\nANAKIN fips switches.\n\nANAKIN : (Cont'd) Okay, let's go left!\n\nHe moves the controls left and the ship responds, turning left.\n\nANAKIN : (Cont'd) Yes...I've got control. You did it, Artoo!\n\nARTOO beeps\n\nANAKIN : (Cont'd) Go back!?! Qui-Gon told me to stay in this cockpit and\nthat's what I'm gonna do. Now c'mon!\n\nAn enemy fighter comes into his sights. ANAKIN pushes the controls and\ninstead of firing, his fighter accelerates past the enemy ship.\n\nANAKIN : (Cont'd) Oops! Whoa!\n\nNow the enemy ship is on his tail. He tries evasive maneauvers.\n\nANAKIN : (Cont'd) I'll try spinning, that's a good trick.\n\nANAKIN rolls the ship as ARTOO screams desperately.\n\nANAKIN : (Cont'd) I know we're in trouble! Hang on! The way out of this\nmess is the way we got into it.\n\nARTOO beeps a reply.\n\nANAKIN : (Cont'd) Which one? This one?\n\nANAKIN yanks on the reverse thrusters and the ship slows instantly- the\nenemy fighter shoots past and explodes against the space station.\n\n<b>INT. NABOO STARFIGHTER - COCKPIT - SPACE\n</b>\nThe SQUADRON attacks the space station.\n\nRIC OLIE : Bravo flight...go for the central bridge.\nBRAVO TWO : ROger, Bravo Leader.\n\nThe attack is fruitless.\n\nRIC OLIE : Their deflector shield is too strong. We'll never get through\nit.\n\nMeanwhile, ANAKIN is being chased by another fighter. ARTOO shrieks.\n\nANAKIN : I know, Artoo! This isn't Podracing!\n\nThe enemy ship fires and hits ANAKIN's fighter, sending it into a spin.\nARTOO screams.\n\nANAKIN : (Cont'd) We're hit!\n\nANAKIN regains control as his ship enters the space station hanger.\n\nANAKIN : (Cont'd) Great gobs of bantha poo-doo!\n\nANAKIN's ship dodges parked transport ships and other obstacles. A huge\nbulkhead blocks his way. ARTOO beeps.\n\nANAKIN : (Cont'd) I'm trying to stop! I'm trying to stop! Whoa!\n\nANAKIN hits the reverse thrusters and the ship skids to a stop on the\nhanger deck. ARTOO givesout a worried whistle.\n\nANAKIN : (Cont'd) All right! All right! Get the system started!\n\nANAKIN ducks down to adjust a control panel.\n\nANAKIN : (Cont'd) Everything's overheated. All the lights are red.\n\nARTOO sees DROIDS appraoching, and beeps frantically.\n\n<b>INT. THEED - POWER GENERATOR PIT - DAY\n</b>\nThe laser sword battle continues on the small catwalk around the vast power\npit. DARTH MAUL kicks OBI-WAN off one of the ramps and he falls several\nlevels. QUI-GON knocks the DARK LORD off another ramp, and he lands hard on\na ramp two levels below. QUI-GON jumps down after him. The DARK LORD backs\naway along the catwalk into a small door. QUI-GON follows as OBI-WAN runs\nto catch up.\n\n<b>INT. THEED - POWER GENERATOR ELECRIC BEAM - HALLWAY\n</b>\nThe SITH LORD, followed by QUI-GON, enters a long hallway filled with a\nseries of deadly rays that go on and off in a pulsing pattern that shoots\ndown the corridor every minute or so. DARTH MAUL makes it down several\nwalls of deadly rays before they close. QUI-GON is one wall away from the\nDARK LORD. OBI-WAN is just starting into it and is five walls way from\n<b>DARTH MAUL.\n</b>The JEDI must wait until the next pulse to advance down the corridor.\nOBI-WAN is impatient and paces, waiting for the wall of rays to open.\nQUI-GON sits and meditates. The SITH LORD tries to patch up his wounds.\n\n<b>INT. THEED - PALACE - HALLWAY TO THRONE ROOM\n</b>\nA window in the hallway blasts apart. PADME, CAPTAIN PANAKA, and HER\nSOLDIERS climb into the hallway. They head for the door to the throne roo.\nSuddenly, two DESTROYER DROIDS skitter in front of the door. PADME turns\naround and sees TWO MORE appear at the far end of the hallway, trapping\nthem in the middle.\nPADME throws down her pistol and turns to CAPTAIN PANAKA.\n\nPADME : Throw down your weapons. They win this round.\nCAPT. PANAKA : But we can't....\nPADME : Captain, I said throw down your weapons.\n\nCAPTAIN PANAKA and HIS MEN throw down their weapons.\n\n<b>EXT. NABOO GRASS PLAINS - DAY\n</b>\nA DESTROYER DROID blasts one of the shield generators, causing it to\nEXPLODE. The protective shield begins to weaken and fall apart.OOM-9 sees\nthe shield weaken and orders his tanks forward. The GUNGAN GENERAL signals\na retreat as the tanks enter the battle.\nThe GUNGANS flee as fast as they can. JAR JAR is blown off his KAADU and\nlands on one of the tank guns. A GUNGAN WARRIOR signals JAR JAR to jump\noff. JAR JAR is afraid. The gun swings around trying to knock JAR JAR off.\nJAR JAR hangs from the tank barrel as it moves along. Finally, he jumps\nonto a KAADU behind a GUNGAN WARRIOR. EXPLOSIONS from the tank fire are\neverywhere. It is chaos.\n\n<b>INT. THEED - POWER GENERATOR ELECTRIC BEAM - HALLWAY\n</b>\nThe electric rays cycle as QUI-GON sits meditating. The wall of the deadly\nrays turn away, and OBI-WAN starts running toward QUI-GON and the DARK\nLORD. When the wall between QUI-GON and DARTH MAUL opens, QUI-GON is in a\nsplit second fighting the DARK LORD with a ferocity not seen before. They\nmove into the area at the end of the corridor called the melting pit, a\nsmall area that is mostly made up of a deep hole.\nThe electron ray gates begin to close. OBI-WAN tries to make it to the\nmelting pit but is caught one gate short. He slides to a stop just before\nhe hits the deadly electron field.\nQUI-GON and DARTH MAUL battle around the melting pit as a frustrated\nOBI-WAN watches.\nDARTH MAUL cathces QUI-GON off guard. The SITH makes a quick move, bashes\nhis lightsaber handle into QUI-GON's chin, and runs him through. QUI-GON\nslumps to the floor in a heap.\n\n<b>EXT. NABOO GRASS PLAINS - DAY\n</b>\nThe GUNGANS have beeb overrun. Some flee into the hills, chased by BATTLE\nDROIDS on STAPS. Many OTHERS are herded into groups by BATTLE DROIDS and\n<b>DESTROYER DROIDS.\n</b>JAR JAR and GENERAL CEEL are held in a small group with OTHER OFFICERS.\n\nJAR JAR : Dissa bad, berry bombad.\nGENERAL CEEL : Mesa hopen dissa working for da Queen.\n\n<b>INT. THED - PALACE THRONE ROOM - DAY\n</b>\nPADME, CAPTAIN PANAKA, and SIX OTHER OFFICERS are brought by TEN BATTLE\nDROIDS before NUTE and RUNE and FOUR NEIMOIDIAN COUNCIL MEMBERS.\n\nNUTE : Your little insurrection is at an end, Your Highness. Time for you\nto sign the treaty...and end this pointless debate in the Senate.\n\nSADBE dressed like the Queen appears in the doorway with SEVERAL TROOPS.\nSeveral destroyed battle droids can be seen in the distance.\n\nSABE : I will not be signing any treaty, Viceroy, because you've lost!\n\nNUTE and THE OTHERS are stunned to see a SECOND QUEEN. NUTE yells at the\nTEN GUARDS in the room.\n\nNUTE : After her! This one is a decoy!\n\nSIX OF THE DROIDS rush out of the throne room after SABE. NUTE turns to\n<b>PADME.\n</b>\nNUTE : (Cont'd) Your Queen will not get away with this.\n\nPADME slumps down on her throne and immediately hits a security button that\nopens a panel in her desk opposite CAPTAIN PANAKA.\nPADME grabs two pistols, tosses one of the to CAPTAIN PANAKA and one to an\nOFFICER. She takes a third pistol and BLASTS the last of the BATTLE DROIDS.\nThe OFFICERS rush to the door control panel as PADME hits the switch to\nclose the door. The OFFICER at the door jams the controls. CAPTAIN PANAKA\nthrows more pistols to the OTHER GUARDS. The NEIMODIANS are confused and\nafraid.\n\nPADME : Now, Viceroy, this is the end of your occupation here.\nNUTE : Don't be absurd. There are too few of you. It won't be long before\nhundreds of destroyer droids break in to rescue us.\n\n<b>INT. THEED - POWER GENERATOR - MELTING PIT\n</b>\nOBI-WAN screams as the pulsing electron gate opens, and the SITH LORD\nattacks him. The DARK LORD is relentless in his assault on the young JEDI.\nOBI-WAN and DARTH MAUL use the Force to fling objects at each other as they\nfight. DARTH MAUL seems to have the upper hand as OBI-WAN grows weary.\nDARTH MAUL catches OBI-WAN off guard, and the JEDI slips into a melting\npit. He is barely able to hold onto a nozzle on the side of the pit. DARTH\nMAUL grin evilly at OBI-WAN as he kicks OBI-WAN's lightsaber down the\nendless shaft.\nThe SITH LORD smiles as he goes in for the kill. At the last moment,\nOBI-WAN jumps up out of the pit, calls QUI-GON's lightsaber to hi, throwing\nDARTH MAUL off. The young JEDI swings with a vengeance, cutting the SITH\ndown. DARTH MAUL falls into the melting pit to his death.\nOBI-WAN rushes over to QUI-GON, who is dying.\n\nOBI-WAN : Master! Master!\nQUI-GON : It is too late...It's...\nOBI-WAN : No!\nQUI-GON : Obi-Wan promise...promise me you'll train the boy...\nOBI-WAN : Yes, Master...\nQUI-GON : He is the chosen one...he will...bring balance...train him!\n\nQUI-GON dies. OBI-WAN cradles his Master, quietly weeping.\n\n<b>INT. NABOO STARFIGHTER - COCKPIT - FEDERATION HANGER\n</b>\nANAKIN peeks over the edge of the cockpit to see BATTLE DROIDS surrounding\nthe ship. He ducks back down.\n\nANAKIN : Uh oh. This is not good.\n\nHe looks at the dashboard to see red lights.\n\nANAKIN : (Cont'd) The systems are still overheated, Artoo.\n\nThe BATTLE DROID CAPTAIN walks up to the ship and sees ARTOO.\n\nBATTLE DROID CAPTAIN : Where's your pilot?\n\nARTOO beeps a reply.\n\nBATTLE DROID CAPTAIN : (Cont'd) You're the pilot?\n\nARTOO whistles.\n\nBATTLE DROID CAPTAIN : (Cont'd) Let me see your identification!\n\nANAKIN sees the dashboard lights go from red to green.\n\nANAKIN : Yes...we have ignition.\n\nHe flips the switch and the engine starts.\n\nBATTLE DROID CAPTAIN : (seeing Anakin) You! Come out of there or we'll\nblast you!\nANAKIN : Not if I can help it! Shields up!\n\nANAKIN flips a switch and the ship levitates, knocking over the BATTLE\nDROID CAPTAIN. The OTHER DROIDS shoot, but the lasers are deflected by\nANAKIN's shields. ARTOO beeeps.\n\nANAKIN : (Cont'd) This should stop them.\n\nANAKIN fires lasers as the ship begins to rotate.\n\nANAKIN : (Cont'd) ...and take this!\n\nHe presses a button and launches two torpedos which miss the DROIDS.\n\nANAKIN : (Cont'd) Darn...I missed!\n\nThe two torpedos fly down a hallway and explode inside the reactor room.\n\nANAKIN : (Cont'd) Let's get out of here!\n\nANAKIN's ship roars through the hanger deck, bouncing over the DROIDS.\n\nANAKIN : (Cont'd) Now, this is Podracing! Whoopee!\n\n<b>INT. FEDERATION BATTLESHIP - BRIDGE\n</b>\nTEY HOW turns to CAPTAIN DOFINE.\n\nTEY HOW : Sir, we're losing power... There is some problem with the main\nreactor...\nDOFINE : Impossible!! I don't...\n\nThe bridge explodes.\n\n<b>INT. NABOO FIGHTER - COCKPIT - SPACE\n</b>\nRIC OLIE watches in amazement as the Federation battleship starts to\nexplode from the inside out.\n\nBRAVO TWO : What's that?? It's blowing up from the inside.\nRIC OLIE : I don't know, we didn't hit it.\nBRAVO THREE : Look! One of ours! Outta the main hold!!\n\n<b>EXT. NABOO GRASS PLAINS - DAY\n</b>\nSuddenly, all of the DROIDS begin to shake upside down, run around in\ncircles, then stop. The GUNGANS carefully move out to inspect the FROZEN\nDROIDS. JAR JAR pushes one of the BATTLE DROIDS, and it falls over.\n\nJAR JAR : Wierdind...\n\n<b>EXT. THEED - CENTRAL HANGER - DAY\n</b>\nANAKIN and ARTOO follow the squad of yellow Naboo starfighters into the\nmain hanger.\n\n<b>INT. THEED - CENTRAL HANGER - DAY\n</b>\nRIC OLIE and the OTHER PILOTS gather around as thye exit their ships.\n\nBRAVO TWO : He flew into the hold, behind the deflector shield and blasted\nthe main reactor...\nBRAVO THREE : Amazing... They don't teach that in the academy.\n\nANAKIN's ship skids to a stop behind the other Naboo starfighters. RIC\nOLIE, BRAVO TWO, the OTHER PILOTS, and GROUND CREW rush to his ship.\n\nRIC OLIE : We're all accounted for. Who flew that ship?\n\nANAKIN sheepishly opens the cockpit and stands up. All the PILOTS stare in\namazement.\n\nANAKIN : I'm not going to get into trouble, am I?\n\nARTOO beeps. oh. oh.\n\n<b>INT. MAIN HANGER - COURTYARD - DAY\n</b>\nThe large, grand cruiser of the Supreme Chancellor lands in the courtyard\nof the main hanger. CAPTAIN PANAKA and TWENTY TROOPS guard NUTE GUNRAY and\nRUNE HAAKO. OBI-WAN, the QUEEN, and her HANDMAIDENS stand before the\n<b>NEIMOIDIANS.\n</b>\nPADME : Now, Viceroy, you are going to have to go back to the Senate and\nexplain all this.\nCAPT. PANAKA : I think you can kiss your Trade franchise goodbye.\n\nThe main ramp of the cruiser is lowered as OBI-WAN and CAPTAIN PANAKA lead\nthe VICEROY and HIS ASSISTANT toward the ship. The GRAND CHANCELLOR\nPALPATINE and SEVERAL REPUBLIC GUARDS descend the walkway, followed by YODA\nand SEVERAL OTHER JEDI MASTERS.\n\nThe CHANCELLOR PALPATINE is greeted by the QUEEN.\n\nAMIDALA : Congratulations on youer election, Chancellor. It is so good to\nsee you again.\nPALPATINE : It's good to be home. Your boldness has saved our people, Your\nMajesty. It is you who should be congratulated. Together we shall bring\npeace and prosperity to the Republic.\n\nOBI-WAN greets YODA and the OTHER JEDI as CAPTAIN PANAKA takes the\nNEIMODIANS onto the cruiser.\n\n<b>INT. TURRET ROOM - NABOO PALACE - LATE DAY\n</b>\nThe sun streams into the multi-windowed room at a low angle. It is not\nquite sunset. YODA paces before OBI-WAN, who is kneeling in the center of\nthe room.\n\nYODA : Confer on you, the level of Jedi Knight the Coucil does. But agree\non you taking this boy as your Padawan learner, I do not.\nOBI-WAN : Qui-Gon believed in him. I believe in Qui-Gon.\nYODA : The Chosen One the boy may be; nevertheless, grave danger I fear in\nhis training.\nOBI-WAN : Master Yoda, Igave Qui-Gon my word. I will train Anakin. Without\nthe approval of the Council if I must.\nYODA : Qui-Gon's defiance I sense in you. Need that, you do not. Agree, the\ncouncil does. Your apprentice, young Skywalker will be.\n\n<b>EXT. THEED - CENTRAL PLAZA - FUNERAL TEMPLE STEPS - SUNSET\n</b>\nQUI-GON's body goes up in flames as the JEDI COUNCIL, the QUEEN, SIO\nBIBBLE, CAPTAIN PANAKA, the HANDMAIDENS, and ABOUT ONE HUNDRED NABOO\nTROOPES, TWENTY OTHER JEDI, PALPATINE, OBI-WAN (standing with ANAKIN), JAR\nJAR, BOSS NASS, and TWENTY OTHER GUNGAN WARRIORS watch. There is a drum\nroll that stops. Doves are released, and the body is gone. ANAKIN looks to\n<b>OBI-WAN.\n</b>\nOBI-WAN : He is one with the Force, Anakin...You must let go.\nANAKIN : What will happen to me now?\nOBI-WAN : I am your Master now. You will become a Jedi, I promise.\n\nTo one side, MACE WINDU turns to YODA.\n\nMACE WINDU : There is no doubt. The mysterious warrior was a Sith.\nYODA : Always two there are....no more...no less. A maste and an\napprentice.\nMACE WINDU : But which one was destroyed, the master or the apprentice?\n\nThey give each other a concerned look.\n\n<b>EXT. THEED - CENTRAL PLAZA - DAY\n</b>\nCHILDEREN SING and throw flowers on the passing GUNGAN SOLDIERS. The CROWDS\nCHEER. It is a grand parade.\nQUEEN AMIDALA stands next to the SUPREME CHANCELLOR PALPATINE, ANAKIN,\nOBI-WAN, SIO BIBBLE, and the JEDI COUNCIL. ARTOO stands in front of the\nQUEEN'S HANDMAIDENS and whistles at the parade. QUEEN AMIDALA and PALPATINE\nsmile at one another\nIn the parade are BOSS NASS and his GUARDS, JAR JAR and GENERAL CEEL. The\nGUNGANS ride KAADU. They stop before the QUEEN and walk up the steps to\nstand by her side.BOSS NASS holds up the Globe of Peace. EVERYONE CHEERS.\nThe parade marches on.\n\n<b>IRIS OUT\n</b>\nEnd titles\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Star Wars: The Phantom Menace</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=George Lucas\" title=\"Scripts by George Lucas\">George Lucas</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Star Wars: The Phantom Menace Script.html#comments\" title=\"Star Wars: The Phantom Menace comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:17:17.886857"}