{"title": "Star Trek: The Motion Picture", "film_link": "/Movie Scripts/Star Trek: The Motion Picture Script.html", "script_link": "/scripts/Star-Trek-The-Motion-Picture.html", "info_raw": "\n\nStar Trek: The Motion Picture Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (1.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Gene Roddenberry  Harold Livingston\nGenres  Sci-Fi\nScript Date : July 1978\n\nRead \"Star Trek: The Motion Picture\" Script\n\n\n", "script": "\n\n<b><!--\n</b>\n<b>/*\n</b>Break-out-of-frames script\nBy Website Abstraction (http://wsabstract.com)\nOver 400+ free scripts here!\nAbove notice MUST stay entact for use\n<b>*/\n</b>\nif (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>Star Trek - The Motion Picture\n\n\n\n\n\t                 Star Trek: The Motion Picture\n\n\t                           Screenplay by:\n\t               GENE RODDENBERRY &  HAROLD LIVINGSTONE\n\n\t                              Story by:\n\t                ALAN DEAN FOSTER  & GENE RODDENBERRY\n\n\t      \n\t                                                     SHOOTING SCRIPT\n\n\t                                                       July 19, 1978\n\n\n\n\t      \n\n\t      FADE IN :\n\n\t  1   EXT SPACE (S)                                                1\n\n\t      An ever expanding infinity of light and color as CAMERA            \n\n    \n\t      TRAVELS THROUGH deep space, MOVING DIRECTLY for one\n\t      pinpoint of light: a STAR GROWING RAPIDLY as we SWEEP\n\t      TOWARD IT, a normal white star SUDDENLY CHANGING,\n\t      brightening, flaring unbelievable intensity: supernova.\n\t      The CAMERA HOLDS just a moment, then MOVES on, SEARCH-\n\t      ING through space, the jeweled beauty of other star\n\t      systems, sparkling nebulae, swirling hydrogen clouds.\n\t      STILL MOVING, then CAMERA FINDS:\n\n\t  2   EXT. AREA OF LUMINESCENCE (S)                                2\n\n\t      In the far distance, slowly growing in size as CAMERA\n\t      APPROACHES: it resembles, vaguely at this distance, an\n\t      Aurora Borealis: flaring colors from the fringes,\n\t      beautiful yet ominous. It is so large, this Cloud, it\n\t      can envelope an entire solar system. CAMERA CONTINUES\n\t      APPROACHING the Cloud, and then suddenly, crossing\n\t      our POV, a:\n\t         \n\t  3   KLINGON HEAVY CRUISER (S)                                    3\n\n\t      In a graceful, turning arc toward the mysterious\n\t      LUMINESCENCE. CAMERA FOLLOWS this Klingon, then FINDS\n\t      a second Klingon cruiser, also turning toward the Cloud,\n\t      which continues to grow in size as the Klingons\n\t      approach at warp speed, CAMERA CLOSING on the lead\n\t      ship, until the vessel's detail can be clearly MADE\n\t      OUT: lights, weaponry, power systems, identification\n\t      emblazoned on the nacelles and saucer in Klingon\n\t      language (and symbols).\n\n\t  4   INT. KLINGON CRUISER BRIDGE (O)                              4\n\n\t      Clearly alien, an ODD-SOUNDING KLAXON signaling\n\t      \"battle stations.\" Orders issued in KLINGON LANGUAGE,\n\t      the KLINGON CAPTAIN and EXEC peering at an unusual\n\t      bridge viewer at the huge area of LUMINESCENT HAZE\n\t      directly ahead. In KLINGON DIALOGUE:\n\n\t                              KLINGON CAPTAIN\n\t                        (Give me tactical.)\n\n\t  5   CLOSE - MAIN VIEWER (O)                                      5\n\n\t      goes suddenly  to a TACTICAL GRID SYSTEM, showing the\n\t      LUMINESCENT HAZE to be an ENORMOUS BLIP OF LIGHT ON\n\t      THE SCREEN, with two TINY PINPRICKS OF LIGHT complete-\n\t      ing their turn on a direct course toward it.\n\n\t  6   EXT. SPACE - THE KLINGON PATROL AND THE HAZE (S)             6\n\n\t      The Patrol is clearly SEEN now on the right of the \n\t      bottom of the FRAME... THREE tiny ships closing on the             \n\n   \n\t      steadily growing LUMINESCENT HAZE.\n\n\t  7   INT. THE KLINGON BRIDGE - CAPTAIN AND EXEC (O)               7\n\n\t      All eyes on the viewer that shows the ships sweeping\n\t      on the Mysterious cloud.\n\n\t                              KLINGON CAPTAIN\n\t                        (In Klingonese)\n\t                Visual.\n\n\t      The TECHNICIAN makes the switch.\n\n\t  8   CLOSE - VIEW SCREEN - LUMINESCENT HAZE (O)                   8\n\n\t      growing ever larger, its flaring colors menacing,\n\t      mysterious, strangely beckoning.\n\n\t  9   INT. BRIDGE - KLINGON COMMAND CRUISER                        9\n\n\t      The crew stands by for battle.\n\t                           \n\t                              KLINGON CAPTAIN\n\t                        (In Klingonese)\n\t                Tactical again. Stand by on\n\t                torpedoes.\n\n\t 10   EAT SPACE - LEAD KLINGON VESSEL (TORPEDO HATCH) (S)         10\n\n\t      sliding open, the glowing \"Hell Fire\" of the Photon\n\t      Launch tubes, slowly revealed.\n\n\t 11   VERY WIDE ANGLE - THE THREE SHIPS (S)                       11\n\n\t      They are tiny, insect-like shapes moving still CLOSER\n\t      to the Luminescent Cloud, so large now that it begins\n\t      to dominate all space behind.\n\n\t 12   INT. KLINGON BRIDGE - TACTICAL GRID - CAPTAIN AND           12\n\t      EXEC (O)\n\n\t      The growing nearness and enormous size of the Cloud\n\t      also reflected on the Tactical Grid, somehow more\n\t      awesome by this schematic view. The Captain gestures\n\t      the order to \"FIRE.\"\n\n\t 13   EXT. SPACE - ANGLE ON KLINGON VESSEL - TORPEDO HATCH (S)    13\n\n\t      The BRILLIANT PHOTON BLOBS of the torpedoes spurt from \n\t      the tubes.\n\n\t 14   ANGLE ON KLINGON VESSEL (S)                                 14\n\n\t      A deadly PHOTON TORPEDO pattern racing away from the\n\t      Klingon and toward the Luminescent glow in the distance.\n\n\t 15   INT. KLINGON BRIDGE - TACTICAL GRID (O)                     15\n\n\t      Three torpedoes are heading directly toward the Cloud.\n\t      Suddenly they glow briefly and disappear long before\n\t      they reach their intended target.\n\n\t 16   INT. KLINGON BRIDGE - CAPTAIN AND EXEC                      16\n\n\t      incredulous that their torpedoes have disappeared\n\t      without a trace.\n\n\t 17   EXT SPACE - THE CLOUD - THREE KLINGON SHIPS (S)             17\n\n\t      as the second and third ships launch torpedoes toward\n\t      the color-flaring surface of the cloud. This time we\n\t      have an outside, real VIEW of the torpedoes glowing\n\t      brightly and then disappearing with no effect.\n\n\t 18   INT. KLINGON BRIDGE (O)                                     18\n\n\t      The Klingon crew grim, desperate, watching a BRIGHT\n\t      STACCATO BLIP OF POWER from within the LUMINESCENCE.\n\n\t                              KLINGON CAPTAIN\n\t                        (quickly; Klingonese)\n\t                Full force fields; evasive\n\t                maneuvers.\n\n\t 19   EAT SPACE - THE CLOUD - THE KLINGON PATROLS (S)             19\n\n\t      Out of the LUMINESCENCE hurtles a FRIGHTENING WHIPLASH\n\t      OF ENERGY. It bears down on the Klingon Patrol, now\n\t      in an evasive maneuver. Then the WHIPLASH BOLT hits\n\t      the third cruiser in a writhing flare of energy which\n\t      totally engulfs the vessel.\n\n\t      The other two ships veer off, warping around again into\n\t      attack position. The THIRD SHIP has begun to implode\n\t      in on itself, the matter-energy of its existence\n\t      drained by the WHIPLASH BOLT that HOLDS IT.\n\n\t 20   ANGLE ON REMAINING KLINGON CRUISERS (S)                     20\n\n\t      desperately defending themselves, FORCE FIELDS FULL UP,\n\t      RAPIDLY FIRING PHOTON TORPEDOES. But now a SECOND\n\t      WHIPLASH ENERGY BOLT has emerged from the cloud and\n\t      hits the second vessel, DESTROYING it.\n\n\t      The THIRD WHIPLASH BOLT glances off the surviving\n\t      Cruiser as the ship retreats in a wide, evasive turn,\n\t      FIRING from stern tubes.\n\n\t 21   INT. KLINGON BRIDGE                                         21\n\n\t      The bridge shattered; Klingon bodies. The mortally-\n\t      wounded Captain is transmitting urgently:\n\n\t                              KLINGON CAPTAIN\n\t                        (In Klingonese)\n\t                ... severely damaged. Returning\n\t                fire...\n\n\t 22   EXT. SPACE - STARFLEET MONITOR STATION EPSILON 9 (S)        22\n\n\t      Serenity here. A barren, rocky small plantoid softly\n\t      lit by the myriad stars. This is a small Starfleet \n\t      outpost, antennae sprouting everywhere. Tiny figures\n\t      (WORKERS) servicing one antenna illustrate the size\n\t      of the installation.\n\n\t 23   INT. EPSILON 9 - MONITOR ROOM - A VIEWER (O)                23\n\n\t      SHOWING the battle scene, and the VOICE OF THE KLINGON\n\t      CAPTAIN in his last stand against the Object; his VOICE\n\t      is weary, almost mechanical. On the adjacent viewer,\n\t      an English printout of the Klingon's words chatters\n\t      along the bottom of the picture:\n\n\t                              KLINGON CAPTAIN\n\t                        (In Klingonese)\n\t                Imperial Klingon Cruiser Amar...\n\t                severely damaged by unfamiliar\n\t                weaponry... intruder unidentified..\n\n\t 24   WIDER ANGLE - EPSILON 9 STARFLEET PERSONNEL AND VIEWER (O)  24\n\n\t      At the viewers are a FEMALE LIEUTENANT and FOUR TECH-\n\t      NICIANS. COMMANDER BRANCH, a young, alert, enters hur-\n\t      riedly, scans he console.\n\n\t                              LIEUTENANT\n\t                Our sensor drone is intercepting\n\t                this on Quad L-14.\n\n\t                              KLINGON CAPTAIN (V.O.)\n\t                ... believe luminescent cloud \n\t                to be enormous power field \n\t                surrounding alien vessel... \n\t                size and description unknown.. \n\t                our sensor scans unable to \n\t                penetrate. Imperial Klingon \n\t                Cruiser Amar... continuing \n\t                to attack.\n\n\t                              BRANCH\n\t                That's within Klingon boundaries.\n\t                Who are they fighting?\n\n\t                              LIEUTENANT\n\t                Unknown, sir.\n\n\t      A violent EXPLOSION inside the Klingon bridge -- Klingon\n\t      Captain's body is thrown violently against the bulkhead.\n\n\t                              TECHNICIAN\n\t                I have an exterior visual!\n\n\t 25   CLOSE ON VIEWER (O)                                         25\n\n\t      showing EXTERIOR of the Klingon vessel: a final,\n\t      frightening WHIPLASH ENERGY BOLT strikes it -- then\n\t      the same awesome IMPLOSION INTO FIREBALL.\n\n\t 26   WIDER ANGLE - PERSONNEL AND VIEWER (O)                      26\n\n\t      The Starfleet station onlookers react to the utter\n\t      annihilation of the huge cruiser. And now, past where\n\t      the cruiser just disappeared -- the mysterious LUMINES-\n\t      CENCE approaching in distance. Technician hits a\n\t      switch, magnifying the strange CLOUD.\n\n\t                              LIEUTENANT\n\t                We've plotted a course on that\n\t                cloud, Commander: it will pass\n\t                into Federation Space fairly \n\t                close to us.\n\n\t                              BRANCH\n\t                Heading?\n\n\t 27   CLOSE ON THE MAIN MONITOR STATION (O)                       27\n\n\t      as its focal point shifts to the huge elliptically-\n\t      shaped LUMINESCENCE racing across the sky. MUSIC\n\t      (V'GER THEME) COMMENCES in a low, unresolved CHORD\n\t      that remains in the background through the remainder\n\t      of this scene, and the beginning of the next one.\n\n\t                              LIEUTENANT'S VOICE\n\t                Sir, it's on a precise heading\n\t                for Earth.\n\n\t      Ominously now the LUMINESCENCE increases in size, and\n\t      begins to fill the viewer. HOLD A MOMENT, and then:\n\n\t 28   EXT. SURFACE OF PLANET VULCAN - DAY (M)                     28\n\n\t      with the CAMERA MOVING THROUGH masses of thick, steamy\n\t      vaporous clouds, swirling about, rising boilingly up\n\t      from some unseen, underground source. The CAMERA\n\t      CONTINUES MOVING through clouds.\n\n\t      And then... the Vulcan landscape. Harsh, strange\n\t      angular peaks and rock formations -- the barren, legend-\n\t      ary mountain home of Vulcan Masters.\n\n\t 29   EXT. VULCAN LEDGE - SPOCK ( M & F.P.)                       29\n\n\t      Spock's lean features instantly recognizable despite\n\t      unkempt, longer hair and the fatigue born of a long,\n\t      harsh discipline he has undergone. His robes, tattered\n\t      and dust covered, are that of a Vulcan Aspirant in\n\t      study with the Masters. Under the V'ger THEME MUSIC\n\t      we HEAR a VOICE in ritual tones:\n\n\t                              FEMALE MASTER'S VOICE\n\t                Spock, son of Sarek of Vulcan... \n\t                and of Amanda of Earth... \n\t                diligently you have labored for \n\t                purification of mind...\n\n\t 30   REVERSE ANGLE - SPOCK, VULCAN MASTERS AND RUINS             30\n\n\t      In b.g., gigantic ancient Vulcan statues and ruins. In f.g., \n\t      the stone platform on which Spock stands facing a semi-circle \n\t      of three similar platforms. On them in regal robes are three \n\t      VULCAN MASTERS. The Master in the center is a female, the \n\t      other two Masters are male. The elderly female is holding a \n\t      cord and ancient pendant as if ready to place it around            \n\n    \n\t      Spock's neck at an appropriate moment. Spock is staring up \n\t      as V'ger THEME MUSIC fades.\n\n\t                              MALE MASTER\n\t                        (chidingly)\n\t                Spock . . . !\n\n\t      Spock turns, giving a small contrite nod -- the ritual\n\t      continues.\n\n\t                              FEMALE MASTER\n\t                Here are these sands, our fore-\n\t                bearers cast out their animal \n\t                passions. Here our race was \n\t                saved by the first attainment of \n\t                Kolinahr.\n\t             \n\t                              MALE MASTER\n\t                Kolinahr: the final shedding of \n\t                all emotion.\n\n\t                              FEMALE MASTER\n\t                You have labored long, Spock.\n\t                Now receive from us this symbol\n\t                of total logic.\n\n\t      Spock starts to kneel... the Female Master moves in,\n\t      intending to put the ancient pendant around his neck. \n\t      But Spock now hesitates -- he's troubled as though \n\t      uncertain he deserves this symbol and waves the \n\t      pendant away. Then, a faint reprise of the V'ger THEME \n\t      MUSIC now causes the Female Master to look skyward. \n\t      She turns from this back to Spock as she exchanges a \n\t      look with the Male Masters.               \n\n\t                              FEMALE MASTER\n\t                        (gestures Spock forward)\n\t                Come, give me your thoughts.\n\n\t      She kneels with Spock -- lays her hands on his temples \n\t      in Vulcan mind-meld position.\n\n\t                              FEMALE MASTER\n\t                        (continuing)\n\t                Our minds, Spock... One and\n\t                together....\n\n\t      Their eyes close -- their minds meld -- then her head\n\t      jerks slightly, her features change as her mind feels\n\t      Spock's reactions to the V'ger consciousness. A long\n\t      moment, then she opens her eyes, gets to her feet and\n\t      looks down on the still kneeling Spock. Then, she\n\t      casts aside the pendant she carries -- it falls into\n\t      the dust.\n\n\t                              FEMALE MASTER\n\t                        (continuing; sadly)\n\t                This consciousness which calls --\n\t                it stirs your human half, Spock?\n\t                You have not achieved Kolinahr --\n\t                Your human emotions are not fully\n\t                extinguished.\n\t                       (turns to the other Masters)\n\t                He will not achieve his goal with\n\t                us. His answer lies elsewhere.\n\n\t      The three Masters leave -- Spock watches them go, his\n\t      disappointment evident even in his stoic features.\n\n\t 31   MED. ANGLE ON SPOCK (M. & F.P.)                             31\n\n\t      CAMERA CLOSES IN on his face as we again HEAR a frag-\n\t      ment of V'ger THEME MUSIC -- Spock again raises his\n\t      head and peers up into the heavens. HOLD on his face\n\t      a moment, then...\n\n\t       SHOCK CUT TO :\n\n\t 32   EXT. EARTH - AN AIR TRAM - DAY (S)                          32\n\n\t      gleaming silver in the sun as it streaks TOWARD THE\n\t      CAMERA POSITION and hurtles PAST.\n\n\t 33   EXT. SAN FRANCISCO - HILLTOP AIR TRAM STATION -             33\n\t      DAY (M)\n\n\t      From this vantage, we can SEE all of twenty-third\n\t      century San Francisco stretched out before us. In\n\t      the b.g., the familiar forms of the carefully preserved\n\t      Golden Gate Bridge and Transamerica Pyramid Building\n\t      serve as our only reminders that this is, indeed, San\n\t      Francisco.\n\n\t      The AIR TRAM (an anti-gravitational train flying\n\t      several feet above the ground) DECELERATES sharply,\n\t      settles to the ground with a whisper.\n\n\t 34   EXT. TRAM STATION - CLOSE ON TRAM DOORS - DAY               34\n\n\t      The doors opening, and various TRAVELERS (civilians\n\t      and Starfleet personnel) leaving the tram, striding\n\t      onto the platform, continuing on their respective\n\t      ways. Among the departing throng:\n\n\t 35   KIRK                                                        35\n\n\t      in Admiral's uniform, grim, determined, moving through\n\t      the throng. Now and then Starfleet officers nod re-\n\t      spectfully; KIRK responds with detached formality; his\n\t      mind is clearly set on something he is resolved to ac-\n\t      complish here in headquarters -- whatever the cost.\n\t      CAMERA WITH HIM, to:\n\n\t 36   INT. AIR TRAM STATION - DAY         `                       36\n\n\t      as Kirk strides into the graceful Starfleet HQ building.\n\t      Many PEOPLE are about, civilians and uniformed person-\n\t      nel; most of them with some air of urgency. (NOTE:\n\t      ALIENS interspersed among them, Vulcans, blue-skinned\n\t      Andorians, high-domed Vegans, ect.) Kirk continues on\n\t      when suddenly he reacts, annoyed as he sees:\n\n\t 37   SONAK                                                       37\n\n\t      a Vulcan, Lt Commander; short, white-haired, grizzled,\n\t      hurrying along. Kirk calls to him:\n\n\t                              KIRK\n\t                Commander Sonak... !\n\n\t      SONAK turns with Vulcan imperturbability to face Kirk\n\t      who steps toward him\n\n\t                              KIRK\n\t                        (continuing)\n\t                You've received your appointment\n\t                as Enterprise Science Officer?\n\n\t                              SONAK\n\t                        (nods)\n\t                Based, I am told, on your\n\t                recommendation, Admiral. Thank                           \n\t                you.\n\n\t                              KIRK\n\t                Why aren't you on board?\n\n\t                              SONAK\n\t                Captain Decker requested I complete\n\t                final Science briefing here before...\n\n\t                              KIRK\n\t                        (interrupting)\n\t                Here at Starfleet...? The\n\t                Enterprise is in final preparation\n\t                to leave dock...\n\n\t                              SONAK\n\t                Which will require twenty more\n\t                hours at minimum, Admiral...\n\n\t                              KIRK\n\t                Twelve! I'm on my way to a meeting\n\t                with Admiral Nogura which will not \n\t                last more than three minutes.\n\t                Report to me on the Enterprise in\n\t                one hour.\n\n\t                              SONAK\n\t                To you, sir?\n\n\t                              KIRK\n\t                I intend to be there following \n\t                that meeting. Report to me. One \n\t                hour!\n\n\t      And Kirk turns, strides purposefully away. Sonak gazes\n\t      after him, one eyebrow raised quizzically.\n\n\t 38   EXT. EARTH ORBIT (S)                                        38\n\n\t      In f.g., Orbital drydock offices, rotating slowly but\n\t      perceptibly against blue-black of space. Small figures\n\t      in spacesuits working on construction, with work belts.\n\t      Beyond and below... Earth. In the far distance we can\n\t      barely make out an orbital drydock.\n\n\t 39   CLOSER ANGLE - ORBITAL OFFICE CLUSTER (S)                   39\n\n\t      The cluster is a fully-equipped dockyard engineering\n\t      center and computer drafting office.\n\n\t      CAMERA MOVES IN AND CENTERS ON an outer \"Travel Pod.\"\n\n\t 40   INT. INNER OFFICE (O)                                       40\n\n\t      an installation which also includes a double position\n\t      transporter, in which we SEE the TRANSPORTER EFFECT\n\t      BEGIN. With the TRANSPORTER CREW IS SCOTT. He's with\n\t      a Technician, busy with a piece of complex circuitry.\n\t      Then he turns, sees that it is Kirk BEAMING in here.\n\t      As Kirk materializes, steps off the transporter plat-\n\t      form, Scott moves quickly to him.\n\n\t40A   KIRK AND SCOTT                                             40A\n\n\t      The starship Engineering Officer clearly surprised to\n\t      see Kirk here. Kirk has the same look of grim de-\n\t      termination we just saw in the headquarters building.\n\t                    \n\t                              SCOTT\n\t                Admiral, I've been hoping to see\n\t                you. Maybe you can get through \n\t                to those thick heads in Starfleet\n\t                that...\n\n\t                              KIRK\n\t                Why aren't the Enterprise\n\t                transporters in operation, Mister\n\t                Scott?\n\n\t                              SCOTT\n\t                We're hoping it's only a temporary\n\t                problem, Admiral...\n\n\t                              KIRK\n\t                See that it is.\n\t                        (moving toward pod)\n\t                Take me over, please.\n\n\t      Scott is now eying Kirk just a little warily as he fol-\n\t      lows him into the pod. Kirk's determined expression\n\t      suggests that some chips are going to fly and Scott\n\t      does not want to become one of them.\n\n\t                              SCOTT\n\t                        (carefully)\n\t                Admiral, the Enterprise has just\n\t                finished eighteen months redesign-\n\t                ing and refitting. She needs \n\t                testing, a shakedown...\n\n\t                              KIRK\n\t                Mr. Scott, there's an alien object\n\t                with unbelievable destructive \n\t                power less than three days away \n\t                from this planet...\n\n\t      Kirk hits a button on the travel pod panel -- the air-\n\t      lock doors SLAM closed behind them. Then, stepping im-\n\t      mediately to the front observation window:\n\n\t                              KIRK\n\t                        (continuing)\n\t                ... the only Starship in\n\t                interception range is the\n\t                Enterprise! Ready, or not, she\n\t                launches in twelve hours!\n\n\t      Scott throws Kirk an appalled look but is now occupied\n\t      in sealing the Outer Pod door and manipulating drive\n\t      controls.\n\n\t      CAMERA CONTINUES TO PULL BACK TO REVEAL front of the\n\t      Pod and arms of the office complex as Pod disconnects\n\t      and starts to move.\n\n\t40C   EXT. POD                                                   40C\n\n\t      CAMERA CONTINUES TO PULL BACK TO REVEAL front of the\n\t      pod and arms of the office complex as Pod disconnects\n\t      and starts moving.\n\n\t 41   EXT. EARTH ORBIT - ANGLES ON TRAVEL POD (S)                 41\n\t  -                                                                -\n\t 43                                                               43\n\t      \n\t       as it moves way from the office complex. We can\n\t      SEE the jet flames of its tiny thrusters as it cir-\n\t      cles around, heads off (toward the distant Orbital\n\t      dry dock).\n\n\t 44   INT. TRAVEL POD - KIRK AND SCOTT                            44\n\n\t      Scott nervously eying Kirk, and finally deciding to\n\t      make one more effort:\n\n\t                              SCOTT\n\t                The crew hasn't had near enough\n\t                transition time with all the new\n\t                equipment. And the engines,\n\t                Admiral: they've yet to be even\n\t                tested at warp power. Add to \n\t                that, an untried Captain...\n\n\t                              KIRK\n\t                        (hint of smile)\n\t                Two and a half years as Chief of\n\t                Starfleet Operations may have\n\t                made me a little stale, Mr. Scott\n\t                -- but I wouldn't exactly consider\n\t                myself 'untried.'\n\n\t      It takes Scott a moment to comprehend, and Kirk smiles\n\t      now, nods:\n\n\t                              KIRK\n\t                        (continuing)\n\t                They gave her back to me, Scotty.\n\n\t      Scott peers at him, genuinely surprised -- and pleased.\n\t      Then:\n\n\t                              SCOTT\n\t                \"Gave' her back, sir...? I doubt\n\t                it was that easy...\n\t                        (returns smile)\n\t                But any man who could manage such\n\t                a feat, I wouldna dare disappoint.\n\t                She'll launch on time, sir...\n\t                        (with confidence)\n\t                And she'll be ready.\n\n\t      And he clasps Kirk's elbow affectionately, then gestures\n\t      Kirk to look out the pod window.\n\n\t 45   EXT. OUTSIDE THE POD WINDOW - KIRK'S POV (O)                45\n\n\t      as he looks out: the blue-black of orbital space.\n\n\t 46   INT. TRAVEL POD                                             46\n\n\t      Scott is well aware of what the Enterprise means to\n\t      Kirk. As Scott maneuvers the pod to provide the best\n\t      perspective, Kirk peers through the observation window,\n\t      craning his head, hungry for his first glimpse of the\n\t      starship. Scott is watching him, immensely pleased.\n\n\t 47   PAST THEM TO THE POD WINDOW (O)                             47\n\n\t      as we SEE the drydock and more of its detail, and a\n\t      hint of what is inside.\n\n\t 48   EXT. EARTH ORBIT - OTHER ANGLES FROM THE POD (O)            48\n\t  -                                                                -     \n\n \n\t 50                                                               50\n\t                                                                 \n\t      PAST Kirk and Scott the corner of the drydock becomes\n\t      larger -- we begin SEEING more of it. And then the\n\t      merest glimpse of what is inside the drydock: The\n\t      Enterprise slips INTO VIEW.\n\n\t 51   INT. POD - VERY CLOSE ON KIRK AT WINDOW                     51\n\n\t      as he watches, his face reflecting all of it: the awe,\n\t      the wonder, the romance, the obsession. The one comp-\n\t      lete love of his life. And with that love regained,\n\t      he is becoming more fully alive again.\n\n\t      Kirk looks at Scott; for a moment both hold each other's\n\t      eye. Scott knows precisely how Kirk feels. Both turn\n\t      to the window again.\n\n\t 52   WHAT THEY SEE - THE ENTERPRISE (S)                          52\n\n\t      Now DOMINATING the SCREEN -- the awesome, symmetrical\n\t      bulk of the starship comes fully INTO VIEW. And it\n\t      dominates Kirk's -- and our emotions.\n\n\t 53   EXT. THE ENTERPRISE - AND THE POD (TINY IN THIS SHOT)       53\n\t  -                                                                -\n\t 56   AS IT CIRCLES - THE ANTI-LIKE FIGURES OF WORKERS (S)        56\n\n\t      The great ship dwarfs everything. The drydock becomes\n\t      a fragile filigree framing the ship's great curved\n\t      bulk. The tiny pod continues to move along it.\n\n\t      Small automated welding devices move along the gird-\n\t      ers, working with brief, bright orange-white flares.\n\t      In other areas of metal lace structure, supplies and\n\t      equipment are being loaded onto the ship. The pod\n\t      continues moving (Scott is giving Kirk time to see all),\n\t      watched carefully by the TINY FIGURES OF SUPERVISING\n\t      TECHNICIANS on the drydock. Now the pod moves toward\n\t      mating position. It closes in, secures itself to the\n\t      outer airlock.\n\n\t 57   INT. POD - AT THE AIRLOCK                                   57\n\n\t      Scott completing the mating procedure, Kirk turning\n\t      from the observation window. Outside, the metallic..\n\t      CLICK of the pod locking onto the airlock. Now the\n\t      \"WHOOSH\" of the latch doors securing, the CLANG of\n\t      security bolts. It's all been a rare and delicious\n\t      moment for Kirk, and his face shows it.\n\n\t      OVER the POD INTERCOM we HEAR, \"Pod secured. Pressure\n\t      equalized.\" Scott moves the control to open the hatch.\n\n\t 58   INT. ENTERPRISE CARGO DECK (M)                              58\n\n\t      A confusion of organized work and VOICES. The cargo\n\t      deck bustles with activity; supplies and equipment\n\t      being stored and installed.\n\n\t 59   INT. CARGO DECK - BALCONY AND CATWALK                       59\n\n\t      Kirk and Scott are met by a nervous, perspiring\n\t      ENSIGN.\n\n\t                              KIRK AND SCOTT\n\t                Permission to come aboard, sir...?\n\n\t                              ENSIGN\n\t                Granted, sir. Welcome aboard,\n\t                Admiral... Commander Scott,\n\t                you're needed in Engineering\n\t                immediately.\n\n\t                              SCOTT\n\t                        (to Kirk)\n\t                Sir, you'll excuse me...?\n\n\t      Kirk gestures him to leave, and Scott hurries away.\n\t      Kirk stands a moment, gazing down at the cargo deck.\n\n\t 60   ANGLE DOWN PAST KIRK TO FLOOR (M)                           60\n\n\t      The crew maneuvering antigravity devices which move\n\t      heavy containers -- scrambles of activity at storage\n\t      holds and maintenance lockers.\n\n\t 61   CLOSE ON KIRK AND ENSIGN                                    61\n\n\t      Kirk is drinking it all in. He's home.\n\n\t                              ENSIGN\n\t                        (nervous)\n\t                Sir, if you'll follow me, I'll...\n\n\t                              KIRK\n\t                I think I can find my way,\n\t                Ensign.\n\n\t      And Kirk moves off, leaving the Ensign gazing at him,\n\t      relieved.\n\n\t 62   EXT. ELEVATOR AND CATWALK                                   62\n\n\t      Kirk ENTERS ANGLE and the doors snap open.\n\n\t 63   INT. ELEVATOR                                               63\n\n\t      as Kirk enters. The doors close. Kirk waits a beat,\n\t      savoring this moment too. Then, firmly to the control\n\t      panel:\n\n\t                              KIRK\n\t                Bridge!\n\n\t      The turbo-elevator HUMS WITH POWER as it begins hur-\n\t      tling up. On the wall back of Kirk we SEE an electronic\n\t      diagram of the Enterprise tracking the elevator's \n\t      speedy trip to the Bridge.\n\n\t 64   INT. BRIDGE                                                 64\n\n\t      A confusion of activity and VOICES. Pieces o equip-\n\t      ment in a state of disarray: consoles open, fiber\n\t      optic tubes unconnected, viewing screens dismantled.\n\t      It's a frantic, desperate scene -- a ship and crew to-\n\t      tally unprepared. In the midst of this: ALIEN\n\t      ensign is assisting UHURA (Lt. Comdr. stripes)deftly\n\t      working her communications station, AD LIBBING\n\t      \"... Hailing frequency four, check. Hailing frequency\n\t      five, will someone please check me?\" At the helm,\n\t      sweat-soaked SULU (Lt. Comdr stripes) has a service\n\t      plate open, is peering inside to make delicate adjust-\n\t      ments, AD LIBBING \"... Helm, now give me a reading on\n\t      four point zero zero six of full.\" And at the Weapons\n\t      Control, CHEKOV (Full Lt.)argues with TECHNICIANS who\n\t      insist photon torpedoes read \"ready\" while Chekov\n\t      argues the computer is not relaying that information.\n\n\t 65   ANGLE ON THE ELEVATOR DOORS                                 65\n\n\t      snapping open -- and there is Kirk. For the moment no\n\t      one notices him, and he stands watching, remembering.\n\t      And then he moves forward toward the command center.\n\n\t 66   ACROSS UHURA TO KIRK                                        66\n\n\t      as she is the first to see him. She reacts,pleased.\n\n\t                              UHURA\n\t                Captain... Starfleet just \n\t                signaled your transfer-of-\n\t                command orders!\n\n\t 67   ANOTHER ANGLE - VARIOUS REACTION                            67\n\n\t      as everyone else is suddenly aware of Kirk.\n\n\t      All work stops, with various AD LIBBED greetings from\n\t      the old crew: \"Admiral Kirk...\" \"It's the Captain...!\"\n\t      etc., etc. But most sit or stand, simple gaping at\n\t      Kirk, all quite awed. The old hands, Uhura, Sulu, and\n\t      Chekov start converging on Kirk. But he gestures them\n\t      back, speaking crisply.\n\t                 \n\t                              KIRK\n\t                I appreciate the welcome; I wish\n\t                the circumstances were less\n\t                critical.\n\t                        (to Uhura)\n\t                Epsilon Nine is monitoring the\n\t                intruder; keep a channel open to\n\t                them.\n\t                        (glances around)\n\t                Where is Captain Decker?\n\n\t                              SULU\n\t                He's in Engineering, sir...\n\t                        (uncomfortable,\n\t                         indicates Captain's \n\t                         chair)\n\t                He doesn't know.\n\n\t      Kirk reacts with some exasperation, starts away,\n\t      addresses Chekov:\n\n\t                              KIRK\n\t                Mr Chekov, assemble the crew on\n\t                the Rec Deck at 0400 hours. I\n\t                want to show them what we're \n\t                facing.\n\n\t      And Kirk moves to the elevator, enters, is gone. The\n\t      moment the elevator doors snap closed:\n\n\t                              SULU\n\t                I wouldn't have wanted to have\n\t                been standing in his way. He\n\t                wanted her back; he got her!\n\n\t                              ALIEN ENSIGN\n\t                        (perturbed)\n\t                And Captain Decker? He's been\n\t                with the ship every minute of\n\t                her refitting...\n\n\t                              UHURA\n\t                        (brittle)\n\t                Ensign -- our chances of coming\n\t                back from this mission in one\n\t                piece may have just doubled...!\n\n\t 68   OMITTED                                                     68\n\t   -                                                               -\n\t 69                                                               69   \n     \n\t 70   INT. ENGINEERING SECTION                                    70\n\n\t      The entire complex a beehive of pre-departure activity.\n\t      ENGINEERING PERSONNEL (at least a third of them female)\n\t      coming and going, the platform-elevators (small, one-\n\t      man lifts to various levels) busy. A gentle but con-\n\t      stant HUM and WHIRR flows from the engine core, to indi-\n\t      cate a pre-idling mode. There will be continual AD\n\t      LIBBED conversation among the Technicians.\n\n\t      Now the Engine Room door opens and Kirk steps into the \n\t      area. He stands a moment observing the activity. a\n\t      grizzled ENGINEERING CHIEF pushes a huge condenser on\n\t      an anti-grav device past irk with a respectful \"watch\n\t      it, sir\" admonishment. Kirk moves on to:\n\n\t 71   THE INTERMIX CHAMBER                                        71\n\n\t      at the middle of the power shaft. Very NOISY here,\n\t      and a continual CACOPHONY of COMPUTERIZED AND HUMAN\n\t      VOICES calling off equipment checks. And grouped \n\t      around a section of burnt-out circuitry are WILLARD\n\t      DECKER, Captain's stripes, handsome, in his early\n\t      30's; Scott, and two Technicians. Decker and Scott\n\t      are working feverishly uncoupling the device, \n\t      probing its innards. Decker has discovered the problem,\n\t      removed several transistor-type parts, taps them \n\t      with a pencil-sized sonic analyzer.\n\n\t                              DECKER\n\t                        (quietly elated)\n\t                I thought so! See... the trans-\n\t                porter sensor was not activated...\n\n\t                              SCOTT\n\t                        (impressed)\n\t                Aye, you were dead right about\n\t                that...\n\t                        (to Technician)\n\t                Clearly, put a back-up sensor into\n\t                the unit.\n\n\t 72   ACROSS THEM TO KIRK                                         72\n\n\t      as the Technician prepares to install the device,\n\t      Scott glances up to see Kirk.\n\n\t      He looks from Decker to Kirk in acute embarrassment\n\t      (so that we should realize Scott hasn't mentioned\n\t      Kirk's taking over to Decker). Decker now notices\n\t      Kirk, reacts pleased.\n\n\t                              DECKER\n\t                Admiral Kirk...\n\t                        (shakes Kirk's hand)\n\t                We're getting a top brass send\n\t                off...?\n\t                        (self assured grin)\n\t                She'll launch on schedule if we\n\t                have to tow her out with our bare\n\t                hands. Right, Scotty?\n\n\t                              SCOTTY\n\t                        (lamely)\n\t                Aye, sir, that we will...\n\n\t                              KIRK\n\t                        (to Decker)\n\t                Will, let's go over here and\n\t                talk.\n\n\t      He indicates corner. Decker glances bemusedly at\n\t      Kirk, then turns to Scott:\n\n\t                              DECKER\n\t                Let me now when the back-up is \n\t                in place.\n\n\t 73   ACROSS SCOTT TO KIRK AND DECKER                             73\n\n\t      as Scott AD LIBS a glum \"Aye, sir,\" and watches them\n\t      walk across the Chamber.\n\n\t 74   A CORNER OF THE INTERMIX CHAMBER                            74\n\n\t      just a little quieter here, with Kirk and Decker arriv-\n\t      ing, and Decker saying blithely:\n\n\t                              DECKER\n\t                All due respect, sir, I hope\n\t                this isn't a Starfleet pep talk;\n\t                I'm just too busy.\n\n\t      Kirk eyes Decker -- then decides the best way to say\n\t      it is plainly, directly.\n\n\t                              KIRK\n\t                I'm taking over the Center seat. \n\t                I'm sorry, Will.\n\n\t                              DECKER\n\t                You are what...?\n\n\t                              KIRK\n\t                I'm replacing you as Captain of\n\t                the Enterprise.\n\n\t      Decker seems shocked into silence; he can only peer\n\t      at Kirk who reaches tentatively as though to clasp a\n\t      paternal hand on Decker's shoulder, then withdraws it\n\t      and continues quickly.\n\n\t                              KIRK\n\t                        (continuing)\n\t                You'll stay aboard as Executive\n\t                Officer... a temporary grade\n\t                reduction to Commander.\n\n\t                              DECKER\n\t                       (finding his voice)\n\t                -- You, personally, are assuming\n\t                command?\n\n\t                              KIRK\n\t                Yes.\n\n\t                              DECKER\n\t                May I ask Why?\n\n\t                              KIRK\n\t                        (nods)\n\t                My experience -- five years out\n\t                there dealing with unknowns like\n\t                this -- my familiarity with the\n\t                Enterprise, this crew...\n\n\t                              DECKER\n\t                Admiral, this is an almost totally\n\t                new enterprise. You don't know\n\t                her a tenth as well as I do.\n\n\t 75   ANOTHER ANGLE - TO SHOW SCOTT IN B.G. (ACROSS THE           75\n\t      ROOM)\n\n\t      Scott, working on the relay, but continually glancing\n\t      at Kirk and Decker with worried concern, as Kirk\n\t      replies:\n\n\t                              KIRK\n\t                That's why you're staying aboard.\n\t                I'm sorry, Will.\n\n\t                              DECKER\n\t                No, Admiral. I don't think you are;\n\t                not one damned bit. I remember\n\t                when you recommended me for this\n\t                command. You told me how envious\n\t                you were, and if only you could\n\t                find a way to get a starship\n\t                command again. Well, sir, it looks\n\t                like you found a way.\n\n\t      Kirk is silent a moment, peering levelly at Decker,\n\t      who returns the gaze with equal intensity. Then:\n\n\t                              KIRK\n\t                Report to the bridge, Commander.\n\t                Immediately.\n\n\t      Decker EXITS. Kirk waits, collecting his composure\n\t      as he watches him go. Then Kirk turns to glare at\n\t      Scott. Interrupted by a flare as something shorts\n\t      out at the mechanism where Scott and Decker had been\n\t      working. Technician (Clearly) reacts, hits an inter-\n\t      com button fast:\n\n\t                              TECHNICIAN (CLEARY)\n\t                Transporter room, come in!\n\t                Urgent!\n\t                        (to Scott)\n\t                Redline on the transporters,\n\t                Mister Scott!\n\n\t      Scott whirls to a console fast, speaks urgently!\n\n\t                              SCOTT\n\t                Transporter room, do not engage!\n\t                Do not....\n\n\t                              TECHNICIAN (CLEARY)\n\t                        (reacting to the reading;\n\t                         interruption)\n\t                Too late; they're beaming now!\n\n\t      Kirk is exiting on a run, followed by Scott.\n\n\t 76   INT. TRANSPORTER ROOM - INCLUDING TRANSPORTER CHAMBER       76\n\t      (O)\n\n\t      An unusually defective looking TRANSPORTER EFFECT in\n\t      progress, alternately flashing and glowing -- even the\n\t      Transporter SOUND seems wrong, as if struggling to\n\t      overcome some problem. At the console, CHIEF RAND and\n\t      ASSISTANT are reacting in surprised, near-horror as\n\t      they attempt vainly to save the situation.\n\n\t                              RAND\n\t                        (into intercom)\n\t                Starfleet, override us!\n\t                OVERRIDE...! Yank them back!\n\n\t      Suddenly, from Rand's console,a VIOLENT GLARE -- a\n\t      PROTESTING SOUND from the circuitry. And on the con-\n\t      sole a red-warning light now begins flashing.\n\n\t                              STARFLEET VOICE\n\t                Unable to retrieve their pattern,\n\t                Enterprise....!\n\n\t      Rand reacts in real horror now as human forms begin to\n\t      FAINTLY MATERIALIZE, then FADE AWAY, then REAPPEAR IN\n\t      FAINTLY MISSHAPEN FORM as she frantically works con-\n\t      trols. Kirk ENTERS fast, steps to the console to\n\t      assist Rand; Scott has also come in and moves to the\n\t      console, brushes aside the Asst. Chief, and begins\n\t      manipulating the additional controls himself.\n\n\t                              SCOTT\n\t                We're losing the pattern...!\n\n\t                              KIRK\n\t                        (into intercom)\n\t                Starfleet, boost your matter gain; \n\t                we need more signal!\n\n\t                              RAND\n\t                Oh, no! They're forming!\n\n\t 77   CLOSER ON THE TRANSPORTER CHAMBER (O)                       77\n\n\t      with the human forms FLUTTERING INTO FULLER AND FULLER\n\t      MATERIALIZATION, FRIGHTENINGLY, HORRIBLY MISSHAPEN. We\n\t      RECOGNIZE one form as the Vulcan, Sonak -- the other a\n\t      human WOMAN. They MATERIALIZE; we HEAR A MOAN form \n\t      from the Vulcan -- the Woman's SCREAM OF PAIN. Then,\n\t      all at once, the half-materialized bodies are gone;\n\t      the transporter chamber is empty.\n\n\t                              KIRK\n\t                Oh, my God...!\n\n\t 78   KIRK, SCOTT AND RAND                                        78\n\n\t      gazing, horrified, at the empty chamber.\n\n\t                              KIRK\n\t                        (into intercom)\n\t                Starfleet, do you have them?\n\n\t      A mutter of utter, vacant silence -- and Kirk and\n\t      Scott look at each other again, their pained faces\n\t      presaging the answer they already know:\n\n\t                              STARFLEET VOICE\n\t                        (shaken)\n\t                Enterprise... what we got back\n\t                didn't live long. Fortunately.\n\n\t      Another moment of stunned silence, and then Kirk hits\n\t      the transmission button -- fighting to control his\n\t      voice as:\n\n\t                              KIRK\n\t                Starfleet... Kirk. Please...\n\t                express my condolences to their\n\t                families. Commander Sonak's\n\t                can be reached through the Vulcan\n\t                Embassy.\n\t                        (see Rand's stricken\n\t                         expression)\n\t                There was nothing you could have\n\t                done, Rand. It wasn't your fault.\n\n\t      And before Rand can answer, Kirk leaves the room.\n\n\t 79   INT. CORRIDOR - TRAVELING WITH KIRK                         79\n\n\t      as Kirk steps out, and the doors snap closed behind\n\t      him. In the corridor the furor of the hurried depar-\n\t      ture is, as everywhere, quite evident: CREW MEMBERS\n\t      move back and forth. But Kirk does not see them; his\n\t      mind is tormented by the transporter accident -- was\n\t      there something he should have done, could have done,\n\t      to prevent it? Should he launch on schedule with the\n\t      starship this unready? Has he done right in yielding\n\t      to this terrible needs for starship command again,\n\t      forcing Starfleet to give her to him? Would Decker's\n\t      knowledge of the new design have prevented the acci-\n\t      dent?\n\n\t      Kirk reaches a corridor intersection, looks around,\n\t      realizes he's lost track of where he is. A passing\n\t      YEOMAN stops in response to his puzzled expression.\n\n\t                              KIRK\n\t                Turboshaft eight...?\n\n\t                              YEOMAN\n\t                Back that way, sir.\n\n\t      She's indicating back the direction from which Kirk\n\t      came. He nods his thanks, turns and moves back down\n\t      the corridor.\n\n\t 80   DECKER                                                      80\n\n\t      hurrying down the corridor. The two face each other\n\t      a silent moment, Decker studying Kirk curiously.\n\n\t                              KIRK\n\t                We'll have to replace Commander\n\t                Sonak. I'd still like a Vulcan\n\t                there, if possible...\n\n\t                              DECKER\n\t                None available, Captain. There's\n\t                no one in fact, who's fully rated\n\t                on this design.\n\n\t                              KIRK\n\t                You are, Mister Decker. I'm\n\t                afraid you'll have to double as\n\t                Science Officer.\n\n\t       And Kirk moves on, Decker stands gazing reflectively\n\t       after him.\n\n\t 81    OMITTED                                                    81\n\t  -                                                                -\n\t 84                                                               84     \n     \n\t 85    CLOSE - FULL SHOT OF THE KLINGON SHIP BEING DESTROYED      85\n\t      (AS SEEN ON VIEWER) (O)\n\t\n\t      (in the last part of the scene which showed the Klingon\n\t      Captain speaking in Klingonese and an English print-\n\t      out interpretation appearing at the screen bottom.\n\t      The Klingon ship nearly totaled; one engine nacelle\n\t      gone, smoke and flame spewing from the other, etc.\n\t      And then that final WHIPLASH ENERGY BOLT STRIKING AND\n\t      SPECTACULARLY DESTROYING THE SHIP, etc.)\n\n\t      But this time, O.S., we HEAR GASPS of incredulity from\n\t      many throats (an audience), and various AD LIBBED com-\n\t      ments: \"My God...!\" \"I don't believe it...!\" \"What\n\t      could it be...?\" Etc., etc.\n\n\t      And then, immediately following this, on the viewer:\n\n\t 86   THE LUMINESCENT CLOUD (AS SEEN ON A VIEWER) (O)             86\n\n\t      (as in earlier Epsilon 9 viewer -- but with no music,\n\t      only more AD LIBBED exclamations from an audience.)\n\t      The viewer goes blank.\n\n\t 87   INT. RECREATION DECK (M)                                    87\n\n\t      We SEE that all this was being viewed by the CREW\n\t      MEMBERS (Aliens included) assembled on the Rec Deck.\n\n\t      The Recreation Deck is one of the largest areas on\n\t      the ship, several deck levels high, a part of one\n\t      wall consisting of picture windows, through which can\n\t      be seen sections of the drydock structure outside.\n\n\t      On another wall is a large viewer, on which was just\n\t      shown the Klingon transmission. Leading off and away\n\t      from this deck area are what are obviously other\n\t      specific recreation areas -- gymnasiums, food centers,\n\t      game rooms, lounges, etc.\n\n\t 88   ANOTHER ANGLE OF THE RED DECK - HIGHER LEVEL                88\n\n\t      as the Crew Members chat in low, grim tones -- Kirk\n\t      (now with Captain's stripes) appears. As he comes\n\t      into view, the two hundred or so crew below go silent.\n\t      Kirk grimly indicates the now blank viewer:\n\n\t                              KIRK\n\t                That's all we know about it;\n\t                except that it's now 2.2 days\n\t                from Earth. Enterprise is the\n\t                only Federation starship that\n\t                stands in its way.\n\n\t 89   ANOTHER ANGLE - CREW REACTIONS                              89\n\n\t      as the CAMERA FINDS various faces: human, alien; most\n\t      young, all intelligent, forthright -- anxious. Kirk\n\t      has paused a moment, now continues.\n\n\t                              KIRK (O.S.)\n\t                We assume there is a vessel of\n\t                some type at the heart of the\n\t                cloud. Our orders are to intercept,\n\t                investigate; and take whatever action\n\t                is necessary... and possible.\n\t                        (beat)\n\t                ...We can only hope that the\n\t                life form aboard that vessel\n\t                reasons as we do.\n\n\t 90   ANGLE ON UHURA                                              90\n\n\t      standing near an intercom, which just then has emitted\n\t      a bosun's WHISTLE intercom signal.\n\n\t                              BRIDGE VOICE\n\t                        (from intercom)\n\t                Bridge to Captain. Priority\n\t                signal from Epsilon Nine --\n\n\t      Kirk leans over to the intercom, speaks into it:\n\n\t                              KIRK\n\t                Put it on the viewer here...!\n\n\t 91   ON THE REC DECK VIEWER (O)                                  91\n\n\t      as all eyes turn to the viewer which fades into a view\n\t      of Commander Branch, in the Epsilon 9 monitor room.\n\t      Branch is tense, reflecting extreme urgency. Near\n\t      Branch, working intently at the console are the Female\n\t      Lieutenant and a Technician.\n\n\t                              BRANCH\n\t                        (from the viewer;\n\t                         checking console\n\t                         readings)\n\t                Enterprise... the Cloud is\n\t                definitely a powerfield of some\n\t                kind... Measures... My God!\n\t                Over 82 A.U.'s in diameter...\n\t                Must be something incredible\n\t                inside there generating it.\n\t                        (looks up from\n\t                         console)\n\t                We're transmitting linguacode\n\t                friendship messages on all\n\t                frequencies. No response.\n\n\t                              TECHNICIAN\n\t                I have a null reading at the \n\t                center of the 'cloud,' sir.\n\n\t                              LIEUTENANT\n\t                Definitely something inside..\n\t                there but all scans are being\n\t                reflected back.\n\t                        (studies readings)\n\t                Receiving an odd pattern now..\n\t                        (toward Branch)\n\t                They seem to be reacting to\n\t                our scans, sir.\n\n\t                              BRANCH\n\t                        (inspecting another\n\t                         console)\n\t                 Some kind of energy surge...\n\t                        (looking up)\n\t                 Enterprise... they could be\n\t                 mistaking our scans as a\n\t                 hostile act...\n\t                        (reacts at readings)\n\t                 Deflectors, emergency full!\n\n\t      Branch hits an alarm button; we HEAR ALARM KLAXON\n\t      SOUNDING. The viewer IMAGE DISTORTS, clears again\n\t      while Branch -- facing his viewer, continues urgently:\n\n\t                              BRANCH\n\t                        (continuing)\n\t                We are under attack...!\n\n\t                              KIRK\n\t                        (to Uhura)\n\t                External view...!\n\n\t 92   ON THE VIEWER - EXT. THE DESTRUCTION OF EPSILON 9 (O)       92\n\n\t      as the image of Branch is immediately replaced by an\n\t      external view of the plantoid, and the LUMINESCENT\n\t      CLOUD (at about the same distance from which the\n\t      Klingon cruisers were attacked).\n\n\t      Then it STRIKES the plantoid WITH FULL, CATACLYSMIC                \n\t      FORCE. The viewer IMAGE BREAKS UP -- and immediately\n\t      the entire Starfleet base becomes a maelstrom of FLAR-\n\t      ING ENERGY, shattered structure, flying debris. And\n\t      then, all at once, there is nothing -- empty space,\n\t      Epsilon 9 is gone. We SEE only the stars; and the\n\t      mysterious LUMINESCENT CLOUD moving across the distant\n\t      sky.\n\n\t      (NOTE: The above is entirely SILENT, and when it is\n\t      finished, not a word is spoken.)\n\n\t                              KIRK (O.S.)\n\t                Viewer off.\n\n\t 93   ANOTHER ANGLE - KIRK                                        93\n\n\t      as the viewer goes blank, all still facing the screen.\n\t      Then Kirk turns to the room as if to comment. Then he\n\t      stops -- nothing he can say will add at all to what\n\t      they've just seen. Instead:\n\n\t                              KIRK\n\t                Pre-launch countdown will\n\t                commence in forty minutes.\n\n\t 94   ANOTHER ANGLE - CREW                                        94\n\n\t      The scene they have just witnessed still vivid in their\n\t      minds as they gaze somberly up toward Kirk who is exit-\n\t      ing. The bridge crew follows him out. Not a word is \n\t      said as the remainder of the crew waits another moment,\n\t      then begins to disperse toward their duty stations too.\n\n\t 95   EXT. THE ENTERPRISE IN DRYDOCK (S)                          95\n\n\t      Spectacular ORBIT VIEW of the giant starship in the\n\t      process of release. BEYOND US, in half light, EARTH\n\t      LOOMS HUGE. The dock welders are gone; the supply pods\n\t      float away from the ship. Little tongues of blue flame\n\t      spurt from the ship's maneuvering jets.\n\n\t 96   CLOSER - ON ENTERPRISE (S)                                  96\n\n\t      as the large dock umbilical is released, floats free of\n\t      its starship attachment. Dock departure is imminent.\n\n\t 97   INT. BRIDGE                                                 97\n\n\t      Kirk in the center seat, intently studying the Naviga-\n\t      tion console in front of him (at the Navigator's\n\t      station, which is unoccupied.) Other bridge personnel\n\t      are busy with their pre-launch duties.\n\n\t                              UHURA\n\t                Transporters Room and Chief\n\t                Engineer Scott report trans-\n\t                porter system fully repaired \n\t                and now functioning normally, \n\t                sir.\n\n\t                              SULU\n\t                Dock signals clear, Captain.\n\n\t                              KIRK\n\t                Rely we are holding position\n\t                awaiting final crew replacements.\n\n\t                              UHURA\n\t                Captain, Transporter Personnel\n\t                reports the Navigator...\n\t                        (consults console)\n\t                ... Lieutenant Junior Grade Ilia\n\t                (Eye-lee-ah) is already aboard,\n\t                and en route to the bridge.\n\n\t 98   ANGLE ON DECKER - AT THE SCIENCE STATION                    98\n\n\t      as Decker (now wearing Commander stripes) reacts,\n\t      almost startled, and Uhura continues:\n\n\t                              UHURA\n\t                She's a Deltan.\n\n\t      Uhura's tone and expression convey \"Deltan\" in a\n\t      certain, special manner.\n\n\t                              KIRK\n\t                       (reprovingly)\n\t                And there are no finer navigators\n\t                in Starfleet, Commander.\n\n\t      The last is interrupted by:\n\n\t98A   ANGLE ON THE ELEVATOR DOORS                                98A\n\n\t      as they snap open, and there emerges a breathtakingly\n\t      beautiful young woman (uniformed as a Navigator Lieu-\n\t      tenant) who strides purposefully onto the bridge. A\n\t      stunning figure, but hairless, entirely bald but or\n\t      delicate eyebrows and eyelashes. Her bald head is not \n\t      at all unattractive, in fact exudes an aura of sensual\n\t      nudity. Indeed, her whole being exudes sensuality.\n\t      (This is a racial characteristic, not a deliberate\n\t      presence.) She approaches Kirk\n\n\t      (NOTE: Throughout this sequence, Sulu eyes ILIA with\n\t      unrestrained admiration.)\n\n\t                              ILIA\n\t                Lieutenant Ilia reporting for\n\t                duty, sir.\n\n\t                              KIRK\n\t                        (formally; rising)\n\t                Welcome aboard, Lieutenant.\n\n\t 99   ACROSS ILIA TO DECKER                                       99\n\n\t      as Ilia starts to speak, suddenly stops: she has just\n\t      then noticed Decker, who has stepped from his station\n\t      to face her. For an electronic moment their eyes meet,\n\t      hold in unquestioned recognition.\n\n\t                              DECKER\n\t                Hello, Ilia.\n\n\t                              ILIA\n\t                       (surprised)\n\t                Decker....!\n\n\t      Kirk has observed this with surprise and some concern\n\t      (it presages possible complications). Decker turns to\n\t      Kirk, slightly uncomfortable at this.\n\t                          \n\t                              DECKER\n\t                I was stationed on the Lieutenant's\n\t                home planet some years ago...\n\n\t      Ilia looks from Kirk back to Decker, puzzled at his\n\t      sleeve stripes.\n\n\t                              ILIA\n\t                        (eyes his rank\n\t                         stripes)\n\t                'Commander' Decker?\n\n\t                              KIRK\n\t                Our Exec and Science Officer...\n\n\t                              DECKER\n\t                        (bitingly)\n\t                Captain Kirk has the utmost\n\t                confidence in me.\n\n\t      Kirk flashes a hard glance at Decker, then toward\n\t      Ilia too.\n\n\t                              KIRK\n\t                        (pointedly)\n\t                And in you, too, Lieutenant.\n\n\t                              ILIA\n\t                My oath of celibacy is on record\n\t                Captain. May I assume my duties?\n\n\t      While respectful, her tone of voice has been just as\n\t      firm as Kirk's.\n\n\t                              KIRK\n\t                By all means.\n\n\t100   ACROSS KIRK TO UHURA                                       100\n\n\t      receiving a message, now relaying it.\n\n\t                              UHURA\n\t                Captain, Starfleet reports our\n\t                last six crew members ready to\n\t                beam up...\n\t                        (puzzled)\n\t                ... but one of them is refusing\n\t                to step into the transporter.\n\n\t      Just as Kirk a moment before was tense, now suddenly\n\t      he's relaxed again; he rises.\n\n\t                              KIRK\n\t                        (pleased)\n\t                Oh? I'll see that he beams up...!\n\n\t      And he hurries from the bridge, onto the elevator, is\n\t      gone. A moment of puzzled silence, then:\n\t      \n\t                              DECKER\n\t                Mr. Sulu, take Lieutenant Ilia\n\t                in hand.\n\n\t                              SULU\n\t                        (startled)\n\t                Sir...?\n\t                       (then understands)\n\t                Yes, of course...\n\t                        (to Ilia)\n\t                Your pre-programming is already\n\t                set in, Lieutenant.\n\n\t      Sulu has almost tripped getting out of his chair. He\n\t      starts offering Ilia his hand, then thinks better of\n\t      it, withdraws it abruptly, immediately busies himself\n\t      punching out equations on her console... AD LIBS,\n\t      \"It's all on the computer. You'll have no problem...\"\n\t      Sulu is nervous, fluttery around this lovely creature --\n\t      now hits a wrong switch. Produces a BEEPING SOUND which\n\t      he fumbles to shut off. She smiles; speaks quietly,\n\t      repeats:\n\n\t                              ILIA\n\t                I'm sworn to celibacy, Mister\n\t                Sulu. That makes me as safe\n\t                as any human female.\n\n\t      Sulu catches her eye but before he can reply, Decker has\n\t      moved in beside Ilia.\n\n\t                              DECKER\n\t                I now the Captain meant no person-\n\t                al insult.\n\n\t                              ILIA\n\t                        (eyes on console)\n\t                I would never take advantage of\n\t                a sexually immature species.\n\t                        (looks at him)\n\t                You can assure him that's true,\n\t                can't you?\n\n\t      Clearly, the remark carries special, personal\n\t      significance.\n\n\t  101    INT. TRANSPORTER ROOM                                      101\n\t -                                                                 -\n\t  102                                                               102\n\n\t      Kirk entering as Rand and her assistant electronically\n\t      list the last of the five arrivals who are leaving the\n\t      Transporter Chamber. Kirk calls through intercom to\n\t      the last arrival, a young female Yeoman.\n\n\t                              KIRK\n\t                Yeoman, what was the problem\n\t                down there?\n\n\t                              YEOMAN\n\t                        (through intercom)\n\t                He insisted we go first, sir.\n\t                Said something about first seeing\n\t                how it scrambled our molecules.\n\n\t                              KIRK\n\t                Thank you, Yeoman\n\t                        (hits transmit control)\n\t                Starfleet , this is Captain Kirk.\n\t                The officer is to be beamed up\n\t                immediately!\n\n\t103   ANGLE ON THE CHAMBER (O)                                   103\n\n\t      A moment, then again the GENERATING HUMMING, and then\n\t      the familiar BEAMING EFFECT. And then you SEE McCOY!\n\t      He fully MATERIALIZES. He looks himself over as if in\n\t      pleased surprise he is still in one piece. CAMERA PANS\n\t      McCoy from the Transporter Chamber to Kirk who is hav-\n\t      ing a hard time containing his amusement and delight.\n\n\t                              KIRK\n\t                Well, for a man who swore he'd\n\t                never return to Starfleet...\n\n\t                              McCOY\n\t                        (flat, tight)\n\t                What happened, Captain, sir, was\n\t                that your revered Admiral Nogura\n\t                invoked a little known -- and\n\t                seldom used -- reserve activation\n\t                clause...\n\t                        (snaps)\n\t                ... in simpler language, Captain,\n\t                sir, they drafted me!\n\n\t                              KIRK\n\t                        (straight-faced)\n\t                They didn't...!\n\n\t      Kirk has offered his hand, but McCoy is already flaring:\n\n\t                              McCOY\n\t                This was your idea! It was\n\t                your idea, wasn't it!\n\n\t                              KIRK\n\t                Bones, there's a 'thing' out\n\t                there --\n\n\t                              McCOY\n\t                -- Why is any object we don't\n\t                understand called a 'thing'?\n\n\t                              KIRK\n\t                        (continues)\n\t                -- headed this way. I need you...\n\t                    \n\t                              McCOY\n\t                Were you behind this?\n\n\t                              KIRK\n\t                        (nods)\n\t                Bones, I need you badly.\n\n\t      Kirk extends his hand again; McCoy delays some moments\n\t      -- then finally responds. And once done, it is the long\n\t      hand clasp of two old friends reunited despite their\n\t      differences. Now McCoy turns to Rand.\n\n\t                              McCOY\n\t                Permission to come aboard, sir?\n\n\t                              RAND\n\t                        (elated)\n\t                Permission granted, sir!\n\n\t      And McCoy moves toward the door, grumbling:\n\n\t                              McCOY\n\t                I hear Chapel's an MD now; I\n\t                need a top nurse, not a doctor\n\t                who'll argue every diagnosis...\n\t                And --\n\n\t      Even when he's in the corridor his grumbling trails\n\t      after him.\n\n\t                              McCOY\n\t                        (continuing)\n\t                ... they've probably redesigned\n\t                sickbay, too. Engineers love to\n\t                change things.\n\n\t104   FULL ON KIRK                                               104\n\n\t      as he gazes fondly after the grumbling McCoy, and now\n\t      turns to the intercom, flips it on:\n\n\t                              KIRK\n\t                All decks, this is the Captain.\n\t                Prepare or immediate departure.\n\n\t  105    INT. ENTERPRISE - MONTAGE  DEPARTURE SCENES                105\n\t -                                                                 -\n\t  108                                                               108\n\t      Bulkheads closing, feed lines disengaging, main\n\t      ENGINES HUM into life, crew personnel hurrying to\n\t      launch stations. SHOTS of cargo deck, down to\n\t      Engineering Section slamming shut. Drydock area\n\t      clearing, work lights go out, warning lights go on.\n\n\t109   INT. BRIDGE                                                109\n\n\t      All flight positions manned, ready.\n\n\t                              UHURA\n\t                Dock control reports ready, sir.\n\n\t                              SULU\n\t                Helm ready, sir.\n\n\t                              ILIA\n\t                Orbital departure on plot, sir.\n\n\t                              UHURA\n\t                Yard command signaling clear,\n\t                sir.\n\n\t                              KIRK\n\t                Maneuvering thrusters, Mister\n\t                Sulu.\n\n\t                              SULU\n\t                Maneuvering thrusters, sir.\n\n\t                              KIRK\n\t                Hold station.\n\n\t                              SULU\n\t                        (working controls)\n\t                Thrusters at station-keeping, sir.\n\n\t110   EXT. EARTH ORBIT - ENTERPRISE AND DRYDOCK (S)              110\n\n\t      The starship within the drydock, but now the maneuver-\n\t      ing -- thrusters spurt pinpoints of BLUE-LAME. The\n\t      drydock is ready for the starship's departure -- not\n\t      a single pod or shuttlecraft in sight. The starship\n\t      looms majestically within the lacework girders.\n\n\t111   OMITTED                                                    111\n\n\t112   INT. BRIDGE                                                112\n\n\t      as Kirk hesitates just an instant, seems to hold his\n\t      breath. Then:\n\n\t                              KIRK\n\t                Thrusters ahead, Mister Sulu. \n\t                Take us out.\n\n\t113   EXT. EARTH ORBIT                                           113\n\n\t      The maneuvering -- thrusters spurt more BLUE FLAME.\n\t      The Enterprise begins moving, DOMINATING SCREEN as\n\t      it moves majestically from the drydock.\n\n\t      THEME MUSIC IN AND UP.\n\n\t  114    CLOSER ANGLES - ENTERPRISE (S)                             114\n\t -                                                                 -\n\t  117                                                               117\n\t      emphasizing fine detail reality of both drydock and\n\t      starship as saucer section emerges. Tiny space-\n\t      suited human figures watch the departing ship.\n\t      CAMERA HOLDS ON STARSHIP until completely clear\n\t      of the orbital dock.\n\n\t  117A   INT. ENGINEERING SECTION                                  117A\n\n\t      Here in Engineering Section, the ENGINE THROBBING\n\t      SLOWLY BUILDS to a THUNDERING SOUND. A glow from\n\t      the central unit indicates anti-matter intermix\n\t      underway. The Engineering Section shudders as the\n\t      great engines draw more and more power.\n\n\t                              SCOTT\n\t                Intermix set, Bridge, impulse\n\t                power at your discretion.\n\n\t118   INT. BRIDGE - FAVORING KIRK                                118\n\n\t      as he hesitates just an instant. This is the moment\n\t      he's awaited, and to him it is equally as sensuous\n\t      and gratifying as making love -- which, perhaps, he\n\t      is -- to his mistress: The Enterprise.\n\n\t                              KIRK\n\t                        (after a moment)\n\t                Impulse power, Mr Sulu.\n\t                Ahead Warp point-five.\n\n\t119   EXT. THE ENTERPRISE (S)                                    119\n\n\t      The maneuvering jets turn off, the impulse drive glows.\n\t      The Enterprise begins moving perceptibly faster --\n\t      behind her, the drydock diminishing rapidly in size.\n\n\t                              KIRK\n\t                Departure angle on viewer.\n\n\t                              CHEKOV\n\t                Departure angle.\n\n\t      We SEE viewer IMAGE SWITCH to a departing view of\n\t      lovely bluish, cloud-laced image of Earth as it grows\n\t      smaller, smaller, dwindling quickly as the starship\n\t      gathers speed.\n\n\t                              KIRK\n\t                Viewer ahead.\n\n\t      And viewer IMAGE SWITCHED to show the star patterned\n\t      space ahead.\n\n\t120   EXT. SPACE - SATURN                                        120\n\n\t      with its colorful rings and multiple moons FILLING a \n\t      major portion of the FRAME.\n\n\t                              KIRK (V.O.)\n\t                Captain's Log, stardate 7412.6.\n\t                2.7 hours from launch...\n\n\t121   INT. BRIDGE - FAVORING THE VIEWER                          121\n\n\t      All hands tense with the excitement of the journey,\n\t      on the viewer Saturn -- and its rings -- are falling\n\t      away (BEHIND US). OVER this:\n\n\t                              KIRK (V.O.)\n\t                        (concerned)\n\t                ... in order to intercept the\n\t                Intruder at the earliest possible\n\t                time, we must now risk engaging\n\t                Warp drive while still within the\n\t                solar system...\n\n\t      End of log.\n\n\t122   ANGLE ON DECKER - SCIENCE STATION                          122\n\n\t      punching in equations on his console, reaching a\n\t      reading:\n\n\t                              DECKER\n\t                Captain, assuming we have full\n\t                Warp capability, accelerating to\n\t                Warp Seven on leaving solar system\n\t                will bring us to IP with the\n\t                Intruder in twenty point one hours.\n\n\t  122A   INCLUDE ILIA                                              122A\n\n\t      Checking her console.\n\n\t                              ILIA\n\t                Science Officer's computations\n\t                confirmed, sir.\n\n\t      And Decker and Ilia glance at each other -- and again,\n\t      you know there is something more than casual in this.\n\n\t123   ANGLE ON THE ELEVATOR DOORS                                123\n\n\t      as they open, and McCoy appears, walks over to Kirk\n\t      who swings his chair around to face him. McCoy is\n\t      his usual dour self.\n\n\t                              KIRK\n\t                Well, Bones, do the new medical\n\t                facilities meet with your\n\t                approval?\n\n\t                              McCOY\n\t                They do not. It's like working\n\t                in a damned computer center.\n\n\t                              KIRK\n\t                        (turning to Decker)\n\t                Programming ready?\n\n\t                              DECKER\n\t                Program set for standard Warp\n\t                entry, Captain...\n\n\t      Kirk starts to swing his chair to normal position --\n\t      Decker calls:\n\n\t                              DECKER\n\t                        (continuing)\n\t                ... but I still recommend\n\t                further simulation study.\n\n\t                              KIRK\n\t                Mister Decker; every minute\n\t                brings that object nearer Earth!\n\t                        (using intercom)\n\t                Engineering! Stand by for\n\t                Warp Drive.\n\n\t      McCoy is watching Kirk, a bit surprised at his abrupt-\n\t      ness to Decker.\n\n\t                              SCOTT'S INTERCOM VOICE\n\t                        (worried)\n\t                Captain, we need further Warp\n\t                simulation on the flow sensors...\n\n\t                              KIRK\n\t                Engineer, we need Warp speed now!\n\n\t                              McCOY\n\t                        (very gently)\n\t                You're pushing Jim. Your people\n\t                know their jobs.\n\n\t      Kirk flashes McCoy a glance of annoyance -- then back\n\t      to using intercom:\n\n\t124   INT. ENGINEERING                                           124\n\n\t      The main intermix chambers GLOWING with power; the LOW\n\t      RUMBLE of the main engines coming to life.\n\n\t      The CAMERA FINDS Scott in the chamber:\n\n\t                              SCOTT\n\t                        (into intercom)\n\t                Hold one minute, please, Captain --\n\n\t      He steps to his console where an ASST. ENGINEER is\n\t      working a computer, studying the readouts, punching\n\t      buttons, etc. Scott stands over him, grimly observ-\n\t      ing. Finally, the Asst. simply shrugs with frustration.\n\n\t                              ASST.\n\t                That's it, sir; I can't do any\n\t                better.\n\n\t                              SCOTT\n\t                        (grim)\n\t                Aye, lad...\n\t                        (into intercom)\n\t                It's borderline on the simulator,\n\t                Captain: I canna guarantee that\n\t                she'll...\n\n\t125   INT. BRIDGE                                                125\n\n\t      as Kirk, annoyed, interrupts Scott on the intercom.\n\n\t                              KIRK\n\t                Warp Drive, Mr Scott.\n\n\t      McCoy still watches curiously as Kirk turns to the\n\t      helm:\n\n\t                              KIRK\n\t                        (continuing)\n\t                Ahead Warp One, Mr Sulu.\n\n\t                              SULU\n\t                Accelerating to Warp One, sir.\n\n\t      Sulu moves his controls forward -- everyone waits\n\t      tensely -- and then we HEAR THE INCREASING THROB OF\n\t      THE ACCELERATING ENGINES.\n\n\t                              SULU\n\t                        (continuing)\n\t                Warp point seven... point eight\n\t                ... nine...\n\n\t126   EXT. SPACE  THE ENTERPRISE - AFT AND AHEAD (S)             126\n\n\t      We SEE the WARP POWER EFFECT build up between the en-\n\t      gine \"nacelles\" -- then the starship makes the QUANTUM\n\t      LEAP into warp drive. The stars ahead shift, streak,\n\t      colors pulsating and changing as the shift exceeds the\n\t      wave lengths of the light spectrum -- and the stars\n\t      congeal into a MASS ahead.\n\n\t127   INT. BRIDGE - PAST KIRK TO THE VIEWER (O)                  127\n\n\t      as the viewer shows the same WARP DRIVE EFFECT. or\n\t      another moment all remain tense, and then all at once\n\t      relax, release their breaths. Smiles.\n\n\t                              SULU\n\t                Warp One, sir.\n\n\t      Kirk smiles, pleased, starts swinging his chair around,\n\t      at the same time calling:\n\t\n\t                              KIRK\n\t                Mr. Decker --\n\n\t      Kirk never finishes the word. At that instant, on the\n\t      viewer, a WORMHOLE DISTORTION: a sudden SPIRALING OF\n\t      STARS AND FLUID LIGHT narrowing into a VORTEX into\n\t      which the Enterprise hurtles. A space trap, a deadly\n\t      pandemonium of ALARM KLAXONS, BELLS, VOICES:\n\n\t                              KIRK\n\t                        (continuing)\n\t                Wormhole!... Get us back on\n\t                impulse power! Full reverse!\n\n\t128   EXT. SPACE - THE ENTERPRISE (S)                            128\n\n\t      Enterprise has been caught in a matter-time distortion,\n\t      sucked into a cylindrical \"hole in space\" (the Worm-\n\t      hole distortion), stars and planets become strange,\n\t      elongated shapes, with the Enterprise drawn deeper\n\t      and deeper into the vortex.\n\n\t129   INT. BRIDGE                                                129\n\n\t      The KLAXONS and BELLS CONTINUE, and the crew responding:\n\n\t                              SULU\n\t                Negative helm control, Captain!\n\t                Going reverse on impulse power...!\n\n\t                              UHURA\n\t                Subspace frequencies are jammed\n\t                by Wormhole effect!\n\n\t                              COMPUTER VOICE\n\t                        (terse, flat)\n\t                Collision alert...!\n\t                Collision alert...!\n\n\t      (Note: Computer alert continues through entire scene.)\n\n\t                              DECKER\n\t                        (consulting his viewer)\n\t                Negative control from inertial\n\t                lag will continue 22 point five\n\t                seconds before forward velocity\n\t                slows to sub-light speed.\n\n\t                              ILIA\n\t                Unidentified small object has\n\t                been pulled into the wormhole\n\t                with us, Captain! Directly \n\t                ahead...!\n\n\t                              KIRK\n\t                Forcefields up full! Put object \n\t                on viewer...!\n\n\t130   ANGLE ON THE MAIN VIEWER (O)                               130\n\n\t      showing (a magnification view) of a tiny point of light\n\t      directly ahead. Meanwhile, Kirk shouts an AD LIBBED\n\t      order to Sulu: \"Go to Manual override!\" Sulu AD LIBS,\n\t      \"No manual response...!\" (Through all this, McCoy\n\t      stands frozen, waiting -- and expecting -- the worse.)\n\t      Meanwhile, Ilia has reached over to Sulu's console,\n\t      hits a button, AD LIBBING, \"Navigational deflectors\n\t      coming up...!\" And then with alarmed dismay:\n\n\t                              ILIA\n\t                Navigational deflectors \n\t                inoperative...!\n\t                        (consulting her \n\t                         console, alarmed)\n\t                Directional control also \n\t                inoperative, Captain...!\n\n\t                              DECKER\n\t                Wormhole distortion has over-\n\t                loaded main power systems...!\n\n\t131   CLOSE ON MAIN VIEWER (O)                                   131\n\n\t      The picture is switched through two further levels of\n\t      magnification, enlarging the object: an elongated,\n\t      distorted, pitted asteroid, tumbling toward the Enter-\n\t      prise on a collision course.\n\n\t                              KIRK\n\t                        (toward Ilia)\n\t                Time to impact...?\n\n\t                              ILIA\n\t                Twelve seconds...!\n\n\t                              KIRK\n\t                Mr. Chekov, stand by on the\n\t                phasers...!\n\n\t                              DECKER\n\t                        (racing to Chekov's\n\t                         station)\n\t                Delay that phaser order! Arm\n\t                photon torpedoes...!\n\n\t133   ANOTHER ANGLE - McCOY NOTICING KIRK                        133\n\n\t      who has just glanced, surprised at Decker (for counter-\n\t      manding the phaser order) -- and for a split instant,\n\t      Kirk seems confused. McCoy reacts with enlightenment\n\t      as, meanwhile:\n\n\t134   ANOTHER ANGLE - THE VIEWER (O)                             134\n\n\t      The object even larger.\n\n\t                              CHEKOV\n\t                Photon torpedoes armed...!\n\n\t                              ILIA\n\t                Object is an asteroid, reading\n\t                mass point seven...\n\t                       (consulting instruments)\n\t                Impact in eight seconds...\n\t                seven... six... five...\n\n\t                              DECKER\n\t                Fire torpedoes...!\n\n\t                              CHEKOV\n\t                        (punching button)\n\t                Torpedoes away...!\n\n\t135   EXT. SPACE - PAST THE ENTERPRISE AND THE ASTEROID (S)      135\n\n\t      as the starship's photon torpedo tubes EJECT GLOWING\n\t      BALLS OF LIGHT ENERGY, which seems to float toward the\n\t      oncoming asteroid, almost too slowly. And in these\n\t      brief seconds, the asteroid hurtles at the Enterprise,\n\t      the huge pitted rock growing even larger than the ship\n\t      itself. It FILLS THE SCREEN, as the photon torpedoes\n\t      hit, disintegrating the asteroid into thousands of\n\t      fragments. Instantly, these fragments pulverize them-\n\t      selves on the ship's forward forcefield and deflector\n\t      screens. The smaller pieces burn up on impact, clearly\n\t      outlining the ship's forcefield barriers.\n\n\t136   INT. BRIDGE - INCLUDING MAIN VIEWER (O)                    136\n\n\t      The asteroid fragments still smashing into the force\n\t      field screen; the smaller bits like SPARKLERS as im-\n\t      pact heat consumes them. The larger sections bouncing \n\t      away, the bridge QUIVERING as they hit.\n\n\t      Then one final gigantic fragment strikes, the bridge\n\t      SHUDDERS. And then the viewer shows only the normal\n\t      SUB-WARP EFFECT: The stars ahead, relatively station-\n\t      ary; a feeling of motion, but smooth, visually normal.\n\n\t                              CHEKOV\n\t                        (relieved)\n\t                We're out of it...!\n\n\t                              DECKER\n\t                We are at warp point eight.\n\t                Position report, Navigator..?\n\n\t                              SULU\n\t                Helm control restored, sir.\n\n\t                              ILIA\n\t                Computing new interception\n\t                course.\n\n\t                              UHURA\n\t                Communications are normal,\n\t                Captain.\n\n\t                              CHEKOV\n\t                        (to Kirk)\n\t                Negative damage report, sir.\n\t                        (to McCoy)\n\t                No casualties reported, sir.\n\n\t                              McCOY\n\t                        (tight)\n\t                Wrong, Mr. Chekov, there are\n\t                casualties. My wits!\n\t                        (to Kirk, indignant)\n\t                As in 'frightened-out-of'...!\n\n\t                              DECKER\n\t                       (into intercom)\n\t                Engineer... report status there.\n\n\t137   INT. ENGINEERING                                           137\n\n\t      with Scott and his crew pouring over the instruments --\n\t      all seem very grim. Scott, quite preoccupied, now\n\t      speaks into the intercom.\n\n\t                              SCOTT\n\t                In just a second, Exec; we're \n\t                picking up the pieces down here.\n\n\t138   INT. BRIDGE                                                138\n\n\t      Kirk seeming to collect his thoughts now -- he gives\n\t      Decker a look, uses the intercom himself:\n\n\t                              KIRK\n\t                Warp Drive as soon as possible, \n\t                Mr. Scott.\n\n\t                              SCOTT'S INTERCOM VOICE\n\t                        (protesting)\n\t                Captain, it was our anti-matter\n\t                imbalance that created the \n\t                wormhole in the first place. It \n\t                will happen again if we don't \n\t                correct it.\n\n\t                              KIRK\n\t                That object out there is less\n\t                than two days from Earth, Mister \n\t                Scott. We've got to intercept \n\t                while it still is out there!\n\n\t                              SCOTT'S INTERCOM VOICE\n\t                        (near annoyed)\n\t                Aye, we understand that sir!\n\t                We're doing our best.\n\n\t      as Kirk flips off the intercom, rises determinedly,\n\t      faces Decker:\n\n\t                              KIRK\n\t                Mr. Decker, I'd like to see you\n\t                in my quarters.\n\t                        (toward helm)\n\t                You have the conn, Mr. Sulu.\n\n\t                              McCOY\n\t                        (to Kirk)\n\t                Mind if I tag along?\n\n\t      Kirk gives McCoy an annoyed look, then strides to the\n\t      elevator. Decker, grim, follows -- McCoy brings up\n\t      the rear as they EXIT.\n\n\t139   ANGLE FAVORING ILIA                                        139\n\n\t      gazing worriedly at the just-closed elevator doors,\n\t      as Sulu is punching figures into his console.\n\n\t                              SULU\n\t                Maintaining warp point \n\t                eight; I show our new heading \n\t                as 287 point three Mark 105.\n\n\t      Ilia's attention is directed toward Decker.\n\n\t                              SULU\n\t                        (continuing; gently\n\t                         reminding)\n\t                Lieutenant Ilia...?\n\n\t                              ILIA\n\t                        (a beat; then \n\t                         quickly)\n\t                Confirmed, Mr. Sulu. Confirmed.\n\n\t      And she punches in some equations, then again peers\n\t      up at the doors where she last saw Decker. She is\n\t      very concerned.\n\n\t140   INT. KIRK'S QUARTERS                                       140\n\n\t      The doors opening, Kirk entering, McCoy moves to b.g.\n\t      while Decker stands attentively, waiting as Kirk\n\t      turns to him.\n\n\t                              KIRK\n\t                Explanation, Mr. Decker: Why was\n\t                my phaser order countermanded?\n\n\t                              DECKER\n\t                       (cool, polite)\n\t                Sir, the Enterprise redesign\n\t                increases phaser power by\n\t                channeling it through the main\n\t                engines. When they went into\n\t                anti-matter imbalance, the\n\t                phasers were automatically cut\n\t                off.\n\n\t      Kirk is surprised by this information, perhaps slight-\n\t      ly chagrined. After a beat:\n\n\t                              KIRK\n\t                Then you acted properly, of course.\n\n\t                              DECKER\n\t                Thank you, sir. I'm sorry I embar-\n\t                rassed you.\n\n\t                              KIRK\n\t                You saved the ship.\n\n\t                              DECKER\n\t                        (coolly)\n\t                I'm aware of that, sir.\n\n\t                              KIRK\n\t                        (flaring)\n\t                Stop competing with me, Decker!\n\n\t                              DECKER\n\t                Permission to speak freely, sir?\n\n\t                              KIRK\n\t                        (tight)\n\t                Granted.\n\n\t                              DECKER\n\t                Sir, you haven't logged a single\n\t                star hour in two and a half years.\n\t                That, plus your unfamiliarity\n\t                with the ship's design -- in my\n\t                opinion, sir, seriously jeopardizes \n\t                our mission.                          \n\n\t      Kirk reacts with anger. Struggles for and regains\n\t      control.\n\n\t                              KIRK\n\t                I trust you will... nursemaid me\n\t                through these difficulties, Mister?\n\n\t                              DECKER\n\t                Yes, sir, I'll do that.\n\n\t      Kirk peers at Decker, who stands facing him \n\t      determinedly.\n\n\t                              KIRK\n\t                Then I won't keep you from your\n\t                duties any longer, Commander.\n\t                        (whirling at McCoy)\n\t                Yes, Doctor?\n\n\t      Kirk's last line has drowned out Decker's \"Aye, sir.\"\n\t      McCoy says nothing, waits until Decker is gone and the\n\t      door closes behind him. Then:\n\n\t                              McCOY\n\t                He may not be wrong, Jim.\n\n\t141   OMITTED                                                    141     \n\n \n\t  -                                                                -\n\t142                                                              142\n\n\n\t143   INT. CORRIDOR                                              143\n\n\t      Decker moving toward an elevator -- the elevator doors\n\t      open, and there is Ilia. She steps out, faces him.\n\n\t                              ILIA\n\t                Was he difficult?\n\n\t                              DECKER\n\t                No more than I expected\n\t                        (hesitates)\n\t                Not as difficult as this. I'm\n\t                sorry...\n\n\t                              ILIA\n\t                That you left? or that you didn't\n\t                say 'goodbye'?\n\n\t                              DECKER\n\t                If I'd seen you again, would you\n\t                have been able to say it?\n\n\t                              ILIA\n\t                        (long hesitation;\n\t                         then shakes head)\n\t                No.\n\n\t      Ilia whirls, moves toward her stateroom door, which\n\t      snaps open, then closes behind her. Decker stands\n\t      gazing at the door, remembering, regretful.\n\n\t144   OMITTED                                                    144\n\n\t  144A   INT. KIRK'S CABIN - KIRK AND McCOY                        144A\n\n\t                              KIRK\n\t                Get out of here, Bones.\n\n\t                              McCOY\n\t                        (shakes head)\n\t                As ship's doctor, I am now\n\t                discussing the subject of\n\t                command fitness.\n\n\t      Kirk's expression hardens.\n\n\t                              KIRK\n\t                Make your point, Doctor.\n\n\t                              McCOY\n\t                The point, Captain, is that it's\n\t                you who's competing...\n\t                        (a beat, as Kirk reacts)\n\t                You pulled every string in the\n\t                book short of blackmail to get\n\t                the Enterprise -- maybe even\n\t                that. And when this mission is\n\t                over, you have no intention of\n\t                giving her back.\n\n\t                              KIRK\n\t                        (tight)\n\t                I intend to keep her, is that\n\t                what you're saying, Doctor?\n\n\t                              McCOY\n\t                It's an obsession -- that can\n\t                blind you so far more immediate\n\t                -- and critical responsibilities.\n\t                Your reaction to Decker is an\n\t                example.\n\n\t      Kirk studies him a beat; has McCoy touched a nerve?\n\t      Something Kirk himself might have been unaware of?\n\t      Kirk starts speaking, but is interrupted by:\n\n\t                              UHURA'S INTERCOM VOICE\n\t                Bridge to Captain.\n\n\t  144B   ANGLE TO INCLUDE CABIN VIEWER                             144B\n\n\t      as Kirk turns to it.\n\n\t                              KIRK\n\t                Viewer on.\n\n\t      At his VOICE COMMAND, the viewer comes on with AN IMAGE\n\t      of Uhura at her console.\n\n\t                              UHURA FROM VIEWER\n\t                Signal from a Federation-registered\n\t                long-range shuttle, sir. She\n\t                wishes to come alongside, and\n\t                lock on.\n\n\t                              KIRK\n\t                For what purpose?\n\n\t      On the viewer, Chekov's IMAGE replaces Uhura.\n\n\t                              CHEKOV\n\t                It is a courier, Captain. Grade\n\t                One priority. Non-belligerency\n\t                confirmed.\n\n\t                              KIRK\n\t                Very well, Mr. Chekov, see to it.\n\t                Viewer off.\n\n\t      Viewer IMAGE FADES. Kirk turns back to McCoy whose\n\t      question of Kirk's fitness still hangs there between\n\t      them. Eye to eye - then, finally:\n\n\t                              KIRK\n\t                        (continuing)\n\t                Your... opinion has been noted,\n\t                Doctor.\n\t                        (beat)\n\t                Is there anything further?\n\n\t                              McCOY\n\t                I hope not.\n\n\t      Kirk nods, exits. McCoy watches him go, hoping his\n\t      point has gotten through.\n\n\t145   OMITTED                                                    145\n\n\t146   EXT. SPACE - THE SHUTTLE (S)                               146\n\n\t      traveling at a rapid speed; it carries warp-capacity\n\t      nacelles which dwarf the smaller  to 10 position\n\t      shuttle fuselage. The CAMERA HOLD ON THE SHUTTLE\n\t      as it overtakes the Enterprise, the ENTERPRISE COM-\n\t      ING INTO VIEW, and the shuttle slowing and beginning\n\t      to move between the starship's giant nacelles.\n\n\t147   EXT. SPACE - THROUGH WINDOW IN OFFICERS' LOUNGE -          147\n\t      THE ENTERPRISE AND THE SHUTTLE (S)\n\n\t      About the size of a fighter airplane floating in over\n\t      the vastness of an aircraft carrier. The shuttle\n\t      slows further, hovering now. Then its fuselage pod\n\t      detaches from the warp drive nacelles -- the pod\n\t      moving slowly but precisely toward the starship's\n\t      command airlock.\n\n\t148   INT. POD HATCH ENTRY AREA                                  148\n\n\t      as we HEAR the CLANK and WHOOSH of the AIRLOCK MECHAN-\n\t      ISM. Chekov is standing by  with a security man.\n\n\t      A moment later the hatch slips open - TO REVEAL\n\t      Spock. A proud Spock, impassively Vulcan, almost\n\t      contemptuously aloof. His hair is now trimmed in\n\t      neat Vulcan style; he wears Vulcan attire simple,\n\t      civilian, utilitarian.)\n\n\t                              SPOCK\n\t                Permission to come aboard, sir?\n\n\t                              CHEKOV\n\t                Granted, sir! Granted!\n\n\t      Spock is already moving out of the pod entry area, im-\n\t      passive, no greeting on his lips; no friendship in his\n\t      expression.\n\n\t149   EXT. SPACE - THE SHUTTLE LEAVING                           149\n\n\t      pulling away from Enterprise.\n\n\t150   INT. BRIDGE                                                150\n\n\t      The elevator doors open, and there is Spock. It takes\n\t      everyone a moment to believe their eyes. Then, the\n\t      Bridge crew AD LIB their surprise and pleasure.\n\n\t                              KIRK\n\t                Spock...! Spock, where...how...?\n\n\t      Kirk, smiling, is moving toward Spock with hand out-\n\t      stretched. But Spock has already turned and moved\n\t      toward the science console where Decker sits.\n\n\t                              SPOCK\n\t                Commander, if I may...?\n\n\t150A  AT SCIENCE CONSOLE                                        150A\n\n\t      It takes Decker a moment to realize that Spock wants\n\t      to take over the console. He begins getting to his\n\t      feet, throwing Kirk a look. But Kirk's attention is\n\t      totally on SPOCK. And Spock is already intent on com-\n\t      putations he is beginning to punch into the science\n\t      console computer.\n\n\t                              SPOCK\n\t                I have been monitoring your\n\t                Starfleet transmissions, Captain,\n\t                your engine design difficulties.\n\n\t      Spock continues to punch information into the science\n\t      computer -- a monitor screen IMAGE begins to show com-\n\t      plex equations which Spock inspects -- he makes a\n\t      further computer punch out and inspects a second  monitor \n\t      IMAGE of other equations. Only then does Spock seem to\n\t      become aware of Kirk and Decker standing there with\n\t      questioning expressions.\n\n\t                              SPOCK\n\t                        (continuing)\n\t                I offer my services as Science\n\t                Officer.\n\n\t      Kirk starts to grin -- then remembers to wipe it off\n\t      his face as he turns to Decker.\n\n\t                              KIRK\n\t                If our Executive Officer has no\n\t                objections...?\n\n\t                              DECKER\n\t                        (interrupting)\n\t                Of course not. I'm aware of\n\t                Mister Spock's qualifications.\n\n\t                              KIRK\n\t                        (grinning openly now;\n\t                         turns, calls)\n\t                Mister Chekov, log Mister Spock's\n\t                Starfleet commission reactivated;\n\t                list him as Science Officer; both\n\t                effective immediately.\n\n\t  151   ANGLE TO INCLUDE ELEVATOR DOORS                             151\n\n\t      as they SNAP open -- McCoy and Chapel appear. Chapel\n\t      sees Spock at the science console -- she moves in\n\t      quickly, overjoyed. Even McCoy seems pleased.\n\n\t                              CHAPEL\n\t                Mr. Spock...!!!\n\n\t                              McCOY\n\t                So help me, I'm actually\n\t                pleased to see you.\n\n\t      But as Chapel crosses to Spock, her pleased smile\n\t      brightening her whole face, Spock turns, dismisses her\n\t      presence with a cold disinterested glance -- Chapel\n\t      stops, stands dumbfounded. Spock gives McCoy a similar\n\t      glance - turns back to his console readings as:\n\n\t                              UHURA\n\t                That's how we all feel, Mister...\n\n\t      The same cold glance causes Uhura to stop in mid-\n\t      sentence. Several grins directed toward Spock are now\n\t      fading from bridge crew faces. Spock has turned back\n\t      again for a last quick reading at the console and now\n\t      stands -- totally ignoring everyone else as he speaks\n\t      coolly, unemotionally to Kirk:\n\t\n\t                              SPOCK\n\t                With your permission, I will now\n\t                discuss these fuel equations with\n\t                the Engineer.\n\n\t      Kirk manages a nod, a bit dumbfounded himself at Spock's\n\t      strange manner. Spock heads for the elevator -- puz-\n\t      zled expressions from the entire bridge crew. Then\n\t      Kirk calls after him, very sincerely:\n\n\t                              KIRK\n\t                Mister Spock, welcome aboard!\n\n\t      Spock continues onto the elevator without any acknow-\n\t      ledgment, leaves. Kirk glances, perplexed, at McCoy.\n\t      McCoy, equally perplexed, shrugs.\n\n\t                              McCOY\n\t                Never look a gift Vulcan in the\n\t                ears, Jim.\n\n\t152   EXT. SPACE - THE ENTERPRISE (S)                            152\n\n\t      traveling past the stars, sub-warp. OVER this:\n\n\t                              KIRK (V.O.)\n\t                        (buoyant)\n\t                Captain's Log. Stardate 7413.4.\n\t                Thanks to Mr. Spock's timely\n\t                arrival - and assistance...\n\n\t153   INT. ENGINEERING - SPOCK AND SCOTT                         153\n\t      \n\t      Scott making an intermix chamber reading with a hand-\n\t      held timer-temperature device which emits SIGNALS while\n\t      Spock now in regulation uniform and hair trim, makes\n\t      adjustments in the circuitry of a panel complex. Dur-\n\t      ing the following, they will react as if they've solved\n\t      the engine problem.\n\n\t                              KIRK (V.O.)\n\t                        (continues)\n\t                ... we have the engines rebalanced\n\t                into full warp capacity. Repair\n\t                time less than three hours...\n\n\t154   INT. BRIDGE - ALL BRIDGE CREW EXCEPT SPOCK                 154\n\n\t      Sulu at the helm, accelerating; just a touch of tense-\n\t      ness in crew as they move toward the speed which\n\t      earlier threw them into the \"wormhole\" effect.\n\n\t                              KIRK (V.O.)\n\t                        (continues)\n\t                ... which means we will now be\n\t                able to intercept Intruder while\n\t                still more than a day from Earth.\n\n\t155   ANGLE INCLUDING MAIN VIEWER (O)                            155\n\n\t      Stars accelerating as Sulu calls off:\n\n\t                    \n\t                              SULU\n\t                Warp point eight... point nine...\n\n\t      The viewer shows the QUANTUM LEAP into warp drive. The\n\t      stars ahead shift, streak and congeal into WARP EFFECT\n\t      MASS.\n\n\t                              SULU\n\t                        (continuing)\n\t                Warp one, sir.\n\n\t      The others wait, then show relief as:\n\n\t                              SULU\n\t                        (continuing)\n\t                Warp two, sir... warp three...\n\n\t      He continues to seven.\n\n\t                              SCOTT'S INTERCOM VOICE\n\t                Engineering to Bridge... New\n\t                intermix balance holding steady.\n\t                She's not even straining!\n\n\t156   INT. OFFICER'S LOUNGE (O)                                  156\n\n\t      Where, first, CAMERA SHOOTS THROUGH THE WINDOW, the\n\t      myriad of stars, space, the whole magnificent vista.\n\t      In the lounge, empty but for them, are Kirk and McCoy\n\t      -- obviously awaiting Spock, who ENTERS and presents\n\t      himself cold and aloof as before:\n\n\t                              SPOCK\n\t                Reporting as ordered, Captain.\n\n\t                              KIRK\n\t                Sit down, please.\n\n\t      Spock remains standing, addresses Kirk:\n\n\t                              SPOCK\n\t                Sir, I would appreciate Dr. McCoy\n\t                absenting himself from this\n\t                interview.\n\n\t                              KIRK\n\t                I want him here.\n\t                       (indicating)\n\t                Sit down!\n\t\n\t      For an instant, it looks like Spock will refuse. Then,\n\t      he complies but sits formally, rigidly. He ignores\n\t      McCoy totally.\n\n\t                              KIRK\n\t                You've reported that you felt\n\t                strong thought emotions. A\n\t                group of minds from a space\n\t                vessel? Could you make out any\n\t                plan, anything to do with\n\t                Earth?\n\n\t                              SPOCK\n\t                        (still formally)\n\t                Negative, Captain. I could sense\n\t                only what seemed an almost\n\t                omniscient pattern of perfect\n\t                logic. I can explain nothing\n\t                more; I understand nothing more.\n\n\t      Kirk is clearly disappointed -- and a bit uncomfortable\n\t      about what he must ask next. He exchanges a glance\n\t      with McCoy, then:\n\n\t                              KIRK\n\t                Also -- there was nothing in your\n\t                report about why you're here.\n\n\t                              SPOCK\n\t                That inquiry invades my personal\n\t                life, Captain.\n\n\t                              McCOY\n\t                Spock, we've already guessed why\n\t                you're here...\n\n\t                              KIRK\n\t                I inquired about you -- learned\n\t                you were studying with the\n\t                Masters...\n\n\t      Although Spock has been almost infuriatingly emotionless,\n\t      his expression shifts slightly. McCoy indicates this:\n\n\t                              McCOY\n\t                That flicker of emotion confirms\n\t                our guess. You failed.\n\t\n\t                              SPOCK\n\t                        (facing McCoy for\n\t                         the first time)\n\t                Your deductions do you credit,\n\t                Doctor... if your puerile\n\t                curiosity does not.\n\n\t                              McCOY\n\t                        (not in amusement)\n\t                And now, anger, Spock?\n\n\t      Spock looks straight ahead -- his face instantly com-\n\t      posed to almost total blankness.\n\n\t                              SPOCK\n\t                        (beat; nods)\n\t                I still contain fragments of my\n\t                human half.\n\t\n\t                              KIRK\n\t                And whatever you sensed out here....\n\n\t                              SPOCK\n\t                 ... is my only hope of accomplishing\n\t                what the Masters could not.\n\n\t                              McCOY\n\t                If you achieve perfect logic, Spock,\n\t                you'll pay a price. It's given\n\t                your planet ten thousand years of\n\t                peace, but no poetry's been written\n\t                since then, no music.\n\n\t      Spock has come to his feet fast - but Kirk is on his\n\t      feet too, confronting him. During which:\n\n\t                              KIRK\n\t                Let it drop, Bones.\n\t                        (to Spock)\n\t                You are my Science Officer -- I'll\n\t                expect an immediate report on\n\t                anything further you learn or sense\n\t                from here on.\n\n\t                              SPOCK\n\t                I have accepted service here as\n\t                a Starfleet officer... sir.\n\n\t                              KIRK\n\t                        (nods)\n\t                I know this has been painful, Spock.\n\t                For me too. Thank you.\n\n\t      Spock EXITS. Kirk and McCoy exchange a troubled look,\n\t      then EXIT too as CAMERA CENTERS AGAIN ON OBSERVATION\n\t      WINDOW, the view of space there.\n\n\t157   OMITTED                                                    157 \n\t  -                                                                - \n\t159                                                              159\n\n\t  159A   INT. BRIDGE - CLOSE ON CHEKOV'S HAND                      159A\n\n\t      pushing red alert. The ALERT SOUNDS; the red lights\n\t      begin FLASHING.\n\n\t                              CHEKOV'S VOICE\n\t                Red alert! Red alert!\n\n\t160   BRIDGE ANGLE - INCLUDING MAIN VIEWER                       160\n\n\t      All regulars in position (different uniforms), extra\n\t      CREW hurrying in from elevators to man the remainder\n\t      of the console positions. Decker is making a bridge\n\t      circuit.\n\n\t                              KIRK\n\t                Full mag on viewer!\n\n\t      Sulu hits a control -- viewer seems to ZOOM AHEAD and\n\t      in the distance we SEE a point of light which grows\n\t      into the LUMINESCENT CLOUD. The same as seen by the\n\t      Klingons and Starfleet's Epsilon Nine station. Myster-\n\t      ious, beautiful, and menacing.\n\n\t                              KIRK\n\t                        (continuing)\n\t                Linguacode?\n\n\t                              UHURA\n\t                Continuing friendship messages on\n\t                all frequencies, sir.\n\n\t                              CHEKOV\n\t                All decks and divisions confirm\n\t                status red.\n\n\t                              SPOCK\n\t                        (flat, impassive)\n\t                We are being scanned, Captain.\n\n\t161   ANOTHER ANGLE - ACROSS KIRK (AND DECKER) TO SPOCK          161\n\n\t      as Kirk whirls toward Spock's station, calls out:\n\n\t                              KIRK\n\t                Do not return scan, Mr. Spock!\n\t                It may be misinterpreted as\n\t                hostility!\n\n\t                              SPOCK\n\t                Intruder scans emanate from\n\t                the exact cloud center.\n\t                Energy of a type entirely un-\n\t                known to me.\n\n\t                              UHURA\n\t                       (after a moment)\n\t                No response to friendship\n\t                messages, Captain.\n\n\t                              CHEKOV\n\t                Should I go to battle stations,\n\t                sir.\n\n\t                              KIRK\n\t                Negative, We'll take no prov-\n\t                ocative action.\n\n\t      Decker has reacted sharply, disapprovingly, to this:\n\n\t                              DECKER\n\t                Recommend defensive posture,\n\t                Captain: Screens and shields.\n\n\t                              KIRK\n\t                No...\n\t                        (pause)\n\t                ... that could also be misinter-\n\t                preted as hostile, Mr. Decker.\n\t                        (to Spock)\n\t                Cloud composition, Mr. Spock?\n\n\t                              SPOCK\n\t                Twelve power energy field --\n\n\t                              SULU\n\t                        (in disbelief)\n\t                -- twelve power?!\n\n\t                              DECKER\n\t                        (urgently)\n\t                Captain, we've seen what their\n\t                weapons can do. Shouldn't we \n\t                take every possible precaution -- ?\n\n\t                              KIRK\n\t                Mr Decker....\n\n\t                              SPOCK\n\t                        (interrupting)\n\t                Captain, I suspect there's an\n\t                object at the heart of that cloud.\n\n\t                              KIRK\n\t                        (cool)\n\t                Mr. Decker, I will not provoke \n\t                an attack, If that order isn't \n\t                clear to you...\n\n\t                              DECKER\n\t                        (interrupting in mid\n\t                         sentence)\n\t                Captain, as your Exec, it's my\n\t                duty to point out alternatives.\n\n\t      A moment of thought from Kirk.\n\t                              \n\t                              ILIA\n\t                Five minutes to Cloud boundary!\n\n\t                              KIRK\n\t                        (a look)\n\t                I stand corrected Mr. Decker.\n\t                        (toward Ilia)\n\t                Navigator, lay in a conic section\n\t                flight path into the cloud center;\n\t                bring us parallel to whatever\n\t                we find in there...\n\n\t162   FAVORING THE VIEWER (O)                                   162\n\n\t      The Cloud has now grown so large it DOMINATES THE\n\t      ENTIRE VIEWER. Sulu hits a button, reducing magnif-\n\t      cation. Immediately, the CLOUD diminishes in size --\n\t      but almost instantly begins GROWING AGAIN. Decker's\n\t      annoyance (with Kirk) suddenly seems to dissipate as\n\t      his total attention is diverted to the cloud.\n\n\t  162A   ANOTHER ANGLE - SPOCK, DECKER AND KIRK                    162A\n\n\t      Decker turning to Spock\n\n\t                              DECKER\n\t                That measures twelve power?\n\t                Ten thousands of starships couldn't \n\t                generate that much...\n\t\n\t      Decker trails his words, realizing that Spock isn't\n\t      hearing a word. Spock's attention is on the O.S. main\n\t      viewer, totally absorbed by something he's feeling.\n\t      He is slowly rising from his seat, stepping forward --\n\t      Kirk becomes conscious of this, turns and sees Spock's\n\t      strange expression. Before he can speak:\n\n\t                              SPOCK\n\t                They have... they have been\n\t                communicating with us. I sense\n\t                ... puzzlement. Why have we\n\t                not replied?\n\n\t                              KIRK\n\t                Communicated with us how?\n\n\t      Spock shakes his head... then reacts as if sensing or\n\t      theorizing something further. He turns, moves quickly\n\t      to his console, begins there as if searching for something.\n\t      Interrupted by another ALARM KLAXON.\n\n\t                              DECKER\n\t                Signal medical alert, Mister\n\t                Chekov!\n\n\t                              COMPUTER VOICE\n\t                Incoming fire. Ahead. Zero, \n\t                ... mark, zero.\n\t                Incoming fire. Ahead. Zero,\n\t                mark, zero.\n\n\t163   FULL ON THE MAIN VIEWER (O)                                163\n\n\t      showing a WHIPLASH ENERGY BOLT streaking from the\n\t      Cloud!\n\n\t                              KIRK (O.S.)\n\t                Forcefields now...! Deflectors\n\t                up full!\n\t                              SULU (O.S.)\n\t                Commencing evasive\n\t                maneuvers... !\n\n\t      Bridge begins to tilt.\n\n\t164   REVERSE ANGLE                                              164\n\n\t                              CHEKOV\n\t                Forcefields and deflectors up\n\t                full, Captain.\n\n\t165   EXT. SPACE - ENTERPRISE (S)                                165\n\n\t      The WHIPLASH ENERGY BOLT speeds toward the Enterprise,\n\t      which veers sharply away now -- but WHIPLASH FOLLOWS.\n\n\t166   INT. BRIDGE AND VIEWER (O)                                 166\n\n\t      With the WHIPLASH ENERGY BOLT on the main viewer,\n\t      closer and closer -- heading straight-on for the Star-\n\t      ship. From the Bridge a CACOPHONY OF VOICES AND\n\t      SOUNDS, but all organized and disciplined with the\n\t      BRIDGE LIGHTING DIMMING and then as though traveling \n\t      the last short distance (actually several million\n\t      miles) in the wink of an eye -- the WHIPLASH OF ENERGY\n\t      STRIKES. The bridge lights go out.\n\n\t      In the sudden darkness, the main viewer is all at once \n\t      a frantic, furious, pattern of GREEN-WHITE FLARING ENERGY,\n\t      accompanied by an EXPLOSIVE SHRILLING SOUND. It seems to \n\t      cling to the forcefields, the incredible energy of the          \n\t      forcefield barriers.\n\n\t167   FAVORING CHEKOV'S STATION (O)                              167\n\n\t      as a sheet of GREEN WHIPLASH ENERGY bursts from\n\t      Chekov's console -- a LASH of FLAME engulfs Chekov's\n\t      arm. Automatic fire control nozzles SPURT FOAM over\n\t      him as he falls twisting and groaning in pain. Ilia\n\t      reacts first, crossing quickly to assist Chekov --\n\t      Decker joins her, taking over Chekov's console.\n\n\t168   OMITTED                                                    168\n\n\t169   EXT. SPACE - THE ENTERPRISE UNDER ATTACK (S)               169\n\n\t      The SHEET OF WRITHING-GREEN ENERGY enveloping the\n\t      entire vessel, outlining it starkly. (And outlining,\n\t      too, the forcefield screens and deflectors -- batter-\n\t      ing at them, seeking some gap through which to\n\t      penetrate.)\n\n\t170   INT. BRIDGE - FAVORING THE VIEWER (O)                      170\n\n\t      The bridge still darkened, and on the viewer the WHIP-\n\t      LASH ENERGY splattering the entire viewing screen with\n\t      GREEN ENERGY BRILLIANCE, forcing all to shield their\n\t      eyes against the impossible glare.\n\n\t171   OMITTED                                                    171\n\t\n\t172   INT. ENGINEERING                                           172\n \n\t      A smoking panel BURSTS INTO A SHOWER OF SPARKS AND\n\t      FLAME, spewing over and past Scott and his crew.\n\n\t                              SCOTT\n\t                Bypass...! Alternate\n\t                Integrators!\n\n\t173   INT. BRIDGE AND VIEWER (O)                                 173\n\n\t      as, first on the viewer, the WHIPLASH ENERGY BOLT\n\t      EFFECT clings another moment then begins FADING. And\n\t      then it is gone. The bridge lights go on again.\n\t      Elevator doors open. Doctor Chapel and Medical Corps-\n\t      men arrive and cross immediately to where Ilia tends\n\t      to the injured Chekov.\n\n\t                              SULU\n\t                The new screens held...!\n\n\t                              SCOTT'S INTERCOM VOICE\n\t                Engineering to bridge; we cannot\n\t                hold full power on forcefields;\n\t                deflector power is down seventy\n\t                percent!\n\n\t  173A   CHEKOV'S STATION                                          173A\n\n\t      Over the following, we will HEAR Captain Kirk AD LIB\n\t      order; \"Divert auxiliary systems power to deflectors!\"\n\t      and SCOTT INTERCOM VOICE answer: \"All auxiliary power\n\t      to deflectors, sir.\" Meanwhile, Chapel and Corpsmen\n\t      giving medical treatment to Chekov who is in agony.\n\t      Chapel is about to give an injection.\n\n\t                              ILIA\n\t                No, I can stop his pain.\n\n\t      The Deltan woman takes Chekov's upper arm in both her\n\t      hands, kneading her fingers deep into nerve centers --\n\t      Chekov's pain begins to quickly recede and he is almost\n\t      startled by the sudden relief. Doctor Chapel, now\n\t      spraying plasti-skin on the burned hand and wrist,\n\t      gives Ilia a surprised, approving look and a flicker\n\t      of female friendship passes between the Deltan and\n\t      Earth woman. (setting up a later story point)\n\n\t174   CLOSE ON VIEWER (O)                                        174\n\n\t      The energy brilliance gone now, we can SEE the CLOUD\n\t      is very close -- the closest we have seen it yet, and\n\t      the Aurora effect is spectacular; a vast, dense blan-\n\t      ket of SPARKLING, FLARING COLOR.\n\n\t175   EMPHASIZING SPOCK                                          175\n\n\t      whirling abruptly in his chair, addressing Kirk:\n\n\t                              SPOCK\n\t                Captain, the Intruder has been\n\t                attempting to communicate! Now\n\t                placing their transmission on\n\t                the speaker...\n\n\t      Immediately, from the SPEAKER we HEAR a SHRILL, IN-\n\t      CREDIBLY FAST BEEP.\n\n\t                              SPOCK\n\t                        (continuing)\n\t                ... frequency more than one\n\t                million megahertz at such high\n\t                speed their entire message lasts\n\t                only a millisecond.\n\n\t  175A   ANOTHER ANGLE                                             175A\n\n\t      Chapel and Corpsman are assisting Chekov from the\n\t      bridge (we'll have SEEN that the remarkable plasti-\n\t      skin sprayed on his hand has completley covered the\n\t      ugly burn marks - he is even able to move his fingers\n\t      a bit). Ilia returns to her station -- a relief CREW\n\t      WOMAN takes over from Decker at Chekov's console.\n\n\t176   CLOSER ON SPOCK'S STATION                                  176\n\n\t      so we can SEE in more detail Spock's monitor -- various\n\t      oscillating waves, and HEAR more of the SHRILL BEEPS as \n\t      Spock manipulates his equipment, and continues:\n\n\t                              SPOCK\n\t                I suspect our messages were too\n\t                slow for them to be noticed.\n\t                        (touches a control)\n\t                Programming computer to send\n\t                linguacode at their rate.\n\n\t      Decker has hurried in to assist the science console.\n\t      Spock indicates a console area -- Decker works there --\n\t      Spock works another section of console buttons.\n\n\t177   EXT. SPACE - THE ENTERPRISE AND THE CLOUD (S)              177\n\n\t      The Cloud ever closer to the ship now, which is a mere\n\t      dot in space compared to the immensity of the energy-\n\t      seething, continuous color-exploding Cloud. And then,\n\t      suddenly, from the Cloud -- ANOTHER WHIPLASH ENERGY\n\t      BOLT. Bearing down upon the Enterprise.\n\n\t178   INT. BRIDGE - INCLUDING VIEWER                             178\n\n\t      where the oncoming WHIPLASH BOLT is SEEN emerging from\n\t      the Cloud. In the b.g., ALARM KLAXONS are SOUNDING, \n\t      alert lights flashing, etc\n\n\t                              SULU\n\t                Here it comes...!\n\n\t                             COMPUTER VOICE\n\t                Incoming fire. Ahead, zero, mark,\n\t                zero, point two. Incoming fire. \n\t                Ahead, zero, zero, mark, zero...\n\n\t                              KIRK\n\t                        (into intercom)\n\t                Engineering... what's happening\n\t                to our forcefields?!\n\n\t179   INT. ENGINEERING                                           179\n\n\t      Much frenetic activity here, previous damage being\n\t      repaired, the main shaft GLOWING BLUE-WHITE, ENGINES\n\t      THROBBING AT FULL POWER, and a harassed Scott at the\n\t      intercom:\n\n\t                              SCOTT\n\t                Systems are overloading, Captain!\n\t                Our shields cannot handle another\n\t                attack!\n\n\t180   OMITTED                                                    180\n\n\t181   EXT. SPACE - THE ENTERPRISE AND THE CLOUD (O)              181\n\n\t      The WHIPLASH BOLT streaking toward the ship.\n\n\t182   INT. BRIDGE                                                182\n\n\t                              KIRK\n\t                        (desperately)\n\t                Mr. Spock?\n\n\t                              ILIA\n\t                Impact in fifteen seconds...\n\n\t      Spock -- Decker assisting -- works frantically. Spock\n\t      is clearly dissatisfied, shakes his head tightly.\n\n\t                              KIRK\n\t                Transmit, Mr. Spock! Now!\n\n\t                              ILIA\n\t                Ten seconds....\n\n\t183   CLOSER ON SPOCK'S STATION                                  183\n\n\t      as Spock hits the \"transmit\" button, and we HEAR the\n\t      SHRILL BEEP SOUND (lasting but a fraction of a second),\n\t      and Decker calls to Kirk:\n\n\t                              DECKER\n\t                Transmitting...!\n\n\t                              ILIA'S VOICE\n\t                ... five seconds.\n\n\t184   ANGLE ON MAIN VIEWER (O)                                   184\n\n\t      where the WHIPLASH BOLT is now BRILLIANT, almost upon\n\t      us! Then the WHIPLASH ENERGY BOLT abruptly VANISHES.\n\t      In the blink of an eye, the entire EFFECT IS GONE.\n\n\t185   REACTIONS                                                  185\n\n\t      relief, incredulity.\n\n\t                              SPOCK\n\t                It appears that our message has\n\t                been understood, Captain.\n\n\t                              KIRK\n\t                        (to Uhura)\n\t                Any reply from them?\n\n\t                              UHURA\n\t                Negative, no reply, sir.\n\n\t                              KIRK\n\t                       (returning to Spock)\n\t                Spock, have you sensed anything\n\t                else?\n\n\t      Spock turns, gives the O.S. viewer a glance. Then he\n\t      shakes head.\n\n\t                              SPOCK\n\t                The 'puzzlement' I sensed was\n\t                fleeting... minor...\n\t                       (ponders, then)\n\t                ... as if carrying a sense of\n\t                our insignificance, Captain.\n\n\t                              KIRK\n\t                Our... 'insignificance'?\n\n\t      All have reacted to this; Kirk exchanges a look with\n\t      Spock who nods firmly. Then Kirk sees that both Decker\n\t      and Sulu are throwing him a questioning look. In b.g.\n\t      McCoy and Chapel have EXITED bridge with Chekov.\n\n\t                              SPOCK\n\t                We are obviously confronted by\n\t                a highly advanced mentality...\n\t                yet they cannot understand who\n\t                we are, or what we want.\n\n\t                              KIRK\n\t                But they understood our messages;\n\t                they broke off the attack.\n\n\t                              DECKER\n\t                They may have attacked only as\n\t                a warning to us, Captain. To\n\t                keep away.\n\n\t                              SPOCK\n\t                That would presuppose a feeling,\n\t                Commander... compassion. I sensed\n\t                no emotion, only...\n\t                        (reverentially)\n\t                ... pure logic.\n\n\t      Kirk peers at Spock hoping for some assistance on\n\t      the decision; but Spock merely peers back at him ex-\n\t      pressionlessly: the decision is Kirk's. Kirk faces\n\t      Spock one last beat, then turns and starts back to-\n\t      ward his chair, calling to Ilia.\n\n\t                              KIRK\n\t                Tactical plot on viewer.\n\n\t 185XC   ANGLE INCLUDING MAIN VIEWER (O)                          185XC\n\n\t      where the IMAGE of the \"powerfield Cloud: changes to a\n\t      tactical plot of Enterprise's conic flight path ap-\n\t      proach. It shows a large schematic of the Cloud itself\n\t      as well as a series of FAINTLY BLINKING schematics of\n\t      various recent positions and directional attitudes of\n\t      the Enterprise during its approach. These blinking\n\t      Enterprise schematics show that the starship has  gone\n\t      from a head-on approach to the Cloud into a (tech.\n\t      advice) skidding movement around the Cloud (the star-\n\t      ship always heading directly toward Cloud center),\n\t      with the last Enterprise positions now showing it ap-\n\t      roaching the Cloud from a quartering rear approach.\n\n\t 185XD   REVERSE ANGLE                                             85XD\n\n\t                              ILIA\n\t                Thirty seconds to Cloud\n\t                boundary...\n\n\t                              KIRK\n\t                Opinion, Mister. Spock?\n\n\t                              SPOCK\n\t                Recommend we proceede, Captain.\n\n\t                              KIRK\n\t                Mr. Decker... ?\n\n\t                              DECKER\n\t                I advise caution, Captain; we \n\t                can't withstand another attack.\n\n\t                              KIRK\n\t                That thing is twenty hours from\n\t                Earth. We know nothing about it yet.\t\n\n\t      Decker glances around, moves close to Kirk so only\n\t      Spock is able to overhear:\n\n\t                              DECKER\n\t                That's precisely the point, \n\t                Captain. We don't know \n\t                it will do. Moving into the\n\t                cloud -- at this time, is \n\t                an unwarranted gamble.\n\n\t                              KIRK\n\t                How do you define unwarranted,\n\t                mister?!\n\n\t                              DECKER\n\t                You asked my opinion, sir.\n\n\t      Kirk looks at him, then at Spock, who once more is\n\t      peering in momentary concentration at the viewer,\n\t      feels Kirk's gaze -- and turns to him, again expres-\n\t      sionlessly; it's up to Kirk.\n\n\t                              ILIA\n\t                Fifteen seconds to Cloud Boundary.\n\n\t                              KIRK\n\t                Viewer, standard ahead.\n\n\t 185XE   ANGLE TO INCLUDE VIEWER (O)                              185XE\n\n\t      Main viewer IMAGE reverts to the \"powerful cloud.\"\n\t      All peer in grim fascination at the cloud another\n\t      moment. Then:\n\n\t186   OMITTED                                                    186\n\n\t187   Kirk sits contemplating his next move. Once again, the     187\n\t      decision is his. He looks to the Viewer a moment, then:\n\t                    \n\t                              KIRK\n\t                       (to Helm)\n\t                Mr. Sulu, steady as she goes.\n\n\t                              SULU\n\t                Aye, sir.\n\n\t188   EXT. SPACE - ENTERPRISE                                    188\n\n\t      as the Enterprise slowly enters deeper toward the chamber \n\t      ahead. We SEE the sheer size of the Cloud as opposed to\n\t      that of the small ship now entering unknown territory.\n\n\t      As the Enterprise enters the Cloud:\n\n\t189   INT. BRIDGE - REACTIONS AT WHAT THEY ARE SEEING            189\n\n\t      On Viwscreen we SEE a vast array of IMAGES, spiralling \n\t      IMAGES, changing in size, shape, colour. Its walls \n\t      spinning and turning, looping and twisting, as the \n\t      Enterprise proceeds further Into the Cloud. \n\n\t      Amazed bridge crew members can do nothing but awe at \n\t      the sight before thier eye's. Even Spock has turned to \n\t      view the sight now illuminating the View screen. Kirk \n\t      sits pondering, amazed, thinking \"What comes next?\" \n\n\t  189A   EXT. SPACE - ENTERPRISE AND V'GER                         189A\n \n\t      Moving slowly through the maze of VISUAL'S seen from \n\t      the Main Viewer.\n\n\t190   INT. BRIDGE - INCLUDING THE VIEWER (O)                     190\n\n\t      as the CLOUD OBSCURES all now. Everyone gazes at the\n\t      viewer, almost mesmerized by the shifting violet power-\n\t      field displays.\n\n\t                              KIRK\n\t                        (staring at viewer,\n\t                         frustrated, awed)\n\t                No vessel could generate a \n\t                powerfield of this magnitude...\n\n\t                              SPOCK\n\t                Instruments fluctuating, Captain.\n\t                Patterns unrecognizable.\n\n\t                              SULU'S VOICE\n\t                Captain....!\n\n\t191   ANGLE ON SULU                                              191\n\n\t      Sulu peering toward O.S. main viewer, his eyes wide\n\t      with incredulity.\n\n\t192   OTHER REACTIONS                                            192\n\n\t      Crew peering at O.S. main viewer with expressions of\n\t      near disbelief. Similar reactions as Kirk and Decker\n\t      turn too, reacting to:\n\n\t193   WHAT THEY SEE ON MAIN VIEWER (O)                           193\n\n\t      (V'GER THEME MUSIC UP) The Cloud \"Aurora\" EFFECT\n\t      rapidly thinning -- in the \"eye of the hurricane\"\n\t      center of the Cloud is the object which has stunned\n\t      the entire bridge crew.\n\n\t      Rapidly growing in size -- already frighteningly huge.\n\t      Totally alien in look. Its enormous bulk is irrides-\n\t      cent, faintly glowing, suggesting that it is made up\n\t      of exotic combinations of matter, and energy far beyond\n\t      the scientific knowledge or ability of Earth's 23rd\n\t      Century technology. Menacing and yet strangely\n\t      beautiful, both at the same time.\n\n\t194   VARIOUS ANGLES ON THE BRIDGE CREW AND THE VIEWER           194\n\t  -                                                                -\n\t197                                                              197\n\t      The Object continues to GROW RAPIDLY IN SIZE as the\n\t      Enterprise continues moving toward it. Everyone is\n\t      awed; even Spock, from whom we discern an involuntary,\n\t      impressed reaction. Decker is with Spock at the\n\t      science console.\n\n\t                              DECKER\n\t                Incredible dimensions, Sir!\n\t                ... I make it as seventy-eight\n\t                kilometers in length...\n\n\t      All digest the dimensions, as:\n\n\t198   ANGLE ON THE BRIDGE ELEVATOR DOORS                         198\n\n\t      opening to admit McCoy and Chekov, whose face and hands\n\t      are taut with plastiskin applications. Seeing the\n\t      object on the viewer (O.S. at this ANGLE), Chekov's\n\t      eyes open with wide astonishment. He crosses quickly\n\t      to his weapons--defense station, his eyes on the\n\t      viewer. McCoy, eyes also fixed on the sight, moves\n\t      to Kirk's side.\n\n\t                              UHURA\n\t                It could hold a crew of tens\n\t                of thousands...!\n\n\t                              McCOY\n\t                Or just one thousand, ten \n\t                miles tall.\n\n\t                              KIRK\n\t                Evaluation, Mister Spock?\n\n\t199   ACROSS KIRK TO SPOCK                                       199\n\n\t      (This will be the first time we've seen Spock dislay-\n\t      ing a definite reaction, almost an emotion.) So\n\t      engrossed is Spock in the main viewer IMAGE that he\n\t      appears not to have heard Kirk, whose AD LIBS a sharp\n\t      \"Mr. Spock...!\" Spock looks absently at Kirk an\n\t      instant, then:\n\n\t                              SPOCK\n\t                        (awed; compelled)\n\t                That vessel is generating a\n\t                forcefield measurably greater\n\t                than the radiation of the Earth's\n\t                sun.\n\n\t                              KIRK\n\t                        (turns to Uhura)\n\t                Transmit image of the Alien to\n\t                Starfleet; advise we are attempting\n\t                further communication.\n\n\t                              UHURA\n\t                        (interrupting)\n\t                Unable to make contact with\n\t                Starfleet. Our transmissions\n\t                out of the Cloud are being\n\t                reflected back.\n\n\t                              ILIA\n\t                Distance to object now seventy-\n\t                thousand kilometers...\n\n\t                              SULU\n\t                        (turning; concerned)\n\t                We're closing in on it rapidly,\n\t                Captain.\n\n\t      Concern reflected on the faces of others too. Kirk\n\t      considers his next move.\n\n\t200   OMITTED                                                    200\n\t  -                                                                -\n\t203                                                              203\n\n\t204   EXT. SPACE - ENTERPRISE AND ALIEN                          204\n\n\t      CAMERA TRAVELING WITH ENTERPRISE as it moves on a\n\t      parallel--closing course -- Alien continues to GROW\n\t      IN SIZE. Although it already seems an impossibly\n\t      large vessel compared to the Enterprise, in reality\n\t      they are still tens of thousands of kilometers apart;\n\t      the incredible size of the Alien is nowhere near being\n\t      realized yet.\n\n\t  204A   INT. BRIDGE - INCLUDING VIEWER                            204A\n\n\t      Tension high as -- the Alien now appears so close that\n\t      its IMAGE MORE THAN FILLS VIEWER. Considerable\n\t      tension of bridge -- crew members, throwing nervous\n\t      looks from viewer to Kirk. How much closer?!\n\n\t                              KIRK\n\t                Reduce magnification. Factor\n\t                4, Mr. Sulu.\n\n\t                              SULU\n\t                        (uneasy)\n\t                We're already two settings\n\t                below that, sir.\n\n\t                              KIRK\n\t                        (reacts, then)\n\t                Adjust parallel course, Navigator.\n\t                Bring us in to one hundred\n\t                kilometers distance.\n\n\t      Very nervous looks now directed toward Kirk. Even\n\t      Spock gives him a glance, a raised eyebrow.\n\n\t205   EXT. SPACE - CAMERA TRAVELING WITH ENTERPRISE              205 \n\n\t      The Alien Object appears A DOZEN TIMES LARGER THAN\n\t      ENTERRISE and still GROWING IN SIZE.\n\n\t      We begin to SEE Alien exterior detailing which had\n\t      not even been suspected at a longer distance.\n\n\t      The Enterprise is now quartering in toward the\n\t      Intruder, coming closer and closer. The Alien\n\t      vessel is still GROWING IN SIZE -- more and more,\n\t      its exterior appears to be made of substances never\n\t      before seen by a human eye -- substances considered\n\t      possible only in the wildest flights of scientific\n\t      theory -- plasma-matter, energy fields diamond--hard\n\t      in their power, solid sheets of subatomic particles,\n\t      crystalline-lace patterns which seem capable of\n\t      shifting their nature and rearranging themselves.\n\n\t  205A   ANGLE ON INTRUDER                                         205A\n\n\t      This time, the Enterprise travels on away from us, as\n\t      its course takes it angling nearer and nearer the\n\t      gigantic Alien Intruder -- the Starship dwindling in\n\t      size, growing smaller, smaller, smaller... until it\n\t      is a tiny dot compared to the enormity of the Alien\n\t      vessel.\n\n\t206   INT. BRIDGE - VIEWER (O)                                   206\n\n\t      We are coming alongside the mid-section of the Alien\n\t      vessel, now so huge that only a small section of it\n\t      now completely fills main viewer frame.\n\n\t                              SULU\n\t                One hundred kilometers...\n\n\t                              KIRK\n\t                Hold relative position here...\n\n\t      Kirk's voice is blotted out by a DEAFENING, SHRILL-\n\t      ING SOUND, accompanied by a multi-hued point of LIGHT\n\t      which EXPLODES into BLINDING INTENSITY, obscuring\n\t      everything for an instant. Overlapping this action,\n\t      we HEAR:\n\n\t                              COMPUTER'S VOICE\n\t                Intruder alert...!  Intruder\n\t                alert!\n\n\t      Continues.\n\n\t207   OMITTED                                                    207\n\n\t208   THE PLASMA ENERGY PROBE (O)                                208\n\n\t      The BLINDING LIGHT FADES and in its lace we SEE a\n\t      strange \"entity\" shocking us with its frightening\n\t      appearance and its ugly-sounding THROBBING HUM of\n\t      power. It is about seven feet tall and resembles a\n\t      \"blob\" of raw energy in shifting patterns and colors\n\t      of deep, ugly hues of upper spectrum violet. Yet,\n\t      it looks strangely alive. At the end of the \"tendril\"\n\t      (of light) is an \"eye\" (a small multi-colored device)\n\n\t209   CREW REACTIONS -- ELEVATORS IN B.G. (O)                    209\n\n\t      The bridge crew reacting hard, shocked and shaken --\n\t      the THROBBING SOUND of the Alien thing intensifies\n\t      as it begins to move across the bridge. Suddenly, in\n\t      b.g., an elevator door snaps oen and two SECURITY\n\t      MEN burst onto the bridge, phasers drawn. Chekov\n\t      shouts warningly at the Men:\n\n\t                              CHEKOV\n\t                No weapons...!\n\n\t      But Chekov is too late: First Security Man FIRES --\n\t      the BLAST harmlessly absorbed by the Probe which emits\n\t      a SCREECHING nerve-grating SOUND --- sends out a SMALL\n\t      WHIPLASH ENERGY BOLT which instantly envelopes First\n\t      Security Man in a PURPLE GLOW (of implosion). Second\n\t      Security Man has almost lifted his phaser -- but now\n\t      carefully, slowly is moving his hand away from his\n\t      weapon.\n\n\t210   CLOSER - THE SECURITY MEN (O)                              210\n\n\t      PURPLE GLOW FADES, the First Security Man has simply\n\t      vanished.\n\n\t  210A   FULL SHOT - BRIDGE                                        210A\n\n\t      Chekov, like the others, horrified, flips a switch\n\t      and the COMPUTER-VOICE (\"Intruder Alert\") goes OFF.\n\t      At the same time Chekov speaks into his intercom:\n\n\t                              CHEKOV\n\t                Security... do not send further\n\t                teams!\n\n\t      The Probe is sending out snake-like tendrils to the\n\t      various consoles on the bridge.\n\n\t      These tendrils lash out in a cobra-strike movement,\n\t      the tendril-head seeming to enter into the console\n\t      affected -- at which time all monitors and instrument\n\t      lights there come ON as if the Probe is \"reading\"\n\t      each console function. The crew carefully stays clear\n\t      of the tendrils.\n\n\t      Spock has risen, moving to Kirk's side as he slowly\n\t      brings his tricorder up, very carefully extracting\n\t      its tiny sensor and aiming it at the probe.\n\n\t                              CHEKOV\n\t                        (shaken)\n\t                No intruder readings on other\n\t                decks, Captain...\n\t                        (to Spock)\n\t                Can that be one of their crew?\n\n\t                              SPOCK\n\t                        (quiet)\n\t                A probe from their vessel...\n\t                        (to Kirk)\n\t                A plasma-energy combination...\n\n\t      Meanwhile, the probe is now hovering near Chekov who\n\t      sits frozen, fists clenched, jaw tight.\n\n\t                              DECKER\n\t                Don't interfere with it...!\n\n\t                              CHEKOV\n\t                Absolutely, I will not interfere!\n\n\t  210B   ANGLE INCLUDING SPOCK'S CONSOLE (O)                       210B\n\n\t      as the \"probe\" withdraws an energy-tendril from one\n\t      bridge station and \"inserts\" it into another console.\n\n\t                              KIRK\n\t                No one interfere...! It doesn't\n\t                seem interested in us -- only\n\t                the ship...!\n\n\t      Kirk's words are never completed as suddenly all the\n\t      energy tendrils withdraw from all consoles and a\n\t      larger, more powerful-looking tendril lashes out,\n\t      snaking into the science console complex.\n\n\t  210C   CLOSER ON SCIENCE CONSOLE                                 210C\n\n\t      Where, also immediately, all the console and computer\n\t      lights are suddenly flashing wildly, rapidly --\n\n\t      -- There is an incredibly fast EXCHANGE OF HIGH-PITCHED\n\t      BEES -- the computer obviously in unauthorized commu-\n\t      nication with the probe!\n\n\t                              KIRK\n\t                Computer off!\n\n\t                              DECKER\n\t                It's taken control of the\n\t                computer...!\n\n\t                              KIRK\n\t                It's running our records!\n\t                Starfleet strength, Earth\n\t                defenses...\n\n\t      As Decker moves to the main power control, Spock now\n\t      steps in, his Vulcan strength easily brushing Kirk and\n\t      Decker aside. Spock clasps his fists above his head,\n\t      brings it down in a SHATTERING BLOW on the console. It\n\t      splits open! As the bridge lights dim even more, and\n\t      as the science console shorts itself out -- and off,\n\t      Decker confronts Spock:\n\n\t                              DECKER\n\t                We could have cut it off at the\n\t                main computer...\n\n\t                              SPOCK\n\t                This served the purpose.\n\n\t      Kirk has been giving Spock a puzzled look -- Spock now\n\t      turns abruptly, and:\n\n\t  210D   ANOTHER ANGLE (O)                                         210D\n\n\t      as Spock, in stepping back, accidentally brushes the\n\t      probe's energy tendril -- a FLASH OF LIGHT at the\n\t      contact point sends Spock sinning under the rail and\n\t      to the floor near Ilia. The probe's energy-tendril\n\t      has withdrawn from the darkened science console, hov-\n\t      ers high over the dazed Spock as if angrily seeking\n\t      the reason for the break in its computer contact.\n\t      Spock starts to rise.\n\n\t                              ILIA\n\t                Mr. Spock, don't move...!\n\n\t      Decker steps toward her, AD LIBBING a grim \"Ilia...!\"\n\t      But he has no chance as:\n\n\t211   OMITTED                                                    211\n\t  -                                                                -\n\t219                                                              219\n\n\t220   CLOSER ON ILIA (O)                                         220\n\n\t      The Probe hovers over her, its whole mass seemingly\n\t      about to envelope her with a single tendril extended\n\t      toward her, somehow freezing her into immobility -\n\t      and then the entire Probe DISSOLVES IN A BLINDING \n\t      FLASH OF WHITE, obscuring Ilia. Almost instantly\n\t      the WHITE FLASH FADES -- but Ilia has vanished -- her\n\t      tricorder clattering to the deck.\n\n\t221   OMITTED                                                    221\n\n\t222   ACROSS THE NAVIGATOR'S STATION TO KIRK AND DECKER          222\n\n\t      helpless, shocked, gazing at the place Ilia was --\n\t      but which is now empty.\n\n\t                              DECKER\n\t                        (to Kirk, quiet \n\t                         fury)\n\t                This is how I define unwarranted!\n\n\t      And almost at the same moment a new BRIDGE ALARM\n\t      SIGNAL.\n\n\t223   OMITTED                                                    223\n\t  -                                                                -\n\t232                                                              232\n\n\t233   The ALARM still sounding as from the giant alien ves-      233\n\t      sel, we SEE STRANGE, OPAQUE ENERGY PATTERNS STREAKING\n\t      TOWARD US. Kirk vaults to the command chair, lunges\n\t      for controls, as Decker races to the weapons-defense\n\t      console.\n\n\t                              DECKER\n\t                       (voice amplified)\n\t                The ship is under attack...!\n\t                Man all defensive stations...!\n\t                                           \n\t                              KIRK\n\t                Forcefields, full remaining\n\t                strength...! Total reserve!\n\n\t      Appropriate ALARM KLAXONS, and COMPUTER VOICES begin\n\t      SOUNDING, and all this is lost in a SUDDEN SHRILLING\n\t      SOUND (a constant, high-pitched tone). For a moment\n\t      the energy patterns are prominent on the viewer --\n\t      and then the PATTERNS VANISHED and the SHRILL SOUND\n\t      FADES -- and:\n\n\t234   FAVOR THE VIEWER (O)                                       234\n\n\t      showing V'ger GROWING RAPIDLY IN SIZE. The Enterprise\n\t      is being pulled along the length of the big ship,\n\t      toward its \"prow.\"\n\n\t                              SPOCK\n\t                Captain, we have been seized\n\t                by a tractor beam...!\n\n\t                              KIRK\n\t                        (to Decker)\n\t                Get someone up here to take\n\t                the Navigator's station...!\n\t                        (into intercom)\n\t                Engineering... full emergency\n\t                power!\n\n\t                              DECKER\n\t                        (into intercom)\n\t                Chief Difalco to the bridge;\n\t                on the double!\n\n\t  234A   ENGINEERING                                               234A\n\n\t      in a state of controlled chaos, all personnel at their\n\t      stations, the Engine CORE GLOWING. Scott is working\n\t      his controls, speaking into the intercom:\n\n\t                              SCOTT\n\t                Going to full emergency...\n\t                        (studying readings)\n\t                But Captain, if we don't break\n\t                free in fifteen seconds, she'll\n\t                burn up...\n\n\t  234B   INT. BRIDGE - FAVORING SPOCK                              234B\n\n\t      as Spock studies his readings, and:\n\n\t                              SPOCK\n\t                We cannot break free, Captain.\n\t                        (indicates monitors)\n\t                We do not have a fraction of\n\t                the power necessary.\n\t                    \n\t                              KIRK\n\t                        (into intercom)\n\t                Delay that order, Scotty...!\n\t                Disengage all main drive systems!\n\n\t      Spock peers in deep concentration at the Main Viewer,\n\t      trying to sense some clue. Kirk glances at him another\n\t      moment, then turns to the Main Viewer himself, watches\n\t      in frustrated helplessness.\n\n\t  235   EXT. THE ENTERPRISE BEING PULLED TOWARD V'GER (S)           235\n\n\t      the starship being pulled toward the giant as though\n\t      on a taut cable. As we MOVE CLOSER, we SEE still more\n\t      intricate details of the incredible Alien design.\n\n\t236   INT. BRIDGE - INCLUDING VIEWER (O)                         236\n\n\t      as Difalco arrives on the run, and Decker AD LIBS to\n\t      her, \"Assume Navigator's station, Chief...!\" Difalco,\n\t      bewildered, wants to ask what happened, but no time,\n\t      and she quickly sits at the post, begins orienting\n\t      herself. Meanwhile, Decker has begun an Executive\n\t      Officer's bridge circuit, assisting with various con-\n\t      soles. Kirk is glancing toward Spock who continues\n\t      concentrating on the Viewer, striving to comprehend\n\t      the myriad of thoughts he is sensing from he Aliens.\n\t      McCoy also arrives on the bridge, takes in the chaotic\n\t      scene, watches the Viewer grimly.\n\n\t237   OMITTED                                                    237\n\t  -                                                                -\n\t238                                                              238\n\n\t239   EXT. ENTERPRISE AND V'GER (S)                              239\n\n\t      At the forward end of the giant, an odd-shapped \"iris\"\n\t      begins opening menacingly. And it is frighteningly\n\t      obvious that the tractor beam is pulling the Enterprise\n\t      to the opening.\n\n\t240   INT. BRIDGE - INCLUDING VIEWER (O)                         240\n\n\t      showing the unusual \"iris\" now almost fully open as\n\t      Enterprise is drawn closer, closer -- through the\n\t      \"iris\" we now SEE (some of) V'ger's interior: a dark\n\t      void relieved only by strange flickering glows of dis-\n\t      tant ENERGY FIELD PATTERNS.\n\n\t      The crew reacts with understandable awe, apprehension,\n\t      curiosity, as:\n\n\t                              DECKER\n\t                Captain, suggest a maximum phaser\n\t                strike directly at the beam might\n\t                weaken it just enough for us to\n\t                break free --\n\n\t      Spock replies for Kirk: quickly, as though to make his\n\t      point convincingly:\n\n\t                              SPOCK\n\t                Break free to where, Commander...?\n\t                        (to Kirk)\n\t                Any show of resistance would not\n\t                only be futile, Catain...\n\n\t 240XA   ACROSS SPOCK TO KIRK (DECKER AND McCOY IN B.G.)          240XA\n\n\t      as Kirk reacts somewhat curiously to Spock's remark,\n\t      but it is Decker who articulates it:\n\n\t                              DECKER\n\t                        (troubled; suspicious)\n\t                We don't know that, Mr. Spock.\n\t                Why are you opposed to trying?\n\n\t                Before Spock can reply:\n\n\t                              UHURA\n\t                They're pulling us inside...!\n\n\t      All face the Viewer again, react, with McCoy who has\n\t      been observing all these reactions now galvanized\n\t      into action:\n\n\t                              McCOY\n\t                        (to Chekov)\n\t                Medical observers to all decks!\n\n\t      And he hurries toward the elevators, CAMERA WITH HIM\n\t      a moment, then SWINGING BACK TO:\n\n\t  240A   PAST KIRK TO VIEWER (O)                                   240A\n\n\t      Kirk staring at the viewer -- the \"iris\" now fully open\n\t      so that the exterior of V'ger is no longer visible --\n\t      and all we can SEE is the monstrous void dead ahead,\n\t      which is looming faster and larger before our eyes.\n\t      And now we are inside.\n\n\t241   OMITTED                                                    241\n\t  -                                                                -\n\t243                                                              243\n\n\t244   EXT. ENTERPRISE AND V'GER - AT THE \"IRIS\" (S)              244\n\n\t      Enterprise now being pulled past the opening -- into\n\t      the ship proper. Now we can SEE that the dark void\n\t      is actually a vast chamber, dimly and intermittently\n\t      lit by POWERFIELDS appearing and vanishing along the\n\t      vessel's inner walls, which are miles away in the \n\t      distance. And here and there in the chamber gigantic\n\t      ENERGY DISPLAYS erupt briefly with a certain symmetry\n\t      that suggests they must be part of V'ger's ower or\n\t      control systems.\n\n\t245   INT. BRIDGE - INCLUDING VIEWER (O)                         245\n \n\t      Kirk peering awed at the Viewer, the incredible sight\n\t      of the chamber -- suddenly glances up to see that\n\t      Spock is standing beside him -- Decker nearby, turns\n\t      to Spock:\n\n\t                              DECKER\n\t                        (to Spock)\n\t                Why bring us inside? Not to\n\t                destroy us; they could have \n\t                done that outside.\n\n\t                              KIRK\n\t                They could have many ways of\n\t                destroying things, Mr. Decker.\n\n\t                              SPOCK\n\t                        (peering at Viewer)\n\t                Something about us puzzles them...\n\t                perhaps even concerns them.\n\n\t  245A   ANGLE ON UHURA                                            245A\n\n\t      Reacting to a console reading:\n\n\t                              UHURA\n\t                Captain, photic-sonar readings\n\t                indicate the aperture is closing;\n\t                we're trapped, sir...!\n\n\t246   EXT. THE ENTERPRISE ENTERING V'GER (S)                     246\n\n\t      The starship is pulled inside, the \"iris\" is closing\n\t      behind it.\n\n\t247   INT. BRIDGE - FAVORING THE VIEWER (O)                      247\n\n\t      The viewer image changing from the huge dark chamber,\n\t      rear angle shot, showing the \"iris\" closing.\n\n\t                              SULU\n\t                Reverse angle on the viewer,\n\t                Captain.\n\n\t      On the viewer the final glimmer from exterior space\n\t      as the \"iris\" closes completely.\n\n\t248   REACTIONS                                                  248\n\n\t      All eyes on the viewer, CAMERA FINDING ONE FACE AFTER\n\t      ANOTHER, the reality of the situation etched into\n\t      each face. Then:\n\n\t  248A   FAVORING KIRK                                             248A\n\n\t      As Spock turns from a reading:\n\n\t                              SPOCK\n\t                The tractor beam has released\n\t                us, Captain.\n\n\t                              DIFALCO                   \n\t                Confirmed: Vessel is floating\n\t                free. No forward momentum.\n\n\t                              KIRK\n\t                Viewer ahead.\n\n\t                              SULU\n\t                Viewer ahead, sir.\n\n\t  248B   INSERT - MAIN VIEWER                                      248B\n\n\t      Ahead, the cavernous interior of V'ger.\n\n\t  248C   BACK TO SHOT                                              248C\n\n\t      Kirk eying the main viewer -- Decker watching Kirk.\n\n\t                              KIRK\n\t                Maneuvering thrusters, Mr.\n\t                Sulu; ahead one third.\n\t                        (to Spock)\n\t                Full sensor scan, Mr. Spock;\n\t                they can't expect us not\n\t                to look them over now!\n\n\t                              SULU\n\t                        (manipulating controls)\n\t                Thrusters ahead, one third.\n\n\t                              SPOCK\n\t                        (manipulating\n\t                         controls)\n\t                Commencing sensor scans.\n\n\t      Kirk rises, goes to Spock's station.\n\n\t249   INT. V'GER ENTRANCE CHAMBER - ENTERPRISE (S)               249\n\n\t      The Enterprise moving slowly forward in this vastness,\n\t      its running lights merely specks of light, candles in\n\t      the darkness. In the distance those occasional ERUPT-\n\t      ING POWER DISPLAYS in distant locations, sizes, shapes\n\t      and patterns.\n\n\t250   INT. BRIDGE - INCLUDING MAIN VIEWER (O)                    250\n\n\t      showing another persective of the above, and further\n\t      away GLOWING ENERGY FIELDS dimly illuminating the alien\n\t      ship's walls -- miles away. Strange semi--solid LIGHT\n\t      SHAPES (some are \"sensor-bee\" swarms) traverse the dark-\n\t      ness in random directions. But in the distance ahead,\n\t      there seems to be an opening to another chamber.\n\n\t                              SULU\n\t                        (of Viewer)\n\t                Something ahead, sir; looks\n\t                like another area...\n\t                        (reacts)\n\t                It's closing up...!\n\n\t      Sulu is indicating what appears to be a lace-bulwark of\n\t      POWERFIELD PATTERNS closing off the \"chamber\" in the\n\t      distance ahead. Kirk, from the Science Station calls\n\t      out:\n\n\t                              KIRK\n\t                Hold station...!\n\n\t                              SULU\n\t                        (manipulating\n\t                         controls)\n\t                Thrusters at station keeping...\n\n\t251   ANGLE EMPHASIZING SPOCK                                    251\n\n\t      at his Science consoles, working rapidly, shifting from\n\t      one set of controls to another. Now he hits a master\n\t      control -- his console monitors FLASH, then go dark.\n\n\t                              SPOCK\n\t                Captain...\n\n\t      Spock brings a monitor IMAGE ON again, indicates a\n\t      (Povill) pattern showing a line hitting something,\n\t      then reversing direction.\n\n\t                              SPOCK\n\t                        (continuing)\n\t                All scans are being reflected\n\t                back, Captain. Our sensors are\n\t                useless.\n\n\t  251A   ACROSS THEM TO THE MAIN VIEWER                            251A\n\n\t      Kirk reacts with disappointment, indicates the main\n\t      viewer.\n\n\t                              KIRK\n\t                Have you been able to analyze\n\t                any of this...?\n\n\t                              SPOCK\n\t                       (voice increasingly\n\t                        reverential)\n\t                I believe the light flares to be\n\t                energy fields -- undoubtedly part\n\t                of the vessel's inner mechanism.\n\t                A technology so incredibly\n\t                sophisticated that I cannot --\n\n\t                              COMPUTER VOICE\n\t                        (overlapping)\n\t                Intruder Alert! Intruder\n\t                Alert..!\n\t                        (continues)\n\n\t252   OMITTED                                                    252\n\t  -                                                                -\n\t253                                                              253\n\n\t254   ANGLE ON CHEKOV                                            254\n\n\t      Reacting to a console reading:\n\n\t                              CHEKOV\n\t                Deck four, Captain; Officers'\n\t                Quarters...!\n\n\t                              KIRK\n\t                        (to Chekov)\n\t                Have a security team meet me at\n\t                Deck Four main elevator!\n\n\t      A moment's reaction from all at this, Kirk hurrying\n\t      toward elevator, calling:\n\n\t                              KIRK\n\t                        (continuing)\n\t                Take the conn, Mr. Decker:\n\t                Hold present position...\n\t                        (gesturing Spock\n\t                         to join him)\n\t                Spock...\n\n\t      And Spock rises, joins Kirk and they hurriedly exit,\n\t      the CAMERA SWINGING BACK to Decker, his perplexed con-\n\t      cern (because of Ilia).\n\n\t  254A   INT. ILIA'S CABIN - THE SONIC SHOWER                      254A\n\n\t      Where we SEE, behind the translucent stall door, what\n\t      is unmistakably the form of the NUDE FEMALE.\n\n\t255   INT. ILIA'S CABIN - KIRK                                   255\n \n\t      entering, Spock slightly behind him - and one Security\n\t      Guard. Kirk glances around the room, now glances at\n\t      the shower area and reacts as he sees the NAKED FORM.\n\t      The others react similarly, even Spock cannot help re-\n\t      pressing an expression of surprise. A moment's uncer-\n\t      tainty as Kirk peers at them, then he steps to the\n\t      stall door, hesitates another instant -- then slides\n\t      the door open.\n\n\t      (NOTE: Arrange lighting for bizarre, mysterious effect.)\n\n\t      Kirk's eyes cannot believe what he is seeing:\n\n\t  255A   \"ILIA\"                                                    255A\n\n\t      standing in the sonic mist, naked but for a small\n\t      multi-colored button embedded in her throat. As she\n\t      looks at Kirk -- and the others -- the men peer back\n\t      at her, speechless.\n\n\t                              \"ILIA\"\n\t                I have been programmed by V'ger\n\t                to observe and record normal\n\t                functioning of the carbon-based\n\t                units infesting USS ENTERPRISE.\n\n\t      Kirk peers at her another nonplussed moment, then leans\n\t      into the shower to touch a control, his eyes fixed on\n\t      the lovely body behind the mist. He punches in a three\n\t      digit code. Immediately a HUMMING SOUND emanates from\n\t      the shower stall, Kirk closing the door, but 'Ilia\"\n\t      remaining inside.\n\n\t256   ACROSS KIRK AND THE OTHERS TO THE SHOWER STALL             256\n\n\t      The HUMMING SOUND just now reaching a gentle crescendo\n\t      -- through the translucent door you can see COLORS\n\t      ENVELOPING \"ILIA'S\" FORM. And now the SOUND STOPS.\n\t      \"Ilia\", attired in a leisure robe, steps from the stall,\n\t      into the room. She stands facing Kirk, her face impas-\n\t      sive, eyes unblinking. He looks her back a moment,\n\t      then glances at Spock, who is gazing at \"Ilia\" in abso-\n\t      lute fascination. Kirk addresses her:\n\n\t                              KIRK\n\t                Who is...'V'ger'...?\n\n\t                              \"ILIA\"\n\t                V'ger is that which programmed me.\n\n\t                              KIRK\n\t                Is V'ger the Captain of the alien\n\t                vessel?\n\n\t  256A   ANGLE ON THE DOOR - McCOY                                 256A\n\n\t      rushing in, concerned:\n\n\t                              McCOY\n\t                Jim, what's --\n\n\t      At the sight of 'Ilia\", McCoy's words die in his throat\n\t      -- and his trained eyes have instantly told him some-\n\t      thing is awry. He unslings his tricorder, aims the\n\t      sensor unit at \"Ilia\". As he reads his instruments, his\n\t      face reveals the results (incredulity, fascination).\n\t      Meanwhile, from the start:\n\n\t                              \"ILIA\"\n\t                V'ger is that which seeks the\n\t                Creator.\n\t                              McCOY\n\t                        (of \"Ilia\")\n\t                Jim, this is a mechanism...!\n\n\t      Kirk stares at McCoy, then at \"Ilia\" and realizes that\n\t      \"Ilia\" is indeed non-human. And quickly:\n\t\n\t                              KIRK\n\t                Where is Lt. Ilia?\n\t\n\t                              \"ILIA\"\n\t                That unit no longer functions.\n\t                I have been given its form to\n\t                more readily communicate with\n\t                the carbon-based units infesting\n\t                Enterprise.\n\n\t                              SECURITY GUARD\n\t                \"Carbon-based units\"...?\n\n\t                              McCOY\n\t                        (drily)\n\t                Humans, Ensign Lang: us.\n\t                        (continues tricorder \n\t                         exam, increasingly\n\t                         impressed)\n\n\t                              KIRK\n\t                        (to \"Ilia\")\n\t                Why does V'ger travel to\n\t                the third planet of the\n\t                solar system directly\n\t                ahead?\n\n\t                              \"ILIA\"\n\t                V'ger travels to the third \n\t                planet to find the Creator.\n\n\t      Stunned, disbelieving reactions as all four attempt to\n\t      digest this -- Spock gazing at \"Ilia\" with even more\n\t      rapt fascination. Kirk, bewildered, addresses the\n\t      others:\n\n\t                              KIRK\n\t                Find the Creator? What Creator?\n\t                Whose...!?\n\t                        (to \"Ilia\")\n\t                What does V'ger want of the\n\t                'Creator'... ?\n\n\t                              \"ILIA\"\n\t                To join with him.\n\n\t  256B   FAVORING SPOCK                                            256B\n\n\t      suddenly alert, addressing \"Ilia\":\n\n\t                    \n\t                              SPOCK\n\t                Join with the Creator... ? How?\n\n\t                              \"ILIA\"\n\t                V'ger and the Creator will become\n\t                One.\n\n\t                              SPOCK\n\t                Who is the Creator?\n\n\t                              McCOY\n\t                        (worried)\n\t                Mr. Spock, be careful.\n\n\t                              \"ILIA\"\n\t                The Creator is that which created\n\t                V'ger.\n\n\t                              KIRK\n\t                Who is V'ger?\n\n\t                              \"ILIA\"\n\t                V'ger is that which seeks the\n\t                Creator.\n\n\t      Another moment of total exasperation, frustration, during\n\t      which \"Ilia\" seems to be waiting politely, patiently for\n\t      any further questions. When none are forthcoming:\n\n\t                              \"ILIA\"\n\t                       (continuing; pleasant,\n\t                        bland)\n\t                I am ready to commence my\n\t                observations.\n\n\t                              SPOCK\n\t                        (fast; to McCoy)\n\t                Doctor, a thorough examination\n\t                of this probe might provide some\n\t                insight into those who manufactured\n\t                it, and how to deal with them.\n\n\t                              McCOY\n\t                Let's get her to sickbay.\n\n\t      And he grasps \"Ilia's\" arm to escort her. But is as\n\t      though he has seized cast iron: immovable. McCoy is\n\t      thrown off balance merely by 'Ilia's\" remaining sta-\n\t      tionary. She ignores McCoy, addresses Kirk:\n\n\t                              \"ILIA\"\n\t                I am programmed to observe and\n\t                record normal functioning\n\t                procedures of the carbon-based\n\t                units.\n\n\t  256B   Kirk glances at McCoy, who is totally bemused, but then   256B\n\t      Kirk quickly responds to \"Ilia\":\n\t                    \n\t                              KIRK\n\t                The examination is a normal\n\t                function.\n\n\t                              \"ILIA\"\n\t                        (a beat)\n\t                You may proceede.\n\n\t                              McCOY\n\t                        (carefully)\n\t                Thank you.\n\n\t257   CLOSE SHOT OF EXAMINING ROOM VIEWER (O)                    257\n\n\t      scanning a \"body\". PULL BACK TO SHOW McCoy, Chapel,\n\t      Kirk, Spock and Chekov -- standing over \"ILIA\" who lies\n\t      prone on the table, the physicians moving the scanner\n\t      over her.\n\n\t                              McCOY\n\t                        (from the start;\n\t                         indicating)\n\t                ... micro-miniature hydraulics,\n\t                sensors, molecule-sized multi-\n\t                processor chips... and look at\n\t                this...\n\n\t      In the b.g., Decker enters, grimly observes the proceed-\n\t      ings.\n\n\t                              CHAPEL\n\t                        (impressed)\n\t                An osmotic micro-pump... here\n\t                and here. Even the smallest\n\t                body functions are exactly\n\t                duplicated.\n\t                        (traces with finger\n\t                         on screen)\n\t                And every exocrine system is\n\t                here, too --\n\n\t      Chapel breaks off abruptly, noticing \"Ilia\" is peering\n\t      intently -- almost with a glimmer of recognition -- at\n\t      Decker. Slightly disconcerted, Chapel continues:\n\n\t                              CHAPEL\n\t                        (continuing)\n\t                -- even eye moisture.\n\n\t                              \"ILIA\"\n\t                        (peering at Decker)\n\t                Deck -- er.\n\n\t  257A   FAVORING SPOCK                                            257A\n\n\t      as everyone reacts to \"Ilia's\" utterance of Decker's\n\t      name. It seems to make the deepest impression on\n\t      Spock, confirming something he has suspected.\n\t                    \n\t                              SPOCK\n\t                        (to \"Ilia\")\n\t                Interesting. Not 'Decker-unit'?\n\n\t      \"Ilia\" continues peering at Decker with just a hint\n\t      of a puzzled frown, a glimmer of distant recognition.\n\t      It's the first time we've seen her expression look\n\t      anything but cool and bland. This results in the\n\t      quizzical rising of one of Spock's eyebrows.\n\n\t258   ANOTHER ANGLE                                              258\n\n\t      McCoy's examination now turns \"Ilia\" away from the\n\t      others. Spock quickly catches Kirk's and Decker's\n\t      attention, indicates an adjoining door -- they fol-\n\t      low him out of the room.\n\n\t259   INT. McCOY'S OFFICE                                        259\n\n\t      as Kirk, Spock and Decker enter, the door snapping\n\t      shut -- and Spock touching the electronic lock to\n\t      secure them. He faces the others:\n\n\t                              SPOCK\n\t                Captain... this probe may be a key\n\t                a key to the Aliens.\n\n\t                              DECKER\n\t                It's a programmed mechanism,\n\t                Mr. Spock...\n\n\t                              SPOCK\n\t                We have just seen that its body\n\t                duplicates our navigator in\n\t                precise detail. Suppose that\n\t                beneath its programming, the\n\t                real Ilia's memory patterns are\n\t                duplicated with equal precision.\n\n\t                              KIRK\n\t                They had a pattern to follow...\n\n\t                              SPOCK\n\t                        (nods)\n\t                ... they may have followed it\n\t                too precisely.\n\n\t                              KIRK\n\t                       (comprehending)\n\t                Ilia's memory, her feelings of\n\t                loyalty, friendship, obedience...\n\t                might all be there.\n\n\t  259A   ANGLE ON DECKER                                           259A\n\n\t      also comprehending, and not liking it one bit as Spock\n\t      and Kirk are both turning their attention to him.\n\n\t                              SPOCK\n\t                Exactly.\n\t                        (to Decker)\n\t                And you did have a 'relationship'\n\t                with Lieutenant Ilia, Commander.\n\n\t                              DECKER\n\t                That probe in there -- in a\n\t                different form now -- is the\n\t                same thing that killed Ilia!\n\n\t                              KIRK\n\t                Commander, we're locked in an\n\t                alien vessel, six hours from\n\t                Earth orbit, our only contact\n\t                with our captors is the probe.\n\t                If we can control it, persuade\n\t                it, use it in some way...\n\n\t      Interrupted by the SOUND of someone trying to open the\n\t      locked door behind them. Then a METAL RIPPING SOUND\n\t      as they whirl to see:\n\n\t260   MEDICAL OFFICE DOOR                                        260\n\n\t      with the METAL BUCKLING, TEARING -- and a single\n\t      hand slicing the steel door like paper. It is the\n\t      \"Ilia\" probe, her face absolutely impassive, her\n\t      whole manner incongruously benign. (Behind her, a\n\t      startled McCoy, Chapel and Chekov.) \"Ilia\" speaks\n\t      flatly, blandly.\n\n\t                              \"ILIA\"\n\t                I have recorded enough here.\n\t                       (motions to Kirk)\n\t                You will now assist me further.\n\n\t      Kirk exchanges a quick glance with Spock. Then:\n\n\t                              KIRK\n\t                       (indicating Decker)\n\t                The Decker-unit can assist you\n\t                with much greater efficiency...\n\t\n\t      \"Ilia\" has seemed about to object -- but now her eyes\n\t      hold on Decker. Then she nods.\n\n\t                              KIRK\n\t                       (continuing)\n\t                Carry on with your assignment,\n\t                Mr. Decker.\n\n\t  260A   ANOTHER ANGLE - ACROSS DECKER TO THE SMASHED DOOR         260A\n\t      (AND \"ILIA\")\n\n\t      as Decker looks at \"Ilia\" who stands at the torn door.\n\t      You can read Decker's mind: I'm supposed to persuade\n\t      that?! He turns back, finds Kirk's eyes on him.\n\t      Decker nods.\n\n\t                              DECKER\n\t                Aye, sir.\n\n\t      \"Ilia\" and a reluctant Decker EXIT.\n\n\t  260B   EMPHASIZING SPOCK                                         260B\n\n\t      looking very troubled as they watch Decker and \"Ilia\"\n\t      leave. Kirk notices.\n\n\t                              KIRK\n\t                Spock? Concerned about his\n\t                chances?\n\n\t                              SPOCK\n\t                I am uneasy with that being\n\t                our only hope of more information.\n\n\t      Spock EXITS.\n\n\t  261    INT. V'GER - THE ENTERPRISE                                261\n\n\t      floating in the vast, eerie, alien chamber -- sporadic\n\t      FLASHES OF ENERGY, erupting now and then. Various\n\t      other EFFECTS. OVER this, Kirk's VOICE:\n\n\t                              KIRK (V.O.)\n\t                Captain's Log. Stardate 7414.1.\n\t                Our best estimates place us some\n\t                four hours from Earth. No\n\t                significant Ilia memory patterns\n\t                within the alien probe. This\n\t                remains our only means of contact\n\t                with our captor.\n\n\t262   INT. ENTERPRISE AIRLOCK AREA                               262\n\n\t      The area dimly lit -- unoccupied but for a lone AIRLOCK\n\t      TECHNICIAN checking and adjusting instruments. The\n\t      CAMERA MOVES PAST him to FIND:\n\n\t263   SPOCK                                                      263\n\n\t      His face fixed with grim determination, walking quietly\n\t      with obvious intent not to attract the Tech's attention.\n\t      Now he steals up behind the TECH -- and in an instant\n\t      has applied a Vulcan nerve pinch. The Tech slumps over\n\t      his console.\n\n\t264   INT KIRK'S CABIN - VIEWER MONITOR                          264\n\n\t      Showing a CLOSE SHOT of ENTERPRISE PICTURES, then PULL\n\t      BACK SLIGHTLY for an IMAGE of Decker and \"Ilia\" walk-\n\t      ing through the Rec Deck. PULL BACK FURTHER TO SHOW\n\t      Kirk watching this -- and with him is McCoy. They\n\t      continue watching a troubled beat, as:\n\n\t                              DECKER\n\t                        (of pictures)\n\t                All these vessels were called\n\t                \"Enterprise\".\n\n\t      \"Ilia\" is giving the pictures a very interested look\n\t      as we HEAR in Kirk's cabin:\n\n\t                              UHURA'S INTERCOM VOICE\n\t                        (controlled excitement)\n\t                Bridge to Captain...\n\n\t265   OMITTED                                                    265\n\n\t266   INT. BRIDGE - UHURA'S STATION (SCIENCE STATION IN          266\n\t      B.G.)\n\n\t      Uhura at her console, struggling to hear the signal.\n\n\t                              KIRK'S INTERCOM VOICE\n\t                Kirk here.\n\t\n\t      In the b.g., Spock's station a MAINTENANCE TEAM\n\t      is replacing the broken Science Station computer.\n\t      (Spock is conspicuously absent.)\n\n\t                              UHURA\n\t                A faint signal from Starfleet,\n\t                sir. They have the intruder on\n\t                their monitors...\n\t                        (struggling to \n\t                         hear)\n\t                They show us... three hours...\n\t                twenty-four minutes from Earth!\n\n\t                              KIRK'S VOICE\n\t                        (thru intercom)\n\t                Thank you.\n\n\t267   INT. RECREATION DECK                                       267\n\n\t      Decker and \"Ilia\", the Rec Deck unoccupied but for a\n\t      pair of wary SECURITY GUARDS at a very discreet dis-\n\t      tance. They are near the pictures of the five Enter-\n\t      prises, which should be FEATURED in this SHOT, as\n\t      Decker waves his hand about the huge room.\n\n\t                              DECKER\n\t                The carbon units use this area\n\t                for recreation...\n\t                        (carefully)\n\t                What type of recreation does the\n\t                crew aboard your vessel enjoy...?\n\n\t268   CLOSER TWO SHOT (PICTURES O.S.)                            268\n\n\t      As \"Ilia\" moves on into the room, Decker follows:\n\t                    \n\t                              \"ILIA\"\n\t                The words 'recreation' and 'enjoy'\n\t                have no meaning to my programming.\n\n\t      Decker peers at the lovely android with frustration --\n\t      and no little pain, for she is after all the exact\n\t      replica of Ilia. She pays not the slightest attention\n\t      to Decker's reaction, and begins walking about the Rec\n\t      Deck taking in (and, clearly, transmitting all images\n\t      to V'ger) the sights. They are near a game area (elec-\n\t      tronic games), and now Decker points to one game,\n\t      switches it on -- presses button to activate its\n\t      LIGHTS and SOUNDS. \"Ilia\" watches interestedly as\n\t      Decker operates the game.\n\n\t                              DECKER\n\t                Ilia 'enjoyed' this game... she\n\t                nearly always won --\n\n\t      And he demonstrates again, as \"Ilia\" steps to the\n\t      device, deftly hits some buttons -- and for just an\n\t      instant she turns to Decker with a momentary glimmer\n\t      of recognition.\n\n\t269   INT. KIRK'S CABIN - GROUP WATCHING THE MONITOR             269\n\n\t      McCoy watching with special interest:\n\n\t                              McCOY\n\t                        (approving)\n\t                Good! He's using audial-visual\n\t                association.\n\n\t      But the words are not out of McCoy's mouth when \"Ilia\"\n\t      says:\n\n\t                              \"ILIA\"\n\t                This device serves no purpose.\n\n\t      She steps away from the game; Decker's disappointment\n\t      is evident. So is everyone elses.\n\n\t                              KIRK\n\t                Damn...!\n\n\t                              McCOY\n\t                        (nods grimly)\n\t                She needs something else:\n\t                something much more personal to\n\t                stimulate memory patterns. Something\n\t                with a more emotional tie.\n\n\t      Kirk reacts to this, reflective.\n\n\t270   INT. REC DECK  FULL ON DECKER AND \"ILIA\"                   270\n\n\t      Decker waving back toward the general area of the\n\t      Enterprise pictures.\n\n\t                              DECKER\n\t                The crews of the previous\n\t                Enterprises were also carbon units.\n\t                In what way is the life form in\n\t                your vessel different?\n\n\t                              \"ILIA\"\n\t                Carbon units are not true life\n\t                forms... Do those images repre-\n\t                sent how Enterprise has evolved\n\t                into its present form?\n\n\t                              DECKER\n\t                        (hoping he's struck\n\t                         a responsive chord)\n\t                Yes.\n\n\t                              \"ILIA\"\n\t                Carbon units have clearly retarded\n\t                Enterprise's proper evolvement.\n\n\t                              DECKER\n\t                        (controlling surprise)\n\t                What is Enterprise's proper\n\t                evolvement?\n\n\t                              \"ILIA\"\n\t                Enterprise should not require\n\t                the presence of carbon units.\n\n\t      And with this she moves off, observing other Rec Deck\n\t      objects. Decker moves with her; then:\n\n\t                              DECKER\n\t                        (carefully)\n\t                Enterprise would be unable to\n\t                function without carbon units.\n\n\t                              \"ILIA\"\n\t                More data concerning this functioning\n\t                is necessary before carbon units can\n\t                be patterned for data storage.\n\n\t271   ACROSS \"ILIA\" TO DECKER                                    271\n\n\t      as he reacts to this ominous note; he stops abruptly.\n\n\t                              DECKER\n\t                What does that mean?\n\n\t                              \"ILIA\"\n\t                        (stopping; almost\n\t                         pleasantly)\n\t                When my examination is complete, \n\t                the carbon units will be reduced \n\t                to data patterns.\n\n\t      This has been delivered with chilling blandness, and\n\t      she stands facing Decker, almost as though waiting for\n\t      him to thank her. He thinks fast now.\n\n\t                              DECKER\n\t                Within you are memory patterns of\n\t                a carbon unit. If I can help you\n\t                revive these patterns; you could\n\t                understand our functions better.\n\n\t                              \"ILIA\"\n\t                That is logical. You may procede.\n\n\t272   ON DECKER                                                  272\n\n\t      realizing the difficult task ahead; the pain he will\n\t      suffer.\n\n\t273   INT. V'GER - ANGLE UP TOWARD ENTERPRISE (M)                273\n\n\t      The ship stationary in the chamber as now we SEE an\n\t      exterior hatch sliding fully open. Up through the\n\t      hatch a circular airlock door opens -- and a tiny\n\t      figure in a thruster spacesuit emerges, steps into\n\t      space, slowly floats down through the hatch and under\n\t      the Enterprise saucer section. In this and subsequent\n\t      VIEWS we will SEE that on the rear pack of his thruster\n\t      spacesuit is a FLASHING STROBE LIGHT which regularly\n\t      EMITS the identifying SIGNAL of this particular suit.\n\t      (By which Kirk will be able to see Spock's position\n\t      even from several miles away.)\n\n\t274   CLOSER ON THE SPACESUITED FIGURE (M)                       274\n\n\t      MOVING TOWARD the CAMERA until the features behind\n\t      the face mask are clearly identifiable: Spock, his\n\t      face set in the same grim, determined expression, as\n\t      he touches his spacesuit transmitter control.\n\n\t                              SPOCK\n\t                Computer, commence recording.\n\t                Captain Kirk -- this message\n\t                will detail my attempt to\n\t                contact the aliens...\n\n\t275   INT. BRIDGE                                                275\n\n\t      Kirk ENTERING, crossing Uhura as she calls:\n\n\t                              UHURA\n\t                Starfleet signals, sir, growing\n\t                in strength...\n\t                       (listening intently)\n\t                They -- have Intruder on their\n\t                monitors -- it's decelerating --\n\t                powerfield cloud beginning to\n\t                dissipate...\n\n\t                              SULU\n\t                Confirm, Captain. Lunar beacons\n\t                indicate Intruder on a course\n\t                into Earth orbit...\n\n\t                              CHEKOV\n\t                        (interrupting)\n\t                Sir! Airlock four has been opened;\n\t                a thruster suit is reported missing!\n\n\t                              KIRK\n\t                        (reacts knowingly)\n\t                Spock...!\n\t                        (to navigator)\n\t                Get a fix on his position!\n\n\t276   INT. V'GER - MED. ON SPOCK                                 276\n\n\t      His features now set into an almost trance-like expres-\n\t      sion as he concentrates on the thought emanations.\n\t      Then we SEE his head turn, he peers off -- then he\n\t      moves his thruster controls. We SEE the small blue\n\t      jets of his thrusters -- his spacesuit figure begins\n\t      to move off in the direction he was concentrating\n\t      upon.\n\n\t277   ANOTHER ANGLE - SPOCK                                      277\n\n\t      His thrusters moving him across V'ger's vast chamber\n\t      then dropping down into a deep \"trough\"-like area\n\t      which stretches into the distance ahead of him. A\n\t      cloud of CRYSTAL FORMS (Kirk's entrapment) become\n\t      visible to one side but Spock passes them at some dis-\n\t      tance and does not attract them.\n\n\t      We can SEE more clearly now the point on the inner wall\n\t      of the trough toward which Spock is heading. It is an\n\t      unusual combination of GLOWING FORCEFIELDS which seem\n\t      to mark this point of the vessel as of some importance.\n\t      (Here, also, we will become aware of \"sensor-bee\"\n\t      swarms, intermittently darting toward this same wall\n\t      from all points of the chamber.)\n\n\t278   INT. AIRLOCK AREA                                          278\n\n\t      SHOWING Kirk in a thruster spacesuit, helmet being\n\t      readied by AIRLOCK TECHNICIANS. McCoy is also here,\n\t      arguing with Kirk:\n\n\t                              KIRK\n\t                        (from the start)\n\t                ... I don't want him stopped, Bones;\n\t                I want him to lead me to whatever's\n\t                out there...!\n\n\t                              McCOY\n\t                And if that 'whatever' has taken\n\t                over his mind....?\n\t                              KIRK\n\t                Then he'll have still led me to\n\t                it, won't he?\n\n\t      And Kirk steps into the airlock door, hits a control --\n\t      it begins sliding closed behind him.\n\n\t279   INT. V'GER - ANGLE UP TOWARD ENTERPRISE                    279\n\n\t      UP THROUGH the circular airlock door as it slides open\n\t      -- and Kirk's tiny spacesuited figure floats down\n\t      clear of the saucer.\n\n\t280   CLOSER ON KIRK                                             280\n\n\t      SEEING his face through the spacesuit faceplate as he\n\t      scans the darkness.\n\n\t                              SULU'S VOICE\n\t                Bridge, Captain. We make Spock\n\t                as 26 Mark 345 degrees off ship's\n\t                axis.\n\n\t      During which, Kirk spots something.\n\n\t281   KIRK'S POV                                                 281\n\n\t      Spock's STROBE blinker at a mile or so distance,\n\t      nearing V'ger's inner walls.\n\n\t282   ANGLE ON KIRK                                              282\n\n\t                              KIRK\n\t                I have him in sight.\n\n\t      During which, Kirk touches his thruster controls and\n\t      blue thruster jet propels him off in the direction\n\t      indicated. His thrusters come on for a longer period\n\t      of time as he accelerates to the higher speed necessary\n\t      to overtake Spock...\n\n\t283   INT. ILIA'S QUARTERS                                       283\n\n\t      The DOOR SNAPPING open, and \"Ilia\", McCoy and Decker\n\t      entering. Then CAMERA REVEALS Chapel already inside,\n\t      looking through some female adornments she's found\n\t      there.\n\n\t                              CHAPEL\n\t                I remember Lt. Ilia once mentioning\n\t                that she wore this...\n\n\t                              DECKER\n\t                        (reacting; tight)\n\t                ... when we met.\n\n\t      Clearly this is very painful to Decker. Meanwhile,\n\t      Chapel hands the Deltan headband to \"Ilia\".\n\t                \n\t                              CHAPEL\n\t                        (gently)\n\t                Put it on.\n\n\t      \"Ilia\" hasn't the slightest idea what to do with the\n\t      headband, holds it, runs her fingers over the jewels\n\t      and feathers embedded into it. Chapel takes it from\n\t      her, places it on 'Ilia's\" head, now switches on the\n\t      light illuminating the dressing table mirror -- stands\n\t      behind her with Decker, both watching apprehensively.\n\n\t284   ANGLE ON \"ILIA\"                                            284\n\n\t      studying her image in the mirror, her face totally\n\t      blank a moment, but then breaking into a bemused\n\t      frown -- as though trying to remember. And:\n\n\t                              CHAPEL\n\t                        (helpfully)\n\t                Ilia...\n\n\t                              DECKER\n\t                        (quiet; urging)\n\t                On Delta... remember...?\n\n\t      And it seems that \"Ilia\" does remember. She peers at\n\t      her image, then sets the headband into its exact\n\t      proper position. Then she turns and looks at them\n\t      with recognition.\n\n\t                              \"ILIA\"\n\t                        (haltingly)\n\t                Dr. Chapel...\n\n\t  285   ACROSS CHAPEL TO DECKER                                    285\n\n\t      as Chapel smiles, pleased, and looks at Decker who\n\t      stares at \"Ilia\" nonplussed. This is Ilia coming\n\t      alive!\n\n\t                              \"ILIA\"\n\t                        (to Decker)\n\t                \"Will...\"\n\n\t      And she touches his hand, runs her own hand over it,\n\t      and smiles.\n\n\t      Decker is completely overwhelmed, struggles for words\n\t      and looks to McCoy for some kind of help. McCoy\n\t      realizes Decker is losing himself in fantasy.\n\n\t                              McCOY\n\t                        (gently reminding)\n\t                Commander... this is a mechanism...\n\n\t      Decker is startled, and for another slit-second he's\n\t      lost -- but then he realizes the reality, and what he\n\t      should do:\n\t                              DECKER\n\t                        (gently; but urgingly)\n\t                Ilia, help us make direct contact\n\t                with V'ger...\n\n\t                              \"ILIA\n\t                I... cannot.\n\n\t      Decker looks at \"Ilia's\" hand still resting on his.\n\t      Then:\n\n\t                              DECKER\n\t                Then tell us who V'ger is; where\n\t                he's from... W need your help.\n\n\t      For another moment \"Ilia\" continues smiling at Decker,\n\t      holding his hand. Then, abruptly, the smile vanishes\n\t      -- the hand is released. Clearly, she's again the\n\t      probe, as:\n\n\t                              \"ILIA\"\n\t                Why have two carbon units entered\n\t                V'ger...?\n\n\t      Decker glances at McCoy, who shakes his head almost\n\t      imperceptibly: he doesn't know. But Decker has an\n\t      obvious reply:\n\n\t                              DECKER\n\t                They want to make contact with\n\t                V'ger...\n\t                        (trying to revive\n\t                         \"Ilia's\" memory again;\n\t                         touches her hand)\n\t                Ilia...\n\n\t      \"Ilia\" peers at him blankly, allows him to continue \n\t      touching her hand, but obviously it means nothing to\n\t      her.\n\n\t                              DECKER\n\t                        (continuing;\n\t                         distressed,\n\t                         to \"Ilia\")\n\t                Does V'ger object to the presence\n\t                of the two carbon units?\n\n\t                              \"ILIA\"\n\t                The carbon units are of no\n\t                consequence; V'ger will determine\n\t                their purpose.\n\n\t                              McCOY\n\t                Their purpose is to survive.\n\n\t                              \"ILIA\"\n\t                That is also V'ger's purpose.\n\n\t      Decker's face reflects his bemusement:\n\n\t                              DECKER\n\t                You said V'ger's purpose was to\n\t                find and join with the Creator.\n\n\t                              \"ILIA\"\n\t                That is how V'ger will survive.\n\n\t286   ON DECKER                                                  286\n\n\t      as now, the bemusement changes to just the slightest\n\t      enlightenment.\n\n\t                              \"ILIA\"\n\t                I wish to continue my observations.\n\n\t287   INT. V'GER - KIRK MANEUVERING WITHIN THE CHAMBER           287\n         \n\t      Kirk but a small object, thruster jets occasionally\n\t      spurting as he guides himself deeper into the trench\n\t      as he continues forward progress in the direction he\n\t      saw Spock taking.\n\n\t288   CLOSER ON KIRK                                             288\n\n\t      So we can SEE his face (through the plate), as he looks\n\t      ahead into the distance toward Spock.\n\n\t289   KIRK'S POV (O)                                             289\n\n\t      Spock's STROBE signal closer and Spock's tiny space-\n\t      suited figure now becoming dimly visible as he moves\n\t      steadily toward the GLOWING FORCEFIELDS of the inner\n\t      wall.\n\n\t290   ON KIRK                                                    290\n\n\t      His attention fixed on Spock, he never notices until\n\t      an instant too late an O.S. object; quickly he hits a\n\t      thruster control, and we SEE the MANEUVERING JET turn\n\t      him to the side as:\n\n\t291   WIDER ANGLE - KIRK AND THE BLOB FORMATION (O)              291\n\n\t      A swarm of strange-looking translucent crystal-like\n\t      FORMS on a collision course with Kirk. (NOTE: They\n\t      were traveling randomly, and are not deliberate ob-\n\t      structions. However, Kirk's nearness now has attracted\n\t      them and the swarm of them heads in his direction.\n\t      Kirk tries to avoid them; he hits a second MANEUVERING\n\t      JET -- but he overcompensates, and spins straight into\n\t      the intercepting swarm of them.\n\n\t292   MED. SHOT - KIRK (O)                                       292\n\n\t      as the nearest crystal forms WHIP INTO SHOT, adhering\n\t      to Kirk's spacesuit. He hits full MANEUVERING JETS\n\t      now, seems to make some escape, but still more forms\n\t      WHIP IN, adhere.\n\n\t                              KIRK\n\t                Bridge...!\n\n\t293   INT. BRIDGE - EMPHASIZING HELM                             293\n\n\t      All eyes anxiously on the O.S. main viewer.\n\n\t                              KIRK'S VOICE\n\t                ... stand by, I may be in trouble...\n\n\t      Sulu hits the viewer magnification control.\n\n\t294   ANGLE TO MAIN VIEWER (M)                                   294\n\n\t      As the distant STROBE FLASHES of Kirk's spacesuit are\n\t      MAGNIFIED CLOSER, pulling Kirk into MEDIUM LONG SHOT.\n\t      We can SEE the details of the swarm of forms adhering.\n\t      But we can SEE that Kirk's spacesuit is now about half\n\t      covered with them!\n\n\t  294A   REVERSE ANGLE                                             294A\n\t\n\t      Expressions of bridge crew to reflect the horror of\n\t      what they're seeing as:\n\n\t                              SULU\n\t                Your phaser, Captain...!\n\t                Use your phaser...!\n\n\t                              KIRK'S VOICE\n\t                        (transmitter, weak)\n\t                Can't... reach... phas --\n\t                        (transmission breaks\n\t                         off in heavy STATIC)\n\n\t                              CHEKOV\n\t                Airlocks two and four --\n\t                prepare to launch rescue\n\t                teams!\n\t                        (glancing at viewer)\n\t                Chief Lang! Get them out\n\t                there! Fast!\n\n\t                              SULU\n\t                Mr. Spock, the Captain is in\n\t                trouble, directly behind you --\n\t                three hundred meters!\n\t                        (beat)\n\t                Mr. Spock!\n\n\t      Looks of distress are exchanged.\n\n\t295   INT. V'GER - SPOCK                                         295\n\n\t      Spock's spacesuited figure MOVING TOWARD the CAMERA,\n\t      as we HEAR:\n\n\t                              KIRK'S VOICE\n\t                        (weak; STATIC)\n\t                ... Spock...! ... need help...!\n\t                ... trapped...!\n\n\t      No indication at first that Spock has heard; his face\n\t      set with determination, his eyes fixed on his destin-\n\t      ation: the inner wall.\n\n\t                              KIRK'S VOICE\n\t                        (continuing; weakening;\n\t                         STATIC)\n\t                ... pressure on me...! ... can't\n\t                move...! Spock...!\n\t\n\t296   ON SPOCK - CLOSE                                           296\n\n\t      as Kirk's VOICE STOPS -- and all that is heard now\n\t      is the HEAVY STATIC crackling ominously. Spock's\n\t      expression flickers, then he hits reverse thruster\n\t      JETS, stops -- he turns to glance at the inner wall,\n\t      then his thrusters turn him so he can look back the\n\t      way he came from. But he cannot resist Kirk's call;\n\t      he suddenly hits his thruster controls, then JETS\n\t      FLARE, and:\n\n\t297   WIDER ANGLE - SPOCK                                        297\n\n\t      as thruster JETS accelerate him back toward Kirk.\n\n\t298   INT. BRIDGE - VIEWER (M)                                   298\n\n\t      showing Kirk's spacesuit completely covered, encased\n\t      in the blob. Kirk is no longer moving. But in the\n\t      distance, facing toward him is Spock!\n\n\t299   INT. V'GER - KIRK AND SPOCK                                299\n\n\t      with Spock in the near distance, heading TOWARD the\n\t      CAMERA. As he approaches Kirk, Spock brings out his\n\t      phaser. Now he hits the controls for the REVERSE JETS --\n\t      he slows RAPIDLY as he approaches Kirk's now complete-\n\t      ly encased spacesuit. Spock makes a quick phaser\n\t      adjustment.\n\n\t300   ANGLE ON SPOCK AND KIRK'S ENCASED SPACESUIT (O) (S)        300\n\n\t      Spock levels the phaser carefully. FIRES. The PHASER\n\t      BEAM strikes the blob form -- it SHATTERS, the pieces\n\t      DISINTEGRATING.\n\n\t301   INT. V'GER - SPOCK AND KIRK                                301\n\n\t      facing each other while hovering in space.\n\n\t                              KIRK\n\t                Bridge, cancel rescue teams.\n\t                        (hard)\n\t                Spock, what in the hell are you\n\t                doing out here!\n\n\t                              SPOCK\n\t                I am seeking answers, Captain.\n\n\t                              KIRK\n\t                        (with insight)\n\t                Answers to what, Spock? Our\n\t                dilemma -- or your personal one?\n\n\t      Spock does not immediately reply, peers at Kirk through\n\t      the faceplate a long beat, then abruptly looks away,\n\t      points off into the distance:\n\n\t302   ANOTHER ANGLE - INCLUDING INNER WALL (O)                   302\n\n\t      We can SEE what appear to be SPARKLING GLOBULES OF\n\t      LIGHT darting toward the inner wall in the distance,\n\t      then disappearing there. (We'll SEE other swarms\n\t      occasionally too, coming from different directions --\n\t      they will later be identified as \"sensor swarms\" on\n\t      closer examination.)\n\n\t                              SPOCK\n\t                        (pointing)\n\t                Captain, I believe there we will\n\t                find an indication of whoever --\n\t                or whatever -- is aboard this\n\t                vessel...\n\n\t      Kirk weighs alternatives, then pushes his thruster\n\t      controls and begins moving in the direction Spock\n\t      indicated.\n\n\t      Their thruster jets flash, propel them toward the \n\t      point on the inner wall.\n\n\t303   INT. V'GER - AT INNER WALL                                 303\n\n\t      The most prominent area of the vast inner wall -- the\n\t      patterns on the wall here seem to GLOW with life.\n\t      The spacesuited figures of Kirk and Spock ENTER SCENE,\n\t      gliding slowly toward what seems to be the central\n\t      part of theses patterns.\n\n\t304   CLOSER ON KIRK AND SPOCK                                   304\n\n\t      as they approach and then we SEE the brief REVERSE\n\t      THRUSTERS and then forward momentum stops; motionless.\n\t      Then Spock sees something, indicates.\n\n\t305   LONG ANGLE TO INCLUDE SENSOR SWARM (O)                     305\n\n\t      Now, we SEE that they are tiny, multi-colored points\n\t      of FLASHING LIGHT -- almost like swarms of bees.\n\t      They approach the inner wall at this central point\n\t      and seem to \"disappear\" through the orifice.\n\n\t306   KIRK AND SPOCK - ANOTHER \"SWARM\" APPROACHING (O)           306\n\n\t      This \"sensor swarm\" has been coming from a direction\n\t      that will take them close past Kirk and Spock. Then,\n\t      as it passes, Spock reaches out quickly, grabs.\n\t      He turns to Kirk, his hand closed on something.\n\n\t307   CLOSE ON KIRK AND SPOCK (AGAINST \"TUBE\" WALL)              307\n\n\t      Spock opens his hand, retaining a hold on something\n\t      with his fingers. He brings it up to Kirk's face mask\n\t      -- it's a tiny SENSOR, its multi-colors flashing as it\n\t      tries to escape from Spock's fingers. And in this CLOSE\n\t      VIEW, we SEE that this is a SENSOR very much like the\n\t      one we've seen earlier embedded in the Ilia-probe's\n\t      throat hollow. Then Spock releases it and it darts\n\t      to join the sensor swarm near the opening of the inner\n\t      wall.\n\n\t308   KIRK AND SPOCK'S POV (O)                                   308\n\n\t      From this closer distance, we SEE that an opening ap-\n\t      pears in the wall, admits the sensor swarm, then closes\n\t      immediately.\n\n\t309   BACK TO SHOT                                               309\n\n\t      Kirk and Spock exchange a look. Their thruster JETS\n\t      ignite briefly, moving them in that direction.\n\n\t310   INT. V'GER - KIRK AND SPOCK (O)                            310\n\n\t      closely approaching the inner wall now, timing their\n\t      movements to coincide with the arrival of another\n\t      \"swarm\" -- the wall begins OPENING. The \"swarm\"\n\t      through, the wall begins CLOSING -- but Spock and \n\t      Kirk slip in before it closes.\n\n\t311   INT. \"MEMORY CAVE\" - SPOCK AND KIRK                        311\n\n\t      The wall closing behind them, they are safely inside.\n\t      But as they stop their forward momentum, their eyes\n\t      widen with awe and surprise at what they are seeing:\n\n\t  311A   WHAT THEY SEE (M)                                         311A\n\n\t      The long \"cave\" chamber with its row of huge MEDIATOR\n\t      BALLS extending into the distance. To one side, the\n\t      gleaming CRYSTAL MEMORY WALL.\n\n\t  311B   KIRK AND SPOCK                                            311B\n\n\t      as Spock makes a quick analysis and estimate of what\n\t      they are seeing. Then, he takes out his tricorder\n\t      again, propels himself toward the memory crystals.\n\t      Kirk follows.\n\n\t  311C   AT MEMORY CRYSTAL                                         311C\n\n\t      as Spock adjusts his tricorder through several readings.\n\n\t                              SPOCK\n\t                It would appear that the atomic\n\t                arrays of these crystals store\n\t                information. A remarkably\n\t                efficient system.\n\n\t                              KIRK\n\t                        (indicates)\n\t                And these 'sensor-swarms' collect\n\t                that data, carry it here.\n\n\t                              SPOCK\n\t                        (nods; indicates)\n\t                New crystals: they must contain\n\t                the most recent data obtained --\n\n\t      And Spock touches one of these new crystals (it will be\n\t      shinier, more pulsating than the others): ANOTHER \n\nRAPID\n\t      PROFUSION OF FAINT IMAGES, but this time including a\n\t      pattern-like image of Klingons, Klingon vessels (the\n\t      ones destroyed by the Cloud), and obvious Starfleet\n\t      personnel -- and the Epsilon 9 station. Also, a \n\npattern\n\t      of the Security Guard killed by the probe. And Ilia.\n\t\n\t                              KIRK\n\t                Klingons... our Epsilon 9 station\n\t                ... and Ilia!! They seem to be \n\t                more than just images...\n\n\t                              SPOCK \n\t                        (agreeing)\n\t                Exact patterns. The energy bolt\n\t                that hit them wasn't simply a\n\t                weapon -- it dematerialized them,\n\t                stored them. But why?\n\n\t      And he turns and begins moving on, studying the wall,\n\t      consulting his tricorder.\n\n\t312   ACROSS THEM TO ANOTHER SECTION OF THE WALL                 312\n\n\t      Spock inspecting this area at which the \"newer\" crystals\n\t      are PULSATING and GLOWING, and which appears to be a\n\t      termination of the Crystal area, continuing on and dis-\n\t      appearing through the wall.\n\n\t                              KIRK\n\t                If this is their ship's data\n\t                banks, where is the crew? Or\n\t                is their entire ship automated?\n\n\t                              SPOCK\n\t                Captain, I do not believe there\n\t                is a crew -- or that this is a\n\t                vessel as such.\n\n\t      A beat, as Kirk reacts incredulously.\n\n\t                              SPOCK\n\t                        (continuing)\n\t                I am almost certain now that all\n\t                of this is V'ger -- I believe\n\t                that we are inside a life form,\n\t                a living machine.\n\n\t      Spock turns his spacesuit, turns his tricorder out to-\n\t      ward the Mediator Balls, takes a reading in that di-\n\t      rection. Then a glance to Kirk.\n\n\t                              SPOCK\n\t                I must attempt mindmeld with it,\n\t                Captain.\n\n\t      Spock touches his spacesuit controls; the THRUSTER\n\t      JETS move him out toward the Mediator Balls.\n\n\t                              KIRK\n\t                        (warningly)\n\t                Spock...\n\n\t313   ANGLE AT MEDIATOR BALL                                     313\n\n\t      Spock reaching the Ball, halts his momentum and removes\n\t      one gauntlet, baring his hand. Stretching the bare\n\t      hand toward a part of it which looks strangely \"alive.\"\n\t      The very power generated from this area is clearly\n\t      affecting Spock's hand. Meanwhile, Kirk has used his\n\t      THRUSTERS to join him.\n\n\t                              KIRK\n\t                Spock, if you're right, its mind\n\t                may be enormous...\n\n\t      But Spock pays him no attention, his entire being now\n\t      focused on the PULSATING GLOW of the \"alive\" area --\n\t      the CAMERA MOVING IN CLOSER TO Spock, as he forces his\n\t      hand toward that surface, closer, closer.\n\n\t314   KIRK                                                       314\n\n\t      watching, almost mesmerized. Torn between wanting to\n\t      pull Spock away from the wall -- and knowing that\n\t      Spock must go through with it. For everyone's sake.\n\n\t315   CLOSER ON SPOCK                                            315\n\n\t      preparing for the ordeal, moving his hand to the \"liv-\n\t      ing area,\" the invisible force even stronger -- but\n\t      Spock's strength unwavering, and now he touches the \n\t      surface -- and it FLARES WITH STRANGE ENERGY at the\n\t      touch. And at the same moment Spock' body convulses\n\t      as if tens of thousands of volts of electricity are\n\t      charging through him.\n\n\t316   CLOSE ON SPOCK'S FACE                                      316\n\n\t      as he begins to shudder with the shock, the CAMERA\n\t      CONTINUES INTO EXTREME CLOSE-UP as we SEE Spock's mouth\n\t      open -- he SCREAMS. CAMERA INTO EXTREME CLOSE SHOT OF\n\t      SPOCK'S EYES.\n\n\t317   CAMERA ZOOM - THROUGH SPOCK'S EYES                         317\n\n\t      MUSIC IN AND UP as we travel through ABSTRACT IMAGES\n\t      (per Con Pederson discussion). Symbolizing V'ger's\n\t      incredible and complex store of mechanistic knowledge,\n\t      these IMAGES suggest patterns of atoms, molecules,\n\t      galaxies, dimensions of the universe beyond human\n\t      knowledge or comprehension. It takes only fifteen or\n\t      twenty seconds, but seems to span aeons, taking us\n\t      through micro-infinity and macro-infinity.\n\n\t      DISSOLVE TO :\n\n\t318   INT. DISPENSARY - SPOCK'S EYES                             318\n\n\t      CAMERA BRIDGING BACK OUT THROUGH SPOCK'S EYES AND INTO\n\t      ANGLE ON SPOCK'S FACE as he lies in a sickbay bed. His\n\t      eyes are open; he is staring straight ahead as if in a\n\t      catatonic state, completly unaware of his surroundings.\n\t      Then Doctor Chapel leans INTO SCENE, moving a medical\n\t      scanner over the brain area.\n\n\t                              CHAPEL\n\t                Now scanning pons area at spinal\n\t                nerve fiber connection...\n\n\t319   ANGLE ON McCOY AND KIRK                                    319\n\n\t      McCoy at a console, watching readings he is getting\n\t      from Chapel's scanner. Kirk watches McCoy anxiously.\n\n\t                              McCOY\n\t                Indications of some neurological\n\t                trauma--the power pouring through\n\t                that mind-meld must have been\n\t                staggering...\n\n\t      Before Kirk can reply, they HEAR a LAUGH! An abrupt,\n\t      harsh, bitter laugh.\n\n\t320   ACROSS THEM TO SICKBAY                                     320\n\n\t      as all whirl to the patient area where it is obviously\n\t      Spock who has just laughed -- but there is no indication\n\t      of laughter from him now. A startled Chapel has stepped\n\t      back away from the bed. Spock seems to be attempting\n\t      to focus, orient himself as Kirk and McCoy hurry to the\n\t      bedside.\n\n\t                              SPOCK\n\t                        (quiet)\n\t                Jim...\n\n\t      And Spock reaches out a hand weakly., takes a surprised\n\t      Kirk's hand in his. McCoy exchanges a surprised glance \n\t      with Kirk, as Spock -- clutching Kirk's hand in friend-\n\t      ship and need -- struggles to summon strength to speak.\n\n\t                              SPOCK\n\t                        (continuing)\n\t                This simple feeling...\n\t                        (looks at Kirk)\n\t                ... is so far beyond V'ger's\n\t                comprehension.\n\n\t321   ANOTHER ANGLE                                              321\n\n\t      with Kirk and McCoy exchanging another surprised\n\t      glance (at Spock's emotion), with McCoy gesturing Kirk\n\t      not to question it.\n\n\t                              KIRK\n\t                        (gently)\n\t                Were you right? Spock? V'ger\n\t                is a living machine...?\n\t\n\t                              SPOCK\n\t                        (nodding)\n\t                A life form of its own; a\n\t                conscious, living entity.\n\n\t                              CHAPEL\n\t                        (reacting)\n\t                A living machine...?!\n\n\t                              McCOY\n\t                        (to Chapel)\n\t                We're living machines, too: protein\n\t                mechanisms.\n\n\t      Kirk nods at McCoy.\n\n\t                              KIRK\n\t                And it considers the Enterprise a\n\t                living machine: that's why the\n\t                probe refers to our ship as an\n\t                entity.\n\n\t                              CHAPEL\n\t                If it thinks our ship is alive\n\t                what does it think we are?\n\n\t                              McCOY\n\t                        (dryly)\n\t                An 'infestation' -- bacteria...\n\t                microbes.\n\n\t322   ANOTHER ANGLE                                              322\n\n\t      as Spock turns to Kirk.\n\n\t                              SPOCK\n\t                I saw V'ger's planet: a planet\n\t                populated by living machines.\n\t                Unbelievable technology.\n\t                        (pained)\n\t                V'ger has knowledge that spans this\n\t                universe.\n\t                And... in all this order... all\n\t                this magnificence, V'ger feels\n\t                no awe...no delight... no beauty...\n\t                        (a beat; exhausted)\n\t                I should have known...\n\n\t      Kirk waits for Spock to continue, but Spock seems too\n\t      weak.\n\n\t                              KIRK\n\t                Know what, Spock? What?\n\n\t      But Spock falls back, exhausted -- and McCoy gently\n\t      tugs at Kirk, AD-LIBBING, \"Let him rest, Jim...\"\n\t      Kirk shrugs McCoy away, addresses Spock:\n\n\t                              KIRK\n\t                        (continuing)\n\t                What should you have known?\n\n\t                              SPOCK\n\t                        (weak)\n\t                No meaning... No hope...\n\t                        (summoning strength)\n\t                And, Jim, no answers...!\n\t                Jim, it's looking for answers\n\t                itself!\n\n\t                              KIRK\n\t                What answers?\n\n\t                              SPOCK\n\t                'Is this all I am? Is there not\n\t                more?'\n\n\t      Just then an INTERCOM SIGNAL:\n\n\t                              UHURA'S VOICE\n\t                A faint signal from Starfleet,\n\t                sir! Intruder Cloud has been\n\t                located on their outer monitors\n\t                for past twenty-seven minutes...\n\t                dissipating rapidly as it approaches.\n\n\t      Immediately, Sulu's voice:\n\n\t                              SULU'S VOICE\n\t                Starfleet reports forward velocity\n\t                has slowed to sub-warp speed! We\n\t                are three minutes from Earth's\n\t                orbit!-\n\n\t                              KIRK\n\t                        (into intercom)\n\t                I'll be right there...\n\t                        (to Chapel; crisp)\n\t                I need Spock on the bridge.\n\n\t323   ANOTHER ANGLE                                              323\n\n\t      as Chapel urns to a MED TECH, AD LIBS an order,\n\t      \"Dalaphaline, twenty cc's...\" As the Tech quickly sets\n\t      the hypo-injector, and hands it to Chapel - and she\n\t      injects Spock, the hypo emitting a fast, QUIET HISS --\n\t      Kirk gazes at Spock just an instant as Spock breathes\n\t      deeply, the drug clearly strengthening him. Chapel\n\t      and the Tech help Spock from the bed, as Kirk addresses\n\t      McCoy:\n\n\t                              KIRK\n\t                A machine planet...? Sending a\n\t                machine to Earth looking for its\n\t                Creator...?\n\n\t                              McCOY\n\t                God.\n\n\t      Kirk looks at him, then at Spock -- on his feet now --\n\t      then at McCoy again:\n\n\t                              KIRK\n\t                'To find the Creator,' the probe\n\t                said. Find God...?\n\n\t                              McCOY\n\t                Isn't that what we're all trying\n\t                to do...?\n\t                        (dryly)\n\t                All us machines...?\n\n\t      Kirk stands facing him another moment, then whirls\n\t      and steps to the monitor, flips some buttons, and\n\t      peaks into his communicator.\n\n\t                              KIRK\n\t                Mr. Chekov, Commander Decker's\n\t                present location?\n\n\t                              CHEKOV'S VOICE\n\t                He... they... are in Engineering,\n\t                sir.\n\n\t                              KIRK\n\t                        (into intercom)\n\t                I want to make a ship's announcement.\n\t                But it's to be heard only in\n\t                Engineering.\n\n\t                              UHURA'S VOICE\n\t                Ready, Captain.\n\n\t                              KIRK\n\t                        (voice amplified)\n\t                This is the Captain speaking. It\n\t                appears that the alien ship...\n\t                V'ger... is NOT a manned vessel...\n\n\t324   ENGINEERING                                                324\n\n\t      SHOWING Scott (at his console) listening to Kirk's\n\t      words -- and facing Decker and \"Ilia\" who are just\n\t      about to leave Engineering. (In b.g. the Engine core\n\t      GLOWS the appropriate color, and there is a SOFT\n\t      HUM of IDLE POWER.) Kirk's VOICE continues:\n\n\t                              KIRK'S VOICE\n\t                        (amplified)\n\t                It is a living entity...! A machine\n\t                life form. We are attempting to\n\t                ascertain its intentions. All\n\t                personnel will maintain yellow alert\n\t                status!\n\n\t325   CLOSER ON DECKER AND \"ILIA\"                                325\n \n\t      The probe bland as usual, but Kirk's words seem to\n\t      have strangely elated Decker; he says to her:\n\n\t                              DECKER\n\t                A machine...! Then it had to be\n\t                programmed. By whom...?\n\n\t                              \"ILIA\"\n\t                By the Creator.\n\n\t                              DECKER\n\t                        (probing)\n\t                To join, and become One with the\n\t                Creator?\n\n\t                              \"ILIA\"\n\t                To learn all that is learnable;\n\t                to deliver all collected data to\n\t                the Creator on the third planet.\n\t                That is the programming.\n\n\t326   INCLUDE SCOTT                                              326\n\n\t      just now confronting them, regarding \"Ilia\" with open\n\t      disapproval.\n\n\t                              SCOTT\n\t                Well, sir, now what about all that?\n\t                A living entity, the Captain says...\n\t                entity... A living thing...!\n\n\t      Decker really hasn't heard Scott; he's gazing at \"Ilia,\"\n\t      attempting to digest what she's just said. But quickly:\n\n\t                              DECKER\n\t                Thank you, Scotty...\n\n\t      He moves to leave.\n\n\t                              SCOTT\n\t                        (dourly)\n\t                Your welcome, sir.\n\n\t      Now Decker and \"Ilia\" move toward the exit, Scott gaz-\n\t      ing after them glaringly, watching \"Ilia's\" every\n\t      move. Suddenly, almost into the corridor, \"Ilia\" turns\n\t      and looks back at the engine room. She addresses\n\t      Decker, but load enough for Scott to overhear:\n\n\t                              \"ILIA\"\n\t                There is no logical reason for\n\t                carbon units to control Enterprise's\n\t                power systems.\n\n\t                              SCOTT\n\t                        (to \"Ilia\")\n\t                Lassie, if I were functioning\n\t                'logically,' right now I'd be\n\t                showing you the inside of our\n\t                scrap metal compactor!\n\n\t327   INT. BRIDGE                                                327\n\n\t      Kirk with McCoy and Spock, who although somewhat shaky,\n\t      is clearly more alert. They are just assuming their\n\t      stations.\n\n\t                              UHURA\n\t                We're now locked into Starfleet's\n\t                transceivers; Admiral Nogura has\n\t                received your reports, sir.\n\n\t328   ANGLE INCLUDING VIEWER (O)                                 328\n\n\t      Kirk pausing halfway to his chair to study the viewer\n\t      on which is appearing an IMAGE of V'ger looming omi-\n\t      nously in orbit over Earth.\n\n\t                              UHURA\n\t                The visual is a lunar monitor\n\t                relay, sir.\n\n\t      As they begin to study it, the IMAGE suddenly distorts and \n\t      is replaced by signal interference -- SIGNAL STATIC LINES \n\t      RUNNING ACROSS THE VIEWER SCREEN. \n\t      (Somewhat resembling the kind of high voltage interference\n\t      some-times seen on the television screen.)\n\n\t                              UHURA\n\t                        (continuing)\n\t                Heavy interference, sir -- it's\n\t                coming from here, inside the\n\t                intruder itself...\n\n\t      Uhura hits buttons and immediately from the speakers we \n\t      HEAR A SERIES OF CARRIER WAVE BEEPS. Spock looks up from \n\t      his console, listens to it.\n\n\t                              SPOCK\n\t                Puzzling! The interference\n\t                appears to be a rather simple\n\t                carrier wave code signal...\n\n\t                              UHURA\n\t                On an old style radio frequency,\n\t                sir...\n\n\t329   PAST KIRK TO THE ELEVATOR                                  329\n\n\t      as the doors snap open and Decker and \"Ilia\" appear.\n\t      All eyes go to them as:\n\n\t                              \"ILIA\"\n\t                        (to Decker;\n\t                         interrupting)\n\t                As I stated, V'ger calls to the\n\t                Creator.\n\n\t                              DECKER\n\t                       (nods; turns to Kirk)\n\t                V'ger is announcing that it has\n\t                arrived, sir -- that it's ready\n\t                to deliver the information it\n\t                was programmed to collect...\n\n\t                              \"ILIA\"\n\t                'To learn all that is learnable.'\n\n\t                              DECKER\n\t                        (to Kirk)\n\t                It expects a return signal now,\n\t                ordering it to transmit that \n\t                information to the Creator.\n\n\t                              UHURA\n\t                        (whirling)\n\t                Sir! V'ger's signals have\n\t                stopped...\n\n\t                              \"ILIA\"\n\t                        (as if frightened)\n\t                Decker... The Creator has not \n\t                responded.\n\n\t      Kirk hears this, turning inquiringly toward her, but\n\t      Uhura interrupts:\n\n\t                              UHURA\n\t                Picking up Starfleet again; a\n\t                lunar monitor relay...\n\n\t330   ANGLE INCLUDING VIEWER (O)                                 330\n\n\t      as, indeed, the interference is fading and a new Main \n\t      Viewer IMAGE is appearing -- it shows V'GER IN EARTH \n\t      ORBIT with a strange looking OBJECT moving away from \n\t      V'ger. It is an ominous looking, HUGE SWIRLING GREEN\n\t      MASS -- it resembles the same green plasma-energy bolts\n\t      that destroyed the Klingons and Epsilon 9 -- and very \n\t      nearly the Enterprise. It is not a bolt now -- the mass \n\t      is much larger and appears much more deadly. A second \n\t      object has now formed and moves off, a third one begins \n\t      to appear. (Meanwhile, the first and second PLASMA-\n\t      ENERGY OBJECTS are moving off into the distance in \n\t      different direction.)\n\n\t                              McCOY\n\t                My God! They're the same kind\n\t                of things that destroyed the\n\t                Klingons, Epsilon Nine...\n\n\t                              SPOCK\n\t                        (interrupting; from\n\t                         science console)\n\t                These read as identical composition...\n\t                        (turns to Kirk)\n\t                ... however, Captain, they measure\n\t                several hundred times more\n\t                powerful!\n\n\t                              KIRK\n\t                High mag, Mr. Sulu!\n\n\t      Sulu adjusts the viewer through several IMAGE MAGNI-\n\t      FICATIONS until we SEE the huge OMINOUS GREEN DEVICES\n\t      more clearly.\n\n\t                              SULU\n\t                The third one is moving off too --\n\t                a fourth one is forming...\n\n\t                              UHURA\n\t                        (overlapping)\n\t                Urgent signal from Starfleet,\n\t                Captain!\n\t                        (turns, shaken)\n\t                All Earth defense systems have\n\t                gone dead.\n\n\t      Kirk reacts hard at this. Uhura gets another message.\n\n\t                              UHURA\n\t                         (continuing)\n\t                Sir, Starfleet computes their\n\t                trajectories as moving toward\n\t                equidistant positions over Earth.\n\n\t331   ANOTHER ANGLE - KIRK AND SPOCK                             331\n\n\t      exchanging significant glances.\n\n\t                              SPOCK\n\t                From four equidistant positions,\n\t                Captain, a detonation would blanket\n\t                the entire surface of the planet.\n\n\t                              DIFALCO\n\t                I plot them as reaching equidistant\n\t                positions in... twenty-nine\n\t                minutes, sir... mark!\n\n\t332   ACROSS KIRK TO DECKER AND \"ILIA\"                           332\n\n\t      as Kirk vaults from his chair, strides to a handrail to\n\t      confront the \"Ilia\"-probe.\n\n\t                              KIRK\n\t                Why...?!\n\n\t                              \"ILIA\"\n\t                The carbon-units infection will\n\t                now be removed from the Creator's\n\t                planet.\n\n\t                              KIRK\n\t                Why?!\n\n\t                              \"ILIA\"\n\t                The Creator has not answered.\n\n\t                              KIRK\n\t                The carbon-units are not\n\t                responsible for that.\n\n\t                              \"ILIA\"\n\t                You infest and control Enterprise.\n\t                V'ger believes carbon-units interfere\n\t                with the Creator in the same manner.\n\n\t                              SPOCK\n\t                        (to Kirk)\n\t                Then V'ger believes the Creator to\n\t                be a machine too.\n\n\t                              DECKER\n\t                       (nods)\n\t                It seems we all imagine God in our\n\t                own image.\n\n\t333   ANGLE ON MAIN VIEWER - INCLUDING CHEKOV (O)                333\n\t\n\t      Three of the four OMINOUS SWIRLING GREEN OBJECTS have\n\t      all moved away from V'ger now, in different directions,\n\t      growing smaller in the distance. The fourth object is\n\t      holding position nearby, seeming to grow in size and\n\t      intensity.\n\n\t334   ANGLE EMPHASIZING KIRK                                     334\n\n\t      as he throws a look toward Spock who is now in deep\n\t      meditation. Kirk turns and takes \"Ilia's\" shoulders\n\t      and carefully turns her to face him.\n\n\t                              McCOY\n\t                '... similar life forms...?'\n\t                Jim, V'ger's saying the Creator\n\t                is a machine...!\n\n\t                              DECKER\n\t                        (grimly amused)\n\t                Of course: we all create God\n\t                in our own image.\n\n\t      Kirk peers at Decker a moment, ingesting this thought. \n\t      Then he addresses \"Ilia\" again, this time with emotion: \n\t      after all, he is pleading for the survival of the \n\t      entire planet:\n\n\t                              KIRK\n\t                V'ger! If we are lesser beings,\n\t                we are still, like you, living.\n\t                And because we are alive, we --\n\t                like you -- wish to survive.\n\t                You must not destroy --\n\t\n\t      Kirk pauses abruptly: \"Ilia\" is regarding him blandly,\n\t      stonily -- not the slightest reaction or response;\n\t      clearly Kirk's plea is being ignored.\n\t      Kirk draws in his breath to continue, realizes the\n\t      futility, turns helplessly to Spock.\n\n\t335   ACROSS KIRK TO SPOCK                                       335\n\n\t      who has been listening intently, with near fascination\n\t      -- an idea forming in his mind. Quickly, he steps\n\t      down to Kirk:\n\n\t                              SPOCK\n\t                        (quiet, terse)\n\t                Captain...\n\t                        (reaches Kirk)\n\t                Treat V'ger as you would... a\n\t                child.\n\n\t336    FAVORING KIRK                                             336\n\t\n\t       startled at this, not sure he's heard correctly.\n\n\t                              KIRK\n\t                Child...!?\n\n\t                              SPOCK\n\t                Yes, Captain, a child: evolving\n\t                into adulthood -- learning, searching\n\t                -- instinctively needing.\n\n\t                              DECKER\n\t                        (intrigued)\n\t                Needing what...?\n\n\t                              McCOY\n\t                Spock, this 'child' is about\n\t                to eliminate all life on Earth;\n\t                how do we teach it that that's\n\t                'wrong'? With a spanking...!?\n\n\t      Spock peers at McCoy almost sadly, then replies to\n\t      Decker.\n\n\t                              SPOCK\n\t                It doesn't know what it needs,\n\t                Comm          ander...\n\t                        (to Kirk)\n\t                It does not know.\n\n\t      Kirk says nothing, looks at Spock who is awaiting a\n\t      reaction; then Kirk glances at \"Ilia\" -- his brain\n\t      is racing, struggling to reach a decision. And then:\n\n\t                              KIRK\n\t                        (abruptly to\n\t                         \"Ilia\")\n\t                The carbon--units-know-why-the\n\t                Creator-has-not-responded.\n\n\t                              McCOY\n\t                        (shocked)\n\t                Jim...!\n\n\t                              DECKER\n\t                        (to \"Ilia,\"\n\t                         urgingly)\n\t                Ilia... we can help V'ger\n\t                find what it needs --\n\n\t      \"Ilia\" studies Decker just a bland beat, then turns\n\t      to Kirk:\n\n\t                              \"ILIA\"\n\t                        (to Kirk, hard)\n\t                Disclose the information.\n\t\n\t                              KIRK\n\t                        (cool, calm)\n\t                Not until V'ger withdraws the\n\t                devices orbiting the third planet.\n\n\t                              \"ILIA\"\n\t                KIRK UNIT! DISCLOSE THE\n\t                INFORMATION!\n\n\t      Kirk studies her a moment, then decides to press his\n\t      bet:\n\n\t                              KIRK\n\t                        (to \"Ilia,\" almost\n\t                         pleasant)\n\t                No.\n\t                        (then to crew\n\t                         commandingly)\n\t                Secure all stations. Clear\n\t                the bridge.\n\n\t      A moment where all are startled at this order -- but\n\t      no time for questions as just then the ship is ROCKED\n\t      BY A FURIOUS POWERFUL ERUPTION NEARBY within V'ger.\n\n\t                              DECKER\n\t                        (amplified)\n\t                Bridge to all decks,secure\n\t                your stations.\n\n\t                              McCOY\n\t                Your child is having a\n\t                tantrum, Spock.\n\t\n\t                              SULU\n\t                Clear the bridge, Captain...?\n\n\t                              KIRK\n\t                That was the order, Mr. Sulu:\n\t                Clear the bridge.\n\n\t      Just then another ERUPTION -- the ship is ROCKED AGAIN.\n\n\t337   INT. INSIDE V'GER - THE ENTERPRISE                         337\n\n\t      rocked about by the furious powerfields -- with\n\t      frightening displays of ray energy.\n\n\t338   INT. BRIDGE                                                338\n\n\t      as all react to the powerful blasts, holding on to \n\t      railings, etc, at the same time attempting to secure\n\t      their stations for the evacuation. The DAMAGE REPAIR\n\t      TECHNICIAN leaves his station, crossing to exit.\n\n\t                              DAMAGE TECH.\n\t                        (leaving bridge;\n\t                         to Captain)\n\t                Severe stress on engine pylons,\n\t                sir.\n\n\t                              \"ILIA\"\n\t                        (to Kirk; flat)\n\t                V'ger requires the information.\n\n\t      Kirk merely looks at her, then to the evacuating crew:\n\n\t                              KIRK\n\t                Bridge secure all stations! \n\t                Move out!\n\n\t                              McCOY\n\t                Jim, what the hell kind of\n\t                strategy is this...?\n\n\t      Meanwhile, Decker has crossed to Chekov's now abandoned\n\t      console, checks it.\n\n\t                              DECKER\n\t                All ship's functions going to\n\t                automatic, Captain.\n   \n\t339   ANGLE ON KIRK                                              339\n\n\t      turning to confront \"Ilia\":\n\n\t                              KIRK\n\t                If V'ger destroys the Enterprise,\n\t                the information V'ger requires\n\t                will also be destroyed.\n \n\t  339A   INCLUDING VIEWER                                          339A\n\n\t      as LIGHT SHOW outside perceptically recedes, and simul-\n\t      taneously the ROCKING CEASES. At the same time, \"Ilia\"\n\t      is saying:\n\n\t                              \"ILIA\"\n\t                It is illogical to withhold\n\t                required information.\n\n\t      Kirk does not reply to this, turns away to observe\n\t      the withdrawing crew. Most are out; only Spock,\n\t      Decker and McCoy remain behind -- with McCoy on his \n\t      way. The bridge lighting dims, and now Kirk looks at\n\t      Spock, who nods approvingly; clearly Spock is the only\n\t      person who seems to comprehend what Kirk is doing, and\n\t      why. As Kirk now moves toward the exit, and the lights \n\t      are dimmed even further:\n\n\t                              \"ILIA\"\n\t                        (almost polite)\n\t                Kirk-unit, why do you not\n\t                disclose information?\n\n\t                              KIRK\n\t                Because V'ger is going to\n\t                destroy all the carbon units\n\t                on the third planet.\n\n\t                              \"ILIA\"\n\t                They have repressed the Creator.\n\n\t                              KIRK\n\t                The information will not be\n\t                disclosed.\n\n\t      And, gesturing the others ahead of him, Kirk starts\n\t      toward the bridge elevator. \"Ilia\" calls after him:\n\n\t                              \"ILIA\"\n\t                        (almost a plea)\n\t                V'ger needs the information.\n\n\t340   AT THE ELEVATORS                                           340\n \n\t      Decker and McCoy about to enter, Spock and Kirk just\n\t      behind -- all stopping abruptly now at \"Ilia's\" state-\n\t      ment. The very tone of her voice is enough for them\n\t      to realize they have made a very telling point. Kirk\n\t      follows fast:\n\n\t                              KIRK\n\t                Then V'ger must withdraw its\n\t                orbiting devices.\n\n\t                              \"ILIA\"\n\t                V'ger will comply if the carbon\n\t                units disclose the information.\n\n\t341   ANGLE ON McCOY                                             341\n\n\t      wryly reacting to this:\n\n\t                              McCOY\n\t                It learns fast, doesn't it...?\n\n\t342   ACROSS McCOY TO KIRK AND SPOCK                             342 \n\n\t      as Kirk looks at Spock, Kirk's whole expression convey-\n\t      ing the obvious question: \"What the hell do we do now?\"\n\t      But Spock is ready with an answer:\n\n\t                              SPOCK\n\t                Captain, the vessel -- V'ger --\n\t                obviously operates from a\n\t                central brain complex...\n\n\t      Spock allows the sentence to hang, as he and Kirk\n\t      eye each other significantly, the CAMERA SWINGING\n\t      OVER TO KIRK so we can perceive that to Kirk this\n\t      idea has an even greater significance.\n\n\t                              KIRK\n\t                        (to Spock)\n\t                The orbiting devices would be\n\t                controlled from the point,\n\t                then...?\n\n\t                              SPOCK\n\t                Precisely.\n\n\t      Kirk nods grimly, faces \"Ilia\" again; this time \n\t      he's playing for all the stakes.\n\n\t                              KIRK\n\t                The carbon units' information\n\t                cannot be disclosed to V'ger's\n\t                probe... only to V'ger directly.\n\n\t343   ANOTHER ANGLE - REACTIONS                                  343\n\n\t      all wait with hushed expectancy, all eyes on \"Ilia\"\n\t      who seems momentarily in some internal communication.\n\n\t      She turns away from Kirk and steps forward looking at\n\t      the Main Viewer.\n\n\t                              McCOY\n\t                        (indicating\n\t                         viewer)\n\t                Jim...!\n\n\t344   PAST THEM TO VIEWER                                        344\n\n\t      the image of the chamber in which the Enterprise is\n\t      imprisoned. But now, toward the chamber-end, where\n\t      further passage had previously been barred by the lace-\n\t      work energy barriers -- an OPENING APPEARS. And at\n\t      the same time there is a GENTLE LURCHING EFFECT, and:\n\n\t                              DECKER\n\t                Forward motion, Captain...!\n\n\t                              SPOCK\n\t                A tractor beam...\n\n\t      \"Ilia\" steps down from the platform and into the well\n\t      where she is closer to the viewer.\n\n\t                              DECKER\n\t                Captain, what's the next move?\n\n\t                              KIRK\n\t                The question is, Mr. Decker, is\n\t                there a next move...\n\n\t345   INT. V'GER - THE ENTERPRISE                                345\n\n\t      moving through the chamber, pulled by the invisible\n\t      tractor beam, toward the OPENING -- toward the next\n\t      chamber which, from this POV seems even larger,\n\t      more forbidding.\n\n\t346   INT. BRIDGE                                                346\n\n\t      as the four officers step down onto the bridge, Spock\n\t      hurrying to his science station, Kirk to the center\n\t      seat.\n\n\t                              KIRK\n\t                Resume duty stations, Mr. Decker.\n\n\t      As Kirk attends to his console, Deck is at an\n\t      intercom:\n\n\t                              DECKER\n\t                        (into intercom,\n\t                         voice amplified)\n\t                All personnel resume stations...!\n\n\t      At the same time the lights are brightening -- and\n\t      members of the bridge crew begin returning. All this\n\t      time there is an ever increasing sense of movement.\n\t      Kirk glances at Decker:\n\n\t                              KIRK\n\t                Well, Mr. Decker, it seems my\n\t                bluff is being called.\n\n\t                              DECKER\n\t                I'm afraid our hand is pretty\n\t                weak, Captain.\n\t                        (slight smile)\n\t                But it's the only game in town.\n\t\n\t      Kirk reacts, pleased, a split beat at Decker's \"our\"\n\t      hand, and goes on:\n\n\t      Kirk throws him a look of appreciation, then, abruptly\n\t      his manner changes as he addresses Chekov:\n\n\t                              KIRK\n\t                Mr. Chekov, when do those devices\n\t                activate?\n\n\t                              CHEKOV\n\t                They reach final position in...\n\t                Twenty-seven minutes -- mark.\n\n\t                              KIRK\n\t                        (a beat; then into\n\t                         intercom)\n\t                Engineering...\n\n\t347   INT. ENGINEERING - SCOTT                                   347\n\n\t      at his console, a female engineering technician (CHIEF\n\t      ROSS) nearby, the usual engine room ambience in the\n\t      b.g., as:\n\n\t                              SCOTT\n\t                Scott, here, sir.\n\n\t348   INT. BRIDGE - KIRK WITH AN ANGLE ON SPOCK                  348\n\n\t      as Kirk hesitates, glances around at the crew -- now\n\t      all having resumed their stations -- and then grimly\n\t      looks at \"Ilia\" who still remains at the rail.\n\n\t                              KIRK\n\t                        (into intercom,\n\t                         eyes on \"Ilia\")\n\t                Mr. Scott, be prepared to execute\n\t                Starfleet order two zero zero\n\t                five.\n\n\t      Hearing this, Spock whirls around -- peers incredulously\n\t      at Kirk. He appears for a moment to be incensed at\n\t      Kirk's words. Then he realizes and understands Kirk's\n\t      position and turns, sadly resigned, back to his work.\n\n\t349   INT. ENGINEERING                                           349\n\n\t      as Scott, too, hears this, but his reaction is of grim\n\t      acceptance. Not so Chief Ross; she is horrified.\n\n\t                              SCOTT\n\t                        (with a glance at\n\t                         Ross, into intercom)\n\t                When, Captain?\n\n\t                              KIRK'S INTERCOM VOICE\n\t                On my command.\n\n\t                              SCOTT\n\t                        (somberly, into\n\t                         intercom)\n\t                Aye, sir.\n\n\t      And Scott hits buttons on his console, now moves to\n\t      step from his station, nearly collides with Ross, who\n\t      clearly is bravely struggling to maintain her poise\n\t      and dignity:\n\n\t                              ROSS\n\t                Why has the Captain ordered self-\n\t                destruct, sir?\n\n\t                              SCOTT\n\t                        (a beat; gently)\n\t                I would say, lass, because he\n\t                thinks -- he hopes -- that when\n\t                we go up... we'll take V'ger\n\t                with us.\n\n\t                              ROSS\n\t                Will we?\n\n\t                              SCOTT\n\t                        (with grim\n\t                         satisfaction)\n\t                When that much matter and anti-\n\t                matter are brought together?\n\t                Oh, yes; we will, indeed.\n\n\t350   EXT. ENTERPRISE - INT. V'GER                               350\n\n\t      The ship passing now through a chamber that is vastly\n\t      more active than anything we have previously seen.\n\t      Directly ahead appears to be an area that dispatches\n\t      powerfields; a tremendous volume of them seem to ema-\n\t      nate and converge there. The medium from which the\n\t      ship moves appears almost solid, to the point where it\n\t      seems incredible that the ship can be pulled through\n\t      it at all. The entire chamber pulses with machine-\n\t      like, alien life. This should even be evidenced in the\n\t      booming POWERFIELD LIGHTENING BOLTS as they course in\n\t      ever more frighteningly close proximity to the ship as:\n\n\t  350A   INT BRIDGE - INCLUDING THE VIEWER                         350A\n\n\t      The crew all watching the awesome spectacle of V'ger's\n\t      interior (on the viewer) as the Enterprise is being\n\t      pulled toward the brain complex. All are somewhat sub-\n\t      dued, for all realize how their journey will end -- but\n\t      at the same time they also realize there is no other\n\t      way. The CAMERA PANS, catching facial reactions -- as,\n\t      in the b.g., we HEAR a constant flow of AD-LIBBED crew\n\t      comments:\n\n\t                              CHEKOV\n\t                Twenty-five minutes to device\n\t                activation, sir.\n\n\tALT. (Twenty-two)\n\tALT. (Eighteen)\n\n\t                              UHURA\n\t                Starfleet has been apprised of \n\t                our situation, Captain.\n\n\t                              SULU\n\t                Tractor beam remains constant...\n\n\t                              DIFALCO\n\t                We are seventeen kilometers inside\n\t                the vessel...\n\n\t351   ANGLE ON SPOCK                                             351\n\n\t      His back to the viewer, the angle does not reveal his\n\t      facial features, but we can discern him struggling to\n\t      contain his feelings.\n\n\t352   WIDER ANGLE (INCLUDE KIRK, McCOY, AND DECKER)              352\n\n\t      Kirk's back to Spock as he watches the viewer, Kirk\n\t      now turning toward Spock.\n\n\t                              KIRK\n\t                Spock... Spock...\n\n\t      Spock does not respond, then Kirk reacts with momentary\n\t      annoyance, then realizes Spock is totally distracted.\n\t      Kirk peers at him a moment, then suddenly rises and\n\t      steps up to:\n\n\t353   SPOCK'S STATION - KIRK AND SPOCK (McCOY IN B.G.)           353\n\n\t      as Kirk arrives, with Spock still facing away from\n\t      him, clearly distracted.\n\n\t                              KIRK\n\t                        (starts)\n\t                Mr. Spock -- I think...\n\n\t      Spock moves to face him, turning fully INTO the CAMERA\n\t      so we can see now, just under Spock's eye:\n\n\t      A tear! Welling fom the eye, rolling down his cheek.\n\t      Kirk is speechless a moment, glances at McCoy who has\n\t      also witnessed this phenomenon, and started toward\n\t      Spock; but Kirk gestures McCoy to stay back, as he\n\t      addresses Spock:\n\n\t                              KIRK\n\t                        (quiet, feeling)\n\t                Not for us?\n\n\t                              SPOCK\n\t                No, Captain, not for us... for V'ger.\n\t\n\t      Spock pauses as Kirk peers incredulously at him, then\n\t      continues:\n\n\t                              SPOCK\n\t                        (continuing)\n\t                I weep for V'ger, as I would for\n\t                a brother -- far more knowledgeable\n\t                than I -- and yet one step behind.\n\n\t354   ANGLE ON McCOY AND DECKER                                  354\n\n\t      Listening, McCoy's face reflecting concern; Decker's\n\t      face compassion and understanding, with Decker step-\n\t      ping closer to Spock, as Spock continues:\n\n\t                              SPOCK\n\t                As I was -- when I came aboard...\n\t                so is V'ger now: empty, incomplete.\n\t                Searching. Logic and knowledge are\n\t                not enough.\n\n\t                              McCOY\n\t                        (with empathy)\n\t                Spock, are you saying that you\n\t                found, what you needed -- but V'ger\n\t                hasn't?\n\n\t                              SPOCK\n\t                Has not, Doctor -- and now, because\n\t                of what we are planning... will not...\n\n\t                              KIRK\n\t                        (almost hard)\n\t                There is no alternative.\n\n\t                              DECKER\n\t                        (gently pressing)\n\t                Mr. Spock, what would V'ger need\n\t                to fulfill itself?\n\n\t                              SPOCK\n\t                V'ger has begun to understand the\n\t                true limits of our universe,\n\t                thereby realizing the existence\n\t                of other dimensions. To fulfill\n\t                itself it must evolve to a\n\t                higher dimension; V'ger believes\n\t                this can be achieved only by\n\t                joining with the Creator.\n\n\t                              SPOCK (ALTERNATIVE)\n\t                Each of us, at some time in our\n\t                life, turns to someone, a father,\n\t                a brother, a God and asks 'Why\n\t                am I here?' 'What was I meant\n\t                to be?' V'ger hopes to touch its\n\t                Creator to find its answers.\n\n\t355   ACROSS KIRK TO DECKER                                      355\n\n\t      as Decker reacts with sudden, almost evangelical en-\n\t      lightenment, as Kirk Says:\n\n\t                              KIRK\n\t                        (understanding)\n\t                'Is this all that I am? Is there\n\t                nothing more?\n\n\t      ON DIFALCO\n\n\t      reacting to the (O.S.) viewer, AD-LIBBING a terse:\n\n\t                              DIFALCO\n\t                Captain...!\n\n\t      PAST KIRK AND SPOCK TO THE VIEWER\n\t\n\t      where another opening is suddenly visible -- another\n\t      chamber. But the violent and color energy effects of\n\t      the previous chambers are no longer evident. Instead,\n\t      the entire chamber appears beautifully symmetrical,\n\t      with a strange, subdued glow, which increases as we\n\t      move closer.\n\n\t                              SPOCK\n\t                        (flat)\n\t                Captain, I believe that is our\n\t                destination.\n\t\n\t356   EXT. ENTERRISE - INT. V'GER - NEAR THE \"ISLAND\"            356\n\t      COMPLEX\n\n\t      This enormous chamber resembles a hemisphere, laced\n\t      throughout with dazzling energy patterns, not at all\n\t      ominous, but quite lovely in effect. As the Enterprise\n\t      continues forward motion, now ahead you will to SEE a\n\t      small \"island.\" Floating in the exact center of the\n\t      hemisphere, the \"island\" seems alive with PULSING LIGHT,\n\t      with more of the lovely and delicate ENERGY FORMS and\n\t      COLORS. On the \"island,\" vague at this distance, ap\n\t      pears to be a \"solid\" matter form.\n\n\t357   INT. BRIDGE - INCLUDING VIEWER                             357\n\n\t      The \"island\" looming larger in the distance. And the\n\t      Enterprise (as evidenced from the viewer) perceptibly\n\t      slowing. Kirk just resuming his command chair, as:\n\t                  \n\t                              SULU\n\t                Forward motion slowing, Captain...!\n\n\t      Kirk says nothing a moment, studies the viewer -- and\n\t      then:\n\n\t                              KIRK\n\t                        (into intercom)\n\t                Engineering... Status, Mr. Scott?\n\n\t                              SCOTT'S INTERCOM VOICE\n\t                        (somber)\n\t                We're ready, sir.\n\n\t                              KIRK\n\t                        (into intercom)\n\t                Thank you, Scotty. Stand by.\n\n\t358   ACROSS KIRK TO McCOY                                       358\n\n\t      as Kirk turns from the intercom and glances at McCoy.\n\t      Between them a total look of understanding.\n\n\t359   EXT. ENTERPRISE (INT. V'GER)                               359\n\n\t      The Enterprise approaching the edge of the \"island\" --\n\t      slowing, but still quite clearly being pulled by the\n\t      tractor beam. The \"solid matter\" in the \"island\" cen-\n\t      ter still obscured by the STRANGE LIGHT GLOW emanating\n\t      from that area. The Enterprise is now nearly at the\n\t      \"island\" edge.\n\n\t360   INT. BRIDGE - INCLUDING VIEWER                             360\n\n\t      as all watching \"island\" loom closer and closer.\n\n\t                              CHEKOV\n\t                Tractor beam strength lessening,\n\t                Captain.\n\n\t                              KIRK\n\t                        (into intercom)\n\t                Mr. Scott... on my next signal.\n\n\t                              SPOCK\n\t                        (fast)\n\t                Captain, the orbital device will     (ALT.)\n\t                not be triggered for twenty-two      (nineteen...)\n\t                minutes...                           (fifteen...)\n\n\t                              KIRK\n\t                The point...\n\t                (Your)\n\n\t                              SPOCK\n\t                        (eying \"Ilia\";\n\t                         carefully)\n\t                The point is, Captain, twenty-two    (ALT. \n\nshould\n\t                minutes. We could have that much      loop \"19\" &\n\t                more time...                                 \"15\")\n         \n\t      Kirk glances at the Viewer, the oncoming \"island,\" then\n\t      at Spock:\n\n\t                              KIRK\n\t                        (shakes head, no)\n\t(ALT: \"19\",)    (Mr. Spock), if we do not provide\n\t(     \"15  )    V'ger with certain information, we\n\t                won't have twenty-two seconds; the\n\t                plan must be implemented upon arrival.\n\n\t                              DECKER\n\t                Captain, we can't be sure that our...\n\t                move... will actually save Earth.\n\n\t                              KIRK\n\t                No!\n\n\t      Decker's last word is interrupted by an almost gentle\n\t      BUMP -- and on the Viewer all perceptible motion has\n\t      stopped. At the same time:\n\n\t                              SULU\n\t                Forward motion stopped, Captain.\n\n\t                              CHEKOV\n\t                Tractor beam is released.\n\n\t361   INT. INSIDE V'GER - THE ENTERPRISE AT THE \"ISLAND\"         361\n\n\t      The ship's sauce leading edge holding position at\n\t      the \"island\" edge as though docked.\n\n\t362   INT. BRIDGE  \"ILIA\"                                        362\n\n\t      watching the (O.S.) Viewer.\n\n\t                              \"ILIA\"\n\t                       (indicating viewer)\n\t                V'ger...\n\n\t363   INCLUDING THE VIEWER  KIRK AND THE OTHERS                  363\n\n\t      all very silent a moment, gazing at the sight. Now\n\t      Kirk glances at the people around him: on his command\n\t      their lives are about to end. Nothing is said; no\n\t      time for it, no inclination to articulate the obvious.\n\t      No need to.\n\n\t                              KIRK\n\t                        (into intercom:\n\t                         with finality)\n\t                Mr. Scott...\n\n\t364   ANGLE ON CHEKOV                                            364\n\n\t      reacting to a console reading with surprise.\n\n\t                              CHEKOV\n\t                Captain... I read an oxygen and\n\t                gravity envelope forming outside\n\t                the Enterprise...!\n\n\t                              UHURA\n\t                Sir, I have located the source\n\t                of V'ger's radio signal: (it's)\n\t                directly ahead.\n\n\t                              SPOCK\n\t                That transmitter is a vital link\n\t                between V'ger and the Creator.\n\t                        (its)\n\n\t                              DECKER\n\t                        (urging)\n\t (ALT. \"18\",)   We have twenty-one minutes. Captain,\n\t (.... \"14\" )   we can still save V'ger... and ourselves. \n\n\t      All this has caused Kirk to vacillate, but he still\n\t      believes his course of action is the proper one, as:-\n\n\t                              \"ILIA\"\n\t                The carbon units will now provide \n\t                V'ger the required information.\n\n\t      \"Ilia\" is moving toward the elevator, turning to face\n\t      the others as she says this. Kirk remains frozen, his\n\t      hand on the intercom button. He glances at McCoy, as\n\t      though seeking advice. McCoy peers at him blandly,\n\t      levelly; Kirk must follow his own instinct.\n\n\t365   FAVORING KIRK                                              365\n\n\t      gazing at \"Ilia,\" then at Spock, his brain racing, con-\n\t      sidering all the possibilities, options. He glances\n\t      at the anxious faces awaiting his decision: a possible\n\t      twenty-two more minutes of life -- or instant death.\n\t      Another beat as he decides. Then:\n\n\t                              KIRK\n\t                        (into intercom)\n\t                Mr. Scott... we're holding off;\n\t                there may be a chance...\n\t                        (rises, gestures\n\t                         Spock and McCoy)\n\t                Spock, Bones...\n\n\t      He starts for elevator.\n\n\t366   PAST DECKER TO KIRK                                        366\n\n\t      as Kirk strides toward the elevator, joining McCoy and\n\t      Spock.\n\n\t                              KIRK\n\t                Mr. Decker... I will contact you\n\t                every five minutes. Otherwise...\n\t                inform Mr. Scott immediately.\n\n\t                              DECKER\n\t                        (calls after him)\n\t                Captain... I'd like to go along...\n\n\t      Kirk studies Decker a beat -- there is something com-\n\t      pelling about Decker's manner -- a certain sense of\n\t      absolute necessity. Kirk seems about to deny the re-\n\t      quest, then turns to Sulu:\n\n\t                              KIRK\n\t                Mr. Sulu, you have the conn...\n\n\t      And Kirk leaves; Decker, his face reflecting a strange,\n\t      almost eager gratification, hurries after him.\n\n\t                              KIRK\n\t                V'ger plans to literally meld\n\t                to reduce both itself and the\n\t                Creator to patterns...\n\n\t                              SPOCK\n\t                ... and then to reassemble itself\n\t                combined with the Creator. The\n\t                most certain way of obtaining\n\t                all the Creator's answers.\n\n\t      A sudden STORM OF LIGHT AND STRANGE SOUND. In the\n\t      midst of it, Kirk finds a SHAFT OF LIGHT very much\n\t      centering on him. He sees \"Ilia\" watching him with\n\t      none of their \"former navigator\" in her expression\n\t      now. Kirk hesitates, gathering his thoughts:\n\n\t                              KIRK\n\t                        (to \"Ilia\")\n\t                Our data is being prepared.\n\t\n\t                              \"ILIA\"\n\t                Answer!\n\n\t                              KIRK\n\t                We will answer and present proof\n\t                of our answer when it is ready!\n\n\t      Kirk's words lead to a suggestion of FRUSTRATION in the\n\t      STORM OF LIGHT AND SOUND around them.\n\n\t                              KIRK\n\t                        (continuing)\n\t                V'ger, we will bring the Creator\n\t                to you! Here!\n\n\t367   ANGLE EMPHASIZING \"ILIA\" AND DECKER                        367\n\n\t      as he moves to her:\n\n\t                              DECKER\n\t                We need only a few more minutes.\n\t                Believe me...\n\n\t      Decker has reached out to touch her -- the probe spins\n\t      at his touch -- the move knocks Decker from his feet,\n\t      tumbling, a hard fall. Then the robe looks at him\n\t      lying there -- just the slightest softening of her\n\t      features now.\n\n\t368   EMPHASIZING DECKER                                         368\n\n\t      slowly turning to face the probe again.\n\n\t                              DECKER\n\t                Ilia, believe me... the Creator\n\t                will appear!\n\n\t369   EMPHASIZING \"ILIA\"                                         369\n\n\t      as she meets Decker's look, her expression softening\n\t      still more. The STORM OF LIGHT and SOUND begins to\n\t      subside a bit. She moves to him and he gets to his feet.\n\n\t                              UHURA'S INTERCOM VOICE\n\t                Enterprise to Captain...\n\n\t370   INT. BRIDGE                                                370\n\n\t      Uhura with Sulu and Chekov there.\n\n\t                              UHURA\n\t                Problem, Captain: the response\n\t                signal is not in our records.\n\t                Voyager Six was sent out by Earth's\n\t                \"United States Subdivision.' The\n\t                code was probably...\n\n\t371   INT. VOYAGER SIX SITE                                      371\n\n\t      as Uhura continues:\n\n\t                              UHURA'S INTERCOM VOICE\n\t                ... kept secret to keep Voyager's\n\t                data from rival subdivisions.\n\n\t                              McCOY\n\t                That's preposterous! They\n\t                wouldn't have kept scientific\n\t                data from one another.\n\n\t                              CHEKOV'S INTERCOM VOICE\n\t                We are now checking with Starfleet\n\t                Archives, Captain. Stand by.\n\n\t372   ANGLE ON DECKER AND \"ILIA\"                                 372\n\n\t      Kirk, Spock and McCoy are standing some distance from\n\t      them (out of hearing). The probe is clearly moving\n\t      into still closer touch with Lt. Ilia's memory patterns\n\t      as Decker takes her hand.\n\n\t                              DECKER\n\t                And when V'ger melds? What will\n\t                happen to you?\n\n\t                              \"ILIA\"\n\t                It will... take me from you...\n\n\t373   KIRK, SPOCK AND McCOY                                      373\n\n\t      McCoy is looking at Kirk with an incredulous expression\n\t      on his face.\n\n\t                              McCOY\n\t                And when it realizes what the\n\t                Creator is...?\n\n\t                              KIRK\n\t                There's no way to know. V'ger\n\t                expected it to be a machine --\n\t                some single entity.\n\t                        (indicates entire\n\t                         site)\n\t                All of us here may be reduced\n\t                into patterns...\n\n\t                              SPOCK\n\t                That seems to be what it has\n\t                planned -- to have the Creator\n\t                physically present here.\n\n\t                              McCOY\n\t                        (small smile)\n\t                The God it captures is going to\n\t                be a hell of a disappointment.\n\n\t374   DECKER AND \"ILIA\"                                          374\n\n\t      at the side of Voyager Six, Decker in the midst of\n\t      twisting a wing-nut which releases a hatch which swings\n\t      open. Decker peers inside while \"Ilia\" waits.\n\n\t375   KIRK, SPOCK AND McCOY                                      375\n\n\t      Decker and \"Ilia\" at the old capsule in b.g. as Kirk\n\t      looks that way.\n\n\t                              KIRK\n\t                Commander...\n\n\t      We SEE Decker look up at Kirk's call, then ignore him\n\t      and go back to inspecting inside the access hatch. At\n\t      this moment, from Kirk's communicator, a SIGNAL.\n\n\t                              KIRK\n\t                        (continuing;\n\t                         into communicator)\n\t                Kirk here.\n\n\t                              UHURA'S INTERCOM VOICE\n\t                We now have the response code,\n\t                sir.\n\n\t                              KIRK\n\t                Stand by. Transmit it on my\n\t                orders.\n\n\t      The three of them exchange looks -- Kirk, Spock and\n\t      McCoy exchanging a silent moment of friendship and\n\t      resignation. Then Kirk lifts his communicator again:\n\n\t                              KIRK\n\t                        (continuing)\n\t                Enterprise... transmit.\n\n\t376   DECKER AND \"ILIA\"                                          376\n\n\t      catching Decker in the midst of pressing a control on\n\t      his tricorder. Both he and \"Ilia\" are watching Kirk\n\t      and the others closely. Now Decker looks down at the\n\t      tricorder's face. He nods:\n\n\t                              DECKER\n\t                Recording...\n\n\t377   KIRK, SPOCK AND McCOY                                      377\n\n\t      still waiting. They continue to wait. McCoy shifts\n\t      uncomfortably, throws Kirk a puzzled glance. Kirk\n\t      finally lifts his communicator.\n\n\t                              KIRK\n\t                Enterprise, are you transmitting?\n\n\t                              UHURA'S INTERCOM VOICE\n\t                Affirmative, Captain. For some\n\t                time now.\n\n\t                              KIRK\n\t                Confirm code and transmitting\n\t                frequency.\n\n\t                              CHEKOV'S INTERCOM VOICE\n\t                Both signal and frequency\n\t                confirmed, sir.\n\n\t                              DECKER\n\t                        (calling)\n\t                Captain Kirk!\n\n\t378   VARIOUS ANGLES                                             378\n\n\t      as the others turn to Decker and \"Ilia.\"\n\n\t                              DECKER\n\t                        (continuing)\n\t                The fault is here, sir, not in\n\t                the transmission.\n\t                        (indicating into\n\t                         hatch)\n\t                The antenna leads have been\n\t                disconnected. V'ger never\n\t                intended to accept a transmitted\n\t                signal.\n\n\t                              KIRK\n\t                Capture God! In order to\n\t                retrieve V'ger's data, the\n\t                Creator has to physically come\n\t                here!...\n\n\t                              DECKER\n\t                And plug the signal directly into\n\t                the circuitry at this...\n\t                        (indicates into\n\t                         access)\n\t                ... point here, Captain. It\n\t                should pick up even a tricorder\n\t                playback.\n\n\t                              KIRK\n\t                        (lifting communicator)\n\t                Enterprise, I want that signal\n\t                again. Transmit!\n\n\t      Then Kirk touches a control on his tricorder exactly\n\t      as Decker did earlier. Then he looks up, reacts as\n\t      he sees Decker holding his own tricorder up -- and a\n\t      smile playing on Decker's face.\n\n\t379   ACTION ANGLE                                               379\n\n\t      as Kirk suddenly pivots, races toward Decker -- but he\n\t      passes too close to the \"Ilia\"-probe. It sends him\n\t      spinning back, tumbling to his knees.\n\n\t380   AT KIRK                                                    380\n\n\t      as KIRK starts up to scramble to his feet but Spock has\n\t      stepped in, putting a hand on Kirk's shoulder and re\n\t      straining him.\n\n\t                              SPOCK\n\t                Jim... he wants it.\n\n\t                              DECKER\n\t                You got the Enterprise, it's\n\t                what you wanted. This is what\n\t                I want.\n\t                              (smiles)\n\t                But, Jim...\n\t                              (now very seriously)\n\t                ... I'm the right choice for this\n\t                mission.\n\n\t      And then Decker shoves the tricorder into the access\n\t      hatch.\n\n\t381   VARIOUS EFFECTS SHOTS - DECKER BEING FUSED - V'GER         381\n\t      TRANSCENDING (S)\n\n\t      For just an instant nothing happens -- and then a \n\t      BLINDING SHAFT OF LIGHT STRIKES Decker. The color\n\t      becomes BRIGHTER AND BRIGHTER, begins spiraling through\n\t      the room. \"Ilia\" stes toward Decker, is caught in the\n\t      LIGHT, and instantly VANISHES in a BRILLIANT WHITE GLOW.\n\n\t      We SEE Decker seeming to grow larger -- as if his\n\t      molecular pattern is expanding. A SPECTACULAR SERIES\n\t      OF VISUALS., THE SPIRALING LIGHT enveloping the entire\n\t      area.\n\n\t      All this emanating from Decker's body, becoming LARGER\n\t      -- also BRIGHTER AND BRIGHTER until now it is almost\n\t      transparent. And the SPIRALING now expanding in all\n\t      directions, and the room itself starting to dissolve,\n\t      vanishing into nothingness -- and all commencing to\n\t      slip into the new dimension.\n\n\t      Kirk, Spock and McCoy stand transfixed another instant.\n\t      Around them, V'ger seems to be TRANSFORMING INTO BRIL-\n\t      LIANT, LOVELY PATTERNS. They all turn and race into\n\t      the complex in the direction of their vessel.\n\n\t382   EXT. EARTH ORBIT - AN ENERGY BOLT (S)                      382\n\n\t      It too seems to be flowering into loveliness, brilliant,\n\t      graceful patterns as they seem to slip through to another \n\t      dimension, vanishing.\n\n\t383   EXT. V'GER - FULL SHOT                                     383\n\t\n\t      The \"FLOWERING\" EFFECT now spreading outward, V'ger's\n\t      massive shape becoming a spiraling pattern of twisting,\n\t      graceful shapes and brilliant colors -- a transcendence\n\t      into another dimension.\n\t      And then all of that is left is a shimmering, jewel-like\n\t      point of light -- and then it too fades -- and reveals\n\t      there in the blue-black of space, the U.S.S. Enterprise.\n\n\t384   INT. BRIDGE - INCLUDING THE VIEWER (O)                     384\n\n\t      which shows now only space and its familiar star\n\t      patterns. All gaze at the viewer, awed at what they've\n\t      seen and undergone. They exchange looks silently, no\n\t      one wanting to be the first to try to comment on some-\n\t      thing which is beyond mere words. We HEAR an ELEVATOR\n\t      DOOR, Scott and Chapel ENTER the bridge and stand \n\t      silently watching.\n\n\t                              McCOY\n\t                Well, it certainly has been...\n\t                interesting.\n\n\t                              KIRK\n\t                Spock, we were its answer!\n\n\t                              SPOCK\n\t                        (nods)\n\t                Yes, Captain. It needed our\n\t                mortality, the fear of it, our\n\t                struggle against it, our fears,\n\t                our dreams...\n\n\t                              KIRK\n\t                ... and the 'foolish' emotions\n\t                which drive us?\n\n\t                              SPOCK\n\t                        (looks at Kirk; then)\n\t                I prefer your poet Dante's phrase\n\t                -- 'the divine restlessness of\n\t                the human spirit.'\n\n\t                              McCOY\n\t                Spock... you're quoting poetry?\n\n\t      Spock's cold look at McCoy is interrupted by:\n\n\t                              UHURA\n\t                Starfleet signal, Captain!\n\t                Return to orbital dockyard for\n\t                inspection.\n\n\t                              KIRK\n\t                Ignore that signal.\n\t                        (to Scott)\n\t                Shall we give the Enterprise a\n\t                proper shakedown, Mr. Scott?\n\n\t                              SCOTT\n\t                        (suddenly beaming)\n\t                I'd say it's time for that, I\n\t                would, sir.\n\t                        (toward Spock)\n\t                We can have you back on Vulcan\n\t                in four days, Mr. Spock.\n\n\t                              SPOCK\n\t                        (coolly)\n\t                I have no business on Vulcan,\n\t                Engineer.\n\n\t      Kirk and Spock exchange a look -- then Kirk turns to\n\t      the helm.\n\n\t                              KIRK\n\t                Ahead Warp One, Mr. Sulu.\n\n\t                              DIFALCO\n\t                Heading, sir?\n\n\t                              KIRK\n\t                        (taking center seat;\n\t                         indicates generally)\n\t                Out there.  Thataway.\n\n\t                              SPOCK\n\t                        (nods gravely)\n\t                A most logical choice, Captain.\n\n\t      Then the trace of a smile comes over Spock's face.\n\n\t385   EXT. SPACE - ENTERPRISE (S)                                385\n\n\t      Planet Earth in the distance, and receding in size as\n\t      the starship heads out the other direction.\n\n\t      FADE OUT.\n\n\t                              THE END\n\n\n\n\n\n\n\nStar Trek: The Motion Picture\nWriters :   Gene Roddenberry  Harold Livingston\nGenres :   Sci-Fi\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:36:19.529096"}