{"title": "Station West", "film_link": "/Movie Scripts/Station West Script.html", "script_link": "/scripts/Station-West.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Station West Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Station-West.jpg\" title=\"Station West Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Frank Fenton\" title=\"Scripts by Frank Fenton\">Frank Fenton</a><br/>  <a href=\"/writer.php?w=Winston Miller\" title=\"Scripts by Winston Miller\">Winston Miller</a><br/>  <a href=\"/writer.php?w=Luke Short\" title=\"Scripts by Luke Short\">Luke Short</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Western\" title=\"Western Scripts\">Western</a><br/><br/>\n<b>Script Date</b> : June 1947<br/>\n<b>Movie Release Date</b> : October 1948<br/>\n<br/>\n<a href=\"/scripts/Station-West.html\">Read \"Station West\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n<b>                                       STATION WEST\n</b>\n\n                                        Written by\n\n                              Frank Fenton &amp; Winston Miller\n\n\n                                   Based on a novel by\n\n                                        Luke Short\n\n\n\n<b>                                      SHOOTING DRAFT\n</b>\n<b>                                      JULY 22, 1947\n</b>\n<b>                \n</b>\n<b>               EXT. OPEN COUNTRY - DAY\n</b>\n<b>               FADE IN\n</b>\n               The sky is pure blue, exquisitely blemished by huge cumulus \n               clouds, floating lazily. A single bird sails past. From the \n               sky the CAMERA MOVES TO earth. Here, too, all is tranquil. \n               The trees, bright green in the sunlight, move only to the \n               slight but constant breeze. Now the CAMERA MOVES DOWN, \n               revealing a wagon to which is hitched a team of horses beside \n               the road. The wagon is at an awkward angle, but upright. It \n               is wedged between two rocks where the horses have pulled it \n               as they tried to reach some forage. Its seat is empty. In \n               the bed of the wagon several sacks lie, bearing the legend:\n\n                       From: Argus Mine - Rock Pass\n                       To: U.S. Assay Office\n                       San Francisco\n\n               The sacks are empty and slashed as by a knife. The ropes \n               that bound them are cleanly severed. The disorder in the \n               wagon indicates haste. Two horses are hitched to it, munching \n               grass or the high leaves of a tree overhead. All that is odd \n               or unnatural is that the reins have fallen askew and trail \n               the ground.\n\n               Now the CAMERA MOVES AWAY and ALONG tracks made by the wagon \n               when it left the road. ON THE ROAD two horses stand. These \n               are saddled, but riderless. The rifle holsters are empty.\n\n               CAMERA MOVES TO the ground. There on the road lies the rifle. \n               The dust is slightly blowing across it, moved by the \n               persistent summery little breeze. From the rifle, the CAMERA \n               MOVES ON A LITTLE and STOPS ABRUPTLY ON the sprawled dead \n               figure of a soldier, then another, face down in the road.\n\n               CLOSE SHOT of the dead soldiers, as the CAMERA HOLDS ON them. \n               Near the hand of one a revolver lies, the fine dust coating \n               it. Dust blowing over the uniforms, as though seeking to \n               hide the shame of a murder. As it blows over their still \n               figures, the SOUND of BIRDS coming over:\n\n<b>                                                                   FADE OUT\n</b>\n<b>               FADE IN\n</b>\n<b>               ROCK PASS - NIGHT\n</b>\n               This is a western mining town of the Eighties that has \n               mushroomed up around a gold strike. On the streets prospectors \n               and miners mingle with merchants. As the CAMERA PICKS UP the \n               scene, a lumber wagon passes, bearing logs, a ten team wagon, \n               its trailer filled with ore from the stamp mills and bearing \n               the legend: ARGUS MINE. A stage coach comes in as we:\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               INT. HOTEL - NIGHT\n</b>\n               On the hotel clerk, as he sits behind the desk, playing a \n               guitar and singing pensively the ballad of the story. As he \n               sings, JOHN HAVEN, newly arrived on the stagecoach, walks \n               in, gazes at the clerk with a slight smile, finding the clerk \n               completely indifferent to the arrival of anybody, at last \n               leaves the bag and saunters out.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               EXT. SALOON - NIGHT\n</b>\n               As Haven leaves the hotel and has reached the saloon, a well-\n               lighted, plush-looking spot, illumined by kerosene flares. \n               Sticking a pipe in his mouth, Haven saunters in.\n\n<b>               INT. CHARLIE'S SALOON - EVENING\n</b>\n               It is a huge elaborate room, lit by overhead chandeliers. A \n               long mahogany bar runs the length of it. To one side there \n               is a big stove and the gambling tables. Beyond can be seen \n               pool tables in an alcove. To another side, a man grinds away \n               at a piano. A stairway near the end of the bar leads to an \n               upper floor. The place is crowded and noisy with people. \n               Haven saunters towards the dice table, pauses, watches; he \n               is looking the crowd over carefully -- missing no detail of \n               the place or the people in it. When his turn comes, he picks \n               up the dice, bets all over the place -- on the line, on the \n               odds, on the seven, then on the come, the hard way, etc. His \n               point is eight.\n\n<b>                                     STICKMAN\n</b>                         Eight the hard way! Pay the line!\n\n               Haven bets again, doubling all over the table.\n\n<b>                                     STICKMAN\n</b>                         Seven a winner.\n\n               Players glance at the newcomer. Prince appears from nowhere, \n               standing behind the stickman, watching. Prince is slender, \n               black-haired, handsome and impassive. Haven throws again. \n               Stellman, an Army officer, watches curiously. There is a \n               little rising murmur as Haven tosses another natural. He \n               does it without enthusiasm or any lost movement. The bettors \n               get down on him. Prince touches the stickman's arm; the man \n               stands aside and Prince takes his place with the stick. Prince \n               tosses the dice back to Haven. Haven's eyes are fixed on \n               him. With a little smile, Haven throws the dice to the next \n               man, picks up his winnings.\n\n<b>                                     HAVEN\n</b>                         No, thanks...\n\n               His eyes meet Prince's again and then he turns away, Prince's \n               gaze following him curiously, Stellman looks at Prince.\n\n<b>                                     STELLMAN\n</b>                         Know him?\n\n<b>                                     PRINCE\n</b>                         No. Why?\n\n<b>                                     STELLMAN\n</b>                         He just seems kind of free with that \n                         money.\n\n               CAMERA FOLLOWS Haven, as still smiling slightly, he heads \n               towards the bar, searching the faces of the crowd as he goes. \n               Two miners are squared off for a fight and Haven, going his \n               way, walks between them, very indifferent, not even glancing \n               back at the SOUND of scuffle behind him.\n\n               AT THE BAR - Haven alone is not watching the fight. All the \n               others have turned to see it; even the barman is busy \n               watching. But Haven's eyes are resting on the figure of a \n               woman now at the piano, singing. Softly, as if to herself \n               and for her own enjoyment. He is near the end of the bar and \n               near the piano, and since no one else listens to her at this \n               moment, she sings, half smiling, directly for him, and then, \n               self-consciously, she stops and turns to sit at a table, as \n               Haven watches her. Behind them the fight is being stopped \n               and Charlie's eyes follow the huge bouncer, Mick Marion, as \n               he drags the offenders out to the door and the street. All \n               is as usual. The bartender is back at work. As Haven turns, \n               he finds that the place beside him is now occupied by the \n               young Lieutenant (Phil Stellman). Haven glances at the \n               uniform, then at the pleasant face of the officer, as the \n               barman comes up.\n\n<b>                                     HAVEN\n</b>                              (to barman)\n                         Whiskey -- like you'd pour it for \n                         yourself.\n\n               A girl sidles up to him, blonde, brash and pretty.\n\n<b>                                     BLONDE\n</b>                         Don't you know it's no fun to drink \n                         alone?\n\n<b>                                     HAVEN\n</b>                         Not till after the first one.\n\n               He turns his back to her; she gives him a look and saunters \n               off. The barman produces the drinks -- a beer for Stellman, \n               the young officer. The barman folds his arms. Stellman looks \n               at Haven.\n\n<b>                                     STELLMAN\n</b>                         You a stranger here?\n\n<b>                                     HAVEN\n</b>                              (to barman, after \n                              gulping it in one \n                              gulp)\n                         What kind of whiskey was that?\n\n<b>                                     BARMAN\n</b>                         On the bottle it says Rye -- but the \n                         way you take it, I don't see what \n                         difference it makes.\n\n               Haven smiles at him.\n\n<b>                                     HAVEN\n</b>                         Another Rye.\n\n               The barman turns to get it. Stellman is still looking at \n               Haven.\n\n<b>                                     STELLMAN\n</b>                              (easily)\n                         You didn't answer my question.\n\n<b>                                     HAVEN\n</b>                         I'm a stranger everywhere.\n\n<b>                                     STELLMAN\n</b>                         Got a job?\n\n               The barman gives Haven another Rye.\n\n<b>                                     HAVEN\n</b>                         Listen, soldier. I know that one, \n                         too. Got a job, stranger? No? Why \n                         don't you join the Army? Three meals \n                         a day, a place to sleep, a nice warm \n                         uniform --\n\n<b>                                     STELLMAN\n</b>                         It has a little more than that.\n\n<b>                                     HAVEN\n</b>                              (deliberately)\n                         Yeah, it has one thing more, and \n                         that's what I could never take --\n                              (looking at Stellman's \n                              stripes)\n                         It's got Second-Lieutenants.\n\n               The barman, listening, senses trouble and signals with his \n               eyes to a big bouncer down the bar. The bouncer moves up \n               quietly.\n\n<b>                                     STELLMAN\n</b>                         If you want to make it a personal \n                         matter --\n\n<b>                                     HAVEN\n</b>                              (coldly)\n                         I don't make it anything, soldier. \n                         You tried to sell something and I \n                         didn't buy it -- so why don't you \n                         just beat it?\n\n               They stare at each other for a long second, then Stellman \n               speaks icily:\n\n<b>                                     STELLMAN\n</b>                         If I weren't in uniform, I might \n                         teach you some manners.\n\n<b>                                     HAVEN\n</b>                         If you could teach me anything, you \n                         wouldn't be in a uniform.\n\n               Stellman's jaw tightens; then he turns and exits abruptly. \n               The barman sighs with relief; the bouncer turns away.\n\n<b>                                     BARMAN\n</b>                         You couldn't be looking for trouble, \n                         could you?\n\n<b>                                     HAVEN\n</b>                         I could, but I'm not.\n\n<b>                                     BARMAN\n</b>                         That's fine, because this is one of \n                         the best places West of the Atlantic \n                         Ocean to find it.\n\n<b>                                     HAVEN\n</b>                         That was my first impression.\n\n<b>                                     BARMAN\n</b>                              (as Haven looks at \n                              him)\n                         That Lieutenant's a nice young boy.\n\n<b>                                     HAVEN\n</b>                         I don't doubt it, but his mouth is \n                         too big -- like your ears.\n\n               He turns away from the bar, after flipping a coin on to it, \n               while the barman stands there not knowing whether to be angry \n               or philosophical.\n\n               CAMERA FOLLOWS Haven, as he threads his way through the tables \n               towards the door. His eyes catch sight of the girl who sang \n               at the piano, Charlie. She is sitting at a table with Prince. \n               Prince murmurs to her and she glances at Haven, then looks \n               away again. Haven notes it. As he comes near the table, the \n               blonde who spoke to him at the bar, accosts him again.\n\n<b>                                     BLONDE\n</b>                         How is it now?\n\n<b>                                     HAVEN\n</b>                         What?\n\n<b>                                     BLONDE\n</b>                         Drinking alone?\n\n<b>                                     HAVEN\n</b>                              (flipping her a coin)\n                         It's all right -- try it.\n\n               Haven is looking at Charlie. She is checking a stack of coins \n               the blonde has turned in to her. She glances up with a \n               fleeting smile at Haven.\n\n<b>                                     CHARLIE\n</b>                         It's not a good habit if it makes \n                         you pick fights.\n\n<b>                                     HAVEN\n</b>                         Only with Second Lieutenants.\n\n<b>                                     CHARLIE\n</b>                         We like Second Lieutenants here.\n\n               Their gazes meet and Prince notes it with narrowing eyes. \n               The gaze holds like a spell, and then Charlie's smile comes \n               back, from nowhere.\n\n<b>                                     CHARLIE\n</b>                         You see -- here everybody fights, \n                         except the Army.\n\n               Haven looks at her, fascinated. She can feel a fascination \n               herself. Now Haven smiles a little.\n\n<b>                                     HAVEN\n</b>                         I wouldn't know --\n\n<b>                                     CHARLIE\n</b>                              (still smiling)\n                         So anyone who doesn't like the Army --\n\n<b>                                     HAVEN\n</b>                         I know what you mean, but I'm afraid \n                         I'll have to come back. I like the \n                         way you sing.\n\n               She looks at him in a second's silence. Haven turns and \n               leaves. She watches him go. Prince studies her face, his own \n               grim. A croupier comes up and places a paper before her. She \n               hardly notices it.\n\n<b>                                     CROUPIER\n</b>                         Okay, Charlie?\n\n               Charlie snaps out of it long enough to initial the paper.\n\n<b>                                     CHARLIE\n</b>                         That's his limit.\n\n<b>                                     CROUPIER\n</b>                         There's a sucker getting hot with \n                         the dice at Ed's table.\n\n               He turns away. Prince sits still, his eyes on Charlie, his \n               slim fingers at an habitual trick, that of idly stacking \n               dice in a little pillar and then picking the pillar aloft by \n               holding the lowest dice pinched between the thumb and \n               forefinger, NOT by the edges, but by the sides. Now he does \n               it as he watches Charlie's face. Her eyes glance again at \n               the disappearing back of Haven. The sense of fascination \n               seems to have gotten her, too. Then she realizes the presence \n               of Prince and his shrewd gaze. She looks at him coolly.\n\n<b>                                     CHARLIE\n</b>                         Well -- cool him off.\n\n               Prince flips the dice into his palm and rises...\n\n<b>               EXT. OUTSKIRTS OF TOWN - NIGHT\n</b>\n               The board sidewalk has given way to a rutty dirt road. Now \n               the racket of the saloon street is just a ghost of noise, \n               the road dark and silent. Haven has emerged from the saloon. \n               He glances up the street. Fifty yards ahead, Stellman is \n               walking slowly. Stellman pauses, shoots a quick glance \n               backwards, then goes on. Haven follows, going leisurely up \n               the street after Stellman.\n\n               ANGLE on a corner as Stellman turns it, pauses and waits. \n               When Haven reaches it, Stellman goes on in silence.\n\n<b>               EXT. MRS. CASLON'S MINE-CABIN - NIGHT\n</b>\n               As Stellman reaches it, pauses and glances behind him. Then \n               he rings a bell. Haven comes up and waits in silence, glancing \n               at the dark interior. A woman's face now peers through the \n               door window and then the door opens. Stellman enters quickly \n               and Haven follows.\n\n<b>               INT. MRS. CASLON'S MINE-CABIN - NIGHT\n</b>\n               As Stellman and Haven follow Mrs. Caslon to a rear door. \n               Looking around, Haven notes in the shadows a desk and in a \n               corner the big safe. (This room is described in a subsequent \n               scene.) So as to emit the least light, Mrs. Caslon lets \n               Stellman and Haven go through, then quickly follows them and \n               quickly shuts the door.\n\n<b>               INT. MRS. CASLON'S LIVING ROOM - NIGHT\n</b>\n               It is remarkably neat and elegant inside. As Haven, glancing \n               around, pauses inside, he finds himself facing a burly \n               uniformed cavalry officer, captain's bars gleaming on the \n               side of his collar. The captain is big and broad and scowling. \n               He is standing by the fireplace and his eyes are boring into \n               Haven's with curiosity and perhaps, suspicion. Stellman steps \n               forward as Haven and the captain are measuring each other.\n\n<b>                                     STELLMAN\n</b>                         Captain Iles -- the Commanding Officer \n                         of the Post.\n\n               Haven gives a casual nod.\n\n<b>                                     STELLMAN\n</b>                         Mr. Haven -- sir.\n\n               Iles looks him up and down. Haven hands him an envelope which \n               he slips into his tunic without removing his gaze from Haven.\n\n<b>                                     ILES\n</b>                         I see you finally got here.\n\n<b>                                     HAVEN\n</b>                              (pleasantly)\n                         I seem to finally get everywhere.\n\n               They eye each other, Iles scowling, Haven thinly smiling. \n               The sense of conflict is already between them.\n\n<b>                                     ILES\n</b>                              (introducing)\n                         Mrs. Caslon, -- Mr. Haven.\n\n               She nods and smiles warmly.\n\n<b>                                     ILES\n</b>                         You've met Mr. Stellman.\n\n               Haven nods.\n\n<b>                                     STELLMAN\n</b>                         It came off beautifully. He picks a \n                         very good fight. In fact, I think \n                         I'm still a little sore at him.\n\n<b>                                     ILES\n</b>                              (grunting)\n                         Sit down, Mr. Haven.\n\n<b>                                     HAVEN\n</b>                         Thank you, Captain.\n\n               He sits down. Iles is still studying Haven.\n\n<b>                                     ILES\n</b>                         So you're operating under sealed \n                         orders.\n\n               Haven nods agreeably.\n\n<b>                                     ILES\n</b>                              (disgruntled)\n                         All this mumbo jumbo is characteristic \n                         of the Military Information \n                         Department.\n\n<b>                                     HAVEN\n</b>                         We use it as sparingly as possible.\n\n               Iles pulls out a cigar, lights it, sizing Haven up.\n\n<b>                                     ILES\n</b>                         I've been in this territory for a \n                         number of years -- and I think it \n                         might be a little rougher here than \n                         a suburb of Washington, D.C.\n\n<b>                                     HAVEN\n</b>                         Very possibly.\n\n<b>                                     ILES\n</b>                         Then why is M.I.D. sending you out \n                         here?\n\n<b>                                     HAVEN\n</b>                         Because two soldiers have been \n                         murdered.\n\n<b>                                     ILES\n</b>                         And they think I can't handle that?\n\n<b>                                     HAVEN\n</b>                         They merely know you haven't.\n\n               There is a tight little silence, while Iles formulates his \n               dislike for this newcomer.\n\n<b>                                     ILES\n</b>                         I have only ninety-four men on the \n                         post, with Indian trouble up north. \n                         The War Department has refused to \n                         send reinforcements, or am I boring \n                         you?\n\n<b>                                     HAVEN\n</b>                              (looking bored)\n                         I'm not the War Department.\n\n<b>                                     ILES\n</b>                              (explaining)\n                         The two soldiers were killed while \n                         escorting one of the gold stages.\n\n<b>                                     HAVEN\n</b>                              (quietly)\n                         Is escorting gold a function of your \n                         command?\n\n<b>                                     ILES\n</b>                         Young man, the functions of my command \n                         look very pretty on paper, but they're \n                         not very practical in a territory \n                         like this. Do you have any illusions \n                         about that?\n\n<b>                                     HAVEN\n</b>                         I have no illusions about anything.\n\n               Haven takes out his pipe and fills it.\n\n<b>                                     HAVEN\n</b>                         What's happening to the gold?\n\n<b>                                     ILES\n</b>                         I've permitted it to be stored in a \n                         warehouse on the post. Now everybody \n                         is waiting to see what I do next.\n\n<b>                                     HAVEN\n</b>                         What do you do next?\n\n<b>                                     ILES\n</b>                              (with sarcasm)\n                         Aren't you here to tell me?\n\n<b>                                     HAVEN\n</b>                              (lighting the pipe)\n                         Captain, you're in a bad way.\n                              (going over to discard \n                              the match)\n                         Wells Fargo won't convoy gold. You \n                         tried and failed and two men are \n                         dead. The gold is piling up on the \n                         post and you can't move it. Your \n                         post is under-manned. You want the \n                         Quartermaster at Platte to replace \n                         seventy uniforms sent to the freight \n                         office at West Rim City --\n\n<b>                                     ILES\n</b>                         The freight building burned down \n                         with the uniforms! I'm not operating \n                         a fire department -- and if I was, \n                         West Rim City is sixty miles away!\n\n<b>                                     HAVEN\n</b>                         That doesn't concern me either.\n\n<b>                                     ILES\n</b>                         What does?\n\n<b>                                     HAVEN\n</b>                         The killing of two soldiers.\n\n<b>                                     ILES\n</b>                         They were my men, Haven, and I'm \n                         trying every way I know to find out \n                         who murdered them.\n\n<b>                                     HAVEN\n</b>                         So will I.\n\n               For the first time Iles looks amicably at him, as though \n               realizing that after all the man isn't there to criticize \n               him.\n\n<b>                                     ILES\n</b>                         You'll find it harder than you think. \n                         I don't know how you operate, but \n                         it's a dangerous job that can get \n                         you killed.\n\n               He smiles slightly at Iles, who gives him a slight smile in \n               return, somehow intrigued by this nonchalance. Haven rises \n               from the chair, lighting the dead pipe in vain.\n\n<b>                                     HAVEN\n</b>                         Perhaps I can get some help from the \n                         Sheriff.\n\n<b>                                     ILES\n</b>                         You can forget him. He's a miserable \n                         man that somebody is using to keep \n                         the law a joke.\n\n<b>                                     HAVEN\n</b>                         You make it sound very difficult. \n                         Why don't you just wrap up your flag \n                         and take it back East with you?\n\n<b>                                     ILES\n</b>                              (smarting)\n                         Tell me, how will I know what you're \n                         doing?\n\n<b>                                     HAVEN\n</b>                         I'll let you know from time to time.\n\n<b>                                     ILES\n</b>                              (coldly)\n                         That's very obliging of you.\n\n<b>                                     HAVEN\n</b>                         But I don't want to visit the Army \n                         post.\n\n<b>                                     ILES\n</b>                         Then report to me through Mrs. Caslon \n                         here. You can be a friend of her \n                         husband's. He owned the Argus mine \n                         and died last year. If that meets \n                         your approval.\n\n               Haven glances at Mrs. Caslon, smiles back at Iles.\n\n<b>                                     HAVEN\n</b>                         Only if it meets with hers.\n\n<b>                                     MRS. CASLON\n</b>                         I'd be delighted to help.\n                              (she smiles at Haven)\n\n<b>                                     ILES\n</b>                              (grim at the smile)\n                         Is that all?\n\n<b>                                     HAVEN\n</b>                         I think so.\n\n               Iles marches out abruptly, followed by Stellman. The door \n               shuts. Haven smiles after him, then at Mrs. Caslon.\n\n<b>                                     MRS. CASLON\n</b>                         He really isn't that abrupt -- he --\n\n               The door opens again, smartly, Iles marches back in, kisses \n               Mrs. Caslon on the cheek.\n\n<b>                                     ILES\n</b>                         Goodnight, Mary.\n\n<b>                                     MRS. CASLON\n</b>                              (warmly)\n                         Goodnight, George.\n\n               Then he marches out again, shutting the door after him.\n\n<b>                                     MRS. CASLON\n</b>                         You see?\n\n<b>                                     HAVEN\n</b>                         I see.\n\n<b>                                     MRS. CASLON\n</b>                         I think he secretly likes you.\n\n<b>                                     HAVEN\n</b>                         He's a man who can sure keep a secret.\n\n<b>                                     MRS. CASLON\n</b>                              (smiles)\n                         Would you like a little sherry?\n\n<b>                                     HAVEN\n</b>                         Only if you have some too.\n\n               She goes over to a sideboard and pours a little from a \n               decanter into two wine glasses. Haven watches her. For the \n               first time he realizes she is a very attractive woman. She \n               smiles as she brings him the wine.\n\n<b>                                     HAVEN\n</b>                         Thank you.\n\n<b>                                     MRS. CASLON\n</b>                         To your good luck.\n\n               Haven nods and they sip.\n\n<b>                                     HAVEN\n</b>                         What mine did the two soldiers try \n                         to convoy the gold from?\n\n<b>                                     MRS. CASLON\n</b>                         My mine -- The Argus.\n\n<b>                                     HAVEN\n</b>                              (smiling a little)\n                         That brings me to a question I decided \n                         not to ask.\n\n<b>                                     MRS. CASLON\n</b>                              (smiling back at him)\n                         Then I'll answer it first. Captain \n                         Iles has asked me to marry him.\n\n<b>                                     HAVEN\n</b>                         I can understand that.\n\n<b>                                     MRS. CASLON\n</b>                              (quietly)\n                         But you can't understand why Captain \n                         Iles should be involved in the gold \n                         business.\n\n<b>                                     HAVEN\n</b>                              (smiling)\n                         I do now.\n\n<b>                                     MRS. CASLON\n</b>                         It isn't just mine. You must realize \n                         there's a lot of gold from all over \n                         the territory stored at the post \n                         warehouse.\n\n<b>                                     HAVEN\n</b>                         How much.\n\n<b>                                     MRS. CASLON\n</b>                         Perhaps as much as half a million.\n                              (worried now)\n                         In fact, I have about fifty thousand \n                         in my safe now.\n\n<b>                                     HAVEN\n</b>                         Who is doing all this?\n\n<b>                                     MRS. CASLON\n</b>                         I don't know... that's the worst \n                         part of it... not knowing.\n\n<b>                                     HAVEN\n</b>                              (puts down the glass, \n                              pats her shoulder \n                              with casual \n                              reassurance)\n                         I might find out.\n\n               He starts for the door and she follows him. At the open door \n               he pauses.\n\n<b>                                     MRS. CASLON\n</b>                         Don't get into trouble --\n\n<b>                                     HAVEN\n</b>                         That's why I'm here.\n\n<b>                                     MRS. CASLON\n</b>                         I know, but --\n\n<b>                                     HAVEN\n</b>                         Don't worry about it. Trouble and I \n                         are old enemies. We understand each \n                         other.\n                              (he grins at her)\n                         Goodnight.\n\n<b>                                     MRS. CASLON\n</b>                              (smiling again)\n                         Good luck.\n\n               Haven walks out and she closes the door thoughtfully and \n               turns away. In a moment the door opens and Haven reenters \n               and crosses to her much in the manner that we have seen \n               Captain Iles do so. Haven stops.\n\n<b>                                     HAVEN\n</b>                         You didn't tell me your husband's \n                         name.\n\n<b>                                     MRS. CASLON\n</b>                         Ben.\n\n<b>                                     HAVEN\n</b>                              (repeating it)\n                         Ben.\n\n               He turns and goes out the door. Mrs. Caslon stands smiling \n               after him. The smile fades for a moment -- then she dismisses \n               it with a shrug.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               EXT. MAIN STREET - NIGHT\n</b>\n               As Haven saunters along. He pauses, glances up at a sign \n               that reads: HOTEL. Then he enters the dingy building.\n\n<b>               INT. HOTEL - NIGHT\n</b>\n               As Haven enters the small dismal lobby, and goes over to the \n               desk, where a little man, Orville Weekly sits, singing to \n               himself softly and strumming an accompaniment on a battered \n               guitar. As Haven stands there the clerk finishes the verse \n               about the stranger. Haven nods approval. The clerk looks at \n               him shrewdly.\n\n<b>                                     ORVILLE\n</b>                         Evenin' stranger.\n\n<b>                                     HAVEN\n</b>                         You must know everybody in town.\n\n<b>                                     ORVILLE\n</b>                         Everybody but one. I don't know you.\n\n<b>                                     HAVEN\n</b>                         What's your name? You seem to be a \n                         pretty clever fellow.\n\n<b>                                     ORVILLE\n</b>                         Orville Weekly, and I can't be a \n                         total blank. I been here six years \n                         and I ain't dead yet.\n\n<b>                                     HAVEN\n</b>                         Have you got a vacant room?\n\n<b>                                     ORVILLE\n</b>                         Day, week, month?\n\n<b>                                     HAVEN\n</b>                         I don't always know. And the way you \n                         talk a man couldn't be very sure.\n\n<b>                                     ORVILLE\n</b>                         Then it's eight bucks, cash in \n                         advance.\n\n               Haven puts down the money; the clerk spins the registry to \n               him, watches as Haven signs it. And he can read that way.\n\n<b>                                     ORVILLE\n</b>                         From Arizona, huh?\n\n<b>                                     HAVEN\n</b>                         No -- I always put down where I'm \n                         going next -- so I won't forget.\n\n               The clerk spits, hands him a key.\n\n<b>                                     ORVILLE\n</b>                         Room ten -- end of the hall. Make \n                         your own bed. Furnish your own towels. \n                         Your bag's over there.\n\n<b>                                     HAVEN\n</b>                              (picking up the key)\n                         Thanks a lot for the key. I'll be \n                         back later.\n\n               Haven crosses to exit into the street.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               INT. CHARLIE'S SALOON - NIGHT\n</b>\n               As Haven enters. It is crowded. Haven pauses by a table. He \n               sees Charlie at the piano singing. He sees Mick cross to \n               Prince and say something, then Prince gazes in his direction. \n               Haven's eyes meet those of Prince suddenly turned to him, \n               cold as glass. Charlie, seeing that Haven is watching and \n               listening to her impromptu singing, stops and makes her way \n               through the crowd towards a booth off the dance floor. Haven's \n               eyes follow her.\n\n               MED. SHOT - of booth as Charlie sits down. A sandwich is \n               waiting for her. She takes a bite of it, then glances up to \n               see Haven standing beside the table.\n\n<b>                                     HAVEN\n</b>                         How about eating alone? Is that a \n                         bad habit too?\n\n<b>                                     CHARLIE\n</b>                         Just when you have to pay for it.\n\n<b>                                     HAVEN\n</b>                         It's only money.\n                              (sitting down)\n                         I've changed my mind since I left \n                         here awhile ago. I don't want to \n                         pick a fight -- or break the bank -- \n                         or --\n\n<b>                                     CHARLIE\n</b>                              (evenly)\n                         What changed your mind?\n\n<b>                                     HAVEN\n</b>                              (grins)\n                         That's what I came back to find out.\n\n               Charlie glances at him, then at the crowd where Mick Marion \n               stands beside Prince. Both are looking coldly towards the \n               booth. Haven's gaze follows hers towards Mick, as Prince \n               leaves the big man.\n\n<b>                                     CHARLIE\n</b>                         Maybe it would be better if you found \n                         another girl.\n\n<b>                                     HAVEN\n</b>                              (smiling)\n                         No, it wouldn't... I looked.\n\n               She smiles slightly back at him, glances away towards Mick. \n               Haven looks too, curiously. Mick is still watching, coldly. \n               Others glance too, as though this were an unexpected thing. \n               Mick takes a drink from a passing waiter; kills it in one \n               gulp. Haven looks back at Charlie's face and smiles.\n\n<b>                                     HAVEN\n</b>                         That man in ape's clothing -- could \n                         he be Charlie?\n\n<b>                                     CHARLIE\n</b>                         No.\n\n<b>                                     HAVEN\n</b>                         His eyes follow you around like a \n                         couple of flies.\n\n<b>                                     CHARLIE\n</b>                         They follow me to see that strangers \n                         don't annoy me.\n\n<b>                                     HAVEN\n</b>                         Only strangers?\n\n<b>                                     CHARLIE\n</b>                         No one else would be so foolish.\n\n<b>                                     HAVEN\n</b>                         First, you're beautiful. Then I like \n                         the way you sing -- and now you're a \n                         woman of mystery.\n                              (to a passing waiter)\n                         Champagne?\n\n               The waiter nods and leaves. Charlie is still gazing at Haven \n               with that slight provocative smile.\n\n<b>                                     HAVEN\n</b>                         I don't want to be a stranger, so \n                         I'll have to be foolish.\n\n<b>                                     CHARLIE\n</b>                         You like to take chances, don't you?\n\n<b>                                     HAVEN\n</b>                         If I feel lucky.\n\n<b>                                     CHARLIE\n</b>                         Then I'd advise you to try the dice \n                         table.\n\n<b>                                     HAVEN\n</b>                         I'd rather get lucky here.\n\n<b>                                     CHARLIE\n</b>                              (shrugging)\n                         Every man has a right to go to his \n                         own funeral.\n\n<b>                                     HAVEN\n</b>                              (as the waiter sets \n                              down the champagne \n                              and glasses)\n                         I could be your cousin from \n                         Waxahatchio. I could be cousin John, \n                         a missionary on his way to China.\n\n               The waiter leaves, as Charlie still regards Haven with a \n               curious interest. Haven is glancing again toward Mick, just \n               as that animal barrels down another whiskey.\n\n<b>                                     HAVEN\n</b>                         He seems to be a lot of man.\n\n<b>                                     CHARLIE\n</b>                         The most in town.\n\n               At this moment Prince comes into scene and sits at the table. \n               Haven looks at him but Charlie offers no introduction.\n\n<b>                                     HAVEN\n</b>                         It's a very small town.\n                              (he sips and gazes \n                              around)\n                         You could get it all in this saloon.\n\n<b>                                     CHARLIE\n</b>                         We usually do.\n\n<b>                                     HAVEN\n</b>                         So Charlie probably runs the town.\n\n<b>                                     PRINCE\n</b>                              (toying with his dice)\n                         Why do you care?\n\n<b>                                     HAVEN\n</b>                         I'm going to spend some time here. I \n                         want to know who winds the clock.\n\n               He glances up and a slow smile comes over his face as Mick \n               Marion is seen approaching deliberately and with cold menace. \n               Her eyes follow his, then back to his face.\n\n<b>                                     CHARLIE\n</b>                         It's been a nice conversation. I \n                         hate to have it end.\n\n               Blank-faced and big, Mick arrives at the booth. He stares \n               from Charlie to Haven. Haven looks at him then at Charlie. \n               Charlie watches Haven's face, but the smile remains. It seems \n               to sway her, this little test of expression.\n\n<b>                                     MICK\n</b>                         Who's this?\n\n<b>                                     CHARLIE\n</b>                              (after a taut pause)\n                         Mick -- this is -- cousin John.\n\n<b>                                     HAVEN\n</b>                              (relieved)\n                         From Waxahatchie.\n\n               Mick is not quite sure.\n\n<b>                                     MICK\n</b>                         What's keeping him?\n\n<b>                                     PRINCE\n</b>                         I think he's wondering if he couldn't \n                         do more good here.\n\n               Haven senses now it is a little game they're playing together \n               on him. His smile remains. He reaches for the bottle, his \n               hand grasping the base of it, just as Mick reaches for it \n               too, clenching the top. Mick lifts at it; Haven's hand holds. \n               They look at each other as this little game of strength goes \n               on.\n\n<b>                                     MICK\n</b>                         You aren't very friendly, are you, \n                         mister?\n\n<b>                                     HAVEN\n</b>                              (quoting)\n                         A friend to all is a friend to none.\n\n<b>                                     PRINCE\n</b>                         You ought to learn not to pick 'em \n                         so easy, like you do your cousins.\n\n<b>                                     HAVEN\n</b>                              (indicating Charlie)\n                         Ask her?\n\n<b>                                     CHARLIE\n</b>                              (coolly)\n                         I never saw him before in my life.\n\n               That does it. Mick wrenches at the bottle, and as he does \n               so, Haven releases his grip. The bottle shoots up. The wine \n               spills over Mick's face and clothes. Infuriated, Mick flings \n               the bottle at Haven, but Haven ducks as he comes out of the \n               chair. The bottle crashes against the wall, and Haven's fist \n               crashes against Mick. The big man grunts and staggers back, \n               but he doesn't drop. As Haven sets himself, he is suddenly \n               pinned from behind by two bouncers. Mick stands still, staring \n               at him, his cut lip bleeding.\n\n<b>                                     MICK\n</b>                              (icily)\n                         You're too little to make that big a \n                         mistake.\n\n<b>                                     HAVEN\n</b>                         You want to correct me or just bleed \n                         at the mouth?\n\n               There is a dead silence. At the crap table the dice read \n               seven but no one looks at them, all turning toward the scene. \n               A minor rises and the girl on his lap hits the floor. A drunk \n               steals a drink and no one sees him. (Business with glass) \n               Prince looks on coldly. Mark Bristow, moving up from the \n               dice table, pauses and stares.\n\n<b>                                     MICK\n</b>                              (coldly)\n                         Bring him outside.\n\n               The two bouncers start with Haven toward the door, Mick \n               following. A rear rises and men begin following in their \n               silent wake. Only the guy at the piano keeps on playing: he \n               never stops.\n\n               ANGLE on Charlie as she rises. Bristow and Prince have \n               sauntered over to her as the place empties, leaving only the \n               piano player.\n\n<b>                                     BRISTOW\n</b>                         What happened?\n\n<b>                                     CHARLIE\n</b>                              (casually)\n                         A misunderstanding.\n\n<b>                                     PRINCE\n</b>                         Did you find out what he wants?\n\n<b>                                     CHARLIE\n</b>                              (starting out)\n                         He wanted to be my cousin.\n                              (they follow her)\n                         Only I haven't any aunts or uncles.\n                              (still casually)\n                         But you never know -- and the least \n                         I can do is bury him.\n\n               Prince lets go with one of his rare smiles as he looks \n               admiringly at Charlie. They reach the door. The crowd opens \n               for them a little.\n\n<b>               EXT. SALOON - NIGHT\n</b>\n               As Mick and Haven come out; the crowd makes a noisy clearing. \n               There are bets going down. As soon as the crowd has formed \n               an open space, Haven wheels and smacks Mick across the face \n               hitting with the heel of the hand, so that Mick rocks back \n               almost going down. There is dead silence. Mick sets himself \n               for the Kill, as he peels his coat.\n\n               Bristow is shaking with excitement.\n\n<b>                                     BRISTOW\n</b>                         Mick will kill him.\n\n<b>                                     CHARLIE\n</b>                         That's ten to one.\n\n<b>                                     BRISTOW\n</b>                              (grinning)\n                         I don't like the other fellow's \n                         chances, but I'm a sucker for odds.\n\n<b>                                     CHARLIE\n</b>                         You should always bet on a champion. \n                         Then you can only lose once.\n\n<b>                                     BRISTOW\n</b>                         You give ten to one...?\n                              (she nods)\n                         I'll take it.\n\n<b>                                     CHARLIE\n</b>                         You're down. A thousand to a hundred.\n\n               As they stare at the fight --\n\n               FULL SHOT - fight scene. As Mick is slowly advancing toward \n               Haven. He suddenly swings a haymaker which Haven easily ducks, \n               another and another that Haven evades.\n\n<b>                                     HAVEN\n</b>                         Don't miss so much. You'll got tired.\n\n               Mick misses again, fiercely and Haven cracks him one in the \n               midriff. Then steps out fast and waits.\n\n               Mick charges and Haven catches him full in the mouth. It \n               stops Mick, and then Haven socks him again, this time with \n               the butt of his hand -- open palm -- on the nose. Mick is \n               surprised, tasting the blood on his hurt lips.\n\n               ANGLE on Charlie, Mark and Prince, as they watch. Charlie's \n               eyes are fixed with a kind of admiration on Haven. Prince \n               watches without interest. Mark is tense and excited.\n\n<b>                                     BRISTOW\n</b>                         He can fight a little.\n\n<b>                                     CHARLIE\n</b>                         A little won't be enough.\n\n               But you feel she wishes it might...\n\n               ANGLE on the fight.\n\n<b>                                     MICK\n</b>                         Stand still and fight.\n\n               As Mick closes again, Haven stops quickly to one side, \n               clipping him behind the ear as he goes by. But this time \n               Mick keeps after Haven and finally connects. It is more of a \n               push than a clean hit, but even so the force of it drives \n               Haven off balance and he sprawls on his back. As Mick, sensing \n               victory, charges, Haven knows he can't get to his feet in \n               time, so he turns his body and springs at Mick's knees \n               shoulder first. The impact spills Mick on his face; before \n               he can recover, Haven dives on him, hands flat on his own \n               chest and palms turned out. His body crashes heavily, angling \n               across Mick's head, and Haven's savagely pushing hands mash \n               the other man's face into the hard ground. Then he rolls \n               clear and comes to his feet, breathing easily, waiting. Mick \n               gets up, shaking his head to clear it, mad and hurt. As he \n               closes ponderously in on Haven, his booted foot suddenly \n               shoots out. Haven twists his knee cap away but takes the \n               blow on the inside of his thigh, numbing the leg so that he \n               almost goes down. And now Mick gets to him. His great arms \n               close around Haven's waist, his hands locked in the small of \n               Haven's back. Haven braces himself against the crushing \n               squeeze, tensing his back muscles and stiffening his spine, \n               but there is nothing he can do against the implacable brute \n               power of the other man.\n\n               The sweat stands out on Haven's face as Mick's great strength \n               bends him over farther and farther. He must do something, \n               and soon, or his back will be cracked like a barrel stave. \n               Suddenly he bends his knees and lifts his feet up from off \n               the ground. Mick, suddenly finding Haven's full weight pulling \n               him forward, crashes down on top of him. With all the strength \n               left in him, Haven brings his knee to the pit of Mick's \n               stomach; as Mick's hold breaks, Haven rolls clear.\n\n               Now they are both hurt. Haven's ribs and chest are so bruised \n               that it is agony to take a breath. He knows it has to end \n               quickly or he is done for, and he goes all out. As Mick tries \n               to close with him again, he stands his ground and throws \n               pile-driver punches to Mick's midsection; as Mick finally \n               lowers his arms to cover his body, Haven shifts his attack \n               to the face. This is not Mick's style of fighting, but as he \n               lashes back clumsily and angrily, each time he touches Haven \n               it is with punishing power. Toe to toe, they slug it out, \n               the belt now unwound and dangling from Mick's fist, both men \n               groggy but both refusing to go down. Finally Mick is helpless \n               to protect himself, but Haven hasn't got power left to knock \n               him off those sturdy legs. Gathering himself, Haven hurls \n               his body shoulder first at Mick's chest but he miscalculates, \n               glances off and falls flat on his face. As he rolls over, \n               dogged and slow with exhaustion, he sees that his weight has \n               staggered Mick; the big man has taken a step back, and now \n               he starts to walk forward. Dazed and blind with pain, he \n               passes Haven, staggers forward until the tie-rail stops him. \n               There he stands, his hands on the rail, moving his head from \n               side to side like a wounded animal.\n\n               The crowd is silent now, waiting. Haven gets to his feet, \n               drunk with weariness. He puts a hand on Mick's shoulder, but \n               hasn't the strength to whirl him around. He braces himself \n               with one hand against the tie-rail, and almost in slow motion \n               pulls Mick around and clips him one last time with his \n               remaining strength. Mick goes down.\n\n<b>                                     MICK\n</b>                              (getting up very slow)\n                         You can't do this.\n\n               Before he is up he goes down again, unable to make it.\n\n<b>                                     MICK\n</b>                              (in the dirt)\n                         Nobody can do this... to me.\n\n               The crowd is transfixed. They can't even cheer. The two \n               bouncers lean over the fallen Mick.\n\n<b>                                     BOUNCER\n</b>                         Somebody just did.\n\n               They pick up Mick as Haven stupidly watches. Then as Haven \n               turns and goes away, swaying and weak, the roar rises. He \n               pushes aside people who try to assist him. They move aside \n               and watch him leave. The crowd goes back in the saloon behind \n               the vanquished Mick...\n\n               ANGLE on Charlie, Bristow and Prince. Prince watches the \n               beaten Mick go by with a smile of contempt. Charlie's eyes \n               are fixed on the vanishing lonely figure of Haven. Mark's \n               eyes are dancing.\n\n<b>                                     BRISTOW\n</b>                         I can't believe it. Mick Marion losing \n                         a fight and me winning a thousand!\n\n<b>                                     CHARLIE\n</b>                              (to Prince)\n                         Give it to him, Prince -- in chips.\n\n               Bristow follows Prince, wiping his forehead. Charlie remains, \n               looking down the now empty street where Haven vanished, a \n               strange soft look in her eyes, a slow smile mounting her \n               lips.\n\n<b>               INT. HOTEL - NIGHT\n</b>\n               Orville behind his desk is strumming softly on the guitar, \n               his eyes following Haven as the latter slowly and somewhat \n               painfully walks in and across the lobby. All the way to the \n               desk the clerk watches Haven, strumming softly. Haven pauses \n               and smiles very faintly at him. The clerk puts the guitar \n               aside. There is a coffee pot and cup on the desk.\n\n<b>                                     ORVILLE\n</b>                         Have some coffee?\n\n<b>                                     HAVEN\n</b>                              (leaning on the desk)\n                         Thanks.\n\n               Orville pours it quickly.\n\n<b>                                     ORVILLE\n</b>                              (turning back to pick \n                              up a pitcher and a \n                              bottle)\n                         They told me who was fightin'. I was \n                         getting ready to rent your room. \n                         Cream or sugar?\n\n<b>                                     HAVEN\n</b>                         Cream.\n\n               Orville pours the \"cream\" from a whiskey bottle. Haven sips \n               gingerly.\n\n<b>                                     ORVILLE\n</b>                              (looking with mild \n                              curiosity and \n                              admiration)\n                         Myself, I'd rather fight a forest \n                         fire.\n\n<b>                                     HAVEN\n</b>                              (softly)\n                         So would I...\n\n               He finishes the coffee, turns and starts for his room. Orville \n               tosses two towels on Haven's shoulder as the latter goes. \n               Strumming the guitar again softly, he watches with admiration \n               the retreating form of Haven.\n\n<b>               INT. HOTEL ROOM - NIGHT\n</b>\n               Haven stands in the darkness only lighted by lights of the \n               saloon next door. He stands there looking vaguely out the \n               window, sucking his knuckles absently as he listens to the \n               piano playing. Then he goes wearily to the bed and falls on \n               it gratefully, shutting his eyes, the towels still across \n               his shoulder. There is a moment of silence and then a soft \n               KNOCK at the door. Another KNOCK, and painfully Haven lifts \n               himself on one elbow and drags out his gun. The door opens \n               and Charlie enters. She shuts it behind her and stands looking \n               at him. He lets the gun fall and turns over on his back. \n               Charlie walks across to the bed and stands looking down at \n               him.\n\n<b>                                     CHARLIE\n</b>                         How do you feel?\n\n<b>                                     HAVEN\n</b>                         Like a million dollars.\n\n<b>                                     CHARLIE\n</b>                         You just cost me a thousand. You \n                         lost your pipe in the fight. I brought \n                         it to you.\n\n               She puts it on the table beside the bed. Haven's eyes follow \n               her. She sees the towels, takes them to the washstand, soaks \n               them and brings them back and compresses them gently on \n               Haven's bruised face. When she takes the towel away, he pulls \n               himself up a little, propped against the pillow, looking at \n               her curiously. She sits down on the edge of the bed.\n\n<b>                                     HAVEN\n</b>                         Do you always get sweet with the men \n                         who fight over you?\n\n<b>                                     CHARLIE\n</b>                         Only the winners.\n\n               He watches her as she wets the towels again, returns and \n               wraps his hands in them, sitting again on the edge of the \n               bed.\n\n<b>                                     HAVEN\n</b>                         Tell me something --\n\n<b>                                     CHARLIE\n</b>                              (quietly, smiling)\n                         What?\n\n<b>                                     HAVEN\n</b>                              (he lies back)\n                         That fellow might have killed me --\n                              (sleepily)\n                         Where do you bury the losers?\n\n               He is almost asleep. She takes the now unused towel and puts \n               it back in the basin, soaks it, returns with it and tucks it \n               against the side of his face.\n\n<b>                                     CHARLIE\n</b>                         You talk too much.\n\n<b>                                     HAVEN\n</b>                              (bitterly)\n                         What do you want -- the next dance?\n\n<b>                                     CHARLIE\n</b>                         I think you'd better sit this one \n                         out.\n\n               He is sound asleep the next second. She stares at him; rises, \n               puts the blanket over him and goes quietly out.\n\n<b>                                                                   FADE OUT\n</b>\n<b>               FADE IN\n</b>\n<b>               INT. HOTEL LOBBY - DAY\n</b>\n               Haven comes to the desk from his room. Orville is singing \n               another verse of the ballad. The clerk favors Haven with an \n               admiring smile. The coffee pot is there.\n\n<b>                                     ORVILLE\n</b>                         Have some coffee?\n\n<b>                                     HAVEN\n</b>                         Thanks.\n\n               Orville strums the strings as Haven drinks, having a little \n               trouble with his sore hands.\n\n<b>                                     HAVEN\n</b>                         The way you run this dump I knew you \n                         must be good at something else.\n\n<b>                                     ORVILLE\n</b>                         Some call me the town poet -- and \n                         some the village idiot. Who am I to \n                         question either? How you feel today?\n\n<b>                                     HAVEN\n</b>                         Like I crawled here from Kansas City.\n\n<b>                                     ORVILLE\n</b>                         Well, it figures to make you pretty \n                         famous. Fact, people been askin' for \n                         you already.\n\n<b>                                     HAVEN\n</b>                         Who?\n\n<b>                                     ORVILLE\n</b>                         That gold mine lady -- Mrs. Caslon.\n\n<b>                                     HAVEN\n</b>                         That's nice.\n\n<b>                                     ORVILLE\n</b>                         Couldn't do better. And Charlie.\n\n<b>                                     HAVEN\n</b>                         Charlie?\n\n<b>                                     ORVILLE\n</b>                         No. less.\n\n<b>                                     HAVEN\n</b>                         You seem impressed.\n\n<b>                                     ORVILLE\n</b>                         Why not? Charlie owns a piece of \n                         everything, includin' the undertaker \n                         and the sheriff.\n\n<b>                                     HAVEN\n</b>                         The stage line too?\n\n<b>                                     ORVILLE\n</b>                         Everything but the Wednesday Bible \n                         Class. Even owns a piece of me.\n                              (grins)\n                         Takes your money while you're here, \n                         and makes you pay to leave.\n\n<b>                                     HAVEN\n</b>                              (putting down the cup)\n                         When you get the next verse I'd like \n                         to hear it.\n\n<b>                                     ORVILLE\n</b>                         Can't find no word to rhyme with \n                         Mick Marion.\n\n<b>                                     HAVEN\n</b>                              (as he turns away)\n                         Carrion.\n\n               He walks off. Orville ponders this, scowling into space.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               INT. MRS. CASLON'S MINE-CABIN\n</b>\n               Iles is pacing the floor. Mrs. Caslon is occupied with some \n               minor domestic chore. Stellman is standing by the door. Iles \n               is a ball of fire.\n\n<b>                                     ILES\n</b>                         Of all the stupid bonehead plays! \n                         What did he fight about -- don't \n                         tell me a woman?\n\n<b>                                     STELLMAN\n</b>                         That's what they tell me.\n\n<b>                                     ILES\n</b>                         Who started it?\n\n<b>                                     STELLMAN\n</b>                         I don't know, but Haven finished it.\n\n<b>                                     ILES\n</b>                         That probably strikes you as a very \n                         admirable thing.\n\n               Stellman shrugs.\n\n<b>                                     ILES\n</b>                         Well, I don't think so! I have men \n                         who can use their fists. Why didn't \n                         they send a man who could use his \n                         brains!\n\n               There is a knock at the door. Iles gives her a look; then \n               glares at Stellman.\n\n<b>                                     ILES\n</b>                         Well -- open it up!\n\n               Stellman opens the door and Haven walks in. He pauses, glances \n               around and smiles. Mrs. Caslon smiles at him.\n\n<b>                                     HAVEN\n</b>                         Hello, Mrs. Caslon.\n\n               She smiles and nods. Irons. Haven can feel the surcharged \n               air. Deliberately he assumes that casual manner that so burns \n               the Captain.\n\n<b>                                     HAVEN\n</b>                         Captain... Lieutenant...\n\n<b>                                     ILES\n</b>                              (coldly)\n                         Mr. Haven, we may not have very much \n                         around here that pleases you, but we \n                         do have a strict post regulation \n                         against brawling in the town. Now \n                         would you like to explain what \n                         happened last night?\n\n<b>                                     HAVEN\n</b>                              (smiling)\n                         I came here to return Mrs. Caslon's \n                         call.\n\n               Iles glances sharply at Mrs. Caslon, and then to Haven.\n\n<b>                                     ILES\n</b>                              (indicating a chair)\n                         Sit down.\n\n               Haven sits, wincing a little. But he beams at Iles, who now \n               picks a book off the table.\n\n<b>                                     ILES\n</b>                         This book I have in my hand is the \n                         Army Register, 1882.\n\n               Haven inspects his knuckles.\n\n<b>                                     ILES\n</b>                         I am now going to read from it.\n                              (finds the place; \n                              reads)\n                         \"Haven, John Martin, born Ohio 1852. \n                         Appointed Second Lieutenant. Promoted \n                         First Lieutenant 20th Infantry, March \n                         1880; reduced in rank to 2nd \n                         Lieutenant January 12, 1881.\"\n\n               He tosses the book on the table, glaring at Haven.\n\n<b>                                     ILES\n</b>                         Is that correct?\n\n<b>                                     HAVEN\n</b>                         It's the Army Register.\n\n<b>                                     ILES\n</b>                         Haven, you've lost your rank once. \n                         It may very well happen again.\n\n<b>                                     HAVEN\n</b>                         To almost anybody.\n\n<b>                                     MRS. CASLON\n</b>                         Maybe if you'd let him explain... He \n                         might have a good reason.\n\n<b>                                     ILES\n</b>                         Even a bad reason would delight me.\n\n<b>                                     HAVEN\n</b>                         What would you like to know?\n\n<b>                                     ILES\n</b>                         Did you pick that fight?\n\n<b>                                     HAVEN\n</b>                         Those things can become very vague.\n\n               Iles scowls to him.\n\n<b>                                     ILES\n</b>                              (shrewdly)\n                         And where do you expect all this to \n                         get you?\n\n<b>                                     HAVEN\n</b>                              (rising wearily)\n                         That is a question I prefer not to \n                         answer.\n\n<b>                                     ILES\n</b>                              (snaps it)\n                         I think you're trying to carry your \n                         authority too far.\n\n               Haven goes to the door, gently touching his sore jaw. At the \n               door he turns.\n\n<b>                                     HAVEN\n</b>                         Perhaps, but there's one thing, \n                         Captain Iles... We had an arrangement \n                         that we wouldn't meet -- you and I --\n                         except through Mrs. Caslon... I think \n                         it's important to keep it that way...\n                              (one more glance back)\n                         And I like it better.\n\n               He smiles and leaves, closing the door as he goes. Iles stands \n               there frozen with rage a moment. Then his face relaxes in a \n               grim smile. He glances at Stellman as he takes a cigar out \n               and bites it off.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               INT. SALOON - DAY\n</b>\n               Business is slack. Girls drink coffee and knit at a table. \n               Ernie polishes glasses at the bar. A colored man cleans a \n               crap table. All look up with curiosity and esteem as Haven \n               enters; all but Sam, the piano player, who goes on playing. \n               Haven goes to the bar. Ernie nods at him.\n\n<b>                                     HAVEN\n</b>                         Doesn't he ever stop playing?\n\n<b>                                     ERNIE\n</b>                         Sam? It don't bother him. He's deaf.\n\n<b>                                     HAVEN\n</b>                         Where do I find the boss?\n\n<b>                                     ERNIE\n</b>                         First door top of the stairs.\n\n<b>                                     HAVEN\n</b>                         Mick been around?\n\n<b>                                     ERNIE\n</b>                         He's undisposed.\n\n               Haven goes to the stairs. The eyes of the girls follow him.\n\n               Top of the stairs -- as Haven reaches the door, wincing at \n               the climb. He KNOCKS with the heel of his hand, hurts it, \n               then uses his boot toe.\n\n<b>                                     PRINCE'S VOICE\n</b>                         Come in.\n\n               Haven opens the door.\n\n<b>               INT. CHARLIE'S OFFICE - DAY\n</b>\n               This is a big corner room, the windows of which look out \n               over the main street. The chairs are big and there is a roll-\n               top desk in the corner, a big leather sofa, and on the walls \n               some framed pictures. At a table Prince sits. He has six \n               dice stacked on top of each other and he is lifting the \n               column. Charlie is seated behind the desk smiling. Haven \n               looks from one to the other.\n\n<b>                                     HAVEN\n</b>                              (to Prince)\n                         You wanted to see me?\n\n<b>                                     CHARLIE\n</b>                         I did.\n\n<b>                                     HAVEN\n</b>                         They said Charlie --\n\n<b>                                     CHARLIE\n</b>                         Yes.\n\n               She seems to enjoy Haven's momentary confusion. Prince is \n               indifferent.\n\n<b>                                     HAVEN\n</b>                         You're Charlie?\n\n<b>                                     CHARLIE\n</b>                         That's right.\n                              (nods toward Prince)\n                         This is Prince. Don't ever gamble \n                         with him.\n\n<b>                                     HAVEN\n</b>                         You mean with his equipment?\n\n               Prince gives him a thin smile and rises.\n\n<b>                                     PRINCE\n</b>                         She means either.\n                              (he crosses to door)\n                         See you later, Charlie.\n\n               Prince saunters out.\n\n               Haven sits in a big chair, very gingerly; takes out his pipe \n               and tobacco.\n\n<b>                                     HAVEN\n</b>                         You surround yourself with very \n                         affable characters.\n\n<b>                                     CHARLIE\n</b>                         It makes me feel at home.\n\n<b>                                     HAVEN\n</b>                         You're not that sinister. Last night \n                         with the wet towels you were Florence \n                         Nightingale in silk stockings.\n                              (stretching his legs, \n                              looking at her)\n                         Have you got a match?\n\n               She comes over with one and lights his pipe.\n\n<b>                                     HAVEN\n</b>                         There's one in my pocket but I hate \n                         to reach for it... thanks.\n\n               She takes his hand and looks at the cut knuckle.\n\n<b>                                     CHARLIE\n</b>                         Sit there.\n\n               She walks out of the room and he watches her; then around \n               the room. In a moment she returns, pulls up a chair in the \n               front of him and sits down. She has bandages and a little \n               jar of ointment.\n\n<b>                                     HAVEN\n</b>                              (smiles)\n                         Now you're Florence Nightingale again.\n\n               She takes one of his bruised hands, and as she bandages his \n               hands slowly, carefully and rather expertly, they talk.\n\n<b>                                     CHARLIE\n</b>                         Why did you pick that fight?\n\n<b>                                     HAVEN\n</b>                         I thought you did.\n\n<b>                                     CHARLIE\n</b>                              (smiling)\n                         Really?\n\n<b>                                     HAVEN\n</b>                         You could have insisted I was your \n                         cousin.\n\n<b>                                     CHARLIE\n</b>                         Perhaps that isn't the way I felt \n                         about you.\n\n<b>                                     HAVEN\n</b>                              (as his knuckle hurts)\n                         Ouch!\n\n               She smiles at him and then goes on.\n\n<b>                                     HAVEN\n</b>                         Where did you get the name of Charlie?\n\n<b>                                     CHARLIE\n</b>                         It was my father's. My name is \n                         Charlene, but --\n\n               He watches her face.\n\n<b>                                     HAVEN\n</b>                         I like that better... Charlene...\n                              (she doesn't answer)\n                         This'll be the first time I ever \n                         worked for a woman.\n\n<b>                                     CHARLIE\n</b>                              (giving him a glance)\n                         What makes you think you're going to \n                         work for me?\n\n<b>                                     HAVEN\n</b>                         You sent for me.\n\n<b>                                     CHARLIE\n</b>                              (finishing the bandage)\n                         How's that?\n\n               She stands up. Haven looks at her and ignores his bandaged \n               hands.\n\n<b>                                     HAVEN\n</b>                         Beautiful.\n\n<b>                                     CHARLIE\n</b>                              (walking towards the \n                              window)\n                         All right, I sent for you. I was \n                         doing a nice quiet business. That \n                         was because everybody was afraid of \n                         Mick. Now every time a man has enough \n                         drinks in him to feel rugged he'll \n                         try to do what you did.\n\n<b>                                     HAVEN\n</b>                         I wouldn't.\n\n<b>                                     CHARLIE\n</b>                         But they will.\n\n<b>                                     HAVEN\n</b>                         That's not the job I want. I don't \n                         intend to start at the bottom. I've \n                         been there. It's too crowded.\n\n<b>                                     CHARLIE\n</b>                              (coolly)\n                         Where do you want to start?\n\n<b>                                     HAVEN\n</b>                         With the money.\n\n<b>                                     CHARLIE\n</b>                         And what will you do for it?\n\n<b>                                     HAVEN\n</b>                         Anything -- except hang. How did you \n                         get -- all this?\n\n<b>                                     CHARLIE\n</b>                         I learned one thing from my father. \n                         As long as men think they can beat \n                         the tables, all you have to do is \n                         get a table. Sometimes they run out \n                         of cash and I find myself with new \n                         responsibilities.\n\n<b>                                     HAVEN\n</b>                         Such as --\n\n<b>                                     CHARLIE\n</b>                         A couple of stores for one thing.\n\n<b>                                     HAVEN\n</b>                         I can't see myself behind a counter.\n\n<b>                                     CHARLIE\n</b>                         A sawmill, and a logging camp. The \n                         logging camp's a long way from town.\n\n               Haven gets the meaning and shakes his head.\n\n<b>                                     CHARLIE\n</b>                         I own the stage line from here to \n                         West Rim City, but that's a dud.\n\n<b>                                     HAVEN\n</b>                         Why?\n\n<b>                                     CHARLIE\n</b>                         Outlaws. The money was in gold \n                         shipments. Now the mines won't ship \n                         it.\n\n<b>                                     HAVEN\n</b>                         I'll take that job.\n\n<b>                                     CHARLIE\n</b>                         You mean ride shot-gun?\n\n<b>                                     HAVEN\n</b>                         I mean run the line.\n\n<b>                                     CHARLIE\n</b>                         Don't force your luck. You won a \n                         fight last night. You could lose one \n                         tonight.\n\n<b>                                     HAVEN\n</b>                         Today I'd hate to tangle with a \n                         butterfly.\n\n<b>                                     CHARLIE\n</b>                         What do you think you'll get out of \n                         running the stage line?\n\n<b>                                     HAVEN\n</b>                         A commission on all the gold I get \n                         through.\n\n<b>                                     CHARLIE\n</b>                         That should buy you a small beer.\n\n<b>                                     HAVEN\n</b>                         Glad to get it.\n\n<b>                                     CHARLIE\n</b>                         It's pretty dangerous. Even Wells \n                         Fargo locked up their station and \n                         quit trying.\n\n<b>                                     HAVEN\n</b>                              (leveling)\n                         Who steals the gold?\n\n<b>                                     CHARLIE\n</b>                         Who doesn't? All they have to do is \n                         put a mask on and they all look like \n                         Black Bart.\n\n<b>                                     HAVEN\n</b>                              (rising)\n                         Give me a letter of authorization.\n\n<b>                                     CHARLIE\n</b>                              (going to the desk)\n                         I can't bet against you twice, can \n<b>                         I?\n</b>\n               As she writes out the authorization, Haven saunters to the \n               window, then over to the desk. Charlie finishes and hands \n               him the paper. Haven scans it, pockets it.\n\n<b>                                     CHARLIE\n</b>                              (smiling at him)\n                         You know I forgot to ask you one \n                         thing.\n\n<b>                                     HAVEN\n</b>                         I'm working for you now. You can ask \n                         me anything.\n\n               Haven is moving to the door and she beside him. They pause.\n\n<b>                                     CHARLIE\n</b>                         How do I know I can trust you?\n\n<b>                                     HAVEN\n</b>                         You don't.\n\n<b>                                     CHARLIE\n</b>                         Can I?\n\n               He looks at her face, neck and hair. She looks pretty good.\n\n<b>                                     HAVEN\n</b>                         Only with money.\n\n               Haven looks squarely at her a moment, then smiles. He reaches \n               out one bandaged hand and pats her shoulder.\n\n<b>                                     HAVEN\n</b>                              (quietly)\n                         Okay, boss?\n\n               He walks out, and Charlie remains standing there, staring \n               after him, just a little hazily.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               EXT. STAGE LINE DEPOT - DAY\n</b>\n               As Haven walks through the wide gate into a compound. There \n               are several unhitched stages and freight wagons, one or two \n               in partial disassembly and being serviced. A colored boy is \n               readying a horse and buggy and beside him, overlooking the \n               yard activities, is a bespectacled man with rubber sleeve \n               garters. He is the manager. He has eyes like Armadillo and \n               claw-like hands; otherwise, he could be your loan agency \n               man. Seeing Haven he crosses to him.\n\n<b>                                     HAVEN\n</b>                              (looking him over)\n                         Are you the manager?\n\n<b>                                     MANAGER\n</b>                         I am.\n\n<b>                                     HAVEN\n</b>                         My name's Haven.\n\n<b>                                     MANAGER\n</b>                         I've heard about you. You're the \n                         fellah who took Mick Marion apart.\n                              (looking at him)\n                         Almost knocked me off my feet. But \n                         my feet ain't been any good since I \n                         followed Stonewall Jackson.\n                              (keenly)\n                         What business you got with me?\n\n<b>                                     HAVEN\n</b>                              (handing him the note)\n                         I'm the new boss.\n\n               The manager glances at the note, after moving his spectacles \n               out of the way. He gives it back without a word, and turns \n               toward the rear office door. Haven halts him.\n\n<b>                                     HAVEN\n</b>                         Wait a minute. You're not fired.\n\n<b>                                     MANAGER\n</b>                         I got to be. There ain't enough work \n                         around here for one man, let alone \n                         two.\n\n<b>                                     HAVEN\n</b>                         Two can loaf as easy as one.\n\n               Jim Goddard and Jerry enter from the rear office door. Jerry \n               is the younger. Goddard walks a little stiffly with the aid \n               of a cane.\n\n<b>                                     JERRY\n</b>                         Mr. Leonard!\n\n               They halt and look at Haven. The Manager jerks a thumb at \n               Haven.\n\n<b>                                     MANAGER\n</b>                         Talk to him. He just took the reins.\n                              (indicating the two \n                              lads)\n                         This is Jim Goddard. He's a regular \n                         stage driver. Jerry here runs freight \n                         to the sawmill. Boys, your new boss.\n\n<b>                                     HAVEN\n</b>                         Hello, boys.\n\n<b>                                     JERRY\n</b>                              (with a grin of hero \n                              worship)\n                         I gotta start out of here for the \n                         sawmill before daybreak. Is that all \n                         right, Mr. Haven?\n\n               Haven nods, after a glance at the manager.\n\n<b>                                     JERRY\n</b>                         I seen that fight last night. It was \n                         sure a beauty.\n\n<b>                                     HAVEN\n</b>                         Glad you enjoyed it.\n\n<b>                                     JERRY\n</b>                         What I liked was the way you --\n\n<b>                                     HAVEN\n</b>                         Let's not talk about it. Right now \n                         it hurts my hands to listen.\n\n<b>                                     JERRY\n</b>                         Yes, sir.\n\n               He walks out, looking back with an awesome smile. Haven looks \n               curiously at Goddard, who has been standing in silence, a \n               thin smile on his lips.\n\n<b>                                     HAVEN\n</b>                         What happened to you?\n\n<b>                                     GODDARD\n</b>                         My last run. I stopped a bullet.\n\n<b>                                     HAVEN\n</b>                         Did you get a look at them?\n\n<b>                                     GODDARD\n</b>                         I wish I had.\n\n<b>                                     HAVEN\n</b>                         I think I'm going to need you and \n                         not on one leg. So sit down and give \n                         it a rest.\n\n<b>                                     GODDARD\n</b>                              (slowly smiling)\n                         Yes, sir.\n\n               He obeys. Haven watches and then turns to the manager.\n\n<b>                                     HAVEN\n</b>                         I'm coming back later and sit behind \n                         your desk. I'll need the keys.\n\n<b>                                     MANAGER\n</b>                              (taking keys from his \n                              pocket)\n                         Only things here that work.\n\n               The manager, gives them to him. Then looks at him.\n\n<b>                                     MANAGER\n</b>                         Son, I waste my time. I might as \n                         well waste some advice. You're full \n                         of blood and vinegar, but this whole \n                         thing has got something wrong with \n                         it. Goddard only got nicked in the \n                         shin. You might not be so lucky...\n\n<b>                                     HAVEN\n</b>                         I might depend on something besides \n                         luck.\n\n<b>                                     MANAGER\n</b>                         Like for instance?\n\n<b>                                     HAVEN\n</b>                         Well the fact that they don't seem \n                         to shoot too straight.\n\n<b>                                     MANAGER\n</b>                         They don't need to when they shoot \n                         so often.\n\n               He turns, takes a few steps -- and turns back to Haven.\n\n<b>                                     MANAGER\n</b>                         Worry it over.\n\n               The manager turns to go, shaking his head.\n\n<b>               EXT. OFFICER COMPOUND\n</b>\n               Haven, whistling softly, crosses to the colored boy who is \n               polishing the last specks of dust off the buggy. It is a \n               beautiful buggy attached to a beautiful horse. Haven pauses \n               and gazes at it.\n\n<b>                                     HAVEN\n</b>                         What's this?\n\n               The colored boy steps back and admires his work.\n\n<b>                                     COLORED BOY\n</b>                         Sumpin', ain't it?\n\n<b>                                     HAVEN\n</b>                         Who's it for?\n\n<b>                                     COLORED BOY\n</b>                         Miss Charlie, Mr. Haven.\n\n<b>                                     HAVEN\n</b>                         Where do you drive her?\n\n<b>                                     COLORED BOY\n</b>                         Same places. Around the hills, down \n                         the river, every afternoon.\n\n<b>                                     HAVEN\n</b>                         I think I'll give you this afternoon \n                         off.\n\n<b>                                     COLORED BOY\n</b>                         I shouldn't let you do this, suh...\n                              (looking Haven over, \n                              especially the \n                              bandaged hands)\n                         But ah am.\n\n               Haven climbs in the buggy, and the Colored Boy watches him \n               go.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               INT. CHARLIE'S OFFICE - DAY\n</b>\n               Charlie is dressed to go somewhere. She looks much nicer in \n               these clothes than in her show garments of the night. She is \n               listening to Prince who sits in a chair, the inevitable dice \n               in his fingers, two this time. There is a silence except the \n               rattle of the cubes. Then Prince speaks coldly.\n\n<b>                                     PRINCE\n</b>                         Does this Haven move me out? Is that \n                         the plan?\n\n<b>                                     CHARLIE\n</b>                         Prince, you know I wouldn't part \n                         with you.\n\n<b>                                     PRINCE\n</b>                         But I always come up empty.\n\n<b>                                     CHARLIE\n</b>                         Not quite empty. I gave you what is \n                         probably the one honest feeling you \n                         ever had in your life.\n\n<b>                                     PRINCE\n</b>                         I keep forgetting that. Pardon me.\n\n<b>                                     CHARLIE\n</b>                         What's the matter, Prince?\n\n<b>                                     PRINCE\n</b>                         I don't like John Haven or anything \n                         about him.\n\n<b>                                     CHARLIE\n</b>                         You've said that.\n\n<b>                                     PRINCE\n</b>                         What do you know about him?\n\n<b>                                     CHARLIE\n</b>                         You want me to have him looked up in \n                         the Social Register?\n\n               She gets up, goes to the window testily. Prince looks at her \n               coldly as she gazes at the street.\n\n<b>                                     PRINCE\n</b>                         A man walks in out of nowhere --\n\n<b>                                     CHARLIE\n</b>                              (turning)\n                         And went against your table. Did he \n                         play like a gambler?\n\n<b>                                     PRINCE\n</b>                         He knew something.\n\n<b>                                     CHARLIE\n</b>                         Yes -- and he took Mick.\n\n<b>                                     PRINCE\n</b>                         So he can fight.\n                              (shrewdly)\n                         You like that part, don't you?\n\n               He looks straight at her and she stares back, staring him \n               down at last. As his eyes lower, she turns again to the \n               window.\n\n<b>                                     CHARLIE\n</b>                         I'll tell you one thing, Prince, I \n                         don't like this part.\n\n               She is silent and Prince gets up and walks out. She does not \n               turn. Down in the street she can see Haven riding up in the \n               buggy, and the hard look on her face softens to a smile as \n               Haven climbs out of the buggy. Some people passing stare at \n               him, and whisper together. His fame has spread. He walks \n               inside, smiling a little.\n\n<b>               INT. SALOON - DAY\n</b>\n               As Haven enters. There is no play at the tables. Some at the \n               bar. The deaf pianist is pounding the keys softly. Prince \n               has just descended the stairs and gone to the dice table, \n               where he leans, his cold eyes fixed on Haven as the latter \n               goes to the foot of the stairs. At this moment Charlie appears \n               and descends the stairs, adjusting her hat. Haven stares at \n               her with admiration, as she descends, smiling at him.\n\n               MED. SHOT - Haven and Charlie, as she reaches the last step.\n\n<b>                                     HAVEN\n</b>                         Stand there a second.\n\n               She looks at him.\n\n<b>                                     HAVEN\n</b>                         Every time I see you, you look \n                         different, but you always look \n                         beautiful. Why is that?\n\n<b>                                     CHARLIE\n</b>                         I always have somebody to lie to me.\n\n<b>                                     HAVEN\n</b>                         Take my hand --\n                              (offering it)\n                         But don't squeeze it.\n\n               She takes his arm instead and they walk towards the door.\n\n               MOVING SHOT - Charlie and Haven, as they go.\n\n<b>                                     CHARLIE\n</b>                         Tell me what you're doing with my \n                         buggy.\n\n<b>                                     HAVEN\n</b>                         My work. I'm the new transportation \n                         boss. You hired me.\n\n               MED. SHOT of Prince, as he stands at the table, watching \n               them go.\n\n<b>               EXT. CHARLIE'S BUGGY - DAY\n</b>\n               As Haven helps Charlie into the carriage.\n\n<b>                                     HAVEN\n</b>                         I presume you're going shopping?\n\n<b>                                     CHARLIE\n</b>                         I wouldn't wear anything sold this \n                         side of Chicago. I'm going to call \n                         on a gentleman.\n\n<b>                                     HAVEN\n</b>                         At this hour?\n\n<b>                                     CHARLIE\n</b>                         His name is Mark Bristow -- and any \n                         hour, it would be strictly business.\n\n               He glances at her.\n\n<b>                                     HAVEN\n</b>                         The way you say it -- he may need a \n                         lawyer.\n\n<b>                                     CHARLIE\n</b>                         He's a lawyer himself, but it won't \n                         help him.\n\n<b>                                     HAVEN\n</b>                         No?\n\n<b>                                     CHARLIE\n</b>                              (with a smile)\n                         What good is a lawyer if he never \n                         gets in a court?\n\n<b>                                     HAVEN\n</b>                         Like a doctor in a graveyard. Where \n                         is this unlucky man?\n\n<b>                                     CHARLIE\n</b>                         Across the street.\n\n               As Haven shrugs and turns the carriage to front of Bristow's \n               office.\n\n<b>               EXT. BRISTOW'S OFFICE - DAY\n</b>\n               The letters on the window read:\n\n                                   Mark Bristow, Lawyer\n\n               As Haven pulls up in front of it with the carriage. He goes \n               around and helps Charlie alight, making it a little slow for \n               the sake of added intimacy and causing her to smile as though \n               she didn't resent it.\n\n<b>                                     HAVEN\n</b>                         Shall I take the horses back and rub \n                         them down?\n\n<b>                                     CHARLIE\n</b>                         Do you think they've gone far enough?\n\n<b>                                     HAVEN\n</b>                         I haven't.\n\n<b>                                     CHARLIE\n</b>                         Then maybe you better wait and come \n                         with me.\n\n               As Charlie starts in, Mrs. Caslon comes out and they pass. \n               Mrs. Caslon pauses to smile and Haven tips his hat. Charlie, \n               flashing a backward look, sees this.\n\n<b>               EXT. BRISTOW'S OFFICE - DAY\n</b>\n               MED. SHOT of Haven and Mrs. Caslon. Haven is talking to her \n               with apparent casualness because he realizes that Charlie \n               can see him.\n\n<b>                                     HAVEN\n</b>                         I wonder if you'd do me a favor?\n\n<b>                                     MRS. CASLON\n</b>                         Why, surely.\n\n<b>                                     HAVEN\n</b>                         It's a big favor, and I wouldn't \n                         blame you if you refused.\n\n<b>                                     MRS. CASLON\n</b>                         What is it?\n\n<b>                                     HAVEN\n</b>                         I want to haul some gold from your \n                         mine.\n\n<b>                                     MRS. CASLON\n</b>                         That IS a big favor.\n\n<b>                                     HAVEN\n</b>                         I know it seems impossible to you, \n                         but that's one reason why I'm here -- \n                         to find cut what makes it impossible.\n\n<b>                                     MRS. CASLON\n</b>                         Isn't that very risky?\n\n<b>                                     HAVEN\n</b>                         That's why I couldn't go to anyone \n                         but you.\n\n<b>                                     MRS. CASLON\n</b>                              (hesitating)\n                         I'm just wondering if we shouldn't \n                         speak to Captain Iles first.\n\n<b>                                     HAVEN\n</b>                         You know what he'd say.\n                              (she smiles grimly \n                              and nods)\n                         He'd advise against it -- but if it \n                         works my way, it may clear everything \n                         up -- for all of us -- and for Iles \n                         too. The War Department doesn't like \n                         all that gold around an Army Post.\n\n               He watches her face as she thinks it over.\n\n<b>                                     HAVEN\n</b>                              (softly)\n                         We're working too much in the dark. \n                         This may be the only way to see \n                         something. It's a risk -- but someone \n                         has to take it...\n\n<b>                                     MRS. CASLON\n</b>                              (firmly)\n                         Who else will know of it?\n\n<b>                                     HAVEN\n</b>                         Just us. That'll be all who know -- \n                         and that's the idea.\n\n<b>                                     MRS. CASLON\n</b>                              (simply)\n                         I'll arrange it.\n\n<b>                                     HAVEN\n</b>                              (grinning)\n                         Don't look so grim. It's only your \n                         gold and my skin. And smile when you \n                         walk away as though we'd been talking \n                         about what a dry summer it's been.\n\n               She smiles and Haven pats her shoulder.\n\n<b>               INT. OFFICE - DAY\n</b>\n               As Bristow is talking. Charlie, looking through the window, \n               sees Haven and Mrs. Caslon part, Haven patting her shoulder \n               with that familiar gesture of his, then coming into the office \n               door.\n\n<b>                                     BRISTOW\n</b>                         ...You know I'll always cooperate -- \n                         as much as possible. But I haven't \n                         the money.\n\n               Haven has entered in silence, seated himself in a chair. \n               Charlie does not look at him; her face, hard now, looks \n               straight at Bristow. He pauses as he glances at Haven with a \n               little nod Haven doesn't return.\n\n<b>                                     CHARLIE\n</b>                              (rising and going to \n                              the desk with a sheaf \n                              of papers, which she \n                              places on his desk)\n                         These are I.O.U.s for gambling. They \n                         add up to six thousand dollars. Do \n                         you want to count them?\n\n<b>                                     BRISTOW\n</b>                         No.\n\n<b>                                     CHARLIE\n</b>                              (returning them to \n                              her pocket)\n                         Your credit's over, Mark.\n\n<b>                                     BRISTOW\n</b>                         My luck can turn, can't it?\n\n<b>                                     CHARLIE\n</b>                         Not on my tables.\n\n<b>                                     BRISTOW\n</b>                         I've seen other people fall in this \n                         trap -- but I didn't think it would \n                         get me.\n\n               He is sweating a little.\n\n<b>                                     CHARLIE\n</b>                         Nobody does. I'll have Prince drop \n                         in and go over your books. Maybe we \n                         can work something out.\n\n<b>                                     BRISTOW\n</b>                         But I told you --\n\n<b>                                     CHARLIE\n</b>                         That's the way it is, Mark. I pay \n                         off on the line and I expect to get \n                         paid. Give it some thought.\n\n               She whirls and walks out the door. Haven, fumbling for his \n               pipe and putting it in his teeth, follows her with a parting \n               glance at Bristow. For a long minute Bristow sits there alone, \n               his eyes staring at nothing; then as he mops the mildew of \n               sweat from his forehead:\n\n<b>                                                                       WIPE\n</b>\n<b>               INT. CHARLIE'S CARRIAGE - DAY\n</b>\n               As Charlie and Haven drive in the country. The road winds \n               between hills now and a stream tumbles along beside the \n               winding road. The horse is moving at a snail's pace and \n               Charlie is gazing around at the scenery, relaxed and \n               thoughtful.\n\n<b>                                     HAVEN\n</b>                         You know, you remind me a little -- \n                         back there -- of a character I once \n                         read in a book.\n\n<b>                                     CHARLIE\n</b>                         I had an idea you'd read a book. \n                         What was the character?\n\n<b>                                     HAVEN\n</b>                         Simon Legree.\n\n<b>                                     CHARLIE\n</b>                         Mark is mixed up. He's either crooked \n                         without being smart, or honest without \n                         being lucky. And that's no good.\n\n<b>                                     HAVEN\n</b>                         I don't think I'd want to owe you \n                         money -- even if I was honest.\n\n<b>                                     CHARLIE\n</b>                         Even?\n\n<b>                                     HAVEN\n</b>                         When I was seven I robbed my own \n                         piggy bank.\n\n<b>                                     CHARLIE\n</b>                         It's hard to imagine you being seven.\n\n<b>                                     HAVEN\n</b>                         I was very fat and ate a lot of candy.\n\n<b>                                     CHARLIE\n</b>                         Is that why you robbed your bank?\n\n<b>                                     HAVEN\n</b>                         No... I robbed it to run away from \n                         home.\n\n<b>                                     CHARLIE\n</b>                         Did you do it?\n\n<b>                                     HAVEN\n</b>                         Yeah, but I had to go back.\n\n<b>                                     CHARLIE\n</b>                         Why?\n\n<b>                                     HAVEN\n</b>                         It got dark.\n\n               She laughs. They stop and get out.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               STREAM BANK - DAY\n</b>\n               FULL SHOT as Haven helps her down the bank to the edge of \n               the water. She sits on the edge of a huge flat boulder and \n               Haven stretches out beside her.\n\n               MED. SHOT of Haven and Charlie. As she looks at the stream \n               and then at him.\n\n<b>                                     CHARLIE\n</b>                         This is my favorite place in the \n                         world... I always come here to think \n                         about it.\n\n<b>                                     HAVEN\n</b>                         What?\n\n<b>                                     CHARLIE\n</b>                         The rook here and the stream. The \n                         stream is always running away and \n                         the rock is always watching it go. \n                         It's two ways to be -- and I always \n                         wonder which is the best.\n\n<b>                                     HAVEN\n</b>                         They probably envy each other.\n\n<b>                                     CHARLIE\n</b>                         Do you suppose any woman could envy \n                         me?\n\n<b>                                     HAVEN\n</b>                         I know it.\n\n<b>                                     CHARLIE\n</b>                         But not a good woman?\n\n<b>                                     HAVEN\n</b>                         Nobody is any good. You mean \n                         respectable.\n\n<b>                                     CHARLIE\n</b>                         Maybe.\n\n<b>                                     HAVEN\n</b>                         Respectable people are very useful -- \n                         but they bore me.\n\n<b>                                     CHARLIE\n</b>                         With certain exceptions.\n\n<b>                                     HAVEN\n</b>                              (curiously)\n                         Like who?\n\n<b>                                     CHARLIE\n</b>                         Like Mary Caslon...\n\n<b>                                     HAVEN\n</b>                         I thought we might get to that.\n\n<b>                                     CHARLIE\n</b>                         How did you happen to know her?\n\n<b>                                     HAVEN\n</b>                         I knew her husband.\n\n<b>                                     CHARLIE\n</b>                         That's curious, considering --\n\n<b>                                     HAVEN\n</b>                         Considering what?\n\n<b>                                     CHARLIE\n</b>                         Ben Caslon was a very upright citizen.\n\n<b>                                     HAVEN\n</b>                         Meaning I'm not?\n\n<b>                                     CHARLIE\n</b>                              (adds thoughtfully)\n                         She's certainly not hard to look at -- \n                         and now she has the money and is --\n                              (looking away)\n                         -- also very respectable.\n\n<b>                                     HAVEN\n</b>                         Then why would she be interested in \n                         me?\n\n<b>                                     CHARLIE\n</b>                         Because you're no good. And good \n                         women like men who are bad for them.\n\n<b>                                     HAVEN\n</b>                         Flattery will get you nowhere.\n\n<b>                                     CHARLIE\n</b>                         Fooling with her will get you nowhere \n                         too -- except in trouble.\n\n<b>                                     HAVEN\n</b>                         With whom?\n\n<b>                                     CHARLIE\n</b>                         The army. Why is it you're always \n                         getting mixed up with the army?\n\n               Haven has been idly flipping pebbles into the stream. He \n               sees a leaf float by.\n\n<b>                                     HAVEN\n</b>                              (idly)\n                         What are the odds I hit the leaf?\n\n<b>                                     CHARLIE\n</b>                              (absently)\n                         Four to one.\n\n<b>                                     HAVEN\n</b>                         Pass --\n                              (he flips the pebble, \n                              misses)\n                         What's the army got to do with Mrs. \n                         Caslon?\n\n<b>                                     CHARLIE\n</b>                         She's engaged to Captain Iles.\n\n<b>                                     HAVEN\n</b>                         Iles?\n\n<b>                                     CHARLIE\n</b>                         He's the army boss here.\n\n<b>                                     HAVEN\n</b>                              (smiling)\n                         If you're going to frighten me, the \n                         least you can do is hold my hand.\n\n               He holds out his hand and takes hers. Abruptly she starts to \n               rise, very piqued and unable to disguise it. Haven rises \n               too. Takes her hand to help her from the boulder. Then stops \n               and gazes at her, smiling.\n\n<b>                                     HAVEN\n</b>                         This is where you ought to slip -- \n                         and I should catch you and kiss you.\n\n<b>                                     CHARLIE\n</b>                         No chance.\n\n               She starts down; Haven moves too, but it is he who slips and \n               she who has to catch him. Her arms go automatically around \n               him. His around her. Before he can act himself, she holds \n               him tight and kisses him. It is a long kiss and on it we:\n\n<b>                                                                   FADE OUT\n</b>\n<b>               FADE IN\n</b>\n<b>               INT. HOTEL LOBBY - EVENING\n</b>\n               Orville is strumming the guitar as Haven enters. He pauses \n               as Haven comes near on the way to his room.\n\n<b>                                     ORVILLE\n</b>                         Hey.\n\n               Haven halts, walks over.\n\n<b>                                     HAVEN\n</b>                         You finish that song?\n\n<b>                                     ORVILLE\n</b>                         Never do.\n\n<b>                                     HAVEN\n</b>                         Why not?\n\n<b>                                     ORVILLE\n</b>                         It's my fatality. I never finish \n                         nothin'.\n\n<b>                                     HAVEN\n</b>                         Maybe it's just as well.\n\n<b>                                     ORVILLE\n</b>                         Maybe so. I thought I'd tell you. \n                         Goin' back to your room will be a \n                         waste of time.\n\n<b>                                     HAVEN\n</b>                         It will?\n\n<b>                                     ORVILLE\n</b>                         I don't know what happened on that \n                         buggy ride, but somebody came and \n                         took all your truck.\n\n               He strums the strings.\n\n<b>                                     HAVEN\n</b>                         And, naturally, you didn't do anything \n                         about it?\n\n<b>                                     ORVILLE\n</b>                         What could I do?\n\n<b>                                     HAVEN\n</b>                         You could have called the sheriff.\n\n<b>                                     ORVILLE\n</b>                         Set a thief to catch a thief, eh?\n\n<b>                                     HAVEN\n</b>                         I paid my rent and I think I'm \n                         entitled to know who stole my clothes.\n\n               He starts to his room.\n\n<b>                                     ORVILLE\n</b>                              (calling after him)\n                         A man couldn't ask for no prettier \n                         thief.\n\n<b>               INT. HAVEN'S ROOM\n</b>\n               Haven enters, glances around, sees the bag is missing. He \n               goes to the window, sees Charlie at saloon window across the \n               areaway. He leans out.\n\n<b>                                     HAVEN\n</b>                         Hey!\n\n               Charlie moves the window, smiling.\n\n<b>                                     CHARLIE\n</b>                              (leaning out)\n                         Hello... I've been wondering where \n                         you were.\n\n<b>                                     HAVEN\n</b>                         I lost my shirt.\n\n<b>                                     CHARLIE\n</b>                         You didn't imagine that I'd let you \n                         live in that hotel, did you? I want \n                         you available -- in case of trouble.\n\n<b>                                     HAVEN\n</b>                         Where did I move?\n\n<b>                                     CHARLIE\n</b>                         In a very nice room upstairs.\n\n<b>                                     HAVEN\n</b>                              (taking out his pipe)\n                         When can you get my things back to \n                         the hotel, Charlie?\n\n               She stares at him, the smile fading on her face.\n\n<b>                                     CHARLIE\n</b>                         Why don't you take them yourself?\n\n<b>                                     HAVEN\n</b>                              (calmly)\n                         Because that's not how they got here.\n\n               A slight pause.\n\n<b>                                     CHARLIE\n</b>                         You're really hard -- aren't you?\n\n<b>                                     HAVEN\n</b>                         No.\n\n<b>                                     CHARLIE\n</b>                         You have to play everything alone?\n\n<b>                                     HAVEN\n</b>                         This hotel is no good. The service \n                         is bad. The clerk's a poet, and the \n                         mattress is not quite as soft as a \n                         marble slab. But I'm beginning to \n                         like it... and if I open this window, \n                         and hear you singing...\n\n<b>                                     CHARLIE\n</b>                         Is that the way you want it?\n\n<b>                                     HAVEN\n</b>                         That's the way.\n\n<b>                                     CHARLIE\n</b>                         They'll be there.\n\n               She turns abruptly from the window. Haven smiles and turns \n               away.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               EXT. STAGE LINE COMPOUND - NIGHT\n</b>\n               Haven is finishing preparations for the ride. ANGLE ON Goddard \n               as he stands in shadow, watching. He carries a shotgun. As \n               Goddard moves from the shadow, Haven whirls, going for his \n               gun -- then relaxing as he recognizes the other man.\n\n               MED. SHOT of Haven and Goddard.\n\n<b>                                     HAVEN\n</b>                         What brings you here?\n\n<b>                                     GODDARD\n</b>                              (smiling)\n                         I had a dream.\n\n<b>                                     HAVEN\n</b>                         Yeah?\n\n<b>                                     GODDARD\n</b>                         That you'd be back here tonight.\n\n<b>                                     HAVEN\n</b>                         Why?\n\n<b>                                     GODDARD\n</b>                         Maybe because you took the keys.\n\n<b>                                     HAVEN\n</b>                         Don't they go with the job?\n\n               Haven stares at him a long moment; Goddard returns the stare \n               steadily.\n\n<b>                                     GODDARD\n</b>                         You know how it is with dreams. I \n                         got the crazy idea you were going to \n                         try something --\n\n<b>                                     HAVEN\n</b>                         How crazy?\n\n<b>                                     GODDARD\n</b>                         Like running a shipment.\n\n<b>                                     HAVEN\n</b>                         Then what happened?\n\n<b>                                     GODDARD\n</b>                         I wanted to be some help with it.\n\n<b>                                     HAVEN\n</b>                         All right -- you've been some help. \n                         Now you can go back to sleep and \n                         I'll finish the dream for you.\n\n               The coach is ready. Goddard doesn't move.\n\n<b>                                     GODDARD\n</b>                         I'm riding with you, Haven.\n\n<b>                                     HAVEN\n</b>                         You are?\n\n<b>                                     GODDARD\n</b>                              (grimly)\n                         I'm riding.\n\n<b>                                     HAVEN\n</b>                              (slowly)\n                         You got more than your leg hurt, \n                         didn't you?\n\n<b>                                     GODDARD\n</b>                         Maybe I just like to ride in the \n                         moonlight if nothing happens.\n\n<b>                                     HAVEN\n</b>                         And if it does?\n\n<b>                                     GODDARD\n</b>                         Then I think I got a little better \n                         right than you to be there.\n\n<b>                                     HAVEN\n</b>                              (gazing at him)\n                         I was just thinking -- a nice guy \n                         like you probably has a nice girl \n                         somewhere -- or a wife.\n\n<b>                                     GODDARD\n</b>                         What are we gonna do -- have a little \n                         chat about women?\n\n               Haven slowly grins at him; Goddard smiles back.\n\n<b>                                     HAVEN\n</b>                         Some other time -- Let's go -- out \n                         the back gate.\n\n               Goddard climbs up with his shotgun as Haven clambers up into \n               the driver's seat. As the coach turns and heads for the back \n               of the corral.\n\n<b>                                                                       WIPE\n</b>\n<b>               EXT. OPEN COUNTRY - NIGHT\n</b>\n               FULL SHOT - the stagecoach, travelling across open flat \n               country, heading toward the distant hills.\n\n               CLOSE SHOT - Haven and Goddard in the driver's box, keeping \n               an eye about him as the teams gallop along in the moonlight.\n\n<b>                                     HAVEN\n</b>                         What makes you so anxious to take \n                         this chance?\n\n<b>                                     GODDARD\n</b>                         What makes you?\n\n<b>                                     HAVEN\n</b>                         I'm on commission. With me it's a \n                         matter of money.\n\n<b>                                     GODDARD\n</b>                         And you think it's something else \n                         with me?\n\n<b>                                     HAVEN\n</b>                         I can't think of anything else -- \n                         except curiosity.\n\n<b>                                     GODDARD\n</b>                              (gazing out drily)\n                         Some moonlight after all...\n\n               FULL SHOT as the stage rockets off into the darkness.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               EXT. MOUNTAIN COUNTRY - NIGHT\n</b>\n               The stage is now heading uphill, the gentle slope at the \n               beginning of the foothills.\n\n<b>               EXT. MOUNTAIN COUNTRY - NIGHT\n</b>\n               The road is steeper now, and winding.\n\n               ANOTHER ANGLE. The road is cut out of the side of the \n               mountain, leaving a sheer slope on one side, and high, thick \n               trees and brush on the other. As the stage follows a bend in \n               the road, a rider leaps out and grabs the lead horse. The \n               stage lurches crazily and almost overturns as it slows to a \n               stop. Before Haven can free his hands from the reins to go \n               for his gun, two shadowy figures, handkerchiefs helping the \n               darkness mask their faces, have jumped out onto the road \n               ahead and have him covered.\n\n<b>                                     BANDIT\n</b>                         All right -- stretch!\n\n               Haven and Goddard raise their arms. Another bandit, from the \n               hillside, calls out:\n\n<b>                                     SECOND BANDIT\n</b>                         Pile out with the hands up.\n\n               Two shotgun barrels cover the side of the stags. Goddard \n               gets off, hands in air.\n\n<b>                                     FIRST BANDIT\n</b>                              (to Haven)\n                         Get down.\n\n               Haven obeys, to join Goddard in the road, as the bandits \n               converge on the stage. There are five or six of them. Two \n               come up behind Haven and Goddard.\n\n<b>                                     FIRST BANDIT\n</b>                         Turn around and keep 'em high.\n\n               The sacks are being loaded on a pack horse. Haven turns \n               around.\n\n<b>                                     HAVEN\n</b>                         Take it easy. They hang you just the \n                         same.\n\n<b>                                     SECOND BANDIT\n</b>                         You, Goddard, start walking.\n\n               He gives Goddard a none too gentle shove. Goddard moves on \n               up the road in the darkness.\n\n               A FEW YARDS UP THE ROAD. Mick is waiting by his horse, his \n               gun drawn. We hear the steps of Goddard and the bandit.\n\n<b>                                     SECOND BANDIT'S VOICE\n</b>                         That's far enough.\n\n               The footsteps halt. Mick aims and fires.\n\n               BY WAGON. There is a half grunt, half groan from Goddard. \n               Haven turns as if to protest and then crumples as a gun fells \n               him.\n\n               CLOSE SHOT - Haven, lying face down on the ground, \n               unconscious.\n\n<b>                                                                   FADE OUT\n</b>\n<b>               FADE IN\n</b>\n<b>               EXT. SKY\n</b>\n               As day breaks.\n\n<b>               EXT. MOUNTAIN ROAD - DAWN\n</b>\n               CLOSE SHOT - Haven. Haven comes to, gradually clearing the \n               cobwebs. Then suddenly he remembers Goddard and the shot. He \n               makes his way to where Goddard's body lies a few feet up the \n               road. Goddard's right hand is half in his hip pocket, as if \n               in his last dying moment he was reaching for something. As \n               Haven pulls the hand out, he sees that Goddard's fingers \n               have closed around his wallet. Puzzled, Haven opens the \n               wallet. There is a stiff-backed daguerreotype of his wife, \n               an expired Union Pacific Railroad pass, an express receipt, \n               a souvenir bank-note of the Confederacy, and a small, closely-\n               folded piece of paper. Unfolding this, Haven sees the top \n               line:\n\n               \"To Whom It May Concern\"\n\n<b>               HE READS FURTHER:\n</b>\n               \"This certifies that the bearer, James Goddard, is operating \n               as a legally deputized detective for Wells Fargo Stage and \n               Express Company.\"\n\n               Haven replaces the papers and lifts Goddard's body, carries \n               it to the stage and places it on the floor. He removes \n               Goddard's gun and shell belt and straps it on, closing the \n               stage door. Haven's face is grim as he studies the ground \n               nearby. The sticky mud shows clearly the new tracks of the \n               bandits' horses. As he starts unhitching one of his horses \n               from the wagon traces, we\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               EXT. MOUNTAIN COUNTRY - MORNING\n</b>\n               A tiny clearing on a brush-filled knoll, where the remains \n               of a cooking fire are still visible, the ashes scattered \n               over the tamped-down ground. CAMERA PANS OVER TO Haven, on \n               horseback, as he studies the scene. This is where he evidently \n               made camp for the night. He dismounts, sifts the ashes through \n               his fingers to feel their warmth. He cannot be far behind. \n               Then he turns his attention to the trail loading away. \n               Inspection reveals that it divides, one group of fresh tracks \n               heading towards town, another smaller group further into the \n               mountains. He decides to follow the latter. As he mounts and \n               rides off:\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               EXT. MOUNTAIN COUNTRY - MORNING\n</b>\n               A high spot from which Haven can get a good view. Off in the \n               distance he sees:\n\n               LONG SHOT - FROM his ANGLE. A lone rider, leading a pack \n               horse, barely visible through the timber. He is heading away \n               from him.\n\n               CLOSE SHOT - Haven. He spurs his horse forward.\n\n               FULL SHOT - Haven, in pursuit of the man ahead.\n\n<b>               EXT. STREAM - MORNING\n</b>\n               The bandit, unaware of his pursuer, puts his horse and the \n               gold-laden pack horse through the stream. He comes out into \n               a meadow on the other side.\n\n               PAN SHOT - WITH Haven, as he comes to the stream. Half way \n               across, his horse momentarily loses his footing on the \n               slippery rocks.\n\n               MED. SHOT - bandit. Hearing the noise of Haven's horse, he \n               turns and sees his pursuer, takes a quick shot back at him, \n               then heads for the other side of the meadow where there will \n               be shelter, firing back as he rides.\n\n               MED. CLOSE SHOT - Haven. He takes careful and deliberate aim \n               and fires.\n\n               FULL SHOT - FROM Haven's ANGLE. The bandit is almost at the \n               edge of the woods when Haven's shot gets him. He tumbles \n               from the saddle. Haven rides forward, gun ready in case it \n               is a trick.\n\n<b>               EXT. MEADOW - MORNING\n</b>\n               It is no trick. The bandit is down where he fell. When Haven \n               turns him over, the man's eyes are already glazed. Haven \n               puts his lips close to the dying man's ear.\n\n<b>                                     HAVEN\n</b>                         Who sent you?\n\n               The man only glares up at him. Haven tries again.\n\n<b>                                     HAVEN\n</b>                         You're a goner, brother -- you can \n                         talk.\n\n               The man holds Haven's gaze defiantly and silently as the \n               life goes out of him. Haven lowers him back to the ground, \n               rifles his pocket. There are no papers on him, no \n               identification. He stands up. He has the gold back, but he \n               is no closer to rounding up the whole gang than he was before. \n               Unless -- he is looking at the horses, placidly grazing. He \n               goes up to them, ties up the loose lead reins, draws his \n               belt off, and gives them each a sharp crack on the rump with \n               the buckle. They take off across the meadow at a gallop. \n               Haven lets them get a good start before he mounts his own \n               horse, and follows after them.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               EXT. MOUNTAIN COUNTRY - DAY\n</b>\n               As Haven rides up to the edge of a downslope, gazes over a \n               broad valley, and sees:\n\n               LONG VIEW of a sawmill, nestled in the valley. It comprises \n               several sheds and buildings, with a long rank of stacked \n               logs beside the biggest shed, and all this is serviced by a \n               dirt road along which the two horses canter up to the camp. \n               Haven observes several men come out of the main office and \n               snag the two horses.\n\n<b>               EXT. CAMP OFFICE - DAY\n</b>\n               As two men who have snagged the horses now take off the gold \n               bags. In front of the office Pete, the camp boss, Ben and \n               Sam, two tough-looking accomplices, stand watching and \n               glancing up the road down which the horses came. There is a \n               frown on Pete's face.\n\n<b>                                     BEN\n</b>                         Where's Joe?\n                              (as Pete doesn't answer)\n                         Something's gone wrong, Pete.\n\n               Pete looks thoughtfully at Joe's horse, pats his neck, again \n               locks up the road.\n\n<b>                                     PETE\n</b>                         I know one thing. He was born on a \n                         horse and he didn't just fall off \n                         this one... go and take a look.\n\n               Two men mount and start away.\n\n               CLOSE SHOT of Haven. As he moves back out of sight. Obviously \n               he can't move into the camp now. Glancing off down the valley \n               he sees in the distance a work wagon approaching. It is still \n               hidden from sight of the sawmill by high ground between. He \n               puts his horse down the slope towards the approaching wagon, \n               at a tangent to the camp.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               EXT. SAWMILL ROAD - DAY\n</b>\n               As the work wagon lumbers along. Its markings identify it as \n               belonging to the stageline Haven now manages. We recognize \n               Jerry the driver as Haven rides up. Jerry gives him a grin \n               and a salute.\n\n<b>                                     JERRY\n</b>                         Hello there, Mr. Haven!\n\n<b>                                     HAVEN\n</b>                         Hello, Jerry. What's the haul?\n\n<b>                                     JERRY\n</b>                         This is that load of grub for the \n                         sawmill.\n\n<b>                                     HAVEN\n</b>                         Want to ride my horse back to town?\n\n<b>                                     JERRY\n</b>                         What about the wagon here?\n\n<b>                                     HAVEN\n</b>                         I'll finish the haul.\n\n<b>                                     JERRY\n</b>                         You're the boss.\n\n               He climbs down as Haven dismounts and turns the horse over \n               to Jerry.\n\n<b>                                     HAVEN\n</b>                              (throwing it away)\n                         Any excitement in town?\n\n<b>                                     JERRY\n</b>                              (grins)\n                         Don't know, Mr. Haven. I left before \n                         daybreak.\n\n<b>                                     HAVEN\n</b>                              (relieved)\n                         Take him easy. He's tired.\n\n<b>                                     JERRY\n</b>                         I'll give him a good rubdown.\n                              (mounting)\n\n               Haven watches him ride away, then climbs aboard the wagon. \n               Picking up the reins, he notices the bandages on his hands \n               and, not wanting to be identified by them, rips them off. \n               Blowing on his still sore knuckles, he drives toward the \n               sawmill.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               EXT. SAWMILL CAMP SITE - DAY\n</b>\n               As Haven's wagon lumbers in. He looks curiously at the main \n               office. No one is in sight, but as he draws nearer, the \n               swarthy hard-faced man, Pete, comes out on to the porch.\n\n<b>                                     PETE\n</b>                         Hey, you!\n\n               Haven looks at him.\n\n<b>                                     PETE\n</b>                         You see a rider comin' up?\n\n<b>                                     HAVEN\n</b>                         Nope.\n\n<b>                                     PETE\n</b>                         You sure?\n\n<b>                                     HAVEN\n</b>                         Haven't even seen a lizard. Where do \n                         I put this stuff?\n\n<b>                                     PETE\n</b>                         Where did you put it before?\n\n<b>                                     HAVEN\n</b>                         I never did. I'm a new driver. I \n                         think it's grub.\n\n<b>                                     PETE\n</b>                         Take it to the cook shack.\n\n               Haven flicks the reins, moves on. Pete watches suspiciously. \n               Haven moves on to the cook shack outside of which the cook \n               is busy dumping a pail of slop.\n\n<b>                                     HAVEN\n</b>                              (pulling up)\n                         You the cook?\n\n<b>                                     COOK\n</b>                         Nah. I just wear this hat to keep \n                         the flies out of my hair.\n\n<b>                                     HAVEN\n</b>                         It don't matter to me, brother. I \n                         just haul this grub. I'd just as \n                         soon haul it back.\n\n<b>                                     COOK\n</b>                         Take it next door.\n\n               Haven pulls up by the warehouse next door and gets down. \n               There is nobody around, so he starts wrestling with the food \n               crates himself, taking the first one into the warehouse.\n\n<b>               EXT. WAREHOUSE - DAY\n</b>\n               It is big, barnlike, piled with provisions and equipment. \n               Haven stares around; carries the crate to where a similar \n               stack of crates are piled. Lowering the crate he notes a \n               shiny object, picks it up. It is a button from an army \n               uniform. He pockets it as his attention is distracted by two \n               horsemen passing outside. Haven goes out to continue \n               unloading.\n\n<b>               EXT. MAIN OFFICE - DAY\n</b>\n               As the two horsemen ride up to Pete and dismount. Ben and \n               Sam are standing there.\n\n<b>                                     PETE\n</b>                              (to the horsemen)\n                         Any luck?\n\n<b>                                     BEN\n</b>                         No sign of Joe. But there's the tracks \n                         of another horse, circling the mill \n                         and coming back on the road just \n                         north.\n                              (he points)\n\n<b>                                     PETE\n</b>                         That's bad.\n\n               He glances toward the wagon where Haven is working.\n\n<b>                                     PETE\n</b>                         Let's go and look at this guy again.\n\n               The five men move down to Haven's wagon.\n\n               ANGLE ON wagon and Haven, as he sees them come. His lip \n               tightens; then he relaxes and goes on lifting a crate. He \n               pauses as they come up and stand around him, their eyes fixed \n               on:\n\n<b>                                     PETE\n</b>                         You --\n\n               Haven looks at him.\n\n<b>                                     PETE\n</b>                         You sure you didn't see no rider?\n\n<b>                                     HAVEN\n</b>                         Look -- you want me to say I saw a \n                         rider? I'll say it. I'll say I saw a \n                         ghost. It don't make any difference \n                         to me.\n\n<b>                                     PETE\n</b>                         When did you get this job?\n\n<b>                                     HAVEN\n</b>                         Yesterday.\n\n<b>                                     PETE\n</b>                         What for?\n\n<b>                                     HAVEN\n</b>                         It's the system. If I don't work I \n                         don't eat. I never been able to find \n                         any way to beat it.\n\n<b>                                     PETE\n</b>                         Who hired you?\n\n<b>                                     HAVEN\n</b>                              (blandly)\n                         Mr. Haven.\n\n<b>                                     PETE\n</b>                         The guy that had the fight?\n\n<b>                                     HAVEN\n</b>                         Same fellow.\n\n               It is a risky little moment; Haven eases both bruised hands \n               into his coat pockets.\n\n<b>                                     PETE\n</b>                         Friend of yours?\n\n<b>                                     HAVEN\n</b>                              (innocently)\n                         Who?\n\n<b>                                     PETE\n</b>                         This Haven.\n\n<b>                                     HAVEN\n</b>                         Any man who gives me a job is my \n                         friend. Look, I'm working, I haul \n                         this stuff out here. Nobody wants to \n                         tell me where to dump it. Everybody \n                         wants to know what I'm doin' and \n                         what I haven't seen. I don't know. I \n                         get thirty cents an hour. How smart \n                         does that have to make me?\n\n<b>                                     PETE\n</b>                         Don't get hot.\n\n               Pete's face relaxes; as do the grim faces of the others.\n\n<b>                                     HAVEN\n</b>                              (grinning)\n                         I ain't hot. I'm just mixed up.\n\n<b>                                     PETE\n</b>                         Forget it. I got a load for you to \n                         take back when you're done here.\n\n<b>                                     HAVEN\n</b>                         Sure.\n\n<b>                                     PETE\n</b>                         How soon?\n\n<b>                                     HAVEN\n</b>                         Well, I haven't eaten anything but \n                         dust since sun-up.\n\n<b>                                     PETE\n</b>                         All right -- grab it quick.\n                              (to the others)\n                         Work on this stuff.\n\n               They start unloading and Haven goes to the cook house. Pete \n               watches him go. Ben notes it.\n\n<b>                                     BEN\n</b>                         What do you think?\n\n<b>                                     PETE\n</b>                         We risk him, that's all.\n\n<b>                                     BEN\n</b>                         He don't look right to me.\n\n<b>                                     PETE\n</b>                         He don't look any worse than the \n                         rest of it looks right now.\n                              (turning)\n                         Come on, get this junk out.\n\n               He lends a hand with Ben and Sam.\n\n<b>               INT. COOKHOUSE - DAY\n</b>\n               A big pot of stew is simmering on the fire. The cook is busy \n               slicing french fries. Haven enters.\n\n<b>                                     HAVEN\n</b>                         How about a handout?\n\n<b>                                     COOK\n</b>                         Help yourself.\n\n               Haven begins ladling out some stew into a bowl, tastes it.\n\n<b>                                     HAVEN\n</b>                         You cook pretty good.\n\n<b>                                     COOK\n</b>                         I ought to. I used to cook for six \n                         hundred men a day.\n\n<b>                                     HAVEN\n</b>                         Where was that?\n\n<b>                                     COOK\n</b>                         Leavenworth.\n\n               Haven shrugs and takes more stew; the cook goes on cutting \n               the potatoes.\n\n<b>                                     HAVEN\n</b>                         This used to be my mother's special \n                         dish. She made it right out of the \n                         world.\n\n<b>                                     COOK\n</b>                         My old woman couldn't boil a potato.\n\n               Haven takes another gulp in the silence that follows. Then \n               he says carelessly:\n\n<b>                                     HAVEN\n</b>                         Who's boss around here?\n\n<b>                                     COOK\n</b>                         I am.\n\n<b>                                     HAVEN\n</b>                         I mean the whole works.\n\n<b>                                     COOK\n</b>                         You talked to the man when you came \n                         in.\n\n<b>                                     HAVEN\n</b>                         Real tough-looking fellah.\n\n<b>                                     COOK\n</b>                              (spits)\n                         They're all tough till they get to \n                         Mick Marion.\n\n<b>                                     HAVEN\n</b>                         Mick come out here?\n\n<b>                                     COOK\n</b>                         Last night -- and he looked like \n                         somebody got to him.\n\n<b>                                     HAVEN\n</b>                         How's that?\n\n<b>                                     COOK\n</b>                         Face all beat up --\n                              (casually)\n                         Like your knuckles.\n\n<b>                                     HAVEN\n</b>                         I had bad luck with a crate of \n                         cauliflower.\n\n<b>                                     COOK\n</b>                         That's what he brought down here -- \n                         a cauliflower face.\n                              (casually)\n                         You fight him?\n\n<b>                                     HAVEN\n</b>                              (smiling blandly)\n                         Mick? Do I look like I would?\n\n<b>                                     COOK\n</b>                              (looking at him)\n                         Just the knuckles.\n\n               Ben's head appears in the doorway.\n\n<b>                                     BEN\n</b>                         Hurry it up, driver!\n\n<b>                                     HAVEN\n</b>                         Comin'.\n\n               Haven takes a last mouthful, turns toward the door.\n\n<b>                                     HAVEN\n</b>                         Not many of the hands here, are there?\n\n<b>                                     COOK\n</b>                         All up at the logging camp.\n\n<b>                                     HAVEN\n</b>                         Much obliged. That was real fine \n                         mulligan.\n\n               The cook isn't interested; he spits as he slices a potato.\n\n<b>               EXT. SAWMILL OFFICE - DAY\n</b>\n               Pete, Sam and Ben are waiting beside the gear box as we see \n               Haven bringing the wagon up.\n\n<b>                                     BEN\n</b>                         Maybe this isn't such a good idea.\n\n<b>                                     PETE\n</b>                         Who said it was? I just want that \n                         gold outa here the easiest and \n                         quickest way.\n\n               They watch Haven as he pulls up the wagon. Pete looks hard \n               at his face. Haven has the pipe in his mouth again, looking \n               very blandly at them.\n\n<b>                                     PETE\n</b>                         You see this box?\n\n<b>                                     HAVEN\n</b>                         Sure.\n\n<b>                                     PETE\n</b>                         It goes to Prince. Know who Prince \n                         is?\n\n<b>                                     HAVEN\n</b>                         Nope.\n\n<b>                                     PETE\n</b>                         He runs things for Charlie. Know who \n                         Charlie is?\n\n<b>                                     HAVEN\n</b>                         Sure.\n\n               Haven climbs aboard. They look hard at him. He has stuck his \n               pipe in his mouth. He smiles at them and he picks up the \n               reins.\n\n<b>                                     PETE\n</b>                         One thing...\n\n               Haven pauses.\n\n<b>                                     PETE\n</b>                         That's a gear box you're hauling \n                         back and it's got to be repaired. \n                         And you tell Charlie that if it ain't \n                         repaired we might have to shut down \n                         quick. You got that?\n\n<b>                                     HAVEN\n</b>                         I got it.\n\n<b>                                     PETE\n</b>                         All right -- then get out of here!\n\n               Haven flicks the reins, grins at them and drives off. Ben is \n               still worried and stares after the departing wagon.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               EXT. MOUNTAINS - DAY\n</b>\n               This is deserted country on the way to town. When the land \n               slopes steeply from the road down into a kind of wash, Haven \n               halts the wagon. He glances around. No sign of life. He takes \n               a hammer and chisel out of the tool box beside the seat, \n               crawls to the crate and prys it open. His cargo is gold. \n               Satisfied, he replaces the pried board, then pushes the crate \n               over the side. It topples down the bank, vanishes in the \n               brush at the bottom of the wash. With one more glance around, \n               Haven resumes his seat in the wagon, puts a match to his \n               pipe, and sends the horses forward at a faster clip.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               LONG SHOT OF POST - DAY\n</b>\n<b>                                                                   DISSOLVE\n</b>\n<b>               INT. CAPTAIN ILES' OFFICE - POST\n</b>\n               Iles is pacing up and down as Stellman enters quietly. Iles \n               promptly faces him.\n\n<b>                                     ILES\n</b>                         Well -- what have you found out?\n\n<b>                                     STELLMAN\n</b>                         Goddard's body -- shot in the back.\n\n<b>                                     ILES\n</b>                         And no sign of Haven?\n\n<b>                                     STELLMAN\n</b>                         One horse was missing. They might \n                         have taken him away on that. They \n                         wouldn't kidnap him if they'd killed \n                         him.\n\n<b>                                     ILES\n</b>                         Why would they kill Goddard?\n\n<b>                                     STELLMAN\n</b>                         He was a Wells Fargo Detective.\n\n<b>                                     ILES\n</b>                         I see... he was a man they couldn't \n                         handle, so they shot him. But Haven \n                         wasn't killed.\n\n<b>                                     STELLMAN\n</b>                         He may have followed them on the \n                         missing horse.\n\n<b>                                     ILES\n</b>                         And he may be fishing for trout in \n                         the Verde River. Why do I always \n                         learn everything last? Why must \n                         everything be common gossip by the \n                         time it reaches me?\n\n<b>                                     STELLMAN\n</b>                         I don't know, sir.\n\n<b>                                     ILES\n</b>                         Neither do I, but I'll find out. The \n                         Army didn't banish me out here to \n                         set up a listening post. Bring the \n                         man in, dead or alive. If he's alive, \n                         arrest him.\n\n<b>                                     STELLMAN\n</b>                         But can you arrest him?\n\n<b>                                     ILES\n</b>                         No, but I can take any living human \n                         being into custody -- or am I mistaken \n                         in this too?\n\n<b>                                     STELLMAN\n</b>                         No, sir.\n\n<b>                                     ILES\n</b>                         Then go and do it!\n\n<b>                                     STELLMAN\n</b>                         Yes, sir.\n\n               Stellman turns and leaves obediently.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               EXT. MARK'S OFFICE - EVENING\n</b>\n               SHOT FROM Haven's ANGLE to include street activity. As Mark \n               approaches, opens the door and enters.\n\n<b>               INT. MARK'S OFFICE - EVENING\n</b>\n               As Mark enters in the semi-darkness and pauses, stiff with \n               fright at the sight of Haven sitting in the chair, a gun in \n               his hand. Mark opens his mouth but can't speak.\n\n<b>                                     HAVEN\n</b>                         Draw those blinds, Bristow.\n\n               Numbly, Mark obeys; then turns.\n\n<b>                                     HAVEN\n</b>                         All right -- light it up.\n\n               Mark lights the lamp. His voice is small and quavering.\n\n<b>                                     BRISTOW\n</b>                              (indicating gun)\n                         Can't you put that firearm away.\n\n<b>                                     HAVEN\n</b>                         I can -- but it quiets my nerves.\n\n               Mark pours a drink shakily from a decanter by his law library.\n\n<b>                                     BRISTOW\n</b>                         Drink?\n\n<b>                                     HAVEN\n</b>                              (flatly)\n                         No.\n\n               Mark gulps his in an ominous silence.\n\n<b>                                     BRISTOW\n</b>                         We'd given you up for dead -- we --\n\n<b>                                     HAVEN\n</b>                              (idly rotating the \n                              cylinders of the gun)\n                         Who?\n\n<b>                                     BRISTOW\n</b>                         Who?\n\n<b>                                     HAVEN\n</b>                         Yeh.\n\n<b>                                     BRISTOW\n</b>                         Why, everybody. They found Goddard's \n                         boy -- didn't you know that? What \n                         happened? Tell me about it.\n\n<b>                                     HAVEN\n</b>                              (smiling)\n                         I'm glad you got your voice back.\n\n<b>                                     BRISTOW\n</b>                         If you're trying to imply that you \n                         frightened me, coming here like this, \n                         you're right. I'm neither a hero nor \n                         a fool.\n                              (he sits down)\n                              (shrewdly)\n                         They killed Goddard -- Why didn't \n                         they kill you?\n\n<b>                                     HAVEN\n</b>                         Somebody must have wanted me saved.\n\n<b>                                     BRISTOW\n</b>                         What for?\n\n<b>                                     HAVEN\n</b>                         I don't know. Maybe a rainy day.\n                              (dryly)\n                         Only it might never rain.\n\n               Haven puts the gun away; rises, walks to the desk, pours a \n               drink for himself. Mark watches him shrewdly.\n\n<b>                                     BRISTOW\n</b>                              (himself again)\n                         And what do you want from me?\n\n<b>                                     HAVEN\n</b>                         I'm going to make a statement, which \n                         you will write and notarize.\n\n<b>                                     BRISTOW\n</b>                         Is that all?\n\n<b>                                     HAVEN\n</b>                         Yes -- except that you put it away \n                         where it can't be stolen or tampered \n                         with.\n\n<b>                                     BRISTOW\n</b>                         I have a safe --\n\n<b>                                     HAVEN\n</b>                         I can see you have.\n\n<b>                                     BRISTOW\n</b>                         Meaning you don't trust me.\n\n<b>                                     HAVEN\n</b>                         I do -- but I don't think you trust \n                         yourself.\n\n<b>                                     BRISTOW\n</b>                         Where do you want it?\n\n<b>                                     HAVEN\n</b>                         Mrs. Caslon has a safe -- a nice fat \n                         one.\n\n<b>                                     BRISTOW\n</b>                         I think I can arrange it.\n\n<b>                                     HAVEN\n</b>                         All right -- here's the statement.\n\n               He saunters to the window -- glances through the crack of \n               the shades. When he turns, he notes that Mark has paper and \n               pencil ready.\n\n<b>                                     HAVEN\n</b>                         I solemnly swear that on Thursday \n                         last, about eleven p.m. the stagecoach \n                         in which I was riding was held up by \n                         five armed bandits. The gold I was \n                         hauling was stolen and James Goddard, \n                         the guard, was murdered in cold blood.\n\n               He pauses, looks stonily at the face of Mark, who is staring \n               at him curiously and waiting.\n\n<b>                                     HAVEN\n</b>                         I trailed the bandits, caught up \n                         with one and -- killed him.\n\n               Mark stares in amazement.\n\n<b>                                     HAVEN\n</b>                         Put it down.\n                              (as Mark obeys)\n                         I then followed the horses bearing \n                         the gold to a sawmill --\n\n<b>               EXT. CHARLIE'S SALOON - EVENING\n</b>\n               Mick is standing outside, holding the arm of Jerry as he \n               talks to the kid. Beside him stands Pete Yore's man, Ben.\n\n<b>                                     MICK\n</b>                         You sure it was Haven you met?\n\n<b>                                     JERRY\n</b>                         Don't I know my own boss?\n\n<b>                                     MICK\n</b>                              (giving him a shove)\n                         Go in and get a beer.\n\n<b>               INT. MARK'S OFFICE - EVENING\n</b>\n               As Haven finishes his statement. He is again at the window, \n               glancing out. Perhaps he has seen the incident with Mick and \n               Jerry across the crowded street.\n\n<b>                                     HAVEN\n</b>                         ...After I left there, I opened the \n                         crate. The gold was in it.\n\n               He turns back into the room. Mark is looking at him with \n               puzzled wonder, his face drawn and tense.\n\n<b>                                     HAVEN\n</b>                         That's all.\n\n               He smiles slightly. The wonder leaves Mark's face. Urbane \n               cunning replaces it.\n\n<b>                                     BRISTOW\n</b>                         Not quite.\n\n<b>                                     HAVEN\n</b>                         No.\n\n<b>                                     BRISTOW\n</b>                         What did you do about the gold?\n\n<b>                                     HAVEN\n</b>                         I came to the conclusion that I \n                         finally had enough money to need a \n                         lawyer.\n\n               Mark smiles thinly, licking his lips.\n\n<b>                                     BRISTOW\n</b>                              (needing a drink again)\n                         Have you seen the sheriff?\n\n<b>                                     HAVEN\n</b>                         I've heard about him, and I still \n                         came to you.\n\n<b>                                     BRISTOW\n</b>                         I see. Well, as a lawyer, my advice \n                         would be --\n\n<b>                                     HAVEN\n</b>                         I didn't come here for advice.\n\n<b>                                     BRISTOW\n</b>                         I'm wondering what you get out of \n                         this.\n\n<b>                                     HAVEN\n</b>                         It makes me more valuable to somebody \n                         alive than dead.\n\n<b>                                     BRISTOW\n</b>                         Who?\n\n<b>                                     HAVEN\n</b>                         I don't know... yet.\n\n<b>                                     BRISTOW\n</b>                              (levelly)\n                         Now I'm wondering what I get out of \n                         it.\n\n<b>                                     ORVILLE\n</b>                         They been here lookin' for you, the \n                         men.\n\n<b>                                     HAVEN\n</b>                         I thought they might.\n\n<b>                                     ORVILLE\n</b>                         I told them you was out.\n\n<b>                                     HAVEN\n</b>                         I was. I just came in the back way.\n\n               Haven lights the pipe.\n\n<b>                                     HAVEN\n</b>                         You finish that song?\n\n<b>                                     ORVILLE\n</b>                         I had her finished, but what good is \n                         it? It was about your death.\n\n<b>                                     HAVEN\n</b>                         Keep it a couple of days -- may be \n                         you can still use it.\n\n               He strolls back towards his room and CAMERA FOLLOWS him, the \n               strumming of the guitar again SOUNDING in the b.g.\n\n<b>               INT. HAVEN'S ROOM - EVENING\n</b>\n               Haven shuts the door, pulls off his boots and gun belt, lies \n               on the bed and stares at the ceiling. His face is sad and he \n               looks tired. The MUSIC from the saloon comes over, Charlie's \n               song... he closes his eyes and in a moment falls asleep...\n\n<b>                                                                       WIPE\n</b>\n<b>               EXT. MRS. CASLON'S MINE-CABIN - EVENING\n</b>\n               As iles rides up. He is just about to enter, after \n               dismounting, when Mark Bristow comes out of the office. Mark \n               smiles and nods at the officer.\n\n<b>                                     BRISTOW\n</b>                         Good evening, Captain.\n\n<b>                                     ILES\n</b>                              (grimly)\n                         Any news about Haven in town?\n\n<b>                                     BRISTOW\n</b>                         I just saw Haven.\n\n<b>                                     ILES\n</b>                              (abruptly)\n                         Alive?\n\n<b>                                     BRISTOW\n</b>                              (smiling)\n                         Very much.\n\n               Mark mounts his horse, drives away.\n\n<b>               INT. MRS. CASLON'S MINE CABIN - EVENING\n</b>\n               As Iles opens the door and enters. Mrs. Caslon is her usual \n               cool self as she sits at her desk. Iles crosses to her and \n               gives her a peck on the cheek as she fondly pats his hand.\n\n<b>                                     ILES\n</b>                         Good evening, Mary.\n\n<b>                                     MRS. CASLON\n</b>                         Good evening, George.\n\n<b>                                     ILES\n</b>                         I just passed Bristow.\n\n<b>                                     MRS. CASLON\n</b>                              (ignoring this)\n                         Why don't you sit down. You look \n                         tired.\n\n<b>                                     ILES\n</b>                         I should.\n\n               He sits in a comfortable chair, conscious of the fact that \n               she had ignored his reference to Bristow.\n\n<b>                                     MRS. CASLON\n</b>                         I suppose you've heard the news. The \n                         holdup and poor Jim Goddard.\n\n<b>                                     ILES\n</b>                         I heard it -- last, as usual.\n\n<b>                                     MRS. CASLON\n</b>                              (delaying)\n                         Why don't you smoke?\n\n               Iles gives her a surly look, takes a cheroot out of his tunic.\n\n<b>                                     MRS. CASLON\n</b>                              (taking a match and \n                              crossing to light \n                              his cigar)\n                         I'm afraid you're going to be angry \n                         with me.\n\n<b>                                     ILES\n</b>                              (puffing)\n                         Why?\n\n<b>                                     MRS. CASLON\n</b>                         The gold Haven tried to run was from \n                         the Argus, darling\n\n<b>                                     ILES\n</b>                         It was?\n                              (then reacting)\n                         Yours!\n\n               Iles is about to yell something at her, then holds himself \n               in check, while she wipes the spilled ashes from his uniform. \n               In this interlude he changes to an icy man.\n\n<b>                                     MRS. CASLON\n</b>                         Now don't excite yourself.\n\n<b>                                     ILES\n</b>                         I am very calm, and I calmly ask you \n                         how you could allow that scoundrel \n                         to transport gold from your mine \n                         when --\n\n<b>                                     MRS. CASLON\n</b>                         The man you call a scoundrel may be \n                         dead at this moment.\n\n<b>                                     ILES\n</b>                         And he may be in town at this moment -- \n                         where, in fact, he is.\n                              (looks at her)\n                         How you could do this without telling \n                         me --\n\n<b>                                     MRS. CASLON\n</b>                         I only did it for your sake.\n\n<b>                                     ILES\n</b>                         MY sake?\n\n<b>                                     MRS. CASLON\n</b>                         After all, Mr. Haven represents the \n                         U.S. Government.\n\n<b>                                     ILES\n</b>                         Who do you think I represent?\n\n<b>                                     MRS. CASLON\n</b>                         I told you, George, I was only trying \n                         to help you.\n\n<b>                                     ILES\n</b>                              (containing his fury)\n                         And while we're on the subject, who \n                         does Mark Bristow represent?\n\n<b>                                     MRS. CASLON\n</b>                         You know perfectly well that he's my \n                         lawyer.\n\n<b>                                     ILES\n</b>                         I know perfectly well he's a scoundrel \n                         too.\n                              (rises)\n                         Is he also trying to help me?\n\n               He walks to the door. She stands there frigidly.\n\n<b>                                     ILES\n</b>                              (at the door, a ball \n                              of cold fire)\n                         Thank you, Mary.\n\n               He turns and fumbles with the knob, but he can't do it. He \n               turns at last and walks meekly back to her.\n\n<b>                                     ILES\n</b>                         I'm sorry. I'd say that I lost my \n                         head if I believed that I had one.\n\n<b>                                     MRS. CASLON\n</b>                              (kissing him fondly)\n                         It's my fault George.\n                              (turning)\n                         Mark left me something.\n\n               She turns to the desk and hands him the long legal envelope. \n               Iles takes it and stares at it. He starts to open it.\n\n<b>                                     MRS. CASLON\n</b>                         You're not going to open it?\n\n<b>                                     ILES\n</b>                         To whom it may concern. That's what \n                         it says here.\n                              (going on)\n                         Well, it may concern me.\n\n               He opens it, looks.\n\n<b>                                     ILES\n</b>                         It does.\n\n               He hands it to her. She reads.\n\n<b>                                     ILES\n</b>                              (grimly)\n                         My business isn't jammed up enough -- \n                         so they send this harebrained demoted \n                         lieutenant pry around in it... They \n                         want to help me too.\n\n               He takes back the paper from her, thrusts a blank sheet in \n               the envelope, tosses the envelope back on the desk.\n\n<b>                                     MRS. CASLON\n</b>                         George -- you're getting to be a \n                         hard man to deal with.\n\n<b>                                     ILES\n</b>                         I'm getting to deal with some hard \n                         men.\n\n               Iron-faced, he starts out, remembers again, softens against \n               his will, comes back from the door and kisses her cheek and \n               then leaves. CAMERA stays on Mrs. Caslon as she watches him \n               go. She smiles slightly, puts the envelope in the safe, and \n               then from it takes a six-gun, looks at it and begins dusting \n               it with her handkerchief as we\n\n<b>                                                                   DISSOLVE\n</b>\n<b>                                     BRISTOW\n</b>                         You certainly are a careful man.\n\n<b>                                     HAVEN\n</b>                         I have to be. I live a careless life.\n\n               Haven begins washing his face in the washbowl, and then \n               combing his hair and readjusting his somewhat rumpled shirt. \n               Mark watches him.\n\n<b>                                     HAVEN\n</b>                         What about the deposition?\n\n<b>                                     BRISTOW\n</b>                         She has it. It's in her safe.\n\n<b>                                     HAVEN\n</b>                         Good.\n\n<b>                                     BRISTOW\n</b>                         What do we do now?\n\n<b>                                     HAVEN\n</b>                         We call on Charlie.\n\n               There is a little nervous sweat on Mark's hands; he wipes \n               them on his coat.\n\n<b>                                     BRISTOW\n</b>                         It's a dangerous play, Haven.\n\n<b>                                     HAVEN\n</b>                         Is it?\n\n<b>                                     BRISTOW\n</b>                         What if she doesn't believe you?\n\n<b>                                     HAVEN\n</b>                         Then she'll have to believe you.\n\n<b>                                     BRISTOW\n</b>                         That deposition could be a lie. It \n                         might not stand up in a court.\n\n<b>                                     HAVEN\n</b>                         You're sure of that?\n\n<b>                                     BRISTOW\n</b>                         Well -- not exactly.\n\n<b>                                     HAVEN\n</b>                         That's it. You're a lawyer and you're \n                         not sure. Then how can she gamble on \n                         it, either?\n\n<b>                                     BRISTOW\n</b>                         Because she's a gambler.\n\n<b>                                     HAVEN\n</b>                         No, she isn't.\n                              (ready to go)\n                         We're the gamblers, Mark. Lot's go.\n\n               A little shaken and uncertain, Mark obeys.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               EXT. HOTEL - EVENING\n</b>\n               As Haven and Mark come out. They walk towards the saloon. \n               People look at them curiously. Suddenly, down the street, \n               the sheriff appears, approaching Haven slowly and ominously. \n               Sensing a gun fight, people vanish. Purely from instinct, \n               Mark deserts Haven's side in a hurried walk towards the \n               saloon, eyeing both. Haven comes on leisurely. The sheriff \n               has stopped in his tracks and has his gun out. A woman \n               clutches her child to her skirt. Men stand stockstill, \n               watching. A crowd forms at the entrance to Charlie's. Haven \n               walks slowly forward until he reaches the waiting sheriff. \n               He looks him over with a smile of contempt.\n\n<b>                                     SHERIFF\n</b>                         You're under arrest!\n\n<b>                                     HAVEN\n</b>                              (pausing)\n                         For what?\n\n<b>                                     SHERIFF\n</b>                         For the murder of James Goddard -- \n                         and robbery under arms!\n\n<b>                                     HAVEN\n</b>                              (casually)\n                         I've heard about you. You don't appear \n                         to understand the functions of your \n                         office.\n                              (taking sheriff's gun \n                              and breaking it open)\n                         You've missed the whole point of \n                         your profession.\n                              (showing him)\n                         Even your gun isn't loaded.\n                              (Haven loads it as it \n                              goes on)\n                         I suggest that you start all over \n                         again, with this point in mind: the \n                         duty of a peace officer is to arrest \n                         the culprit of a crime -- not the \n                         victim.\n\n               Haven hands him back the now loaded gun and walks away towards \n               the saloon, leaving the sheriff standing there, a completely \n               dumbfounded and bepuzzled man.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               INT. CHARLIE'S SALOON - NIGHT\n</b>\n               The place is roaring. Haven enters, followed by Mark. The \n               guy at the piano is playing as always. Haven and Mark go \n               slowly to the bar, eyes following them. The noise softens \n               almost to silence, except the piano, Cowering, Mark sticks \n               close to Haven.\n\n               At the dice table, Prince stares coldly, hands another man \n               the stick and walks away to the stairway, his eyes seeking \n               Mick Marion who is also staring at Haven. Prince nods to \n               Mick as he goes.\n\n               MED. SHOT at bar -- as Haven and Mark loan against it. Ernie \n               is looking at him curiously; then towards Mick. Haven doesn't \n               follow the glance, but Mark does.\n\n<b>                                     ERNIE\n</b>                         Rye?\n\n<b>                                     HAVEN\n</b>                         Two.\n\n               Ernie gets them. Haven glances at the piano. Mick who had \n               stood there has now vanished. Haven smiles. The drinks arrive.\n\n<b>                                     BRISTOW\n</b>                              (gulping his drink)\n                         This is no good.\n\n<b>                                     HAVEN\n</b>                         The bourbon is just as bad.\n\n<b>                                     BRISTOW\n</b>                         I don't mean that.\n\n<b>                                     HAVEN\n</b>                         You want to leave?\n\n<b>                                     BRISTOW\n</b>                         I just don't like it.\n                              (taking another drink)\n                         I'm a nervous man. Something's going \n                         to happen. I can feel it.\n\n<b>                                     HAVEN\n</b>                         That's right.\n\n<b>                                     BRISTOW\n</b>                         Then why don't we do something.\n\n<b>                                     HAVEN\n</b>                         We're doing something.\n\n<b>                                     BRISTOW\n</b>                         What?\n\n<b>                                     HAVEN\n</b>                         Waiting for something to happen.\n                              (smiling at Mark)\n\n               Mark finishes off his second. A stickman comes up. Nudges \n               Haven.\n\n<b>                                     STICKMAN\n</b>                         Charlie wants to see you. Upstairs.\n\n<b>                                     HAVEN\n</b>                              (to Mark)\n                         See?\n\n               The stickman moves away. Mark looks at Haven.\n\n<b>                                     BRISTOW\n</b>                         Do I go with you?\n\n<b>                                     HAVEN\n</b>                         Can you make it?\n\n               Haven turns away towards the stairs. Mark hesitates, bites \n               his lip, swallows another drink and then grimly follows.\n\n<b>               INT. CHARLIE'S OFFICE - NIGHT\n</b>\n               Charlie is behind her desk, as Haven walks in. Behind him, \n               sweating now, comes Mark. As the two are in the room the \n               door behind them slams shut. Mick is there with a gun. Prince \n               moves slightly out of a shadow. Mark backs against a wall. \n               Charlie looks up from her fingernails. Haven smiles and \n               glances around. His eyes fix on Mick and the gun.\n\n<b>                                     HAVEN\n</b>                         I see you found the difference.\n\n               Mick says nothing, his face a blank hatred. Haven sits down \n               in a big chair.\n\n<b>                                     HAVEN\n</b>                         Looks like a board meeting.\n\n               Another door opens and Pete, the sawmill foreman, enters, \n               stands silently. Haven glances at him, then at Charlie who \n               smiles thinly back.\n\n<b>                                     CHARLIE\n</b>                              (indicating Mark)\n                         What's he doing with you?\n\n<b>                                     HAVEN\n</b>                         I thought I might need a lawyer.\n\n<b>                                     CHARLIE\n</b>                         I doubt it.\n\n<b>                                     HAVEN\n</b>                         I can realize how seldom legal \n                         technicalities annoy you -- but I \n                         have one that might.\n                              (taking out his pipe)\n                         Besides, he knows all about it.\n\n<b>                                     PRINCE\n</b>                         About what?\n\n<b>                                     HAVEN\n</b>                         About a gear box I failed to deliver.\n\n<b>                                     BRISTOW\n</b>                         I don't know anything! I merely --\n\n<b>                                     PRINCE\n</b>                         Shut up!\n\n               Mark relapses into a perspiring silence.\n\n<b>                                     HAVEN\n</b>                              (quietly)\n                         Mark is right. He doesn't know \n                         anything. He just knows what I \n                         dictated to him in a deposition.\n\n<b>                                     CHARLIE\n</b>                         And what was that?\n\n<b>                                     HAVEN\n</b>                         It was just a story. About a man who \n                         got murdered, a thief who got shot, \n                         and a gear box that got lost. Probably \n                         nobody would believe it --\n                              (glancing up)\n                         ...unless I got killed for it.\n\n               Charlie stares at him a moment. Then she glances at Pete.\n\n<b>                                     CHARLIE\n</b>                         Go downstairs, Pete. Watch the \n                         stairway.\n\n               Pete walks out.\n\n<b>                                     CHARLIE\n</b>                              (to Haven)\n                         Who else have you told?\n\n<b>                                     HAVEN\n</b>                         No one. Mark I had to have. He's a \n                         witness and a notary. He makes it \n                         stick. He stands it up in court.\n\n<b>                                     CHARLIE\n</b>                              (always watching his \n                              face)\n                         What keeps it from getting to a court?\n\n<b>                                     HAVEN\n</b>                         A cut.\n\n<b>                                     MICK\n</b>                         He's running a bluff!\n\n<b>                                     HAVEN\n</b>                         I ran one on you.\n\n               Mick burns in silence. Charlie smiles.\n\n<b>                                     CHARLIE\n</b>                         You brought your lawyer. Ask him if \n                         this doesn't sound like blackmail.\n\n<b>                                     HAVEN\n</b>                         He can't think very clearly in the \n                         presence of a gun.\n\n<b>                                     PRINCE\n</b>                         But it doesn't bother you?\n\n<b>                                     HAVEN\n</b>                              (coldly)\n                         No, it doesn't.\n\n<b>                                     PRINCE\n</b>                         What you want is money.\n\n               Haven nods.\n\n<b>                                     CHARLIE\n</b>                         I don't see how going to the law \n                         will get it for you.\n\n<b>                                     HAVEN\n</b>                         If you did see how, I'd never get \n                         there, would I?\n\n<b>                                     CHARLIE\n</b>                         I'm afraid not.\n\n<b>                                     HAVEN\n</b>                         So it boils down to this: we can \n                         make a deal, and all be happy \n                         together.\n\n<b>                                     PRINCE\n</b>                         Not as long as you always have \n                         something on us.\n\n<b>                                     HAVEN\n</b>                         Unless you also have something on \n                         me.\n\n<b>                                     CHARLIE\n</b>                         And how would that be?\n\n<b>                                     HAVEN\n</b>                         When I deliver the gold to you.\n\n<b>                                     CHARLIE\n</b>                         You mean the gear box?\n\n<b>                                     HAVEN\n</b>                         I can even forget I looked inside. \n                         So I stole a gear box... I'm still a \n                         thief.\n\n               Charlie is silent a moment. Haven lights his pipe. Charlie \n               looks at Mark, pale by the wall.\n\n<b>                                     PRINCE\n</b>                              (indicating Mark)\n                         What does he get?\n\n<b>                                     HAVEN\n</b>                         He gets even with you.\n\n<b>                                     PRINCE\n</b>                         Have you lost your mind!\n\n<b>                                     HAVEN\n</b>                         It was all right when he lost his \n                         money.\n\n<b>                                     CHARLIE\n</b>                         All right... I'll give him the \n                         IOU's... when the gear box is \n                         delivered.\n\n<b>                                     PRINCE\n</b>                              (smiling)\n                         You don't realize how important it \n                         is when a piece of machinery breaks \n                         down. It could close the entire \n                         sawmill.\n\n<b>                                     HAVEN\n</b>                         I guess I didn't realize it.\n\n               She looks coolly at Mick and Mark.\n\n<b>                                     CHARLIE\n</b>                         I think that's all.\n\n               Mark glances at Haven who nods and Mark leaves in the wake \n               of the grimly departing Mick. Prince lingers.\n\n<b>                                     CHARLIE\n</b>                              (to Haven)\n                         You can stay.\n\n<b>                                     HAVEN\n</b>                              (to Prince)\n                         I think she was talking to me.\n\n               Prince gets up grimly, his lips tight, the dice held hard in \n               his fingers. He stares at Haven.\n\n<b>                                     PRINCE\n</b>                         You roll nice dice and you bet them \n                         jamb up, but some day you'll slip. \n                         And when you do, I'll be around to \n                         catch you.\n\n               He turns and walks out. Haven watches him go.\n\n<b>                                     HAVEN\n</b>                         You know, I think he will.\n\n<b>                                     CHARLIE\n</b>                         Then you should be more careful.\n\n<b>                                     HAVEN\n</b>                         The poorhouses are filled with careful \n                         men...\n                              (knocking out his \n                              pipe)\n                         ...And so are the graveyards.\n\n               Charlie comes around and sits on the arm of his chair.\n\n<b>                                     HAVEN\n</b>                         You've got a nice perfume.\n\n<b>                                     CHARLIE\n</b>                         Carnation.\n                              (she ruffles his hair \n                              with her hand)\n                         I almost had to have you killed. I'd \n                         have hated it.\n\n<b>                                     HAVEN\n</b>                         So would I.\n\n<b>                                     CHARLIE\n</b>                         I'd have missed you... too much.\n\n<b>                                     HAVEN\n</b>                         And too long.\n\n               She brushes his cheek with her lips.\n\n<b>                                     CHARLIE\n</b>                              (she smiles at him)\n                         Did you ever tell a woman you loved \n                         her?\n\n<b>                                     HAVEN\n</b>                         All of them.\n\n<b>                                     CHARLIE\n</b>                         How did you get away?\n\n<b>                                     HAVEN\n</b>                         I was always in the doorway when I \n                         said it.\n\n<b>                                     CHARLIE\n</b>                         You never said it to me.\n\n<b>                                     HAVEN\n</b>                         Let's go over to the doorway.\n\n               He rises and so does she. She picks up a scarf in silence \n               and anger, crosses and goes out the door, Haven following \n               her.\n\n<b>               INT. STAIRWAY - NIGHT\n</b>\n               As Haven and Charlie descend. Her face is hard.\n\n<b>                                     CHARLIE\n</b>                         I seem to always end up like this \n                         with you. I take you for granted. \n                         You like it that way. It goes with \n                         loaded dice and crimped cards and \n                         fixed wheels.\n\n<b>                                     HAVEN\n</b>                         Isn't that your business.\n\n<b>                                     CHARLIE\n</b>                         It isn't my life.\n\n               As they descend, Stellman can be seen in the bar crowd, \n               watching them.\n\n               MED. SHOT of Charlie and Haven at foot of stairs. Haven is \n               smiling at her, but her face is serious and her eyes hard.\n\n<b>                                     CHARLIE\n</b>                         You told me once you might be a \n                         missionary on your way to China. And \n                         that's as much as I've ever found \n                         out about you. You're working for \n                         me, but for all I know you could be \n                         working for somebody else.\n\n<b>                                     HAVEN\n</b>                         Like Goddard?\n\n<b>                                     CHARLIE\n</b>                         Why not?\n\n               Haven smiles. He can see Stellman approaching.\n\n<b>                                     HAVEN\n</b>                         I think I better bring you that gold.\n\n               He starts away, but Stellman halts him.\n\n<b>                                     STELLMAN\n</b>                         Haven.\n\n               Haven looks at him. Charlie watches.\n\n<b>                                     HAVEN\n</b>                         Don't tell me you're still recruiting?\n\n<b>                                     STELLMAN\n</b>                         Yes, we still want you. But this is \n                         a little different.\n\n<b>                                     HAVEN\n</b>                         And how's that?\n\n<b>                                     STELLMAN\n</b>                         Captain Iles has asked me to take \n                         you into custody, Haven.\n\n               Haven stares at him, then looks at Charlie. A slow smile \n               dawns on her face.\n\n<b>                                     CHARLIE\n</b>                              (quietly)\n                         You heard the man.\n\n<b>                                     STELLMAN\n</b>                         Best thing for you is to come along, \n                         Haven.\n\n<b>                                     HAVEN\n</b>                         That's what I like -- the best thing \n                         for me.\n\n               He pats Charlie's shoulder and then walks out with Stellman. \n               Charlie watches them go. Prince appears beside her.\n\n<b>                                     PRINCE\n</b>                         Very friendly with everybody -- isn't \n                         he? Wells Fargo detectives, and now \n                         the Army. How far can he go?\n\n<b>                                     CHARLIE\n</b>                         Exactly where he's headed now -- to \n                         jail.\n\n               She walks away towards the piano. Prince stands there, \n               watching Haven go.\n\n<b>                                                                   DISSOLVE\n</b>\n               Note: Pick up two night exteriors of the post.\n\n<b>               INT. ILES' OFFICE - NIGHT\n</b>\n               There is a sergeant inside facing Iles who sits behind his \n               desk. Stellman and Haven pause at the door.\n\n<b>                                     SERGEANT\n</b>                              (to Iles)\n                         The Quartermaster at Platte wants \n                         three sworn statements before he'll \n                         replace those seventy uniforms, sir.\n\n<b>                                     ILES\n</b>                         Three sworn statements! I told him \n                         all I know. They were in the freight \n                         office at West Rim City. The building \n                         burned down.. .you sure he doesn't \n                         want me to send him the ashes too?\n                              (seeing Stellman)\n                         All right, have Stamm fix the papers.\n\n               The Sergeant exits. Iles looks calmly and with relish at \n               Haven.\n\n<b>                                     ILES\n</b>                              (pleasantly)\n                         Come in.\n\n               Haven and Stellman enter. Stellman closes the door and stands \n               near it. Haven smiles and nods at Iles, then sits down \n               unbidden.\n\n<b>                                     ILES\n</b>                         Nice to see you alive.\n\n<b>                                     HAVEN\n</b>                         Dumb luck.\n\n<b>                                     ILES\n</b>                         You seem to have been living quite \n                         an adventurous life.\n\n<b>                                     HAVEN\n</b>                         Is that why I'm under arrest?\n\n<b>                                     ILES\n</b>                         That's indefinite. I wanted to talk \n                         to you.\n\n<b>                                     HAVEN\n</b>                         If you consult the Army Blue Book it \n                         might enable you to be more definite.\n\n<b>                                     ILES\n</b>                              (grimly)\n                         Curiously enough, you got me into \n                         the habit of reading myself. You're \n                         quite right about The Blue Book --\n                              (fiercely)\n                         UNLESS that officer should get himself \n                         about one-half as far out of line as \n                         you have!\n\n<b>                                     HAVEN\n</b>                         How far is that?\n\n               Iles picks up the deposition, extends it.\n\n<b>                                     ILES\n</b>                         Right here in your own statement!\n\n               Haven glances at him, then at the statement, and then tosses \n               it on the desk and inhales.\n\n<b>                                     HAVEN\n</b>                         I see you did what I expected.\n\n<b>                                     ILES\n</b>                         You've gotten a man killed and Mrs. \n                         Caslon's gold stolen. Is that far \n                         enough?\n\n<b>                                     HAVEN\n</b>                         Not quite.\n\n<b>                                     ILES\n</b>                              (rising slowly)\n                         Haven -- as far as I'm concerned, \n                         this deposition is good enough for \n                         me.\n                              (indicates the \n                              deposition)\n                         I want these people arrested. This \n                         is all the evidence we need.\n\n<b>                                     HAVEN\n</b>                         I need more.\n\n<b>                                     ILES\n</b>                         For what reason?\n\n<b>                                     HAVEN\n</b>                         For the reason I came here... to get \n                         the murderers of two soldiers -- not \n                         to save somebody's gold. That's a \n                         mistake you made. I still don't know \n                         who killed them, but I'm going to \n                         find out. And when the net is hauled \n                         in, they're all going to be in it.\n                              (rising)\n                         That's my fish -- and you can have \n                         the minnows.\n\n<b>                                     ILES\n</b>                              (demandingly)\n                         When are you returning Mrs. Caslon's \n                         gold?\n\n<b>                                     HAVEN\n</b>                              (firmly)\n                         That's a matter between myself and \n                         Mrs. Caslon.\n\n               They look hard at each other in silence.\n\n<b>                                     ILES\n</b>                         I don't particularly like you -- but \n                         I see no reason why you should get \n                         yourself deliberately killed.\n\n<b>                                     HAVEN\n</b>                              (smiling again)\n                         It won't be deliberate.\n\n<b>                                     ILES\n</b>                         What difference does it make how you \n                         get killed? Where does it leave me?\n\n<b>                                     HAVEN\n</b>                         Where does it leave me?\n\n<b>                                     ILES\n</b>                              (meaning it)\n                         Understand this, Haven. You're heading \n                         for bad trouble -- and when it comes \n                         don't expect any help from me. Is \n                         that clear?\n\n<b>                                     HAVEN\n</b>                              (smiling thinly)\n                         From the beginning.\n\n               Haven turns and walks out; the door closes behind him. Iles \n               slumps down into his chair. Stellman is smiling faintly at \n               him.\n\n<b>                                     STELLMAN\n</b>                         Anything else, Sir?\n\n<b>                                     ILES\n</b>                              (glumly)\n                         Yes, three cigars, a pint of whiskey, \n                         and a copy of that confounded Blue \n                         Book.\n\n               As Stellman turns away.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               INT. HOTEL LOBBY - NIGHT\n</b>\n               As Haven saunters in. Orville is, as always, behind the desk. \n               Haven nods at him.\n\n<b>                                     HAVEN\n</b>                         What's the good word?\n\n<b>                                     ORVILLE\n</b>                         For you it's not good. You're in bad \n                         trouble.\n\n<b>                                     HAVEN\n</b>                         I don't know how you can know so \n                         much and move so little.\n                              (turning to go)\n                         I think I'll try it myself.\n\n<b>                                     ORVILLE\n</b>                         Want to leave a call?\n\n<b>                                     HAVEN\n</b>                         That's very nice of you.\n\n<b>                                     ORVILLE\n</b>                         What time?\n\n<b>                                     HAVEN\n</b>                         When you're sure everybody in town \n                         is in bed -- call me. And if anybody \n                         asks for me -- I went to jail.\n\n               He goes and Orville strums a little jail song.\n\n<b>                                                                   FADE OUT\n</b>\n<b>               FADE IN\n</b>\n<b>               EXT. COUNTRY - DAY\n</b>\n               Haven, driving a wagon and team of horses, is retracing the \n               road he took back from the sawmill looking for the place \n               where he dumped the bullion.\n\n               CLOSER VIEW of Haven, as he looks for the landmarks. He is \n               whistling softly the tune that Charlie always sings. At last \n               he stops, alights and makes his way down the steep slope, a \n               couple of gunny sacks slung across his shoulder.\n\n               Bottom of the gulley as Haven gets there and locates the \n               crate at rest in a clump of brush. The crate has broken from \n               the fall. Haven loads the buckskin bags of gold into the \n               gunny sack and scrambles back up the slope.\n\n               Side of slope as Haven scrambles to the top, he finds himself \n               looking into a six-shooter held in the unwavering hand of \n               Mrs. Caslon. Her eyes are hard and a grim smile plays at the \n               corners of her mouth.\n\n<b>                                     MRS. CASLON\n</b>                         Drop it.\n\n               Haven obeys.\n\n<b>                                     MRS. CASLON\n</b>                         Turn around with your hands up.\n\n               Haven turns. She takes his gun and tosses it in the wagon; \n               then glances inside the sack, sees the gold. She backs off a \n               step or two.\n\n<b>                                     MRS. CASLON\n</b>                         All right -- put it in the wagon.\n\n               Haven turns to obey. He manages a smile at her.\n\n<b>                                     HAVEN\n</b>                         Is this a hold-up?\n\n<b>                                     MRS. CASLON\n</b>                         You want to put it in the wagon?\n\n<b>                                     HAVEN\n</b>                              (looking at her hard \n                              eyes)\n                         Yes.\n\n               He struggles with the sack, swings it onto the wagon in which \n               he came. Then stands back, looking at her.\n\n<b>                                     MRS. CASLON\n</b>                         Now was there something you wanted \n                         to say?\n\n<b>                                     HAVEN\n</b>                         I trailed one of the bandits here \n                         where they cached it. I couldn't \n                         haul it on horseback, so I came here \n                         with the wagon.\n\n<b>                                     MRS. CASLON\n</b>                         I know that's a lie.\n\n<b>                                     HAVEN\n</b>                         Some of it's true.\n\n<b>                                     MRS. CASLON\n</b>                         But not nearly enough.\n\n<b>                                     HAVEN\n</b>                         I'll try it again. I cached it here \n                         myself. I was going to turn it over \n                         to them. I wanted to buy a membership \n                         in their club. This was the initiation \n                         fee.\n\n<b>                                     MRS. CASLON\n</b>                         Fifty thousand dollars?\n\n<b>                                     HAVEN\n</b>                         Well, you see, I thought it was worth \n                         it.\n\n<b>                                     MRS. CASLON\n</b>                         Well, you see, I don't.\n\n               She climbs to the seat of the wagon watching him warily. \n               Haven doesn't move.\n\n<b>                                     HAVEN\n</b>                              (quietly)\n                         What you're doing may get me into \n                         serious trouble.\n\n<b>                                     MRS. CASLON\n</b>                         If you're still in town in twenty-\n                         four hours, I promise what I do may \n                         get you hanged.\n\n               She grabs the rein of her own horse, flicks the reins of the \n               wagon team and rides away, leaving Haven on the road, \n               horseless and very much discountenanced. He watches grimly \n               as she rides away. At a distance from him she tosses his gun \n               beside the road.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               INT. CHARLIE'S SALOON - DAY\n</b>\n               As Haven enters. He is dusty and tired from his long walk. \n               The place is moderately busy.\n\n               MED. SHOT of Haven as he sits tiredly at a table where Charlie \n               and Prince are sitting. She smiles at him.\n\n<b>                                     CHARLIE\n</b>                         I thought you were in jail.\n\n<b>                                     HAVEN\n</b>                         I talked my way out.\n\n<b>                                     CHARLIE\n</b>                         You're a very glib man. You seem to \n                         talk your way out of everything.\n\n<b>                                     HAVEN\n</b>                         Up to a certain point.\n\n<b>                                     CHARLIE\n</b>                         What's that?\n\n<b>                                     HAVEN\n</b>                         A gun.\n                              (to the waiter)\n                         Champagne.\n\n               The waiter exits. Charlie looks at Haven curiously.\n\n<b>                                     PRINCE\n</b>                         Are we celebrating something?\n\n<b>                                     HAVEN\n</b>                              (to Charlie)\n                         You know, the first time I talked to \n                         you we had champagne.\n                              (smiling at her)\n                         I think I should have been a \n                         missionary and gone to China after \n                         all.\n\n               He takes out the pipe, twirls it in his fingers. The waiter \n               puts down the champagne. Charlie is looking at Haven with \n               puzzlement and curiosity. The waiter goes...\n\n<b>                                     CHARLIE\n</b>                         Didn't you bring me something?\n\n<b>                                     HAVEN\n</b>                         No.\n\n<b>                                     CHARLIE\n</b>                         But you will?\n\n<b>                                     HAVEN\n</b>                         No.\n\n               Her face changes; hardens. She glances across at Prince. \n               Haven watches Prince with a smile.\n\n<b>                                     PRINCE\n</b>                              (quietly)\n                         No -- just like that?\n\n<b>                                     HAVEN\n</b>                         It's easy to explain. It's just a \n                         little hard to believe.\n\n<b>                                     CHARLIE\n</b>                         Make it as credible as you can.\n\n<b>                                     HAVEN\n</b>                              (smiling grimly)\n                         I can't.\n                              (filling the pipe)\n                         I went to get it, and it was there. \n                         But so was somebody else.\n\n<b>                                     CHARLIE\n</b>                         Who?\n\n<b>                                     HAVEN\n</b>                         Mrs. Caslon.\n\n<b>                                     CHARLIE\n</b>                         Alone?\n\n<b>                                     HAVEN\n</b>                         No... she had a gun with her.\n\n<b>                                     PRINCE\n</b>                         Did you have one too?\n\n<b>                                     HAVEN\n</b>                         The one she had was in her hand.\n\n               There is a silence. Prince stares idly at the dice cubes in \n               his hand. Charlie stares straight at Haven. Haven glances at \n               Prince.\n\n<b>                                     HAVEN\n</b>                         This could be that slip you mentioned.\n\n               Prince just stares at him.\n\n<b>                                     CHARLIE\n</b>                              (to Haven)\n                         So this nice lady held you up and \n                         took the gold, is that it?\n\n<b>                                     HAVEN\n</b>                         It's like saying I got robbed at \n                         Sunday school. It's no good, is it?\n\n<b>                                     PRINCE\n</b>                              (looking at him)\n                         No, it isn't.\n\n<b>                                     HAVEN\n</b>                         I even had to walk back to town. I \n                         think that may be one of the longest \n                         walks I ever took.\n\n<b>                                     PRINCE\n</b>                         And one of the last.\n\n               Haven takes a sip of the champagne, Charlie's whole manner \n               has now changed. It is cold and very quiet.\n\n<b>                                     PRINCE\n</b>                         Mick might have killed you, but you \n                         fought him with your fists. The \n                         sheriff had a gun but you took it \n                         away from him. Ben had a gun last \n                         night but it didn't seem to scare \n                         you. Now this genteol petticoat waves \n                         a pistol and you run for your life.\n\n<b>                                     HAVEN\n</b>                              (twirling the \n                              wineglass, glancing \n                              at Charlie)\n                         He makes it sound very silly.\n\n<b>                                     PRINCE\n</b>                         Or I make it sound like what it is: \n                         a lie!\n                              (he rises)\n\n               Haven reaches in his pocket for a match. Prince, mistaking \n               the gesture, swiftly extracts a small pistol from his belt, \n               covers him.\n\n<b>                                     PRINCE\n</b>                         No.\n\n               Haven extracts the match, with a glance of contempt at Prince; \n               then lights the pipe again.\n\n<b>                                     HAVEN\n</b>                              (smiling faintly)\n                         My word doesn't seem very good around \n                         here.\n\n<b>                                     PRINCE\n</b>                         You've only got one thing left that's \n                         any good here - and that's some gold.\n\n<b>                                     HAVEN\n</b>                              (to Charlie)\n                         Is that all I've got?\n\n<b>                                     CHARLIE\n</b>                         Not quite. You've got some time. \n                         You've got two hours to get it here.\n\n               There is a brief silence that punctuates this statement. It \n               has an air of fatal finality, marked by the idle MUSIC of \n               the deaf pianist. Haven puts his pipe away, carefully so \n               that Prince won't get any mistaken ideas.\n\n<b>                                     HAVEN\n</b>                         You want me to fatten you up before \n                         you kill me? Is that what you mean?\n\n<b>                                     CHARLIE\n</b>                         I said what I meant -- two hours.\n\n               Haven rises. He brushes some dust off his coat, smiles thinly \n               at Charlie.\n\n<b>                                     HAVEN\n</b>                         I once knew a guy who stole a dime \n                         tip from a lunch counter and parlayed \n                         it into fifty thousand. I might try \n                         that -- but not in two hours.\n\n               She says nothing; her face carved out of ice. Prince smiles \n               thinly. Haven looks at him, shrugs. He hesitates; then pats \n               Charlie's frigid shoulder.\n\n<b>                                     HAVEN\n</b>                              (to Charlie)\n                         You're sweet.\n\n               He turns and walks slowly out. The dirge of the piano follows \n               him. Prince fingers his pistol a little, tempted. At a look \n               from Charlie he puts it away. Haven goes out. Charlie suddenly \n               leaves the tables and goes quickly up the stairs. Prince \n               watches her with a slow smile, picks up Haven's gun and \n               pockets it...\n\n<b>                                                                       WIPE\n</b>\n<b>               EXT. STREET - DAY\n</b>\n               As Haven leaves the saloon. He pauses, looks around, up at \n               the sky, then down the street. He takes out his pipe and \n               beginning filling it slowly with tobacco, as Mark Bristow \n               comes hurrying across the street.\n\n               MOVING SHOT of Haven as he walks very slowly, filling the \n               pipe, and Mark comes alongside and walks with him. Haven \n               hardly glances at him.\n\n<b>                                     BRISTOW\n</b>                         I've been looking for you. Where \n                         have you been?\n\n<b>                                     HAVEN\n</b>                         I took a walk in the country.\n\n<b>                                     BRISTOW\n</b>                         Did you get it for her?\n\n<b>                                     HAVEN\n</b>                         No.\n                              (pausing in front of \n                              the hotel)\n                         Sorry.\n\n               MED. SHOT of Haven and Mark outside the hotel. Mark is afraid \n               and puzzled. He keeps staring at Haven's face.\n\n<b>                                     BRISTOW\n</b>                         But that was the deal. You agreed to --\n\n               He pauses as two men walk by.\n\n<b>                                     BRISTOW\n</b>                         If you're trying to pull something --\n\n<b>                                     HAVEN\n</b>                              (finished with the \n                              pipe)\n                         You want to listen?\n\n<b>                                     BRISTOW\n</b>                              (calming himself)\n                         All right.\n\n<b>                                     HAVEN\n</b>                              (explicitly)\n                         I can't deliver it because I no longer \n                         have it. It was taken away from me \n                         by Mrs. Caslon. I've told Charlie, \n                         and she's very unhappy. I have two \n                         hours to produce the loot. You haven't \n                         any idea where a man could raise \n                         fifty thousand quickly, have you?\n\n               Mark's mouth pops open.\n\n<b>                                     HAVEN\n</b>                         I thought not.\n\n               Haven lights the pipe. Mark stands there, mouth open; fear \n               draining the blood from his face. His voice is a mere whisper.\n\n<b>                                     BRISTOW\n</b>                         What are you going to do...?\n\n<b>                                     HAVEN\n</b>                         Nothing, Mark. The boat just sailed.\n\n<b>                                     BRISTOW\n</b>                         What about me?\n\n<b>                                     HAVEN\n</b>                         You'll have to think of something \n                         very good.\n\n               Mark stares at him, then looks off. His face becomes grim. \n               He almost glares back at Haven.\n\n<b>                                     BRISTOW\n</b>                         I can think of something.\n\n<b>                                     HAVEN\n</b>                              (patting his shoulder \n                              with a slight smile)\n                         Go ahead, Mark. Go ahead and do it.\n\n               Mark stares at him, then turns abruptly away. He hurries \n               across the street. Haven watches him as he goes off in the \n               direction of Mrs. Caslon. Haven smiles and walks inside the \n               hotel.\n\n<b>                                                                       WIPE\n</b>\n<b>               INT. HAVEN'S ROOM - DAY\n</b>\n               He enters, locks the door. Pulls the shade at the window, \n               takes off his shoes and coat and lies down on the bed. He \n               gazes towards the wall, thoughtfully. He gets up, goes to \n               the window, opens it softly; then looks out. Down the alley, \n               at the corner, a man is lounging; an ugly looking character, \n               whose eyes watch the alleyway. Haven smiles wryly, goes back \n               to the bed and lies down. The piano music starts next door.\n\n<b>               INT. SALOON - DAY\n</b>\n               Showing the deaf pianist at the piano, playing. CAMERA PICKS \n               UP Pete as he enters, FOLLOWS him as he walks up the stairs.\n\n<b>               INT. UPPER HALLWAY - SALOON\n</b>\n               As Pete knocks on Charlie's office door, then enters.\n\n<b>               INT. CHARLIE'S OFFICE - DAY\n</b>\n               As Pete enters. He looks around. Mick is sitting there and \n               Prince. Charlie is standing at the window. By another door \n               another grim character stands in silence. Charlie turns as \n               Peter enters.\n\n<b>                                     CHARLIE\n</b>                         Everything ready?\n\n<b>                                     PETE\n</b>                         All set.\n\n<b>                                     PRINCE\n</b>                         Got enough men at the sawmill?\n\n<b>                                     PETE\n</b>                         Plenty.\n\n<b>                                     PRINCE\n</b>                         All right. Go back out there and get \n                         them into the uniforms. We'll hit \n                         the post just before midnight.\n\n               Pete turns and walks out, shutting the door behind him. There \n               is silence. Charlie looks out the window again. Prince fools \n               with the dice. Mick stands stolidly near the door. At last \n               the silence is broken over the ticking of the wall clock.\n\n<b>                                     PRINCE\n</b>                         I don't know what we're waiting for.\n\n<b>                                     CHARLIE\n</b>                         I gave him some time. He's in the \n                         hotel. He's not doing anything. I \n                         gave him some time. I don't care \n                         what he does with it.\n\n               She has not turned from the window. The clock ticks. From \n               behind her Mick's voice comes, quiet and deadly.\n\n<b>                                     MICK\n</b>                         And I don't care when, but I'll get \n                         him.\n\n<b>                                     CHARLIE\n</b>                         Again?\n\n               Mick is silent. Charlie smiles thinly.\n\n<b>               EXT. STREET - NIGHT\n</b>\n               As Mark hurries into the saloon, a desperate look on his \n               face.\n\n<b>               INT. CHARLIE'S OFFICE - DAY\n</b>\n               As Charlie turns from the window.\n\n<b>                                     CHARLIE\n</b>                         Bristow's here.\n\n<b>                                     PRINCE\n</b>                         This should be good.\n\n<b>                                     CHARLIE\n</b>                              (to Mick)\n                         Let him in.\n\n               Mick goes to the door, opens it; just as Mark arrives a little \n               breathlessly at the door. Mark enters, a little surprised at \n               the door opening for him, glancing back as Mick quietly shuts \n               it. Charlie looks coldly at the lawyer who is sweating again. \n               Mark stands there, silent a moment, gathering himself \n               together.\n\n<b>                                     CHARLIE\n</b>                         You want the I.O.U's?\n\n<b>                                     BRISTOW\n</b>                         You mean --\n\n               She has turned to the safe; now she turns with them and as \n               Mark reaches for them, Charlie drops them at his feet. They \n               scatter. He bends to pick them up. Prince smiles at him \n               contemptuously. Mark is picking them up one at a time when \n               suddenly he pauses, stands erect, and looks at them with \n               fear and suspicion.\n\n<b>                                     BRISTOW\n</b>                         Why? Did Haven --\n\n<b>                                     PRINCE\n</b>                         No, he didn't.\n\n<b>                                     BRISTOW\n</b>                         Then I don't understand --\n\n<b>                                     PRINCE\n</b>                         We don't think they're going to be \n                         any good.\n\n               Mark stands there. The papers slip from his fingers. He knows \n               what Prince means. But his mouth hardens in an effort.\n\n<b>                                     BRISTOW\n</b>                         I didn't have anything to do with \n                         it. All I did was write it. I'm not \n                         in on this. I can still make them \n                         good.\n                              (he puts a couple \n                              back on the desk)\n                         Or I can --\n\n<b>                                     CHARLIE\n</b>                         What?\n\n<b>                                     BRISTOW\n</b>                         I can do business.\n                              (fumbling in his pocket)\n                         I got it somewhere. I -- Here -- \n                         take a look at this -- the deposition --\n                              (bringing out the \n                              deposition)\n                         The only copy.\n\n<b>                                     CHARLIE\n</b>                              (coldly)\n                         Let's have it.\n\n<b>                                     BRISTOW\n</b>                              (eagerly)\n                         Here.\n\n               Hands it to her.\n\n<b>                                     PRINCE\n</b>                         What do you want?\n\n<b>                                     BRISTOW\n</b>                              (as Charlie opens the \n                              envelope)\n                         Nothing. I just want to get out of \n                         it. I never had any part of it. This \n                         ought to prove that!\n\n<b>                                     CHARLIE\n</b>                         This?\n\n               She hands him the paper from the envelope. Marks takes it \n               and stares at it. It is absolutely a blank piece of paper. \n               He stands there, bites his lips. He looks wearily around at \n               them, fear making him weak, making him unable to hold the \n               piece of paper, so that it floats to the carpet.\n\n<b>                                     BRISTOW\n</b>                              (at last)\n                         It's -- it's a trick. I --\n                              (trying to pull himself \n                              together)\n                         I'll see about this! He can't do \n                         this to me!\n                              (moving back towards \n                              the door)\n                         I'll go and see about this!\n\n<b>                                     CHARLIE\n</b>                         Sure, you see about it.\n\n               He stops dead in his tracks as Charlie moves towards him \n               with a little pistol, pearl-handled. But she only gives it \n               to him. She has to take his hand and put it in his palm.\n\n<b>                                     CHARLIE\n</b>                         Take this along.\n\n               He backs out, the little gun in his hand. Mick opens the \n               door. In sudden relief and haste Mark barrels out. They can \n               hear his quick feet on the stairs outside. Prince looks at \n               Charlie.\n\n<b>                                     PRINCE\n</b>                         Something left to wait for?\n\n<b>                                     CHARLIE\n</b>                              (slowly)\n                         No.\n\n               Prince gets up and leaves, and Mick, with a grim smile of \n               anticipation follows. Charlie sits slowly down in the chair. \n               The music comes up the stairs and through the door.\n\n<b>               INT. HAVEN'S BEDROOM - DAY\n</b>\n               Haven is lying on the bed, his arms under his head, his eyes \n               on the ceiling. There is a SOUND in the hallway and then a \n               hurried knock at the door. Haven slowly rises, walks to the \n               door. He stands there. The knock SOUNDS again.\n\n<b>                                     HAVEN\n</b>                         Who is it?\n\n<b>                                     MARK'S VOICE\n</b>                         It's me -- Bristow -- let me in.\n\n               Haven opens the door. Mark enters swiftly, the little gun in \n               his hand. Haven shuts the door and locks it. He turns and \n               faces Mark, now pointing the gun. Without a word Haven walks \n               over to the bed and lies down again, looking at the ceiling. \n               Mark follows him with the gun.\n\n<b>                                     HAVEN\n</b>                         You going to shoot me, Mark?\n\n<b>                                     BRISTOW\n</b>                         You double crossed me, Haven.\n\n<b>                                     HAVEN\n</b>                         I did?\n\n<b>                                     BRISTOW\n</b>                         I got the deposition back. I took it \n                         to them.\n\n               Haven leans on one elbow, looking at him.\n\n<b>                                     BRISTOW\n</b>                         It wasn't there! It was a piece of \n                         blank paper!\n\n               Haven lies back with a short laugh. Mark stares at him in \n               fury.\n\n<b>                                     BRISTOW\n</b>                         Don't you laugh at me! I ought to \n                         kill you!\n\n<b>                                     HAVEN\n</b>                         They want you to, Mark.\n\n               Haven again leans on one elbow, looking at Mark and the \n               trembling hand that holds the gun.\n\n<b>                                     HAVEN\n</b>                         And it may be your only out, if you \n                         do. But I doubt it. You know why? \n                         Because even if you took them my \n                         scalp, it wouldn't buy your life. \n                         You're in debt and you're broke and \n                         you're scared -- and you know far \n                         too much. There isn't any way they \n                         use you -- alive. Can you think of \n                         one?\n\n               Mark sits slowly back in the chair, beaten.\n\n<b>                                     BRISTOW\n</b>                         They're going to do it. I know it. \n                         They're going to kill me --\n                              (his hand trembles)\n                         Why do they have to kill me?\n\n<b>                                     HAVEN\n</b>                         Us, Mark...\n\n               Haven gets up slowly, reaches over and takes the little gun, \n               smiles at it.\n\n<b>                                     HAVEN\n</b>                         This must be hers.\n\n<b>                                     BRISTOW\n</b>                              (dully)\n                         Yes.\n\n<b>                                     HAVEN\n</b>                         She's sweet.\n\n               He puts the gun on the table. Mark's teeth are chattering. \n               He is almost ready to cry. Haven gets a bottle and pours him \n               a drink in a dusty glass. He hands it to Mark.\n\n<b>                                     HAVEN\n</b>                         There's one thing, Mark.\n\n<b>                                     BRISTOW\n</b>                              (gulping the drink)\n                         There is?\n\n<b>                                     HAVEN\n</b>                         You might get out of town.\n\n<b>                                     BRISTOW\n</b>                         There isn't a chance in a thousand.\n\n<b>                                     HAVEN\n</b>                         If there's one in a million, it's \n                         the only one you have.\n\n               Mark gets up waveringly. Takes another hooker.\n\n<b>                                     BRISTOW\n</b>                         Yes -- we might get away with it. We \n                         might...\n\n<b>                                     HAVEN\n</b>                         I'm not going.\n\n               Mark stares at him. Haven smiles grimly back.\n\n<b>                                     HAVEN\n</b>                         I have to stay.\n\n<b>                                     BRISTOW\n</b>                         But you can't stay. You said yourself --\n\n<b>                                     HAVEN\n</b>                         If you must do this, go straight to \n                         your horse. Don't stop for anything.\n\n<b>                                     BRISTOW\n</b>                         -- I've got a lot of important papers --\n\n<b>                                     HAVEN\n</b>                         You haven't got anything important \n                         left, Mark -- except your life, and \n                         very little time to keep it. You do \n                         it very fast and you might be lucky.\n\n<b>                                     BRISTOW\n</b>                              (trying to pull himself \n                              together)\n                         Yes. I might be. I'll try it.\n\n               Mark hurries out into the hall. Goes. Haven turns back and \n               looks at the room, picks up the little pistol, smiles at it. \n               Shrugs and then slips into his coat and exits, too.\n\n<b>               INT. HOTEL LOBBY - DAY\n</b>\n               As Haven enters. SHOOTING FROM his ANGLE, we can see, as he \n               does, Mark crossing the street, apparently towards his law \n               office. He is in such a hurry that he falls down, crawls a \n               little, gets up, runs. Just as he reaches the office door, \n               just as his hand touches the knob, a shot rings out and he \n               crumples. He still tries, then his hand slips from the knob \n               and he lies there dead. The vacant street is empty with his \n               death. Haven stares. He takes a match from the counter, \n               applies it to his pipe -- then finding the pipe empty, smiles \n               thinly and pockets it\n\n<b>                                     HAVEN\n</b>                              (softly; turning to \n                              the clerk)\n                         You didn't throw away that verse?\n\n<b>                                     ORVILLE\n</b>                         No.\n\n<b>                                     HAVEN\n</b>                         You won't have to change it much.\n\n               He takes the little pistol from his pocket and glances at \n               it. The clerk, watching, idly strumming the guitar string.\n\n<b>                                     ORVILLE\n</b>                         You ain't going out there with that?\n\n<b>                                     HAVEN\n</b>                         Not much, is it?\n\n<b>                                     ORVILLE\n</b>                         You'll never get closer to having \n                         nothin' --\n\n<b>                                     HAVEN\n</b>                              (staring out)\n                         No -- I won't.\n\n<b>                                     ORVILLE\n</b>                         Say --\n\n<b>                                     HAVEN\n</b>                         Yeh?\n\n<b>                                     ORVILLE\n</b>                         I'm naturally sentimental, bein' a \n                         sort of poet.\n\n<b>                                     HAVEN\n</b>                         Naturally.\n\n<b>                                     ORVILLE\n</b>                         I keep a bunch of gimeracks -- an \n                         oldtime sheriff's gun, a bullet from \n                         a dead bandit, a rosary from some \n                         guy they hanged.\n\n<b>                                     HAVEN\n</b>                         That's nice. A hobby?\n\n<b>                                     ORVILLE\n</b>                         In a way -- Want to leave me \n                         something?\n\n               Haven smiles. He feels in his pocket, comes out with the \n               army button gotten at the sawmill.\n\n<b>                                     HAVEN\n</b>                         This is all I seem to have.\n\n<b>                                     ORVILLE\n</b>                              (taking it)\n                         Army button.\n                              (puzzled)\n                         Where's the uniform that goes with \n                         it?\n\n<b>                                     HAVEN\n</b>                         What do you want for --\n                              (he pauses as the \n                              idea hits him)\n                         Yeh? A very good question.\n\n               The clerk stares at him; Haven smiles grimly. He breaks the \n               little gun, checks it.\n\n<b>                                     HAVEN\n</b>                         I might even know. I think I'll try \n                         to go and find out.\n\n               He starts to the door, the little gun in hand; very slowly. \n               Watching him, the clerk twangs the strings softly. Haven \n               walks very slowly. He opens the door and hesitates. Just as \n               he is about to step out, looking up and down the street, \n               there is a furor and the sheriff rides up outside and \n               dismounts. Starts over to inspect Mark's body. He turns as \n               Haven walks on to the street, hands held high.\n\n<b>               EXT. STREET - DAY\n</b>\n               As Haven emerges and the Sheriff holds a gun on him.\n\n               ANGLE on Mick as down the street, with disgust, he lowers \n               his gun.\n\n               ANGLE on Prince as from a doorway he watches. Stopping with \n               a shake of his head the intent of a man beside him to shoot.\n\n               FULL SHOT -- street -- as Haven surrenders to the sheriff.\n\n<b>                                     SHERIFF\n</b>                         All right, you -- march.\n\n               Haven obeys, walking up the street -- the sheriff and the \n               sheriff's horse behind him. People watch, appearing now in \n               safety. The sheriff is pretty pleased.\n\n               MOVING SHOT -- of Haven and Sheriff. As they go, Haven's \n               hands still aloft.\n\n<b>                                     HAVEN\n</b>                         You loaded your gun for this?\n\n<b>                                     SHERIFF\n</b>                         No -- you did.\n\n               Back of them can now be seen the figures of Mick and Prince \n               and the other gunman, following at a little distance. Going \n               leisurely, now Haven slows his pace so that the sheriff is \n               closer behind him.\n\n<b>                                     SHERIFF\n</b>                         Come on, you! Keep moving!\n\n               Haven suddenly drops to his knees. The sheriff almost walks \n               over him. The sheriff stumbles with an oath. Haven grapples \n               with him. Haven snatches his gun, drags him by a headlock to \n               the horse, flings him aside and then mounts. A second later \n               he is away. Shots RING OUT as Mick and Prince and the gunman \n               shoot. Haven rides on, bent low, out of town. The sheriff \n               hides his bulk in the dust as the bullets fly.\n\n               ANGLE from Charlie's office -- as she goes to the window, \n               stares out at the flying form of Haven. A slow smile comes \n               over her face, bitter and grim, yet somehow faintly \n               admiring... She sees Mick mount a horse and start after Haven. \n               Then she turns abruptly away.\n\n<b>                                                                       WIPE\n</b>\n<b>               EXT. COUNTRY ROAD - DAY\n</b>\n               As Haven slows down his horse, but goes on at a fair clip \n               after looking warily back. He breaks open the sheriff's gun, \n               finds it loaded. He reacts and whistles softly. As he swings \n               his horse off the travelled road to head crosscountry for \n               the sawmill.\n\n<b>                                                                   FADE OUT\n</b>\n<b>               FADE IN\n</b>\n<b>               EXT. NEAR SAWMILL - NIGHT\n</b>\n               As Haven sits on his horse at a point in the woods where he \n               can look down on the sawmill. Around the mill office there \n               seems to be signs of unusual activity. Haven sees Mick Marion \n               going by on the road towards the mill. Mick passes not far \n               away and is riding hard. Haven watches as Mick arrives and \n               Pete can be seen in conference with him. Other men -- too \n               many -- are gathered around. At last Haven dismounts and \n               makes his way carefully on foot towards the warehouse.\n\n<b>               EXT. WOODS IN BACK OF WAREHOUSE\n</b>\n               As Haven leaves his horse in the brush and trees and then \n               approaches the building. He finds a window in back, breaks \n               it with a stone; then waits tensely to see if the sound has \n               attracted any attention, gun in hand now. It doesn't. Haven \n               replaces the gun in his holster, opens the window and crawls \n               inside.\n\n<b>               INT. WAREHOUSE - NIGHT\n</b>\n               Haven surveys the piles of crates, boxes and equipment. He \n               starts his search methodically and swiftly. Suddenly a shaft \n               of light comes from the front doors opened now by two men. \n               Haven shrinks back, drawing his gun. The men start to enter \n               when Pete's voice is heard.\n\n<b>                                     PETE'S VOICE\n</b>                         Where you guys goin'?\n\n<b>                                     MAN\n</b>                         You want them uniforms out, don't \n                         you?\n\n<b>                                     PETE'S VOICE\n</b>                         I'll tell you when.\n\n               The men turn and leave. Haven relaxes. He goes back to work, \n               pulls back a big canvas tarpaulin one of the men had \n               approached, and there before him is revealed the army \n               uniforms, stacked in neat piles. He looks and smiles grimly. \n               Outside is the SOUND of horses and more men arriving. Haven \n               goes slowly around the warehouse now, looking for something. \n               At last he finds it: a can of kerosene. He takes it over to \n               the uniforms, pours it liberally on them. At just this moment \n               a figure appears at the door.\n\n<b>                                     MAN\n</b>                         What you think you're doin'?\n\n               Haven lights a match and tosses it on the soaked bales of \n               uniforms. They blaze up instantly. The man shoots as Haven \n               ducks away.\n\n<b>               EXT. WAREHOUSE - NIGHT\n</b>\n               As the shot RINGS out. Pete and Mick, surrounded by many \n               men, turn swiftly. Flame and smoke emerge from the warehouse. \n               They start swiftly across, drawing guns. The man at the door \n               shoots again into the smoking interior. An answering SHOT \n               from Haven fells him.\n\n<b>               INT. WAREHOUSE - NIGHT\n</b>\n               As Haven makes his way back to the open window. He crawls \n               out swiftly. Now the building is in flames. He can hear \n               shouting and, as he moves away, the useless attempt of men \n               to put out the blaze, working with buckets of water.\n\n<b>               EXT. WAREHOUSE - NIGHT\n</b>\n               As Haven starts for the woods. The flames now light the ground \n               around, and Pete appears around the side of the building. \n               Pete fires and Haven draws and shoots. Pete whirls away, hit \n               but still on his feet, driving forward, trying to shoot again \n               and this time Haven drills him clean and Pete goes down to \n               stay. Other men come up as Haven makes for the woods, \n               disappears.\n\n               Mick Marion and a dozen men appear, shooting. Mick suddenly \n               changes his mind, turns past the body of Pete, gets his horse \n               and heads back to town full tilt.\n\n<b>               INT. WOODS - NIGHT\n</b>\n               As Haven watches the flaming building. The slowly approaching \n               figures of the men are illumined in the big light of the \n               fire. Haven smiles, turns to the horse and moves slowly \n               through the trees to a place where he can mount; then mounts \n               and rides for it, SHOTS following him as he breaks into the \n               clear some hundred yards away and heads for the road that \n               Mick Marion took back to town. Bent low, Haven rides for his \n               life -- and makes it...\n\n<b>                                                                   FADE OUT\n</b>\n<b>               FADE IN\n</b>\n<b>               EXT. ARMY POST - DAWN\n</b>\n               As Haven rides up, a detachment of men supervised by Stellman \n               is forming beside mounts in the parade ground. Haven dismounts \n               and starts inside. He glances at his wagon parked outside. \n               It is the one Mrs. Caslon took from him. He smiles slightly \n               as he notes it.\n\n<b>               INT. ARMY POST - ILES' OFFICES - DAWN\n</b>\n               Haven walks in, brushes past the desk sergeant with a cursory \n               nod and enters Iles' sanctum.\n\n<b>               INT. ILES' OFFICE - DAWN\n</b>\n               As Haven enters. Mrs. Caslon is there, and Iles, in full \n               field uniform. They look at him quickly as he enters; he \n               pauses, glances at Mrs. Caslon and then faces the explosive \n               Iles.\n\n<b>                                     ILES\n</b>                         That's all right. Just barge right \n                         in! I'm going to tell you something...\n\n<b>                                     HAVEN\n</b>                              (abruptly)\n                         No, you're not. You're going to \n                         listen.\n\n               As Iles stares, dumbfounded, at this impertinence:\n\n<b>                                     HAVEN\n</b>                         You lost some uniforms? You thought \n                         they were burned?\n\n<b>                                     ILES\n</b>                         They were.\n\n<b>                                     HAVEN\n</b>                         No, they weren't, but they are now \n                         because I just set fire to them.\n\n<b>                                     ILES\n</b>                              (rising)\n                         What's this?\n\n<b>                                     HAVEN\n</b>                         They're smouldering right now in the \n                         warehouse at the sawmill, and there \n                         are about seventy men down there who \n                         were ready to wear them.\n\n<b>                                     ILES\n</b>                         Wear them? What for?\n\n<b>                                     HAVEN\n</b>                         What other reason? To get in the \n                         post and take the gold from you.\n\n               Iles gawks at him.\n\n<b>                                     HAVEN\n</b>                         You were taking a detachment up north \n                         on an Indian scare?\n\n               Iles nods vaguely.\n\n<b>                                     HAVEN\n</b>                         Well, that scare is a fake. A ruse. \n                         So you know where to send them now.\n\n<b>                                     ILES\n</b>                         Look here, Lieutenant --\n\n<b>                                     HAVEN\n</b>                         Correction.\n\n               Haven dips into a lining pocket under his arm and tosses a \n               paper at Iles. Iles glances at it, then looks, thunderstruck, \n               at Haven.\n\n<b>                                     ILES\n</b>                         Major?\n\n<b>                                     HAVEN\n</b>                         You better get down to that sawmill, \n                         Captain. They may try it anyway.\n\n               ILES' expression slowly changes. He smiles at last.\n\n<b>                                     ILES\n</b>                         I guess I owe you an apology.\n\n<b>                                     HAVEN\n</b>                              (extending his hand)\n                         I'll take it.\n\n               He shakes hands with Iles for second, then Iles goes out \n               abruptly. Outside we can hear abrupt commands to the Sergeant \n               before the door closes. Haven takes out his pipe, looks at \n               the silent, dumb-struck Mrs Caslon. He smiles at her slightly. \n               She gets her voice at last.\n\n<b>                                     MRS. CASLON\n</b>                         I guess I owe you something too.\n\n<b>                                     HAVEN\n</b>                         Only fifty thousand.\n\n               Outside \"To Horse\" is sounding. Haven glances out the window, \n               hardly aware of Mrs Caslon's presence.\n\n<b>                                     MRS. CASLON\n</b>                         I wish there was something I could \n                         say or do.\n\n<b>                                     HAVEN\n</b>                         There is. You can give me back my \n                         gun.\n\n               She goes to the desk, gets it and hands it to him. He takes \n               the gun from his holster and hands it to her.\n\n<b>                                     HAVEN\n</b>                         And you can give this one back to \n                         the sheriff.\n\n               She takes it.\n\n<b>                                     MRS. CASLON\n</b>                         I'll always remember what a fool I \n                         made of myself.\n\n<b>                                     HAVEN\n</b>                              (smiling)\n                         I always try to forget.\n\n               He puts his own gun in holster. Glances out the window.\n\n<b>                                     MRS. CASLON\n</b>                              (watching his face)\n                         Are you going too?\n\n<b>                                     HAVEN\n</b>                         Not with them...\n\n               He pats her shoulder in a gesture of goodbye and walks out \n               the door. She stands watching him, then moves to the window \n               and looks out.\n\n<b>               EXT. POST - DAWN\n</b>\n               As Haven walks outside towards his waiting horse. He pauses, \n               pipe in mouth, lighting the pipe now, his face intensely \n               interested as he watches the men form on the parade ground \n               in front of the mounted Iles and Stellman.\n\n               FULL SHOT of soldiers. As they mount to a brisk command, and \n               the color bearer takes position. Iles barks out a command; \n               the column forms into marching order. On the double quick, \n               the cavalry company starts out and on the way.\n\n               CLOSE SHOT of Haven as he watches; his eyes lighting a little, \n               the pipe in hand. We feel that he'd like to go too in this \n               moment.\n\n               ANOTHER ANGLE from Haven's view, as the column of cavalry \n               departs. Haven waves his hand, a half salute, a half gesture \n               to Iles as Iles salutes him in passing. Then only the dust \n               remains and Haven's gaze lingers. His face changes. It becomes \n               grim. He slowly knocks the ashes from the pipe, pockets it. \n               He slowly mounts the horse. He takes out his gun and checks \n               it. Then slowly he rides away, like a man on a mission he \n               dislikes but cannot evade.\n\n<b>               INT. ILES OFFICE - DAWN\n</b>\n               As Mrs. Caslon looks out the window. Her face, tense, as she \n               watches the lonely figure go; her hand waves slightly.\n\n<b>                                                                   DISSOLVE\n</b>\n<b>               INT. CHARLIE'S OFFICE - DAWN\n</b>\n               Charlie is standing by the desk and window. Prince is sitting \n               there, talking, the inevitable dice in his fingers.\n\n<b>                                     PRINCE\n</b>                         There's seventy men ready for any \n                         kind of play. I say we can still \n                         swing it -- and get out of town.\n\n               THERE is SOUND of massed horses outside and Charlie looks \n               out. Prince walks to the window. They look in silence.\n\n<b>                                     CHARLIE\n</b>                         Can we?\n\n<b>               EXT. STREET - DAWN\n</b>\n               As Iles rides by at full gallop, followed by a troop of \n               cavalry, headed for the sawmill.\n\n<b>               INT. CHARLIE'S OFFICE - DAWN\n</b>\n               As they watch. Prince turns away.\n\n<b>                                     PRINCE\n</b>                         You wanted to give Haven time. Well, \n                         he took it.\n\n<b>                                     CHARLIE\n</b>                         You better get out before he takes \n                         you.\n\n<b>                                     PRINCE\n</b>                         By that I presume you intend to \n                         remain.\n\n<b>                                     CHARLIE\n</b>                              (wistfully)\n                         I've been here as long as I remember.\n\n               Prince crosses to the window and stands looking at Charlie.\n\n<b>                                     PRINCE\n</b>                         I asked you once if Haven moved me \n                         out.\n                              (he smiles)\n                         I think he's moved us both out -- \n                         together.\n\n               Charlie looks at him but does not answer and then she turns \n               to the window, and smiles slightly. Prince follows her gaze \n               to the street. His face is grim.\n\n<b>               EXT. STREET - DAWN\n</b>\n               Haven, mounted, is coming up the street. Slowly and carefully \n               he progresses to the front of the saloon.\n\n<b>               INT. CHARLIE'S OFFICE - DAWN\n</b>\n               As Charlie glances at Prince.\n\n<b>                                     PRINCE\n</b>                              (softly)\n                         This is the way I wanted it... and \n                         when I've finished you will too... \n                         as though Haven had never been here.\n\n               He turns and goes quietly and swiftly from the room. Charlie \n               stands thoughtfully. There is nothing in her look or manner \n               to indicate that what Prince has said has made the slightest \n               impression on her.\n\n<b>               EXT. STREET - DAWN\n</b>\n               As Haven comes up to the saloon door.\n\n<b>               INT. SALOON DAWN\n</b>\n               As Prince moves into a shadowy corner.\n\n               ANGLE ON the door as Haven enters and looks around. He sees \n               no one. The place seems utterly deserted. It is soundless. \n               CAMERA FOLLOWS Haven as he moves slowly. He has replaced the \n               gun, but he is alert.\n\n               ANGLE ON Prince as he watches Haven, now a perfect target, \n               not looking in his direction. Prince raises the gun a little, \n               but the dice in his over hand click ever so faintly.\n\n               SHOT OF Haven as he stops dead in his tracks, hand on the \n               gun again, alert at the slight sound of the dice. Now facing \n               towards the shadow where Prince is hidden. He stands ready \n               and rigid for a long still moment. When there is no further \n               sound or movement, he goes on towards the stairs.\n\n               ANGLE ON Prince as he moves slightly from the shadow as Haven \n               goes to the stairs. Prince is ready to shoot again, but now \n               the angle on Haven up the stairs is no good. He lowers the \n               gun with disgust, then moves softly out of the shadow.\n\n<b>               INT. CHARLIE'S OFFICE - DAWN\n</b>\n               She gets a gun out of the drawer, looks at it, smiles, drops \n               it back into the drawer, moves around the desk and faces the \n               door, composing herself and waiting.\n\n<b>               EXT. CHARLIE'S DOOR\n</b>\n               As Haven pauses, pushes it open. Then walks slowly in.\n\n<b>               INT. CHARLIE'S OFFICE - DAWN\n</b>\n               She is standing with her back to the desk, her fingers tight \n               on the edge of the desk as Haven walks in. He stops and looks \n               around and then at her. There is a slight smile on her face.\n\n<b>                                     CHARLIE\n</b>                         You cause me an awful lot of trouble.\n\n<b>                                     HAVEN\n</b>                         Yeh... but I finally brought you \n                         something.\n\n               He hands her the little derringer she had given to Mark.\n\n<b>                                     HAVEN\n</b>                         You didn't really think Mark would \n                         use it, did you?\n\n<b>                                     CHARLIE\n</b>                         Maybe I just wanted to send you a \n                         gun.\n\n<b>                                     HAVEN\n</b>                              (thoughtfully)\n                         Maybe.\n\n<b>                                     CHARLIE\n</b>                         Isn't it a little late to make any \n                         difference?\n\n<b>                                     HAVEN\n</b>                         It's pretty late.\n\n<b>                                     CHARLIE\n</b>                         Why?\n\n<b>                                     HAVEN\n</b>                         I have to arrest you.\n\n<b>                                     CHARLIE\n</b>                         For what?\n\n<b>                                     HAVEN\n</b>                         Murder.\n\n<b>                                     CHARLIE\n</b>                         I could have killed you from the \n                         window -- but I didn't. And I didn't \n                         kill the two men -- or Goodard.\n\n<b>                                     HAVEN\n</b>                         Who did?\n\n<b>                                     CHARLIE\n</b>                         Maybe Mick -- maybe Prince -- who \n                         knows.\n\n<b>                                     HAVEN\n</b>                         You know.\n\n               She puts the little gun on the desk.\n\n<b>                                     CHARLIE\n</b>                         You'd almost as soon be killed as \n                         arrest me, wouldn't you?\n\n<b>                                     HAVEN\n</b>                         Almost.\n\n<b>                                     CHARLIE\n</b>                         Which are you -- Wells Fargo or Army?\n\n<b>                                     HAVEN\n</b>                         Army.\n\n               He hands her the paper he showed Iles. She just glances at \n               it without touching it. Smiles at him.\n\n<b>                                     CHARLIE\n</b>                         I guess it's my turn to wish you'd \n                         gone to China.\n\n<b>                                     HAVEN\n</b>                         I wish I had too.\n\n<b>                                     CHARLIE\n</b>                              (quietly)\n                         If you still have that gold, and I \n                         think you do, we might make it yet. \n                         You see I believe that every man has \n                         his price.\n\n<b>                                     HAVEN\n</b>                         Some men don't believe that.\n\n<b>                                     CHARLIE\n</b>                         But every woman knows it.\n\n               Her eyes pass him towards the door behind him.\n\n<b>                                     HAVEN\n</b>                         Only there wouldn't be any women on \n                         my jury.\n                              (taking out his pipe)\n                         And that's why you're not as bad off \n                         as you might think... I could find \n                         twelve men who might think you capable \n                         of almost anything -- but I wouldn't \n                         bet they'd vote that way after staring \n                         at you through a trial.\n                              (he notes her eyes go \n                              past him)\n                         Mick is dead for the murders and \n                         Prince can be hung for the rest of \n                         it...\n\n               At the bare rustle of SOUND behind him (and the memory of \n               her eyes going past him) Haven whirls, stopping aside and \n               drawing as he does so. And just as he does so, Prince, in \n               the doorway, fires. Haven shoots so that the shots RING OUT \n               almost simultaneously. Prince topples forward on his knees \n               and then his face. The dice roll out of his unclenched left \n               hand.\n\n               MED. SHOT of Haven and Charlie as their eyes read the dice. \n               Haven puts away the gun. Charlie is still leaning against \n               the desk, but there is a strange look on her face. A thin \n               smile for Haven. Now she sags a little and Haven realizes \n               she has been hit. He starts to her and she turns away towards \n               the couch. He catches her as she sags again, and helps her \n               down gently on the couch.\n\n               ANGLE on couch as Haven kneels beside her. He starts to pull \n               away the top of her dress, but the wound is close to the \n               heart. She shakes her head.\n\n<b>                                     CHARLIE\n</b>                         It's no good...\n\n               Haven knows it. He takes her hand and squeezes it.\n\n<b>                                     HAVEN\n</b>                         I'll get someone --\n\n<b>                                     CHARLIE\n</b>                         Stay here.\n\n               Haven stares grimly at her face. She gives him a faint smile.\n\n<b>                                     CHARLIE\n</b>                         Tell me something...\n\n<b>                                     HAVEN\n</b>                         Sure.\n\n<b>                                     CHARLIE\n</b>                         This gets us all. This doesn't count.\n\n<b>                                     HAVEN\n</b>                              (softly)\n                         No...\n\n<b>                                     CHARLIE\n</b>                         Tell me something -- on the square.\n\n               She holds herself tight a moment; then looks at him again, \n               the faint smile returning.\n\n<b>                                     CHARLIE\n</b>                         Did you ever -- love me?\n\n<b>                                     HAVEN\n</b>                         All the time.\n\n<b>                                     CHARLIE\n</b>                              (a whisper)\n                         Tell it.\n\n<b>                                     HAVEN\n</b>                         From the first night and the first \n                         time of the song. I tried to get \n                         away from it, but every time it came \n                         back. Every time I tried to get it \n                         out of my brain I just pushed it \n                         deeper into my heart. It had to be \n                         either you or me.\n\n<b>                                     CHARLIE\n</b>                         It's all right. I love you...\n                              (as he looks hard at \n                              her)\n                         Well -- say it.\n\n<b>                                     HAVEN\n</b>                              (softly)\n                         I love you.\n\n               She starts to die. He takes her shoulders in his hands as \n               though to kiss her or hold her back to life. Her voice is \n               almost a whisper.\n\n<b>                                     CHARLIE\n</b>                         See you... in China.\n\n               She goes, slumping back. He sits there, pats her shoulder in \n               a familiar absent-minded way, then slowly rises. Grimly, \n               Haven walks out of the room.\n\n               MOVING SHOT as Haven goes down the stairway. The deaf pianist \n               is playing as always.\n\n<b>               INT. HOTEL\n</b>\n               Orville is at his old seat behind the desk. He is playing \n               the last verse of the ballad. Haven enters and crosses to \n               his bag, his face blank and grim. He picks up his bag, turns \n               and walks out, as though not hearing the guitar and the \n               ballad. As he goes into the street --\n\n<b>                                                                   FADE OUT\n</b>\n<b>                                         THE END\n</b>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Station-West.jpg\"/>\n</td><td><h1>Station West</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Frank Fenton\" title=\"Scripts by Frank Fenton\">Frank Fenton</a>  <a href=\"/writer.php?w=Winston Miller\" title=\"Scripts by Winston Miller\">Winston Miller</a>  <a href=\"/writer.php?w=Luke Short\" title=\"Scripts by Luke Short\">Luke Short</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Western\" title=\"Western Scripts\">Western</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Station West Script.html#comments\" title=\"Station West comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:17:22.441820"}