{"title": "Stir of Echoes", "film_link": "/Movie Scripts/Stir of Echoes Script.html", "script_link": "/scripts/Stir-of-Echoes.html", "info_raw": "\n\nStir of Echoes Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  David Koepp  Richard Matheson\nGenres  Thriller  Horror  Mystery\nScript Date : March 1998\nMovie Release Date : September 1999\n\nRead \"Stir of Echoes\" Script\n\n\n", "script": "\n\n\n\n                                      STIR OF ECHOES\n\n\n\n                                        Written by\n\n                                       David Koepp\n\n\n\n                                    Based on the novel\n          \n                                     Richard Matheson\n\n\n                                                        March 26, 1998          \n\n          \n\n          \n          Sometimes within the brain's old\n          ghostly house,\n          I hear, far off, at some forgotten\n          door,\n          A music and an eerie faint carouse\n          And stir of echoes down the\n          creaking floor.\n          \"Chambers of Imagery\"\n          Archibald MacLeish\n          \n\n          \n          In the black, a child HUMS. Gentle WATER sounds.\n\n          FADE IN:\n\n          INT A BATHROOM NIGHT\n          JAKE, a four year old boy, sits in a bathtub. The door to thi\n          bathroom is open and his mother is visible in the background,\n          walking back and forth in the bedroom, getting dressed to go\n          out. The STEREO is blaring in the bedroom, the music echoes\n          off the tile in the tiny bathroom.\n          Jake is playing with a plastic airplane. He answers a\n          question.\n\n          JAKE\n\n          YES\n\n          (PAUSE)\n          Sometimes.\n\n          (PAUSE)\n          With my toys.\n          He looks up, but we're close in on him and can't see who he's\n          looking at.\n          JAKE (cont'd)\n          My... blue sword. No! The one with\n          the gray tape around the middle. That\n          one.\n          He lands the airplane on the water. He giggles.\n          JAKE (coast' d)\n          That's silly.\n          MAGGIE (o.s.)\n          (from the bedroom)\n          Jake? You all right in there?\n\n          JAKE\n          (calling out to the door)\n\n          YES!\n          The airplane takes off again. Jake lowers his voice to a\n          whisper.\n          JAKE (cont'd)\n          What?\n\n          (PAUSE)\n          My daddy, but he doesn't know about it\n          yet.\n          He brings the airplane in for a careful water landing and lets\n          go of it. He looks up.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          2. \n\n          CONTINUED:\n          JAKE (cont' d)\n          Can I ask you a question?\n          He pauses, looks to the door to make sure his mother isn't too\n          close. Moving back now, we see that Jake is all alone in the\n          bathroom, staring at the empty bathtub across from him.\n          JAKE (cont'd)\n          Does it hurt to be dead?\n\n          UNDER THE WATER,\n          the toy airplane sinks and crash lands on the bottom of the\n          tub.\n\n          IN THE BATHROOM,\n          MAGGIE WITZKY, twenty-six or seven, Jake's mom, city girl\n          knows how to take care of herself, pokes her head in the\n          doorway, buttoning up her blouse.\n\n          MAGGIE\n          Who you talkin' to, Jake?\n          He turns to her and whispers.\n\n          JAKE\n          It's a secret.\n\n          CUT TO:\n\n          INT JAKE'S ROOM NIGHT\n          TOM WITZKY, Maggie's age, lean and muscled like somebody who\n          works for a living, lies on Jake's bed next to his son,\n          reading him a story. Jake is nearly asleep.\n\n          TOM\n          Well, I was walking in the night, and\n          I saw nothing scary. For I have never\n          been afraid of anything. Not very. I\n          was deep within the woods when,\n          suddenly, I spied them. I saw a pair\n          of pale green pants with nobody inside\n          them! I wasn't scared. But, yet, I\n          stopped. What could those pants be\n          there for? What could a pair of pants\n          at night be standing in the air for?\n          Maggie leans in the doorway and whispers.\n\n          MAGGIE\n          Is he asleep? My brother's here.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          3. \n\n          CONTINUED:\n          Tom looks at Jake, who is asleep. Tom closes the book, turns\n          off the light, and covers his son. He kisses him on the\n          forehead. Tom goes to a dresser and turns on the baby monitor\n          (the transmitter). Its red light glows.\n          After Tom leaves, Jake opens his eyes and stares.\n\n          CUT TO:\n\n          EXT STREET DAY\n          The Chicago skyline looms over the street they live on. Not\n          the suburbs, but not quite downtown either. Racially mixed.\n          Two story brick houses jammed side by side, barely room for a\n          raised voice across the narrow driveways. Bar on the corner,\n          neon sign -- \"BERNIE'S TAP.\" A HOMELESS GUY rants his way\n          down the opposite sidewalk.\n          Tom, Maggie, and PHILIP, early twenties, come out of the house\n          and head down the steps. Tom carries the baby monitor (the\n          receiver) in one hand. Jake's breathing is clearly audible on\n          the speaker.\n          Tom's on the sidewalk. Maggie, still three steps up, stops\n          and puts her arms wide. Tom turns around and Maggie lets\n          herself go, falling straight forward. Tom catches her on his\n          back and carries her piggy-back. She leans around and bites\n          his ear.\n\n          PHILIP\n          What are the odds of a single woman\n          being at this thing?\n\n          TOM\n          `Bout a million to one.\n\n          PHILIP\n          Any hot mommies?\n\n          TOM\n          Depends. How big you like `em?\n          The hot engine of a Yellow Trans-Am fires up in the driveway\n          of the house across the street. It backs into the street, its\n          passenger door hanging open. The DRIVER honks the horn and a\n          SEVENTEEN YEAR OLD KID runs out of another house and jumps\n          into the moving vehicle. They take off. The Homeless Guy\n          berates them, shaking his fist.\n          They reach the steps of the house next door. PARTY NOISE\n          comes from within, shadows move in the windows. Tom swings\n          Maggie around, puts her on the step, wraps his arms around\n          her, and kisses her. Great kiss. It goes on.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          4. \n\n          CONTINUED:\n\n          PHILIP\n          Excuse me, hello, I enjoy soft-core as\n          much as the next guy, but this is\n          almost like incest for me.\n\n          MAGGIE\n          (still kissing Tom)\n          Should we tell him?\n\n          TOM\n          Sure.\n\n          MAGGIE\n          I'm pregnant.\n\n          PHILIP\n          Get the fuck outta here!\n          He grabs Maggie and hugs her. Tom starts up the steps.\n          PHILIP (cont' d)\n          Look at this, I haven't even had a\n          second date in a year and a half, you\n          guys are on your second kid!\n          Philip catches up to Tom and throws his arms around him.\n          PHILIP (cont' d)\n          You big huggable bear. You're still\n          goin' back to school, though, right?\n          You promised me.\n\n          TOM\n          I don't know, I just found out about\n          this.\n\n          PHILIP\n          I'm telling you, if you never go back\n          to college you'll regret it for the\n          rest of your life. The memories I\n          have of being a freshman -- those were\n          three of the happiest years of my\n          life.\n\n          CUT TO:\n\n          INT BOBBY & VANESSA'S - LIVING ROOM NIGHT\n          TWENTY OR THIRTY PEOPLE are crowded into a living room. It's\n          loud, smoky, there's music and a ton of booze -- empty beer\n          bottles, five gallon jugs of wine, big liter bottles of vodka\n          and gin.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          5. \n\n          CONTINUED:\n          The men are mostly on one side, women on the other. As Maggie\n          heads toward the women, Tom grabs her arm and pulls her back\n          close.\n\n          TOM\n          Seven years, and I've still never been\n          to a party where you weren't the one I\n          wanted to hang with.\n          She smiles, melted, and they part. Tom joins the men. BOBBY,\n          Vanessa's husband, an athletic-looking guy holding a sleeping\n          three-year-old on his shoulder, talks with FRANK McCARTHY,\n          fortyish, big Irish drinker, and HARRY DAMON, who is also\n          older than the rest.\n\n          FRANK\n          Tom-Tom-Tommy, how are ya?\n          He shoves a beer into Tom's hand.\n\n          TOM\n          Alive on the planet.\n          (nods to Harry)\n          Harry.\n\n          HARRY\n          Hello, Tom. Takin' care of the place?\n\n          TOM\n          Actually, I'm drillin' holes in all\n          the floors, Harry.\n\n          FRANK\n          (as Tom drinks)\n          That's it, take the medicine deep into\n          your body. Good, good.\n\n          HARRY\n          So how you likin' the neighborhood?\n\n          TOM\n          Well, I grew up about a mile from\n          here, it ain't like a foreign country.\n\n          FRANK\n          The hell it isn't! This is the best\n          God damn neighborhood in Chicago,\n          `cause we look out for each other, and\n          that's sayin' a lot as we approach the\n          Year of our Lord two thousand.\n\n          HARRY\n          What are you, runnin' for Mayor?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           6. \n\n          CONTINUED: (2)\n          LENNY, the local crank, pipes up.\n\n          LENNY\n          Hey, did any of you guys see those\n          Dominican crack dealers hangin' around\n          the park again?\n          Everybody GROANS.\n\n          FRANK\n          (to Bobby)\n          What is Lenny doing here? Did you\n          tell him you were having a party?!\n\n          BOBBY\n          Vanessa made me.\n\n          LENNY\n          Yeah, laugh it up, laugh it up, and\n          when you all wake up dead with your\n          throats cut some night --\n\n          FRANK\n          I mean, I could see if he just heard\n          the noise and wandered in, but to\n          actually invite him into your home.. .\n\n          LENNY\n          -- don't come cryin' to me!\n\n          ACROSS THE ROOM,\n          Philip surveys the selection of females. He sees VANESSA,\n          late twenties, hasn't lost the weight from the last baby yet --\n\n          PHILIP\n          Not attracted to...\n          -- SHEILA, a thin, nervous woman around Frank's age --\n          PHILIP (cont' d)\n          Not drunk enough for...\n          -- and a LOUD WOMAN with enormous hair.\n          PHILIP (cont' d)\n          Frightened by...\n\n          LATER,\n          everyone has eaten, some have left, the ones that remain are\n          bombed. A DRUNK COUPLE dances dirty. Frank stares long and\n          hard at someone's cleavage.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          7. \n\n          CONTINUED:\n          Sheila, the nervous woman, stares at Frank, pissed off. He\n          looks at her, gives her a \"What?\" gesture. Must be married to\n          each other.\n          Tom, on the other side of the room, hears a SHRIEK of women's\n          voice: and turns. He sees Maggie blushing, receiving hugs and\n          congrLtulations from the two or three women around her.\n\n          IN THE :ITCHEN,\n          Vanessa talks to Maggie while she mixes up a blender of\n          Margaritas. The room is jammed with people.\n\n          VANESSA\n          How did you and Tom meet?\n\n          MAGGIE\n          He saved my life.\n\n          VANESSA\n          No, really.\n\n          MAGGIE\n          I'm serious. The summer I was\n          nineteen, I was at Jones Beach, I swam\n          out too far and got a cramp in my leg.\n          There was no way I was gonna make it\n          back. I was goin' down, I was\n          swallowing water and everything. Tom\n          was a lifeguard. I don't know what he\n          was doing out that far, he said he\n          just had a feeling.\n\n          VANESSA\n          Oh my God, did you have sex with him\n          like, that night?\n\n          MAGGIE\n          Had to. He said I'm his slave until I\n          saved him back.\n\n          VANESSA\n          That's so romantic. Bobby and I met\n          when I peed in the guys' john at a Bon\n          Jovi concert.\n          She hits \"puree\" on the blender.\n\n          STILL LATER,\n          the party's down to the hard-core half dozen, who are passing\n          a joint. Tom sits on the couch, feet on the coffee table next\n          to their baby monitor. Maggie is next to him, Frank and\n          Sheila are jammed in there too.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          8. \n\n          CONTINUED:\n          Bobby and Vanessa sit on the floor opposite. Philip is in a\n          chair at the end.\n\n          VANESSA\n          P(ople who say they were hypnotized\n          weren't really, they were just, you\n          kn)w, playing along.\n\n          PHILIP\n          Then how could they have needles stuck\n          into their throats without bleeding?\n          Without even making a sound?\n\n          FRANK\n          Bullshit.\n\n          VANESSA\n          You never saw that happen.\n\n          PHILIP\n          Uh, hello, I had a two inch needle\n          stuck right into the thick of my arm,\n          by my professor, while I was under\n          hypnosis.\n\n          FRANK\n          Bullshit!\n\n          VANESSA\n          You're making it up!\n\n          BOBBY\n          That's disgusting!\n\n          MAGGIE\n          I saw his arm the next day. It left a\n          mark.\n\n          FRANK\n          Bullshit!\n\n          SHEILA\n          Can you learn another word?\n\n          FRANK\n          Prove it.\n\n          VANESSA\n          Yeah, let's see.\n\n          FRANK\n          Hypnotize somebody. Hypnotize\n          Vanessa.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          CONTINUED: (2)\n\n          VANESSA\n          Oh, no. Uh uh.\n\n          PHILIP\n          Why not?\n\n          VANESSA\n          Because, I .night make a fool out of\n          myself! I n. ;.ght, I don't know, expose\n          myself or sowething.\n          She clutches her arms around her breasts as she says that.\n          You get the feeling she'd like to expose herself.\n\n          PHILIP\n          I thought you didn't believe in it.\n\n          VANESSA\n          I don't, but -- do Maggie.\n\n          MAGGIE\n          Yeah, right.\n\n          FRANK\n          You do it, Sheila. We promise not to\n          make you do a strip tease on the\n          kitchen table.\n          Sheila glares at him. They must be fun to hang out with.\n\n          VANESSA\n          That's what I'd do! That's exactly\n          the kind of thing I'm afraid I'd do!\n\n          MAGGIE\n          Hey Frank, you're the one who's so\n          curious, why don't you-\n\n          FRANK\n          No.\n\n          MAGGIE\n          Ah, that's different. Whaddya got to\n          hide?\n\n          FRANK\n          No fuckin' way, I ain't gonna do it.\n          Tom sits forward.\n\n          TOM\n          What the hell? I'll try anything\n          once.\n\n          \n\n          \n\n          \n\n          \n\n          A MOMENT LATER,\n          a hand switches off the lamp on the table.\n          Another hand turns off the lamp in the corner.\n          The music is turned off.\n          Tom sits in the armchair in the n3arly-darkened room. Philip\n          shoves the coffee table back and sits on it, directly in front\n          of him. The others crowd around expectantly, silent.\n\n          PHILIP\n          No sound.from anyone, please. Any\n          distraction can break it up.\n          He raises his index finger and holds it about a foot in front\n          of Tom's face.\n          PHILIP (cont' d)\n          Okay. Look at it.\n\n          TOM\n          Damn fine lookin' finger.\n          Laughter.\n\n          PHILIP\n\n          (AUTHORITATIVE)\n          Be quiet.\n          (they do)\n          Look at it. Keep looking at it.\n          Don't look at anything else, just my\n          finger.\n\n          TOM\n          Can you clean out the nail, it's kinda\n          makin' me sick here.\n          Philip raises two fingers and jabs Tom in the eyes.\n          TOM (cont' d)\n          Hey, what the fuck?\n\n          PHILIP\n          Shall we try this again?\n\n          TOM\n          (rubbing his eyes)\n          Asshole.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          11. \n\n          CONTINUED:\n\n          PHILIP\n          Look at me, Tom. You're not afraid of\n          this. You want this to happen. Don't\n          you?\n\n          TOM\n          Poke me again you son of a batch and\n          I'll clock you, I swear to Go'..\n\n          MAGGIE\n          Philip, have you ever done this\n          before?\n\n          PHILIP\n          Maggie, please, I nearly have a\n          master's degree in cognitive psy-\n\n          MAGGIE\n          Have you ever done it before?\n\n          PHILIP\n          Well, I've seen it done a dozen times.\n\n          MAGGIE\n          Try not to screw him up permanently.\n\n          PHILIP\n          (to Tom)\n          You want to be hypnotized. Say yes.\n\n          TOM\n          Yeah.\n\n          PHILIP\n          \"I want to be hypnotized.\"\n\n          TOM\n          I want to be fuckin' hypnotized,\n          already.\n\n          PHILIP\n          Okay. Close your eyes.\n          As Tom does, our eyes close too, big heavy lashes dropping\n          over everything and plunging us into blackness.\n          PHILIP (o.s.)\n          Just listen for a moment.\n\n          \n\n          \n\n          \n\n          \n\n          12. \n\n          IN THE BLACK,\n          we can still hear the sounds of the living room. Tom\n          breathes. Ice CLINKS in a glass as someone drinks. A car\n          HUMS by outside.\n          PHILIP (o.s.)\n          Now look at the backs of your eyelids.\n          Do you see anything there?\n          TOM (o.s.)\n          Uh...\n          Out of the pitch black, we can detect tiny images.\n          TOM (o.s.)\n          Some colors... something floating...\n          up.\n          PHILIP (o . s . )\n          Focus on it.\n          A small squiggly line comes into focus, drifting up through\n          the black, then bouncing suddenly downward.\n          PHILIP (o.s.)\n          Now... I want you to pretend you're in\n          a theatre.\n\n          INT THEATRE NIGHT\n          We're sitting in a theatre, a bare stage at the front.\n          PHILIP (o . s . )\n          A movie theatre.\n\n          INT MOVIE THEATRE NIGHT\n          Okay, we're sitting in a movie theatre. It's crowded with\n          people, waiting for the movie to start.\n          PHILIP (o.s.)\n          You're the only one there.\n          The people disappear. The theatre is empty.\n          PHILIP (o . s . )\n          You're sitting near the front.\n          We pop up ten rows closer to the screen.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          13. \n\n          CONTINUED:\n          PHILIP (o . s . )\n          The walls of the theatre are black,\n          covered with black velvet.\n          SHOOOP! Black velvet descends over the walls.\n          PHILIP (o . s . )\n          The seats are covered with black\n          velvet.\n          Black velvet crawls over the seats.\n          PHILIP (o . s . )\n          There is no light in the theatre.\n          The lights click off.\n          PHILIP (o . s . )\n          In the whole pitch-black theatre,\n          there's only one thing you can see.\n          The white screen. You drift toward\n          it, in your chair.\n          Up ahead of us, the screen is a dazzling white. We move\n          slowly toward it, floating over the seats.\n          PHILIP (o . s . )\n          There are letters up on the screen.\n          Tall, thick, black letters, but\n          they're out of focus. You drift\n          closer to them, trying to read them.\n          Blurry black letters appear on the screen. We drift closer.\n          PHILIP (o. s . )\n          You're comfortable in your black\n          velvet seat, very comfortable. You\n          just sit there, looking at the screen,\n          drifting closer in your chair, staring\n          at those letters on the screen.\n          You're relaxing. Your feet and ankles\n          are relaxed. Your legs are relaxed.\n          Your hands are limp and heavy. Your\n          arms are relaxed. Your face. The\n          letters come into focus, you're close\n          enough now, you can read them.\n          The letters are right in front of us now, but still blurry.\n           PHILIP (o . s . )\n          The letters spell --\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           14. \n\n          CONTINUED: (2)\n          The moment he speaks the word, five giant black letters come\n          into focus on the white screen, filling our entire field of\n          vision.\n          PHILIP (o . s . )\n\n          SLEEP.\n          We stare at that word for a moment --\n          -- and then everything goes black. No sound, no image, no\n          nothing. And then...\n\n          INT BOBBY & VANESSA'S LIVING ROOM NIGHT\n          Six faces stare right at us from up close. Tom is in the\n          chair, eyes open, looking disoriented.\n\n          TOM\n          Didn't work, huh?\n          All six faces burst out laughing, a great nervous tension\n          released. Somebody turns the lights back on, somebody else\n          hits the music.\n          TOM (cont' d)\n          What?\n          More laughter. Philip seems very pleased with himself.\n          Maggie comes and sits on the arm of the chair next to Tom,\n          puts her hand on his face.\n\n          MAGGIE\n          Are you okay?\n\n          TOM\n          Did somethin' happen?\n          People start talking, all at once.\n\n          VANESSA\n          You were faking it. You had to be\n          faking it.\n\n          TOM\n          What are you talking about?\n\n          FRANK\n          That was the weirdest thing I've ever\n          seen in my whole fuckin' life.\n\n          PHILIP\n          How do you feel?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          15. \n\n          CONTINUED:\n\n          TOM\n          How am I supposed to feel?\n\n          PHILIP\n          A little.., hot, maybe?\n          EveryboJy laughs again. Tom wipes his forehead. He's covered\n          with sweat. He gets up. He doesn't like this at all, being\n          the only one not in on the joke.\n\n          TOM\n          What'd you do to me?\n\n          PHILIP\n          Nothing much. Just had you stretched\n          out as stiff as a board between those\n          two chairs --\n          He points to two dining room chairs that are sitting back to\n          back four or five feet apart.\n          PHILIP (cont' d)\n          (lighting a lighter)\n          -- and ran this back and forth under\n          your legs.\n          Tom feels the backs of his legs. He looks at Maggie.\n\n          TOM\n          That happened?\n\n          MAGGIE\n          You said it didn't hurt at all. And\n          he kept it moving.\n\n          TOM\n          Hey, thanks a lot, it was very nice of\n          you not to burn my flesh.\n\n          FRANK\n          Joey Ariola woulda burned it.\n          They laugh again. Tom looks at him, stunned.\n\n          TOM\n          Who?\n\n          FRANK\n          The kid who beat you up all the time\n          when you were twelve. You told us all\n          about him. You were cryin' and\n          everything.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           16. \n\n          CONTINUED: (2)\n          Tom seethes, humiliated. Vanessa looks at her watch.\n\n          PHILIP\n          (low, to Vanessa)\n          Don't.\n\n          FRANK\n          Not time yet.\n\n          TOM\n          What?\n\n          FRANK\n\n          (INNOCENTLY)\n          Huh?\n\n          TOM\n          Not time for what?\n\n          MAGGIE\n          Tom, you didn't do anything\n          embarrassing or anything.\n\n          TOM\n          Aright, somebody else go. Come on,\n          let's go, somebody else, right now.\n\n          PHILIP\n          Tom, look --\n\n          TOM\n          Nobody? Well, then I guess the\n          party's over, ain't it?\n          (to Maggie)\n          Let's go. Come on, let's go home.\n\n          PHILIP\n          You're getting a little too worked up\n          about this.\n\n          TOM\n          You know, I don't think so, because\n          I'll tell you something, it's a very\n          nasty feeling to know somebody's been\n          fuckin' around in your head for\n          everybody else's amusement, you know?\n          (lightening up a bit)\n          I mean, Joey Ariola, Christ, I haven't\n          thought about him in maybe ten years,\n          and -- come on, man, somebody else has\n          gotta go. Don't make me be the only-\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           17. \n\n          CONTINUED: (3)\n          On the mantle over the fireplace, a clock CHIMES. Everyone is\n          immediately silent, staring at Tom. He looks at the clock.\n          It's eleven.\n          He lifts his foot, pulls off his shoe --\n          -- and throws it out the window.\n          There is an explosion of laughter.\n\n          PHILIP\n          Why'd you do that, Tom?\n\n          TOM\n          I... have no idea.\n          Even more laughter, now everybody's slapping him on the back.\n          Tom nods, \"yeah, yeah, laugh it up.\"\n\n          PHILIP\n          I couldn't resist.\n          Tom cranks an arm around Philip's neck and pulls him down,\n          choking him. But it's playful, his sense of humor returning.\n\n          TOM\n          Any other surprises you left in my\n          head, you fuckin' dead man, you?\n\n          CUT TO:\n\n          INT TOM & MAGGIE'S HOUSE NIGHT\n          It's dark. Tom and Maggie lie in bed, awake.\n\n          MAGGIE\n          I hope it's a girl, I can't help it.\n          Six brothers, I mean, give me a break.\n          I'm sick of all these balls around the\n          house.\n          He doesn't laugh. She rolls over, strokes his chest with one\n          hand.\n          MAGGIE (cont' d)\n          What's the matter?\n\n          TOM\n          Two kids. I'm only twenty-six. How\n          did this happen?\n          She slides one hand down, under the covers.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          18. \n\n          CONTINUED:\n\n          MAGGIE\n          (imitating him)\n          \"Please, baby, please baby, just this\n          one time, I can't feel anything with\n          one of those on.\"\n\n          TOM\n          No, I now how it happened, I'm just\n          sayin'... You're gonna have to stop\n          work, at least for a while. I'll be\n          workin' Saturdays for at least another\n          year, maybe two.\n\n          MAGGIE\n          You don't have to. We'll get by, we\n          always do.\n          Tom stares at a dark brown water stain on the ceiling.\n\n          TOM\n          How many times I gotta ask Harry to\n          fix that? He said he fixed this place\n          up, so how come the roof leaks every\n          time it rains?\n\n          MAGGIE\n          Relax.\n          Her hand is moving. He twists.\n\n          TOM\n          Maggie, you don't think, I mean, ten,\n          twelve years from now... I don't want\n          you to think I'm gonna be a line man\n          forever, you know, like Frank or\n          somethin'.\n\n          MAGGIE\n          It's a good job. You know how many\n          guys would kill for your job?\n\n          TOM\n          I'm smarter than that, I know I am.\n\n          MAGGIE\n          (kisses his ear)\n          Relax.\n          She's making it hard for him to concentrate.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           19. \n\n          CONTINUED: (2)\n\n          TOM\n          I'm smarter than Philip, Christ, six\n          years in college, he's still got his\n          head up his ass. I just want you to\n          know, this ain't where I plan to stop.\n          She licks his ear. He closes his eyes.\n          TOM (cont' d)\n          All my life, I feel like there's\n          something better inside me, it's\n          trying like hell to get out and it's\n          like x won't let it.\n          She rolls on top of him and whispers.\n\n          MAGGIE\n          Let me help.\n\n          LATER,\n          the clock reads 2:31 a.m. Maggie is asleep, Tom is lying on\n          his back, still awake.\n          He looks over at the clock, agitated. He stares up at the\n          ceiling. He closes his eyes.\n\n          A BARRAGE OF IMAGES\n          races across the back of his eyelids:\n          -- Philip's face, close to his, a finger held in front of him.\n          -- A flame, leaping out from a cigarette lighter.\n          Six more faces, pressed in close to his.\n          Himself, floating in an armchair above an empty movie\n          theatre.\n\n          IN THE BEDROOM,\n          Tom snaps his eyes open. He rolls over onto his side,\n          punching his pillow. He closes his eyes again.\n\n          MORE IMAGES COME,\n          faster this time. We share his point of view:\n          -- A twelve year old boy beats us up in an alley near a\n          dumpster.\n          -- A fourteen year old girl kisses us behind a brick building.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          20. \n\n          CONTINUED:\n          -- A vicious dog sinks its teeth into our calf.\n          -- Maggie, drowning, reaches out to us.\n          The images Increase in speed, a half a dozen flip by so fast\n          they're almcst subliminal -- a car tire, a broken arm, falling\n          into water, breaking window, ham and eggs, a bolt of\n          lightning.\n\n          IN THE BEDROOM,\n          Tom sits up abruptly, shaking his head to clear it.\n\n          TOM\n          .the fuck, man?\n          He puts his hands to the side of his head. It hurts. A lot.\n          Maggie stirs, but doesn't wake up. Tom gets up and walks out.\n          As he passes Jake's room, he does a double take.\n\n          IN JAKE'S ROOM,\n          the four year old is awake. Not just awake, but standing next\n          to his bed, perfectly straight, staring at the open doorway.\n          Tom steps in. He can see by the light of the nightlight.\n\n          TOM\n\n          (WHISPERS)\n          Jake?\n          The little boy doesn't answer. Tom walks slowly over to the\n          boy and squats down in front of him, putting his arms on the\n          boy's shoulders.\n          TOM (cont' d)\n          Are you okay?\n          Jake just looks at Tom, straight into his father's eyes. The\n          boy's face lights up in a wide smile. He reaches out with one\n          hand and rests his fingertips on Tom's forehead.\n\n          JAKE\n          Don't be afraid of it, Daddy.\n          The hell does that mean?\n          But before Tom can respond, Jake turns, climbs back in bed,\n          rolls over to face the wall, and goes back to sleep.\n\n          \n\n          \n\n          \n\n          \n\n          INT BATHROOM NIGHT\n          Tom shakes some Advil into his palm; washes three down with a\n          glass of water. He runs water in the sink, splashes some on\n          his face. He straigltens, looks in the mirror as he wipes his\n          dripping face. He stares at himself for a moment, then\n          summons his nerve and closes his eyes.\n\n          IMMEDIATELY,\n          more images come.\n          -- The front of Tom's own house, from a distance. A MAN IN AN\n          OVERCOAT stands on the porch, waving to us to come in.\n          -- Rough hands attack us, covering our eyes and face.\n          -- A face, close to ours but blurry and distorted, as if seen\n          through dirty, blue-tinted eyeglasses.\n          -- Wooden floorboards as we race down toward them. We hit,\n          hard, and our blood sprays out onto the wood.\n\n          IN THE BATHROOM,\n          Tom's eyes pop open. That was disturbing.\n\n          INT LIVING ROOM NIGHT\n          Tom strides into the living room. Their house is small,\n          crowded with kids' toys and furniture they got for their\n          wedding. Tom paces back and forth, holding his head in his\n          hands. He turns and bolts into the kitchen.\n\n          IN THE KITCHEN,\n          Tom rips the refrigerator open and searches the top shelf. He\n          finds what he's looking for, a large carton of orange juice.\n          He opens a cabinet, takes out a glass and fills it.\n          He upends the glass, drains it in one gulp. Still\n          unsatisfied, he picks up the carton. He drinks the rest.\n          Juice runs down his chin.\n\n          BACK IN THE LIVING ROOM,\n          Tom drops onto the sofa. He sits for a moment, trying to\n          regain himself. His breathing returns to normal. He sits\n          forward, picks up the remote off the coffee table, points it\n          at the TV and turns it on. When he sits back --\n          -- there's a woman sitting next to him.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          22. \n\n          CONTINUED:\n          She's eighteen or nineteen years old, so pale her skin's\n          almost luminous. She's attractive but odd, she wears a\n          billowy black dress with a diamond pattern, bangles up and\n          down each wrist. Her lips are light blue, her eyes red-\n          rimmed. Steam rises softly from her hair and skin; when she\n          speaks, her breath comes out of her mouth in clouds of vapor.\n\n          WOMA I\n          You can kiss me if you want to.\n          Tom bolts to his feet and staggers away from the couch. The\n          woman stares intently at him and says something else, but her\n          words are lost under the rising sound of static on the\n          television.\n\n          TOM\n          What?!\n          She repeats, but he can only see her lips moving, the words\n          are lost under the static. Realizing, Tom turns hurriedly\n          toward the TV and hits the mute switch. When he turns back --\n          -- the woman is gone. He stands in the middle of the room,\n          looking all around him. But he's alone.\n\n          INT BEDROOM NIGHT\n          Tom crawls back into bed and pulls the blankets up tight\n          around him. He's shivering.\n\n          A HAND\n          drops over him and he nearly jumps out of his skin. It's\n          Maggie, rolling over to embrace him in her sleep. He takes\n          her hand in his and lies still, eyes wide open.\n\n          CUT TO:\n\n          INT KITCHEN DAY\n          Morning. Tom and Maggie sit at the kitchen table. From the\n          living room, we can hear a-kids' morning show on the\n          television. Tom is wearing jeans and a phone company uniform\n          shirt. Maggie is staring at him. They keep their voices low.\n\n          MAGGIE\n          What do you mean, like... You mean\n          like a hallucination?\n\n          TOM\n          Maybe. I was awake, I know that.\n          She nods, thinking, no idea how to deal with this.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          23. \n\n          CONTINUED:\n\n          MAGGIE\n          Did you, uh, get her name?\n\n          TOM\n          You know, she didn't menti. -in it.\n\n          MAGGIE\n          You sure you weren't dreami.g?\n\n          TOM\n          Positive. I had this headache like\n          you wouldn't believe, and I was\n          thirsty as hell.\n\n          MAGGIE\n          What should we do? You want to call\n          Philip?\n\n          TOM\n          Yeah, I'll call him. But I don't\n          think he's got a fuckin' clue in life.\n          From the living room, Jake laughs uproariously at something on\n          the TV.\n\n          MAGGIE\n          How about my cousin Elizabeth?\n\n          TOM\n          I don't need brain surgery, I just had\n          a weird thing happen, that's all.\n          Like a hypnosis hangover. One-time\n          deal, don't worry about it.\n\n          MAGGIE\n          Well, if anything like this happens\n          again, we should go talk to Elizabeth.\n\n          TOM\n          Maggie...\n\n          MAGGIE\n          Promise me.\n\n          TOM\n          I promise.\n\n          CUT TO:\n\n          \n\n          \n\n          \n\n          \n\n          EXT HOUSE DAY\n          There's a pickup football game in the street, a half a dozen\n          sixteen and seventeen year olds timing their plays to coincide\n          with the red lights.\n          Tom gets into a pickup truck with a phone compaty logo on the\n          door, starts it up, and pulls forward to the neat house. He\n          hits the horn. While he waits, he turns and loo--s back up at\n          the front of his own house.\n\n          HE REMEMBERS\n          one of the images that blasted through his mind last night.\n          It's his own house, on a wintry day. A man in an overcoat is\n          standing on the porch, waving an arm in a friendly way --\n          \"C'mon in.\" But the image is silent, slow and eerie. We move\n          slowly toward the porch, toward the man in the overcoat.\n\n          BACK IN THE PICKUP,\n          Tom turns slowly away from his house, just as\n\n          THE FOOTBALL\n          BANGS off his windshield, nearly breaking it. TWO BODIES\n          hurtle through the air and land on his hood with a loud metal\n\n          CLANG.\n          Tom jumps a foot. He gets out of the car. ADAM McCARTHY,\n          seventeen, climbs off the hood, embarrassed.\n\n          TOM\n          Jesus, you guys scared the shit out of\n          me!\n          The kid with Adam doesn't seem embarrassed, he just reaches\n          for the football. Tom beats him to it.\n          TOM (cont' d)\n          You gotta play right here in the\n          middle of the street?\n          Frank is out of his house now, approaching the truck. He\n          wears the same uniform shirt as Tom, carries a tool belt over\n          his shoulder.\n\n          FRANK\n          Lighten up, Tommy, you sound like your\n          own grandfather .\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          25. \n\n          CONTINUED:\n\n          TOM\n          (looking at his hood)\n          Aw man, it's dented. This ain't even\n          my truck. They're gonna dock me for\n          this.\n\n          FRANK\n          That'll pop right out. Use one of\n          them plunger things. Adam, say you're\n          sorry.\n\n          ADAM\n          I'm really sorry, Mr. Witzky.\n\n          FRANK\n          There you go, he said he's sorry,\n          whaddya want from a kid. Let's go.\n          Frank gets in the truck. The other football players walk\n          toward Tom, calling for the ball. KURT DAMON, a great-looking\n          seventeen year old, stares pointedly at the ball in Tom's\n          hand. Tom looks at him.\n\n          TOM\n          Hell of an arm ya got there.\n          Kurt smiles and shrugs. Tom tosses the ball back to him.\n          Kurt turns and catches it behind his back as he walks away.\n\n          IN THE TRUCK,\n          Tom gets back in and closes the door.\n\n          FRANK\n          That Damon kid, he's gonna break your\n          old passing records this Friday.\n\n          TOM\n          Bound to happen some time.\n\n          FRANK\n          Comin' to the game?\n\n          TOM\n          (starts the car)\n          Yeah, I'm comin', I'm comin'\n          HARRY (o.s.)\n          Hey, Tom!\n          Tom turns. Harry Damon, the guy from across the street, is\n          headed toward him. But Tom notices something behind Harry. A\n          police car has turned onto the block and is rolling to a stop.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          26. \n\n          CONTINUED:\n          The UNIFORMED COP behind the wheel is staring out the window,\n          looking right at Tom.\n          Harry comes up to the open window and starts talking, but Tom\n          is looking past him, at the Cop, who has stopped now.\n          HARRY (cont' d)\n          Thought I'd stop by and pick up the\n          rent. Save you the trip across the\n          street.\n\n          TOM\n          It's still two days yet, isn't it?\n          Tom looks more closely at the Cop. He realizes the Cop isn't\n          looking at him, he's looking past him, toward Tom's house.\n\n          HARRY\n          Yeah, just thought you'd want to get\n          it out of your hair.\n\n          TOM\n\n          (DISTRACTED)\n          Well, my checkbook's inside.\n\n          HARRY\n          I can wait. Hey, Frank, some game we\n          picked to miss last night, huh? How\n          many yards Adam end up with?\n          Tom turns in his seat, following the Cop's line of vision.\n\n          FRANK\n          Two hundred eleven and two touchdowns.\n          Harry lets out a low whistle. Tom sees what the Cop is\n          looking at so intently -- it's Jake, who's playing on the\n          sidewalk in front of their house while Maggie watches. Tom\n          turns back, but as he does the police car is just pulling\n          away.\n\n          CUT TO:\n\n          INT SIGNAL DIVISION DAY\n          The signal division of the local phone company has a large\n          main floor. A twenty-foot wall on one side of the room shows\n          a forest of jagged, blinking lines.\n\n          IN THE TOWERS,\n          Tom is wedged between giant walls of circuit boards. He pulls\n          a red circuit clip from his belt and picks a line at random.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          27. \n\n          CONTINUED:\n          He pulls up the test handset unit that hangs from'his belt and\n          listens, hoping from a dial tone. Instead, he cuts in on a\n\n          WOMAN'S VOICE.\n          VOICE (o.s.)\n          (on phone line)\n          -which was okay, I guess, but then he\n          told me he loves me, and it was just\n          like, oh my God, can you please make\n          yourself any less attractive?\n          Tom pulls off the clip and picks another line. Now it's a\n\n          SNEAKY MAN'S VOICE.\n          VOICE (o.s.)\n          -unless they find out we already\n          locked in with Cooper at eighty, so\n          it's imperative we lead them to\n          believe we're honestly trying to-,\n          Tom clips to another line. It's a SEXY WOMAN'S VOICE.\n          VOICE (o.s.)\n          -start at my lips and lick your way\n          all the way down to my-\n          Tom starts to unclip, then hesitates, only human. The voice\n          abruptly changes.\n          VOICE (coast' d)\n          Hey, did somebody pick up on your end?\n          Is your wife there?\n          Tom unclips and picks another line. He gets a dial tone. He\n          enters a number on his headset. A SLEEPY VOICE answers.\n\n          TOM\n          Phil, it's Tom. Is there anything\n          else important you said to me last\n          night, while I was under?\n\n          INT PHILIP'S APARTMENT DAY\n          Philip (Maggie'a brother) is still in bed in his apartment.\n          It's a smallish place, one wall is all windows with a lovely\n          view of a factory, its stacks belching black smoke into the\n          air. Philip's hung over. He holds the phone like he resents\n          it.\n\n          PHILIP\n          What time is it?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          28. \n\n          CONTINUED:\n          TOM (o.a.)\n          Quarter after eight. What are you,\n          still in bed?\n\n          PHILIP\n          Quarter after eight? Jesus, Tom, this\n          is barbaric.\n\n          (INTERCUT)\n\n          TOM\n          Other than the shoe thing, what else\n          did you say to me?\n\n          PHILIP\n          Hang on, lemme, I gotta get my\n          bearings here... Who is this again?\n\n          TOM\n          Phil, I gotta get back to work, was\n          there anything else you told me to do\n          after I came out of it?\n\n          PHILIP\n          If you're asking if I gave you a post-\n\n          HYP-\n\n          TOM\n          Post-hypnotic suggestion, I know what\n          it's called, Phil. Did you leave any\n          others behind when you were kickin'\n          your big, clumsy-ass feet around\n          inside my brain?\n\n          PHILIP\n          No.\n\n          TOM\n          Tell me the truth, Phil!\n\n          PHILIP\n          No, I swear! I went out of my way not\n          to, I even added a thing at the end to\n          make sure!\n\n          TOM\n          What thing?\n\n          PHILIP\n          I, I didn't want you to retain any of\n          the experience, you know, I wanted you\n          to have control back, so I made up\n          this thing.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           29. \n\n          CONTINUED: (2)\n\n          TOM\n          What thing?\n\n          PHILIP\n          God, I don't remember, I haven't had\n          caffeine in almost eighteen hours, how\n          am I supposed to-\n\n          TOM\n          In general, what was it?\n\n          PHILIP\n          Well, it was perfectly harmless, I\n          just said, uh, I said \"When you come\n          out from under, your mind will be\n          completely free. There's nothing\n          binding it. Nothing holding it back.\n          You will be completely open.\"\n          Tom stops, thinking for a long moment.\n\n          TOM\n          Yeah, I'd say that about describes it.\n\n          PHILIP\n          Describes what?\n\n          TOM\n          Never mind, it's gone now. I gotta\n          go.\n\n          PHILIP\n          Describes what?\n          But Tom has hung up. Philip unplugs the phone and goes back\n          to sleep.\n\n          CUT TO:\n\n          INT KITCHEN DAY\n          Jake sits at the kitchen table in his pajamas, eating a bowl\n          of cereal. Maggie, in work clothes, is walking back and forth\n          behind him, talking on the phone, finishing her makeup,\n          drinking coffee, and doing the dishes.\n          MAGGIE (o . s . )\n          Hi, Adriana, it's Maggie. Listen, our\n          baby-sitter just backed out on us for\n          next Friday night --\n          Jake turns and looks at the empty chair next to him. He\n          smiles at it. Then he giggles. He covers his mouth.\n\n          (CONTINUED)\n\n          - -\n\n          \n\n          \n\n          \n\n          \n\n          30. \n\n          CONTINUED:\n          MAGGIE (cont' d)\n          -- and there's this game Tom and I\n          really wanted to go to and I was\n          wondering if...\n\n          JAKE\n          (to the chair)\n          I told him.\n          MAGGIE (o.s.)\n          (into phone)\n          Oh. Yeah, I understand. No, no, no,\n          don't worry about it. Okay. Bye.\n          (hangs up)\n          Shit. Shoot. Shoot, I mean.\n          She picks up the phone and dials again. With all she's doing,\n          she doesn't notice that Jake is having a conversation with the\n          empty chair.\n          MAGGIE (cont' d)\n          (into phone)\n          Philip, hi, it's me, call me when you\n          wake up, is there any way --\n\n          JAKE\n          Yes.\n\n          MAGGIE\n          -- you'd consider dumping whatever\n          bimbo you're going out with Friday\n          night and baby-sitting for us instead?\n\n          JAKE\n          Who?\n\n          MAGGIE\n          I'd call mom, but it's a long drive\n          for her and she's not feeling very\n          well again, so... call me as soon as\n          you can, and no, I'm not kidding.\n          (hangs up)\n\n          JAKE\n          Okay.\n\n          MAGGIE\n          Well, that'll happen in about a\n          million years.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           31. \n\n          CONTINUED : (2)\n\n          JAKE\n          (to Maggie)\n          Call Vanessa and ask her about\n          Dorothy.\n          i'aggie stops, looking at him. Jake is calmly eating his\n          câ\u0080¢.real. She looks at her watch.\n\n          MAGGIE\n          Good idea.\n          She picks up the phone and dials a number. Jake just keeps\n          eating. Behind him:\n          MAGGIE (cont' d)\n          Hi, Vanessa, it's Maggie. What's your\n          baby-sitter's name again, Dorothy?\n          Are you gonna use her Friday night?\n          Really? Would you mind if I asked her\n          to sit for us, just this once? Oh,\n          great, thank you so much, you saved my\n          life. What's her number? Uh huh, uh\n          huh. Great, thanks again. Okay.\n          She hangs up and finishes her make-up in her reflection in the\n          toaster.\n          MAGGIE (cont' d)\n          When did you ever meet Dorothy, Jake?\n\n          JAKE\n          Samantha told me.\n\n          MAGGIE\n          (didn't hear that)\n          Oh, I bet you saw her when you were\n          over playing with Jessica the other\n          day, right? She was there then?\n          Jake turns to the empty chair on his left. He looks at it for\n          a moment, then turns back to Maggie.\n\n          JAKE\n          Yes. That's when I met her.\n          He goes back to eating his cereal.\n          A DOORBELL rings.\n\n          CUT TO;\n\n          \n\n          \n\n          \n\n          \n\n          32.\n\n          03/26/!\n\n          INT LIVING ROOM NIGHT\n           Friday night. Tom\n           the porch, about fif answers the front door. A GIRL stands on\n           teen years old, heavyish wearing a ti , ht\n           pair -3f blue jean s an d a brown leather j\n          neck. A dull zipped u to g the\n          strea1. of butt yellow ribbon runs through a her Chair likepa\n           er.\n\n          DOROTHY\n           I'm Dorothy. Muller.\n           Tom Witzky.TOM\n          She shakes his hand limply and steps\n           inside, just to the side\n          of the door, looking down.\n          Tom stares at her,\n           longer than is Maggie comes\n          forward with the baby\n           Y monitor and takes ove r, leading Dorothy\n          into the room.\n\n           MAGGIE\n          Hi,\n           Dorothy, thanks for coming,\n          remem ber me? I'm Maggie, we met over\n           at Vanessa's once or twice. Okay,\n           Jake's asleep already and he hardly\n          ever wakes up, a band\n          could play in\n           his room and he wouldn 't hear it, so\n\n           YOU\n           Shouldn't have any trouble with\n           him a t all. His room is right\n           up at\n           the top of the.\n           As she goes on, showing Dorothy aroundexplaining where they'll be se and\n           where he is, staring. and so forththe , Tom stands rooted\n           At Doroth yâ\u0080¢ A strange BUZZING sound\n          grows in his ears. He just watchest\n           , h leads\n           back into the living w room, showing nhers\n          remotes work , that thesTV the\n           sort of thing.\n          sneaks a look up at Tom, then g. Feeling his stare, Dorothy\n          staring down quickly averts her gaze again,\n           at the carpet, Th e buzzing fades.\n           dj ,\n           no later tï¿½nGmidnioht' q if that s\n           okay with you.\n\n           DOROTHY\n           It's okay.\n\n           MAGGIE\n           Great! Let me just grab my coat\n           we' re out of here. and\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           33. \n\n          CONTINUED:\n          She runs upstairs. Tom is still\n           standing where he was.\n          Dorothy sits on\n           the sofa, hands in the pockets of her jacket,\n          which is still zi pped up to the neck.\n\n          TOM\n          'Whir don't you, uh... why don't you\n          mak%- yourself comfortable. Take off\n          your coat.\n          Without looking at him,\n          Dorothy obediently unzips her jacket\n          and takes it off. Her b reasts are fuller than one would\n          expect at her age. She l ooks up at Tom, and now there's\n          defiance in her eyes. Wh at are you lookin' at?\n           TOM (cont' d)\n           Excuse me.\n           He goes upstairs.\n\n          INT BATHROOM NIGHT\n           In the bathroom, Tom drinks\n           a glass of water quickly, then\n           shakes three or four Advil in to his palm. In the mirror, he\n           notices Maggie, staring at him from the doorway.\n\n          TOM\n          Where did you find Dorothy?\n\n          MAGGIE\n          Vanessa recommended her. She's used\n          her before, she said she's real\n          reliable.\n          Tom nods.\n          (cont' d)\n          Are you...\n          She's looking at the Advil. He smiles, faking it.\n\n          TOM\n          Too much caffeine, that's all.\n          He pops them in his mouth and swallows them dry.\n          TOM (cont'd)\n          Let's qo,\n\n          INT LIVING ROOM NIGHT\n           Tom and Maggie step\n           back into the living room and head for the\n           front door. The mom ent Tom lays eyes on Dorothy, the BUZZING\n           sound returns, loude r this time.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          34. \n\n          CONTINUED:\n          It drowns out Maggie's voice as she gives Dorothy last minute\n          instructions and says goodbye.\n          Tom reaches the open doorway and glances back inside. Dorothy\n          is looking at him as he swings the door shut.\n          EXT FRONT PORCH NIf :HT\n          The buzzing stops the momen% the door is shut. Tom and Maggie\n          go down the steps. Tom lookz back over his shoulder, at the\n          house, in time to see Dorothy's face, peering out between the\n          blinds at them.\n          She releases the blinds and they snap back into place.\n\n          CUT TO:\n\n          BUSY STREET NIGHT\n          Tom and Maggie walk down a crowded sidewalk with Frank and\n          Sheila, from next door.\n\n          FRANK\n          (to Tom)\n          Don't get me wrong, it's great what\n          the Damon kid is doin' and everything,\n          I mean, I'm sorry your record's\n          gettin' broke, but, what, it held up\n          almost ten years?\n          Tom is terribly distracted, looking back over his shoulder,\n          still plagued with a headache.\n\n          TOM\n          Yeah, `bout that.\n          They round a corner. Just ahead, a high school football field\n          is surrounded by bright lights, mobbed with STUDENTS and\n          PARENTS. A BAND plays on the field, it's just about time for\n          kickoff.\n\n          FRANK\n          (raising his voice over the\n\n          CROWD)\n          So you got that, that's great. What\n          I'm sayin', though, is this year it's\n          all Kurt Damon this and Kurt Damon\n          that, and yeah, the kid has an arm,\n          but high school football is running\n          the ball -- smash-mouth, in-your-face,\n          power football. Always been that way.\n          Tom glances up at a mercury-vapor streetlight as they pass\n          under it.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          35. \n\n          CONTINUED:\n          The same BUZZING sound, the one he heard when he first looked\n          at Dorothy, comes back now, seeming to come from the street\n          light. Tom shakes it off.\n          FRANK (cost' d)\n          Now Adam, and I admit, L am biased,\n          but my kid is having ona hell of a\n          season and it's like nol.-)dy noticed.\n          If they'd just give him he carries he\n          could break a thousand yards. And on\n          an eight game schedule!\n          He pulls out a pint bottle of schnapps and has a bump, offers\n          one to Tom, who declines. A SEXY TEENAGE GIRL walks past.\n          Frank notices. Carefully.\n\n          BEHIND THEM,\n          Sheila and Maggie walk together. Sheila stares at Frank as he\n          ogles the teenager.\n\n          SHEILA\n          Look at him. Why doesn't he just lick\n          them when they walk by?\n\n          MAGGIE\n\n          (LAUGHS)\n          According to Tom, the average guy\n          carries around a hard-on two and a\n          half hours out of every day. What are\n          you gonna do?\n\n          SHEILA\n\n          (DARKLY)\n          I've got a few ideas.\n          A MIDDLE-AGED WOMAN walks past and Frank gives her the big\n          crank-around.\n          SHEILA (cont' d)\n          Look at that! He's not even picky. I\n          swear to God, that man will stick it\n          in a bowl of soup if it's still warm..\n          Maggie notices Tom, up ahead, with a hand to his temple. She\n          catches up.\n\n          MAGGIE\n          Are you okay?\n          He forces a smile. They head into a crowded tunnel that leads\n          into the stadium.\n\n          \n\n          \n\n          \n\n          \n\n          36. \n\n          IN THE TUNNEL,\n          Frank raises his voice still higher. It becomes a horrible\n          drone to Tom.\n\n          FRANK\n          Six eighty-three with three game.-\n          left, he only needs to average, ti.iat,\n          a hundred and five, hundred and six\n          yards a game? He hits a thousand and\n          we're talkin' major scholarships, the\n          kid could write his own ticket. That\n          kinda thing's good for everybody,\n          helps the whole neighborhood. He's\n          goin' a hell of a lot farther than I\n          ever did. Look at the quality of the\n          tail he's already gettin'. He passed\n          me in that department when he was\n          about fourteen.\n          He passes Tom the bottle. This time, he takes a swig.\n\n          EXT FOOTBALL FIELD NIGHT\n          They come through the tunnel and into the stands. Below, the\n          field is brightly lit. Frank's voice is, thankfully, drowned\n          out by the enthusiasm of the crowd.\n          They make their way to the first open seats in the bleachers\n          and sit down. The crowd is delirious with anticipation, and a\n          bit loaded -- there's a lot of schnapps in that crowd, and\n          beers snuck in here and there. And that's the grown-ups.\n\n          ON THE FIELD,\n          the visitors kick off.\n\n          IN THE STANDS,\n          the crowd ROARS. Tom tries to concentrate on the game, but\n          he's totally distracted. He looks to the right, drawn by a\n          flash of light.\n          A car is pulling into the parking lot at the end of the field\n          with its high beams on. Tom stares at the lights. The\n          BUZZING sound comes back, louder the longer he stares.\n          The crowd ROARS its approval of something. Tom turns back,\n          tries to follow the game. He wipes sweat from his forehead.\n          Maggie is staring at him. She takes his hand and leans over,\n          SHOUTING into his ear.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          37. \n\n          CONTINUED:\n\n          MAGGIE\n\n          WHAT'S WRONG?\n          As Tom turns to her, his eye is drawn by something just over\n          her head.\n          A GIANT LIGHT STANCHION towers over them. When Tom s\\ares\n          directly into the dozen large globes, the BUZZING souni\n          overwhelms him, nearly deafening. His hands shoot up to his\n          ears --\n          -- and he leaps to his feet.\n\n          TOM\n          Sf\"S TAXING BIM AWWAY!\n\n          MAGGIE\n\n          WHAT?!\n          Tom fights his way out of the row, climbing right over people.\n          They SHOUT their objections.\n\n          INT TUNNEL NIGHT\n          Tom races down the now-empty tunnel. A light shines at the\n          far end, BUZZING madly. A few seconds later, Maggie starts\n          into the tunnel.\n\n          MAGGIE\n          Tom, wait!\n\n          EXT BUSY STREET NIGHT\n          Tom bursts out onto the busy sidewalk, threading his way\n          between PEOPLE and cars as fast as he can. Maggie follows a\n          few moments later.\n\n          EXT OUR BLOCK NIGHT\n          Tom races around the corner and onto his block. He bolts\n          across the street, forcing a car to lock `em up at the last\n          second. The Driver SHOUTS: Tom keeps running.\n          He reaches the sidewalk just in front of his house and stops\n          in his tracks, staring at the house, wild-eyed.\n          All the lights are off.\n\n          TOM\n          Oh, no.\n          He bounds up the steps and tries the door. It's locked. He\n          fumbles in his pockets for the keys.\n\n          \n\n          \n\n          \n\n          \n\n          INT LIVING ROOM NIGHT\n          Tom unlocks the door and bursts inside.\n\n          TOM\n          Jake?!\n          No answer. He races up the stairs.\n\n          INT JAKE'S ROOM NIGHT\n          Tom SMACKS open the door to Jake's room and flicks on the\n          lights. In Jake's bed, the covers are pulled back, the sheets\n          are rumpled.\n          But Jake Js gone.\n          Tom races out. Still staring at that empty bed, we can hear\n          other doors in the house being thrown open, lights being\n          switched on, and Tom's outraged voice calling out for his son.\n\n          EXT STREET NIGHT\n          Maggie comes hurrying up the steps of the porch just as the\n          front door flies open.\n\n          MAGGIE\n          What the hell is the-\n\n          TOM\n          She took him.\n\n          MAGGIE\n          What?!\n\n          TOM\n\n          SHE TOOK HIM, HE'S NOT THERE, SHE TOOK\n\n          HIM SOMEPLACE!\n\n          MAGGIE\n          Oh, my God!\n          She bounds up the steps, calling out for Jake.\n\n          TOM\n          She can't be that far!\n          He runs to the corner, desperate, and looks up and down the\n          street in both directions. There are a lot of people out, she\n          could be anywhere.\n\n          \n\n          \n\n          \n\n          \n\n          39. \n\n          CONTINUED:\n          He turns, looks up and down the side street. Nothing in the\n          first direction, but when he looks the other way, he hears a\n          faint BUZZING sound in the distance. He doesn't hesitate,\n          just takes off toward it.\n\n          TWO BLOCKS AHEAD,\n          Tom is running as hard as he can. He stops, abruptly. The\n          buzzing sound is gone. He looks to his right. Behind a wall,\n          there is a large parking lot filled with buses.\n          He turns around. A dull white glow comes from the windows of\n          the place on the corner. He looks up, at the sign.\n          It's a Greyhound bus station.\n          Tom hurries back toward it, reaching the door just as Maggie\n          comes running up from the opposite direction.\n\n          TOM\n          Wait right here, keep your eyes open!\n          He opens the door and goes inside.\n\n          INT BUS STATION NIGHT\n          Tom steps into the station, still breathing hard. The BUZZING\n          sound returns. But from where? Is it in his mind this time,\n          or really here, in the bus station?\n          The place is empty except for one person, sitting on a wooden\n          bench with their back to him, near the departure doors. Tom\n          walks slowly across the place to the figure. It's Dorothy.\n          As he draws closer, he sees Jake's face, over Dorothy's\n          shoulder. Jake's eyes are open, and he's staring up at the\n          ceiling.\n          Tom follows his son's gaze. Jake is staring up at the lights,\n          the old-style fluorescent tubes that give the place its\n          cancerous look. The tubes BUZZ loudly. It's the sound Tom's\n          been hearing.\n          Jake sees his father and smiles. Tom puts a finger to his\n          lips -- \"Shhhh.\" Jake yawns, closes his eyes, and drops his\n          head onto Dorothy's shoulder. He goes back to sleep.\n          Tom walks slowly around the end of the bench. Dorothy is\n          SINGING softly, an old nursery rhyme.\n          She looks up suddenly and sees Tom. She starts to jerk to her\n          feet. Tom puts a hand out -- take it easy. Dorothy sits\n          back, caught. Tom steps closer to her, carefully. He holds\n          both his hands out, palms up.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          40. \n\n          CONTINUED:\n\n          TOM\n          Give him to me.\n          She shakes her head no. Outside, a SIREN WHINES and a police\n          car flashes past the window, its red lights spinning. They\n          both hear it and glance over, then look back at each other.\n          Tom raises an eyebrow. She knows what he means.\n          TOM (cont'd)\n          Give him to me, Dorothy.\n          Trembling, Dorothy reaches out, Jake in her arms. Tom gently\n          takes the boy from her and holds him tight.\n          The front door flies open and Maggie races inside. Tom gives\n          Jake over to her.\n\n          JAKE\n          (half asleep)\n          Oh, hi, Mommy.\n          She's relieved, but livid.\n\n          MAGGIE\n          (to Dorothy)\n          What the hell is the matter with you?!\n          Dorothy jumps to her feet and races through the door that\n          leads to the back, where the buses leave from.\n\n          TOM\n          (to Maggie)\n          Take him home! I'll be there as soon\n          as I can!\n          He runs after Dorothy.\n\n          EXT PARKING LOT NIGHT\n          Dorothy races out of the bus station and into the forest of\n          parked buses. Tom comes out a few seconds later, giving\n          chase.\n          Dorothy cuts between two parked buses --\n          -- and is nearly hit by a third that's just arriving. Its\n          horn BLARES as she trips and falls to the ground, the bus just\n          missing as it ROARS past her.\n          Tom reaches her. Dorothy writhes on the ground, sobbing,\n          raking her hands through the gravel, hysterical.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          CONTINUED:\n\n          TOM\n          Sit up. Sit up, I want to talk to\n          you.\n          She manages to drag herself into a sitting position. She\n          shoves back, against the wheel of a bus. Beyond them, the bus\n          that nearly hit her stops on the far side of the lot.\n          Dorothy is quivering, still crying. Tom squats in front of\n          her, a few feet away.\n          TOM (cant' d)\n          Why were you taking my son?\n\n          DOROTHY\n          Go away.\n\n          TOM\n          Do you want me to call the police?\n          (shakes her head no)\n          Then tell me why you took him.\n\n          DOROTHY\n          He isn't safe in your house.\n\n          TOM\n          Why do you say that?\n\n          DOROTHY\n          He told me! He told me so!\n          The DRIVER of the bus that nearly hit her is out of his bus\n          now. He SHOUTS at them from the other side of the lot.\n\n          TOM\n          Jake said that?\n          (she nods)\n          What else did he say?\n\n          DOROTHY\n          Nothing. I was sitting there, I was\n          watching him sleep, I was just\n          watching him, like I'm supposed to,\n          and... and he sat up in bed, he looked\n          right at me, and he said \"I'm not safe\n          in this house.\" Two times, he said\n          it, and then he went back to sleep.\n\n          TOM\n          Where were you taking him?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           42. \n\n          CONTINUED: (2)\n\n          DOROTHY\n          California. To my father's house. My\n          real father, not --\n          (like poison on her tongue)\n          -- Duane. Jake would be safe at my\n          father's house, we'd both be safe\n          there.\n\n          TOM\n          You too?\n          (she nods)\n          Why aren't you safe here?\n          She doesn't answer. The Driver is coming over to them, still\n\n          SHOUTING.\n          TOM (cont' d)\n          Dorothy? Dorothy, why aren't you safe\n          here?\n          The Driver is still closer. Frightened, Dorothy gets up, to\n          run again. Tom grabs her.\n          TOM (coat' d)\n          Hey, wait a sec-\n          As his hands close around her arms --\n\n          AN IMAGE\n          flashes through his mind. A MAN'S FACE, sweaty and unshaven,\n          leers over us, too close.\n\n          IN THE PARKING LOT,\n          Tom abruptly pulls back from Dorothy. He is enraged.\n\n          TOM\n          Who is he?!\n          She just looks at him, frightened. He shakes her, violently.\n          TOM (cont' d)\n\n          WHO IS HE?!\n\n          CUT TO:\n\n          INT DOROTHY'S HOUSE NIGHT\n          DUANE, fortyish, slouches on a sofa, watching Moe hit Curly\n          with a rake. Duane's drinking bourbon. In his defense, he is\n          using a glass. Duane's face is the one Tom just saw in the\n          image in his mind.\n\n          (CONTINUED)\n          d16 - - ï¿½ --- .. - - A86i -\n\n          \n\n          \n\n          \n\n          \n\n          43. \n\n          CONTINUED:\n          Duane hears the front door open and close.\n\n          DUANE\n          You're early. Your mom's still at\n          work. Hey, do you know if she bought\n          any more who the fuck are you?\n          Tom is storming across the room toward him.\n          DUANE (cant' d)\n          Hey hey hey hey HEY!\n          Tom already has Duane by the collar. He wrenches him to his\n          feet.\n          DUANE (cont' d)\n\n          WHAT THE FUCK DO YOU THINK YOU'RE\n\n          DOIN'?!\n\n          TOM\n          Are you Duane?\n\n          DUANE\n          Who?! I don't even know who you're-\n          Duane looks over Tom's shoulder. Dorothy is standing in the\n          doorway, frightened.\n          DUANE (cont' d)\n          Dorothy, who the fuck is this guy?!\n          Tom hurls Duane across the coffee table, knocking over Duane's\n          bong. Duane hits the floor hard. He starts fumbling in his\n          pocket, but Tom is on him, ripping him to his feet again.\n\n          TOM\n          She's a little girl, you son of a\n          bitch! She' s fifteen years old, and\n          you fucked her!? What the hell is the\n          matter with you?! YOU DON'T DO SHIT\n\n          LIKE THAT TO PEOPLE WHO CAN'T DEFEND\n\n          THEMSELVES!\n\n          DUANE\n          Look, man, I don't know who you are or\n          what she told you, but-\n          Tom hurls Duane across the room. He SMASHES into a bookcase,\n          breaking the glass shelves and knocking a bunch of pictures\n          and knickknacks to the ground. Duane SCREAMS, tries to roll\n          away to escape Tom, but Tom picks him up by the back of his\n          collar and his belt, like a dog.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           44. \n\n          CONTINUED: (2)\n\n          TOM\n\n          GET OUT!\n          He hurls Duane toward the stairs. Duane CRUNCHES down hard.\n          Before he can get up, Tom hauls him to his feet and hurls him\n          furthe: up. He's kicking Duane's ass up the stairs.\n          At the +,)ttom, Dorothy watches, her hands over her mouth.\n          She's thrilled.\n\n          AT THE TOP OF THE STAIRS,\n          Duane lands, a few feet ahead of Tom. This time he's got a\n          second or two, and he manages to dig the butterfly knife he\n          was groping for out of his pocket.\n          He whips it around, opening it, but Tom is fast and crazy with\n          rage, he just grabs the thing by the blade and rips it away\n          from Duane. Blood flows over Tom's knuckles as he tightens\n          his grip on the knife. He twists it around, holding it by the\n          butt. There's madness in Tom's eyes.\n\n          TOM\n          (wielding the knife)\n          You got ten minutes. Pack your shit.\n          You don't leave a note, you don't try\n          to call, and if you ever, ever come\n          back here again, I'll know, I'll find\n          you, and I'll stick this so far into\n          you they'll never get it out. You got\n          it?\n          Duane nods, terrified.\n\n          DOWN IN THE LIVING ROOM,\n          Dorothy sits on her hands at the edge of the sofa, waiting\n          nervously. Tom comes down the stairs. He folds the knife,\n          uncertainly, never handled one of these things before. He\n          shoves it in his pocket.\n\n          TOM\n          I'll stay until he's gone.\n          Upstairs, dresser drawers SLAM, Duane CURSES. He's packing.\n          TOM (cont' d)\n          Shouldn't be long.\n\n          DOROTHY\n          You're bleeding.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          45. \n\n          CONTINUED:\n          She hurries into the kitchen. Tom looks around, at the mess\n          he's made. He's embarrassed, frightened by his own rage.\n          Dorothy comes back with a dish towel. She takes Tom's hand,\n          wipes the blood away and wraps the towel around it.\n          DOROTHY (cont' d)\n          Than : you.\n          He starts to pick up the things that were knocked off the\n          bookcase.\n\n          TOM\n          Tell your mother I'll pay for this.\n\n          DOROTHY\n          It's okay.\n          He picks up a framed photograph. Broken glass falls out of\n          the frame as he turns it over. Tom freezes.\n          DOROTHY (cont'd)\n          What's the matter?\n          Tom just stares at the picture.\n          DOROTHY (cont' d)\n          What?\n          Tom turns the picture around to show Dorothy. The woman in\n          the picture is about eighteen or nineteen, bears a faint\n          resemblance to Dorothy --\n          -- and is the same woman he saw in his living room.\n          DOROTHY (coast' d)\n          Yeah?\n\n          TOM\n          Who is this woman?\n\n          DOROTHY\n          My sister.\n\n          TOM\n          Did she have a black dress, kind of a\n          diamond pattern on it?\n\n          DOROTHY\n          Yeah.\n\n          \n\n          \n\n          \n\n          \n\n           46. \n\n          CONTINUED: (2)\n\n          TOM\n          She wore a lot of bracelets, those\n          thick ones, different colors, all up\n          and down her arms?\n\n          DOROTHY\n          Yeah, all t2;+ time, she probably still\n          does. How d., you know that?\n          Upstairs, there is a tremendous SLAM as a closet door closes\n          and Duane SHOUTS.\n           DUANE (o.s.)\n\n          CRAZY MOTHERFUCKERS IN A CRAZY FUCKING\n\n          HOUSE!\n\n          TOM\n          Where is she?\n\n          DOROTHY\n          I don't know.\n\n          TOM\n          Can I talk to her?\n\n          DOROTHY\n          No.\n\n          TOM\n          Why not?\n\n          DOROTHY\n          She ran away. About six months ago.\n\n          TOM\n          Where did she go?\n\n          DOROTHY\n          I don't know! She don't write or\n          nothin'.\n          Tom looks down at the photograph again.\n\n          TOM\n          What's your sister's name, Dorothy?\n\n          DOROTHY\n          Samantha.\n\n          CUT TO:\n\n          \n\n          \n\n          \n\n          \n          INT TOM i MAGGIE'S HOUSE NIGHT\n          The red light glows on the baby monitor, and Jake's breathing\n          can be heard from in his bedroom. Tom and Maggie sit on the\n          couch in their living room, the nonitor beside them, just one\n          light on. He has his arms arounc' her, holding her tight. His\n          hand is bandaged. They're shaker..\n\n          MAGGIE\n          Samantha?\n\n          TOM\n          That's what she said.\n\n          MAGGIE\n          Where have I heard that name before?\n\n          TOM\n          Dorothy said she ran away about six\n          months ago.\n\n          MAGGIE\n          But she could still be around! Hiding\n          or something. I mean, she could have\n          actually been here when you saw her!\n\n          TOM\n          If she was, she's very quick getting\n          in and out of a room.\n\n          MAGGIE\n          Where was she? When you saw her,\n          where was she exactly?\n\n          TOM\n          On the cushion right next to you.\n          Maggie looks down at the empty half of the couch, freaked out.\n          She pulls in closer to him.\n\n          MAGGIE\n          What was it like? At the game, I\n          mean, how did you know about Jake?\n          Did you see anything?\n\n          TOM\n          It's hard to explain. I just got this\n          -- feeling.\n\n          MAGGIE\n          Like when I was drowning?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          48. \n\n          CONTINUED:\n\n          TOM\n          A little bit. But a hundred times\n          stronger.\n\n          MAGGIE\n          Does it hurt when it happens?\n\n          TOM\n          Like you wouldn't believe. Fecls like\n          my brain is tearing in half.\n\n          MAGGIE\n          God, Tommy, what's the matter with\n          you?\n\n          TOM\n          Why do you assume it's bad? Maybe\n          this is a good thing.\n\n          MAGGIE\n          If your brain is tearing in half?\n\n          TOM\n          I told you there was somethin' in me.\n          Maybe it's comin' out.\n\n          MAGGIE\n          I like it better in.\n\n          TOM\n          Just roll with it. What's the worst\n          that can happen?\n\n          MAGGIE\n          You'll go insane. Kill yourself.\n          Kill me and Jake first.\n\n          TOM\n          Well, yeah, that...\n\n          MAGGIE\n          I want you to go see my cousin\n          Elizabeth. Make sure there's nothing\n          wrong. Just tell her about the\n          headaches, that's all she needs to\n          know, you don't have to bring up the\n          other stuff.\n          Suddenly, he smiles.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           49. \n\n          CONTINUED: (2)\n\n          TOM\n          Hey, know what?\n          (she looks at him)\n          It is a girl.\n          She furrows her brow, \"how do you know?\", then follows his\n          gaze down to her belly, where his hand is resting.\n\n          L UT TO :\n\n          INT HOSPITAL CORRIDOR DAY\n          Tom, dressed in a patient's gown, walks down a hospital\n          corridor with DR. ELIZABETH NOONAN, fortyish. Elizabeth makes\n          notes on a clipboard, walking and talking fast, all business.\n          Elizabeth does not have the human touch.\n\n          ELIZABETH\n          Do you have any metal plates in your\n          skull?\n\n          TOM\n\n          ELIZABETH\n\n          TOM\n\n          ELIZABETH\n          Any shrapnel lodged anywhere in your\n          body?\n\n          TOM\n          No.\n\n          ELIZABETH\n          No cardiac pacemaker, I assume -- iron\n          filings near your eyes?\n\n          TOM\n          Huh?\n\n          ELIZABETH\n          You don't work with sheet metal, do\n          you?\n\n          TOM\n          No.\n\n          ELIZABETH\n          Left here.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          50. \n\n          CONTINUED:\n          They turn down another corridor.\n          ELIZABETH (cont' d)\n          Do you have an inner ear transplant?\n\n          TOM\n          No.\n\n          ELIZABETH\n          Aneurism clips in your brain?\n\n          TOM\n          No thanks.\n\n          ELIZABETH\n          Do you suffer from claustrophobia?\n\n          TOM\n          Only in, like, really small spaces.\n          (she looks at him, straight\n\n          FACED)\n          You have a great sense of humor.\n\n          ELIZABETH\n          Right, then jog left.\n          They do.\n\n          TOM\n          Do we really gotta do this?\n\n          ELIZABETH\n          You've had no head trauma, no serious\n          viral infections you can recall, you\n          haven't been out of the country,\n          you're not a drug user, you have no\n          history of migraines... I suppose I\n          could open up your skull in the\n          operating room and then decide what to\n          do, but I'd rather take a few pictures\n          first, wouldn't you?\n          She pushes through a set of double doors.\n\n          INT MRI ROOM DAY\n          The MRI machine is a long tunnel with a body slab sticking out\n          obscenely, like a tongue. TWO NURSES stand on either side of\n          it. One wall of the room is glass, behind the glass are the\n          TECHNICIANS -- and Maggie, who waves supportively.\n          Tom swallows.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          51. \n\n          CONTINUED:\n\n          TOM\n          How's it work?\n          Elizabeth goes to a computer terminal and types in some\n          commands.\n\n          ELIZABETH\n          It creates an electromagnetic field\n          thirty thousand times stronger than\n          the earth's. That stimulates your\n          brain's protons to align themselves.\n          Then we shoot radio waves into you,\n          which knocks the protons out of\n          alignment. They then realign\n          themselves, sending out radio signals\n          we record on the scanner. The\n          computer reads the signals and makes a\n          series of detailed cross-sections of\n          the layers of tissue.\n          Tom looks at the machine, then back at her.\n\n          TOM\n          Can I have another Valium?\n\n          A FEW MINUTES LATER,\n          Tom lies down on the \"tongue.\" The Nurses wrap sheets around\n          his arms and tuck them in under his body, immobilizing them.\n          He looks at one of them questioningly.\n\n          NURSE\n          So your arms don't touch the sides of\n          the machine.\n\n          TOM\n          That would be bad?\n          She smiles and nods. The other Nurse puts a white cloth over\n          his hair.\n\n          NURSE 2\n          Your party hat.\n          He tries to smile, but he is unnerved. Elizabeth leans in,\n          staring down at Tom.\n\n          ELIZABETH\n          It's so nice you and Maggie finally\n          came to see me at work.\n\n          \n\n          \n\n          \n\n          \n\n          IN THE CONTROL ROOM,\n          a Technician hits a series of switches.\n\n          IN THE MRI ROOM,\n          the tongue starts to move, sliding into the tunnel. Tom lies\n          still, staring upward as he is pulled inside, like a corpse in\n          a drawer sliding back into the wall of the morgue.\n\n          INSIDE THE MACHINE,\n          it's only about two feet across, and less from top to bottom.\n          Tom blinks, staring up at the ceiling as the tongue comes to a\n          stop. It's incredibly claustrophobic.\n\n          TOM\n          Kinda hot in the coffin.\n          ELIZABETH'S VOICE comes blaring out of speakers mounted on\n          either side of the tunnel.\n\n          ELIZABETH\n\n          YES, IT USUALLY IS AT FIRST, BUT IT\n\n          COOLS DOWN ONCE THE HAMMERS START\n\n          MOVING.\n\n          TOM\n          Yo, hey, hey, woah, I'm right here.\n          Can you turn it down a little bit?\n\n          ELIZABETH\n\n          NO, YOU'LL WANT IT LOUD. WE'RE\n\n          STARTING NOW.\n\n          IN THE CONTROL ROOM,\n          Elizabeth leans back from a microphone and turns to a\n          Technician.\n\n          ELIZABETH\n          Go ahead.\n          The Technician enters some commands on a keyboard.\n\n          IN THE MRI ROOM,\n          the giant \"hammers\" that are contained in the cylinders that\n          surround the tunnel start to move, slowly at first.\n\n          IN THE CONTROL ROOM,\n          Elizabeth turns to Maggie.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          53. \n\n          CONTINUED:\n\n          ELIZABETH\n          Did he bring any music?\n\n          MAGGIE\n          Yeah, right here.\n          She hands him a cassette. Elizabeth puts it into a tape deck\n          and pushes \"play.\"\n\n          IN THE MRI ROOM,\n          the hammers pick up speed, and these things move. It gets\n          noisy fast.\n\n          IN THE TUNNEL,\n          Tom's eyes widen. The hammers whip faster. Their POUNDING is\n          tremendous. Tom's music starts playing from the speakers.\n          It's The Doors, \"People Are Strange.\"\n          The hammers whip faster. Elizabeth was right, it's good the\n          music is loud, because the sound coming from the hammers is\n          deafening, like gunshots going off all around his head.\n\n          ELIZABETH\n\n          TRY TO RELAX. THIS'LL ONLY TAKE AN\n\n          HOUR OR SO.\n          Tom, in spite of himself, bursts out laughing.\n\n          IN THE CONTROL ROOM,\n          they can hear the thundering hammers, the blaring music, and\n          above it all, Tom's crazy kind of laughter.\n          Elizabeth looks at Maggie.\n\n          CUT TO:\n\n          INT CONTROL ROOM DAY\n          Three electronic screens, two red and one whitish-blue,\n          display various cross-sections of Tom's brain. Graphs and\n          columns of numbers are listed alongside.\n\n          ELIZABETH\n          No tumors, no growths, no scars or\n          lesions, no intrusions or damaged\n          tissue of any kind. Except for one\n          tiny abnormality, your brain anatomy\n          is textbook. Physically, anyway.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          54. \n\n          CONTINUED:\n\n          MAGGIE\n          What abnormality?\n\n          ELIZABETH\n          Well, it's so insignificant it's\n          hardly worth mentioning.\n          She leans forward to one of the screens and points to a spot\n          on a cross-section.\n          ELIZABETH (cont' d)\n          It's the parietal lobe. Here.\n          There's a slight distension, just the\n          tiniest bulge here in the arc of the\n          crescent. That's uncommon.\n\n          MAGGIE\n          How uncommon?\n\n          ELIZABETH\n          One in a half million, maybe, it\n          doesn't really have a name. But it\n          isn't consequential. Wouldn't have\n          any effect on cognitive processes.\n\n          TOM\n          Great. There's nothing wrong with me,\n          I gotta get back to work.\n          (stands and shakes hands)\n          Thank you for everything, Elizabeth, I\n          owe you a giant one, hey, you think I\n          can get some of that Valium to go?\n          Elizabeth scowls at him.\n          TOM (cont' d)\n          Worth a try. Take care, say hi to\n          Michael.\n          (to Maggie)\n          I'll pick up Jake, I told him I'd take\n          him to the Pier tonight.\n          He heads for the door, eager to get the hell out of there.\n          Maggie lingers, looking at Elizabeth, hopeful.\n\n          MAGGIE\n          There's really nothing wrong with him?\n          Nothing at all?\n\n          ELIZABETH\n          Maggie. I said nothing physical.\n\n          CUT TO:\n\n          \n\n          \n\n          \n\n          \n\n          INT BEDROOM DAY\n          Maggie is in the bedroom, cleaning up. She picks up Tom's\n          pair of jeans from the floor and folds them over one arm.\n          Something THUNKS to the floor. She picks it up.\n          It's the butterfly knife, the one he took from Duane. She\n          stares at it, fascinated and frightened. She lets it drop\n          open. There is dried blood on the blade.\n          Gingerly, she closes it again. She opens a drawer and puts it\n          in, then thinks better of that. She takes it out again, looks\n          for a place to put it.\n          She drops it in her purse and zips it shut. She'll deal with\n          it later.\n\n          CUT TO:\n\n          EXT NAVY PIER NIGHT\n          Navy Pier is an amusement park/shopping mall built on a pier\n          jutting out into Lake Michigan. It's a nice night, the pier\n          is crowded, just enough urban edge to be interesting. A\n          figure bobs along above the crowd -- Jake, sitting on Tom's\n          shoulders. They stop and join a CROWD watching a JUGGLER, a\n          good one, keeps five burning pins in the air.\n          Jake suddenly looks up, confused by something. He stares past\n          the juggler, through the flames. Behind the juggler, a\n          UNIFORMED COP is staring at the little boy -- it's the same\n          Cop who was parked outside their house earlier. Jake stares\n          back, the flaming pins flying up between them.\n          Tom moves on, his boy still on his shoulders. The Cop turns\n          and watches them go. Jake turns, looking back over his\n          shoulder at the Cop. The Cop raises a hand and waves. Jake\n          just stares.\n\n          AT A TOY STORE,\n          there is an elaborate model train set on display in the\n          window.\n\n          JAKE\n          Daddy, look!\n\n          TOM\n          Woah, check it out.\n          He stops, helps Jake down off his shoulders. Jake presses\n          right up against the glass, staring at the train as it circles\n          the track. Tom squats, admiring it with him.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          56. \n\n          CONTINUED:\n\n          BEHIND THEM,\n          the Cop is still watching them. He walks closer, stops only\n          about ten feet away, staring. Tom glances up, sees him,\n          thinks nothing of it.\n          The 'op steps closer.\n\n          IN THE. WINDOW,\n          Tom sees the reflection of the Cop. Closer now, staring. Tom\n          turns and smiles, tight-lipped. He recognizes him from the\n          other day. The Cop smiles back, doesn't go away.\n\n          TOM\n          (to Jake)\n          Hey, look at that one!\n          He carries Jake to the next window over, a different display.\n          The Cop wanders closer. Tom finally turns to him, tense.\n          TOM (cont' d)\n          How ya doin'?\n\n          COP\n          Fine, fine.\n          He's staring at Jake.\n\n          TOM\n          Is there a law against lookin' in the\n          window now?\n\n          COP\n          Huh? Oh, no, `course not. I'm\n          off duty. I live right up there.\n\n          TOM\n          That's great. See ya later.\n          He sweeps Jake up onto one hip and starts to walk away.\n\n          COP\n          It's even stronger in him than it is\n          in you.\n          Tom stops. Turns back.\n\n          TOM\n          What?\n          The Cop smiles and makes a face -- \"you heard me.\"\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          57. \n\n          CONTINUED:\n          TOM (cont' d)\n          I don't know what you're talking\n          about.\n\n          COP\n          Jon't be afraid of it.\n          Tom just star .s at the Cop, trembling slightly. The Cop walks\n          forward. Fascinated, Tom does not back away. The Cop lowers\n          his voice.\n          COP (cont' d)\n          You're not alone.\n          Tom is too rattled to speak.\n          COP (cont' d)\n          You don't know about Cacophony yet?\n          Tom shakes his head no. The Cop pulls out a note pad,\n          scribbles something on a page, tears it out and holds it out\n          to Tom.\n          COP (cont' d)\n          Come next time.\n          His hand shaking, Tom accepts the paper. The Cop reaches out\n          and tousles Jake's hair.\n          COP (coast' d)\n          Bye, Jake.\n          The Cop turns and walks away.\n\n          JAKE\n          Bye, Neil!\n          The Cop looks back over his shoulder and smiles. Tom looks at\n          his son as if he's never seen him before.\n\n          CUT TO:\n\n          INT JAKE'S ROOM NIGHT\n          Jake, fresh from a bath and in his pajamas, sits on the floor\n          of his room, playing with model cars, intent. He's HUMMING a\n          soft tune to himself, the same one he hummed during his bath\n          in the opening.\n          Tom and Maggie sit near him, staring at him. They're freaked\n          out. What have they got on their hands here? Their tone is\n          soft, gently probing.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          58. \n\n          CONTINUED:\n\n          MAGGIE\n          Jake, do you remember the other day\n          when we were talking in the kitchen?\n          Jake doesn't look up, just keeps playing and HUMMING.\n          MAGGIE (cont' d)\n          I was loo3.ing for a baby-sitter,\n          remember?\n          (Jake plays)\n          And you said \"Samantha\" told you about\n          Dorothy. Do you remember that?\n          He keeps playing, HUMMING.\n\n          TOM\n          Jake? Mommy's asking you a question.\n          Nothing.\n\n          MAGGIE\n          Is Samantha someone who talks to you\n          sometimes, Jake?\n          No answer. She tries a different route.\n          MAGGIE (cont'd)\n          Can you remember any of the things\n          that Saman-\n          Jake looks up sharply.\n\n          JAKE\n          Don't ask the boy any more questions.\n          They freeze, staring at him. His tone was odd. And did he\n          just refer to himself in the third person?\n          JAKE (cant' d)\n          Talk to me.\n          He goes back to playing, and to that little tune. It's\n          becoming rather haunting.\n          Maggie and Tom look at each other. Good God.\n\n          CUT TO:\n\n          INT BEDROOM NIGHT\n          Nighttime. Tom and Maggie are asleep in bed. Suddenly, Tom's\n          eyes pop open.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          59. \n\n          CONTINUED:\n\n          TOM\n          She's downstairs.\n          He sits up. His head is killing him again. There's a glass\n          of water on the night table. le grabs it and drinks greedily.\n          He turns and looks to the open -loorway. He swallows.\n          He stands up. He looks down at Maggie, who's still sound\n          asleep.\n          He walks to the door.\n          Maggie stirs, feeling him gone.\n\n          INT HALLWAY NIGHT\n          Tom walks down the narrow hallway, toward the staircase at the\n          far end. He's scared.\n          He starts down the stairs. Halfway down, he dares a look\n          through the wooden posts that support the handrail.\n          Samantha is standing in the middle of the room.\n          She looks up at him. For a long moment, they just stare at\n          each other. Steam rises lightly from her as she breathes.\n          Tom is shaking, barely finds his voice.\n\n          TOM\n          Samantha?\n          She speaks, but when her voice comes out it's horrible and\n          distorted -- muffled in a strange way.\n          He takes a few trembling steps down the stairs, closer to her.\n          She walks forward a step or two. She speaks again, louder,\n          but the voice is still unintelligible and bizarre.\n          Tom reaches the bottom of the stairs. She reaches out a hand.\n          He stares, terrified. The hand draws closer.\n          Almost beyond his own control, Tom raises his own hand.\n          She comes closer.\n          Tom is frozen at the bottom of the stairs. Their hands draw\n          closer still.\n          Their fingertips touch.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          60. \n\n          CONTINUED:\n          Tom GASPS, as if something very heavy were put down on his\n          chest. His mouth drops open, his chest twitches. He can't\n          breathe.\n          They stand there, frozen in that position. Tom tries, but\n          can't draw air.\n          MAGGIE'S VOICE calls out from the top ci the stairs.\n\n          MAGGIE\n          Tom?\n          He can't answer. He's panicked, but unable to move. With\n          every twitch of his chest clouds of steam burst from his\n          mouth, all the air going out, none coming in.\n          From the top of the stairs, Maggie can see him, standing\n          there, hand outstretched into the darkness, touching nothing.\n          But from Tom's point of view, he's touching fingertips with\n          Samantha. He's frozen, breathless, and now his cheeks start\n          to turn pale, unnaturally white. Another few seconds of this\n          and he'll pass out.\n          MAGGIE (con t' d)\n          Tom!?\n          She races down the stairs.\n          MAGGIE (cont' d)\n\n          TOM?!\n          Tom can't look at her, can't move. A tear rolls down his\n          cheek as his lips begin to turn blue.\n          MAGGIE (cont' d)\n          TOM, BR. ATfHE!\n          She grabs hold of him. As soon as Maggie makes contact, Tom\n          collapses. He sees Samantha break away from him with a SHRIEK\n          of irritation. She moves, not quite walking, but a herky-\n          jerky kind of lateral movement toward the dining room, fast,\n          like someone on a dozen espressos, an angry thing that has to\n          slow itself down to a crawl just to talk to us.\n          In the dining room, she flops over onto the floor, like a\n          reflection appearing suddenly on the surface of a pond. Into\n          the floor, she disappears.\n          Maggie grabs Tom's face and turns it toward her. He takes a\n          big lungful of air.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           61. \n\n          CONTINUED: (2)\n          MAGGIE (cont' d)\n          Was she here?!\n          Tom nods, sucking air greedily.\n          MAGGIE (cont'd)\n          Why?!\n\n          TOM\n          I think we better find out.\n\n          CUT TO:\n\n          EXT OUR BLOCK DAY\n          It's a street party, and it's jammed. Police barricades are\n          at both ends of the block. Half barrels of beer sit in big\n          plastic garbage cans, ice dumped over them. Everyone seems to\n          have agreed on which radio station to listen to, and most of\n          the couple dozen cars parked in the driveways have their\n          radios tuned to it, loud, the windows hanging open.\n          Outside Bernie's Tap, the bar on the corner, a DOZEN DRUNK\n          GUYS are running pass patterns out the front door, cutting\n          left at the mailbox, and catching a football thrown from\n          inside the bar, out an open window. Well, they don't actually\n          catch the ball...\n\n          AT ONE OF THE TAPS,\n          the Homeless Guy we've seen on the street a few times is\n          drinking right out of one of the beer taps while nobody is\n          watching. Lenny, the local crank we met before, is outraged.\n\n          LENNY\n\n          HEY, GET THE HELL AWAY FROM THERE!\n          He chases him off, trying to kick him in the ass but spilling\n          his own beer in the process.\n          LENNY (cont' d)\n          (to no one in particular)\n          You see what I'm talkin' about?! You\n          see what I mean?!\n\n          ON A FRONT YARD,\n          Jake plays with a couple other NEIGHBORHOOD KIDS.\n\n          AT ANOTHER KEG,\n          Frank is giving a lurid lesson on the proper way to pump the\n          keg to two ATTRACTIVE YOUNG WOMEN. Tom joins him.\n\n          (CONTINUED)\n          - - .Err- r - - - - ab a. ter. s\n\n          \n\n          \n\n          \n\n          \n\n          62. \n\n          CONTINUED:\n\n          TOM\n          You know you're under surveillance\n          here.\n          He gestures to Sheila, Frank's wife, who's about ten feet\n          away, keeping an angry eye on him.\n\n          FRANK\n          What can I do? Nature commands me to\n          spread my seed. I hear and obey.\n\n          TOM\n          Sure, great, just don't be surprised\n          if some day Sheila digs out your 38\n          and buries a slug or two in your ass.\n\n          FRANK\n          Please. The woman can't even step on\n          a spider.\n\n          TOM\n          Spider doesn't fuck around on her.\n\n          A SHORT DISTANCE AWAY,\n          Sheila is talking to Maggie, disgusted with Frank.\n\n          SHEILA\n          They change, Maggie. Ten or so years\n          of marriage, a kid or two -- they\n          become a different human being.\n\n          MAGGIE\n          Sheila, if you're so miserable, why\n          don't you leave? Adam's almost out of\n          school, he can handle it.\n\n          SHEILA\n          Oh, Frank would love that. No. I\n          want him out. I like that house.\n\n          MAGGIE\n          How long have you guys been there?\n\n          SHEILA\n          Almost fifteen years.\n\n          MAGGIE\n          So... you know most of the people\n          around here pretty well, right?\n\n          \n\n          \n\n          \n\n          \n\n          IN FRONT OF BERNIE'S TAP,\n          somebody actually manages to catch one of the passes coming\n          from out of the bar and is immediately tackled by three\n          drunks. On the pavement. Ouch.\n\n          IN THE CROWD,\n          Tom is now talking to Harry Damon.\n\n          HARRY\n          But, you know, what am I gonna do, I'm\n          a single father with a son to support,\n          I can' t just say fuck everything. So\n          I scraped together enough money to\n          make a few downpayments, and here I\n          am. A landlord, for Christ's sake.\n\n          TOM\n          So you've been in this neighborhood a\n          long time, right?\n\n          MAGGIE\n          is questioning Sheila.\n\n          MAGGIE\n          Did you ever hear of a girl named\n          Samantha Muller?\n\n          SHEILA\n\n          (THINKS)\n          From over by Baldwin?\n\n          MAGGIE\n          I think so.\n\n          SHEILA\n          Yeah, kinda, name rings a bell.\n\n          HARRY DAMON,\n          in response to the same question from Tom, calls over to his\n          son Kurt, the good-looking football player, who is leaning\n          against the front of his yellow Trans-Am, talking to a couple\n          other guys.\n\n          HARRY\n          Hey, Kurt, you remember that Muller\n          girl?\n          (to Tom)\n          Like he ever tells me anything.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          64. \n\n          CONTINUED:\n          The music coming from the car is too loud, Kurt can't hear.\n          HARRY (cont' d)\n\n          (SHOUTING)\n\n          DO YOU REMEMBER THE -- COME OVER HERE !\n          He gestures. Kurt drags himself off the hood and saunters\n          over.\n          HARRY (cont' d)\n          Do you remember that Muller girl?\n\n          KURT\n          What, Dorothy?\n          He makes a \"big breasts\" gesture.\n\n          HARRY\n          No, the other one. Samantha.\n          Lenny, the crank, joins the conversation.\n\n          LENNY\n          You mean the retard? She ran away.\n\n          HARRY\n          She did?\n\n          SHEILA\n          is on the same subject.\n\n          SHEILA\n          She was always hanging around the\n          guys, you know, she wanted to be with\n          the \"in\" clique and everything. There\n          wasn't much chance of that.\n\n          HARRY DAMON,\n          asks Tom a question.\n\n          HARRY\n          Why you wanna know about her?\n\n          TOM\n          Oh, Dorothy baby-sits for us sometimes\n          and she started talking about her\n          sister, wonderin' how she was doing\n          and stuff. I promised her I'd ask\n          around, see if anybody'd heard\n          anything from her.\n\n          (CONTINUED)\n          - - - Ambb. - - - - - Nft - & a r-\n\n          \n\n          \n\n          \n\n          \n\n          65. \n\n          CONTINUED:\n\n          LENNY\n          She took off back in March, I think,\n          with some black guy.\n\n          TOM\n          )id she ever live in that house we're\n          .n?\n          Frank comes up, one arm around his son Adam.\n\n          FRANK\n          Who?\n\n          HARRY\n          No. You're the first tenants since I\n          bought it.\n\n          LENNY\n          (to Harry)\n          Harry, I saw those Dominicans back in\n          the park again. By the basketball\n          courts?\n\n          HARRY\n          What do you want me to do about it,\n          Lenny?\n\n          LENNY\n          We could go talk to `em. Scare `em\n          off, if there were enough of us.\n\n          FRANK\n          Yeah, Lenny, they're gonna be\n          terrified of you.\n\n          SHEILA\n          keeps talking to Maggie.\n\n          SHEILA\n          She was a pretty girl, but real shy.\n          Pretty simple. She had these crazy\n          ideas she could be an actress, you\n          know. She thought she was gonna be a\n          big movie star. I mean, there was no\n          way, but you couldn't tell her that.\n          I thought it was kind of sad.\n\n          FRANK AND ADAM\n          have joined Tom and the others.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          66. \n\n          CONTINUED:\n\n          FRANK\n          (to Tom)\n          Two one one.\n\n          TOM\n          Okay.\n\n          FRANK\n\n          211.\n\n          TOM\n          Got it.\n\n          FRANK\n          Two hundred eleven.\n\n          TOM\n          I give up, Frank.\n\n          FRANK\n          (puts his son in a hammerlock)\n          Two hundred and eleven yards rushing\n          the other night. That makes eight\n          ninety-four with two games to play,\n          kid needs a hundred and six, that's\n          only fifty-three a game. He could\n          walk through the rest of the season\n          and hit a thousand.\n\n          ADAM\n          (pulling free)\n          Dad...\n          Behind them, the guys playing football out of Bernie's Tap\n          have now organized a full-fledged game of tackle in the\n          street, over the objections of their wives and girlfriends,\n          who shout at them to stop.\n\n          FRANK\n          I embarrass him. Are there worse\n          things that can happen to a human\n          being?\n\n          TOM\n          Hey, Adam, way to go, man.\n\n          ADAM\n\n          (SHYLY)\n          Thanks.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           67. \n\n          CONTINUED: (2)\n\n          TOM\n          (to Harry)\n          Well, if you hear anything about her,\n          lemme know, okay?\n\n          FRAZ. X\n          About who?\n\n          HARRY\n          Tom's askin' about that Muller girl\n          from over by Baldwin, you know, the\n          one that ran away?\n\n          LENNY\n          The retard.\n\n          FRANK\n          Jesus, Lenny, don't use that word.\n\n          LENNY\n          What, retard?\n\n          FRANK\n\n          (SARCASTIC)\n          No, \"the.\"\n\n          TOM\n          She was almost your age, Adam. You\n          know anything about her?\n          Adam doesn't answer right away. They all look at him.\n\n          FINALLY:\n\n          ADAM\n          Huh uh.\n          Suddenly, the guys playing football run a play right through\n          the middle of them -- sweaty, middle-aged bodies fly in every\n          direction. Everybody SHOUTS and lunges backward, protecting\n          their beers. The conversation is broken up.\n          But the football players are upset, and a fight breaks out.\n          The crowd gets out of the way, half to watch the fight with\n          glee, the other half to shake their heads and watch the fight.\n\n          OVER AT KURT'S CAR,\n          while the fight goes on in the background, Adam wanders away\n          from the group and sits down on the hood of Kurt Damon's car.\n          He's rattled. Kurt notices him and comes over. He sits next\n          to him.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          68. \n\n          CONTINUED:\n\n          KURT\n          You okay?\n\n          ADAM\n          Yeah.\n          (Kurt is looking atIhim:\n          I'm fine.\n\n          KURT\n          You don't look fine.\n\n          ADAM\n          Really, Mom? How do I look?\n\n          KURT\n          (hands up in surrender)\n          All right, all right. Just, if\n          there's, you know, if there's\n          somethin' you wanna bullshit about or\n          anything, just let me know. Might\n          help.\n\n          ADAM\n          You could climb off my back, that'd\n          help.\n          Adam walks away.\n\n          KURT\n          Sorry.\n\n          AT THE END OF THE BLOCK,\n          two police cars arrive, their lights flashing. COPS jump out\n          and wade through the crowd to bust up the fight. So much for\n          the party.\n          Sheila shakes her head.\n\n          SHEILA\n          It can't ever just be nice. Someone's\n          always got to ruin it.\n\n          CUT TO:\n\n          EXT ROOFTOP NIGHT\n          Nighttime. The city lights are on. The sound of SOBBING\n          rises faintly over them. We're on the roof of a house, and a\n          figure with its back to us is doing the crying. The figure\n          drinks from a bottle. A long, hard pull.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          69. \n\n          CONTINUED:\n          Coming around thefrontwe see the figure is Adam McCarthy,\n          Frank and Sheila'sson,sitting on the roof of his house,\n          staring out at thecityand getting quietly shit-faced.\n\n          CUT TO:\n\n          INT BE. ROOM DAY\n          Tom pries his eyes open, exhausted. Sunlight streams through\n          the window, right into his face. He squints, looks at the\n          clock. It's 10:26.\n\n          TOM\n          Oh, man...\n          He sits up, painfully. A beam of sunlight cuts him right\n          across the eyes.\n\n          A MINUTE LATER,\n          Tom pulls his jeans on. He sits on a chair, puts on a shoe.\n          But the other one's gone. He feels under the chair. Not\n          there.\n          He opens the closet door. Not there.\n          He looks under the bed. There it is. He grabs it.\n\n          INT BATHROOM DAY\n          A note is taped to the bathroom mirror -- \"WENT TO THE PARK\n\n          WITH JAKE. M.\"\n          Tom takes it down and reads it.\n\n          INT LIVING ROOM DAY\n          Tom comes downstairs and heads for the kitchen. There's\n          someone standing in his living room, in the doorway from the\n          dining room. It's Frank, his neighbor from next door, wearing\n          a red shirt. Frank is staring at the floor.\n\n          TOM\n          Frank? What are you doing here?\n          Frank looks up at him. His face is sad.\n\n          FRANK\n          They're going to kill you, Tommy. You\n          and Maggie both.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          70. \n\n          CONTINUED:\n          Frank turns and walks to the front door. He opens it, walks\n          outside, and sits on the top step of the porch, looking out at\n          the street.\n          Tom follows him.\n\n          EXT FRONT PORCH DAY\n          It's a beautiful day, but the street is still kind of a m..ss\n          from the party yesterday. Tom comes out and looks down at\n          Frank, who's just sitting there, staring out at the litter.\n\n          TOM\n          Why did you say that, Frank?\n\n          FRANK\n          (in his own world)\n          This is a decent neighborhood.\n          On the street, TWO KIDS ride their bikes straight at each\n          other, full tilt, SCREAMING. At the last second, one of the\n          kids swerves, the other taunts him with cries of \"Chicken!\"\n          A bird swoops over Tom's head, too low, and Tom flinches. He\n          walks across the driveway, toward Frank's house. The MAILMAN\n          waves to him, headed down the block. Tom waves back.\n          Tom walks up the steps to Frank's front door and knocks. A\n          VOICE calls from inside.\n          ADAM (o.s.)\n          Come in!\n\n          INT FRANK'S HOUSE DAY\n          Tom opens the door and comes in. Adam, Frank's son, is\n          standing in the middle of the living room floor, a big smile\n          on his face and one arm behind his back.\n\n          ADAM\n          Hi!\n\n          TOM\n          Hi.\n\n          ADAM\n          Want to see what I've got?\n\n          TOM\n          Sure.\n          Adam pulls his arm around from behind his back. He's holding\n          a 38 with a carved white handle.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          71. \n\n          CONTINUED:\n          TOM (cont' d)\n          Is that your dad's?\n\n          ADAM\n          Not today. Come here:\n          Tom walks toward him.\n          ADAM (cont' d)\n          Closer.\n          Tom walks closer. He's right in front of Adam.\n          ADAM (cont' d)\n          I bet you never saw this before.\n          He points the gun barrel at Tom --\n          -- then swings it around and points it at his own heart.\n\n          TOM\n          Oh, don't do that.\n          Adam pulls the trigger.\n          Tom SCREAMS as Adam collapses to the floor, blood pouring from\n           his chest. His body convulses --\n\n          INT BEDROOM DAY\n          -- and Tom's eyes pop open, in bed. That was weird.\n          Tom blinks, exhausted. Sunlight streams through the window,\n          right into his face. He squints, looks at the clock. It's\n\n          10:26.\n\n          TOM\n          Oh, man...\n          He sits up, painfully. A beam of sunlight cuts him right\n          across the eyes.\n\n          A MINUTE LATER,\n          Tom pulls on a pair of jeans. He sits down, puts on a shoe.\n          But the other one's gone. He feels under the chair. Not\n          there.\n          He opens the closet door. Not there. Tom blinks, unsettled.\n          This is kinda familiar.\n          He turns and looks at the bed.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          72. \n\n          CONTINUED:\n\n          TOM\n          Please don't be under there.\n          He bends down, lifts the blanket, and looks under the bed.\n          There's his shoe.\n          TOM (cont' d)\n          Shit.\n          He grabs it.\n\n          INT BATHROOM DAY\n          A note is taped to the bathroom mirror -- \"WENT TO THE PARK\n\n          WITH JAKE. M.\"\n          Tom winces as he takes it down and reads it. Again.\n\n          INT LIVING ROOM DAY\n          Shod, Tom comes down the stairs and into the living room.\n          Frank's not there, thank God.\n          Tom goes to the front door and opens it.\n\n          TOM\n          Uh... Frank?\n          But Frank's not on the porch either. Tom steps outside.\n\n          EXT FRONT PORCH DAY\n          It's a beautiful day, but the street is still kind of a mess\n          from the party yesterday. A SHOUT draws Tom's attention.\n          Those same two kids ride their bikes at each other, full tilt.\n          Tom walks down the steps of the porch, staring at them as they\n          SCREAM. At the last second, one of the kids turns away. The\n          other taunts him with cries of \"Chicken!\"\n          Tom stands frozen on the sidewalk. A bird swoops low over his\n          head; he really flinches this time. The Mailman waves to him,\n          headed down the block. Too stunned, Tom doesn't wave back.\n          He turns, panicked, and looks at Frank's house. He starts to\n          walk toward it, slowly at first, then picking up speed,\n          jogging across the driveway. He's halfway there --\n          -- when a GUNSHOT rings out from inside.\n\n          TOM\n          Oh, God...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          73. \n\n          CONTINUED:\n          He races the rest of the way, bounds up the steps to the\n          house, rips open the screen door. But the front door is\n          locked. He POUNDS on it.\n          TOM (coast' d)\n\n          ADAM?! ADAM, OPEN THE DOOR!!\n          He POUNDS harder, but there's no answer. He goes to the\n          window beside the door and peers through it.\n\n          THROUGH THE WINDOW,\n          he sees Adam lying on the floor in the middle of the living\n          room.\n\n          ON THE PORCH,\n\n          TOM\n          Oh, God, no!\n          Tom picks up a porch chair and heaves it through the window.\n\n          INT FRANK'S HOUSE DAY\n          Glass SHATTERS and sprays all over the floor. Tom knocks the\n          rest out of the frame with his elbow and climbs into the\n          house.\n          He races over to Adam's body. There is a pool of blood around\n          his chest and his body is convulsing. In his right hand, he\n          clutches a 38 with a carved white handle.\n\n          TOM\n          Oh, God, no, Jesus, no, please...\n          He grabs a blanket off a chair nearby, presses it to Adam's\n          chest, trying to stop the bleeding.\n          TOM (cont' d)\n          This is really happening.., it's\n          really happening...\n\n          CUT TO:\n\n          EXT OUR BLOCK DAY\n          Tom sits on his front steps, shell shocked, red light flashing\n          off his face. An ambulance and two police cars are parked in\n          front of the house next door, radios SQUAWKING with official\n          activity.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          74. \n\n          CONTINUED:\n          Tom just stares. A car comes barreling around the corner and\n          SQUEALS to a halt in front of the house. Frank and Sheila\n          leap out of the car and race toward the house.\n          Tom watches as they're intercepted-by a COP who tries to\n          restrain them for a second. But they're hysterical, they've\n          obviously been told something serious has happened and they're\n          desperate to get inside.\n          They blow past the Cop and hurry up the stairs, just as THREE\n          PARAMEDICS wheel a stretcher out of the house, headed for the\n          ambulance. The sheet isn't over Adam's head, at least, but\n          that's about the only good sign, they're working on him\n          frantically.\n          Tom buries his head in his lap as he hears the cries of Adam's\n          parents -- Frank's anguished, disbelieving BELLOW, Sheila's\n          horrified SCREAM.\n\n          CUT TO:\n\n          INT LIVING ROOM NIGHT\n          CLOSE ON a torn off piece of notebook paper with an address\n          and a time scribbled on it. The word \"Cacophony\" is legible.\n          Maggie picks it up, stares at it for a moment, then hands it\n          to Tom, who is by the front door, zipping his jacket. He\n          takes it and shoves it in his pocket. He's nervous. They\n          both are. She smooths his jacket. He turns to go, but she\n          tightens her grip on his jacket. Doesn't want to let him go.\n\n          TOM\n          We need some answers, right? Maybe\n          they're the only ones who have any.\n          She nods. Thinking of something, she picks up her car keys\n          from the table by the door and pulls something off the ring.\n\n          MAGGIE\n          I'm sure they're very nice people, but\n          in case they aren't --\n          She hands a thin black cannister to him.\n          MAGGIE (coat' d)\n          Mace the shit out of `em.\n          He smiles and shoves it in his pocket. She kisses him.\n\n          \n\n          \n\n          \n\n          \n\n          EXT DINGY STREET NIGHT\n          Tom walks down a street in a dodgy neighborhood at night,\n          checking addresses. He stops and looks up, at an old,\n          formerly grand apartment building that's fallen on hard times.\n\n          INT BUILDING - CORRIDOR NIGHT\n          The corridor is even creepier. And massive. Tom reaches a\n          door all the way at the end and knocks. A moment later, the\n          door opens. A very heavy-set woman in a floral print dress\n          (VIVIAN) smiles at him.\n\n          VIVIAN\n          I hope you like fondue!\n\n          INT VIVIAN'S APARTMENT NIGHT\n          Vivian sets a plate down on a TV tray in front of Tom. There\n          is a pile of chunks of various hard-to-identify meats, a\n          silver fondue spear, and a chocolate cupcake with an American\n          flag stuck in it. Tom sits on an overstuffed couch that's\n          leaking stuffing.\n\n          VIVIAN\n          Dip away!\n\n          TOM\n          Thank you. Listen, is, uh --\n          Vivian gives another plate to a man sitting next to Tom,\n          HERMAN, in his seventies, in a wheelchair, an oxygen tube\n          running into his nostrils.\n          TOM (coat' d)\n          Is there a guy named Neil here? He's\n          a cop?\n\n          VIVIAN\n          Well, of course he is!\n          She turns and heads back into the kitchen, passing BEVERLY,\n          her identical twin, who's wearing the same print dress, this\n          one with a red background instead of blue. Beverly serves two\n          people on the far couch, one a THIRTEEN YEAR OLD GIRL, the\n          other a HOMEY in his early twenties.\n          Tom picks up a ham chunk and looks at the steaming fondue pot,\n          full of cheese. Beverly dips and eats, winks at him, and\n          flits off across the room.\n          Herman turns to Tom and asks something in a raspy voice.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          76. \n\n          CONTINUED:\n\n          TOM\n          Excuse me?\n          Irritated, Herman gestures for him to lean closer. Tom does.\n\n          HERMAN\n          What does it want you to do?\n\n          TOM\n          I don't... I'm sorry, I don't under-\n          Herman wraps his bony fingers around Tom's wrist.\n\n          HERMAN\n          Then you're not listening!\n          NEIL (o.s.)\n          It's his first time, Herman. Give him\n          a break.\n          Tom turns. Neil, the cop he saw the other night, has come in\n          from the kitchen. Tonight he's in street clothes.\n          NEIL (cont' d)\n          (points at Tom)\n          Lemme guess. \"Distended parietal\n          lobe,\" right?\n\n          TOM\n\n          (AMAZED)\n          Who are you guys?\n\n          NEIL\n          Don't have a name. Cacophony Society,\n          somebody said once, that stuck for a\n          while. You know, like too many voices\n          in our heads? I think it's too\n          melodramatic. How about \"fellow\n          sufferers?\"\n          Vivian comes in from the kitchen with two big gallon jugs of\n          orange juice. There are AAAAHS1 of appreciation.\n\n          TOM\n          Does everybody here -- see things,\n          like me?\n\n          NEIL\n\n          (NODS)\n          Buncha freaks, huh?\n\n          HERMAN\n          Speak for yourself.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           77. \n\n          CONTINUED: (2)\n\n          NEIL\n          No, Herman, you're a freak. \"Mutants\"\n          is a better word for the rest of us.\n          He pulls 'ip a chair and sits down opposite Tom. On the other\n          side of tie room, Vivian and Beverly tell an animated two-part\n          story to he teenage girl and the homey, finishing each\n          others' se. .tences .\n          NEIL (cont' d)\n          Like any other part of our body, our\n          brains have evolved a lot in a hundred\n          thousand years. Our first thoughts\n          were formless. Struggling\n          consciousness. Sensation. An\n          instinctive tie to our environment.\n          But then our brains began to focus.\n          We sacrificed the intuitions we first\n          had so our thoughts could be directed,\n          so we could master specific functions.\n          That's where we are at the moment.\n          We're brilliant with technique, but\n          we've given up instinct. So the next\n          evolutionary step, the step yet to\n          come, or perhaps it's already in the\n          making, is actually backward. To\n          maintain our higher functions, but\n          reawaken the part of our brain that\n          was pure intuition. That was\n          receptive to anything, because it\n          didn't know enough not to believe.\n          You're a freak of nature, pal, an\n          evolutionary step. You're double-\n          jointed.\n          (taps his head)\n          Up here.\n\n          TOM\n          Are we the only ones?\n\n          NEIL\n          Hardly. I've heard of groups like\n          ours in San Francisco, New York,\n          Minneapolis -- those are just the\n          cities I've been to. Tom, you're what\n          they used to call a medium. You're\n          like a man in a dark tunnel with a\n          flashlight, but the light only goes on\n          once in a while. When it flickers on,\n          you get a glimpse of something, but\n          not enough of a glimpse to know what\n          it is. Just enough to know it's\n          there.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           78. \n\n          CONTINUED: (3)\n\n          TOM\n          What about my son?\n\n          NEIL\n          (sn files)\n          The ncxt generation. Much better\n          flashlight.\n\n          TOM\n          Wright, if there's all these people\n          who got this power, why doesn't\n          everybody know about it? Why isn't it\n          common knowledge?\n\n          NEIL\n          It is. A lotta people know.\n          Unfortunately, the easiest people to\n          convince, the believer types, they\n          also tend to be the dumbest. And\n          people who demand proof -- well, this\n          isn't something we can control, it\n          comes when it comes, so if you can't\n          make it happen, how can you prove it?\n          It's like that singing frog in the\n          cartoon, but when the guy puts it on\n          stage it just croaks and he looks like\n          a jerk.\n          Herman laughs, horribly. He likes that cartoon.\n          NEIL (cont' d)\n          Some of us try anyway. I say who\n          needs that kind of aggravation?\n\n          TOM\n          This all started when I was\n          hypnotized. Is that how it always is?\n\n          NEIL\n          First time I've heard that one. it\n          comes all different ways. Sometimes\n          it goes the same way it came.\n\n          TOM\n          So it does go away.\n\n          NEIL\n          For some people. Don't look for\n          rules. We're off the map here.\n\n          HERMAN\n          What does it want you to do?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           79. \n\n          CONTINUED: (4)\n\n          TOM\n          What does what want me to do?\n\n          HERMAN\n          You saw a ghos-, didn't you?\n\n          Z 'M\n          Yeah. Twice. t. girl that disappeared\n          from my neighborhood. Now the kid\n          next door just tried to kill himself.\n          I think he knew something, but now\n          I'll never know what it was. And I\n          gotta know.\n\n          HERMAN\n          Look, what'd the bitch want?\n\n          TOM\n          Why do you assume she wants something?\n\n          NEIL\n          They always do. Something they need\n          finished, something they can't do any\n          more.\n\n          TOM\n          Why me?\n\n          NEIL\n          Because she's confused. Doesn't know\n          why other people won't answer her.\n          She only knows that you will. If she\n          hasn't asked for something yet, she\n          will. And once they ask, it's very\n          difficult to stop yourself from doing\n          it.\n\n          TOM\n          What do you mean? She can, it can\n          make me do something I don't want to\n          do?\n\n          NEIL\n          Oh, no. You'll want to. Badly. You\n          won't think about anything else. You\n          won't sleep. You won't eat. You'll\n          lie. And God help anyone who tries to\n          stop you.\n\n          TOM\n          What if I stop me? What if I just\n          don't do it?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           80. \n\n          CONTINUED: (5)\n\n          HERMAN\n          Then you got a weird bitch friend for\n          the rest of your life.\n\n          NEIL\n          Just listen to her, Tom Let her tell\n          you what she wants.\n\n           CUT TO:\n\n          INT PHILIP'S APARTMENT - HALLWAY NIGHT\n           A HAND pounds on an apartment door. Philip opens up. He was\n          asleep.\n\n          PHILIP\n          What, what, what?\n\n          TOM\n          I want you to hypnotize me again.\n\n          INT PHILIP'S APARTMENT NIGHT\n          Tom paces the floor in Philip's apartment.\n\n          PHILIP\n          Just slow down, you gotta be a little\n          patient with me here, `cause, um...\n          well, Tom, Tom, I've got a confession\n          to make. See I, I, I just smoked this\n          great big fatty a few minutes before\n          you walked in, so this shit you're\n          tellin' me here is fuckin' with my\n          mind just a little bit extra, okay?\n          Tom grabs a chair from Philip's desk and sits.\n\n          TOM\n          Do it.\n\n          MOMENTS LATER,\n          they sit face to face.\n\n          PHILIP\n          Okay. Close your eyes.\n          Tom closes his eyes.\n\n          \n\n          \n\n          \n\n          \n\n          81. \n\n          IN THE BLACK,\n          PHILIP (o.s.)\n          Just like last time -- I want you to\n          concentrate. Listen to the room\n          around you.\n          Tom listens. The factory CHURNS softly outsioi the windows.\n          A few CARS in the street below. His BREATHING.\n          PHILIP (cont' d)\n          Now focus. Concentrate. Look at the\n          backs of your eyelids. Do you see\n          anything there?\n\n          IN PHILIP'S APARTMENT,\n\n          TOM\n          (opens his eyes)\n          Would you just get to it, please?\n\n          PHILIP\n          All right, all right.\n          Tom closes his eyes again.\n          PHILIP (cont' d)\n          I want you to pretend you're in a\n          movie theatre.\n\n          INT MOVIE THEATRE NIGHT\n          We're sitting alone in an empty movie theatre. The seats and\n          walls are covered in black velvet.\n          PHILIP (o.s.)\n          It's very dark. Everything is covered\n          in black velvet. The seats, the\n          walls, the floor. In the whole pitch-\n          black theatre, there's only one thing\n          you can see. The white screen. You\n          drift toward it, in your chair.\n          Up ahead of us, the screen is a dazzling white. We move\n          slowly toward it, floating over the seats.\n          PHILIP (o.s.)\n          There are letters up on the screen.\n          Tall, thick, black letters, but\n          they're out of focus. You drift\n          closer to them.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          82. \n\n          CONTINUED:\n          We do drift closer to the blurry letters, but our attention is\n          diverted by something. Three rows from the screen, there is a\n          figure in one of the seats, its back to us.\n\n          INT PHILIP'S APARTMENT NIGHT\n          Tom's eyes are sill closed. His face furrows in conctrn.\n\n          TOM\n          There's someone in here.\n\n          PHILIP\n          No, it's empty.\n\n          TOM\n          There's someone else here.\n\n          PHILIP\n          No, man, I said you're alone in the\n          theatre.\n\n          INT MOVIE THEATRE NIGHT\n          But there is someone in the theatre with us, and we continue\n          to drift forward toward them.\n          PHILIP (o . s . )\n          You're comfortable in your black\n          velvet seat, very comfortable...\n          Actually, we're quite nervous, drifting closer and closer to\n          that figure sitting in the third row, its back to us.\n          PHILIP (o . s . )\n          Your feet and ankles are relaxed.\n          Your legs are relaxed.\n\n          INT PHILIP'S APARTMENT NIGHT\n          Tom's eyes are still closed. His chest is twitching.\n\n          TOM\n          hard to breathe\n\n          INT MOVIE THEATRE NIGHT\n          The figure in the seat is only a row or two ahead of us now.\n          It's a woman. We keep drifting closer.\n          PHILIP (o . s . )\n          Your hands are limp and heavy. Your\n          arms are relaxed. Your face.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          83. \n\n          CONTINUED:\n          Our hand reaches out, touches the shoulder of the woman. She\n          turns.\n          It's Samantha. Her face is shrouded in plastic. Her mouth\n          presses against the plastic, it forms a horrible round 0,\n          contorted in a silent scream.\n\n          INT PHILIP'S APARTMENT NIGHT\n          Tom's eyes flicker madly under the lids. Philip's worried.\n\n          PHILIP\n          I want you to look at the screen.\n\n          TOM\n\n          (GASPING)\n          I can't breathe!\n\n          PHILIP\n          Look at the screen, Tom.\n\n          INT MOVIE THEATRE NIGHT\n          Now Tom's not just an observer in the movie theatre, he's in\n          the movie theatre, sitting right next to Samantha. She's\n          pawing at him, it's all he can do to fight her hands off. In\n          their struggle, his fingers close around the plastic that\n          shrouds her face. He sweeps it off her head.\n          PHILIP (o.s.)\n          The screen, Tom, look at the screen!\n          You can read the letters now!\n          Samantha's face is bloodied and bruised, as the plastic comes\n          off she GASPS for air and lets out a ghastly, inhuman SHRIEK\n          that fills the theatre. Philip's voice gets louder as he\n          struggles to maintain control of the hypnosis.\n          PHILIP (o.s.)\n          Look at the screen, Tom, you're close\n          enough now, you can read the letters,\n          you're right up next to them!\n          Tom, still holding off Samantha's grasping hands, turns and\n          looks up at the movie screen.\n          PHILIP (o . s . )\n          The letters come into focus, they\n          spell --\n          Tom's eyes widen as he stares at the screen. Three huge\n          letters pop into focus and fill our field of vision. The\n          letters say:\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          84Â\u0080¢ \n\n          CONTINUED:\n\n          DIG\n\n          \n\n          \n\n          \n\n          \n\n           85. \n\n          INT PHILIP'S APARTMENT NIGHT\n          Tom's eyes pop open and he staggers backwards, gasping for\n          air, knocking the chair out from under himself. He falls back\n          against Philip's desk, scared out of his mind.\n\n          PHILIP\n          What?! What happened?!\n\n          TOM\n          Couldn't breathe...\n\n          PHILIP\n          Are you okay?!\n          Tom wipes his brow, he's covered in sweat.\n\n          TOM\n          Plastic, like sheets of plastic...\n          He shoves Philip out of the way, finds the refrigerator on the\n          other side of the room. He rips it open, searches for\n          something to drink. Philip follows him.\n\n          PHILIP\n          I think you need to sit down, man,\n          something very next level was\n          happening there, you should have seen\n          your face.\n          Only beer in the fridge. Tom CRACKS one open and upends it.\n          PHILIP (cont' d)\n          Uh... want a brew?\n          Tom drinks the entire can.\n          PHILIP (cont' d)\n          Feel better?\n          Tom nods, wiping his chin.\n          PHILIP (cont' d)\n          What happened?\n          Tom looks at him, calming.\n\n          TOM\n          She told me what she wants.\n\n          CUT TO:\n\n          \n\n          \n\n          \n\n          \n\n          EXT TOM & MAGGIE'S HOUSE DAY\n          Maggie's Sentra pulls into the driveway of their house,\n          parking behind Tom's phone company truck. She gets out,\n          dressed in work clothes, and pulls two bags of groceries out\n          of the trunk. She looks at Tom's truck, then at her watch.\n          Home already?\n\n          INT TOM & MAGGIE'S HOUSE DAY\n          Maggie comes in the front door.\n\n          MAGGIE\n          (calling out)\n          Hey! You're home early!\n          She struggles to take the keys out of the door while still\n          holding the groceries.\n          MAGGIE (cont' d)\n          Can you pick up Jake? I'm exhausted!\n          She comes in and kicks the door shut behind her. Tom's\n          nowhere to be seen. From somewhere in back, there is a faint\n          CRUNCHING sound.\n          MAGGIE (cont' d)\n          Hello?\n          No answer. She heads into the kitchen with the groceries.\n\n          INT KITCHEN DAY\n          In the kitchen, a letter is waiting in the tray of an old fax\n          machine on the counter. Maggie stops in the doorway, staring\n          at the floor. Muddy footprints lead into and out of the\n          kitchen, through the door to the back. Thick chunks of wet\n          mud are everywhere.\n\n          MAGGIE\n          Hey, look what I'm not cleaning up.\n          She sets the groceries down on the counter and pulls out a\n          gallon of milk. She opens the refrigerator. She does a\n          double take. The entire top shelf is jammed with cardboard\n          cartons of orange juice.\n          From outside, the CRUNCHING sound comes again. She follows\n          the muddy footprints out the kitchen door.\n\n          \n\n          \n\n          \n\n          \n\n          EXT BACK YARD DAY\n          The back yard is smallish, but it's a nice little patch of\n          grass. Used to be, anyway, because now there are three large\n          holes in it, dug seemingly at random locations. Large piles\n          of dirt and rock are heaved up next to the holes.\n          Tom stands in one of t1.e holes, his back to Maggie, hoisting a\n          large pick axe high over his head. CRUNCH. He brings the\n          pick down, into the hole. Busy guy.\n          Maggie is aghast. She walks slowly across the yard, past a\n          pile of shovels and buckets and other tools. She draws closer\n          to him.\n\n          MAGGIE\n          Tom?\n          Tom raises the pick high and brings it down hard. CRUNCH.\n          The hole he's in at the moment isn't more than two or three\n          feet deep. But, hey, it's early.\n          Maggie draws closer. In between swings --\n          MAGGIE (coast' d)\n          Tom.\n          Tom whirls, the pick raised to defend himself. His shirt's\n          off, his chest and face are streaked with mud and sweat.\n          Maggie jumps back.\n\n          TOM\n          You scared me.\n          And with that, he turns back to the job. Swing. CRUNCH.\n\n          MAGGIE\n          S scared you?\n          Swing. CRUNCH.\n          MAGGIE (cont' d)\n          Tom.\n          Swing. CRUNCH.\n          MAGGIE (cont' d)\n          What are you doing?\n\n          TOM\n          (doesn't turn around)\n          I'm supposed to dig.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          88. \n\n          CONTINUED:\n          Swing. CRUNCH.\n          Maggie walks around him, so she's facing him. He keeps\n          working.\n\n          MAGGIE\n          What do you mean?\n          Zom shrugs. Swings the pick.\n\n          TOM\n          I'm supposed to dig.\n\n          MAGGIE\n          Who says?\n          He just looks at her from under his sweaty brows. You know\n          who.\n          MAGGIE (cont' d)\n          Oh.\n          Tom manages to break apart the rock he was working on with the\n          pick. He tosses the axe, which bounces crazily across the\n          grass at Maggie's feet. She jumps out of the way. He hoists\n          himself out of the hole and picks up the garden hose. He\n          sprays water into the hole.\n          MAGGIE (cont' d)\n          Why are you doing this?\n\n          TOM\n          Water softens up the dirt.\n          He tosses the hose aside and grabs a shovel. He jumps back in\n          the hole and starts to dig.\n\n          MAGGIE\n          No, I mean... Could you stop for a\n          minute?\n          (he keeps digging)\n          Would you please stop for a minute?\n\n          TOM\n          What don' t you get? I'm supposed to\n          dig.\n\n          MAGGIE\n\n          TOM! I'M ASKING YOU TO STOP FOR ONE\n\n          MINUTE!\n          He looks up, supremely irritated, and leans on the shovel.\n          \"Well?\"\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           89. \n\n          CONTINUED: (2)\n          MAGGIE (coat' d)\n          M2y are you digging?\n\n          TOM\n          (isn't it obvious?),\n          I'm searching.\n\n          MAGGIE\n          What are you searching for?\n\n          TOM\n          The question isn't \"what.\" We both\n          know very well \"what,\" even if we\n          don't want to may it out loud. The\n          question, Maggie, which, as you can\n          plainly see, I am very busy trying to\n          answer -- the question is \"Where?\"\n\n          MAGGIE\n          I think we should call the police.\n\n          TOM\n          And tell them what, exactly? Run it\n          by me once. Practice, see how it\n          sounds.\n          (looks at his watch)\n          Anything else?\n\n          MAGGIE\n          Why don't you come in the house with\n          me? Take a break. I want to talk to\n          you, you're not yourself right now.\n\n          TOM\n          This is just fucking typical, isn't\n          it?\n          He climbs out of the hole and walks toward her.\n          TOM (cont' d)\n          What do you want me to do, Maggie, you\n          want me to go inside, sit down in\n          front of the TV, drink eight or nine\n          beers till I fall asleep in the chair?\n          Like that? Maybe repeat the whole\n          thing tomorrow and the day after and\n          the day after and the day after and\n          the day after and the day after and\n          the day after and the day after and\n          the day after and the day after and\n          the day after and the day after and\n          the day after and the day after and\n          the day after and the day after-\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           90. \n\n          CONTINUED: (3)\n\n          MAGGIE\n\n          STOP!\n\n          TOM\n          -until I grab my chest-and die?!\n          May )e I was already dead! This is the\n          mos. important thing that's ever\n          happâ\u0080¢ned to me, the most important\n          thins I've ever done in my life,\n          Maggie, my whole stupid life, and you\n          want me to just STOP?!\n          By the and of his tirade, TWO NEIGHBORS are staring over the\n          back fence. He's only a few feet from Maggie now, the veins\n          in his neck standing out. She holds her ground.\n\n          MAGGIE\n\n          (QUIETLY)\n          I've known you since I'm nineteen\n          years old, you never talked to me like\n          that before. Not one time.\n          He stares at her, furious --\n          -- and then jumps in the hole and starts digging again.\n          Maggie turns and stalks across the yard and into the house.\n          Tom keeps digging for a moment, then hurls the shovel across\n          the yard.\n\n          TOM\n          InterRUPtions!\n          He picks up his tee shirt, snakes angrily into it, and marches\n          across the yard toward the house.\n          TOM (cant' d)\n          (to the Neighbors)\n          What are YOU lookin' at?\n\n          INT KITCHEN DAY\n          Maggie site at the kitchen table, reading the letter that came\n          in on the fax. Tom comes into the room behind her, pauses in\n          the doorway, composing himself. She keeps reading. He sighs,\n          heavily. She doesn't turn around.\n          He goes to the refrigerator and takes out a carton of orange\n          juice. He takes two glasses from a cupboard and sits down at\n          the table opposite her. He fills both glasses and puts one in\n          front of her. She looks up at him as he drains his. He\n          pauses, staring at her.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          91. \n\n          CONTINUED:\n\n          TOM\n          You gonna drink that?\n          She doesn't answer. He takes her glass, drinks some.\n          TOM (cone' d)\n          I'm sorry.\n          No answer.\n          TOM (coat' d)\n          Okay, I'm not sorry.\n          She ignores him. He looks at the letter in her hands.\n          TOM (cont' d)\n          Who's that from?\n\n          MAGGIE\n          My brother Steve. My mother's going\n          back in the hospital again.\n\n          TOM\n\n          (IMMEDIATELY)\n          No, sh-\n          He stops himself. She looks at him.\n\n          MAGGIE\n          What?\n          He shakes his head.\n          MAGGIE (cont' d)\n          What?\n\n          TOM\n          Nothing.\n          They stare at each other. Tom's face is pale. Maggie is\n          concerned.\n          The phone RINGS. Maggie stares at Tom. The phone RINGS\n          again. She lowers her voice, pleading.\n\n          MAGGIE\n          What is it?\n          Tom can't look at her. The phone RINGS again. Tom gets up,\n          opens the door that leads to the back yard, and goes outside.\n\n          \n\n          \n\n          \n\n          \n\n          EXT BACK YARD DAY\n          Tom takes a few steps out of the house, putting his hands to\n          his head in pain. Whatever it is, he knows. In the house,\n          the phone rings a fourth time. Maggie's voice drifts through\n          the open doorway as she answers i;.\n\n          MAGGIE ( - 9.)\n          Hello?\n          Tom closes his eyes.\n          MAGGIE (o.s.)\n          Steve, I was just going to-\n          She stops. There is a long silence. Tom opens his eyes. A\n          tear runs down his cheek. He wipes it away.\n          He turns and walks back toward the house, slowly. There is\n          dead silence inside. As he nears the doorway, he hears the\n          sound of the telephone being placed back in its cradle.\n          Maggie reaches the doorway at the same time Tom does. She\n          looks up at him, her eyes filled with tears. He puts his arms\n          around her and she breaks down. He holds her.\n          He holds her for a long moment.\n          MAGGIE (cont' d)\n          You knew.\n          (no answer)\n          You knew, didn't you?\n\n          TOM\n          When's the funeral?\n\n          MAGGIE\n          Sunday. We should leave as soon as we\n          can.\n\n          TOM\n          We?\n          She stiffens.\n          TOM (cont' d)\n          Oh, you, uh... you want me to go with\n          you?\n          She looks at him, deeply hurt. Then enraged. She pushes him\n          away from her, hard. He stumbles back into the yard.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          93. \n\n          CONTINUED:\n          TOM (cont' d)\n          Hey, I just thought, maybe, you\n          know... your family might want...\n\n          MAGGIE\n          Do I WANT you to come with me:! To my\n          MOTHER'S FUNERAL?! Of COURSE L want\n          you to come, why the hell WOULLV'T you\n          come?!\n          But he's looking past her, at the holes in the yard.\n\n          TOM\n          I'm just... kind of in the middle of\n          something here.\n          She looks at him, absolutely incredulous --\n          -- and then storms back into the house, SLAMMING the door so\n          hard two of the glass panes spiderweb.\n\n          CUT TO:\n\n          EXT DRIVEWAY DAY\n          Jake, twisted around in his car seat, looks out the back\n          window of Maggie's car. He raises one hand, waving.\n          Tom stands in the open doorway of the garage, still in his mud-\n          stained jeans and tee shirt. He waves back.\n          The car pulls out of the driveway, fast, and ROARS off down\n          the block. Jake and Maggie are gone.\n\n          EXT BACK YARD DAY\n          There are now five large holes in the back yard, and Tom is\n          running out of places to dig. Nevertheless, he drags the hose\n          across the yard to an untouched patch of grass in the far\n          corner.\n          He stops short. Hose won't reach.\n\n          AT THE SPIGOT,\n          he unscrews the hose and carries it across the yard.\n\n          AT ANOTHER SPIGOT,\n          this one in the far corner, he reconnects the hose and turns\n          on the water. Nothing comes out.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          94. \n\n          CONTINUED:\n\n          TOM\n          Come on!\n          Tom curses and trudges back toward the house.\n\n          INT KITCHEN DAY\n          Tom gets a screwdriver from a tool drawer in the kit-hen.\n\n          INT DINING ROOM DAY\n          Tom stomps into the dining room and goes to a closet on the\n          far wall. He opens the door and tosses aside a carpet flap\n          that covers the floor. He shoves the screwdriver into a crack\n          in the floor and pries up a trap door, two feet square, in the\n          middle of the closet floor.\n          Through the hole, he can see a ladder resting up against the\n          wall below. He feels for the rungs with his feet and starts\n          to climb down.\n\n          INT BASEMENT DAY\n          As Tom climbs down, he reaches out for a chain that hangs from\n          a bare bulb in the ceiling and turns it on. They have only a\n          partial basement, a ten by ten foot space about eight feet\n          deep. The rest of the area under the house is just crawl\n          space, barely enough to wriggle through.\n          Tom reaches the bottom and goes to the far side, where a mess\n          of water pipes all converge. He picks through them, finds the\n          valves that lead outside, turns one off and another one on.\n          WATER surges through the pipes, headed out to the far spigot.\n          He turns to climb back up the ladder.\n          And stops.\n          He looks down, at the floor. It's dirt.\n          He kicks at the dirt with his shoe, thinking.\n\n          A FEW MINUTES LATER,\n          the pick axe falls. Tom has brought all his tools into the\n          basement and is now digging in the middle of the basement\n          floor. The bare bulb throws his exaggerated shadow on the\n          earthen walls.\n          He works.\n\n          \n\n          \n\n          \n\n          \n\n          EXT OUR BLOCK DAY\n          It's quiet in the neighborhood. The CRUNCHING sound of Tom's\n          pick axe falling echoes over the block.\n\n          INT BASEMENT DAY\n          Tom digs. The hole is almost four feet across, five feet\n          deep. He's uncovered a large rock, a major chunk of stone,\n          right in the middle of where he wants to dig. He's excavated\n          all around the edges of the thing and is trying to wedge it\n          loose with a pry bar, but it won't budge.\n          Tom collapses onto the floor, leaning against the pile of mud\n          and stone he's already hauled out. He thinks.\n\n          CUT TO:\n\n          INT YARD SUPPLY WAREHOUSE DAY\n          Tom walks down an aisle along one wall in a huge yard supply\n          warehouse. Tools are mounted on the wall for sale -- shovels,\n          picks, post hole diggers. Got all that. Tom keeps walking.\n          The tools get bigger. Huge shovels. Tractor blades. Hand\n          pile drivers. Almost, but not quite. Tom keeps walking.\n          At the end of the row, underneath a sign that says \"FOR RENTAL\n          ONLY\" is an industrial-size jackhammer, the kind road crews\n          use to bust through whatever's in their way.\n          Tom's face lights up.\n\n          EXT STREET DAY\n          The jackhammer rides in the back of Tom's pickup truck,\n          rattling along as the truck bounces over potholes. Tom pulls\n          into his driveway, comes around, and drops the gate.\n          Using all his strength, he wrestles the jackhammer out of the\n          back of the truck. It's incredibly heavy, it takes all his\n          strength to haul it up the stairs, kick open his door, and\n          bring it into the house.\n\n          IN THE STREET,\n          Lenny, the neighborhood crank, is washing his car. He hears a\n          CRASH from over at Tom's place and turns. He sees Tom at his\n          pickup, lugging a huge air compressor out of it.\n          Tom fights his way into the house with the compressor.\n          Lenny stares at him.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          96. \n\n          CONTINUED:\n          Sheila, carrying flowers and looking like didn't sleep last\n          night, comes out of her house and heads for her car. She\n          stops and stares too.\n\n          INT BASEMENT DAY\n          In Tom's basement, the compressor descends through the trap\n          door above, seemingly of its own accord -- than we see it's at\n          the end of a rope and Tom is up in the trap door space,\n          sweating and straining, lowering the thing down.\n          It settles on the floor next to the jackhammer.\n\n          A BIT LATER,\n          Tom reaches up to the hanging light bulb, which also has an\n          electrical outlet in its fixture, and plugs in a yellow safety\n          cord.\n          He flicks a switch on the compressor and it RATTLES to life.\n          He follows a hose over to where it plugs into the side of the\n          jackhammer, which now quivers with unleashed power.\n          Tom picks up the jackhammer. He hauls it over to the rock\n          that's been in his way. He positions the jackhammer's spike\n          on the top of the rock. He lowers a pair of goggles over his\n          eyes. He swings his weight up, onto the jackhammer, and\n          squeezes the handles.\n          The jackhammer ROARS to life. It's deafening. Tom's whole\n          body quivers. It's like riding a bull, but the rock begins to\n          split in half.\n          Tom WHOOPS with joy, barely heard over the din that echoes in\n          his basement.\n\n          EXT STREET DUSK\n          As the sun goes down, the sound of the ROARING jackhammer is\n          plainly audible on the block. The familiar Homeless Guy stops\n          and SHOUTS something at Tom's house.\n          Across the street, Kurt Damon comes out his front door and\n          stares at Tom's house. What the hell is that guy up to?\n\n          CUT TO:\n\n          INT UNCLE STEVE'S HOUSE NIGHT\n          A group of PEOPLE IN DARK CLOTHES mill around a living room,\n          muttering in the soft tones of those at a wake.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          97. \n\n          CONTINUED:\n          There's a lot of big Irish guys drinking beer, guts stuffed\n          into sweat-stained white shirts. Maggie excuses herself from\n          the group and steps into another room.\n\n          INT STEVE'S BEDROOM NIGHT\n          The door is ajar, people visible through it as Maggie dials a\n          nu-rber on a bedside telephone. The phone rings on the other\n          enc. And rings. And rings. Just as she's about to hang up,\n          Tom answers.\n          TOM (o.s.)\n          (sounds angry)\n          Hello?\n\n          MAGGIE\n          It's me.\n          TOM (o.s.)\n          (changes his tone)\n          Oh, hi. How ya doin'?\n\n          MAGGIE\n          I'm okay.\n          TOM (o.s.)\n          How's your family?\n\n          MAGGIE\n          You know. Drunk. Fighting with each\n          other.\n          TOM (o.s.)\n          Listen, Maggie, I'm sorry. I was an\n          asshole. I should be there with you\n          right now.\n\n          MAGGIE\n          Yeah, well, what can I say? You are\n          kind of an asshole. How do you feel?\n          TOM (o.s.)\n          Fine. A lot better. Much, much\n          better. Everything's fine here. Real\n          good.\n\n          MAGGIE\n          Have you had any-\n          TOM (o.s.)\n          Nope. Not even one.\n\n          MAGGIE\n          No, uh... no more digging?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          98. \n\n          CONTINUED:\n          TOM (o.s.)\n          No. Uh uh. Back to normal.\n\n          MAGGIE\n          Look, I'm sorry too. I' wish I hadn't\n          just stormed out of there, I shouldn't\n          have left you alone.\n          TOM (o.s.)\n          I deserved it.\n\n          MAGGIE\n          Are you okay? You sound funny. What\n          are you doing?\n          TOM (o.s.)\n          Just... moving a chair. There.\n\n          MAGGIE\n          Why don't you come up here with us?\n          This time of night you could make it\n          in an hour.\n          TOM (o.s.)\n          Well, I can't, really.\n\n          MAGGIE\n          Why not?\n          TOM (o.s.)\n          (a lame lie)\n          I'm, uh, not supposed to use the truck\n          for personal trips.\n\n          MAGGIE\n          (trying to keep her cool)\n          Alright. I'll come down there and get\n          you. I'll leave right now.\n          Behind her, the bedroom door swings open. Jake stands there.\n          He looks terrible. She doesn't hear him come in.\n          TOM (o.s.)\n          No, no, no, no, no, what do you want\n          to do that for? Don't come down here.\n\n          JAKE\n          Feathers everywhere.\n          Maggie turns back to Jake -- and GASPS. He's peeing his\n          pants, the urine drizzling down over his shoes.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           99. \n\n          CONTINUED: (2)\n\n          MAGGIE\n          (into phone)\n          Oh, my God, I gotta go. I'll be there\n          in an hour.\n          TOM (o.s.)\n          Maggie, wait, no, Mag-\n          She hangs up the phone and races over to her son.\n\n          MAGGIE\n          Honey, what happened? Why didn't you\n          tell me you had to go to the potty?\n          Jake turns and looks at her.\n\n          JAKE\n          Help Daddy.\n\n          CUT TO:\n\n          INT TOM & MAGGIE'S DINING ROOM NIGHT\n          Tom SLAMS down the phone. He's standing in the dining room,\n          which is now so mud-spattered it looks like the inside of a\n          cave. The table has been shoved against the wall, legs\n          sticking out into the room. One corner is filled with a pile\n          of broken-up chunks of rock. Tom strides across the room in\n          two steps, lowers himself, and drops his legs through the open\n          trap door.\n\n          INT BASEMENT NIGHT\n          Tom sails down into the basement and lands nimbly on the\n          floor. Doesn't even use the ladder anymore.\n          The rock is gone, broken apart by the jackhammer, and the hole\n          is now eight feet long and as many wide, and about four feet\n          deep. Tom leaps down into it and goes back to work.\n\n          CUT TO:\n\n          INT STEVE'S HOUSE NIGHT\n          In the front hall of the house, Maggie is putting on her coat.\n          Jake sits on the steps, his coat on the carpet next to him.\n\n          MAGGIE\n          Jake, come on, we have to go.\n\n          JAKE\n          I'm staying here.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          100. \n\n          CONTINUED:\n\n          MAGGIE\n          What?\n\n          JAKE\n          I want to stay at Uncle Steve's, I\n          don't want to go home.\n\n          MAGGIE\n          Why not?\n\n          JAKE\n          Because I'm not safe there. Because\n          of the feathers.\n\n          MAGGIE\n          What does that mean, Jake?\n          He shrugs. Philip, Maggie's brother, stands in the doorway to\n          the other room.\n\n          PHILIP\n          It's okay, I can watch him.\n          Maggie, in a hurry, agrees. She bends over and kisses Jake on\n          the forehead.\n\n          MAGGIE\n          Be good.\n          She opens the door and heads out. As it's swinging shut:\n\n          JAKE\n          Don't stop for the train, Mommy.\n\n          EXT UNCLE STEVE'S HOUSE NIGHT\n           Maggie hears that just as the door closes behind her. She\n           misses a step, thinking about it, then starts walking to her\n          car.\n          She walks faster.\n          Then she runs.\n\n           CUT TO:\n\n          INT BASEMENT NIGHT\n          In the basement, Tom abruptly stops digging, staring at the\n          dirt. The corner of something shiny is sticking out from the\n          pile. He bends down and pulls it out.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          101. \n\n          CONTINUED:\n          It's a piece of clear blue plastic sheeting, about two inches\n          square. Tom's hand starts to shake as he holds it.\n\n          AN IMAGE\n          flas.es through his mind again, the one he's seen twice\n          befoi-. A FACE, too close to his, sting at him through that\n          blurr blue, like through bad eyeglasses.\n\n          IN THE BASEMENT,\n          Tom turns and leaps into the hole, shovel in hand. He begins\n          to dig, wildly, flinging dirt in all directions. At one end\n          of the hole, his shovel slips, the dirt spilling off it as it\n          sticks on something. Something buried.\n          Tom drops the shovel. He falls to his knees and uses his\n          hands to rake the dirt away from whatever it was.\n          More blue plastic.\n          Tom tugs out about eight inches of the plastic, gets a good\n          grip on it with both hands. He pulls it up.\n          Like a rope pulled out of the sand, the edge of the blue\n          plastic rises up, unearthing itself in a line down the middle\n          of the pit.\n          Breathing hard, Tom grabs the shovel again.\n\n          THE DIRT,\n          flies away from the plastic as Tom works furiously.\n\n          TOM'S FACE\n          is of a man possessed. He digs as fast as he can.\n\n          FINALLY,\n          Tom stands back, staring down at what he has unearthed.\n          Above him, we see what it is. A long piece of blue plastic,\n          wrapped around something about five and a half feet long and\n          two and a half feet wide.\n          Tom bends down and lays one hand on the plastic. He flinches.\n\n          AN IMAGE\n          pops into his mind, another familiar one. A FIGURE IN Afl\n          OVERCOAT, standing on the front porch of Tom's own house in\n          winter, waving to us to come up.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          102. \n\n          CONTINUED:\n\n          IN THE BASEMENT,\n          Tom jerks his hand off the plastic. He swallows.\n          He goes to hi= toolbox and pulls out a utility knife. He\n          slides the ra or blade forward.\n          He goes to one and of the plastic, bends down, and jams the\n          knife through the sheeting. He walks the length of it, making\n          a slit down the middle. He reaches out with shaking hands and\n          pulls part of the plastic back.\n          The first thing he sees is a partially decomposed human hand.\n          Around the withered wrist, there are a half dozen multi-\n          colored bracelets.\n          Tom yanks the rest of the plastic away, revealing the half-\n          decomposed body of Samantha Muller, still in the black dress\n          with the diamond pattern. Tom stands there, his chest\n          heaving.\n          He looks at her hand, thinking.\n          He sits down next to her.\n          He reaches out for her hand, then pulls his own back.\n          Can't do it.\n          But he's gotta. He opens his hand, reaching out for hers. He\n          slides his hand underneath --\n          takes a deep breath --\n          -- and closes his living fingers around her skeletal ones.\n          He GASPS.\n          His face turns a horrible shade of pale, his lips go ice blue,\n          and STEAM comes out of his mouth, the way it did hers when he\n          first saw her in his living room.\n\n          EXT TOM'S HOUSE DAY\n          It's a wintry day. That same steam rises up in front of us,\n          coming from our own mouth. We're looking at the front porch\n          of Tom's house as we walk past it. The house is being\n          remodeled, it's surrounded by scaffolding, its windows covered\n          with plastic Duvateen.\n          The Figure in the Overcoat waves to us.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          103. \n\n          CONTINUED:\n\n          FIGURE\n          Hi!\n\n          SAMANTHA\n          (off screen, we're in her point\n          of vie sr)\n          Hi.\n\n          FIGURE\n          C'mare a sec!\n\n          SAMANTHA\n          What?\n\n          FIGURE\n          I want to show you something!\n          We look back, over our shoulder, then back at the Figure. You\n          mean me? This close now, we see the Figure is Kurt Damon.\n\n          SAMANTHA\n          You want to show me something?\n          Her manner of speech is childish, like a grade-schooler's.\n\n          KURT\n\n          (CHARMING)\n          Well, of course! I don't see anybody\n          else around!\n          We start up the steps of the porch. Kurt smiles, beguilingly,\n          and holds a hand out to us.\n\n          SAMANTHA\n          What is it?\n\n          KURT\n          It's a surprise.\n          He tugs. She resists.\n\n          SAMANTHA\n          What kind of surprise?\n\n          KURT\n          Well, if I told you, it wouldn't be\n          much of a surprise, would it?\n          We let him pull us through the door.\n\n          \n\n          \n\n          \n\n          \n\n           104. \n\n          INT HOUSE DAY\n           Kurt leads us into the living room. The windows are covered\n           with tinted plastic, casting an eerie blue light through the\n          place.\n          Adam McCarthy is in the living - loom too, drinking from a\n           bottle of schnapps. He's drunk, slurring. He sees us.\n\n          ADAM\n          Happy St. Patrick's Day.\n\n          SAMANTHA\n          What's the surprise?\n\n          ADAM\n          Uh... don't you have it?\n          He giggles.\n\n          KURT\n          Oh yeah, the surprise.\n\n          ADAM\n          The surprise.\n          They laugh and look at each other. Kurt drinks, then forces\n          the bottle back at Adam.\n          ADAM (cant' d)\n          I'm too wasted.\n\n          KURT\n          Drink, motherfucker, drink\n          motherfucker, drink motherfucker\n\n          DRINK!\n          He wrestles with Adam, forcing him to drink. Half of it runs\n          down Adam's chin.\n\n          SAMANTHA\n          I don't think there is a surprise.\n          We turn and start for the door. Kurt hurries around,\n          intercepts us.\n\n          KURT\n          Yeah there is, yeah there is.\n          He puts his arm around us, leads us back into the room.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          105. \n\n          CONTINUED:\n          KURT (cont' d)\n          The surprise is... we decided we want\n          to be your friends.\n\n          SAMANTHA\n          You do?\n\n          ADAM\n          Oh, yeah, so bad.\n          He laughs.\n\n          SAMANTHA\n          Why do you want to be my friend?\n\n          KURT\n          Are you kidding? Look at yourself!\n          Kurt turns Samantha toward an old mirror that hangs over the\n          fireplace. She's good-looking, if she knew it. Terribly\n          insecure, doesn't even like looking at herself. We turn away,\n          embarrassed.\n          KURT (coast' d)\n          Ah ah ah, look!\n          He makes us look in the mirror again.\n          KURT (cont' d)\n          Mama, you are hot.\n          He turns her toward him, looks at her, closely.\n          KURT (coast' d)\n\n          (SOFT)\n          Come on, let's be friends.\n\n          SAMANTHA\n          Well.., you can kiss me if you want\n          to.\n          Kurt leans in close, kisses us. After a moment, we force our\n          head away, looking down. Kurt's hand is on Samantha's breast.\n          We push him back.\n          SAMANTHA (cont'd)\n          Not like that!\n          But Kurt pulls us closer, roughly. We struggle.\n\n          KURT\n          Come on, Samantha, I'll be your\n          friend, I swear I will.\n\n          (MORE)\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           106. \n\n          CONTINUED: (2)\n           KURT (cont' d)\n          Just be nice to me. Be a good girl.\n          You're a good girl, aren't you?\n\n          SAMANTHA\n          I have to go home.\n          We struggle some more. He gets his powerful hanis on our\n          shoulders and starts to push us down.\n\n          KURT\n          Come on, baby, how `bout a little\n          helmet wash?\n          His belt buckle comes into our view, and his hands on it. We\n          tear away, get up and run for the door.\n          From behind, something hits us very hard. The floorboards\n          race up at us, all of a sudden. We land on them, hard, bounce\n          off, our own blood spraying out on the unfinished wood.\n          Our head lands sideways on the floor. We see Adam McCarthy,\n          vomiting in the corner.\n          Abruptly, we're rolled over and are staring at the ceiling.\n          Kurt Damon is on top of us, his face too close. Her hands\n          rise up, try to push him off, but he's stronger.\n          Samantha starts to SCREAM. Hands close over our face. She\n          bites, and the hands are pulled away. She SCREAMS again.\n          KURT (cont' d)\n\n          SHUT UP! SHUT UP!\n          Kurt holds her down, begins to try to undress her. She\n          writhes and SCREAMS. She gets one hand into Kurt's hair and\n          pulls as hard as she can. He SHOUTS in pain.\n          In the corner, Adam McCarthy has his hands over his ears.\n\n          ADAM\n\n          MAKE HER STOP! MAKE HER STOP\n\n          SCREAMIN', MAN, MAKE HER STOP!\n          But she keeps screaming. Adam staggers to a boom box that's\n          sitting on the fireplace mantle and flicks a switch. A SONG\n          comes on, loud. It's a haunting tune, we recognize it.\n          St's the song Jake has been humming.\n          Kurt continues his fumbling, drunken attempts at rape, tearing\n          her hand out of his hair.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n           107. \n\n          CONTINUED: (3)\n\n          KURT\n\n          SHUT HER UP! USE YOUR JACKET OR\n\n          SOMETHING'\n          Adam lunges to the wall and tears down a sheet of the blts\n          plastic Duvateen. He races over to us with the sheet --\n          -- and everything turns blue. Now our sights and sounds aye\n          muffled and distorted through the blue plastic. We see the\n          image that has haunted Tom, the face of Kurt Damon, a blue\n          demon as he grapples on top of us.\n\n          IN TOM'S BASEMENT,\n          Tom is sprawled out beside the corpse, their hands locked\n          together. His color is cadaverous. He's suffocating. He\n          thrashes.\n\n          IN THE HOUSE,\n          back in Samantha's point of view, we struggle, we thrash, it\n          seems to go on forever. Slowly, the sounds become fainter and\n          fainter and fainter...\n          and everything stops. We hear the muffled voices of Kurt\n          and Adam SCREAMING at each other.\n          The sheet is ripped off. We stare up at them as Kurt and Adam\n          stand above us, chests heaving, revolted looks on their faces,\n          looking at us like we're a dog they just killed with their\n          car.\n\n          ADAM\n          Oh, my God.\n\n          KURT\n          What the fuck did you do that for?\n\n          ADAM\n          Is she dead?\n\n          KURT\n          No shit she's dead.\n\n          ADAM\n          Oh, my God.\n\n          KURT\n          Look at her tongue, man.\n\n          ADAM\n          I'm not here.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          108. \n\n          CONTINUED:\n\n          KURT\n          I never saw nobody dead before.\n          We start to fall back, and down, as if sinking into the floor.\n          Kurt and Adam grow taller, further away. Their voices fade.\n\n          ADAM\n          I wish I wasn't here.\n\n          KURT\n          It's fuckin' gross.\n\n          ADAM\n          This isn't happening.\n\n          KURT\n          Fuckin' plastic over her face. Good\n          thinkin', Adam.\n\n          ADAM\n          What do we do now?\n          Kurt and Adam are very far away, blobs of light at the end of\n          a black tunnel that's closing in around us. Just before\n          everything goes completely black --\n\n          INT BASEMENT NIGHT\n          Tom's fingers twitch open and his hand pulls free of\n          Samantha's. He opens his eyes and gulps air. The color\n          returns to his face as he pulls his hand away from hers.\n          But as he does so, he stops, staring intently at something in\n          her fingers. We don't see what it is.\n          Tom draws himself to his feet and climbs the ladder that leads\n          upstairs.\n          As he goes, we pause, looking between two rungs near the top\n          of the ladder. In the darkened crawl space under the rest of\n          the house --\n          -- a pair of eyes stare at us.\n          It's Kurt Damon. He twists around quickly and scoots back out\n          under the house, the way he came in.\n\n          EXT TOM'S HOUSE NIGHT\n          Under the front porch, a wood frame access panel lies on the\n          grass next to the foundation of Tom's house, where it has been\n          removed. Kurt Damon wriggles out from under the house and\n          comes onto the grass.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          109. \n\n          CONTINUED:\n          But the sound of the front door of Tom's house opening sends\n          him scurrying back into the shadows. TOM'S FEET come down the\n          steps and head off across the driveway.\n          A moment later, Kurt darts out from'his hiding place and\n          hurries across the street, toward his own house.\n          \"om, nearing the front steps of Frank's house next door,\n          thought he heard something. He turns back, but Kurt is gone.\n          Tom climbs the steps to Frank's house. Bouquets of flowers\n          have been left here and there on the steps, along with a few\n          candles and handwritten signs -- \"Hang in there, Adam,\" \"We\n          Love You,\" that sort of thing.\n\n          ON FRANK'S FRONT PORCH,\n          Tom knocks on the front door. A moment later, Frank opens it.\n          He looks devastated, shell-shocked, his eyes sunken from\n          crying. He's wearing a red shirt we've seen before.\n\n          TOM\n          How's he doin'?\n          Frank shrugs. Can't talk much.\n\n          FRANK\n          He might make it. Might not.\n          Sheila's over there now, I'm headed\n          back.\n\n          TOM\n          Frank, I'm sorry. I'm sorry\n          because... I think I know why Adam\n          shot himself. And I have to call the\n          police about it. But I don't want you\n          to hear it from them, I don't want\n          Sheila to read it in the paper. You\n          have the right to know before anybody\n          else.\n\n          FRANK\n          What are you talking about?\n\n          TOM\n          Come with me.\n          He nods toward his own house. Frank stares at him,\n          frightened, but what could possibly be worse than what's\n          already happened?\n\n          FRANK\n          Hang on a second.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n          no. \n\n          CONTINUED:\n          He turns and heads into the house. A few moments later he\n          reappears, carrying his jacket.\n          Tom leads him across the driveway. The Damon house is visible\n          across the street. One by one, the 'lights flick on in its\n          windows.\n          Tom doesi.'t see. He and Frank reach the steps of his house\n          and start up.\n          FRANK (cont' d)\n          This better be important.\n          Tom doesn't answer, just opens the door and gestures for Frank\n          to go first.\n\n          INT DAMON GARAGE NIGHT\n          In the Damon garage, HANDS scramble frantically through\n          drawers and come up with a handgun. Now the hands find a box\n          of bullets, shake them out onto a workbench.\n          The hands load the gun.\n\n          INT TOM & MAGGIE'S HOUSE NIGHT\n          Tom closes and locks the front door. Frank looks at him ---\n          well?\n          Tom leads him toward the dining room.\n\n          INT DAMON HOUSE NIGHT\n          In the Damon house, the same hands pull on a pair of leather\n          gloves. The gloved hands screw the top off a bottle of\n          bourbon, raise the bottle to lips that drink heavily.\n\n          INT DINING ROOM NIGHT\n          Frank reacts to the ruined dining room. He looks at Tom.\n\n          FRANK\n          What the hell is goin' on around here?\n          Tom goes to the trap door and lowers himself halfway through.\n          Frank follows.\n\n          INT DAMON HOUSE NIGHT\n          The gloved hands carry the bottle of bourbon into the Damon\n          living room, still under construction. The hands raise the\n          bottle and offer it --\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          113. \n\n          CONTINUED:\n          -- to Kurt Damon. Harry, his father, is the one wearing the\n          gloves. Kurt looks terrified.\n\n          HARRY\n          Drink up. You got this'started,\n          you're God damn well gonna help finish\n          it.\n          Kurt takes the bottle and drinks. He starts to lower it, but\n          his father forces him to drink more, and more, until he nearly\n          retches.\n\n          INT TOM'S BASEMENT NIGHT\n          Tom and Frank stand on opposite sides of the grave, staring\n          down at the corpse of Samantha Muller. Frank is horrified.\n\n          FRANK\n          How did you find this?\n\n          TOM\n          Does it matter?\n\n          FRANK\n          You don't know it was Adam and Kurt.\n\n          TOM\n          It was.\n\n          FRANK\n          But there's nothing to... you're\n          talking like a nut, that's what people\n          will say. This is just a body, it\n          doesn't prove anything.\n\n          TOM\n          No, it doesn't.\n          He bends down and lifts Samantha's lifeless hand. He pries\n          open her fingers.\n          She's clutching a tuft of hair.\n          TOM (cont' d)\n          But this probably will.\n          Frank stares for a long moment, struck dumb. Finally, he\n          turns his back. His shoulders heave as he cries, silently.\n\n          EXT OUR BLOCK NIGHT\n          In the misty night, the figures of Harry and Kurt Damon come\n          out of their house and skulk across the street, toward Tom's.\n\n          \n\n          \n\n          \n\n          \n\n           112. \n\n          EXT ROAD INTO TOWN NIGHT\n          Maggie drives, as fast as she can. Up ahead, red lights flash\n          and gates fall in front of a set of railroad tracks. Train\n          coming. Cars are stopped, waiting for it.\n          Maggie pulls to a stop at the back of the line --\n          -- then thinks better of it. She drops the car in gear, hauls\n          it around the others, and bolts for the tracks. The train,\n          nearly upon her, BLARES its horn.\n          Maggie flies across the tracks and SLAMS through the gate on\n          the other side, a split-second before the train HURTLES\n          through the intersection behind her.\n          She cuts it hard to the right to miss the waiting cars on the\n          other side, and pulls it back on the road.\n          She drives on, shaking like a leaf.\n\n          INT BASEMENT NIGHT\n          Frank is still sobbing, his back to Tom. Tom takes a step\n          toward him, to comfort him.\n\n          TOM\n\n          FRANK-\n\n          FRANK\n          I mean...\n\n          TOM\n          Frank, we have to-\n\n          FRANK\n          I mean, what were we supposed to do?\n          Tom stops.\n          FRANK (cont' d)\n          The kids come to us, she's already\n          dead, the damage is done, there's\n          nothin' gonna bring her back. But\n          those boys, they've got everything\n          ahead of them.\n          Frank lets his jacket drop to the floor, revealing his right\n          hand.\n          He's holding the 38 with the carved white handle.\n           He turns and looks at Tom.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          113. \n\n          CONTINUED:\n          FRANK (coast' d)\n          What were we supposed to do? Send our\n          boys to jail for the rest of their\n          lives? Our own flesh and blood? Over\n          her?\n\n          E3 T HOUSE NIGHT\n          Hairy and Kurt Damon reach the front steps of Tom's house.\n          They look up and down the block. There's no one out. No one\n          to see.\n\n          INT BASEMENT NIGHT\n          Frank still has the gun hanging at his side, tears streaming\n          down his cheeks.\n\n          TOM\n          Who you planning to shoot with that?\n\n          FRANK\n          Who do you think?\n\n          TOM\n          I think you haven't decided yet.\n          He's right, and Frank knows it.\n\n          FRANK\n          Get out of here.\n\n          TOM\n          What are you gonna do, Frank?\n          Frank raises the gun, in a fury.\n\n          FRANK\n\n          I BEEN LIVIN' WITH THIS FOR ALMOST A\n\n          YEAR, YOU THINK ANYTHING YOU SAY IS\n\n          GONNA MAKE ONE BIT OF DIFFERENCE TO\n\n          ME?! GET THE FUCK OUT OF HERE!\n\n          TOM\n          Frank, I won't go until you-\n          Frank aims the gun just to the left of Tom's head and pulls\n          the trigger. The bullet CRACKS off the ladder.\n\n          FRANK\n\n          GET OUT! GET OUT!\n          Tom starts up the ladder.\n\n          \n\n          \n\n          \n\n          \n\n           114. \n\n          INT DINING ROOM NIGHT\n          Tom crawls out the trap door and hurries out of the dining\n          room.\n\n          INT LI\"ING ROOM NIGHT\n          Tom races ak. ross the living room, scoops hi: truck keys off\n          the desk, opens the front door --\n          and finds himself face to face with Harry Damon and his son\n          Kurt. Harry SLUGS Tom in the face with the butt end of the\n          gun.\n          Tom falls to the floor, moaning. They step inside, quickly\n          closing the door behind them. They don't speak.\n          Kurt starts to drag Tom, who is still stunned, across the\n          living room floor. Harry pulls a folded sheet of blue plastic\n          from inside his jacket and spreads it out on the carpet.\n          Kurt drags Tom into the middle of the plastic and drops him\n          there. Tom is staring up at them, starting to regain his\n          senses.\n\n          KURT\n\n          DON'T LOOK AT ME!\n\n          HARRY\n\n          ROLL HIM OVER!\n          Kurt does. Tom, regaining his strength, starts to struggle,\n          but Kurt puts his knee in the middle of. Tom's back and pulls\n          his head back.\n          Kurt is blubbering, hysterical.\n          HARRY (con t' d)\n\n          SHUT THE FUCK UP!\n          Harry pulls the gun from his belt and raises it, putting it to\n          the back of Tom's head.\n          But then he lowers it, his hand shaking so hard he can barely\n          hold onto it. He works up his nerve --\n          HARRY (cont'd)\n\n          AHHHHHH!!\n          -- raises the gun again, puts it to the back of Tom's head,\n          cocks it --\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          115. \n\n          CONTINUED:\n          and a spray of headlights splashes across the far wall of\n          the room.\n          Nobody moves.\n          Outside, they hear k car pull into the driveway and park. The\n          engine shuts off.\n          Kurt looks at his father, panicked.\n          Harry looks down at Tom.\n          Tom closes his eyes and prays.\n\n          EXT DRIVEWAY NIGHT\n          Maggie-pulls the keys from the ignition and gets out of the\n          car. She walks toward the house, looking anxiously around the\n          neighborhood.\n          As she reaches the steps, the light in the living room window\n          abruptly clicks off.\n          She stops.\n          She starts forward again, slowly. Now the porch light clicks\n          off.\n          It's real dark.\n          Maggie digs the car keys out of her pocket and feels for\n          something on the key chain. Something that's not there.\n\n          MAGGIE\n          Mace... shit.\n          She starts up the stairs. She reaches the top. The last\n          light that was on inside clicks off. Now the house is totally\n          black inside.\n          Remembering something, she pulls her purse around and feels\n          inside it. She finds the butterfly knife, the one she found\n          in Tom's pants. She holds it in her left hand, keys in her\n          right.\n          She goes to the door. She unlocks the deadbolt.\n          Inside, she hears a SCURRYING sound.\n          She unlocks the knob.\n          She puts the keys back in her purse.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          116. \n\n          CONTINUED:\n          She switches the knife to her right hand, keeping it closed,\n          concealed.\n          She opens the door.\n\n          INT LIVING ROOM NIGF.T\n          The room is pitch black, so b:Aggie leaves the door hanging\n          open. Some light spills in from the street.\n\n          MAGGIE\n          Tom?\n          No answer. She steps inside and fumbles for a light switch.\n          She flicks it. Nothing happens.\n          MAGGIE (cont' d)\n          Are you here?\n          She crosses the room to another light and CLICKS its switch.\n          As the light floods the room:\n          Harry, who was hiding behind the front door, BANGS it shut.\n          Kurt Damon is still kneeling on Tom's back, holding one hand\n          roughly over his mouth, trying to keep him quiet.\n          MAGGIE (cont'd)\n\n          WH-\n          Harry raises the gun in his hand and points it at Maggie.\n          She lunges toward Tom, but Harry grabs her by the arm and\n          flings her roughly to the ground.\n          Tom takes advantage of the moment to flip Kurt off his back.\n          As the kid flies, Harry whirls, training the gun on Tom.\n\n          HARRY\n\n          DON'T MOVE!\n          But Tom tries to scramble to his feet. Harry starts to\n          squeeze the trigger --\n          -- and SCREAMS in agony.\n          Looking down, he sees Maggie has plunged the knife into his\n          thigh. She rips it out and plunges it in again. Harry's arm\n          flies up, the gun goes off, and the bullet RIPS through the\n          ceiling.\n\n          \n\n          \n\n          \n\n          \n\n          INT JAKE'S ROOM NIGHT\n          On the second floor, in Jake's bedroom (which Jake is not in)\n          the bullet CRACKS up through the floorboards, tears through\n          his mattress, and bursts through the little boy's pillow.\n          The pillow explodes in a cloud of fea-hers, which fly\n          everywhere.\n          Feathers everywhere.\n\n          INT LIVING ROOM NIGHT\n          Tom crawls over to Maggie and grabs hold of her, putting\n          himself between her and Harry, who still has the gun.\n          Over at the fireplace, Kurt Damon pulls the poker out of its\n          holder.\n          Harry aims the gun.\n          Kurt lunges forward with the poker.\n\n          BANG! BANG!\n          Two shots ring out from the doorway to the dining room. Harry\n          clutches his chest and drops to the floor.\n           They all turn. Frank stands in the doorway to the dining\n          room, clutching his 38. Kurt rushes toward him, SCREAMING,\n          poker raised high.\n          Frank pulls the trigger two more times.\n          Kurt goes down.\n          Maggie SCREAMS. Tom huddles over her.\n          Frank lets the weapon slip from his fingers. It hits the\n          hardwood with a CLATTER.\n          Tom and Maggie look up. Frank looks at them. In that red\n          shirt, he is exactly the image Tom saw of him in his dream.\n\n          FRANK\n          They were gonna kill you, Tommy. You\n          and Maggie both.\n          Frank turns and walks to the front door. He opens it, walks\n          out onto the porch, and sits down on the top step, facing the\n          street.\n          Tom looks at Maggie. They're both in shock, can hardly speak.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          118. \n\n          CONTINUED:\n\n          TOM\n          You... okay?\n          Maggie nods, shaking.\n          TOM (cont' d)\n          You saved me. Baby, I'm alive be;ause\n          of you...\n          They hold each other.\n\n          EXT FRONT PORCH NIGHT\n          Tom comes out of the house. Frank, sitting on the top porch\n          step, makes no attempt to flee. Tom sits down beside him.\n          From all around the block, voices are starting to rise up --\n          \"Did you hear that?\" \"What the hell?!\" \"Somebody call a\n          cop!\" Frank shakes his head.\n\n          FRANK\n          Cold-blooded murder. I can't let\n          something like that happen. Not here.\n          He looks at Tom.\n          FRANK (con t' d)\n          This is a decent neighborhood.\n          A few tentative faces gather across the street, staring at\n          Tom's house, wondering what the hell. A SIREN wails in the\n          distance.\n\n          TOM\n          I thought so, Frank. I sure as hell\n          always thought so.\n\n          DISSOLVE TO:\n\n          INT HOSPITAL CORRIDOR DAY\n          A NEWBORN BABY stares up at us from inside a rolling bassinet.\n          The bassinet is wheeled swiftly down a hospital corridor by a\n          NURSE. It's a long trip, wherever it's going, but the baby\n          waits patiently, staring up at the ceiling, eyes open.\n          Above the baby, the lights streak by, white blurs.\n          The Nurse leans down and looks at the baby. To the baby,\n          she's just a fuzzy blob.\n\n          NURSE\n          Almost there!\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          119. \n\n          CONTINUED:\n          The baby turns and looks sideways. The doors of the hospital\n          rooms whiz by, brown smears.\n          NURSE (cont' d)\n          Just around this corner!\n          She rolls the bassinet around a corner and toward one or in\n          particular.\n          The baby sees a bunch of shapes inside the room.\n\n          INT HOSPITAL ROOM DAY\n          Maggie, who has recently given birth, struggles to sit up in\n          bad as the Nurse rolls the bassinet into the room. Tom,\n          grinning, gets up from the chair he's sitting in with Jake.\n\n          NURSE\n          Meet the family!\n          She picks up the baby and holds her out to Maggie, who takes\n          her eagerly.\n\n          MAGGIE\n          Hi, baby, did you sleep well? I sure\n          didn't.\n          The baby sees Maggie's face, blurry, but friendly.\n          Tom leans in.\n\n          TOM\n          So you're the one that's been kicking\n          my wife!\n          The baby sees Tom's blurry face. Jake steps up, onto a step\n          stool, so he can see over the edge of the bed.\n\n          JAKE\n          Let me see, let me see!\n          Maggie turns the baby so she's facing Jake. The infant looks\n          at her older brother. At first, his face is as blurry as\n          everybody else's. But slowly, Jake's face becomes crystal\n          clear, even though everything around him stays out of focus.\n          JAKE (cont' d)\n          Can I hold her?\n\n          MAGGIE\n          If you're very, very careful. Climb\n          up here.\n\n          (CONTINUED)\n\n\n          \n\n          120. \n\n          CONTINUED:\n          Jake climbs up on the bed. Maggie puts some pillows around\n          him and carefully places the baby in his lap. Jake looks down\n          at the infant. His expression becomes very serious. Gently,\n          he reaches out with one hand and puts his fingertips on the\n          baby's forehead, the same way he did to Tom's forehead that\n          first night.\n          The baby and Jake stare at each other for a long moment. So\n          long, in fact, that the adults become uncomfortable.\n\n          NURSE\n          Well, they... certainly get along,\n          don't they?\n          Suddenly, Jake breaks into a wide grin and looks up at his\n          parents, thrilled. Then he looks back at his sister. He\n          leans down and whispers softly in her ear.\n\n          JAKE\n          Don't be afraid of s t.\n          Tom and Maggie look at each other.\n\n\n          FADE OUT          \n \n\n\n\n\n\nStir of Echoes\nWriters :   David Koepp  Richard Matheson\nGenres :   Thriller  Horror  Mystery\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:36:31.887310"}