{"title": "Surfer King, The", "film_link": "/Movie Scripts/Surfer King, The Script.html", "script_link": "/scripts/Surfer-King,-The.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Surfer King, The Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Surfer-King,-The.jpg\" title=\"Surfer King, The Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Bernard Murray Jr\" title=\"Scripts by Bernard Murray Jr\">Bernard Murray Jr</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/><br/>\n<b>Script Date</b> : April 2004<br/>\n<b>Movie Release Date</b> : January 2006<br/>\n<br/>\n<a href=\"/scripts/Surfer-King,-The.html\">Read \"Surfer King, The\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n\n<b>                                      THE SURFER KING\n</b>\n\n\n\n                                         Written by\n\n                                      Bernard Murray Jr\n\n\n\n\n<b>                                                                       5/25/04\n</b>\n             Page 1 of 81\n\n\n<b>               THE SURFER KING\n</b>\n<b>       1       EXT. EARLY MORNING. - CUSTOMER SERVICE KIOSK                          1\n</b>\n               JAFFA, a Jamaican looking fellow in his early 20's, arrives\n               at Water World, carrying a dusty cardboard box.\n\n               There are a few workers milling about, setting up the park\n               for opening. He passes EDDIE, a 25-something grounds worker\n               with Down's Syndrome.\n\n<b>                                     JAFFA\n</b>                         Eddie!\n\n<b>                                   EDDIE\n</b>                             (smiling, nodding)\n                         Jaffa.\n\n               They do a hand slap maneuver that they have obviously worked\n               out some time in the past. JAFFA proceeds up to the Customer\n               Relations Kiosk, plops the box on the counter, and enters the\n               kiosk. We see him open the box, it is full of CD's.\n\n               He pulls winter covers off of an overhead area to reveal a CD\n               player and amplifiers. He starts pushing buttons he's pushed\n               a thousand times, and lights come on. He pulls down a\n               microphone, and clicks a button to see if it works.\n\n               He reaches into the box of CDs and pulls one out. We see it\n               is Sheryl Crow. He gets the CD, examines it, and pops it\n               into the CD player.\n\n               He once again picks the microphone and flips the switch as he\n               pushes the \"play\" button on the CD player.\n\n               His voice echoes through the park.         \"Soak up the Sun\" begins\n               playing.\n\n<b>                                   JAFFA\n</b>                             (smiling)\n                         Ladies and Gentlemen, Water World will be\n                         open in\n                             (checking his watch)\n                         twenty-six hours and forty-three minutes.\n\n<b>               GFX - OPENING CREDITS BEGIN\n</b>\n<b>       2       EXT EARLY MORNING - THUNDER BAY                                    2\n</b>\n               BIG MIKE, the park's owner/manager - a 50-something man who\n               is portly and bald, and RICHARD THOMPSON, head lifeguard and\n               another GUARD are on the east side of Thunder Bay.\n\n               There is a post with a box on top of it that has a winter\n               cover on it. The GUARD is standing there with a garden hose\n\n\n\n\n<b>\n</b>                                                                   Page 2 of 81\n\n               holding it so the water goes into Thunder Bay.\n\n               He is obviously tired, and has been standing there a long\n               time. We look back at the massive size of the pool and get\n               the joke.\n\n               BIG MIKE and RICHARD pull off the winter cover. The GUARD\n               turns to look and the hose turns with him, getting BIG MIKE\n               wet. They object and he turns back to filling Thunder Bay.\n               RICHARD moves the GUARD to a safe distance.\n\n               BIG MIKE blows the dust off of the box at the top of the\n               post, and we see it is a large push button. BIG MIKE looks\n               at RICHARD who nods \"go ahead\" and then pushes the button.\n\n               They both draw back as if something big should happen, but\n               nothing. They look at each other and BIG MIKE motions for\n               RICHARD to go over to the wall housing the wave tank for the\n               pool.\n\n               RICHARD waves OK, and BIG MIKE pushes the button again. When\n               nothing happens, RICHARD whacks the side of the tank with his\n               closed fist. Suddenly a huge wave rolls out.\n\n               Nodding his approval, BIG MIKE checks off an item in his\n               clipboard.\n\n<b>       3       EXT. EARLY MORNING. - DAY   SURFS UP AREA                       3\n</b>\n               We see people working to open the park. The VAIL PRECISION\n               LAWN CHAIR DRILL TEAM dressed in Water World uniforms is\n               setting and arranging chairs in time to the music. They\n               perform precision maneuvers with the chairs, as if rifles,\n               and cross each other in a timed march to the music.\n\n<b>       4       EXT. EARLY MORNING. - DAY   FUN HOUSE AREA                      4\n</b>\n               BIG MIKE is standing under the Fun House structure with a\n               clipboard. He is talking to RICHARD.\n\n               After talking to BIG MIKE, RICHARD shakes his head\n               affirmatively and walks off. He glances up to the two guards\n               above, and grins. BIG MIKE is looking at his clipboard. We\n               see quickly the large water tank above is spilling water a\n               bit, indicating it is full.\n\n               The water tank spills over BIG MIKE drenching him. He stands\n               there still, angry for a moment, then thinks better of it\n               shaking his head and smiling, takes his pen and checks OK on\n               his wet clipboard for the fun house water tank.\n\n<b>       5       EXT. EARLY MORNING. - DAY   FIRST AID SHACK NEAR FUNHOUSE       5\n</b>\n               Two guards are looking down at BIG MIKE below. One guard\n               begins motioning as if guiding a crane into place. The other\n               guard has his hand poised on a large switch lever.\n\n               GUARD ONE is gesturing more emphatically now, closing his\n               hands to indicate \"almost there\". He closes his hands, and\n               GUARD TWO pulls the lever.\n\n\n\n\n<b>\n</b>Page 3 of 81\n\n\n<b>       6       EXT. LATER THAT MORNING - DAY   2001 VW BUG                     6\n</b>\n               We are on the road to Water World in Federal Heights,\n               Colorado. ROBBIE ZIRPOLLO is riding with his mother CONNIE\n<b>               ZIRPOLLO.\n</b>\n<b>                                  ROBBIE\n</b>                            (sardonically)\n                        Yeah. This is great. I love this plan.\n                        Drag me kicking and screaming from my\n                        happy home in California to some weird\n                        place in Colorado, and say hey, this'll\n                        be fun Robbie. Maybe we can go\n                        camping....\n\n<b>                                   CONNIE\n</b>                         Look, I know you're not happy about this.\n                         But it wasn't my idea for your father to\n                         have some kind of mid-life crisis and\n                         disappear with his secretary to Mexico\n                         with our life savings.\n\n<b>                                   ROBBIE\n</b>                         \"Administrative Assistant.\" There's no\n                         such thing as a secretary anymore.\n\n<b>                                  CONNIE\n</b>                        Fine. Administrative Assistant. We\n                        couldn't afford to sit around waiting any\n                        longer to see if he was coming back. I\n                        was able to land a good job here. And\n                        now thanks to Uncle Bernie you have this\n                        job at the Water Park...\n\n<b>                                   ROBBIE\n</b>                             (shaking his head)\n                         Grounds crew. What kind of job is that?\n                         It sound like the guy who cleans out the\n                         coffee pots.\n\n<b>                                  CONNIE\n</b>                        Bernie says you help keep the park clean,\n                        sweep up, that sort of thing.\n                        I'm sure it won't be so bad. Besides, a\n                        lot of the kids who work at this park go\n                        to the same high school you'll be going\n                        to. You can start the school year with\n                        some ready-made friends.\n\n<b>                                   ROBBIE\n</b>                         I had friends in Oceanside. I had\n                         something to do for the summer.\n\n               They pass the main Water World sign.    Hanging below it is a\n               banner that says Opening Tomorrow!.\n\n<b>                                  CONNIE\n</b>                        Hanging out at the beach surfing with\n                        your friends is not my idea of something\n\n\n\n\n<b>\n</b>Page 4 of 81\n\n                         to do. This way you'll make some money\n                         and meet people here. You'd best get\n                         used to it. This is where we live now.\n                         We're staying.\n\n<b>                                   ROBBIE\n</b>                         All thanks to Dad and his secretary.\n\n<b>                                   CONNIE\n</b>                         Administrative Assistant.\n\n<b>                                     ROBBIE\n</b>                         Whatever.    Some summer....\n\n               They have arrived at the front gates of Water World, Kids\n               are in a line leading to a check-in canopy kiosk that has a\n               sign saying Employee Check In.\n\n<b>                                   CONNIE\n</b>                         Promise me you'll give it a\n                         try....please?\n\n<b>                                   ROBBIE\n</b>                             (giving in to the inevitable)\n                         I will. I promise. See you later\n\n               He shuts the car door and walks over to the end of the line.\n\n<b>       7       EXT. EARLY MORNING. - DAY FRONT GATES OF WATER WORLD            7\n</b>\n               There are about 40-50 teenagers in various default street\n               clothes, shorts and tees mostly. Robbie takes his place in\n               line behind an older, taller boy, ALEX, who seems to know\n               almost everyone, and has made it his personal mission to\n               greet them.\n\n<b>                                   ALEX\n</b>                             (back still to ROBBIE)\n                         ...and so SHE says I'll have the filet\n                         AND the lobster\". I had to borrow twenty\n                         bucks from Fitzgerald just to get out of\n                         the restaurant.\n\n               Two guys in front of Alex are laughing now.     Further down the\n               line however, another voice pops up.\n\n<b>                                   DOUG\n</b>                             (waving to ALEX)\n                         By the way. Where is that twenty bucks?\n\n<b>                                  ALEX\n</b>                            (avoiding)\n                        Ohhh, hey Dougie. I'll catch up with you\n                        later...\n                            (turning around to ROBBIE as\n                             not to continue the\n                             conversation)\n                        Hey, how you doin'? Haven't seen you\n                        before.\n\n\n\n\n\n<b>\n</b>Page 5 of 81\n\n               ALEX looks in his wallet, as do we.    It is empty.\n\n<b>                                   ROBBIE\n</b>                             (nodding)\n                         I'm Robbie. Robbie Zirpollo.\n\n<b>                                     ALEX\n</b>                        I'm Alex.     Where you workin'?\n\n<b>                                   ROBBIE\n</b>                         I believe it's with the Grounds Crew?\n\n<b>                                  ALEX\n</b>                        What's the matter, can't swim?\n\n<b>                                   ROBBIE\n</b>                             (surprised)\n                         I can swim. Why?\n\n<b>                                   ALEX\n</b>                         Well, you look old enough to be a guard.\n\n<b>                                     ROBBIE\n</b>                        Almost 16.     I get my license in\n                        September.\n\n<b>                                  ALEX\n</b>                        It's just that most of the guys on\n                        grounds are a little younger than you.\n                        Most guys your age that can swim are\n                        guards.\n\n<b>                                  ROBBIE\n</b>                        Well, I just moved here. I guess I\n                        missed guard tryouts. You're a guard\n                        then?\n\n<b>                                  ALEX\n</b>                        Oh, no no no. I work concessions...at\n                        Aokee's Surf and Snack Shack. It's just\n                        as well. The guards are mostly stuck up\n                        anyway. The rest of us are the ones who\n                        know how to have fun.\n\n<b>                                   ROBBIE\n</b>                         Can't swim, huh?\n\n<b>                                  ALEX\n</b>                            (smiling)\n                        Nope.\n\n<b>                                  ROBBIE\n</b>                            (listening to speaker on post\n                             above)\n                        What is that?\n\n<b>                                  ALEX\n</b>                            (mimicking his perception of\n                             surfers)\n                        Surf tunes, dude!\n\n\n\n\n<b>\n</b>Page 6 of 81\n\n                            (back to his own voice)\n                        You'll get used to it. You'll get to\n                        where you miss it. I had to buy two CD's\n                        just to get through the winter.\n\n               They are now at the front of the line. A teenage girl\n               MELISSA is sitting at the table with papers and a clipboard.\n\n<b>                                  ALEX (CONT'D)\n</b>                            (gesturing)\n                        Ahh. And here we have the fair Melissa,\n                        time clerk extraordinaire...\n\n<b>                                  MELISSA\n</b>                            (shaking her head no)\n                        Oh, Alex. Am I going to have to put up\n                        with your crap for another entire summer?\n\n<b>                                  ALEX\n</b>                            (looking upward toward the sky)\n                        Dear Melissa.\n                        There's nothing about our relationship\n                        that couldn't be fixed by us spending a\n                        few moments together in the pumphouse\n                        behind Thunder Bay.\n\n<b>                                   MELISSA\n</b>                         Yeah, well from what I hear, it would be\n                         a BRIEF few moments.\n\n<b>                                   ROBBIE\n</b>                             (wincing)\n                         Ouch.\n\n<b>                                  ALEX\n</b>                            (not missing a beat)\n                        My dear, you cut me to the quick. Check\n                        off my name and that of my amigo here,\n                        Mr. Robbie Zirpollo.\n\n<b>                                  MELISSA\n</b>                            (handing them cards)\n                        Fill out these emergency cards, and turn\n                        them in when you pick up your\n                        uniforms....\n                            (pointing)\n                        over there. And Alex?\n\n<b>                                   ALEX\n</b>                             (to ROBBIE)\n                         She wants me.\n                             (turning back to MELISSA)\n                         Yeeees?\n\n<b>                                  MELISSA\n</b>                            (finger pointing)\n                        This year, let's clock in only our OWN\n                        time card, shall we?\n\n<b>                                   ALEX\n</b>\n\n\n\n<b>\n</b>  Page 7 of 81\n\n                             (head shaking, to ROBBIE,\n                              walking together)\n                         Some people have no sense of humor.\n\n<b>       8       EXT. MORNING - MOMENTS LATER - OUTSIDE UNIFORM BUILDING         8\n</b>\n               ROBBIE and ALEX walk up to yet another line of about 4 or 5\n               teens. At the front a teenage girl and a teenage guy are\n               behind a counter and handing out uniforms based on a\n               clipboard list.\n\n               As ROBBIE and ALEX reach the back of the line, TIFFANY, a\n               blond beauty and two other girls brush past them to the front\n               of the line.\n\n<b>                                   ROBBIE\n</b>                             (taken aback, breathing in\n                              through his nose)\n                         Whoa....who was that?\n\n<b>                                   ALEX\n</b>                             (unimpressed, putting his hand\n                              on ROBBIE's shoulder as if to\n                              hold him back, like a horse\n                              that is riled up)\n                         Eeeaasy there, big fella. Not in your\n                         lifetime.\n                             (wistfully, glancing over)\n                         Or mine.\n\n<b>                                   ROBBIE\n</b>                         So who is she?\n\n<b>                                   ALEX\n</b>                         Miss Tiffany Maxwell, daughter of Big\n                         Mike Maxwell, owner and operator of this\n                         here fine water park.\n\n               WE SEE TIFFANY and her two friends are quickly given their\n               uniforms by the attendants, as they ignore the kids who have\n               waited in line.\n\n<b>                                   ALEX (CONT'D)\n</b>                         See, Princess Tiffany and her friends\n                         pretty much have the run of the park.\n                         Her boyfriend is Dan Peterson, a guy we\n                         all call Cowboy, one of the lifeguards.\n                         Pretty decent guy from what I can tell.\n                         But she's a piece of work. Your best\n                         strategy is to steer clear of her and she\n                         won't cause you any trouble.\n\n<b>                                   ROBBIE\n</b>                         Cowboy, huh. Big guy?\n\n<b>                                     ALEX\n</b>                         Big. Guy.\n\n<b>                                   ROBBIE\n</b>                             (takes in a deep breath)\n\n\n\n\n<b>\n</b>Page 8 of 81\n\n                         Hmm.\n\n               They are now at the front of the line.\n\n<b>                                   MALE UNIFORM GUY\n</b>                         Hey Alex.\n                             (calling back to FEMALE UNIFORM\n<b>                              PERSON)\n</b>                         Aokee's. Large.\n                             (to ROBBIE)\n\n<b>                                   MALE UNIFORM GUY (CONT'D)\n</b>                         Name?\n\n               Female Uniform Person has brought a blue Hawaiian shirt on a\n               hanger.\n\n<b>                                   ROBBIE\n</b>                         Rob Zirpollo. Uh, Robert Zirpollo\n\n<b>                                   MALE UNIFORM GUY\n</b>                             (looks on clipboard)\n                         Grounds?\n                             (looks at FEMALE UNIFORM\n<b>                              PERSON)\n</b>\n<b>                                   MALE UNIFORM GUY (CONT'D)\n</b>                             (and FEMALE UNIFORM PERSON,\n                              together, ominously)\n                         Grounds.\n\n               She disappears to the back.\n\n<b>                                   ROBBIE\n</b>                             (to ALEX)\n                         So what is this grounds thing, anyway?\n\n<b>                                   ALEX\n</b>                         Let's just say....you are critical and\n                         indispensable to the ongoing operation...\n                         and....flow of things here at the park.\n                             (he and MALE UNIFORM GUY\n                              exchange a knowing glance)\n\n<b>                                  FEMALE UNIFORM PERSON\n</b>                        Here you go, tiger. One grounds.\n                        Medium. You have a pair of green shorts\n                        at home?\n\n               ROBBIE shakes his head \"no\".\n\n<b>                                   FEMALE UNIFORM PERSON (CONT'D)\n</b>                         Buy some. Tonight. Wear them tomorrow\n                         along with this shirt. You need to\n                         report to the area just south of Surf's\n                         Up. Look for a guy wearing Army pants\n                         and glasses.\n\n<b>                                   ALEX\n</b>                         I'll show him. I'm going in that\n\n\n\n\n<b>\n</b>  Page 9 of 81\n\n                         direction.\n                             (to ROBBIE with feigned\n                              excitement)\n                         You get to meet The Colonel!\n\n               They walk off.   As they walk off we can hear ALEX in the\n               distance...\n\n<b>                                   ALEX (CONT'D)\n</b>                             (marching)\n                         Left. Left. Left right left.\n\n<b>       9       EXT. MORNING - MOMENTS LATER - AOKEE'S SURF &amp; SNACK SHACK       9\n</b>\n               Aokee's is a restaurant near Thunder Bay. It seats about 50\n               and is lavishly decorated in a Hawaiian Surf and Ocean motif,\n               with surf memorabilia, fish nets, surfboards, and the like.\n\n               AOKEE is a large 375 pound plus apparently Hawaiian man, late\n               twenties, early thirties, wearing a purple Hawaiian shirt,\n               blue shorts and a white chef's apron that says KISS THE COOK.\n\n               WE SEE him on a pay phone behind the counter.\n\n<b>                                  AOKEE\n</b>                            (to person on the line)\n                        David...how you do this to me? I have\n                        full staff with you. I save your spot.\n                        I was counting on you.\n                            (listens, nods)\n                        Yes, yes....but The Gap? What you think\n                        you do there? Are there girls in\n                        swimming suits? Have you forgotten?\n                            (listens, shaking head)\n                        Tips. Do you get tips? Cash money?\n                            (listens some more)\n\n               ALEX walks up.   AOKEE waves to him.   He is obviously upset.\n\n<b>                                   AOKEE (CONT'D)\n</b>                             (resigned)\n                         Well, come see us this summer, eh?\n                         You're a good kid...a good worker.     Yeah,\n                         you too.\n\n               AOKEE hangs up the phone.\n\n<b>                                    ALEX\n</b>                         Who....?\n\n<b>                                  AOKEE\n</b>                         David. Seems to think there is future in\n                         retail. Now what I do? I'm one person\n                         short. Park opens tomorrow.\n\n               AOKEE buries his head in his hands on the counter.\n\n<b>                                   ALEX\n</b>                             (thinking)\n                         You know...I just met a guy that's old\n\n\n\n\n<b>\n</b> Page 10 of 81\n\n                         enough to work here, but he's stuck in\n                         grounds.\n\n<b>                                   AOKEE\n</b>                             (perking up)\n                         Good guy?\n\n<b>                                   ALEX\n</b>                         Seemed like our kind of people.\n\n               AOKEE thinks for a moment. He glances up towards Surf's Up.\n               It hits both he and ALEX at the same time...\n\n<b>                                  AOKEE\n</b>                        We need to get him before he get his\n                        plunger!\n\n               They take off running.\n\n<b>     10        EXT. MORNING - MOMENTS LATER - TRAIL FROM AOKEE'S TO SURF'S10\n</b><b>               UP\n</b>\n               AOKEE and ALEX are running together. They get about 50 feet\n               before AOKEE, large man that he is, runs out of breath.\n               ALEX, like a boxer in training, sort of runs in place,\n               keeping loose, ready for AOKEE to catch his wind. Off they\n               go again, get another 50 feet, and the same thing happens.\n\n<b>                                    AOKEE\n</b>                             (out of breath)\n                         Alex......\n                             (wheeze)\n                         ..you got to go ahead...\n                             (wheeze)\n                         ...stall 'til I get there.\n\n<b>                                     ALEX\n</b>                               (nodding, running in place)\n<b>                         OK.\n</b>\n               ALEX takes off, and AOKEE runs again....\n\n<b>     11        EXT. MORNING - MOMENTS LATER - SURF'S UP WAVE POOL SOUTH          11\n</b>\n               WE SEE several rolling trash cans lined up in a row, along\n               with several janitorial carts filled with cleaning utensils\n               and supplies.\n\n               THE COLONEL is standing, dressed in army fatigue pants and a\n               Water World golf shirt, with a green Water World baseball\n               cap. He is wearing black horn-rim glasses, thick lenses, and\n               carrying a clipboard.\n\n               Lined up as if an army unit are ten grounds kids, including\n               ROBBIE, who is sixth furthest from THE COLONEL. They are all\n               younger than ROBBIE except one, EDDIE, whom we met at the\n               beginning of the film.\n\n               EDDIE is standing tall and straight, proud to be there.      He\n               is nearest THE COLONEL\n\n\n\n\n<b>\n</b>    Page 11 of 81\n\n\n<b>                                   THE COLONEL\n</b>                             (looking up from clipboard)\n                         Well, it looks like we have a good staff\n                         here. Yes...yes a good staff. It will be\n                         an excellent summer. Remember as we go\n                         through training today, our park is\n                         judged by the work WE do. If we do it\n                         well, the people come back.\n                             (walking up and down the line)\n                         We have a little tradition here on the\n                         grounds crew. Rather than having to\n                         learn a lot of names, many of which I can\n                         never hope to pronounce properly, each\n                         grounds crew member gets a grounds crew\n                         nickname. You will be known by that\n                         nickname in every way except, of course,\n                         your paycheck and employee records.\n\n               THE COLONEL looks over his paperwork.\n\n<b>                                   THE COLONEL    (CONT'D)\n</b>                         Let's see, what do we    have? Hmm...yes.\n                         OK, first up is Eddie    Cochran. Your\n                         grounds crew nickname    will be.....Eddie!\n\n               EDDIE smiles knowingly. This has been his grounds crew\n               nickname for the last 8 years, mostly because he would never\n               answer to anything else, and THE COLONEL gave up trying.\n\n<b>                                   THE COLONEL (CONT'D)\n</b>                         Now crewmembers, listen up. Eddie here\n                         has eight years experience on the grounds\n                         crew. Why, I'd like to think there isn't\n                         anything, any situation that Eddie hasn't\n                         faced. Listen to him. Learn from him.\n                         Watch what he does. This man is the\n                         finest, most conscientious grounds\n                         crewman we've ever had.\n\n               EDDIE is beaming with pride now. THE COLONEL pulls a brand\n               new toilet plunger from the cart nearby and hands it to\n               EDDIE. EDDIE shoulders it as if it were a rifle.\n\n               THE COLONEL walks down the line.\n\n<b>                                   THE COLONEL (CONT'D)\n</b>                         Let's see...Clark? Hmmm. Your grounds\n                         crew nickname will be....Sparky.\n\n               It is all ROBBIE can do not to laugh. THE COLONEL goes on to\n               the next kid, SKEETER who is tall, skinny and goofy-looking.\n               SKEETER'S eyes are faced forward, but something catches them.\n               His eyes follow an unseen object as we begin to hear a small\n               mosquito. Finally his eyes follow it until he looks, cross\n               eyed at his own nose.\n\n               THE COLONEL has taken note of this and is following it too.\n               SKEETER can take no more, and brushes it off his nose as he\n               makes a face.\n\n\n\n\n<b>\n</b>    Page 12 of 81\n\n\n<b>                                   SKEETER\n</b>                         Sorry, sir. Mosquito.\n\n<b>                                   THE COLONEL\n</b>                         Hmmm.....your grounds crew nickname will\n                         be.....Skeeter.\n\n               THE COLONEL steps over the cart and gets another new plunger\n               and hands it to SKEETER who follows EDDIE's lead.\n\n               Next in line is a short, chubby lad, SNITCH. As THE COLONEL\n               approaches him, a quick sound of passing gas is heard.\n\n               THE COLONEL is startled, and SNITCH makes a quick finger\n               motion indicating the culprit is SKEETER, next to him.\n\n<b>                                   THE COLONEL (CONT'D)\n</b>                             (looking at the clipboard)\n                         Bradley, is it? OK, Mr. Bradley.....your\n                         grounds crew nickname will be Snitch.\n\n               SNITCH shows his dismay with a frown. THE COLONEL has run\n               out of new plungers already and is forced to move to one of\n               last year's leftovers, which look somewhat depressing.\n\n               He gets one and give it to SNITCH, who looks at it, makes a\n               face, and decides not to shoulder it. ROBBIE is so depressed\n               he looks like he's about to pass out.\n\n               His worst fears have been realized.    His summer is passing\n               before his eyes.\n\n               There's only one more person, a young 14 year-old girl, to go\n               before ROBBIE. THE COLONEL addresses her.\n\n<b>                                   THE COLONEL (CONT'D)\n</b>                         Melinda Tally. Hmmm... your grounds crew\n                         nickname will be...\n                             (thinking)\n\n               Suddenly ALEX bursts onto the scene, and even he, at this\n               point, is somewhat out of breath.\n\n<b>                                   ALEX\n</b>                         Hello, Colonel!\n\n<b>                                   THE COLONEL\n</b>                             (thinking, staring)\n                         Alex, isn't it?\n\n<b>                                   ALEX\n</b>                         Yes sir, Colonel. And what a fine staff\n                         you've assembled this year. Have you\n                         told them yet about your army background?\n\n<b>                                   THE COLONEL\n</b>                         Well, no, I didn't think it was..\n\n<b>                                   ALEX\n</b>\n\n\n\n<b>\n</b>    Page 13 of 81\n\n                            (interrupting, to the grounds\n                             kids)\n                        The Colonel here is very modest. Did you\n                        know that he reorganized the entire\n                        process of cleaning and sanitizing an\n                        army barracks and its latrines?\n\n<b>                                   THE COLONEL\n</b>                         Well, it really wasn't much of a...\n\n<b>                                   ALEX\n</b>                             (interrupting again)\n                         Wasn't much?\n                             (again, to grounds kids)\n                         Can you just imagine for a moment the\n                         germs and bacteria our American soldiers\n                         could pick up in an unsanitised army\n                         latrine? It's impossible to determine\n                         just how many lives have been saved\n                         thanks to the efforts of this one humble\n                         Army Colonel.\n\n<b>                                   THE COLONEL\n</b>                         Well, I suppose when you put it that\n                         way...\n\n<b>                                   ALEX\n</b>                             (to the grounds kids)\n                         I, too, came up through the ranks when at\n                         age 14, I began my service here at Water\n                         World learning from this great man.\n\n<b>                                  THE COLONEL\n</b>                        Yes....I remember now.....what was your\n                        grounds nickname...?\n\n<b>                                  ALEX\n</b>                        Not even sure I remember it myself, sir.\n                        But I remember much more. Did you tell\n                        them about the film?\n\n<b>                                   THE COLONEL\n</b>                         Film?\n\n<b>                                  ALEX\n</b>                            (to THE COLONEL)\n                        \"Hygiene Makes You Happy\"\n                            (to the grounds kids)\n                        Every enlisted man in the army has seen\n                        it. Some by choice. All from the mind\n                        of The Colonel here...\n\n<b>                                   THE COLONEL\n</b>                             (to himself)\n                         I never forget a grounds nickname....\n\n               AOKEE has finally made it now, but is, of course, out of\n               breath again.\n\n<b>                                   THE COLONEL (CONT'D)\n</b>\n\n\n\n<b>\n</b>    Page 14 of 81\n\n                            (concerned)\n                        Aokee, good God, man...are you OK?\n\n               AOKEE gestures he is fine, and does a combination of charades\n               and Hawaiian pantomime before he finally speaks.\n\n<b>                                   AOKEE\n</b>                         Colonel....terrible mistake...\n\n               ALEX gets behind AOKEE, deciding he needs some help, feeding\n               him words.\n\n<b>                                   ALEX\n</b>                             (quietly behind AOKEE)\n                         Bureaucratic bumble...\n\n<b>                                   AOKEE\n</b>                         Bureaucratic bumble....\n\n<b>                                   ALEX\n</b>                         Lost paperwork....\n\n<b>                                   AOKEE\n</b>                         Lost paperwork....\n\n<b>                                   ALEX\n</b>                         An error in the front office...\n\n<b>                                   AOKEE\n</b>                         Error in front office....\n\n<b>                                   ALEX\n</b>                         Spiced applesauce....\n\n<b>                                     AOKEE\n</b>                         Spiced...\n\n               AOKEE stops, turn and glares at ALEX, who merely smiles and\n               shrugs.\n\n<b>                                   THE COLONEL\n</b>                         Good God, man, what are you trying to\n                         say?\n\n               ALEX comes around from behind AOKEE.\n\n<b>                                  ALEX\n</b>                        It's Robbie sir. He was supposed to work\n                        at Aokee's and through some crazy mix-up,\n                        he ended up here.\n\n<b>                                   THE COLONEL\n</b>                             (looking at clipboard)\n                         Zirpollo? Well this is highly\n                         irregular...\n\n               He is flipping though the papers, confused.\n\n<b>                                   ALEX\n</b>                             (can't pass this up)\n\n\n\n\n<b>\n</b>    Page 15 of 81\n\n                         Most annoying....\n\n<b>                                   THE COLONEL\n</b>                         Most annoying....\n\n<b>                                   ALEX\n</b>                         Never happened before....\n\n<b>                                   THE COLONEL\n</b>                         Never happened before....\n\n<b>                                   ALEX\n</b>                         Spaghetti marinara...\n\n<b>                                  THE COLONEL\n</b>                        Spa....what?\n                            (exasperated)\n                        Well, if he was supposed to be assigned\n                        to you, we'll just have to let him go...\n\n               ROBBIE has caught on and is quick to step out of line, and\n               pick up his shirt to be ready to go.\n\n<b>                                  ROBBIE\n</b>                            (to THE COLONEL)\n                        I was confused myself, sir. I had heard\n                        I was working for some Hawaiian guy.\n\n<b>                                  AOKEE\n</b>                            (reassuring)\n                        I promise, we go straight to personnel,\n                        straighten the whole thing out. You\n                        won't need to worry.\n\n<b>                                      THE COLONEL\n</b>                         Very well.     We'll just have to make-do.\n\n               THE COLONEL goes back to the girl MELINDA he was about to\n               nickname before the interruption, but is staring after ALEX,\n               AOKEE and ROBBIE as they walk off. He looks at MELINDA. He\n               looks back at ALEX &amp; company. It hits him.\n\n<b>                                   THE COLONEL (CONT'D)\n</b>                             (remembering)\n                         Snafu.\n\n<b>                                      MELINDA\n</b>                         Sir?\n\n<b>                                   THE COLONEL\n</b>                         His grounds crew nickname.     I remember it\n                         now. Snafu.\n\n<b>     12        EXT -DAY - HILL AREA ABOVE THUNDER BAY                         12\n</b>\n               The entire staff of Water World is assembled for a pre\n               opening pep talk from owner BIG MIKE MAXWELL. He wears a\n               Water World Golf shirt, shorts and a crew-style marine hat.\n               Standing next to him is RICHARD THOMPSON, head lifeguard.\n               The workers are sitting on the hill.\n\n\n\n\n<b>\n</b>    Page 16 of 81\n\n\n               AOKEE, THE COLONEL and other \"management\" types are standing\n               off to the side. TIFFANY and her friends are sitting up\n               front.\n\n               ALEX and ROBBIE are sitting together towards the back, and\n               ROBBIE's grounds t-shirt is no longer in his hand, but has\n               been replaced by a folded AOKEE'S blue Hawaiian shirt.\n\n               There is a lot of noise from everyone talking.\n\n<b>                                   BIG MIKE\n</b>                             (motioning to get everyone to\n                              settle down)\n                         Okay, everybody, let's quiet down for a\n                         minute.\n                             (they do, and he looks down at\n                              his clipboard)\n                         For those who don't know me, my name is\n                         Michael Maxwell, and I...sort of run\n                         things around here.\n\n               A chant starts up, with affection...\n\n<b>                                   EVERYONE TOGETHER\n</b>                         Big Mike! Big Mike! Big Mike!\n\n               BIG MIKE smiles, this has happened before, probably a\n               tradition.\n\n<b>                                   BIG MIKE\n</b>                            (again motioning to settle\n                             down)\n                        Okay, yeah thanks. Now, I want go over a\n                        few basic things. First of all, make\n                        sure you've all filled out your paperwork\n                        with personnel, cause nobody gets paid\n                        unless they do. Come to think of it, I\n                        suppose it's better for me that you don't\n                        fill out your paperwork, then I don't\n                        have to pay you. I'll make it optional.\n                        If you want to get paid, fill out your\n                        paperwork.\n                            (looking at clipboard)\n                        Let's remember, the people who come here\n                        are our guests, and your job is to see\n                        they have a safe and fun experience here.\n                        Let's work together to keep the park\n                        clean and safe, and we'll have a great\n                        summer together. Now with a few words is\n                        our head lifeguard, Richard Thompson.\n\n               Another cheer starts up, smaller this time, which ALEX\n               starts.\n\n<b>                                   SMALLER GROUP\n</b>                         Big Dick! Big Dick Big Dick!\n\n<b>                                  RICHARD\n</b>                            (wincing some, but not\n\n\n\n\n<b>\n</b>    Page 17 of 81\n\n                              surprised, motioning to settle\n                              down)\n                         Yeah, yeah, very funny, we're all very\n                         amused. Okay, many of you have been in\n                         training for some time, and some of you\n                         still have a ways to go...\n\n               WE SEE a quick shot of some geeky younger guards wearing\n               water wings, sharky goggles and noseplugs and looking less\n               than confident...\n\n<b>                                   RICHARD (CONT'D)\n</b>                             (glancing at the water wing\n                              group wistfully, almost to\n                              himself)\n                         ...a long ways to go...\n\n               He looks down at his clipboard.\n\n<b>                                  RICHARD (CONT'D)\n</b>                        ...but I'd like to take a moment to\n                        speak, mostly to the guards, but\n                        certainly everyone has a role in this.\n                        We can take everything we've learned and\n                        distill it down to two simple rules.\n                        Rule number one:\n\n               He pauses, thoughtful for a moment, but building into a near\n               rage for effect to impress on everyone...\n\n<b>                                   RICHARD (CONT'D)\n</b>                             (loudly, emphatically, angry at\n                              the thought that anybody\n                              might...)\n                         Don't drown!\n\n               He stops, composing himself.\n\n<b>                                   RICHARD (CONT'D)\n</b>                             (almost quietly)\n                         Rule number two:\n\n               Again, thoughtful but building to a rage at the thought that\n               this could happen...\n\n<b>                                   RICHARD (CONT'D)\n</b>                             (loudly, emphatically)\n                         Don't let anyone else drown!\n\n               He stops again, and regains his composure.\n\n<b>                                   RICHARD (CONT'D)\n</b>                             (almost quietly to the stunned\n                              crowd)\n                         Thank you. Have a great summer!\n\n               There is stunned silence for a moment.    They're not sure how\n               to react.\n\n<b>                                   ALEX\n</b>\n\n\n\n<b>\n</b>    Page 18 of 81\n\n                             (breaking the silence)\n                         Alright! Whoo whoo!\n\n               ALEX, then everyone begins applauding. ROBBIE looks at ALEX\n               quizzically, ALEX just shrugs. The meeting breaks up.\n\n<b>     13        INT - MORNING - THE NEXT DAY - AOKEE'S SURF &amp; SNACK SHACK      13\n</b>\n               Everyone is hurrying around, getting ready for opening day.\n               ROBBIE, wearing his new blue Hawaiian shirt, is cutting\n               pineapple. AOKEE is busy hovering over everyone, and cooking\n               chicken on the grill. ALEX walks in.\n\n<b>                                   ALEX\n</b>                             (to ROBBIE)\n                         Hey, hey lookin' good. Blue is your\n                         color. Beats that stupid t-shirt, huh?\n\n<b>                                    AOKEE\n</b>                              (unhappy, stressed)\n                         Alex! You are late. Come on, is opening\n                         day!\n\n               ROBBIE finishes the pineapple and hands the tray to AOKEE,\n               almost spilling it.\n\n<b>                                   AOKEE (CONT'D)\n</b>                             (to ROBBIE and ALEX)\n                         You two start setting tables.\n\n               ALEX takes a pile of silverware wrapped in napkins, and\n               points to ROBBIE to grab a box of sugar packets to refill the\n               dispensers. ROBBIE grabs it quickly, enthusiastically, but\n               loses his grip and spills the packets on the floor.\n\n               At that moment, AUDREY a girl in her teens who works at\n               AOKEE'S and is stacking plastic cups on the counter,\n               accidentally knocks a stack of cups to the ground.\n\n               RAMON, a teenage boy who works there is behind the counter.\n               He bends over, disappearing, and we hear a crash of pots and\n               pans. His head peers up from below the counter sheepishly.\n\n               AOKEE turns from the grill looking at all this, and has a\n               worried look, but smiles and shrugs weakly.\n\n<b>                                   AOKEE (CONT'D)\n</b>                             (to ALEX, gesturing)\n                         Alex. Come here a minute.\n\n               ALEX comes up close next to him at the grill so they can\n               talk.\n\n<b>                                   AOKEE (CONT'D)\n</b>                             (with intensity)\n                         Alex, look. We falling apart. I made\n                         you assistant manager this year. Go\n                         assistant manage.\n\n<b>                                   ALEX\n</b>\n\n\n\n<b>\n</b>    Page 19 of 81\n\n                             (agreeing)\n                         No problem.\n\n               ALEX pops a CD out of the rack above the sound system, and\n               puts it in the CD player, stopping the standard pastoral\n               Hawaiian music that has been playing.\n\n               He turns up the volume some on the amp, and goes over to\n               SARAH, a teenage girl working there, and grabs her grass\n               skirt by the Velcro, removing it with a Velcro rip.\n\n<b>                                   ALEX (CONT'D)\n</b>                         Sorry, Sarah, but I need to borrow this.\n\n<b>                                   SARAH\n</b>                             (surprised)\n                         Hey! How did you know I wear shorts\n                         under that?\n\n<b>                                    ALEX\n</b>                             (mock surprise, rolling his\n                              eyes)\n                         Oh, Puh-leeaase.\n\n               ALEX walks back out to the dining area, everyone is still\n               working.\n\n<b>                                   ALEX (CONT'D)\n</b>                             (to all)\n                         Ladies and Gentlemen, may I have your\n                         attention, please?\n\n               Everyone stops and looks at ALEX.\n\n<b>                                   ALEX (CONT'D)\n</b>                         In exactly 30 minutes, hundreds of\n                         dripping wet customers with fistfuls of\n                         money smelling of chlorine and suntan\n                         lotion will be walking in here.\n                         And what will they be looking for?\n                             (as if directing a choir)\n\n\n<b>                                   EVERYONE TOGETHER\n</b>                             (except ROBBIE, who doesn't\n                              know any better)\n                         The best teriyaki east of the pacific!!!\n\n<b>                                     ALEX\n</b>                         Annnnnnd?\n\n<b>                                   EVERYONE TOGETHER\n</b>                             (Again except ROBBIE, who\n                              doesn't know any better)\n                         The finest smoothies in the state!!!\n\n<b>                                   ALEX\n</b>                         Now, everyone's a little tense, except\n                         me, of course. So to help you get in the\n                         proper frame of mind and relax, we need\n\n\n\n\n<b>\n</b>    Page 20 of 81\n\n                         the right soundtrack.\n                             (to AOKEE)\n                         Maestro?\n\n               AOKEE hits the play button on the CD player.\n\n<b>                                   ALEX (CONT'D)\n</b>                         This is little tune I like to call the\n                         Paradise Slide.\n                             (mouthing with the song as it\n                              starts)\n                         One, two, a one two three.\n\n               The music starts and ALEX, now wearing SARAH's grass skirt,\n               launches into his version of the electric slide, Hawaiian\n               style.\n\n               EVERYONE ELSE gets the beat and begins working to the music.\n               AOKEE is using his spatulas as drum sticks on the overhanging\n               kitchen tools.\n\n               RAMON has inverted an empty pot and is beating it conga-drum\n               style.\n\n               ROBBIE has picked up the sugar packets and ALEX is dancing\n               and quickly (almost casually) tossing silverware/napkin rolls\n               to ROBBIE as ROBBIE catches them (at first with some\n               difficulty) and puts them on the tables.\n\n               SARAH has re-stacked the cups, and is juggling salt &amp; pepper\n               shakers, placing them on the tables. AUDREY chops onions to\n               the beat.\n\n<b>                                   EVERYONE TOGETHER\n</b>                             (on the chorus)\n                         Don Ho, Don Ho, Don Ho. Don Ho, Don Ho,\n                         Don Ho.\n\n               AOKEE has now taken all the chicken off the grill and comes\n               out from behind the counter, dancing. The others form a\n               CONGA LINE behind him.\n\n<b>                                   EVERYONE TOGETHER (CONT'D)\n</b>                             (on the chorus)\n                         Don Ho, Don Ho, Don Ho. Don Ho, Don Ho,\n                         Don Ho.\n\n               As they go by the tables they put on any missing items. They\n               get into it more and more, AOKEE especially, swinging his\n               huge, 375 pound guy hips.\n\n<b>                                   EVERYONE TOGETHER (CONT'D)\n</b>                             (on the chorus)\n                         Don Ho, Don Ho, Don Ho. Don Ho, Don Ho,\n                         Don Ho.\n\n               As the song ends (abruptly), AOKEE bumps a surfboard (part of\n               the restaurant's decoration) with his hip, knocking it and\n               another one to the ground.\n\n\n\n\n\n<b>\n</b>       Page 21 of 81\n\n               There is a loud crash and everyone pauses and looks at AOKEE,\n               waiting to see if he gets mad.\n\n               AOKEE looks down at his hip, and makes a puppy-dog face like\n               \"I didn't know my hips were that big....\" Everyone claps,\n               laughing. AOKEE takes a bow.\n\n<b>     14        INT -LATER THAT DAY - AOKEE'S SURF &amp; SNACK SHACK               14\n</b>\n               ROBBIE and ALEX are carrying bus tubs loaded with dirty\n               dishes back toward the kitchen from the dining area.\n\n               AOKEE is sipping on a smoothie and leaning back on a counter.\n               There are only a few customers in the eating area.\n\n               They set the tubs down on a counter that passes to the back\n               area. An unseen person takes them into the dishwashing area.\n\n<b>                                   AOKEE\n</b>                             (to ALEX and ROBBIE)\n                         You did good work today.\n                         Here. I made you some of my special\n                         Power Smoothies. More customers later\n                         wanting dinner before park closes. I\n                         can't have you falling asleep on me.\n\n<b>                                   AOKEE (CONT'D)\n</b>                             (to ALEX)\n                         Alex, we are completely out of table\n                         stretchers and left-handed coffee pots.\n                         Take Robbie and go find some. I think\n                         some at the first-aid station near Surf's\n                         Up pool.\n\n<b>                                   ALEX\n</b>                             (nodding knowingly)\n                         Right. See you in a little while.\n\n               They walk off carrying their smoothies.\n\n<b>     15        EXT - MOMENTS LATER - THUNDER BAY CONCESSIONS AREA             15\n</b>\n               ROBBIE and ALEX are walking past Thunder Bay concessions area\n               toward THE WAVE carrying and drinking their smoothies.\n\n<b>                                   ROBBIE\n</b>                         So that was a typical lunch crowd?\n\n<b>                                   ALEX\n</b>                         Well, it's early in the season yet.\n                         We'll get busier.\n\n<b>                                   ROBBIE\n</b>                             (incredulous)\n                         Busier?\n\n<b>                                   ALEX\n</b>                             (laughing)\n                         Don't worry. You'll get used to it.      And\n                         tips were good, right?\n\n\n\n\n<b>\n</b>       Page 22 of 81\n\n\n<b>                                   ROBBIE\n</b>                         There's nothing like cash money in your\n                         pocket. What's that over there?\n\n               They are coming up on THE WAVE area.\n\n<b>                                   ALEX\n</b>                         Oh, you'll find this ride interesting.\n\n<b>     16        EXT - MOMENTS LATER - DAY - THE WAVE AREA                      16\n</b>\n               The walk up to THE WAVE attraction, where kids are surfing in\n               a high-water pressure river/ sheet of water. Surf music\n               plays loudly here, and kids are doing all kinds of tricks.\n               Some riders are good, some are not, and fall quickly.\n\n               We also see SKEETER and SNITCH, the tall skinny and short\n               chubby grounds kids we met earlier. They are cleaning up\n               around the exit area of THE WAVE.\n\n<b>                                   ALEX\n</b>                             (as a rider falls)\n                         It's a lot harder than it looks.\n\n<b>                                   ROBBIE\n</b>                         I can't imagine it's that difficult.\n                             (to himself)\n                         ...no rudder on the board...\n\n<b>                                   ALEX\n</b>                         Now this is a place of many wonders.     See\n                         those guys in line over there?\n\n               WE SEE some guys that look a little stoned with unusual hair\n               laughing and talking to each other.\n\n<b>                                   ALEX (CONT'D)\n</b>                         We call them \"Wave Bums\". They all have\n                         season passes, and do little more than\n                         ride the wave all day long. Some of them\n                         get pretty good.\n\n               Alex points up to a fence, behind which some smoke appears to\n               be drifting up.\n\n<b>                                   ALEX (CONT'D)\n</b>                         That's where they hang out when they're\n                         not riding the wave. Don't get too close\n                         to them.\n\n<b>                                   ROBBIE\n</b>                         No?\n\n<b>                                   ALEX\n</b>                             (sniffing)\n                         Contact high.\n\n               ROBBIE nods, understanding. ALEX points back to THE WAVE.\n\n\n\n\n\n<b>\n</b>    Page 23 of 81\n\n<b>                                   ALEX (CONT'D)\n</b>                         And there, my friend, is another one of\n                         The Wave's features.\n\n               WE SEE a pretty girl in line to ride.\n\n<b>                                   ALEX (CONT'D)\n</b>                         We call them \"Wave Babes\". And there's a\n                         special secret to this ride.\n\n               With that ALEX walks over to BOB, a guy in his late teens,\n               wearing a Security Golf Shirt. He is standing and looking\n               off in a different direction.\n\n<b>                                   ALEX (CONT'D)\n</b>                         Hey, Bob....can I borrow your radio a\n                         minute?\n\n<b>                                   BOB\n</b>                         Sure.\n\n               He hands him the radio, and ALEX is back with ROBBIE.\n\n<b>                                   ALEX\n</b>                             (into radio)\n                         Hey Frank, it's Alex.\n\n               ALEX waves and FRANK, the guard watching THE WAVE waves back.\n\n<b>                                   FRANK VO\n</b>                             (heard through the radio)\n                         Yo, Alex.\n\n<b>                                   ALEX\n</b>                             (into radio)\n                         Listen you have a possible code 4.\n                             (to ROBBIE)\n                         Means a \"hottie\".\n\n<b>                                  ALEX (CONT'D)\n</b>                            (to radio)\n                        She's up next. A free chicken sandwich\n                        and a smoothie if you bounce up the\n                        pressure a bit.\n\n<b>                                   FRANK VO\n</b>                             (heard through radio)\n                         You got it bud. But two smoothies.\n                         \"Volcanos\".\n\n<b>                                  ALEX\n</b>                            (to ROBBIE)\n                        He knows my weak spot.\n                            (to radio)\n                        Two Volcanos and a chicken sandwich.\n\n<b>                                   FRANK VO\n</b>                             (heard through radio)\n                         Time to go to ludicrous speed!\n\n\n\n\n\n<b>\n</b>     Page 24 of 81\n\n               WE SEE FRANK push forward on a handle next to him that seems\n               to resemble the throttle on a speedboat. The ambient noise\n               from the wave is noticeably higher.\n\n               The WAVE BABE jumps into the water with the board.      SKEETER\n               and SNITCH are still cleaning near the exit.\n\n<b>                                   ALEX\n</b>                             (to ROBBIE, still holding the\n                              radio)\n                         Watch, and wait....\n\n               THEY LOOK intently at the WAVE BABE, who is pretty good, even\n               with the increased water flow. But, after a few deft moves,\n               she falls. ALEX looks, and sees what he is looking for.\n               ROBBIE smiles.\n\n<b>                                    ALEX (CONT'D)\n</b>                         Yesss!\n\n               We look back at the WAVE BABE, but the water is obscuring our\n               view. We then see a medium shot of SKEETER and SNITCH. The\n               WAVE BABE walks past them carrying a board, but we don't see\n               below her waist, the board obscures our view.\n\n               SNITCH sees, and freezes, dumbstruck. SKEETER is looking\n               down at the grate where THE WAVE water drains. He reaches\n               down and pulls something out, and turns to the WAVE BABE\n               walking away.\n\n<b>                                   SKEETER\n</b>                             (unaffected)\n                         Excuse me... Miss?\n                             (louder)\n                         Hello...excuse me...?\n\n               Finally she turns. We see her, but just a flash of her from\n               the back, as the board covers her waist area. She is puzzled\n               by this grounds kid.\n\n<b>                                   SKEETER (CONT'D)\n</b>                             (holding up the bottom to her\n                              swimsuit)\n                         Is this yours?\n\n               She looks down behind the board and reacts.     She bites her\n               lower lip, winces and nods yes.\n\n               SKEETER hands her her swimsuit, and she looks around and\n               backs away towards a towel hanging from the fence nearby.\n               SNITCH is still frozen, stunned by what he's just seen, mouth\n               wide open. SKEETER waves his hand in front of SNITCH's face.\n\n               No reaction.   He's never seen a naked girl before.\n\n               We're back to ALEX and ROBBIE.\n\n<b>                                   ROBBIE\n</b>                             (looking at ALEX)\n                         You were right. I was interested in\n\n\n\n\n<b>\n</b>       Page 25 of 81\n\n                         this.\n\n<b>                                   ALEX\n</b>                         Well, sometime bring your swimsuit.\n                         We'll come back on break. I'll show you\n                         how to do it. Surf's is this way. And\n                         keep an eye out for Frank over there. We\n                         owe him.\n\n               ROBBIE nods in agreement, and they walk off.\n\n<b>     17        EXT MOMENTS LATER - DAY - NEAR SURF'S UP POOL                  17\n</b>\n               ROBBIE and ALEX are walking past the SURF'S UP wave pool.\n\n<b>                                   ALEX\n</b>                             (pointing)\n                         The First Aid station is over there. Just\n                         ask the guard. I just want to say hello\n                         to this girl I know.\n\n<b>                                   ROBBIE\n</b><b>                         OK.\n</b>\n               ROBBIE walks over to the First Aid Station. DOUG FITZGERALD,\n               the guy we heard in line on the first day is there, he's a\n               guard.\n\n<b>                                   ROBBIE (CONT'D)\n</b>                         Hey. I've been sent to find some table\n                         stretchers and left-handed coffee pots.\n\n<b>                                   DOUG\n</b>                         Oh, you must be the new guy at Aokee's.\n\n<b>                                   ROBBIE\n</b>                         Yeah, how'd you know?\n\n<b>                                   DOUG\n</b>                         Lucky guess. Saw some at the top of\n                         River Country. Just ask one of the\n                         guards over there.\n\n<b>                                   ROBBIE\n</b>                         Thanks.\n\n<b>                                   DOUG\n</b>                         And hey...tell that wienie Alex he still\n                         owes me twenty bucks!\n\n<b>                                   ROBBIE\n</b>                             (looking back and waving as he\n                              walks away)\n                         Got it.\n\n<b>     18        EXT - MOMENTS LATER - CUSTOMER SERVICE KIOSK                   18\n</b>\n               ALEX and ROBBIE are walking to RIVER COUNTRY and walk past\n               JAFFA in the CUSTOMER SERVICE KIOSK.\n\n\n\n\n\n<b>\n</b>       Page 26 of 81\n\n<b>                                   JAFFA\n</b>                             (calling out)\n                         Alex!\n\n               They turn and walk over.\n\n<b>                                   ALEX\n</b>                         Jama...I mean...Jaffa the Jamaican...what\n                         shakes, it mon?\n\n<b>                                   JAFFA\n</b>                         Jus' the same old this's and that's, mon.\n\n<b>                                   ALEX\n</b>                         Jaffa, meet Robbie Zirpollo.\n                             (to ROBBIE)\n                         Jaffa plays the tunes and talks the talk.\n\n               The PHONE RINGS, and Jaffa turns to answer.\n\n<b>                                   JAFFA\n</b>                             (into phone)\n                         What? No way.\n                             (hangs up phone, to ALEX &amp;\n<b>                              ROBBIE)\n</b>                         Check it out...\n\n               JAFFA smiles and picks up a radio.\n\n<b>                                    JAFFA (CONT'D)\n</b>                             (into radio)\n                         Attention Lost River guards. We have a\n                         report that some huge fat bald guy has\n                         abandoned his swimsuit and is slidin'\n                         down Lost River with nothin' on but a\n                         smile. Be watchin' for a great white\n                         whale now.\n\n<b>     19        EXT - DAY - TOP OF LOST RIVER RIDE                             19\n</b>\n               WE SEE two female life guards, both with a surprised look on\n               their faces. One has just reached into the water and picks it\n               up to display a HUGE pair of swim trunks. Both girls make an\n               Eeeew face.\n\n<b>     20        EXT - DAY - CUSTOMER SERVICE KIOSK                             20\n</b>\n<b>                                   JAFFA\n</b>                             (on PA system now, into mike)\n                         Attention please. Will Mr. John Big\n                         Bootay report to Lost River Splashdown.\n                         John Big-Bootay to Lost River Splashdown.\n\n<b>                                  ALEX\n</b>                            (to ROBBIE)\n                        He's calling for security.\n\n               ALEX wanders off a moment, looking at something going on in\n               the distance.\n\n\n\n\n\n<b>\n</b>       Page 27 of 81\n\n<b>                                   ROBBIE\n</b>                             (to JAFFA)\n                         Wow. Jamaica. I thought I was far from\n                         home.\n\n<b>                                  JAFFA\n</b>                            (dropping the accent a bit)\n                        I'll let you in on a little secret.\n                        Perception is everything...now, Jamal\n                        from Aurora, he's probably over with\n                        those guys...\n\n               WE SEE SKEETER and SNITCH walking into the men's room,\n               looking suspiciously around.\n\n<b>                                   JAFFA (CONT'D)\n</b>                             (back to the accent)\n                         ...cleaning the rest rooms. But Jaffa\n                         from Jamaica, he's in customer service,\n                         wearin' the nice shirt and playing the\n                         music. Perception and atmosphere. You\n                         get it?\n\n               ROBBIE smiles and nods, and waves goodbye to catch up with\n<b>               ALEX.\n</b>\n<b>     21        INT - MOMENTS LATER - IN MEN'S CHANGING/REST ROOM              21\n</b>\n               SNITCH is filling up a water balloon, while SKEETER is tying\n               a piece of fishing line to the hook on the inside of the\n               stall door. SKEETER climbs up on top of the stall.\n\n               SNITCH is tying off the water balloon and grabs the other end\n               of the fishing line, and ties it to the fill end of the\n               balloon. He shuts the stall door, tosses the balloon up to\n               SKEETER, who places it strategically on the beam above the\n               toilet. SKEETER then jumps down, and they head for the door.\n\n               Eddie Enters. We see EDDIE cautiously checking out the\n               restroom. He reaches up over the closed stall door and feels\n               gingerly the fishing line. He smiles and shakes his head,\n               and heads for the door.\n\n<b>     22        EXT -MOMENTS LATER - APPROACHING MEN'S CHANGING/REST ROOM      22\n</b>\n               EDDIE is now pushing his cart and making his way toward the\n               MEN's RESTROOM. He stops to talk to two concessions girls\n               and show them a magic trick that apparently involves a deck\n               of cards, which he pulls from a place on his cart. We see\n               him holding the cards so one girl can pick one.\n\n<b>     23        EXT - MOMENTS LATER - IN FRONT OF MEN'S CHANGING/REST ROOM 23\n</b>\n               SKEETER pops his head out and looks around. He sees Eddie in\n               the distance about 5 minutes away, and putting a plastic\n               liner in a trash can. He nods and disappears into the men's\n               room.\n\n               SKEETER and SNITCH appear at the door, look out, and see\n               EDDIE finishing his card trick. He presents a card for the\n\n\n\n\n<b>\n</b>    Page 28 of 81\n\n               girls to see, and the both nod encouragingly, but as they\n               walk off, they look at each other and shrug.\n\n               SKEETER and SNITCH take off, barely containing their\n               laughter. But EDDIE notices them leaving. All of this has\n               happened under the watchful though distant eye of ALEX.\n\n               EDDIE goes into the restroom.\n\n               EDDIE exits the restroom and goes to his cart.     At this point\n               ALEX and ROBBIE walk up to him.\n\n<b>                                      ALEX\n</b>                         Hey Eddie.     What have you got?\n\n<b>                                   EDDIE\n</b>                         Water balloon.\n\n               EDDIE reached onto his cart and pulls out a pair of scissors,\n               eyeing them.\n\n<b>                                   ALEX\n</b>                         You got this?\n\n<b>                                    EDDIE\n</b>                         Yeah.   Rookies!\n\n               ALEX and ROBBIE walk away as EDDIE places a \"RESTROOM CLOSED\"\n               sandwich board in front of the door. Just then BIG MIKE\n               rushes up.\n\n<b>                                  BIG MIKE\n</b>                            (big hurry-potty emergency)\n                        Oh Eddie. Listen, I know you're working\n                        but you hold on for just a minute. I've\n                        been so busy, and I really gotta go.\n\n               EDDIE motions and tries to find the words....\n\n<b>                                   EDDIE\n</b>                         But....no....\n\n               But BIG MIKE is already in. Eddies waits for it, wincing,\n               and there is a loud splash...\n\n<b>                                   BIG MIKE (O.S.)\n</b>                             (echoing through the door)\n                         Yeahhhah that's cold!\n\n               EDDIE just shrugs and puts away his scissors.\n\n<b>     24        EXT -MOMENTS LATER - TOP OF RIVER COUNTRY                      24\n</b>\n               Two young women guards, KATIE and AMY are loading kids into\n               tubes and pushing them onto the slide. AMY is a little older\n               than KATIE.\n\n<b>                                  AMY\n</b>                        ...so then he just disappeared.      I had to\n                        call my Dad to come pick me up.\n\n\n\n\n<b>\n</b>    Page 29 of 81\n\n\n               KATIE just shakes her head in amazement. ROBBIE and ALEX\n               walk up to them. AMY is out of earshot, loading a kid.\n               ALEX hangs back a bit.\n\n<b>                                  ROBBIE\n</b>                            (to KATIE)\n                        Hi. We're looking for some table\n                        stretchers and left-handed coffee pots.\n\n<b>                                   KATIE\n</b>                         What? Amy, this guy is looking for a\n                         table stretcher?\n\n<b>                                   AMY\n</b>                             (coming over)\n                         Aokee's huh?\n\n<b>                                    ROBBIE\n</b>                             (surprised)\n                         Uh, yes...\n\n<b>                                   AMY\n</b>                             (to ROBBIE, seeing ALEX in the\n                              background)\n                        They're all down at Big Mike's last I\n                        saw.\n                             (to ALEX)\n                        When you gonna tell him?\n\n<b>                                    ALEX\n</b>                         Hi, Amy.   Who's this?\n\n<b>                                   AMY\n</b>                         Katie, this is Alex and...\n\n<b>                                  ROBBIE\n</b>                            (taken with KATIE)\n                        Robbie. Ummm, Rob Zirpollo.\n\n<b>                                   AMY\n</b>                         Well, anyway, Big Mike's is where they\n                         are.\n\n<b>                                    ROBBIE\n</b>                         Thanks.\n\n               ALEX and ROBBIE walk off.\n\n<b>                                  AMY\n</b>                        What a couple of losers.\n\n<b>                                   KATIE\n</b>                        I don't know...I thought Robbie was kind\n                        of cute...\n\n<b>                                  AMY\n</b>                        Listen, you're new, so let me tell you\n                        how things are. First those guys were\n                        wearing blue shorts. That means\n\n\n\n\n<b>\n</b>    Page 30 of 81\n\n                          concessions.\n                              (uses her fingers to explain)\n                          The Water World social structure is\n                          organized on three levels. At the bottom\n                          are the Trash Rats.\n\n<b>                                    KATIE\n</b>                          Trash rats?\n\n<b>                                    AMY\n</b>                          Bottom feeders. Grounds kids. Babies.\n                          They clean the toilets and empty the\n                          trash. Most are only 14 years old. It's\n                          the only job younger kids can do here.\n                          Next up is concessions. They're our\n                          \"middle class\". We don't hang with them\n                          and they don't much hang with us. At the\n                          top of heap are the guards. You are a\n                          guard. Girl, if you want to go out with\n                          someone, stick with your own kind.\n\n<b>                                    KATIE\n</b>                              (looking off at ROBBIE and ALEX\n                               walking away)\n                          Aw, that's just silly. I think he's\n                          cute.\n\n<b>     25        EXT -DAY   BOTTOM OF RIVER COUNTRY ON THE WAY TO BIG MIKE'S 25\n</b>\n               This in an area where riders splash down from riding a tube\n               down the River Country slides. ROBBIE and ALEX are walking\n               past the splashdown area.\n\n<b>                                    ROBBIE\n</b>                          What did that girl Amy mean?\n\n<b>                                    ALEX\n</b>                          About what?\n\n<b>                                    ROBBIE\n</b>                          When she said, when are you going to tell\n                          him?\n\n<b>                                    ALEX\n</b>                          I'll tell you over a hamburger at Big\n                          Mike's.\n\n               ROBBIE and ALEX proceed to BIG MIKE's out of frame.\n\n               SUDDENLY in the background we see a tube splashdown from a\n               slide and the 7 year-old girl riding in it falls out.\n\n               Realizing she is no longer safely in a tube she screams and\n               begins splashing as if drowning. A guard nearby blows a\n               single tweet of her whistle.\n\n               IN SLOW MOTION we see four other guards throughout the area\n               turn and react to the whistle. They begin running, BAYWATCH\n               style towards the scene.\n\n\n\n\n\n<b>\n</b>       Page 31 of 81\n\n               Two guards are running and carrying a backboard. They\n               converge in another BAYWATCH style slow-mo shot and line up\n               along the edge of the splashdown pool.\n\n               One guard in the middle has a rescue tube, and, still in slow\n               motion, squats down slowly as if to jump in and rescue the\n               girl.\n\n               At the low end of the jump crouch, however he stops.      WE SEE\n               his face in close-up as he says.\n\n<b>                                   RESCUE GUARD\n</b>                             (slow-motion, voice distorted,\n                              to the girl)\n                         Staaaannnd Uuuuuuuupppp!\n\n               The drowning girl stops splashing wildly, and realizes she\n               can indeed stand up. She looks at all the guards lined up,\n               smiles sheepishly, and walks out of the pool.\n\n<b>     26        EXT - MOMENTS LATER - BIG MIKE'S                               26\n</b>\n               ALEX is standing outside of BIG MIKE's.    ROBBIE is walking\n               out of the restaurant.\n\n<b>                                   ROBBIE\n</b>                             (Shaking his head)\n                         Aokee's not going to be happy. Nobody\n                         seems to know where these things are...\n\n<b>                                      ALEX\n</b>                                (smiling)\n                         Yep.\n                                (now laughing)\n\n<b>                                      ROBBIE\n</b>                         What?\n\n<b>                                   ALEX\n</b>                         There's no such thing as a table\n                         stretcher or a left-handed coffee pot.\n\n<b>                                  ROBBIE\n</b>                        What a dirty trick.\n\n<b>                                   ALEX\n</b>                             (smiling)\n                         It's just Aokee's way of giving you a\n                         tour of the park without having to be\n                         there. Consider it a rookie initiation.\n\n<b>                                   ROBBIE\n</b>                             (still mad)\n                         Humph.\n\n<b>                                   ALEX\n</b>                         Time to make it up to you.    Come on.\n\n<b>     27        EXT. DAY - BACK OF BIG MIKE'S                                  27\n</b>\n\n\n\n\n<b>\n</b>       Page 32 of 81\n\n               ALEX knocks loudly on the door.\n\n               A teenage boy, DAVE in a BIG MIKE's uniform answers.\n\n<b>                                     DAVE\n</b>                         Alex!\n\n<b>                                   ALEX\n</b>                         Hey Davey...how 'bout two for two?\n\n<b>                                     DAVE\n</b>                         Malts?\n\n<b>                                    ALEX\n</b>                             (looks at ROBBIE)\n                         Chocolate.\n                             (ROBBIE nods)\n\n               DAVE disappears for moment.\n\n<b>                                  ALEX (CONT'D)\n</b>                        Now, if he ever shows up at our back\n                        door, we owe him chicken and smoothies.\n\n<b>                                   ROBBIE\n</b>                         But...don't we get an employee discount?\n                         Shouldn't we go in the front?\n\n<b>                                   ALEX\n</b>                         Well...the discount is larger this way.\n\n               ROBBIE is getting out money from his pocket, counting through\n               it.\n               DAVE shows up with two burgers and two malts, and hands them\n               to ALEX, disappears and shuts the door quickly. ROBBIE is\n               still staring at his money.\n\n<b>                                   ALEX (CONT'D)\n</b>                         Come on...let's go eat!\n\n               They walk out of frame.\n\n<b>     28        INT -DAY AOKEE'S SURF AND SNACK SHACK                          28\n</b>\n               ALEX and ROBBIE are cleaning tables after another busy lunch.\n               WE SEE that AOKEE is filling up a bucket, and getting a scrub\n               brush, and heads out the doorway.\n\n<b>                                    ALEX\n</b>                         Oh boy.   Here we go.\n\n<b>                                     ROBBIE\n</b>                         What now?\n\n<b>                                   ALEX\n</b>                         Aokee. The pigeons have been taking\n                         target practice on his trophy pedestal.\n                         Come on.\n\n               They exit out the same doorway as AOKEE.\n\n\n\n\n<b>\n</b>       Page 33 of 81\n\n\n<b>     29        EXT -   DAY - AOKEE'S SURF AND SNACK SHACK                        29\n</b>\n               AOKEE is busily cleaning and cursing the pigeons.\n\n<b>                                    AOKEE\n</b>                              (speaking Hawaiian)\n                          Stupid Pigeons. They should all die!\n\n<b>                                    ALEX\n</b>                              (to ROBBIE)\n                          Happens every week.\n\n<b>                                   ROBBIE\n</b>                             (to AOKEE)\n                         What is this thing for anyway?\n\n<b>                                    AOKEE\n</b>                          Someday, Robbie.   Someday.\n\n               He keeps cleaning.\n\n<b>                                   ALEX\n</b>                             (to ROBBIE)\n                         That stand is to display the coveted\n                         Surfer King trophy.\n                         Aokee seems to think that one day some\n                         concessions kid with more courage than\n                         brains is going to beat the lifeguards in\n                         the annual Employee Olympics.\n\n<b>                                    ROBBIE\n</b>                          And what would this concessions kid have\n                          to do?\n\n<b>                                    ALEX\n</b>                          Nothing, really. Just out surf the\n                          strongest guard of them all in the\n                          surfing competition. No big deal.\n\n<b>                                    ROBBIE\n</b>                          Has it ever happened?\n\n<b>                                    ALEX\n</b>                          A guard always wins the surf competition.\n                          Know why?\n\n<b>                                    TOGETHER\n</b>                              (ROBBIE and ALEX)\n                          Because concessions kids can't swim!\n\n<b>                                    AOKEE\n</b>                              (still cleaning)\n                          Someday.\n\n               They go back into AOKEE'S SURF AND SNACK SHACK.\n\n<b>     30        INT MOMENTS LATER -DAY- AOKEE'S SURF AND SNACK SHACK           30\n</b>\n               ROBBIE is now behind the counter making smoothies.      He puts\n\n\n\n\n<b>\n</b>    Page 34 of 81\n\n               them up and the two kids waiting take them and walk away.\n\n               In walk AMY and KATIE.\n\n<b>                                   KATIE\n</b>                             (to ROBBIE)\n                         Hi there.\n\n<b>                                   ROBBIE\n</b>                             (blinking, smiling)\n                         Hello. On break?\n\n<b>                                    KATIE\n</b>                         Yeah.   Two Blue Crushes please.\n\n<b>                                      ROBBIE\n</b>                         Coming up.\n\n               He shakes a mix container, blends it for about 5 seconds and\n               pours it out into two cups. He then puts in two umbrellas\n               with pineapple.\n\n<b>                                   AMY\n</b>                         Oooh. Umbrellas.       I've never gotten\n                         umbrellas before.\n\n<b>                                   ROBBIE\n</b>                         These are only for VIP guests.\n\n               AMY looks over to KATIE and rolls her eyes.\n\n               ALEX arrives at this point, and decides to provide a\n               distraction.\n\n<b>                                  ALEX\n</b>                        Amy. Have you ever seen the fabulous\n                        Cummings and Robbins 2000-B?\n\n<b>                                   AMY\n</b>                             (shaking her head)\n                         I don't think so.\n\n               As he leads her back into the kitchen...\n\n<b>                                   ALEX\n</b>                         It's incredible.      It washes 2000 plates\n                         an hour....\n\n<b>                                   KATIE\n</b>                             (to ROBBIE)\n                         So... you're not from around here, huh?\n\n<b>                                   ROBBIE\n</b>                         California. I just moved here at the\n                         beginning of the summer.\n\n<b>                                   KATIE\n</b>                         I'll bet California's nice.      I've never\n                         been west of the mountains.\n\n\n\n\n\n<b>\n</b>    Page 35 of 81\n\n<b>                                   ROBBIE\n</b>                         You'd love the ocean. And the sunsets\n                         are incredible. You can almost hear the\n                         sizzle as the sun drops into the ocean...\n                             (daydreaming a bit)\n                         Of course, we all know it doesn't drop\n                         into the ocean.\n\n<b>                                     KATIE\n</b>                         No.\n                            (pause)\n                        I'm surprised you're not a guard, coming\n                        from the ocean and all.\n\n<b>                                  ROBBIE\n</b>                        Let's just say I missed my chance, and\n                        Alex saved me from a death worse than\n                        fate. I was very nearly a trash rat.\n\n<b>                                  KATIE\n</b>                            (frowns)\n                         Oh. Good save.\n\n               ALEX has distracted AMY all he could and they return from the\n               kitchen.\n\n<b>                                   AMY\n</b>                         Well. That was exciting. Maybe next\n                         time you can show me how to scrub the\n                         grill. Come on, Katie.\n\n               They leave.\n\n<b>                                  ALEX\n</b>                            (to ROBBIE, interested)\n                        Well...how'd you do?\n\n<b>                                   ROBBIE\n</b>                             (thinking)\n                         Mmmm. I told her how beautiful the\n                         California sunsets are.\n\n<b>                                   ALEX\n</b>                         Good job. You work fast. Hey it's time\n                         for our break. Bring your swimsuit?\n\n<b>                                    ROBBIE\n</b>                         Yeah.   The Wave?\n\n<b>                                     ALEX\n</b>                         The Wave.    I love that water.\n\n               ROBBIE looks confused.\n\n<b>                                   ALEX (CONT'D)\n</b>                         Can't swim. It's only three inches deep.\n\n<b>                                   ROBBIE\n</b>                             (grabbing his suit and a towel)\n                         Ah ha! Let's go.\n\n\n\n\n<b>\n</b>    Page 36 of 81\n\n\n<b>     31        EXT -MOMENTS LATER - THE WAVE AREA                             31\n</b>\n               ROBBIE and ALEX have their swimsuits on, and are in line to\n               get on THE WAVE. ALEX is coaching ROBBIE.\n\n<b>                                   ALEX\n</b>                         Now, just take it easy, and don't expect\n                         too much at first. When you wipe out,\n                         your ride is done.\n\n               ALEX is up now, and he grabs the board and jumps in. He is\n               pretty good, but not nearly as good as the WAVE BUMS. He\n               does a few tricks and wipes out. He gets up and walks up to\n               the line to watch ROBBIE.\n\n<b>                                   ALEX (CONT'D)\n</b>                             (shouting)\n                         Just ease into it.\n\n               ROBBIE takes the board and looks around. He jumps full force\n               onto the wave. It takes him just a moment to get the feel of\n               the board, and then he is all over it, making the WAVE BUMS\n               look like rookies. Spins, rolls, everything that can be done\n               he does. Finally, the guard blows a whistle indicating that\n               his time is up.\n\n<b>                                   ALEX (CONT'D)\n</b>                             (meeting him at the exit)\n                         Gees. Where did you learn to do that?\n\n<b>                                   ROBBIE\n</b>                         I'm from Oceanside, California.    I was\n                         born on a surfboard.\n\n               They start walking back.\n\n               They stop for a moment to look at Thunder Bay. Just then a\n               wave spews out, and kids on tubes are screaming as they\n               always do.\n\n<b>                                   ALEX\n</b>                         Think you could ride that?\n\n<b>                                    ROBBIE\n</b>                             (looking right into ALEX's\n                              eyes)\n                         In my sleep.\n\n               ALEX just smiles.\n\n<b>     32        INT - LATER THAT DAY - AOKEE'S SURF &amp; SNACK SHACK              32\n</b>\n               AOKEE is cleaning up behind the counter.    ALEX is grinning\n               like the cat that ate the canary.\n\n<b>                                   AOKEE\n</b>                         What you so happy about?\n\n<b>                                   ALEX\n</b>\n\n\n\n<b>\n</b>    Page 37 of 81\n\n                            (shaking his head)\n                        You're not gonna believe it...\n\n<b>                                  AOKEE\n</b>                        Listen. Some guy came in today and try\n                        to buy a sandwich and pay with a phone\n                        card. Today I believe anything.\n\n<b>                                   ALEX\n</b>                         I took Robbie to The Wave today.\n\n<b>                                   AOKEE\n</b>                             (looking around)\n                         What? He drown?\n\n<b>                                  ALEX\n</b>                        No. It turns out that he's from\n                        Oceanside. California. You know, where\n                        they always hold those surf competitions?\n\n<b>                                       AOKEE\n</b>                         Yeah.   So?\n\n<b>                                  ALEX\n</b>                        It turns out that he placed second in the\n                        state high school finals for the\n                        shortboard competition. As a Sophomore.\n\n<b>                                  AOKEE\n</b>                        Robbie.\n                            (laughing in disbelief,\n                             dismissive, then serious)\n                        Robbie barely walk without help.\n\n<b>                                   ALEX\n</b>                         I saw it myself.      You wouldn't believe\n                         it.\n\n               We hear a loud CRASH from the kitchen.      AOKEE winces and\n               gestures toward the kitchen.\n\n<b>                                   AOKEE\n</b>                         I don' believe it.      Our Robbie?\n\n<b>                                   ALEX\n</b>                         Our Robbie.\n\n<b>                                  AOKEE\n</b>                            (thinking)\n                        If this true....this could be da year.\n\n<b>                                   ALEX\n</b>                         That's what I was thinking.\n\n<b>                                  AOKEE\n</b>                        Well, go get him. We need to make ready.\n                        He not just walk in and win this thing.\n\n<b>                                   ALEX\n</b>                         You heard it. He's in the kitchen...\n\n\n\n\n<b>\n</b>    Page 38 of 81\n\n\n               ALEX goes into the back. AOKEE sits at a table. Robbie\n               comes out of the kitchen wearing a dishwasher apron.\n\n<b>                                  AOKEE\n</b>                        Robbie, sit down. Alex, make up a\n                        Volcano. This boy in training.\n\n<b>                                  ROBBIE\n</b>                            (sitting down, worried)\n                        What did I spill now?\n\n               WE HEAR the whine of a blender as ALEX is working on the\n               Volcano Smoothie.\n\n<b>                                  AOKEE\n</b>                        Robbie, Alex tell me you are some kind of\n                        surfer. This true?\n\n<b>                                  ROBBIE\n</b>                        I dunno. Yeah, surfing is usually how I\n                        spend my summers.\n\n<b>                                   AOKEE\n</b>                         You know about Employee Olympics?\n\n<b>                                    ROBBIE\n</b>                         Yeah.   Some kind of trophy.\n\n<b>                                   AOKEE\n</b>                         Surfer King trophy. Very big.     Very\n                         nice.\n                             (looking down)\n                         Concessions never win.\n\n               ALEX arrives with the Volcano Smoothie. He turns a chair\n               around and sits. They will gang up on him.\n\n<b>                                   ROBBIE\n</b>                         I dunno...seems kind of silly to me.\n\n<b>                                  ALEX\n</b>                        It's a big deal. Every girl     wants to date\n                        you. Every guy wants to BE      you.\n                        Special privileges...we all     wear standard\n                        uniforms.   The Surfer King     gets to be\n                        creative. You ever see the      cowboy hat\n                        Cowboy wears?\n\n<b>                                  ROBBIE\n</b>                        It shouldn't be that hard...how good\n                        could this Cowboy be?\n\n<b>                                  AOKEE\n</b>                        He very good. His family go to Hawaii\n                        every year, two, three weeks. Good\n                        surfer. If you do this, you need to see\n                        Pipeman.\n\n<b>                                   ROBBIE\n</b>\n\n\n\n<b>\n</b>       Page 39 of 81\n\n                         Pipeman?\n\n<b>                                   ALEX\n</b>                         He's a myth.\n\n<b>                                  AOKEE\n</b>                        Oh, no. Pipeman very real. Works here\n                        in park. Low profile. You must find him\n                        and convince him to teach you the secrets\n                        of the Thunder Bay wave. This not the\n                        ocean, surf boy.\n\n<b>                                   ALEX\n</b>                             (thinking)\n                         Pipeman. The Banzai Pipeline. I get it.\n                         Some kind of legendary surf champ. Where\n                         do we find him?\n\n<b>                                  AOKEE\n</b>                        I only see him once, maybe twice. Stay\n                        behind scenes. But here he is and find\n                        him you must.\n                            (to ROBBIE)\n                        So. You do this?\n\n               Robbie looks at them, thinking for a moment.\n\n<b>                                                                        CUT TO:\n</b>\n<b>     33        INT -MOMENTS LATER - AOKEE'S SURF &amp; SNACK SHACK                33\n</b>\n               WE SEE quarters going ding ding ding into the pay phone on\n               AOKEE'S wall. The shot widens to reveal AOKEE is dumping\n               quarters and ROBBIE is holding the phone. He puts it up to\n               his ear.\n\n<b>                                  ROBBIE\n</b>                            (into phone)\n                        Hello, Grandma? No, I'm fine. Listen,\n                        Grandma...I need you to send me a few of\n                        my things...\n\n               AOKEE and ALEX are huddled around smiling.\n\n<b>     34        INT - DAY - BIG MIKE'S OFFICE                                  34\n</b>\n               BIG MIKE is standing, walking around as he speaks, TIFFANY is\n               sitting. Clearly she is being scolded.\n\n<b>                                  BIG MIKE\n</b>                            (angry)\n                        ....why you wouldn't believe the things\n                        I've heard. Just stupid things. Cutting\n                        in line. Demanding special treatment.\n                        Oh, and how about this one:\n                            (mimicking her)\n                        Princesses don't carry trash.\n                            (back to his voice)\n                        I've often thought it was a mistake to\n                        have you work here. Maybe I was right.\n\n\n\n\n<b>\n</b>    Page 40 of 81\n\n\n<b>                                   TIFFANY\n</b>                             (trying to dance out of it)\n                        Oh, daddy. You know how jealous people\n                        get.\n\n<b>                                  BIG MIKE\n</b>                        I'd almost believe that. But I was behind\n                        the First Aid station when you said the\n                        \"princess\" line. This park exists\n                        because the kids here work hard. They\n                        need to be treated fairly. They need to\n                        see you are just another lifeguard.\n\n<b>                                   TIFFANY\n</b>                             (protesting)\n                         But I'm not just another lifeguard.\n\n<b>                                  BIG MIKE\n</b>                            (mad again)\n                        You won't even be that if this continues.\n                        If you want to keep coming here every day\n                        and driving that little convertible of\n                        yours, I need to see real, concrete\n                        changes in your attitude.\n\n<b>                                      TIFFANY\n</b>                         All right.     What do you expect me to do?\n\n<b>                                  BIG MIKE\n</b>                        For one thing, start mingling with \"the\n                        commoners\". You'd be amazed at how nice\n                        some of the people who work here are.\n                        Make some friends outside that little\n                        group of yours. It's the work of the\n                        average teenager here that puts food on\n                        our table. Show some gratitude.\n\n<b>                                   TIFFANY\n</b>                             (thinking a moment)\n                         Fine. I'll work it.\n\n<b>                                   BIG MIKE\n</b>                             (softening, but firm)\n                         Good. Work on it. Please?\n\n<b>                                   TIFFANY\n</b>                             (nodding, but we don't believe\n                              her)\n                         Oh, Daddy. Don't worry about a thing.\n\n<b>     35        EXT MORNING - THE NEXT DAY - TIME SHACK                        35\n</b>\n               ROBBIE and ALEX hook up and grab their time cards. There is\n               a banner hanging that says, \"Employee Luau Tonight\", and\n               SKEETER and SNITCH have taken a 5 gallon bucket and are using\n               it as a stepladder to attach something.\n\n               SKEETER is on the bucket with a stapler in his hand. SNITCH\n               hands up the hand-lettered magic marker addition, which\n\n\n\n\n<b>\n</b>       Page 41 of 81\n\n               SKEETER staples on to the bottom of the banner while SNITCH\n               keeps a lookout.\n\n               The addition says, \"COME GET LEI'D\".     They scamper off,\n               laughing.\n\n<b>                                   ALEX\n</b>                             (looking up at the sign)\n                         This will be good. Aokee throws a great\n                         Luau.\n\n<b>                                   ROBBIE\n</b>                         I don't how much fun it will be.     With\n                         Aokee hosting, we'll be working.\n\n<b>                                   ALEX\n</b>                         There'll still be time for fun. Most of\n                         the work is setting up. Besides, we get\n                         paid, too. When was the last time you\n                         got paid to party?\n\n               With that, ALEX punches in, as if to punctuate the line.\n\n<b>     36        EXT - NIGHT -   OUTSIDE AOKEE'S SURF &amp; SNACK SHACK             36\n</b>\n               It is dark, but the place is lit up by little lights\n               everywhere, Christmas lights in the fake palm trees, TIKI\n               lights around AOKEE's, and lights lighting a stage where a\n               band is playing, what else, surf music.\n\n               Buffet tables line the area, and there is SMOOTHIE BAR set\n               up. BIG MIKE himself is behind the bar making smoothies,\n               while RICHARD is playing bass in the band. AOKEE is running\n               around making sure all the buffet items are full. Everyone\n               is wearing Leis, but the cheap plastic ones, except AOKEE and\n               his staff, who have real ones flown in from Hawaii.\n\n<b>                                   AOKEE\n</b>                             (pouring out four smoothies to\n                              ROBBIE and ALEX)\n                         OK. You work hard, and we fine now.\n                         Your time to party. Here they are.\n                         Special Love Smoothies. Be careful!\n\n<b>                                   ALEX\n</b>                             (to ROBBIE)\n                         These never fail.\n\n               ALEX picks up two Leis from a box behind the counter. He and\n               Robbie walk over to AMY and KATIE who are standing over near\n               the buffet.\n\n<b>                                   ALEX (CONT'D)\n</b>                             (to ROBBIE, but if front of AMY\n                              and Katie)\n                         Now this will never do.\n\n<b>                                   ROBBIE\n</b>                             (agreeing)\n                         I'm afraid you're right.     Something must\n\n\n\n\n<b>\n</b>    Page 42 of 81\n\n                         be done.\n\n               ALEX and ROBBIE set the smoothies on a nearby table. They\n               remove the cheap plastic Leis the girls are wearing. Then\n               they put on the real ones they carried over. ALEX steps back\n               to admire his work.\n\n<b>                                     ALEX\n</b>                         Oh, yes,    yes....\n\n<b>                                     ROBBIE\n</b>                         Perfect.    A work of art.\n\n               The girls look at each other and smile. ALEX and ROBBIE grab\n               the smoothies and hand two to the girls. AMY sips hers right\n               away.\n\n<b>                                   AMY\n</b>                         I don't remember anything like this on\n                         Aokee's menu.\n\n<b>                                     ROBBIE\n</b>                         They're..\n\n<b>                                   ALEX\n</b>                             (interrupting)\n                         ..special smoothies. Fortunately, you\n                         know people on the inside.\n\n               Onstage, the band had finished a tune before the dialog began\n               above. Now JAFFA steps up to the mike.\n\n<b>                                   JAFFA\n</b>                         We'd like thank Aokee and his crew for\n                         hosting this evening's Luau.\n\n               Everyone applauds, AOKEE waves. Alex raises a hand and waves\n               off the accolade. ROBBIE nods and smiles as the AMY and\n               KATIE clap as well.\n\n<b>                                   JAFFA (CONT'D)\n</b>                         We'd also like to bring Aokee up to sing\n                         one of his Hawaiian specialties.\n\n               Again, everyone claps and cheers him on.    AOKEE goes on\n               stage.\n\n<b>                                   ALEX\n</b>                         You girls want to dance?\n\n<b>                                   KATIE\n</b>                             (grabbing ROBBIE's hand and\n                              leading out to the dance\n                              floor)\n                         Sure.\n\n               AMY shrugs yes and goes out with ALEX.\n\n<b>                                   AOKEE\n</b>                             (onstage)\n\n\n\n\n<b>\n</b>    Page 43 of 81\n\n                        Mahalo and Aloha. This song is sung on\n                        my island for all young people in\n                        love...or about to be. Is called E\n                        O'Mai, or, You Are Mine.\n\n               AOKEE begins singing the Hawaiian love song, \"E O'Mai\".      Many\n               couples are dancing; it is a slow song.\n\n               ALEX, of course, is a goof. He dances slow, but every once\n               in a while executes a deep dip, much to AMY's terror.\n\n               EDDIE is off to the edge of the dance floor, watching,\n               longingly, and kind of swaying to the music. A couple of\n               girls walk by and he does a magic trick for them.\n\n               He holds both hands up, palms open to show he has nothing in\n               his hands. He also gestures that he has no sleeves (he is\n               wearing a tuxedo t-shirt). He reaches behind his back and\n               pulls out a trick bouquet of flowers, but they don't quite\n               open right, and are still unfolding as he holds them.\n\n               EDDIE smiles weakly, he knows that isn't quite how it was\n               supposed to go. The girls appear encouraging, but as they\n               leave look at each other and giggle.\n\n               We pick up ROBBIE and KATIE dancing.\n\n<b>                                  KATIE\n</b>                         So. How are things working out at\n                         Aokee's?\n\n<b>                                   ROBBIE\n</b>                         Oh, he's great. Alex too. I thought\n                         this summer was going to be a train\n                         wreck, but it's not turning out too bad.\n\n<b>                                   KATIE\n</b>                         Well, of course this isn't California...\n\n<b>                                  ROBBIE\n</b>                        No, but it looks like I will get a chance\n                        to do some surfing anyway.\n\n<b>                                   KATIE\n</b>                         Really.\n\n<b>                                   ROBBIE\n</b>                         Apparently there's some kind of surfing\n                         contest and Aokee is all over me to\n                         enter.\n\n<b>                                   KATIE\n</b>                         You mean the Surfer King?\n\n<b>                                   ROBBIE\n</b>                         You've heard of it?\n\n<b>                                  KATIE\n</b>                        It's all the other girls seem to talk\n                        about. This is my first year, but\n\n\n\n\n<b>\n</b>    Page 44 of 81\n\n                         apparently it's a pretty big deal. Being\n                         from Oceanside, you should have a good\n                         chance.\n\n<b>                                   ROBBIE\n</b>                         We'll see. It seems kind of stupid to\n                         me. A surfing contest in Colorado.\n\n                            (laughing)\n                        My friends back home would never believe\n                        it.\n\n               They continue to dance. WE SEE BIG MIKE talking to TIFFANY\n               and gesturing broadly. TIFFANY is clearly not agreeing with\n               what he is saying. COWBOY is nowhere to be seen. Suddenly she\n               throws up her hands and marches over to the dance floor where\n               EDDIE is standing alone, swaying a bit to the music.\n\n               She whispers something in his ear, and EDDIE'S eyes get real\n               big as she leads him by the hand to the middle of the dance\n               floor. She wraps her arms around EDDIE and they dance, all\n               the while glaring at her father.\n\n               EDDIE knows a good thing when he sees it, and quickly settles\n               in, Big Man on Campus. TIFFANY is taller than he is, so he\n               happily puts his head on HER shoulder.\n\n               BIG MIKE looks back at them, not happy with the way it\n               happened, but satisfied.\n\n               DOUG FITZGERALD (twenty bucks DOUG) is dancing with a girl\n               when ALEX, doing some kind of fancy spin to AMY, bumps into\n               him.\n\n<b>                                   DOUG\n</b>                             (to ALEX)\n                         Alex. Got my twenty bucks?\n\n<b>                                  ALEX\n</b>                        Oh, Dougie. You know, I left my wallet\n                        over in my locker. I'll see you before\n                        we leave and get it to you then.\n\n<b>                                   DOUG\n</b>                         Yeah, sure.\n\n<b>                                   ALEX\n</b>                         You know, you could always come by\n                         Aokee's and I could give it to you in\n                         trade.\n\n<b>                                   DOUG\n</b>                         Cash money, Alex.   Cash money.\n\n<b>                                   ALEX\n</b>                         No problem.\n\n               ALEX grabs AMY and swings her into another fancy move that\n               leads them away from DOUG.\n\n\n\n\n\n<b>\n</b>       Page 45 of 81\n\n               The song ends, and everybody claps.     AOKEE bows.\n\n<b>                                  ROBBIE\n</b>                            (to KATIE)\n                        Hey, listen. Alex told me about this\n                        great spot on the other side of Thunder\n                        Bay that looks down on the party, but\n                        it's a little more quiet. Want to go for\n                        a walk?\n\n<b>                                   KATIE\n</b>                         Sure.\n\n               They pick up their smoothies and walk off into the night.\n\n<b>     37        EXT MOMENTS LATER - NIGHT - NORTH EDGE OF THUNDER BAY          37\n</b>\n               ROBBIE is walking on the seawall that separates the bay from\n               the sunning area, tightrope style. KATIE walks next to him.\n\n<b>                                   KATIE\n</b>                         So...what made your folks pick up from\n                         beautiful southern California and move to\n                         Colorado?\n\n<b>                                   ROBBIE\n</b>                         Not both my folks.   Just my Mom.\n\n<b>                                   KATIE\n</b>                         Aha...trouble in paradise?\n\n<b>                                   ROBBIE\n</b>                         Let's just say my father had an eye for\n                         his administrative assistant, and now\n                         they're both somewhere in Mexico. Mom\n                         got a job here, some of her family's\n                         here, so they said \"Colorady is the place\n                         you outta be\".\n\n<b>                                   KATIE\n</b>                         It could be worse.\n\n<b>                                   ROBBIE\n</b>                         Well, I must admit, I've met some very\n                         nice people.\n                             (looking down and smiling)\n                         In California, the attitude's a little\n                         different. Here, not everyone is out to\n                         prove something. Seem's like everyone\n                         just wants to have fun.\n\n<b>                                  KATIE\n</b>                        I have a theory. Sometimes it snows here\n                        so hard, that it's a challenge just to\n                        get to work or to school. Everything\n                        shuts down for a day or so. If your car\n                        gets stuck, people appear from nowhere to\n                        help pull you out and get you back on the\n                        road. Most people here don't just look\n                        out for themselves. A lot of times,\n\n\n\n\n<b>\n</b>    Page 46 of 81\n\n                         they're looking out for you, too.\n\n<b>     38        EXT. MOMENTS LATER - NIGHT - CUSTOMER SERVICE KIOSK             38\n</b>\n               ALEX and AMY are inside the KIOSK.    ALEX is showing her how\n               everything works.\n\n<b>                                   ALEX\n</b>                         All these switches feed sound throughout\n                         the park. Which reminds me.\n\n               He pulls out a CD and pops it into the CD Player and presses\n               PLAY. He sees a flyswatter and begins waving it around like\n               a sword.\n\n<b>                                   ALEX (CONT'D)\n</b>                         And this is for bad little girls who\n                         don't know how to have fun.\n\n               He begins swishing it around, AMY is giggling.\n\n<b>                                    ALEX (CONT'D)\n</b>                         Oops.   There....almost got you.\n\n               AMY is dodging and laughing. ALEX closes in and seems like\n               he will kiss her, but just starts gumming her neck, tickling\n               her. AMY leans back laughing and WE SEE her back hits the\n               volume knob on the amplifier.\n\n<b>     39        EXT. NIGHT - MOMENTS LATER GRAND PAVILION                       39\n</b>\n               They have reached   the area to the west of Thunder Bay. It is\n               simply a concrete   pad that overlooks the party below. We\n               hear \"Paradise is   in Your Eyes\" by Michael Peace, which\n               begins with a lot   of jungle sound effects.\n\n<b>                                   KATIE\n</b>                             (looking down at the party)\n                         You were right. This is nice.\n                             (reacting to the jungle noises)\n                         But not necessarily quieter.\n\n<b>                                   ROBBIE\n</b>                         Just a sec.\n\n               He walks away slightly and gets on the radio.\n\n<b>                                   ROBBIE (CONT'D)\n</b>                         Hey, Alex. Give us break down here.\n                         Turn down the sound effects.\n\n<b>     40        EXT. NIGHT - CUSTOMER SERVICE KIOSK                             40\n</b>\n               ALEX and AMY are kissing; she is up on the counter of the\n<b>               KIOSK.\n</b>\n<b>                                   ALEX\n</b>                             (interrupting, but to AMY)\n                         Uh oh. Sorry. Hold that thought.\n\n\n\n\n\n<b>\n</b>    Page 47 of 81\n\n               He grabs the radio.\n\n<b>                                    ALEX (CONT'D)\n</b>                             (into the radio)\n                         I'm on it.\n\n               He turns down the volume back to normal. He also flips a\n               switch. They hear the tune now, and AMY jumps off the\n               counter, stands there and smiles. ALEX does an over-the-top\n               mambo moving to her and they start to slow dance.\n\n<b>     41        EXT. NIGHT - GRAND PAVILION                                    41\n</b>\n               ROBBIE has set down the radio, and is walking back to KATIE\n               now, who is swaying to the music. He doesn't get too close\n               to her, and actually stands off to her left.\n\n               Since she has the room and is momentarily inspired, she\n               begins a few dance moves, ballet, and then ballroom style.\n\n               ROBBIE has seen this sort of thing before, and instinctively,\n               almost without thinking steps in and becomes her dance\n               partner. They proceed in a beautiful dance that almost seems\n               rehearsed. Finally it occurs to them both.\n\n<b>                                   ROBBIE\n</b>                             (quizzically)\n                         So where did you learn to dance like\n                         this?\n\n<b>                                   KATIE\n</b>                             (smiling)\n                         Eight years at Miss Vickie's Studio of\n                         Dance. What surprises me is you.\n\n<b>                                   ROBBIE\n</b>                             (somewhat embarrassed, keeps\n                              dancing)\n                         Can you keep my deepest, darkest secret?\n\n<b>                                      KATIE\n</b>                         Of course.\n\n<b>                                  ROBBIE\n</b>                            (hesitantly)\n                        When you grow up within spitting distance\n                        of Hollywood, every mother seems to think\n                        her child is the next Harrison Ford. So\n                        when I was about 12, my Mom started\n                        taking me to all these auditions for\n                        things.\n\n<b>                                  KATIE\n</b>                        So are you the next Harrison Ford?\n\n<b>                                   ROBBIE\n</b>                         Some days I'm not even the next Robbie\n                         Zirpollo.\n\n               They continue to dance.    After a few moments...\n\n\n\n\n<b>\n</b>        Page 48 of 81\n\n\n<b>                                    KATIE\n</b>                         ....and?\n\n               They stop and walk over to the railing overlooking the party.\n\n<b>                                  ROBBIE\n</b>                        Turns out I get this part. They're\n                        selling some dish soap or something, and\n                        they think it will be magical to have\n                        two twelve year old kids dancing ballroom\n                        on this fantasy set with clouds and\n                        everything. They lock this girl and I\n                        into a dance studio with a choreographer\n                        for two weeks, and then they shoot the\n                        commercial.\n\n<b>                                   KATIE\n</b>                         Doesn't sound so terrible.     You certainly\n                         learned how to dance.\n\n<b>                                   ROBBIE\n</b>                         Yeah, but when it came out everyone in\n                         school saw it. I couldn't go anywhere\n                         for six months without everyone in the\n                         room laughing their heads off.\n\n<b>                                   KATIE\n</b>                             (touched, drawing closer)\n                         I'm not laughing.\n\n               They kiss, then return to dancing.\n\n<b>     42        EXT. MORNING - THE NEXT DAY - OUTSIDE AOKEE'S SURF &amp; SNACK 42\n</b><b>               SHACK - SURF MUSIC BED\n</b>\n               WE SEE ALEX and ROBBIE discussing something; forming a plan.\n               They are going to look for Pipeman. ALEX gestures in one\n               direction, and ROBBIE takes off. ALEX goes in another.\n\n<b>     43        EXT. MORNING - MOMENTS LATER - DAY     FIRST AID SHACK NEAR         43\n</b><b>               FUNHOUSE - SURF MUSIC BED\n</b>\n               ALEX walks up to the Guard, appears to ask a question.        The\n               guard shakes his head \"no\".\n\n               ALEX walks off.\n\n<b>     44        EXT. MORNING - MOMENTS LATER - GIFT SHOP - SURF MUSIC BED           44\n</b>\n               ROBBIE is talking to a cashier in the store.     She shakes her\n               head 'no'. Robbie walks out hurriedly.\n\n<b>     45        EXT. MORNING - MOMENTS LATER - CUSTOMER SERVICE KIOSK - SURF45\n</b><b>               MUSIC BED\n</b>\n               ALEX is talking to Jaffa. JAFFA gestures wildly, as if\n               telling some big mythical story, but at the end throws up his\n               hands as if to say, \"I don't know\".\n\n\n\n\n\n<b>\n</b>    Page 49 of 81\n\n<b>     46        EXT. MORNING - MOMENTS LATER - SOMEWHERE AT WATER WORLD -      46\n</b><b>               SURF MUSIC BED\n</b>\n               We are in pitch darkness. We hear the sound of heavy\n               scraping metal. Lights shine and we are looking up through a\n               manhole cover being removed. ROBBIE bends over the hole and\n               hollers \"PIPEMAN\" and peers in. He shakes his head\n               negatively and moves on.\n\n<b>     47        EXT. MORNING - MOMENTS LATER - BIG MIKE'S - SURF MUSIC BED 47\n</b>\n               We are at the back door to Big Mike's. ALEX knocks, and the\n               same kid as before, DAVE, pops his head out. ALEX appears to\n               ask a question, DAVE goes back in as ALEX waits. DAVE comes\n               out again and gestures, \"no one knows\". ALEX starts to leave,\n               but turns back and asks something else. DAVE disappears and\n               comes back with a burger. ALEX shrugs, and walks away\n               unwrapping and eating the burger.\n\n<b>     48        EXT. MORNING - MOMENTS LATER - BACK OF SOME BUILDING           48\n</b>\n               ROBBIE sees a door marked, \"EMPLOYEES ONLY\". He looks down\n               at his employee ID and shrugs and goes in. As he enters we\n               see he is pushed out by some unknown force. Out the open\n               door comes \"Wally\" the Water World mascot, who walks off.\n               Robbie has been knocked to the ground and looks up, shaking\n               his head. He gets up and walks off.\n\n<b>     49        EXT. MORNING - MOMENTS LATER - BACK OF SOME BUILDING - SURF49\n</b><b>               MUSIC BED\n</b>\n               Now it is ALEX who has separately come upon the same door,\n               not knowing ROBBIE has already been there. He enters, and\n               the door remains open. We hear girls screaming and he exits\n               quickly, followed by a volley of thrown girl's underwear,\n               swimsuits and towels.\n\n<b>     50        INT. MORNING - MOMENTS LATER - THUNDER BAY PUMPHOUSE - SURF50\n</b><b>               MUSIC BED\n</b>\n               This room is creepy. It is full of loud pumps and large\n               pipes. ROBBIE is making his way through a labyrinth of\n               piping and gauges and the like. He peers and sees a head\n               with a red scarf, but it moves out of view.  Surf music\n               fades.\n\n               There is a constant whine of the pumps. ROBBIE moves further\n               in and finally comes across a man holding a large pipewrench,\n               with his back to him. He is working to tame a small leak.\n\n<b>                                   ROBBIE\n</b>                             (quietly)\n                         Hello?\n\n               No reaction.\n\n<b>                                   ROBBIE (CONT'D)\n</b>                             (loudly this time)\n                         Hello?\n\n\n\n\n\n<b>\n</b>    Page 50 of 81\n\n               This startles and kind of angers PIPEMAN.\n\n<b>                                   PIPEMAN\n</b>                        Hey.   You're not supposed to be in here.\n\n<b>                                   ROBBIE\n</b>                         Yeah, sorry. Are you Pipeman?\n\n<b>                                   PIPEMAN\n</b>                             (recovering from the startle)\n                         Not on purpose.\n                         I guess some people call me Pipeman.\n                         'Spose it's better than Carl.\n\n<b>                                   ROBBIE\n</b>                         So you're real name's Carl?\n\n<b>                                  PIPEMAN\n</b>                        No. I just said Pipeman was a better\n                        name than Carl.\n\n<b>                                 ROBBIE\n</b>                        Oh. Well, my name's Robbie.      I work at\n                        Aokee's.\n\n<b>                                    PIPEMAN\n</b>                         Oh. OK.   What the hell you doin' down\n                         here?\n\n<b>                                   ROBBIE\n</b>                         I need your help.\n\n<b>                                   PIPEMAN\n</b>                         That scrubsink at Aokee's leakin' again?\n                         Gees, I knew we shoudda replaced...\n\n<b>                                  ROBBIE\n</b>                        It's not the scrub sink. I need your\n                        help. I'm competing in the Employee\n                        Olympics. With your advanced surfing\n                        experience, Aokee thought you might be\n                        able to help me.\n\n<b>                                   PIPEMAN\n</b>                             (to himself)\n                         Everybody wants to be the Surfer King.\n                             (to ROBBIE)\n                         What advanced surfing experience?\n\n<b>                                   ROBBIE\n</b>                         Well, you know. \"Pipeman\"? Hawaii's\n                         North Shore? Surfing the pipeline?\n\n<b>                                  PIPEMAN\n</b>                        Ohhh. Bad news, kid. I hate to\n                        disappoint you, but this is the reason\n                        they call me Pipeman. I'm the plumber\n                        around here.\n\n               PIPEMAN holds up the large wrench.\n\n\n\n\n<b>\n</b>    Page 51 of 81\n\n\n<b>                                  ROBBIE\n</b>                        Oh, boy. See, I'm from California, and\n                        I can surf, I just don't know what to\n                        expect from the wave on Thunder Bay.\n                        I...I was just hoping you could help, I\n                        really am sorry for bothering you.\n\n               ROBBIE begins walking out, dejected.    PIPEMAN looks at him,\n               and feels sorry for him.\n\n<b>                                  PIPEMAN\n</b>                        Wait a minute, kid. I do know a little\n                        about surfing. I also know a lot about\n                        the wave here. What exactly are you\n                        looking for from me?\n\n<b>                                   ROBBIE\n</b>                             (perking up)\n                        I need a mentor; you know like in Karate\n                        Kid.\n\n<b>                                  PIPEMAN\n</b>                        Karate Kid. He works at Big Mike's\n                        doesn't he?\n\n<b>                                   ROBBIE\n</b>                         No, no it's a movie.\n\n<b>                                  PIPEMAN\n</b>                        Never seen it. Don't know much about\n                        this mentor thing. How's it work?\n\n<b>                                  ROBBIE\n</b>                        Generally, you, as mentor, draw on some\n                        personal religious philosophy to first\n                        intimidate, and then later inspire me.\n                        What religion are you?\n\n<b>                                   PIPEMAN\n</b>                             (proudly)\n                         I'm Norman.\n\n<b>                                   ROBBIE\n</b>                         Ah, Brigham Young and all that.\n\n<b>                                  PIPEMAN\n</b>                        No, no NNNNORM-AN. We follow the big fat\n                        guy on Cheers reruns.\n\n<b>                                  ROBBIE\n</b>                        Okay...and your belief structure....\n\n<b>                                  PIPEMAN\n</b>                        Usually involves a lot of beer and corn\n                        nuts, but I don't think that's gonna work\n                        here.\n                            (thinking)\n                        Tell you what.\n                        Meet me at Thunder Bay tomorrow morning,\n\n\n\n\n<b>\n</b>       Page 52 of 81\n\n                        eight a.m., bring your board and we'll\n                        work something out.\n\n<b>                                  ROBBIE\n</b>                            (happily)\n                        Great, perfect. Thanks. I won't let you\n                        down.\n                            (walking away, muttering to\n                             himself)\n                        What the heck is a corn-nut?\n\n<b>     51        EXT. MORNING - THE NEXT DAY - THUNDER BAY                      51\n</b>\n               WE SEE Thunder Bay looking east. AOKEE and ALEX are setting\n               up lawn chairs. AOKEE is lathering on suntan lotion, and\n               puts on a large straw hat. ALEX puts sun block cream on his\n               nose, and they both sit on the lawn chairs. They both have\n               large smoothies.\n\n               ROBBIE appears with his surfboard, and lays it up against the\n               east fence at Thunder Bay. PIPEMAN arrives carrying a small\n               device in a plastic ziplock bag.\n\n               ROBBIE approaches PIPEMAN.\n\n<b>                                   ROBBIE\n</b>                         Hi!  Glad you could make it.\n                             (pointing to PIPEMAN's hand)\n                         What's that?\n\n<b>                                   PIPEMAN\n</b>                         This is how I trigger the wave.\n\n<b>                                      ROBBIE\n</b>                         With that?     A garage door clicker?\n\n<b>                                  PIPEMAN\n</b>                        What did you think? Waves just happen?\n                        This is Colorado, kid. Now get your\n                        board and get in the water.\n\n               Robbie gets his board and jumps into Thunder Bay, paddling\n               over to the narrow side where the wave begins.\n\n               PIPEMAN goes down the stairs leading to near where ROBBIE has\n               positioned himself.\n\n<b>                                   PIPEMAN (CONT'D)\n</b>                         You sure that's where you want to be?\n\n<b>                                   ROBBIE\n</b>                         Should be about right. Aren't you\n                         getting in? Where's your board?\n\n<b>                                    PIPEMAN\n</b>                         Mentors don't get wet. I looked it up.\n                             (pressing the clicker)\n                         Get ready.\n\n               A wave comes and ROBBIE begins paddling.     He misses it,\n\n\n\n\n<b>\n</b>       Page 53 of 81\n\n               splashes the water angrily and turns back to paddle to\n               position again. AOKEE and ALEX look at each other nervously.\n\n<b>                                   PIPEMAN (CONT'D)\n</b>                         Want to know what you did wrong?\n\n<b>                                  ROBBIE\n</b>                            (mad)\n                        Just gimme another wave.\n\n<b>                                   PIPEMAN\n</b>                         Oakey doakey.\n\n               Another wave comes. ROBBIE paddles furiously and misses it\n               again. Now he's really angry.\n\n<b>                                  ROBBIE\n</b>                            (tersely)\n                        Okay. Please. Tell me what I did wrong.\n\n<b>                                   PIPEMAN\n</b>                         You're in the wrong position. The wave\n                         doesn't crest that soon. Move ten feet\n                         further away from the back wall.\n\n<b>                                    ROBBIE\n</b>                             (to himself)\n                         The ocean never had a back wall.\n                             (to Pipeman)\n                         Thank you.\n\n               ROBBIE paddles over to the spot suggested by PIPEMAN. AOKEE\n               and ALEX are now sitting on the edge of the lawn chairs\n               anxiously awaiting the next wave. It comes and ROBBIE\n               catches it easily and begins riding it aggressively. He has\n               a good run and kicks out at the end.\n\n               AOKEE and ALEX high-five.\n\n<b>                                   ALEX AND AOKEE\n</b>                             (together)\n                         Yeee-haww.\n\n               They settle back into their chairs to absorb some sun.\n\n<b>     52        INT. DAY AOKEE'S SURF AND SNACK SHACK - DAY                    52\n</b>\n               AOKEE is behind the counter finishing up making a smoothie.\n               RICHARD, head lifeguard is on the other side; he will get the\n               smoothie.\n\n<b>                                   RICHARD\n</b>                             (grinning)\n                         So. I hear he's pretty good.     Haven't\n                         seen him myself yet.\n\n<b>                                   AOKEE\n</b>                             (concerned, covering)\n                         Good? Good at what? Who you mean?\n\n\n\n\n\n<b>\n</b>    Page 54 of 81\n\n<b>                                  RICHARD\n</b>                        Come on. Your ringer from California.\n                        Everyone says he's gonna give Cowboy a\n                        run for his money.\n\n<b>                                     AOKEE\n</b>                         Robbie?    Robbie barely walk without help.\n\n               We hear a loud CRASH from the kitchen.\n\n<b>                                     RICHARD\n</b>                         Gees!\n\n<b>                                     AOKEE\n</b>                         Ha!\n\n               AOKEE gestures back towards the kitchen.\n\n<b>                                   AOKEE (CONT'D)\n</b>                         Your Surfer King. We just make a good\n                         show. Your boy have nothing to worry\n                         about.\n\n<b>                                   RICHARD\n</b>                         You know I'd feel a lot better if you\n                         hadn't taken most of my money in that\n                         poker game last Friday night.\n\n<b>                                   AOKEE\n</b>                             (dismissive)\n                         Poker? Not an island game.     I no good.\n\n<b>                                   RICHARD\n</b>                            (nods)\n                        Right. Tell you what. Sight unseen even\n                        money, twenty dollars on Cowboy.\n\n<b>                                   AOKEE\n</b>                         You want to bet with me? Take my twenty\n                         dollars, just like that? Humph. Not\n                         worth the trouble, twenty dollars. Now,\n                         maybe a hundred...\n\n<b>                                   RICHARD\n</b>                         A hundred bucks...\n\n               ANOTHER CRASH from the kitchen, this time pots &amp; pans.\n\n<b>                                   AOKEE\n</b>                             (to kitchen)\n                         Robbie!\n\n<b>                                   RICHARD\n</b>                         OK, a hundred bucks.\n\n               They slap hands to seal the deal.    RICHARD leaves, grinning\n               and shaking his head.\n\n<b>                                     AOKEE\n</b>                               (to kitchen)\n\n\n\n\n<b>\n</b>    Page 55 of 81\n\n                         Robbie?   That you?   Come out here.\n\n<b>                                  ROBBIE\n</b>                            (entering from kitchen)\n                        Sorry, dude, that tray was way off\n                        balance.\n\n<b>                                  AOKEE\n</b>                        Robbie, our secret getting out.     You\n                        practice too good.\n\n<b>                                   ROBBIE\n</b>                             (happy)\n                         I'm really getting the hang of that wave.\n\n<b>                                      AOKEE\n</b>                         Fall more.     Make good show.\n\n<b>                                  ROBBIE\n</b>                            (thinking)\n                        I'll try to remember to look and see\n                        who's watching.\n\n<b>                                   AOKEE\n</b>                             (pours the rest of RICHARD's\n                              smoothie)\n                         Good. Here, have a smoothie. You too\n                         skinny to surf good.\n\n               ROBBIE smiles and takes the smoothie back to the kitchen.\n\n<b>     53        EXT EARLY MORNING. - THUNDER BAY                               53\n</b>\n               ROBBIE and PIPEMAN are in the middle of a practice session.\n               PIPEMAN is at the side, ROBBIE is in the water on his board.\n\n<b>                                   PIPEMAN\n</b>                             (gesturing)\n                         OK, now this time, get up on the board\n                         more quickly. This is a wave pool and\n                         this wave dissipates quickly. You only\n                         have a little time to show your stuff.\n\n<b>                                   ROBBIE\n</b>                         How will the judging work?\n\n<b>                                  PIPEMAN\n</b>                        You get a possible ten points. Three for\n                        your surfing, three for your style and\n                        four for the judge's overall impression\n                        of your ride. No one's ever gotten a\n                        ten...I'm not really sure why.\n\n<b>                                   ROBBIE\n</b>                         You've seen the competition.     What does\n                         everybody do?\n\n<b>                                   PIPEMAN\n</b>                         Everybody just surfs, man and tries not\n                         to fall. The big reason Cowboy's done so\n\n\n\n\n<b>\n</b>       Page 56 of 81\n\n                         well is he goes to Hawaii for a couple\n                         weeks every year. But there he's mostly\n                         a longboarder. Your job is to figure out\n                         how to make the most outta this little\n                         wave.\n\n<b>                                    ROBBIE\n</b>                         OK.   I'm ready.\n\n               The wave comes and ROBBIE catches it and surfs it hard,\n               kicking up high at the end.\n\n<b>     54        EXT. MORNING - MOMENTS LATER - HILL ABOVE THUNDER BAY          54\n</b>\n               WE SEE COWBOY and TIFFANY standing overlooking Thunder Bay.\n               COWBOY has binoculars and is looking through them.\n\n<b>                                   COWBOY\n</b>                         He's pretty good, I'll give him that.\n\n<b>                                   TIFFANY\n</b>                             (concerned)\n                         How good?\n\n<b>                                  COWBOY\n</b>                        If I have an off day, he could win.\n\n<b>                                   TIFFANY\n</b>                             (really concerned)\n                         That's terrible. You're the Surfer King.\n\n<b>                                   COWBOY\n</b>                         Well, some days you get the wave, and\n                         some days the wave gets you.\n\n<b>                                   TIFFANY\n</b>                         This can't happen.   What are we gonna do?\n\n<b>                                   COWBOY\n</b>                         I don't know what you're going to do, but\n                         as me for me, I'm gonna schedule some\n                         practice time of my own.\n\n<b>                                   TIFFANY\n</b>                         This may take a lot more than extra\n                         practice.\n\n<b>                                   COWBOY\n</b>                         Well, I don't know what else you expect.\n                         I'll go out and do my best. If that's\n                         not enough, it's not enough.\n\n               TIFFANY grabs the binoculars and stares down at Thunder Bay.\n               WE SEE gears turning in her head.\n\n<b>     55        EXT. MORNING - THE NEXT DAY - CUSTOMER SERVICE KIOSK           55\n</b>\n               ROBBIE and Alex are walking by.   JAFFA sees them.\n\n<b>                                    JAFFA\n</b>\n\n\n\n<b>\n</b>    Page 57 of 81\n\n                         Hey, surfer boy! I got fifty bucks at\n                         three to one! Don't let me down, mon.\n\n<b>                                  ROBBIE\n</b>                            (to JAFFA)\n                        Hey Jaffa. NO worries.\n                            (to ALEX, shocked)\n                        People are betting on me?\n\n<b>                                  ALEX\n</b>                        Just a little friendly pool. No big\n                        deal. Helps make this more interesting.\n                        Concessions never had a chance before...\n\n<b>                                   ROBBIE\n</b>                         I've seen this Cowboy practice. His\n                         style is more longboard, and this is a\n                         shortboard wave, but he's still pretty\n                         good. I could lose you know.\n\n               Two concessions girls are walking by them.\n\n<b>                                    CONCESSIONS GIRLS\n</b>                             (together)\n                         Hi Robbie!\n\n<b>                                    ROBBIE\n</b>                         How ya doin'\n                              (to Alex after they have gone\n                               by)\n                         See. How come everyone knows me by sight\n                         now?\n\n<b>                                  ALEX\n</b>                        Ah, you're the next big thing. You'll\n                        survive it. The Employee Olympics are\n                        only a week away. What happens is we\n                        have this big opening ceremony where each\n                        team chooses a theme and we're judged on\n                        our spirit. Then different teams compete\n                        in contests that test their Water World\n                        skills. The next morning it all ends\n                        with the surf contest. You ready?\n\n               Another group of concession girls calls ROBBIE from one of\n               the snack bars. He waves.\n\n<b>                                   ROBBIE\n</b>                         I suppose. I've been working out a\n                         strategy to use if Cowboy has a real good\n                         day. It's risky...\n\n               Just then they both nearly run headlong into TIFFANY.\n\n<b>                                   TIFFANY\n</b>                         Well, hello Robbie.\n\n<b>                                   ROBBIE\n</b>                             (surprised)\n                         You know me?\n\n\n\n\n<b>\n</b>    Page 58 of 81\n\n\n<b>                                   TIFFANY\n</b>                         Of course I know you. It's my father's\n                         park, I try get to know everyone.\n\n<b>                                   ALEX\n</b>                             (interrupting, eager)\n                         I'm Alex!\n\n<b>                                  TIFFANY\n</b>                        Yes, I'm sure you are.\n                            (ignoring ALEX, back to Robbie)\n                        It's been a while since I've been to\n                        Aokee's. Do you suppose if I come down\n                        in a little while you could make some of\n                        that special chicken, what is it?\n\n<b>                                   ROBBIE\n</b>                         The best teriyaki east of the Pacific.\n\n<b>                                  TIFFANY\n</b>                        Yes...and one those smoothies I hear so\n                        much about?\n\n<b>                                    ROBBIE\n</b>                             (stunned)\n                         Well, sure. I'll be working all\n                         afternoon.\n\n<b>                                  TIFFANY\n</b>                        It's a date then.    See you later!\n\n               She walks off. ROBBIE just stands there. ALEX starts\n               walking, then comes back. Finally ALEX pushes him on the\n               shoulder.\n\n<b>                                   ALEX\n</b>                         Come on, we gotta get back.\n\n<b>                                   ROBBIE\n</b>                             (still shocked)\n                         Yes. Yes we do.\n\n<b>     56        INT. DAY AOKEE'S SURF AND SNACK SHACK                          56\n</b>\n               AOKEE is wiping the counter alone.    HE turns toward the\n               kitchen...\n\n<b>                                   AOKEE\n</b>                         Alex! We need more large smoothie cups\n                         out here!\n\n               AOKEE continues cleaning up. ALEX shows up with a load of\n               cups, AOKEE takes them and starts placing then.\n\n<b>                                  AOKEE (CONT'D)\n</b>                            (to ALEX)\n                        Look at that.\n\n               WE SEE in a far corner of AOKEE's TIFFANY and ROBBIE in an\n\n\n\n\n<b>\n</b>       Page 59 of 81\n\n               animated, engaging conversation.\n\n<b>                                   AOKEE (CONT'D)\n</b>                         Second time this week. Our boy Big Man\n                         on Campus, huh?\n\n<b>                                   ALEX\n</b>                         Big something. I hope he knows how to\n                         work without a net.\n\n<b>                                   AOKEE\n</b>                         Well. We all grow up sometime. He not\n                         drop a tray of dishes in days. Something\n                         going right.   You think he ready?\n\n<b>                                   ALEX\n</b>                         I guess we'll both find out on Sunday.     I\n                         sure hope so.\n\n               WE SEE TIFFANY and ROBBIE again, and TIFFANY is laughing\n               loudly at some joke ROBBIE has made.\n\n<b>     57        EXT NEAR SUNSET - TIME SHACK                                   57\n</b>\n               ROBBIE, ALEX, AMY and KATIE are clocking out for the day.\n               ROBBIE clocks out first. TIFFANY drives up in her\n               convertible.\n\n<b>                                   TIFFANY\n</b>                             (waving him over)\n                         Robbie!\n\n               ROBBIE goes over to talk to her.    WE SEE him go around to the\n               passenger side.\n\n<b>                                   ROBBIE\n</b>                             (shouting)\n                         Alex! I won't need a ride tonight after\n                         all. Tiff's taking me home!\n\n               ROBBIE jumps in and they drive away. ALEX, AMY and KATIE are\n               still standing on the porch of the TIME SHACK, shocked at\n               what they've seen.\n\n<b>                                   ALEX\n</b>                             (disbelief)\n                         Tiff?\n\n<b>                                   AMY\n</b>                             (grossed out)\n                         Tiff?\n\n<b>                                   KATIE\n</b>                             (forlorn, stunned)\n                         Tiff.\n\n               WE SEE ROBBIE and TIFFANY drive out the gate.     We see KATIE\n               walk slowly out of the park alone.\n\n               As she is walking, we flash back to scenes of KATIE and\n\n\n\n\n<b>\n</b>       Page 60 of 81\n\n               ROBBIE together, dancing and laughing. This time the dance\n               moves to the song of Allison Krause's \"New Favorite\".\n\n               We take a final look at KATIE with the setting sun at her\n               back and see she is crying.\n\n<b>     58        EXT. EARLY MORNING. - SURF'S UP WAVE POOL EAST SIDE            58\n</b>\n               We see the rising sun behind AOKEE's head as he raises a\n               conch shell and blows it like a horn. He is dressed like a\n               Hawaiian prince.\n\n               As the shot widens it reveals six males and two females\n               dressed in Hawaiian native garb. ROBBIE And ALEX are among\n               several drummers with bamboos sticks in their hands that\n               provide percussion for the Hawaiian war dance.\n\n<b>                                    AOKEE\n</b>                          Aie, noka moka kei kai ke alo.\n\n               The drums begin and the male dancers, carrying spears begin\n               the Hawaiian war dance. The drummers sing the Hawaiian folk\n               tune \"No ka moku Kiakahi Ke Aloha\".\n\n               There are about 100 concessions kids in regular uniform\n               sitting cross-legged behind them, clapping the beat in\n               unison.\n\n               The MALE DANCERS circle each other in time to the beat,\n               gesturing a story the seems to involve some invading army.\n               The war dance progresses until the invading warriors are\n               defeated and the folk song ends. At the end, the kids\n               sitting behind raise their hand and shout.\n\n<b>                                    CONCESSIONS GIRLS AND BOYS\n</b>                          Concessions! Concessions! Concessions!\n\n               Looking to the south side of the pool, we see about 50\n               grounds kids sitting in rows. In our foreground there are\n               six large trash cans, with toilet plungers arranged next to\n               them, 2 each.\n\n               To our left are a line of six grounds kids in army fatigues\n               carrying brooms as if rifles. The lead kid shouts:\n\n<b>                                     LEAD MARCHER\n</b>                          Company!   Forward, march.\n\n               THE DRILL team marches into full view. The grounds kids\n               behind clap the march beat. The marchers stop in front of\n               the line of trash cans.\n\n<b>                                     LEAD MARCHER (CONT'D)\n</b>                          Company!   Halt!\n\n               They do.\n\n<b>                                    LEAD MARCHER (CONT'D)\n</b>                          Present Arms!\n\n\n\n\n\n<b>\n</b>    Page 61 of 81\n\n               The brooms come off their shoulders and are held forward.\n\n<b>                                         LEAD MARCHER (CONT'D)\n</b>                            Company!\n\n<b>                                         MARCHERS\n</b>                            Yes sir.\n\n<b>                                      LEAD MARCHER\n</b>                            Order arms.\n\n               They begin a routine practiced with brooms, in a cadence,\n               clapped by the grounds kids behind them.\n\n<b>                                   LEAD MARCHER (CONT'D)\n</b>                         What do you do if it's wet and not yours?\n\n<b>                                      MARCHERS\n</b>                                (in cadence)\n                            Don't touch it! Don't touch it!\n\n<b>                                      LEAD MARCHER\n</b>                            How do you deal with a full can of trash?\n\n<b>                                         MARCHERS\n</b>                            We empty!     We empty!\n\n<b>                                         LEAD MARCHER\n</b>                            Sound off!\n\n<b>                                      MARCHERS\n</b>                            Trash Rats!\n\n<b>                                         LEAD MARCHER\n</b>                            Again!\n\n<b>                                      MARCHERS\n</b>                            Trash Rats!\n\n<b>                                      LEAD MARCHER\n</b>                            Sound off, Trash Rats.\n\n<b>                                      MARCHERS\n</b>                            Trash rats! Trash Rats!\n\n               They stop.     Their brooms are raised over their heads.\n\n<b>                                         LEAD MARCHER\n</b>                            Company!     Brooms Ho!\n\n               They allow their brooms to fall to their right side and march\n               to the trash cans. They pull out bright blue ski masks, a la\n               BLUE MAN GROUP, and pick up the toilet plungers. The lead\n               marcher holds his plunger high and shouts.\n\n<b>                                         LEAD MARCHER (CONT'D)\n</b>                            Company!     Begin!\n\n               He counts a four beat rhythm and they begin a BLUE MAN/STOMP\n               like drum routine with the trash cans.\n\n\n\n\n<b>\n</b>    Page 62 of 81\n\n\n               Two grounds kids in regular grounds uniforms approach holding\n               steel trash can lids by the handles (with gloves). These\n               become drums as well as two of the drummers switch from trash\n               can to can lids using the stick side of the toilet plunger as\n               the drumstick.\n\n               A competition erupts from the left and right sides of the\n               line as they each set a beat and then the other matches.\n\n               Finally, a show of unity as both sides join back into the\n               beat for an ending flourish.\n\n               They pick up their brooms and turn their attention to the\n               kids behind them. They begin to march in place and the seated\n               grounds kids clap for the tempo.\n\n<b>                                   LEAD MARCHER (CONT'D)\n</b>                             (to the seated GROUNDS KIDS)\n                         What do you do when the table's a mess?\n\n<b>                                   GROUNDS KIDS\n</b>                             (together)\n                         We wipe it! We wipe it!\n\n<b>                                   LEAD MARCHER\n</b>                         What do you do when a toilet's stopped\n                         up?\n\n<b>                                   GROUNDS KIDS\n</b>                         We plunge it! We plunge it!\n\n<b>                                      LEAD MARCHER\n</b>                         Sound off!\n\n<b>                                   GROUNDS KIDS\n</b>                         Trash rats!\n\n<b>                                      LEAD MARCHER\n</b>                         Sound off!\n\n<b>                                   GROUNDS KIDS\n</b>                         Trash rats!\n\n<b>                                   LEAD MARCHER\n</b>                         Sound off trash rats!\n\n<b>                                   GROUNDS KIDS\n</b>                         Trash rats! Trash rats!\n\n               They clap and cheer, and settle back down to sit.\n\n               All is quiet now. WE SEE concessions kids sitting, grounds\n               kids sitting and we look to the west side of the pool and see\n               lifeguards sitting. Everyone is looking around.\n\n               Suddenly two lifeguards dressed as Roman Soldiers appear with\n               horns. They bellow a Roman Call to Action, and two Roman\n               drummers lead a column of other lifeguards.\n\n\n\n\n\n<b>\n</b>       Page 63 of 81\n\n               First we see female guards dressed in togas filing in. Behind\n               them are six gladiators with swords and shields, marching.\n\n               They are followed by one female lifeguard with a basket of\n               rose petals. She is throwing them into the path of the next\n               group to enter.\n\n               Next we see six more guards dressed as slaves carrying\n               COWBOY, who is sitting up on a First Aid backboard. HE is\n               wearing laurel leaves and a toga, he is obviously Cesar. On\n               the backboard is also the surfer king trophy.\n\n               They all approach the area in front of the seated guards, and\n               rearrange themselves so that COWBOY has a good view of the\n               gladiators. The drummers count a cadence that sets the pace\n               for a simulated battle between the gladiators.\n\n               The simulated battle rages until three of the gladiators are\n               on their knees before the three victorious gladiators. The\n               victorious gladiators hold their swords over the fallen ones,\n               and look to COWBOY for a yea or nay.\n\n               COWBOY generously waves and makes a thumbs up signal, and the\n               swords are put away. The seated lifeguards all raise their\n               fists and shout.\n\n<b>                                   LIFEGUARDS\n</b>                             (together)\n                         Lifeguards! Lifeguards!     Lifeguards!\n\n               The guards holding COWBOY set him down in front of an\n               elevated platform that has a microphone..\n\n               COWBOY picks up the surfer king trophy and walks to the\n               platform. He sets the trophy on a table next to the\n               microphone, arranging it carefully.\n\n               We see now there is a large banner hanging at the back of the\n               wave pool that says \"WATER WORLD WELCOMES EMPLOYEE\n<b>               OLYMPIANS\".\n</b>\n               COWBOY moves to the microphone and raises his arm in a regal\n               manner and speaks.\n\n<b>                                   COWBOY\n</b>                             (to all)\n                         Let the games...begin!\n\n               The seated crowd now stands and cheers loudly. We see a\n               group of three people, two male and one female, adults we\n               will later identify as JUDGES. They nod approvingly and\n               write something down on their clipboards. We see BIG MIKE\n               near them, smiling broadly.\n\n<b>     59        EXT. LATER THAT DAY - SURF'S UP WAVE POOL EAST SIDE            59\n</b>\n               We see that the lounge chairs have been removed and the area\n               is clear. There are scattered squashed up pieces of white\n               paper lying about.\n\n\n\n\n\n<b>\n</b>       Page 64 of 81\n\n               We look to the south and see that there are three boy/girl\n               teams with one of their legs tied together, like a three\n               legged race.\n\n               The rub here is one team member has the dustpan and the other\n               team member has the broom. A JUDGE triggers a starter pistol\n               and they are off.\n\n               The lifeguard team falls almost immediately, and the grounds\n               team takes a early lead over the concessions team, who are\n               trying to figure the dustpan/broom operation out. The two\n               grounds people work tightly together and quickly advance.\n\n               The lifeguards have gotten back up and are hobbling up to\n               their first piece of trash. Concessions has figured out the\n               dustpan, but are still well behind the grounds kids.\n\n               Finally, the grounds kids win, with concessions up second,\n               and lifeguards trailing in third. The judges note the finish\n               on their clipboards.\n\n<b>     60        EXT. LATER THAT DAY - THUNDER BAY                              60\n</b>\n               We see three male participants standing in the shallow end of\n               Thunder Bay, One red suit (lifeguard) one blue suit\n               (concessions) and one green suit (grounds)\n\n               A JUDGE on the rise to the west of Thunder Bay blows an air\n               horn to start the race. They all rush into the bay and begin\n               swimming furiously.\n\n               The guard takes the lead quickly, followed not far behind by\n               the grounds kid. The concessions kid is working hard and\n               splashing a lot but not getting very far.\n\n               As the guard reaches the back wall, he does an underwater\n               racing turn and swims back toward the point where they\n               started. Right behind him, the smaller grounds kid does the\n               same thing.\n\n               As they are returning, they pass the concessions kid, who\n               still is splashing a lot but not going fast. After they pass\n               him he stops, as he is tired out.\n\n               Momentarily he can't even tread water any more, and a guard\n               watching from the sidelines jumps in and pulls him out. The\n               swimming guard has beaten the grounds kid, the concessions\n               kid never finishes.\n\n<b>     61        EXT LATER THAT DAY - SURF'S UP WAVE POOL SOUTH SIDE            61\n</b>\n               There are three lines set up with several participants. It\n               is a relay race, with the baton replaced by a tray full of\n               drinks in paper cups, water. The colors indicate again\n               concessions, guards and grounds.\n\n               The race is already in full swing, with concessions in the\n               lead. The last group of relayers are now getting their\n               trays, and concessions is way ahead.\n\n\n\n\n\n<b>\n</b>       Page 65 of 81\n\n               Everyone is cheering their team on. The final pass is made\n               to SARAH who works for AOKEE's. She takes the tray and moves\n               gracefully to the final stop. There is a small table on\n               which the drinks must be placed.\n\n               She is clearly going to win when she suddenly stops.\n\n               All concessions kids are shocked and plead her to go on.\n\n               She does a nifty and graceful around the back maneuver with\n               the tray, proceeds to the table, and sets down the drinks,\n               tipping the tray sideways to show no water has been spilled.\n\n               The JUDGES scribble furiously.\n\n<b>     62        EXT. LATER THAT DAY - AOKEE'S SURF &amp; SNACK SHACK               62\n</b>\n               Three picnic tables are set up in front of AOKEE's. WE dolly\n               past each one to see that they are cluttered indentically\n               with what appears to be the leftovers from lunch for four.\n               Behind each table is a team of two guards, concessions and\n               grounds kids.\n\n               A JUDGE blows a whistle and we begin by looking at the\n               lifeguard team.\n\n               It is a boy and a girl and the girl is not too keen on this.\n               They bring a trash can with them and begin gingerly clearing\n               the table, acting as if they are afraid to get their hands\n               dirty.\n\n               We dolly left to see the concessions team a little ahead of\n               the guard team.\n\n               We dolly further left to reveal a grounds kid in a full rain\n               suit with a face shield.\n\n               A tremendous force of water is clearing the table into the\n               trash can which the rain-suited grounds kid is holding at\n               it's end.\n\n               We dolly further left to see EDDIE in full army fatigues with\n               safety goggles on and wearing the biggest super-soaker water\n               gun in the history of man.\n\n               The table is quickly cleared, and at the same time washed.\n               EDDIE holds up the business end of the Super-Soaker gun and\n               blows imaginary smoke from it's barrel, like an old Western\n               gunfighter.\n\n               The JUDGES take notes.\n\n<b>     63        EXT. LATER THAT DAY - SURF'S UP WAVE POOL                      63\n</b>\n               The three different teams are gathered in groups waiting for\n               the next challenge. One of each team is in full sweats,\n               color coordinated by team.\n\n               ALEX is the one in the sweats for concessions. Slowly the\n               sweats people walk into the pool about waist deep and lay\n\n\n\n\n<b>\n</b>    Page 66 of 81\n\n               down.\n\n               The grounds kid is the littlest guy of all.\n\n               A JUDGE blows a whistle and four members of each team run\n               into the water and drag their now soaked sweat suited\n               teammate out of the water. They lie them down on a clear\n               area and begin CPR.\n\n               The guards have a nifty little plastic device that lets them\n               blow air into the mouth of their victim, and they roll him\n               quickly on his side to clear water and back to begin CPR.\n               They are fast and efficient, and clearly expertly trained.\n\n               We move left to see the grounds kids, knowledgeable but\n               inexperienced. One girl is using her hands to provide a\n               seals over the mouth of her \"victim\" and another is clumsily\n               pumping his chest while the others try to keep a count while\n               reading some kind of instruction card..\n\n               We move again to see the concessions kids, who are in\n               trouble. ALEX is lying there dying, and they are arguing\n               about who has to breathe into his mouth. They form a circle\n               over him, pointing and arguing.\n\n               Finally they all just walk off and ALEX is still lying on the\n               ground, eyes rolled back and twitching convulsively in a\n               hilarious death scene.\n\n               The JUDGES take their notes.\n\n<b>     64        EXT LATER THAT DAY - IN FRONT OF THE CANNING COMPANY           64\n</b>\n               Once again three teams representing the three competing\n               factions. Large stainless steel pots are bubbling on three\n               propane cooking stands in front of the concession.\n\n               The teams each have three members in cooking aprons, again,\n               color coded. One from each team is stirring the team's chili\n               while the others watch the JUDGES anxiously.\n\n               Lines are forming in front of each pot, with people in line\n               each carrying a paper chili bowl, but holding back, deferring\n               to the JUDGES. The JUDGES are each carrying three styro cups\n               in which to receive the chili.\n\n               They each get a portion from the guard team and take a sip.\n               They smile politely to the cooks, but turn around and spit\n               the chili back into the cup as delicately as possible, almost\n               as if throwing up. A concessions kid is there with a tray of\n               waters, which they quickly take advantage of.\n\n               They move on to the grounds team. They get their portions\n               and taste the chili and nod, not bad.\n\n               They take another sip of water to clear their palate and move\n               on to the concessions team. The portions are proudly\n               scooped.\n\n               They take a taste, smile and take some more.     They huddle for\n\n\n\n\n<b>\n</b>    Page 67 of 81\n\n               a moment and then place a blue ribbon on the concessions pot.\n               The lines quickly rearrange and merge themselves so that\n               everyone is in line for the concessions pot.\n\n<b>     65        EXT LATER THAT DAY - SURF'S UP WAVE POOL EAST SIDE             65\n</b>\n               An obstacle course has been set up, and the event provides a\n               background to the dialogue that follows. AOKEE has some\n               papers, and is talking to ALEX and ROBBIE.\n\n<b>                                  AOKEE\n</b>                            (looking through the papers)\n                        This isn't good.\n                            (looking at ALEX and ROBBIE)\n                        It's the same as every year. Pretty much\n                        a dead heat going into the surf\n                        championship tomorrow morning.\n\n<b>                                   ALEX\n</b>                         I can't believe those guys screwed up the\n<b>                         CPR.\n</b>\n<b>                                   ROBBIE\n</b>                         Hard to blame them. No one told them\n                         they had to put their mouth on yours\n                         until the last minute. Yuck.\n\n<b>                                   ALEX\n</b>                         Bunch of babies.\n\n<b>                                   AOKEE\n</b>                             (to ROBBIE)\n                         It's going to be up to you. We slip a\n                         little. You have to make up. That\n                         trophy need a new home.\n\n               They look over at the obstacle course where a tiny grounds\n               kid is jumping up and down and raising his arms ROCKY-style.\n\n<b>                                   AOKEE (CONT'D)\n</b>                         You need to make up. You ready? Tomorrow\n                         morning last event. You our last hope.\n\n               ROBBIE just looks at both of them nods and sighs heavily as\n               the other grounds kids surround our winner in the background.\n               AOKEE and ALEX walk off. Suddenly TIFFANY appears.\n\n<b>                                      TIFFANY\n</b>                         Hi Robbie.\n\n<b>                                  ROBBIE\n</b>                            (shy but still very much\n                             smitten)\n                         Oh. Hey.\n\n<b>                                   TIFFANY\n</b>                         How's your team doing?\n\n<b>                                   ROBBIE\n</b>                        Uh.   OK, I guess.      Kind of a tie.\n\n\n\n\n<b>\n</b>    Page 68 of 81\n\n\n<b>                                  TIFFANY\n</b>                        Well, I think you're going to take care\n                        of that tomorrow morning. In fact, I've\n                        planned a little celebration in advance.\n                        We're going to this incredible party up\n                        in the foothills at some friends of mine.\n\n<b>                                  ROBBIE\n</b>                            (intrigued)\n                        Party, huh? That sounds like fun.       I\n                        have to work until nine tonight.\n\n<b>                                  TIFFANY\n</b>                        That's perfect. I'll come back here and\n                        pick you up.\n\n               She starts to walk off.\n\n<b>                                   TIFFANY (CONT'D)\n</b>                         Oh, and Robbie...call your mom and tell\n                         her you're spending the night at Alex's\n                         or something. It's going to be a very\n                         special night.\n\n<b>                                      ROBBIE\n</b>                                (hypnotised)\n<b>                         K...\n</b>\n               She walks away. ROBBIE stands there a moment before waking\n               up and leaving also.\n\n<b>     66        INT. EVENING - AOKEE'S SURF &amp; SNACK SHACK                      66\n</b>\n               It is dark. We see ALEX and AOKEE cleaning up from the day's\n               food service. ALEX Is wiping down the smoothie area, AOKEE\n               is sweeping on the other side of the counter.\n\n<b>                                   ALEX\n</b>                             (voice somewhat hushed)\n                         I'm telling you we need to talk him.\n                         Something's going on.\n\n<b>                                   AOKEE\n</b>                             (shaking his head no)\n                         Robbie know the right thing to do.     He's\n                         a good boy.\n\n<b>                                  ALEX\n</b>                        So how about this? He tells me I've got\n                        to cover for him if his mother calls. He\n                        told her he's spending the night at my\n                        house.\n\n<b>                                  AOKEE\n</b>                        He say that?\n\n<b>                                   ALEX\n</b>                         Yes. Tiffany's got something up her\n                         sleeve and Robbie's too messed up to\n\n\n\n\n<b>\n</b>    Page 69 of 81\n\n                         notice.\n\n<b>                                  AOKEE\n</b>                            (reflective)\n                        Spending the night at your house.      This\n                        very bad. Very bad.\n\n<b>                                  AOKEE (CONT'D)\n</b>                        He should be done with the dishes by now.\n                        Tell him we want to talk.\n\n               ALEX disappears back into the kitchen. AOKEE goes to an\n               empty table under the one light on in the dining area and\n               sits down.\n\n               ALEX comes back and ROBBIE follows.\n\n<b>                                   ROBBIE\n</b>                         Hey. I'm done with the pots and pans.\n                         It's almost nine. Can I take off now?\n\n<b>                                   AOKEE\n</b>                         Robbie, please, sit.\n\n               ROBBIE sits down.   So does ALEX.   Robbie looks at both and\n               gets suspicious.\n\n<b>                                   ROBBIE\n</b>                         Everything OK?\n\n<b>                                   AOKEE\n</b>                         That's what we gonna ask you.    What you\n                         plan tonight?\n\n<b>                                   ROBBIE\n</b>                         Well, Tiffany invited me to a little\n                         party up in the mountains.\n\n<b>                                   AOKEE\n</b>                         Robbie, you athlete. Big day tomorrow.\n                         You need sleep, not party.\n\n<b>                                   ROBBIE\n</b>                         It's no big deal.   I'll be fine.\n\n<b>                                  AOKEE\n</b>                        Is big deal. Robbie. You good boy,\n                        smart, everybody like you, but....\n\n<b>                                    ROBBIE\n</b>                         But...\n\n<b>                                   AOKEE\n</b>                         Face it. Only one reason Tiffany\n                         interested in you. She want to make you\n                         so tired and so crazy you lose tomorrow.\n\n<b>                                   ROBBIE\n</b>                             (disbelief)\n                         Aw, come on...\n\n\n\n\n<b>\n</b>    Page 70 of 81\n\n\n<b>                                  ALEX\n</b>                        Robbie. She's still going out with\n                        Cowboy. I saw them together at the\n                        movies two nights ago.\n\n<b>                                  ROBBIE\n</b>                        Maybe she's just letting him down easy.\n\n<b>                                  ALEX\n</b>                        Robbie...things...things are not always\n                        what they seem to be.\n\n<b>                                     ROBBIE\n</b>                        Like what?\n\n<b>                                   AOKEE\n</b>                         In this case, she acts like she likes you\n                         when really she wants Cowboy to win.\n\n<b>                                 ROBBIE\n</b>                        Naw. You guys are nuts.      She's not like\n                        that.\n\n<b>                                   ALEX\n</b>                         She is like that.\n\n<b>                                  ROBBIE\n</b>                        Look, I know what to believe and what not\n                        to. I'm not that easily fooled.\n\n<b>                                     ALEX\n</b>                        Aokee?\n\n<b>                                  AOKEE\n</b>                            (shaking his head)\n                        Go ahead. Tell him. I trust him.\n\n<b>                                  ALEX\n</b>                        OK. Take Aokee for instance.      Gentle,\n                        genial Hawaiian guy, right?\n\n<b>                                  ROBBIE\n</b>                        Sure. He's great. I love working here.\n                        Aokee, you've been real good to me...\n\n<b>                                  ALEX\n</b>                        Then let me introduce you properly.\n                        Robbie Zirpollo, meet Manuel Ramirez.\n\n               AOKEE'S head is down in his hands. Robbie looks stunned.\n\n<b>                                  ALEX (CONT'D)\n</b>                        Manuel's family snuck across the border\n                        ten years ago through Juarez, Mexico.\n\n<b>                                   AOKEE\n</b>                             (accent gone)\n                         My father refused to work for a drug lord\n                         who ran our town. They tried to kill\n\n\n\n\n<b>\n</b>       Page 71 of 81\n\n                         him.     We barely got out with our lives.\n\n<b>                                      ROBBIE\n</b>                         Aokee?\n\n<b>                                   AOKEE\n</b>                             (accent now Mexican)\n                         A name I picked up reading an obituary in\n                         the paper. I sent away to Hawaii and got\n                         his birth records and social security\n                         number. This way, I never have to worry\n                         about immigration. I spent weeks\n                         watching tapes of Hawaii Five-O just to\n                         get the accent right. \"Book 'em Danno\".\n                         Huh. What's that all about?\n\n<b>                                   ROBBIE\n</b>                             (to Alex)\n                         And you knew?\n\n               ALEX nods yes.\n\n<b>                                   AOKEE\n</b>                         I burnt my hand on the grill one day and\n                         started swearing in Spanish...\n\n<b>                                   ALEX\n</b>                             (interrupting)\n                         And I said, boy, you speak Spanish like a\n                         native....uh oh. It's been our little\n                         secret. Now it's your secret, too.\n\n<b>                                   ROBBIE\n</b>                             (looking at his watch)\n                         I need to think about all this.\n\n<b>                                   ALEX\n</b>                             (nodding)\n                         You do.\n\n<b>                                   AOKEE\n</b>                         Sleep tonight. Sleep well.\n\n<b>                                   ROBBIE\n</b>                             (gets up, dazed)\n                         Right. Goodnight.\n\n               ROBBIE leaves.     ALEX and AOKEE just sit, looking at each\n               other.\n\n<b>     67        EXT. EARLY MORNING. - THUNDER BAY                              67\n</b>\n               Hundreds of people are gathering on bleachers to watch the\n               surfing competition.\n\n               A large highway construction type signboard has been erected\n               and says \"Grounds   93\", \"Concessions 93\" and \"Lifeguards\n<b>               94\".\n</b>\n               It is almost a festival atmosphere.     The JUDGES are standing\n\n\n\n\n<b>\n</b>      Page 72 of 81\n\n               in a group, conferring, near a table that has the controls\n               for the sign. The sign can be viewed easily from the\n               bleachers.\n\n               WE look over to the front of AOKEE's and see AOKEE and ALEX\n               standing outside the restaurant.\n\n<b>     68        EXT. EARLY MORNING. - MOMENTS LATER - AOKEE'S SURF &amp; SNACK 68\n</b><b>               SHACK\n</b>\n<b>                                   AOKEE\n</b>                             (to Alex)\n                         Have you seen him?\n\n<b>                                      ALEX\n</b>                         Not yet.\n\n               They are looking to the north towards the crowd, but ROBBIE\n               appears behind them.\n\n<b>                                   ROBBIE\n</b>                             (looking in the same direction)\n                         What you lookin' at?\n\n<b>                                  AOKEE\n</b>                        We looking for you.        How you sleep?\n\n<b>                                   ROBBIE\n</b>                         I slept fine.\n                             (pause as AOKEE and ALEX wait)\n                         I decided I'm not my father. I don't run\n                         out on the people I care about just\n                         because some blond shakes her ta-ta's at\n                         me.\n\n<b>                                   AOKEE\n</b>                             (relieved)\n                         We go then.\n\n               ROBBIE picks up his board, and they begin walking toward the\n               bleachers. ALEX stops and turns suddenly.\n\n<b>                                   ALEX\n</b>                         She shook her ta-tas? No one said\n                         anything about shaking ta-tas.\n                             (reflectively)\n                         This puts a whole new light on things!\n\n               He is in ROBBIE's way.        ROBBIE pushes him with his board.\n\n<b>                                      ROBBIE\n</b>                         Get going!\n\n<b>     69        EXT. EARLY MORNING - THUNDER BAY                                  69\n</b>\n               ROBBIE, COWBOY and MELINDA from grounds, who we met earlier\n               and was conned into the contest because she said she surfed\n               once on vacation, are all standing in front of the JUDGES.\n\n               One JUDGE explains the rules.\n\n\n\n\n<b>\n</b>    Page 73 of 81\n\n\n<b>                                   HEAD JUDGE\n</b>                             (looking down at clipboard)\n                         Alright, here's the deal. You get three\n                         tries; three heats. We judge each run\n                         and only your high score counts. If you\n                         fall you get no score for the run. Your\n                         score will be added to the total for your\n                         team, and the winner gets the Surfer King\n                         Trophy. Any questions?\n\n               They all shake their head no.\n\n<b>                                  HEAD JUDGE (CONT'D)\n</b>                        Then let's begin. Grounds is up first.\n\n               MELINDA grabs her board and begins paddling out. The wave\n               comes and it's all she can do to stay on her board. She\n               struggles and falls at the end. She will clearly not be a\n               factor. The big screen shows a 0 in a column after the\n               grounds score.\n\n               We look back to the bleachers to polite applause, but the\n               COLONEL and the grounds kids are clearly disappointed.\n\n               COWBOY is out there now, the wave comes and he catches it\n               easily. He rides the wave gracefully and well, and kicks out\n               at the end. The big screen shows an 8 in the lifeguard row.\n               The lifeguards and RICHARD are cheering now.\n\n               ROBBIE is next. He catches the wave and rides it more\n               aggressively than COWBOY, but nearly falls at the end of his\n               run. The big screen shows an 8. The concessions kids and\n               AOKEE are very enthusiastic. They can see they have a chance\n               with ROBBIE. PIPEMAN is watching from a far corner.\n\n               MELINDA begins her second run. She is a little more\n               confident this time, but still seems barely able to stand and\n               ride the wave. More polite applause, and the big screen\n               shows a 5.\n\n               COWBOY catches his wave, and tries to imitate ROBBIE'S more\n               aggressive style, but falls midway through the run. We hear\n               a large gasp from the crowd as this happens.\n\n               The crowd applauds politely, and the guards are supportive\n               but disappointed. We see the JUDGES confer and the big screen\n               shows a 0.\n\n               ROBBIE gets his wave, and surfs it aggressively again, this\n               time not nearly falling at all. The JUDGES nod approvingly\n               and confer. The big screen shows a 9. The crowd goes wild,\n               especially the concessions kids.\n\n               Melinda begins her final run. She does better than the past\n               two, but not significantly. The JUDGES confer and the screen\n               shows a 5. The ground kids are very disappointed, they know\n               they are out of it now. THE COLONEL shakes MELINDA'S hand\n               and thanks her for her efforts.\n\n\n\n\n\n<b>\n</b>    Page 74 of 81\n\n               COWBOY gets his wave, and has clearly decided to go back to\n               his original style; he rides the wave gracefully, but takes\n               no chances.\n\n               He kicks out at the end with a wave and a smile. The guards\n               applaud, hoping to make it seem better than it was, and the\n               JUDGES confer and the screen shows an 8.\n\n               ROBBIE snags his wave and rides it aggressively again, but\n               loses his balance momentarily. It costs him; the JUDGES\n               confer and the screen shows a 7.\n\n               The concessions kids applaud, and the point totals show\n               \"Grounds   98\", \"Concessions 102\" and \"Lifeguards 102\".\n\n               EVERYONE is confused, there has never been a tie before. THE\n               JUDGES Are flipping through papers, and BIG MIKE steps up to\n               the microphone.\n\n<b>                                  BIG MIKE\n</b>                            (clearing his throat,\n                             flustered)\n                        It looks like we have a tie. This has\n                        never happened before, but I seem to\n                        remember we provided for this possibility\n                        in the rules. Hopefully our judges can\n                        help us figure out what to do!\n\n               The HEAD JUDGE is reading to the other JUDGES out loud, slaps\n               his hand on one of the papers and comes up to the mike.\n\n<b>                                  HEAD JUDGE\n</b>                        Reading from the rules, \"...in the event\n                        of a tie at the end of three heats in the\n                        surf competition, the teams who are tied\n                        will participate in a sudden-death surf\n                        off. Additional heats will be run until\n                        a winner can be declared.\"\n                            (looking up at the crowd)\n                        The \"Sudden Death\" heat will begin in\n                        five minutes.\n\n               Everybody cheers...they're going to see some more great\n               surfing.\n\n               The JUDGES signal COWBOY and ROBBIE to come over. The head\n               JUDGE takes a quarter out of his pocket and points to COWBOY\n               to call it. It lands and the JUDGE looks at it. HE points\n               to ROBBIE.\n\n<b>                                   HEAD JUDGE (CONT'D)\n</b>                         You want to go first or second?\n\n<b>                                   ROBBIE\n</b>                         Second.\n\n<b>                                  HEAD JUDGE\n</b>                        Be ready in five minutes.\n\n<b>     70        EXT -MOMENTS LATER - AOKEE'S SURF &amp; SNACK SHACK                70\n</b>\n\n\n\n<b>\n</b>    Page 75 of 81\n\n\n               ROBBIE, ALEX, AOKEE and PIPEMAN have gathered in front of\n               AOKEE's to strategize.\n\n<b>                                   AOKEE\n</b>                         So what you do?   Wait for him to go crazy\n                         and fall?\n\n<b>                                   ROBBIE\n</b>                         Don't want to win with him falling.\n\n<b>                                   PIPEMAN\n</b>                         You could always go out and do your very\n                         best, take a lot of chances and maybe win\n                         this thing on merit.\n\n<b>                                   ALEX\n</b>                             (dismissive)\n                         Don't be silly. That only works in the\n                         movies.\n\n<b>                                   ROBBIE\n</b>                             (shakes his head)\n                         Actually, that's exactly what I'm\n                         thinking. It's the reason we're in a\n                         tie. I've been too conservative. I've\n                         got to do everything I can, or just\n                         forget about it. It's all or nothing.\n                             (pause)\n                         We gotta pull the fin.\n\n<b>                                   AOKEE\n</b>                         Pull da fin?\n\n<b>                                   PIPEMAN\n</b>                         You think you can hold it?\n\n<b>                                  ROBBIE\n</b>                            (explaining)\n                        One time, these tourists from Japan on\n                        the beach at La Jolla offered me a\n                        hundred bucks to do a full spin at the\n                        top of the wave, and then slide down and\n                        cut back and do a full back flip. I\n                        pulled it off. A friend of mine had a\n                        tricks board with just a single fin and\n                        foot pockets.\n\n<b>                                   PIPEMAN\n</b>                         We gotta pull the fin. What do we do\n                         about the foot pockets?\n\n<b>                                   ROBBIE\n</b>                         You got duct tape?\n\n               PIPEMAN reaches into his tool belt and pulls out a roll.\n\n<b>                                  PIPEMAN\n</b>                        What kind of plumber would I be if I\n                        didn't have duct tape? Water World\n\n\n\n\n<b>\n</b>    Page 76 of 81\n\n                         Platinum!   Where do you want them?\n\n               They place the board on a table. ROBBIE pulls off two small\n               pieces of tape and places them on the board.\n\n<b>                                   ROBBIE\n</b>                         Here and here.\n\n               PIPEMAN gets his screw gun out of his tool belt and begins\n               removing the two outer fins of the board. He then begins\n               looping duct tap around the board to create two foot pockets.\n\n               This provides a background to the dialog below.\n\n<b>                                   AOKEE\n</b>                         So, help me understand.      What you do now?\n\n<b>                                   ROBBIE\n</b>                         Pipeman is taking the extra fins off my\n                         board. I only need one to make a deep\n                         cut back. He is also putting some\n                         pockets to slip my feet into so when I\n                         flip upside down, I don't lose the board.\n\n<b>                                   ALEX\n</b>                         Flip upside down?\n\n<b>                                   ROBBIE\n</b>                         A back flip. You guys see it on\n                         snowboarders here all the time, I'm sure.\n\n<b>                                   ALEX\n</b>                         Oh yeah, I'm sure I did that last winter.\n                         But not on purpose! Dude. You're either\n                         gonna win this thing or you're gonna die.\n\n<b>                                   AOKEE\n</b>                             (quickly, eagerly)\n                         It would be better if you won.\n\n<b>                                   ROBBIE\n</b>                         Yeah, well, a tie is like kissing your\n                         sister.\n\n<b>                                   ALEX\n</b>                             (mock anger)\n                         You stay away from my sister.\n\n               We hear an air horn blast.      They are ready to start.\n\n<b>                                     PIPEMAN\n</b>                         Ready!\n\n<b>                                   ROBBIE\n</b>                             (to PIPEMAN)\n                         I'll need the biggest wave you can give\n                         me...\n\n<b>                                   PIPEMAN\n</b>                             (imitating Mr. Scott on Star\n\n\n\n\n<b>\n</b>     Page 77 of 81\n\n                              Trek)\n                         I'll give 'er all she's got, Cap'n!\n\n               He hands Robbie the board. ALEX heads back to the bleachers\n               area, PIPEMAN goes to the pumphouse in back of Thunder Bay.\n\n               AOKEE hangs back with ROBBIE and speaks to him alone.\n\n<b>                                   AOKEE\n</b>                             (dropping his Hawaiian accent)\n                         Robbie. When you do this, do this mostly\n                         for Robbie Zirpollo. But do it just a\n                         little bit for Manny Ramirez, eh?\n\n               AOKEE smiles and pats him on the back.    Robbie nods.    They\n               head for the bay.\n\n<b>     71        EXT. MORNING - MOMENTS LATER - THUNDER BAY                       71\n</b>\n               COWBOY is in the water paddling out to get his wave. It\n               comes and he has apparently decided to stay with what has\n               gotten him this far; a conservative style that keeps him\n               looking good without falling. His ride is similar to the\n               last one, but even more graceful and lyrical and he gets a 9.\n\n<b>                                   ALEX\n</b>                             (to ROBBIE)\n                         Looks like he's waiting for you to make a\n                         mistake. You sure you know what you're\n                         doing?\n\n<b>                                   ROBBIE\n</b>                         I'm just making this up as I go along.\n\n<b>                                   ALEX\n</b>                         Works for me! Go get 'em.\n\n               ROBBIE appears on the seawall holding his board and looking\n               out first at the bay, then at the crowd. His mom, CONNIE\n               waves, and he smiles weakly.\n\n               HE sees KATIE and she looks hopeful. She hasn't given up on\n               him completely. He smiles at her and gets into the water.\n\n               He begins paddling. It seems to take forever for him to get\n               out to the spot where he catches the wave, but he finally\n               arrives.\n\n               He sits there for a moment, collecting himself, then raises\n               his hand to signal he is ready.\n\n               The CONCESSIONS KIDS have started to chant, ROBBIE! ROBBIE!\n               The guards are anxious, but even they can't help moving to\n               the cadence of the chant.\n\n               The wave comes and he catches it quickly, and slips his feet\n               into the duct tape pockets. He misses one pocket at first,\n               then gets it in.\n\n               He rides it carefully and at the right moment slides up to\n\n\n\n\n<b>\n</b>      Page 78 of 81\n\n               the top and executes a full 360 degree turn out of the water.\n\n               On landing back on the downside of the wave, he slides down\n               it quickly, and then turns around with a deep cut and heads\n               straight into the wave. At the top he bounces and does a\n               complete back flip in slow motion.\n\n               We see the crowd also in slow motion. AOKEE Is covering his\n               eyes, he can't watch. ALEX's face is contorted with\n               disbelief. Various faces in the crowd are in open-mouthed\n               disbelief. THE JUDGES are staring intently, focussed so as\n               not to miss anything.\n\n               ROBBIE lands the flip, and rides the rest of the wave.      He\n               waves to the crowd, and kicks off, exhausted.\n\n               The place goes nuts. No one here has ever seen anything like\n               this before. AOKEE and ALEX run into the water and help him\n               out. People are still cheering.\n\n               COWBOY knows he's in trouble.\n\n               THE JUDGES confer only momentarily and the score 10 appears,\n               and the word concessions starts flashing along with the word\n               winner. COWBOY nods in agreement.\n\n               TIFFANY says something to him, and he appears angry.      We can\n               only hear part of his response, something like:\n\n<b>                                   COWBOY\n</b>                             (disbelief)\n                         You did WHAT?\n\n               AOKEE and ALEX lead him up to the grandstand. COWBOY also\n               makes his way up there, and we see him talking to BIG MIKE.\n               BIG MIKE nods in agreement and COWBOY goes to the mike as the\n               crowd settles down.\n\n<b>                                   COWBOY (CONT'D)\n</b>                         As last year's Surfer King, it's my\n                         privilege to present this year's trophy\n                         to the most amazing surfer on the water\n                         today. Robbie! Congratulations.\n\n               COWBOY shakes ROBBIE's hand, and ROBBIE speaks at the mike.\n\n<b>                                   ROBBIE\n</b>                             (holding trophy)\n                         I just want to thank Aokee, Alex and\n                         Katie for all their support.\n\n               We see KATIE clapping, crying.   AOKEE and ALEX are clapping\n               and smiling.\n\n<b>                                   ROBBIE (CONT'D)\n</b>                         And I have just one thing to say to\n                         everyone in concessions. WE DID IT!\n\n               ROBBIE holds the trophy high as everyone cheers.\n\n\n\n\n\n<b>\n</b>     Page 79 of 81\n\n<b>                                                                FADE TO BLACK.\n</b>\n<b>     72        EXT. EARLY EVENING SURFS WAVE POOL                              72\n</b>\n               Grounds kids are stacking chairs in preparation for final\n               closing. Tarps are being thrown over everything and tied\n               down.\n\n               Awnings are being taken down.     Chairs and tables are being\n               moved.\n\n               We see JAFFA packing up his CD's into that cardboard box.       HE\n               also snaps the winter covers for the sound equipment into\n               place.\n\n<b>     73        EXT. MOMENTS LATER - EVENING TIME OUT SHACK                     73\n</b>\n               A banner hangs over the time shack, \"Thanks for another great\n               year\". ALEX, ROBBIE, KATIE and AMY are clocking out for the\n               final time this summer.\n\n               They all stop and look around one final time.     Suddenly\n               TIFFANY drives up in her convertible.\n\n<b>                                   TIFFANY\n</b>                         Another summer gone. How about it\n                         Robbie? You gonna guard next year?      They\n                         could use your help.\n\n               They all walk closer to her car.\n\n<b>                                   ROBBIE\n</b>                         I don't know...we have a pretty good time\n                         at AOKEE's.\n\n<b>                                   TIFFANY\n</b>                         You know, that's what I hear. Maybe I\n                         should work there next summer.\n\n               ALEX, ROBBIE, KATIE and AMY all say these lines pretty much\n               at the same time.\n\n<b>                                   ROBBIE\n</b>                         You wouldn't like it...\n\n<b>                                   ALEX\n</b>                         That's a bad idea...\n\n<b>                                   KATIE\n</b>                         And you're such a good guard...\n\n<b>                                   AMY\n</b>                         You'd be miserable...\n\n<b>                                   TIFFANY\n</b>                         Maybe you're right.    See you around...\n\n               EDDIE appears out of the time shack wearing his tuxedo t\n               shirt.\n\n\n\n\n\n<b>\n</b>    Page 80 of 81\n\n<b>                                   EDDIE\n</b>                             (almost singing)\n                         Tiffany!\n\n               He walks up to her driver's side.\n\n<b>                                   TIFFANY\n</b>                             (feeling charitable, warmly)\n                         Hello, Eddie.\n\n               EDDIE shows there is nothing in his hands, then reaches into\n               the car and from behind TIFFANY's ear pulls a plastic Easter\n               Egg out. He hands it to her, and she opens it. A beautiful\n               butterfly flies out and away. She is momentarily entranced.\n\n<b>                                    TIFFANY (CONT'D)\n</b>                         You know, that's one of the most\n                         beautiful things I've ever seen.\n                             (pause, thinking, what the\n                              heck)\n                         Hop in Eddie, let me give you a ride\n                         home.\n\n               EDDIE waves his hand for HER to scoot over so he can drive.\n               She is surprised, but does, almost reflexively. He gets in\n               and he looks at ALEX, ROBBIE, KATIE and AMY grinning broadly\n               as he pulls away.\n\n               ALEX, ROBBIE, KATIE and AMY just watch in stunned silence as\n               EDDIE and TIFFANY drive off.\n\n<b>                                   ALEX\n</b>                             (collecting himself)\n                         Well. Just another summer at Water\n                         World.\n\n               The group begins walking toward the exit gate, as we go wide\n               and helicopter upward. They get smaller and smaller in the\n               shot as we hear the conversation continue.\n\n<b>                                   ROBBIE\n</b>                         You know Katie, I really am sorry I was\n                         such a jerk this summer.\n\n<b>                                  KATIE\n</b>                        We'll be going to the same high school.\n                        You'll have plenty of chances to make it\n                        up to me. Let's see, there's Homecoming,\n                        the Christmas Dance, Valentines Day...and\n                        of course, the prom...\n\n<b>                                   ROBBIE\n</b>                         Alex?\n\n<b>                                   ALEX\n</b>                         Yeah?\n\n<b>                                   ROBBIE\n</b>                         I'm gonna need to borrow twenty bucks.\n\n\n\n\n\n<b>\n</b>    Page 81 of 81\n\n<b>                                     ALEX\n</b>                         Yep.\n\n               We helicopter up for a final shot over the whole park.\n\n<b>                                          \n</b>\n<b>                                    THE END\n</b>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Surfer-King,-The.jpg\"/>\n</td><td><h1>Surfer King, The</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Bernard Murray Jr\" title=\"Scripts by Bernard Murray Jr\">Bernard Murray Jr</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Surfer King, The Script.html#comments\" title=\"Surfer King, The comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:17:40.176222"}