{"title": "Surrogates", "film_link": "/Movie Scripts/Surrogates Script.html", "script_link": "/scripts/Surrogates.html", "info_raw": "\n\nSurrogates Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  John Brancato  Michael Ferris  Robert Venditti\nGenres  Action  Sci-Fi  Thriller\nScript Date : October 2007\nMovie Release Date : September 2009\n\nRead \"Surrogates\" Script\n\n\n", "script": "\n\r\n\r\n \r\n                                  SURROGATES\r\n\r\n\r\n\r\n                                  Written by\r\n\r\n                        John Brancato & Michael Ferris\r\n\r\n\r\n\r\n                          Based on the graphic novel\r\n\r\n                               \"THE SURROGATES\"                         \r\n\r\n                                      By\r\n\r\n                               Robert Venditti\r\n\r\n\r\n\r\n                                                 October 16, 2007\r\n\r\n          FADE IN ON:\r\n\r\n          EXT. CITY STREETS - NIGHT -- MOVING\r\n\r\n          A DISTORTED IMAGE of downtown city streets at night.\r\n          This is not a FISHEYE LENS, but the REFLECTION in the\r\n          mirrored surface of a helmet visor.\r\n\r\n          EXT. LUXURY BUILDING - NIGHT\r\n\r\n          A near-future MOTORCYCLE stops near a dramatic HIGH-RISE\r\n          RESIDENTIAL BUILDING. The rider, clad in black leather,\r\n          climbs off his machine. We'll call him the ASSASSIN.\r\n          He flips up his VISOR. His face is scarred, stubbly. He\r\n          conceals himself in an alcove, eyes never leaving the\r\n          building's entrance.\r\n          A uniformed DOORMAN opens the high-rise's lobby door for\r\n          a HANDSOME YOUNG MAN in a TUXEDO and TRENCHCOAT.\r\n          THE ASSASSIN has been waiting for this. He removes what\r\n          looks like a rifle scope from his jacket, aims it at\r\n\r\n          TUXEDO.\r\n          SCOPE POV - focusing on TUXEDO'S FACE, magnified. A\r\n          digital readout: \"SCANNING...\" Then a long SERIAL\r\n          NUMBER reads out and the name, \"LIONEL ALEXANDER CANTER,\"\r\n          along with other personal information below.\r\n          THE ASSASSIN puts away the scanner scope, satisfied. He\r\n          reaches a hand into a pocket, withdraws a mysterious\r\n          DEVICE. The size of a first generation cellphone, it has\r\n          a military look, with a clear sliding panel over safety\r\n          switches and buttons.\r\n          The ASSASSIN hurries toward TUXEDO, but before he can\r\n\r\n                         REACH HIM--\r\n          A sleek, futuristic LIMOUSINE pulls up and TUXEDO gets in\r\n          the back. They're gone in an instant.\r\n          The ASSASSIN, frustrated, dashes for his MOTORCYCLE. He\r\n          starts it and pursues the limousine.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          2.\r\n\r\n          EXT. WASHINGTON D.C. - NIGHT\r\n\r\n          THE MOTORCYCLE pursues the LIMOUSINE along the Potomac,\r\n          D. C. LANDMARKS visible in the distance.\r\n\r\n          EXT. KENNEDY CENTER - NIGHT\r\n\r\n          FORMAL CROWDS, a RED CARPET, signs for an OPERA. The\r\n          LIMOUSINE approaches.\r\n\r\n          INT. LIMOUSINE - NIGHT\r\n\r\n          TUXEDO leans forward to the DRIVER, a muscular, handsome\r\n          man in a suit named ARMANDO.\r\n\r\n                         TUXEDO\r\n          I'm not really in the mood for\r\n          opera, Armando.\r\n          ARMANDO nods knowingly pulls back into traffic.\r\n\r\n                         ARMANDO\r\n          F Street?\r\n\r\n                         TUXEDO\r\n\r\n                         (UNDOING BOWTIE)\r\n          You read my mind. Let's not\r\n          mention this to my Dad...\r\n          As he speaks, he passes a few BILLS over the seat.\r\n\r\n          EXT. WAREHOUSE DISTRICT - NIGHT\r\n\r\n          THE LIMO moves through this seemingly deserted area,\r\n          pulls up near a STEEL DOOR with a spray-painted X.\r\n          TUXEDO emerges sans jacket and tie, his dress-shirt open.\r\n\r\n                         TUXEDO\r\n          I can find my way back.\r\n          ARMANDO nods and pulls away. TUXEDO moves toward the\r\n          entrance, says a word into an INTERCOM with a\r\n          SURVEILLANCE CAMERA. The door opens within moments, he\r\n          disappears inside.\r\n          THE ASSASSIN parks his bike, a few steps behind. Tuxedo\r\n          has vanished through the STEEL DOOR before he can catch\r\n          up with him.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          3.\r\n\r\n                         CONTINUED:\r\n          The ASSASSIN takes off his helmet, tries the door. It\r\n          won't move. He buzzes the intercom. The DOOR slides\r\n          open a crack--\r\n          THE BOUNCER is a huge, bald man with JET BLACK skin, RED\r\n          EYES and TEETH that glow fluorescently. The THROBBING\r\n          BEAT of MUSIC within. The BOUNCER narrows his eyes.\r\n\r\n                         BOUNCER\r\n          This is a private club.\r\n\r\n                         ASSASSIN\r\n          I just need to talk to--\r\n          THE STEEL DOOR has already shut in his face.\r\n\r\n          INT. THE PIT - NIGHT\r\n\r\n          POUNDING MUSIC. BODIES SLAM together in a brutal mosh\r\n          pit, MEN and WOMEN. All are young, some beautiful,\r\n          others extremely decorated and pierced. They tear at\r\n          each other brutally, trying to do real damage. On the\r\n          edges of the pit, individual FISTFIGHTS go on. An\r\n          incongruous CHANDELIER overhead, gilt-edged MIRRORS on\r\n          the walls-- the FIGHTERS SLAM INTO and SHATTER them.\r\n          A HARD-CORE BAND plays on an elevated stage. The\r\n          MUSICIANS are heavily punked out, in outlandish clothes,\r\n          with pierced faces, tattoos and body make-up.\r\n          IN A VIP AREA, a balcony elevated above the stage,\r\n          numerous BEAUTIFUL PEOPLE at tables. Many are making\r\n          out, gay, straight, threesomes-- orgies happen up here.\r\n          TUXEDO sits by himself. He raises a GLASS TUBE attached\r\n          to a CORD, one of a few leading into an ELECTRONIC DEVICE\r\n          on the table. As he brings the tube close to his own\r\n          neck, an ARC of electricity jumps to his skin. His\r\n          features go slack, a shudder goes through him. Then he\r\n          lowers the tube with a smile. He's using a JACKER-- a\r\n          sort of electro-shock hookah. A SHOUT over the MUSIC:\r\n\r\n                         BLONDE\r\n          Mind if I join you?\r\n          A stunningly beautiful BLONDE in edgy, dramatic clothes\r\n          stands nearby. Tuxedo, recovering from the hit, gestures\r\n          graciously for her to sit. She picks up one of the\r\n          cords, gives him a sly smile. She opens her mouth,\r\n          SPARKS fly to her tongue and--\r\n\r\n                         CUT TO:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          4.\r\n\r\n          EXT. ALLEYWAY - NIGHT\r\n\r\n          RAIN pours down as TUXEDO and the BLONDE burst out the\r\n          door, laughing. He pushes her against a brick wall, they\r\n          grope each other hungrily, hands inside clothes, getting\r\n          drenched in the warm downpour.\r\n          WITH THE ASSASSIN, wearing his HELMET with the VISOR UP,\r\n          as he approaches the entwined couple. TUXEDO hears him,\r\n\r\n                         TURNS--\r\n\r\n                         TUXEDO\r\n          Get lost, meatbag.\r\n\r\n          EXT. WAREHOUSE DISTRICT - NIGHT\r\n\r\n          ANGLE ON the alley's mouth as we hear the BLONDE'S\r\n          SCREAM. Seconds later she staggers out, clutching her\r\n          head, and collapses to the pavement. We hear an ENGINE\r\n          START from the alleyway.\r\n          THE ASSASSIN emerges on his bike, rides directly over her\r\n          body unconcerned-- and ROARS into the night.\r\n          CAMERA PULLS UP to--\r\n\r\n          EXT. WASHINGTON D.C. - NIGHT\r\n\r\n          --an AERIAL VIEW of the rain-swept CITY, some futuristic\r\n          HIGH-RISES amongst the recognizeable landmarks. Also, a\r\n          great number of SUPER-CELL TOWERS and DISHES,\r\n          considerably larger than the ones we see today.\r\n          CAMERA PICKS UP SPEED, moves quickly to a run-down part\r\n          of the city, tenements and vacant lots. MOVE DOWN and\r\n          through a third-story window of--\r\n\r\n          INT. ABANDONED PROJECT BUILDING - NIGHT\r\n\r\n          A dark, decaying hallway. A MAN and a WOMAN move\r\n          stealthily up the stairs, LASER-SIGHT GUNS in hand.\r\n          The man is THOMAS GREER, the woman JENNIFER PETERS. Both\r\n          are about 30, handsome, athletic. Greer's spent his life\r\n          in law enforcement. He's smart and able, wants things to\r\n          make sense-- but as the world changes around him, he\r\n          feels he's losing the thread. PETERS is junior to Greer,\r\n          her attitude's professional but rigid, by the book.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          5.\r\n\r\n                         CONTINUED:\r\n          GREER, in the lead, waves PETERS up. They approach a\r\n          door at the end of the hall. We see now that their\r\n          windbreakers read \"FBI.\"\r\n          GREER kicks open the door--\r\n\r\n          INT. PSYCHO'S LAIR - NIGHT\r\n\r\n          Lit by CANDLES and KEROSENE LANTERNS, SMOKE HANGS in the\r\n          room. We glimpse BODIES hanging from the ceiling in\r\n          CHAINS. GREER and PETERS train their LASERS around the\r\n          place, disturbed by the scene. A flash of MOVEMENT in a\r\n          bedroom and a CRASH--\r\n          THE PSYCHO who lives here has kicked over a LANTERN, FIRE\r\n          spills across the floor. We glimpse a surprisingly good-\r\n          looking guy, grinning maniacally. He dashes across the\r\n\r\n                         ROOM--\r\n          GREER squeezes off a couple of SHOTS. The PSYCHO's too\r\n          fast, he LEAPS through a cracked WINDOW.\r\n\r\n          EXT. ABANDONED PROJECTS - NIGHT\r\n\r\n          RAIN has let up. The PSYCHO FALLS thirty feet into a\r\n          pile of soft DIRT and TRASH. He rolls to the bottom,\r\n          gets to his feet and runs.\r\n          GREER looks down from the broken window.\r\n\r\n          INT. PSYCHO'S LAIR - NIGHT\r\n\r\n          PETERS is beating at the FLAMES with a towel, sees Greer\r\n          is preparing to jump.\r\n\r\n                         PETERS\r\n          Let's call for back-up.\r\n\r\n                         GREER\r\n          Where'.s the sport in that?\r\n\r\n                         PETERS\r\n\r\n                         IT'S PROTOCOL--\r\n          GREER SNORTS and--\r\n\r\n          EXT. ABANDONED PROJECTS - NIGHT\r\n\r\n          --LEAPS, GREER hits the dirt hard and rolls. He reaches\r\n          the ground and sets off after the PSYCHO at top speed.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          6.\r\n\r\n                         CONTINUED:\r\n          PLAY A FRANTIC FOOT CHASE, both men scramble over chain-\r\n          link fences, leap over trashed cars.\r\n          GREER pursues the PSYCHO around a corner, into a\r\n          passageway between buildings--\r\n          --wherethePSYCHO gets the jump on him, SWINGS a length\r\n          of pipeathis head. Greer ducks fast, the blow catches\r\n          him inthearm, he drops his gun. The PSYCHO moves to\r\n          pick uptheweapon, but Greer tackles him against a\r\n          dumpster.\r\n          Greer SLAMS the dumpster lid on the man repeatedly.\r\n\r\n                         GREER\r\n          You have the right to remain silent--\r\n          But the PSYCHO has grabbed something from the trash,\r\n          manages to SQUIRT BUG SPRAY in Greer's eyes.\r\n          Greer's blinded temporarily, the PSYCHO squirms away,\r\n          running from between buildings across a street--\r\n          WHAM! He's hit full-on by a SEMI, his body FLIES through\r\n          the air. He LANDS HARD on cement, but amazingly is still\r\n          alive. He tries to get up, but--\r\n          GREER plants a foot on his chest and holds him fast\r\n          against the ground. Greer, still wiping at this eyes,\r\n          points his weapon at the PSYCHO's head.\r\n\r\n                         GREER (CONT'D)\r\n          Stay with me asshole--\r\n\r\n                         PSYCHO\r\n          Why would I do that?\r\n          The PSYCHO grins-- then his head lolls back, eyes empty.\r\n\r\n          INT. PSYCHO'S LAIR - NIGHT\r\n\r\n          PETERS is by a WOMAN'S BODY on the floor, holding a\r\n          pocket SCANNER close to her head. This small device\r\n          resembles an iPhone. There's tape over the woman's eyes\r\n          and mouth, which Peters peels away as she speaks into a\r\n          tiny cellphone earpiece.\r\n\r\n                         PETERS\r\n          Is this Kathy Welles...? My name\r\n          is Jennifer Peters, with the FBI's\r\n          surrogate crime division...\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          7.\r\n\r\n                         CONTINUED:\r\n          ON SCANNER-- the name \"KATHY WELLES,\" \"REPORTED STOLEN,\"\r\n          contact information below.\r\n\r\n          EXT. ABANDONED PROJECTS - NIGHT\r\n\r\n          ON GREER'S SCANNER - \"NEW-U RENTAL AGENCY,\" with an ID\r\n          NUMBER, but no name.\r\n          GREER kneels beside the PSYCHO's body, pockets his\r\n          scanner. He's angry but resigned, he was half expecting\r\n          this.\r\n          THE SEMI DRIVER is still behind the wheel of his rig. He\r\n          calls out to Greer:\r\n\r\n                         SEMI DRIVER\r\n          Am I in trouble?\r\n\r\n                         GREER\r\n          (waves him off)\r\n          Nah, go back to work.\r\n          GREER rises as his PHONE CHIMES, he touches his earpiece.\r\n          IN BG, the DRIVER pulls away.\r\n\r\n                         GREER (CONT'D)\r\n\r\n                         PETERS (FILTER)\r\n\r\n                         GREER\r\n          He's a rental.\r\n          He disconnects, reaches to turn the PSYCHO's head to one\r\n          side. The back of his skull is smashed. Instead of gore\r\n          and brains, we see torn GRAY PLASTIC and dense CIRCUITRY,\r\n          oozing pinkish hydraulic fluid at his neck.\r\n          We're in a world of SURROGATES, remotely operated\r\n          synthetic humans (also known as SYNTHs). These are not\r\n          artificially-intelligent robots-- each is linked directly\r\n          to a human being, miles or hundreds of miles away.\r\n          Surrogates are distinguishable from flesh-and-blood\r\n          humans primarily by their physical perfection-- ugly\r\n          surrogates are rare. On closer look, their eyes may have\r\n          an inhuman quality. Without a human mind sending and\r\n          receiving impulses, they are completely inert.\r\n          Suddenly the PSYCHO comes to life, spins his head around\r\n          at an impossible angle and BITES GREER'S HAND.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          8.\r\n\r\n                         CONTINUED:\r\n          He won't let go. Greer stomps on the-PSYCHO's head,\r\n          reaches with his other hand into the back of the skull to\r\n          wrench out a CIRCUIT BOARD. The PSYCHO finally stops\r\n          writhing, disconnected.\r\n\r\n          INT. PSYCHO'S LAIR - NIGHT\r\n\r\n          PETERS talks on the phone while scanning a SEVERED HEAD.\r\n\r\n                         PETERS\r\n          I don't recommend reconnecting,\r\n          Ms. Welles... hello?\r\n          The WOMAN on the floor TWITCHES, her eyes open. She sits\r\n          up on her elbows, looks down to see--\r\n          --her legs are gone. The bottom half of her is missing,\r\n          her tattered T-shirt covers the damage, soaked with dark\r\n          green and pink liquids-- coolant and hydraulic fluids.\r\n\r\n                         VICTIM\r\n          Aw crap, I'm totalled!\r\n\r\n                         PETERS\r\n          Your insurance ought to cover it.\r\n\r\n          EXT. ABANDONED PROJECTS - NIGHT\r\n\r\n          GREER trudges toward the building, on his cell, leaving\r\n          the body behind. He turns the CIRCUIT BOARD over in his\r\n          fingers.\r\n\r\n                         GREER\r\n          --trash pick-up on Maple and 4th.\r\n\r\n                         DISPATCHER (FILTER)\r\n          Coulda just called it in, we'd a\r\n          shut him down from here--\r\n\r\n                         GREER\r\n          Any ID from the rental agency?\r\n\r\n                         DISPATCHER (FILTER)\r\n          Yeah, got a name from their office in\r\n          Miami. Ness, Harold P.\r\n\r\n                         GREER\r\n\r\n                         (A BEAT)\r\n          Harry P. Ness.\r\n\r\n                         DISPATCHER\r\n          Oh. False ID?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          9.\r\n\r\n                         CONTINUED:\r\n\r\n                         GREER\r\n          You think?\r\n\r\n                         DISPATCHER\r\n          Don't be in a rush to get home,\r\n          Tom. Two surries down outside The\r\n          Pit, hard-core club on F street.\r\n          GREER picks up the pace, heads OUT OF FRAME.\r\n\r\n                         CUT TO:\r\n\r\n          EXT. WAREHOUSE DISTRICT - NIGHT\r\n\r\n          START ON THE BLONDE, eyes empty, face against the cement.\r\n\r\n                         PETERS\r\n          Abandoned.\r\n\r\n                         GREER\r\n          Or something happened to the operator.\r\n          GREER and PETERS stand over the corpse, a UNIFORM stands\r\n          nearby. Greer holds his SCANNER near her head.\r\n\r\n                         GREER (CONT'D)\r\n          Registered to a Cameron Michaels,\r\n          out in Clarksburg...\r\n\r\n                         (TO UNIFORM)\r\n          You call her?\r\n\r\n                         UNIFORM\r\n          Left a message.\r\n          GREER is leaning closer to the dead Blonde's face.\r\n          X-CLOSE-- CRACKS in the GLASS of her eye. We see GREER'S\r\n          FRAGMENTED REFLECTION as he peers at this.\r\n\r\n                         GREER\r\n          Optics are damaged.\r\n\r\n                         PETERS\r\n          Musta cracked when she fell.\r\n\r\n                         (TO UNIFORM)\r\n          There's a second?\r\n          The UNIFORM leads GREER and PETERS past the blonde, into\r\n          the alley.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          10.\r\n\r\n          INT. ALLEYWAY - NIGHT\r\n\r\n          TUXEDO lies on his side, eyes closed. We can hear MUSIC\r\n          THROBBING from within.\r\n\r\n                         UNIFORM\r\n          Couldn't get an ID from this one.\r\n          GREER kneels by Tuxedo, looks at his fancy CUFFLINKS.\r\n\r\n                         GREER\r\n          A tux? Kind of over-dressed for a\r\n          jacker joint.\r\n          GREER pulls out his scanner.\r\n          BY TUXEDO's FACE, the SCANNER reads \"NO SIGNAL.\"\r\n          GREER seems surprised. PETERS looks over his shoulder.\r\n\r\n                         PETERS\r\n          Maybe he's real.\r\n\r\n                         GREER\r\n          Little too pretty for that.\r\n          GREER lifts one of Tuxedo's eyelids-- CLOSE, shattered\r\n          GLASS, ELECTRONICS visible within.\r\n\r\n                         GREER (CONT'D)\r\n          He's synth all right.\r\n\r\n                         PETERS\r\n          Looks like the optics exploded...\r\n          Greer reaches behind Tuxedo's head, pulls out a small\r\n          specially-shaped TOOL and pries up the PANEL at the back\r\n          of Tuxedo's skull. He pulls out--\r\n          THE CIRCUIT BOARD, melted and scorched.\r\n\r\n                         GREER\r\n          So much for the identity chip.\r\n\r\n                         PETERS\r\n          I'll call for a pick-up. Maybe\r\n          diagnostics can make sense of it.\r\n          Greer stands up, looks toward the Blonde's body.\r\n\r\n                         GREER\r\n          Clarksburg's just up the 270,\r\n          let's talk to our witness.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          11.\r\n\r\n                         CONTINUED:\r\n\r\n                         PETERS\r\n          (a glance at her watch)\r\n          You always work these kind of\r\n          hours?\r\n\r\n                         GREER\r\n          Got something better to do?\r\n\r\n                         PETERS\r\n          Besides sleep?\r\n          Greer is already on the move, Peters reluctantly follows.\r\n\r\n                         CUT TO:\r\n\r\n          EXT. 1-270 - NIGHT\r\n\r\n          A slightly futuristic sedan speeds through light late-\r\n          night traffic. We hear the VOICE of the PROPHET:\r\n\r\n                         PROPHET (RADIO)\r\n          You feel you are free. You can be\r\n          what you want, do what you want,\r\n          nothing can hurt you. But you have\r\n          ceased to live.\r\n\r\n          INT. FBI CAR - NIGHT\r\n\r\n          GREER drives. PETERS has her eyes closed in the\r\n          passenger seat. THE VOICE on the RADIO continues IN BG\r\n          through scene.\r\n\r\n                         PROPHET (RADIO)\r\n          You think you control your\r\n          surrogates, but it is they who have\r\n          taken over your lives. You lie in\r\n          your cells, pale and fat prisoners,\r\n          while the puppets walk and dance\r\n          and make love...\r\n          Peters BLINKS and comes to.\r\n\r\n                         GREER\r\n          Welcome back.\r\n\r\n                         PETERS\r\n          (re: the radio)\r\n          Are we actually listening to the\r\n          Prophet? We oughta lock this guy\r\n          up and throw away the key.\r\n          (off Greer's shrug)\r\n          So is this \"know thine enemy?\"\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          12.\r\n\r\n                         CONTINUED:\r\n\r\n                         GREER\r\n          The Human Coalition isn't \"the\r\n          enemy.\"\r\n\r\n                         PETERS\r\n          You're kidding, right? The\r\n          Dreads've gotta be behind half the\r\n          crimes against surries nationwide--\r\n\r\n                         GREER\r\n          \"Dreads...\"\r\n\r\n                         PETERS\r\n          They dread the present, they dread\r\n\r\n                         THE FUTURE--\r\n          (points at radio)\r\n          You know this joker's calling for an\r\n          uprising. In Denver, we got the go-\r\n          ahead to jam his broadcasts.\r\n\r\n                         GREER\r\n          Sounds like they're doing a bang-up\r\n          job out there. Why'd you transfer?\r\n\r\n                         PETERS\r\n          D. C.'s the heart of the action,\r\n          right? Plus my ex and I were in\r\n          the same office, it got a little\r\n          uncomfortable.\r\n\r\n                         (BEAT)\r\n          You get along with your last\r\n          partner?\r\n\r\n                         GREER\r\n          Till he retired. Had no idea he\r\n          was that old.\r\n\r\n                         PROPHET (RADIO)\r\n          .But this I promise: soon the\r\n          abominations shall fall where they\r\n          stand... and on that day of\r\n          resurrection, the dead shall rise...\r\n\r\n          EXT. MODERN APARTMENTS - NIGHT\r\n\r\n          MOVE ACROSS the facade of a suburban apartment complex.\r\n          A RED GLOW suffuses most of the windows, all of which are\r\n          BARRED. In this warm light, we glimpse OPERATORS in\r\n          reclining chairs, motionless. They could be watching TV,\r\n          but no sets are in sight.\r\n          MOVE TO FIND GREER and PETERS as they exit the sedan and\r\n          pass a sign: \"SURROGATE-READY UNITS AVAILABLE.\"\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          13.\r\n\r\n          INT. MODERN APARTMENTS/CORRIDOR- NIGHT\r\n\r\n          GREER and PETERS walk along an almost prison-like\r\n          corridor, SURVEILLANCE CAMERAS, heavy doors. They follow\r\n          an empty-faced walking MANNEQUIN in an ugly pantsuit.\r\n          This is the LANDLADY. Her mouth moves like a\r\n          ventriloquist's dummy as she speaks self-consciously:\r\n\r\n                         LANDLADY\r\n          I been having problems with my\r\n          surrie, this is just a loaner. Is\r\n          there some kind of trouble?\r\n\r\n                         GREER\r\n          Nothing to worry about.\r\n\r\n                         LANDLADY\r\n          Cam's a good tenant, y'know. Pays\r\n          the rent on time, never leaves the\r\n          apartment...\r\n\r\n                         GREER\r\n          Who does?\r\n\r\n                         LANDLADY\r\n          (POUNDS on a door)\r\n          Cam? Wake up, the police are here\r\n          to talk to you...\r\n\r\n          INT. CAM'S APARTMENT - NIGHT\r\n\r\n          The LANDLADY undoes the MULTIPLE LOCKS on the door of a\r\n          small one-room apartment. She opens it and lets GREER\r\n          and PETERS inside. A RED GLOW from the far end of the\r\n          room-- GREER flicks on overheads. The Landlady hovers by\r\n          the door as they move into the place.\r\n          It's minimalist, nothing on the walls. Empty pizza\r\n          boxes. Skirts, stockings, high-heels strewn around\r\n          haphazardly. We also glimpse a large CHARGING CRADLE,\r\n          contact points embedded in the foam inside, shaped to\r\n          accomodate a curvaceous female body.\r\n\r\n                         GREER\r\n          Hello?\r\n          A fat, hairy arm hangs over the side of a high-tech\r\n          CHAIR. The two feds move quickly to see--\r\n          --CAMERON MICHAELS, a 40-ish, overweight, bald male in\r\n          his underwear. BLOOD runs from his nose, his face\r\n          twitches slightly; he lies in a STIM CHAIR.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          14.\r\n\r\n                         CONTINUED:\r\n          STIM CHAIRS resemble-oversized massage chairs, contoured\r\n          to the body, with padded head supports. They vibrate and\r\n          electronically stimulate the user to prevent atrophy.\r\n          A SENSORY PROJECTOR sits beside the chair. This device\r\n          looks like a COMPUTER TOWER. It's linked to an elaborate\r\n          HEADSET, with contact points around the skull. There's\r\n          also a MONITOR SCREEN which displays the operator's\r\n          remote POV.\r\n\r\n                         LANDLADY\r\n          Oh my God, Cameron--\r\n          GREER quickly detaches the headset, rips a small\r\n          ELECTRONIC SLEEVE off of Cameron's fingertip. He checks\r\n          the man's pupil response and pulse.\r\n\r\n                         GREER\r\n          Call the paramedics.\r\n          While Peters calls in BG, GREER moves to the PROJECTOR'S\r\n          MONITOR SCREEN and taps a touchpad.\r\n          ON SCREEN - STATIC. GREER REWINDS to POVs at the hard-\r\n          core CLUB. FAST FORWARD to the ALLEY, making out with\r\n          TUXEDO. This is a recording of recent experience, as\r\n          seen through the eyes of the BLONDE.\r\n          GREER switches to real-time. Tuxedo breaks the kiss and\r\n          turns to look OS.\r\n\r\n          TUXEDO (ON SCREEN)\r\n          Get lost, meatbag.\r\n          As Tuxedo turns back TO CAMERA, we hear a hideous\r\n          ELECTRONIC SCREECH, Tuxedo's face contorts in pain... and\r\n          his EYES BURST, fragments of GLASS and ELECTRONICS fly.\r\n          The POV reels, we hear the Blonde's SCREAM-- and STATIC\r\n          again fills the screen.\r\n          GREER is disturbed by this, looks again at the\r\n          unconscious, quivering face of the man in the chair.\r\n\r\n                         CUT TO:\r\n\r\n          INT. D.C. SUBWAY - NIGHT\r\n\r\n          A mostly empty car, scattered SURRIE PASSENGERS ride\r\n          stiffly, zoned out, empty expressions... except for a\r\n          long-haired DREAD, one of the anti-surrogate fanatics.\r\n          He's disheveled, hippyish, SHOUTS into the empty faces of\r\n          the surrogates.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          15.\r\n\r\n                         CONTINUED:\r\n\r\n                         DREAD\r\n          Wake up! Wake up! Zombies!\r\n          Shitpuppetsl Abominations!\r\n          He moves to a YOUNG COUPLE, both slack-faced, on standby.\r\n\r\n                         DREAD (CONT'D)\r\n          Wake up and smell the piss!\r\n          He starts to UNZIP in front of them.\r\n\r\n                         GREER\r\n          Not cool.\r\n          The DREAD turns-- GREER is holding up a BADGE. The Dread\r\n          scowls, zips up and moves away from Greer, plunks down at\r\n          the end of the car. Greer pockets his badge calmly.\r\n\r\n          EXT. GREER'S BUILDING - DAWN\r\n\r\n          GREER approaches an urban APARTMENT COMPLEX on foot,\r\n          carrying a bag of TAKE-OUT FOOD. HIGH FENCES, SECURITY\r\n          CAMERAS and SCANNERS, all commonplace in this world. We\r\n          see the RED GLOW from a few windows.\r\n\r\n          INT. GREER'S BUILDING/HALLWAY - DAWN\r\n\r\n          GREER moves tiredly down a long hallway to his apartment.\r\n          He punches in a CODE at the door.\r\n\r\n          INT. GREER'S APARTMENT/LIVING ROOM - DAWN\r\n\r\n          GREER enters, crosses a living room that's been decorated\r\n          in a spare, modern style.\r\n\r\n          INT. GREER'S APARTMENT/KITCHEN - DAWN\r\n\r\n          GREER sets the bag down on a table, fills a glass with\r\n          WATER and moves down a hallway to a BEDROOM.\r\n\r\n          INT. GREER'S APARTMENT/BEDROOM -- DAWN\r\n\r\n          GREER enters the bedroom, places the water glass on a\r\n          bedside table beside--\r\n          --the REAL GREER. He looks five years older, twenty\r\n          pounds heavier than his surrogate. He's in a STIM\r\n          RECLINER, attached to a SENSORY PROJECTOR like the one we\r\n          saw on Cameron Michaels. RED LIGHT suffuses the room.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          16.\r\n\r\n                         CONTINUED:\r\n          GREER, a surrogate we now realize, undresses, puts his\r\n          clothes aside in a CLOSET-- which also contains a foam-\r\n          filled CHARGING CRADLE. Down to his underwear, he backs\r\n          into this, seems to relax. We hear a low HUM and--\r\n          --the REAL GREER's eyes open. He disconnects the HEADSET\r\n          and FINGERSLEEVE, the RED GLOW is replaced by WHITE\r\n          LIGHT. He sits up, yawns and sips the water. He rises\r\n          wearily, stretches, runs a hand through his thinning\r\n          hair. He moves to shut the closet door on his synth\r\n          unit. As it CLOSES--\r\n\r\n                         CUT TO:\r\n\r\n          INT. GREER'S APARTMENT/KITCHEN - MORNING\r\n\r\n          GREER (the real one) sits at the table in a bathrobe,\r\n          finishing the food his surrogate brought home. As he\r\n          empties the remains into the trash--\r\n          --MAGGIE enters. She's Greer's wife, a stylish young\r\n          woman, looking ridiculously good for someone who's just\r\n          gotten up. Maggie starts at the sight of Greer, begins\r\n          to retreat. It's as if she's stumbled upon him in the\r\n          bathroom.\r\n\r\n                         MAGGIE\r\n          Oh, sorry--\r\n\r\n                         GREER\r\n          It's OK. Come in--\r\n\r\n                         MAGGIE\r\n          But where's your...\r\n\r\n                         GREER\r\n          Put him up. I was about to get\r\n          some sleep.\r\n          Maggie enters the kitchen, not looking directly at Greer.\r\n          She puts some bread in a toaster, prepares coffee.\r\n\r\n                         MAGGIE\r\n          You just get in?\r\n\r\n                         GREER\r\n          Some poor cross-sexual had an\r\n          aneurysm while he was online, had\r\n          to get him to a hospital.\r\n          Maggie winces, disturbed by her husband's job. She flips\r\n          on a small flatscreen TV, volume low. NEWS and WEATHER.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          17.\r\n\r\n                         CONTINUED:\r\n\r\n                         MAGGIE\r\n          I think I need a new stim chair.\r\n\r\n                         GREER\r\n          Bedsores? Want me to take a look?\r\n\r\n                         MAGGIE\r\n\r\n                         (TAKEN ABACK)\r\n          No thanks, it's just some\r\n          irritation.\r\n\r\n                         GREER\r\n          Well, there's room on the credit\r\n          card.\r\n\r\n                         (BEAT)\r\n          It's been a while since... we've\r\n          actually been together.\r\n\r\n                         MAGGIE\r\n\r\n                         (UNEASY)\r\n          Are you talking about sex?\r\n\r\n                         GREER\r\n          No, I just meant--\r\n\r\n                         MAGGIE\r\n          Because I think we're doing just\r\n          fine.\r\n\r\n                         GREER\r\n          But that's our surrogates. It's\r\n          not the same...\r\n\r\n                         MAGGIE\r\n          It's better.\r\n\r\n                         (SHRUGS)\r\n          I wish that instead of working\r\n          every night, you would come out\r\n          with me, go dancing, we used to\r\n          have such a good time--\r\n\r\n                         GREER\r\n          I was thinking more like a\r\n          vacation. An island somewhere.\r\n\r\n                         MAGGIE\r\n          (likes the idea)\r\n          Bridget said she got an amazing\r\n          deal on a surrie rental in Tahiti--\r\n          she looked just like a native.\r\n\r\n                         GREER\r\n          I mean a real vacation-- just us.\r\n          Leave our synth units home.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          18.\r\n\r\n                         CONTINUED: (2)\r\n\r\n                         MAGGIE\r\n\r\n                         (HORRIFIED)\r\n          And get on a plane?\r\n          Her TOAST pops up. Maggie takes it with her coffee out\r\n          of the room. She shakes her head, amused at Greer's\r\n          crazy ideas.\r\n\r\n                          MAGGIE (CONT'D)\r\n          Sleep well.\r\n          She takes her breakfast through a door in the hall just\r\n          off the kitchen-- we can't see inside the room. We hear\r\n          the DOOR LOCK behind her.\r\n          GREER looks after his wife, a bit dejected. In the quiet\r\n          he registers a voice from the TV:\r\n\r\n          COMMERCIAL V.0.\r\n          Remember... it wasn't long ago.\r\n          ON TV - the sign \"AIR QUALITY - UNHEALTHFUL.\"\r\n          PEDESTRIANS with surgical MASKS and even GASMASKS.\r\n          The sign \"QUARANTINE.\" BODIES in a MASS GRAVE.\r\n          The sign \"TERROR ALERT - HIGH.\" A BUSY CITY STREET.\r\n          Suddenly, a massive EXPLOSION, a car bomb going off.\r\n          From the blast, BLEACH TO WHITE.\r\n\r\n          COMMERCIAL V.0. (CONT'D)\r\n          Now... a better world.\r\n          A BEAUTIFUL GIRL ENTERS FRAME, turns TO CAMERA and\r\n          smiles. Behind her, more happy, healthy, handsome YOUNG\r\n          PEOPLE in an abstract, WHITE SPACE. WIDER, there are\r\n          THOUSANDS of them.\r\n\r\n          COMMERCIAL V.0. (CONT'D)\r\n          Virtual Self Industries.\r\n          ON TV - The LOGO for VSI comes on the screen.\r\n\r\n          COMMERCIAL V.0. (CONT'D)\r\n          Do what you want. Be what you want.\r\n\r\n                         CUT TO:\r\n\r\n          INT. COLLEGE DORM - DAY\r\n\r\n          A wood-paneled hallway of an Ivy League dorm, TWO MALE\r\n          UNDERGRADS (pimply, glasses, overweight, clearly not\r\n          surries) KNOCK on a dorm room door.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          19.\r\n\r\n                         CONTINUED:\r\n\r\n                         UNDERGRAD #1\r\n          Yo, Canter!\r\n\r\n                         UNDERGRAD #2\r\n          Maybe he's still hung over.\r\n\r\n                         UNDERGRAD #1\r\n          He's gonna miss the exam.\r\n          They try the door-- unlocked.\r\n\r\n          INT. DORM ROOM - DAY\r\n\r\n          As soon as they enter, the UNDERGRADS choke on the\r\n          stench, covering their noses.\r\n\r\n                         UNDERGRAD #1\r\n          Aw, Jesus...\r\n          IN THE BED is a YOUNG MALE CORPSE, a SENSORY PROJECTOR\r\n          attached to his head, the RED GLOW. OVERHEAD LIGHTS\r\n          flick on to reveal goopy BLOOD at his nose and ears, the\r\n          pillow soaked.\r\n\r\n          GREER (V.0.)\r\n          Tuxedo's operator turned up,\r\n          student at Yale name of Anthony\r\n          Canter...\r\n\r\n                         CUT TO:\r\n\r\n          INT. FBI BUILDING/GREER'S OFFICE - DAY\r\n\r\n          Cluttered with papers, two desks. GREER sits before a\r\n          TERMINAL, staring at his screen.\r\n\r\n                         GREER\r\n          They're uploading his memory file.\r\n          Seems we're dealing with an actual\r\n          homicide.\r\n          PETERS, at the other (much neater) desk, leans in to look\r\n          over Greer's shoulder while the file uploads.\r\n\r\n                         PETERS\r\n          You sound pleased.\r\n\r\n                         GREER\r\n          Well, you get a little tired of\r\n          property crime, vandalism--\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          20.\r\n\r\n                         CONTINUED:\r\n\r\n                         PETERS\r\n          Thought you took your job\r\n          seriously. Surrogates are\r\n          extensions of people's selves--\r\n\r\n                         GREER\r\n          What are you, quoting VSI?\r\n\r\n                         PETERS\r\n          The Supreme Court.\r\n          ANTHONY STONE, Greer's BOSS, has entered Greer's office\r\n          during the above. He's silver-haired, friendly, in\r\n          perfect shape-- another surrogate. He's clearly heard\r\n          this argument before.\r\n\r\n                         PETERS (CONT'D)\r\n          Synthetic units have the same\r\n          rights as biologicals.\r\n\r\n                         GREER\r\n          Yeah, yeah. Fact is, most of the\r\n          people you refer to as Dreads are\r\n          just too poor to afford a synth.\r\n          You think they like living on\r\n          reservations?\r\n\r\n                         PETERS\r\n          That's humanist propaganda. The\r\n          restricted areas were their idea,\r\n          they hate being around surries.\r\n\r\n                         STONE\r\n          Get a room, you two.\r\n          He leans between them, hits a button on Greer's computer.\r\n          ON SCREEN - A NEW HAVEN PD LOGO at the top of the screen,\r\n          indicating this is an EVIDENCE FILE. In a large WINDOW,\r\n          TUXEDO'S POV RECORDING plays. We now see the foreplay in\r\n          the alley from the other perspective. FOOTSTEPS, Tuxedo\r\n          pulls away from the BLONDE--\r\n          --and turns to confront THE HELMETED ASSASSIN. TUXEDO's\r\n\r\n                         VOICE: -\r\n\r\n           TUXEDO (O.S.)\r\n          Get lost, meatbag.\r\n          THE ASSASSIN narrows his eyes-- then WHITE LIGHT fills\r\n          the screen, the BLONDE'S SCREAM CUTS OUT as the audio\r\n          goes. Then STATIC and BLACKNESS.\r\n          GREER, PETERS and STONE react to this.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          21.\r\n\r\n                         CONTINUED: (2)\r\n\r\n                         GREER\r\n          Poor kid. Pathologist said his\r\n          brains looked like soup.\r\n\r\n                         PETERS\r\n\r\n                         (WINCES)\r\n          What could do that to someone?\r\n\r\n                         STONE\r\n          Lightning strike, according to\r\n          forensics. A massive power surge\r\n          shoots through the network...\r\n\r\n                         GREER\r\n          Two people in a narrow alley,\r\n          surrounded by fire escapes, cell\r\n          towers...?\r\n\r\n                         STONE\r\n          Got a better idea? In any case,\r\n          let's be discreet about this.\r\n          There'll be panic in the streets\r\n          if the public gets the idea that\r\n          using their surries can kill\r\n          them...\r\n          Greer is rewinding the IMAGE. He points to the face of\r\n          the ASSASSIN, partly shielded within his helmet. They\r\n          only get a partial of his face, it ENLARGES and\r\n\r\n          HIGHLIGHTS.\r\n\r\n                         GREER\r\n          Is he the perp, or just some\r\n          lookie-loo--?\r\n\r\n                         PETERS\r\n          He's a \"meatbag\" all right. Look\r\n          at those scars...\r\n          An INTERCOM beeps, GREER hits a button.\r\n\r\n                         GREER\r\n          What you got?\r\n\r\n                         INTERCOM VOICE\r\n          Next of kin. You sitting down?\r\n          Kid's father is Lionel Alexander\r\n          Canter. The Lionel Canter.\r\n          GREER, PETERS and STONE take this in, stunned. STONE\r\n          leans closer to the intercom.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          22.\r\n\r\n                         CONTINUED: ( 3)\r\n\r\n                         STONE\r\n          Stone here. Under no\r\n          circumstances do you discuss this\r\n          matter with anyone, inside or\r\n          outside the Bureau. Got me?\r\n\r\n                         INTERCOM VOICE\r\n          Yes, sir.\r\n          GREER disconnects the intercom, STONE moves to leave.\r\n\r\n                         GREER\r\n          You still thinking lightning?\r\n\r\n                         CUT TO:\r\n\r\n          INT. LUXURY BUILDING/LOBBY - DAY\r\n\r\n          Elegant, traditional decor. ARMANDO, the limousine\r\n          driver from the opening sequence, is posted amidst the\r\n          mirrors and plush furniture.\r\n          An elegantly dressed CLERK is at the lobby desk, checking\r\n          on a COMPUTER SCREEN. GREER and PETERS wait.\r\n\r\n                         CLERK\r\n          Dr. Canter is expecting you. But\r\n          no weapons are permitted in the\r\n          penthouse.\r\n\r\n                         PETERS\r\n          We're federal agents.\r\n\r\n                         CLERK\r\n          I'm sorry. You'll have to leave\r\n          them with me.\r\n          At Greer's nod, Peters takes out her holstered GUN.\r\n          GREER does the same. The Clerk locks both the agents'\r\n          guns in a drawer, then comes out from behind the desk.\r\n          ARMANDO approaches. The Clerk passes him a KEY.\r\n\r\n                         ARMANDO\r\n          I work for Dr. Canter. His\r\n          private elevator's this way.\r\n          They follow him toward an ALCOVE in the back of the\r\n          lobby.\r\n\r\n                         PETERS\r\n          You're the one who drove Anthony\r\n          Canter that night?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          23.\r\n\r\n                         CONTINUED:\r\n\r\n                         ARMANDO\r\n\r\n                         (NODS)\r\n          I gave the police a statement.\r\n          AT A PRIVATE ELEVATOR, while ARMANDO turns a key, a\r\n          SCANNER automatically swings out on a cantilevered arm.\r\n\r\n                         GREER\r\n          is this necessary?\r\n\r\n                         ARMANDO\r\n          Dr. Canter's rules.\r\n          LIGHT flashes in their faces as they're scanned. The\r\n          elevator doors open, and the three of them get on.\r\n          CLOSE ON SCANNER - after they've entered the elevator,\r\n          small HEAD-SHOTS of GREER and PETERS, vital stats below,\r\n          appear one after the other on the SCREEN.\r\n\r\n          INT. ELEVATOR - DAY\r\n\r\n          GREER turns to ARMANDO, who's staring straight ahead.\r\n\r\n                         GREER\r\n          Kid liked the wild side, huh. Did\r\n          his father know?\r\n          Armando doesn't answer, this is getting too personal.\r\n\r\n          INT. CANTER'S PENTHOUSE/FOYER - DAY\r\n\r\n          THE ELEVATOR opens into a marble entrance area. It's\r\n          traditional, tastefully opulent-- artwork, sculpture. A\r\n          small, automated VACUUM CLEANER moves along a Persian\r\n          rug. Armando moves ahead of them to announce their\r\n          presence. Greer and Peters speak quietly.\r\n\r\n                         PETERS\r\n          Nice place.\r\n\r\n                         GREER\r\n          Canter must get a piece of every\r\n          surrogate they sell.\r\n          CANTER emerges from a study. His face is young, but\r\n          there's some grey at his temples. Otherwise, he looks\r\n          identical to the dead TUXEDO. GREER takes this in.\r\n\r\n                         GREER (CONT'D)\r\n          Dr. Canter?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          24.\r\n\r\n                         CONTINUED:\r\n\r\n                         CANTER\r\n          That's right. You're with the FBI.\r\n\r\n                         PETERS\r\n          Yes we are.\r\n          He leads them into--\r\n\r\n          INT. CANTER'S PENTHOUSE/STUDY - DAY\r\n\r\n          A traditional study, wood paneling, books. WINDOWS lead\r\n          to a BALCONY. ARMANDO remains IN BG throughout scene.\r\n\r\n                         PETERS\r\n          We're very sorry for your loss,\r\n          sir.\r\n\r\n                         CANTER\r\n          What progress have you made with\r\n          the investigation?\r\n\r\n                         GREER\r\n          I can't help noticing, your\r\n          surrogate-- it's very similar to\r\n          the unit your son was using...\r\n          Canter pauses, then moves to a DOOR and opens it.- LIGHTS\r\n          INSIDE FLICKER ON, revealing--\r\n          --a WALK-IN CLOSET with a half-dozen CHARGING BAYS. Four\r\n          surrogates here, all versions of the man we've just seen--\r\n          Canter at different stages of life, from youth to almost\r\n          elderly. Two of the charging bays are empty.\r\n\r\n                         CANTER\r\n          I allowed Tony to borrow one of my\r\n          surrogates when he wanted to spend\r\n          time in D.C. I encouraged him to\r\n          take advantage of the cultural\r\n\r\n                         OFFERINGS--\r\n\r\n                         PETERS\r\n          Wait, how is that possible?\r\n          Aren't your surries locked to your\r\n          neural signature?\r\n\r\n                         CANTER\r\n          (closing the door)\r\n          I wrote the code that remains at\r\n          the core of all surrogates. It\r\n          wasn't difficult for me to make my\r\n          synth units accessible to my son.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          25.\r\n\r\n                         CONTINUED:\r\n\r\n                         GREER -\r\n          Like getting the keys to dad's car.\r\n\r\n                         CANTER\r\n          I suppose...\r\n\r\n                         (BEAT)\r\n          The coroner says that Tony was\r\n          online when it happened. Why\r\n          hasn't the surrogate been returned\r\n          to me?\r\n\r\n                         PETERS\r\n          We're still analyzing the damage--\r\n\r\n                         CANTER\r\n          It was attacked?\r\n\r\n                         PETERS\r\n          We really can't get into the details\r\n          of an ongoing investigation--\r\n\r\n                         GREER\r\n          Dr. Canter-- we don't know of any\r\n          way to kill an operator remotely.\r\n          Do you?\r\n\r\n                         CANTER\r\n          No, but-- at the beginning, all of\r\n          us at VSI were worried about it.\r\n          It's why every surrogate has a\r\n          built-in fail-safe, they disconnect\r\n          before they can transmit a\r\n          potentially dangerous signal.\r\n\r\n                         PETERS\r\n          Can you think of anyone who might\r\n          want to harm your son?\r\n\r\n                         CANTER\r\n          I... the sad fact is, Tony and I\r\n          were just getting to know each\r\n          other... he grew up with his\r\n          mother in California.\r\n          Canter's voice drifts off, he's starting to look far\r\n          away, pained. He sits slowly behind his desk.\r\n\r\n                         CANTER (CONT'D)\r\n          If this wasn't an accident... then\r\n          it's because of me that he's...\r\n\r\n                         (BEAT)\r\n          I'm sorry. You'll have to excuse me.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          26.\r\n\r\n                         CONTINUED: (2)\r\n          Before Greer and Peters can reply, Canter goes rigid,\r\n          eyes blank-- he's disconnected.\r\n\r\n                         GREER\r\n          Guess the interview's over.\r\n\r\n                         PETERS\r\n\r\n                         (QUIETLY)\r\n          Can you imagine what it's like to\r\n          lose your only child?\r\n          Greer scribbles something on a BUSINESS CARD.\r\n\r\n                         GREER\r\n          Not really. You got kids?\r\n\r\n                         PETERS\r\n          (shakes her head)\r\n          Jim and I talked about it, but...\r\n\r\n                         GREER\r\n          Lot of that going around.\r\n          He starts to place the card on the desk before the\r\n          immobile Canter. Armando steps forward warily-- Greer\r\n          shows him the card before putting it down.\r\n\r\n                         GREER (CONT'D)\r\n          If he thinks of anything else.\r\n\r\n                         ARMANDO\r\n\r\n                         (NODDING)\r\n          I'll show you out.\r\n          As they move back toward the lobby elevator, we remain\r\n          with the motionless Canter a beat. Then, the CAMERA\r\n          MOVES quickly from the study, and THROUGH A WALL to find--\r\n\r\n          INT. CANTER'S PENTHOUSE/CONTROL AREA - DAY\r\n\r\n          --a small, PRIVATE AREA, bathed in RED LIGHT, with a very\r\n          fancy, elaborate SENSORY PROJECTOR. REAL CANTER is much\r\n          older than his surrogate, his face stubbly. His body is\r\n          twisted and nearly useless, his head held up by a brace.\r\n          A victim of some horrible degenerative disease, Canter\r\n          only has the use of one arm, via an elaborate electronic\r\n          armature. He's just disconnected his HEADSET. There are\r\n          TEARS streaming down his cheeks.\r\n          His projector SCREEN faces him, with his working arm he\r\n          calls up an old MEMORY FILE.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          27.\r\n\r\n                         CONTINUED:\r\n\r\n          ON PROJECTOR SCREEN - FOOTAGE SLOWED DOWN SLIGHTLY. A\r\n          (the kid we saw dead\r\n          POV on eighteen-year-old TONY CANTER\r\n          in the dorm room) as he hauls up a sail in the front of a\r\n          BOAT. He looks toward CAMERA and smiles.\r\n\r\n          EXT. LUXURY BUILDING - DAY\r\n\r\n          GREER and PETERS move from the entrance to Canter's\r\n          residential high-rise.\r\n\r\n                         PETERS\r\n          So we're talking mistaken T.D.\r\n\r\n                         GREER\r\n          Someone targeted Canter's surrie,\r\n          got the wrong operator.\r\n          They get to their car, parked in a RED ZONE. GREER curls\r\n          his lip at a METER MAID-- a DRONE SURROGATE ON WHEELS, NO\r\n          EARS, as it rolls calmly away from his car.\r\n\r\n                         GREER (CONT'D)\r\n          I'm sure the guy's got enemies he\r\n          never even heard of.\r\n\r\n                         PETERS\r\n          My money's on the Dreads.\r\n          (off Greer's look)\r\n          Excuse me, the \"humans.\"\r\n          Greer rips the TICKET from the windshield, tears it in\r\n          half and throws it in the back of the car, as they both\r\n          get in.\r\n\r\n                         CUT TO:\r\n\r\n          INT. VSI LOBBY - DAY\r\n\r\n          MOVE OVER a DISPLAY depicting the HISTORY OF SURROGATES.\r\n          MODELS are arranged chronologically, from primitive-\r\n          looking, obvious ROBOTS, moving stiffly, to ANIMATED\r\n          MANNEQUINS (like the landlady) to the MODERN UNITS,\r\n          almost indistinguishable from human beings, whose\r\n          repetitive movements are smooth, fully articulated.\r\n          GREER and PETERS, in plainclothes, move past the display.\r\n          Greer stops in his tracks, seeing-'-\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          28.\r\n\r\n                         CONTINUED:\r\n          A DISPLAY that reads, \"BREAKING THE MIND'S CODE.\" A\r\n          VIDEO LOOP shows a young CANTER (much like his surrogate)\r\n          seated at a worktable with ELECTRONIC GEAR, beside a\r\n          SUBJECT lying on a table, hundreds of WIRES affixed to\r\n          his head. These lead to a crude MANNEQUIN, which turns\r\n          its head, rolls its eyes, moves its mouth. We hear a\r\n          VIDEO NARRATOR, volume low.\r\n\r\n                         VIDEO NARRATOR\r\n          .Dr. Lionel Canter's breakthrough\r\n          experiments led to the technology\r\n          for decoding brain impulses and\r\n          transferring the signals to\r\n          synthetic humans...\r\n\r\n                         GREER\r\n          Damn. Why didn't I think of that?\r\n          The two of them move on to an ELEVATOR BANK.\r\n\r\n          INT. VSI CONFERENCE ROOM - DAY\r\n\r\n          A GORGEOUS ASSISTANT with plenty of cleavage enters with\r\n          two cups of coffee. She takes them to GREER and PETERS,\r\n          who sit at the table in this dramatic conference area.\r\n\r\n                         PETERS\r\n          Thank you.\r\n\r\n                         ASSISTANT\r\n          Mr. Welch will be with you in a minute.\r\n\r\n                         (SHIMMIES OUT)\r\n\r\n                         PETERS\r\n          She's a little over the top.\r\n\r\n                         GREER\r\n          Just advertising the product.\r\n          (sips his coffee)\r\n          Ugh.\r\n\r\n                         PETERS\r\n          It's delicious, if you want it to be.\r\n          Adjust your interface.\r\n\r\n                         GREER\r\n          Right, I keep forgetting that.\r\n\r\n                         (ANOTHER SIP)\r\n          Mmm. So good.\r\n          They rise as--\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          29.\r\n\r\n                         CONTINUED:\r\n          --VICTOR WELCH enters. Like most everyone else, he's\r\n          30ish, handsome, a slick PR man in a suit. Behind him\r\n          are a MALE and FEMALE LAWYER, unsmiling. All wear ID\r\n          BADGES around their necks with the VSI logo.\r\n\r\n                         WELCH\r\n          Agents Greer and Peters? I'm Victor\r\n          Welch, VP corporate relations.\r\n          He shakes their hands.\r\n\r\n                         PETERS\r\n          Thanks for taking the time to see us.\r\n\r\n                         WELCH\r\n          No problem. Do you happen to know\r\n          Andy Stone?\r\n\r\n                         GREER\r\n          Our immediate superior.\r\n\r\n                         WELCH\r\n          Really. Do give him my regards--\r\n          The MALE LAWYER cuts him off, leaning across the table to\r\n          shake hands.\r\n\r\n                         MALE LAWYER\r\n          We're from the legal department.\r\n\r\n                         FEMALE LAWYER\r\n          Hope you don't mind if we sit in.\r\n\r\n                         PETERS\r\n          Not at all. I didn't get your names--?\r\n\r\n                         WELCH\r\n\r\n                         (OVER HER)\r\n          You might be interested in a free\r\n          software upgrade we're offering to\r\n          all law enforcement officials,\r\n          better night vision for your synth\r\n          unit, improved pursuit capability...\r\n\r\n                         GREER\r\n          Mm. Any idea what could cause a\r\n          surrogate's head to explode from\r\n          the inside?\r\n          On the table, in a plastic EVIDENCE BAG, is a fried\r\n          CIRCUIT-BOARD along with a pair of SHATTERED EYEBALLS.\r\n          Greer passes this to Welch, who barely looks at it.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          30.\r\n\r\n                         CONTINUED: (2)\r\n\r\n                         MALE LAWYER\r\n          Mr. Welch isn't qualified to answer\r\n          that question. You'd be better off\r\n          speaking to one of our technicians.\r\n          WELCH smiles pleasantly.\r\n\r\n                         FEMALE LAWYER\r\n          What does the operator say?\r\n\r\n                         GREER\r\n          Not much. He's dead.\r\n\r\n                         PETERS\r\n          A massive brain hemmorhage, it\r\n          happened while he was online.\r\n\r\n                         FEMALE LAWYER\r\n          I'm sorry to hear that. But I can\r\n          assure you it has nothing to do with\r\n          VSI products. If a man suffers a\r\n          heart attack while driving, he\r\n          doesn't have a case against the\r\n          automobile manufacturer.\r\n          WELCH nods in agreement. GREER gamely continues to\r\n          address his questions to the VP.\r\n\r\n                         GREER\r\n          No one's talking lawsuit. we'd\r\n          just like to know, is there any\r\n          precedent for an operator being\r\n          killed by signals from his\r\n          synth unit?\r\n\r\n                         MALE LAWYER\r\n\r\n                         (ALMOST INDIGNANT)\r\n\r\n                         NONE WHATSOEVER--\r\n\r\n                         FEMALE LAWYER\r\n          The idea is absurd. If it were\r\n          possible, it would defeat the\r\n          purpose of surrogacy.\r\n\r\n                         MALE LAWYER\r\n          Surries have jumped from bridges,\r\n          been shot or blown to bits without\r\n          the least harm to the operators-\r\n          the fail-safes always kick in.\r\n          Every case that's been brought\r\n          against VSI has been shown to be\r\n          the result of user negligence.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          31.\r\n\r\n                         CONTINUED: (3)\r\n\r\n                         FEMALE LAWYER\r\n          We can't help it if customers forget\r\n          to eat, sleep or take their medicine.\r\n          WELCH shrugs and rises, followed by the lawyers.\r\n\r\n                         WELCH\r\n          If that's all... a pleasure\r\n          talking with you.\r\n\r\n                         GREER\r\n          There is one more thing. The victim\r\n          was Anthony Canter. The son of one\r\n          of your company's founders.\r\n          GREER studies them as they process this news.\r\n\r\n                         GREER (CONT'D)\r\n          Kind of a strange coincidence.\r\n\r\n                         WELCH\r\n          Dr. Canter has retired, but we'll\r\n          be sure to send our condolences.\r\n\r\n          EXT. VSI HEADQUARTERS - DAY\r\n\r\n          GREER and PETERS move from a glass corporate tower,\r\n          across beautifully manicured gardens. GREER carries the\r\n          evidence in a briefcase.\r\n\r\n                         PETERS\r\n          What's our take-away?\r\n\r\n                         GREER\r\n\r\n                         (SHRUGS)\r\n          I used to be able to read people,\r\n          back when they were people...\r\n\r\n                         PETERS\r\n          You mean before they all became\r\n          lawyers?\r\n\r\n                         GREER\r\n\r\n                         (A SMILE)\r\n          You made a joke. Maybe there's\r\n          hope for you, Peters...\r\n          They head for a MANUFACTURING COMPLEX.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          32.\r\n\r\n          INT. VSI FACTORY - DAY\r\n\r\n          AN OVERHEAD CONVEYOR carries PLASTIC RIBCAGES and SPINAL\r\n          COLUMNS containing ELECTRONIC PARTS, FLUID SACS and\r\n          TUBES. ARMS and LEGS, elaborate hydraulic apparatus, are\r\n          attached by ROBOTIC ASSEMBLERS. There's no skin yet,\r\n          just the exposed machinery, made mostly of plastic and\r\n          microcircuitry.\r\n          A WINDOW overlooks the factory floor. Here, TECHNICIANS\r\n          sit at COMPUTER STATIONS, monitoring the processes below.\r\n          GREER and PETERS stand before WATERS, who looks like a\r\n          basketball player-- hugely tall, African-American,\r\n          tattooed, in casual clothes. GREER waves a hand up in\r\n          his face, trying to get his attention.\r\n\r\n                         GREER\r\n          Mr. Waters? Seth Waters?\r\n          GREER checks the man's ID BADGE-- a PHOTO of a pudgy,\r\n          bearded white man with glasses, the name SETH WATERS.\r\n          Suddenly, WATERS snaps out of it, looks down at the two\r\n          agents. Despite his appearance, his manner is nerdy.\r\n\r\n                         WATERS\r\n          Hello, sorry. I was in the can.\r\n\r\n                         PETERS\r\n          We were told you could help us\r\n          with some technical issues.\r\n\r\n                         WATERS\r\n          To whom am I addressing myself?\r\n\r\n                         GREER\r\n          We're with the FBI.\r\n          He studies the BADGES they hold out.\r\n\r\n                         WATERS\r\n          Really? Cool.\r\n\r\n          INT. VSI LAB - DAY\r\n\r\n          X-CLOSE on the dense, blackened and partially melted\r\n          CIRCUIT BOARD, a labyrinth of LINES and PATTERNS.\r\n          WATERS peers into a huge ELECTRONIC MICROSCOPE in this\r\n          laboratory. COMPUTER MONITORS, mysterious EQUIPMENT.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          33.\r\n\r\n                         CONTINUED:\r\n\r\n                         WATERS\r\n          Heat build-up like this? Every\r\n          circuit musta fired at once.\r\n          Kablooie.\r\n          GREER and PETERS hover nearby. Waters turns his\r\n          attention to the shattered eyes, picks one up.\r\n\r\n                         PETERS\r\n          Ever seen anything like it before?\r\n\r\n                         WATERS\r\n          Not exactly... but last week we\r\n          got a truckload of GI Joes back\r\n          for reconditioning. Couple a the\r\n          surries were missing optics.\r\n\r\n                         GREER\r\n          May we take a look?\r\n\r\n          INT. VSI WAREHOUSE - DAY\r\n\r\n          WATERS opens the doors and flips on FLUORESCENT LIGHTS...\r\n          they blink on to reveal--\r\n          ROW UPON ROW of SURRIE TEMPLATES, naked, hairless and\r\n          robotic, not yet personalized with faces and skin. They\r\n          stand packed like sardines, ready for shipment.\r\n          WATERS leads GREER and PETERS to a CAGED-IN CORNER of the\r\n          warehouse, unlocks the gate.\r\n          Inside are STACKED BODIES in the uniforms of different\r\n          SERVICES. Many are battered and scarred from battle,\r\n          even in pieces. All are wrapped in CLEAR PLASTIC.\r\n\r\n                         WATERS\r\n          Old soldiers never die...\r\n          He consults a HAND-HELD COMPUTER, checks CODE NUMBERS on\r\n          the bags. The SOLDIER'S FACES are all eerily similar...\r\n          even identical. No reason to customize cannon fodder.\r\n\r\n                         WATERS (CONT'D)\r\n          Here we go.\r\n          He peels back the plastic on another identical SOLDIER\r\n          whose EYES are missing. The body is otherwise undamaged.\r\n\r\n                         PETERS\r\n          No bullet holes, no blast damage--?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          34.\r\n\r\n                         CONTINUED:\r\n\r\n                         WATERS\r\n          Not a scratch.\r\n          GREER moves Waters aside, looks the body over.\r\n\r\n                         GREER\r\n          Brand new camos, no mud, no dirt...\r\n          this thing's never seen combat.\r\n          Name and unit insignia removed...\r\n          let me check out the motherboard.\r\n\r\n                         WATERS\r\n          Didn't come back with one. I\r\n          thought it was a little weird.\r\n          GREER stares into the empty eyesockets of the soldier.\r\n          He hooks a finger in, comes out with--\r\n           A glistening SHARD OF GLASS on his fingertip.\r\n\r\n                          CUT TO:\r\n\r\n          EXT. BATTLEFIELD - DAY\r\n\r\n          A FIREFIGHT in a bombed-out DESERT TOWN, somewhere in the\r\n          Middle East. A GRUNT'S POV as a small group of SURROGATE\r\n          SOLDIERS, the generic \"GI JOE\" types we saw at VSI, clean\r\n          up an insurgent outpost.\r\n          PULASKI, a gung-ho SURRIE SOLDIER, charges into MACHINE\r\n          GUN FIRE and is BLOWN TO PIECES.\r\n\r\n          INT. BATTLEFIELD HEADQUARTERS - DAY\r\n\r\n          A WIDER SHOT reveals that this POV is one of many being\r\n          displayed on BATTLEFIELD MONITORS in a warehouse-sized\r\n          space. Each hangs above a flesh and blood SOLDIER in\r\n          loose MARINE UNIFORM, in stim chairs, hooked into sensory\r\n          projectors. The room is bathed in RED LIGHT.\r\n          REAL PULASKI bolts upright in his stim chair, a WHITE\r\n          LIGHT goes on as his screen turns to STATIC.\r\n\r\n                         PULASKI\r\n          I'm down, I'm down!\r\n          A CONTROLLER works quickly at a board.\r\n          COLONEL BRANDON,_a flesh and blood career military man,\r\n          in uniform, moves past Pulaski's stim chair, gives him a\r\n          warning look.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          35.\r\n\r\n                         CONTINUED:\r\n\r\n                         BRANDON\r\n          Damn things aren't free, Pulaski.\r\n          Take the snipers from behind this\r\n          time.\r\n\r\n                         PULASKI\r\n          Yessir.\r\n\r\n                         CONTROLLER\r\n          Back on-line.\r\n          PULASKI lies back in his stim chair, RED LIGHT UP. The\r\n          POV ON his SCREEN switches to the BACK OF A VAN, the\r\n          doors open and his new unit charges out, past other\r\n          REPLACEMENT SOLDIERS still in charging bays.\r\n          COLONEL BRANDON, moving on, touches his earphone.\r\n\r\n                         BRANDON\r\n          Yeah, I'll be right over.\r\n          He CLAPS a CAPTAIN on the shoulder as he moves out.\r\n\r\n                         BRANDON (CONT'D)\r\n          Keep an eye on Bravo company.\r\n\r\n                         CAPTAIN\r\n          We will kick some ass, sir.\r\n\r\n          EXT. MARINE BASE - DAY\r\n\r\n          HANGARS, boxy buildings, HUMVEES, SOLDIERS marching in\r\n          formation. BRANDON walks with GREER and PETERS.\r\n\r\n                         BRANDON\r\n          The United States has the largest\r\n          surrogate army in.the world. Why\r\n          on earth would the defense\r\n          department want to develop a\r\n          weapon that could wipe out our own\r\n          troops?\r\n\r\n                         GREER\r\n          So no such thing exists?\r\n\r\n                         BRANDON\r\n          If it did, I'd know about it.\r\n\r\n                         PETERS\r\n          Those soldiers we saw--\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          36.\r\n\r\n                         CONTINUED:\r\n\r\n                         BRANDON\r\n          (a bit impatient)\r\n          We routinely remove motherboards\r\n          and optics for analysis. Now if\r\n          you'll excuse me, we're in the\r\n          middle of a peacekeeping operation.\r\n          They've reached their car. Brandon turns on his heel and\r\n          heads back for a hangar. Greer and Peters look after him\r\n          for a moment.\r\n\r\n                         PETERS\r\n          Think he's telling the truth?\r\n\r\n                         GREER\r\n          Not when his lips are moving.\r\n          Greer shakes his head as they both get in the car.\r\n          WITH BRANDON - Out of earshot of the feds, he speaks into\r\n          a small earpiece.\r\n\r\n                         BRANDON\r\n          Bill, we may have a problem. Is it\r\n          possible one of our ODs is loose?\r\n\r\n                         CUT TO:\r\n\r\n          INT. FBI BUILDING/GREER'S OFFICE - DAY\r\n\r\n          CANTER'S IMAGE on a COMPUTER SCREEN. It's his surrogate\r\n          face, seated at his desk. This is a video-phone\r\n          connection.\r\n\r\n                         CANTER\r\n          Tell me, have you made any\r\n          progress whatsoever?\r\n          REVERSE ANGLE, Greer and Peters sit before the screen.\r\n\r\n                         BY ROTE:\r\n\r\n                         GREER\r\n          Sir, we are not at liberty to\r\n          comment on an ongoing\r\n          investigation.\r\n\r\n                         CANTER\r\n          Don't blow me off like I'm some\r\n          goddamn reporter. I have\r\n          resources of my own, do I have to\r\n          do your jobs for you?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          37.\r\n\r\n                         CONTINUED:\r\n          GREER bites back his anger, rises and moves away from the\r\n          screen before he says something he'll regret. He sits at\r\n          ANOTHER TERMINAL, returns to work. Peters takes his\r\n          place, attempting to sound reassuring.\r\n\r\n                         PETERS\r\n          We're exploring every avenue, Dr.\r\n          Canter, I promise you that, we're\r\n          doing everything we can.\r\n          CLOSE ON GREER'S TERMINAL - An INSET of the image of the\r\n          ASSASSIN'S FACE, no helmet on-- it's much clearer than\r\n          the one we saw before, this being the bouncer's\r\n          perspective at the door of the club. We hear CANTER and\r\n          PETERS continue in BG.\r\n\r\n                         CANTER\r\n          What. What are you doing?\r\n\r\n                         PETERS\r\n          I understand you're grieving--\r\n\r\n                         CANTER\r\n          I'm a target for assassination! I\r\n          assume you're at least aware of\r\n          that.\r\n          WITH PETERS, she looks briefly over her shoulder at Greer\r\n          with a \"help, get me out of this\" expression. He remains\r\n          focussed on the image of the assassin, she turns back to\r\n          Canter on the screen, maintaining her placating tone.\r\n\r\n                         PETERS\r\n          I appreciate your concern and\r\n          frustration, obviously we all want\r\n          immediate results, but--\r\n\r\n                         CANTER\r\n          I've heard enough of your\r\n          condescending pap. The people who\r\n          did this are going to be punished.\r\n          CANTER DISCONNECTS, his angry face VANISHES. PETERS\r\n          rises and moves quickly toward Greer.\r\n\r\n                         GREER\r\n          You handled that well.\r\n\r\n                         PETERS\r\n          (points at screen)\r\n          Where'd you get this?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          38.\r\n\r\n                         CONTINUED: (2)\r\n\r\n                         GREER\r\n          The freak who was working the door\r\n          at the club. Got a look at our\r\n          perp dead-on.\r\n           ON SCREEN - The Assassin's features HIGHLIGHT, the words\r\n\r\n          \"756 PARTIAL MATCHES.\"\r\n          REVERSE ANGLE -- GREER types, PETERS watches.\r\n\r\n                         PETERS\r\n          Try narrowing the search for Dread\r\n          affiliation...\r\n          ON SCREEN - a DIGITAL RAPSHEET, the name JACK STRICKLAND.\r\n          A ROTATING 3-D MUGSHOT of STRICKLAND, covering all the\r\n          angles of his face.\r\n\r\n                         GREER\r\n          Eighty-seven percent match. Close\r\n          enough for government work.\r\n          GREER and PETERS quickly scan the man's rapsheet.\r\n\r\n                         PETERS\r\n          Jack Strickland, one of the Prophet's\r\n          groupies... torched a surrogate\r\n          display at a department store--\r\n\r\n                         GREER\r\n          And they let him off?\r\n\r\n                         PETERS\r\n          No known address...\r\n\r\n                         GREER\r\n\r\n                         (RISING)\r\n          Not a problem.\r\n\r\n          INT. FBI BUILDING/CORRIDOR - DAY\r\n\r\n          GREER and PETERS walk along a windowless, underground\r\n          hallway, reach a SECURITY SCANNER.\r\n\r\n                         GREER\r\n          Ever come down here? It's like\r\n          being inside God's head...\r\n          The DOOR UNLOCKS and they enter--\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          39.\r\n\r\n          INT. FBI BUILDING/SURVEILLANCE CENTER - DAY -\r\n\r\n          GREER and PETERS go down metal stairs into-a sprawling,\r\n          high-tech surveillance center. COMPUTER WORKSTATIONS are\r\n          arranged radially, at the hub is a central COMMAND\r\n          STATION with large SCREENS facing in all directions.\r\n          GREER and PETERS move toward the center. At first we see\r\n          just the head and shoulders of scattered FIGURES, staring\r\n          at the monitor screens.\r\n          ON SCREENS - these are POV SHOTS from thousands of\r\n          SURROGATES, the Feds can have a direct surveillance feed\r\n          from any surrogate's eyes.\r\n          We glimpse POV SHOTS of-- driving-- drinking in a bar--\r\n          intimate conversations-- watching an old movie-- a sex\r\n          partner's face.\r\n          The FIGURES before the screens are WATCHER DRONES,\r\n          specialized surrogates-- a head and shoulders mounted on\r\n          a wheeled contraption attached to tracks. This enables\r\n          them to move and stop at any monitor quickly, surveilling\r\n          dozens of surrogates. Males and females, but all have\r\n          the same faces.\r\n          PETERS stares in wonder at this voyeur's paradise. GREER\r\n          grabs her arm to keep her from getting hit as a WATCHER\r\n          tracks past. The Watcher ignores them, intent on work.\r\n          They mount stairs into the RAISED HUB that overlooks the\r\n          work floor. An extremely corpulent human being-- BOBBY\r\n          SANDERS-- sits on a reinforced rolling chair, which he\r\n          keeps in almost constant motion, eying the DOZEN SCREENS\r\n          up here at once.\r\n          ON SCREENS - POVs of actual criminal activity-- frantic\r\n          running across a park-- a burglary in a darkened jewelry\r\n          store-- packets of drugs changing hands.\r\n          BOBBY eats candy, guzzles soda, waves them off for a\r\n          moment, speaking rapid-fire into his HEADSET.\r\n\r\n                         BOBBY\r\n          Burglary in progress, Charlie4639-\r\n          Romeo7812-Sierra8955, need a\r\n          warrant to shut him down...\r\n          BOBBY gets a message from his headset, kicks his rolling\r\n          chair across the room to a special TERMINAL.\r\n\r\n                         BOBBY (CONT'D)\r\n          Warrant received.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          40.\r\n\r\n                         CONTINUED:\r\n          This terminal displays SURRIE SERIAL NUMBERS. As BOBBY\r\n          types, the selections narrow until only one is on the\r\n          screen: \"C4639-R7812-S8955.\"\r\n\r\n                         PETERS\r\n\r\n                         (WHISPERS)\r\n          He can cut off operators from here?\r\n\r\n                         BOBBY\r\n          Anybody, anywhere. Ssh, don't\r\n          tell anyone. It's a gray area\r\n          legally.\r\n          PETERS isn't comfortable with this.\r\n\r\n                         BOBBY (CONT'D)\r\n          Relax, we're the good guys.\r\n\r\n          ON TERMINAL SCREEN - \"OPERATOR DISCONNECT.\"\r\n          ON THE BURGLARY SCREEN, the POV IMAGE tumbles to the\r\n          ground, FREEZES there and turns to STATIC.\r\n          GREER nods, impressed. BOBBY eats an entire candy bar in\r\n          one bite.\r\n\r\n                         PETERS\r\n          You're not a surrogate, are you?\r\n          BOBBY wheels closer. With his mouth full:\r\n\r\n                         BOBBY\r\n          No ma'am, you're looking at the\r\n          genuine article. Bobby Sanders.\r\n          He extends a greasy hand, which she shakes lightly.\r\n\r\n                         PETERS\r\n          Jennifer Peters.\r\n\r\n                         GREER\r\n          They've been trying to puppet\r\n          Bobby for years--\r\n\r\n                         BOBBY\r\n          (points at his head)\r\n          Ain't built the machine yet that\r\n          can handle this baby. Recognition\r\n          search caught your dreaddie,\r\n          screen 11.\r\n          They move to a screen numbered 11, Bobby taps a CONTROL.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          41.\r\n\r\n                         CONTINUED: (2)\r\n          ON SCREEN - SLO-MO, a city street, JACK STRICKLAND, a\r\n          moving pedestrian's POV. Strickland's leaning on his\r\n          bike, helmet off, talking on a CELLPHONE, free hand\r\n          shoved in his pocket. The image FREEZES. The bike's\r\n          LICENSE PLATE HIGHLIGHTS, along with STRICKLAND'S FACE.\r\n          GREER peers at the time stamp.\r\n\r\n                         GREER\r\n          Ten minutes ago? Where?\r\n\r\n                         BOBBY\r\n          Baltimore, corner of Eastern and\r\n          Decker. Got a feeling he's headed\r\n          for the reservation.\r\n\r\n                         GREER\r\n\r\n                         (TO PETERS)\r\n          Stay here, keep tabs on him.\r\n\r\n                         PETERS\r\n          What are you doing?\r\n\r\n                         GREER\r\n          (on the move)\r\n          Getting a chopper.\r\n          Peters takes this in, calls after him:\r\n\r\n                         PETERS\r\n          You need to get approval!\r\n          GREER makes a jerking off motion and is gone. BOBBY lets\r\n          out a BELCH and winks at PETERS.\r\n\r\n                         CUT TO:\r\n\r\n          EXT. BALTIMORE SLUMS - DAY\r\n\r\n          WITH STRICKLAND, finishing his cell call.\r\n\r\n                         STRICKLAND\r\n          .maybe I'm not done with the\r\n          O.D. Maybe you're not gonna get\r\n          it back at all. Guy could have a\r\n          lot of fun with your little toy...\r\n          oh you can do better than that.\r\n          I'll be in touch...\r\n          He tosses the cellphone in a trashcan, pulls on his\r\n          helmet, STARTS the bike and peels out.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          42.\r\n\r\n          EXT. BALTIMORE - DAY\r\n\r\n          AERIAL SHOT - CAMERA tracking over the CHESAPEAKE BAY and\r\n          into the city, late afternoon. A small black CHOPPER\r\n          with doorless openings on either side ENTERS FRAME.\r\n\r\n          INT. HELICOPTER - DAY\r\n\r\n          GREER is beside a PILOT, a handsome Hispanic surrie named\r\n          LOPEZ. Greer shouts over the BLADE ROAR:\r\n\r\n                         GREER\r\n          We're close! Noise suppression!\r\n          LOPEZ nods, hits a couple of switches. THE LOUD THROB\r\n          becomes a barely audible WHIRR. We hear PETERS' VOICE\r\n          over the radio:\r\n\r\n                         PETERS (FILTER)\r\n          Got a hit on the bike, half a mile\r\n          from the rez, check your screen.\r\n          ON THE CHOPPER DASH, A GPS DISPLAY of the nearby\r\n          neighborhood, a BLINKING DOT a short distance away.\r\n\r\n          PETERS (FILTER) (CONT'D)\r\n          Baltimore PD's sending back-up.\r\n          You can't fly over Dread\r\n          territory, you know. We don't\r\n\r\n                         HAVE JURISDICTION--\r\n          Greer clicks off the radio, turns to Lopez.\r\n\r\n                         GREER\r\n          Ignore her, Lopez. Get us as\r\n          close as you can.\r\n          LOPEZ grins--and pushes the stick hard--\r\n\r\n          EXT. BALTIMORE - DAY\r\n\r\n          THE CHOPPER banks and swoops almost silently.\r\n\r\n          TNT. FBI BUILDING/SURVEILLANCE CENTER - DAY\r\n          BOBBY glances over at PETERS as she monitors a GPS SCREEN\r\n          and various INSET VIDEO FEEDS. He continues to work as\r\n          he flirts with her.\r\n\r\n                         BOBBY\r\n          You really look like your surrie?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          43.\r\n\r\n                         CONTINUED:\r\n          PETERS throws him a glare, turns back to her work.\r\n\r\n                         BOBBY (CONT'D)\r\n          Don't be so touchy. I'm engaged\r\n          to B-47 down there.\r\n          He points to one of the many identical female DRONES\r\n          buzzing along the tracks. PETERS smiles.\r\n\r\n          EXT. BALTIMORE SLUMS - DUSK\r\n\r\n          STRICKLAND moves briskly on his BIKE. He glances in his\r\n          MIRROR and sees--\r\n          --a couple of SQUAD CARS catching up with him.\r\n          He hits the THROTTLE. ANOTHER COP CAR roars around the\r\n          corner ahead of him, SQUAWKS the SIREN. STRICKLAND\r\n          changes direction, veers into a narrow alley.\r\n\r\n          INT. HELICOPTER - DUSK\r\n\r\n          LOPEZ and GREER are directly overhead, watching\r\n          STRICKLAND maneuver his bike quickly into the alley.\r\n\r\n          EXT. SLUM ALLEY - DUSK\r\n\r\n          The alley is a DEAD END, a FENCE blocking the exit.\r\n          STRICKLAND skids the bike into a CRASHING STOP, knocking\r\n          over piles of GARBAGE.\r\n          A SQUAD CAR barely clears the walls on either side,\r\n          pursuing. It stops at a narrowing space, cops squeeze\r\n          out either door, aiming GUNS.\r\n\r\n                         COP\r\n          Freeze!\r\n          STRICKLAND stumbles away from his bike, into an alcove.\r\n          The cops approach, guns ready.\r\n          STRICKLAND yanks off his helmet, pulls his ominous DEVICE\r\n          from his pocket. Without poking his head out, he aims it\r\n          in the cops direction.\r\n          He PRESSES A BUTTON. A row of RED DIODES GLOW on the\r\n          device as he sweeps it across the alley, but it emits no\r\n          projectiles and makes no sound.\r\n          COP #1 is closer-- his GLASS EYES SHATTER.\r\n\r\n                          (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          44.\r\n\r\n                         CONTINUED:\r\n          COP #2 drops his weapon, staggers backward and falls,\r\n          clutching his head.\r\n\r\n          INT. HELICOPTER - DUSK\r\n\r\n          GREER has seen this, horrified.\r\n\r\n                         GREER\r\n          Jesus, what is that?\r\n          STRICKLAND is on the run again, scaling the fence. He\r\n          hasn't spotted the chopper.\r\n          GREER looks in the direction he's heading--\r\n          A HUGE CHAIN-LINK FENCE, topped with barbed wire,\r\n          stretching across the whole city, just a hundred yards\r\n          away. PORTRAITS of the PROPHET (the man we heard on the\r\n          radio), long-haired and bearded, adorn the fence.\r\n          There's a GATE, with two GUARDS checking those entering,\r\n          one or two people are waiting.\r\n\r\n                         GREER (CONT'D)\r\n          He gets through the gate, we can't\r\n          touch him.\r\n          GREER readies a RIFLE with a SCOPE, loads a TRANQUILIZER\r\n          DART into the chamber. LOPEZ maneuvers to give Greer an\r\n          angle out the chopper's side.\r\n\r\n          EXT. SLUM ALLEY - DUSK\r\n\r\n          STRICKLAND looks up to see GREER taking aim from the\r\n          silent chopper. He leaps for cover behind a dumpster as--\r\n          GREER FIRES a DART, which RICOCHETS off the DUMPSTER.\r\n          STRICKLAND scrambles around a corner.\r\n\r\n          INT. HELICOPTER - DUSK\r\n\r\n          LOPEZ turns the bird forward to pursue, as GREER reloads.\r\n          They round the corner. No sign of Strickland on the\r\n          pavement. GREER looks to his left, beyond the PILOT--\r\n          STRICKLAND has scaled a fire escape, aiming the DEVICE\r\n          right at Lopez. Greer sees what's about to happen--\r\n\r\n                         GREER\r\n          Pull up, Lopez, pull up!\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          45.\r\n\r\n                         CONTINUED:\r\n          LOPEZ shoots the bird upwards, but--\r\n\r\n          EXT. FIRE ESCAPE - DUSK\r\n\r\n          STRICKLAND raises the device to track Lopez and hits the\r\n          button-- we see the RED DIODES GLOW and--\r\n\r\n          INT. HELICOPTER - DUSK\r\n\r\n          --LOPEZ is hit, his EYES FRAGMENT, shards of GLASS fly.\r\n          GREER is close enough to get a partial hit, crouches in\r\n          agony. SFX, an awful SCREAMING NOISE inside his head--\r\n\r\n          INT. GREER'S APARTMENT/BEDROOM - DUSK\r\n\r\n          SCREAMING NOISE CONTINUES as REAL GREER spasms in pain in\r\n          his stim-chair, in the sensory projector's RED LIGHT.\r\n\r\n          EXT. RESERVATION NO MAN'S LAND - DUSK\r\n\r\n          THE CHOPPER, pilotless and out of control, heads over the\r\n          chain link fence. Beyond are vacant lots, with tents and\r\n          makeshift hovels, small buildings.\r\n\r\n          INT. HELICOPTER - DUSK\r\n\r\n          GREER regains his senses, just in time to see--\r\n          THE CHOPPER careening down toward the Dread encampment.\r\n\r\n          EXT. RESERVATION NO MAN'S LAND - NIGHT\r\n\r\n          THE CHOPPER CRASHES on its skids, at an angle, amidst\r\n          LEAN-TOs and TENTS-- GREER is thrown out his side with\r\n          the impact.\r\n\r\n          THE CHOPPER'S ENGINE EXPLODES. THE WHIRRING TAIL ROTOR\r\n          comes right at him and CHOPS OFF his left arm at the\r\n          elbow, BURNING FUEL spreads and IGNITES his back. Lucky\r\n          thing he's a surrogate. Less fortunate DREADS run\r\n          screaming, we hear the CRIES OF WOUNDED.\r\n          GREER lies in the dirt, in flames, motionless. Then his\r\n          eyes BLINK and move, taking in the sight of--\r\n          STRICKLAND, illuminated by the FIRE, horrified at the\r\n          carnage. He's starting to move away from the wreck.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          46.\r\n\r\n                         CONTINUED:\r\n          With supreme effort, GREER gets to his feet, still partly\r\n          IN FLAMES. His stump of an arm SPARKS and leaks\r\n          HYDRAULIC FLUID. He reacts at the sight of--\r\n          A CORPSE on the ground, an older man crushed by a hunk of\r\n          DEBRIS from the chopper. But it's not the corpse that\r\n          interests him-- his DART RIFLE lies nearby, thrown from\r\n          the chopper during the crash.\r\n          GREER grabs it in his right hand. He pushes past DREADS\r\n          who move to help their injured fellows, PANIC in the fire-\r\n          lit no man's land. He spots--\r\n          STRICKLAND, running into the distance. Greer supports\r\n          the rifle with the stump of his missing arm and FIRES--\r\n          STRICKLAND is hit in the back, the force of the shot\r\n          knocks him off his feet.\r\n          GREER strides over to STRICKLAND, seemingly oblivious to\r\n          the CROWD of Dreads collecting around him, pointing at\r\n          him angrily.\r\n          STRICKLAND twitches and moans, partly paralyzed. GREER\r\n          stands over him, lets the rifle dangle. Strickland has\r\n          some trouble speaking.\r\n\r\n                         STRICKLAND\r\n          Oh my G-god-- why? What do you\r\n          people want from me?!\r\n\r\n                         GREER\r\n          You're a killer--\r\n\r\n                         STRICKLAND\r\n          They were just surries! Goddamn\r\n          machines!\r\n\r\n                         GREER\r\n\r\n                         (A BEAT)\r\n          You really don't know?\r\n          BLAM! A DOUBLE-BARRELED SHOTGUN BLAST throws GREER\r\n          backward, away from STRICKLAND. The DART RIFLE flies\r\n          from his grasp.\r\n          A heavyset FEMALE DREAD wields the sawed-off shotgun.\r\n          She gets between Greer and Strickland, who manages to\r\n          crawl away, vanishing behind other DREADS who are\r\n          gathering around Greer.\r\n\r\n                         GREER (CONT'D)\r\n          Strickland! Wait!\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          47.\r\n\r\n                         CONTINUED: (2)\r\n          Greer tries to get up, a HOLE has been blown in his\r\n          chest, exposing SPARKING WIRES and ELECTRONICS, spraying\r\n          GREEN COOLANT. He's lost control of his legs, which\r\n          crumple beneath him, he falls to his knees.\r\n          He's surrounded now by angry, disenfranchised DREADS, all\r\n          of whom regard him with hatred.\r\n          THE FEMALE DREAD ejects the used cartridges and reloads\r\n          the shotgun. GREER stares at her coldly.\r\n\r\n                         GREER (CONT'D)\r\n          I'm a federal agent--\r\n\r\n                         FEMALE DREAD\r\n          You're an abomination.\r\n          THE WOMAN pumps the shotgun again points it a Greer's\r\n          head. Just as it GOES OFF--\r\n\r\n                         CUT TO:\r\n\r\n          INT. GREER'S APARTMENT/BEDROOM - NIGHT\r\n\r\n          GREER lurches out of his chair, yanking the SENSORY\r\n          PROJECTOR off his head-- the RED LIGHT switches to WHITE.\r\n          He stumbles out of the room into the hall.\r\n\r\n          INT. GREER'S APARTMENT/HALLWAY - NIGHT\r\n\r\n          GREER bangs on the door to Maggie's bedroom, rattles the\r\n          knob. A RED GLOW from beneath her door.\r\n\r\n                         GREER\r\n          Maggie! Wake up!\r\n          He's clearly in pain, clutches his temples. BLOOD begins\r\n          to gush from his nose. Greer slides down against the\r\n          door, unable to stand.\r\n\r\n          INT. GREER'S APARTMENT/MAGGIE'S ROOM - NIGHT\r\n\r\n          THE DOOR rattles, we hear GREER calling:\r\n\r\n                         GREER\r\n          Please, I need your help... open\r\n          the door!\r\n          CAMERA MOVES through the RED-LIT room, to show the WIRES\r\n          of a SENSORY PROJECTOR, a partial view of MAGGIE'S HEAD.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          48.\r\n\r\n          INT. GREER'S APARTMENT/LIVING ROOM - NIGHT\r\n\r\n          MAGGIE (her surrogate), in a tailored business suit,\r\n          enters the apartment with BRIDGET, another gorgeous, high-\r\n          fashion surrie in party clothes. They're laughing.\r\n\r\n                         BRIDGET\r\n          --we're talking turquoise! I\r\n          wouldn't carry a purse that color,\r\n          much less a whole new skin.\r\n\r\n                         MAGGIE\r\n          BRB, I just gotta change. Little\r\n          black dress or red bustier?\r\n\r\n                         BRIDGET\r\n          Bustier.\r\n\r\n          INT. GREER'S APARTMENT/HALLWAY - NIGHT\r\n\r\n          MAGGIE almost trips over GREER, unconscious on the floor.\r\n\r\n                         MAGGIE\r\n          Oh my God.\r\n\r\n                         CUT TO:\r\n\r\n          EXT. MOUNTAIN ROAD - NIGHT\r\n\r\n          START ON a MAILBOX with the name \"PETERS,\" as CARLIGHTS\r\n          catch it. As the CAR turns up the dirt road in this\r\n          rural area in the Rockies, it flips its LIGHTS OFF.\r\n\r\n          INT. PETERS' HOUSE - NIGHT\r\n\r\n          A pleasant, rustic home. JENNIFER PETERS, somewhat less\r\n          perfect than her surrie, disconnects from her SENSORY\r\n          PROJECTOR. She looks concerned, very tired. She rises\r\n          from her stim chair and moves into a kitchen.\r\n          PULL BACK - we're watching her through a WINDOW, with a\r\n          very large and powerful-looking STALKER,\r\n          LATER - PETERS in bed, fast asleep. A SHADOW crosses her\r\n          doorway, but moves on.\r\n          AT HER sensory PROJECTOR, the STALKER is SCANNING through\r\n          her hard-drive's memory.\r\n          ON SCREEN - fast-forwarding rapidly through PETERS' POV,\r\n          we see GREER in the alley with the fallen SURRIES...\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          49.\r\n\r\n                         CONTINUED:\r\n          THE STALKER, face illuminated by the screen's GLOW, looks\r\n          expressionlessly toward Peters' bedroom, then back to the\r\n          images. His eyes have a silvery, inhuman sheen.\r\n\r\n                         DISSOLVE TO:\r\n\r\n          INT. STRICKLAND'S APARTMENT - DAY\r\n\r\n          Early morning. STRICKLAND sleeps fitfully in this\r\n          gloomy, dingy space. He comes to, startles at the sight\r\n\r\n                         OF--\r\n          --a MAN sitting at the foot of his bed. He's very tall,\r\n          imposing, bearded, dressed in black-- this is the\r\n          PROPHET. Strickland is cowed, this isn't a man you get a\r\n          lot of face time with.\r\n\r\n                         PROPHET\r\n          You've been keeping secrets, Jack.\r\n          TWO LARGE MEN now move into view, flanking the Prophet.\r\n          Call them BUD and MILLER. They're scruffy, bearded, not\r\n          surries.\r\n\r\n                         STRICKLAND\r\n          No, Prophet, I---\r\n\r\n                         PROPHET\r\n          This is unfair to your brother\r\n          humans.\r\n          STRICKLAND tries to get out of bed, Bud pushes him down.\r\n\r\n                         STRICKLAND\r\n          Please, I haven't done anything...\r\n\r\n                         PROPHET\r\n          I know what you've done. What I\r\n          don't know is-- who hired you to\r\n          betray us? I want a name.\r\n\r\n                         STRICKLAND\r\n          I-- I swear to God I don't know--\r\n\r\n                         PROPHET\r\n          Jack...\r\n\r\n                         STRICKLAND\r\n          He never said his name, we talked\r\n          on disposable cellphones-- I've\r\n          never even seen his face! I\r\n          couldn't tell you who he was if my\r\n          life depended it!\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          50.\r\n\r\n                         CONTINUED:\r\n          On the Prophet's disappointed, even sad expression...\r\n\r\n                         DISSOLVE TO:\r\n\r\n          INT. HOSPITAL ROOM - DAY\r\n\r\n          CLOSE ON A MEDICAL MONITOR - high-tech imaging of a HUMAN\r\n\r\n          BRAIN.\r\n          MOVE DOWN to find GREER (the real one), asleep. An IV,\r\n          BLEEPING monitors. Uneaten LUNCH on a tray.\r\n          MAGGIE, her surrogate that is, sits in a chair beside the\r\n          bed, her hand resting on GREER's. He stirs-- she pulls\r\n          her hand back, returns to her fashion magazine.\r\n          A TV plays above his bed, Greer blinks, squints at this.\r\n          ON TV - a small BOY CLIMBS a very tall TREE above a\r\n          suburban sidewalk, pleasant MUSIC. Suddenly, a BRANCH\r\n          BREAKS, the boy tumbles with a CRY.\r\n          GREER winces distastefully.\r\n          ON TV - now we see the BOY again, perfectly fine,\r\n          standing beside his mother. She strokes his head with a\r\n          smile. They look down at his broken SURROGATE on the\r\n          ground beside the fallen BRANCH.\r\n\r\n          COMMERCIAL V.0.\r\n          Imagine a world where children are\r\n          safe. Always...\r\n          GREER, watching the screen, addresses Maggie.\r\n\r\n                         GREER\r\n          Would you do that?\r\n\r\n                         MAGGIE\r\n          (not looking up)\r\n          Hm? Do what?\r\n\r\n                         GREER\r\n          Get a surrogate for our kid. Our\r\n          hypothetical kid.\r\n\r\n                         MAGGIE\r\n          Sure. Why not? They're getting\r\n          cheaper all the time.\r\n\r\n          COMMERCIAL V.0.\r\n          A world where every child is\r\n          secure and fulfilled...\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          51.\r\n\r\n                         CONTINUED:\r\n          ON TV - A LITTLE GIRL swings back and forth, a blissed-\r\n          out smile on her face.\r\n\r\n          COMMERCIAL V.0. (CONT'D)\r\n          .free of pain, fear and\r\n          anxiety...\r\n          IN SLO-MO she releases at the top of the swing's arc and\r\n          flies into the air...\r\n\r\n          COMMERCIAL V.O. (CONT'D)\r\n          That world can be real. Thanks to\r\n          VSI. Our software for growing\r\n          minds screens out destructive,\r\n          negative feelings...\r\n          THE LITTLE GIRL lands hard, but gets up laughing.\r\n\r\n          COMMERCIAL V.0. (CONT'D)\r\n          Making every childhood a happy\r\n          one...\r\n          GREER shakes his head.\r\n\r\n                         GREER\r\n          It just seems weird to me.\r\n\r\n                         MAGGIE\r\n\r\n                         (CHUCKLES)\r\n          Our grandparents thought seatbelts\r\n          were weird.\r\n          She nods toward the IMAGE of a SMILING CHILD on TV.\r\n\r\n                         MAGGIE (CONT'D)\r\n          Not like it's an issue.\r\n          ON TV - the VSI LOGO.\r\n\r\n          COMMERCIAL V.0.\r\n          Do what you want. Be what you want.\r\n          AT THE DOOR, PETERS hovers, making up her mind to enter.\r\n          She steps into the room.\r\n\r\n                         PETERS\r\n          Knock knock.\r\n          Greer blinks at her.\r\n\r\n                         GREER\r\n          Who's there.-\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          52.\r\n\r\n                         CONTINUED: ( 2)\r\n\r\n                         PETERS\r\n          It's me, Peters, don't you recognize me?\r\n\r\n                         GREER\r\n          (almost to himself)\r\n          I thought you might've been\r\n          telling another joke.\r\n          Peters seems relieved. Maggie waits for an introduction,\r\n          but Greer seems withdrawn, shy-- Peters has never seen\r\n          his physical body.\r\n\r\n                         MAGGIE\r\n          Hi. I'm Maggie, Tom's wife.\r\n\r\n                         PETERS\r\n          A pleasure to meet you. Jennifer\r\n          Peters.\r\n          (a glance at Greer)\r\n          His new partner.\r\n\r\n                         MAGGIE\r\n          (to Greer, brightly)\r\n          You should have mentioned her. I\r\n          need to get going anyway, I'll let\r\n          you two talk business.\r\n\r\n                         (TO PETERS)\r\n          I'm a beauty engineer. Drop by\r\n          the shop sometime, I'll give you a\r\n          free consultation.\r\n\r\n                         PETERS\r\n          Thanks...\r\n          (as Maggie leaves)\r\n          I think.\r\n\r\n                         (STUDYING GREER)\r\n          You look just like your unit.\r\n\r\n                         GREER\r\n          Except older and fatter. Sorry if\r\n          I seem a little out of it.\r\n\r\n                         PETERS\r\n          You've been through a lot.\r\n\r\n                         GREER\r\n          They're calling it a concussion--\r\n          felt like my head was going to\r\n          explode.\r\n          With a brisk RAP on the doorframe, STONE enters.\r\n\r\n                         STONE\r\n          How ya' feeling, Greer?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          53.\r\n\r\n                         CONTINUED: (3)\r\n          GREER shrinks back in his bed.\r\n\r\n                         GREER\r\n          You tell me. How's Lopez?\r\n          Stone sighs, looking him over. Quietly:\r\n\r\n                         STONE\r\n          The pilot? They found him dead in\r\n          his stim chair. Same with one of\r\n          the Baltimore cops, other's in a\r\n          coma. Four Dreads were killed on\r\n          the ground, half a dozen wounded.\r\n          Greer closes his eyes in misery.\r\n\r\n                         PETERS\r\n          It's not your fault. You were doing\r\n          your job.\r\n          Stone pulls up Maggie's chair, sits as he speaks.\r\n\r\n                         STONE\r\n          I would have to disagree. You\r\n          requisitioned that chopper without\r\n          authorization. You violated our\r\n          treaty with the Dreads-- we're\r\n          expecting retaliation. Those poor\r\n          cops had no idea what they were up\r\n\r\n                         AGAINST--\r\n\r\n                         GREER\r\n          None of us did! We still don't\r\n          know. I don't think Strickland\r\n          even knew-- he thought he was just\r\n          taking down \"the abominations.\"\r\n\r\n                         STONE\r\n          I'm sorry, Greer,. but- - you're\r\n          suspended, pending further action.\r\n          Greer nods slowly, knew this was coming. PETERS takes a\r\n          step back, looking on carefully. Greer takes his LAPTOP\r\n          COMPUTER off the bedside table, opens it so that Stone\r\n          can see it.\r\n\r\n                         GREER\r\n          I've been going through my memory\r\n          files of the crash... ever seen\r\n          anything like this before?\r\n          ON SCREEN - a magnified CLOSE-UP of the DEVICE in\r\n          STRICKLAND'S HAND, as he points it upward at the\r\n          helicopter.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          54.\r\n\r\n                         CONTINUED: (4)\r\n\r\n                         PETERS\r\n          It's the murder weapon?\r\n          GREER nods, STONE studies the laptop, sets his jaw.\r\n\r\n                         STONE\r\n          It's more than that. It means\r\n          nobody is safe. The Dreads want\r\n          us all to be like them-- living in\r\n          fear, no better than animals. And\r\n          we've only just freed ourselves,\r\n          begun to explore our true\r\n          potential.\r\n\r\n                         GREER\r\n          We need to get this guy.\r\n\r\n                         STONE\r\n          We will. Our way of life will be\r\n          protected, whatever it takes.\r\n          An attractive SURRIE NURSE enters the room.\r\n\r\n                         NURSE\r\n          Good news, Mr. Greer. The doctors\r\n          say you can go home today.\r\n\r\n                         GREER\r\n          (nervous, thrown)\r\n          They said the end of the week--\r\n\r\n                         NURSE\r\n          Insurance, you know.\r\n          She smiles, putting his clothing by the bed and\r\n          disconnecting him from the IV and monitors.\r\n\r\n                         STONE\r\n          Just take some time to heal.\r\n\r\n                         GREER\r\n          What about my surrogate?\r\n\r\n                         STONE\r\n          Hasn't been-recovered. I'm afraid\r\n          we can't supply you with a new one\r\n          until this matter is resolved.\r\n          Peters, make sure he gets home in\r\n          one piece.\r\n          PETERS nods, looking at Greer sympathetically. GREER\r\n          sinks back into his pillow, anxious.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          55.\r\n\r\n                         CONTINUED: (5)\r\n          ON MEDICAL MONITOR - the image of GREER'S BRAIN shuts OFF\r\n          with a BLIP.\r\n\r\n          EXT. HOSPITAL ENTRANCE - DAY\r\n\r\n          PETERS strides from the doors, GREER follows, dressed in\r\n          casual clothes... then slows his pace, breathing hard.\r\n          GREER'S POV - CARS zipping past on the street, RUSHING\r\n          PEDESTRIANS, PARAMEDICS pushing a body past on a gurney.\r\n          From Greer's now human perspective, surrogates seem\r\n          artificial, appearance too perfect, eyes empty of souls.\r\n          This should be reeling, vertiginous.\r\n          PETERS pauses, seeing Greer is having a panic attack. He\r\n          has trouble speaking.\r\n\r\n                         GREER\r\n          I haven't been out without a\r\n          surrogate in a long time...\r\n\r\n                         PETERS\r\n          It's OK. Nothing's gonna happen.\r\n\r\n                         GREER\r\n          They wanted to give me something\r\n          for the anxiety... they call it\r\n          corporeaphobia.\r\n\r\n                         PETERS\r\n          Just take my arm.\r\n          He shakes his head, takes a deep breath and moves out\r\n          onto the sidewalk. Peters stays close.\r\n          GREER'S POV - SURRIE PEDESTRIANS, moving quickly, seeming\r\n          to come right. at him. One bumps into him--\r\n          GREER staggers, the surrie moves on as if he hasn't even\r\n          noticed. Greer moves toward the curb to get away from\r\n          them, stumbles-- PETERS has to pull him out of CAR\r\n          TRAFFIC, a HORN HONKS. He's sweating, terrified.\r\n\r\n                         GREER\r\n          Jesus Christ.\r\n\r\n                         PETERS\r\n          We need to get you a replacement.\r\n          She takes his arm forcibly and moves him away.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          56.\r\n\r\n          EXT. SURROGATE DISCOUNT STORE - DAY\r\n\r\n          A low-end place, BODIES displayed in the windows in their\r\n          charging bays, SIGNS reading \"HURRY 4 A SURRY! GIANT\r\n\r\n          SALE! SYNTH UNITS NEW & USED!\"\r\n          PETERS guides GREER inside.\r\n\r\n          INT. SURROGATE DISCOUNT STORE - DAY\r\n\r\n          COFFIN-SIZED BOXES, SENSORY PROJECTORS and STIM CHAIRS\r\n          stacked willy-nilly. BRIGHT LIGHTS, VIDEO SCREENS\r\n          running PROMOS. A slick, blond Aryan SALESMAN approaches\r\n          with a grin. He sizes GREER up, instantly recognizing\r\n          signs of withdrawal. He speaks with an incongruous ASIAN\r\n\r\n          ACCENT.\r\n\r\n                         SALESMAN\r\n          Oh you poor guy-- out in just your\r\n          skin can be scary. No worries, I\r\n          got perfect surrie for you.\r\n          He leads them deeper into the store. He wears a clip-on\r\n          ID BADGE with the smiling face of a dark-haired ASIAN.\r\n          RACKS OF ATTRACTIVE MALE and FEMALE BODIES, in skimpy\r\n          BATHING SUITS-- differing heights and degrees of muscle.\r\n          GREER looks these over.\r\n\r\n                         GREER\r\n          I like to see my own face when I\r\n          look in the mirror.\r\n\r\n                         SALESMAN\r\n          Fine, you no buy off the rack-- we\r\n          customize, on premise, less than\r\n          one hour.\r\n          As they move on, we glimpse CELEBRITY LOOK-ALIKES on the\r\n          rack-- MARILYN MONROE and ELVIS PRESLEY.\r\n          LATER - ON COMPUTER SCREEN, a 3-D RENDERING of GREER'S\r\n          FACE rotates, shows EXPRESSIONS, smiles, frowns-- and\r\n          speaks. A VOICE-PRINT runs below.\r\n\r\n                         GREER'S VOICE\r\n          Hello. Testing-one-two-three...\r\n          THE SALESMAN works the computer, GREER lies in an\r\n          uncomfortable STIM CHAIR attached to a_SENSORY PROJECTOR,\r\n          RED GOGGLES over his eyes and a CAMERA pointed at his\r\n          face. He seems uneasy. PETERS looks on from nearby.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          57.\r\n\r\n                         CONTINUED:\r\n\r\n                         SALESMAN\r\n          No worries, we make you good deal,\r\n          no payment til next year. Just try\r\n          one on for size. You like, we lock\r\n          in your neural code, plastiform\r\n          your face, you good to go.\r\n          THE SALESMAN hits a couple of switches, slips a small\r\n          SLEEVE over GREER'S FINGER, it's wired to the projector.\r\n\r\n                         SALESMAN (CONT'D)\r\n          Take a whirl.\r\n          Greer touches his fingers together--- his body instantly\r\n          goes limp and--\r\n          -a pale, hairless SURRIE TEMPLATE in a speedo steps out\r\n          of a CHARGING BAY. Its head is unfinished, a mechanical\r\n          version of a skinless face. Around its neck is a sign\r\n          that reads \"40% OFF!\"\r\n\r\n                         SALESMAN (CONT'D)\r\n          Looking gooood.\r\n\r\n                         40% OFF\r\n          I dunno...\r\n          The VOICE is a tinny, far-away sounding version of\r\n          Greer's. Suddenly 40% OFF twitches and stumbles, bumping\r\n          into a DISPLAY.\r\n\r\n                         SALESMAN\r\n          Try touching your nose.\r\n          40% OFF pokes himself in the eye.\r\n\r\n                         'SALESMAN (CONT'D)\r\n          Good, good. Takes some time to\r\n          break in. Base model come with\r\n          vision, hearing-- other senses\r\n          optional.\r\n\r\n                         40% OFF\r\n          Screw this.\r\n          The surrie FREEZES in its tracks... and slowly TOPPLES\r\n          OVER as GREER pulls of the projector headpiece. The\r\n          SALESMAN sets to righting it, GREER heads for the exit.\r\n\r\n                         SALESMAN\r\n          Wait wait wait! I throw in super-\r\n          sex software package-- fifty\r\n          percent off!\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          58.\r\n\r\n                         CONTINUED: (2)\r\n\r\n                         PETERS\r\n          We can try a department store--\r\n          if money's a problem, I can front\r\n\r\n                         YOU TILL--\r\n\r\n                         GREER\r\n          No. I'm a grown man for\r\n          Chrissake, I should be able to\r\n          walk down the street without\r\n          completely freaking out.\r\n\r\n          INT. BAR - DAY\r\n\r\n          A BARTENDER puts a SODA WATER and a GLASS OF SCOTCH on\r\n          the bar in front of PETERS and the shaky GREER.\r\n\r\n                         PETERS\r\n          Well, you made it a block.\r\n\r\n                         GREER\r\n          (lifts his glass)\r\n          Here's to self-medication.\r\n          He takes a sip and spits it out. The BARTENDER turns.\r\n\r\n                         BARTENDER\r\n          Are you all right, sir?\r\n\r\n                         GREER\r\n          What is this?\r\n          The BARTENDER gives him a once-over.\r\n\r\n                         BARTENDER\r\n          Oh, sorry. We don't get a lot of--\r\n          that's synthohol. Just a CPU\r\n          inhibition blocker in a non-\r\n          corrosive solution...\r\n          As the bartender speaks, Greer looks around the dark bar--\r\n          --in the back, EVERY COUPLE is gazing into each other's\r\n          eyes, clearly hooking up.\r\n          GREER continues to watch the other patrons.\r\n\r\n                         GREER\r\n          You have any real booze?\r\n\r\n                         BARTENDER\r\n          No liquor license.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          59.\r\n\r\n                         CONTINUED:\r\n          The BARTENDER shrugs and moves off. Peters sips her soda\r\n          water, amused.\r\n\r\n                         PETERS\r\n          Come here often, stranger?\r\n\r\n                         GREER\r\n          You know, they really don't look\r\n          human. You can't tell when you're\r\n          inside them, but...\r\n          GREER turns to PETERS, studies her like the others.\r\n\r\n                         PETERS\r\n          I don't like the way you're\r\n          looking at me.\r\n\r\n                         GREER\r\n          But I'm not really looking at you.\r\n\r\n                         PETERS\r\n          Yeah yeah, this is just a lump of\r\n          aluminum and polystyrene. Tell\r\n          you what, next time you're in\r\n          Colorado, look me up for real. We\r\n          can have a beer together.\r\n\r\n                         GREER\r\n          I'd like that.\r\n          PETERS blinks, Greer has suddenly gotten sincere on her.\r\n          He looks away.\r\n\r\n                         GREER (CONT'D)\r\n          You know, when we started working\r\n          together, I thought you were kind\r\n          of a stiff.\r\n\r\n                         PETERS\r\n          New job, I was defensive.\r\n\r\n                         GREER\r\n          It's more than that... you're\r\n          different. Or maybe I am.\r\n          Greer's embarrassed, shrugs it off. He puts down a bill\r\n          and rises.\r\n\r\n                         GREER (CONT'D)\r\n          You probably oughta head back to\r\n          the office.\r\n\r\n                         PETERS\r\n          I can get you home.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          60.\r\n\r\n                         CONTINUED: (2)\r\n\r\n                         GREER\r\n          I'll be OK.\r\n          He moves toward the door, she tags along.\r\n\r\n                         GREER (CONT'D)\r\n          I'm thinking you should double-\r\n          check Strickland's records, go back\r\n          to the hard copies. See if you can\r\n          find out why they dropped charges.\r\n\r\n                         PETERS\r\n          You seem better already.\r\n\r\n                         GREER\r\n          It's like riding a bike.\r\n\r\n          EXT. METRO ENTRANCE - DAY\r\n\r\n          subway,\r\n          GREER and PETERS walk, he spots a sign for the\r\n          changes direction to head for the escalator.\r\n\r\n                         PETERS\r\n          Where you going?\r\n\r\n                         GREER\r\n          It's a lovely day. Thought I'd take\r\n          a trip to East Baltimore.\r\n          He pauses at the top, a hit of vertigo.\r\n\r\n                         GREER (CONT'D)\r\n          Was it always this steep?\r\n\r\n                         PETERS\r\n          Jesus, Tom, the rez?\r\n\r\n                         GREER\r\n          Since I'm stuck in my skin, I\r\n          oughta take advantage of it. Hell,\r\n          as long as Strickland has that\r\n          device-- I'm safer this way.\r\n          He clutches the handrail, starts moving down.\r\n\r\n                         PETERS\r\n          Be careful.\r\n          He nods and waves as he disappears down the escalator.\r\n\r\n                         CUT TO:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          61.\r\n\r\n          INT. FBI BUILDING/LOBBY - DAY\r\n\r\n          PETERS enters this large lobby, bustling with other\r\n          AGENTS and OFFICIALS. She moves toward a DESK JOCKEY,\r\n          security SCANNERS. She reacts to the sound of--\r\n          --SCREAMS and SCREECHING TIRES from outside the building.\r\n          PETERS looks toward a large WINDOW to the street-- and\r\n          immediately dives for cover as--\r\n          --a battered SUV, spray-painted with anti-surrogate\r\n          GRAFFITI, SMASHES through the plate glass. SURRIE\r\n          PEDESTRIANS are plastered across the grill and embedded\r\n          in the windshield.\r\n          THE SUV slams into a few SURRIES in the lobby, sends them\r\n          flying or runs over them. It spins sideways into a WALL\r\n          with the FBI SEAL overhead.\r\n          The DRIVER leaps out, armed with a MACHINE GUN. He's\r\n          clearly a DREAD, angry and deranged. He starts SHOOTING\r\n          at anything that moves.\r\n          PETERS crouches for cover as BULLETS shatter GLASS and\r\n          smash MARBLE around her.\r\n          An army of AGENTS burst from an elevator in Kevlar and\r\n          riot helmets, armed with AUTOMATIC RIFLES. They\r\n          instantly bring the DREAD down in a barrage of gunfire.\r\n          The agents move to the DREAD'S BODY-- he's very dead,\r\n          pouring BLOOD from dozens of bullet wounds. One speaks\r\n          into his headset:\r\n\r\n                         RIOT AGENT\r\n          Secure.\r\n\r\n                         (TO CROWD)\r\n          Any biologicals here?\r\n\r\n                         CUT TO:\r\n\r\n          INT. TAXICAB - DAY\r\n\r\n          A SMALL FLAT-PANEL TV in the back of the CAB plays NEWS\r\n          of the attack on the FBI building. PILES of surries\r\n          removed on carts, one BODY on a stretcher.\r\n\r\n          NEWS READER VOICE\r\n          --twenty-seven surrogates irreparably\r\n          damaged. Only one dead, the attacker\r\n          himself.\r\n\r\n                         (MORE)\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          62.\r\n\r\n                         CONTINUED:\r\n\r\n          NEWS READER VOICE (CONT'D)\r\n          His motive is unclear at this point,\r\n          but may be a response to the recent\r\n          incident at the Baltimore human\r\n          reservation...\r\n          GREER, in the back seat, takes in this news grimly. The\r\n          CABBIE has been glancing at his own monitor in front.\r\n\r\n                         CABBIE\r\n          Goddamn Dreads... sure you don't\r\n          wanna change your mind?\r\n\r\n                         GREER\r\n          I'm sure.\r\n\r\n          EXT. BALTIMORE SLUMS - DAY\r\n\r\n          Late afternoon. GREER emerges from a TAXI near the same\r\n          gate we saw earlier. Greer wobbles, steadies himself\r\n          against the car as he pays the CABBIE-- a DRONE\r\n          SURROGATE, built into the seat.\r\n\r\n                         CABBIE\r\n          You OK, man?\r\n\r\n                         GREER\r\n          Just a little carsick.\r\n          The TAXI pulls away, Greer heads for the GATE.\r\n\r\n          EXT. RESERVATION NO MAN'S LAND - DAY\r\n\r\n          AT THE GATE: METAL SIGNS read \"HUMANS ONLY - NO\r\n          SURROGATES.\" GREER goes through a big,.old-fashioned\r\n          (present-day) METAL DETECTOR, the light flashes GREEN. A\r\n          DREAD GUARD waves him past. Greer gestures toward one of\r\n          the many IMAGES OF THE PROPHET to be found in the rez.\r\n\r\n                         GREER\r\n          Where would I find the, the what do\r\n          you call it, the Temple?\r\n\r\n                         DREAD GUARD\r\n          Ten blocks that way, left on\r\n          Bloomfield.\r\n\r\n                         GREER\r\n          Thanks.\r\n          (eyes the grim area)\r\n          Catch a lotta surries tryin' to\r\n          sneak in, do ya?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          63.\r\n\r\n                         CONTINUED:\r\n\r\n                         DREAD GUARD\r\n          Piss off.\r\n          As Greer crosses the rubble-strewn no man's land, he\r\n          pauses, sickened as he sees--\r\n          --the burned-out HELICOPTER HULK, now sprayed with\r\n          GRAFITTI. \"PIGS DIE,\" etc. And just beyond this--\r\n          --what's left of GREER'S SURRIE, half the head blown off\r\n          with fried electronics hanging out. It's been lashed to\r\n          a makeshift crucifix, made from the bent CHOPPER BLADES.\r\n          The clothing is shredded, the remains spray-painted.\r\n          GREER, wary of being recognized, continues on.\r\n\r\n          EXT. RESERVATION STREET - DAY\r\n\r\n          GREER walks through a poor but surprisingly pleasant\r\n          neighborhood-- rowhouses, gardens. Very few cars.\r\n          DREADS look like ordinary working-class folks.\r\n          A BARBECUE, a group of RESIDENTS laughing and drinking.\r\n          Greer inhales the SMOKE as he passes, smiles to himself.\r\n          A couple of FRIENDLY DOGS trot curiously after him for a\r\n          moment, then return to the barbecue. GREER, not paying\r\n          attention, brushes past an ELDERLY MALE PEDESTRIAN.\r\n\r\n                         GREER\r\n          Excuse me.\r\n\r\n                         PEDESTRIAN\r\n          (smiles and nods)\r\n          No problem.\r\n          A PLAYGROUND a short distance on,.LOTS OF KIDS shrieking\r\n          and running. Greer pauses here, taking this in. These\r\n          are the first children we've seen, outside of a TV ad.\r\n          A CLOUD OF DIESEL SMOKE from a decrepit BUS. Greer\r\n          CHOKES on this, but doesn't seem displeased. His body\r\n          language has become more relaxed as he gets further into\r\n          the rez, getting his land legs back.\r\n\r\n          INT. RESERVATION TEMPLE - DAY\r\n\r\n          A cavernous convention center, thousands of folding\r\n          chairs face a raised PULPIT at one end. Behind this is a\r\n          SUPERGRAPHIC of the PROPHET, hands raised in benediction.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          64.\r\n\r\n                         CONTINUED:\r\n          GREER enters, takes this in. He spots a CLEANING LADY,\r\n          an older woman sweeping up amidst the rows nearby.\r\n\r\n                         GREER\r\n          Excuse me. You wouldn't happen to\r\n          know a Jack Strickland? I'm told\r\n          he worked here off and on.\r\n\r\n                         CLEANING LADY\r\n\r\n                         (NODS)\r\n          You're here for the service? It's\r\n          in the park.\r\n\r\n          EXT. RESERVATION PARK - DUSK\r\n\r\n          GREER moves down a path in this expanse of greenery. He\r\n          comes to an open lawn with a fairly large CROWD gathered,\r\n          illuminated by a FLAMING TORCH.\r\n          THE PROPHET is speaking. He stands before a platform\r\n          atop wooden scaffolding, firewood piled below. A\r\n          formidable ring of BODYGUARDS stands between him and the\r\n          gathered throng of DREADS.\r\n\r\n                         PROPHET\r\n          --serving faithfully beside us in\r\n          the cause of humanity. _I had the\r\n          privilege of hearing his confession\r\n          shortly before his death.\r\n          GREER has pushed his way gently toward the front to get a\r\n          look at the BODY atop the funeral BIER.\r\n          The corpse atop the bier is that of JACK STRICKLAND, eyes\r\n          closed, hands folded.\r\n\r\n                         PROPHET (CONT'D)\r\n          And I know he would have rejoiced\r\n          in the day of resurrection, the\r\n          day for which we are all\r\n          preparing, the day I promise you\r\n          is close at hand...\r\n          So saying, the PROPHET lifts the torch and touches it to\r\n          the base of the PYRE, which ERUPTS IN FLAME.\r\n          CLOSE ON STRICKLAND as the FLAMES lick up around him.\r\n          LATER, the BIER consumed in FIRE, the MOURNERS\r\n          dispersing. THE PROPHET is moving away, HANDLERS\r\n          surrounding him. GREER tags along-- but one of the\r\n          Prophet's goons, BUD, gets in his face.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         65\r\n\r\n                         CONTINUED:\r\n\r\n                         BUD\r\n          Who are you?\r\n\r\n                         GREER\r\n          What happened to Jack Strickland?\r\n\r\n                         BUD\r\n          He slipped and fell. Friend of yours?\r\n          Greer starts to move around him, Bud gets in his way.\r\n\r\n                         GREER\r\n          I'd like a word with the Prophet.\r\n\r\n                         BUD\r\n          You and everyone else.\r\n          MILLER and ADAMS, another goon, now join them.\r\n\r\n                         GREER\r\n          Strickland was carrying a weapon.\r\n          If it isn't recovered, there could\r\n          be serious consequences-- for all\r\n          of you.\r\n          IN BG, the PROPHET and HANDLERS head toward a large RV.\r\n\r\n                         MILLER\r\n          You some kinda cop? Where's your\r\n          puppet?\r\n\r\n                         GREER\r\n          Needs repairs.\r\n\r\n                         MILLER\r\n          You armed?\r\n          GREER shakes his head, raises his hands.\r\n\r\n                         GREER\r\n          Frisk me if you want.\r\n\r\n                         MILLER\r\n          No, that's OK.\r\n          With that, he throws a SUCKER PUNCH to the gut. GREER\r\n          doubles over. He seems amazed at the sensation, the\r\n          pain. But he recovers, throws a wild punch at Miller an d\r\n          misses by a foot. [Violence for Greer in human form\r\n          should have a very different, painfully visceral feel,\r\n          unlike when he was a surrogate.]\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          66.\r\n\r\n                         CONTINUED: (2)\r\n          ADAMS cracks Greer across the back of his head. GREER\r\n          falls to the ground. BUD kicks him once. GREER chokes\r\n          and groans in pain.\r\n\r\n                         MILLER (CONT'D)\r\n          Hurts, doesn't it.\r\n\r\n                         BUD\r\n          It's a bitch being real.\r\n          GREER lets out a primal CRY and lunges at MILLER, driving\r\n          his head into the man's torso, knocking the wind out of\r\n          him before the other two can pull Greer back.\r\n\r\n                         ADAMS\r\n          I think he likes it.\r\n\r\n                         MILLER\r\n          (catching his breath)\r\n          So give him some more.\r\n          Outnumbered three to one, Greer takes a beating,\r\n          continues to throw mostly ineffective punches that just\r\n          cause the men to redouble their efforts. Finally, he's\r\n          limp in their arms.\r\n          Miller plucks Greer's WALLET and BADGE from his pockets,\r\n          examines them. As he does so, GREER spits BLOOD on the\r\n          man's face. Miller seems about to whomp him again, but\r\n          stops himself.\r\n\r\n                         MILLER (CONT'D)\r\n          Not gonna give you the\r\n          satisfaction.\r\n          (to Bud and Adams)\r\n          Get him out of here.\r\n          Miller tosses Greer's ID at him, then moves toward the\r\n          RV, leaving GREER gasping in the clutches of Bud and\r\n          Adams, lit by the FLAMES from the funeral pyre.\r\n\r\n          INT. PROPHET'S RV - NIGHT\r\n\r\n          A spartan interior. MILLER enters. THE PROPHET stands\r\n          with a couple of HANDLERS.\r\n\r\n                         HANDLER\r\n          Trouble?\r\n\r\n                         MILLER\r\n          Some fed named Greer, he wanted to\r\n          talk to the Prophet.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          67.\r\n\r\n                         CONTINUED:\r\n\r\n                         HANDLER\r\n          About that turkey shoot in DC?\r\n\r\n                         MILLER\r\n          Didn't come up. Said they wanted\r\n          Strickland's weapon.\r\n\r\n                         PROPHET\r\n          Well, maybe I'll just have to\r\n          bring it to their doorstep...\r\n          In the Prophet's hand, we now see--\r\n          --the mysterious DEVICE with which Strickland killed his\r\n          targets.\r\n\r\n          EXT. RESERVATION NO MAN'S LAND - NIGHT\r\n\r\n          GREER is half-dragged, half-carried, back the way he\r\n          came, flanked by BUD and ADAMS. Greer sucks on his\r\n          BLEEDING lip, works his tongue around in his mouth. He\r\n          touches parts of his bruised body carefully.\r\n\r\n                         BUD\r\n          Guy like you oughtn't be out in\r\n          just your skin.\r\n\r\n                         GREER\r\n          I'm starting to see your point.\r\n          AT THE GATE - GREER leaves, trying to muster as much\r\n          dignity as he can. The DREAD GUARD calls sarcastically\r\n          after him.\r\n\r\n                         DREAD GUARD\r\n          Come again real soon!\r\n\r\n          EXT. BALTIMORE SLUMS - NIGHT\r\n\r\n          GREER trudges along the seedy streets. He looks a mess--\r\n          torn clothing, bloodstains, bruises. Suddenly he's\r\n          SHOVED from behind, falls to the pavement.\r\n\r\n                         WHEELS\r\n          Oops.\r\n          The assailant is a FREAK SURRIE-- extra ARMS, WHEELS\r\n          where his feet should be.\r\n          A moment later, Greer is surrounded by three rich, FREAKY\r\n\r\n          TEENS.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          68.\r\n\r\n                         CONTINUED:\r\n          They've customized their surries in completely bizarre\r\n          ways, in addition to the usual tattoos and piercings.\r\n          Besides WHEELS, there's a hairless teen with six EYES\r\n          scattered around his head. A GIRL has SPIKES sticking\r\n          out of her skull and flesh and REPTILE SKIN.\r\n\r\n                         EYES\r\n          Watch where you're going, meat.\r\n\r\n                         SPIKES\r\n          What are you doin' off the rez?\r\n          She bumps against GREER as he picks himself up, he\r\n          shrinks from the spikes. She shoots a small blast of\r\n          FLAME from her nostrils, then GIGGLES.\r\n\r\n                         GREER\r\n          I'm not a Dread.\r\n\r\n                         WHEELS\r\n          Then you oughta return that\r\n          surrie, looks like shit.\r\n          WHEELS comes at Greer again, Greer moves and TRIPS him--\r\n          but he just lands on an extra arm and rights himself.\r\n\r\n                         EYES\r\n          Hey, it wants to play.\r\n          EYES lowers his head and moves to butt him. GREER\r\n          dodges, it looks like a bullfight.\r\n\r\n                         SPIKES\r\n          Ole, toro!\r\n          They turn, hearing a SCREECH OF TIRES.\r\n          A LIMOUSINE has pulled up. A 10-year-old BOY climbs from\r\n          the back and approaches.\r\n\r\n                         BOY\r\n          Agent Greer. Would you like a ride?\r\n           The kid's voice sounds like a child's, but with mature\r\n          cadences to his speech. -\r\n\r\n                         WHEELS\r\n          Check out Richie Rich.\r\n          THE DRIVER of the Limo steps out-- it's ARMANDO from\r\n          Canter's lobby. He lets his jacket fall open, revealing\r\n          a HOLSTERED SIDEARM.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         69\r\n\r\n                         CONTINUED: (2)\r\n\r\n                         ARMANDO\r\n          We got a problem here?\r\n          The FREAKS retreat with dirty looks.\r\n\r\n                         SPIKES\r\n          Fascists.\r\n          The BOY moves back toward the LIMO. Greer follows.\r\n\r\n                         BOY\r\n          (re: the freaks)\r\n          So many unforeseen consequences to\r\n          the surrogate revolution... I\r\n          suppose I should apologize.\r\n\r\n                         GREER\r\n          Who are you?\r\n\r\n          INT. LIMO -- NIGHT\r\n\r\n          As GREER climbs in, the BOY hands him back his own\r\n          BUSINESS CARD, the one Greer left with Canter.\r\n\r\n                         BOY/CANTER\r\n          You left this on my desk.\r\n          ARMANDO has gotten behind the wheel, starts moving.\r\n          Greer looks at the boy, amazed.\r\n\r\n                         GREER\r\n          Canter?\r\n\r\n                         BOY/CANTER\r\n          It's not safe for me to use my\r\n          usual surrogates. This is one of\r\n          VSI's.newer models. Not that the\r\n          market will be that strong, the\r\n          birthrate being what it is.\r\n\r\n                         GREER\r\n          You're having me followed.\r\n\r\n                         BOY/CANTER\r\n          You know how important this\r\n          investigation is to me.\r\n\r\n                         GREER\r\n\r\n                         (A BEAT)\r\n          The man who killed your son is dead.\r\n          Boy/Canter absorbs this.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          70.\r\n\r\n                         CONTINUED:\r\n\r\n                         BOY/CANTER\r\n          I want you to tell me everything.\r\n\r\n                         GREER\r\n          I suppose you deserve that.\r\n\r\n          EXT. WASHINGTON D.C. - NIGHT\r\n\r\n          THE LIMO drives along the Potomac near the city.\r\n\r\n          INT. LIMO - NIGHT\r\n\r\n          GREER holds ICE to his swollen face.\r\n\r\n                         BOY/CANTER\r\n          This Strickland character. I\r\n          don't believe he could have been\r\n          acting on his own.\r\n\r\n                         GREER\r\n          Why not? You stand for everything\r\n          the humanists hate--\r\n\r\n                         BOY/CANTER\r\n          Then why would his own people\r\n          murder-him?\r\n\r\n                         GREER\r\n          He'd outlived his usefulness.\r\n          With me all over his ass, he was\r\n          becoming a security risk--\r\n\r\n                         BOY/CANTER\r\n          To kill someone remotely-- it\r\n          would take a virus presumably, one\r\n          that could get past every firewall\r\n          protecting a surrie's circuitry--\r\n          then once in the CPU, override all\r\n          the fail-safes and cause\r\n          catastrophic brain damage...\r\n\r\n                         GREER\r\n          Presumably.\r\n\r\n                         BOY/CANTER\r\n          We're talking about an\r\n\r\n                         EXTRAORDINARILY SOPHISTICATED\r\n          technology, don't you think? The\r\n          Dreads didn't come up with it, -\r\n          they don't even like to use\r\n          cellphones.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          71.\r\n\r\n                         CONTINUED:\r\n\r\n                         GREER\r\n\r\n                         (EXASPERATED)\r\n          OK, fine. Maybe we've got our\r\n          heads up our own ass--\r\n\r\n                         BOY/CANTER\r\n          Maybe that's exactly where you\r\n          should be looking.\r\n          Greer takes a second to absorb this.\r\n\r\n                         GREER\r\n          So now you're the victim of a\r\n          government conspiracy?\r\n\r\n                         BOY/CANTER\r\n          I think this is your stop.\r\n\r\n          EXT. GREER'S BUILDING - NIGHT\r\n\r\n          THE LIMO stops, a light RAIN now falling. GREER gets out\r\n          and closes the door, the rear window rolls down.\r\n\r\n                         BOY/CANTER\r\n          Somebody hired Strickland. You'll\r\n          know who that is when you trace\r\n          the weapon.\r\n\r\n                         GREER\r\n          You really don't need to do my job\r\n          for me.\r\n          Boy/Canter takes in Greer's disheveled state.\r\n\r\n                         BOY/CANTER\r\n          Yes, I can see you've got things\r\n          under control.\r\n          The limo pulls away. Greer pauses, looks up at the sky,\r\n          letting the rain wash over his face.\r\n\r\n          INT. GREER'S APARTMENT/LIVING ROOM - NIGHT\r\n\r\n          AN ELECTRICAL ARC jumps from a GLASS TUBE to a MALE\r\n\r\n          NOSTRIL.\r\n          WIDER, the guy taking the jolt is a lanky male model\r\n          named BRIAN. His face goes slack. ATMOSPHERIC MUSIC\r\n\r\n          PLAYS.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          72.\r\n\r\n                         CONTINUED:\r\n          MAGGIE and BRIDGET are squeezed together on the couch in\r\n          Greer's apartment with BRIAN and a French hunk named\r\n          ANDRE, who speaks with a slight ACCENT. Everyone is\r\n          pretty high. Andre closes one eye, then the other,\r\n          pupils turned inward.\r\n\r\n                         ANDRE\r\n          Think my nose is too big...\r\n\r\n                         MAGGIE\r\n          For what?\r\n\r\n                         ANDRE\r\n\r\n                         (SQUEEZING IT)\r\n          I'm going to have it replaced.\r\n\r\n                         BRIDGET\r\n          While you're at it-- I am so sick\r\n          of twelve-inch dicks.\r\n          MAGGIE chuckles. On the coffee table before them sits a\r\n          small JACKER, like the one we saw in the underground\r\n          club. The foursome pass a single ELECTRICAL TUBE around,\r\n          attached by a cord to the device. Andre and Bridget have\r\n          clearly coupled up, Brian touches Maggie's leg casually\r\n          from time to time.\r\n\r\n                         ANDRE\r\n          What do you want, we're men.\r\n\r\n                         BRIAN\r\n          (coming out of it)\r\n          Why is that? Why do we all have\r\n          to be men and women? I'd rather\r\n          be-- I dunno, a lion. Or an\r\n          eagle.\r\n\r\n                         MAGGIE\r\n          Mm. A spaceship. Or a cloud.\r\n\r\n                         BRIAN\r\n\r\n                         (BEAT)\r\n          A cloud?\r\n          Maggie shrugs. She lifts the hair from the nape of her\r\n          neck, moves the GLASS TUBE there. Brian holds her close.\r\n          The ELECTRICAL ARC-- MAGGIE gasps with pleasure,\r\n          transported.\r\n          A moment later, Andre notices that GREER has entered\r\n          quietly during the above, staring at the foursome.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          73.\r\n\r\n                         CONTINUED: (2)\r\n\r\n                         ANDRE\r\n          Don't look now. Some homeless\r\n          meatbag just wandered in.\r\n          Maggie has blanked out for the moment. Bridget turns.\r\n\r\n                         BRIDGET\r\n          That's Maggie's husband. Hi Tom.\r\n          She gives him a little wave. Greer moves past them,\r\n          toward the kitchen, and disappears. Maggie comes out of\r\n          her trance, blinks and sighs.\r\n\r\n                         MAGGIE\r\n          Excuse me.\r\n          She hurries after him. Brian shrugs, grabs the tube and\r\n          starts to unzip his pants--\r\n\r\n          INT. GREER'S APARTMENT/KITCHEN - NIGHT\r\n\r\n          GREER has removed an old, yellowed FIRST-AID KIT from\r\n          under the sink, during the scene he cleans up cuts, opens\r\n          his shirt to check his bruised ribs, etc.\r\n\r\n                         MAGGIE\r\n          What happened to you? I thought\r\n          you were-spending another night in\r\n          the hospital.\r\n\r\n                         GREER\r\n          Obviously. You know I don't like\r\n          you jacking in the house.\r\n          He finds an untouched, dusty bottle of SCOTCH, sniffs it\r\n          and pours a drink. Maggie looks him over.\r\n\r\n                         MAGGIE\r\n          Somebody beat you up? How could\r\n          you go out like that?\r\n          As Maggie speaks, she moves to his side, touching his\r\n          injuries gently, truly concerned. Greer flinches back.\r\n\r\n                         MAGGIE (CONT'D)\r\n          What were you thinking, Tom? You.\r\n          could've been killed.\r\n\r\n                         GREER\r\n          Just finding out how the other\r\n          half lives.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          74.\r\n\r\n                         CONTINUED:\r\n          Greer takes a long drink, gestures toward the living\r\n          room.\r\n\r\n                         GREER (CONT'D)\r\n          So what's his name?\r\n\r\n                         MAGGIE\r\n          Oh please, grow up.\r\n\r\n                         GREER\r\n\r\n                         (NODS GLUMLY)\r\n          I suppose it doesn't matter. Since,\r\n          as you keep telling me, it doesn't\r\n          mean anything. Nothing does.\r\n          Greer pours another drink.\r\n\r\n                         MAGGIE\r\n          I don't expect you to understand\r\n          this. But once in a while, I like\r\n          to be around people who don't hate\r\n          being alive.\r\n\r\n                         GREER\r\n          Alive. Is that what they are out\r\n          there?\r\n          She shakes her head and returns to the living room.\r\n\r\n          INT. GREER'S APARTMENT/LIVING ROOM - NIGHT\r\n\r\n          MAGGIE, BRIDGET, BRIAN and ANDRE are still partying-- in\r\n          fact, Bridget and Andre are starting to make out-- when\r\n          GREER re-enters, in a RAINCOAT, he's a little tipsy. The\r\n          BOTTLE pokes out of a pocket.\r\n\r\n                         BRIAN\r\n          Hey. You really a G-man?\r\n          Greer pauses, stares at the man.\r\n\r\n                         BRIAN (CONT'D)\r\n          Can I ask you something? Is it\r\n          true you guys are tapping into our\r\n          surries? Watching everything we\r\n          do, twenty-four seven?\r\n\r\n                         GREER\r\n\r\n                         (A BEAT)\r\n          Of course not.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          75.\r\n\r\n                         CONTINUED:\r\n          Greer starts to move across the room again, heading for\r\n          the door. Brian smirks, speaks quietly, thinking only\r\n          the others will hear. As he touches Maggie's leg:\r\n\r\n                         BRIAN\r\n          Wouldn't want him spying on us\r\n          tonight...\r\n          Greer spins near the door and, without breaking stride,\r\n          returns to the couch.\r\n\r\n                         GREER\r\n          Excuse me.\r\n          Brian turns, starts to rise. Greer grabs the man and\r\n          HURLS him backwards onto the GLASS COFFEE TABLE which\r\n          SHATTERS. The other three back away. After a stunned\r\n          moment, Brian starts LAUGHING, very hard-- obviously, he\r\n          hasn't felt a thing.\r\n\r\n                         MAGGIE\r\n          Tom, the table!\r\n          Greer steps over the couch calmly and begins PUNCHING and\r\n          KICKING the surrie on the floor, working off pent-up\r\n          rage. BRIAN just keeps LAUGHING.\r\n          Soon Greer's hands are cut and bleeding, he's panting,\r\n          exhausted. MAGGIE finally succeeds in pulling him away.-\r\n          BRIAN sits up, his FACE is DENTED, the plastic skin\r\n          STRETCHED and TORN.\r\n\r\n                         BRIAN\r\n          Could we do it again?\r\n\r\n                         ANDRE\r\n\r\n                         (CHUCKLING)\r\n          Oh man, your face.\r\n\r\n                         BRIAN\r\n          I was getting sick of it, anyway.\r\n          As Brian picks bits of GLASS out of his plastic flesh,\r\n          Andre suddenly realizes his JACKER is SMASHED, examines\r\n          the pieces with a MOAN.\r\n\r\n                         GREER\r\n          Guess the party's over.\r\n          MAGGIE follows GREER to the door. They speak in hushed\r\n\r\n                         TONES:\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          76.\r\n\r\n                         CONTINUED: (2)\r\n\r\n                         MAGGIE\r\n          What was the point of that?\r\n\r\n                         GREER\r\n          Does everything have to have a\r\n          point?\r\n          GREER takes a breath, bows his head.\r\n\r\n                         GREER (CONT'D)\r\n          I'm sorry. I just want us to-- to\r\n          connect again. To have a family,\r\n          to have a life.\r\n          (grabs her arms)\r\n          We can't do it through this wall\r\n          of plastic.\r\n          MAGGIE pulls away, his BLOODY HANDS have left marks on\r\n          her blouse.\r\n\r\n                         MAGGIE\r\n          I'm sorry, too. But this is my\r\n          life.\r\n          She looks at him sadly and returns to her guests. After\r\n          a beat, Greer heads out the door.\r\n\r\n          EXT. FBI BUILDING - NIGHT\r\n\r\n          GREER walks in the RAIN through nearly empty streets\r\n          toward the modern headquarters in Washington. There are\r\n          BOARDS over the shattered windows in front.\r\n\r\n          INT. FBI LOBBY - NIGHT\r\n\r\n          Quiet at this hour. A DESK JOCKEY looks up as GREER\r\n          approaches, careful to conceal the bottle.\r\n\r\n                         DESK JOCKEY\r\n          Is that you, Greer?\r\n\r\n                         GREER\r\n          In the flesh.\r\n          He takes in the damage to the lobby, the police tape, the\r\n          attacker's chalk silhouette.\r\n\r\n                         DESK JOCKEY\r\n          You missed all the excitement.\r\n\r\n                         GREER\r\n          Saw it on TV.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          77.\r\n\r\n                         CONTINUED:\r\n          He passes the SURRIE SCANNER and holds his hand over a\r\n          FINGERPRINT MACHINE, which confirms his identity. A\r\n          plexiglas door unlocks automatically.\r\n\r\n                         DESK JOCKEY\r\n          Says here you're on suspension.\r\n\r\n                         GREER\r\n          Mm. Just cleaning out my desk.\r\n\r\n                         DESK JOCKEY\r\n\r\n                         (EYING HIM)\r\n          Y'know, you're thinner on top.\r\n\r\n                         GREER\r\n          Nice of you to notice. You\r\n          remember where the rest rooms are?\r\n\r\n                         DESK JOCKEY\r\n          They mostly use 'em for storage.\r\n          Think the one on four still works.\r\n          Greer nods and continues in.\r\n\r\n          INT. FBI BUILDING/CHARGING ROOM - NIGHT\r\n\r\n          DOZENS of SURROGATE AGENTS are lined up against the wall\r\n          in here, in their foam CHARGING BAYS.\r\n          CAMERA FINDS PETERS in their midst. Her bay HUMS and she\r\n          blinks, becomes animated. She steps out of the bay.\r\n\r\n          INT. FBI BUILDING/GREER'S OFFICE - NIGHT\r\n\r\n          GREER has his feet up on his desk, the bottle beside him.\r\n          There are cardboard BOXES of DOCUMENTS nearby. PETERS\r\n          enters, Greer looks up at her.\r\n\r\n                         PETERS\r\n          Got your message.\r\n\r\n                         GREER\r\n          Hope I didn't wake you.\r\n\r\n                         PETERS\r\n          After what happened here today I\r\n          couldn't sleep.\r\n\r\n                         GREER\r\n          You tell anyone I was going out to\r\n          the rez? Canter, for example?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          78.\r\n\r\n                         CONTINUED:\r\n\r\n                         PETERS\r\n\r\n                         (TAKEN ABACK)\r\n          No. Of course not.\r\n          Greer studies her a beat, decides she's sincere. A sigh.\r\n          Peters sits on his desk, studies him.\r\n\r\n                         PETERS (CONT'D)\r\n          You look terrible.\r\n\r\n                         GREER\r\n          Not half as bad as I feel.\r\n          Greer refills his coffee cup with Scotch, holds the\r\n          bottle out to her questioningly.\r\n\r\n                         PETERS\r\n          No thanks.\r\n\r\n                         GREER\r\n          Come on. Just pretend to get\r\n          drunk with me.\r\n          Peters shakes her head with a smile. Greer shrugs, takes\r\n          a long drink, sighs and rubs his sore neck.\r\n\r\n                         GREER (CONT'D)\r\n          Feel like I've been asleep for\r\n          years-- now I wake up an old man.\r\n          Rip Van Frigging Winkle...\r\n          Peters moves behind him, begins rubbing his shoulders, a\r\n          massage.\r\n\r\n                         GREER (CONT'D)\r\n          What are you doing?\r\n\r\n                         PETERS\r\n          You look like you need it.\r\n\r\n                         GREER\r\n          I'm not sure how kosher this is...\r\n\r\n                         PETERS\r\n          Relax. It's not me, it's not a\r\n          woman touching you-- it's just a\r\n          machine.\r\n\r\n                         GREER\r\n          Does feel good... better than a\r\n          stim chair.\r\n          He allows himself to enjoy it for a moment, bows his\r\n          head.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          79.\r\n\r\n                         CONTINUED: (2)\r\n\r\n                         GREER (CONT'D)\r\n          You ever feel like it's... over?\r\n\r\n                         PETERS\r\n          What.\r\n\r\n                         GREER\r\n          Us. People. The stuff that used\r\n          to make the world make sense.\r\n          That made us... human. I don't\r\n          know, morality, love. Whatever.\r\n\r\n                         (BEAT)\r\n          Yeah, yeah, they were probably\r\n          saying that back in ancient Rome.\r\n\r\n                         PETERS\r\n          We always think technology's going\r\n          to improve our lives, but...\r\n\r\n                         GREER\r\n          What lives?\r\n          A beat, GREER sits up and pulls away from her touch. He\r\n          holds up a hand and lets it fall.\r\n\r\n                         GREER (CONT'D)\r\n          This has become obsolete. Someday\r\n          soon, we'll all just be brains in\r\n          jars.\r\n\r\n                         PETERS\r\n          Maybe not. I have a feeling\r\n          people are going to come to their\r\n          senses eventually.\r\n\r\n                         GREER\r\n          (shaking his head)\r\n          You can't unring a bell.\r\n          (turns toward her)\r\n          Thought you were the one all into\r\n          the brave new world.\r\n          PETERS is staring at her own plastic hand. She looks up\r\n          at Greer, changes the subject.\r\n\r\n                         PETERS\r\n          I found out about Strickland.\r\n          She gestures to the boxes of documents.\r\n\r\n                         PETERS (CONT'D)\r\n          All the chaos, I was able to waltz\r\n          right into the records department.\r\n\r\n                         (MORE)\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          80.\r\n\r\n                         CONTINUED: (3)\r\n\r\n                          PETERS (CONT'D)\r\n          The case files were removed, but\r\n          there was a paper trail from\r\n          payroll... Strickland was an\r\n          informant.\r\n\r\n                         GREER\r\n\r\n                         (PERKING UP)\r\n          For us? Who was running him?\r\n\r\n                         PETERS\r\n          Wasn't in the paperwork. But he\r\n          must've been selling intel on the\r\n          Prophet.\r\n          Greer has risen, moving restlessly around the room.\r\n\r\n                         GREER\r\n          So the Prophet has him killed. And\r\n          we have to assume he now has the\r\n          power to kill anyone he wants...\r\n\r\n                         CUT TO:\r\n\r\n                         - DAY\r\n\r\n          INT. MARINE BASE/COLONEL BRANDON'S OFFICE\r\n\r\n          CLOSE on a PHOTO of the DEVICE in Strickland's hand. The\r\n          image has been ENLARGED, giving a pretty clear view of\r\n          the weapon.\r\n\r\n                         BRANDON\r\n          Where'd you get this photo?\r\n          GREER sits opposite COLONEL BRANDON at the man's desk, a\r\n          FLAG and other MILITARY MEMORABILIA on display. Greer\r\n          eyes the colonel, knows something's up.\r\n\r\n                         GREER\r\n          It's from my memory. Damn thing\r\n          put me in the hospital.\r\n\r\n                         BRANDON\r\n          Wish I could help.\r\n\r\n                         GREER\r\n          Killed a couple of cops as well.\r\n          We believe this weapon-- the one\r\n          that doesn't exist-- is in the\r\n          hands of the Human Coalition.\r\n          Brandon is finally losing his composure.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          81.\r\n\r\n                         CONTINUED:\r\n\r\n                         BRANDON\r\n          If this is true... we're going to\r\n          have to do everything in our-power\r\n          to recover it. Do you have any\r\n          idea how serious this is?\r\n\r\n                         GREER\r\n          I was hoping you'd tell me.\r\n          BRANDON looks conflicted, finally opens up.\r\n\r\n                         BRANDON\r\n          This is absolutely off the record.\r\n          (off Greer's nod)\r\n          It's called an Overload Device, or\r\n          O.D. They're brand new, only a\r\n          handful exist. But I checked, ran\r\n          every serial number-- all accounted\r\n          for.\r\n\r\n                         GREER\r\n          Not this one. Maybe it never got\r\n          to you guys in the first place.\r\n          Who makes them?\r\n\r\n                         BRANDON\r\n          It's a DARPA design, subcontracted to\r\n          Pierson Defense. The idea was to\r\n          create a non-lethal weapon that could\r\n          disable every surrie in the field.\r\n          You beam a software virus straight to\r\n          the CPU. The fail-safes kick in and\r\n          the operators are cut off. Circuits\r\n          all melt down in seconds, you're left\r\n          with a field full of scrap.\r\n\r\n                         GREER\r\n          You win the battle with one shot.\r\n\r\n                         (BEAT)\r\n          Let me guess. You found a way\r\n          around the fail-safes.\r\n\r\n                         BRANDON\r\n\r\n                         (GRIM NOD)\r\n          Just a few lines of code, the\r\n          connection stays open. We tried it on\r\n          soldier volunteers... once. The virus\r\n          caused every neuron to fire at the\r\n          same time. Melted their brains.\r\n\r\n                         GREER\r\n          So it's an assassination tool.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          82.\r\n\r\n                         CONTINUED: (2)\r\n\r\n                          BRANDON\r\n           At the flick of a switch.\r\n\r\n                          CUT TO:\r\n\r\n          INT. BEAUTY SHOP - DAY\r\n\r\n          CLOSE on a WOMAN'S FACE being carefully peeled off the\r\n          MECHANICAL UNDERPINNINGS. FUNKY MUSIC plays.\r\n          WIDER, BRIDGET leans over the body, putting the old face\r\n          aside. A row of EXOTIC NEW FACES on a rack nearby.\r\n          Bridget begins manipulating the underlying musculature,\r\n          changing cheekbones, etc, using delicate TOOLS.\r\n\r\n                         BRIDGET\r\n          She wanted blue eyes the size of\r\n          golf balls, bee-sting lips and a\r\n          tiny ski-jump nose...\r\n\r\n                         MAGGIE\r\n          Boop-oop-a-doop.\r\n\r\n                         BRIDGET\r\n          Exactly.\r\n          Nearby, MAGGIE works on a brown-skinned HAND. She stares\r\n          through a mounted MAGNIFYING LOUPE, embedding tiny JEWELS\r\n          in the SKIN of the fingers. She uses TWEEZERS and a tiny\r\n          BLOWTORCH. After a moment, we realize the HAND has been\r\n          disconnected from the body, mounted on a brace.\r\n\r\n                         MAGGIE\r\n          You talked her down, I hope.\r\n\r\n                         BRIDGET\r\n          Yes, thank God, we're doing a\r\n          modified Audrey Hepburn.\r\n          MAGGIE glances over at Bridget's work admiringly.\r\n\r\n                         MAGGIE\r\n          I'd love you to raise my\r\n          cheekbones a half-inch, but Tom\r\n          would go ballistic.\r\n          THE DOOR CHIMES, Bridget looks up.\r\n\r\n                         BRIDGET\r\n          Speaking of the ball and chain...\r\n          As GREER approaches, a few of the BEAUTY ENGINEERS glance\r\n          up, then return to their business.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          83.\r\n\r\n                         CONTINUED:\r\n          This place is a cross between a beautician's and an auto\r\n          body repair shop. SURRIES in chairs that maneuver into\r\n          all kinds of positions. Not only are they having nails\r\n          and hair done, but legs lengthened, breasts enlarged,\r\n          etc. (Operators check in their bodies and leave them\r\n          there for modifications.)\r\n\r\n                         BRIDGET (CONT'D)\r\n          Hiya, Tom.\r\n\r\n                         MAGGIE\r\n          I didn't hear you come home last\r\n          night.\r\n\r\n                         GREER\r\n          Worked late. I'd really like to sit\r\n          down and talk with you.\r\n\r\n                         MAGGIE\r\n          I can take a break--\r\n\r\n                         GREER\r\n          No, Maggie, face to face. The two of\r\n          us, for real.\r\n          BRIDGET is getting uncomfortable.\r\n\r\n                         BRIDGET\r\n          These smile muscles need to set.\r\n          She exits with a look at Maggie. Maggie stops working\r\n          and turns to Greer, speaks passionately.\r\n\r\n                         MAGGIE\r\n          Tom, don't you get it? That body\r\n          in our apartment-- the one you\r\n          call real--- it isn't me. I'm\r\n          right here.\r\n\r\n                         GREER\r\n          Honey, if you're worried about the\r\n          way you look-- it doesn't matter,\r\n          it never did--\r\n\r\n                         MAGGIE\r\n          Exactly! What matters is who I\r\n          choose to be.\r\n          As the conversation gets more heated, co-workers\r\n          pointedly turn away, while eavesdropping.\r\n\r\n                         GREER\r\n          I married a person, you're\r\n          choosing to be a thing.\r\n\r\n                         (MORE)\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          84.\r\n\r\n                         CONTINUED: (2)\r\n\r\n                          GREER (CONT'D)\r\n          And I'm so sick of being\r\n          surrounded by things-- young,\r\n          beautiful things.\r\n\r\n                         MAGGIE\r\n          Well that's your problem, isn't\r\n          it. if you can be young and\r\n          beautiful and feel good all the\r\n          time-- why would anyone choose\r\n          anything else?\r\n\r\n                         GREER\r\n          Because it's bullshit. Because\r\n          we're human, like it or not.\r\n\r\n                         MAGGIE\r\n          Jesus, Tom. You sound like a\r\n          Dread.\r\n          Maggie turns back to what she was doing. Greer has\r\n          trouble swallowing his anger.\r\n\r\n                         GREER\r\n          I may just have to kick down your\r\n          bedroom door.\r\n\r\n                         MAGGIE\r\n          (not looking up)\r\n          I'd never forgive you.\r\n\r\n                         GREER\r\n          Then maybe I should just move out.\r\n\r\n                         MAGGIE\r\n          Do what you want...\r\n\r\n                         GREER\r\n\r\n                         (A BEAT)\r\n          That's a commercial.\r\n          Greer turns and exits. Maggie glances after him with a\r\n          mixture of anger and regret, then returns to her work.\r\n\r\n                         DISSOLVE TO:\r\n\r\n          EXT. CHEAP HOTEL - NIGHT\r\n\r\n          ESTABLISH a dreary place near the highway. A RED GLOW\r\n          from a number of windows... FIND A WINDOW illuminated by\r\n          WHITE LIGHT. We see GREER within.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          85.\r\n\r\n          -INT. CHEAP HOTEL ROOM - NIGHT\r\n\r\n          A bland room, a low-rent chain. GREER UNZIPS a SUITCASE,\r\n          opens it.\r\n          On the top is a WEDDING PHOTO of Maggie and Greer, much\r\n          younger.\r\n          He places this on the bedside table, moves for the\r\n          bathroom.\r\n\r\n          INT. HOTEL BATHROOM - NIGHT\r\n\r\n          GREER, in a TOWEL now, having finished a shower. He\r\n          wipes STEAM off the MIRROR and takes a hard look at\r\n          himself-- his worn face and battered, very human body.\r\n\r\n                         DISSOLVE TO:\r\n\r\n          INT. FBI BUILDING/GREER'S OFFICE - DAY\r\n\r\n          ON A COMPUTER SCREEN - American flags, the logo for\r\n          PIERSON DEFENSE. A corporate website.\r\n          PUSH CLOSE-- in tiny letters at the bottom of the screen:\r\n          \"A division of Virtual Self Industries.\"\r\n          GREER takes this in. He's at his computer, first thing\r\n          in the morning, with a cup of TAKE-OUT COFFEE. PETERS is\r\n          going through the box of documents we saw earlier. When\r\n          she glances toward him, he clears the screen.\r\n\r\n                         PETERS\r\n          What you working on?\r\n\r\n                         GREER\r\n          Just checking e-mail.\r\n\r\n                         PETERS\r\n          I think you hide things from me.\r\n\r\n                         GREER\r\n          Don't be ridiculous.\r\n          (takes a sip, winces)\r\n          This stuff is awful.\r\n          He'scalling up a new file--\r\n          ON SCREEN - the name \"LIONEL CANTER\" followed by the\r\n          words \"CLASSIFIED - SCAN REQUIRED.\" A moment later, we\r\n          see GREER'S IMAGE, a LIGHT FLICKERS from the webcam on\r\n          the MONITOR FRAME. Then the words \"UNAUTHORIZED USER.\"\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          86.\r\n\r\n                         CONTINUED:\r\n          GREER sits back, frustrated.\r\n\r\n                         PETERS\r\n          What does AOS stand for? I keep\r\n          coming across it on these\r\n          invoices. \"Advance On Salary?\"\r\n          Greer thinks- a moment of revelation. He moves to look\r\n          over Peters' shoulder.\r\n\r\n                         GREER\r\n          What do you suppose VSI has\r\n          against Canter?\r\n\r\n                         PETERS\r\n          Against him? He's one of them.\r\n\r\n                         (CONSIDERING IT)\r\n          'Course, since he owns the patents\r\n          on surrogate technology, they must\r\n          have to pay him billions.\r\n\r\n                         GREER\r\n          (shakes his head)\r\n          He dies, they still have to pay\r\n          his estate.\r\n\r\n                         PETERS\r\n          Wait a minute. You think VSI\r\n          hired Strickland to kill Canter?\r\n\r\n                         GREER\r\n          There was a middleman.\r\n          As he moves for the door, he points at her paperwork.\r\n\r\n                         GREER (CONT'D)\r\n          To authorize informant payments,\r\n          agent in charge has to initial...\r\n          As he exits, Peters looks back down at the documents.\r\n          The scrawled initials \"AOS\" on an INVOICE.\r\n\r\n                         CUT TO:\r\n\r\n          INT. FBI BUILDING/BULLPEN - DAY\r\n\r\n          CLOSE ON A NAMEPLATE outside a door, the words \"ANDREW 0.\r\n\r\n          STONE, DIRECTOR SURROGATE CRIME DIVISION.\"\r\n          GREER approaches the open door, moving through a HUBBUB\r\n          of AGENTS working in open cubicles. AGENT NAKATA sits at\r\n          a desk by Stone's door.\r\n\r\n          (,CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          87.\r\n\r\n                         CONTINUED:\r\n\r\n                         NAKATA -\r\n          Hey, Tom. Thought you were on leave.\r\n\r\n                         GREER\r\n          Just cleaning out my desk.\r\n          A moment later, STONE pokes his head out.\r\n\r\n                         STONE\r\n          Greer! You've been cleaning out\r\n          your desk for two days. You should\r\n          be home recuperating.\r\n\r\n                         GREER\r\n          Just about done, sir.\r\n          Greer starts to move away, turns back.\r\n\r\n                         GREER (CONT'D)\r\n          I almost forgot. Victor Welch\r\n          sends his regards.\r\n          Stone shakes his head, feigning incomprehension:\r\n\r\n                         STONE\r\n          I'm sorry?\r\n\r\n                         GREER\r\n          Guy at VSI. You looking forward\r\n          to moving to the private sector--?\r\n          Nakata is listening curiously. Stone angrily gestures\r\n          for Greer to come into his office, he doesn't want to\r\n          have this conversation in public. Greer keeps speaking\r\n          as he heads inside.\r\n\r\n                         GREER (CONT'D)\r\n          Will you finish out the year? We're\r\n          sure gonna miss you around here...\r\n          STONE SLAMS the door.\r\n\r\n          INT. FBI BUILDING/STONE'S OFFICE - DAY\r\n\r\n          Greer keeps speaking calmly, as if there were no tension\r\n          in the air.\r\n\r\n                         GREER\r\n          I know it's hard to resist, better\r\n          hours, better pay--\r\n\r\n                         STONE\r\n          Welch told you about this?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          88.\r\n\r\n                         CONTINUED:\r\n\r\n                         GREER\r\n          (beat, grins)\r\n          No. I was just fishing.\r\n\r\n                         STONE\r\n          You've suffered brain damage, Greer.\r\n          Let's hope it isn't permanent.\r\n\r\n                         GREER\r\n\r\n                         (GRIN FADING)\r\n          All surveillance on the Prophet goes\r\n          through this office. Jack\r\n          Strickland was one of your stoolies.\r\n          Why the hell didn't you say\r\n          something?\r\n          STONE just stares at him, narrowing his eyes.\r\n\r\n                         GREER (CONT'D)\r\n          Two cops died. You knew he had the\r\n\r\n          0. D.--\r\n\r\n                         STONE\r\n          I have no idea what you're talking\r\n\r\n                         ABOUT--\r\n\r\n                         GREER\r\n          --because you gave it to him.\r\n          VSI makes them-- they hand one to\r\n          you-- and you chose the trigger\r\n          man. Your own little black op.\r\n          If anyone looks, they blame the\r\n          Dreads. But Strickland didn't\r\n          follow the plan, did he? He\r\n          didn't give you back the 0. D.\r\n          like he was supposed to.\r\n\r\n                         STONE\r\n          Are you done with this paranoid\r\n          fantasy--?\r\n\r\n                         GREER\r\n          Not quite. What I can't figure out\r\n          is why. Why kill Canter?\r\n          STONE stares at Greer, angry and defiant. He moves to\r\n          his desk, types into his COMPUTER. Greer approaches\r\n          slowly.\r\n\r\n                         STONE\r\n          I'm issuing orders for your\r\n          detention. Your mind isn't right,\r\n          you've become a threat to national\r\n          security.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          89.\r\n\r\n                         CONTINUED: (2)\r\n          Greer slips a LETTER OPENER off of Stone's desk as he\r\n          nears. His hand is SHAKING. Suddenly--\r\n          --STONE yanks open a DRAWER and lunges for a GUN. But\r\n          before he can bring it to bear--\r\n          --GREER STABS him in the back of the head, SKEWERING\r\n          STONE'S CPU. STONE FREEZES, hunched over his desk, gun\r\n          in hand. Greer just stares at what he's done for a\r\n          moment, amazed. Then he waves a hand in front of Stone's\r\n          open eyes, makes sure he's out, and--\r\n          --carefully pries off a plate and removes STONE'S\r\n          MOTHERBOARD, places it on the desk.\r\n          GREER pulls the gun out of Stone's hand, rolls him back\r\n          in front of his desk, propped up to face the computer.\r\n          Greer crouches behind him, operating the keyboard by\r\n          reaching around his boss' body.\r\n          ON COMPUTER - Greer types in a request for a FILE on\r\n          LIONEL CANTER. The words \"CLASSIFIED - IDENTITY SCAN\r\n          REQUIRED\" appear.\r\n          GREER pushes the chair a bit closer to the computer,\r\n          ducking down, lifts Stone's head by the hair.\r\n          The monitor momentarily displays STONE'S FACE. A LIGHT\r\n          goes on in the corner of the FRAME, scanning Stone.\r\n          \"AUTHORIZED USER\" appears.\r\n          GREER peeks up again, continuing his work.\r\n          ON SCREEN - a HEADSHOT OF CANTER, reams of CLASSIFIED\r\n          INFO. Greer hits PRINT.\r\n\r\n          INT. FBI BUILDING/BULLPEN - DAY\r\n\r\n          GREER emerges, a stack of PAPERS in his hand. He gives a\r\n          nod to NAKATA, who nods back as he answers his RINGING\r\n          PHONE. Before he can even say a word:\r\n\r\n                         STONE (FILTER)\r\n          This is Stone!\r\n          Nakata looks toward the office, starting to rise.\r\n\r\n                         NAKATA\r\n          What do you need, sir?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          90.\r\n\r\n          INT. STONE'S STUDY - DAY\r\n\r\n          Upscale. The REAL STONE, a good deal heavier than his\r\n          surrogate, is sitting in boxer shorts at the edge of his\r\n          STIM CHAIR, a phone in his hand.\r\n\r\n                         STONE\r\n          Sonofabitch Greer disabled my\r\n          surrie, stop him!\r\n\r\n          INT. FBI BUILDING/STAIRWELL - DAY\r\n\r\n          GREER takes a couple steps at a time. He's on his phone.\r\n\r\n                         GREER\r\n          Just meet me in the garage-- leave\r\n          the trunk open!\r\n          As he rounds a corner, he comes face to face with--\r\n          --a pair of AGENTS, each carrying a HANDGUN. They\r\n          approach from below.\r\n\r\n                         AGENT #1\r\n          Tom, we don't want to hurt you.\r\n          Greer nods and raises his hands, resigned-- he still\r\n          clutches the papers. As Agent #1 nears, Greer suddenly--\r\n          --PLANTS a FOOT in the man's chest, sending him crashing\r\n          into AGENT #2. Both men topple down the stairs, FIRE\r\n          their guns wildly.\r\n          Greer has also lost his balance and dropped some papers,\r\n          which he has to scoop up as he claws for the. doorway and\r\n          dashes through.\r\n\r\n          INT. FBI BUILDING/PARKING GARAGE - DAY\r\n\r\n          PETERS waits near an IDLING SEDAN, the TRUNK OPEN. Greer\r\n          dives inside, she SLAMS it and gets behind the wheel.\r\n          She PEELS out, going up a few levels.\r\n          AT AN EXIT GATE - an FBI GUARD looks inside.\r\n\r\n                         FBI GUARD\r\n          They're looking for Tom Greer.\r\n          You seen him?\r\n          She shakes her head, he presses a button to open the gate\r\n          and waves her through.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          91.\r\n\r\n          EXT. PARK - DAY\r\n\r\n          THE FBI SEDAN drives down a curving, forested road.\r\n\r\n          INT. FBI CAR - DAY\r\n\r\n          PETERS drives, GREER in the passenger seat, poring over\r\n          the papers.\r\n\r\n                         GREER\r\n          Ever hear of the Human Defense League?\r\n\r\n                         PETERS\r\n          Sure, the extremist wing of the\r\n          anti-surrogate movement.\r\n\r\n                         GREER\r\n          According to this, their number one\r\n          supporter is Lionel Canter.\r\n\r\n                         PETERS\r\n          What? The father of surrogacy?\r\n          Impossible.\r\n\r\n                         GREER\r\n          Says he's funneled billions into\r\n          their organization. Not to\r\n          mention direct support for the man\r\n          who calls himself the Prophet.\r\n          Canter's bought him land,\r\n          lawyers... and enough weapons to\r\n          start a war.\r\n\r\n          EXT. RESERVATION NO MAN'S LAND - DAY\r\n\r\n          THE DREADS emerge from tents and shacks at the sound of a\r\n          nearby RUMBLING.\r\n          ANGLE THROUGH FENCE - BULLDOZERS, TANKS, uniformed\r\n          NATIONAL GUARDSMEN (all surrogates with the SAME FACE)\r\n          are assembling on the perimeter of the Dread reservation.\r\n          They carry non-lethal TASER WANDS and RIFLES.\r\n          An OFFICER moves to the front, carrying a WALKIE-TALKIE.\r\n          In response to a command, he turns and signals to the\r\n          troops behind him and--\r\n          --the BULLDOZERS start PLOWING DOWN the fence. As\r\n          Guardsmen move past him, the officer calls out:\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          92.\r\n\r\n                         CONTINUED:\r\n\r\n                         OFFICER\r\n          We all know what we're looking\r\n          for! Remember these are\r\n          biologicals, do not fire unless\r\n          absolutely necessary!\r\n\r\n          INT. CHEAP HOTEL ROOM - DAY\r\n\r\n          PAPERWORK spread on a table before PETERS.\r\n\r\n                         PETERS\r\n          Swiss accounts, anonymous wire\r\n          transfers, unattributed testimony--\r\n          this isn't proof.\r\n          WIDER - GREER lies in his clothes on the bed, bone tired,\r\n          a flat-screen TV plays silently.\r\n\r\n                         GREER\r\n          Not enough for a courtroom. But\r\n          VSI knew that if Lionel Canter\r\n          suffered a mysterious brain\r\n          hemmorhage, the powers that be\r\n          wouldn't be terribly upset.\r\n\r\n                         PETERS\r\n          He's not some kind of monster, you\r\n          know. Canter's initial research\r\n          was in prosthetics-- for amputees,\r\n          quadriplegics... people with\r\n          degenerative diseases. Maybe he\r\n          feels his technology's been\r\n          perverted. Maybe it has.\r\n          GREER studies her with interest, her tone is strangely\r\n          passionate.\r\n\r\n                         GREER\r\n          I had no idea you were such a\r\n          humanist.\r\n          PETERS looks away-- then reacts to something on TV, grabs\r\n          a remote and turns UP THE VOLUME.\r\n          ON TV SCREEN - HAND-HELD footage as NATIONAL GUARD TROOPS\r\n          move across the Dread Reservation No Man's Land, using\r\n          TASER WANDS to subdue resisting DREADS, frisking them and\r\n          rifling through possessions as they upend dwellings.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          93.\r\n\r\n                         CONTINUED:\r\n\r\n                         ANCHOR\r\n          --units of the Maryland National\r\n          Guard moved into the East Baltimore\r\n          Human Reservation this morning, in a\r\n          search for contraband weapons...\r\n          GREER knows what this is about.\r\n\r\n                         GREER\r\n          Colonel Brandon didn't waste any\r\n          time.\r\n\r\n                         PETERS\r\n          They're looking for the 0. D.\r\n\r\n                         GREER\r\n          The what?\r\n\r\n                         PETERS\r\n\r\n                         (A BEAT)\r\n          Isn't that what you called it?\r\n          What does it stand for again?\r\n\r\n                         GREER\r\n          Overload Device.\r\n          She nods and turns nonchalantly back to the paperwork.\r\n          As she does so, GREER cocks his head and studies her.\r\n          Protecting Brand's confidence, he never told her what the\r\n          device was called.\r\n\r\n                         PETERS\r\n          So what do we do about Stone?\r\n\r\n                         GREER\r\n          I call and tell him I'll take\r\n          early retirement with full pension\r\n          benefits. In return for keeping\r\n          his little secret.\r\n\r\n                         PETERS\r\n          That isn't funny.\r\n\r\n                         GREER\r\n          I'm not laughing.\r\n\r\n                         PETERS\r\n\r\n                         (RISES)\r\n          I don't believe you-- they killed\r\n          Canter's son, a college kid, his\r\n          whole life ahead of him! Don't we\r\n          owe him something?\r\n          She's genuinely upset. Greer won't meet her eye.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          94.\r\n\r\n                         CONTINUED: (2)\r\n\r\n                         GREER\r\n          Can't bring him back.\r\n\r\n                         PETERS\r\n\r\n                         (ENRAGED)\r\n          They will come after Canter again--\r\n          but you're just going to deposit\r\n          your pension checks, look the\r\n          other way and let him die.\r\n\r\n                         GREER\r\n          (looks at her)\r\n          Maybe he's got it coming.\r\n\r\n                         PETERS\r\n\r\n                         (BETRAYED)\r\n          I thought you were a cop. I\r\n          thought you were a human being.\r\n          PETERS marches out of there and slams the door on the way\r\n          out. GREER waits a few moments, his mind racing-- then\r\n          he moves for the door himself.\r\n\r\n          INT. RENTAL AGENCY - DAY\r\n\r\n          GREER moves from a desk with a pretty RENTAL AGENT,\r\n          working at a small hand-held COMPUTER. LOGOS for GLOBAL\r\n\r\n          SYNTH RENTALS.\r\n\r\n                         RENTAL AGENT\r\n          Our nearest rental office is just\r\n          outside Denver, the car and phone\r\n          will be extra--\r\n\r\n                         GREER\r\n          I'm only gonna be there a couple\r\n          hours.\r\n          She leads him toward a curtained BOOTH, one of many here.\r\n          RED GLOWS emanate from a few.\r\n\r\n                         RENTAL AGENT\r\n          Do you want to customize--?\r\n\r\n                         GREER\r\n          Generic's fine.\r\n          She pulls back a CURTAIN to reveal a STIM-CHAIR and a\r\n\r\n          SENSORY PROJECTOR.\r\n\r\n                         CUT TO:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          95.\r\n\r\n          INT. RESERVATION TEMPLE -- DAY\r\n\r\n          THE PROPHET stands with a MIC before a LARGE CROWD packed\r\n          into the place, sounds of CHAOS from outside. GUARDSMEN\r\n          are moving into the temple, methodically searching those\r\n          inside. -\r\n\r\n                         PROPHET\r\n          Have no fear, the day of\r\n          resurrection is at hand!\r\n          A team of GUARDSMEN move to surround the Prophet, his\r\n          BODYGUARDS struggle with them.\r\n\r\n                         PROPHET (CONT'D)\r\n          No! Do not resist! The\r\n          oppressors shall soon fall, never\r\n          to rise again...\r\n          Ignoring him, some bodyguards pull HANDGUNS and FIRE on\r\n          the SURROGATE GUARDSMEN, who immediately RETURN FIRE with\r\n          automatic weapons. BUD and MILLER, the Prophet's right\r\n          hand men, both take bullets and go down.\r\n          THE PROPHET manages to escape out a side exit during this\r\n          gunfire-- but a stray BULLET catches him in the back as\r\n          he flees.\r\n\r\n          EXT. RESERVATION TEMPLE - DAY\r\n\r\n          As he runs from the building, the PROPHET is TACKLED by a\r\n          GUARDSMAN. He turns the man over, the Prophet's eyes are\r\n          empty, his head lolls back.\r\n          A BLOOD-CURDLING SCREAM from nearby as a YOUNG FEMALE\r\n          DREAD takes this in.\r\n\r\n                         YOUNG DREAD\r\n          They've killed him! They've\r\n          killed the Prophet!\r\n          Other DREADS nearby react, the CRY spreading.\r\n          WITH THE GUARDSMAN, examining the body. The Prophet is\r\n          already rigid... and GREEN COOLANT is spreading from an\r\n          exit wound in his chest. A guardsman rips open his\r\n          shirt, pokes at the wound--\r\n          ELECTRONICS and TORN PLASTIC.\r\n          THE GUARDSMAN's amazed, gets on his WALKIE-TALKIE.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          96.\r\n\r\n                         CONTINUED:\r\n\r\n                         GUARDSMAN\r\n          Captain, you'd better come see this.\r\n          Nearby Guardsmen react to the furious DREADS massing\r\n          around them. A GRENADE LANDS nearby, GUARDSMAN #2 throws\r\n          himself on it, his SURRIE BLOWS UP. GUNFIRE ERUPTS\r\n          nearby, a MOLOTOV COCKTAIL sails through the air.\r\n\r\n                         GUARDSMAN #3\r\n          We need to clear out!\r\n\r\n                         CUT TO:\r\n\r\n          EXT. MOUNTAIN ROAD - DAY\r\n\r\n          Late in the afternoon. Rolling green hills, trees, a\r\n          rural area. A white COMPACT CAR pulls up a dirt road,\r\n          past the MAILBOX with \"PETERS\" painted on it.\r\n\r\n          EXT. PETERS' HOUSE - DAY\r\n\r\n          THE COMPACT pulls to a stop.\r\n          GENERIC/GREER climbs out of the car. He's blandly\r\n          handsome, in a business suit, with perfect hair that\r\n          looks glued in place. His movements are stilted, this is\r\n          a cheap model and he's not used to it.\r\n          GENERIC/GREER steps onto the porch, knocks on the door.\r\n          No answer. He tries the knob-- locked.\r\n\r\n          INT. RENTAL AGENCY/BOOTH - DAY\r\n\r\n          MATCH-CUT POV of PETERS' DOOR on a SENSORY PROJECTOR\r\n\r\n          SCREEN.\r\n          REAL GREER in a rental stim-chair, bathed in RED LIGHT.\r\n          His face twitches slightly, as if having a bad dream.\r\n\r\n          EXT. PETERS' HOUSE - DAY\r\n\r\n          His voice is deep, again generic.\r\n\r\n                         GENERIC/GREER\r\n          Peters! It's me, Tom Greer!\r\n          He moves along the side of the house, peers in a window--\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          97.\r\n\r\n                         CONTINUED:\r\n          ANGLE THROUGH WINDOW - a STIM-CHAIR sits empty. Dangling\r\n          wires, the SENSORY PROJECTOR and HARD DRIVE have been\r\n          stolen.\r\n          GENERIC/GREER SMASHES the window with his fist and climbs\r\n          inside.\r\n\r\n          INT. PETERS' HOUSE - DAY\r\n\r\n          GENERIC/GREER moves quickly through the house--\r\n\r\n                         GENERIC/GREER\r\n          Peters! Are you here?!\r\n          He tries a couple of DOORS, finds a LOCKED one, turns the\r\n          latch-- steps leading to the basement.\r\n\r\n          INT. PETERS' BASEMENT - DAY\r\n\r\n          GENERIC/GREER flips a LIGHT SWITCH at the top of the\r\n          stairs, BARE BULBS come on--\r\n          ANGLE DOWN-- THE REAL PETERS lies at the base of the\r\n          stairs, in her stained, torn nightgown, motionless. A\r\n          pool of BLOOD from her head... her neck is twisted at a\r\n          strange angle.\r\n\r\n          INT. RENTAL AGENCY/BOOTH - DAY\r\n\r\n          GREER winces with the shock of this.\r\n\r\n          INT. PETERS' BASEMENT - DAY\r\n\r\n          GENERIC/GREER hurries down the stairs to REAL PETERS.\r\n\r\n                         GENERIC/GREER\r\n          Oh my God, Jennifer--\r\n          He can see her neck is broken, he can't move her. Her\r\n          eyes are closed, lips parched, hair matted with blood\r\n          from a gash in her scalp. Generic/Greer leans close,\r\n          takes her pulse.\r\n          Suddenly her eyes open. She speaks with difficulty.\r\n\r\n                         REAL PETERS\r\n          Who are you?\r\n\r\n                         GENERIC/GREER\r\n          Tom Greer. Your partner.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          98.\r\n\r\n                         CONTINUED:\r\n\r\n                         REAL PETERS-\r\n          Greer...?\r\n\r\n                         GENERIC/GREER\r\n          There wasn't time, I rented a\r\n\r\n                         GENERIC\r\n\r\n                         REAL PETERS\r\n          How do I know--? Prove you're Greer.\r\n          He's already dialing 9-1-1 on a CELLPHONE.\r\n\r\n                         GENERIC/GREER\r\n          You can't stand me, I'm old\r\n          school, seat-of-the pants--\r\n          (connects, ON PHONE)\r\n\r\n                         319\r\n          Yes, I need an ambulance at\r\n          Mountainview, there's a woman, I\r\n          think her neck is broken--\r\n\r\n                         (TO PETERS)\r\n          How long have you been down here?\r\n\r\n                         REAL PETERS\r\n          Three days I think...\r\n\r\n                         GENERIC/GREER\r\n\r\n                         (INTO PHONE)\r\n          Please, hurry...\r\n\r\n                         (HANGS UP)\r\n          They're on the way. Somebody's been\r\n          using your surrogate.\r\n\r\n                         REAL PETERS\r\n          What?\r\n\r\n                         GENERIC/GREER\r\n          You-- it's been showing up to work\r\n          every day.\r\n\r\n                         REAL PETERS\r\n          No, I-- the night your chopper went\r\n          down... I woke up and somebody was\r\n          here... I fought with him, but he\r\n          was so strong--\r\n\r\n                         WIPES\r\n          Peters is getting distraught. Generic/Greer gently\r\n          her brow.\r\n\r\n                         GENERIC/GREER\r\n          Ssh, relax --\r\n\r\n                         REAL PETERS\r\n          He tried to bring me down here, we\r\n          fell...\r\n\r\n                         (MORE)\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          99.\r\n\r\n                         CONTINUED: (2)\r\n\r\n           REAL PETERS (CONT'D)\r\n          He took my memory-- the whole\r\n          investigation. He said he was\r\n          going to do my job for me.\r\n          A beat. Their eyes meet as the realization hits\r\n          Generic/Greer.\r\n\r\n                         GENERIC/GREER\r\n          (under his breath)\r\n          Canter.\r\n\r\n                         REAL PETERS\r\n          It has to be... oh God, I'm so cold...\r\n          She clearly had been fighting to stay alive, just to tell\r\n          someone what happened.\r\n\r\n          REAL PETERS (CONT'D)\r\n          Would've been nice to meet you in\r\n          person...\r\n          She now closes her eyes. Greer agonizes.\r\n\r\n                         GENERIC/GREER\r\n          Peters, hang on, please-- it won't\r\n          be long...\r\n          He rises, finds an old blanket to put around her.\r\n\r\n                         REAL PETERS\r\n          Thirsty...\r\n\r\n          INT. PETERS' KITCHEN - NIGHT\r\n\r\n          GENERIC/GREER quickly fills a glass of water from the\r\n          tap. He hears SIRENS in the distance as he hurries back\r\n          into the basement.\r\n\r\n          INT. PETERS' BASEMENT - NIGHT\r\n\r\n          GENERIC/GREER kneels down to dribble water on REAL\r\n          PETERS' partially open lips. We hear a VEHICLE ARRIVE\r\n          outside.\r\n\r\n                         GENERIC/GREER\r\n          They'll be here in just a minute...\r\n          No response. He brushes her hair back from her face--\r\n          REAL PETERS' eyes are half-open, vacant. She's dead.\r\n          GENERIC/GREER lets out an anguished CRY.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          100.\r\n\r\n                         CONTINUED:\r\n          ANGLE UP STAIRS - SURRIE PARAMEDICS rush down with a\r\n          STRETCHER. They take in the sight of--\r\n          TWO MOTIONLESS BODIES. PETERS, dead... and l ass lass\r\n          GENERIC/GREER, kneeling over her body, head bowed, g\r\n          still in hand-- checked out.\r\n\r\n                         CUT TO:\r\n\r\n          TNT. RENTAL AGENCY - DAY\r\n          REAL GREER comes out of the curtained booth in a hurry,\r\n          moving for the door. He's talking on the phone.\r\n\r\n                         GREER\r\n          Who's on duty in surveillance--?\r\n          Sanders, great, put me through--\r\n          He's pursued by the RENTAL AGENT.\r\n\r\n                         RENTAL AGENT\r\n          Sir, sir, sir-- you haven't\r\n          returned your unit--\r\n          Greer ignores the woman, he's out of there. She calls\r\n          after him angrily.\r\n\r\n          RENTAL AGENT (CONT'D)\r\n          You signed a contract!\r\n\r\n          EXT. WASHINGTON STREET - DAY\r\n\r\n          A handful of DREADS are storming down the street,\r\n          SMASHING WINDOWS and bowling over any SURRIES who get in\r\n          their way.\r\n          A SCROLLING ELECTRONIC NEWS CRAWL on the side of a\r\n          building: \"PROPHET SHOT, REPORTED DEAD...\"\r\n          GREER is walking fast, on the phone, steering clear of\r\n          the angry Dreads.\r\n\r\n                         GREER\r\n          It's an emergency, you need to\r\n          connect me now!\r\n\r\n          INT. FBI BUILDING/SURVEILLANCE CENTER - DAY\r\n\r\n          TIGHT ON BOBBY, the overweight controller, at his\r\n          station. He looks nervous, wearing his HEADSET.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          101.\r\n\r\n                         CONTINUED:\r\n          Responding to a subtle BEEP in his ear,-he makes as if to\r\n          scratch himself, opening the connection. We hear GREER'S\r\n\r\n                         FILTERED VOICE:\r\n\r\n                         GREER (FILTER)\r\n          Bobby, it's Greer, I need a remote\r\n          shutdown. You'll have the\r\n          surrie's digital address on file,\r\n          Agent Jennifer Peters.\r\n          CAMERA MOVES to reveal that PETERS (the surrie) is\r\n          holding BOBBY at GUNPOINT, a grim expression on her face.\r\n          She doesn't realize Bobby's on the phone.\r\n\r\n          GREER (FILTER) (CONT'D)\r\n          Hello? Bobby, are you there?\r\n          Bobby looks toward the special TERMINAL that displays the\r\n          surrie serial numbers. NUMBERS are cranking through\r\n          fast, ALL HIGHLIGHTING. Bobby looks at Peters, but\r\n          speaks for Greer's benefit.\r\n\r\n                         BOBBY\r\n          Peters, have you gone insane?\r\n          Put the gun away, what the hell\r\n          are you trying to prove?\r\n          PETERS ignores him, watching the TERMINAL SCREEN.\r\n          WIDER now, we see that all the SURRIE WATCHERS have\r\n          disconnected, they're stationary on their tracks. THE\r\n          GLOWING MONITORS remain on, showing random scenes,\r\n          unwatched. MOVEMENT at the elevated entrance--\r\n          --PETERS spins and FIRES HER HANDGUN in that direction.\r\n          The intruder retreats. We now see a couple of SURRIES\r\n          have already been dropped here, sprawled on the staircase\r\n          leading down, bullets in their heads.\r\n          PETERS spins on Bobby, who's WHISPERING frantically into\r\n\r\n                         HIS HEADSET:\r\n\r\n                         BOBBY (CONT'D)\r\n          She's into the entire surrie\r\n          database, I dunno what she's--\r\n          Peters YANKS off Bobby's headset and throws it aside.\r\n\r\n          EXT. WASHINGTON STREET - DAY\r\n\r\n          GREER has stopped, stunned. Then, realizing what's\r\n          happening, he takes off at a sprint in a different\r\n          direction. He makes another call:\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          102.\r\n\r\n                         CONTINUED:\r\n\r\n          GREER (ON PHONE)\r\n          Maggie, please pick up-- damn it,\r\n          you have to disconnect as soon as\r\n          you get this message-- get off\r\n          line, abandon your surrogate!\r\n          You're in danger, everyone is--\r\n\r\n          INT. MAGGIE'S SHOP - DAY\r\n\r\n          MAGGIE is hard at work, HOT-GLUING a new head of STREAKED\r\n          HAIR around the motionless face of a BEAUTIFUL SURROGATE.\r\n          She glances at a small CELLPHONE, sitting on a WORK TRAY\r\n          nearby. It FLASHES--\r\n          CLOSE - \"THOMAS GREER\" scrolls on the CELLPHONE READOUT.\r\n          MAGGIE wants to pick up, but both hands are occupied.\r\n          She sighs, returns to her work.\r\n\r\n          INT. FBI BUILDING/CORRIDOR - DAY\r\n\r\n          A group of AGENTS in RIOT GEAR are gathered here, WEAPONS\r\n          ready. One turns to see--\r\n          STONE approaching (his surrie is operational again),\r\n          flanked by a couple of other AGENTS.\r\n\r\n                         RIOT AGENT\r\n          She'll only speak with you, sir.\r\n\r\n                         STONE\r\n          Why the hell don't you just move\r\n          in and take her down?\r\n\r\n                         RIOT AGENT\r\n          She's got a human hostage.\r\n          Stone pauses, takes a breath.\r\n\r\n                         STONE\r\n          That fat ass Sanders.\r\n          He self-consciously rubs the back of his head, where we\r\n          now see ELECTRICAL TAPE holding shut the damaged latch.\r\n\r\n          INT. LUXURY BUILDING/LOBBY - DAY\r\n\r\n          GREER, face red, out of breath, is displaying his badge\r\n          to the CLERK, who checks his computer.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          103.\r\n\r\n                         CONTINUED:\r\n\r\n                         CLERK\r\n          I'm sorry, you're not on his list.\r\n\r\n                         GREER\r\n          I wouldn't be. I'm here to arrest him.\r\n          ARMANDO moves closer at this.\r\n\r\n                         CLERK\r\n          I see... do you have a warrant?\r\n\r\n                         GREER\r\n          Listen to me. Dr. Canter is\r\n          committing a crime via surrogate--\r\n          right now. If you don't cooperate\r\n          and let me up there, you become an\r\n          accomplice.\r\n\r\n                         CLERK\r\n          Without a warrant, I'm afraid I\r\n          can't help you.\r\n          ARMANDO takes Greer by the arm in a painful grip.\r\n\r\n                         ARMANDO\r\n          You're gonna have to leave, sir.\r\n          Armando escorts Greer none too gently to the door.\r\n\r\n                         GREER\r\n          Ow! Easy, I'm only human.\r\n          As Armando relaxes his grip a bit, GREER flexes his left\r\n          arm-- then gasps and clutches his chest, as if having a\r\n          coronary. He stumbles, falls to his knees. Armando\r\n          bends over him--\r\n\r\n                         ARMANDO\r\n          Are you OK?\r\n          Greer suddenly thrusts his hand beneath the man's jacket.\r\n          Armando reacts, begins to struggle with Greer-- BANG BANG\r\n          beneath his suitcoat.\r\n          Armando's ARM SPASMS WILDLY. He takes a few steps back,\r\n          SPARKS and HYDRAULIC FLUID coming from his chest. GREER\r\n          is holding the man's GUN now, aimed at him.\r\n\r\n                         ARMANDO (CONT'D)\r\n          You asshole. I just made the last\r\n          payment.\r\n          GREER rises and hurries to the CLERK, points the gun at\r\n          his head.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          104.\r\n\r\n                         CONTINUED: (2)\r\n\r\n                         GREER\r\n          The elevator key!\r\n\r\n                         CLERK\r\n          I'm calling the police.\r\n          The CLERK goes stock still, he's checked out-- he's\r\n          obviously making the call from home. Greer shoves the\r\n          inert body aside, it falls flat. He reaches for the\r\n          elevator key, snatches it up when--\r\n          ARMANDO wraps his one good arm around Greer's throat from\r\n          behind, choking him. They stagger backward, GREER aims\r\n          the gun behind his head and FIRES, blowing a HOLE in\r\n          Armando's forehead. GREEN COOLANT, FRIED ELECTRONICS fly\r\n          from the exit wound.\r\n          They topple to the ground together. GREER struggles from\r\n          the frozen surrie's grip, clutching his ear, deafened by\r\n          the gun's loud report.\r\n          As Greer gets to his feet, the DOORMAN enters, takes in\r\n          the tableau-- the gun-wielding man, the two surries on\r\n          the ground-- and dashes outside again.\r\n          GREER hurries for CANTER'S PRIVATE ELEVATOR. He turns\r\n          the key-- no light, nothing. He makes a frustrated NOISE\r\n          and dashes for a nearby door to the stairwell.\r\n\r\n          INT. FBI BUILDING/SURVEILLANCE CENTER - DAY\r\n\r\n          STONE enters warily, looking toward PETERS and the\r\n          captive BOBBY.\r\n\r\n                         STONE\r\n          Peters! It's me, Andy Stone!\r\n          Hands in the air, Stone moves down the stairs, stepping\r\n          gingerly over the fallen surrogates.\r\n          PETERS finishes CUFFING BOBBY'S WRISTS to a chair with\r\n          plastic cuffs. She moves to get a look at Stone, across\r\n          the expanse of glowing monitors. She's holstered her\r\n          gun.\r\n\r\n                         PETERS\r\n          Who was it, Stone? Who was it at\r\n          VSI that hired you to kill me?\r\n          Stone blinks, trying to process this.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          105.\r\n\r\n                         CONTINUED:\r\n\r\n                         PETERS (CONT'D)\r\n          Did you feel even a second of\r\n          remorse, when you found out you'd\r\n          murdered an innocent boy. He was\r\n          eighteen!\r\n\r\n                         STONE\r\n          I don't believe it...\r\n\r\n                         PETERS\r\n          Just tell me what I need to know.\r\n          Stone considers this a bit, smiles.\r\n\r\n                         STONE\r\n          We spend years trying to nail you\r\n          for funding the Dreads-- and now\r\n          you hand yourself over to us on a\r\n          silver platter. Hijacking an\r\n          agent, destroying federal\r\n          property, creating a hostage\r\n          situation...\r\n          Peters pulls her gun and points it at BOBBY'S HEAD. He\r\n          cowers in his chair.\r\n\r\n                         STONE (CONT'D)\r\n          I wouldn't add homicide to that\r\n          list. As it is, you're going to\r\n          prison for a very long time.\r\n          He turns on his heel, begins walking back up the stairs\r\n          for the door.\r\n          PETERS lowers the gun, reaches into her pocket and pulls\r\n          out the Q.D. WEAPON.\r\n\r\n                         PETERS\r\n          An eye for an eye...\r\n          She points it at the back of Stone's head and--\r\n          --STONE's eyes go wide in agony-- and EXPLODE. He goes\r\n          TUMBLING back down the stairs, SMOKE pouring from his\r\n          head, BODY twitching crazily.\r\n\r\n          INT. LUXURY BUILDING/STAIRWELL - DAY\r\n\r\n          --GREER is GASPING for breath as he reaches an upper\r\n          landing. Ahead of him is a heavy STEEL DOOR with a\r\n          KEYPAD LOCK. He tries the handle, kicks the door once,\r\n          then pulls his gun and aims it at the lock, turning away\r\n          as he SHOOTS.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          106.\r\n\r\n                         CONTINUED:\r\n          THE BULLET RICOCHETS about the narrow area, scaring the\r\n          hell out of him. The LOCK is intact.\r\n\r\n                         GREER\r\n          Damn it!\r\n          He moves to a NARROWER STAIRCASE with a sign, \"ROOF\r\n\r\n          ACCESS.\"\r\n\r\n          INT. FBI BUILDING/SURVEILLANCE CENTER - DAY\r\n\r\n          The RIOT AGENTS pour in now, GUNS FIRING.\r\n          PETERS drops behind a bank of TERMINALS for cover.\r\n          BULLETS rocket past, one CATCHES her in the arm, but\r\n          barely phases her.\r\n          THE RIOT AGENTS move in, military style, surrounding\r\n\r\n          PETERS.\r\n          PETERS fiddles with the O.D.--\r\n          CLOSE - she slides back a panel, hits a couple of tiny\r\n          SWITCHES-- the RED DIODES go to BLUE.\r\n          PETERS points the device over the terminal, sweeps it in\r\n\r\n                         AN ARC--\r\n          --the RIOT AGENTS all FREEZE'IN PLACE for a second-- and\r\n          then drop at once. Unlike with Stone, there's no\r\n          twitching, smoke or exploding eyeballs. The sudden\r\n          silence is eerie.\r\n          PETERS rises and moves to STONE, the grotesque, empty-\r\n          eyed surrogate. Her expression is grim, but she's\r\n          accomplished an important part of her mission.\r\n          BOBBY looks around at the many fallen bodies.\r\n\r\n                         BOBBY\r\n          Are they dead?\r\n\r\n                         PETERS\r\n          (re: the riot agents)\r\n          They're fine.\r\n\r\n          INT. STONE'S STUDY - DAY\r\n\r\n          The PHONE IS RINGING. Move from it to--\r\n          STONE, in his stim chair, projector on his head... eyes\r\n          rolled back, dead. BLOOD begins to seep from his ears.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          107.\r\n\r\n          EXT. CANTER'S BUILDING/ROOF/BALCONY - DAY\r\n\r\n          GREER has come out on the roof. There's an enormous CELL\r\n          TOWER and DISH up here. He moves to the edge, peers over\r\n          warily.\r\n          ANGLE DOWN - forty stories down to the street.\r\n          GREER flinches back, reeling with vertigo. He moves\r\n          along the edge, looking for something.\r\n          ANGLE DOWN - the BALCONY outside Canter's study, just\r\n          inside the roof overhang, a fifteen-foot drop.\r\n          GREER squeezes his eyes shut, steeling himself for what\r\n          he must do. He lowers himself to hang onto the edge,\r\n          trying not to look down. He swings his body to get the\r\n          momentum going the right way--\r\n          --but his grip gives a moment too soon--\r\n          GREER plunges from the roof to the BALCONY RAIL, hitting\r\n          the railing hard, starting to fall off the wrong way.\r\n          But he manages to grab onto the metal. He hauls himself\r\n          up and collapses onto the balcony, lying on his back.\r\n          HIS LEG has been injured in the fall, the pants torn,\r\n          blood. GREER breathes audibly, in pain and exhaustion.\r\n\r\n          INT. FBI BUILDING/SURVEILLANCE CENTER - DAY\r\n\r\n          ON THE TERMINAL - numbers still HIGHLIGHTING, flying past\r\n          at incredible speed.\r\n          MOVE TO FIND PETERS, with an open TOOLBOX. She's\r\n          expertly wiring the O.D. to the keyboard, cutting,\r\n          splicing and reattaching wires.\r\n          BOBBY wheels closer, tries to KICK the O.D.\r\n          Without flinching, PETERS KNOCKS him back across the\r\n          room, the chair FALLS OVER and Bobby moans.\r\n\r\n          INT. CANTER'S PENTHOUSE/STUDY - DAY\r\n\r\n          GREER SHOOTS THE GLASS, elbows out the shards and reaches\r\n          in to unlock the balcony door. Keeping his gun ready, he\r\n          limps painfully into the empty room.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          108.\r\n\r\n                         - DAY\r\n\r\n          INT. CANTER'S PENTHOUSE/VARIOUS ROOMS\r\n\r\n          QUICK CUTS as GREER hunts for Canter, flinging open doors\r\n          into BEDROOMS, a LIVING ROOM, BATHROOMS.\r\n\r\n          INT. LUXURY BUILDING/LOBBY - DAY\r\n\r\n          The CLERK, reactivated, leads a squad of UNIFORMED POLICE\r\n          toward the stairwell.\r\n\r\n          INT. CANTER'S PENTHOUSE/HALLWAY\r\n\r\n          GREER has almost given up hope when he starts at a noise\r\n          and spins, ready to shoot at--\r\n          --the AUTOMATED VACUUM humming around a corner. As it\r\n          moves past his feet, Greer registers--\r\n          --a thin strip of RED LIGHT at floor level. After a\r\n          moment, he begins rapping at the wall, realizing it's\r\n          false.\r\n\r\n          INT. LUXURY BUILDING/STAIRWELL - DAY\r\n\r\n          THE CLERK taps a CODE into the KEYPAD of the bullet-\r\n          dented door. We hear a HEAVY LATCH disengage.\r\n\r\n          INT. CANTER'S PENTHOUSE/HALLWAY - DAY\r\n\r\n          GREER hears FOOTSTEPS of the approaching cops as he tries\r\n          desperately to find a way into the hidden space. He\r\n          discovers a LATCH at waist level, the wall becomes a\r\n          pocket door. He lets himself in and closes it behind him\r\n\r\n                         JUST AS--\r\n          THE POLICE and the CLERK round the corner.\r\n\r\n          INT. CANTER'S PENTHOUSE/CONTROL AREA - DAY\r\n\r\n          Eerie RED LIGHT, a narrow, snaking passageway. GREER\r\n          listens as the FOOTSTEPS pass outside, turns to see--\r\n          THE STALKER-- the hulking, silver-eyed surrogate who\r\n          broke into Peters' place. He's inert in his CHARGING\r\n\r\n          BAY.\r\n          Beside him is the BOY who picked Greer up in the limo.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          109.\r\n\r\n                         CONTINUED:\r\n          WIDER, a dozen SURROGATES, different ages and sexes,\r\n          lined up in their charging bays. Clearly, Canter can\r\n          become anyone he wants to be.\r\n          GREER is momentarily stunned to see--\r\n          THE PROPHET, a spare surrogate, in a charging bay.\r\n          GREER moves carefully onward. Around a corner, he sees--\r\n          --a PROJECTOR DISPLAY SCREEN. It's PETERS' POV on the\r\n          FBI SURVEILLANCE CENTER, a glance toward the motionless\r\n          RIOT AGENTS, to BOBBY struggling on the ground. PETERS'\r\n          POV SETTLES on the numbers HIGHLIGHTING on the terminal.\r\n          THE 0. D. is connected to the keyboard, BLUE DIODES\r\n          FLASH, the jerry-rigging complete.\r\n          REAL CANTER is visible from behind in an elaborate\r\n          prosthetic WHEELCHAIR, a SENSORY PROJECTOR on his head.\r\n          GREER moves toward him and RIPS OFF the headgear.\r\n          REAL CANTER opens his eyes, startled.\r\n\r\n                         GREER\r\n          You're insane.\r\n\r\n          INT. FBI BUILDING/SURVEILLANCE CENTER -- DAY\r\n\r\n          PETERS is frozen in place by the-terminal. BOBBY, on the\r\n          ground, realizes something's happened. He strains to see\r\n          the numbers screen.\r\n          ON SCREEN -- THE NUMBERS have stopped scrolling. A\r\n          dialogue box: \"FULL DATABASE SELECTED - UPLOADING\r\n          SOFTWARE TO NETWORK\" with a bar moving up slowly.\r\n\r\n          INT. CANTER'S PENTHOUSE/CONTROL AREA - DAY\r\n\r\n          CANTER squints up at GREER from his wheelchair and brace.\r\n          He speaks with an ELECTRONIC AID, his voice slightly\r\n          artificial-sounding.\r\n\r\n                         CANTER\r\n          Jennifer Peters. Is she--\r\n\r\n                         GREER\r\n          She's dead.\r\n\r\n                         CANTER\r\n          I had no intention of hurting her.\r\n          I'm truly sorry--\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          110.\r\n\r\n                         CONTINUED:\r\n\r\n                         GREER\r\n          You bastard, she was my partner, I\r\n          cared about her--\r\n\r\n                         CANTER\r\n          Did you? You barely knew her. It\r\n          was me you came to care about--\r\n\r\n                         GREER\r\n          Shut up!\r\n          Greer clenches his fist, if the man wasn't in a\r\n          wheelchair he would beat the hell out of him. Struggling\r\n          to control himself, mind reeling:\r\n\r\n                         GREER (CONT'D)\r\n          How many people are you? You're\r\n          really the Prophet?\r\n\r\n                         CANTER\r\n          I had to fight VSI any way I\r\n          could.\r\n          As canter speaks, his eyes flick toward the PROJECTOR'S\r\n\r\n                         MONITOR--\r\n          --the image of the O.D. DEVICE UPLOADING SOFTWARE from\r\n          PETERS' POV. Canter tries to block Greer's view--\r\n\r\n                         CANTER (CONT'D)\r\n          There's nothing you can do--\r\n          GREER PUSHES CANTER'S WHEELCHAIR out of the way\r\n          violently. Greer sits on the floor, leaning against the\r\n          wall. He takes a breath and puts on the PROJECTOR\r\n          HEADSET. He slips on the FINGERSLEEVE, presses his\r\n          fingers together and--\r\n\r\n          INT. FBI BUILDING/SURVEILLANCE CENTER - DAY\r\n\r\n          --PETERS is suddenly REANIMATED, stumbles a bit where she\r\n          stands, as Greer gets his bearings in this new body. He\r\n          moves to the KEYBOARD and RIPS THE O.D. from the jerry-\r\n          rigged connection. -\r\n\r\n          ON TERMINAL SCREEN -- \"UPLOAD COMPLETE.\"\r\n          PETERS turns to BOBBY.\r\n\r\n                         PETERS\r\n          How do I shut it down?\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         CONTINUED:\r\n\r\n                         BOBBY\r\n\r\n                         (BAFFLED)\r\n          You...\r\n\r\n                         PETERS\r\n          Bobby, this is Agent Greer!\r\n          ON THE CATWALK - a HUMAN agent, he's a SNIPER in black,\r\n          creeps into position, readying his rifle.\r\n          PETERS/GREER helps BOBBY up, so that he can see the\r\n          computer screen. Bobby remains cuffed.\r\n\r\n          ON SCREEN - \"PREPARING TO DISCONNECT OPERATORS - 30\r\n          SECONDS.\" The number is counting down.\r\n\r\n                         BOBBY\r\n\r\n                         (THINKING)\r\n          OK... the software from that\r\n          thing's already in the system, you\r\n          have to abort transmission.\r\n\r\n                         PETERS/GREER\r\n\r\n                         (DESPERATE)\r\n          How?1\r\n\r\n                         BOBBY\r\n          Hit control-escape, F12.\r\n          As PETERS/GREER does so:\r\n\r\n                         PETERS/GREER\r\n          This can really send a virus to\r\n          every surrie on the network?\r\n\r\n                         BOBBY\r\n          Sure, but it has to disconnect the\r\n          operators first.\r\n\r\n                         PETERS/GREER\r\n          (pauses, surprised)\r\n          So people aren't in any danger...\r\n\r\n                         BOBBY\r\n          Their surrogates are! Hurry up!\r\n\r\n          ON TERMINAL SCREEN - \"ABORT? YES. NO.\"\r\n\r\n          INT. CANTER'S PENTHOUSE/CONTROL AREA - DAY\r\n\r\n          THE PROJECTOR SCREEN shows the words \"YES. NO.\"\r\n          MOVE TO GREER, in the sensory projector, his face tight.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          112.\r\n\r\n                         CONTINUED:\r\n          CANTER stares at GREER, seeing that Greer realizes what's\r\n          at stake-- the fate of humanity.\r\n\r\n                         CANTER\r\n          You understand...\r\n\r\n          INT. FBI BUILDING/SURVEILLANCE CENTER - DAY\r\n\r\n          PETERS/GREER reaches for the keyboard again, hesitates.\r\n          A moment of internal conflict.\r\n          BOBBY stares, confused.\r\n\r\n                         BOBBY\r\n          Do it!\r\n          BANG! A CLEAN HEADSHOT drops PETERS/GREER in her tracks,\r\n          ELECTRONIC GOO sprays the COMPUTER SCREEN.\r\n          BOBBY spins in his chair.\r\n\r\n                         BOBBY (CONT'D)\r\n\r\n                         NOT\r\n          He tries desperately to reach the keys himself, but--\r\n          ON SCREEN \"DISCONNECTING.\" He's too late.\r\n\r\n          INT. CANTER'S PENTHOUSE/CONTROL AREA - DAY\r\n\r\n          GREER yanks off the headset, breathing hard, eyes wide\r\n          with shock. CANTER regards him from his wheelchair.\r\n          He's been watching the MONITOR, knows what just happened.\r\n\r\n                         CANTER\r\n          You could have stopped it. Thank\r\n          you...\r\n\r\n                         GREER\r\n          Why...?\r\n\r\n                         CANTER\r\n          You know why. I won't be\r\n          responsible for the death of\r\n          humanity. I like the way you put\r\n          it-- unringing a bell.\r\n          GREER puts his head in his hands, realizing the enormity\r\n          of what he's just done.\r\n\r\n                         GREER\r\n          You created them.\r\n\r\n                         (CONTINUED)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          113.\r\n\r\n                         CONTINUED:\r\n\r\n                         CANTER\r\n          I only sought to give people like\r\n          me the chance to live normal lives.\r\n          But my partners at VSI overrode me.\r\n          They saw a much larger market--\r\n          surrogates for everyone. Healthy\r\n          people. Children. A world without\r\n          risk, without pain. Without\r\n          feelings. Nothing at stake.\r\n          Nothing to live for.\r\n          Greer rises shakily.\r\n\r\n                         GREER\r\n          What's going to happen?\r\n\r\n                         CANTER\r\n          The day of resurrection.\r\n          As he speaks, he raises a small white capsule to his\r\n          lips.\r\n\r\n                         GREER\r\n          No--!\r\n          Before Greer can stop him, CANTER BITES INTO IT and\r\n          swallows. Greer tries to get the capsule from Canter's\r\n          mouth-- but the man is DEAD within moments.\r\n\r\n          INT. FBI BUILDING/SURVEILLANCE CENTER - DAY\r\n\r\n          BOBBY KICKS at the COMPUTER frantically, CRYING OUT. THE\r\n          SNIPER reaches him, CUTS his HANDS free with a KNIFE.\r\n\r\n                         HUMAN SNIPER\r\n          It's OK, sir, you're alright, it's\r\n\r\n                         OVER--\r\n          Freed, Bobby lunges at the keyboard, hitting keys in a\r\n          frenzy, but--\r\n          ON SCREEN - \"DISCONNECTING\" changes to \"OPERATORS\r\n          DISCONNECTED...\" Then, quickly-- \"TRANSMITTING.\"\r\n\r\n          EXT. RESERVATION NO MAN'S LAND - DAY\r\n\r\n          LATE AFTERNOON, golden light. DREADS have been herded\r\n          together here, NATIONAL GUARDSMEN surrounding them.\r\n          Suddenly the GUARDSMEN all DROP at once.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          114.\r\n\r\n          EXT. WASHINGTON STREET - DAY\r\n\r\n          CROWDED, rush hour, lots of traffic and noise. Then--\r\n          --PEDESTRIANS fall in a wave. CARS VEER out of control,\r\n          SMASHING INTO EACH OTHER, careening onto the sidewalk,\r\n          rolling over fallen surrie bodies and SMASHING into\r\n          storefronts.\r\n\r\n          INT. FBI BUILDING/BULLPEN - DAY\r\n\r\n          THE FEDS are all collapsed over desks, or sprawled flat.\r\n\r\n          INT. SUBWAY - DAY\r\n\r\n          A CAR FULL OF COMMUTERS-- some slumped in their seats or\r\n          hanging from straps, others lying on the floor. The car\r\n          STOPS AUTOMATICALLY, the DOORS OPEN with a HISS--\r\n          --to reveal a PLATFORM littered with BODIES.\r\n\r\n          INT. MAGGIE'S SHOP - DAY\r\n\r\n          ALL EMPLOYEES and CUSTOMERS of the beauty shop are\r\n          motionless. CAMERA FINDS MAGGIE on the floor among them,\r\n          staring sightlessly at the ceiling.\r\n\r\n          EXT. LUXURY BUILDING/BALCONY - DAY\r\n\r\n          ANGLE DOWN on the suddenly quiet street. The surries\r\n          have dropped throughout the city.\r\n          PULL BACK to reveal GREER looking down on this. He limps\r\n          quickly back inside--\r\n\r\n          INT. CANTER'S PENTHOUSE/STUDY - DAY\r\n\r\n          --stepping over the BODIES of the FALLEN COPS. He moves\r\n          for the ELEVATOR, hits a SWITCH to POWER it up.\r\n\r\n          EXT. RESERVATION NO MAN'S LAND - DAY\r\n\r\n          The moment the Dreads have been waiting for. With a mass\r\n          CRY, they're charging over the fallen BODIES of the\r\n          GUARDSMEN and over the flattened fences.\r\n          WIDE as THOUSANDS OF DREADS run out of the reservation\r\n          into the streets of the city.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          115.\r\n\r\n          EXT. WASHINGTON STREETS - DAY\r\n\r\n          GREER hobbles through the dreadful aftermath-- SMOKING\r\n          AUTO PILEUPS, BODIES everywhere, most fallen in their\r\n          tracks, a few remain on their feet. CAR HORNS, ALARMS in\r\n          the distance. -\r\n          A few disheveled DREADS are here, taking it in with\r\n          delight and amazement. They WHOOP as they TIP OVER a\r\n          couple of the standing surries.\r\n          GREER passes a CAR on the sidewalk, its DRIVER slumped\r\n          against the wheel-- the RADIO BLARES:\r\n\r\n                         RADIO VOICE\r\n          The massive surrogate shutdown\r\n          appears to be nationwide...\r\n\r\n          EXT. VSI HEADQUARTERS - DAY\r\n\r\n          FALLEN SURRIES all over the grounds. ARMED DREADS are\r\n          rushing into the place, past the MOTIONLESS SENTRIES.\r\n          They're making for the factory.\r\n\r\n                         RADIO VOICE\r\n          Rioters presumed to be members of\r\n          the Human Coalition seem to be\r\n          making coordinated attacks on\r\n\r\n                         SURROGATE-RELATED BUSINESSES\r\n          across the country...\r\n\r\n          INT. VSI FACTORY - DAY\r\n\r\n          The ROBOTIC ASSEMBLY LINE, still running until--\r\n          BOOM! A DREAD shoots an RPG into the machinery.\r\n          SURROGATE PARTS are BLASTED in all directions.\r\n\r\n          INT. VSI WAREHOUSE - DAY\r\n\r\n          FIRE SPREADS across the rows of SURROGATE TEMPLATES,\r\n          packed together tightly.\r\n          CLOSE on a MELTING FACE, the deforming PLASTIC SKULL and\r\n          ELECTRONICS within.\r\n\r\n                         RADIO VOICE\r\n          Citizens are asked to remain in\r\n          their homes...\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          116.\r\n\r\n          EXT. GREER'S BUILDING - DAY\r\n\r\n          GREER makes his way toward his place.\r\n\r\n          INT. GREER'S APARTMENT/LIVING ROOM - DAY\r\n\r\n          GREER enters, moves immediately for his wife's bedroom.\r\n\r\n                         GREER\r\n          Maggie--?\r\n          He KNOCKS gently, then tries the door-- it isn't locked.\r\n\r\n          INT. GREER'S APARTMENT/MAGGIE'S ROOM - DAY\r\n\r\n          The room is DIM, there's a FORM huddled in the bed,\r\n          SOBBING, covers pulled up. GREER moves slowly toward\r\n          her, speaks in a soothing voice.\r\n\r\n                         GREER\r\n          Maggie, it's me.\r\n          She pulls away from his touch at first, struggles.\r\n\r\n                         MAGGIE\r\n          No! Please no, don't look at me...\r\n          Greer pulls away the covers to reveal the REAL MAGGIE.\r\n          She's pale, emaciated and malnourished, tears running\r\n          down her face. She shrinks away from him.\r\n\r\n                         MAGGIE (CONT'D)\r\n          No Tom, I don't want you to...\r\n          It doesn't matter to Greer-- he takes her in his arms and\r\n          holds her close.\r\n\r\n                         GREER\r\n          It's OK, it's OK...\r\n\r\n                         MAGGIE\r\n          No it's not...\r\n\r\n                         GREER\r\n          Ssh. It's just us now.\r\n          Slowly, she puts her arms around him, weeping against his\r\n          chest. PULL BACK and--\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          117.\r\n\r\n          EXT. GREER'S BUILDING/NEIGHBORHOOD - DAY\r\n\r\n          --OUT THE WINDOW. MOVE to show exterior DOORS OPENING\r\n          and GREER'S NEIGHBORS EMERGING, blinking in the\r\n          unfamiliar sunlight. Most wear robes, sweatclothes.\r\n          They're all ages, some overweight, others homely-- it's\r\n          almost a relief after all the young, perfect people.\r\n          DOWN THE STREET, OTHERS EMERGE, regard each other warily,\r\n          like people after an earthquake. Some begin speaking to\r\n          each other for the first time, in whispers at first,\r\n          others take in the SUNSET which bathes the neighborhood\r\n          in orange light.\r\n\r\n          FADE TO BLACK.\r\n\r\n\r\n\n\n\n\nSurrogates\nWriters :   John Brancato  Michael Ferris  Robert Venditti\nGenres :   Action  Sci-Fi  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:36:45.116445"}