{"title": "Taxi Driver", "film_link": "/Movie Scripts/Taxi Driver Script.html", "script_link": "/scripts/Taxi-Driver.html", "info_raw": "\n\nTaxi Driver Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.44 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Paul Schrader\nGenres  Crime  Drama  Thriller\n\nRead \"Taxi Driver\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>\n<b>/*\n</b>Break-out-of-frames script\nBy Website Abstraction (http://wsabstract.com)\nOver 400+ free scripts here!\nAbove notice MUST stay entact for use\n<b>*/\n</b>\nif (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                         TAXI DRIVER\n\n                             by\n\n                        Paul Schrader\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                PROPERTY OF:\n\n                                       \n\n\n\n\n\"The whole conviction of my life now rests upon the belief\nthat loneliness, far from being a rare and curious\nphenomenon, is the central and inevitable fact of human\nexistence.\"\n\n--Thomas Wolfe,\n\"God's Lonely Man\"\n\nTRAVIS BICKLE, age 26, lean, hard, the consummate loner. On\nthe surface he appears good-looking, even handsome; he has a\nquiet steady look and a disarming smile which flashes from\nnowhere, lighting up his whole face. But behind that smile,\naround his dark eyes, in his gaunt cheeks, one can see the\nominous stains caused by a life of private fear, emptiness\nand loneliness. He seems to have wandered in from a land\nwhere it is always cold, a country where the inhabitants\nseldom speak. The head moves, the expression changes, but\nthe eyes remain ever-fixed, unblinking, piercing empty space.\n\nTravis is now drifting in and out of the New York City night\nlife, a dark shadow among darker shadows.  Not noticed, no\nreason to be noticed, Travis is one with his surroundings.\nHe wears rider jeans, cowboy boots, a plaid western shirt\nand a worn beige Army jacket with a patch reading, \"King\nKong Company 1968-70\".\n\nHe has the smell of sex about him: Sick sex, repressed sex,\nlonely sex, but sex nonetheless. He is a raw male force,\ndriving forward; toward what, one cannot tell. Then one\nlooks closer and sees the evitable. The clock sprig cannot\nbe wound continually tighter. As the earth moves toward the\nsun, Travis Bickle moves toward violence.\n\nFILM OPENS on EXT. of MANHATTAN CAB GARAGE.  Weather-beaten\nsign above driveway reads, \"Taxi Enter Here\". Yellow cabs\nscuttle in and out. It is WINTER, snow is piled on the\ncurbs, the wind is howling.\n\nINSIDE GARAGE are parked row upon row of multi-colored taxis.\nEchoing SOUNDS of cabs idling, cabbies talking. Steamy\nbreath and exhaust fill the air.\n\nINT. CORRIDOR of cab company offices. Lettering on ajar door\nreads:\n\n                       PERSONAL OFFICE\n\n                     Marvis Cab Company\n                   Blue and White Cab Co.\n                          Acme Taxi\n                  Dependable Taxi Services\n                       JRB Cab Company\n                     Speedo Taxi Service\n\n                                                            2.\n\n\nSOUND of office busywork: shuffling, typing, arguing.\n\nPERSONAL OFFICE is a cluttered disarray. Sheets with heading\n\"Marvis, B&W, Acme\" and so forth are tacked to crumbling\nplaster wall: It is March. Desk is cluttered with forms,\nreports and an old upright Royal typewriter.\n\nDishelved middle-aged New Yorker looks up from the desk. We\nCUT IN to ongoing conversation between the middle-aged\nPERSONNEL OFFICER and a YOUNG MAN standing in front on his\ndesk.\n\nThe young man is TRAVIS BICKLE. He wears his jeans, boots\nand Army jacket. He takes a drag off his unfiltered cigarette.\n\nThe PERSONNEL OFFICER is beat and exhausted: he arrives at\nwork exhausted. TRAVIS is something else again. His intense\nsteely gaze is enough to jar even the PERSONNEL OFFICER out\nof his workaday boredom.\n\n                         PERSONNEL OFFICER (O.S.)\n            No trouble with the Hack Bureau?\n\n                         TRAVIS (O.S.)\n            No Sir.\n\n                         PERSONNEL OFFICER (O.S.)\n            Got your license?\n\n                         TRAVIS (O.S.)\n            Yes.\n\n                         PERSONNEL OFFICER\n            So why do you want to be a taxi\n            driver?\n\n                         TRAVIS\n            I can't sleep nights.\n\n                         PERSONNEL OFFICER\n            There's porno theatres for that.\n\n                         TRAVIS\n            I know. I tried that.\n\nThe PERSONNEL OFFICER, though officious, is mildly probing\nand curious.  TRAVIS is a cipher, cold and distant. He\nspeaks as if his mind doesn't know what his mouth is saying.\n\n                         PERSONNEL OFFICER\n            So whatja do now?\n\n                                                            3.\n\n\n                         TRAVIS\n            I ride around nights mostly.\n            Subways, buses. See things. Figur'd\n            I might as well get paid for it.\n\n                         PERSONNEL OFFICER\n            We don't need any misfits around\n            here, son.\n\nA thin smile cracks almost indiscernibly across TRAVIS' lips.\n\n                         TRAVIS\n            You kiddin? Who else would hack\n            through South Bronx or Harlem at\n            night?\n\n                         PERSONNEL OFFICER\n            You want to work uptown nights?\n\n                         TRAVIS\n            I'll work anywhere, anytime. I know\n            I can't be choosy.\n\n                         PERSONNEL OFFICER\n                   (thinks a moment)\n            How's your driving record?\n\n                         TRAVIS\n            Clean. Real clean.\n                   (pause, thin smile)\n            As clean as my conscience.\n\n                         PERSONNEL OFFICER\n            Listen, son, you gonna get smart,\n            you can leave right now.\n\n                         TRAVIS\n                   (apologetic)\n            Sorry, sir. I didn't mean that.\n\n                         PERSONNEL OFFICER\n            Physical? Criminal?\n\n                         TRAVIS\n            Also clean.\n\n                         PERSONNEL OFFICER\n            Age?\n\n                         PERSONNEL OFFICER\n            Twenty-six.\n\n                         PERSONNEL OFFICER\n            Education?\n\n                                                            4.\n\n\n                         TRAVIS\n            Some. Here and there.\n\n                         PERSONNEL OFFICER\n            Military record?\n\n                         TRAVIS\n            Honorable discharge. May 1971.\n\n                         PERSONNEL OFFICER\n            You moonlightin?\n\n                         TRAVIS\n            No, I want long shifts.\n\n                         PERSONNEL OFFICER\n                   (casually, almost to himself)\n            We hire a lot of moonlighters here.\n\n                         TRAVIS\n            So I hear.\n\n                         PERSONNEL OFFICER\n                   (looks up at Travis)\n            Hell, we ain't that much fussy\n            anyway. There's always opening on\n            one fleet or another.\n                   (rummages through his\n                   drawer, collecting\n                   various pink, yellow\n                   and white forms)\n            Fill out these forms and give them\n            to the girl at the desk, and leave\n            your phone number. You gotta phone?\n\n                         TRAVIS\n            No.\n\n                         PERSONNEL OFFICER\n            Well then check back tomorrow.\n\n                         TRAVIS\n            Yes, Sir.\n\n                                            CUT TO:\n\nCREDITS\n\nCREDITS appear over scenes from MANHATTAN NIGHTLIFE. The\nsnow has melted, it is spring.\n\nA rainy, slick, wet miserable night in Manhattan's theatre\ndistrict.\n\n                                                            5.\n\n\nCabs and umbrellas are congested everywhere; well-dressed\npedestrians are pushing, running, waving down taxis. The\nhigh-class theatre patrons crowding out of the midtown shows\nare shocked to find that the same rain that falls on the\npoor and common is also falling on them.\n\nThe unremitting SOUNDS of HONKING and SHOUTING play against\nthe dull pitter-patter of rain. The glare of yellow, red and\ngreen lights reflects off the pavements and autos.\n\n\"When it rains, the boss of the city is the taxi driver\" -\nso goes the cabbie's maxim, proven true by this particular\nnight's activity. Only the taxis seem to rise above the\nsituation: They glide effortlessly through the rain and\ntraffic, picking up whom they choose, going where they please.\n\nFurther uptown, the crowds are neither so frantic nor so\nglittering.  The rain also falls on the street bums and aged\npoor. Junkies still stand around on rainy street corners,\nhookers still prowl rainy sidewalks. And the taxis service\nthem too.\n\nAll through the CREDITS the exterior sounds are muted, as if\ncoming from a distant room or storefront around the corner.\nThe listener is at a safe but privileged distance.\n\nAfter examining various strata of Manhattan nightlife,\nCAMERA begins to CLOSE IN on one particular taxi, and it is\nassumed that this taxi is being driven by TRAVIS BICKLE.\n\nEND CREDITS\n\n                                            CUT TO:\n\nTravis's yellow taxi pulls in foreground. On left rear door\nare lettered the words \"Dependable Taxi Service\".\n\nWe are somewhere on the upper fifties on Fifth Ave. The rain\nhas not let up.\n\nAn ELDERLY WOMAN climbs in the right rear door, crushing her\numbrella.  Travis waits a moment, then pulls away from the\ncurb with a start.\n\nLater, we see Travis' taxi speeding down the rain-slicked\navenue. The action is periodically accompanied by Travis'\nnarration. He is reading from a haphazard personal diary.\n\n                         TRAVIS (V.O.)\n                   (monotone)\n            April 10, 1972. Thank God for the\n            rain which has helped wash the\n            garbage and trash off the sidewalks.\n\n                                                            6.\n\n\nTRAVIS' POV of sleazy midtown side street: Bums, hookers,\njunkies.\n\n                         TRAVIS (V.O.)\n            I'm working a single now, which\n            means stretch-shifts, six to six,\n            sometimes six to eight in the a.m.,\n            six days a week.\n\nA MAN IN BUSINESS SUIT hails Travis to the curb.\n\n                         TRAVIS (V.O.)\n            It's a hustle, but it keeps me busy.\n            I can take in three to three-fifty\n            a week, more with skims.\n\nMAN IN BUSINESS SUIT, now seated in back seat, speaks up:\n\n                         MAN IN BUSINESS SUIT\n                   (urgent)\n            Is Kennedy operating, cabbie? Is it\n            grounded?\n\nOn seat next to TRAVIS is half-eaten cheeseburger and order\nof french fries. He puts his cigarette down and gulps as he\nanswers:\n\n                         TRAVIS\n            Why should it be grounded?\n\n                         MAN IN BUSINESS SUIT\n            Listen - I mean I just saw the\n            needle of the Empire State Building.\n            You can't see it for the fog!\n\n                         TRAVIS\n            Then it's a good guess it's grounded.\n\n                         MAN IN BUSINESS SUIT\n            The Empire State in fog means\n            something, don't it? Do you know,\n            or don't you? What is your number,\n            cabbie?\n\n                         TRAVIS\n            Have you tried the telephone?\n\n                         MAN IN BUSINESS SUIT\n                   (hostile, impatient)\n            There isn't time for that. In other\n            words, you don't know.\n\n                         TRAVIS\n            No.\n\n                                                            7.\n\n\n                         MAN IN BUSINESS SUIT\n            Well, you should know, damn it, or\n            who else would know? Pull over\n            right here.\n                   (points out window)\n            Why don't you stick your goddamn\n            head out of the goddamn window once\n            in a while and find out about the\n            goddamn fog!\n\nTRAVIS pulls to the curb. The BUSINESS MAN stuffs a dollar\nbill into the pay drawer and jumps out of the cab. He turns\nto hail another taxi.\n\n                         MAN IN BUSINESS SUIT\n            Taxi! Taxi!\n\nTravis writes up his trip card and drives away.\n\nIt is LATER THAT NIGHT. The rain has turned to drizzle.\nTravis drives trough another section of Manhattan.\n\n                         TRAVIS (V.O.)\n            I work the whole city, up, down,\n            don't make no difference to me -\n            does to some.\n\nSTREETSIDE: TRAVIS' P.O.V.  Black PROSTITUTE wearing white\nvinyl boots, leopard-skin mini-skirt and blond wig hails\ntaxi. On her arm hangs half-drunk seedy EXECUTIVE TYPE.\n\nTRAVIS pulls over.\n\nPROSTITUTE and JOHN climb into back seat. TRAVIS checks out\nthe action in rear view mirror.\n\n                         TRAVIS (V.O.)(CONTD)\n            Some won't take spooks - Hell,\n            don't make no difference tom me.\n\nTRAVIS' taxi drives through Central Park.\n\nGRUNTS, GROANS coming from back seat. HOOKER and JOHN going\nat it in back seat. He's having a hard time and she's\nprobably trying to get him to come off manually.\n\n                         JOHN (O.S.)\n            Oh baby, baby.\n\n                         PROSTITUTE (O.S.)\n                   (forceful)\n            Come on.\n\n                                                            8.\n\n\nTRAVIS stares blankly ahead.\n\n                                            CUT TO:\n\nTRAVIS' APARTMENT.  CAMERA PANS SILENTLY across INT. room,\nindicating this is not a new scene.\n\nTRAVIS is sitting at plain table writing. He wears shirt,\njeans, boots.  An unfiltered cigarette rests in a bent\ncoffee can ash tray.\n\nCLOSE UP of notebook. It is a plain lined dimestore notebook\nand the words TRAVIS is writing with a stubby pencil are\nthose he is saying.  The columns are straight, disciplined.\nSome of the writing is in pencil, some in ink. The\nhandwriting is jagged.\n\nCAMERA continues to PAN, examining TRAVIS' apartment. It is\nunusual, to say the least:\n\nA ratty old mattress is thrown against one wall. The floor\nis littered with old newspapers, worn and unfolded streets\nmaps and pornography.  The pornography is of the sort that\nlooks cheap but costs $10 a threw - black and white photos\nof naked women tied and gagged with black leather straps and\nclothesline. There is no furniture other than the rickety\nchair and table. A beat-up portable TV rests on an upright\nmelon crate. The red silk mass in another corner looks like\na Vietnamese flag. Indecipherable words, figures, numbers\nare scribbled on the plain plaster walls. Ragged black wires\ndangle from the wall where the telephone once hung.\n\n                         TRAVIS (V.O.)\n            They're all animals anyway. All the\n            animals come out at night: Whores,\n            skunk pussies, buggers, queens,\n            fairies, dopers, junkies, sick,\n            venal.\n                   (a beat)\n            Someday a real rain will come and\n            wash all this scum off the streets.\n\nIt's EARLY MORNING: 6 a.m. The air is clean and fresh and\nthe streets nearly deserted.\n\nEXT. of TAXI GARAGE.  TRAVIS' taxi pulls into the driveway.\n\n                         TRAVIS (V.O.)(CONTD)\n            Each night when I return the cab to\n            the garage I have to clean the come\n            off the back seat. Some nights I\n            clean off the blood.\n\n                                                            9.\n\n\nINT. of TAXI GARAGE.  TRAVIS pulls his taxi into garage\nstall. TRAVIS reaches across the cab and extracts a small\nvial of bennies from the glove compartment.\n\nTRAVIS stands next to the cab, straightens his back, and\ntucks the bottle of pills into his jacket pocket. He lowers\nhis head, looks into back seat, opens rear door and bends\ninside.\n\nHe shakes a cigarette out of his pack of camels and lights it.\n\nSLIGHT TIMECUT: TRAVIS books it at garage office. Old,\nrotting slabs of wood are screwed to a grey crumbling\nconcrete wall. Each available space is covered with hand-\nlettered signs, time schedules, check-out sheets, memos. The\nsigns read:\n\n                         BE ALERT!!\n                       THE SAFE DRIVER\n                       IS ALWAYS READY\n                     FOR THE UNEXPECTED\n\n                          SLOW DOWN\n                     AND GAUGE SPEED TO\n                       ROAD CONDITIONS\n                       YOU CAN'T STOP\n                         ON A DIME!\n\n                      ALL NIGHT DRIVERS\n                   HAVING PERSONAL INJURY\n                          ACCIDENTS\n                  MUST PHONE IN AT ONCE TO\n                        JUDSON 2-3410\n               AND MUST FILE A REPORT Promptly\n              AT 9 AM THE FOLLOWING MORNING AT\n                         43 W. 61st.\n\nA half dozen haggard cabbies hang around the office. Their\nshirts are wrinkle, their heads dropping, the mouths\nincessantly chattering. We pick up snatches of cabbie small\ntalk:\n\n                         1ST CABBIE\n            ... hadda piss like a bull steer,\n            so I pull over on 10th Ave, yank up\n            the hood and do the engine job.\n                   (gestures as if\n                   taking a piss into\n                   the hood)\n            There I am with my dong in my hand\n            when a guy come up and asks if I\n            need any help. Just checking the\n            battery, I says, and, meanwhile...\n                         (MORE)\n\n                                                           10.\n\n\n                         1ST CABBIE (CONT'D)\n                   (takes imaginary piss)\n\n\n                         2ND CABBIE\n            If he thinks I'm going up into The\n            Jungle this time of night, he can\n            shove it.\n\n                         3RD CABBIE\n                   (talking into pay phone)\n            Fuck that Violets First. Fucking\n            saddle horse. No, no, the OTB. Fuck\n            them. No, it was TKR. TCR and I'da\n            made seven fucking grand. Fuck them\n            too. Alright, what about the second\n            race?\n\n                         4TH CABBIE\n            Over at Love, this hooker took on\n            the whole garage. Blew the whole\n            fucking joint and they wouldn't\n            even let her use the drinking\n            fountain.\n\nTravis hands his trip sheet to a CAB OFFICIAL, nods slightly,\nturns and walks toward the door.\n\nOUTSIDE, TRAVIS walks pleasantly down Broadway, his hands in\nhis jacket pockets.  The sidewalks are deserted, except for\ndiligent fruit and vegetable VENDORS setting up their stalls.\nHe takes a deep breath of fresh air, pulls a white pill from\nhis pocket, pops it into his mouth.\n\nTravis turns a corner, keeps walking. Ahead of him is a 24-\nhour PORNO THEATRE. The theatre, a blaze of cheap day-glow\nreds and yellows, is an offense to the clear, crisp morning\nair. The permanent lettering reads, \"Adam Theatre, 16mm\nSound Features\". Underneath, today's feature are hand-\nlettered: \"Six-Day Cruise\" and \"Beaver Dam\".\n\nTravis stops at the box office, purchases a ticket, and\nwalks in.\n\nINT. PORNO THEATRE\n\nTravis stands in the aisle for a moment. He turns around,\nwalking back toward the concession stand.\n\nCONCESSION STAND\n\nA plain dumpy-looking GIRL sits listlessly on a stool behind\nthe shabby concession stand. A plaster-of-Paris Venus de\nMilo sits atop a piece of purple velvet cloth on the counter.\n\n                                                           11.\n\n\nThe SOUND of the feature drones in the background.\n\n                         CONCESSION GIRL\n            Kin I help ya?\n\nTravis rests his elbow on the counter, looking at the Girl.\nHe is obviously trying to be friendly - no easy task for him.\nGod knows he needs a friend.\n\n                         TRAVIS\n            What is your name? My name is Travis.\n\n                         CONCESSION GIRL\n            Awh, come off it, Pal.\n\n                         TRAVIS\n            No, I'm serious, really...\n\n                         CONCESSION GIRL\n            Ya want me to call da boss? Huh?\n            That what you want?\n\n                         CONCESSION GIRL\n            No, no, it's alright. I'll have a\n            big Coca-Cola - without ice - and a\n            large buttered popcorn, and...\n                   (pointing)\n            ... some of them chocolate covered\n            malted milk balls... and ju-jukes,\n            a box. They last.\n\n                         CONCESSION GIRL\n            We don't have ju-jukes. We don't\n            have Coca-Cola. We only got Royal\n            Crown Cola.\n\n                         TRAVIS\n            That's fine.\n\n                         CONCESSION GIRL\n            That's a dollar forty-seven.\n\nTravis lays two dollar bills on the counter.\n\nINT. THEATRE AUDITORIUM\n\nSlight TIMECUT to Travis sitting in theatre, drinking his\nRoyal Crown Cola, eating his popcorn and milk balls. His\neyes are fixed on the screen. A MALE VOICE emanates from the\nscreen:\n\n                         MALE MOVIE VOICE (O.S.)\n            Come here, bitch. I'm gonna split\n            you in half.\n\n                                                           12.\n\n\nMale Voice yields to Travis' monotone narration.\n\n                         TRAVIS (V.O.)\n            Twelve hours of work and I still\n            cannot sleep. The days dwindle on\n            forever and do not end.\n\n                                            FADE TO:\n\nEXT. CHARLES PALANTINE CAMPAIGN HEADQUARTERS\n\nThe Headquarters of the \"New Yorkers for Charles Palantine\nfor President Committee\", located at the corner of 50th\nStreet and Broadway, are festooned in traditional red, white\nand blue banners, ribbons and signs.\n\nOne large sign proclaims \"Palantine\". Another sign reads\n\"Register for New York Primary, July 20.\". The smiling\nmiddle-aged face of Charles Palantine keeps watch over the\nbustling pedestrians.\n\nIt is LATE AFTERNOON.\n\nINSIDE HEADQUARTERS\n\nA variety of YOUNG WORKERS joke and chatter as they labor\nthrough stacks of papers. The room is pierced with the sound\nof ringing phones.\n\nSeen from a distance - the only way Travis can see them -\nthose are America's chosen youth: Healthy, energetic, well-\ngroomed, attractive, all recruited from the bucolic fields\nof Massachusetts and Connecticut.\n\nCAMERA FAVORS BETSY, about 25, an extremely attractive woman\nsitting at the reception desk between two phones and several\nstacks of papers. Her attractions, however, are more than\nskin deep. Beneath that Cover Girl facial there is a keen,\nthough highly specialized sensibility: Her eyes scan every\nman who passes her desk as her mind computes his\ndesirability: Political, intellectual, sexual, emotional,\nmaterial.  Simple pose and status do not impress her; she\nseeks out the extraordinary qualities in men. She is, in\nother words, star-fucker of the highest order.\n\nBetsy, putting down the phone, calls TOM, a lanky, amiable\nand modishly long-haired campaign workder over to her desk:\n\n                         BETSY\n            Tom.\n\nTom is pleasant and good-looking, but lacks those special\nqualities which interest Betsy. He gets nowhere with Betsy -\nyet he keeps trying.\n\n                                                           13.\n\n\nJust another of those routine office flirtations which pass\nthe hours and free the fantasies.\n\n                         BETSY\n            Tom, come here a moment.\n                   (he walks over)\n            I think this canvas report is about\n            ready to go out. Check it out with\n            Andy, and if he okays if, have a\n            copy made for the campaign\n            headquarters in every county.\n                   (a beat)\n            And don't forget to add the new\n            photo releases.\n\n                         TOM\n            The senator's white paper is almost\n            ready, Bets. Should we wait for that?\n\n                         BETSY\n            Andy usually just sends those to\n            the national media. The local press\n            doesn't know what to do with a\n            position paper until UPI and AP\n            tell them anyway.\n\n                         TOM\n            I think we should try to get\n            maximum coverage for this new\n            mandatory welfare program. Push the\n            issues.\n\n                         BETSY\n                   (as if instructing a child)\n            First push the man, then the issue.\n            Senator Palantine is first of all a\n            dynamic man, an intelligent,\n            interesting, fascinating man.\n\n                         TOM\n            You forgot \"sexy\".\n\n                         BETSY\n            No, I didn't forget \"sexy\".\n\n                         TOM\n            Just didn't get around to it, huh?\n\n                         BETSY\n            Oh, Tom, please.\n\n                                                           14.\n\n\n                         TOM\n            Well, for Christsakes, you sound\n            like you're selling... I don't know\n            what... cars... not issues.\n\n                         BETSY\n            Have you ever wondered why CBS News\n            has the highest ratings?\n\n                         TOM\n            More people watch it.\n\n                         BETSY\n            Alright, forget it if you're not\n            going to be serious,\n\n                         TOM\n            No, c'mon, I'm listening. I was\n            just...\n\n                         BETSY\n            Just what?\n\n                         TOM\n            Kidding around... you know, fun.\n\nBetsy looks toward the street, then back at Tom.\n\n                         BETSY\n            Maybe if you'd try thinking once in\n            a while, you'd get somewhere.\n\n                         TOM\n            With who?\n\n                         BETSY\n            Alright, now. You want to know why\n            CBS has the highest ratings? You\n            their news is any different from\n            NBC, ABC? It's all the same news.\n            Same stories. Same order usually.\n            What, you thought they had good\n            news for people, right? You thought\n            that's why people watched CBS? I'll\n            tell you why people watch CBS.\n            Cronkite. The man. You got it? Not\n            the news, not the issues, the man.\n            If Walter Cronkite told people to\n            eat soap, they'd do it. We are\n            selling cars, goddamn it.\n\nBetsy's attention is being distracted by something she sees\nacross the street. She puts on her glasses and looks out\nacross the street again.\n\n                                                           15.\n\n\n                         TOM\n            Well, if Cronkite's so great, why\n            don't we run him instead?\n\n                         BETSY\n            That's the last. The finish. Period.\n            Some pople can learn. Some people\n            can't. And you wonder why we never\n            get serious----\n\n                         TOM\n            Sure we could run him. You realize\n            he's already of his block\n            association.\n\n                         BETSY\n                   (looks across street again)\n            Have you been noticing anything\n            strange?\n\n                         TOM\n            No, why?\n\n                         BETSY\n            Why's that taxi driver across the\n            street been staring at us?\n\n                         TOM\n            What taxi driver?\n\n                         BETSY\n            That taxi driver. The one that's\n            been sitting here.\n\n                         TOM\n            How long has he been there?\n\n                         BETSY\n            I don't know - but it feels like a\n            long time.\n\nTravis' cold piercingly eyes Stare out from his cab parked\nacross the street from Palantine Headquarters. He is like a\nlone wolf watching the warm campfires of civilization from a\ndistance. A thin red dot glows from his cigarette.\n\nTom exchanges Travis' gaze.\n\n                         TOM\n                   (determined)\n            Well, I'll go out and ask him.\n\nAs Tom walks toward front door Betsy's eyes alternate\nbetween him and the position where Travis sits.\n\n                                                           16.\n\n\nEXT. PALANTINE HEADQUARTERS\n\nTom strides out the front door and walks briskly across the\nstreet toward Travis' taxi.\n\nTravis spots Tom walking toward him and quickly stares up\nhis cab, then squeals off in a burst of billowing exhaust.\n\nTom watches the speeding taxi quizzically.\n\nTravis' taxi continues down Broadway.\n\n                                            CUT TO:\n\nINT. TRAVIS' APARTMENT\n\nHe lies on his mattress at the ceiling. He is fully clothed\nand appears deep in thought.\n\nNear his mattress rest several medications: A large bottle\nof vitamin pills, two smaller bottles of pills, a bottle of\npeach-flavored brandy.\n\n                         TRAVIS (V.O.)\n            All my life needed was a sense of\n            direction, a sense of someplace to\n            go. I do not believe one should\n            devote his life to morbid self-\n            attention, but should become a\n            person like other people.\n\nANOTHER DAY - LATE AFTERNOON\n\nTravis' taxi is driving down Broadway with the \"Off Duty\"\nsign on.\n\nPOV TRACKING SHOT down Broadway. CAMERA stops at Palantine\nCampaign Headquarters. A few WORKERS remain in the office.\nBetsy's desk is vacant.\n\nFIFTH AVENUE - THE SAME AFTERNOON\n\nCAMERA TRACKS with crowded mass of MANHATTANITES as they\nooze through the sidewalks toward their various destination.\nIndividuals are indiscernible: It is simply a congested mass.\n\n                         TRAVIS (V.O.)\n            I first saw her at Palantine\n            Campaign Headquarters at 58th and\n            Broadway. She was wearing a yellow\n            dress, answering the phone at her\n            desk.\n\n                                                           17.\n\n\nSuddenly: Cut of the congested human mass, IN SLOWING\nMOTION, appears the slender figure of BETSY in a stylish\nyellow dress. The crowd parts like the Red Sea, and there\nshe is: Walking all alone, untouched by the crowd, suspended\nin space and time.\n\n                         TRAVIS (V.O.)(CONTD)\n            She appeared like an angel out of\n            this open sewer. Out of this filthy\n            mass. She is alone: They cannot\n            touch her.\n\nINT. TRAVIS' APARTMENT\n\nHe is at the table, writing in his diary.\n\nCLOSEUP - His stubby pencil rests on the word \"her\".\n\n                                            CUT TO:\n\nIt is 3:30 IN THE MORNING in a bacon-shaped all night WEST\nSIDE REATAURANT. The thick smell hangs in the air - fried\ngrease, smoke, sweat, regurgitated wine.\n\nWhatever doesn't flush away in New York at night turns up in\nplaces like this. A burly grease-stained COOK stands over\nthe grill. A JUNKIE shuffles from one side of the door to\nanother. Slouched over the small four-person formica tables\nare several WELL-DRESSED BLACKS (too well-dressed for this\ntime and place), a cluster of STREET PEOPLE and a lost OLD\nCOOT who hangs onto his cup of coffee as if it were his last\npossession.\n\nThe restaurant, brightly lit, perfectly conveys the image\nurban plasticity - without the slightest hint of an\naccompanying cleanliness.\n\nToward the rear of the restaurant sit three cabbies: WIZARD,\na worn man about fifty, DOUGH-BOY, younger family man,\nCHARLIE T., fourtyish Black.\n\nWizard is telling Dough-Boy a story. Charlie T., his elbows\npopped against table top, is not listening. He stares\nsilently down at a plate of cold scrambled eggs and a Racing\nForum. His eyes may not be open.\n\n                         WIZARD\n            First she did her make-up. You\n            know, I hate it when they do that.\n            I mean she does the whole works,\n            the mascara, the eye-shadow, the\n            lipstick, the rouge...\n\n                                                           18.\n\n\n                         DOUGH-BOY\n            Not rouge. Blush-On, they call it.\n\n                         WIZARD\n            The kind with a brush.\n\nTravis appears at the door. He has to push aside the JUNKIES\nto enter without making physical contact - something Travis\nwould not relish. He may be repulsed with these people and\nthis place, but he is too much a part of this to let his\nfeelings rise to the surface.\n\nWizard gives Travis a perfunctory wave.\n\n                         WIZARD\n            Travis.\n\n                         TRAVIS\n            Hey Wizard.\n\nTravis straddles a seat at the table. Dough-Boy gives Travis\nsomething between a wink and an eye-twitch saying:\n\n                         DOUGH-BOY\n            Yeah, that's Blush-On. My wife uses\n            it,\n\n                         WIZARD\n                   (ironic)\n            Ask Travis. He's the ladies man.\n\nTravis shrugs and motions for a cup of coffee.\n\n                         WIZARD\n                   (continuing)\n            Well, whatever the fuck it is, she\n            used it. And then the spray perfume.\n            You know, the real sweat kind -\n            and, on top of that, get this,\n            right when we're crossing the Tri-\n            boro bridge - she changes her\n            pantyhose!\n\n                         DOUGH-BOY\n            No.\n\nTravis turns his head. He appears not to be interested, but\nis.\n\n                         WIZARD\n            Yeah.\n\n                         DOUGH-BOY\n            Could you see anything?\n\n                                                           19.\n\n\n                         WIZARD\n            Well, she was trying to keep her\n            skirt down, sort of, you know. But\n            it was pretty obvious what she was\n            doing. I mean, Christ, it was rush\n            hour and the traffic's practically\n            standing still.\n\n                         DOUGH-BOY\n            What did you do?\n\n                         WIZARD\n            Threw on the emergency, jumped the\n            seat and fucked her brains out -\n            What do you think!\n                   (they laugh)\n            What do I have to do? Draw you a\n            picture?\n\n                         DOUGH-BOY\n            Yeah.\n\n                         WIZARD\n            What was I supposed to do? I was\n            watching in the rear view. You\n            know, just checkin' traffic.\n                   (to Travis)\n            So howsit?\n\n                         TRAVIS\n                   (w/o inflection)\n            Some fleet driver for Bell just cut\n            up. Just heard it on the radio.\n\n                         DOUGH-BOY\n            Stick up?\n\nA WAITRESS brings Travis' coffee and a glass of water. He\nasks for a cheeseburger.\n\n                         WIZARD\n            Sure. What do you think? She wanted\n            to get out of the cab. I said\n            \"Look, you're in the middle of the\n            fucking bridge...\"\n\n                         DOUGH-BOY\n            You said that?\n\n                         WIZARD\n            Well, I said, \"Lady, please, we're\n            on a bridge...\"\n\n                                                           20.\n\n\n                         DOUGH-BOY\n            And what happened?\n\nTravis awaits Wizard's answer.\n\n                         WIZARD\n            She stayed in the cab, what's she\n            gonna do? but she stiffed me. A\n            real skunk.\n\n                         DOUGH-BOY\n            A real skunk.\n\nWizard realizes Travis and Dough-Boy may not have met.\n\n                         WIZARD\n                   (paternal)\n            Travis, you know Dough-Boy, Charlie\n            T.?\n\nCharlie T. nods sleepily. Travis indicates he knows Dough-Boy.\n\n                         DOUGH-BOY\n            Yeah. We went to Harvard together.\n                   (laughs)\n\n\n                         WIZARD\n            We call him Dough-Boy cause he\n            likes the dollars. He'll chase a\n            buck straight into Jersey.\n\n                         DOUGH-BOY\n            Look who's talking?\n                   (gestures around table)\n            Who else would stay up all night to\n            catch the morning rush hour?\n\nTravis sips his coffee. Charlie T.'s eyelids slip shut.\n\n                         WIZARD\n                   (to Travis)\n            So howsit?\n\n                         TRAVIS\n                   (w/o inflection)\n            Some fleet driver for Bell just got\n            cut up.  Just heard it on the radio.\n\n                         DOUGH-BOY\n            Stick up?\n\n                                                           21.\n\n\n                         TRAVIS\n            No, just some crazy fucker. Cut\n            have his ear off.\n\n                         DOUGH-BOY\n            Where.\n\n                         TRAVIS\n            In the jungle. 122nd.\n\nTravis' eyes turn toward the restaurant's other patrons.\n\nPOV: THREE STREET PEOPLE sitting at a table. One GUY,\nstoned, stares straight ahead. A raggedly attractive GIRL\nrest her head on the shoulder of the other, a heavily\nbearded YOUNG MAN with a headband.  They kiss and tease each\nother, momentarily lost in their separate world.\n\nTravis watches the hippie couple closely, his feeling\nsharply divided between cultural contempt and morose jealousy.\nWhy should these people enjoy the love and intimacy that has\nalways eluded him? He must enjoy these schizoid emotions,\nbecause his eyes dwell on the couple.\n\n                         DOUGH-BOY\n                   (changing the subject)\n            You run all over town, don't you,\n            Travis?\n\n                         WIZARD\n                   (referring to 122nd St.)\n            Fuckin' Mau Mau land, that's what\n            it is.\n\nTravis turns back to his companions.\n\n                         TRAVIS\n            Huh?\n\n                         DOUGH-BOY\n            I mean, you handle some pretty\n            rough traffic, huh?\n\n                         TRAVIS\n                   (catching on)\n            I have.\n\n                         DOUGH-BOY\n            You carry a piece? You need one?\n\n                         TRAVIS\n            Nah.\n                   (a beat)\n            I suppose not.\n\n                                                           22.\n\n\nWaitress slaps down smudge-marked glass of water, and a\ncheeseburger plate that looks more like a shrunken head on a\nserving platter.\n\n                         DOUGH-BOY\n            Well, you ever need one, I know a\n            feller that kin getcha a real nice\n            deal. Lotsa shit around.\n\n                         WIZARD\n            The cops and company raise hell\n            they find out.\n\nTravis drops two Alka-Seltzer into his glass of water.\n\n                         DOUGH-BOY\n            Truck drivers bring up Harlem\n            Specials that blow up in your hand.\n            But this guy don't deal no shit.\n            Just quality. If you ever need\n            anything, I can put you in touch.\n\n                         WIZARD\n            For a fee.\n\n                         DOUGH-BOY\n            For a fee.\n\n                         WIZARD\n            I never use mine. But it's a good\n            thing to have. Just as a threat.\n\n                         DOUGH-BOY\n                   (getting up)\n            well, if there's this many hackies\n            inside, there must be lots of hares\n            outside. And I'm gonna hustle 'em.\n\n                         WIZARD\n            What ya gonna do with all that\n            money, Dough-Boy?\n\n                         DOUGH-BOY\n            Support my kids. Can you dig it?\n                   (pause)\n            nice to meet ya, Travis. So long,\n            Wizard. Say hello to Malcolm X for\n            me.\n                   (nods to Charlie T.)\n\n\nCharlie T. remains unmoved: He is sleeping.\n\n                                                           23.\n\n\nDough-Boy exits. Travis smiles perfunctorily, then looks\nback at Wizard. They really don't have much to talk about,\nand the Wizard doesn't care to manufacture any more\nconversations.\n\nTravis scans the greasy spoon: The scene is unchanged.\n\n                                            CUT TO:\n\nEXT. PALANTINE HEADQUARTERS - ANOTHER DAY\n\nTraffic passes.\n\nINT. PALANTINE HEADQUARTERS\n\nTom and Betsy are talking. She takes out a cigarette. He\ntakes out matches to light it.\n\n                         BETSY\n            Try holding the match like this.\n\n                         TOM\n            This is gotta be a game, right?\n\n                         BETSY\n                   (putting on glasses)\n            This I gotta see.\n\n                         TOM\n                   (burning fingers)\n            Ouch!\n\n                         BETSY\n                   (giggling)\n            Oh, are you all right?\n\n                         TOM\n            I'm great. Always set my fingers on\n            fire. If you want to see another\n            trick. I do this thing with my nose.\n\n                         BETSY\n            No. I just wanted to see if you\n            could light it that way. The guy at\n            the newsstand can.\n\n                         TOM\n            Ah, yes, the guy at the newsstand,\n            Mr. Asbestos...\n\n                         BETSY\n            He happens to be missing fingers. I\n            first noticed when -\n\n                                                           24.\n\n\n                         TOM\n            Is he Italian?\n\n                         BETSY\n            No, why?\n\n                         TOM\n            You sure he's not Italian?\n\n                         BETSY\n            He's Black, OK?\n\n                         TOM\n            Well, If he had been Italian, they\n            could have been shot off. Sometimes\n            the mob does that to teach guys a\n            lesson, If they blow a job or\n            something.\n\n                         BETSY\n            As I said, he isn't Italian.\n            Besides, I thought they just killed\n            them.\n\n                         TOM\n            Don't be naive. They can't kill\n            everybody. They have different\n            punishments for different things.\n            Like, if they kill a stool pidgeon,\n            they leave a canary on the body.\n            It's symbolic.\n\n                         BETSY\n            Why don't they leave a pidgeon\n            instead of a canary?\n\n                         TOM\n            I don't know. Maybe they don't\n            leave a canary. Don't be technical.\n            What I'm saying is if this newsstand\n            guy's Italian and his fingers are\n            gone, maybe he's a thief.\n\n                         BETSY\n            First, he's not Italian. Second\n            he's not a thief. I noticed the\n            fingers when he was getting my\n            change - the right change. Two of\n            his fingers are missing. Just stubs.\n            Like they were blown away. I was\n            putting my change in my purse when\n            I saw him get out a cigarette. I\n            couldn't help watching. I was dying\n            to see how he'd light it.\n\n                                                           25.\n\n\n                         TOM\n            With the other hand, right?\n\n                         BETSY\n            No, stupid. With the stubs. That's\n            the whole point.\n\n                         TOM\n            I know that guy. His hand looks\n            like a paw. An old Black guy, the\n            newsstand at -\n\n                         BETSY\n            No, this is young - well, I'm never\n            sure how old Black people are -\n            but, anyway, he isn't old. That's\n            for sure.\n\n                         TOM\n            Show me how he did that again.\n\nEXT. ACROSS THE STREET FROM HEADQUARTERS\n\nTravis is striding briskly across Broadway toward the\nPalantine Headquarters.\n\nHe s dressed the best we have seen him; his pants (not\njeans) are pressed, his boots shined, his hair combed. Under\nhis Army jacket he wears a freshly laundered shirt and ivy\nleague tie. He drops his cigarette, steps on it and walks in.\n\nWatching Travis enter Palantine's Headquarters, we are\nsurprised to realize that Travis is really quite attractive.\nHis deformities are psychological, not physical. He believes\nhe is cursed, and therefore he is.\n\nTravis walks briskly into the office, and heads toward\nBetsy's desk.  Tom walks over to greet him, but Travis\nignores him.\n\n                         TRAVIS\n                   (at Betsy's desk)\n            I want to volunteer.\n\nAs the CAMERA examines Travis' face more closely, one can\nsee the hollowness wrought by lack of sleep and sufficient\ndiet.\n\n                         TOM\n                   (at Betsy's desk)\n            If you'll come this way.\n\nTravis elbows Tom off.\n\n                                                           26.\n\n\n                         TRAVIS\n                   (to Betsy)\n            No. I want to volunteer to you.\n\n                         TOM\n                   (under his voice)\n            Bets.\n\nBETSY waves TOM off with a short gesture, indicating\neverything is OK.  He walks away.\n\n                         BETSY\n                   (curious)\n            And why is that?\n\nTRAVIS is on his best behavior.  He smiles slightly:\n\n                         TRAVIS\n            Because you are the most beautiful\n            woman I have ever seen.\n\nBETSY is momentarily taken back, but pleased. TRAVIS'\npresence has a definite sexual charge. He has those star\nqualities BETSY looks for: She senses there is something\nspecial about the young man who stands before her. And then,\ntoo, there is that disarming smile. He is, as Betsy would\nsay, \"fascinating\".\n\n                         BETSY\n                   (smiling)\n            Is that so?\n                   (pause)\n            But what do you think of Charles\n            Palantine?\n\n                         TRAVIS\n                   (his mind elsewhere)\n            Who mam?\n\n                         BETSY\n            Charles Palantine. The man you want\n            to volunteer to help elect president.\n\n                         TRAVIS\n            Oh, I think he's a wonderful man.\n            Make a great, great President.\n\n                         BETSY\n            You want to canvass?\n\n                         TRAVIS\n            Yes, mam.\n\n                                                           27.\n\n\nBetsy is interviewing Travis, but she is also teasing him a\nlittle, leading him on in a gentle feminine way:\n\n                         BETSY\n            How do you feel about Senator\n            Palantine's stand on welfare?\n\nThis takes TRAVIS back a bit.  He obviously doesn't have the\nslightest idea what Palantine's stand on welfare is, in\nfact, he doesn't have any idea about politics whatsoever.\nTRAVIS thinks a moment, then improvises an answer:\n\n                         TRAVIS\n            Welfare, mam? I think the Senator's\n            right. People should work for a\n            living. I do. I like to work. Every\n            day. Get those old coots off\n            welfare and make 'em work for a\n            change.\n\nBetsy does a subtle double-take: This isn't exactly\nPalantine's position on welfare. She remain intrigued by\nTravis.\n\n                         BETSY\n            Well, that's not exactly what the\n            Senator has proposed. You might not\n            want to canvass, but there is\n            plenty more other work we need\n            done: Office work, filing, poster\n            hanging.\n\n                         TRAVIS\n            I'm a good worker, Betsy mam, a\n            real good worker.\n\n                         BETSY\n                   (gesturing)\n            if you talk to Tom, he'll assign\n            you to something.\n\n                         TRAVIS\n            If you don't mind, mam, I'd rather\n            work for you.\n\n                         BETSY\n            Well, we're all working tonight.\n\n                         TRAVIS\n            Well, Betsy mam, I drive a taxi at\n            night.\n\n                                                           28.\n\n\n                         BETSY\n            Well, then, what is it you exactly\n            want to do?\n\n                         TRAVIS\n                   (bolstering courage)\n            If you don't mind, mam, I'd be\n            mighty pleased if you'd go out and\n            have some coffee and pie with me.\n\nBetsy doesn't quite know what to make of Travis. She is\ncurious, intrigued, tantalized. Like a moth, she draws\ncloser to the flame.\n\n                         BETSY\n            Why?\n\n                         TRAVIS\n            Well, Betsy mam, I drive by this\n            place here in my taxi many times a\n            day. And I watch you sitting here\n            at this big long desk with these\n            telephones, and I say to myself,\n            that's a lonely girl. She needs a\n            friend. And I'm gonna be her friend.\n                   (smiles)\n\n\nTravis rarely smiles, but when he does his whole face glows.\nIt is as if he is able to tap an inner reserve of charm\nunknown even to himself.  Betsy is completely disarmed.\n\n                         BETSY\n            I don't know...\n\n                         TRAVIS\n            It's just to the corner, mam. In\n            broad daytime. Nothing can happen.\n            I'll be there to protect you.\n\n                         BETSY\n                   (smiles)\n            All right.\n                   (relents)\n            All right. I'm taking a break at\n            four o'clock. If you're here then\n            we'll go to the corner and have\n            some coffee and pie.\n\n                         TRAVIS\n            Oh, I appreciate that, Betsy mam.\n            I'll be here at four o'clock\n            exactly.\n                   (pause)\n            And... ah... Betsy...\n\n                                                           29.\n\n\n                         BETSY\n            Yes?\n\n                         TRAVIS\n            My name is Travis.\n\n                         BETSY\n            Thank you, Travis.\n\nTravis nods, turns and exits.\n\nTom, who has been watching this interchange with a pseudo-\nstandoffish (actually jealous) air, steps over to Betsy. His\nmanner demands some sort of explanation of what Betsy was\ndoing.\n\nBetsy simply shrugs (it's really none of his business) and\nsays:\n\n                         BETSY\n            I'm just going to find out what the\n            cabbies are thinking.\n\n                                            CUT TO:\n\nTravis is pacing back and forth on Broadway just beyond the\nPalantine Headquarters. He checks his watch.\n\n                         TRAVIS (V.O.)\n            April 26, 1972. Four o'clock p.m. I\n            took Betsy to the Mayfair Coffee\n            Shop on Broadway...\n\nINT. COFFEE SHOP\n\nTravis and Betsy are sitting in a booth of a small New York\nCoffee Shop. They both have been served coffee; Travis is\nnervously turning his cup around in his hands.\n\nAs Travis speaks V.O., WAITRESS brings their orders: Apple\npie for TRAVIS, fruit compote for BETSY.\n\n                         TRAVIS (V.O.)\n            I had black coffee and apple pie\n            with a slice of melted yellow\n            cheese.  I think that was a good\n            selection. Betsy had coffee and a\n            fruit salad dish. She could have\n            had anything she wanted.\n\nBetsy's conversation interrupts Travis' V.O.:\n\n                                                           30.\n\n\n                         BETSY\n            We've signed up 15.000 Palantine\n            volunteers in New York so far. The\n            organizational problems are becoming\n            just staggering.\n\n                         TRAVIS\n            I know what you mean. I've got the\n            same problems. I just can't get\n            things organized. Little things, I\n            mean. Like my room, my possessions.\n            I should get one of those signs\n            that says, \"One of these days I'm\n            Gonna Organezizied\".\n\nTravis contorts his mouth to match his mispronunciation,\nthan breaks into a big, friendly, infectious grin. The very\nsight of it makes one's heart proud.\n\nBetsy cannot help but be caught up in Travis' gin. Travis'\ncontagious, quicksilver moods cause:\n\n                         BETSY\n                   (laughing)\n            Travis, I never ever met anybody\n            like you before.\n\n                         TRAVIS\n            I can believe that.\n\n                         BETSY\n            Where do you live?\n\n                         TRAVIS\n                   (evasive)\n            Oh, uptown. You know. Some joint.\n            It ain't much.\n\n                         BETSY\n            So why did you decide to drive a\n            taxi at night?\n\n                         TRAVIS\n            I had a regular job for a while,\n            days. You know, doin' this, doin'\n            that. But I didn't have anything to\n            do at night. I got kinda lonely,\n            you know, just wandering around. So\n            I decided to works nights. It ain't\n            good to be alone, you know.\n\n                         BETSY\n            After this job, I'm looking forward\n            to being alone for a while.\n\n                                                           31.\n\n\n                         TRAVIS\n            Yeah, well...\n                   (a beat)\n            In a cab you get to meet people.\n            You meet lotsa people. It's good\n            for you.\n\n                         BETSY\n            What kind of people?\n\n                         TRAVIS\n            Just people people, you know. Just\n            people.\n                   (a beat)\n            Had a dead man once.\n\n                         BETSY\n            Really?\n\n                         TRAVIS\n            He'd been shot. I didn't know that.\n            He just crawled into the back seat,\n            said \"West 45th Street\" and conked\n            out.\n\n                         BETSY\n            What did you do?\n\n                         TRAVIS\n            I shot the meter off, for one thing.\n            I knew I wasn't goimg to get paid.\n            Then I dropped him off at the cop\n            shop. They took him.\n\n                         BETSY\n            That's really something.\n\n                         TRAVIS\n            Oh, you see lots of freaky stuff in\n            a cab. Especially when the moon's\n            out.\n\n                         BETSY\n            The moon?\n\n                         TRAVIS\n            The full moon. One night I had\n            three or four weirdoes in a row and\n            I looked up and, sure enough, there\n            it was - the full moon.\n\nBetsy laughs. Travis continues:\n\n                                                           32.\n\n\n                         TRAVIS\n            Oh, yeah. People will do anything\n            in front of a taxi driver. I mean\n            anything. People too cheap to rent\n            a hotel room, people scoring dope,\n            people shooting up, people who want\n            to embarrass you.\n                   (a bitterness emerges)\n            It's like you're not even there,\n            not even a person. Nobody knows you.\n\nBetsy cuts Travis' bitterness short:\n\n                         BETSY\n            Com'on, Travis. It's not that bad.\n            I take lots of taxis.\n\n                         TRAVIS\n            I know. I could have picked you up.\n\n                         BETSY\n            Huh?\n\n                         TRAVIS\n            Late one night. About three. At the\n            plaza.\n\n                         BETSY\n            Three in the morning? I don't think\n            so. I have to go to bed early. I\n            work days. It must have been\n            somebody else.\n\n                         TRAVIS\n            No. It was you. You had some manila\n            folders and a pink bag from Saks.\n\nBetsy, realizing Travis remembers her precisely, scrambles\nfor a polite rationale for her behavior:\n\n                         BETSY\n            You're right! Now I remember! It\n            was after the Western regional\n            planners were in town and the\n            meeting went late. The next day I\n            was completely bushed. It was\n            unbelievable.\n\n                         TRAVIS\n            If it wasn't for a drunk I would\n            have picked you up. He wanted to go\n            to the DMZ.\n\n                                                           33.\n\n\n                         BETSY\n            The DMZ?\n\n                         TRAVIS\n            South Bronx. The worst. I tried to\n            ditch him, but he was already in\n            the cab, so I had to take him.\n            That's the law. Otherwise I would\n            have picked you up.\n\n                         BETSY\n            That would have been quite a\n            coincidence.\n\n                         TRAVIS\n            You'd be surprised how often you\n            see the same people, get the same\n            fare. People have patterns. They do\n            more or less the same things every\n            day. I can tell.\n\n                         BETSY\n            Well, I don't go to the Plaza every\n            night.\n\n                         TRAVIS\n            I didn't mean you. But just ordinary\n            people. A guy I know - Dough-Boy -\n            met his wife that way. They got to\n            talking. She said she usually\n            caught the bus so he started\n            picking her up at the bus stop,\n            taking her home with the flag up.\n\n                         BETSY\n            That's very romantic. Some of your\n            fares must be interesting. See any\n            stars, politicians, deliver any\n            babies yet?\n\n                         TRAVIS\n            Well, no... not really... had some\n            famous people in the cab.\n                   (remembering)\n            I got this guy who makes lasers.\n            Not regular lasers, not the big\n            kind. Little lasers, pocket sized,\n            small enough to clip your belt like\n            a transistor radio, like a gun, you\n            know. Like a ray gun. Zap.\n\n                         BETSY\n                   (laughs)\n            What hours do you work?\n\n                                                           34.\n\n\n                         TRAVIS\n            I work a single, which means\n            there's no replacement - no second\n            man on the cab. Six to six,\n            sometimes eight. Seventy-two hours\n            a week.\n\n                         BETSY\n                   (amazed)\n            You mean you work seventy-two hours\n            a week.\n\n                         TRAVIS\n            Sometimes 76 or 80. Sometimes I\n            squeeze a few more hours in the\n            morning. Eighty miles a day, a\n            hundred miles a night.\n\n                         BETSY\n            You must be rich.\n\n                         TRAVIS\n                   (big affectionate smile)\n            it keeps ya busy.\n\n                         BETSY\n            You know what you remind me of?\n\n                         TRAVIS\n            What?\n\n                         BETSY\n            That song by Kris Kristofferson,\n            where it's said \"Like a pusher,\n            party truth, partly ficition, a\n            walking contradiction\".\n                   (smiles)\n\n\n                         TRAVIS\n            I'm no pusher, Betsy. Honest. I\n            never have pushed.\n\n                         TRAVIS\n            I didn't mean that, Travis. Just\n            the part about the contradiction.\n\n                         TRAVIS\n                   (more at ease)\n            Oh. Who was that again?\n\n                         BETSY\n            The singer?\n\n                                                           35.\n\n\n                         TRAVIS\n            Yeah. Yes. I don't follow music too\n            much.\n\n                         BETSY\n                   (slowly)\n            Kris Kristofferson.\n\nTravis looks at Betsy intently and they exchange smiles.\n\n                                            CUT TO:\n\nTravis is walking confusedly around SAM GOODY'S at MIDDAY,\nobviously unable to locate what he desires.\n\nTravis is lost among the hip, young intellectual type that\npopulate the store. He watches the stylish, attractive\nfemale help, unable to come right out and requests what he\ndesires.\n\nA young SALESGIRL sees his plight, walks over and asks if he\nneeds any help. Travis INAUDIBLY says a name to her, although\nthe name is obviously Kris Kristofferson.\n\nThe Salesgirl digs out Kristofferson's \"Silver-Tongued\nDevil\" album for him.\n\nTravis says something additional to the Salesgirl and she\ngoes off to gift-wrap the album.\n\nTravis emerges from the RECORD STORE, the brightly gift-\nwrapped album proudly tucked under his arm.\n\n                                            CUT TO:\n\nA lengthy POV SHOT from Travis' vantage point behind the\nwheel.\n\nWe see the city as Travis sees it. The front windshield is a\nlittle dirty, the lighted meter just up at the low right\nscreen. The intercom crackles with STATIC and MESSAGES.\n\nThe light turns green; we take off with a start. A short\nfirst gear - quick shift - a long second gear. The cab eases\nto the right of the street, checking out prospective fares.\n\nOur eyes scan the long lines of PEDESTRIANS. The regular -\nbums, junkies, tourists, hookers, homosexuals, hippies -\nthey mean nothing now. They only blend into the sidewalks\nand lighted storefronts.\n\nOur eyes now concentrate on those that step away from the\ncurb - is that man hailing a cab or scratching his head?\n\n                                                           36.\n\n\nIn the next block there are perhaps three, four fares -\nquick gas-up through this yellow light - brake sharply -\ncheck the action. The first: Tourist, nickel tipper - let\nthe next guy pick them up. Let the second go also, the\nthird - there's a live fare. Middle-aged LOCAL WOMAN: Short\nfare to the East Side, good tip.\n\nWe pull to the curb, waiting for her to get in. It is a long\nwait - a Black STREET WALKER crosses in front of the cab. We\nfocus on (as Travis would) a YOUNG COUPLE embracing in the\ndistance.\n\nAs we travel, we hear Travis' random thoughts about selecting\nfares and tips:\n\n                         TRAVIS (V.O.)\n            You work at night, you get an\n            instinct. You can smell them. The\n            big tippers, the stiffs, the\n            trouble makers. Quarter is good tip\n            for Manhattan. Queens is better,\n            Brooklyn is best. go for the guys\n            with suitcases. The rich are the\n            worst tippers, hooks are lousy.\n            Spooks are okay, but they don't\n            live at Park Ave after all.\n\nThe meter is activated: $.60 registers. Tick, tick, tick. A\nquick glance shows the woman is now seated. She says softly,\n\"192 East 89\".  We take off with another jolt. Cross back up\n9th Ave, then cut through the park.\n\nWe're zooming up 9th Ave - how many green lights can we\nstring together? Somebody steps out to hail the cab, but\nquickly steps back again. The meter is up $.90. It'll be a\n$1.40 fare.\n\nNow through the park and we're almost there. Check the\nnumbers - 134 - 140. End of the block. Fare=$1.40.\n\nCheck back mirror - she's getting out two bills. Two quarters\nand a dime change. Tip'll be either.25 or .35.\n\nThe tip comes back: 35 cents - good tip. Good lady. We take\noff again with a jolt.\n\nThis is Travis' world: Dark side streets, garish glaring\nmain streets, quick glances, quicker evaluations - a dozen\ninstantaneous decisions a minute. Are these people, are\nthese objects?\n\nEXT. TRAVIS' TAXI speed down darkened street.\n\nTravis lets off a fare and pulls into line at the Plaza.\n\n                                                           37.\n\n\n                         TRAVIS (V.O.)\n            I called Betsy again at her office,\n            and she said maybe we could go to a\n            movie together after she gets off\n            work tomorrow. That's my day off.\n            At first she hesitated, but I\n            called her again and she agreed.\n                   (pause)\n            Betsy. Betsy what? I forgot to ask\n            her last name again.  Damn. I've\n            got to remember stuff like that.\n\nTravis' thoughts are with Betsy, as THREE MEN enter Travis'\ncab. He activates the meter and pulls off.\n\n                         MAN'S VOICE\n            St. Regis Hotel.\n\nTravis checks the mirror. Scanning across the back seat, he\nrecognizes the middle passenger. It is CHARLES PALANTINE,\ncandidate for President.  He must have left the Hotel\nshortly after BETSY.\n\nTom, seated on the jump seat, checks his watch and speaks\ndeferentially to Palantine:\n\n                         TOM\n            It's 12:30 now. You'll have fifteen\n            minutes before the actual luncheon\n            begins.\n\nPalantine nods as his assistant picks up the thread of an\nearlier conversation.\n\n                         ASSISTANT\n            I don't think we have to worry\n            about anybody here committing\n            themselves until things start\n            coming in from California.\n\nTravis recognizes his passenger. He puts out his cigarette.\n\n                         TRAVIS\n                   (interrupting)\n            Say, aren't you Charles Palantine,\n            the candidate?\n\n                         PALANTINE\n                   (only mildly irritated)\n            Yes I am.\n\n                                                           38.\n\n\n                         TRAVIS\n            Well, I'm one of your biggest\n            supporters. I tell everybody that\n            comes in this cab that they should\n            vote for you.\n\n                         PALANTINE\n                   (pleased; glances to\n                   check Travis' license)\n            Why, thank you Travis.\n\n                         TRAVIS\n            I'm sure you'll win, sir. Everybody\n            I know is going to vote for you.\n                   (a beat)\n            I was going to put one of your\n            stickers on my taxi but the company\n            said it was against their policy.\n\n                         PALANTINE\n                   (pleasant)\n            I'll tell you, Travis, I've learned\n            more about this country sitting in\n            taxi cabs than in the board room of\n            General Motors.\n\n                         TOM\n                   (joking)\n            And in some other places too...\n\nPalantine, his Assistant and Tom all laugh. Palantine,\nquickly reassuming candiorial mien, speaks to Travis:\n\n                         PALANTINE\n            Travis, what single thing would you\n            want the next President of this\n            country to do most?\n\n                         TRAVIS\n            I don't know, sir. I don't follow\n            political issues much.\n\n                         PALANTINE\n            There must be something...\n\n                         TRAVIS\n                   (thinks)\n            Well, he should clean up this city\n            here. It's full of filth and scum.\n            Scum and filth. It's like an open\n            sewer. I can hardly take it.\n                         (MORE)\n\n                                                           39.\n\n\n                         TRAVIS (CONT'D)\n            Some days I go out and smell it\n            then I get headaches that just stay\n            and never go away. We need a\n            President that would clean up this\n            whole mess.  Flush it out.\n\nPalantine is not a Hubert Humphrey-type professional\nbullshitter, and Travis' intense reply stops him dead in his\ntracks. He is forced to fall back on a stock answer but\ntries to give it some meaning.\n\n                         PALANTINE\n                   (after a pause)\n            I know what you mean, Travis, and\n            it's not going to be easy. We're\n            going to have to make some radical\n            changes.\n\n                         TRAVIS\n                   (turning the wheel)\n            Damn straight.\n\nEXT. BARCLAY HOTEL\n\nTRAVIS' taxi pulls up in front of the Barclay Hotel.\n\nPALANTINE and AIDE get out of the cab. SECOND AIDE stays in\nback seat a moment to pay TRAVIS.\n\nPALANTINE looks in front window of cab momentarily and nods\ngoodbye to TRAVIS.\n\n                         PALANTINE\n            Nice talking to you, Travis.\n\n                         TRAVIS\n                   (calling back)\n            Thank you, sir. You're a good man,\n            sir.\n\nTravis' taxi departs.\n\nPALANTINE and AIDES walk up carpet to the St. Regis.\n\nCAMERA CLOSES IN on PALANTINE as he stops, turns back and\nwatches Travis' departing taxi.\n\nPALANTINE turns back and ascends the hotel steps with his\nAIDES.\n\n                                                           40.\n\n\nEXT. MANHATTAN STREET - EARLY MORNING\n\nTRAVIS, dressed to the teeth, walks brightly down the\nsidewalk. His face is frehsly shaved, his hair combed, his\ntie straightened.\n\nHe pauses in a store window to check his appearance.\n\nUnder his arm he carries the gift-wrapped Kristofferson\nrecord album.\n\nOUTSIDE PALANTINE HEADQUARTERS\n\nBETSY, smartly dressed, waves goodbye to another CAMPAIGN\nWORKER and walks out the door to greet him.\n\nA SHORT WHILE LATER, TRAVIS and BETSY are walking down\nBroadway toward Times Square. BETSY does not let their\nbodies touch as they walk although TRAVIS contemplates\nedging closer to her.\n\nBetsy has opened the package and is admiring the record -\nor, rather, Travis' sentiment behind giving it.\n\nTravis looks around himself with pride: This is a moment in\nhis life - one of the few.\n\n                         BETSY\n            You didn't have to spend your\n            money - ?\n\n                         TRAVIS\n                   (interrupting)\n            He'll, what else can I do with it\n            all?\n\nBetsy notices that the seal on the record has not been broken.\n\n                         BETSY\n            Travis, you haven't even played the\n            record?\n\n                         TRAVIS\n                   (evasive)\n            Yeah, well my stereo player is\n            broke. But I'm sure the record is OK.\n\n                         BETSY\n            Your stereo broke? God, I could\n            hardly stand that. I live on music.\n\n                                                           41.\n\n\n                         TRAVIS\n            I don't follow music much. I'd like\n            to though.\n                   (second thought)\n            Honest.\n\n                         BETSY\n                   (pointing to album)\n            So you haven't heard this record yet?\n\n                         TRAVIS\n            No.\n                   (sly smile)\n            I thought maybe you could play it\n            for me on your player.\n\nBetsy's face backtracks a bit. Maybe she was wrong to go out\nwith this fellow she doesn't know.\n\nShe makes a polite laugh.\n\nLATER.  Travis and Betsy are in TIMES SQUARE, turning the\ncorner from Broadway to 42nd Street. Travis carries the\nalbum under his arm.\n\nThey approach the garish marquee of a large midtown porno\ntheatre advertising \"The Swedish Marriage Manual\". The box\noffice is flanked on both sides by glass cages filled with\nexplicit publicity stills.  Offending portions have been\nblocked out with black tape.\n\nTravis steps over to the window and buys two $5 tickets.\nBetsy, befuddled, watches him. She doesn't know what to say.\nTravis returns with the tickets.\n\nBetsy still has not fully comprehended what is happening:\n\n                         BETSY\n            What are you doing?\n\n                         TRAVIS\n                   (innocent)\n            I bought a couple of tickets.\n\n                         BETSY\n            But this is a porno movie.\n\n                         TRAVIS\n            No, these are the kind that couples\n            go to. They're not like the other\n            movies. All kinds of couples go.\n            Honest. I've seen them.\n\n                                                           42.\n\n\nTravis seems confused. He is so much part of his own world,\nhe fails to comprehend another's world. Compared to the\nmovies he sees, this is respectable. But then there's also\nsomething that Travis could not even acknowledge, much less\nadmit: That he really wants to get this pure white girl into\nthat dark porno theatre.\n\nTravis makes an awkward gesture to escort Betsy into the\ntheatre. Betsy looks at the tickets, at the theatre, at\nTravis. She mentally shakes her head and walks toward the\nturnstile. She thinks to herself: \"What the Hell. What can\nhappen?\" She's always been curious about these pictures\nanyway, and - like all women, no matter how intelligent -\nshe's been raised not to offend her date. A perverse logic\nwhich applies even more in offsetting circumstances like\nthese.\n\nINSIDE THE THEATER\n\nTravis escorts Betsy to an empty center row. Travis was\nright. Couples do go to films like this. There are at least\nsix or seven other MEN with their bewigged \"DATES\".\n\nTravis settles into his familiar porno theatre slouch. Betsy\nlooks curiously from side to side.\n\nON SCREEN, a conservatively-dressed middle-aged woman is\nspeaking in Swedish about importance of healthy sex life in\na happy marriage.  Subtitles translate her words. Then,\nwithout warning, there is a direct CUT to a couple copulating\non a sterile table-like bed.\n\nTravis watches intently. The color, however, is slowly\ndraining from Betsy's cheeks. One thought fills her mind:\n\"What am I doing here?\"\n\n                         TRAVIS\n                   (to himself)\n            Damn.\n\n                         BETSY\n            What's wrong?\n\n                         TRAVIS\n            I forgot to get the Coca-Cola.\n\nThat does it. Betsy just looks at him for a moment, then\ngets up and starts to leave. Travis, confused, hustles after\nher.\n\nHe follows her out of the theatre.\n\n                                                           43.\n\n\nON THE SIDEWALK\n\nTravis catches up with her.\n\n                         TRAVIS\n            Where are you going?\n\n                         BETSY\n            I'm leaving.\n\n                         TRAVIS\n            What do you mean?\n\nBetsy looks at Travis, trying to understand him:\n\n                         BETSY\n            These are not the kind of movies I\n            go to.\n\n                         TRAVIS\n            Well, I don't follow movies too\n            much...\n\n                         BETSY\n            You mean these are the only kind of\n            movies you go to?\n\nThe TICKET GIRL watches expressionlessly from the booth.\n\n                         TRAVIS\n            This is sort of high class...\n\n                         BETSY\n            I mean porno movies.\n\n                         TRAVIS\n                   (hesitant)\n            Well... mostly...\n\n                         BETSY\n            My God!\n\n                         TRAVIS\n            We can go to another movie if you\n            like, I don't care. I got money.\n            There's plenty...\n\nTravis gestures toward the long row of 42nd Street marquees,\nbut is interrupted by Betsy:\n\n                         BETSY\n            If you just wanted to fuck, why\n            didn't you just come right out and\n            say it?\n\n                                                           44.\n\n\nTravis is flabbergasted by Betsy's blunt language. His arm\nstill gestures toward the marquees, his lips continue to\nmove, but words do not come out.\n\nUnable to respond to Betsy's question, Travis picks up where\nhe left off:\n\n                         TRAVIS\n            ... there's plenty of movies around\n            here. I haven't seen any of them,\n            but I'm sure they're good.\n\n                         BETSY\n            No, Travis. You're a sweet guy and\n            all that, but I think this is it.\n            I'm going home.\n\n                         TRAVIS\n                   (interrupting)\n            You mean you don't want to go to a\n            movie?\n                   (a beat)\n            There's plenty of movies around here.\n\n                         BETSY\n            No, I don't feel so good. We're\n            just two very different kinds of\n            people, that's all.\n\n                         TRAVIS\n                   (puzzled)\n            Huh?\n\n                         BETSY\n            It's very simple. You go your way,\n            I'll go mine. Thanks anyway, Travis.\n\n                         TRAVIS\n            But... Betsy...\n\n                         BETSY\n            I'm getting a taxi.\n\nShe walks to the curb.\n\n                         TRAVIS\n                   (following her)\n            What about the record?\n\n                         BETSY\n            Keep it.\n\n                         TRAVIS\n            Can I call you?\n\n                                                           45.\n\n\nBetsy looks for a cab.\n\n                         TRAVIS\n                   (tender)\n            Please, Betsy, I bought it for you.\n\nBetsy looks at his sad, sweet face and relents a bit.\n\n                         BETSY\n            All right, I'll accept the record.\n\nBetsy accepts the record, but quickly turns and hails a taxi.\n\n                         BETSY\n            Taxi!\n\nA taxi quickly pulls up.\n\nTravis feebly protests to no one in particular:\n\n                         TRAVIS\n            But I got a taxi.\n\nBetsy gives instructions to CAB DRIVER, looks briefly back\nat Travis, then straight ahead. Taxi speeds off.\n\nTravis looks around helplessly: A cluster of PEDESTRIANS on\nthe crowded street has stopped to watch the argument. Travis\nlooks back at the woman in the porno theatre box office who\nhas also been following the argument.\n\n                                            CUT TO:\n\nINSIDE TRAVIS' APARTMENT\n\nTravis is sitting at the table. There are some new items on\nthe table: His giant econo-sized bottle of vitamins, a giant\necono-sized bottle of aspirins, a pint of apricot brandy, a\npartial loaf of cheap white bread.\n\nOn the wall behind the table hang two more items: A gag sign\nreading \"One of These Days I'm Gonna Get Organezizied\" and\nan orange-and-black bumper sticker for Charles Palantine.\n\n                         TRAVIS (V.O.)\n            May 8, 1972. My life has taken\n            another turn again. The days move\n            along with regularity...\n\nC.U. of notebook: Travis is no longer sitting at the desk.\nThe pencil rests on the open notebook.\n\n                                                           46.\n\n\nLATER THAT DAY: TRAVIS has pulled his straight-backed chair\naround and is watching his small portable TV, which rests on\nthe upright melon crate.\n\nA cereal bowl partially filled with milk rests in his lap.\nTravis pours a couple shots of the apricot brandy into the\nbowl, dips folded chunks of white bread into the mixture,\nand eats them.\n\nTravis is watching early evening NEWS PROGRAM. TV background\nSOUND.  Charles Palantine is being interviewed somewhere on\nthe campaign trail.\n\n                         TRAVIS (V.O.)(CONTD)\n            ... one day indistinguishable from\n            the next, a long continuous chain,\n            then suddenly - there is a change.\n\nBetsy is walking down a midtown street when Travis suddenly\nappears before her. He has been waiting.\n\nTravis tries to make conversation but she doesn't listen.\nShe motions for him to go away and keeps on walking.\n\nTravis, protesting, follows.\n\n                                            CUT TO:\n\nINT. BUILDING - DAY\n\nTravis speaks intensely into a wall pay phone.\n\n                         TRAVIS (V.O.)\n            I tried to call her several times.\n\nWe hear Travis' Voice on the phone.\n\n                         TRAVIS\n                   (smoking a cigarette)\n            you feeling better? You said you\n            didn't feel so good...\n\n                         TRAVIS (V.O.)\n            But after the first call, she would\n            no longer come to the phone.\n\nTravis holds the receiver in his hand. The other party has\nhung up.\n\nTRACKING SHOT across interior lower wall of TRAVIS' APARTMENT.\nAgainst the stark wall there is a row of wilted and dying\nfloral arrangements.  Each one of the four or five bouquets\nis progressively more wilted than the one closer to the door.\nThey have been returned.\n\n                                                           47.\n\n\n                         TRAVIS (V.O.)\n            I also sent flowers with no luck. I\n            should not dwell on such things,\n            but set them behind me. The smell\n            of the flowers only made me sicker.\n            The headaches got worse I think\n            I've got stomach cancer. I should\n            not complain so. \"You're only as\n            healthy as you feel.\"\n\nA drama is acted out at PALANTINE HEADQUARTERS: Travis,\ngroggy and red-eyed from lack of sleep, walks into the\ncampaign headquarters about NOONTIME.\n\nBetsy is standing near the rear of the office; she ducks\nfrom sight when she sees Travis enter. Travis' path is cut\nshort by Tom's large-framed body. There is no live sound.\n\n                         TRAVIS (V.O.)\n            I realize now how much she is like\n            the others, so cold and distant.\n            Many people are like that. They're\n            like a union.\n\nTravis tries to push his way past Tom but Tom grabs him.\nTravis says something sharply to Tom and the two scuffle.\nTom, by far the taller and stronger, quickly overcomes\nTravis, wrenching his arm behind his back.\n\nTravis kicks and protests as Tom leads him to the front door.\n\nON THE SIDEWALK\n\nTravis' efforts quickly subside when Tom motions to a nearby\nPOLICEMAN.  Travis quiets down and walks off.\n\n                                            CUT TO:\n\nEXT.\n\nTravis is again making his way through the garish urban\nnight. He stops for a PASSENGER on PARK AVE. A middle-aging\nprofessorial executive.\n\nC.U. TRAVIS: His face is expressionless.  The MAN makes\nhimself comfortable in the back seat.\n\n                         PROFESSIONAL PASSENGER\n            Jackson Heights.\n\nTravis has no intention of driving out to Jackson Heights\nand coming back with a fare.\n\n                                                           48.\n\n\n                         TRAVIS\n            I'm off duty.\n\n                         PROFESSIONAL PASSENGER\n            You mean you don't want to go out\n            to Jackson Heights?\n\n                         TRAVIS\n            No, I'm off duty.\n\n                         PROFESSIONAL PASSENGER\n            Then how come your \"Off Duty\" light\n            wasn't on.\n\nTRAVIS switches on the \"Off Duty\" light.\n\n                         TRAVIS\n            It was on.\n                   (gesturing toward top\n                   of taxi)\n            it just takes a while to warm up.\n            Like a TV.\n\nTRAVIS doesn't budge. PROFESSIONAL PASSENGER curses to\nhimself and exits cab. Travis takes off.\n\nPOV as Travis' eyes dwell on the young HIP COUPLES coming\nout of a East Side movie house.\n\nLATER THAT NIGHT, TRAVIS pulls over for a young (mid-\ntwenties) MAN wearing a leather sports jacket.\n\nTRAVIS eyes his passenger in rear-view mirror.\n\n                         YOUNG PASSENGER\n            471 Central Park West.\n\nEXT.\n\nTRAVIS' taxi speeds off.\n\nLATER, TRAVIS' taxi slows down as it approaches 400 block of\nCentral Park West.\n\nTravis checks apartment numbers.\n\n                         YOUNG PASSENGER\n            Just pull over to the curb a moment.\n\nTRAVIS turns the wheel.\n\n                         YOUNG PASSENGER\n            Yeah, that's fine. Just sit here.\n\n                                                           49.\n\n\nTRAVIS waits impassively. The motor ticks away.\n\nAfter a long pause, the PASSENGER speaks:\n\n                         YOUNG PASSENGER\n            Cabbie, ya see that light up there\n            on the seventh floor, three windows\n            from this side of the building?\n\nCAMERA CLOSES IN on 417 Central Park West: TRACKING UP to\nthe seventh floor, it moves three windows to the right.\n\n                         TRAVIS (V.O.)\n            Yeah.\n\nA young WOMAN wearing a slip crosses in front of the light.\n\n                         YOUNG PASSENGER (O.S.)\n            Ya see that woman there?\n\n                         TRAVIS (O.S.)\n            Yeah.\n\n                         YOUNG PASSENGER (O.S.)\n            That's my wife.\n                   (a beat)\n            But it ain't my apartment.\n                   (a beat)\n            A nigger lives there.\n                   (a beat)\n            She left me two weeks ago. It took\n            me this long to find out where she\n            went.\n                   (a beat)\n            I'm gonna kill her.\n\nC.U. TRAVIS' face: it is devoid of expression.\n\n                         YOUNG PASSENGER\n            What do you think of that, cabbie?\n\nC.U. YOUNG PASSENGER's face: it is gaunt, drained of blood,\nfull of fear and anger.\n\nTravis does not respond.\n\n                         YOUNG PASSENGER\n            Huh?\n                   (a beat)\n            What do you think of that, huh?\n\nTravis shrugs, gesturing toward meter.\n\n                                                           50.\n\n\n                         YOUNG PASSENGER\n            I'm gonna kill her with a .44\n            Magnum pistol.\n\nCAMERA returns to SEVENTH FLOOR WINDOW. Woman is standing in\nthe light.\n\n                         YOUNG PASSENGER (O.S.)\n            Did you ever see what a .44 can do\n            to a woman's face, cabbie?\n                   (pause)\n            Did you ever see what it can do to\n            a woman's pussy, cabbie?\n\nTravis says nothing.\n\n                         YOUNG PASSENGER (O.S.)\n            I'm going to put it right up to\n            her, cabbie. Right in her, cabbie.\n            You must think I'm real sick, huh?\n            A real pervert. Sitting here and\n            talking about a woman's pussy and a\n            .44, huh?\n\nCAMERA CLOSES IN on Travis' face: He is watching the woman\nin the seventh floor window with complete and total\nabsorption. It's the same glazed-over stare we saw in his\neyes as he watched the porno movie.\n\n                                            FADE TO:\n\nBROOKLYN STREET CORNER - DAY\n\nTravis stands near the corner wearing his boots, jeans,\nwestern shirt and army jacket.\n\nHe pulls his aspiring bottle out of his pocket, shakes three\nor four into his palm, pops them into his mouth and chews.\n\nAn \"Off Duty\" taxi pulls up to the curb. Travis gets in.\n\nINSIDE TAXI\n\nDough-Boy leans back from the wheel and greets Travis as he\nenters.\n\n                         DOUGH-BOY\n            Hey Travis. This here's Easy Andy.\n            He's a travelling salesman.\n\nIn the back seat, beside Travis, sits ANDY, an attractive\nyoung man about 29. He wears a pin-striped suit, white shirt\nand floral tie. His hair is modishly long.\n\n                                                           51.\n\n\n                         ANDY\n            Hello Travis.\n\nTravis nods as the taxi speeds off.\n\nDough-Boy slows down near an economy hotel. Not a flop\nhouse, but not do fancy they care what the guests do in the\nprivacy of their rooms.\n\n                         ANDY\n            This is fine, Dough-Boy\n                   (to Travis)\n            Pay Dough-Boy here.\n\nTravis pulls a twenty out of his pocket and gives it to\nDough-Boy.\n\n                         TRAVIS\n            20 bucks?\n\n                         DOUGH-BOY\n                   (takes bill)\n            Yeah. Hey thanks. That's real nice,\n            Travis.\n\nTravis and Andy get out of the cab and walk toward the hotel.\nDough-Boy pulls away.\n\nAs they enter the hotel, they pass a JUNKIE, stoned out and\nspread-eagled across the hood of a derelict old blue dodge.\n\nINT. HOTEL\n\nTravis follows Andy up the worn carpeted stairs and down the\nhallway.  Andy unlocks the door to one of the rooms.\n\nThe HOTEL ROOM is barren and clean; there's no sign anyone\nis staying in it. The fire escape is appropriately near.\n\nAndy locks the door behind them, steps over to the closet,\nunlocks it and pulls out two grey Samsonite suitcases - the\nkind you can drive a truck over.\n\n                         ANDY\n            Dough-Boy probably told you I don't\n            carry any Saturday Night Specials\n            or crap like that. It's all out of\n            State, clean, brand new, top-of-\n            the-line stuff.\n\nAndy places the suitcases on the white bedspread. The\nsuitcases are equipped with special locks, which he quickly\nopens.\n\n                                                           52.\n\n\nAndy opens the suitcases: Stacked in grey packing foam are\nrows and rows of brand new hand guns.\n\n                         TRAVIS\n            You got a .44 Magnum?\n\n                         ANDY\n            That's an expensive gun.\n\n                         TRAVIS\n            I got money.\n\nAndy unzips a cowhide leather pouch to reveal a .44 Magnum\npistol. He holds it gingerly, as if it were a precious\ntreasure. Andy opens the chambers and cradles the long\neight-inch barrel in his palm. The .44 is a huge, oversize\ninhuman gun.\n\n                         ANDY\n                   (admiringly)\n            It's a monster. Can stop a car --\n            put a bullet right into the block.\n            A premium high resale gun. $350 --\n            that's only a hundred over list.\n\nEasy Andy is a later version of the fast-talking, good-\nlooking kid in college who was always making money on one\nscheme or another. In high school he sold lottery tickets,\nin college he scored dope, and now he's hustling hand guns.\n\nAndy holds the Magnum out for Travis' inspection. There's a\nworshipful CLOSEUP of the .44 Magnum. It is a monster.\n\nTravis hefts the huge gun. It seems out of place in his hand.\nIt is built on Michelangelo's scale. The Magnum belongs in\nthe hand of a marble god, not a slight taxi driver. Travis\nhands the gun back to Andy.\n\n                         ANDY\n            I could sell this gun in Harlem for\n            $500 today - but I just deal high\n            quality goods to high quality\n            people.\n                   (pause)\n            Now this may be a little big for\n            practical use, in which case I'd\n            recommend the .38 Smith and Wesson\n            Special. Fine solid gun - nickel\n            plated. Snub-nosed, otherwise the\n            same as the service revolver. Now\n            that'll stop anything that moves\n            and it's handy, flexible.\n                         (MORE)\n\n                                                           53.\n\n\n                         ANDY (CONT'D)\n            The Magnum, you know, that's only\n            if you want to splatter it against\n            the wall. The movies have driven up\n            the price of the Magnum anyway.\n            Everybody wants them now. But the\n            Wesson .38 - only $250 - and worth\n            every dime of it.\n                   (he hefts the .38)\n            Throw in a holster for $10.\n\nTravis hefts the nickel-plated .38, points it out the window.\n\n                         ANDY (CONT'D)\n            Some of these guns are like toys,\n            but a Smith and Wesson, man, you\n            can hit somebody over the head with\n            it and it will still come back dead\n            on.  Nothing beats quality.\n                   (pause)\n            You interested in an automatic?\n\n                         TRAVIS\n            I want a .32.   Revolver. And a\n            palm gun. That .22 there.\n\n                         ANDY\n            That's the Colt .25 - a fine little\n            gun. Don't do a lot of damage, but\n            it's as fast as the Devil. Handy\n            little gun, you can carry it almost\n            anywhere. I'll throw it in for\n            another $125.\n\nTravis holds the .32 Revolver, hefts it, slips it under his\nbelt and pulls his shirt over it. He turns from side to\nside, to see how it rides in his waist.\n\n                         TRAVIS\n            How much for everything.\n\n                         ANDY\n            The .32's $150 - and you're really\n            getting a good deal now - and all\n            together it comes to, ah, seven\n            eighty-five for four pieces and a\n            holster. He'll, I'll give you the\n            holster, we'll make it seventy-five\n            and you've got a deal - a good one.\n\n                         TRAVIS\n            How much to get a permit to carry?\n\n                                                           54.\n\n\n                         ANDY\n            Well, you're talking big money now.\n            I'd say at least five grand, maybe\n            more, and it would take a while to\n            check it out. The way things are\n            going now $5.000 is probably low.\n            You see, I try not to fool with the\n            small-time crap. Too risky, too\n            little bread. Say 6 G's, but if I\n            get the permit it'll be as solid as\n            the Empire State Building.\n\n                         TRAVIS\n            Nah, this'll be fine.\n\n                         ANDY\n            You can't carry in a cab even with\n            a permit - so why bother?\n\n                         TRAVIS\n            Is there a firing range around?\n\n                         ANDY\n            Sure, here, take this card, go to\n            this place and give 'em the card.\n            They'll charge you, but there won't\n            be any hassle.\n\nTravis pulls out a roll of crisp one hundred dollar bills\nand counts off eight.\n\n                         ANDY\n            You in Nam? Can't help but notice\n            your jacket?\n\n                         TRAVIS\n                   (looking up)\n            Huh?\n\n                         ANDY\n            Vietnam? I saw it on your jacket.\n            Where were you? Bet you got to\n            handle a lot of weapons out there.\n\nTravis hands Andy the bills. Andy counts them and gives\nTravis a twenty and five.\n\n                         TRAVIS\n            Yeah. I was all around. One\n            hospital, then the next.\n\n                                                           55.\n\n\n                         ANDY\n                   (through counting)\n            It's he'll out there all right. A\n            real shit-eatin' war. I'll say\n            this, though: It's bringing a lot\n            of fantastic guns. The market's\n            flooded. Colt automatics are all\n            over.\n                   (pockets the money)\n\n\n                         TRAVIS\n                   (intensely)\n            They'd never get me to go back.\n            They'd have to shoot me first.\n                   (pause)\n            You got anything to carry these in?\n                   (gestures to pistols)\n\n\nTravis is like a light switch: For long periods he goes\nalong dark and silent, saying nothing; then suddenly, the\ncurrent is turned on and the air is filled with the\nelectricity of his personality. Travis' inner intensity sets\nAndy back a bit, but he quickly recovers.\n\n                         ANDY\n            Sure.\n\nAndy pulls a gym bag from under his bed. He wraps the gun in\nthe sheet in the bag and zips it up. An identical gym bag\ncan be partially seen under the bed. He hands Travis the bag.\n\n                         ANDY\n            You like ball games?\n\n                         TRAVIS\n            Huh?\n\n                         ANDY\n            I can get you front and center.\n            What do you like? I can get you\n            Mets, Knicks, Rangers? Hell, I can\n            get you the Mayor's box.\n\n                         TRAVIS\n            Nah. I ain't interested.\n\nAndy closes and locks the suitcases.\n\n                         ANDY\n            Okay, okay.\n\nTravis turns to leave.\n\n                                                           56.\n\n\n                         ANDY\n            Wait a second, Travis. I'll walk\n            you out.\n\n                                            CUT TO:\n\nSEVERAL WEEKS LATER.  The face of TRAVIS' apartment has\nchanged. The long, blank wall behind the table is now\ncovered with tacked-up charts, pictures, newspaper-clippings,\nmaps. CAMERA does not come close enough to discern the exact\ncontents of these clippings.\n\nTravis is in C.U. in the middle of the floor doing push-ups.\nHe is bareback, wearing only his jeans. There is a long scar\nacross his left side.\n\n                         TRAVIS (V.O.)\n            May 29, 1972. I must get in shape.\n            Too much sitting has ruined my body.\n            Twenty-five push-ups each morning,\n            one hundred sit-ups, one hundred\n            knee-bends. I have quit smoking.\n\nTravis, still bareback, passes his stiff arm through the\nflame of a gas burner without flinching a muscle.\n\n                         TRAVIS (V.O.)\n            Total organization is necessary.\n            Every muscle must be tight.\n\nINT. FIRING RANGE\n\nThe CRACKING SOUND of rapid-fire pistol shots fills the\nmusty air of the firing range. The walls are heavily\nsoundproofed, and sawdust is spread over the floor.\n\nTravis stands rock solid, firing the .44 Magnum at an arm's\nlength.  With each blasting discharge from the Magnum,\nTravis' body shudders and shakes, his arm as if each recoil\nfrom the giant gun was a direct attack on his masculinity.\n\nTravis fires the Magnum as quickly as he can re-set, re-aim\nand re-fire. The Magnum is empty, he sets it down, picks up\nthe .38 Special and begins firing as soon as he can aim.\nAfter the .38, comes the .25: It is as if he were in a\ncontest to see how quickly he can fire the pistols. After\nall the guns are discharged, he begins reloading them\nwithout a moment's hesitation.\n\nDownrange, the red and white targets have the black outline\nof a human figure drawn over them. The contour-man convulses\nunder the steady barrage of Travis' rapid-fire shots.\n\n                                                           57.\n\n\nINT. APARTMENT\n\nTRAVIS, now wearing an unfastened green plaid western shirt,\nsits at the table writing in his diary. The vial of bennies\nis on the table.\n\n                         TRAVIS (V.O.)\n            My body fights me always. It won't\n            work, it won't sleep, it won't\n            shit, it won't eat.\n\nLATER.  TRAVIS, his shirt still revealing his bare chest,\nsits on his straight-backed chair watching the TV. The .44\nMagnum rests on his lap.\n\nThe TV is Broadcasting ROCK TIME, a late afternoon local\nteenage dance and rock show.  On screen YOUNG TEENYBOPPERS\nare dancing, and the TV CAMERAMAN, as any devotee of the\ngenre knows, is relentlessly ZOOMING-IN on their firm young\nbreasts, fannies and crotches -- a sensibility which reflects\nTRAVIS' own. These supper-hour rock dance shows are the most\nunabashedly voyeuristic form of broadcasting the medium has\nyet developed.\n\nThe HARD ROCK NUMBER ends, and the TV CAMERA CUTS TO the\nlocal DISC JOCKEY, a hirsute plastic-looking man about 35.\nFIVE scrumptious TEENYBOPPERS are literally hanging on his\nshoulders and arms, their faces turned up to him in droolish\nawe. Out of his mouth comes an incessant stream of disc\njockey blather. He is the complete asshole; I don't know who\nis currently performing this function in New York, but in\nLos Angeles his name is Real Don Steele.\n\n                         TV DISC JOCKEY\n            Freshingly, fantastic, freaked-out\n            dance time. Can you dig it? Dig on\n            it. You got it, flaunt it.\n\nTRAVIS watches the show, his face hard and unmoving. He is,\nas the Scriptures would say, pondering all these things in\nhis heart. Why is it the assholes get all the beautiful\nyoung chicks? He takes a swig of peach brandy.\n\n                                            CUT TO:\n\nEARLY EVENING, about 6:30 p.m.  TRAVIS' taxi, with 'Off\nDuty' light on, sits near the curb somewhere in midtown\nManhattan.\n\nTRAVIS runs his hand down the left side of his jacket,\nattempting to smooth out the bulge underneath.\n\nTRAVIS opens his jacket partially, checking underneath.\nThere rests the nickel-plated .38 Special in its holster.\n\n                                                           58.\n\n\nP.O.V. down the street where TRAVIS' taxi is parked: Several\nblocks ahead the red, white and blue campaign headquarters\nof CHARLES PALANTINE are visible.\n\nTRAVIS' eyes resume their watch.\n\nTRAVIS starts the car and drives toward the PALANTINE\nHEADQUARTERS.\n\nTRACKING P.O.V. shot of row of storefronts leading up to\nPalantine Headquarters.  P.O.V. passes headquarters: it is\nhalf-empty.  A few stalwart SUPPORTERS continue to work\ntoward the rear of the office.  BETSY'S desk ----\n\nSign in window reads: \"Only 4 More Days Until Arrival of\nCHARLES PALANTINE.\"\n\nTRAVIS' \"Off Duty\" light goes off as he speeds up and heads\ntoward a prospective fare.\n\nLATER THAT NIGHT, about 9:30.  UPTOWN -- 128th and Amsterdam.\nThe Jungle.  TRAVIS' taxi pulls up to an address, lets off\nYOUNG BLACK MAN.\n\nTRAVIS receives fare and tip, takes off.\n\nP.O.V. as TRAVIS works his way through Harlem back down\nSeventh Ave.  Cluster of YOUNG BLACK STREET PUNKS pretend to\nhail cab -- we ignore them.  One throws wine bottle which\ncrashes in our path -- taxi swerves to avoid it.\n\nCAMERA TRACKS through sidewalk CROWDS with the roving,\nsuspicious, antagonistic eye of a taxi-driver.\n\nLATER THAT NIGHT, about 12:30.  TRAVIS is on the LOWER EAST\nSIDE, somewhere on B Street, east of Tompkins Square.\n\nThe sidewalks are populated with the remains of what once\nwas the hippie movement: TEENAGE STREET-WALKERS, JUNKIES,\nTHUGS, emaciated LONERS on the prowl.\n\nTRAVIS' taxi pulls over, letting out a fare.\n\nTRAVIS pockets his fare, but the rear right door doesn't\nslam -- instead there is the SOUND of another person jumping\ninto the cab.\n\nTRAVIS checks the back seat in the rear-view mirror: there\nsits a pale HIPPIE PROSTITUTE.\n\nThe GIRL is, at best, 14 or 15, although she has been made\nup to look older.  She wears floppy, Janis Joplin clothes.\nHer face is pallid.  She wears large blue-tinted sunglasses\nand multi-colored leg stockings.\n\n                                                           59.\n\n\nHer name, as we shall learn later, is IRIS.\n\nTRAVIS hesitates, looking at her in the mirror.\n\n                         IRIS\n            Come on, mister, let's get outta\n            here -- quick.\n\nTRAVIS moves to activate the meter, when the rear door opens.\n\nIRIS is helped out of the cab by a MAN TRAVIS cannot see.\n\n                         SPORT\n                   (to IRIS)\n            Come on, baby, let's go.  This is\n            all a real drag.\n\nIRIS lets herself be taken out of the cab.  The rear door\ncloses.\n\nSport leans partially in the front window, throwing something\non the front seat.  TRAVIS looks: it is a crumpled $20 bill.\n\n                         SPORT\n            Just forget all about this, cabbie.\n            It's nothing.\n\nTRAVIS cannot see the Sport's face lime green completely,\nbut notices he is wearing a jacket.  The voice is that of a\nman in his early twenties.\n\nTRAVIS turns to catch a glimpse of Sport as he walks off\nwith Iris.\n\nTRAVIS shrugs and turns around.\n\nTRAVIS' taxi pulls away.\n\n                                            CUT TO:\n\nEARLY MORNING, 6:00 a.m.  Quitting time -- TRAVIS pulls into\nTAXI GARAGE.\n\nINT. GARAGE\n\nTRAVIS pulls into his stall.\n\nTRAVIS sits in driver's seat, thinking a moment.  He looks\nto his right: the crumpled $20 bill still lies there,\nuntouched since it was thrown there six hours previously.\n\nTRAVIS reluctantly picks up the $20 bill and stuffs it into\nhis jacket pocket as he gets out of the cab.  He gathers up\nhis time report and heads toward book-in table.\n\n                                                           60.\n\n\nA SHORT WHILE LATER, TRAVIS is walking down the sidewalk\nnear the taxi garage.  His hands are in his jacket pockets,\nobscuring the slight bulge on his left side.\n\nTRAVIS turns into the box offfice of PORNO THEATER.  He\nreaches into jacket pocket for money to purchase ticket and\npulls out crumpled $20 bill.  Seeing the $20 bill, he\ndecides not to use it, and pays for ticket out of his wallet\ninstead.\n\nTRAVIS walks past concession stand en route to the darkened\ntheater auditorium.  A YOUNG MAN is now sitting listlessly\nbehind the concessions counter.\n\nINT. PORNO THEATER AUDITORIUM\n\nTRAVIS slouches down into his seat, his face glowing in the\nreflected light from the screen.\n\n                         FEMALE MOVIE VOICE (O.S.)\n            Oh, come on, now, down, lick it,\n            come on...\n                   (a beat)\n            Mmm, that's good.  Ahh, ahh, more ...\n\nTRAVIS averts his eyes as the action on screen becomes too\ngraphic.  Placing his stiffened right hand beside his eyes,\nTRAVIS can, by turning it inward, shut off or open up his\nfield of vision by small degrees.\n\nMOVIE VOICE DIMINISHES, replaced by SOUND of TRAVIS' voice\nover.\n\n                         TRAVIS (V.O.)\n            The idea had been growing in my\n            brain ...\n\n                                            CUT TO:\n\nTRACKING SHOT to wall of TRAVIS' APARTMENT.  CAMERA MOVES\nslowly across wall covered with clippings, notes, maps,\npictures.  We now see their contents clearly:\n\nThe wall is covered with CHARLES PALANTINE political\nparaphernalia; there are pictures of him, newspaper articles,\nleaflets, bumper stickers.  As the CAMERA MOVES along it\ndiscovers a sketch of Plaza Hotel, Kennedy Airport and cut-\nup sections of city maps with notations written in.  There\nis lengthy N.Y. Times clipping detailing the increased\nSecret Security Protection during the primaries.  A section\npertaining to PALANTINE is underlined.  Further along there\nis a sheet reading \"traveling schedule\" and a calendar for\nJune with finely written notations written over the dates.\n\n                                                           61.\n\n\n                         TRAVIS (V.O.)(CONTD)\n            ... for some time.  True Force.\n            All the king's men cannot put it\n            back together again.\n\nAs the CAMERA reaches the end of its track, it finds TRAVIS,\nstanding, his shirt open, but the mattress.  He is wearing\nthe empty holster, and the .44 is in his hand.\n\nIn the SHOTS that follow TRAVIS gives the audience a lesson\nin gunmanship:\n\nTRAVIS practices fast-drawing the .38 Special from his\nholster and firing it.\n\nHe hooks the .44 into his pants behind his back and practices\nwithdrawing it.  He holds the .44 firmly at an arm's length,\ntightening his forearm muscles.\n\nHe has worked out a system of metal gliders taped to his\ninner forearm, whereby the Colt .25 can rest hidden behind\nthe upper forearm until a spring near the elbow is activated,\nsending the .25 flying down the gliders into his palm.  He\nhas cut open his shirt to accomodate the gun mechanism and\nnow checks in the mirror to see how well the gun is hidden.\n\nHe straps an Army combat knife to his calf and cuts a slit\nin his jeans where the knife can be pulled out quickly.\n\nHe now tries on various combinations of shirts, sweater and\njacket in front of the mirror to see how well he can hide\nall the handguns he wishes to carry.  Finally, wearing two\nwestern shirts, a sweater and jacket, he manages to obscure\nthe location of all three guns, although he resembles a\nhunter bundled up against the Arctic winter.\n\nHe sits at the table dum-dumming the .44 bullets -- cutting\n\"x's\" across the bullet heads.\n\nP.O.V.: he scans the objects of his room through the scope\nof the .38.\n\nTRAVIS stands in the middle of his apartment, staring at his\nPALANTINE wall.  His eyes are glazed with introspection; he\nsees nothing but himself.\n\n                         TRAVIS (V.O.)(CONTD)\n            Listen you screwheads: Here is a\n            man ...\n\nTRAVIS lies on his mattress, all bundled up in his shirts,\nsweater, jacket and guns.  His face is turned toward the\nceiling, but his eyes are closed.  Although the room is\nflooded with light, he is finally catching some sleep.\n\n                                                           62.\n\n\nThe big furry animal drifts into his own world.\n\n                         TRAVIS (V.O.)(CONTD)\n            ... who wouldn't take it any more,\n            a man who stood up against the\n            scum, the cunts, the dogs, the\n            filth.  Here is ...\n                   (voice trails off)\n\n\nC.U. of diary: entry ends with words \"Here is\" followed by\nerratic series of dots.\n\n                                            CUT TO:\n\nNIGHT: the taxis are roaming the slick streets.\n\nSometimes after 2:00 a.m., TRAVIS pulls his cab to the curb\nnear an all-night delicatessen in Spanish Harlem.  The\nstreets are relatively deserted.\n\nTRAVIS waves to STOREKEEPER as he walks past counter:\n\n                         TRAVIS\n            Hey 'Melio.\n\nSpanish rhythm and blues blares from a cheap radio.\n\nTRAVIS walks over to dairy counter in rear of store, picks\nout a pint of chocolate milk, goes over to the open cooler\nand picks through various chilled prepackaged sandwiches.\nHe overhears a VOICE as he looks at the sandwiches.\n\nWhen TRAVIS returns to the counter with the chocolate milk\nand a sandwich in one hand, he sees a YOUNG BLACK MAN\nholding a gun on 'Melio.  The STICK-UP MAN is nervous,\nhopped-up, or both; he bounces on the balls of his cheap\nworn black tennis shoes -- a strung-out junkie on a\ndesperation ride.  The STICK-UP MAN, a thorough\nunprofessional, doesn't notice TRAVIS.\n\n'MELIO watches the STICK-UP MAN closely, deciding what to do\nhimself.\n\n                         STICK-UP MAN\n                   (shaking gun)\n            Come on, man.  Quick, quick, quick.\n            Hand over that bread.\n\nIt doesn't take TRAVIS long to decide what to do: without\nhesitation he pulls his .32 from his jacket pocket.\n\n                         TRAVIS\n            Hey dude!\n\n                                                           63.\n\n\nThe STICK-UP MAN, surprised, turns toward TRAVIS, finding\nonly an exploding .32.  The MAN's lower jaw bursts open with\nblood as he reels and crashes to the floor.  There is no\nemotion on TRAVIS' face.\n\nAs the STICK-UP MAN falls, 'MELIO leans over the counter,\nwielding his battered .38.  He is about to fire when he\nrealizes the MAN is already dead.\n\n'MELIO, charged up, turns his gun toward TRAVIS, then,\nrealizing the danger is over, lowers it again.\n\n                         'MELIO\n            Thanks, man.  Figured I'd get him\n            on the way out.\n\nTRAVIS sets his .32 on the counter.\n\n                         TRAVIS\n            You're gonna have to cover me on\n            this one, 'Melio.  I can't stay for\n            the cop show.\n\n                         'MELIO\n            You can't do that, Travis.  You're\n            my witness.\n\n                         TRAVIS\n            The hell I can't.  It's no sweat\n            for you.  What is this for you,\n            number five?\n\n'MELIO smiles and holds up four fingers:\n\n                         'MELIO\n            No, only four.\n                   (shrug)\n            Alright, Travis, I'll do what I can.\n\n                         TRAVIS\n            Thanks a lot.\n\nTRAVIS exits.  'MELIO picks up the phone and starts dialing.\nThe bloody BODY lies on the floor unmoving.\n\nTRAVIS, still carrying his pint of chocolate milk and\nsandwich, walks down the empty sidewalk and enters his cab.\nThe street is deserted.\n\n                                            CUT TO:\n\nDIRECT CUT TO PORNOGRAPHIC MOVIE: this is the first time we\nhave actually seen the porno movie itself.\n\n                                                           64.\n\n\nSEVERAL ACTORS and ACTRESSES are dallying on screen in\nwhatever manner the ratings board deems permissible.\n\nWhatever the action, the movie's decor is strictly Zody's --\nersatz landscape paintings, tufted bedspreads.  As in most\nporno films, the ACTORS look up occasionally toward the\nCAMERA to receive instructions.  Studio grunts, groans and\nmoans of pleasure have been dubbed in.\n\nAction on screen begins to go into SLOW MOTION, the ACTORS\nand ACTRESSES gradually transforming obscenity into poetry.\n\n                                            CUT TO:\n\nTRAVIS, sitting in his chair in his APARTMENT, watching\nafternoon soap opera.  He is cleaning his .38 and eating\nfrom a jar of applesauce.  Soap opera audio continues.\n\nHe watches the soap opera without expression.\n\nSOUND TRACK of film also SLOWS DOWN, gradually mixing with\nand then becoming the sound track of a midafternoon TV soap\nopera.\n\nA YOUNG GIRL and BOY are talking in those familiar soap\nopera voices and a third party, the GIRL's mother, who had\ntried to terminate their \"relationship.\"\n\n                                            CUT TO:\n\nTELEVISION: The BOY is visiting the GIRL in her hospital\nroom.  Both look as if they've stepped out of the Blue Chip\nstamp catalogue.\n\n                         SOAP OPERA BOY\n            Is it that she just doesn't -- like\n            me?\n\n                         SOAP OPERA GIRL\n                   (hesitantly)\n            Well, Jim, it's just that -- I\n            don't know how to say this -- it's\n            that she thinks your parents\n            aren't... good enough, I guess.\n\nTRAVIS, through cleaning his gun, begins to play a game with\nthe television set.\n\nHe places the heel of his boot at the top of the melon crate\nwhich supports the TV.  Then, slowly rocking his heel back\nand forth, he sees how far he can tip the melon crate\nwithout knocking it over.\n\n                                                           65.\n\n\nThe TV, still broadcasting the hospital room melodrama,\nrocks back and forth.\n\nTRAVIS pushes the TV farther and farther until finally the\ninevitable happens -- the crate tips backward, sending the\nportable TV crashing to the floor.\n\nThere is a short flash and the TV screen turns white.\n\nTRAVIS, realizing what he has done, bends over, turns the TV\nupright on the floor, fiddles with the knobs, slaps it, and\ntries to reactivate the vanished image.  TRAVIS' efforts are\nfutile; a tube has broken, and the TV will not come back to\nlife.\n\n                         TRAVIS\n                   (to himself)\n            Damn, damn.\n\nTRAVIS bends over in the chair and places his head in his\nhands, despairing of himself.\n\n                                            FADE TO:\n\nAbout 1 a.m.  TRAVIS pulls his cab behind a line of empty\ntaxis parked outside the Bellmore Cafeteria, a cabbie\nhangout on Park Avenue South.\n\nHe locks his cab and walks past the line of taxis.  He\nsidesteps TWO DRUNKEN FIGHTING BUMS and enters the Bellmore.\n\nA LOUD BUZZER RINGS as TRAVIS steps INTO THE BELLMORE.  He\npulls a ticket from the dispenser (silencing the buzzer) and\nwalks toward the wall-length counter.\n\nAn assortment of CABBIES are seated around a formica-topped\ntable near the rear of the cafeteria.  Some are barely\nawake, some are eating, the rest are swapping stories and\nsmalltalk.\n\nWizard, Dough-Boy, Charlie T and a FOURTH CABBIE are seated\nat a long table.\n\n                         WIZARD\n            You know Eddie, he's the new hippie\n            kid in our group, long hair...\n\nWizard demonstrates length of hair and others nod.\n\n                         WIZARD\n            ...he called up the Dispatcher last\n            night.  Charlie McCall, our\n            dispatcher...\n\n                                                           66.\n\n\n                         DOUGH-BOY\n            One-Ball McCall?\n\n                         WIZARD\n            That's the guy.  Eddie calls him up\n            and says, \"Hey, what do you want me\n            to do.  I'm over here at Poly Prep.\n            I got a girl in the back and she\n            doesn't have the fare.  She wants\n            me to come in back and collect.\n            What should I do?\n\nThe cabbies laugh.  Across the cafeteria Travis selects a\ncup of coffee and some pastries.\n\n                         CHARLIE T\n            This is on the two-way with about a\n            hundred and fifty cars listenin in.\n\n                         WIZARD\n            McCall says. \"How much on the\n            meter?\"  Eddie comes back and says\n            \"Two-fifty.\" McCall says, \"Is she\n            worth it\".\n\nMore laughter.\n\n                         DOUGH-BOY\n            Fuckin One-Ball.\n\n                         WIZARD\n            And the kid says, \"Yeah.  She's\n            about 19, good-lookin.\"  McCall\n            says, \"What can I tell you?\"\n\n                         FOURTH CABBIE\n            She should have told him to get an\n            OK from the front office.\n                   (laughter)\n\n\n                         WIZARD\n            McCall says, \"Well, if you want\n            some help I'll see if I can send\n            some units out.\"\n\n                         CHARLIE T\n            Yeah.  About a hundred and fifty.\n\n                         DOUGH-BOY\n            I hope he had a checker.\n\n                                                           67.\n\n\n                         WIZARD\n            She was just a kid.  Stoned, you\n            know.\n\nTravis, carrying his coffee and pastries, walks over to\ntheir table.  Charlie T spots him.\n\n                         CHARLIE T\n            Hiya Killer.\n\nCharlie forms his hand into a pistol, cocks and fires,\nmaking the SOUND, \"Pgghew.\"  TRAVIS nods.\n\n                         WIZARD\n            You're getting a rep, Travis.\n\nTRAVIS sits down and the other CABBIES resume their\nconversation.\n\n                         CHARLIE T\n            Got the five you owe me, Killer?\n\nTRAVIS reaches into his pocket and pulls out a roll of small\ndenomination bills.  The crumpled $20 bill falls onto the\ntable.  TRAVIS stares at it a moment.  He unfolds a five,\ngives it to CHARLIE T, then picks up the crumpled $20 and\nputs it back into his jacket pocket.\n\n                         WIZARD (O.S.)\n                   (to Travis)\n            What's the action around?\n\n                         TRAVIS\n            Slow.\n\n                         CHARLIE T\n            Shit yes.  Night woulda been dead\n            if I hadn't grabbed an outatowner\n            at Kennedy.  Took him roun the horn\n            and got a five dollar tip to boot.\n\n                         WIZARD\n                   (joking)\n            One of these days we're gonna turn\n            you in, Charlie T.  Fleecin the\n            hicks like that.\n\n                         DOUGH-BOY\n            Remember the time this cat picks up\n            four dudes from the other side,\n            Pakastanis I think they were, holds\n            up their passports, to the toll\n            booth collector on the bridge and\n            charges em ten bucks each for\n            'crossing the border?\n\n                                                           68.\n\n\nThey all laugh.\n\n                         CHARLIE T\n            Hell, I know'd you to do worse.\n\n                         DOUGH-BOY\n            Least I'm no airport rat.  I work\n            the whole town.\n\n                         CHARLIE T\n                   (chuckling)\n            It's a living.\n\nWIZARD gets up to leave.\n\n                         WIZARD\n            Well, I'm shovin' on.\n\nWIZARD gets up, nods and walks toward the CASHIER.  After a\nsecond's thought, TRAVIS calls to him:\n\n                         TRAVIS\n            Hey Wiz, just a second.  I wanna\n            talk to you.\n\nWIZARD waits for TRAVIS as he takes a final gulp of coffee\nand catches up with him.  CHARLIE T calls to TRAVIS as they\ngo:\n\n                         CHARLIE T\n            See ya, Killer.  Don't forget your\n            pea shooter.\n\nCHARLIE T cocks his imaginary gun again, fires and chuckles.\n\nWIZARD and TRAVIS nod goodbye, pay the CASHIER and exit.\n\nEXT.\n\nTRAVIS follows WIZARD out onto the sidewalk.  TRAVIS follows\nWIZARD as he walks toward his cab.  He has something on his\nmind, something he wants to talk to WIZARD about.\n\n                         TRAVIS\n                   (walking)\n            Hey Wiz.\n\nWIZARD leans back against the cab.  TRAVIS is about to speak\nwhen he spots a GROUP of BLACK and PUERTO RICAN STREET\nPUNKS, ages 12-15, jiving down the sidewalk toward him.  ONE\ntosses a spray paint can around his back, basketball style.\nANOTHER mocks as if he's going to scratch a key along one of\nthe cabs.\n\n                                                           69.\n\n\nWIZARD has no visible reaction.  A flash of controlled anger\ncrosses TRAVIS' face.  He stares at the BOY with the poised\nkey.  It is the same look that crossed his face in the\nHarlem Deli.  We are reminded with a jolt that the killer\nlies just beneath TRAVIS' surface.\n\nThe BLACK PUNK must instinctively realize this too, because\nhe makes a cocky show of putting the key back into his\npocket and be-bopping around TRAVIS and WIZARD.\n\nThe YOUNG MEAN-STREETERS continue down the street and TRAVIS\nturns back to WIZARD.\n\nAcross the street, in the background, a JUNKIE nestles in a\ndoorway.\n\n                         TRAVIS\n                   (hesitant)\n            Wiz?\n\n                         WIZARD\n            Yeah?\n\n                         TRAVIS\n            Look, ah, we never talked much, you\n            and me...\n\n                         WIZARD\n            Yeah?\n\n                         TRAVIS\n            I wanted to ask you something, on\n            account you've been around so long.\n\n                         WIZARD\n            Shoot.  They don't call me the\n            Wizard for nothing.\n\n                         TRAVIS\n            Well, I just, you know...\n\n                         WIZARD\n            Things got ya down?\n\n                         TRAVIS\n            Real down.\n\n                         WIZARD\n            It happens.\n\n                                                           70.\n\n\n                         TRAVIS\n            Sometimes it gets so I just don't\n            know what I'm gonna do.  I get some\n            real crazy ideas, you know?  Just\n            go out and do somethin.\n\n                         WIZARD\n            The taxi life, you mean.\n\n                         TRAVIS\n            Yeah.\n\n                         WIZARD\n                   (nods)\n            I know.\n\n                         TRAVIS\n            Like do anything, you know.\n\n                         WIZARD\n            Travis, look, I dig it.  Let me\n            explain.  You choose a certain way\n            of life.  You live it.  It becomes\n            what you are.  I've been a hack 27\n            years, the last ten at night.\n            Still don't own my own cab.  I\n            guess that's the way I want it.\n            You see, that must be what I am.\n\nA police car stops across the street.  TWO PATROLMEN get out\nand roust the JUNKIE from his doorway.\n\n                         WIZARD\n                   (continuing)\n            Look, a person does a certain thing\n            and that's all there is to it.  It\n            becomes what he is.  Why fight it?\n            What do you know?  How long you\n            been a hack, a couple months?\n            You're like a peg and you get\n            dropped into a slot and you got to\n            squirm and wiggle around a while\n            until you fit in.\n\n                         TRAVIS\n                   (pause)\n            That's just about the dumbest thing\n            I ever heard, Wizard.\n\n                         WIZARD\n            What do you expect, Bertrand\n            Russell?  I've been a cabbie all my\n            life, what do I know?\n                   (a beat)\n            I don't even know what you're\n            talking about.\n\n                                                           71.\n\n\n                         TRAVIS\n            Neither do I, I guess.\n\n                         WIZARD\n            You fit in.  It's lonely, it's\n            rough at first.  But you fit in.\n            You got no choice.\n\n                         WIZARD\n            Yeah.  Sorry, Wizard.\n\n                         WIZARD\n            Don't worry, Killer.  You'll be all\n            right.\n                   (a beat)\n            I seen enough to know.\n\n                         TRAVIS\n            Thanks.\n\nWIZARD gives TRAVIS a short wave implying, \"Chin up, old\nboy,\" and walks around to the driver's side of his cab.\n\nWIZARD drives off, leaving the street to its natural\ninhabitants.\n\n                                            CUT TO:\n\nFADE IN:\n\nEXT. CHARLES PALANTINE RALLY - DAY\n\nA rally platform in a supermarket parking lot somewhere in\nQUEENS is draped in red, white and blue bunting.\n\nA CROWD of about 500 persons mills about, waiting for the\nrally to begin.  Piped pop-country MUSIC plays over the\nloudspeaker system.\n\nThe CADRE OF SECRET SERVICE MEN, with their distinctive\nmetallic grey suits, sun glasses and football physiques,\nstands out in the CROWD.\n\nOn the PLATFORM are seated an assortment of LOCAL POLITICOS\nas well as some PALANTINE WORKERS and ADVISERS.\n\nTOM is silently reading something on the podium, and BETSY\nstands on the platform steps talking with ANOTHER WORKER.\n\nTOM looks up and to his left for a moment, then returns to\nwhat he was reading.  Then he returns his gaze to the upper\nleft, watching something very closely.\n\n                                                           72.\n\n\nAfter a moment he walks over to the steps where BETSY is\nstanding.\n\n                         TOM\n            Betsy, come over here a moment.\n\n                         BETSY\n            What is it?  I'm busy.\n\n                         TOM\n                   (insistent)\n            Just follow me.\n\nBETSY excuses herself and walks across the platform with TOM.\nAs they stand to the rear of the platform, TOM secretively\nmakes a gesture with his eyes and says out of the side of\nhis mouth:\n\n                         TOM\n            Look there.\n                   (her eyes follow his)\n            No, over further - get your\n            glasses - yes, over there.  Isn't\n            that little guy the same guy that\n            was bugging you around the office\n            about a month ago?\n\nBETSY, putting on her glasses, looks closely.  She tries not\nto make her stare too obvious.\n\n                         BETSY\n            No, I don't think so.\n                   (a beat)\n            That's someone else.\n\n                         TOM\n            Now look more closely.  Look around\n            the eyes and chin.  See?  See there?\n\nCAMERA CLOSES IN on TRAVIS BICKLE standing in the CROWD: he\nhas shaved his head to a short stubble.  There he is: brush-\ncut, wearing a giant grin, and a large \"Palantine '72\" button.\n\nAlthough it is a pleasant sunny day, TRAVIS wears a bulky\nbulged-out Army jacket.\n\nTRAVIS looks warily from side to side and vanishes in the\nCROWD.\n\nA SHORT WHILE LATER, TRAVIS walks up to a SECRET SERVICE MAN\nstanding near the fringes of the CROWD.  The SECRET SERVICE\nMAN -- in sun glasses, grey suit, ever-roving eyes -- is\nimmediately identifiable.\n\n                                                           73.\n\n\nWhenever TRAVIS confronts a symbol of authority, he becomes\nlike a young boy.  This time is no exception, although one\nsuspects there is a plan hatching beneath that boyish\nexterior.  The SECRET SERVICE MAN, for his part, is about as\ntalkative as the Sphinx.\n\n                         TRAVIS\n            Are you a Secret Service Man?\n\n                         SECRET SERVICE MAN\n                   (indifferently)\n            Why do you ask?\n\n                         TRAVIS\n            I've seen a lot of suspicious-\n            looking people around here today.\n\nSECRET SERVICE MAN glances at TRAVIS momentarily.\n\n                         SECRET SERVICE MAN\n            Who?\n\n                         TRAVIS\n            Oh, lots.  I don't know where they\n            all are now.  There used to be one\n            standing over there.\n                   (points)\n\n\nSECRET SERVICE MAN's gaze follows TRAVIS' finger for a\nsecond, then return to TRAVIS.\n\n                         TRAVIS (CONTD)\n            Is it hard to get to be a Secret\n            Service Man?\n\n                         SECRET SERVICE MAN\n            Why?\n\n                         TRAVIS\n            I kinda thought I might make a good\n            one.  I'm very observant.\n\n                         SECRET SERVICE MAN\n            Oh?\n\n                         TRAVIS\n            I was in the Army too.\n                   (beat)\n            And I'm good with crowds.\n\nThe SECRET SERVICE MAN is starting to get interested in\nTRAVIS: he definitely ranks as a suspicious character.\n\n                                                           74.\n\n\n                         SECRET SERVICE MAN\n            Is that so?\n\n                         TRAVIS\n            What kind of guns do you guys use?\n            .38's?\n\nThe SECRET SERVICE MAN decides it's time to get some more\ninformation on TRAVIS:\n\n                         SECRET SERVICE MAN\n            Look, um, if you give me your name\n            and address, we'll send you the\n            information on how to apply.\n\n                         TRAVIS\n            You would, huh?\n\n                         SECRET SERVICE MAN\n                   (taking out notepad)\n            Sure.\n\n                         TRAVIS\n            My name is Henry Krinkle -- that's\n            with a \"K.\" K-R-I-N-K-L-E.  I live\n            at 13 1/2 Hopper Avenue, Fair Lawn,\n            New Jersey.  Zip code 07410.\n                   (a beat)\n            Got that?\n\n                         SECRET SERVICE MAN\n            Sure, Henry.  I got it all.  We'll\n            send you all the stuff all right.\n\n                         TRAVIS\n            Great, hey.  Thanks a lot.\n\nThe SECRET SERVICE MAN motions to a SECRET SERVICE\nPHOTOGRAPHER to catch a picture of TRAVIS.  TRAVIS notices\nthis, and quickly slips away into the CROWD.\n\n                                            CUT TO:\n\nTRAVIS sits at his desk in his APARTMENT, writing.  He wears\njeans, western shirt and empty holster.\n\n                         TRAVIS (V.O.)\n            June 11.  Eight rallies in six more\n            days.  The time is coming.\n\n                                            CUT TO:\n\nNIGHT.  TRAVIS' taxi picks up a FARE in the midtown area and\nheads downtown.\n\n                                                           75.\n\n\nLOWER EAST SIDE.  TRAVIS lets off FARE on B Street and cuts\nacross toward Tompkins Square.\n\nTRAVIS turns the corner when SKREETCH! he suddenly hits the\nbrakes, causing the cab to rock back and forth.\n\nHe has almost hit a YOUNG GIRL recklessly crossing the\nstreet.  She thumps her hand on the taxi hood to regain her\nbalance and stares in shock through the front window.  C.U.\nGIRL's face.\n\nTRAVIS recognizes her face: it's IRIS, the GIRL in his taxi\na week or so before.  IRIS looks at TRAVIS sharply then\nturns and continues walking.\n\nTRAVIS' eyes follow her and she rejoins a GIRLFRIEND.  They\nare both dressed as hippie hookers: sloppy clothes, boots,\njeans, floppy hats.  And the old come-hither walk is\nunmistakable.\n\nTRAVIS follows IRIS and her GIRLFRIEND slowly as they walk\ndown the sidewalk.\n\nTRAVIS' P.O.V.  He examines them from bottom to top --\nboots, legs, thighs, breasts, faces, hats.\n\nAs TRAVIS rolls astride the GIRLS, he notices the familiar\nFRINGE OF A SUEDE JACKET standing in the shadows.  The GIRLS\nlook toward the SHADOWED FIGURE, smile, acknowledge some\nunheard comment, and continue on.\n\nIRIS looks back uneasily at TRAVIS' taxi and continues on.\n\nOn the corner stand TWO well-to-do COLLEGE STUDENTS, somewhat\nout of place in this environment, but making every attempt\nto groove on it.  They are high on something or another.\n\nThe GIRLS spot the COLLEGE STUDENTS and walk over to them.\nThey exchange some small talk and walk off together.  There\nis little subtlety involved: it is obviously a pick-up.\n\nTRAVIS must negotiate a turn around the corner if he is to\ncontinue following the GIRLS and their COLLEGIATE JOHNS.\nThis is not so easy, since the traffic is heavy.\n\nAs TRAVIS slows down to make the turn, he notices ANOTHER\nHIPPIE HOOKER who had been watching him watching IRIS and\nher GIRLFRIEND.  She walks over to the taxi, loans in the\nopen left front window and gives TRAVIS the come-on disguised\nas an innocent question:\n\nC.U. HIPPIE HOOKER.\n\n                                                           76.\n\n\n                         HIPPIE HOOKER\n            Hey cabbie!  You comin' or goin'?\n\nTRAVIS quickly turns his face away from her in a combination\nof shock, embarrassment and revulsion.  He is the child\ncaught with his hand in the cookie jar.  The very presence\nof this crassly, openly sexual human being frightens and\nsickens him.\n\nTRAVIS takes off with a skreetch.  His taxi shoots down the\nblock.\n\n                                            CUT TO:\n\nA HOT JUNE DAY.  TRAVIS' taxi, the \"Off Duty\" sign on, is\nparked against the curb somewhere in HARLEM.  WHITE COPS,\nSECRET SERVICE MEN and REPORTERS, punctuate the otherwise\nBLACK CROWDS which walk to and fro in the b.g.\n\nCHARLES PALANTINE's voice can be heard coming from a distant\nloudspeaker system.  It is a political rally.\n\nTRAVIS sits behind the wheel, coldly staring at something in\nthe distance.  His hair, of course, is still clipped short\nand he wears mirror-reflecting sunglasses.  Even though a\ndrop of sweat is working its way down his cheek, TRAVIS\nwears his Army jacket with the bulge on the left side -- the\n.38 Smith and Wesson bulge.\n\nA BLOCK AWAY, PALANTINE stands on a platform outside his\nuptown campaign headquarters.  On the platform sit an array\nof BLACK DIGNITARIES.  Nearby we recognize the SECRET\nSERVICE MAN TRAVIS spoke to at the earlier rally: he scans\nthe CROWD anxiously.\n\nPALANTINE is speaking animatedly.  He is an excellent\nspeaker and captures our attention.  He drives hard toward\nhis arguments, crashes down on his points.  His strained\nvoice rings with sincerity and anger.\n\nC.U. of PALANTINE as he speaks.  He is dressed in rolled-up\nshirtsleeves and sweat pours down his face.\n\n                         PALANTINE\n            The time has come to put an end to\n            the things that divide us: racism,\n            poverty, way -- and to those\n            persons who seek to divide us.\n            Never have I seen such a group of\n            high officials from the President\n            to Senate leaders to Cabinet\n            members...\n\n                                                           77.\n\n\nCUT TO TRAVIS: no expression.  PALANTINE's words are barely\ndistinguishable from a block away:\n\n                         PALANTINE\n                   (in distance)\n            ... pit black against white, young\n            against old, sow anger, disunity\n            and suspicion -- and all in the\n            name of the \"good of the country.\"\n            Well, their game is over.\n                   (applause)\n            All their games are over.  Now is\n            the time to stand up against such\n            foolishness, propaganda and\n            demagoguery.  Now is the time for\n            one man to stand up and accept his\n            neighbor, for one man to give in\n            order that all might receive.  Is\n            unity and love of common good such\n            a lost thing?\n\nALL LIVE SOUND CEASES as TRAVIS' narration begins.  He is\nreading from a letter or card he has just written.\n\nAs he speaks we see SHOTS of PALANTINE speaking, a seated\nrow of YOUNG BLACK PALANTINE red, white and blue bedecked\nCHEERLEADERS, SECRET SERVICE AGENTS examining the CROWD and\nso forth.  These SHOTS have no direct relationship to the\nnarration.\n\n                         TRAVIS (V.O.)\n                   (reading)\n            Dear Father and Mother,\n            June is the month, I remember,\n            which brings not only your wedding\n            anniversary, but also Father's Day\n            and Mother's birthday.  I'm sorry I\n            can't remember the exact dates, but\n            I hope this card will take care of\n            all of them.\n            I'm sorry I again can not send you\n            my address like I promised to last\n            year, but the sensitive nature of\n            my work for the Army demands utmost\n            secrecy.  I know you will\n            understand.\n            I am healthy and well and making\n            lots of money.  I have been going\n            with a girl for several months and\n            I know you would be proud if you\n            could see her.\n                         (MORE)\n\n                                                           78.\n\n\n                         TRAVIS (V.O.; CONT'D)\n            Her name is Betsy, but I can tell\n            you no more than that.\n                   (interrupted)\n\n\nAs TRAVIS reads third paragraph, a POLICEMAN is seen walking\nfrom behind TRAVIS' taxi to his window.\n\nThe POLICEMAN's voice come during a pause in the narration.\nLIVE SOUND RESUMES.\n\n                         POLICEMAN\n                   (standing near window)\n            Hey, cabbie, you can't park here.\n\n                         TRAVIS\n                   (penitent)\n            Sorry, officer.\n\n                         POLICEMAN\n            You waiting for a fare?\n\nPOLICEMAN leans his head in window, inspecting the cab.  As\nhe does, TRAVIS slides his right hand into the left side of\nhis jacket, ready to draw his revolver.\n\n                         TRAVIS\n            No, officer.\n\n                         POLICEMAN\n            All right, move it.\n\nTRAVIS starts up his taxi and drives off.\n\nLIVE SOUND again CEASES as TRAVIS resumes reading letter as\ntaxi drives away.\n\nAs TRAVIS reads final paragraph, scene CUTS TO INT. APARTMENT\nwhere TRAVIS sits at his table.\n\n                         TRAVIS (V.O.)\n                   (resuming reading)\n            I hope this card finds you all\n            well, as it does me.  I hope no one\n            has died.  Don't worry about me.\n            One day there will be a knock on\n            the door and it will be me.\n\n            Love, Travis.\n\nTRAVIS, at his desk, examines the card upon which he has\njust written this letter.\n\n                                                           79.\n\n\nC.U. cover of card.  It is a 25¢ Wedding Anniversary card\nwith a four-color embossed cover.  The design could only be\ndescribed as ur-kitsch.  A cartoon Mr. and Mrs. All-America\nstand before an outdoor barbecuing grill, clicking salt and\npepper shakers in a toast.  Sentiment reads:\n\n                      HAPPY ANNIVERSARY\n                         To a Couple\n                       Who Have Found\n                   the Perfect Combination\n                       For Marriage...\n\nThe card opens to read:\n\n                            LOVE!\n\nUnderneath the word \"Love!\" begins TRAVIS' short message to\nhis parents, a message which extends to the back cover of\nthe card.\n\n                                            CUT TO:\n\nNIGHT on the LOWER EAST SIDE.  TRAVIS sits parked in the\ndark shadows of a side street.  The lone wolf waits.\n\nTRAVIS watches the SLUM GODDESSES as they work the section\nof the street reserved for hippie hookers.\n\nTRAVIS' P.O.V.: some of the YOUNG STREET GIRLS are arrogant,\nalmost aggressive, others are more insecure and inexperienced.\n\nA BLACK MAN charges down the sidewalk across the street from\nTRAVIS.  He walks at a fast, maniacal clip, looking only at\nthe sidewalk in front of him.  Out of his mouth comes a\ncontinuous stream of invective: \"That-cock-sucking-crazy-no-\ngood-asshole-bitch-when-I-get-my-fucking-fingers-on-her-\nnigger-tits-I'm-gonna-ring-em-and-shit-up-her-ass...\" and so\non.  He is Out of Control.  Nobody seems to notice or care.\n\nTRAVIS takes a swig of peach brandy and continues his stake-\nout.\n\nFinally, TRAVIS spies the object of his search: IRIS walks\ndown the sidewalk with her GIRLFRIEND.  Iris wears her large\nblue sunglasses.\n\nTRAVIS checks to see if his .38 is in place (it is), opens\nthe door and exits from the cab.\n\nFlipping up the collar of his Army jacket, TRAVIS slouches\nover and walks toward IRIS.  He sort of sidles up next to\nher and walks beside her: TRAVIS always looks most suspicious\nwhen he's trying to appear innocent.\n\n                                                           80.\n\n\n                         TRAVIS\n                   (shy)\n            Hello.\n\n                         IRIS\n            You looking for some action?\n\n                         TRAVIS\n            Well...I guess so.\n\n                         IRIS\n                   (eyeing him)\n            All right.\n                   (a beat)\n            You see that guy over there?\n                   (nods)\n            His name is Sport.  Go talk to him.\n            I'll wait here.\n\nTravis' eyes follow Iris' nod until they reach Sport,\nstanding in a doorway in his lime green jacket.  Travis\nwalks toward him.\n\nSport, a thirtiesh white greaser, has the affections of a\nblack pimp.  His hips are jiving, his fingers softly snapping.\nHe sings to him self, \"Going to the chapel, gonna get\nmarried...\" His complexion is sallow; his eyes cold and\nvenal.  He could only seem romantic to a confused underaged\nrunaway.\n\n                         TRAVIS\n            You name Sport?\n\nSport immediately takes Travis for an undercover cop.  He\nextends his crosses wrists as if to be handcuffed.\n\n                         SPORT\n            Here, officer, take me in.  I'm\n            clean.  I didn't do it.  Got a\n            ticket once in Jersey.  That's all.\n            Honest, officer.\n\n                         TRAVIS\n            Your name Sport?\n\n                         SPORT\n            Anything you say, officer.\n\n                         TRAVIS\n            I'm no cop.\n                   (looks back at Iris)\n            I want some action.\n\n                                                           81.\n\n\n                         SPORT\n            I saw.  $20 fifteen minutes.  $30\n            half hour.\n\n                         TRAVIS\n            Shit.\n\n                         SPORT\n            Take it or leave it.\n\nTRAVIS digs in his pocket for money.\n\n                         SPORT\n            No, not me.  There'll be an elderly\n            gent to take the bread.\n\nTRAVIS turns to walk away.\n\n                         SPORT\n            Catch you later, Copper.\n\nTRAVIS freezes, not saying anything.  He turns back toward\nSPORT.\n\n                         TRAVIS\n            I'm no cop.\n\n                         SPORT\n            Well, if you are, it's entrapment\n            already.\n\n                         TRAVIS\n            I'm hip.\n\n                         SPORT\n            Funny, you don't look hip.\n                   (laughs)\n\n\nTRAVIS walks back to IRIS.\n\nIRIS motions for TRAVIS to follow her and he does.\n\nIRIS and TRAVIS turn the corner and walk about a block,\nsaying nothing.  IRIS turns into a darkened doorway and\nTRAVIS follows her.\n\nAt the top of the dark stairs IRIS and TRAVIS enter a dimly\nlit hallway.  On either side are doors with apartment\nnumbers.  IRIS turns toward the first door, No. 2.\n\n                         IRIS\n            This is my room.\n\n                                                           82.\n\n\nAt the far end of the darkened corridor sits a huge OLD MAN.\nHis face is obscured by shadow.  TRAVIS is about to enter\nthe room when the OLD MAN speaks up:\n\n                         OLD MAN\n            Hey cowboy!\n\nTRAVIS turns his head toward the OLD MAN who has stood up\nand is advancing toward him.\n\n                         OLD MAN\n                   (motioning to TRAVIS' jacket)\n            The rod.\n                   (a beat)\n            Gimme the rod, cowboy.\n\nTRAVIS hesitates a moment, uncertain what to do.  The OLD\nMAN reaches in TRAVIS' jacket and pulls out the .38 Special.\n\n                         OLD MAN\n            This ain't Dodge City, cowboy.  You\n            don't need no piece.\n                   (glances at watch)\n            I'm keepin' time.\n\nTRAVIS enters No. 2 with IRIS.\n\nTRAVIS looks around IRIS' room: although dimly lit, the room\nis brightly decorated.  There is an orange shag carpet, deep\nbrown walls and an old red velvet sofa.  On the walls are\nposters of Mick Jagger, Bob Dylan and Peter Fonda.  A Neil\nYoung album is playing on a small phonograph.\n\nThis is where IRIS lives: it bears the individual touch of a\nyoung girl.\n\nIRIS lights a cigarette, takes a single puff and places it\nin an ashtray on the bedstand.\n\n                         TRAVIS\n            Why you hang around with them\n            greasers?\n\n                         IRIS\n            A girl needs protection.\n\n                         TRAVIS\n            Yeah.  From the likes of them.\n\n                         IRIS\n                   (shrugs)\n            It's your time mister.  Fifteen\n            minutes ain't long.\n                   (gestures to cigarette)\n            That cigarette burns out, your time\n            is up.\n\n                                                           83.\n\n\nIRIS sits on the edge of the bed and removes her hat and\ncoat.  She takes off her blue-tinted sunglasses--her last\ndefense.  Without the paraphernalia of adulthood, Iris looks\nlike a little girl she is.  About 14, 15.\n\n                         TRAVIS\n            What's your name?\n\n                         IRIS\n            Easy.\n\n                         TRAVIS\n            That ain't much of a name.\n\n                         IRIS\n            It's easy to remember.  Easy Lay.\n\n                         TRAVIS\n            What's your real name?\n\n                         IRIS\n            I don't like my real name.\n\n                         TRAVIS\n                   (insistent)\n            What's your real name?\n\n                         IRIS\n            Iris.\n\n                         TRAVIS\n            That's a nice name.\n\n                         IRIS\n            That's what you think.\n\nIRIS unbuttons her shirt, revealing her small pathetic\nbreasts -- two young doves hiding from a winter wind.\nTRAVIS is unnerved by her partial nudity.\n\n                         TRAVIS\n            Don't you remember me?  Button your\n            shirt.\n\nIRIS buttons only the bottom button of her shirt.\n\n                         IRIS\n                   (examining him)\n            Why?  Who are you?\n\n                         TRAVIS\n            I drive a taxi.  You tried to get\n            away one night.  Remember?\n\n                                                           84.\n\n\n                         IRIS\n            No.\n\n                         TRAVIS\n            You tried to run away in my taxi\n            but your friend -- Sport -- wouldn't\n            let you.\n\n                         IRIS\n            I don't remember.\n\n                         TRAVIS\n            It don't matter.  I'm gonna get you\n            outta here.\n                   (looks toward door)\n\n\n                         IRIS\n            We better make it, or Sport'll get\n            mad.  How do you want to make it?\n\n                         TRAVIS\n                   (pressured)\n            I don't want to make it.  I came\n            here to get you out.\n\n                         IRIS\n            You want to make it like this?\n                   (goes for his fly)\n\n\nTRAVIS pushes her hand away.  He sits beside her on the edge\nof the bed.\n\n                         TRAVIS\n                   (taking her by the shoulders)\n            Can't you listen to me?  Don't you\n            want to get out of here?\n\n                         IRIS\n            Why should I want to get out of\n            here?  This is where I live.\n\n                         TRAVIS\n                   (exasperated)\n            But you're the one that wanted to\n            get away.  You're the one that came\n            into my cab.\n\n                         IRIS\n            I musta been stoned.\n\n                         TRAVIS\n            Do they drug you?\n\n                                                           85.\n\n\n                         IRIS\n                   (reproving)\n            Oh, come off it, man.\n\nIRIS tries to unzip TRAVIS' fly.  This only unnerves TRAVIS\nmore: sexual contact is something he's never really\nconfronted.\n\n                         TRAVIS\n            Listen...\n\n                         IRIS\n            Don't you want to make it?\n                   (a beat)\n            Can't you make it?\n\nIRIS works on TRAVIS' crotch OFF CAMERA.  He bats her hand\naway.\n\n                         TRAVIS\n                   (distraught)\n            I want to help you.\n\nTRAVIS is getting increasingly panicked, but IRIS only\nthinks this is part of his particular thing and tries to\novercome it.\n\n                         IRIS\n                   (catching on)\n            You can't make it, can you?\n                   (a beat)\n            I can help you.\n\nIRIS lowers her head to go down on TRAVIS.  TRAVIS, seeing\nthis, jumps up in panic.\n\nTRAVIS stands several feet from IRIS.  His fly is still\nopen, and the white of his underwear shows through his jeans.\nHe is starting to come apart.\n\n                         TRAVIS\n            Fuck it!  Fuck it!  Fuck it!  Fuck\n            it!  Fuck it!  Fuck it!  Fuck it!\n\n                         IRIS\n                   (confused)\n            You can do it in my mouth.\n\n                         TRAVIS\n            Don't you understand anything?\n\nIRIS says nothing.  After a moment, TRAVIS again sits on the\nbed beside IRIS.  She no longer tries to make him.\n\n                                                           86.\n\n\nThere is a moment of silence.  IRIS puts her arm around his\nshoulder.\n\n                         IRIS\n            You don't have to make it, mister.\n\nTRAVIS rests a moment, collecting himself.  Finally, he says:\n\n                         TRAVIS\n                   (slowly)\n            Do you understand why I came here?\n\n                         IRIS\n            I think so.  I tried to get into\n            your cab one night, and now you\n            want to come and take me away.\n\n                         TRAVIS\n            Don't you want to go?\n\n                         IRIS\n            I can leave anytime I want.\n\n                         TRAVIS\n            But that one night?\n\n                         IRIS\n            I was stoned.  That's why they\n            stopped me.  When I'm not stoned, I\n            got no place else to go.  They just\n            protect me from myself.\n\nThere is a pause.  TRAVIS smiles and shrugs apologetically.\nTRAVIS looks at Iris' cigarette.  It's burning down to the\nbutt.\n\n                         TRAVIS\n            Well, I tried.\n\n                         IRIS\n                   (compassionate)\n            I understand, mister.  It means\n            something, really.\n\n                         TRAVIS\n                   (getting up)\n            Can I see you again?\n\n                         IRIS\n            That's not hard to do.\n\n                         TRAVIS\n            No, I mean really.  This is nothing\n            for a person to do.\n\n                                                           87.\n\n\n                         IRIS\n            Sure.  All right.  We'll have\n            breakfast.  I get up about one\n            o'clock.  Tomorrow.\n\n                         TRAVIS\n                   (thinking)\n            Well tomorrow noon there's a... I\n            got a...\n\nIRIS is interfering with TRAVIS' assassination schedule.\n\n                         IRIS\n            Well, you want to or not?\n\n                         TRAVIS\n                   (deciding)\n            O.K. It's a date.  I'll see you\n            here, then.\n\nTRAVIS turns; IRIS smiles.\n\n                         TOM\n            Oh, Iris?\n\n                         IRIS\n            Yes?\n\n                         TOM\n            My name's Travis.\n\n                         IRIS\n            Thank you, Travis.\n\n                         TRAVIS\n            So long, Iris.\n                   (a beat)\n            Sweet Iris.\n                   (smiles)\n\n\nTRAVIS exits.\n\nTRAVIS closes the door to No. 2 and stands in the corridor\nfor a moment.\n\nThe OLD MAN slowly walks from the dark end of the hallway\nwith TRAVIS' .38 in his hand.  OLD MAN stands near TRAVIS,\nand checks his watch.\n\n                         OLD MAN\n                   (holding gun)\n            I think this is yours, cowboy.\n\n                                                           88.\n\n\nTRAVIS reaches in his jacket pocket and pulls out the\nfamiliar crumpled $20 bill.  He makes a big show of stuffing\nthe wrinkled bill into the OLD MAN's hand.  The OLD MAN\ndoesn't understand the significance of it.\n\n                         TRAVIS\n                   (restrained anger)\n            Here's the twenty bucks, old man.\n            You better damn well spend it right.\n\nTRAVIS turns and walks away.\n\nOLD MAN says as TRAVIS walks down stairs:\n\n                         OLD MAN\n            Come back anytime you want, cowboy.\n            But without the rod -- please.\n\nTRAVIS does not respond.\n\n                                            CUT TO:\n\nINT. ST. REGIS SUITE NOON\n\nPalantine, Tom and Palantine's Assistant are seated in\ngarishly decorated suite.\n\n                         ASSISTANT\n            Well, at least it wasn't chicken.\n\n                         PALANTINE\n            It wasn't?  I thought it was.  It\n            tasted like chicken.\n\n                         TOM\n            C'mon, Senator.  That was a class\n            dinner.  The St. Regis is a class\n            joint.  That was veal.\n\n                         PALANTINE\n            Was it?  It sure tasted like\n            chicken to me.\n                   (a beat)\n            Lately, everything tastes like\n            chicken to me.\n\n                         ASSISTANT\n            Everything?  Got to watch your gut.\n\n                         PALANTINE\n            What about it?  I took 20 off\n            before we started this thing.\n\n                                                           89.\n\n\n                         ASSISTANT\n            And you've put ten of it back on.\n\n                         PALANTINE\n            Ten?  I don't think so.  You really\n            think so?  Ten?\n\n                         TOM\n            Those TV cameras do.  I caught the\n            rally on CBS.  You looked a little\n            paunchy.\n\n                         PALANTINE\n            I don't think I gained ten pounds.\n\nPalantine gets up and walks over to the window.  Its bars\nform a cross-sight on his head.  He thinks to himself:\n\n                         PALANTINE\n                   (weary)\n            Jesus Christ.\n\nHe looks at the crowded traffic on Fifth Avenue eighteen\nfloors below.  It is a mass of yellow.\n\n                                            CUT TO:\n\nEXT. FIFTH AVE NOON\n\nTravis' cab pulls away from the yellow mass and heads\ndowntown.\n\n                                            CUT TO:\n\nEXT. DOWNTONE COFFEE SHOP NOON\n\nTravis' cab is parked near a neighborhood Bickford's.\n\n                                            CUT TO:\n\nTRAVIS and IRIS are having late breakfast at a middle-class\nEAST SIDE COFFEE SHOP.  It is about 1:30 P.M.\n\nIRIS is dressed more sensibly, wearing jeans and a maroon\nsweater.  Her face is freshly washed and her hair combed out.\n\nSeen this way, IRIS looks no different than any young girl\nin the big city.  OTHER PATRONS of the coffee shop most\nlikely assume she is having lunch with her big brother.\n\nThey are both having an All-American breakfast: ham and\neggs, large glasses of orange juice, coffee.\n\n                                                           90.\n\n\nOutside here environment, Iris seems the more pathetic.  She\nseems unsure, schizy, unable to hold a subject for more than\nthirty seconds.  Her gestures are too broad, her voice too\nmannered.  We sympathize with Travis' paternal respect.\nThis girl is in trouble.\n\n                         IRIS\n            ... and after that Sport and I just\n            started hanging out...\n\n                         TRAVIS\n            Where is home?\n\nIris removes her large blue-tinted sunglasses and fishes\nthrough her bag for another pair.\n\n                         IRIS\n            I got so many sunglasses.  I\n            couldn't live without my shades,\n            man.  I must have twelve pair of\n            shades.\n\nShe finds a pink-tinted pair and puts them on.\n\n                         TRAVIS\n            Where?\n\n                         IRIS\n            Pittsburgh.\n\n                         TRAVIS\n            I ain't ever been there, but it\n            don't seem like such a bad place.\n\n                         IRIS\n                   (voice rising)\n            Why do you want me to go back to my\n            parents?  They hate me.  Why do you\n            think I split?  There ain't nothin\n            there.\n\n                         TRAVIS\n            But you can't live like this.  It's\n            hell.  Girls should live at home.\n\n                         IRIS\n                   (playfully)\n            Didn't you ever hear of women's lib?\n\nThere is a short, quick silence; TRAVIS' eyes retract.  He\ngoes on:\n\n                                                           91.\n\n\n                         TRAVIS\n                   (ignoring her question)\n            Young girls are supposed to dress\n            up, go to school, play with boys,\n            you know, that kinda stuff.\n\nIris places a large gob of jam on her unbuttered toast and\nfolds the bread over like a hotdog.\n\n                         IRIS\n            God, you are square.\n\n                         TRAVIS\n                   (releasing pent-up tension)\n            At least I don't walk the streets\n            like a skunk pussy.  I don't screw\n            and fuck with killers and junkies.\n\nIRIS motions him to lower his voice.\n\n                         IRIS\n            Who's a killer?\n\n                         TRAVIS\n            That fella \"Sport\" looks like a\n            killer to me.\n\n                         IRIS\n            He never killed nobody.  He's a\n            Libra.\n\n                         TRAVIS\n            Huh?\n\n                         IRIS\n            I'm a Libra too.  That's why we get\n            along so well.\n\n                         TRAVIS\n            He looks like a killer.\n\n                         IRIS\n            I think Cancer's make the best\n            lovers.  My whole family are air\n            signs.\n\n                         TRAVIS\n            He shoots dope too.\n\n                         IRIS\n            What makes you so high and mighty?\n            Did you ever look at your own\n            eyeballs in a mirror.  You don't\n            get eyes like that from...\n\n                                                           92.\n\n\n                         TRAVIS\n            He's worse than an animal.  Jail's\n            too good for scum like that.\n\nThere is a brief silence.  Iris mind continued to whirl at\n78 rpms.  She seems to have three subjects on her mind at a\ntime.  She welcomes this opportunity to unburden herself.\n\n                         IRIS\n            Rock music died in 1970, that's\n            what I think.  Before that it was\n            fantastic.  I can tell you that.\n            Everybody was crashing, hanging out\n            at the Fillmore.  Me and my\n            girlfriend Ann used to go up the\n            fire escape, you know?  It was\n            unbelievable.  Rock Stars everywhere.\n            That Airplane--that's my group, man.\n            All Libras.  But now everybody's\n            split or got sick or busted.  I\n            think I'll move to one of those\n            communes in Vermont, you know?\n            That's where all the smart ones\n            went.  I stayed here.\n\n                         TRAVIS\n            I never been to a commune.  I don't\n            know.  I saw pictures in a magazine,\n            and it didn't look very clean to me.\n\n                         IRIS\n            Why don't you come to a commune\n            with me?\n\n                         TRAVIS\n            Me?  I could never go to a place\n            like that.\n\n                         IRIS\n            Why not?\n\n                         TRAVIS\n                   (hesitant)\n            I... I don't get along with people\n            like that.\n\n                         IRIS\n            You a scorpion?  That's it.  You're\n            a scorpion.  I can tell.\n\n                         TRAVIS\n            Besides, I've got to stay here.\n\n                                                           93.\n\n\n                         IRIS\n            Why?\n\n                         TRAVIS\n            I've got something important to do.\n            I can't leave.\n\n                         IRIS\n            What's so important?\n\n                         TRAVIS\n            I can't say -- it's top secret.\n            I'm doing something for the Army.\n            The cab thing is just part time.\n\n                         IRIS\n            You a narc?\n\n                         TRAVIS\n            Do I look like a narc?\n\n                         IRIS\n            Yeah.\n\nTRAVIS breaks out in his big infectious grin, and IRIS joins\nhis laughter.\n\n                         IRIS\n            God, I don't know who's weirder,\n            you or me.\n\n                         TRAVIS\n                   (pause)\n            What are you going to do about\n            Sport and that old bastard?\n\n                         IRIS\n            Just leave'em.  There's plenty of\n            other girls.\n\n                         TRAVIS\n            You just gonna leave 'em?\n\n                         IRIS\n                   (astonished)\n            What should I do?  Call the cops?\n\n                         TRAVIS\n            Cops don't do nothin.\n\n                         IRIS\n            Sport never treated me bad, honest.\n            Never beat me up once.\n\n                                                           94.\n\n\n                         TRAVIS\n            You can't leave 'em to do the same\n            to other girls.  You should get rid\n            of them.\n\n                         IRIS\n            How?\n\n                         TRAVIS\n                   (shrugs)\n            I don't know.  Just should, though.\n                   (a beat)\n            Somebody should kill 'em.  Nobody'd\n            miss 'em.\n\n                         IRIS\n                   (taken back)\n            God.  I know where they should have\n            a commune for you.  They should\n            have a commune for you at Bellevue.\n\n                         TRAVIS\n                   (apologetic/sheepish)\n            I'm sorry, Iris.  I didn't mean that.\n\n                         IRIS\n            You're not much with girls, are you?\n\n                         TRAVIS\n                   (thinks)\n            Well, Iris, I look at it this way.\n            A lot of girls come into my cab,\n            some of them very beautiful.  And I\n            figure all day long men have been\n            after them: trying to touch them,\n            talk to them, ask them out.  And\n            they hate it.  So I figure the best\n            I can do for them is not bother\n            them at all.  So I don't say a\n            thing.  I pretend I'm not even\n            there.  I figure they'll understand\n            that and appreciate me for it.\n\nIt takes IRIS a moment to digest this pure example of\nnegative thinking: I am loved to the extent I do not exist.\n\n                         IRIS\n            Do you really think I should go to\n            the commune?\n\n                                                           95.\n\n\n                         TRAVIS\n            I think you should go home, but\n            otherwise I think you should go.\n            It would be great for you.  You\n            have to get away from here.  The\n            city's a sewer, you gotta get out\n            of it.\n\nMumbling something about her \"shades\" again, Iris fishes\nthrough her bag until she comes up with another 99¢ pair of\nsunglasses and puts them on.  She likes these better, she\ndecides.\n\n                         IRIS\n            Sure you don't want to come with me?\n\n                         TRAVIS\n            I can't.  Otherwise, I would.\n\n                         IRIS\n            I sure hate to go alone...\n\n                         TRAVIS\n            I'll give you the money to go.  I\n            don't want you to take any from\n            those guys.\n\n                         IRIS\n            You don't have to.\n\n                         TRAVIS\n            I want to -- what else can I do\n            with my money?\n                   (thinks)\n            You may not see me again--for a\n            while.\n\n                         IRIS\n            What do you mean?\n\nCLOSE on C.U. of TRAVIS:\n\n                         TRAVIS\n            My work may take me out of New York.\n\n                                            CUT TO:\n\nIRIS' ROOM - DAY\n\nSport stands beside the bed.\n\n                         SPORT\n            What's the matter, baby, don't you\n            feel right?\n\n                                                           96.\n\n\nIris is wearing her blue-tinted shades.\n\n                         IRIS\n            It's my stomach.  I got the flu.\n\nSport puts his hand on her hips.  He is slowly, carefully,\nsmoothly manipulating her.  It's the stone black hustle.\n\n                         SPORT\n            Oh, baby, there ain't no flu.  You\n            know that, baby.\n\n                         IRIS\n            Honest, Sport.\n\nSport puts some slow soul music on the stereo.\n\n                         SPORT\n            You're just tired, baby.  You just\n            need your man.  I am your man, you\n            know.  You are my woman.  I wouldn't\n            be nothing without you.\n\nSport slowly grinds his hips to hers.  Iris starts to move\nwith him.  This is what she really wanted.  Her man's\nattention.\n\n                         SPORT\n            I know this may not mean anything\n            to you, baby, but sometimes I get\n            so emotional, sometimes I think, I\n            wish every man could have what I\n            have now, that every woman could be\n            loved the way I love you.  I go\n            home and I think what it would be\n            without you, and then I thank God\n            for you.  I think to myself, man,\n            you are so lucky.  You got a woman\n            who loves you, who needs you, a\n            woman who keeps you strong.  It's\n            just you and me.  I'm nothing\n            without you.  I can go like this\n            for ever and ever.  We can do it,\n            baby.  You and me.  Just you and me.\n\nSport slowly rubs his crotch into her.  Iris smiles.  She is\nhappy.  The music rises.\n\n                                            CUT TO:\n\nFIRING RANGE - DAY\n\nTRAVIS stands at the firing range blasting the .44 Magnum\nwith a rapid-fire vengeance.\n\n                                                           97.\n\n\nHe sets down one gun, picks up the next, then the next.\nQuickly reloading, he fires again.\n\nThe targets spin and dance under his barrage.  The piercing\nsound of GUNSHOTS ring through the air.\n\n                                            CUT TO:\n\nINT. APARTMENT\n\nTRAVIS is again writing at the table.  His western shirt is\nopen, exposing his bare chest.\n\nA note of despair and doom has entered into TRAVIS' normally\nmonotone narration voice: this will be the last entry in his\ndiary.\n\n                         TRAVIS (V.O.)\n            My whole life has pointed in one\n            direction.  I see that now.  There\n            never has been any choice for me.\n\n                                            CUT TO:\n\nLENGTHY P.O.V. SHOT from TRAVIS' taxi: we see New York's\nnightlife as TRAVIS sees it.  CAMERA TRACKS down midtown\nsidewalks in SLIGHTLY SLOW MOTION.  There we see:\n\nCOUPLES, walking in SLOWING MOTION, young couples, middle-\naged couples, old couples, hookers and johns, girlfriends,\nboyfriends, business friends -- the whole world matched up\nin pairs, and TRAVIS left wandering alone in the night.\n\nOthers would notice the breasts, the asses, the faces, but\nnot TRAVIS: he notices the girl's hand that rubs the hair on\nher boyfriend's neck, the hand that hangs lightly on his\nshoulder, the nuzzling kiss in the ear.\n\n                         TRAVIS (V.O.) (CONTD)\n            Loneliness has followed me all my\n            life.  The life of loneliness\n            pursues me wherever I go: in bars,\n            cars, coffee shops, theaters,\n            stores, sidewalks.  There is no\n            escape.  I am God's lonely man.\n\nMATCHCUT TO P.O.V.: another neighborhood, LATER IN THE NIGHT.\nStill in SLIGHTLY SLOW MOTION.\n\nThe CROWDS are more sparse here, the streets darker.  A\nJUNKIE shudders in a doorway, a WINO pukes into a trash can,\na STREET-WALKER meets a prospective CLIENT.\n\n                                                           98.\n\n\n                         TRAVIS (V.O.) (CONTINUED)\n            I am not a fool.  I will no longer\n            fool myself.  I will no longer let\n            myself fall apart, become a joke\n            and object of ridicule.  I know\n            there is no longer any hope.  I\n            cannot continue this hollow, empty\n            fight.  I must sleep.  What hope is\n            there for me?\n\n                                            CUT TO:\n\nINT. APARTMENT\n\nTRAVIS, his shirt fastened, stands beside table.\n\nC.U.: He lays a brief hand-written letter on the table.  We\nread it.\n\n                         Dear Iris,\n This money should be enough for your trip.  By the time you\n                  read this I will be dead.\n\n                           Travis\n\nTRAVIS stacks five crisp hundred dollar bills beside the\nletter, folds them up with the letter, and puts them into an\nenvelope.\n\nTIMECUT: A SHORT WHILE LATER.  TRAVIS has cleaned up his\napartment.  Everything is neat and orderly.\n\nCAMERA PANS across room.  The mattress is bare and flattened\nout, the floor is spotless, the cans and bottles of food and\npills put out of sight.  The wall is still covered with\nPalantine political paraphernalia, but when we reach the\ndesk we see only four items there: an open diary and three\nloaded revolvers: .44, .38, .25.\n\nTRAVIS, freshly shaved and neatly dressed, stands in the\nmiddle of his clean room.  The empty holster hangs on his\nshoulder.  Metal .25 gliders can be seen under the slit in\nhis right sleeve.  He turns toward table.\n\n                                            CUT TO:\n\nTRAVIS, envelope in hand, closes the door behind him and\nwalks down the corridor.\n\nHe passes a ajar door and we are suprised to see the room is\nempty--and trashed.  Travis lives in a decaying, if not\ncondemned building.\n\n                                                           99.\n\n\nEXT.\n\nTRAVIS places the envelope to IRIS in his mail box.\n\nBACK IN APARTMENT.  CAMERA CLOSE ON revolvers lying on the\ntable in neat array.\n\n                                            CUT TO:\n\nFADE IN:\n\nSOUND of a political rally: cheering, laughing, a band\nplaying, talking.\n\nAFTERNOON.  A CROWD of about 500 PERSONS is assembled before\na platform outside a Brooklyn union hall.  A DIXIELAND BAND\nis playing on the platform.\n\nC.U. CHARLES PALANTINE's feet climb out of a limousine.\nThere is a ROAR from the nearby CROWD.\n\nPALANTINE, a bulky SECRET SERVICE MAN to the right and left\nof him, pushes his way through the CROWD toward the platform.\nStill cameras click, and TV cameras purr.\n\nSLIGHT TIMECUT: PALANTINE is speaking on the platform.\n\n                                            CUT TO:\n\nTRAVIS' empty taxi sits parked a few blocks away from rally.\nAt this distance, the rally sounds are almost\nindistinguishable.\n\nC.U. of TRAVIS' boots walking.  They make their way past one\nperson, then two, then a cluster of three or four.  SOUNDS\nof rally increase.\n\nWe see a FULL FIGURE SHOT of TRAVIS: he is standing alone in\nan opening near the fringes of the CROWD.\n\nTRAVIS looks like the most suspicious human being alive.\nHis hair is cropped short, he wears mirror-reflecting\nglasses.  His face is pallid and drained of color, his lips\nare pursed and drawn tight.  He looks from side to side.\nOne can now see the full effect of TRAVIS' lack of sleep and\nsufficient diet -- he looks sick and frail.\n\nEven though it is a warm June day, TRAVIS is bundled up in a\nshirt, sweater and Army jacket buttoned from top to bottom.\nUnder his jacket are several large lumps, causing his upper\ntorso to look larger than it should.  He is slightly hunched\nover and his hands shoved into his pockets.\n\n                                                          100.\n\n\nAnyone scanning the crowd would immediately light upon\nTRAVIS and think, \"There is an assassin.\"\n\nTRAVIS pulls the vial of red pills from his pocket and\nswallows a couple.\n\n                                            CUT TO:\n\nSECRET SERVICE MAN standing beside the platform, scanning\nthe CROWD.  It is the same SECRET SERVICE MAN TRAVIS spoke\nto at the first rally.  TOM, dressed in a conservative suit,\nstands beside him.\n\nPALANTINE is wrapping up his short speech:\n\n                         PALANTINE\n            ... and with your help we will go\n            on to victry at the polls Tuesday.\n                   (applause)\n\n\nTRAVIS begins moving up into the crowd.\n\n                         PALANTINE (CONTD)\n            On to victory in Miami Beach next\n            month\n                   (building applause)\n            and on to victory next November!\n\nPALANTINE steps back, smiling and receiving the applause.\nThen, nodding, at the SECRET SERVICE MAN he descends the\nstairs and prepares to work his way through the CROWD.\n\nTRAVIS unbuttons the middle two buttons of his jacket,\nopening access to his holster.  With the other hand he\nchecks the .44 hooked behind his back.\n\nPALANTINE smiles and shakes a few of the many hands\noutstretched toward him.\n\nThe SECRET SERVICE MAN, scanning the CROWD, spots something\nthat interests him.  He looks closely.\n\nSECRET SERVICE MAN'S P.O.V.: TRAVIS, his face intense,\npushes his way through the CROWD.\n\nPALANTINE works his way through crowds and cameras.\n\nSECRET SERVICE MAN motions to SECOND SECRET SERVICE MAN and\npoints in TRAVIS' direction.\n\nTRAVIS slips his hand into his jacket.\n\n                                                          101.\n\n\nThe SECOND SECRET SERVICE MAN converges on TRAVIS from the\nside.\n\nTRAVIS and PALANTINE draw closer to each other.\n\nSECRET SERVICE MAN, walking just behind PALANTINE, grabs the\ncandidate's hand and pulls him backward.  PALANTINE looks\nsharply back at SECRET SERVICE MAN who motions for him to\ntake a slightly altered route.\n\nTRAVIS sees this: his eyes meet the SECRET SERVICE MAN's.\nHe recognizes the situation.  To his right he spots the\nSECOND SECRET SERVICE MAN.\n\nTRAVIS' eyes meet PALANTINE's: candidate and would-be\nassassin exchange quick glances.\n\nTRAVIS hastily works his way back through the CROWD.  He\nhears the SECRET SERVICE MAN's voice call out:\n\n                         SECRET SERVICE MAN\n            Detain that man!\n\nOVERHEAD SHOT reveals TRAVIS has the jump on his pursuers.\nHe is breaking free of the CROWD while they are still mired\nin it.\n\nTRAVIS, free of his pursuers, quickly makes his way down the\nsidewalks.  The SECRET SERVICE MEN look futilely about.\n\nTRAVIS jumps in his cab.  Sweat covers his face.\n\n                                            CUT TO:\n\nThe film is moving fast now; it pushes hard and straight\ntoward its conclusion.  We're moving toward the kill.\n\nLATE AFTERNOON.  TRAVIS' taxi skids around a corner and\nspeeds into Manhattan.\n\nTRAVIS checks his mail slot: the letter to IRIS has already\nbeen picked up by the MAILMAN.\n\nTRAVIS, stripped to the waist, walks back and forth across\nhis INT. APARTMENT, wiping his torso with a bath towel.\n\nTRAVIS begins dressing:\n\n-- He straps the Army combat knife to his calf.\n\n-- He reflexes the metal gliders and the Colt .25 on his\nright forearm.\n\n                                                          102.\n\n\nINTERCUT: SPORT stands in his doorway on the LOWER EAST SIDE\nshot with LONG DISTANCE LENS.  It is EARLY EVENING.\n\nINTERCUT: A pudgy middle-aged white PRIVATE COP walks up to\nSPORT.  The two men laugh, slap each other on the back and\nexchange a soul shake.  They discuss a little private\nbusiness and the PRIVATE COP walks off in the direction of\nIRIS' apartment.\n\n-- TRAVIS straps on holster and fits the .38 Special into it.\n\nINTERCUT: PRIVATE COP walks down block.\n\n-- TRAVIS hooks the huge Magnum into the back of his belt.\nHe puts on his Army jacket and walks out the door.\n\nINTERCUT: PRIVATE COP turns up darkened stairway to IRIS'\napartment.\n\nNIGHT has fallen: TRAVIS' taxi careens down 10th Ave.  He\nspeeds, honks, accelerates quickly.  The glare of speeding\nyellow and red lights flash through the night.\n\nTRAVIS' P.O.V.: PEDESTRIAN attempts to flag down TRAVIS'\ntaxi, but quickly steps back up on the curb when he sees\nTRAVIS has no intention of stopping for anything.\n\nINTERCUT: SPORT maintains his post in the dark doorway.  He\nwaves to a GIRL who passes, and she waves back.\n\nTRAVIS' taxi screeches to a stop and parks obliquely against\nthe curb.\n\n                                            CUT TO:\n\nTRAVIS walks down the block to the doorway where SPORT\nstands.  CAMERA TRACKS with TRAVIS.\n\nWithout slowing, TRAVIS walks up to SPORT and puts his arm\non his shoulder in a gesture of friendliness.\n\n                         TRAVIS\n            Hey, Sport.  How are things?\n\n                         SPORT\n                   (shrugs)\n            O.K., cowboy.\n\n                         TRAVIS\n                   (needling him)\n            How are things in the pimp business,\n            hey Sport?\n\n                                                          103.\n\n\n                         SPORT\n            What's going on?\n\n                         TRAVIS\n            I'm here to see Iris.\n\n                         SPORT\n            Iris?\n\nTRAVIS pushes SPORT back into the dark recesses of the\ncorridor.\n\n                         SPORT\n            Wha -- ?\n\n                         TRAVIS\n            Yeah, Iris.  You know anybody by\n            that name?\n\n                         SPORT\n            No.\n                   (beat)\n            Hillbilly, you'd better get your\n            wise ass outa here and quick, or\n            you're gonna be in trouble.\n\nTRAVIS is being propelled by an inner force, a force which\ntakes him past the boundaries of reason and self-control.\n\n                         TRAVIS\n                   (restrained anger)\n            You carry a gun?\n\nSPORT looks into TRAVIS' eyes, saying nothing: he realizes\nthe seriousness of the situation.\n\nTRAVIS pulls his .38 Special and holds it on SPORT, pushing\nhim even further back against the wall.\n\n                         TRAVIS\n            Get it.\n\n                         SPORT\n                   (submissive)\n            Hey, mister, I don't know what's\n            going on here.  This don't make any\n            sense.\n\n                         TRAVIS\n                   (demanding)\n            Show it to me.\n\nSPORT reluctantly pulls a .32 caliber pistol (a \"purse gun\")\nfrom his pocket and holds it limply.\n\n                                                          104.\n\n\nTRAVIS sticks his .38 into SPORT's gut and discharges it.\nThere is a muffled blast, followed by a muted scream of pain.\n\n                         TRAVIS\n            Now suck on that.\n\nAgony and shock cross SPORT'S face as he slumps to the floor.\nTRAVIS turns and walks away before SPORT even hits.\n\nAs TRAVIS walks away, SPORT can be seen struggling in the b.g.\n\nTRAVIS, he gun slipped into his jacket, walks quickly up the\nsidewalk.\n\nAROUND THE CORNER, TRAVIS walks into the darkened stairway\nleading to IRIS' apartment.\n\nAs he walks up the stairs, TRAVIS pulls the .44 Magnum from\nbehind his back and transfers the .38 Special to his left\nhand.  He walks up the steps, a pistol dangling from each\nhand.\n\nAT THE TOP OF THE STAIRS, TRAVIS spots THE OLD MAN sitting\nat the far end of the dark corridor.  THE OLD MAN starts to\nget up when TRAVIS discharges the mighty .44 at him.  BLAAM!\nThe hallway reverberates with shock waves and gun powder.\n\nTHE OLD MAN staggers at the end of the corridor: his right\nhand has been blown off at the forearm.\n\nThere is the sharp SOUND of a GUNSHOT behind TRAVIS: his\nface grimaces in pain.  A bullet has ripped through the left\nside of his neck.  Blood flows over his left shoulder.\n\nTRAVIS' .44 flies into the air.\n\nTRAVIS looks down the stairway: there SPORT lies choking in\na puddle of his own blood.  He has struggled long enough to\nfire one shot.\n\nFalling, TRAVIS drills another .38 slug into SPORT's back\nbut SPORT is already dead.\n\nTRAVIS slumps to his knees.  Down the corridor THE OLD MAN\nwith a bloody stump is struggling toward him.  TRAVIS turns\nhis .38 toward THE OLD MAN.\n\nThe door to No. 2 opens: IRIS' scream is heard in the b.g.\nThe bulky frame of the PRIVATE COP fills the doorway.  His\nblue shirt is open, in his hand hangs a .38 service revolver.\n\nThe PRIVATE COP raises his gun and shoots TRAVIS.  TRAVIS,\nblood gushing from his right shoulder, sinks to the floor.\nHis .38 clangs down the stairs.\n\n                                                          105.\n\n\nTHE OLD MAN grows closer.  TRAVIS smashes his right arm\nagainst the wall, miraculously, the small Colt .25 glides\ndown his forearm into his palm.\n\nTRAVIS fills the PRIVATE COP's face full of bullet holes.\n\nThe PRIVATE COP, SCREAMING, crashes back into the room.\n\nTHE OLD MAN crashes atop TRAVIS.  The .25 falls from TRAVIS'\nhand.\n\nBoth men are bleeding profusely as they thrash into IRIS'\nroom.  IRIS hides behind the old red velvet sofa, her face\nfrozen in fright.\n\nTRAVIS, trapped under the heavy OLD MAN, reaches down with\nhis right hand and pulls the combat knife from his right calf.\n\nJust as TRAVIS draws back the knife, THE OLD MAN brings his\nhuge left palm crashing down on TRAVIS: THE OLD MAN's palm\nis impaled on the knife.\n\nOLD MAN SCREAMS in pain.\n\nPolice SIRENS are heard in b.g.\n\nWith great effort, TRAVIS turns over, pinning THE OLD MAN to\nthe floor.  The bloody knife blade sticks through his\nupturned hand.\n\nTRAVIS reaches over with his right hand and picks up the\nrevolver of the new dead PRIVATE COP.\n\nTRAVIS hoists himself up and sticks the revolver into the\nOLD MAN's mouth.\n\nTHE OLD MAN's voice is full of pain and ghastly fright:\n\n                         OLD MAN\n            Don't kill me!  Don't kill me!\n\nIRIS screams in b.g.  TRAVIS looks up:\n\n                         IRIS\n            Don't kill him, Travis!  Don't kill\n            him!\n\nTRAVIS fires the revolver, blowing the back of THE OLD MAN's\nhead off the silencing his protests.\n\nThe police SIRENS screech to a halt.  SOUND of police\nofficers running up the stairs.\n\n                                                          106.\n\n\nTRAVIS struggles up and collapses on the red velvet sofa,\nhis blood-soaked body blending with the velvet.\n\nIRIS retreats in fright against the far wall.\n\nFirst uniformed POLICE OFFICER rushes in room, drawn gun in\nhand.  Other POLICEMEN can be heard running up the stairs.\n\nTRAVIS looks helplessly up at the OFFICER.  He forms his\nbloody hand into a pistol, raises it to his forehead and,\nhis voice croaking in pain, makes the sound of a pistol\ndischarging.\n\n                         TRAVIS\n            Pgghew!  Pgghew!\n\nOut of breath fellow OFFICERS join the first POLICEMAN.\nThey survey the room.\n\nTRAVIS' head slumps against the sofa.\n\nIRIS is huddled in the corner, shaking.\n\nLIVE SOUND CEASES.\n\nOVERHEAD SLOW MOTION TRACKING SHOT surveys the damage:\n\n-- from IRIS shaking against the blood-spattered wall\n\n-- to TRAVIS blood-soaked body lying on the sofa\n\n-- to THE OLD MAN with half a head, a bloody stump for one\n   hand and a knife sticking out the other\n\n-- to POLICE OFFICERS staring in amazement\n\n-- to the PRIVATE COP's bullet-ridden face trapped near the\n   doorway\n\n-- to puddles of blood and a lonely .44 Magnum lying on the\n   hallway carpet.\n\n-- down the blood-specked stairs on which lies a nickle-\n   plated .38 Smith and Wesson Special\n\n-- to the foot of the stairs where SPORT's body is hunched\n   over a pool of blood and a small .32 lies near his hand\n\n-- to CROWDS huddled around the doorway, held back by POLICE\n   OFFICERS\n\n-- past red flashing lights, running POLICEMEN and parked\n   police cars\n\n                                                          107.\n\n\n-- to the ongoing nightlife of the Lower East Side, curious\n   but basically unconcerned, looking then heading its own\n   way.\n\n                                            FADE TO:\n\nFADE IN:\n\nEXT. TRAVIS' APARTMENT - DAY\n\nIt is EARLY FALL.  The trees are losing their leaves.\n\n                                            CUT TO:\n\nSLOW TRACKING SHOT across INT. APARTMENT.  Room appears\npretty much the same, although there is a new portable TV\nand an inexpensive easy chair.\n\nVISUAL: TRACK begins at table and works across the room to\nthe mattress.\n\nWe see these items:\n\n-- On the table rests the diary, closed.  A desk calendar\nstands on the table: it is October.\n\n-- Across the wall where the Palantine clippings once hung\nthere are now a series of new newspaper clippings.  Right to\nleft, they read:\n\n1. The first is a full back page from the N.Y. Daily News.\nHeadline reads: \"CABBIE BATTLES GANGSTERS.\" There are large\nphotos of police standing in IRIS' room after the slaughter,\nand a picture of TRAVIS' cabbie mug shot.\n\n2. Underneath there is a more discreet clipping without\nphoto from the N.Y. Times.  Two-column headline reads:\n\"Cabbie Shootout, Three Dead.\"\n\n3. A follow-up story from the News.  Two-column photo shows\nplain middle-aged couple sitting in middle-class living room.\nTwo-column headline reads: \"Parents Express Shock, Gratitude.\"\n\n4. A two-column Daily News story without photo.  Headline\nreads: \"Taxi-Driver Hero to Recover.\"\n\n5. A one-column two-paragraph News story stuck on an obscure\npage.  Headline reads: \"Cabbie Returns to Job.\"\n\n-- At the end of the clippings, a letter is tacked to the\nwall.  It is a simple letter hand-written on plain white\npaper.  The handwriting makes a conscious effort to appear\nneat and orderly.  We recognize that it is the same letter\nthat is being read in voice over.\n\n                                                          108.\n\n\n-- When we finally arrive at the mattress, we find it is\nbarren.  A pillow and blanket (new purchases) are folded at\nthe head of the mattress.\n\nAUDIO: THROUGHOUT THE TRACK, we hear the voice of a middle-\naged uneducated man reading in voice over.\n\nIt is the voice of IRIS' FATHER and he is reading a letter\nhe sent to TRAVIS, and which TRAVIS has tacked to his wall.\n\n                         IRIS' FATHER (V.O.)\n            Dear Mr. Bickle,\n\n            I can't say how happy Mrs. Steensma\n            and I were to hear that you are\n            well and recuperating.  We tried to\n            visit you at the hospital when we\n            were in New York to pick up Iris,\n            but you were still in a coma.\n\n            There is no way we can repay you\n            for returning our Iris to us.  We\n            thought we had lost her, but now\n            our lives are full again.  Needless\n            to say, you are something of a hero\n            around this household.\n\n            I'm sure you want to know about\n            Iris.  She is back in school and\n            working hard.  The transition has\n            been very hard for her, as you can\n            well imagine, but we have taken\n            steps to see she never has cause to\n            run away again.\n\n            In conclusion, Mrs. Steensma and I\n            would like to again thank you from\n            the bottom of our hearts.\n            Unfortunately, we cannot afford to\n            come to New York again to thank you\n            in person, or we surely would.  But\n            if you should ever come to\n            Pittsburgh, you would find yourself\n            a most welcome guest in our home.\n\n            Our deepest thanks,\n\n            Burt and Ivy Steensma\n\n                                            CUT TO:\n\nEXT. PLAZA HOTEL - NIGHT\n\nFour cabs stand in the waiting line in front of the hotel.\n\n                                                          109.\n\n\nNear the entrance, TRAVIS and WIZARD stand in the light\ntalking.\n\nTRAVIS' hair is almost fully grown back to its normal length.\nTRAVIS wears the same clothes -- cowboy boots, jeans,\nwestern shirt, Army jacket -- but he isn't wearing a gun.\nThere is a thick scar on the left side of his neck.\n\nWizard is speaking.\n\n                         WIZARD\n            A private-owner wanted to swap\n            wheels.  Now my tires were brand\n            new. \"Give me a couple days,\" I says.\n\nCHARLIE T. parks his cab in line and walks toward TRAVIS and\nWIZARD.\n\n                         CHARLIE T\n            Howdy Wizard, Killer.\n\nCHARLIE T. points his pistol/finger at TRAVIS, fires, says\n\"Pow\" and laughs.\n\n                         CHARLIE T (CONTD)\n                   (casual joking)\n            Don't mess with the Killer.\n\n                         TRAVIS\n                   (smiles)\n            Hey Charlie T.\n\n                         WIZARD\n            Howsit, Charlie?\n                   (pause)\n            Hey Travis, I think you gota fare.\n\nThey all turn.  P.O.V. of DOORMAN closing rear door of\nTRAVIS' taxi.\n\n                         TRAVIS\n            Shit.\n                   (runs off)\n\n\n                         CHARLIE T\n            Take it slow, Killer.\n\nTRAVIS waves back to CHARLIE T. and WIZARD as he runs around\ncab and jumps in the driver's seat.\n\nTRAVIS' taxi pulls away.\n\nC.U. TRAVIS at the wheel.  A FEMALE VOICE says:\n\n                                                          110.\n\n\n                         FEMALE VOICE\n            34 East 56th Street.\n\nTRAVIS recognizes the voice.  He looks in the rear-view\nmirror: It is BETSY.\n\nTRAVIS says nothing: he heads toward 56th Street.\n\nAfter a silence, BETSY speaks:\n\n                         BETSY\n            Hello, Travis.\n\n                         TRAVIS\n            Hello, Betsy.\n\nThere is an uneasy pause.\n\n                         TRAVIS\n            I see where Palantine got the\n            nomination.\n\n                         BETSY\n            Yes.  It won't be long now.\n            Seventeen days.\n\n                         TRAVIS\n            Well, I hope he wins.\n\nThere is another pause.\n\n                         BETSY\n                   (concerned)\n            How are you, Travis?  I read about\n            you in the papers.\n\n                         TRAVIS\n            Oh, I got over that.  It was\n            nothing, really.  The papers always\n            blow these things up.\n                   (a beat)\n            A little stiffness.  That'll go\n            away.  I just sleep more, that's all.\n\nEXT.\n\nTRAVIS' taxi pulls up to 34 East 56th Street.\n\n                         TRAVIS\n            Here we are.\n\nBETSY digs in her purse.\n\n                                                          111.\n\n\n                         TRAVIS\n                   (protesting)\n            No, no, please.  This fare's on me.\n            Please.\n\n                         BETSY\n            Thank you, Travis.\n\nBETSY gets out of the cab and stands by the right front\nwindow, which is open.\n\nTRAVIS prepares to drive away.\n\n                         BETSY\n            Travis?\n\n                         TRAVIS\n            Yeah.\n\n                         BETSY\n            Maybe I'll see you again sometime,\n            huh?\n\n                         TRAVIS\n                   (thin smile)\n            Sure.\n\nBETSY steps away from the curb and TRAVIS drives off.  She\nwatches his taxi.\n\nCAMERA FOLLOWS TRAVIS' taxi as it slowly disappears down\n56th Street.\n\nSUPERIMPOSE TITLES: THE END\n\n\n\n\n\n\nTaxi Driver\nWriters :   Paul Schrader\nGenres :   Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:36:58.886021"}