{"title": "Terminator 2: Judgement Day", "film_link": "/Movie Scripts/Terminator 2: Judgement Day Script.html", "script_link": "/scripts/Terminator-2-Judgement-Day.html", "info_raw": "\n\nTerminator 2: Judgement Day Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.45 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  James Cameron  William Wisher\nGenres  Sci-Fi  Action  Thriller  Drama\nScript Date :  1991\n\nRead \"Terminator 2: Judgement Day\" Script\n\n\n", "script": "\n\n\t\t\n\n                          \"TERMINATOR 2: JUDGEMENT DAY\"\n\n                                 a Screenplay\n\n                                      by\n\n                                 James Cameron\n\n                                      and\n\n                                 William Wisher\n\n\n\n\n        Revised final shooting script\n\n\n\n1       EXT. CITY STREET - DAY\n\n        Downtown L.A.  Noon on a hot summer day.  On an EXTREME LONG LENS the\n        lunchtime crowd stacks up into a wall of humanity.  In SLOW MOTION\n        they move in herds among the glittering rows of cars jammed bumper to\n        bumper.  Heat ripples distort the torrent of faces.  The image is\n        surreal, dreamy... and like a dream it begins very slowly to\n\n                                                DISSOLVE TO:\n\n2       EXT. CITY RUINS - NIGHT\n\n        Same spot as the last shot, but now it is a landscape in Hell.  The\n        cars are stopped in rusted rows, still bumper to bumper.  The\n        skyline of buildings beyond has been shattered by some\n        unimaginable force like a row of kicked-down sandcastles.\n        Wind blows through the desolation, keening with the sound of ten\n        million dead souls.  It scurries the ashes into drifts, stark\n        white in the moonlight against the charred rubble.\n        A TITLE CARD FADES IN:\n\n                        LOS ANGELES, July 11, 2029\n\n3       ANGLE ON a heap of fire-blackened human bones.  Beyond the mound is a\n        vast tundra of skulls and shattered concrete.  The rush hour crowd\n        burned down in their tracks.\n\n4       WE DISSOLVE TO a playground... where intense heat has half-melted the\n        jungle gym, the blast has warped the swing set, the merry-go-round\n        has sagged in the firestorm.  Small skulls look accusingly from the\n        ash-drifts.  WE HEAR the distant echo of children's voices... playing\n        and laughing in the sun.  A silly, sing-songy rhyme as WE TRACKS\n        SLOWLY over seared asphalt where the faint hieroglyphs of hopscotch\n        lines are still visible.\n\n        CAMERA comes to rest on a burnt and rusted tricycle... next to the\n        tiny skull of its owner.  HOLD ON THIS IMAGE as a female VOICE speaks:\n\n                                VOICE\n                3 billion human lives ended on August 29th, 1997.\n                The survivors of the nuclear fire called the war\n                Judgment Day.  They lived only to face a new\n                nightmare, the war against the Machines...\n\n        A metal foot crushes the skull like china.\n\n        TILT UP, revealing a humanoid machine holding a massive battle rifle.\n        It looks like a CHROME SKELETON... a high-tech Death figure.  It is\n        the endoskeleton of a Series 800 terminator.  Its glowing red eyes\n        compassionlessly sweep the dead terrain, hunting.\n\n        The SOUNDS of ROARING TURBINES.  Searchlights blaze down as a\n        formation of flying HK (Hunter-Killer) patrol machines passes\n        overhead.  PAN WITH THEM toward the jagged horizon, beyond which we\n        see flashes, and hear the distant thunder of a pitched battle in\n        progress.\n\n5       EXT. BATTLEFIELD - NIGHT\n\n        THE BATTLE.  Human troops is desperate combat with the machines for\n        possession of the dead Earth.  The humans are a ragtag guerrilla\n        army.  Skynet's weapons consist of Ground HKs (tank-like robot\n        gun-platforms), flying Aerial HKs, four-legged gun-pods called\n        Centurions, and the humanoid terminators in various forms.\n\n        SEQUENCE OF RAPID CUTS:\n5A      Explosions!  Beam-weapons firing like searing strobe-light.\n5B      A gunner is an armored personnel carrier fires a LAW rocket at a\n        pursuing Aerial HK, bringing it down in a fiery explosion.\n5C      Another APC is crushed under the treads of a massive Ground HK.\n\n5D      A TEAM OF GUERRILLAS in a intense fire-fight with terminator\n5E      endoskeletons in the ruins of a building.  Three terminator\n5F      endoskeletons advance, firing rapidly.  Another (complete cyborg),\n        with flesh ripped open and back broken, gropes for a rifle on the\n        ground.\n\n5G      A Centurion overruns a human firing position.  Soldiers are cut\n        down as they run.  Fiery explosions light the ranks of advancing\n        machines.\n\n6       IN A BLASTED GUN EMPLACEMENT at the edge of battle, a man watches\n        the combat with night-vision binoculars.  He wears the uniform of a\n        guerrilla general, and a black beret.  He is still amid running,\n        shouting techs and officers.\n\n        C.U. MAN, pushing slowly in as the battle rages O.S.  He lowers the\n        binoculars.  He is forty-five years old.  Features severe.  The left\n        side of his face is heavily scarred.  A patch covers that eye.  An\n        impressive man, forged in the furnace of a lifetime of war.  The name\n        stitched on the band of his beret is CONNOR.  We push in until his\n        eyes fill frame, then...\n\n                                                DISSOLVE TO:\n\n        FIRE.  SLOW, BOILING, ENORMOUS.  FILLING FRAME.\n\n                                VOICE (SARAH CONNOR)\n                Skynet, the computer which controlled the machines,\n                sent two terminators back through time.  Their\n                mission: to destroy the leader of the human\n                Resistance... John Connor.  My son.\n\n                The first terminator was programmed to strike at\n                me, in the year 1984... before John was born.\n                It failed.\n\n                The second was set to strike at John himself,\n                when he was still a child.  As before, the\n                Resistance was able to send a lone warrior.  A\n                protector for John.  It was just a question of\n                which one of them would reach him first...\n\n                                                DISSOLVE TO:\n\n7       EXT. TRUCKSTOP - NIGHT\n\n        Wild fingers of BLUE-WHITE ELECTRIC ARCS dance in a steel canyon\n        formed by two TRACTOR TRAILERS, parked side by side in the back lot\n        of an all-night truck stop.  Then...\n\n        The strange lightning forms a circular opening in mid-air, and in\n        the sudden flare of light we see a FIGURE in a SPHERE OF ENERGY.\n        Then the FRAME WHITES OUT with an explosive THUNDERCLAP!\n\n        Through the clearing vapor we see the figure clearly... a naked man.\n        TERMINATOR has come through.  Physique: massive, perfect.  Face:\n        devoid of emotion.  Terminator stands and impassively surveys its\n        surroundings.\n\n8       INT. TRUCK STOP DINER - NIGHT\n\n        On a back route to north L.A.  A handful of local TRUCKERS hunch over\n        chili-sizes, CAT hats pushed back on their heads.  Three BIKERS are\n        playing a game of pool in the back, their Miller empties lining the\n        table's rail.  The dive's owner, LLOYD, a fat, aging biker-type in a\n        soiled apron, stands behind the bar.  Nothing much going on...\n\n        Then the front door opens and a big naked guy strolls in -- that\n        doesn't happen every night.  All eyes simultaneously swivel toward\n        Terminator.  Its emotionless gaze passes over the customers as it\n        walks calmly through the room.  Everyone frozen, not sure how to\n        react.\n\n8A      TERMINATOR POV.  A digitized electronic scan of the room, overlaid\n        with alphanumeric readouts which change faster than the human eye\n        can follow.  In POV we move past the staring truckers, past the\n        owner and the awestruck WAITRESS, and approach a large nasty-looking\n        biker puffing on a cigar.  His body is outlined, or \"selected\", and\n        thousands of estimated measurements appear.  His clothing has been\n        analyzed and deemed suitable...\n\n8B                              TERMINATOR\n                I need your clothes, your boots, and your\n                motorcycle.\n\n        The big biker's eyes narrow.  He takes a long draw on this cigar,\n        the tip cherry-red hot.\n\n                                CIGAR BIKER\n                You forgot to say please.\n\n        He grinds the cigar out on Terminator's chest.  Which produces not\n        the slight reaction of pain.  Terminator calmly, and without\n        expression, grabs Cigar by his meaty upper arm...\n        Cigar screams from the hydraulic grip.\n\n        Terminator doesn't see Cigar's friend, behind him, holding his pool\n        cue by the narrow end like a Louisville Slugger.  The heavy send\n        whistles in a powerful swing and CRACKS IN TWO across the back of\n        Terminator's head.\n\n        Terminator seems not to notice.  Doesn't even blink.  Without\n        releasing his grip on Cigar, he snaps his arm straight back and grabs\n        Pool Cue by the front of his jacket.  Suddenly the heavyset biker\n        finds himself flying through the nearest window.  CRAASSH!\n\n        Terminator hurls Cigar, all 230 pounds of him, clear over the bar,\n        through the serving window into the kitchen, where he lands on the\n        big flat GRILL.  We hear a SOUND like SIZZLING BACON as Cigar\n        screams, flopping jerking.  He rolls off in a smoking heap.\n\n        The third biker whips out a knife with a eight-inch blade and slashes\n        at Terminator's face.\n\n        Terminator grabs the arcing blade with his bare hand.  Holding it by\n        the razor-sharp blade he jerks is from the guy's hand.\n        Ultra-fast here: He flips it.  Grabs the handle like you're supposed\n        to hold a knife.  Grabs the biker and slams him face-down over the\n        bar.  Then brings the knife whistling down, pinning the biker's\n        shoulder to the bar top with his own steel.\n\n9       INT. KITCHEN\n\n        The doors BANGS OPEN and Terminator strides in.\n        The Mexican cook does a fast fade as Terminator walks toward Cigar,\n        who is cursing in pain on the floor.\n\n        With his deep-fried fingers he struggles to get out the .45 auto\n        tucked under his leather jacket.  But he can't even hold onto it.\n        Terminator takes it from him.  Instead of pointing it at him,\n        Terminator carefully examines weapon, analyzing its caliber and\n        operating condition.  Terminator never threatens... that's a human\n        thing.  He just takes.\n\n        Cigar senses what he must do when the emotionless eyes come back to\n        him.  He slides the keys to his bike across the floor to Terminator's\n        foot.  Then painfully starts getting out of his jacket.\n\n10      INT. TRUCK STOP\n\n        Terminator strides from the kitchen, fully clothed now in a black\n        leather jacket, leather riding pants, and heavy, clean boots.  He\n        moves toward the moaning biker pinned to the pool table.  Without\n        slowing his stride he jerks the knife out.  The guy slumps to the\n        floor, groaning, behind him.\n\n        Terminator continues toward the front of the diner, passing Lloyd,\n        the owner.  At the door, he comes abreast of two truckers who sit\n        frozen like a snapshot in mid-bite.  One of the truckers finally\n        nods.\n\n                                TRUCKER\n                Evening...\n\n        Terminator impassively stares back.  Then moves on out the door.\n\n11      EXT. TRUCK STOP\n\n        Terminator walks out, surveying the parked Harleys.  Sticks the .45\n        in his belt and swings one leg over a massive CUSTOM ELECTRO-GLIDE.\n        He slips the dagger in his boot and the key in the ignition.  Kicks\n        over the engine.  It catches with a roar and he slams the heavy iron\n        into gear with a KLUNK.\n\n        Lloyd appears at the diner's door with a sawed-off 10-GAUGE\n        WINCHESTER LEVER-ACTION SHOTGUN.  He fires into the air and jacks\n        around round in fast, aiming at Terminator's back.\n\n                                LLOYD\n                I can't let you take the man's wheels, son.\n                Now get off or I'll put you down.\n\n        Terminator turns and considers by coldly.  He eases the shifter up\n        into neutral.  Rocks the bike onto its kickstand.  Swings him leg\n        over and walks calmly toward the guy.\n\n        Terminator strides right up to Lloyd, staring straight into the\n        shotgun's muzzle.  Lloyd starts sweating, trying to decide is he's\n        going to kill a man in cold blood.  He's still trying to decide when\n        Terminator's hand blurs out like a striking cobra and is somehow\n        suddenly holding the shotgun.\n\n        Lloyd gapes, knowing he's screwed.  Then...\n        Terminator reaches toward him.  Oh shit...\n        And slips the sunglasses out of Lloyd's shirt pocket.  Puts them on.\n        Strides back to the Harley and roars off in a shower of gravel.\n\n12      EXT. FREEWAY - NIGHT\n\n        Terminator roars down the freeway, heading for L.A.  Cold neon flares\n        across the chrome of the big bike.  The 10-gauge is jammed through\n        the clutch and brake cables, across the handlebars.  The lights flow\n        over Terminator's wrap-around sunglasses like the tracks of tracer\n        rounds.\n\n                                                CUT TO:\n\n13      EXT. OVERPASS - NIGHT\n\n        The First Street Bridge.  Rusting chain-link fence and graffiti-\n        covered walls.  An L.A.P.D. BLACK-AND-WHITE cruises the empty street.\n\n        A TREMENDOUS BLUE-WHITE GLARE suddenly spills out between the columns\n        of the overpass.  The young UNIFORMED COP in the car whips his head\n        around at the source of the light.  He pulls over quickly, in time\n        to see...\n\n13A     The powerfully arcing electrical discharge reaches its peak between\n        the columns.  Lightning climbs the chain-link fence and light\n        standards, lighting up the night, and papers swirl in a blasting\n        whirlwind.\n\n13B     The cop climbs from his cruiser as the glow fades.\n        He sees vapor dissipating as he approaches the spot where he saw the\n        strange light.  He draws his revolver and cautiously moves into the\n        shadows between the rows of pillars.\n\n        A NAKED MAN glides from a shadowed doorway behind the cop.  Nothing\n        special about him.  Certainly not built like a terminator.  The flash\n        of light and fact that he is naked are pretty good clues that he\n        just arrived from the future.  His features are handsome bordering\n        on severe.  His eyes are gray ice.  Penetrating.  Intelligent.\n\n        THE COP spins at a sound.  Too late.  Mr. X is already on him.  The\n        blow is lighting fast and the cop drops like a bag of sand.\n\n        LOW ANGLE as the unconscious cop hits the deck, his BERETTA 9mm\n        AUTOMATIC clattering next to him.  A hand ENTERS FRAME and picks up\n        this pistol.\n\n                                                CUT TO:\n\n13C     HIGHLY POLISHED BLACK SHOES rounding the rear tire of the police\n        cruiser.  FOLLOW THE SHOES to the cruiser's door then MOVE UP as\n        Mr. X, dressed now in LAPD blue, climbs behind the wheel.  He\n        looks and acts exactly like a cop.  Cool, alert, confident in his\n        power, his expression emotionless and judgmental.\n        Mr. X, now Officer X, puts the car in gear and drives into the night.\n\n                                                CUT TO:\n\n14      INT. SUBURBAN HOUSE/GARAGE - DAY\n\n        TIGHT ON YOUNG JOHN CONNOR, who at his moment is ten years old and\n        busy reassembling the carburetor on his Honda 125 dirtbike.  He has\n        ripped Levi's and long stringy hair.  A sullen mouth.  Eyes which\n        reveal an intelligence as sharp as a scalpel.  The Ramones' \"I Wanna\n        Be Sedated\" blasts from a boom box next to him.\n\n        A WOMAN, JANELLA VOIGHT, stands in the doorway of the garage,\n        yelling over the music.\n\n                                WOMAN\n                ...John?  John!  Get in here right now and\n                clean up that pigsty of yours.\n\n        John's friend TIM, a thirteen-year-old Hispanic kid, watches as John\n        replies by turning up the volume on the boom box.\n        Janelle gives up with a SLAM of the house's back door.\n\n                                TIM\n                Your foster parents are kinda dicks, right?\n\n                                JOHN\n                Gimme that Phillips right there.\n\n15      INT. HOUSE - LIVING ROOM\n\n        Janelle storms into the room.  TOD VOIGHT, her husband, watches\n        sports on the TV.  They're both in their thirties.  Middle-class\n        working stiffs.\n\n                                JANELLE\n                I swear I've had it with that goddamn kid.\n                He won't even answer me.\n                        (neither does he)\n                Todd?  Are you gonna sit there or are you gonna\n                do something?\n\n        He sighs.  Throws down the TV's remote and heads for the garage.\n\n16      INT. GARAGE\n\n        John hops on the bike.  Kick-starts it.  Tim picks up John's nylon\n        bag, then climbs on the back.  Todd ENTERS and shouts over the\n        engine, which John revs louder and louder.\n\n                                TODD\n                John!  Get your ass inside right now and do\n                what your mother says!\n\n        John pins Todd with a defiant glare.\n\n                                JOHN\n                She's not my mother, Todd!\n\n        He revs the engine and peels out of the garage, with Tim almost\n        falling off the back.  They take off down the street.\n\n17      EXT. VACANT LOT/DRAINAGE CANAL\n\n        John cuts through a vacant lot to a trail running beside a fenced-in\n        drainage canal.  He guns the bike through a hole in the retaining\n        fence.  Tim's eyes go wide as they roar down the concrete embankment.\n\n17A     IN THE DRAINAGE CANAL John zig-zags along, throwing up a\n        roostertail of muddy water.  Tim shouts, pretending he didn't just\n        see his life flash before his eyes.  He slaps John on the back.\n\n                                TIM\n                Major moves, homes!  So... where is your\n                real mom, anyway?\n                        (John doesn't answer)\n                She dead or something?\n\n        It's hard to read John's expression.\n\n                                JOHN\n                She might as well be.\n\n        John twists the throttle angrily and the bike lunges forward.\n\n                                                CUT TO:\n\n18      EXT. PESCADERO STATE HOSPITAL - DAY\n\n        A SIGN on a chain link fence topped with concertina wire reads:\n        PESCADERO STATE HOSPITAL FOR THE CRIMINALLY INSANE.  Beyond it\n        squats an imposing four-story building.  Institutional brick.\n        Barred windows.  About as inviting as KGB headquarters.  Security\n        guards patrol the manicured grass.\n\n19      INT. HOSPITAL - MAXIMUM SECURITY WING\n\n        Sunlight is a barred slash on the bare institutional wall.  The room\n        is empty of all furnishings save the bed, a stainless steel sink,\n        toilet, and a dented metal mirror.  WE HEAR a rhythmic grunting,\n        small explosions of breath in perfectly-metered time.\n\n        PAN TO a bedframe leaned upright against the wall, legs facing\n        outward.  A pair of sweaty hands grip one leg.  Tendons knot and\n        release as SOMEONE does pull-ups.  A man of tangled hair hides the\n        face that comes INTO FRAME, dips out, comes back.\n\n        WIDER.  A WOMAN in a tank top and hospital pants in hanging from the\n        top leg of the vertical bedframe.  Her body is straight and taut.\n        Knees bent so the feet clear the ground.  The arms are lean and\n        muscular.  The inmate, face hidden, pulls up, dips, pulls up.  Like\n        a machine.  No change in rhythm.\n\n20      INT. HOSPITAL/CORRIDOR\n\n        FIGURES MOVE TOWARD US down a corridor of polished tile and two-\n        tone walls.  DR. PETER SILBERMAN, a smug criminal psychologist,\n        leads a group of young INTERNS.  Following laconically, are THREE\n        BURLY ATTENDANTS.\n\n                                SILBERMAN\n                The next patient is a 29-year old female\n                diagnosed as acute schizo-affective disorder.\n                The usual indicators... depression, anxiety,\n                violent acting-out, delusions of persecution.\n                        (the interns nod judiciously)\n                Here we are.\n\n        Silberman stops at one of the SOUNDPROOF STEEL DOORS.  There is a two-\n        way speaker beneath a tiny window.  Silberman flips the intercom\n        switch.\n\n21      INT. CELL\n\n        Silberman's scrubbed and cheerful face at cell window.  HIS VOICE\n        comes over the tinny speaker.\n\n                                SILBERMAN\n                'Morning, Sarah.\n\n        REVERSE ANGLE as she turns slowly into CLOSE UP.\n        SARAH CONNOR is not the same woman we remember from last time.  Her\n        eyes peer out through a wild tangle of hair like those of a cornered\n        animal.  Defiant and intense, but skittering around looking for\n        escape at the same time.  Fight or flight.  Down one cheek is a long\n        scar, from just below the eye to her upper lip.\n        Her VOICE is a low and chilling monotone.\n\n                                SARAH\n                Good morning, Dr. Silberman.  How's the knee?\n\n22      INT. CORRIDOR\n\n        Silberman's smug composure drops a second.  Then returns.\n\n                                SILBERMAN\n                Fine, Sarah.\n                        (he switches off, speaks to\n                        the interns)\n                She, uh... stabbed me in the kneecap with a\n                screwdriver a few weeks ago.\n\n        Sarah watches them talking about her through the glass, but can't\n        hear them.  She feels like a lab animal.  The interns look in at her\n        through the glass as Silberman talks.  With her face drawn, eyes\n        haggard and hair wild, she looks like she belongs where she is.\n\n                                SILBERMAN\n                The delusional architecture is interesting.\n                She believes a machine called a \"terminator\",\n                which looks human of course, was sent back\n                though time to kill her.  And also that the\n                father of her child was a soldier, sent to\n                protect her... he was from the future too...\n                        (he smiles)\n                The year 2029, if I remember correctly.\n                        (the interns chuckle)\n                Let's move on, shall we?\n\n        As the interns walk on, Silberman steps close to DOUGLAS, the head\n        attendant, and speaks low.\n\n                                SILBERMAN\n                Douglas, I don't like seeing the patients\n                disturbing their rooms like this.  See that she\n                takes her thorazine, would you?\n\n        DOUGLAS is 6'4\", 250 pounds and warm-hearted at a rattlesnake.  He\n        nods, catching Silberman's meaning, and gestures for the other\n        attendants to hang back as Silberman moves on in his rounds.\n\n23      INT. CELL\n\n        Sarah looks up as the cell door opens.  Douglas walks in slowly,\n        idly tapping his POLICE BATON against the door in a ominous rhythm.\n        The other two orderlies ease in behind him.  One of them carries a\n        STUN BATON (like a sawed-off cattle prod).  The other has a tray with\n        cups of red liquid-thorazine.\n\n                                DOUGLAS\n                Time to take you meds, Connor.\n\n        Sarah faces him, weight centered.  Feral eyes darting from one to the\n        other.\n\n                                SARAH\n                You take it.\n\n        Douglas grins, casual --\n\n                                DOUGLAS\n                Now you know you got to be good 'cause you up\n                for review this afternoon...\n\n                                SARAH\n                I'm not taking it.  Now I don't want any\n                trouble...\n\n                                DOUGLAS\n                Ain't no trouble at all --\n\n        He whips the baton in a whistling backhand, which --\n        WHAP!  Takes her square in the stomach.  She doubles over and drops\n        to her knees, unable to breathe.  Douglas tips the bed and it slams\n        down with a crash, right new to her.  He takes her stun wand from\n        the other attendant and walks forward.\n\n        TIGHT ON SARAH, grimacing and struggling to breathe.\n\n                                SARAH\n                You... son of a... AAARRGH!!\n\n        The stun wand hits her between shoulder blades as she tries to rise.\n        It drives her to the floor, pinning her like a bug.  Little\n        ELECTRIC ARCS CRACKLE as the baton makes her writhe in pain.\n        Douglas grabs her by the hair and jerks her up to her knees.  Holds\n        the cup of thorazine in front of her lips.\n\n                                DOUGLAS\n                Last call, sugar.\n\n        Gasping, she chokes the zombie juice down.\n\n                                                CUT TO:\n\n24      EXT. BANK PARKING LOT - DAY\n\n        John furtively hunches before a Ready-Teller machine at the rear of\n        a local bank while his friend Tim stands lookout.  John slips a\n        stolen ATM card into the machine slot.  It is something he's rigged\n        up, because trailing from the card is ribbon-wire which goes to\n        some kind of black-box electronics unit he's got in his ever-present\n        knapsack.  He holds the pack between his knees and pulls out a\n        little lap-top keyboard, which is also connected to the black-box.\n\n        John enters a few commands and the plasma-screen displays the PIN\n        number for that account.  He quickly enters the number on the Ready-\n        Teller's keypad and asks it for 300 bucks.  The machine whirs then\n        begins dispensing twenty-dollar bills.  Tim looks back over his\n        shoulder amazed.\n\n                                JOHN\n                Easy money!\n\n                                TIM\n                Where'd you learn all this stuff?\n\n        John collects the twenties as the machine kicks them out.  A cool and\n        professional electronic-age thief at ten years old.\n\n                                JOHN\n                From my mom.  My real mom, I mean.  Come on\n                baby...\n                        (he grabs the last bills)\n                Let's go!\n\n        They sprint around the corner to an --\n\n25      EXT. ALLEY BEHIND BANK\n\n        They huddle behind the building as John counts out Tim's share.\n        He folds five twenties and palms them to the other kid.  When John\n        opens his wallet to put in his money, Tim notices a picture in a\n        plastic sleeve.\n\n                                TIM\n                That her?\n\n        John reluctantly shows his friend the Polaroid.  It is a shot of\n        Sarah.  Pregnant, in a jeep near the Mexican border.  John doesn't\n        know it now, but he will carry the photo with him for over 30 years,\n        and give it to a young man named Kyle Reese, who will travel back in\n        time to become his father.  Yes, that photo.\n\n                                TIM\n                So she's pretty cool, huh?\n\n                                JOHN\n                Actually, no, she's a complete psycho.  That's\n                why she's up at Pescedero.  She tries to blow up\n                a computer factory, but she got shot and arrested.\n\n                                TIM\n                No shit?\n\n                                JOHN\n                Yeah, she's a total loser.  C'mon, let's check\n                out the 7-Eleven, whatya say?\n\n        John has tried to sound casual, but we see in his eyes that is really\n        hurts.  He slaps Tim on the shoulder and they jump onto his Honda.\n        John fires up and they whine off down the alley.\n\n                                                CUT TO:\n\n26      INT. POLICE CRUISER - DAY\n\n        CLOSE ON COMPUTER TERMINAL, attached to the dash.  A Juvenile\n        Division file.  Subject: John Connor.  Below his ARREST RECORD are\n        his vital stats.  Mother: Sarah Connor.  Legal Guardians: Todd and\n        Janelle Voight.  And below their names, an address: 523 S. Almond.\n        Reseda, Ca.\n\n        OFFICER X stares at the screen for a moment.  Then gets out the car.\n\n27      INT./EXT. VOIGHT HOUSE - DAY\n\n        TIGHT ON FRONT DOOR as Todd Voight opens it, revealing the unsmiling\n        face of Officer X beyond the screen door.  Todd greets him with a\n        weary sigh.\n\n                                OFFICER X\n                Are you the legal guardian of John Connor?\n\n                                TODD\n                That's right, officer.  What's he done now?\n\n        Officer X ignores the question.  He casually scans the living room.\n\n                                OFFICER X\n                Could I speak with him, please?\n\n        Todd shrugs, showing the cop he's past his patience with the boy.\n\n                                TODD\n                Well, you could if he was here.  Be he took off\n                on his bike this morning.  Could be anywhere.\n                You gonna tell me what his is about?\n\n                                OFFICER X\n                I just need to ask him a few questions.\n\n        Janelle appears in the doorway behind Todd, concerned.\n\n                                JANELLE\n                There was a guy here this morning asking about\n                him, too.\n\n                                TODD\n                Yeah, big guy.  On a bike.  Has that got\n                something to do with it?\n\n        Officer X registers the significance of that.  He realizes who the\n        big guy must be.  He smiles.  Reassuringly shakes his head no.\n\n                                OFFICER X\n                I wouldn't worry.  Do you have a photograph\n                of John?\n\n        Todd stares unhappily at the cop.  Turns to Janelle.\n\n                                TODD\n                Get the album, Janelle.\n\n                                                CUT TO:\n\n28      EXT. STREET\n\n        ANGLE THROUGH AN ALLEY from the main street.  We see John and Tim\n        flash by on the Honda a block away.  Hold a beat.  Then...\n\n        A BIG CHROME WHEEL ENTERS FRAME.  BOOM UP a leather-clad leg to\n        Terminator's implacable face.  It surveys the area slowly as the\n        bike idles, then kicks it into gear and moves on, scanning in a\n        slow shark-like manner, not aware that it missed its prey by\n        seconds.\n\n                                                CUT TO:\n\n29      INT. SARAH'S CELL - DAY\n\n        CLOSE ON SARAH.  She is shackled, hands and feet, to the bed.\n        Sunlight falls across her pale face.  A hand enter frame, gently\n        stroking her cheek.  She wakes up to see --\n\n        KYLE REESE.  Sitting on the edge of her bed, looking exactly the\n        same as we last saw him in 1984.  Scruffy blonde hair and a long\n        raincoat.\n\n                                SARAH\n                Kyle..?  You're dead.\n\n        He gives her a gentle smile.\n\n                                REESE\n                I know.  This is a dream, Sarah.\n\n                                SARAH\n                Oh.  Yeah.  They... make me take this stuff...\n\n        He puts a finger to her lips.  Then silently unfastens her restraints.\n        They gaze into each other's eyes.  And in the look that his death\n        and the horror she has been through since hasn't touched their love\n        at all.\n\n                                SARAH\n                Hold me.\n\n        She melts into Reese's arms.  Pulls him to her.\n\n                                REESE\n                I love you.  I always will.\n\n                                SARAH\n                Oh, God... Kyle.  I need you so much.\n\n        She kisses him passionately.  They are locked together in a timeless\n        moment.  PUSH IN TIGHT on Sarah as she buries her face in his\n        shoulder.  She shuts her eyes tight.  Stay on Sarah as Reese speaks.\n        He voice is strangely cold.\n\n                                REESE (O.S.)\n                Where's John, Sarah?\n\n        Sarah opens her eyes and he is no longer in her arms.  He is standing\n        across the room.  Pinning her with an accusing gaze.\n\n                                SARAH\n                They took him from me.\n\n                                REESE\n                It's John who's the target now.  You have to\n                protect him.  He's wide open.\n\n                                SARAH\n                I know!\n\n                                REESE\n                Don't quit, Sarah.  Our son need you.\n\n                                SARAH\n                        (struggling not to cry)\n                I know, but I'm not as strong as I'm supposed\n                to be.  I can't do it.  I'm screwing up the\n                mission.\n\n                                REESE\n                Remember the message... the future is not set.\n                There is not fate but what we make for ourselves.\n\n        He turns toward the door.\n\n                                SARAH\n                Kyle, don't go!\n\n                                REESE\n                        (turning back to her)\n                There's not much time left in the world, Sarah.\n\n        Reese goes out the door.  Sarah jumps from the bed, frantic.  Yanks\n        the door open.  Follow her out.\n\n30      INT. CORRIDOR\n\n        Sarah staggers from her cell.  Reese is already, impossibly, a\n        hundred feet away, striding down the dim corridor.  A silhouette\n        in a long coat, disappearing around a corner.\n\n        Sarah runs after him, her bare feet slapping the cold linoleum.\n        Her hospital gown floats out behind her as she dream-runs along the\n        seemingly infinite corridor.  She reaches the corner, slides around\n        it, and...\n\n30A     Slams right into the arms of Douglas and his three helpers.  They\n        grab her as she struggles and screams.  The Silberman is there,\n        smiling soothingly.  They force her down and she is pinned to\n        the floor, screaming.  A new figure approaches... one even more\n        menacing.\n\n        TERMINATOR walks toward her, with heavy measured steps.  Backlit,\n        eyes concealed by the sunglasses, it stands over her like the angel\n        of death itself.  It reaches down and...\n        Takes her hand.  Lifts her up.  Leads her to a door.  They go through\n        together.  Emerging into...\n\n30B     A BEAUTIFUL SUNLIGHT MORNING.  CHILDREN are playing nearby... sliding\n        down slides, clambering through a jungle gym.  Sarah knows this\n        dream know... it's is the worst of all her nightmares.  She starts\n        to scream but no sound comes out.\n\n30C     THE SKY EXPLODES into WHITE LIGHT.  Everything is seared by the unholy\n        glare, hotter than a thousand suns.  The children ignite like\n        match heads.  Sarah is burning, screaming silently, everything silent\n        and overexposed.  Terminator's flesh and clothing are burning,\n        silently.  It grips her hand, Virgil to her Dante in this tour of the\n        nuclear-age Inferno.\n\n30D     THE BLAST WAVE HITS... a near-solid wall of compressed air followed\n        by 250-mph winds.  The children, charcoal statues frozen in positions\n        of play, explode into black leaves of ash and swirl away.  SOUND\n        hit now, with a thunderous roar.  Sarah's scream merges with the\n        howl of the wind as the blast hits her, exploding the flesh from her\n        bones.  Beside her, Terminator is stripped of its burnt flesh,\n        becoming a smoking skeleton of steel.\n\n30E     Then she wake up... in her cell, shackled to the bed.  Sunlight hurts\n        her eyes.  She looks desperate and defeated.  She knows the war is\n        coming.  It visits her every time she closes her eyes.  Lost and\n        alone, Sarah feels all hope recede for herself and for humanity.\n\n                                                CUT TO:\n\n31      INT. PESCADERO STATE HOSPITAL - INTERVIEW ROOM\n\n        TIGHT ON VIDEO SCREEN, playing a previously-recorded session.\n        Sarah is in a strait-jacket, talking softly.\n\n                                VIDEO SARAH\n                ... it's... like a giant strobe light, burning\n                right through my eyes... but somehow I can still\n                see.  Look, you know the dream's the same every\n                night, why do I have to --\n\n                                VIDEO SILBERMAN\n                Please continue...\n\n31A     The REAL SARAH dispassionately watches herself on the screen.  Her\n        expression is controlled.  Silberman watches her watching.  They are\n        in a brightly-lit interview room.  TWO ATTENDANTS stands nearby.\n\n31B                             VIDEO SARAH\n                The children look like burnt paper... black,\n                not moving.  Then the blast wave hits them and\n                they fly apart like leaves...\"\n\n        Video Sarah can't go on.  Real Sarah watches herself cry on tape,\n        her expression cold.  We hear Silberman speak on the tape.\n\n                                VIDEO SILBERMAN\n                Dreams about cataclysm, or the end of the world,\n                are very common, Sarah...\n\n        Video Sarah cuts him off, her mood shifting to sudden rage.\n\n                                VIDEO SARAH\n                It's not just a dream.  It's real, you moron!\n                I know the date is happens!!\n\n                                VIDEO SILBERMAN\n                I'm sure it feels very real to you --\n\n                                VIDEO SARAH\n                On August 29th 1997 it's going to feel pretty\n                fucking real to you, too!  Anybody not wearing\n                number two million sunblock in gonna have a\n                real bad day, get it?\n\n                                VIDEO SILBERMAN\n                Relax now, Sarah --\n\n                                VIDEO SARAH\n                You think you're alive and safe, but you're\n                already dead.  Everybody, you, him...\n                        (she gestures are the\n                        attendant)\n                everybody... you're all fucking dead!\n\n        She is raving, half out of her chair.  The orderly moves to inject\n        her with something.\n\n                                VIDEO SARAH\n                You're the one living in a dream, Silberman,\n                not me!  Because I know it happens.  It\n                happens!\n\n31C     Silberman pauses the tape... freezing Sarah's contorted face.\n        Real Sarah turns away from the screen, he expression stony.\n\n                                SARAH\n                I was afraid... and confused.  I feel much\n                better, now.  Clearer.\n\n        Silberman gives a calculated paternal smile.\n\n                                SILBERMAN\n                Yes.  Your attitude have been very positive\n                lately.\n\n        Sarah looks up at him.  Her voice is hopeful.\n\n                                SARAH\n                It has helped me a lot to have a goal, something\n                to look forward to.\n\n                                SILBERMAN\n                And what it that?\n\n        As she answers, WE PULL BACK, revealing that we have been looking\n        through a one-way mirror from an adjacent OBSERVATION ROOM.  In the\n        shadows of the observation room we see that interns from the\n        earlier rounds, and a couple of STAFF PSYCHOLOGISTS.  They smoke and\n        make the occasional note.\n\n                                SARAH\n                You said I could be transferred to the minimum\n                security wing and have visitors if I showed\n                improvement in six months.  Well, it's been six\n                months, and I was looking forward to seeing my\n                son.\n\n                                SILBERMAN\n                I see.  Let's go back to what you were saying\n                about these terminator machines.  Now you think\n                they don't exist?\n\n        CLOSE ON SARAH.  Her voice sounds hollow.\n\n                                SARAH\n                They don't exist.  I see that now.\n\n        Silberman leans back, studying her.  Toying with her.\n\n                                SILBERMAN\n                But you've told me on many occasions about how\n                you crushed one in a hydraulic press.\n\n                                SARAH\n                If I had, there would have been some evidence.\n                They would have found something at the factory.\n\n                                SILBERMAN\n                I see.  So you don't believe anymore that the\n                company covered it up?\n\n        Sarah shakes her head no.\n\n                                                CUT TO:\n\n32      EXT. CYBERDYNE SYSTEMS - DAY\n\n        The corporate headquarters of a mega-electronic corporation.  As\n        imposing cubist castle of black glass.\n\n33      INT. SECOND FLOOR/ELEVATORS\n\n        The elevator doors slide open with a whisper and MILES DYSON strides\n        out.  Black.  In his early thirties.  The star of the Special\n        Projects Division.  He's brilliant, aggressive, driven.  Dyson walks\n        down the corridor, swinging his arms... a man in a hurry.  A man\n        with much to do.\n\n        He reaches a solid security door and zips his ELECTRONIC KEY-CARD\n        through the scanner.  The door unlocks with a clunk.\n        The sign next to the door reads: SPECIAL PROJECTS DIVISION:\n        AUTHORIZED PERSONNEL ONLY.\n\n34      INT. SECURITY STATION\n\n        He nods to the guards as he passes through the security checkpoint.\n        They can see all activities on the floor on their bank of monitors.\n        He unlocks another service door with his card and enters --\n\n35      INT. ARTIFICIAL INTELLIGENCE (A.I.) LAB\n\n        The lab is quite large, comprising banks of processors, disk drives,\n        test bays, prototype assembly areas.  Extremely high tech.\n\n                                DYSON\n                Greetings, troops.\n\n        He is jokingly saluted by fellow members.  Not a lab coat in sight.\n        This is strictly jeans and sneakers crowd.  All young and bright.\n        They sit at their consoles drinking Coke and changing technology as\n        we know it.  A young LAB ASSISTANT rushes over to Dyson.  Name tag\n        says he's BRYANT.\n\n                                BRYANT\n                Mr. Dyson?  The material teams wants to run\n                another test on the uh... on it.\n\n                                DYSON\n                Yup.  Come on.  I'll get it.\n\n        Dyson produces an unusual-looking KEY from his pocket as they stride\n        through the lab.  Bryant has to hustle to keep up.\n\n                                BRYANT\n                Listen, Mr. Dyson, I know I haven't been here\n                that long, but I was wondering if you could tell\n                me... I mean, if you know...\n\n                                DYSON\n                Know what?\n\n                                BRYANT\n                Well... where it came from.\n\n                                DYSON\n                I asked them that question once.  Know what\n                they told me?  Don't ask.\n\n36      INT. VAULT ROOM\n\n        Dyson enters with Bryant.  Dyson and a GUARD stand together before\n        what looks like a high-tech bank vault.  It requires two keys to\n        open, like the launch controls in a nuclear silo.  The guard and\n        Dyson insert their keys and turn them simultaneously.  Dyson then\n        enters a passcode at a console and the vault unlocks itself with a\n        sequence of clunks.  The door swings open and Dyson enters.  Bryant\n        stays outside with the guard, who notes Dyson's name and item on a\n        clipboard.\n\n37      INT. VAULT\n\n        Dyson walks to a stainless steel cabinet and opens it.  Inside is a\n        small artifact in a sealed container of inert gas.  IT -- a ceramic\n        rectangle, about the size of a domino, the color of liver.  It has\n        been shattered, painstakingly reconstructed and mounted on a metal\n        frame.\n\n        Dyson removes the artifact, it its insert-gas, and sets it on a\n        specially-designed cart.  He handles it like the Turin Shroud.\n        Dyson closes the cabinet.  Turns to the one next to it.  Opens its\n        door.  In this cabinet is a larger object... an intricate METAL HAND\n        AND FOREARM.\n\n        At the elbow, the metal is twisted and crushed.  But the forearm and\n        hand are intact.  Its metal surface scorched and discolored, it\n        stands upright in a vacuum flask, as if saluting.  This is all that\n        remains of the terminator Sarah destroyed.  Dyson stares at it, lost\n        in thought.  The he closes the cabinet, BLACKING OUT FRAME.\n\n                                                CUT TO:\n\n38      INT. INTERVIEW ROOM/OBSERVATION ROOM\n\n        We can see through the one-way mirror into the interview room where\n        Sarah is still talking with Silberman.  The OTHER PSYCHOLOGISTS are\n        still watching through the mirror.  Reviewing Sarah's condition.\n\n                                SARAH\n                So what do you think, Doctor?  I've shown a lot\n                of improvement, haven't I?\n\n                                SILBERMAN\n                You see, Sarah... here's the problem.  I know\n                how smart you are, and I think you're just\n                telling me what I want to hear.  I don't think\n                you really believe who you've been telling me\n                today.\n\n        We go tight on Sarah's reaction.  And we see that Silberman is right.\n        She was playing him and it didn't work.  And she knows she's fucked.\n        Her tone becomes quite pleading.\n\n                                SARAH\n                You have to let me see my son.  Please.  It's\n                very important.  He's in danger.  At least let\n                me call him --\n\n        Silberman pins her with his sweet reptilian gaze.\n\n                                SILBERMAN\n                I'm afraid not.  Not for a while.  I don't see\n                any choice but to recommend to the review board\n                that you stay here another six months.\n\n        Sarah's eyes turn cold and lethal in one second.  She knows she's\n        lost.  She knows this guy is just playing with her, and she --\n        LEAPS ACROSS THE TABLE AT HIM.\n\n                                SARAH\n                YOU SON OF A BITCH!!\n\n        Silberman jumps back and the attendants dive on her.  She is writhing\n        and twisting like a bobcat.  Silberman whips open a drawer and pulls\n        out a syringe.  He jabs it into her and she yells --\n\n                                SARAH\n                Goddammit.  Let me go!!  Silberman!  You don't\n                know what you're doing!  You fuck!  You're dead!\n                You hear me!!\n\n        Silberman signals and the attendants drag her out.\n        He looks at the doctors behind the glass.  Shrugs.\n\n                                SILBERMAN\n                Model citizen.\n\n                                                CUT TO:\n\n39      EXT. 7-ELEVEN STORE - DAY\n\n        Officer X has stopped two young girls in front of a 7-Eleven.  He is\n        leaning out the cruiser window and showing them the picture of John.\n        The first girl nods.\n\n                                FIRST GIRL\n                Yeah, he was here about fifteen minutes ago.  I\n                think he said he was going to the Galleria.\n\n                                OFFICER X\n                The what?\n\n        The second girl points toward a massive complex visible about the\n        houses several blocks away.  Officer X stares at it.\n\n40      EXT. STREET\n\n        Terminator cruises slowly on the bike.  Scanning.  He crosses an\n        overpass above a drainage canal and whips his head around at the\n        sound of a dirt-bike engine.\n\n40A     TERMINATOR POV -- OF TWO KIDS ON A BIKE DOWN IN THE CANAL.\n        THE IMAGE SNAP-ZOOMS IN.  FREEZES ON THE DRIVER'S FACE.\n        \"IDENT POS\" FLASHES NEXT TO THE BLURRY IMAGE OF JOHN.\n\n40B     Terminator wheel the Harley around, cutting onto a street which runs\n        parallel to the canal.  Terminator hauls ass at keep John in sight.\n        He catches glimpses of the kid through trees and houses.  Loses him.\n        Catches one last glimpse of him heading into the parking lot of a\n        large SHOPPING MALL.\n\n41      INT. GALLERIA - DAY\n\n        John works his way through a crowded video arcade.  Sees some guys he\n        knows.  Stops to talk, striking a pose.  Mall rats in the element.\n        We don't hear the dialogue.\n\n42      INT. GALLERIA PARKING LOT\n\n        TERMINATOR'S idling Harley shakes the parking garage walls.  He stops\n        at a row of bikes near the escalators.  John's little Honda sits\n        proudly with the big street bikes.  Terminator parks.\n\n43      INT. GALLERIA\n\n        OFFICER X is moving through the flow of shoppers.  The place is a zoo.\n        He stops some kids and shows them the picture.  They shrug.\n\n43A     IN A CROWDED VIDEO ARCADE JOHN is lost in an intense battle, going for\n        a new high score at \"Missile Command\".  He parries deftly at the enemy\n        ICBMs deploy their MIRVs... the warheads stream down... it's more than\n        he can deal with.  The world gets nuked.  Game over.  He slouches\n        away from the game, looking for another.  Bored.\n\n        RACK FOCUS to Officer X passing the entrance of the store behind him.\n        The cop moves on, down the concourse, out of sight.\n        John gets in an \"Afterburner\" simulator game.\n\n43B     ON TERMINATOR, walking through the crowd in slow motion.  Scanning.\n        He moves with methodical purpose, knowing the target is close.  We\n        see that he is, incredibly, carrying a box of LONG-STEM ROSES.  Like\n        some hopeful guy with a hot date.\n\n43C     THE COP is pointed toward the arcade by come kids hanging out at the\n        multi-cinema.  He walks into the maze of kids engaged in synthesized\n        combat.  Cheap electronic effects blare above the crowd noise.\n\n43D     JOHN is shooting down MiGs at Mach 2.  His friend Tim slides up next\n        to him.  Taps him on the shoulder, trying to play it cool.\n\n                                TIM\n                Some cop is scoping for you, dude.\n\n        John looks around the corner of the \"Afterburner\" ride.  Sees the cop\n        showing a picture to some of the kids.  The kids point his way.\n\n        John ducks just as the cop glances over.  He slinks out the other side\n        of the ride and heads for the back of the store, instinctively\n        retreating.  Sarah has taught him that cops are bad news.\n\n        THE COP scans the crowded arcade.  Glimpses John, looking back as he\n        moves around a row of machines.  Starts toward him.\n\n        JOHN sees the cop homing in and starts walking fast.  Looks back.\n        THE COP is shoving through clots of kids.  One of them is slammed to\n        the floor.  As eddy of outrage behind the cop as he gains speed.\n        John breaks into run.  So does the cop.\n        Kids scatter like ten-pins as the cop charges after John.\n        John sprints through the arcade's back officer and store-rooms.\n\n44      INT. SERVICE CORRIDOR\n\n        John emerges through a firedoor into a long corridor with connects\n        to the parking garage.  He's running full out, when around the corner\n        ahead of him comes...\n\n        TERMINATOR.  Time stretches to nightmarish crawl as John tries to\n        brake to a stop.  Terminator reaches into the box of roses.\n\n        SLOW MOTION.  The cold back steel of the SHOTGUN emerges at the box\n        falls open, the roses spilling to the floor.  TERMINATOR'S BOOT\n        crushes the flowers as it moves forward.\n\n        JOHN, transfixed by terror, is trapped in the narrow featureless\n        shooting gallery of the corridor.  THE SHOTGUN COMES UP.  Terminator\n        expressionlessly strides forward.  Jacks a round into the chamber,\n        slow and fluid.\n\n        John looks behind him for a place to run.  Sees the cop coming toward\n        him, pulling his Beretta pistol.  Incredibly, John realizes the cop\n        is aiming his gun at him!\n        John looks back at Terminator.  He is starting into the black muzzle\n        of the 10-gauge now.  Aimed right at his head.  He realizes he's\n        screwed.  Then something crazy happens...\n\n                                TERMINATOR\n                Get down.\n\n        John instinctively ducks.  Terminator pulls the trigger. KABOOM!\n\n        THE COP catches the SHOTGUN'S BLAST square in the chest just as he\n        fires the pistol.  The pistol's shot goes wild.\n\n        TERMINATOR pumps another round into him.  The another.  And another.\n        Advancing a step each time he fires, he empties the shotgun into the\n        cop, blowing his backward down the corridor.  The sound is DEAFENING.\n        Then silence.\n\n        THE COP lies still on his back.\n\n44A     Terminator is now standing right over John.  They both watch as the\n        cop, incredibly, sits up unharmed and gets to his feet.  Terminator\n        grabs John roughly by his jacket.  Clutches the kid to his chest\n        then spins around at the cop opens fire with the Beretta.\n\n44B     The \"cop\", who not only isn't a cop, he clearly isn't even human,\n        pulls the trigger so fast it almost seems like a machine-pistol.\n\n        ON TERMINATOR'S BACK, as the 9mm slugs slam into it, punching bloody\n        holes in the motorcycle jacket.\n\n        JOHN is bug-eyed with fear, but completely unscratched.  Terminator's\n        body has blocked the bullets.\n\n        The Beretta CLACKS empty.  Terminator turns at the sound.\n        Shoves John behind a Coke machine.  Drops the empty shotgun.  Starts\n        walking toward the \"cop\".\n        The empty magazine clatters to the floor.\n        The cop inserts another one.  Snaps back the slide.\n        Terminator still has twenty feet to go.\n        He doesn't break his purposeful stride.\n\n        The cop opens fire.  Bullets rake Terminator's chest.  He doesn't\n        even flinch.\n        Ten feet to go.  BLAM BLAM BLAM BLAM!  Neither the cop nor Terminator\n        show the slightest change in expression as the gun rips Terminator's\n        wardrobe to shreds.\n\n        CLACK.  The pistol empties again.  Terminator stops two feet in front\n        of the cop.  The appraise each other for a second.\n\n        We realize now that the cop is a terminator too.  We don't know the\n        details yet, but let's call him the T-1000 (since that's what he is).\n        A newer model than the one we've come to know so well (the 800\n        Series \"Arnold\").  This guy's a prototype... and he's got quite a\n        few surprises.\n\n        T-1000 AND TERMINATOR size each other up.  Terminator moves first.\n        He grabs T-1000 in his massive hands but the T-1000 snaps back with a\n        counter-grip.  After about two seconds of intense slamming, the walls\n        on both sides of the corridor have all the plaster smashed in, and\n        the two battling machines have blasted through the wall and\n        disappeared.\n\n        JOHN, totally stunned by all this, remembers to move.  He staggers to\n        his feet.  Stumble-runs toward the parking garage.\n\n44C     THIRD LEVEL CONCOURSE.  A plate glass window EXPLODES and Terminator\n        crashes through to the tile floor like a sack of cement amid the\n        screaming crowd.\n\n44D     T-1000 turns without a word and heads back through the store after\n        John, accelerating slowly into a loping, predatory run.\n\n44E     Terminator is totally still.  A JAPANESE TOURIST cautiously steps\n        forward and takes a picture of the body.  Suddenly, Terminator's\n        eyes snap open.  The stunned tourist backs away.\n\n        He sits up and looks around.  Gets his bearings.  Rises smoothly to\n        his feet.  All servos seem to be working fine.  The tourist's camera\n        whirs as the motor-drive runs on by itself, taking shot after show.\n        The owner isn't even looking through the eyepiece, he's so shocked.\n\n45      INT. PARKING GARAGE\n\n        John is frantically pumping the kick-start of his bike, scared\n        shitless and the damned thing won't start.  His hands are shaking so\n        badly he can't find the choke.  He looks up to see --\n        The T-1000 running down the corridor toward him.\n        John fumbles with the choke.  The bike catches.  He slams it in gear\n        and spins the bike out into the main aisle of the garage.\n\n        John looks back... the T-1000 is behind him, running.  He twists the\n        throttle and guns the little bike forward.  Incredibly, the T-1000\n        is gaining.  This nightmare isn't happening.  John races out the exit\n        ramp, and charges right into the street.\n\n46      EXT. STREET\n\n        John shoots into the busy traffic.  Cuts off a BIG-RIG TOW TRUCK.\n        The DRIVER swears.  Hits his air horn.  What the driver doesn't see\n        is the cop, running faster than O.J. Simpson at the airport, who\n        emerges onto the street and runs back at his truck.\n\n46A     IN THE TRUCK.  The driver hears a thump as something slams against his\n        door, then feels himself pulled right out.  T-1000 slides in and\n        takes his place.  The truck is still rolling along about 25 mph.\n        T-1000 accelerates after John without missing a beat.  It can see him,\n        up ahead, weaving through traffic.\n\n46B     Out of the garage entrance, Terminator roars onto the street on the\n        Harley.\n        He accelerates after the others.\n\n47      EXT. FLOOD CONTROL CHANNEL\n\n        John slides his bike down the service ramp faster than he's ever done\n        it before.  He races along the bottom of the canal, turning into a\n        narrower tributary which has vertical sides.\n\n        He looks back.  No sign of pursuit.\n47A     Suddenly he sees the sun blocked out by a great shadow.\n        The Kenworth tow-truck... big as a house, all chrome and roaring\n        diesel engine... crashes through the fence and launches itself right\n        into the center of the canal.\n\n        It crashes down, 15 feet to the ground, going about 60, hits at an\n        angle and tears into the concrete wall with a hideous grinding of\n        metal.  It ricochets back and forth between the walls then, bellowing\n        like a gunshot stegosaurus, it just keep on plowing forward, gathering\n        speed.\n\n47B     John looks back and sees this wall of metal almost filling the narrow\n        concrete canal and he milks every last bit of throttle the little bike\n        has.  The Kenworth is all muscle, tearing along the canal like a train\n        in a tunnel.  Its big tires send up huge sheets of muddy spray,\n        backlit in the setting sun.  It looks like some kind of demon.  And...\n        it's gaining.\n\n47C     ABOVE THEM, on the service road running parallel, Terminator is\n        fighting to overtake them.  He looks down and sees John with the tow-\n        truck from Hell catching up to him.  It is only about twenty feet\n        behind him and still gaining.\n\n47D     ANGLE IN THE CANAL, looking back past a desperate John, at the wall\n        of metal filling frame behind him.\n\n47E     ABOVE, Terminator cuts the bike suddenly hard to the left, leaving the\n        road.  Hitting an earth embankment just right, he jumps the bike into\n        the air like Steve McQueen in \"The Great Escape\" and vaults the fence\n        bordering the canal.  It slams down at the edge of the canal and tears\n        along, inches from the drop-off on a dirt path, accelerating past the\n        truck in the canal below.\n\n47F     John hits some water and slews momentarily, loosing speed.  The\n        massive push-plate on the front of the truck slams into his back\n        fender.  Panicked, he pulls a little ahead.  All this is happening at\n        about sixty miles and hour.  Top speed for the little dirt bike.\n\n47G     SLOW MOTION as Terminator jumps the bike again.  This time the 700-\n        pound Harley sails out into space and drops into the canal.  It arcs\n        down between the truck and John, hitting on its wheels.  It bottoms\n        out, an explosion of sparks under the frame.  Only the ultra-fast\n        reflexes of a machine could keep the bike upright.  Terminator fights\n        for control.\n\n47H     He guns the throttle and the powerful bike roars up beside John's tiny\n        Honda.\n        Terminator sweeps the kid off his machine with one arm and swings him\n        onto the Harley, in front of him.  John's Honda weaves and falls,\n        smashing instantly under thundering tires.\n\n        The Harley roars ahead.  It hits eighty.  Ahead is an overpass, and\n        supporting it is an abutment which bisects the canal into two\n        channels.  The Harley thunders into one channel, which is essentially\n        a short tunnel.\n\n47I     The truck can't fit on either side.  Neither can it stop, at that\n        speed.  Tires locked, it slides on the muddy concrete and piles into\n        the concrete abutment at seventy.\n\n47J     Terminator and John emerge from the tunnel, looking back to see a\n        fireball blasting through behind them as the truck's side-tanks\n        explode.\n\n        Terminator stops the Harley.  John peers around his body to see the\n        destruction.  A burning wheel wobbles out of the tunnel and flops in\n        the mud.  Terminator revs the bike and they roar away, down the canal,\n        disappearing around a bend.\n\n47K     ANGLE ON THE FIRE, as a column of black smoke rises from the overpass.\n        Smoke boils from the tunnel as well, and inside it is a solid wall of\n        flame.  A figure appears in the fire.\n        Just an outline.  Walking slowly... calmly.\n        The figure emerges from the flames.\n\n        It is human-shaped but far from human.  A smooth chrome man.  Not a\n        servo-mechanism like Terminator is underneath, with its complex\n        hydraulics and cables... this thing is a featureless, liquid chrome\n        surface, bending seamlessly at knees and elbows as it walks.  It\n        reminds us of mercury.  A mercury man.  Its face is simple, unformed.\n        Unruffled by thousand-degree heat, it walks toward us.\n\n        With each step detail returns.\n        First the shape and lines of its clothing emerge from the liquid\n        chrome surface, then finer details... buttons, facial features,\n        ears...\n\n47K     But it's still al chrome.  With its last step, the color returns to\n        everything.  It is the cop again... handsome young face, blond hair,\n        mustache.  Icy eyes.  It stops and looks around.\n\n        It is a perfect chameleon.  A liquid metal robot.  A killing machine\n        with the ultimate skills of mimicry for infiltration of human society.\n\n47L     ANGLE NEARBY, as several police cruisers and a fire truck pull up.\n        T-1000 climbs out of the canal behind them.  More cops arrive.  T-1000\n        blends in perfectly.  There are always cops at diasters and scenes of\n        violence.  We now see why its choice of protective mimicry is so\n        perfect.\n        It walks among the other cops unnoticed.\n        Gets into one of the squad cars.  Starts it and drives away.\n\n48      EXT. SIDE STREET - NIGHT\n\n        Terminator, with John in front of him on the Harley, roars down the\n        empty street.  John cranes his neck around to get a look at the\n        person/thing he is riding with.  The image is strangely reminiscent\n        of father/son, out for an evening ride.\n\n        John is still in shock from the experience of what just happened and\n        he's just a ten-year kid, but he's also John Connor who will someday\n        rise to greatness, and we see a bit of that in him even know.\n\n                                JOHN\n                Whoa... time out.  Stop the bike!\n\n        Terminator immediately complies.  He leans the bike into a turn.\n        They head into a nearby alley.\n\n49      EXT. ALLEY\n\n        Terminator and John rolls into the alley and come to a stop.  John\n        slides off the gas tank.  Terminator impassively stares at him.  John\n        checks him out.  Tentatively speaks.\n\n                                JOHN\n                Now don't take this the wrong way, but you are\n                a terminator, right?\n\n                                TERMINATOR\n                Yes.  Cyberdyne Systems, Model 101.\n\n                                JOHN\n                No way!\n\n        John touches Terminator's skin.  Then the blood on his jacket.\n        His mind overloads as the reality of it hits him.\n\n                                JOHN\n                Holy shit... you're really real!  I mean...\n                whoah!\n                        (stepping back)\n                You're, uh... like a machine underneath, right...\n                but sort of alive outside?\n\n                                TERMINATOR\n                I'm a cybernetic organism.  Living tissue over\n                a metal endoskeleton.\n\n                                JOHN\n                This in intense.  Get a grip, John.  Okay, uh...\n                you're not here to kill me... I figured that part\n                out for myself.  So what's the deal?\n\n                                TERMINATOR\n                My mission is to protect you.\n\n                                JOHN\n                Yeah?  Who sent you?\n\n                                TERMINATOR\n                You did.  Thirty years from now you reprogrammed\n                me to be your protector here, in this time.\n\n        John gives him an amazed look.\n\n                                JOHN\n                This is deep.\n\n50      EXT. STREET - NIGHT\n\n        John and Terminator on the bike again, weaving through the side\n        streets.  They blend into the evening traffic.  In the darkness,\n        Terminator's wounds are not readily visible.  John cranes his head up\n        and back.\n\n                                JOHN\n                So this other guy?  He's a terminator too,\n                right, like you?\n\n                                TERMINATOR\n                Not like me.  A T-1000.  Advanced prototype.\n                A mimetic polyalloy.\n\n                                JOHN\n                What does that mean?\n\n                                TERMINATOR\n                Liquid metal.\n\n                                JOHN\n                Radical.\n\n                                TERMINATOR\n                You are targeted for termination.  The T-1000\n                will not stop until it complete its mission.\n                Ever.\n\n        John mulls that over.\n\n                                JOHN\n                Where we going?\n\n                                TERMINATOR\n                We have to leave the city, immediately.  And\n                avoid the authorities.\n\n                                JOHN\n                Can I stop by my house?\n\n                                TERMINATOR\n                Negative.  The T-1000 will definitely try to\n                reacquire you there.\n\n                                JOHN\n                You sure?\n\n                                TERMINATOR\n                I would.\n\n                                                CUT TO:\n\n51      EXT. PAYPHONE\n\n        John is quickly going through his pockets for change.  He has plenty\n        of bills but no quarters.\n\n                                JOHN\n                Look, Todd and Janelle are dicks but I gotta\n                warn them.  Shit!  You got a quarter?\n\n        Terminator reaches past John and smashes the cover plate off the\n        phone's cash box with the heel of his hand.  A shower of change\n        tumbles out.  Terminator hands one to John.  John dials.\n\n52      INT. VOIGHT HOUSE - KITCHEN - NIGHT\n\n        Janelle Voight picks up the kitchen phone and cradles it with her\n        shoulder which she continues to chop vegetables with a large knife.\n        She answers sweetly.\n\n                                JANELLE\n                Hello?\n\n                                JOHN\n                        (filtered through phone)\n                Janelle?  It's me.\n\n        In the backyard, John's German Shepherd is going bonkers, barking at\n        something.\n\n                                JANELLE\n                John?  Where are you, honey?  It's late.  You\n                should come home, dear.  I'm making a casserole.\n\n        AT THE PAYPHONE.  John listens, an odd look on his face.  He covers\n        the phone's mouthpiece and turns to Terminator.\n\n                                JOHN\n                        (whispering)\n                Something's wrong.  She's never this nice.\n\n        IN THE VOIGHTS' KITCHEN.  Todd comes through the kitchen's back door.\n        Just home from work.  He ignores Janelle and opens the fridge.  Grabs\n        a carton of milk.  Takes a sip.  Frowns at the dog's barking.\n\n                                TODD\n                What the hell's the goddamn dog barking at?\n                SHUT UP, YOU MUTT!\n\n        TIGHT ON JANELLE as Todd growls around the kitchen behind her.  He\n        passes OUT OF FRAME next to her.  Janelle switches the phone to her\n        other hand then... THUNK!  Her free hand seems to do something out of\n        frame.  There is a gurgling, and the sound of liquid dribbling onto\n        the floor. (Don't go away.  We'll find out what happened in a moment)\n\n        AT THE PAYPHONE\n\n                                JOHN\n                The dog's really barking.  Maybe it's already\n                there.  What should I do?\n\n        Terminator takes the phone from John's hand.  Janelle's voice is\n        floating through the receiver.\n\n                                JANELLE\n                        (filtered)\n                John?  John, are you okay?\n\n        Terminator speaks into the phone in a perfect imitation of John's\n        voice...\n\n                                TERMINATOR\n                        (in John's voice)\n                I'm right here.  I'm fine.\n                        (to John, a whisper)\n                What's the dog's name?\n\n                                JOHN\n                Max.\n\n        Terminator nods.  Speaks into the phone.\n\n                                TERMINATOR\n                Hey, Janelle, what's wrong with Wolfy?  I can\n                hear him barking.  Is he okay?\n\n                                JANELLE\n                        (filtered)\n                Wolfy's fine, honey.  Where are you?\n\n        Terminator unceremoniously hangs up the phone.  Turns to John.\n\n                                TERMINATOR\n                Your foster parents are dead.  Let's go.\n\n        Terminator heads for the bike.  John, shocked, stares after him.\n\n53      INT. VOIGHT HOUSE/KITCHEN\n\n        Janelle hangs up the phone.  Her expression is neutral.  Calm.\n\n        PAN OVER along her arm, which is stretched out straight from the\n        shoulder.  Partway along its length her arm has turned smoothly into\n        something else... a metal cylinder which tapers into a sword-like\n        spike.  Now we see Todd Voight PINNED TO A KITCHEN CABINET by the\n        spike which has punched through his milk carton, through his mouth\n        and exits the back of his head into the cabinet door.  His eyes are\n        glassy and lifeless.\n\n        The spike is withdrawn -- SWIISHHTT! -- so rapidly, Todd is actually\n        standing there a second before he slumps out of sight.  THUMP.\n53A     Janelle doesn't bat an eye as the spike smoothly changes shape and\n        color, transforming back into a hand, and then...\n\n53B     JANELLE CHANGES rapidly into the COP we now know as the T-1000.  The\n        change has liquid quality.  T-1000 opens the back door.\n\n54      EXT. VOIGHT HOUSE/BACKYARD - NIGHT\n\n        T-1000 approaches the big German Shepherd, which slinks away from it,\n        barking in fear.  T-1000 walk right into CLOSE UP.  Reaches down, OUT\n        OF FRAME.  We hear that sickening THUNK followed by a shrill YELP.\n        Then T-1000's hand snaps up INTO FRAME holding a bloody dog collar.\n        The tag reads \"MAX\".\n        T-1000 nods thoughtfully.  Heads back to the house.\n\n55      EXT. PARKING LOT - NIGHT\n\n        Dark.  Off a quiet street.  Terminator stands near the Harley,\n        watching John pace before him.  John's brain is calling time-out.\n        This is all too weird.\n\n                                JOHN\n                I need a minute here, okay?  You're telling me\n                it can imitate anything it touches?\n\n                                TERMINATOR\n                Anything it samples by physical contact.\n\n        John thinks about that, trying to grasp their opponent's parameters.\n\n                                JOHN\n                Like it could disguise itself as anything...\n                a pack of cigarettes?\n\n                                TERMINATOR\n                No.  Only an object of equal size.\n\n        John's still reeling from meeting one terminator, which now seems\n        downright conventional next to the exotic new model.\n\n                                JOHN\n                Well, why doesn't become a bomb or something to\n                get me?\n\n                                TERMINATOR\n                It can't form complex machines.  Guns and\n                explosives have chemicals, moving parts.  It\n                doesn't work that way.  But it can form solid\n                metal shapes.\n\n56      INT. VOIGHT HOUSE - NIGHT\n\n        T-1000 walks down the dark hall.  It passes the bathroom and we see\n        the real Janelle's legs through the half-open door.  The shower is\n        running.  Her blood mixes with water on the white tile floor.\n\n56A     In John's bedroom the T-1000 begins searching methodically in the\n        dark.\n        Calmly and dispassionately ripping the room apart for any clues that\n        could lead it to its target.  T-1000 finds a box of audio cassettes\n        marked \"Messages from Mom\".  In it are some letters, and envelopes\n        filled with snapshots.  It begins looking through some of the\n        photos...\n\n        SHOT OF JOHN AND SARAH during the missing years.  Sarah in olive\n        cammos with an RPG 7 grenade launcher, teaching John how to aim.\n        Sarah with a group of military-clad Guatemalan men, standing next to\n        cases of Stinger missiles.  John and Sarah in a Contra camp, deep in\n        the mountains.\n\n57      EXT. PARKING LOT - NIGHT\n\n        John is now sitting on the curb, lost in stunned thought.  Terminator\n        stands above him, watching the street like a Doberman.  He glances\n        down at John.\n\n                                JOHN\n                We spent a lot of time in Nicaragua... places\n                like that.  For a while she was with this crazy\n                ex-Green Beret guy, running guns.  Then there\n                were some other guys.  She'd shack up with\n                anybody she could learn from.  So then she\n                could teach me how to be this great military\n                leader.  Then she gets busted and it's like...\n                sorry kid, your mom's a psycho.  Didn't you\n                know?  It's like... everything I'd been brought\n                up to believe was just made-up fantasy, right?\n                I hated her for that.\n                        (he looks up)\n                But everything she said was true.\n                        (he stands)\n                We gotta get her out of there.\n\n                                TERMINATOR\n                Negative.  The T-1000's highest probability for\n                success now would be to copy Sarah Connor and\n                wait for you to make contact with her.\n\n                                JOHN\n                Oh, great.  And what happens to her?\n\n        Terminator's reply is matter-of-fact.\n\n                                TERMINATOR\n                Typically, the subject being copied is\n                terminated.\n\n                                JOHN\n                TERMINATED!?  Shit!  Why didn't you tell me?\n                We gotta right now!\n\n                                TERMINATOR\n                Negative.  She is not a mission priority.\n\n                                JOHN\n                Yeah, well fuck you, she's a priority to me!\n\n        John strides away.  Terminator goes after him and grabs him arm.\n        John struggles against the grip.  Which doesn't do him much good.\n\n                                JOHN\n                Hey, goddammit!  What's your problem?\n\n        Starts dragging John back to the bike.  John spots a couple of\n        collage-age slab-o-meat JOCK-TYPES across the street and starts\n        yelling to them.\n\n                                JOHN\n                Help!  HELP!!  I'm being kidnapped!  Get this\n                psycho off of me!\n\n        The TWO JOCKS start toward him.  John yells in outrage to Terminator.\n\n                                JOHN\n                Let go of me!!\n\n        To his surprise, Terminator's hand opens so fast John falls right on\n        his butt.\n        He looks up at the open hand.\n\n                                JOHN\n                Oww!  Why'd you do that?\n\n                                TERMINATOR\n                You told me to.\n\n        John stares at him in amazement as he realizes...\n\n                                JOHN\n                You have to do what I say?!\n\n                                TERMINATOR\n                That is one of my mission parameters.\n\n                                JOHN\n                Prove it... stand on one foot.\n\n        Terminator expressionlessly lifts one leg.\n        John grins.  He's the first on his block...\n\n                                JOHN\n                Cool!  My own terminator.  This is great!\n\n        The two guys get there and look at Terminator standing there calmly\n        with one leg up in the air.  This big guy in black leather and dark\n        glasses, standing like a statue.\n\n                                FIRST JOCK\n                Hey, kid.  You okay?\n\n        John turns to him.  No longer needing to be rescued.\n\n                                JOHN\n                Take a hike, bozo.\n\n                                FIRST JOCK\n                Yeah?  Fuck you, you little dipshit.\n\n                                JOHN\n                Dipshit?  Did you say dipshit?!\n                        (to Terminator)\n                Grab this guy.\n\n        Terminator complies instantly, hoisting him one-handed by the collar.\n        the guy's legs are pinwheeling.\n\n                                JOHN\n                Now who's the dipshit, you jock douchebag?\n\n        Immediately, things get out of hand.  The guy's friend jumps behind\n        Terminator and tries to grab him in a full nelson --\n        Terminator throws the first guy across the hood of a car --\n        Grabs the second by the hair, whips out his .45 in a quick blur, and\n        aims the muzzle at the guy's forehead.\n        John grabs Terminator's arm with a yell as he pulls the trigger --\n        John's weight is just enough to deflect the gun a few inches.  The\n        guy flinches, stunned by the K-BOOM next to his ear.  He stares,\n        shocked.  Pissing himself.  John is freaking out, too.\n        He screams at Terminator.\n\n                                JOHN\n                Put the gun down!  NOW!!\n\n        Terminator sets the .45 on the sidewalk.  John scoops it up fast then\n        turns to the shocked civilians, who can't believe what just happened.\n\n                                JOHN\n                Walk away.\n\n        They do.  Fast.  John grabs Terminator by the arm and tugs him toward\n        the bike.  John still holds the gun, reluctant to give it back.\n\n                                JOHN\n                Jesus... you were gonna kill that guy!\n\n                                TERMINATOR\n                Of course.  I'm a terminator.\n\n        John stares at him.  Having your own terminator just became a little\n        bit less fun to him.\n\n                                JOHN\n                Listen to me, very carefully, okay?  You're not\n                a terminator any more.  Alright?  You got that?\n                You can't just go around killing people!\n\n                                TERMINATOR\n                Why?\n\n                                JOHN\n                Whattaya mean, why?  'Cause you can't!\n\n                                TERMINATOR\n                Why?\n\n                                JOHN\n                You just can't, okay?  Trust me on this.\n\n        Terminator doesn't get it.  John just stares at him.  Frightened at\n        what just almost happened.  He gets a glimpse of the responsibility\n        that comes with power.  Finally he hands the .45 back to Terminator,\n        who puts it away.\n\n                                JOHN\n                Look, I'm gonna go get my mom.  You wanna come\n                along, that's fine with me.\n\n                                                CUT TO:\n\n58      INT. VOIGHT HOUSE/BEDROOM - NIGHT\n\n        T-1000 finds an envelope... a letter from Sarah to John sent since\n        she's been at Pescadero State Hospital.  It reads the return address\n        on the envelope.  It has what it needs.  It picks up a tape player\n        and the battered shoebox full of Sarah's tapes and exits.\n\n                                                CUT TO:\n\n59      CLOSE ON A BLACK & WHITE PHOTOGRAPH.  The image is a nightmare from\n        the past.  It is a surveillance camera still-frame from the L.A.\n        police station where the first terminator made such an impression in\n        1984.  We see the blurry forms of the cop frozen in the emergency\n        lights of a burning corridor.\n\n        A black-clad figure stands at the end of the corridor.  The guy has\n        short-cropped hair and dark glasses.  An AR-80 assault rifle in one\n        hand, and a 12-gauge in the other -- holding them both like toy\n        pistols.\n        ANOTHER PHOTO is slapped on top of the first.  Another still-frame\n        blow-up is placed over the last.  Terminator looms in CLOSEUP.\n\n                                DETECTIVE WEATHERSBY (O.S.)\n                These were taken at the West Highland police\n                station in 1984.  You were there.\n\n        WIDER.  We're in --\n\n59A     INT. INTERVIEW ROOM/PESCADERO - NIGHT\n\n        The photos are lying on the table in front of Sarah, placed there by\n        DETECTIVE WEATHERSBY.  His partner DET. MOSSBERG, and Dr. Silberman,\n        sit at the table as well.  Two uniformed cops, plus Douglas, stand by\n        the door.  Sarah stares listlessly at the top photo.  She's\n        withdrawn, haggard... drugged-looking.\n\n                                MOSSBERG\n                He killed seventeen police officers that night.\n                Recognize him?\n\n        Weathersby slaps another black-and-white eight-by-ten on the table.\n        A closeup of Terminator taken by the Japanese tourist at the mall.\n        It's the same face.\n\n                                MOSSBERG\n                This one was taken by a Japanese tourist today.\n\n        Sarah doesn't react.  It's hard to tell she's thinking.  Whether she's\n        up hope or is just in a drugged stupor.\n\n                                WEATHERSBY\n                Ms. Connor, you've been told that your son's\n                missing.  His foster parents have been murdered,\n                and we know this guy's involved.  Talk to us.\n                Don't you care?\n\n        Sarah stares up at him.  A cold and empty stare.  He glances at\n        Silberman.\n        Then at his partner.\n\n                                MOSSBERG\n                We're wasting out time.\n\n        One of the uniformed cops opens the door and Mossberg strides into\n        the hall.  Weathersby and the two uniforms follow him out, with\n        Silberman right behind.\n\n                                SILBERMAN\n                Sorry, gentleman...\n\n        TIGHT ON SARAH, slumped under the bright lights.  Totally out of it.\n        Then we see her hand, creeping along the edge of the table toward the\n        stack of photos.  She slips off the paper clip binding the stills\n        together, and hides it between her fingers.  Douglas jerks her up by\n        the arms and leads her out.\n\n                                                CUT TO:\n\n60      INT. SARAH'S CELL\n\n        Douglas inches up the last of Sarah's restraints.  Then her leans\n        over her... looking down.  Even wrecked as she is, we see the beauty\n        in her face.  He bends down.  We think he's going to kiss her.\n        Instead he runs his tongue across her face like a dog would.  She\n        seems not to even see him.  Her dull eyes past him.  He can't\n        provoke a reaction.  Even here, strapped down, the two of them alone,\n        she give him no superiority.  He smirks and leaves.  We hear the\n        sound of his night-stick tapping its way down the corridor, growing\n        fainter.\n\n        Sarah's eyes snap suddenly alert.  There is intensity and resolve in\n        them.  She slips the paper clip out from between her fingers and\n        awkwardly spreads it open into a straight piece of wire.  With slow,\n        painful concentration she moves it toward the lock of the restraints\n        that bind her wrists to the bed at her sides.\n\n                                                CUT TO:\n\n61      EXT. ROAD - NIGHT\n\n        Terminator and John charge through the night on the Harley.\n        Streetlights flare past them like comets.  Two serious guys with a\n        mission.  One a ten-year old kid, the other a half-man/half-machine\n        cyborg from the post-Apocalyptic future.\n\n                                                CUT TO:\n\n62      INT. SARAH'S CELL\n\n        TIGHT ON RESTRAINT LOCK as it unlatches... successfully picked by\n        Sarah's paper clip.  This is not an easy thing to do.  But Sarah\n        taught herself a lot of things in her years of hiding.\n\n        SARAH, her hands free, sits up and releases the Velcro straps on her\n        feet.  She rolls off the bed and we see her in a whole new light.\n        She is totally alert, almost feral in her movements.\n\n                                                CUT TO:\n\n63      EXT. HOSPITAL ENTRANCE\n\n        GUARD SHACK.  A bored security guard glances up as an LAPD black-and-\n        white pulls up.  He raises the barricade and nods at the T-1000/cop\n        as it passes.\n\n        THE CRUISER pulls in next to the other police vehicles.  The T-1000\n        walks toward the main entrance.\n\n                                                CUT TO:\n\n64      INT. SARAH'S CELL/CORRIDOR\n\n        Sarah is using the paper clip on the door lock.  She hears an echoing\n        tapping sound.  It's getting louder, coming her way.  She goes back\n        to work on the lock.\n\n65      IN THE CORRIDOR.  Douglas the attendant is tapping his stick along\n        the wall like he does every night on his rounds.  He shines a little\n        mag-light in the windows of the cells as he passes, barely slowing.\n\n65A     He rounds the corner.  His footsteps echo in the dark hallway.\n        The tip of the stick hits the wall.\n        Tap, tap, tap... getting closer to Sarah's cell.  He stops at the\n        door.  He is about to shine his light in when he notices that a\n        utility closet across the hall is open.  He goes to shut it,\n        absently flicking his light into the dark closet.  He notices\n        something strange among the buckets and cleaning supplies.  A mop lies\n        on the floor, with its handle snapped off about halfway up.  The\n        other half is missing.\n\n        Douglas ponders this for half a second, then hears a SOUND behind him\n        and spins around.  The sound he heard was Sarah's cell door.\n        The missing two feet of MOP HANDLE fill his vision as it CRACKS\n        viciously across the bridge of his nose.\n\n        250 pounds of doughy attendant hit the floor like a sack of cement.\n        Sarah slams the makeshift baton down expertly across the back of his\n        head, bouncing him off the linoleum.  Lights out, Douglas.\n        She drags him into her cell and locks him in with his own keys.  Then\n        swaps her mop-handle for his nice heavy night-stick.\n\n65B     Sarah moves down the dark corridor, cat-stepping in her bare feet.\n        She holds the baton like a pro, laid back along the forearm, police-\n        style.  She looks dangerous.\n\n                                                CUT TO:\n\n66      INT. HOSPITAL ENTRANCE/CORRIDOR\n\n        A long corridor ends at a reception area, which is closed, and a\n        NIGHT RECEIVING DESK, which is a glass window where they can buzz you\n        in through a heavy door.  A NIGHT NURSE types at a desk nearby.  She\n        looks up at the sound of footsteps and sees a young cop (T-1000)\n        walking toward her.\n\n                                T-1000\n                You have a Sarah Connor here?\n\n        She assumes he's with the other cops.  Smiles.\n\n                                NIGHT NURSE\n                Running late, aren't you?\n\n        She turns to the inner door to buzz him in and sees Silberman and the\n        cops coming toward the door from the other side.\n\n                                NIGHT NURSE\n                Your friends are on their way out now...\n\n        When she turns back to the window, T-1000's no longer there.  She\n        goes to the counter and leans out to see if he's at the drinking\n        fountain or someplace.  No.  Reception is empty.  And so is the long\n        corridor beyond.  She frowns.  Too weird.\n\n66A     Silberman comes through the solenoid door with Mossberg and\n        Weathersby, the two uniformed cops, and the hospital security guard.\n        The guard retrieves his 9mm pistol from a lock-out box behind the\n        night desk.  Silberman faces him.\n\n                                SILBERMAN\n                Lewis, see these gentleman out and them lock\n                up for the night.\n\n        The security guard nods.  Silberman goes back into the secure area of\n        the hospital and the cops walk down the long corridor to the main\n        doors.  No sign of T-1000.  Mossberg and the other cops exit, and\n        the guard locks the door behind them.\n\n66B     The guard walks slowly back along the long corridor.  The hall is\n        dark, with the light at the night desk far ahead like a sanctuary.\n        His footsteps ring hollowly on the tile floor.  His keys jingle.\n\n66C     ANGLE ON FLOOR as the guard's feet pass through FRAME.  An instant\n        later the floor starts to move.\n        It shivers and bulges upward like a liquid mass, still retaining the\n        two-tone checkerboard of the tile.  It hunches up silently into a\n        quivering shadow in the darkness past the guard.\n\n66D     Up ahead we hear typing.  The night nurse has her back to us, working.\n        The guard stops as the drinking fountain.  Bends to take a sip.\n        Behind him the fluid mass as reaches six feet of height and begins to\n        resolve rapidly into a human figure.  It loses the color and texture\n        of the tile and becomes... THE GUARD.\n\n        T-1000's mass has been spread out a quarter of an inch thick over\n        several square yards of floor.  The guard walked over the T-1000, and\n        his structure was sampled that instant.  Now we see it drawing in and\n        pulling up to form the figure of the guard.\n\n        The T-1000/Guard's feet are the last to form, the last of the \"liquid\n        floor\" pulling in to form shiny black guard shoes.  The shoes detach\n        with a faint sucking sound from the real floor as the T-1000/Guard\n        takes its first step.\n\n66E     The real guard spins at the sound of footsteps to see... himself.\n        He has one deeply disturbing moment to consider the ramifications of\n        that.  Then he sees his double calmly raise its hand and,\n        inexplicably, points his right index finger directly at the real\n        guard's face, about a foot away.  In a split second, the finger\n        spears out, elongating into a thin steel rod which snaps out like a\n        stiletto, slamming into the guard's eye.\n        It punches into the corner of the eye, past the eyeball like a trans-\n        orbital lobotomy tool, and emerges from the back of the guard's skull.\n\n        Life quietly empties from the guard's face.  He is dead weight,\n        hanging from the rod/finger with suddenly reacts -- SSSNICK.  As the\n        guard slumps, the T-1000 takes his weight easily with one hand and\n        walks him, like it's carrying a suit on a hanger, back toward the\n        night desk.  The wounds are so tiny, no blood drips onto the floor.\n\n66F     ON THE NIGHT NURSE, glancing up as the T-1000/Guard walks past,\n        dragging something casually which she can't see because it's below\n        the countertop.\n\n                                NIGHT NURSE\n                Whatcha got, Lewis?\n\n                                T-1000/GUARD\n                Just some trash.\n\n        She nods, uninterested.  Keeps typing.  T-1000 moves past, dragging\n        the unseen guard toward a closet down the hall from the night\n        receiving station.  T-1000/Guard removes the Browning High-Power\n        pistol and the keys from the real guard's belt, then stuffs the body\n        into the utility closet.\n\n66G     INT. CORRIDOR/NIGHT RECEIVING DESK\n\n        T-1000/Guard comes back out and glances at the nurse.\n\n                                T-1000/GUARD\n                All set.\n\n        She glances toward it.  Sees the Beretta in its holster.\n\n                                NIGHT NURSE\n                Gotta check the gun first, Lewis.\n\n                                T-1000/GUARD\n                Yeah, sorry.\n\n        T-1000 opens the locker and blocks it from her view with its body as\n        it mimes putting the gun in.\n\n66H     CLOSE ANGLE ON T-1000'S CHEST, from inside the locker.  Instead of\n        setting the gun in the locker, it inserts the pistol into it own\n        chest, where is disappears inside like it was dropped into a pot of\n        hot fudge.  It withdraws its hand.  The chest is once again a surface\n        that looks like cloth, buttons, name-tag etc.  You'd ever guess it was\n        really an intelligent liquid metal.\n\n        T-1000 slams the locker door and waits as the nurse hits the button\n        unlocking the door with a BUZZ-CLACK.  T-1000/Guard goes through.\n\n                                                CUT TO:\n\n67      INT. ISOLATION SECURITY CHECKPOINT\n\n        A small room before a short SALLY-PORT corridor designed to prevent\n        violent inmates from making a run for it.  There are doors at each\n        end.  The first one is barred like a jail-cell door, and the second\n        is a steel fire door.  The attendants have a video monitor with which\n        they can see the corridor on the other side of the doors.\n\n        The two bored attendants barely notice the T-1000/Guard as it\n        approaches.  Looks briefly at a chart next to the door, seeing\n        SARAH CONNOR is in #19.\n\n67A     IN THE ISOLATION WARD, the T-1000 passes a nurses' station which looks\n        a cage, walled in by heavy metal mesh.  Silberman, leaning in the open\n        doorway, is talking to an attendant in the cage.  He doesn't glance\n        twice at Lewis the Guard passing by.\n\n68      SARAH, moving like a ghost in the darkened corridor, hears footsteps\n        coming and quietly but quickly unlocks a cell next to her with\n        Douglas' master key.\n68A     She slips into the cell and waits as the footsteps pass.\n        We glimpse the T-1000/Guard pass the window.\n        She waits as the footsteps fade away.  She looks over.  A female\n        inmate, strapped to a bed, watches her with bird-like eyes.  She puts\n        a finger to her lips -- SSHHH.  The inmate nods.  Sarah exits.\n\n68B     POV MOVING TOWARD nurse's station.  We hear Silberman's voice,\n        reviewing medication with the night attendant.\n\n        ON SILBERMAN, yawning, looking at his watch.\n        He turns to go... Sarah is there.\n        She slams into him, hurling him through the door into the cage and\n        follows him in.  The orderly jumps up, going for his stunner, but she\n        nails him with Douglas' baton.  WHAP-WHAP-WHAP!  You can barely see\n        the thing she's swinging it so fast.  The guys goes down.\n\n        Silberman lunges for the alarm button and she cracks down hard on his\n        arm.  He cries out and grabs his wrist.\n        She grabs him by the hair and slams him face down on the desk,\n        smacking him behind the knees expertly with the baton.\n        His legs buckle and he drops to his knees with his chin on the desk.\n        She pins him with one hand.  He face is full of outraged disbelief.\n\n                                SILBERMAN\n                You broke my arm!\n\n                                SARAH\n                There's 215 bones in the human body, motherfucker.\n                That's one.  Now don't move!\n\n68B     Moving rapidly, she whips open a medication drawer and grabs a\n        syringe.\n        They keep a few of these handy for tranking unruly patients.  She\n        jams it into the orderly's butt and fires the whole shot.  Still\n        holding the empty syringe, she sees what she need next.\n        They keep the toxic cleaning supplies in here to keep the inmates from\n        drinking Drano.  She grabs a plastic jug of LIQUID PLUM'R and slams\n        it down on the desk inches from Silberman's eyes.\n\n        She jams the empty syringe into the plastic jug.\n        Draws back the plunger.  The syringe fills with blue liquid.\n        She whips it out of the jug and jams the needle into Silberman's neck.\n        His horrified eyes rack toward it.  10 cc's of blue death fill the\n        cylinder.\n        Her thumb hovers over the plunger.\n        She jerks him to his feet by the collar and gets a tight grip on him,\n        then hauls him through the door.\n\n69      IN THE CORRIDOR outside cell #19 the T-1000 stops and looks in the\n        window.  Douglas, his face a bloody mess, yells to be heard.\n\n                                DOUGLAS\n                Open the door!  The goddamn bitch is loose in\n                the halls!\n\n        To Douglas' amazement, Lewis the Guard turns impassively and walks\n        away, leaving him shouting soundlessly at the window.\n\n                                                CUT TO:\n\n70      EXT. HOSPITAL\n\n        Terminator and John are approaching the guard gate on the Harley.\n        They can see the guard inside looks up at the sound of the engine.\n\n                                JOHN\n                Now remember, you're not gonna kill anyone,\n                right?\n\n                                TERMINATOR\n                Right.\n\n        John looks at him.  He's not convinced.\n\n                                JOHN\n                Swear.\n\n                                TERMINATOR\n                What?\n\n                                JOHN\n                Just say \"I swear I won't kill anyone.\"\n\n        John holds his hand up, like he's being sworn in.  Terminator stares\n        at John a beat.  Then mimics the gesture.\n\n                                TERMINATOR\n                I swear I will not kill anyone.\n\n        Terminator stops the bike and gets off.\n        The guard, sensing trouble, has his gun drawn as he comes out of the\n        shack.  Terminator walks toward him drawing his .45 smoothly.  BLAM!\n        He shoots the guard accurately in the thigh.\n        The guy drops, screaming and clutching his leg.\n        Terminator kicks the guard's gun away, then smashes the phone in the\n        shack with his fist.  He pushes the button to raise the gate and walks\n        back to the bike.\n\n                                TERMINATOR\n                He'll live.\n\n        Terminator climbs onto the bike.  They drive toward the hospital,\n        heading down an ambulance ramp to an underground receiving area.\n\n71      INT. ISOLATION FLOOR\n\n        The attendants at the security checkpoint look up at the monitor as\n        someone enters the corridor.  They see Sarah, holding Silberman at\n        syringe-point.\n        Sarah speaks to them through an intercom on the wall.  Her voice\n        comes through the speaker.\n\n                                SARAH\n                Open it or he'll be dead before he hits the\n                floor.\n\n        The attendants' adrenaline levels just went off the scale.  The first\n        attendant shakes him head no.  The amperage here is really high.  The\n        second attendant keys the intercom switch.\n\n                                2ND ATTENDANT\n                There's no way, Connor.  Let him go.\n\n        Silberman's face is the color of suet.\n\n                                SILBERMAN\n                It won't work, Sarah.  You're no killer.  I don't\n                believe you'd do it.\n\n        Her voice is a deadly cold hiss.\n\n                                SARAH\n                You're already dead, Silberman.  Everybody here\n                dies.  You know I believe that.  So don't fuck\n                with me!\n\n                                SILBERMAN\n                Open the goddamn door!\n\n        The attendants looks at one another.  One of them hits the solenoid\n        button.  The far door unlocks.\n\n71A     IN THE LOCKOUT CORRIDOR.  Sarah pushes Silberman ahead of her.\n        The nearer, barred door must be unlocked manually.\n        One of the attendants cautiously approaches.  Nervously unlocks it.\n\n                                SARAH\n                Step back!\n        \n        He does.  She faces both of them.\n\n                                SARAH\n                Down on the floor!  Now!\n\n        They comply.  She comes through with Silberman, giving them a wide\n        berth.  Starts backing down the hall away from them, still holding\n        her hostage.  She's actually pulling this off.\n\n71B     ANGLE FROM BEHIND HER.  What we can see, but she can't see, it a\n        third orderly waiting just around the corner.  He's poised, ready to\n        jump her when she comes abreast of him.\n\n        ON SARAH backing up.  She reaches the corner.\n        The third attendant lunges, grabbing her syringe-hand.\n        Sarah spins on the orderly and catches him across the throat with the\n        nightstick.  He loses interest fast, dropping to his knees and\n        gagging.  Silberman pulls away, screaming at the top of his lungs\n\n                                SILBERMAN\n                Get her!\n\n        They scramble up as Sarah takes off like a shot around the corner.\n        One of them hits the panic button and ALARMS begin to sound.\n\n72      IN THE ISOLATION WARD, the T-1000 is looking in at a very stoned\n        attendant inside the nurses' station when the alarms shriek through\n        the halls.  It reaches into its chest and pulls out the 9mm pistol.\n        Heads for the security entrance.\n\n73      IN ANOTHER CORRIDOR in the maze of the vast hospital, Sarah flies\n        past us, her bare feet slapping on the cold tiles.  The orderlies\n        charge after her.\n        She's like an animal in a maze.  She turns the corner, glancing off\n        the wall, and sprints on without slowing.  She reaches a steel door.\n        Tries it.  Locked.\n        Footsteps like a drum solo behind her.\n\n        She fumbles with Douglas' keys, breathing hard.  Jams the master in.\n        The orderlies are bearing down on her at full tilt.\n        Sarah gets the door open.  Dives through.  Slams it.\n        She turns a deadbolt knob just as the first orderly grabs the latch\n        on the other side.  He's too late.\n\n        Sarah sees them beyond the window, fumbling with their keys.\n\n73A     Sarah is in another sally-port corridor.  A jail-cell type barred\n        door is between her and the corridors of the ward beyond.\n        She sprints to the walls of bars, jams her key into the door.\n        She unlocks and pulls open this door just as she hears the latch of\n        the one she just came through being unlocked.\n\n        She flings herself frantically through the barred door as the first\n        orderly comes through behind her.\n        She slams the bars shut.  CLANG.\n        Her keys are dangling from the lock on the other side from her.\n        The orderly is racing at her, white-lipped with rage.\n\n        She reaches back through the bars, turns the key, and purposefully\n        snaps it off in the lock.  An instant later the big orderly slams\n        against the door, grabbing through the bars for her as she dances\n        back just out of reach.\n        He lunges against the steel bars, unbelievably pissed off.\n\n        Sarah takes off running, looking back at the frustrated orderlies.\n        They're shouting at each other, unable to fit their keys into the\n        lock --\n        The broken-off key tip makes it impossible to get their keys in.\n        Silberman shouts at them.\n\n                                SILBERMAN\n                Go around, goddamnit!  Go around!!\n\n        The orderlies run back the way they came, and along a cross-corridor\n        to another set of doors.\n\n73B     ON SARAH as she rounds a corner and sees the elevators ahead.\n        Now she's home-free.  At a full-tilt sprint, she's nearly there when\n        the elevator doors part...\n\n        TERMINATOR steps out... his head swivels to face her.\n        Sarah reacts, stricken by the image from her worst nightmares.\n        Her eyes go wide as momentum carries her forward.\n        Her bare feet slip on the slick tile.  She slams to the floor,\n        staring up at the leather-clad figure with the shotgun.\n\n        She loses all semblance of courage and some of her sanity.\n        She's not even aware that she is screaming, or what would be\n        screaming if she could get the breath to do it.\n        In slowed-down dream-time, Sarah scrambles back along the floor like a\n        crab, spinning and clawing her way to her feet along the wall.\n\n        She runs like the wind, like in her nightmare.  If she looked back she\n        would have seen John step warily out of the corridor behind\n        Terminator.  John, however, catches a glimpse of the fleeing Sarah and\n        figures out instantly what happened.\n\n                                JOHN\n                Mom!!  Wait!\n\n        Sarah doesn't hear.  She has clicked fully into her own nightmare.\n        They take off running after Sarah.\n\n73C     She is pelting down the long corridor, back the way she came.  As she\n        reaches an intersection with a cross-corridor a white-clad figure\n        blurs from that corridor.  The orderly hits her in a flying tackle.\n        She skids across the floor, shrieking and struggling.  The other two\n        orderlies leap into the fray.\n\n                                SARAH\n                No!  Help me!  Goddamnit, it's gonna kill us\n                all!!!\n\n        She is shouting, pleading, trying to get them to understand what is\n        coming.  They grab her thrashing arms and legs.  They don't even look\n        where the out-of-control woman is pointing... back along the corridor.\n\n        They have pinned her to the cold tiles, a ring of faces above her.\n        Silberman leans down to her, holding a syringe with a heavy dose of\n        trank.  Sarah cranes her neck and sees the dark silhouette of\n        Terminator coming up behind them.  It is exactly her nightmare.\n        She screams in utter hopelessness.\n\n        Terminator, holding the shotgun in one hand, reaches down and grabs\n        one of the orderlies with his other hand.  He hurls the 200-pound\n        guys against the far wall of the corridor.  SMACK!  He drops to the\n        floor.\n        The other two orderlies react instantly, leaping onto the intruder.\n        Terminator seems to disappear for a moment under the two big guys.\n        Then there is an explosion of white-clad figures, as the orderlies are\n        flung outward like they stepped on a land mine.\n        One crashes through a window of safety glass and is caught before a\n        two-story fall by the outer steel bars.  The other crashes through an\n        office door, splintering it into kindling.\n\n        Silberman has jumped to hold Sarah.  He is grabbed by a roll of skin\n        at the back of his neck and lifted like a cat.  The doctor feel his\n        feet pedaling above the ground.  He looks into the expressionless\n        face.  And it hit him.  Sarah was right... this guy isn't human.\n        He feels the fabric of reality crumbling.\n        Then he feels himself flying through the air.  The wall smacks him,\n        then the floor kicks him in the face.  He decides to lie there a\n        second.\n\n        Sarah blinks, staring up at the figure looming over her.\n        John kneels next to her.\n\n                                JOHN\n                Mom, are you okay?\n\n        She looks from Terminator to John.  Back to Terminator.\n        Is this a nightmare?  Or has she finally gone truly bad?\n\n        Incredibly, Terminator politely reaches his hand down to her, offering\n        to help her up.  The last thing she ever expected to see.\n\n                                TERMINATOR\n                Come with me if you want to live.\n\n        The orderlies are stirring.\n\n                                JOHN\n                It's all right, Mom.  He's here to help.\n\n        Sarah, is a daze, takes the huge hand in her shaking fingers.\n        Terminator lifts her to her feet.\n\n73D     John sees a GUARD standing thirty feet away, on the other side of the\n        walls of bars.  John doesn't know what we know, but he knows\n        something's not right with this guy.  Terminator turns to follow\n        John's gaze.\n        The T-1000 had its pistol in its hand, at its side.\n        Terminator pushes John behind him.  They start backing up.\n\n73E     The T-1000 walks forward, reaching the bars.  It doesn't stop.\n        Its body divides like jello around the bars.  As it squeezes itself\n        through like metal playdough, its surface reforms perfectly on our\n        side.  We see it deform and squeeze through like a viscous paste\n        forced past an obstacle.\n        Silberman has recovered enough to be sitting up and watching this.\n        That faint snapping sound is his mind.\n        There is a CLANK and we see that the guard's gun has caught against\n        the bars... the only solid object.  The T-1000 turns its wrist and\n        tries again, slipping the gun endwise through the gap.\n\n73F     Sarah is agape.  Not reacting.  It's been a heavy day for her.\n        Terminator grabs John by the seat of his pants and hooks him up onto\n        his back.  John grabs him around the neck.  Terminator raises the\n        shotgun and starts backing up.\n\n                                TERMINATOR\n                Go!  Run!\n\n        Sarah doesn't need to be told twice.\n        T-1000 walks toward them, opening fire with the Browning Hi-Power.\n        Terminator straight-arms the 12-guage like a pistol and FIRES.\n        The stunned orderlies flop face down on the floor as the corridor is\n        filled with high-velocity lead.  One of them, stupidly running for the\n        cross-corridor, gets hit by the T-1000.\n\n        Terminator is hammered by several slugs, and the T-1000 is cratered\n        by two buckshots hits.  It staggers, but comes on.  In the craters\n        we see bright mercury before they close and reseal, disappearing in a\n        second.\n\n73G     Terminator makes it around the corner and breaks into a run.  Ahead,\n        Sarah is already at the elevator.  Terminator and John pile in and\n        John slaps the button for \"Garage Level\".\n\n        The doors start to close.  T-1000 clears the corner.\n        Terminator slams John and Sarah back against the side walls as the\n        T-1000 charges at them, rapid firing the Browning.\n        The rounds hit the steel doors as they close.\n        T-1000 keeps pumping them at the closing gap.\n73H     Inside, they see the backside of the doors denting with the hits that\n        are punching holes in the other side.\n\n73I     The Browning locks open, empty.  T-1000 drops it without a glance\n        back.  The doors close.  K-WHAM!  The T-1000 hits them a split second\n        later.  The elevator hasn't moved yet.  SSWWIKK!\n\n73J     A sword-like blade rams through in between the doors, forcing them\n        open.  Terminator jams the shotgun through the widening gap.  Punches\n        the muzzle right INTO T-1000's face -- BOOM!!\n73K     We get a glimpse of the T-1000's head blown apart by the blast.  It\n        is hurtled back.  The doors close.  The car descends.\n\n73L     ON THE T-1000, outside the elevator.  Its head, which is blown apart\n        into two doughy masses lying on the shoulders, reforms quickly.\n        There is no trace of the injury.  It sees the closed door and jams its\n        hands between them, its fingertips becoming pry-bars.  It pulls the\n        doors apart with inhuman strength\n73M     and LEAPS INTO THE OPEN SHAFT.\n        It falls two floors and...\n\n74      IN THE ELEVATOR.  Out trio hears a loud THUMP on the roof.\n        Terminator, reloading the shotgun, looks up.\n        Sarah grabs the .45 from his waistband and aims it at the ceiling.\n        BEAT...\n        Then CLANGG!! a swordlike shaft punches through the ceiling and spears\n        down four feet into the elevator car.\n        It is inches from Sarah's face.\n        She opens fire, BAM-BAM-BAM -- right through the roof.\n        Lighting-fast the lance withdraws and thrusts down again, slashing\n        Terminator's jacket, and missing John by inches.\n        Terminator chambers a round and K-BOOM! the 12-guage opens a hole in\n        the ceiling.\n        Terminator rocks out in a fury of firing/cocking/firing as the metal\n        shafts slash down again and again.  Sarah yells in pain as one of them\n        slices open her upper arm.\n\n75      The doors open.  Sarah pulls John out as soon as the gap is wide\n        enough.\n        They emerge into the basement.  We see the Harley parked nearby.\n\n        Terminator, in a rearguard action, fires another blast through the\n        ceiling and runs out.  He throws his leg over the Harley, kicks it to\n        life with one powerful stroke and then whips something out of the\n        inner pocket of his jacket.  He throws it to John.  A road flare!?\n\n76      In the elevator, the T-1000 has bashed a hole in the ceiling big\n        enough to...\n        Pour itself through.\n        A massive blob of mercury extrudes from the opening.  The mass drops\n        through the hole, down out of frame, then comes back up into frame\n        as Officer X.\n\n        It seems to need just a second to get its mental act together after\n        doing this king of taffy-pull with itself.  It opens its eyes and\n        sees --\n\n77      TERMINATOR, the shot gun held in his teeth, astride the roaring\n        Harley twenty feet away.  Terminator twists the throttle and pops the\n        clutch.\n        The back tire screams on the concrete.  The front wheel lifts off the\n        ground and the heavy bike launches in a thundering wheelie.\n\n        Terminator gets off just before the bike hurtles into the elevator.\n        The Harley slams the T-1000 square and smashes it right through the\n        back wall of the elevator.\n        Terminator rolls to his feet.\n        Johns strikes the flare on the concrete.  Tosses it.\n        Terminator catches the life flare with one hand.\n        Levels the shotgun with the other.\n        With his last round he blows a big hole in the bike's gas tank.\n        Gas splashes everywhere, covering the struggling T-1000.\n        Terminator tosses the flare.  KA-VOOOM!\n\n        The explosion knocks Terminator backward off his feet, enveloping him\n        in the fireball.  He gets up, smoking, and runs after John and Sarah\n        toward the exit ramp.\n\n78      AT THE EXIT RAMP.  They are partway up when a blue-and-white hospital\n        security car comes screeching down the other way.\n        Without breaking stride Sarah runs right at the car.  It skids to a\n        shrieking halt.  She's in the guy's face with the .45 in both hands.\n\n                                SARAH\n                Out of the car!!\n\n        The patrol guy is thinking what he can try when BLAM! she puts a round\n        through the glass next to his head.\n\n                                SARAH\n                RIGHT NOW!\n\n        The door opens and the guy is coming out with his hands up as\n        Terminator arrives.  The cyborg flings the rent-a-cop out of the way\n        and slides behind the wheel.  Sarah gets John into the back seat and\n        dives into the front passenger seat as --\n\n78A     Terminator slams the car into reverse and punches it, lighting up the\n        tires on the slick ramp.\n        Terminator hands the shotgun over his shoulder to John and tells him\n        to reload.  John pulls some shells from the pocket of his army jacket\n        and starts feeding them in.\n        Terminator power backward up the ramp, scraping along one wall, barely\n        in control.  Because...\n\n79      The T-1000 is running at them out of the inferno below.\n        This guy won't quit.  Shifting from chrome mode to cop-form as it\n        runs.\n        It sprints up the ramp after the retreating car.  T-1000 is gaining.\n\n80      Terminator hands Sarah another magazine for the .45.  She snatches\n        it, drops the other out, and slaps in the new one.  Cocks the slide.\n        The car backs along the service driveway toward the security gate.\n        John hands the shot gun back to Terminator.\n        He leans out the window and takes aim at the pursuer.\n        The T-1000's face is right in the headlights.\n80A     Terminator fires, blowing a hole in its shoulder.  Shiny liquid metal\n        visible in the hole, which then closes.\n80B     Sarah, half out the passenger window, opens fire.\n        The car crashes backward through the security barricade.\n\n                                TERMINATOR\n                        (calmly)\n                Hang on.\n\n        He cuts the wheel hard.  The car slews into a reverse 180, swapping\n        ends with a screech.\n        T-1000 is almost on them.\n        Terminator punches it.  The car accelerates forward.\n\n80C     T-1000 leaps.  Lands on the trunk.\n        Its hand is a metal crowbar slammed down through the trunk lid.\n        Feet dragging on the pavement, it slams its other hand down,\n        punching another metal hook into the trunk lid, pulling itself up.\n        Terminator turns to Sarah.\n\n                                TERMINATOR\n                Drive.\n\n        Terminator heaves himself half out the driver's window.  Sarah slaps\n        her foot down on the throttle and steers from the passenger side.\n\n80D     T-1000, fully on the car now, holds on with one hook-hand while it\n        slams the other into the back window, sweeping away the glass and\n        missing John by inches as he ducks.\n        It draws back for another swing, lunging forward as --\n\n80E     Terminator whips the shotgun over the roof of the car.\n        Fires point-blank.\n        Hits the T-1000's arm just above the \"hand\" which anchors it to the\n        car.  The 12-guage blows the arm apart, severing the hook-hand.\n\n80F     T-1000 tumbles backward off the accelerating car.\n        John looks out the back window, his eyes wide.\n        He sees the T-1000 roll to his feet and continue running.\n        But he's dropping way behind now.  Sarah has the car floored and the\n        liquid-metal killer won't catch them on foot.\n\n80G     John watches, in awe, as the \"crowbar hand\", stuck into the trunk\n        right in front of him, reverts to the neutral polyalloy... a kind of\n        think mercury.  The gray metal slides off the trunk of the car and\n        falls onto the road to lie there in a quivering blob.\n\n80H     The car speeds off into the night.\n        REVERSE on the T-1000, walking now, coming right up into closeup,\n        watching the tail lights recede.  It looks down.\n\n80I     ANGLE ON BLACKTOP, tight on the liquid metal blob.  Next to it is the\n        T-1000's shiny cop shoe.  The mercury blob crawls and rejoins the\n        main mass, disappearing into the \"shoe\".\n\n81      INT./EXT. SECURITY CAR\n\n        A GHOST CAR blasts out of the darkness on a long stretch of moonlight\n        highway.  Headlights off, the hospital security car punches a hole in\n        the wind.\n\n81A     INSIDE THE SPEEDING CAR the energy is still high.  The air is blowing\n        in the shattered windows as Terminator drives the car easily by\n        electronic night-vision.  His eyes glow faintly red.\n\n                                JOHN\n                Can you see anything?\n\n81B     TERMINATOR'S POV.  A monochrome image of the highway lit bright as\n        day.\n\n81C     Terminator replies in a matter-of-fact tone.\n\n                                TERMINATOR\n                Everything.\n\n                                JOHN\n                Cool.\n\n        Sarah looks at Terminator, still not quite believing this is\n        happening.  But this is a different Sarah than the waitress of 1984.\n        She spends only a second or two dealing with the unbelievable.\n        Then she turns to John in the back seat.\n\n                                SARAH\n                You okay?\n\n        He nods.  She reaches for John and we think she's going to hug him.\n        She starts to rub her hands over him and we realize she's checking for\n        injuries, very clinically the way a vet checks a dog for broken bones.\n\n        He pulls away from her.  He hates her always checking him, treating\n        him like he might break, like some piece of rare china.\n\n                                JOHN\n                I said I was okay.\n\n        Sarah looks at him, exasperated and stern.\n\n                                SARAH\n                It was stupid of you to go there.\n\n        John stares at her, surprised.\n\n                                SARAH\n                Goddamnit, John, you have to be smarter than\n                that.  You're too important!  You can't risk\n                yourself, not even for me, do you understand?\n                I can take care of myself.  I was doing fine.\n                Jesus, John.  You almost got yourself killed.\n\n        We see his chin quiver.  He's a tough kid, but all he really wants is\n        for her to love him.  He hasn't had enough years on the planet yet to\n        be the man of steel she demands.\n\n                                JOHN\n                I... had to get you out of the place... I'm\n                sorry, I...\n\n        His face crumples.  He starts to cry.  Sarah gives him a cold stare.\n\n                                SARAH\n                Stop it!  Right now!  You can't cry, John.\n                Other kids can afford to cry.  You can't.\n\n        He's trying to be brave, he really is.  Terminator turns and sees the\n        water leaking from his eyes.  It doesn't make and sense to him.\n\n                                TERMINATOR\n                What is wrong with your eyes?\n\n        John turns away, ashamed.  Sarah lets her breath out, realizing how\n        keyed up she is.  She turns to Terminator, giving him a wary once-\n        over.\n\n                                SARAH\n                So what's your story?\n\n                                                CUT TO:\n\n82      EXT. MENTAL HOSPITAL\n\n        The cops have shown up, as they always do.  There are black-and-whites\n        everywhere, and ambulances are arriving.  Two cops and an orderly are\n        required to subdue poor Doctor Silberman, who is raving at the top of\n        his lungs.\n\n                                SILBERMAN\n                ... it was all true and we're all going to die\n                and the changed, I saw him change!!\n\n        It's quite pathetic.\n        A nurse shoots him up with a sedative.  They lead him away.\n\n82A     T-1000 walks unperturbed among the milling cops.  No one notices him.\n        It slips into its cruiser and drives off into the night.\n\n83      INT. CAR\n\n        Terminator drives steadily into the black night.\n\n                                SARAH\n                This T-1000... what happens when you shoot it?\n\n                                TERMINATOR\n                Ballistic penetration shocks it, but only for a\n                few seconds.\n\n        Sarah thinks about that.  Then:\n\n                                SARAH\n                Can it be destroyed?\n\n                                TERMINATOR\n                Unknown.\n\n        They ride along in silence for a few seconds.\n        Sarah sees something up ahead, some lonely neon in the blackness.\n\n                                SARAH\n                Pull in here.  We have to ditch this car.\n\n84      EXT. SERVICE STATION - NIGHT\n\n        A rundown gas station with a buzzing neon sign and no one around.\n        They pull into the drive and slowly cruise past the empty office.  A\n        sign in the window says CLOSED SUNDAYS.  They continue around the\n        building to the garage's back door.\n\n        AT THE GARAGE DOOR.  Terminator breaks the lock on the roll-up door\n        and raises it.  Sarah pulls the security car in out of sight.\n        Terminator rolls the door down behind them.\n\n85      INT. GAS STATION\n\n        Dark.  Sarah switches on the single drop-light.  She and Terminator\n        look at each other.  Terminator is shot-up and bleeding, and Sarah\n        has a vicious slash in her upper arm which was soaked her sleeve with\n        blood.\n\n                                SARAH\n                You look like handmade shit.\n\n                                TERMINATOR\n                So do you.\n\n                                                CUT TO:\n\n86      TIGHT ON FIRST-AID KIT from the office, plus some not-so-oily rags, a\n        bottle of rubbing alcohol, a few small tools, and other makeshift\n        odds and ends.  Terminator's hand comes into shot.  Sets down a bloody\n        rag.  Picks up a clean one.\n\n        WIDER.  Sarah sits on an empty crate.  Terminator's is beside her,\n        suturing her wound with some fine wire from the winding of an\n        alternator.  Using a pair of needlenose pliers he draws the wire\n        through her pale skin with a delicate hand.\n\n                                TERMINATOR\n                I have detailed files on human anatomy.\n\n        Sarah stares into his face, inches away, fighting the pain.  She\n        doesn't like him being this close to her to begin with, let alone\n        carving on her.\n\n                                SARAH\n                I'll bet. Makes you a more efficient killer,\n                right?\n\n                                TERMINATOR\n                Correct.\n\n                                                CUT TO:\n\n87      TIGHT ON TERMINATOR'S BACK.  The leather jacket is riddled with bullet\n        holes.  Sarah and John help pull it off, revealing Terminator's\n        broad, muscular back beneath.\n\n        WIDER.  John and Sarah stare in amazement.  There are at least twenty\n        bullet holes in him.  Back.  Arms.  Legs.  Fortunately they're all\n        9mm.  The holes are small and the damage cosmetic.\n\n                                JOHN\n                Does it hurt?\n\n                                TERMINATOR\n                I sense injuries.  The data could be called\n                pain.\n\n        TIGHT ON SARAH AND TERMINATOR.  Sarah starts washing the bullet holes\n        in his broad back with alcohol.\n\n                                SARAH\n                Will these heal up?\n\n        Terminator nods.  She reaches into the bloody wounds with pliers and\n        finds the copper-jacketed bullets, flattening against the armored\n        endoskeleton.  Pulls them out.  They CLINK one by one into a glass.\n\n                                SARAH\n                That's good.  Because if you can't pass for\n                human, you won't be much good to us.\n\n        She concentrates on removing the slugs.  CLINK.  CLINK.\n\n                                JOHN\n                How long do you live?  I mean, last?\n\n                                TERMINATOR\n                A hundred and twenty years on my existing\n                power cell.\n\n        Sarah nods, pulling out another slug.  CLINK.  The glass nearly full\n        of flattened bullets.  She begins to sew the holes closed with a few\n        wire sutures.  John watches in quiet amazement, the two warriors\n        calmly fixing each other.\n\n                                JOHN\n                Can you learn?  So you can be... you know.\n                More human.  Not such a dork all the time.\n\n        Terminator turns towards him.\n\n                                TERMINATOR\n                My CPU is a neural-net processor... a learning\n                computer.  But Skynet presets the switch to\n                \"read-only\" when we are sent out alone.\n\n                                SARAH\n                        (cynical)\n                Doesn't want you thinking too much, huh?\n\n                                TERMINATOR\n                No.\n\n                                JOHN\n                Can we reset the switch?\n\n                                                CUT TO:\n\n88      E.C.U. OF AN X-ACTO KNIFE cutting into Terminator's scalp at the base\n        of his skull.  His voice calmly directs Sarah as she spreads the bloody\n        incision and locates the maintenance port for the CPU in the chrome\n        skull beneath.\n\n                                TERMINATOR\n                Now open the port cover.\n\n        She wipes away the blood and uses the garage-mechanic's air tools to\n        unscrew the port cover.\n\n88A     TERMINATOR POV (DIGITIZED) as he watches her work in a mirror they've\n        taken from the washroom.  Sarah and John are standing behind him.\n        Her hands are covered with blood, like a surgeon's.\n\n                                TERMINATOR\n                Hold the CPU by its base tab.  Pull.\n\n        Following the instructions, she reaches in with a pair of tweezers and\n        PULLS -- there is a BURST OF STATIC and the screen goes BLACK.\n\n                                                CUT TO:\n\n89      TIGHT ON JOHN AND SARAH looking at what she has removed.  A reddish-\n        brown ceramic rectangle with a connector on one end.  About the size\n        and shape of a domino.  On close inspection it appears to be made up\n        of small cubes connected together.  It is identical to the shattered\n        one in the vault at Cyberdyne Systems.  Now we know it is that that\n        Miles Dyson values so highly.  The brain of a terminator.\n\n89A     WIDER.  John walks around Terminator and looks at his face.\n        Eyes open, he is completely inert.  Dead.\n\n        John lifts his huge hand.  The dead servos whine sullenly as he forces\n        them.  It's like rigor mortis.  He releases the hand and it stays in\n        the lifted position.  Sarah examines the CPU chip.\n\n                                JOHN\n                Can you see the pin switch?\n\n        She ignores him.  See looks at Terminator.\n        The back at the chip.\n        Then she sets it on the work table and picks up a small sledge hammer.\n        John realizes what she is about to do.  Dives at her as the sledge is\n        whistling down.\n\n                                JOHN\n                No!!!!\n\n        He slaps his hand down over the chip.\n        Sarah barely stops the sledge before smashing his fingers.\n\n                                SARAH\n                Out of the way, John!\n\n                                JOHN\n                No!  Don't kill him!\n\n                                SARAH\n                It, John.  Not him.  It.\n\n                                JOHN\n                Alright, it!  We need it!\n\n        John keeps his hand right where it is.\n\n                                SARAH\n                We're better off by ourselves.\n\n                                JOHN\n                But it's the only proof we have to the future...\n                about the war and all that.\n\n                                SARAH\n                I don't trust it!  These things are hard to\n                kill, John, believe me, I know.  We may never\n                have this opportunity again.\n\n                                JOHN\n                Look, Mom, if I'm supposed to ever be this great\n                leader, you should start listening to my\n                leadership ideas once in a while.  'Cause if you\n                won't, nobody else will.\n\n        Smart kid.  He's got her.  She nods, reluctantly.  He palms the chip\n        and studies it minutely.\n\n89B     John takes a pin and moves the almost invisible switch to the other\n        position.\n        It is now in \"write\" mode.  Then he grimaces as he inserts the wafer\n        back into the slot in Terminator's skull.\n\n89C     TERMINATOR VISION flares back to life in a burst of static.  The image\n        forms.  Sarah and John stands behind him in the mirror.\n\n                                TERMINATOR\n                Was there a problem?\n\n        John glances sheepishly at Sarah,  Then smiles at Terminator.\n\n                                JOHN\n                No problem.  None whatsoever.\n\n                                                CUT TO:\n\n90      JOHN SLEEPING, lying on a pile of rags next to a stack of tires.\n        The lights are off.  Sarah sits nearby, cross-legged, he back against\n        the wall.\n        The .45 is cradles in her lap.  She looks weary, but she won't allow\n        herself to sleep with Terminator present.\n\n        By the office windows, in a slash of moonlight, is Terminator.  He\n        stands silent and still, watching the night.  Only his eyes move,\n        tracking with the occasional car passing on the road.  He figure\n        silhouetted and still.\n\n                                                DISSOLVE TO:\n\n91      SAME IMAGE.  Now DAYLIGHT streams in the dusty windows.\n        Terminator has not moved.  Faithful machine sentinel.  He turns at a\n        sound.  John stirs, waking up.  He squints into the sunlight.  Sarah\n        is still awake.  She gets up, wincing at the pain in her arm.\n\n                                                CUT TO:\n\n92      EXT. GAS STATION - DAY (LATER)\n\n        John and Terminator walks to an old Chevy pickup parked behind the\n        garage.  The day is clear but windy.  Dust devils chase themselves\n        behind the place.  The pickup is locked but Terminator breaks the side\n        window with his fist and opens the door.  He and John climb in.\n\n92A     IN THE PICKUP.  Terminator has this trick (which you could do too if\n        you had servo-driven steel fingers) where he smashes the cowl around\n        a steering column with one blow from the palm of his hand.  When it\n        shatters he strips it away with a single move, and then turns the stub\n        of the lock-mechanism with his fingertips.  This starts the vehicle.\n        It takes about three seconds.\n\n        In fact, he does it so quickly, the truck is running by the time John\n        flips down the sun visor.  A set of keys drops out and John catches\n        them.  Dangles them in front of Terminator's eyes.\n\n                                JOHN\n                Are we learning yet?\n\n92B     Sarah comes out.  She's found a mechanic's coverall inside, used but\n        fairly clean.  It doesn't fit her too well, but it's better than the\n        stuff from the hospital.  She's still barefoot.\n        The sun, which she hasn't seen in months, hurts her eyes,\n        Terminator and John pull up in the pickup.  She gets in.\n\n92C                             TERMINATOR\n                We need to get as far from the city as possible.\n\n                                SARAH\n                Just head south.\n\n                                                CUT TO:\n\n93      INT./EXT. PICKUP TRUCK/HIGHWAY - DAY\n\n        THE OPEN ROAD.  The pickup roars through light traffic down a long\n        stretch of highway.  They set three abreast on the bench seat, John\n        in between, like some improbable family on a car trip.\n        Sarah leans over to get a look at the speedometer.\n\n                                SARAH\n                Keep it under sixty-five.  We can't afford to\n                be pulled over.\n\n        Terminator backs off the throttle slightly.\n\n                                TERMINATOR\n                Affirmative.\n\n                                JOHN\n                No, no, no.  You gotta listen to the way people\n                talk.  See, you don't say like \"Affirmative\" or\n                some shit like that.  You say... no problemo.\n\n        Terminator nods, filing away the information.  Sarah is ignoring the\n        lesson, lost in thought.\n\n                                JOHN\n                It someone comes off to you with an attitude,\n                you say \"eat me\"... if you wanna shine them on,\n                it's \"Hasta la vista, baby\".\n\n                                TERMINATOR\n                \"Hasta la vista, baby\"?\n\n                                JOHN\n                Yeah, or \"later, dickwad.\"  Or if someone gets\n                upset you say \"chill out.\"  Like that.  Or you\n                can do combinations.\n\n                                TERMINATOR\n                Chill out, dickwad.\n\n                                JOHN\n                That's great!  See, you're getting it.\n\n                                TERMINATOR\n                No problemo.\n\n                                                CUT TO:\n\n94-95   OMITTED\n\n96      EXT. ROADSIDE STAND/GAS STATION - DAY\n\n        There's a gas pump and a sleazy fast-food stand.  Picnic tables are\n        set up at the side of the food stand.  A family sits at one, children\n        playing and running about.\n96A     The pickup truck pulls into the lot.  Stops at the gas pump.\n        Sarah turns to John.\n\n                                SARAH\n                You got any cash?\n\n        John pulls what's left of his Ready-Teller money from his pocket.\n\n                                JOHN\n                Only a couple hundred bucks.  I'll give you\n                half.\n\n        Sarah grabs all of it.  Peels off a twenty, hands it to John.\n\n                                SARAH\n                Get some food.\n\n        She opens the truck door and steps out.  John turns to Terminator.\n\n                                JOHN\n                No sense of humor.\n\n97      THE ORDERING WINDOW as John and Terminator approach.\n\n                                JOHN\n                And that's another thing.  You could lighten up\n                a bit, yourself.  This severe routine is getting\n                old.  Smile once in a while.\n\n                                TERMINATOR\n                Smile?\n\n                                JOHN\n                Yeah.  Smile.  You know.  People smile, right?\n                Watch.\n\n        Goes to the order window.\n\n                                JOHN\n                        (smiling broadly)\n                Hi.  Nice place you got here.  How's business?\n\n                                WINDOW WOMAN\n                        (stone-faced)\n                Gimme a break.\n\n                                JOHN\n                        (to Terminator)\n                Okay.  Bad example.  Over there, look.\n\n        John points at THREE TEENAGE GUYS standing at a drinking fountain\n        nearby.  One of them has said something funny and the others are\n        laughing, grinning.\n\n                                JOHN\n                Like that.\n\n        TERMINATOR POV (DIGITIZED)  The real-time image continues while a\n        replay of one of the guys grinning runs in a window.  It expands, so\n        that the guy's mouth fills the window.  Replays again in slow motion.\n        A vector-graphic of the lips smiling appears, along with an array of\n        symbolic data.\n\n        Terminator tries it.  The result is dismal.  A rictus-like curling of\n        the lip.  Terminator's next effort is a marginal improvement.\n\n                                JOHN\n                I don't know, maybe you could practice in front\n                of a mirror or something.\n\n                                                CUT TO:\n\n98      EXT. REST STOP/PICKUP TRUCK - DAY (LATER)\n\n        Sarah and John are eating cheeseburgers and fries, sitting in the\n        truck and on the curb respectively.  They are parked away from the\n        other families, at the end of the gravel parking area.  Terminator\n        is pouring coolant into the radiator.  Sarah is deep in through,\n        turning and turning the whole thing in her brain.  John, unable to\n        deal with her silence, goes around to where Terminator is working.\n\n98A     John sees two kids playing with machine-gun water pistols nearby,\n        viciously squirting each other.\n\n                                FIRST KID\n                You're dead!\n\n                                SECOND KID\n                Am not!\n\n                                FIRST KID\n                Are so!\n\n        John and Terminator watch them rolling on the ground in a fight to the\n        death.  Sarah rounds the front of the truck, and sees the kids.  John\n        sighs, solemn.  He looks up at the cyborg.\n\n                                JOHN\n                We're not gonna make it, are we?  People, I\n                mean.\n\n                                TERMINATOR\n                It is in your nature to destroy yourselves.\n\n        John nods, depressed.\n\n                                JOHN\n                Yeah.  Drag, huh?\n\n                                SARAH\n                I need to know how Skynet get built.  Who's\n                responsible?\n\n                                TERMINATOR\n                The man most directly responsible is Miles Bennet\n                Dyson, Director of Special Projects at\n                Cyberdyne Systems Corporation.\n\n                                SARAH\n                Why him?\n\n                                TERMINATOR\n                In a few months he creates a revolutionary\n                type of mircoprocessor.\n\n                                SARAH\n                Then what?\n\n98B     Terminator closes the hood and gets into the truck as he speaks.\n\n                                TERMINATOR\n                In three years Cyberdyne will become the largest\n                supplier of military computer systems.  All\n                stealth bombers are upgraded with Cyberdyne\n                computers, becoming fully unmanned,  Afterward,\n                the fly with a perfect operational record.\n\n                                SARAH\n                        (getting behind John)\n                Uh huh, great.  Then those fat fucks in\n                Washington figure, what the hell, let a computer\n                run the whole show, right?\n\n                                TERMINATOR\n                Basically.\n                        (starting the engine, backing\n                        out)\n                The Skynet funding bill is passed.  The system\n                goes on-line August 4th, 1997.  Human decisions\n                are removed from strategic defense.  Skynet\n                begins to learn, at a geometric rate.  It becomes\n                self-aware at 2:14 a.m. eastern time, August 29.\n                In a panic, they try to pull the plug.\n\n                                SARAH\n                And Skynet fights back.\n\n        They accelerate back onto the highway.\n\n                                TERMINATOR\n                Yes.  It launches its ICBMs against their\n                targets in Russia.\n\n                                SARAH\n                Why attack Russia?\n\n                                TERMINATOR\n                Because Skynet knows the Russian counter-strike\n                will remove its enemies here.\n\n                                SARAH\n                Jesus.\n                        (beat, then)\n                How much do you know about Dyson?\n\n                                TERMINATOR\n                I have detailed files.\n\n                                SARAH\n                I want to know everything.  What he looks like.\n                Where he lives.  Everything.\n\n99      INT. DYSON HOUSE - DAY\n\n        Miles Dyson sits at the huge desk in his study.  He is deep in\n        thought, tapping away at the keyboard of his home computer terminal.\n        Next to desk are racks of sophisticated gear.  On a Sunday morning,\n        when most men are relaxing, spending time with their families, Dyson\n        is hard at work.\n\n        IN A PROFILE CLOSEUP we see him in deep concentration, his mind\n        prowling the labyrinth of his new microprocessor.\n\n        A WOMAN'S FACE ENTERS FRAME soundlessly behind him.  He doesn't hear\n        her.  His wife, TARISSA, extends her tongue and traces it down the\n        back of his neck.  He smiles and turns to kiss her good morning.\n        She's still in her bathrobe, holding coffee.  He's been up for hours.\n        He turns and goes back to work, forgetting instantly that she is\n        standing there.\n\n        She watches him work, the arcane symbols moving across the screen.\n        We see her frustration, her inability to truly enter the magic box\n        of his world.\n\n                                TARISSA\n                You going to work all day?\n\n                                DYSON\n                I'm sorry, baby.  This thing is just kicking my\n                ass.  I thought we had it with this one...\n\n        He points to a metal box on his desk, about two feet long.  As\n        assembly of small cubes.  It looks like a dinosaur version of\n        Terminator's CPU.\n\n                                DYSON\n                ... but the output went to shit after three\n                seconds.  I'm thinking now it's the way I'm\n                matrixing the command hierarchies...\n\n                                TARISSA\n                You need a break.  You'll see it clear when you\n                come back.\n\n                                DYSON\n                I can't\n\n                                TARISSA\n                Miles, it's Sunday.  You promised to take the\n                kids to Raging Waters today.\n\n                                DYSON\n                Oh.  I can't, honey.  I'm on a roll here.\n\n        He takes her hands.  We see a childlike excitement in his face.  He\n        wants so badly to share the almost orgasmic thrill of discovery,\n        the satisfaction of creation.\n\n                                DYSON\n                Baby, this thing is going to blow 'em all away.\n                It's a neural-net process --\n\n                                TARISSA\n                I know.  You told me.  It's a neural-net\n                processor.  It thinks and learns like we do.\n                It's superconducting at room temperature.\n                Other computer are pocket calculators by\n                comparison.\n                        (she pulls away from him)\n                But why is that so goddamn important, Miles?\n                I really need to know, 'cause I feel like I'm\n                going crazy here, sometimes.\n\n                                DYSON\n                I'm sorry, honey, it's just that I'm thiiis\n                close.\n\n        He holds up his thumb and index finger... a fraction of an inch apart.\n        She picks up the prototype.  It doesn't look like much.\n\n                                DYSON\n                Imagine a jetline with a pilot that never makes\n                a mistake, never gets tired, never shows up to\n                work with a hangover.\n                        (he taps the prototype)\n                Meet the pilot.\n\n                                TARISSA\n                Why did you marry me, Miles?  Why did we have\n                these two children?  You don't need us.  Your\n                heart and your mind are in here.\n                        (she stares at the metal box\n                        in her hands)\n                But it doesn't love you like we do.\n\n        He takes the anodized box from her hands and sets it down.  Then he\n        puts his hands on her shoulders and kisses her gently.  She acquiesces\n        to his kiss.\n\n                                DYSON\n                I'm sorry.\n\n        Tarissa glances over his shoulder.  She nods her head toward the\n        doorway to the study.  Dyson turns and sees their two kids standing\n        there.  Danny (6) and Blythe (4) look rumpled and adorable in their\n        PJs.  Dyson wilts at their hopeful expressions.\n\n                                TARISSA\n                How about spending some time with your other\n                babies?\n\n        Dyson grins. The forces of darkness have lost this round.  He holds\n        out his hands and his kids run to him, cheering.\n\n                                                CUT TO:\n\nA100    EXT. DESERT/COMPOUND - DAY\n\n        The desert northwest of Calexico.  Burning under the sun like a\n        hallucination.  Heat shimmers the image, mirage-like.\n        Terminator turns the pickup off the paved road and barrels along a\n        roadbed a sand and gravel, trailing a huge plume of dust.\n        A sign at the turnoff says:     CHARON MESA     2 MI\n                                        CALEXICO        15 MI\n\nA101    AHEAD is a pathetic oasis of humanity in the vast wasteland, a couple\n        of aging house-trailers, surrounded by assorted junk vehicles and\n        desert-style trash.  There is a dirt airstrip behind the trailers, and\n        a stripped Huey helicopter sitting on block nearby.\n\n        The truck rolls to a stop in a cloud of dust.  The place looks\n        deserted.  The door to the nearest trailer bangs in the wind.\n\n                                SARAH\n                        (to Terminator and John)\n                Stay in the truck.\n\nA102    ANGLE FROM INSIDE ANOTHER TRAILER, NEARBY.\n        A DARK FIGURE in the F.G. has an AK-47 trained on the pickup as\n        Sarah gets out.\n\n        ON SARAH peering through the backlit dust.\n        The sound of wind.  She approaches the trailer.\n\n                                SARAH\n                        (in Spanish)\n                Enrique?  You here?\n\n        She hears KACHANK! behind her and spins, whipping out her .45 in one\n        motion.\n\n        ENRIQUE SALCEDA stands behind a rusting jeep, a 12-gauge pump trained\n        on her.  He is mid-forties, a tough Guatemalan with a weathered face\n        and heavy mustache.  He wears cowboy boots and a flak vest, no shirt.\n\n                                SALCEDA\n                You pretty jumpy, Connor.\n\n        His fierce face breaks into a broad grin.  The shotgun drops to his\n        side as he walks toward her.  When he reaches her he hugs her, then\n        steps back.\n\n                                SALCEDA\n                        (in Spanish)\n                Good to see you, Connor.  I knew you'd make it\n                back here sooner or later.\n\n        He grins at John as he steps from the truck, and then clocks\n        Terminator getting out.\n\n                                SALCEDA\n                Oye, Big John!  Que pasa?  Who's your very large\n                friend?\n\n                                JOHN\n                        (perfect Spanish)\n                He's cool, Enrique.  He's... uh... this is my\n                Uncle Bob.\n                        (to Terminator, in English)\n                Uncle Bob, this is Enrique.\n\n        Terminator smiles.  Sort of.  Salceda squints at him,\n\n                                SALCEDA\n                Hmmm.  Uncle Bob, huh?  Okay.\n                        (yelling)\n                Yolanda.  Get out here, we got company.  And\n                bring some fucking tequila!\n\n        A thin Guatemalan KID, FRANCO, eighteen or so, comes out of the\n        trailer with the AK-47, followed by Salceda's wife, YOLANDA.  She has\n        THREE younger children with her, from a five-year-old GIRL, JUANITA,\n        to a year-and-half-old BOY.  She waves at John.  They exchange\n        greetings in Spanish.  They seem like nice people.\n        Terminator looks down at John, next to him.  He says quietly...\n\n                                TERMINATOR\n                Uncle Bob?\n\n                                SALCEDA\n                        (to Sarah)\n                So, Sarahlita, you getting famous, you know\n                that?  All over the goddamn TV.\n\n        Salceda rips the cap off the tequila bottle.  The two-year-old toddles\n        to Terminator and grabs his pants, sliming them with drool.\n        Terminator looks down at the tiny kid, fascinated.  What is it?\n        He picks up the child with one huge hand.  Looks at it.  Turns it\n        different ways.  Studying it.  Then sets it down.  The kid waddles\n        off, a little dizzy.\n\n                                SALCEDA\n                Honey, take Pacolito.  Thanks, baby.\n\n        She hands him the tequila and takes the child.  Salceda takes a long\n        pull from the Cuervo bottle.\n\n                                SALCEDA\n                        (to Terminator)\n                Drink?\n\n        Terminator gestures \"no\" at the proffered bottle, but Sarah grabs it\n        and takes a long pull.  She lowers it without expression.  Her eyes\n        don't even water.\n\n                                SARAH\n                I just came for my stuff.  And I need clothes,\n                food, and one of your trucks.\n\n                                SALCEDA\n                        (grinning)\n                Hey, how about the fillings out of my fucking\n                teeth while you're at it?\n\n                                SARAH\n                Now, Enrique.\n                        (turns to Terminator and John)\n                You two are on weapons detail.\n\n                                                CUT TO:\n\nA103    EXT. COMPOUND/BEHIND THE TRAILERS\n\n        There is an aging and rusted Caterpillar sitting behind one of the\n        trailers.  John expertly backs it toward Terminator who is holding\n        one end of a piece of heavy chain which disappears into the sand.\n\n                                JOHN\n                Hook it on.\n\n        Terminator hooks the chain onto the towhook on the back of the\n        tractor.  John hits the throttle and the Cat churns its treads,\n        pulling some massive load.  A six-by-eight foot sheet of steel plate\n        moves slowly under six inches of sand.\n\n        John drags it far enough to reveal... a rectangular hole in the\n        ground.  Like the mouth of a tomb.  The kid drops down from the\n        tractor and walks to the hole.\n\n                                JOHN\n                One thing about my mom... she always plans\n                ahead.\n\nA104    INT. WEAPONS CACHE\n\n        From inside the \"tomb\".  Sunlight slashes down into a cinder-block\n        room, less than six feet wide but over twenty long.  Sand spills down\n        the steps.  The walls are lined with guns.\n\n        John precedes Terminator into Sarah's weapons cache.  Rifles, pistols,\n        rocket launchers, mortars, RPGs, radio gear.  At the far end, boxes\n        containing ammo, grenades, etc. are stacked to the ceiling.\n        Terminator gets real alert.  Scanning, wondering where to begin.  He\n        picks up a MAC-10 machine pistol.  Racks the bolt.\n\n                                TERMINATOR\n                Excellent.\n\n                                JOHN\n                Yeah, I thought you'd like this place.\n\nA105    EXT. COMPOUND/NEARBY\n\n        Sarah emerges from a trailer.  She has changed.  Boots, black fatigue\n        pants, T-shirt.  Shades.  She looks hard.\n        Salceda is nearby, packing food and other survival equipment with\n        Yolanda.  He looks up as Sarah approaches, and slaps the side of a\n        BIG FOUR-BY BRONCO next to him,\n\n                                SALCEDA\n                This is the best truck, but the water pump is\n                blown.  You got the time to change it out?\n\n                                SARAH\n                Yeah.  I'm gonna wait till dark to cross the\n                border.\n                        (she pulls him away from\n                        Yolanda)\n                Enrique, it's dangerous for you here.  You get\n                out tonight, too, okay?\n\n                                SALCEDA\n                Yeah, Saralita.  Sure.\n                        (he grins)\n                Just drop by any time and totally fuck up my\n                life.\n\n        She slaps him on the shoulder.\n\n                                                CUT TO:\n\nA106    INT. WEAPONS CACHE\n\n        Terminator returns from carrying out several cases of ammo.  John is\n        selecting rifles from a long rack.\n\n                                JOHN\n                See, I grew up in places like this, so I just\n                thought it was how people lived... riding\n                around in helicopters.  Learning how to blow\n                shit up.\n\n        John grabs an AK-47 and racks the bolt with a practiced action.\n        Inspects the receiver for wear.  Doesn't like what he sees.  Puts is\n        back.  His movement are efficient.  Professional.  Uninterested.\n\n                                JOHN\n                Then, when Mom got busted I got put in a\n                regular school.  The other kids were, like,\n                into Nintendo.\n\n        Terminator has found a Vietnam-era \"blooper\" M-79 grenade launcher.\n        A very crude but effective weapon.  He opens the breech and inspects\n        the bore.\n\n                                JOHN\n                Are you ever afraid?\n\n        Terminator pauses for a second.  The thought never occurred to him.\n        He searches him mind for the answer...\n\n                                TERMINATOR\n                No.\n\n        Terminator slings the M-79 and starts looking for the grenades.\n\n                                JOHN\n                Not even of dying?\n\n                                TERMINATOR\n                No.\n\n                                JOHN\n                You don't feel any emotion about it one way\n                or the other?\n\n                                TERMINATOR\n                No.  I have to stay functional until my mission\n                is complete.  Then it doesn't matter.\n\n        John is idly spinning a Sig Saur 9mm pistol on his finger... backwards\n        and forwards like Bat Masteron.\n\n                                JOHN\n                Yeah.  I have to stay functional too.\n                        (sing-songy)\n                \"I'm too important\".\n\n        Terminator pulls back a canvas tarp, revealing a squat, heavy weapon\n        with six barrels clustered in a blunt cylinder.  Chain-ammo is fed\n        from a canister sitting next to it.  A G.E. MINI-GUN.  The most\n        fearsome anti-personnel weapon of the Vietnam era.\n        Terminator hefts it.  Looks at John as if to say \"Can I?  Please?\"\n\n                                JOHN\n                It's definitely you.\n\n                                                CUT TO:\n\nA107    EXT. COMPOUND - DAY/LATER\n\n        Sarah and John have their weapons and supply selections laided out on\n        two battered picnic tables for cleaning and packing.  Maps, radios,\n        documents, explosives, detonators... just the basics.  Sarah is field-\n        stripping and cleaning guns, very methodical.  There is no wasted\n        motion.\n\n        Not far away, John and Terminator are working on the Bronco.  They're\n        greasy up to their elbows, lying on their backs under the engine\n        compartment, ratcheting bolts into places on the new water pump.\n\n                                JOHN\n                There was this one guy that was kinda cool.\n                He taught me engines.  Hold this a second.  Mom\n                screwed it up, of course.  Sooner or later she'd\n                always tell them about Judgment Day and me being\n                this world leader and that's be all she wrote.\n\n        John thinks he's being causal, but his longing for some kind of\n        parental connection is obvious.\n\n                                TERMINATOR\n                Torque wrench please.\n\n                                JOHN\n                Here.  I wish I coulda met my real dad.\n\n                                TERMINATOR\n                You will.\n\n                                JOHN\n                Yeah.  I guess so.  My mom says when I'm, like,\n                45, I think, I send him back through time to\n                1984.  But right now he hasn't even been born\n                yet.  Man, is messes with your head.  Where's\n                that other bolt?\n                        (Terminator hands it to him)\n                Thanks.  Mom and him were only together for one\n                night, but she still loves him, I guess.  I see\n                her crying sometimes.  She denies it totally,\n                of course.  Like she says she got something in\n                her eye.\n\n        They crawl out from under the truck into the bright sunlight.\n\n                                TERMINATOR\n                Why do you cry?\n\n                                JOHN\n                You mean people?  I don't know.  We just cry.\n                You know.  When it hurts.\n\n                                TERMINATOR\n                Pain causes it?\n\n                                JOHN\n                Uh-unh, no, it's different... It's when there's\n                nothing wrong with you but you hurt anyway.  You\n                get it?\n\n                                TERMINATOR\n                No.\n\n        Terminator gets into the Bronco and turns the ignition key and the\n        engine catches with a roar.\n\n                                JOHN\n                Alriight!!  My man!\n\n                                TERMINATOR\n                No problemo.\n\n        John grins and does a victorious thumbs up.\n        Terminator imitates the gesture awkwardly.\n        John laughs and makes him get out of the truck, to try the move again.\n\nA108    SARAH, across the compound, pauses in her work to watch John and\n        Terminator.\n\nA109    SARAH'S POV... we don't hear what John and Terminator are saying.  It\n        is a soundless pantomime as John is trying to show some other gestures\n        to the cyborg.  Trying to get him to walk more casually.  John walks,\n        then Terminator tries it, then John gestures wildly, talking very\n        fast... explaining the fundamental principles of cool.  They try it\n        again.  Continued ad lib as we hear:\n\n                                SARAH (V.O.)\n                Watching John with the machine, it was suddenly\n                so clear.  The Terminator would never stop, it\n                would never leave him... it would always be\n                there.  And it would never hurt him, never shout\n                at him or get drunk and hit him, or say it\n                couldn't spend time with him because it was too\n                busy.  And it would die to protect him.  Of all\n                the would-be fathers who came and went over the\n                years, this thing, this machine, was the only\n                one who measured up.  In an insane world, it was\n                the sanest choice.\n\n        Sarah clenches her jaw and goes grimly back to work... a strong woman\n        made hard and cold by years of hard choices.\n\n                                                CUT TO;\n\nA110    EXT. ROAD - DAY\n\n        A police cruiser is parked off the side of a quiet, empty road on the\n        outskirts of Los Angeles.  A ribbon of traffic moves steadily by on a\n        freeway in the distance.  Nothing stirs around the cruiser except some\n        pump-jacks sucking the earth on the hill behind it.\n\nA111    IN THE CRUISER.  The T-1000 sits inside.  John's notes and letters are\n        spread out on the seat beside it.  Sarah's voice speaks from a\n        cassette deck.  John's tapes.  Her voices mixes with the static filled\n        chatter of the radio that T-1000 monitors for any signs of its\n        targets.\n\n                                SARAH\n                ... if we are ever separated, and can't make\n                contact, go to Enrique's airstrip.  I'll\n                rendezvous with you there.\n\n        T-1000 whips around and rewinds the tape, replaying the last section.\n        It then snaps up the envelope of photos we saw earlier.\n\n        ECU on envelope.  We see the postmark:  \"Charon Mesa, Calif.\"\n\n        TIGHT ON T-1000 staring at the postmark on the envelope.  It glances\n        up at the sound of crunching gravel.  In the rear-view it sees a BIKE\n        COP pulling onto the shoulder behind it.  The big KAWASAKI 1100 idles\n        up next to the T-1000, still seated in the cruiser.\n\n                                BIKE COP\n                Howdy.  I saw you pulled over here earlier.\n                Everything okay?\n\n                                T-1000\n                Everything's fine.  Thanks for checking.\n                        (it gets slowly out of\n                        the car)\n                Since you're here, though, can I talk to you\n                a second...\n\n                                                CUT TO:\n\nA112    EXT. HIGHWAY - DAY/MINUTES LATER\n\n        The T-1000 thunders along on the Kawasaki 1100, doing about a hundred\n        and twenty.  PAN WITH IT until it recedes toward the horizon.\n\n                                                CUT TO:\n\nA113    EXT. COMPOUND - DAY (LATE AFTERNOON)\n\n        Sarah sits at the picnic table.  The weapons are cleaned and her work\n        is done.  She hasn't slept in twenty-four hours and she seems to have\n        the weight of the whole world on her shoulder.\n        She draws her knife from its belt sheath.\n        Idly starts to carve something on the table top... the letter \"N\".\n\nA114    NOT FAR AWAY, John and Terminator are packing the Bronco for the trip.\n\nA115    ON SARAH, AT THE TABLE as she looks up from her carving, thinking.\n        She watches Salceda's kids playing nearby... wrestling with a mutty\n        dog and loving it.  Sarah watches Yolanda walking her toddler by her\n        hands.  Backlit, stylized.  She looks over at John.  Loading guns and\n        supplies.\n\nA116    ANGLE ON kids playing.\n\nA117    SARAH'S HEAD droops.  She closes her eyes.\n\nA118    TIGHT ON small children playing.  Different ones.\n        Wider now, to reveal a playground in a park.  Very idyllic.  A dream\n        playground, crowded with laughing children playing on swings, slides,\n        and a jungle gym.  It could be the playground we saw melted and frozen\n        in the post-nuclear desolation of 2029.  But here the grass is vibrant\n        green and the sun is shining.\n\n118A    Sarah, short-haired, looking drab and paramilitary, stands outside the\n        playground.  An outsider.  Her fingers are hooked in a chain-link\n        fence and she is staring through the fence at the young mothers\n        playing with their kids.  A grim-faced harbinger.\n\n118B    Some girls play skip-rope.  Their sing-song weaves through the random\n        burbling laughter of the kids.  One of the young mothers walks her\n        two-year-old son by the hands.  She is wearing a pink waitress\n        uniform.  She turns to us, laughing.\n        It is Sarah.  Beautiful.  Radiant.  Sarah from another life,\n        uncontaminated by the dark future.  She glances at the strange woman\n        beyond the fence.\n\n118C    Grim-faced Sarah presses against the fence.  She starts shouting at\n        them in SLOW MOTION.  No sound comes from her mouth.  She grabs the\n        fence in frustration, shaking it.  Screaming soundlessly.\n        Waitress Sarah's smile falls.  Then returns as her little boy throws\n        some sand at her.  She laughs, turns away, as if the woman at the\n        fence were a shadow, a trick of light.\n\n118D-118F  OMITTED\n\n118G    THE SKY EXPLODES.  The children ignite like match heads.  Sarah is\n        burning, screaming silently, everything silent and overexposed.\n\n118H    THE BLAST WAVE HITS... devouring the cowering mothers and children.\n        Sarah's scream merges with the howl of the wind as the shockwave rips\n        into her, blasting her apart and she...\n\n119     Wakes up.\n        All is quiet and normal.  The children are still playing nearby.  Less\n        than fifteen minutes have gone by.\n\n        Bathed in sweat, Sarah sits hunched over the table.\n        Every muscle is shaking.  She is gasping.\n        Sarah struggles to breathe, running her hand through her hair which is\n        soaked with sweat,  She can escape from the hospital, but she can't\n        escape from the madness which haunts her.\n\n        She looks down at the words she has carved on the table, amid the\n        scrawled hearts and bird-droppings.  They are:  \"NO FATE.\"\n        Something changes in her eyes.  She slams her knife down in the table\n        top, embedding it deeply in the words.  Then gets up suddenly and\n        we --\n\n                                                CUT TO:\n\nA120    LONG LENS on Sarah walking toward us, striding across the compound\n        with grim purpose.  She carries a small nylon pack and a CAR-15\n        assault rifle.  Her face is an impassive mask.  She has become a\n        terminator.\n\nA120A   JOHN LOOKS UP from his work in time to see Sarah throw the rifle\n        behind the seat of their stolen pickup, jump in and start it.  She\n        slams it in gear.  Salceda walks up to John.\n\n                                SALCEDA\n                She said you go south with him...\n                        (he points at Terminator)\n                ... tonight, like you planned.  She will meet\n                you tomorrow in...\n\n        But John is moving, running after her.\n\n                                JOHN\n                Mommm!! Wait!!\n\nA120B   MOVING WITH SARAH as she leaves the compound.  We see John running\n        after her... yelling.  Can't hear his words.  She looks in the rear-\n        view mirror but doesn't slow down.\n\n                                                CUT TO:\n\nA121    EXT. COMPOUND - DUSK/MINUTES LATER\n\n        John and Terminator ponders the message carved into the top of the\n        picnic table.  Sarah's knife is still embedded there.\n\n                                JOHN\n                \"No fate.\"  No fate but what we make.  My father\n                told her this... I mean I made him memorize it,\n                up in the future, as a message to her --\n                Never mind.  Okay, the whole thing goes \"The\n                future is not set.  There is no fate but what\n                we make for ourselves.\"\n\n                                TERMINATOR\n                She intends to change the future somehow.\n\n                                JOHN\n                I guess, yeah --\n                        (snaps his fingers as it hit him)\n                Oh shit!!\n\n                                TERMINATOR\n                Dyson.\n\n                                JOHN\n                Yeah, gotta be!  Miles Dyson!  She's gonna blow\n                him away!\n\n        John motions to Terminator and breaks into a run.\n\n                                JOHN\n                Come on.  Let's go.  LET'S GO!!\n\n                                                CUT TO:\n\nA122    INT./EXT. SARAH'S JEEP - DUSK\n\n        Sarah speeds through the darkening desert.  Expressionless.  In her\n        dark glasses, she looks as pitiless as an insect.\n\n                                                DISSOLVE TO:\n\nA123    EXT. HIGHWAY - NIGHT\n\n        TRACKING WITH THE BRONCO, Terminator and John heading toward L.A.\n\n                                TERMINATOR\n                This is tactically dangerous.\n\n                                JOHN\n                Drive faster.\n\n                                TERMINATOR\n                The T-1000 has the same files that I do.  It\n                could anticipate this move and reacquire you\n                at Dyson's house.\n\n                                JOHN\n                I don't care.  We've gotta stop her.\n\n                                TERMINATOR\n                Killing Dyson might actually prevent the war.\n\n                                JOHN\n                I don't care!! There's gotta be another way.\n                Haven't you learned anything?!  Haven't you\n                figured out why you can't kill people?\n\n        Terminator is still stumped.\n\n                                JOHN\n                Look, maybe you don't care if you live or die.\n                But everybody's not like that!  Okay?!  We have\n                feelings.  We hurt.  We're afraid.  You gotta\n                learn this stuff, man, I'm not kidding.  It's\n                important.\n\n        PANNING as they pass, revealing the lights of the city ahead.\n\n                                                CUT TO:\n\nA124    EXT, DYSON'S HOUSE - NIGHT\n\n        The house is high-tech and luxurious.  Lots of glass.  Dyson's study\n        is lit bluish with the glow of his computer monitors.  He is at the\n        terminal, working.  Where else?  We see him clearly in a long shot\n        from an embankment behind the house.\n\n        A DARK FIGURE moves into the foreground.  Rack focus to Sarah as she\n        turns into profile.  She raises the CAR-15 rifle and begins screwing\n        the long heavy cylinder of a sound-suppresser onto the end of the\n        barrel.\n\n                                                CUT TO:\n\nA125-A125K  OMITTED\n\n129     OMITTED\n\n129A    INT. DYSON HOUSE\n\n        Dyson's kids, Danny and Blythe, are playing in the halls with a radio-\n        controlled off-road truck.  Danny drives and Blythe scampers after it,\n        trying to catch it.  They stop in the hall outside Dyson's study and\n        sees him working at his terminal.  Danny puts a finger to his lips,\n        shushing Blythe.  His expression is mischievous.\n\n129B    With the silencer in place, Sarah eases back the bolt and then slips\n        it forward, chambering a .223 round.  Then she lies down on the\n        embankment.\n        He cheek pressed against the cool rifle-stock, she slides one hand\n        slowly forward to brace the weapon, taking the weight on her elbow.\n        Her other hand slips knowingly to the trigger.\n\n        Her expression is cold, impassive.  She looks through the scope at the\n        man in the house.  She feels nothing as she raises the rifle.\n\n130     OMITTED\n\n130A    INT. DYSON'S HOUSE\n\n        DYSON, in deep thought.  The rhythmic sounds of keys as he works.\n        Symbols on the screen shift.\n\n        ON HIS BACK we see the glowing red dot appear.  It is the target dot\n        of Sarah's laser designator.  It moves silently up his back toward\n        his head.\n\n131     EXT. DYSON HOUSE/EMBANKMENT\n\n        IN EXTREME CLOSEUP we see Sarah's eye at the night-scope.\n        TIGHT INSERT on her finger as it tightens on the trigger, taking out\n        the slack.  She takes a deep breath and holds it.  Adjusts her\n        position minutely.\n\n132     INT. DYSON HOUSE\n\n        The laser dot jiggles on the back of Dyson's neck and then rises,\n        centering on the back of his skull.\n\n132A    LOW ANGLE as Danny's Bigfoot truck roars toward us -- FILLING FRAME.\n        Thump.  It hits Dyson's foot.  He jerks, startled, and looks down\n        as --\n        POP!!\n132B    His monitor screen is BLOWN OUT spraying his with glass.  He jerks\n        back, utterly shocked... and spins to see the huge hole blown through\n        the window behind him.  This saves him as K-THUMP! -- the second shot\n        blows the top of his high-backed chain into an explosion of stuffing\n        an inch from his head.\n        Instinctively he dives to the carpet as --\n\n        BLAM BLAM BLAM -- rounds blast through the window, tearing into his\n        desk and computer, blowing his keyboard into shrapnel.\n132C    With the monitor screen blown out, the room is in darkness.  Sarah\n        can't see Dyson now, down behind his desk.  She puts round after round\n        into the heavy desk, blasting one side of it into kindling.\n\n132D    Dyson, scared out of his mind, has his face jammed against the carpet,\n        terrified to move.  He sees his kids in the hall.\n\n                                DYSON\n                Run, kids!  Go!  Run!\n\n132E    IN THE HALL, TARISSA rounds the corner at a dead run.  She sees the\n        kids running toward her and grabs them in her arms.  Down the hall,\n        in the dark study, she sees Dyson on the floor amid the splinters and\n        shrapnel of the continuing fusillade.\n\n                                TARISSA\n                Miles!  Oh my God!!\n\n                                MILES\n                Stay back!!\n\n132F    ON THE FLOOR, Dyson flinches as chucks of wood and shattered computer\n        components shower down on him.  He looks desperately toward the door,\n        but knows he'd be totally exposed.  He'd never make it.\n\n133     SARAH's rifle empties with a final CLACK!\n        She throws it down and draws her .45 smoothly from a shoulder base.\n        She starts toward the house, snapping back the slide on the pistol,\n        chambering a round.  She is in a fast, purposeful walk, keeping her\n        eyes fixed on the target.  She is utterly determined to kill this man.\n\n134     FROM UNDER THE DESK Dyson can see a sliver in the backyard.  He sees\n        Sarah's feet as she strides toward him.  He tenses to make a break for\n        the door.\n\n        Sarah raises the pistol, eyes riveted ahead, controlling her\n        breathing.  Dyson springs up in a full-tilt sprint.  She tracks him.\n        He hooks a foot on the cord of a toppled disk drive.\n        BOOM!  Her shot blows apart a lamp where his head was.\n        He hits the floor hard, but keeps moving, scrambling forward.\n\n        Crunch of glass behind his as Sarah's dark form is framed in the\n        blown-out floor-to-ceiling window.  Dyson leaps toward the hall.\n        BOOM!  Her second shot spins him.  He hits the floor in the hallway.\n        Tarissa is screaming.  Dyson struggles forward, stunned.  There is a\n        .45-caliber hole clean through his left shoulder.  He smears the wall\n        with blood as he staggers up.  Looking back, he sees the implacable\n        figure behind him, coming on.\n\n        He topples through a doorway as --\n        BOOM!  BOOM!  Shots blowing away the molding where he just was.\n\n135     EXT. DYSON HOUSE/STREET\n\n        Terminator and John leap from the jeep, sprinting toward the house.\n        The shots sound muffles from outside.\n\n                                JOHN\n                Shit, we're too late!\n\n136     INT. HOUSE\n\n        Advancing with Sarah we enter the living area.  Tarissa has Blythe and\n        she's screaming at Danny, who has run back to his collapsed father.\n\n                                TARISSA\n                Danny!  DANNY!\n\n                                DANNY\n                Daaaaddddeeee!\n\n        Danny is pulling at Dyson, crying and screaming, as his father tries\n        to stagger forward.  Tarissa drops Blythe and runs back for Dyson,\n        grabbing him.  Sarah looms behind them with the pistol aimed.\n\n                                SARAH\n                Don't fucking move!  Don't FUCKING MOVE!!\n                        (she swings the gun on\n                        Tarissa)\n                Get on the floor, bitch!  Now!!  Fucking down!\n                NOW!!\n\n        Sarah is crazy-eyed now, shaking with the intensity of the moment.\n        The kill has gone bad, with screaming kids and the wife involved...\n        things she never figured on.  Tarissa drops to the knees, terrified\n        as she looks into the muzzle of the gun.  Blythe runs to Dyson and\n        hugs him, wailing.\n\n                                BLYTHE\n                Don't hurt my father!\n\n                                SARAH\n                        (screaming)\n                Shut up, kid!  Get out of the way!!\n\n        Dyson looks up, through his pain and incomprehension.  Why is this\n        nightmare happening?  The black gun muzzle is a foot from his face.\n\n                                DYSON\n                        (gasping)\n                Please... let... the kids... go...\n\n                                SARAH\n                Shut up!  SHUT UP!!  Motherfucker!  It's all\n                your fault!  IT'S YOUR FAULT!!\n\n        We see her psyching herself to pull the trigger... needing now to hate\n        this man she doesn't know.  It's a lot harder face-to-face.  She is\n        bathed in sweat, and it runs into her eyes.  Blinking, she wipes it\n        fast with one hand, then gets it back on the gun.  The .45 is\n        trembling.\n\n        TIGHT ON SARAH as we see the forces at war behind her eyes.\n        She looks into the faces of Dyson, Tarissa, Blythe, Danny.\n        Sarah takes a sharp breath and all the muscles in her arms contract\n        as she tenses to fire.\n        But her finger won't do it.\n        She lowers the gun very slowly.  It drops to her side in one hand.\n\n        All the breath and energy seems to go out of her.\n        She weakly raises her other hand in a strange gesture, like \"Stay\n        where you are, don't move\".  As if, should they move, the fragile\n        balance might tip back the other way.\n        She backs away from them slowly, panting.  It's as if she's backing\n        away in terror from what she almost did.  She reaches a wall and\n        slumps against it.  Slides down to her knees.  The gun falls limply\n        from her fingers.\n        She rests her cheek against the wall.\n\n136A    The front door is kicked in.\n        Terminator steps inside.  John grabs his sleeve and pushes past him.\n        He scopes out the situation in two seconds... Sarah, the gun, the\n        sobbing family.  John moves to Sarah while Terminator checks Dyson.\n\n        John kneels in front of his mother.  She raises her head to look at\n        him.  He sees the tears spilling down her cheeks,\n\n                                JOHN\n                Mom?  You okay?\n\n                                SARAH\n                I couldn't... oh, God.\n                        (she seems to she him for\n                        the first time)\n                You... came here... to stop me?\n\n                                JOHN\n                Uh huh.\n\n        She reaches out and takes his shoulder suddenly, surprising him...\n        drawing him to her.  She hugs him and a great sob wells up deep inside\n        her, from a spring she had thought long dry.  She hugs him fiercely\n        as the sobs wrack her.\n\n        John clutches her shoulders.  It is all he ever wanted.\n\n                                JOHN\n                It's okay.  It'll by okay.  We'll figure it\n                out.\n\n                                SARAH\n                I love you, John.  I always have.\n\n                                JOHN\n                I know, Mom.  I know.\n\n        TARISSA looks around at the bizarre tableau.  Terminator has\n        wordlessly ripped open Dyson's shirt and examined the wound.\n\n                                TERMINATOR\n                Clean penetration.  No shattered bone.\n                Compression should control the loss of blood.\n\n        He takes Tarissa's hands and presses them firmly over the entrance and\n        exit wounds.\n\n                                TERMINATOR\n                Do you have bandages?\n\n                                DYSON\n                In the bathroom.  Danny, can you get them for\n                us?\n\n        Danny nods and runs down the hall.\n        John disengages from Sarah.  She wipes her tears, the instinct to\n        toughen up taking over again.  But the healing moment has had its\n        effect, nevertheless.\n\n        John walks toward Dyson and Terminator.\n\n                                DYSON\n                Who are you people?\n\n\n        John draws the Biker's knife from Terminator's boot.  Hands it to him.\n\n\n                                JOHN\n                Show him.\n\n        Terminator takes off his jacket to reveal bare arms.\n        John takes Blythe by the hands and leads her down the hall, away\n        from what is about to happen.\n\n136B    TIGHT ON TERMINATOR'S left forearm as the knife makes a deep cut just\n        below the elbow.  In one smooth motion, Terminator cuts all the way\n        around his arm.  With a second cut, he splits the skin of the forearm\n        from elbow to wrist.\n\n        TERMINATOR grasps the skin and strips is off his forearm like a\n        surgeon rips off a rubber glove.  It comes off with a sucking rip,\n        leaving a bloody skeleton.\n\n        But the skeleton is made of bright metal, and is laced with hydraulic\n        actuators.  The fingers are as finely crafted as watch parts... they\n        flex into a fist and extend.  Terminator holds it up, palm out, in\n        almost the exact position of the one in the vault at Cyberdyne,\n\n        HOLD ON DYSON reacting to the servo-hand in front of him.\n        He's seen one of these before.\n        Tarissa is screaming now, but he doesn't hear her.\n\n                                DYSON\n                My God.\n\n                                TERMINATOR\n                Now listen to me very carefully.\n\n137     INT. HOUSE/KITCHEN - LATER\n\n        Sarah puts out her fifth cigarette.  She's sitting on the counter.\n        John, Terminator, Dyson, and Tarissa are at the kitchen table, under\n        a single overhead light.\n\n        Dyson looks like that guy on the Sistine Chapel wall, the damned\n        soul... eyes fixed and staring with terrifying knowledge.  His\n        shoulder is bandaged.  Terminator's arm is wrapped with a blood-soaked\n        bandage below the elbow.  The steel forearm and hand gleam in the\n        harsh kitchen light.  TRACKING AROUND THE TABLE as Terminator\n        speaks... we don't hear the words.\n\n                                SARAH (V.O.)\n                Dyson listened while the Terminator laid it all\n                down.  Skynet.  Judgment Day... the history of\n                things to come.  It's not every day you find\n                out you're responsible for 3 billion deaths.\n                He took it pretty well, considering...\n\n        Terminator finishes speaking.\n\n                                DYSON\n                I feel like I'M gonna throw up.\n\n        He looks around at them, clutching the table like he's about to blow\n        away.  His face, his posture, his ragged voice express soul-wrenching\n        terror.  This is a man ripped out of normal life into their grim\n        world.  His voice is pleading.\n\n                                DYSON\n                You're judging me on thing's I haven't even\n                done yet.  Jesus.  How were we supposed to know?\n\n        Sarah speaks from the shadows behind them.  Dyson turns to find her\n        looking right at him.\n\n                                SARAH\n                Yeah.  Right.  How were you supposed to know?\n                Fucking men... all you know how to do is thrust\n                into the world with your... fucking ideas and\n                your weapons.  Did you know that every gun in\n                the world is named after a man?  Colt, Browning,\n                Smith, Thompson, Kalashnikov... all men.  Men\n                built the hydrogen bomb, not women... men like\n                you thought it up.  You're so creative.  You\n                don't know what it's like to really create\n                something... to create a life.  To feel it growing\n                inside you.  All you know how to create is\n                death... you fucking bastards.\n\n                                JOHN\n                Mom, Mom, we need to be more constructive here.\n                I don't see this as a gender-related issue.\n                        (to the Dysons)\n                She's still tense.\n                        (to Sarah)\n                We still have to figure out how to stop it all\n                from happening.  Right?\n\n                                TARISSA\n                But I thought... aren't we changing things?  I\n                mean... right now?  Changing the way it goes?\n\n                                DYSON\n                        (seizing on that)\n                That's right!  There's no way I'm going to\n                finish the new processor now.  Forget it.  I'm\n                out of it.  I'm quitting Cyberdyne tomorrow...\n                I'll sell real estate, I don't care,,,\n\n                                SARAH\n                        (coldly)\n                That's not good enough.\n\n        Dyson's voice is pitiful.\n\n                                DYSON\n                Look, whatever you want me to do, I'll do.  I\n                just want my kids to have a chance to grow up,\n                okay?\n\n                                TERMINATOR\n                No one must follow your work.\n\n                                DYSON\n                        (thoughts racing)\n                Alright, yeah.  You're right.  We have to\n                destroy the stuff at the lab, the files, disk\n                drive... and everything I have here.  Everything!\n                I don't care.\n\n                                                CUT TO:\n\n138     FIRE ROARING IN A METAL TRASH BARREL.\n        Stacks of files are dumped onto it.\n        WIDER reveals we are in --\n\n138A    EXT, DYSON'S BACKYARD - NIGHT\n\n        Terminator dumps lighter fluid liberally over the fire, which flares\n        up, lighting his face demonically.  Sarah, Dyson, Tarissa, and John\n        return from his office with more stuff -- files, notes, optical disks.\n        Even his kids are carrying stuff.  It all goes into the fire.  Dyson\n        drops the prototype onto the fire... his eyes hollow and distant.\n\n        He stares into the fire, watching his world burning.  The has a\n        sudden thought.\n\n                                DYSON\n                Do you know about the chip?\n\n                                SARAH\n                What chip?\n\n                                DYSON\n                They have it in a vault at Cyberdyne...\n                        (to Terminator)\n                It's gotta be from the other one like you.\n\n                                TERMINATOR\n                        (to Sarah)\n                The CPU from the first terminator.\n\n                                SARAH\n                Son of a bitch, I knew it!\n\n                                DYSON\n                They told us not to ask where they got it.  I\n                thought... Japan... hell, I don't know.  I\n                didn't want to know.\n\n                                SARAH\n                Those lying motherfuckers!\n\n                                DYSON\n                I was scary stuff, radically advanced.  It was\n                shattered... didn't work.  But it gave us ideas,\n                It took us in new directions... things we would\n                never have thought of.  All this work is based\n                on it.\n\n                                TERMINATOR\n                I must be destroyed.\n\n                                SARAH\n                        (to Dyson)\n                Can you get us in there, past security?\n\n                                DYSON\n                I think so, yeah.  When?\n\n        Dyson looks at her, Terminator, then John.  Sees his answer.\n\n                                DYSON\n                Now?\n                        (he takes a breath)\n                Yeah, right.\n\n        He turns to his wife.  Her face is streaked with tears, but her eyes\n        are strong and clear.  Tarissa puts her hands on his arm.  She is\n        stunned by what she's heard, but dealing with it.  She believe them.\n\n                                TARISSA\n                Miles, I'm scared.  Okay.  But the only thing\n                that scares me more than you going... is you\n                not going.\n\n        He nods.  She's right.\n\n                                SARAH\n                        (to Terminator)\n                Is it safe for them here?\n\n                                TERMINATOR\n                        (to Tarissa)\n                Take your kids.  Go to a hotel.  Right now.\n                Don't pack.\n                        (to the others)\n                Let's go.\n\n                                                CUT TO:\n\n138B    EXT, HIGHWAY - NIGHT\n\n        Pavement rushing at us, lit by headlights.  Beyond, darkness.\n\n                                SARAH (V.O.)\n                The future, always so clear to me, has become\n                like a black highway at night.  We were in\n                uncharted territory now... making up history\n                as we went along.\n\n        TILT UP to reveal a rectangle of light ahead.  The Cyberdyne\n        Building...\n\n139     INT. CYBERDYNE SYSTEMS BUILDING/LOBBY - NIGHT\n\n        TIGHT ON A CARD-KEY SCANNER as Dyson's hand zips his security card\n        through a slot in one motion.  There is the sound of a servo-lock,\n        and --\n\n139A    DYSON enter the spacious lobby, followed by Sarah, John, and\n        Terminator last of all.  In a frontal angle, the others block\n        Terminator from view.\n\n        THE GUARD at the front desk, GIBBONS, looks up as Dyson moves toward\n        him.  Dyson is pale and sweaty, but smiles warmly at the guard,\n        speaking well before he reaches the desk.\n\n                                DYSON\n                Evening, Paul.  These are friends of mine from\n                out of town, I just thought I'd take them up\n                and show them around.\n\n                                GIBBONS\n                I'm sorry, Mr. Dyson.  You know the rules about\n                visitors in the lab.  I need written authoriz --\n\n        K-CHAK!  Gibbons is staring down the barrels of Sarah's .45 and\n        Terminator's MAC-10.\n\n                                TERMINATOR\n                I insist.\n\n        The guard is too stunned to move.  We see that Terminator is wearing\n        his jacket and one black glove.\n        Gibbon's eyes go to the silent alarm button on the console.\n\n                                SARAH\n                Don't even think about it.\n\n        Gibbons nods.  He stays frozen.  Terminator circles quickly and gets\n        the guard out of the chair.  John pulls a roll of duct-tape from his\n        knapsack and tears off a piece.\n\n140     INT. SECOND FLOOR CORRIDOR\n\n        ELEVATOR DOORS OPEN and Terminator leads the group warily into the\n        corridor.  They have a cart piled high with gear in nylon bags.\n        Dyson motions down the corridor to the right.  As they walk, he\n        continues to fill them in --\n\n                                DYSON\n                The vault needs two keys to open.  Mine...\n                        (holds up key)\n                ... and one from the security station.  It's in\n                a locker but my card should access it.  Here\n                we go.\n\n        They stand in front of a wide security door.  A sign above reads\n        SPECIAL PROJECTS DIVISION:  AUTHORIZED PERSONNEL ONLY.  Dyson zips\n        his key-card through the scanner and the door unlatches.\n\n141     OMITTED\n\n142     INT. FIRST FLOOR CORRIDOR/LOBBY\n\n        A ROVING GUARD, MOSHIER, strolls down the long corridor from the\n        first-floor office block.  A punch clock swings at his hip, and he's\n        just completed his circuit of the building.  He passes the back of\n        elevators and rounds the corner to the front desk, calling out --\n\n                                MOSHIER\n                Honey, I'm home...\n\n        He sees the desk is deserted and frowns.  Figures Gibbons must be in\n        the can, so checks that first before getting alarmed.\n        TRACKING WITH HIM to the restroom around the corner,\n\n                                MOSHIER\n                Hey, man, you shouldn't leave the --\n\n142A    OVER HIS SHOULDER we see past the door as he pushes it open, revealing\n        Gibbons handcuffed to the urinal.  Moshier spins on a dime and sprints\n        to the desk where he slams down on the silent alarm button.\n\n153     INT. SECURITY STATION\n\n        The security station is a pass-through area with a counter, behind\n        which are desks and a bank of monitors, showing boring movies about\n        empty corridors.  Dyson crosses quickly to a locker behind the\n        monitor area.  He swished his card repeatedly through the scanner on\n        the locker.  Nothing happens.  The light on the locker is blinking\n        red.  Sarah notices Dyson's alarmed expression.\n\n                                DYSON\n                What?  WHAT IS IT?\n\n        Dyson whips around, staring at a light flashing on the console behind\n        him.\n\n                                DYSON\n                Silent alarm's been tripped.  It neutralizes\n                the codes throughout the building.  Nothing'll\n                open now.\n\n        We see his nerve snapping.\n\n                                DYSON\n                We should abort.\n\n                                SARAH\n                NO!! We're going all the way!  You got that,\n                Dyson?\n\n        She's right in his face.  Somehow, it works for him.  He nods, getting\n        some resolve from somewhere.\n\n144     INT. LOBBY\n\n        Moshier's gotten Gibbons loose.  He's on the phone to the cops.\n\n                                GIBBONS\n                ... multiple armed subjects.  Look, I think\n                it's the guy from that mall shootout, and the\n                woman... yeah, her.  Pretty sure.  Just send\n                everything you've got in the area --\n\n145     INT. SECURITY STATION./LAB\n\n        John jumps up on the desk next to the wall-mounted locker.  Dyson\n        stares in amazement as John starts pulling his counter-electronics\n        gear out of his knapsack.  It's just another Ready-Teller to him.\n\n                                JOHN\n                You guys get started on the lab... I can open\n                this.\n\n145A    Dyson leads Terminator and Sarah to the main lab doors.  Another\n        servo-lock.\n        He tries his card.  Nothing.\n\n                                DYSON\n                No good.\n\n                                TERMINATOR\n                Let me try mine.\n\n        He unslings the M-79, pulling it over his shoulder in one motion.\n        Sarah grabs Dyson and drags him back down the hall.\n        Terminator opens the breach and slide in one of the fat 40mm H.E.\n        grenades.  He flips the thing closed with a snap of the wrist.\n\n                                SARAH\n                        (yelling as she runs)\n                John!  Fire-in-the-hole!\n\n        John drops what he is doing, and covers his ears.\n        Terminator fires at inhumanely close range.\n145B    The door EXPLODES into kindling.  The concussion blow his jacket\n        open, and flying shrapnel whizzes all around him.  Before the\n        thunderclap has faded Terminator walks into the fire and smoke.\n        John goes back to work without missing a beat.\n        Sarah and a stunned Dyson walk through the burning doorframe into the\n        Artificial Intelligence Lab.\n\n        A SIREN is sounding.  The HALON FIRE-CONTROL SYSTEM has been\n        triggered.  The invisible gas roars in, putting out the flames.\n\n                                DYSON\n                Fire's set off the halo system!  Here...\n                hurry!\n\n        Dyson runs to a wall cabinet and pulls out some BREATHING MASKS.  He\n        hands one to Sarah and dons the other.  Then he reaches out to hand\n        one to Terminator.\n\n                                DYSON\n                Here!\n\n        Terminator doesn't need a mask, since is oxygen requirements are so\n        low.  He ignores Dyson as he removes his massive backpack and opens\n        it.  Dyson shrugs and tosses the mask on a desk.  He turns to Sarah.\n\n                                DYSON\n                        (yelling through the mask)\n                We'll have to keep these on a couple minutes,\n                till the gas clears.\n\n        Terminator pulls two five-gallon jerry-cans of gasoline from his\n        pack.\n        Sarah starts pulling out book-sized, olive-grab CLAYMORE MINES,\n        stacking them next to the gasoline.  Dyson stares.  Part of him can't\n        believe they're really doing this.\n\n                                                CUT TO:\n\n146     INT. DYSON HOUSE - NIGHT\n\n        The T-1000 moves slowly though the ravaged office, analyzing what has\n        happened here.  It walks down the dark hallway.  The place is\n        deserted.  The police-walkie clipped on its belt (real, not simulated)\n        blares to life.\n\n                                DISPATCHER (V.O.)\n                All units, all units.  211 in progress at 2144\n                Kramer Street, the Cyberdyne building.  Multiple\n                suspects, armed with automatic weapons and\n                explosives.  SWAT unit is en route...\n\n147     EXT. HOUSE/STREET\n\n        The T-1000 sprints up and throws its leg over the big C.H.P. Kawasaki.\n        Fires it up.  It smokes an arcing scorch-mark on the pavement as it\n        spins around and roars away.\n\n                                                CUT TO:\n\n148     INT. CYBERDYNE BUILDING/LAB\n\n        TIGHT ON A LARGE DISK DRIVE.  State-of-the-art.  Very expensive.  A\n        FIRE AXE smashes down through the housing, shattering the disk.\n\n148A    WIDER, revealing a scene of high-tech pillage.  Terminator beats the\n        disk drive into junk and steps to another.  WHAM.  Same routine.  He's\n        already demolished half a dozen.\n        Sarah topples a file cabinet, scattering files.\n        Dyson staggers up with an armload of heavy M-O (magnetic-optical)\n        disks and drops them on a growing stack in the middle of the floor.\n        He and Sarah have their breathing masks hanging down around their\n        necks, since the halon gas has dissipated.\n\n                                DYSON\n                        (to Sarah, panting)\n                Yeah, all that stuff!  And all the disks in\n                those offices.  Especially my office...\n                everything in my office!\n                        (to Terminator)\n                These, too!  This is important.\n                        (SMASH!)\n                And all this here... that's it.\n\n148B    Sarah goes into Dyson's office and starts hurling everything out the\n        door onto the central junkpile... books, files, everything on the\n        desk.\n        A FRAMED PHOTO of Dyson's wife and kids lands on top of the heap.\n        Tarissa, hugging Danny and Blythe, all grinning.  The glass is\n        shattered.\n\n148C    Terminator cuts a swath, under Dyson's direction, exploding equipment\n        into fragments with his inhuman swings.\n        SMASH!  It's carnage.  Millions in hardware, and all irreplaceable\n        fruits of their years of research... shattered, broken, dumped in a\n        heap for the big bonfire of destiny.\n        Dyson stops a second, panting.\n\n                                DYSON\n                Give me that thing a second.\n\n        Terminator hands him the axe.  Dyson hefts it one-handed.  He turns to\n        a lab table... on it is another prototype processor.\n\n                                DYSON\n                I've worked for years on this thing.\n\n        Swinging awkwardly but with great force he smashes the axe down onto\n        the processor prototype, exploding it into fragments.  His shoulder is\n        agony, but he looks satisfied.\n\n149     INT. SECOND FLOOR SECURITY STATION\n\n        John taps away at his little lap-top, which is running code\n        combinations into the card-key lock.  Suddenly, the green light on \n        the lock goes on and it unlocks with a clunk.\n\n                                JOHN\n                Easy money.\n\n        He whips it open, revealing a rack of keys.  But the VAULT-KEY is\n        distinctive, a long steel rectangle on a neck-chain.  John grabs it\n        and runs toward the lab.\n\n150     INT. LAB\n\n        Sarah and Terminator are working like a crack team, rigging the\n        explosives.  She is taping the claymores to the gas cans with duct\n        tape to create powerful incendiary bombs.  Terminator is attaching\n        claymores and blocks of C-4 plastic explosive to the large MAINFRAME\n        COMPUTER cabinets nearby.  All the claymores are wired back to one\n        detonator with has a RADIO-CONTROL RELAY switch.\n\n                                DYSON\n                How do you set them off?\n\n        Terminator shows him a REMOTE DETONATOR, a small transmitter with a\n        red plunger.\n\n                                TERMINATOR\n                Radio remote.\n\n        He makes a plunger-pushing motion with his thumb and an accompanying\n        \"click\" sound.  Dyson nods.\n        Just then John comes running in, holding up the key.\n\n                                JOHN\n                I got it.  Piece of cake.\n\n                                SARAH\n                        (to Dyson and Terminator)\n                Go!  I'll finish here.\n\n        They run out as the SOUND OF SIRENS grow louder outside.\n\n                                TERMINATOR\n                I'll deal with the police.\n\n                                JOHN\n                Remember what I said, you can't...\n\n                                TERMINATOR\n                Trust me.\n\n151     EXT. CYBERDYNE BUILDING\n\n        The security duo of Moshier and Gibbons cowers behind cars in the\n        parking lot in front of the building.  They turns as L.A.P.D. BLACK-\n        AND-WHITES pour into the lot, turn the area into a disco of whirling\n        blue and red lights.\n\n152     OMITTED\n\n153     EXT. CYBERDYNE BUILDING\n\n        The cops are jumping from their cars and ducking behind them.\n        Emphasis on small arms here.  Behind them an ugly BLACK SWAT VAN\n        screeches into the lot.\n\n153A    We hear the THUMP OF ROTORS as a POLICE CHOPPER arrives and swings in\n        close to the building.  It rakes its XENON SPOTLIGHT through the\n        second floor offices.\n\n154     INT./EXT. SECOND FLOOR OFFICE\n\n        Terminator crosses the office toward the floor-to-ceiling windows.\n        He is outlines starkly by the spotlight as it rakes through the dark\n        offices.  Without breaking stride he kicks an executive desk toward\n        the window.\n154A    Glass explodes outward and the desk topples, falling to the sidewalk\n        below.\n\n154B    Terminator, standing at the edge, FIRES A LONG BURST with strafes the\n        police cars lines up below.  Cops duck as glass flies.  Terminator,\n        with his superb aim, hits no one.  But noticed is served.\n\n154C    The cops (surprise) FIRE BACK.  Terminator turns and is walking\n        calmly from the window as glass, office furniture, drapes etc. are\n        riddled by return fire.  A few rounds hit his back, but he doesn't\n        notice.  He reloads as he walks.\n\n155     INT. VAULT ANTECHAMBER\n\n        TIGHT ON A KEY inserted into one of the vault locks.\n\n        WIDER as John and Dyson stand poised, hands on keys.\n\n                                JOHN\n                And let's see what's behind door number one.\n\n        Dyson nods and they turns the keys together.  The vault grumbles to\n        itself, withdrawing it locking bolts with a final KLONK!\n        Together Dyson and John swing the door open.\n\n156     EXT./INT. LOBBY\n\n        The varsity takes the field as the SWAT TROOPERS sprint forward by\n        squads.  They flank the lobby and work their way inside, deploying\n        rapidly.  They move and freeze, behind cover, quivering with\n        adrenaline.  They have all that great SWAT equipment:  body armor,\n        gas-masks, M-16s, tear-gas launchers, ropes.  The works.  They make\n        a lot of hand signals and keep their mouths shut.  They're well-\n        trained and deadly.\n\n157     OUTSIDE we see cops firing TEAR GAS grenades through the broken\n        windows into second-floor offices.\n\n158     INT. VAULT\n\n        John and Dyson are isolated from the world in this silent steel womb.\n        Dyson opens the cabinet containing the terminator relics.  It's John\n        turn to stare with uneasy deja-vu as he sees the terminator hand and\n        CPU.\n\n        Then in one vicious move he sweeps his arm behind the inert-gas flasks\n        and hurls them to the floor.  They SHATTER.  John snatches the CPU\n        and the metal hand out of the broken glass.\n\n                                JOHN\n                Got ol' Skynet by the ball now, Miles.  Come\n                on, let's book!\n\n        Clutching the steel hand and pocketing the chip like it's a Mars bar\n        he just bought, John runs out.  Dyson follows.\n\n159     INT. FIRST FLOOR CORRIDOR/STAIRWELL\n\n        We see the advance squad of SWATs make it to one of the stairwells.\n        They start up, two at a time, covering each other ritualistically by\n        the numbers.\n\n160     INT. LAB/HALL\n\n        John pelts into the lab with Dyson stumbling along behind him.\n        Sarah is just finished wiring all the charges to the central\n        detonator.\n\n                                JOHN\n                Ready to rock?\n\n                                SARAH\n                Ready.\n\n        John tosses her the metal hand.  She catches it and bends to put the\n        hand in her empty back-pack.  Sarah zips the pack and starts to shuck\n        into it.\n\n        Dyson's running out of steam.  The bandages at his shoulder are soaked\n        with seeping blood.  He stands in the middle of the lab, saying\n        goodbye in his mind, looking weak and empty.\n        Terminator strides into the lab.\n\n                                TERMINATOR\n                Time to go.  Right now.\n\n        He and John head back the way they came, through security.\n        Sarah sees that in her work, she has set the detonator down twenty\n        feet away, near where Dyson is standing.\n\n                                SARAH\n                Dyson, hand me the detonator.  Let's go --\n\n        He gingerly picks up the detonator.  Starts toward her.  Then --\n160A    CRASH!!  THE DOORS AT THE BACK END OF THE LAB ARE KICKED OPEN.\n        SWAT LEADER  and two others OPEN FIRE.\n        Their M-16s rake the room.  Sarah dives behind a computer cabinet.\n        Dyson is HIT.  He is slammed to the floor by the impacts.\n\n161     IN THE HALL, John hears the firing and spins to run back.\n\n                                JOHN\n                Mommm!!!\n\n        Terminator grabs him as bullets slam into his broad back.  He makes\n        it around the corner with John, out of the line of fire.\n\n162     IN THE LAB, bullets rake over Sarah's head, smacking all around her,\n        clanging into the machine protecting her.  She can see Dyson, slumped\n        on the floor.  Debris and flying glass rain on her as the SWATs pour\n        on the fire.  The detonator is clutched in his hand.  He rolls to face\n        her, his eyes bulging from the pain of his torn-up guts.\n\n                                DYSON\n                Go.\n\n162A    Sarah hesitates a split second.  Then she snap-rolls and fast-crawls\n        through broken glass and debris into the hall where --\n\n        TERMINATOR grabs her by the jacket and hauls her roughly to her feet.\n        Bullets rake the walls behind them as they sprint forward.  They\n        round the corner.  John does a fast take that she's not hit and they\n        run together through the security checkpoint.\n\n163     INT. SECURITY STATION/CORRIDOR\n\n        John reaches the first door, and tries it.  Locked.\n        Terminator unslings the M-79 blooper smoothly, opening the breach.\n\n                                TERMINATOR\n                Get back.\n\n        He pulls a grenade from the bandolier over his shoulder, and slides\n        it into the bore.  Flick his wrist.  The breech snaps shut.  Sarah\n        and John have a split second to duck and cover.\n\n                                TERMINATOR\n                Cover you ears and open you mouth.\n\n163A    They do.  KABOOM!!! Twenty feet away the door, and half the wall\n        around it, EXPLODES outward.  The backblast hits Terminator full\n        force, but he strides through the smoking hole before the debris has\n        even hit the floor.\n\n164     OMITTED\n\n165     INT. LAB\n\n        SWAT LEADER moves cautiously through the lab.  Cat-stepping, he\n        circles around a desk which block Dyson's body from his view.  His\n        M-16 is leveled crisply.  We look over his shoulder as he rounds the\n        desk, revealing --\n\n        MILES DYSON is not dead.  He will be very soon, but at this moment he\n        is conscious.  He has propped himself up against the desk, and holds a\n        BOOK in one hand.  A heavy technical manual.\n\n        Below the book is the detonator, upright on the tile floor.\n        The message is clear.  \"Shoot me, the book drops on the plunger.\n        Adios.\"  Dyson wheezes, trying to draw enough breath to talk.\n\n                                DYSON\n                I don't know... how much longer... I can...\n                hold this thing...\n\n        SWAT Leader seems to see the wires, the claymores, the gas cans all\n        around him for the first time.  His eyes, visible through his gas-\n        mask, go very wide.\n        He spins and motions his squad back.\n\n                                LEADER\n                Fall back!!  Everybody out!  Move it!  OUT\n                NOW!\n\n        They retreat so fast they crash into the next group coming up the\n        stairs.\n\n166     INT. CORRIDOR\n\n        Terminator reaches the main elevators.  Hits the button.  Sarah and\n        John are coughing and stumbling in the choking darkness, buddy-\n        breathing with the single mask.  The doors open.  They get in the\n        elevator and head down.\n\n167     INT. LAB\n\n        Dyson is lying amid the ruins of his dreams.  Sprawled on the floor,\n        he has his back propped up against the desk.  He is bathed in his own\n        blood, which runs out in long fingers across the tiles.  His breathing\n        is shallow and raspy.  He still holds the book, trembling, above the\n        switch.\n\n        In his lap is the picture from his desk.  He has pulled it from the\n        debris next to him.  A tear trickles from his eye.  His wife and\n        children smile up at him through broken glass.\n\n168     OMITTED\n\n169     CUT TO THE PUPIL OF HIS EYE, at the moment of death, the instant the\n        light fade from his eyes and he is gone --\n        His arm drops and the book his the switch --\n\n170     EXT. BUILDING\n\n        As the face of the building EXPLODES in an eruption of glass and fire.\n        Remains of the second-floor windows shower the parking lot and a huge\n        fireball rolls out, leaping into the sky.\n        The cops look up, stunned.  The helicopter banks away from the heat.\n        Burning debris falls among the cop cars and a number of officers \n        break ranks, pulling back.\n\n171     ONLY ONE OF THEM seems to be moving with purpose.  A BIKE COP who has\n        just arrived drives through the disorganized crowd, directly toward\n        the building.\n\n171A    T-1000 guns the bike up a ramp to a pedestrian bridge which crosses\n        from a parking structure to the Cyberdyne building.  It enters on the\n        second floor, which is now a burning maze.\n\n172     INT. SECOND FLOOR/OFFICE/CORRIDOR\n\n        T-1000 drives into the smoky wreckage.  It draws a Hoechler and Koch\n        MPK machine pistol and cruises slowly into the firelit offices,\n        scanning.\n\n172A    IN THE CORRIDOR the bike skirts flaming wreckage as it idles forward.\n        T-1000 scans the leaping shadows for its prey.\n\n173     INT. GROUND FLOOR/ELEVATOR/LOBBY\n\n        The elevator doors part and Terminator eases a look out into the\n        corridor.  The walls on either side of him ERUPT WITH BULLET HITS.\n        The SWATs have the lobby end of the corridor blocked off.  They're\n        totally trapped, cut off and screwed.\n\n                                JOHN\n                        (to Sarah)\n                Don't forget.  It's always darkness right\n                before... you're totally fucked.\n\n173A    The SWATs fire a tear-gas grenade toward the elevators.  It spews the\n        vicious CS gas out in a swirling cloud which envelops Sarah and John,\n        who are pressed against the back wall of the elevator.\n\n                                TERMINATOR\n                Keep your eyes closed.  Don't move.\n                        (they nod, eyes squeezed shut)\n                I'll be back.\n\n        He slings the grenade launcher over his shoulder and walks out into\n        the corridor.\n\n173B    BLAM.  A tear-gas grenade ricochets from wall to wall as it flies down\n        the corridor.  It skids to rest in front of Terminator, throwing out\n        a white cloud which quickly fills the corridor.\n173C    In the elevator, Sarah and John are choking, handing the breathing\n        mask back and forth desperately.  They're scarred.  This looks like\n        it.\n173D    ANGLE ON THE SWAT TEAM, gripping their weapons at the mouth of the\n        corridor.  They watch the boiling cloud, waiting.\n\n173E    THEIR POV -- on the wall of boiling smoke.  A FIGURE APPEARS.  Walking\n        Totally unaffected.  Terminator emerges from the smoke.  Not even\n        misty-eyed.  Not what they expected.\n\n                                LEADER\n                        (through megaphone)\n                Stop where you are.  Lie down on the floor,\n                face down.  Down on floor, now!\n\n        He continues to stride toward them.\n        The SWATs tense up.  They've never seen anything like this.  They're\n        not sure what to do.  Closer and closer.\n\n                                LEADER\n                Drop him.\n\n        They OPEN FIRE.  The corridor is filled with CRACKING THUNDER.  The\n        rounds tear into Terminator's chest.  Stomach.  Face.  Thighs.  His\n        leather jacket leaps and jerks as the rounds hit him.  The SWATs\n        think the guy's wearing body armor or something.  They keep firing.\n        The rounds tear into him, staggering him slightly, but he keeps\n        moving.\n\n                                LEADER\n                You're not hitting him!\n\n                                SWAT #1\n                        (getting scared)\n                Yes I am!\n\n        Terminator draws his .45 smoothly.  Unhurried.  He shoots the nearest\n        man in the left thigh.  As he screams and drops, Terminator shoots\n        him in the right thigh.  Terminator bends down and picks up the \n        shrieking man's weapon... the TEAR-GAS LAUNCHER.\n\n        It is one of those new rotary jobs that hold 12 rounds in a big drum.\n        Terminator shoots the next SWAT in the chest with the tear-gas\n        launcher.  The gas canister hits the guy's body armor and doesn't\n        penetrate.  But it's like getting slugged in the stomach with a full-\n        swing from a baseball bat.  The SWAT fold double and hits the tiles,\n        gasping.\n\n        Terminator is an image from Hell, a tall figure in shredded black\n        leather, streaked with blood.  One eye is a bloody socket, the metal\n        eye-servo glistening.  The flesh of one cheek hangs down in tatters,\n        revealing the chrome cheekbone beneath.  The whole front of his \n        jacket is blown open, revealing his metal armor chest.\n\n        The remaining SWATs start to fall back.  One turns to run and --\n        KPOW!  A gas canister nail him in the back, sending him sprawling.\n\n173F    Terminator fires three gas canisters into the lobby.  It fills\n        rapidly with the white gas, cutting the visibility to a few feet.  It\n        is total pandemonium.  SWAT LEADER crouches in the fog, white-\n        knuckling the rifle.  Terminator looms suddenly out of the mist right\n        in front of him.  POOM!  Terminator drills him in the leg with the\n        .45.  As the guy screams and drops rifle to clutch his leg, Terminator\n        rips his gas mask off.  The SWAT leader drops writhing to the floor,\n        choking and gagging, clutching his bleeding thigh.\n\n        Terminator walks up to two SWATs at the front doors.  POW-POW.  Leg\n        and leg.  He snatches their masks as they fall.  The gunfire has\n        stopped.  Nobody an see anything.  Screams and whimpers echo in the\n        smoke.\n\n174     EXT. BUILDING\n\n        Smoke boils out of the front door as a figure emerges.  Firing the\n        tear-gas launcher with one hand, Terminator launches all remaining\n        rounds among the cop vehicles.  Unprotected officers run, choking\n        and half-blind, slamming into cars and tripping over each other.  It\n        is a total rout.\n\n175     AT THE SWAT VAN on of the SWATs is rapidly handing out the remaining\n        masks to unprotected cops.  A FIGURE appears out of the smoke beside\n        him.  He looks up.  His mask is ripped off and he is handed the empty\n        launcher.  Instinctively he catches it.  Terminator grabs his flak\n        vest with one hand and sails him out into the mist.\n\n175A    INT. SWAT VAN\n\n        Terminator strides the length of the van and climbs into the driver's\n        seat.  No keys in the ignition.  He flips down the sun visor.  The\n        keys fall into his hand.  He starts the van and slams it into gear.\n\n176     INT./EXT. LOBBY\n\n        The tear gas has cleared to a thin haze.  The uninjured SWATs are\n        tending their wounded.  They look up at the sound of shouts and a\n        roaring engine.\n\n176A    THE SWAT VAN CRASHES INTO THE LOBBY in an explosion of glass and\n        debris.  Cops scatter as the van screeches across the lobby in a \n        smoking one-eighty, sliding to a stop across the corridor which leads\n        to the bank of elevators.  Terminator backs up until -- crunch -- he\n        seals the corridor with the back of the van.\n\n176B    Sarah and John stumble along the corridor, coughing.\n        They leap into the back of the van and Terminator hits the throttle.\n        The van roars across the lobby and exits through blown-out windows.\n\n                                                CUT TO:\n\n177     INT./EXT SECOND FLOOR\n\n        T-1000, astride the Kawasaki, looks down from a second-floor office\n        and sees the van tearing across the parking lot with the remaining\n        cops firing at it.  It knows.  It looks around.  Analyzing options.\n        It sees the helicopter hovering outside the building at the end of\n        this corner office block...\n        It twists full throttle on the powerful bike.\n        Roars through the office, accelerating fast, straight at the\n        windows --\n\n178     T-1000 BLASTS OUT THROUGH THE GLASS, airborne on the motorcycle.  It\n        rockets across the gap to the hovering chopper and --\n178A    SLAMS into the canopy.  The impact of bike and rider pitches the\n        chopper radically.  The startled PILOT fights to regain control as the\n        bike tumbles to the pavement below.\n178B    The T-1000 doesn't.  It clings to the shattered canopy.\n        Nightmarishly, the pilot watches as the T-1000 smashes its head\n        through the plexiglass canopy and rapidly POURS ITSELF through the\n        jagged hole.  It reforms instantly into its previous self on the\n        passenger seat.\n\n178C    It hurls the pilot out of the chopper and slides into the driver's\n        seat.\n        The chopper is auto-rotating, spinning out of control.  It drops\n        toward the parking lot.  T-1000 recovers control ten feet above the\n        ground.\n\n178D    Cops hits the deck as the tail-boom swings around, going over them by\n        inches.\n        The chopper lifts out in a power climb, roaring away across the\n        parking lot toward the fleeing SWAT van.\n\n        OKAY, BUCKLE YOUR SEATBELTS, HERE IT COMES...\n\n179     INT./EXT. SWAT VAN/HIGHWAY - NIGHT\n\n        Terminator looks back at his two passengers as he turns the boxy van\n        onto a divided highway.  Sarah and John are catching their breath,\n        still coughing from the CS gas.  Terminator look to the rear-view\n        mirror.  He sees the xenon searchlight of the chopper behind them,\n        gaining.\n\n        Sarah looks around the inside of the SWAT van.  It is a rolling\n        armory.  There are rifles, ballistic vests, all manner of equipment.\n\n                                SARAH\n                John, get under these.  Hurry!\n\n        He sits against the front bulkhead of the van and she pile bullet-\n        proof vests on top of him, completely covering him.  Then she grabs\n        two M-16s from the wall-rack and loads them.  She starts on a shotgun\n        as --\n\n180     The SWAT van weaves through sparse traffic at high speed.\n        Terminator slews the unstable van around cars and trucks which seem to\n        be crawling.  The van hits it top speed of eighty.  They swerve to\n        miss the back end of A WHITE 18-WHEEL TANKER.\n180A    The chopper swings in behind them, closing fast.\n180B    T-1000 reaches through the shattered canopy with the MPK machine\n        pistol and FIRES.  The back of the can CLANGS WITH HITS.  The door\n        windows are BLOWN IN.\n\n        Terminator weaves the van, trying to throw off the T-1000's aim.\n        The unstable vehicle screeches and wobbles on the edge of control.\n        One of the doors is kicked open.  Sarah, wearing a ballistic vest,\n        crouches in the doorway, whipping up the M-16.  SHE OPENS FIRE.\n\n180C    Bullets riddle what's left of the chopper's canopy as the T-1000\n        returns fire.\n        The van is stitched with hits.\n\n180D    INSIDE THE VAN holes are punched through the thin sheet-metal walls,\n        ripping up the interior.  The vests covering John are hit repeatedly.\n        We see that Sarah has hung two Kevlar vests on the inside of the back\n        door and she ducks behind these as bullets hit around her.  She pops\n        back out and fires in controlled bursts.  The M-16 empties and she\n        grabs another.\n\n180E    Terminator serves around a car which is changing lanes, hitting it\n        and knocking it skidding.\n\n181     OMITTED\n\n181A    Sarah reloads and keeps firing.  The van swerves around a Toyota.  A\n        moment later the helicopter passes it, the rotor just clearing the top\n        of the car.\n\n181B    T-1000 FIRES the machine pistol.\n181C    Sarah has popped out to fire.  She takes a HIT in the thigh, and\n        several rounds hammer into her Kevlar vest.  She is thrown back onto\n        the floor of the van.  She lies there, an exposed target...\n\n181D    Terminator sees the T-1000 preparing to fire again.\n        He locks up the van's brakes.  Tires scream as the vehicle shimmies.\n        Sarah is thrown forward, sliding up to the bulkhead next to John.\n182     And the helicopter SLAMS RIGHT INTO THE BACK OF THE VAN.\n        The rotor disintegrates.  The back doors of the van are crushed in as\n        the canopy, the whole front of the fuselage is HAMMERED INTO JUNK,\n        trapping the T-1000 inside the twisted metal.  The chopper hits the\n        pavement, flips, sideways, and cartwheels... smashing itself into a\n        shapeless mass of twisted metal.\n        It falls away behind the van, tumbling end over end.\n\n182A    Terminator fights to control the van, which is fishtailing violently\n        from the impact.  It smashes up against the center divider, screeching\n        along the concrete, and then pulls away.  Terminator puts the hammer\n        down and the van accelerates.  He swerves to avoid an UGLY PICKUP\n        crawling like a snail ahead.\n\n        THE RIGHT FRONT FENDER of the van, crumpled by slamming the wall, is\n        sawing into the tire.  The tire blows and peels off the clean rim.\n        The steel wheel grinds across the pavement, striking trails of sparks,\n        and the van slides sideways and topples --\n        STEEL SCREAMS on pavement as the van grinds to a stop on its side.\n\n182B    INSIDE THE VAN, John crawls to Sarah, who is groaning and holding her\n        bleeding leg.  She is white and shocky.  Terminator starts to\n        extricate himself from the crumpled driver's seat.\n\n183     BACK DOWN THE ROAD, THE HELICOPTER wreckage is a crumpled ball of junk\n        metal, unrecognizable.  Behind it, the TANKER TRUCK brakes hard, \n        shuddering and groaning, trying to stop.  The big tires lock up in\n        clouds of tire-smoke.  The rig comes to a shuddering stop just short\n        of the wrecked chopper.\n\n183A    The shaken DRIVER jumps down.\n        The behind the wreckage a cop emerges, walking toward him.\n\n                                DRIVER\n                Goddamn, are you alri --\n\n183B    SSSHHCK!  T-1000 drives a blade through the man's abdomen and walks\n        on past without slowing, or even looking at him.\n\n183C    It climbs into the open cab of the tanker.  Releases the brake.\n        As the truck bellows are rolls forward we see the large blue letters\n        on the side which say \"CRYOCO INC.  LIQUID NITROGEN SUPPLY'.\n\n184     AT THE SWAT VAN John and Terminator are carrying Sarah out of the\n        wreck.  Terminator has the M-79 slung over his shoulder, the\n        bandolier of grenades, and his .45 stuck in his waistband.  John has\n        borrowed a 12-GAUGE RIOT GUN from the SWATs.\n\n184A    The pickup they passes seconds earlier pulls up to them.  The DRIVER,\n        A Hispanic guy in his 50's, is getting out to help them.  Terminator\n        and John hear a CRASH and look back as the\n185     helicopter wreckage is knocked aside by the accelerating tanker truck.\n\n186                             JOHN\n                Holy shit.  Come on, Mom... we gotta keep\n                moving... come on --\n\n                                TERMINATOR\n                        (to the pickup owner)\n                We need your truck.\n\n        The guy seems to know better than to try and stop him as Terminator\n        slides Sarah into the front seat and climbs in behind the wheel.  John\n        runs to the passenger side.\n\n187     THE TANKER ROARS, spewing smoke from its chrome stacks as it shifts\n        up through the gears.\n\n188     Terminator slams the pickup in gear, checking the rear-view.  The\n        tanker is a hundred feet behind them now, and really moving.\n        Terminator puts the throttle down, but the pickup is and old slug\n        loaded down by a heavy home-made wooden camper-shell.  It accelerates\n        slowly.\n\n189     THE TANKER slams into one end of the SWAT van, spinning it out of the\n        way with a roar and screech of twisting metal.  The 18-wheeler shifts\n        to a higher gear, still accelerating.\n\n190     INT./EXT. PICKUP TRUCK\n\n        With the tanker right behind them, Terminator cuts the wheel, swerving\n        the pickup back and forth across the lanes.\n        The big rig stays right on them, it tanker whiplashing violently.\n\n                                JOHN\n                Faster!  He's right on us!\n\n        Terminator doesn't reply.  He rapidly unslings the blooper, still\n        around his neck, and reaches for a grenade.\n\n191     LOW ANGLE ON THE TRACTOR-TRAILER as it roars right up to the lens,\n        filling frame with chrome and lights.\n\n191A    K-WHAM!!  It rams the backs of the pickup, sending it skidding.\n\n191B    Then the T-1000 pulls the tractor trailer up alongside the pickup and\n        crabs over, sandwiching it against the center divider.  The spinning\n        chrome hubs tear into the passenger side door and the guard rail\n        screeches along the other side.\n\n        The pickup bucks and shakes insanely.  It ricochets violently between\n        the big-rig and the divider\n        Horrible SCREECH of tortured steel.\n        Sparks pour in sheets of fire from both sides.\n        The windshield shatters as the door-posts buckle in.\n        Metal and glass shower in through the side windows.\n        The frame twists and buckles.  John feels like the fillings are being\n        shaken right out of his teeth.\n        The wooden camper disintegrates, falling away as kindling behind\n        them.\n\n191C    INT. TANKER CAB\n\n        T-1000 holds the wheel hard over, mercilessly grinding the pickup.\n        The whole rig jerks and shakes with the violence of the sustained\n        hammering.\n\n191D    INT./EXT. PICKUP\n\n        Terminator slides toward the passenger side.  Keeping his foot on the\n        gas he lifts John over him and puts him in the driver's seat.\n\n                                TERMINATOR\n                Drive for a minute.\n\n                                JOHN\n                Where you going?!\n\n        Terminator slams the shattered windshield with the palm of his hand.\n        Held together by the plastic laminate, the windshield flops out of its\n        frame.  It flies over the top of the truck.\n\n191E    Terminator pushes his upper body out over the dashboard and stands up.\n        He turns and aims the M-79 one-handed.\n191F    POOM!  The grenade misses the T-1000 by less than a foot.  It EXPLODES\n        against the front bulkhead of the tanker, almost at the top.  Liquid\n        nitrogen pours from the opening, swept back by the 60-mph windstream.\n\n191G    The big-rig swerves as T-1000 regains control.  The tanker swings like\n        a pendulum behind the cab.\n\n191H    The pickup accelerates, getting back out in front by a few yards.\n        Behind it the big-rig is trailing a swirling comet-tail of nitrogen\n        vapor.  It is gaining again.\n\n        Terminator, still standing, opens the breech and starts to reload.\n191I    John cuts across the highway and takes an OFF RAMP.\n\n191J    T-1000 swerves the smoking behemoth across the lanes and down the\n        ramp after him, still accelerating.  It is twenty feet behind them\n        and closing when Terminator closes the breech and FIRES.\n\n191K    The grenade hits the front grill and EXPLODES.\n        The radiator is destroyed, along with half the hood.  Steam blasts\n        out, obscuring the whole front of the truck.\n\n191L    The semi rams the back of the pickup again.  Spewing smoke and vapor\n        like some demon locomotive, the tractor-trailer pounds into the back\n        of the pickup.  Driving it right through the intersection at the\n        bottom of the ramp, and straight toward --\n\n        EXT. STEEL MILL\n\n        The chase has led them to an area of heavy industry.\n\n192     THE GATES are blasted off their hinges as the semi rams the pickup\n        right through them.  Terminator struggles to reload amid the chaos\n        and impacts.  He has THREE GRENADES LEFT on the bandolier.\n\n        John isn't even steering.  They are just being pushed.  There's\n        nothing he can do.  They are rocketing down the broad thoroughfare\n        which leads directly to the MAIN BUILDING of the plant.\n\n192A    Terminator pulls himself onto the roof of the pickup.\n        He leaps to the bed, takes two powerful strides and --\n        Leaps onto the semi.  He climbs rapidly onto the hood.\n192B    And FIRES POINT BLANK THROUGH THE WINDSHIELD.\n        Right into T-1000's face.\n        The EXPLOSION blows out all the glass and fills the cab with smoke\n        and fire  Terminator grabs onto the air-horn as the truck starts to\n        SHUDDER AND\n192C    SCREAM.  IT IS JACK-KNIFING.\n        Almost dream-slow the cab begins to swing sideways, until its tires\n        are shrieking over the pavement.  The tractor is smashed back at\n        right-angles to the tanker-trailer which begins to slide broadside.\n\n192D    The juggernaut bucks and shudders as the tires and smoke sideways\n        across the pavement.\n        It begins to topple.\n        Terminator hold on as the side of cab becomes the top.\n        With an unholy scream, like the unoiled hubs of Hell, the whole rig\n        slides on its side at 60 mph toward the steel mill.  A sheet of sparks\n        sixty feet wide trails behind it on the pavement.\n\n192E    John sees what's behind him, then snaps around to see the building\n        looming right in front.  The huge rolling doors are partly open.\n        No choice.\n        He steers right through them into the mill, as --\n\n192F    Terminator, with one second to go, leaps from the cab --\n        He flies through the open doors as --\n        The tanker hits the building and --\n\n193     INT. STEEL MILL/MAIN AISLE\n\n        Terminator slams to the floor of the mill and rolls, as --\n        The tanker-trailer smashed into a massive concrete support at one side\n        of the doors.  Thunderous carnage of twisting metal.              o\n193A    It splits wide open.  A river of liquid nitrogen pours out at -230.\n\n193B    John hits the brakes, sliding out of control.  He slows almost to a\n        stop but hits a steel support column head-on.  He and Sarah are\n        slammed forward, hard.\n\n193C    Terminator, still clutching the M-79 blooper, rolls and slides across\n        the floor.\n        He smashes through a railing and slams up against the base of a\n        massive machine.\n\n193D    The semi cab swings about the trailer wreckage, into the building, and\n        shudders to a stop.  Liquid nitrogen sprays over the cab, flooding out\n        around it in a HISSING WAVEFRONT OF ULTRACOLD.\n        Freezing vapor swirls everywhere, obscuring the wreck.\n\n193E    TERMINATOR lies still.  A beat.  Then he rolls weakly, rising on one\n        elbow to survey the scene.\n\n193F    IN THE WRECKED PICKUP, John stirs.  He is stunned, and blood runs from\n        his nose.  Dazed, he realizes he is in a steel mill.  There are\n        sirens, and he can see men running... shouting.  He turns and sees\n        what they are running from...\n\n193G    The wall of nitrogen vapor spreads from the demolished tanker.  It is\n        a strange vista of fire and ice.  The huge SMELTERS pour out orange\n        light and fire from the sides of the huge galley, while the freezing\n        vapor rolls down the center.\n\n193H    TIGHT ON THE WRECK.  A billowing gray cloud.  Deep inside, the shape\n        of the cab in visible.  A FIGURE emerges, pulling itself out.  It\n        drops to the floor.  The hissing, boiling river of liquid nitrogen\n        flows around its feet.\n\n194     The T-1000 staggers, moving slowly, painfully.  It has finally been\n        affected by something.  Its feet are freezing to the ground as it\n        walks...\n\n194A    CLINK!  One of its feet breaks off at a glassy angle.  It stumbles\n        forward, and --\n194B    Its other foot snaps off.  As it catches its balance on the stump of\n        its other ankle,\n194C    the whole lower leg shatters at the impact.  It topples forward to its\n        knees.\n        Catches itself on one hand.  Liquid nitrogen flows around the hand.\n\n        Now the hand is stuck to the pavement.\n194D    The T-1000 pulls and... CLINK!  The hand snaps off at the wrist.\n        It looks stupidly at the glassy stump of a wrist.  For the first time\n        we see an expression on its face we know to be a true one...\n        The expression is pain.  Agony.  Its mouth opens in a soundless\n        scream as the hoar-frost races up its legs, across its body.\n194E    And that's the position it freezes in.\n        It has become a statue, kneeling in the frozen vapor, that surprised\n        look of agony frozen on its face.\n\n        The liquid nitrogen stops flowing and begins to evaporate.\n194F    Terminator, just beyond the boundary of the cold, can see the T-1000\n        clearly.\n        He draws his .45 and aims.\n\n                                TERMINATOR\n                Hasta la vista, baby.\n\n194G    K-POW!  The single shot blows the T-1000 into a million diamonds\n        spraying up into the air.  They shimmer across the ground for twenty\n        feet in all directions.\n        Terminator lowers the gun, satisfied.\n        He looks like he needs a vacation.\n\n195     JOHN AND SARAH have seen it from the pickup.  She is in bad shape.\n        Conscious but very weak.  He tries the door.  It's jammed.  He kicks\n        it open.\n\n                                JOHN\n                Okay, Mom, we gotta get out now, come on.\n                That's it.\n\n        He helps her slide down from the seat of the truck.  Her knees give\n        way.  John has to take a lot of her weight.  He reaches in and picks\n        up the riot gun off the seat.  They hobble toward --\n\n195A    TERMINATOR.  On his knees, he looks into the dissipating cloud of\n        vapor.  The heat of the furnaces has evaporated all the liquid\n        nitrogen.\n\n196     INSERT, TIGHT ON THE FLOOR - the T-1000 shards are melting,\n        liquefying.  Hundreds of drops of mercury, spattered across the floor.\n        Orange light of the enormous black-furnaces dances on liquid metal.\n\n197     TERMINATOR struggles to rise.  One arm is shattered, the hand smashed\n        and useless.  And some leg-servos are damaged.  He can barely stand.\n        John and Sarah arrive.\n\n                                TERMINATOR\n                We don't have much time.\n\n                                JOHN\n                What?\n\n        Terminator points.  John and Sarah watch as --\n\n198     INSERT, T-1000 DROPLETS are creeping together.  Fusing into larger\n        blobs.  These pools shiver and run together, soon forming a central\n        mass.\n\n199     ON JOHN AND SARAH, realizing it's not over.\n\n                                JOHN\n                Come on!  Let's go!\n\n        Terminator gets one of Sarah's arms over his shoulder and they go.\n        BEHIND THEM, something is moving.\n200     A HEAD is forming up out of a pool mercury.  it rises, as shoulders\n        form.  hunching up from the liquid mass.  Half-formed, it turns to \n        look straight at them.\n\n        John looks back in new terror as --\n\n        The T-1000 rises to man-height.  It is still in mercury form, but its\n        features are forming rapidly.  It takes its first step after them.\n        Sarah stumbles and they pull her up.\n201     Terminator himself has a pronounces limp, dragging one leg with a\n        shattered ankle joint.  John's the one pulling, straining, driving\n        them forward.  They round a corner into --\n\n202     INT. AISLE BETWEEN FURNACES\n\n        It is a maze of monstrous machinery.  The heat is tremendous.\n        The air shivers with a pounding roar.\n        Sarah cries out in pain and stumbles again.\n\n                                JOHN\n                Come on, Mom, you can do it!  Come on!!\n\n        They drag her up, and stagger on.  Her leg is bathed in blood and she\n        is deathly pale.  He looks back.\n\n203     INT, MAIN GALLERY\n\n        The T-1000 steps INTO FRAME.  Fully formed.  The hell-fire light\n        glints on its impassive cop face.  It walks forward.  At first it\n        seems unaffected by its crystallization but --\n\n203A    ANGLE ON ITS HAND as it touches a railing in passing.  The railing is\n        covered with O.S.H.A. yellow-and-black safety tape.\n        The hand turns yellow and black, the color fading to normal by about\n        the elbow.  It rips the hand from the railing with difficulty.  There\n        is a sound like adhesive tape ripping off a surface.\n\n203B    The T-1000 looks at its yellow-and-black striped hand.  It wills the\n        hand back to normal.  We see ripples of \"static\" or system noise\n        moving subtly over the surface of its body.  It's starting to\n        \"glitch\".\n\n203C    TRACKING WITH THE T-1000'S FEET.  With each step, the pattern on the\n        tile floor \"invades\" its lower legs.  Fades as the foot is lifted.\n        Returns as it is set down.  The foot is trying to meld with the floor.\n        The chameleonic function is out of control.\n        The T-1000 is losing it.  It moves forward, searching.  It rounds the\n        corner, entering the aisle between the furnaces.\n\n204     INT. AISLE\n\n        Terminator sees the SILHOUETTE closing on them through the smoky\n        gleam.  The T-1000 breaks into loping run when it sees them,\n        Terminator turns to Sarah over John.\n\n                                TERMINATOR\n                Keep going.\n\n        John shakes his head no.  The T-1000 is almost on them.\n\n                                TERMINATOR\n                RUN!\n\n        John runs, dragging, half-carrying Sarah as best he can.\n        She can barely stay conscious.  Half-running, delirious, she stumbles\n        and drops to her knees.  John pulls but she can't rise.\n\n                                JOHN\n                        (crying, shouting)\n                Come on, you gotta try... please, Mom.  Get up!\n\n        John looks back to see --\n\n204A    TERMINATOR trying to load the M-79.  With his shattered hand, he can\n        barely maneuver is last grenade into the breech.\n        T-1000 smacks the weapon out of his hands.  It clatters to the floor.\n\n        The grenade spins across the floor, rolling under some machinery.\n        Terminator lunges, slamming the T-1000 against a wall with all his\n        weight.  The battle is joined.\n\n204B    JOHN AND SARAH have reached the back of the aisle.  It is a cul-de-\n        sac, blocked on the end by the base of an IMMENSE SMELTER CRUCIBLE.\n        They turn to watch the titans battle in silhouette, backlit by the\n        molten sparks falling from the furnaces above.  The battle which will\n        decide their fate.\n\n204C    Terminator grabs the T-1000 and hurls it with awesome force against\n        the opposite wall of the narrow alley.  In less time than it would\n        take to turn, the\n204D    T-1000 morphs trough itself, front to back... face emerging from the\n        back of its head.\n204E    It comes off the wall straight at Terminator, who smashes his good\n        fist into its face.  The pile-driver blow buries Terminator's fist\n        almost to the elbow.\n\n204F    But the T-1000's head morphs in a split-second into a hand which grips\n        Terminator's wrist, and the head \"emerges\" somewhere else, the\n        geometry shifting faster than we can follow.\n204G    The T-1000 slams Terminator into a large machine, jamming his arm into\n        the moving works.  A massive sliding bar SCISSORS HIS ARM, smashing it\n        into junk at the elbow, pinning him in the machine.\n\n        Terminator strains against the machine pinning him.  We hear his\n        servos whining with overload.  The T-1000 turns and lopes toward Sarah\n        and John.\n\n        Sarah screams and hurls John into a gap between the machines.  He\n        falls into a maze of pipes and girders.\n\n205     INT. MAZE OF MACHINES\n\n        JOHN turns to see her in the entrance of the narrow gap.  She could\n        follow him but she doesn't.  SUDDENLY a dark mass moves toward him.\n        John gasps as a huge steel counterweight, driven by a chain 6 inches\n        thick, slides toward him.  He rolls out of the way.  When he looks\n        back, he cannot see the opening.\n\n                                JOHN\n                Mom!  MOMMM!!\n\n206     INT. AISLE BETWEEN FURNACES\n\n        TERMINATOR strains to reach a 6-foot steel bar lying near him.  Steel\n        workers use them to move the red-hot ingots around.  He gets hold of\n        the end and uses it as a lever.  With titanic effort he spreads the\n        massive components which are holding him, and withdraws him arm, which\n        is severed at the elbow.  Dangling junk hands from the crushed joint.\n\n207     SARAH has lost sight of John.  It is much of a goodbye as they will\n        have.\n        She turns as the T-1000 closes on her.  She is half-slumped against\n        the sooty machines, looking barely conscious.  She struggles to load\n        a shell into the empty weapon.  At the last instant she whips up the\n        RIOT GUN and FIRES.\n\nA207    T-1000's face is blown open, but quickly reforms as it closes on her.\n        She fumbles to get another shell into the magazine but --\nA208    THUNK!  A steel needle slams through her shoulder, pinning her.\n        The polymorphic killer cocks back its other hand.  The index finger\n        extends as a gleaming needle, toward her eye --\n\n                                T-1000\n                Call to John.  Now.\n\n207C    WHAM!!  SOMETHING whistles down on the T-1000 with such force that is\n        cleaves it head and body in two down to the naval.  The 6-foot steel\n        bar is imbedded in its body.  Terminator hurls the killer off Sarah.\n\n207D    The T-1000 pulls the steel shaft out of itself and attacks him with\n        fury.\n        Swinging again and again.  Hammering Terminator back.  Terminator\n        falls back against the wall.\n\n        Behind the T-1000 is an enormous I-beam, hanging from two chains.  It\n        is used to lift ingots into the smelters, and it runs on a linear\n        track.\n207E    The T-1000 grabs the I-beam and rolls it down the track.  Straight at\n        Terminator.  The two-ton girder smashes into his chest, crushing the\n        armor.\n        The T-1000 pulls the I-beam back, and then heaves it forward again.\n        Terminator turns and takes the second blow on the shoulder.  We hear\n        metal crush and break inside him.  He sags, turning to grip the\n        wall...\n        The third blow slams into his back, smashing his spine and pelvis.  We\n        hear servos ratcheting and failing.  He drops to his knees, crucified\n        on a wall of machinery.\n        The fourth blow is centered between his shoulder blades.  Sound of\n        crushing metal.  His skull is partially caved in.\n        He slides to the floor.\n\n207F    ON THE T-1000, emotionless as it walks forward.\n\n207G    TERMINATOR is a pathetic shape on the floor.  He is trying to crawl,\n        feebly.\n        Dragging his malfunctioning legs behind the crushed spine.  His arm\n        stump screeches on the tile floor as he inches himself forward.  His\n        exposed machine eye burns red with determination.\n\n        We see his prize.  He has the M-79, with the breech still open, \n        cradled in the crook of his ruined arm.  He good hand, the exposed\n        steel one, is reaching for the last grenade, which is visible under\n        the skirt of the massive smelter base.  His metal fingers reach out\n        for it as --\n\n207H    The T-1000 raises the heavy steel bar over his head and stabs it down\n        with unbelievable force.  It punches into Terminator's back, through a\n        gap in the shattered armor.  The T-1000 levers it back and forth,\n        widening the hole.  Then is raises the pointed bar again and slams it\n        down.\n        It punches right through.  Emerging from Terminator's chest.\n        And into the floor.  He is pinioned.  The cyborg sags face down and\n        stop moving.  The light goes out of his eye.\n\n                                                CUT TO:\n\n208     INT. MAZE OF MACHINERY\n\n        John scuttles like a rat through the gut of the smelter.  Above him,\n        vast machines churn untended.  He hears a voice... SARAH'S\n        Calling low and urgent to him.\n\n                                SARAH\n                John?  John?  Can you hear me?  Where are you?\n\n208A    He crawls out of the shadows.\n        Onto a landing next to one of the SMELTER CRUCIBLES.  Molten steel\n        glows bright orange in the crucible of the furnace.  Heat shimmers\n        the air, giving everything a hallucinatory quality.\n\n        John sees Sarah nearby, limping toward him.  She can barely move, her\n        leg bathed in blood.  He runs toward her.\n\n                                SARAH\n                        (gasping)\n                Help me, honey...\n\n        TIGHT ON SARAH, her stoic face, as she hobbles forward, reaching out\n        to him.  Something rises behind her, OUT OF FOCUS.\n\n209     ANOTHER, IDENTICAL, SARAH... but this one has a shotgun.\n        Aimed right at us.\n\n209A    JOHN freezes.  Which is which?  He looks down.  The first Sarah's\n        feet are melded with the floor, sucking and fusing with the tiles as\n        she walks.  They have the color and pattern of the tiles up to the\n        knee.\n\n                                SARAH\n                John, get out of the way!!\n\n                                JOHN\n                        (screaming)\n                SHOOT!!!!\n\n209B    John dives aside.  The Sarah-form spins, changing into you-know-who.\n        Sarah starts unloading the shotgun into it.  BOOM!  It staggers back.\n        K-CHAK.  She chambers another round.  BOOM!  It staggers again.\n        K-CHAK.  BOOM!  And again.  And again.\n\n209C    The T-1000 is blown back a step and Sarah advances with each shot.\n        The craters in the T-1000's body \"heal\" slowly.  Its power is waning.\n        She FIRES again.  And again.  Her eyes blazing with feral intensity.\n        She walks it back, right to the edge of the pit of MOLTEN STEEL.\n\n        K-CHAK... CLICK.  She's empty.  The T-1000 is right at the edge.  In a\n        second it will recover its composure, as its crater hits close slowly.\n        She has failed.  Now it will kill them both,\n        Except...\n\n210     CLOSEUP TERMINATOR, as the chain drive brings it into view.\n        Half human flesh, half chrome steel.\n        His red eye gazes right at us as he --\n        FIRES.\n\n210A    The T-1000 takes the round in the belly.  The grenade EXPLODES inside\n        its body.  A huge hole is blown clean through it, and it is ripped\n        open and peeled back, half inside-out.  It topples into the molten\n        steel and --\n\n211     The T-1000's head and upper body reappear above the molten steel.\n        It is screaming.  A terrifying, inhuman siren of a scream.\n        It is changing, morphing, transforming into anything and everything\n        it's ever been so rapidly the eye can barely follow it --\n        We catch a glimpse of Janelle Voight checkered with the linoleum tile\n        colors, Lewis the Guard with knives exploding from his face, other\n        faces, switching at a stroboscopic rate now... a face every two frames\n        until they merge into one face --\n\n        The T-1000 screams and slips beneath the surface of the molten steel.\n        We see liquid silver running in dissipating whorls over the\n        superheated surface... until it vanishes, swirling into nothing.\n\n212     JOHN runs to Sarah.  She stands staring into the pit.  The empty\n        shotgun slips from her fingers.  Clatters to the floor.  He sees that\n        she's okay and he runs to the fallen Terminator.\n\n212A    The crippled cyborg is trying to rise.  Its servos whine and stutter.\n        It pathetically lifts itself to a kneeling position, collapses...\n        tries again.\n        John lifts for all he's worth.  Sarah joins them, helping.\n        The help the crippled machine get on its feet.  It can barely stand.\n\n                                TERMINATOR\n                I need a vacation.\n\n        They walk to the edge of the pit.  Terminator looks down and sees\n        that it is over.\n\n                                JOHN\n                        (to Terminator)\n                Is it dead?\n\n                                TERMINATOR\n                Terminated.\n\n        John unzips Sarah's backpack and takes out the hand of the first\n        terminator.\n\n                                JOHN\n                Will it melt in there?\n\n                                TERMINATOR\n                Yes.  Throw it in.\n        \n        He does.  It sinks into the lava.  Vanishes.\n\n                                TERMINATOR\n                And the chip.\n\n        John takes it out of his pocket.  Looks at it.  Tosses it into the\n        smelter.\n\n                                SARAH\n                It's finally over.\n\n                                TERMINATOR\n                No.  There is another chip.\n\n        He touches a metal finger to the side of his head.\n\n                                TERMINATOR\n                And it must be destroyed also.\n\n        John suddenly understands what he means.\n        Terminator looks at Sarah.  They both know what must be done.\n        John shakes his head.\n\n                                JOHN\n                No!\n\n                                TERMINATOR\n                I'm sorry, John.\n\n                                JOHN\n                No, no no!!  It'll be okay.  Stay with us!\n\n                                TERMINATOR\n                I have to go away, John.\n\n                                JOHN\n                Don't do it.  Please... don't go --\n\n        Tears are streaming down his face.\n\n        TIGHT CLOSEUP TERMINATOR, turning toward John.\n        The human side of his face is in shadow, so we see mostly the chrome\n        skull and the red eye.\n\n                                TERMINATOR\n                It must end here... or I am the future.\n\n                                JOHN\n                I order you not to!\n\n        Terminator puts his hand on John's shoulder.  He moves slightly and\n        the human side of his face comes into the light.\n        He reaches toward John's face.  His metal finger touches the tear\n        trickling down his cheek.\n\n                                TERMINATOR\n                I know now why you cry.  But it is something I\n                can never do.\n                        (to both of them)\n                Goodbye.\n\n        Sarah looks at Terminator.  Reaches out her hand to shake it.\n        They lock eyes.  Warriors.  Comrades.\n\n                                SARAH\n                Are you afraid?\n\n                                TERMINATOR\n                Yes.\n\n        He turns and steps off the edge.\n213     They watch him sink into the lava.\n        He disappears... the metal hand sinking last... at the last second it\n        forms into a fist with the thumb extended... a final thumbs up.\n        Then it is gone.\n\n214     HOLD ON JOHN AND SARAH, watching through the heat ripples as we --\n\n                                                DISSOLVE TO:\n\n215     THE SUN, PURE IN A CLOUDLESS SKY\n        Tilting down reveal that we are in a park, very green.  People are\n        casually dressed, having fun.  Cycling, reading... children are\n        playing in a playground.\n\n        Beyond the line of tree we see the skyline of Washington, D.C., with\n        the Capital Building and the Washington Monument.  The skyline is\n        subtly changed, with a lot of new buildings, advanced high-rises.\n        A CARD APPEARS\n\n                                July 11, 2029\n\n        WE BOOM DOWN AND TRACK LATERALLY through a playground in the\n        foreground.  Children swinging on swings.  Sliding down slides.\n        Timeless things that 4 decades of technical advancement will not\n        change.  As we track we hear:\n\n                                SARAH (V.O.)\n                August 29th 1997 came and went.  Nothing much\n                happened.  Michael Jackson turned forty.  There\n                was no Judgment Day.  People went to work as\n                they always do, laughed, complained, watched\n                TV, made love.\n\n        We pass a jungle gym, neither melted nor burned, but full of kids\n        swinging and yelling raucously.  Past it we drop down to see a boy\n        pumping the pedals of a tricycle.\n\n                                SARAH (V.O.)\n                I wanted to run down the street yelling... to\n                grab them all and say \"Every day form this day\n                is a gift.  Use it well!\"  Instead I got drunk.\n\n        STILL TRACKING we come to rest on an elderly woman seated on a bench.\n        It is SARAH, now 64 years old.  The world has aged her, but she seems\n        at peace in this moment.  She speaks into a microcassette recorder.\n\n                                SARAH (V.O.)\n                That was thirty years ago.  But the dark future\n                which never came still exists for me, and it\n                always will, like the traces of a dream lingering\n                in the morning light.  And the war against the\n                machines goes on.  Or, to be more precise, the\n                war against those who build the wrong machines.\n\n        There is a man in is forties playing with two small children\n        nearby.  He turns.  It is John Connor.  Through he has the same stern\n        features in adulthood, there is no eye-patch, no scarring.  He is far\n        from the haggard man on grim destiny we saw in the world that might\n        have been.  But there is still penetrating intelligence, even wisdom,\n        in his eyes.\n\n                                SARAH (V.O.)\n                John fights the war differently than it was\n                foretold.  Here, on the battlefield of the\n                Senate, the weapons are common sense... and\n                hope.\n\n        A FOUR-YEAR-OLD GIRL runs to her to have her shoelace tied.\n\n                                GIRL\n                Tie me, grandma.\n\n        Grandma Sarah smiles.  It is the only time we have seen her smile so\n        far.  She bends as the little girls puts her foot up on the bench.\n        She ties as we hear:\n\n                                SARAH (V.O.)\n                The luxury of hope was given to me by the\n                Terminator.  Because if a machine can learn\n                the value of human life... maybe we can too.\n\n        Sarah ruffles the kids's hair as she runs off to play with her dad.\n\n                                                FADE OUT\n\n\n\n\n\nTerminator 2: Judgement Day\nWriters :   James Cameron  William Wisher\nGenres :   Sci-Fi  Action  Thriller  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:37:01.730250"}