{"title": "Terminator", "film_link": "/Movie Scripts/Terminator Script.html", "script_link": "/scripts/Terminator.html", "info_raw": "\n\nTerminator Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (7.44 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Harlan Ellison  James Cameron  Gale Anne Hurd  William Wisher Jr.\nGenres  Sci-Fi  Thriller  Action  Drama  Romance\nScript Date : April 1983\n\nRead \"Terminator\" Script\n\n\n", "script": "\n\t\t\n\n                      \" T E R M I N A T O R \"\n\n                                by\n\n                           James Cameron\n\n\n\n        Registered WGAw\n\n        Fourth Draft\n        April 20, 1983\n\n\n\n--------------------------------------------------------------------\n\n\n                             TERMINATOR\n\n\n\nA1      TITLE SEQUENCE - SLITSCAN EFFECT                       A1\n\n1       EXT. SCHOOLYARD - NIGHT                                1\n\n        Silence.  Gradually the sound of distant traffic becomes\n        audible.  A LOW ANGLE bounded on one side by a chain-link\n        fence and on the other by the one-story public school build-\n        ings.  Spray-can hieroglyphics and distant streetlight sha-\n        dows.  This is a Los Angeles public school in a blue collar\n        neighborhood.\n\n        ANGLE BETWEEN SCHOOL BUILDINGS, where a trash dumpster looms\n        in a LOW ANGLE, part of the clutter behind the gymnasium.\n        A CAT enters FRAME.  CAMERA DOLLIES FORWARD, prowling with\n        him through the landscape of trash receptacles and shadows.\n\n        CLOSE ON CAT, which freezes, alert, sensing something just\n        beyond human perception.\n\n        A sourceless wind rises, and with it a keening WHINE.\n        Papers blow across the pavement.\n        The cat YOWLS and hides under the dumpster.\n        Windows rattle in their frames.\n        The WHINE intensifies, accompanied now by a wash of frigid\n        PURPLE LIGHT.  A CONCUSSION like a thunderclap right over-\n        head blows in all the windows facing the yard.\n\n        C.U. - CAT, its eyes are wide as the glare dies.\n\n\n1A/FX   ANGLE - DUMPSTER                                       1A/FX\n\n        ELECTRICAL DISCHARGES arc from the dumpster to a water\n        faucet and climb a drain pipe like a Jacob's Ladder.\n\n                                              CUT TO:\n\n\n2       EXT. SCHOOLYARD - NIGHT                                2\n\n        SLOW PAN as the sound of stray electrical CRACKLING subsides.\n        FRAME comes to rest on the figure of a NAKED MAN kneeling,\n        faced away, in the previously empty yard.\n        He stands, slowly.\n        The man is in his late thirties, tall and powerfully built,\n        moving with graceful precision.\n\n        C.U. - MAN, his facial features reiterate the power of his\n        body and are dominated by the eyes, which are intense, blue\n        and depthless.  His hair is military short.\n\n        This man is the TERMINATOR.\n\n        He glances down, taking calm inventory of himself, and\n        notices that a fine white ash covers his skin.  He brushes\n        at it unconcernedly as he walks toward the fence, scanning\n        his surroundings.\n\n                                              CUT TO:\n\n\n2A/FX   CRANE SHOT - SCHOOLYARD/CITY - NIGHT                   2A/FX\n\n        CAMERA MOVES UP as Terminator approaches the schoolyard fence\n        beyond which is an embankment rolling down in darkness to the\n        cityscape below.  The school is perched at the edge of a pro-\n        montory offering a respectable view of the urban sprawl teem-\n        ing and glistening under a sullen sky.  The night clouds are\n        shot through with occasional flashes of LIGHTNING, presaging\n        a thunderstorm.\n\n        Terminator stands, hands on hips in prefect symmetry, gazing\n        down at the city as the CAMERA REACHES FULL HEIGHT.\n\n                                              CUT TO:\n\n\n3       EXT. PLAYGROUND - NIGHT                               3\n\n        A beer bottle SMASHES on the ground.  PULL BACK to include\n        its ex-owner and his two compatriots, YOUTH GANG MEMBERS,\n        lounging on the jungle gym of a deserted playground.  They\n        sport nondescript PUNK REGALIA...torn T-shirts, fatigue\n        pants, combat boots or high-top sneakers, leather jackets.\n\n        The leader notices something and sits up.\n\n                                LEADER\n                           (pointing)\n                     Hey, hey...what's wrong with\n                     this picture?\n\n        ANGLE - REVERSE, seen past the lounging toughs, Terminator\n        walks naked into a pool of streetlight, striding purpose-\n        fully toward them.\n\n        ANGLE - OVER TERMINATOR'S SHOULDER, as he approaches them.\n        They slide from their perches and drop easily to the ground\n        liquid shadows.\n\n                                LEADER\n                     Nice night for a walk, eh?\n\n        Terminator stops right in front of them.\n\n                                TERMINATOR\n                           (without inflec-\n                           tion)\n                      Nice night for a walk.\n\n        They surround him, all swagger and malign good humor.\n\n                                SECOND PUNK\n                      Washday tomorrow, huh?  Nothing\n                      clean, right?\n\n        Terminator eyes them without expression, unhurried.\n        Reptilian.\n\n                                TERMINATOR\n                      Nothing clean.  Right.\n\n                                LEADER\n                      This guy's a couple bricks\n                      short.\n\n        Terminator turn to the second punk, ignoring the\n        others.\n\n                                TERMINATOR\n                      Your clothes.  Give them to me.\n\n        The punks exchange glances, dismayed.\n\n                                TERMINATOR\n                           (coldly)\n                      Now.\n\n                                SECOND PUNK\n                           (bracing)\n                      Fuck you, asshole.\n\n\n        Without warning Terminator hammer-punches him in the temple\n        with blinding speed.  The blow flings him with a CLANG into\n        the jungle gym.  He drops to the ground in a still heap,\n        eyes open, twitching.\n\n        The leader whips out his SWITCHBLADE and slashes in one\n        motion.  Terminator ducks back and catches the knife-\n        wielder's wrist in an inhuman grip.  Then he punches the\n        leader with piledriver force just below the breastbone.\n\n        ANGLE - PAVEMENT, as the knife clatters down.  The punk's\n        combat boots are on tiptoe, barely touching the ground.\n\n        ANGLE - TWO SHOT, Terminator and the leader are close\n        together as if dancing, but motionless.  Their bodies are in\n        total shadow.  The punk's eyes are wide, his veins distended\n        with an agonizing pressure.  Terminator jerks his fist back\n        with a WET SOUND and the other drops OUT OF FRAME.\n\n        The last tough is stumbling away, gaping with terror.  He\n        backs into a chainlink fence, turns to run along it, finds\n        he is in a corner.\n\n        Terminator takes a step toward him, his gaze ominous.\n\n        The punk begins shakily stripping off his clothes.\n        Thunder peals overhead.\n\n                                               CUT TO:\n\n4       EXT. STREET/NEARBY - NIGHT                             4\n\n        A light RAIN begins to fall.\n        Terminator emerges onto the street from the playground,\n        pausing in the pool of light under a streetlight to hike\n        the collar of the punk's jacket.\n               The rain streams down over his face, running into\n        and over his eyes.  They do not blink.\n\n                                               CUT TO:\n\n5       EXT. DOWNTOWN STREET/ALLEY - NIGHT                     5\n\n        Another part of the city.  Seedy apartments and storefronts.\n        The streets glisten, hissing with sporadic late night traffic.\n        SLOW PAN AND DOLLY into the mouth of a narrow alley lined\n        with trash containers and fire escapes.  From a recessed\n        doorway, two filthy legs sprawl out onto the wet pavement.\n        An angry, inarticulate DRUNKARD'S MONOLOGUE rises occasionally\n        above the rain sounds.\n\n        ANGLE - DOORWAY,  The derelict rouses from his bitter stupor\n        as a brilliant purple glare lights up the wet brickwork\n        around him.  A shockwave hurls trash into the air.\n        Painted over windows shatter.\n        Rat scurry, blinded.\n\n        A FIGURE drops INTO FRAME as if out of the sky and smacks\n        the pavement with a muddy splash.\n\n        C.U. - DERELICT, as he blinks at the fading glare, amazed.\n\n        A NAKED MAN, compact and muscular, rises in a defensive\n        crouch.  KYLE REESE is 22, but his face has been aged by\n        ordeal, the mouth hard, eyes grim.  A crinkled burn scar\n        traverses one side of his face from chin to forehead.  Other\n        scars, from burns and bullets, mar his hard-muscled body.\n\n        The rain washes a fine coating of white ash from his skin\n        as electrical ARCS lace back and forth between the fire\n        escapes behind him, HISSING and SPUTTERING.  The sound\n        fades, then stops altogether, to be replaced by a rising\n        scream of animal agony.\n\n        Reese lurches to his feet and sprints across the alley.\n\n                                               CUT TO:\n\n5A/FX   OMITTED                                                5A/FX\n\n6       OMITTED                                                6\n\n\n7       EXT. FIRE ESCAPE - NIGHT                               7\n\n        CAMERA MOVES WITH REESE as he leaps to the fire escape and\n        clambers up to the first landing to crouch beside another\n        NAKED MAN who appears to be entangled in the ironwork.  The\n        man is contorted with pain as his screams die to a shivering\n        gasp.  CLOSER ANGLE reveals that he has been skewered through\n        the abdomen by the horizontal iron slats and through the\n        shoulder by a railing.  He has materialized in the same\n        space occupied by the fire escape structure.  The figure\n        slumps, motionless.\n\n        Reese quickly checks for signs of life.  The man is dead.\n\n        Reese descend to the alley floor and crosses to the drunk\n        huddled in the doorway.\n\n        A pair of flamboyantly dressed women, obviously working\n        girls, passes by the alley mouth.  They do a double take\n        when they see Reese, but walk on without breaking stride,\n        completely jaded.  He's certainly not a potential customer.\n\n        Reese crouches down as if to speak to the drunk.\n\n                                DERELICT\n                      Say, buddy...did you see a\n                      real bright light?\n\n                                               CUT TO:\n\n8       EXT. ALLEY/SAME - NIGHT                                8\n\n        A brilliant white glare stabs into the alley mouth as an\n        LAPD cruiser glides slowly by on the street.  The search-\n        light illuminates the figure of Reese, crouching over the\n        sprawled drunk, just pulling on the other's trousers.\n\n        The cruiser chirps to a stop.  The doors fly open and two\n        cops leap out.\n\n                                FIRST COP\n                      Hold it, right there!\n\n        Reese hitches his pants and bolt like a shot.  The cops\n        draw their guns and race into the alley after him.\n\n        HANDHELD CAMERA or PANAGLIDE, rushing with Reese along the\n        narrow alley.  He vaults a pile of tumbled trashcans.\n        Whips around a corner.  Leaps the hood of a parked car in\n        the cross alley.\n\n        PANAGLIDE PRECEDING COPS, as they snake through the night\n        maze.\n\n                                               CUT TO:\n\n9       EXT. CROSS ALLEY - NIGHT                               9\n\n        PANAGLIDE WITH REESE as he hits a chain link gate at a\n        dead run and scrambles over it.\n\n10      EXT. ALLEY JUNCTION - NIGHT                            10\n\n        WHIP PAN ON COPS, skidding to a stop at the corner in time\n        to see Reese vault the fence.  They separate.\n\n        DOLLY WITH SECOND COP, as he runs to the gate.\n\n                                               CUT TO:\n\n11      EXT. ALLEY/NEARBY - NIGHT                              11\n\n        LOW PANAGLIDE WITH REESE, running full tilt, displaying\n        incredible agility.\n\n        REESE'S POV, the alley walls blur by.  The view of a hot-\n        wired rat in an urban maze.\n\n        C.U. - REESE, CAMERA hugging him as he sprints and turns,\n        alternately front-lit, side-lit and silhouetted as the\n        electric glare of the city wheels about him.\n\n        ANGLE - ALLEY MOUTH, Reese flashes though intermittent\n        cross-lighting in the B.G.\n\n        Another unit arrives out front and Reese melts back into\n        the alley, only to see a cop round the corner behind him.\n        Sandwiched.  Reese crashes into a steel door, rending the\n        lock, and vanishes into the darkness within.\n\n        The newly arrived cops are a K-9 unit.  They open the back\n        door of the squad car to release a large black Doberman.\n\n                                               CUT TO:\n\n\n12      INT. DEPARTMENT STORE - NIGHT                          12\n\n        Reese finds himself among the display racks of a discount\n        department store.  A searchlight stabs in the front\n        window as he dashes into the maze of aisles.\n\n        Three cops enter behind him through the shattered door.\n\n        FAST PANAGLIDE WITH REESE, as he crab-runs low among the\n        moving shadows where flashlights quarter the darkness.  He\n        bolts the open space behind a display window.  Sees the\n        outside searchlight sweep toward him.  Freezes.\n\n        ANGLE - REESE, his feral face frozen among the smooth-\n        featured, smiling mannequins.  As the light passes, Reese\n        silently moves on.\n\n        ANGLE - COP, passing the end of a long aisle B.G. while in\n        the F.G. a hand ENTERS FRAME, removing a knit shirt from a\n        hanger.  Reese slips the shirt on quietly and does a fast\n        crab-walk across the aisles to melt into the other racks\n        and shadows, CAMERA MOVING LOW with him.\n\n                                               CUT TO:\n\n\n13      INT. DEPARTMENT STORE/AISLE - NIGHT                    13\n\n        With a shocking GROWL the police dog hurtles out of the\n        shadows, LEAPING RIGHT AT CAMERA.\n\n        ANGLE - REESE AND DOG, a dark blur with teeth, extremely\n        Doberman, flies toward Reese.  He spins.  Catches it by\n        the throat in mid-air. Arcs it to the floor with unflinching\n        precision.\n\n        C.U. - DOBERMAN, suddenly on its back and held by the throat,\n        THE DOG YELPS and stares at Reese, who leans very close.\n        Inches from its eyes he fixes it with a gaze of uncompromis-\n        ing dominance.  Some ancient communication seems to pass\n        between the two.\n\n        Reese releases the animal and turns his back on it, selecting\n        a long overcoat from a rack.  The dog backs away from him,\n        stiff-legged and confused.\n\n                                               CUT TO:\n\n\n14      INT. DEPARTMENT STORE - NIGHT                          14\n\n        TRACKING WITH REESE as he rounds a corner on the run, still\n        shrugging into his long coat.\n        Running smack at him is another cop, gun aimed.\n\n        Without slowing, Reese leaps toward him, twisting in mid-air\n        like a cat.  The cop FIRES. Misses.  Goes down under Reese's\n        tackle and they slide together on the polished floor.\n\n        Before they even come to rest Reese snatches the cop's gun,\n        aiming it at the other's face two-handed.\n\n                                REESE\n                      What day is it?  The date...\n\n                                COP\n                      Thursday...uh...May twelfth.\n\n                                REESE\n                           (viciously)\n                      What year?\n\n        A SHOT whines off the metal side of an escalator behind\n        Reese's head.  He vaults the escalator rail, leaving the\n        amazed cop lying on the floor.\n\n        Reese bounds up the frozen steps, pocketing the .38 Police\n        Special in his coat.\n\n        Cops dash through the maze of aisles, converging at the\n        escalators.\n\n                                               CUT TO:\n\n15      INT. DEPARTMENT STORE/SECOND FLOOR - NIGHT             15\n\n        WHIP PANNING WITH REESE, as he hurtles between displays.\n        He stops for a moment beside a rack of shoes.  Slaps one of\n        a pair of tennis shoes sole-to-sole against his bare foot.\n        Too small.  Another.  Holding the shoes he runs on.\n\n                                               CUT TO:\n\n16      EXT. SECOND FLOOR FIRE ESCAPE LANDING - NIGHT          16\n\n        A door opens quietly and Reese slips out.\n\n        CAMERA TRACKS WITH HIM as he moves like a panther along the\n        narrow catwalk.  TILT DOWN to include the first LAPD cruiser\n        parked at the mouth of the alley.\n\n                                               CUT TO:\n\n17      EXT. ALLEY/STREET - NIGHT                              17\n\n        Reese drops cat-like beside the unattended police car.\n        Cautiously, he opens the door of the cruiser, removes the\n        RIOT GUN, an Ithaca pump model, from the dash rack and slips\n        it under his coat.  Cradled in a vertical position, the\n        shortened weapon is virtually invisible.\n\n        He walks out onto the street and away,  unhurriedly, an\n        innocuous pedestrian soon lost in the rain.\n\n                                               CUT TO:\n\n\n18      EXT. STREET/NEARBY - NIGHT                             18\n\n        Reese enters a telephone booth.  Harsh light rakes across\n        his face, outlining the long scar.  He opens the directory,\n        leafs through it.\n\n        ANGLE - MACRO ON PAGE, Reese's finger slides down a column.\n        Stops beside the following listings in the big metropolitan\n        white pages:\n        CONNOR, SARAH\n        CONNOR, SARAH ANN\n        CONNOR, SARAH J.\n\n                                               DISSOLVE TO:\n\n\n19      EXT. CITY STREET - MORNING                             19\n\n        The night's rain has given way to a typical L.A. morning\n        of diffuse sunlight.\n\n        MOVING WITH A GIRL on a MOPED as she zips through traffic.\n        SARAH CONNER is 19, small and delicate-featured.  Pretty in\n        a flawed, accessible way. She doesn't stop the party when\n        she walks in, but you'd like to get to know her.  Her vulner-\n        able quality masks a strength even she doesn't know exists.\n\n        Sarah maneuvers nimbly, apparently in a hurry.\n\n                                               CUT TO:\n\n\n20      EXT. BIG BOB'S RESTRAUNT - DAY                         20\n\n        Sarah buzzes into the parking lot of Big Bob's Family\n        Restaurant and chains the moped to the icon of Big Bob\n        himself.  The fiberglass cherub holds up his mammoth\n        hamburger in perpetual homage to whatever deity watches\n        out for fat kids.\n        Sarah removes a stack of college textbooks from the luggage\n        carrier and tuns to go into the restaurant.\n\n                                SARAH\n                           (to Big Bob)\n                      Watch this for me, big buns.\n\n                                               CUT TO:\n\n21      INT. BIG BOB'S/DINING AREA                             21\n\n        HIGH WIDE SHOT prominently featuring a VIDEO SURVEILLANCE\n        CAMERA F.G. as Sarah enters below.  She passes under another\n        video eye as she crosses the main floor of the wholesomely\n        appointed eatery.  Sarah goes through the swinging STAFF\n        doors under a third camera.\n\n                                                CUT TO:\n\n\n22      INT. MANAGER'S OFFICE                                  22\n\n        The office is closet-like, lit by the glow of several\n        security monitors.  CHUCK BREEN, day manager, pimply and\n        officious,watches Sarah in an overhead view of the service\n        corridor.  He punches a switch and reaches for a microphone\n        on a studio gooseneck.\n\n                                               CUT TO:\n\n23      INT. SERVICE CORRIDOR                                  23\n\n        Sarah glances up as Breen's voice rasps from a ceiling speaker.\n\n                                BREEN (V.O.)\n                      Sarah?\n\n        She answers the empty hallway.\n\n                                SARAH\n                      Yes, Chuck?\n\n                                BREEN\n                      Come to the office, please.\n\n        She turns back toward the office door at the end of the\n        corridor.\n\n                                               CUT TO:\n\n\n24      MANAGER'S OFFICE                                       24\n\n        Sarah opens the door to Breen's closet control center.\n\n                                SARAH\n                      Mission control to Chuck,\n                      come in...\n\n                                BREEN\n                           (without looking\n                           up)\n                      You're late.\n\n        Sarah is undaunted.\n\n                                SARAH\n                      Aren't I worth waiting for?\n\n                                BREEN\n                      Not really.  Do you think you\n                      can get here on time if I put\n                      you on the floor as a waitress?\n\n                                SARAH\n                           (grinning)\n                      I don't know.  I kinda had\n                      my heart set on being a\n                      cashier the rest of my life.\n\n                                BREEN\n                      The pay's the same but you'll\n                      make more in tips.\n\n                                SARAH\n                      Thanks, Chuck.  I need the\n\n                      money.  Can I still work the\n                      hours around my classes?\n\n        Breen turns to punch up a display on the restaurant's\n        small accounting computer.  Sarah looks over his shoulder\n        as he modifies the week's schedule.\n\n                                BREEN\n                      Mmm.  Same schedule's okay.\n\n                                SARAH\n                      Alright!\n\n                                BREEN\n                           (gravely)\n                      Can you handle it?\n\n                                SARAH\n                      It's not brain surgery,\n                      Chuck.\n\n        Breen hands her an apron ceremoniously.\n\n                                BREEN\n                      Here you go.  You're a\n                      Bob's Girl now.  Nancy\n                      will check you out.\n\n                                SARAH\n                      I won't let the fat kid down.\n\n                                               CUT TO:\n\n25      OMITTED                                                25\n\n\n26      INT. LOCKER ROOM - DAY                                 26\n\n        ANGLE - TIGHT ON LOCKER DOOR as it slams shut, revealing\n        Sarah transformed into a \"Bob's Girl\".\n        Her hair is in a bun.\n        White blouse.  Short flared skirt and apron with a bow.\n        She resembles a suburbanized peasant maid looking for a\n        goat to milk.\n\n        Sarah confronts her reflection in the mirror, pondering\n        its absurdity.\n        She pinches her sheeks.\n        Smiles vacuously.\n\n                                SARAH\n                      Hi, I'm Sarah and I'll be\n                      you waitress.\n                          (pause)\n                      I'm so wholesome, I could\n                      puke.\n\n                                               CUT TO:\n\n\n27      EXT. PARKING LOT - DAY                                 27\n\n        TIGHT ON CAR SIDE WINDOW, as a figure approaches, reflected\n        in the glass.  A fist punches through the window, shattering\n        it.  The thief unlocks the door and gets behind the wheel.\n        It's Terminator.\n\n                                               CUT TO:\n\n\n28      INT. YELLOW MAVERICK - DAY                             28\n\n        With a blow from the heel of his hand Terminator smashes loose\n        the ignition assembly and strips the wires with a brutal\n        twist of his fingers.  Touching the proper wires he starts\n        the car.\n\n                                               CUT TO:\n\n\n28A     EXT. PAWN SHOP - DAY                                   28A\n\n        Terminator walks past the long display window of an\n        enormous pawnshop emporium.  Signs declare, among other\n        things, GUNS and AMMO is red block letters.\n        Terminator passes the appliance section, and the pictures\n        on a row of TV sets distort and break-up sequentially as\n        he walks by, returning to normal behind him.\n\n        He enters the store.\n\n                                               CUT TO:\n\n\n29      INT. PAWN SHOP - DAY                                   29\n\n        TIGHT ON GLASS COUNTERTOP as an AR-180 ASSAULT RIFLE WITH\n        SCOPE is laid beside a number of other guns: a COLT K-\n        MODEL .45 ACP, a SMITH AND WESSON .38 FOUR-INCH, a BERETTA\n        .225 ACP.\n\n                                TERMINATOR (V.O.)\n                      ...the Remington 1100 Autoloader...\n\n        WIDE as the CLERK, who looks like a sick lizard, pallid\n        and paunchy, takes the rifle from a wall rack.  He lays it\n        beside the arsenal of perfectly legal anti-human artillery\n        already on the glass counter.\n        Terminator scans expressionlessly for additional selec-\n        tions.\n\n                                CLERK\n                      Anything else?\n\n                                TERMINATOR\n                      A phased plasma pulse-laser in\n                      the forty watt range...\n\n                                CLERK\n                           (annoyed)\n                      Just what you see, pal.\n\n        He indicates the display case and wall racks with a\n        minimal gesture.\n\n                                TERMINATOR\n                      The Uzi 9 millimeter.\n\n                                CLERK\n                           (setting  it out)\n                      You know your weapons, buddy.\n\n        Terminator examines each in turn, working the actions with\n        curt, precise movements.\n\n                                CLERK\n                           (continuing)\n                      Any one of them's ideal for\n                      home defense. Which'll it be?\n\n                                TERMINATOR\n                      All.\n\n        The clerk digs deep and finds a scrap of a smile.\n\n                                CLERK\n                      Maybe I'll close early.\n                      Cash or charge?\n\n        Instead of replying, Terminator takes a box of shotgun shells\n        from a stack on the display case.\n\n                                CLERK\n                      Sorry, I can't sell the ammo\n                      with the guns.  You'll have\n                      to---Hey!\n\n        Terminator has calmly begun feeding the shells into the\n        shotgun.\n\n                                CLERK\n                           (continuing)\n                      You can't to that...\n\n                                TERMINATOR\n                           (evenly)\n                      Wrong.\n\n        He raises the barrel and pulls the trigger.  The gun THUNDERS.\n\n                                               CUT TO:\n\n\n30      EXT. GAS STATION/PHONE BOOTH - DAY                     30\n\n        The yellow Maverick pulls to a stop beside a single phone\n        booth.\n\n        MOVING WITH TERMINATOR, as he gets out, walks to the booth\n        and rapidly pulls its occupant out by his greasy T-shirt,\n        flinging him backward into the parking lot.  The guy is\n        bear-like, slab-handed, but Terminator doesn't even glance\n        back as he steps in to take the man's place.\n\n                                MAN\n                           (outraged)\n                      Hey, man...\n\n                                               CUT TO:\n\n31      PHONE BOOTH\n\n        A woman's voice, a faint reedy monologue, issues from the\n        dangling receiver.\n        Terminator leafs rapidly through the directory.\n\n        ANGLE - C.U. PAGES FLIPPING\n\n        ANGLE - MACRO SHOT, as Terminator's finger comes to rest\n        beside a now-familiar listing:\n        CONNOR, SARAH\n\n                                               CUT TO:\n\n\n32      INT. BIG BOB'S/DINING AREA\n\n        Sarah is bustling about, trying to service the start of\n        the dinner rush.  In waitress parlance, she's 'in it'.\n        She runs the gauntlet between tables, precariously balancing\n        two full dinner plates on one arm and hand-carrying a\n        third.  A customer tugs on her apron for attention and she\n        barely averts contributing the chili size to his wardrobe.\n\n                                CUSTOMER\n                      Honey, can I get that coffee\n                      now?\n\n                                SARAH\n                      Yes sir, just a second.\n\n        She reaches her table after near collisions with a Mexican\n        busboy and two teenage girls doing cheerleading routines\n        in lock-step.\n\n                                SARAH\n                      Who gets the Burly Burger?\n\n                                CUSTOMER TWO\n                      I ordered Barbecue Beef.\n\n                                CUSTOMER THREE\n                      Does mine come with fires?\n\n                                CUSTOMER FOUR\n                      He's got the Barbecue Beef,\n                      I've got a Chili-Beef Deluxe.\n\n                                SARAH\n                      Okay, who gets the Burly Beef?\n\n                                CUSTOMER AT NEXT TABLE\n                      Miss, we're ready to order.\n\n\n        In the process of setting down all the plates Sarah knocks\n        over someone's water glass.\n\n                                SARAH\n                           (mopping fran-\n                           tically)\n                      Oh, sorry.  That's not real\n                      leather, is it?\n\n        As she cleans up the spill, a kid at the next booth reaches\n        over and dumps a scoop of ice cream into the top pouch of\n        Sarah's apron\n\n        She stares down at the mess melting over her hard-earned\n        and sags with defeat.  NANCY, a plump, gum-chewing waitress,\n        stops beside her to whisper.\n\n                                NANCY\n                      Look at it this way: in a\n                      hundred years, who's gonna\n                      care?\n\n                                               CUT TO:\n\n33      EXT. SUBURBAN STREET - DAY\n\n        ANGLE on a standard-issue L.A. suburban street with kids\n        racing Big Wheels B.G.\n\n        LOW ANGLE with the FRAME comprising a single house, toy-\n        littered lawn and mailbox.  EXTREME F.G., by the curb, is\n        a CHILD'S PLASTIC TRUCK.\n\n        There is the sound of a CAR ENGINE approaching, and the\n        front of the yellow Maverick appears, stopping at the curb.\n        Its front tire  CRUSHES the toy.\n\n        PANAGLIDE ON TERMINATOR, preceding him as he steps out of the\n        car, pauses by the mailbox to check the name, and strides\n        toward the house.\n\n        A YOUNG BOY, playing in the driveway, watches him pass.  The\n        boy's DOG, a small Terrier, growls low and mean, crouching\n        back from Terminator.\n\n        He rings the doorbell and waits, motionless.\n        The door opens a few inches, held by a security chain,\n        revealing a frail MIDDLE-AGED WOMAN in apron and rubber\n        cleaning gloves.\n\n                                TERMINATOR\n                      Sarah Connor?\n\n                                WOMAN\n                      No, she's upstairs.  Who\n                      shall I say is--\n\n        Terminator breaks the chain and pushes past her as if she\n        didn't exist.\n\n                                               CUT TO:\n\n\n33A     INT. HOUSE/FOYER                                       33A\n\n        PANAGLIDE ON TERMINATOR, preceding his as he crosses the\n        foyer and mounts the stairs.  The woman starts after him.\n\n                                WOMAN\n                      What do you think you're--\n                      My God!\n\n        She gasps and stops in her tracks as Terminator smoothly\n        pulls the .45 from under his jacket and snaps the cocking\n        slide.\n\n                                WOMAN\n                           (screeching)\n                      Oh my God...Sarah!\n\n                                               CUT TO:\n\n33B     INT. BEDROOM                                           33B\n\n        Installed on her bed for an afternoon of 'soaps' is the\n        WRONG SARAH CONNOR.  ELECTRODE PADS exercise her doughy\n        thighs as the 35 year old divorcee watches \"GENERAL HOSPITAL\".\n        She calls out distractedly:\n\n                                WRONG SARAH CONNOR\n                      What is it, Mom?\n\n        She jumps as the door BANGS open.  And stares in dumb\n        amazement as the good-looking, intense-eyed man in the\n        strange clothes raises a pistol.\n\n        And aims it at her face.\n\n        It all seems less real than \"GENERAL HOSPITAL\" in that\n        half-second before he FIRES.\n\n                                               CUT TO:\n\n33C     INT. FOYER                                             33C\n\n        The mother is fumbling with a telephone when she hears\n        the SHOT.  The silence stretches for several BEATS.  Then\n        FIVE MORE SHOTS are heard.\n        The woman screams and drops the phone as she stares upward.\n\n        ANGLE ON CEILING above her.  With each successive shot a\n        chuck of plaster explodes off the ceiling.\n\n                                               CUT TO:\n\n33D     INT. BEDROOM                                            33D\n\n        LOW ANGLE ON TERMINATOR, standing with the .45 aimed\n        down at the dead woman, just OUT OF FRAME on the floor.\n        He unhurriedly removes the spent clip, reloads the weapon\n        and replaces it under his jacket.\n\n        Crouching down, he turns the woman's body over, confirming\n        that she is dead.\n\n                                               CUT TO:\n\n33E     INT. FOYER                                             33E\n\n        The mother is frantically dialing the phone.  She mis-\n        dials, starts over.  Then stops as she hears the bedroom\n        door open.\n\n        Terminator stands at the head of the stairs.\n        His hand is bloody where he grasped the dead woman's\n        shoulder.\n\n        He starts down the stairs.\n        The mother stands paralyzed, unable to breathe.\n        He reaches the main floor and walks toward her.\n        She edges into a corner, eyes wide.\n        He reaches out.\n\n        And wipes his hands clean on her apron.\n\n        Terminator walks out, without expression, leaving the\n        woman to sag to the floor in a faint.\n\n                                               CUT TO:\n\n\n34      INT./EXT. SERVICE TUNNEL - DAY                         34\n\n        TIGHT ON KYLE REESE'S HANDS as they make the last few\n        strokes with a hacksaw to sever the wooden stock from\n        the riot gun.  It clatters to the ground, leaving a short\n        stump, like a pistol grip.\n\n        CUT WIDER as Reese hefts the weapon.  He is crouched in\n        an underground service tunnel below a busy street.  Shadows\n        of people walking across a grating in the sidewalk above\n        him flicker past.  They can't see him in the darkness below\n        their feet as he checks the gun's action carefully.  He\n        slips it under his overcoat where it hangs from a jerry-\n        rigged sling.\n\n                                               CUT TO:\n\n\n35      EXT. STREET - DAY                                      35\n\n        Reese emerges from a stairwell behind a service station,\n        his overcoat done up to the top button.\n        He walks through the sparse morning crowd on the cluttered,\n        overbuilt commercial street.\n        He is out of sync.\n        A stranger in a strange land.\n        He holds himself tightly reined, cautious and feral as he\n        moves among the unconcerned pedestrians.\n        His eyes flick rapidly about.\n        He is seeing this Babylon for the first time.\n\n        Reese stops at a hole-in-the-wall take-out stand.  He\n        watches people walk away with food.  Moves closer.\n        Scrutinizes the next man as he orders.\n\n                                TAKE-OUT CUSTOMER\n                      Gimme a falafel with yogurt\n                      dressing and, uh, Baco-bits.\n\n        The counterman hands him his food and change wordlessly\n        as Reese steps up.\n\n                                REESE\n                      Gimme a falafel with, uh,\n                      yogurt and Baco-bits.\n\n        The counterman barely looks up as he passes the mess\n        through the window.\n\n                                COUNTERMAN\n                      That'll be one-sixty.\n\n        He glances up and Reese is gone.  He leans half out the\n        window.\n\n                                COUNTERMAN\n                           (continuing)\n                      Hey!  Son-of-a-bitch.\n\n                                               CUT TO:\n\n35      EXT. ALLEY - DAY                                       35\n\n        Reese crouches in an alley, out of sight of passersby,\n        wolfing his food.  The sauce runs down his sleeve but he\n        doesn't notice.\n\n                                               CUT TO:\n\n\n35A     INT. BIG BOB'S/DINING AREA - DAY                       35A\n\n        An old man with a shrunken, ungenerous face scowls at\n        the menu as Sarah wipes the tabletop in front of him.\n\n                                SARAH\n                      I haven't seen you in here\n                      lately, Mr. Miller.\n\n                                MR. MILLER\n                      What's it to ya?\n\n                                SARAH\n                      You must have a girlfriend.\n\n                                MR. MILLER\n                      That's none of your business.\n\n                                SARAH\n                      Aha!  Is she young?\n\n        Mr. Miller lowers his menu and glares at her.\n\n                                MR. MILLER\n                      Compared to me she is.  How\n\n                      come you're not at the cash\n                      anymore?  They catch ya steal-\n                      ing?\n\n                                SARAH\n                           (smiling)\n                      What's it to ya?\n\n        When she leaves, the old man is grinning, behind the menu,\n        where no one can see him.\n\n                                               CUT TO:\n\n36      INT. BIG BOB'S/SERVICE CORRIDOR                        36\n\n        Sarah rounds the corner, walking fast as she undoes her\n        apron.  She calls out to the walls without looking up.\n\n                                SARAH\n                      I'm on break, Chuck.  Carla's\n                      got my station.\n\n        As she approaches the locker room where the girls take\n        their coffee breaks, the door bursts open and Nancy\n        beckons to Sarah.\n\n                                NANCY\n                           (excitedly)\n                      Hurry up.  It's about you...\n                      I mean sort of...Come on!\n\n                                               CUT TO:\n\n\n37      INT. BIG BOB'S/BREAK ROOM                              37\n\n        Nancy guides Sarah to the small black and white portable\n        TV in the corner.  Two other girls, smoking cigarettes\n        with their shoes off and nyloned feet on the table, are\n        already watching.  One glances at Sarah.\n\n                                WAITRESS\n                      Hey, Sarah.  This is weird.\n\n        They huddle around the set, intent on a newscast in progress.\n\n                                TV ANCHORWOMAN\n                      ...and a police spokesman at\n                      the scene refused to speculate\n                      on a motive for the execution-\n                      style slaying of the Encino\n                      housewife.  He did however say\n                      that an accurate description of\n                      the suspect has been compiled\n                      from several witnesses.  Once\n                      again, Sarah Connor, thirty-five,\n                      mother of two, brutally shot to\n                      death in her home this afternoon.\n\n        As the news grinds on, Sarah gazes unseeingly at the screen.\n        Nancy claps her on the shoulder, laughing.\n\n                                NANCY\n                      You're dead, honey.\n\n                                               CUT TO:\n\n\n38      EXT. HEALTH CLUB - DUSK                                38\n\n        Sunlight is dying when Sarah swings her moped to the curb\n        in front of the 'GOOD LIFE SPA', a large, crowded health\n        club.\n\n                                               CUT TO:\n\n\n39      INT. HEALTH CLUB/AEROBICS STUDIO                       39\n\n        MUSIC BOOMS and masses of leotarded cellulite sway in close\n        F.G. as CAMERA DOLLIES along a row of panting, stretching\n        women.  In deep B.G. Sarah slips in through the door and\n        waits against the wall while the human dynamo, GINGER VENTURA,\n        leads the class energetically.  Ginger, Sarah's roommate,\n        is a party-stopper.  Red-haired, athletic, sensuous.  She's\n        pretty enough when still, but stunning in motion.  And she's\n        in motion.\n\n        Ginger yells commands and cheerfully dives into contortions\n        to the BEAT of a MOTOWN FAVORITE.\n        MARCO, a handsome, well-defined guy wearing a tight STAFF\n        T-shirt, strolls up for a drink at the water fountain next\n        to Sarah.\n\n                                MARCO\n                      Hi. I've seen you around.\n                      You're cute.  Cute I remember.\n\n                                SARAH\n                      I'm Sarah.  Ginger's roommate.\n\n                                MARCO\n                      Yeah, right.  I'm Marco.\n\n        The dance tape ends.\n\n                                GINGER\n                      ...and three aaand four!  And\n                      that's it ladies!  Now, didn't\n                      that feel good?\n\n        The group collapses ensemble.  A chorus of groans.\n\n                                GINGER\n                      Let's think positive or next\n                      time I'll play the FM version.\n\n        Ginger walks over to Sarah as the class disperses.  Marco\n        is leaning on the wall next to Sarah, who is enjoying the\n        attention.\n\n                                SARAH\n                      ...yeah, really?  Say some-\n                      thing in Italian.\n\n        Before Marco can reply, Ginger pulls the front of his gym\n        shorts out and peers down.  She shakes her head.\n\n                                GINGER\n                      You're wasting your time, kiddo.\n                      Let's go.\n\n        She grabs Sarah by the arm and pulls her out the door.\n        Sarah catches a glimpse of Marco's expression over her\n        shoulder as the door closes.\n\n                                               CUT TO:\n\n40      INT. HEALTH CLUB/STAIRS AND CORRIDOR                   40\n\n        PANAGLIDE WITH THE TWO GIRLS, as they descend to the first\n        floor and enter a hallway\n        Sarah is gasping with laughter.\n\n                                SARAH\n                           (weakly)\n                      I don't believe you did that.\n\n        Ginger is adjusting her ever-present WALKMAN-TYPE CASSETTE\n        PLAYER at her hip.  She slips on the earphones as they walk\n        along.\n        Sarah feigns outrage.\n\n                                SARAH\n                           (continuing)\n                      I had him hooked.  He was\n                      just about to ask me out.\n                      I could tell.\n\n                                GINGER\n                      That guy's a jerk.  I did\n                      you a favor.\n\n                                SARAH\n                      I'll do the same for you\n                      sometime.\n\n        Sarah laughs and claps her friend on the back.  They turn\n        in at a door marked WEIGHT ROOM.\n\n                                               CUT TO:\n\n41      INT. WEIGHT ROOM                                       41\n\n        SEVERAL ANGLES, on glistening arms, legs, torsos merging\n        into bio-mechanical kinetic sculptures with the chrome-steel\n        levers and tubes.  The CRASH and SQUEAL of metal against\n        metal.\n\n        In F.G., two Conan-esque arms thrust upward, glistening.\n        Ginger's boyfriend, MATT McCALLISTER, the assistant manager\n        of the club, strains out his last reps, bench-pressing\n        enormous weight on the Nautilus machine.\n        Despite his imposing appearance, Matt is one of the warmest\n        people you'd ever want to meet.\n        His face is contorted, muscles knotted for the last push.\n        He heaves it up with a guttural cry.\n        Lowering his weights with a CLANG, Matt lies panting, arms\n        dangling at his side, eyes closed.\n        A pair of female legs appear.\n\n                                GINGER (V.O.)\n                           What's this? Sleep therapy?\n\n        Matt opens his eyes.\n\n                                GINGER\n                           (continuing)\n                      You think somebody's gonna\n                      do this for you?  Look at\n                      those shriveled bi's.  And\n                      you haven't worked lat's or\n                      ab's since Wednesday.\n\n                                MATT\n                           (smiling)\n                      Hello, sweetheart.  Had a\n                      rough day?\n\n                                GINGER\n                           (softening)\n                      Come here, wimp.\n\n        She leans down as he sits up and they meet in a kiss that's\n        bad for the other guys' discipline.\n\n        Sarah waits until they break the clinch to speak.\n\n                                SARAH\n                      Hi, Matt.\n\n        Matt look backwards over the bench, and replies, upside-down.\n\n                                MATT\n                           (grinning broadly)\n                      Heeey!  It's my favorite\n                      Sarah.  Hi, babe.\n\n        Ginger pulls the pin on Mat's weights and re-inserts it\n        beneath the entire stack, the maximum weight.\n\n                                GINGER\n                      Alright, warm-ups are over.\n                      Back to work, Bunky.\n\n        Ginger readadjusts her headphones as the two girls walk away.\n\n                                MATT\n                      'Bye beautiful.  You too,\n                      Ginger.\n\n        Two weightlifters nearby look at each other, than at Matt.\n\n                                WEIGHTLIFTER\n                      Bunky?\n\n                                               CUT TO:\n\n42      EXT. HEALTH CLUB/STREETS - DUSK                        42\n\n        Sarah lurches away from the curb on her moped, almost\n        spilling Ginger who is attempting to ride double.  They\n        swing out onto a main thoroughfare and careen through\n        the bumper-to-bumper traffic.\n        Sarah maneuvers deftly though overloaded and unstable.\n        Ginger doesn't know whether to laugh of scream at the\n        near-misses.\n        She does both.\n\n                                               CUT TO:\n\n\n43      OMITTED                                                43\n\n\n44      EXT. STREET/CONSTRUCTION SIGHT - DUSK\n\n        On a side street the girls pass an excavation site  between\n        high-rises.  They pass OUT OF FRAME as CAMERA HOLDS on the\n        construction area and Ginger's shrieks fade.\n\n        In the F.G., under an overpass, Reese sits is a car watching\n        the powerful machines moving earth.\n        He's in a late-model non-descript GREY SEDAN, one of a row\n        of cars gathering dirt beside the construction site.\n        Crab-armed back-hoes and massive caterpillars ROAR through\n        a curtain of dust, under intense floodlights.  A power-shovel\n        moves its great arm, lighting its own way with an arc-light.\n\n                                               CUT TO:\n\n\n45      INT. GREY SEDAN                                        45\n\n        Reese sits motionless in the dark.  Waiting.  The clock in\n        the dash ticks quietly.\n        He flips on the radio.  A fatuous POP ROCK STATION.\n        Reese fishes a magazine off the dirty floor.  His over-\n        coat is off, draped over the shotgun on the seat beside\n        him.\n        His bare arms are sinewy and scarred.\n\n        Reese flips the page of COSMOPOLITAN.\n        He look at the glossy photos, the glossy women.\n        Fantasy women.  Svelte and seamless.\n        The ads fascinate him too: Caribbean vacations and blended\n        whiskeys.\n        His head sags against the door.\n        He gazes dully at the tracks of a passing CATERPILLAR as they\n        chew through the dirt.\n        The ROAD and CLATTER of treads intensifies as his eyes close.\n\n                                               CUT TO:\n\n\n46      EXT. MELTED RUINS - NIGHT                              46\n\n        TIGHT ON A GLEAMING STEEL TREAD as it grinds through debris.\n        The debris is ferroconcrete, girders, and jackstraw heaps of\n        HUMAN BONES, burned black.\n\n        There is the sound of EXPLOSIONS, distant, and an intermittent\n        electronic WHINE.  Incredibly bright searchlights play over\n        the ground.  PANNING with the moving treads through twisted\n        wreckage, F.G.\n        The screen WHITES OUT with a BLAST, very close.  As the\n        debris clatters down, a helmetted head snaps up into FRAME,\n        EXTREME F.G.\n\n        The visor of the HIGH-TECH HELMET is shattered, presumably\n        by the explosion.  The wearer rips it off, revealing a\n        younger Reese, minus his burn scar.\n        His face is bathed in sweat, lit by the glow from a CRT\n        SCOPE-SIGHT on a strange-looking rifle.\n        The sound of SCREAMS and HOARSE SHOUTS not far off, and a\n        continuous low murmuring of RADIO CHATTER, grid coordinates,\n        casualties, unit placements, medic requests.\n\n        Reese looks over his shoulder at his teammate, a GIRL\n        of about sixteen, gaunt, dirty, heavily armed like himself.\n        DOLLYING as they start to belly crawl through the bones\n        and wreckage.\n        Reese looks up.\n        Through spires of a collapsed building a terrifying\n        SPHINX-LIKE SHAPE moves against the sky...obscured by dust\n        and blinding sweeps of its searchlights.\n        Though we see little, this is an H-K,Hunter-Killer\n        mobile ground-unit.\n\n        Reese crawls, pacing the H-K, under and through, on elbows\n        and knees, past mounds of charred skulls.  They\n        pass the BODY OF A CHILD, a boy of about 10, center-\n        punched with a smoking hole.  The boy clutches a rifle.\n        More bodies.  Some in rags, some in uniforms like theirs.\n        WOMEN. OLD MEN. CHILDREN.  They're all dirty and gaunt,\n        scabrous.  And still bleeding.  Reese scrabbles past a\n        dark rat-hole and there are human rats in it.  Some of them\n        are sobbing, or screaming.\n\n        Another EXPLOSION.\n        The GLARE lights the huddled few.\n        Human vermin with mud-caked weapons that haven't been\n        invented yet.  Soldiers in a nightmare war.\n\n        Reese and his teammate stop behind a blasted wall, having\n        outflanked the massive H-K.  Its flashing blue lights flick\n        across the walls, its searchlights sear through the\n        debris.\n\n        WIDER, showing the H-K more clearly...a blast-scarred\n        CHROME LEVIATHON, with hydraulic arms folded mantis-like\n        against its 'torso', and huge underslung GUN TURRETS.\n\n        Reese leaps up and straight-arms a satchel-charge into its\n        path.  One tread rolls over the explosive.\n        Guns and searchlights swivel.  The head turns ponderously.\n        Reese's partner rises, poised to throw hers.\n        A POWER-BOLT catches her at the top of her arc, BLOWING\n        HER INTO RED MIST.\n\n        Reese is knocked down by the concussion.  Gets up, running,\n        as the charges blow.\n        The H-K's tread carriers are RIPPED APART.\n        It lurches to a stop, burning.\n\n        The following SEQUENCE is extremely FORESHORTENED.\n        CUT FAST.  IMPRESSIONS ONLY.\n        Running.\n        Explosions light the ruins like flashbulbs.\n        ENERGY WEAPONS criss-cross the night like tracers.\n        LOW ANGLE, up past the burning H-K as its flying counter-\n        part, an AERIAL H-K, arcs into view with a TURBOJET WHINE.\n\n        Reese hauls two survivors of his unit into a PERSONNEL\n        CARRIER, a CHEVY CAMARO with steel plate welded over it and\n        the roof cut away to access the 50 CALIBER MACHINE GUN.\n        It's stripped and rusted and bullet-riddled, glassless.\n        The TIRES are OFF-ROAD and very gnarly.\n\n        They're driving through the ruins, up and over and through.\n        Reese drives like a demon.  Under other circumstances it\n        would be considered insane.  Here it is merely very good.\n\n        The machine gun CHATTERS.\n        A BLACK SHAPE descends, a demon with searchlights.\n        A BOLT OF LIGHT.\n\n        Reese's car flips like a kicked beer can, rolling and\n        crumpling.  He's pinned in the wreck, bloody, screaming\n        despite his training.  The only other survivor, an\n        emaciated BOY of twelve, is pulling for all he's worth\n        to drag Reese out before it burns.\n\n                                               CUT TO:\n\n\n47      EXT. STREET/GREY SEDAN - NIGHT                         47\n\n        CLOSE ON A BOY, about twelve, clean and healthy, wearing\n        a blue plastic DODGERS HELMET.  He reaches through the\n        window of the sedan.\n\n                                BOY\n                      Hey, mister...?\n\n                                               CUT TO:\n\n\n48      INT. GREY SEDAN                                        48\n\n        Reese's eyes open in a split-second, and suddenly there\n        is a SHOTGUN MUZZLE AIMED RIGHT AT US.\n        Reese quivers with a curious spasm, similar to the tremors\n        of his arrival, and blinks at the boy.\n\n        The boy is white-faced, staring down the bore.  He backs\n        away.  We see that he is straddling a bicycle.\n\n                                               CUT TO:\n\n\n49      EXT. GREY SEDAN - NIGHT                                49\n\n        The boy's SISTER, slightly younger and also on a bicycle,\n        can't see the shotgun from where she's waiting.\n\n                                SISTER\n                           (taunting)\n                      See, I told you he wasn't\n                      dead.  You owe me Baskin\n                      Robbins.\n\n        The boy rides past her list a shot.\n\n                                BOY\n                           (urgently)\n                      Come on.  Just come on.\n\n                                               CUT TO:\n\n\n50      INT. GREY SEDAN                                        50\n\n        Reese relaxes slowly, the voltage draining out of him.\n\n        INSERT - MACRO, Reese's finger on the trigger is white\n        with pressure.  He slips the safety to the OFF position.\n        The gun can now be fired.\n\n        He sets it on the seat and reaches for the dangling ignition\n        wires, starting the car.\n\n                                               CUT TO:\n\n\n51      EXT. STREET/OVERPASS - NIGHT                           51\n\n        Lit by streetlights, the car moves away with it lights\n        off and vanishes in the shadows.\n\n                                               CUT TO:\n\n\n52      OMITTED                                                52\n\n53      INT. SARAH'S APARTMENT/BATHROOM/LIVING ROOM - NIGHT    53\n\n        Sarah and Ginger are crammed into the tiny bathroom,\n        becoming inextricably tangled in each other's cords as\n        they blow-dry, curl hair, and apply make-up.  Ginger\n        has her headphones inverted under her chin but in place,\n        and is bouncing to music as she dries her hair.  She is\n        wearing a short terry-cloth bathrobe that reveals the\n        greater part of her legs.  Sarah is in a skirt and bra.\n\n        The phone rings and Sarah goes out into the living room\n        to get it.\n\n                                SARAH\n                           (answering the\n                           phone)\n                      Hello?\n\n                                VOICE (V.O.)\n                           (on phone, deep\n                           and breathy)\n                      First I'm going to rip the\n                      buttons off your blouse, one\n                      by one...then run my tongue\n                      along your neck, down to your\n                      bare, gleaming breasts...\n\n        Sarah cups her hand over the mouthpiece and calls out\n        matter-of-factly:\n\n                                SARAH\n                      Ginger!  It's Matt.\n\n        She resumes listening.\n\n                                MATT (V.O.)\n                      ...and then slowly pull your\n                      jeans off inch by inch and\n                      lick your belly in circles,\n                      further and further down...\n                      then I'll pull off your panties\n                      with my teeth...\n\n        Sarah is repressing laughter.\n\n                                SARAH\n                           (crossly)\n                      Who is this?\n\n        Silence.  Then Matt realizes to his horror who he's been\n        talking to.\n\n                                MATT (V.O.)\n                      Oh my God!  Sarah!  Oh, shit.\n                      Jesus, I'm sorry.  I thought\n                      you were...Can I talk to Ginger?\n\n                                SARAH\n                      Sure, Bunky.\n\n        As Ginger approaches, Sarah hands her the receiver and\n        goes into the bedroom.\n\n                                GINGER\n                      Hello?\n\n                                MATT (V.O.)\n                      First I'm gonna rip the buttons\n                      off your blouse...\n\n                                               CUT TO:\n\n\n54      BEDROOM\n\n        Sarah picks up four blouses on hanger lying on the bed\n        and goes back into the hallway.\n\n                                               CUT TO:\n\n\n55      INT. LIVING ROOM\n\n        Ginger is still listening to Matt, nodding, as Sarah enters\n        and starts holding the blouses against herself one by one\n        for Ginger's inspection.\n\n                                SARAH\n                      What do you think?\n\n                                GINGER\n                           (covering mouth-\n                           piece)\n                      Great.\n\n        Sarah hold up another one.\n\n                                SARAH\n                      How about this?\n\n                                GINGER\n                      Great.\n\n                                SARAH\n                      You're a big help.\n\n                                GINGER\n                           (advisory tone)\n                      Alright, the beige one.\n\n                                SARAH\n                      I hate the beige one.\n\n                                GINGER\n                           (same advisory\n                           tone)\n                      Don't wear the beige one.\n\n        Sarah gathers up the blouses and walks out.\n\n                                SARAH (V.O.)\n                      This guy's probably a schmuck\n                      and I don't care what I wear.\n\n        A couple of BEATS, and she's back in the doorway with\n        a concerned expression.\n\n                                SARAH\n                           (continuing)\n                      You think the beige?\n\n                                               CUT TO:\n\n\n56      EXT. VENICE STREET - NIGHT\n\n        An unmarked car with a clamp-on light and siren blaring\n        screeches to the curb behind two marked black-and-whites\n        in front of a funky Venice apartment building.  A small\n        crowd  is gathered around the front steps.  LIEUTENANT\n        ED VUKOVICH, Homicide Division, gets out of the car and\n        strides through the crowd.  He's fiftyish, short, but\n        square and solid, a human bulldog gone a little to paunch.\n        He chews Juicy Fruit gum like a maniac: a chain-chewer.\n        He's homely as an old boot.  And he's not a smart cop, he's\n        a wise one; rarer still.  The onlookers, gathered patiently\n        for their ten second glimpse of something under a sheet,\n        separate for him to pass.\n\n                                               CUT TO:\n\n\n57      INT. VENICE APARTMENT BUILDING/STAIRWELL/APARTMENT\n\n        CAMERA PANAGLIDES AHEAD OF VUKOVICH, as he climbs the switch-\n        back staircase two steps at a time.  He passes TWO UNIFORMED\n        COPS at the doorway of a second-floor apartment, and enters\n        to find a quiet flurry of activity.  Several DETECTIVES and\n        a PHOTOGRAPHER prowl around, taking evidence, taking pictures.\n\n        In the center of the living room floor is the body of a\n        young woman, crumpled face down in a small lake of blood.\n        Two bags of groceries lie split open on the floor in front\n        of her.\n\n        Vukovich glances up as he is joined by DETECTIVE SGT.\n        TRAXLER.  Traxler is black, lean and very jaded.\n\n                                VUKOVICH\n                      Give me the short version.\n\n                                TRAXLER\n                      Six shots at less than ten\n                      feet.  Weapon was a large\n                      caliber--\n\n        Vukovich is looking at the body.\n\n                                VUKOVICH\n                      No shit.\n\n        Traxler turns to a passing DETECTIVE.\n\n                                TRAXLER\n                      Come on. man.  Don't track\n                      it all over.  It's un-\n                      professional.\n\n        He turn back to Vukovich, gesturing at the body.\n\n                                TRAXLER\n                           (continuing)\n                      Okay, let's see...Got a pos-\n                      itive on her.  She's Sarah\n                      Connor, works as a legal--\n\n\n                                VUKOVICH\n                           (interrupting)\n                      That can't be right.  That's\n                      the name of the one Valley\n                      Division mopped up this after-\n                      noon.\n\n        Traxler slips something off his clipboard and hands\n        it to the Lieutenant.\n\n                                TRAXLER\n                      Here's her driver's license.\n\n                                VUKOVICH\n                           (pondering)\n                      You gotta be kidding me.  The\n                      new guys'll be short-stroking\n                      it over this one.  A one-day\n                      pattern killer.\n\n                                TRAXLER\n                      I hate the weird ones.\n\n                                               CUT TO:\n\n\n58      INT. SARAH'S APARTMENT/BATHROOM                        58\n\n        Sarah poses with Ginger in front of the mirror.  They are\n        dressed, made-up, hair-styled and READY.\n\n                                GINGER\n                           (studying their\n                           reflection)\n                      Better than mortal man deserves.\n\n        Sarah grins and goes into the other room.\n\n                                               CUT TO:\n\n\n59      INT. LIVING ROOM\n\n        Sarah walks around the room, searching for something.\n\n                                SARAH\n                           (calling)\n                      Ginger, have you seen Pugsley?\n\n        Ginger enters, stopping beside their phone answering machine.\n\n                                GINGER\n                      Not lately.  Did you check\n                      messages?\n\n                                SARAH\n                           (still looking)\n                      I thought you did.\n\n        She checks under the couch, then behind the drapes.  She\n        bends down.\n\n                                SARAH\n                           (from beside cur-\n                           tains)\n                      Come here young man.  Mind\n                      your mother.\n\n        C.U. - PUGSLEY, as the GREEN IGUANA cocks its head, blinking\n        vapidly.\n\n        RESUME WIDE, Sarah lifts the three foot long lizard from his\n        perch on the windowsill.  She gives the complacent reptile\n        a kiss on its blunt snout.\n\n                                GINGER\n                           (groaning)\n                      Totally nauseating.\n\n        Sarah drapes the lizard across her shoulders where it sits\n        contentedly as she looks for her purse.  Ginger has been\n        rewinding the message tape.  She punches PLAY and a MALE\n        VOICE is heard.\n\n                                VOICE\n                           (recorded)\n\n                      Hi, Sarah...Stan Morsky.\n                      Uh, something's come up and\n                      it looks like I won't be able\n                      to make it tonight.  I'm really\n                      sorry.  Call you in a day or so.\n                      Sorry.  'Bye.\n\n        Sarah stands still, crestfallen.\n\n                                GINGER\n                      That bum.  So what if he has\n                      a Porsche, he can't treat you\n                      like that...it's Friday night\n                      for crissakes.\n\n                                SARAH\n                           (slumping)\n\n                      I'll live.\n\n                                GINGER\n                      I'll break his kneecaps.\n\n        Sarah resignedly slips Pugsley off her shoulders.\n\n                                SARAH\n                      You still love me, don't\n                      you, Pugsley?\n\n        She places Pugsley in a large terrarium with a 'BEWARE OF\n        DOG' sign taped on the side.\n\n                                SARAH\n                           (continuing)\n                      I'm going to a movie, kiddo.\n                      See ya'.  You and Matt have\n                      a good time.\n\n                                GINGER\n                           (as Sarah exits)\n                      We will, kiddo.\n\n                                               CUT TO:\n\n\n60      INT. PARKING GARAGE - NIGHT\n\n        Sarah is a small figure in the shadowed echoing garage of\n        her building.\n\n        CONVERGING DOLLY, PACING HER, as she passes the stalls with\n        their inky shadows.\n        The light near her moped is out.\n        She fumbles in the dark to unlock the chain.\n        She looks up.\n        Did she hear something...masked by the rattle of the chain?\n\n        POV - SARAH, there is no movement for the length of the\n        garage.\n\n        ON SARAH - C.U., inexplicably nervous.\n        She stows the chain and starts the bike.  It whines\n        reassuringly.\n        Sarah jumps on and whirs out of the garage.\n\n                                               CUT TO:\n\n\n61      INT. CAR/NEARBY - NIGHT                                61\n\n        Sarah is visible through the windshield as she pulls onto\n        the street.\n\n        PAN WITH HER to reveal Kyle Reese, hunched down in shadow,\n        watching.  He puts the car in gear and pulls out to follow\n        her receding tail-light.\n        Streetlights flash across his face, in stark-lines profile.\n        Mouth cruel where the scar tugs at it.\n\n                                               CUT TO:\n\n62      INT. DIVISION HEADQUARTERS - NIGHT                     62\n\n        DOLLYING WITH VUKOVICH and TRAXLER, as they pass through a\n        group of REPORTERS.  Mostly newspaper stringers but there\n        is also one bored local TV MINICAM CREW.\n\n                                REPORTER\n                      ...Lieutenant, are you aware\n                      that these two killings occurred\n                      in the same order as their listings\n                      in the phone book?\n\n                                VUKOVICH\n                      No comment.\n\n        He and Traxler enter their office and shut the door.\n\n                                               CUT TO:\n\n\n63      VUKOVICH'S OFFICE                                      63\n\n        Vukovich drops his gun in the wastebasket, picks up a cup\n        of coffee from his desk and uses it to wash down a handful\n        of aspirins.  Traxler grimaces.\n\n                                TRAXLER\n                      That stuff's two hours cold.\n\n                                VUKOVICH\n                           (nodding ab-\n                           sently)\n                      I know.\n\n                                TRAXLER\n                           (eyeing him)\n                      I put a cigarette out in it.\n\n        Vukovich, lost in thought, turns on him suddenly.\n\n                                VUKOVICH\n                      Did you reach the next girl\n                      yet?\n\n                                TRAXLER\n                      No.  Keep getting an answer-\n                      ing machine.\n\n                                VUKOVICH\n                      Send a unit.\n\n                                TRAXLER\n                      I already did.  No answer at\n                      the door and the apartment\n                      manager's out.  I'm keeping\n                      them there.\n\n                                VUKOVICH\n                      Call her.\n\n                                TRAXLER\n                      I just called.\n\n                                VUKOVICH\n                      Call her again.\n\n        Traxler picks up the phone and begins to dial her number\n        as Vukovich sets down his coffee cup, unwraps a stick of\n        gum and pops it in his mouth.\n\n                                VUKOVICH\n                           (continuing)\n                      Got a cigarette?\n\n                                               CUT TO:\n\n\n64      INT. SARAH'S APARTMENT - NIGHT                         64\n\n        CLOSE ON PHONE, connected to the answering machine.  The\n        outgoing message trigger after the second ring.\n\n                                GINGER'S VOICE\n                           (machine V.O.)\n                      Hi there.\n                           (long pause)\n                      Ha ha ha, fooled you. You're\n                      talking to a machine, but don't\n                      by shy, it's okay.  Machines need\n                      love too, so talk to it and Ginger,\n                      that's me, or Sarah will get back\n                      to you.  Wait for the beep.\n\n        As the message plays, CAMERA DOLLIES OFF the phone machine\n        and down the corridor of the dark apartment.  As the bedroom\n        door draws near, Ginger's recorded voice fades and is super-\n        ceded by CRIES and MOANS.\n\n                                               CUT TO:\n\n\n65      INT. BEDROOM                                           65\n\n        FULL SHOT, framed against the streetlit curtains, Ginger and\n        Matt from a beautiful tableau of lovemaking in silhouette.\n        Their perfect bodies glisten with backlight as they strain\n        in passion.\n\n        CLOSER - TIGHT TWO, revealing that Ginger is wearing her\n        earphones.  Matt, without breaking rhythm, reaches out to\n        the night table and thumbs the volume higher.\n\n        Ginger cries out louder, apparently enjoying his sure touch\n        on her volume control.\n\n                                               CUT TO:\n\n\n66      INT. DIVISION HEADQUARTERS - NIGHT                     66\n\n        Traxler hangs up the phone.\n\n                                TRAXLER\n                      Same shit.\n\n                                VUKOVICH\n                      I can hear it now, it's gonna\n                      be the goddamned 'Phone Book\n                      Killer'.\n\n                                TRAXLER\n                      I hate the press cases.\n                      Especially the weird press\n                      cases.  Where you going?\n\n\n                                VUKOVICH\n                           (heading for\n                           the door)\n                      To make a statement. I'm gonna\n                      give them the name.  Maybe the\n                      jackals can help us out for\n                      once.\n\n        He looks at his watch, then straightens his tie.\n\n                                VUKOVICH\n                           (continuing)\n                      If they can get this on the\n                      tube by eleven, she may just\n                      call us.\n                           (pause)\n                      How do I look?\n\n                                TRAXLER\n                      Like shit, boss.\n\n        Vukovich goes out and the Minicam light hits him as the\n        door closes.\n\n                                               CUT TO:\n\n67      INT. PIZZA PARLOR - NIGHT                              67\n\n        TIGHT ON A TV SCREEN, a news cast in progress.\n\n                                ANCHORMAN (V.O.)\n                      ...police had no further comment\n                      on the apparent similarity between\n                      the shooting death of an Encino\n                      woman earlier today...\n\n        CUT WIDE to show Sarah watching the TV which is suspended\n        over the bar.  The place is a crowded, post-movie hangout,\n        raucous with laughter and videogames.  The newscast\n        continues, ignored by all except Sarah.\n\n                                ANCHORMAN (V.O.)\n                           (continuing)\n                      ...and this almost identical\n                      killing two hours ago of a\n                      Venice resident with virtually\n                      the same name.  Sarah Ann Connor,\n                      a 24 year old legal secretary, was\n                      pronounced dead at the scene in\n                      her beachfront apartment...\n\n        A customer gestures for the bartender's attention.\n\n                                CUSTOMER\n                      Hey, can we change this and\n                      catch the ball scores.\n\n                                BARTENDER\n                           (reaching for the\n                           knob)\n                      Sure.\n\n        Sarah leaps half over the bar, startling everyone.\n\n                                SARAH\n                           (shouting)\n                      Leave it where it is!\n\n                                ANCHORMAN (V.O.)\n                      ...no other connections between\n                      the two victims has been estab-\n                      lished.\n                           (pause)\n                      On a lighter note, these was\n                      cause for celebration at the\n                      L.A. Zoo today, as...\n\n        Sarah leaves her half-finished pizza and beer, getting up\n        in a daze.  Followed by puzzles glances, she makes her way\n        through the crowd.\n\n                                               CUT TO:\n\n68      INT. PIZZA PARLOR HALLWAY                              68\n\n        In the crowded hallway by the restrooms, Sarah goes to the\n        single payphone and seizes the directory.  She flips rapidly\n        through it, then stops, looking down.\n        She sees that her name is next on the list.\n        The book slips out of her fingers.\n        Sarah turns and scans the crowd.\n        She's getting looks, covert and otherwise, like any unaccom-\n        panied girl on a Friday night.  But is that all they mean?\n\n        Sarah back into the women's restroom.\n\n                                               CUT TO:\n\n69      INT. RESTROOM                                          69\n\n        Sarah stumbles numbly to the sink.\n        She splashes her face with cold water.  In the mirror\n        her terrified reflection looks back.  Why me?\n        She hears a loud clatter and spins around.\n        It's just a drunken woman fumbling with a toilet stall door.\n        Sarah edges back out into the corridor.\n\n                                               CUT TO:\n\n70      INT. HALLWAY                                           70\n\n        Sarah walks stiffly to the pay phone.\n        It's OUT OF ORDER.\n\n                                               CUT TO:\n\n71      EXT. STREET/SIDEWALK - NIGHT                           71\n\n        Sarah exits the pizza place into the sparse crowd on the\n        sidewalk.  As she passes a figure leaning against the wall\n        just outside, the man turns his head to watch her.\n        It is Reese, his gaze impassive.\n        Streetlight catches the burn scar on his cheek.\n        He is motionless, sinister in his long coat.\n        Sarah shudders.\n        She walks on.\n\n        POV - SARAH, ON CROWD, moving toward and through approaching\n        groups of pedestrians.  They seem to be glancing at her.\n        Was it always like that and she just never noticed?\n\n        C.U. - SARAH as she look over her shoulder.\n\n        POV - SARAH, ON PIZZA PARLOR DOORWAY.  Reese is gone.\n        She resists the urge to run.\n        On the opposite side of the street an  LAPD cruiser glides\n        slowly by.  Sarah is about to call out but a bus blocks\n        her view and when it had passed, the car is turning away\n        down a side street.\n\n        She passes a large window with STOKER'S written on it, and\n        ducks quickly through the door.\n\n                                               CUT TO:\n\n\n72      INT. STOKER'S - NIGHT                                  72\n\n        ANGLE THROUGH WINDOW, SARAH F.G., as Reese approaches.\n        Her knuckles clench white as he reaches the entrance and\n        walks by, unhurriedly, without a glance inside.\n        She turns and scan the gloomy interior, which reveals itself\n        to be less than savory.  Pool tables and upper-middle lowlife\n        in submarine depths of smoky haze.\n\n        Sarah draws stares, menacing in their own right, as she\n        weaves between the pool tables to the back of the bar.\n        her hands are trembling as she drops a dime in the pay\n        phone and dials.\n\n                                VOICE (V.O./RECORDED)\n                      You have reached the Los Angeles\n                      Police Department Emergency Number.\n                      All lines are busy.  If you need\n                      a police car sent out to you, please\n                      stay on the line...\n\n        Sarah holds the receiver pressed to her ear, glancing\n        around, fear feeding on frustration.\n\n                                               CUT TO:\n\n\n73      EXT. SARAH'S APARTMENT BUILDING - NIGHT                73\n\n        An LAPD black-and-white sits at the curb in front of Sarah's\n        building with two cops inside, drinking coffee.  Through\n        the open window we hear the dispatcher's voice on the\n        radio.\n\n                                DISPATCHER (V.O.)\n                      ...two eleven in progress at\n                      Seven-Eleven market, Third and\n                      Tamarac.  One suspect believed\n                      to be armed...\n\n        The car pulls out with lights and siren on.\n        A moment later, Terminator rounds the corner of the building\n        and climbs the stairs to the entryway.\n        He surveys the bank of call buttons, then turns to consider\n        the barred security gate.\n\n                                               CUT TO:\n\n\n74      INT. SARAH'S APARTMENT - NIGHT                         74\n\n        PANAGLIDE WITH GINGER as she ties her terry-cloth robe and,\n        leaving Matt in a dead sleep, pads through the dark apartment.\n        Down the hall, past the phone with Traxler's message.\n        Through the dark living room.\n        She has her Walkman in the pocket of her robe and bops to\n        herself in the silent gloom as she enters the kitchen.\n\n        When she opens the refrigerator to remove snack fixings, the\n        light briefly illuminates the kitchen and in that moment,\n        SOMETHING MOVES in the F.G.\n\n        TIGHT ON GINGER, MOVING WITH HER as she backs toward the\n        counter with her arms full of snack stuff.\n\n        A SUDDEN CRASH.  A flurry of motion behind her.\n        She spins, dropping half her load.\n        Ginger fumbles for the lightswitch.\n\n        Revealing Pugsley, sitting there blinking innocently among\n        overturned spice bottles on the counter-top.\n\n                                GINGER\n                      Shoo.  Go on.  I'll make a\n                      belt out of you.\n\n        Pugsley disappears into a large fern by the window and Ginger\n        sets about her task, slathering crunchy peanut butter on\n        stalks of celery.\n\n                                               CUT TO:\n\n\n75      INT. BEDROOM                                           75\n\n        MEDIUM ON MATT, as rustling curtains play patterns of street-\n        light over his sleeping face.\n        The sound of a faint breeze.\n        In the B.G. is the balcony, empty.  The sliding door is open.\n\n        TIGHT ON MATT, as his eyes open at the sound of a quiet,\n        repeated CLICKING.\n\n        UP ANGLE - PAST MATT, as the five-inch blade of an industrial\n        razor-knife reaches full extension in Terminator's hand,\n        right above him.\n        It slashes viciously downward.\n        Matt rolls and the pillow is SLIT OPEN where his throat had\n        been.\n\n                                MATT\n                      Whoah!\n\n        Terminator catches him by the hair and slashed down again.\n        Matt grabs the wrist in both hands.\n        The enormous muscles of his arms, which seem capable of bench\n        pressing a Chrysler, strain and knot against the pressure of\n        the killer's single arm...\n        And still the blade moves closer to his throat.\n\n        With a final heave Matt deflects the down-pressure sideways\n        and the blade snaps with a CLINK against the headboard.\n\n        HANDHELD WITH MATT as he rolls off the bed, spins and slams\n        his fists together into Terminator's temple.  He picks up a\n        brass deco lamp and brings it down with piledriver force.\n\n        Unperturbed, Terminator knocks the lamp away and hurls Matt\n        over the bed.\n\n                                               CUT TO:\n\n\n76      EXT. BALCONY - NIGHT                                   76\n\n        Matt crashes through the glass doors and slams against the\n        balcony railing.\n\n                                               CUT TO:\n\n\n77      INT. KITCHEN                                           77\n\n        Oblivious to the noise, Ginger croons in rock-and-roll\n        ecstasy, singing to a celery stalk as if it were a micro-\n        phone.\n\n                                               CUT TO:\n\n\n78      EXT./INT. BALCONY AND BEDROOM - NIGHT                  78\n\n        Matt heaves himself up, powerful body gleaming with sweat\n        and hurls himself upon the intruder.\n        The titans CRASH INTO A DRESSER, reducing it to kindling.\n        Then into the closet door, EXPLODING THE FULL-LENGTH MIRROR.\n\n        Terminator places one hand on either side of Matt's barrel\n        chest.  SINKS HIS FINGERS INTO THE FLESH.  An inhuman grip.\n        Matt is raised off the floor, contorted with agony, above\n        the other's head.\n\n                                               CUT TO:\n\n\n79      INT. HALLWAY                                           79\n\n        DOLLY PRECEDING GINGER as she returns from the kitchen with\n        a plate full of celery stalks and a glass of milk.  CAMERA\n        passes the closed bedroom door and STOPS, as Ginger pauses\n        to set the plate on top of the glass, freeing one hand to\n        open the door.\n\n        AN EXPLOSION OF SPLINTERS in close F.G. as a shape smashes\n        through the door right in front of her...Matt's body\n        propelled halfway through the door by enormous force.\n        Ginger shrieks and leaps back, flinging milk and all into\n        the air.\n\n        The door begins to open the pressure of Matt's body\n        creates resistance.\n        Ginger SCREAMS and back away.\n\n        The door is wrenched open and Terminator steps through with\n        the massive .45 drawn.\n\n        HANDHELD WITH GINGER, the walls blur by as she runs.\n\n        TIGHT ON TERMINATOR as the pistol RISES INTO FRAME, aligning\n        with his eyes.  BOOM!\n\n        LOW FAST DOLLY WITH GINGER as the bullet punches into her\n        shoulder, pitching her on her face outside the bathroom door.\n\n        LOW WIDE ANGLE as she crawls forward, gasping, drowning.\n        The implacable figure looms behind her.\n        Her expression is agony and reeling, nauseating terror.\n        And incomprehension: Why am I suddenly dying?\n        Her eyes roll, showing the whites, like a horse tethered in\n        a burning stable.\n\n                                               CUT TO:\n\n80      INT. BATHROOM                                          80\n\n        Ginger scrabbles pathetically for a grip on the tile floor\n        as she pulls herself into the bathroom.\n        She clutches the rim of the toilet.\n\n        LOW ANGLE PAST HER, ON TERMINATOR, as he stands behind her.\n        PAN UP, off her.  He takes aim.\n        And empties the clip.\n        He calmly reloads.\n\n                                               CUT TO:\n\n\n81      INT. HALLWAY/BEDROOM                                   81\n\n        CLOSE ON PHONE MACHINE, as the telephone rings loudly in the\n        ensuing silence.\n        Terminator spins, drawing an instantaneous bead on the source\n        of the sound, but doesn't fire.\n\n                                GINGER'S VOICE\n                           (recorded)\n                      Hi there.\n                           (pause)\n                      Ha ha ha, fooled you.  You're\n                      talking to a machine...\n\n        C.U. - TERMINATOR, motionless, listening.\n\n                                GINGER'S VOICE\n                           (recorded, continuing)\n                      ...but don't be shy, it's okay.\n                      Machines need love too...\n\n        Terminator turns abruptly back to Ginger's body.  He turns\n        it over, assuring himself that she is dead.\n\n                                GINGER'S VOICE\n                           (continuing, recorded)\n                      ...so talk to it and Ginger, that's\n                      me, or Sarah will get back to you.\n                      Wait for the beep.\n\n        There is a loud tone and the incoming call is heard.\n\n                                SARAH'S VOICE\n                           (on machine)\n                      Ginger, this is Sarah...\n\n        Terminator's head snaps back and he freezes, listening.\n        He rises slowly as Sarah's voice continues.\n\n        TIGHT ON HIS UNBLINKING EYES.\n\n                                SARAH'S VOICE\n                           (on machine, contin-\n                           uing)\n                      ...I'm in this sleazy bar called\n                      Stoker's on Pico but I'm too\n                      scared to leave.  I'm really\n                      scared, kiddo...\n\n                                               CUT TO:\n\n\n82      INT. STOKER'S BAR - NIGHT                              82\n\n        Sarah cups the telephone's mouthpiece with her hand and\n        glances around frequently.\n\n                                SARAH\n                           (continuing, into\n                           phone)\n                     ...I think somebody's after me\n                     and I sure hope you play this\n                     soon 'cause I need you and Matt\n                     to come pick me up.  The police\n                     keep transferring me around, but\n                     I'm going to try them again.\n\n                                               CUT TO:\n\n\n83      INT. SARAH'S APARTMENT/BEDROOM - NIGHT                 83\n\n                                SARAH\n                           (continuing, B.G.)\n                      The number here is 468-9175.\n                      Call me, kiddo.  I need you.\n                      It's Stoker's on Pico. Bye.\n\n        Terminator is rapidly and methodically rifling the contents\n        of Sarah's small desk.  SIREN'S WAIL, approaching.\n        He picks up a small card.\n\n        E.C.U. - CARD. It is Sarah's college I.D. card, complete with\n        color photo of her.\n\n        MACRO ON PICTURE.\n\n        E.C.U. - TERMINATOR'S EYES as he tosses the card down,\n        after a fraction of a second's scan.  Picks up something else.\n\n        TIGHT ON SARAH'S ADDRESS BOOK, Terminator pockets this and\n        slips out the balcony door.  Climbing over the railing, he\n        is gone.\n\n                                               CUT TO:\n\n\n84      INT. STOKER'S BAR - NIGHT                              84\n\n        Sarah is huddled, back to the wall, beside the phone.\n\n                                SARAH\n                           (on phone, upset)\n                      ...look, Lieutenant...uh,\n                      Vukovich, don't put me on\n                      hold and don't transfer me\n                      to another department...\n\n                                               CUT TO:\n\n\n85      INT. VUKOVICH'S OFFICE - NIGHT                         85\n\n                                VUKOVICH\n                           (on phone)\n                      I won't.  Now just relax.\n                      Where are you?\n                           (pause)\n                      Yeah, I know it...on Pico.\n                      Are you alright?\n\n                                               CUT TO:\n\n\n86      INT. STOKER'S BAT - NIGHT                              86\n\n                                SARAH\n                           (on phone)\n                      Yes, but I don't want to\n                      leave.  I think this guy's\n                      following me.\n\n                                               CUT TO:\n\n\n87      INT. VUKOVICH'S OFFICE - NIGHT                         87\n\n                                VUKOVICH\n                           (on phone)\n                      Alright, Ms. Connor.  Listen\n                      carefully.  You're in a public\n                      place, you'll be safe 'til we\n                      get there.  Stay visible.\n                      Don't go outside or in the\n                      restroom.  I'll be there in\n                      a few minutes.\n\n        He hangs up and grabs his coat, motioning to Traxler.\n\n                                VUKOVICH\n                      Let's roll.\n\n                                               CUT TO:\n\n\n88      INT. STOKER'S BAR - NIGHT                              88\n\n        Sarah takes a seat at a booth near the bar, and picks up\n        a dog-eared menu, but can't concentrate on it.  She looks\n        at her watch and glances around.\n\n                                               CUT TO:\n\n\n89      EXT. STREET - NIGHT                                    89\n\n        The yellow Maverick hurtles along an empty street.\n\n        CLOSER ANGLE as streetlight glare slashes across Terminator's\n        face in flaring pulses.\n\n                                               CUT TO:\n\n\n90      INT. PLAIN CAR - NIGHT                                 90\n\n        Vukovich draws his Colt Python .357 Magnum and check the\n        load.  Traxler is driving.\n\n                                VUKOVICH\n                      Let's see how this guy likes\n                      playing hard-ball.\n\n                                               CUT TO:\n\n\n91      INT. STOKER'S BAR - NIGHT                              91\n\n        The waitress set a cup of coffee in front of Sarah.\n\n                                WAITRESS\n                      Anything else?\n\n        Sarah shakes her head \"No\" and contemplates her trembling\n        hands.  She half-turns, catching a glimpse of herself in\n        the mirror behind the bar.\n\n        TIGHT ON SARAH, reflected in the mirror.  In the F.G. a\n        man at the bar looks up from his beer, straight into her eyes.\n        It is Reese.\n        He gazes at her coolly for a moment, then glances away.\n\n        C.U. - SARAH, feeling trapped, frantic.\n\n        ANGLE ON FRONT DOOR as it opens and a figure stands silhou-\n        etted briefly against a streetlight.\n\n        Reese turns, his eyes flickering to the mirror, the figure.\n\n        C.U. - REESE as he mechanically raises his beer.  His knuckles\n        are white.  He slowly undoes the top button of his overcoat.\n        There is a glint of metal in the shadows within.\n        Reese turns slowly on his barstool as the figure brushes past\n        him, out-of-focus F.G.\n        Sarah looks up.\n\n        E.C.U. - REESE'S HAND sliding slowly along polished steel,\n        a caress.  His finger slips through the triggerguard of the\n        riot gun.\n\n        MEDIUM ON SARAH, as the man stops in front of her in close F.G.\n        He sits slowly in the booth opposite her.  The angle is OVER\n        HIS SHOULDER.\n\n                                SARAH\n                           (uncertainly)\n                     Lieutenant Vukovich?\n\n        REVERSE ANGLE - It is not Lt. Vukovich.\n        Terminator sits motionless for a BEAT.\n        Blue eyes so pure and deep.  The eyes of a saint, perhaps.\n\n        The .45 is out and cocked and AIMED DIRECTLY AT CAMERA, almost\n        in one motion.\n        The bore seems enormous.\n\n        BACK ON SARAH, over the gun barrel, her eyes go wide.  We hold\n        a BEAT, like a frozen slice of nightmare.\n\n        MEDIUM ON REESE as he whips the riot-gun to a hip-firing posi-\n        tion, his overcoat falling back with a snap.  HE FIRES.\n\n        ON TERMINATOR, as the shotgun blast hits his arm and he FIRES,\n        simultaneously.  Sarah screams as the .45 round blows stuffing\n        out of the booth seat inches from her face.  Her hair is\n        singed by burning gunpowder.  An involuntary cry is punched\n        out of her by the double concussions.\n\n        Reese is stroking up another shell as Terminator half-rises\n        from booth.\n\n        OVER REESE'S SHOULDER, as he fires, cocks the slide, fires\n        again, advancing on Sarah's booth.\n        Terminator is blown backward over the center divider,\n        crashing through the glasses and pitchers of beer on the\n        table opposite, and onto the floor.\n\n        Sarah is screaming, scrunched down in the booth.\n\n        Terminator is lying on his back at the feet of a table-\n        full of drunk patrons.\n        He has two rifled 12 gauge slugs in his chest and one\n        in the arm.\n\n        The bar customers are frozen in the weird tableau, cowering,\n        gaping.\n        Sarah stops screaming.\n        Reese stand motionless, gun aimed.\n        In the sudden silence, the sound of him cocking the shotgun\n        is abnormally loud.\n\n        ON TERMINATOR, very still.\n        Then he smoothly rolls to a crouch and slips the UZI machine\n        pistol from beneath his overcoat, where it has been hang-\n        ing on a shoulder strap.\n        He doesn't seem too impaired as he swings around to fire.\n\n        Reese rolls like a cat and comes up firing.\n        A burst from the UZI rakes the bar where he stood.\n        An orgy of shattering glass.\n        Total pandemonium.\n\n        SEVERAL ANGLES  as patrons of the bar run, scream or dive\n        for cover, depending upon their level of intelligence.\n\n        Reese slides through the glass to Sarah's booth and seizes\n        her wrists.\n\n        ON TERMINATOR, kneeling amid the chaos, raising the UZI\n        one-handed.\n\n        Reese tugs viciously on Sarah's arm and she sprawls across\n        the booth seat a moment before the divider and seat cushion\n        erupt with hits from the UZI.\n\n        ANGLE ON A RUNNING PATRON as a burst of 9mm fire catches\n        him in the chest.  He pitches into Sarah's booth, pinning\n        her.\n\n        Reese fires, ducks, fires again.\n        Tables crash over.\n        A window is blown out.\n        A table candle rolls into a pool of high-proof alcohol\n        behind the bar.\n        It ignites with a WHOOSH.\n\n        Reese feed two shells into the riot-gun.\n\n        TIGHT ON TERMINATOR, an island of slow, precise movement\n        amid the confusion.  He drops a spent clip.  Reaches for\n        another with his bloody hand.\n\n        MOVING WITH REESE as he vaults the row of booths and starts\n        firing.  At point blank range he unloads the shotgun into\n        Terminator's belly.\n\n                                               CUT TO:\n\n\n92      INT./EXT. STOKER'S/STREET - NIGHT                      92\n\n        Terminator crashes backwards through two tables and a plate\n        glass window into the street.\n\n                                               CUT TO:\n\n\n93      INT. STOKER'S BAR - NIGHT                              93\n\n        The roaring fire behind the bar is spreading very quickly.\n        The air is thick with smoke.\n        Reese tosses the UZI, for which he has no ammo, into the\n        fire.  He hauls the dead man off Sarah and reaches for her.\n\n        TIGHT ON SARAH, shrinking away from Reese, hysterical.\n        When he grabs her wrist she struggles, eyes wide.\n\n        C.U. - REESE, very intense.\n\n                                REESE\n                     Come with me if you want\n                     to live.\n\n        She looks where he is pointing.\n\n                                               CUT TO:\n\n\n94      EXT. STOKER'S BAR/STREET - NIGHT                       94\n\n        Terminator is rising unsteadily to his feet.  Shattered\n        glass rains from him, except where it sticks to his blood-\n        drenched shirt and coat.\n\n        C.U. - TERMINATOR, as he slowly look up, his blue eyes\n        riveting STRAIGHT INTO THE CAMERA.\n\n                                               CUT TO:\n\n\n95      INT. STOKER'S BAR - NIGHT                              95\n\n        C.U. - SARAH, feeling a lightning blot of terror greater\n        than she could ever imagine as the cold gaze fixes on her.\n\n                                SARAH\n                           (awed whisper)\n                     Oh my God...\n\n                                               CUT TO:\n\n\n96      INT./EXT. STOKER'S BAR - NIGHT                         96\n\n        PANAGLIDE PRECEDING TERMINATOR as he clambers back through\n        the window and starts through the burning bar.\n\n                                               CUT TO:\n\n\n97      INT. STOKER'S BAR - NIGHT                              97\n\n        PANAGLIDE MOVING IN ON REESE AND SARAH as he runs, drag-\n        ging her with him, toward the back.\n\n        REVERSE ON TERMINATOR, DOLLYING as he crashed through the\n        wreckage in the swirling smoke, hurling burning tables out\n        of his way.\n\n                                               CUT TO:\n\n\n98      INT. KITCHEN/HALLWAY/EXIT CORRIDOR                     98\n\n        PANAGLIDE FOLLOWING REESE AND SARAH, running headlong\n        through the cluttered kitchen, then down a narrow back\n        hallway.  Sarah stumbles and Reese brutally pulls her to\n        her feet without slowing.\n\n        He hits a closed door, which crashes open.\n        Hauls Sarah through, into another corridor.\n        Slams and blot-latches it.\n        An instant later an impact from the far side tears the\n        latch-screws half out of the wall.\n        They run on.\n\n                                               CUT TO:\n\n\n99      INT. HALLWAY - NIGHT                                   99\n\n        Terminator takes a step back from the closed door and\n        slams into it again.  It starts to give way.\n        behind him the flames engulf a CAN OF CLEANING SOLVENT.\n\n                                               CUT TO:\n\n\n100     INT./EXT. EXIT CORRIDOR/ALLEY - NIGHT                  100\n\n        Reese and Sarah pelt down the narrow corridor, fling open\n        the outside door and spin out into the alley.\n\n        TIGHT ON DOOR at far end.  It splinters open and Terminator\n        sprints down the corridor.\n\n                                               CUT TO:\n\n\n101     INT. HALLWAY - NIGHT                                   101\n\n        The cleaning solvent EXPLODES.\n\n                                               CUT TO:\n\n\n102     INT. EXIT CORRIDOR - NIGHT                             102\n\n        DOLLYING AHEAD OF TERMINATOR, very fast, as he runs full-\n        throttle.  Behind him a fireball of superheated gas hurtles\n        down the narrow hallway.  He clears the outer door an\n        instant before the tongue of flame roars out into the alley.\n\n                                               CUT TO:\n\n\n103     EXT. STREET IN FRONT OF STOKER'S - NIGHT               103\n\n        Vukovich's plain car arrives, slewing to a stop in the\n        glass-littered street in front of the blazing building.\n        He leaps out, Traxler right in behind him.\n\n                                VUKOVICH\n                           (shouting)\n                     What the fuck is going on?\n\n        TWO LAPD UNITS arrive behind them.  He motions to the\n        nearest one.\n\n                                VUKOVICH\n                           (continuing)\n                     Cover the alley in back.\n\n        He heads for the inferno at a run.\n\n                                               CUT TO:\n\n\n104     EXT. ALLEY BEHIND STOKER'S - NIGHT                     104\n\n        DOLLYING WITH REESE AND SARAH as they run through the\n        dark alley.  Sarah stumbles over trashcans.\n        Reese pulls her along mercilessly.\n\n        WHIP-PANNING as they clear a corner.\n        The B.G. is a blur.\n        The night-maze is a blur in all of these shots.\n        No static angles.\n        Relentless forward motion.\n\n                                               CUT TO:\n\n\n105/FX  EXT. ALLEY - NIGHT                                     105/FX\n\n        Behind them Terminator is moving with inhuman speed,\n        bounding like a panther, leaping trash cans and other\n        obstacles.\n\n        TRACKING C.U. - TERMINATOR, catching the faintest glimpse\n        of a red glow in the pupils of his eyes as he passes through\n        total shadow.\n\n                                               CUT TO:\n\n\n106/FX  EXT. ALLEY/POV - TERMINATOR (HANDHELD) - NIGHT         106/FX\n\n        We know this is Terminator's POV because Sarah and Reese\n        are just ahead of us.  But the image is bizarre, alien.\n        Bright and hyper-real.  There is a hint of digitization,\n        and the fleeing figures ahead are more luminous than the\n        background, suggesting infra-red.\n        The margins of the FRAME are crammed with columns of CRT-\n        type characters: columns of numbers and acronyms.  The\n        data changes more rapidly than any human eye could follow.\n        There is no doubt that we are seeing as a machine would see.\n        The sound effects are bright and clear, as if they are\n        digitized and enhanced as well.\n\n                                               CUT TO:\n\n\n107     EXT. ADJOINING ALLEY - NIGHT                           107\n\n        Reese and Sarah turn a corner by caroming off the wall\n        without slowing and pelt down a narrower alley.  This\n        one is lined with a row of parked cars and connects to\n        the street.  There is little room to run.\n        Reese is reloading on the run, dropping shells.\n\n        Behind them Terminator enters the alley, gaining.\n\n        LOW ANGLE, FAST PANAGLIDE ahead of the fleeing pair.\n        As they breast the last car Reese shoves Sarah hard,\n        pitching her on her face to the pavement.\n        He flings open the car door...a shield.\n        Drops to the ground.\n        Fires into the gas tank of a car further back in the row\n        just before Terminator reaches it.\n\n        The car EXPLODES, filling the alley with fire.  An inferno\n        funneled between the enclosing walls.\n\n        ANGLE ON REESE AND SARAH behind the car door as flames\n        roar over the hood.\n\n        ON TERMINATOR, as he slides to a stop, cut off by the\n        wall of flame.\n\n        Reese doesn't waste any time stuffing Sarah into the car.\n        Climbing in after and over her he twists two wires together\n        and we recognize it as his stolen GREY SEDAN.\n        The engine catches.\n\n        A SILHOUETTE rockets out of the flames.\n        Terminator, leaping from the roof of the blazing car ahead,\n        impacts on the hood of Reese's car.  His hair and coat are\n        burning.\n\n                                               CUT TO:\n\n\n108     INT./EXT. GREY SEDAN/ALLEY - NIGHT                     108\n\n        Reese jams reverse and nail the throttle.\n        The car backs down the alley.\n        Terminator draws back his fist.\n        Punches into the windshield.\n        Inside, Sarah is sprayed with glass as the killer's fist\n        shoots through.\n        The lacerated fingers grope for her.\n\n        WIDE as the car shoots backwards out of the alley onto the\n        street, narrowly missing an arriving LAPD CRUISER.\n\n        Sarah plasters herself tightly into the seat as the\n        fingers grasp her blouse and pull.\n        Reese cranks the wheel hard.\n\n                                               CUT TO:\n\n\n109     EXT. STREET - NIGHT                                    109\n\n        The sedan skids, slewing sideways into a parked car.\n\n        Terminator rolls down off onto the pavement.\n        Reese's car shoots forward.\n\n        PANNING WITH SEDAN as it roars past Vukovich, the gathering\n        minions of the burning building, an arriving fire\n        truck...shoots through a red light and continues to accel-\n        erate.\n\n        Terminator gets to a kneeling position, then slowly stands.\n        He pats out his smoldering clothing as he watches his quarry\n        escape.\n\n                                               CUT TO:\n\n\n110     EXT. STREET - NIGHT                                    110\n\n        ON VUKOVICH as he runs to his car, exhorting the nearby\n        LAPD guys to give pursuit, while Traxler grabs the radio.\n\n                                VUKOVICH\n                           (shouting)\n                     Go!  Go!  He's got her.\n\n                                TRAXLER\n                           (overlapping)\n                     Suspect westbound on\n                     Olympic.  Grey sedan.  Has\n                     hostage, repeat...\n\n                                               CUT TO:\n\n\n111     EXT. STREET - NIGHT                                    111\n\n        LOW WIDE ANGLE on the empty street, which is narrow and\n        tightly lines with parked cars.\n        The ROAR of an engine builds.\n        The sedan, like a night-demon, hurtles out of the shadows\n        with its lights off, doing ninety plus.\n\n                                               CUT TO:\n\n\n112     INT. GREY SEDAN - NIGHT                                112\n\n        Sarah is in a daze.\n        Paralyzed.  Face bloodless.\n        She is shivering silently, uncontrollably.\n        Her eyes are wide, and it seems likely that she doesn't\n        quite comprehend the roaring blur outside her window.\n\n                                REESE\n                           (calmly)\n                     Hold on.\n\n                                               CUT TO:\n\n\n113     EXT. CITY STREETS - NIGHT                              113\n\n        WIDE ANGLE, CLOSE TO SEDAN, and following it as it hurtles\n        around a corner in an expertly controlled slide.\n        Then a high speed sprint down the cross-street.\n        Reese squirrels the vehicle between a slow-moving car\n        ahead and oncoming traffic.\n        A dive into another dark side street.\n\n                                               CUT TO:\n\n\n114     INT. GRAY SEDAN - NIGHT                                114\n\n        Reese drives with total, nerveless absorption.  His eyes\n        flick to the mirror, to the road, over his shoulder, back\n        ...and the world spins outside.\n        With occasional glances to Sarah, he speaks to her in a\n        clipped, military voice.\n\n                                REESE\n                     Are you injured?  Are you\n                     shot?\n\n        No response.\n        He reaches over and runs his hands over her arms, legs,\n        chest.  Sarah flinches.\n        She feels the BLIND PANIC BOILING UP WITHIN HER.\n        She pushes his hand away and opens the door.\n        Reese slams her back in the seat and slaps her.  Hard.\n\n                                REESE\n                           (continuing)\n                     Do exactly what I say.\n                     Exactly.  Don't move un-\n                     less I say.  Don't make a\n                     sound unless I say.  Do\n                     you understand?\n\n        As he speaks he is locking the door and fastening Sarah's\n        seatbelt over her, cinching it very tightly, like you would\n        for a child.  She doesn't answer.\n\n                                REESE\n                           (continuing/\n                           shouting)\n                     Do you understand?\n\n                                SARAH\n                           (a whisper)\n                     Yes.  Don't hurt me.\n\n                                REESE\n                     I'm here to help you.  Reese,\n                     Sergeant/Tech-Com, DN38416...\n\n        Sarah stares numbly at his outstretched hand.  With zero\n        strength she automatically returns his handshake.\n\n                                REESE\n                           (continuing)\n                     Assigned to protect you.\n                     You've been targetted for\n                     termination.\n\n                                               CUT TO:\n\n\n115     EXT. SIDE STREET/ALLEY - NIGHT                         115\n\n        The walls of a narrow alley, inky black, frame a police\n        cruiser parked on the street beyond.  Firelight from the\n        back of Stoker's lights the street garishly.\n        A young cop  stands beside the car talking via radio with\n        the mike cord pulled through the side window.  He speaks\n        with a distinctive twang--a displaced southerner.\n\n                                COP\n                      ...I don't know, it looks\n                      like it might spread to this\n                      furniture warehouse across\n                      the alley, the paint on the\n                      wall's starting to blister\n                      up...\n\n        The sweeping headlights of a turning car momentarily illuminate\n        the face of Terminator, motionless in the dark right in\n        front of us.\n        Eyes open.  Listening.\n\n                                COP\n                           (continuing)\n                      Better get another truck\n                      round to this side.\n\n        Terminator's silhouette emerges from the blackness and\n        strides purposefully toward the cop, CAMERA following.\n\n        The officer whirls and reaches for his gun but Terminator\n        flings him brutally into the side of the car, steps over\n        him and opens the door.\n        Before getting in he notes the unit number on the roof: 143.\n        Then he slides behind the wheel, slips the squad car into\n        gear, and pulls out.\n\n        CAMERA PRECEDING CAR, HIDE WIDE ANGLE, as it accelerates\n        rapidly, until the lines across the street are flashing\n        under it in a staccato rhythm.\n\n                                               CUT TO:\n\n\n116     INT. GREY SEDAN - NIGHT                                116\n\n        Sarah is slumped way down in the seat, turned away from the\n        window, trying not to see the landscape reeling outside.\n\n                                SARAH\n                           (hoarse whisper)\n                      This is a mistake.  I haven't\n                      done anything.\n\n                                REESE\n                      No. But you will.  It's\n                      very important that you\n                      live.\n\n        Sarah closes her eyes, as if to shut it all out.\n\n                                SARAH\n                      I can't believe this is happen-\n                      ing.  How could than man get up\n                      after you...\n\n        Reese's tone is equal parts hatred and respect as he replies.\n\n\n                                REESE\n                      Not a man.  A Terminator.\n                      Cyber Dynamics Model 101.\n\n                                               CUT TO:\n\n\n117     INT. SQUAD CAR - NIGHT                                 117\n\n        Terminator drives expressionlessly, monitoring the babble\n        from Central Dispatch.  He hears his number.\n\n                                DISPATCHER (V.O.)\n                           (filtered)\n                      ...Suspect vehicle sighted on\n                      Motor at Pico, southbound.\n                      Units Two-Zero-Six and Five-\n                      Seven, attempt intercept.\n                      Unit One-Four-Three, come in.\n\n        Terminator picks up the mike.  He speaks in a\n        simulation of the young cop's southern twang.\n\n                                TERMINATOR\n                      This is One-Four-Three.  West-\n                      bound on Olympic, approaching\n                      Overland.\n\n                                               CUT TO:\n\n\n118     EXT. SANTA MONICA FREEWAY - NIGHT                      118\n\n        The grey sedan moves through traffic like a hell-bent\n        wraith.  Reese has the hammer down.  He handles the\n        car with nerves of steel.\n\n                                               CUT TO:\n\n\n119     EXT. POLICE HELICOPTER - NIGHT                         119\n\n        Below, Reese's sedan snakes along at 110 plus.  The\n        chopper, F.G., drops toward it.\n\n                                PILOT (V.O.)\n                           (filtered)\n                      Air-unit Two.  We're on him.\n                      Westbound Santa Monica at 405.\n\n                                               CUT TO:\n\n\n120     INT. GREY SEDAN - NIGHT                                120\n\n                                SARAH\n                      A machine?  You mean, like\n                      a robot?\n\n                                REESE\n                      Not a robot.  Cyborg.\n                      Cybernetic Organism.\n\n        They have to yell over the roar of air through the broken\n        windshield.\n\n                                SARAH\n                      But...he was bleeding.\n\n        At that moment a blinding light sears down on them from\n        above.  Reese looks over his left shoulder and sees a\n        CHP cruiser coming alongside.\n\n                                REESE\n                      Just a second.  Keep your\n                      head down.\n\n                                               CUT TO:\n\n\n121     EXT. FREEWAY - NIGHT                                   121\n\n        The helicopter is right above the, its spotlight burning\n        on Reese.  The cruiser flanks them, closing.  Reese peels\n        off to the right, inches in front of a tractor-trailer rig,\n        brakes hard and slides into a four-wheel drift through a\n        curving off-ramp.\n        The helicopter banks, following.\n        The cruiser swaps ends trying to maneuver and slams broad-\n        side into the guardrail.  Out of action.\n\n                                               CUT TO:\n\n\n122     EXT. OFF RAMP/INTERSECTION - NIGHT                     122\n\n        The sedan roars across the street without slowing\n        and vanishes down a tree-lined side street.\n\n                                               CUT TO:\n\n\n123     EXT. POLICE HELICOPTER - NIGHT                         123\n\n        DOWN ANGLE - AERIAL past the chopper, F.G., as its searchlight\n        sweeps over the close-knit treetops.\n\n                                               CUT TO:\n\n\n124     EXT. SIDE STREET/INTERSECTION - NIGHT                   124\n\n        The sedan skids around a corner, F.G., as the searchlight\n        filters in shafts through the trees further down the street,\n        sweeping futility back and forth.\n\n                                               CUT TO:\n\n\n125     EXT. POLICE HELICOPTER - NIGHT                         125\n\n        It hovers indecisively, then banks off.\n\n                                PILOT (V.O.)\n                           (filtered)\n                      Lost him.\n\n                                               CUT TO:\n\n\n126     INT. GREY SEDAN - NIGHT                                126\n\n        Reese is ultra-alert, craning to look up, back, forward.\n\n                                REESE\n                      Good cover.\n                           (pause)\n                      Alright.  Listen.\n                      The Terminator's an infil-\n                      tration unit.  Part man, part\n                      machine.  Underneath, it's a\n                      hyperalloy combat chassis,\n                      mircoprocessor-controlled,\n                      fully  armored. Very tough...\n\n        He pauses as they slide around another corner.\n\n                                               CUT TO:\n\n\n127     EXT. STREET - NIGHT                                    127\n\n        Reese's sedan glides out onto a main drag, very subdued.\n        He turns the lights on and blends with traffic.\n        The helicopter crosses laterally in the distance.\n\n                                               CUT TO:\n\n\n128     INT. GREY SEDAN - NIGHT                                128\n\n                                REESE\n                           (continuing)\n                      But outside, it's living\n                      human tissue.  Flesh, skin,\n                      hair...blood.  Grown for the\n                      cyborgs.\n\n                                SARAH\n                      Look, Reese, I know you want\n                      to help, but...\n\n                                REESE\n                           (cutting her off)\n                      Pay attention.  The 600\n                      series had rubber skin.\n                      We spotted them easy.  But\n                      these are new.  They look\n                      human.  Sweat, bad breath,\n                      everything.  Very hard to\n                      spot.  I had to wait 'til\n                      he moved on you before I\n                      could zero him.\n\n                                SARAH\n                      Hey, I'm not stupid, y'know.\n                      They can't build anything like\n                      that yet.\n\n                                REESE\n                      No.  Not yet.  Not for about\n                      forty years.\n\n        Reese is driving sedately for a low profile, but his eyes\n        rove constantly, searching for a place to ditch the car.\n        Sarah's eyes are alert as well, and her tone becomes a bit\n        too cool.\n\n                                SARAH\n                      So, it's from the future, is\n                      that right?\n\n                                REESE\n                      One possible future.  Four your\n                      point of view.  I don't know the\n                      tech stuff.\n\n                                SARAH\n                      And you're from the future too?\n\n                                REESE\n                      Right.\n\n        They come to a red light and Reese stops.\n\n                                SARAH\n                           (patronizingly)\n                      Right...\n\n        Like a shot she unlatches the seatbelt, pulls the door lock\n        and has the door half open before Reese can react.  He catches\n        her arm and hauls her struggling back into the car.\n\n        Sarah sinks her teeth into his hand with all her strength.\n        His grip doesn't slacken.\n        Slowly, without releasing her, he reaches across with his\n        other hand and shuts the door.  His face shows no reaction.\n\n        Sarah draws back and stares at the blood running down his\n        arm from the bite, that at his grim, scarred face.  The\n        light turns green and Reese drives on.\n        Sarah tastes blood and wipes her mouth.\n\n                                REESE\n                           (coldly)\n                      Cyborgs don't feel pain.  I\n                      do.  Don't...do that...again.\n\n        He wipes his hand on his pants.\n\n                                SARAH\n                           (weakly, plead-\n                           ing)\n                      Just let me go.\n\n                                REESE\n                           (slow, but intense)\n                      Listen.  Understand.  That\n                      Terminator is out there.  It\n                      can't be reasoned with, it can't\n                      be bargained with...it doesn't\n                      feel pity of remorse or fear...\n                      and it absolutely will not stop.\n                      Ever.  Until you are dead.\n\n        Sarah slump in utter resignation.\n\n                                SARAH\n                           (quietly)\n                      Can you stop it?\n\n        Reese doesn't look at her.\n\n                                REESE\n                      Maybe.  With these weapons...\n                      I don't know.\n\n                                               CUT TO:\n\n\n129     EXT. PARKING LOT - NIGHT                               129\n\n        Reese's car turns into the parking lot of a large hospital,\n        acres of pavement dotted with sporadic parked cars.\n\n                                               CUT TO:\n\n\n130     EXT./INT. TERMINATOR'S CRUISER - NIGHT                 130\n\n        ANGLE THROUGH WINDSHIELD, ON TERMINATOR, as he searches.\n        Streetlights flare across rhythmically.\n\n                                               CUT TO:\n\n\n131     EXT. POLICE HELICOPTER - NIGHT                         131\n\n        It moves between two buildings, searchlight sweeping back\n        and forth.  DOWN ANGLE, past the chopper, as the circle of\n        light moves across a row of parked cars.\n        It passes a grey sedan with a shattered windshield.\n        Flicks back.  Holds.\n\n        TIGHTER ON CAR, GROUND LEVEL, in the glare and propwash.\n        It looks empty.\n\n                                               CUT TO:\n\n\n132     EXT. PARKING LOT/NEARBY  - NIGHT                       132\n\n        LOW ANGLE DOLLY, MOVING WITH REESE AND SARAH as they crawl\n        behind a row of parked cars.\n\n        He has firm hold of her arm but she seems to be cooperating.\n        In the B.G., the chopper hovers, on the far side of the lot.\n        Reese approaches the door of a late model brown Buick which\n        has been left with its window partway down.\n        He unlocks it and they slip inside.\n\n                                               CUT TO:\n\n\n133     EXT./INT. TERMINATOR'S CRUISER - NIGHT                 133\n\n        TIGHT ON TERMINATOR, through the windshield of the black-\n        and-white.\n\n                                DISPATCHER (V.O.)\n                           (filtered)\n                      Suspect vehicle located at\n                      parking lot, Cedar and Glen-\n                      haven...\n\n        FULL SHOT as Terminator's cruiser slews in a radical turn\n        and roars off in the opposite direction.\n\n                                               CUT TO:\n\n\n134     INT./EXT. BROWN BUICK/PARKING LOT - NIGHT              134\n\n        Reese uses the butt of the shotgun to smash loose the\n        ignition assembly.  He begins working on the wires.  A\n        police cruiser appears, moving slowly between the rows of\n        cars.\n\n        Reese grabs Sarah and pulls her down to huddle below dash\n        level.  A moment later a spotlight flashes across the seats\n        above them.  They hear the helicopter circling closer.\n\n                                SARAH\n                      Reese...why me?  Why does\n                      it want me?\n\n        They are lying very close, a forced intimacy.  Reese's voice\n        is an urgent whisper, almost in her ear.  A cruiser passes\n        so close they can hear its radio clearly.\n\n                                REESE\n                      There's so much...\n\n                                SARAH\n                      Tell me.  Just start at the\n                      beginning.\n\n        Reese musters his thoughts.  And starts.\n\n                                REESE\n                      There was a war.  A few years\n                      from now.  Nuclear war.  The\n                      whole thing.  All this--\n\n        His gesture includes the car, the city, the world.\n\n                                REESE\n                           (continuing)\n                      --everythingis gone.  Just\n                      gone.  There were survivors.\n                      Here.  There.  Nobody knew who\n                      started it.\n                           (pause)\n                      It was the machines.\n\n                                SARAH\n                      I don't understand...\n\n                                REESE\n                      Defense network computer. New.\n                      Powerful.  Hooked into everything.\n                      Trusted to run it all.  They say it\n                      got smart...a new order of intelli-\n                      gence.  Then it saw all people as\n                      a threat, not just the ones on the\n                      other side.  Decided out fate in a\n                      microsecond...extermination.\n\n        Reese pauses, and when he continues it's less like a military\n        briefing, quieter.\n\n                                REESE\n                           (continuing)\n                      Didn't see the war.  I was born\n                      after, in the ruins.  Grew up\n                      there.  Starving.  Hiding from\n                      the H-K's.\n\n                                SARAH\n                      The what?\n\n                                REESE\n                      Hunter Killers.  Patrol machines.\n                      Build in automated factories.\n                      Most of us were rounded up, put in\n                      camps...for orderly disposal.\n\n        He pushes up the sleeve of his jacket and shows\n        her a ten digit number etches on the skin of his forearm.\n        Beneath the numbers is a pattern of lines like the auto-\n        matic-pricing marks on product packages.\n\n                                REESE\n                           (continuing)\n                      Burned in by laser scan.\n                           (pause)\n                      Some of us were kept alive...\n                      to work.  Loading bodies.  The\n                      disposal units ran night and day.\n                      We were that close to going out\n                      forever...\n\n        The helicopter moves overhead.  Its searchlight illum-\n        inates the car interior, moves on.  Before the rotor\n        sound fads, Reese starts the car.\n\n                                               CUT TO:\n\n\n135     EXT. PARKING LOT - NIGHT                               135\n\n        Several black-and-whites are moving among the parked\n        cars, slowly.\n\n        ANGLE ON TERMINATOR'S CRUISER rolling along just above\n        idle.  He peers into the row of cars, listening and\n        seeing on level we can't.\n\n                                               CUT TO:\n\n\n136     INT. BROWN BUICK - NIGHT                               136\n\n        Reese is holding onto Sarah's shoulder tightly.\n\n                                REESE\n                           (continuing)\n                      ...but there was one man...who\n                      taught us to fight.  To storm\n                      the wire of the camps.  To\n                      smash those metal mother-\n                      fuckers into junk.  He turned\n                      it around...he brought us back\n                      from the brink.\n                           (pause)\n                      His name is Connor.  John Connor...\n                      your son, Sarah.  Your unborn son.\n\n        Sarah stared at him.\n\n                                               CUT TO:\n\n\n137     EXT. PARKING LOT - NIGHT                               137\n\n        The brown Buick is F.G. as the nose of Terminator's cruiser\n        appears behind it, moving slowly.\n\n        C.U. - TERMINATOR, scanning.\n\n        LOW ANGLE, past the back of the Buick, as Terminator\n        cruises by.  The tailpipe, F.G., puffs quietly.\n        Terminator's head snaps around.\n        His eyes lock on Reese's car.\n        He reaches for his shotgun.\n\n                                               CUT TO:\n\n\n138     INT. BUICK - NIGHT                                     138\n\n        Reese's head jerks up, looking in the mirror.\n\n                                               CUT TO:\n\n\n139     EXT. PARKING LOT - NIGHT                               139\n\n        Reese's car launches forward from its space, tires\n        spinning as Terminator fires from the window of the\n        cruiser.\n\n                                               CUT TO:\n\n\n140     INT. BUICK - NIGHT                                     140\n\n        The rear window explodes and Reese ducks, then cranks\n        the wheel.\n\n                                               CUT TO:\n\n\n141     EXT. PARKING LOT - NIGHT                               141\n\n        Reese and Terminator race along opposite sides of a\n        row of cars, approaching the exit.\n        The cruiser pulls ahead and closes diagonally as they\n        clear the last car.\n        Reese sees the other's shotgun leveled.\n        He ducks, steering blind, keeps it floored.\n        The windshield and side window EXPLODES INWARD.\n\n        The Buick slams into the black-and-white, spinning it into\n        a parked truck.  TIRES SCREAM as the two cars slew around\n        heading for the exit.\n\n        SEVERAL ANGLES, as the police react.\n\n        The chopper banks tight and dives across the tops of\n        the parked cars.  Cruisers race to converge.\n\n                                               CUT TO:\n\n\n143     EXT. STREET - NIGHT                                    143\n\n        LOW WIDE ANGLE, PRECEDING REESE'S BUICK as it hits the\n        street, accelerating.  Terminator's cruiser slides out\n        behind it, fishtails, races forward.\n        Engines roar as the cars go flat out.  Buildings lining\n        the street become a blur.\n        The chopper arcs in behind them.\n        Legitimate police, lights blazing, enter the pursuit\n        one by one.\n\n        LOW ANGLE, MOVING WITH TERMINATOR'S CAR as Reese dodges\n        across all lanes ahead of it.\n        Terminator gaining.\n        They run an intersection at a hundred plus.\n\n                                               CUT TO:\n\n\n144     INT. BUICK - NIGHT                                     144\n\n        Reese is feeding his last two shells into the riot gun.\n\n                                REESE\n                           (yelling)\n                     Steer!\n\n        Holding the gun is both hands he leans out the window,\n        still keeping the throttle mashed down.\n        Sarah grabs the wheel, fighting to control the car.\n\n                                               CUT TO:\n\n\n145     EXT. STREET/BUICK - NIGHT                              145\n\n        MOVING WITH THE BUICK, looking back, as Reese aims the\n        shotgun, buffeted by the windstream.\n        Terminator's car, B.G., overtakes rapidly.\n\n                                SARAH\n                           (shouting)\n                     Reese!\n\n                                               CUT TO:\n\n\n146     INT. BUICK - NIGHT                                     146\n\n        OVER SARAH'S SHOULDER as they approach an intersection...\n        red light their way and an ALPHA BETA TRUCK entering cross\n        wise.\n\n                                               CUT TO:\n\n\n147     EXT. STREET/CARS - NIGHT                               147\n\n        Past Terminator, F.G., his shotgun aimed as he comes along\n        side...at Reese.\n        They are staring down each other's barrels.\n\n                                               CUT TO:\n\n\n148     INT. BUICK - NIGHT                                     148\n\n        Sarah grabs the shift lever.\n\n        DETAIL - SHIFTER, as she slams it into reverse.\n\n                                               CUT TO:\n\n\n149     EXT. STREET/CARS - NIGHT                               149\n\n        MOVING WITH BOTH CARS as the Buick skids with rear tires\n        locked.  Reese and Terminator FIRE simultaneously.\n\n        TIGHT ON REESE as the doorpost next to his shoulder is\n        torn out by the other's blast.\n\n        ON TERMINATOR, leaning to see around his shattered wind-\n        shield.  Too late.\n        He hurtles into the intersection, past the skidding Buick.\n        Clips the back of the semi.\n        Spins radically.\n        Vaults the curb in a screeching front-end roll.\n\n        WHIP-PANNING WITH THE CRUISER as it crashes upside-down\n        through the counter area of an A & W.\n\n        LOW ANGLE as Reese and Sarah slide to a stop in a cloud\n        of tire smoke.\n        Transmission fluid pours out of the car like blood.\n        An instant later they are surrounded by an assortment of\n        LAPD, SHERIFF'S DEPT., and CHP CARS.\n        The helicopter hovers overhead.\n\n        MEDIUM ON SARAH AND REESE, he raises his hands, through\n        the side window, in plain sight. A phalanx of cops, guns\n        drawn, approaches the car warily.\n\n        Sarah looks at Reese.  Then at the cops.  She opens the door\n        and runs, staggering, toward them.  Vukovich steps forward\n        and pulls her away to safety.\n\n        C.U. - REESE watching her go as a cop eases his door open.\n\n                                               CUT TO:\n\n\n150     EXT. A & W - NIGHT                                     150\n\n        Two cops approach the overturned squad car jammed into the\n        wreckage of the small building.\n        They shine their flashlights inside.\n        It is empty.\n\n        The cyborg has VANISHED.\n\n        A sign which reads 'DRIVE IN' detaches from an awning and\n        crashed down across the crushed auto.\n\n                                               CUT TO:\n\n\n151     INT. VUKOVICH'S OFFICE - NIGHT                         151\n\n        Sarah, huddles in a blanket, is siting on a bench opposite\n        Vukovich's desk.  Motionless.  Her eyes are fixed on the\n        middle distance.  She's been crying.  Now she's emptied out.\n\n        The door opens.\n        At the sound of the latch Sarah jerks as if struck, and cringes\n        involuntarily.  Vukovich enters with Traxler and DR. PETER\n        SILBERMAN, a criminal psychologist.  Silberman is smooth\n        of skin and manner, young, ambitious and...fat.  He is\n        enthusiastic about the workings of the human psyche, as\n        emotionally involved as someone pulling the wings off a fly.\n\n        Vukovich sits beside Sarah and hands her a cup of coffee.\n        He puts a paternal arm around her shoulders.\n\n                                VUKOVICH\n                     Here, drink some of this...\n\n                                SARAH\n                           (voice flat,\n                           desperate)\n                     Lieutenant, are you sure it's\n                     them?  Maybe I should see the\n                     ...bodies.\n\n                                VUKOVICH\n                     They've already been identi-\n                     fied.  There's no doubt.\n\n        Sarah  begins to cry again, slowly and very quickly.\n\n                                SARAH\n                           (to herself)\n                     Of, God...Ginger...kiddo,\n                     I'm so sorry.\n\n        Vukovich takes the coffee cup from her as her arms sag and\n        it starts to spill.\n\n                                VUKOVICH\n                           (gently)\n                     Sarah.\n                           (pause)\n                     Sarah, this is Dr. Silber-\n                     man.  I'd like you to tell\n                     him everything Reese said\n                     to you.  Do you feel up to it?\n\n                                SARAH\n                           (almost in-\n                           audible)\n                     I guess so.\n                           (to Silberman)\n                     You're a doctor?\n\n                                SILBERMAN\n                     A criminal psychologist.\n\n                                SARAH\n                     Is Reese crazy?\n\n                                SILBERMAN\n                     That's what we're going to\n                     find out.\n\n                                               CUT TO:\n\n\n152     INT. HOTEL ROOM - NIGHT                                152\n\n        The room costs five dollars a night and that's steep, but\n        the FIRE ESCAPE outside the window adds an element of\n        strategic value.\n        A silhouette slips in through the window and click on the\n        single BARE LIGHT BULB.\n        It's Terminator, and he's a mess.\n        A bloody scarecrow with bullet wounds in stomach, chest,\n        shoulder and right wrist.\n\n        MEDIUM ON TERMINATOR as he sits at a ratty folding table\n        under the light.\n        His eyebrows are singed off.\n        Hair a charred stubble.\n        Left eyes glistening with imbedded glass shards.\n\n        Before him on the table is an array of SMALL TOOLS.\n        He removes the charred remains of his jacket and props.\n        one elbow on the table.\n\n        ANGLE PAST HIS NON-FUNCTIONAL RIGHT ARM, F.G., as he exam-\n        ines it.  He picks up an X-ACTO KNIFE and cuts deeply into\n        the skin of his forearm.\n        His expression is one of mild concentration.\n\n        E.C.U. - FOREARM, as he pulls back a large flap of skin to\n        reveal a complex trunk of SHEATHED CABLES AND HYDRAULICS.\n        They slide as he moves his fingers.\n\n        RESUME MEDIUM, as Terminator uses a rag to wipe away the\n        blood.  With small screwdrivers he begins to patiently dis-\n        assemble the damaged mechanism around the 12-guage hit.\n\n                                               CUT TO:\n\n\n153     INT. DIVISION HQ/INTERROGATION ROOM - NIGHT            153\n\n        The room is small, furnished with only a table and two chairs.\n        Reese, his arms handcuffed behind him, sits opposite Dr.\n        Silberman.  Behind Silberman is a large mirror.  A DETECTIVE\n        leans against the wall.\n\n                                SILBERMAN\n                     So.  You're a soldier.\n                     Fighting for whom?\n\n                                REESE\n                     With the One Thirty Second\n                     under Perry, from '21 to '27--\n\n                                SILBERMAN\n                           (interrupting)\n                     The year 2027?\n\n                                               CUT TO:\n\n\n154     INT. OBSERVATION ROOM                                  154\n\n        Vukovich and Traxler are seated in the dark room, watching\n        Reese, B.G., through the two-way mirror.  Just behind the\n        glass is a VIDEO CAMERA ON A TRIPOD, aimed at Reese, and\n        a CART holding a SMALL MONITOR and VIDEOCASSETTE RECORDER.\n\n                                REESE\n                           (through speaker)\n                     That's right.\n\n                                TRAXLER\n                           (quietly, to\n                           Vukovich)\n                     This is fucking great.\n\n                                               CUT TO:\n\n\n155     INT. INTERROGATION ROOM                                155\n\n                                REESE\n                     Then I was assigned Recon/\n                     Security, last two years,\n                     under John Connor.\n\n                                SILBERMAN\n                     And who was the enemy?\n\n                                REESE\n                     SKYNET.  A computer defense system\n                     built for SAC-NORAD by Cyber\n                     Dynamics.  A modified Series\n                     4800.\n\n                                SILBERMAN\n                           (gravely)\n                     I see.  And this...computer,\n                     thinks it can win by killing\n                     the mother of its enemy, kill-\n                     ing him, in effect, before he\n                     is even conceived?  A sort of\n                     retroactive abortion?\n\n                                REESE\n                     Yes.\n\n                                               CUT TO:\n\n\n\n156     INT. OBSERVATION ROOM                                  156\n\n        Traxler snorts and grins.\n\n                                TRAXLER\n                           (to Vukovich)\n                     That Silberman just crack me up.\n                           (pause)\n                     He had this guy in here last week\n                     who set his Afghan on fire.\n                     Screwed it first, then set it on--\n\n                                VUKOVICH\n                           (leaning forward)\n                     Shut up.\n\n                                               CUT TO:\n\n\n157     INT. INTERROGATION ROOM\n\n                                REESE\n                      ...it had no choice.\n                      The defensive grid was\n                      smashed. We'd taken the\n                      mainframes...\n                      We'd won.  Taking out\n                      Connor then would make no\n                      difference.  Skynet had to\n                      wipe out his entire exist-\n                      ence.  We captured the lab\n                      complex.  Found the...what-\n                      ever it was called...the\n                      time-displacement equipment.\n                      The Terminator had already\n                      gone through.  They sent two\n                      of us to intercept, then\n                      zeroed the whole place.\n                      Sumner didn't make it.\n\n                                SILBERMAN\n                      Then how are you supposed to\n                      get back?\n\n                                REESE\n                      Can't.  Nobody goes home.\n                      Nobody else comes through.\n                      It's just him and me.\n\n                                               CUT TO:\n\n\n158     INT. HOTEL ROOM - NIGHT\n\n        E.C.U. - TERMINATOR, in profile, showing his lacerated eye.\n        He is close to a mirror, practically touching it, staring\n        intently.\n\n        MACRO - X-ACTO KNIFE lying on the dresser.  Terminator's\n        fingers lift it.  CAMERA TILTS TO FOLLOW as it rises to\n        his face, holds TIGHT ON left eye.\n        With a smooth motion the knife point enters the eyeball\n        and cuts away the ruins sclera and cornea, as well as part\n        of the damaged eyelids.\n\n        He wipes with a rag to clear the electronic eye's vision.\n        Revealing the faintly glowing lens mechanism, suspended in\n        a chrome socket by tiny servos.\n        The eye whirs quietly as it tracks.\n\n        SEQUENCE OF SHOTS, showing various repairs.\n        Terminator's right hand, its wrist SUTURED crudely, holds\n        a needle and sewing thread and starts to work on abdominal\n        wound out of frame below.\n        He slips a glove over the damaged hand.\n        A motoring cap over the blistered scalp.\n\n        A fresh shirt to hide his body wounds.\n        This is followed by a new overcoat.\n\n        C.U. - TERMINATOR, contemplating his reflection in the\n        mirror.  With the hat pulled down, the collar pulled up,\n        and favoring his right profile he looks unhurt...though\n        a bit gaunt and pale.\n\n        A turn of his head brings the balefully glowing left eye\n        in its metal socket into view.\n        He slips on a pair of tight, wrap-around sunglasses.\n\n        FULL SHOT as he goes to the bed and flips up the stained\n        mattress.  He picks up the Remington 12 gauge, the AR-180\n        and the .38 off the springs and leaves by the fire escape.\n\n                                               CUT TO:\n\n\n159     INT. VUKOVICH'S OFFICE - NIGHT                         159\n\n        TIGHT ON VIDEO MONITOR showing Reese in the Interrogation\n        Room.\n\n                                REESE\n                           (recorded)\n                      ...It's just him and me.\n\n        CUT WIDE revealing Sarah, Silberman, Vukovich and Traxler\n        watching a monitor sitting amid incredible paperwork clutter\n        on a desk top.\n\n                                SILBERMAN\n                           (recorded)\n                      Why didn't you bring any\n                      weapons?  Something more\n                      advanced.  Don't you have\n                      ray guns?\n\n        Traxler, standing in the back, grins and nudges Silberman,\n        who nods appreciatively.\n\n        TIGHT ON REESE'S RECORDED IMAGE - He glares at Silberman.\n\n        ON SARAH, as Silberman's voice is heard.\n\n                                SILBERMAN\n                           (recorded)\n                      Show me a piece of future\n                      technology.\n\n                                REESE\n                           (recorded/con-\n                           trolling his\n                           hostility)\n                      You go naked.  Something about\n                      the field generated by a living\n                      organism.  Nothing dead will go.\n\n                                SILBERMAN\n                           (recorded)\n                      Why?\n\n                                REESE\n                           (recorded)\n                      I didn't build the fucking\n                      thing.\n\n                                SILBERMAN\n                           (recorded)\n                      Okay.  Okay.  But this...\n                           (consults his\n                           notes)\n                      cyborg...if it's metal...\n\n                                REESE\n                           (recorded)\n                      Surrounded by living tissue.\n\n                                SILBERMAN\n                           (recorded)\n                      Of course.\n\n        The real Silberman put the tape on \"PAUSE\".\n\n                                SILBERMAN\n                           (excited)\n                      This is great stuff.  I could\n                      make a career out of this guy.\n                      You see how clever this part\n                      is...how it doesn't require a\n                      shred of proof.  Most paranoid\n                      delusions are intricate...but\n                      this is brilliant.\n\n        He starts the tape again.\n\n                                SILBERMAN\n                           (recorded)\n                      Why were the other two women\n                      killed?\n\n                                REESE\n                           (recorded)\n                      Most official records were\n                      lost in the war.  The computer\n                      knew almost nothing about\n                      Connor's mother.  Her name.\n                      Where she lived, just the city.\n                      No scanner pictures.  The\n                      Terminator was just being\n                      systematic.\n\n        C.U. - REESE, ON SCREEN, as he goes on.\n\n                                REESE\n                           (recorded, con-\n                           tinuing)\n                      You've heard enough.  Decide.\n                      Are you going to release me?\n\n                                SILBERMAN\n                           (recorded)\n                      I'm afraid that's not up\n                      to me.\n\n                                REESE\n                           (recorded/voice\n                           rising)\n                      Then why am I talking to you?\n                      Get out.\n\n        ON SARAH, DOLLYING SLOWLY IN TO C.U. as we hear Reese\n        begin to shout.\n\n                                SILBERMAN\n                           (recorded)\n                      I can help you...\n\n                                REESE\n                      Who is in authority here?\n\n        C.U. REESE, ON SCREEN, as he looks straight at the camera.\n\n                                REESE\n                           (recorded)\n                      You still don't get it.\n                      He'll find her.  That's\n                      what he does.  All he does...\n\n        MEDIUM ON VUKOVICH, gesturing to Silberman, who is near the\n        machine, to kill it.\n\n                                REESE\n                           (recorded, con-\n                           tinuing)\n                      You can't stop him. He'll\n                      wade through you...\n\n        C.U. - REESE, ON SCREEN, rising partway out of his chair,\n        yelling.\n\n                                REESE\n                           (recorded, continuing)\n                      ...reach down her throat, and\n                      pull her fucking heart out...\n\n        The screen goes black.\n        Vukovich has cut off the tape.\n\n                                SILBERMAN\n                           (glancing around)\n                      Sorry.\n\n        C.U. - SARAH staring at the empty screen.\n\n                                SARAH\n                           (turning)\n                      So Reese is crazy.\n\n                                SILBERMAN\n                      In technical terminology,\n                      he's a loon.\n\n                                SARAH\n                      But...\n\n        Vukovich hands her something that looks like umpire's\n        padding.\n\n                                VUKOVICH\n                      Sarah, this is body armor.\n                      Out TAC guys wear it.  It'll\n                      stop a 12 gauge round.  This\n                      other individual must've had\n                      one under his coat.\n\n        Sarah want to believe him.  God help her if he's wrong.\n\n                                SARAH\n                      But what about him punching\n                      through the windshield?\n\n                                TRAXLER\n                           (shrugs)\n                      Probably on PCP, broke every\n                      bone in his hand and won't feel\n                      it for hours.  There was this\n                      guy once that...\n\n        Vukovich cuts him off with a gesture and sits beside Sarah\n        on the bench.\n\n                                VUKOVICH\n                      Why don't you just stretch out\n                      here and get some sleep.  It'll\n                      take your mom a good hour to get\n                      here from Redlands.\n\n                                SARAH\n                      I can't sleep.\n\n                                VUKOVICH\n                      Go ahead.  You're safe.  There're\n                      thirty cops in this building.\n\n                                SARAH\n                      Okay.\n\n        She lays her head on a wadded up blanket as everyone\n        leaves the office.\n\n                                               CUT TO:\n\n\n159A    INT. CORRIDOR\n\n        Vukovich pauses outside the door, lost in thought.  Traxler\n        studies him for a second.\n\n                                TRAXLER\n                      What?\n                           (pause)\n                      Ed, come on...the guy's a\n                      wacko.\n\n        Vukovich glances up.\n\n                                VUKOVICH\n                           (quietly)\n                      He'd better be.\n\n                                               CUT TO:\n\n\n160     INT. POLICE DEPARTMENT FOYER - NIGHT                   160\n\n        Silberman can be seen through a glass partition next to\n        the bullet-proof glass booth enclosing the NIGHT DESK\n        SERGEANT'S counter.  The Sergeant hits a button and there\n        is a loud BULL-CLACK.  The electric bolt on the security\n        door opens and Silberman steps out.\n\n        As he exits the station, he passes Terminator just coming in\n        the front door.  He glances at the pale apparition in cap\n        and dark wrap-arounds, but goes on.\n        Terminator approaches the Desk Sergeant who barely glances\n        up when he speaks.\n\n                                TERMINATOR\n                      I'm a friend of Sarah Connor.\n                      I was told she is here.  Can\n                      I see her, please?\n\n                                SERGEANT\n                      You can't see here.  She's\n                      making a statement.\n\n                                TERMINATOR\n                      Where is she?\n\n                                SERGEANT\n                           (laconically)\n                      Look.  It's gonna be a while.\n                      You wanna wait.  There's a\n                      bench.\n\n        Terminator steps back, scanning the booth, the electric\n        door, the rooms beyond.\n\n                                TERMINATOR\n                      I'll come back.\n\n        He turns and walks out through the front doors.\n\n        ANGLE PAST DESK SERGEANT, F.G. - ON FRONT DOORS, the officer\n        is absorbed in paperwork, not watching as a pair of lights\n        get BRIGHTER outside the doors.  RAPIDLY.  He glances up\n        at the last second as the glare falls fully on him.  CRASH!\n        Several cops and late night loiterers scatter as a car\n        smashes into the foyer.  It blasts through the sergeant's\n        booth, crushing him in the wreckage.\n\n                                               CUT TO:\n\n\n161     INT. DIVISION HQ/VUKOVICH'S OFFICE                     161\n\n        Sarah, lying on the couch, jerks awake as the crash\n        REVERBERATES through the building.  She sits up, bleary-\n        eyes.\n\n                                               CUT TO:\n\n\n162     INT. DIVISION HQ/CORRIDOR                              162\n\n        Through the hole in the splintered wall we see Terminator\n        leap out of the car.\n        He vaults the hood and smashes through the debris of the\n        wall.\n        Leaps to the corridor floor in a shower of plaster fragments.\n        He brandishes the AR-180 like a pistol in one hand, the\n        .38 in the other.\n        The shotgun dangles at his side on a shoulder sling.\n\n        LOW ANGLE DOLLY, preceding him as he starts down the\n        corridor.\n\n        ANGLE ON LOUNGE DOORWAY as TWO COPS run into the hall,\n        one carrying a cup of coffee.\n        Terminator fires a burst from the assault rifle.\n\n        ANGLE ON COPS - They are flung backward in a spray of\n        coffee and plaster.\n\n                                               CUT TO:\n\n\n163     INT. DIVISION HQ/VUKOVICH'S OFFICE\n\n        Sarah is alert now with growing alarm.  The sound of\n        GUNFIRE is faint...but unmistakable.  Her expression\n        shows the dawning certainty of what is happening.\n\n                                               CUT TO:\n\n\n164     INT. DIVISION HQ/CORRIDOR                              164\n\n        Terminator steps over the bodies of the two cops without\n        breaking stride.\n\n        OVER HIS SHOULDER, MOVING WITH HIM as he walks down the\n        hall.  Comes to a door.  Tries it.  Locked.\n        Kicks it in.\n        A DESK COP, drawing his gun, sprints for cover.\n\n        ANGLE ON TERMINATOR raising the AR-180.\n\n                                               CUT TO:\n\n\n165/FX  INT. DIVISION HQ/OFFICE - TERMINATOR'S POV             165/FX\n\n        In computer-enhanced vision we see the cop dash around a\n        corner in SLOW MOTION.  As he disappears behind the wall\n        an ANIMATED OUTLINE OF HIM is still visible...a PROBABILISTIC\n        EXTRAPOLATION OF HIS MOTION.  There is a target cross-\n        hair following the figure.\n\n                                               CUT TO:\n\n\n166     INT. DIVISION HQ/OFFICE - BEHIND WALL                  166\n\n        The wall erupts with a volley of shots beside the running\n        cop and he is flung OUT OF FRAME.\n\n                                               CUT TO:\n\n\n167     INT. VUKOVICH'S OFFICE                                 167\n\n        Shots are echoing in the hallway as Vukovich whips open\n        the door, startling the hell out of Sarah.\n\n                                VUKOVICH\n                      Stay here.\n\n        He turns the locking knob and slams the door.\n        Leaving her alone.\n        She flinches as more SHOTS SOUND.  CLOSER.\n\n                                               CUT TO:\n\n\n167A    INT. CORRIDOR                                          167A\n\n        Terminator rips the cover off the station's main electrical\n        panel.  He pulls loose the hose-like 440 volt\n        incoming line and feeds it directly into the lighting\n        circuit.\n\n        All down the corridor the overhead fluorescent units\n        explode, showering sparks and glass.\n\n        The building is plunged into darkness.\n\n        Arcs SPUTTER and FLARE, lighting the corridors strobo-\n        scopically.\n\n                                               CUT TO:\n\n\n167B    INT. VUKOVICH'S OFFICE                                 167B\n\n        Sarah's terror skyrockets when the ceiling lamp explodes\n        and the office goes black.\n\n                                               CUT TO:\n\n\n168     INT. CORRIDOR                                          168\n\n        Through the smoke and emergency spotlights Terminator moves\n        forward, inexorably.\n        A door behind him opens.  A COP fires, hitting him in\n        the shoulder.  Terminator fires straight-arm with the .38\n        without slowing, killing the cop, then fires down the\n        corridor with the assault rifle.\n\n                                               CUT TO:\n\n\n169     INT. INTERROGATION ROOM                                169\n\n        Traxler leaves the other detective to guard Reese, who is\n        still handcuffed to the chair.\n\n                                TRAXLER\n                          (exciting)\n                     Watch him.\n\n        The door closes.\n\n        An instant later a chair smashes over the detective's\n        back, just as he is turning toward his prisoner.\n        Reese is on him, scrabbling for the keys.\n\n                                               CUT TO:\n\n\n170     INT. CROSS CORRIDOR                                    170\n\n        Traxler is running down the hall through smoke and the\n        wild strobing of electrical fires as Vukovich steps\n        out of an armory room.  He tosses Traxler an M-16 and\n        they run on.\n\n                                               CUT TO:\n\n\n171     INT. MAIN CORRIDOR                                     171\n\n        Terminator stops before another door.  He BLASTS the lock\n        with the riot-gun.  Flings open the door, scanning.\n        Moves on.\n        He is hit twice, chest and leg.\n        Firelight flickers from an office doorway as he passes.\n\n                                               CUT TO:\n\n\n172     INT. VUKOVICH'S OFFICE                                 172\n\n        Sarah scrabbles for a place to hide in the darkened room\n        but it's so tiny.  Behind the desk.  She crouches unable to\n        believe she has awakened into the same nightmare.\n\n                                               CUT TO:\n\n\n173     INT. OFFICE NEARBY                                     173\n\n        ANGLE ON DOOR as it splinters open and Terminator stands,\n        guns raised.  A COP fires from behind a desk.\n        Terminator sprays the room.\n        Starts to reload.\n\n                                               CUT TO:\n\n\n174     INT. CORRIDOR\n\n        Vukovich edges open a door and fires half a clip into\n        Terminator's back.  His eyes  bulge as the intruder turns,\n        slamming a clip into his rifle and calmly fires two rounds.\n        Traxler drags Vukovich's body back inside the room.\n\n                                TRAXLER\n                      Ed!  Ed...?\n\n                                               CUT TO:\n\n\n175     INT. CORRIDOR                                          175\n\n        TIGHT ON TERMINATOR, moving forward, intent\n\n                                               CUT TO:\n\n\n176     INT. VUKOVICH'S OFFICE                                 176\n\n        MEDIUM ON SARAH, her teeth are chattering with fear as\n        SHOTS echo nearby.  There is the RHYTHMIC THUNDER of the\n        shotgun, rattling AUTOMATIC FIRE, SCREAMING, and the sound\n        of RUNNING FEET.  Getting closer.\n\n        SLOW DOLLY IN ON SARAH begins, ending in TIGHT C.U. as the\n        sounds get louder.  More SHOTS.\n        Smoke begins to seep under the door.\n\n        DETAIL - DOORKNOB rattling as it is tried from outside.\n\n        E.C.U. - SARAH stifling a cry.  She flinches as if slapped\n        as SHOTS sound.\n\n        DETAIL - DOOR KNOB, a series of SHOTS shatter the lock.\n\n        FULL ON DOORWAY - The door bangs open and a figure stands\n        silhouetted in the smoky hallway, holding a pistol.\n\n        E.C.U. - SARAH, as she closes her eyes.  Holds her breath.\n\n                                REESE (V.O.)\n                      Sarah?\n\n        FULL SHOT - She scrambles out from beneath the desk and runs\n        to him in the thickening smoke.\n\n                                               CUT TO:\n\n\n177     CONNECTING OFFICES                                     177\n\n        PANAGLIDE FOLLOWING REESE AND SARAH as they cross the\n        corridor and move through a series of offices, doubling back\n        toward the main entrance.\n\n                                               CUT TO:\n\n\n178     INT. OFFICE                                            178\n\n        Sarah and Reese move rapidly through the smoke.\n        Gunfire sounds nearby.  They pass bodies.\n\n                                VUKOVICH (V.O.)\n                           (weakly)\n                     Reese!\n\n        They find the Lieutenant propped in a corner, dying.\n        Reese bends toward him.\n        Vukovich holds out his custom Colt Python .357.\n\n                                VUKOVICH\n                           (continuing)\n                     You just keep her alive.  Do\n                     what you have to.\n\n        Reese snatches the gun and the keys and runs on.\n\n        C.U. - VUKOVICH watching them go.\n\n                                               CUT TO:\n\n\n179     INT./EXT. OFFICES/SIDE ENTRANCE - NIGHT                179\n\n        FAST PANAGLIDE PRECEDING TERMINATOR as he runs through\n        the smoky rooms.  A fire is burning, lighting everything\n        a flickering orange.\n        He emerges onto a landing through a side entrance.  PAN\n        to follow his line of sight as he snaps the AR-180 to\n        his shoulder.  B.G. a BLUE VOLKSWAGEN RABBIT is roaring\n        away across the parking lot.\n\n        TIGHT ON TERMINATOR aiming carefully.  He pulls the trigger.\n        It clicks...empty.  Slowly he lowers the scope-sight from\n        his eye and watches them go.\n\n        Terminator limps down the steps from the landing and walks\n        away as the fire spreads behind the windows of Division\n        Headquarters.\n\n                                               CUT TO:\n\n\n180     INT. RABBIT - NIGHT                                    180\n\n        DETAIL - GAS GAUGE, it reads EMPTY.\n\n                                               CUT TO:\n\n\n181     EXT. HIGHWAY - NIGHT                                   181\n\n        The Rabbit is stopped on the shoulder of a two lane\n        secondary road winding through the hills north of L.A.\n        Reese is fishing objects out of the car's trunk and\n        handing them to Sarah, who holds a flashlight.\n        He hands her a blanket, some road flares, and a first\n        aid kit.  Then he slams the trunk.  Reaching through the\n        side window, he turns the wheel and pushes the car off\n        the shoulder, over the embankment.\n\n        DOWN ANGLE INTO RAVINE, past Sarah and Reese, as the car\n        trundles down crashing through the underbrush to dis-\n        appear among the trees.\n\n        Reese looks out across the valley and the lights of L.A.\n        A helicopter circles in the distance, searchlight on.\n\n                                REESE\n                     Let's get off the road.\n\n                                               CUT TO:\n\n\n182     INT./EXT. DRAINAGE CULVERT - NIGHT                     182\n\n        ANGLE LOOKING OUT from the mouth of an enclosed concrete\n        storm drain that passes under the road.  Reese, followed\n        by Sarah, trudges down the slope and ducks inside.\n        The floor is wet but he doesn't seem to mind.\n        They both hunker down with their backs to the concrete,\n        facing each other.\n        They look beaten, grimy, exhausted.\n        She huddles under the blanket, waif-like.\n\n                                REESE\n                      You cold?\n\n                                SARAH\n                      Freezing.\n\n                                REESE\n                      Come here.\n\n        She sits beside him and they wrap their arms around each\n        other with the blanket covering both of them.\n\n                                SARAH\n                      Reese...you got a first name?\n\n                                REESE\n                      Kyle.\n\n                                SARAH\n                      Kyle, what's it like when you\n                      go through time?\n\n                                REESE\n                      White light.  Pain.  Like\n                      being ripped inside out...\n                      slowly.  Like being born,\n                      maybe.\n\n        Sarah scowls and draws her hand out from under his jacket.\n\n                                SARAH\n                      You're wet.  Oh my god.\n\n        In the beam of the flashlight her hand is glistening\n        with blood.\n\n                                REESE\n                      I caught one, back there.\n\n                                SARAH\n                           (incredulous)\n                      Caught one?  You mean you\n                      got shot?\n\n        Reese shrugs.\n\n                                REESE\n                      It's not bad.\n\n        Sarah sits up and turns toward him.\n\n                                SARAH\n                      We gotta get you to a doctor.\n\n                                REESE\n                      It's okay.  Forget it.\n\n                                SARAH\n                      Forget it?  Are you crazy?\n                      Let me see it.\n\n        Sarah opens his jacket and the flashlight beam shows his\n        shirt bloodsoaked at the shoulder.\n\n                                SARAH\n                           (continuing)\n                      Jeez.  You idiot.  Take\n                      this off.\n\n        She cradles the flashlight between her knees and opens\n        the first aid kit as he removes his jacket.\n\n                                REESE\n                           (looking at the\n                           wound)\n                      See.  Missed everything.\n                      Passed through the meat.\n\n        Sarah starts swabbing the flesh wound.\n\n                                SARAH\n                      This is gonna make me puke.\n                      Talk about something.\n\n                                REESE\n                      What?\n\n                                SARAH\n                      Just talk.  Tell me about\n                      my son.  Is he tall?\n\n        She places a gauze pad in place and starts to wrap it.\n\n                                REESE\n                      About my height.  He\n                      has your--\n                           (winces)\n                      ...damn...he has your\n                      eyes.\n\n        Sarah glances at his face for a second and then goes back\n        to work.\n\n                                SARAH\n                      What's he like?\n\n                                REESE\n                           (thoughtful)\n                      You trust him.  He's got that\n                      strength.  You'd die in a\n                      second for John.\n\n                                SARAH\n                      Well, at least I know what\n                      to name him.  I don't suppose\n                      you'd know who the father is?\n                      So I don't tell him to get\n                      lost when I meet him.\n\n                                REESE\n                      John never said much about\n                      him.  He dies.  Even before\n                      the war...\n\n                                SARAH\n                           (interrupting)\n                      Stop!  I don't want to know.\n                      Hold still.  So...it was John\n                      that ordered you here?\n\n                                REESE\n                      I volunteered.\n\n                                SARAH\n                      You volunteered?\n\n                                REESE\n                      It was an honor.  A chance\n                      to meet the legend.  Sarah\n                      Connor.  Who taught her son\n                      to fight...organize, prepare.\n                      From when he was a kid.  When\n                      you were in hiding, before\n                      the war.\n\n        She stops taping.  She seems lost, her bravado dissipated.\n\n                                SARAH\n                      You talk about things I haven't\n                      done yet in the past tense.  It's\n                      making me crazy.  I can't think.\n                           (pause)\n                      Are you sure you've got the\n                      right person?\n\n        Reese appraises her coldly.\n\n                                REESE\n                      I'm sure.\n\n                                SARAH\n                      Come on, me? The mother\n                      of the future?  Am I tough?\n                      Organized?  I can't even balance\n                      my checkbook.  I cry when I see\n                      a cat that's been run over...\n                      and I don't even like cats.\n\n        She pulls the bandage tight with a knot.\n\n                                REESE\n                      Ow!  No, it's okay.  It's\n                      better tight.\n\n                                SARAH\n                      And anyway, what do I know\n                      about guerrilla warfare?\n\n                                REESE\n                      You'll learn.\n\n                                SARAH\n                           (angry)\n                      Look, Reese, I didn't ask for\n                      this honor and I don't want it.\n                      Any of it.\n\n                                REESE\n                      John gave me a message for\n                      you.  Made me memorize it.\n                      'Sarah\"...this is the message...\n                      'Sarah, thank you.  For your\n                      courage through the dark years.\n                      I can't help you with what you\n                      must soon face, except to tell\n                      you that the future is not set...\n                      there is no such thing as Fate,\n                      but what we make for ourselves\n                      by our own will.  You must be\n                      stronger than you imagine you\n                      can be.  You must survive, or I\n                      will never exist.'  That's all.\n\n        Sarah stares at him as the enormity of it all becomes real\n        to her.  Reese moves his arm, testing the bandage.\n\n                                REESE\n                           (continuing)\n                      Good field-dressing.\n\n                                SARAH\n                           (brightening)\n                      You like it?  It's my first.\n\n        He rebuttons his shirt and they return to the warmth-\n        conserving embrace.  Sarah gazes out the entrance, into\n        the night.\n\n                                REESE\n                      Sleep.  It'll be light soon.\n\n                                SARAH\n                           (closing her\n                           eyes)\n                      Okay.  Talk some more.\n\n                                REESE\n                      About what?\n\n                                SARAH\n                           (murmuring)\n                      About where you're from.\n\n        Kyle watches the helicopter circling far in the distance.\n\n                                REESE\n                      Alright.\n                           (pause)\n                      You stay down by day, but at\n                      night you can move around.\n                      The H-K's use infra-red so you\n                      still have to watch out.\n                      But they're not too bright.\n                      John taught us ways to dust them\n                      them.  That's when the infiltra-\n                      tors started to appear.  The\n                      Terminators were the newest,\n                      the worst...\n\n        During his monologue we have PANNED into the darkness outside\n        and to the helicopter, which flies OUT OF FRAME, leaving\n        black.  A ROTOR ROAR fades up.\n\n                                               CUT IN BLACK TO:\n\n\n183/FX  EXT. CITY RUINS, 2029 - NIGHT                          183/FX\n\n        Black sky.  Stars.\n        With a roar an AERIAL PATROL CRAFT enters close overhead.\n        It has flashing red and blue lights and powerful search-\n        lights which stab down.\n\n        TILT DOWN\n\n        to a vista of moonlit devastation.\n        White ash blows in drifts among fire-gutted ruins.\n        Blackened bones lie everywhere in heaps.\n        Searchlights sweep the night.\n        Another aerial unit hovers several blocks away, firing\n        tracers into the ruins.\n\n                                               CUT TO:\n\n\n184/FX  EXT. RUINS/STREET - NIGHT                              184/FX\n\n        LOW ANGLE\n\n        as a gleaming chrome H-K grinds through the debris of the\n        shattered street on its tank-like tracks, crushing burnt\n        skulls.\n        Its head turns slowly, playing high-intensity lights over the\n        buildings.\n        Its hydraulic arms are folded, mantis-like, against its\n        'torso'.  After it passes a number of human figures dart\n        from shadow to shadow, B.G.\n\n                                               CUT TO:\n\n\n185     INT. TUNNELS - NIGHT                                   185\n\n        Reese is among a SQUAD OF MEN in black fatigues, carrying\n        equipment and energy rifles, who enter a debris-littered\n        tunnel.\n\n        PANAGLIDE WITH THEM as they trot through a labyrinth of\n        tunnels, pass several guard-posts.  Reese has a GERMAN\n        SHEPHERD on a short leash.\n\n                                               CUT TO:\n\n\n186     INT. PARKING STRUCTURE - NIGHT                         186\n\n        The platoon enters a cavernous chamber, an old parking\n        structure, in which a large group is gathering.\n        As the entrance, ARMED SENTRIES with dogs are passing in\n        new arrivals: men wearing mismatched uniforms or rags and\n        carrying all types of weapons from lasers to shotguns.\n        Weapons are left at the sentry post.\n\n        FOLLOWING REESE as he patrols the perimeter.\n        He walks along a row of CARS, models from the eighties and\n        nineties, now stripped, rusty and modified to carry weapons.\n        There are conventional military vehicles as well.\n        He passes several family groups.\n        Gaunt kids are huddles around an old TV SET.\n        Its glow bathes them.\n\n        REVERSE ANGLE reveals that the set has been gutted and a\n        small cookfire crackles inside the shell.\n        Nearby a kid has a LARGE RAT cornered and is whacking it\n        with a stick.\n\n        Reese pauses at the end of the row of vehicles and unsnaps\n        a pocket in his tunic, removing a small paper rectangle,\n        a worn photograph.\n\n        C.U. - REESE, gazing down.  His head snaps around at the\n        sudden sound of BARKING.\n\n        ANGLE ON SENTRY POST as the dogs go crazy.\n\n                                SENTRY\n                           (shouting)\n                      Terminator!\n\n        An innocuous, RAG-DRESSED MAN flips back his poncho to\n        reveal a powerful PLASMA-RIFLE.  He opens FIRE, running\n        forward.  ENERGY BOLTS rip into the crowd.\n\n        MOVING WITH REESE, running toward the Terminator.\n\n        RAPID CUTS:\n\n        POWERBOLTS EXPLODE among the fleeing people.\n        Beams sear the darkness.\n        A running CHILD is BURST by a plasma hit.\n\n        ANGLE ON REESE running.  He levels his energy-rifle and\n        starts firing.  A powerbolt grazes his cheek, EXPLODING\n        a support column behind him.  Part of the ROOF COLLAPSES\n        as Reese tumbles.\n\n        Everything is lit as if by lightning.\n\n        C.U. - REESE, semi-conscious.  Burned.  Bleeding.\n        Impressions implode on him: running feet, flashes, energy\n        beams raking the ground leaving molten worm-tracks, scream-\n        ing, a burning dog howling.\n\n        DETAIL - The picture Reese has been looking at has fallen,\n        forgotten.  It catches fire and starts to curl.  Before\n        the image vanishes we see that it is a picture of Sarah.\n\n        Reese looks up.\n        A figure looms above, a silhouette in the smoky, hellish\n        glare.  THE TERMINATOR.  Its  eyes glow red.\n\n        A brilliant EXPLOSION WHITES OUT THE SCREEN.\n\n                                               CUT TO:\n\n\n187     INT. CULVERT - DAWN                                    187\n\n        C.U. - SARAH, brightly lit by daylight.  Asleep.  She grimaces\n        and groans.\n        In the distance a dog is barking.\n\n        Reese, still holding her, lightly lifts her hair from her\n        face.  An uncharacteristically tender gesture.  He gently\n        caresses her cheek with the backs of his fingers.  When\n        she awakens suddenly he snaps his hand away.\n\n        Sarah looks around, momentarily disoriented.  Looks up at\n        Reese.\n\n                                SARAH\n                      I was dreaming about dogs.\n\n        Reese extricates himself from her and steps out of the\n        culvert.\n\n                                REESE\n                      We used them to spot Terminators.\n\n        Sarah groans as she straightens her legs.\n\n                                SARAH\n                      Your world...it's pretty\n                      terrifying.\n\n                                               CUT TO:\n\n\n189     EXT. HIGHWAY - DAWN                                    189\n\n        Sarah catches up to him just as he is about to try and\n        stop an approaching car.  She pulls his gun hand down with\n        both of hers.\n\n                                SARAH\n                      Put that away.  I'll get one.\n\n        She hold out her thumb to passing traffic.\n        Reese watches this incomprehensible ceremony skeptically.\n\n                                SARAH\n                           (continuing)\n                      This works...really.\n\n                                               CUT TO:\n\n\n189A    EXT. HIGHWAY/PICKUP - DAY                              189A\n\n        Reese and Sarah are crammed into the cab of a beat-to-hell\n        PICKUP TRUCK with the DRIVER, obviously a surfer.  Laid-\n        back, long-haired and well-tanned.\n        Reese glowers and watches the scenery through slitted eyes.\n\n                                DRIVER\n                      ...and when it breaks right\n                      off the point they get some\n                      pretty rad tubes up there.\n                      Not awesome, but I mean, worth\n                      the drive, if you're hardcore\n                      like me.\n\n                                REESE\n                           (to Sarah)\n                      Rad tubes?\n\n                                SARAH\n                           (to Reese)\n                      He's a surfer.\n\n                                DRIVER\n                      You from back East of\n                      something?\n\n                                SARAH\n                      No, he's from the future.\n\n                                DRIVER\n                      Whoah.  I hear that.\n                           (pause)\n                      Listen, I had a rough\n                      night.  I gotta stop and\n                      bag some Z's.\n\n        They pull off the highway toward a gas station/rest area.\n\n                                               CUT TO:\n\n\n190     EXT. SERVICE STATION - DAY                             190\n\n        The gas station is like an oasis of clutter in a rolling\n        stretch of meadows and woods.  It consists of a bunker-\n        like building with restrooms and a flanking PICNIC AREA,\n        beyond which are WOODS.\n        People sit under the trees, enjoying the beautiful day\n        while children tear around after the forced inactivity of\n        a long trip.\n\n        The three of them get out on unsteady legs.\n\n                                DRIVER\n                      You can still ride if\n                      you wanna hang out for a\n                      couple hours.\n\n                                SARAH\n                      Thanks.\n\n                                REESE\n                      Bag some Z's?\n\n                                SARAH\n                      Let's get cleaned up, Kyle.\n\n        She heads for the WOMEN'S RESTROOM and Kyle follows her\n        inside.\n\n                                REESE\n                           (pushing him out)\n                      Yours is over there.\n\n        Instead of following her directions to the Men's Room,\n        Kyle wanders toward the drinking fountain.  A bunch of\n        kids are running around and throwing water at each other\n        with paper cups.\n\n        Reese shambles through them like a zombie.\n        He stands among the children, an alien in this land without\n        fear.  He watches people at picnic tables laughing and\n        listening to portable music.  Kids squeal.  Dogs bark.\n\n                                LITTLE GIRL (V.O.)\n                      Can you get my balloon?\n\n        DOWN ANGLE on an achingly beautiful LITTLE GIRL of about\n        four.  She points above his head.\n\n        Reese looks up to see a helium-filled mylar balloon stuck in\n        the foliage of a tree just above him.  He pulls it down by\n        the string and holds it, turning it over dully.\n\n        He crouches down to her eye-level.  She smiles.\n\n                                REESE\n                      Aren't you afraid to be out in\n                      the open like this?\n\n                                LITTLE GIRL\n                      Huh?\n\n        Reese whirls reflexively at a SCREAM behind him.  The\n        mylar balloon bursts in his tense hands.  A teenage girl\n        is being doused with water by the boys with plastic jugs.\n\n        The little girl looks at the broken balloon, then glares\n        at Reese.  She punches him soundly on the shoulder and\n        storms off.\n\n        At this moment she is bowled over by an IRISH SETTER that\n        licks her face while she shrieks with laughter.\n        Reese seems about to smile but doesn't quite know how to\n        go about it.\n\n                                               CUT TO:\n\n\n191     EXT. SERVICE STATION/PAY PHONE - DAY                   191\n\n        Sarah is talking on an open pay phone.\n\n                                SARAH\n                      ...I know, Mom.  This is the\n                      soonest I could...I know.\n                      Mom...Mom, I can't talk long.\n                      No, I'm okay.\n                           (pause)\n                      I was on TV?  Really?\n                           (pause)\n                      Oh no, I hate that picture...\n                      why didn't you give them my\n                      graduation picture?\n                           (pause)\n                      I'm okay, really.  Listen, I\n                      want you to pack some stuff\n                      and go up to the cabin for a\n                      few days.  Just don't...no,\n                      don't ask any questions.\n                      Just do it.  I gotta get\n                      going...gotta go.  Bye, bye.\n\n        Sarah has been idly leafing through the DIRECTORY.  On\n        a whim she looks up something.\n        She freezes for a moment when she finds the listing.\n        Then with a triumphant expression she rips the page out\n        of the book.\n                                               CUT TO:\n\n\n192     EXT. SERVICE STATION/PICNIC TABLE - DAY                192\n\n        Sarah is sitting at a table under a tree, lettering\n        something with a lipstick on a cardboard box-flap.\n\n        E.C.U. - SIGN, as the last letters are finished.\n        It reads:\n        SILICON VALLEY\n\n        FULL ON SARAH as she retracts the lipstick and leans\n        across to hand it to a girl at the next table.\n\n                                SARAH\n                      Thanks a lot.\n\n                                REESE (V.O.)\n                      What's that?\n\n        Sarah looks up, startled to see him standing beside her.\n\n                                SARAH\n                      That's where we're going.\n\n                                REESE\n                      Why?\n\n        Sarah point to the directory page lying on the table.\n\n        MACRO - PAGE\n\n        Sarah's finger points to a listing which reads:\n\n        CYBER DYNAMICS CORPORATION\n        18144 El Camino Real, S'Vale\n\n        ANGLE ON SARAH AND REESE\n\n        She looks smug.\n\n                                SARAH\n                      Look.  I found it.  Isn't\n                      that it?  Cyber Dynamics\n                      Corporation?\n\n                                REESE\n                      What about it?\n\n                                SARAH\n                      Didn't you say that they're\n                      going to develop this\n                      revolutionary new thing...\n\n                                REESE\n                      Molecular-memory.\n\n                                SARAH\n                      Whatever...they become the\n                      hotshot computer guys so they\n                      get the job to build El Computer\n                      Grande...Skynet...for the\n                      government.  Right?\n\n                                REESE\n                           (uneasy)\n                      That's the way it was told\n                      to me.\n\n        Sarah's fear has been replaced by excitement.\n\n                                SARAH\n                      Well, we're gonna uninvent the\n                      bastard.  Eighty-six it.  We'll\n                      blow up the place...burn it\n                      down.  Something.\n\n                                REESE\n                           (very cold)\n                      Tactically dangerous.  We\n                      lay low.\n\n                                SARAH\n                      Reese.  Think it through.\n                      We can prevent the war.\n                      Nobody else is gonna do it.\n                      If we go to anybody official\n                      we wind up back in jail and\n                      then that walking cuisinart\n                      has got us again.  We have to\n                      so it ourselves.\n\n                                REESE\n                      That's not my mission.\n\n                                SARAH\n                           (upset, mocking\n                           his manner)\n                      Listen.  Understand.  I'm\n                      not a military objective,\n                      Reese.  I'm a person...\n                      You don't own me.\n\n        Reese takes her arm and pulls her to her feet.\n\n                                REESE\n                      Let's go.  Time to move out.\n\n                                SARAH\n                      Fuck you!  Let go of me!\n\n        She jerks her arm free.  He reaches for her again but\n        she outdistances him, running.\n\n                                REESE\n                           (warning tone)\n                      Sarah!\n\n        She dashes down a footpath among the trees, clutching her\n        sign.  Reese follows her into the woods.\n\n                                               CUT TO:\n\n\n193     EXT. WOODS/CLEARING - DAY                              193\n\n        Only a few yards from the picnic area, the woods take over\n        completely.\n\n        PANNING WITH SARAH\n\n        as she runs down the path.\n        Reese tackles her from behind and they fall together in\n        the long spring grass.\n        She struggles violently to get away.\n\n                                SARAH\n                      Let...go...bastard...\n\n        She gets one arm free and whacks him hard in the face.\n        Reese reacts instinctively, leaping back in a defensive\n        crouch.  Sarah freezes when she sees the .357 in his\n        hand.\n\n                                SARAH\n                           (continuing,\n                           scared, but\n                           angry)\n                      Oh, that's real smart.\n                      Go on, shoot me. That's\n                      brilliant.\n\n        Reese is trembling as he lowers the gun.\n        Sarah too is shaking with emotion.  Tears roll down her\n        cheeks and her voice cracks.\n\n                                SARAH\n                           (continuing)\n                      Jesus Christ, Reese.  Can't\n                      you see I'm scared?\n\n        He straightens up and his arms go limp at his sides.\n        He turns away.\n\n                                SARAH\n                           (continuing)\n                      I can't spend my life waiting\n                      for that thing to catch up\n                      with me...always looking over\n                      my shoulder, wondering if I\n                      left some tiny clue behind...\n\n        Reese doesn't respond.\n        The gun slips from his fingers.\n        His will seems to drain from him and he sags to his knees.\n        The moment stretches.\n        There is only the sunlight moving in shafts through the\n        leaves, the sound of a small stream nearby, birds chirping.\n\n                                SARAH\n                      Reese?\n\n        She crawls over to him.\n\n        C.U. - REESE\n\n        in profile, with Sarah in B.G.\n        His eyes are closed.\n        A tear meanders down his cheek.\n\n                                SARAH\n                           (continuing,\n                           quietly)\n                      Kyle?\n\n                                REESE\n                           (a whisper)\n                      I'm wrong here.  I wasn't\n                      meant to see this...\n\n        He gestures at their surroundings.\n\n                                REESE\n                           (continuing)\n                      It's...like some dream.\n                      This...this...\n\n        He touches the grass, the trunk of a tree.\n\n                                REESE\n                           (continuing)\n                      ...and you...all so...beauti-\n                      ful.  It hurts, Sarah.  More\n                      than death.\n\n        He looks are her beseechingly.\n\n                                REESE\n                           (continuing)\n                      Don't you understand...it's\n                      all gone!\n\n        Sarah puts her arm around him.\n        She sniffs and wipes at her nose with the back of her hand.\n\n                                SARAH\n                      We can change it, Kyle.  We\n                      have to try.\n\n        She takes his shoulder in her hands.\n\n                                SARAH\n                           (continuing)\n                      There's no fate but what we\n                      make for ourselves. Right?\n                      Come on.  Let's go, kiddo.\n                      Whaddya say?\n\n        He picks up her sign and they look at each other for a\n        second, then get up.\n\n                                               CUT TO:\n\n\n194     INT. TERMINATOR'S HOTEL ROOM - DAY                     194\n\n        Terminator sits in his room with the blinds drawn tight.\n        Murky.  Claustrophobic.  With knife-slits of hot sunlight.\n\n        MEDIUM ON TERMINATOR\n\n        sitting on the edge of the bed.\n        His appearance isn't improving.\n\n        A patch of SCALP is blown away, revealing CHROME underneath.\n        A flap of skin dangles from his cheek, which exposes some\n        of the DRIVE CABLES which move the lips.\n        He is scanning Sarah's address book, turning a page every\n        two seconds.\n\n        C.U. - TERMINATOR\n\n        his eyes tracking rapidly.  His skin is waxy, WHITE, BRUISED,\n        GANGRENOUS in places.  He ignores the FEW FLIES crawling\n        on his face.\n\n                                               CUT TO:\n\n\n194A/FX POV - TERMINATOR                                       194A/FX\n\n        Showing Sarah's book.\n        In microseconds the handwritten entries are translated\n        into CRT-type characters and displayed to one side of the\n        screen.  This updates instantly as the page is turned.\n\n                                               CUT TO:\n\n\n195     INT. HOTEL CORRIDOR - DAY                              195\n\n        A MIDDLE-AGED MAN with a torn T-shirt covering his paunch\n        knocks on the door.  He is wheeling a trash cart.\n\n                                MAN\n                      Hey, buddy, you got a\n                      dead cat in there of what?\n\n                                               CUT TO:\n\n\n196     INT. TERMINATOR'S HOTEL ROOM - DAY                     196\n\n        TIGHT ON TERMINATOR\n\n        as he looks up.\n\n                                               CUT TO:\n\n\n197/FX  POV - TERMINATOR                                       197/FX\n\n        The digitized image PANS to the door and a LOGIC-FLOW\n        DIAGRAM appears overlaid in color-coded words.  It con-\n        cluded with a list of potential appropriate responses:\n\n        YES/NO\n        OR WHAT\n        GO AWAY\n        PLEASE COME BACK LATER\n        FUCK YOU\n        FUCK YOU, ASSHOLE\n\n        The last begins to FLASH, and enlarges to fill the screen.\n\n                                               CUT TO:\n\n\n198     RESUME ANGLE\n\n                                TERMINATOR\n                      Fuck you, asshole.\n\n        He returns to his scan.\n\n                                               CUT TO:\n\n\n199     INT. CORRIDOR - DAY                                     199\n\n        The man shrugs and walks down the hall.\n\n                                               CUT TO:\n\n\n200     EXT. MOTEL - DAY\n\n        The two fugitives walk toward an economy motel of the\n        two-story park-by-the-door variety.\n        Sarah turns to wave as a TRACTOR-TRAILER pulls away noisily,\n        heading back to the Interstate.  The driver answers her wave\n        out the side window.  Reese stops for a moment outside the\n        motel office to pet a GERMAN SHEPHERD sitting on the porch.\n        The dog wags its tail and licks his hand.\n\n        Reese opens the door and they go in.\n\n                                               CUT TO:\n\n\n201     INT. MOTEL OFFICE - DAY                                201\n\n        Reese pulls a crumpled wad of bills from his jeans and shows\n        it to Sarah.\n\n                                REESE\n                      Is this enough?\n\n                                SARAH\n                      Yes.  And I don't want to\n                      know where you got it.\n\n        She turns to the desk clerk, a female version of the pawn-\n        shop lizard.\n\n                                SARAH\n                           (to clerk)\n                      We need a room...with a\n                      kitchen.\n\n                                               CUT TO:\n\n\n202     INT. MOTEL ROOM - DUSK\n\n        Kyle and Sarah enter the spartan room.\n\n                                SARAH\n                      I'm dying for a shower.  You\n                      could use one too.  And we'd\n                      better check that bandage.\n\n                                REESE\n                      Later.  I'm going out for\n                      materiel.  Keep this.\n\n        He hands her the .38 he took off the detective.\n\n        She takes it without thinking as he leaves then realizes\n        that she has A LOADED GUN IN HER HAND, without the slightest\n        idea of how to use it.  She lays it gently on the dresser.\n        As an afterthought, she turns it with one finger so that it\n        is pointing the other way.\n\n        Sarah moves the curtain slightly and looks outside.\n\n                                               CUT TO:\n\n\n203     EXT. MOTEL - DUSK                                      203\n\n        Reese walks away toward a commercial area visible down the\n        road.\n\n                                               CUT TO:\n\n\n204     INT. MOTEL ROOM - NIGHT                                204\n\n        Sarah is on the phone, her hair still wet from a shower.\n        She sits on the bed with a towel wrapped around her.\n\n                                SARAH\n                      ...No, Mom, I can't tell you\n                      where I am.  I was told not\n                      to say.\n\n                                SARAH'S MOM (V.O.)\n                           (filtered)\n                      But honey, I need to know where\n                      I can reach you or I'll be\n                      worried sick.  It turns out I\n                      can't stay up here...the\n                      electricity's off...and I don't\n                      know just where I'll be.\n\n        Sarah hesitates, then:\n\n                                SARAH\n                      Okay, here's the number.  Are\n                      you ready?\n\n                                SARAH'S MOM (V.O.)\n                           (filtered)\n                      Go ahead.\n\n                                               CUT TO:\n\n\n205     INT. MOUNTAIN CABIN - NIGHT                            205\n\n        SLOW PAN around the room as the conversation between Sarah\n        and her Mom continues, completely VOICE OVER.\n\n                                SARAH (V.O.)\n                           (filtered)\n                      It's 408-972-1439.  Room 14.\n\n                                SARAH'S MOM (V.O.)\n                           (filtered)\n                      I got it.\n\n        The PAN continues, revealing an overturned chair.\n\n                                SARAH (V.O.)\n                           (filtered)\n                      Okay, I've gotta go.  I'm\n                      sorry I can't tell you very\n                      much now, Mom.  I love you.\n\n        The PAN comes to a table.  Smashed plates.  Spilled coffee.\n        A spatter of blood.  A phone.  It follows the phone cord\n        onto Terminator in CLOSE-UP as he continues in a perfect\n        simulation of her mother's voice...\n\n                                TERMINATOR (MOTHER'S VOICE)\n                      I love you too, sweetheart.\n\n                                               CUT TO:\n\n\n206     INT. MOTEL ROOM - NIGHT                                206\n\n        Sarah hangs up the phone, vaguely disturbed.\n\n                                               CUT TO:\n\n\n207     INT. MOUNTAIN CABIN - NIGHT                            207\n\n        Terminator rapidly dials the number Sarah gave.\n\n                                TERMINATOR (HIS VOICE)\n                      Hello.\n                           (pause)\n                      Tell me your address there.\n\n                                               CUT TO:\n\n\n208     INT. MOTEL ROOM - NIGHT                                208\n\n        TIGHT ON SEVERAL GROCERY BAGS\n\n        covering the counter beside the hot-plate in the tiny\n        apartment.\n\n        Reese's hands split one open and its contents spill out.\n\n        FULL SHOT\n\n        Sarah looks through Reese's haul.\n\n                                SARAH\n                      Let's see.  Corn syrup.\n                      Ammonia.  Moth balls...\n                      Mmm.  What's for dinner?\n\n                                REESE\n                           (preoccupied)\n                      Plastique.\n\n        There are also boxes of shotgun shells, road flares, tape,\n        scissors, pans, a strainer and many other odd utensils,\n        substances, chemicals.\n\n                                SARAH\n                      What's that?\n\n                                REESE\n                      Nitroglycerin, basically.\n                      Bit more stable.  I learned\n                      howto make it when I was a\n                      kid.\n\n        Sarah looks a bit stricken as she contemplates the evening\n        ahead.\n\n                                               CUT TO:\n\n\n209     EXT. HIGHWAY/CHEVY CAMARO - NIGHT                      209\n\n        The dashlight illuminated Terminator from beneath as he drives\n        through the night.  He looks like Death.  His left eye\n        glows a faint red in the darkness.\n\n                                               CUT TO:\n\n\n210     INT. MOTEL ROOM - NIGHT                                210\n\n        A heartwarming domestic scene.\n        Sarah and Kyle have pulled the dresser out to use as a\n        worktable.  Pans, packages and bottles clutter the kitchen,\n        B.G.  On the table between them are eight ten-inch lengths\n        of PLUMBER'S PIPE, threaded each end.  Kyle is showing\n        Sarah how to tamp the HIGH-EXPLOSIVE PUTTY into the pipe\n        bombs and seal them shut.\n\n                                REESE\n                      Make sure there's none on the\n                      threads, like this.  Now screw\n                      the end-cap on...very gently.\n\n\n                                SARAH\n                      You must have had a fun child-\n                      hood.\n\n                                REESE\n                      That's good.  Now, seven more\n                      like that while I make fuses.\n\n                                SARAH\n                      I was thinking, there's so\n                      much I've got to show you\n                      when we get through this.\n                      It's mind boggling, the pos-\n                      sibilities...Disneyland, the\n                      beach, movies...matinees with\n                      popcorn and foot-long hot dogs...\n\n                                REESE\n                      Hot dogs?\n\n                                SARAH\n                      I want to buy you a hot dog so\n                      bad,Kyle...all the things you've\n                      never seen and done.  You're here,\n                      but wherever you go, and whatever\n                      you touch, you bring the war with\n                      you.\n\n                                REESE\n                      My whole life has been combat.\n\n                                SARAH\n                      I want it to be over for you.\n\n                                REESE\n                      Not possible.\n\n                                SARAH\n                      I want it to be over for me too.\n                      I feel like I slipped over some\n                      invisible line, that I'm in your\n                      world now.  Everything's the same,\n                      but I see it differently.\n                      It's like, there's you and me,\n                      and him...but nobody else can\n                      understand or help or even touch\n                      us.\n\n        Reese looks up and finally catches her gaze.  He reaches\n        out for her hand and it seems he may be taking it to\n        comfort her.\n        But he turns her wrist to read her watch.\n\n                                REESE\n                      We'll head out at 0200.\n                      That gives you four hours\n                      to sleep if you want.  I'll\n                      finish.\n\n                                               CUT TO:\n\n\n211     INT. MOTEL ROOM - NIGHT                                211\n\n        ANGLE ON TABLE - The bombs are neatly ranked, finished.\n        A nylon satchel lies nearby.  The mess is cleaned up.\n\n        WIDE SHOT reveals Reese sitting in silent vigil at the\n        window.  The room is dark, lit only by a streetlight\n        outside.\n        Sarah is asleep on the bed.\n\n        Reese sits cross-legged, shirtless, his body held rigid.\n        The image of discipline.  The .357 is held loosely in one\n        hand on his lap.  There is a fresh bandage on his shoulder.\n\n        Sarah wakes up and goes to him in the darkness.  He looks\n        at her for a moment as she sits beside him, then back outside.\n\n                                SARAH\n                      He'll find us, won't he?\n\n                                REESE\n                      Probably.  Sarah, if I get\n                      zeroed...\n\n                                SARAH\n                      Don't say that.\n\n                                REESE\n                      If I do, you have to get away,\n                      disappear without a trace.\n                      Different country, different\n                      name, everything.  In case they\n                      send another one.\n\n                                SARAH\n                      It'll never be over, will it?\n                      Look at me, I'm shaking.\n                      Some legend, huh?  You must\n                      be pretty disappointed.\n\n                                REESE\n                      No.  I'm not.\n\n        Several beats before Sarah speaks again.  Her eyes seem\n        luminous in the dark.\n\n                                SARAH\n                           (softly)\n                      Kyle, the women in your\n                      time...what were they like?\n\n                                REESE\n                      Good fighters.\n\n                                SARAH\n                      That's not what I meant.\n                      Was there someone special?\n\n                                REESE\n                      Someone?\n\n                                SARAH\n                      A girl.  You know.\n\n                                REESE\n                           (mechanically)\n                      No.\n                           (pause)\n                      Never.\n\n        He looks away, outside the window\n\n                                SARAH\n                           (softly)\n                      I'm sorry.\n\n        Sarah studies him for a moment.\n        She's sitting slightly behind him and she puts her hands\n        on his shoulders and back, tracing the lines of his scars\n        with her fingertips.\n\n                                SARAH\n                      So much pain.\n\n                                REESE\n                      Pain can be controlled.\n                      You disconnect it.\n\n                                SARAH\n                      And so you feel nothing.\n\n                                REESE\n                      It's better that way.\n\n                                SARAH\n                           (with great\n                           sympathy)\n                      Oh, Kyle.\n\n        Reese takes a long, slow breath before he answers, and when\n        he does his voice has a new quality, an unfamiliar tenderness.\n\n                                REESE\n                      John Connor gave me a picture\n                      of you once.  I never knew\n                      why.  It was very old. Torn.\n                      Faded.  You were young, like\n                      you are now.  You weren't\n                      smiling...just a little sad...\n                      I always wondered what you\n                      were thinking at that second.\n\n        He closes his eyes, reaches toward her.  His fingertips\n        trace the contour of her nose, chin, cheeks.\n\n                                REESE\n                           (continuing)\n                      I memorized every line, every\n                      curve...\n\n        He opens his eyes, looking right at hers.\n\n                                REESE\n                           (continuing)\n                      Sarah, I came across time\n                      for you.  I love you.\n                      I always have.\n\n        Sarah is quietly overwhelmed.\n        Reese looks away.\n\n                                REESE\n                           (continuing)\n                      I'm sorry.  I shouldn't\n                      have said...\n\n                                SARAH\n                      Kyle...\n\n\n        She leans forward and kisses him.\n        His face is frozen.  A mask.\n        She continues, tenderly.\n        He begins to respond.\n        The dam breaks and he holds her in a tight, trembling\n        embrace, clinging to her like life itself.\n\n        Kyle picks her up and carries her to the bed.\n        She kisses his neck and chest, tracing his scars with\n        her lips.\n\n        He unbuttons her blouse very slowly.\n        Sarah guides his powerful hands over her.\n\n        A SEQUENCE OF CUTS.  DETAILS.  IMPRESSIONS.\n\n        Sarah, a very close angle, as she grimaces in divine agony.\n        Reese, his face rapt.\n        His hand, clutching the pillow as if to kill it.\n        It is explosive, torrential.  A confluence of fate and will.\n\n                                               CUT TO:\n\n\n212     INT. MOTEL ROOM/LATER - NIGHT                          212\n\n        TIGHT ON SARAH AND REESE in each other's arms.  Lying\n        across his chest, she surveys his face as his eyes close\n        drowsily.\n\n                                SARAH\n                      I bet you're ticklish.\n\n                                REESE\n                           (uncompre-\n                           hending)\n                      Ticklish?\n\n        Sarah's hand moves OUT OF FRAME.  After a moment Reese\n        looks down, puzzled.\n\n                                REESE\n                      What are you doing?\n\n                                SARAH\n                           (continuing\n                           doggedly)\n                      You'll beg for mercy in\n                      a second.\n\n        Reese seems unperturbed.  Finally he begins to squirm.\n\n                                REESE\n                      I don't think I like this.\n\n                                SARAH\n                      You're not supposed to.\n\n        Now Reese is becoming desperate.  A grimace spreads across\n        his face.  It becomes a grin.  Then he's laughing, trying\n        to escape but she won't let him, and they collapse, laughing\n        together.\n        Sarah gazes at his grin, a glimpse of the Reese that might\n        have been, in another life.\n\n        A moment later the grin vanishes at the sound of dogs barking\n        outside.\n        Reese is off the bed in an instant, crouched tense, eyes\n        alert.  Feral as ever.\n\n                                REESE\n                           (whispering)\n                      Listen to the dogs.\n\n                                               CUT TO:\n\n\n213     EXT. MOTEL OFFICE - NIGHT                              213\n\n        The German Shepherd, barking furiously, LUNGES TOWARD\n        CAMERA repeatedly, at the end of a chain.\n\n        A dark figure moves by in the F.G., out of the dog's reach.\n\n                                               CUT TO:\n\n\n214/FX  INT./EXT. MOTEL/TERMINATOR'S POV - NIGHT               214/FX\n\n        The digitized view is image-intensified, bright and stark\n        as a lunar landscape.  PAN OFF the lunging dog to the row\n        of rooms facing the parking lot.\n\n        HANDHELD as we approach the doors.\n        It is WIDE ANGLE and the barrel of the AR-180 is visible at\n        the bottom of FRAME.\n        The nearest vehicle parked in front is a LARGE PICKUP TRUCK\n        WITH TWO DIRT BIKES lashed in the bed, seen prominently as\n        we pass.\n\n        The POV approaches a door.  Number 14.\n\n        The door is KICKED OPEN.\n        Moving inside.\n        The assault rifle sprays the room, exploding the indistinct\n        forms on the bed.  Staccato glare.  Approaching the bed.\n        Nothing there put the shredded remain of sheets and pillows.\n\n        The POV shifts to the BACK DOOR, which is ajar, and moves\n        toward it.  Through the door.  Revealing an EMPTY YARD.\n\n                                               CUT TO:\n\n\n215     INT. PICKUP TRUCK/PARKING LOT - NIGHT                  215\n\n        Reese is under the dash, playing with the wires.\n        Sarah lies on the seat, clutching the nylon satchel, which\n        bulges with the explosive charges.  She has dressed hastily\n        and is barefoot.\n\n                                REESE\n                      Light it now.\n\n        Sarah has been holding a BIC LIGHTER near the tip of a fuse.\n        She thumbs the flame on.  The fuse catches as Reese twists\n        the wires and the engine starts to turn over.\n\n                                               CUT TO:\n\n\n216     INT./EXT. MOTEL ROOM - NIGHT                           216\n\n        Terminator spins at the sound of the truck engine catching.\n\n        FAST PANAGLIDE WITH HIM as he runs the\n        length of the suite, stops outside the front door.\n        Whips the AR to his shoulder.\n\n        The truck is BACKING WILDLY across the lot B.G.\n        Terminator turns, looking into CAMERA as a SIZZLING SOUND\n        becomes audible.\n\n        DETAIL - PIPE CHARGE, lying just inside the door, in the\n        shadows.  The fuse is burning.\n\n        WIDE SHOT - On doorway, from the parking lot, as Terminator\n        takes two leaping strides forward and the CHARGE EXPLODES.\n        The front of the building is BLOWN TO KINDLING.\n        Terminator is flung forward by the blast.\n\n                                               CUT TO:\n\n\n217     EXT. STREET/PICKUP TRUCK - NIGHT                       217\n\n        PANNING RAPIDLY as the truck shoots out of the parking lot\n        and tears down the street.\n\n                                               CUT TO:\n\n\n218     EXT. MOTEL - NIGHT                                     218\n\n        Terminator lies face down, motionless, F.G., as the debris\n        from the blast settles.  A YOUNG GUY ON A HONDA 750 crosses\n        the parking lot and stops near him, running forward.\n        Terminator starts to get up, moving slowly.\n\n                                RIDER\n                           (crouching be-\n                           side him)\n                      Don't try to move, buddy.\n\n        MOVING WITH TERMINATOR as he shoves the cyclist aside and\n        approaches the BIKE, which is STILL RUNNING.\n\n                                               CUT TO:\n\n\n219/FX  PARKING LOT/TERMINATOR'S POV - NIGHT                   219/FX\n\n        Digitized POV, approaching the cycle.  The image reduces\n        to GRAPHIC OUTLINES, with separate systems COLOR-CODED.\n        It breaks down suddenly into individual SIDE, TOP and PLAN\n        VIEWS.  All in less than four seconds.\n\n                                               CUT TO:\n\n\n220     INT./EXT. FREEWAY/PICKUP TRUCK - NIGHT                 220\n\n        Reese slides the truck into an ON-RAMP and guns in onto the\n        freeway, burying the throttle.  Traffic is light...a few\n        18-wheelers.  The truck tops out at 110 and he holds it.\n        They flicker rapidly through pools of light and shadow.\n\n        ANGLE OVER REESE'S SHOULDER as they hurtle forward.  An\n        interchange flashes by in an instant.\n\n        PACING WITH THE TRUCK, looking back as a single headlight\n        arcs radically across all lanes behind them and grows\n        BRIGHTER, CLOSING.\n\n                                               CUT TO:\n\n\n221     EXT. FREEWAY - NIGHT                                   221\n\n        LOW WIDE ANGLE preceding Terminator on the bike.  He is\n        tucked, getting as much speed as possible out of the 750.\n        As he GAINS ON THE CAMERA, FILLING FRAME, he unslings the\n        assault rifle.  Raises it against the windstream in a one-\n        handed pistol grip.\n\n                                               CUT TO:\n\n\n222     INT. PICKUP TRUCK - NIGHT                              222\n\n        Reese motions Sarah to keep her head down.  He pulls the\n        Colt Python from his coat pocket.  Steering with his elbows,\n        he checks the load.  Snaps the cylinder shut.  Glances in\n        the rear mirror.  Turns the wheel.\n\n                                               CUT TO:\n\n\n223     EXT. FREEWAY - NIGHT                                   223\n\n        WIDE ANGLE, following close to Terminator, as he closes on\n        the pickup, B.G.  The truck swerves suddenly, diving around\n        a TRACTOR-TRAILER.  Terminator leans hard to follow.\n\n        LOW WIDE ANGLE preceding the pickup and Terminator as they\n        swerve as high speed.  Reese uses the slow semis as static\n        obstacles.  He misses them by inches, TIRES SQUEALING.\n\n        ANGLE OVER SARAH'S SHOULDER, through the front window as\n        the back of a SEMI-TRAILER hurtles toward them, straight ahead.\n\n        HIGH ANGLE, following both vehicles as Reese feints RIGHT\n        and then skids LEFT.  He slides toward the trailer in a\n        FOUR-WHEEL DRIFT as Terminator commits to the right.\n\n        M.C.U. - TERMINATOR, over the barrel of the AR, as he FIRES.\n\n        SIDE ANGLE - PASSING TRUCK-TRAILER, bullets strafe across\n        it as the pickup vanishes behind.  Terminator skids the\n        bike, barely missing an abutment, and is forced onto an\n        OFF-RAMP.\n\n        LOW SIDE ANGLE preceding Terminator as he roars down the\n        off-ramp without slowing.  Runs the red light at the bottom\n        as a hundred miles an hour.  Climbs the ON-RAMP.\n\n                                               CUT TO:\n\n\n224     INT. PICKUP TRUCK - NIGHT                              224\n\n        Sarah is buffeted as Reese fights to control the skidding\n        truck.  The angle is past Reese, F.G., on Sarah.\n        Terminator appears B.G., converging rapidly as the on-ramp\n        joins the freeway.\n\n                                REESE\n                      Switch places with me.\n\n        She slides over him while he keeps the hammer down.\n\n                                               CUT TO:\n\n\n225     EXT. FREEWAY - NIGHT                                   225\n\n        Reese is out the window to the waist, aiming double-\n        handed.  He FIRES.  ONCE.  TWICE.  AGAIN.\n\n        They enter an interchange.  Ahead lies a LONG, SWEEPING\n        CURVE, two lanes wide and elevated.\n\n        Terminator rocks back from a round between the eyes that\n        bares metal, the FIRES.\n\n        Bullets rake the pickup.\n        The windows are blown out.\n        The side mirror explodes.\n        Reese is hit.  Drops the .357.\n        Sarah screams and weaves, barely in control.\n\n                                               CUT TO:\n\n\n226     INT. PICKUP TRUCK - NIGHT                              226\n\n        Sarah reaches across and pulls Reese's limp body back\n        inside.  He slumps on the seat, moaning.  Stunned.\n\n                                SARAH\n                      Kyle...oh God...\n\n        He has a bullet in the chest.  Another has broken his arm.\n        Sarah feels all hope recede.\n\n                                               CUT TO:\n\n\n227     EXT. FREEWAY - NIGHT                                   227\n\n        Terminator crosses behind the truck, coming up on Sarah's side.\n        He FIRES.\n        Sarah shrieks as the doorpost next to her head CLANGS WITH\n        HITS.\n\n        The short burst EMPTIES THE GUN.\n        It CLATTERS TO THE PAVEMENT a moment later, discarded.\n        Terminator draws the .38.  Takes aim.\n\n        Sarah SCREAMS.  HITS THE BREAKS HARD.  CRANKS THE WHEEL.\n        GLASS behind her EXPLODES with gunfire.\n\n        SWERVING VICIOUSLY the truck SLAMS THE BIKE, sending it\n        FLYING INTO A GUARDRAIL.  Terminator goes over the handle\n        bars at a hundred miles per hour.\n\n                                               CUT TO:\n\n\n228     INT. PICKUP TRUCK - NIGHT                              228\n\n        Sarah fights the wheel, losing control of the slewing pickup.\n\n                                               CUT TO:\n\n\n229     EXT. FREEWAY OVERPASS - NIGHT                          229\n\n        Terminator hits the pavement, tumbling, rolling, sliding\n        with a CHATTERING SCREECH and spraying sheets of SPARKS\n        as flesh strips away and steel screams on concrete.\n        The pickup SWAPS ENDS violently, smashing into the guardrail.\n\n        Terminator hits the guardrail, bounces up, tumbles along the\n        top and then pitches OUT INTO SPACE.\n\n                                               CUT TO:\n\n\n230     EXT. INTERSECTING FREEWAY - NIGHT                      230\n\n        Terminator smashes to the pavement in the middle lane and\n        lies there, face-down.  Still.\n\n                                               CUT TO:\n\n\n231     INT./EXT. PICKUP/OVERPASS - NIGHT                      231\n\n        Sarah is slammed hard as the truck grinds to a stop against\n        the guardrail.  She checks Kyle.  He is barely conscious.\n        Sarah heaves open the door.  Runs to the guardrail. Looks down.\n\n                                               CUT TO:\n\n\n232     EXT. LOWER FREEWAY - NIGHT                             232\n\n        After a long moment Terminator slowly rolls over and sits up.\n\n        LOW ANGLE as he rises into FRAME, a mass of blood.  Clothing\n        and skin in tatters.\n\n        HEADLIGHTS FLARE behind him and an AIRHORN BLARES.\n\n        FULL SHOT as a DOUBLE-TRAILER KENWORTH GASOLINE TANKER smashes\n        him down and under with a METALLIC CRASH.\n\n        ANGLE UNDER TANKER as Terminator rolls, clattering, and the\n        mass blurs above him.  He RICOCHETS between the pavement and\n        the speeding undercarriage until a stray bounce flings him\n        up into the rear suspension.\n\n                                               CUT TO:\n\n\n233     EXT. FREEWAY OVERPASS - NIGHT                          233\n\n        UP ANGLE ON SARAH\n\n        at the railing, looking down.  She raises one fist into\n        the air triumphantly.\n\n                                SARAH\n                     Alriiight!\n\n                                               CUT TO:\n\n\n234     INT. TANKER CAB - NIGHT                                234\n\n        The stunned DRIVER hits the brakes.  His PARTNER grabs\n        his arm.\n\n                                PARTNER\n                     Don't stop.\n\n        They lock eyes for a moment.\n                                DRIVER.\n                     I have to, man.\n\n                                               CUT TO:\n\n\n235     EXT. FREEWAY/TANKER                                    235\n\n        ANGLE UNDER THE REAR TRAILER\n\n        Terminator clings with inhuman strength to the rear suspen-\n        sion.  The pavement blurs by beneath him.  The air brakes\n        howl.\n\n                                               CUT TO:\n\n\n236     EXT. FREEWAY OVERPASS - NIGHT                          236\n\n        Sarah watches the truck roll on without leaving a body\n        in its wake.\n        She feels a premonitory dread.\n\n                                               CUT TO:\n\n\n\n237     EXT. FREEWAY/TANKER - NIGHT                            237\n\n        Beneath the braking  semi, Terminator CRAWLS UPSIDE DOWN,\n        hand over hand like a HUMAN FLY, toward CAMERA.  The\n        left eye GLOWS LIKE A COAL in the dark.  As the pavement\n        stops beneath him he drops off and rolls out from under\n        the truck.\n\n                                               CUT TO:\n\n\n238     INT. TANKER CAB - NIGHT                                238\n\n        The driver looks around in astonishment as his door is\n        ripped open.\n        Terminator appears.  A grisly apparition.\n        FLINGS THE DRIVER OUT and takes his place behind the wheel.\n        Ignoring the terrified partner, he examines the controls.\n\n                                               CUT TO:\n\n\n238/FX  POV - TERMINATOR                                       238/FX\n\n        In digitized cyborg-vision we see an ABSTRACT OF THE\n        INSTRUMENTS.  The shift lever is extended graphically\n        down into a three-dimensional SCHEMATIC OF THE TRANS-\n        MISSION.  Analytical DATA PRINTS OUT RAPID-FIRE.\n\n                                               CUT TO:\n\n\n239     EXT. FREEWAY OVERPASS - NIGHT                          239\n\n        From the railing Sarah sees the tanker below as\n\n        a body falls beside it, rolling.\n        The truck swings in a slow arc.\n        TEARS THROUGH THE DIVIDING FENCE.\n        Heads back toward her on the wrong side of the freeway.\n\n        She stares in numb horror.\n        The nightmare refuses to end.\n        She runs to the crippled pickup and sees a front tire flat,\n        shredded by a crumpled fender.\n\n        She searches the cab frantically for the KEYS TO THE\n        MOTORCYCLES.  Finds them above the sun visor.\n\n        Sarah leaps into the bed of the pickup and attacks the\n        motorcycle strap-downs frantically.\n        Panting with terror she rolls the bike off the truck.\n        It crashes on its side and she falls on it painfully.\n\n        Straining until she CRIES OUT INVOLUNTARILY, she lifts\n        it upright.\n        KICKS the engine over.\n\n        LOW ANGLE\n\n        as the tanker crashes back through the divider and starts\n        UP THE OVERPASS.  Sarah is trapped in that concrete corridor.\n        She kicks for her life.\n        The bike catches for a moment.  Dies.\n\n        The truck BELLOWS, down-shifting on the curving grade.\n        Sarah kicks again and again, crying out with each stroke.\n        Again and again, furiously.\n        The engine CATCHES.\n\n                                SARAH\n                           (rapidly)\n                     Come on, come on, come on\n                     ...run, you...\n\n        The bike runs with a healthy roar.\n\n        LOW ANGLE\n\n        up the face of the tractor-trailer, the retaining wall blur-\n        ring by.  Terminator's red eye can be seen through the wind-\n        shield.\n\n        Sarah drags Reese, stumbling,to the bike, props him on the\n        seat behind her.  He clutches the satchel weakly.\n\n                                SARAH\n                     Hold on real tight, okay?\n\n        She guns the engine and roars off.\n\n        LOW ANGLE\n\n        as the tanker demolishes the pickup a moment later, TOSSING\n        IT OVER THE SIDE LIKE A BEER CAN.\n\n                                               CUT TO:\n\n\n240     EXT. FREEWAY - NIGHT                                   240\n\n        Sarah hits level freeway with a quarter-mile lead on the\n        tanker, distant B.G., but the little bike is overloaded\n        and she can't coax it above seventy-five.\n\n        ANGLE ON TANKER roaring forward, shifting up through\n        the gears.\n\n        CLOSE ON SARAH AND KYLE, his head lolling on her shoulder.\n        He starts to fall sideways.\n\n                                SARAH\n                           (shouting)\n                     Hold on, goddamnit!\n\n        He rouses slightly, gripping her tighter.\n\n        HIGH ANGLE - MOVING WITH BOTH VEHICLES as Sarah starts to\n        ZIGZAG desperately across all four lanes.  The truck stays\n        with her, closing, its trailer WHIPLASHING VIOLENTLY.\n\n                                               CUT TO:\n\n\n241     EXT./INT. TUNNEL - NIGHT                               241\n\n        The truck is right behind them as then enter a TUNNEL.\n        A half-mile of exitless concrete and strobing fluorescent\n        lights.\n\n        M.C.U. - SARAH AND KYLE (PROCESS SHOT) - He blinks and looks\n        back at a SOLID WALL OF METAL AND LIGHTS looming behind them.\n        Sarah hunches down.  They hit eighty.\n\n        FULL SHOT - The leviathan dwarfs them, its big tires ROARING\n        like the hubs of Hell.\n\n                                               CUT TO:\n\n\n242     EXT. FREEWAY - NIGHT                                   242\n\n        The tanker is twenty feet behind them as they clear the\n        tunnel.  Sarah dodges to one side and LOCKS THE BRAKES.\n        The bike slides, fish-tailing.\n        The truck roars past, hitting the air-brakes.\n        The trailers force her closer and closer  to the guardrail\n        as Terminator tries to sandwich her.\n        The bike slides to a stop.\n        The rearmost set of trailer wheels slams into the guardrail\n        right in front of Sarah.\n\n        Sarah emerges from a cloud of tire smoke, cutting across\n        all four lances behind the stopped semi.\n\n                                               CUT TO:\n\n\n243     EXT. FREEWAY EMBANKMENT - NIGHT                        243\n\n        Sarah tries to ride down the steep embankment but loses\n        control, spilling the bike.  She and Kyle tumble down\n        the slope.\n\n        MOVING WITH HER as she scrambles, half-dragging Kyle, through\n        a row of trees at a chainlink retaining fence.  She crawls\n        under the fence, tugs Kyle and the satchel through after.\n\n        Sarah looks up at the source of a SUDDEN THUNDEROUS ROAR.\n\n                                               CUT TO:\n\n\n243/FX  ANGLE ON TANKER                                        243/FX\n\n        It appears above them, grinding over the embankment.  It\n        rolls down the steep slope TOWARD CAMERA, FLATTENING TREES.\n\n                                               CUT TO:\n\n\n244     EXT. INDUSTRIAL SITE - NIGHT                           244\n\n        Sarah and Kyle scramble up and run across the STORAGE LOT\n        of a MODERN FACTORY COMPLEX of LOW BUILDINGS.  Kyle struggles\n        to keep up, holding the satchel.\n\n        LIKE A JUGGERNAUT the truck follows, smashing through parked\n        cars and FLATTENING A PRE-FAB STORAGE BUILDING.\n\n        They enter an alley-like space between two buildings.\n        Kyle is fumbling to open the satchel.\n\n        ANGLE BACK as the tanker enters the alley.  It TEARS THE\n        CORNER OFF ONE BUILDING as it turns in.  Terminator looks\n        down from his mountain of steel.\n\n                                               CUT TO:\n\n\n245     INT. TANKER CAB - NIGHT                                245\n\n        OVER TERMINATOR'S SHOULDER, looking down at a tiny figure\n        below, running in the headlights' glare.  It is Sarah, alone.\n\n                                               CUT TO:\n\n\n246     EXT. ALLEY - NIGHT                                     246\n\n        Reese crouches in a TRASH-DUMPSTER which is sandwiched\n        between the wall and the tanker.  There are only inches\n        of clearance as the trailers pass by.\n\n        He lights a PIPE CHARGE, jumps up and wedges it under the\n        tank-cylinder of the second trailer.\n        He ducks as it rolls on.\n\n        Sarah is stumbling in the glare of the truck's lights.\n\n        E.C.U. - PIPE BOMB, the fuse burning.\n\n        M.C.U. - TERMINATOR, through the windshield, his eye glowing.\n\n        C.U. - REESE huddles in the dumpster.\n\n                                               CUT TO:\n\n\n247/FX  LOW WIDE ANGLE ON SARAH AND TRAILER (PROCESS SHOT)     247/FX\n\n        The REAR TRAILER EXPLODES.  An unbelievable FIREBALL ERUPTS\n        SKYWARD, silhouetting Sarah's running figure F.G.\n        The dumpster is enveloped by fire and hurled, rolling, down\n        the alley.\n\n        Sarah makes it around a corner as the FORWARD TRAILER\n        EXPLODES and an OCEAN OF FLAME rolls forward, blasting by her.\n\n        The dumpster topples and Kyle rolls out, surrounded by fire.\n\n\n248/FX  SEQUENCE - TERMINATOR                                  248/FX\n\n        In the center of the inferno Terminator struggles violently.\n        His FLESH FIRES AND SIZZLES.  He tears loose from the\n        TWISTED WRECKAGE and collapses to the ground.  Sinks into\n        a CHARRED MASS.  STOPS MOVING.\n\n        C.U. - TERMINATOR, mouth open, skull-like, motionless\n        in the flames.\n\n                                               CUT TO:\n\n\n249     EXT. ALLEY - NIGHT                                     249\n\n        Sarah crawls away from the intense heat and lies watching\n        the motionless figure in the blaze.\n\n                                               CUT TO:\n\n\n250     EXT. ALLEY/FAR END - NIGHT                             250\n\n        Sarah rounds the corner, staggering, searching.\n        She sees Kyle crumpled face-down near the dumpster, sheltered\n        from the heat by its mass.\n\n        She drags his away.  Rolls him over.\n\n        C.U. - REESE, his head lolls.  He opens his eyes\n\n                                REESE\n                           (weakly)\n                     Sarah.\n\n                                SARAH\n                     We did it, Kyle.  We got it.\n\n        She hugs him.\n\n                                               CUT TO:\n\n\n250/FX  FULL SHOT (PROCESS)                                    250/FX\n\n        They hold the embrace, silhouetted by the diminishing flames.\n        It would be a wonderful final image.\n        Except...TERMINATOR STAGGERS OUT OF THE BLAZE BEHIND THEM.\n\n        M.C.U. - TERMINATOR, the last flakes of flesh are falling\n        from him like burning leaves.  His gleaming structure is\n        revealed in all its intricacy.  No longer a 'He', but an 'It'.\n        It looks like Death rendered in steel.\n        A CHROME SKELETON with HYDRAULIC MUSCLES and TENDONS OF\n        FLEXIBLE CABLE.  In the sockets of the metal skull, the\n        eyeball swivels with a WHIR of tiny servos, both glowing\n        red now.\n\n        It turns slowly and fixes its gaze directly INTO CAMERA.\n\n                                               CUT TO:\n\n\n251     EXT. ALLEY - NIGHT                                     251\n\n        C.U. - SARAH - She chokes on a scream, crams knuckles in\n        her mouth.\n\n        FULL SHOT (FX), as the machine takes a step toward them,\n        dragging one MALFUNCTIONING LEG.\n\n        PANAGLIDE WITH KYLE AND SARAH as they stagger to their feet\n        and run to the nearest building.  They come to a glass door.\n        Kyle kicks it in.  Unlatches it.  They enter dark OFFICES\n        to the sound of ALARMS and DISTANT SIRENS.\n\n                                               CUT TO:\n\n\n252     INT. CORRIDORS - NIGHT                                 252\n\n        Sarah and Kyle run down a corridor.\n        Through a door, which they close and lock.\n        They move off down a cross-corridor.\n        The Terminator BLASTS THE DOOR OFF ITS HINGES, F.G., and\n        staggers through.  It starts after their receding figures\n        as they round the corner at the end of the hall.\n\n                                               CUT TO:\n\n\n253     INT. OPEN OFFICES - NIGHT                              253\n\n        Wracked, exhausted, they stumble through a maze of PARTI-\n        TIONED OFFICE CUBICLES.\n\n                                               CUT TO:\n\n\n254     INT. CORRIDOR - NIGHT                                  254\n\n        The Terminator catches sight of them through a floor-to-\n        ceiling window.  It makes an unhesitating right turn through\n        the glass.\n\n                                               CUT TO:\n\n\n255     INT. OPEN OFFICES - NIGHT                              255\n\n        Sarah and Kyle look back at the sound of SHATTERING GLASS.\n\n        PANAGLIDE PRECEDING THE TERMINATOR as it crashes forward,\n        line-of-sight, through the maze.  It splinters partitions.\n        Flings desks out of the way.\n\n        FOLLOWING SARAH AND KYLE as they reach a heavy FIREDOOR and\n        go through.\n\n                                               CUT TO:\n\n\n256     INT. MANUFACTURING AREA - NIGHT                        256\n\n        Kyle slides the bolts on the metal firedoor.  Behind them\n        are acres of machinery in darkness.  Silence.\n        CRASH!  The Terminator hits the door from the far side.\n        Hinges SQUEAL.\n\n        Kyle goes to a LARGE BREAKER PANEL and opens it.  Starts\n        throwing switches.  Behind them, machines START UP ONE BY ONE.\n\n                                SARAH\n                           (panting)\n                      What are you doing?\n\n                                REESE\n                           (weakly)\n                      Cover...our footsteps...\n\n        He sags, sliding down the wall.  She pulls him up.\n        Half-carries him into the maze of machines.\n        The dark gallery is filled with WHIRRING, CLANKING SHAPES,\n        SHATTERING CONVEYER BELTS and improbable mechanisms lashing\n        mindlessly.\n\n        Reese slips to the floor and Sarah is no longer able to\n        support him.\n\n                                REESE\n                           (faintly)\n                      Leave me here.\n\n        Sarah crouches beside him.\n        Grabs his shirt front.\n        Yells over the machines.\n\n                                SARAH\n                      I'm not leaving you anywhere\n                      you jerk.  Haven't you figured\n                      it out?  Kyle, John is our\n                      son.\n\n        Reese's eyes refocus.\n\n                                SARAH\n                           (continuing)\n                      There isn't going to be\n                      anybody else...I don't want\n                      anybody else.  Listen to\n                      me!\n\n        She pauses, then resumes in a commanding, military shout.\n\n                                SARAH\n                           (continuing)\n                      Move!  Reese! Let's go.\n                      Move you ass!\n\n        She drags him to his feet and he staggers on.\n\n        Hinges SHATTER and the firedoor is hurled inward.\n        The Terminator scans the darkness.\n\n        ANGLE - PANNING WITH SARAH AND KYLE as they move through\n        the machines.\n\n        The cyborg steps forward, scanning methodically.\n\n        Sarah and Kyle move in a crouch through the treacherous\n        tangle of pipes and machinery.  Kyle picks up a length of\n        pipe to use as a weapon.  As they climb out onto a cat-\n        walk between the two huge mechanisms, Sarah clambers over\n        an innocuous CONTROL PANEL.\n        Her knee inadvertently hits a RED PUSH BUTTON.\n        With a ROAR the stamping-plate of a HYDRAULIC PRESS slams\n        down an inch from her hand.\n        Startled, she tumbles to the catwalk.\n\n        The Terminator's eyes swivel as he hears the single non-\n        rhythmic sound.\n\n        Kyle and Sarah run to the end of the catwalk, but find the\n        door there locked.\n\n                                SARAH\n                      Come on!\n\n        They double back to escape the cul-de-sac.  The Terminator\n        steps in front of them, cutting them off.\n\n                                REESE\n                           (shouting)\n                      Run!\n\n        He pushes Sarah roughly and she stumbles away.\n        Kyle raises the pipe with his good arm as the Terminator\n        advances.\n\n                                REESE\n                           (over his\n                           shoulder)\n                     Run, damn it!\n\n        She hesitates, backing away.\n        The cyborg swings at Reese\n        STEEL CLANGS ON STEEL.\n        Kyle strikes and parries but is sledgehammered back.\n\n        ANGLE ON CATWALK as Kyle lands in a heap, smashed against\n        a stanchion of the railing which prevented him falling to\n        the factory floor twenty feet below.\n\n        Sarah turns and runs.\n\n        LOW ANGLE PAST REESE, F.G., as the cyborg approaches him.\n\n        E.C.U. - A FUSE BURNING.\n\n        C.U. - KYLE'S FACE streaked with blood, pressed to the\n        floor as a metal foot CLANGS DOWN, F.G.   His eyes snap open.\n\n        Sarah falls, gets up, runs on.\n        The Terminator draws back for a death blow.\n        And Kyle rolls with the last of his strength, raising\n        the pipe bomb he has been cradling.  He jams it between two\n        hydraulic cylinders just beneath the cyborg's armored  rib-\n        cage.  Then rolls off the catwalk.  Terminator has an instant\n        to react, reaching for the bomb, before it EXPLODES.\n\n        Sarah is pitched forward by the blast and slides on the\n        floor.\n        Slams up against one wall.\n        A withering spray of shrapnel strafes the walls around her.\n        Pieces of scrap metal clatter throughout the factory, rain-\n        ing down.\n\n        C.U. - SARAH, very still.  She winces and opens her eyes.\n        Slowly looks up.\n\n        POV - SARAH, as the smoke clears.  The Terminator is GONE.\n        Unrecognizable clumps of BURNING DEBRIS lie scattered about.\n        Looking down through the grating floor she sees Kyle's\n        body.\n        LOW ANGLE ON KYLE F.G., Sarah on catwalk above.  Kyle's eyes\n        are half-open.  Still.  His face peaceful.\n        ANGLE ON ONE OF THE FIRES climbing some plastic tubing and\n        triggering a SPRINKLER HEAD.  It begins to rain.\n        C.U. - SARAH sitting up as the water runs over her.\n        She looks down.  Protruding from her right thigh is a TWISTED\n        PIECE OF METAL.  Shrapnel.  Part of the cyborg.  She pulls\n        it out, grimacing.  Her leg is broken.\n\n        It is a long time before she can gather the will to move.\n\n        SARAH'S POV - She sees a WALL PHONE several yards away,\n        beyond the debris from the explosion.\n        She starts to crawl toward it.\n        She passes A LARGE CLUMP OF DEBRIS, F.G.\n\n        ANGLE ON DEBRIS (FX) as it rolls over suddenly!\n        Now recognizable as the TERMINATOR'S HEAD AND ARMS, with\n        half of the scattered torso trailing wires and twisted\n        metal.\n\n        IT LUNGES FOR HER!\n\n        Sarah wants to scream this time, from the depths of her\n        soul, but there is no scream, only a dry shivering sob.\n\n        The Terminator drags itself SCRAPING over the floor, steel\n        fingers clutching.\n\n        Sarah is shaking and whimpering as she scrabbles away,\n        crawling in agony.\n\n        ANGLE ON CONVEYOR BELT as Sarah flops from the catwalk\n        onto the MOVING STRIP.  She is carried into the intricate\n        lattice of equipment.  Sarah rolls off weakly before going\n        under a set of sorting rollers.\n\n        ANGLE THROUGH MACHINERY - ON THE TERMINATOR (FX) as it crawls\n        after her, dragging its body.  It tracks her unerringly,\n        EYES GLOWING.\n\n        Sarah moves deeper into the DARK, CLASHING JUNGLE of machinery.\n        Around her is a rain-drenched tangle of CABLES, PIPES and\n        unforgiving mechanisms of steel.\n\n        The Terminator clambers through after her.\n\n        C.U. - SARAH - Water pours into her eyes as she catches\n        sight of something.  A familiar CONTROL BOX.\n        She drags herself toward it.\n\n        C.U. - THE TERMINATOR (FX) - It spots her wedged in a tiny\n        crawl space.  No way out.\n\n        It crawls the last few feet,EYES RED IN THE DARK.\n        Hypnotized, Sarah watches the Terminator REACHING TOWARD HER.\n        She is jammed in a corner.\n        Sarah's hand claws around to the front of the control panel,\n        seeking the RED BUTTON.\n\n        E.C.U. - HER WET FINGERTIPS FEEL THE BUTTON.\n\n        ANGLE ON THE TERMINATOR (FX), his steel hand reaching out.\n\n        E.C.U. - SARAH, her face inexplicably calm, eyes steady in\n        that infinite instant.  She clenches her teeth to keep\n        from screaming as she WAITS.\n\n        The Terminator's hand reaches for her throat to crush\n        the life out of her and end its long mission.\n\n                                SARAH\n                           (voice icy)\n                      You're...terminated...fucker!\n\n        E.C.U. - BUTTON, as her bloody finger stabs it down.\n\n        FULL SHOT, showing how the cyborg has been led into the\n        MAW OF THE HYDRAULIC PRESS.\n        THE STAMPING PLATE THUNDERS DOWN!\n        Tons of mechanical pressure flatten the Terminator's head\n        and body like tin-foil.  The PRESS SCREAMS, jamming solid.\n        Lightning snaps out in one brief blaze, leaping to surround-\n        ing machinery, arcing to Sarah's wristwatch.  All the\n        Terminator's energy is released in one second.\n\n        ANGLE on the narrow gap between the upper and lower plates:\n        a pinpoint of red light DWINDLES AND GOES OUT.\n        TIGHT ON SARAH, shivering uncontrollably.  The steel fingers\n        are frozen an inch from her throat.  She can only stare as\n        water runs over her.\n\n                                               CUT TO:\n\n\n257     INT. FACTORY - DAWN                                    257\n\n        CLOSE ON the side rail of an ambulance gurney SNAPPING UP\n        into position.  Sarah's eyes are closed and she is moved\n        OUT OF FRAME.\n\n        WIDE SHOT, showing the gurney being rolled by TWO ATTENDANTS\n        past the site of the last explosion.\n        SEVERAL POLICE OFFICERS are picking through the debris.\n\n        PANNING WITH THE GURNEY as it is wheeled out, holding on\n        TWO FACTORY EMPLOYEES, F.G.\n        One, the PLANT MANAGER, bends to examine a piece of the\n        cyborg lying at the base of the hydraulic press.\n        A COP, B.G., notices this.\n\n                                COP\n                      Look, I told you not to\n                      touch anything until we're\n                      done.  You got that?\n\n                                MANAGER\n                      Sure thing, officer.\n\n        He stands and palms a small object to HIS ASSISTANT.  They\n        step around the corner.\n\n                                ASSISTANT\n                      What is it?\n\n                                MANAGER\n                      Microcomputer chassis.  But\n                      I've never seen stuff like\n                      this anywhere.\n\n                                ASSISTANT\n                      Weird.  Jap stuff, maybe?\n\n                                MANAGER\n                      Keep it out of sight and\n                      get it down to R and D\n                      Monday, first thing.\n\n                                ASSISTANT\n                      Good idea.\n\n                                               CUT TO:\n\n\n258     EXT. BUILDING - DAWN                                   258\n\n        Sarah is being lifted into the ambulance.  She looks\n        up as the doors are latched shut.\n\n        TILT UP to follow her gaze.\n        The sign above the entrance of the building reads:\n\n        CYBER DYNAMICS CORPORATION\n\n                                               SLOW DISSOLVE TO:\n\n\n259     INT./EXT. LANDROVER - LATE AFTERNOON                   259\n\n        MACRO ON CASSETTE RECORDER, the center capstans of a\n        tape turning.\n\n                                SARAH (V.O.)\n                      ...and the hardest thing is\n                      deciding what I should tell\n                      you and what not to.  Well,\n                      anyway, I've got a while yet\n                      before you're old enough to\n                      understand the tapes.  They're\n                      more for me at this point...\n                      to help get it all straight.\n\n        COVER SHOT reveals Sarah as the wheel of a dusty landrover\n        parked at the pump island of a tiny gas station.  All of\n        its signs are in hand-lettered Spanish.  Beyond lies an\n        expanse of scrub desert.  The sky scowls with an impending\n        storm.\n\n        Sarah speaks quietly into a hand microphone as a dark-\n        complected attendant laconically fills her tank.  She\n        cradles the cassette recorder in her lap, in the lee of\n        her SWOLLEN BELLY.\n        She looks to be about SIX MONTHS ALONG.\n        Under her down vest she wears a leather shoulder holster\n        and the butt of a .357 REVOLVER presses against her\n        breast.  She tugs the vest closed as the attendant glances\n        her way.  A German Shepherd sits in the back among taped\n        boxes and suitcases.\n\n                                SARAH\n                           (continuing)\n                      Should I tell you about your\n                      father?  That's a tough one.\n                      Will it change your decision\n                      to send him here...knowing?\n                      But if you don't send Kyle,\n                      you could never be.  God,\n                      you can go crazy thinking\n                      about all this...I suppose\n                      I'll tell you...I owe him that.\n                      And maybe it'll be enough if\n                      you know that in the few hours\n                      we had together we loved a\n                      lifetime's worth...\n\n        CLICK.  WHIR.  Sarah jumps at a sound nearby, breaking\n        her reverie.  A small MEXICAN BOY has snapped her picture\n        with a beat-up Polaroid camera.  He holds it out to her,\n        speaking rapid Spanish.\n\n                                ATTENDANT\n                      He says you are very beautiful,\n                      Senora, and he is ashamed to ask\n                      five American dollars for this\n                      picture, but if he does not,\n                      his father will beat him.\n\n                                SARAH\n                      That's a pretty good hustle,\n                      kid.  Four.  Quatro.\n\n        The boy takes her four dollars and she watches the\n        snapshot develop.  It is a good photograph of her,\n        the wind lightly ruffling her hair, expression thought-\n        ful, slightly sad.\n\n        We recognize it as the one Reese carried in 2029.\n        She slips it into her short pocket.\n\n                                ATTENDANT\n                      Mil trescientos...fifteen dollars\n                      American.\n\n        As she pays him, distant thunder rolls.\n        The boy yells something in Spanish as he runs off.\n\n                                SARAH\n                      What did he say?\n\n                                ATTENDANT\n                           (accented)\n                      There is a storm coming in.\n\n        Sarah gazes at the thunderheads building up out over the\n        desert.  Heat lightning pulses in their depths.\n\n                                SARAH\n                           (quietly)\n                      I know.\n\n        CAMERA CRANES UP as she pulls away, driving across the\n        flat desert on a ribbon of highway.  A brilliant flash\n        crescendos from horizon to horizon out at the rim of the\n        world.\n\n\n\n\nTerminator\nWriters :   Harlan Ellison  James Cameron  Gale Anne Hurd  William Wisher Jr.\nGenres :   Sci-Fi  Thriller  Action  Drama  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:37:00.840876"}