{"title": "Terminator Salvation", "film_link": "/Movie Scripts/Terminator Salvation Script.html", "script_link": "/scripts/Terminator-Salvation.html", "info_raw": "\n\nTerminator Salvation Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (7.33 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  John Brancato  Michael Ferris\nGenres  Action  Adventure  Sci-Fi  Thriller\nScript Date : October 2005\nMovie Release Date : May 2009\n\nRead \"Terminator Salvation\" Script\n\n\n", "script": "\n           \n          \n          \n          \n                            TERMINATOR: SALVATION\n          \n          \n                                 Written by\n          \n                       John Brancato & Michael Ferris\n          \n          \n          \n          \n                                                        REVISED DRAFT\n                                                             10.12.05\n          \n          \n          \n          \n          SUPER ON BLACK:\n          \n          LONGVIEW STATE CORRECTIONAL FACILITY, TEXAS, 2003.\n          \n          FADE IN ON:\n          \n          \n          INT.   DEATH ROW/CELL - DAWN\n          \n          START TIGHT ON MARCUS WRIGHT. He's an intense, powerful man,\n          20's-30's, his head shaven. Marcus stares INTO CAMERA with a\n          resigned expression. We hear the voice of a PRIEST:\n          \n                               PRIEST\n                     Yea, though I walk through the valley\n                     of the shadow of death, I will fear\n                     no evil: for thou art beside me; thy\n                     rod and thy staff they comfort me...\n          \n          CAMERA PULLS BACK, straight up. MARCUS lies in his cot,\n          staring at the ceiling. He's smoking a CIGARETTE. This\n          OVERHEAD ANGLE reveals a PRIEST with a BIBLE, in a folding\n          chair beside him. A CHESS SET, stacks of BOOKS, WRITING\n          MATERIALS in the cell. TWO GUARDS wait, shackles in hand.\n          \n          MARCUS has no interest in scripture. He blows a cloud of\n          SMOKE which drifts in the direction of the PRIEST, who blinks\n          and shuts his bible.\n          \n          One of the GUARDS unlocks the cell door for--\n          \n          DR. SERENA KOGAN. She's in her 30's-50's, brilliant,\n          attractive, but thin and pale, a scarf tied around her head.\n          She carries a CLIPBOARD. The PRIEST backs off to give her\n          some privacy with Marcus.\n          \n                               SERENA\n                     Marcus-- I'm Doctor Serena Kogan, I'm\n                     with Project Angel. You consented to\n                     donate your body to science...\n          \n          \n                                                               (CONTINUED)\n          \n                                                                                 2.\n          CONTINUED:\n          \n                                 MARCUS\n                       Yeah, I'm pretty much done with it.\n          \n                                 SERENA\n                       You've been chosen for our research.\n          \n                                   MARCUS\n                       Chosen?    Lucky me.\n          \n                                 SERENA\n                       We just need a couple of signatures...\n          \n          Marcus sits up, she passes him the clipboard and pen-- he\n          notes that her hands are SHAKING.\n          \n                                 MARCUS\n                       You don't need to be scared.\n          \n                                   SERENA\n                       I'm not.    It's nerve degeneration.\n          \n          MARCUS looks up from the form, takes in the scarf covering\n          her sparse hair.\n          \n                                   MARCUS\n                       Cancer?\n          \n                                  SERENA\n                           (NODS)\n                       You're not the only one with a\n                       death sentence.\n          \n          MARCUS meets her eyes.      She studies him a beat.\n          \n                                 SERENA (cont'd)\n                       What you're doing is important,\n                       Marcus. Our work is still highly\n                       experimental... but you may be\n                       helping people in ways you can't\n                       begin to imagine.\n          \n                                 MARCUS\n                       I'm a regular hero.\n          \n          With that sarcastic comment, he SIGNS HIS NAME-- we see the\n          words \"PROJECT ANGEL\" at the top of DENSE TYPE on the form.\n          \n          SERENA takes the clipboard, starts to rise.         She touches his\n          hand for a moment.\n                                                                   (CONTINUED)\n          \n                                                                          3.\n          CONTINUED: (2)\n          \n                                  SERENA\n                     Thank you.     And... I'm sorry.\n          \n                               MARCUS\n                     No one lives forever.\n          \n          THE GUARD sees SERENA out.\n          \n          \n          INT.   DEATH ROW/CORRIDOR - NIGHT\n          \n          LOW ANGLE - MARCUS' CHAINED ANKLES clank as the GUARDS lead\n          him down the corridor, past PRISONERS in their cells; some\n          avert their eyes, others give a nod or raise a fist.\n          \n                               PRIEST (V.O.)\n                     Marcus, this is your last\n                     opportunity to make a confession...\n          \n          MARCUS stares straight ahead, taking deep, steady breaths,\n          struggling not to succumb to fear.\n          \n                               PRIEST (V.O.) (cont'd)\n                     Is there nothing you would say to\n                     Officer Martinez' family?\n          \n          \n          INT.   DEATH ROW/EXECUTION CHAMBER - NIGHT\n          \n          CLOSE - BUCKLES TIGHTEN... AN ALCOHOL SWAB on MARCUS'\n          FOREARM... A NEEDLE punctures his skin.\n          \n                               MARCUS (V.O.)\n                     What can I say. I was seventeen, I\n                     was angry, I was stupid.\n          \n          FINGERS turn the VALVE to release the LETHAL CHEMICALS.\n          \n          CLOSE ON MARCUS' EYES, looking up toward--\n          \n          THE DEADLY I.V., running into his arm.\n          \n          From this, he looks toward--\n          \n          HIS REFLECTION in a one-way mirror, the dim shapes of\n          WITNESSES beyond.\n          \n          \n          \n                                                            (CONTINUED)\n          \n                                                                              4.\n          CONTINUED:\n          \n                                 MARCUS (V.O.) (cont'd)\n                       Yeah... I'm sorry about it. I'm\n                       sorry about everything. The whole\n                       goddamn world...\n          \n          As the lethal injection takes hold, his POV moves to BRIGHT\n          LIGHTS overhead, losing FOCUS and BLEACHING TO WHITE...\n          \n          From the WHITE SCREEN, a FACE emerges, backlit, blurred--\n          it's SERENA. She's in focus for just a moment, leaning INTO\n          CAMERA-- then moves OUT OF FRAME.\n          \n                                                           CUT TO BLACK.\n          \n          \n          SUPER ON BLACK:\n          \n          SOUTH-CENTRAL SECTOR, NORTH AMERICA, 2018\n          \n          \n          EXT.   CORNFIELD - DUSK\n          \n          CORNSTALKS as far as the eye can see, rustling in a summer\n          breeze. FIGURES are moving within the FIELD. We only make\n          them out in SILHOUETTE, but all carry HEAVY RIFLES.\n          \n          \n          INT.   A-10 COCKPIT - DUSK\n          \n          A COMPUTER TARGETING SCREEN - the FIGURES are HIGHLIGHTED in\n          this tactical display, as is an OCTAGONAL HATCH into the\n          ground beneath the corn.\n          \n          \n          EXT.   CORNFIELD - DUSK\n          \n          THE FIGURES in the corn look up-- we hear an AIRCRAFT\n          APPROACH with a JET WHINE--\n          \n          FWOOM! A MASSIVE CONCUSSION as a BUNKER-BUSTING MISSILE\n          BORES into the earth at high-velocity, burrowing deep--\n          \n          --then a HUGE BLAST - FLAME and DIRT are thrown high in the\n          air, many of the FIGURES blown sky-high.\n          \n          A FLAMING BODY hits the ground IN FG, FACE TO CAMERA... we\n          now see it was a STEEL TERMINATOR-- its METAL SKULL BLOWN\n          OPEN and SCORCHED, its RED EYES SHATTERED.\n          \n                                                                (CONTINUED)\n          \n                                                                            5.\n          CONTINUED:\n          \n          A-10 WARTHOGS-- stubby attack planes-- SCREAM from the sky,\n          RAKING THE REMAINING FIGURES with CANNON FIRE, BLASTING THEM\n          to bits. These aircraft no longer bear traditional U.S.\n          insignia-- they're painted in WILD COLORS, graffiti lettering\n          says things like: \"BOT BLASTER,\" \"KILL FOR CONNOR,\" \"RAGE\n          AGAINST THE MACHINES,\" etc... Resistance fighters.\n          \n          Motley military and civilian CHOPPERS LAND in the CORNFIELD,\n          disgorging RESISTANCE SOLDIERS. These are human troops in\n          high-tech HELMETS, carrying slightly futuristic conventional\n          ASSAULT WEAPONS.\n          \n          THE WARTHOGS veer off, laying NAPALM in the distance behind\n          the SOLDIERS. The troops run toward--\n          \n          --AN OPENING which has been blown into the ground, the\n          remains of the octagonal hatch where the bunker-buster hit.\n          \n          A surviving TERMINATOR rises from the SINGED CORN, FIRES its\n          PLASMA RIFLE--\n          \n          --DROPPING A SOLDIER. His comrades FIRE EXPLOSIVE BULLETS--\n          and BLOW THE ROBOT APART. The LEADER of this assault group\n          waves his soldiers to enter the dark hatchway.\n          \n          \n          INT.   UNDERGROUND FACILITY/CORRIDOR - NIGHT\n          \n          COLLAPSED CEILINGS, FLAMES, a high-tech installation in\n          ruins; RED LIGHTING, distinctive of Skynet environments.\n          \n          SOLDIERS flick on HELMET LAMPS and make their way carefully\n          inside-- pretty deserted. They kick aside rubble to enter--\n          \n          \n          INT.   UNDERGROUND FACILITY/ROBOTIC ROOM - NIGHT\n          \n          HELMET BEAMS play over BANKS OF ELECTRONICS and--\n          \n          --a dozen fixed, INDUSTRIAL ROBOTS-- not remotely HUMANOID--\n          engaged in mysterious tasks, mechanical arms at work.\n          \n          THE SOLDIERS rake the room with GUNFIRE-- MACHINERY\n          collapses, SPARKS from EXPLODING CIRCUITRY.\n          \n          \n          INT.   UNDERGROUND FACILITY/CORRIDOR - NIGHT\n          \n          Deeper into the complex, A HEAVY DOOR BLOWS off its hinges.\n                                                              (CONTINUED)\n          \n                                                                           6.\n          CONTINUED:\n          \n                                 TEAM LEADER\n                       Clear!\n          \n          SOLDIERS move from cover and through the blown door.\n          \n          \n          INT.   UNDERGROUND FACILITY/STORAGE ROOM - NIGHT\n          \n          TUBES and FIBER-OPTIC CABLES run into DOZENS OF GLASS\n          CYLINDERS filled with translucent PINK LIQUID. The SOLDIERS\n          make their way in, alert-- but nothing's moving in here.\n          \n          THE TEAM LEADER peers into a cylinder, aims his HEADLAMP at--\n          \n          --A small MASS OF TISSUE floating inside, connected to a\n          dense network of FIBER-OPTIC CABLES... it's a HUMAN BRAIN.\n          \n                                 TEAM LEADER\n                       Oh God.\n          \n          THE TEAM LEADER recoils-- but before he can say more, the\n          ROOM SHAKES with a DEAFENING ROAR.\n          \n          \n          EXT.   CORNFIELD - NIGHT\n          \n          A huge ESCAPE SHIP rises straight up from an open HATCHWAY.\n          Nearby TROOPS crouch and FIRE after it. THE SHIP PIVOTS in\n          mid-air and ROARS OFF, SOLDIERS dodging the ENGINE BLAST.\n          \n          \n          INT.   UNDERGROUND FACILITY/STORAGE ROOM - NIGHT\n          \n          THE TEAM LEADER speaks into his headset. The OTHER SOLDIERS\n          inspect the many CYLINDERS, react in horror and shock.\n          \n                                 TEAM LEADER\n                       You will not believe the shit we\n                       found down here--\n          \n          As he speaks, CAMERA FINDS a GREEN LED on the ceiling-- which\n          suddenly FLASHES RED and BLINKS RAPIDLY--\n          \n          \n          EXT.   CORNFIELD - NIGHT\n          \n          WIDE - AN IMMENSE SUBTERRANEAN BLAST causes a few hundred\n          yards square to SWELL and then COLLAPSE.\n          \n                                                             (CONTINUED)\n          \n                                                                            7.\n          CONTINUED:\n          \n          JETS of FLAME, SMOKE and DIRT RISE in the aftermath.\n          \n          \n          INT.   CHOPPER - NIGHT\n          \n          A PANICKED PILOT on the radio:\n          \n                                 PILOT\n                       --repeat, that was not us! A ship\n                       escaped, they musta blown the place\n                       themselves! Jesus, a lot of our\n                       guys were still down there...\n          \n          \n          EXT.   CORNFIELD - NIGHT\n          \n          SOLDIERS above ground help the WOUNDED to EVAC CHOPPERS.\n          \n          IN FG, FIND the STEEL SKULL of the dead TERMINATOR.\n          \n                                                             DISSOLVE TO:\n          \n          \n          EXT.   CORNFIELD - DAY\n          \n          SAME ANGLE-- the TERMINATOR now half-sunk in mud. A FIELD\n          MOUSE has nested in its skull cavity, seeking shelter from\n          RAINDROPS.\n          \n          Months have passed, the season changed-- CORN long dead, a\n          black stubble. RAIN falls.\n          \n          A PATCH OF MUD stirs-- something below is moving.       The MUD\n          roils, seeming to assume a HUMAN SHAPE...\n          \n          EYES OPEN, looking around in shock, the naked FIGURE is so\n          drenched in mud we can't recognize it at first. The figure\n          rises, looks up at the sky, and FALLING RAIN washes away mud\n          from his face... it's MARCUS WRIGHT. He opens his mouth,\n          makes a few GUTTURAL NOISES... then SCREAMS.\n          \n          CAMERA PULLS UP from MARCUS' AGONIZED FACE...\n          \n                                                                 CUT TO:\n          \n                                                                          8.\n          \n          \n          EXT.   PLATEAU - EVENING\n          \n          BARE FEET trudge through the dirt. MARCUS moves along a\n          slight rise, wrapped in torn and filthy RAGS, mud caked on\n          his body. Eerie silence. Reaching the edge of a rise, he\n          sees in the distance--\n          \n          A DECIMATED CITY, buildings collapsed into rubble.\n          \n          \n          EXT.   DEAD CITY - NIGHT\n          \n          MOONLIGHT. THE SKELETON of a large DOG lies on the ground,\n          partially covered by a dusting of SNOW. It still bears a\n          rotting COLLAR attached to a CHAIN.\n          \n          MOVE to a CHAIN-LINK FENCE, partially collapsed, a singed,\n          faded sign: \"BEWARE OF DOG.\"\n          \n          WIDER, we're in the low-rent district of this CITY IN RUINS--\n          rubble, random walls still stand. Hulks of cars, rusted,\n          windowless. It's been over a decade since the bombs fell.\n          \n          MARCUS is the only thing alive here. He moves down this\n          block, picks up a handful of SNOW, brings it to his lips.\n          \n          A COLLAPSED NEWSSTAND. MARCUS walks past the racks, picks up\n          a MAGAZINE which crumbles in his hands.\n          \n          A HUMAN SKELETON, clothes in tatters, is half-buried behind\n          the collapsed counter. There's a bulge in its shirt pocket.\n          \n          MARCUS gingerly reaches into the pocket and fishes out a\n          cellophane-wrapped PACK OF CIGARETTES and a butane LIGHTER.\n          \n          MARCUS sits on a piece of rubble by the skeleton. He tears\n          open the packet and puts a dried-out, stale cigarette to his\n          lips, tries the lighter a few times, finally gets a flame.\n          He lights the cig, inhales deeply-- he waits for a rush,\n          feels nothing. He takes a few more drags, increasingly\n          disappointed, then flicks the cigarette away.\n          \n          He rises, looks toward a caved-in STOREFRONT, makes out a\n          clothing store's TATTERED SIGN on the ground, amidst broken\n          glass: \"SALE! GOING OUT OF BUSINESS! EVERYTHING MUST GO!\"\n          \n                                                                            9.\n          \n          \n          INT.   RUINED CLOTHING STORE - NIGHT\n          \n          FALLEN RACKS, CLOTHES and SHOES covered in years of dust and\n          rubble. MARCUS, grateful to be rid of the rags, has pulled\n          on jeans and sneakers, using the CIGARETTE LIGHTER for\n          illumination. He kicks away some FALLEN CEILING TILES from a\n          RACK OF ARMY JACKETS. He holds one up-- looks good.\n          \n          \n          INT.   RUINED BAR - NIGHT\n          \n          Partially collapsed, a downscale watering hole. Broken\n          stools, booths, a dead pinball machine. MARCUS, dressed now,\n          again using the LIGHTER to find his way, sorts through the\n          broken glass and rubble behind the bar, comes up with--\n          \n          A DUSTY BOTTLE OF WHISKY.\n          \n                               MARCUS\n                     Hallelujah.\n          \n          He unscrews the cap, raises the bottle to a SKELETON on the\n          floor nearby. Marcus takes a long pull-- and CHOKES,\n          instantly dizzy. He sinks to the floor, passing out.\n          \n                                                      CUT TO BLACK.\n          \n          MEMORY MONTAGE: quick, fragmentary, impressionistic POVs,\n          blurred, altered. SFX of HEARTBEATS, a RESPIRATOR.\n          \n          --WEBS of TUBES and FIBER-OPTICS FILLS THE FRAME.\n          \n          --GRIDS OF LASER LIGHT scan rapidly INTO CAMERA.\n          \n          --DIGITAL DISPLAYS blink through murky LIQUID. SERENA moves\n          INTO FRAME, a look of concentration on her face as she peers\n          through the LIQUID, INTO CAMERA. She starts to smile.\n          \n                                                       DISSOLVE TO:\n          \n          \n          EXT.   DEAD CITY - DAY\n          \n          BLUE SKY. TILT DOWN to find MARCUS, who plods on through the\n          dead city's outskirts. He pauses near a collapsed BUS KIOSK.\n          A SMILING WOMAN stares out at him from a faded ADVERTISEMENT.\n          \n          MARCUS studies the woman. She's nothing like Serena, but her\n          expression recalls the beckoning vision.\n                                                              (CONTINUED)\n          \n                                                                           10.\n          CONTINUED:\n          \n          He runs his hand over the image of her face, pulls away a\n          chunk of cracked, graffitied GLASS over the poster. Then he\n          carefully tears the poster to remove the woman's face, folds\n          the paper, slips it in a pocket and continues on.\n          \n          \n          EXT.   HIGHWAY - NIGHT\n          \n          Deserted, CAR HULKS about, crumbling SKELETONS at the wheels.\n          MARCUS moves down the center of the freeway on this MOONLIT\n          NIGHT, paying little attention to anything around him. We're\n          in mostly flat, treeless plains.\n          \n          From the opposite direction, FIGURES approach, moving through\n          the darkness. Marcus hurries excitedly toward them, the\n          first living creatures he's seen. He waves.\n          \n                                  MARCUS\n                       Hey!   Yo, over here!\n          \n          The FIGURES pause, turning toward him in unison.\n          \n                                 MARCUS (cont'd)\n                       Damn it's good to see you guys, I felt\n                       like I was the last man on...\n          \n          He freezes in his tracks. These aren't humans. They're T-\n          400s-- PLASTIC-SKINNED TERMINATORS-- armed with PLASMA\n          RIFLES. They wear a motley collection of found CLOTHING, but\n          their male humanoid faces are identical, unnatural and\n          motionless, like masks. Their EYES FLICKER RED as they scan\n          him.\n          \n                                   MARCUS (cont'd)\n                       Oh God...\n          \n          Marcus backs away, runs.      The T-400s stare after him-- but\n          don't fire.\n          \n          ANGLE THROUGH BINOCULAR MASK - MARCUS running for all he's\n          worth, heading toward the viewer. We hear a muttering VOICE:\n          \n                                 BOY\n                       Hey mister, where you goin' in such\n                       a hurry?\n          \n          ANGLE ON A BOY, scrawny and filthy, in his early to mid\n          teens. He crouches on the supports of a FREEWAY SIGN.\n          \n                                                                (CONTINUED)\n          \n                                                                            11.\n          CONTINUED:\n          \n          He wears layers of TATTERED, OVER-SIZED CLOTHING.     He\n          scrambles quickly down from the sign.\n          \n          AT AN OFF-RAMP, Marcus' pace slows as he moves to get off the\n          freeway, when--\n          \n          THE BOY emerges from behind some RUBBLE, holding a HANDGUN in\n          one hand, a lit OIL LANTERN in the other.\n          \n                                 BOY (cont'd)\n                       Whoah, whoah-- hang on there.   Got\n                       any food?\n          \n          Marcus raises his hands, shakes his head.     The boy looks him\n          over dubiously.\n          \n                                 BOY (cont'd)\n                       You look like you been eating\n                       pretty good.\n          \n          The boy moves closer, puts down the LANTERN, frisks Marcus\n          with one hand while holding the gun on him with the other.\n          \n                                 MARCUS\n                       You're human... you can see me, you\n                       can touch me. This place is real.\n          \n          THE BOY makes a dubious face, yanks a handful of PAPER SCRAPS\n          from Marcus' pocket.\n          \n                                 MARCUS (cont'd)\n                       I thought I was in hell.\n          \n                                 BOY\n                           (raises an eyebrow)\n                       This sure ain't heaven.\n          \n                                 MARCUS\n                       Those things with masks, red eyes--\n          \n                                 BOY\n                           (CASUALLY)\n                       Terminators-- T-400s.   What is this stuff?\n          \n          THE BOY unfolds the paper scraps in the LANTERN LIGHT--\n          \n          ANGLE ON PAPER SCRAPS - the WOMAN'S FACE from the poster, a\n          fragment of a MODEL'S PHOTO from a MAGAZINE AD, a painting of\n          a FEMALE FACE from a PAPERBACK COVER.\n                                                                (CONTINUED)\n          \n                                                                           12.\n          CONTINUED: (2)\n          \n          THE BOY looks puzzled, intrigued by the pictures. But with\n          sudden speed, MARCUS GRABS THE BOY'S GUN HAND and wrenches it\n          hard-- it FIRES into the air. MARCUS gets control of the\n          gun, wraps one arm around the boy's throat.\n          \n                              MARCUS\n                    If I'm not in hell, where am I?!\n          \n                              BOY\n                        (CHOKING)\n                    Texas!\n          \n          The NOISE of a SHOTGUN PUMPING close behind MARCUS--\n          \n          MARCUS spins to face his attacker, pressing the handgun into\n          the boy's cheek. He's face to face with--\n          \n          A GIRL, a couple of years younger than the BOY, training the\n          shotgun at Marcus' head-- she looks ready to shoot.\n          \n                              GIRL\n                    Let him go!\n          \n                              MARCUS\n                    First put down the shotgun.\n          \n          THE GIRL shakes her head angrily.   She wears an aged, beloved\n          BASEBALL CAP with a STAR on it.\n          \n                              BOY\n                    Do what he says.\n          \n                              GIRL\n                    He'll kill us both!\n          \n                              MARCUS\n                    I don't wanna kill anyone.\n          \n                              BOY\n                    Do it, Star. Put it down.\n          \n          She shakes her head slightly, aiming carefully at Marcus'\n          head, just a few feet away, a slight smile on her face.\n          \n                              GIRL\n                    There was only one bullet in that gun.\n          \n          MARCUS hooks his foot around the oil lantern and deftly--\n          \n                                                             (CONTINUED)\n          \n                                                                          13.\n          CONTINUED: (3)\n          \n          --BOOTS IT at the GIRL. BURNING OIL spills across her leg,\n          she cries out and fumbles the shotgun. MARCUS tosses the BOY\n          at her, the two of them SPRAWL on the ground, the shotgun\n          falling to one side--\n          \n          MARCUS quickly snatches up the shotgun.\n          \n          Using SNOW, the BOY helps the GIRL extinguish the flames from\n          her clothing.\n          \n          MARCUS stands over the kids with a gun in each hand.   He\n          struggles to control anger, speaks quietly.\n          \n                              MARCUS\n                    I don't like it when people point\n                    guns at me.\n          \n                              GIRL\n                    It wasn't loaded.\n          \n          MARCUS quickly checks the chambers of both the shotgun and\n          handgun-- indeed, both are empty.\n          \n                              MARCUS\n                    You took on a guy like me with one\n                    bullet and an empty shotgun?\n                        (studies them admiringly)\n                    Pretty stupid.\n          \n          He shoves the handgun in his belt, puts the shotgun down and\n          kneels to pick up fallen scraps of paper-- a few have caught\n          FIRE and are incinerated.\n          \n          THE BOY and GIRL get to their feet, stare at Marcus.\n          \n                              GIRL\n                    Can I have my gun back?\n          \n          MARCUS shrugs, gestures for her to pick it up.   He still\n          looks at the PICTURES in his hands.\n          \n                              GIRL (cont'd)\n                    Where'd you get those?\n          \n                              MARCUS\n                    In the city.\n          \n          \n          \n                                                             (CONTINUED)\n          \n                                                                          14.\n          CONTINUED: (4)\n          \n                              BOY\n                        (steps away from him)\n                    The city? Oh man. That place is\n                    red hot.\n          \n                              MARCUS\n                        (a small smile)\n                    Seemed kinda dead to me.\n          \n                              BOY\n                    No-- radiation.\n          \n          A SPOTLIGHT appears in the distance-- a ROVING HUNTER-KILLER\n          moving in their direction.\n          \n          Quickly, automatically, the kids dive for cover behind a WALL\n          OF DEBRIS. MARCUS looks toward the LIGHT, unaware of danger.\n          \n          THE BOY bolts from behind cover, grabs MARCUS by the arm--\n          \n                              BOY (cont'd)\n                    Get down, they've seen the light!\n          \n          He drags Marcus back behind the debris wall, just in time--\n          \n          As the H-K nears, the LIGHT FINDS the BURNING OIL. It FIRES\n          BLUE PULSES, which CHEW up the asphalt nearby-- then it moves\n          on, failing to pick out the humans. Marcus is dumbfounded.\n          \n                              MARCUS\n                    That wasn't a helicopter...\n          \n                              BOY\n                    It's an H-K-- hunter-killer.   Where\n                    the hell have you been?\n          \n                              GIRL\n                    Rads musta fried his brains.   Let's\n                    go, Kyle.\n          \n          The H-K has vanished in the distance. The girl rises.   The\n          boy-- KYLE-- shakes his head, stays at Marcus' side.\n          \n                              KYLE\n                    What's your name?\n          \n                              MARCUS\n                        (after a beat)\n                    Marcus. Marcus Wright.\n                                                            (CONTINUED)\n          \n                                                                          15.\n          CONTINUED: (5)\n          \n                               KYLE\n                     Kyle Reese.\n                         (indicates girl)\n                     She doesn't remember her name--\n                         (re: her cap)\n                     --so I call her Star.\n          \n          STAR gives Marcus a small, reluctant wave.\n          \n                               KYLE (cont'd)\n                     Gonna be light soon, Marcus, better\n                     find cover. We spotted some\n                     buildings half a mile that way.\n          \n          KYLE points but gets no response. He shrugs, sets off with\n          Star in that direction. Kyle calls over his shoulder:\n          \n                               KYLE (cont'd)\n                     You can come if you want.\n          \n                               STAR\n                         (hissing at him)\n                     Why? We don't need him.\n          \n                               KYLE\n                         (a shrug, sotto)\n                     I like him. He's funny.\n          \n          MARCUS looks around at the desolate world-- and the two teens\n          receding ahead of him. After a beat, he follows.\n          \n                                                            CUT TO:\n          \n          \n          EXT.   HIGHWAY - DAWN\n          \n          A FALLEN SIGN - \"GAS FOOD LODGING.\"\n          \n          KYLE, STAR and MARCUS move along the roadside, heading toward\n          dark BUILDINGS a few hundred yards off near an overpass.\n          \n                               MARCUS\n                     What year is it?\n          \n                                  STAR\n                     Seventeen.\n          \n                                KYLE\n                     Nope.   Eighteen.\n                                                            (CONTINUED)\n          \n                                                                          16.\n          CONTINUED:\n          \n                                 STAR\n                       Are you sure?\n          \n                                  KYLE\n                       Yup.   Two thousand eighteen.\n          \n                                 MARCUS\n                       Fifteen years... I've lost 15 years.\n                       So who did it to us? Terrorists?\n                       The Russians, the Chinese--?\n          \n                                  STAR\n                       Huh?\n          \n                                 MARCUS\n                       The nukes. There was a war, right?\n                       Who started it?\n          \n          KYLE cocks his head at him.\n          \n                                 KYLE\n                       Something fall on your head? The\n                       machines did it, the computers--\n                       they got smart.\n          \n                                 STAR\n                       Judgment Day... I was just a baby.\n          \n                                 KYLE\n                       What's the last thing you remember?\n          \n                                 MARCUS\n                           (a beat)\n                       Dying.\n          \n          \n          EXT.   REST STOP - DAY\n          \n          A MEXICAN FAST FOOD JOINT, windows broken, sign collapsed,\n          near a two-story MOTEL with a COVERED CARPORT. The pavement\n          is CRACKED, the structures WEATHERED, abandoned for a decade.\n          \n          MARCUS, KYLE and STAR suddenly rise from a hiding spot by a\n          DUMPSTER in a parking area. KYLE scans the FAST-FOOD PLACE\n          with the binoculars, while STAR studies a WATCH she carries.\n          \n                                  KYLE\n                       Eyeball.   Only one.\n          \n                                                              (CONTINUED)\n          \n                                                                          17.\n          CONTINUED:\n          \n          They drop down again.\n          \n          ONE AEROSTAT patrols the area. It's a surveillance drone the\n          size of a softball, shiny steel, an inset camera lens with a\n          RED GLOW. It flies in a geometric pattern, hovering every\n          few seconds before continuing on. It vanishes around the\n          corner of the fast-food joint, moving in the direction of the\n          motel. STAR has been timing its moves.\n          \n                                 STAR\n                       Now!\n          \n          KYLE and STAR dash for the fast-food entrance, MARCUS just\n          behind. They round the doorway and--\n          \n          \n          INT.   FAST FOOD JOINT - DAY\n          \n          --drop down inside behind an upended table in what was once a\n          taco place, remnants of Mexican decor.\n          \n          THROUGH A DIRTY WINDOW, they see the AEROSTAT buzz past,\n          flying its pattern. It moves on without spotting them, then\n          takes off in a new direction.\n          \n          KYLE and STAR set to searching the place, something they've\n          done many times. They go through trash cans, check behind\n          the counters and in the kitchen. MARCUS gets up, still\n          looking out the windows.\n          \n                                 MARCUS\n                       That flying grapefruit, what was it?\n          \n                                 KYLE\n                       Aerostat-- one of Skynet's eyes.\n                       They patrol places like this,\n                       looking for survivors.\n          \n                                 STAR\n                       Yes!\n          \n          She's come up with some UNOPENED PACKETS OF CONDIMENTS from a\n          bag of TRASH. KYLE trots over.\n          \n                                 KYLE\n                       Any red ones?\n          \n          She nods excitedly, hands him a packet.    He tears it open,\n          sucks down the contents eagerly.\n                                                              (CONTINUED)\n          \n                                                                         18.\n          CONTINUED:\n          \n                                   KYLE (cont'd)\n                       Mm.    Ketchup.\n          \n          STAR discards one packet, sucks at another-- and immediately\n          makes a pained face and tosses the packet aside.\n          \n                                    STAR\n                       Yuk!\n          \n          MARCUS picks up the packet, looks at it.\n          \n                                 MARCUS\n                       Jalapeño sauce.\n          \n          STAR and KYLE pause in their eating, stare at him.\n          \n                                 STAR\n                       You can read.\n          \n          MARCUS shrugs modestly.\n          \n                                 KYLE\n                       So can I.\n                           (off Star's look)\n                       Well, sort of... a little.\n          \n          With obvious reluctance, STAR holds a packet of mustard\n          toward Marcus.\n          \n                                    STAR\n                       Want some?\n          \n          Marcus gallantly waves it away.\n          \n                                    MARCUS\n                       No thanks.     Not hungry.\n          \n                                 KYLE\n                       Never heard anyone say that before.\n          \n                                                               CUT TO:\n          \n          \n          INT.   ABANDONED MOTEL ROOM - DAY\n          \n          ANGLE IN MIRROR - MARCUS stares at his own reflection in a\n          cracked MIRROR.\n          \n          \n                                                               (CONTINUED)\n          \n                                                                         19.\n          CONTINUED:\n          \n                                 MARCUS\n                       I look the same.\n          \n          STAR closes tattered curtains, plops on the bare bed, ready\n          for sleep. The room's a mess, GRAFFITI here and there, trash\n          scattered about; they're not the first squatters who've been\n          here. THE GUNS and STAR'S WATCH lie on a dresser.\n          \n          KYLE sits before the TV-- he's scratching STICK FIGURES onto\n          the screen with a rusted POCKETKNIFE. One is clearly meant\n          to be him; the smaller one, wearing a baseball cap, is Star.\n          \n                                 KYLE\n                       You ever watch television?\n          \n                                 MARCUS\n                       Oh yeah. Was about all I ever had\n                       to look forward to in the joint.\n          \n                                 STAR\n                           (YAWNING)\n                       What's a joint?\n          \n                                 MARCUS\n                           (BLINKS)\n                       Prison. Spent half my life there.\n          \n                                 KYLE\n                       I remember TV a little.   Cartoons.\n                       It was great.\n          \n          KYLE plops on the bed next to STAR, who's already out.\n          MARCUS studies them.\n          \n                                 MARCUS\n                       She your sister?\n          \n                                 KYLE\n                       Dunno. Been together since we was\n                       little. Bunch of us kids was at\n                       the day-care center when the bombs\n                       fell... she and me are the only\n                       ones still around.\n          \n                                 MARCUS\n                           (disturbed; gestures around)\n                       So this is it? Your life?\n          \n          \n                                                             (CONTINUED)\n          \n                                                                         20.\n          CONTINUED: (2)\n          \n                              KYLE\n                    We're gonna find the Resistance, fight\n                    for John Connor against Skynet. You\n                    oughta join us, you're pretty cool.\n          \n                              MARCUS\n                    You don't know me.\n          \n                              KYLE\n                    You're strong, you can read... you\n                    didn't kill us. Good enough for me...\n          \n                              MARCUS\n                    Skynet runs the machines...?   So\n                    who's this John Connor?\n          \n                              KYLE\n                    He's... I don't know. The best.\n                    Everybody talks about him. He's\n                    the one who's gonna save us.\n          \n                              MARCUS\n                    Yeah, right. Him and Jesus.\n          \n                              KYLE\n                    Who's Jesus?\n          \n                              MARCUS\n                    You're asking the wrong guy.\n          \n                              KYLE\n                        (closing his eyes)\n                    So why were you in prison?\n          \n                              MARCUS\n                        (a long beat)\n                    I killed a cop.\n          \n                              KYLE\n                    Were cops like terminators?\n          \n                              MARCUS\n                    Well... Nah, some of `em were all right.\n                        (SIGHS)\n                    My little brother Max, pretty wild\n                    kid, not much older than you-- he\n                    stole a car, just joy-riding,\n                    y'know, showing off.\n                              (MORE)\n                                                               (CONTINUED)\n          \n                                                                         21.\n          CONTINUED: (3)\n                                MARCUS (cont'd)\n                     Cop chased him right into our front\n                     yard, pulled him outta the car...\n                     and started whaling on him, kicking\n                     the shit out of him. No reason for\n                     it, Max was already in cuffs. I ran\n                     out of the house, guy tried to pull\n                     his gun on me-- guess I just went\n                     off on him. Don't even remember it\n                     really... they say I broke his neck.\n                         (BEAT)\n                     Max must be dead too, now... like\n                     everybody else.\n          \n          MARCUS notices now that Kyle is asleep-- it's as if he's\n          lulled him with a bedtime story. Marcus is oddly touched,\n          pulls a cover over both the kids. KYLE starts, half-asleep--\n          \n                               KYLE\n                     You gonna be here when I wake up?\n          \n                                MARCUS\n                     Sure.\n          \n                                KYLE\n                     Good.   Stay away from the windows.\n          \n          So saying, KYLE falls back asleep. MARCUS sighs, moves\n          through the room, quietly opens a drawer or two and finds--\n          \n          A BIBLE.\n          \n          \n          INT.   MOTEL CORRIDOR - DAY\n          \n          AFTERNOON LIGHT, MARCUS sits on the floor by a room door,\n          shotgun leaned on the wall at his side. He has the bible\n          open in his lap, head bowed over it. CLOSER-- his eyes are\n          closed, he's asleep.\n          \n          THE DOOR OPENS behind him, STAR peers out-- and looks\n          relieved to see Marcus is still with them. As she takes a\n          step toward him, he starts awake.\n          \n                                STAR\n                     Just me.\n          \n          MARCUS relaxes, she sits down beside him.\n          \n          \n                                                            (CONTINUED)\n          \n                                                                           22.\n          CONTINUED:\n          \n                                 STAR (cont'd)\n                       Whatcha reading?\n          \n                                  MARCUS\n                       The bible. My grandma always tried\n                       to get me into it, but-- it always\n                       put me to sleep.\n                           (BEAT)\n                       Still does.\n          \n                                 STAR\n                       Would you read something to me?\n          \n          MARCUS shrugs and nods, flips to a random page, squints at\n          the text.\n          \n                                 MARCUS\n                       \"...of the tribe of Simeon, Shaphat\n                       the son of Hori. Of the tribe of\n                       Judah, Caleb the son Jephunneh--\"\n          \n                                 STAR\n                       There's a book inside with pictures.\n          \n          She's already on her feet.\n          \n          CLOSE - A PHONEBOOK, minutes later.    We hear MARCUS reading:\n          \n                                 MARCUS\n                       \"Guaranteed lowest prices... open\n                       seven days...\"\n          \n          STAR sits at his side, looking over his shoulder as he turns\n          pages. She points to something:\n          \n                                 STAR\n                       What's that?\n          \n                                 MARCUS\n                       It's a flower. A rose.\n          \n                                 STAR\n                           (full of wonder)\n                       So... all those numbers... you\n                       could call them and get, like,\n                       flowers, or someone to come over\n                       and fix stuff, or bring you food...\n          \n          \n                                                              (CONTINUED)\n          \n                                                                         23.\n          CONTINUED: (2)\n          \n                              MARCUS\n                        (nods, touched)\n                    Guess people had it pretty good.\n                        (FLIPS)\n                    What else we got... movers,\n                    mufflers, music--\n          \n                              STAR\n                    Music?\n          \n                              MARCUS\n                    You know, pianos, guitars...\n          \n                              STAR\n                    I don't remember music.\n          \n                              MARCUS\n                    Come on. You must...\n                        (approximating the tune)\n                    \"I can't get no... satisfaction...\"\n                        (off her blank look)\n                    \"We are family... I got all my sisters\n                    with me...\" No, huh. How about...\n                    \"Twinkle twinkle little star...\"\n          \n          Star's face lights up, she nods eagerly, sings along:\n          \n                              MARCUS & STAR\n                    \"How I wonder what you are... up\n                    above the world so high, like a\n                    diamond in the sky...\"\n          \n          STAR is dizzy with emotion, wipes an eye, turning away.\n          \n                              MARCUS\n                    You OK?\n          \n                              STAR\n                        (shakes her head)\n                    Somebody used to sing that to me.\n          \n          MARCUS puts the phonebook aside, puts a hand on her arm; and\n          she leans into him for a hug, tears forming in her eyes.\n          \n                              STAR (cont'd)\n                    Stay with us, Marcus. Please.\n          \n          \n          \n                                                             (CONTINUED)\n          \n                                                                          24.\n          CONTINUED: (3)\n          \n          MARCUS looks down at her, affected.\n          \n                                                       DISSOLVE TO:\n          \n          \n          EXT.   MOTEL - DAY\n          \n          AEROSTAT POV - a PIXELLATED ELECTRONIC IMAGE as it patrols\n          the MOTEL AREA in its geometric pattern. It ZOOMS into the\n          CARPORT, quickly scanning the abandoned VEHICLES, among which\n          is an aged, open JEEP WRANGLER, its HOOD UP, parked beside a\n          customized VAN. The cars are covered in DUST, the TIRES\n          FLAT, they've been sitting here for a decade.\n          \n          OBJECTIVE ANGLE - the AEROSTAT zips off on its rounds. After\n          a moment, the VAN DOOR slides open. MARCUS moves quickly\n          back to the JEEP, KYLE and STAR behind him.\n          \n          STAR checks her WATCH while MARCUS goes back to work on the\n          JEEP'S ENGINE. He's found some tools, already has removed\n          and cleaned SPARK PLUGS, dismantled the DISTRIBUTOR. KYLE,\n          meanwhile, returns to INFLATING one of the tires with a\n          BICYCLE PUMP.\n          \n                               KYLE\n                     If we get it to move, will you\n                     teach me to make it go?\n          \n                               MARCUS\n                     It's called driving.   Sure.\n          \n          STAR wipes DIRT off the side of the VAN, revealing air-\n          brushed ARTWORK beneath...\n          \n                                STAR\n                     Wow.   What were these like?\n          \n          MARCUS looks up from his work to see--\n          \n          A WHITE UNICORN in a FIELD OF FLOWERS.\n          \n                               MARCUS\n                         (SMILING)\n                     Not too many around in my time.\n          \n                                                       DISSOLVE TO:\n          \n                                                                          25.\n          \n          \n          EXT.   MOTEL - NIGHT\n          \n          THE AEROSTAT zips past the CARPORT.   As soon as its gone--\n          \n                                 STAR\n                     Now!\n          \n          THE JEEP is suddenly PUSHED from the carport, tires somewhat\n          inflated. MARCUS is on one side of the rear, KYLE on the\n          other, STAR behind the wheel, the seat moved all the way up.\n          \n          They get the vehicle to a slight SLOPE, it begins to roll on\n          its own.\n          \n                               MARCUS\n                     Pop the clutch! Let your foot up!\n          \n          ANGLE IN JEEP\n          \n          We see it's been hot-wired. STAR has her foot all the way\n          down on the clutch, now lets up--\n          \n          THE JEEP BUCKS and SPUTTERS... but CATCHES. As soon as it\n          does, MUSIC BLARES from the tape deck-- raucous HEAVY METAL,\n          the aged cassette SPEEDS and SLOWS. MARCUS runs for the\n          driver's side, but the JEEP is pulling ahead fast.\n          \n          ANGLE IN JEEP\n          \n          STAR is staring at the speaker, mesmerized at the sound of\n          the MUSIC. When she looks out the windshield--\n          \n          --she's about to HIT A WALL, SQUEALS in terror--\n          \n          --MARCUS vaults in and pushes her aside, squeezing behind the\n          wheel, hitting the brakes and throwing the Jeep into neutral.\n          \n                               KYLE\n                     Aerostat's coming!\n          \n          KYLE hops in back as MARCUS adjusts the seat and FLOORS IT.\n          THE KIDS are exhilarated as MARCUS zooms out of there,\n          heading off-road across the plains, LIGHTS OFF, MUSIC LOUD.\n          \n                                 STAR\n                     Music...\n          \n                                 MARCUS\n                     Sort of.\n                                                             (CONTINUED)\n          \n                                                                              26.\n          CONTINUED:\n          \n          MARCUS turns the MUSIC DOWN.       He looks up to see--\n          \n          --THE AEROSTAT, right over their heads, keeping pace with the\n          vehicle, RED LIGHTS FLASHING.\n          \n          KYLE rises in back, SWINGS at it with the SHOTGUN BUTT--\n          \n          THE AEROSTAT deftly dodges the blows.\n          \n                                 STAR\n                       Oh no! It's gonna call a\n                       Harvester, we're dead--\n          \n          MARCUS SLAMS on the brakes-- the AEROSTAT stops a few feet\n          ahead of them, hovering in the air.\n          \n          MARCUS picks up an X-shaped LUG WRENCH from behind his seat,\n          rises, taking aim--\n          \n          --and HURLS THE WRENCH with amazing speed and power--\n          \n          --it flies like a throwing star and SMASHES the AEROSTAT to\n          BITS in a shower of SPARKS and METAL.\n          \n          The three of them stare breathlessly for a moment.\n          \n                                  KYLE\n                       Wow.   You're good.\n          \n          MARCUS flexes his hand, startled at his own strength.\n          \n                                                            DISSOLVE TO:\n          \n          \n          EXT.   TEXAS PLAINS - NIGHT\n          \n          The JEEP moves off-road, HEADLIGHTS OFF, traveling by\n          MOONLIGHT. It SWERVES and BUCKS from time to time. MUSIC\n          PLAYS from the TAPE DECK, something more melodic.\n          \n          ANGLE IN JEEP - KYLE behind the wheel, having the time of his\n          life, MARCUS supervising, STAR enjoying the breeze and the\n          unfamiliar sensation of a moving vehicle.\n          \n                                   STAR\n                       Faster!\n          \n                                   MARCUS\n                       No!    You're doing fine.\n                                                                    (CONTINUED)\n          \n                                                                          27.\n          CONTINUED:\n          \n          The SONG suddenly GARBLES, turning to NOISE. MARCUS ejects\n          the tape, pulls it out-- it's unspooled, tangled in the\n          stereo's guts. THE KIDS groan disappointedly. STATIC from\n          the radio now... but a FAINT VOICE audible beneath it.\n          \n                                 MARCUS (cont'd)\n                       Ssh.\n          \n          MARCUS FIDDLES with the dial. He can't get the SOUND clear,\n          rolls through the dial. Varying levels of STATIC, then a\n          relatively CLEAR VOICE:\n          \n                                 RADIO VOICE\n                       --proper ratio of ammonium nitrate\n                       to diesel fuel. A bomb of this\n                       type can be contained in an\n                       ordinary plastic garbage bag, and\n                       will detonate on impact...\n          \n                                 KYLE\n                           (EXCITED)\n                       That's him!\n          \n                                 RADIO VOICE\n                       This recording has described booby-\n                       traps and explosive devices. It\n                       will repeat every two hours on\n                       different frequencies to avoid\n                       Skynet jamming...\n          \n          STAR points toward the horizon.    Marcus looks up.\n          \n                                 MARCUS\n                       Stop the car.\n          \n          KYLE ACCELERATES.\n          \n                                 MARCUS (cont'd)\n                       Other pedal, other pedal!\n          \n          They SCREECH to a halt.\n          \n          IN THE DISTANCE - a RED GLOW of FLAMES far away. SILHOUETTED\n          against this, strange FLYING VEHICLES and spindly, spider-\n          like MACHINES are just visible.\n          \n          \n          \n          \n                                                                (CONTINUED)\n          \n                                                                          28.\n          CONTINUED: (2)\n          \n                               RADIO VOICE\n                     Do not give in to despair. As\n                     bleak as things seem, I assure you,\n                     humanity will triumph.\n          \n          HIGH ANGLE - THE JEEP turns away from the conflagration,\n          moves off in a new direction and vanishes into the darkness.\n          \n                               RADIO VOICE (cont'd)\n                     The machines only win when we give\n                     up hope... this is John Connor.\n          \n                                                           DISSOLVE TO:\n          \n          \n          EXT.   SERVICE STATION - DAWN\n          \n          HIGH ANGLE - a crumbling SERVICE STATION with a RUSTING\n          TANKER on flat tires, the cab long gone.   MOVE TO FIND the\n          JEEP approaching off-road.\n          \n          THE JEEP pulls to a stop, MARCUS gets out from behind the\n          wheel and moves to the TANKER. STAR and KYLE, with his\n          binocs, scan the area for signs of Skynet surveillance.\n          \n                               KYLE\n                     We oughta find a place to hole up\n                     for the day...\n          \n          MARCUS pounds on the TANKER-- a deep echo.\n          \n                                 MARCUS\n                     Damn it.    Empty.\n          \n          KYLE sniffs the air.\n          \n                               KYLE\n                     You smell that?\n          \n          STAR sniffs the air herself, eyes going wide.\n          \n                                 STAR\n                     Food!\n          \n          They both hop out of the Jeep, running toward the GARAGE,\n          each carrying their unloaded GUNS.\n          \n          HIGH ANGLE - from BEHIND THE RUSTING SIGN, an AEROSTAT\n          appears, aimed at the kids, LIGHTS BLINKING.\n          \n                                                                           29.\n          \n          \n          INT.   SERVICE STATION - DAWN\n          \n          KYLE and STAR slither under a partially open GARAGE DOOR.\n          The space is dark, SMOKE-FILLED... STRIPS OF DRIED MEAT hang\n          from the hydraulic lift. The two youths look amazed and\n          delighted. Kyle shoves the gun into his waistband, moves to\n          the closest strip and PEELS OFF A PIECE, takes a tentative\n          bite, then gnaws ravenously. Star leans the shotgun against\n          the wall and follows suit.\n          \n          MARCUS lifts the garage door and enters, DAWN LIGHT streaming\n          in behind him.\n          \n                               MARCUS\n                     What is this?\n          \n                                KYLE\n                         (mouth full)\n                     Who cares?\n          \n          Marcus squints at something in the darkness.   He takes a step\n          forward, then grabs Star's arm.\n          \n                               MARCUS\n                     Spit it out!\n          \n                                STAR\n                         (CHEWING)\n                     It's good!\n          \n          Now KYLE reacts to what Marcus saw, GAGS and SPITS out meat.\n          He's staring at--\n          \n          --a dried, severed HUMAN HAND, resting on a GRILLE in the\n          sunken SERVICE PIT, where a CHARCOAL FIRE smolders.\n          \n          Star sees it too, turns and RETCHES, just as--\n          \n          --three animal-like CANNIBALS emerge from the back of the\n          garage-- two burly, ugly, unshaven MEN and a wild-eyed,\n          unhealthy-looking WOMAN with matted hair. We'll call them\n          PIG, BULL and COW. PIG grabs the SHOTGUN, BULL grabs KYLE\n          and yanks the HANDGUN from his waistband.\n          \n          COW grabs STAR, shoves her into the center of the garage,\n          beside Kyle and Bull. Bull tosses the handgun to COW who\n          keeps it trained on the kids, sizing them up.\n          \n          \n                                                             (CONTINUED)\n          \n                                                                          30.\n          CONTINUED:\n          \n                                 COW\n                       Not much meat on `em.\n          \n          PIG eyes Marcus, points the shotgun in his face.\n          \n                                 PIG\n                       This one's fi-i-ine--\n          \n          MARCUS raises two fingers like a peace sign-- then shoves\n          them into the barrels of the shotgun. PIG snorts and PULLS\n          THE TRIGGER-- CLICK.\n          \n                                 MARCUS\n                       Oops.\n          \n          MARCUS yanks the gun away and tosses it aside, HEAD-BUTTS\n          Pig, who staggers backward, BLOOD SPRAYING from his nose.\n          \n          COW points the unloaded HANDGUN at Marcus-- CLICK CLICK.\n          \n          KYLE and STAR get free of BULL and dash for the exit, they're\n          out of there in a flash.\n          \n          BULL CHARGES MARCUS, who dodges him, grabs the man and--\n          \n          --HURLS HIM HEAD FIRST into the CHARCOAL PIT-- his BODY\n          SIZZLES against the coals, he SCREAMS and WRITHES.\n          \n          COW picks up an AXE with two hands and SWINGS it at MARCUS\n          who GRABS the HANDLE with one hand and YANKS it away.\n          \n          COW knows she's met her match, turns and flees, heading out\n          the way Kyle and Star went.\n          \n          MARCUS advances on PIG and BULL, brandishing the AXE. Pig\n          squirms back across the floor, wiping BLOOD from his face.\n          \n                                 PIG\n                       We didn't kill `em! I swear to\n                       God, they was dead already, we\n                       wasn't gonna let `em rot--\n          \n          BULL has scrambled out of the coal pit, but is in too much\n          pain to rise.\n          \n                                 BULL\n                       Go `head, take as much as you want,\n                       we're on the same side here--\n          \n                                                             (CONTINUED)\n          \n                                                                            31.\n          CONTINUED: (2)\n          \n          Marcus looks ready to finish them off-- but reacts to CRIES\n          from outside, a loud MECHANICAL RUMBLE.\n          \n          \n          EXT.   SERVICE STATION - DAY\n          \n          A HARVESTER-- a GIANT INSECT-LIKE TERMINATOR-- is outside the\n          station. Many times the size of a human being, MULTIPLE ARMS\n          and LEGS sprout from its thorax, it has multiple CAMERA EYES\n          on long, swiveling stalks-- it carries KYLE and STAR, the\n          kids struggle frantically, caught in the harvester's jointed\n          steel appendages.\n          \n          One unblinking EYE SCANS KYLE, another STAR; the harvester\n          produces a NEEDLE from one of its arms, INJECTS the boy-- who\n          instantly goes limp, unconscious. It does the same to STAR.\n          \n          As COW emerges--\n          \n          --THE HARVESTER SPRINGS on her, with startling speed. She\n          SCREAMS as the enormous terminator hoists her into the air\n          with the others, INJECTS her and begins moving toward--\n          \n          --A TRANSPORT. This consists of CONTAINER resembling a semi-\n          trailer or wheeled dumpster, attached within a FRAMEWORK that\n          features movable ENGINE PODS and a mysterious ARMATURE at the\n          front. A STEEL LID in the top of the container OPENS\n          hydraulically, the Harvester DEPOSITS the HUMAN CAPTIVES\n          inside, and the LID SLAMS SHUT.\n          \n          MARCUS has emerged from the garage, still carrying the AXE.\n          He stays low, hidden behind the tanker, watching as--\n          \n          --PIG and BULL flee through a back entrance to the garage,\n          immediately attracting the attention of--\n          \n          --the Harvester, which sets off in pursuit.\n          \n          Marcus comes to a decision.    He SPRINTS into the open, toward\n          the TRANSPORT, and--\n          \n          --CLAMBERS up the side, hitting the thing at full speed,\n          using an engine pod to boost himself higher. He's still\n          short but swings the AXE and--\n          \n          --hooks the AXE HEAD over the top of the container, like a\n          grappling hook. He pulls himself up and--\n          \n          \n                                                              (CONTINUED)\n          \n                                                                          32.\n          CONTINUED:\n          \n          --crawls across the roof, to the LID. There's a barred,\n          reinforced MESH PANEL here, through which he can see--\n          \n          ANGLE IN TRANSPORT\n          \n          --about TWENTY HUMAN PRISONERS, unconscious on the steel\n          floor. Among them are KYLE and STAR. Star MOANS, opens her\n          eyes briefly and sees--\n          \n          --MARCUS' SILHOUETTE above her.\n          \n          Her eyes flutter shut again.\n          \n          MARCUS struggles to raise the sealed lid, but there's no\n          purchase available, just a smooth seam. Suddenly--\n          \n          --the TRANSPORT JERKS. MARCUS nearly loses his footing as\n          the TRANSPORT STARTS ROLLING forward. He drops to his belly,\n          seeing that the transport is approaching--\n          \n          --the HARVESTER, which now carries PIG and BULL, both\n          unconscious. THE LID OPENS and the Harvester DROPS the two\n          men INSIDE-- but its camera eyes fail to register Marcus, who\n          crouches behind the open lid. As the lid BEGINS TO CLOSE,\n          the Harvester attaches to the armature at the front of the\n          transport, making itself an aerodynamic part of the machine.\n          \n          MARCUS THRUSTS THE HEAD OF THE AXE under the closing LID in\n          order to prevent it from sealing. THE LID grinds against it,\n          but remains ajar. A moment later--\n          \n          --THE ENGINE PODS ROTATE DOWNWARD, FIRE and--\n          \n          --THE TRANSPORT LIFTS OFF THE GROUND. Within moments, the\n          airborne dumpster has risen hundreds of feet in the air.\n          \n          \n          EXT.   AERIAL - DAY\n          \n          MARCUS moves to the edge, looks down in astonishment at the\n          fallow plains far below. Looking to the side, he sees--\n          \n          --A PAIR OF HUNTER KILLERS, swooping in quickly to provide an\n          escort for the slower moving transport.\n          \n          WIND buffets Marcus, he hangs on for dear life. Clinging to\n          the top of the transport, he slowly makes his way back toward\n          the LID. As the transport BANKS, he almost loses his grasp,\n          dangling for a moment before the craft rights itself.\n                                                            (CONTINUED)\n          \n                                                                          33.\n          CONTINUED:\n          \n          MARCUS reaches under the jammed lid and pulls with all his\n          might. This thing is really heavy, plus he's fighting the\n          WIND BLAST. MARCUS hears something behind him--\n          \n          THE HARVESTER has spotted him and is now prying itself loose\n          from the armature. Also buffeted by the wind, it starts to\n          move gingerly down the length of the transport toward Marcus.\n          \n          MARCUS must let the LID CLOSE. He snatches up the AXE, takes\n          a couple of WHACKS at the thing, DENTING the metal, but doing\n          no serious damage. The Harvester KNOCKS the weapon out of\n          his hand, Marcus has no choice but to keep backing away.\n          \n          MARCUS is driven to the back of the transport. Struggling\n          for handholds, he lowers himself out of sight, down the\n          framework along the side, getting out of the wind. Suddenly--\n          \n          --STEEL CLAWS WRAP around him FROM BELOW, YANK him downward.\n          \n          THE HARVESTER has crawled around the SIDE of the TRANSPORT,\n          and under the BOTTOM, in order to GRAB HIM. The hideous\n          machine now holds him in its clutches, hundreds of feet in\n          the air, its CAMERA EYES fixed on him.\n          \n          THE HARVESTER produces its needle, it's coming at his face--\n          but MARCUS frees one hand, grabs the syringe, managing to\n          hold it back, inches from his skin. His strength is\n          weakening, but as the Harvester makes its final thrust--\n          \n          --he JERKS the NEEDLE to one side and it BENDS against one of\n          the Harvester's own steel limbs.\n          \n          Undaunted, the creature crawls up the side of the transport,\n          Marcus still in its clutches. It moves to the lid, which\n          OPENS. It lets go of Marcus to drop him inside when--\n          \n          --MARCUS seizes two of its appendages and swings up onto the\n          harvester's back, where he--\n          \n          --GRABS a couple of EYE STALKS, trying to RIP them from the\n          harvester's thorax, LOOSE WIRES SPARK. The Harvester twists\n          and thrashes, it's like he's a rodeo rider. A LIMB wraps\n          around him, starting to CRUSH him in a vise-like grip, when\n          SUDDENLY--\n          \n          --CANNON FIRE RIPS through the towering HARVESTER, blowing\n          its thorax to PIECES, barely MISSING MARCUS.\n          \n          \n                                                            (CONTINUED)\n          \n                                                                          34.\n          CONTINUED: (2)\n          \n          A PAIR OF A-10 WARTHOGS-- the same colorful ground attack\n          aircraft we saw in the first battle-- ROAR PAST on either\n          side of the transport.\n          \n          THE CRIPPLED HARVESTER topples off the side of the transport,\n          still clutching MARCUS and--\n          \n          --CATCHES on an ENGINE POD, the creature and Marcus both\n          suspended in the air. THE HARVESTER ROASTS in the ENGINE\n          BLAST, its CPU finally dies. Marcus is suspended below the\n          engine, the steel limb RELEASES HIM, he has to cling to it\n          now, to keep from falling.\n          \n          The HUNTER-KILLERS peel out in pursuit of the two Resistance\n          planes.\n          \n          A DOGFIGHT ensues between the much larger, more heavily\n          armored H-Ks, and the smaller, more maneuverable WARTHOGS.\n          CANNON FIRE CATCHES an H-K but has no effect. The H-Ks' BLUE\n          PLASMA PULSES barely miss the planes, which loop and bank.\n          \n          An AIR-TO-AIR MISSILE STREAKS from a WARTHOG and BLASTS the\n          ENGINE of an H-K. AN EXPLOSION, the thing starts flying\n          erratically, heading downward and--\n          \n          --CRASHING to earth in a glorious FIREBALL.\n          \n          \n          EXT.   AERIAL & RIVER - DAY\n          \n          The planes are nearing a RIVER, bordered by sickly TREES. On\n          the far banks, even from above, we see ominous MILITARY\n          FORTIFICATIONS-- CONCRETE BUNKERS, ANTI-AIRCRAFT GUNS, etc.\n          \n          MARCUS meanwhile, is trying to climb up the dead Harvester,\n          avoid the ENGINE BLAST and find a handhold on the transport.\n          \n          THE A-10 that shot down the H-K comes around for another pass\n          at the transport, but--\n          \n          --ANTI-AIRCRAFT GUNS at the far side of the river let out a\n          VOLLEY of BLUE PLASMA-FIRE. The BURSTS arc toward the A-10,\n          which swerves and climbs, but--\n          \n          --PLASMA FIRE destroys a wing, the A-10 SPINS out of control.\n          \n          THE OTHER A-10 breaks off its dogfight with its H-K and\n          speeds away from the river.\n          \n                                                            (CONTINUED)\n          \n                                                                          35.\n          CONTINUED:\n          \n          MARCUS is tantalizingly close to the upper lip of the\n          transport, he reaches out and--\n          \n          --THE FRIED HARVESTER suddenly dislodges from the ENGINE POD,\n          taking Marcus with it, into FREEFALL.\n          \n          WITH MARCUS, plummeting downward toward earth, a hundred feet\n          below, the transport continuing on its way above, crossing\n          the river.\n          \n          MARCUS' POV - the ground and treetops getting closer. At the\n          last moment, his continuing forward momentum takes him OVER\n          THE RIVER and--\n          \n          MARCUS and the DEAD HARVESTER HIT THE WATER, hard, vanishing\n          below the surface with enormous SPLASHES.\n          \n          The surviving H-K and the TRANSPORT continue across the river\n          into Skynet territory, vanishing in the distance.\n          \n          CAMERA MOVES to FIND a PARACHUTE, drifting earthward on the\n          unfortified side of the river.\n          \n          \n          EXT.   RIVERBANK - DUSK\n          \n          HOLD ON LAPPING WATER for a beat.      Then--\n          \n          --MARCUS breaks the surface, staggering toward shore, he\n          drops to his knees in the shallows.\n          \n          WAKES APPEAR behind him. Hearing the water stir, Marcus\n          turns to see numerous DARK SHAPES moving rapidly in on him,\n          from different directions, FLASHES OF METAL visible beneath\n          the surface. These are HYDROBOTS-- AQUATIC TERMINATORS-- but\n          we don't get a good look at them (yet) and Marcus isn't\n          sticking around. He scrambles for the riverbank and makes\n          his way into the leafless trees.\n          \n          \n          EXT.   TREES - EVENING\n          \n          MARCUS moves past the trunks of bare trees, pauses, looks\n          over the water in the direction the transport took.\n          \n                                  BLAIR (O.S.)\n                       Yo!   Up here!\n          \n          \n                                                            (CONTINUED)\n          \n                                                                          36.\n          CONTINUED:\n          \n          BLAIR WILLIAMS, the helmeted pilot who ejected, hangs from\n          the tangled remains of her parachute, caught in the trees\n          about fifteen feet in the air above Marcus.\n          \n          MARCUS moves closer.    Blair struggles to saw through her\n          lines with a KNIFE.\n          \n                                 BLAIR (cont'd)\n                       Who are you--\n          \n          The LINES suddenly SNAP, Blair FALLS from the tree.\n          \n          Marcus' reflexes are fast as ever, he's beneath her in an\n          instant and CATCHES HER. He holds her in his arms:\n          \n                                 MARCUS\n                       Name's Marcus.\n          \n                                 BLAIR\n                       You can put me down now, Marcus.\n          \n          He does so. Blair pulls off her helmet, her hair is short.\n          She's in her 20s, pretty, petite but strong, a no-nonsense,\n          battle-hardened member of the Resistance. She pulls a\n          COMPASS from her flight suit, consults it briefly as she\n          orients herself.\n          \n                                 BLAIR (cont'd)\n                       I've got an ELT, but I can't call\n                       for a rescue here. There's an\n                       outpost a few miles upriver-- not\n                       my favorite people in the world,\n                       but it's safe. Let's move.\n          \n          Blair is already moving, Marcus hesitates, then points across\n          the water.\n          \n                                 MARCUS\n                       I'm heading that way.\n          \n                                 BLAIR\n                           (a short laugh)\n                       The hot zone? No you're not.\n          \n                                 MARCUS\n                       I've got to get to my friends--\n          \n                                 BLAIR\n                       What friends?\n                                                              (CONTINUED)\n          \n                                                                         37.\n          CONTINUED: (2)\n          \n                              MARCUS\n                    Couple of kids. They were in that\n                    flying dumpster--\n          \n                              BLAIR\n                    The Skynet transport? It was\n                    carrying people?\n                        (off his nod)\n                    Christ, we almost shot it down.\n                    There've been rumors about a\n                    concentration camp, but...\n          \n          She shakes her head, gestures toward the river.\n          \n                              BLAIR (cont'd)\n                    You can't get across-- river's\n                    fulla hydrobots--\n          \n                                 MARCUS\n                    Hydrobots?\n          \n                              BLAIR\n                    They can't see, but they have killer\n                    sonar. They'll attack anything that\n                    moves or makes a sound. Even if you\n                    get past them, you'd be dead before\n                    you covered a hundred yards. If the\n                    terminators don't get you, the fallout\n                    will-- heavy rads all the way to the\n                    Gulf coast, nothing can live there.\n          \n          Marcus absorbs this, starts walking with her.\n          \n                              MARCUS\n                    You're with the Resistance.\n          \n                              BLAIR\n                    Lt. Blair Williams, I fly for what\n                    used to be the Air National Guard.\n          \n          She puts a hand out, listening.   She signals for him to lay\n          low, behind a fallen tree.\n          \n          NEARBY-- a pair of T-1s on patrol rumble into view. They\n          pause, scanning the area, chain-guns at the ready. They\n          start to move toward BLAIR and MARCUS' hiding place.\n          \n          BLAIR quickly grabs a STONE and, staying down, hurls it as\n          far away as she can--\n                                                             (CONTINUED)\n          \n                                                                            38.\n          CONTINUED: (3)\n          \n          THE STONE strikes a few BRANCHES--\n          \n          THE T-1s suddenly turn in that direction, GUNS BLAZING--\n          \n          THE WOODS in the immediate vicinity are torn to pieces by the\n          GUNFIRE, small FIRES erupt from the incendiary bullets-- it's\n          definitely overkill.\n          \n          THE T-1s roll over to inspect the damage, out of view.\n          \n          BLAIR whispers:\n          \n                               BLAIR (cont'd)\n                     Stupid bastards. Come on.\n          \n          She and Marcus move away quickly, away from the trees.    When\n          they're a safe distance from the robots--\n          \n                               MARCUS\n                     I don't know... this has gotta be\n                     some kind of, like, dream or\n                     hallucination. Like what happens\n                     to people right before they die...\n          \n          Blair SLUGS him hard, in the arm.     He doesn't flinch, but he\n          looks surprised.\n          \n                               BLAIR\n                     That snap you out of it?\n          \n          MARCUS shakes his head.   They keep walking.\n          \n                               BLAIR (cont'd)\n                     Well hell, maybe you are dreaming. Do\n                     us all a favor and wake up already.\n          \n                                                               CUT TO:\n          \n          \n          EXT.   MUTANT FOREST - NIGHT\n          \n          THE MOON over a scrubby forest, trees just a few feet high.\n          BLAIR and MARCUS seem like giants as they move among them.\n          They've been talking a while, Blair's absorbing something.\n          \n                               BLAIR\n                     So let me get this straight, Marcus.\n                     There you are on death row, they stick\n                     a needle in your arm...\n                               (MORE)\n                                                               (CONTINUED)\n          \n                                                                          39.\n          CONTINUED:\n                                 BLAIR (cont'd)\n                       and the next thing you know, you're\n                       here.\n                           (off his nod)\n                       Since this ain't the resurrection,\n                       there's only one possibility.\n          \n                                 MARCUS\n                       Let's hear it.\n          \n                                 BLAIR\n                       Whatever they pumped into your veins just\n                       knocked you out. This Angel Project you\n                       signed up for-- there was a lotta\n                       cryogenic stuff going on before the bombs\n                       fell, they musta froze your ass.\n          \n                                 MARCUS\n                       What the hell for?\n          \n                                 BLAIR\n                       Drug tests, medical experiments, organ\n                       harvesting, who knows? You said you\n                       had no family, no friends-- why let a\n                       body like yours go to waste?\n          \n          She's looking him over as she says this, it almost sounds\n          flirtatious. Marcus changes the subject.\n          \n                                 MARCUS\n                       I've never seen trees like these.\n          \n                                 BLAIR\n                       We're in a mutation zone. I saw a\n                       two-headed squirrel here once--\n          \n                                 MARCUS\n                       Freaky.\n          \n                                 BLAIR\n                           (SHRUGS)\n                       Tasted like chicken.\n          \n          BLAIR pauses, checking a small GEIGER COUNTER she carries--\n          it CLICKS a bit.\n          \n                                 BLAIR (cont'd)\n                       Levels are tolerable now, but just.\n                       We can't spend the night here.\n          \n                                                                (CONTINUED)\n          \n                                                                          40.\n          CONTINUED: (2)\n          \n          They start moving again.   Marcus pauses, listens:\n          \n                              MARCUS\n                    What was that?\n          \n                              BLAIR\n                    I didn't hear anything--\n          \n          Now they both hear an eerie HOWL, changing in pitch-- like a\n          coyote on crack. More than one picks up the CHORUS.\n          \n                                BLAIR (cont'd)\n                    Skindogs.\n          \n          She pulls a SIDEARM, holds it at the ready as she starts\n          running, away from the direction of the noise. Marcus keeps\n          up at her side, looking behind them.\n          \n          WITH THE DOGS\n          \n          We don't get a good look at them, but there's a pack of large\n          BEASTS moving quickly through the undergrowth, gaining on the\n          fleeing humans.\n          \n          BLAIR sees they won't outrun them. She spins, FIRES in the\n          direction of the approaching PACK. Suddenly it's quiet-- the\n          animals fan out, forming a circle around Blair and Marcus.\n          \n                              MARCUS\n                    They're surrounding us.\n          \n          QUICK SHOTS of MUTANT EYES, glowing in the dark-- ENLARGED\n          TEETH-- DARK, MASSIVE FORMS moving through the brush.\n          \n                              BLAIR\n                    They're smart. And they don't\n                    scare easy.\n          \n          After a few tense beats, from the foliage--\n          \n          A SKINDOG leaps at BLAIR from behind-- it's hideous, the size\n          of a Great Dane, hairless, with veiny, wrinkled skin and\n          long, catlike CLAWS. Before Blair can react, MARCUS leaps\n          between her and the dog, grabs the slavering creature by the\n          throat. It SNAPS its ELONGATED TEETH at him, but he manages\n          to BREAK its neck and hurl it toward--\n          \n          TWO MORE SKINDOGS moving in for an attack.\n          \n                                                               (CONTINUED)\n          \n                                                                         41.\n          CONTINUED: (3)\n          \n          BLAIR FIRES a few SHOTS at the encroaching pack, we hear a\n          few YELPS--\n          \n          MARCUS protects her, effortlessly tosses a few more SKINDOGS\n          aside, ignoring vicious bites and scratches.\n          \n          The other SKINDOGS turn on dead and injured pack members,\n          begin TEARING INTO THEM. There's an opening now, the two\n          humans make a run for it.\n          \n          BLAIR catches her breath, looking him over, seriously\n          impressed by his strength and calm.\n          \n                               BLAIR (cont'd)\n                     You saved my ass. Thanks.\n          \n          MARCUS shrugs, turns back to see the feeding frenzy.\n          \n                               MARCUS\n                     Dog eat dog world.\n          \n          \n                                                         DISSOLVE TO:\n          \n          \n          EXT.   NORMAL FOREST - NIGHT\n          \n          It's darker now, the moon is down. MARCUS and BLAIR move\n          gingerly-- she TRIPS, he catches her before she falls.\n          \n                                BLAIR\n                     Thanks.\n          \n          BLAIR sighs, yawns, sits against a tree.\n          \n                               BLAIR (cont'd)\n                     It's not far, but we'll never get\n                     across the mine field at night.\n                     Might as well STAF till morning.\n          \n          MARCUS nods, sits a few feet away from her.\n          \n                               BLAIR (cont'd)\n                     C'mere, it's cold. I don't bite.\n          \n          MARCUS slides toward her, she nestles against him.\n          \n                                MARCUS\n                     Staf?   What's that mean?\n                                                               (CONTINUED)\n          \n                                                                           42.\n          CONTINUED:\n          \n                                 BLAIR\n                       It's a resistance term.    Sit tight\n                       and fuck.\n          \n          Soon they're kissing passionately.      But MARCUS pulls away,\n          rolls onto his back.\n          \n                                 BLAIR (cont'd)\n                       You holding out for lipstick?\n                       Lingerie? Or am I not your... type?\n          \n                                 MARCUS\n                       I'm not gay. In prison, I thought\n                       about puss-- women all the time. But\n                       now... it's not working. Who knows,\n                       all those years on ice...\n          \n                                 BLAIR\n                       Maybe it's just gonna take some time.\n                       Before you're completely thawed out.\n          \n          She's slipped a hand inside his pocket for warmth... now she\n          pulls out the SCRAPS of paper, with women's faces. She\n          squints at these in the dark.\n          \n                                 BLAIR (cont'd)\n                       What are these?\n          \n                                 MARCUS\n                       I dunno. They just... sorta\n                       reminded me of her.\n          \n                                 BLAIR\n                       Who?\n          \n          MARCUS speaks carefully, unsure how to articulate this.\n          \n                                 MARCUS\n                       There's a woman, the last woman I\n                       saw before... when I was under, the\n                       dead time-- she kept coming to me.\n                       I think she must've saved me.\n          \n                                 BLAIR\n                       I can't compete with that.\n          \n          \n          \n          \n                                                                (CONTINUED)\n          \n                                                                          43.\n          CONTINUED: (2)\n          \n          She closes her eyes, settling against him, her head against\n          his chest. Marcus stares up into the darkness.\n          \n                                                              CUT TO:\n          \n          \n          INT.   TRANSPORT - NIGHT\n          \n          DARKNESS. We just make out KYLE and STAR among the other\n          PRISONERS, most of whom are awake now in the steel container.\n          Star still wears her baseball cap. The prisoners are JOSTLED\n          as the transport touches down.\n          \n                               KYLE\n                     We've landed.\n          \n          \n          EXT.   LOADING ZONE - NIGHT\n          \n          The TRANSPORT has landed amongst numerous CONTAINERS, CRANES\n          and VEHICLES-- all is dimly lit, enveloped in a vague reddish\n          HAZE. THE FLYING FRAMEWORK and ARMATURE detach from the\n          TRANSPORT, and TAKE OFF into the air again-- leaving the\n          trailer-like wheeled CONTAINER. Something resembling the CAB\n          of a semi-truck backs into position, latching onto attachment\n          points on the container.\n          \n          \n          INT.   TRANSPORT - NIGHT\n          \n          --A SMALL PANEL SLIDES OPEN   at the front of the transport,\n          and a half-dozen PROCESSING   AEROSTATS buzz inside from the\n          cab. These are larger than    the spy drones, with attached\n          PINCERS that can encircle a   person's arm.\n          \n          PRISONERS duck, try to dodge these things. But they quickly\n          buzz from captive to captive, latching onto their arms-- we\n          hear SCREAMS, see FLASHES OF LIGHT from the aerostats.\n          \n          KYLE tries to bat away an AEROSTAT, but its PINCERS latch\n          onto his forearm. A SIZZLING SOUND-- Kyle CRIES OUT with the\n          pain, a flash of RED LIGHT-- then the aerostat DETACHES and\n          moves to its next victim.\n          \n          STAR gets the same treatment from a different AEROSTAT.   She\n          moves to Kyle's side, tears in her eyes, sucking on her\n          burned wrist to ease the pain.\n          \n          \n                                                              (CONTINUED)\n          \n                                                                          44.\n          CONTINUED:\n          \n                                 STAR\n                       What's going to happen to us?\n          \n                                 KYLE\n                       I don't know...\n          \n          KYLE looks grimly down at--\n          \n          --a fresh BAR CODE seared into his arm.\n          \n          \n          EXT.   LOADING ZONE/HIGHWAY - NIGHT\n          \n          THE CAB and CONTAINER, now resembling a semi, pulls out of\n          the loading area. Digitally controlled, it needs no\n          headlights as it rolls in the near-darkness.\n          \n          OVERHEAD ANGLE as the vehicle moves onto a cloverleaf access\n          ramp leading to a HIGH SPEED SUNKEN HIGHWAY, a river of fast-\n          moving TRAFFIC heading in both directions-- unlit vehicles\n          moving close together at 120 mph through the reddish gloom.\n          \n                                                            CUT TO:\n          \n          \n          EXT.   FOREST CLEARING - DAWN\n          \n          CLOSE - BLAIR and MARCUS's feet trudge through low brush,\n          step over undergrowth. CAMERA MOVES to find a STRAND OF\n          BARBED WIRE, emerging from the dirt a few feet away.\n          \n          MARCUS pauses, almost having stepped on a WATERMELON.\n          \n                                 MARCUS\n                       We're in somebody's garden.\n          \n          BLAIR stops walking, alarmed, a few feet away from him.\n          \n                                 BLAIR\n                       Christ... there's supposed to be\n                       barbed wire along the edge.\n          \n          MARCUS looks around them, points.\n          \n                                 MARCUS\n                       Over there.\n          \n          \n          \n                                                            (CONTINUED)\n          \n                                                                          45.\n          CONTINUED:\n          \n          A few yards away, STRINGS OF BARBED WIRE... CAMERA MOVES to\n          reveal it's behind as well as ahead of them. They've come\n          through a gap where the wire had fallen.\n          \n                                 BLAIR\n                       Whatever you do, don't move.\n                           (SHOUTS)\n                       Yo! Morrison, Barnes! Can anybody\n                       hear me?!\n                           (to Marcus)\n                       We're in the middle of the mine field.\n          \n                                                                CUT TO:\n          \n          \n          INT.   OUTPOST/BARRACKS & COMMUNICATIONS AREA - DAY\n          \n          DARK. We hear BABIES CRYING from nearby, FUMBLING in the\n          dark, muttered CURSES-- then a MATCH lights a CANDLE.\n          BARNES, 20-ish, good-looking and cocky, yawns and sneers,\n          annoyed at being awakened. TWO WOMEN share his mattress.\n          \n                                 BARNES\n                       Somebody feed those things!\n          \n                                 MORRISON\n                       Start up the generator, Barnes.\n          \n          MORRISON is bearded, long-haired, bleary-eyed, a middle-aged\n          man in charge here. He sits up in bed, also beside A COUPLE\n          OF WOMEN. This place has become an underground crash pad,\n          communal living for about a dozen people-- Morrison and\n          Barnes the only men, four or five WOMEN and quite a few\n          CHILDREN of varying age.\n          \n          BARNES grunts, yanks the blanket off his bedmates, who CRY\n          OUT in protest. He wraps it around himself, carries the\n          candle as he steps around other SLEEPING FIGURES, makes his\n          way toward a METAL STAIRCASE winding downward. Moments\n          later, we hear a GAS ENGINE start up-- LIGHTS flicker on.\n          \n          The place is pretty grimy and run-down, but it was once a\n          military environment. There's a BANK OF TV MONITORS against\n          one wall, which COME TO LIFE. A couple of the WOMEN move\n          toward the adjacent NURSERY AREA to tend to the babies-- one\n          of them, LISA, moves to the TV MONITORS. She squints at one.\n          \n                                 LISA\n                       We got company!\n                                                                (CONTINUED)\n          \n                                                                          46.\n          CONTINUED:\n          \n          ON A SCREEN\n          \n          MARCUS and BLAIR in the exact positions we last saw them,\n          looking exhausted. They CRY OUT, unheard.\n          \n          \n          EXT.   FOREST CLEARING - DAY\n          \n          BARNES pokes his head up from a concealed TRAPDOOR thirty\n          yards from BLAIR and MARCUS, who are hoarse from shouting.\n          \n                                 BARNES\n                       Blair? Good to see you.\n                           (off her glare)\n                       What's the password?\n          \n                                 BLAIR\n                       Eat shit and die, Barnes!\n          \n                                 BARNES\n                       Close enough. Who's your friend?\n          \n                                 BLAIR\n                       Could you get us outta here please?\n          \n                                 BARNES\n                       Kinda dumb-ass, wandering around in\n                       a mine field.\n          \n                                 BLAIR\n                       You didn't maintain the perimeter!\n                       Where are your sentries?\n          \n                                 BARNES\n                       It's too early for that military crap.\n          \n          BARNES consults a MAP, turning it to orient himself.\n          \n                                 BARNES (cont'd)\n                       OK, if you keep walking straight\n                       you're gonna get blown all to\n                       hell... turn to your left and take,\n                       oh... five steps.\n          \n          BLAIR and MARCUS obey, moving cautiously.\n          \n                                 BARNES (cont'd)\n                       OK, face me now. Three steps.\n          \n                                                                (CONTINUED)\n          \n                                                                          47.\n          CONTINUED:\n          \n          They do as told.\n          \n                                 BARNES (cont'd)\n                       Almost home. Turn to your right\n                       and take another five steps...\n          \n          They slowly pace five steps.      On the fifth one, there's a\n          CLICK beneath Marcus' foot--\n          \n          A horrified moment of eye contact between him and Blair-- she\n          DIVES TO THE GROUND, away from him as--\n          \n          BOOM!   MARCUS is thrown through the air by the EXPLOSION--\n          \n          MARCUS' BODY lands a few feet from the trap door.\n          \n          \n          INT.    OUTPOST/CORRIDOR - DAY\n          \n          Frantic action-- the unconscious MARCUS is carried down a\n          corridor from the open trap door by BARNES, MORRISON and a\n          couple of women, NANCY and LISA. BLAIR, bleeding from\n          shrapnel injuries, assists. She yells at BARNES:\n          \n                                 BLAIR\n                       You goddamn idiot!\n          \n                                 BARNES\n                       He was takin' bigger steps!\n          \n                                 MORRISON\n                       Son of a bitch is heavy.\n          \n          \n          INT.    OUTPOST/INFIRMARY - DAY\n          \n          MARCUS is deposited gingerly on a METAL TABLE in this crude\n          MEDICAL AREA. Numerous INFANTS and TODDLERS about.\n          \n          JANE, a doctor, moves toward MARCUS with scissors and other\n          medical tools, cuts away a tattered pants leg, the shreds of\n          his sneaker. She stops and stares, palpates a BLACKENED LEG\n          briefly. She looks up in alarm.\n          \n                                 JANE\n                       He stepped on a Claymore? This guy\n                       oughta be in a hundred pieces...\n          \n          \n                                                                (CONTINUED)\n          \n                                                                           48.\n          CONTINUED:\n          \n          She takes a scalpel, pulls it across the CHARRED, HEAT-\n          DEFORMED SKIN. It doesn't even leave an incision.\n          \n                                 BLAIR\n                       What are you doing?\n          \n                                 JANE\n                       Does he have a prosthetic limb?\n          \n                                 BLAIR\n                       I don't think so.\n          \n          JANE opens Marcus' shrapnel-torn shirt, takes the scalpel and\n          gingerly pulls it across the flesh of his chest. No effect.\n          \n                                 JANE\n                       This is not skin... oh Jesus-- oh God--\n          \n          JANE looks at MORRISON, backing away from Marcus.\n          \n                                 JANE (cont'd)\n                       He's a terminator.\n          \n                                                         CUT TO BLACK.\n          \n          MEMORY MONTAGE: QUICK SHOTS-- altered, impressionistic, as\n          before. SFX of STATIC, high-pitched, complex DIGITAL NOISE.\n          \n          --a detached, fleshless metal framework for a ROBOTIC HAND is\n          suspended by wires-- it FLEXES, forming a FIST.\n          \n          --CAMERA CIRCLES a muscular MALE TORSO, without arms, legs or\n          head. METALLIC ATTACHMENT POINTS await these missing parts.\n          \n          --the inside of MARCUS' FACE, a thin membrane of artificial\n          skin with eye, nose and mouth holes, is lowered through an\n          AQUEOUS environment TOWARD CAMERA.\n          \n          THROUGH AN EYEHOLE we see SERENA, face distorted by the\n          LIQUID. She looks worried. We hear her MUFFLED VOICE:\n          \n                                 SERENA\n                       Why isn't he conscious?\n                       Something's wrong, he should be\n                       coming out of it by now...\n          \n                                                                 CUT TO:\n          \n                                                                          49.\n          \n          \n          INT.   OUTPOST/LAUNCH TUBE - DAY\n          \n          START TIGHT ON MARCUS as he opens his eyes, a beam of bright\n          SUNLIGHT in his face. CAMERA PULLS BACK and ROTATES to\n          reveal that he is suspended UPSIDE-DOWN from a winch by a two-\n          inch thick STEEL CABLE.\n          \n          MARCUS thrashes, trying to free himself, then looks up and\n          sees that--\n          \n          --the CABLES are strung through HEAVY STEEL BOLTS which have\n          been DRILLED THROUGH HIS CALVES, locking them together. His\n          FOREARMS have been immobilized in the same grotesque fashion.\n          \n          From above, the BEAM OF SUNLIGHT shines through the narrow\n          crack between an enormous pair of SLIDING STEEL PANELS.\n          \n          MARCUS twists his neck to look downward--\n          \n          MARCUS' POV-- a circular pit below, the dark bottom invisible\n          to him-- he's hanging near the top of an empty MISSILE SILO,\n          its ICBM launched years ago.\n          \n          At one edge of the silo pit, near scaffolding and tool carts,\n          SMALL CHILDREN have gathered to stare. Also there is BARNES--\n          he leans back, eyes closed, in a folding chair, with an RPG\n          in his lap. One of the KIDS taps Barnes' leg and he jerks\n          upright. He immediately trains his weapon on MARCUS, clearly\n          nervous now that the terminator is conscious.\n          \n          MARCUS stares at Barnes, deadpan, for a beat.\n          \n                               MARCUS\n                     Boo!\n          \n          \n          INT.   OUTPOST/BARRACKS & COMMUNICATIONS AREA - DAY\n          \n          CLOSE ON X-RAYs of MARCUS' TORSO and LIMBS-- clearly\n          mechanical gears, steel plating, hydraulics, etc.\n          \n                               JANE\n                     Thermoplastic skin, some larger\n                     hydraulics, but mostly titanium\n                     microgears... This looks like some sort\n                     of aeration and hydration system,\n                     function unclear at this point. Valves\n                     and what looks like an access panel\n                     below the ribcage...\n                                                                (CONTINUED)\n          \n                                                                           50.\n          CONTINUED:\n          \n          WIDER, JANE holds up an X-ray of his SKULL, which shows\n          almost nothing.\n          \n                                 JANE (cont'd)\n                       Eyes are polymer optics, very lifelike.\n                       Lead shielding all around the skull,\n                       presumably to protect the CPU.\n          \n          MATTRESSES have been piled to one side, we now see framed,\n          cracked and yellowing POSTERS of MILITARY EQUIPMENT-- AIR\n          FORCE JETS, ATLAS ROCKETS, etc. These are interspersed with\n          crude CHILDREN'S DRAWINGS on the walls.\n          \n          BLAIR sits at a battered dining table, surrounded by angry\n          outpost RESIDENTS, including JANE and MORRISON.\n          \n                                 BLAIR\n                       Whatever he is-- he's on our side--\n          \n                                 MORRISON\n                       How can he be?\n          \n                                 BLAIR\n                       He saved my life!\n          \n                                 MORRISON\n                       Winning your trust would aid his\n                       infiltration.\n          \n          At the communications area by the TVs, LISA wears a HEADSET,\n          speaking into a SHORTWAVE RADIO. She calls to the others:\n          \n                                 LISA\n                       Regional doesn't know what to do.\n                       They're gonna patch us through to\n                       Command Los Angeles.\n          \n          NANCY, an overwrought older WOMAN, gets in Blair's face,\n          pointing at the X-rays.\n          \n                                 NANCY\n                       How could you bring this monster here?!\n                       This is our home! Our children--\n          \n                                 BLAIR\n                       What do you want from me-- I didn't know!\n          \n          A KID runs into the room.\n          \n                                                                 (CONTINUED)\n          \n                                                                       51.\n          CONTINUED: (2)\n          \n                               KID\n                     It's awake!\n          \n          \n          INT.   OUTPOST/LAUNCH TUBE - DAY\n          \n          BLAIR is first to reach the edge of the silo, horrified at\n          the sight of the dangling MARCUS. BARNES keeps the RPG\n          trained on him, they shout over each other.\n          \n                               MARCUS\n                     Get me the hell down from here!\n          \n                                BARNES\n                     Shut up!   I told you to shut up!\n          \n                               BLAIR\n                     Leave him alone!\n                         (turning away from him)\n                     Marcus, I'm so sorry...\n          \n          MORRISON and the OTHERS join them, eyes fixed on Marcus.\n          \n                               BARNES\n                     It keeps talkin' at me. God this\n                     thing gives me the creeps.\n          \n                               MARCUS\n                     Why are you doing this?    What is\n                     this place?\n          \n                               MORRISON\n                     We're trying to--\n          \n                               NANCY\n                         (over him)\n                     Don't say anything!     It's probably\n                     uplinked to Skynet.\n          \n          Morrison puts a hand on her arm.\n          \n                               MORRISON\n                     Then it's already too late.\n                         (to Marcus)\n                     This used to be an ICBM silo, we're\n                     just trying to stay alive here.\n                     Your turn-- where'd you come from?\n          \n          \n                                                             (CONTINUED)\n          \n                                                                             52.\n          CONTINUED:\n          \n                                 MARCUS\n                       Corpus Christi. It's in Texas.     Or\n                       it was.\n          \n                                 BARNES\n                           (AMAZED)\n                       It sounds completely human... it\n                       really could pass.\n          \n                                 JANE\n                       Didn't John Connor say they'd start\n                       building things like this?\n          \n                                 MORRISON\n                       Not yet-- not for years.\n                           (to Marcus)\n                       So, you're programmed with false\n                       memories, a human history--\n          \n                                 MARCUS\n                       What are you talking about?\n          \n                                 MORRISON\n                       You can skip the act, we know what\n                       you are.\n          \n                                 NANCY\n                       Why are you even speaking to it?!\n          \n                                 BARNES\n                       She's right, let's just waste the\n                       damn thing--\n          \n                                 NANCY\n                       It'll kill us all if we give it a\n                       CHANCE--\n          \n          During the above, other KIDS and ADULTS IN BG AD LIB-- \"Kill\n          it,\" \"Goddamn robot,\" etc.-- increasing mob anger, until--\n          \n                                    MARCUS\n                       I'm a man!\n          \n          His impassioned CRY silences the onlookers.       He speaks more\n          quietly, desperately:\n          \n                                 MARCUS (cont'd)\n                       Even if I never been treated like\n                       one.\n                                 (MORE)\n                                                                 (CONTINUED)\n          \n                                                                         53.\n          CONTINUED: (2)\n                               MARCUS (cont'd)\n                     Year after year after year on death\n                     row, I just wanted it to end! I\n                     cut my own wrists. But they nursed\n                     me back to health, `cause that\n                     wouldn't be fair, they needed to\n                     kill me themselves. For Chrissake,\n                     you all want me dead so bad-- just\n                     do it.\n                         (a scream)\n                     Do it!\n          \n          His CRY ECHOES through the silo. The CHILDREN cower behind\n          the adults. BLAIR is genuinely moved by his plight.\n          \n          BARNES hefts the RPG, looks toward MORRISON-- \"should I?\"\n          Morrison seems torn, about to give the order--\n          \n          LISA rushes in from the communications area, breathless,\n          amazed by her own news:\n          \n                               LISA\n                     Regional got through to CLA-- they\n                     want us to rig a video feed.\n                         (gesturing at Marcus)\n                     He wants to see him.\n          \n                                 MORRISON\n                     Who does?\n          \n                               LISA\n                     John Connor.\n          \n          They all seem astonished-- this has gone right to the top.\n          \n                                                            CUT TO:\n          \n          \n          INT.   OUTPOST/COMMUNICATIONS AREA - DAY\n          \n          MARCUS sits impatiently in a wooden chair, facing a VIDEO\n          CAMERA and a MICROPHONE. BARNES trains an RPG at his head\n          while MORRISON finishes PADLOCKING HEAVY CHAINS to the BOLTS\n          in Marcus' arms and legs-- these attach to a nearby STEEL\n          POST. BLAIR stands nearby. LISA fumbles nervously with the\n          TRANSMITTER, plugging in wires.\n          \n                               MARCUS\n                     So this guy is what, like king of\n                     the world, or what's left of it?\n                                                            (CONTINUED)\n          \n                                                                          54.\n          CONTINUED:\n          \n                                 MORRISON\n                       John Connor founded the Resistance.\n                       When the war began, no one even\n                       knew who the enemy was-- Connor\n                       taught us how to fight back. He\n                       saved humanity.\n          \n                                 MARCUS\n                       Yeah, well, humanity's never done\n                       all that much for me. Why can't I\n                       see him?\n          \n                                 MORRISON\n                       Nobody sees him. Skynet can't be\n                       allowed to discover his location,\n                       even his appearance is kept secret.\n          \n          LISA makes a connection, we hear CONNOR'S VOICE, the same one\n          we heard on the car radio.\n          \n                                 CONNOR'S VOICE\n                       --hello-- standing by--\n          \n                                 LISA\n                       Sir, we can hear you, sir, working\n                       on a visual, sir...\n          \n          \n          INT.   COMMAND CENTER/CONFERENCE AREA - DAY\n          \n          MARCUS' FACE pops to life on a VIDEO MONITOR. We're in a\n          Spartan, windowless space, it feels like it's underground.\n          \n                                 CONNOR\n                       Not what I expected...\n          \n          JOHN CONNOR leans INTO FRAME, studies the screen. He wears a\n          dark sweater, nothing like a uniform. Connor is 40ish now,\n          but looks older, prematurely grey, years of war have taken a\n          toll. There's an ever-present sadness in his eyes.\n          \n                                                        INTERCUT WITH:\n          \n          \n          INT.   OUTPOST/COMMUNICATIONS AREA - DAY\n          \n          MARCUS listens to the disembodied VOICE, unimpressed.    The\n          OTHERS almost stand at attention.\n          \n                                                              (CONTINUED)\n          \n                                                                            55.\n          CONTINUED:\n          \n                                 CONNOR'S VOICE\n                       It does seem lifelike-- is the face\n                       able to mimic emotions--?\n          \n          MARCUS rolls his eyes, makes an angry FACE at the CAMERA.\n          \n                                 MARCUS\n                       This shit is ridiculous. What the\n                       hell do you want from me?\n          \n                                 CONNOR\n                           (STUNNED)\n                       I-- I need to know what you are.\n          \n                                 MARCUS\n                       So do I! I don't know what I am, what\n                       I'm doing here, I don't know shit--\n                       maybe I never did, but-- I'm sick of it!\n                       Just blow my head off or let me go.\n          \n                                 CONNOR\n                       This isn't right. I can't be\n                       having a conversation with a\n                       terminator, Skynet isn't that\n                       sophisticated yet. Unless... were\n                       you sent here from the future?\n          \n                                 MARCUS\n                           (very confused)\n                       What?\n          \n                                 CONNOR\n                       Skynet's developing a time\n                       displacement field, we've decrypted\n                       recent data transmissions.\n                           (SADLY)\n                       I know for a fact that soon machines\n                       will be travelling back decades. To\n                       try and stop us from winning this war\n                       before it begins...\n          \n          Marcus takes this in for a sober moment.\n          \n                                 MARCUS\n                       You're out of your mind, aren't you?\n          \n          This earns outraged glares from the others, but Blair stifles\n          a smile. Barnes moves to strike him, Morrison stops him.\n          \n                                                                  (CONTINUED)\n          \n                                                                         56.\n          CONTINUED: (2)\n          \n                               CONNOR'S VOICE\n                     Jesus... I've seen enough. Stand\n                     by for further instructions.\n          \n          The CONNECTION goes dead.\n          \n          \n          INT.   COMMAND CENTER/CONFERENCE AREA - DAY\n          \n          Densely marked MAPS on a CONFERENCE TABLE. CONNOR is now\n          flanked by a couple of SENIOR ADVISORS, older military men--\n          along with KATE BREWSTER, late 30s, now his wife-- and\n          visibly PREGNANT. She's poring over FAXES of the X-RAY\n          IMAGES. (Like Connor, all military personnel here favor\n          casual dress, at most pins or patches to indicate rank.)\n          \n                               KATE\n                     He's not a cyborg-- no blood, no\n                     human tissue over the endoskeleton.\n          \n                               CONNOR\n                     Besides, the first T-800s won't be\n                     manufactured until `26.\n          \n                               ADVISOR #1\n                     Maybe he's a one-off, an experiment.\n          \n                               ADVISOR #2\n                     Let's hope. If there are more out there\n                     like him, we're in serious trouble.\n                     Christ, a terminator with attitude...\n          \n                               KATE\n                     Where did they find him?\n          \n                               ADVISOR #1\n                     East-central Texas, near an area of\n                     heavy Skynet concentration. The\n                     outpost where they're holding him is\n                     reasonably secure, but it's not much\n                     more than a commune.\n          \n                               CONNOR\n                     I want him extracted.\n          \n                                ADVISOR #1\n                     Done.   What then?\n          \n          CONNOR picks up the FAXES, disturbed by them.\n                                                               (CONTINUED)\n          \n                                                                          57.\n          CONTINUED:\n          \n                                 CONNOR\n                       Get him to our best people for\n                       disassembly, find out what makes him\n                       tick. We need to get into that metal\n                       skull, crack his CPU at all costs.\n          \n          THE ADVISORS nod, pick up their papers and exit. As soon as\n          they're gone, Connor sits wearily in a chair, tosses the X-\n          rays and papers onto the table, his authoritative mask\n          slipping. Kate touches his arm. He leans his head against\n          her pregnant belly.\n          \n                                 CONNOR (cont'd)\n                       Kate, why did I become leader of\n                       the Resistance?\n          \n                                 KATE\n                       Because people trust you... you\n                       give them faith--\n          \n                                 CONNOR\n                       No. Because I knew I would be, I\n                       was told. I know when and where the\n                       major battles are going to take\n                       place. I know I'm going to send my\n                       own father back through time to save\n                       my mother-- even though I haven't\n                       met him yet. Christ, I even know\n                       the year I'm going to die...\n          \n                                 KATE\n                       JOHN--\n          \n                                 CONNOR\n                       So how could I not know about this?!\n          \n          He BANGS HIS FIST on the table atop the PAPERS.\n          \n                                                              CUT TO:\n          \n          \n          INT.   OUTPOST/CORRIDOR & LAUNCH TUBE - DAY\n          \n          MARCUS is marched down the corridor to the launch tube,\n          Frankenstein-like, MORRISON holding the chains, keeping a\n          safe distance from him, while BARNES keeps the RPG trained at\n          Marcus' head.\n          \n          \n                                                              (CONTINUED)\n          \n                                                                            58.\n          CONTINUED:\n          \n          Marcus shuffles awkwardly, the bolts hampering his ankles.\n          It's reminiscent of his death walk at film's opening.\n          \n                                 MARCUS\n                       Feels like I been here before...\n                       what are you gonna do to me?\n          \n                                 MORRISON\n                       Nothing. Los Angeles is sending a\n                       chopper-- seems you're some kind of VIP.\n          \n          They reach the edge of the SILO PIT-- a long drop, smooth\n          walls, a long METAL LADDER leading down into darkness.\n          MARCUS pauses by the ladder, holds up his bolted arms\n          questioningly-- \"now what?\"\n          \n          At a look from Morrison, he and Barnes BODY-CHECK MARCUS at\n          once, sending him flying over the edge--\n          \n          MARCUS FALLS the thirty feet or so, strikes the concrete\n          FLOOR of the launch tube with a sickening THUD, the CHAINS\n          clattering down around him.\n          \n          MARCUS is stunned, barely conscious as the LADDER is PULLED\n          UPWARD. It's like the bottom of a well, twenty feet in\n          diameter, sheer concrete walls, the floor BLACKENED from a\n          rocket blast.\n          \n          ANGLE UP - his captors look down at him for a moment, then\n          move out of view.\n          \n                                                                  CUT TO:\n          \n          \n          INT.   TRANSPORT - NIGHT\n          \n          CAMERA MOVES past the PRISONERS, a couple dozen total... An\n          HISPANIC COUPLE huddle against one wall, whispering to each\n          other IN SPANISH... COW rocks in despair, head in her hands,\n          BULL and PIG mutter to each other nearby... an OLDER WOMAN\n          prays, going through rosary beads... FIND STAR and KYLE.\n          She's watching as KYLE uses his pocket knife to CARVE an\n          image in the wall of the transport. He looks up.\n          \n                                 KYLE\n                       We're stopping.\n          \n          \n          \n                                                                  (CONTINUED)\n          \n                                                                           59.\n          CONTINUED:\n          \n          The BACK PANEL rolls upward. CONTROL ROBOTS-- reminiscent of\n          the treaded T-1s but without the heavy weaponry-- flank a\n          path from the rear of the transport towards BRIGHT LIGHT up a\n          RAMP a short distance away.\n          \n          THE PRISONERS instinctively move away from the robots, moving\n          to the front of the container... until ZZZAP! BLUE ENERGY\n          crackles across the floor. THE PRISONERS CRY OUT in pain at\n          the electrified surface, and dash toward the opening at the\n          rear, leaping out of the container.\n          \n          LOW ANGLE, as the prisoners run by, we hold a moment on\n          Kyle's graffiti-- it's the STICK FIGURE IMAGES of KYLE and\n          STAR we saw before, they both hold hands with a LARGER STICK\n          FIGURE who stands between them, meant to be MARCUS.\n          \n          \n          INT.   UNDERGROUND GARAGE - NIGHT\n          \n          THE CONTAINER has stopped in a large subterranean space.\n          There are numerous FUTURISTIC VEHICLES here-- hydrogen CARS,\n          three-wheeled ATVs, electric BUSES. CONTROL `BOTS closest to\n          the container start to close in on the huddling PRISONERS.\n          \n          A ROBOT BUMPS into BULL, sending another JOLT OF ELECTRICITY\n          through his body, like a cattle prod. Everyone gets the\n          picture, starts hurrying down the line, the ROBOTS closing\n          around them.\n          \n          COW looks around nervously, clearly freaking out.   Spotting a\n          gap between the robots, she bolts--\n          \n          --a ROBOT SWIVELS and CUTS HER DOWN with an ENERGY BLAST.\n          She lies still, SMOKE rising from her body.\n          \n          The other PRISONERS pick up the pace.\n          \n                                 STAR\n                       I'm scared.\n          \n                                 KYLE\n                           (hugging her)\n                       Whatever happens, we stick together.\n          \n          The LIGHT emanates from FROSTED WINDOWS at the top of the\n          RAMP, through which we make out the SILHOUETTES of human\n          figures.\n          \n          \n                                                              (CONTINUED)\n          \n                                                                          60.\n          CONTINUED:\n          \n          GLASS DOORS part ahead of the prisoners-- a stark white,\n          sterile environment beyond. THE ROBOTS stop here. THE\n          PRISONERS disappear inside... and the DOORS CLOSE.\n          \n                                                               CUT TO:\n          \n          \n          INT.   OUTPOST/LAUNCH TUBE - NIGHT\n          \n          BARNES remains on guard duty with the RPG, propped up on some\n          cushions, a LANTERN by his side-- it's pretty late, the\n          generator's shut down. He's reading an old, yellowed COMIC\n          BOOK, he has a small stack at his side.\n          \n          MARCUS' VOICE echoes up from below, startling him.\n          \n                                  MARCUS\n                       Hello? Anyone there?\n                           (BEAT)\n                       I'm thirsty.\n          \n                                 BARNES\n                           (SNICKERING)\n                       Want some motor oil?\n          \n                                 MARCUS\n                       I need water.\n          \n                                   BARNES\n                       Bullshit.    Machines don't drink.\n          \n                                 MARCUS\n                       Please, I'm--\n          \n                                 BARNES\n                       Shut up, robot!\n          \n          BARNES returns to his reading. He reacts to FOOTSTEPS from\n          the long corridor into the living area behind him.\n          \n          BLAIR approaches with a FLASHLIGHT, her manner conciliatory.\n          \n                                 BLAIR\n                       How's it going, Barnes? Thought\n                       you might like a late-night snack.\n          \n          She pulls a crumpled plastic PACKAGE out of a pocket of her\n          flight suit-- ancient Hostess snack cakes. BARNES' eyes\n          light up as he puts the RPG aside and grabs it.\n                                                               (CONTINUED)\n          \n                                                                            61.\n          CONTINUED:\n          \n                                 BARNES\n                       Where in hell'd you get these?\n          \n                                 BLAIR\n                       We got a stash back at the base.\n          \n          BARNES tears open the package hungrily, takes a bite.       He\n          grins, but as he chews, his expression darkens.\n          \n                                 BARNES\n                       Kinda stale.\n          \n                                 BLAIR\n                       You need something to wash it down.\n          \n          From another pocket, she produces a plastic water bottle\n          filled with a murky gray liquid.\n          \n                                 BARNES\n                       I'm on duty, you know.\n          \n          So saying, he takes the bottle, unscrews the cap and takes a\n          long pull. It's powerful hootch, he gasps for air, passes\n          her the bottle as she sits beside him. She doesn't drink.\n          \n                                 BARNES (cont'd)\n                       Twinkies and moonshine. You trying\n                       to seduce me again?\n          \n                                 BLAIR\n                       You know I always liked you, Barnes.   I\n                       just didn't want to join the harem.\n          \n                                 BARNES\n                       What can I say? It's our duty to\n                       repopulate the planet.\n          \n                                 BLAIR\n                       Noble of you to make the sacrifice.\n          \n                                 BARNES\n                       C'mere.\n          \n          He pulls her close to him for a kiss. After a moment, she\n          pulls away and moves to the corridor entrance. There's a\n          large SLIDING STEEL DOOR here.\n          \n                                 BLAIR\n                       I prefer a little privacy.\n                                                                  (CONTINUED)\n          \n                                                                          62.\n          CONTINUED: (2)\n          \n          With some effort, she pulls the door CLOSED. BARNES rises\n          with a grin, undoing his shirt, coming close to her. He's\n          already unsteady on his feet.\n          \n                              BARNES\n                    You're so twentieth century...\n          \n          He puts his arms around her for a full body embrace--\n          \n                              BARNES (cont'd)\n                    Admit it, I'm the best you ever had...\n          \n          His words are slurring. He slides to the floor, slowly\n          losing his grip. He rolls onto his back with a drugged-out\n          expression of bliss on his unconscious face.\n          \n                               BLAIR\n                    Men.   You're all talk.\n          \n          IN THE BOTTOM OF THE PIT\n          \n          MARCUS leans against the wall in the dark, rolls out of the\n          way as the LADDER drops. BLAIR descends quickly, the\n          FLASHLIGHT in her belt, a battery BLADE SAW in one hand. She\n          sets the flashlight on the ground and moves to his side--\n          \n                              BLAIR (cont'd)\n                    I used up the last of my Valium for\n                    you... Hold out your arms.\n          \n          He does, she fires up the SAW, moves it carefully to the bolt\n          joining his forearms. SPARKS fly from the BUZZING BLADE as\n          it digs into the metal-- it's going to take some time.\n          \n                              MARCUS\n                    Why are you doing this?\n          \n                              BLAIR\n                    I don't believe you're a terminator.\n          \n                              MARCUS\n                    So what am I...?\n          \n                              BLAIR\n                    Whatever you are-- I owe you one.\n                    Once you're free, I'll lie down\n                    next to Barnes-- they'll assume you\n                    escaped while we were passed out--\n          \n                                                             (CONTINUED)\n          \n                                                                          63.\n          CONTINUED: (3)\n          \n                               MARCUS\n                     You think they'll buy that?\n          \n                               BLAIR\n                     Worth a shot.\n                         (looking at him)\n                     Marcus, Command wants to take you\n                     apart, cut open your head. One\n                     thing I know, you're alive-- and\n                     you've got a right to live.\n          \n          THE BUZZING SAW BLADE sound-bridges to:\n          \n          \n          EXT.   FOREST CLEARING - NIGHT\n          \n          THE WHIR OF CHOPPER BLADES. A SPOTLIGHT shines over the low\n          growth in the minefield as a BLACKHAWK HELICOPTER circles,\n          coming in for a landing. WEAPONS RACKS are jury-rigged\n          beside the spotlight, the chopper bristles with AUTOMATED\n          CANNONS, MISSILES and NAPALM TANKS.\n          \n          THE SPOTLIGHT picks out the CONCRETE and STEEL CAP of the\n          LAUNCH TUBE.\n          \n          \n          INT.   OUTPOST/LAUNCH TUBE - NIGHT\n          \n          THE SAW finishes cutting the BOLT between Marcus' legs; his\n          arms are already free. The BUZZING cuts out, but now they\n          hear the CHOPPER LANDING directly overhead.\n          \n                               BLAIR\n                     They're already here for you--\n          \n          MARCUS slides the BOLTS out of his legs, freeing himself from\n          the chains.\n          \n                               BLAIR (cont'd)\n                     Hide in the forest, then aim west\n                     for open country--\n          \n                               MARCUS\n                     I'm heading across the river.\n          \n                               BLAIR\n                     No human being can survive there--\n          \n          \n                                                            (CONTINUED)\n          \n                                                                           64.\n          CONTINUED:\n          \n                                 MARCUS\n                       I'm not human, remember?\n          \n                                 BLAIR\n                       You're gonna try and save those kids.\n          \n                                 MARCUS\n                       It's the only thing I can think of\n                       that makes any sense...\n          \n                                 BLAIR\n                       Marcus, for all you know, they're\n                       dead already--\n          \n                                 MARCUS\n                       For all I know, they're the reason\n                       I'm back from the dead.\n          \n          BLAIR studies him a moment, no changing his mind. But she\n          admires him. She starts up the ladder, MARCUS following.\n          \n          BARNES is still passed out as BLAIR and MARCUS ascend to the\n          platform around the pit. They move to the sliding door--\n          \n          BLAIR starts to open it, but sees a LIGHT and hears VOICES\n          and FOOTSTEPS at the far end, SLIDES IT SHUT again.\n          \n                                 BLAIR\n                       Damn it, we're too late--\n          \n                                 MARCUS\n                       Where's that go?\n          \n          MARCUS points to a LARGE VENTILATION FAN behind STEEL\n          GRATING, eight feet above them, on the far side of the pit.\n          It's not running, but there's no way to get through it.\n          \n                                 BLAIR\n                       Should lead out, but there's no way\n                       past the fan--\n          \n          MARCUS is already picking up the RPG-- but he points it\n          backwards, has no idea how to shoot it--\n          \n          BLAIR grins, grabs the RPG from him-- then braces herself,\n          takes aim and FIRES--\n          \n          KABOOM!   The EXPLOSION rips OPEN the GRATE, destroys the FAN.\n          \n                                                                            65.\n          \n          \n          INT.   OUTPOST/CORRIDOR - NIGHT\n          \n          MORRISON escorts a pair of powerful UNIFORMED SOLDIERS armed\n          with HIGH-TECH RIFLES with explosive shells-- they react to\n          the EXPLOSION beyond the closed door-- and break into a run,\n          the soldiers readying their weapons.\n          \n          \n          INT.   OUTPOST/LAUNCH TUBE - NIGHT\n          \n          MARCUS and BLAIR have moved around the narrow walkway to the\n          far end of the pit, beneath the SMOKING HOLE. Blair thinks\n          of something, pulls a small DEVICE from her flight suit, the\n          size of a pack of cigarettes, holds it toward Marcus.\n          \n                               BLAIR\n                     Here. My ELT-- emergency locator\n                     transmitter. If you find the camp,\n                     activate it like this. It could\n                     really help the Resistance.\n          \n          She indicates a button.     MARCUS takes the device--\n          \n          --then grabs her, KISSES HER hard on the mouth-- she's\n          startled-- it felt very human.\n          \n                                  MARCUS\n                     Thank you.\n          \n          MARCUS grabs the sharp, still smoking STEEL projecting from\n          the hole and pulls himself upward as--\n          \n          THE DOOR SLIDES OPEN and the SOLDIERS open FIRE at MARCUS--\n          \n          BLAIR hits the deck as EXPLOSIVE SHELLS tear HOLES in the\n          CONCRETE--\n          \n          --SHRAPNEL hits MARCUS in the back, he's thrown into the\n          ventilation shaft--\n          \n          \n          INT.   VENTILATION SHAFT - NIGHT\n          \n          MARCUS has a CHUNK OF REBAR lodged in his left SHOULDER, but\n          he doesn't even notice this yet. He picks himself up and\n          moves quickly in the darkness, crouching in this cramped\n          tube. There's a TURN up ahead, he just makes it as--\n          \n          An EXPLOSIVE SHELL rockets through the shaft behind him--\n                                                                  (CONTINUED)\n          \n                                                                          66.\n          CONTINUED:\n          \n          BOOM! THE BLAST TEARS through the metal tube, DIRT POURS IN,\n          blocking the tunnel from his pursuers.\n          \n          \n          EXT.   FOREST CLEARING - NIGHT\n          \n          Near the edge of the clearing, a low STEEL VENT with a peaked\n          CAP. DENTS appear in it from within--\n          \n          MARCUS finally PUNCHES his way out, pulls himself up and\n          rolls onto the dirt-- for a moment he seems safe, laying low\n          in the grass. Then--\n          \n          --he registers the REBAR in his shoulder. It goes right\n          through him, emerging from his chest. Marcus is stunned.\n          With some effort, he YANKS OUT the REBAR and tosses it aside.\n          TORN METAL of his steel endoskeleton is now exposed, along\n          with a glimpse of circuitry. Marcus reels, puts a hand over\n          the hole in his chest where a heart should be; he really\n          isn't human. He doesn't have much time to deal with this as--\n          \n          --THE CHOPPER emerges from behind the treeline, the SPOTLIGHT\n          picks him out and AUTOMATIC FIRE erupts--\n          \n          MARCUS runs a few yards and throws himself to the ground as--\n          \n          GUNFIRE STRAFES around and ahead of him-- setting off several\n          MINES which send up clouds of dirt.\n          \n          MARCUS picks himself up and runs for the trees, leaping over\n          the barbed wire.\n          \n          \n          EXT.   FOREST - NIGHT\n          \n          MORE GUNFIRE rips apart the trees around Marcus as he sprints\n          and weaves, making his way toward the river. The SPOTLIGHT\n          picks him up and loses him again-- it's tough for the chopper\n          to get a clear shot at him here.\n          \n          \n          EXT.   RIVERBANK - NIGHT\n          \n          MARCUS has reached the edge of the trees, he can see the\n          river just beyond. He starts to move for it, when--\n          \n          --FWOOM! The forest around him ERUPTS INTO FLAME, the\n          chopper has laid NAPALM along the river's edge.\n          \n                                                            (CONTINUED)\n          \n                                                                          67.\n          CONTINUED:\n          \n          MARCUS reels from the intense heat, bats out FLAMES on his\n          clothes, but his skin remains undamaged. Realizing he can\n          keep on moving--\n          \n          --MARCUS DASHES through the dense FIRE to--\n          \n          \n          EXT.   RIVER - DAWN\n          \n          --the RIVER, where the sky is just starting to LIGHTEN.\n          MARCUS SPLASHES into the shallows, extinguishing the FLAMES.\n          He fills his hands with water and sucks it down gratefully.\n          \n          ANGLE ON THE WATER - A GLIMMER of METAL below the surface,\n          heading for the source of the splashing. Suddenly--\n          \n          --the BLACKHAWK CHOPPER drops down directly in front of\n          Marcus, hovering a few feet above the water, the GUNNER\n          pointing his weapon directly at Marcus (he's one of the two\n          soldiers we saw before). The BLADE WASH swirls the water in\n          a whirlpool and beats back the FIRE behind Marcus. As the\n          GUNNER OPENS FIRE--\n          \n          --MARCUS DIVES below the surface, BULLETS ZINGING through the\n          murky water.\n          \n          UNDERWATER - MARCUS is winged by a couple of shots, his\n          thermoplastic flesh getting torn apart--\n          \n          WITH THE GUNNER - He pauses a moment, squinting into the\n          WATER for a glimpse of Marcus, but failing to register that--\n          \n          --BELOW THE CHOPPER, right beneath him, the WATER ROILS as if\n          teeming with piranha. Suddenly--\n          \n          --HYDROBOTS ERUPT from the RIVER with a hideous BUZZING\n          SOUND. Hydrobots resemble segmented serpents, eyeless, but\n          with razor-sharp heads that DRILL into their victims-- they\n          respond to sound and vibrations. About a dozen of these four-\n          foot long, glistening steel snakes shoot from the water to\n          attack the chopper.\n          \n          INSIDE THE CHOPPER - HYDROBOTS PIERCE the aluminum FLOOR, and\n          shoot into the cabin, the PILOT and the two SOLDIERS CRY OUT.\n          \n          The GUNNER tumbles out of the chopper and FALLS in the water.\n          \n          THE PILOT attempts to maintain control, but the hydraulics\n          are damaged and the steel serpents thrash about in the cabin.\n                                                            (CONTINUED)\n          \n                                                                          68.\n          CONTINUED:\n          \n          THE GUNNER surfaces, trying frantically to swim to shore.\n          But the hydrobots are upon him, he SHRIEKS and disappears\n          beneath the bubbling surface, which now boils with BLOOD.\n          \n          IN THE CHOPPER - A WHIRRING HYDROBOT penetrates the other\n          soldier's leg. He SCREAMS and wrenches the thing back out,\n          tossing it from the chopper just before--\n          \n          --THE CHOPPER CRASHES INTO THE SHALLOWS.\n          \n          THE PILOT leaps from the cabin and makes it to shore, where\n          he collapses. But the remaining, wounded SOLDIER can't get\n          out of the hip-deep water before the HYDROBOTS are upon him.\n          \n          Suddenly, HANDS BURST from the water, grabbing the soldier.\n          A second later, MARCUS SURFACES, slinging the man over his\n          shoulder. He strides to shore, as if rescuing the man from\n          enemy fire, hydrobots thrashing and bubbling at his waist.\n          \n          MARCUS reaches the amazed pilot, lays the wounded soldier\n          down beside him, then tears a whirring, writhing HYDROBOT\n          from the soldier's belly and WHIPS its head against a ROCK--\n          it SPARKS, micro-machine parts fly. The pilot and wounded\n          soldier stare at him, astonished.\n          \n                                 MARCUS\n                       Don't mention it.\n          \n          He tosses the dead robo-snake aside, then turns and moves\n          back into the water, quickly vanishing below the surface.\n          \n          UNDERWATER - MARCUS moves steadily across the silty river\n          bottom. He doesn't need air. HYDROBOTS come at him, he\n          swats them away as if they were mosquitoes, CRUSHING in his\n          hand those that linger too long. Those which make contact\n          with his artificial skin can't get far, turn and swim off.\n          \n          \n          EXT.   FAR RIVERBANK - DAY\n          \n          MARCUS emerges, the FLAMES still visible on the other side of\n          the river, behind him. He doesn't look back, as he moves\n          into Skynet turf. This side of the river isn't wooded,\n          everything has a concrete, industrial feel. Marcus is a\n          mess, both clothing and skin are shredded and charred.\n          \n          He nearly bumps into a SKELETAL STEEL TERMINATOR, which\n          emerges from behind a concrete wall. The terminator trains\n          its PLASMA RIFLE on MARCUS, scans him, RED EYES glowing...\n                                                            (CONTINUED)\n          \n                                                                         69.\n          CONTINUED:\n          \n          TERMINATOR'S POV - RED FILTER, MARCUS' FORM is TARGETED.\n          READ-OUTS on the side, the HIGHLIGHTED WORDS \"NON-ORGANIC -\n          DO NOT TERMINATE.\"\n          \n          THE TERMINATOR turns from MARCUS, no longer interested,\n          moving off on its preprogrammed patrol.\n          \n          MARCUS moves up a sloping, CONCRETE EMBANKMENT.   At the top\n          of the rise, he sees, spread out before him--\n          \n          \n          EXT.   SKYNET TERRITORY - DAY\n          \n          --a hideous industrial sprawl, OPEN GAS FLAMES, SMOKING\n          FACTORIES, rumbling VEHICLES, H-Ks, TERMINATOR TROOPS on\n          patrol. Nothing green, a GREY HAZE hangs over the landscape.\n          \n          After a moment, MARCUS shakes his head and gamely soldiers\n          on, moving along the edge of the elevated embankment.\n          \n          \n          EXT.   SKYNET PERIPHERY - DAY\n          \n          MARCUS moves past banks of ANTI-AIRCRAFT guns and MISSILE\n          LAUNCHERS, interspersed with slowly rotating RADAR TRACKING\n          DISHES-- the first line of defense. From this fortress-like\n          wall he descends into the nightmarish environment beyond.\n          \n          MARCUS reacts to a CAWING SOUND above, looks up to see--\n          \n          --A CROW perching on an overhead WIRE.   A second later--\n          \n          ZAP! A BLUE PLASMA PULSE blasts the thing to smithereens, a\n          few BLACK FEATHERS drift down as--\n          \n          --a T-400 (same mask-like face we saw earlier) lowers its\n          plasma weapon and strolls on. Target practice.\n          \n          MARCUS stays out of the way of the TERMINATOR LEGIONS\n          patrolling near the riverside.\n          \n          \n          EXT.   DEMOLITION SITE - DAY\n          \n          MARCUS heads inland, past the ruins of a CHURCH-- WALLS with\n          the remains of stained glass WINDOWS, STATUES OF SAINTS.\n          Hearing RUMBLING NOISES, Marcus hurries out of the way as--\n          \n          \n                                                             (CONTINUED)\n          \n                                                                          70.\n          CONTINUED:\n          \n          A WALL collapses, pushed down by an automated SKYNET\n          BULLDOZER. This gigantic, self-operated construction machine\n          has a swivelling CAMERA HEAD instead of a cab. Its giant\n          TREADS roll over the STONE STATUES, crushing them to dust.\n          \n          \n          EXT.   CONSTRUCTION SITE - DAY\n          \n          MARCUS keeps moving into Skynet's turf. The demolition gives\n          way to massive CONSTRUCTION, as the robots remake the human\n          world in their own image.\n          \n          CONSTRUCTION ROBOTS erect a low-slung STEEL FRAME structure,\n          automated CRANES and SUPPLY TRUCKS about. These robots are\n          oversized versions of the steel terminators we know, but with\n          multiple limbs bearing WELDING TOOLS, and TREADS instead of\n          legs. Marcus watches as BEAMS are quickly welded into place\n          by telescoping steel arms.\n          \n          \n          EXT.   SKYNET STREET - DAY\n          \n          MARCUS continues into the completed robot city. Skynet's\n          ARCHITECTURE is featureless, bland, purely practical: single-\n          story, windowless CONCRETE or STEEL structures with massive\n          open DOORWAYS to accommodate their largest machines. A RED\n          GLOW emanates from the interiors, the robots' preferred\n          lighting scheme. No sidewalks or signs, just thick GRIDS of\n          POWER LINES and PIPES overhead. Constant NOISE of BUZZING\n          POWER, RATTLING MACHINES, etc.\n          \n          MARCUS steps inside one of these buildings--\n          \n          \n          INT.   TERMINATOR FACTORY - DAY\n          \n          This TERMINATOR ASSEMBLY PLANT is an intricate, multi-leveled\n          clockwork maze of moving CONVEYORS and INDUSTRIAL ROBOTICS.\n          \n          ELECTRONICS and HYDRAULICS are ROBOTICALLY SOLDERED in place.\n          STEEL PRESSES stamp out TERMINATOR PARTS-- TORSOS, FACE\n          PLATES, SPINAL COLUMNS, LIMBS.\n          \n          Partially-completed PARTS are moved by CONVEYOR to ASSEMBLY\n          STATIONS, where LIMBS and HEADS are JOINED to TORSOS,\n          elaborate OPERATIONS carried out by INDUSTRIAL ROBOTS, like\n          the ones in present-day factories.\n          \n          \n                                                            (CONTINUED)\n          \n                                                                          71.\n          CONTINUED:\n          \n          SYNTHETIC SKIN is SPRAYED OVER a METAL ENDOSKELETON in\n          precise amounts, building up to create human features... this\n          is a T-400.\n          \n          An INDUSTRIAL ROBOT ARM picks up a CPU from a DRY-ICE\n          CONTAINER. The CPU features the distinctive, linked\n          rectangles familiar from the earlier films. The arm lifts\n          this gingerly to a TERMINATOR SKELETON and INSERTS IT into\n          the STEEL SKULL, SCREWING A SEAL over the hole.\n          \n          THE RED EYES flicker to life, and THE ARMATURE releases the\n          TERMINATOR, which moves away under its own power. It removes\n          a PLASMA WEAPON from a WALL RACK, moving past--\n          \n          --the dumbfounded MARCUS.\n          \n          THE TERMINATOR joins a dozen identical robots, who ride on a\n          treaded SKYNET TANK with a PLASMA CANNON and FLAMETHROWER.\n          There are numerous TANKS here, awaiting deployment.\n          \n          \n          EXT.   SKYNET STREET - DAY\n          \n          Rounding a corner on a straight, narrow street, MARCUS sees\n          all the ROBOTS and SMALL VEHICLES clearing into small NICHES\n          built into the walls on either side, as if clearing a path\n          for him. It takes him a moment to realize it's not him\n          they're responding to-- a RUMBLE BUILDS...\n          \n          A convoy of GIGANTIC SKYNET TRUCKS-- a half-dozen modified\n          SEMIS now driven by CPUS-- bear down on MARCUS at extremely\n          high speed. They carry construction supplies: massive STEEL\n          BEAMS, CONCRETE PIPES, etc. And there's barely inches of\n          clearance on either side.\n          \n          These things aren't slowing down. There's nowhere for Marcus\n          to duck out of the way. He has no choice but to RUN, as fast\n          as he can, the lead vehicle gaining on him rapidly.\n          \n          MARCUS THROWS HIMSELF to the concrete in the middle of the\n          street, pressing his body flat as the LEAD TRUCK passes over\n          him, the wheels missing him by inches.\n          \n          But he has only a moment's respite. THE NEXT TRUCK has a\n          lower undercarriage, a steel CROSSMEMBER catches his back--\n          \n          --and DRAGS MARCUS beneath the vehicle, ripping off chunks of\n          flesh.\n          \n                                                            (CONTINUED)\n          \n                                                                               72.\n          CONTINUED:\n          \n          Marcus CRIES OUT, crawls ahead and clings to a forward\n          portion of the undercarriage, keeping himself just above the\n          pavement. His LEFT LEG, twisted and damaged, still drags on\n          the asphalt, throwing up SPARKS.\n          \n          OVERHEAD ANGLE ON THE TRUCK - CAMERA PULLS BACK straight\n          above the MOVING VEHICLE, amidst the convoy speeding down\n          this sunken artery. CAMERA KEEPS MOVING UPWARD to reveal an\n          AERIAL VIEW of Skynet's city. Seen from above, the\n          rectilinear STRUCTURES, criss-crossing POWER LINES and\n          SPEEDING VEHICLES strongly resemble a PULSING CIRCUIT BOARD.\n          \n                                                               CUT TO:\n          \n          \n          INT.   COMMAND CENTER/CORRIDOR - DAY\n          \n          JOHN CONNOR moves grimly down a narrow, steel passageway,\n          FOOTSTEPS ECHOING. He reaches the MP, outside the door.\n          \n                                 CONNOR\n                       I need to talk to the prisoner.\n          \n          The MP looks a little surprised, but says nothing.    He undoes\n          the LATCH on the door and opens it for Connor.\n          \n          \n          INT.   COMMAND CENTER/INTERROGATION CELL - DAY\n          \n          A bare, windowless space with only a cot, a metal chair and a\n          bedpan. BLAIR looks up, bleary-eyed, exhausted and scared.\n          CONNOR gestures for the MP to close the door behind him.\n          \n                                 CONNOR\n                       Lieutenant Williams. I'm sorry\n                       about the way you've been treated,\n                       but we're forced to take every\n                       precaution. I'm John Connor.\n          \n          Blair's mighty impressed, in spite of the circumstances.       She\n          leaps to her feet, stands at attention and salutes.\n          \n                                  BLAIR\n                       Sir.\n          \n                                  CONNOR\n                       At ease.   Please, sit.\n          \n          \n                                                               (CONTINUED)\n          \n                                                                         73.\n          CONTINUED:\n          \n          CONNOR pulls up the chair, close to Blair, who sits on the\n          bed. His tone is careful, controlled.\n          \n                                  CONNOR (cont'd)\n                       I've gone over your record,\n                       lieutenant. You're a good soldier,\n                       flown a lot of missions...\n                           (BEAT)\n                       Why in God's name would you help a\n                       terminator escape?\n          \n                                 BLAIR\n                       Sir-- he isn't a terminator.     He's\n                       human.\n          \n                                  CONNOR\n                       We know he's crossed into Skynet\n                       territory, why would he do that if\n                       he isn't--\n          \n                                 BLAIR\n                       He's trying to find his friends.\n          \n                                 CONNOR\n                       What friends?\n          \n                                 BLAIR\n                       A couple of kids. They were taken\n                       in a Skynet transport, probably to\n                       some kind of prison camp-- he said\n                       their names were Star and Kyle.\n          \n          Connor blinks at this, alert.\n          \n                                    CONNOR\n                       Kyle.\n          \n          Blair picks up on his interest, but doesn't understand it.\n          \n                                 BLAIR\n                       Mm... Kyle something.    With an `R.'\n          \n                                    CONNOR\n                       Reese.\n          \n                                    BLAIR\n                       That's it.     How did you...?\n          \n          \n                                                               (CONTINUED)\n          \n                                                                          74.\n          CONTINUED: (2)\n          \n          CONNOR is already on his feet, BANGING on the door-- the MP\n          unlatches it to let him out--\n          \n          \n          INT.   COMMAND CENTER/CORRIDOR - DAY\n          \n          Partway down the hallway, CONNOR encounters KATE, who walks\n          with him, takes in his expression.\n          \n                               KATE\n                     What is it, John?\n          \n                               CONNOR\n                     I always knew I'd have to find him\n                     someday. I just didn't know how.\n          \n                                KATE\n                     What?   Find who?\n          \n                                  CONNOR\n                     My father.\n          \n                                                            CUT TO:\n          \n          \n          INT.   LABORATORY - DAY\n          \n          START CLOSE on KYLE'S HAND, clutching STAR'S tightly.   We\n          hear them SINGING faintly, together:\n          \n                               KYLE AND STAR\n                     Twinkle, twinkle, little star...\n          \n          WIDER, their heads, feet and chests are clamped onto SLIDING\n          TRAYS, a long row of these hold OTHER PRISONERS as well.\n          Kyle and Star must reach across a gap between the trays to\n          hold hands. (It's the first time we've seen her hatless.)\n          \n          The trays are all poised before panel-covered SEMI-CIRCULAR\n          OPENINGS built into the wall, in a sterile, hospital-like\n          environment. Above each opening is a MONITOR SCREEN. An\n          ominous HUM is building.\n          \n          IN AN ADJACENT OPERATING THEATER, visible through GLASS\n          WALLS, MEDICAL LASERS mounted on ROBOTIC ARMS work on\n          anesthetized patients (we needn't see the grisly details).\n          \n          BEHIND STAR and KYLE, the PANELS OPEN, the trays slowly SLIDE\n          into the OPENINGS. SCREAMS and SOBS from other prisoners.\n                                                            (CONTINUED)\n          \n                                                                            75.\n          CONTINUED:\n          \n                                 STAR\n                       Oh no, oh no...\n          \n                                 KYLE\n                       Shh, keep singing.\n          \n          Kyle and Star hold hands for as long as possible, then\n          release their grip as their bodies enter the chambers and the\n          panels slide shut.\n          \n          \n          INT.   STAR'S TESTING CHAMBER - DAY\n          \n          Immobilized in this small, tubular chamber, like an MRI, STAR\n          closes her eyes as she's bathed in BRIGHT LIGHT, LASER GRIDS\n          projecting over her skull. The HUMMING is LOUDER.\n          \n                                 STAR\n                       Up above the world so high, like a\n                       diamond in the sky...\n          \n          \n          INT.   KYLE'S TESTING CHAMBER - DAY\n          \n          The same thing is happening to Kyle.    He's no longer singing.\n          \n                                 KYLE\n                       Stop it stop it STOP IT!\n          \n                                                              CUT TO:\n          \n          \n          EXT.   SKYNET HIGHWAY - DAY\n          \n          WITH MARCUS beneath the truck. He's moved to the edge of the\n          chassis, near a WHEEL, moving slowly, carefully. There's a\n          bit more clearance at the sides of the sunken highway now,\n          but they're still moving awfully fast.\n          \n          THE WHEEL TURNS, the vehicle suddenly SLOWS to negotiate a\n          turn, braking downhill. Marcus seizes this opportunity.\n          \n          ANOTHER ANGLE as MARCUS LAUNCHES himself from below the\n          vehicle, rolling into the GAP between the convoy and the\n          concrete wall. The remaining vehicles RUMBLE PAST, as MARCUS\n          presses himself against the wall.\n          \n          \n          \n                                                              (CONTINUED)\n          \n                                                                              76.\n          CONTINUED:\n          \n          When they're gone, he gets to his feet, limping down the\n          highway on foot for a short distance, dragging his damaged\n          leg behind him. He hears ANOTHER CONVOY approaching.\n          \n          Just in time, he finds a SEAM in the poured concrete, it's\n          enough to give him purchase-- he struggles to climb up the\n          eight feet of freeway wall.\n          \n          MARCUS makes it over the top, TRUCKS RUMBLING past below.\n          This is desolate, hilly country.\n          \n          ANGLE DOWN - among the vehicles below is a CONTAINER, like\n          the one that held Kyle and Star. We glimpse the anguished\n          FACES and REACHING HANDS of CAPTIVES within.\n          \n          MARCUS reacts, moves as fast as he can alongside the trucks\n          for a short distance until--\n          \n          THE VEHICLES shoot ahead around a curve and out of sight.      In\n          the distance is a COMPLEX OF BUILDINGS, clearly the\n          destination.\n          \n          Marcus begins moving along the edge of the freeway, heading\n          for the complex. He reaches the edge of a plateau, looks\n          down, his expression changing. This is the last thing he\n          expected to see. CAMERA MOVES to reveal--\n          \n          \n          EXT.   COASTAL VALLEY - DAY\n          \n          --a panoramic view of a GORGEOUS COASTAL COMMUNITY. The\n          place is lush, green, with well-maintained, lovely HOMES in\n          the distance, a BLUE SEA beyond. The complex of buildings\n          stands a few miles away, at the far end of the valley.\n          \n          MARCUS, amazed, limps down a gentle slope leading to this\n          seeming paradise.\n          \n          \n          EXT.   GOLF COURSE - DAY\n          \n          MARCUS emerges from a small stand of trees and finds himself\n          looking at a groomed FAIRWAY. Marcus hears a NOISE nearby--\n          \n          --a GOLF BALL bouncing on the ground not far away.    MARCUS\n          turns in the direction it came from.\n          \n          \n          \n                                                               (CONTINUED)\n          \n                                                                            77.\n          CONTINUED:\n          \n          An electric GOLF CART approaches, driven by a handsome,\n          middle-aged golfer-- JEREMY-- who wears casual country club\n          attire, eating from a clear BAG OF TRAIL MIX. Jeremy comes\n          to a stop beside Marcus.\n          \n                                 JEREMY\n                       Are you all right?\n          \n          Marcus slowly shakes his head, as Jeremy climbs out of the\n          cart, looking him over carefully, taking in the exposed metal\n          at his shoulder and leg.\n          \n                                 MARCUS\n                       What the hell is this?\n          \n                                 JEREMY\n                       You look like you've been hit by a truck--\n          \n                                 MARCUS\n                       Among other things. Look, I'm\n                       trying to find some friends-- a\n                       couple of kids. They were taken\n                       here, I saw some buildings--\n          \n          JEREMY eyes him, a little surprised at his ignorance.\n          \n                                 JEREMY\n                       The facility, sure.   Hop in, I'll\n                       take you there.\n          \n          Marcus hesitates a beat, can he trust this guy? But Jeremy\n          simply seems eager to help, as he guides him to the passenger\n          seat, then gets behind the wheel. With a smile:\n          \n                                 JEREMY (cont'd)\n                       This round was gonna blow my\n                       handicap anyway. I'm Jeremy.\n          \n          He extends a hand.     After a beat, Marcus reaches toward it--\n          \n                                 MARCUS\n                       Marcus.\n          \n          Jeremy clutches Marcus' hand tightly.     Marcus blinks, Jeremy\n          cocks his head, then lets go.\n          \n          \n          \n          \n                                                               (CONTINUED)\n          \n                                                                          78.\n          CONTINUED: (2)\n          \n                               JEREMY\n                     I can't connect with you at all...\n                     your interface must've been\n                     damaged. Don't worry, soon they'll\n                     have you as good as new.\n          \n          With that, he hits the gas.\n          \n          \n          EXT.   RESIDENTIAL STREET - EVENING\n          \n          JEREMY drives the cart down the road, past well-kept homes\n          with generous lawns-- it's a beautiful, upscale community at\n          MAGIC HOUR. BICYCLISTS and FUTURISTIC CARS pass, Jeremy\n          waves to NEIGHBORS. Marcus takes it all in with disbelief.\n          \n                               MARCUS\n                     I didn't think there was-- anything\n                     like this left... anywhere.\n          \n                                JEREMY\n                     Yes.   We're very lucky.   Want some?\n          \n          He holds the plastic bag out to Marcus, who obligingly takes\n          a handful of trail mix, pops it in his mouth. After a beat,\n          he spits it back out in his hand, stares at it.\n          \n                               MARCUS\n                     This isn't food.\n          \n                               JEREMY\n                     Well, of course not. Seems you got\n                     a little memory loss going on.\n          \n          Marcus stares at him, confused. Jeremy is starting to\n          realize just how out of it he is, speaks as if to a child.\n          \n                                JEREMY (cont'd)\n                     It's a foam resin. It can taste like\n                     anything you want it to-- but of\n                     course, we don't really need to eat.\n                         (BEAT)\n                     Our brains are powered by fuel cells,\n                     remember?\n          \n          Marcus just stares, Jeremy gestures at the world around them.\n          \n          \n          \n                                                             (CONTINUED)\n          \n                                                                          79.\n          CONTINUED:\n          \n                                 JEREMY (cont'd)\n                       We're in a transitional phase.\n                       Most of us need the comfort of the\n                       familiar a little while longer--\n                       food, shelter, sex. Until we\n                       forget the old life.\n          \n          As he speaks, he notices his BAG is nearly empty. He\n          casually lifts his sport shirt and CLICKS OPEN a PANEL\n          beneath his rib cage. We glimpse CIRCUITS, FIBER-OPTICS.\n          \n                                 JEREMY (cont'd)\n                       Eating-- well, chewing-- it's one of\n                       the hardest habits to break... but\n                       before long, none of this will be\n                       necessary. We won't even need these\n                       bodies.\n          \n          From within he removes an identical BAG FILLED with TRAIL MIX\n          (the stuff he just ate), and replaces it with the empty bag.\n          He clicks the panel shut again, pops a NUT in his mouth.\n          \n          Marcus stares at this, appalled, then blinks and looks away.\n          He reacts to the sound of PIANO MUSIC, a difficult piece\n          being played expertly-- PASSING a PICTURE WINDOW, he sees a\n          PIANIST practicing.\n          \n          In front of this home, a GARDENER and WINDOW WASHER are hard\n          at work. They're both T-400s, with the eerie mask-like\n          faces. Marcus reacts.\n          \n                                 MARCUS\n                       Terminators!\n          \n          Jeremy winces, as if at a racial epithet. He's starting to\n          regret giving Marcus a lift, his manner is careful, as if\n          he'd picked up some homeless guy.\n          \n                                 JEREMY\n                       We don't call them that here.\n          \n          Marcus grabs Jeremy, who pulls back a bit, alarmed.\n          \n                                 MARCUS\n                       What are you?\n          \n                                   JEREMY\n                       A hybrid.    The same as you.\n          \n                                                              (CONTINUED)\n          \n                                                                             80.\n          CONTINUED: (2)\n          \n                               MARCUS\n                     A hybrid-- human and machine?\n          \n                               JEREMY\n                     Of course. That's what this community\n                     is for-- people like us.\n          \n                               MARCUS\n                     Jesus... why?\n          \n                               JEREMY\n                     You should be grateful to have been\n                     chosen.\n          \n                               MARCUS\n                     What about the ones who weren't?\n          \n                               JEREMY\n                     You mean like Janet and the kids.\n          \n          For a moment, Jeremy's expression darkens.     Then he shuts his\n          eyes, and his features relax.\n          \n                               MARCUS\n                     Your family. You lost them?\n          \n          Jeremy nods and SMILES, looking at him once more.\n          \n                               MARCUS (cont'd)\n                     Why are you smiling?\n          \n                               JEREMY\n                     `Cause I feel good. The interface\n                     recognizes negative emotions-- rage,\n                     grief, despair-- and stimulates\n                     positive endorphins in response. Thank\n                     God, life would be pretty unbearable\n                     otherwise, don't you think?\n          \n          \n          EXT.   PARK - DUSK\n          \n          They've left the main street now, driving down a WOODED PATH\n          leading to the \"facility.\" There are lawns, fountains, etc.\n          Marcus SLAMS ON the brakes, then clutches Jeremy by the\n          throat-- the man looks more annoyed than frightened.\n          \n          \n          \n                                                               (CONTINUED)\n          \n                                                                               81.\n          CONTINUED:\n          \n                                 MARCUS\n                       Tell me everything.   How did you\n                       people get here?\n          \n                                 JEREMY\n                       Most of us worked at NASA or DARPA.\n                       I was an engineer on Project Angel--\n          \n          Marcus drags the man from the cart by his throat, squeezing\n          harder.\n          \n                                 MARCUS\n                       Angel-- what is it?\n          \n                                 JEREMY\n                       Advanced Nexus of Genetic and\n                       Electronic Life-forms... A-N-G-E-L.\n                       You can stop choking me, it's not\n                       like I need to breathe.\n          \n          Marcus releases him, but remains in his face.       Jeremy takes a\n          moment to recover his composure.\n          \n                                 JEREMY (cont'd)\n                       We replaced the body's hydrocarbons\n                       with plastinated compounds while\n                       maintaining cellular structure--\n                       analog neural impulses were converted\n                       to wireless digital signals,\n                       controlling the micro-tech chassis--\n          \n                                  MARCUS\n                       English!\n          \n                                 JEREMY\n                           (sighs, slowly)\n                       The goal was a superior support\n                       system for the human brain-- to go\n                       anywhere, do anything-- explore\n                       deep space, the bottom of the sea.\n                       I specialized in optics.\n          \n          He taps his own eye with an audible CLICK, not flinching.\n          Marcus takes a couple steps away, looking at his own hands.\n          \n          Jeremy points to nearby BUILDINGS, a little peevish.\n          \n          \n          \n                                                                 (CONTINUED)\n          \n                                                                           82.\n          CONTINUED: (2)\n          \n                               JEREMY (cont'd)\n                     The facility is just ahead. I'll\n                     let them know you're coming.\n          \n          So saying, he's back in the cart, pulling away in a hurry.   A\n          moment later, Marcus moves off amongst the trees.\n          \n          Nearing the complex, Marcus reacts to BIRDSONG above.   He\n          looks up, stops as he sees--\n          \n          --a TINY SPEAKER, concealed amongst the LEAVES.\n          \n          MARCUS moves to this tree, touches it-- the bark feels\n          unnatural. He RAPS it with his FIST-- it sounds hollow, made\n          of FIBERGLAS. He fingers a LEAF, tries to bend it-- PLASTIC.\n          \n          He crouches, studying the GRASS. After a moment, he finds a\n          SEAM in the pristine lawn. He starts to peel it up... it's\n          ASTROTURF. Beneath it is SANDY DIRT.\n          \n          Marcus KEEPS PEELING the plastic covering back... more dirt--\n          and BITS OF BONE. As he continues to uncover the ground we\n          see recognizable CHUNKS of SKULLS, LEGBONES, etc.\n          \n          By now he's rolled back a few square yards, numb with horror.\n          Marcus moves on toward the complex with new determination,\n          trying to stay out of sight.\n          \n                                                            CUT TO:\n          \n          \n          INT.   LABORATORY - NIGHT\n          \n          ON THE MONITORS above the long row of chambers-- colorful 3-D\n          IMAGES of the prisoner's BRAINS are being constructed, like\n          PET scans. DENSE DIGITAL READ-OUTS BELOW, as data is\n          analyzed. (Levels of seratonin, endorphins, etc.) Beside\n          these are BARCODES and small INSET PHOTOS taken within the\n          chamber, the subjects looking frightened.\n          \n          IN THE OPERATING THEATER, the LASERS are still now, their\n          grisly work done for the moment, awaiting the next batch.\n          \n          An ENGINEER, a nice-looking, well-built young man in loose\n          black clothing, moves down the row of chambers, studying\n          results. He speaks into a subtle HEAD-SET:\n          \n          \n          \n                                                            (CONTINUED)\n          \n                                                                          83.\n          CONTINUED:\n          \n                                 ENGINEER\n                       32578 - acceptable. 32579 - no,\n                       insufficient neural capacity.\n                       32580 - eh, this one shouldn't have\n                       even been brought here...\n          \n          As he speaks, the BARCODES on the monitors in question turn\n          either RED or GREEN in response to his judgments.\n          \n          He reaches KYLE'S CHAMBER, we see Kyle's anguished FACE on\n          the monitor photograph.\n          \n                                 ENGINEER (cont'd)\n                       32581 looks good...\n          \n          Kyle gets a GREEN BARCODE, the engineer is on to Star, he\n          strokes his chin.\n          \n                                 ENGINEER (cont'd)\n                       32582... hm, borderline. May not\n                       be emotionally compatible. Pass.\n          \n          On STAR'S MONITOR-- RED BARCODE.\n          \n          The engineer KICKS something on the floor, bends down to pick\n          it up-- STAR'S BASEBALL CAP. He flings it expertly into--\n          \n          --a nearby TRASH RECEPTACLE.\n          \n                                                             CUT TO:\n          \n          \n          EXT.   OFFICE PARK FACILITY - NIGHT\n          \n          A series of LOW-RISE BUILDINGS, attractively LIT, surrounded\n          by lawn, trees and water features. A HUMAN TRANSPORT heads\n          down a RAMP into a parking structure; a GATE closes.\n          \n          FIND MARCUS, watching this from behind some plastic foliage.\n          He sets his jaw, removes something from his pocket, fiddles\n          with it and places it carefully in the bushes. He moves on.\n          \n          Nearing an entrance, he hears a familiar voice from nearby.\n          \n                                 SERENA\n                       Marcus!\n          \n          \n          \n                                                             (CONTINUED)\n          \n                                                                          84.\n          CONTINUED:\n          \n          A BACKLIT FIGURE approaches-- as her face enters the light,\n          we see that it's SERENA, looking healthy, beautiful. Marcus\n          stares at her coldly.\n          \n                                 SERENA (cont'd)\n                       Marcus... it is you. You're alive,\n                       you found us. Welcome to paradise.\n          \n                                 MARCUS\n                           (DISGUSTED)\n                       It's a graveyard.\n          \n          SERENA takes in his anger, adopts a regretful tone.\n          \n                                 SERENA\n                       There was no choice-- the old\n                       civilization had to be eliminated.\n                       To make way for a new world... a\n                       world without death or suffering.\n          \n          SERENA puts her arms around him. He doesn't return the\n          embrace, but he doesn't resist her.\n          \n                                 SERENA (cont'd)\n                       You were the first... I'm sorry.\n          \n          So saying, she presses a small, taser-like device at the base\n          of his skull-- ZAP! MARCUS SPASMS and goes limp in her arms.\n          SERENA lets him down gently on the ground.\n          \n                                 SERENA (cont'd)\n                       We should never have left you behind.\n          \n          A pair of T-400s now approach from the shadows. They pick up\n          Marcus and carry him toward the building. CAMERA MOVES to\n          find, hidden in the bushes where Marcus placed it--\n          \n          --the ELT, the EMERGENCY BEACON Blaire gave him... activated\n          now, a single GREEN LIGHT PULSES.\n          \n                                                                CUT TO:\n          \n          \n          INT.   SLEEPING CABIN - NIGHT\n          \n          DARKNESS, then a KNOCK and a DOOR FLIES OPEN.\n          \n          JOHN CONNOR sits up in bed.      KATE blinks beside him.\n          \n                                                                (CONTINUED)\n          \n                                                                           85.\n          CONTINUED:\n          \n                                 AIDE\n                       Sir, I'm sorry to disturb you, but you\n                       said you wanted to know immediately--\n          \n                                 CONNOR\n                       What is it?\n          \n                                 AIDE\n                       We found our terminator.\n          \n          \n          INT.   COMMAND CENTER - NIGHT\n          \n          CONNOR and KATE, hastily dressed, cross through the command\n          center we've seen before, and step through a HATCHWAY into--\n          \n          \n          INT.   SUBMARINE/BRIDGE - NIGHT\n          \n          --a MASSIVE CONTROL AREA for a HUGE SUBMARINE. SONAR and\n          RADAR stations, a CREW of NAVAL PERSONNEL, most do not wear\n          uniforms. This sub is where Connor has been the whole time.\n          \n          THE AIDE leads CONNOR to a GPS TRACKING TERMINAL, where NAVAL\n          and AIR FORCE OFFICERS hover.\n          \n                                 AIR FORCE OFFICER\n                       The signal's coming from near what used\n                       to be Galveston, right on the coast.\n          \n                                 NAVAL OFFICER\n                       There can't be any prisoners there.\n                       The whole area's a nuclear\n                       wasteland-- only machines can\n                       survive the radiation levels for\n                       any length of time.\n          \n                                  CONNOR\n                       Mobilize a combined air and naval\n                       assault, all available resources.\n                       We're sending in a rescue team ASAP.\n          \n          The OFFICERS raise AD LIB objections (\"but sir--\"). CONNOR\n          raises a hand to silence them and moves a few steps away,\n          beside KATE. They speak in hushed tones:\n          \n                                 KATE\n                       All to find one teenage boy...?\n                       John, you really think this can work?\n                                                                 (CONTINUED)\n          \n                                                                             86.\n          CONTINUED:\n          \n                                 CONNOR\n                       I'm standing here, I exist-- so it\n                       must have worked. We will find him.\n          \n          He turns back to the OTHERS, holding their gaze.\n          \n                                 CONNOR (cont'd)\n                       Call it an act of faith.\n          \n          \n          EXT.   UNDERWATER - NIGHT\n          \n          We see now that Connor's on board a NUCLEAR ATTACK SUB, with\n          TWO MORE SUBS moving in tandem behind it.\n          \n          HOLD ON the LEAD SUB and MOVE IN ON the STENCILLED NAME as it\n          PASSES CAMERA: \"LOS ANGELES SSN-688.\"\n          \n                                                              DISSOLVE TO:\n          \n          \n          INT.   REPAIR LAB - DAY\n          \n          START ON MARCUS' DAMAGED LEG. It has been DETACHED from his\n          body, halfway down the thigh. Elaborate CIRCUITS are\n          exposed, as SURGICAL MACHINES perform repairs with LASERS,\n          MECHANICAL ARMS replacing damaged parts.\n          \n          NEARBY, MARCUS opens his eyes, coming to. He's CLAMPED onto\n          an elaborate, mobile SURGICAL TABLE, the stump exposed. His\n          body and head are secured within its framework. MORE\n          MACHINES swiftly repair the damage to his chest and shoulder.\n          \n          MARCUS twitches, freaking out, struggling in his bonds--\n          \n          THE DETACHED LEG twitches as well.\n          \n                                 SERENA\n                       Calm down, Marcus.   It's all right.\n          \n          SERENA is on the other side of a GLASS PANEL, operating\n          computer controls. This is an automated surgical\n          environment, the work on Marcus carried out by various\n          MACHINES and MICROTOOLS-- busy HYDRAULIC ARMS, LASERS, etc.\n          \n                                 MARCUS\n                       Like fuck it is. I'm sick of being\n                       your guinea pig, what are you doing\n                       to me now?!\n                                                                  (CONTINUED)\n          \n                                                                            87.\n          CONTINUED:\n          \n                                 SERENA\n                       Repairing you.\n          \n                                 MARCUS\n                       You all work for Skynet!\n          \n                                 SERENA\n                       Please. Skynet works for us. It's only\n                       a program-- a tool, a means to an end.\n          \n                                 MARCUS\n                       The end of the world.\n          \n                                 SERENA\n                       Its sole purpose is to protect humanity.\n          \n          MARCUS lets out a horrified, bitter laugh.\n          \n                                 SERENA (cont'd)\n                       Listen to me. Skynet was designed to\n                       detect threats, make projections and\n                       implement solutions. As soon as it\n                       came on line, it factored in war,\n                       disease, environmental destruction--\n                       and calculated a high probability of\n                       total human extinction within two\n                       hundred years. The human race was\n                       doomed... unless we were transformed.\n          \n          THE SURGICAL TABLE swivels, bringing MARCUS into alignment\n          with the repaired leg. In moments it's reattached, the\n          plastic skin thermosealed at the joint.\n          \n                                 MARCUS\n                       Into-- this? A brain in a box?\n          \n                                 SERENA\n                       Skynet had access to the entire\n                       defense web-- including Project\n                       Angel. It determined hybrids were\n                       the only path to salvation.\n          \n                                 MARCUS\n                       Destroying the human race in order\n                       to save it.\n          \n          THE LASER TOOLS and HYDRAULIC ARMS now move on their ceiling\n          racks, coming close to MARCUS' FACE. The TABLE INVERTS,\n          exposing the back of his head.\n                                                                  (CONTINUED)\n          \n                                                                          88.\n          CONTINUED: (2)\n          \n                               MARCUS (cont'd)\n                     What are you doing?\n          \n                               SERENA\n                     When the resistance attacked our\n                     installation, we were forced to\n                     self-destruct. We would have taken\n                     you with us, but we thought you\n                     were in a permanent coma...\n          \n          THE LASERS start cutting into the back of Marcus' head,\n          BURNING through the plastic SKIN. MARCUS lets out a CRY of\n          rage, strains at his bonds.\n          \n                               SERENA (cont'd)\n                     Your interface was never installed.\n          \n          CLOSE as the HYDRAULIC ARM attaches to the back of Marcus'\n          head and removes a section of STEEL SKULL...\n          \n          REVEALING THE SURFACE of a HUMAN BRAIN, gray matter enmeshed\n          in WIRES and CIRCUITRY beneath a clear PLASTIC CASING, in a\n          bath of pale reddish LIQUID. Tiny NEURAL SPARKS fire.\n          \n                               MARCUS\n                     No, stop... I don't want it!\n                     You're dead inside, all of you!\n          \n                               SERENA\n                     We're immortal. No sane person\n                     would choose to live in pain,\n                     forever. Soon you'll understand.\n          \n          CLOSE as an elaborate ELECTRONIC INTERFACE MODULE is fixed at\n          the base of Marcus' exposed brain.\n          \n          ON MARCUS' FACE - his expression of agony vanishes, his\n          features become peaceful.\n          \n                                                           DISSOLVE TO:\n          \n          \n          EXT.   OFFICE PARK FACILITY - NIGHT\n          \n          MARCUS is dressed in fresh clothes, his damage repaired-- and\n          he seems more at ease than we've yet seen him. He walks\n          beside SERENA, who wears a small EARPIECE, a high-tech\n          cellphone device. They smile as they pass other HYBRIDS on\n          the late shift.\n                                                               (CONTINUED)\n          \n                                                                           89.\n          CONTINUED:\n          \n                                 SERENA\n                       How are you feeling, Marcus?\n          \n                                 MARCUS\n                       I'm not sure I know how to describe it.\n          \n                                 SERENA\n                       It's called happiness. You've been\n                       angry all your life. You don't\n                       know what it's like to feel... a\n                       part of something.\n          \n          She clasps his hand in both of hers. MARCUS closes his eyes,\n          a jolt of pleasure shooting through him.\n          \n          \n          SPFX MONTAGE\n          \n          FLYING POV, THROUGH BANKS OF CLOUDS, RICH COLORS in the sky,\n          glinting GOLDEN LIGHT--\n          \n          ROCKET DOWNWARD to a PRISTINE COASTLINE, some place like\n          Hawaii-- PLUNGE INTO THE WATER--\n          \n          RISE and come face to face with SERENA, SMILING... moving in\n          for a kiss... CAMERA IRISES OPEN TO WHITE...\n          \n          \n          EXT.   OFFICE PARK - NIGHT\n          \n          SERENA releases Marcus' hands. He opens his eyes slowly,\n          reeling from the intense moment. CAMERA REVEALS a subtle\n          BULGE at the base of his skull, the implanted interface.\n          \n                                 SERENA\n                       Pure ecstasy... we can share in it\n                       together.\n          \n                                 MARCUS\n                       When I was a kid my grandmother\n                       would go on about heaven... it\n                       always sounded so boring.\n          \n                                 SERENA\n                       Were you bored just now?\n          \n          Marcus shakes his head-- far from it.       Serena laughs.\n          \n          \n                                                                 (CONTINUED)\n          \n                                                                          90.\n          CONTINUED:\n          \n                                 SERENA (cont'd)\n                       That sensation is always there for\n                       you, whenever you desire. But most of\n                       us here are scientists... our greatest\n                       joy is using our minds to explore, to\n                       discover... I'll show you.\n          \n          She leads him up steps into one of the buildings.\n          \n          \n          INT.   CORRIDOR - NIGHT\n          \n          CAMERA TRACKS past GLASS WINDOWS, we glimpse ARTIFICIAL SKIN\n          growing on a steel terminator skeleton... a prototype T-800,\n          perhaps with a strong resemblance to Arnold.\n          \n          Elsewhere ENGINEERS observe a SHIMMERING COLUMN of LIQUID\n          METAL, twisting and assuming different shapes within a sealed\n          GLASS CONTAINER.\n          \n          WITH MARCUS and SERENA, moving past these observation areas.\n          \n                                 SERENA\n                       Nanotechnology, polymimetic metals...\n                       working with Skynet, we're making\n                       amazing breakthroughs, well beyond\n                       anything possible before Judgment Day.\n          \n          \n          INT.   TIME DISPLACEMENT CHAMBER - NIGHT\n          \n          START on a glowing TIME SPHERE, just a vague, translucent\n          blue ball right now, dwarfed by the MACHINERY which sustains\n          it. The sphere is set into a dome-shaped depression in the\n          floor. There's a distinctive, loud HUM.\n          \n          A PHYSICIST here at a TERMINAL.    He nods toward--\n          \n          --SERENA and MARCUS as they enter.\n          \n                                 SERENA\n                       We've already freed ourselves from\n                       biological limits... soon we'll\n                       transcend the laws of physics.\n          \n          SERENA gestures at a large DIGITAL DISPLAY of a 24-hour\n          CLOCK: the date, 10.16.18, 00:25, SECONDS FLASHING PAST.\n          \n          \n                                                                (CONTINUED)\n          \n                                                                        91.\n          CONTINUED:\n          \n                                 SERENA (cont'd)\n                       Right now, we can only go back a\n                       few days at most...\n          \n                                 MARCUS\n                       A time machine... Connor was right.\n          \n                                 SERENA\n                           (sudden interest)\n                       The Resistance leader?   You know him?\n          \n                                 MARCUS\n                       ...I've just heard him speak.\n          \n                                 SERENA\n                       He's a dangerous man. Delusional.\n                       He thinks he's a savior, but all he's\n                       really fighting for is... death.\n          \n          They move to an exit, Marcus looking back over his shoulder\n          at the glowing blue sphere.\n          \n          \n          EXT.   OFFICE PARK FACILITY - NIGHT\n          \n          MARCUS and SERENA cross the attractive campus.\n          \n                                 MARCUS\n                       In the world outside-- the\n                       survivors think Skynet is the\n                       enemy, out to destroy them. Why\n                       don't you tell them about all this?\n          \n                                 SERENA\n                       Not everyone can become like us,\n                       Marcus. We just don't have the\n                       resources to sustain more than a\n                       few thousand hybrids.\n          \n                                 MARCUS\n                       Then why... Some people I knew were\n                       picked up, taken here...\n          \n                                                                         92.\n          \n          \n          INT.   NEURAL NET CHAMBER - NIGHT\n          \n          CAMERA MOVES over TUBES and FIBER-OPTIC CABLES, which run\n          into multiple GLASS CYLINDERS filled with translucent PINK\n          LIQUID. These contain HUMAN BRAINS... there are hundreds of\n          them hooked up in here.\n          \n                               SERENA\n                     A boy and a girl-- in the last day\n                     or two?\n          \n                               MARCUS\n                     Yes... what is this place?\n          \n                               SERENA\n                     Part of the neural net-- human minds\n                     linked directly with artificial\n                     intelligence. The processing power\n                     of the human brain is still beyond\n                     anything Skynet can manufacture.\n          \n          SERENA has moved to a COMPUTER TERMINAL, one of a few here.\n          \n                               SERENA (cont'd)\n                     Display recent arrivals for processing.\n          \n          IMAGES begin to appear on the screen-- small inset PHOTOS,\n          each with a BARCODE. They quickly fill the screen. MARCUS\n          leans forward, squinting.\n          \n          ON SCREEN - dozens of FACES, PHOTOS taken inside the TUBES,\n          mostly looking terrified.\n          \n          MARCUS shakes his head.\n          \n                               SERENA (cont'd)\n                     Next page...\n          \n          ON SCREEN - a new SET OF FACES appears one by one on the\n          screen. This time, STAR and KYLE are among them, next to\n          each other.\n          \n                               MARCUS\n                     That's them.\n          \n          MARCUS touches the screen, two fingers, one on each of the\n          kid's faces. THEIR IMAGES expand to fill the screen, side by\n          side, KYLE on the left.\n          \n                                                               (CONTINUED)\n          \n                                                                              93.\n          CONTINUED:\n          \n          KYLE'S IMAGE, the date 10.16.18... the time, 22:19:23.      The\n          word, in green: PROCESSED.\n          \n          SERENA smiles.\n          \n                                 SERENA\n                       Good news. He'll soon be part of\n                       the network-- you'll be able to\n                       connect with him.\n          \n          Move to STAR'S IMAGE.       10.15.18... 22:20:49... and the word,\n          in red: TERMINATED.\n          \n                                 SERENA (cont'd)\n                       I'm sorry about the girl, Marcus.\n                       She didn't suffer.\n          \n          Marcus takes this in, his face shows pain. Then SERENA\n          grasps his hand-- in moments, he's smiling.\n          \n                                    MARCUS\n                       Of course.     I... I understand.\n          \n          Suddenly the building SHAKES, the sound of a distant\n          EXPLOSION. SERENA releases MARCUS, listens in her earpiece.\n          \n                                 MARCUS (cont'd)\n                       What is it?\n          \n                                 SERENA\n                       I don't know-- I have to go.    Will\n                       you be all right?\n                           (off his smile and nod)\n                       Of course you will.\n          \n          She touches him once more and moves off, leaving him alone\n          here. We'll hear other far off EXPLOSIONS from time to time\n          during the following. MARCUS stares at--\n          \n          HIS FRIENDS' FACES, which slowly FADE TO BLACK, replaced by\n          his own REFLECTION. Seeing his own face, his smile vanishes.\n          \n          MARCUS is going through a terrible internal struggle, the\n          interface fighting his own natural emotions. He backs away\n          from the machine, looks around at the brains, all the lives\n          destroyed.\n          \n          Hurrying past the wall of brains, he moves a hand to the base\n          of his skull... with an ANGRY CRY--\n                                                                 (CONTINUED)\n          \n                                                                          94.\n          CONTINUED: (2)\n          \n          --his FINGERS dig into the plastic skin at the back of his\n          HEAD--\n          \n          MARCUS grits his teeth, this is incredibly hard to do, but--\n          \n          --he RIPS THE INTERFACE MODULE from his skull-- CONNECTIONS\n          SPARK, we glimpse STEEL SKULL and the encased BRAIN beneath.\n          \n          MARCUS hurls the DEVICE to the floor, its elaborate CIRCUITRY\n          SHATTERS. He reels with momentary anguish at what he's just\n          given up-- then he moves out of there with determination.\n          \n          \n          EXT.   OFFICE PARK FACILITY - NIGHT\n          \n          FIRE and SMOKE in the distance, VEHICLES MOVING fast amidst\n          the destruction. It looks like the place is under attack.\n          \n          MARCUS moves purposefully across the campus-- suddenly\n          HEADLIGHTS illuminate him. He dives out of the way as--\n          \n          A FUTURISTIC ATV roars past at high speed.   It's followed\n          moments later by a massive SKYNET TANK.\n          \n          MARCUS scrambles to his feet, continues on his way.\n          \n          \n          INT.   TIME DISPLACEMENT CHAMBER - NIGHT\n          \n          THE PHYSICIST is SLAMMED against a wall. He never loses his\n          unperturbed expression as MARCUS manhandles him. THE CLOCK\n          reads 01:05.\n          \n                               MARCUS\n                     I need to go back!\n          \n                               PHYSICIST\n                     The wormholing fluctuates, right\n                     now it's oscillating between three\n                     and six hours--\n          \n                               MARCUS\n                     What do I do?\n          \n                               PHYSICIST\n                     Just breach the sphere. But you\n                     could materialize anywhere in a\n                     mile radius--\n          \n                                                             (CONTINUED)\n          \n                                                                          95.\n          CONTINUED:\n          \n          MARCUS tosses the man aside, regards the GLOWING, CRACKLING\n          TIME SPHERE-- it doesn't look too inviting.\n          \n          THE DOOR bursts open. SKELETAL TERMINATORS storm in,\n          wielding PLASMA RIFLES-- they mean business--\n          \n          THE PHYSICIST finally looks alarmed, getting in front of\n          MARCUS as he yells--\n          \n                                 PHYSICIST (cont'd)\n                       No, don't shoot in here--!\n          \n          A TERMINATOR FIRES anyway, BLOWING A HUGE HOLE through the\n          center of the Physicist's chest and throwing him backward to\n          the floor-- the man looks down and shakes his head at the\n          damage to his plastinated body.\n          \n                                 PHYSICIST (cont'd)\n                       Idiots.\n          \n          A SECOND TERMINATOR spins his weapon on--\n          \n          --MARCUS, who LEAPS into the center of the sphere just as THE\n          ROBOT FIRES and HITS nearby MACHINERY which EXPLODES--\n          \n          ENERGY ERUPTS around MARCUS, the CRACKLING BLUE LIGHT of the\n          time sphere surrounds him. We experience this from--\n          \n          --INSIDE THE SPHERE. Marcus instinctively crouches in a\n          FETAL POSITION. An instant later, his CLOTHING BURNS OFF HIS\n          FLESH. The HIGH TECH ENVIRONMENT around him TRANSFORMS into--\n          \n          \n          EXT.   PARK - DUSK\n          \n          STAY WITH MARCUS-- FOLIAGE APPEARS around the SPHERE. The\n          BLUE ENERGY fades, leaving him naked, 20 FEET IN THE AIR--\n          \n          MARCUS PLUNGES to the ground and rolls.     He looks up--\n          \n          THE PLASTIC TREE has been melted with the heat like a candle,\n          DRIPPING down around him.\n          \n          MARCUS tries to get his bearings-- he's in the park area, the\n          FACILITY not too far off. He moves in that direction.\n          \n                                                                          96.\n          \n          \n          EXT.   OFFICE PARK FACILITY - NIGHT\n          \n          THE GATE to the garage OPENS, an empty HUMAN TRANSPORT\n          emerges... FIND MARCUS, concealed, still unclothed. He dives\n          under the GATE as it rolls shut.\n          \n          \n          INT.   UNDERGROUND GARAGE - NIGHT\n          \n          MARCUS moves stealthily through the space where the prisoners\n          were off-loaded, keeping out of sight behind parked vehicles.\n          He starts at the sight of--\n          \n          THE CONTROL ROBOTS, hooked to CHARGING POSTS along one wall.\n          \n          MARCUS makes his way to the GLASS DOORS.   Using all his\n          strength, he manages to PRY THEM OPEN.\n          \n          \n          INT.   LABORATORY - NIGHT\n          \n          The ENGINEER as we saw him before, consulting the MONITORS\n          above the CHAMBERS.\n          \n                               ENGINEER\n                     32581 looks good... 32582... hm,\n                     borderline. May not be emotionally\n                     compatible. Pass.\n          \n          The engineer picks up STAR'S BASEBALL CAP and flings it into\n          the TRASH...\n          \n          Just then he hears SHATTERING GLASS behind him.   He spins--\n          \n          MARCUS trains a ripped-off ROBOTIC LASER ARM at him like a\n          weapon. The arm trails heavy CABLES and CIRCUITS, linking it\n          to the operating theater we saw earlier. (These also\n          artfully conceal Marcus' nakedness.)\n          \n                               MARCUS\n                     Let them go.\n          \n                                ENGINEER\n                     What?   Who are you?\n          \n          MARCUS takes a step closer.\n          \n                               MARCUS\n                     I said, let them go!\n                                                             (CONTINUED)\n          \n                                                                          97.\n          CONTINUED:\n          \n          THE ENGINEER moves to a RED ALARM BUTTON on a COMMUNICATION\n          PANEL mounted in the wall, extending a hand--\n          \n          MARCUS connects two wires to FIRE UP the LASER and--\n          \n          A RED BEAM neatly SEVERS the ENGINEER'S HAND at his WRIST.\n          \n          THE ENGINEER studies the metal STUMP of his severed hand with\n          a blank expression.\n          \n                                 ENGINEER\n                       You can't hurt me.\n          \n          The ENGINEER smirks and WHACKS the ALARM BUTTON with his\n          other hand. An ELECTRONIC KLAXON sounds.\n          \n                                 MARCUS\n                       Now you're pissing me off.\n          \n          MARCUS FIRES OFF THE LASER again--\n          \n          --THE ENGINEER stares at him-- we see a flaming STRIP in the\n          wall behind his head. He takes a step toward Marcus and--\n          \n          --his HEAD TUMBLES OFF, bounces on the ground, and rolls to\n          MARCUS' FEET. (There's no blood, just laser-severed\n          electronic connections).\n          \n          MARCUS picks up the ENGINEER'S HEAD by the hair.   The man's\n          brain is unharmed.\n          \n                                 MARCUS (cont'd)\n                       How'd that feel?\n          \n          THE MAN'S MOUTH twists and grimaces, making ELECTRONIC STATIC\n          from the FRIED VOICEBOX. MARCUS is taken by surprise when--\n          \n          --THE DECAPITATED BODY lunges at him, knocks the LASER from\n          his grasp. After a brief STRUGGLE, MARCUS spins the\n          engineer's HEAD to face his body. He grabs the INTERFACE at\n          the base of his neck.\n          \n                                 MARCUS (cont'd)\n                       I pull this off and you'll be in a\n                       world of pain!\n          \n          THE ENGINEER'S FACE suddenly shows fear-- his body FREEZES.\n          \n          \n                                                             (CONTINUED)\n          \n                                                                           98.\n          CONTINUED: (2)\n          \n                              MARCUS (cont'd)\n                    Last chance. Let them out.\n          \n          AT A CONTROL TERMINAL, the one-handed, headless BODY taps\n          keys and controls. MARCUS holds the Engineer's HEAD so that\n          he can see over his own shoulder. Moments later--\n          \n          --the MACHINE HUM winds down. THE MONITORS flash the word\n          \"ABORT,\" the PANELS begin to OPEN.\n          \n          MARCUS addresses the HEAD in his hand.\n          \n                              MARCUS (cont'd)\n                    I'm gonna need your clothes.\n          \n          THE HEADLESS BODY begins to unbutton its shirt.\n          \n          MOMENTS LATER - CLOSE as KYLE'S TRAY slides out of his\n          CHAMBER. The RESTRAINTS retract automatically. He sits up,\n          looking toward--\n          \n          --STAR, on the next tray.   She hasn't moved, her eyes closed.\n          \n                              KYLE\n                    No!\n          \n          He climbs off his tray, takes her in his arms.    She starts\n          awake.\n          \n                              STAR\n                    What?\n          \n          Around them, the dozen OTHER PRISONERS are getting to their\n          feet, surprised at their sudden freedom.\n          \n          MARCUS approaches KYLE, buttoning his new shirt.\n          \n                              KYLE\n                    Marcus!\n          \n          The two kids hurry to him, Marcus hands Star her BASEBALL\n          CAP, rescued from the trash. As she puts it on:\n          \n                              STAR\n                    I knew you'd come.\n          \n          THE PRISONERS are already on the move, frantically dashing\n          out of the lab ahead of our heros.\n          \n                                                              (CONTINUED)\n          \n                                                                          99.\n          CONTINUED: (3)\n          \n                               MARCUS\n                     We've gotta get out of here.\n          \n          He leads the kids out the way he came, passing...\n          \n          THE ENGINEER, in underwear, sitting in a corner, cradling his\n          head in his lap. His remaining hand strokes his interface,\n          his eyes closed in a blissful expression.\n          \n          \n          INT.   UNDERGROUND GARAGE - NIGHT\n          \n          THE PRISONERS smash the GLASS DOORS off their hinges, and\n          charge past--\n          \n          THE CONTROL ROBOTS, which are now coming to life. ELECTRIC\n          BURSTS drop a couple of slow-moving ESCAPEES as they dash\n          into the garage and make for--\n          \n          --ANY AVAILABLE VEHICLE. Former PRISONERS hijack BUSES,\n          HYDROGEN CARS. Pure chaos, it feels like a prison riot.\n          \n          MARCUS, STAR and KYLE weave amidst the robots and humans.\n          \n                                  MARCUS\n                     Stay down!\n          \n          KYLE and STAR take cover behind a concrete post just as--\n          \n          --PLASMA BURSTS explode around them.\n          \n          SKELETAL TERMINATORS armed with PLASMA RIFLES are pouring in\n          through the OPENING GARAGE GATE.\n          \n          A STOLEN BUS heads for the exit, KNOCKING a couple of\n          TERMINATORS aside and SMASHING through the rising GATE,\n          clearing a path for others to follow.\n          \n          A SKELETAL TERMINATOR sets its sights on a MOVING HYDROGEN\n          CAR, which follows the bus--\n          \n          TERMINATOR POV - RED FILTER, HIGHLIGHTING BULL, the DRIVER.\n          \"TARGET ACQUIRED - TERMINATE.\"\n          \n          THE TERMINATOR SHOOTS HIS RIFLE through the car's windshield--\n          it EXPLODES, close to KYLE and STAR, the building SHAKES.\n          \n          \n          \n                                                              (CONTINUED)\n          \n                                                                         100.\n          CONTINUED:\n          \n          KYLE and STAR flee the flames, THE TERMINATOR'S HEAD swivels\n          quickly, taking them in. It starts to pursue, but MARCUS\n          gets in front of it. Before it can fire--\n          \n                                 MARCUS (cont'd)\n                       It's OK, I'm not human!\n          \n          The Terminator pauses, looks him over.\n          \n          TERMINATOR POV - MARCUS is quickly scanned, comes up \"NON-\n          ORGANIC - DO NOT TERMINATE.\"\n          \n          THE   TERMINATOR starts to move past Marcus, who LEAPS on it\n          and   WRENCHES THE RIFLE from its grasp. As the robot spins on\n          him   he BLOWS ITS HEAD OFF, then looks around frantically for\n          the   kids. A moment later--\n          \n          --KYLE ROARS up at the controls of a futuristic ATV, STAR\n          clinging to him.\n          \n                                 MARCUS (cont'd)\n                       You can't drive!\n          \n                                   KYLE\n                       Watch me!\n          \n          No time to argue, MARCUS leaps into the back beside STAR and\n          KYLE GUNS IT out of there, careening off walls and other\n          vehicles, he's still not much of a driver. MARCUS meanwhile\n          PICKS OFF potential threats with the PLASMA RIFLE.\n          \n          \n          EXT.   OFFICE PARK FACILITY - NIGHT\n          \n          KYLE has to swerve to avoid the stolen BUS, which is now on\n          its side, IN FLAMES. It was taken out by--\n          \n          --an automated SKYNET TANK, one of THREE TANKS here. They're\n          positioned to take out escaping vehicles. But the ATV is a\n          small, maneuverable target, swerving and speeding crazily. A\n          TANK FIRES and MISSES, the BLAST taking out a chunk of wall.\n          \n          KYLE WHOOPS, heading across the campus--\n          \n          --ONE TANK pursues, it moves surprisingly fast, capable of\n          flattening anything in its path. MARCUS FIRES at it, but the\n          PLASMA RIFLE BLASTS don't have much effect on the ARMOR.\n          \n          THE TANK FIRES again, but--\n                                                             (CONTINUED)\n          \n                                                                         101.\n          CONTINUED:\n          \n          --KYLE ROARS around a corner, just in time.   However, in so\n          doing, he nearly runs over--\n          \n          --MARCUS, from earlier, on his way to the time sphere,\n          visible in the HEADLIGHTS for only an instant before he LEAPS\n          OUT OF THE WAY.\n          \n          KYLE, focused on the pursuing tank, didn't even see this.\n          But STAR did. She looks wide-eyed at MARCUS beside her.\n          \n                                 STAR\n                       That looked like--\n          \n                                  MARCUS\n                       I know.   Long story.\n          \n          PLAY THE CHASE, as the TANK pursues the ATV through the\n          facility.\n          \n          KYLE takes his vehicle through a large FOUNTAIN, which the\n          TANK SMASHES to bits.\n          \n          KYLE OVERSTEERS, putting them up on two wheels, then\n          recovers, narrowly avoiding--\n          \n          --PLASMA BLASTS, which obliterate the FACADE of a building.\n          \n          SKELETAL TERMINATORS appear in their HEADLIGHTS, weapons\n          raised.\n          \n          MARCUS stands and FIRES over KYLE'S HEAD, BLOWING them out of\n          the way.\n          \n          NEAR THE PARK, MARCUS points.\n          \n                                 MARCUS (cont'd)\n                       Take that path!\n          \n          \n          EXT.   PARK/WOODS - NIGHT\n          \n          THE TANK is gaining on them, KYLE steers around a GAZEBO, the\n          tank SMASHES right through it, turning it to splinters.\n          \n                                    MARCUS\n                       The trees!\n          \n          \n          \n                                                             (CONTINUED)\n          \n                                                                         102.\n          CONTINUED:\n          \n          Kyle steers toward THE WOODS, dodging between the thick\n          TREES. Too many obstacles for the TANK here, it SCREECHES TO\n          A HALT and lets off a JET OF FLAME.\n          \n          THE TREES behind the ATV all IGNITE, turning to acrid pools\n          of MELTING PLASTIC. KYLE barely stays ahead of the FIRE.\n          \n          THE TANK backs up and takes a new route, around the woods.\n          \n          IN THE WOODS, KYLE strikes a GLANCING BLOW against a tree\n          trunk, and the ATV TOPPLES on its side, spilling its\n          passengers. After a beat, they rise, shaken.\n          \n                                 MARCUS (cont'd)\n                       You two all right?\n          \n                                 STAR\n                           (NODDING)\n                       Why don't you drive?\n          \n                                 KYLE\n                       Come on I was doing good!\n          \n          MARCUS rights the vehicle, taking the wheel, the kids climb\n          in back.\n          \n          \n          EXT.   RESIDENTIAL STREET - NIGHT\n          \n          THE ATV comes rocketing down the main street, MARCUS driving\n          now. Suddenly, directly in front of them--\n          \n          --THE TANK APPEARS, moving swiftly around a corner, GUN\n          TURRET SWIVELING at them.\n          \n          AS IT FIRES, MARCUS SWERVES onto a LAWN and--\n          \n          --CRASHES THROUGH a PICTURE WINDOW.\n          \n          \n          INT.   LUXURY HOME - NIGHT\n          \n          A handsome HYBRID COUPLE, in pajamas in front of a BIG SCREEN\n          TV. They turn and react as the ATV skitters through the room\n          and down a hallway. The ATV is followed a moment later by--\n          \n          --THE TANK, which TAKES OUT THE ENTIRE WALL, BARRELLING\n          through the living room and BURYING the HYBRIDS in RUBBLE.\n          \n                                                            (CONTINUED)\n          \n                                                                        103.\n          CONTINUED:\n          \n          MARCUS takes the ATV UP A FLIGHT OF STAIRS.\n          \n          THE TANK keeps SMASHING through the house, as its TURRET\n          SWIVELS upward and BLASTS AWAY.\n          \n          UPSTAIRS - THE PLASMA BLAST COMES THROUGH the FLOOR, just\n          missing the ATV as it rockets through a MASTER BEDROOM,\n          toward a BALCONY.\n          \n          DOWNSTAIRS - THE TANK tears through an upscale RECREATION\n          ROOM, splintering a POOL TABLE, smashing through PINBALL\n          MACHINES.\n          \n          UPSTAIRS - MARCUS takes the ATV straight out onto the\n          BALCONY, THROUGH THE RAILING and INTO THE AIR.\n          \n          DOWNSTAIRS - THE TANK BLASTS THROUGH a KITCHEN and BATHROOM\n          on its way out the other side of the house.\n          \n          \n          EXT.   LUXURY HOME/BACK YARD - NIGHT\n          \n          THE ATV JUST CLEARS an enormous SWIMMING POOL, landing hard\n          on the far deck and moving on, fast.\n          \n          THE TANK SMASHES THROUGH THE BACK WALL and--\n          \n          --TAKES A NOSEDIVE into the pool, out of commission.\n          \n          \n          INT.   LUXURY HOME - NIGHT\n          \n          THE RUBBLE in the living room shifts and the HYBRID COUPLE\n          extract themselves, taking in their destroyed home with\n          placid expressions.\n          \n          \n          EXT.   RESIDENTIAL SIDESTREET - NIGHT\n          \n          A moment's breather. Marcus slows the vehicle, which WOBBLES\n          and SMOKES from all it's been through. He looks around.\n          \n                                 KYLE\n                       Where are we going?\n          \n                                 MARCUS\n                       There.\n          \n          \n                                                            (CONTINUED)\n          \n                                                                         104.\n          CONTINUED:\n          \n          He points toward the COAST, we see a MARINA in the distance,\n          a BOAT moored at a DOCK.\n          \n          MARCUS steers the ATV down a slope toward the shoreline.\n          \n          \n          EXT.   COASTLINE/DOCK - NIGHT/DAWN\n          \n          MARCUS, KYLE and STAR leap off the ATV and sprint for a\n          MOTORBOAT. Kyle carries the rifle now.\n          \n          As they near the boat, MARCUS reacts to the sight of--\n          \n          --RED EYES FLICKERING in the darkness at the END OF THE DOCK,\n          the BLUE GLOW of a RIFLE CHARGING.\n          \n          MARCUS leaps in front of KYLE and STAR shielding them with\n          his BODY. The PLASMA BLAST envelops him, MARCUS is blown--\n          \n          --INTO THE WATER. KYLE and STAR are flattened by the force\n          of the blast, lie motionless on the dock. Their PLASMA RIFLE\n          lies a few feet away.\n          \n          THE SKELETAL TERMINATOR who shot Marcus moves swiftly down\n          the dock, its PLASMA RIFLE trained on the water now. It\n          moves past Kyle and Star, who remain motionless on the\n          ground, and goes to the edge of the dock--\n          \n          --BLAM! STAR snatches up their own PLASMA WEAPON, and BLASTS\n          the thing in the back, knocking it INTO THE WATER, which is\n          only a few feet deep here. As it rises, SHE FIRES again,\n          taking the Terminator's head off. It goes under.\n          \n          THE SKY is beginning to LIGHTEN now as, a moment later,\n          MARCUS EMERGES. As he climbs from the shallow water back\n          onto the dock, Kyle and Star stare at him with astonishment.\n          \n          Seeing their expressions, he checks himself for damage--\n          there's METAL exposed at his shoulder, arm and hand, his FACE\n          partially TORN AWAY, ONE EYE MISSING. He tries to speak, but\n          can only manage an ELECTRONIC CROAK.\n          \n          Kyle and Star back away from him.\n          \n                                 KYLE\n                       He's not real.\n          \n          Marcus shakes his head, starts to move toward them.   STAR\n          raises the rifle, points it at him.\n                                                            (CONTINUED)\n          \n                                                                        105.\n          CONTINUED:\n          \n                                 STAR\n                       Don't come any closer!\n          \n          They hear a WHISTLING SOUND from shore, hit the deck as--\n          \n          --a MISSILE BLAST TAKES OUT THE BOAT and a large chunk of\n          DOCK.\n          \n          Laying low, they look up to see--\n          \n          --a small army of TANKS and TERMINATORS approaching... even a\n          HUNTER-KILLER moving in from the horizon, swinging its\n          SPOTLIGHT in all directions. It looks like the last stand.\n          \n          MARCUS turns back to KYLE and STAR.   His voice is a distorted\n          WHISPER.\n          \n                                    MARCUS\n                       I'm sorry.\n          \n          Star puts the rifle aside, with an apologetic expression.\n          She moves to Marcus, gingerly touches his exposed metal--\n          then hugs him tightly.\n          \n          Kyle, more stoical, looks out to sea.   His expression\n          changes, becomes almost hopeful as--\n          \n          --IN THE DISTANCE, a HUGE, BLACK SHAPE rises to the surface\n          of the water, just visible against the dawn horizon.\n          \n          FIREWORKS! MISSILES blast the H-K... NAPALM erupts around\n          the TANKS and TERMINATOR ARMY as--\n          \n          --A SQUAD OF A-10s SCREAM IN from over the land, FIRING\n          CANNONS, launching AIR-TO GROUND MISSILES to take out the\n          TANKS. ONE A-10 flies low overhead and WAGS ITS WINGS.\n          \n          \n          INT.   A-10 COCKPIT - DAWN\n          \n          BLAIR at the controls, helmeted with her face exposed, lets\n          out a VICTORY WHOOP as she looks out her canopy at the\n          huddled humans below.\n          \n          \n          EXT.   COASTLINE - DAY\n          \n          KYLE points to the dark shape on the water-- now visible as a\n          huge SUBMARINE with the RISING SUN behind it.\n                                                             (CONTINUED)\n          \n                                                                            106.\n          CONTINUED:\n          \n          HIGH ANGLE as ZODIAC BOATS reach land. HAZ-MAT SUITED\n          SOLDIERS leap out and run to our heroes at what remains of\n          the dock, others head inland to provide covering FIRE.\n          \n          MARCUS addresses a TEAM LEADER, who's taken aback at his\n          frightening appearance and distorted voice:\n          \n                                 MARCUS\n                       There are more prisoners, a complex\n                       about a mile in--\n          \n          As MARCUS gives the man a few more directions--\n          \n          --ONE HAZ-MAT FIGURE, standing a few feet off, studies Kyle\n          and approaches.\n          \n                                 HAZ-MAT MAN\n                       What's your name, son?\n          \n                                 KYLE\n                       Kyle Reese.\n          \n          The figure pulls off a glove and unzips his mask, extends a\n          hand. It's JOHN CONNOR.\n          \n                                 CONNOR\n                       John Connor. I'm glad you made it.\n          \n          KYLE is amazed to be meeting the man face-to-face. He shakes\n          hands, wide-eyed and speechless. It's a strange moment for\n          Connor, too, for different reasons.\n          \n          CONNOR turns away from his first meeting with his father to\n          be, a bit dizzy at the experience. He addresses Marcus.\n          \n                                 CONNOR (cont'd)\n                       Seems I owe you an apology.\n          \n          MARCUS smiles as best he can, given his ruined face.\n          \n                                 MARCUS\n                       Yeah, well. Get in line.\n          \n          WIDER, as CONNOR replaces his mask, moves to direct his\n          troops. MARCUS, KYLE and STAR stay close together.\n          \n                                                             DISSOLVE TO:\n          \n                                                                        107.\n          \n          \n          INT.   SUBMARINE/HATCH AREA - DAY\n          \n          Near the ENGINE ROOM, a couple dozen RESCUED PRISONERS are\n          being treated by unarmed MEDICAL PERSONNEL, others huddle\n          under blankets with food and drink. KATE is among those\n          helping the former prisoners.\n          \n          KYLE and STAR eat ravenously, he finishes one MRE and grabs\n          up another. A few feet away, MARCUS leans against a wall,\n          plasma RIFLE at his side. A DOCTOR examines him warily,\n          prodding his injured face.\n          \n                               DOCTOR\n                     Does this hurt?\n          \n                               MARCUS\n                     I don't feel a thing.    Help\n                     somebody else.\n          \n          The doctor moves on as a couple of HAZ-MAT SUITED FIGURES\n          come down the ladder from the hatch, FACE-MASKS removed.\n          Among them is CONNOR. KATE moves to his side as more dazed\n          HUMANS come down. She speaks quietly, eying KYLE nearby.\n          \n                               KATE\n                     Your dad-- he seems like a nice kid.\n          \n          Connor can't deal with that at the moment, speaks loudly.\n          \n                               CONNOR\n                     The last boatload is right behind\n                     me. Skynet's pouring in\n                     reinforcements, we can't hold this\n                     place. And the people in the\n                     houses, they won't leave--\n          \n                               MARCUS\n                     They're not people anymore...\n          \n          He trails off, reacting to the sight of--\n          \n          A FAMILIAR FIGURE descending the ladder, in a long coat, head\n          down. She looks up to make eye contact... SERENA.\n          \n                               MARCUS (cont'd)\n                     No!\n          \n          SLO-MO:   seeing Marcus, Serena reaches into her coat--\n          \n                                                             (CONTINUED)\n          \n                                                                         108.\n          CONTINUED:\n          \n          MARCUS moves at the same time, to grab his PLASMA RIFLE--\n          \n          SERENA leaps off the ladder, aiming a small, powerful PLASMA\n          WEAPON.\n          \n          SERENA fires first--\n          \n          BLAM! THE PLASMA BLAST catches MARCUS in the shoulder and\n          BLOWS his GUN ARM clean off. His PLASMA RIFLE discharges,\n          BLOWING a HOLE in the side of the sub, near the floor-- WATER\n          gushes in like a FIREHOSE.\n          \n          LEAVE SLO-MO. Spun around by the force of the blast, MARCUS\n          lands on his back, SPARKS and SEVERED CABLES protruding from\n          his damaged shoulder. An ALARM KLAXON SOUNDS.\n          \n          PRISONERS and DOCTORS SCREAM and scramble for cover--\n          \n          CONNOR steps in front of KATE to shield her, they back away\n          through the WATER BLAST, CONNOR FIRING at SERENA--\n          \n          SERENA takes numerous HITS from the EXPLOSIVE BULLETS, which\n          take off PIECES of her, but she keeps coming, FIRES again--\n          \n          --HITTING CONNOR in the lower abdomen. He's thrown backward,\n          KATE cries out and throws herself on top of him. His gun has\n          gone flying.\n          \n          SERENA turns her attention to MARCUS, standing over him,\n          plasma weapon aimed point-blank at his head.\n          \n                                 SERENA\n                       Why, Marcus? You were immortal...\n          \n          MARCUS manages a smile as he shakes his head.\n          \n                                 MARCUS\n                       No one lives forever.\n          \n          BLAM! MULTIPLE PLASMA BLASTS from behind RIDDLE SERENA'S\n          TORSO, the BLUE PULSES burning right through her-- her HEAD\n          takes a hit, the STEEL is RUPTURED.\n          \n          THE PLASMA WEAPON flies out of her arms, she COLLAPSES.\n          \n          TIGHT ON HER FACE, as she turns to see who got her--\n          \n          There's no one there.    But ON THE FLOOR lies--\n          \n                                                             (CONTINUED)\n          \n                                                                           109.\n          CONTINUED: (2)\n          \n          --MARCUS' SEVERED ARM, still holding his PLASMA RIFLE.     The\n          hand RELEASES the weapon.\n          \n          SERENA'S HEAD tilts, her eyes go blank-- she's dead.\n          \n          MEDICAL PERSONNEL are doing what they can to help CONNOR,\n          blood at his lips, KATE and KYLE at his side.\n          \n                               CONNOR\n                     This... this can't happen...\n          \n                                                           DISSOLVE TO:\n          \n          \n          UNDERWATER - DAY\n          \n          THE SUBMARINE \"LOS ANGELES\" moves TOWARD CAMERA as it slowly\n          SINKS deeper beneath the water's surface. We see a makeshift\n          STEEL PATCH welded near the hatch.\n          \n                                                           DISSOLVE TO:\n          \n          \n          INT.   SUBMARINE/CORRIDOR - DAY\n          \n          MARCUS waits outside the entrance to the SICKBAY. He's\n          cleaned up a bit, wears fresh clothes (one sleeve pinned up).\n          He seems weary, wrung out, his systems damaged. He'll move\n          stiffly through the following scene, like a stroke victim.\n          \n          STAR sits beside him, a hand on his arm.   BLAIR approaches\n          from down the corridor.\n          \n                               BLAIR\n                     Marcus... I need to head back to my\n                     unit.\n          \n          MARCUS nods, keeps his head bowed.\n          \n                               BLAIR (cont'd)\n                     What about you?\n          \n          His voice is still WEAK.\n          \n                               MARCUS\n                     I have no idea. I should be dead...\n          \n                               STAR\n                     But you're alive.\n                                                               (CONTINUED)\n          \n                                                                          110.\n          CONTINUED:\n          \n                                 MARCUS\n                           (a half-smile)\n                       So to speak.\n          \n                                 BLAIR\n                       We've been ordered not to talk\n                       about it-- the hybrids, everything\n                       about that place is top secret...\n          \n                                 MARCUS\n                       Yeah, simpler to keep it man versus\n                       machine.\n          \n          Star gingerly reaches up to touch the torn plastic at the\n          back of Marcus' head, where the interface was.\n          \n                                  STAR\n                           (BEAT)\n                       What did it feel like?   To be...\n                       one of them?\n          \n                                 MARCUS\n                           (thoughtful beat)\n                       Better than anything. Everything made\n                       sense. For the first time in my life,\n                       I felt... right. It was heaven.\n          \n                                 BLAIR\n                       How could you give that up?\n          \n          He turns to her, exposing his mangled face, one eye gone.\n          \n                                 MARCUS\n                       I never really believed in heaven.\n          \n          BLAIR takes this in, fishes in a pocket.\n          \n                                  BLAIR\n                       Here.   You need these more than I do.\n          \n          She holds out a PAIR OF SUNGLASSES.     MARCUS, a bit amused,\n          slips them on.\n          \n          THE DOOR opens nearby and an ashen-faced KATE emerges.\n          \n                                 KATE\n                       He wants to see you.\n          \n          BLAIR gives MARCUS a farewell hug.\n          \n                                                                         111.\n          \n          \n          INT.   SUBMARINE SICKBAY - DAY\n          \n          CONNOR has a PRIVATE MEDICAL AREA set aside. He's not\n          looking good-- pale, weak, only semi-conscious. I.V.s and\n          MONITORS, other LIFE-SUPPORT EQUIPMENT. KYLE is with Connor,\n          staring at a small POLAROID PHOTO in his hand. CONNOR can\n          barely speak above a whisper.\n          \n                                CONNOR\n                     Her name was Sarah... she was...\n                     amazing...\n          \n                               KYLE\n                     I don't remember my mother.\n          \n          KYLE starts to hand the photo back, CONNOR waves it away.\n          \n                                CONNOR\n                     Keep it.\n          \n          KYLE is a bit puzzled, but obediently keeps the snapshot.\n          KATE enters with MARCUS, touches the boy's shoulder.\n          \n                               KATE\n                     Kyle, could you give us a minute?\n          \n          KYLE reluctantly leaves, still looking at the photo, with a\n          nod to MARCUS on the way out. He joins STAR in the doorway,\n          they go off together.\n          \n          KATE, CONNOR and MARCUS are alone now. Throughout scene,\n          Kate fights to maintain a steely control-- but she's clearly\n          not far from tears.\n          \n                               KATE (cont'd)\n                     Marcus... you're going to need to\n                     be rebuilt. Your face, your body,\n                     your voice...\n                         (off his shrug)\n                     We have people who can do it.\n          \n          She pulls some MEDICAL DIAGRAMS out of a drawer, lays them\n          before Marcus. He examines--\n          \n          --a SCANNED IMAGE of his FACE, various elements HIGHLIGHTED.\n          \n                               KATE (cont'd)\n                     But you won't be the same...\n          \n                                                            (CONTINUED)\n          \n                                                                         112.\n          CONTINUED:\n          \n          MARCUS moves to the NEXT IMAGE-- it shows his features\n          TRANSFORMED into another's-- something closer to JOHN\n          CONNOR'S FACE, with a JAGGED SCAR over part of his features.\n          \n                                 KATE (cont'd)\n                       The scar will help hide the change.\n          \n          Marcus lowers the papers, absorbing this.\n          \n                                  MARCUS\n                       You're asking me to become...\n                            (gesturing at Connor)\n                       Him?\n          \n          Connor can barely speak above a whisper:\n          \n                                   CONNOR\n                       You must.\n          \n                                 KATE\n                           (QUIETLY)\n                       We can't keep him alive much longer.\n                           (shakes her head, swallows)\n                       Very few people know what John\n                       actually looks like. Only the\n                       technicians and our closest advisors\n                       need ever know the truth.\n          \n                                   MARCUS\n                       Why me?\n          \n                                 KATE\n                       Who else? Only you know the enemy\n                       from the inside. You liberated a\n                       Skynet camp... you're a hero.\n          \n          Connor gestures for Marcus to move closer, he speaks with\n          great effort:\n          \n                                 CONNOR\n                       I never knew how I was supposed to\n                       win this war. But I finally\n                       understand: the idea of John Connor\n                       is more important than the person.\n                           (sinks back, spent)\n                       I can die. He cannot.\n          \n          Kate leans toward Marcus, who's lost in thought.\n          \n                                                              (CONTINUED)\n          \n                                                                         113.\n          CONTINUED: (2)\n          \n                                KATE\n                     Please.   We need you.\n          \n          MARCUS bows his head for a long beat, as if seeking an answer\n          from within. Then he looks up again with resolve.\n          \n          He lifts his hand-- the SKIN TATTERED, METAL exposed at\n          finger joints-- and moves to take CONNOR'S TREMBLING HAND.\n          \n                                                             CUT TO:\n          \n          \n          EXT.   MOUNTAIN WAR - NIGHT\n          \n          SLOW-MOTION, MOS - a SNOWY, MOUNTAINOUS ENVIRONMENT...\n          \n          STEEL TERMINATORS go down in HAILS OF BULLETS.   We hear\n          Marcus' VO, his voice strong and assured:\n          \n                               MARCUS (V.O.)\n                     Yea, though I walk through the\n                     valley of the shadow of death...\n          \n          AN ARMY of HUMAN RESISTANCE FIGHTERS marches through the\n          SNOW, GUNS BLAZING.\n          \n                               MARCUS (V.O.) (cont'd)\n                     ...I shall fear no evil...\n          \n          AN H-K goes down IN FLAMES, SMASHES in the MOUNTAINSIDE.\n          \n          THE GOLDEN EXPLOSION silhouettes a single FIGURE, who stands\n          on a PROMONTORY, surveying the battle below. AIDES and\n          SOLDIERS surround him, but he towers over them, giving\n          orders, in complete control. MOVE IN SLOWLY on him.\n          \n                               MARCUS (V.O.) (cont'd)\n                     I died, and was reborn. I wear\n                     another man's face, lead another\n                     man's life... yet only now do I\n                     have a reason for living. I once\n                     was lost, but now I'm found...\n          \n          ANOTHER BLAST illuminates his face for an instant-- scarred,\n          craggy, a blend of Marcus and Connor-- but fierce, determined\n          and proud. [Perhaps shoot this with both actors.]\n          \n                               MARCUS (V.O.) (cont'd)\n                     ...was blind, but now I see.\n                                                             (CONTINUED)\n          \n                                                                       114.\n          CONTINUED:\n          \n          THE LIGHT FADES, shadowing him in darkness again and we...\n          \n                                                                   THE END\n          \n          \n \n\n\n\nTerminator Salvation\nWriters :   John Brancato  Michael Ferris\nGenres :   Action  Adventure  Sci-Fi  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:37:02.765808"}