{"title": "The Rage: Carrie 2", "film_link": "/Movie Scripts/The Rage: Carrie 2 Script.html", "script_link": "/scripts/The-Rage-Carrie-2.html", "info_raw": "\n\nThe Rage: Carrie 2 Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Rafael Moreu\nGenres  Horror  Sci-Fi  Thriller\nScript Date : February 1998\nMovie Release Date : March 1999\nSubmitted by: Vinnie\n\nRead \"The Rage: Carrie 2\" Script\n\n\n", "script": "\n\r\n\r\n\r\n \r\n                                   CARRIE II\r\n\r\n\r\n                         \r\n                                   Written by \r\n\r\n                                  Rafael Moreu\r\n\r\n\r\n                         \r\n\r\n                         \r\n                                                      13 FEBRUARY 1998\r\n                         \r\n\r\n                         \r\n          \"I wish that I could write you a melody so plain\r\n          That would save you dear lady from going insane\"\r\n          Bob Dylan, Tombstone Blues                   \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n          BLACK\r\n\r\n          MUSIC UP: Slow, sad, ethereal.\r\n          Perhaps even eerie.\r\n\r\n          FADE IN:\r\n\r\n          On a sea of red, filling the frame. A crimson ocean without\r\n          waves or ripples.\r\n\r\n          A thick housepainter's BRUSH dips in, revealing its paint.\r\n          The BRUSH is extracted, paint dripping like congealing blood.\r\n          FOLLOW THE BRUSH to reveal...\r\n\r\n          INT. A HOUSE - NIGHT\r\n\r\n          A white wall, where the BRUSH is moved horizontally, leaving\r\n          a thick continuous stripe, until the paint thins out.\r\n          A WOMAN'S HAND plunges the BRUSH back into the paint can,\r\n          then takes up creating the stripe again, painting the wall:\r\n          until it reaches &pleated drape --\r\n          -- and doesn't stop. A window and another drape receive the\r\n          same treatment before the BRUSH is re-dipped.\r\n\r\n          A PUPPY,\r\n          a sad-eyed basset hound, sits on the floor watching, a bit\r\n          perplexed. This is WALTER and even he knows this is weird.\r\n          The dog looks over to...\r\n\r\n          A FOUR-YEAR-OLD GIRL\r\n          standing next to him, also watching. This is RACHEL. Dark\r\n          haired, in a plain dress. Her large eyes are welling on the\r\n          verge of tears.\r\n\r\n          The BRUSH is dragged across the wall, hits a wooden picture\r\n          frame, moves across a cheap oil painting of a pastoral,\r\n          forest scene, and over the other edge of the frame.\r\n\r\n          Another ANGLE takes in the red line, five feet high, parallel\r\n          to the floor, extending around a modest living room.\r\n\r\n          Painting the line is BARBARA LANG, in her thirties, yet worn,\r\n          haggard- She hasn't slept in a while.\r\n\r\n          The precision of her work, her concentration, her focus, as\r\n          the line runs across a wall and into a corner, is more than a\r\n          little frightening.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         RACHEL\r\n\r\n                         Mommy\r\n\r\n          BARBARA hears nothing, says nothing, just wipes a paint drip.\r\n          This is a very careful line.\r\n\r\n                         RACHEL\r\n          Momma, come play with me. In my room.\r\n          But her mother keeps painting across a door.\r\n\r\n                         RACHEL\r\n          Right now, mommy, okay?\r\n          BARBARA looks at her, or rather through her. And continues\r\n          her task. RACHEL steps forward, tugs on her mom's\r\n\r\n                         RACHEL\r\n          I got a idea, we could--\r\n          -- and gets , , splat, right-in the face with the brush\r\n\r\n                         THE KITCHEN\r\n           A TOY AMBULANCE sits on the floor. RACHEL's tiny hand\r\n           deliberately presses a button on it. The TOY responds with a\r\n          wheep whe ep siren, then:\r\n\r\n                         AMBULANCE VOICE\r\n\r\n                         (CANNED; TINNY)\r\n          If you need help, dial nine one one.\r\n          If you need help, dial nine one one.\r\n\r\n          A WALL-MOUNTED PHONE\r\n          RACHEL's HAND struggles to reach the buttons to dial 9-1-1.\r\n          BARBARA's still painting the wall in the background.\r\n\r\n          RACHEL (O.S.)\r\n          Hello? It's my mom. She's doing\r\n          some... some wrong things. She's\r\n          doing wrong things, so, and, you\r\n          should come.\r\n\r\n          EXT. THE STREET - FROM ABOVE - NIGHT\r\n\r\n          A light rain falls on an AMBULANCE sitting next to a POLICE\r\n          Its dashing red lights\r\n          CRUISER with its doors flung open.\r\n          splash over the umbrella carrying NEIGHBORS, in pajamas and\r\n          robes, watching...\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n          TWO E.M.S. WORKERS drag a struggling BARBARA across a lawn,\r\n          her hands in plastic restraining cuffs.\r\n          A wet RACHEL stands by a kneeling POLICE OFFICER holding a\r\n          poncho over her head.\r\n\r\n                         POLICEMAN\r\n          Rachel? Rachel, are you okay?\r\n          She keeps staring off, watching her mother being stuffed into\r\n          the ambulance.\r\n\r\n                         RACHEL\r\n          Momma!\r\n          She starts towards her, but the OFFICER holds her back.\r\n\r\n                         POLICEMAN\r\n          Honey, she just has to go somewhere,\r\n          to get some rest, so she'll feel\r\n          better.\r\n          As the AMBULANCE pulls away, RACHEL catches a glimpse of her\r\n          mother in the rear windows, watching her.\r\n\r\n                         POLICEMAN\r\n          is your dad around? When's he get\r\n          home from work?\r\n          I don't have a dad.\r\n          The POLICEMAN collects himself.\r\n\r\n                         POLICEMAN\r\n          Okay. Then we're going to take you\r\n          someplace nice, with a family, a\r\n          really nice family, till we get all\r\n          this sorted out.\r\n\r\n                         (QUIETLY)\r\n          No.\r\n\r\n                         POLICMIAN\r\n\r\n                         WE'LL JUS\r\n\r\n                         RACHEL\r\n          She breaks free, races into.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          4.\r\n\r\n          INT. THE HOUSE - NIGHT\r\n\r\n          Where she runs down the entrance hall. Behind her, outside,\r\n          as the POLICEMAN runs toward the front door, it --\r\n          SLAMS by itself, right in his face.\r\n          FOLLOW RACHEL as she rushes through the living room and down\r\n          a hall. Another door slams shut behind her.\r\n\r\n                         HER ROOM\r\n          She spins, frightened by the door that closed behind her. To\r\n          her left...\r\n          A WINDOW crashes shut, startling her. Then, like a wave\r\n          moving in a circle around her, another WINDOW bangs down, a\r\n          DOOR slams shut, another WINDOW. Scared, RACHEL backs into\r\n\r\n                         A CLOSET\r\n          where she finds WALTER huddling and cradles him in her arms.\r\n          The CLOSET DOOR swings shut, sealing her off from the world.\r\n\r\n                         FROM ABOVE\r\n          In the dark, RACHEL is in a fetal position on the floor, dry\r\n          eyed, in shock, curled around her puppy.\r\n          There's the far-off sound of POUNDING on a door.\r\n\r\n                         DISSOLVE TO:\r\n\r\n          NT. A DARKENED BEDROOM - DAWN\r\n          RACHEL, now 17, is curled in bed around WALTER, also now a\r\n          far more senior dog. She's enmeshed in tangled white\r\n          Small TATTOOS come into view -- A delicate angel with broken\r\n          wings on her ankle. A small EGYPTIAN ANKH is etched on her\r\n          shoulder blade.\r\n          Wrapped around her upper arm is an elegant THORN BAND\r\n          encircling a HEART, either protecting or imprisoning it.\r\n          There's a knock on her bedroom door.\r\n\r\n          WOMAN (O.S.)\r\n          Rachel. c et up. You're gonna be late\r\n          again.\r\n          She rolls over, blinks awake. She's beautiful, with sensual\r\n          lips framed by raven black hair.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         RACHEL\r\n          joy.\r\n\r\n                         CUT TO\r\n          BLACK. A SUPER burns in:\r\n\r\n           M. O N D A Y\r\n\r\n                          FADE INTO:\r\n\r\n          A PAN AROUND RACHEL'S ROOM\r\n          the usual teenage mess, clothes strewn everywhere. A POSTER\r\n          of Jim Morrison reads: \"No One Here Gets Out Alive.\"\r\n          RACHEL stands before her dresser mirror, in a ratty bathrobe,\r\n          putting on a small nose stud. She dons her daily armor --\r\n          -- Slipping on multiple earrings.\r\n          -- Applying Kohl around her eyes.\r\n          -- Shrugging on a T-shirt with a photo of Sharon Tate\r\n          captioned \"Manson Sucks\".\r\n          -- Disheveling her long black hair.\r\n          Scooping up WALTER, she kisses him, takes him to an open\r\n          ground floor window.\r\n          Sorry, Walt.\r\n          And gently lowers him outside.\r\n\r\n          EXT. A HOUSE - MORNING\r\n\r\n          It's not the home RACHEL lived in with BARBARA. This one is\r\n          run down and in the section of town where people have cars in\r\n          their yards they've abandoned tinkering with. The lawn is\r\n          overgrown, there's broken glass on the street.\r\n\r\n          INT. KITCHEN - MORNING\r\n\r\n          The crammed eat-in-kitchen of the WALLACE house. EMILYN,\r\n          40's, is ironing a waitress uniform on the counter. A groggy\r\n          BOYD, 40's, enters, he's a trucker and looks like one. He\r\n          goes straight for the refrigerator.\r\n          BOYD and his wife EMILYN have taken in RACHEL as a foster kid\r\n          to augment their income.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          6.\r\n           RACHEL is alone at a formica table, eating cereal. BOYD\r\n          looks at his ..rife.\r\n\r\n                         BOYD\r\n\r\n                         (YAWNS)\r\n          Working tonight?\r\n\r\n                         EMILYN\r\n          Graveyard shift, again.\r\n\r\n                         (TO RACHEL)\r\n          Was the dog in the house last night?\r\n          He's allowed in the morning.\r\n\r\n                         BOYD\r\n          (head in refrigerator)\r\n          Daytime, yes; nighttime, no. We've\r\n          been over this ground.\r\n          I only brought him in this morning.\r\n          No juice?\r\n\r\n                         EMILYN\r\n          We're out of a lot of things.\r\n\r\n                         (TO RACHEL)\r\n          I heard dog noises last night.\r\n          When I was trying to sleep.\r\n\r\n                         (LOUDER)\r\n          Walter was not in the house last\r\n          night.\r\n\r\n                         BOYD\r\n          (shoots Rachel a look)\r\n          You watch that voice in this house.\r\n          While you're here, you'll respect her\r\n          as your mother, and treat her as such.\r\n\r\n                         RACHEL\r\n          (lowers her eyes, mumbles)\r\n          Sorry.\r\n          She picks through her cold cereal in silence.\r\n\r\n                         EMILYN\r\n          Your mom's making progress isn't she,\r\n          on the new medicacions, the\r\n          tricyclics?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          7.\r\n\r\n                         RACHEL\r\n          Yes, ma'am.\r\n\r\n                         (BEAT)\r\n          May I be excused?\r\n          Without waiting for a reply, she stands and gathers the bowl.\r\n          (casually, a routine)\r\n          And you should take that thing outta\r\n          your nose. Don't you have enough\r\n          holes in your head?\r\n          As she turns away, RACHEL makes a face, but replies.\r\n\r\n                         RACHEL\r\n          Yes, sir.\r\n\r\n          EXT. HOUSE - MORNING\r\n\r\n          RACHEL stands outside, clad in a long dark overcoat, with a\r\n          black backpack. WALTER sits next to her, behind a fence.\r\n          A YELLOW SCHOOL BUS pulls up.\r\n\r\n                         RACHEL\r\n          Later, Walt.\r\n          On WALTER, bummed.\r\n\r\n          WITHIN THE SCHOOL BUS\r\n          A gaggle of young KIDS in faded denims and pastels. RACHEL\r\n          moves to the back, sits with LISA PARKER, who could be her\r\n          younger sister, also dressed Goth, black lace and metal.\r\n          LISA has a HEART-THORN TATTOO around her arm, like RACHEL's.\r\n\r\n                         LISA\r\n\r\n                         (SMILES)\r\n          Well, hullo.\r\n\r\n                         RACHEL\r\n          She speaks. She opens her mouth\r\n          and sounds come out. The sounds\r\n          are words.\r\n          LTA gives her a Cheshire cat grin.\r\n\r\n                         LISA\r\n          What's wrong, fcscer-dad bein' a\r\n          pain again?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          8.\r\n\r\n                         RACHEL\r\n          Why are you so weiz.ly happy?\r\n\r\n                         LISA\r\n          o I look any different?\r\n\r\n                         RACHEL\r\n          Do you look any...\r\n\r\n                         (GETTING IT)\r\n          Oh, my gawd. You did it.\r\n\r\n                         LISA\r\n          Yep.\r\n          With who?\r\n\r\n                         LISA\r\n          You'd never believe me if I told you.\r\n          I'm bringing him to lunch.\r\n\r\n                         RACHEL\r\n          C'mon. ' 1 Fess up.\r\n\r\n                         LISA\r\n          All will be revealed in due time.\r\n          RACHEL pulls out a worn Anne Rice paperback from her ba\r\n          gives it to LISA.\r\n\r\n                         RACHEL\r\n          You suck.\r\n\r\n                         LISA\r\n          I love you too.\r\n          Simultaneously, they bite their thumbs, then press them\r\n          together; a pantomime of blood sisters.\r\n\r\n                         LISA / RACHEL\r\n          Best Blood. / Best Blood.\r\n          ARNIE, a skinny, pimply stoner, plops into the seat behind\r\n          them, sticks his head on their seatback, smiles full braces.\r\n\r\n                         ARNIE\r\n          Hi there gruesome twosome, how 'bout\r\n          a threesome?\r\n\r\n                         LISA\r\n          (ignoring him, to Rachel)\r\n          Lunch. Meet me in the parking lot.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          9.\r\n\r\n          EXT. BERGEN HIGH SCHOOL - MORNING\r\n\r\n          A modern, windowless school, shrouded in mist. It's\r\n          beautiful in an eerie \"Fall of the House of Usher\" way.\r\n\r\n          E SCHOOL ENTRANCE - MORNING\r\n          Hung over the concrete entrance is a large bedsheet BANNER\r\n          with oversized red lettering:\r\n\r\n          CRUSH CARLIN FRIDAY!\r\n          The school mascot, a scrappy BULLDOG wearing a CROWN tilted\r\n          at a rakish angle, is also drawn on the banner.\r\n          FADE IN -- KNOTS of STUDENTS, like spectral figures.\r\n          The two major school cliques are...\r\n          on the front steps. Land of burnouts, step-kids, Metalheat s\r\n          skateboard junkiei-and other lost souls.\r\n          A STONER KID kicks his skateboard up and catches it. HIS\r\n          BUDDY follows suit and misses, suffering the embarrassment of\r\n          watching his board shoot down the steps whose metal rail\r\n          separates Freak Hall and..,\r\n\r\n                         THE PATIO\r\n          a courtyard with concrete tables where the school's royalty\r\n          hold court. The cleancut \"Patio People\" are the jocks,\r\n          student government types and others who have no idea what it\r\n          is to be alone on a Saturday night.\r\n          At the patio is a pack of muscular jocks in football letter\r\n          jackets reading \"Bulldogs\", some sport caps marked \"Dawgs:\r\n          There's JESSE RYAN, handsome, longish hair, a young Eddie\r\n          Vedor if Eddie ever played football. Next to him is...\r\n          MARK BING, good looking, with a body like a fist.\r\n          Behind them, arrayed around a concrete table are the large,\r\n          doltish BRAD, hearty rich boy CHUCK, and the arrogant ERIC.\r\n          CHUCKS looks over a plain looking GIRL on the Patio.\r\n\r\n                         CHUCK\r\n          (aside, low)\r\n          Hey, Mark, the girl over there,\r\n          how many if I do her?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          10.\r\n          Six.\r\n\r\n                         BRAD\r\n\r\n                         (MIFFED)\r\n          Hold it. I did her last week,\r\n          I only got five.\r\n\r\n                         MARK\r\n          She was having a bad hairday.\r\n          A group of PATIO GIRLS sit at another table. Among them is\r\n          MONICA, a stunning brunette, AMY a cute redhead and TRACY, an\r\n          icy BLONDE who could spend all day checking her makeup.\r\n          JESSE looks over. TRACY graces him with a smile and turns\r\n          away. MARK leans in to JESSE.\r\n\r\n                         MARK\r\n          Hey, Jess. Tracy, she wants you, man.\r\n          Jump her bones.\r\n\r\n                         I JESSE\r\n          Yeah, whatever.\r\n\r\n                         CHUCK\r\n          What's the matter with you, she's got\r\n          an ass stamped \"Made in Heaven\r\n\r\n                         JESSE\r\n          I don't know, you ever have a\r\n          conversation with her? It's like\r\n          talking down a well. She only wants\r\n          me cause I'm on the football team.\r\n\r\n                         MARK\r\n          So what? You want her to want you\r\n          cause of your dazzling personality?\r\n          Look, you want someone to talk to,\r\n          you got us. H, you screw.\r\n\r\n          THE SCHOOL BUS\r\n          RACHEL and LISA hop off and walk past the Patio. CHUCK\r\n          watches LISA pass.\r\n\r\n                         CHUCK\r\n\r\n                         (ASIDE)\r\n          Woof- Coyote date.\r\n\r\n                         JESSE\r\n          That's harsh, man, keep it down.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         11\r\n\r\n                         ERIC\r\n          What's a coyote date?\r\n\r\n                         MARK\r\n          When you wake up in the morning, and\r\n          she's sleeping on your arm, and the\r\n          only way to get up is to wake her.\r\n          So you gnaw your arm off instead.\r\n          BRAD snorts a laugh.\r\n          A goatee'd ENGLISH TEACHER nods to both camps as he passes.\r\n\r\n                         ENGLISH TEACHER\r\n          Hello Montagues, hello Capulets.\r\n          A BELL goes off and the STUDENTS start filing into school.\r\n          LISA waves the tips of her fingers to RACHEL, bye-bye.\r\n          RACHEL looks over, catches a glimpse of JESSE, across the\r\n          line of demarcation. For a piece of a second it seems as if\r\n          he's looking back. She drops her head, walks away.\r\n\r\n          INT. ENGLISH CLASS - DAY\r\n\r\n          The ENGLISH TEACHER strolls among the student's desk. RACHEL\r\n          is in social Siberia, sitting in the back.\r\n\r\n                         ENGLISH TEACHER\r\n          Okay, then how many saw the movie?\r\n          A show of hands, all the girls, some of the boys.\r\n\r\n                         ENGLISH TEACHER\r\n          Now, how many read the play?\r\n\r\n                         AS ASSIGN\r\n          A few tentative hands, including JESSE.\r\n\r\n                         ENGLISH TEACHER\r\n          I thank you for your honesty, but I am\r\n          saddened. I'd like to think we're\r\n          here to study William Shakespeare, not\r\n          worship at the altar of Leo DiCaprio.\r\n          Scattered laughs.\r\n\r\n                         ENGLISH TEACHER\r\n          I was going to calk about the\r\n          language. But since you haven't Z&&d\r\n          the language, let's talk about the\r\n          plot.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          12.\r\n          Sighs of relief\r\n\r\n                         ENGLISH TEACHER\r\n          Romeo and Juliet, a tale of two lovers\r\n          meant for each other, pulled apart by\r\n          their families, society, and, some\r\n          might say, by fate.\r\n\r\n                         (BEAT)\r\n          Why is it that we are so moved by love\r\n          stories that end with separation?\r\n          The STUDENT' s faces are blank.\r\n\r\n                         ENGLISH TEACHER\r\n          What are some other stories with this\r\n          theme?\r\n\r\n                         (NO RESPONSES)\r\n          How about, Dr. Zhivago? Casablanca?\r\n          Still blank. AMY timidly raises her hand.\r\n\r\n                         AMY\r\n          You meair like in Dumb and\r\n          when the girl's husband showed up?\r\n          The TEACHER surrenders to the inevitable.\r\n\r\n                         ENGLISH TEACHER\r\n          Okay, well. Perhaps at some level\r\n          we know that Lauren Holly's husband\r\n          AIM to show up? What say? Anyone?\r\n\r\n                         (BEAT)\r\n          Rachel?\r\n          I don't know that I believe in it.\r\n\r\n                         ENGLISH TEACHER\r\n          Believe in what?\r\n\r\n                         RACHEL\r\n          Love.\r\n          JESSE looks at her, pensive.\r\n\r\n                         ENGLISH TEACHER\r\n\r\n                         (SYMPATHETIC)\r\n          Well, then you've got bigger problems\r\n          than passing this crass.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          13.\r\n\r\n                         ARNIE\r\n          (raises his hand)\r\n          Love is fifteen seconds of squishing\r\n          noises. Unquote. Johnny Rotten.\r\n          Scattered laughs. JESSE overhears TRACY as she nods at\r\n          RACHEL, whispers to AMY...\r\n\r\n                         TRACY\r\n          Who would love her?\r\n\r\n                         ENGLISH TEACHER\r\n          Do you think that all love stories are\r\n          tragedies? I mean, unless they die at\r\n          the same time, all lovers are\r\n          eventually separated by death.\r\n\r\n                         JESSE\r\n          Well, then Romeo and Juliet isn't a\r\n          tragedy, because the only way they\r\n          could really be together was in death.\r\n\r\n                         ENGLISH TEACHER\r\n          Very good.\r\n          (nods at Rachel)\r\n          A foul cynic, most cliche.\r\n          (turns to Jesse)\r\n          A true romantic, how refreshing.\r\n          Kids scoff at JESSE, but RACHEL eyes JESSE, struck by this\r\n          side of him.\r\n          The BELL rings and ARNIE leads the exodus.\r\n\r\n                         ARNIE\r\n          Food!\r\n\r\n                         ENGLISH TEACHER\r\n          Next assignment, Brave New World, the\r\n          book, not the TV movie.\r\n\r\n          INT, HIGH SCHOOL HALLWAY - DAY\r\n          A stone-faced LISA folds a NOTE, places it within her hallway\r\n          locker, jammed to the brim with books; a photo of Fiona Apple\r\n          and a Nine Inch Nails sticker are plastered on its door.\r\n\r\n          EXT. ICE SCHOOL. THE REAR PARKING LOT - LUNCHTIME\r\n\r\n          STUDENTS pour out the doors, some heading to a row of outside\r\n          lockers. RACHEL appears, searching for LISA.\r\n\r\n                         BACK TO:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          14.\r\n\r\n          THE SCHOOL HALLWAY\r\n          LISA walks as if moving through extremely dense air, hugging\r\n          the wall as STUDENTS pass without acknowledging her.\r\n\r\n                         HACK TO:\r\n\r\n          THE PARKING LOT\r\n          RACHEL looks around the students, sees a GIRL's HEAD from\r\n          behind, realizes it isn't LISA.\r\n\r\n                         BACK TO:\r\n\r\n                         A STAIRWELL\r\n          LISA ascends several flights, still brushing the wall,\r\n          exiting onto the...\r\n\r\n                         SCHOOL'S ROOF\r\n          She walks past a TRIO OF STUDENTS smoking near the roof's\r\n          edge. Without slowing or blinking an eyelash LISA simply..\r\n\r\n          DROPS OUT OF FRAME.\r\n          A GIRL turns in the direction of LISA's disappearance.\r\n\r\n                         SMOKING GIRL\r\n          Did you see that?\r\n\r\n          SHOCK CUT TO:\r\n\r\n          WITHIN A PARKED CAR\r\n          LISA'S FACE smashes into the windshield which cracks in a\r\n          spider web pattern. Blood fills the web. The sound of a\r\n          droplet hitting car vinyl, then drops SPLATTER RED on our\r\n\r\n          P.Q.V.\r\n\r\n          EXT. THE SCHOOL PARKING LOT - DAY\r\n\r\n          Standing in the lot is RACHEL. She stares in horror at --\r\n          LISA sprawled on the dented hood of a parked car, her head a\r\n          bloody mass nestled in the shattered windshield.\r\n          -- and RACHEL opens her mouth, but the SCREAM BOTTLED inside\r\n          catches in her throat, which causes --\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          15.\r\n\r\n          A ROW OF OUTDOOR LOCKERS\r\n          to \"ULQ open, behind her, like dominoes, banging in a wave\r\n          away from her, startling KIDS near them.\r\n\r\n          INT. SCHOOL - DAY\r\n\r\n          BANG as a door marked \"GUIDANCE COUNSELOR\" swings open and..\r\n          SUE SNELL whips around in her seat, late 30's, but with the\r\n          eyes of someone who's been to hell and back. A YOUNG GIRL is\r\n          seated before her for counseling.\r\n          in her doorway is the SCHOOL PRINCIPAL, chaos in the hall\r\n          behind him.\r\n\r\n                         PRINCIPAL\r\n          You'd better come with me, a girl just\r\n          killed herself in the lot.\r\n\r\n          EXT. SCHOOL PARKING LOT - DAY.\r\n\r\n          More chaos. KIDS'rush in to see, others move away.\r\n          Next to the car with LISA's body is RACHEL. Slowly,\r\n          tentatively, without knowing what she's doing, RACHEL runs\r\n          her hand along the car's hood, coating her thumb with blood.\r\n\r\n                         RACHEL\r\n\r\n                         (TO HERSELF)\r\n          Best blood.\r\n          SUE pushes her way through the crowd, sees a stunned RACHEL,\r\n          puts an arm around her shoulder.\r\n\r\n                         SUE\r\n          Corns. Come with me. Let's back off.\r\n          One step. Good. Let's back away.\r\n          PULL BACK to see the widening circles of shock as the\r\n          students of Bergen High realize what's just occurred.\r\n\r\n          INT. GUIDANCE OFFICE - DAY\r\n\r\n          A SNOW DOME with a forest scene. RACHEL is in a chair, her\r\n          face an ashen mask, staring at the dome on the desk. SUE\r\n          offers a glass of water, RACHEL doesn't take it. SUE leans\r\n          on the desk's edge.\r\n\r\n                         SUE\r\n          (low, intimace)\r\n          Was she a friend? This is a place\r\n          where you can calk about it.\r\n\r\n                         (MORE)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          16.\r\n\r\n                         SUE (CONC'D)\r\n\r\n                         (NO RESPONSE)\r\n          Or not. But if you need to, I'm\r\n          always here.\r\n          SUE takes RACHEL's hand. RACHEL looks up at her, eyes\r\n          welling. Bur she doesn't cry.\r\n\r\n                         SUE\r\n          It's okay. Let it out.\r\n\r\n                         RACHEL\r\n          (shakes her head)\r\n          I never cry. Miss Snell? She was so\r\n          happy this morning. I don't\r\n          understand. Why would she--\r\n          The INTERCOM BOX squawks:\r\n\r\n          WOMAN (V.0.)\r\n          Ms. Snell, would you please come to\r\n          the principal's office? Ms. Snell,\r\n          please come to the principal's office.\r\n\r\n                         - SUE\r\n          You stay here as long as you need to.\r\n          RACHEL nods. SUE moves to the door and exits.\r\n          Leaving RACHEL alone, looking all of five years old.\r\n\r\n          INT. PRINCIPAL'S OFFICE - DAY\r\n\r\n          A medium-sized office, standing room only. The PRINCIPAL\r\n          addresses SUE and his STAFF as he hands out sheets of paper.\r\n\r\n                         PRINCIPAL\r\n          The board of education has given us\r\n          these procedures to follow. I want\r\n          every teacher to read this aloud in\r\n          their classrooms in ten minutes.\r\n          Do not digress or become overly\r\n          emotional or dramatic.\r\n          His VOICE under...\r\n\r\n          EXT. THE SCHOOL ENTRANCE - DAY\r\n\r\n          A door BANGS open as RACHEL runs out and down the steps.\r\n\r\n          PRINCIPAL (V_O.)\r\n          Then I'll ask you to identify any\r\n          students who may have been Lisa\r\n          Parker's close friends and therefore\r\n          may require additional counseling.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          17.\r\n\r\n          PRINCIPAL'S OFFICE - DAY\r\n          He scans the faces of his troops.\r\n\r\n                         PRINCIPAL\r\n          No memorials. No assembly. We want a\r\n          return to the normal life of the\r\n          school. what do we not want?\r\n\r\n                         (PAUSE)\r\n          Copycats. Everybody got it?\r\n          Nods all around.\r\n\r\n                         PRINCI PAL\r\n          Then let's go with the drill.\r\n          A TEACHER reads from the prepared statement to her class.\r\n\r\n                         TEACHER\r\n          One of our students died today.\r\n          -- A FOREST -- Glimpses of RACHEL running through the trees.\r\n          -- SUE at a microphone, reading from a sheet of paper:\r\n\r\n                         SUE\r\n          We will observe, at exactly two\r\n          p.m...\r\n          -- Her voice emanates from an INTERCOM BOX high on a\r\n          classroom wall. STUDENTS bow their heads.\r\n\r\n          SUE (V.O.)\r\n          .a moment of silence.\r\n\r\n          EXT. FOREST - DAY\r\n\r\n          th RACHEL -- running, branches tearing at her clothes.\r\n\r\n          SUE (V.3.)\r\n          Lisa Parker may be gone, but she will\r\n          not be forgotten by her friends.\r\n\r\n          INT. CLASSROOM - DAY\r\n\r\n          ERIC surreptitiously passes MARK something under a desk, a\r\n          large pocket NOTEBOOK.\r\n          A GIRL picks her nose. A 3CY yawns. Another BOY absently\r\n          fiddles with his crucifix as he reads a comic book.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          18.\r\n          A GIRL and a BOY whisper to each other, then stifle a laugh.\r\n\r\n          SUE {V.0.)\r\n          She will not be forgotten, by her\r\n          fellow students, her teachers, and\r\n          her school.\r\n\r\n          EXT. THE FOREST - DAY\r\n\r\n          RACHEL sits on rock in a clearing, observing her own moment\r\n          of silence.\r\n          She looks at her hand. It's trembling and still covered with\r\n          LISA's BLOOD.\r\n\r\n          EXT. ARI{HAM STATE MENTAL HOSPITAL - DAY\r\n\r\n          th a sign identifying it as such. A fenced-in complex of\r\n          spooky Victorian and Queen Anne buildings.\r\n\r\n          EXT. A BUS - DAY\r\n\r\n          CHEL sits, removing her nose stud and earrings as the bus\r\n          approaches the hospital.\r\n\r\n          INT. HOSPITAL BATHROOM - DAY\r\n\r\n          RACHEL is washing off her makeup, which runs black into the\r\n          institutional porcelain sink.\r\n          She changes into a white cotton shirt.\r\n\r\n          INT. STATE HOSPITAL, VISITING AREA - DAY\r\n\r\n          The dilapidated room is a statue garden of catatonics and\r\n          depressives seated on vinyl furniture before a static-filled\r\n          T.V. PATIENTS shuffle past like motorized corpses.\r\n          BARBARA LANG, now in her 40's, sits on a couch with a\r\n          transformed RACHEL. BARBARA is lucid and beaming at her.\r\n\r\n                         BARBARA\r\n          Yes, baby, I really am feeling so much\r\n          better. I feel so good on the inside,\r\n          I must be glowing on the outside.\r\n\r\n                         RACHEL\r\n          You look great, mama.\r\n\r\n                         BARBARA\r\n          Lord, you come all the way out here,\r\n          we can't keep talking about me. How\r\n          are you? I wane to hear every little\r\n          thing I'm missing.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          19.\r\n          RACHEL takes a deep breath, working extra hard to seem happy\r\n          and well adjusted today.\r\n\r\n                         RACHEL\r\n          Things are really great. Last night\r\n          I, um, I had this slumber party, with\r\n          some girlfriends. And this morning,\r\n          Mrs. Wallace made us all pancakes\r\n          before school.\r\n\r\n                         BARBARA\r\n          The Wallaces sure are a nice family.\r\n\r\n                         RACHEL\r\n          (her smile falters)\r\n          Oh, they are. A nice family.\r\n\r\n                         BARBARA\r\n          What's wrong?\r\n\r\n                         RACHEL\r\n          Nothing, I just... I miss those crepes\r\n          you used to make me.\r\n\r\n                         BARBARA\r\n          Oh, honey, those.crepes weren't\r\n          nothing but watered down pancakes.\r\n          (holds out her arms)\r\n          Come here baby.\r\n          She gives her daughter a big hug.\r\n\r\n                         BARBARA\r\n          Now you listen to me, the doctors say\r\n          I'm doing well. You know what that\r\n          means? That means someday, soon, you\r\n          and I are gonna be eating crepes for\r\n          breakfast, lunch and dinner.\r\n          For the first time, RACHEL's smile is genuine.\r\n\r\n                         RACHEL\r\n          That would be so great.\r\n\r\n                         BARBARA\r\n          (holds her at arm's length)\r\n          Oh, I look at you, remembering what\r\n          you were like at five, at ten...\r\n          (decides not to go down a sad path)\r\n          All I need is a little Loving Care for\r\n          these grey hairs and we'll make up for\r\n          all the time we've lost.\r\n          ooks at a wall clock)\r\n\r\n                         (MORE)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          20.\r\n          BARBARA (cont ' d)\r\n          Now you get going before you're late\r\n          for work.\r\n\r\n                         RACHEL\r\n          Yes, mama.\r\n\r\n          INT. HOSPITAL HALLWAY - DAY\r\n\r\n          RACHEL stands before glass doors, reinforced with chicken\r\n          wire, waiting to be buzzed out.\r\n          The NURSE on the other side is on the phone.\r\n          RACHEL turns and sees graffiti reading:\r\n          klnq of heLL\r\n          She cocks her head, noting the capitalized letters reveal a\r\n          hidden message: SLL.\r\n           A smiling TEENAGE GIRL wears a nightgown with a large wet\r\n           spot where she's soiled herself, without warnin she lets.\r\n          out a arcing ; ,e.\r\n          RACHEL wheels and pounds on the door.\r\n\r\n                         RACHEL\r\n          C'mon, c'mon. Let me out!\r\n          The door buzzes and she shoves through.\r\n\r\n          EXT. THE KENNEL - DAY\r\n\r\n          A restaurant/bar decorated with the BULLDOG insignia on a\r\n          football helmet.\r\n\r\n          INT. THE KENNEL - DAY\r\n\r\n          The rear end of a young WOMAN in tight jeans walking away.\r\n\r\n          MARK (V.0.)\r\n          Backfield in motion.\r\n          PULL BACK TO -- Pub decor with football paraphernalia\r\n          everywhere; Bulldog lamps and paw prints painted on the\r\n          floor. The bar's packed with local BUSINESSMEN.\r\n          JESSE, MARK and the other BULLDOGS are in a corner booth.\r\n          A.middle-aged, bearded WAILER with half his face bur -SS-arred\r\n          approaches.\r\n\r\n                         WAITER\r\n          Boys, what can Z get you?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          21.\r\n\r\n                         MARK\r\n          Hey, Al, we'll have three 1ï¿½.rge pepperoni\r\n          pies and two pitchers of beer.\r\n\r\n                         WAITER\r\n          (heading off) ,\r\n          Three large pizzas and cokes all around.\r\n\r\n                         B\r\n          I can't wait to play Carlin, man, I'm\r\n          onna bash Todd Simpson's face in.\r\n\r\n                         CHUCK\r\n          He scored two touchdowns on you last\r\n          time, dude.\r\n\r\n                         B\r\n          Yeah, I wish hl would jump off a roof.\r\n          TRACY, MONICA and AMY are at a table across the Kennel.\r\n\r\n                         MARK\r\n          Yo, Jes$, I think Tracy's following\r\n          you.\r\n          He pulls out the black NOTEBOOK.\r\n          ERIC eyes it, gets very nervous.\r\n\r\n                         MARK\r\n          Now then, according to the scoreboard\r\n          Jess, you'd have to bag every girl\r\n          here to catch up. You need the\r\n          points. I'll give ya ten for Tracy.\r\n\r\n                         BRAD\r\n          Do her, Jess.\r\n\r\n                         CHUCK\r\n          (a low chant)\r\n          Do her, do her, do her.\r\n          d the others join in.\r\n\r\n                         JESSE\r\n          All right, all right.\r\n          ERIC leans over to MARK, urgently whispers, and the two of\r\n          them move to...\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          22.\r\n\r\n          ANOTHER BOOTH --\r\n\r\n                         ERIC\r\n          (nervous, jumpy)\r\n          When Lisa asked me to lunch, she was\r\n          actin' like were on the road to\r\n          marriage or something. I told her to\r\n          wake up, she was just a pump, a nut.\r\n\r\n                         MARK\r\n          And she freaked and took a header.\r\n\r\n                         ERIC\r\n          And now I freakin.'. The Notre Dame\r\n          scout's comin' Friday and it this gets\r\n          out, I mean, sex and suicide?\r\n          Catholic schools frown on that shit.\r\n\r\n                         MARK\r\n          No one knows 'bout you and her.\r\n\r\n                         ERIC\r\n          Lisa took a picture of me with. her.\r\n\r\n                         MARK\r\n          Shit. Okay. I'll handle it.\r\n\r\n                         ERIC\r\n          How?\r\n\r\n                         MARK\r\n          Eric, relax, its me, Mark. I'll\r\n          handle it.\r\n          The WAITER sets a pitcher of soda and cups on the table.\r\n          AT THE BAR -- MR. STARK, a rotund lawyer in his 40's, takes a\r\n          pitcher of beer from the BARTENDER.\r\n\r\n                         BARTENLER\r\n          I don't see nuthin'.\r\n          STARK strolls to the booth with the pitcher in hand. He\r\n          sits, hiding the pitcher below table level.\r\n\r\n                         STARK\r\n          Hello, boys.\r\n\r\n                         ERIC\r\n          Hi, dad.\r\n          STARK winks, takes MARK's empty cup and fills it with beer\r\n          below the table.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         STARK\r\n          Great game last week. All of us on\r\n          the town council are awful proud.\r\n          He hands MARK the cup under the table and takes JESSE's cup.\r\n          The PLAYERS smile at each other.\r\n\r\n                         STARK\r\n          So, the Bulldogs bringing home the\r\n          state championship again this year?\r\n\r\n                         MARK\r\n          Absolutely. We're gonna crush Carlin\r\n          Friday and make it seven years in a'row.\r\n\r\n                         STARK\r\n          That's what I like to hear.\r\n\r\n                         MARK\r\n          (offers a toast to Jesse)\r\n          It's good to be king.\r\n\r\n          INT.SCHOOL HALLWAY - DAY\r\n\r\n          A CRASH of metal as the lock is cut off Lisa Parker's locker\r\n          with a pair of boltcutters held by SHERIFF KELTON, 30\"s, a\r\n          former Bulldog himself. The PRINCIPAL and SUE stand nearby.\r\n          Opening the locker, KELTON finds LISA's NOTE. As he pulls it\r\n          out, something falls from the note.\r\n\r\n                         SUE\r\n          What is it?\r\n\r\n                         KELTON\r\n\r\n                         (READS)\r\n          Looks like a suicide note.\r\n          (bending to retrieve)\r\n          .and a stub. Royal Photos.\r\n\r\n          EXT. ROYAL DRIVE-THRU PHOTCMAT - DAY\r\n\r\n          RACHEL's at her job, an island in the middle of a parking\r\n          lot. She wears her Walkman, listening to music. Across the\r\n          street is a 7-11 type store.\r\n\r\n          INT. MINIMART - DAY\r\n\r\n          ARNIE,che sweet-natured stoner, mops the floor. He waves to\r\n          RACHEL, who gives him a half-hearted wave back.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          24.\r\n\r\n          INT. ROYAL PHOTOMAT - DAY\r\n\r\n          Photos glide out of the developing machine. RACHEL pulls the\r\n          pictures out, stops dead when she sees they're shots of LISA;\r\n          With RACHEL, laughing. LISA with Rachel's dog.\r\n          RACHEL's finger tenderly slides along LISA's face.\r\n          She's shocked to find a picture of --\r\n          LISA AND ERIC -- his arm draped around her in the backseat of\r\n          a car. LISA's holding the camera at arm's length.\r\n          JESSE's CAR pulls up outside. MARK sits beside him.\r\n\r\n                         RACHEL\r\n\r\n                         (STARTLED)\r\n          Oh!\r\n          She peels off her headphones.\r\n\r\n                         JESSE\r\n          Sorry, didn't scare you, did I?\r\n          RACHEL turns, slides LISA's PICTURES into an envelope. MARK\r\n          checks her out, likes what.he sees, nudges JESSE.\r\n\r\n                         JESSE\r\n          You're... Rachel, right?\r\n          She nods, surprised he knows she's alive, much less knows her\r\n          name.\r\n\r\n                         JESSE\r\n          I'm Jesse.\r\n\r\n                         RACHEL\r\n          Uh-huh. The true romantic.\r\n          MARK leans over JESSE, his voice low now, intimate.\r\n\r\n                         MARK\r\n          So, Rachel, there were some pictures\r\n          Lisa took. They have, what you might\r\n          call sentimental value.\r\n          She just stares at him. MARK pulls a twenty from his wallet.\r\n\r\n                         MARK\r\n          Twenty bucks cover it?\r\n\r\n                         RACHEL\r\n          No.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          25.\r\n\r\n                         MARK\r\n          What do you mean? I'll go thirty.\r\n\r\n                         RACHEL\r\n          They're not your pictures.\r\n\r\n                         MARK\r\n          Well it's not like she's gonna be\r\n          picking them up, is it?\r\n          RACHEL turns away. JESSE glares at MARK.\r\n\r\n                         JESSE\r\n          Hey, cool. it.\r\n\r\n                         MARK\r\n          (tries a different tack)\r\n          Rachel, why don't I come by when you get\r\n          off and, you know, take you for a ride?\r\n          JESSE cocks an ear for her reply, but she doesn't answer.\r\n\r\n                         T MARK\r\n          C'mon, I don't bite... not unless you\r\n          want me to.\r\n\r\n                         RACHEL\r\n          I don't think so.\r\n\r\n                         MARK\r\n          Why not?\r\n\r\n                         RACHEL\r\n\r\n                         (TURNS)\r\n          Cause I'm a dyke.\r\n          JESSE laughs. MARK doesn't. He knows she's putting him on\r\n          and bores holes into her.\r\n\r\n                         MARK\r\n          Let's go, Jess.\r\n          The car pulls away, MARK glances in the REARVIEW MIRROR at\r\n          RACHEL, framed like a target.\r\n\r\n                         MARK\r\n          (low to himself)\r\n          Bitch. I'll show you funny.\r\n          ON RACHEL -- watching them go.\r\n          Seconds later, a SHERIFF'S CRUISER pulls up.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          26.\r\n\r\n                         KELTON\r\n          Hi.\r\n          He holds out Lisa's PHOTO STUB. RACHEL takes it, sees the\r\n          name, her eyes widen.\r\n\r\n          EXT. A HILL - NIGHT\r\n\r\n          A star-filled sky hangs above the town's makeout spot, a hill\r\n          overlooking Bergen. MARK and CHUCK stand outside a car\r\n          sipping beers. JESSE's CAR, a blue G.T.Â©, is several yards\r\n          away, with foggy windows.\r\n\r\n          WITHIN JESSE'S CAR\r\n          The backseat. JESSE's on top of TRACY. He pulls away from\r\n          her. She pulls her top down, sits up.\r\n\r\n                         JESSE\r\n          I'm sorry, it's not you. its me.\r\n\r\n                         TRACY\r\n          It's okay. You should save your\r\n          energy for the game anyway.\r\n          JESSE opens the door, stands outside, tucking in his shirt.\r\n          MARK and CHUCK make a crude humping gesture to JESSE. He\r\n          hesitates, then nods at them.\r\n          MARK pulls out the SCOREBOARD and enters JESSE's name with\r\n          TRACY's and the number 10.\r\n\r\n                         MARK\r\n          He shoots, he scores.\r\n          ON TRACY -- in the front seat, using the rearview to adjust\r\n          her makeup, pleased with what she sees. She glances at JESSE\r\n          as he re-enters on the driver's side.\r\n\r\n                         TRACY\r\n          What are you thinking about?\r\n\r\n                         JESSE\r\n          Nobody.\r\n\r\n                         TRACY\r\n          I asked what, not who.\r\n\r\n                         JESSE\r\n          Oh. Nothing.\r\n\r\n                         (PAUSE)\r\n\r\n                         (MORE)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          27.\r\n\r\n                         JESSE (CONT'D)\r\n          Doesn't it bother you that a girl\r\n          offed herself today?\r\n\r\n                         TRACY\r\n          Why? She wasn't anybody.\r\n\r\n                         JESSE\r\n          What?\r\n\r\n                         TRACY\r\n          I mean, I didn't know her.\r\n\r\n                         (SMILES)\r\n          You know, I still don't have a date to\r\n          Mark's party Friday. Hint, hint.\r\n          She leans over and nibbles on JESSE's ear. He pulls away,\r\n          forces a smile and turns the ignition.\r\n\r\n          INT. RACHEL'S KITCHEN - NIGHT\r\n\r\n          SMASH as a dish drops onto the floor. RACHEL is at the sink,\r\n          doing dishes. She crouches to retrieve the broken plate.\r\n          WE PAN along the chorus line of dishes, glasses, and\r\n          silverware on the counter as the metronome of the sink\r\n          faucet's DRIP, DRIP, DRIP and the micro-explosions of the\r\n          soap bubbles in the water intensify to deafening levels.\r\n          TIGHT ON a SPOON atop the counter which suddenly begins\r\n          dancing. Pots and pans on a hanging rack start rattling.\r\n          A RUMBLE as more dishes and utensils vibrate and rattle, as\r\n          if by a paranormal force.\r\n          But as RACHEL casually straightens up and looks out the\r\n          window, it's revealed it's only...\r\n\r\n          EXT. RACHEL' S HOUSE - NIGHT\r\n\r\n          BOYD driving a large SEMI-TRUCK pulling alongside the tiny\r\n          house. Its engine shuts off..,\r\n\r\n                         THE KITCHEN\r\n          .and the spoons and dishes stop vibrating.\r\n\r\n                         RACHEL\r\n          (singsong, to herself)\r\n          Daddy's home.\r\n          She walks to her bedroom and closes the door.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          28.\r\n\r\n          EXT. THE HOUSE - NIGHT\r\n\r\n          BOYD goes to shut the open fence and WALTER, the basset\r\n          hound, scurries past him and into the street.\r\n\r\n                         BOYD\r\n          Come back here, mutt.\r\n\r\n                         (WHISTLES LOUDLY)\r\n          Aw, good riddance.\r\n          And he closes the gate.\r\n\r\n          INT. RACHEL'S BEDROOM - NIGHT\r\n\r\n          RACHEL lays in bed, staring at the ceiling. BOYD knocks on\r\n          her door.\r\n\r\n          BOYD (0.S.)\r\n          Your dog got out. Better get'im.\r\n\r\n          INT. JESSE'S CAR - NIGHT\r\n\r\n          JESSE's driving alone, wiping Tracy's lipstick from his\r\n          cheek.\r\n\r\n          EXT. THE STREET -NIGHT\r\n\r\n          's in her overcoat over her longjohns. She looks down\r\n          the road and blanches as she sees WALTER trotting towards...\r\n          The road in front of him, a two-lane blacktop with CARS and\r\n          TRUCKS streaming by at high speed.\r\n\r\n                         RACHEL\r\n          Walter!\r\n          And she breaks into a run. WALTER looks back, starts\r\n          running, this is all fun for him.\r\n          There's the low BLEAT of a TRUCK'S HORN and then...\r\n          The high, piercing SQUEAL of a wounded animal.\r\n          In the road, WALTER, laying flat, keening in pain.\r\n          She runs to him and in one continuous motion SCOOPS him into\r\n          her arms.\r\n          RACHEL, in the middle of the two lanes. She turns as.__\r\n\r\n                         HEADLIGHTS\r\n          approach, fast.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          29.\r\n          She stumbles under the dog's weight, tries flagging down a\r\n          car.\r\n\r\n                         RACHEL\r\n          Help me! Please!\r\n          It speeds past, dangerously close. Another set of LIGHTS.\r\n\r\n                         RACHEL\r\n          Stop! Please, stop!\r\n          But the CAR passes, blaring its horn. She spins,around.\r\n          is bearing down on her. She holds her ground.\r\n\r\n                         RACHEL\r\n          THE CAR'S WINDSHIELD -- CRACKS, crazes, as if it hit with a\r\n          sharp, fierce projectile.\r\n          THE CAR -- lays down rubber as it screeches to a halt.\r\n          JESSE is at the wheel. Sees through the crazed windshield:\r\n          RACHEL, splattered with dog's blood.\r\n          He gets out, stares at his'windshield, shaken-up, groping for\r\n          some explanation.\r\n\r\n                         JESSE\r\n          Damn. What... damn.\r\n          RACHEL staggers up to him, holding a shivering mass of fur.\r\n\r\n                         RACHEL\r\n\r\n                         PLEASE--\r\n\r\n                         JESSE\r\n          Oh, my god.\r\n\r\n          . JESSE'S CAR - NIGHT\r\n          JESSE driving. RACHEL sits next to him, hugging the dog.\r\n\r\n                         RACHEL\r\n          It's my fault. He should have been in\r\n          bed with me.\r\n\r\n                         JESSE\r\n          Everything's gonna be all right.\r\n          His voice is not entirely convincing.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          30.\r\n          Through the spidered windshield: The car's headlights pierce\r\n          the night.\r\n\r\n          INT. THE VET'S PET CLINIC - NIGHT\r\n\r\n          A craftsman bungalow which serves as a vet's hospital. The\r\n          only light is over a FEMALE VET in her bathrobe, tending to\r\n          WALTER on a shiny examining table. There are runnels on both\r\n          sides of the table, for the blood.\r\n          RACHEL and JESSE stand nearby.\r\n\r\n                         RACHEL\r\n          His name's Walter. will he be\r\n          all right?\r\n          The VET's intensely focused on inserting an I.V. into the\r\n          dog.\r\n\r\n                         VET\r\n          You two had best wait outside.\r\n\r\n                         JESSE\r\n          Let's go. Best thing's to let her\r\n          do her work.\r\n          JESSE gently guides RACHEL away, who keeps looking back at\r\n          her dog.\r\n\r\n          THE WAITING ROOM - NIGHT\r\n          RACHEL and JESSE on a couch in the darkened room. She's\r\n          rocking herself, caked with blood. He tries to comfort her.\r\n\r\n                         JESSE\r\n          Your dog's gonna be okay.\r\n          She nods, unconvinced.\r\n\r\n                         JESSE\r\n          God, I almost roadkilled you.\r\n          Are you sure you're all right?\r\n          She nods. They hear a muffled, \"pmt\", from the VET in the\r\n          examining room. JESSE tries to take RACHEL's mind off it.\r\n\r\n                         JESSE\r\n          That tattoo on your arm, its pretty.\r\n          Hurt a lot when you got it?\r\n\r\n                         RACHEL\r\n          some.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          31.\r\n\r\n                         JESSE\r\n          Yeah?\r\n\r\n                         RACHEL\r\n          But it's... you know, like the song\r\n          says, you hurt yourself to see if\r\n          you can still feel.\r\n\r\n                         (BEAT)\r\n          I'm sorry.\r\n\r\n                         JESSE\r\n          For what?\r\n\r\n                         RACHEL\r\n          For making you--\r\n\r\n                         JESSE\r\n          No problem. Glad to help, you know.\r\n\r\n                         RACHEL\r\n          And I'm sorry about your windshield,\r\n          about your car.\r\n\r\n                         JESSE\r\n          How bizarre was that,, huh? Anyway,\r\n          wasn't your fault.\r\n\r\n                         RACHEL\r\n          You can be sorry for things that\r\n          aren't your fault.\r\n          The VET enters, drying her hands. RACHEL sits up, bracing\r\n          herself for the bad news. JESSE puts an arm around her seat\r\n          back, getting ready to hold her.\r\n\r\n                         VET\r\n          Walter's banged up pretty bad, lost\r\n          quite a bit of blood, but he's gonna\r\n          make it.\r\n\r\n                         RACHEL\r\n          Can I see him?\r\n\r\n                         VET\r\n          Come back tomorrow, any time after\r\n          eight.\r\n\r\n          EXT. HOUSE OF BREAKFAST - NIGHT\r\n\r\n          Your typical I.H.O.P. JESSE's CAR is parked in the lot.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          32.\r\n\r\n          INT. BATHROOM, HOUSE OF BREAKFAST - NIGHT\r\n\r\n          RACHEL's at the sink, washing the dog's blood from her arms.\r\n          A WOMAN walks in, sees her. Looks alarmed.\r\n          INT. HOUSE OF BREAKFAST - NIGi4T\r\n          As RACHEL moves through the restaurant, THREE PATRONS stare,\r\n          stare, stare at the blood stains on her coat.\r\n          She slides into a booth with JESSE. He's eating eggs.\r\n\r\n                         JESSE\r\n          Better. You don't look like a mass-\r\n          murderer now.\r\n          She smiles, sips a coffee. A country song comes on the\r\n          jukebox.\r\n\r\n                         JESSE\r\n          Wow, this music. Guess we should just\r\n          count ourselves lucky it ain't Hanson.\r\n\r\n                         RACHEL\r\n          (a weak smile)\r\n          Lisa hLUd them.\r\n\r\n                         JESSE\r\n          She was a friend of yours?\r\n          She nods.\r\n\r\n                         JESSE\r\n          really sorry.\r\n\r\n                         RACHEL\r\n          Sometimes I'd see someone, from\r\n          behind, and I'd know, I'd just know,\r\n          it was Lisa. And then she'd turn\r\n          ound, and it wasn't. But sometimes,\r\n          you know, it was. And now...\r\n\r\n                         (PAUSES)\r\n          Whenever I see someone who looks like\r\n          her, and she turns around...\r\n          it won't be... ever.\r\n          They both go quiet, not knowing what to say.\r\n\r\n                         JESSE\r\n          (looks at his latch)\r\n          Wow. It's late. \"ve got football\r\n          practice tomorrow.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         3\r\n\r\n                         RACHEL\r\n          I know. I hope I didn't ru;.n\r\n\r\n                         JESSE\r\n          No, if it wasn't for you I wouldn't\r\n          have had this nutritious medl,\r\n\r\n                         RACHEL\r\n          You're very polite, for a jock.\r\n\r\n                         JESSE\r\n          The compliments, they just keep on\r\n          comin'.\r\n          He drops some money on the table.\r\n\r\n                         RACHEL\r\n          I don't have any--\r\n\r\n                         JESSE\r\n          's cool, I got it. Can I give you a\r\n          Et home or something?\r\n          I can walk\r\n\r\n                         JESSE\r\n          Yeah, right.\r\n\r\n                         RACHEL\r\n          Or hitchhike.\r\n\r\n                         JESSE\r\n          Right.\r\n\r\n                         RACHEL\r\n\r\n                         (SMILES)\r\n          or I could wait for my limo,\r\n\r\n                         JESSE\r\n\r\n                         (SMILES)\r\n          You could. You could just wait fo\r\n          that limo.\r\n\r\n          INT. JESSE'S CAR - NIGHT\r\n\r\n          his engine.\r\n          He pulls up in front of RACHEL's house and kills\r\n\r\n                         JESSE\r\n\r\n                         WEL\r\n\r\n                         RACHEL\r\n          Thank you. For everything.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          34.\r\n\r\n                         JESSE\r\n          I guess I'll see you in school\r\n          tomorrow?\r\n\r\n                         RACHEL\r\n          Sure.\r\n\r\n                         JESSE\r\n          You'll let me know how Walter's doing?\r\n\r\n                         RACHEL\r\n          Yeah.\r\n\r\n                         JESSE\r\n          Good night.\r\n          He extends his hand. She takes it.\r\n          3i2!\r\n          The SHOCK of static electricity. Their words are\r\n          simultaneous.\r\n\r\n                         RACHEL\r\n          Dry weather.\r\n\r\n                         JESSE\r\n          Acrylic sweater.\r\n          They both laugh. Then go quiet. Then just stare at each\r\n          other. Then the moment is gone.\r\n          RACHEL gets out of the car, through the gate, back inside her\r\n          house. JESSE watches her go. Starts his engine, and his car\r\n\r\n          WIPES THE FRAME TO:\r\n\r\n          EXT. SCHOOL PARKING LOT - DAY\r\n\r\n          RACHEL crossing the lot. Her HEARTBEAT can be heard. She\r\n          looks up, sees LISA approaching the roof's edge. RACHEL's\r\n          heart sounds like its bursting from her chest.\r\n\r\n                         RACHEL\r\n          Lisa don't! Somebody stop her! Stop!\r\n          SLOW MOTION -- LISA falls through the air towards the car,\r\n          arms outstretched, hair trailing like black flames.\r\n          SMASH -- she goes through the windshield, but the face is\r\n\r\n          RACHEL'S.\r\n\r\n          SLAM CUT TO:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          33.\r\n\r\n          NT. RACHEL'S BEDROOM - NIGHT\r\n          RACHEL's eyes pop open as her body jerks awake, heart,\r\n          pounding. She looks around, realizes where she is.\r\n\r\n          FADE TO BLACK:\r\n\r\n                         A SUPER:\r\n\r\n          T U E S D\r\n          Under which is heard:\r\n\r\n          KELTON (V.O.)\r\n          \"For a moment, I thought someone was\r\n          actually seeing me. But it was all a\r\n          lie...\"\r\n\r\n          INT. GUIDANCE OFFICE - DAY\r\n\r\n          SHERIFF KELTON is reading from a photocopy of Lisa's\r\n          SUE and RACHEL sit-,in chairs.\r\n\r\n                         KELTON\r\n          \"Eric lied when he said I was special.\r\n          And I guess I was lying to myself when\r\n          I believed him.\"\r\n          He folds the note.\r\n\r\n                         SUE\r\n          Rachel, is there anything in there\r\n          that strikes a chord for you? Do you\r\n          know what Lisa was referring to?\r\n\r\n                         RACHEL\r\n          (after a moment)\r\n          Yesterday morning, she told me she'd,\r\n          uh, lost her virginity.\r\n          KELTON looks at SUE, produces the photo of LISA with ERIC.\r\n\r\n                         KELTON\r\n          You recognize this boy?\r\n\r\n                         RACHEL\r\n          Sure. Eric Stark. He's on the team.\r\n          KELTON gestures to SUE and they step out into...\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          36.\r\n\r\n                         THE HALLWAY\r\n          with another \"Heat Carlin!\" banner in the background.\r\n\r\n                         KELTON\r\n          What do you think?\r\n\r\n                         SUE\r\n          Robbie, I had a Freshman crying in the\r\n          hall last week. I couldn't get\r\n          anything out of her, but her friend\r\n          told me a football player slept with\r\n          her, then dumped her.\r\n\r\n                         KELTON\r\n          Nothing illegal about breaking a\r\n          girl's heart.\r\n\r\n                         SUE\r\n          Eric's 18. Lisa was 15. That's\r\n          statutory rape.\r\n\r\n                         KELTON\r\n          That's a stretch.\r\n\r\n                         SUE\r\n          Then let's make it. I don't know\r\n          what's going on around here, but if\r\n          that's what it takes to stop it, let's\r\n          stop it, before someone else's\r\n          daughter kills herself.\r\n\r\n                         KELTON\r\n          All right. I'll look into it.\r\n\r\n                         THE OFFICE\r\n          SUE sits behind her desk, with RACHEL before her.\r\n\r\n                         SUE\r\n          How are you feeling?\r\n\r\n                         RACHEL\r\n          okay. Fine. Can I go no\r\n          SUE opens a file on her desk.\r\n\r\n                         SUE\r\n          I was looking at chic last night.\r\n          it says here your mom's in Arkham.\r\n\r\n                         (BEAT)\r\n          How's your mom doing?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          37.\r\n\r\n                         RACHEL\r\n          She's gonna be fine.\r\n\r\n                         SUE\r\n          I spent some time up there.\r\n          As a patient.\r\n          RACHEL looks surprised.\r\n\r\n                         SUE\r\n          Does that surprise you?\r\n\r\n                         RACHEL\r\n          I guess. I mean, you seem pretty\r\n          normal.\r\n\r\n                         SUE\r\n          Thanks. i try. You visit your moat\r\n          often?\r\n\r\n                         SUE\r\n          Is that scary for you?\r\n\r\n                         RACHEL\r\n          Why?\r\n\r\n                         SUE\r\n          Well, children of schizophrenics\r\n          sometimes live with the fear of it\r\n          happening to them. At your age,\r\n          it's perfectly normal to be afraid\r\n          of turning out like your parents.\r\n\r\n                         RACHEL\r\n          Normal, huh? Get real, I know I'm\r\n          ten times more likely to get it\r\n          than most people.\r\n\r\n                         SUE\r\n          You're right. I'm sorry. So.\r\n          You've been in a series of foster\r\n          homes since you were, what, four?\r\n\r\n                         RACHEL N\r\n\r\n                         SUE\r\n          How's your foster family?\r\n\r\n                         RACHEL\r\n          They're happy, - 'z-rig as they get\r\n           their check every month.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          38.\r\n\r\n                         SUE\r\n          What about your real father?\r\n\r\n                         RACHEL\r\n          Never met the gentleman. My mom\r\n          won't even tell me his name.\r\n          RACHEL stares at a ceramic MUG of coffee, very close o the\r\n          edge of the desk.\r\n\r\n                         SUE\r\n          Rachel, in a way, you've lost your\r\n          mother. And now you've lost a friend.\r\n          Losing someone can be a very lonely,\r\n          painful place to be.\r\n\r\n                         RACHEL\r\n\r\n                         (QUIETLY)\r\n          You're right, I.lost my mom, I lost my,\r\n          friend, the people who cared about me.\r\n          But you only get paid to care.\r\n\r\n                         SUE\r\n          I really do care. How can I show you\r\n          that I do?\r\n          RACHEL is silent, staring at the MUG.\r\n\r\n                         SUE\r\n          Rachel?\r\n          But RACHEL's shut off, pushing down a storm of emotions.\r\n\r\n                         SUE\r\n          You know, this room is a place where\r\n          if you have feelings, you can talk\r\n          about them. You can let them out.\r\n          RACHEL shifts. SUE sees RACHEL's forearm near the coffee\r\n          MUG. And, as if by proximity alone, it EDGES off the end of\r\n          the desk --\r\n          And FALLS --\r\n          RACHEL catches it in one smooth motion just before it hits.\r\n\r\n                         RACHEL\r\n          sorry. I must've knocked it.\r\n          SUE, the color draining from her face.\r\n\r\n                         SUE\r\n          I didn't... see you knock it.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          39.\r\n          The DOOR swings open and the PRINCIPAL walks in, lays a\r\n          computer printout on her desk.\r\n\r\n                         PRINCIPAL\r\n          Sue, could you update the absentee\r\n          lists, see who we have to call?\r\n\r\n                         SUE\r\n\r\n                         (DAZED)\r\n          ure... sure.\r\n          She turns, and RACHEL is gone.\r\n\r\n          NT. SCHOOL HALLWAY - DAY\r\n          ERIC is at his locker, wearing his BULLDOG letter jacket. He\r\n          closes his locker to find RACHEL approaching him,\r\n          intimidated, but determined. She looks him in the eyes.\r\n\r\n                         RACHEL\r\n\r\n                         (LOW)\r\n          know. I know what you did.\r\n          A chill goes through him. Not saying a word, he turns, walks\r\n          through the crowd, looks back.\r\n          She's still rooted, staring him down.\r\n\r\n          EXT. FREAK HALL - LUNCH\r\n\r\n          ARNIE plays hackey-sack behind RACHEL, who sits on the steps.\r\n          She looks up, sees a BULLDOG letter jacket standing over her.\r\n          It's JESSE.\r\n\r\n                         JESSE\r\n          Hi. How's Walter?\r\n\r\n                         RACHEL\r\n\r\n                         (COLD)\r\n          Good. I'm picking him up today. Why\r\n          aren't you hanging out with your\r\n          friends over there?\r\n\r\n                         JESSE\r\n\r\n                         (TAKEN ABACK)\r\n          What's up? What's wrong?\r\n          She sees the hurt look in his eyes and softens.\r\n\r\n                         RACHEL\r\n          What do you wane from me?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          40.\r\n\r\n                         JESSE\r\n          I just wanted to, you know, see\r\n          how you're doing.\r\n          Over his shoulder she can see the stir his presence aC Freak\r\n          Hall is causing among...\r\n\r\n          THE PATIO GIRLS\r\n          MONICA taps TRACY on the shoulder, who's checking her makeup\r\n          in a compact mirror.\r\n\r\n                         MONICA\r\n          Look at Jesse, talking to a burnout.\r\n          TRACY turns, slips on a stylish pair of DKNY glasses.\r\n\r\n                         TRACY\r\n          She's not very good in daylight is\r\n          she? wonder where she keeps her\r\n          coffin.\r\n\r\n                         BACK ON:\r\n\r\n                         JESSE\r\n          So you'll meet me tonight, at the\r\n\r\n                         PIZZA PLACE--\r\n\r\n                         RACHEL\r\n          --yeah. Okay.\r\n\r\n                         JESSE\r\n          (smiles, as he backs away)\r\n          Okay. See you. Tonight.\r\n          ARNIE sees the Patio Girls glancing at RACHEL. She sits an\r\n          ARNIE nudges her.\r\n\r\n                         ARNIE\r\n          What'd he want?\r\n\r\n                         RACHEL\r\n          He asked me out.\r\n\r\n                         ARNIE\r\n          What'd you say?\r\n\r\n                         RACHEL\r\n          I said, \"Okay, its your funeral.\"\r\n\r\n                         ARNIE\r\n          Pardon me, but is hanging out with\r\n          jockboy such a hot idea? I mean,\r\n\r\n                         (MORE)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          41.\r\n\r\n                         ARNIE (CONT'D)\r\n          I heard he's dating Tracy Campbell,\r\n          who is giving you the look of a\r\n          thousand deaths right now.\r\n          RACHEL casually turns to take in TRACY, then turns away. Her\r\n          heart sinks.\r\n\r\n                         RACHEL\r\n          She's beautiful.\r\n\r\n                         ARNIE\r\n          Duh.\r\n\r\n          INT. FOOTBALL LOCKER ROOM - DAY\r\n\r\n          CLOSE ON a TV SET showing game highlights of last year's\r\n          Bulldog game against the Carlin Cougars.\r\n\r\n          WALSH (O.S.)\r\n          All right, as you can see from last\r\n          year's tape, the Carlin Cougars are a\r\n          tough, physical team. So Friday,\r\n          it's gonna be kill or be killed.\r\n          COACH WALSH, a charmless John Wayne, stands near the TV. The\r\n          BULLDOGS sit on benches before him.\r\n          On the VIDEO -.- MARK misses an easy block. WALSH points.\r\n\r\n                         WALSH\r\n          Here, we can see mark Sing kissing an\r\n          opposing player good-bye.\r\n          There are hoots of derision from the other PLAYERS. MARK\r\n          nods. ERIC leans into MARK, speaks low.\r\n\r\n                         ERIC\r\n          You didn't get the picture?\r\n\r\n                         MARK\r\n          Bitch wouldn't give it to me. Stay\r\n          frosty, no one else knows anything.\r\n          It's still at the photomat, I'll\r\n          get it.\r\n\r\n          WALSH (O.S.)\r\n          You two ladies back there gossiping?\r\n          No, sir.\r\n\r\n          WALSH (O.S. )\r\n          Excellent. Then you can give me fifty\r\n          when we hit the field.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          42.\r\n\r\n          EXT. FOOTBALL PRACTICE - DAY\r\n\r\n          JESSE and BRAD rest on a bench in their uniforms as MARK an\r\n          ERIC do push-ups. The COACH stands on a blocking sled with\r\n          PLAYERS Pounding into it.\r\n\r\n                         WALSH\r\n          C'mon girls, those are love taps!\r\n          (sees Chuck give a weak block)\r\n          Potter, show me you're a dog.\r\n\r\n                         CHUCK\r\n          Aww, coach.\r\n\r\n                         WALSH\r\n          You know the drill.\r\n          The other PLAYERS begin a BARKING CHANT. CHUCK strips off\r\n          his helmet, jogs to the bench and opens a styrofoam cooler,\r\n          within it are slabs of raw steak on blood soaked ice..\r\n\r\n                         WALSH\r\n          Show me you're a dog, Potter.\r\n          The barking rises as the PLAYERS psyche up CHUCK, who chews\r\n          off a bite of the raw meat. JESSE whispers to MARK...\r\n\r\n                         JESSE\r\n          I hate this bullshit.\r\n\r\n                         MARK\r\n          Not me. I love it.\r\n          MARK pops up, grabs a steak, rips off a bite, and runs full\r\n          tilt at the, blocking tackle, smashing into it with meaning.\r\n\r\n                         WALSH\r\n          You're a piece of work, Bing.\r\n          MARK takes a bow as he jogs away, chewing. He spots the\r\n          SHERIFF's CRUISER pulling --p to the practice field.\r\n\r\n          INT. A BUS - DAY\r\n\r\n          RACHEL hugs her dog, who 'Looks a mess; hind legs bandaged, a\r\n          funny cone around his head.\r\n          TWO OLD LADIES are staring at RACHEL, unsure if they're more\r\n          appalled by her appearance or the doge.\r\n          WALSH c `1.O . )\r\n          Show me you're dzgs'.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          43.\r\n\r\n          EXT. FOOTBALL PRACTICE- LATER\r\n\r\n          WALSH drill sergeants over MARK and the other PLAYERS as they\r\n          do drills. The CHEERLEADERS run their practice in the'\r\n          background.\r\n          on the sideline, SHERIFF KELTON is talking to ERIC, who's\r\n          sweating bullets as he fiddles with his helmet.\r\n          MARK watches ERIC, so intent he bobbles a ball thrown to him.\r\n\r\n                         KELTON\r\n          So, you're saying you never met or\r\n          talked to Lisa Parker?\r\n\r\n                         ERIC\r\n          No, sir. Never.\r\n          KELTON produces the photo of LISA and ERIC.\r\n\r\n                         N\r\n          Eric, who's this you're hanging onto,\r\n          a ghost?\r\n          ERIC blanches.\r\n          MARK watches KELTON leading ERIC away with WALSH.\r\n\r\n          KENNEL - DAY\r\n          A pinball machine as MARK plays, applying some body English\r\n          to it. A wired ERIC enters, a bundle of violent energy.\r\n\r\n                         MARK\r\n          What happened?\r\n\r\n                         ERIC\r\n\r\n                         (ANGRY)\r\n          Kelton, man, with that sheriff's badge\r\n          he pulled out of a cereal box.\r\n          Somebody told him I did Lisa. He\r\n          nails me with a picture of me and her,\r\n          starts talking statutory rape.\r\n\r\n                         MARK\r\n          Relax, that's bullshit. Your dad's a\r\n          lawyer, he'll kill that talk dead.\r\n\r\n                         ERIC\r\n          So I'm suspended. And Coach, Coach he\r\n          up and does this scene where he says,\r\n          \"give me your helmet.\"\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          44.\r\n\r\n                         MARK\r\n          What about Carlin?\r\n\r\n                         ERIC\r\n          What about Carlin? Game of the year,\r\n          football scouts are gonna be there and\r\n          I'm gonna be sittin' on the bench with\r\n          my thumb up my...\r\n          (shoves the machine in anger)\r\n          You said you were gonna get the\r\n          pictures.\r\n\r\n                         MARK\r\n          I tried. That Rachel bitch wouldn't\r\n          give'em to me..\r\n\r\n                         ERIC\r\n          She's the one who put me and Lisa\r\n          together. Shit. what are we gonna\r\n          do, Mark?\r\n\r\n          EXT. HOUSE - NIGHT\r\n\r\n          BRAD and CHUCK are throwing unfurling TOILET PAPER rolls onto\r\n          the trees in front of someone's middle-class house.\r\n\r\n                         BRAD\r\n          Who's place is this, again?\r\n\r\n                         CHUCK\r\n          Nimrod. It's Carlin's quarterback.\r\n          MARK and ERIC pull up in Mark's Mustang convertible.\r\n\r\n                         MARK\r\n\r\n                         (WHISTLES LOUDLY)\r\n          Hey, dogs! C'mon, we got a mission.\r\n          BRAD and CHUCK run to MARK's car, jump over and into the back\r\n          as MARK peels out.\r\n\r\n          'S BATHROOM - NIGHT\r\n          A HAND WIPES shower steam off a mirror, revealing a wet\r\n          RACHEL, a towel wrapped around her.\r\n\r\n                         RACHEL\r\n          jy are going to be late.\r\n          She hears her doorbell go off.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          45.\r\n\r\n          THE FRONT DOOR\r\n          as RACHEL opens the door.\r\n\r\n                         RACHEL\r\n          What'd you forget your--\r\n          There's nobody there.\r\n\r\n                         (WEAKLY)\r\n          --keys?\r\n          She looks around, closes the door, locks it, wraps her towel\r\n          tighter.\r\n\r\n                         LIVING ROOM\r\n          As she crosses back to her room. There's a KNOCKING on the\r\n          kitchen back door. She frowns, goes to the back door, looks\r\n          through the glass. No one there either. Now she's worried.\r\n\r\n          . ' RACHEL\r\n          (calls through the door)\r\n          Boyd? Emilyn?\r\n          She turns when the DOOR HANDLE on the front door JIGGLES\r\n          once. She stops dead. Spins as...\r\n          The BACK DOOR handle starts JIGGLING.\r\n          She backs into the living room and spins as--\r\n          Something starts TAPPING on one of the living room WINDOWS.\r\n          Like a wave moving around her, a WINDOW on the other side\r\n          starts TAPPING.\r\n          RACHEL turns a full circle, scared, surrounded by TAPPING and\r\n          JIGGLING, which grow increasingly loud r.\r\n          She puts her palms against her temples, as if struggling to\r\n          keep something bottled inside:\r\n\r\n                         RACHEL\r\n          Oh, god, oh, god. Not now. Stop\r\n          Suddenly all goes silent. She jumps as...\r\n          The PHONE RINGS near her. She scoops up the cordless. Beat.\r\n\r\n                         RACHEL\r\n          Hello?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          46.\r\n          There's a long pause on the other end.\r\n\r\n          MALE VOICE (V.0.)\r\n\r\n                         (FILTERED)\r\n          What's your favorite scary movie?\r\n\r\n          JUMP CUT TO :\r\n\r\n          EXT. RACHEL'S HOUSE - NIGHT\r\n\r\n          MARK on a CELL-PHONE. BRAD starts laughing next to him as\r\n          MARK covers the receiver, gestures to ERIC and CHUCK, who\r\n          scurry around Rachel's house.\r\n\r\n          RACHEL (V.O.)\r\n          Who is this?\r\n\r\n          WITHIN THE HOUSE\r\n          sees a SHADOW run past a window.\r\n\r\n          MARK (V.O.)\r\n          who is Wig?\r\n\r\n                         RACHEL\r\n          Knock it off. Is this you, Arnie?\r\n\r\n          MARK (V.0)\r\n          Ding, ding, ding. Wrgnq, guess again.\r\n\r\n                         RACHEL\r\n          What do you want?\r\n\r\n          MARK (V.0.)\r\n          (a menacing pause)\r\n          You.\r\n          The JIGGLING and the TAPPING starts up again, loud. The BOYS\r\n          VOICES are heard outside chanting...\r\n\r\n                         BULLDOGS\r\n          Rachel! Rachel! Rachel!\r\n          MARK (V.o.)\r\n          Rachel, come out and play now.\r\n          RACHEL grabs a knife from the kitchen, backs into...\r\n\r\n                         HER BEDROOM\r\n          where a bandaged WALTER is on the bed, looking alarmed.\r\n          RACHEL keeps backing up, nearing her open closet door.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         RACHEL\r\n          I'm calling the police.\r\n          She hangs up, dials 911, fumbling with the knife.\r\n\r\n                         UT TO:\r\n\r\n          INT. PIZZA PARLOR - NIGHT\r\n\r\n           A beer-and-slice emporium. JESSE'S at a payphone, hearing a\r\n          bus y sianal on RACHEL Is line. He hangs up.\r\n\r\n           INT. RACHEL'S BEDROOM - NIGHT\r\n\r\n          A horror-movie-moment as RACHEL waits for 911 to pick-up.\r\n          Behind her, a HAND is reaching through the open sash window,\r\n          pulling it up to gain entrance.\r\n\r\n          RACHEI.\r\n\r\n                         (INTO PHONE)\r\n          I have an emergency. Now, right now!\r\n          Yes, 3366 Elm Street...\r\n          She turns, sees the HAND at the window.\r\n\r\n                         RACHEL\r\n          No!\r\n          The WINDOW SMASHES down on the intruder's HAND. There's a\r\n          muffled YELL outside and the HAND is extracted.\r\n\r\n          EXT. THE HOUSE - NIGHT\r\n\r\n          Headlights light up MARK's face as BOYD and EMILYN's beat-up\r\n          STATION WAGON approaches the house.\r\n          MARK whistles loudly.\r\n          And takes off, joined by ERIC, clutching his injured hand.\r\n\r\n          â\u0080¢ SE - NIGHT\r\n           RACHEL, still stunned by what just happened. The cordless in\r\n          her hand speaks:\r\n\r\n           911 OPERATOR (V.O. )\r\n           Hello? Hello, :Ma'am, you still there?\r\n          RACHEL slowly moves to tier bedroom doorway. BOYD comes in\r\n          the front door.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          48.\r\n\r\n                         RACHEL\r\n\r\n                         (INTO PHONE)\r\n          Yes. It's okay. Things are fine.\r\n          She hangs up as a clueless BOYD takes in her freaked-out\r\n          appearance.\r\n\r\n                         BOYD\r\n          What's wrong?\r\n\r\n                         RACHEL\r\n          Nothing.\r\n          She retreats into her bedroom, looks at the Window. The\r\n          PHONE RINGS in her hand. She answers.\r\n\r\n          MARK (V.0.)\r\n          Don't go tellin' stories about my\r\n          Eric.\r\n          Click and the line goes dead. She hangs up. The PHONE RINGS\r\n          again. She doesn't answer.\r\n\r\n          THE LIVING ROOM\r\n          The PHONE RINGS on another extension. EMI, swers.\r\n\r\n                         EMILYN\r\n          Hello... just a second. Rachel?\r\n\r\n                         RACHEL\r\n          curled on her bed with WALTER, calls out:\r\n\r\n                         RACHEL\r\n          I'm not here.\r\n\r\n          INT. PIZZA KING - NIGHT\r\n\r\n          JESSE at the payphone, sipping a Royal Crown Cola.\r\n\r\n                         JESSE\r\n          Okay. Thank you, then.\r\n          He hangs up. Checks his watch. Waits.\r\n\r\n          FADE TO BLACK:\r\n          SUPER: WEID NElinA_Y\r\n\r\n                         JUMP TO:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          49.\r\n\r\n          EXT. SCHOOL ENTRANCE - DAY\r\n\r\n          A SCREAMING DEVIL fills the frame.\r\n          The bed of a speeding PICK-UP TRUCK is jammed with kneeling\r\n          TEENAGE BOYS wearing children's Halloween masks. They're\r\n          screaming bloody murder as they fire RAW EGGS at...\r\n          The BERGEN STUDENTS gathered at the entrance.\r\n          The PICK-UP speeds off as STUDENTS recover, straightening up\r\n          from their ducking positions. MARK and his cohorts go\r\n          running after the truck.\r\n\r\n                         TRACY\r\n          Carlin creeps!\r\n          At Freak Hall, ARNIE rises, wipes egg yolk from his hair.\r\n\r\n                         ARNIE\r\n\r\n                         (SLOWLY)\r\n          Hormonally-charged mo,,,ï¿½r 'â\u0080\u009ens. Why do the\r\n          innocent always get hit in a drive-by?\r\n          RACHEL looks up, sees JESSE approaching. Her eyes flare.\r\n\r\n                         JESSE\r\n          Hey, what happened to you last night?\r\n          I waited.\r\n\r\n                         RACHEL\r\n          You tell me what happened last night.\r\n\r\n                         JESSE\r\n          What?\r\n          ON RACHEL and JESSE as she tells him what happened last\r\n          night. He gets more and more agitated.\r\n          TRACY is wearing her glasses as she and MONICA watch JESSE\r\n          from the Patio.\r\n\r\n                         TRACY\r\n          What is wrong with this movie:\r\n          does he see in her?\r\n\r\n                         MONICA\r\n          Come on Trace, you're caviar, she's\r\n          cheeze whiz. He'll come around. He's\r\n          just letting little Jesse do the\r\n          thinking for big Jesse.\r\n          BACK TO -- A pissed-off JESSE.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         5\r\n\r\n                         JESSE\r\n          Okay, don't worry, I'll talk to Mark,\r\n          I'll take care of it\r\n\r\n                         RACHEL\r\n\r\n                         (FRUSTRATED)\r\n          No, don't... maybe all this isn't such\r\n          a good idea.\r\n\r\n                         JESSE\r\n          All what?\r\n\r\n                         RACHEL\r\n          I mean, guys like you are supposed to\r\n          date girls like Tracy.\r\n\r\n                         JESSE\r\n          I'm picking you up tonight. We're\r\n          gonna have a nice, mellow date.\r\n          RACHEL stands, silent, torn. The BELL RINGS, everybody\r\n          starts filing in.. She moves, he smiles, blocks her way.\r\n\r\n                         JESSE\r\n          I'm not going anywhere till you\r\n          say yes.\r\n\r\n                         RACHEL\r\n          (looks away, looks back, smiles)\r\n          All right. Okay.\r\n          (he doesn't move a muscle)\r\n          Yes.\r\n          JESSE lets her pass, with a chivalrous after-you sweep of his\r\n          hand, then falls in next to her. RACHEL'S arm is grabbed\r\n          by...\r\n\r\n                         S\r\n          May I speak with you a second?\r\n\r\n          INT. GUIDANCE OFFICE - DAY\r\n\r\n          RACHEL crossing and uncrossing her legs, it's the last place\r\n          she wants to be. She idly plays with the forest SNOW DOME.\r\n          SUE doesn't look so comfortable herself. She's holding a\r\n          stack of index cards.\r\n\r\n                         RACHEL\r\n          What are those, tonight's Top-Ten\r\n          list?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         5\r\n\r\n                         SUE\r\n          These are just an exercise that will\r\n          let me know how to help you better.\r\n\r\n                         RACHEL\r\n          You're wasting your time.\r\n\r\n                         SUE\r\n          Just answer true or false to these\r\n          statements.\r\n          (reads the top card)\r\n          \"There's a man inside the television\r\n          set who tells me what to do.\"\r\n\r\n                         RACHEL\r\n          False. I don't see the point-\r\n\r\n                         SUE\r\n          \"Sometimes my thoughts assume the form\r\n          of a giant insect.\"\r\n\r\n                         RACHEL\r\n          This ddesn't make any sense.\r\n\r\n                         SUE\r\n          Answer true or false and this won't\r\n          take all day. Again: \"Sometimes my\r\n\r\n                         THOUGHTS--\r\n\r\n                         RACHEL\r\n          False.\r\n          She sets down the SNOW DOME.\r\n\r\n                         SUE\r\n          \"If you want to play the piano well,\r\n          you have to practice.\"\r\n\r\n                         RACHEL\r\n          True.\r\n\r\n                         SUE\r\n          \"I can see sounds and hear colors.\"\r\n\r\n                         RACHEL\r\n          False.\r\n\r\n                         SUE\r\n          \"Large furry animals crawl on my face\r\n          every night while I sleep.\"\r\n\r\n                         RACHEL\r\n          True.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          52.\r\n          SUE looks up, surprised.\r\n\r\n                         RACHEL\r\n          I have a dog.\r\n          SUE nods, watches RACHEL closely as she takes her time with\r\n          this one, not reading off a card.\r\n\r\n                         SUE\r\n          Sometimes I can move things with my\r\n          thoughts.\r\n          Beat. RACHEL stares at her, a million thoughts racing.\r\n          Another beat.\r\n          The only sound is the clock ticking on SUE's desk. RACHEL\r\n          grabs her backpack and stands.\r\n\r\n                         RACHEL\r\n\r\n                         FUCK THIS--\r\n\r\n                         SUE\r\n          Honey, sit down. I just want to hel\r\n\r\n                         YOU--\r\n\r\n                         RACHEL\r\n          --and fuck you. You're not my mother!\r\n          RACHEL turns to go. SUE jumps up, grabs her arm, and...\r\n\r\n                         THE S\r\n          on the desk EXP DES, splattering water and white flecks all\r\n          over the desktop. RACHEL looks at it.\r\n          SUE stares at it, her worse fears coming true.\r\n          As RACBZL flies out the door.\r\n\r\n          EBT. FOOTBALL PRACTICE - CAY\r\n          WALSH sees JESSE get tackled, then help up the teammate who\r\n          tackled him.\r\n\r\n                         WALSH\r\n          What was that? 'hat are you, Miss\r\n          Manners? Show me you're a dog, Ryan.\r\n          JESSE looks at the styrofoam cooler on the bench.\r\n          A few of the nearby PLAYERS begin their barking chant.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          53.\r\n\r\n                         JESSE\r\n          Can't, Coach.\r\n\r\n                         WALSH\r\n          Say what?\r\n          The barking trails off. The other boys are stunned.\r\n\r\n                         BRAD\r\n          Oh, shit.\r\n\r\n                         JESSE\r\n          Well, I'm not a dog today, Coach,\r\n          I'm a vegetarian.\r\n\r\n                         WALSH\r\n          Since when? Don't give me that.\r\n          Show me you're a dog, Ryan.\r\n\r\n                         JESSE\r\n          Sorry, Coach. No can do.\r\n\r\n                         Â\u0080¢ WALSH\r\n          Your attitude sucks. Hit the showers.\r\n          Get outta my sight.\r\n          JESSE doffs his helmet, jogs to the bench. He douses his\r\n          head with water, sits there, looking angry.\r\n\r\n          INT. LOCKER ROOM -\r\n\r\n          PLAYERS goof around, snap towels at each other. Clanking\r\n          steel and grunts from the boys at the weight machines.\r\n\r\n          LOCKER ROOM SHOWERS\r\n          The mist in a shower, through which are glimpses of a lean\r\n          male figure with rippling stomach muscles. It's JESSE. MARK\r\n          and BRAD enter the showers.\r\n\r\n                         BRAD\r\n\r\n                         (TO JESSE)\r\n          Yo, lover boy, whatsa matter? Didn't\r\n          ya nut that tattoo chick yet?\r\n\r\n                         MARK\r\n          Brad, how many points he gonna get for\r\n          straightening a dyke?\r\n\r\n                         BRAD\r\n          Twenty, no, thirty.\r\n          They fingertip high-five each other.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          54.\r\n\r\n                         BRAD\r\n          Jess, you score the skank yet?\r\n          JESSE just glares at him, walks away.\r\n\r\n                         MARK\r\n          What's with him?\r\n\r\n                         BRAD\r\n          Must be that time of the month.\r\n\r\n          THE LOCKER ROOM\r\n          JESSE finishes dressing between the lockers. MARK, wearing a\r\n          towel, approaches him.\r\n\r\n                         MARK\r\n          Jess, what's the matter?\r\n\r\n                         JESSE\r\n          You. What's with the stunt you pulled\r\n          last night?\r\n\r\n                         MARK\r\n          What? Papering McCabe's house?\r\n          I asked you if you--\r\n\r\n                         JESSE\r\n          What you did at Rachel's.\r\n\r\n                         MARK\r\n          what? We were just sendin' her\r\n          a message.\r\n          JESSE slams his locker closed.\r\n\r\n                         JESSE\r\n          Tell me, I'll pass it on.\r\n\r\n                         MARK\r\n          Look, man. She's getting Eric in all\r\n          kinds a shit. I mean, if he gets\r\n          charged with rape, there goes any\r\n\r\n                         CHANCE OF--\r\n\r\n                         JESSE\r\n          Screw Eric, he's a big boy. He made\r\n          his own decisions, he's gotta live\r\n          with 'em. And stay away from Rachel,\r\n          or deal with me.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          55.\r\n\r\n                         MARK\r\n          What are you getting bent for? She's\r\n          just a burnout, a slut--\r\n          BANG as JESSE shoves MARK against a locker. MARK shoves him\r\n          back. The rest of the PLAYERS in the background go quiet.\r\n\r\n                         JESSE\r\n          (low, intense)\r\n          Don't call her a skank, don't call\r\n          her a slut.\r\n\r\n                         MARK\r\n          What's wrong with you?\r\n\r\n                         JESSE\r\n          We screw with girls, use them, because\r\n          it makes us feel like big men--\r\n\r\n                         MARK\r\n          Get to the bad part.\r\n\r\n          ' - JESSE\r\n          I'm tired. I'm tired of all of it.\r\n\r\n                         MARK\r\n          What are you talking about? We're\r\n          friends, we're all friends.\r\n\r\n                         JESSE\r\n          No. We just grew up together.\r\n          And he walks away. On MARK. Pissed. He sees JESSE left his\r\n          letter jacket behind, hanging on the locker.\r\n\r\n          INT. ARKHAM STATE MENTAL HOSPITAL - DAY\r\n\r\n          CLOSE ON GRAFFITI reading:\r\n          KIng of heLL\r\n          RACHEL is looking at it, while she waits to be buzzed in.\r\n          The capped letters read: KILL.\r\n\r\n          THE VISITING AREA\r\n          where RACHEL sits with BARBARA, holding her hand. There are\r\n          occasional MOANS and SHOUTS from other PATIENTS.\r\n\r\n                         B\r\n          Baby? Rachel? What's wrong?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          56.\r\n\r\n                         RACHEL\r\n          Mama, what was it like? WhEn you\r\n          started to... when things went bad.\r\n          What did it feel like, what did you see?\r\n\r\n                         B\r\n          h, honey, why do you want to--\r\n\r\n                         RACHEL\r\n          Did you see things move by themselves?\r\n          Please, mama. I have to know.\r\n\r\n                         BARBARA\r\n          (thinks, then)\r\n          Well, first, I thought I saw the devil\r\n          in your eyes. Then I started to see\r\n          people's faces looking... deformed,\r\n          like they'd had plastic surgery, or the\r\n          bones were moving under their skin.\r\n\r\n                         (LAUGHS)\r\n          For a while, I thought I had this bi\r\n          snake wrapped around my neck, and I\r\n          couldn't'talk, or it would try to go\r\n          down my mouth.\r\n          sits, thinking.\r\n          BARBARA looks at her in confusion for a long beat.\r\n\r\n                         BARBARA\r\n          There is something different about\r\n          you. Baby, are you all right?\r\n          Yeah. Yes. Everything's fine.\r\n          Everything's gonna be all right.\r\n\r\n                         HOSPITAL HALLWAY\r\n          A BUZZ and as RACHEL leaves, she smiles at.\r\n          sitting on the couch. BARBARA shifts slightly, looks at a\r\n          CHROME CHAIR across from her.\r\n\r\n          HER DISTORTED REFLECTION\r\n          A LARGE SNAKE is coiled around her neck.\r\n          She closes her eyes. opens them. And the SNAKE is gone.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          57.\r\n          There's the high, mechanical wssshh sound of film sliding\r\n          through a gate on the--\r\n\r\n                         CUT TO:\r\n\r\n          INT. PUBLIC LIBRARY - DAY\r\n\r\n          A MICROFILM MACHINE as IMAGES STREAM past its screen.' Black\r\n          and white, abstract, poignant, fleeting, with newspaper text,\r\n          scratches and magnified pieces of dust.\r\n\r\n          SUE (V.O.)\r\n          July. June. May.\r\n\r\n                         HER FACE\r\n          is illuminated from below by the view screen. And now:\r\n          She stops on a NEWSPAPER front page:\r\n          CHAMBERLAIN RECORDER. May,-1976.\r\n          With a PHOTO of C ' RIK W iITE at age seventeen.\r\n          The headline identifies her as the girl thought responsible\r\n          for the arson at Chamberlain High School which killed 73\r\n          people.\r\n          The text below the photo states that ga1nh White is the\r\n          ,father of Carrie White.\r\n\r\n          ON SUE --\r\n          staring. Totally absorbed.\r\n\r\n                         A HAND\r\n          grabs her forearm. SUE jerks. Looks up.\r\n\r\n                         LIBRARY MATRON\r\n          The library is closing.\r\n\r\n          EXT. HALL OF RECORDS - DAY\r\n\r\n          SUE SNELL walks up the steps of a nondescript municipal\r\n          building.\r\n\r\n          INT. HALL OF RECORDS - DAY\r\n\r\n          SUE SNELL at the files. She pulls up:\r\n          An aging photocopy, white :,n black o\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          59.\r\n          Rachel Ann Lang's BI CERTIFICATE.\r\n          She scans the certificate finds:\r\n          MOTHER: Barbara Elizabeth Lang.\r\n\r\n                         FATHER: WN\r\n\r\n                         S\r\n          (under her breath)\r\n\r\n                         UNKNO\r\n\r\n          EXT. ARKHAII STATE MENTAL HOSPITAL - DAY\r\n\r\n          SUE'S red VOLVO sits before the entrance to the hospital.\r\n          SUE looks at HER EYES in the rearview mirror, takes a deep\r\n          breathe to summon her courage.\r\n\r\n                         SUE\r\n\r\n                         (WHISPERS)\r\n          You can do this.\r\n          She gets out of her car, holding a box of chocolates.\r\n\r\n          INT. HOSPITAL CORRIDOR - DAY\r\n\r\n          SUE strides up to the reinforced door. The sudden BUZZ o\r\n          the lock seems to cut through her. She hesitates, then\r\n          pushes in to...\r\n\r\n          THE VISITING AREA\r\n          .and approaches the NURSES STATION.\r\n\r\n                         SUE\r\n          I'm here to see Barbara Lang.\r\n\r\n                         NURSE\r\n          Stay here, I'll get her.\r\n          SUE looks around. This place holds a lot of bad memories.\r\n          DOCTOR NELSON, SO's, an overworked-underpaid psychiatrist\r\n          approaches with a smiling MALE PATIENT.\r\n\r\n                         DOCTOR\r\n          Suzy? Suzy Snell?\r\n\r\n                         SUE\r\n          Hello, Doctor Nelson.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          59.\r\n\r\n                         DOCTOR\r\n          Suzy Snell, one of my rare success\r\n          stories. What brings you back?\r\n\r\n                         SUE\r\n          I'm visiting the mother of one of\r\n          my students.\r\n\r\n                         DOCTOR\r\n          I heard about the good work you're\r\n          doing at the high school.\r\n          The PATIENT turns and softly starts thudding his forehead\r\n          against the wall. The DOCTOR casually pulls him away before\r\n          he can harm himself.\r\n\r\n                         R\r\n          Excuse me, Sue.\r\n          (towing the Patient)\r\n          Come see me after. I'd like to hear\r\n          how you're doing.\r\n\r\n          INT. THE VISITING'AREA - DAY\r\n\r\n          SUE sits before BARBARA, who's picking her way though the\r\n          chocolates. The MOANS of PATIENTS seem to rattle S\r\n\r\n                         BARBARA\r\n          Thank you for the chocolates.\r\n          Thoughtful of you.\r\n\r\n                         S\r\n\r\n                         AT)\r\n          Mrs. Lang, why didn't you ever tell\r\n          Rachel who her father was?\r\n\r\n          BARBAR.\r\n          Wasn't important.\r\n          Why was it important for her not\r\n          to know?\r\n\r\n                         BARBARA\r\n          Why would she need to?\r\n          Hrs. Lang, I need to know who he was.\r\n\r\n                         BARBARA\r\n          sorry, that's private.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          60.\r\n\r\n                         SUE\r\n          Mrs. Lang, it's important that I know\r\n          his name.\r\n\r\n                         BARBARA\r\n          I really don't see how that's any of\r\n          your business.\r\n\r\n                         SUE\r\n          I promise you, I'll keep the\r\n          information in the strictest\r\n          confidence.\r\n          BARBARA just looks at her, chewing.\r\n\r\n                         SUE\r\n          I'm just trying to help Rachel. She\r\n          seems very troubled and I'm worried\r\n          about her.\r\n\r\n                         BARBARA\r\n\r\n                         (LAUGHS)\r\n          You're worried? Very worried\r\n\r\n                         SUE\r\n          I am. Yes.\r\n\r\n                         BARBARA\r\n          You don't have children, do you, miss?\r\n\r\n                         SUE\r\n          No. No I don't.\r\n          BARBARA laughs. almost hysterically. SUE's thrown. BARBARA\r\n          regains herself, then, with tremendous conviction...\r\n\r\n                         BARBARA\r\n          Then you don't kzgx. You will never\r\n          ever know, how terrifying children\r\n          can be.\r\n          SUE, frustrated, it's like punching water with this wo\r\n\r\n                         SUE\r\n          Rachel needs my help. She...\r\n\r\n                         (DESPERATELY GROPING)\r\n          She has a... a disease, a genetic\r\n          disorder I think her father passed on\r\n          to her. I need to know so I can help\r\n          her. Who was her father, Mrs. Lang?\r\n          es SUE, then goes quiet, lost in her memories.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          61.\r\n\r\n                         BARBARA\r\n\r\n                         (SMILES)\r\n          I did tell Rachel how I met him. He\r\n          said it was love at first sight.\r\n          I was his waitress. I insisted he try\r\n          the cherry pie, 'cause I'd baked it\r\n          myself. He said, with every bite of\r\n          that pie, he could see our future\r\n          together. By the time he got to the\r\n          crust, he could see what I would look\r\n          like, all old and saggy... and he\r\n          still loved me.\r\n          (her smile fades, then)\r\n          He left me after Rachel was born.\r\n          I never told her because, people\r\n          around here aren't too fond of Carrie\r\n          White, for what she did. I didn't\r\n          want her having to grow up with that.\r\n          His name was Ralph. Ralph White.\r\n          SUEgoes cold.\r\n\r\n                         SUE\r\n          So they are half-sisters.\r\n\r\n          EXT. MINIATURE GOLF COURSE - NIGHT\r\n\r\n          A castle, a windmill, and yards of worn astroturf. One of\r\n          those places you go for fun if you're young and the city's\r\n          too far away.\r\n          MONTAGE -- of RACHEL and JESSE on their date, playing,\r\n          laughing.\r\n          -- JESSE takes a swing, muffs a shot, tosses his club.\r\n          -- A tricky par-four hole, featuring a dogleg and a slope to\r\n          the cup. RACHEL hits the ball. And it rolls a hole-in-one.\r\n          -- She leaps in the air with joy. Behind her, JESSE feigns\r\n          dropping dead.\r\n\r\n          EXT. MONARCH MOTORS - NIGHT\r\n\r\n          A sign reads: MONARCH MOTORS, below it are a row of USED\r\n          CARS for sale, hoods open, like circus animals begging for\r\n          peanuts.\r\n\r\n          JESSE (V.O.)\r\n          That's my dad's dealership. Y\r\n          all that will be mine.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          62.\r\n\r\n          EXT. WITHIN JESSE'S CAR - NIGHT\r\n\r\n          JESSE driving. RACHEL has her hand on the big HURST\r\n          stickshift between the two bucket seats. He accelerates and\r\n          RACHEL expertly shifts the gear.\r\n\r\n                         JESSE\r\n          You are good. I'm impressed.\r\n\r\n                         RACHEL\r\n          My foster-dad taught me on his semi\r\n          truck. Where we going?\r\n\r\n          EXT. THE HILL - NIGHT\r\n\r\n          The twinkling lights of Bergen below. Stars above. RACH\r\n          and JESSE lay on the hood of his car, leaning against the\r\n          windshield.\r\n\r\n                         JESSE\r\n          Before he sold cars, my dad wanted to\r\n          write this book: One Hundred Senators\r\n          Pick Their Favorite Restaurants.' So,\r\n          he wrote, to all of them.\r\n\r\n                         RACHEL\r\n          All of them?\r\n\r\n                         JESSE\r\n          Dear Senator So-and-so, I am writing\r\n          a book.\r\n\r\n                         RACHEL\r\n          Anybody answer?\r\n\r\n                         JESSE\r\n          Yes. No. Sort of.\r\n          She laughs.\r\n\r\n                         JESSE\r\n          He got two letters back. one was a\r\n          form letter which said, 'Thank you\r\n          for your support.'\r\n\r\n                         RACHEL\r\n          And the other?\r\n\r\n                         JESSE\r\n          The other was from Hubert Humphrey.\r\n\r\n                         RACHEL\r\n          Who?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          63.\r\n\r\n                         JESSE\r\n          He was the vice-President once.\r\n          He wrote back a three page letter,\r\n          raving about a place called Wally's\r\n          Burger Hut. My dad was knocked-out.\r\n\r\n                         RACHEL\r\n          So your dad wrote a book, color me\r\n          impressed.\r\n\r\n                         JESSE\r\n          He never wrote it. Or he was going\r\n          to, and then my sister was born, and\r\n          then I was born. And there was this\r\n          car dealership, and it was security.\r\n          So your dad wanted to be a writer.\r\n          How'd his kid end up being this sweaty\r\n          armpit jock?\r\n\r\n                         JESSE\r\n\r\n                         (BEAT)\r\n          Sometimes when they throw me the ball,\r\n          it feels like time just slows down.\r\n          And I know where to be and how to get\r\n          there. When I have that feeling I\r\n          catch it. Always. Every time.\r\n\r\n                         RACHEL\r\n          And you like that.\r\n\r\n                         JESSE\r\n          Yeah, I love it. Except. My dad.\r\n          He's got my life all mapped out. He\r\n          wants me to take over the business.\r\n\r\n                         RACHEL\r\n          What's wrong with that? Sounds like a\r\n          nice life.\r\n\r\n                         JESSE\r\n          Selling used cars is not what I want.\r\n          And, unless I nail that football\r\n          scholarship,' that's what I'll get.\r\n\r\n                         (EXHALES)\r\n          Wow. I can't believe I'm telling you\r\n          all this. I've never said any of this\r\n          out loud to anyone before.\r\n          (takes a long look at her)\r\n          Must be great not having to be like\r\n          anyone else.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          64.\r\n\r\n                         RACHEL\r\n          It's not so great. Sometimes I wish I\r\n          could just be one of the shiny, happy\r\n          people. Does that surprise you?\r\n\r\n                         JESSE\r\n          Everything about you surprises me.\r\n          There's the soft pops of rain hitting the car as it begins to\r\n          drizzle, then it comes down hard.\r\n\r\n          WITHIN THE CAR\r\n          RACHEL and JESSE are in front, facing each other, leaning\r\n          against the doors as rain streams against the windows.\r\n\r\n                         RACHEL\r\n\r\n                         (SITS FORWARD)\r\n          I used to know this guy, could suck a\r\n          strand of spaghetti through his mouth\r\n          and out his nose. He called it Brain\r\n          Flossing.\r\n          JESSE smiles.\r\n\r\n                         RACHEL\r\n          He had a talent. You. You got\r\n          football. It'll get you outta this\r\n          place. You can make your own path\r\n          after that. Write your own book.\r\n\r\n                         JESSE\r\n          Yeah? Want to come with me?\r\n          She smiles. He leans forward. And she pulls away-, afraid,\r\n          then decides to let him. They kiss. Then she pulls away.\r\n\r\n                         JESSE\r\n          What?\r\n\r\n                         HEL\r\n          This...\r\n          She indicates the gear shift.\r\n\r\n                         HEL\r\n          is poking me right in the ribs.\r\n          JE55E's eyes flicker to the back seat.\r\n\r\n                         RACHEL\r\n          Um, I don't know how to say this.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          65.\r\n\r\n                         JESSE\r\n          Yeah?\r\n\r\n                         RACHEL\r\n          But I've never...\r\n\r\n                         JESSE\r\n          Oh.\r\n\r\n                         RACHEL\r\n          And, I'd want it to be special. Like\r\n          you ring the doorbell, with flowers\r\n          in your hand.\r\n\r\n                         JESSE\r\n          Right. So... what's your favorite\r\n          flower?\r\n\r\n                         RACHEL\r\n\r\n                         (SMILES)\r\n          Daisies.\r\n\r\n          EXT. RACHEL'S HOUSE - NIGHT\r\n\r\n          in his car. The street's wet, but it's stopped raining.\r\n          RACHEL gives him a quick kiss goodnight.\r\n\r\n                         RACHEL\r\n\r\n                         SEE YOU--\r\n\r\n                         JESSE\r\n          --later.\r\n          She pulls away, exits, closes the door for the--\r\n\r\n                         CUT TO:\r\n\r\n          INT. RACHEL'S BEDROOM - NIGHT\r\n\r\n          RASE sleeps fitfully, tangled in her sheets.\r\n\r\n                         DISSOLVE TO:\r\n\r\n          EXT. THE WOODS - NIGHT\r\n\r\n          A massive GOTHIC BED sits incongruously in a clearing.\r\n\r\n          RACHEL AND JESSE\r\n          are making love. She's on top, her hands on his chest.\r\n          Their glistening bodies catch the light of a RING OF FLAMES\r\n          bursting around the bed.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          66.\r\n\r\n                         RACHEL'S HANDS\r\n          suddenly sink into the flesh of JESSE's chest.\r\n          She SCREAMS as she tries to extract them,. but strips of his\r\n          flesh stick to her like flypaper.\r\n          RACHEL twists violently as her torso melds into his.\r\n          Their bodies fuse, a grotesque apparition with four legs and\r\n          two heads.\r\n          Her mouth presses into his as their faces merge.\r\n          The ring of fire leaps inward, consuming the bed.\r\n\r\n          FADE TO WHITE:\r\n\r\n          SUPER IN BLACK:\r\n\r\n          T H U R S D A Y\r\n\r\n                         FADE IN:\r\n\r\n          EXT. FREAK HALL - MORNING\r\n\r\n          RACHEL sits, lost in thought. JESSE nears. She stands up.\r\n\r\n                         JESSE\r\n          So, you're coming to the game, right?\r\n\r\n                         RACHEL\r\n          I don't really get football.\r\n\r\n                         JESSE\r\n          C'mon. I need you, for good luck.\r\n\r\n                         RACHEL\r\n          All right. I'll be there.\r\n\r\n                         JESSE\r\n          Good. I have practice today, but I\r\n          can pick you up later, seven thirty?\r\n\r\n                         RACHEL\r\n          Sure, go practice. Go be great.\r\n          Live the life you want.\r\n\r\n                         JESSE\r\n          What kind of life do you want?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          67.\r\n\r\n                         RACHEL\r\n\r\n                         (PLAYFUL)\r\n          I don't know. I have a hard time\r\n          picturing it.\r\n\r\n                         JESSE\r\n          Well if you can't, I'll do it for you.\r\n\r\n                         RACHEL\r\n          What do you mean?\r\n\r\n                         JESSE\r\n          I will predict your future.\r\n\r\n                         RACHEL\r\n          Uh-huh. Can I get a hint?\r\n\r\n                         JESSE\r\n          'm in it.\r\n          ON THE PATIO -- are TRACY, MARK and MONICA, watching the.\r\n\r\n                         TRACY\r\n          If he's gonna do it, you know, be seen\r\n          talking in public with someone else,\r\n          he should show some respect.\r\n          (a slow boil)\r\n          He should show me the respect, at\r\n          least, to be seen with someone pretty.\r\n          Someone cool. Someone who counts.\r\n          Amy or you, you know, ate.\r\n          Instead, it's Its. And I feel...\r\n\r\n                         MONICA\r\n          Disrespected?\r\n\r\n                         TRACY\r\n          That's right. I wish there was\r\n          something I could do to make him come\r\n          to his senses.\r\n          On MARK's face, a slow, insidious grin that seems to spread\r\n          into eternity appears.\r\n\r\n                         TRACY\r\n          What?\r\n\r\n                         MARK\r\n          Let's nail the bitch. Plan\r\n          a way to screw her like she's\r\n          screwing us.\r\n          .TRACY, a wicked smile as she nods.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          68.\r\n\r\n          INT. CLASSROOM - DAY\r\n\r\n          RACHEL watches SUE at the door, speaking to her TEACHER.\r\n          SUE points to RACHEL, who looks less than thrilled.\r\n\r\n          EXT. PARKING LOT - DAY\r\n\r\n          A dark smudge is spread on the empty parking space where LISA\r\n          died. No one parks there anymore.\r\n          SUE is escorting RACHEL to her VOLVO.\r\n\r\n          RACHEL (V.0.)\r\n          Where are you taking me?\r\n\r\n          SUE (V.0.)\r\n          There's something you have to see.\r\n\r\n          EXT. THE WOODS - DAY\r\n\r\n          A DREAM-LIKE GLIDE past SUE's VOLVO, parked on the roadside,\r\n          and through the trees.\r\n\r\n          SUE (V.0.)\r\n          This used to be the school for the\r\n          whole district. Chamberlain High.\r\n          It was closed down in 1976.\r\n\r\n          FAST DISSOLVE TO:\r\n\r\n          EXT. THE OLD GYM - DAY\r\n\r\n          A burned-out hulk, shrouded in mist.\r\n\r\n          SUE (V.0.)\r\n          There was a fire here that year.\r\n          The night of the prom. Seventy-three\r\n          people died. A few of us survived.\r\n\r\n          INT. THE DESTROYED GYM - DAY\r\n\r\n          Dark; full of exposed wires, metal rods and pipes, countless\r\n          empty beer cans. Two mattresses are laid out amid the\r\n          debris.\r\n          SUE stands on a pile of rubble, next to RACHEL. There's a\r\n          haunted look on SUE's face.\r\n\r\n                         FLASH TO:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          69.\r\n\r\n          GYM - PROM NIGHT, 1976 (STOCK)\r\n          STROBING IMAGES of CARRIE WHITE, drenched in pig's blood.\r\n          Sounds of horrible SCREAMING.\r\n          Flashes of.KIDS stampeding. Burning. Dying.\r\n          A fire rages behind CARRIE as she steps off a platform, turns\r\n          and looks at us with the face of an avenging angel.\r\n\r\n          BACK TO.\r\n\r\n          THE DESTROYED GYM,\r\n          present day, as SUE flinches.\r\n\r\n                         SUE\r\n          I haven't really been here in over\r\n          twenty years. But it feels like I've\r\n          been back here every day since.\r\n\r\n                         RACHEL\r\n          Happy homecoming. Can we go? This\r\n          place is spooky. Gives me the creeps.\r\n\r\n                         SUE\r\n          Do you know what happened here?\r\n\r\n                         RACHEL\r\n          You just said. A fire.\r\n\r\n                         SUE\r\n          What caused it?\r\n\r\n                         RACHEL\r\n          They think a boiler blew up, okay?\r\n          Am I gonna be graded on this?\r\n\r\n                         SUE\r\n          Come on, you've heard of Carrie White.\r\n\r\n                         RACHEL\r\n          (kicks a can)\r\n          Everybody has.\r\n\r\n                         SUE\r\n          And?\r\n\r\n                         RACHEL\r\n\r\n                         (SIGHS)\r\n          Supposedly, she set the fire, as part\r\n\r\n                         (MORE)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n           ! 0.\r\n\r\n                         RACHEL (CONT'D)\r\n          of a revenge-suicide thing. Elvis was\r\n          her date and they escaped in a U.F.O.\r\n          I know what happened to that\r\n          snow dome, on my desk.\r\n\r\n                         RACHEL\r\n\r\n                         (BEAT)\r\n          It fell.\r\n\r\n                         SUE\r\n          We both saw it.\r\n          RACHEL looks at her, isn't going to talk about this.\r\n\r\n                         SUE\r\n          I know everything there is to know\r\n          about Carrie White. She did this.\r\n          It began with what you did, with\r\n          the snow dome. Then it got out\r\n          of control.\r\n\r\n                         RACHEL\r\n\r\n                         (TURNS)\r\n          I'm cold. Let's go.\r\n\r\n                         SUE\r\n          It's a genetic recessive trait. The\r\n          male is the carrier, when he combines\r\n          with the right female, the trait\r\n          surfaces in their offspring, usually\r\n          in women. Like King's Disease,\r\n          hemophilia.\r\n\r\n                         RACHEL\r\n          What are you saying I have?\r\n\r\n                         SUE\r\n          Its a trait, Rachel, you inherited.\r\n          Telekinesis.\r\n\r\n                         RACHEL\r\n          With all respect, lady, you're\r\n          seriously bat-shit. I'm walking,\r\n          back to the real world.\r\n          SUE's voice is low, quiet.\r\n\r\n                         SUE\r\n          Your mother told me your father was\r\n          Ralph White. Carrie's father.\r\n          It stops RACHEL in her tracks.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          71.\r\n\r\n                         RACHEL\r\n          I don't believe you. She never told\r\n          me, why would she tell you?\r\n\r\n                         SUE\r\n          You need help--\r\n          Like what? Like they helped you?\r\n\r\n                         SUE\r\n          Yes. No.\r\n\r\n                         RACHEL\r\n          So then it's Arkham for me?\r\n\r\n                         SUE\r\n          No. I can help you, get it under\r\n          control.\r\n\r\n                         RACHEL\r\n          You want to know what I'm feeling\r\n          today? `Happy. Happier than I've\r\n          ever been. So I don't want or need\r\n          your help.\r\n          RACHEL runs off. SUE follows, trips on the rubble, falls.\r\n\r\n                         SUE\r\n          Rachel!\r\n\r\n          INT. FOOTBALL LOCKER ROOM - DAY\r\n\r\n          JESSE stands at his locker, dressing. MARK approaches.\r\n\r\n                         MARK\r\n          Hey.\r\n          (no response from Jesse)\r\n          Just wanted to say two things.\r\n          I'm sorry. Maybe I overreacted.\r\n\r\n                         JESSE\r\n          Don't play with me.\r\n\r\n                         MARK\r\n          I'm not. We've been friends since\r\n          we could both pee standing up. And I\r\n          thought we'd be best friends forever.\r\n\r\n                         (BEAT)\r\n          Never thought some girl could come\r\n          between that. Look, I know I'm scum.\r\n          I'm lower than scum, I'm smegma, I'm\r\n          butt lint.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          72.\r\n\r\n                         JESSE\r\n          (smiles in spite of himself)\r\n          Keep going.\r\n\r\n                         MARK\r\n          I'm sorry.\r\n\r\n                         JESSE\r\n          I'm not the one you should be\r\n          apologizing to.\r\n\r\n                         MARK\r\n          You're right. I'll come up with a way\r\n          to make it up, to b of you.\r\n          (smiles, full charm)\r\n          tryin', brother, I'm tryin'.\r\n\r\n          INT. DISTRICT ATTORNEYS OFFICE - DUSK\r\n\r\n          Light streams in through the slatted blinds. The young D.A.\r\n          is at his desk. MR. STARK, Eric's attorney father, sits\r\n          across from him with ERIC. SHERIFF KELTON and COACH WALSH:\r\n          also sit in chair's.\r\n\r\n                         STARK\r\n          You're not really thinking of pressing\r\n          charges against my son.\r\n\r\n          D.A.\r\n          We're doing more than just thinking.\r\n\r\n                         WALSH\r\n          I need the boy for the game.\r\n\r\n                         STARK\r\n          Robbie, we've known each other a long\r\n          time, since you were a Bulldog.\r\n\r\n                         KELTON\r\n          Save it, Lou. Sue Snell told me there\r\n          were other girls--\r\n\r\n                         WALSH\r\n          Those kinds of girls know what they're\r\n          getting in to. Eric's a good kid, he\r\n          may be guilty of some youthful\r\n\r\n                         TRANSGRESSIONS--\r\n\r\n                         KELTON\r\n          Youthful transgressions? A girl\r\n          killed herself.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         73\r\n          The door opens and the town's MAYOR walks in, grey-haired,\r\n          distinguished, with an air of authority.\r\n\r\n          D.A.\r\n\r\n                         (NODS)\r\n          Mr. Mayor.\r\n\r\n                         MAYOR\r\n          Sit, everybody, sit, 'm just\r\n          listening in.\r\n          He leans against the desk, arms folded..\r\n\r\n                         STARK\r\n\r\n                         (BEAT)\r\n          Okay. Cards on the table. My boy\r\n          isn't going down alone then.\r\n\r\n          D.A.\r\n          Go on.\r\n\r\n                         STARK\r\n          He hasn't done anything other boys on\r\n          the team haven't done. Eric can even\r\n          get proof of it. Mark Bing, Jesse\r\n          Ryan, Chuck Potter, Brad Winters.\r\n\r\n                         (PAUSES)\r\n          Now, there will be college scouts at\r\n          the game Friday. Eric takes a fall,\r\n          I'll make sure they all do. You want\r\n          to be responsible for tarnishing all\r\n          these boys lives?\r\n\r\n                         MAYOR\r\n          Well. I think that about sums it up.\r\n          He looks at the D.A., as if to give him his cue.\r\n\r\n          D.A.\r\n          Robbie, I just don't think I have\r\n          enough evidence to ruin this boy's\r\n          reputation.\r\n\r\n                         KELTON\r\n\r\n                         BUT--\r\n\r\n          D.A.\r\n          That's it, Robbie. That's all.\r\n\r\n                         MAYOR\r\n          Lou, thank you for coming in.\r\n          I'll walk you out.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          74.\r\n          They all stand and shakes hands.\r\n          KELTON sits; seething as he realizes the fix was in before\r\n          ever entered this room. he\r\n          He looks across at ERIC, sitting, a smug look on his face.\r\n\r\n          EXT. SCHOOL PARKING LOT - DAY\r\n\r\n          MARK intercepts JESSE as he nears his car.\r\n\r\n                         MARK\r\n          Hey, man, I got it. This girl, this\r\n          Rachel, is special to you, huh?\r\n\r\n                         JESSE\r\n          Yeah.\r\n          MARK extracts a KEY RING from his jacket, pulls a KEY off.\r\n\r\n                         MARK\r\n          The cabin. My folks aren't there.\r\n          Get away from all of us idiots.\r\n          Go have a romantic time.\r\n          JESSE looks at him. MARK tosses the key, JESSE catches it.\r\n          MARK smiles.\r\n\r\n                         MARK\r\n          And bring her to my party. I'll show\r\n          you we can be one big, happy family.\r\n\r\n          EXT. STREET/TRACY'S BMW - DAY\r\n\r\n          TRACY driving with MONICA as they follow a walking RACHEL.\r\n          RACHEL crosses the street.\r\n\r\n                         MONICA\r\n          Finally, she's going into the mall.\r\n\r\n                         TRACY\r\n          (an evil smile)\r\n          Perfect. We have the homefield\r\n          advantage.\r\n\r\n          INT. SHOPPING MALL, DEPARTMENT STORE - DAY\r\n\r\n          The cosmetics department of an upscale store, mirrors on\r\n          every counter. A SALESwoMAN sprays perfume samples on\r\n          passing shoppers. She pulls up short as she encounters...\r\n          RACHEL wandering by, out-of-place in her street urchin wear.\r\n          The PERFUME WOMAN watches RACHEL pass.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          75.\r\n          Stopping at a counter, RACHEL takes in the vast array of\r\n          makeup, the models on the displays. She sees a YOUNG COUPLE\r\n          go by, very J. Crew, very much in love.\r\n          She turns to her own visage reflected in several mirrors on\r\n          the counter.\r\n\r\n                         RACHEL\r\n          (under her breath)\r\n          You're normal.\r\n          At the end of the counter, the PERFUME WOMAN approaches a\r\n          SALESWOMAN helping MONICA.\r\n\r\n                         PERFUME\r\n          Karen, watch the girl in black, make\r\n          sure she doesn't pocket anything.\r\n          MONICA turns around to see...\r\n          RACHEL -- staring at a row of-lipsticks. She's startled\r\n\r\n                         BY-\r\n\r\n                         SALESWOMAN\r\n          Can I help you?\r\n\r\n                         RACHEL\r\n          Uh, just looking.\r\n          The woman gives her a smile of devastating insincerity,\r\n          crosses her arms and just stands there. RACHEL gets her\r\n          drift.\r\n          MONICA walks up behind RA\r\n\r\n                         MONICA\r\n          Oh, hi. Karen, this is a friend\r\n          of mine from school.\r\n          The SALESWOMAN nods, moves away.\r\n\r\n                         RACHEL\r\n          Thought she was gonna frisk me.\r\n\r\n                         MONICA\r\n          She does Step Class with my mom.\r\n\r\n                         (SMILES)\r\n          You should see the scars from her\r\n          liposuction.\r\n          RACHEL edges way, checking out the lipsticks, but MONICA\r\n          trails her.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          76.\r\n\r\n                         MONICA\r\n          What are you looking for?\r\n\r\n                         RACHEL\r\n          Nothing. Just lookin'.\r\n\r\n                         MONICA\r\n          Is it perhaps, something to wear on a\r\n          date? Perhaps with a certain jock-\r\n          hunk we all know?\r\n\r\n                         RACHEL\r\n          (smiles, nervous, nailed)\r\n          No.\r\n\r\n                         MONICA\r\n          You know, Tracy isn't universally\r\n          loved.\r\n\r\n                         RACHEL\r\n          There's a shock.\r\n\r\n                         MONICA\r\n          Exhibit A. I think she's a Melrose\r\n          Place superbitch.\r\n          RACHEL cracks a hint of a smile.\r\n\r\n                         MONICA\r\n          You have great lips.\r\n\r\n                         (BEAT)\r\n          No, really. Look, this shade would\r\n          look very kissable on you. Soft.\r\n          MONICA goes to apply the lipstick on her. RACHEL pulls away.\r\n\r\n                         MONICA\r\n          Trust me. See, Tracy tried to steal\r\n          Brad from me. Now hold still.\r\n          And RACHEL does.\r\n\r\n                         MONICA\r\n          So, he invite you to the game? Just\r\n          nod.\r\n          RACHEL nods.\r\n\r\n                         MONICA\r\n          Well, there's a big party after. I\r\n          hope you can go. I know it would mean\r\n          a lot to Jesse if we all got along.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          77.\r\n\r\n                         RACHEL\r\n          Uh-huh.\r\n\r\n                         MONICA\r\n          Good. See?\r\n          Checking in a mirror, RACHEL sees she's right.\r\n\r\n                         MONICA\r\n          Here, these two would also rock\r\n          on you.\r\n          The SALESWOMAN reappears.\r\n\r\n                         SALESWOMAN\r\n          Can I ring those up?\r\n\r\n                         RACHEL\r\n          Um, sure. How much are these?\r\n\r\n                         SALESWOMAN\r\n          Twenty-two fifty. Each.\r\n          RACHEL sets the lipsticks down. MONICA smiles at the\r\n\r\n          SALESWOMAN.\r\n\r\n                         MONICA\r\n          Maybe next time. Bye.\r\n          She pulls RACHEL away. As they walk the SALESWOMAN keeps\r\n          looking at RACHEL with distaste.\r\n\r\n                         MONICA\r\n          (a conspiratorial smile)\r\n          Here, I kleptoed it for you.\r\n          She slips RACHEL the lipstick.\r\n\r\n          INT. RACHEL'S BEDROOM - NIGHT\r\n\r\n          RACHEL before the mirror, applying the lipstick. A P.J.\r\n          HARVEY song plays under, slow, insistent, seductive:\r\n\r\n          P.J. HARVEY\r\n          She's burst/ dropped off! picked the\r\n          fruit! realize! I'm naked / I'm naked\r\n          too./ So cover rrry body/ dress it fine/\r\n          hide my linen and lace.\r\n          She pulls on a silver, thrift-shop SLIP DRESS, moves a slee ve\r\n          to cover her tattoo.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          78.\r\n          P.J. HARVEY (cont'd)\r\n          So fruit flower myself inside out/ I'm\r\n          happy and bleeding for you / fruit\r\n          flower myself inside out / I'm tired\r\n          and bleeding for you...\r\n          She slips off her nose stud.\r\n\r\n          EXT. RACHEL'S HOUSE - NIGHT\r\n\r\n          JESSE waiting in his car. He looks up --\r\n          RACHEL stands under the porch light in her dress. A lanky\r\n          gangster girl, with. one leg planted on a step like a cocked\r\n          gun. She's bone-chillingly beautiful.\r\n          He gets out, opens the car door for her.\r\n\r\n                         JESSE\r\n          What happened to that little thing you\r\n          wear, that, uh...\r\n          He gestures to hib'nose, indicating her stud.\r\n\r\n                         RACHEL\r\n          Took it off.\r\n\r\n                         JESSE\r\n          Too bad. I like it. It's different.\r\n          RACHEL looks at the car seat. On it are DAISIES.\r\n\r\n                         JESSE\r\n\r\n                         (SMILES)\r\n          Just, you know, throw'em in the back.\r\n\r\n          EXT. A CABIN - NIGHT\r\n\r\n          A small cabin in the woods. Fire light in the window.\r\n          JESSE's CAR is parked in t;^.e gravel alongside.\r\n\r\n          INT. THE CABIN - NIGHT\r\n\r\n          JESSE is stoking a fire in the fireplace. There's a MOOSE\r\n          HEAD TROPHY on the wall. RACHEL's sitting on a bed, draped\r\n          with a chenille spread.\r\n\r\n                         JESSE\r\n          It was nice of mark to lend us the\r\n          place. He's really tryin' to make\r\n          peace. Invited .s to his party. But\r\n          we won't go if y;,u,d be uncomfortable.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          79.\r\n          He moves to the bed.\r\n\r\n                         RACHEL\r\n          No. Let's go.\r\n\r\n                         JESSE\r\n          Great.\r\n          (looks at her)\r\n          What's wrong?\r\n\r\n                         RACHEL\r\n          I feel like.., we're being watched.\r\n          She looks up at the MOOSE HEAD's MARBLE EYES, reflecting\r\n          firelight. JESSE drapes his jacket over the MOOSE HEAD.\r\n\r\n                         JESSE\r\n          Sorry, Bullwinkle, lights out.\r\n          (sits on the bed)\r\n          Feel better?\r\n\r\n                         RACHEL\r\n          Feel scared.\r\n\r\n                         JESSE\r\n          Funny. He too.,\r\n          He leans in to her. She backs away, like a skittish doe.\r\n\r\n                         RACHEL\r\n          I'm sorry, I just feel... weird.\r\n          I don't know. Oh, wow, I am really\r\n          losing my mind here.\r\n\r\n                         JESSE\r\n          It's okay. Rachel, it's okay. It\r\n          doesn't have to be tonight. Whenever\r\n          you're ready. And, hey, you know\r\n          what, you're the sanest person I know.\r\n          And that's exactly what she needed to hear. She cups the\r\n          back of his neck and pulls his lips to hers. They kiss; a\r\n          deep, healing kiss.\r\n\r\n                         HER HAND\r\n          brushes aside one of the straps to her dress,, which slips off\r\n          her shoulder.\r\n          JESSE tenderly runs his hand over her HEART-THORN TATTOO.\r\n\r\n          FADE TO BLACK /FADE IN:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          80.\r\n\r\n          CLOSEUPS OF RACHEL AND JESSE\r\n          in the bed, making love. Firelight playing over their skin.\r\n          It's beautiful. what we all wanted our first time to be.\r\n          They move slowly, as if all the pain in the world could be\r\n          erased, ï¿½f only they could become one. JESSE watches RACHEL\r\n          Her face open, vulnerable.\r\n\r\n          FADE TO BLACK/FADE IN:\r\n\r\n                         RACHEL ASLEEP\r\n          seems peaceful, holding on to JESSE like a child, they're\r\n          covered by the chenille spread. Their sweat clings to them\r\n          like the softest of prisons. He's awake, studying her. He\r\n          gently runs his fingertips across her brow.\r\n\r\n                         E\r\n\r\n                         (SOFTLY)\r\n          I love you.\r\n          off them and across the floor.\r\n          TO FIND a MI on the floor, hidden behind a chair.\r\n          FOLLOW the MICROPHONE CORD to a closed WINDOW where it snakes\r\n          out.\r\n          There's the gaping lens of a VIDEO CAMERA visible in the\r\n          corner of the window. Its RED recording light on.\r\n          DIVE into the black lens, and...\r\n\r\n          FADE TO BLACK:\r\n\r\n          A SUPER - BLOOD RED:\r\n\r\n          F R D A Y\r\n\r\n          FADE IN TO:\r\n\r\n          INT. RACHEL'S BEDROOM - MORNING\r\n\r\n          And the round BLACK PUPIL of WALTER'S EYE.\r\n          He lays on the bed watching'RACHEL sneaking in through her\r\n          window. trying to be mouse quiet. She gets safely inside\r\n          when her bedroom door opens.\r\n          BOYD stands in the doorway. She's busted.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n          8l.\r\n\r\n                         BOYD\r\n          You were out all night.\r\n          RACHEL nods, defiantly. He walks over to her and, without\r\n          warning, slaps her.\r\n\r\n                         BOYD\r\n          You're grounded. No school today.\r\n          You don't move from this room.\r\n          He turns on his heel, walks out. The dog looks as stricken\r\n          as she does.\r\n\r\n          A SERIES OF DISSOLVES:\r\n          Of RACHEL in her bedroom, as the day passes.\r\n          The sun moves across the floor as a ghostly RACHEL and her\r\n          dog FADE IN-AND-OUT around the room. She lays in bed,\r\n          staring at the ceiling. Paces her room like a prisoner.\r\n          FINALLY -- It's nightfall.\r\n          RACHEL slips out her window.\r\n\r\n          EXT. ARKHAM STATE MENTAL HOSPITAL\r\n\r\n          And it looks even spookier at night.\r\n\r\n          INT. STATE HOSPITAL, VISITING AREA - NIGHT\r\n\r\n          Dimly lit as SUE SNELL sits with\r\n\r\n                         SUE\r\n          Rachel needs help. She doesn't\r\n          believe me and I'm afraid for her.\r\n          I want you to tell her who her\r\n          father was.\r\n          Why?\r\n\r\n                         SUE\r\n          She'll believe it from your lips.\r\n          Mrs. Lang, I really need your help,\r\n          before it's too late. I can take you\r\n          to her. Will you help me?\r\n          BARBARA slowly nods, yes.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          Â£2.\r\n\r\n          EXT. FOOTBALL STADIUM, STANDS - NIGHT\r\n\r\n          The entire town has showed for this traditional rivalry and\r\n          there's Bulldog paraphernalia galore. RACHEL appears in the\r\n          stands, looking a bit lost. Down front sit MONICA and AMY.\r\n          On the field are TRACY and her fellow CHEERLEADERS.\r\n          MONICA nudges AMY and waves to\r\n\r\n                         MONICA\r\n          Rachel, Rach, over here.\r\n          Hey. Grab a seat.\r\n          Looking around, RACHEL sees she's surrounded by Patio People.\r\n\r\n                         RACHEL\r\n          Thanks, but...\r\n\r\n                         MONICA\r\n          Oh, please, you're.not gonna sit by\r\n          your lonesome. There's plenty of room,\r\n          if Amy;here slides her bubble butt.\r\n\r\n                         AMY\r\n\r\n                         (DRY)\r\n          Very witty, Ms. Bulimia.\r\n          But she moves over. RACHEL tentatively sits.\r\n\r\n          INT. FOOTBALL LOCKER ROOM - NIGHT\r\n\r\n          JESSE enters, mounds of hair are at his feet. He looks up.\r\n          MARK and most of the BULLDOGS have shaved their heads and are\r\n          working on the last players. They turn to him in unison.\r\n          CHUCK grins, runs his hand over his scalp.\r\n\r\n                         CHUCK\r\n          We did it for the big game.\r\n\r\n                         MARK\r\n          C'mon, Jess, you're up.\r\n          JESSE stares in horror at how identical they all look now.\r\n          Then he starts to... giggle, then breaks into laughter, turns\r\n          and walks away.\r\n\r\n                         A P-ALN\r\n          Man, he'll ruin the whole effect.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          83.\r\n\r\n          EXT. THE STANDS - NIGHT\r\n\r\n          MONICA and RACHEL.\r\n\r\n                         MONICA\r\n          No, no, it's an extra point when\r\n          you score the kick after the touchdown.\r\n          A safety is when you get tackled with\r\n          the ball in your own end zone.\r\n\r\n                         RACHEL\r\n          Thought that was a bunt.\r\n          What?\r\n\r\n                         RACHEL\r\n          I'm kidding, I'm kidding.\r\n\r\n                         MONICA\r\n          Okay, listen. Here's what Brad told me\r\n          to say, doesn't matter if something good\r\n          or bad happens, just say \"You. gotta be\r\n          fuckin' kiddin' mel\" No matter what,\r\n          just say that. It'll sound like you know\r\n          what's going on.\r\n\r\n          INT. STADIUM TUNNEL - NIGHT\r\n\r\n          JESSE and the team move through a dark tunnel and onto...\r\n\r\n          THE FOOTBALL FIELD\r\n          with all the pageantry and sheer rush of a hometown crowd.\r\n          The school band plays like they're going to bust a gut.\r\n          Hysteria and bloodlust fill the air as the crowd starts a\r\n          barking chant.\r\n\r\n                         JESSE\r\n          on the sideline bench. He scans the crowd behind him,\r\n          sees.\r\n          A NOTRE DAME SCOUT, wearing a \"Fighting Irish jacket, toting\r\n          a clipboard.\r\n          JESSE then spots RACHEL in the stands, gives her a reassuring\r\n          grin. She glances at the SCOUT, smiles back at JESSE.\r\n          TRACY sees them, is none too happy.\r\n          SLOW MOTION -- A whistle sounds as a FOOTBALL is kicked to\r\n          start the game. The BALL spins end over end until...\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          84.\r\n          It's caught by a BULLDOG receiver who starts his return, then\r\n          is popped hard and FUMBLES. An OPPOSING PLAYER leaps onto\r\n          the ball on the muddy quagmire of a field.\r\n          n the stands...\r\n\r\n          RACHEL, MONICA, AMY\r\n          (in accidental unison)\r\n          You gotta be fuckin' kiddie' me!\r\n          They turn to each other, burst into laughter.\r\n          MONTAGE -- of the punishing game. Epic warfare with\r\n          grunting, spitting and cursing as LINEMAN butt heads and.\r\n          -- A CARLIN RUNNING BACK steamrolls through the BULLDOGS for\r\n          a touchdown.\r\n          -- RACHEL, MONICA and AMY do their You gotta be fuckin'\r\n          kiddin' me routine.\r\n          JESSE catches a pass, and is immediately slammed hard\r\n\r\n          CARLIN PLAYER.\r\n          RACHEL looks like she's been kicked in the gut.\r\n\r\n                         RACHEL\r\n          Do they have to hit him that hard?\r\n\r\n                         MONICA\r\n          Amy, Rachel's worried about Jesse.\r\n\r\n                         AMY\r\n          Don't worry, i always looks worse\r\n          than it really\r\n\r\n                         CUT TO:\r\n          TRACY and the other CHEERLEADERS leading a cheer as...\r\n          JESSE glances at the sideline, where the NOTRE DAME FOOTBALL\r\n          SCOUT watches him, writing notes on his clipboard.\r\n          THE HALF-TIME SCOREBOARD and the BULLDOGS trail 7-\r\n          On the sideline, MARK SMASHES his helmet to the ground.\r\n\r\n          INT. ARKHAM STATE MENTAL HOSPITAL - NIGHT\r\n\r\n          mpatient SUE sits before an exhausted DOCTOR NELSON.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          85.\r\n\r\n                         DOCTOR\r\n          Well... I understand you need to take\r\n          out Mrs. Lang, to do a drug-abuse\r\n          intervention with her daughter. But\r\n          while she's doing well, her condition\r\n          may be fragile.\r\n\r\n                         (BEAT)\r\n          In good conscience, I could only\r\n          release her in your custody for\r\n          two hours.\r\n\r\n                         0\r\n          Thank you.\r\n          SUE jumps to her feet to leave.\r\n\r\n                         DOCTOR\r\n          Hold on. You have a bunch of release\r\n          forms to sign. I'll go get them.\r\n          On SUE, sitting, knowing she-may be running out of time.\r\n\r\n          EXT. FOOTBALL FIELD - NIGHT\r\n\r\n          The BULLDOGS prove their worth with brutal play as they cream\r\n          the CARLIN QUARTERBACK for a big loss.\r\n          THE FOURTH QUARTER SCOREBOARD -- the BULLDOGS trail 7-3.\r\n          RACHEL sees...\r\n          The Notre Dame FOOTBALL SCOUT writing notes as he watches...\r\n          JESSE cutting across the middle of the field.\r\n          He catches a pass, but two DEFENSIVE BACKS converge on him\r\n          and he gets bone-jarringly plastered.\r\n          JESSE hits the ground with such force his helmet flies off.\r\n          For a moment, it looks like he's been decapitated.\r\n\r\n                         RACHEL\r\n\r\n                         (STANDS)\r\n          Jess!\r\n          THE HOMETOWN CROWD rises to their feet as...\r\n          JESSE stays down, hurt.\r\n\r\n                         RACHEL\r\n          Oh, no.\r\n          RACHEL strains to see him as the team circles around JESSE.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          86.\r\n          FOUR PHOTOGRAPHERS rush along the sideline to snap shots,\r\n          their cameras flashing.\r\n          JESSE sits up, stands, shakes his head to clear it as he jogs\r\n          to the sideline.\r\n\r\n                         RACHEL\r\n          Thank, God. He's okay.\r\n\r\n                         CUT TO :\r\n          THE SCOREBOARD CLOCK -- loudly TICKING from 0:09 to 0:07.\r\n          JESSE -- running. He looks up to...\r\n          THE NIGHT SKY -- A FOOTBALL silently arches up, spinning an\r\n          achingly beautiful spiral in SLOW MOTION.\r\n          THE SCOREBOARD CLOCK -- a booming TICK from 0:05 to 0:04.\r\n          JESSE makes a spectacular one-handed catch on the run,\r\n          streaking along the sideline.\r\n          Ahead of him, a monstrous CARLIN LINEBACKER closes in on him\r\n          with murder in his eyes.\r\n\r\n                         RA\r\n          Look out !\r\n\r\n          THE LINEBACKER'S P.O.V. --\r\n          All the PHOTOGRAPHERS on the sideline have their CAM g\r\n          FLASHES flare in unison, without their snapping them!\r\n          The blinded LINEBACKER plows into the SIDELINE PHOTOGRAPHER\r\n          JESSE scores a touchdown.\r\n          And the CROWD goes berserk as the BULLDOGS throw their\r\n          helmets in the air.\r\n\r\n                         MONICA\r\n\r\n                         (STUNNED)\r\n          You gotta be... wow.\r\n          RACHEL stands there, open-mouthed, relieved, but unsure if\r\n          she had anything to do with what just happened.\r\n\r\n          INT. LOCKER ROOM - NIGHT\r\n\r\n          The Bulldogs are still whooping it up as COACH WALSH\r\n          approaches JESSE.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          87.\r\n\r\n                         WALSH\r\n          Ryan, Notre Dame scout's-here,\r\n          wants to talk to you first.\r\n          JESSE nods, turns to BRAD.\r\n\r\n                         JESSE\r\n          Brad, can you tell Rachel I'll be\r\n          out soon? Have her wait for me.\r\n\r\n          INT. STADIUM CORRIDOR - N\r\n\r\n          RACHEL and MONICA stand in the hoard waiting for the players.\r\n          TRACY passes, soggy, muddy, yet still radiating a cool\r\n          confidence in her beauty. She gives RACHEL, a shark's smile.\r\n          BRAD exits the locker room, goes to RACHEL's side.\r\n\r\n                         BRAD\r\n          It's gonna be a while, Jess is talkin'\r\n          to the scout, he said for you to go\r\n          ahead to the party.\r\n\r\n                         MONICA\r\n\r\n                         (WARMLY)\r\n          Rachel, did you hear that, Jesse's\r\n          talking to the scout, isn't that great?\r\n\r\n                         RACHEL\r\n          Yeah.\r\n\r\n                         MONICA\r\n          C'mon, I'll give you a ride to Mark's.\r\n\r\n          EXT. RACHEL'S HOUSE - NIGHT\r\n\r\n          SUE drives up with BARBARA to RACHEL's tiny, run-down house.\r\n\r\n                         BARBARA\r\n          No, this couldn't be it. Rachel said\r\n          it was a real nice house, surrounded\r\n          by trees, with a pool in the back.\r\n\r\n                         SUE\r\n          I guess she didn't want to worry you.\r\n\r\n          INT. RACHEL' BEDROOM - NIGHT\r\n\r\n          The bedroom door is opened by EMILYN. SUE and BARBARA stand\r\n          behind her.\r\n          They find WALTER, alone on the bed, blinking awake.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          88.\r\n\r\n          MARK BING'S HOUSE - NIGHT\r\n          An upper-class home built in the international style of\r\n          fieldstone and gray-stained wood. The house is set back from\r\n          the road, surrounded by trees, with a pool in the back.\r\n          A herd of parked cars and throbbing music indicate MARK's\r\n          party is at full tilt.\r\n\r\n          INT. MARK BING'S HOUSE - NIGHT\r\n\r\n          CLOSE ON -- a 36-INCH TV playing psychedelic music videos and\r\n          Japanese anima.\r\n          WIDEN -- to reveal a DANCING'CROWD in a dimly lit, split-\r\n          level living room with exposed wooden beams.\r\n          There's a large, roaring fireplace and a Jackson Pollock\r\n          splatter PAINTING hangs opposite. Sliding glass doors\r\n          overlook the backyard patio and swimming pool.\r\n          CHUCK cuts through, sees someone jostle a table lamp.\r\n\r\n                         CHUCK\r\n          Careful! Don't break anything, or\r\n          Mark'll have my head on,a plate.\r\n\r\n          EXT. MARK'S HOUSE - NIGHT\r\n\r\n          MONICA leads RACHEL up the walkway to the front door where a\r\n          BEEFY BOY plays doorman. ARNIE and two geeky YOUNGER BOYS\r\n          mill outside the door, trying their damndest to look cool.\r\n\r\n                         ARNIE\r\n          Hey, Monica, can ya get us into the\r\n          party?\r\n\r\n                         MONICA\r\n          Sure, Arnie, wait here. I'll come\r\n          back for ya.. .\r\n          And she waltzes past him.\r\n\r\n                         MONICA (CONT'D)\r\n          . in two or three years.\r\n          ARNIE points at a passing RACHEL.\r\n\r\n                         APISI E\r\n          How come she gets to go in?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         MONICA\r\n          (rais6s a toast)\r\n          To new friends.\r\n          They raise their glasses and RACHEL joins in with a hesitant\r\n          smile. Their glasses clink together for the...\r\n\r\n                         CUT TO:\r\n\r\n          EXT. STADIUM PARKING LOT - NIGHT\r\n\r\n          JESSE crosses the near empty lot, hair wet from his shower.\r\n          He stops dead.\r\n\r\n                         JESSE\r\n          Damn it.\r\n          Under a pool of lamplight -- HIS CAR has had its tires\r\n          slashed and someone has sprayed in red Carlin uies!â\u0096 \r\n          across the door.\r\n          TRACY pulls up in. her BMW, wearing her cheerleading outfit.\r\n\r\n                         TRACY\r\n          Oh, wow, that sucks. Further proof\r\n          Carlin guys are gravy sucking pigs.\r\n\r\n                         JESSE\r\n          Yeah.\r\n\r\n                         TRACY\r\n          Need a ride?\r\n\r\n                         JESSE\r\n          You goin' to Mark's?\r\n\r\n                         TRACY\r\n          Wouldn't miss it. Hop in.\r\n          As he gets into her car, TRACY has one hand on the wheel, the\r\n          other hanging out her window. She drops something as JESSE\r\n          closes the door.\r\n          REVEAL a CAN of red spray paint TRACY dropped onto the\r\n          parking lot's tarmac.\r\n\r\n                         TRACY\r\n          Just a quick stop at my house,\r\n          want to change my outfit.\r\n          Her car pulls off...\r\n\r\n          WIPING THE FRAME TO,\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          91.\r\n\r\n          INT. MARK'S HOUSE - NIGHT\r\n\r\n          RACHEL and MONICA chat with AMY and two other PATIO GIRLS.\r\n          AMY takes RACHEL 's hand.\r\n\r\n                         AMY\r\n          I really like your nail color.\r\n\r\n                         MONICA\r\n          Check out the tattoo on her arm\r\n          wild huh?\r\n\r\n                         AMY\r\n          Yeah. Did that hurt?\r\n\r\n                         RACHEL\r\n          No. Well, yeah, actually some.\r\n\r\n                         AMY\r\n          Oh, it's just too cool.\r\n\r\n                         MONICA\r\n          I'm dying to get one, but my mom\r\n          would have a shit fit.\r\n\r\n                         AMY\r\n          So would mine. She says I'm not\r\n          that type of gi rl.\r\n\r\n                         RACHEL\r\n          What type is that?\r\n          There's an awkward pause which MONICA breaks.\r\n\r\n                         MONICA\r\n          A slut.\r\n          (throws an arm around Rachel)\r\n          That's why you should take all\r\n          of us in for tattoos!\r\n          AMY and the other GIRLS laugh. RACHEL softens, joining in.\r\n          She looks around at everyone at the party, laughing, dancing.\r\n          The shiny, happy people. it feels weird, but here she is.\r\n          She smiles, takes a sip of her drink.\r\n          By the stereo, MARK cranks up the music as CHUCK dances over\r\n          to AMY, pulls her into the dancing CROWD. BRAD grabs MONICA.\r\n\r\n                         BRAD\r\n          C'mon, wench, let's dance.\r\n          He pulls MONICA into the crowd, and she gestures for RACHEL\r\n          to join them.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          92.\r\n\r\n                         RACHEL\r\n          No, I'd rather wait for Jesse.\r\n\r\n                         MONICA\r\n          Oh, c'mon, Rachel. He'd want you\r\n          to have fun.\r\n\r\n                         AMY\r\n          Yeah, c'mon, Rach.\r\n          There's a chorus of \"C'mon, Rachel\" from the guys and some of\r\n          the other DANCERS join in. An embarrassed RACHEL surrenders,\r\n          sets down her drink and enters the dancing group.\r\n\r\n                         MONICA\r\n          All right, girl.\r\n          RACHEL smiles. BRAD starts dancing before RACHEL.\r\n          SLOW MOTION -- CLOSE on RACHEL's face, dancing, beaming. For\r\n          a few moments, everything seems perfect. And she throws her\r\n          head back and laughs.\r\n          MARK dances into the group.\r\n\r\n                         MARK\r\n          Hey, Chuckzilla, why don't you\r\n          put on the highlights tape?\r\n\r\n                         CHUCK\r\n          You mean tonight's game?\r\n          MARK shares a laugh and a glance with MONICA and B\r\n\r\n                         MARK\r\n          Yeah, tonight's game.\r\n\r\n                         CHUCK\r\n          Okay. Let's go to the videotape:\r\n          He dances out of the group over to the VCR where he pops out\r\n          a tape and inserts a tape marked \"Bulldogs Highlights\".\r\n          RACHEL turns around, sees the large screen TV PLAYING images\r\n          of the Bulldogs playing football.\r\n\r\n                         RACHEL\r\n          Is that tonight's game?\r\n\r\n                         MARK\r\n          No, it's the other game.\r\n          Still dancing, she turns back to the group.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          93.\r\n\r\n                         RACHEL\r\n          What other game?\r\n\r\n                         MARK\r\n          The game you were in.\r\n          The others laugh. She smiles, confused.\r\n\r\n                         RACHEL\r\n          What?\r\n\r\n                         BRAD\r\n          The one you played.\r\n\r\n                         MARK\r\n          Yeah, yeah, what was the score?\r\n          Chuckie, pass me the scoreboard,\r\n          I wanna show Rachel how she helped\r\n          Jesse win the game.\r\n          CHUCK pulls the BLACK NOTEBOOK next to the CD's off a shelf,\r\n          pretends he's a quarterback hiking a ball.\r\n          Twenty-four, twenty-six, hut, hut,\r\n          hut.\r\n          He drops back to pass the NOTEBOOK.\r\n\r\n                         CHUCK\r\n          Go long, Bradzilla.\r\n          MARK laughs as BRAD circles around RACHEL, twists between\r\n          other dancers. CHUCK tosses the NOTEBOOK over RACHEL and\r\n          BRAD leaps up to catch it.\r\n\r\n                         BRAD\r\n          Post-pattern, Mark!\r\n          Ducking around DANCERS, MARK raises his hands for the pass.\r\n          KIDS start to notice their antics and start laughing.\r\n          BRAD passes the book over to MARK who catches it, mimes\r\n          spiking it for a touchdown and does a silly victory dance.\r\n          MONICA laughs and turns to RACHEL, who laughs, even though\r\n          she still looks a bit befuddled.\r\n\r\n                         MARK\r\n          Rachel, catch!\r\n          He throws the NOTEBOOK through the air, where it tumbles end\r\n          over end for a few slow beats, then is caught by her.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          94.\r\n\r\n          BEHIND RACHEL --\r\n           THE TV SET -- keeps playing football highlights, but suddenly\r\n          there's an almost subliminal --\r\n          FLASH of TWO INTERTWINED BODIES.\r\n          RACHEL holds the NOTEBOOK, unsure of what to do with it. The\r\n          boys are a little out of breath, but still grinning and\r\n          dancing.\r\n\r\n                         MARK\r\n          Open it. Go 'head, read off the\r\n          scores.\r\n\r\n                         BRAD\r\n          Start with Eric.\r\n\r\n                         CHUCK\r\n          Yeah, start with poor Eric.\r\n          She opens the book, looks at the pages with a quizzical\r\n          expression. She sees the Bulldog names across the top of the\r\n          page with lists of girls beneath each one. Every girl has a\r\n          number next to her with a total at the bottom.\r\n\r\n                         MARK\r\n          What's Eric's score?\r\n\r\n                         RACHEL\r\n          Twenty-two?\r\n          RACHEL stops dancing as she spots LISA PARKER's name at the\r\n          bottom of ERIC's column with the number four next to it.\r\n\r\n                         MARK\r\n          What's up, Rach? You know someone on\r\n          that list?\r\n\r\n                         RACHEL\r\n          (under her breath)\r\n          Lisa.\r\n\r\n                         MARK\r\n          Oh, yeah, Lisa, forgot about her.\r\n\r\n                         CHUCK\r\n          How many points was she?\r\n\r\n                         BRAD\r\n          Four. But maybe he shoulda lost\r\n          those when she offed herself.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          95.\r\n\r\n                         MARK\r\n          Rach, look under Jesses's name, how\r\n          many points you get?\r\n\r\n                         MONICA\r\n\r\n                         (CHEERLEADING)\r\n          Two, four, six, eight--\r\n\r\n                         AMY\r\n          Who do we appreciate!\r\n          RACHEL looks down JESSES's column sees-her name with thirty\r\n          points next to it, then, above hers, sees TRACY with ten.\r\n\r\n                         MARK\r\n          No, more than that, remember, we\r\n          thought Rach was a dyke. He got\r\n          extra-points for the conversion.\r\n\r\n                         BRAD\r\n          points?\r\n          Try thirty.\r\n          RACHEL stares at the book, stunned, trying to make sense of\r\n          it.\r\n\r\n                         MONICA\r\n          Look at her face, this is priceless.\r\n          At the front door, JESSE walks in, TRACY behind him. He\r\n          looks around, hasn't seen what's going on yet. ERIC\r\n          intercepts him, turning JESSE away from the TV.\r\n\r\n                         ERIC\r\n          Hey, man, what did the scout say?\r\n          Behind Rte...\r\n          THE TV SET -- between shots of players grunting, tackling\r\n          and smashing into each other, longer and longer segments\r\n          appear of...\r\n\r\n          A COUPLE MAKING LOVE --\r\n          from the waist up, with thick scan lines that almost make it\r\n          look surreal. It's obvious that the girl is RACHEL, and the\r\n          boy is JESSE.\r\n          DANCING KIDS notice what's on the TV and start to point and\r\n          laugh at the set. RACHEL is completely unaware of what's\r\n          going on behind her.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         9\r\n\r\n                         MARK\r\n          See, we didn't think Jess could do i\r\n          so he offered to get evidence, proof\r\n          that he'd scored you.\r\n\r\n                         MONICA\r\n          Here comes Jesse's big play!\r\n\r\n                         MARK\r\n          Lookie, lookie, Rachel.\r\n          RACHEL realizes people are watching something behind her,\r\n          then laughing at her. She turns and sees...\r\n          The IMAGES of her and JESSE on the TV.\r\n          Her face goes slack with horror.\r\n\r\n                         RACHEL\r\n          Oh, God\r\n          MARK leans in to RACHEL, who hasn't noticed JESSE.\r\n\r\n                         MARK\r\n          Jess was disappointed with the picture\r\n          quality, but I told him it was better\r\n          than Pam and Tommy Lee's tape.\r\n\r\n                         CK\r\n          Rach, was it good for you too?\r\n          Sure looks like it, don't it?\r\n\r\n                         MARK\r\n          Why don't we ask Jesse?\r\n          He turns and calls out.\r\n\r\n                         MARK (CONT'D)\r\n          Hey, Jesse! Over here!\r\n          JESSE looks over and his eyes meet RACHEL's, but she just\r\n          stares back, horrified. Then he sees the TV set behind her\r\n\r\n                         JESSE\r\n          What...\r\n          JESSE pushes his way through the crowd, trying to get to\r\n          RACHEL. TRACY throws an arm around him, kisses his neck.\r\n\r\n                         TRACY\r\n          He told me he was thinking of me\r\n          when he fucked you.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          97.\r\n          Seeing MARK laughing, JESSE realizes what's going on.\r\n\r\n                         JESSE\r\n          Rachel...\r\n          He tries to shrug off TRACY, but ERIC and CHUCK grab his arms\r\n          and pull him back into the crowd.\r\n\r\n                         JESSE\r\n          Rachel!\r\n          MARK pushes RACHEL towards BRAD.\r\n\r\n                         MARK\r\n          Rachel! Rachel!\r\n          She tries to get away, but BRAD pushes her into MONICA who\r\n          shoves her to AMY as they join in the chanting.\r\n          Rachel!\r\n\r\n                         MONICA\r\n          Rachel!\r\n          Rachel!\r\n          Drowning out JESSE's cries.\r\n          RACHEL's P.Q.V. -- spinning around. A NIGHTMARISH GALLERY of\r\n          dancing, jostling torsos, TWISTED FACES and LAUGHING MOUTHS,\r\n          smirking and pointing at her.\r\n\r\n                         INTERCUT WITH:\r\n\r\n                         FAST CLOSE-UPS\r\n          of RACHEL and JESSE making love. The assault of music,\r\n          chanting and images crescendo with...\r\n          BRAD grabbing RACHEL's bare arm below her HEART-THORN TATTOO\r\n          forcing her to face the TV screen.\r\n\r\n                         BRAD\r\n          Hey, is that a zit on your ass?\r\n          RACHEL has tears streaming down her face for the first time\r\n          since she was four years old.\r\n          She bows her head.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          98.\r\n\r\n          A LAUGHING BRAD\r\n          glances down at RACHEL's arm.\r\n          The THORN VINE around the HEART TATTOO looks bigger, edging\r\n          up her arm.\r\n          He looks away, shares a laugh with MARK, looks back and...\r\n\r\n          THE HEART TATTOO\r\n          on RACHEL's upper arm is growing, etched from within, the\r\n          thorn covered vine snaking like a tendril up her arm.\r\n\r\n                         BRAD\r\n          Holy shit.\r\n          He releases her.\r\n          RACHEL raises her head, eyes glowing with pain and rage, her\r\n          broken heart turned to stone.,\r\n          The delicate THORN VINE has grown across her chin, cheekbone\r\n          and forehead, swirling around to end on her other cheek.\r\n          A stunned BRAD backs away from her.\r\n          JESSE breaks free of ERIC's grip, slugs CHUCK and pushes his\r\n          way towards RACHEL.\r\n          Her HEART POUNDS at an alarming rate as she slowly turns and\r\n          sees JESSE coming at her, his arms out to take her in his\r\n          embrace.\r\n\r\n                         A KNIFE\r\n          on the bar dances and rattles, then...\r\n          A WHIP PAN finds...\r\n          JESSE, as his back arches in pain and he screams. The KNIFE\r\n          embedded in his open palm, nailing his hand to the wall.\r\n          MARK and the other boys stare in shock.\r\n\r\n                         MARK\r\n          What the fuck?\r\n          ON JESSE -- as he screams again.\r\n          A CORKSCREW has pierced his other hand, at waist level. The\r\n          SCREW spins around, burrowing into his flesh.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          99.\r\n          Everyone on that side of the room stops dead, taking in the\r\n          bizarre sight.\r\n          RACHEL straightens up and...\r\n          The kitchen door CLOSES...\r\n          The glass doors to the back yard slide SHUT...\r\n          The front door SLAMS.\r\n\r\n                         TRACY\r\n\r\n                         (LOOKING AROUND)\r\n          What's going on Mark?\r\n          I dunno.\r\n          The floor starts to shake like a small earthquake. All the\r\n          PARTYGOERS go still, looking around at each other. The room\r\n          is frozen, even though the music keeps pounding.\r\n          MARK looks at RACHEL, her disheveled hair partially obscures\r\n          her features, but her eyes are glowing.\r\n\r\n          THE GLASS WINDOWS\r\n          surrounding the room, begin to RATTLE, then CRACK in a spider-\r\n          web pattern. Then...\r\n          THE WINDOWS BURST inward.\r\n          FOLLOW the deadly hail of shards as they cut through the\r\n\r\n          CROWD.\r\n          FROM ABOVE -- The outer edge of the CROWD are mowed down as\r\n          if by a machine gun and...\r\n          A WHIP PAN -- Finds a BOY impaled by a large, jagged shard.\r\n\r\n                         TWISTED SHADOWS\r\n          are splayed across a wall of KIDS falling to the ground. The\r\n          hard-edged music keeps playing while...\r\n          CHUCK's decapitated head rolls across the floor and onto...\r\n          A plate.\r\n          The BEEFY BOY spins around, clutcning at a shard protruding\r\n          from his neck, his carotid artery spewing blood like a lawn\r\n          sprinkler.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          100.\r\n          On a GIRL as his blood sprays across her face and...\r\n          The BOY turns, arcing blood across...\r\n          The Jackson Pollock PAINTING, which blends into the multi-\r\n          colored canvas.\r\n          Reeling into the stereo, the BOY scatters CDs everywhere.\r\n          On RACHEL, clothes spattered red, tears streaming down her\r\n          cheeks.\r\n          TRACY straightens up, having been protected by MONICA, who`s\r\n          screaming, her face a lacerated pulp with glass, shards\r\n          sticking out of it like a pincushion.\r\n          Surviving PARTYGOERS panic as they struggle to their feet and\r\n          try to flee, stampeding over each other.\r\n          , TRACY, ERIC and BRAD shove their way through the crowd.\r\n\r\n          EXT. MARK'S HOUSE - NIGHT\r\n\r\n          As SUE and BAR.BA k leap from the Volvo.. SUE hears the\r\n          screams from within the house, takes in the shattered\r\n          windows.\r\n\r\n                         SUE BARBARA\r\n          Oh, not Rachel!\r\n          They race to the door as...\r\n\r\n          WITHIN THE HOUSE\r\n          BRAD runs to the front door.\r\n          An IRON FIREPLACE POKER lifts up one end, then flies like a\r\n          javelin towards BRAD's back as...\r\n\r\n          DOOR - N\r\n          BARBARA and SUE approach the door when the end of the\r\n          bursts from the center of it, nearly spearing a surprised\r\n          BARBARA in the face as it sticks out about a foot.\r\n          She jerks back, then pushes the door open with an effort.\r\n\r\n          WITHIN THE HOUSE --\r\n          They enter and freeze as the door slams shut behind them,\r\n          revealing a dead BRAD speared through the throat, pinned to\r\n          the door.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          101.\r\n          Oai, my god. Where's Rachel?\r\n          They see JESSE, then RACHEL covered in tattoos.\r\n          A panicked itMY smashes into BARBARA, then runs toward a\r\n          window.\r\n          RACHEL sees AMY and her eyes narrow...\r\n          MUSIC CDs fly off a shelf and...\r\n          Spin through the air at high velocity.\r\n          One of the deadly frisbees buries itself in AMY's back,\r\n          spinning her around. More CDs embed in her stomach, chest\r\n          and throat.\r\n          MARK and ERIC smash their way through the chaos as MARK's\r\n          eyes flash from a collapsing AMY to RACHEL\r\n\r\n                         MARK\r\n          God, it'ls her! She's doing it!\r\n          SUE moves towards RACHEL.\r\n\r\n                         SUE\r\n          Stop! Stop it!\r\n          RACHEL has her gaze locked on...\r\n          MARK, who realizes he's a dead man. He moves toward a\r\n          shattered window, through which some PEOPLE escape.\r\n          But RACHEL turns her head slightly and...\r\n          A TELEKINETIC PULSE travels across the row of LIQUOR BOTTLES\r\n          at the bar, exploding them one-by-one, spraying alcohol which\r\n          douses SUE.\r\n          A FLAMING LOG erupts from the fireplace...\r\n          Striking the alcohol-drenched BAR, setting a blazing trail\r\n          and lighting the curtains on fire, creating a wall of FLAMES\r\n          before the windows.\r\n\r\n                         SUE\r\n          Stop it! You don't want to--\r\n           And RACHEL snaps her head around, launching another LOG from\r\n           the fireplace which strikes SUE in the back, whose alcohol\r\n          drenched clothes catch flames... and she , A.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          102.\r\n          A screaming SUE pitches forward, rolls on the floor to put\r\n          out the flames, but caly succeeds in lighting another trail\r\n          of liquor which creates a barrier to the backyard windows.\r\n          In the eye of the storm is BARBARA, shaking her head in\r\n          denial, muttering, as her mental state rapidly deteriorates.\r\n\r\n                         BARBARA\r\n          No, this isn't happening. It isn't\r\n          happening, isn't happening...\r\n          MARK pulls ERIC by the shirt collar and they careen down...\r\n\r\n                         A HALLWAY\r\n          where each of the DOORS ahead of them SLAM SHUT as they\r\n          approach.\r\n          Utter CHAOS, but RACHEL calmly turns into the hallway,\r\n          following MARK, as if in a trance.\r\n\r\n                         I\r\n\r\n                         MARK\r\n          lowers his shoulder, crashes through a closing door into.\r\n\r\n                         A DEN\r\n          where the walls are decorated with deer heads and hunting\r\n          trophies. MARK and ERIC are smashing a standing glass case\r\n          containing pistols and rifles.\r\n          TRACY leans panting against the wall.\r\n          MARK slips a HANDGUN into his belt.\r\n\r\n                         TRACY\r\n          Screw that, get the shotguns!\r\n          Shaking, freaked out, they gather weapons.\r\n\r\n                         THE HALL\r\n          d ERIC see RACHEL the end of the hall, silhouetted\r\n          from behind. They take off in the other direction, TRACY\r\n          bringing up the re\r\n          Barrelling shoulders first into a door, the boys burst\r\n          through and into...\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          103.\r\n\r\n          EXTâ\u0080¢ THE BACK YARD - NIGHT\r\n          Where they almost stumble into the swimming pool.\r\n          Toting their rifles, MARK, ERIC and TRACY turn to find\r\n          RACHEL, at a gunfighter's distance, coming towards them.\r\n          TRACY and BRAD cock their weapons and bring them to their\r\n          shoulders. TRACY slips on her glasses.\r\n\r\n                         MARK\r\n          Wait till she's closer.\r\n          TRACY tightens her finger on the trigger.\r\n          RACHEL's eyes narrow and...\r\n          TRACY's glasses shatter into her eyes, spewing blood\r\n          milky fluid.\r\n          Aaaaa...\r\n          She staggers, fires her shotgun into ERIC's groin and he\r\n          lands sitting next to the pool. A dying ERIC stares at his\r\n          shredded lap, then falls over.\r\n          MARK looks at his dead friend.\r\n          Oh, shit.\r\n          .recovers, and swings his aim back at RACHEL. But his\r\n          rifle goes sailing over his head and into the grass twenty\r\n          feet behind him.\r\n          He makes eye-contact with a grim RACHEL advancing toward him,\r\n          and hauls ass.\r\n          RACHEL glances at a coiled GARDEN HOSE and it springs to\r\n          life, slithering through the grass and across the concrete at\r\n          high speed to wrap around MARK's ankle and trip him up.\r\n          He hits the ground hard and rolls over to find the hose\r\n          twisting around his legs and up his waist like a python.\r\n\r\n                         HIS HAND\r\n          grasps for the rifle, but falls short as the hose pins his\r\n          other arm to his side, then curls around his windpipe in a\r\n          stranglehold.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          104.\r\n          His eyes widen as the life is squeezed from him and he sees\r\n          RACHEL standing over him.\r\n          He gropes for the shotgun again... and finally grabs it.\r\n          RACHEL looks at the rifle and it flies from his hold,\r\n          splashing into the pool.\r\n          But she jolts on two...\r\n\r\n                         GUNSHOTS\r\n          RACHEL looks down. MARK had pulled the handgun from his belt\r\n          with his pinned hand and fired.\r\n          She's holding her belly, gutshot, staggers and falls into the\r\n          pool, disappearing amid a swirl of blood.\r\n          MARK yanks the hose from his neck as it goes slack. He\r\n          gasps, points the gun into the pool and FIRES until it's\r\n          silent and he's left pulling the trigger on empty chambers.\r\n          He gets his breatking under control, leans over to look into\r\n          the water of the deep end. He Aar on the sound of a\r\n          mechanical whirring, and turns.\r\n          A POOL COVER starts to unfold.\r\n          At that moment...\r\n\r\n          RACHEL'S BLOODY ARM\r\n          bursts from the water and grips his neck. MARK grabs her\r\n          forearm as her other arm yanks him into the pool.\r\n\r\n                         UNDERWATER --\r\n          As RACHEL drags MARK down, he kicks and pummels her, but she\r\n          holds on. The POOL COVER steadily closes over them, shutting\r\n          out the light from above.\r\n          MARK finally frees himself and lunges for the surface, but\r\n          the POOL COVER blocks his escape.\r\n          He desperately pushes at it, eyes bulging, lungs burning, as\r\n          his feet kick to keep him afloat.\r\n\r\n          ON THE SURFACE --\r\n          The POOL COYER closing as RACHEI, hauls herself from the\r\n          water, barely making it out. MARK'S HAND, grabs her leg,\r\n          slides, then clutches at the edge of the pool. His fingers\r\n          slip under as the cover completely shuts.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          105.\r\n          M RX's head bulges the POOL COVER, then his hands punch\r\n          feebly at it a few times. Then... nothing.\r\n\r\n          BARBARA (O.S.)\r\n          Rachel!\r\n          A weakened RACHEL lays by the pool. She seems to be snapping\r\n          out of her trance as she rolls over and sees BARBARA.\r\n          RACHEL shudders and suddenly just looks like a wet, scared\r\n          little girl reaching for her mother.\r\n\r\n                         RACHEL\r\n          Mama. Maury?\r\n          BARBARA'S P.O.V. o\r\n          but it's a FOUR-YEAR-OLD RACHEL, pristine, without tattoos.\r\n          BARBARA blinks and her P.O.V. is of a TEN-YEAR-OLD RACHEL,\r\n          reaching for her.\r\n          Mama, please.\r\n          BARBARA blinks and it's now...\r\n          The 17-YEAR-OLD RACHEL, covered in blood and tattoos.\r\n          She looks her daughter in the eyes, backs away in terror.\r\n\r\n                         BARBARA\r\n          What are you? You're not my little\r\n          girl. No. The devil's in you.\r\n\r\n                         RACHEL\r\n\r\n                         (CRYING)\r\n          Don't leave me, mama.\r\n          But her mother disappears into the shadows.\r\n\r\n                         RACHEL\r\n          Please, I don't have... anyone.\r\n          She rolls onto her back, looks up at the STARRY NIGHT.\r\n\r\n                         RACHEL\r\n          Please, God, let me die...\r\n          And she tightly shuts her eyes.\r\n\r\n          DISSOLVE BACK TO:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          106.\r\n\r\n          THE LIVING ROOM\r\n          A vision of hell -- crimson-stained walls and piled bodies.\r\n          The fire is spreading, licking its way across the burning\r\n          SCOREBOARD NOTEBOOK, and along the floor toward...\r\n          JESSE, in pain, still pinned to the wall. He raises his head\r\n          and starts in fear as...\r\n          o the center of the room, facing him.\r\n          He sees the gunshot wounds in her stomach, then follows her\r\n          gaze to...\r\n\r\n          THE TV SET\r\n          with a cracked screen, but still playing the tape of their\r\n          intimate moment at the cabin, with a sleeping RACHEL laying\r\n\r\n                         ON JESS\r\n          He looks back at her.\r\n\r\n                         JESSE\r\n          Rachel, listen. I swear, d\r\n          know they were taping us. d\r\n          never hurt you.\r\n          She looks at his pleading eyes.\r\n\r\n                         JESSE\r\n\r\n                         I LOVE--\r\n          The TV SET now has the video footage of...\r\n\r\n          INT. THE CABIN - NIGHT\r\n\r\n          JESSE looks at RACHEL clinging to him, asleep, peaceful. He\r\n          gently runs his fingers across her brow.\r\n\r\n                         JESSE\r\n\r\n                         (SOFTLY)\r\n          I love you .\r\n          And oulls her closer.\r\n\r\n          HACK TO -- -\r\n          RACHEL staring at the TV. And the VCR rewinds and replays..\r\n          ON TV -- the moment of JESSE saying 'I love you\" to her while\r\n          she was asleep.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          107.\r\n          RACHEL falls to her knees, tears running down her face. She\r\n          turns back to JESSE, amazed.\r\n          A BLAZING CHUNK of ceiling falls near her.\r\n\r\n                         JESSE\r\n\r\n                         (COUGHS)\r\n          Rachel. Gat out, now. Go.\r\n          And the KNIFE and the CORKSCREW drop away, releasing him.\r\n          He falls to the floor, drags himself over... and takes RACHEL\r\n          in his arms. He cradles her. She whispers and he bends over\r\n          to hear. She whispers again...\r\n\r\n                         RACHEL\r\n          .love you.\r\n          JESSE tenderly kisses her lips.\r\n          And all the TATTOOS fade from her face and body\r\n          Love.\r\n          Her face is serene.\r\n          JESSE traces his fingers across her brow, embraces her, the\r\n          flames start to encircle them, just like in RACHEL's\r\n          nightmare.\r\n          JESSE pulls RACHEL over the debris ridden floor toward the\r\n          back windows, but stumbles and goes down. Her eyes flutter\r\n          open.\r\n\r\n                         RACHEL\r\n          Leave. Get out\r\n          Instead of leaving her, JESSE hugs RACHEL closer. The sleeve\r\n          of his jacket catches flames. And he accepts his fate.\r\n          RACHEL shuts her eyes, gives one last TELEKINETIC PUSH...\r\n\r\n          EXT. THE BACKYARD - NIGHT\r\n\r\n          And a BODY is flung out the back window like a rag doll,\r\n          clothes in flames.\r\n          The BODY goes fifteen feet and falls onto the pool cover, its\r\n          weight bowing the cover enough for water to rush over it.\r\n\r\n                         BACK T0:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          108.\r\n\r\n          INTâ\u0080¢ THE LIVING ROOM - NIGHT\r\n          RACHEL on her back, looking up, eyes open, a slight smile on\r\n          her lips.\r\n\r\n          SHE SEES --\r\n          The BURNING CEILING collapse, raining death on her.\r\n\r\n          EXT. THE HOUSE - NIGHT\r\n\r\n          .is now a burning inferno. A funeral pyre.\r\n\r\n          BACK YARD - THE POOL\r\n          At water level. All is quiet, there's only the sounds of the\r\n          crackling fire and faraway sirens of firetrucks. Suddenly --\r\n          JESSE HURTS up on the --\r\n\r\n                         CUT TO:\r\n\r\n          EXT. THE HILL - NIGHT\r\n\r\n          From miles away -- the LIGHT given off by the BURNING HOUSE\r\n          rises over the treeline.\r\n\r\n                         CLOSE ON\r\n          A dejected ARNIE and the two uncool BOYS who couldn't get\r\n          into the party, leaning against a van, staring in amazement.\r\n\r\n                         ARNIE\r\n          Man, we are missing one killer party.\r\n\r\n          FADE TO BLACK:\r\n          And the peaceful sound of CRICKETS for the...\r\n\r\n          SUP : NOTRE DAMS' LINIVER.STTY - QNE YEAR LATER\r\n\r\n          FAD; IN TO:\r\n\r\n          EXT. NOTRE DAM UNIVERSITY - NIGHT\r\n\r\n          A CHURCH TOWER with a BELL overlooks the student dorm\r\n          buildings. The darkened campus is tranquil, still.\r\n\r\n          INT. HALLWAY, STUDENT DORM BUILDING - NIGHT\r\n\r\n          MOVING down a. dormitory hall. The room doors feature rock\r\n          posters and \"Fighting Irish\" stickers and pennants.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          109.\r\n\r\n          INT. DORM ROOM - NIGHT\r\n\r\n          JESSE is slumped over, asleep on a desk layered in textbooks\r\n          and a notebook. An all-night study session.\r\n          His hair is shor., he's wearing a beard. His face is more\r\n          mature, sadder. The beard largely hides some burn scars on\r\n          one side of his face.\r\n          Over the desk is a MIRROR and a \"Fighting Irish\" pennant.\r\n          The only light comes from his desk lamp.\r\n          He jerks awake with a spasm, glances at a digital clock\r\n          glowing on his desk: 11:S$ A.M.\r\n\r\n                         JESSE\r\n          (rubs his eyes)\r\n          Jesus.\r\n          WALTER, Rachel's dog, hops on his lap, licks at.his face.\r\n          The sad-eyed DOG whimpers'and,JESSE scratches him.\r\n          In the distance the CLOCK TOWER BELL can be heard CHIMING\r\n          MIDNIGHT: One, two...\r\n          As JESSE looks down and his eyes widen in surprise:\r\n          Somehow, he's scrawled on the notebook paper on the desk in\r\n          front of him:\r\n          kINg of HELL\r\n          Or, if you only look at the capitalized letters, it reads:\r\n          Around it, the same phrase is written over and over again:\r\n          kINg of HELL kINg of HELL kINg of HELL\r\n          kINg of HELL kINg of HELL kINg of HELL\r\n          kINg of HELL kINg of HELL\r\n          JESSE lowers the dog\r\n          How did...\r\n          Trails off as he stares at the page.\r\n          The CLOCK BELL in the background is still CHIMING: give, six,\r\n          seven and...\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          110.\r\n          T h e F R E N C H DOORS fly o behind JESSE. ns.\r\n          It's the wind. The DOG starts barkin\r\n\r\n                         JESSE\r\n          (shushes the dog)\r\n          Ssshhhh. Relax, boy.\r\n          He takes a-deep breath, flips the page on the notebook,\r\n          resumes his cram session.\r\n          On the floor, the DOG looks at the open French doors, then\r\n          scurries under the bed.\r\n          JESSE is writing, in the MIRROR above h\r\n          A WOMAN' s FIGURE\r\n          anding in the French doors, her face hidden\r\n          up, sees the WOMAN reflected, spins to watch\r\n          her stop forward into the light.\r\n          It's RACHEL, in hAk slip dress.\r\n\r\n                         JESSE\r\n\r\n                         (STUNNED)\r\n          Rachel?\r\n          RACHEL smiles. She lifts her arms to him.\r\n\r\n                         JESSE\r\n          (with growing joy)\r\n          Rachel.\r\n          He rises, envelops her in his arms, and kisses her.\r\n          He pulls back to take her in.\r\n          T!!s two of thaw are reflected in ANOTHER MIRROR behind the\r\n          r 's door.\r\n          opens her mouth to speak --\r\n\r\n          A LARGE SNAKE\r\n          FLIES out and jams itself into JESSE's mouth, throwing him\r\n          back.\r\n          Ho aacs. clutching at the SNAKE as it slithers down his\r\n          throat, and qmIS'3i$ into the desk and mirror, shattering it\r\n          on the --\r\n\r\n          SLAM CUT TO\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n          INT . DORM ROOM, NOTRE DAME - NIGH a'\r\n          A LOUD SCREAM as JESSE jerks awake at his desk. His heart\r\n          FATIM like it's about to explode from his mouth.\r\n          He looks down at the paper in front of him. Filled only with\r\n          his study notes.\r\n          The dog, WALTER, is awake on the bed, blinking, having been\r\n          stirred by the scream.\r\n\r\n                         JOS\r\n          He recovers, runs his hands through his hair. Starts\r\n          reading.\r\n          The DIGITAL CLOCK reads: 11:59 A.M.\r\n          In the distance, the CLOCK BELL begins'chiming midnight: One,\r\n          three...\r\n          JESSE reads, but in his ayes he's waiting for the savant\r\n          chime.\r\n          The BELL CHIMES: Four\r\n          The FRENCH DOORSNinat\r\n          JESSE spins. The wind. Nobody there.\r\n          He turns back to his reading, his heart BEATING WILDLY again.\r\n          Glances up at the mirror. Nothing.\r\n          His HEARTBEATS and the BELL CHIMES get increasingly LQ=\r\n          as,.. .\r\n          He reads, glances up at the mirror, shivers, and it isn't\r\n          in the cold.\r\n\r\n          Move, to ANOTHER ANGLE :\r\n          Where his image is MULTIPLIED TO INFINITY in the two mirror!\r\n          Fear is written on his face.\r\n          And we know he'll be looking over his shoulder...\r\n          Until the day he dies.\r\n\r\n                         SLOW FADE\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n \r\n\r\n\n\n\n\nThe Rage: Carrie 2\nWriters :   Rafael Moreu\nGenres :   Horror  Sci-Fi  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:37:03.756301"}