{"title": "Thunderheart", "film_link": "/Movie Scripts/Thunderheart Script.html", "script_link": "/scripts/Thunderheart.html", "info_raw": "\n\nThunderheart Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  John Fusco\nGenres  Crime  Mystery  Thriller\nScript Date : October 1990\nMovie Release Date : April 1992\n\nRead \"Thunderheart\" Script\n\n\n", "script": "\n\n\n\n                                       THUNDERHEART\n\n\n\n                                        Written by\n\n                                        John Fusco\n\n\n\n                                                                Fourth draft\n\n                                                                Oct. 5, 1990\n\n                \n\n               A DRUM. Beating slow. And deep. Like a heart.\n\n               FADE IN:\n\n               EXT. THE GREAT PLAINS SOUTH DAKOTA - DAWN\n\n               Something is rising from the Black Hills. A sphere of light, \n               too red to be the sun. A sphere of contained fire, undulating \n               in crimson and ochre, and rising slowly, majestically, to \n               the pulse. To the DRUM. It is the sun. But it is a Paha Sapa \n               sunrise. A Black Hills sunrise. And it is spectacular.\n\n               The DRUM, pounds deeper, bigger, as the sun gets higher. \n               Stronger. Igniting a vast landscape of gentle slopes and \n               foothills; throwing shadows on the plains that look like, as \n               the Indians say, an old man dancing. The grass is golden. \n               And high. The wind moves through it, snakes through it. \n               Slowly.\n\n               BEGIN CREDITS.\n\n               Voices; a TRADITIONAL INDIAN SONG (Lakota), summoning Wakan \n               Tanka - The Great Mystery.\n\n               And now, rising up over one of the small land waves, a head \n               comes into view. Shoulders. A man, running in ghostly SLOW \n               MOTION, his long black hair trailing in the wind. The INDIAN \n               MAN wears only buckskin pants and a bone choker around his \n               neck.\n\n               Legs and arms churning, the man runs with antelope grace, \n               backlit by the sunrise, bounding toward us. Running... his \n               heart pounding. SONG RISING... DRUM POUNDING... FIVE MORE \n               VOICES in high-pitched tremolo join the song.\n\n               And then the runner soars, like an eagle from a bluff, \n               airborne, flying over a small dip, arms outstretched, and it \n               would be a wondrous thing if there were not a fine, crimson, \n               mist all around him and if slow motion was not suddenly \n               overtaken by LIVE SPEED, revealing the brutal force of gunfire \n               which has slammed the Indian into the air, throwing him. \n               Slamming him hard into the grass. And it is over as quickly \n               and violently as a deer shot dead.\n\n               LAKOTA SONG ends abruptly.\n\n               LONG SHOT - THE GREAT PLAINS\n\n               the sun burns like lava at the horizon. DRUM beats like a \n               heart. And Somewhere off in a distant cottonwood, an OWL. \n               Then Silence. Deep, disturbing stillness.\n\n               EXT. CAPITAL BELTWAY - WASHINGTON. D.C - DAY\n\n               ROCK N'ROLL shatters the silence.\n\n               Cars -- a multicolored metallic criss-cross reflecting off a \n               building made of mirrors -- races past an electronic billboard \n               that blinks in red skyhigh digital: PRUDENTIAL LIFE INSURANCE. \n               7:59. 73 degrees.\n\n               The D.C. Superhighway. And off behind it, in the distance, \n               Capital Hill holds imposing vigil, the massive cast iron \n               dome of The Capital, catching the sun. But everything is \n               soon smothered by a METRO BUS, hogging the far lane of the \n               Beltway, leaning on its HORN.\n\n               Good morning.\n\n               And the rock n'roll is everybody's radio, everybody's tempo.\n\n               CARBON MONOXIDE WAVE\n\n               shimmers across the beltway hugging then releasing a solitary \n               vehicle that we stay with... move with... A black Nissan 240 \n               SX, hard-waxed.\n\n               INT. 240 SX - TRAVELING\n\n               Behind the wheel -- an intense young man with close-cropped \n               black hair, eyes hidden by sunglasses. Whatever he does for \n               a living, he does in a suit (not expensive but well-fit. But \n               we might also note that any extra suit cash has gone instead \n               into the silver-plated watch on his left wrist). Lean as a \n               rake, sallow in the cheeks, there is something insatiable \n               about him -- a hungry energy that won't let him go.\n\n               RAY LEVOI, late 20's, early 30's, pulls out of a threatening \n               traffic jam and races on the narrow right between thirty \n               cars and a cement girder.\n\n               EXT. T STREET - OUTSIDE WEST-CENTRAL\n\n               The black SX has jumped off an exit and has entered the light-\n               industrial section of Washington. It pulls up near a loading \n               dock behind an old gray building and several parked cars and \n               vans. Ray steps out, smooths his jacket, locks and SETS HIS \n               CAR ALARM.\n\n               Another young man -- chubby, clean-shaven; in a nicer suit \n               than Ray's -- steps out from a parked Miata, and approaches \n               Ray. CARL PODJWICK balances a coffee, a U.S.A. Today and a \n               black eel-skin briefcase.\n\n                                     CARL\n                         Hey.\n\n                                     RAY\n                         Hey. Nice tie.\n\n                                     CARL\n                         Don't get too attached.\n\n               They start walking briskly toward the loading dock.\n\n                                     RAY\n                         Ya got the paper?\n\n               They mount steps.\n\n                                     CARL\n                         Yeah.\n\n                                     RAY\n                         You're my hero, Carl.\n\n                                     CARL\n                         Heroes ain't supposed to shake. I'm \n                         shakin', man, look at me.\n\n                                     RAY\n                         Breathe, Carl. Four, nice, deep ones.\n\n               They stop at the door of a service elevator and Carl breathes. \n               Expanding his chest, exhaling. Ray adjusts Carl's tie for \n               him, his collar. He speaks quietly. Quickly.\n\n                                     RAY\n                         Anyone stops us going in, we're with \n                         the Bowen-Hamilton Textile Company. \n                         We have rug samples.\n\n                                     CARL\n                         Rug samples.\n\n                                     RAY\n                         We are one-dimensional, boring \n                         peddlers of fine carpet, Carl.\n\n               Carl nods. Ray hesitates, adjusts his own collar and enters \n               the service elevator. Carl follows. Door closes.\n\n               BEGIN CREDITS END.\n\n               INT. GRAY BUILDING - FENCING OPERATION\n\n               Carl follows Ray into the big sparse room of unfinished \n               sheetrock walls. There is nothing in here but cardboard boxes, \n               and two people; a bearded HISPANIC MAN standing behind a \n               counter, writing on a clipboard. The other is a middle-aged \n               BLACK MAN in a purple silk shirt sitting in a chair with a \n               newspaper held open. He barely looks over the top of the \n               Wall Street Journal.\n\n                                     BLACK MAN\n                         Hey, look who's here.\n\n                                     RAY\n                         Louis, my man, what's happenin'?\n\n               Ray walks up to the counter. Carl lingers, fidgeting. Ray \n               sets his briefcase on the counter and click-clicks it open. \n               The Hispanic fence man looks inside, and begins pulling out \n               stacks of treasury checks.\n\n                                     FENCE MAN\n                         Clean ones?\n\n                                     RAY\n                         Immaculate.\n\n               Ray gestures to Carl and he nervously sets his briefcase on \n               the counter, fumbles with the first latch. The second. He \n               flips it open.\n\n               The fence man casts his eyes down at a neat cache of Grade A \n               Treasury. A lot of it. Then his eyes rise to Carl.\n\n                                     FENCE MAN\n                         What ya got there, seventy-five \n                         thousand?\n\n                                     CARL\n                         A hundred and ten. Count it.\n\n                                     LOUIS (BLACK MAN)\n                         Have the girl count it, we can't sit \n                         around here countin' bonds, we got \n                         things to do here.\n\n               The fence man pushes an intercom button and yells into a \n               speaker.\n\n                                     FENCE MAN\n                         SALLLLY!\n\n               Carl's eyes flit to Ray. Ray's eyes flit to Carl.\n\n               Louis crushes his newspaper down and lifts a big Colt Python \n               from his lap just as --\n\n               A section of sheetrock kicks open and THREE FEDERAL OFFICERS \n               bust out, each clutching a handgun, SHOUTING inaudibly.\n\n                                     LOUIS\n                         F.B.I.! Get your face on the fuckin' \n                         floor! MOVE!\n\n               Carl startled, does an almost effeminate dip down to one \n               knee, but that knee is swept out from under him, slapping \n               him flat onto plywood where he is instantly frisked down by \n               the fence man who is wielding a 9 mm handgun. But the white \n               collar criminal is more stunned by the fact that --\n\n               Ray is walking across the floor with his hands in his pockets \n               over to the Mr. Coffee. He pours one, and adds some milk. \n               Turns and watches the bust while opening a packet of Sweet \n               n'Low.\n\n                                     RAY\n                         Slam dunk.\n\n                                     LOUIS\n                         Beauty. Beauty...\n\n               Ray rests his weight against the coffee station, takes a \n               careful sip. Carl is yanked to his feet by the fence man and \n               he stands there, looking at Ray, baffled. Completely shocked.\n\n                                     CARL\n                         Jesus Christ, Larry, what the fu-- \n                         Larry. That's not even your name, is \n                         it? What's your real name, you fucking \n                         scumbag?\n\n                                     RAY\n                         Don't have one, Carl. I have a number, \n                         man. Just like the numbers on those \n                         treasury checks. You stole from your \n                         own country, Carl. Shame on you.\n\n               Coffee in hand, Ray walks briskly toward the door.\n\n                                     LOUIS\n                         Sugar Ray.\n\n               Ray turns. Louis takes a few steps toward him, putting his \n               gun back in his waistband.\n\n                                     LOUIS\n                         They want ya Home. Upstairs wants to \n                         see ya.\n\n               Ray stands frozen, holding the door knob, and digesting what \n               are apparently influential words.\n\n                                     LOUIS\n                         Make sure ya spell my name right.\n\n               Ray just stares for a moment. Then hurries out the door.\n\n               Carl, being arm-gripped by two agents and photographed like \n               a trout, gazes bewildered at the door.\n\n                                     CARL\n                              (incredulous)\n                         We just spent four months together... \n                         I thought he was my friend... what \n                         the fuck, man?\n                              (even more incredulous)\n                         He had dinner at my mother's.\n\n               CAMERA FLASHES at him, an agent on either side, striking a \n               natural pose.\n\n               EXT. J. EDGAR HOOVER BUILDING - ESTABLISHING - DAY\n\n               The huge, imposing, mausoleum-like Hoover building, bordered \n               by artificial turf, hemmed by cherry trees in blossom. Turning \n               out to be a nice day on Pennsylvania Avenue.\n\n               INT. FBI DIRECTOR'S CONFERENCE ROOM - DAY\n\n               8x10 BLACK AND WHITE PHOTOS dealt like cards onto a table, \n               one on top of another.\n\n               1 -- an aerial shot of some wasteland.\n\n               2 -- a closer bird's eye of the same, what looks like a NASA \n               photo of Mars.\n\n               3 -- a vast expanse of the Great Plains.\n\n               ROBERT F. TULLY, Number-Two-in-Command, deals a fourth photo \n               onto the table. He is an understated, fatherly man, well-\n               manicured in cotton pencil-striped shirt, white-tab collar \n               and tie. The photos and maps and files a foot deep on the \n               huge table are neatly organized.\n\n                                     INTERCOM\n                         SA Levoi, Sir.\n\n                                     TULLY\n                         Please.\n\n               Seated, at the far end of the table, engrossed in the deep \n               spread of information, SA (Special Agent) FRANK COUTURE is \n               about to break the record for longest single ash on the end \n               of a cigarette and the smoke forces his eyes into tight, \n               concentrating, slits. \"COOCH\" as they call him in the Bureau \n               has seen thirty years in some rough \"provinces\". He has \n               survived the Hoover era and is a legend in the Sessions era \n               but survival has honed an edge. An edge with a touch of ironic \n               cop humor.\n\n               Ray enters, walks into a firm shake.\n\n                                     TULLY\n                         Ray...\n\n                                     RAY\n                         Mister Tully.\n\n                                     TULLY\n                         Do you want a coffee?\n\n                                     RAY\n                         No. No, no. Thank you.\n\n               Ray sits nervously across from Cooch who looks up from the \n               photos and studies the younger man through reading glasses \n               and cigarette smoke, and he looks at him like he doesn't \n               know who the hell he is or why he's sitting there.\n\n                                     TULLY\n                         Levoi, Cooch. Raymond Levoi, Criminal \n                         Division.\n\n                                     COOCH\n                         Oh, yeah -- right.\n\n               Cooch sticks his cigarette in his left hand, shakes with his \n               right.\n\n                                     TULLY\n                         Ray this is --\n\n                                     RAY / TULLY\n                         Frank Couture.\n\n                                     TULLY\n                         That's right.\n\n                                     COUTURE\n                         Hello, Ray.\n\n               The handshake is still locked. Cooch is still squinting at \n               the younger agent. Ray obviously knows something about Agent \n               Couture.\n\n                                     RAY\n                         It's an honor.\n\n               Tully leans back in his chair, crosses his legs casually.\n\n                                     TULLY\n                         Ray, we're taking you off the street. \n                         We need you out in South Dakota.\n\n               Ray's enthusiasm suddenly deflates.\n\n                                     RAY\n                         South Dakota...\n                              (confused)\n                         Did I do something unsatisfactory, \n                         Sir?\n\n                                     COOCH\n                         No, Ray. You're gonna have to blame \n                         that on your grandmother.\n\n               Ray looks completely baffled now, swinging a look from Cooch \n               to Tully.\n\n                                     TULLY\n                         Interesting bloodline you have, Ray.\n                              (scanning file)\n                         French, Scots-Irish, Italian, ...and \n                         one-eighth American Indian.\n\n                                     COOCH\n                         Sioux Indian, right?\n\n                                     RAY\n                         I'm not that sure. Yeah, I think --\n\n                                     TULLY\n                         -- yes, Teton Sioux. Father's side.\n\n               Ray nods, looks from Tully to Cooch. What's going on here?\n\n                                     TULLY\n                         Ray, there's been a homicide out in \n                         an area known as The Badlands. Indian \n                         Reservation.\n\n                                     COOCH\n                         It's not the first. There's been \n                         several. And our field office in \n                         Rapid City is getting a lot of heat... \n                         none of the investigations have turned \n                         up jack shit.\n\n                                     TULLY\n                         The main problem is, Ray, these people \n                         are extremely distrustful of \n                         outsiders, non-Indians. Relations \n                         have not been amicable.\n\n                                     COOCH\n                         Different culture. Hard to penetrate. \n                         The Indians don't like white cops \n                         poking around. And that's why we're \n                         in a position where we have to bring \n                         in an American Indian agent.\n\n               Tully straightens the edges of a bureau memorandum.\n\n                                     TULLY\n                         With an Indian representative out \n                         there, we hope to keep hostilities \n                         dormant; this is a COINTELPRO, \n                         Selective Operations Unit, and it'll \n                         be easier on Agent Couture if you \n                         can gain the people's trust and maybe --\n\n                                     RAY\n                         Woh, excuse me, Sir... I see what \n                         you're saying... I've got a little \n                         Indian blood, that's true. But --\n                              (laughing)\n                         I am not an... an Indian. I can't \n                         just go in and --\n\n                                     TULLY\n                         -- your father was part Sioux.\n\n               A beat. Ray lowers his eyes to the photos.\n\n                                     RAY\n                         I didn't know him, Sir. He passed \n                         away when I was six.\n\n                                     COOCH\n                         Seven.\n\n               Ray looks up at Cooch. Another uneasy beat. Cooch lights a \n               cigarette as if lighting a cigarette was a science.\n\n                                     COOCH\n                         Don't worry about it, Ray. As long \n                         as the people have proof that we \n                         sent them one of their own, no one's \n                         gonna ask you to weave baskets or \n                         make it rain.\n\n               Ray sits before the files and photos, looking unsure. He has \n               come to garner a promotion but has just been sent to The \n               Graveyard. Or in the FBI argot, Indian Country.\n\n               Tully pivots his leather chair in a full circle and slaps an \n               assignment folder down in front of the young agent.\n\n               EXT. THE GREAT PLAINS - SOUTH DAKOTA - DAWN\n\n               The very landscape from opening image. Gentle waves of land, \n               rolling out to touch the Black Hills. The sun rises up out \n               of the distant silhouette like a waking God. HEARTBEAT DRUM. \n               Hypnotic.\n\n               And then a car blows by, throwing up gravel and agate and \n               gypsum. ZOOOOM! Right by us. Gone.\n\n               When a dense screen of red dust clears, an old, bent, metal \n               sign at roadside becomes visible. It reads, through punched \n               and rusted bullet holes: \"Entering Bear Creek Indian \n               Reservation.\"\n\n               HEARTBEAT DRUM calls in the high-pitched, mournful voices of \n               LAKOTA SINGERS. The same haunting song.\n\n               INT. LE BARON - MOVING\n\n               Cooch is at the wheel. Ray, passenger. His lap is a desk for \n               several folders, and he works through them as they drive. \n               Both agents eat a sandwich as they travel.\n\n                                     RAY\n                         Eight murders in less than a year. \n                         All of them Indian. All of them \n                         unsolved. Is the law a non-entity \n                         out here or what?\n\n               Cooch opens a folder that sits between them, and taking his \n               eyes off the road for a dangerous five seconds, locates some \n               photos, and hands them to Ray. Ray's expression tells us \n               they are not pretty.\n\n                                     COOCH\n                         Those are two agents who went into a \n                         reservation a few years ago to serve \n                         a warrant. They were executed at \n                         close range. That one there is a \n                         police officer killed by the Mohawks \n                         up in Canada more recently.\n\n                                     RAY\n                         Jesus...\n\n                                     COOCH\n                         The agents who have worked out here \n                         say its like going into Nam. \n                         Unfamiliar terrain, foreign language, \n                         foreign customs... and you never \n                         know when you might walk into a few \n                         rounds. They hold a lot of old anger \n                         for the white man out here.\n\n               Ray considers this as he looks out at the unfamiliar terrain \n               while on the RADIO, a D.J. speaks in LAKOTA LANGUAGE. Ray... \n               back at Cooch, studying his face.\n\n                                     RAY\n                         Were you in Nam?\n\n                                     COOCH\n                         Airborne. That's where they used to \n                         get us agents from. Now we get 'em \n                         from Carnegie-Melon, Ivy League. \n                         Accountants and computer whiz-kids. \n                         Yuppies with guns.\n                              (lights a smoke)\n                         That's scary shit.\n\n               Ray smiles, sets the AC on high.\n\n                                     RAY\n                         Not as scary as a Hoover man with a \n                         computer.\n\n               Cooch throws a quick look Ray's way. And a smile. He \n               appreciates the sting of a right off a left.\n\n                                     COOCH\n                         Hey, hey, hey. J. Edgar would've \n                         loved you. He'd love anybody who \n                         joined the bureau to, what was it? \n                         \"To enforce the laws of my country \n                         and protect her interests\"?\n\n                                     RAY\n                         You crashed my file?\n\n                                     COOCH\n                         No. I consulted it. We're going into \n                         Indian Country, I wanna know what \n                         kind of individual is covering my \n                         ass. Don't you?\n\n               Ray has finished his sandwich. He wipes his hands on a \n               kerchief while taking in the sight of chalky buttes cramming \n               roadside.\n\n                                     RAY\n                         You've been in the bureau for thirty \n                         years. You survived The Hoov, the \n                         Black Panthers and Abscam. I don't \n                         see any bullet holes. That's good \n                         enough for me.\n\n               Cooch looks at Ray, amused. He likes this guy. And then he \n               notices a look of growing consternation on his partner's \n               face.\n\n               RAY'S POV - MOVING\n\n               as they drive through the first settlement, a little, broken \n               and scattered community, littered with wrecked cars on blocks, \n               and overpopulated with hungry dogs. HEARTBEAT DRUM softly \n               under.\n\n               SIX INDIAN CHILDREN with dirty but beautiful faces and long \n               blue black hair run alongside the car, curious. One of them \n               YELLS SOMETHING we don't understand.\n\n               PAST the trading post -- a white man's store -- where SIX \n               OGLALA SIOUX -- four men, two women sit like wax figures, \n               only their eyes moving to light on the freshly waxed \n               government car.\n\n               A little house has a tipi erected beside it. And a satellite \n               dish. The house beside that one has been half chopped away \n               to feed the wood stove.\n\n               Poverty.\n\n               EXT. BEAR CREEK COMMUNITY - RESERVATION - DAY\n\n               The federal car drives out of the community and further into \n               vast bluffs and strange rock formations where it is swallowed, \n               leaving the ramshackle village in dust.\n\n               A lone dog -- all its ribs showing -- chases, BARKING.\n\n               EXT. BADLANDS - SHORT TIME LATER\n\n               We are on the Moon. Or Israel. But not America. Not any \n               America we've ever seen. A thirty-mile eroded landscape of \n               dunes and crevices, soft rock strata and fossils. Barren. \n               And eerie. A LAKOTA DEATH SONG underscores the otherworldly \n               ambiance of this place as --\n\n               SHOES scuff through the gumbo and multi-colored stones. Two \n               pair of black, spit-shined, lace-ups. Three. Tripping. \n               Scuffing. And then a fourth pair. But they are not loafers. \n               They are Georgio Brutini's and they belong to --\n\n               Ray, as he and Cooch follow two Special Agents from the \n               regional office. SA MILES is about Cooch's age, balding. SA \n               SHERMAN is closer to Ray's age but instead of a suit like \n               the rest, he favors an army-green jacket. Neither is a South \n               Dakota shit-kicker but transplanted field agents. All four \n               shield their eyes with dark glasses, and here in the Badlands \n               it is wise because the sun makes dunes shimmy and craters \n               become faces. It plays mischief on the eye, making Ray and \n               Sherman nearly trip on --\n\n               A DEAD BODY\n\n               lying face down in the rainbow sand. Dried blood and horse \n               flies cover his blown out torso. The agents stand over him, \n               breathless from the rugged walk.\n\n                                     COOCH\n                         Who found him?\n\n                                     MILES\n                         Indian kids. Hunting fossils.\n\n               Cooch studies the body from where he stands. Sherman hands a \n               file over to Ray.\n\n                                     COOCH\n                         Okay. I think Agent Levoi and I can \n                         proceed from here. What are your \n                         call signals?\n\n                                     SHERMAN\n                         PX-10 and 11. Anything we can do to \n                         help you out, just radio.\n\n                                     COOCH\n                         Good. Thanks, Guys.\n\n               The agents start back through the Badlands. Ray is already \n               squatting a safe distance from the body, covering his nose \n               with a kerchief while looking in the file.\n\n               Cooch takes a bended knee on the other side of the body. \n               Flies buzz on and around the corpse.\n\n                                     RAY\n                         Leo Fast Elk... Thirty seven... \n                         single... Member of the Tribal \n                         Council.\n\n               Cooch makes a note then slowly circles the body. He holds a \n               hand out to Ray and the younger agent turns the file over.\n\n                                     COOCH\n                         Looks like Fast Elk wasn't fast enough \n                         to outrun that load. What do you \n                         make of the damage?\n\n               Ray gets closer, swats at Flies with the folder.\n\n                                     RAY\n                         Six rounds. 357.\n\n                                     COOCH\n                         That's what it looks like, doesn't \n                         it? But that's what a ten gauge, \n                         choke-bored, shotgun will look like \n                         when it hits your lower back from \n                         five feet away.\n\n               Ray looks up impressed. Cooch rises and walks off gingerly, \n               scanning the surroundings.\n\n                                     RAY\n                         Somebody was serious about doing \n                         this guy, that's for sure.\n\n                                     COOCH\n                         Ray.\n\n               Cooch is standing ten feet away, staring at the ground. Ray \n               walks over, carefully. He follows Cooch's frown down at the \n               twisted layers of earth.\n\n               ON THE GROUND\n\n               a circle has been etched deep in the soft gumbo, and in the \n               center of the circle, a white eagle plume sticks straight \n               up, dancing in the wind.\n\n               Cooch and Ray each lower themselves to their haunches to \n               study the strange sight. Cooch puts his reading glasses on, \n               stares at it. Then lights a cigarette.\n\n               Ray hefts up a camera and begins CLICKING off shots. He starts \n               moving around it, taking shots at different angles. And then \n               the sound of a DISTANT MOTOR draws both agent's attention.\n\n               POV:\n\n               way out in the bizarre moonscape of eroded rock and earth, a \n               lone figure on a motorcycle bounces and grinds, born out of \n               a silvery heat mirage. It's fifty yards off but heading \n               straight for us. The HEARTBEAT DRUM.\n\n               REVERSE - RAY AND COOCH try to make the figure out.\n\n               IN THE BADLANDS\n\n               the archaic mud-caked Harley chugs and stalls, spits and \n               choices, and begins an incredible drive straight up the steep \n               side of this natural wonder. At the throttle is an imposing \n               figure.\n\n               WALTER CROW HORSE is a portly Indian in his late-thirties \n               with a black reservation hat worn low over a face that seems \n               to have been cast from a bust of Sitting Bull. Sitting Bull \n               with aviator shades. Denim jacket over checkered shirt. Faded \n               jeans. Well broken duct-taped boots. His hair is worn long \n               in tight duel braids.\n\n               The rusted bike bajas up and down slopes, finally stalling \n               out, twenty feet or so from the murder site. Crow Horse swings \n               his bulk off the bike like dismounting a horse. He looks \n               around suspiciously then pulls a rolled-up blanket from the \n               carrier rack.\n\n               LEO LITTLE SKY\n\n               lies in death. Crow Horse's boots move in stealthily, creaking \n               like saddle leather.\n\n               He squats and looks at the corpse... then looks around with \n               animal alertness. He reaches into the front pocket of his \n               jacket and pulls out some Bull Durham tobacco. He pinches \n               some and offers it to the four directions around the body.\n\n               He then unrolls the blanket, begins to move the dead man... \n               sense something and wheels to see Cooch standing behind him, \n               one hand behind his back where his gun must be, and the other \n               hand holding up open wallet. The sun hits his badge.\n\n                                     COOCH\n                         Good morning.\n\n               Crow Horse hawks his eyes onto a big rock, a full second \n               before Ray steps out, his .45 drawn but held at ease.\n\n               Crow Horse slowly raises his arms as Ray moves up to him, \n               studying him.\n\n                                     COOCH\n                         Taking ol' Leo somewhere?\n\n                                     CROW HORSE\n                         Leo's been out here too long, man. \n                         I'm taking him to ceremonial burial.\n\n                                     RAY\n                         This is a restricted area.\n\n                                     COOCH\n                         Check him out, Ray.\n\n               Ray frisks the Indian, finds an old leather wallet, and then \n               a gun. A .38.\n\n                                     COOCH\n                         Nice piece. You come back here to \n                         cover your tracks, Geronimo? What's \n                         your name?\n\n                                     CROW HORSE\n                         It ain't Geronimo.\n\n                                     COOCH\n                         Who are you?\n\n                                     CROW HORSE\n                         I think maybe you guys got off the \n                         wrong exit, yeah? This is the Bear \n                         Creek Indian Reservation.\n\n               Cooch walks around to the front of Crow Horse, and studies \n               him.\n\n                                     COOCH\n                         I know where I am. I'm on federal \n                         land, doing a federal investigation, \n                         and if you don't wanna cooperate you \n                         can take a ride in a federal car, \n                         and spend the rest of the day in a \n                         little room, answering federal \n                         questions. It's your call. Who are \n                         you?\n\n                                     CROW HORSE\n                         I'm a full blood Oglala Sioux, born \n                         and raised on this reservation.\n\n                                     COOCH\n                         You're a wise-ass. Ray check his \n                         wallet.\n\n                                     RAY\n                         I did.\n\n                                     COOCH\n                         Who the fuck is he?\n\n                                     RAY\n                         -- a fucking cop.\n\n               A pause. A long, dead of South Dakota, Badlands pause. Cooch \n               turns and looks at Ray who holds up the open wallet, revealing \n               a badge. Like Cooch's it shines in the sun.\n\n                                     RAY\n                         Walter Crow Horse. Tribal Police.\n\n               Cooch stands staring at the Indian... then takes a few steps \n               over to Ray and grabs the wallet. He examines it. Then looks \n               at Crow Horse and laughs.\n\n                                     COOCH\n                         He's a fucking cop.\n\n               The Indian cop has plenty of time to get up on his own but \n               he kneels there, tauntingly, waiting for Ray to help him. \n               Ray walks over and offers a hand. Crow Horse takes it, and \n               pulls himself up, looking square into Ray's sunglasses.\n\n               Cooch walks over and hands the officer his wallet, and his \n               .23. Crow Horse takes the items, eyeing the older agent.\n\n                                     CROW HORSE\n                         We got the wire ya was comin'. You're \n                         the Indian official, yeah?\n\n                                     COOCH\n                         No. No, that's Ray, here. Ray, uh...\n                              (searching his \n                              imagination)\n                         Ray... Little Weasel.\n\n               Ray does a take but quickly recovers, meeting Crow Horse's \n               scrutinizing gaze. Crow Horse nods to Ray, and Ray nods back \n               in case it's the Indian thing to do. Crow Horse nods again. \n               Ray nods again.\n\n                                     CROW HORSE\n                         Leo's gotta get to burial, Brother. \n                         He's gotta make the journey.\n\n                                     COOCH\n                         What journey?\n\n                                     CROW HORSE\n                         Tell him, Ray.\n\n               Ray stares at Crow Horse, uneasy. The wind sings through the \n               Badlands.\n\n                                     RAY\n                         Leo has to take the journey, Cooch.\n\n                                     COOCH\n                         We'll have to give Leo a refund. \n                         Because he's gotta go to the M.E. In \n                         case you don't know, Officer, \n                         violation of the Major Crimes Act on --\n\n                                     CROW HORSE\n                         -- an Indian Reservation is within \n                         the jurisdiction of the Federal Bureau \n                         of Intimidation. I know that.\n\n                                     COOCH\n                         Good. Thank you.\n\n               Crow Horse says something in Sioux to Ray. Ray just stares.\n\n                                     CROW HORSE\n                         I said when can Leo be taken to \n                         ceremony?\n\n                                     RAY\n                         After we've completed our \n                         investigation.\n\n               Crow Horse is staring at Ray.\n\n                                     CROW HORSE\n                         That's a nice suit.\n\n               Ray looks offended. Cooch puts a hand on Crow Horse's shoulder \n               and walks him toward his beat-up motorcycle.\n\n                                     COOCH\n                         Somebody must be doing something \n                         somewhere in your jurisdiction, \n                         Officer Crow Foot.\n\n                                     CROW HORSE\n                         You ain't gonna cut his hands off \n                         and send 'em to Washinton, are ya? \n                         They done that to one of our girls \n                         once. Leo did quillwork, he's gonna \n                         need his hands.\n\n               Crow Horse turns and looks at Ray. Ray is quick this time.\n\n                                     RAY\n                         Leo's gonna need his hands, Cooch. \n                         He does quillwork.\n\n                                     COOCH\n                         I think Leo's retired from quillwork \n                         for the moment.\n\n                                     CROW HORSE\n                         Respect the dead, Hoss. Because when --\n\n                                     COOCH\n                         -- did you understand me when I said \n                         that --\n\n                                     CROW HORSE\n                              (walking away)\n                         -- violation of the Major Crimes Act \n                         on an Indian Reservation is within \n                         the jurisdiction of the Federal Bureau \n                         of Instigation. I know that.\n\n                                     COOCH\n                         Goodbye.\n\n               Crow Horse appears to be getting on his bike when suddenly \n               he moves like a cat and lays his knife to the dead man's \n               head. He cuts away a patch of hair.\n\n                                     COOCH\n                         What the hell you doing?!\n\n                                     CROW HORSE\n                         His mother needs a piece of his hair. \n                         It's for the Keeping of the Souls \n                         Ceremony.\n                              (wrapping lock of \n                              hair)\n                         Has to be kept for four days.\n\n               Cooch and Ray stand there, watching Crow Horse mount his \n               bike and push off down a nasty slope back through the \n               Badlands. He starts his motor. It dies. Then starts again.\n\n                                     COOCH\n                         Keeping of the souls. Do they still \n                         burn their dead or something?\n\n                                     RAY\n                         Beats the hell outta me.\n\n               Ray and Cooch look off across the Badlands, as far out of \n               their element as they can be.\n\n               CLOSE ON - THE WHITE EAGLE PLUME\n\n               in the circle in the sand, fluttering in the wind.\n\n               The gold spit-shined Le Baron eases to a crawl, passing an \n               old wooden sign. \"Leaving Bear Creak Indian Reservation.\"\n\n               And immediately pulling in front of a squat old bar with a \n               burned out neon Miller light. DWIGHT YOAKUM croons \"Youuuuuu-\n               Got-Your Little-Ways\" on the jukebox from inside.\n\n               The Buffalo Butte bar has several cracked and sun-bleached \n               buffalo skulls hanging off the edge of its flat roof and big \n               faded white letters painted across the front read: \"No Indians \n               Allowed.\"\n\n               (This sign actually exists today in the res-line border town \n               of Scenic, South Dakota). The car pulls up beside a pick-up \n               and parks. Ray and Cooch step out, careful to walk wide around \n               a PITBULL in the bed of the truck.\n\n               A WHITE LOCAL walks out of the bar and looks askance at the \n               suits. As the two feds approach the bar, Cooch looks up at \n               the warning sign. Ray sees it too.\n\n                                     COOCH\n                         Sorry, Ray. You're gonna have to \n                         wait in the car. I'll bring you out \n                         a cheeseburger.\n\n               The young agent smiles, amused, starts to enter the bar but --\n\n                                     VOICE (O.S.)\n                         Hey!\n\n               Ray spins quickly, paranoid about entering. But the man \n               calling to them is --\n\n               An Indian himself. TRIBAL PRESIDENT OLIVER CLEAR MOON, a \n               small man in his late fifties who peers out at the agents \n               through fat bifocals. He wears a straw cowboy hat, red \n               windbreaker and his hair is cut short, or \"bobtailed\" as the \n               Indians say.\n\n               Clear Moon is walking away from a parked pick-up truck, toward \n               the white men, eyeing the two with deep curiosity.\n\n                                     CLEAR MOON\n                              (heavy Indian accent)\n                         You made it. Was-te.\n\n               Cooch discreetly peeks into a folder as he walks toward the \n               man\n\n                                     COOCH\n                         You must be... President Clear Bone.\n\n                                     CLEAR MOON\n                         Clear Moon.\n                              (pointing to the sky)\n                         Moon. You must be the Sioux.\n\n               He is pointing his long, skinny finger at Cooch.\n\n                                     COOCH\n                         No. That's Ray here. Ray...\n\n                                     RAY\n                              (quickly)\n                         Ray Levoi, Sir. Pleasure.\n\n               Clear Moon beholds the young agent with hopeful eyes, a smile \n               breaking across his flaccid brown skin. He takes Ray's hand \n               in a respectful double-clutch and grips him tightly... almost \n               desperately.\n\n                                     CLEAR MOON\n                         It's about time they sent us one of \n                         our own. Was-te.\n\n               He keeps pumping Ray's hand, looking into his face with great \n               admiration. Cooch looks on with amusement.\n\n                                     CLEAR MOON\n                         Things are no good here. It is like \n                         war zone. We need an official who \n                         understands what is good for the \n                         Indian people. Who knows Indian way.\n\n               Clear Moon has not released Ray's arm as he leads them to a \n               string of seedy motel units across the street.\n\n                                     RAY\n                         I thought we were staying on the \n                         reservation.\n\n                                     CLEAR MOON\n                         Yes. Rooms thirteen and fourteen are \n                         on Indian land.\n\n                                     RAY\n                         I see.\n\n                                     CLEAR MOON\n                         Are you hungry? I have some nice raw \n                         kidney in the truck.\n\n                                     RAY\n                         Oh, I'm set, Sir. I'm set.\n\n                                     COOCH\n                         He's starving, Mr. Clear Moon. Get \n                         him some raw kidney. He hasn't had \n                         any Indian food in days...\n\n               And Clear Moon guides them through the front door of room \n               13. Ray looks over his shoulder threateningly at Cooch who \n               winks and pats his back.\n\n               EXT. RESERVATION LINE - NIGHT\n\n               A lone headlight appears out of the black. HEARTBEAT DRUM. \n               But faster. Relentless. A \"res\" car, a dented, rusted, peeling \n               old station wagon, drives slowly toward the reservation.\n\n               Then suddenly, someone steps in front of the car. A BIG MAN \n               in cowboy boots and blue jeans.\n\n               INT. MOTEL - ROOM 13 - NIGHT\n\n               Ray lies in bed. Awake. He is hanging off the bed with a \n               file open on the floor and using the moon to light photos \n               and memorandums. And then he hears LAUGHTER outside. And \n               GLASS BREAK.\n\n               He gets out of bed quickly, snatching up his pants, putting \n               their on, and going to the window.\n\n               POV - OUT WINDOW:\n\n               SEVERAL LOCALS out in front of the bar help a middle-aged \n               INDIAN MAN out of the station wagon.\n\n                                     WHITE LOCAL\n                         Where you goin'? Back to the res?\n\n               A young local bends down behind the Indian while another \n               shoves him, sending him tripping over the bent man and onto \n               his back in the dirt.\n\n                                     WHITE LOCAL\n                         What ya doin'? You drunk?\n\n               MORE LOCALS come out from the bar, beers and drinks and \n               interested in what's going on.\n\n               REVERSE - RAY\n\n               at the window, observes. Cooch enters from the connecting \n               room, puffy-eyed but quickly buttoning his shirt. He shares \n               Ray's view.\n\n                                     COOCH\n                         Let's take a walk.\n\n               Ray is transfixed.\n\n               EXT. BUFFALO BUTTE BAR - NIGHT\n\n               The Indian man, is pushed into a stumble, and caught by \n               another white man as a little game of catch takes place. \n               Cooch, stepping into the circle, shirt half unbuttoned, hair \n               a mess, looks on. Then steps in front of a big local and \n               catches the Indian as he comes stumbling. He holds onto him, \n               looking at the faces that turn his way. Ray steps up beside \n               him, looking tense.\n\n                                     COOCH\n                         What's goin' on here?\n                              (a beat)\n                         I can't walk across the goddamn street \n                         without some breed-ass fallin' all \n                         over me?\n\n               And then Cooch shoves the Indian with all his might back \n               across the road. The locals resume their fun, and Cooch looks \n               at a local man and shares a chattering laugh that makes Ray \n               do a serious take.\n\n                                     COOCH\n                         Watch out now, he wants a kiss, Ray, \n                         wants a kiss --\n\n               The Indian ends up stumbling back toward Ray, and Ray catches \n               him this time. The man maintains a perfect vacant expression \n               and keeps acting as though nothing of the sort is happening. \n               But he is dizzy, and exhausted, and Ray keeps him from \n               falling.\n\n               Cooch looks at Ray. Their eyes meet. Ray shoves the man \n               forward. This time, instead of catching him, the local on \n               the receiving end, hauls off and punches him in the face. \n               The Indian drops.\n\n               Cooch runs in, grabs the Indian under the arms and drags him \n               back to his car.\n\n                                     COOCH\n                         Go ahead, skin, get your ass back on \n                         your sacred land. Get outta here.\n\n               He shoves him behind the wheel as the locals crowd around. \n               They don't see Cooch throw the wheel stick in drive, and \n               lean into the man's ear.\n\n                                     COOCH\n                         Get outta here. Drive.\n\n               Cooch slams the door, and kicks it, and the vehicle lurches \n               forward. A beer can clanks off the rear window, and rolls \n               clanking into the middle of the road.\n\n               Ray stands there with the locals as they all watch the car \n               drive off across the reservation line. Cooch, belly sticking \n               out of his unbuttoned shirt, and a breathless smile on his \n               face, heads to the bar without breaking stride. This man has \n               done \"underground\" before.\n\n               INT. BUFFALO BUTTE BAR - NIGHT - SHORT TIME LATER\n\n               Cooch and Ray sit in a booth with DENNIS VAUGHN, a strapping \n               local man, ranch-raised, and gentlemanly. In fact, downright \n               likeable.\n\n                                     DENNIS\n                         So what type of salesmen are you \n                         gentlemen anyway?\n\n                                     RAY\n                         Liquor. We heard they like their \n                         drink on the reservation, and we \n                         were gonna see if we couldn't unload \n                         some surplus on the way to Nebraska.\n\n                                     COOCH\n                         Now keep that between us, Dennis, \n                         cuz I don't know what kinda Johnny \n                         Law they got here.\n\n                                     DENNIS\n                         Hey, Brooks, come over here. I want \n                         you to meet a coupla fellas from \n                         Denver.\n\n               BROOKS, a small, older man with a feed store cap and a clean \n               cowboy shirt, comes over with a beer and a pensive look on \n               his face. He pulls up a chair and positions himself at the \n               end of the booth.\n\n                                     DENNIS\n                         Liquor salesmen. Be nice to them, \n                         maybe they'll give you a sample of \n                         some of that gin you like.\n                              (to Ray)\n                         He likes that Russian shit that --\n\n                                     BROOKS\n                         They ain't liquor salesmen. They're \n                         FBI.\n\n               Cooch and Ray don't flinch. Dennis does. He looks between \n               the two, cautiously.\n\n                                     COOCH\n                         Brooks, what's a perceptive fellow \n                         like you, doing in a joint like this? \n                         Let me buy you a glass of some of \n                         that Russian shit you like.\n\n                                     DENNIS\n                         FBI? What you investigatin'?\n\n                                     COOCH\n                         A murder. On the reservation.\n\n                                     DENNIS\n                         Again. Figures, man.\n\n                                     BROOKS\n                         You'll never find out who did it.\n\n                                     COOCH\n                         You underestimate me, Brooks.\n\n                                     BROOKS\n                         No. You underestimate these grass \n                         niggers. They're killing each other. \n                         That's all they do. Get drunk and \n                         kill each other. Then cover for each \n                         other. Who gives a damn really as \n                         long as they stay on their \n                         reservation. You ask me, the \n                         government shouldn't care one \n                         particle.\n\n                                     DENNIS\n                         You know how in your big cities, you \n                         got your niggers and you got your \n                         Puerto Ricans? Well out here we got \n                         Indians. That's just the way it is.\n\n                                     COOCH\n                         The only good Indian is a dead Indian, \n                         does that old adage still hold true \n                         out here?\n\n               Cooch laughs good-naturedly. Ray smiles. But Brooks looks \n               offended.\n\n                                     BROOKS\n                         That set-to you saw out front, was \n                         nothin' more than a message we were \n                         sendin' to the sonsabitches that are \n                         divertin' water from the river.\n\n                                     DENNIS\n                         We got rights. We got a ranch just \n                         up here.\n\n               Ray catches this. Glances a look off Cooch who works on a \n               cold draught beer.\n\n                                     RAY\n                         Did any of you gentlemen know Leo \n                         Fast Elk?\n\n               Both men shake their heads. Get quiet.\n\n                                     BROOKS\n                         You fellas are here to investigate a \n                         Indian crime, you should keep to \n                         Indian land, and talk to them, not \n                         us. But you wanna drink here and \n                         shoot stick here, that's your right, \n                         and we respect that.\n                              (to Dennis)\n                         Come on, Son, we're up on the table.\n\n                                     DENNIS\n                         You fellas wanna play doubles?\n\n               Cooch shakes his head, distracted, and the two locals leave, \n               enroute for the pool table. Ray watches them go, curious.\n\n               EXT. BUFFALO BUTTE BAR - NIGHT\n\n               Ray and Cooch, cross the street back to the motel. It is \n               black and chillingly still.\n\n                                     RAY\n                         Water. Worth killing for out here, \n                         I'd think.\n\n                                     COOCH\n                         Get the plate numbers off everyone \n                         of these cars.\n\n                                     RAY\n                         I already did.\n\n               Cooch looks at Ray, impressed.\n\n                                     RAY\n                         Couldn't sleep.\n\n                                     COOCH\n                         Good.\n\n               They stop in front of their rooms and Cooch pulls a small \n               tape recorder from his waistband. A micro-cassette recorder \n               that he examines in the dim door light.\n\n                                     RECORDER\n                              (locals)\n                         -- out here we got our Indians. And \n                         that's the way it is.\n\n               Cooch shuts it off.\n\n                                     COOCH\n                         By the time you get to the main \n                         village, sun'll be up. I want you to \n                         fraternize. Socialize. Penetrate. \n                         Infiltrate. Eat some raw kidney, and \n                         get these Indians talking. I'm gonna \n                         Powwow with Big Chief Clear Moon and \n                         find out more about Leo.\n\n               He hands Ray the recorder.\n\n                                     RAY\n                         Done.\n\n               Cooch starts for his room but in a long, exaggerated country \n               step as he breaks into the HANK WILLIAMS tune that has all \n               but driven him insane inside the joint. Ray watches him go, \n               and cracks a laugh.\n\n               INT. LE BARON - TRAVELING - SUNRISE\n\n               Ray's at the wheel, looks intense as he studies the vast \n               expanse of slopes and rock formations and the rising sphere \n               of flame that lights the road in strange color. He is reading \n               a name list that he traps against the wheel.\n\n                                     RAY\n                         Hobert Standing-Buffalo-That-Walks-\n                         Dreamer.\n                              (a dry run)\n                         Hello, I'm looking for Hobert Standing-\n                         Buffalo-That-Walks... Dreamer.\n\n               Ray pulls up a long dirt drive and parks.\n\n               EXT. OLD TRAILER - ACROSS FROM BADLANDS \u0096 SUNRISE\n\n               Ray walks to the front door of a war-torn trailer that is \n               halfway swallowed by weeds and plants. It is static out here. \n               Dead still. Ray approaches the front door. There is a huge \n               hole in it. He knocks above the hole.\n\n               After a moment, the door opens a crack. A dark, weather-beaten \n               face barely shows.\n\n                                     RAY\n                         Good morning. I'm looking for Hobert-\n                         Buffalo-Dreaming...\n                              (cheat sheet)\n                         Hobert Standing-Buffalo-That-Walks--\n\n               The door closes. Locks.\n\n                                     RAY\n                         --Dreamer.\n\n               Ray stands there for a moment then lowers himself to look \n               through the huge hole in the door.\n\n                                     RAY\n                         Sir?\n\n               A tattered chair is pushed against the door, covering the \n               hole. Ray stands up, turns on the steps. And before he can \n               let out a flustered sigh, he spots something across the dirt \n               road. Something that makes him remove his shades, look again. \n               Whatever it is, it doesn't make him happy, and he is hurrying \n               across the road.\n\n               EXT. BADLANDS - DAY\n\n               A motorcycle, parked between the road and the badlands. We've \n               seen the ancient bike before. Ray walks past it, looking at \n               it.\n\n               He pushes his shades up on the bridge of his nose and looks \n               down into the moonscape.\n\n               Walter Crow Horse is down there, on his haunches, \"feel \n               tracking\", laying his fingers inside tracks and reading them. \n               He doesn't even look up at the sound of the FBI agent's \n               footsteps.\n\n                                     CROW HORSE\n                         Ray Little Weasel. FBI. I like the \n                         way ya sneaked up on me. Must be \n                         Indian.\n\n               The wind whistles and moans through the Badlands as Crow \n               Horse continues feel tracking.\n\n                                     RAY\n                         What are you --\n\n                                     CROW HORSE\n                         Watch out!\n\n               Ray draws back.\n\n                                     RAY\n                         What?!\n\n                                     CROW HORSE\n                         You're steppin' on sign.\n\n               Crow Horse lowers his face to the ground and blows some \n               scattered dust out of a print. Lightly lays his fingers inside\n\n                                     RAY\n                         Hey.\n                              (ignored)\n                         Hey, you, listen up --\n\n                                     CROW HORSE\n                         -- Leo wasn't killed here. He was \n                         dumped here. Out of a vehicle. Bald \n                         tread. Muffler held on with baling \n                         wire.\n\n               Crow Horse checks out another track.\n\n                                     CROW HORSE\n                         The man you want... stepped outta \n                         the car, dragged Leo out, laid him \n                         down. Then walked over here and made \n                         a circle in the earth with a stick. \n                         I can't find the stick. He stuck an \n                         eagle plume in the circle, got back \n                         in his car, dustin' his own prints \n                         with a pine bough for about six feet, \n                         but he missed a print, right here, \n                         see. He got in his car and went Hell-\n                         bent-for-Holy-Sunday outta here. He \n                         ditched that pine bough three miles \n                         across the flat, in the Little Bear \n                         River, it floated down to \n                         Thundershield Gap. The car hit paved \n                         road, and was outta here.\n\n               Crow Horse rises, points down the road.\n\n                                     CROW HORSE\n                         The killin' was done where Leo's \n                         mother lives. But he was driven here \n                         into these Badlands.\n\n               Ray is frowning at the big Indian, trying to get a fix on \n               this\n\n                                     CROW HORSE\n                         Big sonuvabuck. Based on the depth \n                         of that print, pressure releases... \n                         I'd say he goes two-ten, two-fifteen --\n\n                                     RAY\n                         Bullshit.\n\n                                     CROW HORSE\n                         -- Well, maybe two-seventeen.\n\n                                     RAY\n                         You're trying to tell me you can \n                         read all that from a track?\n\n                                     CROW HORSE\n                         No. Not just a track. You gotta listen \n                         to the trees, man. To the leaves. To \n                         this sand, you FBI's kicked all up. \n                         You gotta listen to the earth.\n\n                                     RAY\n                         Is that right? Well, listen to this: \n                         drag your ass. This is a restricted \n                         area.\n\n                                     CROW HORSE\n                         No, this is the home of the Oglala \n                         Sioux and I want the dog-fucker who \n                         killed Leo. Whether you get him or I \n                         get him, I just want him. Shit's \n                         been goin' on too long.\n\n                                     RAY\n                         You've got no jurisdiction.\n\n                                     CROW HORSE\n                         You got no know-how. About Indian \n                         Way. Or about Jack Shit for that \n                         matter.\n\n                                     RAY\n                         Maybe you're not aware of this, Crow \n                         Horse, but I just flew in from a \n                         place called the Twentieth Century \n                         where we have such things as \n                         electrostatic tracking methods, \n                         psycholingusitics, DNA fingerprinting; \n                         I don't have to crawl around with \n                         the scorpions and talk to the fucking \n                         trees to get answers. Leo was killed \n                         right here.\n\n                                     CROW HORSE\n                         Go back to the M.E., take a look \n                         inside Leo's exit wounds and tell me \n                         how chicken feed got in there. Trust \n                         me, there ain't chickens in the \n                         Badlands. His mother's place is --\n\n                                     RAY\n                         -- his mother never lived here. She \n                         was from up in North Dakota.\n\n                                     CROW HORSE\n                         I'm talkin' his spiritual mother. \n                         Maisy Blue Legs.\n\n                                     RAY\n                         His spiritual mother...\n\n                                     CROW HORSE\n                         To us Indians, our spiritual relatives \n                         are as close as family. I've got \n                         seven mothers on this reservation. \n                         Sisters. Brothers. You ain't one of \n                         them.\n\n                                     RAY\n                         Thank God. Now listen to me, asshole. \n                         I'm giving you a break. But if my \n                         partner finds out you're here, you're \n                         gonna be reading rat tracks in Sioux \n                         Falls Maximum Security.\n\n                                     CROW HORSE\n                         Easy. Easy... I'm goin'.\n\n               Crow Horse walks back up toward the road.\n\n               Ray lets him leave then crouches where Crow Horse was, begins \n               looking at tracks.\n\n                                     CROW HORSE (O.S.)\n                         Hey, Little Weasel.\n\n               Ray turns, and sees Crow Horse perched on a high bank -- the \n               one Ray came down -- and he's in a tracking stance.\n\n                                     CROW HORSE\n                         You weigh one sixty-three, yeah? Not \n                         a beer drinker. You're one of these \n                         tofu and pilaf characters. Pack your \n                         gun, under your coat -- left shoulder. \n                         But you got backup; a little .32, \n                         .38 maybe, in a ankle holster that \n                         gives you a right foot drag, Shoes \n                         are too tight at the toe but, man, \n                         they look cool. And that's what \n                         counts.\n\n               Ray just stands frozen, blown away. Crow Horse rises, dusting \n               off his hands, and heading to his vehicle.\n\n                                     RAY\n                         Crow Horse.\n\n               The Indian turns. The wind moans. Ray scrutinizes him, \n               deliberating.\n\n                                     RAY\n                         Fuck you.\n\n               Crow Horse grins and waves, and ambles away. DOWN IN\n\n               THE BADLANDS\n\n               Ray stands, sweating under his suit jacket, and not sure if \n               he's amazed or pissed off.\n\n               EXT MAISY BLUE LEGS HOUSE \u0096 BLACK TAIL DISTRICT - DAY\n\n               A trailer sits off from the river in beaten solitude. There \n               are two junked cars and one burned black.\n\n               Wind blows across deep bald tire tracks. Ray walks slowly \n               beside them, surveying, following them to a place where they \n               become puckers and skids next to a dilapidated outhouse. \n               There is a shotgun blast in the side of it. Ray studies it, \n               enters the outhouse. Exits, and walks the rutted gumbo earth \n               to where it meets rolling hills of golden grass. He stands \n               here, mesmerized.\n\n               CHICKENS scratch around in the dirt.\n\n               Like so many far-off res homesteads, this is a haunting place. \n               Made more so by a persistent SQUEAKING, a rusty, metallic \n               squeal coming from --\n\n               A WATER PUMP\n\n               across the yard, where MAISY BLUE LEGS, a Sioux elder, works \n               the handle. She wears thick bifocals and keeps her hair under \n               a bandanna. No water comes forth from the pump, and she tries \n               again and again until she breaks a sweat. And then she sees \n               the waal'cu standing out there.\n\n               Urgently, she turns and starts back to her trailer with an \n               empty coffee can.\n\n               Ray starts after her.\n\n                                     RAY\n                         Mrs... Blue Legs? Can I ask you a \n                         few questions --\n\n                                     MAISY\n                              (1/3 res speed)\n                         -- go away. Leave us alone...\n\n                                     RAY\n                         Ma'am, Please --\n\n               She mounts the metal steps. Ray is losing her. He gets a \n               foot on the bottom step, and attempts something he does not \n               want to do.\n\n                                     RAY\n                         Mrs. Blue Legs. I'm Indian.\n\n               Halfway through the screendoor, Maisy turns and looks at the \n               young man in suit and shades.\n\n                                     RAY\n                         I'm Sioux.\n\n               Maisy lowers her bifocals, studies him. Then walks in, slaps \n               the door shut, and locks it. A towel hung as a shade folds \n               down.\n\n               Ray lingers at the bottom of the steps.\n\n                                     RAY\n                         Yeah, right.\n\n               And he walks around the side of the trailer, looking at the \n               ground. In the gaping space between the trailer blocks, and \n               the grass, there is much junk stored, and Ray kneels to look. \n               He is drawn to a pair of cowboy boots, caked with dried mud. \n               He picks up a boot, looks at the sole, then touches the mud. \n               His fingers break through the hardened crust and come back \n               moist and blue. He looks at this sniffs it. There is a tense, \n               water-torture like tempo coming from the old pump where water \n               barely drips onto a hub cap in the dirt. Ray sets the boot \n               down. Goes to grab the other boot and --\n\n               a WESTERN DIAMOND BACK RATTLER coils out from the shade of \n               the boot, RATTLING and HISSING from white mouth and three-\n               inch fangs, and Ray has done a backflip and roll, slapping \n               his shoulder holster and pulling lead and BLAM! BLAAAM! he \n               unloads two, and the reptile is so dead, there's not even \n               enough snake left to make a truck-stop key chain.\n\n               He kneels there, flushed in the face, holding his breath and \n               double-clutching his gun. The SHOTS ECHO through the Badlands \n               like the aftermath of dynamite. From inside the trailer, he \n               can hear CRYING. A low moaning. Praying softly.\n\n                                     RAY\n                         Shit. Mrs. Blue Legs! It's okay!\n\n               Then his RADIO CRACKS IN.\n\n                                     RADIO (COOCH)\n                         X21, give me a 20.\n\n                                     RAY\n                              (yelling)\n                         Black Tail District, X22. You ready \n                         for this? Leo wasn't killed in the \n                         Badlands. I... I found the location.\n\n                                     COOCH\n                         Maisy Blue Legs place?\n\n                                     RAY\n                         How'd you know?\n\n                                     COOCH\n                         I got one up on ya.\n\n                                     RAY\n                         Go ahead.\n\n                                     COOCH\n                         I've got the doer. I know who he is.\n\n               Ray looks relieved.\n\n                                     COOCH\n                         Meet me at base. Over.\n\n                                     RAY\n                         Cooch. You're my hero.\n\n               Ray looks down at the dead snake, still rushed from it, and \n               he hurries out of there.\n\n               IN THE SHADE OF THE TRAILER\n\n               the snake's RATTLE moves spasmodically, still kicking with \n               reflex.\n\n               EXT. LOOKS TWICE HOUSE - BEAR CREEK RES - NIGHT\n\n               CLOSE ON an AMERICAN FLAG, flapping in the hot night wind. \n               But something is wrong about the image. The flag is hung \n               upside lit by --\n\n               A full moon that also illuminates an overgrown field that \n               fronts a small, one-level house where the flag hangs. Three \n               old cars decorate the front yard. A busted screendoor creaks \n               in the wind, and somewhere off in the hills, a DOG BARKS \n               away his boredom.\n\n                                     COOCH (O.S.)\n                         Jimmy Looks Twice.\n\n               INT. LE BARON\n\n               SA Couture and SA Levoi sit inside the car, staking out this \n               little place far down a dirt road on the outskirts of the \n               settlement.\n\n               Cooch has the suspect's file on his knee.\n\n                                     RAY\n                         Who is he?\n\n                                     COOCH\n                         One of the leaders of the Warriors \n                         of All Red Nations. Militant \n                         organization.\n\n               He hands an open file over to Ray.\n\n               CLOSE ON - FILE PHOTO: a raging fire and six long-haired, \n               fist-raising Indians, yelling at the camera.\n\n                                     COOCH (O.S.)\n                         The progressive Indians don't like \n                         them because they want everybody to \n                         go back to the old Indian ways, and \n                         the old way Indians don't like them \n                         because they use violence to get \n                         attention.\n\n               RAY SHUFFLES TO\n\n               PHOTO 2 -- a big Indian in a wheel chair, holding a rifle. \n               He is shirtless under a vest and on his muscular right \n               shoulder there is a clearly defined tattoo of a circle with \n               an eagle feather through it.\n\n               PHOTO 3 -- a Close Up of the tattoo.\n\n               PHOTO 4 -- a propaganda flyer with the letters W.A.R.N. and \n               the same symbol -- perfect circle, pierced by a white eagle \n               feather.\n\n                                     RAY\n                         White eagle feather through the \n                         circle. That's their symbol.\n\n                                     COOCH\n                         That's right.\n\n               Ray shuffles through more of the same with great interest.\n\n                                     RAY\n                         They obviously wanted it to be known \n                         that they offed Leo. Some kind of \n                         statement.\n\n                                     COOCH\n                         Jimmy Looks Twice put Leo's head \n                         through a glass door of the tribal \n                         offices three months ago. And \n                         threatened him several times since. \n                         President Clear Moon and the regional \n                         FBI feel he made good on that threat.\n\n               Cooch takes a long, tight breath then turns around in his \n               seat, coming up with an M-16. Ray lifts one of his own. He \n               looks out the car window.\n\n                                     RAY\n                         I'd just like five minutes alone \n                         with the motherfucker who hung that \n                         flag upside down.\n\n                                     COOCH\n                         Easy, Cowboy. No vendettas on my \n                         ship. Now: remember what I told you \n                         about Nam? Watch the grass, watch \n                         the trees, watch the shit house, be \n                         on your toes, and if we get committed, \n                         don't hesitate to empty that sucker.\n\n                                     RAY\n                         Alright. Alright.\n\n               Cooch whacks a top clip into the M-16. Ray slams a clip in \n               his.\n\n                                     COOCH\n                         It's show time.\n\n               Car doors open in skillful silence.\n\n               LOOKS TWICE HOUSE - CLOSER - NIGHT\n\n               and Ray maneuver toward the house, rifles ready. Cooch gets \n               under the picture window, sneaks a look. Nothing. He follows \n               Ray around the side.\n\n               POV:\n\n               off in a backfield, lit by a hot fire, a small round hut \n               covered in patchwork quilts, canvas and buffalo hide. A \n               strange mist floats around it, and from inside, voices are \n               heard -- A DRUMMING AND CHANTING in LAKOTA. And EAGLE SOUNDS. \n               Dozens of shrill whistles. Are there birds inside this thing?\n\n               REVERSE - RAY\n\n               and Cooch, kneeling in the weeds, look dumbfounded. And more \n               than a little unnerved.\n\n                                     RAY\n                              (whispering)\n                         What the hell is that?\n\n               NEAR THE INIPI LODGE\n\n               An INDIAN YOUTH DOOR TENDER with shoulder length hair falling \n               over a T-shirt, steps out of the dark and walks to the fire. \n               He prods it with a broken pitch fork.\n\n               He turns to get some more wood and walks right into an M-16, \n               trained chest level. Ray stares him down.\n\n                                     RAY\n                         On the ground.\n\n               The boy drops boot camp fast.\n\n               Cooch moves up on the sweat lodge, looking quizzically at \n               it, trying to figure out how to open it. He grabs a canvas \n               flap at the front and after a moment's hesitation and a look \n               at Ray, he tears the flap away.\n\n               A BLAST OF 200 DEGREE STEAM explodes forth and Cooch dances \n               back, throwing up his rifle.\n\n                                     VOICE (O.S.)\n                              (inside lodge)\n                         Mitakue Oyasin!\n\n               GRANDPA SAMUEL REACHES, a rail-thin Sioux elder, appears \n               through the steam like a vision. Bent in the tiny doorway, \n               he searches out the interruption.\n\n               Cooch aims the M-16 at the old man.\n\n                                     COOCH\n                         This is the FBI! Come on out of there \n                         nice and slow. Let's move it! Hands \n                         on your head!\n\n               Grandpa Reaches crawls out first, ignoring the \"Hands on \n               your head\" order from Cooch. His eyes move back and forth \n               between the two agents.\n\n               FIVE MORE INDIANS, from 16-45 come out, looking confused. \n               Cooch makes the towel-wrapped men spread out in a line. The \n               old man is speaking to the others in LAKOTA, and Ray steps \n               up to him, cuts him off.\n\n                                     RAY\n                         Hands on your head, Sir. Come on, \n                         come on...\n\n               The archaic figure just looks through him. Starts to walk \n               away. Ray takes his thin arm. He locks eyes with the old \n               man. Slowly, he obeys, raising his hands and laying them on \n               his head.\n\n               From the lodge, the last man emerges. It's Crazy Horse reborn \n               out of the burning sage. JIMMY LOOKS TWICE is in his mid-\n               thirties -- big, well over two-hundred pounds. But lean. His \n               braids fall nearly to his hips. His face is handsome but at \n               the moment, twisted in a full-blood's scowl.\n\n                                     LOOKS TWICE\n                              (outraged)\n                         What are you doing?\n\n                                     COOCH\n                         James Looks Twice?\n\n                                     LOOKS TWICE\n                         That's right. What are you doing \n                         here? This is a religious ceremony \n                         you're desecrating.\n\n               Looks Twice shoots hawk-like black eyes onto Ray.\n\n                                     RAY\n                         We're FBI, James. We just need to \n                         ask you a few questions.\n\n                                     LOOKS TWICE\n                         We are in the middle of a sweat lodge \n                         ceremony. Do you drag people out of \n                         your churches when they're in the \n                         middle of prayer?\n\n                                     COOCH\n                         Let's take a walk, Jimmy. Come on.\n\n               Cooch takes a careful step behind Jimmy and cuffs him. Looks \n               Twice speaks to the others in LAKOTA, and they disband, \n               heading to a shade arbor where their clothes hang.\n\n               As Cooch starts marching Looks Twice toward the house, Ray \n               keeps an eye on the departing. One of them stops halfway to \n               the fence and turns. Grandpa Reaches looks at Ray with eyes \n               that have seen one hundred and one hard years in Indian \n               Country.\n\n                                     RAY\n                         Go ahead. You can all go home.\n\n               And he follows Cooch and the cuffed Jimmy to the house.\n\n                                     COOCH\n                         We just wanna take a look around \n                         your place, Jimmy. We're not here to \n                         bust your balls.\n\n               AT THE BACK OF THE HOUSE\n\n               Cooch leads the half-naked suspect to the backdoor. Cooch \n               show: a warrant, tries the door but it is locked.\n\n                                     LOOKS TWICE\n                         What's this about?\n\n                                     COOCH\n                         Your good friend Leo Fast Elk.\n\n                                     LOOKS TWICE\n                         You think I killed him? Cuz he was \n                         an apple? Well, let me tell you \n                         something about Leo, Man --\n\n                                     COOCH\n                         -- don't \"man\" me, Jimmy. Where's \n                         the key?\n\n               Jimmy doesn't answer. He glares with hatred into Cooch's \n               eyes.\n\n                                     COOCH\n                         Ray, use the federal master key.\n\n               Ray steps up, gets ready to throw a frontkick at the door.\n\n                                     LOOKS TWICE\n                         No. Don't do that. Don't deface the \n                         property, man. The key's in there.\n\n               With his hands cuffed, he can only jerk his head toward a \n               big hole in the wall down near the foundation. Cooch quickly \n               drops to a knee and checks out the hole.\n\n                                     LOOKS TWICE\n                         Inside... in the coffee can.\n\n               Cooch reaches in, probes.\n\n                                     COOCH\n                         There's no coffee can in --\n\n               Something horrifying happens so fast, Cooch has no time to \n               react.\n\n               Whatever has taken his arm has done so with such force, his \n               body jolts like he's touched raw voltage. The South Dakota \n               BADGER rips through his leather jacket -- we get a glimpse \n               of its striped face and yellowed teeth -- through his shirt. \n               Through flesh, and deeper, GROWLING insanely while COOCH \n               HOLLERS in shock tries to pull free and --\n\n               Jimmy Looks Twice spins from the porch with a skillfully \n               executed back kick, knocking Ray off the step and to the \n               ground. The Indian bolts like a deer into the darkness.\n\n               Ray rolls in the grass, throwing his M-16 up. He hesitates. \n               But only for a moment before FIRING and decimating the corner \n               gutter, a junked car, several trees. But no sign of Jimmy.\n\n               Cooch falls back in the grass badly mauled. His arm has been \n               ripped open down to the bone.\n\n                                     COOCH\n                         Jesus... Jesus...\n\n               Ray starts toward Cooch.\n\n                                     COOCH\n                         Get him...\n\n               Ray takes off, crashing through weeds, into a stream, wading \n               through mud. He throws his flashlight left and right. He \n               crosses the river, shines the light in a field of wild sage. \n               Nothing. He runs like a sprinter, looking everywhere. But as \n               he enters an --\n\n               OPEN FIELD\n\n               all he finds is Jimmy's towel. He picks it up and looks around \n               the area, breathing heavily.\n\n               And then suddenly, something leaps up out of the grass. Ray \n               swings his M-16 up, ready to blast. But it is a DEER, taking \n               off into a mystical blue night. THE DRUM. Beating fast. Heavy.\n\n               TURTLESHELL RATTLE. EAGLE BONE WHISTLES.\n\n               IN THE YARD\n\n               Cooch traps his bleeding arm between his knees to stanch the \n               blood. He speaks quietly but firm into his radio, trying to \n               stay in control.\n\n                                     COOCH\n                              (into radio)\n                         Assault on federal officers. Suspect \n                         has left the area. One officer down. \n                         Issue a Fugitive Alert immediately. \n                         Over.\n\n                                     RADIO\n                         Has the officer been shot, X-22?\n\n                                     COOCH\n                         No, the officer's been bitten by a \n                         fucking badger, okay? Get a Fugitive \n                         Alert fucking now! Over.\n\n               EXT. BEAR CREEK RESERVATION - LANDSCAPE - SUNRISE\n\n               A mind-blowing Aurora. Living clouds. The incredible mesa. \n               PULLING BACK slowly to the dirt road where a line of federal \n               aerials high, enter Indian Country.\n\n               HEARTBEAT DRUM. But a fast heartbeat. A relentless pulse \n               throughout --\n\n               AN FBI SATURATION SEARCH\n\n               FOUR AGENTS surround a little tar-paper shack, rifles up and \n               ready. Two go in, and flush out an OLD WOMAN, an OLD MAN, \n               and some TEN CHILDREN. DOGS.\n\n               A SMALL TRAILER that has thirty junked cars in its yard and \n               serves as a reservation parts store is crawling with FEDERAL \n               MARSHALS; car doors are being opened, trunks. TRACKING DOGS \n               run through the cars. WARPATH DRUMS...\n\n               -- A BELL UH 1-B \"HUEY\" HELICOPTER chutters low over the \n               grasslands, over the Badlands, flattening wheat. It swings \n               down over the main settlement. CHILDREN gather in the street \n               to look up at it but then run when --\n\n               -- SIX FEDERAL CARS come down the main road. They pass by --\n\n               -- THE FRONT PORCH OF THE TRADING POST where Ray stands, \n               talking to the elders. A few of the same from earlier but \n               several new ones.\n\n               He is sweat-drenched, and has shed his jacket and tie. He is \n               showing them photos of Jimmy but getting no response. And \n               then, for a little iodine on top of that, a MOTORCYCLE ENGINE, \n               spitting and choking and coughing comes around the corner, \n               Walter Crow Horse, manning the handlebars.\n\n               He pulls up to Ray and just looks at him. DRUMS FADE.\n\n                                     CROW HORSE\n                         You're an easy man to track, Ray. Ya \n                         walk like a penguin with a hard-on.\n\n                                     RAY\n                         Is that right? What are the trees \n                         saying today?\n\n                                     CROW HORSE\n                         They're sayin' that nobody's gonna \n                         talk to you cuz they don't give away \n                         one of their own. But they did say \n                         there's somebody way across the Little \n                         Walking River who wants to talk to \n                         you.\n\n               Ray soaks sweat off his forehead as he eyes the Indian on \n               this one. He sees himself in the polaroid shades.\n\n                                     CROW HORSE\n                         He sent me to find ya. He says he's \n                         got information.\n\n                                     RAY\n                         Let's go.\n\n               Ray quickly leaves the porch.\n\n               EXT. GRANDPA SAM REACHES TRAILER - OUTSIDE SETTLEMENT - DAY\n\n               Silent. The unnerving silence of the Great Plains filled \n               only by FLYS, big horseflies, buzzing around drying sage \n               that hangs from the rafters of a shade arbor. A GOAT stands \n               under it, just gazing across --\n\n               the vast spread of grass and dry land where an ancient \n               Airstream trailer sits lop-sided. Sheets are hung as curtains. \n               Six old cars -- two from the early 50'a -- sit stripped to \n               the hubs on blocks in the overgrown grass. The air is dry \n               and heavy and the only sound is --\n\n               FLYS. Ray swats at them as he steps over a truck seat that \n               lies in the grass, stuffing and springs hanging out. Crow \n               Horse walk. a few steps ahead, toward the trailer.\n\n                                     CROW HORSE\n                              (with reverence)\n                         Grandpa Samuel Reaches. Heavy duty \n                         medicine.\n\n                                     RAY\n                         Medicine. As in medicine man?\n\n               Crow Horse nods slowly, looking at Ray in a very serious \n               manner\n\n                                     RAY\n                         Why does he wanna see me?\n\n                                     CROW HORSE\n                         Good question. Hardly sees anybody \n                         anymore. Hasn't left this place in \n                         twenty years. Did you bring some \n                         tobacco?\n\n               Crow Horse stops walking, making Ray do the same.\n\n                                     CROW HORSE\n                         When you go see an elder, you always \n                         bring some tobacco as a gift.\n\n               Ray reaches into his shirt pocket and fishes out a pack of \n               Marlboro. Crow Horse glances at it, and shrug-nods. They \n               continue on toward the trailer.\n\n               INT. GRANDPA REACHES TRAILER\n\n               Grandpa Samuel Reaches sits in a taped and tuckered easy \n               chair, his alert black eyes moving from side to side. We \n               recognize him from the sweat lodge ceremony at Looks Twice' \n               although today he wears a straw cowboy hat giving him a more \n               youthful look despite a face like a map of the Badlands.\n\n               He wears a vest over a western shirt, baggy work slacks, old \n               cowboy boots.\n\n               His brown wrinkled hands run over the top of the Marlboro \n               pack as if he's reading braille.\n\n               Crow Horse sits across from him on a stool. Ray leans on one \n               of the plain green walls, looking uncomfortable. A three \n               foot adhesive fly strip hangs from the ceiling, thick with \n               dead ones. There is a black and white TV with Sesame Street \n               wailing, honking and guffawing through static.\n\n               Grandpa fixes his eyes on Ray for only split seconds at a \n               time but one gets the feeling he's doing an incredibly deep \n               reading of the young man. Slowly, he sits up -- focusing \n               intensely on Ray.\n\n               He begins to speak. A hoarse, strained, string of LAKOTA, \n               spoken like it used to be, gesturing toward Ray. When he \n               finishes, he sits back in his chair. Ray looks intrigued.\n\n                                     RAY\n                         What did he say?\n\n                                     CROW HORSE\n                         He wants to know if you ever watch \n                         the Cookie Monster. He says the Cookie \n                         Monster is not to be trusted -- a \n                         trickster.\n\n               Ray looks puzzled. Crow Horse laughs bull-wild as Grandpa \n               takes up a fly swatter and takes out a big horsefly. The old \n               man begins speaking Indian again.\n\n                                     CROW HORSE\n                         He says there's something wrong with \n                         Big Bird -- he's crazy,\n                              (stops laughing)\n                         He says you stopped the Inipi ceremony \n                         last night...?\n\n               Crow Horse turns a questioning look at Ray. Ray doesn't \n               flinch.\n\n                                     CROW HORSE\n                         But he is not unhappy with you because \n                         he knows you.\n\n                                     RAY\n                         He knows me?\n\n                                     CROW HORSE\n                         He says he saw you in a vision some \n                         time ago.\n\n               Crow Horse stops translating suddenly even though the old \n               man continues speaking. Crow Horse looks concerned, and ASKS \n               A QUESTION IN LAKOTA. We don't know what he's asking but the \n               tone is absolute amazement.\n\n               This question triggers an exchange between he and Grandpa, \n               the old one getting angry. Grandpa wins.\n\n                                     CROW HORSE\n                         I guess he had this vision some time \n                         ago, in the Moon of the Popping Trees -- \n                         uh, back in the winter. He says you \n                         come from Wasi'cu city in the East \n                         but that your people... way back... \n                         are of the Minniconjou Sioux. But \n                         you yourself don't know that.\n\n               Ray's brow is drawn tense as he stares at the old Indian, \n               absorbing the translation. Grandpa speaks more fervently \n               now, incorporating Indian sign. Each time Grandpa does the \n               hard Sioux HAND SLAP, Ray blinks.\n\n                                     CROW HORSE\n                         He says he knew you'd be coming to \n                         Bear Creek. He was told. It is the \n                         will of Tunkasilia -- the grandfather \n                         that you come here. He says let's \n                         smoke the caanunpa the sacred pipe, \n                         symbol of truth. So that there will \n                         be no lies between us.\n\n               The old man has taken a long wooden stem and a red stone \n               bowl from a beaded pipe bag. He joins the two together then \n               begins offering a pinch of tobacco to the Four Directions. \n               While this goes on, Ray fidgets.\n\n                                     RAY\n                         What's he smoke in that?\n\n                                     CROW HORSE\n                         Sacred herbs. Tobacco. Don't worry, \n                         we don't smoke no Mexican agriculture \n                         in The Pipe. That's a white man's \n                         myth. This is a sacrament.\n\n               The old man is offering the pipe to Ray.\n\n                                     GRANDPA\n                         Mltaku Oyasin.\n\n               Ray looks at Grandpa. The old man offers the pipe again.\n\n                                     CROW HORSE\n                         You don't smoke with him, it means \n                         you're hiding something.\n\n               Ray takes the pipe, looks at it... then passes it to Crow \n               Horse. The big Indian takes it from Ray, giving him a long \n               eye, then offering the pipe to The Directions before smoking.\n\n               Crow Horse puffs hard, eyes closed, then slowly releases \n               some smoke upward. Ray watches it climb and fade. The old \n               man then takes up an old turtle shell rattle. He speaks.\n\n                                     CROW HORSE\n                         He says Wakan. Sacred. Five hundred \n                         year old turtleshell rattle, passed \n                         down from the Grandfathers. Heavy \n                         duty.\n\n               He shakes the rattle very slightly, moving it in front of \n               Ray. He speaks just above a whisper.\n\n                                     CROW HORSE\n                         He says, it is good. The Spirits are \n                         here. The Spirits want to know what \n                         you're doing here?\n\n               Ray smirks.\n\n                                     RAY\n                         Tell him I'm trying to find the man \n                         who murdered Leo Fast Elk. Ask him \n                         if he knows where he is.\n\n               Crow Horse asks the old man in Lakota. No answer. The pipe \n               is back to grandpa, and he offers it to the Directions, to \n               the Earth then upward before smoking himself. He begins to \n               speak again.\n\n               Passionately. In long glottal Sioux sentences, adding sign, \n               fingers crossing, brushing an arm, a slap here and there,\n\n               He is working himself into an excited state, and Ray keeps \n               looking at Crow Horse, very interested in the old man's \n               answer.\n\n               Finally Grandpa's breath comes up short and wheezing, he \n               ends his oratory with a solid hand slap.\n\n                                     RAY\n                         What did he say?\n\n                                     CROW HORSE\n                         He said he doesn't know.\n\n                                     RAY\n                         He just did the Gettysburg Address \n                         in Sioux. What did he say?\n\n               Crow Horse ignores him. Grandpa speaks again. More hand \n               language.\n\n               The old man is staring at Ray while whispering to Crow Horse. \n               He strokes his badger claw necklace.\n\n               Crow Horse looks at Ray and seems hesitant to translate this \n               new piece of information.\n\n                                     CROW HORSE\n                         Uh... Grandpa likes to trade; no one \n                         stops by here without gettin' stuck \n                         in the old Indian barter. He, uh... \n                         he likes your shades.\n\n               Grandpa smiles toothlessly. Ray who has his driving glasses \n               in hand, lifts them to say \"these?\" but Grandpa sees it as \n               an accepted deal, and swiftly removes his necklace. He holds \n               it out.\n\n               Ray slowly, hesitantly surrenders his sunglasses, and takes \n               the necklace. Crow Horse bursts into laughter and so does \n               Grandpa, enjoying a good trade. He draws a hand through the \n               air in a sort of horizontal karate chop, meaning done deal. \n               Ray looks confused. Out of his element. And out of his shades.\n\n               Another fly gets snagged on sticky tape.\n\n               EXT. GRANDPA REACHES TRAILER\n\n               Crow Horse is hurrying toward his bike, Ray with him.\n\n                                     RAY\n                         What was he saying?\n\n                                     CROW HORSE\n                         Why should I tell you.\n\n                                     RAY\n                         Because he was talking to me.\n\n               Crow Horse keeps walking.\n\n                                     RAY\n                         Does he know something?\n\n               Crow Horse stops walking and eyes Ray, deliberating.\n\n                                     CROW HORSE\n                         The old man saw an owl. Over there \n                         in the dry wash. Last week.\n\n                                     RAY\n                         And...\n\n                                     CROW HORSE\n                         He saw an owl.\n\n               A silent moment. Ray tries to figure out what he's missing \n               here.\n\n                                     RAY\n                         So what?\n\n                                     CROW HORSE\n                         The owl is a messenger. When one \n                         shows itself to a Sioux... it means \n                         someone's gonna die. The owl told \n                         him about Leo.\n\n               Ray stares vacantly.\n\n                                     RAY\n                         The owl told him about Leo. That's \n                         incredible. I guess we just broke \n                         the back of this investigation, didn't \n                         we? Evidence doesn't get any harder \n                         than that -- not for my money. Is \n                         there anyway we can seduce this owl \n                         into Federal Court?\n\n                                     CROW HORSE\n                         He also said \"listen to the water.\"\n\n                                     RAY\n                         Listen to the water. Listen to the \n                         owl. He also said, don't trust the \n                         fucking Cookie Monster.\n\n                                     CROW HORSE\n                         Go back to your DNA finger-printin'.\n\n               Crow Horse KICK STARTS his bike and burns off down the drive\n\n               Ray feels the presence of the old man, standing behind the \n               busted screen door. Just watching.\n\n               OVER THIS, A SCREAMING. A HIGH-PITCHED, CHILLING, SCREAM \n               that takes us straight into --\n\n               SLACK TAIL POWWOW GROUNDS - RES - LATER\n\n               CLOSE ON A TERRIFYING FACE -- painted in blazing red and \n               yellow, black around the eyes. A ridge of feathers high along \n               the hairline, and a mouth open, tongue trilling -- SCREAMING.\n\n               A WACIPI\n\n               is going down. A Powow. Held in the center of a huge arbor. \n               This DANCER, a traditional Kit Fox dancer, is dressed in \n               authentic costume and is dancing with TEN OTHERS dressed in \n               various traditional garb and paints.\n\n               Under the arbor, TWO HUNDRED INDIANS in modern clothing sit \n               on blankets or in lawn chairs, watching the dancing. A group \n               of SINGERS sit around a big drum, beating on it, and wailing \n               the song that keeps the dancers hopping.\n\n               SIXTY CARS (res beaters) are parked off around the arbor, \n               less interested kids sitting on them, smoking cigarettes. A \n               few actually have MTV hair-cuts.\n\n               Drifting through the cars and people are Special Agents \n               Couture, Miles, Sherman and Levoi. They stroll through, \n               incongruously, checking out faces. Vehicles.\n\n               Ray slows his step and takes in --\n\n               THE POWWOW CIRCLE\n\n               as the dance ends. WEAK APPLAUSE. The POWWOW CALLER, a big \n               Sioux with a crew-cut and cowboy shirt, speaks through a \n               scratchy P.A. system.\n\n                                     CALLER\n                         Was-te Yelo! Let's have five more \n                         veterans. Five more veterans. Hoka \n                         Hey!\n\n               An OLD-INDIAN MAN sitting in a lawn chair, removes his cowboy \n               hat and reaches down toward a blanket. He brings up his VFW \n               hat, adorned with medals and puts it on. Slowly, he rises, \n               and shuffles out to the center pole along with --\n\n               FOUR OTHER VETERANS who have exchanged cowboy hats for \n               veteran's caps. There is even a traditional dancer in there, \n               wearing a veteran cap. As a mournful WAR SONG is banged out \n               by the singers, a flag is unrolled by the veterans. An \n               American Flag. Unrolled, and set on the mast. And together, \n               all five Indian men, hoist --\n\n               THE AMERICAN FLAG\n\n               high. Slowly it climbs. Proudly. It blows in the hot South \n               Dakota wind.\n\n               OUTSIDE THE ARBOR\n\n               Ray stands, watching this. And then the SONG ENDS. A loud, \n               angry voice breaks across the P.A.\n\n               AT THE CROW'S NEST (CALLER'S BOOTH)\n\n               ANDERSON CHASING HAWK, a young Indian in ribbon shirt and \n               long hair has taken possession of the microphone. SIX W.A.R.N. \n               MEMBERS stand behind him. He speaks loud, firm, with the \n               sharp gestures of an old way Chief.\n\n                                     CHASING HAWK\n                         What is that that you honor there, \n                         uncles? After all the Wasi'cu country \n                         has done to you, after all he still \n                         does to you, you honor that flag?! \n                         That flag has been desecrated by the \n                         United States, because they have not \n                         honored what that flag represents!\n\n               The veterans just stand under the flag, solemn, looking at \n               Chasing Hawk. The flag undulates soundlessly.\n\n                                     CHASING HAWK (O.S.)\n                         To them, we are the Bank of America. \n                         Whenever they get into a little \n                         difficulty, they go to The Bank, \n                         withdraw a little land, withdraw a \n                         little oil --\n\n               OUTSIDE THE ARBOR\n\n               the four FBI agents stand, watching.\n\n                                     MILES\n                         Okay. Here we go.\n\n                                     COOCH\n                         Who's this guy?\n\n                                     SHERMAN\n                         Anderson Chasing Hawk. Second in \n                         command behind Jimmy.\n\n               AT THE CROW'S NEST\n\n               Chasing Hawk hands the mic over to another Warrior. MAGGIE \n               EAGLE BEAR would be the most beautiful woman Ray has even \n               seen if she was not the meanest-looking. Her thick black \n               hair falls over a denim jacket down below her horse-hair \n               belt. Her faded jeans are stuffed into worn cowboy boots. \n               And she is full of fire. She begins speaking in LAKOTA. \n               Fluently. And with hand sign, like the old man.\n\n               OUTSIDE THE ARBOR\n\n               the agents stand. Cooch is writing into a small notebook.\n\n                                     SHERMAN\n                         Magedelana Eagle Bear. Eagle's claws \n                         and a bear's balls.\n\n                                     MILES\n                         She keeps an AR-15 assault rifle in \n                         her truck. And she'll use it.\n\n               As Ray watches her, someone approaches in a less hostile \n               manner. It is President Clear Moon, looking very upset. He \n               holds the hand of a LITTLE GIRL, dressed in traditional \n               dancing garb.\n\n               He approaches Ray.\n\n                                     RAY\n                         Mr. Clear Moon.\n\n                                     CLEAR MOON\n                         Our police are afraid of them. Please \n                         get them out of here.\n\n               Clear Moon gestures for the little girl to run off. He leans \n               in close to Ray.\n\n                                     CLEAR MOON\n                         They're going to kill me next. That's \n                         what I hear. These new Indians are \n                         destroying everything. Our people \n                         are a quiet people.\n\n                                     RAY\n                         They can lead us to Jimmy. Just let \n                         them go. We're tightening the net on \n                         him. We know he's on the reservation.\n\n               Clear Moon is looking past Ray at the Warriors. They are \n               approaching the agents, and Clear Moon looks at Ray with \n               great concern.\n\n                                     CLEAR MOON\n                         Help us.\n\n               And he slowly retreats to his lawn chair under the arbor.\n\n               Chasing Hawk, Maggie and the other Warriors strut up to the \n               agents. All but one who is bound to a wheelchair. We've seen \n               RICHARD YELLOW BIRD, the big Cheyenne who wears a Red Power \n               baseball cap, an earring, and thick bifocals -- in one of \n               the file photos. His arms are plastered with tattoos.\n\n                                     AGENT SHERMAN\n                         Where's Jimmy? We thought he'd be \n                         dancing today.\n\n               The warriors make a show of not acknowledging the FBI \n               presence. They have walked over here just to walk by them. \n               That is there statement. But Yellow Bird stops cranking the \n               wheels of his chair and stop: long enough to look up at Ray.\n\n                                     YELLOW BIRD\n                         Are you the Washington Redskin?\n\n               Even the agents crack grins at this bit of Indian wit. All \n               but Ray who just stands there, arms folded across his chest, \n               considering the crippled activist.\n\n                                     AGENT MILES\n                         Say hello to Richard Yellow Bird, \n                         Ray.\n\n               Yellow Bird sits there, staring up at him through thick \n               glasses But then Maggie Eagle Bear takes the handles of Yellow \n               Bird's wheel chair. She looks at Ray with eyes that are choke-\n               cherry black, eyes that look right through him. He returns \n               the glare. And then she pushes Yellowbird forward and leaves \n               the feds alone.\n\n               Ray turns to Cooch who is lighting a cigarette, and \n               concentrating on the movements of this group as they wander \n               under the arbor, visiting people. LAKOTA SINGERS start up.\n\n                                     COOCH\n                         Ray, get to Jimmy's place and keep \n                         it tight. I'm gonna get a tail on \n                         his Warriors.\n\n               IN THE POWWOW CENTER\n\n               the under ten year-old \"fancy dance\" -- TWENTY-FIVE INDIAN \n               CHILDREN, whirling and stomping and dancing.\n\n               JIMMY LOOKS TWICE HOUSE - NIGHT\n\n               The battered old house sits under a full moon. The upside \n               down flag moves slightly in the cross winds.\n\n               ACROSS THE ROAD\n\n               several junked cars. Among them a black, rusted out VW van \n               with a smashed windshield. A PACK OF RES DOGS sniff at its \n               tires.\n\n               INT. JIMMY'S VAN\n\n               In the dim light, a boot. A black cowboy boot. Up on the \n               dash. Bluejeans. T-shirt. Second hand leather. And a black \n               cowboy hat. Ray is staking out Jimmy's house.\n\n               Across the passenger seat and console is an M-16 rifle. On \n               his belt, a .357 Red Hawk. He yawns. From outside, he hears \n               a sound.\n\n               POV: down below the van, a small, patchy RES DOG with a \n               missing leg is looking up at him with his tongue long and \n               salivating.\n\n               RAY breaks off a piece of sandwich and drops it down to him \n               just as -- HEADLIGHTS catch his face. He slides down low, \n               watching an old pick-up truck creak onto the dirt road, \n               leading to Jimmy's.\n\n               POV: the truck parks. Someone jumps out, gracefully. Indian. \n               Long braid. Quick steps. Front door. Inside.\n\n               RAY lifts his radio.\n\n                                     RAY\n                         X22. Read.\n\n                                     RADIO\n                         Go ahead, Ray.\n\n                                     RAY\n                         I have a pick-up truck. No plates. \n                         Subject -- Indian -- entering \n                         suspect's house. Over.\n\n                                     RADIO\n                         Okay, Ray. I'm coming in. If he starts \n                         to leave the area, move in. And hold \n                         him. Over.\n\n               Ray sets his radio down, unclips the leather guard on his \n               handgun. Picks up the Big Mac.\n\n               EXT. LOOKS TWICE HOUSE - NIGHT\n\n               The front door creaks open, and the subject dashes back out. \n               In the dark we cannot latch onto features.\n\n               Suddenly the junker van comes alive, guns onto the dirt road, \n               racing toward the running Indian who gets the door of the \n               truck open but freezes in the van's highbeams as --\n\n               Ray leaps out, M-16 in hand.\n\n                                     RAY\n                         FBI, freeze, Motherfucker -- drop \n                         it, drop it!\n\n               Ray maneuvers in Quantico fashion, keeping the rifle on the \n               Indian's back. The Indian drops what he's holding. And turns \n               around. It's not a he. We've seen her before. At the Powwow. \n               Maggie Eagle Bear. Her hair is pulled back tight, braided.\n\n               Ray moves in toward her, surprised at first, but still \n               cautious\n\n                                     RAY\n                         Turn around, put your hands on the \n                         roof of the truck.\n\n               She does what he tells her. As Ray moves in on her, he notices \n               an INDIAN CHILD sitting in the passenger seat, looking out \n               into the highbeams, frightened.\n\n               Ray toes Maggie's legs out wider, frisks her one-handed, \n               pats down her boots.\n\n                                     MAGGIE\n                         You're the Indian FBI.\n\n                                     RAY\n                         That's right. Turn around.\n\n               Maggie turns around, looks Ray in the eye. He looks self-\n               conscious in the cowboy hat.\n\n                                     MAGGIE\n                         The people are glad they sent you. \n                         They usually send in guys who come \n                         at ya with highbeams, screamin' \"drop \n                         it, Motherfucker\", stick a gun in \n                         your face, frisk ya down. Even if ya \n                         got a child with ya. No, it's good \n                         to have ya. It's gonna be was-te \n                         times on the res.\n\n               Ray is looking down at what she dropped. A bundle lying in \n               the grass. He bends down, starts to untie it.\n\n                                     MAGGIE\n                         I was gonna warn ya about messin' \n                         with somebody's medicine bundle but \n                         I forgot you know all about that \n                         stuff.\n\n               IN THE BUNDLE -- an eagle skull, tobacco strings, sage, sweet \n               grass, and several white eagle feathers.\n\n                                     RAY\n                         This Jimmy's?\n\n                                     MAGGIE\n                         You're not gonna catch him. He can \n                         shape-shift into different animals. \n                         Bear. Elk. Porcupine.\n\n                                     RAY\n                         Is that like an hereditary thing, \n                         Magdelana, or can one take classes?\n\n                                     MAGGIE\n                         Jimmy didn't kill Leo. Why do you \n                         wanna do this?\n\n                                     RAY\n                         He tried to kill him twice before. \n                         That's a good place to start don't \n                         ya think? Leo was on the other side, \n                         wasn't he?\n\n                                     MAGGIE\n                         -- Leo was an apple, that's right. \n                         Red on the outside, white on the \n                         inside. And Jimmy hated him. Kicked \n                         his ass a coupla times. But he didn't \n                         kill him.\n\n                                     RAY\n                         Who did?\n\n                                     MAGGIE\n                         You're the FBI. That's your job, \n                         isn't it? Ya know how many of our \n                         Warrior brothers got killed out here? \n                         I never saw any investigating then. \n                         Why now? What's going down here?\n\n                                     RAY\n                         A Fugitive Alert for a murder suspect. \n                         Before somebody else gets a shotgun \n                         blast in the spine.\n\n                                     MAGGIE\n                         Try the Fort Laramie Treaty. All \n                         over again.\n\n               Ray doesn't have a clue as to what this radical bullshit is \n               about.\n\n                                     RAY\n                         Look. You and I can stand here in a \n                         culture clash til the sun comes up, \n                         talking about what's right and what's \n                         wrong. You're from the reservation. \n                         It's a different world.\n\n                                     MAGGIE\n                         I'm from Minneapolis. Fifth Street. \n                         I did four years at Dartmouth before \n                         I ever set foot on this res. So I \n                         know about the other world, Ray.\n\n               If this information doesn't throw Ray, the use of his first \n               name does.\n\n                                     MAGGIE\n                         Are you gonna keep that medicine \n                         bundle or are you gonna respect its \n                         power?\n\n               Ray is holding the medicine bundle. He deliberates, then \n               hands it over. She takes it with careful hands, casting a \n               somewhat surprised look up at him.\n\n                                     MAGGIE\n                         Thank you.\n\n                                     RAY\n                         When you see Jimmy, tell him the \n                         sooner he turns himself back into a \n                         human being and gives himself in... \n                         the sooner we back off this \n                         reservation. Okay?\n\n               Maggie gets in the truck, starts it up. She looks out at \n               him, studying him. Trying to figure him out. HEADLIGHTS are \n               coming fast from down the main road.\n\n                                     MAGGIE\n                         Grandpa Reaches says you come from \n                         heavy Indian blood. I used to think \n                         Grandpa was gettin' senile. Now I \n                         know he is.\n\n                                     RAY\n                         Move it, Magdelana.\n\n               Maggie drives forward, turning down another little wagon \n               road, and bumping into the black night only moments before, \n               Cooch's Le Baron pulls in.\n\n               SA Miles and Sherman's vehicle pull in behind it. The regional \n               feds fall in behind Cooch, everyone, packing rifles.\n\n                                     COOCH\n                         Ray, you alright?\n\n               Ray turns, nodding. An FBI van pulls in from the other \n               direction and FOUR AGENTS empty out, wearing FBI windbreakers \n               and heavily-armed.\n\n                                     AGENT SHERMAN\n                         What do we got, Ray?\n\n                                     RAY\n                         It was just Eagle Bear. I questioned \n                         and released her.\n\n                                     COOCH\n                         What'd she say?\n\n                                     RAY\n                         She talks a lot of shit. We're not \n                         doing our job. Jimmy's innocent. \n                         \"What's the FBI really doing here.\" \n                         Some shit about the Fort Laramie \n                         Treaty.\n\n               Cooch nods. The agents form a tight unit out below the upside \n               down flag.\n\n                                     RAY\n                         She took something from the house. \n                         What she called a medicine bundle. \n                         Most likely Jimmy's.\n\n                                     COOCH\n                         Let's see it.\n\n                                     RAY\n                         I gave it back to her.\n\n                                     AGENT SHERMAN\n                         Why?\n\n                                     RAY\n                         If it is Jimmy's, she's taking it to \n                         him. We'll have a runner. But I \n                         borrowed a little mojo...\n\n               Ray reaches inside his pant leg, down around his boot and \n               carefully removes a white eagle feather. He gingerly tucks \n               it in a plastic bag.\n\n                                     COOCH\n                         Way to go, Raymond. Miles, take that \n                         to lab. Sherman, I want you to go \n                         back to base and produce some written \n                         material. Something that indicates \n                         that our girl Maggie is leaking \n                         information to us. And make sure \n                         that material finds its way into the \n                         hands of the Warrior Movement.\n\n               Sherman and Miles, take off. Cooch, an impressive master of \n               COINTELPRO, now turns to the van squad.\n\n                                     COOCH\n                         You gentlemen missed that medicine \n                         basket. Go back through the house, \n                         and make sure you missed nothing \n                         else. And lay some wire, too. Let's \n                         do it.\n\n               The van squad moves toward the house, leaving Cooch and Ray \n               alone in the highbeams that light the yard.\n\n                                     COOCH\n                         That's good goddamn work, Ray. Let \n                         the salmon run. Let 'em run Upriver.\n\n                                     RAY\n                         Why we setting Eagle Bear up as an \n                         informant?\n\n                                     COOCH\n                         Her own people start to suspect her, \n                         it creates discord from within. The \n                         Warriors don't know who to trust, \n                         they start infighting, and Jimmy \n                         loses his support.\n\n               Ray nods, impressed.\n\n               Cooch bends down near the road, touches the dirt.\n\n                                     COOCH\n                         Her oil pan is shot.\n\n                                     RAY\n                         Cooch. What's the Fort Laramie Treaty?\n\n                                     COOCH\n                         Jesus, I don't know. You tell me. \n                         You're the Indian.\n\n               Cooch wipes the oil on a handkerchief as he rises, smiling \n               playfully at Ray. He starts back toward his car. Some sort \n               of bird is COOING in the night.\n\n                                     COOCH\n                         Get a tail on her, Ray.\n\n               Ray looks up at the upside down flag. Then watches Cooch \n               walking way.\n\n                                     RAY\n                         Cooch.\n                              (a quiet, tired laugh)\n                         Where the fuck did they send us?\n\n                                     COOCH\n                         A long way from home. You be careful \n                         out there.\n\n               Cooch, standing there with his glasses on and his right arm \n               bandaged, looks tired, too. He gets in his car.\n\n               In the yard, Ray starts for the van, the res dog, trying to \n               follow. He chases it away. And then as he gets closer to the \n               van, he looks up to investigate the COOING SOUND.\n\n               AT THE TOP OF THE FLAG POLE\n\n               there is a shadow. What looks to be a large bird. It just \n               hovers. In the shadows.\n\n               DOWN BELOW\n\n               Ray looks up at the pole, watching. Then walking on.\n\n               EXT. BEAR CREEK RES - SUNRISE\n\n               Mind-blowing sunrise of airbrush red. Clusters of lodge-pole \n               pine. The spectacular mesa. PAINT HORSES graze in a field, a \n               few out in the center of the road.\n\n               AT GRANDPA REACHES TRAILER\n\n               the old man comes down the front steps in a frail walk, \n               carrying a paper plate. He steps down into the sage clusters \n               that grow just off his trailer, and offers the plate up toward \n               the sky.\n\n               He then stoops, and scrapes a half-eaten English muffin, \n               some potato chips and half a banana onto the Earth in a neat \n               pile.\n\n               He straightens his back the best he can, looks up again, and \n               prays softly.\n\n               THE BADLANDS\n\n               possess an otherworldly beauty at this magic hour, a maze of \n               shadows and rainbows. In the distance we cannot mistake the \n               frame of Walter Crow Horse. He's out there, long hair blowing \n               against the white bluffs. Stalking. Tracking.\n\n               ON THE VILLAGE ROAD\n\n               a puppy chases a hen in a klutzy, innocent manner then bumps \n               into the tire of a parked car. Taking a shot at doghood, he \n               hikes his leg, squirts a hubcap belonging to --\n\n               Cooch's Le Baron. Cooch leans on the hood, drinking a coffee \n               from a foam-plastic cup, and supervising SIX G-MEN who have \n               a map spread out over the hood and are discussing it.\n\n               MAGGIE EAGLE BEAR'S HOUSE\n\n               is way out in a remote corner of the res, a little home, \n               trailer and tipi right on the river. The river is rushing \n               hard this morning, catching the light of the sun. Maggie's \n               truck is parked in front.\n\n               Out at the river, Maggie, her hair long and unbrushed, and \n               wearing an extra large T-shirt and nothing else is hauling \n               water in buckets from the river.\n\n               THREE INDIAN CHILDREN are with her, helping her. Near the \n               house, an OLD WOMAN in bifocal glasses, feeds some chickens, \n               and a cat that gathers with the chickens and eats feed.\n\n               INT. OLD VAN \u0096 NEAR MAGGIE'S\n\n               Ray, still in his field clothes sits, training binoculars on \n               the distant house. He opens a carton of milk, drinks some. \n               Then hears a whimpering. In the passenger seat sits the three \n               legged res dog. Ray has taken him with him. He drinks some \n               milk, then opens the carton up fully and sticks it out so \n               the dog can lap it up. Ray laughs in disbelief, shaking his \n               head.\n\n                                     RAY\n                         For all I know, you're Jimmy. And \n                         you're just waiting for a shot at my \n                         jugular. Drink, Jimmy. Milk is good \n                         for you --\n\n               The dog is lapping the milk, desperately. And then a ROARING. \n               A motorcycle.\n\n               IN THE SIDE MIRROR: Crow Horse, racing up on the left of the \n               van. Ray pulls his hat down low, and sits back. The motorcycle \n               passes on the left, slowing enough so that Crow Horse can \n               flip Ray the middle finger. Then he races on, far down the \n               road.\n\n               Ray sits there, shaking his head. He'll let it go. Bullshit. \n               He starts the car.\n\n               EXT. TRIBAL POLICE SHOOTING RANGE - DAWN\n\n               Crow Horse guns in, sliding in dirt up to the run-down, low \n               budget shooting range -- six plastic milk jugs on sticks, \n               jammed in the mud.\n\n               A moment later, the van hammers in. Parks. Ray gets out. \n               He's removed his hat so as not to invite any crap from Crow \n               Horse.\n\n                                     CROW HORSE\n                         Don't be mad. That was just an old \n                         traditional gesture that means hello, \n                         how are you.\n\n                                     RAY\n                         I see. Forgive my cultural ignorance.\n\n               Ray executes a hard, slapping, \"up your ass\" gesture.\n\n                                     RAY\n                         Have a nice day.\n\n               Crow Horse bursts into laughter in his raspy, staccato laugh. \n               He walks off a few steps, picks up a spent shell and pitches \n               it. His laughter simmers and he gets serious.\n\n                                     CROW HORSE\n                         Jimmy didn't do it, Ray. I checked \n                         it out. You can stop taggin' my \n                         sister.\n\n                                     RAY\n                         She's your sister?\n\n                                     RAY AND CROW HORSE\n                         Spiritual sister.\n\n                                     RAY\n                         Gotchya. We just nailed a genetic \n                         match between the eagle feather left \n                         at the murder site and one in Jimmy's \n                         medicine bundle. It came from a white \n                         eagle. Same bird.\n\n               Crow Horse fingers an eagle feather that hangs from his hat \n               band.\n\n                                     CROW HORSE\n                         So did this one. Wambli is a rare \n                         and sacred creature. When someone \n                         finds a dead one, the feathers get \n                         around the res. We share everything. \n                         A lot of power in the eagle feathers. \n                         But you think that's bullshit too, \n                         don't --\n\n                                     RAY\n                              (ala Crow Horse)\n                         -- Leo Fast Elk was sitting in the \n                         outhouse at Maisy Blue Legs when a \n                         car pulled into the yard. He came \n                         out, approached the vehicle then saw \n                         that the man behind the wheel was \n                         Jimmy. He tried to get back into the \n                         trailer, but the car came highballing \n                         at him. He started running for the \n                         open grass. With the car moving, \n                         Jimmy hung his shotgun out the window, \n                         took aim -- missed once, hitting the \n                         shitter -- fired again, and severed \n                         Leo's spine. Leo fell, rolled, and \n                         came to a stop in the grass. And \n                         some chicken feed. Stale chicken \n                         feed with four days mold.\n                              (a beat)\n                         Electromagnetic printing.\n\n               Crow Horse stares, a little surprised.\n\n                                     CROW HORSE\n                         Was-te. 'Cept for one thing. Jimmy \n                         Looks Twice was nowhere near there. \n                         Ya see, when Jimmy was twelve years \n                         old, his mother and father was killed \n                         in a car wreck right down there near \n                         Elk Mountain.\n\n                                     RAY\n                         I don't see the connection.\n\n                                     CROW HORSE\n                         The connection is, it did a head \n                         number on him. He's petrified of \n                         cars. Won't drive. I've known him \n                         all my life, and he's never gotten \n                         behind the wheel of a vehicle. He \n                         rides passenger and he rides horses, \n                         and that's it. The man that shot Leo \n                         down was behind the wheel of a moving \n                         car.\n\n               Ray absorbs this with great interest.\n\n                                     RAY\n                         That's not solid.\n\n                                     CROW HORSE\n                         You want solid? That one, single, \n                         print he left in the Badlands -- the \n                         one the FBI missed and then stepped \n                         all over -- it belongs to a man who \n                         walks heels first. Like a white man. \n                         Jimmy has a serious Ind'n walk -- \n                         ball of the foot first. The man who \n                         murdered Leo walked like a Wasi'cu.\n\n               Ray lets a pent-up sigh escape.\n\n                                     RAY\n                         You're saying a white guy did it...\n\n               Crow Horse chews this over, unable to hide a nagging \n               frustration. He shakes his head.\n\n                                     CROW HORSE\n                         When Leo was dumped out there in the \n                         Badlands, he was dropped on his back. \n                         Our man made an effort to turn him \n                         over, onto his face. It's an old \n                         Ind'n belief that if a dead man is \n                         turned face down, his spirit won't \n                         leave. And in the killer's case, it \n                         won't come back and jump all over \n                         his shit. That's an Ind'n thing a \n                         white man wouldn't know.\n\n               The two of them stand there, thinking this over. Ray takes \n               out his notebook and starts writing. Crow Horse walks away, \n               turns to face the propped up targets.\n\n                                     CROW HORSE\n                         And that's the way it is. Write it \n                         down.\n\n               To punctuate, Crow Horse slaps leather, draws his .38, and \n               begins blasting at the milk bottles. He hits the bank. A \n               tree. One of the posts. But not a single target.\n\n               When he is done, he looks over his gun, disappointed. Starts \n               reloading. Ray starts laughing, looking at the missed targets\n\n                                     CROW HORSE\n                         You laugh all you want, Breed. Sunset \n                         tonight, I get my man.\n\n               Ray looks at Crow Horse, sees that he's serious, and follows \n               him toward his motorcycle.\n\n                                     RAY\n                         Alright, Crow Horse. I'm listening. \n                         I'm listening to the trees, to the \n                         stones. Who is it?\n\n               Crow Horse turns toward Ray, and creates a long dramatic \n               pause.\n\n                                     CROW HORSE\n                         Damned if I know.\n\n               And he hauls his bulk onto his motorbike.\n\n                                     CROW HORSE\n                         But the Old One. He did a Yuwipi \n                         ceremony last night.\n\n               Crow Horse winks at Ray as he slams the kickstart. To no \n               avail.\n\n                                     RAY\n                         The old man? He's gonna tell you who \n                         killed Leo?\n\n                                     CROW HORSE\n                         Go catch Jimmy, Ray. Really. He's \n                         gettin' away. Go ahead, go get him. \n                         I'm late.\n\n                                     RAY\n                         Hey. Hey, those are my sunglasses \n                         you're wearing.\n\n                                     CROW HORSE\n                         Grandpa traded with me.\n                              (flips the bird)\n                         Goodbye.\n\n               And Crow Horse nails his kick start. The BIKE ROARS alive \n               and the Indian works the throttle hard, leaving gravel and \n               black exhaust. Ray stands there, drifting between logic and \n               instinct. He looks at his watch, then starts at a slow, \n               thoughtful shuffle toward his car.\n\n               EXT. GRANDPA REACHES TRAILER - SHORT TIME LATER\n\n               The dust-buzzard broncs and bounces down Grandpa's driveway, \n               coming to a stop near the wrecked cars. Crow Horse dismounts \n               and unhooks a carton of smokes from the back.\n\n               A moment later, the junker van pulls in, bouncing and shaking.\n\n               Crow Horse stares at the approaching vehicle, his eyes hidden \n               behind Ray's former shades. He cracks a slow smile because --\n\n               Ray is stepping quickly from the van, and carrying two packs \n               of Marlboros.\n\n               INT. GRANDPA REACHES TRAILER\n\n               Grandpa sits in his chair, his black eyes moving smoothly \n               from side to side. Smoke enshrouds his ancient face, giving \n               the sense of another time and place. He speaks LAKOTA.\n\n               Crow Horse, sitting on a stool across from him, holds The \n               Pipe. He passes it to Ray who sits in a busted lawn chair \n               next to him. The room is dark as the sun sets out the window \n               in red and purple. Ray looks at the pipe. Grandpa will not \n               speak until Ray smokes. And so he does, drawing on the stem, \n               awkwardly.\n\n               HEARTBEAT DRUM as Grandpa speaks Indian.\n\n                                     CROW HORSE\n                         He says, back behind Red Deer Table, \n                         where the Elk-People-used-to-live... \n                         there are strange creatures from \n                         another world who eat stones... and \n                         who will kill anyone who crosses \n                         into this place.\n\n               Ray looks at Crow Horse, searching for a hint of lightness. \n               But there is only great reverence as he watches Ray blow \n               smoke upward.\n\n                                     CROW HORSE\n                         He says, in the Yuwipi ceremony last \n                         night, he saw you... going back into \n                         the land beyond Red Deer Table. I \n                         was with you. But that was all the \n                         Spirits let him see so he doesn't \n                         know if you were killed or not. But \n                         he thinks you probably were.\n\n               Ray smirks as he passes the pipe to Grandpa. Crow Horse looks \n               nervous. Grandpa offers the pipe to the directions and then \n               disengages the bowl from the stem. He speaks again. Crow \n               Horse translates.\n\n                                     CROW HORSE\n                         Go to the land where the Elk-People-\n                         used-to-live and you will find the \n                         answers you came here looking for. \n                         But you must go as two. That is the \n                         vision. I have spoken. And this is \n                         so.\n\n               Grandpa leans closer to Crow Horse and whispers some Lakota.\n\n                                     CROW HORSE\n                         He wants to trade.\n                              (a beat)\n                         He likes your watch.\n\n               Ray looks at Crow Horse, nervous.\n\n                                     RAY\n                         I can't do that,\n                              (explaining)\n                         It's a Rolex.\n\n                                     CROW HORSE\n                         A what?\n\n               And Grandpa is already holding out something to offer. It is \n               a cigarette. Grandpa offers it again.\n\n                                     RAY\n                         I'm sorry, this is --\n                              (loud to Grandpa)\n                         -- this is very, very expensive. \n                         It's --\n                              (to Crow Horse)\n                         Tell him this is an expensive watch.\n\n               Crow Horse tells the Old Man. Grandpa speaks Indian.\n\n                                     CROW HORSE\n                         He says, you need to go on Indian \n                         time. He says your watch is ruining \n                         your life anyway.\n\n               Ray buries his hands in his jacket pocket. No way. Crow Horse \n               signs to Grandpa \"no.\" Grandpa gets up, crosses between the \n               two young men, up to the TV set. He turns it on.\n\n               WHEEL OF FORTUNE\n\n               explodes in PINGS AND PONGS and a WOMAN'S SHRILL SCREAM.\n\n               EXT. GRANDPA REACHES TRAILER - DAY\n\n               Crow Horse and Ray walk down the steps. WHEEL OF FORTUNE is \n               heard from within.\n\n                                     CROW HORSE\n                         Red Deer Table, Ray.\n\n                                     RAY\n                         Don't tell me: heavy duty.\n\n                                     CROW HORSE\n                         Heavy, heavy duty. Taku Wakan. Wanagi \n                         Spirits. It's one of those few places \n                         we'd never go to as kids. Still don't. \n                         Some of the old people say Crazy \n                         Horse is buried back there. We have \n                         to go Ray. Together. Like his vision.\n\n               They step into the yard and Ray stops, turning to Crow Horse\n\n                                     RAY\n                         Walter. When I fill out my 302, do I \n                         say that evil spirits are killing \n                         everybody on the reservation?\n\n                                     CROW HORSE\n                         Ray --\n\n                                     RAY\n                         -- no. No offense to the old man. I \n                         appreciate you trying to help. But I \n                         put my ass on the line coming out \n                         here, man.\n\n                                     CROW HORSE\n                         What'd you expect to hear?\n\n                                     RAY\n                         Not Native American myths and legends. \n                         I'm with the FBI, Walter, remember? \n                         Not National Geographic.\n\n                                     CROW HORSE\n                         What you call myths, we call our \n                         history.\n\n                                     RAY\n                         It's not real.\n\n                                     CROW HORSE\n                         What's real to you? Wall Street? \n                         Capital Hill? Now they are myths.\n\n                                     RAY\n                         I can't be dicking around here. That's \n                         all I'm saying. I don't carry \n                         crystals, I don't wanna come back in \n                         another life. I just wanna do my \n                         job, and do it right, and get the \n                         fuck outta here.\n\n                                     CROW HORSE\n                         You ain't no Indian. You're a Sal \n                         Mineo Indian.\n\n               Crow Horse drives \"Indian\" home with a hard finger in Ray's \n               chest. Ray knocks his hand away, explosively. Crow Horse is \n               ready.\n\n                                     GRANDPA (O.S.)\n                         Knock it off!\n\n               The old man is standing at the top of the steps. Ray and \n               Crow Horse are YELLING OVER EACH OTHER, and hands are up.\n\n                                     GRANDPA\n                         Will ya knock it off? You're actin' \n                         like a couple of old women.\n\n               Ray stands there, one hand up in defense, another poised to \n               throw a punch. Bewildered, he stares at the old Indian holding \n               onto the porch railing.\n\n                                     GRANDPA\n                         For cryin' out loud. Knock it off.\n\n                                     RAY\n                         He speaks English.\n\n                                     CROW HORSE\n                         Only when he's really pissed off.\n\n                                     GRANDPA\n                         Come inside. Watch TV.\n\n               And Grandpa goes back in, screendoor slapping shut behind \n               him. Ray is just staring, his jaw dropped. Crow Horse starts \n               laughing. Harder than he has yet, and Ray starts walking \n               toward his car in fuck-this steps.\n\n               He gets into the car, closes the door and looks out the open \n               window at Crow Horse. The Indian moves first.\n\n                                     CROW HORSE\n                         Don't accuse nothin' of not bein' \n                         real, Little Weasel. Cuz the only \n                         thing around here that ain't real is \n                         you.\n\n               Ray lifts his arm off the door, and springs his middle finger \n               up at Crow Horse. He holds it there for a long moment just \n               looking at the big Indian.\n\n                                     RAY\n                         Take care of yourself, Walter.\n\n                                     CROW HORSE\n                         Likewise.\n\n               Ray checks the time on his watch then guns away. Crow Horse \n               stands there, watching him go. Eventually he shuffles back \n               toward the trailer.\n\n               EXT. BUFFALO BUTTE MOTEL - NIGHT\n\n               Room 14 has been transformed into a major COINTELPRO base; \n               four computer terminals are set up, card tables spread with \n               photos, boxes of files stacked on the bed, and SIX AGENTS, \n               manning the computers, thumbing through files.\n\n               THE CONNECTING ROOM (RAY'S ROOM)\n\n               A meeting takes place around a table of paperwork and coffee \n               cups, and a .45 laid atop a file. Cooch, SA Miles, SA Sherman, \n               TWO OTHER REGIONAL AGENTS and Ray.\n\n                                     SA SHERMAN\n                         We've gotten word that Jimmy has \n                         been trying to hook up with Maggie \n                         Eagle Bear... but some of the Warriors \n                         have been sending word to Jimmy that \n                         she may be an FBI operative. So he \n                         doesn't know where to go.\n\n               Cooch taps some ashes into an empty coffee cup. They sizzle \n               in cold residue.\n\n                                     COOCH\n                         Bingo. It's working.\n\n                                     SHERMAN\n                         He's out of room. All the reservation \n                         exits have been watchdogged. We got \n                         him. I give it twelve hours.\n\n                                     RAY\n                         Well we better use those twelve hours \n                         to apprehend the right man.\n\n               The agents all look at Ray. A pin can be heard falling to \n               the cheap carpet.\n\n                                     COOCH\n                         The right man? Talk to me, Ray.\n\n                                     RAY\n                         Whoever dusted Leo, dusted him from \n                         the driver's seat of a moving car \n                         then drove those eight miles to the \n                         Badlands. Jimmy Looks Twice has never \n                         been behind the wheel of a car. It's \n                         a known fact out here that he's \n                         petrified of driving. His parents \n                         were killed in a car wreck.\n\n               Cooch nods, lights another smoke, intrigued.\n\n                                     SHERMAN\n                         That's not very solid.\n\n                                     RAY\n                         There was also a print found in the \n                         Badlands that indicated diagetic \n                         locomotion. Heels first. Jimmy's \n                         walking pattern doesn't match. He \n                         has a distinct Indian walk.\n\n                                     SA MILES\n                         Indian walk? You been smoking hooch \n                         in the peace pipe, Ray?\n\n               LAUGHTER. Except for Cooch who just stares at Ray, digesting \n               what he has said.\n\n                                     RAY\n                         They don't smoke hooch in The Pipe, \n                         Miles. They smoke something called \n                         kinickinick, it's like a tobacco.\n\n               Sherman looks at Cooch.\n\n                                     SA SHERMAN\n                         Well, you're right about X21 being a \n                         Washington Redskin, that's for sure. \n                         What else, Ray?\n\n                                     COOCH\n                         You boys want a soda?\n\n                                     SA MILES\n                         Oh, yeah, a Coke. You buying?\n\n                                     COOCH\n                         No, Ray's buying. Sherman? Coke?\n\n                                     SHERMAN\n                         Oh... no. No, Cooch, I'm working on \n                         a coffee here. Indian walk?\n\n               Cooch nods to Ray and Ray follows, gathering up some paperwork \n               He looks determined as a terrier.\n\n               EXT. BUFFALO BUTTE MOTEL - NIGHT\n\n               Ray and Cooch throw long, slim shadows on their way to an \n               archaic Coke machine.\n\n                                     COOCH\n                         Genetic ditto on evidence found at \n                         the site with evidence you found in \n                         his belongings. An incontrovertible \n                         motive. And definite footprints on \n                         Jimmy Looks Twice at Maisy Blue Legs \n                         house.\n\n                                     RAY\n                         When did we get that?\n\n                                     COOCH\n                         Today. And now you -- there's a dog \n                         in the van --\n\n                                     RAY\n                         -- I know. I fed it, and I can't get \n                         rid of --\n\n                                     COOCH\n                         You weren't sent here to go off on \n                         your own detail, Ray. You were sent \n                         here to assist in a Selective \n                         Operations Unit. These regional agents \n                         are inept -- that's why they were \n                         sent out here to The Graveyard, to \n                         Indian Country. I need you behind \n                         me, Ray. Not pulling against me.\n\n                                     RAY\n                         I'm not trying to pull against you, \n                         Cooch. I've just been having \n                         nightmares about the way Leo was \n                         killed.\n\n                                     COOCH\n                         Your first homicide, that's gonna \n                         happen, Ray...\n\n                                     RAY\n                         I just wanna make sure no one else \n                         gets done in that way because we \n                         were in bed with the wrong doer.\n\n                                     COOCH\n                         Ray. I never get into bed with \n                         somebody unless I know for sure. \n                         Just the way I was raised.\n\n               Ray studies him with a smile building. Cooch shrugs, sips \n               some soda.\n\n                                     RAY\n                         Alright. Alright...\n\n                                     COOCH\n                              (lightly)\n                         Yeah, alright, alright -- fuck you -- \n                         give a yuppie a badge and he wants \n                         to take over the world. Go get a \n                         tail on Eagle Bear, and stay with \n                         her. Cuz Jimmy's gonna show. And I \n                         want you to make the collar.\n\n               Ray nods, starting for the van.\n\n                                     COOCH\n                         Ray.\n\n               He turns. Cooch looks at him for a time. It is a warm look.\n\n                                     COOCH\n                         I'll sleep around a little.\n\n                                     RAY\n                         Thanks, Cooch.\n\n                                     COOCH\n                         And get rid of the dog.\n\n               Ray gets in and pulls the dog out. The dog sits at roadside, \n               tilting its head at him, confused. And he pulls out. It runs \n               after him.\n\n               EXT. DIRT ROAD NEAR EAGLE BEAR'S - RES - NIGHT\n\n               The van sits parked down the road from Maggie's dimly-lit \n               home. Ray sits behind the wheel, watching the house. LOCUSTS \n               make a steady and unnerving sound. It is black. Black under \n               big sky. Ray lets his head sag out the open window and he \n               takes in the vastness.\n\n               POV: stars. Millions of stars. And an incredible full moon. \n               It hangs huge over distant fields, a perfect sphere. The top \n               half of the moon is yellow, the bottom half a lava red.\n\n               REVERSE - RAY\n\n               stares at it, lost in thought. From Maggie's house, he hears \n               someone SINGING. Singing a traditional SUNDANCE SONG while \n               they haul water from the creek. A WOMAN'S VOICE, trilling \n               out the beautiful but haunting \"hey-o-hey-o-hey-o-hey-ohhhhh.\"\n\n               Ray just sits, listening. And then something draws his \n               attention to his rearview mirror.\n\n               The res dog, lying in the back seat is GROWLING. Lip curled \n               back, growling low.\n\n               Ray looks at him, looks out the window. Blackness. Nothing \n               but the sound of locusts. And a slight crosswind in the wheat \n               fields. The dog stops growling. And Ray fixes his gaze on \n               the house again, lifting a pair of binoculars and --\n\n               BOOOOOOM! The rear windshield is SHATTERED by an explosion. \n               Ray throws himself low across the passenger seat -- BOOOOOM! \n               The driver's side window and part of the door explodes.\n\n               RES ROAD NEAR EAGLE BEAR'S\n\n               The federal van is HAMMERED BY GUNFIRE. All the windows, \n               shattered, the metal doors splayed. Someone is going for the \n               kill,\n\n               THE PASSENGER DOOR\n\n               is thrown open just as its window implodes, and Ray slides \n               out belly first, gripping his M-16 and crawling like a dog \n               soldier into tall wheat at roadside as the car, the road, \n               the wheat, the dirt, the night are slammed by gunfire.\n\n               The res dog overtakes Ray and vanishes in the wheat. Ray \n               vanishes, too. It is quiet for a moment, then Ray, pops up \n               ten feet away, and UNLOADS THE M-16, in a left to right, \n               clean sweep before dropping again. He lies there, listening. \n               The LOCUST HAVE GONE QUIET. His breath is heavy. His heart's \n               got to be pounding through the dirt he lays in.\n\n                                     RAY\n                              (whispering)\n                         Motherfucker.\n\n               LONG SHOT - THE ROAD\n\n               the decimated van, aerial still high. The distant lights of \n               Maggie's house. And the giant Moon, hovering over it all.\n\n               HEARTBEAT DRUM into --\n\n               SAME ROAD \u0096 RES - DAWN\n\n               TWENTY FEDS comb the dirt road, the wheat fields, picking up \n               shells with gloved hands, scanning the vast distance.\n\n               IN THE FRONT YARD of Maggie's, FOUR INDIAN CHILDREN stand \n               with the Old Woman, watching.\n\n               INT. LE BARON \u0096 TRAVELING \u0096 ANOTHER DIRT ROAD\n\n               Cooch, flushed in the face, mans the wheel. He wears only a \n               T-shirt which indicates, a desperate rush to the scene. His \n               eyes scan the surrounding homes and fields.\n\n               In the passenger seat, Ray sits, drinking a coffee. He looks \n               haggard.\n\n                                     COOCH\n                         Bastards...\n\n                                     RAY\n                         All I could think of was... not here. \n                         I don't wanna eat it on an Indian \n                         Reservation, three thousand miles \n                         from home.\n\n                                     COOCH\n                         He's out there. He's out there playing \n                         Sitting Bull with us. I want the \n                         motherfucker so bad I'm getting a \n                         bleeding ulcer.\n\n               Ray turns around in his seat, looking off across dry land.\n\n                                     RAY\n                         It may have been Maggie's way of \n                         saying \"get off my ass.\"\n\n                                     COOCH\n                         She's that subtle?\n\n                                     RAY\n                         Eagle's claws and a bear's balls \n                         that's what her profile says.\n\n                                     COOCH\n                         Well, she's running now, too. These \n                         fucking people like to run, don't --\n\n                                     RAY\n                         -- Cooch. Woh. Stop.\n\n               He does. Ray is turned around in his seat, staring off into \n               the distance.\n\n               EXT. DIRT ROAD\n\n               The Le Baron whines backward, and off the road, into some \n               grass Ray steps out, keeping his gaze fixed. Cooch bails \n               from the driver's side, joins him.\n\n               HEARTBEAT DRUM.\n\n               RAY'S POV: Four-hundred feet across a flat area of sandstone \n               and grass clusters, something shimmers in the undulations of \n               the harsh morning sun. Something of pea green and rusty \n               metal... glass catches sunlight and makes prisms. A car. An \n               old res car, sitting in a long, chasm in barely a foot of \n               green water.\n\n               EXT. DRY WASH - SHORT TIME LATER - PAY\n\n               Ray and Cooch go through the car, around the car, with gloved \n               hands and grease pencils and plastic bags, sweating in the \n               hot sun.\n\n                                     COOCH\n                         Tread matches. It's the car.\n\n                                     RAY\n                         Yes.\n\n               Excited, Ray walks off, scanning the area.\n\n                                     COOCH\n                         But this doesn't make any sense, \n                         Ray. If it's just been sitting in \n                         this dry wash for seven days... why \n                         the hell didn't we find it?\n\n               Ray picks up a handful of stones, sifts them in his hands.\n\n                                     RAY\n                         Because this isn't a dry wash.\n\n               Cooch watches him slosh shoes first through a rut where the \n               water shimmers a foot deep or less.\n\n                                     RAY\n                         It's the Little Walking River.\n\n               Ray turns, shucking up mud.\n\n                                     RAY\n                         And it was full of water when I drove \n                         by here three days ago. Full. I \n                         mean... a river.\n\n                                     COOCH\n                         The Little Walking River. You're \n                         right. This is part of it. So whoever \n                         sunk this car didn't compensate for \n                         drought. Goddamn.\n\n               Ray doesn't hear Cooch. He stares past the SAC at the long \n               wide chasm, wet in some places, arid in others, and what he \n               hears must be an echo in his head.\n\n                                     RAY\n                         Listen to the water...\n\n               Cooch is listening to a TRANSMISSION across his radio and he \n               walks off a few feet, exchanging information with the \n               REGIONALS.\n\n               Ray stands, ankle deep in stagnant water, his face sweat-\n               soaked, his eyes transfixed on heat undulations.\n\n               EXT. BUFFALO BUTTE MOTEL - ROOM 13 - DAY\n\n               A flat-bed tow truck drives past the motel with the killer's \n               car on it. Behind the truck is a fed car which stops at the \n               motel, and the Le Baron which also pulls in. Miles and Sherman \n               get out from the first car, Ray and Cooch bail from the Le \n               Baron.\n\n               With RADIOS TRANSMITTING, the agents walk, dusty and tired, \n               into room 14. Ray hesitates, snagged by the sight of --\n\n               A motorcycle parked in front of the Buffalo Butte Bar. Parked \n               with pick-up trucks and station wagons. It's the mud-caked \n               old Barley. Parked right under the NO INDIANS sign.\n\n               He puzzles over this.\n\n               INT. BUFFALO BUTTE BAR - DAY\n\n               Dark. Even during the day. Cigarette smoke. Sawdust. On the \n               archaic juke box, RANDY TRAVIS sings \"Old 8x10\" while behind \n               the bar, the BAR OWNER, an old man with long white hair and \n               beard, busies himself with leather work. SEVERAL WHITE LOCALS \n               sit on the old water drum bar stools.\n\n               Heads lift, turn when Ray enters in his \"fraternizing\" clothes -- \n               jeans and boots, leather jacket. He scuffs up thick sawdust \n               as he heads to the furthest booth back where --\n\n               Crow Horse sits, alone over a bourbon and a beer. Ray \n               approaches carefully, upset by the sight. He slides into the \n               booth and point blanks the Indian.\n\n                                     CROW HORSE\n                         Agent Little Weasel, Federal Bura of \n                         your Imagination.\n\n                                     RAY\n                         Jesus Christ. You're hammered. What \n                         are you doing?\n\n                                     CROW HORSE\n                         You're right about the old man. His \n                         power's long dried up. He's supposed \n                         to be a medicine man but he won't go \n                         see the people. He says we changed, \n                         and we don't listen. Well, he don't \n                         go out and talk no more. I haven't \n                         had a drink in three years but I \n                         just turned my sobriety chip into \n                         that man behind the bar, and this \n                         Hoss is gettin' watered.\n\n                                     RAY\n                         Cut the shit. You shouldn't be in \n                         here, Man.\n\n                                     CROW HORSE\n                         Cuz I'm a skin?\n\n                                     RAY\n                         Cuz you're a cop.\n\n                                     CROW HORSE\n                         Not no more.\n\n                                     RAY\n                         What are you talking about?\n\n                                     CROW HORSE\n                         You tell me. You tell me who went to \n                         the B.I.A. -- Bureau of Indian \n                         Annihilation and said I was messin' \n                         with your case, man. I don't give a \n                         goddamn about your case.\n\n                                     RAY\n                         And I don't give a goddamn about \n                         whether you wear a badge or not, \n                         Crow Horse, but I didn't cut you.\n\n               Crow Horse shimmers his black eyes onto Ray.\n\n                                     CROW HORSE\n                         Still after Jimmy?\n\n                                     RAY\n                         They found prints at Blue Legs' place.\n\n                                     CROW HORSE\n                         Yeah. Jimmy's prints are there. But \n                         they cross over Benjamin Black Star's \n                         prints. And he wasn't there until \n                         six o'clock the mornin' after to get \n                         eggs from the chickens. So Jimmy \n                         wasn't there til the next day. Follow?\n\n               Ray just looks vacantly at Crow Horse. Crow Horse resents \n               the vacancy.\n\n                                     CROW HORSE\n                         Look, man... you better bust Jimmy \n                         and get out before somebody shoots \n                         up more than your car next time.\n\n               Ray glares at him.\n\n                                     RAY\n                         Next time I'll be ready. You get the \n                         word to who ever it is.\n\n                                     CROW HORSE\n                         I can't, Hoss. I don't talk to FBI's.\n\n               Ray doesn't blink.\n\n                                     CROW HORSE\n                         You think you was sent here cuz you're \n                         a good cop?\n\n                                     RAY\n                         No. I was sent here cuz I'm Indian. \n                         And a good cop.\n\n               Crow Horse leans toward Ray and speaks more quietly.\n\n                                     CROW HORSE\n                         You ever think that maybe you was \n                         sent here cuz the FBI's need one \n                         good reason to take out the entire \n                         Warrior Movement. And what better \n                         reason than one of their men, gettin' \n                         blown away on the res. A low-rent, \n                         expendable public servant sent in to \n                         take a bullet for his country.\n\n               Ray is fuming. He can't believe what he's hearing, what's \n               being insinuated, but he's giving it thought and it's getting \n               him angry. He smashes a hand down on the table.\n\n                                     RAY\n                         I'm sick of your shit --\n\n                                     RANCHER (O.S.)\n                         I'm sick of the two of ya timber \n                         niggers spewin' off.\n\n               Standing over the booth is a long, tall RANCHER'S SON. Rangey \n               with red curly hair tucked under a BLACK HILLS CLASSIC cap, \n               and arms built by tractor work. And behind him, TWO OLDER \n               RANCHERS fall in. And ANOTHER YOUNG MAN, grinning with \n               amusement.\n\n               Ray and Crow Horse look up.\n\n                                     CROW HORSE\n                         Sorry, we don't speak United States.\n\n                                     RANCHER'S SON\n                         Yeah, well I do. Get the Jesus up, \n                         and get the Jesus out or I'm gonna \n                         go out to my truck and come back \n                         with my hardware.\n\n                                     RAY\n                         Woh, hold on there, Jack, you're --\n\n                                     RANCHER'S SON\n                         -- don't \"jack\" me, Squanto. I'll \n                         bury your lazy ass right here.\n\n               Ray realizes now that they think he's Indian, too. Crow Horse \n               sees this revelation and complicates it by suddenly speaking \n               LAKOTA to Ray.\n\n               The rancher grabs Ray by the cheeks.\n\n                                     RANCHER'S SON\n                         I'm talkin' to --\n\n               Ray decks him. Backhands him in the solar plexus then, lays \n               a burner of a Quantico roundhouse to his ear, knocking him \n               across the bar, over a mop and bucket and into sawdust.\n\n               The others start to fall at him but someone has jumped in, \n               holding them back, and sticking himself in the way. It is \n               Brooks. The old timer Ray met his first night here.\n\n                                     BROOKS\n                         No! No, you butt holes! He ain't \n                         skin! He AIN'T SKIN!\n\n                                     CROW HORSE\n                         Yeah he's In'dn. Miniconjou Sioux.\n\n               The rancher's son who is coming back with a broken beer \n               bottle, slows his step and shifts his eyes from Brooks to \n               the young fed There is a lot of heavy breathing. But no \n               talking just yet. The young rancher eyes Ray.\n\n                                     RANCHER'S SON\n                         You ain't Indian?\n\n               Ray just stands tense, staring at him. And it's strange. \n               Because he hasn't really looked like he has any Indian blood \n               up to this moment. But dressed the way he is, and his eyes \n               glaring, face drawing tense, he might pass for a breed \n               although that's probably the Italian. But Ray doesn't answer \n               the question. Crow Horse starts laughing. Drunkenly.\n\n                                     OLDER RANCHER\n                         What's so damn funny?\n\n                                     CROW HORSE\n                         Well, it's just that the cavalry \n                         used to always threaten the Lakota. \n                         The cavalry ain't around anymore. \n                         The Lakota still are.\n\n                                     RANCHER'S SON\n                         I got no trouble tellin' where you \n                         come from, Fat Red.\n\n               Crow Horse rises and walks unsteadily across the floor, \n               leaving the bar. Brooks is whispering to the others, \n               apparently about who Ray is. The bar man comes up to Ray, \n               holding a tray, on which sits a shot and a beer. Ray looks \n               at it for a moment.\n\n                                     BAR MAN\n                         Sorry. On the house.\n\n               Ray knocks the tray out of his hand, spilling beer and whiskey \n               all over the bar man and the locals around him.\n\n               And he walks out, leaving the locals confused.\n\n               INT. LE BARON - TRAVELING - RES - DAY\n\n               Ray looks strung-out as he drives. If it's not the conflict \n               at the Butte, it's the dangerous seed Crow Horse planted, \n               and it is playing with his mind. He is on his RADIO.\n\n                                     RAY\n                         No plates. No registration. Serial \n                         numbers removed. And all prints washed \n                         off by the river. That's great. This \n                         is turning out to be a walk in the \n                         park, do you know that?\n\n                                     RADIO\n                              (woman agent)\n                         Come back?\n\n                                     RAY\n                         Never mind.\n\n               But before he hangs the radio. IT CUTS BACK IN.\n\n                                     RADIO\n                         Ray. X22.\n\n                                     RAY\n                         I read, Cooch.\n\n                                     RADIO\n                         Remember that upside down flag back \n                         at Jimmy's house? Somebody took it \n                         down.\n\n                                     RAY\n                         Good.\n\n                                     RADIO\n                         They took it down, set fire to it, \n                         and threw it on the doorstep of room \n                         13 at the Buffalo Butte Motel. Your \n                         room.\n\n               Ray seethes quietly as he drives.\n\n                                     RADIO\n                         We traced the number of the truck \n                         that dumped it, and it belongs to \n                         one Maggie Sanders, also known as \n                         Maggie Eagle Bear. She's been all \n                         over the res, riling up the \n                         traditionals, telling them not to \n                         break, and to keep Jimmy in hiding. \n                         She's a problem now. And she's yours. \n                         Get her off the reservation.\n\n               Ray keeps driving.\n\n               EXT. WOUNDED KNEE MEMORIAL - DAY\n\n               Maggie's old pick-up is parked near an arch gate of the tiny \n               cemetery where a tall monument is fenced off from other graves \n               There are tobacco offerings and other medicines hanging on \n               the fence and on the monument.\n\n               It is a quiet place. Still.\n\n               Maggie stands before the unkempt monument in her denim jacket, \n               her hair blowing across her face in the wind. She PRAYS IN \n               LAKOTA.\n\n               Behind her TEN CHILDREN from the Bear Creek School stand, \n               heads bowed respectfully. Two of them sit on the lap of \n               Richard Yellow Bird who looks on from his wheelchair, praying \n               quietly with Maggie. When Maggie completes her prayer, she \n               ties some tobacco to the monument then turns and faces the \n               children. One of them, a LITTLE GIRL -- heavy-set -- raises \n               a hand that we might note is deformed. As many of the children \n               we have seen on the res, are.\n\n                                     LITTLE GIRL\n                         Are they all right under here?\n\n                                     MAGGIE\n                         Two-hundred and sixty-seven men, \n                         women, old people. And little ones \n                         like you. Many killed running along \n                         that road you see there.\n\n                                     LITTLE BOY\n                         Where were they runnin' to?\n\n                                     MAGGIE\n                         A place called The Stronghold.\n                              (a beat)\n                         They died for a dream. But you live. \n                         You are their great-great \n                         grandchildren and you live. We have \n                         to honor their dream. Of protecting \n                         the Mother Earth. And being proud of \n                         being Indian.\n\n                                     LITTLE BOY\n                         My mother told me that they call us \n                         Indians cuz Columbus was lookin' for \n                         India when he discovered our country.\n\n               Maggie smiles at the boy.\n\n                                     MAGGIE\n                         Yeah, well, let me tell you something, \n                         Henry: just be glad he wasn't looking \n                         for Turkey.\n\n               The CHILDREN LAUGH. All but one boy, who isn't paying \n               attention. He is staring up at a hill, off in the distance.\n\n               MAGGIE'S POV: on the hill, a figure stands, hands in his \n               pockets, hair blowing in the wind. Ray.\n\n               REVERSE - MAGGIE\n\n               keeping her eyes on the Wasi'cu, but addressing Yellow Bird.\n\n                                     MAGGIE\n                         Richard. Sing the Honoring Song with \n                         them. I'll be right back.\n\n               ON THE HILL\n\n               Ray stands, watching Maggie walking into the wind, toward \n               him. Behind her an HONORING SONG, sung by ten children haunts \n               the still air.\n\n               He doesn't budge as she mounts the gentle bluff and joins \n               him there.\n\n                                     MAGGIE\n                         We're praying at the grave. Do you \n                         wanna join us?\n\n               A long silence. The voices carry in the wind.\n\n                                     RAY\n                         No, Maggie. But you're gonna have to \n                         join me for a ride. I'm taking you \n                         to Rapid City.\n\n               Maggie looks at him. They lock eyes.\n\n                                     MAGGIE\n                         So much power. I see it in your eyes. \n                         This... hunger for power. Or for \n                         what you think is power.\n\n               As if exhausted by the thought, Maggie sits down on the bluff, \n               looking out at the children who are still singing the song. \n               As she speaks, she begins digging her fingers in the earth. \n               Ray stands over her.\n\n                                     RAY\n                         You burned an American flag today. \n                         And left it for me...\n\n                                     MAGGIE\n                         -- You desecrated it, it had to be \n                         burned.\n\n                                     RAY\n                         I desecrated it?\n\n                                     MAGGIE\n                         You forced an innocent man to run \n                         like an animal. You've tried to poison \n                         my people's hearts against me with \n                         your manipulation, with letters I \n                         never wrote... you've been watching \n                         me eat, work, raise my family... \n                         wash myself in the river. And now \n                         you're here, arresting me at a sacred \n                         place.\n                              (a beat)\n                         In your eyes, that's power.\n\n               Maggie lifts herself onto her knees and looks down into the \n               small hole she's dug. She picks up a little pine cone.\n\n                                     MAGGIE\n                         So I plant this tree for you. And I \n                         take all this stuff that you've laid \n                         on me and my people, and I put it in \n                         this hole with this pine cone.\n                              (she covers it)\n                         And I bury it. Cuz ya know what it \n                         is, Ray? Bullshit. And shit is \n                         fertilizer.\n                              (she stands)\n                         And The Mother will turn your lies \n                         into something that lives.\n\n               Maggie rises, dusting off her hands. She looks him in the \n               soul.\n\n                                     MAGGIE\n                         That's what power is, in the Indian \n                         way.\n                              (holds her hands out \n                              to be cuffed)\n                         Take me to Rapid, Ray. I'm the enemy.\n\n               Ray just stares at her, struggling with what he's feeling, \n               what he's hearing. What he's supposed to be feeling. Silence \n               hangs between the two of them.\n\n                                     RAY\n                         If I told you... that I think Jimmy's \n                         innocent... but I'm in over my head... \n                         would you believe me?\n\n               Maggie looks at him, considering. Then toward the long dark \n               silhouette of a mountain range across the plains.\n\n                                     MAGGIE\n                         See those Black Hills out there, \n                         Ray? When the people lost the land \n                         in 1868, the government took \n                         everything but those hills. They \n                         allowed us to keep those Black Hills, \n                         to live there. Signed a treaty. Until \n                         they found gold. Then they told us \n                         we had to leave because of National \n                         interest. They broke that treaty. \n                         Anyone who fought or spoke out against \n                         it, wound up dead or in jail. And \n                         the people wound up here. On a \n                         reservation.\n\n               While she looks off at Paha Sapa, Ray stares at her profile.\n\n                                     MAGGIE\n                         While up there, in the Black Hills... \n                         they carved the faces of four \n                         presidents.\n\n               She looks at Ray with an ironic smile, and she catches him \n               transfixed.\n\n                                     MAGGIE\n                         Your relatives must've taught you \n                         something.\n\n                                     RAY\n                         NO.\n                              (after thought)\n                         My father never told anybody he had \n                         Indian blood. But he still used a \n                         few Indian words around the house. \n                         He called me Washee. Said it meant... \n                         good boy.\n\n               Maggie starts giggling.\n\n                                     RAY\n                         What?\n\n                                     MAGGIE\n                         Wa-shee is like... a dumpling. Like \n                         tallow we put in stew. I think he \n                         was calling you chubby boy.\n\n                                     RAY\n                         Great.\n\n               Maggie is laughing as she looks back at the children who are \n               no longer singing. Ray reaches inside his jacket and takes \n               out five polaroids. He shuffles them as he ponders. He hands \n               one to Maggie who has caught herself opening up too much to \n               the Wasi'cu.\n\n                                     RAY\n                         You ever see that car before?\n\n               Maggie looks at the first photo and says nothing. She hands \n               it back quickly. Ray won't take it.\n\n                                     RAY\n                         Who's it belong to?\n\n               Maggie ignores him. Ray studies her reaction.\n\n                                     RAY\n                         Help me, Maggie...\n\n               Maggie is looking away. She picks a long blade of grass and \n               smoothes it in her hands.\n\n               Ray looks at her a moment longer then rises, dusting off his \n               jeans, and standing there. He thinks for a long moment, \n               pinches the bridge of his nose, then looks out at the Black \n               Hills, pensive.\n\n                                     RAY\n                         I didn't see you today, Maggie.\n                              (a beat)\n                         Goodbye.\n\n               Maggie watches him go. Looks away. Then watches him again.\n\n                                     MAGGIE\n                         Goodbye... Wa-shee.\n\n               Ray stops. She stands on the bluff, her hair riding the wind \n               and her eyes searing. And then her lips do something that \n               might qualify as half a smile. A sense of humor rising up \n               through anger. Survival humor.\n\n               Ray looks at her for a long moment. And then he walks on, \n               leaving her there.\n\n               INT. LE BARON - PARKED AT WOUNDED KNEE - DAY\n\n               Ray sits behind the wheel, going through files on his lap, \n               photographs of Indians. And thinking hard.\n\n                                     RAY\n                         Anyone who fought or spoke out against \n                         it... wound up dead or in jail.\n\n               Ray looks out the window toward the monument.\n\n                                     RAY\n                              (to himself, flustered)\n                         That was 1868, Maggie...\n\n               Exhausted, Ray lays his head back on the seat, and lets a \n               long, constricted breath free. THUNDER ROLLS like the slow, \n               deep roar of some giant bear up in the hills. He opens his \n               eyes, looks out the window.\n\n               POV: rain is coming down, and Maggie is getting the children \n               into the back of her truck. She helps them get a tarp over \n               their heads. Then as Yellow Bird pulls himself into the cab \n               of the truck, she hefts the wheelchair and two boys load it \n               in.\n\n               She gets in, starts up, and rolls off down the sloping road.\n\n               EXT. LE BARON - WOUNDED KNEE \u0096 STRANGE TWILIGHT\n\n               Ray steps out of the car into the rain and closes the door. \n               He stares at the burial grounds. Then slowly, he starts toward \n               them as if magnetically drawn. HEARTBEAT DRUM.\n\n               A shroud of mist lays over the cemetery, growing thicker as \n               the rain falls harder. DRUM BEATS DEEPER. Ray is walking \n               toward the memorial, getting drenched. Then he hears something \n               strange. HOOFBEATS.\n\n               RAY'S POV:\n\n               coming down the dirt road, toward him, a HORSEMAN drives his \n               mount at a fast trot. The rider is only a vague image in the \n               mist, his face hidden. As he rides closer, we can make out a \n               shotgun in his hand. And he throws it up, takes aim.\n\n               REVERSE - RAY\n\n               paralyzed for a moment. And then going for his gun. But it's \n               not there. He's left it in the car. He breaks into a run. \n               But there's a shorter distance now between the horseman and \n               the car and Ray has no choice but to turn and flee.\n\n               His boots slap wet pavement, and his breath draws heavy and \n               desperate as he bounds off the road and races down a grassy \n               slope, looking over his shoulder, panicking.\n\n               His legs and arms churning, his face contorted. And then \n               someone passes him out, running just as hard. AN INDIAN WOMAN \n               in 1890 Winter rags, clutching a BABY to her breast and \n               CRYING. SCREAMING. Ray looks at her, incredulous as he runs. \n               But he keeps running.\n\n               The rider is right behind him. He FIRES. The GUNSHOT CRACKS \n               the sky like thunder. BOOOOM!\n\n               INT. LE BARON \u0096 TWILIGHT\n\n               Ray jumps awake. Cooch is POUNDING on the window. And the \n               three-legged dog inside is BARKING. Ray quickly rolls the \n               window down, letting in THUNDER.\n\n               Cooch starts to say something then takes note of Ray's peaked \n               face. Sweat runs down his temples, beads at his nose.\n\n                                     COOCH\n                         Jesus, you alright?\n\n                                     RAY\n                         Yeah. I... I fell asleep. I can't \n                         believe it. I --\n\n                                     COOCH\n                         Never turn your radio off! I thought \n                         I was gonna find you scalped! Damn \n                         it!\n\n                                     RAY\n                         Sorry, Cooch. I lost Eagle Bear --\n\n                                     COOCH\n                         -- never mind Eagle Bear. We've got \n                         Jimmy nailed. Let's go!\n\n               And Cooch runs to his car. Ray fires the car's big engine \n               and takes off behind Cooch who is driving a fed Chevy. CRAZY \n               HEARTBEAT DRUM INTO --\n\n               EXT. GRANDPA REACHES TRATLER - LATE DAY\n\n               The rain pelts Grandpa's little Airstream trailer, wind snaps \n               at sheet plastic in the windows. An ancient sewing wheel \n               CREAKS RUSTY in the wind.\n\n               Three clean, late-model fed cars pull down the muddy drive \n               as two SWAT vehicles pull in from another road. The Le Baron \n               pulls in, and Ray bails out with the others. When he sees \n               where he is, he looks distraught.\n\n               Agents are running behind junked cars, positioning themselves \n               around the trailer.\n\n               INT. GRANDPA REACHES TRAILER \u0096 LATE DAY\n\n               The holy man is sitting in his chair, smacking Flies with a \n               swatter. Tonight he wears a black reservation hat and stares \n               vacantly at the TV where RONALD MACDONALD swings a giant \n               baseball bat, and falls on his face, bouncing back up. And \n               then BOOM!\n\n               The door is open and Cooch leads Miles, Sherman and Ray \n               inside. Cooch has a gun on the old man.\n\n                                     COOCH\n                         HANDS ON YOUR HEAD!\n\n               The old man slowly removes his hat and hangs it on a knee. \n               Carefully he places his wrinkled hands on his thinning white \n               hair. His eyes seek out Ray who stands in the doorway, M-16 \n               in hand, looking concerned. He stares at Ray.\n\n               Cooch storms into a back bedroom, Miles moves to a window. \n               Sherman stands over the old man.\n\n                                     SHERMAN\n                         Where is he, Sam? Where's Jimmy?\n\n               Grandpa looks at Sherman, ignores him, looks back at Ray.\n\n                                     SHERMAN\n                         He's a medicine man, Ray. The \n                         \"spiritual leader\" of the Warriors. \n                         That right, Sam?\n\n               With RADIO TRANSMISSIONS crackling through the house, Cooch \n               comes back down the hall, and heads to the door.\n\n                                     COOCH\n                         Trailer's clean, let's go.\n\n               Ray starts to follow but he sees Sherman pick something up \n               from near Grandpa. The 500 year-old turtleshell rattle. \n               Grandpa's eyes widen slightly.\n\n                                     SHERMAN\n                         You been the one making it rain like \n                         that, out there, Sam?\n\n                                     RAY\n                         Hey, put that down.\n\n                                     SHERMAN\n                         Can you make Jimmy outrun an M-16, \n                         Sam?\n\n                                     RAY\n                         Sherman!\n\n               Sherman drops the turtleshell rattle on the linoleum floor. \n               Then drives his heel into it, CRUSHING the fragile \n               turtleshell.\n\n               Ray grabs him and slams him into the tin wall. Miles gets \n               between them, grabbing Sherman.\n\n                                     MILES\n                         EASY, MEN! HEY! --\n\n                                     RADIO\n                         HE'S ON THE ROOF! HE'S ON THE FUCKING \n                         ROOF! COME ON GUYS, COME ON, GUYS!\n\n               They're out the door, leaving the old man to sit looking \n               down at the shattered rattle. He closes his eyes.\n\n               EXT. GRANDPA REACHES TRAILER\n\n               In a blizzard of rain, Jimmy Looks Twice in a cowboy shirt, \n               jeans and boots, leaps off the top of the Airstream, clutching \n               his medicine bundle. FLOODLIGHTS HIT him from all directions. \n               BULLHORNS screaming at him.\n\n               He tries to turn a corner and runs right into a fed. Ray, \n               having run out the back door has slammed right into him. He \n               has his rifle on him, and they stare each other down for a \n               split second before he is converged on. Guns at his back, at \n               his head.\n\n               He is swept off his feet, face down, and frisked. He looks \n               up at Ray, desperately.\n\n                                     LOOKS TWICE\n                         Brother, the old man told me about \n                         you. Listen to me: what was Leo trying \n                         to tell me? He wanted to meet me at \n                         Maisy --\n\n               Another fed, pushes his face into the mud, cuffs him behind \n               his back.\n\n                                     FED\n                         Save your speeches for prison, Jimmy.\n\n               With two FIVE MAN SWAT TEAMS swarming the area, and six agents \n               pushing Jimmy toward a car, Cooch stands there in the pouring \n               rain, looking relieved. Ray stands near him, looking abhorred.\n\n                                     COOCH\n                         Damn. That's one hard running Indian.\n\n               Ray watches Jimmy as he is shoved into the back of Miles and \n               Sherman's car and driven away. He is twisting around in his \n               seat to look at Ray. Desperately. The SWAT teams disband, \n               return to their vehicles.\n\n                                     COOCH\n                         It's over, Ray. I aged five years. \n                         But it's over. At least I'm gonna \n                         look like I'm ready for the advisory \n                         desk. Let's go get a beer.\n\n               Cooch heads to his car and Ray starts shuffling toward his \n               as if he is dared by it all. He is looking at the trailer \n               and there on the rickety porch is Grandpa. He comes down the \n               steps slowly, holding his hat on against the wind. He watches \n               the cars pulling out.\n\n               Ray walks over to him, looking sick.\n\n                                     RAY\n                         Look... I'm not who you think I am.\n                              (a long beat)\n                         I'm sorry.\n\n               And after a moment of locking gazes, he starts for his car,\n\n                                     GRANDPA\n                         Out back that way... is a placed \n                         called Wounded Knee.\n\n               Ray turns.\n\n                                     GRANDPA\n                         I was one years old there when our \n                         people were shot down. My mother hid \n                         me in the snow in a blanket. One of \n                         those killed was a Holy Man called \n                         Wakiyan Cante -- Thunder Heart. They \n                         killed him while he was running for \n                         The Stronghold. It is his blood -- \n                         the same blood that spilled on the \n                         grass and snow at Wounded Knee -- \n                         that runs through your heart like a \n                         buffalo.\n\n               Ray frowns, disturbed by this story.\n\n               The old man is speaking with conviction. With power.\n\n                                     GRANDPA\n                         Thunder Heart has come. Sent here to \n                         a troubled place to help his people. \n                         That's what I am told. Maybe you're \n                         right and I am mistaken. Your mind \n                         is young, mine is old. If so, so be \n                         it. Ho Hecetu Yelo. I'll speak no \n                         more.\n\n               Ray stands, almost paralyzed, digesting this. He turns and \n               looks into the old man's sharp eyes. Grandpa has closed his \n               eyes, and as he is pulverized by the rain, he turns his face \n               toward it and from way down in his belly, he begins to SING \n               IN LAKOTA. And it is too much. Too weird. He wheels and \n               hurries to the car. Gets in, and beats a fast path out of \n               the old man's lonesome patch of land.\n\n               BLUE HEAT LIGHTNING knifes the sky. THUNDER ROLLS, and rumbles \n               into POOL BALLS --\n\n               EXT. BUFFALO BUTTE MOTEL AND BAR - LATE DAY\n\n               The agents have taken over both sides of the streets, gathered \n               in front of the bar and the motel, putting firearms into \n               cases, removing flak jackets.\n\n               POOL BALLS knock from inside the bar while outside, A DAKOTAN \n               takes a piss near a truck while his GIRLFRIEND stands at his \n               back, yelling at him. CHARLIE DANIELS sings country on the \n               juke Ray heads to room 13, starts unlocking the door. Cooch \n               comes up behind him.\n\n                                     COOCH\n                         Buffalo burgers and cold beer, \n                         Raymond. Don't worry about the sign \n                         out front... you don't have to be \n                         Indian anymore.\n\n               Cooch throws a mock punch at Ray and he mock blocks, tired. \n               He musters a smile. But he isn't all there.\n\n                                     COOCH\n                         You have a fever. You okay?\n\n               Ray nods. Cooch lets a few agents walk past, LAUGHING. He \n               speaks quietly.\n\n                                     COOCH\n                         Listen: when we get back tomorrow, \n                         you're gonna find Tully laying a \n                         promotion on you. S.A.C. He wants to \n                         prove that his yuppie agents are \n                         making good. He's offering you New \n                         York. Tell him you want Atlanta.\n\n                                     RAY\n                         Why?\n\n                                     COOCH\n                         Cuz I want New York.\n\n               Ray tries to break a smile again. Cooch cups his arm.\n\n                                     RAY\n                         Cooch. They sent us out here because \n                         the place was being neglected. Now, \n                         all of a sudden, there's two five \n                         man SWAT teams out there tonight. \n                         Bell Huey choppers flying all over \n                         the place. Federal occupation to \n                         catch one guy. Why, Cooch? What's \n                         going on?\n\n               Cooch stares at Ray. The younger agent looks like he indeed \n               has a fever.\n\n                                     COOCH\n                         National security, Ray. Get some \n                         sleep. Tomorrow, we fly.\n\n               Cooch hurries across the rain-swept street. Ray steps inside \n               and closes the door.\n\n               INT. ROOM 13 - BUFFALO BUTTE MOTEL\n\n               Ray closes the door, and stands there. He seems to be having \n               trouble breathing. He looks down at his boots. There is \n               something on the floor. Something that has been slipped under \n               the door earlier. He just stares down at it. Then slowly \n               stoops.\n\n               CLOSE ON: the polaroid of the res car he gave to Maggie \n               earlier. She\n\n               has returned it. He turns it over. Written across the white \n               backing of the photo, in dark black marker is the name -- \n               YELLOW BIRD.\n\n               Ray stares at this for a moment then hurries over to boxes \n               of files on the bed. He rummages like a nervous thief and \n               comes up with a folder. He flips through it, casting off \n               files and 302's and profiles and finally stopping on --\n\n               The 8x10 BLACK AND WHITE of Richard Yellow Bird seen earlier. \n               Sitting in his wheelchair, Red Power cap on, tattoos marring \n               big arms. And under it a DOUBLE MUG SHOT stamped LEAVENWORTH \n               PRISON. Under that ANOTHER PRISON MUG SHOT stamped SIOUX \n               FALLS PRISON. And under that a --\n\n               THIRD MUG SHOT stamped \"PAROLED.\"\n\n               Ray, his eyes fixed on this one, takes a few steps and sits \n               on the end of the bed. He then stuffs the file back in a \n               box, and takes off toward the door.\n\n               EXT. RESERVATION ROAD - SUNSET\n\n               The Le Baron throws up loose rock and red dust, driving toward \n               a place where the sun begins a slow drop behind the Black \n               Hills. HORSES run out of the road. HEARTBEAT DRUM.\n\n               EXT. MULE DEER DISTRICT \u0096 RES - SUNSET\n\n               A tarpaper shack. Outhouse. Clothesline on which jerked meat \n               hangs. No cars. A lonely, unnerving place. Le Baron pulls \n               in. Ray gets out, adjusting the gun at the back of his \n               waistband. He starts for the shack. Ray raps a fist on the \n               splintered plywood door. Knocks again. He checks out a boarded-\n               up window. The door finally opens. Just a crack. Tiny black \n               eyes peer out into the fading light.\n\n                                     RAY\n                         I'm looking for Richard Yellow Bird.\n\n               Ray sticks his open badge, gold eagle wings, near the crack. \n               The door closes. Then unlatches and opens. Yellow Bird sits \n               there in his wheelchair, tiny tobacco bundles in his lap. \n               He's been tying them.\n\n                                     YELLOW BIRD\n                         The Washington Redskin. Thought you'd \n                         be gone by now.\n\n               He pivots his chair to allow Ray room to enter.\n\n               INT. YELLOW BIRD SHACK\n\n               Yellow Bird, in a T-shirt that reveals twenty different ink \n               tattoos, rolls himself across the warped floorboards to a \n               cheese crate where his eye glasses sit. He puts the thick \n               bifocals on and focuses resentfully on Ray in the ochre \n               flicker of the dirty room.\n\n                                     YELLOW BIRD\n                         What ya want?\n\n                                     RAY\n                         Must be a bitch getting around in \n                         that wheelchair. How long you been \n                         in it?\n\n                                     YELLOW BIRD\n                         Since I got a iron pipe put across \n                         my knees, man. Fight with three \n                         wasi'cus, ya know.\n\n                                     RAY\n                         At Sioux Falls Pen?\n\n                                     YELLOW BIRD\n                         No, that was Leavenworth. This --\n                              (shows a scar)\n                         was Sioux Falls. What ya want?\n\n                                     RAY\n                         Leavenworth a tough joint?\n\n               Ray walks across the room, his eyes on a covert mission.\n\n                                     YELLOW BIRD\n                         You ever try solitary confinement?\n\n                                     RAY\n                         No. Can't say that I have, Richard. \n                         Richard do you know why I'm here?\n\n                                     YELLOW BIRD\n                         Washington sent ya. I know that.\n\n                                     RAY\n                         Yes, Washington sent me, Richard. \n                         They sent me here because this whole \n                         thing has been fucked. Do you know \n                         what I mean when I say this whole \n                         thing has been fucked, Richard?\n\n               Yellow Bird stares at Ray.\n\n                                     RAY\n                         An arrangement was made between you... \n                         and us. Do you remember that \n                         arrangement?\n\n               Yellow Bird looks at Ray, strangely, shaking his head. Ray \n               starts to look like maybe the game's not working. Like maybe \n               this doesn't add up. But --\n\n                                     YELLOW BIRD\n                         I'm here, ain't I?\n\n               Ray lets a tense breath out.\n\n                                     RAY\n                         Not for long, Richard. You got early \n                         parole under the stipulation that \n                         you would help us in a situation, \n                         and you didn't deliver.\n\n                                     YELLOW BIRD\n                         What the fuck you talkin' about?\n\n               Ray sits in a busted chair, reaches down to his ankle holster \n               and pulls out a .38. He holds it, resting it on the arm of \n               the chair. He strains to look out through the boarded window. \n               Yellow Bird fidgets in his chair.\n\n                                     RAY\n                         Get up out of the chair, Richard.\n\n                                     YELLOW BIRD\n                         What's with you people? Why do ya \n                         have to fuck with my head all the \n                         time? I came through, man.\n\n                                     RAY\n                         Get up out of the chair, and walk \n                         toward the backdoor, Richard.\n\n                                     YELLOW BIRD\n                              (not moving)\n                         I get thrown in solitary until I \n                         don't know my own fuckin' name, and \n                         then you people tell me I can beat \n                         nine years if I help you. I helped \n                         you!\n\n                                     RAY\n                         Get up!\n\n               Yellow Bird stands. He takes a step forward. Limping. He's \n               got leg problems but he can walk. Heels first. And bowed. \n               But he can walk. He is shaking.\n\n                                     YELLOW BIRD\n                         They said I'd never see FBI again, \n                         and I'm livin' with you fuckers. I \n                         don't feed ya information on the \n                         Warriors, it's back to the pen. I \n                         don't do this, back to the pen. Your \n                         word against my word. Against a con \n                         Indian's word. I really got a chance, \n                         man, right?\n\n                                     RAY\n                         They sent me here, Richard because \n                         they said you didn't hold up your \n                         end of the arrangement, and I have \n                         to transport you back to Leavenworth.\n\n                                     YELLOW BIRD\n                              (crying)\n                         What the fuck, man? What do you people \n                         want? I did what you wasi'cu's told \n                         me to do.\n\n                                     RAY\n                         Leo Fast Elk... is alive.\n\n               Yellow Bird wheels.\n\n                                     YELLOW BIRD\n                         No way. No fuckin' way.\n\n                                     RAY\n                         How the hell do you know?\n\n                                     YELLOW BIRD\n                         I blew his back out with a buffalo \n                         gun, that's how I know! Now you're \n                         gonna say I didn't, so you can throw \n                         me back in solitary?\n\n               Ray is trying hard not to reveal his horror at this \n               confession, at this understanding of the machinery. He sits \n               there with his gun, blinking away sweat that beads at his \n               brow. Yellow Bird is weeping in a highpitched voice that \n               doesn't match his great bulk.\n\n                                     RAY\n                         The men who came to see you at \n                         Leavenworth. The one's who made the \n                         arrangement... who were they? Maybe \n                         I can talk to them.\n\n                                     YELLOW BIRD\n                         Miles. Three other suits. That's all \n                         I know 'em as -- suits. Were you \n                         there?\n\n                                     RAY\n                         You turned Leo over on his face. But \n                         the coyotes must've turned him back \n                         over, man, cuz his spirit is out. \n                         It's out, and it knows.\n\n                                     YELLOW BIRD\n                         What do you know about spirits? You \n                         ain't no In'dn.\n\n                                     RAY\n                         Leo knew something heavy and was \n                         trying to tell Jimmy. But you must \n                         not know how serious it was or you \n                         would have delivered. Do you realize \n                         what Leo could have told Jimmy?! Do \n                         you?!\n\n                                     YELLOW BIRD\n                         I took him out before he got the \n                         chance. He didn't say nothin' about \n                         Tashka Sha. And now his spirit is in \n                         the dirt. Forever.\n\n                                     RAY\n                         What's Tashka Sha, speak English, \n                         speak English!\n\n                                     YELLOW BIRD\n                         Red Deer Table! What's with you, \n                         man?\n\n               Ray grabs onto these words, rolls them silently on his lips \n               And now Yellow Bird is getting suspicious of the fed.\n\n                                     YELLOW BIRD\n                         Wait a minute. Wait -- what are you \n                         doin'? You ain't a FBI. You ain't \n                         the law. Let me see your --\n\n               Ray snaps out his gun, straight-armed.\n\n                                     RAY\n                         I'm the fucking law!\n\n               Yellow Bird jumps back, raising his hands.\n\n                                     RAY\n                         Keep talking, Yellow Bird...\n\n                                     YELLOW BIRD\n                         All I know... is I did what I did... \n                         and I ain't in solitary, gettin' \n                         pumped up with downer, gettin' beat \n                         to shit. But I tell you what, Suit. \n                         Take me back. Cuz I can't take this \n                         shit no more.\n\n               And then HEADLIGHTS pierce the gaps in the boarded windows. \n               Yellow Bird collapses against the wall, bangs his head off \n               it. He lets a long, pained, cry escape from under his breath \n               and he begins a slow slide down the wall, to the floor.\n\n               Ray peers out the cracks in the boards.\n\n                                     YELLOW BIRD\n                         Man, I don't know who the fuck I am \n                         no more.\n\n               Ray gets up, putting his gun away and heading to the door. \n               He stops and looks back at the Indian, sitting on the floor, \n               clutching his knees, staring into the kerosene flicker.\n\n                                     RAY\n                         You and me both.\n\n               Yellow Bird looks at him, his glasses foggy, his face \n               contorted And Ray leaves.\n\n               EXT. YELLOW BIRD'S SHACK - NIGHT\n\n               Ray steps out into the falling night. There is a car parked \n               there. With a high aerial. Ray raises a hand in a slight \n               wave, walks on. At the fed car, A REGIONAL AGENT behind the \n               wheel, waves a hand. Watches Ray get into the Le Baron.\n\n               Ray gets in the car and takes off.\n\n               LE BARON - TRAVELING\n\n               Ray drives like a crazy man through the dark reservation. \n               Through miles of open land and strange rock formations. And \n               he looks trapped. HEADLIGHTS flicker in his rearview. He \n               sees this. Slams the gas pedal.\n\n               EXT. RES ROADS - NIGHT\n\n               The Le Baron races at 85 down the dirt stretch. A moment \n               later a car rattles by at 90.\n\n               INT. LE BARON - TRAVELING\n\n               Ray reaches over to the passenger seat and pulls up the M-\n               16. He lays it across his lap. Looks in the rearview again. \n               Then makes a sudden sharp turn.\n\n               He pulls off the road quickly, throwing up dust into the \n               already foggy night, the car goes out of control.\n\n               EXT. WOUNDED KNEE MEMORIAL - NIGHT\n\n               The car that was following drives right past the narrow layby, \n               hidden by grassy slopes and keeps flying down the long \n               stretch.\n\n               INT. LE BARON\n\n               Ray skids through the dirt, trying to stop -- he can't -- \n               and the Le Baron fishtails, smashing into a chain-link fence. \n               And coming to a stop.\n\n               Breathing as if he's been running not driving, Ray looks \n               behind him to make sure he lost the car. He did. When he \n               turns back to his wheel, he sees --\n\n               THROUGH THE CHAINLINK FENCE\n\n               lit by his headlights: THE WOUNDED KNEE gravesite. He is \n               right up on the arch, and the tall stone marker beyond it.\n\n               EXT. WOUNDED KNEE MEMORIAL - NIGHT\n\n               The Le Baron just sits parked, headlights making the night \n               fog crawl up from the base of the old tomb, along the fence.\n\n               The driver's door opens slowly. And Ray steps out. He walks \n               through the arch. Into the small fenced area. Up to the stone \n               which is overgrown with stubborn weeds, half-hidden in mist. \n               Ray studies the tomb.\n\n               POV: THE NAMES ON THE STONE ARE CHISELED VERTICALLY:\n\n               CHIEF STANDING BEAR\n\n               MR. HIGH HAWK\n\n               AFRAID OF BEAR\n\n               Weeds are grown up over the rest of the names. Ray's hands \n               clear them, grab at them and rip them away from more names:\n\n               PRETTY HAWK\n\n               BLUE AMERICAN\n\n               SHERMAN HORN CLOUD\n\n               With frantic abandon, Ray is ripping weeds away. He drops to \n               his knees, clearing weeds.\n\n               STRONG FOX\n\n               THUNDER HEART\n\n               MOVING DOWN and then suddenly back up to the name:\n\n               THUNDER HEART\n\n               REVERSE ON - RAY\n\n               kneeling in the weeds, the wind getting restless around him, \n               screaming the way plains winds do but only these winds are \n               filled with a whistling. What sounds like EAGLE BONE WHISTLES, \n               piping shrill.\n\n               Ray kneels before the marker, staring at the name on the \n               stone, his hair thrown around by the wind that drives across \n               the grass, whistling eagles, building to an unbearable, pitch.\n\n               Ray stares at the name as if he is looking through a small \n               hole into another world. A world that frightens him. He gets \n               up and backs away from the stone, through the gate. And gets \n               back in his car, quickly. He takes off.\n\n               EXT. MAGGIE EAGLE BEAR'S HOUSE - NIGHT\n\n               The little home on the river. Dark. Empty. Ray runs up the \n               steps, pounds at the door. No answer. Pounds again.\n\n                                     RAY\n                         Maggie!\n\n               He keeps knocking. Nothing. He hurries back down the steps, \n               starts around the back of the house and something attacks \n               him, leaps at him from the dark, knocking him off his feet, \n               into the grass. Hits him again.\n\n               But as quickly as he falls, he rolls, throwing up his hands \n               and blocking a savage kick aimed for his face. He traps the \n               boot, twists it and drops the attacker onto his back. In a \n               matter of seconds, he is on top of the man, sticking his gun \n               in his throat. He grabs a flashlight from his jacket and \n               shines it in the man's face.\n\n               Crow Horse. Breathing like a wild animal.\n\n                                     CROW HORSE\n                         Five-hundred year old turtleshell \n                         rattle...\n\n                                     RAY\n                         Crow Horse, listen --\n\n                                     CROW HORSE\n                         Where's Maggie? Where'd ya take her.\n\n                                     RAY\n                         Nowhere. I'm trying to find her.\n\n                                     CROW HORSE\n                         You got Jimmy. Let her go.\n\n                                     RAY\n                         Crow Horse, listen. You have to come \n                         with me.\n\n                                     CROW HORSE\n                         Why? So you can get rid of me, too?\n\n                                     RAY\n                         No. So we can do what the old man \n                         said. Red Deer Table, Walter. We \n                         have to go.\n\n               Crow Horse lies there, breathing heavy. Ray on top of him, \n               still clutching his gun.\n\n               INT. LE BARON - TRAVELING - NIGHT\n\n               Ray and Crow Horse are quiet as they eat up the dirt roads.\n\n                                     CROW HORSE\n                         Maybe the old man's visions are still \n                         strong.\n\n               Ray nods, concentrating. After a time:\n\n                                     RAY\n                         Do they come in dreams, these visions?\n\n                                     CROW HORSE\n                         Oh yeah. Dreams. Sometimes durin' \n                         sickness. Vision quest. Sweat Lodge. \n                         Ya never know when.\n\n                                     RAY\n                         Just before we caught Jimmy... I had \n                         a dream that I was being chased. And \n                         I was running with other people. Old-\n                         fashion Indian people. I got shot in \n                         the back. Like Leo.\n\n               When Crow Horse doesn't respond, Ray looks over and finds \n               him staring. He looks back to the road. And when he looks \n               back at Crow Horse, he is still staring at him.\n\n                                     CROW HORSE\n                         Where was this?\n\n                                     RAY\n                         At Wounded Knee. I mean, that's where \n                         I was, and that's where the dream \n                         was. Why?\n\n                                     CROW HORSE\n                         You were running with the old ones. \n                         At The Knee. Heavy duty.\n\n                                     RAY\n                         Well, it was just a dream, I --\n\n                                     CROW HORSE\n                         Sonuvabuck! What's with you, Man? \n                         Who are you?\n\n                                     RAY\n                         What do you mean?\n\n                                     CROW HORSE\n                         Nothin'. Forget it.\n\n               Crow Horse looks out the window as if to avoid Ray who is \n               confused by the Indian's smoldering. After a moment, Crow \n               Horse looks at him.\n\n                                     CROW HORSE\n                         You had a vision. You had yourself a \n                         vision. A man waits a long time for \n                         a vision. Might go his whole lifetime \n                         and never get one. And along comes \n                         some instant Indian with a Mastercard \n                         and brand-new shoes, has himself a \n                         vision.\n\n                                     RAY\n                         Sorry.\n\n                                     CROW HORSE\n                         I'm a full-blood Oglala.\n\n                                     RAY\n                         We've driven a long way. Where is \n                         this place?\n\n                                     CROW HORSE\n                         Maybe it was just a dream. Ya know, \n                         just one of them, what do ya call \n                         'em, fitful dreams?\n\n                                     RAY\n                         Yeah. Fitful dreams.\n\n               Crow Horse feels better. He looks out the window, nodding. \n               But it doesn't last long.\n\n                                     CROW HORSE\n                         Bullshit. You had a vision. You got \n                         sign from the old ones.\n\n                                     RAY\n                         What the hell do you want me to do?!\n\n                                     CROW HORSE\n                         Stop.\n\n               Ray brakes. Crow Horse is looking past him. Ray turns. The \n               spectacular mesa that we have admired with every sunrise, \n               looms massive now that we are under it. Moonlight falls on \n               it. And the HEARTBEAT DRUM pulses from it.\n\n               EXT. WHERE-THE-ELK-PEOPLE-USED-TO-LIVE - NIGHT\n\n               The land behind Red Deer Table is Badlands. Badlands pierced \n               by a few rutted old wagon roads. At a place between two \n               grotesque buttes, Crow Horse stops, looking uneasy.\n\n               He digs into his pocket, pulls out some loose tobacco and \n               spills it on the ground. Then he walks on.\n\n               Ray observes this, starting forward, then stopping long enough \n               to fish a cigarette out from his pocket and drop it next to \n               Crow Horse's offering.\n\n               THROUGH THE BADLANDS\n\n               Ray and Crow Horse walk, carefully under a full moon, scanning \n               the area. Crow Horse stops, checks out some tracks. Ray walks \n               on, looking up at the table. He shines his flashlight up and \n               it illuminates --\n\n               A RED RIBBON, tied on stakes on a ridge. Ten stakes. Twenty \n               stakes. Ribbons blowing in the wind.\n\n                                     RAY\n                         What's that?\n\n                                     CROW HORSE\n                         Ain't prayer flags, that's for sure.\n\n               Ray sweeps the light along, walking faster, and then something \n               frightening occurs. Something... some unseen thing snags him \n               by the leg, sucking him into the Earth with a horrible GUSHING \n               SOUND.\n\n               Ray is drawn into a hole up to his hips, a bluish-black slime, \n               oozing out around him. Crow Horse grabs him, struggling to \n               pull him up. He does, stumbling back and stepping into a \n               hole himself.\n\n               The two men are wheeling, throwing flashlight beams around, \n               slapping through a wet jelly, and finally getting their \n               bearings.\n\n               Ray touches the ground where a blue-black chemical solution \n               oozes out with water from the aquifer below. His flashlight \n               scans --\n\n               TWENTY DRILLED HOLES IN THE EARTH. A uranium strip-mining \n               grid laid out in a 50 x 60 pattern. The far side is fenced \n               by flagged stakes.\n\n                                     RAY\n                         Jesus. Oil?\n\n                                     CROW HORSE\n                         Uranium. Test holes. Somebody came \n                         in from the Nebraska side, and did \n                         some shotgun testin'. They're gettin' \n                         ready to suck this baby dry.\n\n                                     RAY\n                         1868... \n\n                                     CROW HORSE\n                         What?\n\n                                     RAY\n                         That's what we're doing here. National \n                         interest. National security. Only \n                         this time it's not gold. It's uranium.\n\n                                     CROW HORSE\n                         We're standin' on broken treaty \n                         ground, Ray. This ain't supposed to \n                         be here. It'll poison the water.\n\n                                     RAY\n                         Leo knew about it. Tried to tell \n                         Jimmy, get the Warriors involved.\n\n                                     CROW HORSE\n                         So they took care of Leo.\n\n                                     RAY\n                         Listen to the water... the river \n                         keeps goin' down then rising again.\n\n               Ray goes to another hole and sticks his arm in up to the \n               elbow, sniffs the solution.\n\n                                     CROW HORSE\n                         They're drainin' our water table. \n                         That's our life, man...\n\n               Ray is looking past Crow Horse at --\n\n               Something strange in the moonlight. COYOTES. Some forty yards \n               away, on a flat stretch of stoney ground. Six Coyotes, dancing \n               in the shadows of rock formations. MOVING IN ON THEM as Ray \n               walks forward, they circle... scatter... run back... circle \n               again. Look straight at Ray, eyes glowing.\n\n               And run.\n\n               REVERSE - RAY\n\n               and Crow Horse walk toward them. To the place they just left. \n               A place in the dirt, they were digging up. When they reach \n               it, they stare down into the dirt.\n\n               A BODY\n\n               lies there, face down. Denim jacket and a shock of black \n               hair, thrown into tangles and dirt. It was buried. Until the \n               coyote caught wind. Crow Horse bends down, touches the \n               jacket... turns the body over And almost vomits when he sees \n               Maggie Eagle Bear.\n\n               RAY\n\n               looks down in disbelief.\n\n                                     RAY\n                         No. No...\n\n               Ray steps back, his boots squishing in solution and sealant \n               and soiled water. He covers his mouth, stopping himself from \n               getting sick. And then he explodes, YELLING.\n\n               LONG SHOT - RED DEER TABLE\n\n               in the moonlight. And RAY'S YELLING ECHOING up out of the \n               rocks\n\n               EXT. BEAR CREEK VILLAGE - NIGHT\n\n               The sordid little village the feds first drove through sits \n               sleepy on the rim of sunrise.\n\n               A DOG BARKS hollow as the Crow Horse motorcycle chutters \n               down and coasts up in front of one of the little homes -- \n               rundown but it has a satellite dish and a decent car like so \n               many. The Le Baron pulls up behind it.\n\n               INT. LE BARON - NIGHT\n\n               Crow Horse walks over to Ray's window, his jeans and boots \n               muddy. No one speaks for a long moment, the night filled by \n               crickets. And that one dog.\n\n                                     RAY\n                         This Clear Moon's house?\n\n                                     CROW HORSE\n                         Yeah. It's time to beat the drum. \n                         You better wait here. He don't trust \n                         the white man.\n\n               Crow Horse crosses the street. Ray sits there, and he looks \n               almost hurt by this statement. But he is the white man. But \n               he is Indian. He lets a long breath escape, rubs at a temple. \n               He takes out a smoke. Tries to light it. His hands are shaking \n               too badly. But he gets it lit, and sits tense, looking in \n               his rearview.\n\n               INT. CLEAR MOON HOUSE - NIGHT\n\n               Oliver Clear Moon sits in a chair, his strong Indian mouth, \n               beginning to tighten at the jowls.\n\n               Across from him, Crow Horse sits on the edge of a couch. \n               MRS. CLEAR MOON, a rotund, gentle woman brings him a coffee. \n               A TEENAGE GIRL in a men's extra-large T-shirt stands in the \n               hall, looking at him.\n\n               Clear Moon in pajamas, rises, and with a coffee in hand, \n               starts walking in slow steps toward the kitchen. He loses \n               control before he gets there and hurls the cup across the \n               room into the sink, smashing it. He wheels and faces Crow \n               Horse. He SPEAKS LAKOTA. Asking questions. Crow Horse SPEAKS \n               LAKOTA. Answering him.\n\n               Mrs. Clear Moon, understanding, shakes her head in disbelief \n               and her eyes begin to well. Oliver, walking back to his chair, \n               sits, and thinks for a moment. MORE LAKOTA. He gets up, goes \n               to a drawer and rummages. He sits again, and tosses something \n               onto the coffee table. It is a badge. A tribal police badge.\n\n               INT. LE BARON - PARKED - CLEAR MOON'S - DAWN\n\n               Ray nervously awaits Crow Horse's words as he appears at the \n               window again. The Indian shows hope in his tired eyes.\n\n                                     CROW HORSE\n                         Alright. Shit's comin' down. He's \n                         callin' council fire. All the old \n                         chiefs and the warriors, too. I gotta \n                         be at Grandpa's place in two hours. \n                         We need to get the tribe together. \n                         We need to block this thing.\n\n                                     RAY\n                         What we need... is Richard Yellow \n                         Bird.\n\n               Crow Horse looks at Ray who stares dead ahead.\n\n               EXT. YELLOW BIRD'S SHACK - RES - DAWN\n\n               The shack is just as Ray left it earlier, kerosene flickers \n               dancing yellow through the gapped boards. Ray and Crow Horse \n               with guns drawn, approach the front door.\n\n                                     CROW HORSE\n                         I thought it was a rare case of a \n                         brother getting a break in the courts. \n                         We did an honorin' song for him and \n                         everything.\n\n                                     RAY\n                         He's looking at a few hundred years \n                         in Leavenworth. He's not gonna come \n                         out without a fight.\n\n               Crow Horse snakes around toward the rear of the shack.\n\n               Ray knocks at the front door. It is unlatched and it creaks \n               open a little. Ray pushes it open and sees --\n\n               INT. YELLOW BIRD SHACK\n\n               An empty wheelchair.\n\n               EXT. YELLOW BIRD SHACK\n\n               Ray steps away from the door, looking around the vast plains \n               as the sun comes up out of the Black Hills. He is roadblocked, \n               and it shows in his eyes. It's all getting too big.\n\n               Crow Horse leans against the shack, watching Ray. And then \n               RADIO STATIC from inside the Le Baron. Ray pivots and stares \n               at it as if someone is inside the car. His call signal is \n               being paged. But he just stands there, looking at it.\n\n                                     RADIO\n                         X21. Read. X21...\n\n               Ray reaches inside the car and lifts the handset. He takes a \n               breath before pressing it to his lips.\n\n                                     RAY\n                         X21. Come back.\n\n                                     RADIO\n                         Ray. What's your 20?\n\n               Ray looks at Crow Horse who looks equally spooked. The agent \n               clears his throat.\n\n                                     RAY\n                         Reservation.\n\n               A long, unnerving pause. No response from the other side.\n\n                                     RADIO\n                         What are you doing on the reservation?\n\n                                     RAY\n                         I'm on my way back in. Over.\n\n               Ray holds the handset down at his side, looking over the top \n               of the car toward the Black Hills.\n\n                                     CROW HORSE\n                         Ray. Ray, don't let go now, Man. \n                         Ray...\n\n                                     RAY\n                         You go to the council fire. I'm going \n                         back in.\n\n                                     CROW HORSE\n                         Ray.\n\n               Ray swings in behind the wheel, starts the car, and barrels \n               off recklessly down the rutted road, leaving Crow Horse \n               behind.\n\n                                     CROW HORSE\n                         Ray!\n\n               The Le Baron is already out to where sight reaches farther \n               than sound and silent white dust mushrooms skyward.\n\n               EXT. BUFFALO BUTTE MOTEL - MORNING\n\n               A RAVEN is sentinel on a telephone wire that crosses the \n               road from the bar to motel. A few trucks remain parked in \n               front of the joint.\n\n               Ray approaches room 13, looking shell-shocked. His boots \n               leave blue mud prints all the way to the door. He unlocks \n               it.\n\n               INT. BUFFALO BUTTE MOTEL - ROOM\n\n               Ray has cast off his field clothes and is halfway into one \n               of his cleaner suits. He looks haggard but still buoyant, \n               his eyes piercing. The connecting door creaks open and Cooch \n               walks in. The SAC is freshly showered and he is fidgeting \n               with a Windsor knot. He studies his number two man, says \n               nothing for a moment but is obviously holding something down. \n               His face is a red hue.\n\n                                     COOCH\n                              (extra casual)\n                         Couldn't sleep, Ray?\n\n               Ray looks at Cooch. When he speaks, his voice is dry.\n\n                                     RAY\n                         No...\n\n               Cooch crosses the room, and picks up Ray's jeans which look \n               like they went through a sandlot tackle match in a mud hole. \n               Ray tucks his clean shirt in; watching Cooch.\n\n                                     RAY\n                         I had to finish something with Crow \n                         Horse.\n\n               Cooch walks up to Ray slowly and takes his face in his hand, \n               turning it toward lamp light to study the bruise along his \n               left eye, a residual from a Crow Horse hook.\n\n                                     COOCH\n                         That's where you were. You had to go \n                         back and have it out with the Indian \n                         law...\n\n               Ray nods, and Cooch slowly breaks a smile. An insecure smile \n               but a smile just the same. He starts to laugh.\n\n                                     COOCH\n                         You fucking hot head, we can get in \n                         trouble for that.\n\n               Cooch laughs in amusement and Ray's face crinkles into a \n               grin as he lowers his eyes, wiping a paper towel over his \n               face. And then, suddenly, Ray lunges at Cooch.\n\n               He slams the Agent in Charge against the hollow wall, and \n               holds him there. His eyes wild.\n\n                                     RAY\n                         Why didn't you tell me what we were \n                         doing here?\n\n               Cooch is stunned.\n\n                                     RAY\n                         We're running a cover-up and you \n                         didn't --\n\n               Cooch suddenly explodes, throwing Ray off of him and sending \n               him reeling back against the sink. He points a finger at his \n               charge.\n\n                                     COOCH\n                         You ever put your hands on me again \n                         and you'll be doing the books for a \n                         baitshop in the fucking Everglades, \n                         Mister.\n\n                                     RAY\n                         You didn't tell me about Red Deer \n                         Table --\n\n                                     COOCH\n                         -- what the hell is Red Deer Table?\n\n                                     RAY\n                         What is it? It's genocide, that's \n                         what it is. It's a Pay Zone for some \n                         U.S. corporation and a Dead Zone for \n                         the people here. Uranium, Cooch.\n\n               Cooch's eyes go frighteningly cold. He can't believe what \n               he's hearing.\n\n                                     COOCH\n                         Jesus Christ. What are you doing? \n                         What the hell were you doing out \n                         there?\n\n               Ray says nothing. He just stands there, against the sink, \n               breathing like a fighter against the turnbuckle.\n\n                                     COOCH\n                         This was a Selective Operations Unit, \n                         Agent Levoi. There is classified \n                         information pertaining to our national \n                         security. You don't question that, \n                         you don't go digging into that shit -- \n                         that's insubordination. Jesus Christ --\n\n                                     RAY\n                         -- if they mine uranium there, these \n                         people will have no place left to \n                         go...\n\n                                     COOCH\n                         We were sworn in on the Constitution \n                         to protect federal matters, Ray. I \n                         don't know about uranium, I don't \n                         know about Red Dog Table -- all I \n                         know is we did our job. It's over.\n\n                                     RAY\n                         We neutralized anybody with a voice. \n                         Leo, Jimmy... Eagle Bear. Anyone who \n                         was standing in the way of the land. \n                         Is that it?\n\n                                     COOCH\n                         No. We neutralized enemies of the \n                         United States. Anti-American radicals \n                         who have killed federal officers out \n                         here!\n\n               Ray turns to the sink, turns the faucet on to get some water \n               on his face. The water only trickles into the basin.\n\n                                     COOCH\n                         Jesus, Ray. You think I don't like \n                         the Indians? Not true. These were \n                         noble people but their day is gone. \n                         They're a conquered nation. They \n                         want all of America back but they \n                         can't even keep the garbage out of \n                         their own front yards. It's sad, \n                         Ray. But it's just the way it is. We \n                         have to function as a colonial police \n                         force out here.\n\n               Ray leans on the sink, watching the water start to spurt \n               free. He shuts it off. Turns to look at Cooch. And it is \n               then the door opens -- some knocking after the door is already \n               opened -- and SA Miles enters.\n\n                                     MILES\n                         You gentlemen ready -- hi, Ray.\n\n                                     COOCH\n                         Yeah, we're ready.\n\n               Ray doesn't turn from the sink.\n\n               EXT. RESERVATION ROAD - TOWARD GRANDPA REACHES - MORNING\n\n               Crow Horse chugs along on his motorbike toward the council, \n               his long hair and eagle feather trailing in the wind.\n\n               EXT. BUFFALO BUTTE MOTEL - MORNING\n\n               Two federal vehicles are waiting in front of Cooch's Chevy \n               and Ray's Le Baron. One is an FBI van where Sherman helps \n               THREE AGENTS load file boxes and computers.\n\n               Cooch walks with Ray toward the Le Baron, looking at him as \n               the go. Ray looks better as he breathes the morning air. As \n               they pass the second fed car, the back window power glides \n               down, and someone looks out with a friendly smile.\n\n                                     CLEAR MOON\n                         Ah, there you are. The Sioux.\n\n               Ray stops dead. Beholds the Tribal President who wears a \n               western cut jacket and a strained expression behind his smile. \n               He hole a hand out to Ray.\n\n                                     CLEAR MOON\n                         You got the troublemakers off our \n                         land. Good, Was-te.\n\n               Ray stares at him, speechless. Horrified. What is he doing \n               here? What about the council fire? Ray somehow nods. Then \n               walks on to the Le Baron. Cooch gets behind the wheel of the \n               car that Clear Moon sits in. Clear Moon's eyes follow Ray to \n               the car.\n\n               EXT. RES ROAD - TO GRANDPA REACHES\n\n               Crow Horse guns past a little shack. As he does, he looks in \n               his side mirror then out across the grasslands. Then quickly\n\n               IN HIS MIRROR: a car has pulled out from behind the shack. \n               CROW HORSE observes this. Then twists the fuel throttle hard.\n\n               INT. LE BARON\n\n               Ray gets behind the wheel, looks at his watch. He is \n               panicking. He starts the car, reverses, slams into drive.\n\n               RAY\u0092S POV: swerving and reckless as he races forward. Sherman, \n               walking around to one of the cars has to run out of the way. \n               The other agents clear out, looking in confusion as Ray cuts \n               a hard U -- sweeps PAST THE BAR, SMASHES INTO AND THROUGH \n               the old hitching post -- and HEADS TOWARD the reservation \n               which lies vast before him.\n\n               EXT. BUFFALO BUTTE MOTEL\n\n               With agents scrambling about, looking after the car, Cooch \n               gets out, looking into the dust Ray left behind. HEARTBEAT \n               DRUM.\n\n                                     COOCH\n                         RAY!\n\n               Sherman appears beside Cooch aiming a questioning look. When \n               Cooch quickly gets back behind the wheel, Sherman pulls his \n               radio up and starts yelling into it.\n\n               Cooch reaches out the window and grabs his radio arm.\n\n                                     COOCH\n                         No, damn it. You call teams in and \n                         this is gonna be a fucking media \n                         event. Get me three cars, six agents, \n                         block all reservation exits. It's \n                         under control.\n\n               And Cooch squeals out with a petrified Clear Moon in the \n               backseat, inquiring nervously.\n\n               EXT. ROAD TO GRANDPA REACHES\n\n               Crow Horse passes by an abandoned horse trailer. When he \n               does, another car pulls out. And follows. The first car passes \n               by.\n\n               Crow Horse sees he's being followed. He cranks his throttle \n               and the engine grinds then dies. He heels his kickstart on \n               the fly, and keeps it alive. But his old horse is no match \n               for the big engines coming up fast behind him.\n\n               INT. LE BARON - TRAVELING\n\n               Ray is leaving little transitional developments and trailers \n               behind. His eyes bore into the road before him, looking for \n               a sign of Crow Horse, and in the rearview for a sign of his \n               FBI mentor.\n\n               EXT. ROAD TO GRANDPA REACHES - BADLANDS\n\n               Crow Horse has the throttle open. But the two cars are coming \n               up on both sides, trying to sandwich him. To his right the \n               Badlands loom deep, a drop into a caliche netherworld of \n               jagged rock.\n\n               He throws the bike right, trying to ride the thin ribbon of \n               shoulder.\n\n               THE FIRST CAR\n\n               floors it, and swipes him, and the bike goes over the edge, \n               launched into --\n\n               THE BADLANDS\n\n               where it does a violent triple flip, throwing Crow Horse \n               then smashing into a tent shaped dune.\n\n               A RIFLE\n\n               sticks out from a window and punches the Badlands with THREE \n               SHOTS.\n\n               EXT. ROAD TO GRANDPA REACHES\n\n               The Le Baron rifles past the abandoned horse trailer. Black \n               smoke drifts in a wind ahead.\n\n               Ray veers onto the shoulder, barely gets the car in park \n               before bailing and running wildly down into the Badlands.\n\n               EXT. BADLANDS\n\n               Ray runs, stumbles through the rock and gypsum, searching \n               the area. He runs around the burning motorcycle, looking \n               left and right.\n\n                                     RAY\n                         Crow Horse!\n\n               CROW HORSE\n\n               lies on his back in the Badlands, eyes open, fixed unmoving \n               on the sky. Ray comes out of the flame-waves, running with \n               his .45 held high. He throws himself to his knees beside the \n               injured Indian.\n\n                                     RAY\n                         Crow Horse!\n\n               Crow Horse rolls his eyes toward the FBI agent. He has a \n               gash behind his ear, and pink sand clings to the blood. He \n               lifts his head, tries to form words.\n\n                                     CROW HORSE\n                         Ain't no Council Fire, Brother. Clear \n                         Moon...\n\n                                     RAY\n                         I know. Come on. We gotta get off \n                         the reservation or we're dead.\n\n                                     CROW HORSE\n                         Hoka Hey. It's a good day to die.\n\n                                     RAY\n                         Bullshit, let's get outta here,\n\n               Ray gets an arm under the big Indian, helps him up out of a \n               jagged crevice.\n\n                                     CROW HORSE\n                         Grandpa...\n\n               EXT. RESERVATION ROAD\n\n               Cooch's car speeds down the stretch. Followed by Sherman's. \n               The FBI van. All at one-hundred and five. Gravel and dirt \n               flies.\n\n               INT. LE BARON - TRAVELING\n\n               With Crow Horse half-passed out in the passenger seat, Ray \n               keeps the wheel steady. And then his RADIO STATICS.\n\n                                     RADIO\n                         X21, please read. Ray. Ray. X21, \n                         please read. This is Cooch. Please \n                         come in, Ray. Where are you?\n\n               Ray just stares down at the radio, keeps the pedal floored. \n               The throws the wheel left.\n\n               EXT. GRANDPA REACHES TRAILER\n\n               The Le Baron fish-tails in a cloud of dust and Ray leaps out \n               of the car, runs toward the little trailer, gun in hand. The \n               windows are all busted, and the door is wide open. Ray runs \n               in. Then straight back out, shaking his head to Crow Horse.\n\n               Crow Horse hangs his head out the passenger window.\n\n                                     RAY\n                         He's gone.\n\n                                     CROW HORSE\n                         He hasn't left this place in twenty \n                         years. They got him.\n\n               Ray starts to get back in then hesitates. He looks out across \n               the plains to see --\n\n               THREE FED CARS in the distance, fast approaching, dust rising.\n\n               Ray gets in quickly.\n\n               EXT. RESERVATION EXIT\n\n               Cooch's car is parked in a roadblock. Clear Moon stands near \n               him, and addresses UNIFORMED TRIBAL POLICE as they spill out \n               from a van, carrying rifles and shotguns.\n\n                                     COOCH\n                              (into radio)\n                         X21. Ray. Ray, please come in.\n\n               Cooch has torn his tie away, his shirt is open, and he is \n               sweat soaked. Miles gets out of a car that pulls up.\n\n                                     MILES\n                         We have a renegade agent, Cooch? He \n                         gets off the reservation...\n\n                                     COOCH\n                         -- he's not getting off the \n                         reservation.\n\n               And Cooch gets back in the car, drives off.\n\n               INT. LE BARON - TRAVELING\n\n               With Ray driving like a maniac, Crow Horse is turned around \n               in his seat, watching the federal cars spreading out, the \n               chopper moving in.\n\n                                     CROW HORSE\n                         They got us sealed. What are we gonna \n                         do?\n\n                                     RAY\n                         We're going for The Stronghold.\n\n               Crow Horse looks at him.\n\n                                     RADIO\n                              (Cooch)\n                         Ray. Can you hear me? You are fucked. \n                         There's no way out of this. If you \n                         won't listen to your own laws, then \n                         listen to this:\n                              (static: a new voice)\n                         This is President Clear Moon. This \n                         nation does not want your sympathy. \n                         You cannot use this reservation as a \n                         sanctuary. Stop where you are now.\n\n               Ray and Crow Horse exchange a look.\n\n                                     RADIO\n                              (Cooch)\n                         Whatever you are trying to do is \n                         futile, Raymond. You have nothing. \n                         Nothing.\n\n               Ray picks up the mic as he cranes to keep an eye on the \n               rearview.\n\n                                     RAY\n                         Yellow bird... is gonna sing.\n\n                                     RADIO\n                              (Cooch)\n                         Yellow Bird committed suicide at \n                         three o'clock this morning. Some \n                         gung-ho agent from D.C. pushed him \n                         into a corner. You're playing a losing \n                         game. Pull over.\n\n               Ray takes the mic and for some reason, he's putting it inside \n               his jacket near his shoulder where he keeps his leather. \n               Crow Horse looks at him, puzzled. And then the sound comes \n               forth, the static crackling of a micro-cassette recorder.\n\n                                     RECORDER\n                              (Ray)\n                         How the hell do you know?\n                              (Yellow Bird)\n                         I blew his back out with a buffalo \n                         gun, that's how I know. And now you're \n                         gonna say I didn't and put me back \n                         in solitary?!\n\n               Ray keeps the tape running into the radio as he drives through \n               rugged Badlands. Crow Horse, stunned by the voice, eyes Ray \n               as the tape rolls.\n\n               INT. CHEVY - TRAVELING\n\n               Cooch and Clear Moon stare in horror at the radio.\n\n                                     RADIO\n                              (Yellow Bird)\n                         You people tol' me I could beat nine \n                         years if I helped you. I helped you!\n                              (rewinding)\n                         I could beat nine years if I helped \n                         you. I helped you!\n\n               Cooch is shaking his head in vitrified disbelief. He slams \n               the pedal almost through the floor.\n\n               INT. LE BARON - TRAVELING\n\n               The tape ends and Ray now lifts the mic to his mouth.\n\n                                     RAY\n                              (into mic)\n                         Fuck you.\n\n               And he too, buries the accelerator.\n\n               EXT. BADLANDS ROAD \u0096 TO THE STRONGHOLD\n\n               The Le Baron burns forward and we SWEEP UP TO A MIND-BLOWING \n               AERIAL VIEW of the Badlands as four fed cars spread out in \n               formation, following.\n\n               INT. LE BARON - TRAVELING\n\n               Crow Horse is turned around, looking at the pursuit.\n\n                                     RAY\n                         Walter.\n\n               Crow Horse turns, sees what Ray is looking at.\n\n               POV: The Stronghold -- a narrow opening in hulking rock \n               formations. Large enough for a car to get in, and keep \n               followers out.\n\n                                     CROW HORSE\n                         That's it. The Stronghold. Get us in \n                         there, we got a chance.\n\n                                     RAY\n                         We're in there. We're in there --\n\n               just ahead, the earth is gone. A wavering heat pond turns \n               out to be a crevice and they nose down into it, burying the \n               front end in sand and rock. WINDSHIELD SHATTERS.\n\n               EXT. THE STRONGHOLD\n\n               The Le Baron is stuck, wheels spinning out. Ray and Cooch \n               bail. Guns drawn, they start running for the Stronghold.\n\n               AT THE EDGE OF THE ARROYO\n\n               the caravan slides in recklessly, two of the fed cars coming \n               dangerously close to going over the edge. The regional \n               officers and six Clear Moon goons empty out, running down \n               the dip, rifles and shotguns ready.\n\n               Three more field agents come down from another direction, \n               followed by Cooch. Sherman hands a bullhorn to him.\n\n                                     COOCH\n                              (via bullhorn)\n                         FREEZE! NOW!\n\n               The sound of FIFTEEN PRIMING FIREARMS stops Ray and Crow \n               Horse in their tracks. Just twenty feet from The Stronghold. \n               Crow Horse, windless, stumbles to a knee. Ray turns slowly, \n               facing the small army.\n\n                                     COOCH\n                         DROP IT.\n\n               Crow Horse, rises, sucking wind, and ditches his gun in the \n               Badlands. Ray holds onto his .45 a moment longer. Then drops \n               it. He stares at --\n\n               THE WALL OF MEN\n\n               Cooch, SA Miles, SA Sherman, Six regional officers, six Clear \n               Moon goons. And now, coming out of the backseat of Cooch's \n               Chevy, Oliver Clear Moon, walking tentatively, cautiously.\n\n               Cooch lowers the bullhorn. He takes the opportunity to stare \n               at Ray. To let Ray stare at him. The older agent looks broken.\n\n                                     COOCH\n                         Crow Horse, get your face in the \n                         dirt. Ray... come forward. Let it \n                         go. Let's just let it go...\n\n               AT THE STRONGHOLD ENTRANCE\n\n               Crow Horse lowers himself to a knee then lies face down. Ray \n               just stands there, the wind against him.\n\n                                     COOCH (O.S.)\n                         Come on, Ray. Come forward.\n\n                                     RAY\n                         No way, Cooch.\n\n               Ray refuses to move.\n\n               COOCH\n\n               sweating, tries to keep control. All around him, hands are \n               on guns. Cooch is walking toward Ray.\n\n                                     COOCH\n                         Ray. I'm coming to talk to you. I'm \n                         gonna walk you out of here. And we're \n                         gonna get the hell outta this place.\n\n               Cooch walks toward him, a gun hanging at one side, bullhorn \n               at the other. The agents behind him, around him, all raise \n               rifles, all take aim.\n\n               Sherman, looking sick, gets to a knee and sets aim. The sound \n               of clacking steel, all around. But Cooch seems disturbed by \n               the sound. Because its coming from above. He raises an eye \n               from the rifle sight to see --\n\n               ALONG THE EDGE OF THE BUTTE\n\n               FIFTEEN INDIANS, training rifles and shotguns down below.\n\n               SHERMAN\n\n               looks up from his rifle, bewildered. Then alarmed.\n\n               ALONG THE EDGE OF THE BUTTE\n\n               We PAN across fifteen Indians -- old people, women, kids. \n               Their weapons are weak but many.\n\n               And at the end of the row, Maisy Blue Legs rises, clutching \n               a rifle. And PAST HER, ANOTHER. TRADITIONAL PEOPLE, many \n               from the trading post porch, rise to the edge, armed. Silent.\n\n               Twenty, twenty-five, thirty traditionals, forming a line \n               along the ridge, a line that runs in a circle, broken by the \n               Stronghold entrance, then starting again on the next butte. \n               Thirty-five, forty of them. And more, standing along the \n               opposite craggy rock, some wearing tractor caps, some cowboy \n               hats, some just long hair blowing in the wind. Fifty, sixty, \n               SEVENTY-FIVE RESERVATION PEOPLE forming a circle on the rocks; \n               it's Little Big Horn revisited. A fourteen year-old boy \n               struggles to keep a huge shotgun at his shoulder.\n\n               DOWN BELOW\n\n               Clear Moon's mouth is as dry as Badlands soil. Cooch is \n               panicking, his eyes running along the high edge.\n\n               RAY\n\n               stands equally astonished, assessing the back-up.\n\n               CROW HORSE\n\n               lifts himself, stands, taking in the sight.\n\n               AT THE EDGE OF THE BUTTE\n\n               stepping stiffly but steadily through the line of armed \n               locals, pushing his way to the very edge so as to look down, \n               Grandpa Sam Reaches. The wind makes feathery tails out of \n               his long thinning strips of white hair.\n\n               DOWN BELOW\n\n               Ray looks up at the old man, then turns to face Cooch.\n\n                                     RAY\n                         You're right, Cooch. It's over.\n\n               Cooch slowly, lets the bullhorn fall. Then the rifle. He \n               looks back at Sherman who does the same, and all the way \n               down the line, everyone dropping their arms under the threat \n               of a lot more guns from above. And now Ray walks forward, \n               collecting his gun. Anderson Chasing Hawk, one of the \n               Warriors, runs down to Ray, breathless.\n\n                                     CHASING HAWK\n                         All the exits are blocked. There's \n                         two more fed cars tryin' to get in. \n                         And some press.\n\n               Ray notices that Cooch is staring at him, hard. He shakes \n               his head slowly. Strongly.\n\n                                     COOCH\n                         Ray...\n\n                                     RAY\n                         Let the press through.\n\n               Chasing Hawk takes off, running, and Cooch watches in \n               consternation. Ray just stands eye to eye with him, holding \n               his ground.\n\n               UP TO ARIEL VIEW - OVER STRONGHOLD\n\n               And along the ridge, Grandpa and the locals don't budge, \n               watching every move.\n\n               CLIMBING HIGHER, we rise above the circle of proud Sioux to \n               see, on the inside of the Stronghold, thirty old trucks and \n               res cars.\n\n               CLIMBING HIGHER into and through the fast-moving clouds that \n               the Lakota call The Grandfathers as the HEARTBEAT DRUM and \n               LAKOTA SINGERS takes over all sound.\n\n                                                          SLOW DISSOLVE TO:\n\n               EXT. BEAR CREEK RESERVATION - MAIN SETTLEMENT - LATER\n\n               The HIGH WINDS of THREE MEDIA HELICOPTERS are delighting a \n               storm of Indian children and BARKING DOGS, running through \n               the streets past junked cars on blocks.\n\n               Over on a little plot of grass and dirt, a pair of hands are \n               digging a small hole. Ray lays a pine cone in the hole and \n               looks down at it for a moment... before hand-plowing the \n               dirt back over it and patting it flat. He rises, knocking \n               dirt off his knees and hands.\n\n               Crow Horse walks over, bandaged and favoring wounds, and Ray \n               falls in with him, walking down the middle of the village \n               road. His eyes are tired. But hopeful.\n\n                                     CROW HORSE\n                         The people are already talkin' about \n                         their vote for a new tribal prez. \n                         They wanna vote for Jimmy.\n\n               Ray nods, encouraged as they walk along. His eyes follow the \n               helicopters.\n\n                                     RAY\n                         What about the water...\n\n                                     CROW HORSE\n                         You bought her some time, Kola. Ain't \n                         never gonna be over... but you bought \n                         her some time.\n\n                                     RAY\n                         Some Indian time?\n\n               They reach the dusty, dented Le Baron and stand there, looking \n               at each other.\n\n                                     CROW HORSE\n                         Indian time.\n\n               Crow Horse offers a hand to Ray. He takes it in a white man's \n               shake then follows Walter's cue into the Indian \"allies\" \n               grip and slap. They hold it there, looking into each other's \n               eyes.\n\n                                     CROW HORSE\n                              (concerned)\n                         Where ya gonna go, Ray?\n\n               Ray ponders for a moment.\n\n                                     RAY\n                         I'll have to see what the visions \n                         say about that one.\n\n                                     CROW HORSE\n                         You didn't have another vision...\n\n               Ray shrugs. Crow Horse discreetly gestures below his belt.\n\n                                     CROW HORSE\n                         Yeah, right here.\n\n               Ray cracks a smile, a long time coming.\n\n                                     RAY\n                         You take care.\n\n                                     CROW HORSE\n                         If you ever need a place to come \n                         back to and listen to the trees a \n                         little... we'll be here.\n\n               Ray stands looking at him, searching for words.\n\n                                     CROW HORSE\n                         Ain't no word in Sioux for goodbye.\n\n               Ray goes to get in his car. But he sees someone sitting across \n               the street on the trading post porch. The old man.\n\n               Ray considers him for a moment then walks over. They lock \n               eyes. Grandpa stares at Ray as if he's never seen him before, \n               and then arcs a brow. He touches his sleeve at the wrist. \n               Ray rolls his sleeve back to reveal his Rolex. Grandpa smiles \n               and Ray strips it off. He hands it to the old man and his \n               face crinkles into caliche earth.\n\n               Grandpa holds the watch up in the light, admires it then \n               puts it in his shirt pocket. He moves a flat hand through \n               the air in the \"done deal\" sign language. Ray, a little \n               surprised that he gets nothing in the trade, returns the \n               smile and walks away.\n\n               He gets to his car and wipes away two inches of dust from \n               the broken windshield.\n\n               INT. LE BARON\n\n               After THREE TRIES, he gets the engine started. He pulls his \n               gun off his waistband, goes to lay it on the passenger seat \n               and finds something there.\n\n               Grandpa's sacred caanunpa. The Pipe. Symbol of truth. Ray \n               looks out the window at the old man who is watching him with \n               those sharp black eyes. Ray lifts his hand, holds it flat, \n               and does the Sioux done deal sign.\n\n               EXT. BEAR CREEK RESERVATION - DAY\n\n               The Le Baron eats up the dirt road at a moderate, gravel \n               crunching pace. It slows as it passes Maggie Eagle Bear's \n               quiet home on the river. Children walk with the old woman, \n               carrying buckets from the river.\n\n               The Le Baron slows to a crawl, then drives on.\n\n                                                                    CUT TO:\n\n               THE TRADING POST PORCH\n\n               where the elders sit, watching the dust blow.\n\n                                     CROW HORSE (V.O.)\n                              (voice lingering)\n                         We will be here.\n\n                                                                    CUT TO:\n\n               CROW HORSE walking off down the road. He stops, and looks \n               over his shoulder, trying to glimpse the distance.\n\n                                                                    CUT TO:\n\n               THE LE BARON driving off the res, under big sky as it ascends \n               a rough hill, waddles through potholes, negotiates with some \n               horses in the road and rolls on toward the reservation line \n               where the sun throws shadows that look like an old man \n               dancing.\n\n               AT THE PLACE IN THE ROAD\n\n               where West goes to Rapid City, and East back to Bear Creek, \n               Ray stops like the bullet-punched sign orders. He doesn't go \n               West. Doesn't go East. He sits there. Fishes a smoke out \n               from a pocket, clicks a lighter, and fires up. He sits there, \n               smoking.\n\n               Deliberating.\n\n               SUDDEN CUT TO BLACK.\n\n               And after a long silent beat, A DRUM. Like a heart.\n\n               END CREDITS.\n\n                                         THE END\n\n\n\n\n\nThunderheart\nWriters :   John Fusco\nGenres :   Crime  Mystery  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:37:16.529952"}