{"title": "Ticker", "film_link": "/Movie Scripts/Ticker Script.html", "script_link": "/scripts/Ticker.html", "info_raw": "\n\nTicker Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Paul B. Margolis\nGenres  Action.Thriller  Crime\nScript Date : November 1997\nMovie Release Date : November 2001\n\nRead \"Ticker\" Script\n\n\n", "script": "\n\n\n\n\n                                     TICKER\n\n\n\n                                   Written by\n              \n                                Paul B. Margolis\n\n          \n          \n          \n          \n                                                     Original Draft: 11/10/97\n\n          \n          1   EXT.   METROPOLITAN CITY - DOWNTOWN - LATE NIGHT              1\n          \n              Hot summer night. The flesh district - hookers working the\n              sidewalks, stopping cars.\n          \n              MIKE REILLY, 20s, paces a corner, restless, looking for\n              action ... wet hair, three-day beard, trenchcoat, sneakers,\n              heat-seeking weary eyes. He flashes a wad of bills in an\n              effort to get some attention... no one notices.\n          \n              Across the street, BILL RICE, 50's, a ragged transient,\n              strolls over.\n          \n                                   RICE\n                      Know what the problem is, kid?   You're too\n                      ugly to get propositioned.\n          \n                                   REILLY\n                      Look who's talking, old man.\n          \n                                   RICE\n                      C'mon, it's a quiet night.\n          \n              Rice starts away.   Reilly pauses, then trudges after him.\n          \n          2   EXT.   SIDESTREET - NIGHT                                     2\n          \n              Rice and Reilly pull donuts and coffee out of a bag, talk\n              with their mouths full as they walk.\n          \n                                   RICE\n                      Next week we work the park.\n          \n                                   REILLY\n                      I gotta get back on top.   Get off the sleaze\n                      detail.\n          \n                                   RICE\n                      You will, one day at a time.   I'll be old and\n                      grey when it happens...\n          \n                                                                11/10/97   2.\n          \n          \n          \n          \n          They share a grin, pass a BAG LADY who wears a pie-tin crown,\n          holding her hand out to a PIMP getting into a Cadillac.\n          \n                              BAG LADY\n                 A small gift, sir, for the Queen ...\n          \n          The Pimp ignores her, screeches off. The Bag Lady pulls out\n          a pad, adds his license number to a list, glances up at Rice\n          and Reilly.\n          \n                              BAG LADY (cont.)\n                 I keep a record, see? They don't\n                 pay, I don't forget.\n          \n          Rice fishes some change out of his pocket.\n          \n                              RICE\n                 Here you go, your Highness.\n          \n                              BAG LADY\n                 Thank you, officer.\n          \n          She pushes her shopping cart away. Rice and Reilly look at\n          each other, crack up, surprised she knew he was a cop.\n          \n                              REILLY\n                 So what'll you do? After they give you the\n                 gold watch.\n          \n                              RICE\n                 Hell, I got a gold watch... it just don't\n                 work. Maybe they'll give me a new fishing\n                 pole, or something useful.\n          \n                              REILLY\n                 You don't fish.\n          \n                              RICE\n                 How hard can it be? The grand kids been\n                 buggin' me about taking them camping.\n          \n                                                                     11/10/97     3.\n          \n          \n          \n          \n                                  REILLY\n                     You outta the city... that's a fish out of\n                     water. What's with all this family talk\n                     lately, anyway?\n          \n                                  RICE\n                     One of these days you're gonna get tired of\n                     fighting the shit. When that happens, you'll\n                     wish you had family.\n          \n                                   REILLY\n                     No thanks.   I got close but it never woulda\n                     worked.\n          \n              They stop beside a dirty, beat-up Studebaker parked in the\n              alley, climb in, Reilly behind the wheel.\n          \n          3   INSIDE THE STUDEBAKER                                           3\n          \n              Cluttered with debris - clothes, boxes, personal items.\n              Reilly jiggles the ignition - the engine coughs and sputters,\n              finally turns over.\n          \n                                  RICE\n                     Why don't you just shoot it and put it out of\n                     its misery?\n          \n                                  REILLY\n                     What are you talking about, it's purring like\n                     a kitty.\n          \n                                  RICE\n                     I thought you said what's-her-name's brother\n                     was going to fix it.\n          \n                                  REILLY\n                     She didn't work out, had to cut her loose.\n          \n                                  RICE\n                     What was it this time?\n          \n                                  REILLY\n                     She wanted to cook me breakfast.\n          \n                                                                      11/10/97    4.\n          \n          \n          \n          \n              The White Van appears up ahead and turns into a seemingly\n              deserted building's garage.\n          \n              Reilly and Rice exchange a glance as they wait to see lights\n              come on in the building. They don't.\n          \n              Two flashlight beams criss cross through the windows of the\n              building briefly, then disappear. They hear a brief heated\n              argument, that is cut short abruptly. Then silence.\n          \n                                   REILLY (cont.)\n                      C'mon, let's check it out.\n          \n                                   RICE\n                      We're vice, I didn't see no pimps or hookers\n                      in that van. But if you're so gung-ho, we'd\n                      best call it in for some back-up.\n          \n                                   REILLY\n                      Nah, let's just take a look-see.\n          \n              Reilly jumps out and heads for the building.   Rice rolls his\n              eyes, follows.\n          \n          4   INT.   BUILDING - NIGHT                                         4\n          \n              A huge, old, battered machine shop. Spooky darkness, dead\n              quiet. Moonlight filters in through dirt-smeared windows.\n          \n              The door CREAKS as Reilly and Rice slip in, stop, eyes scan.\n              Nothing.   Just rows of glistening machines.\n          \n              Rice gestures for Reilly to spread out. They head in,\n              footsteps echoing, shadows washing over them.\n          \n              Still nothing...deeper, deeper... then, glancing over, Reilly\n              sees a shape hiding behind a machine. He steps towards it.\n              The shape whirls - a beautiful spitfire of a GIRL with\n              piercing blue eyes.\n          \n              She tries to bolt. Reilly grabs her. She struggles, pulls a\n              knife, slashes his arm, drawing blood through his trenchcoat.\n          \n                                                                   11/10/97   5.\n          \n          \n          \n          \n                               REILLY\n                 Ow!   Son-of-a-bitch.\n          \n          He punches her full force in the face - she collapses,\n          knocked out cold. Rice rushes over.\n          \n                              RICE\n                 You okay?\n          \n                              REILLY\n                 Yeah, just a nick ...\n          \n          Then, over Reilly's shoulder, Rice sees a dark SILHOUETTE\n          emerging from behind a machine. Rice draws his pistol.\n          \n                               RICE\n                 Freeze!   Police!\n          \n          As Reilly whirls, the Silhouette raises a Mac-11.\n          \n          Rice shoves Reilly aside as the Silhouette OPENS FIRE...\n          \n          Diving for cover, Reilly flings back his trenchcoat, whips\n          out his 9mm and RETURNS FIRE at the Silhouette, blowing the\n          shit out of windows behind, sparks showering off machines.\n          \n          Silence for an instant, Reilly looks for Rice and finds him\n          bleeding to death on the floor nearby - he is completely\n          exposed to the line of fire.\n          \n          The Silhouette and another FIGURE OPEN FIRE on Reilly.\n          \n          SWAN, 40s, crazy-brilliant, manic eyes... and one of his men,\n          pale, sweaty, wearing an EARRING, 30s, continue the barrage.\n          \n          Swan fires ONE SHOT at a time at Rice, deliberately aiming\n          not to kill him, trying to flush Reilly out.\n          \n          Rice screams as BULLETS RIP into his legs. Reilly tries to\n          reach him but can't, shots forcing him back.\n          \n          A dark-eyed man with a BEARD appears in the b.g. and stealths\n          towards Reilly from behind.\n          \n                                                                   11/10/97   6.\n          \n          \n          \n          \n          Reilly' face is in agony as Rice moans in pain. He glances\n          urgently from the gunmen to the exit behind them, to The Girl\n          lying next to him -- what's keeping them there? Obviously\n          The Girl.\n          \n          She stirs. Desperate, Reilly grabs her by the hair, shoves\n          his 9mm to her head. Using her as a shield, he drags her in\n          front of Rice to protect him.\n          \n                              REILLY\n                        (to gunmen)\n                 Drop it!\n          \n          Swan's eyes flare. He steps out into the open, gun aimed at\n          Rice, eyes locked murderously on Reilly.\n          \n                                SWAN\n                 Let her go.\n          \n          Reilly cocks his hammer, fingers trembling.   The Girl\n          stiffens, terrified.\n          \n          Beard emerges behind Reilly. Deadly silent, he raises an\n          automatic, trying to get a clear shot between machines...\n          \n                              SWAN (cont.)\n                 No, the girl!\n          \n          Reilly whirls, sees Beard, shrinks back to stay covered.\n          \n                              EARRING\n                        (to Swan)\n                 We gotta get outta here!\n          \n                              REILLY\n                        (to Swan)\n                 Tell them to drop it - now!\n          \n          A deadly stalemate.   Faraway SIRENS WAIL.\n          \n                                                                  11/10/97   7.\n          \n          \n          \n          \n                              SWAN\n                 You have no idea how sorry you're going to be.\n                        (to The Girl)\n                 Don't worry.\n          \n          Beard smolders, Earring sweats. Keeping their guns up, the\n          three men grab tool bags, work their way to the alley door\n          and slip out.\n          \n          The moment they're gone, Reilly quickly handcuffs The Girl to\n          a machine, kneels, cradles Rice.\n          \n                               RICE\n                 Mike...\n          \n                               REILLY\n                 Don't talk.\n          \n                              RICE\n                 Take your time... one day at a time, kid...\n          \n          Rice takes Reilly's hand and pats it on his wristwatch.\n          \n                              RICE (cont.)\n                 It's all I got... it's yours.\n          \n                              REILLY\n                 It don't work-\n          \n                              RICE\n                        (grinning)\n                 Ain't that a shit--\n          \n          Rice's eyes go blank, he exhales his last breath.\n          \n          Reilly winces, eyes welling up. His gaze moves at the Girl.\n          \n          The Girl stares uncomfortably, a blink of sympathy stealing\n          past her hard exterior ...\n          \n                                                                      11/10/97    8.\n          \n          \n          \n          \n          5   INT.   POLICE HEADQUARTERS - MORNING                            5\n          \n              Looking numb, out of place, Rice's blood still on his\n              trenchcoat, Reilly walks in, weaves through a chaos of\n              ringing phones, overworked cops, suspects being booked.\n          \n              Cops look up, whisper about him.\n          \n              Turning a corner, Reilly bumps into a bulldog of a cop,\n              HARRY, hustling The Girl out of a booking room. She's got a\n              shiner where Reilly hit her.\n          \n              The Girl and Reilly make eye contact, intimate somehow, a\n              flash of vulnerability and fear in The Girl's face...\n          \n                                   HARRY\n                      Hey, Reilly, Captain's looking\n                      for you.\n          \n              Reilly snaps out of it, continues on.    Reilly nods as Harry\n              hustles the girl away.\n          \n          6   INT.   CAPTAIN'S OFFICE - DAY                                   6\n          \n              Behind his desk, a work-weary captain, WINTERS, 50s, sucks\n              coffee as he grills ARTIE PLUCHINSKY, 40s, a slick suit-and-\n              tie homicide detective.\n          \n                                   WINTERS\n                      Prints?\n          \n                                   PLUCHINSKY\n                      Nothing so far.\n          \n                                   WINTERS\n                      What about the ballistics report?\n          \n                                   PLUCHINSKY\n                      Lab's backed up, we're still waiting\n                      for it.\n          \n              Reilly walks in.\n          \n                                                                   11/10/97   9.\n          \n          \n          \n          \n                              REILLY\n                 Captain...\n          \n                              WINTERS\n                 Reilly, what the hell happened out there?   Why\n                 didn't you call for back-up?\n          \n                              REILLY\n                        (at a loss, sad)\n                 Sir, I--\n          \n          \n          Reilly looks at his watch (we notice he's now wearing Rice's\n          watch). He taps it, listens to see if it's ticking.\n          \n                              WINTERS (contíd)\n                        (softening)\n                 Dammit, Rice was a good man,\n          \n                              REILLY\n                 I want to work this.\n          \n                              PLUCHINSKY\n                 You're vice, not homicide. Besides, you don't\n                 have the experience and you're too personally\n                 involved.\n          \n                              REILLY\n                 But sir--\n          \n                              WINTERS\n                 You know the rules. You're off the street\n                 `til I.A.D. clears the investigation. Now go\n                 home and clean yourself up, get some rest...\n          \n          Harry barges in, dumps a bag of personal effects on the desk.\n          \n                              HARRY\n                 She won't talk. Look at this shit, no I.D.,\n                 nothing...\n          \n          Reilly picks up a twisted plastic-wire bracelet.\n          \n                                                                   11/10/97       10.\n          \n          \n          \n          \n                                     PLUCHINSKY\n                      What's that?\n          \n                                   HARRY\n                      Bracelet she was wearing.\n          \n                                   REILLY\n                      Looks like the stuff my dad used to use to\n                      blow up tree stumps back in Scranton.\n          \n                                   PLUCHINSKY\n                      Maybe she knows your old man.\n          \n              Reilly sears into Pluchinsky.\n          \n                                   WINTERS\n                      Take it down to the Bomb Squad, Artie-\n          \n                                     REILLY\n                      I'll do it.\n          \n              Winters eyes him for a beat, relents...\n          \n                                     WINTERS\n                      Okay, kid.    Run this down to the Cave.\n          \n              Reilly spins and exits quickly.\n          \n          7   INT.   POLICE STATION - BASEMENT - DAY                          7\n          \n              Emerging from a dingy back staircase, Reilly enters a hallway\n              and moves to a door a door marked \"BOMB SQUAD.\"\n          \n          8   INT.   POLICE STATION - \"THE CAVE\" - DAY                        8\n          \n              Reilly enters into another world - a dungeon cluttered with\n              bomb paraphernalia, defusing equipment, a dog house, ping-\n              pong table, Sheryl Crow pin-up, Chicago Bears posters, Yassir\n              Arafat dartboard, a photo-shrine to dead Bomb Squaders.\n          \n              A plain, fresh-faced assistant, BEV, 30s, looks up from her\n              computer station.\n          \n                                                                      11/10/97       11.\n          \n          \n          \n          \n                                    BEV\n                       May I help you?\n          \n                                    REILLY\n                       I'm looking for the Bomb Squad.\n          \n                                    BEV\n                       They're not here.\n          \n                                    REILLY\n                       Where are they?\n          \n                                    BEV\n                       And you are...?\n          \n                                    REILLY\n                       Officer Reilly, vice.\n          \n                                    BEV\n                       There out on a call, perhaps I can help you-\n          \n                                     REILLY\n                       -Where?\n          \n                                    BEV\n                       2600 block of Lakefront.   A limousine.   But, I-\n          \n                                     REILLY\n                       Thanks.\n          \n               Reilly sprints out.   Bev tries to finish but he's gone.\n          \n          9    EXT.   CITY STREETS - DAY                                         9\n          \n               The Studebaker coughs and smokes in and out of traffic.\n          \n          10   EXT.   LAKEFRONT STREET - DAY                                  10\n          \n               A young, uniformed police OFFICER stops Reilly in front of a\n               cordoned-off section of the street.\n          \n                                                               11/10/97   12.\n          \n          \n          \n          \n                              REILLY\n                        (flashes badge)\n                 Bomb Squad.\n          \n          The Officer nods and moves the barricade out of the way,\n          Reilly hits the gas, rumbles through.\n          \n          The Studebaker swings past a fire truck, an ambulance, and\n          two squads cars.\n          \n          Two OFFICERS stand near a building with a worried BUSINESSMAN\n          and his CHAUFFEUR.\n          \n          Reilly parks 50 yards from a limo stopped in the middle of\n          the street. A Bomb Squad van and sleek black Harley Davidson\n          parked beyond it.\n          \n          Reilly hops out, heads cautiously for the limo\n          \n          POOCH, 50s, a barrel-chested ex-football player is on his\n          hands and knees looking under the limo. Red rubber ball in\n          hand, Hawaiian shirt half-tucked in, he leads around an\n          equally scruffy Labrador Retriever, SCHNOZ.\n          \n                              POOCH\n                 Smell anything, Schnoz?    Me, neither.\n          \n          T.J., 20s, a country boy inspects the open trunk.\n          \n          GLASS, 40s, clean-cut, straight-laced, easy-going smile,\n          brilliant leader of the team, steps lightly around the open\n          driver's door.\n          \n                              POOCH (contíd) (cont.)\n                 Schnoz, come here, boy.\n          \n                              T.J.\n                 Shhh, I hear something....\n          \n          Reilly stands off 25 feet.    Glass notices him.\n          \n                              GLASS\n                 Who the heck're you?\n          \n                                                                  11/10/97   13.\n          \n          \n          \n          \n                              REILLY\n                 You the Bomb Squad?\n          \n                              T.J.\n                 No, we're terrorists, stay back or we'll blow.\n          \n                              GLASS\n                 We're a bit busy at the moment, I'll give you\n                 a statement in a few minutes if we're still\n                 alive.\n          \n                              REILLY\n                        (flashes badge)\n                 Reilly, Vice. I-\n          \n                              T.J.\n                 Quiet!\n          \n          Glass and Pooch step lightly to the rear of the limo where\n          T.J. has discovered a shoebox wedged next to the spare tire.\n          T.J. leans down, puts his ear to it, nods.\n          \n                              T.J. (cont.)\n                 Ticker.\n          \n          Pooch lifts up Schnoz and holds him over the trunk.    Schnoz\n          sniffs the shoebox, whines.\n          \n                              POOCH\n                 Schnoz says it's loaded.    Good boy,\n                 Schnozzie.\n          \n          Pooch lowers Schnoz back to the ground throws him the red\n          ball, and trots back to the van, climbs up inside and sits,\n          watching.\n          \n                              GLASS\n                 Alright boys, look close.   Let's assess.\n          \n          Glass, Pooch and T.J. take a beat just to look at the\n          shoebox. Then, Glass nods for Reilly to move away.\n          \n                                                                      11/10/97        14.\n          \n          \n          \n          \n               Reilly takes a few steps back, watching as the team works\n               together - Glass in charge - a psychic connection between\n               them as they pass tools back and forth like surgeons.\n          \n                                   POOCH\n                      Whadaya think, \"boy\" or \"girl\"?\n          \n               Glass puts on magnifying spectacles -- precise, organized, a\n               detail freak as he uses a wooden probe to test the box for\n               wires, sensors.\n          \n               As the others watch, Glass rubs his fingertips\n               ritualistically and carefully eases the top off the box.\n          \n               He reaches in...   Grabs something...   Slowly pulls it out ...\n          \n               It's a Mickey Mouse alarm clock doll, a clump of unlit\n               firecrackers taped between Mickey's legs.\n          \n               The Bomb Squaders whoop and howl - all except Pooch who pulls\n               out a pack of Tums, shoves half of it in his mouth.\n          \n                                   GLASS\n                      It's a \"girl\" !\n          \n               They all crack up, hysterical.   Reilly stares in disbelief --\n               these guys are nuts!\n          \n          11   MOMENTS LATER - AT THE BOMB SQUAD VAN                             11\n          \n               In the b.g., the Officers finish getting a statement from the\n               Businessman as the still-worried Chauffeur inspects the limo.\n          \n               T.J. and Pooch load their equipment into the van as Glass\n               fills out paperwork.\n          \n                                   T.J.\n                      That guy's wife must be pretty pissed off to\n                      play a trick like that.\n          \n                                                                 11/10/97   15.\n          \n          \n          \n          \n                               POOCH\n                 No shit.   I better send Meg flowers just in\n                 case.\n          \n          T.J. and Pooch share a laugh as Reilly approaches...\n          \n                              REILLY\n                 Who's in charge here?\n          \n          Pooch points to Schnoz.\n          \n                               POOCH\n                 He is!\n          \n                              REILLY\n                 Look, it's important.\n          \n                              T.J.\n                 Make an appointment.\n          \n                              REILLY\n                 It's about this.\n          \n          Reilly holds up the bracelet.    Glass takes it, frowns.\n          \n                              GLASS\n                 Where did you get this?\n          \n                              REILLY\n                 Off a girl's wrist.    A suspect...\n          \n                               T.J.\n                 P.E.T.N ...\n          \n                               REILLY\n                 What?\n          \n                              GLASS\n                 High-grade det cord. This girl, either she's\n                 got strange taste in jewelry or she's into\n                 serious demolition.\n          \n                                                               11/10/97   16.\n          \n          \n          \n          \n                              REILLY\n                 What do you mean?\n          \n          Glass whips out a blasting cap from his utility belt, cuts\n          off a piece of the bracelet, plugs it in.\n          \n                              POOCH\n                 Fire in the hole!\n          \n          Glass tosses it into a sewer drain. A beat, then a small\n          EXPLOSION, smoke billows out of the gutter drain. The nearby\n          Officers jump, alarmed. The Bomb Squad guys laugh. Glass\n          waves to the Officers.\n          \n                              GLASS\n                 Sorry about that.\n                        (to Reilly)\n                 That's an inch of the stuff, imagine\n                 what the whole thing'd do.\n          \n                              REILLY\n                 Thanks.\n          \n          He grabs back the bracelet, turns to leave.\n          \n                              GLASS\n                 Hey wait a minute-\n          \n          Reilly jogs back to his Studebaker, climbs in and roars off\n          in a cloud of dirty smoke.\n          \n                              T.J.\n                 Vice... Jesus.\n          \n                              POOCH\n                 That'd be some explosive pussy he's got his\n                 hands on.\n          \n          Pooch and T.J. share a laugh as Glass shakes his head, climbs\n          on his Harley. The others pile into the van.\n          \n          Glass kicks-starts his hog and rumbles away, van following.\n          \n                                                                       11/10/97       17.\n          \n          \n          \n          \n          12   INT.   BAR - DAY                                                  12\n          \n               Thin crowd of day-time drinkers. Earring walks in, moves to\n               a booth where Swan and Beard are eating. Earring pulls out a\n               Gallois (French) cigarette, lights up from a book of matches.\n          \n                                    EARRING\n                       They're holding her downtown.\n          \n                                    SWAN\n                       What about the cop?\n          \n          \n               Earring shrugs.\n          \n                                    BEARD\n                       If you'd let me waste him.\n          \n                                    EARRING\n                       What if she talks?\n          \n                                    SWAN\n                       She won't.\n          \n                                    BEARD\n                       I say we split town. Come back to this job\n                       when things cool. We've got other contracts -\n                       Denver, Seattle...\n          \n               Swan slams his fist down, spilling food.     No one in bar even\n               looks up from their drink.\n          \n                                    SWAN\n                       I want her back and we do the job.\n          \n                                    BEARD\n                       I thought we agreed, the personal can't\n                       interfere with the professional.\n          \n                                    EARRING\n                       Besides, we're on a schedule and the cops\n                       won't let her go.\n          \n                                                                     11/10/97        18.\n          \n          \n          \n          \n                                    SWAN\n                       Unless we make them.\n          \n                                    EARRING\n                       Hey...\n          \n               Earring stares uneasily. Swan and Beard look up, freeze.     A\n               pair of PATROL COPS are heading directly towards them.\n          \n               Earring reaches under his jacket...   Swan grabs Earring's\n               arm, calming him.\n          \n               The Cops keep coming, then at the last moment, they veer left\n               and slide into a booth.\n          \n               Swan nods, they get up and casually slip outside.\n          \n          13   INT.   POLICE STATION - SQUAD ROOM - DAY                         13\n          \n               Reilly hurries in, interrupts Winters and Pluchinsky talking\n               over Pluchinsky's desk.\n          \n                                    REILLY\n                       Captain-\n          \n               An OFFICER shouts from across the room, holding up a phone.\n          \n                                    OFFICER\n                       Captain, line one!\n          \n                                    WINTERS\n                              (to Reilly)\n                       I thought I told you--\n          \n                                    OFFICER\n                       He says it's important, something\n                       about the Rice shooting.\n          \n               Winters snatches up the nearest phone.\n          \n                                    WINTERS\n                       Winters.\n          \n                                                                 11/10/97   19.\n          \n          \n          \n          \n          He listens, facial expression changing, getting tight.\n          \n                              WINTERS (cont.)\n                 What...?\n          \n          He punches an intercom button - the whole room stops, looks\n          up, as Swan's voice comes over the squawk box.\n          \n                              SWAN'S VOICE\n                 I said release the girl or alot of\n                 people are going to die.\n          \n          Winters signals frantically for the call to be traced -- cops\n          spring into action.\n          \n                              SWAN'S VOICE (contíd) (cont.)\n                 It's exactly two o'clock. If she's not\n                 released in one hour, people die.\n          \n                              WINTERS\n                 Wait, what do you mean--?\n          \n          Click, the line goes dead.    Winters slams down the phone - no\n          chance of a trace.\n          \n                              WINTERS (cont.)\n                 Shit!\n          \n                              PLUCHINSKY\n                 What the hell was that?\n          \n                              REILLY\n                 A ticking bomb...\n          \n                              WINTERS\n                 What?\n          \n                              REILLY\n                        (holds up bracelet)\n                 It's detonation cord, for a bomb.\n          \n                                                                       11/10/97     20.\n          \n          \n          \n          \n                                    PLUCHINSKY\n                       It's a bluff. The guy's full of\n                       crap.\n          \n                                    WINTERS\n                       We can't take the chance. Ring down to the\n                       Bomb Squad. I want them on alert.\n          \n                                       REILLY\n                       I'll do it.\n          \n                                    WINTERS\n                       Goddamit, Reilly--\n          \n                                    REILLY\n                       Look, I saw these guys, I can i.d. them.\n          \n                                    WINTERS\n                       I know you're anxious to get back but... just\n                       stay out of homicide's way or I'll have you\n                       classifying fingerprints, understand?\n          \n                                       REILLY\n                       Yes, sir.\n          \n               Reilly takes off, Pluchinsky glares.\n          \n          14   INT.   THE CAVE - DAY                                           14\n          \n               T.J. is hunched over a twisted mess of wires, untangling\n               them.   Pooch taste-tests dog biscuits for Schnoz, then feeds\n               them to him, as he talks to his wife on the phone.\n          \n               Glass is dissecting the Mickey Mouse clock.\n          \n                                    POOCH\n                       No, honey, I'm fine. Yeah, well, you're\n                       welcome. You deserve flowers more often.\n          \n               Bev glances longingly at T.J. as she gives Glass a neck rub.\n          \n                                    GLASS\n                       Bev, you're the greatest...\n          \n                                                                  11/10/97   21.\n          \n          \n          \n          \n                              T.J.\n                 Hey, I'm next.\n          \n          T.J. winks as Bev turns away, hard to get.\n          \n          Reilly bursts in.\n          \n                              BEV\n                 Hey, that's the guy-\n          \n                              REILLY\n                 We just got a bomb threat upstairs.\n          \n          This gets everyone's attention.\n          \n                              REILLY (cont.)\n                 A cop was killed last night interrupting a\n                 robbery. One of the gang was grabbed, a girl.\n                 The one I told you about with the detonation\n                 cord. Well, her friends just called in,\n                 they're threatening to waste people unless\n                 she's released in the next hour.\n          \n                              GLASS\n                 Alright, let's check it out.\n          \n                              REILLY\n                 We can start in the area where the robbery\n                 occurred.\n          \n                              T.J.\n                 Vice cop on a homicide?\n          \n                              REILLY\n                 Captain assigned me to assist you.\n          \n                               POOCH\n                 Assist?   What the hell you know about tickers\n                 anyway?\n          \n                              GLASS\n                 Easy, guys.\n                        (to Reilly)\n                              (MORE)\n          \n                                                                 11/10/97   22.\n          \n                              GLASS (cont.)\n                 Look, nothing personal, but you can't just\n                 waltz in here and expect to join the team.\n          \n                              REILLY\n                 What're you talking about?\n          \n                              GLASS\n                 When you need us, you love us, when you don't,\n                 we're shunned by the rest of the department.\n          \n                              REILLY\n                 We've got one hour.     Are you coming\n                 or not?\n          \n          The Squad just stands there.\n          \n                              REILLY (cont.)\n                 Okay, fuck you.\n          \n          Reilly walks out.   The guys look at each other.   Glass frowns\n          at the bracelet.\n          \n                              T.J.\n                 Those vice cops, around all that pussy, so\n                 pent up.\n          \n          Bev smirks at T.J.'s language, he lowers his eyes.\n          \n                              POOCH\n                        (to Glass)\n                 What do you think?\n          \n                              GLASS\n                 Call upstairs, see what you can find out.\n          \n                               POOCH\n                 Right.\n          \n                              GLASS\n                        (re: bracelet)\n                 T.J., run a trace on this, see if\n                 you can pin down where it came from. Whoever\n                 these people are, let's hope they're all talk.\n          \n                                                                    11/10/97       23.\n          \n          \n          \n          \n          15   EXT.   ALLEY - DAY                                             15\n          \n               Reilly's Studebaker is parked next to the machine shop\n               building.\n          \n          16   INT.   BUILDING - MACHINE SHOP - DAY                           16\n          \n               Reilly enters and slowly re-walks his steps from the shoot-\n               out, pausing over the chalk outline of Rice's body.\n          \n               Two FORENSICS OFFICERS silently comb over the crime scene.\n          \n               Reilly pauses, sadness overwhelming him. One of the Officers\n               nods at him, he has to turn away as the emotions come.\n          \n          17   INT.   SUNCREST MOTEL - ROOM - DAY                             17\n          \n               Sophisticated detonation equipment and weapons cover the\n               beds. Beard scowls, Earring sweats as Swan puts the\n               finishing touches on a computerized briefcase bomb.\n          \n                                    SWAN\n                       What time is it?\n          \n                                       EARRING\n                       Twenty after.\n          \n                                    BEARD\n                       Swan, it's no use. Look, we can\n                       still make Houston--\n          \n                                    SWAN\n                       Shut up!\n          \n               He sets a timer, closes the briefcase, smiles.\n          \n          18   EXT.   SUNCREST MOTEL - DAY                                    18\n          \n               Sleazy area. Briefcase in hand, Earring slips out and blends\n               into pedestrian traffic.\n          \n                                                                    11/10/97        24.\n          \n          \n          \n          \n          19   EXT.   BUSY STREET - DAY                                        19\n          \n               Earring walks on, just a man with a briefcase.\n          \n          20   EXT.   ANOTHER STREET - DAY                                     20\n          \n               Earring slows and passes a bus stop where a group of giggly\n               TEENAGE GIRLS are waiting.\n          \n               He notices a raven-haired KNOCKOUT going into the pub up\n               ahead. He grins and follows her in.\n          \n          21   INT.   PUB - DAY                                                21\n          \n               A trendy Irish Pub, a sparse lunch crowd. Earring enters,\n               spots the Knockout ordering a drink at the bar, slides onto a\n               stool next to her, and deposits the briefcase on the floor.\n          \n                                    EARRING\n                       Hey, beautiful, can I buy you some bangers and\n                       mash? Pint of Guiness?\n          \n               She gives him a once-over, turns up her nose, nods a `thanks'\n               to the Bartender delivering her white wine. Earring's smile\n               doesn't change.\n          \n                                    EARRING (cont.)\n                       Last chance. You know, even the smallest\n                       choices in life could change everything.\n          \n                                    KNOCKOUT\n                       Fuck off, pal.\n          \n               Earring grins and shrugs an `oh well'. He slides off the\n               stool, steps back, and exits... leaving the briefcase behind.\n          \n               EXT.   BAR - DAY\n          \n               Earring walks out and strolls off. He checks his watch,\n               picks up the pace. He disappears around a corner.\n          \n               Cars pass.   People stroll by.   Nothing happens.\n          \n                                                                          11/10/97    25.\n          \n          \n          \n          \n               An ordinary scene on an ordinary day.     The silence is\n               screaming.\n          \n               Suddenly - the bar EXPLODES. A FIREBALL BURSTS OUT the front\n               window, showering the street with wood and BROKEN GLASS.\n          \n          22   EXT.   BAR - DAY - LATER                                          22\n          \n               Chaotic aftermath of the bombing... sirens, flashing red\n               lights. Police hold back onlookers, Firemen clean up,\n               Paramedics carry corpses and moaning Victims out of the\n               charred, smoking ruins, into waiting ambulances.\n          \n               A black-and-white tears up. Capt. Winters leaps out, pushes\n               through to a dirt-covered FIRE CHIEF.\n          \n                                    FIRE CHIEF\n                       Eight dead, so far.\n          \n               Winters looks grim.\n          \n          23   AT THE BARRICADE                                                  23\n          \n               Reilly SCREECHES up in his Studebaker, jumps out, pushes\n               through, flashes his badge, enters the police zone.\n          \n               He stops as he sees a bloody FEMALE VICTIM being loaded into\n               an ambulance. Suddenly a voice snaps him out of it.\n          \n                                    PLUCHINSKY\n                       What're you doing here?\n          \n               Reilly faces him.\n          \n                                    PLUCHINSKY (cont.)\n                       You're offsides. Beat it.\n          \n               Reilly ignores them, starts towards the ruins.    Pluchinsky\n               shoves him back.\n          \n                                    PLUCHINSKY (cont.)\n                       I said get the fuck outta here.\n          \n                                                                  11/10/97   26.\n          \n          \n          \n          \n                              REILLY\n                 You touch me again and--\n          \n                              PLUCHINSKY\n                 And what, you'll shoot me? Hey, don't mistake\n                 me for one of your partners, I'd like to make\n                 retirement in one piece.\n          \n          Pluchinsky starts to laugh as Reilly pops him once hard in\n          the face. Pluchinsky staggers backwards, grasping his\n          bleeding nose. Reilly is ready for more as Pluchinsky starts\n          at him. They exchange a few body shots before several cops\n          swarm in and pull them apart.\n          \n          Winters hustles over.\n          \n                              WINTERS\n                 What the hell's going on?\n          \n                              PLUCHINSKY\n                 Son-of-a-bitch... my nose...   This fuck-up is\n                 interfering with-\n          \n                              WINTERS\n                 Reilly, what're you doing here?\n          \n                              REILLY\n                 Sir...\n          \n                              WINTERS\n                 I thought I told you--\n          \n                              GLASS (O.C.)\n                 He's with us.\n          \n          They all turn.\n          \n          Glass and T.J. stand there, soot-smeared, wearing utility\n          belts.\n          \n                              GLASS (cont.)\n                 We asked him to come.\n          \n                                                                11/10/97   27.\n          \n          \n          \n          \n                              T.J.\n                 Yeah, he's helping us work up a profile on\n                 this thing.\n          \n                              GLASS\n                 Hope you don't mind, Captain, might help us\n                 catch these guys that much sooner.\n                        (to Reilly)\n                 Coming?\n          \n          Reilly looks at the Captain awkwardly.\n          \n                              WINTERS\n                 Go ahead, kid.\n          \n          Reilly marches after Glass and T.J., leaving Pluchinsky\n          fuming, holding closed his bloody nose.\n          \n                              PLUCHINSKY\n                 I'm filing charges against that mother-\n          \n                              WINTERS\n                 Can it, Pluchinsky. And shove some cotton up\n                 your nose.\n          \n          ANGLE - ON THE BOMB SQUAD\n          \n          Reilly follows Glass and T.J., bewildered.\n          \n                               REILLY\n                 What was-?   Why...?\n          \n                              GLASS\n                 That cop who bought it... you didn't\n                 tell us he was your partner.\n          \n                              T.J.\n                 We've lost brothers too, we know\n                 what that's like.\n          \n                                                                     11/10/97      28.\n          \n          \n          \n          \n                                    GLASS\n                       Let's get something straight. We're doing you\n                       a favor. You're not exactly a guy we want\n                       around explosives.\n          \n                                      REILLY\n                       What?\n          \n                                    GLASS\n                       This isn't bumper cars, it's brain surgery.\n                       You wanna work with us, you do it our way,\n                       understand?\n          \n                                    REILLY\n                       Now wait just a fucking-\n          \n                                    GLASS\n                       Be cool around my men, they don't trust\n                       strangers. And try not to swear so much, it's\n                       unattractive.\n          \n               Reilly glares, tongue-tied, as they walk past the Bomb Squad\n               van and Glass' Harley, enter the wreckage.\n          \n          24   INT.   PUB - DAY                                               24\n          \n               Smoky hell. Two Firemen drag out a fire hose. Glass, T.J.\n               and Reilly approach a taped-off area where Pooch is on his\n               hands and knees, wet and dirty as he searchs for clues.\n               Schnoz sits nearby, red ball in his mouth.\n          \n                                    GLASS\n                       By the way, I'm Glass.   This is T.J., and\n                       Pooch.\n          \n                                      REILLY\n                       Mike Reilly.\n          \n                                    T.J.\n                              (offering dirty hand)\n                       Uh-huh...\n          \n               Reilly avoids the hand.\n          \n                                                               11/10/97   29.\n          \n          \n          \n          \n                              POOCH\n                 That there's Schnoz, mascot and ace bomb\n                 sniffer. Say hi, Schnozzie.\n          \n          Schnoz ignores them, sniffing a charred beam in a corner.\n          \n          T.J. points out burn patterns to Glass.\n          \n                              T.J.\n                 Flame racer, partial P.C.L. See this wave\n                 pattern? Definitely self-contained.\n          \n          Pooch sniffs dirt, tastes it.\n          \n                              POOCH\n                 Nitro, dash of Semtrex, vegetable\n                 oil ...\n          \n                              REILLY\n                 What kind of bomb was it?\n          \n                               T.J.\n                 Device.\n          \n                               REILLY\n                 Huh?\n          \n                              GLASS\n                 We don't use the b-word.      Bad luck.\n          \n                              REILLY\n                 So you're the \"Device Squad\"... and you defuse\n                 \"devices\"?\n          \n                                GLASS\n                 Treat.    We treat devices.\n          \n                              REILLY\n                        (amused)\n                 Anything else I should know?\n          \n                              GLASS\n                 Don't push it, slick.\n          \n                                                                11/10/97   30.\n          \n          \n          \n          \n          Schnoz whines and paws at something under the beam.   They\n          scramble over.\n          \n                              T.J.\n                 Pooch, can you move it?\n          \n                              POOCH\n                 I don't know...\n          \n          Pooch positions himself like a weight-lifter preparing to\n          dead-lift. He growls as he strains to lift the beam out of\n          the way. Glass and T.J. jump in and go to work with\n          toothbrushes and tweezers.\n          \n          As Reilly watches, fascinated, they uncover a scorched\n          fragment of a briefcase handle.\n          \n                              T.J.\n                 Yes, baby, yes ...\n          \n          Pooch throws Schnoz the red ball.\n          \n                              POOCH\n                 Good boy, Schnoz. Daddy loves you.\n          \n                              T.J.\n                 Scorch marks... looks like they used\n                 silly putty.\n          \n          Reilly looks to Glass for an explanation.\n          \n                              GLASS\n                 C4, plastic explosive.\n          \n                              T.J.\n                 Helluva fuck factor.\n          \n          Reilly again looks for an explanation.\n          \n                              T.J. (cont.)\n                 Don't worry, you'll pick it\n                 up.\n          \n                                                                      11/10/97    31.\n          \n          \n          \n          \n                                    POOCH\n                       Hey, check this out?\n          \n               Something glitters in the ashes. Pooch picks it up with\n               tweezers. A tiny chip. The guys stare at it, puzzled.\n          \n                                    GLASS\n                       Lemme see that.\n          \n               Glass takes it, puts on his magnifying spectacles, holds it\n               up to the light, frowns.\n          \n                                    GLASS (cont.)\n                       Hardware.\n          \n                                    T.J.\n                       Computer device?\n          \n                                   GLASS\n                       Unlikely. Probably, cash register or\n                       something.\n          \n               Pooch and T.J. go back to searching.\n          \n                                    GLASS (cont.)\n                       What can you tell us about the girl with the\n                       exploding jewelry?\n          \n               Glass turns to see Reilly on his way out.\n          \n                                    REILLY\n                       I'll get back to you.\n          \n          \n          25   INT.   POLICE HEADQUARTERS - DAY                              25\n          \n               Phones are ringing off the hook. Reilly bursts in, notices\n               Winters directing an army of cops setting up sophisticated\n               tracing equipment.\n          \n                                    WINTERS\n                       Let's go, we gotta jump on him the second he\n                       calls again.\n          \n                                                                11/10/97   32.\n          \n          \n          \n          \n          Reilly discreetly crosses the room but is intercepted by\n          Pluchinsky.\n          \n                              PLUCHINSKY\n                 You were lucky today, vice boy. Captain said\n                 to leave it alone, but just remember, I'm\n                 watching you.\n          \n                              REILLY\n                 I'm sorry, detective, but you're just not my\n                 type.\n          \n          Pluchinsky's face turns red with rage as...\n          \n          An OFFICER holds up a phone urgently.\n          \n                              OFFICER\n                 Captain, it's him!\n          \n          The room scrambles into action as Winters grabs the phone.\n          Swan's voice crackles over the squawk box.\n          \n                              WINTERS\n                 Winters here.\n          \n                              SWAN'S VOICE\n                 Don't make me send another.\n          \n                              WINTERS\n                 Look, we're prepared to talk, what\n                 do you want--?\n          \n          Click, dial tone.\n          \n                               WINTERS (cont.)\n                 Hello?   Hello?\n          \n          Winters slams down the receiver. Cops pull off their tracing\n          headphones, glance at each other uneasily.\n          \n                              WINTERS (cont.)\n                 Section commanders, in my office, now.\n          \n                                                                     11/10/97      33.\n          \n          \n          \n          \n               As the room erupts, Reilly turns to the BOOKING OFFICER.\n          \n                                    REILLY\n                       Where's the girl? The one I brought in.\n          \n                                    BOOKING OFFICER\n                       Upstairs, interrogation.\n          \n               Reilly takes off.\n          \n          26   INT.   POLICE STATION - INTERROGATION VIEWING BOOTH - DAY      26\n          \n               Wearing headphones connected to a tape recorder, a BORED COP\n               flips wearily through a comic book in front of a one-way\n               mirror. Through it can be seen a bare interrogation room\n               where The Girl sits stubbornly at a table across from Harry.\n          \n               Stubbing a butt into an overflowing ashtray, Harry rubs the\n               back of his neck, gets up and goes through a door, into the\n               viewing booth. The Bored Cop looks up, shuts off the tape\n               recorder.\n          \n                                   BORED COP\n                       Three hours. She's tough.\n          \n                                   HARRY\n                       Tough? Tough is \"Fuck you, where's\n                       my lawyer?\". This chick doesn't\n                       say boo.\n          \n               The outer door opens, Reilly walks in.\n          \n                                     REILLY\n                       Any luck?\n          \n          \n                                      HARRY\n                       Bupkiss.    Sorry about Rice.\n          \n               Reilly nods, accepts the condolence.\n          \n                                    REILLY\n                       Captain said I could give it a crack.\n          \n                                                                      11/10/97      34.\n          \n          \n          \n          \n                                    HARRY\n                       She ain't no hooker.   This is a murder\n                       investigation.\n          \n                                    REILLY\n                       She was my collar. Maybe I'll get lucky.\n                       But, if you got a problem with that, talk to\n                       the Captain.\n          \n                                    HARRY\n                       I'll be in the can.\n          \n               Harry exits. The Bored Cop eyes Reilly suspiciously as\n               Reilly crosses to the other door, yanks it open.\n          \n          27   INT.   INTERROGATION ROOM                                       27\n          \n               As Reilly enters, The Girl stiffens at the sight of him.\n          \n                                    REILLY\n                       You remember me.\n          \n               Reilly shuts the door, she doesn't respond. The Girl catches\n               a glimpse of his 9mm under his trenchcoat, she's unfazed. He\n               paces, circling her.\n          \n          \n          \n                                    REILLY (cont.)\n                       You know, your boyfriend just killed a ten\n                       year old at a bus stop, blew her head clean\n                       off.\n          \n               The Girl puts up a good front but we can see she's listening.\n          \n                                    REILLY (cont.)\n                       You're scared. You're just caught in the\n                       middle. But, we've got a guy out there\n                       wasting people just to get you back. Why? It\n                       can't be because of your looks. So, I'll be\n                       honest with you -\n          \n               Reilly goes to the table, flicks off the mic.\n          \n                                                                     11/10/97       35.\n          \n          \n          \n          \n          28   INT.   VIEWING BOOTH                                            28\n          \n               The Bored Cop doesn't notice, he's engrossed in his comic.\n          \n          29   INT.   INTERROGATION ROOM                                       29\n          \n               Reilly sits, the Girl eyes him like a trapped prey. They're\n               enemies, yet there's a strange chemistry between them.\n          \n                                    REILLY\n                       Let me be very clear about this. The police\n                       won't let you go. When your boyfriend\n                       realizes this, I have a feeling a lot of\n                       innocent people are going to die. Kids,\n                       families. I know you don't want that to\n                       happen.\n          \n               She stares, eyes dark, barely registering any emotion at all.\n               A flicker of fear, indecision. Her lips part, fighting it,\n               then she looks away, letting the fear win. Reilly flushes\n               with anger, frustration.\n          \n          30   INT.   THE CAVE - DAY                                           30\n          \n               Glass squints through a microscope. Pooch sniffs and fumbles\n               dirt samples. T.J. rocks to a Walkman as he inspects the\n               charred briefcase handle fragment. Bev is at her computer\n               searching luggage websites on the Net.\n          \n               Reilly comes in, still frustrated.\n          \n                                    POOCH\n                       We missed you, where'd you go?\n          \n               Before Reilly can answer, T.J. rips off his headphones.\n          \n                                    T.J.\n                       Fuckin A, I think I got two partial\n                       prints here!\n          \n                                     POOCH\n                       Awright!   How bout you, Glass, how's that chip\n                       shaking?\n          \n                                                                11/10/97   36.\n          \n          \n          \n          \n          They all look over.   Glass stares back darkly.\n          \n                              T.J.\n                 Glass, what is it?\n          \n                              GLASS\n                 I was wrong... this didn't come from\n                 any cash register.\n          \n                              POOCH\n                 Whadaya mean?\n          \n                              GLASS\n                 It's from an IRA.\n          \n                                POOCH\n                 Oh shit...\n          \n                                REILLY\n                 A what?\n          \n                              T.J.\n                 IRA - instant retirement account.\n          \n                              GLASS\n                 I.R.A. device. Deadliest class of tickers in\n                 existence. Computerized, multiple sensors,\n                 booby traps, the works. First showed up in a\n                 series of I.R.A. bombings in London couple\n                 years ago. One of their boys tripped it on\n                 himself and they went back to a less\n                 complicated timers. The Girl, is she Irish?\n          \n                              REILLY\n                 She's not talking. But, she could be. So,\n                 obviously, you've seen one of these devices\n                 before?\n          \n                              GLASS\n                 Only once, at Redstone.\n          \n                                REILLY\n                 Where...?\n          \n                                                                11/10/97   37.\n          \n          \n          \n          \n                              T.J.\n                 That's one more time than any of\n                 the rest of us have seen it.\n          \n                              POOCH\n                 Shit.   We're fucked.\n          \n                              GLASS\n                 Relax, Pooch, it's just a ticker,\n                 it's not personal.\n          \n                              T.J.\n                 Let's face it, we all knew it would happen\n                 sooner or later. The guy who can build a\n                 mousetrap that's better than we are ...\n          \n                              BEV\n                 Stop it...\n          \n                              T.J.\n                        (points to Reilly)\n                 And what's he doing to help?\n          \n                              POOCH\n                 Shut up, T.J.!\n          \n                              BEV\n                 Be nice Pooch!\n          \n          They all explode into a SHOUTING MATCH (except Glass who is\n          in his own world inspecting the microchip an inch from his\n          eyes). A moments mayhem until-\n          \n                              REILLY\n                 All of you, shut the fuck up!\n          \n          They all go silent, stare at Reilly (except Glass).\n          \n                              REILLY (cont.)\n                 No wonder the rest of the department doesn't\n                 want to work with you. You're nothing but a\n                 bunch of... punks.\n          \n                                                                           11/10/97    38.\n          \n          \n          \n          \n               Reilly walks out.\n          \n          31   EXT.   POLICE PARKING LOT - AFTERNOON                              31\n          \n               Reilly goes to his Studebaker, climbs in.\n          \n          32   INT.   STUDEBAKER                                                  32\n          \n               As he starts it up, the passenger door rips open.        Glass\n               jumps in, slams the door, furious.\n          \n                                    GLASS\n                       Nice performance back there. Where'd you\n                       learn that, Mike Ditka Sensitivity Seminar?\n          \n                                         REILLY\n                       Hey, look--\n          \n                                    GLASS\n                       No you look, mister! First, you don't go\n                       calling my men names. It's bad for morale.\n                       Second, us \"punks\" happen to know a heck of\n                       alot more about police work than any vice cop\n                       ever did.\n          \n                                      REILLY\n                       Oh yeah?     Prove it.\n          \n                                         GLASS\n                                (beat)\n                       Drive.\n          \n               Glass glares, a challenge.         Glaring back, Reilly guns the\n               engine, screeches away.\n          \n          33   EXT.   ALLEY - AFTERNOON                                           33\n          \n               The Studebaker rumbles up to the machine shop, parks in the\n               same haunting spot as the night before.\n          \n               Glass and Reilly climb out of the car, flashlights in hand.\n               Reilly glances around, bad memories stirring up.\n          \n                                                                      11/10/97     39.\n          \n          \n          \n          \n                                    REILLY\n                       The place has already be combed. Forensics\n                       pulled over a hundred sets of prints inside.\n          \n                                    GLASS\n                       Then let's go see what they missed.\n          \n               Pulling out a tool kit, Glass quickly picks the door lock,\n               yanks open the door, ducks inside. Reilly follows.\n          \n          34   INT.   MACHINE SHOP - AFTERNOON                                34\n          \n               Nearly pitch dark inside, shafts of late afternoon sunlight\n               glistens on the battered machines. Shadows wash over Reilly\n               and Glass as they retrace the path Reilly and Rice took the\n               night before, Glass searching intensely, Reilly getting more\n               and more uncomfortable.\n          \n                                    GLASS\n                       So what were they doing here?\n          \n                                    REILLY\n                       I don't know. You tell me?\n          \n                                    GLASS\n                       An abandoned machine shop... nice place to\n                       build devices. Low rent, too. But, you and\n                       Rice ruined their perfect hideout.\n          \n                                    REILLY\n                       You mentioned something called Redstone.\n          \n                                    GLASS\n                       Redstone's the army training center in Alabama\n                       where they send the cream of the crop to learn\n                       about tickers.\n          \n                                    REILLY\n                       Cream of the crop, huh?   You?\n          \n                                                                 11/10/97   40.\n          \n          \n          \n          \n                               GLASS\n                        (nods)\n                 Top of my class at West Point, thank you very\n                 much. Then off to Redstone. First half of\n                 the course we learned how to build devices...\n                 second half, we'd take them apart. Everything\n                 from firecrackers to hydrogen bombs.\n          \n                              REILLY\n                 Sounds like terrorist heaven.\n          \n                              GLASS\n                 There were a few guys in my class with names\n                 like John Smith, Bill Jones. I'd see them up\n                 ahead in the hall, call their name, but they\n                 wouldn't turn around. C.I.A. Funny thing,\n                 they'd always disappear after the first half\n                 of the course.\n          \n                              REILLY\n                 Just how easy is it to build a... device?\n          \n                              GLASS\n                 With a little training, you could go into a\n                 house and just from stuff in the bathroom and\n                 kitchen make something that'd finish off that\n                 alleged car of yours. Heck, didn't you ever\n                 watch MacGyver?\n          \n          Reilly looks at Glass strangely until he realizes they've\n          stopped where Rice died.\n          \n                              GLASS (cont.)\n                 So this is where it happened.\n          \n          Reilly fights the memory... eyes well up, his hand trembles\n          ever so slightly as he points out...\n          \n                              REILLY\n                 Girl was here. The guy in charge was over\n                 there with one of his men, the other one was\n                 back there.\n          \n                                                               11/10/97   41.\n          \n          \n          \n          \n          Glass gets down on his hands and knees, scans the floor.\n          Reilly talks to distract himself.\n          \n                              REILLY (cont.)\n                 Bombers, what kettle of fish are\n                 they?\n          \n                              GLASS\n                 Typical profile, usually losers, nobodies\n                 that're afraid to confront their victims.\n                 They like scaring people. That's why they\n                 call in their threats. Same mentality as\n                 obscene phone callers.\n          \n                              REILLY\n                 Except they'll blow you up if you\n                 don't play along.\n          \n                              GLASS\n                 No, ninety-ninety percent of them are full of\n                 baloney. They're into the power trip, not the\n                 damage. What scares me is that this guy is so\n                 sophisticated he could blow up whatever he\n                 wants, then disappear. The worst of the\n                 bunch, they love the challenge of creating the\n                 wildest device ever... and they love the\n                 carnage.\n          \n          Glass lays out flat on his stomach and searches deep under a\n          machine, picks up a half-smoked cigarette butt with tweezers,\n          pulls it out, kneels.\n          \n                              GLASS (cont.)\n                 Hello.\n          \n          Glass straightens it out, reads the brand name, \"Gallois\".\n          \n                              GLASS (cont.)\n                 French. Doubt somebody who worked\n                 here smoked it. Only half gone, put it out in\n                 a hurry.\n                        (glances around)\n                              (MORE)\n          \n                                                                      11/10/97       42.\n          \n                                    GLASS (cont.)\n                       Figuring the length, assuming it was one of\n                       these guys, odds are... it was lit outside.\n          \n               Glass takes off.   Reilly follows.\n          \n          35   EXT.   MACHINE SHIP - GARAGE - AFTERNOON                         35\n          \n               Glass and Reilly search the area.    Glass moves on his knees,\n               aiming the flashlight.\n          \n                                    GLASS\n                       This is where the van was parked.\n          \n                                    REILLY\n                       Yep.\n          \n                                    GLASS\n                       Then, it's gotta be here somewhere ...\n          \n                                    REILLY\n                       Look, it's a longshot...\n          \n                                         GLASS\n                       Bingo!\n          \n               Glass pinches something with his tweezers, holds it up\n               triumphantly... a used match.\n          \n               CLOSE UP - MATCH UNDER MICROSCOPE\n          \n               A jungle of giant fibers teeming with strange molecules.\n          \n                                    T.J. (O.C.)\n                       No question, it was definitely the one used to\n                       l-light the butt. Finger pressure suggests a\n                       male, average build, height... no prints,\n                       trace of nylon fiber... he wore a glove.\n          \n          36   INT.   THE CAVE - AFTERNOON                                      36\n          \n               T.J. punches keys on a computer, peers through the microscope\n               as Glass, Reilly, Pooch and Bev stand by.\n          \n                                                               11/10/97   43.\n          \n          \n          \n          \n                              T.J.\n                 This is strange.\n          \n          Two computer screens - one displays the magnified match from\n          different angles, the other spills out a stream of formulae\n          and chemical breakdowns.\n          \n                              T.J. (cont.)\n                        (reading info)\n                 Three foreign particles ... vulcanized\n                 rubber ... resin ... nitro-cellulose.\n          \n                              REILLY\n                 Nitro-cellulose. What is that, some\n                 kind of explosive?\n          \n                              GLASS\n                 Industrial wood oil. Separately, any one of\n                 these things could lead in several directions,\n                 but together ...\n          \n                               POOCH\n                 Ka-Boooom.\n          \n                              BEV\n                 They make bowling balls out of vulcanized\n                 rubber ...\n          \n                               POOCH\n                 Resin...\n          \n                               T.J.\n                 Lane oil...\n          \n                              GLASS\n                        (beat, proud of his team)\n                 A bowling alley.\n          \n          At an adjacent computer, Bev runs a scan program on the\n          match, comparing it against an endless stream of match types\n          on file. Schnoz howls awake from a nap as T.J. stabs the\n          screen as a match is made, specifications filling the screen.\n          \n                                                                       11/10/97     44.\n          \n          \n          \n          \n                                    T.J.\n                       Got it! Ace Match Company, Flint, Michigan.\n          \n                                    REILLY\n                              (amazed)\n                       You mean you just--? ... You keep a record\n                       of... matches?\n          \n                                    GLASS\n                       Hey, matches are a very big thing in our line\n                       of work.\n          \n                                    POOCH\n                              (smirks at Reilly)\n                       \"Punks\", huh?\n          \n                                    GLASS\n                       Bev, give `em a call, find out what bowling\n                       alleys they supply in this area.\n          \n                                     BEV\n                       Right!\n          \n                                    GLASS\n                       Pooch, why don't you e-mail your buddies at\n                       Langley and on the other side of the pond,\n                       see if any IRAs been popping up lately?\n          \n                                     POOCH\n                       You got it.\n          \n                                    GLASS\n                              (to Reilly)\n                       We work fast enough for you?\n          \n               Reilly mouth is opened, duly impressed.\n          \n          37   EXT.   BOWLING ALLEY - LATE AFTERNOON                           37\n          \n               The Studebaker and Harley swerve up to a run-down, windowless\n               bowling alley, park in a red zone.\n          \n               Reilly and T.J, climb out of the clunker, Glass off his bike.\n          \n                                                                     11/10/97      45.\n          \n          \n          \n          \n               T.J. checks his hair in the side mirror, sniffs his\n               underarms.\n          \n                                    REILLY\n                       T.J., what're you doing?\n          \n                                    T.J.\n                       My first undercover assignment.\n                       I gotta look good, right?\n          \n               Reilly and Glass exchange a grin, they drag T.J. inside.\n          \n          38   INT.   BOWLING ALLEY - LATE AFTERNOON                          38\n          \n               A busy Saturday afternoon crowd. Rock music blasts,\n               reverberating with the echo of crashing balls and pins. The\n               lanes are teeming with sweating bodies. Sexy waitresses in\n               skimpy outfits deliver drinks.\n          \n               T.J. ogles women as they wander through.\n          \n                                    T.J.\n                       So what're we looking for?\n          \n                                    REILLY\n                       Someone who smokes French cigarettes.\n          \n                                    T.J.\n                       In this crowd? It's gonna be Marlboros,\n                       Camels, and maybe a few Kools.\n          \n               Reilly and Glass nod, knowing it's a longshot.\n          \n               Reilly directs Glass and T.J. to split up to case the place.\n          \n               They move through the rowdy crowd, eyes catching every\n               smoker.\n          \n          39   INT. BOWLING ALLEY - POOL ROOM/BAR - LATER                     39\n          \n               The music is more redneck-rock, the crowd as well.\n          \n                                                                 11/10/97   46.\n          \n          \n          \n          \n          Glass and T.J. are in the midst of game of pool, nursing\n          bottles of Root Beer. They continue to play while eyeing\n          those coming and going.\n          \n          Reilly enters from the alley, catches Glass' eye and shakes\n          his head. He goes to the bar and orders a coke.\n          \n          He takes the drink and moves over next to Glass as T.J. lines\n          up a shot.\n          \n                              GLASS\n                 How long are we going to stay?\n          \n                              REILLY\n                 `Til we get a better lead.\n          \n          Reilly's attention is drawn to a crowded booth in the corner\n          where a few bowling alley girls block the view of the entire\n          booth.\n          \n          Glass nudges Reilly, they look over to see Pooch entering the\n          bar. He sees them and moves to the bar. T.J. sinks his shot\n          and lines up another as Reilly and Glass move to meet Pooch.\n          \n          Pooch produces a printout from his jacket, opens it up.\n          \n                              POOCH\n                 Unsolved bombings in the last year... Boston,\n                 New York, Philadelphia... but no real match\n          \n                              REILLY\n                 Insurance?\n          \n                              GLASS\n                 Political.\n          \n                              POOCH\n                 Exactly my thinking. Except, none of the\n                 targets can actually be linked to government,\n                 political or special interest concerns. They\n                 seem to be just unrelated industrial\n                 companies.   Some insured, some not.\n                              (MORE)\n          \n                                                                 11/10/97   47.\n          \n                              POOCH (cont.)\n                 But there's traces of C4 and assorted\n                 inflammatory additives found in each case.\n                 The only common denominator is the detonators\n                 all had circuitry consistent with our micro-\n                 chip.\n          \n                              GLASS\n                 Not bad for Bomb squad, eh?\n          \n                              REILLY\n                 What not bad. You've got a series of bombs,\n                 devices, that may or may not be connected, set\n                 by one or many nutjobs, who may or may not be\n                 linked.\n          \n                              GLASS\n                 Right.\n          \n                              REILLY\n                 Well... it's more than we had ten minutes ago.\n          \n                              POOCH\n                 I got a friend over at Scotland Yard who's\n                 gonna try and reach out to a undercover guy\n                 who would know if any of the rightwingers are\n                 circulating over here. Bev's following up on\n                 the briefcase manufacturers, too.\n          \n          T.J. comes over.\n          \n                              T.J.\n                 Pooch, you're up.    Rack `em.\n          \n          They look over to the pool table to see only the cue ball\n          left.\n          \n                              T.J. (cont.)\n                 Boss, you're buying the next round.\n          \n          T.J. sets his empty Root Beer bottle on the bar.\n          \n                              POOCH\n                 How're you guys doing?\n          \n                                                               11/10/97   48.\n          \n          \n          \n          \n                              REILLY\n                 Still waiting for a miracle.   Go ahead.\n          \n          Pooch and T.J. head back to the pool table where two comely\n          Gals have begun putting the balls back onto the table. T.J.\n          turns on his smile and chats them up.\n          \n                              REILLY (cont.)\n                 Quite a team you've got, where'd you find\n                 them?\n          \n                              GLASS\n                 It's a small fraternity, everyone knows\n                 everyone. I'm always recruiting. Pooch is ex-\n                 D.O.D., military expert... claymores,\n                 grenades. He played linebacker at Boston\n                 College, worked a K-9 unit - that led him to\n                 the Bomb Squad... great nose, lousy fingers,\n                 we try to keep him away from the tickers.\n                 T.J. is a heck of chemist, Texas A&M\n                 engineering degree. Found him in a Militia\n                 chat room - turns out we were both monitoring\n                 the same groups. Bev is the natural born\n                 hacker, we stole her from dispatch. She had\n                 the Cave reorganized and ultra-high-tech in\n                 two months. Captain has no idea how much\n                 hardware she's \"found\" for us.\n          \n                              REILLY\n                 You guys seem pretty tight.\n          \n                              GLASS\n                 We've gotta be. In this business, you don't\n                 exactly make alot of outside commitments.\n          \n                              REILLY\n                 Why do you do it?\n          \n                              GLASS\n                 I don't know, it's strange... it's not the\n                 best career path, but when you get the bug,\n                 there's nothing you can do about it.   See,\n                 when you beat one of these things...\n                              (MORE)\n          \n                                                                11/10/97   49.\n          \n                              GLASS (cont.)\n                 there's that one second when you realize you\n                 saw something you weren't supposed to see...\n                 this beautiful naked woman... Death... and\n                 then the rush comes, the high, cuz you realize\n                 you got away with it.\n          \n          T.J. returns, shrugs.\n          \n                              T.J.\n                 Lesbians.\n          \n          Pooch is still with the girls, showing one of them how to\n          line up a shot.\n          \n                              REILLY\n                 Looks like Pooch's doing okay.\n          \n                              T.J.\n                 He's married, he don't even know what a\n                 lesbian is.\n          \n          T.J. waves over the Bartender. He and Glass orders fresh\n          drinks as Reilly eyes pretty Blonde across the bar. She\n          picks up two beers and grabs a pack of matches off the bar.\n          \n          She turns and moves to the booth in the corner.   The bodies\n          part and Reilly catches a glimpse of Earring.\n          \n          Reilly nearly chokes on his coke as Earring takes the matches\n          from the Blonde. Earring checks his watches, rises. He\n          looks up and catches Reilly's eye - he smiles--then bolts.\n          \n          Reilly coughs up his drink and tries to get a word out,\n          pointing as Earring slips out the exit door next to the\n          booth.\n          \n          Glass pats Reilly's back as he gags, eyes blazing.\n          Finally...\n          \n                              REILLY\n                 There he goes. He was here the whole time.\n          \n                                                                     11/10/97       50.\n          \n          \n          \n          \n               Reilly pushes his way through the crowd with Glass on his\n               heels. T.J. rushes over and grabs Pooch away from the Girls\n               at the pool table.\n          \n               Reilly runs into a pair of enormous Rednecks, spilling their\n               beer on them.\n          \n               The Rednecks grab him by the collar and prepare to fight as\n               Pooch arrives and body-blocks the Rednecks away from Reilly.\n          \n               Reilly is released and he continues after Earring as Pooch\n               and the Rednecks mix it up.\n          \n               A brawl breaks out with Pooch and T.J. in the middle as\n               Reilly and Glass make it to the exit door. Reilly flies out-\n               but Glass FREEZES dead in his tracks. He spins back to look\n               at the corner booth.\n          \n               THE SHOPPING BAG sits on the floor under the table.\n          \n               Glass tenses.\n          \n               The fight escalates quickly, but Pooch employs his linebacker\n               skills and cuts down his assailant... and T.J. a natural\n               streetfighting-rabbit-puncher. They quickly dispatch the\n               Rednecks, leaving them bruised and bloodied... they rush for\n               Glass and the doorway--then lock on Glass' reaction and stop.\n          \n          40   EXT. STREET - LATE AFTERNOON                                    40\n          \n               Reilly runs out into the middle of the street.\n          \n               At the end of the block, Earring is rushing for the corner.\n          \n               Reilly draws his 9mm, aims thru the pedestrian--and fires.\n          \n               Earring is blown off his feet...\n          \n               He hits the pavement hard...\n          \n                                                                    11/10/97       51.\n          \n          \n          \n          \n          41   INT.   BAR                                                     41\n          \n               Reilly enters and sees Glass, TJ and Pooch gathered around\n               the booth in back.\n          \n                                    REILLY\n                       Say, thanks for the back up--\n          \n               The bomb squad ignores Reilly, who now realizes something is\n               wrong. He pushes his way through the bar patrons to the\n               booth.\n          \n               Glass glances up at Reilly.\n          \n                                    GLASS\n                       He set one, the son-of-a...\n          \n               TJ and Pooch exchange looks--they've never heard Glass so\n               close to swearing before.\n          \n               T.J. notices a small crowd starting to gather around the\n               booth.\n          \n                                    T.J.\n                              (calmly)\n                       Clear the area, please.\n          \n               Nobody moves.\n          \n                                    REILLY\n                              (loudly)\n                       You heard him, get the fuck away,\n                       it's a bomb!\n          \n               That does it, the crowds shriek and scatter.\n          \n               Rolling eyes at each other, the Bomb Squaders turn their\n               attention to the shopping bag sitting on the floor.\n          \n                                     GLASS\n                       Alright.   Let's assess.\n          \n               The team eyes the package for a moment...\n          \n                                                               11/10/97   52.\n          \n          \n          \n          \n          Glass makes a determination, whips out a knife, slashes the\n          bag open, revealing a computerized nightmare of a bomb\n          inside.   T.J. rubs his temples with dread.\n          \n                              TJ\n                 IRA.\n          \n          Glass puts on his magnifying spectacles, starts to probe.\n          \n          Reilly returns.\n          \n          Pooch tests hinges with his tweezers. T.J. hands Glass a\n          crimp. Pooch pries off a back panel, fingers shaking, lifts\n          it every so slightly, sees complex circuitry inside, the red\n          glow of a digital readout counting down.\n          \n                              POOCH\n                 Oh shit...\n          \n                              T.J.\n                 Fuck factor ten.\n          \n                              GLASS\n                 Okay, I'm going in, nobody breathe.\n          \n          Synchronizing his chronometer to the counter, Glass begins\n          disengaging sensor switches.\n          \n                              GLASS (cont.)\n                 Altimeter... choking coil... mercury switch...\n          \n          He clips off circuits and booby traps with bloodcurdling\n          care, peeling away layer after layer of death... shakes his\n          head with awe, respect, fear.\n          \n                              GLASS (cont.)\n                 Triple V.O.M... brilliant... this guy's a\n                 master...\n          \n          Finally he comes to the heart of the bomb, a pair of tiny\n          wires leading to the blasting cap, one yellow, one red.\n          Precious seconds tick away.\n          \n                                                                 11/10/97   53.\n          \n          \n          \n          \n                              GLASS (cont.)\n                 It's one of these wires.\n          \n                                REILLY\n                 So cut both.\n          \n                              GLASS\n                 One shuts it down, one turns arms it.\n          \n                              REILLY\n                 Which one's which?\n          \n                              GLASS\n                 I don't know. There's an old saying, when in\n                 doubt, cut the yellow wire.\n          \n          Reilly gulps. The device teeters, slightly, alarming T.J.\n          and Pooch. Glass nods. T.J. and Pooch each grab a corner of\n          the device to steady it. Reilly follows their lead and\n          kneels, goes to reach for a corner as well, one hand starts\n          to tremble.\n          \n                              GLASS (cont.)\n                 You can go back to the van if you like.\n          \n                              REILLY\n                 No, I'm with you.\n          \n          Reilly focuses and wills his hands to steady.    He grabs a\n          corner and closes his eyes, mind over matter.    Sweat streams\n          as he concentrates like never before.\n          \n          Pooch and T.J. stare at the wires with intensity.\n          \n          15 seconds, 14, 13,... Glass pulls out a clipper.\n          \n          12, 11, 10... He eases the clipper into position.\n          \n          9, 8, 7... He draws in a breath.\n          \n          Closing his eyes, he clips the yellow wire.    Reilly's eyes\n          snap open.\n          \n                                                                     11/10/97       54.\n          \n          \n          \n          \n               The counter stops on 4 - no explosion.\n          \n               Pooch and T.J. whoop and hug like drunk madmen.   Glass steps\n               away, stone-faced. Reilly follows him, wobbly.\n          \n                                     REILLY (cont.)\n                         You okay?\n          \n                                      GLASS\n                                (smiles)\n                         Is this a great job or what?\n          \n          42   EXT.   STREET - MOMENTS LATER                                   42\n          \n               Two squad cars have appeared, Officers cordon off the crime\n               scene.\n          \n               Glass watches Reilly kneeling over Earring's body digging\n               through Earring's pockets, finding nothing but cash,\n               cigarettes and matches.\n          \n                                      REILLY\n                                (at Glass)\n                         Nothing. Nothing traceable.\n          \n               INT BAR\n          \n               Pooch and T.J. have the device on the ground a few feet away\n               from the Earring's body. They delicately continue to take it\n               apart so it can be transported safely. Schnoz sits nearby,\n               watching. Pooch is on the phone with his wife...\n          \n                                      POOCH\n                         I don't know, honey. I'll see. No,\n                         everything's fine, it was nothing.\n          \n               As he says this, he lifts a chunk of C4 and sets it aside.\n               Pooch hangs up his phone.\n          \n               EXT STREET\n          \n               Pooch and TJ exit the bar, moving to Glass and Reilly.\n          \n                                                                      11/10/97     55.\n          \n          \n          \n          \n                                   POOCH (cont.)\n                      You guys hungry? The wife's got a heap of\n                      lasagna leftover.\n          \n                                   T.J.\n                             (at Reilly)\n                      What do ay say?\n          \n                                   GLASS\n                      Meg's lasagna. Good eats, Reilly.      C'mon.\n          \n               Glass notes Reilly's hands.\n          \n                                   GLASS (cont.)\n                      Good meal would go a long way to steady your\n                      system.\n          \n                                   REILLY\n                      Got work to do, don't we?\n          \n               Pooch scribbles down an address on a scrap of paper from the\n               device's shopping bag, hands it to Reilly, offering a smile.\n          \n                                   POOCH\n                      In case you change your mind.\n          \n               Reilly looks at it awkwardly, then walks away as a News van\n               arrives on the scene...\n          \n          43   EXT./INT. DOWNTOWN - STUDEBAKER - EARLY EVENING                43\n          \n               Reilly cruises into the bowels of downtown.    Makes a few\n               turns and parks.\n          \n               In the shadows of a burned out building, Reilly observes\n               several JUNKIES getting a fix from their CONNECTION.\n          \n               Reilly watches with scared, tempted eyes.\n          \n               He looks at his hands... they're trembling... catches his\n               reflection in the rear view mirror. Checks Rice's watches on\n               his wrist, taps it. Still not ticking. Ashamed, he\n               screeches away.\n          \n                                                                      11/10/97     56.\n          \n          \n          \n          \n          44   INT. POLICE STATION - OFFICE - NIGHT                           44\n          \n               A quiet Squad Room. Reilly bangs out something on a computer\n               terminal. He blazes away, typing as fast as he can. He\n               holds out his hands. Almost steady. He takes a drink from a\n               Protein Shake, returns to typing.\n          \n          45   INT.   WINTERS' OFFICE - NIGHT                                 45\n          \n               A weary Winters looks up from coffee and paperwork as Reilly\n               knocks, walks in. Reilly drops a sheaf of papers on his\n               desk.\n          \n                                      WINTERS\n                       What's this?\n          \n                                    REILLY\n                       Report on the case so far.\n          \n                                    WINTERS\n                       You know after a shooting I would normally\n                       take your badge and weapon, but Glass called\n                       in already and confirmed it was clean.\n          \n                                      REILLY\n                       Yes, sir.\n          \n                                    WINTERS\n                       But from now on, any leads on this case go to\n                       Pluchinsky. He's primary investigator and you\n                       are unofficially assigned to the Bomb Squad...\n                       you and your new friends are not to be playing\n                       detective any more. Got it?\n          \n               Reilly nods, accepting.\n          \n                                    WINTERS (cont.)\n                       I imagine as soon as they find out one of\n                       their's is dead, we'll be getting another\n                       call. So get some sleep, alright.\n          \n               Reilly nods, turns and exits.\n          \n                                                                       11/10/97    57.\n          \n          \n          \n          \n          46   INT.   SUNCREST MOTEL - ROOM - NIGHT                           46\n          \n               TIGHT on a TV - a pretty Reporter reports live from the\n               scene...\n          \n                                    REPORTER\n                       To recap, a gunman carrying what police\n                       described as a phony bomb was shot and killed\n                       less than an hour ago.\n          \n               THE ROOM\n          \n               Swan watches the TV report with Beard, eyes narrowing as he\n               sees Reilly in the crowd behind the Reporter.\n          \n                                    REPORTER (cont.)\n                       While the man's motives and identity remain a\n                       mystery, police are denying the incident is\n                       related to the explosion that ripped through a\n                       bar earlier today, killing 15 and wounding\n                       more than 30...\n          \n               Swan kicks in the TV, destroying it.\n          \n                                     BEARD\n                       She talked.\n          \n               Swan flips open a suitcase full of bomb-making materials and\n               begins to sort through...\n          \n          47   EXT.   POOCH'S HOUSE - NIGHT                                   47\n          \n               Quiet, cozy, middle class. The Harley and the Bomb Squad van\n               are parked out front. Also the Studebaker.\n          \n          48   INT.   POOCH'S HOUSE - HALLWAY - NIGHT                         48\n          \n               Reilly exits the bathroom, returns to the dining room where\n               the Bomb Squad is laughing, hoeing and haying over dessert.\n               Pooch's faithful wife, MEG, pours coffee. TOMMY and JANIE,\n               Pooch's kids, sit on Pooch's and T.J.'s knees, in their\n               pajamas.\n          \n                                                               11/10/97   58.\n          \n          \n          \n          \n                              MEG\n                 More coffee, T.J.?\n          \n                              T.J.\n                 No thanks, Meg. Hawed Pooch ever get so\n                 lucky?\n          \n                               MEG\n                 Mr. Reilly?\n          \n                               REILLY\n                 Mike.   No thanks, I'm fine.\n          \n                              POOCH\n                 Time for bed, kiddos.   Say goodnight.\n          \n                              TOMMY\n                 Can Uncle Teej tuck us in?\n          \n                              T.J.\n                 C'mon, champ, I'll even give you\n                 a piggyback.\n          \n                              JANIE\n                        (to Glass, Reilly)\n                 Goodnight Uncle Charlie, goodnight Uncle Mike.\n          \n          Janie surprises Reilly with a shy kiss, scurries upstairs\n          with after Pooch, T.J. and Tommy.\n          \n                               REILLY\n                 `Night...\n          \n          Meg clears the dishes, Schnoz is asleep on the floor. Glass\n          and Reilly are left alone.   Reilly takes a sip of coffee,\n          hand trembles ever so slightly.\n          \n                              GLASS\n                 How long were you hooked?\n          \n                               REILLY\n                 What?\n          \n                                                                 11/10/97   59.\n          \n          \n          \n          \n                              GLASS\n                 You don't have to talk about it.\n          \n          Reilly stares, then opens up slowly.\n          \n                              REILLY\n                 Pittsburgh, two years ago. Partner died, no\n                 back-up, I was too gung-ho. As usual.\n          \n                              GLASS\n                 Take a tip from the Bomb Boys, always assess,\n                 if only for a second.\n          \n                              REILLY\n                 I know. I was working a drug ring, deep\n                 cover. Played the part too well. When they\n                 pulled me out, I wasn't a cop anymore. My\n                 fiance had dumped me. Next thing I knew, I\n                 was out here on the street, doped up,\n                 auditioning for the morgue when this tough old\n                 vice cop found me, cleaned me up, gave me a\n                 second chance. He promised Captain Winters\n                 he'd look out for me.\n          \n                              GLASS\n                 Your partner?\n          \n                              REILLY\n                        (nods sadly)\n                 I guess I didn't realize how much I needed\n                 him. He kept me straight. It's been tough\n                 every second since.\n          \n          Reilly holds up his wristwatch.\n          \n                              REILLY (cont.)\n                 This was his. Doesn't work for shit, but it's\n                 keeping me straight.\n          \n                               GLASS\n                 Let me see.\n          \n                                                                    11/10/97       60.\n          \n          \n          \n          \n               Reilly gives him the watch. Glass pulls out a mini tool kit,\n               pries off the back of the watch examines the works.\n          \n                                    GLASS (cont.)\n                       Main spring's stuck. All you have to do is\n                       free the palate and realign the balance wheel.\n                       Here, you try.\n          \n                                    REILLY\n                       I terrible with mechanical things.\n          \n                                    GLASS\n                       No you're not, you just don't understand them.\n                       Here, do what I tell you.\n          \n               He holds out the mini-kit. Reilly takes it uncertainly, but\n               follows Glass' instructions.\n          \n                                    GLASS (cont.)\n                       Okay, first push the pin back with this.\n                       Good. Now while you keep it there, stick this\n                       in here and turn it slowly. Easy, that's it.\n                       Now let the pin go and line up the wheel.\n                       That should do it.\n          \n               Reilly gives it a tweak, looks at the watch, surprised.\n          \n                                    REILLY\n                       It's working.\n          \n                                    GLASS\n                       Congratulations, you just built your\n                       first ticker.\n          \n               Reilly throws Glass a surprised look.\n          \n          49   EXT.   POOCH'S HOUSE - EARLY MORNING                           49\n          \n               Sunrise breaking. Reilly and Glass have their heads under\n               the hood of the Studebaker, covered in grease, tools\n               everywhere. T.J. sits behind the wheel. Pooch and Schnoz\n               stumble out of the house to watch.\n          \n                                                                    11/10/97        61.\n          \n          \n          \n          \n                                   REILLY\n                      Okay, hit it.\n          \n               T.J. guns the engine, the Studebaker purrs like a tiger.\n          \n                                      GLASS\n                      Alright!\n          \n                                   T.J.\n                      We've created a monster.\n          \n               Glass glances at Pooch.\n          \n                                      GLASS\n                      Any word?\n          \n                                     POOCH\n                      Nothing.    Maybe they gave up, split town.\n          \n                                   REILLY\n                      Don't bet on it.\n          \n          50   EXT. POLICE STATION - MORNING                                   50\n          \n               Bustling activity...\n          \n          51   INT. THE CAVE - MORNING                                         51\n          \n               Reilly enters to find Glass, Bev, T.J. and Pooch busy at work\n               at each of their work stations. Glass moves over to watch\n               Bev's computer screen.\n          \n                                   REILLY\n                      How's the print coming?\n          \n                                   BEV\n                      One partial from the handle matches the\n                      suspect from last night. Name's Carl Taylor.\n                      Long record of arson, assault, the works. The\n                      other print - we got nothing from our data\n                      base or the FBI or CIA... still waiting for\n                      Interpol.\n          \n                                                                    11/10/97        62.\n          \n          \n          \n          \n                                    REILLY\n                       Damn.\n          \n               Bev enters another command... the computer goes to work as\n               she turns to Reilly.\n          \n                                    BEV\n                       Coffee, Mike?\n          \n                                    REILLY\n                       No thanks, Bev.\n          \n               She smiles warmly. He smiles back, T.J. eyes them, slightly\n               jealous of the moment.\n          \n               A phone rings.   Bev answers it...\n          \n                                     BEV\n                       Yes, sir.   He's here.   I'll tell him.\n          \n               Bev hangs up the phone.\n          \n                                    BEV (cont.)\n                       Mike, Captain wants to see you\n                       right away.\n          \n               Reilly heads for the door.\n          \n          52   INT.   POLICE HEADQUARTERS - MORNING                            52\n          \n               A strange, uncomfortable silence hangs over the squad room as\n               Reilly weaves past cops smoking, drinking coffee, waiting.\n               They all stare at him. Especially Pluchinsky.\n          \n          53   INT.   WINTERS' OFFICE - MORNING                                53\n          \n               Reilly walks in. Winters gestures for him to take a seat as\n               he talks on the phone.\n          \n                                    WINTERS\n                       Yes ... no, of course not but ... yes,\n                       sir, I understand.\n          \n                                                               11/10/97   63.\n          \n          \n          \n          \n          Winters hangs up.\n          \n                              WINTERS (cont.)\n                 I got a call from upstairs. They say you\n                 questioned the girl.\n          \n                                REILLY\n                 Yes, sir.\n          \n                              WINTERS\n                 She's refused to say a word to anyone. What\n                 made you think you could get her to talk?\n          \n                                 REILLY\n                 I didn't.     But I had to try.\n          \n                              WINTER\n                 Reilly, I think I've shown that I'm a patient\n                 man. Rice was your biggest fan and I've tried\n                 to honor him by giving you some slack. But\n                 you are very close to running out of slack.\n          \n                                REILLY\n                 Yes, sir.\n          \n          Winters lets this sink in, then holds up Reilly's report.\n          \n                              WINTERS\n                 I read your report. Impressive. I'd say it's\n                 got detective written all over it. But... you\n                 cross the line one more time... you're gone.\n                 Are we clear?\n          \n          Reilly, nods, shifts uncomfortably.\n          \n                              WINTERS (cont.)\n                 Now, that out of the way. The girl wants to\n                 talk to you, alone.\n          \n          Reilly is shocked.\n          \n                              WINTERS (cont.)\n                 So get going, let's close this thing.\n          \n                                                                       11/10/97    64.\n          \n          \n          \n          \n                                    REILLY\n                       Yes, sir.\n          \n               Reilly bolts off.\n          \n          54   INT.   POLICE STATION - INTERROGATION ROOM - DAY               54\n          \n               Reilly enters to find Harry and the Girl waiting for him.\n               Harry looks the Girl over, nods at Reilly.\n          \n                                    HARRY\n                       I'll be outside.\n          \n               Reilly nods, Harry exits.     Reilly sits down at the table\n               opposite her.\n          \n                                    THE GIRL\n                       Hello.\n          \n                                    REILLY\n                       Hello.\n          \n                                    THE GIRL (MARY)\n                       My name is Mary Jordan. We were hired to take\n                       out some industrial sites. Insurance.\n          \n                                    REILLY\n                       But they weren't all insured.\n          \n                                    MARY\n                       Cover.\n                              (slowly, ashamed)\n                       It was suppose to be abandoned buildings,\n                       y'know. No one was suppose to get hurt. The\n                       night you busted us...We were checking to make\n                       sure there weren't any vagrants around. Scare\n                       them away.\n          \n                                    REILLY\n                       Who is he?\n          \n                                                                     11/10/97        65.\n          \n          \n          \n          \n                                    MARY\n                       Alex Swan. My brother.\n                       The other two are called Taylor and\n                       Leveau.\n          \n                                    REILLY\n                       Taylor's dead.\n          \n               She seems relieved.\n          \n                                    REILLY (cont.)\n                       Where are they, Mary?\n          \n          \n               Mary takes a deep breath, eyes welling.\n          \n                                    MARY\n                       There is a motel downtown, near the Machine\n                       Shop... the Suncrest. Room 138.\n          \n                                     REILLY\n                       Thank you.\n          \n                                    MARY\n                       He's my brother...\n          \n               Reilly rises and moves to her.   Their eyes linger a moment, a\n               bond between them.\n          \n                                    REILLY\n                       Then why tell me?\n          \n                                    MARY\n                       People are dying.\n          \n               Reilly nods and touches her shoulder, a light squeeze.   He\n               turns and exits.\n          \n          55   EXT.   SUNCREST MOTEL - ROOM 138 - DAY                           55\n          \n               An army of cops and squad cars out front, Pluchinsky silently\n               directs a SWAT team to the door. Reilly and the Bomb Squad\n               watch from a distance as they break down the door.\n          \n                                                                 11/10/97   66.\n          \n          \n          \n          \n          SHOUTING, mayhem as the team floods into the room.\n          Pluchinsky brings up the rear. After a beat, Pluchinsky re-\n          emerges, shaking his head.\n          \n          AT THE FAR END OF THE MOTEL\n          \n          Swan and Beard watch from behind a car. Beard gives Swan a\n          dirty look and they quietly move off around the corner.\n          \n          AT THE BOMB SQUAD VAN\n          \n          Reilly and Glass are visibly disappointed.\n          \n          As the others grumble about it, Reilly notices someone across\n          the street - the Bag Lady with the pie-tin crown, holding her\n          hand out to a MAN getting into his car. The Man ignores her,\n          screeches off. The Bag Lady scribbles down his license\n          number in her pad. Glass follows Reilly's stare.\n          \n                              GLASS\n                 Ex-girlfriend?\n          \n                              REILLY\n                 Be right back.\n          \n          Reilly crosses the street, intercepts the Bag Lady as she's\n          pushing her cart away.\n          \n                              REILLY (cont.)\n                 Excuse me... I'm looking for two men who were\n                 staying at the hotel over there - one has a\n                 beard, the other's tall, thin. You wouldn't\n                 happen to have seen them, would you?\n          \n                              BAG LADY\n                 No.\n          \n                              REILLY\n                 No, of course not... well, thanks\n                 anyway. Here you go, Your Highness.\n          \n          He fishes some change out of his pocket, hands it over,\n          starts away.\n          \n                                                                      11/10/97    67.\n          \n          \n          \n          \n                                    BAG LADY\n                       On second thought, maybe I did.\n          \n               He turns back. The Bag Lady flips through her pad, stabs an\n               entry with her finger.\n          \n                                    BAG LADY\n                       Lemme see... yeah, here it is, 11:18 this\n                       morning. Very disrespectful. He used to\n                       drive a van, but he got a new car. You want\n                       the license number?\n          \n               She tears off the page, holds it out.\n          \n                                    REILLY\n                       You're beautiful!\n          \n               Reilly gives her a big kiss, races back to the Bomb Squad\n               who've been watching.\n          \n                                    REILLY\n                       We're back in business!\n          \n               They all look at him like he's nuts.\n          \n          56   INT.   POLICE SQUAD ROOM - DAY                                56\n          \n               Buzzing with action.   Harry and Pluchinsky attack Winters\n               with printouts.\n          \n                                    HARRY\n                       Ran the license plate - car was rented early\n                       this morning from a Hertz office downtown.\n          \n                                    PLUCHINSKY\n                       Alex Swan - demolitions expert, trained at\n                       Redstone, dropped out, freelanced in the\n                       middle East for awhile, then disappeared, no\n                       criminal record. The other one, Leveau, is\n                       French Canadian, he's a mercenary, record in\n                       half a dozen countries.\n          \n                                                                     11/10/97      68.\n          \n          \n          \n          \n                                    WINTERS\n                       Get out an APB, now!\n          \n               Harry moves off to the DISPATCHER as a fax machine comes to\n               life on the desk next to PLUCHINSKY. A fax spews out...\n          \n               \"WINTERS.   LET HER GO NOW... OR A BOMB'S COMING CLOSE TO\n               HOME.\"\n          \n                                    WINTERS (cont.)\n                       Jesus. Pluchinsky, get four squad cars out to\n                       my house, get my family out of there, tell my\n                       wife I'm on my way.\n          \n                                    PLUCHINSKY\n                       Yes, sir.\n          \n          57   EXT.   POLICE STATION - DAY                                    57\n          \n               Cops race to their cars. An armada of black-and-whites\n               scream out of the parking lot. Winters appears and jumps\n               into his Ford Sedan and tears out.\n          \n                                    DISPATCHER (V.0)\n                       ... suspects driving a dark green\n                       Ford Grenada, license number one\n                       Two Eight Michael Vincent Edward ...\n          \n          58   EXT. SUBURBS - DAY                                             58\n          \n               Squad cars roar up and down the streets.\n          \n               Two cars are parked out in front of one house in particular.\n          \n          59   INT. POLICE STATION - SQUAD ROOM - DAY                         59\n          \n               In the squad room, Pluchinsky and some men wait anxiously by\n               phones, computer-consoles, radio switchboard.\n          \n                                                                     11/10/97     69.\n          \n          \n          \n          \n          60   EXT. POLICE STATION - DAY                                     60\n          \n               Reilly idles in his Studebaker. T.J. and Pooch come out of\n               the parking lot in the Bomb Squad Van, Glass motors along\n               side Reilly. He guns the bike and takes the lead, followed\n               by Reilly, then the van.\n          \n               They pull out into traffic and head towards the suburbs.\n          \n          61   EXT. STREET - DAY                                             61\n          \n               Beard drives, Swan rides shotgun.   A briefcase lies on the\n               seat between them.\n          \n               As he makes a left, Beard notices the Bomb Squad Van coming\n               the other direction.\n          \n                                   BEARD\n                      We've got company.\n          \n               Swan whirls, pulls a gun as Glass and Reilly pass them.\n          \n               Reilly double-takes...\n          \n          62   INT. STUDEBAKER                                               62\n          \n               Reilly grabs his radio mic, yells into it...\n          \n                                   REILLY\n                      Glass, there they are. Pooch right in front\n                      of you, you got `em, you got `em.\n          \n          63   EXT. STREET - DAY                                             63\n          \n               Reilly SKIDS to a dead stop. Glass, up ahead tries to\n               maneuver around slowing cars as...\n          \n               The Grenada speeds down a street right in front of the Bomb\n               Squad Van.\n          \n               Pooch cranks into a turn and gives chase. Reilly and Glass\n               are pinned in by other cars. They both finally squeeze out\n               of their jams in different directions...\n          \n                                                                    11/10/97        70.\n          \n          \n          \n          \n          64   EXT./INT. ANOTHER STREET - BOMB SQUAD VAN - DAY                 64\n          \n               An excited T.J. jumps on the radio.\n          \n                                   T.J.\n                      Dispatch, this is Bomb Squad. Suspects\n                      sighted on Fern Street, two blocks from HQ.\n                      In pursuit.\n          \n                                    DISPATCHER (O.C.)\n                      Roger that.   All available units...\n          \n          65   EXT. STREET - DAY                                               65\n          \n               Beard speeds around another corner, the lumbering Van has\n               difficulty keeping up and loses sight of the Grenada for a\n               moment.\n          \n          66   EXT. ANOTHER STREET - DAY                                       66\n          \n               The Grenada speeds up, heading towards the Police Station up\n               ahead.\n          \n               The Bomb Squad Van appears and speeds up.\n          \n               ON THE SIDEWALK\n          \n               Swan stands discreetly in a phone booth, watching as...\n          \n               ON THE STREET\n          \n               Beard steers towards a parked Squad Car next to the Station -\n               on collision course. At the last second, Beard dives from the\n               moving car, hits the pavements and rolls.\n          \n               The Grenada CRASHES into the Squad Car... but no explosion.\n          \n               The Bomb Squad Van SKIDS to a stop as two uniformed Officers\n               rush out of the Station.\n          \n               Beard has rolled to his feet and is now sprinting off down\n               the street.\n          \n                                                               11/10/97   71.\n          \n          \n          \n          \n          Pooch and T.J. jump out of the Van (leaving a BARKING Schnoz\n          inside) and sprint towards the Grenada, guns drawn. Pooch is\n          quickly huffing and puffing. T.J. continues after Beard as\n          Pooch moves towards the Grenada. The uniforms follow T.J.\n          \n          Glass on his Harley appears from behind the Van. At the far\n          end of the street the Studebaker rumbles into view, followed\n          by a Squad Car, lights flashing. Everyone closing in on\n          Beard.\n          \n          T.J. aims and yells at Beard.\n          \n                              T.J.\n                 Police, freeze!\n          \n          Beard whirls around, SPRAYING automatic weapon FIRE at T.J.\n          and the Uniforms - they hit the pavement.\n          \n          A few nearby Pedestrians SCREAM and drop to the ground.\n          \n          Reilly jumps out of his Studebaker as Beard turns his FIRE on\n          him, BLOWING OUT his windshield.\n          \n          Back at the Grenada, Pooch ducks for cover by the open\n          driver's door.\n          \n          Glass runs his Harley behind a parked car.\n          \n          The Squad Car behind Reilly SKIDS to a stop and as Beard\n          shifts his aim, T.J. and Reilly each PUMP TWO SHOTS into\n          Beard's torso.\n          \n          Beard spins around, drops - dead silence on the street.\n          Relief all around. Everyone stands back up. T.J.'s jaw\n          drops at the sight of actually having hit the suspect with\n          his bullets.\n          \n          AT THE GRENADA\n          \n          Pooch exhales in relief, then hears BEEPING coming from the\n          front seat of the car. He looks in to see the briefcase\n          open, countdown ticking away.\n          \n                                                                      11/10/97      72.\n          \n          \n          \n          \n                                     POOCH\n                       Oh... damn.\n          \n               KA-BOOOOOM!!!\n          \n               The Grenada explodes in a massive FIRE-BALL, throwing nearby\n               Glass off his feet. Everyone else drops back to the ground,\n               covering their heads.\n          \n               DOWN THE STREET - AT THE PHONE BOOTH\n          \n               Swan grins and walks away down an alley.\n          \n               We can hear the CRY of Schnoz, WAILING from the front seat of\n               Van.\n          \n          67   INT.   POLICE STATION - WINTERS' OFFICE - EARLY EVENING         67\n          \n               Reilly stares off into space. Surreal silence, like a\n               dream... Reilly looks at his watch, keeps his eyes low as he\n               steals a glance at Glass in the other chair, face wracked\n               with pain, loss.\n          \n               They both look through the glass office at the squad room\n               outside, the sounds of reality fade in... phones ringing,\n               voices shouting... a tense, chaotic emergency atmosphere.\n          \n               Reilly and Glass rise as Winters walks in, closes the door.\n          \n               He sits behind his desk, lights a cigarette.\n          \n                                    WINTERS\n                       Glass, sorry about Pooch, he was a good man.\n                       We don't have time to give you a break right\n                       now, we're going ahead and-\n          \n                                    REILLY\n                       My God, you're going to use her, aren't you?\n          \n                                    WINTERS\n                              (ignoring Reilly)\n                       Glass, you're to stand by with your team.\n          \n                                                                      11/10/97     73.\n          \n          \n          \n          \n                                   REILLY\n                      I promised her she'd be safe.\n          \n                                   WINTERS\n                      It's our only option.\n          \n                                   REILLY\n                      It won't work, he'll know it's a trap...\n          \n                                   WINTERS\n                      Reilly, you're done for now. What the hell\n                      were you thinking directing the Bomb Squad\n                      Team into hot pursuit. They had no business-\n          \n                                   REILLY\n                      I know.\n          \n                                   WINTERS\n                      You've been at the center of two suspect\n                      fatalities and two Police Officer fatalities.\n                      I'll need your badge and your weapon.\n          \n               Reilly looks at Glass, there'll be no stepping in this time.\n               He glares at Winters, reaches into his jacket, pulls out the\n               badge and tosses it on Winter's desk. He pulls out his 9mm,\n               pops out the clip and open the chamber, sets it down.\n          \n          68   INT. POLICE STATION - SQUAD ROOM - EARLY EVENING               68\n          \n               Reilly and Glass trudge out, both profoundly disturbed as\n               they head across the squad room. Glass veers off.\n          \n                                   REILLY\n                      Glass--!\n          \n               Reilly stares, eyes wet, watching him disappear.\n          \n               Glancing over, he notices Bev and T.J. sitting with Meg down\n               the hall, Tommy and Janie asleep in her lap. Schnoz walks up\n               to Meg, whimpering.   Bev wraps her arm around her. T.J.\n               puts his hand on Bev's shoulder.\n          \n                                                                       11/10/97      74.\n          \n          \n          \n          \n               Pluchinsky brushes roughly past Reilly, snapping him out of\n               it. He turns, walks dejectedly out.\n          \n                                                                 DISSOLVE TO:\n          \n          69   EXT.   POLICE STATION - REAR ENTRANCE - EARLY MORNING            69\n          \n               An armored van screeches up. Doors fly open. Metro SWAT\n               Team jumps out with equipment, helmets, rush into the\n               building.\n          \n          70   INT.   POLICE STATION - SQUAD ROOM - MORNING                     70\n          \n               Thundering silence. Winters and his men wait by phones.\n               Their watches tick. So does the clock on the wall. Nothing.\n               SWAT Team Captain BENSON, huddles with his men.\n          \n               A phone rings, shattering the quiet.   Harry answers it, holds\n               it up urgently.\n          \n                                     HARRY\n                       It's him!\n          \n               Winters takes it. A new high-tech TRACER flicks on a new\n               piece of equipment.\n          \n                                    WINTERS\n                       Winters here.\n          \n               Swan's voice comes over the squawk box, growling low.\n          \n                                    SWAN'S VOICE\n                       You motherfuckers, you don't learn,\n                       do you?!\n          \n                                    WINTERS\n                       We're prepared to talk-\n          \n                                      SWAN'S VOICE\n                       Shut up!    Shut up!\n          \n               The Tracer homes in on the signal.\n          \n                                                                        11/10/97    75.\n          \n          \n          \n          \n                                    TRACER\n                       15...\n          \n                                    SWAN'S VOICE\n                       You have exactly thirty minutes to release the\n                       girl where you found her.\n          \n                                    TRACER\n                       Twelve ...\n          \n          \n                                    SWAN'S VOICE\n                       Thirty minutes.\n          \n                                    TRACER\n                       Nine ...\n          \n                                    WINTERS\n                       How do we know you'll keep your word?\n          \n               Click, dial tone.\n          \n               Winters flashes a look at the Tracer.   The Tracer yanks off\n               his headphones in utter frustration.\n          \n                                    WINTERS\n                              (to his men)\n                       Okay, let's move!\n          \n               The room erupts into action. Benson and the SWAT Team are\n               the first ones out the door...\n          \n          71   EXT.   ALLEY - DAY                                              71\n          \n               Hauntingly familiar. An unmarked police car pulls up and\n               stops behind the machine shop.\n          \n          72   EXT./INT. ALLEY - CAR                                           72\n          \n               Harry sits behind the wheel.    Mary sits in the back,\n               handcuffed to Pluchinsky.\n          \n               Pluchinsky unlocks the cuffs.   Mary's eyes flare\n          \n                                                                    11/10/97        76.\n          \n          \n          \n          \n                                   PLUCHINSKY\n                      Get out and go to the machine shop -\n          \n          \n               Mary steps out of the car. She glances around--then heads in\n               the opposite direction of the Machine Shop. Pluchinsky\n               curses. He starts to go after her, but realizes he'd better\n               clear the area. He peals out.\n          \n          73   EXT. STREET - DAY                                               73\n          \n               Undercover Men in various disguises track her from cars, and\n               on foot, communicating by hidden mics. A WINO eyes her\n               carefully, lifts a bottle to his mouth and whispers...\n          \n                                   WINO\n                      She's out of the bag.\n          \n               Mary exits the alley onto the street, searching where to go.\n               She turns down the street and moves fast, eyes darting about.\n          \n          74   EXT. STREET                                                     74\n          \n               The SWAT van is tucked into an alley...\n          \n               INSIDE THE SWAT VAN\n          \n               Winters, Benson and Team monitor the radio communication.\n          \n                                   WINO (O.C.)\n                             (on the radio)\n                      Position Four. Turning on Elm.\n          \n          75   EXT. ELM STREET - DAY                                           75\n          \n               Mary crosses the street, a Camero nearly clips her. She\n               makes it safely to the sidewalk and passes a TRUCK DRIVER\n               eating a hot dog. After she moves off...\n          \n                                    TRUCK DRIVER\n                              (speaks into sleave)\n                      Six.   She's crossing to Main.\n          \n                                                                        11/10/97      77.\n          \n          \n          \n          \n               Mary looks around quickly, blends into a crowd coming out of\n               a store and ducks inside.\n          \n                                   TRUCK DRIVER (cont.)\n                      She just went into a department store.    She's\n                      out of sight.\n          \n          76   INSIDE THE SWAT VAN                                               76\n          \n               Winters grabs the mic...\n          \n                                   WINTERS\n                      Seal the building!\n                             (to Benson)\n                      Let's move.\n          \n               The SWAT van RUMBLES to life.\n          \n          77   INT. DEPARTMENT STORE - DAY                                       77\n          \n               Mary bolts through the store, ducks through a service door.\n          \n          78   EXT. DEPARTMENT STORE - SERVICE ENTRANCE - ALLEY - DAY            78\n          \n               Mary bursts out, runs like a spooked horse.\n          \n               As she dashes to the mouth of the the alley, she runs smack\n               into the Camaro that almost hit her. It SCREECHES to a stop.\n               The passenger door flies open.\n          \n               Mary leans down and looks in, flushes. It's Swan.    He\n               reaches over and yanks her inside, TEARS away.\n          \n               The Truck Driver runs into the other end of the alley.\n          \n               He starts to give chase as Swan tosses a small package out of\n               the car. The Truck Driver dives for cover as...\n          \n               KA-BOOOOM!!!   A dumpster EXPLODES.   The Truck Driver jumps to\n               his feet...\n          \n                                                                    11/10/97        78.\n          \n          \n          \n          \n                                    TRUCK DRIVER\n                              (into sleave)\n                       We have contact. Black Camaro-\n          \n          79   INSIDE THE SWAT VAN                                             79\n          \n               The Van SPEEDS up as we hear...\n          \n                                    TRUCK DRIVER (O.C.)\n                       -license number HQW-256.\n          \n          \n          80   EXT. CITY STREETS - DAY                                         80\n          \n               From every direction, unmarked cars, squad units and the SWAT\n               Van converge on the area.\n          \n          81   INT.   CAMARO - MOVING                                          81\n          \n               Swan drives with deadly confidence, glances at Mary tenderly.\n          \n                                     SWAN\n                       You okay?\n          \n                                     MARY\n                       Alex-\n          \n                                     SWAN\n                       I know.   I warned them.\n          \n               He swerves left, then right, pulling a transmitter out of his\n               pocket.\n          \n                                    MARY\n                       What is that?\n          \n                                     SWAN\n                       Security.\n          \n               He sets a dial to 10, pushes a button.\n          \n               The transmitter counts down... 9, 8, 7...\n          \n                                                                      11/10/97     79.\n          \n          \n          \n          \n          82   EXT. ALLEY - DAY                                               82\n          \n               The Camaro tears down a one-way alley going the wrong way.\n          \n               INTERCUT WITH TRANSMITTER COUNTDOWN - 6, 5, 4...\n          \n               Undercover vehicles race after the Camero, seconds behind.\n          \n               5, 4, 3 ...\n          \n               They swerve into the alley.\n          \n               Then just as Swan whooshes out, a charge EXPLODES a stack of\n               55 gallon drums. They fall down into the path of the\n               pursuers who crash into the FLAMING DRUMS.\n          \n               The lead car EXPLODES...\n          \n          83   EXT./INT. STREET - CAMERO - MOVING - DAY                       83\n          \n               Mary looks back in horror as she's whisked away.\n          \n          84   INT.   DOWNTOWN BAR - DAY                                      84\n          \n               Dark, filthy, last stop to nowhere.\n          \n          85   INT.   BACK HALLWAY                                            85\n          \n               Drunk, dejected, looking like shit, Reilly waits for a fix\n               with a couple other JUNKIES. The TV in the bar drones in the\n               background.\n          \n               The Dealer appears and gestures to Reilly.\n          \n                                    DEALER\n                       C'mon, cowboy, you're next.\n          \n               Reilly trudges over.\n          \n                                    DEALER\n                       Okay, what's it gonna be? I got China White,\n                       Snow Flake, Ivory Pearl...\n          \n                                                                      11/10/97      80.\n          \n          \n          \n          \n               Reilly looks up sharply as he hears the TV, visible through\n               the doorway.\n          \n                                    REPORTER ON TV\n                       We're coming to you live near the scene of\n                       that latest, explosion that ripped through a\n                       downtown alley less than half an hour ago.\n          \n               Something clears behind Reilly' eyes.\n          \n                                    DEALER\n                              (impatient)\n                       Hey, asshole ...\n          \n                                    REPORTER ON TV\n                       Despite growing fears and talk of a coverup,\n                       police have sealed off the area and are\n                       refusing to comment about fatalities, or the\n                       rumor that terrorists may be involved.\n          \n               Reilly's eyes shift, mind racing.\n          \n                                    DEALER\n                       Hey, I'm talking to you--\n          \n               Suddenly himself again, Reilly bolts up, sending the Dealer\n               and his equipment scattering, and streaks off. He bursts out\n               of the front door of the bar into the glare of sunlight... we\n               can hear SIRENS not too far off.\n          \n          86   INT.   STUDEBAKER - MOVING - DAY                                86\n          \n               Driving like a maniac as usual, Reilly grabs the radio mike\n               with one hand, pulls his back-up .357 out of the glove-box.\n          \n               He listens out the window for the SIRENS, he looks up at the\n               sound of approaching HELICOPTERS.\n          \n          87   EXT.   GAS STATION - DAY                                        87\n          \n               In the service bay, a MECHANIC raises the black Camaro on a\n               hydraulic lift, out of sight from the street.\n          \n                                                                       11/10/97    81.\n          \n          \n               Out front, Swan pays an ATTENDANT, climbs into an orange U-\n               Haul truck with Mary, drives off.\n          \n               A beat, a squad car and an unmarked speed past the Gas\n               Station.\n          \n          88   EXT./INT.   STREETS - U-HAUL - MOVING                          88\n          \n               Swan brushes Mary's hair from her face.\n          \n                                      SWAN\n                      You hungry?     We could get something to eat.\n          \n               Mary shakes her head, scared.\n          \n                                   SWAN\n                      What's the matter?\n          \n                                   MARY\n                      Nothing... just tired.\n          \n               She forces a smile. Swan frowns suspiciously as he turns\n               down a service road, pulls into...\n          \n          89   EXT. SELF-STORAGE WAREHOUSE - DAY                              89\n          \n               Swan pulls up to the loading dock of the warehouse.\n          \n               INSIDE THE TRUCK CAB\n          \n                                   MARY\n                      Why are we stopping here?\n          \n                                   SWAN\n                      We're moving' on. I have to pick up the\n                      supplies. Just two little boxes.\n          \n               Mary turns white.\n          \n                                    MARY\n                      No...   No more killing.\n          \n                                      SWAN\n                      Stay here.\n          \n                                                                  11/10/97   82.\n          \n          \n          \n          \n                              MARY\n                 Alex, please.\n          \n                              SWAN\n                 Stay in the truck.\n          \n          He gets out, disappears into the building.\n          \n          Mary glances around desperately, sees a phone booth at the\n          corner. She looks back at the warehouse, the phone again,\n          terrified.\n          \n          LOADING DOCK\n          \n          Yanking her door open, Mary dashes to the booth, searches her\n          pockets. Empty. She dials zero... it rings and rings, then\n          finally...\n          \n                              OPERATOR (O.C.)\n                 Operator.\n          \n                              MARY\n                 Get me the police!\n          \n                              OPERATOR (O.C.)\n                 Is this an emergency?\n          \n                              MARY\n                 Yes! Please, hurry!\n          \n          Mary's back is to the warehouse as she waits forever.\n          \n                              SERGEANT'S VOICE\n                 Police, Sergeant Doyle speaking.\n          \n                              MARY\n                 Please, I need help, my name is--\n          \n                              SERGEANT DOYLE'S VOICE\n                 Whoa, slow down, lady. Now what's\n                 that again?\n          \n                                                                11/10/97   83.\n          \n          \n          \n          \n          Suddenly Mary sees the reflection of a face in the phone\n          booth glass. She whirls - Swan is standing behind her!\n          \n                              SWAN\n                 Who are you calling, sis?\n          \n                                MARY\n                 What?    Nobody, I-\n          \n          She tries to hang up.   Swan grabs the receiver.\n          \n                              MARY\n                 Alex, please-\n          \n                               SWAN\n                 Shut up!\n                        (into phone)\n                 Who is this?\n          \n                              SERGEANT DOYLE'S VOICE\n                 Sergeant Doyle, Metro P.D. Look, what's going\n                 on--?\n          \n          Swan's eyes turn cold, SLAMS down the phone.\n          \n                               MARY\n                 Help!\n          \n          Swan grabs Mary, dragging her with him.   A pair of TEENAGE\n          BOYS on skateboards notice, veer over.\n          \n                               BOY\n                 Hey--?\n          \n          Swan whips out his Mac-11. The Boys skate for cover as Swan\n          drags Mary back to the U-Haul.\n          \n          The open back door reveals a number of 55 gallon drums, some\n          boxes and two milk crates of C4. He SLAMS down the sliding\n          door, moves around front and shoves Mary inside.\n          \n                                                                       11/10/97     84.\n          \n          \n          \n          \n          90   INT.   STUDEBAKER - MOVING - DAY                                90\n          \n               Caught in traffic, map spread out in his lap, Reilly slams on\n               his horn.\n          \n                                    REILLY\n                       C'mon, move it.\n          \n               His police radio crackles.\n          \n                                    DISPATCHER VOICE\n                       All units, 211 reported at 8th and Sycamore.\n                       Suspect is a Caucasian male, armed with an\n                       automatic weapon, last seen heading east with\n                       female hostage in a U-Haul truck ...\n          \n               Reilly perks up, checks his map.\n          \n               Jamming the wheel, he crashes out of traffic, ripping the\n               bumper off the car in front of him, and rockets away.\n          \n               He grabs his mic, thinks, disguises his voice.\n          \n                                    REILLY\n                       Dispatch, this is Reilly.\n          \n                                     DISPATCHER VOICE\n                       Go ahead.\n          \n                                    REILLY\n                       Patch me through to the Bomb Squad.\n          \n                                    DISPATCHER VOICE\n                       Aren't you on suspension?\n          \n                                     REILLY\n                       Just do it.\n          \n                                     DISPATCHER VOICE\n                       Hang on.\n          \n               Reilly runs a red.\n          \n                                                                    11/10/97    85.\n          \n          \n          \n          \n                                      T.J.'S VOICE\n                      T.J. here.\n          \n                                   REILLY\n                      T.J., it's Reilly, put Glass on!\n          \n          91   EXT./INT. STREET - BOMB SQUAD VAN - MOVING - DAY            91\n          \n               T.J. is in the passenger seat, Bev sits in the back with\n               Schnoz, Glass drives. Glass takes the mic.\n          \n                                      GLASS\n                      What's up?\n          \n               INTERCUT WITH REILLY\n          \n                                   REILLY\n                      Where you guys at?\n          \n                                   GLASS\n                      Driving in circles, waiting for-\n          \n                                   REILLY\n                      Catch that alert? That's him in the U-Haul.\n          \n                                   GLASS\n                      How do you know?\n          \n                                   REILLY\n                      Cuz he got the girl, now he's leaving town.\n          \n                                   GLASS\n                      Should we head for the Interstate?\n          \n                                      REILLY\n                      Would you?\n          \n                                   GLASS\n                      No, I'd slip out past the hotel district,\n                      behind Greyhound...\n          \n                                      REILLY\n                      Me, too.\n          \n                                                                       11/10/97    86.\n          \n          \n          \n          \n               Reilly hangs up, fishtails around a corner, map blowing out\n               the window.\n          \n          92   EXT. STREETS - DAY                                             92\n          \n               Patrol cars, unmarked and the SWAT Van criss-cross the\n               streets in confusion...\n          \n          93   EXT. ANOTHER STREET - DAY                                      93\n          \n               T.J. speeds by in the Bomb Squad van.\n          \n          94   INT.   STUDEBAKER - MOVING - DAY                               94\n          \n               Reilly swerves onto 8th Street, eyes searching desperately.\n          \n               Rounding the rear of a huge glass luxury hotel, Reilly\n               catches a glimpse of orange disappear around a corner.\n          \n               Reilly bangs a hard right to go around the block.\n          \n                                    REILLY\n                              (into mic)\n                       Glass, Eighth Street, alley behind Grand\n                       Hotel. Cut him off.\n          \n                                    GLASS (0.C.)\n                              (on radio)\n                       You got it.\n          \n          95   EXT. ANOTHER STREET - DAY                                      95\n          \n               The Bomb Squad accelerates...\n          \n          96   INT.   STUDEBAKER - MOVING - DAY                               96\n          \n               Reilly changes channels on the radio...\n          \n                                    REILLY\n                              (into mic)\n                       All units, suspect spotted heading down alley\n                       behind Grand Hotel.\n                                    (MORE)\n          \n                                                                    11/10/97        87.\n          \n                                    REILLY (cont.)\n                             (beat)\n                      We need back-up, now.\n          \n          97   EXT./INT. STREET - SWAT VAN - MOVING - DAY                      97\n          \n               Winters is shocked at the sound of Reilly's voice.\n          \n                                   WINTERS\n                             (into mic)\n                      Reilly, what the hell are you-?\n          \n                                   REILLY (O.C.)\n                             (on radio)\n                      Fire me later. Close in and we got the\n                      bastard.\n          \n                                    WINTERS\n                      Pull back.   You're only an observer.\n          \n          98   EXT./INT. STREET - STUDEBAKER - MOVING - DAY                    98\n          \n               Reilly throws down his mic, aims at the alley ahead and\n               speeds up, then cranks into the alley, SCREECHES to a stop.\n          \n          99   EXT. ALLEY - DAY                                                99\n          \n               The U-Haul barrels down the alley. Swan sees Reilly up ahead\n               get out of his car and aim his .357\n          \n               Swan SLAMS on the brakes. Throws the vehicle into reverse.\n               Checks his mirror to see the Bomb Squad Van appear at the end\n               of the alley. He's completely pinned in.\n          \n               Glass and T.J. jump out, they are in bullet-proof vest,\n               aiming shotguns, using the van as a shield. Bev jumps out\n               with Schnoz and slips behind the van entirely.\n          \n               AT THE STUDEBAKER\n          \n               Reilly's radio CRACKLES...\n          \n                                   WINTERS (O.C.)\n                      Reilly, what's happening? Reilly! Reilly!\n                      Do not engage. We're five minutes-\n          \n                                                                     11/10/97   88.\n          \n          \n          \n          \n                                REILLY\n                          (into mic)\n                   We'll keep him pinned in, you guys hurry up!\n          \n          Reilly throws done the mic, takes aim again.\n          \n          THE U-HAUL\n          \n          idles.   Swan's rage erupts.       He climbs out with Mary in tow.\n          \n          ALLEY\n          \n          Reilly aims carefully...\n          \n          Swan keeps his Mac-11 to Mary's head. Reilly is frozen by the\n          move. Swan backs to the rear of the van. He slides up the\n          door, revealing the drums and explosives to the Bomb Squad.\n          He reaches in and grabs a remote control.\n          \n          SIRENS are coming closer, only a block or two away...\n          \n          AT THE BOMB SQUAD VAN\n          \n          Glass and T.J. drop their jaws.       They see Swan depress the\n          remote, arming the explosives.\n          \n                                 T.J.\n                   Jesus...\n          \n                                  GLASS\n                   Reilly!    He's loaded!\n          \n          ALLEY\n          \n                                REILLY\n                          (yelling)\n                   Glass, you guys take cover, goddammit!\n          \n                                SWAN\n                   I want out, right now.      Or the whole city\n                   block is gone.\n          \n                                                                11/10/97   89.\n          \n          \n          \n          \n                              GLASS\n                 Reilly, he's got enough to do it.\n          \n          Reilly leaves the cover of his car and scurries along the\n          side of the alley, escaping Swan's view.\n          \n          Swan rages.   He moves around the van, pulling Mary along.\n          \n          Swan SPRAYS a FLURRY of bullets over Reilly's head... Reilly\n          dives for cover as bullets rip the alley wall inches from his\n          face.\n          \n          Swan whirls and SPRAYS the Bomb Squad Van, dropping T.J. with\n          a shot to the leg. Bev drops to his aid. Glass grimaces,\n          having been hit in the shoulder.\n          \n          Reilly moves forward about to take the shot.\n          \n                              GLASS (cont.)\n                 Reilly, don't. He's got a pressure switch.\n                 He releases it, we're done for.\n          \n          Swan turns back to Reilly, rams his Mac-11 to her throat.\n          \n                               SWAN\n                 Drop it.\n          \n                              MARY\n                        (to Reilly)\n                 Take him!\n          \n          Mary jerks away from Swan.\n          \n          Reilly fast FIRES.\n          \n          Swan takes Reilly's SHOTS in the chest. He smiles as he\n          starts to fall, his hand starts to open up to release the\n          detonator...\n          \n          Mary dives onto Swan and grabs at the remote, clasping it in\n          her hands. Swan collapses, Mary on top of him.\n          \n                                                                11/10/97   90.\n          \n          \n          \n          \n          Reilly and Glass sprint at the U-Haul, reaching a trembling,\n          bleeding Mary.\n          \n          She clinches her jaw, fighting the grief, holding on to the\n          remote.\n          \n          Reilly reaches Mary first and puts his hands over her's - she\n          looks up into his eyes--distraught.\n          \n                              GLASS\n                 Hold on to that thing tight.\n          \n          Glass goes to the explosives and looks over the set-up.\n          \n                              GLASS (cont.)\n                 Jesus Fucking H. Christ...\n          \n          Reilly has never heard Glass swear before...\n          \n                                 REILLY\n                 Fuck factor?\n          \n                              GLASS\n                 Off the scale.\n          \n                              REILLY\n                 What do we do?\n          \n          Glass turns to Mary.\n          \n                              GLASS\n                 Can you hold it?\n          \n          She nods.   Reilly releases her gently, joining Glass at the\n          van.\n          \n                                 REILLY\n                 Talk to me.     Let's assess.\n          \n                                 GLASS\n                 Right.\n          \n                                                                 11/10/97   91.\n          \n          \n          \n          \n          Glass stares at the digital read-out on the device anchored\n          in one of the C4 crates. It reads: \"1:30, 1:29...\"\n          \n                              REILLY\n                 C'mon, talk to me! We can do it!\n          \n                               GLASS\n                 He has a timer going as back-up, in case we\n                 got a hold of the remote.\n                        (beat)\n                 Okay... first, run your fingers along\n                 the edges, feel for a sensor.\n          \n          Reilly does it the way he saw Glass do it before.\n          \n                              GLASS\n                 Good, now the other side.\n          \n                              REILLY\n                 Nothing.\n          \n                              GLASS\n                 Okay, let's go in.\n          \n          \n          1:18, 1:17, 1:16 ....\n          \n          Reilly feels around, finally finds an access hole.\n          \n          Reilly works the hole bigger.\n          \n                              GLASS (cont.)\n                 Not enough time ... gotta go for the\n                 blasting cap. Only one chance... hand\n                 entry.\n          \n                              REILLY\n                 Keep talking.\n          \n                              GLASS\n                 Close your eyes, feel your fingertips.   Tell\n                 me everything you feel.\n          \n                                                               11/10/97   92.\n          \n          \n          \n          \n          Reilly' hand disappears into the hole.\n          \n          CLOSE-UP - INSIDE THE BOMB\n          \n          His fingers snake through complex circuitry as he describes\n          each layer.\n          \n                              REILLY\n                 Wires... metal, cold... something soft...\n          \n                              GLASS\n                 Don't touch that.\n          \n          BACK TO SCENE\n          \n          The red digital numbers keep counting down: 0:38, 0:37, 0:36\n          \n                              REILLY\n                 More metal... sharp edge...\n          \n                              GLASS\n                 Stay to your left.\n          \n          Deeper, deeper.\n          \n          AT THE BOMB SQUAD VAN\n          \n          The SWAT Van and a unit arrive, Winters and Benson jump out,\n          the SWAT Team is about to follow-\n          \n                              T.J.\n                 Get outta here, Swan's down, but they're\n                 chilling a device.\n          \n          Winters looks to the action at the U-Haul, sees Reilly and\n          Glass busy at work. He nods at Benson.\n          \n          0:30, 0:29, 0:28...\n          \n          Finally Reilly' fingers touch a button object. We hear the\n          SWAT Van and the unit retreat at the end of the alley.\n          \n                                                                11/10/97   93.\n          \n          \n          \n          \n                              REILLY\n                 Something round, two wires ...\n          \n                              GLASS\n                 That's the blasting cap - good! Okay, now\n                 grab it by the base and pull it straight up.\n                 No, Wait...\n          \n                              REILLY\n                 What's wrong?\n          \n                              GLASS\n                 Too easy. There's gotta be something else in\n                 there, another cap maybe.\n          \n                              REILLY\n                 Make up your mind, trigger.\n          \n          0:19, 0:18, 0:17...\n          \n                              GLASS\n                 Ease your thumb over to the right - feel\n                 anything?\n          \n          Reilly eyes shift as his hidden fingers feel around...\n          \n                              REILLY\n                 Yeah, another round thing.\n          \n                              GLASS\n                 Okay, one of the caps turns it on,\n                 the other shuts it down.\n          \n                              REILLY\n                 Which one's which?\n          \n                              GLASS\n                 I don't know.\n          \n                                REILLY\n                 What... ?\n          \n                                                               11/10/97   94.\n          \n          \n          \n          \n                              GLASS\n                 When in doubt, pull the yellow wire.\n          \n                              REILLY\n                 How the hell do you feel yellow?\n          \n                              GLASS\n                 No excuses, just do it!\n          \n          10... Reilly glares at Glass.\n          \n          9... His face is dripping with sweat.\n          \n          8... His fingers shift back to the first cap.\n          \n          7... They close over it, ready to pull.\n          \n          6... But then they stop.\n          \n          5... Reilly frowns.\n          \n          4... Glass stabs him with a look.\n          \n          3... 2... Lightning-quick, Reilly' fingers fly back and yank\n          the second cap out of its base.\n          \n          The counter stops.    0:01.\n          \n          Reilly and Glass and stare at it, holding their breath,\n          hardly daring to believe it's true. They whoop and explode\n          with relief.\n          \n          It's over... it's finally over.\n          \n                              GLASS (cont.)\n                 Not bad, for a rookie.\n          \n                                REILLY\n                 Thanks.\n          \n          \n          \n          Reilly and Glass turn to Mary who has lost consciousness but\n          is still holding the remote tightly.\n          \n                                                                       11/10/97      95.\n          \n          \n          \n          \n                Glass looks up to see T.J. and Bev peeking from around their\n                van.\n          \n                                    GLASS\n                       All clear, but we need an ambulance!\n          \n                Bev jumps into the van to make the call as T.J. starts\n                limping towards the U-Haul. Schnoz yelps and drops from the\n                van and runs for the U-Haul.\n          \n                Reilly cradles Mary in his lap as Glass kneels and removes\n                the remote - the red light stops flashing, then turns off.\n          \n                T.J. arrives and looks down at Reilly and Mary, then at the\n                device in the U-Haul.\n          \n                                    T.J.\n                       Nice work.\n          \n                                                                    DISSOLVE TO:\n          \n          100   INT. POLICE STATION -SQUAD ROOM - DAY                          100\n          \n                The room is back to its usual bustling activity.\n          \n          101   INT. POLICE STATION - WINTER'S OFFICE - DAY                    101\n          \n                Winters is going through reports on his desk as Reilly\n                enters. Reilly is cleaned up, shaven, haircut, new suit... a\n                new man.\n          \n                Winters look up, impressed with the change.\n          \n                                    WINTERS\n                       Mayor loves a hero.\n          \n                Winters hands Reilly an envelope and a new badge.\n          \n                                    WINTERS (cont.)\n                       Just want you wanted. Your promotion, and\n                       transfer.\n          \n                                                                        11/10/97      96.\n          \n          \n          \n          \n                                    REILLY\n                       Thank you, Captain.\n          \n                Winters nods and goes back to his paperwork.\n          \n          102   INT. THE CAVE - DAY                                             102\n          \n                T.J. and Bev work closely together on a mock-device. T.J. is\n                teaching her the job. They smile warmly at each other.\n                Glass is on the computer.\n          \n                Reilly enters.\n          \n                                    BEV\n                       Hey, you look great.\n          \n                T.J. flinches, but she winks at him to calm him down.    T.J.\n                smiles... no longer threatened.\n          \n                Glass doesn't look up from his computer.\n          \n                                      GLASS\n                       You're late.\n          \n                Glass points to the work station next to him where a Bomb\n                Squad Protocol Program is waiting on the screen.\n          \n                Reilly smiles and he sits next to Glass, hands him the\n                transfer papers envelope.\n          \n                                    GLASS (cont.)\n                              (softening)\n                       Welcome to the family.\n          \n                Glass accepts the papers and shakes Reilly's hand.\n          \n                                    REILLY\n                       Nice to be here.\n          \n                                    T.J.\n                       That feeling won't last long.\n          \n                                                                11/10/97   97.\n          \n          \n          \n          \n          T.J., Glass and Bev start laughing.   After a beat, Reilly\n          joins in heartily.\n          \n                                                               FADE OUT.\n          \n \n\n\n\n\n\nTicker\nWriters :   Paul B. Margolis\nGenres :   Action.Thriller  Crime\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:37:17.471785"}